<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Birisi Sana "Blazor Nedir?" Diye Sorarsa</title>
  <description>Yeni bir on yılın arifesini çoktan geçtik ve bu on yıla girmeden önce Microsoft çok önemli geliştirmelerin altına imza attı. Açık kaynak dünyasına hızlı bir girişten sonra yıllardır devam eden Mono projesi daha da anlam kazandı. Artık elimizde Silverlight, Windows Phone, Web Forms, .Net Remoting gibi kavramlar yok. Bunların yerine yenileri ve daha fazlası geldi. Xamarin ile platform bağımsız oyunlar, mobil uygulamalar, macOS ve linux ayırt etmeksizin çalışan kodlar... Dahası da var. 2017'de başlatılan ve standart haline gelen WASM(Web Assembly), Microsoft cephesinin gözünden kaçmadı. 2018 yılında deneysel bir çalışma olarak başlayan Blazor yıllar içerisinde gelişti ve şu anda üzerine yatırım yapılması gereken(mesela on yıllık Asp.Net Web Forms tabanlı ürünlerinizi modernize etmek istiyorsanız) bir konu haline geldi. Ancak ortada önemli bir sorun var. Onu bir arkadaşına nasıl anlatırsın?</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/whoisblazor_01.jpg" alt="" align="right" /&gt;Yeni bir on yılın arifesini &amp;ccedil;oktan ge&amp;ccedil;tik ve bu on yıla girmeden &amp;ouml;nce Microsoft, milenyumun başında da yaptığı &amp;uuml;zere &amp;ouml;nemli &amp;uuml;r&amp;uuml;nlerin altına imzasını attı. A&amp;ccedil;ık kaynak d&amp;uuml;nyasına hızlı bir girişten sonra yıllardır s&amp;uuml;regelen Mono projesi daha da anlam kazandı. Artık Silverlight, Windows Phone, Web Forms, .Net Remoting gibi kavramlardan neredeyse hi&amp;ccedil; s&amp;ouml;z etmiyoruz. &amp;Uuml;stelik bazıları yıllar &amp;ouml;nce rafa kalktı. Rafa kalkanların, eskiyenlerin bıraktığı tecr&amp;uuml;be yeni nesil &amp;uuml;r&amp;uuml;nlerin başarısını artırdı.&amp;nbsp;Unity ile platform bağımsız oyunlar, Xamarin ile macOS ve linux ayırt etmeksizin &amp;ccedil;alışan kodlar vs derken .Net Core hayatımıza girerek b&amp;uuml;y&amp;uuml;k s&amp;uuml;kse yaptı.&lt;/p&gt;
&lt;p&gt;Dahası da var. 2017'de başlatılan&amp;nbsp;ve&amp;nbsp;standart haline gelen &lt;a href="https://webassembly.org/" target="_blank"&gt;WASM&lt;em&gt;(Web Assembly)&lt;/em&gt;&lt;/a&gt;&amp;nbsp;Microsoft cephesinin g&amp;ouml;z&amp;uuml;nden ka&amp;ccedil;madı. 2018 yılında deneysel bir &amp;ccedil;alışma olarak başlayan Blazor&amp;nbsp;kısa s&amp;uuml;rede evrimleşti ve şu anda yatırım yapılması gereken&amp;nbsp;bir konu haline geldi&lt;em&gt;(&amp;Ouml;rneğin&amp;nbsp;Asp.Net Web Forms tabanlı &amp;uuml;r&amp;uuml;nlerinizi modernize etmek istiyorsanız)&lt;/em&gt;&amp;nbsp;Ancak ortada &amp;ouml;nemli bir sorun var. Onu bir arkadaşına nasıl anlatırsın? (Photo by &lt;a href="https://unsplash.com/@museumsvictoria?utm_source=unsplash&amp;amp;utm_medium=referral&amp;amp;utm_content=creditCopyText"&gt;Museums Victoria&lt;/a&gt; on &lt;a href="https://unsplash.com/s/photos/history?utm_source=unsplash&amp;amp;utm_medium=referral&amp;amp;utm_content=creditCopyText"&gt;Unsplash&lt;/a&gt;)&lt;/p&gt;
&lt;p&gt;Ben 1995 yılından beri kodlama yapıyorum. Microsoft'un t&amp;uuml;m .Net s&amp;uuml;r&amp;uuml;mlerinde geliştirme yapma fırsatı buldum. C# dilinin duyrulduğu zamanlardaki .Net Framework &amp;ccedil;atısının g&amp;uuml;n&amp;uuml;m&amp;uuml;zdeki halini alıncaya kadar ge&amp;ccedil;irdiği evrimi g&amp;ouml;zlemleme fırsatı bulan şanslı programcılardanım. Ş&amp;ouml;yle bir durup geriye baktığımda beni en &amp;ccedil;ok zorlayan konunun dağıtık sistemlerde kodlama yaparken kullandığım .Net Remoting olduğunu d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum&lt;em&gt;(90ların &lt;a href="https://ieeexplore.ieee.org/document/8509170" target="_blank"&gt;dll hell sendromu&lt;/a&gt;nu d&amp;uuml;ş&amp;uuml;nmezsek)&lt;/em&gt; Sanıyorum g&amp;uuml;n&amp;uuml;m&amp;uuml;z .Net programcılarının bir &amp;ccedil;oğu onu duymamıştır.&lt;/p&gt;
&lt;p&gt;Remoting tarafındaki zorlukları&amp;nbsp;sırtını SOAP&lt;em&gt;(Simple Object Access Protocol)&lt;/em&gt;&amp;nbsp;standardına dayayan XML Web Service'ler b&amp;uuml;y&amp;uuml;k &amp;ouml;l&amp;ccedil;&amp;uuml;de kapatıyordu. Lakin y&amp;uuml;ksek performans, TCP bazlı &amp;ccedil;alışma imkanları, k&amp;uuml;&amp;ccedil;&amp;uuml;k paket boyutları gibi bazı &amp;ouml;nemli detaylar ortaya &amp;ccedil;ıkınca .Net Remoting'e başvurmadan da olmuyordu. Sonrasında Windows Communication Foundation duyuruldu. Servis tabanlı geliştirme tek bir &amp;ccedil;alışma modeline indirgendi&amp;nbsp;ve bu bana g&amp;ouml;re devrimsel bir d&amp;ouml;n&amp;uuml;ş&amp;uuml;md&amp;uuml;&lt;em&gt;(Microsoft bu tip yapısal birleşimleri sıklıkla yapar. Bakınız Unified .Net)&lt;/em&gt;&amp;nbsp;İşi g&amp;uuml;c&amp;uuml; bırakıp onu &amp;ouml;ğrenmeye, &amp;uuml;r&amp;uuml;nlerde kullanmaya başladık. Neredeyse her t&amp;uuml;r servis iletişimini destekliyor ve bunu olduk&amp;ccedil;a kolaylaştırıyordu. .Net Remoting'e g&amp;ouml;re &amp;ouml;ğrenilmesi de &amp;ccedil;ok daha kolaydı, her t&amp;uuml;rl&amp;uuml; WS-I profilini destekliyordu. SOA'cıların g&amp;ouml;zdesi haline gelmekteydi. &amp;Uuml;stelik Workflow Foundation ile birlikte ele alındığında&amp;nbsp;hafif siklet iş akış y&amp;ouml;netim mekanizmalarını da kurgulayabiliyordunuz. Bizzat &amp;ccedil;alıştığım bir kurumun iş akış şemalarını Workflow Foundaction, WCF ve Visual Studio genişletmeleri yardımıyla &amp;uuml;r&amp;uuml;nleştirdiğine şahidim.&lt;/p&gt;
&lt;p&gt;Fakat web ve mobil d&amp;uuml;nyasındaki gelişmeler daha zengin kullanıcı deneyimine sahip istemci uygulamalar istiyordu. &amp;Ouml;yle b&amp;uuml;t&amp;uuml;n bir sayfayı s&amp;uuml;rekli kullanıcı ve ana makine arasında dolaştırmak yerine istemciye inip orada &amp;ccedil;alışan ve sunucu ile kısmi haberleşen zengin arabirimli uygulamalar bekleniyordu. Uygulamaların mobil sistemlerde &amp;ccedil;evrimdışı &amp;ccedil;alışabilir olması elbette b&amp;uuml;y&amp;uuml;k bir avantajdı, lakin senkronizasyon yeni bir problem olarak karşımızdaydı. Ado.Net'in bağlantısız&lt;em&gt;(Disconnected)&lt;/em&gt; &amp;ccedil;alışan versiyonunun boy &amp;ouml;l&amp;ccedil;&amp;uuml;şebileceği bir şey değildi. Web ve mobil d&amp;uuml;nyasının dağıtım stratejisindeki cazibesi masa&amp;uuml;st&amp;uuml; uygulamaları arka plana atıyordu. Microsoft, ClickOnce ile uygulama dağıtımını kolaylaştıran merkezileşmiş bir strateji&amp;nbsp;sunmuş olsa da bu Windows odaklıydı. Bu nedenle platform bağımsızlık adına tarayıcı tarafında plug-in destekli &amp;ccedil;alışma modelini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almış ve Flash'e rakip olacağını d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml; bir politika izlemeyi ihmal etmemişti. Doksanların sonları ve milenyumun başındaki ActiveX objelerinin kullanımı artık demode olduğundan farklı bir &amp;uuml;r&amp;uuml;ne ihtiyacı vardı. Karşımıza Silverlight &amp;ccedil;ıktı. Heyecan veriyordu. Oturduk bu kez Silverlight'ı da haldır haldır &amp;ouml;ğrenmeye &amp;ccedil;alıştık. İstemci tarafında Silverlight i&amp;ccedil;in gerekli &amp;ccedil;alışma zamanı olduğu s&amp;uuml;rece işler yolunda gidiyordu. Bu arada masa&amp;uuml;st&amp;uuml; tarafı Windows Presentation Foundation &amp;ccedil;atısı ile olduk&amp;ccedil;a zenginleşmiş ve Windows işletim sisteminin sonraki s&amp;uuml;r&amp;uuml;mlerinde kullanıcı deneyimi y&amp;uuml;ksek &amp;uuml;r&amp;uuml;nler geliştirilebilir olmuştu. Yine de tarayıcılar uygulamaların kalesi gibiydi.&lt;/p&gt;
&lt;p&gt;Nitekim Javascript kodlarını her t&amp;uuml;r platform tarayıcısında &amp;ccedil;alıştıran Virtual Machine'in g&amp;uuml;c&amp;uuml; ve avantajları bir t&amp;uuml;rl&amp;uuml; yakalanamıyordu. Sunucu tarafı ile haberleşmenin zengin bir yolu iyi bir &amp;ccedil;&amp;ouml;z&amp;uuml;m olabilir miydi? Portf&amp;ouml;y&amp;uuml;m&amp;uuml;ze Rich Internet Application Services&lt;em&gt;(RIA Services)&lt;/em&gt; eklendi. Onu HTTP metodları ile sorgulanabilir verileri baz alan Data Service'ler izledi. Silverlight gibi istemciler bu servisler yardımıyla .Net Framework'&amp;uuml;n zengin imkanlarına erişebilirdi. Yine de ters giden şeyler vardı ve dikiş bir t&amp;uuml;rl&amp;uuml; tutmuyordu. Web d&amp;uuml;nyası servis iletişiminde yeni yeni şeyler denerken Silverlight&amp;nbsp;unutulmaya başlandı. İstemci ve sunucu arasındaki iletişimin par&amp;ccedil;a par&amp;ccedil;a yapılması i&amp;ccedil;in kullanılan Ajax gibi &amp;ccedil;atılar bile daha az kullanılır oldu.&lt;/p&gt;
&lt;p&gt;Derken REST&lt;em&gt;(Representational State Transfer)&lt;/em&gt;&amp;nbsp;stil servisler girdi hayatımıza. WCF ilk etapta bunu genişletme k&amp;uuml;t&amp;uuml;phaneleri ile birlikte desteklemeye &amp;ccedil;alıştı, sonrasında dahili olarak b&amp;uuml;nyesine kattı. Artık kimse Web Servislerden ya da .Net Remoting ile tasarlanmış dağıtık bileşenlerden, Silverlight ile geliştirilmiş plug-in destekli istemcilerden, Windows Presentation Foundation ya da Workflow Foundation'dan pek bahsetmiyordu. REST hızla evrimleşirken Web API&amp;nbsp;&amp;ccedil;&amp;ouml;z&amp;uuml;mleri yaygınlaşmaya başladı. İstemci ve sunucu iletişiminde anlık gelişmeleri yakalamak i&amp;ccedil;in Ajax'tan ziyade soket haberleşme &amp;ouml;ne &amp;ccedil;ıktı ve SignalR devreye girdi.&lt;/p&gt;
&lt;p&gt;D&amp;uuml;nyada o kadar &amp;ccedil;ok servis yazılmaya başlanmıştı ki&amp;nbsp;performans, y&amp;uuml;ksek cevap verme s&amp;uuml;releri, kolay &amp;ouml;l&amp;ccedil;eklenebilirlik, hatalar sonrası &amp;ccedil;abucak toparlanabilmek doğal olarak &amp;ouml;ncelikli aranan kriterler haline gelmişti. Nitekim basit bir sayfanın i&amp;ccedil;inden bile par&amp;ccedil;a par&amp;ccedil;a onlarca servis &amp;ccedil;ağrısı eş zamanlı olarak y&amp;uuml;r&amp;uuml;t&amp;uuml;l&amp;uuml;yordu. Video izleme ve m&amp;uuml;zik dinleme platformları bununla nasıl başa &amp;ccedil;ıkacaktı? Dağıtık mimarinin &amp;ccedil;akıl taşlı patikalarında &amp;ccedil;ıplak ayakla y&amp;uuml;r&amp;uuml;meyi hangi mimar isterdi. Paket boyutlarını k&amp;uuml;&amp;ccedil;&amp;uuml;ltmek lazımdı belki de.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;&amp;ouml;z&amp;uuml;mler pek &amp;ccedil;ok sefer olduğu gibi a&amp;ccedil;ık kaynak d&amp;uuml;nyasından yayılıyordu. Sekt&amp;ouml;r&amp;uuml;n &amp;ouml;nc&amp;uuml;leri yeni yeni &amp;uuml;r&amp;uuml;nler ile &amp;ouml;n&amp;uuml;m&amp;uuml;ze bir&amp;ccedil;ok şey bırakmaya devam etti. gRPC onlardan biriydi. &amp;Ccedil;ok daha y&amp;uuml;ksek performanslı bir servis haberleşmesinin yolunu a&amp;ccedil;mıştı. Onu ilk denediğim zamanlarda proto nesnesinin bir &amp;ouml;rneğini istemci tarafına da koyunca, .Net Remoting zamanlarında yaptığımıza benzer Marshall by Reference/Value yaklaşımları gelmişti aklıma.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Servis d&amp;uuml;nyasındaki gelişmeler hızla devam ederken, mobil d&amp;uuml;nyasının inanılmaz y&amp;uuml;kselişi ile karşımıza farklı farklı geliştirme modelleri &amp;ccedil;ıktı. Progressive Web App ve Single Page Application yaklaşımları g&amp;uuml;mb&amp;uuml;r g&amp;uuml;mb&amp;uuml;r yayılıyordu. Elimizden d&amp;uuml;ş&amp;uuml;rmediğimiz telefonlardaki sosyal medya hareketlerimiz&amp;nbsp;&amp;ouml;ylesine&amp;nbsp;arttı&amp;nbsp;ki, yazılım firması olmayan &amp;uuml;r&amp;uuml;n sahipleri yeni diller ve platformlar &amp;ccedil;ıkarmaya başladı. React, Vue, Go, Docker vs bu şekilde d&amp;uuml;nyamıza girdi. Microsoft bu alanda da s&amp;ouml;z sahibiydi elbette ve Angular ile SPA d&amp;uuml;nyasını desteklediğini a&amp;ccedil;ık&amp;ccedil;a g&amp;ouml;stermişti.&amp;nbsp;Fakat Microsoft'un yapması gereken &amp;ccedil;ok daha &amp;ouml;nemli bir şey vardı. Her şeyden &amp;ouml;nce bu değerli .Net platformunun ve o g&amp;uuml;zel C# dilinin Linux, macOS ayırt etmeksizin pr&amp;uuml;zs&amp;uuml;zce &amp;ccedil;alışabilir olması gerekiyordu. &amp;Uuml;cretsiz, herkesin seveceği t&amp;uuml;rden IDE'ler ile, kolayca entegre edilebilen paketlerle. Bunun i&amp;ccedil;in ş&amp;uuml;phesiz ki a&amp;ccedil;ık kaynak d&amp;uuml;nyasının g&amp;uuml;c&amp;uuml;n&amp;uuml; arkasına almalıydı. Xamarin daha da ciddiye alınmalıydı. İşte bu şekilde yeni d&amp;uuml;zene ge&amp;ccedil;ildi.&lt;/p&gt;
&lt;p&gt;Velhasıl herkesin ortak problemleri hep aynı konular &amp;uuml;zerinde yoğunlaşıyordu. Kullanıcı sayıları fazla, istekleri sınırsızdı. Mobil uygulamalar geliştirme platformlarını&amp;nbsp;zorluyordu. Performans i&amp;ccedil;in bulut &amp;ccedil;&amp;ouml;z&amp;uuml;mler ucuz g&amp;ouml;r&amp;uuml;nse de pahalıya patlıyordu. Ağ trafiği her zaman sıkıntılı bir konuydu ve par&amp;ccedil;ala y&amp;ouml;net şeklindeki dağıtık yaklaşım mimarilerini uygulama ve &amp;ouml;ğrenme maliyetleri de az değildi. Metodolojiler değişmekte &amp;ccedil;evik olunmaktaydı. Javascript, Node ile sunucu tarafını etkili kullanarak &amp;ouml;ne ge&amp;ccedil;iyor ama yine de eş zamanlı hareketlerin &amp;ccedil;oğalması, Go ve Rust gibi &amp;ouml;ğrenilmesi zorlu dillerle bir takım &amp;ccedil;&amp;ouml;z&amp;uuml;mler geliştirmeyi mecbur kılıyordu. Sunucular yetersiz gelmekte d&amp;uuml;nyanın bir&amp;ccedil;ok k&amp;ouml;şesine yeni veri merkezleri a&amp;ccedil;ılmaktaydı.&lt;/p&gt;
&lt;p&gt;Bu uzun ve kronolojik sıralamaya yer yer uymayan&amp;nbsp;kurguda sizlere zihnimi a&amp;ccedil;maya &amp;ccedil;alıştım. Hikayede değinmediğim, unuttuğum bir&amp;ccedil;ok kavram da oldu&lt;em&gt;(Mesela Javascript'te zorlanıyoruz diye bize verilen Typescript)&lt;/em&gt;&amp;nbsp;Ve sanıyorum ki hi&amp;ccedil; &lt;strong&gt;Windows Forms&lt;/strong&gt; demedim. Halbuki &amp;ccedil;ok &amp;ouml;nemli bir detaydı benim gibi yıllanmış programcıların hayatında. Her şeyden &amp;ouml;nce d&amp;uuml;nyanın belki de en &amp;ccedil;ok kullanılan işletim sistemi &amp;uuml;zerinde p&amp;uuml;r&amp;uuml;zs&amp;uuml;z &amp;ccedil;alışırdı. Kullanıcı dostu&amp;nbsp;formlar geliştirmek i&amp;ccedil;in Delphi doğasından kopup gelen Anders'in ekibinin zengin bileşenlerini s&amp;uuml;r&amp;uuml;kleyip bırakmak yeterliydi. &amp;Ccedil;evrimdışı &amp;ccedil;alışabilmek doğasında vardı. Performansı, y&amp;uuml;klendiği makinenin g&amp;uuml;c&amp;uuml;ne bağlıydı ve dağıtımı zordu belki ama pekala sunucular ile de konuşabiliyordu. Bazen kapalı bir ağ sisteminde bazen internete a&amp;ccedil;ık bir odadaki PC'de g&amp;uuml;l gibi yaşıyordu.&lt;/p&gt;
&lt;p&gt;Ne var ki HTML ve Web standartları o kadar başarılıydı ki&amp;nbsp;daha doksanlı yılların sonlarından itibaren Windows Forms'un y&amp;uuml;z&amp;uuml;ne pek de bakmayışımızı haklı &amp;ccedil;ıkartıyorlardı. D&amp;uuml;ş&amp;uuml;n&amp;uuml;n bir; &amp;ccedil;oğumuz ofis uygulamalarını web tabanlı tarayıcılardan kullanıyoruz. Bulut servis sağlayıcılarının yine tarayıcılarında &amp;ccedil;alışan IDE'lerinde kodlama yapıyoruz. Bir PDF dosyasını bile tarayıcıda a&amp;ccedil;ıp yazıcı ile bastırabiliyoruz. Kocaman ekranlarda a&amp;ccedil;tığımız web sayfalarını, minik mobil ekranlarda yine aynı tasarım deneyimini kaybetmeden gezebiliyoruz. Web'in nimetlerini d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde bu muazzam bir şey elbette.&lt;/p&gt;
&lt;p&gt;Peki ya Blazor! Tarayıcıda &amp;ccedil;evrimdışı &amp;ccedil;alışabildiği de d&amp;uuml;ş&amp;uuml;n&amp;uuml;lecek olursa o&amp;nbsp;g&amp;uuml;nlere d&amp;ouml;n&amp;uuml;ş i&amp;ccedil;in geliştirilmiş olabilir mi? Yoksa Silverlight'ın yeni bir versiyonu mu duruyor karşımızda? Kısa s&amp;uuml;recek bir hayal mi yoksa? Aslında hi&amp;ccedil;biri değil. Fikir olarak benzerlikler olsa da bu kez Microsoft hedefi tam on ikiden vurdu diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum&lt;em&gt;(Umarım on yıl sonra bu yazıya uğrayıp, "Vuramadı" diye not almam)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Benim de mutlak suretle &amp;ouml;ğrenmem gereken bir uygulama &amp;ccedil;atısı Blazor. Sahiplenmek değil ama en azından farkına varmam gereken bir &amp;ccedil;&amp;ouml;z&amp;uuml;m. Onu &amp;ouml;ğrenmek i&amp;ccedil;in birka&amp;ccedil; kitaba, bir Pluralsight eğitimine ve bazı dergi yazılarına bakıyorum. Kendimce notlar da alıyorum. Aşağıdaki mektubu yazarken kullandığım kaynakları yazının sonunda bulabilirsiniz. Bilgi vermesi dileğiyle.&lt;/em&gt;&lt;/p&gt;
&lt;h2&gt;Kimsin Sen Blazor?&lt;/h2&gt;
&lt;p&gt;Sevgili yazılım sevdalısı merhaba, Ben Blazor.&lt;/p&gt;
&lt;p&gt;2018 yılında Microsoft'un uzak diyarlardaki bir ofisinde d&amp;uuml;nyaya geldim. Amacım Angular, React ve Vue gibi Single Page Application tabanlı programlar geliştirmeni kolaylaştırmak. Bunu yaparken Asp.Net Core Web &amp;ccedil;atısının nimetlerini de sana sunuyorum. &amp;Uuml;stelik bunu yıllardır kullandığın C# ve Razor bileşenleri ile ger&amp;ccedil;ekleştirebilirsin. Yanına azcık HTML ve CSS de koyabilirsin. İster Windows&amp;ccedil;u ol ister Xamarinci, ister Web Formscu ol ister MVCci fark etmez ;) Beni kolayca &amp;ouml;ğrenebilirsin. Daha da g&amp;uuml;zel bir şey s&amp;ouml;yleyeyim mi? Benimle birlikte geliştirdiğin uygulamaları tarayıcı &amp;uuml;st&amp;uuml;nde &amp;ccedil;evrimdışı &amp;ccedil;alışacak şekilde modelleyebilirsin&lt;em&gt;(Blazor WebAssembly)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Ama sana sunucu &amp;uuml;st&amp;uuml;nden &amp;ccedil;alışan klasik bir model de sunuyorum&lt;em&gt;(Blazor Server)&lt;/em&gt; Hangisini tercih edersen artık. Ayrıca arkadaşım Xamarin ile hibrid &amp;ccedil;&amp;ouml;z&amp;uuml;mler i&amp;ccedil;in de yardımcı olurum. Mobil d&amp;uuml;nyasını unutmuş değilim. Tarayıcı &amp;uuml;st&amp;uuml;nde &amp;ccedil;alışan par&amp;ccedil;alarım i&amp;ccedil;in Javascript kullanmana gerek yok. Ger&amp;ccedil;ekten yok! Sadece C# dilini kullanarak istediğin&amp;nbsp;&amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; geliştirebilirsin. Yine de olur ya Javascript paketleri ile konuşman gerekir, o zaman Javascript Interoperability&lt;em&gt;(JS Interop)&lt;/em&gt; isimli bir ara&amp;ccedil; da sunuyorum. .Net i&amp;ccedil;inden Unmanaged bir kod par&amp;ccedil;asını&lt;em&gt;(mesela bir Win32 sistem fonksiyonunu)&lt;/em&gt; &amp;ccedil;ağırmak gibi bir şey aslında.&amp;nbsp;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Benimle pek &amp;ccedil;ok t&amp;uuml;rde&amp;nbsp;program geliştirebilirsin. Tetris, Astreoid, Diablo, Flappy Bird gibi oyunlar, i&amp;ccedil;erik y&amp;ouml;netim sistemleri&lt;em&gt;(CMS-Content Management System)&lt;/em&gt;, IoT&lt;em&gt;(Internet of Things)&lt;/em&gt;&amp;nbsp;s&amp;uuml;r&amp;uuml;c&amp;uuml;leri, Electron ile hibrid &amp;ccedil;&amp;ouml;z&amp;uuml;mler, mobil uygulamalar, elektronik ticaret siteleri, ofis programları, kod yazma ara&amp;ccedil;ları ve daha neler neler. Daha&amp;nbsp;fazla detay ve &amp;ouml;rnek&amp;nbsp;kod i&amp;ccedil;in &lt;a href="https://github.com/AdrienTorris/awesome-blazor" target="_blank"&gt;şuradaki repoya uğra&lt;/a&gt;yabilirsin.&amp;nbsp;Hatta istersen&amp;nbsp;o repodaki uygulamalara kolayca ulaşabileceğin ve yine Blazor ile yazılmış bir tarayıcı da kullanbilirsin ki &lt;a href="https://jsakamoto.github.io/awesome-blazor-browser/" target="_blank"&gt;ona da şu adresten ulaşabilirsin&lt;/a&gt;.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/whoisblazor_07.jpg" alt="" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Benim en &amp;ouml;nemli yapı taşlarımdan birisi de Razor bileşenleri&lt;em&gt;(component)&lt;/em&gt;. HTML, C# ve CSS &amp;uuml;&amp;ccedil;lemesini kullanabileceğin Razor bileşenleri sayfandaki bir par&amp;ccedil;a, sayfanın kendisi, bir dialog penceresi veya bir form olabilir. MVC ve Razor Pages i&amp;ccedil;in tasarladığın bileşenler varsa onları benimle de kullanabilirsin. Şimdilik hazır bileşen setim &amp;ccedil;ok g&amp;uuml;&amp;ccedil;l&amp;uuml; olmayabilir ama &amp;ccedil;evreden bir&amp;ccedil;ok firmanın bu alanda sunduğu paketler mevcut. Telerik ve DevExpress onlardan sadece ikisi. Bu firmaların Asp.Net ve Windows Form kontrollerini onlarca yıl kullandın. Tecr&amp;uuml;belerini biliyorsun. Şimdi sana sunduğum geliştirme modellerimi anlatmak istiyorum.&lt;/p&gt;
&lt;h2&gt;Blazor WebAssembly&lt;/h2&gt;
&lt;p&gt;Benim en &amp;ccedil;ok kıskandıkları &amp;ouml;zelliğim bu. Ona Client-Side Blazor dedikleri de oluyor. Amacı Javascript yazmana gerek kalmadan C# kodlarının tarayıcıda doğrudan &amp;ccedil;alıştırılmasını sağlamak. Bu Typescript kodlarının istemci i&amp;ccedil;in Javascript'e d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmesinden farklı bir şey anlıyorsun değil mi? Aslında yazdığın uygulamanın &amp;ccedil;alışması i&amp;ccedil;in gerekli ne kadar DLL ve WASM-based k&amp;uuml;t&amp;uuml;phane varsa, &amp;ccedil;alışma zamanı ile birlikte istemciye indiriyorum. &amp;Ccedil;alışma zamanı derken demek istediğim WASM tabanlı .Net Runtime'ı yollamak. Sonrasında uygulaman istemci &amp;uuml;zerinde rahat&amp;ccedil;a koşuyor.&amp;nbsp;Sunduğum WASM-based .NET &amp;ccedil;alışma zamanı WASM standartları &amp;uuml;zerine tasarlandı. Bu y&amp;uuml;zden WASM'ı destekleyen Edge, Safari, Firefox, Chrome gibi bilinen tarayıcıların tamamında &amp;ccedil;alışıyor. Ortak standart sonu&amp;ccedil;ta. B&amp;uuml;y&amp;uuml;k babam Silverlight'tan farklı olarak k&amp;uuml;resel bir standart &amp;uuml;zerinde koştuğumdan istemciye bana &amp;ouml;zel bir plug-in kurmana da gerek yok. K&amp;uuml;resel standartlara bağlı kalmak her zaman iyidir.&lt;/p&gt;
&lt;h3&gt;K&amp;ouml;t&amp;uuml; Huylarım&lt;/h3&gt;
&lt;p&gt;Her ne kadar seni mutlu eden şeyler s&amp;ouml;ylesem de bazı k&amp;ouml;t&amp;uuml; huylarım olduğunu da belirtmek isterim.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Mesela benim bu modelimi Debug etmek o kadar kolay olmuyor. En azından abim Blazor Server'a g&amp;ouml;re.&lt;/li&gt;
&lt;li&gt;Plug-In gerekmiyor belki ama WASM destekleyen bir tarayıcı olması da şart. Belki bildiğin b&amp;uuml;t&amp;uuml;n tarayıcılar WASM'ı destekliyor ama Javascript &amp;ccedil;alışma zamanına g&amp;ouml;re daha b&amp;uuml;y&amp;uuml;k bir motor bloğuna ihtiyacım var. Bu da hafifsiklet tarayıcılarda benim &amp;ccedil;alışmamı &amp;ccedil;ok zorlaştırıyor. IoT cihazlar belki sana k&amp;uuml;sebilirler.&lt;/li&gt;
&lt;li&gt;Yazdığın kodların bulunduğu DLL'ler istemci tarafına iniyor ya. Heh işte ona dikkat et. Şeytanın işi olmaz kod i&amp;ccedil;erisinde unuttuğun&amp;nbsp;bazı hassas verileri a&amp;ccedil;ığa &amp;ccedil;ıkabilir. O y&amp;uuml;zden paketlerde ne kodladığına dikkat et. Gerekirse onları sunucu tarafında tut.&lt;/li&gt;
&lt;li&gt;&amp;Ccedil;ok doğal olarak istemcide &amp;ccedil;alışabilmenin de bir maliyeti var. Hamama giren terler :) İhtiyacın olan k&amp;uuml;t&amp;uuml;phaneler uygulamanın ilk talebinde y&amp;uuml;kleme s&amp;uuml;resini uzatabilir. Boyutları itibariyle bu y&amp;uuml;kleme zaman da alabilir. O y&amp;uuml;zden &amp;ouml;nbelleğe alma stratejilerini g&amp;ouml;z &amp;ouml;n&amp;uuml;nde bulundurmanı &amp;ouml;neririm.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bunların haricinde sana iyi haberlerim de var ;)&lt;/p&gt;
&lt;h3&gt;İyi Huylarım&lt;/h3&gt;
&lt;p&gt;En g&amp;uuml;zel haberi baştan s&amp;ouml;yleyeyim.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Uygulamanın istemcide &amp;ccedil;alışması i&amp;ccedil;in Javascript yazmana gerek yok.&amp;nbsp;&amp;Ccedil;ok iyi biliyorsun ki Node.js &amp;ccedil;ıkınca Javascript ile sadece istemci taraflı değil sunucu taraflı kodlamayı da aynı dille yapabilme şansı elde etmiştin. .Net tarafında ise sunucu bazlı kodlama &amp;ouml;ne &amp;ccedil;ıkıyor ve istemci i&amp;ccedil;in yine Javascript veya Typescript'e başvurman gerekiyor. Artık bu modelimi kullanarak yazdığın C# kodlarının derlenmiş hallerini istemcide doğrudan &amp;ccedil;alıştırabilirsin.&lt;/li&gt;
&lt;li&gt;Performans olarak da iyi sonu&amp;ccedil;lar veren bir model bu. Sunucu tarafında yaşanabilecek &amp;ouml;l&amp;ccedil;eklendirme veya ge&amp;ccedil; cevaplama gibi durumlar pek de s&amp;ouml;z konusu değil. Sunucu tarafı bağımlılığı ise aslında yok gibi bir şey. Yine de &amp;ccedil;ok istersen elin kolun bağlı değil. Pekala Web API'lerle veya farklı dış d&amp;uuml;nya servisleri ile iletişim kurabilirsin.&lt;/li&gt;
&lt;li&gt;Performans demişken bu modelde yazdıkların tarayıcının tam da istediği ara dile&amp;nbsp;&amp;ouml;nceden&amp;nbsp;derleniyor. Tarayıcının doğrudan derlenmiş kodlarla &amp;ccedil;alışma şansı oluyor. Basit uygulamalarda değil ama &amp;ouml;rneğin oyun geliştirirken, etkileşimi y&amp;uuml;ksek eğitim programları hazırlarken bu &amp;ccedil;ok işine yarayabilir.&lt;/li&gt;
&lt;li&gt;Modern uygulama d&amp;uuml;nyasının bilinen yıldızı Progressive Web App i&amp;ccedil;in de tam destek sunuyorum. Yani Native uygulama deneyimini bu modelle sunabilirsin.&lt;/li&gt;
&lt;li&gt;&amp;Uuml;stelik bu modelde geliştirdiğin bir uygulamayı istemci tarafına indirdikten sonra internete ihtiya&amp;ccedil; yok. Tamamen &amp;ccedil;evrimdışı &amp;ccedil;alışabiliyorum. Mariana &amp;ccedil;ukurunda bile &amp;ccedil;alışırım.&lt;/li&gt;
&lt;li&gt;Bu modelde yazdığın ve &amp;ccedil;eşitli iş kurallarını i&amp;ccedil;eren bir k&amp;uuml;t&amp;uuml;phaneyi alıp abim Blazor Server&amp;nbsp;modelinde de kullanabilirsin. Her ikisi de aynı bitlere derlenmiş versiyonlar ile &amp;ccedil;alışacaklardır. Dolayısıyla Blazor WebAssembly olarak geliştirdiğin bir uygulamayı basit hamlelerle Blazor Server modeline d&amp;ouml;n&amp;uuml;şt&amp;uuml;rmen m&amp;uuml;mk&amp;uuml;n.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bu modelime ait &amp;ccedil;alışma şeklini aşağıdaki renkli i&amp;ccedil;erikte bulabilirsin&lt;em&gt;(Fark ettim de Document Object Model'in L harfini unutmuşum. Pardon)&lt;/em&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/whoisblazor_02.jpg" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi sana sunduğum diğer geliştirme modelini&amp;nbsp;anlatayım.&lt;/p&gt;
&lt;h2&gt;Blazor Server&lt;/h2&gt;
&lt;p&gt;Bu modelime Server-Side Blazor dedikleri de oluyor. Aslında Client-Based'den &amp;ouml;nce .Net Core d&amp;ouml;neminde ortaya &amp;ccedil;ıktı. Tahmin edeceğin &amp;uuml;zere uygulamanın ana kodları sunucu tarafında işletiliyor. Dolayısıyla sana Asp.Net Core ortamının nimetlerinden yararlanma fırsatı sunuyorum. İstersen .Net Standart k&amp;uuml;t&amp;uuml;phanelerinden de faydalanabilirsin. İstemci tarafına yolladığım şey ise DOM&lt;em&gt;(Document Object Model)&lt;/em&gt;'in kendisi. Bunun i&amp;ccedil;inse Razor bileşenlerinin sunucu tarafında render edilmiş hallerini kullanıyorum. Tahmin ediyorum ki aklına takılan bir soru da var. İstemciye giden bileşenler ile sunucu kodlarını nasıl haberleştireceksin, değil mi? Bunun i&amp;ccedil;in sana DOM ve uygulama tarafındaki farkları takip etme stratejisi &amp;uuml;zerine kurgulanmış SignalR enstr&amp;uuml;manını sunuyorum.&amp;nbsp;&lt;/p&gt;
&lt;h3&gt;İyi Huylarım&lt;/h3&gt;
&lt;p&gt;Şimdi bu modelin sana sunduğu g&amp;uuml;zelliklerden bahsedeyim.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Tekrarı gibi olacak ama, bu modelde de tek satır Javascript yazmana gerek yok. &amp;Uuml;stelik k&amp;uuml;&amp;ccedil;&amp;uuml;k kardeşim Blazor WebAssembly ile aynı s&amp;ouml;zdizimini kullanan bileşenlerim var&lt;em&gt;(Razor Components)&lt;/em&gt;&amp;nbsp;Teşekk&amp;uuml;rler Razor!&lt;/li&gt;
&lt;li&gt;Uygulama kodun sunucu &amp;uuml;st&amp;uuml;nde g&amp;uuml;venli bir alanda duruyor olacak. Zengin hosting se&amp;ccedil;eneklerin var. Web API servisleri ile konuşma, bulut servis nitemlerinden yararlanma, veritabanı gibi diğer bileşen bağımlılıklarını kullanma gibi imkanlardan bahsediyorum. B&amp;uuml;y&amp;uuml;k ihtimalle de bulut bilişim servislerini tercih edebilirsin ki Azure senin i&amp;ccedil;in ideal bir konumlandırma olacaktır.&lt;/li&gt;
&lt;li&gt;İstemciye sadece Render edilmiş bir şeyler g&amp;ouml;nderiyorum ve t&amp;uuml;m kod sunucuda &amp;ccedil;alıştığı i&amp;ccedil;in uzun indirme s&amp;uuml;releri, b&amp;uuml;y&amp;uuml;k dosyalar veya ge&amp;ccedil; &amp;ccedil;alışma zamanı a&amp;ccedil;ılışları yok.&lt;/li&gt;
&lt;li&gt;Bir yazılımcının vazge&amp;ccedil;emediği enstr&amp;uuml;manlardan olan debug etme kabiliyetlerinde olduk&amp;ccedil;a c&amp;ouml;mertim.&lt;/li&gt;
&lt;li&gt;Son olarak ne iş olsa yaparım ve her tarayıcıda &amp;ccedil;alışırım demek istiyorum.&lt;/li&gt;
&lt;/ul&gt;
&lt;h3&gt;K&amp;ouml;t&amp;uuml; Huylarım&lt;/h3&gt;
&lt;p&gt;Sana bu modelin bir&amp;ccedil;ok iyi &amp;ouml;zelliğini saydım ama k&amp;ouml;t&amp;uuml; yanları da yok değil.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;SignalR ile yakın ilişki i&amp;ccedil;erisinde olduğumu ifade edeyim. Zaman zaman &amp;ccedil;ok fazla konuşuruz. Mesela her sayfa &amp;ouml;rneklendiğinde ayrı bir SignalR bağlantısı tesis ederim. Takibi, bakımı ve &amp;ouml;l&amp;ccedil;eklenebilirliği zordur. Azure tarafındaki SignalR yapısını kullanarak bu sorunu aşabilirsin ama bulut tabanlı d&amp;uuml;nyaya ge&amp;ccedil;iş yapman gerekir ki orası da esasında ayrı bir uzmanlıktır.&lt;/li&gt;
&lt;li&gt;Arabirimle etkileşim o kadar fazladırki ağ trafiği bazen İstanbul iş &amp;ccedil;ıkış saati trafiğini aratmaz. Belki uygulamanın dağıtıldığı yere g&amp;ouml;re uygun sunucu konumlandırmaları yapabilirsin&lt;em&gt;(Yani&amp;nbsp;Avrupa kıtasından gelenler Almanya'daki bir sunucuya y&amp;ouml;nlensin, Amerika kıtasındakiler Kanada'daki bir sunucuya y&amp;ouml;nlensin tadında)&lt;/em&gt;&amp;nbsp;ama bu da ne demek biliyorsun, bolca kiralama bedeli.&lt;/li&gt;
&lt;li&gt;Bir diğer sorunumsa .Net &amp;ccedil;alışma zamanına olan bağımlılığım. Kardeşim Blazor WebAssembly gibi &amp;ccedil;alışacağım tarayıcıya kendi runtime motorumu indirip işe başlayamıyorum. Sunucuda benim i&amp;ccedil;in bir .Net &amp;ccedil;alışma zamanı kurulu olmak durumunda.&amp;nbsp;&lt;/li&gt;
&lt;li&gt;Ne yazık ki &amp;ccedil;evrimdışı &amp;ccedil;alışma desteğim yok denecek kadar az. Hatta s&amp;uuml;rekli &amp;ccedil;evrim i&amp;ccedil;i olmayı beklerim ki SignalR alt yapım sorunsuz &amp;ccedil;alışabilsin.&lt;/li&gt;
&lt;li&gt;Sunucu &amp;ccedil;&amp;ouml;kerse ne mi olur? D&amp;uuml;ş&amp;uuml;nmek bile istemiyorum.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;Ccedil;evremdeki dostlarım bu modeli genellikle aşağıdaki &amp;ccedil;izimle hatırlarlar. Pek &amp;ccedil;ok kaynakta tıpkısını g&amp;ouml;receksin&lt;em&gt;(Document Object Model'i doğru yazmışım. Enteresan!)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/whoisblazor_03.jpg" alt="" /&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Blazor WebAssembly ve Server modelleri genellikle performans a&amp;ccedil;ısından sıklıkla kıyaslanırlar. Bu konuda &lt;a href="https://www.telerik.com/blogs/how-blazor-performs-against-other-frameworks" target="_blank"&gt;Telerik'ten David Grace'in g&amp;uuml;ncel araştırma yazısı&lt;/a&gt;nı okumanı tavsiye ederim.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n gibi desteklediğim iki modelin birbirlerine g&amp;ouml;re avantaj ve dezavantajları var. Duruma g&amp;ouml;re uygun olan modeli tercih etmek gerekiyor. Ancak bu işe ilk kez başlıyorsan ve Blazor'a merhaba demek istiyorsan kuracağın kul&amp;uuml;be katılacak arkadaşlarının herhangi bir zaman diliminde g&amp;ouml;rd&amp;uuml;kleri bir kitabın fotoğrafını koyup yorumlayabildikleri, puan verebildiği bir sistemi aşağıdaki topolojiye g&amp;ouml;re oluşturmayı deneyebilirsin.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/whoisblazor_05.jpg" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;B&amp;uuml;y&amp;uuml;k resme baktığında şunları anlaman &amp;ouml;nemli. &amp;Ccedil;&amp;ouml;z&amp;uuml;mde her iki Blazor modeli de kullanılıyor. İstemci tarafında &amp;ccedil;evrimdışı olarak &amp;ccedil;alışabilen bir uygulaman var. Okumakta olduğun kitabın fotoğrafını &amp;ccedil;ekebilir, hakkında bir şeyler yazabilir ve &amp;ccedil;evrimi&amp;ccedil;i olduğunda da Web API &amp;uuml;st&amp;uuml;nden HTTP Post komutu ile bu bilgileri Backend uygulamasına g&amp;ouml;nderebilirsin. Backend tarafı bunu alıp istediğin Repository ortamında kalıcı olarak saklayacaktır. Entity Framework kullanırsan Repository bağımsız hareket etme şansın da var ama mecburi değilsin. İlişkisel bir veritabanı modeli se&amp;ccedil;ebileceğin gibi NoSQL nimetlerinden yararlanabilirsin. Yorgun argın eve geldikten sonra da istersen bilgisayarındaki tarayıcıdan Web uygulamasını a&amp;ccedil;ar, arkadaşlarının eklediği kitapları Web API'den HTTP Get ile &amp;ccedil;ekersin. Yapacağın veri odaklı g&amp;uuml;ncellemeleri de HTTP Put ile yollayabilirsin.&amp;nbsp;Hatta sen sayfada gezindiğin sırada bir arkadaşın Web Assembly uygulaması &amp;uuml;st&amp;uuml;nden yeni bir kitap bilgisi eklerse SignalR mekanizması bu değişikliği Web &amp;uuml;st&amp;uuml;nden bağlı t&amp;uuml;m istemcilere de g&amp;ouml;ndereceği i&amp;ccedil;in sen de değişiklikten anında haberdar olabileceksin.&amp;nbsp;Ya da tam tersi sen sayfada gezindiğin sırada bir kitabın bilgisini değişitirirsen bu değişiklikten de diğer bağlı istemciler anında haberdar olacak.&amp;nbsp;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n &amp;uuml;zere SignalR sadece chat, anlık borsa veya stok hareketlerini takip etmek i&amp;ccedil;in kullanılan bir yapı değil.&lt;/p&gt;
&lt;h2&gt;Benimle Geliştirme Yaparken&lt;/h2&gt;
&lt;p&gt;Bu arada aklıma gelen birka&amp;ccedil; noktayı daha ifade etmek istiyorum. Ben MVC&lt;em&gt;(Model View Controller)&lt;/em&gt;, MVP&lt;em&gt;(Model View Presenter)&lt;/em&gt; ve MVVM&lt;em&gt;(Model View ViewModel)&lt;/em&gt; kalıplarından farklı olarak genelde Vertical Slices Architecture yaklaşımını kullanmanı &amp;ouml;neriyorum. Yani kodunu fonksiyonlara g&amp;ouml;re gruplamaktan ziyade, &amp;ouml;zellik&lt;em&gt;(Feature)&lt;/em&gt; bazlı gruplamanı &amp;ouml;neriyorum. Yanlış anlama, onları kullanamazsın demiyorum ancak&amp;nbsp;bildiğin &amp;uuml;zere ben bileşenleri&lt;em&gt;(Components)&lt;/em&gt; etkin kullanan SPA modelini &amp;ouml;ncelikli olarak benimsiyorum. Bileşen odaklı bu sade yaklaşımım nedeniyle Vertical Slice Architecture'ın aşağıdaki kurgusu kullanmak i&amp;ccedil;in &amp;ccedil;ok ideal.&amp;nbsp;Her kutunun bir bileşen olduğuna dikkat et l&amp;uuml;tfen.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/whoisblazor_06.jpg" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Sonu&amp;ccedil; Olarak&lt;/h2&gt;
&lt;p&gt;Esasında sonda anlattığım &amp;ouml;rnek senaryo farklı uygulama geliştirme &amp;ccedil;atıları veya programlama dilleri ile de yapılabiliyor. Buradaki avantaj &amp;ccedil;oğu zaman Javascript tarafından ka&amp;ccedil;an ve yıllardır .Net &amp;uuml;zerinde geliştirme yapan birisinin C#'ın g&amp;uuml;c&amp;uuml;n&amp;uuml; kullanmaya devam ettiği Blazor WebAssembly tarafı. Diğer yandan SignalR odaklı Server modelinin performansı da istemci-sunucu etkileşimi a&amp;ccedil;ısından bakıldığında diğer modellere g&amp;ouml;re daha iyi olabilir. Yine de kesin bir şey s&amp;ouml;ylemek zor. Ancak şu bir ger&amp;ccedil;ek ki b&amp;uuml;y&amp;uuml;k ihtimalle şirketinde kullanılan Asp.Net Web Forms k&amp;ouml;kenli bir uygulaman varsa onu modernize etmenin iyi yollarından birisi Blazor tarafına ge&amp;ccedil;irmek olabilir.&amp;nbsp;Bu arada Blazor WebAssembly alternatifi olan &amp;ccedil;alışmalar da var. Mesela &lt;a href="https://github.com/integrativesoft/lara" target="_blank"&gt;Lara&lt;/a&gt; bunlardan birisi. Onu da kurcalaman da yarar var. Bir Nuget paketi uzağında.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;zlerime burada son verirken &amp;ouml;n&amp;uuml;m&amp;uuml;zdeki yılların sana ve t&amp;uuml;m sevdiklerine sağlık getirmesini diliyorum.&lt;/p&gt;
&lt;h2&gt;Kaynaklar&lt;/h2&gt;
&lt;p&gt;&lt;a href="https://codemag.com/Article/1911052/A-New-Era-of-Productivity-with-Blazor" target="_blank"&gt;A New Era of Productivity with Blazor&lt;/a&gt;, Ed Charbeneau,Code Magazine&lt;/p&gt;
&lt;p&gt;&lt;a href="https://www.amazon.com.tr/dp/1800567189/ref=cm_sw_em_r_mt_dp_6CMD17ZA5K1MDVQBWMRA?_encoding=UTF8&amp;amp;psc=1" target="_blank"&gt;Asp.Net Core 5 for Beginners&lt;/a&gt;, Andreas Helland, Vincent Maverick Durano, Jeffrey Chilberto, Ed Price, Packt Publishing&lt;/p&gt;
&lt;p&gt;&lt;a href="https://www.amazon.com.tr/Software-Architecture-NET-Architecting-microservices/dp/1800566042/ref=sr_1_1?__mk_tr_TR=%C3%85M%C3%85%C5%BD%C3%95%C3%91&amp;amp;dchild=1&amp;amp;keywords=Software+Architecture+with+C%23+9.0+and+.NET+5&amp;amp;qid=1620331734&amp;amp;sr=8-1" target="_blank"&gt;Software Architecture with C# 9.0 and .NET 5&lt;/a&gt;, Gabriel Baptista, Fancesco Abbruzzese, Packt Publishing&lt;/p&gt;
&lt;p&gt;&lt;a href="https://www.amazon.com.tr/Atypical-ASP-NET-Design-Patterns-Guide/dp/1789346096/ref=sr_1_2?__mk_tr_TR=%C3%85M%C3%85%C5%BD%C3%95%C3%91&amp;amp;dchild=1&amp;amp;keywords=Software+Architecture+with+C%23+9.0+and+.NET+5&amp;amp;qid=1620331754&amp;amp;sr=8-2" target="_blank"&gt;An Atypical ASP.NET Core 5 Design Patterns Guide&lt;/a&gt;, Carl-Hugo Marcotte, Packt Publishing&lt;/p&gt;</content>
  <pubDate>2021-05-07 22:04:00</pubDate>
  <slug>birisi-sana-blazor-nedir-diye-sorarsa</slug>
  <tags>
    <tag>blazor</tag>
    <tag>blazor-server</tag>
    <tag>blazor-web-assembly</tag>
    <tag>web-assembly</tag>
    <tag>wasm</tag>
    <tag>c#</tag>
    <tag>javascript-interoperability</tag>
    <tag>client-server</tag>
    <tag>client-side-blazor</tag>
    <tag>server-side-blazor</tag>
  </tags>
  <categories>
    <category>Blazor</category>
  </categories>
</post>