<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>GoLang - Redis ile Anlaşmak</title>
  <description>Bir Cumartesi gecesiydi. Dışarıda hava nemli ve sıcaktı. Bir süre önce başlayan yağmurun sesi çalışma odama tatlı tatlı geliyordu. Biraz da toprak kokusu. Evde el ayak çekilmiş sakin bir ortam oluşmuştu. GoLang öğrenme çalışmaları devam ediyordu. Dili ufak ufak kavramaya başlamıştım ama örnek senaryolar işleterek ilerlemem gerektiğini de biliyordum. Derken aklıma eskiden .Net tarafında kullandığım NoSQL sistemlerinden olan Redis ile ilgili bir şeyler yapmak geldi.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/06/goredis_2.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir haziran gecesiydi. Dışarıda hava nemli ve sıcaktı. Bir s&amp;uuml;re &amp;ouml;nce başlayan yağmurun sesi &amp;ccedil;alışma odamın pencersinden kulaklarıma tatlı tatlı geliyordu. Biraz da toprak kokusu vardı tabii. Evde el ayak &amp;ccedil;ekilmiş sakin bir ortam oluşmuştu. Bol kafein dolu bardağım elimde internetten bir şeyler okuyordum. İnsanlar &amp;ccedil;ıldırmıştı. Javascript Framework'ler, yapay zeka'lar, react'ler, cordova'lar, .net core'lar, sanayi 4.0'lar, tesla'lar ve daha niceleri. Eskisinden daha hızlı bir şekilde geride kaldığımı hissediyordum. Sanırım sonum &amp;ouml;r&amp;uuml;mcek adamın amcası gibi evde bozuk amp&amp;uuml;l&amp;uuml; tamir edip gazetede iş arayan ama bulamayan biri gibi olacaktı. Ama direniyordum. &amp;Ouml;nce Ruby, sonra Pyhton ve derken GO. Amat&amp;ouml;r seviyede başlamış biraz ilerlemiştim. Kendime bir &amp;ccedil;alışma d&amp;ouml;ng&amp;uuml;s&amp;uuml; kurmuştum. Bir s&amp;uuml;re Ruby bakıyor, sonra Pyhton bakıyor, sonra GO bakıyor sonra bu d&amp;ouml;ng&amp;uuml;y&amp;uuml; tekrar başa sarıyordum. GO'nun ikinci iterasyonundaydım.&lt;/p&gt;
&lt;p&gt;Bu sefer elimde olduk&amp;ccedil;a g&amp;uuml;zel de bir T&amp;uuml;rk&amp;ccedil;e kaynak vardı&lt;em&gt;(Murat &amp;Ouml;zalp'in Go Programlama isimli kitabını şiddetle tavsiye ederim)&lt;/em&gt;&amp;nbsp;Kitabın son sayfalarına gelmiştim. D&amp;ouml;ng&amp;uuml;n&amp;uuml;n bir sonraki adımına ge&amp;ccedil;meden &amp;ouml;nce biraz daha uygulama yapmam gerekiyordu. Nitekim dile hakim olabilmek i&amp;ccedil;in bol bol kod yazmam şarttı. Mesela GoLangWeekly' de yayımlanan başlıklara g&amp;ouml;z gezdirdiğimde &amp;ccedil;oğunu anlamakta g&amp;uuml;&amp;ccedil;l&amp;uuml;k &amp;ccedil;ekiyordum. Bu y&amp;uuml;zden se&amp;ccedil;mece ilerlemek durumundaydım. Aslında programlama dilini ufak ufak kavramaya başlamıştım ama &amp;ouml;rnek senaryolar işleterek ilerlemem gerektiğini de biliyordum. Gelişebilmem i&amp;ccedil;in bu şarttı. Bu karman &amp;ccedil;orman d&amp;uuml;ş&amp;uuml;nceler altında devam ederken aklıma bir pratik geldi. Eskiden .Net tarafında kullandığım NoSQL sistemlerinden olan Redis ile ilgili bir şeyler yapmak istiyordum.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;2014 yılında onu kısaca incelemeye &amp;ccedil;alışmış ve &lt;a href="/post/NoSQL-Maceralarc4b1e28093Redis-ile-Hello-World" target="_blank"&gt;bir şeyler karalamıştım&lt;/a&gt;. Hatta Redis'in genel &amp;ouml;zelliklerini oradan okuyarak hatırlamaya &amp;ccedil;alıştım.&amp;nbsp;Bu yazı i&amp;ccedil;in kısaca&amp;nbsp;&amp;ouml;zetlemek gerekirse bellekte &amp;ccedil;alışan, key-value tipinde ve dağıtık yapıda sunulabilen bir NoSQL sistemi olduğunu ifade edebiliriz. Redis'in key-value tipinde bir veri tabanı olması bizi yanıltmamalıdır. key'ler string olsa da value olarak kullanabileceğimiz beş temel tip bulunur. string, hash, list, set ve sortedSet. Dolayısıyla olduk&amp;ccedil;a geniş bir veri yapısını kullanma şansımız vardır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Zaman hızla ge&amp;ccedil;miş bir &amp;ccedil;ok şey de değişmişti tabii. Bir s&amp;uuml;redir g&amp;ouml;zde dillerimden birisi olan Go'da Redis'i nasıl kullanabileceğimi merak ediyordum. O gece Windows makinesinde &amp;ccedil;alışmaktaydım. Aradan ge&amp;ccedil;en zamana rağmen Redis'in Windows s&amp;uuml;r&amp;uuml;m&amp;uuml; halen &amp;ccedil;alışmaktaydı. Yeni Redis versiyonlarına g&amp;ouml;re yeni s&amp;uuml;r&amp;uuml;mleri de yayınlanıyordu. Dolayısıyla siz de Windows s&amp;uuml;r&amp;uuml;m&amp;uuml;ndeyseniz&amp;nbsp;&lt;a href="https://github.com/MSOpenTech/redis/releases" target="_blank"&gt;şu adresten&lt;/a&gt; uygun MSI ile y&amp;uuml;klemeyi yapabilir ve yazının kalanında bana eşlik edebilirsiniz.&lt;/p&gt;
&lt;h1&gt;Komut Satırında Kısa Bir Tur&lt;/h1&gt;
&lt;p&gt;Y&amp;uuml;kleme işlemi sonrası hemen komut satırına ge&amp;ccedil;tim ve redis-server.exe' yi kurulumun yapıldığı lokasyondan &amp;ccedil;alıştırdım. Sonra bir ka&amp;ccedil; deneme yapmak i&amp;ccedil;in redis-client ile a&amp;ccedil;ılan kısma ge&amp;ccedil;tim. Redis varsayılan olarak yerel makinede 6379 numaralı porttan hizmet veren bir servis. Tabii farklı node'lar s&amp;ouml;z konusu olursa farklı port'lar ile de haberleşebilmemiz m&amp;uuml;mk&amp;uuml;n. &amp;Ouml;rneğimiz şimdilik tek bir sunucu &amp;ouml;rneği &amp;uuml;zerinden &amp;ccedil;alışıyor.&lt;/p&gt;
&lt;p&gt;Saatler ilerlerken konunun verdiği heyecanla komut satırından bir ka&amp;ccedil; deneme yapmayı da ihmal etmedim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/goredis_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak redis ile ping-pong oynadım :) Siz ping yazdığınızda O da PONG diyorsa bu konuşabildiğiniz anlamına gelir. Ardından ilk iş players:reksar isimli bir key oluşturmak oldu. Değeri ise JSON formatında bir i&amp;ccedil;erikten ibaretti. get komutunu kullanarak belleğe atılan bu key i&amp;ccedil;eriğini okuyabiliriz.&lt;/p&gt;
&lt;p&gt;Sonrasında hmset ile bir hash &amp;uuml;retmeye &amp;ccedil;alıştım. hmset ile bir key i&amp;ccedil;in n sayıda değer i&amp;ccedil;erecek alanlar(fields) tanımlayabiliriz. language:go isimli key bu şekilde yazıldı. Oluştururken bir field bir value, bir field bir value şeklinde ilerlemek gerekiyor. Daha sonra hmget ile language:go i&amp;ccedil;eriğini almaya &amp;ccedil;alıştım. Ancak ilk denemede hata yaptım. Nitekim bu komut ile bir hash i&amp;ccedil;erisindeki belli bir alanın değerini almaktayız. type alanının değerini okuduktan sonra t&amp;uuml;m alanların i&amp;ccedil;eriğini hgetall komutu ile elde etmeyi başardım. Dilersek sadece key değerlerini de yakalayabiliriz ki hkeys bu noktada devreye girmekte.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;İlerleyen satırlarda basit bir liste oluşturup ona elemanlar eklemeyi ve t&amp;uuml;m i&amp;ccedil;eriği ekrana yazdırmayı denedim. Bu ama&amp;ccedil;la lpush ve lrange isimli komutlardan yararlandım. Bu şekilde komut satırından &amp;ccedil;alışmaya da devam edilebilirdi tabii ama hedefim bunu Go ile ger&amp;ccedil;ekleştirmekti.&lt;/p&gt;
&lt;h1&gt;GoLang Zamanı&lt;/h1&gt;
&lt;p&gt;Diğer platformlarda olduğu gibi Redis'i GoLang ile kullanmak i&amp;ccedil;in harici bir paketten destek almam işleri kolaylaştırıyor. Aslında bu şart değil. Sonu&amp;ccedil;ta servis bazlı bir veritabanı motoru s&amp;ouml;z konusu ama şimdilik paket ile ilerlemek benim i&amp;ccedil;in daha iyi. Bir ka&amp;ccedil; araştırma ve blog yazısından sonra &lt;a href="https://github.com/mediocregopher/radix.v2" target="_blank"&gt;şu adresten yayınlanan bir go paketi&lt;/a&gt; buldum. LiteIDE'nin Get se&amp;ccedil;eneği ile ya da komut satırından ilgili paketi kolaylıkla sistemimize alabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;go get github.com/mediocregopher/radix.v2&lt;/pre&gt;
&lt;h2&gt;&amp;Ouml;nce Basit Bir&amp;nbsp;String Ekleyelim&lt;/h2&gt;
&lt;p&gt;Gelelim &amp;ouml;rnek kod par&amp;ccedil;alarına. İlk olarak basit string t&amp;uuml;r&amp;uuml;nden bir veri eklemeye &amp;ccedil;alıştım. Value olarak da JSON i&amp;ccedil;eriği kullanmaya karar verdim.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"

	"github.com/mediocregopher/radix.v2/redis"
)

func main() {
	AddLudwig()
}

func AddLudwig() {
	conn, err := redis.Dial("tcp", "localhost:6379")
	if err != nil {
		fmt.Println(err.Error())
	} else {
		defer conn.Close()
		pong := conn.Cmd("ping")
		fmt.Println(pong.String())

		response := conn.Cmd("set", "players:ludwig", "{\"nick\":ludwig,\"genre\":classic,\"SongCount\":98}")
		if response.Err != nil {
			fmt.Println(response.Err)
		}
		fmt.Println(response.String())
	}
}&lt;/pre&gt;
&lt;p&gt;Fonksiyon redis tipinin Dial metodu ile başlıyor. TCP protokol&amp;uuml; ile localhost &amp;uuml;zerindeki 6379 nolu porta bağlanacağımızı ifade ediyoruz. Yani Redis sunucusuna. Eğer bağlanabiliyorsak&lt;em&gt;(ki err nesnesi nil ise bağlanıyoruz diyebiliriz)&lt;/em&gt; &amp;ouml;nce ping pong oynuyor ve sonrasında players:ludwig isimli bir key g&amp;ouml;nderiyoruz. Değer olarak da JSON formatında bir i&amp;ccedil;erik s&amp;ouml;z konusu. Ludwig'in takma adını, bestelediği şarkı t&amp;uuml;r&amp;uuml;n&amp;uuml; ve toplam par&amp;ccedil;a sayısını tutan sa&amp;ccedil;ma bir verimiz var. Bu kodda en kritik nokta az &amp;ouml;nce terminalden yazdığımız&amp;nbsp;redis komutlarının Cmd metodunda kullanılması. İlk &amp;ccedil;ağrıda ping diğerinde ise set komutunu g&amp;ouml;ndermekteyiz. defer ettiğimiz Close metodu fonksiyondan &amp;ccedil;ıkarken redis bağlantısını kapatacak. &amp;Ccedil;alışma zamanı sonu&amp;ccedil;larını aşağıda g&amp;ouml;rebilirsiniz.&amp;nbsp;Koddan eklediğimiz veriyi redis komut satırından da elde edebildik.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/goredis_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Birde Hash &amp;Uuml;retip Okuyalım&lt;/h2&gt;
&lt;p&gt;Kodları biraz daha ilerletmeye &amp;ccedil;alıştım. Acaba bir Hash nasıl &amp;uuml;retilebilirdi ve hatta alanlarının değerlerini kod tarafından nasıl okuyabilirdim? Aşağıdaki gibi bir fonksiyon işime yarayacaktı.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;func AddAndReadHash() {
	conn, err := redis.Dial("tcp", "localhost:6379")
	if err != nil {
		fmt.Println(err.Error())
	} else {
		defer conn.Close()
		response := conn.Cmd("HMSET", "card:93", "nickName", "murlock", "greetings", "I'am ready, I'am not ready", "price", 5, "attack", 4, "defense", 4, "owner", "shammon")
		if response.Err != nil {
			fmt.Println(response.Err)
		}
		fmt.Println(response.String())
		read, _ := conn.Cmd("HGETALL", "card:93").Map()
		for k, v := range read {
			fmt.Printf("%s\t%s\n", k, v)
		}
	}
}&lt;/pre&gt;
&lt;p&gt;Bu kez HMSET komutunu kullanarak bir hash &amp;uuml;retiliyor. card:93 olarak belirtilmiş bir key s&amp;ouml;z konusu. Bu verinin nickName, greetings, price, attack, defense ve owner isimli alanları bulunuyor. Bir takım test verileri koyarak redis'e g&amp;ouml;nderiyoruz. Okuma kısmında ise HGETALL komutunun &amp;ccedil;ağırılması s&amp;ouml;z konusu. Ancak dikkat &amp;ccedil;ekici nokta bu seferki &amp;ccedil;ağrım sonrası Map isimli metodun kullanılması. Bu sayede hash i&amp;ccedil;erisindeki key ve value bilgilerini dolaşabileceğimiz map t&amp;uuml;r&amp;uuml;nden bir nesneyi elde edebiliyoruz. Sonrasında range fonksiyonunu kullanarak ilgili key:value &amp;ccedil;iftlerini ekrana yazdırıyoruz. İşi eğlenceli hale getirmek i&amp;ccedil;in farklı bir şekilde renklendirdiğim komut satırının &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/goredis_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Go Tarafında Veriyi Yapı(Struct) Olarak Ele Alsak&lt;/h2&gt;
&lt;p&gt;Lakin bir şeyler eksik gibi. Sakladığımız verinin kendisini belki de Go tarafından başka şekilde ifade edebiliriz. &amp;Ouml;rneğin oyun kartlarına ait bilgileri taşıyan bir yapı(struct) tasarlayıp onu bu senaryoda ele almamız daha doğru olabilir. O zaman kodları aşağıdaki hale getirerek yolumuza devam edelim.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	"strconv"

	"github.com/mediocregopher/radix.v2/redis"
)

func main() {
	aragorn := Card{NickName: "Aragorn", Greetings: "Well Met!", Price: 9, Attack: 10, Defense: 12, Owner: "Luktar"}
	AddCard(aragorn, "card:45")
	card := GetCard("card:45")
	card.ToString()
}

func AddCard(card Card, id string) {
	conn, err := redis.Dial("tcp", "localhost:6379")
	if err != nil {
		fmt.Println(err.Error())
	} else {
		defer conn.Close()

		response := conn.Cmd("HMSET", id, "nickName", card.NickName, "greetings", card.Greetings, "price", card.Price, "attack", card.Attack, "defense", card.Defense, "owner", card.Owner)
		if response.Err != nil {
			fmt.Println(response.Err)
		}
		fmt.Println(response.String())
	}
}

func GetCard(id string) *Card {
	card := new(Card)
	conn, err := redis.Dial("tcp", "localhost:6379")
	if err != nil {
		fmt.Println(err.Error())
	} else {
		defer conn.Close()
		response, _ := conn.Cmd("HGETALL", id).Map()
		card.NickName = response["nickName"]
		card.Greetings = response["greetings"]
		card.Owner = response["owner"]
		card.Attack, _ = strconv.Atoi(response["attack"])
		card.Price, _ = strconv.Atoi(response["price"])
		card.Defense, _ = strconv.Atoi(response["defense"])
	}
	return card
}

func (card *Card) ToString() {
	fmt.Printf("Nickname:%s\n", card.NickName)
	fmt.Printf("Greetings:%s\n", card.Greetings)
	fmt.Printf("Owner:%s\n", card.Owner)
	fmt.Printf("Price:%d\n", card.Price)
	fmt.Printf("Attack:%d\n", card.Price)
	fmt.Printf("Defense:%d\n", card.Defense)
}

type Card struct {
	NickName  string
	Greetings string
	Price     int
	Attack    int
	Defense   int
	Owner     string
}&lt;/pre&gt;
&lt;p&gt;İlk olarak Card isimli bir struct tasarladığımızı s&amp;ouml;yleyelim. İ&amp;ccedil;erisinde Redis'teki Hash i&amp;ccedil;eriğine karşılık gelen alanları barındırmakta. AddCard fonksiyonu parametre olarak gelen bir Card nesnesinin i&amp;ccedil;eriğini kullanarak Redis &amp;uuml;zerinde yeni bir Hash oluşturma işini &amp;uuml;stleniyor. Fonksiyonun bir &amp;ouml;nceki &amp;ouml;rnekteki ekleme operasyonundan tek farkı değerleri almak i&amp;ccedil;in parametre olarak gelen Card &amp;ouml;rneğini kullanılması. card:45 benzeri key değeri i&amp;ccedil;in de id isimli bir parametre kullanmaktayız. GetCard metodu id bilgisine g&amp;ouml;re Redis &amp;uuml;zerinden bir Card i&amp;ccedil;eriğini &amp;ccedil;ekmek &amp;uuml;zere tasarlanmış durumda. Cmd &amp;uuml;zerinden gidilen Map fonksiyonu ile redis tarafında tutulan i&amp;ccedil;eriği almaktayız. Gelen i&amp;ccedil;erikteki değerler string i&amp;ccedil;erikte olacaktır. Bu nedenle strconv paketinden gerekli d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme operasyonlarını kullanmamız gerekebilir. Card tipinin Price, Attack ve Defense gibi alanları int tipinden olduğu i&amp;ccedil;in Atoi t&amp;uuml;r d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme metodundan yararlandık. Bulunan i&amp;ccedil;eriğe g&amp;ouml;re değerleri atanan Card nesnesi olarak geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;yoruz. Card yapısına uygulanan ToString metodu ile de i&amp;ccedil;eriği ekrana bastırıyoruz. İşte &amp;ouml;rnek &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/goredis_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Pek tabii olmayan bir key değerini almaya &amp;ccedil;alışırsak i&amp;ccedil;eriği boş bir yapı &amp;ouml;rneği elde ederiz. S&amp;ouml;z gelimi card:100 sistemimizde bulunmuyor. Bu anahtar i&amp;ccedil;in program &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/goredis_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Demek ki&lt;/h1&gt;
&lt;p&gt;Teorimiz olduk&amp;ccedil;a basit. Redis komutlarını &amp;ccedil;alıştırmak i&amp;ccedil;in paketin Cmd fonksiyonundan yararlanılabilir. Basit bir string kullanımından hash, list, set, sortedSet gibi veri yapılarına kadar gidilebilir. Dolayısıyla temel CRUD operasyonlarını basit&amp;ccedil;e ele alabiliriz. Bu noktada Redis'in komutlarını incelemekte ve detaylı bir şekilde &amp;ouml;ğrenmekte yarar olduğu kanısındayım. Go ile olan entegrasyonda işleri kolaylaştırmak ve programatik alanda veri t&amp;uuml;rlerini tip bazında ifade etmek i&amp;ccedil;in yapılardan&lt;em&gt;(struct)&lt;/em&gt; ve bu yapılara uygulanan yardımcı metodlardan yararlanılabilir. Yazımızda ge&amp;ccedil;en &amp;ouml;rneği daha da geliştirmek elinizde. S&amp;ouml;z gelimi Go'nun web programlama kabiliyetlerini baz alarak MVC&lt;em&gt;(Model View Controller)&lt;/em&gt; yapısına uygun bir programı Redis ile &amp;ccedil;alışacak şekilde tasarlayabilirsiniz. Ya da aray&amp;uuml;zle uğraşmak istemiyorsanız bir REST servis geliştirip temel veri operasyonlarının bu servis &amp;uuml;zerinden ger&amp;ccedil;ekleştirilmesini deneyebilirsiniz. Denemeye değer. Ben şimdilik dinlenmeye &amp;ccedil;ekileceğim ama konuyu buradan alıp ileriye taşımak sizin elinizde. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-08-03 21:16:00</pubDate>
  <slug>golang-redis-ile-anlasmak</slug>
  <tags>
    <tag>golang</tag>
    <tag>go-programming-language</tag>
    <tag>redis</tag>
    <tag>nosql</tag>
  </tags>
  <categories>
    <category>GoLang</category>
    <category>NoSQL</category>
  </categories>
</post>