<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ruby Kod Parçacıkları 34 - Struct ve OpenStruct</title>
  <description>Bir süredir tek günlük bir Ruby eğitimine hazırlanmaktayım. İşlerden çok vakit kalmasa da önceki notlarımı ve farklı kaynakları takip ederek bir içerik oluşturmaya çalışıyorum. Konular üzerinden geçerken struct ve openstruct kavramlarına da rastladım. Struct aslında Ruby'nin built-in sınıflarından birisi. Temel olarak bir sınıf tanımı yapmadan nitelik barındıran tip kullanımına olanak sağlıyor diyebiliriz. Aşağıdaki kod parçasını göz önüne alalım.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/04/ruby34_5.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir s&amp;uuml;redir şirket i&amp;ccedil;inde vereceğim Ruby eğitimine hazırlanmaktayım. İşlerden &amp;ccedil;ok vakit kalmasa da &amp;ouml;nceki Ruby notlarımı ve farklı kaynakları takip ederek 101 seviyesinde bir i&amp;ccedil;erik oluşturmaya &amp;ccedil;alışıyorum. G&amp;uuml;n i&amp;ccedil;inde C# evde ge&amp;ccedil; vakitlerde ise Ruby. Biraz yorucu olsa da olduk&amp;ccedil;a keyifli aslında. Hem yeni bir şeyler &amp;ouml;ğreniyorum hem de i&amp;ccedil; eğitim gibi bir ger&amp;ccedil;ek olduğundan ciddi anlamda not &amp;ccedil;ıkartıyorum. Bug&amp;uuml;n konular &amp;uuml;zerinden ge&amp;ccedil;erken struct ve openstruct kavramlarını atladığımı fark ettim(Ov yooo) Tabii hemen &amp;ouml;ğrenmeye başladım. Neymiş ne i&amp;ccedil;in kullanılırmış biraz fikir sahibi oldum. İşte notlarım.&lt;/p&gt;
&lt;p&gt;Struct aslında Ruby'nin built-in sınıflarından birisi. Temel olarak bir sınıf hazırlamadan nitelik ve değer barındıran tip tanımlanmasına olanak sağlıyor. Konuyu basit bir şekilde incelemeye başlamak i&amp;ccedil;in aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alarak ilerleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;player=Struct.new :firstName,:lastName,:level
dam=player.new()
dam.firstName="jan kulod van"
dam.lastName="dam"
dam.level=900
puts "#{dam.lastName}, #{dam.firstName}-[#{dam.level}]"

obiWan=player.new("kenobi","obi wan",850)
puts "#{obiWan.lastName}, #{obiWan.firstName}-[#{obiWan.level}]"&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/04/ruby34_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek kodda player isimli bir yapı bildirimi yer alıyor. İlk tanımlama sırasında new operat&amp;ouml;r&amp;uuml;n&amp;uuml; takiben bu veri yapısına dahil olan&amp;nbsp;niteliklerin bildirimi yapılmakta. Kodumuzda aynı veri modeline sahip iki Struct değişkenine yer veriliyor. dam ve obiWan :) İlk kullanımda nitelik değerleri new operat&amp;ouml;r&amp;uuml;nden sonra atanmıştır. obiWan isimli değişken &amp;ouml;rneklenirken de ilgili nitelik değerleri new fonksiyonunda belirtilmiştir.&lt;/p&gt;
&lt;p&gt;Yapıları tanımlarken do...end bloklarını da işin i&amp;ccedil;erisinde dahil edebilir ve bu sayede &amp;ccedil;eşitli fonksiyonlar i&amp;ccedil;ermesini de sağlayabiliriz. Aşağıdaki kod par&amp;ccedil;asında bu durum &amp;ouml;rneklenmektedir.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;book=Struct.new :title,:price,:category,:author do
  def getInfo
    "#{title} from #{author}. #{price},#{category}"
  end
end
tehlikeliOyunlar=book.new
tehlikeliOyunlar.title="Tehlikeli Oyunlar"
tehlikeliOyunlar.price=50
tehlikeliOyunlar.author="Oguz Atay"
tehlikeliOyunlar.category="Turk Edebiyati"
puts tehlikeliOyunlar.getInfo&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/04/ruby34_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;book isimli yapı yazılırken do end blokları arasında getInfo isimli bir metod tanımına da yer verilmiştir. getInfo metodu sadece yapının niteliklerini string formunda geriye d&amp;ouml;nd&amp;uuml;rmektedir. Burada sınıflardan farklı olarak niteliklere erişirken @ işaretinin kullanılmadığı g&amp;ouml;zden ka&amp;ccedil;ırılmamalıdır.&lt;/p&gt;
&lt;p&gt;Aslında bu ve bir &amp;ouml;nceki &amp;ouml;rnekleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alırsak benzer veri yapılarını sınıf olarak tanımlamak istediğimizde aşağıdakine benzer bir yol izlememiz gerektiği ortadadır.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;class Player
  attr_accessor :firstName,:lastName,:price

  def initialize(firstName,lastName,price)
    @firstName,@lastName,@price=firstName,lastName,price
  end  
  
  def getInfo
    "#{@firstName},#{@lastName},#{@price}"
  end
end&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere attribute tanımlamaları ve new operat&amp;ouml;r&amp;uuml; i&amp;ccedil;in initialize metodunun yazımı zorunludur. Yapılar bu noktada daha pratik bir veri modeli tanımlama yolu sunmaktadır. Nitekim bir yapı initialize metodu i&amp;ccedil;ermemesine rağmen new operat&amp;ouml;r&amp;uuml;nde i&amp;ccedil;erdiği niteliklerine değer ataması yapılabilir.&lt;/p&gt;
&lt;p&gt;Yapılar ile ilgili dikkat &amp;ccedil;ekici bir diğer nokta da OpenStruct tipinin kullanımıdır. Bu tip kullanılırken niteliklerinin baştan belirtilmesine gerek yoktur. Yani yapı istenildiği kadar nitelik barındırabilir.Nasıl mı? Aynen aşağıdaki kod par&amp;ccedil;asında g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require "ostruct"

parameters=OpenStruct.new()
parameters.connection="provider=mysql..."
parameters.username="bsenyurt"
parameters.password="****"
parameters.timeout=6000
puts parameters.timeout
parameters.ftpAddress="ftp://localhost/images/"
puts parameters.ftpAddress&lt;/pre&gt;
&lt;p&gt;OpenStruct i&amp;ccedil;in ostruct bildirimi gereklidir. Sonrasında yine new operat&amp;ouml;r&amp;uuml;nden yararlanılarak bir yapı tanımlanmıştır. parameters yapısına istediğimiz kadar nitelik atayabiliriz. &amp;Ouml;rnekte programlarımızda sıklıkla başvurduğumuz ve sayısı genellikle belli olmayan parametre modeli sembolize edilmeye &amp;ccedil;alışılmıştır. Tahmin edileceği &amp;uuml;zere OpenStruct kendi i&amp;ccedil;erisinde bir hash kullanır. Bunu new ile oluşturulduğu sırada &amp;ouml;rnekler. Hash, nitelik:değer eklendik&amp;ccedil;e genişlemeye olanak sağlar.&lt;/p&gt;
&lt;p&gt;Peki bir yapının bu &amp;ouml;rneklerde olduğu gibi n sayıda niteliğinin tamamına kolayca erişmenin bir yolu yok mudur? Tabii ki vardır. Meşhur each metodumuz ne g&amp;uuml;ne duruyor. İşte &amp;ouml;rnek bir ka&amp;ccedil; kullanım.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require "ostruct"

parameters=OpenStruct.new()
parameters.connection="provider=mysql..."
parameters.username="bsenyurt"
parameters.password="****"
parameters.timeout=6000
parameters.ftpAddress="ftp://localhost/fileServer"
parameters.each_pair{|key,value| puts "#{key}-&amp;gt;#{value}"}

player=Struct.new :firstName,:lastName,:level
obiWan=player.new("kenobi","obi wan",850)
obiWan.each{|o|puts o}
obiWan.each_pair{|key,value| puts "#{key}-&amp;gt;#{value}"}
puts obiWan[:firstName]&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/04/ruby34_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu &amp;ouml;rnekte each, each_pair ve [] operat&amp;ouml;r&amp;uuml; kullanımları &amp;ouml;rneklenmiştir. each ile bir yapının t&amp;uuml;m nitelik değerlerine erişmemiz m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. each_pair tahmin edileceği &amp;uuml;zere key:value benzeri yapının nitelik adı ve değerlerine erişmekte kullanılır. İstersek bir yapının elemanlarına indeksleyici ile de ulaşabiliriz. Aslında bir yapının diziye veya hash nesnesine atanması da olduk&amp;ccedil;a kolaydır. Hatta select fonksiyonundan yararlanarak bir yapının taşıdığı değerler &amp;uuml;zerinde koşullu se&amp;ccedil;imler yapılması da sağlanabilir &lt;em&gt;(Detaylar i&amp;ccedil;in &lt;a href="https://ruby-doc.org/core-2.2.0/Struct.html" target="_blank"&gt;bu&lt;/a&gt; ve &lt;a href="http://ruby-doc.org/stdlib-2.0.0/libdoc/ostruct/rdoc/OpenStruct.html" target="_blank"&gt;şu&lt;/a&gt; adreslerdeki Ruby dok&amp;uuml;manlarına bakmanızı &amp;ouml;neririm)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Peki yapıların bu pratik kullanımları nedeniyle sınıflar yerine tercih edilmeleri gerekir mi? Aslında yapıların kullanım sebepleri biraz daha farklıdır. &amp;Ccedil;oğunlukla ge&amp;ccedil;ici bir veri yapısına&lt;em&gt;(Temporary Data Structure)&lt;/em&gt; ihtiya&amp;ccedil; duyduğumuzda yapılardan yararlanabiliriz. Ya da test ortamında stub nesne ihtiyacı olduğunda kullanabiliriz. Bir diğer kullanım şeklide sınıf i&amp;ccedil;erisinde dahili veri modeline ihtiya&amp;ccedil; duyduğumuz durumlardır. Aşağıdaki kod par&amp;ccedil;asında bu durum &amp;ouml;rneklenmeye &amp;ccedil;alışılmıştır.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;class Employee
  attr_accessor :firstName,:lastName, :address
  Address = Struct.new(:street, :city, :country, :postal_code)

  def initialize(firstName,lastName, addressInfo)
    @firstName,@lastName=firstName,lastName
    @address = Address.new(addressInfo[:street], addressInfo[:city], addressInfo[:country], addressInfo[:postal_code])
  end

end

sitiv = Employee.new("Sitiv","Jobs", {
  street: "hevan street",
  city: "Second Parallel New York",
  country: "Beauty Country",
  postal_code: "HVN-1001"
})

puts sitiv.address.inspect&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/04/ruby34_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu &amp;ouml;rnekte Employee sınıfı i&amp;ccedil;erisinde Address isimli bir yapı tanımlanmıştır. Employee sınıfına ait bir nesne &amp;ouml;rneklenirken initialize metoduna gelen son parametre bu yapıya ait bir değişken i&amp;ccedil;eriğidir. Indeksleyici operat&amp;ouml;r&amp;uuml; ile değerler alınıp Address yapısına ait değişken nitelikleri doldurulmuştur.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi yapılar olduk&amp;ccedil;a pratik kullanıma sahip bir veri tipi olarak karşımıza &amp;ccedil;ıkmaktadır. Built-In olarak sınıf k&amp;ouml;kenli olan bu tipin kullanışlı fonksiyonları bulunmaktadır. B&amp;ouml;ylece geldik bir Ruby Kod Par&amp;ccedil;acığının daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-04-10 15:00:00</pubDate>
  <slug>ruby-kod-parcaciklari-34-struct-ve-openstruct</slug>
  <tags>
    <tag>ruby-kod-parçacıkları</tag>
    <tag>ruby</tag>
    <tag>struct</tag>
    <tag>openstruct</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>