<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Bir Python Uygulamasını git Tekniği ile Azure Platformuna Taşımak</title>
  <description>Çok sık kullanılan Azure öğretilerinden birisi bu. Amaç git yardımıyla Azure üzerinde deployment işlemi başlatmak. Ben bunu python ile denemek istedim. Bu sefer işim biraz daha zorlu. Nitekim WestWorld(Ubuntu 18.04, 64bit) topraklarını bir süreliğine terk ettim. Artık ahch-to(Mac Mini, High Sierra) adasındayım. Bu nedenle sistemde bazı şeyler eksik gibi görünüyor.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2019/08/41/ahchto.png" alt="" /&gt;Rey evrenin taaa bir ucundan kalkıp ahch-to gezegenine gelmiş ve Jedi ustasının onu eğitmesini istemişti. Galaksinin bir kez daha Luke Skywalker'a ihtiyacı vardı. Uzun zamandır inzivada olan Luke ise Kylo Ren'den sonra buna pek g&amp;ouml;n&amp;uuml;ll&amp;uuml; değildi. İzleyenler bilir. Luke, neredeyse sadece sudan ibaret ahch-to gezegenindeki&amp;nbsp;bir adada, eski Jedi tapınağında yaşamını s&amp;uuml;rd&amp;uuml;rmektedir&lt;em&gt;(Sevgili &lt;a href="https://eksisozluk.com/entry/78992085" target="_blank"&gt;ekşi s&amp;ouml;zl&amp;uuml;k yazarı John Harrison&lt;/a&gt; bu girişi beğenmeyecektir ama olsun :D )&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Peki&amp;nbsp;bu gezegeninin ger&amp;ccedil;ekte nerede olduğunu biliyor musunuz?&lt;/p&gt;
&lt;p&gt;Ahch-to, İrlanda'nın Kerry ilinin yaklaşık 11.6 km batısında yer alan Skellig Michael isimli bir ada aslında. Atlantik okyanusunda yer alan bu k&amp;uuml;&amp;ccedil;&amp;uuml;k ada &amp;uuml;st&amp;uuml;nde 6ncı y&amp;uuml;zyılda kurulan bir de manastır bulunuyor. Zaten filmde de Luke'un inzivaya &amp;ccedil;ekildiği yer benzer dini ve mistik karakteristikliklere sahip. Tarihi yapısını &amp;ouml;nemli derecede korumuş ve UNESCO tarafından 1996 yılında D&amp;uuml;nya Mirasları arasına alınmış bu adanın benim i&amp;ccedil;in anlamı ise yeni bir macera.&lt;/p&gt;
&lt;p&gt;Nitekim o cumartesi gecesi Westworld'&amp;uuml;&lt;em&gt;(Ubuntu 18.04, 64bit)&lt;/em&gt;&amp;nbsp;kenara koymuş &amp;ccedil;ok sık kullanılan Azure &amp;ouml;ğretilerinden birisini ahch-to &amp;uuml;st&amp;uuml;nde deniyordum. &amp;Ouml;ğretinin temel amacı git yardımıyla Azure &amp;uuml;zerinden deployment işlemi başlatabilmekti. Ben bunu bir python uygulaması i&amp;ccedil;in denemek istiyordum. Bu sefer işim biraz daha zorluydu. &amp;Ccedil;&amp;uuml;nk&amp;uuml;&amp;nbsp;&lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;cumartesi gecesi &amp;ccedil;alışmaları&lt;/a&gt;nın ikinci fazını yapmayı planladığım ahch-to&lt;em&gt;(Mac Mini, High Sierra)&lt;/em&gt;&amp;nbsp;adasındaydım. Derken d&amp;uuml;ğmeye bastım ve &amp;ouml;ğretiyi uygulamaya koyuldum. Pek tabii ahch-to gezegeninde eksikler vardı...&lt;/p&gt;
&lt;h2&gt;&amp;Ouml;n Gereksinimler ve Kurulumlar&lt;/h2&gt;
&lt;p&gt;Geliştireceğimiz &amp;ouml;rnek python flask paketini kullanan basit bir web uygulaması olacak. ahch-to sisteminde python'un 2.7 s&amp;uuml;r&amp;uuml;m&amp;uuml; mevcut&lt;em&gt;(ki bu sierra s&amp;uuml;r&amp;uuml;m&amp;uuml; ile y&amp;uuml;kl&amp;uuml; olarak geldi)&lt;/em&gt; lakin ben 3 &amp;uuml;zeri bir versiyon kullanmak istiyorum. Bu nedenle homebrew paket y&amp;ouml;netim aracından yararlanarak yeni bir kurulum ger&amp;ccedil;ekleştirdim&lt;em&gt;(Tabii homebrew de sistemde yoktu. Nasıl kurulacağının keşfini&amp;nbsp;size bırakıyorum)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;brew update
brew install python&lt;/pre&gt;
&lt;h3&gt;Azure CLI Kurulumu&lt;/h3&gt;
&lt;p&gt;Paket y&amp;ouml;neticisini kurduktan sonra Azure tarafındaki işlemler i&amp;ccedil;in yararlanılan CLI&lt;em&gt;(command-line interface)&lt;/em&gt; aracını da kurmak gerekiyor. Onu kurmak i&amp;ccedil;in ilk terminal komutunu kullanabiliriz. Pek tabi kurulum yeterli değil. Azure tarafı ile konuşabilmek i&amp;ccedil;in login işlemini de yapmamız lazım. İkinci terminal komutu bunun i&amp;ccedil;in&lt;em&gt;(Bu aşamada Azure'da bir hesabınız olduğunu varsayıyorum)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;brew install azure-cli
az login&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/08/41/credit_1.png" alt="" /&gt;&lt;/p&gt;
&lt;h3&gt;Azure Deployment Hazırlıkları&lt;/h3&gt;
&lt;p&gt;Uygulamayı Azure tarafına deploy edebilmek i&amp;ccedil;in de yapılması gerekenler var. Sırasıyla deployment user, resource group, service plan ve son olaraktan da bir web app oluşturmalıyız. Bunlar i&amp;ccedil;in aşağıdaki terminal komutlarını kullanarak ilerleyebiliz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;as webapp deployment user set --user-name dpyl-usr-buraks --password &amp;lt;azure kurallarına uyan bir şifre&amp;gt;
az group create --name rg-todoshero --location westeurope
az appservice plan create --name plan-todoshero --resource-group rg-todoshero --sku B1 --is-linux
az webapp create --resource-group rg-todoshero --plan plan-todoshero --name todosherowebapp --runtime "PYTHON|3.7" --deployment-local-git&lt;/pre&gt;
&lt;p&gt;İlk satırda dply-usr-buraks isimli bir kullanıcı tanımlıyoruz. Deployment işlemlerini bu kullanıcı yapacak. İkinci satırda veri tabanı, servis planlaması, kurulumu yapılacak uygulamalar gibi bu işimizle ilgili kaynakları grupladığımız bir tanımlama bulunuyor&lt;em&gt;(&amp;Ouml;rneğin Resource Group'u platformdan kaldırdığımızda bu grup altında hazırladığımız ne kadar Azure enstr&amp;uuml;manı varsa silinecektir)&lt;/em&gt; İşimizle ilgili kaynakları tek noktadan y&amp;ouml;netmek i&amp;ccedil;in a&amp;ccedil;tığımızı d&amp;uuml;ş&amp;uuml;nebilirsiniz. &amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; komutta bir servis planı oluşturmaktayız. Burada basic &amp;ouml;deme şartlarına g&amp;ouml;re oluşturulan ve linux tabanlı docker container kullanılan bir plan s&amp;ouml;z konusu. Son terminal komutu ile todosherowebapp isimli bir web uygulaması oluşturuyoruz. Bu servis uygulaması biraz &amp;ouml;nce oluşturlan servis planına g&amp;ouml;re hazırlanacak ve Python 3.7 s&amp;uuml;r&amp;uuml;m&amp;uuml; ile &amp;ccedil;alışacak. Sonda yer alan --deployment-local-git parametresi ile dağıtım planımızı&lt;em&gt;(git ile yapacağımızı)&lt;/em&gt;&amp;nbsp;belirtiyoruz.&lt;/p&gt;
&lt;p&gt;Terminalden &amp;ccedil;alıştırdığım komutlar başarılı olunca aşağıdaki sonu&amp;ccedil;la karşılaştım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/08/41/credit_3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulamanın web adresi todosherowebapp.azurewebsites.net olarak belirlenirken, github repository adresi de https://dply-usr-buraks@todosherowebapp.scm.azurewebsites.net/todosherowebapp.git şeklinde oluştu. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere varsayılan bir hoş geldin sayfamız bile var. Hatta doğrudan dok&amp;uuml;mantasyonlarına ulaşıp ilk geliştirmelerimizi yapabiliriz de &lt;em&gt;(Şu an aktif değil. Malum&amp;nbsp;kullanılmayacak bir servis olacağından sildim)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/08/41/credit_4.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Uygulamada Yapılanlar&lt;/h2&gt;
&lt;p&gt;&amp;Ouml;ncelikle local ortamımızda neler yaptığımız bir bakalım. Python tarafındaki &amp;ouml;rneğimiz son derece basit. Klas&amp;ouml;r ve dosya ağacı aşağıdaki gibi oluşturulabilir. Kritik noktalardan birisi requirements.txt dosya i&amp;ccedil;eriği.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;cd src
mkdir todayshero
touch todayshero/app.py
touch todayshero/requirements.txt
touch todayshero/.gitignore&lt;/pre&gt;
&lt;p&gt;Python kodumuzu i&amp;ccedil;eren app.py aşağıdaki gibi yazılabilir. Uygulama, web tarafından route adrese gelen taleplere karşılık i&amp;ccedil;indeki heros isimli listeden rastgele isim d&amp;ouml;nd&amp;uuml;rmek &amp;uuml;zere tasarlanmış durumda.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;from flask import Flask # basit web &amp;ouml;zelliklerini kazandırmak i&amp;ccedil;in
from random import seed
from random import randint  # Rastgele sayı &amp;uuml;retmek i&amp;ccedil;in

app = Flask(__name__)

# bir kahraman listemiz var
heros = ["thor", "wolverine", "iron man", "hulk", "doctor strane"
         "kira", "superman", "batman", "wonder woman"]

# k&amp;ouml;k adrese talep geldiğinde devreye giren metodumuz
@app.route("/")
def getRandomHero():
    randomIndex = randint(0, len(heros)-1) #0 ile listedeki eleman sayısı aralığında rastgele bir tam sayı &amp;uuml;retiyoruz
    return '&amp;lt;h2&amp;gt;'+heros[randomIndex]+'&amp;lt;/h2&amp;gt;' # sonucu html olarak d&amp;ouml;n&amp;uuml;yoruz
&lt;/pre&gt;
&lt;p&gt;Requirements.txt, Azure platformunun Python ortamlı deploy işlemi i&amp;ccedil;in kullanacağı bir dok&amp;uuml;man. Bu dosya i&amp;ccedil;erisine yazılan paketler, azure deploy işlemi sırasında pip ile uzak sunucu ortamına y&amp;uuml;klenmeye &amp;ccedil;alışılır. &amp;Ouml;rneğe g&amp;ouml;re son derece sade bir i&amp;ccedil;eriğimiz var (:&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;Flask==1.0.2&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;Bu arada ahch-to &amp;uuml;zerindeki denemeler i&amp;ccedil;in flask paketini geliştirme ortamına da y&amp;uuml;klememiz gerekiyor.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;pip3 install flask&lt;/pre&gt;
&lt;/blockquote&gt;
&lt;h2&gt;&amp;Ccedil;alışma Zamanı&lt;em&gt;(Local ortamda)&lt;/em&gt;&lt;/h2&gt;
&lt;p&gt;Kod tarafı hazır olduğuna g&amp;ouml;re uygulamayı &amp;ccedil;alıştırıp sonu&amp;ccedil;larını değerlendirebiliriz. İlk olarak local makine &amp;uuml;zerinden aşağıdaki terminal komutu ile ilerleyelim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;FLASK_APP=app.py flask run&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/08/41/credit_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sayfaya yeni talepler g&amp;ouml;nderdik&amp;ccedil;e farklı kahramanlar ile karşılaşmamız gerekiyor. Bu basit uygulama kodu list i&amp;ccedil;eriğinden se&amp;ccedil;tiği rastgele bir karakterin adını ekrana yazdırmakla g&amp;ouml;revli&lt;em&gt;(git ve azure ikilisinin bir arada kullanılması &amp;uuml;zerine yoğunlaştığımızdan m&amp;uuml;mk&amp;uuml;n mertebe basit bir &amp;ouml;rnek kullanıyoruz)&lt;/em&gt;&lt;/p&gt;
&lt;h2&gt;&amp;Ccedil;alışma Zamanı&lt;em&gt;(Git Deploy)&lt;/em&gt;&lt;/h2&gt;
&lt;p&gt;Artık programın &amp;ccedil;alıştığından eminiz. Dolayısıyla asıl dağıtım operasyonuna başlayabiliriz. Bunu git aracılığıyla&amp;nbsp;yapmak i&amp;ccedil;in aşağıdaki terminal komutlarını &amp;ccedil;alıştırmamız yeterli&lt;em&gt;(todoshero klas&amp;ouml;r&amp;uuml; altında)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;git init
git remote add azure https://dply-usr-buraks@todosherowebapp.scm.azurewebsites.net/todosherowebapp.git
git add .
git commit -m "Application has been added"
git push azure master&lt;/pre&gt;
&lt;p&gt;Standart git komutları ile uygulamayı azure reposuna deploy ettik. İlk olarak initialize işlemi var. Sonra uzak repo adresini ekliyoruz. T&amp;uuml;m kod dosyalarını . ile alıp commit ettikten sonra push &amp;ccedil;ağrısı ile değişikliklerimizi yolluyoruz.&lt;/p&gt;
&lt;p&gt;push işlemini takiben azure sitesine tekrar gittiğimde python uygulamasının başarılı bir şekilde etkinleştiğini g&amp;ouml;rmemiz lazım. Aşağıdakine benzer bir durum olmalı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/08/41/credit_5.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hatta Azure portaline baktığımızda hem oluşturulan resource group i&amp;ccedil;eriğini hem de yaptığımız son push işlemlerini de g&amp;ouml;rebilmeliyiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/08/41/credit_6.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/08/41/credit_7.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hepsi bu! :) Siz de farklı uygulama geliştirme ortamları i&amp;ccedil;in&lt;em&gt;(ruby, .net core, node.js vb)&lt;/em&gt; aynı kurguyu ger&amp;ccedil;ekleştirmeyi deneyebilirsiniz.&lt;/p&gt;
&lt;h2&gt;Ben Neler &amp;Ouml;ğrendim?&lt;/h2&gt;
&lt;p&gt;Yazılım &amp;uuml;r&amp;uuml;nlerinin resmi sitelerinde yer alan bu tip adım adım serileri konuyu artık &amp;ccedil;ok iyi &amp;ouml;ğretiyor. Mesleğe ilk başladığım zamanlarda neredeyse yok denecek kadar azdı. Hatta MSDN'in bile ilk yıllarındaki i&amp;ccedil;erik kalitesi olduk&amp;ccedil;a karışıktı. Ancak yeni nesil bu konuda epey şanslı. Peki &lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;saturday-night-works&lt;/a&gt; &amp;ccedil;alışmalarının &lt;a href="https://github.com/buraksenyurt/saturday-night-works/tree/master/No%2041%20-%20Python%20to%20Azure%20With%20Git" target="_blank"&gt;birinci fazının bu son &amp;ouml;rneği&lt;/a&gt;nde ben neler &amp;ouml;ğrendim dersiniz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;brew ile macOS platformuna paket y&amp;uuml;klemeyi&lt;/li&gt;
&lt;li&gt;azure CLI ile deployment user, resource group, service plan ve web app oluşturmayı&lt;/li&gt;
&lt;li&gt;git komutları ile kodu azure'a atmayı&lt;/li&gt;
&lt;li&gt;requirements.txt dosya i&amp;ccedil;eriğinin ne işe yaradığını&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir maceramızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2019-09-09 12:30:00</pubDate>
  <slug>bir-python-uygulamasini-git-teknigi-ile-azure-platformuna-tasimak</slug>
  <tags>
    <tag>python</tag>
    <tag>git</tag>
    <tag>azure</tag>
    <tag>continuous-integration</tag>
    <tag>continuous-deployment</tag>
    <tag>ci/cd</tag>
    <tag>cli</tag>
    <tag>azure-cli</tag>
    <tag>brew</tag>
    <tag>macos</tag>
    <tag>apple</tag>
    <tag>deployment-user</tag>
    <tag>resource-group</tag>
    <tag>service-plan</tag>
    <tag>docker</tag>
    <tag>cloud-computing</tag>
    <tag>cloud-services</tag>
    <tag>flask</tag>
  </tags>
  <categories>
    <category>python</category>
  </categories>
</post>