<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>GoLang - Pointers</title>
  <description>1993 yılında girdiğim Matematik Mühendisliği bölümünün bilgisayar programlama ağırlıklı bir müfredatı vardı. GWBasic ile başlayan maceramızda Pascal, C, C++, Cobol gibi programlama dillerine uğradık. Sınavlarımız çoğunlukla kağıt üzerinde olurdu. Basit for döngülerini dahi kağıt üzerinde yazarak algoritma çözmeye çalışırdık.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/02/Pointer_DePaulo_head.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;1993 yılında girdiğim Matematik M&amp;uuml;hendisliği b&amp;ouml;l&amp;uuml;m&amp;uuml;n&amp;uuml;n bilgisayar programlama ağırlıklı bir m&amp;uuml;fredatı vardı. GWBasic ile başlayan maceramızda Pascal, C, C++, Cobol gibi programlama dillerine uğradık. Sınavlarımız &amp;ccedil;oğunlukla kağıt &amp;uuml;zerinde olurdu. Basit for d&amp;ouml;ng&amp;uuml;lerini dahi kağıt &amp;uuml;zerinde yazarak algoritma &amp;ccedil;&amp;ouml;zmeye &amp;ccedil;alışırdık. Haliyle C gibi case-sensitive kuralların katı olduğu dillerde sınavlar epey zorlu ge&amp;ccedil;erdi.&lt;/p&gt;
&lt;p&gt;Hatırladığım kadarı ile en &amp;ccedil;ok zorlandığım ve hatta sonrasında ka&amp;ccedil;ınmaya &amp;ccedil;alıştığım konuların başında Pointer aritmetiği geliyordu. Pointer tipini &amp;ouml;ğrenmek kolay olsa da iş aritmetiğine gelince kafam karışmıyor değildi. Zamanla yeni &amp;ccedil;ıkan ve &amp;ouml;zellikle y&amp;ouml;netimli ortamlara sahip olan dillerde bu gibi konulara pek fazla rastlayamaz olduk. Hatta C# tarafında pointer kullanımı m&amp;uuml;mk&amp;uuml;n olsa da Unsafe kod konusuna girdiği i&amp;ccedil;in bilin&amp;ccedil;li bir şekilde &amp;ccedil;ekinerek yaklaştık.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Ne var ki Pointer kavramı halen ge&amp;ccedil;erliliğini koruyor&lt;em&gt;(Google'ladığınızda bu sevimli k&amp;ouml;pek t&amp;uuml;r&amp;uuml; de karşınıza &amp;ccedil;ıkıyor)&lt;/em&gt; Google'ın daha &amp;ccedil;ok kendisi i&amp;ccedil;in geliştirdiği, sistem seviyesinde y&amp;uuml;ksek performanslı işler yapmak i&amp;ccedil;in kullandığı Go dilinde de Pointer tipi mevcut. Tek fark aritmetiğinin olmaması diyebiliriz. Gelin bu kısa yazımızda Pointer tipini tanımaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;p&gt;Pointer bir değişkenin bellek adresini g&amp;ouml;sterir. G&amp;ouml;sterdiği değişkenin tipinde tanımlanır. Pointer denildiğinde * ve &amp;amp; operat&amp;ouml;rleri ile new fonksiyonu &amp;ouml;nem kazanır. &amp;amp; operat&amp;ouml;r&amp;uuml; değişken adreslerini bulmakta kullanılır. * operat&amp;ouml;r&amp;uuml; ile Pointer'ın işaret ettiği değer alınır&lt;em&gt;(Bu ise de-refere yada deference olarak anılır)&lt;/em&gt; new, Go ile gelen built-in fonksiyonlardan birisidir. Parametre olarak bir tip alır ve bellekte bu tipin sığacağı kadar yer ayırıp adresini geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Dolayısıyla i&amp;ccedil;ereceği değeri sonradan belli olacak bir alanın bellekte tahsis edilmesi ve adresinin yakalanması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Elbette akıllara gelen sorulardan birisi tahsis edilen bu bellek b&amp;ouml;lgesinin işi bitince temizlenmeye ihtiyacı olup olmayacağıdır. GO &amp;ccedil;alışma zamanında&amp;nbsp;bir garbage collector mekanizması s&amp;ouml;z konusudur ve bunu d&amp;uuml;ş&amp;uuml;nmemize gerek yoktur.&lt;/p&gt;
&lt;h1&gt;Merhaba Pointer&lt;/h1&gt;
&lt;p&gt;İlk olarak aşağıdaki basit bir kod par&amp;ccedil;ası ile işe başlayalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	)
	
func main(){
	age:=22	
	pAge:=&amp;amp;age
	fmt.Println("Address of age",pAge)
	fmt.Println("Age(from pointer)",*pAge)
	*pAge=41
	fmt.Println("Age=",age)
	fmt.Println("Age(from pointer)",*pAge)

	point:=1000
	pPoint:=&amp;amp;point
	*pPoint=*pPoint*2
	fmt.Println("point=",point)
}&lt;/pre&gt;
&lt;p&gt;Olayı irdelemek i&amp;ccedil;in &amp;ccedil;alışma zamanı sonu&amp;ccedil;larına bakalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/gopointer_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;pAge bir pointer oldu. Eşitliğin sağ tarafındaki &amp;amp; operat&amp;ouml;r&amp;uuml; izleyen age değişkeninin bellek adresini yakalıyor. Bu nedenle pAge i&amp;ccedil;eriğini ekrana bastığımızda bellek adresini g&amp;ouml;rebiliyoruz. pAge isimli Pointer'ın işerat ettiği adres b&amp;ouml;lgesindeki değeri almak i&amp;ccedil;in * operat&amp;ouml;r&amp;uuml; devreye giriyor. Sonrasında dikkat &amp;ccedil;ekici bir durum s&amp;ouml;z konusu. *pAge değerinde bir değişiklik yapıp yaşa 41 sayısını atıyoruz. pAge bir pointer olduğundan &amp;uuml;zerinden yapılan değişiklik aslında asıl işaret ettiği değişkenin değerinde ger&amp;ccedil;ekleşmekte. Bu nedenle age değişkeni de artık 41 değerine sahip oluyor. point yine bir tamsayı değişkeni ve bellek adresini pPoint &amp;uuml;zerinde taşıyoruz. * operat&amp;ouml;r&amp;uuml; pointer'ın işaret ettiği değişken değerini verdiğinden matematik işlemlerine de dahip edebiliyoruz. *pPoint'in 2 ile &amp;ccedil;arpımında bu &amp;ouml;zellik ele alınıyor. &amp;Ccedil;ok doğal olarak &amp;ccedil;arpma işlemi point değişkenini etkilemekte.&lt;/p&gt;
&lt;h1&gt;Fonksiyon Parametresi Olarak Pointer Kullanımı&lt;/h1&gt;
&lt;p&gt;İkinci &amp;ouml;rneğimizde ise pointer'ların fonksiyon parametrelerine olan etkisini inceleyeceğiz. Normalde fonksiyon parametreleri değer kopyalaması y&amp;ouml;ntemi ile kullanılırlar. Yani bir fonksiyona dışarıdan ge&amp;ccedil;ilen parametre değişkeni fonksiyon bloğu i&amp;ccedil;erisinde kopyalanarak değerlendirirlir. Bu nedenle fonksiyon &amp;ccedil;ağrımı yapılandan farklı bir değişken &amp;uuml;zerinde işlemler yapılır. Pointer kullanıldığında ise fonksiyona ge&amp;ccedil;en parametrenin adresi taşınır. Konuyu aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;ası ile daha iyi anlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import(
	"fmt"
	)
	
func main(){
	age:=41
	fmt.Println("main-age = ",age)
	fmt.Println("main-address of age",&amp;amp;age)
	call(age)
	fmt.Println("main-age = ",age)
	callWithPointer(&amp;amp;age)
	fmt.Println("main-age = ",age)
}

func call(value int){
	value+=1
	fmt.Println("call-value = ",value)
	fmt.Println("call-address of value",&amp;amp;value)
}

func callWithPointer(value *int){
	*value+=1
	fmt.Println("callWithPointer-value = ",*value)
	fmt.Println("callWithPointer-address of value",value)
}&lt;/pre&gt;
&lt;p&gt;Olaylar main fonksiyonunda tanımlı age isimli değişken &amp;uuml;zerinde gelişiyor. call parametre olarak değer bazlı değişken kullanmakta. Gelen age call fonksiyonunda değiştirilse bile main'deki age değerini etkilemiyor. callWithPointer i&amp;ccedil;inse durum b&amp;ouml;yle değil. callWithPointer i&amp;ccedil;erisine main fonksiyonundaki age değişkeninin adresi taşınıyor. Nitekim parametre bir pointer. Bu nedenle fonksiyon i&amp;ccedil;erisinde yapılan değişim main i&amp;ccedil;erisindeki age değişkeninde yapılmış oluyor. Konunun iyi anlaşılması i&amp;ccedil;in main'deki age ve fonksiyonlardaki parametre adreslerine dikkat etmenizi &amp;ouml;neririm. Kodun &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/gopointer_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;new ile Pointer Oluşturulması&lt;/h1&gt;
&lt;p&gt;Son olarak new fonksiyonunun kullanımına bir bakalım.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	)
	
func main(){
	nickP:=new(string)
	fmt.Println("Address ",nickP)
	fmt.Println("Current value",*nickP)
	*nickP="speedy gonzales"
	fmt.Printf("After assignment. '%s'\n",*nickP)
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnekte new ile string tipinden nickP isimli bir Pointer tanımlanmıştır. Sadece bellekte bunun i&amp;ccedil;in yer ayrılmıştır. Bu nedenle atama &amp;ouml;ncesi g&amp;uuml;ncel değeri yoktur. "Speedy Gonzales" atamasından sonra ise adres b&amp;ouml;lgesi veri ile doldurulmuştur. Kodun &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/goPointer_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Immutable&amp;nbsp;Struct&lt;/h1&gt;
&lt;p&gt;Immutable kavramı pek &amp;ccedil;ok dilde yer alır. Bir değişkenin durumunun değiştirilemez olduğu hali temsil eder. Go dilinde &amp;ouml;rneğin string değişkenler immutable tip olarak ge&amp;ccedil;erler. Yani oluşturulduktan sonra i&amp;ccedil;erikleri değiştirilemez. Struct tipi de immutable &amp;ouml;zellik taşımaktadır ancak fonksiyon parametresi olarak kullanıldıklarında durum değişir. &amp;Ouml;nceden de bahsettiğimiz gibi fonksiyonlara taşınan parametreler i&amp;ccedil;eride kopyalanırlar. Bu y&amp;uuml;zden struct tipinden bir değişkeni bir Go fonksiyonuna ge&amp;ccedil;tiğimizde&amp;nbsp;immutable &amp;ouml;zelliğini kaybeder. Aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	)

func main(){
	goBook:=Book{Title:"Learning GO",Category:"Programming Languages",ListPrice:35.00}
	fmt.Printf("%s(%s),%f\n",goBook.Title,goBook.Category,newPrice(goBook))
	fmt.Printf("%f\n",goBook.ListPrice)
}

func newPrice(book Book) float32 {
	book.ListPrice+=10
	return book.ListPrice
}

type Book struct{
	Title,Category string
	ListPrice float32
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnekte Book isimli bir struct kullanılıyor. Title, Category ve ListPrice isimli &amp;ouml;zellikleri var. newPrice fonksiyonu parametre olarak gelen bir kitabın liste fiyatını 10 birim arttırmakta. Dikkat edilmesi gereken nokta newPrice fonksiyonu i&amp;ccedil;erisinde ListPrice değerinin değiştirilmesine rağmen myBook değişkenindeki liste fiyatının değerini korumuş olmasıdır&lt;em&gt;(parametre değer t&amp;uuml;r&amp;uuml; olarak taşınmıştır)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/gopointer_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ancak tanımlanan struct değişkeni pointer olarak taşınırsa durum daha farklı olacaktır. * ve &amp;amp; operat&amp;ouml;rlerini devreye katarak kodu aşağıdaki hale getirelim.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;func main(){
	goBook:=Book{Title:"Learning GO",Category:"Programming Languages",ListPrice:35.00}
	fmt.Printf("%s(%s),%f\n",goBook.Title,goBook.Category,newPrice(&amp;amp;goBook))
	fmt.Printf("%f\n",goBook.ListPrice)
}

func newPrice(book *Book) float32 {
	book.ListPrice+=10
	return book.ListPrice
}&lt;/pre&gt;
&lt;p&gt;ve sonu&amp;ccedil;.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/gopointer_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Pointer tipinin tanımlanması ve kullanımı olduk&amp;ccedil;a basittir. B&amp;ouml;ylece geldik bir Gopher olma &amp;ccedil;alışmamızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-03-31 21:15:00</pubDate>
  <slug>golang-pointers</slug>
  <tags>
    <tag>go</tag>
    <tag>go-programming-language</tag>
    <tag>golang</tag>
    <tag>pointer</tag>
    <tag>referance-types</tag>
  </tags>
  <categories>
    <category>GoLang</category>
  </categories>
</post>