<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF - InstanceContextMode</title>
  <description>Windows Communication Foundation uygulamalarında istemciler başvurdukları servisler üzerindeki nesne örneklerini kullanırlar. Özellikle kullanılan bağlayıcının (binding) tipine göre servis üzerindeki nesne örneklerinin farklı şekillerde oluşturulup ele alınması söz konusudur. .Net Remoting ile uygulama yazan geliştiriciler, istemcilerin talepte bulunacağı uzak nesne örneklerinin farklı modellerde örneklendiklerini bilirler. Burada bahsi geçen modeller Server Activated Object için Singleton ve SingleCall ile Client Activated Object' dir. Örneğin CAO modeline göre istemciler, uzak nesneyi örneklediklerinde sunucu üzerinde bir referans oluşturulur ve istemciler bunu kullanır. Singleton ve SingleCall modelleri metod çağrıları sonucu referans oluşturulmasını sağlar. Ama Singleton modelinde her istemci için(dolayısıyla her metod çağrısı için) aynı nesne örneği, SingleCall' da ise her metod çağrısı için ayrı bir nesne örneği sunucu üzerinde oluşturulmaktadır.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Windows Communication Foundation uygulamalarında istemciler başvurdukları servisler &amp;uuml;zerindeki nesne &amp;ouml;rneklerini kullanırlar. &amp;Ouml;zellikle kullanılan bağlayıcının (binding) tipine g&amp;ouml;re servis &amp;uuml;zerindeki nesne &amp;ouml;rneklerinin farklı şekillerde oluşturulup ele alınması s&amp;ouml;z konusudur. &lt;strong&gt;.Net Remoting&lt;/strong&gt; ile uygulama yazan geliştiriciler, istemcilerin talepte bulunacağı uzak nesne &amp;ouml;rneklerinin farklı modellerde &amp;ouml;rneklendiklerini bilirler.&lt;/p&gt;
&lt;p&gt;Burada bahsi ge&amp;ccedil;en modeller &lt;strong&gt;Server Activated Object&lt;/strong&gt; i&amp;ccedil;in &lt;strong&gt;Singleton&lt;/strong&gt; ve &lt;strong&gt;SingleCall&lt;/strong&gt; ile &lt;strong&gt;Client Activated Object&lt;/strong&gt;' dir. &amp;Ouml;rneğin CAO modeline g&amp;ouml;re istemciler, uzak nesneyi &amp;ouml;rneklediklerinde sunucu &amp;uuml;zerinde bir referans oluşturulur ve istemciler bunu kullanır. Singleton ve SingleCall modelleri metod &amp;ccedil;ağrıları sonucu referans oluşturulmasını sağlar. Ama Singleton modelinde her istemci i&amp;ccedil;in(dolayısıyla her metod &amp;ccedil;ağrısı i&amp;ccedil;in) aynı nesne &amp;ouml;rneği, SingleCall' da ise her metod &amp;ccedil;ağrısı i&amp;ccedil;in ayrı bir nesne &amp;ouml;rneği sunucu &amp;uuml;zerinde oluşturulmaktadır.&lt;/p&gt;
&lt;p&gt;Benzer durumlar WCF servislerindeki nesne &amp;ouml;rnekleri i&amp;ccedil;inde ge&amp;ccedil;erlidir. İstemci uygulama ile servis &amp;ouml;rneği arasındaki ilişkiyi kontrol altına alabilmek i&amp;ccedil;in &lt;strong&gt;ServiceBehavior&lt;/strong&gt; niteliğinin &lt;strong&gt;InstanceContextMode&lt;/strong&gt; &amp;ouml;zelliğinden yararlanılır. InstanceContextMode &amp;ouml;zelliği InstanceContextMode enum sabiti tipinden bir değer almaktadır ve alabileceği değerler &lt;strong&gt;PerSession&lt;/strong&gt;, &lt;strong&gt; PerCall&lt;/strong&gt; ve &lt;strong&gt;Single&lt;/strong&gt;' dır. Bu modlardan hangisinin aktif olduğu &amp;ouml;zellikle WCF uygulamalarında &lt;strong&gt;oturum y&amp;ouml;netimi (Session Management)&lt;/strong&gt; a&amp;ccedil;ısından da &amp;ouml;nemlidir.&lt;/p&gt;
&lt;p&gt;Varsayılan olarak her istemci i&amp;ccedil;in sunucuda bir adet nesne &amp;ouml;rneği oluşturulur. Servis &amp;ouml;rneği istemciden gelen ilk operasyon &amp;ccedil;ağrısında (yani ilk metod &amp;ccedil;ağrısında) oluşur. İstemci sunucu ile olan bağlantısını kesene kadarda servis &amp;ouml;rneği sunucuda kalmaya devam eder. Ancak binlerce kullanıcının servise bağlandığı durumlarda da her istemci i&amp;ccedil;in bir servis &amp;ouml;rneğinin sunucuda oluşturulması ve ne zaman kalkacaklarının istemcinin hareketine bağlı olması sunucu belleğinin gereksiz yere şişirilmesi anlamına gelir. Dolayısıla diğer modeller g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Binding Tipine g&amp;ouml;re Instance Mode t&amp;uuml;rlerinden hangisinin uygulanabileceği değişir. &amp;Ouml;rneğin &lt;strong&gt;BasicHttpBinding&lt;/strong&gt;, Http protokol&amp;uuml;n&amp;uuml;n doğası gereği iletişim seviyesinde (transport level) PerSession mode t&amp;uuml;r&amp;uuml;n&amp;uuml; desteklemez. Bir başka deyişle &lt;strong&gt;InstanceContectMode&lt;/strong&gt; hangi değeri alırsa alsın varsayılan olarak &lt;strong&gt;PerCall&lt;/strong&gt; modda &amp;ccedil;alışır. Buda gelecek her istemci operasyon &amp;ccedil;ağrısı i&amp;ccedil;in servis tarafında bir nesne &amp;ouml;rneğinin oluşturulması ve operasyon tamamlandığında kaldırılmak &amp;uuml;zere Garbage Collector' e devredilmesi anlamına gelir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;İlk olarak PerSession, PerCall ve Single modellerinin nasıl &amp;ccedil;alıştıklarını teorik olarak bilmekte fayda vardır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;PerSession Modeli;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;PerSession modunda istemciler ilk operasyon &amp;ccedil;ağrısında bulunduklarında servis &amp;ouml;rneği oluşturulur ve istemci &lt;strong&gt;Close&lt;/strong&gt; metodunu kullanana kadar yada uygulamayı kapatana kadar s&amp;ouml;z konusu &amp;ouml;rnek sunucuda kalır. İstemci, bir servis &amp;ouml;rneğini elde ettikten sonra bu &amp;ouml;rnek sadece ilgili istemciye ait olacak şekilde tahsis edilir. Bir anlamda o istemci i&amp;ccedil;in bir &lt;strong&gt;oturum(Session)&lt;/strong&gt; a&amp;ccedil;ılmış olur. Farklı istemcilerin aynı oturumu kullanmaları m&amp;uuml;mk&amp;uuml;n değildir. İstemci uygulamalarda &lt;strong&gt;&amp;ccedil;ok kanallı (multithread)&lt;/strong&gt; kod par&amp;ccedil;aları olabileceği d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde eşzamanlı olarak aynı oturuma ait metod &amp;ccedil;ağrıları s&amp;ouml;z konusu olabilir. Varsayılan olarak bir talep tamamlanmadan başka bir talep gelirse &amp;ouml;ncekinin tamamlanması beklenmektedir. Ama istenirse bu davranış bi&amp;ccedil;imide &lt;strong&gt;ServiceBehavior&lt;/strong&gt; niteliğinin &lt;strong&gt;ConcurrencyMode&lt;/strong&gt; &amp;ouml;zelliği ile değiştirilebilir. Yani istenirse eş zamanlı olarak &amp;ccedil;ağrılara cevap verilmesi de sağlanabilir.&lt;/p&gt;
&lt;p&gt;Bu mod kullanılırken, istemci tarafından &amp;ccedil;alıştırılabilecek operasyonlar i&amp;ccedil;in bir sıralama belirtilmek istenebilir. &amp;Ouml;rneğin hangi metod &amp;ccedil;ağrısı ile servis &amp;ouml;rneğinin oluşturulacağının belirtilmesi veya hangi metod &amp;ccedil;ağrısından sonra servis &amp;ouml;rneğinin yok edileceğinin belirtilmesi gibi. Bunun i&amp;ccedil;in de &lt;strong&gt;OperationContract&lt;/strong&gt; niteliğinin &lt;strong&gt;IsInitiating&lt;/strong&gt; ve &lt;strong&gt;IsTerminating&lt;/strong&gt; &amp;ouml;zellikleri kullanılır. IsInitiating &amp;ouml;zelliğine true değeri atandığında, ilgili metoda bir &amp;ccedil;ağrı geldiği zaman servis nesnesi &amp;ouml;rneklenecektir. Elbetteki aynı metoda oturum s&amp;uuml;resince yeni bir &amp;ccedil;ağrı gelebilir. Bu durumda yeni bir servis &amp;ouml;rneği oluşturulmaz. Eğer false değeri verilirse s&amp;ouml;z konusu metoda yapılan &amp;ccedil;ağrı sonrasında servise ait bir &amp;ouml;rnek oluşturulmaz. &lt;strong&gt;IsTerminating&lt;/strong&gt; &amp;ouml;zelliğine true değeri atandığı takdirde, ilgili metoda dair s&amp;ouml;z konusu operasyon tamamlandığında servis &amp;ouml;rneği otomatik olarak yok edilir. Yani istemcinin Close metodunu &amp;ccedil;ağırmasına gerek kalmaz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;PerCall Modeli;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;PerCall modunda, istemcinin yaptığı her operasyon &amp;ccedil;ağrısında servis uygulamasının &amp;ccedil;alıştığı sistem &amp;uuml;zerinde bir nesne &amp;ouml;rneği oluşturulur ve operasyon tamamlandığında(bir başka deyişle metod &amp;ccedil;ağrısı sonlandığında) bu &amp;ouml;rnek yok edilir. Bu sebepten oturum y&amp;ouml;netimi &lt;strong&gt;PerSession&lt;/strong&gt; moduna g&amp;ouml;re daha zordur. Bu nedenle oturum y&amp;ouml;netimi adına istemcinin kendisini her operasyon &amp;ccedil;ağrısında servise tanıtabilmesini sağlayacak bir sistem gerekebilir. Ne varki sunucu kaynaklarının idareli kullanılması adına verimli bir modeldir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Single Modeli;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Single modunda, servis &amp;ouml;rneği yine istemci tarafından gelecek ilk operasyon &amp;ccedil;ağrısında oluşturulur. Ne var ki &lt;strong&gt;PerSession&lt;/strong&gt; modelinden farklı olarak var olan istemcinin ve diğer istemci uygulamaların metod &amp;ccedil;ağrıları i&amp;ccedil;in servis uygulaması &amp;uuml;zerindeki aynı nesne &amp;ouml;rneği kullanılır. S&amp;ouml;z konusu servis &amp;ouml;rneğinin yok edilmesi ise sadece host uygulamanın kapatılması ile ger&amp;ccedil;ekleşebilir. Bu teknik kaynak y&amp;ouml;netimi adına maksimum faydayı sağlar. Ayrıca t&amp;uuml;m kullanıcıların aynı veriyi paylaşması &amp;ccedil;ok daha kolaylaşır. Lakin burada servisin &lt;strong&gt;single thread&lt;/strong&gt; olup olmadığına dikkat etmek gerekir. Eğer &amp;ouml;yleyse istemcilerden gelecek talepler sonrası &lt;strong&gt;zaman aşımları (timeout)&lt;/strong&gt; s&amp;ouml;z konusu olabilir. Bunun i&amp;ccedil;in &lt;strong&gt;ConcurrencyMode&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;Multiple&lt;/strong&gt; değeri atanarak &lt;strong&gt;thread-safe&lt;/strong&gt; bir ortam sağlanabilir.&lt;/p&gt;
&lt;p&gt;Şimdi &amp;ouml;rnek bir uygulama &amp;uuml;zerinden bu modelleri incelemeye &amp;ccedil;alışalım. &amp;Ouml;rnek uygulamada Tcp protokol&amp;uuml; baz alınmaktadır ve bu nedenle &lt;strong&gt;NetTcpBinding&lt;/strong&gt; bağlayıcı tipi kullanılmaktadır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Tcp protokol&amp;uuml; i&amp;ccedil;in varsayılan olarak eş zamanlı bağlantı sayısı &lt;strong&gt;maksimum 10&lt;/strong&gt; dur. Ancak istenirse binding configuration kısmından &lt;strong&gt;MaxConfiguration&lt;/strong&gt; &amp;ouml;zelliği ile bu değiştirilebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk205_1.gif" alt="" width="332" height="189" border="0" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;İlk olarak WCF Library şablonunda bir sınıf k&amp;uuml;t&amp;uuml;phanesi geliştirelim. Bu sınıf k&amp;uuml;t&amp;uuml;phanesi i&amp;ccedil;erisinde yer alan tipler ve i&amp;ccedil;erikleri aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk205_2.gif" alt="" width="573" height="285" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Servis s&amp;ouml;zleşmesini tanımlayan IUrunYonetici interface(aray&amp;uuml;z) kodları aşağıdaki gibidir;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace UrunYonetimKutuphanesi
{
    [ServiceContract(Name="UrunYonetimServisi", Namespace="http://www.bsenyurt.com/UrunYonetimServisi")]
    public interface IUrunYonetici
    {
        [OperationContract()]
        void SepeteUrunEkle(string urunId);
        [OperationContract()]
        void SepettenUrunCikar(string urunId);
        [OperationContract()]
        void SiparisVer();
    }
}&lt;/pre&gt;
&lt;p&gt;Aray&amp;uuml;z&amp;uuml; uygulayan UrunYonetici sınıfının kodları aşağıdaki gibidir;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.IO;
using System.Text;
using System.Threading;
using System.ServiceModel;

namespace UrunYonetimKutuphanesi
{
    [ServiceBehavior()]
    public class UrunYonetici:IUrunYonetici,IDisposable
    {
        private FileStream fStr;
        private StreamWriter writer;
        private StringBuilder builder;

        public UrunYonetici()
        {
            Thread.Sleep(500);
            builder = new StringBuilder(); 
            builder.AppendLine(DateTime.Now.ToLongTimeString() + ": UrunYonetici nesnesi oluşturuldu.");
        }
        #region IUrunYonetici Members

        public void SepeteUrunEkle(string urunId)
        {
            Thread.Sleep(500);
            builder.AppendLine(DateTime.Now.ToLongTimeString() + ": Urun ekle metodu &amp;ccedil;ağırıldı.");
        }

        public void SepettenUrunCikar(string urunId)
        {
            Thread.Sleep(500);
            builder.AppendLine(DateTime.Now.ToLongTimeString() + ": Urun &amp;ccedil;ıkart metodu &amp;ccedil;ağırıldı.");
        }

        public void SiparisVer()
        {
            Thread.Sleep(500);
            builder.AppendLine(DateTime.Now.ToLongTimeString() + ": Sipariş ver metodu &amp;ccedil;ağırıldı.");
        }

        #endregion

        #region IDisposable Members
    
        public void Dispose()
        {
            Thread.Sleep(500);
            builder.AppendLine(DateTime.Now.ToLongTimeString() + ": UrunYonetici nesnesi i&amp;ccedil;in Dispose metodu &amp;ccedil;alıştırıldı.");
            builder.AppendLine("");
            fStr = new FileStream("Izleyici.txt", FileMode.Append, FileAccess.Write);
            writer = new StreamWriter(fStr);
            writer.Write(builder.ToString());
            writer.Close();
            fStr.Close();
        }

        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;UrunYonetici sınıfı i&amp;ccedil;erisinde bir alışveriş sepetine &amp;uuml;r&amp;uuml;n ekleme, &amp;uuml;r&amp;uuml;n &amp;ccedil;ıkarma veya sipariş verme gibi &amp;ouml;rnek fonksiyonellikler vardır. &amp;Ouml;zellikle nesneye ait &amp;ouml;rneklerin ne zaman oluşturulduğunu incelemek adına &lt;strong&gt;FileStream, StreamWriter ve StringBuilder&lt;/strong&gt; tiplerinden yararlanılmakta ve &lt;strong&gt;Izleyici.txt&lt;/strong&gt; isimli dosyaya log bilgileri aktarılmaktadır. Burada dikkat edilmesi gereken noktalardan biriside sınıfa &lt;strong&gt;IDisposable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n uygulanmış olmasıdır. Bunun tek sebebi &lt;strong&gt;Garbaga Collector&lt;/strong&gt;' un nesneyi dispose etmeden &amp;ouml;nce log dosyasına gereken bilgileri aktarmaktır. ServiceBehavior niteliğinde &amp;ouml;zel olarak &lt;strong&gt; InstanceContextMode&lt;/strong&gt; değeri verilmemiştir. Nitekim varsayılan değeri &lt;strong&gt;PerSession&lt;/strong&gt;' dır. Şimdi &amp;ouml;rnek sunucu ve istemci uygulamalarını geliştirerek devam edelim. Servis uygulaması bir windows uygulamasıdır ve aşağıdaki kodlardan oluşmaktadır. &lt;em&gt;(Servis uygulamasının &lt;strong&gt;System.ServiceModel &lt;/strong&gt;ve UrunYonetimKutuphanesi assembly' larını referans etmesi gerektiğini hatırlayalım.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Servis tarafındaki windows formu;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk205_3.gif" alt="" width="307" height="200" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Servis tarafındaki kodlar;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace ServerApp
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }

        ServiceHost host;

        private void btnBaslat_Click(object sender, EventArgs e)
        {
            host = new ServiceHost(typeof(UrunYonetici));
            host.Open();
            lstDurum.Items.Add(DateTime.Now.ToLongTimeString() + host.State); 
        }

        private void btnBitir_Click(object sender, EventArgs e)
        {
            host.Close();
            lstDurum.Items.Add(DateTime.Now.ToLongTimeString() + host.State);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Host uygulamada servisi &amp;ccedil;alıştırmak i&amp;ccedil;in &lt;strong&gt;Open&lt;/strong&gt;, kapatmak i&amp;ccedil;inse &lt;strong&gt;Close&lt;/strong&gt; metodları kullanılmaktadır. Bununla birlikte servis uygulaması UrunYonetici tipini hizmete sunar. Bağlantı i&amp;ccedil;in gereken t&amp;uuml;m konfigurasyon ayarları aşağıda &amp;ccedil;ıktısı g&amp;ouml;r&amp;uuml;len App.config dosyasından elde edilmektedir.&lt;/p&gt;
&lt;p&gt;Servis tarafı i&amp;ccedil;in&lt;strong&gt; App.config&lt;/strong&gt; i&amp;ccedil;eriği;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;behaviors /&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service behaviorConfiguration="" name="UrunYonetimKutuphanesi.UrunYonetici"&amp;gt;
                &amp;lt;endpoint address="net.tcp://localhost:4560/UrunYonetim.svc" binding="netTcpBinding" bindingConfiguration="" name="UrunYonetimServiceEndPoint" contract="UrunYonetimKutuphanesi.IUrunYonetici" /&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Baştada belirtildiği gibi Http yerine Tcp iletişim protokol&amp;uuml;n&amp;uuml; kullanan bir sistem ele alınmaktadır. Bu nedenle NetTcpBinding bağlayıcı tipi kullanılmaktadır.&lt;/p&gt;
&lt;p&gt;İstemci tarafı basit bir Console uygulaması olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. İstemci tarafında, uzak nesnenin kullanılabilmesi i&amp;ccedil;in fiziki proxy sınıfınında &amp;uuml;retilmiş olması gerekir. Bu ama&amp;ccedil;la yine &lt;strong&gt;svcutil.exe &lt;/strong&gt;aracı kullanılmaktadır. Servis Http &amp;uuml;zerinden &lt;strong&gt;metadata publishing&lt;/strong&gt; yapmadığından, &amp;ouml;nce k&amp;uuml;t&amp;uuml;phane &amp;uuml;zerinden gerekli &lt;strong&gt;wsdl&lt;/strong&gt; ve &lt;strong&gt;schema&lt;/strong&gt; dosyaları elde edilmeli ve sonrasında bu bilgilerden faydalanarak gereken &lt;strong&gt;proxy&lt;/strong&gt; sınıfı oluşturulmalıdır.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;nce komut satırından UrunYonetimKutuphanesi.dll bulunur ve&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;\&amp;gt; svcutil UrunYonetimKutuphanesi.dll&lt;/pre&gt;
&lt;p&gt;&amp;ccedil;alıştırılır. Ardından&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;\&amp;gt;svcutil www.bsenyurt.com.UrunYonetimServisi.wsdl *.xsd /out:UrunYonetimClient.cs&lt;/pre&gt;
&lt;p&gt;komutları &amp;ccedil;alıştırılmalı ve &amp;uuml;retilen UrunYonetimClient.cs ve output.config dosyaları istemci uygulamaya dahil edilmelidir. Output.config dosyasını &lt;strong&gt;App.config&lt;/strong&gt; adıyla kaydetmekte yarar vardır. Nitekim istemci uygulama konfigurasyon ayaları i&amp;ccedil;in bu dosyayı arayacaktır. İstemci uygulama konfigurasyon dosyası aşağıdaki şekilde daha kısa olarak modifiye edilebilir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8"?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;client&amp;gt;
            &amp;lt;endpoint address="net.tcp://localhost:4560/UrunYonetim.svc" binding="netTcpBinding" bindingConfiguration="" contract="UrunYonetimServisi" name="DefaultBinding_UrunYonetimServisi_UrunYonetimServisi" /&amp;gt;
        &amp;lt;/client&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;İstemci uygulama kodları aşağıdaki gibidir;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace ClientApp
{
    class Program
    {
        static void Main(string[] args)
        {
            UrunYonetimServisiClient srv = new UrunYonetimServisiClient("DefaultBinding_UrunYonetimServisi_UrunYonetimServisi");
            srv.SepeteUrunEkle("1000");
            srv.SepeteUrunEkle("1004");
            srv.SepettenUrunCikar("1000");
            srv.SiparisVer();
            Console.WriteLine("Uygulamadan &amp;Ccedil;ıkmak i&amp;ccedil;in Bir Tuşa Basın");
            Console.ReadLine();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İstemci uygulamada nesne &amp;ouml;rneği oluşturulduktan sonra bir dizi metod &amp;ccedil;ağırımı ger&amp;ccedil;ekleştirilmektedir. Şimdi uygulamayı bu haliyele test edelim. &amp;Ouml;ncelikli olarak servis uygulaması &amp;ccedil;alıştırılmalı ve Başlat d&amp;uuml;ğmesine basılarak servis a&amp;ccedil;ılmalıdır. Sonrasında istemci uygulamadan bir ka&amp;ccedil; tane &amp;ouml;rnek &amp;ccedil;alıştırmakta fayda vardır. B&amp;ouml;ylece farklı istemciler i&amp;ccedil;in servis nesnesinin ne şekilde &amp;ouml;rneklendiği daha kolay takip edilebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk205_4.gif" alt="" width="354" height="365" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu deneme sonrasında servis uygulamasının bulunduğu klas&amp;ouml;rde &lt;strong&gt;Izleyici.txt&lt;/strong&gt; isimli bir dosya oluşacak ve i&amp;ccedil;eriği aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk205_5.gif" alt="" width="443" height="182" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;17:31:53: UrunYonetici nesnesi oluşturuldu.
17:31:53: Urun ekle metodu &amp;ccedil;ağırıldı.
17:31:54: Urun ekle metodu &amp;ccedil;ağırıldı.
17:31:55: Urun &amp;ccedil;ıkart metodu &amp;ccedil;ağırıldı.
17:31:55: Sipariş ver metodu &amp;ccedil;ağırıldı.
17:31:57: UrunYonetici nesnesi i&amp;ccedil;in Dispose metodu &amp;ccedil;alıştırıldı.

17:31:51: UrunYonetici nesnesi oluşturuldu.
17:31:51: Urun ekle metodu &amp;ccedil;ağırıldı.
17:31:52: Urun ekle metodu &amp;ccedil;ağırıldı.
17:31:52: Urun &amp;ccedil;ıkart metodu &amp;ccedil;ağırıldı.
17:31:54: Sipariş ver metodu &amp;ccedil;ağırıldı.
17:31:58: UrunYonetici nesnesi i&amp;ccedil;in Dispose metodu &amp;ccedil;alıştırıldı.

17:31:48: UrunYonetici nesnesi oluşturuldu.
17:31:48: Urun ekle metodu &amp;ccedil;ağırıldı.
17:31:49: Urun ekle metodu &amp;ccedil;ağırıldı.
17:31:49: Urun &amp;ccedil;ıkart metodu &amp;ccedil;ağırıldı.
17:31:50: Sipariş ver metodu &amp;ccedil;ağırıldı.
17:31:59: UrunYonetici nesnesi i&amp;ccedil;in Dispose metodu &amp;ccedil;alıştırıldı.&lt;/pre&gt;
&lt;p&gt;Dikkat edilecek olursa &amp;ccedil;alıştırılan 3 istemci i&amp;ccedil;in 3 ayrı UrunYonetici nesne &amp;ouml;rneği oluşturulmuş ve bu istemcilerin yapmış olduğu metod &amp;ccedil;ağrılarının tamamı sona erdiğinde nesneler &lt;strong&gt;dispose&lt;/strong&gt; edilmek &amp;uuml;zere Garbage Collector' e devredilmeye başlanmıştır. Bu durum &lt;strong&gt;NetTcpBinding&lt;/strong&gt; i&amp;ccedil;in varsayılan davranıştır ve &lt;strong&gt;PerSession&lt;/strong&gt; modunun karşılığıdır. Eğer servis nesneleri PerCall veya Single modeline g&amp;ouml;re &amp;ccedil;alıştırmak istenirse yapılması gereken &lt;strong&gt;ServiceBehavior&lt;/strong&gt; niteliğini aşağıdaki gibi değiştirmektir. İlk olarak PerCall yapıldığındaki durumu analiz edelim.&lt;/p&gt;
&lt;p&gt;UrunYonetici sınıfındaki değişiklik aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[ServiceBehavior(InstanceContextMode=InstanceContextMode.PerCall)]
public class UrunYonetici:IUrunYonetici,IDisposable&lt;/pre&gt;
&lt;p&gt;Buna g&amp;ouml;re yine &amp;ouml;rnek olarak 3 istemci &amp;ccedil;alıştırıp denersek Istemci.txt dosyasının i&amp;ccedil;eriği aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;17:37:09: UrunYonetici nesnesi oluşturuldu.
17:37:09: Urun ekle metodu &amp;ccedil;ağırıldı.
17:37:10: UrunYonetici nesnesi i&amp;ccedil;in Dispose metodu &amp;ccedil;alıştırıldı.

17:37:10: UrunYonetici nesnesi oluşturuldu.
17:37:11: Urun ekle metodu &amp;ccedil;ağırıldı.
17:37:11: UrunYonetici nesnesi i&amp;ccedil;in Dispose metodu &amp;ccedil;alıştırıldı.

17:37:13: UrunYonetici nesnesi oluşturuldu.
17:37:14: Urun ekle metodu &amp;ccedil;ağırıldı.
17:37:14: UrunYonetici nesnesi i&amp;ccedil;in Dispose metodu &amp;ccedil;alıştırıldı.

17:37:15: UrunYonetici nesnesi oluşturuldu.
17:37:15: Urun ekle metodu &amp;ccedil;ağırıldı.
17:37:16: UrunYonetici nesnesi i&amp;ccedil;in Dispose metodu &amp;ccedil;alıştırıldı.

17:37:16: UrunYonetici nesnesi oluşturuldu.
17:37:17: Urun &amp;ccedil;ıkart metodu &amp;ccedil;ağırıldı.
17:37:17: UrunYonetici nesnesi i&amp;ccedil;in Dispose metodu &amp;ccedil;alıştırıldı.

17:37:18: UrunYonetici nesnesi oluşturuldu.
17:37:18: Urun ekle metodu &amp;ccedil;ağırıldı.
17:37:19: UrunYonetici nesnesi i&amp;ccedil;in Dispose metodu &amp;ccedil;alıştırıldı.

17:37:19: UrunYonetici nesnesi oluşturuldu.
17:37:20: Urun &amp;ccedil;ıkart metodu &amp;ccedil;ağırıldı.
17:37:20: UrunYonetici nesnesi i&amp;ccedil;in Dispose metodu &amp;ccedil;alıştırıldı.

17:37:21: UrunYonetici nesnesi oluşturuldu.
17:37:21: Sipariş ver metodu &amp;ccedil;ağırıldı.
17:37:22: UrunYonetici nesnesi i&amp;ccedil;in Dispose metodu &amp;ccedil;alıştırıldı.

17:37:22: UrunYonetici nesnesi oluşturuldu.
17:37:23: Urun &amp;ccedil;ıkart metodu &amp;ccedil;ağırıldı.
17:37:23: UrunYonetici nesnesi i&amp;ccedil;in Dispose metodu &amp;ccedil;alıştırıldı.

17:37:24: UrunYonetici nesnesi oluşturuldu.
17:37:24: Sipariş ver metodu &amp;ccedil;ağırıldı.
17:37:25: UrunYonetici nesnesi i&amp;ccedil;in Dispose metodu &amp;ccedil;alıştırıldı.&lt;/pre&gt;
&lt;p&gt;Dikkat edilecek olursa, istemcilerden gelen her metod &amp;ccedil;ağrısında UrunYonetici sınıfına ait bir &amp;ouml;rnek oluşturulmuş ve metod işleyişi servis tarafında tamamlandıktan sonra s&amp;ouml;z konusu &amp;ouml;rnekler toplanmak &amp;uuml;zere Garbage Collector' e devredilmiştir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Single&lt;/strong&gt; modunda test işlemini yapmak i&amp;ccedil;in yine UrunYonetici sınıfına uygulanan &lt;strong&gt;ServiceBehavior&lt;/strong&gt; niteliğinde aşağıdaki değişiklik yapılmalıdır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[ServiceBehavior(InstanceContextMode=InstanceContextMode.Single)]
public class UrunYonetici:IUrunYonetici,IDisposable&lt;/pre&gt;
&lt;p&gt;Tekrar, &amp;ouml;rnek olarak 3 istemci &amp;ccedil;alıştırılıp test edilirse Izleyici.txt dosyasına aşağıdaki bilgilerin yazıldığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;17:45:13: UrunYonetici nesnesi oluşturuldu.
17:45:16: Urun ekle metodu &amp;ccedil;ağırıldı.
17:45:16: Urun ekle metodu &amp;ccedil;ağırıldı.
17:45:17: Urun &amp;ccedil;ıkart metodu &amp;ccedil;ağırıldı.
17:45:17: Urun ekle metodu &amp;ccedil;ağırıldı.
17:45:18: Sipariş ver metodu &amp;ccedil;ağırıldı.
17:45:18: Urun ekle metodu &amp;ccedil;ağırıldı.
17:45:19: Urun ekle metodu &amp;ccedil;ağırıldı.
17:45:19: Urun &amp;ccedil;ıkart metodu &amp;ccedil;ağırıldı.
17:45:20: Urun ekle metodu &amp;ccedil;ağırıldı.
17:45:20: Sipariş ver metodu &amp;ccedil;ağırıldı.
17:45:21: Urun &amp;ccedil;ıkart metodu &amp;ccedil;ağırıldı.
17:45:22: Sipariş ver metodu &amp;ccedil;ağırıldı.
17:45:29: UrunYonetici nesnesi i&amp;ccedil;in Dispose metodu &amp;ccedil;alıştırıldı.&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ka&amp;ccedil; istemci olursa olsun hepsi i&amp;ccedil;in tek bir UrunYonetici nesne &amp;ouml;rneği oluşturulmuştur.&lt;/p&gt;
&lt;p&gt;Makalemizin başında &amp;ouml;zellikle PerSession modunda hangi metod &amp;ccedil;ağrısı ile nesne &amp;ouml;rneğinin oluşturulabileceğini veya hangi metod &amp;ccedil;ağrısından sonra servise ait nesne &amp;ouml;rneğinin yok edilebileceğini &lt;strong&gt;IsInitiating&lt;/strong&gt; ve &lt;strong&gt; IsTerminating&lt;/strong&gt; &amp;ouml;zellikleri ile belirtebileceğimizi s&amp;ouml;ylemiştik. Bu modların kullanılabilmesi i&amp;ccedil;in ayrıca &lt;strong&gt;SessionMode&lt;/strong&gt; &amp;ouml;zelliğinin değerinin &lt;strong&gt;Required&lt;/strong&gt; olarak işaretlenmiş olması gerekmektedir. Nitekim s&amp;ouml;z konusu operasyonların takibi i&amp;ccedil;in bir oturumun var olması gerekir. Aşağıdaki kod par&amp;ccedil;asında s&amp;ouml;z konusu sistemin IUrunYonetici aray&amp;uuml;z&amp;uuml;ne uygulanış şekli g&amp;ouml;sterilmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[ServiceContract(Name="UrunYonetimServisi",Namespace="http://www.bsenyurt.com/UrunYonetimServisi"
,SessionMode=SessionMode.Required)]
public interface IUrunYonetici
{
    [OperationContract(IsInitiating=true)]
    void SepeteUrunEkle(string urunId);
    [OperationContract(IsInitiating=false)]
    void SepettenUrunCikar(string urunId);
    [OperationContract(IsInitiating=false,IsTerminating=true)]
    void SiparisVer();
}&lt;/pre&gt;
&lt;p&gt;Buna g&amp;ouml;re nesne &amp;ouml;rneği sadece SepeteUrunEkle metodu ile oluşturulabilir. Bir başka deyişle SepettenUrunCikar veya SiparisVer metodlarının SepeteUrunEkle metodundan &amp;ouml;nce &amp;ccedil;alıştırılamaması garanti altına alınmış olunur. Buna g&amp;ouml;re istemci uygulama kodlarının aşağıdaki gibi değiştirildiği g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınsın.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;UrunYonetimServisiClient srv = new UrunYonetimServisiClient("DefaultBinding_UrunYonetimServisi_UrunYonetimServisi");
srv.SepettenUrunCikar("1000");
srv.SepeteUrunEkle("1000");
srv.SiparisVer();
Console.WriteLine("Uygulamadan &amp;Ccedil;ıkmak i&amp;ccedil;in Bir Tuşa Basın");
Console.ReadLine();&lt;/pre&gt;
&lt;p&gt;Dikkat edilecek olursa &amp;ouml;nce SepettenUrunCikar metodu &amp;ccedil;ağırılmaktadır. Sonrasında ise SepeteUrunEkle ve SiparisVer isimli metodlar &amp;ccedil;alıştırılmak istenir. Ancak kod bu şekilde denendiğinde &amp;ccedil;alışma zamanında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan istisna alınır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk205_6.gif" alt="" width="542" height="192" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dolayısıyla metodların &amp;ccedil;alışma sırasıda s&amp;ouml;z konusu &amp;ouml;zellikler yardımıyla garanti altına alınmıştır. Elbette &lt;strong&gt; IsInitiating&lt;/strong&gt; &amp;ouml;zelliğinin &lt;strong&gt;true&lt;/strong&gt; olarak atandığı SepeteUrunEkle metodu bir kere &amp;ccedil;alıştırıldıktan sonra diğer metodlar istenildiği gibi &amp;ccedil;alıştırılabilir. Diğer taraftan aşağıdaki gibi bir kod par&amp;ccedil;asında yine dikkatli olunmalıdır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;UrunYonetimServisiClient srv = new UrunYonetimServisiClient("DefaultBinding_UrunYonetimServisi_UrunYonetimServisi");
srv.SepeteUrunEkle("1000");
srv.SepeteUrunEkle("1004");
srv.SepettenUrunCikar("1000");
srv.SiparisVer();
srv.SepeteUrunEkle("1000"); 
Console.WriteLine("Uygulamadan &amp;Ccedil;ıkmak i&amp;ccedil;in Bir Tuşa Basın");
Console.ReadLine();&lt;/pre&gt;
&lt;p&gt;Dikkat edilecek olursa SiparisVer metodundan sonra SepeteUrunEkle metodu &amp;ccedil;alıştırılmıştır. Oysaki SiparisVer metodu i&amp;ccedil;in &lt;strong&gt;IsTerminating&lt;/strong&gt; &amp;ouml;zelliğinin değeri true olarak atanmıştır. Dolayısıyla bu metod &amp;ccedil;ağrısından sonra s&amp;ouml;z konusu servis nesne &amp;ouml;rneği yok edilecektir. Buna g&amp;ouml;re istemci tarafında aşağıdaki ekranda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;ChannelTerminatedException&lt;/strong&gt; sınıfı tipinden bir istisna mesajı alınır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk205_7.gif" alt="" width="522" height="248" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zetle daha &amp;ouml;ncedende değindiğimiz gibi istemci tarafında istisna y&amp;ouml;netimi adına bazı hazırlıklar yapmak &lt;strong&gt; (Fault Management)&lt;/strong&gt; son derece isabetli bir hareket olacaktır.&lt;/p&gt;
&lt;p&gt;Bu makalemizde servis tarafındaki nesne &amp;ouml;rnekleri ile istemci arasındaki ilişkilerin ele alınması adına &lt;strong&gt;InstanceContextMode&lt;/strong&gt;, &lt;strong&gt;IsInitiating&lt;/strong&gt;, &lt;strong&gt;IsTerminating&lt;/strong&gt; gibi &amp;ouml;zelliklerden nasıl yararlanabileceğimizi ele almaya &amp;ccedil;alıştık. Oturum y&amp;ouml;netimi adına WCF i&amp;ccedil;erisinde ele alınması gereken daha pek &amp;ccedil;ok konu vardır. &amp;Ouml;rneğin &lt;strong&gt;PerCall&lt;/strong&gt; modda oturum y&amp;ouml;netiminin sağlanması gibi. Bu gibi konulara ilerleyen makalelerimizde değinmeye &amp;ccedil;alışacağız. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/InstanceModes.zip"&gt;&amp;Ouml;rnek Uygulama İ&amp;ccedil;in Tıklayınız.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2007-05-24 12:00:00</pubDate>
  <slug>WCF-InstanceContextMode-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
    <tag>singleton</tag>
    <tag>client-activated-object</tag>
    <tag>singlecall</tag>
    <tag>persession</tag>
    <tag>percall</tag>
    <tag>instancecontextmode</tag>
  </tags>
  <categories>
    <category>WCF WebHttp Services</category>
  </categories>
</post>