<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Sql 2005 XML Veri Tipini XSD ile Doğrulamak</title>
  <description>Sql Server 2005 ile birlikte gelen en büyük yeniliklerden birisi, yeni XML veri tipidir. XML veri tipini tablolarda alanlar, stored procedure' lerde ve fonksiyonlarda parametreler veya değişkenler için kullanabilmekteyiz. Ancak asıl iyi olan nokta, XML veri tipinden herhangibir içeriğin, XSD şemaları yardımıyla doğruluğunun kontrol altına alınabilmesidir. Bir XML şeması ile ilişkilendirilmiş ve doğruluğu bu şema bilgisinde verilen kriterlere göre sağlanacak olan XML verisine, türlendirilmiş XML (Typed XML) adı verilmektedir. (Tam karşıtı olan Untyped XML verisi ise sadece well-formed olarak tanımlanmış XML içeriğini işaret etmektedir.)</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Sql Server 2005 ile birlikte gelen en b&amp;uuml;y&amp;uuml;k yeniliklerden birisi, yeni XML veri tipidir. XML veri tipini tablolarda alanlar, stored procedure' lerde ve fonksiyonlarda parametreler veya değişkenler i&amp;ccedil;in kullanabilmekteyiz. Ancak asıl iyi olan nokta, XML veri tipinden herhangibir i&amp;ccedil;eriğin, XSD şemaları yardımıyla doğruluğunun kontrol altına alınabilmesidir. Bir XML şeması ile ilişkilendirilmiş ve doğruluğu bu şema bilgisinde verilen kriterlere g&amp;ouml;re sağlanacak olan XML verisine, t&amp;uuml;rlendirilmiş XML (Typed XML) adı verilmektedir. &lt;em&gt;(Tam karşıtı olan Untyped XML verisi ise sadece well-formed olarak tanımlanmış XML i&amp;ccedil;eriğini işaret etmektedir.)&lt;/em&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Typed XML verileri, &amp;ccedil;alışma zamanında Untyped XML verilerine g&amp;ouml;re daha y&amp;uuml;ksek performans sağlar. &amp;Ccedil;&amp;uuml;nk&amp;uuml; Untyped XML i&amp;ccedil;eriğinde, elementlere ve niteliklere ait veriler string formatında tutulmakta olup &amp;ccedil;alışma zamanında gereksiz yere t&amp;uuml;r d&amp;ouml;n&amp;uuml;ş&amp;uuml;mlerinin olmasına neden olmaktadır. Oysaki Typed XML verisinin i&amp;ccedil;eriğinde yer alan element ve niteliklerin veri t&amp;uuml;rleri zaten şemada belirtilen t&amp;uuml;rlerden olmak zorunadır. Bu da &amp;ccedil;alışma zamanında gereksiz t&amp;uuml;r d&amp;ouml;n&amp;uuml;ş&amp;uuml;mlerini engelleyerek y&amp;uuml;ksek performans sağlamaktadır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Peki Sql Server 2005 &amp;uuml;zerinde, &amp;ouml;zellikle bir tablo alanının veri tipini XML olarak belirttiğimizde, bu alanın i&amp;ccedil;eriğini bir XML şeması ile (XML Schema) nasıl ilişkilendirebiliriz. Herşeyden &amp;ouml;nce, XML veri tipi ile ilişkili olan şema bilgilerinin nasıl ve ne şekilde tutulduğunu bilmekte fayda var. Sql Server 2005 &amp;uuml;zerinde bir XML şeması &amp;ccedil;oğunlukla bir şema koleksiyonuna (Schema Collection) eklenerek kullanılmaktadır. Diğer taraftan sistemde yer alan bir ka&amp;ccedil; tablo &amp;uuml;zerinde de, bu şema i&amp;ccedil;erisinde yer alan isim alanlarına (namespaces), elementlere (elements), niteliklere (attributes) vb... ait bilgiler saklanmaktadır. Dolayısıyla &amp;ccedil;alışma zamanında bir XML veri alanının i&amp;ccedil;eriğini kontrol etmek i&amp;ccedil;in, Sql Server 2005 sistemine kayıt edilmiş (register) şema koleksiyonlarından faydalalanılmaktadır. &amp;Ouml;ncelikle bir şema bilgisini Sql Server 2005 sistemine nasıl kayıt edebileceğimize bakalım. Elimizde aşağıdaki gibi bir şema olduğunu d&amp;uuml;ş&amp;uuml;nelim. &lt;em&gt;(Var olan bir XML d&amp;ouml;k&amp;uuml;manının şema bilgisini Visual Studio.Net ortamında Create Schema se&amp;ccedil;eneği yardımıylada oluşturabilirsiniz. Ben aşağıdaki &amp;ouml;rnek şemayı bu teknik ile oluşturdum ve Sql Server 2005 sistemine kayıt edilebilecek hale getirdim.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk158_4.gif" alt="" width="556" height="143" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-16"?&amp;gt;
    &amp;lt;xs:schema attributeFormDefault="unqualified" elementFormDefault="qualified" xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.bsenyurt.com/Kitaplar" xmlns="http://www.bsenyurt.com/Kitaplar"&amp;gt;
        &amp;lt;xs:element name="Kitaplar"&amp;gt;
            &amp;lt;xs:complexType&amp;gt;
                &amp;lt;xs:sequence&amp;gt;
                    &amp;lt;xs:element name="Kitap"&amp;gt;
                        &amp;lt;xs:complexType&amp;gt;
                            &amp;lt;xs:sequence&amp;gt;
                                &amp;lt;xs:element name="Ad" type="xs:string" /&amp;gt;
                                &amp;lt;xs:element name="Fiyat" type="xs:int" /&amp;gt;
                                &amp;lt;xs:element name="Basim" type="xs:date" /&amp;gt;
                                &amp;lt;xs:element name="Yazarlar"&amp;gt;
                                    &amp;lt;xs:complexType&amp;gt;
                                        &amp;lt;xs:sequence&amp;gt;
                                            &amp;lt;xs:element name="Yazar" type="xs:string" /&amp;gt;
                                        &amp;lt;/xs:sequence&amp;gt;
                                    &amp;lt;/xs:complexType&amp;gt;
                                &amp;lt;/xs:element&amp;gt;
                        &amp;lt;/xs:sequence&amp;gt;
                        &amp;lt;xs:attribute name="ID" type="xs:unsignedShort" use="required" /&amp;gt;
                    &amp;lt;/xs:complexType&amp;gt;
                &amp;lt;/xs:element&amp;gt;
            &amp;lt;/xs:sequence&amp;gt;
        &amp;lt;/xs:complexType&amp;gt;
    &amp;lt;/xs:element&amp;gt;
&amp;lt;/xs:schema&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu şema bilgisinde Kitaplar root elementi i&amp;ccedil;erisinde yer alan Kitap elementi tipinden boğumlar (nodes) yer almaktadır. Her bir Kitap boğumu i&amp;ccedil;erisinde ID isimli ve unsignedShort tipinden nitelikler (attributes) olmak zorundadır. Kitap boğumları (nodes) i&amp;ccedil;erisinde string tipinden Ad, integer tipinden Fiyat ve date veri tipinden Basim elementleri yer almaktadır. Ayrıca her Kitap boğumu (node) i&amp;ccedil;erisinde string tipinden Yazar elementlerini taşıyan, Yazarlar isimli alt boğumlarda (Childe Nodes) yer almaktadır. Kısacası aşağıdaki &amp;ouml;rnek XML i&amp;ccedil;eriğine ait bir şema yapısı s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Kitaplar&amp;gt;
            &amp;lt;Kitap ID="1000"&amp;gt;
                &amp;lt;Ad&amp;gt;Her Y&amp;ouml;n&amp;uuml;yle C#&amp;lt;/Ad&amp;gt;
                &amp;lt;Fiyat&amp;gt;50&amp;lt;/Fiyat&amp;gt;
                &amp;lt;Basim&amp;gt;2001-01-01Z&amp;lt;/Basim&amp;gt;
                &amp;lt;Yazarlar&amp;gt;
                    &amp;lt;Yazar&amp;gt;Sefer Algan&amp;lt;/Yazar&amp;gt;
                &amp;lt;/Yazarlar&amp;gt;
            &amp;lt;/Kitap&amp;gt;
        &amp;lt;/Kitaplar&amp;gt;&lt;/pre&gt;
&lt;p&gt;Yukarıdaki gibi bir şema(Schema) bilgisini sisteme kayıt edebilmek i&amp;ccedil;in Sql Server 2005 &amp;uuml;zerinde aşağıdaki sorgu c&amp;uuml;mlesini &amp;ccedil;alıştırmamız gerekmektedir. Bu c&amp;uuml;mle ile yukarıdaki şema bilgisini sisteme KitapSchema XML şema koleksiyonu olacak şekilde eklemekteyiz.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;IF EXISTS (SELECT schema_id FROM sys.XML_schema_collections WHERE name='KitapSchema')
BEGIN
     RAISERROR('Şema zaten var...',16,1)
END;

CREATE XML SCHEMA COLLECTION KitapSchema
AS
N'&amp;lt;?xml version="1.0" encoding="utf-16"?&amp;gt;
    &amp;lt;xs:schema attributeFormDefault="unqualified" elementFormDefault="qualified" xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.bsenyurt.com/Kitaplar" xmlns="http://www.bsenyurt.com/Kitaplar"&amp;gt;
        &amp;lt;xs:element name="Kitaplar"&amp;gt;
            &amp;lt;xs:complexType&amp;gt;
                &amp;lt;xs:sequence&amp;gt;
                    &amp;lt;xs:element name="Kitap"&amp;gt;
                        &amp;lt;xs:complexType&amp;gt;
                            &amp;lt;xs:sequence&amp;gt;
                                &amp;lt;xs:element name="Ad" type="xs:string" /&amp;gt;
                                &amp;lt;xs:element name="Fiyat" type="xs:int" /&amp;gt;
                                &amp;lt;xs:element name="Basim" type="xs:date" /&amp;gt;
                                &amp;lt;xs:element name="Yazarlar"&amp;gt;
                                    &amp;lt;xs:complexType&amp;gt;
                                        &amp;lt;xs:sequence&amp;gt;
                                            &amp;lt;xs:element name="Yazar" type="xs:string" /&amp;gt;
                                        &amp;lt;/xs:sequence&amp;gt;
                                    &amp;lt;/xs:complexType&amp;gt;
                                &amp;lt;/xs:element&amp;gt;
                        &amp;lt;/xs:sequence&amp;gt;
                        &amp;lt;xs:attribute name="ID" type="xs:unsignedShort" use="required" /&amp;gt;
                    &amp;lt;/xs:complexType&amp;gt;
                &amp;lt;/xs:element&amp;gt;
            &amp;lt;/xs:sequence&amp;gt;
        &amp;lt;/xs:complexType&amp;gt;
    &amp;lt;/xs:element&amp;gt;
&amp;lt;/xs:schema&amp;gt;'&lt;/pre&gt;
&lt;p&gt;Bu sql c&amp;uuml;mlesini &amp;ccedil;alıştırdığımız takdirde, sistemde yer alan belirli tablolara şemamız ile ilgili bilgiler eklenecektir. Bunların bir kısmını g&amp;ouml;rmek i&amp;ccedil;in aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sorguları &amp;ccedil;alıştırabilirsiniz. Bu bilgiler g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi sistem tablolarında tutulmaktadır. &amp;Ouml;zetle şemamızın i&amp;ccedil;eriği ayrıştırılarak tablolara dağıtılmıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk158_1.gif" alt="" width="633" height="602" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat ederseniz en tepede şema koleksiyonumuzun (KitapSchema) yer aldığı sistem tablosuna bakıyoruz. Burada şema koleksiyonumuz i&amp;ccedil;in oluşturulan xml_collection_id alanının, namespaces, elements ve attributes sistem tablolarında nasıl yer aldığına dikkat ediniz. G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi, şemamız i&amp;ccedil;erisindeki her bir ayrıntı sistem tablolarına yazılmaktadır. &amp;Ouml;zellikle namespaces sistem tablosundaki isim alanı bizim i&amp;ccedil;in &amp;ouml;nemlidir. Buradaki isim alanını, şema bilgisini uygulamak istediğimiz XML veri tiplerinde kullanacağız. Varsayılan olarak, Visual Studio.Net gibi bir ortamda şema dosyanızı hazırladıysanız eğer (ki ben b&amp;ouml;yle yaptım) encoding formatının utf-8 olduğunu ve buradaki gibi http://www.bsenyurt.com/Kitaplar adında bir isim alanının eklenmediği g&amp;ouml;r&amp;uuml;rs&amp;uuml;n&amp;uuml;z. Burada Utf-8 formatını mutlaka Utf-16 olarak &amp;ccedil;evirmeliyiz. Nitekim Sql Server 2005 &amp;ouml;zellikle şema bilgilerinde sadece Utf-16 formatını desteklemektedir. Ayrıca, Sql Server 2005 i&amp;ccedil;erisindeki XML verilerinin bu şemayı kullanabilmesi i&amp;ccedil;inde, namespaces sistem tablosuna bir adın eklenmiş olması gerekmektedir. Bu ama&amp;ccedil;lada ayrıca bir xmlns' i eklememiz gerekti. Aksi takdirde, namespaces sistem tablosunda name alanı boş olan bir satır elde ederiz.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-16"?&amp;gt;
    &amp;lt;xs:schema attributeFormDefault="unqualified" elementFormDefault="qualified" xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.bsenyurt.com/Kitaplar" xmlns="http://www.bsenyurt.com/Kitaplar"&amp;gt;&lt;/pre&gt;
&lt;p&gt;Artık sistemde, KitapSchema isminde bir XML şema koleksiyonumuz mevcuttur. Sıra geldi bunu nasıl kullanacağımıza. Sql Server 2005 Management Studio' da g&amp;ouml;rsel olarak tabloları oluştururken alana ait veri tipini XML olarak se&amp;ccedil;tikten sonra bu alana ait &amp;ouml;zelliklerden Schema Collection' ı kullanarak şema bilgisini ekleyebiliriz. &amp;Ouml;rneğin aşağıdaki resimde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Kitap isimli alanın veri tipi XML olarak belirlenmiştir. Daha sonra ise Schema Collection &amp;ouml;zelliğinde bizim az &amp;ouml;nce eklediğimiz KitapSchema şema koleksiyonu se&amp;ccedil;ilmiştir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk158_2.gif" alt="" width="549" height="367" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Benzer kurallar, tablomuzu sorgu c&amp;uuml;mlesi ile oluştururken de ge&amp;ccedil;erlidir. &amp;Ouml;rneğin aşağıdaki sql c&amp;uuml;mlesinde, yukarıdaki tabloya ait script yer almaktadır. G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi XML veri tipini belirlerken i&amp;ccedil;eriğin dbo.KitapSchema nesnesi tarafında denetleneceği belirtilmektedir.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;CREATE TABLE dbo.BookBase
(
    ID int IDENTITY(1,1) NOT NULL,
    Kitap xml(CONTENT dbo.KitapSchema) NOT NULL,
    CONSTRAINT PK_BookBase PRIMARY KEY CLUSTERED
    (
        ID ASC
    )WITH (IGNORE_DUP_KEY = OFF) ON PRIMARY
) 
ON PRIMARY&lt;/pre&gt;
&lt;p&gt;Şimdi gelin, Kitap alanımıza &amp;ouml;rnek bir XML verisini eklemeye &amp;ccedil;alışalım. Elbette, eklenecek olan verinin buraya konulabilmesi i&amp;ccedil;in KitapSchema şemasının s&amp;ouml;ylediği kurallara uyması beklenmektedir. Bunu sağlamak i&amp;ccedil;in, eklemek istediğimiz XML i&amp;ccedil;eriğinde mutlaka ve mutlaka XML isim alanımız uygulanmalıdır. Aksi takdirde aşağıdaki gibi bir hata mesajı alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk158_5.gif" alt="" width="434" height="294" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Aşağıdaki insert sorgusunda ge&amp;ccedil;erli bir veri girişi yapılmaktadır.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;INSERT INTO dbo.BookBase VALUES 
    (N'&amp;lt;Kitaplar xmlns="http://www.bsenyurt.com/Kitaplar"&amp;gt;
            &amp;lt;Kitap ID="1000"&amp;gt;
                &amp;lt;Ad&amp;gt;Her Y&amp;ouml;n&amp;uuml;yle C#&amp;lt;/Ad&amp;gt;
                &amp;lt;Fiyat&amp;gt;50&amp;lt;/Fiyat&amp;gt;
                &amp;lt;Basim&amp;gt;2001-01-01Z&amp;lt;/Basim&amp;gt;
                &amp;lt;Yazarlar&amp;gt;
                    &amp;lt;Yazar&amp;gt;Sefer Algan&amp;lt;/Yazar&amp;gt;
                &amp;lt;/Yazarlar&amp;gt;
            &amp;lt;/Kitap&amp;gt;
        &amp;lt;/Kitaplar&amp;gt;')&lt;/pre&gt;
&lt;p&gt;Şimdi şema bilgimizin &amp;ccedil;alışıp &amp;ccedil;alışmadığını kontrol edebileceğimiz &amp;ouml;rnek bir insert sorgusu &amp;ccedil;alıştıralım. &amp;Ouml;rneğin Basim elementine ge&amp;ccedil;erli olmayan bir tarih bilgisi girelim. Bu durumda, &amp;ccedil;alışma zamanında bir istisna alırız ve satırın tabloya eklenmediğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk158_3.gif" alt="" width="541" height="311" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Son olarak sistemde yer alan bir şema koleksiyonunu kaldırmak istediğimizde her zamanki gibi drop anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml; aşağıdaki gibi kullanmamız gerekecektir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;IF EXISTS (SELECT schema_id FROM sys.XML_schema_collections WHERE name='KitapSchema')
BEGIN
    DROP XML SCHEMA COLLECTION KitapSchema
END;&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, Sql Server 2005 &amp;uuml;zerinde yer alan XML tipindeki alanların bir şema yardımıyla kontrol&amp;uuml; son derece kolay ve etkilidir. &amp;Ccedil;alışma zamanında sağlanan performansın yanı sıra, XML i&amp;ccedil;eriğinin bizim belirleyeceğimiz şema kurallarına uygun bir bi&amp;ccedil;imde doğrulanması olduk&amp;ccedil;a &amp;ouml;nemlidir. B&amp;ouml;ylece geldik bir makalemizin daha sonuna bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2006-04-21 12:00:00</pubDate>
  <slug>Sql-2005-XML-Veri-Tipini-XSD-ile-Dogrulamak-bsenyurt-com-dan</slug>
  <tags>
    <tag>sql-2005</tag>
    <tag>xml</tag>
    <tag>xsd</tag>
    <tag>xml-validation</tag>
    <tag>validation</tag>
  </tags>
  <categories>
    <category>T SQL</category>
  </categories>
</post>