<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Priority Queue Collection</title>
  <description>Temel olarak bu tip bir koleksiyon Queue(FIFO - First In First Out ilkesine göre çalışmaktadır) ve Stack(LIFO - Last in First Out ilkesine göre çalışmaktadır) tipinden olanlarına benzer. Bu tip koleksiyonlar(generic karşılıkları da dahil olmak üzere), bildiğiniz gibi tek boyutludur.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2011%2f12%2fartcl_7_1.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;1996 &lt;/strong&gt;yılıydı. &lt;strong&gt;Efes Pilsen&lt;/strong&gt;&lt;em&gt;(bu g&amp;uuml;nk&amp;uuml; adıyla Anadolu Efes) &lt;/em&gt;spor kl&amp;uuml;b&amp;uuml; altın d&amp;ouml;nemlerini yaşıyordu. &lt;strong&gt;Tamer Oygu&amp;ccedil;, Ufuk Sarıca, Peter Naumoski, Hidayet T&amp;uuml;rkoğlu, Mirsad T&amp;uuml;rkcan &lt;/strong&gt;ve diğerleri. O yıl kul&amp;uuml;p &lt;strong&gt;Avrupa Kora&amp;ccedil; &lt;/strong&gt;kupasında finale y&amp;uuml;kselmiş ve &lt;strong&gt;İtalyan &lt;/strong&gt;temsilcisi &lt;strong&gt;Stefanel Milano' &lt;/strong&gt;nun rakibi olmuştu. İlk ma&amp;ccedil; &lt;strong&gt;İstanbul Abdi İpek&amp;ccedil;i &lt;/strong&gt;spor salonundaydı. &amp;Uuml;niversitedeydim ve arkadaşlarımla g&amp;uuml;n&amp;uuml;n erken saatlerinde stad kuyruğuna girmiştim. Biletlerimiz vardı ancak bulunduğumuz trib&amp;uuml;nde herkes karışık oturacağı i&amp;ccedil;in iyi bir yer bulmak adına sabahın k&amp;ouml;r&amp;uuml;nde ve soğuk bir havada kendimizi orada buluvermiştik. Ne varki sabahın erken saatlerinde sıranın başlarında iken bu zamanla değişmeye başlamıştı. &amp;Ccedil;&amp;uuml;nk&amp;uuml; alt yola bir basket&amp;ccedil;i geliyor, hayranları ona bakmak i&amp;ccedil;in bulunduğumuz kuyruğa h&amp;uuml;cum ediyor ve baktıkları yerden tekrar geriye &amp;ccedil;ıkmıyorlarda. 8nci sıradan 148nci sıraya kadar gelmişimdir sanıyorum ki. Bu noktada &amp;ccedil;ok doğal olarak sıranın en başındaki kişi de sıksık değişiyordu. &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Aslında &lt;strong&gt;VIP &lt;/strong&gt;benzeri bir durum s&amp;ouml;z konusu idi belkide. Hani pek &amp;ccedil;ok filmde g&amp;ouml;rm&amp;uuml;ş&amp;uuml;zd&amp;uuml;r. L&amp;uuml;ks bir barın veya gece kul&amp;uuml;b&amp;uuml;n&amp;uuml;n &amp;ouml;n&amp;uuml;nde i&amp;ccedil;eri girmek i&amp;ccedil;in bekleyen pek &amp;ccedil;ok insandan oluşan bir kuyruk s&amp;ouml;z konusu olur. Ama genelde filmin kahramanı ve hatta arkadaşları gelir, en &amp;ouml;nden kul&amp;uuml;be pat diye girerlar. &amp;Ccedil;&amp;uuml;nk&amp;uuml; y&amp;uuml;ksek &amp;ouml;ncelikli şahsiyetlerdir. Sanırım hayatımızda yaşadığımız bu ve benzeri tipteki vakalar yazılım d&amp;uuml;nyasından da nasibini almıştır. &amp;Ccedil;&amp;uuml;nk&amp;uuml; yazılım tarafında da &lt;strong&gt;&amp;Ouml;ncelikli Kuyruk Koleksiyonu(Priority Queue Collection) &lt;/strong&gt;denen bir &lt;strong&gt;veri yapısı(data structure) &lt;/strong&gt;s&amp;ouml;z konusudur &lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt; (&lt;em&gt;Detaylı bilgi i&amp;ccedil;in &lt;a title="Priority Queue" href="http://en.wikipedia.org/wiki/Priority_queue" target="_blank"&gt;Wiki&lt;/a&gt; adresine bakabilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Temel olarak bu tip bir koleksiyon &lt;strong&gt;Queue&lt;em&gt;(FIFO - First In First Out ilkesine g&amp;ouml;re &amp;ccedil;alışmaktadır)&lt;/em&gt;&lt;/strong&gt; ve &lt;strong&gt;Stack&lt;em&gt;(LIFO - Last in First Out ilkesine g&amp;ouml;re &amp;ccedil;alışmaktadır)&lt;/em&gt;&lt;/strong&gt; tipinden olanlarına benzer. Bu tip koleksiyonlar&lt;em&gt;(generic karşılıkları da dahil olmak &amp;uuml;zere)&lt;/em&gt;, bildiğiniz gibi tek boyutludur. &lt;strong&gt;Priority &lt;/strong&gt;koleksiyonunda ise devreye bir &amp;ouml;ncelik değeri girmektedir. Bir başka deyişle koleksiyona eklenecek olan elemanın &amp;ouml;ncelik derecesi s&amp;ouml;z konusu olup ilk sıraya yerleşmesi s&amp;ouml;z konusudur. &lt;strong&gt;Priority Queue&lt;/strong&gt; koleksiyonunda, koleksiyona dahil olacak eleman y&amp;uuml;ksek &amp;ouml;ncelik derecesine g&amp;ouml;re kuyuruğun &amp;ouml;n sırasına alınır. Bunun dışında s&amp;ouml;z konusu koleksiyon modelinde ilk olarak elde edilmesi gereken veya listeden &amp;ccedil;ıkartılması icap eden bir eleman bulunurken bu y&amp;uuml;ksek &amp;ouml;ncelik seviyesi g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir&lt;em&gt;(Yine de dilerseniz bu standart veri yapısı kurallarını esnetebilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bildiğiniz gibi&lt;strong&gt; .Net Framework&lt;/strong&gt; platformu ilk s&amp;uuml;r&amp;uuml;m&amp;uuml;nden itibaren &amp;ccedil;eşitli tipte koleksiyonlara hizmet etmektedir. İlk s&amp;uuml;r&amp;uuml;mde &lt;strong&gt;Stack, Queue, ArrayList, Hashtable &lt;/strong&gt;ve &lt;strong&gt;SortedList &lt;/strong&gt;gibi farklı şekillerde &amp;ccedil;alışan koleksiyonlar s&amp;ouml;z konusudur. &lt;strong&gt;Framework .Net 2.0 &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml;ne y&amp;uuml;kseldiğinde ise koleksiyonların generic olma durumu devreye girmiş ve bu sayede &lt;strong&gt;t&amp;uuml;r bağımsız&lt;/strong&gt; ve &lt;strong&gt;tip g&amp;uuml;venli&lt;em&gt;(Type Safety)&lt;/em&gt;&lt;/strong&gt; versiyonlar ortaya &amp;ccedil;ıkmıştır&lt;strong&gt;(List&amp;lt;T&amp;gt;, Dictionary&amp;lt;T,K&amp;gt;, Stack&amp;lt;T&amp;gt;, Queue&amp;lt;T&amp;gt;, HashSet&amp;lt;T&amp;gt;, SortedDictionary&amp;lt;T,K&amp;gt;, SortedList&amp;lt;T&amp;gt; gibi)&lt;/strong&gt;. Tabi &lt;strong&gt;Framework &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml; &lt;strong&gt;4.0&lt;/strong&gt;' a y&amp;uuml;kseldiğinde ve işin i&amp;ccedil;erisinde &lt;strong&gt;paralel programlama &lt;/strong&gt;kabiliyetleri de girdiğinde, &lt;strong&gt;Concurrent &lt;/strong&gt;olarak &amp;ccedil;alışabilen koleksiyonlar ortaya &amp;ccedil;ıkmıştır&lt;strong&gt;(BlockingCollection&amp;lt;T&amp;gt;, ConcurrentBag&amp;lt;T&amp;gt;, ConcurrentDictionary&amp;lt;T,K&amp;gt;, ConcurrentQueue&amp;lt;T&amp;gt;, ConcurrentStack&amp;lt;T&amp;gt;, OrderablePartitioner&amp;lt;T&amp;gt;, Partitioner&amp;lt;T&amp;gt; gibi)&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;Ne yazık ki t&amp;uuml;m bu koleksiyon tipleri arasında &amp;ouml;ncelik seviyelendirmesini kullanan bir &lt;strong&gt;Queue &lt;/strong&gt;koleksiyonu mevcut değildir. Bir başka deyişle iş başa d&amp;uuml;şer ve bu koleksiyonu bizim yazmamız gerekir. Aslında&lt;strong&gt; .Net Framework&lt;/strong&gt; alt yapısı i&amp;ccedil;erisindeki koleksiyonların gelişimini d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde, s&amp;ouml;z konusu yeni koleksiyon tipinin &lt;strong&gt;generic &lt;/strong&gt;bir versiyonu dışında &lt;strong&gt;Concurrent&lt;/strong&gt; &amp;ccedil;alışabilen s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; de yazmak icap etmektedir &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt; Biz bu yazımızda basit ve daha kolay bir adım atıp &lt;strong&gt;generic &lt;/strong&gt;olan bir s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; yazmaya &amp;ccedil;alışıyor olacağız.&lt;/p&gt;
&lt;p&gt;Tasarlayacağımız yeni koleksiyon tipi i&amp;ccedil;erisinde işimizi kolaylaştırmak adına &lt;strong&gt;Sorted List&amp;nbsp;&lt;/strong&gt; kullanımı s&amp;ouml;z konusu olabilir aslında. Fakat yaptığım araştırmalar sonucunda bu tip bir kullanımın performans a&amp;ccedil;ısından olumsuz etkileri olduğunu g&amp;ouml;rd&amp;uuml;m. Dolayısıyla bu tip bir veri yapısının literat&amp;uuml;rde bahsedildiği &amp;uuml;zere &lt;strong&gt;Yığın Veri Yapısı(Heap Daha Structure)&lt;/strong&gt; ile &amp;ccedil;alışması tavsiye edilen ve &amp;ouml;nerilen yoldur. &lt;strong&gt;Heap &lt;/strong&gt;veri yapısı, &lt;strong&gt;ağa&amp;ccedil; tabanlı(Tree Based)&lt;/strong&gt; bir i&amp;ccedil;eriği model olarak almaktadır. Ağacın en &amp;uuml;st dalında her zaman i&amp;ccedil;in en y&amp;uuml;ksek &lt;strong&gt;Key &lt;/strong&gt;değerine sahip olan eleman yer alır. Tabi bu durumu tersine doğru &amp;ccedil;evirebiliriz de. Yani en d&amp;uuml;ş&amp;uuml;k &lt;strong&gt;Key &lt;/strong&gt;değerine sahip elemanın ağacın en &amp;uuml;st dalında olması da sağlanabilir. S&amp;ouml;z konusu kullanımlara g&amp;ouml;re &lt;strong&gt;Heap &lt;/strong&gt;veri yapısı&lt;strong&gt; Max-Heap&lt;/strong&gt; veya &lt;strong&gt;Min-Heap&lt;/strong&gt; olarakta adlandırılmaktadır.&lt;em&gt; (Heap veri yapısı hakkında daha detaylı bilgiye yine &lt;a title="Heap Data Structure" href="http://en.wikipedia.org/wiki/Heap_%28data_structure%29" target="_blank"&gt;Wiki adresi&lt;/a&gt; &amp;uuml;zerinden ulaşabilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Dilerseniz &amp;ouml;ncelikli olarak bu koleksiyon tipini geliştirmeye &amp;ccedil;alışalım. Bu ama&amp;ccedil;la basit bir &lt;strong&gt;Console &lt;/strong&gt;projesi a&amp;ccedil;ıp aşağıdaki sınıfı geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;

namespace PQueue
{
    public class PriorityQueue&amp;lt;P, V&amp;gt; // P priority derecesini V ise değeri temsil eder
    {
        private List&amp;lt;KeyValuePair&amp;lt;P, V&amp;gt;&amp;gt; heap; // Heap veri yapısına uygun olacak şekilde i&amp;ccedil;eriğimizi tutacağımız koleksiyon
        private IComparer&amp;lt;P&amp;gt; comparer; // Max-Heap veya Min-Heap' e g&amp;ouml;re bir uyarlamaya hizmet verebilmek i&amp;ccedil;in kullanılacak aray&amp;uuml;z referansı
        private const string ioeMessage = "Koleksiyonda hi&amp;ccedil; eleman yok";

        #region Constructors 

        // P ile gelen tipin varsayılan karşılaştırma kriterine g&amp;ouml;re bir yol izlenir
        public PriorityQueue()
            : this(Comparer&amp;lt;P&amp;gt;.Default)
        {
        }

        // P tipinin karşılaştırma işlevselliğini &amp;uuml;stlenen bir IComparer implementasyonu ile bir Construct işlemi s&amp;ouml;z konusudur
        public PriorityQueue(IComparer&amp;lt;P&amp;gt; Comparer)
        {
            if (Comparer == null)
                throw new ArgumentNullException();

            heap = new List&amp;lt;KeyValuePair&amp;lt;P, V&amp;gt;&amp;gt;();
            comparer = Comparer;
        }

        #endregion

        #region Temel Fonksiyonlar

        // Koleksiyona bir veri eklemek i&amp;ccedil;in kullanıyoruz
        public void Enqueue(P Priority, V Value)
        {
            KeyValuePair&amp;lt;P, V&amp;gt; pair = new KeyValuePair&amp;lt;P, V&amp;gt;(Priority, Value);
            heap.Add(pair);

            // Sondan başa doğru yeniden bir sıralama yaptırılır
            LastToFirstControl(heap.Count - 1);
        }

        public KeyValuePair&amp;lt;P, V&amp;gt; Dequeue()
        {
            if (!IsEmpty) // Eğer koleksiyon boş değilse 
            {
                KeyValuePair&amp;lt;P, V&amp;gt; result = heap[0]; // Heap' in Root' undaki elemanı al
                // Dequeue mantıksal olarak ilk elemanı geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;rken aynı zamanda koleksiyondan &amp;ccedil;ıkartmalıdır
                if (heap.Count &amp;lt;= 1) // 1 veya daha az eleman s&amp;ouml;z konusu ise zaten temizle
                {
                    heap.Clear();
                }
                else // 1 den fazla eleman var ise ilgili elemanı koleksiyondan &amp;ccedil;ıkart
                {
                    heap[0] = heap[heap.Count - 1]; 
                    heap.RemoveAt(heap.Count - 1);
                    FirstToLastControl(0); // ve koleksiyonu baştan sona yeniden sırala
                }
                return result;
            }
            else
                throw new InvalidOperationException(ioeMessage);
        }

        // Peek operasyonu varsayılan olarak ilk elemanı geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;r ama koleksiyondan &amp;ccedil;ıkartmaz(Dequeue gibi değildir yani)
        public KeyValuePair&amp;lt;P, V&amp;gt; Peek()
        {
            if (!IsEmpty)
                return heap[0];
            else
                throw new InvalidOperationException(ioeMessage);
        }

        // Koleksiyonda eleman olup olmadığını belirtir
        public bool IsEmpty
        {
            get { return heap.Count == 0; }
        }

        #endregion
        
        #region Sıralama Fonksiyonları

        private int LastToFirstControl(int Posisiton)
        {
            if (Posisiton &amp;gt;= heap.Count) 
                return -1;

            int parentPos;

            while (Posisiton &amp;gt; 0)
            {
                parentPos = (Posisiton - 1) / 2;
                if (comparer.Compare(heap[parentPos].Key, heap[Posisiton].Key) &amp;gt; 0)
                {
                    ExchangeElements(parentPos, Posisiton);
                    Posisiton = parentPos;
                }
                else break;
            }
            return Posisiton;
        }

        private void FirstToLastControl(int Position)
        {
            if (Position &amp;gt;= heap.Count) 
                return;

            while (true)
            {
                int smallestPosition = Position;
                int leftPosition = 2 * Position + 1;
                int rightPosition = 2 * Position + 2;
                if (leftPosition &amp;lt; heap.Count &amp;amp;&amp;amp;
                    comparer.Compare(heap[smallestPosition].Key, heap[leftPosition].Key) &amp;gt; 0)
                    smallestPosition = leftPosition;
                if (rightPosition &amp;lt; heap.Count &amp;amp;&amp;amp;
                    comparer.Compare(heap[smallestPosition].Key, heap[rightPosition].Key) &amp;gt; 0)
                    smallestPosition = rightPosition;

                if (smallestPosition != Position)
                {
                    ExchangeElements(smallestPosition, Position);
                    Position = smallestPosition;
                }
                else break;
            }
        }

        private void ExchangeElements(int Position1, int Position2)
        {
            KeyValuePair&amp;lt;P, V&amp;gt; val = heap[Position1];
            heap[Position1] = heap[Position2];
            heap[Position2] = val;
        }

        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;PriortiyQueue&amp;lt;P,V&amp;gt;&lt;/strong&gt; isimli sınıfımız, P tipinin değerine ve se&amp;ccedil;ilen karşılaştırma kriterine g&amp;ouml;re bir &amp;ouml;ncelik seviyelendirmesini kullanmaktadır. S&amp;ouml;z konusu seviyelendirmeye g&amp;ouml;re de &lt;strong&gt;V &lt;/strong&gt;tipi ile belirtilen değerlerin koleksiyon i&amp;ccedil;erisindeki &amp;ouml;nceliği değişmektedir. &lt;strong&gt;Enqueue &lt;/strong&gt;ve &lt;strong&gt;Dequeue &lt;/strong&gt;gibi veri ekleme ve en y&amp;uuml;ksek &amp;ouml;nceliğe sahip veriyi elde edip listeden &amp;ccedil;ıkartmak gibi temel &lt;strong&gt;Queue &lt;/strong&gt;fonksiyonellikleri dışında &lt;strong&gt;Peek &lt;/strong&gt;isimli operasyon desteği de mevcuttur. Şimdi dilerseniz yazdığımız bu yeni koleksiyon tipini test edelim. Bu ama&amp;ccedil;la aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace PQueue
{
    class Program
    {
        static void Main(string[] args)
        {
            PriorityQueue&amp;lt;int, Person&amp;gt; pQueue = new PriorityQueue&amp;lt;int, Person&amp;gt;();

            pQueue.Enqueue(9, new Person { Name = "Bill", PersonId = 10, Salary = 1000 });
            pQueue.Enqueue(10, new Person { Name = "Jeni", PersonId = 5, Salary = 950 });
            pQueue.Enqueue(8, new Person { Name = "Samantha", PersonId = 4, Salary = 750 });
            pQueue.Enqueue(17, new Person { Name = "Richard", PersonId = 3, Salary = 800 });
            pQueue.Enqueue(12, new Person { Name = "Steve", PersonId = 9, Salary = 2000 });

            Console.WriteLine("Şu anda en y&amp;uuml;ksek &amp;ouml;ncelik {0} isimli personeldedir",pQueue.Dequeue().Value.Name);

            // Şu anda en y&amp;uuml;ksek &amp;ouml;ncelik seviyesi Dennis' de olduğundan Root' a yerleştirilecektir
            pQueue.Enqueue(3, new Person { Name = "Dennis", PersonId = 1, Salary = 350 });
            Console.WriteLine("Şu anda en y&amp;uuml;ksek &amp;ouml;ncelik {0} isimli personeldedir", pQueue.Dequeue().Value.Name);
            Console.WriteLine("Şu anda en y&amp;uuml;ksek &amp;ouml;ncelik {0} isimli personeldedir", pQueue.Dequeue().Value.Name);
        }
    }

    class Person
    {
        public int PersonId { get; set; }
        public string Name { get; set; }
        public decimal Salary { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rneğimizde kullandığımız &lt;strong&gt;PriorityQueue&amp;lt;P,V&amp;gt; &lt;/strong&gt;nesne &amp;ouml;rneği, seviyelendirme i&amp;ccedil;in &lt;strong&gt;int &lt;/strong&gt;tipini kullanmakta ve buna g&amp;ouml;re &lt;strong&gt;Person &lt;/strong&gt;tipinden olan nesne &amp;ouml;rneklerini &lt;strong&gt;Min-Heap &lt;/strong&gt;mantığında değerlendirmektedir. İlk olarak &lt;strong&gt;Bill, Jenni, Samantha, Richard &lt;/strong&gt;ve &lt;strong&gt;Steve &lt;/strong&gt;isimli &amp;ccedil;alışanlar kuyruğa eklenmiştir. Bu personelin &amp;ouml;ncelik dereceleri sırasıyla &lt;strong&gt;9,10,8,17 &lt;/strong&gt;ve &lt;strong&gt;12&lt;/strong&gt;' dir. Geliştirdiğimiz tip &lt;strong&gt;Min-Heap &lt;/strong&gt;yapısını ele aldığından yani aslında d&amp;uuml;ş&amp;uuml;k değer y&amp;uuml;ksek &amp;ouml;ncelik anlamına geldiğinden ilk dizilime g&amp;ouml;re kuyruktan ilk &amp;ccedil;ıkacak kişi &lt;strong&gt;Samantha&lt;/strong&gt;' dır. Bu andan itibaren &lt;strong&gt;Dequeue &lt;/strong&gt;metodunu kullandığımız noktalarda &amp;ouml;ncelik seviyesi y&amp;uuml;ksek olan&lt;em&gt;(yani en k&amp;uuml;&amp;ccedil;&amp;uuml;k int değerine sahip olan) &lt;/em&gt;&amp;ccedil;alışan elde edilecek ve aynı zamanda koleksiyondan &amp;ccedil;ıkartılacaktır. Aynen aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/2011-12-artcl_7_3.jpg" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Burada dikkat edilmesi gereken nokta &lt;strong&gt;Dequeue &lt;/strong&gt;metodunun her zaman i&amp;ccedil;in &amp;ouml;ncelik seviyesi y&amp;uuml;ksek olan&lt;em&gt;(&amp;ouml;rneğimizde int değeri en d&amp;uuml;ş&amp;uuml;n olan) &lt;/em&gt;elemanı ilk olarak listeden getiriyor olmasıdır. Yani klasik &lt;strong&gt;Queue &lt;/strong&gt;koleksiyonunda olduğu gibi &lt;strong&gt;FIFO &lt;/strong&gt;ilkesi değerlendirilirken, &lt;strong&gt;&amp;ouml;ncelik seviyesi&lt;em&gt;(Priority Level)&lt;/em&gt;&lt;/strong&gt; baz alınmaktadır. Kodu &lt;strong&gt;Debug &lt;/strong&gt;ederek incelediğinizde ancak var olan elemanlardan daha y&amp;uuml;ksek &amp;ouml;ncelik seviyesine sahip bir eleman eklendiğinde listenin başına alındığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bu işleyişte koleksiyon &amp;uuml;zerinde her hangibir sıralama operasyonunun s&amp;ouml;z konusu olmadığına &amp;ouml;zellikle dikkat etmenizi isterim.&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi biraz uğraşarak &amp;ouml;ncelikli derecelendirmeli bir kuyruk koleksiyonu tipini yazabildik. Sizde denemelerinizde IComparer implementasyonu yapan bir kritere g&amp;ouml;re s&amp;ouml;z konusu koleksiyonu &lt;strong&gt;Max-Heap&lt;/strong&gt; mantığında &amp;ccedil;alıştırmay deneyebilirisiniz. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2011%2f12%2fPQueue.rar"&gt;PQueue.rar (31,33 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2012-01-31 15:01:00</pubDate>
  <slug>Priority-Queue-Collection</slug>
  <tags>
    <tag>collections</tag>
    <tag>priortiy-queue</tag>
    <tag>data-structures</tag>
    <tag>max-heap</tag>
    <tag>min-heap</tag>
    <tag>heap-data-structure</tag>
    <tag>c#</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>