<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>NoSQL Maceraları - RaptorDB ile Hello World</title>
  <description>Document Store NoSQL veritabanı tiplerinden birisi olan RaptorDB kuvvetle muhtemel isimlendirilirken tarih öncesi Velociraptor’ dan esinlenilmiştir. Pek çok NoSQL sisteminde olduğu gibi geniş bir kullanım yelpazesi olduğunu ifade edebiliriz. Her ne kadar diğer NoSQL ürünlerinde olduğu gibi geniş bir referans kitlesi göze çarpmasa da, Forumlar, Bloglar, Wiki tarzı siteler, İçerik Yönetim Sistemleri(Content Management Systems) ve Sharepoint benzeri uygulamaların yazılabileceği belirtilmektedir.</description>
  <content>&lt;p&gt;&lt;a href="/pics/F-22_Raptor_-_070401-F-6701P-046.jpg"&gt;&lt;img style="float: right; margin: 4px 0px; display: inline;" title="070401-F-6701P-005" src="/pics/F-22_Raptor_-_070401-F-6701P-046_thumb.jpg" alt="070401-F-6701P-005" width="300" height="199" align="right" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Yıllardır vaz ge&amp;ccedil;emediğim bilgisayar oyunlarından birisidir &lt;a href="http://tr.wikipedia.org/wiki/Command_%26_Conquer:_Generals" target="_blank"&gt;Command and Conquer Generals&lt;/a&gt;. &amp;Ouml;zellikle &lt;strong&gt;Zero Hour&lt;/strong&gt; setini &amp;ccedil;ok ama &amp;ccedil;ok severim. Bu set i&amp;ccedil;erisinde en &amp;ccedil;ok kullandığım &lt;strong&gt;GLA &lt;/strong&gt;g&amp;uuml;&amp;ccedil;leridir ama zaman zaman &lt;strong&gt;China Tank General&lt;/strong&gt; veya &lt;strong&gt;USA Air Force&amp;rsquo;&lt;/strong&gt; u da tercih ederim.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;USA Air Force&lt;/strong&gt;&amp;rsquo; un en belirgin &amp;ouml;zelliği&lt;strong&gt; King Raptor&lt;/strong&gt; olarak adlandırılan ve aslında g&amp;uuml;n&amp;uuml;m&amp;uuml;zde de &lt;a href="http://tr.wikipedia.org/wiki/F-22_Raptor" target="_blank"&gt;F22 Raptor olarak bilinen savaş u&amp;ccedil;aklarını&lt;/a&gt; i&amp;ccedil;ermesidir. Bu u&amp;ccedil;aklar kendilerine fırlatılan f&amp;uuml;zeleri lazer ile vurabilir, ayrıca normal &lt;strong&gt;Raptor&lt;/strong&gt;&amp;rsquo; lara g&amp;ouml;re daha fazla g&amp;uuml;d&amp;uuml;ml&amp;uuml; f&amp;uuml;ze taşıyabilir.&lt;/p&gt;
&lt;p&gt;Araştırmasam da, &lt;strong&gt;Raptor&lt;/strong&gt; isminin &lt;strong&gt;Dinazor&lt;/strong&gt; &amp;ccedil;ağındaki &lt;strong&gt;&lt;a href="http://tr.wikipedia.org/wiki/Velociraptor" target="_blank"&gt;Velociraptor&lt;/a&gt; &lt;/strong&gt;isimli yırtıcıdan geldiğini d&amp;uuml;ş&amp;uuml;nmekteyim. &lt;strong&gt;Hızlı Hırsız&lt;/strong&gt; anlamına gelen &lt;strong&gt;Velociraptor&lt;/strong&gt;, &lt;strong&gt;15Kg&lt;/strong&gt; ağırlığında olan bir etoburdur. Yaklaşık &lt;strong&gt;75 ila 71 milyon&lt;/strong&gt; yıl &amp;ouml;nce yaşadığı bilinmektedir. Saatte &lt;strong&gt;40km&lt;/strong&gt; hızla koşabilen &lt;strong&gt;2metre&lt;/strong&gt; boyundaki canlı &amp;ouml;l&amp;uuml;mc&amp;uuml;l bir yırtıcı olarak ifade edilmiştir. O kadar sivri ve g&amp;uuml;&amp;ccedil;l&amp;uuml; pen&amp;ccedil;elere sahipmiş ki, kurbanının damarlarına denk gelmesi halinde onu 3 ile 5 saniye i&amp;ccedil;erisinde &amp;ouml;ld&amp;uuml;r&amp;uuml;rm&amp;uuml;ş. G&amp;uuml;n&amp;uuml;m&amp;uuml;zde bir &lt;strong&gt;Hindi&lt;/strong&gt; boyunda olan bu canlının en korkutucu yanı ise s&amp;uuml;r&amp;uuml; halinde dolaşıyor olmalarıymış. Karada y&amp;uuml;r&amp;uuml;yen Pirhanalara benzetebiliriz sanırım &lt;img class="wlEmoticon wlEmoticon-disappointedsmile" style="border-style: none;" src="/pics/wlEmoticon-disappointedsmile_4.png" alt="Disappointed smile" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;İsim i&amp;ccedil;erisinde yer alan &lt;strong&gt;Raptor&lt;/strong&gt; pek &amp;ccedil;ok &amp;uuml;r&amp;uuml;ne de esin kaynağı olmuştur. Bir savaş u&amp;ccedil;ağına isim babası olmuştur, &lt;strong&gt;Western&lt;/strong&gt; &lt;strong&gt;Digital&lt;/strong&gt; tarafından bir &lt;strong&gt;Hard Disk&amp;rsquo;&lt;/strong&gt; e verilmiştir, &lt;strong&gt;Yamaha&amp;rsquo;&lt;/strong&gt; nın bir &lt;strong&gt;ATV&lt;/strong&gt; modelinde kullanılmıştır, &lt;strong&gt;NBA&lt;/strong&gt; takımlarından &lt;strong&gt;Toronto&amp;rsquo;&lt;/strong&gt; nun adı olmuştur, hatta &lt;strong&gt;Battlestar&lt;/strong&gt; &lt;strong&gt;Galactica&amp;rsquo;&lt;/strong&gt; da bile kullanılmıştır. Pop&amp;uuml;ler bir isim anlayacağınız&amp;hellip;&lt;/p&gt;
&lt;p&gt;Peki bu ismin bir &lt;strong&gt;NoSQL&lt;/strong&gt; veritabanı sisteminde de ele alındığını biliyor muydunuz? &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_89.png" alt="Smile" /&gt;&lt;/p&gt;
&lt;h1&gt;Tanım&lt;/h1&gt;
&lt;p&gt;&lt;strong&gt;Document&lt;/strong&gt; &lt;strong&gt;Store&lt;/strong&gt; &lt;strong&gt;NoSQL&lt;/strong&gt; veritabanı tiplerinden birisi olan &lt;strong&gt;RaptorDB&lt;/strong&gt; kuvvetle muhtemel isimlendirilirken tarih &amp;ouml;ncesi &lt;strong&gt;Velociraptor&amp;rsquo;&lt;/strong&gt; dan esinlenilmiştir. Pek &amp;ccedil;ok &lt;strong&gt;NoSQL&lt;/strong&gt; sisteminde olduğu gibi geniş bir kullanım yelpazesi olduğunu ifade edebiliriz. Her ne kadar diğer &lt;strong&gt;NoSQL&lt;/strong&gt; &amp;uuml;r&amp;uuml;nlerinde olduğu gibi geniş bir referans kitlesi g&amp;ouml;ze &amp;ccedil;arpmasa da, &lt;strong&gt;Forumlar&lt;/strong&gt;, &lt;strong&gt;Bloglar&lt;/strong&gt;, &lt;strong&gt;Wiki&lt;/strong&gt; tarzı siteler, &lt;strong&gt;İ&amp;ccedil;erik Y&amp;ouml;netim Sistemleri&lt;em&gt;(Content Management Systems)&lt;/em&gt;&lt;/strong&gt; ve &lt;strong&gt;Sharepoint&lt;/strong&gt; benzeri uygulamaların yazılabileceği belirtilmektedir.&lt;/p&gt;
&lt;p&gt;Ama tabiki diğer &lt;strong&gt;NoSQL&lt;/strong&gt; sistemlerinde olduğu gibi, &lt;strong&gt;Microsoft SQL Server&lt;/strong&gt;, &lt;strong&gt;Oracle&lt;/strong&gt; vb maliyetli veritabanlarının kullanılmak istenmediği durumlarda da, ideal &amp;ccedil;&amp;ouml;z&amp;uuml;mler arasında yer almaktadır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;RaptorDB ile ilişkili olarak takip ettiğim referans dok&amp;uuml;man &lt;a href="http://www.codeproject.com/Articles/375413/RaptorDB-the-Document-Store" target="_blank"&gt;Mehdi Gholam&amp;rsquo; ın CodeProject&amp;rsquo; deki yazısı&lt;/a&gt; oldu. Tabi &amp;uuml;r&amp;uuml;n&amp;uuml;n &lt;a href="http://raptordb.codeplex.com/" target="_blank"&gt;Codeplex &amp;uuml;zerinde de yayınlanan&lt;/a&gt; bir i&amp;ccedil;eriği de bulunmakta. Yazı epeyce uzun o y&amp;uuml;zden kendime ş&amp;ouml;yle g&amp;uuml;zel notlar &amp;ccedil;ıkartıp sizlerle paylaşayım istedim.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;RaptorDB&lt;/strong&gt; projesinin sahibi ve geliştiricisi olan &lt;strong&gt;Mehdi&lt;/strong&gt; &lt;strong&gt;Gholam&lt;/strong&gt;, &lt;strong&gt;.Net &lt;/strong&gt;tabanlı olarak geliştirdiği &lt;strong&gt;Library&lt;/strong&gt; i&amp;ccedil;erisinde pek &amp;ccedil;ok yardımcı a&amp;ccedil;ık kaynak koda da başvurmuş. Hatta bunların neredeyse tamamı ile ilgili &lt;strong&gt;CodeProject&lt;/strong&gt; &amp;uuml;zerinde kaynağa rastlamak m&amp;uuml;mk&amp;uuml;n. Esas itibariyle &lt;strong&gt;RaptorDB&amp;rsquo;&lt;/strong&gt; nin yaşam alanına giren k&amp;uuml;t&amp;uuml;phaneleri aşağıdaki grafik ile &amp;ouml;zetleyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/raptor_5_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="raptor_5" src="/pics/raptor_5_thumb_1.png" alt="raptor_5" width="517" height="293" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;İ&amp;ccedil;eriğin &lt;strong&gt;JSON&lt;em&gt;(JavaScriptObjectNotation)&lt;/em&gt;&lt;/strong&gt; formatında ele alındığını g&amp;ouml;rmekteyiz ama bunun dışında &lt;strong&gt;Binary&lt;/strong&gt; serileştirme noktasında devreye giren yardımcı bir k&amp;uuml;t&amp;uuml;phanede s&amp;ouml;z konusu. &amp;Ouml;zellikle verinin sıkıştırılması noktasında&lt;strong&gt; b-tree&lt;/strong&gt; algoritmasını baz alan &lt;strong&gt;WAHBitArray&lt;/strong&gt;&amp;rsquo; den yararlanılmış. &lt;strong&gt;Full Text Search &lt;/strong&gt;işlemlerinde &lt;strong&gt;h00t &lt;/strong&gt;isimli &amp;uuml;r&amp;uuml;n devreye girerken &lt;strong&gt;Log &lt;/strong&gt;tutmada ise &lt;strong&gt;Enterprise &lt;/strong&gt;&amp;ccedil;&amp;ouml;z&amp;uuml;mlerde dahi sıklıkla kullandığımız &lt;strong&gt;Log4Net&lt;/strong&gt;&amp;rsquo; in daha sade bir s&amp;uuml;r&amp;uuml;m&amp;uuml; değerlendirilmiş. Pek tabi başrol oyuncusu &lt;strong&gt;RaptorDB&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesi.&lt;/p&gt;
&lt;h1&gt;Genel &amp;Ouml;zellikleri&lt;/h1&gt;
&lt;p&gt;&lt;strong&gt;RaptorDB&lt;/strong&gt;&amp;rsquo; yi bir &amp;uuml;r&amp;uuml;n olarak g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda ise aşağıdaki maddelerde yer alan temel &amp;ouml;zelliklere sahip olduğunu g&amp;ouml;rmekteyiz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Tamamıyla &lt;strong&gt;.Net&lt;/strong&gt; ile geliştirilmiş bir &amp;uuml;r&amp;uuml;nd&amp;uuml;r. Hatta Source Code ile birlikte indirildiğinde referans edilen projeler debug edilebilir. Bu sayede i&amp;ccedil; &amp;ccedil;alışma yapısını da gayet g&amp;uuml;zel anlayabiliyorsunuz.&lt;/li&gt;
&lt;li&gt;Dok&amp;uuml;manlar &lt;strong&gt;ASCII JSON&lt;/strong&gt; veya &lt;strong&gt;Binary&lt;/strong&gt; serileştirilmiş &lt;strong&gt;JSON&lt;/strong&gt; formatında saklanmaktadır.&lt;/li&gt;
&lt;li&gt;&amp;Ouml;zellikle &lt;strong&gt;Network&lt;/strong&gt; &amp;uuml;zerinde hareket edeceği d&amp;uuml;ş&amp;uuml;n&amp;uuml;len veri i&amp;ccedil;in sıkıştırma işlemi s&amp;ouml;z konusudur&lt;em&gt;(Test etmedim)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Kritik fonksiyonelliklerden birisi olan ve pek &amp;ccedil;ok &lt;strong&gt;NoSQL&lt;/strong&gt; sisteminde g&amp;ouml;rmeye alıştığımız &lt;strong&gt;Transaction&lt;/strong&gt; desteği ise &lt;strong&gt;1.6&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nden itibaren gelmektedir. &lt;em&gt;(Tabi Transaction kullanımında belirtilen handikaplardan birisi de, bir Query&amp;rsquo; nin sadece dahil olduğu Transaction i&amp;ccedil;erisine konu olan veri k&amp;uuml;melerindeki değişiklikleri fark edebilmesidir)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;String&lt;/strong&gt; i&amp;ccedil;erikler &lt;strong&gt;UTF-8&lt;/strong&gt; veya &lt;strong&gt;Unicode&lt;/strong&gt; formatta ele alınmaktadır. &amp;Ccedil;ok doğal olarak string tipteki kolonlar i&amp;ccedil;in bir veri boyutu ifade edilmesine gerek yoktur ama veritabanı motoru da bu i&amp;ccedil;erikler i&amp;ccedil;in otomatik olarak bir boyut ayarlamasına gitmektedir.&lt;/li&gt;
&lt;li&gt;Ayrıca &lt;strong&gt;String&lt;/strong&gt; alanlar i&amp;ccedil;in &lt;strong&gt;Full Text Search&lt;/strong&gt; desteği bulunmaktadır.&lt;/li&gt;
&lt;li&gt;Biraz sonra değineceğimiz &amp;uuml;zere &lt;strong&gt;View&lt;/strong&gt; adı verilen yapılar veriyi &lt;strong&gt;JSON&lt;/strong&gt; yerine &lt;strong&gt;Binary&lt;/strong&gt; formatta saklamaktadırlar. Ki &lt;strong&gt;Query&amp;rsquo;&lt;/strong&gt; lerin bu &lt;strong&gt;View&amp;rsquo;&lt;/strong&gt; lar &amp;uuml;zerinden &amp;ccedil;alıştırıldığı d&amp;uuml;ş&amp;uuml;n&amp;uuml;l&amp;uuml;rse, &lt;strong&gt;b-tree&amp;rsquo;&lt;/strong&gt; ye g&amp;ouml;re arama yapan motorun hızlı sonu&amp;ccedil; d&amp;ouml;nd&amp;uuml;receği ifade edilebilir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;View&lt;/strong&gt; adı verilen ve veritabanındaki tablolara benzetilen&lt;em&gt;(ki ben bilin&amp;ccedil;altımın bir yansıması olarak SQL&amp;rsquo; daki View&amp;rsquo; lar ile &amp;ouml;zdeşleştiriyorum)&lt;/em&gt; i&amp;ccedil;eriklerden &lt;strong&gt;Primary&lt;/strong&gt; olarak kullanılan eğer bir &lt;strong&gt;Transaction&lt;/strong&gt; ile ilişkilendirilirse, bu &lt;strong&gt;View&lt;/strong&gt; ve ilişkili olan &lt;strong&gt;View&amp;rsquo;&lt;/strong&gt; lar &amp;uuml;zerindeki t&amp;uuml;m operasyonlar, s&amp;ouml;z konusu &lt;strong&gt;Transaction&amp;rsquo;&lt;/strong&gt; a dahil edilir ve &lt;strong&gt;Rollback&lt;/strong&gt; mekanizmasından yararlanılabilinir.&lt;/li&gt;
&lt;li&gt;Kayıt edilmek istenen her tip i&amp;ccedil;in mutlaka bir &lt;strong&gt;Primary&lt;/strong&gt; &lt;strong&gt;View&lt;/strong&gt; oluşturulması gerekmekedir.&lt;/li&gt;
&lt;li&gt;Pek tabi sorgulamalarda anahtar noktalardan birisi bir &lt;strong&gt;index&lt;/strong&gt; yapısının kullanılmasıdır.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;LINQ&lt;em&gt;(Language INtegrated Query)&lt;/em&gt; &lt;/strong&gt;desteği mevcuttur.&lt;/li&gt;
&lt;li&gt;Sistem de saklanması d&amp;uuml;ş&amp;uuml;n&amp;uuml;len resim,m&amp;uuml;zik gibi &lt;strong&gt;byte[] array&amp;rsquo;&lt;/strong&gt; ler ile ifade edilebilecek yapılar i&amp;ccedil;in ayrı fiziki dosyalarda verinin saklanabilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r&lt;em&gt;(Test etmedim)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Performansı arttırmaya y&amp;ouml;nelik olarak &lt;strong&gt;Task Parallel Library&amp;rsquo;&lt;/strong&gt; den yararlanıldığı ve bu nedenle minimum&lt;strong&gt; .Net Framework 4.0&lt;/strong&gt; ortamına ihtiya&amp;ccedil; duyulduğu ifade edilmektedir.&lt;/li&gt;
&lt;li&gt;İncelediğim versiyona g&amp;ouml;re &lt;strong&gt;4 milyar&lt;/strong&gt; adet dok&amp;uuml;man depolanabilmektedir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Apache License 2.0&lt;/strong&gt; ile lisanslanmıştır.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bu genel &amp;ouml;zellikler dışında, &lt;strong&gt;RaptorDB&amp;rsquo;&lt;/strong&gt; yi kullanarak veri oluşturma noktasında izlenen yolu da aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ifade edebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/raptor_6_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="raptor_6" src="/pics/raptor_6_thumb_1.png" alt="raptor_6" width="535" height="236" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak bir &lt;strong&gt;.Net&lt;/strong&gt; geliştiricisinin veriyi tanımlamadaki en g&amp;uuml;&amp;ccedil;l&amp;uuml; kozu &lt;strong&gt;POCO&lt;em&gt;(Plaint Old CLR Objects)&lt;/em&gt;&lt;/strong&gt; tipleridir. Burada da &lt;strong&gt;Entity&amp;rsquo;&lt;/strong&gt; ler aslında birer &lt;strong&gt;POCO&lt;/strong&gt; tipidir. Herhangibir &lt;strong&gt;Attribute&lt;/strong&gt; i&amp;ccedil;ermezler ve genellikle sadece basit &amp;ouml;zellikler&lt;strong&gt;&lt;em&gt;(Property)&lt;/em&gt;&lt;/strong&gt; lerden oluşurlar. Bir &lt;strong&gt;Entity&lt;/strong&gt; tanımlandıktan sonra genellikle tepede yer alanlar i&amp;ccedil;in&lt;em&gt;(&amp;ouml;rneğin Category ve Product senaryosunda Category tipi i&amp;ccedil;in)&lt;/em&gt; &lt;strong&gt;Primary View&amp;rsquo;&lt;/strong&gt; lar oluşturulur. Bu &lt;strong&gt;View&amp;rsquo;&lt;/strong&gt; lar aynı zamanda verinin sorgulanması sırasında da rol oynamakta olduğundan iyi tasarlanmalıdır. &lt;strong&gt;View&amp;rsquo;&lt;/strong&gt; lar kendi i&amp;ccedil;lerinde bir &lt;strong&gt;index&lt;/strong&gt; yapısını da belirlemektedirler.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Entity&amp;rsquo;&lt;/strong&gt; ler i&amp;ccedil;in bir veya daha fazla &lt;strong&gt;View&lt;/strong&gt; tanımlanabilir ama mutlaka bir &lt;strong&gt;Primary&lt;/strong&gt; &lt;strong&gt;Key&lt;/strong&gt; oluşturulmalıdır. Oluşturulan &lt;strong&gt;View&amp;rsquo;&lt;/strong&gt; ların etkinliği &lt;strong&gt;Register&lt;/strong&gt; edilmelerine bağlıdır. Bu sepeten &lt;strong&gt;RaptorDB&amp;rsquo;&lt;/strong&gt; ye bir bildirim yapılır.&lt;/p&gt;
&lt;p&gt;Bu hazırlıklar sonrasında &amp;ouml;rnek &lt;strong&gt;Entity&amp;rsquo;&lt;/strong&gt; ler kayıt edilebilir veya var olan &lt;strong&gt;View&amp;rsquo;&lt;/strong&gt; lardan yararlanılarak bazı sorgulamalar y&amp;uuml;r&amp;uuml;t&amp;uuml;lebilir. İstenirse bu aşamadan sonra yeni &lt;strong&gt;View&amp;rsquo;&lt;/strong&gt; lar da tanımlanabilir ve farklı indeksleme se&amp;ccedil;eneklerine uygun olacak şekilde yeni sorgulama alanları kullanılabilir.&lt;/p&gt;
&lt;p&gt;Aslında &lt;strong&gt;View&amp;rsquo;&lt;/strong&gt; lar &amp;uuml;retilirken var olan dok&amp;uuml;man verileri de, &lt;strong&gt;Map&lt;/strong&gt; adı verilen fonksiyonlar yardımıyla &lt;strong&gt;View&lt;/strong&gt; i&amp;ccedil;erisine alınırlar. &lt;strong&gt;Dok&amp;uuml;man&lt;em&gt;(Document)&lt;/em&gt;&lt;/strong&gt; esas itibariyle bir &lt;strong&gt;Entity&lt;/strong&gt; veya bir &lt;strong&gt;Entity&lt;/strong&gt; &amp;ouml;rneği&lt;em&gt;&lt;strong&gt;(Object)&lt;/strong&gt;&lt;/em&gt; olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmelidir. Her dok&amp;uuml;man, sistem i&amp;ccedil;erisinde bir &lt;strong&gt;Guid&lt;/strong&gt; ile benzersiz olarak işaretlenir. Sorgulamanın en hassas kısmı iyi indeksler kullanılmasıdır. Bu sebepten &lt;strong&gt;View&amp;rsquo;&lt;/strong&gt; lar i&amp;ccedil;erisinde &lt;strong&gt;indeks&amp;rsquo;&lt;/strong&gt; lere ilişkin basit şemalar kullanılır. Bu şemalar aslında birer &lt;strong&gt;inner&lt;/strong&gt; &lt;strong&gt;type&amp;rsquo;&lt;/strong&gt; dır ve &lt;strong&gt;View&lt;/strong&gt; i&amp;ccedil;erisinde bir sınıf olarak ifade edilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;View, belli bir ama&amp;ccedil; i&amp;ccedil;in oluşturulmuş &amp;ccedil;ok boyutlu bir dok&amp;uuml;man&lt;em&gt;(Multi Dimensional Document)&lt;/em&gt; nesnesinin, 2 boyutlu resmidir.&lt;/p&gt;
&lt;p&gt;Mehdi Gholam&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;&amp;Ouml;rnek&lt;/h1&gt;
&lt;p&gt;Dilerseniz bu kadar laf kalabalığı ve &lt;strong&gt;Key&lt;/strong&gt; &lt;strong&gt;Note&lt;/strong&gt;&amp;rsquo; dan sonra basit bir &amp;ouml;rnek &amp;uuml;zerinden ilerlemeye &amp;ccedil;alışalım. Her zamanki gibi bir &lt;strong&gt;Console&lt;/strong&gt; uygulamasına odaklanıyor olacağız. &amp;Uuml;r&amp;uuml;n&amp;uuml; &lt;strong&gt;CodeProject&lt;/strong&gt; veya &lt;strong&gt;CodePlex&lt;/strong&gt; &amp;uuml;zerinden tedarik ettikten sonra &lt;strong&gt;Source Code&amp;rsquo;&lt;/strong&gt; u &lt;strong&gt;Visual Studio&lt;/strong&gt; ortamında a&amp;ccedil;ıp &lt;strong&gt;Build&lt;/strong&gt; etmeniz yeterli olacaktır. Elde edilen &amp;uuml;retim sonrasında ortaya &amp;ccedil;ıkan &lt;strong&gt;Assembly&amp;rsquo;&lt;/strong&gt; ı ise, &lt;strong&gt;RaptorDB&amp;rsquo;&lt;/strong&gt; yi kullanmak istediğimiz uygulamaya referans etmemiz gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Bu arada makaleyi yazdığım zaman diliminde ilgili kodlar &lt;strong&gt;Visual Studio 2010&lt;/strong&gt; tabanlıydılar. Ancak &lt;strong&gt;Visual Studio 2012&lt;/strong&gt; ile sorunsuz a&amp;ccedil;ılıp, &lt;strong&gt;.Net Framework 4.5&lt;/strong&gt;&amp;rsquo;e taşınabildiler ve problemsiz derlendiler.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/raptor_1_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="raptor_1" src="/pics/raptor_1_thumb_1.png" alt="raptor_1" width="261" height="324" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Gelelim uygulamada inşa ettiğimiz tip yapısına ve kodlara.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/raptor_10_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="raptor_10" src="/pics/raptor_10_thumb_1.png" alt="raptor_10" width="604" height="572" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using RaptorDB; 
using RaptorDB.Views; 
using System; 
using System.Collections.Generic; 
using System.Diagnostics;

namespace HowTo_RaptorDB 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            string[] categoryNames = {"Kitap","Bilgisayar","Elektronik","&amp;Ccedil;i&amp;ccedil;ek","Oyuncak","Kırtasiye" };

            RaptorDB.RaptorDB db = RaptorDB.RaptorDB.Open("Data"); 
            
            if (db.RegisterView(new CategoryView()).OK == false) 
            { 
                Console.WriteLine("Registration işlemi sırasında bir hata oluştu. Programdan &amp;ccedil;ıkılacak! &amp;Ccedil;ık"); 
                return; 
            }

            if (db.RegisterView(new CategoryWithProductsView()).OK == false) 
            { 
                Console.WriteLine("Registration işlemi sırasında bir hata oluştu. Programdan &amp;ccedil;ıkılacak! &amp;Ccedil;ık"); 
                return; 
            }

            #region Veri Oluşturmak

            Stopwatch watcher = new Stopwatch(); 
            watcher.Start();

            foreach (string categoryName in categoryNames) 
            { 
                var newCategory = new Category 
                           { 
                               CategoryId = Guid.NewGuid(), 
                               CategoryName = categoryName, 
                               Description = categoryName + " i&amp;ccedil;in a&amp;ccedil;ıklama" 
                           }; 
                newCategory.Products = new List&amp;lt;Product&amp;gt;();

                for (int j = 0; j &amp;lt; 100000; j++) 
                { 
                    newCategory.Products.Add( 
                        new Product 
                        { 
                            ProductId = Guid.NewGuid(), 
                            Title = "Product " + j.ToString(), 
                            UnitPrice = 10.45M, 
                            StockSize = 100 
                        }); 
                }

                db.Save&amp;lt;Category&amp;gt;(newCategory.CategoryId, newCategory); 
            }

            watcher.Stop(); 
            Console.WriteLine("Toplam kaydetme s&amp;uuml;resi {0}" 
                , watcher.ElapsedMilliseconds.ToString() 
                ); 
            Console.ReadLine();

            #endregion Veri Oluşturmak

            #region Veri Sorgulamak

            var result = db 
                .Query( 
                    typeof(Category) 
                    , (Category c) =&amp;gt; (c.CategoryName == "Kitap") 
                    );

            Console.WriteLine(result.TotalCount);

            var result2 = db 
                .Query("CategoryWithProductsView" 
                , (Category c) =&amp;gt; (c.CategoryName == "Kitap") 
                );

            Console.WriteLine(result2.TotalCount); 
                
            #endregion Veri Sorgulamak 
        } 
    }

    public class Category 
    { 
        public Guid CategoryId { get; set; } 
        public string CategoryName { get; set; } 
        public string Description { get; set; } 
        public List&amp;lt;Product&amp;gt; Products { get; set; } 
    }

    public class Product 
    { 
        public Guid ProductId { get; set; } 
        public string Title { get; set; } 
        public decimal UnitPrice { get; set; } 
        public int StockSize { get; set; } 
    }

    public class CategoryView 
        : View&amp;lt;Category&amp;gt; 
    { 
        public class RowSchema 
        { 
            public string CategoryName { get; set; } 
            public string Description { get; set; } 
        }

        public CategoryView() 
        { 
            this.Name = "PrimaryCategoryView"; 
            this.Description = "Primary View of Category"; 
            this.isPrimaryList = true; 
            this.isActive = true; 
            this.BackgroundIndexing = true;

            this.Schema = typeof(CategoryView.RowSchema);

            this.AddFireOnTypes(typeof(Category));

            this.Mapper = (api, docId, doc) =&amp;gt; 
            { 
                    api.Emit(docId 
                        , doc.CategoryName 
                        , doc.Description 
                        );                                
            }; 
        } 
    }

    public class CategoryWithProductsView 
    : View&amp;lt;Category&amp;gt; 
    { 
        public class RowSchemaV2 
        { 
            public NormalString ProductTitle { get; set; } 
            public int ProductStockSize { get; set; } 
            public string CategoryName { get; set; } 
            public string Description { get; set; } 
        }

        public CategoryWithProductsView() 
        { 
            this.Name = "CategoryWithProductsView"; 
            this.Description = "Category with Products View"; 
            this.isPrimaryList = false; 
            this.isActive = true; 
            this.BackgroundIndexing = true;

            this.Schema = typeof(CategoryWithProductsView.RowSchemaV2);

            this.AddFireOnTypes(typeof(Category));

            this.Mapper = (api, docId, doc) =&amp;gt; 
            { 
                foreach (var product in doc.Products) 
                    api.Emit(docId 
                        , product.Title 
                        ,product.StockSize 
                        , doc.CategoryName 
                        , doc.Description 
                        ); 
            }; 
        } 
    } 
}&lt;/pre&gt;
&lt;h1&gt;Kodun İşleyişi&lt;/h1&gt;
&lt;p&gt;İki adet &lt;strong&gt;POCO&lt;/strong&gt; tipi s&amp;ouml;z konusudur. &lt;strong&gt;Category&lt;/strong&gt; ve &lt;strong&gt;Product&lt;/strong&gt;. Tahmin edileceği &amp;uuml;zere bir kategori altında n sayıda &amp;uuml;r&amp;uuml;n olabilmelidir. Bu ilişki i&amp;ccedil;in &lt;strong&gt;Category&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde &lt;strong&gt;Product&lt;/strong&gt; tipinden generic bir &lt;strong&gt;List&lt;/strong&gt; kullanılmaktadır.&lt;/p&gt;
&lt;p&gt;İki adet &lt;strong&gt;View&lt;/strong&gt; tipi s&amp;ouml;z konusudur. Bunlardan birisi &lt;strong&gt;Primary&lt;/strong&gt; &lt;strong&gt;View&lt;/strong&gt; olarak set edilmiştir. Her iki &lt;strong&gt;View&lt;/strong&gt; i&amp;ccedil;in s&amp;ouml;ylenebilecek en &amp;ouml;nemli &amp;ouml;zellik ise i&amp;ccedil;erdikleri dahili tip tanımlarıdır. &lt;strong&gt;RowSchema&lt;/strong&gt; ve &lt;strong&gt;RowSchemaV2&lt;/strong&gt; i&amp;ccedil;erisinde bir &lt;strong&gt;index&lt;/strong&gt; yapısının da belirtildiğini ifade edebiliriz. &amp;Ouml;yleki burada tanımlı olan alanlar i&amp;ccedil;in sorgulamalar yapılabilir. Bu nedenle &lt;strong&gt;View&amp;rsquo;&lt;/strong&gt; ların &lt;strong&gt;yapıcı metodlarında&lt;em&gt;(Constructors)&lt;/em&gt;&lt;/strong&gt; kullanılan &lt;strong&gt;Mapper&lt;/strong&gt; fonksiyonelliklerinde bir &lt;strong&gt;Emit&lt;/strong&gt; işlemi ger&amp;ccedil;ekleştirilmektedir. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;CategoryView&lt;/strong&gt; i&amp;ccedil;in kategori adı ve a&amp;ccedil;ıklamasından oluşan bir veri girişi s&amp;ouml;z konusudur. Ancak &lt;strong&gt;CategoryWithProductsView&lt;/strong&gt; i&amp;ccedil;in kategori adı ve a&amp;ccedil;ıklaması haricinde o kategoriye dahil olan &amp;uuml;r&amp;uuml;n başlığı ve stok miktarı da s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;Yani bir &lt;strong&gt;View&lt;/strong&gt; tanımlanırken, i&amp;ccedil;erisinde sorgulama i&amp;ccedil;in kritik olan &lt;strong&gt;index&lt;/strong&gt; yapısının şeması yine bir sınıf olarak tanımlanır ve verilerin oluşturulması aşamasında bu i&amp;ccedil;eriğin &amp;uuml;retilmesi &lt;strong&gt;Mapper&amp;rsquo;&lt;/strong&gt; lar yardımıyla sağlanır. Tabi g&amp;ouml;zden ka&amp;ccedil;ırılmaması gereken bir nokta da &lt;strong&gt;View&amp;rsquo;&lt;/strong&gt; ların aslında &lt;strong&gt;generic&lt;/strong&gt; &lt;strong&gt;View&lt;/strong&gt; sınıfında t&amp;uuml;remiş olmalarıdır. Bu &amp;uuml;st sınıfdan gelen &lt;strong&gt;isPrimaryViewList&lt;/strong&gt;, &lt;strong&gt;isActive&lt;/strong&gt;, &lt;strong&gt;BackgroundIndexing&lt;/strong&gt;, &lt;strong&gt;Schema&lt;/strong&gt;, &lt;strong&gt;Mapper&lt;/strong&gt; gibi &amp;ouml;zellikler ve &lt;strong&gt;AddFireOnTypes&lt;/strong&gt; gibi fonksiyonlar yapıcı metod i&amp;ccedil;erisinde kullanılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;View&amp;rsquo;&lt;/strong&gt; ların etkinliği veritabanına kayıt edilmelerine bağlıdır. Bu nedenle &amp;uuml;retilen &lt;strong&gt;RaptorDB&lt;/strong&gt; nesne &amp;ouml;rneği &amp;uuml;zerinden &lt;strong&gt;RegisterView&lt;/strong&gt; metodu kullanılmış ve bunlara yazılan &lt;strong&gt;View&amp;rsquo;&lt;/strong&gt; ların nesne &amp;ouml;rnekleri bildirilmiştir.&lt;/p&gt;
&lt;p&gt;Aslında bundan sonraki aşamalar olduk&amp;ccedil;a kolaydır. Bir dok&amp;uuml;manı kaydetmek i&amp;ccedil;in &lt;strong&gt;RaptorDB&lt;/strong&gt; &amp;ouml;rneğinin &lt;strong&gt;Save&lt;/strong&gt; metodu kullanılırken ilk parametre olarak bir &lt;strong&gt;Guid&lt;/strong&gt; bilgisi verilir. Diğer yandan sorgulamalar i&amp;ccedil;in &lt;strong&gt;Query&lt;/strong&gt; fonksiyonu ele alınmaktadır. &lt;strong&gt;Query&lt;/strong&gt; fonksiyonunun farklı versiyonları vardır. Eğer parametre olarak bir &lt;strong&gt;Entity&lt;/strong&gt; nesne &amp;ouml;rneği verilirse bu durumda ilgili &lt;strong&gt;Entity&lt;/strong&gt; i&amp;ccedil;in belirtilen &lt;strong&gt;Primary View&lt;/strong&gt; kim ise, sorgulama i&amp;ccedil;in o &lt;strong&gt;View&lt;/strong&gt; &amp;ouml;rneği ele alınır. Ancak farklı bir &lt;strong&gt;View&lt;/strong&gt; kullanılması isteniyorsa, bu durumda ilgili &lt;strong&gt;View&amp;rsquo;&lt;/strong&gt; un tipi veya string olarak adı kullanılabilir.&lt;/p&gt;
&lt;h1&gt;Debug Anında&lt;/h1&gt;
&lt;p&gt;&lt;strong&gt;RaptorDB&lt;/strong&gt; nesnesi &amp;ouml;rneklenirken parametre olarak bir klas&amp;ouml;r belirtilir. Eğer bu klas&amp;ouml;r yoksa uygulamanın &amp;ccedil;alışması sırasında oluşturulur. Ben &amp;ouml;rneği test ederken &lt;strong&gt;RaptorDB&amp;rsquo;&lt;/strong&gt; nin &amp;ouml;rneklendiği noktada durdum ve aşağıdaki klas&amp;ouml;r yapısının otomatik olarak &amp;uuml;retildiğine şahit oldum.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/raptor_2.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="raptor_2" src="/pics/raptor_2_thumb.png" alt="raptor_2" width="584" height="350" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Hatta &lt;strong&gt;Data&lt;/strong&gt; klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisine baktığımda farklı uzantılarda pek &amp;ccedil;ok dosyanın &amp;uuml;retildiğini ancak i&amp;ccedil;erisine bir veri atılmadığını fark ettim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/raptor_3.png"&gt;&lt;img style="display: inline;" title="raptor_3" src="/pics/raptor_3_thumb.png" alt="raptor_3" width="592" height="314" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Her ne zaman &lt;strong&gt;Entity&lt;/strong&gt; &amp;ouml;rnekleri birer &lt;strong&gt;Dok&amp;uuml;man&lt;/strong&gt; olarak kayıt edilmeye başladılar işte o zaman &lt;strong&gt;mgdat&lt;/strong&gt; ve &lt;strong&gt;mgidx&lt;/strong&gt; uzantılı dosyaların i&amp;ccedil;erikleri değişmeye başladı. &amp;Ouml;rnek olarak her bir kategori i&amp;ccedil;in &lt;strong&gt;100bin&lt;/strong&gt; &lt;strong&gt;Dummy&lt;/strong&gt; &lt;strong&gt;Product&lt;/strong&gt; nesne &amp;ouml;rneği &amp;uuml;rettiğimde yaklaşık olarak &lt;strong&gt;188&lt;/strong&gt; &lt;strong&gt;megabyte&amp;rsquo;&lt;/strong&gt; lık veri k&amp;uuml;mesinin&lt;strong&gt; 4 saniyeye&lt;/strong&gt; yakın bir s&amp;uuml;rede &amp;uuml;retildiğine tanık oldum. Diğer &amp;uuml;r&amp;uuml;nler ile kıyaslanmasına bakmadım tabi ama bu s&amp;uuml;re olduk&amp;ccedil;a etkileyici gibi geldi bana &lt;img class="wlEmoticon wlEmoticon-sarcasticsmile" style="border-style: none;" src="/pics/wlEmoticon-sarcasticsmile_15.png" alt="Sarcastic smile" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/raptor_4.png"&gt;&lt;img style="display: inline;" title="raptor_4" src="/pics/raptor_4_thumb.png" alt="raptor_4" width="448" height="288" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;ve tabi &lt;strong&gt;data.mgdat&lt;/strong&gt; dosyasının i&amp;ccedil;erisine bakıldığında verinin buraya serileştiğine şahit oldum.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/raptor_7.png"&gt;&lt;img style="display: inline;" title="raptor_7" src="/pics/raptor_7_thumb.png" alt="raptor_7" width="560" height="522" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin &lt;strong&gt;Primary View&amp;rsquo;&lt;/strong&gt; un kullanıldığı sorgulama senaryosunda, &lt;strong&gt;CategoryView&lt;/strong&gt; i&amp;ccedil;erisinde belirtilen şema yapısına uygun bir sonu&amp;ccedil; k&amp;uuml;mesinin &amp;ccedil;ekildiği g&amp;ouml;r&amp;uuml;lmektedir. Aşağıdaki &lt;strong&gt;Breakpoint&lt;/strong&gt; g&amp;ouml;rselinde bu durum ifade edilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/raptor_8.png"&gt;&lt;img style="background-image: none; padding-top: 0px; padding-left: 0px; display: inline; padding-right: 0px; border-width: 0px;" title="raptor_8" src="/pics/raptor_8_thumb.png" alt="raptor_8" width="640" height="353" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;sadece kategori adı&lt;/strong&gt; ve &lt;strong&gt;a&amp;ccedil;ıklaması&lt;/strong&gt; ile &lt;strong&gt;benzersiz bir&lt;/strong&gt; &lt;strong&gt;Guid&lt;/strong&gt; s&amp;ouml;z konusudur. Hi&amp;ccedil; bir &lt;strong&gt;Product&lt;/strong&gt; yoktur. Zaten buradan o kategoriye bağlı &amp;uuml;r&amp;uuml;nlere de gidilemeyecektir. Nitekim &lt;strong&gt;View&amp;rsquo;&lt;/strong&gt; un &lt;strong&gt;index&lt;/strong&gt; yapısından kategorinin &amp;uuml;r&amp;uuml;nleri belirtilmemiştir. Lakin ikinci &lt;strong&gt;View&amp;rsquo;&lt;/strong&gt; da farklı bir şema kullanılmıştır. Bu nedenle &lt;strong&gt;Kategori&lt;/strong&gt; ve buna bağlı &amp;uuml;r&amp;uuml;nler elde edilebilir. Aşağıdaki &lt;strong&gt;Breakpoint&lt;/strong&gt; g&amp;ouml;rseline dikkat edelim&lt;em&gt;(100binlik &amp;ouml;rnek senaryo yerine 20 adet Dummy Product tipi ele alınmıştır)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/raptor_9.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="raptor_9" src="/pics/raptor_9_thumb.png" alt="raptor_9" width="555" height="401" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;20 satırlık bir sonu&amp;ccedil; k&amp;uuml;mesi&lt;/strong&gt; s&amp;ouml;z konusudur ve her bir satır i&amp;ccedil;erisinde &lt;strong&gt;CategoryWithProductsView&amp;rsquo;&lt;/strong&gt; da belirtilen şemaya uygun alanlar yer almaktadır. &amp;Uuml;r&amp;uuml;n başlığı&lt;em&gt;(Title)&lt;/em&gt;, stok miktarı&lt;em&gt;(StockSize)&lt;/em&gt;, kategori adı&lt;em&gt;(CategoryName)&lt;/em&gt; ve kategori a&amp;ccedil;ıklaması&lt;em&gt;(Description)&lt;/em&gt;. Bu son derece doğaldır &amp;ccedil;&amp;uuml;nk&amp;uuml; ilgili &lt;strong&gt;View&lt;/strong&gt; i&amp;ccedil;erisindeki şema yapısı buna uygun olacak şekildedir. Pek tabi bu şema yapısı indekside ifade ettiğinden, &lt;strong&gt;LINQ&lt;/strong&gt; sorgusunda belirtilen alanlardan biri veya bir ka&amp;ccedil;ının kullanılabilirliği s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere RaptorDB, kullanımı ve felsefesi ile dikkat &amp;ccedil;ekicidir. Hızlı bir Document Store NoSQL &amp;uuml;r&amp;uuml;n&amp;uuml; olduğunu ifade edebiliriz. A&amp;ccedil;ık kaynak olması da işin cabası &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_89.png" alt="Smile" /&gt; B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki yazımızda g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2013%2f2%2fHowTo_RaptorDB.zip"&gt;HowTo_RaptorDB.zip (162,25 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2014-04-24 14:55:00</pubDate>
  <slug>NoSQL-Maceralarc4b1-RaptorDB-ile-Hello-World</slug>
  <tags>
    <tag>nosql</tag>
  </tags>
  <categories>
    <category>NoSQL</category>
  </categories>
</post>