<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Arayüzler'de is ve as Anahtar Sözcüklerinin Kullanımı</title>
  <description>Bugünkü makalemizde, arayüzlerde is ve as anahtar kelimelerinin kullanımını inceleyeceğiz. Bir sınıfa arayüz(ler) uyguladığımızda, bu arayüzlerde tanımlanmış metodları çağırmak için çoğunlukla tercih edilen bir teknik vardır. O da, bu sınıfa ait nesne örneğini, çalıştırılacak metodun tanımlandığı arayüz tipine dönüştürmek ve bu şekilde çağırmaktadır. Bu teknik, her şeyden önce, program kodlarının okunabilirliğini ve anlaşılabilirliğini arttırmaktadır. Öyleki, bir isim uzayında yer alan çok sayıda arayüzün ve sınıfın yer aldığı uygulamalarda be tekniği uygulayarak, hangi arayüze ait metodun çalıştırıldığı daha kolay bir şekilde gözlemlenebilmektedir. Diğer yandan bu teknik, aynı metod tanımlamalarına sahip arayüzler için de kullanılır ki bunu bir önceki makalemizde işlemiştik.</description>
  <content>&lt;p align="left"&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p align="left"&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde, aray&amp;uuml;zlerde &lt;strong&gt;is&lt;/strong&gt; ve &lt;strong&gt;as&lt;/strong&gt; anahtar kelimelerinin kullanımını inceleyeceğiz. Bir sınıfa aray&amp;uuml;z(ler) uyguladığımızda, bu aray&amp;uuml;zlerde tanımlanmış metodları &amp;ccedil;ağırmak i&amp;ccedil;in &amp;ccedil;oğunlukla tercih edilen bir teknik vardır. O da, bu sınıfa ait nesne &amp;ouml;rneğini, &amp;ccedil;alıştırılacak metodun tanımlandığı aray&amp;uuml;z tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;rmek ve bu şekilde &amp;ccedil;ağırmaktadır. Bu teknik, her şeyden &amp;ouml;nce, program kodlarının okunabilirliğini ve anlaşılabilirliğini arttırmaktadır. &amp;Ouml;yleki, bir isim uzayında yer alan &amp;ccedil;ok sayıda aray&amp;uuml;z&amp;uuml;n ve sınıfın yer aldığı uygulamalarda be tekniği uygulayarak, hangi aray&amp;uuml;ze ait metodun &amp;ccedil;alıştırıldığı daha kolay bir şekilde g&amp;ouml;zlemlenebilmektedir. Diğer yandan bu teknik, aynı metod tanımlamalarına sahip aray&amp;uuml;zler i&amp;ccedil;in de kullanılır ki bunu bir &amp;ouml;nceki makalemizde işlemiştik.&lt;/p&gt;
&lt;p align="left"&gt;Bu teknik ile ilgili olarak, dikkat edilmesi gereken bir noktada vardır. Bir sınıfa ait nesne &amp;ouml;rneğini, bu sınıfa &lt;strong&gt;uygulamadığımız&lt;/strong&gt; bir aray&amp;uuml;ze ait herhangibir metodu &amp;ccedil;alıştırmak i&amp;ccedil;in, ilgili aray&amp;uuml;z tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde &lt;strong&gt;InvalidCastException&lt;/strong&gt; istisnasını alırız. Bu noktayı daha iyi vurgulayabilmek i&amp;ccedil;in aşağıdaki &amp;ouml;rneğimizi g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. Bu &amp;ouml;rnekte iki aray&amp;uuml;z yer almakta olup, tanımladığımız sınıf, bu aray&amp;uuml;zlerden sadece bir tanesini uygulamıştır. Ana sınıfımızda, bu sınıfa ait nesne &amp;ouml;rneği, uygulanmamış aray&amp;uuml;z tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lm&amp;uuml;ş ve bu aray&amp;uuml;zdeki bir metod &amp;ccedil;ağırılmak istenmiştir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace Interface3
{
     public interface IKullanilmayan
     {
          void Yaz();
          void Bul();
     }
     public interface IKullanilan
     {
          void ArayuzAdi();

     }
  
     public class ASinifi:IKullanilan
     {
          public void ArayuzAdi()
          {
               Console.WriteLine("Aray&amp;uuml;z adl:IKullanilan");
          }
     }
     class Class1
     {
          static void Main(string[] args)
          {
               ASinifi a=new ASinifi();
               IKullanilan Kul=(IKullanilan)a;
               Kul.ArayuzAdi();
               IKullanilmayan anKul=(IKullanilmayan)a;
               anKul.Yaz();
          }
     }
}&lt;/pre&gt;
&lt;p align="left"&gt;Bu &amp;ouml;rneği derlediğinizde herhangibi derleyici hatası ile karşılaşmassınız. Ancak &amp;ccedil;alışma zamanında &lt;strong&gt;"System.InvalidCastException: Specified Cast Is Invalid"&lt;/strong&gt; &amp;ccedil;alışma zamanı hatasını alırız. İşte bu sorunu &lt;strong&gt;is&lt;/strong&gt; veya &lt;strong&gt;as&lt;/strong&gt; anahtar s&amp;ouml;zc&amp;uuml;klerinin kullanıldığı iki farklı teknikten birisi ile &amp;ccedil;&amp;ouml;zebiliriz. &lt;strong&gt;Is&lt;/strong&gt; ve &lt;strong&gt;as&lt;/strong&gt; bu sorunun &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;nde aynı amaca hizmet etmekle beraber aralarında &amp;ouml;nemli iki fark vardır.&lt;/p&gt;
&lt;p align="left"&gt;Is anahtar kelimesi aşağıdaki formasyonda kullanılır.&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt;nesne&lt;/em&gt; &lt;strong&gt;is&lt;/strong&gt; &lt;em&gt;tip&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;Is anahtar kelimesi nesne ile tipi karşılaştırır. Yani belirtilen nesne ile, bir sınıfı veya aray&amp;uuml;z&amp;uuml; kıyaslarlar. Bu s&amp;ouml;z dizimi bir if karşılaştırmasında kullanılır ve eğer nesnenin &amp;uuml;retildiği sınıf, belirtilen tip'teki aray&amp;uuml;zden uygulanmışsa bu koşullu ifade true değerini d&amp;ouml;nd&amp;uuml;recektir. Aksi durumda false değerini d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Şimdi bu tekniği yukarıdaki &amp;ouml;rneğimize uygulayalım. Yapmamız gereken değişiklik Main metodunda yer almaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
     ASinifi a=new ASinifi();
     IKullanilan Kul=(IKullanilan)a;
     Kul.ArayuzAdi();
     if(a is IKullanilmayan){
          IKullanilmayan anKul=(IKullanilmayan)a;
          anKul.Yaz();
     }
     else
     {
          Console.WriteLine("ASinifi, IKullanilmayan aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamamıştır.");
     }
}&lt;/pre&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk40_1.gif" alt="" width="444" height="97" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 1: is Anahtar Kelimesinin Kullanımı.&lt;/p&gt;
&lt;p align="left"&gt;If koşullu ifadesinde, a isimli nesneyi oluşturduğumuz ASinifi sınıfına, IKullanilmayan aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulayıp uyguladığımızı kontrol etmekteyiz. Sonu&amp;ccedil; false değerini d&amp;ouml;nd&amp;uuml;recektir. Nitekim, ASinifi sınıfına, IKullanilmayan aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamadık.&lt;/p&gt;
&lt;p align="left"&gt;&lt;strong&gt;Is&lt;/strong&gt; anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; aray&amp;uuml;zler dışında sınıflar i&amp;ccedil;inde kullanabiliriz. Bununla birlikte &lt;strong&gt;is&lt;/strong&gt; anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml; kullanıldığında, program kodu Intermediate Language (IL) &amp;ccedil;evrildiğinde, yapılan denetlemenin iki kere tekrar edildiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bu verimliliği d&amp;uuml;ş&amp;uuml;r&amp;uuml;c&amp;uuml; bir etkendir. İşte &lt;strong&gt;is&lt;/strong&gt; yerine &lt;strong&gt;as&lt;/strong&gt; anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml; tercih etmemizin nedenlerinden biriside budur. Diğer taraftan &lt;strong&gt;is&lt;/strong&gt; ve &lt;strong&gt;as&lt;/strong&gt; teknikleri, d&amp;ouml;nd&amp;uuml;rd&amp;uuml;kleri değerler bakımından da farklılık g&amp;ouml;sterir. &lt;strong&gt;Is&lt;/strong&gt; anahtar kelimesi, bool tipinde ture veya false değerlerini d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. &lt;strong&gt;As&lt;/strong&gt; anahtar kelimesi ise, bir nesneyi , bu nesne sınıfına uygulanmış bir aray&amp;uuml;z tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;r. Eğer nesne sınıfı, belirtilen aray&amp;uuml;z&amp;uuml; uygulamamışsa, d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi yinede yapılır, fakat d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmenin aktarıldığı değişken null değerine sahip olur. &lt;strong&gt;As&lt;/strong&gt; anahtar kelmesinin formu aşağıdaki gibidir.&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt;sınıf nesne1=nesne2&lt;/em&gt; &lt;strong&gt;as&lt;/strong&gt; &lt;em&gt;tip&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;Burada eğer nesneye belirtilen tipi temsil eden aray&amp;uuml;z uygulanmamışsa, nesne null değerini alır. Aksi durumda nesne belirtilen tipe d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;l&amp;uuml;r. İşte &lt;strong&gt;is&lt;/strong&gt; ile &lt;strong&gt;as&lt;/strong&gt; arasındaki ikinci farkta budur. Konuyu daha iyi anlayabilmek i&amp;ccedil;in &lt;strong&gt;as&lt;/strong&gt; anahtar kelimesini yukarıdaki &amp;ouml;rneğimize uygulayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
     ASinifi a=new ASinifi();
     IKullanilan Kul=(IKullanilan)a;
     Kul.ArayuzAdi();
     IKullanilmayan anKul=a as IKullanilmayan;
     if(anKul!=null)
     {
          anKul.Yaz();
     }
     else
     {
          Console.WriteLine("ASinifi IKullanilmayan tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lemedi");
     }
}&lt;/pre&gt;
&lt;p align="left"&gt;Burada a nesnemiz ASinifi sınıfının &amp;ouml;rneğidir. &lt;strong&gt;As&lt;/strong&gt; ile bu &amp;ouml;rneği IKullanilmayan aray&amp;uuml;z&amp;uuml; tipinden anKul değişkenine aktarmaya &amp;ccedil;alışıyoruz. İşte bu noktada, ASinifi, IKullanilmayan aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamadığı i&amp;ccedil;in, anKul değişkeni null değerini alıcaktır. Sonra if koşullu ifadesi ile, anKul 'un null olup olmadığı kontrol ediyoruz. Uygulamayı &amp;ccedil;alıştırdığımızda aşağıdaki sonucu elde ederiz.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk40_2.gif" alt="" width="412" height="97" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 2: as Anahtar Kelimesinin Kullanımı&lt;/p&gt;
&lt;p align="left"&gt;Geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-01-12 12:00:00</pubDate>
  <slug>Arayüzler'de-is-ve-as-Anahtar-Sözcüklerinin-Kullanımı-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>as</tag>
    <tag>is</tag>
    <tag>interface</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>