<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Strongly Typed DataSet - 2 (Kuvvetle Türlendirilmiş Veri Kümeleri)</title>
  <description>Bir önceki makalemizde, Kuvvetle Türlendirilmiş Veri Kümelerinin ne olduğunu ve nasıl oluşturulduğunu incelemiştik. Bu makalemizde ise, bir türlendirilmiş veri kümesi yardımıyla satır ekleme, arama, düzenleme ve silme gibi işlemlerin nasıl yapılacağını inceleyeceğiz. Bu amaçla işe basit bir windows uygulaması ile başlıyoruz. Bu uygulamamızda kolaylık olması açısından Kuvvetle Türlendirilmiş Veri Kümemizi, Visual Studio.NET ortamında oluşturdum. Uygulamamızda, Makale isimli sql tablomuzu kullanacağız. Uygulamamızın formu izleyen şekildeki gibi olucak.</description>
  <content>&lt;p align="justify"&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p align="justify"&gt;Bir &amp;ouml;nceki makalemizde, Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;melerinin ne olduğunu ve nasıl oluşturulduğunu incelemiştik. Bu makalemizde ise, bir t&amp;uuml;rlendirilmiş veri k&amp;uuml;mesi yardımıyla satır ekleme, arama, d&amp;uuml;zenleme ve silme gibi işlemlerin nasıl yapılacağını inceleyeceğiz. Bu ama&amp;ccedil;la işe basit bir windows uygulaması ile başlıyoruz. Bu uygulamamızda kolaylık olması a&amp;ccedil;ısından Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;memizi, Visual Studio.NET ortamında oluşturdum. Uygulamamızda, Makale isimli sql tablomuzu kullanacağız. Uygulamamızın formu izleyen şekildeki gibi olucak.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk51_1.gif" alt="" width="562" height="409" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 1. Form Tasarımımız.&lt;/p&gt;
&lt;p align="justify"&gt;Kullanıcı, Ekle başlıklı butona tıkladığında, textBox kontrollerine girmiş olduğu değerlerden oluşan yeni satırımız, dataTable'ımıza eklenmiş olucak. Bu işlemi ger&amp;ccedil;ekleştiren kodlar aşağıda verilmiştir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnEkle_Click(object sender, System.EventArgs e)
{
     dsMakale.MakaleRow dr; /* Yeni bir satır tanımlanıyor. MakaleRow bir DataRow tipidir ve bizim dsMakale isimli Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi sınıfımızda yer almaktadır.*/
     dr=mk.Makale.NewMakaleRow(); /* MakalNewRow ile dr isimli MakaleRow nesnemizin, Makale isimli DataTable'ımızda yeni ve boş bir satıra referans etmesi sağlanıyor. */
     dr.Konu=txtKonu.Text; /* Veriler yeni satırımızın ilgili alanlarına yerleştiriliyor. */
     dr.Tarih=Convert.ToDateTime(txtTarih.Text);
     dr.Adres=txtAdres.Text;
     mk.Makale.AddMakaleRow(dr); /* Son olarak AddMakaleRow metodu ile oluşturulan yeni satır dataTable'ımıza ekleniyor.*/
}&lt;/pre&gt;
&lt;p align="justify"&gt;Bu teknikte dikkat edicek olursanız Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;memize ait metodlar ve nesneler kullanılmıştır. &amp;Ouml;rneğin, bir DataTable nesnesi ile referans edilen bellek b&amp;ouml;lgesindeki tabloya, yeni bir satır eklemek i&amp;ccedil;in &amp;ouml;ncelikle yeni bir DataRow nesnesi tanımlarız. Sonra bu DataRow nesnesini boş bir satır olacak şekilde DataTable nesnemiz i&amp;ccedil;in oluştururuz. Daha sonra bu DataRow nesnesinde her bir alan i&amp;ccedil;in yeni verileri ekleriz. Son olarakta bu oluşturulan yeni DataRow nesnesini DataTable'ımıza ekleriz. B&amp;ouml;ylece, DataTable nesnemizin işaret ettiği tabloya yeni bir satır eklemiş oluruz. Bu teknik klasik olarak T&amp;uuml;rlendirilmemiş Veri K&amp;uuml;melerini kullandığımız &amp;ouml;rneklerde aşağıdaki kodlar ile ger&amp;ccedil;ekleştirimektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;DataRow drKlasik;
drKlasik=ds.Tables[0].NewRow();
drKlasik[1]=txtKonu.Text;
drKlasik[2]=Convert.ToDateTime(txtTarih.Text);
drKlasik[3]=txtAdres.Text;
ds.Tables[0].Rows.Add(drKlasik);&lt;/pre&gt;
&lt;p align="justify"&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi teknik olarak iki yaklaşımda aynıdır. Ancak, aralarındaki farkı anlamak i&amp;ccedil;in kullanılan ifadelere yakından bakmamız yeterlidir. Herşeyden &amp;ouml;nce Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;melerini kullanmak, kod yazarken programcıya daha anlaşılır gelmektedir. Dilerseniz, bu iki tekniği aşağıdaki tablo ile karşılaştıralım.&amp;nbsp;&lt;/p&gt;
&lt;div&gt;
&lt;table id="AutoNumber3" style="width: 100%; height: 239px;" border="1" cellspacing="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#cccccc" width="50%" height="32"&gt;UnTyped Dataset Tekniği&lt;/td&gt;
&lt;td align="center" bgcolor="#cccccc" width="50%" height="32"&gt;Typed DataSet Tekniği&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td colspan="2" align="center" bgcolor="#cccccc" width="100%" height="35"&gt;Yeni Bir Satır Tanımlamak&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="50%" height="19"&gt;DataRow drKlasik;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;/td&gt;
&lt;td width="50%" height="19"&gt;dsMakale.MakaleRow dr;
&lt;p&gt;&lt;img src="/makale/images/mk51_2.gif" alt="" width="267" height="126" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi intelliSense &amp;ouml;zelliği sayesinde, dsMakale dataSet'inden sonra yeni bir DataRow nesnesi oluşturmak i&amp;ccedil;in gerekli s&amp;ouml;z dizimini bulmak ve anlamak son derece kolay.&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td colspan="2" bgcolor="#cccccc" width="100%" height="38"&gt;
&lt;p align="center"&gt;Tanımlanan Yeni Satırı Oluşturmak&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="50%" height="19"&gt;drKlasik=ds.Tables[0].NewRow();
&lt;p&gt;&lt;img src="/makale/images/mk51_4.gif" alt="" width="236" height="186" border="0" /&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;td width="50%" height="19"&gt;dr=mk.Makale.NewMakaleRow();
&lt;p&gt;&lt;img src="/makale/images/mk51_3.gif" alt="" width="232" height="184" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, Typed DataSet sınıfımız yardımıyla tanımlanan yeni satırı oluşturmak i&amp;ccedil;in kullanacağımız s&amp;ouml;z dizimi &amp;ccedil;ok daha okunaklı ve anlamlı.&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td colspan="2" align="center" bgcolor="#cccccc" width="100%" height="36"&gt;Alanlara Verileri Aktarmak&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="50%" height="19"&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; drKlasik[1]=txtKonu.Text;
&lt;p&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; drKlasik[2]=Convert.ToDateTime(txtTarih.Text);&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; drKlasik[3]=txtAdres.Text;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk51_6.gif" alt="" width="253" height="46" border="0" /&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;td width="50%" height="19"&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; dr.Konu=txtKonu.Text;
&lt;p&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; dr.Tarih=Convert.ToDateTime(txtTarih.Text);&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; dr.Adres=txtAdres.Text;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk51_5.gif" alt="" width="153" height="187" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bir Type DataSet &amp;uuml;zerinden oluşturduğumuz DataRow nesnesinin alanlarına veri aktarırken hangi alanların olduğunu kolayca g&amp;ouml;zlemleyebiliriz. &amp;Uuml;stelik bu bi&amp;ccedil;im, kodumuza daha kolay okunurluk ve anlam kazandırır.&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td colspan="2" align="center" bgcolor="#cccccc" width="100%" height="34"&gt;Oluşturulan Satırın Tabloya Eklenmesi&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="50%" height="19"&gt;ds.Tables[0].Rows.Add(drKlasik);
&lt;p&gt;&lt;img src="/makale/images/mk51_8.gif" alt="" width="248" height="185" border="0" /&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;td width="50%" height="19"&gt;mk.Makale.AddMakaleRow(dr);
&lt;p&gt;&lt;img src="/makale/images/mk51_7.gif" alt="" width="211" height="184" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;NewMakaleRow metoduna ulaşmak g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi daha kolaydır.&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;Tablo 1. T&amp;uuml;rlendirilmiş (Typed) ve T&amp;uuml;rlendirilmemiş (UnTyped) Veri K&amp;uuml;melerinde Satır Ekleme İşlemlerinin Karşılaştırılması.&lt;/p&gt;
&lt;p align="justify"&gt;Her iki teknik arasında kavramsal olarak fark bulunmamasına rağmen, uygulanabilirlik ve kolaylık a&amp;ccedil;ısından farklar olduğunu g&amp;ouml;r&amp;uuml;yoruz. Bu durum verileri ararken, d&amp;uuml;zenlerken veya silerkende karşımıza &amp;ccedil;ıkmaktadır. Şimdi uygulamamızda belli bir satırı nasıl bulacağımızı inceleyelim. Kullanıcı Bul başlıklı butona tıkladığında txtMakaleID textBox kontrol&amp;uuml;ne girdiği değerdeki satır bulunacak ve bulunan satıra ait alan verileri, formumuzdaki diğer textBox kontrollerine y&amp;uuml;klencek. Arama işleminin PrimaryKey &amp;uuml;zerinden yapıldığınıda belirtelim. Şimdi kodlarımızı yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnBul_Click(object sender, System.EventArgs e)
{
     dsMakale.MakaleRow drBulunan; /* Arama sonucu bulunan satırı tutacak DataRow nesnemiz tanımlanıyor. */
     drBulunan=mk.Makale.FindByID(Convert.ToInt32(txtMakaleID.Text)); /* FindByID metodu, T&amp;uuml;rlendirilimiş Veri K&amp;uuml;memizdeki tablomuzun Primary Key alanı &amp;uuml;zerinden arama yapıyor ve sonucu drBulunan DataRow(MakaleRow) nesnemize atıyor. */
 
     if(drBulunan!=null) /* Eğer aranan satır bulunursa drBulunan değeri null olmayacaktır. */
     {
          txtKonu.Text=drBulunan.Konu; /* Bulunan satıra ait alan verileri ilgili kontrollere atanıyor. */
          txtTarih.Text=drBulunan.Tarih.ToString();
          txtAdres.Text=drBulunan.Adres;
     }
     else
     {
          MessageBox.Show("Aranan Makale Bulunamadı");
     }
}&lt;/pre&gt;
&lt;p align="justify"&gt;Bu arama tekniğinin, t&amp;uuml;rlendirilmemiş veri k&amp;uuml;melerindeki arama tekniğine g&amp;ouml;re &amp;ccedil;ok farklı bir &amp;ouml;zelliği vardır. Klasik y&amp;ouml;ntemde bir DataTable &amp;uuml;zerinden arama yaparken Find metodunu kullanırız.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk51_11.gif" alt="" width="394" height="53" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 3. Klasik Find metodu.&lt;/p&gt;
&lt;p align="justify"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Find metodu, PrimaryKey değerini alır ve bu değeri kullanarak, tablonun PrimaryKey alanı &amp;uuml;zeriden arama yapar. Oysa &amp;ouml;rneğimizde kullandığımız T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesine ait Makale DataTable nesnesinin Find metodu isim değişikliğine uğrayrak FindByID haline d&amp;ouml;n&amp;uuml;şm&amp;uuml;şt&amp;uuml;r. Nitekim, bu yeni DataTable nesnesi hangi alanın PrimaryKey olduğunu bilir ve metodun ismini buna g&amp;ouml;re değiştirerek arama kodunu yazmamızı son derece kolaylaştırır.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk51_10.gif" alt="" width="287" height="162" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 4. FindByID metodu;&lt;/p&gt;
&lt;p align="justify"&gt;Diğer yandan, Klasik Find metodumuz, key parametresini object t&amp;uuml;r&amp;uuml;nden alırken, FindByID metodumuz PrimaryKey alanının değeri ne ise, parametreyi o tipten alır. Buda FindByID metodunun,&amp;nbsp; klasik Find metodundanki object t&amp;uuml;r&amp;uuml;nden dolayı, daha performanslı &amp;ccedil;alışmasına neden olur.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk51_12.gif" alt="" width="440" height="39" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 5. FindByID metodunda parametre tipi.&lt;/p&gt;
&lt;p align="justify"&gt;Diğer yandan aynı işi yapan bu metodlar arasındaki fark birden fazla Primary Key alanına sahip olan tablolarda daha &amp;ccedil;ok belirginleşir. S&amp;ouml;z gelimi, Sql sunucusunda yer alan Northwind veri tabanındaki, Order Details tablosunun hem OrderID alanı hemde ProductID alanı Primary Key'dir. Dolayısıyla bu iki alan &amp;uuml;zerinden arama yapmak istediğimizde klasik Find metodunu aşağıdaki haliyle kullanırız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;DataRow drBulunan;
drBulunan = dt.Find(new objcet[]{10756,9);&lt;/pre&gt;
&lt;p align="justify"&gt;Oysaki bu tabloyu T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi &amp;uuml;zerinden kullanırsak kod satırları aşağıdakine d&amp;ouml;n&amp;uuml;ş&amp;uuml;r.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;drBulunan=ds.SiparisDetay.FindByOrderIDProductID(10756,9);&lt;/pre&gt;
&lt;p align="justify"&gt;Gelelim verilerin d&amp;uuml;zenlenmesi işlemine. Şimdi uygulamamızda bulduğumuz satıra ait verileri textBox kontrollerine aktarıldıktan sonra, &amp;uuml;zerlerinde değişiklik yaptığımızda bu değişikliklerin DataTable'ımıza nasıl yansıtacağımıza bakalım. Normal şartlarda, T&amp;uuml;rlendirilmemiş Veri K&amp;uuml;mesi &amp;uuml;zerindeki bir DataTable'a ait herhangibir satırda yapılan değşiklikler i&amp;ccedil;in, g&amp;uuml;ncel DataRow nesnesine ait BeginEdit ve EndEdit metodları kullanılmaktadır. Oysaki T&amp;uuml;rlendirilmiş Veri K&amp;uuml;melerindenki satırlara ait alanlar birer &amp;ouml;zellik olarak tutulduklarından, sadece bu &amp;ouml;zelliklere yeni değerlerini atamamız yeterli olmaktadır. Bu veri k&amp;uuml;mesinin bir sınıf şeklinde tutuluyor olmasının sağlamış olduğu g&amp;uuml;&amp;ccedil;t&amp;uuml;r. Bu nedenle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;meleri Strongly takısını haketmektedir. Dilerseniz uygulamamızda arama sonucu elde ettiğimiz bir satıra ait alan değerlerini g&amp;uuml;ncelleyeceğimiz kod satırlarını yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnDegistir_Click(object sender, System.EventArgs e)
{
     drBulunan.Konu=txtKonu.Text;
     drBulunan.Adres=txtAdres.Text;
     drBulunan.Tarih=Convert.ToDateTime(txtTarih.Text);
}&lt;/pre&gt;
&lt;p align="justify"&gt;Şimdi uygulamamızı &amp;ccedil;alıştıralım. ID değeri 6 olan satırı bulalım. Daha sonra bu satırdaki bazı veileri değiştirelim ve Degistir başlıklı butona tıklayalım. Değişikliklerin hemen ger&amp;ccedil;ekleştiğini ve DataGrid kontrol&amp;uuml;nede yansıdığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk51_13.gif" alt="" width="544" height="352" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 6. ID=6 olan satır bulunuyor.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk51_14.gif" alt="" width="544" height="352" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 7. G&amp;uuml;ncel Satır Verileri Değiştiriliyor.&lt;/p&gt;
&lt;p align="justify"&gt;Son olarak satır silme işlemini inceleyelim. Bu ama&amp;ccedil;la RemoveMakaleRow metodunu kullanacağız. Elbette bu metod, &amp;ouml;rneğimizde oluşturduğumuz Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;memizin sınıfı&amp;nbsp; i&amp;ccedil;inde yeniden yazılmış bir metoddur ve sınıfımız i&amp;ccedil;indeki prototipide şu şekildedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void RemoveMakaleRow(MakaleRow row)
{
     this.Rows.Remove(row);
}&lt;/pre&gt;
&lt;p align="justify"&gt;A&amp;ccedil;ık&amp;ccedil;ası yaptığı işlem sınıfın Rows koleksiyonundan row parameteresi ile gelen satırı &amp;ccedil;ıkartmaktır. Uygulamamızda ise bu metodu aşağıdaki şekilde kullanırız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnSil_Click(object sender, System.EventArgs e)
{
     mk.Makale.RemoveMakaleRow(drBulunan);
}&lt;/pre&gt;
&lt;p align="justify"&gt;Bu metod parametre olarak aldığı satırı tablodan &amp;ccedil;ıkartır.&lt;/p&gt;
&lt;p align="justify"&gt;B&amp;ouml;ylece Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;meleri &amp;uuml;zerinden satır ekleme, arama, d&amp;uuml;zenleme ve silme işlemlerinin nasıl yapılacağını incelemiş olduk. Umuyorumki hepiniz i&amp;ccedil;in faydalı bir makale olmuştur. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-02-05 12:00:00</pubDate>
  <slug>Strongly-Typed-DataSet-2-(Kuvvetle-Turlendirilmis-Veri-Kumeleri)-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>strongly-typed-dataset</tag>
    <tag>datatable</tag>
    <tag>datarow</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>