<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tasarım Desenleri - State</title>
  <description>Bir süre öncesine kadar özel bir bankada uzman yazılım geliştirici olarak görev almaktaydım. Bankada en çok hoşuma giden bazende en çok nefret ettiğim hususlardan biriside otomat makinesi idi...</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f8%2fblg57_vendingMachine.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir s&amp;uuml;re &amp;ouml;ncesine kadar&amp;nbsp;&amp;ouml;zel bir bankada uzman yazılım geliştirici olarak g&amp;ouml;rev almaktaydım. Bankada en &amp;ccedil;ok hoşuma giden bazende en &amp;ccedil;ok nefret ettiğim hususlardan biriside otomat makinesi idi. &lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt;&amp;nbsp;Makineyi severdim &amp;ccedil;&amp;uuml;nk&amp;uuml; fazla mesai yapıldığı hallerde i&amp;ccedil;erisinde son derece işe yarar tuzlu ve tatlı gıdalar olurdu. Makinenin başına ge&amp;ccedil;er, yemek istediğim &amp;uuml;r&amp;uuml;ne bakar karar verdikten sonra ise gerekli miktarı makineye atardım.&lt;/p&gt;
&lt;p&gt;Sonra almak istediğim &amp;uuml;r&amp;uuml;n&amp;uuml;n kodunu tuşlardım. Makine, &amp;uuml;r&amp;uuml;n&amp;uuml; benim i&amp;ccedil;in ilgili yerden aşağıya doğru ittirerek sunardı. Sonrada &amp;uuml;r&amp;uuml;n&amp;uuml; afiyetle yerdim. Ama makinenin şu huyunada &amp;ccedil;ok kızardım. Para &amp;uuml;st&amp;uuml; vermezdi&amp;nbsp;&lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt; Eksiği bazı &amp;uuml;r&amp;uuml;nler ile tamamlardım yada tamamlayamazdım. &amp;Ccedil;&amp;uuml;nk&amp;uuml; eksik kalan kısma verilebilecek bir &amp;uuml;r&amp;uuml;n olmazdı. Yine mesai yaptığım akşamların birisinde makineye gittim, &amp;uuml;r&amp;uuml;ne karar verdim, paraları attım ve makine bip, bap, bup dedikten sonra &amp;ouml;ylece kala kaldım.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;&amp;uuml;nk&amp;uuml; makine s&amp;ouml;z&amp;uuml;m ona &amp;uuml;r&amp;uuml;n&amp;uuml; vermişti. Ancak makinenin alt sepetinde &amp;uuml;r&amp;uuml;n yoktu. Nitekim &amp;uuml;r&amp;uuml;n tam bulunduğu cepten aşağıya doğru d&amp;uuml;şmek &amp;uuml;zereyken oracıkta takılıvermişti. Para gitmişti, nitekim makinin dijital kısmında Teşekk&amp;uuml;rler yazıyordu&amp;nbsp;&lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt; Ben olaya klasik bir insan piskolojisi ile yaklaştım. Makineyi &amp;ouml;ne&amp;nbsp;arkaya itekleyerek &amp;uuml;r&amp;uuml;n&amp;uuml; takıldığı yerden d&amp;uuml;ş&amp;uuml;rtt&amp;uuml;m ve afiyetle yedim. Makineye pis pis bakarken aklıma şunlar geldi.&lt;/p&gt;
&lt;p&gt;Makineye yaklaşırken durağandı. &amp;Ouml;ylece birbirimize bakıyorduk. Sonra paramı attıp &amp;uuml;r&amp;uuml;n&amp;uuml; se&amp;ccedil;tiğimde makine bir dizi kontrol yaptı ve hazırlık moduna ge&amp;ccedil;ti. Ardından &amp;uuml;r&amp;uuml;n&amp;uuml; bana teslim etmek &amp;uuml;zere kendi i&amp;ccedil;erisindeki mekanikleri &amp;ccedil;alıştırdığında &amp;uuml;r&amp;uuml;n&amp;uuml; teslim etme modundaydı. Peki &amp;uuml;r&amp;uuml;n takılıp bana veremediğinde hangi moddaydı da "Teşekk&amp;uuml;rler" diyip, paramı yutup, &amp;uuml;r&amp;uuml;n&amp;uuml; vermemişti&amp;nbsp;&lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt; Her neyse konumuz bu değil tabiki. Ama bu makinenin bu senaryo i&amp;ccedil;erisinde anlattığım t&amp;uuml;m durumları aslında yazılım terminolojisinde &lt;strong&gt;State Machine&lt;/strong&gt; tipinden bir akış ile ifade edilebilmektedir. İşte bu g&amp;uuml;nk&amp;uuml; konumuz &lt;strong&gt;State &lt;/strong&gt;tasarım kalıbı...&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Davranışsal(Behavioral)&lt;/strong&gt; tasarım desenlerinden olan &lt;strong&gt;State&lt;/strong&gt; kalıbı, bir nesnenin &lt;strong&gt;i&amp;ccedil;sel durumunda(Internal State)&lt;/strong&gt; meydana gelecek değişimler sonrası &amp;ccedil;alışma zamanında dinamik olarak &lt;strong&gt;farklı davranışları&lt;/strong&gt; sergileyebilmesini sağlayan bir model sunmaktadır. Aslında &lt;strong&gt;State&lt;/strong&gt; tasarım kalıbını, &lt;strong&gt;Workflow&lt;/strong&gt; terminolojisinde yer alan &lt;strong&gt;State Machine&lt;/strong&gt; kavramının &lt;strong&gt;nesne y&amp;ouml;nelimli(Object Oriented)&lt;/strong&gt; karşılığı olarak d&amp;uuml;ş&amp;uuml;nebiliriz. &amp;Ouml;yleki nesnenin durumunun değişmesi halinde farklı davranışlar sergilemesi, sahip olduğu fonksiyonların tetiklenmesi ve bunlar arasında duruma g&amp;ouml;re gerekli &lt;strong&gt;ge&amp;ccedil;işlerin(Transitions)&lt;/strong&gt; sağlanması anlamına da gelmektedir. Dolayısıyla, &lt;strong&gt;State Machine&lt;/strong&gt; kavramına aşina olanlarımız i&amp;ccedil;in &lt;strong&gt;State&lt;/strong&gt; desenini kavramak son derece kolaydır.&lt;/p&gt;
&lt;p&gt;Farklı bir &amp;ouml;rnek ile devam edelim. Bu ama&amp;ccedil;la bir m&amp;uuml;şterinin sahip olduğu banka hesabının durumlarını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz. Bakiyenin i&amp;ccedil;eriği m&amp;uuml;şterinin para yatırmasına, &amp;ccedil;ekmesine, faiz &amp;ouml;demesine, fon alıp satmasına vb... gibi aksiyonlara g&amp;ouml;re s&amp;uuml;rekli değişiklik g&amp;ouml;sterecektir. Bir başka deyişle hesabın kendi i&amp;ccedil; durumunda bir takım değişiklikler olması s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;Bu değişikliker olduk&amp;ccedil;a hesabın farklı durumları olması&lt;em&gt;(bir başka deyişle m&amp;uuml;şterinin farklı şekillerde değerlendirilmesi)&lt;/em&gt;&amp;nbsp;gerekir. &amp;Ouml;rneğin fazla bor&amp;ccedil;lanma nedeniyle farklı bir hesap durumu olmalıdır. Yada hesabın ilk a&amp;ccedil;ılmasında başlangı&amp;ccedil; durumu tesis edilmeli, standart faiz oranları belirlenmelidir&lt;em&gt;(Aynen otomat makinesinin prize takıldığında &amp;ouml;n hazırlıklar yaptığı sıradaki konumu gibi)&lt;/em&gt;. Hatta m&amp;uuml;şterinin d&amp;uuml;zenli &amp;ouml;demelerinin ona ekstradan bir anlam katması sonucu, hesabının kolay kredi almaya uygun bir duruma ge&amp;ccedil;mesi m&amp;uuml;mk&amp;uuml;n olabilir.&lt;/p&gt;
&lt;p&gt;Yazılım tarafından olaya baktığımızda aslında &lt;strong&gt;State&lt;/strong&gt; diagramları ile ifade edilebilen her nesne i&amp;ccedil;in &lt;strong&gt;State&lt;/strong&gt; deseninin uygulanabileceğini d&amp;uuml;ş&amp;uuml;nebiliriz. &amp;Ouml;rneğin uygulamanın &amp;ccedil;alıştığı makinenin bellek durumları &lt;strong&gt;State&lt;/strong&gt; kalıbına uygun olarak tasarlanabilir. Makinin normal seviyede olması, sistem kaynaklarının &amp;ccedil;ok t&amp;uuml;ketilmesi sonucu alarm haline ge&amp;ccedil;mesi veya alarm verilmeden &amp;ouml;nce uyarı moduna ge&amp;ccedil;mesi s&amp;ouml;z konusu olabilir. Bu durumlar arasındaki ge&amp;ccedil;işler aslında bilgisayarın bazı i&amp;ccedil; değerlerine g&amp;ouml;re ger&amp;ccedil;eklenir. Memory, CPU, Running Process &amp;ouml;l&amp;ccedil;&amp;uuml;mleri birer kriter olabilir ve &amp;ouml;rneğin Computer isimli bir nesnenin i&amp;ccedil; durumunu ifade edebilir.&lt;/p&gt;
&lt;p&gt;Başka bir &amp;ouml;rnek olarak oyun programlarında yer alan bazı senaryoları verebiliriz. S&amp;ouml;z gelimi &lt;strong&gt;RPG&lt;/strong&gt; tipinden bir oyunda yer alan herhangibi kahramanı d&amp;uuml;ş&amp;uuml;nelim. Bu kahramanın duruma g&amp;ouml;re savaşması veya bir takım kontrollerde bulunması gibi davranışları, State deseninden yararlanılarak modellenebilir. &amp;Ouml;yleki, savaş halinde iken kahramanın t&amp;uuml;m g&amp;uuml;c&amp;uuml;yle &amp;ccedil;arpışması, aynı zamanda devriyede olması s&amp;ouml;z konusu iken, barış halinde savaşmaması ama devriyeye devam etmesi durumları s&amp;ouml;z konusudur. Bu durumların nesne y&amp;ouml;nelimli tarafta ifadesinde State kalıbından yararlanılır.&lt;/p&gt;
&lt;p&gt;Aslında t&amp;uuml;m bu &amp;ouml;rneklerde dikkat edilmesi gereken ortak bir notkada vardır. State tasarım kalıbında, durum değişmelerine neden olacak&lt;em&gt;(yani davranışların farklılaşmasına)&lt;/em&gt; bir takım nesne i&amp;ccedil;i değerler vardır. Bunların tamamı aslında davranış değişimi i&amp;ccedil;in takip edilecek i&amp;ccedil;eriği oluşturmaktadır. M&amp;uuml;şteri hesabı &amp;ouml;rneğinde Hesap(Account) asıl i&amp;ccedil;eriği oluşturmaktadır. Bilgisayarın durumlarının ele alındığı &amp;ouml;rnekte makinenin kendisi asıl i&amp;ccedil;eriği oluşturmaktadır. Hımmm... Bu durumda ortaya ş&amp;ouml;yle bir soru &amp;ccedil;ıkmaktadır. İ&amp;ccedil;eriğindeki veri değişimleri eğer bir nesnenin davranışlarını belirliyorsa, bu davranışların n sayıda olması ve i&amp;ccedil;eriği sağlayan tip tarafından kullanılması nasıl sağlanabilir?&lt;/p&gt;
&lt;p&gt;Bundan sonra &lt;strong&gt;internal state'&lt;/strong&gt; i taşıyan nesneye &lt;strong&gt;Context&lt;/strong&gt; dediğimizi d&amp;uuml;ş&amp;uuml;nelim. Birden fazla davranış ve doğal olarak durum olabileceğinden, &lt;strong&gt;Context'&lt;/strong&gt; in farklı durumlara erişebilip aralardaki &lt;strong&gt;ge&amp;ccedil;işleri(Transitions)&lt;/strong&gt; sağlayabilmesi gerekir. Bu durumda, &lt;strong&gt;Context&lt;/strong&gt; tipinin t&amp;uuml;m durumlar i&amp;ccedil;in ortak bir aray&amp;uuml;z sunan başka bir tip ile&lt;em&gt;(buna State diyebiliriz)&lt;/em&gt; &lt;strong&gt;Aggregation&lt;/strong&gt; ilişkisini sağlaması uygundur. &lt;strong&gt;State&lt;/strong&gt; tipinin kendisi aslında, &lt;strong&gt;Context&lt;/strong&gt; tipinin belli bir durumu ile ilişkilendirilmiş davranışların kaps&amp;uuml;llenmesi i&amp;ccedil;in bir aray&amp;uuml;z sunmaktadır. Bu aray&amp;uuml;z sunumu &lt;strong&gt;aslı durum tipleri(Concrete State)&lt;/strong&gt; tarafından değerlendirilebilir. Aslında bu yazdıklarımızdan deseninin sınıf diagramını az &amp;ccedil;ok hayal edebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg57_uml.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;E haydi &amp;ouml;yleyse basit bir &amp;ouml;rnek ile kalıbı kavramaya &amp;ccedil;alışalım. Senaryomuzda yazımızın başında bol bol kulakları &amp;ccedil;ınlayan otomat makinesini ele alıyor olacağız. &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&amp;nbsp;Tabiki amacımız kalıbın nasıl uygulandığını ele almak olduğundan m&amp;uuml;mk&amp;uuml;n olduğunca sade(her zamanki gibi) bir &amp;ouml;rnek geliştireceğiz. Otomat makinesi i&amp;ccedil;in olası durumları şu şekilde d&amp;uuml;ş&amp;uuml;nebiliriz. Makine elektrik şalterinden a&amp;ccedil;ıldığında bazı &amp;ouml;n hazırlıklar yapar. Bu zaman diliminde makine Initialize modundadır&lt;strong&gt;(InitializeState).&lt;/strong&gt; &lt;strong&gt;Initialize&lt;/strong&gt; işlemleri başarılı ise makine bekleme moduna ge&amp;ccedil;er&lt;strong&gt;(WaitingState)&lt;/strong&gt;. Ne bekler? Tabiki bizden bir &amp;uuml;r&amp;uuml;n almamızı&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; M&amp;uuml;şteri bir &amp;uuml;r&amp;uuml;n talep ettiğinde bunu almak i&amp;ccedil;in makineye para atması ve sonrasında se&amp;ccedil;imi bildirmesi gerekir. Bu işlemi &lt;strong&gt;Context&lt;/strong&gt; tipimiz i&amp;ccedil;erisindeki bir metodun &amp;uuml;stlendiğini d&amp;uuml;ş&amp;uuml;nebiliriz. Eğer atılan para yeterli ise &amp;uuml;r&amp;uuml;n&amp;uuml;n hazırlanması moduna ge&amp;ccedil;ilir&lt;strong&gt;(PreparingState)&lt;/strong&gt; ve işlem başarılı bir şekilde tamamlanırsa &amp;uuml;r&amp;uuml;n teslim edilir&lt;strong&gt;(DeliveryState).&lt;/strong&gt; Kısaca &lt;strong&gt;Context&lt;/strong&gt; tipi olarak d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z &lt;strong&gt;VendingMachine&lt;/strong&gt; sınıfı i&amp;ccedil;in d&amp;ouml;rt farklı &lt;strong&gt;durum(State)&lt;/strong&gt; d&amp;uuml;ş&amp;uuml;n&amp;uuml;yoruz. İşte sınıf diagramımız;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg57_classDiagram.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve kodlarımız&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading;

namespace StatePattern
{
&amp;nbsp;&amp;nbsp;&amp;nbsp; // State tipi
&amp;nbsp;&amp;nbsp;&amp;nbsp; // abstract sınıf olabileceği gibi interface şeklinde de tasarlanabilir
&amp;nbsp;&amp;nbsp;&amp;nbsp; abstract class VendingMachineState
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public abstract void HandleState(VendingMachine context);
&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp; // Concrete State tipi
&amp;nbsp;&amp;nbsp;&amp;nbsp; // Otomat start d&amp;uuml;ğmesine basılarak &amp;ccedil;alıştırıldığında &amp;ouml;ncelikli olarak bir &amp;ouml;n hazırlık yapacaktır.
&amp;nbsp;&amp;nbsp;&amp;nbsp; class InitializeState
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; :VendingMachineState
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public InitializeState()
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Console.WriteLine("Initialize...");
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public override void HandleState(VendingMachine context)
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Console.WriteLine("&amp;Ouml;n hazırlıklar yapılıyor");
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Thread.Sleep(2000);&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; 
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Makinenin durumu değiştiriliyor. Makine initialize edilmiş. Bekleme konumuna ge&amp;ccedil;ebilir.
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; context.State=new WaitingState();&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; 
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp; // Concrete State tipi
&amp;nbsp;&amp;nbsp;&amp;nbsp; class PreparingState : VendingMachineState
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public PreparingState()
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Console.WriteLine("Preparing...");
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public override void HandleState(VendingMachine context)
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Console.WriteLine("İstenilen &amp;uuml;r&amp;uuml;n hazırlanıyor. L&amp;uuml;tfen bekleyiniz");
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Makienin durumu değiştiriliyor. &amp;Uuml;r&amp;uuml;n hazırlanması bitmiş. Buna g&amp;ouml;re &amp;uuml;r&amp;uuml;n&amp;uuml; teslim etme durumuna ge&amp;ccedil;iyor.
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; context.State = new DeliveryState();
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp; // Concrete State tipi
&amp;nbsp;&amp;nbsp;&amp;nbsp; class WaitingState 
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; : VendingMachineState
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public WaitingState()
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Console.WriteLine("Waiting...");
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; 
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public override void HandleState(VendingMachine context)
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; int totalProduct=context.ProductList.Sum&amp;lt;Product&amp;gt;(p =&amp;gt; p.Count);

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Console.WriteLine("Makine bekleme konumunda. Şu anda {0} adet &amp;uuml;r&amp;uuml;n var.",totalProduct.ToString());
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Makine bekleme konumundayken&amp;nbsp; aslında bir State değişikliği s&amp;ouml;z konusu değil. Değişimi sağlayacak olan aslında istemcinin vereceği bir aksiyon. Context tipi &amp;uuml;zerindeki RequestProduct metodunun &amp;ccedil;ağırılması bu anlamda d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp; // Concrete State tipi
&amp;nbsp;&amp;nbsp;&amp;nbsp; class DeliveryState 
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; : VendingMachineState
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public DeliveryState()
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Console.WriteLine("Delivering...");
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public override void HandleState(VendingMachine context)
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Console.WriteLine("&amp;Uuml;r&amp;uuml;n teslim ediliyor");
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Makinin durumu değiştiriliyor. &amp;Uuml;r&amp;uuml;n teslim edildikten sonra tekrar bekleme konumuna alınıyor.
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; context.State = new WaitingState();
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp; // Context tipi
&amp;nbsp;&amp;nbsp;&amp;nbsp; class VendingMachine
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public List&amp;lt;Product&amp;gt; ProductList = new List&amp;lt;Product&amp;gt;();
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Context tipi, kendi i&amp;ccedil;erisinde State nesne referanslarını değiştirebilir. Bunun i&amp;ccedil;in State tipinden bir &amp;ouml;zellik sunmaktadır
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; private VendingMachineState _state;

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public VendingMachineState State
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; get { return _state; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; set
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // State değiştiğinde, &amp;uuml;retilen State nesne &amp;ouml;rneğinin &amp;ccedil;alışma zamanındaki referansına ait HandleState metodu &amp;ccedil;alıştırılır. Parametre olarak o anki Context g&amp;ouml;nderilir.
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; _state = value;
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Burada durum değişimleri sonucu &amp;ccedil;alıştırılacak davranışların başlatılma noktasınıda merkezileştirmiş oluyoruz.
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; _state.HandleState(this);
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Context nesnesi &amp;ouml;rneklenirken başlangı&amp;ccedil; durumu belirtilir.
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public VendingMachine()
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Test i&amp;ccedil;in makineye &amp;ouml;rnek &amp;uuml;r&amp;uuml;nler y&amp;uuml;klenir.
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; ProductList.Add(new Product { Name = "&amp;Ccedil;ikolata K", ListPrice = 10,Count=50 });
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; ProductList.Add(new Product { Name = "Biskuvi Bis", ListPrice = 3.45 ,Count=50});
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; ProductList.Add(new Product { Name = "Tuzlu mu tuzlu &amp;ccedil;ıtır", ListPrice = 4.50 ,Count=35});

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Makineye &amp;uuml;r&amp;uuml;nleri y&amp;uuml;kledikten sonra durumunu değiştir
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; State = new InitializeState();
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public void RequestProduct(string productName,double money)
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Console.WriteLine("&amp;Uuml;r&amp;uuml;n siparişi geldi. {0} i&amp;ccedil;in atılan para : {1}",productName,money);
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Product prd = (from p in ProductList
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; where (p.Name == productName &amp;amp;&amp;amp; (money &amp;gt;= p.ListPrice &amp;amp;&amp;amp; p.Count &amp;gt;= 1))
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; select p).SingleOrDefault&amp;lt;Product&amp;gt;();
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; 
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Eğer talep edilen &amp;uuml;r&amp;uuml;n stokta var ve atılan para yeterli ise 
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; if (prd != null)
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; prd.Count--;
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Makinenin durumunu değiştir
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; State = new PreparingState();
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; else
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; State = new WaitingState();
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp; // Yardımcı tip
&amp;nbsp;&amp;nbsp;&amp;nbsp; class Product
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public string Name { get; set; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public double ListPrice { get; set; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public int Count { get; set; }
&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp; // Client
&amp;nbsp;&amp;nbsp;&amp;nbsp; class Program
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; static void Main(string[] args)
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Context tipine ait nesne &amp;ouml;rneği oluşturulur
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; VendingMachine machine = new VendingMachine();

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // İstemci bir &amp;uuml;r&amp;uuml;n ister
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; machine.RequestProduct("&amp;Ccedil;ikolata K",10);
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; 
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; machine.RequestProduct("Bsissi", 12); // Bu &amp;uuml;r&amp;uuml;n olmadığı i&amp;ccedil;in vermeyecektir. Herhangibir aksiyon alınmayacaktır.
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp; }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rneğimizde, &lt;strong&gt;Client&lt;/strong&gt; yani m&amp;uuml;şteri makineyi &amp;ccedil;alıştırarak işe başlıyor. Bir başka deyişle &lt;strong&gt;VendingMachineI(Context)&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneği oluşturuluyor. Bu nesne ayağa kalkarken i&amp;ccedil;erisindeki bir listeye 3 farklı &amp;uuml;r&amp;uuml;nden değişik miktarlarda aktarıyor. Bu noktada &lt;strong&gt;VendingMachine&lt;/strong&gt; nesnesinin durumlarında da değişmeler oluyor. Sonrasında, machine isimli nesne &amp;ouml;rneği &amp;uuml;zerinden &lt;strong&gt;RequestProduct&lt;/strong&gt; metodu &amp;ccedil;ağırılıyor. Yani m&amp;uuml;şteri makineden bir &amp;uuml;r&amp;uuml;n istiyor. Bu sırada, yine makinenin durumları arasında bazı ge&amp;ccedil;işler oluyor. &amp;Ouml;zet olarak makinenin i&amp;ccedil; durumunda yapılan bazı değişikliklere g&amp;ouml;re farklı durumlara ge&amp;ccedil;mesi ve farklı davranışların sergilenmesi sağlanıyor.&lt;/p&gt;
&lt;p&gt;Ben geliştirdiğimiz &amp;ouml;rnekte pek &amp;ccedil;ok durumuda g&amp;ouml;z ardı ettim. &lt;img title="Embarassed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-embarassed.gif" alt="Embarassed" border="0" /&gt;&amp;nbsp;&amp;Ouml;rneğin makinede talep edilen &amp;uuml;r&amp;uuml;n&amp;uuml;n olmaması, atılan paranın yetersiz kalması veya fazla gelmesi yada makinin fişten &amp;ccedil;ekilmesi hali...Bu olaylar ger&amp;ccedil;keştiğindede aslında makinenin farklı durumlara ge&amp;ccedil;mesi ve dolayısıyla &lt;strong&gt;Context&lt;/strong&gt; tipinin farklı davranışlar sergilemesi gerekebilir. Bu kısımları, bir desen uyguladığımız i&amp;ccedil;in sisteme eklememiz aslında son derece basittir. &amp;Ouml;rneğimizi &amp;ccedil;alıştırdığımızda aşağıdakine benzer bir sonu&amp;ccedil; ile karşılaştığımızı g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg57_runing.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabiki yukarıdaki gibi bir deseni uygulamak yerine her şeyi &lt;strong&gt;if&lt;/strong&gt; veya &lt;strong&gt;switch&lt;/strong&gt; gibi kontrol deyimleri ile ele almaya &amp;ccedil;alışabiliriz. Tabi bu durumda hem kodun karmaşıklaşmasına neden olur hemde genişletilebilirliğini zorlaştırmış oluruz. Nitekim şu anda uygulanan desene g&amp;ouml;re, makine i&amp;ccedil;in yeni bir davranış eklemek aslında &lt;strong&gt;State&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;nden t&amp;uuml;r&amp;uuml;yen bir tip ekleyip bunu ilgili yerlerde değerlendirmekten başka bir işlem değildir. Bunu daha iyi anlamak i&amp;ccedil;in aynı &amp;ouml;rneği &lt;strong&gt;if&lt;/strong&gt; ve &lt;strong&gt;switch&lt;/strong&gt; yapıları ile geliştirmeye &amp;ccedil;alışmalısınız.&amp;nbsp;B&amp;ouml;ylece geldik bir tasarım deseninin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f8%2fStatePattern.rar"&gt;StatePattern.rar (26,49 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-08-06 06:00:00</pubDate>
  <slug>Tasarc4b1m-Desenleri-State</slug>
  <tags>
    <tag>design-patterns</tag>
    <tag>oop</tag>
    <tag>c#</tag>
  </tags>
  <categories>
    <category>Tasarım Kalıpları(Design Patterns)</category>
  </categories>
</post>