<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net Temelleri - Etkin Hata Yönetimi (Error Management)</title>
  <description>Uzun süredir Windows Communication Foundation ile ilgili yazılar yayınlıyoruz. Sanıyorumki biraz hava değişimine ihtiyacımız olacak. Bu nedenle bu haftaki yazımızda biraz daha hafif ama önemli olan bir konu üzerinde durmaya çalışacağız...</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Uzun s&amp;uuml;redir Windows Communication Foundation ile ilgili yazılar yayınlıyoruz. Sanıyorumki biraz hava değişimine ihtiyacımız olacak. Bu nedenle bu haftaki yazımızda biraz daha hafif ama &amp;ouml;nemli olan bir konu &amp;uuml;zerinde durmaya &amp;ccedil;alışacağız. Web uygulamalarında sunucu taraflı hata y&amp;ouml;netimi (Server Side State Management). .Net ortamında hataların ele alınmasında kullanılan en bilinen &lt;strong&gt;yol try...catch...finally &lt;/strong&gt;bloklarıdır. Ne varki uygulama ortamları &amp;ccedil;eşitlilik g&amp;ouml;stermektedir.&lt;/p&gt;
&lt;p&gt;Bir sınıf k&amp;uuml;t&amp;uuml;phanesi i&amp;ccedil;erisinde yapılan hata kontrol&amp;uuml; ile dağıtık mimari uygulamaları&lt;strong&gt;(distributed applications)&lt;/strong&gt; i&amp;ccedil;erisinde yapılan hata y&amp;ouml;netimi farklıdır.&lt;em&gt;(&amp;Ouml;rneğin WCF i&amp;ccedil;erisindeki Fault Management konusunu hatırlayalım)&lt;/em&gt; Bu sebepten Asp.Net uygulamalarındada farklı bir yaklaşımı ele almak gerekmektedir. Web uygulamalarında oluşan hatalar sonucu &amp;ccedil;ok hoş olmayan hata ekranları ile karşılaşmak m&amp;uuml;mk&amp;uuml;n olabilmektedir. Ancak hatalar kontroll&amp;uuml; bir şekilde y&amp;ouml;netilebilirlerse, son kullanıcıyı bilgilendirebilecek şekilde mesajlar verilip hataların d&amp;uuml;zeltilmesi y&amp;ouml;n&amp;uuml;nde daha sağlam ve g&amp;uuml;&amp;ccedil;l&amp;uuml; adımlar atılabilir. Bu aynı zamanda uygulamanın tutarlılığı ve g&amp;uuml;venilirliği a&amp;ccedil;ısındanda &amp;ouml;nemlidir.&lt;/p&gt;
&lt;p&gt;Asp.Net ortamı, hataların y&amp;ouml;netimi amacıyla &lt;strong&gt;istisna(Exception) &lt;/strong&gt;tiplerini ve hataları yakalayıcı &lt;strong&gt; olay(event) &lt;/strong&gt;metodların g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alır. S&amp;ouml;z konusu hata y&amp;ouml;netimi &lt;strong&gt; metod seviyesinde(Method Level)&lt;/strong&gt;, &lt;strong&gt;sayfa seviyesinde(Page Level)&lt;/strong&gt; ve &lt;strong&gt;uygulama seviyesinde(Application Level)&lt;/strong&gt; ger&amp;ccedil;ekleştirilebilir. Aşağıdaki tabloda s&amp;ouml;z konusu seviyeler ve aralarındaki temel farklar vurgulanmaya &amp;ccedil;alışılmaktadır.&lt;/p&gt;
&lt;table id="table117" style="border-collapse: collapse; width: 100%;" border="1" cellpadding="5" bgcolor="#336699"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" colspan="3"&gt;&lt;strong&gt; Asp.Net Hata Y&amp;ouml;netim Seviyeleri (Error Management Levels)&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" valign="top" bgcolor="#336699"&gt;&lt;strong&gt; Metod Seviyesinde&lt;/strong&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;" valign="top" bgcolor="#336699"&gt;&lt;strong&gt; Sayfa Seviyesinde&lt;/strong&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;" valign="top" bgcolor="#336699"&gt;&lt;strong&gt; Uygulama Seviyesinde&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;
&lt;ul&gt;
&lt;li&gt;Toparlanabilir veya bir başka deyişle kurtarılabilir hatalar &amp;ccedil;oğunlukla metod seviyesinde ele alınır.&lt;/li&gt;
&lt;li&gt;Eğer olası hatalar toparlanamayacak cinsten ise bir &amp;uuml;st seviyeye y&amp;ouml;nlendirilir.&lt;/li&gt;
&lt;/ul&gt;
&lt;/td&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;
&lt;ul&gt;
&lt;li&gt;Bir sayfa ile ilgili t&amp;uuml;m hataların tek bir merkezden y&amp;ouml;netilebilmesi sağlanır.&lt;/li&gt;
&lt;li&gt;Olası hatalar sonrasında kullanıcılar &amp;ccedil;oğunlukla &amp;ouml;zel sayfalara y&amp;ouml;nlendirilir.&lt;/li&gt;
&lt;li&gt;Bu seviyede sayfaların &lt;strong&gt; Page_Error&lt;/strong&gt; olay metodları ele alınır.&lt;/li&gt;
&lt;li&gt;Hata sayfasına y&amp;ouml;nlendirilmeden &amp;ouml;nce sayfa ile ilgili log bilgisi yazdırma, fiziki dosyalara bilgi atma veya adminlere mail g&amp;ouml;nderme gibi işlemler yapılabilir.&lt;/li&gt;
&lt;/ul&gt;
&lt;/td&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;
&lt;ul&gt;
&lt;li&gt;Uygulama i&amp;ccedil;erisinde herhangibir sayfada meydana gelen hataların yakalanması sağlanır.&lt;/li&gt;
&lt;li&gt;T&amp;uuml;m web uygulamasının hata y&amp;ouml;netiminin tek bir merkezden kontrol edilebilmesi sağlanmış olur.&lt;/li&gt;
&lt;li&gt;Bu seviyede &lt;strong&gt;global.asax&lt;/strong&gt; dosyasındaki &lt;strong&gt;Application_Error&lt;/strong&gt; olay metodu ele alınır.&lt;/li&gt;
&lt;li&gt;Hata sayfasına y&amp;ouml;nlendirilmeden &amp;ouml;nce log bilgisi yazdırma, fiziki dosyalara bilgi atma veya adminlere mail g&amp;ouml;nderme gibi işlemler yapılabilir.&lt;/li&gt;
&lt;/ul&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Metod seviyesinden, uygulama seviyesine doğru &amp;ccedil;ıkıldık&amp;ccedil;a hataların merkezi olarak y&amp;ouml;netilmesi ve tek bir merkezden ele alınması dahada kolaylaşmakta ancak, detay bilgilerinden gittik&amp;ccedil;e uzaklaşılmaktadır. Nitekim bir metod i&amp;ccedil;erisinde meydana gelecek bir hata ile ilişkili yakalanan detayın, sayfa veya uygulama seviyesine aktarılmadığı s&amp;uuml;rece merkezi olarak ayrıştırılması zor olmaktadır.&lt;/p&gt;
&lt;p&gt;Şimdi gelin bu seviyeleri &amp;ouml;rnekler yardımıyla incelemeye &amp;ccedil;alışalım. Metod seviyesinde hata y&amp;ouml;netiminde &lt;strong&gt; try...catch...finally&lt;/strong&gt; blokları b&amp;uuml;y&amp;uuml;k &amp;ouml;nem arz etmektedir. Ancak bu bloklar istenirse try...catch veya try...finally şeklindede yazılabilir. &amp;Ccedil;ok doğal olarak bunladan hangisinin kullanılacağının kararını vermek i&amp;ccedil;in bazı vakkaların g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınması gerekmektedir. İlk olarak basit bir &amp;ouml;rnek ile başlayalım. Bu ama&amp;ccedil;la kullanıcının b&amp;ouml;lme işlemi yaptığı aşağıdaki gibi bir aspx sayfası olduğunu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" %&amp;gt;

&amp;lt;!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"&amp;gt;

&amp;lt;script runat="server"&amp;gt;

    protected void Hesapla_Click(object sender, EventArgs e)
    {
        double deger1 = Convert.ToDouble(txtDeger1.Text);
        double deger2 = Convert.ToDouble(txtDeger2.Text);
        double sonuc = deger1 / deger2;
    }

&amp;lt;/script&amp;gt;

&amp;lt;html xmlns="http://www.w3.org/1999/xhtml" &amp;gt;
    &amp;lt;head runat="server"&amp;gt;
        &amp;lt;title&amp;gt;Hata Yonetimi (Metod Seviyesinde)&amp;lt;/title&amp;gt;
    &amp;lt;/head&amp;gt;
    &amp;lt;body&amp;gt;
        &amp;lt;form id="form1" runat="server"&amp;gt;
            &amp;lt;div&amp;gt;
                Birinci Değer : 
                &amp;lt;asp:TextBox ID="txtDeger1" runat="server"&amp;gt;&amp;lt;/asp:TextBox&amp;gt; &amp;lt;br /&amp;gt;
                İkinci Değer : 
                &amp;lt;asp:TextBox ID="txtDeger2" runat="server"&amp;gt;&amp;lt;/asp:TextBox&amp;gt;
                &amp;lt;br /&amp;gt;
                &amp;lt;asp:Button ID="btnHesapla" runat="server" Text="Hesapla" OnClick="Hesapla_Click" /&amp;gt;
            &amp;lt;/div&amp;gt;
        &amp;lt;/form&amp;gt;
    &amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncelikle hata kontrol&amp;uuml; yapmadan sayfayı ele almaya &amp;ccedil;alışacağız. Bu nedenle &amp;ouml;rnek olarak ikinci kutucuğu boş bırakıp Hesapla isimli d&amp;uuml;ğmeye basıyoruz. Sonu&amp;ccedil; olarak kullanıcı a&amp;ccedil;ısından pekte hoş olmayacak aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşırız. &lt;em&gt;(Elbette geliştirme aşamasında bu mesajlar developer a&amp;ccedil;ısından daha kıymetli olabilir ;)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk214_1.gif" alt="" width="630" height="447" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dolayısıyla try...catch blokları yardımıyla Hesapla_Click isimli olay metoduna ait kodların aşağıdaki hale getirilmesi daha doğru olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void Hesapla_Click(object sender, EventArgs e)
{
    try
    {
        double deger1 = Convert.ToDouble(txtDeger1.Text);
        double deger2 = Convert.ToDouble(txtDeger2.Text);
        double sonuc = deger1 / deger2;
    }
    catch (FormatException err)
    {
        Response.Write("&amp;lt;b&amp;gt;Değerler sayısal olmalıdır. L&amp;uuml;tfen girdiğiniz değerleri kontrol ediniz.&amp;lt;/b&amp;gt;&amp;lt;br/&amp;gt;Detaylı Mesaj : " + err.Message);
    }
    catch (Exception err)
    {
        Response.Write("&amp;lt;b&amp;gt;Beklenmeyen bir hata oluştu.&amp;lt;/b&amp;gt;&amp;lt;br/&amp;gt;Detaylı Mesaj : " + err.Message);
    }
}&lt;/pre&gt;
&lt;p&gt;Bunun sonucunda aynı hata tekrar edilmeye &amp;ccedil;alışılırsa bu sefer mantıklı bir ekran ile karşılaşılacak ve kullanıcı hata ile ilişkili olarak daha doğru bir şekilde bilgilendirilebilecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk214_2.gif" alt="" width="474" height="234" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Elbette metod seviyesinde hata y&amp;ouml;netimi adına dikkat edilmesi gereken bazı vakkalarda vardır. Eğer oluşan hataların kurtarılabilme(toparlanabilme) ihtimali varsa &lt;strong&gt;try...catch&lt;/strong&gt; blokları d&amp;ouml;ng&amp;uuml;ler (while, for gibi) i&amp;ccedil;erisinde ele alınabilir. B&amp;ouml;ylece tekrar sayısına g&amp;ouml;re istenen rutin bir ka&amp;ccedil; kez &amp;uuml;st &amp;uuml;ste denenebilir. Diğer taraftan oluşan istisnalar ile ilişikili olarak ekstradan verilebilecek yada kullanılabilecek bilgiler varsa bunların bir &amp;uuml;st seviyede (&lt;strong&gt;sayfa seviyesinde-page level&lt;/strong&gt;) ele alınması i&amp;ccedil;in &lt;strong&gt; catch&lt;/strong&gt; bloğu i&amp;ccedil;erisinde &lt;strong&gt;throw&lt;/strong&gt; anahtar kelimesine başvurulabilir. Burada &amp;ouml;zellikle &lt;strong&gt;Exception&lt;/strong&gt; sınıfının aşırı y&amp;uuml;klenmiş&lt;strong&gt;(overload)&lt;/strong&gt; yapıcı&lt;strong&gt;(constructor)&lt;/strong&gt; metodlarından faydalanılmaktadır.&lt;/p&gt;
&lt;p&gt;Diğer bir vakka metod i&amp;ccedil;inde kullanılan dış kaynakları ele alır. &amp;Ouml;rneğin ilgili rutinler i&amp;ccedil;erisinde kaynak temizlenmesi gerekiyorsa &lt;em&gt;(bağlantıların veya dosyaların kapatılması, y&amp;ouml;netimsiz-unmanaged nesnelerin serbest bırakılması gibi) &lt;/em&gt;&lt;strong&gt;finally&lt;/strong&gt; bloklarını kullanmak doğru olacaktır. Burada finally bloklarının kullanılması şart değildir. Nitekim &lt;strong&gt;using&lt;/strong&gt; blokları yardımıylada, &lt;strong&gt;IDisposable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulayan tipler i&amp;ccedil;in blok sonunda &lt;strong&gt; Dispose&lt;/strong&gt; &amp;ccedil;ağrıları ger&amp;ccedil;ekleştirilebilir. Son olarak olası hatalar ilgili metod i&amp;ccedil;erisinde ele alınamıyorsa metodu &amp;ccedil;ağıran yerde yakalanmalıdır.&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere vakkaların sayısı ve metod i&amp;ccedil;erisindeki hata y&amp;ouml;netimi &amp;ccedil;eşitli şekillerde yapılabilmektedir. Bu sebepten karar verirken aşağıdaki gibi tablodan faydalanmakta yarar vardır.&lt;/p&gt;
&lt;table id="table119" style="border-collapse: collapse; width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#336699"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;"&gt;&lt;strong&gt;&amp;Ouml;neri&lt;/strong&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;"&gt;&lt;strong&gt;Kaynak temizlemesi gerekiyor mu?&lt;/strong&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;"&gt;&lt;strong&gt;Olası hata var mı?&lt;/strong&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;"&gt;&lt;strong&gt;Olası hatalar kurtarılabilir mi?&lt;/strong&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;"&gt;&lt;strong&gt;Eklenecek ilave hata bilgisi var mı?&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td rowspan="2" bgcolor="#ffffff"&gt;&lt;strong&gt; Hi&amp;ccedil; bir kontrole gerek yok&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;hayır&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;yok&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;hayır&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;yok&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff"&gt;hayır&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;var&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;hayır&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;yok&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td rowspan="2" bgcolor="#ffffff"&gt;&lt;strong&gt; try...finally&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;evet&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;yok&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;hayır&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;yok&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff"&gt;evet&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;var&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;hayır&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;yok&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff"&gt;&lt;strong&gt; try...catch&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;hayır&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;var&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;hayır&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;var&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff"&gt;&lt;strong&gt; try...catch...finally&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;evet&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;evet&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;hayır&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;var&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&amp;Ouml;rneğin kaynak temizlenmesi gerekiyorsa, olası hatalar var ise ve hatta olası hatalara eklenebilecek ekstra bilgiler var ise &lt;strong&gt;try..catch...finally&lt;/strong&gt; bloklarını kullanmak daha mantıklıdır. Ne varki olası hatalarda, hata mesajına ilave bilgiler eklemek catch blokları i&amp;ccedil;erisinde &lt;strong&gt;throw&lt;/strong&gt; kullanmak ile m&amp;uuml;mk&amp;uuml;n olabilir. &amp;Ccedil;&amp;uuml;nk&amp;uuml; ama&amp;ccedil;, bu hatayı ele alan bir &amp;uuml;st seviyeye bilgi g&amp;ouml;ndermektir. Bunun ele alınabileceği en g&amp;uuml;zel yer sayfa seviyesidir &lt;strong&gt; (Page Level)&lt;/strong&gt;. &amp;Ouml;yleyse sayfa seviyesinde hata y&amp;ouml;netiminin nasıl yapılacağını inceleyerek devam edelim.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle belirli bir sayfada meydana gelebilecek t&amp;uuml;m hataların tek bir merkezden kontrol&amp;uuml;n&amp;uuml;n sağlanması gerektiği durumlarda sayfa seviyesinde hata y&amp;ouml;netimi ger&amp;ccedil;ekleştirilebilir. Bu teknikte &amp;ouml;nemli olan nokta, &lt;strong&gt;Page_Error&lt;/strong&gt; olay metodunun etkin bir şekilde kullanılmasıdır. Aslında sayfa seviyesinde hatalar ele alınırken izlenen basit bir yol vardır. Aşağıdaki tabloda bu yol g&amp;ouml;sterilmektedir.&lt;/p&gt;
&lt;table id="table120" style="border-collapse: collapse; width: 100%;" border="1" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" colspan="2" bgcolor="#336699"&gt;&lt;strong&gt; Sayfa Seviyesinde Hata Kontrol&amp;uuml; i&amp;ccedil;in Tavsiye Edilen Yol&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="76"&gt;&lt;strong&gt;Madde 0&lt;/strong&gt;&lt;/td&gt;
&lt;td width="87%"&gt;Bir hata sayfası tasarlanır. :)&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="76"&gt;&lt;strong&gt;Madde 1&lt;/strong&gt;&lt;/td&gt;
&lt;td width="87%"&gt;Sayfaya &lt;strong&gt; Page_Error&lt;/strong&gt; olay metodu eklenir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="76"&gt;&lt;strong&gt;Madde 2&lt;/strong&gt;&lt;/td&gt;
&lt;td width="87%"&gt;Sayfanın &lt;strong&gt; ErrorPage&lt;/strong&gt; &amp;ouml;zelliğine hata sayfasının &lt;strong&gt;Url&lt;/strong&gt; bilgisi &lt;strong&gt; Page&lt;/strong&gt; direktifi i&amp;ccedil;erisinde eklenir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="76"&gt;&lt;strong&gt;Madde 3&lt;/strong&gt;&lt;/td&gt;
&lt;td width="87%"&gt;&lt;strong&gt;Page_Error&lt;/strong&gt; olay metodu i&amp;ccedil;erisinde &lt;strong&gt;Server&lt;/strong&gt; sınıfının static &lt;strong&gt; GetLastError()&lt;/strong&gt; metodu ile son oluşan istisna nesne &amp;ouml;rneği ele alınır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="76"&gt;&lt;strong&gt;Madde 4&lt;/strong&gt;&lt;/td&gt;
&lt;td width="87%"&gt;İstenirse &lt;strong&gt; ErrorPage&lt;/strong&gt; &amp;ouml;zelliğine burada değer ve hatta &lt;strong&gt;querystring&lt;/strong&gt; yardımıyla bilgi aktarılması sağlanabilir. B&amp;ouml;ylece hata sayfasına bazı ekstra bilgilerin taşınmasıda sağlanmış olur.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="76"&gt;&lt;strong&gt;Madde 4.5&lt;/strong&gt;&lt;/td&gt;
&lt;td width="87%"&gt;Gerekirse bu aşamada loglama (&amp;ouml;zellikle sistemdeki event loglara bilgi yazma), fiziki dosyalara bilgi yazdırma, y&amp;ouml;netici veya ilgili kişilere mail g&amp;ouml;nderme gibi işlemler yapılabilir.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Page_Error isimli olay metodu sayfa seviyesinde ele alınır. Normal şartlarda sayfada ele alınmayan bir hata oluştuğunda bu metod otomatik olarak &amp;ccedil;ağırılacaktır. Biz bu metod i&amp;ccedil;erisinde y&amp;ouml;nlendirmeler yaparak kullanıcıları daha akıllı hata bilgilendirme sayfalarına y&amp;ouml;nlendirebilir ve loglama gibi işlemleri ger&amp;ccedil;ekleştirebiliriz. &lt;strong&gt;Page_Error&lt;/strong&gt; olay metodu i&amp;ccedil;erisinden ilgili hata sayfasına y&amp;ouml;nlendirme yaparken Page sınıfının ErrorPage &amp;ouml;zelliğine değer atamak gerekebilir. Bu daha &amp;ccedil;ok &lt;strong&gt;querystring&lt;/strong&gt; yardımıyla hata sayfasına ekstra bilgi g&amp;ouml;nderileceği durumlarda ele alınır. Aksi durumlarda metod i&amp;ccedil;erisinde değilde Page direktifinde bu &amp;ouml;zelliğin değerinin belirlenmesi yeterlidir. Ancak burada dikkat edilmesi gereken bir nokta vardır. Eğer metod i&amp;ccedil;erisinde ErrorPage &amp;ouml;zelliğine hata sayfasını atarken querystring kullanılmassa Asp.Net, &amp;ccedil;alışma zamanında &lt;strong&gt;aspxerrorpath&lt;/strong&gt; isimli bir anahtarı ve değerini otomatik olarak ekleyecektir. Ki buda hatanın oluştuğu sayfanın yakalanabilmesi ve belkide dinamik bir linkin &amp;uuml;retilerek tekrar geri gidilebilmesinide sağlayacaktır.&lt;/p&gt;
&lt;p&gt;Şimdi yukarıdaki &amp;ouml;rneğimizi sayfa seviyesinde ele almaya &amp;ccedil;alışalım. Madde 0' da değindiğimiz gibi &amp;ouml;ncelikli olarak bir hata sayfası tasarlamakta fayda var. Bu hata sayfası aşağıdaki gibi tasarlanabilir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;HataSayfasi.aspx;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" %&amp;gt;

&amp;lt;!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"&amp;gt;

&amp;lt;script runat="server"&amp;gt;

    protected void Page_Load(object sender, EventArgs e)
    {
        string ekBilgi = Request.QueryString["EkBilgi"];
        string sayfa=Request.QueryString["Sayfa"];
        string hataMesaji = Request.QueryString["HataMesaji"];
        Response.Write("&amp;lt;b&amp;gt;Hata sayfası : &amp;lt;/b&amp;gt;" + sayfa+"&amp;lt;br/&amp;gt;");
        Response.Write("&amp;lt;b&amp;gt;Ek bilgi : &amp;lt;/b&amp;gt;" + ekBilgi + "&amp;lt;br/&amp;gt;");
        Response.Write("&amp;lt;b&amp;gt;Hata Mesajı : &amp;lt;/b&amp;gt;" + hataMesaji);
    } 

&amp;lt;/script&amp;gt;

&amp;lt;html xmlns="http://www.w3.org/1999/xhtml" &amp;gt;
    &amp;lt;head runat="server"&amp;gt;
        &amp;lt;title&amp;gt;Hata Sayfası&amp;lt;/title&amp;gt;
    &amp;lt;/head&amp;gt;
    &amp;lt;body&amp;gt;
        &amp;lt;form id="form1" runat="server"&amp;gt;
            &amp;lt;div&amp;gt;
            &amp;lt;/div&amp;gt;
        &amp;lt;/form&amp;gt;
    &amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Default.aspx&lt;/strong&gt; sayfasındaki kodları ise aşağıdaki gibi değiştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void Page_Error(object sender, EventArgs e)
{
    Exception olusanHata = Server.GetLastError();
    ErrorPage = "HataSayfasi.aspx?EkBilgi=" + olusanHata.Message + "&amp;amp;HataMesaji=" + olusanHata.InnerException.Message + "&amp;amp;Sayfa="+Page.AppRelativeVirtualPath;
}

protected void Hesapla_Click(object sender, EventArgs e)
{
    try
    {
        double deger1 = Convert.ToDouble(txtDeger1.Text);
        double deger2 = Convert.ToDouble(txtDeger2.Text);
        double sonuc = deger1 / deger2;
    }
    catch (Exception excp)
    {
        throw new Exception("Sayısal değer girişinde hata oluştu", excp);
    }
}&lt;/pre&gt;
&lt;p&gt;Hesapla_Click olay metodu i&amp;ccedil;erisinde yer alan &lt;strong&gt;catch&lt;/strong&gt; bloğunda &lt;strong&gt;throw&lt;/strong&gt; anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; kullanılarak bir &lt;strong&gt;Exception&lt;/strong&gt; nesnesi daha fırlatılmıştır. Bu istisna nesnesinin yakalanacağı yer sayfanın &lt;strong&gt;Page_Error&lt;/strong&gt; isimli olay metodudur. Bu metod i&amp;ccedil;erisinde, sayfada oluşan son hatayı yakalayabilmek i&amp;ccedil;in &lt;strong&gt; Server&lt;/strong&gt; sınıfının &lt;strong&gt;GetLastError&lt;/strong&gt; metodu kullanılmıştır. Dikkat edilmesi gereken noktalardan birisi, throw ile fırlatılan Exception nesnesi &amp;ouml;rneklenirken ilk parametreye &amp;ouml;rnek bir ekstra veri konulmasıdır. Eklenen bu bilgi GetLastError ile yakalanan &lt;strong&gt;Exception&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt;Message&lt;/strong&gt; &amp;ouml;zelliği ile elde edilebilir. Bu durumda orjinal istisna mesajınının nereden alınabileceği bir soru işaretidir. Cevap &lt;strong&gt;InnerException&lt;/strong&gt; &amp;ouml;zelliğidir. InnerException &amp;ouml;zelliği ile fırlatılan asıl Exception nesne &amp;ouml;rneği yakalanabilir. Bunu &amp;ccedil;alışma zamanında test ettiğimizde aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi &lt;strong&gt; FormatException&lt;/strong&gt; tipinin &lt;strong&gt;InnerException&lt;/strong&gt; &amp;ouml;zelliğinde saklandığını g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk214_3.gif" alt="" width="462" height="252" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Son olarak &lt;strong&gt;ErrorPage&lt;/strong&gt; &amp;ouml;zelliği ile hata sayfasına gerekli y&amp;ouml;nlendirme yapılmaktadır. Elbette ErrorPage kullanılmak zorunda değildir. Bunun yerine &lt;strong&gt;Server&lt;/strong&gt; sınıfının &lt;strong&gt; Transfer&lt;/strong&gt; metodu veya &lt;strong&gt;Response&lt;/strong&gt; sınıfının &lt;strong&gt;Redirect&lt;/strong&gt; metodlarının kullanımıda tercih edilebilir. &amp;Ouml;zellikle Server sınıfının Transfer metodu gereksiz roundtrip' lerin &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ilmesini sağlamakta ama url satırına bakıldığında halen daha aynı sayfada olunduğu izlenimini vermektedir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek geliştirilirken dikkat edilmesi gereken bir nokta vardır. Eğer &amp;ouml;rneği aynı makine &amp;uuml;zerinde &lt;strong&gt; (localhost) &lt;/strong&gt;test ediyorsak beklediğimiz y&amp;ouml;nlendirme sayfasına gidemediğimizi hatta eski sarı ekranın &lt;em&gt;(orjinal hata mesajının basıldığı sayfadan bahsediyoruz)&lt;/em&gt; &amp;uuml;retildiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bunun nedeni web uygulamasının &amp;ouml;zel hata modunun aktif olmayışıdır. Bir başka deyişle &lt;strong&gt;web.config&lt;/strong&gt; dosyasında yer alan &lt;strong&gt;customErrors&lt;/strong&gt; elementinin mode niteliğine &lt;strong&gt;On&lt;/strong&gt; değerinin verilmesi gerekir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Aslında mode &amp;ouml;zelliğinin 3 farklı değeri vardır. &lt;strong&gt;RemoteOnly&lt;/strong&gt;, &lt;strong&gt;On&lt;/strong&gt; ve &lt;strong&gt;Off&lt;/strong&gt;. RemoteOnly modu aktif iken &amp;ouml;zel hata sayfalarını sadece istemciler g&amp;ouml;rebilir. On modunda hem istemciler hemde localhost kullanıcısı &amp;ouml;zel hata sayfalarını g&amp;ouml;rebilir. Biz &amp;ouml;rneklerimizdeki sayfalarımızı aynı makine &amp;uuml;zerinden test ettiğimiz i&amp;ccedil;in bu modu &lt;strong&gt;On&lt;/strong&gt; olarak belirledik. Ger&amp;ccedil;ek bir uygulama ortamına &amp;ccedil;ıkıldığında On yerine RemoteOnly kullanılması tavsiye edilir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;customErrors mode="On"/&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;customErrors&lt;/strong&gt; elementi i&amp;ccedil;erisine &lt;strong&gt;error&lt;/strong&gt; isimli alt elementlerde konulabilir. Bu element sayesinde sunucu seviyesinde meydana gelen hatalar var ise bunların sonucunda &amp;ouml;zel hata sayfalarına y&amp;ouml;nlendirmeler yapılabilir. S&amp;ouml;z gelimi aşağıdaki bildirimleri ele alalım.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;customErrors mode="On"&amp;gt;
    &amp;lt;error statusCode="404" redirect="SayfaYok.aspx"/&amp;gt;
&amp;lt;/customErrors&amp;gt;&lt;/pre&gt;
&lt;p&gt;Buna g&amp;ouml;re sitede olmayan bir sayfa talep edilirse kullanıcılar SayfaYok.aspx' e y&amp;ouml;nlendirilirer.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Yanlız burada dikkat edilmesi gereken bir nokta vardır. Sonradan ele alacağımız gibi &lt;strong&gt;global.asax&lt;/strong&gt; dosyasındaki &lt;strong&gt;Application_Error&lt;/strong&gt; olayı yazılmışsa, uygulama SayfaYok.aspx' e y&amp;ouml;nlendirilmeden &amp;ouml;nce buradaki olay metoduna uğrayacaktır ki burada bir y&amp;ouml;nlendirme yapıyorsak SayfaYok.aspx yerine oraya gidilebilir. Hatta Server.ClearError metodu kullanılmışsa hata sayfasına gidilmeyedebilir. Buda sistemin istediğimiz şekilde &amp;ccedil;alışmaması anlamına gelmektedir. Ger&amp;ccedil;i Application_Error i&amp;ccedil;erisinde oluşan hata &amp;ouml;rneğin sayfa yok hatası yinede yakalanabilir. &amp;Ouml;rneğin Debug modda bu aşağıdaki şekilde olduğu giri g&amp;ouml;r&amp;uuml;necektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk214_12.gif" alt="" width="515" height="210" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dolayısıyla bu noktalara dikkat etmekte fayda vardır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;Ouml;rneğin şu aşamada iken web uygulamasını &amp;ccedil;alıştırdıkdan sonra Giris.aspx isimli yazmadığımız bir sayfayı talep edersek aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşırır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk214_11.gif" alt="" width="538" height="79" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle SayfaYok.aspx' ten sonra gelen querystring parametresine dikkat edelim. &lt;strong&gt;aspxerrorpath&lt;/strong&gt; ile gelen değer alınıp kullanıcıya daha anlamlı bir hata sayfası g&amp;ouml;sterilebilir. Biz tekrardan konumuza geri d&amp;ouml;nelim ve &lt;strong&gt;customErrors&lt;/strong&gt; elementini aşağıdaki haliyle bırakalım.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;customErrors mode="On"/&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu değişiklikten sonra uygulama &amp;ccedil;alışma zamanında test edilirse default.aspx sayfasında hata oluştuktan sonra HataSayfasi.aspx' e gidildiği g&amp;ouml;r&amp;uuml;lebilir. Tarayıcı penceresindeki url satırına dikkat edilecek olursa querystring parametreleri ve değerleride başarılı bir şekilde aktarılmıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk214_4.gif" alt="" width="457" height="161" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şunu itiraf etmeliyim ki sarı ekranın g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; buradakinden daha g&amp;uuml;zeldir. Dolayısıyla hata sayfaları hazırlanırken biraz daha &amp;ouml;zenilmeli, gerektiğinde projenin sahibi olan şirket standartlarına uygun olaraktan tasarlanmalı ve zengin bir bilgi sunacak hale getirilmelidir.&lt;/p&gt;
&lt;p&gt;Oluşan hatalara ilişkin kullanıcılara bilgi verilmesi dışında, siteyi tasarlayan veya y&amp;ouml;netenlerinde bilgilendirilmesi gerekebilir. Bu bilgilendirme farklı şekillerde yapılabilir. &amp;Ouml;rneğin var olan işletim sistemi loglarına bilgi yazılabilir. &amp;Ouml;rneğin Application loglarına. Ya da daha basit olarak fiziki bir dosyaya hatalar ile ilişkili bazı bilgiler g&amp;ouml;nderilebilir. Hatta gerektiği yerlerde &amp;ccedil;ok kritik hatalar s&amp;ouml;z konusu ise ilgili kişilere mail bile g&amp;ouml;nderilebilir. S&amp;ouml;z gelimi aşağıdaki kod par&amp;ccedil;ası ile &lt;strong&gt;Page_Error&lt;/strong&gt; metodu i&amp;ccedil;erisinde, oluşan son hataya ait bilgi fiziki bir dosyaya eklenmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void Page_Error(object sender, EventArgs e)
{
    Exception olusanHata = Server.GetLastError();
    ErrorPage = "HataSayfasi.aspx?EkBilgi=" + olusanHata.Message + "&amp;amp;HataMesaji=" + olusanHata.InnerException.Message + "&amp;amp;Sayfa="+Page.AppRelativeVirtualPath;

    using (FileStream stream = new FileStream("C:\\HataLogDosyasi.txt", FileMode.Append, FileAccess.Write))
    {
        StreamWriter writer = new StreamWriter(stream);
        writer.WriteLine("Hata Zamanı " + DateTime.Now.ToString() + " Hata Sayfası " + Page.AppRelativeVirtualPath + " Hata Mesajı " + olusanHata.InnerException.Message);
        writer.Close();
    }
}&lt;/pre&gt;
&lt;p&gt;Burada basit olarak &lt;strong&gt;FileStream&lt;/strong&gt; ve &lt;strong&gt;StreamWriter&lt;/strong&gt; tiplerinden yararlanılarak hata bilgileri C: klas&amp;ouml;r&amp;uuml; altındaki bir text dosyasına yazdırılmaktadır. Sonu&amp;ccedil; olarak uygulama test edildiğinden oluşturulan hata sonrasında ilgili dosyaya aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi bazı bilgiler eklenecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk214_5.gif" alt="" width="565" height="246" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Page_Error&lt;/strong&gt; metodu i&amp;ccedil;erisinde hata sayfasına herhangibir şekilde y&amp;ouml;nlendirme yapılmamasına rağmen gidilmektedir. Bu metodun bir &amp;ouml;zelliğidir. Metod sonuna gelindiğinde, &lt;strong&gt; ErrorPage&lt;/strong&gt; ile belirlenmiş sayfaya otomatik olarak gidilir. ErrorPage değerinin programatik olarak belirlenmesi haricinde &lt;strong&gt;Page&lt;/strong&gt; direktifi i&amp;ccedil;erisinde ayarlanabileceğini daha &amp;ouml;nceden s&amp;ouml;ylemiştik. Bu aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi d&amp;uuml;zenlenebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk214_6.gif" alt="" width="399" height="169" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Elbette metod i&amp;ccedil;erisinde ErrorPage &amp;ouml;zelliği belirtilmişse &lt;strong&gt;Page&lt;/strong&gt; direktifinde yapılan tanımlama ge&amp;ccedil;ersiz sayılacaktır.&lt;/p&gt;
&lt;p&gt;Gelelim uygulama seviyesinde hata y&amp;ouml;netimine. Bu durumda web uygulamasında meydana gelecek hataların ele alınabileceği bir merkez s&amp;ouml;z konusudur. S&amp;ouml;z konusu merkez global.asax dosyası i&amp;ccedil;erisinde yer alan &lt;strong&gt;Application_Error&lt;/strong&gt; isimli olay metodudur. Bildiğiniz gibi &lt;strong&gt;global.asax &lt;/strong&gt;dosyasında, uygulama genelini ilgilendiren bazı olay metodları yer almaktadır. &amp;Ouml;rneğin uygulama &amp;ccedil;alışmaya başladığında devreye giren &lt;strong&gt;Application_Start&lt;/strong&gt;, sonlandığında &amp;ccedil;ağrılan &lt;strong&gt;Application_End&lt;/strong&gt; yada kullanıcıların a&amp;ccedil;tıkları &lt;strong&gt;oturumlarda(Session) &lt;/strong&gt;devreye giren &lt;strong&gt;Session_Start&lt;/strong&gt; gibi. Dolayısıyla ilk yapılması gereken işlem web sitesine, eğer yok ise bir global.asax dosyası eklemek olacaktır. Sayfa seviyesindeki hata y&amp;ouml;netiminde olduğu gibi, uygulama seviyesinde yapılacak hata y&amp;ouml;netimi i&amp;ccedil;inde tavsiye edilen bir yol haritası vardır ve aşağıdaki tabloda olduğu gibidir.&lt;/p&gt;
&lt;table id="table125" style="border-collapse: collapse; width: 100%;" border="1" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" colspan="2" bgcolor="#336699"&gt;&lt;strong&gt; Uygulama Seviyesinde Hata Kontrol&amp;uuml; i&amp;ccedil;in Tavsiye Edilen Yol&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="76"&gt;&lt;strong&gt;Madde 0&lt;/strong&gt;&lt;/td&gt;
&lt;td width="87%"&gt;Bir hata sayfası tasarlanır. :)&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="76"&gt;&lt;strong&gt;Madde 1&lt;/strong&gt;&lt;/td&gt;
&lt;td width="87%"&gt;Sayfalara &lt;strong&gt; Page_Error&lt;/strong&gt; olay metodları eklenir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="76"&gt;&lt;strong&gt;Madde 2&lt;/strong&gt;&lt;/td&gt;
&lt;td width="87%"&gt;&lt;strong&gt;Page_Error&lt;/strong&gt; olay metodlarında, son olarak elde edilen &lt;strong&gt;istisna(Exception)&lt;/strong&gt; nesnesinin referansı aynen metod i&amp;ccedil;erisinde olduğu gibi bilin&amp;ccedil;li olarak ortama &lt;strong&gt;fırlatılır(throw)&lt;/strong&gt;.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="76"&gt;&lt;strong&gt;Madde 3&lt;/strong&gt;&lt;/td&gt;
&lt;td width="87%"&gt;global.asax dosyasında yer alan &lt;strong&gt;Application_Error&lt;/strong&gt; olay metodu kodlanır. Bu metod i&amp;ccedil;erisinde son hata bilgisi yine &lt;strong&gt; GetLastError&lt;/strong&gt; metodu ile alınır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="76"&gt;&lt;strong&gt;Madde 3.5&lt;/strong&gt;&lt;/td&gt;
&lt;td width="87%"&gt;Gerekirse bu aşamada loglama (&amp;ouml;zellikle sistemdeki event loglara bilgi yazma), fiziki dosyalara bilgi yazdırma, y&amp;ouml;netici veya ilgili kişilere mail g&amp;ouml;nderme gibi işlemler yapılabilir. &lt;em&gt;(Sistem loglarına yazma sırasında dikkat edilmesi gereken durumlardan birisi &lt;strong&gt;ASPNET(IIS 5.0 i&amp;ccedil;in)&lt;/strong&gt; veya &lt;strong&gt;Network Service (IIS 6.0 i&amp;ccedil;in)&lt;/strong&gt; kullanıcısının &lt;strong&gt;Application&lt;/strong&gt;, &lt;strong&gt;System&lt;/strong&gt; ve &lt;strong&gt;Security&lt;/strong&gt; loglarına yazma hakkı olup olmadığıdır. S&amp;ouml;z gelimi &lt;strong&gt;ASPNET&lt;/strong&gt; kullanıcısının varsayılan olarak &lt;strong&gt;Application&lt;/strong&gt; loglarına yazma hakkı varken System ve Security loglarına yazma hakkı yoktur. Bu nedenle ilgili kullanıcıların haklarının &amp;ouml;zellikle loglara yazma işlemleri sırasında dikkate alınması gerekebilir.)&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="76"&gt;&lt;strong&gt;Madde 4&lt;/strong&gt;&lt;/td&gt;
&lt;td width="87%"&gt;Kullanıcı hata sayfasına y&amp;ouml;nlendirilmeden &amp;ouml;nce &lt;strong&gt;Server&lt;/strong&gt; sınıfının &lt;strong&gt; ClearError&lt;/strong&gt; metodunun &amp;ccedil;ağırılması ve hataların temizlenmesi &amp;ouml;nerilir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="76"&gt;&lt;strong&gt;Madde 5&lt;/strong&gt;&lt;/td&gt;
&lt;td width="87%"&gt;&lt;strong&gt;Server.Transfer &lt;/strong&gt;metodu ile hata sayfasına y&amp;ouml;nlendirme yapılır.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Buradaki maddelerde dikkat &amp;ccedil;ekici noktalardan biriside son hatanın sayfalara ait Page_Error olay metodları i&amp;ccedil;erisinde tekrardan fırlatılıyor olmasıdır. Bu bir anlamda hatanın bir &amp;uuml;st seviyeye aktarılmasıdır. Diğer taraftan bir gerekliliktir. Nitekim, hata bilin&amp;ccedil;li olarak uygulama seviyesine g&amp;ouml;nderilmesse Asp.Net &amp;ccedil;alışma ortamı&lt;strong&gt;(Asp.Net RunTime)&lt;/strong&gt;, hatanın ele alınması i&amp;ccedil;in &lt;strong&gt; HttpUnhandledException&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneği &amp;uuml;retecektir. Biz hatayı kontroll&amp;uuml; bir şekilde ele almak istiyorsak bilin&amp;ccedil;li bir şekilde fırlatma işlemini &amp;uuml;stlenmeliyiz.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak web uygulaması i&amp;ccedil;erisinde birden fazla aspx sayfası olduğu d&amp;uuml;ş&amp;uuml;n&amp;uuml;lecek olursa, hepsine bir &lt;strong&gt;Page_Error&lt;/strong&gt; metodu eklemek ve kodlamak (en azından &lt;strong&gt; GetLastError&lt;/strong&gt; ile elde edilen istisna nesnelerini fırlatmak) uğraştırıcı ve sabrımızı test edici olabilir. Burada nesne y&amp;ouml;nelimli mimarinin avantajlarından faydalanmak &amp;ccedil;ok daha akılcı bir &amp;ccedil;&amp;ouml;z&amp;uuml;m olacaktır. Bir başka deyişle t&amp;uuml;m sayfaların t&amp;uuml;rediği bir taban sayfa (base page) i&amp;ccedil;erisindeki Page_Error metodu ele alınabilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Alternatif bir yaklaşım olarak MasterPage kullanımı d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Her ne kadar MasterPage i&amp;ccedil;erisine Page_Error isimli bir metod yazılabiliyor olsada, aslında metod seviyesinden throw ile exception fırlatıldığında bu metod herhangibir şekilde tetiklenmez. Eğer Application_Error olay metodu yazılmışsa doğrudan buraya d&amp;uuml;ş&amp;uuml;l&amp;uuml;r ve &lt;strong&gt;HttpUnhandledException&lt;/strong&gt; tipinden bir istisna nesnesi yakalanır. Bu sebepten bu tip bir durumda MasterPage i&amp;ccedil;erisindeki Page_Error olay metodunun kullanımı şeklinde bir &amp;ccedil;&amp;ouml;z&amp;uuml;m ne yazıkki s&amp;ouml;z konusu değildir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;İlk olarak Application_Error olay metodunu nasıl ele alacağımıza bakalım. &amp;Ouml;ncelikle aspx sayfalarındaki &lt;strong&gt; Page_Error&lt;/strong&gt; olay metodlarından yine bir &amp;uuml;st seviyeye hata fırlatmak gerekir. Bu nedenle &amp;ouml;rnek olarak default.aspx sayfasındaki &lt;strong&gt;Page_Error&lt;/strong&gt; olay metodu aşağıdaki gibi değiştirilmelidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void Page_Error(object sender, EventArgs e)
{
    Exception olusanHata = Server.GetLastError();
    throw olusanHata;
}&lt;/pre&gt;
&lt;p&gt;Uygulama seviyesinde hata kontrol&amp;uuml; yapılacağından ilgili olay kodunun &lt;strong&gt;global application class&lt;/strong&gt; i&amp;ccedil;erisinde yer alması gerekir. Bu nedenle bir adet &lt;strong&gt;global.asax&lt;/strong&gt; dosyası web sitesine dahil edilmelidir. global.asax dosyasında &lt;strong&gt;Application_Error&lt;/strong&gt; olay metodu i&amp;ccedil;erisinde ise aşağıdakine benzer kodlamalar yapılmalıdır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;void Application_Error(object sender, EventArgs e) 
{
    Exception excp = Server.GetLastError();
    // Burada loglama, dosyaya yazma, mail g&amp;ouml;nderme gibi işlemler yapılabilir.
    Server.ClearError();
    Server.Transfer("GenelHataSayfasi.aspx?EkBilgi="+excp.Message+"&amp;amp;HataMesaji="+excp.InnerException.Message);
}&lt;/pre&gt;
&lt;p&gt;Bu sefer global.asax dosyası i&amp;ccedil;erisinden GenelHataSayfasi.aspx isimli web sayfasına querystring yardımıyla bilgi taşınmaktadır. GenelHataSayfasi.aspx i&amp;ccedil;eriği, HataSayfasi.aspx' e benzemekle birlikte tek farkı hatanın meydana geldiği sayfa bilgisini ele almıyor oluşudur. Eğer uygulama bu haliyle test edilir ve yine Default.aspx i&amp;ccedil;erisinde hata yaptırılırsa aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşılır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk214_7.gif" alt="" width="401" height="201" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi default.aspx i&amp;ccedil;erisindeki metodda oluşan hata catch bloğunda ek bilgi ile tekrar throw edilmiş ve bunu sayfanın Page_Error olay metodu yakalamıştır. Sonrasında ise Page_Error olay metodunda hata tekrar throw ile fırlatılmış ve bunun sonucunda Application_Error olay metoduna gidilebilmiştir. Aşağıdaki grafikte bu durumun Debug moddaki karşılığı g&amp;ouml;sterilmektedir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;nce Metod i&amp;ccedil;i;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk214_8.gif" alt="" width="525" height="241" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sonra Page_Error;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk214_9.gif" alt="" width="439" height="145" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Son olarak Application_Error;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk214_10.gif" alt="" width="453" height="150" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alışma sonrasında dikkati &amp;ccedil;eken noktalardan birisi tarayıcı penceresindeki url satırında Default.aspx' in g&amp;ouml;r&amp;uuml;n&amp;uuml;yor olmasıdır. Halbuki şu anda &amp;uuml;zerinde bulunulan sayfa GenelHataYonetimi.aspx' dir. Bunun sebebi &lt;strong&gt;Server.Transfer&lt;/strong&gt; metodudur. Bunun yerine Response.Redirect' te tercih edilebilir. Ama daha &amp;ouml;ncedende belirtildiği &amp;uuml;zere Transfer metodu ile sunucuya doğru gidiş gelişler azaldığı i&amp;ccedil;in &amp;ouml;zellikle uygulama seviyesindeki hata y&amp;ouml;netiminde tercih edilen bir tekniktir. İlgili hata sayfası dahada geliştirilebilir. &amp;Ouml;rneğin hatanın oluştuğu sayfaya d&amp;ouml;n&amp;uuml;lmesi i&amp;ccedil;in gerekli bağlantı bilgileri hata mesajı ile birlikte taşınabilir. Bu ve dahası tamamen sizlerin hayal g&amp;uuml;c&amp;uuml;ne kalmaktadır.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalemizde Asp.Net uygulamalarında etkin hata y&amp;ouml;netimi adına metod, sayfa ve uygulama seviyesinde neler yapabileceğimizi incelemeye &amp;ccedil;alıştık. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/HataYonetimi.zip"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2007-07-18 12:00:00</pubDate>
  <slug>Asp-Net-Temelleri-Etkin-Hata-Yonetimi-(Error-Management)-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet</tag>
    <tag>error-handling</tag>
    <tag>error-management</tag>
  </tags>
  <categories>
    <category>Asp.Net</category>
  </categories>
</post>