<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Batch Queries (Toplu Sorgular) ve SqlDataReader</title>
  <description>Bu makalemizde, toplu sorguların, SqlDataReader sınıfı ile nasıl okunabileceğini incelemeye çalışacağız. Bildiğiniz gibi SqlDataReader nesneleri, bir select sorgusunu çalıştıran SqlCommand sınıfına ait, ExecuteReader metodu ile oluşturulmaktaydı. Çalıştırılan sorgu sonucu elde edilen kayıt kümesinde sadece okunabilir ve ileri yönlü hareket etmemize imkan sağlayan SqlDataReader sınıfı, belli bir t anında veri kanağından sadece tek bir satırı okumamıza izin vermektedir. Bu yönden bakıldığında, SqlDataReader sınıfı, verileri hızlı ve verimli bir şekilde okumamıza imkan sağlamaktadır. Örneğin aşağıdaki kod satırları ile, Sql sunucumuzda yer alan makale isimli tablodaki tüm satırlar okunarak ekrana yazdırılmıştır.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p align="justify"&gt;Bu makalemizde, toplu sorguların, SqlDataReader sınıfı ile nasıl okunabileceğini incelemeye &amp;ccedil;alışacağız. Bildiğiniz gibi SqlDataReader nesneleri, bir select sorgusunu &amp;ccedil;alıştıran SqlCommand sınıfına ait, ExecuteReader metodu ile oluşturulmaktaydı. &amp;Ccedil;alıştırılan sorgu sonucu elde edilen kayıt k&amp;uuml;mesinde sadece okunabilir ve ileri y&amp;ouml;nl&amp;uuml; hareket etmemize imkan sağlayan SqlDataReader sınıfı, belli bir t anında veri kanağından sadece tek bir satırı okumamıza izin vermektedir. Bu y&amp;ouml;nden bakıldığında, SqlDataReader sınıfı, verileri hızlı ve verimli bir şekilde okumamıza imkan sağlamaktadır. &amp;Ouml;rneğin aşağıdaki kod satırları ile, Sql sunucumuzda yer alan makale isimli tablodaki t&amp;uuml;m satırlar okunarak ekrana yazdırılmıştır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data.SqlClient;
using System.Data;
namespace BatchQueries
{
    class Class1
    {
        static void Main(string[] args)
        {
            SqlConnection conFriends=new SqlConnection("data source=localhost;initial catalog=Friends;integrated security=sspi"); /* Sql sunucumuza olan bağlantı hattını tesis edicek SqlConnection nesnemiz tanımlanıyor.*/
            SqlCommand cmdMakale=new SqlCommand("Select * From Makale",conFriends); /* Makale tablosundaki t&amp;uuml;m satırları alıcak sql sorgusunu &amp;ccedil;alıştıracak SqlCommand nesnemiz oluşturuluyor. */
            SqlDataReader drMakale; /* SqlDataReader nesnemiz tanımlanıyor. */
            conFriends.Open(); /*Bağlantımız a&amp;ccedil;ılıyor. */
            drMakale=cmdMakale.ExecuteReader(CommandBehavior.CloseConnection); /* Komutumuz &amp;ccedil;alıştırılıyor ve sonu&amp;ccedil; k&amp;uuml;mesinin başlangıcı SqlDataReader nesnemize aktarılıyor. */
            /* İleri y&amp;uuml;nl&amp;uuml; olarak, SqlDataReader nesnemiz ile, sonu&amp;ccedil; k&amp;uuml;mesindeki satırlar okunuyor ve 1 indisli alanın değeri ekrana yazdırılıyor. */
            while(drMakale.Read())
            {
                Console.WriteLine(drMakale[1]);
            }
            drMakale.Close(); /* Bağlantımız kapatılıyor. */
        }
    }
}&lt;/pre&gt;
&lt;p align="justify"&gt;Bu kodları &amp;ccedil;alıştırdığımızda karşımızıza aşağıdakine benzer bir sonu&amp;ccedil; &amp;ccedil;ıkacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk55_1.gif" alt="" width="421" height="151" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. Programın &amp;Ccedil;alışmasının Sonucu.&lt;/em&gt;&lt;/p&gt;
&lt;p align="justify"&gt;SqlDataReader nesnesinin kullanımına kısaca değindikten sonra makelemizin asıl konusu olan toplu sorgulara değinelim. Toplu sorgular birbirlerinden noktalı virg&amp;uuml;l ile ayrılmış sorgulardır. Birden fazla sorguyu bu şekilde bir araya getirerek işlemlerin tek bir hamlede başlatılmasını ve ger&amp;ccedil;ekleştirilmesini sağlamış oluruz. Bu sorgu topluluklarını, eski dostumuz Ms-Dos işletim sistemindeki bat uzantılı Batch dosyalarına benzetebilirsiniz. Sorun şu ki, yukarıdaki tarzda bir SqlDataReader kullanımını bir toplu sorguya uyguladığımızda, sadece ilk sorgunun &amp;ccedil;alışıtırılacak olmasıdır. &amp;Ouml;rneğin aşağıdaki biri bir toplu sorgumuz olduğunu d&amp;uuml;ş&amp;uuml;nelim;&lt;/p&gt;
&lt;table id="AutoNumber9" style="width: 58%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#cccccc"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="100%"&gt;Select * From Makale;Select * From Kitap;Select * From Siteler&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Bu toplu sorguda arka arkaya &amp;uuml;&amp;ccedil; select sorgusu yer almaktadır. Makale, Kitap ve Siteler tablolarının t&amp;uuml;m s&amp;uuml;tunları talep edilmektedir. Yukarıdaki kod tekniğini b&amp;ouml;yle bir toplu sorguya uyguladığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data.SqlClient;
using System.Data;
namespace BatchQueries
{
    class Class1
    {
        static void Main(string[] args)
        {
            SqlConnection conFriends=new SqlConnection("data source=localhost;initial catalog=Friends;integrated security=sspi");
            string sorgu="Select * From Makale;Select * From Kitap;Select * From Siteler";
            SqlCommand cmdMakale=new SqlCommand(sorgu,conFriends);
            SqlDataReader drMakale;
            conFriends.Open();
            drMakale=cmdMakale.ExecuteReader(CommandBehavior.CloseConnection);
            while(drMakale.Read())
            {   
                Console.WriteLine(drMakale[1]);
            }
            drMakale.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımıza sadece Makale isimli tabloya ait verileri okuyabildiğimizi ve ekrana yazdırıldıklarını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk55_1.gif" alt="" width="421" height="151" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. Sadece ilk kayıt k&amp;uuml;mesi okundu.&lt;/em&gt;&lt;/p&gt;
&lt;p align="justify"&gt;Problem şudur. Toplu sorgumuz, birbirinden farklı &amp;uuml;&amp;ccedil; kayıt k&amp;uuml;mesi getirmektedir. Bu nedenle, her bir kayıt k&amp;uuml;mesinin ayrı ayrı okunması gereklidir. Bunu ger&amp;ccedil;ekleştirmek i&amp;ccedil;in ise, SqlDataReader nesnesini, Read metodu false değerini d&amp;ouml;nd&amp;uuml;rd&amp;uuml;kten, yani ge&amp;ccedil;erli kayıt k&amp;uuml;mesindeki t&amp;uuml;m satırların okunması bittikten sonra, başka kayıt k&amp;uuml;mesinin olup olmadığı kontrol edilmelidir. Bize bu imkanı aşağıda prototipi verilen, NextResult metodu sağlamaktadır.&lt;/p&gt;
&lt;div&gt;
&lt;table id="AutoNumber10" style="width: 33%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#cccccc"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="100%"&gt;&lt;strong&gt;public virtual &lt;/strong&gt;bool&lt;strong&gt; NextResult();&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p align="justify"&gt;Bu metod geriye bool tipinde bir değer d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Eğer g&amp;uuml;ncel kayıt k&amp;uuml;mesinin okunması bittikten sonra başka bir kayıt k&amp;uuml;mesi var ise, true değerini d&amp;ouml;nd&amp;uuml;recektir. Bu durumda, toplu sorgularda bir sonraki kayıt k&amp;uuml;mesinin var olup olmadığını belirlemek i&amp;ccedil;in başka bir while d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml; kullanırız. İşte yukarıdaki toplu sorgumuz sonucu elde edilen t&amp;uuml;m kayıt k&amp;uuml;melerini okuyabileceğimiz kodlar;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data.SqlClient;
using System.Data;
namespace BatchQueries
{
    class Class1
    {
        static void Main(string[] args)
        {
            SqlConnection conFriends=new SqlConnection("data source=localhost;initial catalog=Friends;integrated security=sspi");
            string sorgu="Select * From Makale;Select * From Kitap;Select * From Siteler";
            SqlCommand cmdMakale=new SqlCommand(sorgu,conFriends);
            SqlDataReader drMakale;
            conFriends.Open();
            drMakale=cmdMakale.ExecuteReader(CommandBehavior.CloseConnection);
            do
            {
                Console.WriteLine("---------");
                while(drMakale.Read())
                {
                    Console.WriteLine(drMakale[1]);
                }
                Console.WriteLine("---------");
            }
            while(drMakale.NextResult());
            drMakale.Close();
        }
    }
}&lt;/pre&gt;
&lt;p align="justify"&gt;Burada do while d&amp;ouml;ng&amp;uuml;m&amp;uuml;z bizim anahtar noktamızdır. While do d&amp;ouml;ng&amp;uuml;s&amp;uuml; i&amp;ccedil;inde, o an ge&amp;ccedil;erli olan kayıt k&amp;uuml;mesindeki t&amp;uuml;m satırlar okunur. Okunacak satırlar bittikten sonra, sqlDataReader nesnemize ait Read metodu false değerini d&amp;ouml;nd&amp;uuml;r&amp;uuml;r ve bu while-do d&amp;ouml;ng&amp;uuml;s&amp;uuml; sonra erer. Bu işlemin ardından do-while d&amp;ouml;ng&amp;uuml;s&amp;uuml;nde yer alan NextResult metodu &amp;ccedil;alıştırılır. Eğer arkada başka bir kayıt k&amp;uuml;mesi varsa, whilde-do d&amp;ouml;ng&amp;uuml;m&amp;uuml;z bu kayıt k&amp;uuml;mesi i&amp;ccedil;in &amp;ccedil;alıştırılır. Do-while d&amp;ouml;ng&amp;uuml;m&amp;uuml;z, tekniği a&amp;ccedil;ısından en az bir kere &amp;ccedil;alıştırılır. Zaten ExecuteReader metodu sonucu d&amp;ouml;nen toplu kayıt k&amp;uuml;meleri s&amp;ouml;z konusu olduğunda, SqlDataReader nesnemiz okumak &amp;uuml;zere hemen ilk kayıt k&amp;uuml;mesine konumlanır.&amp;nbsp; İşte sonu&amp;ccedil;;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk55_2.gif" alt="" width="533" height="439" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. Toplu sorgunun &amp;ccedil;alıştırılması sonucu.&lt;/em&gt;&lt;/p&gt;
&lt;p align="justify"&gt;B&amp;ouml;ylece, SqlDataReader nesnesi ile, toplu sorguların &amp;ccedil;alıştırılması sonucu elde edilen kayıt k&amp;uuml;meleri &amp;uuml;zerinden nasıl veri okuyabileceğimizi incelemiş olduk. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-02-17 12:00:00</pubDate>
  <slug>Batch-Queries-(Toplu-Sorgular)-ve-SqlDataReader-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>batch-queries</tag>
    <tag>sqldatareader</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>