<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Screencast - Workflow Foundation 4.0 : Flowchart</title>
  <description>Bundan yaklaşık 1 sene kadar önce Microsoft PDC 2008 sunumlarında gösterilen ve demoları yapılan Workflow Foundation 4.0 ile ilişkili yenilikler arasında dikkat çekici olanlarından bir tanesi de, Flowchart Workflow modeliydi. Aslında bu yeni özellik, çoğu yazılımcının yaşam döngüsü içerisinde sıklıkla kullandığı akış diyagramlarının, Workflow Foundation modeli içerisinde ele alınmasından başka bir şey değildi ki Workflow Foundation 4.0 öncesinde aradığımız ama bulamadığımız bir yenilikti. Visual Studio 2010 Beta 2 sürümünün yayınlandığı şu günlerde, etkili WPF tasarım ortamınında katkısıyla, akış diagramı modeline uygun Workflow aktivitelerinin tasarlanması hem çok kolay hemde çok zevkli hale geldi. Bakalım görsel dersimizde bizleri neler bekliyor...</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bundan yaklaşık 1 sene kadar &amp;ouml;nce &lt;strong&gt;Microsoft PDC 2008 &lt;/strong&gt;sunumlarında g&amp;ouml;sterilen ve demoları yapılan &lt;strong&gt;Workflow Foundation 4.0 &lt;/strong&gt;ile ilişkili yenilikler arasında dikkat &amp;ccedil;ekici olanlarından bir tanesi de, &lt;strong&gt;Flowchart Workflow &lt;/strong&gt;modeliydi. Aslında bu yeni &amp;ouml;zellik, &amp;ccedil;oğu yazılımcının yaşam d&amp;ouml;ng&amp;uuml;s&amp;uuml; i&amp;ccedil;erisinde sıklıkla kullandığı akış diyagramlarının, &lt;strong&gt;Workflow Foundation &lt;/strong&gt;modeli i&amp;ccedil;erisinde ele alınmasından başka bir şey değildi ki &lt;strong&gt;Workflow Foundation 4.0 &lt;/strong&gt;&amp;ouml;ncesinde aradığımız ama bulamadığımız bir yenilikti. &lt;strong&gt;Visual Studio 2010 Beta 2 &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml;n yayınlandığı&amp;nbsp;şu g&amp;uuml;nlerde, etkili &lt;strong&gt;WPF &lt;/strong&gt;tasarım ortamınında katkısıyla, akış diagramı modeline uygun &lt;strong&gt;Workflow &lt;/strong&gt;aktivitelerinin tasarlanması hem &amp;ccedil;ok kolay hemde &amp;ccedil;ok zevkli hale geldi. Bakalım g&amp;ouml;rsel dersimizde bizleri neler bekliyor... &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;iframe src="https://www.youtube.com/embed/Yy774gr_7H0" width="560" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;Yeni g&amp;ouml;rsel derslerde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2009-10-30 16:45:00</pubDate>
  <slug>Screencast-Workflow-Foundation-40-Flowchart</slug>
  <tags>
    <tag>wf-40</tag>
    <tag>screencast</tag>
  </tags>
  <categories>
    <category>WF 4.0 Beta 2</category>
  </categories>
</post>