<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tek Fotoluk İpucu 140 - Distributed Ruby(dRuby)</title>
  <description>Eğitmenlik yaptığım dönemlerde .Net'in en zor alanlarından birisi de Remoting idi. Konu aslında Client-Server mantığına uygun olacak şekilde farklı process'ler arasında veri alışverişinin yapılmasından ibaretti ancak uygulaması web servis geliştirmek kadar kolay olmuyordu. TCP/IP bazlı ağlarda .Net Remoting epeyce iyi performans sergilemekteydi. Özellikle ağ üzerinde hareket eden nesnelerin Binary olarak serileşmesi ve TCP/IP protokolünün devrede olması hız avantajı sağlıyordu.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Eğitmenlik yaptığım d&amp;ouml;nemlerde&amp;nbsp;.Net'in en zor alanlarından birisi de Remoting idi. Konu aslında Client-Server mantığına uygun olacak şekilde farklı process'ler arasında veri alışverişinin yapılmasından ibaretti ancak uygulaması web servis geliştirmek kadar kolay&amp;nbsp;olmuyordu. TCP/IP bazlı ağlarda .Net Remoting epeyce iyi performans sergilemekteydi. &amp;Ouml;zellikle ağ &amp;uuml;zerinde hareket eden nesnelerin Binary olarak serileşmesi ve TCP/IP protokol&amp;uuml;n&amp;uuml;n devrede olması hız avantajı sağlıyordu.&amp;nbsp;Zaman i&amp;ccedil;erisinde servis&amp;nbsp;odaklı yaklaşımlarda kullanılan WCF gibi alt yapılar .Net Remoting yerine tercih edilmeye başlandı. Dağıtık Uygulamalar&lt;em&gt;(Distributed Applications)&lt;/em&gt; olarak ge&amp;ccedil;en bu konu Ruby dilinde de kullanılabiliyor. &amp;Uuml;stelik &amp;ccedil;ok &amp;ccedil;ok daha basit. Standart Ruby kurulumu ile birlikte gelen drb mod&amp;uuml;l&amp;uuml; bu işler i&amp;ccedil;in ele alınmakta&lt;em&gt;(&lt;a href="http://ruby-doc.org/stdlib-2.3.1/libdoc/drb/rdoc/" target="_blank"&gt;dRuby,&amp;nbsp;Masatoshi Seki tarafından geliştirilmiş bir &amp;uuml;r&amp;uuml;nd&amp;uuml;r ve standart Ruby k&amp;uuml;t&amp;uuml;phanesi i&amp;ccedil;erisinde yer almaktadır&lt;/a&gt;)&lt;/em&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Aslında dağıtık uygulamaların &amp;ccedil;ıkış amacı ş&amp;ouml;yle &amp;ouml;zetlenebilir;&amp;nbsp;Bir bilgisayar problemini tek seferde N sayıda process &amp;uuml;zerinden &amp;ccedil;&amp;ouml;z&amp;uuml;mlemeye &amp;ccedil;alışmak. Zamanında SETI projesi vardı. Sanıyorum ki bu vakaya verilebilecek en g&amp;uuml;zel &amp;ouml;rneklerden birisidir. 2011de kaynak yetersizliğinden duran proje 2012de tekrar hayata ge&amp;ccedil;irilmişti. Son durumu nedir bilemiyorum ama &lt;a href="http://setiathome.ssl.berkeley.edu/" target="_blank"&gt;katılımcı olmak i&amp;ccedil;in bu adrese&lt;/a&gt; bakılabilir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Ruby d&amp;uuml;nyasında bu iş i&amp;ccedil;in drb k&amp;uuml;t&amp;uuml;phanesini kullanıyoruz. Tahmin edileceği &amp;uuml;zere bir sunucu ve bu suncuya &amp;ccedil;alıştığı s&amp;uuml;re boyunca bağlanacak istemciler s&amp;ouml;z konusu. Bu ikili dağıtık bir Ruby uygulamasının iki ana par&amp;ccedil;asını oluşturmakta.&amp;nbsp;Sunucu ve istemcilerin temel &amp;ouml;zelliklerini aşağıdaki&amp;nbsp;şekilde olduğu gibi sıralayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/11/tfi_140_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Peki basit bir sunucu ve bu sunucu ile iletişim kuracak istemci(ler) nasıl geliştirilebilirler? Yoksa aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;lerindeki gibi olabilir mi?&lt;/p&gt;
&lt;p&gt;&amp;Ouml;nce sunucu uygulama;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/11/tfi_140_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ardından istemci uygulama;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/11/tfi_140_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve &amp;ccedil;alışma zamanında olanlar&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/11/tfi_140_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında &amp;ouml;rnek son derece basit. Sunucu uygulama &amp;uuml;zerinde bir dizi&amp;nbsp;tanımlıyor ve 8890 nolu port &amp;uuml;zerinden yayına &amp;ccedil;ıkıyoruz. Uygulamayı a&amp;ccedil;ık&amp;nbsp;tutmak i&amp;ccedil;in sonsuz bir d&amp;ouml;ng&amp;uuml;m&amp;uuml;z var. D&amp;ouml;ng&amp;uuml; i&amp;ccedil;erisinde 5er saniyelik duraksamalarımız ve sonrasında anlık olarak objects isimli dizi i&amp;ccedil;eriğini ekrana basan kod par&amp;ccedil;amız bulunuyor. Terminal ekranına bir &amp;ccedil;eşit&amp;nbsp;log bıraktığımızı&amp;nbsp;d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;p&gt;İstemci tarafındaki kod par&amp;ccedil;asında ise 8890 nolu porta bağlanıyor ve new_with_uri metodu ile uzak nesneyi yakalıyoruz. Uzak nesne serileştirilebilir formatta olan bir dizi aslında. Dolayısıyla istemci tarafında &amp;lt;&amp;lt; gibi operat&amp;ouml;rleri&amp;nbsp;kullanarak&amp;nbsp;sunucu tarafındaki s&amp;uuml;rece ait olan diziye yeni elemanlar ekleyebilir veya dizi bazlı &amp;ccedil;eşitli işlemler ger&amp;ccedil;ekleştirebiliriz. Dahası bu dizi i&amp;ccedil;eriğindeki nesneleri&amp;nbsp;8890 nolu porttan hizmet eden sunucuya bağlanan t&amp;uuml;m istemciler i&amp;ccedil;in kullanabiliriz. İşte en yalın haliyle Distributed Ruby' ye merhaba demiş olduk&lt;em&gt;(Bu arada dRuby konusu ile ilgili olarak &lt;a href="https://www.amazon.com/dRuby-Book-Distributed-Parallel-Computing/dp/193435693X/ref=sr_1_1?ie=UTF8&amp;amp;qid=1478002259&amp;amp;sr=8-1&amp;amp;keywords=distributed+ruby" target="_blank"&gt;Amazon'daki şu kitabı&lt;/a&gt; tavsiye ederim)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bir başka ipucunda g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-10-31 21:16:00</pubDate>
  <slug>tek-fotoluk-ipucu-140-distributed-ruby</slug>
  <tags>
    <tag>ruby</tag>
    <tag>distributed-programming</tag>
    <tag>net-remoting</tag>
    <tag>druby</tag>
    <tag>client-server</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>