<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Data Access Application Block Nedir? (.Net 2.0 için)</title>
  <description>Microsoft tarafından serbest olarak dağıtılan Data Access Application Block (Veri Erişimi Uygulama Bloğu) özellikle n katmanlı mimarilerde, Data Access Layer (veri erişim katmanı) için gerekli işlevselliği sağlayan, performans ve bellek yönetimi konusunda iyi sonuçlar veren bir Enterprise Solution Pattern' dir. Bu block sayesinde, özellikle Business Layer (iş katmanındaki)  katmanındaki işimiz oldukça kolaylaşmaktadır. Özellikle Sql sunucusu üzerinde uzmanlaşmış olan bu block' un .Net 2.0 için olan sürümü Ocak ayı içerisinde yayınlandı.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Microsoft tarafından serbest olarak dağıtılan Data Access Application Block (Veri Erişimi Uygulama Bloğu) &amp;ouml;zellikle n katmanlı mimarilerde, Data Access Layer (veri erişim katmanı) i&amp;ccedil;in gerekli işlevselliği sağlayan, performans ve bellek y&amp;ouml;netimi konusunda iyi sonu&amp;ccedil;lar veren bir Enterprise Solution Pattern' dir. Bu block sayesinde, &amp;ouml;zellikle Business Layer (iş katmanındaki)&amp;nbsp; katmanındaki işimiz olduk&amp;ccedil;a kolaylaşmaktadır. &amp;Ouml;zellikle Sql sunucusu &amp;uuml;zerinde uzmanlaşmış olan bu block' un .Net 2.0 i&amp;ccedil;in olan s&amp;uuml;r&amp;uuml;m&amp;uuml; Ocak ayı i&amp;ccedil;erisinde yayınlandı.&lt;/p&gt;
&lt;p&gt;Data Access Application Block (Veri Erişimi Uygulama Bloğu) ve diğer Enterprise Solution Pattern' lerini bu adresten &lt;a href="http://www.microsoft.com/downloads/details.aspx?familyid=5A14E870-406B-4F2A-B723-97BA84AE80B5&amp;amp;displaylang=en"&gt;indirebilirsiniz&lt;/a&gt;. Data Access Application Block (Veri Erişimi Uygulama Bloğu), diğer blocklar gibi bir solution olarak gelmektedir. Dolayısıyla ilk kullanımından &amp;ouml;nce mutlaka bu solution' ı a&amp;ccedil;ıp derlememiz gerekir. B&amp;ouml;ylece kullanılabilir assembly dosyalarımızı (dll' leri) elde etmiş oluruz. Bunun sonucu olarakta herhangibir projede, Data Access Application Block (Veri Erişimi Uygulama Bloğu) i&amp;ccedil;in oluşturulan assembly' ımızı referans edebilir ve kullanmaya başlayabiliriz. Aynı uygulama mantığı diğer block' lar i&amp;ccedil;inde ge&amp;ccedil;erlidir.&lt;/p&gt;
&lt;p&gt;Data Access Application Block (Veri Erişimi Uygulama Bloğu)' unu kısaca inceleyeceğimiz bu makalede &amp;ouml;rneklere ge&amp;ccedil;meden &amp;ouml;nce, Data Access Layer 'ın (veri erişim katmanı) sağladığı avantajlardan kısaca bahsetmekte fayda olacağı kanısındayım. Katlı mimariler, &amp;ouml;zellike Enterprise Solution' ların olmazsa olmaz par&amp;ccedil;alarından birisidir. Temel olarak en basit mimari model &amp;uuml;&amp;ccedil; katmandan oluşmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk160_3.gif" alt="" width="553" height="68" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu modelde veri ile ilgili temel işlemleri &amp;uuml;stlenen bir veri erişim katmanı (Data Access Layer), uygulamanın mantığını &amp;uuml;stlenen bir iş katmanı (Business Layer) ve uygulama arabiriminin tutulduğu bir sunum katmanı (Presentation Layer) mevcuttur. Data Access Layer (veri erişim katmanı) genellikle bağlantı oluşturma, sql komutlarını &amp;ccedil;alıştırma gibi temel yapılar i&amp;ccedil;in gerekli kodları, diğer katmanlardan soyutlayan bir g&amp;ouml;rev &amp;uuml;stlenir. Net tarafından baktığımızda, DataSet, DataTable, Xml, DataReader gibi veri t&amp;uuml;rlerini veya kendi veri t&amp;uuml;rlerimizi geri d&amp;ouml;nd&amp;uuml;ren işlemler ve daha bir &amp;ccedil;oğu Data Access Layer (veri erişim katmanı) i&amp;ccedil;erisindeki metodlarda toplanmaktadır. Eğer elinizde hazır bulunan bir Data Access Layer (veri erişim katmanı) yoksa veya tembellik edip yazmaya &amp;uuml;şeniyorsanız (ya da var olan bir tanesini inceleyip en azından vizyonunuzu geliştirmek istiyorsanız), Data Access Application Block (Veri Erişimi Uygulama Bloğu) ger&amp;ccedil;ekten b&amp;uuml;y&amp;uuml;k bir fırsattır. &amp;Ouml;zelliklede &amp;uuml;cretsiz olarak dağıtıldığı d&amp;uuml;ş&amp;uuml;n&amp;uuml;l&amp;uuml;rse.&lt;/p&gt;
&lt;p&gt;Normal şartlar altında &amp;ouml;zellikle Business (İş) katmanında yer alan metodlarımız i&amp;ccedil;erisinde, Data Access Layer (veri erişim katmanı) i&amp;ccedil;erisindeki metodlar sıklıkla kullanılmaktadır. &amp;Ouml;rneğin web tabanlı bir hizmet programını ele alalım ve sayfalar &amp;uuml;zerindeki GridView kontrollerinin doldurulması gibi temel bir işlem i&amp;ccedil;in gerekli olan materyalleri d&amp;uuml;ş&amp;uuml;nelim. İlk olarak Data Access Layer (veri erişim katmanı) &amp;uuml;zerinde gerekli sorguları &amp;ccedil;alıştırıp geriye DataSet d&amp;ouml;nd&amp;uuml;recek aşırı y&amp;uuml;klenmiş (overload) metodlar yazılması gerekir. Aşırı y&amp;uuml;klenmiş bu versiyonlarda text bazlı query &amp;ccedil;alıştıracak, birden fazla sayıda parametre alacak yada bir stored procedure' &amp;uuml; ele alacak hatta bunların transaction bazlı versiyonlarınıda tutacak tipte se&amp;ccedil;enekler yer alabilir. &amp;Uuml;stelik bu metodun kullanacağı bağlantı nesnesinide bilmesi, gerekirse oluşturması, a&amp;ccedil;ması ve hatta işi bitince bellek y&amp;ouml;netiminide ger&amp;ccedil;eleştirerek kaynakları en iyi şekilde idare etmesi beklenir. Sonu&amp;ccedil; itibariyle uygulamanın iş mantığını kapsayan Business (İş) katmanının, buradaki kod kalabalığından etkilenmemesi ama&amp;ccedil;lanmaktadır. &amp;Ouml;yleki veri erişim katmanı bir kez yazıpı pek &amp;ccedil;ok projede kullanılabilirken, iş katmanı projeden projeye farklılık g&amp;ouml;sterecektir. İşte bu nedenle bu tip karmaşık ve kendi i&amp;ccedil;erisinde dallanarak mod&amp;uuml;lleşebilen işlemler, pek &amp;ccedil;ok projede kullanılabilmeleri amacıyla Data Access Layer (veri erişim katmanı) i&amp;ccedil;erisinde tutulurlar.&lt;/p&gt;
&lt;p&gt;Data Access Application Block (Veri Erişimi Uygulama Bloğu)' un sağladığı etkinlikleri g&amp;ouml;rebilmek amacıyla aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz. Bu kod par&amp;ccedil;ası pek &amp;ccedil;ok yerde kullanılabilecek tipte bir metod olarak veri erişim katmanında yer alacak nitelikte bir yapıya sahiptir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using (SqlConnection con = new SqlConnection(conStr)
{
    using (SqlCommand cmd = new SqlCommand(queryString, con))
    {
        SqlDataAdapter da = new SqlDataAdapter(cmd);
        DataSet ds = new DataSet();
        da.Fill(ds);
    }
}&lt;/pre&gt;
&lt;p&gt;Kodumuz parametre olarak gelecek sorgunun sonu&amp;ccedil;larını bir DataSet i&amp;ccedil;erisine aktarmaktayız. Bu işlemi ger&amp;ccedil;ekleştirmek i&amp;ccedil;in ihtiyacımız olan t&amp;uuml;m materyal kod satırlarında yer almaktadır. Bağlantıyı oluşturmak i&amp;ccedil;in bir SqlConnection nesne &amp;ouml;rneği, komutu &amp;ccedil;alıştırmak i&amp;ccedil;in bir SqlCommand nesne &amp;ouml;rneği ve bu komutu alıp DataSet' i dolduran bir SqlDataAdapter nesne &amp;ouml;rneği. Aslında yapılan iş son derece basittir. Bir sorgu sonucu elde edilen veri k&amp;uuml;mesinin DataSet nesne &amp;ouml;rneğine aktarılması.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;eşitli uygulamların pek &amp;ccedil;ok noktasında belirli bir sorgu ve bağlantı ile &amp;ccedil;alışıp geriye DataSet d&amp;ouml;nd&amp;uuml;recek metodlarımız olacaktır. Bunları her seferinde tekrardan yazmak nesne y&amp;ouml;nelimli bir dilin imkanları g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında doğal olarak yanlış olacaktır. Dolayısıyla bu ve benzeri işlevselliklere sahip kod par&amp;ccedil;aları, bir katman dahilinde toplanabilir ve y&amp;ouml;netimin daha kolay olması sağlanabilir. &amp;Uuml;stelik bu, verileri hazırlamak i&amp;ccedil;in kullanılan kod karmaşasınında diğer katmanlardan soyutlanması anlamına gelmektedir.&amp;nbsp;İşte bu nedenlede, uygulamaların mantığı ile g&amp;ouml;rsel arabirimlerinden ayrıştırılmış ve temel olarak veri erişim tekniklerini ele almış bir katman s&amp;ouml;z konusudur ki biz bunu Data Access Layer (veri erişim katmanı) olarak nitelendiriyoruz. Microsoft buradaki ihtiyacı ele alaraktan herkesin kolayca kullanabileceği bir veri erişim katmanı &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; &amp;uuml;retmiştir. Data Access Application Block (Veri Erişimi Uygulama Bloğu).&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk160_4.gif" alt="" width="553" height="68" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Eğer sisteminize Data Access Application Block (Veri Erişimi Uygulama Bloğu)' u başarılı bir şekilde y&amp;uuml;klediyseniz, kendi Data Access Layer (veri erişim katmanı) k&amp;uuml;t&amp;uuml;phanenize kolayca sahip olmuşsunuz demektir. &amp;Ouml;rneğin yukarıdaki kodun yer aldığı bir Data Access Layer (veri erişim katmanı) metodunun, Data Access Application Block (Veri Erişimi Uygulama Bloğu)' taki karşılığını ele almaya &amp;ccedil;alışalım. Ancak &amp;ouml;ncesinde, uygulamamıza Data Access Application Block (Veri Erişimi Uygulama Bloğu)' tan gerekli referansları almamız gerekecektir. &lt;em&gt;(Eğer .Net 2.0 i&amp;ccedil;in indirdiğiniz Enterprise Library' yi standart olarak kurduysanız, Enterprise Solution' unuzu derledikten sonra oluşan assembly' lara C:\Program Files\Microsoft Enterprise Library January 2006\bin klas&amp;ouml;r&amp;uuml;nden erişebilirsiniz.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk160_1.gif" alt="" width="303" height="214" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu referansları aldıktan sonra yukarıdaki kod par&amp;ccedil;asını aşağıdaki haliyle yazabiliriz. &amp;Ouml;nce bizim i&amp;ccedil;in gerekli referanslar;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Microsoft.Practices.EnterpriseLibrary.Common;
using Microsoft.Practices.EnterpriseLibrary.Data.Sql;
using Microsoft.Practices.EnterpriseLibrary.Data;&lt;/pre&gt;
&lt;p&gt;Kodumuzun aynısını ve hatta daha iyisinide yapan Data Access Application Block (Veri Erişimi Uygulama Bloğu) karşılıkları,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Database db = DatabaseFactory.CreateDatabase("conn");
db.ExecuteDataSet(CommandType.Text, "Select * From Production.Product");&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Data Access Application Block (Veri Erişimi Uygulama Bloğu)' un kullanımı son derece kolay ve esnektir. Koda dikkat edecek olursanız, connection nesnesinin nasıl oluşturulduğunu, dataSet nesnesinin nasıl doldurulduğunu g&amp;ouml;rmemekteyiz. Bu işlemler Data Access Layer (veri erişim katmanı) i&amp;ccedil;erisinde kaps&amp;uuml;llenerek bizden soyutlandırılmış durumdalar. Benim en &amp;ccedil;ok beyendiğim &amp;ouml;zelliklerden birisi, kilit nesnelerin oluşturulmasında &amp;ccedil;eşitli factory nesnelerinin g&amp;ouml;rev alıyor olması. &amp;Ouml;rneğimizde, Database nesnesini oluşturmak i&amp;ccedil;in DatabaseFactory isimli başka bir fabrika nesnesi kullanılmıştır. &amp;Ouml;zellikle CreateDatabase metodunun bu versiyonu varsayılan olarak uygulamanın konfigurasyon dosyasına bakıp uyun connectionString node' unu kullanmıştır.&lt;/p&gt;
&lt;p&gt;.Net 2.0 i&amp;ccedil;in geliştirilen bu versiyonda &amp;ouml;nceki Enterprise Block' lara g&amp;ouml;re bir takım temel farklılıklarda mevcuttur. &amp;Ouml;rneğin, burada oluşturduğumuz Database nesne &amp;ouml;rneğini &amp;ccedil;eşitli metodları y&amp;uuml;r&amp;uuml;tmek (execute) i&amp;ccedil;in kullanmaktayız. Ancak bunu oluştururken App.config dosyasında tuttuğumuz connection string bilgisini doğrudan kullanıyoruz. Bu ve benzeri pek &amp;ccedil;ok yenilik var. Pek &amp;ccedil;ok isim alanı tamamen değişmiş ve daha iyi ayrıştırılmış durumda. Ama ilk g&amp;ouml;ze &amp;ccedil;arpanlar arasında Ado.Net 2.0 olan tam destek ve sınıfların biraz daha derlenip bir &amp;ouml;nceki versiyona g&amp;ouml;re karmaşıklıktan uzaklaştırılmış olması var.&lt;/p&gt;
&lt;p&gt;App.config i&amp;ccedil;eriği;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;connectionStrings&amp;gt;
        &amp;lt;add name="conn" connectionString="Data source=manchester;database=AdventureWorks;integrated security=sspi" providerName="System.Data.SqlClient"/&amp;gt;
    &amp;lt;/connectionStrings&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;CreateDatabase static metodu konfigurasyon dosyası i&amp;ccedil;erisindeki conn isimli anahtarı nasıl bulacağını bilmektedir. Biz bununla da uğraşmamaktayız. Buda uygulamanın yeniden derlemeye gerek duymayacak teknikleri (ki burada xml tabanlı bir konfigurasyon dosyası bunu karşılıyor) kolayca uygulayabilecek bir katmana sahip olduğu anlamına gelmektedir. Şimdi gelin başka bir senaryoyu ele alalım. &amp;Ouml;rneğin, sistemde yer alan parametrik bir stored procedure' &amp;uuml;n sonu&amp;ccedil;larını ortama bir DataReader vasıtasıyla almak istediğimiz bir işlevselliği Data Access Layer (veri erişim katmanı) i&amp;ccedil;erisine katmak istediğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu senaryo i&amp;ccedil;in Sql Server 2005 &amp;uuml;zerinde, AdventureWorks veritabanında yer alacak aşağıda oluşturma script' i verilen sp' yi kullanabiliriz.&lt;/p&gt;
&lt;p&gt;Kullandığımız Stored Procedure;&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;USE [AdventureWorks]
GO

SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE PROCEDURE [dbo].[GetStoreByPersonID] 
(
    @PersonID int
)
AS
SELECT * FROM Sales.Store WHERE SalesPersonID=@PersonID
RETURN&lt;/pre&gt;
&lt;p&gt;Şimdi bu sp' yi kullanacak &amp;ouml;rnek bir kod par&amp;ccedil;asını kendi DAL' ımız i&amp;ccedil;erisinde aşağıdaki gibi yazdığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using (SqlConnection con = new SqlConnection(conStr))
{
    using (SqlCommand cmd = new SqlCommand(queryStr, con))
    {
        cmd.CommandType = CommandType.StoredProcedure;
        cmd.Parameters.AddWithValue(prmName, prmValue);
        con.Open();
        SqlDataReader dr = cmd.ExecuteReader();
    }
}&lt;/pre&gt;
&lt;p&gt;Elbette buraki kod yazım şekli yazılımcıdan yazılımcıya farklılıkta g&amp;ouml;sterebilir. Oysaki hangi yol ile olursa olsun, Data Access Application Block (Veri Erişimi Uygulama Bloğu)' un sunduğu &amp;ccedil;izgi bellidir. Bu da aslında, b&amp;uuml;y&amp;uuml;k &amp;ccedil;aplı projelerde farklı yazılımcıların aynı standart &amp;uuml;zerinde geliştirme yapabilmesini olanaklı kılmaktadır. Dolayısıyla tek yapmamız gereken eğer bir stored procedure' &amp;uuml;, konfigurasyon dosyasında tutulan bir bağlantı bilgisi &amp;uuml;zerinden &amp;ccedil;alıştırmak ve geriye bir DataReader almak ise, Business (İş) katmanında kullanacağımız metod sadece aşağıdaki iki satır kod par&amp;ccedil;asını i&amp;ccedil;erecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk160_2.gif" alt="" width="599" height="84" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Database db = DatabaseFactory.CreateDatabase("conn");
db.ExecuteReader("GetStoreByPersonID", 277);&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, ExecuteReader metodunun kullandığımız versiyonunda ilk parametre olarak stored procedure' &amp;uuml;n adı verilmiştir. İkinci parametre olarak ise, params anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; kullanılarak n sayıda object tipinden değer girilebilmesi sağlanmıştır. Buna g&amp;ouml;re ExecuteReader metodu gelen değer sayısına g&amp;ouml;re i&amp;ccedil;eride parametre oluşturacak ve sp' ye g&amp;ouml;nderecektir&lt;em&gt;(Bu işlemlerin Data Access Application Block (Veri Erişimi Uygulama Bloğu) i&amp;ccedil;erisindeki kodlarda nasıl yapıldığını g&amp;ouml;rmek i&amp;ccedil;in, ExecuteReader satırına Breakpoint koymanızı ve F11 ile adım adım ilerlemenizi &amp;ouml;neririm.)&lt;/em&gt; B&amp;ouml;ylece sadece iki kod satırı ile ne kadar &amp;ccedil;ok kod kalabılığından soyutlandığımızı daha kolay g&amp;ouml;rebilir ve veri erişim katmanının faydalarını fark edebilirsiniz. İşte Data Access Layer (veri erişim katmanı) ' ın faydası burada bir kez daha ortaya &amp;ccedil;ıkmaktadır. T&amp;uuml;m kod kalabalığını iş mantığımızdan soyutlamıştır. Ayrıca y&amp;ouml;netiminide kendi i&amp;ccedil;erisinde ger&amp;ccedil;ekleştirmektedir.&lt;/p&gt;
&lt;p&gt;Başka bir &amp;ouml;rnek daha ele alalım. Bazen uygulamalarımız n-katlı mimariye sahip olabilir. &amp;Ouml;rneğin veritabanındaki &amp;ccedil;eşitli tiplerin sınıfsal karşılığının tutulduğu bir entity katmanımız olduğunu d&amp;uuml;ş&amp;uuml;nelim. Bu katmanda pekala veri erişim katmanını aktif olarak kullanacaktır. &amp;Ouml;rneğin, Urun isimli aşağıdaki tipi ele alalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk160_5.gif" alt="" width="209" height="265" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Urun
{
    private int _id;
    private string _ad;
    private double _fiyat;
    public int Id
    {
        get { return _id; }
        set { _id = value; }
    }
    public string Ad
    {
        get { return _ad; }
        set { _ad = value; }
    }
    public double Fiyat
    {
        get { return _fiyat; }
        set { _fiyat = value; }
    }
    public Urun()
    {
    }
    public void Load(int id)
    {
        Database db = DatabaseFactory.CreateDatabase("conn");
          IDataReader dr = db.ExecuteReader("GetProductById", id);
        dr.Read();
        _id = Convert.ToInt32(dr["ProductID"]);
        _ad = dr["Name"].ToString();
        _fiyat = Convert.ToDouble(dr["StandardCost"]);
    }
}&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında &amp;ouml;rnek olarak Urun isimli bir entitiy' nin &amp;ccedil;alışma zamanında karşılık geleceği herhangibir veri satırı i&amp;ccedil;in y&amp;uuml;klenebilmesini (Load) sağlarken veri erişim katmanından nasıl yararlanabildiğimizi g&amp;ouml;rmektesiniz.&lt;/p&gt;
&lt;p&gt;Data Access Application Block (Veri Erişimi Uygulama Bloğu)' un sunduğu imkanlara ait pek &amp;ccedil;ok &amp;ouml;rnek geliştirebiliriz. Bir diğer &amp;ouml;rnek ile makalemize devam edelim. Web tabanlı uygulamalarda veri bağlama işlemleri sırasında Business (İş) katmanının veri erişim katmanından nasıl yararlanabileceğini g&amp;ouml;receğimiz bir &amp;ouml;rneğe bakalım.&lt;/p&gt;
&lt;p&gt;Business (İş) sınıfımız;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class OurLogic
{
    private Database _db;
    public OurLogic()
    {
        _db = DatabaseFactory.CreateDatabase("conn"); 
    }

    // &amp;Uuml;r&amp;uuml;nleri parametre olarak gelen GridView kontrol&amp;uuml;ne y&amp;uuml;kleyen iş katmanı metodu.
    public void BindProducts(GridView dg)
    { 
        dg.DataSource = _db.ExecuteDataSet(CommandType.Text, "Select * From Production.Product");
        dg.DataBind();
    }

    // &amp;Uuml;r&amp;uuml;n kategorilerini parametre olarak gelen DropDownList kontrol&amp;uuml;ne bağlayan, ve value ile text &amp;ouml;zelliklerinide ayarlayan bir iş katmanı metodu. Burada ListControl kullanılmasının tek sebebi, sayfalarda yer alan DropDownList ve ListBox kontrollerine de destek verilmesini sağlamaktır. Bu yine ListControl' un polimorfik yapısının sağladığı bir avantajdır.
    public void BindPrdCategories(ListControl dl)
    {
        dl.DataSource=_db.ExecuteReader(CommandType.Text,"SELECT ProductCategoryID, Name FROM Production.ProductCategory");
        dl.DataValueField = "ProductCategoryID";
        dl.DataTextField = "Name";
        dl.DataBind();
    }

    // &amp;Uuml;r&amp;uuml;nlerin sayısını int tipinde d&amp;ouml;nd&amp;uuml;ren bir iş katmanı metodu. Bu metodda generic bir yapıda kullanılabilir. B&amp;ouml;ylece presentation katmanından &amp;ccedil;ağırılırken herhangibir tipe karşılık gelecek şekilde ele alınabilir.
    public int GetCategoryCount()
    {
        return (int)_db.ExecuteScalar(CommandType.Text,"SELECT COUNT(*) AS CategoryCount FROM Production.ProductCategory");
    }

    // Urun entity tipini verilen id' ye g&amp;ouml;re y&amp;uuml;kleyen ve geri d&amp;ouml;nd&amp;uuml;ren bir iş katmanı metodu.
    public Urun GetUrun(int id)
    {
        Urun urn = new Urun();
        urn.Load(id);
        return urn;
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi iş katmanının basit olarak sunum katmanından nasıl kullanıldığına bakalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public partial class _Default : System.Web.UI.Page 
{
    protected OurLogic _ol;

    protected void Page_Load(object sender, EventArgs e)
    {
        _ol = new OurLogic();
    }
    protected void btnProducts_Click(object sender, EventArgs e)
    {
        _ol.BindProducts(grdProducts);
    }
    protected void btnCategories_Click(object sender, EventArgs e)
    {
        _ol.BindPrdCategories(ddlProductCategories);
    }
    protected void btnGetCount_Click(object sender, EventArgs e)
    {
        lblCatCount.Text=_ol.GetCategoryCount().ToString();
    }
    protected void btnGet_Click(object sender, EventArgs e)
    {
        Urun urn = _ol.GetUrun(Convert.ToInt32(txtId.Text));
        lstLoad.Items.Add(urn.Ad);
        lstLoad.Items.Add(urn.Fiyat.ToString());
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk160_6.gif" alt="" width="377" height="434" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Data Access Application Block (Veri Erişimi Uygulama Bloğu) sayesinde uygulamalarımızı geliştirirken sadece iş katmanını ve sunum katmanını d&amp;uuml;ş&amp;uuml;nmemiz yeterli olmaktadır. Bunun bir avantaj olup olmadığı d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Sonu&amp;ccedil; itibariyle yazılım m&amp;uuml;hendisliğine yeni başlayan arkadaşlar i&amp;ccedil;in, veri erişim katmanının nasıl olduğunun farkına varmak veya nasıl yazıldığını anlamak i&amp;ccedil;in Data Access Application Block (Veri Erişimi Uygulama Bloğu)' u incelemek bile vizyonumuzu geliştirecek &amp;ouml;nemli bir etkendir. &amp;Ouml;zellikle kendi projelerimizde, projenin b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml; ile orantılı olacak şekilde kendi veri erişim katmanlarımızı yazmayı tercih edebiliriz. Ancak performans, bellek y&amp;ouml;netimi, tutarlılık gibi kriterlerin &amp;ouml;nemi g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında, Data Access Application Block (Veri Erişimi Uygulama Bloğu)' un en azından incelenmesi gerektiği kanısındayım. Bu makalemizde kısaca Microsoft' un &amp;uuml;cretsiz olarak sunduğu enterprise &amp;ccedil;&amp;ouml;z&amp;uuml;m desenlerinden birisi olan Data Access Application Block (Veri Erişimi Uygulama Bloğu)' un ne olduğunu ve hangi ama&amp;ccedil;lar ile kullanılabildiğini temel d&amp;uuml;zeyde incelemeye &amp;ccedil;alıştık ve geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2006-05-05 12:00:00</pubDate>
  <slug>Data-Access-Application-Block-Nedir-(-Net-2-0-icin)-bsenyurt-com-dan</slug>
  <tags>
    <tag>enterprise-applications</tag>
    <tag>enterprise-architectures</tag>
    <tag>cross-cuttings</tag>
  </tags>
  <categories>
    <category>Ado.net 2.0</category>
  </categories>
</post>