<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Regex ve Performans İpuçları – Otomatik Cache</title>
  <description>Aslında Regular Expression terimini ağırlıklı olarak Asp.Net Web uygulamalarından tanımaktayız. Bu anlamda özellikle RegularExpressionValidator web kontrolünden yararlanarak, girilen verinin doğrulanması için bazı desenleri kullanabiliyoruz.</description>
  <content>&lt;p&gt;&lt;a href="/pics/blg221_Giris.jpg"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border: 0px;" title="blg221_Giris" src="/pics/blg221_Giris_thumb.jpg" alt="blg221_Giris" width="228" height="302" align="right" border="0" /&gt;&lt;/a&gt; Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Şu an yazıyı hazırlamaya &amp;ccedil;alıştığım an &lt;strong&gt;İstanbul&amp;rsquo;&lt;/strong&gt; un tarihinde g&amp;ouml;rd&amp;uuml;ğ&amp;uuml; en sıcak gecelerden birisine denk gelmekte sanırım. G&amp;uuml;nd&amp;uuml;z yaklaşık olarak &lt;strong&gt;53&lt;/strong&gt; derece olarak hissedilen sıcaklığı ofisteki kuvvetli klimalar sayesinde fazla hissetmedik belki ama eve d&amp;ouml;n&amp;uuml;ş yolunda, gerek otob&amp;uuml;slerde gerekse minib&amp;uuml;s veya diğer toplu taşıma ara&amp;ccedil;larında fazlasıyla hissettiğimize eminim &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Gece &amp;ccedil;&amp;ouml;kmesine ve balkonda oturmama rağmen ne yazık ki yapraklar bile sıcak dolayısıyla kendinden ge&amp;ccedil;miş durumda ve bu nedenle sallanmak dahi istemiyorlar. Hal b&amp;ouml;yle olunca serinletici esintilerinde tatile &amp;ccedil;ıktıklarını ifade edebilirim.&lt;/p&gt;
&lt;p&gt;Acaba t&amp;uuml;m bu yaşadıklarımız, garip olan bu yaz mevsimi, yağmurlarla ge&amp;ccedil;en g&amp;uuml;nler ve aşırı sıcaklar ger&amp;ccedil;ekten de &lt;strong&gt;K&amp;uuml;resel Isınmanın&lt;/strong&gt; sonu&amp;ccedil;ların mı? Bu konuda d&amp;uuml;nyadaki 6 derecelik bir ısı değişiminin sonu&amp;ccedil;larını anlatan bir kitap okumuştum aslında(&lt;a href="http://www.ntvyayinlari.com/tanim.asp?sid=SWBUBQIYKD1DPH7YQ3A8" target="_blank"&gt;6 Derece&lt;/a&gt;) Merak edenlere tavsiye ederim.&lt;/p&gt;
&lt;p&gt;Neyse. Dilerseniz biz konumuza geri d&amp;ouml;nelim. Bu yazımızda belki de tek satırlık bir kod par&amp;ccedil;asının &amp;ouml;nemine değiniyor olacağız. Ancak sonu&amp;ccedil;ları irdelediğimizde bunun ne kadar &amp;ouml;nemli bir fark yarattığına da şahit olacağız. Konumuz &lt;strong&gt;Regex&lt;/strong&gt; tipinin kullanımına dair ip u&amp;ccedil;larından birisi olan otomatik &amp;ouml;n bellekleme işlemini ele almakta.&lt;/p&gt;
&lt;p&gt;Aslında&lt;strong&gt; Regular Expression&lt;/strong&gt; terimini ağırlıklı olarak &lt;strong&gt;Asp.Net Web&lt;/strong&gt; uygulamalarından tanımaktayız. Bu anlamda &amp;ouml;zellikle &lt;strong&gt;RegularExpressionValidator&lt;/strong&gt; web kontrol&amp;uuml;nden yararlanarak, girilen verinin doğrulanması i&amp;ccedil;in bazı desenleri kullanabiliyoruz. Bilindiği &amp;uuml;zere bu doğrulama işlemleri &lt;strong&gt;Javascript&lt;/strong&gt; ile istemci tarafında ve her ihtimale karşın sunucu tarafında da uygulanmakta&lt;em&gt;(İstemcinin javascript &amp;ccedil;alıştırmama olasılığına karşın)&lt;/em&gt;. Tabi işin g&amp;uuml;zel yanı &lt;strong&gt;Regex&lt;/strong&gt; ifadelerinin aslında dilden bağımsız olmaları. &lt;strong&gt;RegularExpressionValidator&lt;/strong&gt; kontrol&amp;uuml;n&amp;uuml;n &lt;strong&gt;ValidationExpression&lt;/strong&gt; &amp;ouml;zelliğinde yer alan desenlerden bazılarını aşağıda bulabilirsiniz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Internet Email Adres Deseni \w+([-+.']\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*&lt;/li&gt;
&lt;li&gt;Internet URL Deseni http(s)?://([\w-]+\.)+[\w-]+(/[\w- ./?%&amp;amp;=]*)?&lt;/li&gt;
&lt;li&gt;US Phone Number ((\(\d{3}\) ?)|(\d{3}-))?\d{3}-\d{4}&lt;/li&gt;
&lt;li&gt;US Social Security Number \d{3}-\d{2}-\d{4}&lt;/li&gt;
&lt;li&gt;US Zip Code \d{5}(-\d{4})?&lt;/li&gt;
&lt;li&gt;German Phone Number ((\(0\d\d\) |(\(0\d{3}\) )?\d )?\d\d \d\d \d\d|\(0\d{4}\) \d \d\d-\d\d?)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bu desenler yardımıyla kullanıcıların girmiş olduğu verilerin ge&amp;ccedil;erli bir elektronik posta/url adresi, telefon numarası, posta kodu, sosyal g&amp;uuml;venlik bilgisi olup olmadığı kolaylıkla kontrol edilebilmekte. Tabi dilersek &amp;ouml;zel &lt;strong&gt;Regex&lt;/strong&gt; ifadeleri de oluşturabiliriz.&lt;/p&gt;
&lt;p&gt;Diğer taraftan bazı projelerde &lt;strong&gt;Doğrulama(Validation)&lt;/strong&gt; operasyonlarını i&amp;ccedil;eren katmanlarda, &lt;strong&gt;Regex&lt;/strong&gt; tipinden yararlanarak verinin kontrol edilmesi işlemleri ger&amp;ccedil;ekleştirilebilmektedir. Bu anlamda &lt;strong&gt;Regex&lt;/strong&gt; tipi ve &amp;uuml;yeleri bize &amp;ouml;nemli avantajlar sağlamakta. Ancak &lt;strong&gt;Regex&lt;/strong&gt; tipinden yararlanırken zaman zaman performans sorunları ile karşılaşılabilir. Bu noktada &amp;ouml;n bellekleme işlemlerinin hızlanma a&amp;ccedil;ısından bir avantaj sağladığı ortadadır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/Exclamation_9.gif"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border: 0px;" title="Exclamation" src="/pics/Exclamation_thumb_9.gif" alt="Exclamation" width="48" height="48" align="left" border="0" /&gt;&lt;/a&gt; Aslında &lt;strong&gt;.Net Framework 1.1&lt;/strong&gt; versiyonunda yer alan &lt;strong&gt;Regex&lt;/strong&gt; tipinin nesne &amp;ouml;rneklemelerinin, &lt;strong&gt;desen(Pattern)&lt;/strong&gt; ile ilişkili bir &amp;ouml;n bellekleme mekanizması zaten mevcuttur. Ancak&lt;strong&gt; .Net Framework 2.0&lt;/strong&gt; ve sonraki versiyonlarda s&amp;ouml;z konusu desen &amp;ouml;n bellekleme işlemi &lt;strong&gt;static&lt;/strong&gt; &lt;strong&gt;IsMatch&lt;/strong&gt; metodu &amp;uuml;zerine yıkılmıştır. Bir başka deyişle sadece &lt;strong&gt;IsMatch&lt;/strong&gt; metodunun, parametre olarak gelen &lt;strong&gt;Regular Expression&lt;/strong&gt; ifadesi i&amp;ccedil;in &amp;ouml;n bellekleme yaptığını ifade edebiliriz. Normal şartlarda ka&amp;ccedil; desenin &amp;ouml;n bellekleneceği bilgisi &lt;strong&gt;Regex&lt;/strong&gt; tipinin &lt;strong&gt;static&lt;/strong&gt; &lt;strong&gt;CacheSize&lt;/strong&gt; &lt;strong&gt;&amp;ouml;zelliği(Property)&lt;/strong&gt; ile belirlenebilir. Bu &amp;ouml;zelliğin varsayılan değeri ise &lt;strong&gt;15&lt;/strong&gt; dir.&lt;/p&gt;
&lt;p&gt;Şimdi basit bir test uygulaması geliştireceğiz ve aslında &amp;ouml;n belleklemenin nasıl bir faydası olduğunu g&amp;ouml;rmeye gayret edeceğiz. Bu ama&amp;ccedil;la &lt;strong&gt;160bin&lt;/strong&gt; satırdan oluşan ve aşağıdaki gibi bazı &lt;strong&gt;URL&lt;/strong&gt; adres bilgilerini i&amp;ccedil;eren&lt;em&gt;(ki &amp;ccedil;oğu aynı değerlerin tekrarıdı &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; )&lt;/em&gt;&amp;nbsp;&lt;strong&gt;Urls.txt&lt;/strong&gt; isimli bir &lt;strong&gt;Text&lt;/strong&gt; dosyasını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alıyor olacağız. S&amp;ouml;z konusu dosya i&amp;ccedil;eriğinin bir kısmını aşağıdaki şekilden g&amp;ouml;rebilirsiniz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg221_TextFileContent.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg221_TextFileContent" src="/pics/blg221_TextFileContent_thumb.gif" alt="blg221_TextFileContent" width="410" height="332" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Uygulama i&amp;ccedil;erisinde yer alan akışımız, s&amp;ouml;z konusu &lt;strong&gt;Text&lt;/strong&gt; dosya i&amp;ccedil;eriğindeki her bir satırı okuyacak ve bu adreslerden hangilerinin ge&amp;ccedil;erli olduğunu kontrol edecek şekilde geliştirilecektir. İşte bu ama&amp;ccedil;la ele alacağımız &amp;ouml;rnek uygulama kodları;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Diagnostics; 
using System.IO; 
using System.Text.RegularExpressions;

namespace RegExPerformanceTips 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            string urlPattern=@"http(s)?://([\w-]+\.)+[\w-]+(/[\w- ./?%&amp;amp;=]*)?"; 
            string[] urls = File.ReadAllLines(Path.Combine(Environment.CurrentDirectory, "Urls.txt"));            
            for (int i = 0; i &amp;lt; 10; i++) 
            { 
                Console.WriteLine("Test Number {0}",i); 
                Process(urlPattern, urls); 
            }            
        }

        private static void Process(string urlPattern, string[] urls) 
        { 
            Stopwatch watcher = new Stopwatch(); 
            watcher.Start(); 
            int validCount = 0;

            foreach (string url in urls) 
            { 
                if (IsValid(urlPattern, url)) 
                    validCount++; 
                //Console.WriteLine("{0} {1}",url,IsValid(urlPattern,url)?"is valid":"isn't valid"); 
            }

            watcher.Stop(); 
            Console.WriteLine("Valid Urls Count {0} , Total validation time : {1}", validCount, watcher.ElapsedMilliseconds); 
        }

        static bool IsValid(string pattern,string content) 
        { 
            Regex regex = new Regex(pattern); 
            bool result = regex.IsMatch(content); 
            //bool result = Regex.IsMatch(content, pattern);            
            return result; 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Kodun dikkat edilmesi gereken en &amp;ouml;nemli noktası &lt;strong&gt;IsValid&lt;/strong&gt; metodunun i&amp;ccedil;eriğidir. S&amp;ouml;z konusu metod kontrol edilecek &lt;strong&gt;string&lt;/strong&gt; bilgi ile ilgili &lt;strong&gt;Regular&lt;/strong&gt; &lt;strong&gt;Expression&lt;/strong&gt; desenini parametre olarak almaktadır. İlk test vakası i&amp;ccedil;in &lt;strong&gt;Regex&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneğinin oluşturulduğu g&amp;ouml;r&amp;uuml;lmektedir. &lt;strong&gt;Regex&lt;/strong&gt; nesnesi &amp;ouml;rneklenirken parametre olarak kontrol desenini almaktadır. Sonrasında ise nesne &amp;ouml;rneği &amp;uuml;zerinden yapılan &lt;strong&gt;IsMatch&lt;/strong&gt; metod &amp;ccedil;ağrısı ile gerekli kontrol işlemi ger&amp;ccedil;ekleştirilmektedir. Dosya i&amp;ccedil;erisindeki bilgiler i&amp;ccedil;in gerekli doğrulama kontrol&amp;uuml; s&amp;uuml;re farklılıklarını irdelemek amacıyla &lt;strong&gt;10&lt;/strong&gt; defa &amp;uuml;st &amp;uuml;ste yapılmaktadır. Buna g&amp;ouml;re ilk test vakamızın &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı uygulamanın yazıldığı sistemin &amp;ouml;zelliklerine g&amp;ouml;re aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg221_InstanceTestResult.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg221_InstanceTestResult" src="/pics/blg221_InstanceTestResult_thumb.gif" alt="blg221_InstanceTestResult" width="557" height="335" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Yaklaşık olarak &lt;strong&gt;4&lt;/strong&gt; ile &lt;strong&gt;9 saniye&lt;/strong&gt; arasında değişen s&amp;uuml;reler s&amp;ouml;z konusudur. S&amp;uuml;relerin tutarsızlığı bir yana, kontrol işlemlerinin de olduk&amp;ccedil;a da uzun s&amp;uuml;rd&amp;uuml;ğ&amp;uuml; g&amp;ouml;r&amp;uuml;lm&amp;uuml;şt&amp;uuml;r. Peki uzun s&amp;uuml;rd&amp;uuml;kleri sonucuna nasıl vardık? &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Eğer &lt;strong&gt;IsValid&lt;/strong&gt; metodu i&amp;ccedil;erisinde &lt;strong&gt;Regex&lt;/strong&gt; tipi &amp;uuml;zerinden &lt;strong&gt;static&lt;/strong&gt; &lt;strong&gt;IsMatch&lt;/strong&gt; metodunu kullandığımız durumda ki &amp;ccedil;alışma zamanı &amp;ccedil;ıktısına bakarsak, &amp;ccedil;ok daha kısa s&amp;uuml;relerde doğrulama işlemlerinin yapıldığını g&amp;ouml;rebiliriz. İşte aynı makine konfigurasyonundaki yeni test vakasının &amp;ccedil;alışma zamanı sonu&amp;ccedil;ları.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg221_IsMatchTestResult.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg221_IsMatchTestResult" src="/pics/blg221_IsMatchTestResult_thumb.gif" alt="blg221_IsMatchTestResult" width="557" height="335" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re test sonu&amp;ccedil;larını aşağıdaki &lt;strong&gt;Excel&lt;/strong&gt; grafiğinde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &amp;ouml;zetleyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg221_FirstTestResults.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg221_FirstTestResults" src="/pics/blg221_FirstTestResults_thumb.gif" alt="blg221_FirstTestResults" width="530" height="339" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Peki bu korkun&amp;ccedil; sayılabilecek s&amp;uuml;re farkı neden oluşmuştur. Yazımızın giriş kısmında da belirttiğimiz &amp;uuml;zere &lt;strong&gt;Regex&lt;/strong&gt; tipinden nesne &amp;ouml;rnekleri oluşturulduğunda her seferinde bir desen bildirimi yapılmaktadır ancak bu bildirim s&amp;uuml;rekli olarak tekrar edilmektedir. Oysaki &lt;strong&gt;Regex&lt;/strong&gt; tipinin &lt;strong&gt;static&lt;/strong&gt; &lt;strong&gt;IsMatch&lt;/strong&gt; metodu ilk seferde kullanılan &lt;strong&gt;Regular&lt;/strong&gt; &lt;strong&gt;Expression&lt;/strong&gt; ifadesini &amp;ouml;n belleklemekte ve sonraki &amp;ccedil;ağrılarda da bu desen i&amp;ccedil;in gerekli i&amp;ccedil; hazırlıkları yapmadan sadece kontrol işlemine ge&amp;ccedil;iş yapmaktadır. Tabi istenirse varsayılan olarak &lt;strong&gt;15&lt;/strong&gt; farklı &lt;strong&gt;Regular&lt;/strong&gt; &lt;strong&gt;Expression&lt;/strong&gt; ifadesi i&amp;ccedil;in bu bellekleme işlemi kullanılabilir.&lt;/p&gt;
&lt;p&gt;Regex tipinin performanslı kullanımına ilişkin farklı ip u&amp;ccedil;ları da mevcuttur. Ancak sucuk gibi terldiğimden bu sıcakta ancak bu kadar yazabildim. S&amp;ouml;z konusu ipu&amp;ccedil;larını ilereyen yazılarımızda ele almaya &amp;ccedil;alışıyor olacağız. Umarım havalar buna m&amp;uuml;sade eder. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f8%2fRegExPerformanceTips.rar"&gt;RegExPerformanceTips.rar (33,72 kb)&lt;/a&gt;&amp;nbsp;&lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 Ultimate Ortamında Geliştirilmiş ve Test Edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-08-06 07:05:00</pubDate>
  <slug>Regex-ve-Performans-Ipuclari-Otomatik-Cache</slug>
  <tags>
    <tag>c#</tag>
    <tag>c#-temelleri</tag>
    <tag>c#-40</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>