<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ado.Net 2.0 ve Toplu Güncelleme İşlemleri (Batch-Updates)</title>
  <description>Toplu güncelleştirme işlemleri, birden fazla sql ifadesinin (insert,update,delete,select gibi) arka arkaya gelecek şekilde ancak tek bir seferde çalıştırılmasını baz alan bir tekniktir. Ado.Net 2.0 ile, toplu güncelleştirme işlemlerine daha fazla fonksiyonellik kazandırılmıştır. Bu koşul elbetteki toplu güncelleştirme işlemlerini destekeleyen veritabanı sunucuları üzerinde geçerli olmaktadır. Şu an için, yönetimsel kodda yer alan Oracle ve Sql nesnelerinin desteklediği bu fonksiyonelliği kazanmak için aşağıda prototipi verilen ve SqlDataAdapter yada OracleDataAdapter sınıflarına ait olan, UpdateBatchSize özelliği kullanılmaktadır.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Toplu g&amp;uuml;ncelleştirme işlemleri, birden fazla sql ifadesinin (insert,update,delete,select gibi) arka arkaya gelecek şekilde ancak tek bir seferde &amp;ccedil;alıştırılmasını baz alan bir tekniktir. Ado.Net 2.0 ile, toplu g&amp;uuml;ncelleştirme işlemlerine daha fazla fonksiyonellik kazandırılmıştır. Bu koşul elbetteki toplu g&amp;uuml;ncelleştirme işlemlerini destekeleyen veritabanı sunucuları &amp;uuml;zerinde ge&amp;ccedil;erli olmaktadır. Şu an i&amp;ccedil;in, y&amp;ouml;netimsel kodda yer alan Oracle ve Sql nesnelerinin desteklediği bu fonksiyonelliği kazanmak i&amp;ccedil;in aşağıda prototipi verilen ve SqlDataAdapter yada OracleDataAdapter sınıflarına ait olan, UpdateBatchSize &amp;ouml;zelliği kullanılmaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public override int UpdateBatchSize {get;set;}&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;zellik bir anlamda, DataAdapter nesnesinin Update komutu ile veritabanına doğru yapılacak g&amp;uuml;ncelleme işlemlerinin toplu olarak hangi periyotta ger&amp;ccedil;ekleştirileceğini belirtir. &amp;Ouml;rneğin, 1 varsayılan değeridir ve her bir g&amp;uuml;ncelleme işleminin (insert,update veya delete) her satır i&amp;ccedil;in ayrı ayrı yapılacağını belirtir. Daha derin d&amp;uuml;ş&amp;uuml;necek olursa, &amp;ouml;rneğin Sql Sunucusunda yer alan sp_executesql stored procedure' &amp;uuml;n&amp;uuml;n her bir satır i&amp;ccedil;in birer kez ilgili komutu (Insert gibi) &amp;ccedil;alıştıracağını belirtir.&lt;/p&gt;
&lt;p&gt;Diğer yandan, bu &amp;ouml;zelliğe 0 değerini verdiğimizde t&amp;uuml;m g&amp;uuml;ncelleme işlemleri tek bir seferde ger&amp;ccedil;ekleştirilir. Bir başka deyişle veritabanına doğru n sayıda g&amp;uuml;ncelleme işlemi varsa, Sql Sunucusunda yer alan sp_executesql stored procedure' &amp;uuml; bu n sayıdaki işlemleri i&amp;ccedil;eren toplu bir komut k&amp;uuml;mesini tek bir seferde &amp;ccedil;alıştırılacaktır. Ayrıca UpdateBatchSize &amp;ouml;zelliğine 0 ve 1 haricinde verilecek olan pozitif değerler, her bir toplu g&amp;uuml;ncelleştirme işleminin ka&amp;ccedil; i&amp;ccedil; komut i&amp;ccedil;ereceğini belirtmektedir. Konuyu daha kolay bir şekilde anlayabilmek i&amp;ccedil;in basit bir Console uygulması geliştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;#region Using directives

using System;
using System.Collections.Generic;
using System.Text;
using System.Data;
using System.Data.SqlClient;

#endregion

namespace BatchUpdates
{
    class Program
    {
        static void Main(string[] args)
        {
            SqlConnection con = new SqlConnection("data source=localhost;initial catalog=AdventureWorks;integrated security=SSPI");
            SqlDataAdapter da = new SqlDataAdapter("SELECT * FROM MailList", con);
            DataTable dt = new DataTable();
            da.Fill(dt);

            DataRow dr;
            for (int i = 1; i &amp;lt;= 5; i++)
            {
                dr = dt.NewRow();
                dr["AD"] = "AD_" + i.ToString();
                dr["SOYAD"] = "SOYAD_" + i.ToString();
                dr["MAIL"] = "MAIL_" + i.ToString();
                dt.Rows.Add(dr);
            }
            da.UpdateBatchSize = 1;
            SqlCommandBuilder cm = new SqlCommandBuilder(da);
            da.Update(dt);
            Console.WriteLine("İŞLEMLERİN SONU");
            Console.ReadLine();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu uygulamada Ado.Net 1.1 ile yapabildiğimiz işlemlerden farklı bir şey yoktur. Yukon &amp;uuml;zerinde yer alan MailList tablomuza SqlDataAdapter nesnesi vasıtasıyla 5 adet satır giriyoruz. Bizim i&amp;ccedil;in &amp;ouml;nemli olan UpdateBatchSize değerinin 1 olarak belirtilmesidir. Uygulamamızı &amp;ccedil;alıştırmadan &amp;ouml;nce, Sql Profiler aracını kullanarak yeni bir Trace başlatalım ve Sql Sunucumuzda ger&amp;ccedil;ekleşen işlemleri izlemeye &amp;ccedil;alışalım. Trace' imiz &amp;ccedil;alışırken uygulmamamızı y&amp;uuml;r&amp;uuml;tecek olursak, Sql Sunucusu &amp;uuml;zerinde aşağıdaki olayların ger&amp;ccedil;ekleştirildiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk94_1.gif" alt="" width="637" height="492" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. UpdateBatchSize değeri 1 olduğunda.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edecek olursanız, sp_executesql stored procedure' &amp;uuml; girilen her satır i&amp;ccedil;in insert komutunu birer kez &amp;ccedil;alıştırmıştır. Bunun nedeni UpdateBatchSize &amp;ouml;zelliğinin 1 değerine sahip olmasıdır. Eğer bu değeri 0 yapıp tekrar &amp;ccedil;alıştırırsak, bu takdirde ka&amp;ccedil; satır girersek girerlim t&amp;uuml;m satırlar i&amp;ccedil;in ge&amp;ccedil;erli olan insert komutları tek bir toplu-komut olarak işlenecek ve tek bir seferde &amp;ccedil;alıştırılacaktır. &amp;Ouml;rnek olarak, d&amp;ouml;ng&amp;uuml;m&amp;uuml;z&amp;uuml;n değerini 20 satır insert edilecek şekilde ayarladığımızı d&amp;uuml;ş&amp;uuml;n&amp;uuml;rsek, UpdateBatchSize &amp;ouml;zelliğine 0 değerini vermek ile, 20 satır i&amp;ccedil;in parametre alacak tek bir stored procedure' &amp;uuml; &amp;ccedil;ağırmış oluruz. Uygulamamızda bu kez t&amp;uuml;m satırları update ettiğimizi d&amp;uuml;ş&amp;uuml;nelim ve UpdateBatchSize &amp;ouml;zelliğine 0 değerini verelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;for (int i = 0; i &amp;lt; dt.Rows.Count; i++)
{
    dr = dt.Rows[i];
    dr["AD"] ="_DEGISTI";
}

da.UpdateBatchSize = 0;&lt;/pre&gt;
&lt;p&gt;Şimdi Sql Profiler' da Trace' imizdeki işlemlere bakacak olursa, ka&amp;ccedil; satır g&amp;uuml;ncellenmiş ise her bir satır i&amp;ccedil;in yapılan update işlemlerinin tek bir toplu-komut k&amp;uuml;mesinde ger&amp;ccedil;ekleştirildiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk94_2.gif" alt="" width="443" height="558" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. UpdateBatchSize &amp;ouml;zelliğine 0 değeri verildiğinde.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Elbette daha &amp;ouml;nceden bahsettiğimiz gibi UpdateBatchSize &amp;ouml;zelliğine 0 ve 1 haricinde pozitif değerlerde verebiliriz. Bu durumda toplu-komut k&amp;uuml;meleri belirtilen sayı kadar i&amp;ccedil; komut i&amp;ccedil;erecektir. &amp;Ouml;rneğimizde, UpdateBatchSize değerini 7 yaparsak, her bir sp_executesql &amp;ccedil;ağrısında, i&amp;ccedil;sel olarak 7 satırlık işlem i&amp;ccedil;eren toplu-komut k&amp;uuml;meleri olduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;table id="table4" style="width: 100%;" border="0" cellspacing="0" cellpadding="5" bgcolor="#cccccc"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;da.&lt;strong&gt;UpdateBatchSize = 7;&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;img src="/makale/images/mk94_3.gif" alt="" width="630" height="538" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. UpdateBatchSize değerini pozitif her hangibir sayı olarak belirlediğimizde.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneklerdende g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, Ado.Net 2.0 toplu-komut g&amp;uuml;ncelleme işlemlerine daha fazla fonkisyonellik katmak amacıyla kullanışlı bir &amp;ouml;zellik kazanmıştır. Bazı durumlarda, g&amp;uuml;ncelleme işlemlerinin bağlantısız katmandan, veritabanına doğru olan hareketlerinde toplu olarak yapılması network trafiğini olumlu y&amp;ouml;nde etkileyecek bir gelişmedir. &amp;Ccedil;&amp;uuml;nk&amp;uuml;, t&amp;uuml;m g&amp;uuml;ncelleme hareketleri i&amp;ccedil;in veritabanına doğru sadece tek bir tur atılacaktır. Elbetteki devasa boyutlara sahip olan veri kaynakları &amp;uuml;zerinde yapılacak b&amp;uuml;y&amp;uuml;k &amp;ccedil;aplı g&amp;uuml;ncelleme işlemlerinde, toplu-komut k&amp;uuml;melerini belirli sayılarda komut i&amp;ccedil;erecek şekilde ayarlamakta performans a&amp;ccedil;ısından olumlu bir etki yaratacaktır.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, kısaca toplu-g&amp;uuml;ncelleştirme (Batch-Update) işlemlerine değinmeye &amp;ccedil;alıştık. İlerleyen makalelerimizde, Ado.Net 2.0' ın yeni &amp;ouml;zelliklerine bakmaya devam edeceğiz. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-09-18 12:00:00</pubDate>
  <slug>Ado-Net-2-0-ve-Toplu-Guncelleme-Islemleri-(Batch-Updates)-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet-20</tag>
    <tag>mars</tag>
    <tag>multiple-active-result-sets</tag>
  </tags>
  <categories>
    <category>Ado.net 2.0</category>
  </categories>
</post>