<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Project Lighthouse Social</title>
  <description>Project Lighthouse Social, C# ile uçtan uca bir Web projesi geliştirilme serüvenidir. Konu, dünya üzerindeki deniz fenerlerine ait fotoğrafların paylaşıldığı, yorumlandığı ve puanlandığı bir sosyal platform hazırlamaktır. Projede mümkün mertebe yazılım dünyasının efsane konularına olan ihtiyaçları ortaya koymaya çalışmak ilk amaçlarımdan birisidir. Örneğin, hiçbir mimari kalıba uymadan sadece belli prensipleri (soyutlamalar, bağımlılıkları tersine çevirme, sorumlulukları dağıtma vs gibi) baz alarak bir proje iskeleti oluşturup, sonrasında sorularla yaklaşımın doğruluğunu değerlendirmek, açık noktaları tespit etmek ve standartlaşmış bir mimari kalıba çevirmek gibi.</description>
  <content>&lt;p&gt;&lt;strong&gt;Project Lighthouse Social&lt;/strong&gt;,&amp;nbsp;C# ile u&amp;ccedil;tan uca bir web projesinin geliştirilme ser&amp;uuml;venidir. Konu, d&amp;uuml;nya &amp;uuml;zerindeki deniz fenerlerine ait fotoğrafların paylaşıldığı, yorumlandığı ve puanlandığı bir sosyal platform yazmaktır. Projede m&amp;uuml;mk&amp;uuml;n mertebe yazılım d&amp;uuml;nyasının efsane konularına olan ihtiya&amp;ccedil;ları ortaya koymaya &amp;ccedil;alışmak ilk ama&amp;ccedil;larımdan birisidir. &amp;Ouml;rneğin, hi&amp;ccedil;bir mimari kalıba uymadan sadece belli prensipleri &lt;em&gt;(t&amp;uuml;retmeler, bağımlılıkları tersine &amp;ccedil;evirme, sorumlulukları dağıtma vs gibi)&lt;/em&gt; baz alarak bir proje iskeleti oluşturup sonrasında sorularla yaklaşımın doğruluğunu değerlendirmek, a&amp;ccedil;ık noktaları tespit etmek ve standartlaşmış bir mimari kalıba &amp;ccedil;evirmek gibi.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Seriye ait anlatımlara &lt;a href="https://youtube.com/playlist?list=PLY-17mI_rla6Kt-Ri6nP1pE62ZyE-6wjS&amp;amp;si=YGd-iBIwZGLIAZBM" target="_blank"&gt;youtube &amp;uuml;zerinden&lt;/a&gt; erişebilirsiniz. Seri boyunca işlenen kodlar &lt;a href="https://github.com/buraksenyurt/project-lighthouse-social" target="_blank"&gt;github reposuna&lt;/a&gt; da d&amp;uuml;zenli olarak aktarılmaktadır.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;iframe title="YouTube video player" src="https://www.youtube.com/embed/videoseries?si=qoRkhusjH1q1zxSe&amp;amp;list=PLY-17mI_rla6Kt-Ri6nP1pE62ZyE-6wjS" width="560" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;G&amp;uuml;n&amp;uuml;m&amp;uuml;zde&amp;nbsp;yapay zeka&amp;nbsp;kodlama ara&amp;ccedil;larının gelişimi ortada olan bir ger&amp;ccedil;ek. Bir g&amp;uuml;n Claude Sonnet muazzam işler yaparken bir bakmışsınız ertesi g&amp;uuml;n GPT bir adım &amp;ouml;ne &amp;ccedil;ıkmış, derken aralarından Gemini sıyrılmaya kalkmış. Artık bir solution'ı kolayca yorumluyor, defolarını &amp;ccedil;ıkartıyor, iyileştirme noktaları &amp;ouml;neriyor ve hatta uygulayabiliyorlar. Yakın zamanda belki de en iyi yazılım mimarlarından dahi daha iyi &amp;ccedil;&amp;ouml;z&amp;uuml;m iskeletleri oluşturacak ve hatta var olan mimarileri evrimleştirip yenilerini karşımıza &amp;ccedil;ıkaracaklar.&amp;nbsp;Giderek daha az sa&amp;ccedil;maladıkları da aşikar. Oysa ki programcıyı programcı yapan şey yaptığı hatalardan edindiği tecr&amp;uuml;belerdir. İşte bu &amp;ccedil;alışmada kasıtlı veya kasıtsız hatalar yapıp, insanların neden yazılım mimarilerine ihtiya&amp;ccedil; duyduklarını neden birtakım prensipler geliştirdiklerini ortaya koymaya &amp;ccedil;alışacağız. Teknik bor&amp;ccedil;tan basedeceğiz, farklı sistemleri &lt;em&gt;(Redis, MinIO, Vault, RabbitMQ, KeyCloack, Postgresql vb)&lt;/em&gt; entegre edip,&amp;nbsp;birim testler yazacağız. AI tabanlı web api'lerden hizmet alıp, performans odaklı k&amp;uuml;t&amp;uuml;phaneler geliştireceğiz. En başından beri beni heyecanlandıran bu projenin biraz da konusu ve genel &amp;ouml;zelliklerinden bahsedelim.&lt;/p&gt;
&lt;h2&gt;Proje Konusu&lt;/h2&gt;
&lt;p&gt;Deniz Feneri ve fotoğraf meraklıları i&amp;ccedil;in bir sosyal paylaşım platformu geliştirmek.&lt;/p&gt;
&lt;h2&gt;Projenin Genel &amp;Ouml;zellikleri&lt;/h2&gt;
&lt;ul&gt;
&lt;li&gt;Platform&amp;nbsp;&amp;uuml;yeleri &amp;ccedil;ektikleri deniz feneri fotoğraflarını paylaşabilirler.&lt;/li&gt;
&lt;li&gt;&amp;Uuml;yeler&amp;nbsp;d&amp;uuml;nyanın d&amp;ouml;rt bir yanında yer alan deniz fenerleri hakkında kapsamlı ve detaylı bilgiler &amp;ouml;ğrenebilirler.&lt;/li&gt;
&lt;li&gt;Platform &amp;uuml;yeleri deniz feneri fotoğraflarına yorum bırakabilir ve puanlayabilirler.&lt;/li&gt;
&lt;/ul&gt;
&lt;h2&gt;Ama&amp;ccedil;lar&lt;/h2&gt;
&lt;p&gt;Bu projeyi geliştirmenin temel ama&amp;ccedil;ları aşağıda listelenmiştir.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;C# ve .Net platformunu &amp;ouml;rnek bir proje geliştirerek tanımak.&lt;/li&gt;
&lt;li&gt;D&amp;uuml;zenli olarak refactoring uygulayıp kodu iyileştirmeye &amp;ccedil;alışmak.&lt;/li&gt;
&lt;li&gt;Temel yazılım prensiplerini keşfetmek, uygulamak ve sorgulamak.&lt;/li&gt;
&lt;li&gt;AI Asistanlarından yararlanmak &lt;em&gt;(minimum &amp;ouml;l&amp;ccedil;&amp;uuml;de)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Yazılım mimarilerinin ihtiya&amp;ccedil;larını fark etmeye &amp;ccedil;alışıp, tartışmak, uygulamak.&lt;/li&gt;
&lt;li&gt;Bol bol d&amp;uuml;ş&amp;uuml;nd&amp;uuml;rmek, sorgulatmak, sabretmek.&lt;/li&gt;
&lt;/ul&gt;
&lt;h2&gt;Zorluklar&amp;nbsp;&lt;/h2&gt;
&lt;p&gt;Projede aşmaya &amp;ccedil;alışacağımız ve kendime misyon edindiğim bir&amp;ccedil;ok zorluk var. &amp;Ouml;zellikle dağıtık mimari sahasına &amp;ccedil;ıkmaya &amp;ccedil;alıştığımız noktada bu zorluklar daha da eğitici olabilirler. İşte bunlardan bazıları.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Kullanıcıların paylaştığı fotoğrafları nasıl ve nerede tutacağız? &lt;em&gt;(Boyut, depolama yeri, yazma/okuma hızları, dağıtık topoloji kullanımları)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Kullanıcı yorumlarının denetlenmesi ve istenmeyen ifadelerin engellenmesi nasıl sağlanır?&lt;/li&gt;
&lt;li&gt;Bir fotoğrafın doğru deniz fenerine ait olduğu nasıl tespit edilir?&lt;/li&gt;
&lt;li&gt;Fotoğraflardaki &amp;ouml;zg&amp;uuml;nl&amp;uuml;ğ&amp;uuml; anlamak i&amp;ccedil;in kategorilendirme veya tag belirleme aşamasında AI ara&amp;ccedil;larından nasıl yararlanılır?&lt;/li&gt;
&lt;li&gt;&amp;Ccedil;ok sayıda kullanıcının farklı lokasyonlardan fotoğraf y&amp;uuml;klemesi halinde fotoğrafın analizi, doğrulanması, sınıflandırılması gibi hizmetlerin sistemin genelini etkilemeden en hızlı şekilde yapılması nasıl sağlanır?&lt;/li&gt;
&lt;li&gt;&amp;Ccedil;&amp;ouml;z&amp;uuml;me dahil olan harici servislerin oluşturacağı dağıtık sistemde kaotik durumların &amp;ouml;n&amp;uuml;ne nasıl ge&amp;ccedil;ilir, sistemin dayanıklılığı nasıl sağlanır?&lt;/li&gt;
&lt;/ul&gt;
&lt;h2&gt;Bu &amp;Ccedil;alışma Kimlere G&amp;ouml;re&lt;/h2&gt;
&lt;p&gt;Sık gelen sorulardan birisi de bu seriden yararlanmak isteyenlerin neleri bilmesi gerektiği y&amp;ouml;n&amp;uuml;nde.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Minimum Profil;&lt;/strong&gt;
&lt;ul&gt;
&lt;li&gt;Temel seviyede C# ile programlama bilgisine sahiptir.&lt;/li&gt;
&lt;li&gt;Temel seviyede Nesne Y&amp;ouml;nelimli Programlama (Object Oriented Programming) bilgisi vardır.&lt;/li&gt;
&lt;li&gt;Temiz kod kavramı ve standartları hakkında farkındalık sahibidir.&lt;/li&gt;
&lt;li&gt;Doğrudan uygulamak yerine, sorgular, araştırır, ikna olur ve sonra uygular.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;İdeal Profil;&lt;/strong&gt;
&lt;ul&gt;
&lt;li&gt;SOLID prensiplerini sorgular.&lt;/li&gt;
&lt;li&gt;Teknik Bor&amp;ccedil; ile m&amp;uuml;cadele y&amp;ouml;ntemleri hakkında fikir sahibidir.&lt;/li&gt;
&lt;li&gt;Yazılım mimarilerine meraklıdır.&lt;/li&gt;
&lt;li&gt;Kendi sistemlerinde docker kullanır.&lt;/li&gt;
&lt;li&gt;Web Api dışında farklı servis geliştirme standartları olduğunu bilir.&lt;/li&gt;
&lt;li&gt;Dağıtık sistemlerin zorluklarına aşinadır.&lt;/li&gt;
&lt;li&gt;Doğrudan uygulamak yerine, sorgular, araştırır, ikna olur ve sonra uygular.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Umarım izleyenler ve repoyu takip edenler i&amp;ccedil;in hem motivasyon artırıcı hem de ilham verici bir &amp;ccedil;alışma olur. Başka bir &amp;ccedil;alışma tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;</content>
  <pubDate>2025-08-12 08:00:00</pubDate>
  <slug>project-lighthouse-social</slug>
  <tags />
  <categories>
    <category>C#</category>
  </categories>
</post>