<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Blockchain Eliptik Eğri Şifreleme Algoritması</title>
  <description>Blockchain ve onu baz alarak günümüzün popüler ilgi alanlarından birisi haline gelen BitCoin, kriptolamada Elliptic Curve Cryptography(ECC) olarak adlandırılan bir algoritmayı kullanmakta. Bu yazımızda temel matematik bilgilerimizi işin içerisine katıp, Fermat'nın Little Therorem'ine uğrayacak, Modüler aritmetik'ten yararlanıp, grup kavramı ve eliptik eğriler üzerinden geçerek algoritmanın temel dayanak noktalarını öğrenmeye çalışacağız.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/02/ecc_intro.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Matematik tek evresenl dil olarak varoluşumuzdan bu yana yaşamın i&amp;ccedil;erisinde. Onun diğer bilimlere olan pozitif etkisi tartışılamaz. Bug&amp;uuml;n ulaştığımız noktada teknoloji sınırlarını zorlarken y&amp;uuml;z yıllar &amp;ouml;ncesinden ispat edilmiş pek &amp;ccedil;ok teoremin uygulanabilirliklerine de rastlıyoruz. Doğruyu s&amp;ouml;ylemek gerekrise 1999 yılında ilk işe başladığımdan beri matematik'ten epey uzakta sadece kod yazmaktayım. Belki de bug&amp;uuml;n .Net Core'un Linux &amp;uuml;zerinde koşturulup bir Cloud platformuna taşınması da &amp;ouml;nemli bir mevzu. Lakin o hayranlık duyduğumuz&amp;nbsp;fikirlerin arkasında, &amp;ccedil;ok fazla ilişmediğimiz&lt;em&gt;(belki de bakmaya korktuğumuz)&lt;/em&gt; g&amp;uuml;&amp;ccedil;l&amp;uuml; bir matematik var. Bende b&amp;uuml;y&amp;uuml;k bir cesaretle o fikirlerden birisinin arkasında olan matematiği bir nebze olsun anlamak istedim. Matematik kesin kuralları olan bir dil olduğu i&amp;ccedil;i, yazdığım şeyleri doğru telaf&amp;uuml;z etmem gerekiyor. Eğer basit bir şekilde anlatabilirsem, konuyu da anlamış sayılırm&lt;em&gt;(Son g&amp;uuml;n notu: Basitleştiremedi)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;tiğimiz iki hafta boyunca neredeyse her g&amp;uuml;n yarım saatimi ayırdığım ve anlamak i&amp;ccedil;in &amp;ccedil;aba sarf ettiğim bir konu oldu. Blockchain'in kullandığı&amp;nbsp;Elliptic Curve Cryptography(ECC) algoritmasının nasıl &amp;ccedil;alıştığını &amp;ouml;ğrenmek. Araştırmalarıma başladığımda olayın i&amp;ccedil;erisinde matematiğin bilgisayar şifreleme teknikleri &amp;uuml;zerine kullanılan bir &amp;ccedil;ok teorisine denk geldim. 1993 yılında girdiğim Matematik M&amp;uuml;hendisliği b&amp;ouml;l&amp;uuml;m&amp;uuml;nde okurken g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m pek &amp;ccedil;ok konu burada da yer alıyordu. Ama zaman i&amp;ccedil;erisinde hepsini unutmuşum. İkinci ve &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; dereceden denklemler, eliptik eğriler, asal sayılar, gruplar, sonlu alanlar&lt;em&gt;(Finite Fields)&lt;/em&gt;, Fermat'nın k&amp;uuml;&amp;ccedil;&amp;uuml;k teoremi&lt;em&gt;(Little Theorem)&lt;/em&gt;, mod&amp;uuml;ler aritmetik, ayrık logaritma problemi&lt;em&gt;(discrete logarithm problem), &lt;/em&gt;double and add algoritması, euclid&amp;nbsp;vs... Aslında her şey Blockchain sisteminde yer alan eliptik eğri denklemine ait grafik g&amp;ouml;sterimin, ger&amp;ccedil;ek sayılar ile ifade edileninden &amp;ccedil;ok daha farklı olduğunu &amp;ouml;ğrenmemle başladı diyebilirim.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin Bitcoin, secp256k1 isimli ve aşağıdaki eşitlikle ifade edilen eliptik eğri denklemini kullanmakta. secp256k1' deki sec, Standards for Efficent Cryptography anlamına gelirken 256 değeri asal sayının ka&amp;ccedil; bit olduğunu ifade etmektedir. Sonlara doğru bu kavramları anlayacağım/anlatabileceğim diye umut ediyorum.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;y&lt;sup&gt;2&lt;/sup&gt;=x&lt;sup&gt;3&lt;/sup&gt;+7&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Ger&amp;ccedil;ek sayılar i&amp;ccedil;in olan g&amp;ouml;sterimi ş&amp;ouml;yle;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/ecc_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Toplam eleman sayısı asal olacak şekilde oluşturulmuş bir sonlu&amp;nbsp;alan dizilimi&amp;nbsp;i&amp;ccedil;in olan g&amp;ouml;sterimi ise şu şekilde;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/ecc_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Merak uyandırdı değil mi? &amp;Ouml;yleyse ilk konumuz ile başlayalım.&lt;/p&gt;
&lt;h1&gt;Eliptik Eğriler&lt;/h1&gt;
&lt;p&gt;Eliptik eğri denklemlerine ge&amp;ccedil;meden &amp;ouml;nce bir ka&amp;ccedil; basit denklemi de hatırlamamız lazım. Doğrusal, ikinci dereceden ve &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; dereceden denklemleri ve x,y d&amp;uuml;zlemindeki g&amp;ouml;sterimlerini g&amp;ouml;r&amp;uuml;nce sizler de hatırlayacaksınız?&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;y=ax+b , doğru denklemi&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/ecc_4n.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;y=ax&lt;sup&gt;2&lt;/sup&gt;+bx+c , parabol denklemi&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/ecc_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;y=ax&lt;sup&gt;3&lt;/sup&gt;+bx&lt;sup&gt;2&lt;/sup&gt;+cx+d , 3nc&amp;uuml; dereceden denklem&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/ecc_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve tabii konumuz olan eliptik eğri denklemi.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;y&lt;sup&gt;2&lt;/sup&gt;=x&lt;sup&gt;3&lt;/sup&gt;+ax+b&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/ecc_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Yukarıdaki şekilde&amp;nbsp;denkleme ait bir ka&amp;ccedil; farklı &amp;ouml;rnek g&amp;ouml;rmektesiniz. Her ne kadar ben &amp;ccedil;ok iyi &amp;ccedil;izemesemde, &amp;ouml;zellikle x ekseni &amp;ouml;zelinde simetriklik olduğunu s&amp;ouml;yleyebiliriz. Bazı&amp;nbsp;hallerde iki ayrı eğri ve bazı&amp;nbsp;hallerde de bu iki eğrinin birleştiği grafikler s&amp;ouml;z konusu.&amp;nbsp;&lt;strong&gt;y&lt;sup&gt;2&lt;/sup&gt;&lt;/strong&gt;&amp;nbsp;den kaynaklı bir durum olduğu aşikar. Eliptik eğrilerin enteresan bir &amp;ouml;zelliği de vardır. Eğri &amp;uuml;zerinde olduğu bilinen iki koordinat s&amp;ouml;z konusu olduğunda, bu koordinatların x değerleri birbirinden farklı olmak şartıyla, her iki koordinatın toplamından yine eğri &amp;uuml;zerine denk d&amp;uuml;şen 3nc&amp;uuml; bir koordinatı bulmamız m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bulunuş şekli matematik severler i&amp;ccedil;in hayranlık uyandırıcıdır. Aşağıdaki şekille konuyu anlatmaya &amp;ccedil;alışayım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/ecc_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şekilde M&lt;sub&gt;3&amp;nbsp;&lt;/sub&gt;noktasını bulunuşu ifade edilmektedir. Olay ş&amp;ouml;yle başlar. Eğri &amp;uuml;zerinden bilinen iki nokta referans alınır. x değerleri birbirlerinden farklı olan iki nokta. Bu noktaların &amp;uuml;st&amp;uuml;nden ge&amp;ccedil;en bir doğru &amp;ccedil;izilir. &amp;Ccedil;izilen doğru eğriyi 3nc&amp;uuml; bir noktada daha kesecektir&lt;em&gt;(&amp;ouml;rneğimizdeki P noktası)&lt;/em&gt; Bu noktanın iz d&amp;uuml;ş&amp;uuml;m&amp;uuml; de simetrik taraftaki bir noktaya denk gelmektedir&lt;em&gt;(&amp;ouml;rneğimizdeki M&lt;sub&gt;3&lt;/sub&gt;)&lt;/em&gt; İşte teoriye g&amp;ouml;re M&lt;sub&gt;1&lt;/sub&gt; ve M&lt;sub&gt;2&lt;/sub&gt;&amp;nbsp;noktalarının toplamı M&lt;sub&gt;3&lt;/sub&gt;&amp;nbsp;noktasını elde etmemizi sağlamaktadır. Tabii toplam dediğimiz olay biraz daha farklı. Noktayı bulmak i&amp;ccedil;in aşağıdaki gibi sıralanmış bir form&amp;uuml;l takımından yararlanılır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;3nc&amp;uuml; noktanın bulunmasında ilk iki noktanın sıralı olması şart değildir. Sadece eğri &amp;uuml;zerinde olduğu bilinen iki noktanın &amp;uuml;zerinden ge&amp;ccedil;en doğrunun kestiği &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; noktanın x d&amp;uuml;zlemindeki iz d&amp;uuml;ş&amp;uuml;m&amp;uuml; &amp;ouml;nemlidir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Eğri denklemimiz :&amp;nbsp;&lt;strong&gt;y&lt;sup&gt;2&amp;nbsp;&lt;/sup&gt;= x&lt;sup&gt;3&amp;nbsp;&lt;/sup&gt;+ ax + b&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;M1 = (x1,y1) , M2 = (x2,y2), M1 + M2 = (x3,y3)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;x1 ve x2 eşit olmadığı s&amp;uuml;rece&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Eğim &lt;strong&gt;s&amp;nbsp;= (y&lt;sub&gt;2&lt;/sub&gt;&amp;nbsp;- y&lt;sub&gt;1&lt;/sub&gt;) / (x&lt;sub&gt;2&lt;/sub&gt;&amp;nbsp;- x&lt;sub&gt;1&lt;/sub&gt;)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;x&lt;sub&gt;3&lt;/sub&gt;&amp;nbsp;= s&lt;strong&gt;&lt;sup&gt;2&lt;/sup&gt;&lt;/strong&gt;&lt;sup&gt;&amp;nbsp;&lt;/sup&gt;- &lt;strong&gt;x&lt;sub&gt;2&lt;/sub&gt;&amp;nbsp;- x&lt;sub&gt;1&lt;/sub&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;y&lt;sub&gt;3&lt;/sub&gt;&amp;nbsp;= s(x&lt;sub&gt;1&lt;/sub&gt;&amp;nbsp;- x&lt;sub&gt;3&lt;/sub&gt;) - y&lt;sub&gt;1&lt;/sub&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Kafamızı &amp;ccedil;ok fazla bulandırmadan 3nc&amp;uuml; nokta bulmanın nasıl yapıldığını basit bir &amp;ouml;rnekle&amp;nbsp;inceleyelim.&lt;/p&gt;
&lt;p&gt;y&lt;sup&gt;2&lt;/sup&gt;=x&lt;sup&gt;3&lt;/sup&gt;+5x+7&lt;br /&gt;P&lt;sub&gt;1&lt;/sub&gt;&amp;nbsp;= (2,5) , P&lt;sub&gt;2&lt;/sub&gt;&amp;nbsp;= (3,7) =&amp;gt;&amp;nbsp;P&lt;sub&gt;3&lt;/sub&gt;&amp;nbsp;=&amp;nbsp;?&lt;br /&gt;&lt;br /&gt;5&lt;sup&gt;2&lt;/sup&gt;= 25 = 2&lt;sup&gt;3&lt;/sup&gt;+(5*2)+7 &lt;em&gt;(P&lt;sub&gt;1&lt;/sub&gt;&amp;nbsp;noktası eğri &amp;uuml;zerinde)&lt;/em&gt;&lt;br /&gt;7&lt;sup&gt;2&lt;/sup&gt;= 49 = 3&lt;sup&gt;3&lt;/sup&gt;+(5*3)+7 &lt;em&gt;(P&lt;sub&gt;2&lt;/sub&gt;&amp;nbsp;noktası eğri &amp;uuml;zerinde)&lt;br /&gt;&lt;/em&gt;&lt;br /&gt;s = (7 - 5) / (3 - 2) = 2 &lt;em&gt;(Eğimi bulduk)&lt;/em&gt;&lt;br /&gt;x&lt;sub&gt;3&lt;/sub&gt;&amp;nbsp;= 2&lt;sup&gt;2&lt;/sup&gt;&lt;sup&gt;&amp;nbsp;&lt;/sup&gt;-&amp;nbsp;2&amp;nbsp;- 3&amp;nbsp;= -1&lt;br /&gt;y&lt;sub&gt;3&lt;/sub&gt;&amp;nbsp;= 2(2&amp;nbsp;- (-1) ) - 5 = -1&lt;br /&gt;&lt;br /&gt;P&lt;sub&gt;3&lt;/sub&gt;&amp;nbsp;= (-1,1)&amp;nbsp;&lt;br /&gt;1&lt;sup&gt;2&lt;/sup&gt;= 1 = -1&lt;sup&gt;3&lt;/sup&gt;+(5*(-1))+7 &lt;em&gt;(P&lt;sub&gt;3&lt;/sub&gt;&amp;nbsp;noktası eğri &amp;uuml;zerinde)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdi &amp;ouml;rnekte neler oldu anlamaya &amp;ccedil;alışalım. Denklem ortada. İki tane noktamız var. &amp;Ouml;ncelikle bu noktaların eğri &amp;uuml;zerinde olup olmadıklarının sağlamasını yapıyoruz&lt;em&gt;.&amp;nbsp;&lt;/em&gt;Sonrasında eğim değerini(s) bulmamız gerekiyor. Eğim bulunduktan sonra bu değerden yararlanarak x&lt;sub&gt;3&lt;/sub&gt;&amp;nbsp;bilinmeyenini ve x&lt;sub&gt;3&lt;/sub&gt;'&amp;uuml; de işin i&amp;ccedil;erisine katarak y&lt;sub&gt;3&lt;/sub&gt; değerini hesaplıyor&amp;nbsp; ve 3nc&amp;uuml; noktanın koordinatlarını bulmuş oluyoruz. Son aşamada yine x&lt;sub&gt;3&lt;/sub&gt;,y&lt;sub&gt;3&lt;/sub&gt;&amp;nbsp;noktasının eliptik eğri &amp;uuml;zerinde olup olmadığının sağlamasını ger&amp;ccedil;ekleştiriyoruz. Bunu program kodu ile de deneyimleyebiliriz. &amp;Ouml;zellikle Python gibi diller bu tip matematiksel işlemler i&amp;ccedil;in kolaylıklar sunmakta.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;p1=(2,5)
p2=(3,7)

def isOnCurve(p):
    """    
    p1 egri ustunde mi bakalim
    """
    (x,y)=p1
    return y**2 == x**3+(5*x)+7

def findSlope(p1,p2):
    """
    p1 ve p2den yararlanarak egimi buluyoruz
    """
    (x1,y1)=p1
    (x2,y2)=p2
    s=(y2-y1)/(x2-x1)
    return s

def findThirdPoint(p1,p2,s):
    """
    p1 ve p2den yararlanip 3ncu noktanin bulunmasi
    """
    (x1,y1)=p1
    (x2,y2)=p2
    x3=s**2-x2-x1
    y3=s*(x1-x3)-y1
    return (x3,y3)

print p1,"is on curve?",isOnCurve(p1)
print p2,"is on curve?",isOnCurve(p2)
print findSlope(p1,p2)
print findThirdPoint(p1,p2,findSlope(p1,p2))&lt;/pre&gt;
&lt;p&gt;Python tarafına aşina olmayanlar i&amp;ccedil;in bile okunması olduk&amp;ccedil;a kolay bir kod par&amp;ccedil;ası g&amp;ouml;rmektesiniz. x,y koordinatlarını işaret eden noktaları tuple tipi ile işaret etmekteyiz. Bu bir noktanın x ve y değerlerini taşırken veya elde ederken işlerimizi kolaylaştırmakta. isOnCurve fonksiyonu parametre olarak verilen noktanın eğri &amp;uuml;zerinde olup olmadığını kontrol ediyor. findSlope metodu ile tahmin edeceğiniz &amp;uuml;zere eğim değerini buluyoruz. findThirdPoint fonksiyonu p1 ve p2 parametrelerinden yararlanılarak p3&amp;uuml;n yani 3nc&amp;uuml; noktanın bulunmasında kullanılmakta. Kodu Visual Studio Code &amp;uuml;zerinde geliştirebilirsiniz. Şahsen ben, &amp;ouml;yle yaptım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/ecc_12.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Eliptik Eğrilerin Gruplar ile İlişkisi&lt;/h1&gt;
&lt;p&gt;Eliptik eğriler ile matematik grupları arasında yakın ilişki vardır. &amp;Ouml;zellikle asallık s&amp;ouml;z konusu ise. Bunları bir eliptik eğri i&amp;ccedil;in d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde şunları s&amp;ouml;yleyebiliriz.&amp;nbsp;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;G'yi&amp;nbsp;noktaların olduğu bir grup olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;rsek iki noktanın toplamı (P&lt;sub&gt;1&lt;/sub&gt;&amp;nbsp;+&amp;nbsp;P&lt;sub&gt;2&lt;/sub&gt;&amp;nbsp;= P&lt;sub&gt;3&lt;/sub&gt;) yine G'nin i&amp;ccedil;inde yer alacaktır&lt;em&gt;(Kapalılık &amp;ouml;zelliği)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;P&lt;sub&gt;1&lt;/sub&gt;&amp;nbsp;+&amp;nbsp;P&lt;sub&gt;2&lt;/sub&gt;&amp;nbsp;+&amp;nbsp;P&lt;sub&gt;3&lt;/sub&gt;&amp;nbsp;= 0&amp;nbsp;aynı hat &amp;uuml;zerinde 3 nokta s&amp;ouml;z konusu olduğunda toplam sonucu 0 olarak &amp;ccedil;ıkar&lt;em&gt;(Tabii noktaların hi&amp;ccedil;birisi 0 olmayacak)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Grubun mutlaka şu eşitliği sağlayan bir birim elemanı vardır ki eliptik eğriler i&amp;ccedil;in 0 olduğunu s&amp;ouml;yleyebiliriz. P&lt;sub&gt;1&lt;/sub&gt;&amp;nbsp;+ 0&amp;nbsp;= 0&amp;nbsp;+&amp;nbsp;P&lt;sub&gt;1&lt;/sub&gt;&amp;nbsp;= P&lt;sub&gt;1&lt;/sub&gt;&lt;/li&gt;
&lt;li&gt;Her bir noktanın x ekseninde bir simetrisi vardır.&amp;nbsp;&lt;/li&gt;
&lt;li&gt;Eğer değişebilirlik ( P&lt;sub&gt;1&lt;/sub&gt;&amp;nbsp;+&amp;nbsp;P&lt;sub&gt;2&lt;/sub&gt;&amp;nbsp;= P&lt;sub&gt;2&lt;/sub&gt;&amp;nbsp;+&amp;nbsp;P&lt;sub&gt;1&lt;/sub&gt;&amp;nbsp;) s&amp;ouml;z konusu ise bu grup Abelian&lt;em&gt;(Değişmeli diyebiliriz)&lt;/em&gt;&amp;nbsp;olarak&amp;nbsp;isimlendirilir&lt;em&gt;(Abelian olmanın avantajları nelerdir halen araştırıyorum sevgili okur)&lt;/em&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Grup olma &amp;ouml;zellikleri biraz sonra kriptografinin zorluğunu ortaya koyarken değer kazancak. Bu nedenle eliptik eğri kriptografisine ge&amp;ccedil;meden &amp;ouml;nce sonlu alanlara, asal sayılar nezninde de uğramamız gerekiyor.&lt;/p&gt;
&lt;h1&gt;Sonlu&amp;nbsp;Alanlar&lt;/h1&gt;
&lt;p&gt;Artık eliptik eğrilerin nasıl bir denklem ile ifade edildiğini biliyoruz. Yazının başında Blockchain tarafından kullanılan denklemin grafiğini hatırlarsanız ger&amp;ccedil;ek sayılar yerine toplam eleman sayısı bir asal sayı ile ifade edilen eliptik eğrinin s&amp;ouml;z konusu olduğunu belirtmiştik. Peki ne olaki bu sonlu alanlar&lt;em&gt;(Finite Fields)&lt;/em&gt; Aşağıdaki gibi ifade edilen bir sayı dizisi olduğunu d&amp;uuml;ş&amp;uuml;nelim&lt;em&gt;(Aslında bizler i&amp;ccedil;in 0dan başlayan 13 elemanlı bir tamsayı dizisi)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;F&lt;sub&gt;13&lt;/sub&gt;&amp;nbsp;= {0, 1, 2, 3, &amp;hellip; 12}&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Bu dizilimin en &amp;ouml;nemli yanı 13 elemandan oluşması. 13&amp;nbsp; asal bir sayı. Dizinin bir diğer &amp;ouml;nemli &amp;ouml;zelliği de &lt;span style="text-decoration: underline;"&gt;mod&amp;uuml;ler aritmetik&lt;/span&gt; denklik kuramına g&amp;ouml;re i&amp;ccedil;erideki iki sayının toplamının yine i&amp;ccedil;erideki bir elemanı veriyor olması. &amp;Uuml;stelik bu sadece toplama değil, &amp;ccedil;ıkarma, &amp;ccedil;arpma ve b&amp;ouml;lme işlemleri i&amp;ccedil;in de ge&amp;ccedil;erli bir durum.&amp;nbsp;Sadece b&amp;ouml;lme işleminde kafaların biraz karışabildiği bir senaryo var ki burada da işin i&amp;ccedil;erisine Fermat'nın K&amp;uuml;&amp;ccedil;&amp;uuml;k Teorim&lt;em&gt;(Fermat's Little Theorem)&lt;/em&gt; girmekte.&lt;/p&gt;
&lt;p&gt;Toplama, &amp;ccedil;ıkartma ve &amp;ccedil;arpma işlemlerine &amp;ouml;rnekler;&lt;/p&gt;
&lt;p&gt;4 + 5 = 9 % 13 = 9 (Dizi i&amp;ccedil;erisinde)&lt;br /&gt;8 + 11 = 19 %13 = 6 (Dizi i&amp;ccedil;erisinde)&lt;br /&gt;8 - 12 = (-4) % 13 = 4 (Dizi i&amp;ccedil;erisinde)&lt;br /&gt;9 - 4 = 5 % 13 = 5 (Dizi i&amp;ccedil;erisinde)&lt;/p&gt;
&lt;p&gt;Gelelim b&amp;ouml;lme işlemine...&lt;/p&gt;
&lt;p&gt;2 / 3 = 2 *&amp;nbsp;3&lt;strong&gt;&lt;sup&gt;-&lt;/sup&gt;&lt;/strong&gt;&lt;sup&gt;1&amp;nbsp;&lt;/sup&gt;= 2 * 3&lt;sup&gt;11&lt;/sup&gt;&lt;sup&gt;&amp;nbsp;&lt;/sup&gt;= 354.294 % 13 = 5 (Dizi i&amp;ccedil;erisinde)&lt;br /&gt;3 / 12 = 3 *&amp;nbsp;12&lt;strong&gt;&lt;sup&gt;-&lt;/sup&gt;&lt;/strong&gt;&lt;sup&gt;1&amp;nbsp;&lt;/sup&gt;= 3 *&amp;nbsp;12&lt;sup&gt;11&amp;nbsp;&lt;/sup&gt;= 2.229.025.112.064 % 13 = 10 (Dizi i&amp;ccedil;erisinde)&lt;/p&gt;
&lt;p&gt;İşlemler biraz tuhaf geldi değil mi? &amp;Ouml;zellike -1&amp;nbsp;&amp;uuml;s değerinin&amp;nbsp;eşitliğin devamında 13-2 şeklinde ifade edilmesi. Burada az &amp;ouml;nce bahsettiğimiz k&amp;uuml;&amp;ccedil;&amp;uuml;k teorimin b&amp;uuml;y&amp;uuml;k bir &amp;ouml;nemi var. Fermat'a g&amp;ouml;re p bir asal sayı, a bir tamsayı ve a ile p aralarında asal&lt;em&gt;(p, a'nın bir &amp;ccedil;arpanı olamaz)&lt;/em&gt; iken&lt;/p&gt;
&lt;p&gt;2&lt;sup&gt;11&amp;nbsp;&lt;/sup&gt;- 2 = 2046 % 11 = 0&amp;nbsp;&lt;/p&gt;
&lt;p&gt;gibi bir işlem'den bahsedilebilir. Mod&amp;uuml;ler aritmetik notasyonuna g&amp;ouml;re ifade şudur.&lt;/p&gt;
&lt;p&gt;a&lt;sup&gt;p&amp;nbsp;&lt;/sup&gt;&amp;equiv; a (mod p)&lt;/p&gt;
&lt;p&gt;Buradan hareketle teoremin ispatı sırasında kullanılan Euler teoremine g&amp;ouml;re de&lt;/p&gt;
&lt;p&gt;a&lt;sup&gt;p-1&amp;nbsp;&lt;/sup&gt;&amp;equiv; 1 (mod p)&lt;/p&gt;
&lt;p&gt;dir. Hen&amp;uuml;z ispatını araştıramamış olsam da bu denkliklerden yola &amp;ccedil;ıkılarak şu ifadenin de doğru olduğu s&amp;ouml;ylenmekte.&lt;/p&gt;
&lt;p&gt;a&lt;sup&gt;p-2&amp;nbsp;&lt;/sup&gt;&amp;equiv;&amp;nbsp;a&lt;sup&gt;-1&amp;nbsp;&lt;/sup&gt;&amp;equiv; 1/a (mod p)&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece bir b&amp;ouml;lme işleminin mod&amp;uuml;ler aritmetik enst&amp;uuml;rmanlarına g&amp;ouml;re yine dizi i&amp;ccedil;erisindeki bir elemanı işaret ettiğini g&amp;ouml;rm&amp;uuml;ş oluyoruz.&lt;/p&gt;
&lt;h1&gt;Eliptik Eğrideki Ayrık Logaritma Problemi&lt;/h1&gt;
&lt;p&gt;Gelelim yukarıda anlattıklarımızı kullanarak neler yapabileceğimize bakmaya. Bir eliptik eğri &amp;uuml;zerinde bir başlangı&amp;ccedil; noktası se&amp;ccedil;tiğimizi d&amp;uuml;ş&amp;uuml;nelim. P olarak isimlendirelim&lt;em&gt;(Sonradan Generator Point adına kavuşacak)&lt;/em&gt; Buna g&amp;ouml;re P'nin 1 katını, 2katını, 3katını ekleyerek devam edelim. Artık elimizde bir nokta grubu var ve onu ş&amp;ouml;yle ifade edebiliriz.&lt;/p&gt;
&lt;p&gt;{0, P, 2P, 3P, 4P, 5P,... (n-1)P}&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;arpan olarak&amp;nbsp;ele alınan n'nin gizli bir anahtar olduğunu d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde her ne kadar sP=Q değerini bulmak kolay olsa da P ve Q'yi bilip s'yi bulmaya &amp;ccedil;alıştığımız durumda bu o kadar da kolay olmayacaktır. &amp;Ccedil;&amp;uuml;nk&amp;uuml; 0 ile n-1 arasındaki t&amp;uuml;m olası değerleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alıp eşitliğin sağlanıp sağlanmadığını anlamamız gerekir.&amp;nbsp;Bunun sebebi ayrık logaritma problemi ile a&amp;ccedil;ıklanmaktadır.&amp;nbsp;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Discrete Logarithm Problem&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Aşağıdaki işlemi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&amp;nbsp;3&lt;sup&gt;29&amp;nbsp;&lt;/sup&gt;mod 17&amp;nbsp;&amp;equiv; 12&lt;/p&gt;
&lt;p&gt;Burada 12 değerine ulaşmak kolay. Fakat soru şu;&lt;/p&gt;
&lt;p&gt;3&lt;sup&gt;x&amp;nbsp;&lt;/sup&gt;mod 17&amp;nbsp;&amp;equiv; 12&lt;/p&gt;
&lt;p&gt;Burada x değerini nasıl bulabiliriz? Aslında 3&amp;uuml;n olası &amp;uuml;slerini taramak s&amp;ouml;z konusu eşitlikteki uygun x değerini bulmak i&amp;ccedil;in yeterli.&amp;nbsp;K&amp;uuml;&amp;ccedil;&amp;uuml;k bir asal sayı i&amp;ccedil;in bu &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k sorun teşkil etmeyecektir. Sorun 17 sayısı yerine &amp;ccedil;ok &amp;ccedil;ok &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k bir asal sayı geldiğinde ortaya &amp;ccedil;ıkmaktadır. Teorikte m&amp;uuml;mk&amp;uuml;n ama pratiğe d&amp;ouml;k&amp;uuml;lmesi i&amp;ccedil;in asal değere g&amp;ouml;re d&amp;uuml;nyadaki işlemci g&amp;uuml;c&amp;uuml;n&amp;uuml;n tamamına sahip olsak bile &amp;ccedil;ok uzun yıllar s&amp;uuml;rebilecek bir problem s&amp;ouml;z konusu&lt;em&gt;(Uzmanların dilinden)&amp;nbsp;&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Tekrar P noktalarından oluşan grubumuza d&amp;ouml;nelim. Buradaki &amp;ccedil;arpan hesaplamaları i&amp;ccedil;in Double and Add&amp;nbsp;algoritmasından yararlanılabilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Double and Add algorithm&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Double and Add algoritmasında noktanın &amp;ccedil;arpanının ikilik sayı sistemindeki ifadesinden yararlanılır. Ş&amp;ouml;yle başlayalım. 19 asal sayısının ikilik sistemdeki karşılğı&amp;nbsp;&lt;/p&gt;
&lt;p&gt;10011&lt;/p&gt;
&lt;p&gt;şeklindedir.&lt;/p&gt;
&lt;p&gt;Bunu &amp;uuml;ssel g&amp;ouml;sterimle ifade etmek istersek&amp;nbsp;şu eşitliği de yazabiliriz.&lt;/p&gt;
&lt;p&gt;19 = 10011 = 1.2&lt;sup&gt;4&lt;/sup&gt;&amp;nbsp;+ 0.2&lt;sup&gt;3&lt;/sup&gt; + 0.2&lt;sup&gt;2&amp;nbsp;&lt;/sup&gt;+ 1.2&lt;sup&gt;1&amp;nbsp;&lt;/sup&gt;+ 1.2&lt;sup&gt;0&amp;nbsp;&lt;/sup&gt;&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re bir noktanın 19 ile &amp;ccedil;arpımını da şu şekilde ifade etmemiz m&amp;uuml;mk&amp;uuml;n hale gelir.&lt;/p&gt;
&lt;p&gt;19P = 2&lt;sup&gt;4&lt;/sup&gt;P + 2&lt;sup&gt;1&lt;/sup&gt;P + 2&lt;sup&gt;0&lt;/sup&gt;P&lt;/p&gt;
&lt;p&gt;Oluşan eşitliğe g&amp;ouml;re Double and Add algoritması ş&amp;ouml;yle işletilir.&lt;/p&gt;
&lt;p&gt;P noktasını al.&lt;/p&gt;
&lt;p&gt;Bunu 2ye katla(double). Bu sayede 2P değerini elde ederiz.&lt;/p&gt;
&lt;p&gt;2P yi P ile topla(add) B&amp;ouml;ylece&amp;nbsp;2&lt;sup&gt;1&lt;/sup&gt;P + 2&lt;sup&gt;0&lt;/sup&gt;P değerini yakalarız.&lt;/p&gt;
&lt;p&gt;...&lt;/p&gt;
&lt;p&gt;Bu şekilde ikiye katlama ve toplama işlemlerinin tekrar edilmesi yoluyla sonuca ulaşabiliriz. Siz &amp;ouml;rneğin 151 sayısı i&amp;ccedil;in bu denkliği sağlamaya &amp;ccedil;alışarak konuyu pekiştirebilirsiniz. İpucu olarak başlangı&amp;ccedil;ı veriyorum;&lt;/p&gt;
&lt;p&gt;151&amp;nbsp;=&amp;nbsp;10010111 = 1.2&lt;sup&gt;7&lt;/sup&gt;&amp;nbsp;+ 0.2&lt;sup&gt;6&lt;/sup&gt;&amp;nbsp;+ 0.2&lt;sup&gt;5&amp;nbsp;&lt;/sup&gt;+ 1.2&lt;sup&gt;4&amp;nbsp;&lt;/sup&gt;+ 0.2&lt;sup&gt;3&amp;nbsp;&lt;/sup&gt;+ 1.2&lt;sup&gt;2&amp;nbsp;&lt;/sup&gt;+ 1.2&lt;sup&gt;1&amp;nbsp;&lt;/sup&gt;+ 1.2&lt;sup&gt;0&amp;nbsp;&lt;/sup&gt;= 2&lt;sup&gt;7&amp;nbsp;&lt;/sup&gt;+ 2&lt;sup&gt;4&amp;nbsp;&lt;/sup&gt;+ 2&lt;sup&gt;2&amp;nbsp;&lt;/sup&gt;+ 2&lt;sup&gt;1&amp;nbsp;&lt;/sup&gt;+2&lt;sup&gt;0&lt;/sup&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bir nokta grubu i&amp;ccedil;in tam sayı ile &amp;ccedil;arpma işlemini ele aldığımıza g&amp;ouml;re P grubu i&amp;ccedil;in ş&amp;ouml;yle bir &amp;ouml;rnek yapalım.&lt;/p&gt;
&lt;p&gt;Denklemimiz&amp;nbsp;&lt;strong&gt;y&lt;sup&gt;2&amp;nbsp;&lt;/sup&gt;= x&lt;sup&gt;3&amp;nbsp;&lt;/sup&gt;+ 2x + 3&lt;br /&gt;&lt;/strong&gt;Sonlu alandaki toplam sayı adedi &lt;strong&gt;17&lt;/strong&gt; (asaldır dikkat edin)&lt;br /&gt;Başlangı&amp;ccedil; noktamız&lt;strong&gt;&amp;nbsp;P(3,6)&lt;br /&gt;&lt;/strong&gt;Buna g&amp;ouml;re P'yi kendisi ile toplaya toplaya aşağıdaki dizilimi elde edebiliriz.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;0P = 0&lt;br /&gt;1P = (3,6)&lt;br /&gt;2P = (12,2)&lt;br /&gt;3P = (15,5)&lt;br /&gt;4p = (14,2)&lt;br /&gt;5P = (8,2)&lt;br /&gt;6P = (8,15)&lt;br /&gt;7P = (14,15)&lt;br /&gt;8P = (15,12)&lt;br /&gt;9P = (12,15)&lt;br /&gt;10P = (3,11)&lt;br /&gt;11P = (&amp;infin;,&amp;infin;)&lt;br /&gt;12P = (3,6)&lt;br /&gt;13P = (12,2)&lt;br /&gt;14P =(15,5)&lt;br /&gt;...&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/ecc_11.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bir şey dikkatinizi &amp;ccedil;ekti mi? Toplamda&amp;nbsp;denklemi sağlayan 22 adet (x,y) noktası s&amp;ouml;z konusu iken biz 11 elemanlı bir alt grup elde ettik ve bu grubun tekrar eden bir d&amp;ouml;ng&amp;uuml; i&amp;ccedil;erisinde olduğunu g&amp;ouml;rmekteyiz.&amp;nbsp;Buradaki hesaplamalar i&amp;ccedil;in aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını da kullanabiliriz. Fonksiyonları ve kullanım şekillerini anlamaya &amp;ccedil;alışın. İ&amp;ccedil;eride bir de uzatılmış Euclid algoritması olarak isimlendirilmiş bir kısım var.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;import collections

EllipticCurve = collections.namedtuple('EliptikEgri', 'name p a b g')

params = EllipticCurve(
    'y^2=x^3+ax+b', #denklem
    p=17, #toplam nokta sayisi
    a=2, #denklem a degeri
    b=3, #denklem b degeri
    g=(3,6) #generator noktasi
)

def ReverseOfMod(n, p):
    """
    n mod p isleminin tersini dondurur.
    egim hesaplamasi isleminde p1 = p2 ve p1 != p2 durumlari icin gerekli
    """
    if n == 0:
        raise ZeroDivisionError('division by zero')

    if n &amp;lt; 0:
        # n ** -1 = p - (-n) ** -1  (mod p)
        return p - ReverseOfMod(-n, p)

    # Uzatilmis Euclid Algoritmasi uygulanir (Extended Euclidean Algorithm)
    s, old_s = 0, 1
    t, old_t = 1, 0
    r, old_r = p, n

    while r != 0:
        d = old_r // r
        old_r, r = r, old_r - d * r
        old_s, s = s, old_s - d * s
        old_t, t = t, old_t - d * t

    gcd, x, y = old_r, old_s, old_t #gcd-greates common divisor - ebob
    return x % p

def FindNegativePoint(p):
    """
    negatif noktayi bulur
    """

    if p is None:
        return None

    x, y = p
    result = (x, -y % params.p)

    return result


def Add(p1, p2):
    """
    grup yasasindaki kriterlere gore p1+p1 islemini gerceklestirir
    """

    if p1 is None:
        # 0 + p2 = p2 durumu
        return p2
    if p2 is None:
        # p1 + 0 = p1 durumu
        return p1

    x1, y1 = p1
    x2, y2 = p2

    if x1 == x2 and y1 != y2:
        return None

    if x1 == x2:
        # p1==p2 durumu
        m = (3 * x1 * x1 + params.a) * ReverseOfMod(2 * y1, params.p)
    else:
        # p1!=p2 durumu
        m = (y1 - y2) * ReverseOfMod(x1 - x2, params.p)

    x3 = m * m - x1 - x2
    y3 = y1 + m * (x3 - x1)
    result = (x3 % params.p,-y3 % params.p)

    return result


def Multiply(n, p):
    """
    n * P islemini gerceklestirir
    """
    if n &amp;lt; 0:
        return Multiply(-n, FindNegativePoint(p))

    result = None
    nextP = p

    while n:
        if n &amp;amp; 1:
            result = Add(result, nextP)

        nextP = Add(nextP, nextP)

        n &amp;gt;&amp;gt;= 1
    return result


for i in range(0,17):
    print i,Multiply(i,(3,6))&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/ecc_13.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Nokta&amp;nbsp;sahası sonlu uzunlukta ve &amp;ccedil;ok doğal olarak alt&amp;nbsp;grup&amp;nbsp;da &amp;ouml;yle. Ancak denklem ve asal sayı değeri dikkatli se&amp;ccedil;ilirse &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k bir grubun elde edilmesi s&amp;ouml;z konusu olabilir. &amp;Ouml;yle ki geri &amp;ccedil;evirlemeye &amp;ccedil;alışıldığında bu inanılmaz derecede zor olur.&lt;/p&gt;
&lt;h1&gt;Bitcoin Cephesi(secp256k1)&lt;/h1&gt;
&lt;p&gt;Onlar Blockchain'in bu kriptografi kuramını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alarak aşağıdaki parametreleri i&amp;ccedil;eren bir eğri tanımlamışlar.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Denklem :&amp;nbsp;&lt;strong&gt;y&lt;sup&gt;2&lt;/sup&gt;=x&lt;sup&gt;3&lt;/sup&gt;+7&lt;br /&gt;&lt;/strong&gt;Sonlu alan asal sayı değeri &lt;strong&gt;(p)&lt;/strong&gt; = 2&lt;sup&gt;256&amp;nbsp;&lt;/sup&gt;-2&lt;sup&gt;32&amp;nbsp;&lt;/sup&gt;-&amp;nbsp;2&lt;sup&gt;9&amp;nbsp;&lt;/sup&gt;-2&lt;sup&gt;8&amp;nbsp;&lt;/sup&gt;-2&lt;sup&gt;7&amp;nbsp;&lt;/sup&gt;-2&lt;sup&gt;6&amp;nbsp;&lt;/sup&gt;-&amp;nbsp;2&lt;sup&gt;4&amp;nbsp;&lt;/sup&gt;- 1&amp;nbsp;&lt;br /&gt;Giriş noktası&lt;strong&gt; G&lt;/strong&gt;=( 79BE667EF9DCBBAC55A06295CE870B07029BFCDB2DCE28D959F2815B16F81798, 483ADA7726A3C4655DA4FBFC0E1108A8FD17B448A68554199C47D08FFB10D4B8 )&lt;br /&gt;Bir gruptaki asal nokta sayısı &lt;strong&gt;n&lt;/strong&gt; = FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFEBAAEDCE6AF48A03BBFD25E8CD0364141&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere nokta ve asal sayı değerleri olduk&amp;ccedil;a b&amp;uuml;y&amp;uuml;k. Bu da ayrık logaritma probleminin getireceği sorunun &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;n&amp;uuml; olduk&amp;ccedil;a zorlaştırır nitelikte. Her şeyden &amp;ouml;nce ortada 256bitlik bir asal sayı var. Bunun bir sonucu da en iyimser tahminle ortada&amp;nbsp;2&lt;sup&gt;256&amp;nbsp;&lt;/sup&gt;olası gizli anahtarın olması ki herhangibirini tespit edebilmek i&amp;ccedil;in var olanlarından m&amp;uuml;mk&amp;uuml;n olduğunca &amp;ccedil;oğunu bilmek gerekiyor. Bunu anlatmak &amp;ccedil;ok zor ama trilyonlarca yıl alabilecek bir zaman ortaya &amp;ccedil;ıktığı s&amp;ouml;yleniyor(Teorik olarak)&lt;/p&gt;
&lt;p&gt;Peki yazılımcı olarak biz bu değerleri kullanarak ne yapabiliriz? Aslında se&amp;ccedil;eceğimiz bir private key değeri ile public key &amp;uuml;retebilir sonra bu iki anahtar bilgisinden yararlanarak dijital bir imza oluşturarak belgelerimizi kriptolayabiliriz. Bu ama&amp;ccedil;la kullanılabilecek pek &amp;ccedil;ok k&amp;uuml;t&amp;uuml;phane var. Hatta &lt;a href="https://blog.todotnet.com/2018/02/public-private-keys-and-signing/" target="_blank"&gt;şu adreste g&amp;uuml;zel bir kod &amp;ouml;rneği&lt;/a&gt; de bulunmakta. İnceleyip denemenizi &amp;ouml;neririm.&lt;/p&gt;
&lt;h1&gt;Sonu&amp;ccedil;&lt;/h1&gt;
&lt;p&gt;Eliptik Eğri denklemi Blockchain ve ondan t&amp;uuml;reyen pek &amp;ccedil;ok yapı tarafından asimetrik&amp;nbsp;şifre &amp;uuml;retilip transaction'ların imzalanması&amp;nbsp;maksadıyla kullanılmakta. Asitmerik şifrelemede public ve private olmak &amp;uuml;zere iki anahtar s&amp;ouml;z konusu. Public Key herkes tarafından g&amp;ouml;r&amp;uuml;lebilir bir bilgi ama private key tahmin edeceğiniz &amp;uuml;zere kişiye &amp;ouml;zel. Private key değeri kullanılarak public key değerinin elde edilmesi m&amp;uuml;mk&amp;uuml;n. Bu değeri elde ederken yukarıdaki eliptik eğri denkleminden yararlanılmakta. Ancak public key değerini kullanarak private key bilgisine oluşturmak en azından &amp;ouml;n&amp;uuml;m&amp;uuml;zdeki birka&amp;ccedil; milyon y&amp;uuml;z yıl(belki de fazlası) i&amp;ccedil;in m&amp;uuml;mk&amp;uuml;n değil. Blockchain&amp;nbsp;bir transaction'ı imzalarken private key ile oluşturulmuş bir hash değeri kullanıyor. Hash bilgisinin geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;lerek private key i&amp;ccedil;eriğinin bulunması zaten m&amp;uuml;mk&amp;uuml;n değil&amp;nbsp;lakin public key değerine sahip olan birisi kendi &amp;uuml;rettiği private key'leri kullanarak oluşturacağı hash'leri karşılaştırmaya &amp;ccedil;alışabilir. Lakin burada onu bekleyen şey Eliptik Eğri Dijital Kriptografi Algoritması&lt;em&gt;(Elliptic Curve Digital Signature Algorithm)&lt;/em&gt;&amp;nbsp;oluyor; ki bu konu şu an&amp;nbsp;i&amp;ccedil;in&amp;nbsp;beni aşmakta. Kaynaklar arasında daha fazla kaybolmadan hatırladığım eski matematik denklemlerimi bir kenara bırakıyor ve hepinize mutlu g&amp;uuml;nler diliyerek istirahata &amp;ccedil;ekiliyorum.&lt;/p&gt;
&lt;h1&gt;Kaynaklar&lt;/h1&gt;
&lt;p&gt;&lt;a href="https://eng.paxos.com/blockchain-101-foundational-math" target="_blank"&gt;Blockchain 101 - Foundational Math&lt;/a&gt;&lt;br /&gt;&lt;a href="https://eng.paxos.com/blockchain-101-elliptic-curve-cryptography" target="_blank"&gt;Blockchain 101 - Elliptic Curve Cryptography&lt;/a&gt;&lt;br /&gt;&lt;a href="https://tr.khanacademy.org/computing/computer-science/cryptography/modarithmetic/a/congruence-modulo" target="_blank"&gt;Modulo Denklik&lt;br /&gt;&lt;/a&gt;&lt;a href="http://mathworld.wolfram.com/EllipticCurve.html" target="_blank"&gt;MathWorl - Elliptic Curve&lt;/a&gt;&lt;br /&gt;&lt;a href="https://learncryptography.com/cryptocurrency/51-attack" target="_blank"&gt;Learn Cryptography - CryptoCurrency(51 Attack)&lt;/a&gt;&lt;br /&gt;&lt;a href="https://www.johannes-bauer.com/compsci/ecc/" target="_blank"&gt;Johannes Bauer - ECC&lt;/a&gt;&lt;br /&gt;&lt;a href="http://andrea.corbellini.name/2015/05/17/elliptic-curve-cryptography-a-gentle-introduction/" target="_blank"&gt;Andrea Corbellini - Elliptic Cure Cryptography - A Gentle Introduction&lt;br /&gt;&lt;/a&gt;&lt;a href="http://andrea.corbellini.name/2015/05/23/elliptic-curve-cryptography-finite-fields-and-discrete-logarithms/" target="_blank"&gt;Andrea Corbellini - Elliptic Cure Cryptography -&amp;nbsp;Finite Fields and Discrete Logarithms&lt;br /&gt;&lt;/a&gt;&lt;a href="http://scialert.net/fulltext/?doi=jse.2007.1.12" target="_blank"&gt;Implementation of Elliptic Curve Digital Signature Algorithm&lt;br /&gt;&lt;/a&gt;&lt;a href="https://cdn.rawgit.com/andreacorbellini/ecc/920b29a/interactive/modk-mul.html" target="_blank"&gt;Elliptic Curve Scalar Multiplaction&amp;nbsp;Calculator&lt;br /&gt;&lt;/a&gt;&lt;a href="https://en.bitcoin.it/wiki/Secp256k1" target="_blank"&gt;BitcounWiki&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2018-07-24 07:00:00</pubDate>
  <slug>Blockchain-Eliptik-Egri-Sifreleme-Algoritması</slug>
  <tags>
    <tag>cryptography</tag>
    <tag>blockchain</tag>
    <tag>elliptic-curve-cryptography</tag>
    <tag>group-law</tag>
    <tag>modular-arithmetic</tag>
    <tag>finite-sets</tag>
    <tag>district-logarithm</tag>
    <tag>logarithm</tag>
    <tag>extended-euclidean-algorithm</tag>
    <tag>matematik</tag>
  </tags>
  <categories>
    <category>Algoritma</category>
  </categories>
</post>