<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Int32 ve Int64 Haricindekiler için Parallel.ForEach</title>
  <description>Dolayısıyla bazı durumlarda en tepeden aşağıya doğru inen ve bağlı liste(Linked List) benzeri bir oluşumun sağlanması zorlaşmaktaydı. Her neyse...Eminim bu sorunlar çoktan aşılmıştır. Ancak bir önceki cümlede yer alan bağlı liste tarzı yapıların başında dolaşan bir kara bulut daha mevcuttur. Sorunun kaynağında paralel programlama amacıyla .Net ortamına kazandırılan Parallel.ForEach döngüsü yer almaktadır. Dilerseniz öncelikle sorunu masaya yatıralım. Bu amaçla aşağıdaki kod içeriğine sahip Employee isimli basit bir sınıfımız olduğunu düşünelim.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f3%2fblg165_Giris.jpg" alt="" width="255" height="190" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir ka&amp;ccedil; yıl &amp;ouml;ncesine kadar &lt;strong&gt;Bizitek &lt;/strong&gt;firmasına &lt;strong&gt;Junior Developer &lt;/strong&gt;olarak g&amp;ouml;rev almaktaydım. Bu şirkette &amp;ccedil;alıştığım s&amp;uuml;re boyunca pek &amp;ccedil;ok projede g&amp;ouml;rev alma fırsatım oldu. Ancak genellikle şirketin iş akışları &amp;uuml;zerine geliştirdiği bir &amp;uuml;r&amp;uuml;n&amp;uuml;n kurulması ve ihtiya&amp;ccedil;lara g&amp;ouml;re d&amp;uuml;zenlenmesi ile ilgilenmekteydim. S&amp;ouml;z konusu uygulamanın belki de en &amp;ouml;nemli &amp;ouml;zelliklerinden birisi, kurulduğu firmanın organizasyon ağacını i&amp;ccedil;ermesi ve buna g&amp;ouml;re akış i&amp;ccedil;i adımların kolayca tesis edilebilmesiydi. İşte zaten bazı sıkıntılar da burada başlıyordu. Nitekim bazı firmaların organizasyonel yapıları d&amp;uuml;zg&amp;uuml;n değildi. En sık rastlanan vakalardan birisi, herhangibir &amp;ccedil;alışanın aslında birden fazla g&amp;ouml;rev &amp;uuml;stlenmesi nedeniyle organizasyon ağacında birden fazla yerde var olabilmesiydi. &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dolayısıyla bazı durumlarda en tepeden aşağıya doğru inen ve &lt;strong&gt;bağlı liste(Linked List) &lt;/strong&gt;benzeri bir oluşumun sağlanması zorlaşmaktaydı. Her neyse...Eminim bu sorunlar &amp;ccedil;oktan aşılmıştır. Ancak bir &amp;ouml;nceki c&amp;uuml;mlede yer alan bağlı liste tarzı yapıların başında dolaşan bir kara bulut daha mevcuttur. Sorunun kaynağında paralel programlama amacıyla &lt;strong&gt;.Net &lt;/strong&gt;ortamına kazandırılan &lt;strong&gt;Parallel.ForEach &lt;/strong&gt;d&amp;ouml;ng&amp;uuml;s&amp;uuml; yer almaktadır. Dilerseniz &amp;ouml;ncelikle sorunu masaya yatıralım. Bu ama&amp;ccedil;la aşağıdaki kod i&amp;ccedil;eriğine sahip &lt;strong&gt;Employee &lt;/strong&gt;isimli basit bir sınıfımız olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class Employee
{
	public string Profession { get; set; }
	public string Name { get; set; }
	public Employee Parent { get; set; }
	public Employee Child { get; set; }        
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Employee &lt;/strong&gt;sınıfı ile bir şirketin belirli organizasyonel pozisyonlarını ifade etmek istediğimizi d&amp;uuml;ş&amp;uuml;nebiliriz. İ&amp;ccedil;eriğinde yer alan &lt;strong&gt;Parent &lt;/strong&gt;ve &lt;strong&gt;Child &lt;/strong&gt;isimli &amp;ouml;zellikler dikkat edileceği &amp;uuml;zere &lt;strong&gt;Employee &lt;/strong&gt;tipindendir. Buna g&amp;ouml;re bir &lt;strong&gt;Employee &lt;/strong&gt;nesne &amp;ouml;rneğinin altına ve &amp;uuml;st&amp;uuml;ne başka bir &lt;strong&gt;Employee &lt;/strong&gt;referansının atanması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Dolayısıyla bir ağa&amp;ccedil; yapısının kolayca oluşturulması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Elbetteki sembolik olarak. S&amp;ouml;z gelimi;&lt;/p&gt;
&lt;p&gt;Director&lt;br /&gt;---&amp;gt;Project Manager&lt;br /&gt;------&amp;gt;Technical Project Manager&lt;br /&gt;---------&amp;gt;Senior Developer&lt;br /&gt;------------&amp;gt;Junior Developer&lt;/p&gt;
&lt;p&gt;gibi.&lt;/p&gt;
&lt;p&gt;Yukarıdaki gibi bir yapıyı oluşturduğumuzda &lt;strong&gt;Parent &lt;/strong&gt;ve &lt;strong&gt;Child &lt;/strong&gt;&amp;ouml;zellikleri sayesinde organizasyon i&amp;ccedil;erisinde aşağı ve yukarı doğru kolayca hareket edebileceğimizi g&amp;ouml;rebiliriz. Bu durum aşağıdaki &lt;strong&gt;Console &lt;/strong&gt;uygulamasında ele alınmaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace ParallelForNonIntegralRanges
{
    class Program
    {
        static void Main(string[] args)
        {
            Employee root = Fill();
                        
            #region Case 1 - Seri for d&amp;ouml;ng&amp;uuml;s&amp;uuml;

            for (Employee emp = root; emp !=null ; emp=emp.Child)
            {
                Console.WriteLine("{0} {1}",emp.Profession,emp.Name);
            }

            #endregion
        }

        static Employee Fill()
        {
            Employee d = new Employee { Profession = "Director",Name="Bill" };
            Employee pm = new Employee { Profession = "Project Manager",Name="Steve" };
            Employee tpm = new Employee { Profession = "Technical Project Manager",Name="Joe" };
            Employee sd = new Employee { Profession = "Senior Developer",Name="Nicole" };
            Employee jd = new Employee { Profession = "Junior Developer",Name="Burak" };

            d.Parent = null;
            d.Child = pm;

            pm.Parent = d;
            pm.Child = tpm;

            tpm.Parent = pm;
            tpm.Child = sd;

            sd.Parent = tpm;
            sd.Child = jd;

            jd.Parent = sd;
            jd.Child = null;

            return d;
        }
    }

    class Employee
    {
        public string Profession { get; set; }
        public string Name { get; set; }
        public Employee Parent { get; set; }
        public Employee Child { get; set; }        
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;for &lt;/strong&gt;d&amp;ouml;ng&amp;uuml;s&amp;uuml;nden yararlanılarak &lt;strong&gt;Director&lt;/strong&gt;' den en alt kademede yer alan &lt;strong&gt;Junior Developer&lt;/strong&gt;' a kadar ilerlenilmesi sağlanılmaktadır. İşte bu &amp;ouml;rnek kod par&amp;ccedil;asının &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f3%2fblg165_Runtime1New.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Peki ya &lt;strong&gt;Employee &lt;/strong&gt;gibi bir tipin &amp;ccedil;alışma zamanındaki &amp;ouml;rneği ve i&amp;ccedil;eriğindeki bağlı referanslar arasında&lt;strong&gt; Parallel.For&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile ilerlenilmek istenirse? &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Nitekim elimizin alında binlerce ve hatta daha fazla elemandan oluşan bir ağa&amp;ccedil; yapısı olabilir ve bu yapı &amp;uuml;zerindeki elemanlarda bazı işlemlerin yapılması istenebilir. Bu durumda işlemlerin daha hızlı ger&amp;ccedil;ekleştirilebilmesi i&amp;ccedil;in paralel programlama yetenekleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Ancak ortada &amp;ouml;nemli bir sorun vardır. &lt;strong&gt;Parallel.For&lt;/strong&gt; metodunun versiyonlarına bakıldığında &lt;strong&gt;int(Int32) &lt;/strong&gt;ve &lt;strong&gt;long(Int64) &lt;/strong&gt;tipleri ile &amp;ccedil;alıştığı g&amp;ouml;r&amp;uuml;lecektir. Bu durumda &lt;strong&gt;Employee &lt;/strong&gt;nesne &amp;ouml;rnekleri i&amp;ccedil;in &lt;strong&gt;Parallel.For &lt;/strong&gt;d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml; kullanmamız m&amp;uuml;mk&amp;uuml;n değildir. O zaman belki &lt;strong&gt;Parallel.ForEach &lt;/strong&gt;d&amp;ouml;ng&amp;uuml;s&amp;uuml; tercih edilebilir. Edilebilir mi acaba? Bunu denediğimizde derleme zamanında aşağıdaki sonu&amp;ccedil;lar ile karşılaşmamız ka&amp;ccedil;ınılmazdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f3%2fblg165_Excpetion.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu son derece doğaldır. Nitekim &lt;strong&gt;Employee &lt;/strong&gt;tipinin &lt;strong&gt;IEnumerable&amp;lt;T&amp;gt; &lt;/strong&gt;gibi bir aray&amp;uuml;z implemantasyonu yapmadığı ortadadır. Kaldı ki &lt;strong&gt;foreach &lt;/strong&gt;d&amp;ouml;ng&amp;uuml;leri &amp;uuml;zerinde hareket edecekleri tipler i&amp;ccedil;in bu aray&amp;uuml;z implemantasyonunun yapılmasını beklemektedir. O halde farklı bir yardımcı metoddan yararlanalılabilir. Aşağıdaki gibi;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static IEnumerable&amp;lt;Employee&amp;gt; Iterate(Employee root)
{
   for (Employee emp = root; emp != null; emp = emp.Child)   
   {
      yield return emp;   
   }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Iterate &lt;/strong&gt;isimli metod&lt;strong&gt; yield return&lt;/strong&gt; kullanarak&lt;strong&gt; IEnumerable&amp;lt;Employee&amp;gt; &lt;/strong&gt;tipinden bir sonu&amp;ccedil; k&amp;uuml;mesi d&amp;ouml;nd&amp;uuml;rmektedir ve bu aslında &lt;strong&gt;Parallel.ForEach &lt;/strong&gt;d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml;n tamda istediği referanstır. Dolayısıyla artık&amp;nbsp; aşağıdaki gibi bir kod par&amp;ccedil;ası derlenip &amp;ccedil;alıştırılabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Parallel.ForEach&amp;lt;Employee&amp;gt;(
&amp;nbsp;&amp;nbsp; Iterate(root),
&amp;nbsp;&amp;nbsp; emp =&amp;gt; Console.WriteLine("{0} {1}", emp.Profession, emp.Name)
);&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere ilk parametre ile &lt;strong&gt;ForEach &lt;/strong&gt;d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml;n beklediği &lt;strong&gt;IEnumerable&amp;lt;Employee&amp;gt;&lt;/strong&gt; i&amp;ccedil;eriği verilmektedir. Bu durumda kod sorunsuz bir şekilde &amp;ccedil;alışacaktır. Tabiki ekrana yazdırılma sırası değişmeyecektir. Nitekim buradaki tip i&amp;ccedil;eriği saniyenin &amp;ccedil;ok k&amp;uuml;&amp;ccedil;&amp;uuml;k bir diliminde tamamlanacağından farklı &lt;strong&gt;Thread&lt;/strong&gt;' lerin işi ele almasına zaman kalmayacaktır. Sakın sırası karışık bir organizasyon ağacı yazdırılmasını beklemeyin. Yaptığımız sadece ve sadece &lt;strong&gt;Int32/Int64 &lt;/strong&gt;dışında kalan ve &lt;strong&gt;IEnumerable&amp;lt;T&amp;gt; &lt;/strong&gt;gibi bir aray&amp;uuml;z&amp;uuml; implemente etmeyen bir tipe ait &amp;ccedil;alışma zamanı nesne &amp;ouml;rneği ve bağlı referanslarının, &lt;strong&gt;Parallel.ForEach &lt;/strong&gt;d&amp;ouml;ng&amp;uuml;s&amp;uuml; tarafından dolaşılabilmesini sağlamaktır.&lt;/p&gt;
&lt;p&gt;Ancak yine de dikkat edilmesi gereken &amp;ouml;nemli bir durum vardır. &lt;strong&gt;IEnumerable&amp;lt;T&amp;gt; thread safe &lt;/strong&gt;olmadığından d&amp;ouml;ng&amp;uuml;n&amp;uuml;n kullandığı veriye olan erişimler sırasında kilitleme tekniklerinden yararlanılması gerekebilir ki bu da aslında performansı olumsuz y&amp;ouml;nde etkileyebilecek bir durumdur. Burada performansı arttırmaya y&amp;ouml;nelik olarak belkide &lt;strong&gt;Iterate &lt;/strong&gt;metodunun sonucunun &lt;strong&gt;ToArray &lt;/strong&gt;gibi bir metod yardımıyla diziye &amp;ccedil;evrilmesi d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Aşağıdaki kod par&amp;ccedil;asında g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Parallel.ForEach&amp;lt;Employee&amp;gt;(
   Iterate(root).ToArray(),
   emp =&amp;gt; Console.WriteLine("{0} {1}", emp.Profession, emp.Name)
);&lt;/pre&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f4%2fParallelForNonIntegralRanges_RTM.rar"&gt;ParallelForNonIntegralRanges_RTM.rar (27,05 kb)&lt;/a&gt;&lt;strong&gt; [&amp;Ouml;rnek uygulama Visual Studio 2010 Ultimate RTM s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde geliştirilmiş ve test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-05-16 21:46:00</pubDate>
  <slug>Int32-ve-Int64-Haricindekiler-icin-ParallelForEach</slug>
  <tags>
    <tag>parallel-programming</tag>
    <tag>c#</tag>
    <tag>c#-30</tag>
    <tag>c#-40</tag>
  </tags>
  <categories>
    <category>Parallel Programming</category>
  </categories>
</post>