<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Kendi Referans Tiplerimizi Klonlamak</title>
  <description>Bu makalemizde kendi yazmış olduğumuz referans tipleri arasında yapılan atama işlemleri sırasında üyeden üyeye (Member by member) kopyalamanın nasıl yapılabileceğini incelemeye çalışacağız. Bildiğiniz gibi referans tipleri belleğin heap bellek bölgesinde tutulurlar. Bu tutuluş yapısının özellikle referans tipleri arasında yapılan atama işlemlerinde önemli bir etkisi vardır. İki referans tipi arasında bir atama işlemi söz konusu olduğunda, aslında bu referans tiplerinin heap bellek bölgesinde yer alan adresleri eşitlenmektedir. Bu eşlemenin doğal bir sonucu olaraktan da referans tiplerinin her hangibirisinde yapılan değişiklik diğerinide otomatikman etkileyecektir.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bu makalemizde kendi yazmış olduğumuz referans tipleri arasında yapılan atama işlemleri sırasında &amp;uuml;yeden &amp;uuml;yeye (Member by member) kopyalamanın nasıl yapılabileceğini incelemeye &amp;ccedil;alışacağız. Bildiğiniz gibi referans tipleri belleğin heap bellek b&amp;ouml;lgesinde tutulurlar. Bu tutuluş yapısının &amp;ouml;zellikle referans tipleri arasında yapılan atama işlemlerinde &amp;ouml;nemli bir etkisi vardır. İki referans tipi arasında bir atama işlemi s&amp;ouml;z konusu olduğunda, aslında bu referans tiplerinin heap bellek b&amp;ouml;lgesinde yer alan adresleri eşitlenmektedir. Bu eşlemenin doğal bir sonucu olaraktan da referans tiplerinin her hangibirisinde yapılan değişiklik diğerinide otomatikman etkileyecektir.&lt;/p&gt;
&lt;p&gt;Ancak bazı durumlarda, &amp;ouml;zellikle kendi yazdığımız referans tiplerini kullanırken bu durumun tam tersini isteyebiliriz. Yani kendi yazmış olduğumuz bir sınıfın iki nesne &amp;ouml;rneği arasında yaptığımız atama işlemi sonrası, bu referansların birbirini etkilemelerini &lt;u&gt;istemeyebiliriz&lt;/u&gt;. Bu durumda yazmış olduğumuz sınıfa &lt;strong&gt;IClonable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulayarak referans tipinin klonlanmasını sağlayabiliriz. Bu durumu analiz etmeden &amp;ouml;nce, referans tipleri arasında yapılam atamanın doğal sonucunu aşağıdaki &amp;ouml;rnek ile incelemeye &amp;ccedil;alışalım. &amp;Ouml;rneğimizde bir d&amp;ouml;rtgene ait kenar uzunluklarını tutacak olan Dortgen isimli bir sınıf kullanacağız. Dortgen sınıfımızın UML şeması ve kodları aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk140_3.gif" alt="" width="284" height="252" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Dortgen.cs&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Dortgen
{
    private double kenarA;
    private double kenarB;

    public double A
    {
        get
        {
            return kenarA;
        }
        set
        {
            kenarA=value;
        }
    }

    public double B
    {
        get
        {
            return kenarB;
        }
        set
        {
            kenarB=value;
        }
    }

    public Dortgen()
    {
        kenarA=0;
        kenarB=0;
    }

    public Dortgen(double aKenari,double bKenari)
    {
        kenarA=aKenari;
        kenarB=bKenari;
    }

    public override string ToString()
    {
        string dortgenBilgi=kenarA.ToString()+" "+kenarB.ToString();
        return dortgenBilgi;
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi Dortgen sınıfınadan iki nesne &amp;ouml;rneğini kullanacağımız bir console uygulamsına ait Main metodunda, aşağıdaki kod satırlarını yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Dortgen drtgX=new Dortgen(10,20);
Console.WriteLine("X : "+drtgX.ToString());

Dortgen drtgY;
drtgY=drtgX; // referanslar eşitlenir.
Console.WriteLine("Y : "+drtgY.ToString());

drtgY.A=30;
drtgY.B=40;

Console.WriteLine("Y : "+drtgY.ToString());
Console.WriteLine("X : "+drtgX.ToString());&lt;/pre&gt;
&lt;p&gt;Burada ilk olarak Dortgen sınıfına ait bir nesne &amp;ouml;rneğini (drtgX) oluşturuyor. Daha sonra ise drtgY isimli bir nesne &amp;ouml;rneği oluşturup bu &amp;ouml;rneğe, drtgX nesnesini atıyoruz. İşte bu noktada her iki nesne &amp;ouml;rneğinin referans adreslerini eşitlemiş oluyoruz. İzleyen satırlarda bu kez drtgY nesnesi &amp;uuml;zerinden A ve B &amp;ouml;zelliklerinin değerlerini değiştiriyoruz. Az &amp;ouml;nce yapılan eşleştirme işlemi nedeniyle drtgY nesnesi i&amp;ccedil;in ger&amp;ccedil;ekleştirilen değişiklikler drtgX nesnesi i&amp;ccedil;inde s&amp;ouml;z konusu olacaktır. Dolayısıyla drtgX nesnesini ilk &amp;ouml;rneklerken belirlenen A ve B değişkenlerinin değerlerini kaybetmiş oluyoruz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk140_2.gif" alt="" width="364" height="143" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;span style="color: #ff0000; font-family: Verdana; font-size: small;"&gt; &lt;img src="/makale/images/mk140_6.gif" alt="" width="617" height="366" border="0" /&gt;&lt;br /&gt; &amp;nbsp;&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;
&lt;table id="table7" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Referans tiplerinin bir birlerine atanması işlemi sonrası, bu tiplerin heap bellek b&amp;ouml;lgesindeki başlangı&amp;ccedil; adresleri eşitleneceğinden, birisi i&amp;ccedil;erisindeki varlıklarda yapılacak değişiklikler diğerinede yansıyacaktır.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Yukarıdaki &amp;ouml;rnek referans tipleri arasında yapılan atamaların bir eksiklik olduğunu g&amp;ouml;stermez. Bu, bellek sisteminin doğal bir sonucudur. Dahası, referans tiplerinin bu şekilde tutulmasının ve atama işlemleri sonrası adreslerin eşitlenmesinin avantajlı olduğu durumlar da vardır. &amp;Ouml;rneğin n elemanlı bir diziyi, bir metoda parametre olarak ge&amp;ccedil;irmek istediğinizde, dizinin metod bloğu i&amp;ccedil;inde değer t&amp;uuml;rlerinde olduğu gibi tekrardan &amp;ouml;rneklenmemesi, referans adreslerinin taşınması sayesinde ger&amp;ccedil;ekleşir. B&amp;ouml;ylece bellekte gereksiz yere ikinci bir dizi &amp;ouml;rneği yaratılmamış olunur.&lt;/p&gt;
&lt;p&gt;Elbetteki bazı hallerde referans tiplerinin &amp;uuml;yeden-&amp;uuml;yeye (member by member) kopyalanmasını yani ikinci bir adresleme ile yeni bir &amp;ouml;rneğin oluşturulmasını isteyebiliriz. İşte bunu ger&amp;ccedil;ekleştirmek i&amp;ccedil;in var olan nesneyi atama işlemini yaparken klonlarız. Klonlama işleminin ger&amp;ccedil;ekleştirilebilmesi i&amp;ccedil;in, yazmış olduğumuz sınıfa IClonable aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamamız gerekir. Bu aray&amp;uuml;z sadece Clone isimli tek bir metod i&amp;ccedil;ermektedir. Yukarıdaki &amp;ouml;rneğimizde kullandığımız Dortgen sınıfına IClonable aray&amp;uuml;z&amp;uuml;n&amp;uuml; aşağıdaki gibi uygulayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk140_1.gif" alt="" width="301" height="297" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Dortgen:ICloneable
{
    // Diğer kodlar

    #region ICloneable Members

    public object Clone()
    {
        return new Dortgen(this.kenarA,this.kenarB);
    }

    #endregion
}&lt;/pre&gt;
&lt;p&gt;Elbette Clone metodunu atama işlemi sırasında aşağıdaki kod par&amp;ccedil;asında olduğu gibi kullanmamız gerekir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;drtgY=(Dortgen)drtgX.Clone();&lt;/pre&gt;
&lt;p&gt;Clone metodu, Dortgen sınıfına ait yeni bir nesne &amp;ouml;rneğini o an sahip olduğu A ve B değerleri ile geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Clone metodu varsayılan olarak Object tipinden değerler d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml; i&amp;ccedil;in, drtgY nesnesine yapılan atama işlemi sırasında t&amp;uuml;r d&amp;ouml;n&amp;uuml;ş&amp;uuml;m işlemi(casting) yaparak uygun tipe atama yapmamız gerekmektedir. Bu işlem ile birlikte bellekte Dortgen sınıfına ait iki nesne &amp;ouml;rneği i&amp;ccedil;in ayrı ayrı adreslemeler s&amp;ouml;z konusu olacaktır. drgtX nesnesi var olan değerlerini korurken oluşturulduğu sıradaki adreste konuşlanmaya devam edecektir. drtgY nesnemiz ise drtgX nesnesinin o anki i&amp;ccedil;eriğine sahip olmak &amp;uuml;zere, belleğin farklı bir adres b&amp;ouml;lgesinde yeniden &amp;ouml;rneklendirilecektir. Durumu aşağıdaki şekil ile daha kolay anlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk140_7.gif" alt="" width="617" height="366" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulamayı bu haliyle &amp;ccedil;alıştırdığımızda atama işlemi sonrası drtgY nesnesi &amp;uuml;zerinden yapılan değişikliklerin&amp;nbsp; drtgX nesnesinin değerlerini etkilemediğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk140_4.gif" alt="" width="364" height="143" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Aynı etkiyi şu şekilde de yapabiliriz,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public object Clone()
{
    return this.MemberwiseClone();
}&lt;/pre&gt;
&lt;p&gt;MemberwiseClone metodu Object sınıfına ait bir metoddur. Protected erişim belirleyicisine sahiptir bu y&amp;uuml;zden t&amp;uuml;retme işlemi s&amp;ouml;z konusu olduğunuda kullanılabilir. Ayrıca override edilebilir bir metod da değildir. MemberwiseClone metodu, kullanıldığı sınıfın nesne &amp;ouml;rneğinden bir kopya daha oluşturmaktır. Yukarıdaki &amp;ouml;rneğimizi bu haliyle &amp;ccedil;alıştırdığımızda, atama sonrası klonlama işleminin başarılı bir şekilde yapıldığını ve drtgY nesnesi &amp;uuml;zerinde yapılan değişikliklerin drtgX nesnesini etkilemediğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk140_4.gif" alt="" width="364" height="143" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Ancak MemberwiseClone metodunu kullanırken dikkat etmemiz gereken bir durum vardır.&lt;/p&gt;
&lt;table id="table8" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;&lt;strong&gt;MemberwiseClone&lt;/strong&gt; metodu, klonlama işlemi sırasında nesnenin static olmayan t&amp;uuml;m değer t&amp;uuml;rlerini (value types) bit-bit kopyalar. Ancak i&amp;ccedil;eride kullanılan referans tipi nesne &amp;ouml;rnekleri varsa bunların adreslerini aynen yeni &amp;ouml;rneğe ge&amp;ccedil;irir. Dolayısıyla referans tipleri arası yapılan atama işlemi sonrası oluşan aynı adresi g&amp;ouml;sterme &amp;ccedil;atışması, dahili referans tipi nesne &amp;ouml;rnekleri i&amp;ccedil;inde ge&amp;ccedil;erli olur.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Bu durumda yeni nesne &amp;ouml;rneğimiz i&amp;ccedil;erisinde var olan bir referans tipi &amp;uuml;zerinde yapılacak bir değişiklik, yine ilk nesne i&amp;ccedil;indeki referans nesne &amp;ouml;rneği i&amp;ccedil;inde ge&amp;ccedil;erli olacaktır. Bu dikkat edilmesi gereken &amp;ouml;nemli bir durumdur. &amp;Ouml;rneğin Dortgen sınıfımız i&amp;ccedil;erisinde kullanılacak yeni bir sınıfımız olduğunu varsayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class DortgenHesaplama
{
}

public class Dortgen:ICloneable
{
    private double kenarA;
    private double kenarB;
    private DortgenHesaplama drgH=new DortgenHesaplama();

    public double A
    {
        get { return kenarA; }
        set { kenarA=value; }
    }
    public double B
    {
        get { return kenarB; }
        set { kenarB=value; }
    }
    public DortgenHesaplama Hesaplama
    {
        get { return drgH; }
    }
    public Dortgen()
    {
        kenarA=0;
        kenarB=0;
    }

    public Dortgen(double aKenari,double bKenari)
    {
        kenarA=aKenari;
        kenarB=bKenari;
    }

    public override string ToString()
    {
        string dortgenBilgi=kenarA.ToString()+" "+kenarB.ToString();
        return dortgenBilgi;
    }

    #region ICloneable Members
    
    public object Clone()
    {
        return this.MemberwiseClone();
        // return new Dortgen(this.kenarA,this.kenarB);
    }

    #endregion
}&lt;/pre&gt;
&lt;p&gt;Burada dikkat ederseniz, DortgenHesaplama isimli sınıfa ait bir nesne &amp;ouml;rneğini Dortgen sınıfı i&amp;ccedil;erisinde kullanmaktayız. Bu, Dortgen referans tipi i&amp;ccedil;erisinde yer alan başka bir referans tipi nesne &amp;ouml;rneğidir. Atama işlemi sonrası MemberwiseClone metodu DortgenHesaplama sınıfına ait nesne &amp;ouml;rneğinin sadece adresini kopyalayacaktır. Uygulamamızın kodlarını yukarıdaki Dortgen sınıfına g&amp;ouml;re aşağıdaki gibi değiştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Dortgen drtgX=new Dortgen(10,20);
Dortgen drtgY;
drtgY=(Dortgen)drtgX.Clone();
drtgY.A=30;
drtgY.B=40;

bool refAdrEsitmi=object.ReferenceEquals(drtgX,drtgY);
Console.WriteLine("drtgX &amp;amp; drtgY referans adresleri eşit mi ?"+refAdrEsitmi.ToString());

refAdrEsitmi=object.ReferenceEquals(drtgX.Hesaplama,drtgY.Hesaplama);
Console.WriteLine("drtgX.Hesaplama &amp;amp; drtgY.Hesaplama referans adresleri eşit mi ?"+refAdrEsitmi.ToString());&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk140_5.gif" alt="" width="572" height="95" border="0" /&gt;&lt;/p&gt;
&lt;table id="table11" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;&lt;strong&gt;ReferenceEquals&lt;/strong&gt; parametre olarak aldığı nesne &amp;ouml;rneklerinin bellek referanslarının aynı olup olmadığını kontrol ederek sonucu bool tipinden geriye d&amp;ouml;nd&amp;uuml;ren Object sınıfına ait static bir metoddur.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi drtgX ve drtgY nesnelerini Object sınıfının ReferenceEquals metodu ile karşılaştırdığımızda, false değerini alıyoruz. &amp;Ccedil;&amp;uuml;nk&amp;uuml; biz Dortgen sınıfımıza IClonable aray&amp;uuml;z&amp;uuml;n&amp;uuml; ve Clone metodu i&amp;ccedil;erisinde MemberwiseClone fonksiyonunu uygulayarak, drtgX nesne &amp;ouml;rneğini klonluyoruz. Bu sebeple heap bellek b&amp;ouml;lgesinde ayrı bir Dortgen nesne &amp;ouml;rneği oluşturuluyor. Dolayısıla adresler artık farklı olacağından ReferenceEquals metodu geriye false değer d&amp;ouml;nd&amp;uuml;recektir.&lt;/p&gt;
&lt;p&gt;Ancak drtgX ve drtgY nesne &amp;ouml;rnekleri i&amp;ccedil;erisinde yer alan DortgenHesaplama sınıfına ait nesne &amp;ouml;rneklerinin referanslarını karşılaştırdığımızda true değerinin d&amp;ouml;nd&amp;uuml;ğ&amp;uuml;n&amp;uuml; g&amp;ouml;rmekteyiz. Yani DortgenHesaplama sınıfına ait nesne &amp;ouml;rnekleri i&amp;ccedil;in klonlama işlemi ger&amp;ccedil;ekleşmemiş bunun yerine nesnelerin heap bellek b&amp;ouml;lgesindeki adresleri eşitlenmiştir. Bu dikkat edilmesi gereken bir durumdur ve sınıflarımızı programlarken gerekli tedbirlerin alınmasını gerektirebilecek kadar &amp;ouml;nemlidir. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2005-11-14 10:00:00</pubDate>
  <slug>Kendi-Referans-Tiplerimizi-Klonlamak-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#-20</tag>
    <tag>i-clonable</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>