<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Dizilere(Arrays) İlişkin Üç Basit Öneri</title>
  <description>Hepimiz dizileri (Arrays) bilir ve kullanırız. Her ne kadar günümüzde koleksiyonlar, xml kaynakları ve tablo yapıları veri saklamak amacıyla daha çok kullanılıyor olsalar da, dizilerdende yoğun şekilde yararlanmaktayız. Örneğin kendi tasarladığımız bir sınıfa ait nesneler topluluğunu pekala bir dizi şeklinde ifade edebilir hatta serileştirebiliriz (serializable). Lakin dizileri kullanırken tercih edeceğimiz ve bize performans açısından avantaj sağlayacak teknikleri çoğu zaman göz ardı ederiz. İşte bu makalemizde dizileri kullanırken işimize yarayacak performans kriterlerinden bahsedeceğiz.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Hepimiz dizileri (Arrays) bilir ve kullanırız. Her ne kadar g&amp;uuml;n&amp;uuml;m&amp;uuml;zde koleksiyonlar, xml kaynakları ve tablo yapıları veri saklamak amacıyla daha &amp;ccedil;ok kullanılıyor olsalar da, dizilerdende yoğun şekilde yararlanmaktayız. &amp;Ouml;rneğin kendi tasarladığımız bir sınıfa ait nesneler topluluğunu pekala bir dizi şeklinde ifade edebilir hatta serileştirebiliriz (serializable). Lakin dizileri kullanırken tercih edeceğimiz ve bize performans a&amp;ccedil;ısından avantaj sağlayacak teknikleri &amp;ccedil;oğu zaman g&amp;ouml;z ardı ederiz. İşte bu makalemizde dizileri kullanırken işimize yarayacak performans kriterlerinden bahsedeceğiz.&lt;/p&gt;
&lt;table id="table6" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;&lt;strong&gt;&amp;Ouml;neri 1 ;&lt;/strong&gt; Dizi elemanları arasında gezinirken kullanacağımız &lt;strong&gt;for d&amp;ouml;ng&amp;uuml;leri, foreach d&amp;ouml;ng&amp;uuml;lerine nazaran&lt;/strong&gt; daha s&amp;uuml;ratli &amp;ccedil;alışır.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;İki d&amp;ouml;ng&amp;uuml; yapısı arasındaki farkı daha net olarak g&amp;ouml;rebilmek i&amp;ccedil;in aşağıdaki basit console uygulamasını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almakta fayda var. Uygulamamızda basit olarak double tipinden bir dizi tanımlıyoruz. Bu dizinin boyutunu dikkat ederseniz y&amp;uuml;ksek verdik. Hem for d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml; hem de foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml; sırasıyla &amp;ccedil;alıştıyoruz. İlk olarak for d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile indeksleyici operat&amp;ouml;r&amp;uuml;n&amp;uuml; kullanarak dizimizin elemanları &amp;uuml;zerinde ilerliyor ve bir toplam değeri alıyoruz. Aynı işlemi daha sonra bir foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile ger&amp;ccedil;ekleştiriyoruz. &lt;em&gt;(Aldığımız toplama işleminin bizim i&amp;ccedil;in &amp;ouml;zel bir &amp;ouml;nemi veua anlamı yok.)&lt;/em&gt; D&amp;ouml;ng&amp;uuml;lerin &amp;ccedil;alışma s&amp;uuml;relerini yaklaşık olarak hesaplayabilmek amacıyla da TimeSpan ve DateTime sınıflarından faydalanıyoruz. Bu hesaplamalar bize yaklaşık olarak d&amp;ouml;ng&amp;uuml;lerin &amp;ccedil;alışma s&amp;uuml;relerini verecektir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace UsingArrays
{
    class DizilerTest
    {
        static void DiziTest_1()
        {
            double[] dizi=new double[50000000]; 
            double toplam=0;

            for(int i=0;i&amp;lt;dizi.Length;i++)
            {
                dizi[i]=i;
            } 

            #region for d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile
            DateTime dtBaslangic=DateTime.Now;
            for(int i=0;i&amp;lt;dizi.Length;i++)
            {
                toplam+=dizi[i];
            }
            DateTime dtBitis=DateTime.Now;
            TimeSpan tsFark=dtBitis-dtBaslangic;
            Console.WriteLine(tsFark.TotalSeconds+" saniye...");
            #endregion

            #region foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile
            toplam=0;
            dtBaslangic=DateTime.Now;
            foreach(int i in dizi)
            {
                toplam+=i;
            }
            dtBitis=DateTime.Now;
            tsFark=dtBitis-dtBaslangic;

            Console.WriteLine(tsFark.TotalSeconds+" saniye...");
            #endregion

            Console.ReadLine();
        } 

        static void Main(string[] args)
        {
            DiziTest_1();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Kodumuzu bu haliyle &amp;ccedil;alıştırdığımızda aşağıdakine benzer bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; elde ederiz. Ben kendi test ortamımda &lt;em&gt;(windows 2000, 512 mb Ram, P4 2.4 ghz cpu tabanlı bir pc)&lt;/em&gt; uygulamayı iki kez farklı zamanlarda &amp;ccedil;alıştırdığımda aşağıdaki sonu&amp;ccedil;ları aldım. Yaklaşık değerler olmasına rağmen, belirgin derecede fark olduğu hemen g&amp;ouml;zlemlenmektedir. Tabiki uygulamanın verdiği sonu&amp;ccedil;lar sistemin o anki işlem yoğunluğuna g&amp;ouml;re değişiklik g&amp;ouml;sterebilir. Ancak sonu&amp;ccedil; olarak for d&amp;ouml;ng&amp;uuml;leri s&amp;ouml;z konusu olan iterasyonu foreach d&amp;ouml;ng&amp;uuml;lerine g&amp;ouml;re daha hızlı tamamlamaktadır.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;İlk &amp;ccedil;alıştırılış;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk129_1.gif" alt="" width="254" height="130" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;İkinci &amp;ccedil;alıştırılış;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk129_2.gif" alt="" width="220" height="103" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Elbetteki dizimizdeki eleman sayısının azalması halinde iki d&amp;ouml;ng&amp;uuml;n&amp;uuml;n &amp;ccedil;alışma s&amp;uuml;releri arasındaki fark azalacaktır hatta bir birlerine daha da yakınlaşacaktır. &amp;Ouml;rneğin dizimizi 10 milyon elemanlı olarak tanımlarsak uygulamanın &amp;ccedil;alışmasının sonucu aşağıdaki gibi olacaktır. D&amp;ouml;ng&amp;uuml;lerin &amp;ccedil;alışma s&amp;uuml;releri arasındaki fark azalmış olmasına rağmen yinede for d&amp;ouml;ng&amp;uuml;s&amp;uuml; iterasyonu &amp;ccedil;ok daha &amp;ouml;nce tamamlamıştır.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;İlk &amp;ccedil;alıştırılış;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk129_3.gif" alt="" width="205" height="77" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;İkinci &amp;ccedil;alıştırılış;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk129_4.gif" alt="" width="190" height="67" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim diziler ile ilgili ikinci &amp;ouml;nemli &amp;ouml;neriye. Bu &amp;ouml;neri, geriye d&amp;ouml;n&amp;uuml;ş değerleri dizi olan metodlar ile ilgilidir.&amp;nbsp;&lt;/p&gt;
&lt;table id="table8" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;&lt;strong&gt;&amp;Ouml;neri 2 ;&lt;/strong&gt; Metodlardan geriye dizi referansları d&amp;ouml;n&amp;uuml;yorsa, d&amp;ouml;n&amp;uuml;ş değeri olmayacak koşullu durumlarda null değer yerine 0 elemanlı bir dizinin d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi uygulamada daha az kontrol yapmamızı sağlar.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Bu &amp;ouml;neriyi anlayabilmek i&amp;ccedil;in aşağıdaki kod par&amp;ccedil;asında ye alan basiy console uygulamasını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace UsingArrays
{
    class DizilerTest
    {
        static double[] DiziTest_2(int elemanSayisi)
        {
            if (elemanSayisi &amp;lt;= 0)
            {
                return null;
            }
            else
            {
                return new double[elemanSayisi];
            }
        }

        static void Main(string[] args)
        {
            double[] dizi;
            dizi = DiziTest_2(-1);
            for (int i = 0; i &amp;lt; dizi.Length; i++)
            {
                Console.WriteLine(dizi[i]);
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rnekte DiziTest_2 isimli metodumuz diziyi i&amp;ccedil;eride oluşturup referansını geri d&amp;ouml;nd&amp;uuml;rmek &amp;uuml;zere tasarlanmıştır. Eğer bu metoda aktardığımız parametre değerimiz 0 veya negatif ise, metodumuz geriye null değer d&amp;ouml;nd&amp;uuml;rmektedir. Bu m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r &amp;ccedil;&amp;uuml;nk&amp;uuml; diziler bildiğiniz gibi referans t&amp;uuml;r&amp;uuml;nden elemanlardır. Ana kodumuzda ise for d&amp;ouml;ng&amp;uuml;s&amp;uuml; yardımıyla oluşturulan dizinin elemanları ekrana yazdırılmaktadır. Uygulamamızı bu haliyle derlediğimizde aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi &amp;ccedil;alışma zamanında &lt;strong&gt;NullReferenceException&lt;/strong&gt; istisnası ile karşılaşırız. Bu sonu&amp;ccedil; for d&amp;ouml;ng&amp;uuml;s&amp;uuml; yerine foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml; kullandığımız takdirde de ka&amp;ccedil;ınılmazdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk129_5.gif" alt="" width="635" height="137" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sorunu &amp;ccedil;&amp;ouml;zebilmek i&amp;ccedil;in d&amp;ouml;ng&amp;uuml;n&amp;uuml;n &amp;ccedil;alıştırılmasından hemen &amp;ouml;nce dizi referansının null olup olmadığının kontrol&amp;uuml;n&amp;uuml; yapmamız gerekir. Dolayısıyla kodumuzu aşağıdaki gibi d&amp;uuml;zenlemeliyiz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;double[] dizi;
dizi = DiziTest_2(-1);
if (dizi != null) 
{
    foreach (double eleman in dizi)
    {
        Console.WriteLine(eleman);
    }
}&lt;/pre&gt;
&lt;p&gt;Ancak basit bir teknik ile bu kontrol&amp;uuml; atlayabiliriz. Tek yapmamız gereken DiziTest_2 isimli metodumuzda null değer yerine 0 elemanlı bir dizi referansı d&amp;ouml;nd&amp;uuml;rmek olacakır. Yani;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static double[] DiziTest_2(int elemanSayisi)
{
    if (elemanSayisi &amp;lt;= 0)
    {
        return new double[0];
    }
    else
    {
        return new double[elemanSayisi];
    }
}&lt;/pre&gt;
&lt;p&gt;Bu tekniğin performans a&amp;ccedil;ısından kazanımı olup olmadığı tartışılacak bir konudur. Ancak bizi istisna yakalama ve if kontrol&amp;uuml;nden kurtarmıştır.&lt;/p&gt;
&lt;p&gt;Diziler ile ilgili &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; &amp;ouml;nerimiz ise &amp;ouml;zellikle iki boyutlu dizileri ilgilendirmektedir.&amp;nbsp;&lt;/p&gt;
&lt;table id="table12" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;&lt;strong&gt;&amp;Ouml;neri 3 ;&lt;/strong&gt; İki boyutlu dizilerde i&amp;ccedil; i&amp;ccedil;e kullanılan d&amp;ouml;ng&amp;uuml;lerde en dıştan i&amp;ccedil;e doğru ger&amp;ccedil;ekleştirilen &amp;ouml;telemelerde, dizinin boyutlarındaki sıraya g&amp;ouml;re işlem yapılması performansı olumlu y&amp;ouml;nde etkiler.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Ne kastetmek istediğimizi anlayabilmek i&amp;ccedil;in aşağıdaki kod par&amp;ccedil;asında verilen &amp;ouml;rneği g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void DiziTest(int x)
{
    int[,] dizi = new int[x, x];
    DateTime dtBaslangic, dtBitis;
    TimeSpan tsFark;

    dtBaslangic = DateTime.Now;
    for (int i = 0; i &amp;lt; x; i++)
        for (int j = 0; j &amp;lt; x; j++)
            dizi[i, j] = i + j;
    dtBitis = DateTime.Now;
    tsFark = dtBitis - dtBaslangic;
    Console.WriteLine("Ge&amp;ccedil;en s&amp;uuml;re...{0} saniye.", tsFark.TotalSeconds);

    dtBaslangic = DateTime.Now;
    for (int i = 0; i &amp;lt; x; i++)
        for (int j = 0; j &amp;lt; x; j++)
            dizi[j, i] = i + j;
    dtBitis = DateTime.Now;
    tsFark = dtBitis - dtBaslangic;
    Console.WriteLine("Ge&amp;ccedil;en s&amp;uuml;re...{0} saniye.", tsFark.TotalSeconds);
}

static void Main(string[] args)
{
    for (int testSayisi = 0; testSayisi &amp;lt; 5; testSayisi++)
    {
        DiziTest(6000);
        Console.WriteLine("-------------");
    }
}&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında, iki boyutlu bir diziye eleman atanışları i&amp;ccedil;in iki adet i&amp;ccedil;-i&amp;ccedil;e ge&amp;ccedil;miş d&amp;ouml;ng&amp;uuml; kullandığımızı g&amp;ouml;r&amp;uuml;yorsunuz. Bu d&amp;ouml;ng&amp;uuml;ler arasında ki tek fark dizi elemanlarına erişim şekli. İlk d&amp;ouml;ng&amp;uuml;de i,j sırası kullanılırken ikinci d&amp;ouml;ng&amp;uuml;m&amp;uuml;zde j,i sırası kullanılıyor. İkinci i&amp;ccedil; - i&amp;ccedil;e d&amp;ouml;ng&amp;uuml;m&amp;uuml;zde aslında i,j sırasında bir iterasyon yapılmasına rağmen dizi elemanlarına j,i sırasında erişilmekte. Bu hepimizin g&amp;ouml;zden ka&amp;ccedil;ırabileceği bir nokta. Dalgınlık sonucu dahi bu tarz bir kod satırı yazma ihtimalimiz var. Peki ya bu tarz bir yazımın sonu&amp;ccedil;ları ne olabilir? D&amp;ouml;ng&amp;uuml;lerin &amp;ccedil;alışmalarının sonucu aynı olsa da aşağıdaki şekil aradaki farkı a&amp;ccedil;ık&amp;ccedil;a ortaya koymaktadır. Sistemden siteme s&amp;uuml;reler fark g&amp;ouml;sterebilir, ancak iki d&amp;ouml;ng&amp;uuml; mekanizmasının arasındaki s&amp;uuml;re farkı &amp;ccedil;ok a&amp;ccedil;ık ve belirgindir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk129_6.gif" alt="" width="292" height="251" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Elbette aynı durum boyutları farklı bir dizi i&amp;ccedil;inde ge&amp;ccedil;erlidir. &amp;Ouml;rneğimizdeki d&amp;ouml;ng&amp;uuml; yapılarını aşağıdaki gibi değiştirelim ve tekrar deneyelim.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void DiziTest(int x,int y)
{
    int[,] dizi = new int[x, y];
    DateTime dtBaslangic, dtBitis;
    TimeSpan tsFark;

    dtBaslangic = DateTime.Now;
    for (int i = 0; i &amp;lt; x; i++)
        for (int j = 0; j &amp;lt; y; j++)
            dizi[i, j] = i + j;
    dtBitis = DateTime.Now;
    tsFark = dtBitis - dtBaslangic;
    Console.WriteLine("Ge&amp;ccedil;en s&amp;uuml;re...{0} saniye.", tsFark.TotalSeconds);

    dtBaslangic = DateTime.Now;
    for (int i = 0; i &amp;lt; y; i++)
        for (int j = 0; j &amp;lt; x; j++)
            dizi[j, i] = i + j;
    dtBitis = DateTime.Now;
    tsFark = dtBitis - dtBaslangic;
    Console.WriteLine("Ge&amp;ccedil;en s&amp;uuml;re...{0} saniye.", tsFark.TotalSeconds);
}

static void Main(string[] args)
{
    for (int testSayisi = 0; testSayisi &amp;lt; 5; testSayisi++)
    {
        DiziTest(6000,5000);
        Console.WriteLine("-------------");
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk129_7.gif" alt="" width="300" height="263" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu kez s&amp;uuml;reler biraz daha uzamış g&amp;ouml;r&amp;uuml;n&amp;uuml;yor. &amp;Ouml;zellikle ikinci i&amp;ccedil;-i&amp;ccedil;e d&amp;ouml;ng&amp;uuml;de. Burada en b&amp;uuml;y&amp;uuml;k etkenlerden birisi x-y sırası yerine y-x sırasını tercih edişimizdir. Bunu yapmamızın sebebi tahmin edeceğiniz gibi IndexOutOfRangeException istisnasından kurtulmaktır. Bu k&amp;uuml;&amp;ccedil;&amp;uuml;k hileye rağmen dizi boyutlarına ters sırada erişilmeye &amp;ccedil;alışılması, performansı olumsuz y&amp;ouml;nde etkiler. Elbetteki geliştirdiğimiz uygulamalarda &amp;ccedil;oğu zaman bu tip &amp;ccedil;ok boyutlu d&amp;ouml;ng&amp;uuml;leri kullanmayabiliriz. O sebepten her iki kullanımda derleme zamanı hatası vermeyeceği gibi d&amp;uuml;zg&amp;uuml;n bir bi&amp;ccedil;imde &amp;ccedil;alışacaktır. &amp;Ouml;zellikle k&amp;uuml;&amp;ccedil;&amp;uuml;k boyutlu dizilerde bu farklar &amp;ccedil;ok ama &amp;ccedil;ok azdır. Yine de siz siz olun ve profesyonel bir yazılım geliştirici olarak bu &amp;ouml;neriyi ve daha &amp;ouml;ncekilerini dikkate alın. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2005-07-14 09:00:00</pubDate>
  <slug>Dizilere(Arrays)-İlişkin-Üç-Basit-Öneri-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>arrays</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>