<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Enumerators</title>
  <description>Bugünkü makalemizde, kendi değer türlerimizi oluşturmanın yollarından birisi olan Enumerator’ları inceleyeceğiz. C# dilinde veri depolamak için kullanabileceğim temel veri türleri yanında kendi tanımlayabileceğimiz türlerde vardır. Bunlar Structs(Yapılar), Arrays(Diziler) ve Enumerators(Numaralandırıcılar) dır. Numaralandırıcılar, sınırlı sayıda değer içeren değişkenler yaratmamıza olanak sağlarlar. Burada bahsi geçen değişken değerleri bir grup oluştururlar ve sembolik bir adla temsil edilirler. Numaralandırıcıları kullanma nedenlerimizden birisi verilere anlamlar yüklekleyerek, program içerisinde kolay okunabilmelerini ve anlaşılabilmelerini sağlamaktır. Örneklerimizde bu konuyu çok daha iyi anlıyacaksınız. Bir Numaralandırıcı tanımlamak için aşağıdaki syntax kullanılır.</description>
  <content>&lt;p&gt;Değerli Okurlarım,&amp;nbsp; Merhabalar.&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde, kendi değer t&amp;uuml;rlerimizi oluşturmanın yollarından birisi olan Enumerator&amp;rsquo;ları inceleyeceğiz. C# dilinde veri depolamak i&amp;ccedil;in kullanabileceğim temel veri t&amp;uuml;rleri yanında kendi tanımlayabileceğimiz t&amp;uuml;rlerde vardır. Bunlar Structs(Yapılar), Arrays(Diziler) ve Enumerators(Numaralandırıcılar) dır. Numaralandırıcılar, sınırlı sayıda değer i&amp;ccedil;eren değişkenler yaratmamıza olanak sağlarlar. Burada bahsi ge&amp;ccedil;en değişken değerleri bir grup oluştururlar ve sembolik bir adla temsil edilirler. Numaralandırıcıları kullanma nedenlerimizden birisi verilere anlamlar y&amp;uuml;klekleyerek, program i&amp;ccedil;erisinde kolay okunabilmelerini ve anlaşılabilmelerini sağlamaktır. &amp;Ouml;rneklerimizde bu konuyu &amp;ccedil;ok daha iyi anlıyacaksınız. Bir Numaralandırıcı tanımlamak i&amp;ccedil;in aşağıdaki syntax kullanılır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Kapsam belirte&amp;ccedil;leri

enum numaralandırıcıAdi
{

     birinciUye,

     ikinciUye,

     ucuncuUye,

} &lt;/pre&gt;
&lt;p&gt;Kapsam belirte&amp;ccedil;leri protected,public,private,internal yada new değerini alır ve numaralandırıcının yaşayacağı kapsamı belirtir. Dikkat edilecek olursa, elemanlara herhangibi değer ataması yapılmamıştır. Nitekim Numaralandırıcıların &amp;ouml;zelliğidir bu. İlk eleman 0 değerine sahip olmak &amp;uuml;zere diğer elemanlar 1 ve 2 değerlerini sahip olucak şekilde belirlenirler. Dolayısıyla programın herhangibir yerinde bu numaralandırıcıya ait elemana ulaştığımızda, bu elemanın index değerine erişmiş oluruz. G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi numaralandırıcı kullanmak okunurluğu arttırmaktadır.Dilersek numaralandırıc elemanlarının 0 indexinden değil de her hangibir değerden başlamasını sağlayabilir ve hatta diğer elemanlarada farklı index değerleri atayabiliriz. Basit bir Numaralandırıcı &amp;ouml;rneği ile konuyu daha iyi anlamaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace enumSample1
{
    class Class1
    {
        /* Haftanın g&amp;uuml;nlerini temsil edicek bir numaralandırıcı tipi oluşturuyoruz. Pazartesi 0 index değerine sahip iken Pazar 6 index değerine sahip olucaktır.*/
        enum Gunler
        {
            Pazartesi,
            Sali,
            Carsamba,
            Persembe,
            Cuma,
            Cumartesi,
            Pazar
        }

        static void Main(string[] args)
        {
            Console.WriteLine("Pazartesi g&amp;uuml;n&amp;uuml;n&amp;uuml;n değeri={0}", (int)Gunler.Pazartesi);
            Console.WriteLine("&amp;Ccedil;arşamba g&amp;uuml;n&amp;uuml;n değeri={0}", (int)Gunler.Carsamba);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Burada Gunler. Yazdıktan sonar VS.NET &amp;lsquo;in intellisense &amp;ouml;zelliği sayesinde, numaralandırıcının sahip olduğu değerler kolayca ulaşabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &lt;img src="/makale/images/mk11_1.jpg" alt="" width="200" height="178" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 1. Intellisense sağolsun.&amp;nbsp;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Programı &amp;ccedil;alıştıracak olursak aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&amp;nbsp;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &lt;img src="/makale/images/mk11_2.jpg" alt="" width="280" height="89" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 2. Ilk Ornek&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdi başka bir &amp;ouml;rnek geliştirelim. Bu kez numaralandırıcının değerleri farklı olsun. &amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;enum Artis
{
     Memur=15,
     Isci=10,
     Muhendis=8,
     Doktor=17,
     Asker=12
} 

static void Main(string[] args)
{
     Console.WriteLine("Memur maaşı zam artış oranı={0}",(int)Artis.Memur);
     Console.WriteLine("Muhendis maaşı zam artış oranı= {0}",(int)Artis.Muhendis); 
}&lt;/pre&gt;
&lt;p&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &lt;img src="/makale/images/mk11_3.jpg" alt="" width="327" height="86" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil&lt;/em&gt; &lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;3. İkinci &amp;Ouml;rneğin Sonucu&lt;/em&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edicek olursak, numaralandırıcıları program i&amp;ccedil;inde kullanırken, a&amp;ccedil;ık olarak (explicit) bir d&amp;ouml;n&amp;uuml;ş&amp;uuml;m yapmaktayız. Şu ana kadar numaralandırıcı elemanlarınıa integer değerler atadık. Ama dilersek Long tipinden değerde atayabiliriz. Fakat bu durumda enum &amp;lsquo; ın değer t&amp;uuml;r&amp;uuml;n&amp;uuml;de belirtmemiz gerekmektedir.&amp;Ouml;rneğin,&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;enum Sinirlar:long
{
     EnBuyuk=458796452135L,
     EnKucuk=255L
} 

static void Main(string[] args)
{
    Console.WriteLine("En &amp;uuml;st sınır={0}",(long)Sinirlar.EnBuyuk);
    Console.WriteLine("Muhendis maaşı zam artış oranı={0}",(long)Sinirlar.EnKucuk);
} &lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Sinirlar isimli numaralandırıcı long tipinde belirtilmiştir. Bu sayede numaralandırıcı elemanlarına long veri tipinde değerler atanabilmiştir. Dikkat edilecek bir diğer noktada, bu elemanlara ait değerleri kullanırken, long tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme yapılmasıdır.&amp;nbsp; Bir numaralandırıcı varsayılan olarak integer tiptedir. Bu nedenle integer değerleri olan bir numaralandırıcı tanımlanırken int olarak belirtilmesine gerek yoktur.&amp;nbsp; Şimdi daha &amp;ccedil;ok işe yarar bir &amp;ouml;rnek geliştirmeye &amp;ccedil;alışalım. Uygulamamız son derece basit bir forma sahp ve bir ka&amp;ccedil; satır koddan oluşuyor. Amacımız numaralandırıcı kullanmanın programcı a&amp;ccedil;ısından işleri daha da kolaylaştırıyor olması. Uygulamamız bir Windows Application. Form tasarımımız aşağıdaki gibi olucak.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &lt;img src="/makale/images/mk11_4.jpg" alt="" width="304" height="176" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil&lt;/em&gt; &lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;4. Form Tasarımımız.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Form y&amp;uuml;klenirken Şehir Kodlarının yer aldığı comboBox kontrol&amp;uuml;m&amp;uuml;z otomatik olarak numaralandırıcının yardımıyla doldurulucak. İşte program kodları.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public enum AlanKodu
{
     Anadolu=216,
     Avrupa=212,
     Ankara=312,
     Izmir=412
}

private void Form1_Load(object sender, System.EventArgs e)
{
     comboBox1.Items.Add(AlanKodu.Anadolu);
     comboBox1.Items.Add(AlanKodu.Ankara);
     comboBox1.Items.Add(AlanKodu.Avrupa);
     comboBox1.Items.Add(AlanKodu.Izmir);
}&lt;/pre&gt;
&lt;p&gt;İşte&amp;nbsp; sonu&amp;ccedil;, &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &lt;img src="/makale/images/mk11_5.jpg" alt="" width="304" height="176" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 5 . Sonu&amp;ccedil; .&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Aslında&amp;nbsp; bu comboBox kontrol&amp;uuml;n&amp;uuml; başka şekillerde de alan kodları ile y&amp;uuml;kleyebiliriz . Bunu yapmanın sayısız yolu var. Burada asıl dikkat etmemiz gereken nokta numaralandırıcı sayesinde bu sayısal kodlarla kafamızı karıştırmak yerine daha bilinen isimler ile aynı sonuca ulaşmamızdır. Geldik bir makalemizin daha sonuna.&amp;nbsp; İlerliyen makalelerimizde bu kez yine kendi değer tiplerimizi nasıl yaratabileceğimize struct kavramı ile devam edeceğiz. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2003-12-01 12:00:00</pubDate>
  <slug>Enumerators-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>enums</tag>
    <tag>enumerator</tag>
    <tag>type</tag>
    <tag>class</tag>
    <tag>delegate</tag>
    <tag>interface</tag>
    <tag>cts</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>