<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Servis Operasyonlarını Kod Yardımıyla İzlemek</title>
  <description>Aslında bu günkü yazımızda bir WCF(Windows Communication Foundation) servisinin operasyonlarına gelen çağrılar hakkında istihbarat toplamaya çalışıyor olacağız. Ancak bunun için standart Trace ve Monitoring özellikleri yerine kod yardımıyla ilerleyeceğiz.</description>
  <content>&lt;p&gt;&lt;a href="/pics/blg219_Giris.jpg"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border-width: 0px;" title="blg219_Giris" src="/pics/blg219_Giris_thumb.jpg" alt="blg219_Giris" width="242" height="182" align="right" border="0" /&gt;&lt;/a&gt; Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Savaş meydanlarında ezelden beri uygulanan istihbarat ve haber alma teknikleri, avantaj sağlamak a&amp;ccedil;ısından en &amp;ouml;nemli unsurların başında gelmektedir. Karşı tarafın nerede olduğunu izlemek, ne yaptığını bilmek, istenen bir anda ne kadar ateş g&amp;uuml;c&amp;uuml;ne sahip olduğunu tespit etmek &amp;ccedil;ok &amp;ouml;nemlidir. &amp;Ouml;rneğin karşı tarafın şu anda denizde hareket etmekte olan veya karasal alanda saklanmakta olan kuvvetlerini g&amp;ouml;rmek istediğimiz durumlarda keşif yapılması ve istihbarat toplanması stratejik anlamda &amp;ouml;nemli avantajlar sağlayacaktır.&lt;/p&gt;
&lt;p&gt;Yakın zamana kadar bu işler i&amp;ccedil;in y&amp;uuml;ksek irtifalardan, ses hızının bir ka&amp;ccedil; kat &amp;uuml;st&amp;uuml;nde u&amp;ccedil;an u&amp;ccedil;aklar g&amp;ouml;rev alırdı ki halen daha pek &amp;ccedil;ok hava kuvvetlerince kullanılmaktadır. &amp;Ouml;rneğin bir zamanlar Birleşik Devletler ile Sovyetler Birliği arasında krize neden olan U2&amp;rsquo; ler, şekli ve harcadığı yakıt ile &amp;uuml;n salıp emekli olan SR71 Blackbird&amp;rsquo; ler vs&amp;hellip;&lt;/p&gt;
&lt;p&gt;Ancak artık uzaktan kumanda edilebilen, d&amp;uuml;şt&amp;uuml;klerinde pilot kaybı yaşanmasını engelleyen, insansız olmaları nedeni ile &amp;ccedil;ok y&amp;uuml;ksek irtifalara kadar &amp;ccedil;ıkabilen &lt;strong&gt;İnsansız Hava Ara&amp;ccedil;ları(Unmanned Aeiral Vehicle)&lt;/strong&gt; var. Aslında uzun s&amp;uuml;redir varlar&lt;em&gt;(&amp;Uuml;stelik ben Generals oyununda da sıklıkla bunları kullanıyorum&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; &lt;/em&gt;Hatta ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde bizimde gurur kaynağımız olan &lt;strong&gt;ANKA&lt;/strong&gt; isimli insanız hava aracımız, ilk kez hangardan &amp;ccedil;ıkarak u&amp;ccedil;uşunu ger&amp;ccedil;ekleştirdi. Peki bu İHA&amp;rsquo; ların bu g&amp;uuml;nk&amp;uuml; yazımız ile bir bağlantısı var mı? Pek olduğunu s&amp;ouml;yleyemeyiz.&lt;/p&gt;
&lt;p&gt;Aslında bu g&amp;uuml;nk&amp;uuml; yazımızda bir &lt;strong&gt;WCF(Windows Communication Foundation)&lt;/strong&gt; servisinin operasyonlarına gelen &amp;ccedil;ağrılar hakkında istihbarat toplamaya &amp;ccedil;alışıyor olacağız. Ancak bunun i&amp;ccedil;in standart &lt;strong&gt;Trace&lt;/strong&gt; ve &lt;strong&gt;Monitoring&lt;/strong&gt; &amp;ouml;zellikleri yerine kod yardımıyla ilerleyeceğiz. Normal şartlarda&lt;strong&gt; IIS(Internet Information Services)&lt;/strong&gt; &amp;uuml;zerinden yayınlanan bir &lt;strong&gt;WCF&lt;/strong&gt; servisine gelen operasyon &amp;ccedil;ağrılarını izlemek son derece kolaydır. Bu ama&amp;ccedil;la konfigurasyon dosyasında gerekli ayarların yapılması yeterlidir. Diğer taraftan istenirse&lt;strong&gt; Windows Server AppFabric&lt;/strong&gt; ile &lt;strong&gt;IIS&lt;/strong&gt; &amp;uuml;zerine gelen eklentilerden yararlanarak bu tip izleme ayarları kolaylıkla yapılabilir.&lt;/p&gt;
&lt;p&gt;Lakin bizim amacımız geliştirme safhasında&lt;strong&gt; Self-Hosted&lt;/strong&gt; tekniğine g&amp;ouml;re yayınlanan servis operasyonlarına gelen &amp;ccedil;ağrıları yakalamak ve basit bilgiler almaktır. Geliştireceğimiz bu senaryonun bize sağlayacağı &amp;ouml;nemli artılar da vardır. İlk etapta kod yardımıyla &amp;ouml;zelleştirilmiş bir servis davranışının &amp;ccedil;alışma zamanındaki &lt;strong&gt;ServiceHost&lt;/strong&gt; &amp;ouml;rneğine nasıl entegre edilebileceği &amp;ouml;ğrenilecektir. Diğer yandan operasyonlara olan taleplerin ve d&amp;ouml;n&amp;uuml;şlerin &amp;ccedil;ok basit mana da izlenmesi sağlanacak ve karmaşık &lt;strong&gt;Trace&lt;/strong&gt; &amp;ccedil;ıktıları arasında kaybolunmayacaktır. Dilerseniz hi&amp;ccedil; vakit kaybetmeden işlemlerimize başlayalım. Başlangı&amp;ccedil;ta aşağıdaki &lt;strong&gt;sınıf diagramında(Class Diagram)&lt;/strong&gt; g&amp;ouml;r&amp;uuml;len yapıya sahip bir servis k&amp;uuml;t&amp;uuml;phanemiz olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg219_ServiceClassDiagram.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg219_ServiceClassDiagram" src="/pics/blg219_ServiceClassDiagram_thumb.gif" alt="blg219_ServiceClassDiagram" width="424" height="313" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re &lt;strong&gt;IAccountService&lt;/strong&gt; isimli &lt;strong&gt;Servis S&amp;ouml;zleşmemizin(Service Contract)&lt;/strong&gt; i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ServiceModel;

namespace AdventureWorksFinance 
{ 
    [ServiceContract(Name="AdventureWorks.FinanceServices", Namespace="http://AdventureWorks/Finance/Services")] 
    public interface IAccountService 
    { 
        [OperationContract] 
        double GetTotalSalaryByDepartment(string departmentCode);

        [OperationContract] 
        double GetTotalGains(); 
    } 
}

Diğer taraftan s&amp;ouml;z konusu servis s&amp;ouml;zleşmesini uygulayan AccountService sınıfının i&amp;ccedil;eriği de aşağıdaki gibidir.

namespace AdventureWorksFinance 
{ 
    public class AccountService 
        : IAccountService 
    { 
        #region IAccountService Members

        public double GetTotalSalaryByDepartment(string departmentCode) 
        { 
            return 1245000; 
        }

        public double GetTotalGains() 
        { 
            return 2500000; 
        }

        #endregion 
    } 
}&lt;/pre&gt;
&lt;p&gt;Bu servis i&amp;ccedil;eriğine sahip olan &lt;strong&gt;k&amp;uuml;t&amp;uuml;phanemiz(WCF Service Library),&lt;/strong&gt; bir &lt;strong&gt;WinForms&lt;/strong&gt; uygulamasına referans edilmiş durumdadır. &lt;strong&gt;WinForms&lt;/strong&gt; uygulaması &lt;strong&gt;Host&lt;/strong&gt; program olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Yani &lt;strong&gt;ServiceHost&lt;/strong&gt; tipi yardımıyla &lt;strong&gt;AccountService&lt;/strong&gt; hizmetini dış d&amp;uuml;nyaya sunmak &amp;uuml;zere tasarlanmaktadır. Bu ama&amp;ccedil;la aray&amp;uuml;z&amp;uuml;m&amp;uuml;z&amp;uuml; aşağıdaki gibi tasarladığımızı d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg219_WinForm.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg219_WinForm" src="/pics/blg219_WinForm_thumb.gif" alt="blg219_WinForm" width="322" height="321" border="0" /&gt;&lt;/a&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re kullanıcı &lt;strong&gt;Open&lt;/strong&gt; başlıklı d&amp;uuml;ğmeye basarak servisi yayına sunacak ve &lt;strong&gt;Close&lt;/strong&gt; d&amp;uuml;ğmesi ile de kapatacaktır. WinForms uygulaması aşağıdaki &lt;strong&gt;app.config&lt;/strong&gt; i&amp;ccedil;eriğine sahiptir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt; 
&amp;lt;configuration&amp;gt; 
    &amp;lt;system.serviceModel&amp;gt; 
        &amp;lt;behaviors&amp;gt; 
            &amp;lt;serviceBehaviors&amp;gt; 
                &amp;lt;behavior name="TcpServiceBehavior"&amp;gt; 
                    &amp;lt;serviceMetadata/&amp;gt; 
                    &amp;lt;serviceDebug includeExceptionDetailInFaults="false" /&amp;gt; 
                &amp;lt;/behavior&amp;gt; 
            &amp;lt;/serviceBehaviors&amp;gt; 
        &amp;lt;/behaviors&amp;gt; 
        &amp;lt;services&amp;gt; 
            &amp;lt;service name="AdventureWorksFinance.AccountService" behaviorConfiguration="TcpServiceBehavior"&amp;gt; 
               &amp;lt;endpoint address="" binding="netTcpBinding" bindingConfiguration="" 
                    contract="AdventureWorksFinance.IAccountService"&amp;gt; 
                &amp;lt;/endpoint&amp;gt; 
                &amp;lt;endpoint address="mex" binding="mexTcpBinding" bindingConfiguration="" 
                    contract="IMetadataExchange" /&amp;gt; 
                &amp;lt;host&amp;gt; 
                    &amp;lt;baseAddresses&amp;gt; 
                        &amp;lt;add baseAddress="net.tcp://localhost:4505/AdventureWorksFinance/AccountService/" /&amp;gt; 
                    &amp;lt;/baseAddresses&amp;gt; 
                &amp;lt;/host&amp;gt; 
            &amp;lt;/service&amp;gt; 
        &amp;lt;/services&amp;gt; 
    &amp;lt;/system.serviceModel&amp;gt; 
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Servisimiz &lt;strong&gt;TCP&lt;/strong&gt; protokol&amp;uuml;ne g&amp;ouml;re yayın yapmaktadır. Ayrıca &lt;strong&gt;MexTcpBinding&lt;/strong&gt; bağlayıcı tipini kullanarak &lt;strong&gt;Metadata&lt;/strong&gt; yayını da yapmaktadır. Dolayısıyla istemciler kendileri i&amp;ccedil;in gerekli &lt;strong&gt;Proxy&lt;/strong&gt; tiplerini &amp;uuml;retmek amacıyla &lt;strong&gt;WSDL&lt;/strong&gt; i&amp;ccedil;eriğine ulaşabilirler.&lt;/p&gt;
&lt;p&gt;Gelelim WinForms&amp;rsquo; un başlangı&amp;ccedil;ta arka plandaki kodlarına&lt;em&gt;(Tam anlamıyla Buton Arkası Kodlarına &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt;)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.ServiceModel; 
using System.Windows.Forms; 
using AdventureWorksFinance;

namespace HostApp 
{ 
    public partial class Form1 
        : Form 
    { 
        ServiceHost host=null;

        public Form1() 
        { 
            InitializeComponent(); 
            btnOpen.Enabled = true; 
            btnClose.Enabled = false; 
        }

        private void btnOpen_Click(object sender, EventArgs e) 
        { 
            host=new ServiceHost(typeof(AccountService)); 
            host.Opened += (s, ea) =&amp;gt; 
            { 
                lstOperationCalls.Items.Add(String.Format("Servis a&amp;ccedil;ık {0}",DateTime.Now.ToLongTimeString())); 
                btnOpen.Enabled = false; 
                btnClose.Enabled = true; 
            }; 
            host.Closed += (s, ea) =&amp;gt; 
            { 
                lstOperationCalls.Items.Add(String.Format("Servis kapatıldı {0}", DateTime.Now.ToLongTimeString())); 
                btnOpen.Enabled = true; 
                btnClose.Enabled = false; 
            }; 
            host.Open(); 
        }

        private void btnClose_Click(object sender, EventArgs e) 
        { 
            host.Close(); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&amp;Ccedil;ok basit olarak &amp;ouml;zetlemek gerekirse, &lt;strong&gt;ServiceHost&lt;/strong&gt; sınıfına ait nesne &amp;ouml;rneği &amp;uuml;retilirken &lt;strong&gt;AccountService&lt;/strong&gt; tipini parametre olarak almaktadır. Yani AccountService servisi yayına alınmaktadır. Bu servis &amp;uuml;zerinden &lt;strong&gt;Open&lt;/strong&gt; ve &lt;strong&gt;Close&lt;/strong&gt; işlemlerinin uygulanması halinde &lt;strong&gt;Opened&lt;/strong&gt; ve &lt;strong&gt;Closed&lt;/strong&gt; olay metodları devreye girmektedir.&lt;/p&gt;
&lt;p&gt;Kahveleriniz yanınızda değil mi ?&lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt; Artık asıl işlemlerimize başlayabiliriz. İlk olarak i&amp;ccedil;eriği aşağıda g&amp;ouml;r&amp;uuml;len ve &lt;strong&gt;IParameterInspector&lt;/strong&gt; &lt;strong&gt;aray&amp;uuml;z&amp;uuml;n&amp;uuml;(Interface)&lt;/strong&gt; uygulayan bir sınıf geliştirerek yola &amp;ccedil;ıkalım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg219_TextFileInspector.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg219_TextFileInspector" src="/pics/blg219_TextFileInspector_thumb.gif" alt="blg219_TextFileInspector" width="612" height="286" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.IO; 
using System.ServiceModel.Dispatcher; 
using System.Text;

namespace InspectorLib 
{ 
    public class TextFileInspector 
        :IParameterInspector 
    { 
        public string ServiceName { get; set; } 
        private string _textFilePath = Path.Combine(Environment.CurrentDirectory, "OperationCallLog.txt"); 
        private StringBuilder builder = new StringBuilder();

        public TextFileInspector(string serviceName) 
        { 
            ServiceName = serviceName;            
        } 
        #region IParameterInspector Members

        public void AfterCall(string operationName, object[] outputs, object returnValue, object correlationState) 
        { 
            builder.AppendLine(String.Format("After Call -&amp;gt; Service {0}, Time {1}, Operation Name {2}", ServiceName,DateTime.Now.ToLongTimeString(), operationName)); 
            builder.AppendLine("Return Value"); 
            builder.AppendLine(returnValue.ToString());

            StreamWriter writer = File.AppendText(_textFilePath); 
            writer.WriteLine(builder.ToString()); 
            writer.Close(); 
        }

        public object BeforeCall(string operationName, object[] inputs) 
        { 
            builder.AppendLine(String.Format("Before Call -&amp;gt; Service {0}, Time {1}, Operation Name {2}",ServiceName,DateTime.Now.ToLongTimeString(),operationName)); 
            builder.AppendLine("Inputs"); 
            foreach (object input in inputs) 
            { 
                builder.AppendLine(inputs[0].ToString()); 
            }

            StreamWriter writer = File.AppendText(_textFilePath); 
            writer.WriteLine(builder.ToString()); 
            writer.Close();

            return builder.ToString(); 
        }

        #endregion 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;TextFileInspector&lt;/strong&gt; sınıfı, &lt;strong&gt;IParameterInspector aray&amp;uuml;z&amp;uuml;n&amp;uuml;(Interface)&lt;/strong&gt; uygulamaktadır. Bu aray&amp;uuml;z g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;AfterCall&lt;/strong&gt; ve &lt;strong&gt;BeforeCall&lt;/strong&gt; isimli iki metodun ezilmesini istemektedir. &lt;strong&gt;BeforeCall &lt;/strong&gt;metodu ile operasyona yapılan &amp;ccedil;ağrıya ait bilgiler yakalanabilir. Aslında operasyon başlatılmadan &amp;ouml;nce, yakalandığı yer olarakta d&amp;uuml;ş&amp;uuml;nebiliriz. &lt;strong&gt;AfterCall&lt;/strong&gt; metodu hangi operasyona &amp;ccedil;ağrı yapılığına dair &lt;strong&gt;operationName&lt;/strong&gt; parametresini kullanmaktadır. Diğer yandan &lt;strong&gt;object&lt;/strong&gt; dizisi tipinden olan &lt;strong&gt;inputs&lt;/strong&gt; parametresi ile, &amp;ccedil;ağrıda bulunulan operasyona gelen giriş değerleri &amp;ouml;ğrenilebilir. Benzer şekilde &lt;strong&gt;AfterCall&lt;/strong&gt; fonksiyonunu da, operasyondan istemciye cevap d&amp;ouml;nerken değerlendirilebilir. B&amp;ouml;ylece istemciye hangi operasyon i&amp;ccedil;in hangi değerin d&amp;ouml;nd&amp;uuml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; yakalanabilir. Her iki metod da, &lt;strong&gt;Text&lt;/strong&gt; tabanlı bir dosyaya bilgi yazmakta ve raporlamayı bu şekilde ger&amp;ccedil;ekleştirmektedir. Ama bu bir zorunluluk değildir. Burada &lt;strong&gt;ListBox&lt;/strong&gt; i&amp;ccedil;eriğine bilgilendirme ama&amp;ccedil;lı &amp;ouml;ğe eklenmesi de sağlanabilir, bir veritabanı tablosuna yazma işlemi de ger&amp;ccedil;ekleştirilebilir.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak bu sınıfın &amp;ccedil;alışma zamanına bir şekilde &amp;ouml;ğretilmesi gerekmektedir. Bu noktada servis metodları ve servise s&amp;ouml;z konusu tipin bildirilmesi gerektiğini d&amp;uuml;ş&amp;uuml;nebiliriz. Servis operasyonları i&amp;ccedil;in bu tip bir davranış uygulanacağı &lt;strong&gt;nitelikler(Attributes)&lt;/strong&gt; yardımıyla kolayca &amp;ouml;ğretilebilir &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Dolayısıyla ilk olarak servis operasyonları i&amp;ccedil;in &lt;strong&gt;TextFileInspector&lt;/strong&gt; tipinin bir davranış olarak bildirilmesi gerekmektedir. Bu ama&amp;ccedil;la aşağıdaki sınıfı tasarlamamız yeterli olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg219_TextFileInspectorOperationBehavior.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg219_TextFileInspectorOperationBehavior" src="/pics/blg219_TextFileInspectorOperationBehavior_thumb.gif" alt="blg219_TextFileInspectorOperationBehavior" width="279" height="214" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.ServiceModel.Description;

namespace InspectorLib 
{ 
    [AttributeUsage(AttributeTargets.Method)] 
    public class TextFileInspectorOperationBehavior 
        :Attribute,IOperationBehavior 
    { 
        #region IOperationBehavior Members

        public void AddBindingParameters(OperationDescription operationDescription, System.ServiceModel.Channels.BindingParameterCollection bindingParameters) 
        { 
        }

        public void ApplyClientBehavior(OperationDescription operationDescription, System.ServiceModel.Dispatcher.ClientOperation clientOperation) 
        { 
        }

        public void ApplyDispatchBehavior(OperationDescription operationDescription, System.ServiceModel.Dispatcher.DispatchOperation dispatchOperation) 
       { 
            if(dispatchOperation.Parent.Type!=null) 
                dispatchOperation.ParameterInspectors.Add(new TextFileInspector(dispatchOperation.Parent.Type.Name));   
        }

        public void Validate(OperationDescription operationDescription) 
        { 
        }

        #endregion 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;TextFileInspectorOperationBehavior&lt;/strong&gt; sınıfı, metodlara uygulanabilen bir operasyonel davranış tipi olarak tasarlanmıştır. Bu nedenle &lt;strong&gt;IOperationBehavior&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamaktadır. Bu aray&amp;uuml;z&amp;uuml;n senaryomuza g&amp;ouml;re en &amp;ouml;nemli metodu ise &lt;strong&gt;ApplyDispatchBehavior&lt;/strong&gt; fonksiyonudur. Bu fonksiyon i&amp;ccedil;erisinde dikkat edileceği &amp;uuml;zere &lt;strong&gt;TextFileInspector&lt;/strong&gt; isimli sınıfımıza ait bir nesne &amp;ouml;rneğinin &lt;strong&gt;ParameterInspectors&lt;/strong&gt; koleksiyonuna eklendiği g&amp;ouml;r&amp;uuml;lmektedir. Dolayısıyla operasyonların yakalanması sırasında kullanılacak olan tipin bildirimi sağlanmıştır. Buna g&amp;ouml;re &amp;ccedil;alışma zamanında &lt;strong&gt;TextFileInspectorOperationBehavior&lt;/strong&gt; niteliğinin uygulandığı servis operasyonlarına gelen &amp;ccedil;ağrılarda, hangi Inspector tipinin devreye gireceği bildirilmiş olmaktadır.&lt;/p&gt;
&lt;p&gt;Aslında bu nitelik bildirimi yeterlidir. Nitekim servis operasyonlarına s&amp;ouml;z konusu niteliğin uygulaması ile zaten &amp;ccedil;alışma zamanı bilgilendirilmiş olacaktır. Ancak bir servisin t&amp;uuml;m operasyonlarının izlenmesi istendiği bir durum s&amp;ouml;z konusu ise t&amp;uuml;m operasyonların başında &lt;strong&gt;TextFileInspectorOperationBehavior&lt;/strong&gt; uygulamak yerine, sınıfın başında bir nitelik ile servis davranışının bildirilmesi daha doğrudur. Bu nedenle servis sınıfına uygulanabilen bir davranışın bildirilmesi &amp;ouml;nemlidir. İşte bu ama&amp;ccedil;la aşağıdaki sınıfı yazmamız yeterli olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg219_TextFileInspectorServiceBehavior.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg219_TextFileInspectorServiceBehavior" src="/pics/blg219_TextFileInspectorServiceBehavior_thumb.gif" alt="blg219_TextFileInspectorServiceBehavior" width="263" height="198" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.ServiceModel.Description;

namespace InspectorLib 
{ 
    [AttributeUsage(AttributeTargets.Class)] 
    public class TextFileInspectorServiceBehavior 
        :Attribute,IServiceBehavior 
    { 
        #region IServiceBehavior Members

        public void AddBindingParameters(ServiceDescription serviceDescription, System.ServiceModel.ServiceHostBase serviceHostBase, System.Collections.ObjectModel.Collection&amp;lt;ServiceEndpoint&amp;gt; endpoints, System.ServiceModel.Channels.BindingParameterCollection bindingParameters) 
        { 
        }

        public void ApplyDispatchBehavior(ServiceDescription serviceDescription, System.ServiceModel.ServiceHostBase serviceHostBase) 
        { 
            foreach (ServiceEndpoint endpoint in serviceDescription.Endpoints) 
                foreach (OperationDescription operation in endpoint.Contract.Operations) 
                    operation.Behaviors.Add(new TextFileInspectorOperationBehavior()); 
        }

        public void Validate(ServiceDescription serviceDescription, System.ServiceModel.ServiceHostBase serviceHostBase) 
        { 
        }

        #endregion 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Attribute&lt;/strong&gt; olarak sınıflara uygulanabilen bir tip s&amp;ouml;z konusudur. Buna g&amp;ouml;re &amp;ouml;rneğimizde yer alan &lt;strong&gt;AccountService&lt;/strong&gt; sınıfına uygulanabilecek bir tiptir. Ayrıca &lt;strong&gt;IServiceBehavior&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n bir implementasyonu s&amp;ouml;z konusudur ki buna g&amp;ouml;re yazılması gereken en &amp;ouml;nemli metod &lt;strong&gt;ApplyDispatchBehavior&lt;/strong&gt; fonksiyonudur. Bu fonksiyon i&amp;ccedil;erisinde servis i&amp;ccedil;erisindeki t&amp;uuml;m &lt;strong&gt;Endpoint&amp;rsquo;&lt;/strong&gt; ler dolaşılmaktadır. Bu &lt;strong&gt;Endpoint&amp;rsquo;&lt;/strong&gt; lerin her birinin de s&amp;ouml;zleşmelerinde tanımlanmış olan operasyonlarına gidilmektedir. Yani &lt;strong&gt;OperationContract&lt;/strong&gt; niteliği uygulanan metodlarına ulaşılır. Bulunan her bir operasyon i&amp;ccedil;in de, az &amp;ouml;nce tanımlanan &lt;strong&gt;TextFileInspectorOperationBehavior&lt;/strong&gt; davranış &amp;ouml;rneği bildirimi yapılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/Exclamation_8.gif"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border-width: 0px;" title="Exclamation" src="/pics/Exclamation_thumb_8.gif" alt="Exclamation" width="48" height="48" align="left" border="0" /&gt;&lt;/a&gt;Bu arada &lt;strong&gt;TextFileInspector&lt;/strong&gt;, &lt;strong&gt;TextFileInspectorOperationBehavior&lt;/strong&gt; ve &lt;strong&gt;TextFileInspectorServiceBehavior&lt;/strong&gt; sınıflarını ayrı bir k&amp;uuml;t&amp;uuml;phane altında toplamamızda yarar vardır. Nitekim s&amp;ouml;z konusu tipleri &lt;strong&gt;Host&lt;/strong&gt; uygulama da ve servis k&amp;uuml;t&amp;uuml;phanesinde kullanmamız gerekmektedir.&lt;/p&gt;
&lt;p&gt;Peki ne servis sınıfında ne de operasyon metodlarında yukarıda tanımlanmış olan nitelikler kullanılmazsa ve biz yine de TextFileInspector tipini kullandırtmak istersek. Bu durumda &amp;ouml;rneğin Host uygulama tarafında aşağıdaki kodlamaları yapmamız yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;TextFileInspectorServiceBehavior tfServiceBehavior = new TextFileInspectorServiceBehavior(); 
TextFileInspectorServiceBehavior sb = host.Description.Behaviors.Find&amp;lt;TextFileInspectorServiceBehavior&amp;gt;(); 
if (sb == null) 
    host.Description.Behaviors.Add(tfServiceBehavior);

host.Open();&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;ServiceHost&lt;/strong&gt; nesne &amp;ouml;rneği &amp;uuml;zerinden &lt;strong&gt;Open&lt;/strong&gt; metodu &amp;ccedil;ağırıldıktan sonra servise &lt;strong&gt;TextFileInspectorServiceBehavior&lt;/strong&gt; davranışının uygulanıp uygulanmadığına bakılmaktadır. Eğer uygulanamışsa &lt;strong&gt;Behaviors&lt;/strong&gt; koleksiyonuna &lt;strong&gt;Add&lt;/strong&gt; metodu ile ekleme işlemi ger&amp;ccedil;ekleştirilmektedir.&lt;/p&gt;
&lt;p&gt;Şimdi gelelim operasyon izleme işleminin niteliklerimiz yardımıyla nasıl bildirileceğine. Bu ama&amp;ccedil;la AccountService sınıfını aşağıdaki gibi g&amp;uuml;ncellememiz yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using InspectorLib;

namespace AdventureWorksFinance 
{ 
    //[TextFileInspectorServiceBehavior] 
    public class AccountService 
        : IAccountService 
    { 
        #region IAccountService Members

        [TextFileInspectorOperationBehavior] 
        public double GetTotalSalaryByDepartment(string departmentCode) 
        { 
            return 1245000; 
        }

        [TextFileInspectorOperationBehavior] 
        public double GetTotalGains() 
        { 
            return 2500000; 
        }

        #endregion 
    } 
}&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rnek kullanımda operasyon metodlarının başında &lt;strong&gt;TextFileInspectorOperationBehavior&lt;/strong&gt; niteliği uygulanmıştır. B&amp;ouml;ylece &amp;ccedil;alışma zamanına hangi operasyonların izleneceği bildirilmiş olmaktadır. Ancak istersek sınıfın başındaki &lt;strong&gt;TextFileInspectorServiceBehavior&lt;/strong&gt; niteliğini etkinleştirerek, servis i&amp;ccedil;erisindeki t&amp;uuml;m metodların, &lt;strong&gt;TextFileInspectorOperationBehavior&lt;/strong&gt; uygulanmadan izlenebilmesi de sağlanabilir &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi senaryomuzu test etmeye başlayabiliriz. Tabi bu ama&amp;ccedil;la basit bir istemci uygulama yazmamız ve servisimizi referans etmemiz gerekmektedir. Burada &lt;strong&gt;Self-Hosted&lt;/strong&gt; bir servis &amp;ccedil;alışma zamanı s&amp;ouml;z konusu olduğundan, &lt;strong&gt;proxy&lt;/strong&gt; &amp;uuml;retimi i&amp;ccedil;in &lt;strong&gt;host&lt;/strong&gt; uygulamanın &amp;ouml;ncelikli olarak &amp;ccedil;alışıtırlması ve servisin a&amp;ccedil;ılması gerektiği unutulmamalıdır. Bu işlemin ardından Mex talebi yapılabilir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg219_AddServiceReference.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg219_AddServiceReference" src="/pics/blg219_AddServiceReference_thumb.gif" alt="blg219_AddServiceReference" width="627" height="505" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Test amacıyla aşağıdaki kodları yazabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using ClientApp.AdventureWorksFinance; 
using System.Threading;

namespace ClientApp 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            Console.WriteLine("Teste başlamak i&amp;ccedil;in servisin a&amp;ccedil;ık olduğundan emin olunuz ve bir tuşa basınız"); 
            Console.ReadLine(); 
            AdventureWorksFinanceServicesClient proxy = new AdventureWorksFinanceServicesClient("NetTcpBinding_AdventureWorks.FinanceServices"); 
            double result=proxy.GetTotalSalaryByDepartment("IT"); 
            Console.WriteLine("{0}",result.ToString()); 
            Thread.Sleep(1000); 
            double totalGains=proxy.GetTotalGains(); 
            Console.WriteLine("{0}",totalGains.ToString()); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncelikli olarak &lt;strong&gt;host&lt;/strong&gt; ve sonrasında &lt;strong&gt;istemci&lt;/strong&gt; uygulamayı &amp;ccedil;alıştırdığımızı d&amp;uuml;ş&amp;uuml;necek olursak aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer sonu&amp;ccedil;larla karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg219_Runtime.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg219_Runtime" src="/pics/blg219_Runtime_thumb.gif" alt="blg219_Runtime" width="557" height="282" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Ancak bizim i&amp;ccedil;in &amp;ouml;nemli olan ve ulaşmak istediğimiz nokta text dosyası i&amp;ccedil;erisine atılan bilgilerdir. İşte sonu&amp;ccedil;lar.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg219_RuntimeResult.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg219_RuntimeResult" src="/pics/blg219_RuntimeResult_thumb.gif" alt="blg219_RuntimeResult" width="621" height="389" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;GetTotalSalaryByDepartment&lt;/strong&gt; ve &lt;strong&gt;GetTotalGains&lt;/strong&gt; metodlarına yapılan &amp;ccedil;ağrıların &amp;ouml;ncesi ve sonrasına ait bilgiler i&amp;ccedil;in &lt;strong&gt;OperationCallLog.txt&lt;/strong&gt; isimli dosya oluşturulmuş ve i&amp;ccedil;eriği &amp;uuml;retilmiştir.&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil; olarak operasyonlara yapılan &amp;ccedil;ağrıları izlemek ve istihbarat toplamak adına buradaki senaryodan yararlanılabilir. Elbette senaryonun geliştirilmesi gereken pek &amp;ccedil;ok yanı vardır. S&amp;ouml;z gelimi şu anki &amp;ouml;rnekte&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;dosya tabanlı &lt;strong&gt;IO&lt;/strong&gt; işlemlerinin sayısı olduk&amp;ccedil;a fazla olabilir. &amp;Ouml;zellikle eş zamanlı gelecek operasyon &amp;ccedil;ağrılarında &lt;strong&gt;StreamWriter&lt;/strong&gt; tipinin &lt;strong&gt;exception&lt;/strong&gt; verme olasılığı&lt;em&gt;(Paylaşılan dosya kaynağı nedeni ile)&lt;/em&gt; an meselesidir &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt;&lt;/li&gt;
&lt;li&gt;Dosya tabanlı olarak yapılan veri toplama işlemi yerine, veritabanı odaklı bir &amp;ccedil;&amp;ouml;z&amp;uuml;mde geliştirilebilir. Yani operasyon &amp;ccedil;ağrılarına ait bilgiler dosya yerine bir veritabanı tablosuna yazdırılabilir.&lt;/li&gt;
&lt;li&gt;Senaryo tek bir servis &amp;ouml;rneğini izleyecek şekilde &amp;ccedil;alışmaktadır. Oysaki host uygulamanın birden fazla servisi dış d&amp;uuml;nyaya sunma olasılığı bulunmaktadır.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bu gibi durumları iyice irdeleyerek ilerlemekte yarar vardır. İşte size &amp;ccedil;alışmak i&amp;ccedil;in bir s&amp;uuml;r&amp;uuml; ev &amp;ouml;devi &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Bu arada &amp;ouml;rnek Solution i&amp;ccedil;erisinde ikinci bir servis daha yer almaktadır. Bu serviside devreye alarak operasyon izleme işlemlerini birden fazla servis i&amp;ccedil;in ger&amp;ccedil;eklemeye &amp;ccedil;alışabilirsiniz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f8%2fOperationCallTracing.rar"&gt;OperationCallTracing.rar (155,62 kb)&lt;/a&gt;&amp;nbsp;&lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 Ultimate S&amp;uuml;r&amp;uuml;m&amp;uuml;nde Geliştirilmiş ve Test Edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2011-02-27 16:20:00</pubDate>
  <slug>Servis-Operasyonlarini-Kod-Yardimiyla-Izlemek</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-40</tag>
    <tag>windows-communication-foundation</tag>
    <tag>iparameterinspector</tag>
    <tag>service-operation-behavior</tag>
  </tags>
  <categories>
    <category>WCF</category>
    <category>WCF 4.0</category>
  </categories>
</post>