<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>C# 4.0 ile Code Contracts</title>
  <description>Uzun süredir ilgimi çeken ama fırsat bulamadığım konulardan birisidir Code Contracts. Özellikle test süreçlerinde önem arz eden ve kodun çalışma zamanında veya kodlama zamanında varsayımsal bazı koşulları sağlayıp sağlamadığını tespit etmemizi sağlayan bir yenilik olarak düşünülebilir...</description>
  <content>&lt;p&gt;&lt;img style="float: left;" src="/pics/2009%2f12%2fblg120_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Microsoft&lt;/strong&gt; gibi dev yazılım firmalarının araştırma geliştirme ekipleri ve labarotuvar &amp;ccedil;alışmaları her&amp;nbsp;zaman ilgimi &amp;ccedil;ekmiştir. Herhalde pek &amp;ccedil;ok yazılımcının hayalleri arasında bu tip firmalarda &amp;ccedil;alışmak ve yeni fikirleri ortaya atarak diğer yazılımcılara sunmak yer almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Microsoft'&lt;/strong&gt; un &lt;strong&gt;DevLabs&lt;/strong&gt; isimli portalında bu tip fikirlerin labarotuvar &amp;ccedil;alışmalarının yer aldığını g&amp;ouml;rebilirsiniz. &amp;Ouml;rneğin son zamanların pop&amp;uuml;ler konularından birisi olan &lt;strong&gt;observable&lt;/strong&gt; koleksiyonları kullanarak &lt;strong&gt;asenkron(Asynchronous)&lt;/strong&gt; ve &lt;strong&gt;olay g&amp;uuml;d&amp;uuml;ml&amp;uuml;(Event Based)&lt;/strong&gt;&amp;nbsp;programlamayı kolaylaştıran&amp;nbsp;&lt;strong&gt;Reactive Extensions,&lt;/strong&gt; yeni başlayanlara yazılım anlatan &lt;strong&gt;Small Basic&lt;/strong&gt; yada &lt;strong&gt;White Box&lt;/strong&gt; testleri i&amp;ccedil;in geliştirilen &lt;strong&gt;Pex&lt;/strong&gt;... Tabi daha pek &amp;ccedil;ok labarotuvar &amp;ccedil;alışması yer almaktadır. Bunlardan biriside &lt;strong&gt;Code Contracts'&lt;/strong&gt; tır.&lt;/p&gt;
&lt;p&gt;Uzun s&amp;uuml;redir ilgimi &amp;ccedil;eken ama fırsat bulamadığım konulardan birisidir &lt;strong&gt;Code Contracts&lt;/strong&gt;. &amp;Ouml;zellikle test s&amp;uuml;re&amp;ccedil;lerinde &amp;ouml;nem arz eden ve kodun &amp;ccedil;alışma zamanında veya kodlama zamanında varsayımsal bazı koşulları sağlayıp sağlamadığını tespit etmemizi sağlayan bir yenilik olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Bu noktada kodun&lt;strong&gt; &amp;ouml;n koşullu(Pre-Conditions)&lt;/strong&gt; veya &lt;strong&gt;son koşullu(Post-Conditions)&lt;/strong&gt;&amp;nbsp;olarak test edilmesinin m&amp;uuml;mk&amp;uuml;n olduğunu s&amp;ouml;yleyebiliriz. Bu&amp;nbsp;iki&amp;nbsp;yeteneğe ek olarak bir nesnenin&amp;nbsp;&lt;strong&gt;durumunun(State)&lt;/strong&gt; beklendiği gibi olmasının kontrol&amp;uuml;de&lt;strong&gt; Object Invariant&lt;/strong&gt; &amp;ouml;zelliği sayesinde ger&amp;ccedil;ekleştirilebilmektedir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Normal şartlarda &lt;strong&gt;Microsoft.Diagnostics.Contracts&lt;/strong&gt; &lt;strong&gt;isim alanı(Namespace)&lt;/strong&gt; altında yer alan tipler ile kod s&amp;ouml;zleşmelerinin kullanılması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bu isim alanı &lt;strong&gt;.Net Framework 4.0 Base Class Library&lt;/strong&gt; i&amp;ccedil;erisinde doğrudan gelmektedir. &lt;strong&gt;.Net Framework 4.0 &lt;/strong&gt;&amp;ouml;ncesi s&amp;uuml;r&amp;uuml;mlerde kullanmak istediğimizdeyse &lt;strong&gt;Microsoft.Contracts.dll assembly'&lt;/strong&gt; ının projeye referans edilmesi&lt;em&gt;(&amp;ouml;rneğin XP işletim sisteminde &lt;strong&gt;C:\Program Files\Microsoft\Contracts\PublicAssemblies\v3.5&lt;/strong&gt; adresinde yer almaktadır)&lt;/em&gt;&amp;nbsp;gerekmektedir.&amp;nbsp;Kolay kullanım&amp;nbsp;i&amp;ccedil;in yazıyı hazırladığım tarih itibariyle &lt;strong&gt;DevLabs&lt;/strong&gt;' ten gerekli &lt;strong&gt;aracın(Tool)&lt;/strong&gt; indirilerek kurulmasında yarar vardır. &lt;strong&gt;Code Contracts, Microsoft &lt;/strong&gt;&lt;a title="Code Contracts" href="http://msdn.microsoft.com/en-us/devlabs/dd491992.aspx" target="_blank"&gt;&lt;strong&gt;DevLabs&lt;/strong&gt;&lt;/a&gt; i&amp;ccedil;erisine dahil edilmiş &amp;ouml;nemli projelerden birisidir. &lt;strong&gt;Code Contracts'&lt;/strong&gt; ın bloğun yazıldığı tarih itibariyle iki farklı versiyonu bulunmaktadır. &lt;strong&gt;Standart&lt;/strong&gt; versiyon &lt;strong&gt;&amp;ccedil;alışma zamanı kontrollerini(Runtime Checking)&lt;/strong&gt;&amp;nbsp;yapabilmekteyken, &lt;strong&gt;Team System&lt;/strong&gt; i&amp;ccedil;in &amp;uuml;retilen versiyon &lt;strong&gt;static kontroller(Static Checking)&lt;/strong&gt; yapabilmektedir. İlgili s&amp;uuml;r&amp;uuml;mler yine &lt;strong&gt;Visual Studio 2010 Beta 2&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml; ile de &amp;ccedil;alışmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;Not : &lt;/strong&gt;Eğer elinizde benim gibi &lt;strong&gt;Visual Studio 2010 Ultimate Beta 2&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml; var ise,&lt;strong&gt; Team System Edition&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; kurabilirsiniz.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Kurulum işlemi sonrasında &lt;strong&gt;Visual Studio Ultimate 2010 Beta 2 &lt;/strong&gt;&amp;uuml;zerinde oluşturulan projelerin &lt;strong&gt;&amp;ouml;zelliklerine(Properties)&lt;/strong&gt; aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan bir ara birimin dahil edildiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg120_1.gif" alt="" /&gt;,&lt;/p&gt;
&lt;p&gt;Burada yer alan detaylı &amp;ouml;zellikleri zaman i&amp;ccedil;erisinde &amp;ouml;ğreniyor olacağız. İlk etapta &lt;strong&gt;Static Checking&lt;/strong&gt; kısmının sadece &lt;strong&gt;Team System&lt;/strong&gt; destekli &lt;strong&gt;Visual Studio&lt;/strong&gt;' lar &amp;uuml;zerinde&lt;em&gt;(Visual Studio 2008 i&amp;ccedil;inde ge&amp;ccedil;erlidir) &lt;/em&gt;etkinleştirilebildiğini belirtelim. Aslında bu kabiliyetlerin &amp;ouml;zellikle &amp;ccedil;alışma zamanında yapılan &lt;strong&gt;if...try...catch&lt;/strong&gt; gibi kontrollerden ne gibi farkı olduğunu kavramamız olduk&amp;ccedil;a &amp;ouml;nemlidir. &amp;Ouml;rneğin d&amp;ouml;k&amp;uuml;mantasyon avantajları bunlardan birisidir. S&amp;ouml;z gelimi metod&amp;nbsp;parametrelerinin &lt;strong&gt;gereklilikleri(Requirements)&lt;/strong&gt;, olası &lt;strong&gt;istisnalar(Exceptions)&lt;/strong&gt; ve gerekli &lt;strong&gt;izinler(Permissions)&lt;/strong&gt; i&amp;ccedil;in otomatik d&amp;ouml;k&amp;uuml;mantasyon &amp;uuml;retimi sağlanabilmektedir.&lt;/p&gt;
&lt;p&gt;Diğer yandan &lt;strong&gt;Unit Test&lt;/strong&gt; tarafına getirdiği avantajlardan da bahsedilebilir. Daha anlamılı &lt;strong&gt;Unit Test'&lt;/strong&gt; lerin &amp;uuml;retilebilmesi, &amp;ouml;zellikle her &lt;strong&gt;s&amp;ouml;zleşmenin(Contracts)&lt;/strong&gt; bir analist gibi davranması ve &amp;ccedil;alıştırılan &lt;strong&gt;Test&lt;/strong&gt; i&amp;ccedil;in &lt;strong&gt;pass/fail &lt;/strong&gt;işaretlemesini sağlayabilmesi vb...Tabiki konuyu daha iyi kavrayabilmek adına bol bol &amp;ouml;rnek geliştirmekte yarar vardır. İşe &amp;ccedil;ok basit bir &lt;strong&gt;Hello World&lt;/strong&gt; uygulaması ile başlamakta yarar olacağı kanısındayım. Bu nedenle aşağıda yer alan &lt;strong&gt;Console&lt;/strong&gt; uygulaması kodlarını yazdığımızı varsayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Diagnostics.Contracts;

namespace CodeContracts
{
    class Program
    {
        static void Main(string[] args)
        {
            ChinookContext context = new ChinookContext();        
            context.CreateAlbum(null, 1);
            Album result=context.CreateAlbum("The Best", 1);
            Contract.Ensures(result.Name.Length &amp;gt; 10, "Album nesnesinin oluşturulmasında alb&amp;uuml;m adının 10 karakterden fazla olması beklenir");
        }
    }

    class ChinookContext
    {
        public Album CreateAlbum(string albumName, int albumId)
        {
            Contract.Requires(!string.IsNullOrEmpty(albumName),"Album nesnesinin oluşturulması i&amp;ccedil;in Album adının null veya boş olmaması gerekir");
            Album albm=new Album { 
                AlbumId=albumId
                ,Name=albumName };            
            return albm;
        }
    }

    class Album
    {
        public int AlbumId { get; set; }
        public string Name { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rnek kod par&amp;ccedil;asında &lt;strong&gt;Album&lt;/strong&gt; isimli sınıfa ait iki nesne &amp;ouml;rneği &amp;uuml;retiminin ger&amp;ccedil;ekleştirildiğini g&amp;ouml;rmekteyiz. &lt;strong&gt;CreateAlbum&lt;/strong&gt; isimli metod i&amp;ccedil;erisinde &lt;strong&gt;Contract.Requires&lt;/strong&gt; isimli bir &lt;strong&gt;static&lt;/strong&gt; fonksiyon &amp;ccedil;ağrısı olduğu hemen dikkatinizi &amp;ccedil;ekmiş olmalıdır. Bu metod ile bir &lt;strong&gt;&amp;ouml;n koşul(Pre-Condition)&lt;/strong&gt; belirtilmektedir. Bu koşula g&amp;ouml;re &lt;strong&gt;CreateAlbum&lt;/strong&gt; metoduna gelen &lt;strong&gt;albumName&lt;/strong&gt; parametresinin değerinin &lt;strong&gt;null&lt;/strong&gt; veya &lt;strong&gt;boş &lt;span style="text-decoration: underline;"&gt;olmaması&lt;/span&gt;&lt;/strong&gt; beklenmektedir. Diğer yandan &lt;strong&gt;Main&lt;/strong&gt; metodunun son satırında da &lt;strong&gt;Contract.Ensures&lt;/strong&gt; isimli bir metod &amp;ccedil;ağrısı yer almaktadır. Bu &amp;ccedil;ağrı ilede bir &lt;strong&gt;son koşul(Post-Condition)&lt;/strong&gt; tanımlaması yapılmaktadır. Bu koşula g&amp;ouml;re &lt;strong&gt;CreateAlbum&lt;/strong&gt; metodu ile &amp;uuml;retilen ikinci&amp;nbsp;&lt;strong&gt;Album&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt;Name&lt;/strong&gt; &amp;ouml;zelliğinin karakter sayısının &lt;strong&gt;10' &lt;/strong&gt;un &amp;uuml;zerinde olması istenmektedir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneği bu haliyle &amp;ccedil;alıştırdığımızda hi&amp;ccedil; bir sorun olmadığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Hımmm...Enteresan bir durum.&lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;Oysaki &lt;strong&gt;Requires&lt;/strong&gt; veya &lt;strong&gt;Ensures&lt;/strong&gt; metod &amp;ccedil;ağrılarından en az birisine takılmamız gerekirdi. Aslında sorun hen&amp;uuml;z kod s&amp;ouml;zleşmelerinin &lt;strong&gt;&amp;ccedil;alışma zamanı(runtime)&lt;/strong&gt; veya &lt;strong&gt;static&lt;/strong&gt; olarak izlenmesi gerektiğini belirtmemiş olmamız. Bunun i&amp;ccedil;in &lt;strong&gt;Tool&lt;/strong&gt; ile birlikte projeye eklenen &lt;strong&gt;Contracts&lt;/strong&gt; sekmesindeki&lt;strong&gt; Runtime Checking&lt;/strong&gt; kutusunu işaretlememiz yeterlidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg120_RuntimeCheck.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi &amp;ouml;rneğimizi &amp;ccedil;alıştırdığımızda ilk olarak aşağıdaki mesaj kutusu ile karşılaştığımızı g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg120_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Album&lt;/strong&gt; adının &lt;strong&gt;null&lt;/strong&gt; ge&amp;ccedil;ilmesi nedeniyle bir uyarı mesajı &amp;uuml;retilmiştir. Bir başka deyişle &amp;ouml;n koşulun sağlanamadığı a&amp;ccedil;ık bir şekilde g&amp;ouml;r&amp;uuml;lmektedir. Bu noktadan sonra hatayı g&amp;ouml;rmezden gelip ilerleme şansımız vardır. &lt;strong&gt;Ignore&lt;/strong&gt; d&amp;uuml;ğmesine basarak devam ettiğimiz takdirde bu kez &lt;strong&gt;Post-Condition'&lt;/strong&gt; a takıldığımızı g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg120_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Uuml;retilen uyarı mesajına g&amp;ouml;re&amp;nbsp;ikinci &lt;strong&gt;Album&lt;/strong&gt; nesnesinin adının karaketer uzunluğunun istenildiği gibi olmadığı g&amp;ouml;zlemlenmektedir. Şimdi dilerseniz &lt;strong&gt;Object Invariant &lt;/strong&gt;konusuna dair basit bir &amp;ouml;rnek geliştirmeye &amp;ccedil;alışarak devam edelim. &lt;strong&gt;Invariant&lt;/strong&gt; &amp;ouml;zelliğini bir nesnenin istemci tarafından ele alındığı yerdeki &lt;strong&gt;durumunun(State) &lt;/strong&gt;iyi olması ile alakalı bir yetenek şeklinde d&amp;uuml;ş&amp;uuml;nebiliriz. Bir nesnenin durumunu i&amp;ccedil;erdiği alanlar ifade ettiğinden, bu alanların beklenen şekilde olması &lt;strong&gt;iyi bir nesne(good object)&lt;/strong&gt; olduğu anlamına da gelecektir.&amp;nbsp;İşte &amp;ouml;rnek kod par&amp;ccedil;ası.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Diagnostics.Contracts;

namespace CodeContracts
{
    class Program
    {
        static void Main(string[] args)
        {
            Product bardak = new Product(1000,"Bardak",3.45);
        }
    }

    class Product
    {
        private int ProductId;
        private string Name;
        private double ListPrice;

        public Product(int pId,string pName,double pListPrice)
        {            
            ProductId = pId;
            Name = pName;
            ListPrice = pListPrice;
        }

        [ContractInvariantMethod]
        protected void InvariantCheck()
        {
            Contract.Invariant(this.ProductId &amp;gt; -1,"&amp;Uuml;r&amp;uuml;n numarası pozitif değer olmalıdır");
            Contract.Invariant(this.Name.StartsWith("PRD-"),"&amp;Uuml;r&amp;uuml;n adları PRD- ile başlamalı");
            Contract.Invariant(this.ListPrice != 0, "Liste fiyatı 0 olamaz");
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Product&lt;/strong&gt; isimli sınıfta &lt;strong&gt;ContractInvariantMethod&lt;/strong&gt; &lt;strong&gt;niteliği(attribute)&lt;/strong&gt; ile imzalanmış bir metod bulunmaktadır. Geriye değer d&amp;ouml;nd&amp;uuml;rmeyen ve &lt;strong&gt;protected&lt;/strong&gt; olarak işaretlenmiş bu metod i&amp;ccedil;erisinde dikkat edileceği &amp;uuml;zere &lt;strong&gt;Contract&lt;/strong&gt; sınıfının &lt;strong&gt;static Invariant&lt;/strong&gt; metoduna yapılan bazı &amp;ccedil;ağrılar bulunmaktadır. Bu &amp;ccedil;ağrılar i&amp;ccedil;erisinde, &amp;uuml;retilen &lt;strong&gt;Product&lt;/strong&gt; nesnesinin durumunu simgeleyen alanların değerleri kontrol edilmektedir. &amp;Ouml;rnek &amp;ccedil;alıştırıldığında aşağıdaki mesaj ile karşılaşılacaktır. &lt;img src="/pics/2009%2f12%2fblg120_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu son derece doğaldır nitekim &amp;uuml;r&amp;uuml;n adı &lt;strong&gt;Invariant&lt;/strong&gt; &amp;ccedil;ağrısında olduğu gibi &lt;strong&gt;PRD-&lt;/strong&gt; &amp;ouml;n eki ile başlamamaktadır. Dolayısıyla nesne &amp;ouml;rneği istenilen duruma sahip değildir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Kişisel Not: Invariant kontrol&amp;uuml;nde dikkat edilmesi gereken iki durum vardır. Auto Property' ler kullanıldığında &amp;ccedil;alışma zamanında bir istisna mesajı alınacaktır. Bu istisna Contract.Invariant &amp;ccedil;ağrılarının yapıldığı yerde ger&amp;ccedil;ekleşecektir. Bunun sebebi Invariant &amp;ccedil;ağrılarının null değer i&amp;ccedil;eren &amp;ouml;zellikleri kontrol etmeye &amp;ccedil;alışmasıdır. S&amp;ouml;z konusu durum varsayılan yapıcı metodlar kullanıldığında da n&amp;uuml;ksetmektedir. S&amp;ouml;z gelimi yukarıdaki kod par&amp;ccedil;asında Product tipi i&amp;ccedil;in varsayılan yapıcı metod yazılıp buna g&amp;ouml;re bir Product nesnesi &amp;ouml;rneklendiğinde aşağıdaki &amp;ccedil;alışma zamanı istisna(Runtime Exception)&amp;nbsp;mesajı ile karşılaşılır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg120_Exception2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Name alanı string tipten olduğu i&amp;ccedil;in nesnenin ilk &amp;ouml;rneklenmesi sırasında varsayılan yapıcı metod(Default Constructor) tarafından null değer ile beslenir. Bunun sonucu olarakta Invariant metodu null değer &amp;uuml;zerinde kontrol yapmaya &amp;ccedil;alışmaktadır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Elbette &lt;strong&gt;Code Contracts&lt;/strong&gt; konusu burada anlatıldığı kadar yalın ve sade değildir. Aksine d&amp;ouml;k&amp;uuml;mantasyonuna bakıldığında &amp;ccedil;ok fazla kuralı olduğu g&amp;ouml;r&amp;uuml;lmektedir. &amp;Ouml;zellikle &lt;strong&gt;Static&amp;nbsp;Checking&lt;/strong&gt; &amp;ouml;zelliği derleme işlemi sırasında bazı kod&amp;nbsp;s&amp;ouml;zleşmelerinin kontrol&amp;uuml; sağlamaktadır.&amp;nbsp;Konuyu araştırdık&amp;ccedil;a ve &amp;ouml;ğrendik&amp;ccedil;e sizlere daha fazlasını aktarmaya &amp;ccedil;alışıyor olacağım. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f12%2fCodeContracts.rar"&gt;CodeContracts.rar (25,40 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-12-18 05:40:00</pubDate>
  <slug>C-40-ile-Code-Contracts</slug>
  <tags>
    <tag>c#-40</tag>
    <tag>net-framework-40</tag>
  </tags>
  <categories>
    <category>C# 4.0</category>
  </categories>
</post>