<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Webiner - .Net 4.0 ile Paralel Programlamaya Giriş [Beta 2]</title>
  <description />
  <content>&lt;p&gt;&lt;img style="FLOAT: left" src="http://www.buraksenyurt.com/pics/2009%2f12%2fblgParallel.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bundan yıllar &amp;ouml;nce &amp;uuml;niversitede &amp;ouml;ğrenciyken ilk kişisel bilgisayarımı almak &amp;uuml;zere rahmetli babam ile birlikte &lt;strong&gt;Perpa'&lt;/strong&gt; ya gittiğimi hatırlıyorum. O sıralar piyasada var olan bilgisayar dergilerini hatırlıyorum da...&lt;strong&gt;486 DX-33&lt;/strong&gt; tabanlı işlemcilere sahip sistemler anlatılıyor ve &amp;ouml;neriliyordu. Ancak b&amp;uuml;t&amp;ccedil;e belli olunca &lt;strong&gt;Perpa'&lt;/strong&gt; daki mağazada ancak&amp;nbsp;&lt;strong&gt;486 SX-25&lt;/strong&gt; işlemcili bir modeli alabileceğimizi farketmiştik. Aradaki tek farkın, &lt;strong&gt;SX-25' &lt;/strong&gt;in &lt;strong&gt;DX-33&lt;/strong&gt;'e g&amp;ouml;re matematiksel hesaplamalarda daha yavaş olması olduğunu hatırlıyorum. Tabi bu eksiklik, matematiksel hesaplamalarda, dosya giriş &amp;ccedil;ıkış işlemlerinde, sunucu bazlı s&amp;uuml;re&amp;ccedil;lerde, yapay zeka algoritmalarında, grafik işleme uygulamalarında dez avantaj oluşturacak bir fark yaratıyordu. &amp;Ouml;zellikle hız ve performans a&amp;ccedil;ısından.&amp;nbsp;Ancak o zamanlar daha &amp;ccedil;ok oyunlara olan etkisini d&amp;uuml;ş&amp;uuml;n&amp;uuml;yordum. &lt;img title="Wink" src="http://www.buraksenyurt.com/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" border="0" alt="Wink" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Gel zaman git zaman &lt;strong&gt;Intel&lt;/strong&gt; firmasının kurucusu &lt;strong&gt;Gordon Moore' &lt;/strong&gt;un meşhur yasasını okudum. 18 ayda bir ikiye katlanan ve &amp;uuml;retim maaliyetleri aynı kalan yada azalan transistor sayılarından bahsediyor ve hızların nasıl artacağını ifade ediyordu. &lt;em&gt;(Tabi bu kanun g&amp;uuml;n&amp;uuml;m&amp;uuml;zde ge&amp;ccedil;erliliğine neredeyse yitirdi.) &lt;/em&gt;Sonrasında ise işin ardı arkası kesilmedi.&lt;strong&gt; 200 MMX, Pentium, Celeron&lt;/strong&gt; işlemciler derken bir baktık diz &amp;uuml;st&amp;uuml; bilgisayarlarımızda bile &lt;strong&gt;4 &lt;/strong&gt;&amp;ccedil;ekirdek var. &lt;em&gt;(&amp;Ouml;rneğin&amp;nbsp;şu&amp;nbsp;an bu yazıyı yazdığım bilgisayarda&amp;nbsp;&amp;ccedil;ift &amp;ccedil;ekirdek işlemci&amp;nbsp;bulunmakta)&lt;/em&gt;&amp;nbsp;Artık &lt;strong&gt;32 &lt;/strong&gt;işlemcili bir bilgisayarın maaliyeti bundan onlarca yıl &amp;ouml;ncesi kadar y&amp;uuml;ksek değil. Hatta bu kadar &amp;ccedil;ok işlemciye sahip sistemleri kurmak artık hayal değil. Hal b&amp;ouml;yle olunca, uygulamalarda &lt;strong&gt;Multi-Thread &lt;/strong&gt;yaklaşımlarda bir hayli &amp;ouml;nem kazandı. &amp;Ouml;zellikle son yıllarda &lt;strong&gt;Microsoft &lt;/strong&gt;bu anlamda yazılımcıların daha kolay kod geliştirebilmesine olanak tanıyan yenilikler duyurdu. İşte bunlardan biriside paralel programlama alt yapısı. Bu Webinerimizde &lt;strong&gt;.Net Framework 4.0 &lt;/strong&gt;i&amp;ccedil;erisine g&amp;ouml;m&amp;uuml;l&amp;uuml; olarak gelen paralel programlama alt yapısını inceldik. &lt;a title=".Net 4.0 ile Paralel Programlamaya Giriş" href="http://www.nedirtv.com/video/Net-40-ile-Paralel-Programlamaya-Giris.aspx" target="_blank"&gt;Ka&amp;ccedil;ıran arkadaşlarımız &lt;strong&gt;NedirTV?com &lt;/strong&gt;adresinden s&amp;ouml;z konusu webineri&amp;nbsp;indirip izleyebilirler.&lt;/a&gt; İyi seyirler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;S&amp;uuml;re : 58:55&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;</content>
  <pubDate>2009-12-25 14:45:00</pubDate>
  <slug>Webiner-Paralel-Programlamaya-Giris</slug>
  <tags>
    <tag>task-parallel-library</tag>
    <tag>plinq</tag>
    <tag>parallel-programming</tag>
    <tag>webcast</tag>
    <tag>webiner</tag>
  </tags>
  <categories>
    <category>Parallel Programming</category>
  </categories>
</post>