<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Boxing ve Unboxing Performans Kritiği</title>
  <description>Bildiğiniz gibi boxing, bir değer türünün, referans türünü atanması sırasında gerçekleşen işleme verilen isimdir. Unboxing ise bunun tam tersi olmakta ve referans türünün tekrar değer türüne dönüştürülmesini kapsamaktadır. Hangisi olursa olsun, değer türlerinin tutulduğu stack bellek bölgesi ile, referans türlerinin tutulduğu heap bellek bölgesi arasında yer değiştirme ve kopyalama işlemleri söz konusudur.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bundan yaklaşık olarak iki sene &amp;ouml;nce boxing ve unboxing kavramları ile ilgili bir &lt;a href="http://www.buraksenyurt.com/post/Boxing-(Kutulamak)-ve-Unboxing-(Kutuyu-Kald%C4%B1rmak)-bsenyurt-com-dan"&gt;makale&lt;/a&gt; (30.12.2003) yazmıştım. Aradan uzun s&amp;uuml;re ge&amp;ccedil;ti. Ancak boxing ve unboxing kavramları ile ilgili olarak halen daha dikkat edilmesi gereken hususlar var. Bunlardan bizim i&amp;ccedil;in en &amp;ouml;nemlisi elbetteki performans &amp;uuml;zerine etkileri. Uygulamalarımızda &amp;ccedil;ok sık olarak farkında olmadan veya farkında olaraktan boxing ve unboxing işlemlerinin yer aldığı kod par&amp;ccedil;alarını kullanıyoruz.&lt;/p&gt;
&lt;p&gt;Bildiğiniz gibi boxing, bir değer t&amp;uuml;r&amp;uuml;n&amp;uuml;n, referans t&amp;uuml;r&amp;uuml;n&amp;uuml; atanması sırasında ger&amp;ccedil;ekleşen işleme verilen isimdir. Unboxing ise bunun tam tersi olmakta ve referans t&amp;uuml;r&amp;uuml;n&amp;uuml;n tekrar değer t&amp;uuml;r&amp;uuml;ne d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmesini kapsamaktadır. Hangisi olursa olsun, değer t&amp;uuml;rlerinin tutulduğu stack bellek b&amp;ouml;lgesi ile, referans t&amp;uuml;rlerinin tutulduğu heap bellek b&amp;ouml;lgesi arasında yer değiştirme ve kopyalama işlemleri s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;table id="table6" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;İster boxing ister unboxing işlemi s&amp;ouml;z konusu olsun, bellek &amp;uuml;zerinde stack ve heap b&amp;ouml;lgeleri arasında yeniden adresleme ve kopyalama işlemi s&amp;ouml;z konusudur.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;İşte bu adresleme ve kopylama işlemlerinin uygulama i&amp;ccedil;erisinde sayısız defa tekrar ediyor olması performansı olumsuz y&amp;ouml;nde etkileyen en &amp;ouml;nemli nedenlerden birisidir. Bunu daha iyi anlamadan &amp;ouml;nce, boxing ve unboxing işlemlerini biraz daha alt seviyede incelemek gerekir. &amp;Ccedil;ok basit olarak aşağıdaki console uygulamasının MSIL (Microsoft Intermediate Language) koduna bir g&amp;ouml;z atalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace InvestigateOfBoxingUnBoxing
{
    class Class1
    {
        static void Main(string[] args)
        {
            int deger=25;
            object obj=deger; // Boxing
            int sonuc=(int)obj; // Unboxing
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İlk olarak integer tipinden bir değer t&amp;uuml;r&amp;uuml;n&amp;uuml;, object tipinden bir referans t&amp;uuml;r&amp;uuml;n&amp;uuml; atıyoruz. Daha sonra ise artık kutulanmış (boxing işlemine tabi tutulmuş) referans t&amp;uuml;r&amp;uuml;n&amp;uuml;n değerini bilin&amp;ccedil;li bir tip d&amp;ouml;n&amp;uuml;ş&amp;uuml;m (explicitly cast) işlemi ile tekrar değer t&amp;uuml;r&amp;uuml;nden bir değişkene atıyoruz. Bu kodun IL &amp;ccedil;ıktısı aşağıdaki gibi olacaktır. &amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;.method private hidebysig static void Main(string[] args) cil managed
{
    .entrypoint
    // Code size 19 (0x13)
    .maxstack 1
    .locals init ([0] int32 deger,
    [1] object obj,
    [2] int32 sonuc)
    IL_0000: ldc.i4.s 25
    IL_0002: stloc.0
    IL_0003: ldloc.0
    IL_0004: box [mscorlib]System.Int32
    IL_0009: stloc.1
    IL_000a: ldloc.1
    IL_000b: unbox [mscorlib]System.Int32
    IL_0010: ldind.i4
    IL_0011: stloc.2
    IL_0012: ret
} // end of method Class1::Main&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi, IL_0004 ve IL_000b segmentlerinde &lt;strong&gt;box&lt;/strong&gt; ve &lt;strong&gt;unbox&lt;/strong&gt; komutları &amp;ccedil;alıştırılarak referans ve değer t&amp;uuml;rleri arası bellek konumlandırma ve kopyalama işlemleri yapılmıştır. Bunun zaten b&amp;ouml;yle olacağını kodlarımızdan da biliyoruz. &lt;strong&gt;Peki IL kodunun bu &amp;ccedil;ıktısının bizim i&amp;ccedil;in &amp;ouml;nemi nedir?&lt;/strong&gt; Herşeyden &amp;ouml;nce bunu aşağıdaki masumane kod par&amp;ccedil;asını ele alaraktan anlamaya &amp;ccedil;alışmakta fayda var. &amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace InvestigateOfBoxingUnBoxing
{
    class BoxUnBox
    {
        public static void EkranaYaz(int yaricap,double pi)
        {
            double alan=yaricap*yaricap*pi;
            Console.WriteLine("Yaricapi {0} olan dairenin alanı = {1} dır.",yaricap,alan);
        }
    }
    class Class1
    {
        static void Main(string[] args)
        {
            BoxUnBox.EkranaYaz(10,3.14);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rnekte odaklanmamız gereken yer BoxUnBox sınıfımız i&amp;ccedil;erisinde int tipinden yari&amp;ccedil;ap değerini ve double tipinden pi değerini alan EkranaYaz isimli metodtur. Bu metod i&amp;ccedil;erisinde standart olarak alan hesabını yaptıktan sonra sonu&amp;ccedil;ları ekrana yazdırmak i&amp;ccedil;in Console sınıfının WriteLine metodunu kullanıyoruz. Şimdi uygulamanın IL koduna tekrar bakalım. EkranaYaz metodunun i&amp;ccedil;erisinde yer alan aşağıdaki satırlar bizim i&amp;ccedil;in olduk&amp;ccedil;a &amp;ouml;nemlidir. &amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;IL_000c: ldarg.0
IL_000d: box [mscorlib]System.Int32
IL_0012: ldloc.0
IL_0013: box [mscorlib]System.Double
IL_0018: call void [mscorlib]System.Console::WriteLine(string, object, object)&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi değer t&amp;uuml;rlerimiz boxing işlemine tabi tutulmuş ve WriteLine metoduna object tipinden ge&amp;ccedil;irilmiştir. Halbuki biz kodumuzda basit olarak sonu&amp;ccedil;ları ekrana yazdırmaya &amp;ccedil;alışıyoruz. Şu noktada bellek &amp;uuml;zerinde, stack ve heap arasında bir veri değiştokuşu olacağını d&amp;uuml;ş&amp;uuml;nmeyebiliriz. Ancak IL kodlarının da s&amp;ouml;ylediği gibi box ve unbox komutları &amp;ccedil;ağırılmıştır. Oysaki aynı kodu aşağıdaki stilde yazsaydık eğer;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public static void EkranaYaz(int yaricap,double pi)
{
    double alan=yaricap*yaricap*pi;
    Console.WriteLine("Yaricapi {0} olan dairenin alanı = {1} dır.",yaricap.ToString(),alan.ToString());
}&lt;/pre&gt;
&lt;p&gt;bu durumda değer t&amp;uuml;rlerimiz i&amp;ccedil;in bir boxing işlemi uygulanmayacaktı. Aslında WriteLine metodunun beklediği object t&amp;uuml;r&amp;uuml;nden bir atama s&amp;ouml;z konusudur. Biz bunu daha parametreyi ge&amp;ccedil;irirken değer t&amp;uuml;r&amp;uuml;n&amp;uuml;n ToString() metodu ile sağlamış oluyoruz.&amp;nbsp; Dolayısıyla, IL kodlarına tekrar bakacak olursak box ve unbox komutarının &amp;ccedil;ağırılmadığını, bir başka deyişle boxing ve unboxing işlemlerinin yapılmadığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;IL_000c: ldarga.s yaricap
IL_000e: call instance string [mscorlib]System.Int32::ToString()
IL_0013: ldloca.s alan
IL_0015: call instance string [mscorlib]System.Double::ToString()
IL_001a: call void [mscorlib]System.Console::WriteLine(string, object, object)&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi her hangibir box komutu &amp;ccedil;ağırılmamıştır. İyi herşey hoşta, aynı sonu&amp;ccedil;ları elde ettiğimiz her iki kod &amp;ouml;rneğinden hangisini tercih etmeliyiz. Bu durumu analiz edebilmek i&amp;ccedil;in aşağıdaki &amp;ouml;rnek uygulamayı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almakta fayda var. Amacımız boxing uygulandığı ve uygulanmadığı durumlarda s&amp;uuml;resel farkları tespit ederek performans değerlendirmesi yapabilmek.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
    #region Boxing i&amp;ccedil;eren kod kısmı
    DateTime suAn=DateTime.Now;
    for(int i=1;i&amp;lt;50000;i++)
    {
        double alan=i*i*3.14;
        Console.WriteLine("Yaricapi {0} olan dairenin alanı = {1} dır.",i,alan); // Boxing var...
    }
    TimeSpan tsBox=DateTime.Now-suAn;
    #endregion

    #region boxing i&amp;ccedil;ermeyen kod kısmı
    suAn=DateTime.Now;
    for(int i=1;i&amp;lt;50000;i++)
    {
        double alan=i*i*3.14;
        Console.WriteLine("Yaricapi {0} olan dairenin alanı = {1} dır.",i.ToString(),alan.ToString()); // Boxing yok...
    }
    TimeSpan tsNoBox=DateTime.Now-suAn;
    #endregion

    Console.WriteLine("------------");
    Console.WriteLine("Boxing olduğunda..."+tsBox.TotalMilliseconds.ToString());
    Console.WriteLine("Boxing olmadığında..."+tsNoBox.TotalMilliseconds.ToString());
}&lt;/pre&gt;
&lt;p&gt;Uygulama kodumuz her ne kadar anlamsız g&amp;ouml;r&amp;uuml;nse de sonu&amp;ccedil; ger&amp;ccedil;ekten &amp;ccedil;ok ilgin&amp;ccedil;tir. Uygulamanın tespit ettiği s&amp;uuml;reler aslında ortalama değerlerdir. Bu genellikle kullandığınız makinenin donanımsal yeteneklerine g&amp;ouml;re değişiklik g&amp;ouml;sterebilir. Ancak tabiki &amp;ouml;nemli olan hangisinin daha hızlı olduğudur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk137_1.gif" alt="" width="524" height="131" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Her iki region altındaki kodlarda aynı işi yapar. 50000 kez i değeri &amp;uuml;zerinden alan hesabı yaparak, sonu&amp;ccedil;ları ekrana yazar. Ancak her iki teknik arasında &amp;ouml;zellikle de WriteLine metodları i&amp;ccedil;erisinde az &amp;ouml;nce bahsettiğimiz ToString() kullanımı farkı vardır. İlk region i&amp;ccedil;erisindeki kodlarımızda ToString metodunu kullanmadık. Bu sebeplede, değerler ekrana yazdırılmadan &amp;ouml;nce boxing işlemi s&amp;ouml;z konusu olacaktır. Ancak ikinci region b&amp;ouml;lgesindeki kodlarımızda yer alan WriteLine metodunda ise değer t&amp;uuml;rlerimiz i&amp;ccedil;in ToString metodunu kullanıyoruz. Sonu&amp;ccedil;ta s&amp;uuml;re farkı &amp;ouml;nemsenecek derecede y&amp;uuml;ksektir. İkinci teknik daha hızlı sonu&amp;ccedil; almamızı sağlamıştır. Her ne kadar yukarıdaki gibi bir &amp;ouml;rneği pek kullanmayacak olsanızda, geniş &amp;ccedil;aplı uygulamalar d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde gereksiz yere yapılan boxing ve unboxing işlemleri, uygulamanın genelinde &amp;ouml;nemli oranda performans ve hız kaybına neden olabilir.&lt;/p&gt;
&lt;p&gt;Boxing ve Unboxing işlemlerinin sık olarak g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; diğer bir durum ise koleksiyonların kullanıldığı uygulamalarda g&amp;ouml;ze &amp;ccedil;arpmaktadır. &amp;Ouml;zellikle koleksiyonlara eleman aktarılırken veya koleksiyon i&amp;ccedil;erisindeki bir eleman okunurken boxing ve unboxing işlemleri ile karşılaşılmaktadır. Burada eleman sayısının y&amp;uuml;kselmesi, ger&amp;ccedil;ekleşen boxing ve unboxing işlemlerinin sayısını arttıracaktır. Dolayısıyla stack ve heap arasındaki kopyalama ve yer değiştirme işlemleride olduk&amp;ccedil;a fazlalaşacaktır ki bu da uygulamanın yavaşlamasına neden olan bir fakt&amp;ouml;rd&amp;uuml;r. S&amp;ouml;z gelimi aşağıdaki &amp;ouml;rnek uygulamayı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. Burada Urun isimli struct (yapı) tipinden bir nesnemizi ilk &amp;ouml;nce bir ArrayList koleksiyonunda, ardından object tipinden bir dizide ve son olarakta kendi tipinden bir dizide kullanıyoruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections;

namespace InvestigateOfBoxingUnBoxing
{
    public struct Urun
    {
        private int m_Fiyat;
        public int Fiyat
        {
            get    
            {
                return m_Fiyat;
            }
            set
            {
                m_Fiyat=value;
            }
        }

        public Urun(int fiyat)
        {
            m_Fiyat=fiyat;
        }
    }
    class Class1
    {
        static void Main(string[] args)
        {
            #region ArrayList koleksiyonu kullanıldığında
            ArrayList alUrun=new ArrayList();
            DateTime dtSuan=DateTime.Now;
            for(int i=1;i&amp;lt;500000;i++)
            {
                alUrun.Add(new Urun(i*1000)); // boxing olacaktır
            }
            TimeSpan tsFark=DateTime.Now-dtSuan;
            Console.WriteLine("ArrayList Kullanımı........."+tsFark.TotalMilliseconds.ToString());
            #endregion

            #region object dizisi kullanıldığında
            object[] objUrunler=new object[500000];
            dtSuan=DateTime.Now;
            for(int i=1;i&amp;lt;500000;i++)
            {
                objUrunler[i]=new Urun(i*1000); // boxing olacaktır
            }
            tsFark=DateTime.Now-dtSuan;
            Console.WriteLine("Object Dizisi Kullanımı........."+tsFark.TotalMilliseconds.ToString());
            #endregion

            #region Struct tipinden bir dizi kullanıldığında
            Urun[] urunList=new Urun[500000];
            dtSuan=DateTime.Now;
            for(int i=1;i&amp;lt;500000;i++)
            {
                urunList[i]=new Urun(i*1000); // değer t&amp;uuml;r&amp;uuml;ne aktarma var. Yani boxing yok...
            }
            tsFark=DateTime.Now-dtSuan;
            Console.WriteLine("Struct Dizisi Kullanımı........."+tsFark.TotalMilliseconds.ToString());
            #endregion
        
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Eğer Main metodumuzun IL koduna bakacak olursak, ArrayList koleksiyonunu ve object dizisini kullandığımız d&amp;ouml;ng&amp;uuml;ler i&amp;ccedil;in box komutunun &amp;ccedil;ağırıldığını kolayca g&amp;ouml;rebilirsiniz. Bunun sebebi struct tipimizin değer t&amp;uuml;r&amp;uuml; olmasıdır. ArrayList ve object dizilerimizin elemanları ise object tipinden bir başka deyişle referans t&amp;uuml;r&amp;uuml;ndendir. Dolayısıyla ArrayList' e ve object tipinden olan dizimize, Urun isimli struct' ımıza ait nesne &amp;ouml;rneklerini eklemeye &amp;ccedil;alıştığımızda, değer t&amp;uuml;r&amp;uuml;nden referans t&amp;uuml;r&amp;uuml;ne ge&amp;ccedil;iş (boxing) işlemi s&amp;ouml;z konusu olacaktır. Tahmin edeceğiniz &amp;uuml;zere bu performans ve hız kaybına neden olan bir durumdur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk137_3.gif" alt="" width="628" height="711" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;yleki uygulamayı &amp;ccedil;alıştırdığımızda Urun isimli struct tipinden dizinin kullanıldığı d&amp;ouml;ng&amp;uuml;n&amp;uuml;n, diğerlerine g&amp;ouml;re belirgin olarak daha hızlı &amp;ccedil;alıştığını g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk137_2.gif" alt="" width="396" height="119" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Elbette bu tip koleksiyonları kullandığınız durumlarda sadece Urun tipinden nesneler taşınacak ise, yine Urun tipinden bir nesne dizisini kullanmak en mantıklı se&amp;ccedil;imdir. Ama &amp;ccedil;oğu zaman kod yazarken bu gibi durumları g&amp;ouml;zden ka&amp;ccedil;ırırız. Burada belkide en b&amp;uuml;y&amp;uuml;k problem elimizdekiler ile tam olarak ne istediğimizi bilemememizdir. Urun tipinden bir diziye ihtiyacım var ise bir koleksiyona gerek var mıdır? Yoksa bir koleksiyonun sağladığı avantajları kullanamıyacağım bir diziyi tercih etmek i&amp;ccedil;in performansı ne kadar d&amp;uuml;ş&amp;uuml;nmeliyim? vb...Bu sorulara doğru yanıtları vererek en uygun kullanımı se&amp;ccedil;ebiliriz. Bu gibi kullanımlar uygulamanın pek &amp;ccedil;ok yerinde var olabilir. İşte bu sebepten &amp;ouml;zellikle değer t&amp;uuml;rlerini ve referans t&amp;uuml;rlerini bir arada kullanırken boxing ve unboxing işlemlerini minimize edecek tekniklere gidilirse performans olarak b&amp;uuml;y&amp;uuml;k kazanımlar sağlanılabilir. İlk zamanlarda bunu aşmak i&amp;ccedil;in IL kodu ile biraz daha fazla haşırneşir olmamız gerekebilir. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2005-09-26 09:00:00</pubDate>
  <slug>Boxing-ve-Unboxing-Performans-Kritiği-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>boxing</tag>
    <tag>unboxing</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>