<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Sunucu Metriklerini İzleme (Rust ve WASM ile)</title>
  <description>WASM ya da bilinen adıyla WebAssembly tarayıcılarda yüksek performans çalışma zamanına çıkabileceğimiz ortamlar için ideal bir çatı sunar. Bu standart, düşük seviyeli binary format üzerine odaklanır ve bu anlamda C, C++ ve Rust gibi dillerle birlikte kullanılması hızlı bir çalışma zamanına olanak sağlar. Pek tabii WASM'ın kullanım alanı bu dillerle sınırlı değildir. Örneğin Microsoft, Blazor soyutlaması ile WASM ortamı için gerekli çıktıları üretmeyi oldukça kolaylaştırır. WASM' ın binary formattaki çıktılarının tarayıcıda çalıştırması sırasında yine tarayıcıların sağladığı güvenlik protokolleri işletilir. Dolayısıyla tarayıcının çalıştığı sistem kaynaklarına çıkmak ve zararlı yazılım kodlarını işletmek pek mümkün değildir("pek" diyorum çünkü hacker'ların sağı solu belli olmaz) Bununla birlikte sunucu tarafı ile olan iletişim klasik olarak servis çağrıları ile sağlanabilir.</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2025/Ocak/ferrisandwasm.png" alt="" align="right" /&gt;WASM ya da bilinen adıyla &lt;strong&gt;WebAssembly&lt;/strong&gt; tarayıcılarda y&amp;uuml;ksek performans &amp;ccedil;alışma zamanına &amp;ccedil;ıkabileceğimiz ortamlar i&amp;ccedil;in ideal bir &amp;ccedil;atı sunar. Bu standart, d&amp;uuml;ş&amp;uuml;k seviyeli binary format &amp;uuml;zerine odaklanır ve C, C++ ve Rust gibi dillerle birlikte kullanılması hızlı bir &amp;ccedil;alışma zamanına olanak sağlar. Pek tabii WASM'ın kullanım alanı bu dillerle sınırlı değildir. &amp;Ouml;rneğin Microsoft, &lt;strong&gt;Blazor&lt;/strong&gt; soyutlaması ile WASM ortamı i&amp;ccedil;in gerekli &amp;ccedil;ıktıları &amp;uuml;retmeyi olduk&amp;ccedil;a kolaylaştırır. WASM' ın binary formattaki &amp;ccedil;ıktılarının tarayıcıda &amp;ccedil;alıştırılması sırasında yine tarayıcıların sağladığı g&amp;uuml;venlik protokolleri işletilir. Dolayısıyla tarayıcının &amp;ccedil;alıştığı sistem kaynaklarına &amp;ccedil;ıkmak ve zararlı yazılım kodlarını işletmek pek m&amp;uuml;mk&amp;uuml;n değildir&lt;em&gt;("pek" diyorum &amp;ccedil;&amp;uuml;nk&amp;uuml; hackerların sağı solu belli olmaz)&lt;/em&gt; Bununla birlikte sunucu tarafı ile olan iletişim klasik olarak servis &amp;ccedil;ağrıları ile sağlanabilir.&lt;/p&gt;
&lt;p&gt;Genel olarak geliştirme modeli ş&amp;ouml;yle işler; WASM destekli bir programlama diliyle gerekli k&amp;uuml;t&amp;uuml;phaneler yazılır. Bu &amp;ccedil;ıktılar bir ara işlem sonrası WASM mod&amp;uuml;llerine derlenir. İlgili mod&amp;uuml;ller tarayıcı tarafına indirildikten sonra yine tarayıcı tarafında &amp;ccedil;alışır. WASM &amp;ccedil;ıktısının makine koduna yakınlığı tarayıcıda y&amp;uuml;ksek performans avantajının elde edilmesinin en b&amp;uuml;y&amp;uuml;k sebebidir. Tarayıcıda &amp;ccedil;alışan WASM mod&amp;uuml;lleri, Javascript tarafı ile iletişim kurabilir. Temel&lt;em&gt;(primitive)&lt;/em&gt; veri t&amp;uuml;rleri &amp;uuml;zerinden sağlanan iletişim &amp;ccedil;ift taraflı sağlanabilir. Bir başka deyişle, Javascript kodunda WASM mod&amp;uuml;l fonksiyonları &amp;ccedil;ağırılabileceği gibi, WASM i&amp;ccedil;erisinden de &amp;ouml;ny&amp;uuml;z tarafına belli &amp;ouml;l&amp;ccedil;&amp;uuml;lerde m&amp;uuml;dahale edilebilir.&lt;/p&gt;
&lt;p&gt;WASM' ın kullanılabileceği bir&amp;ccedil;ok senaryo var. Burada anahtar nokta tarayıcıda y&amp;uuml;ksek performans gerektiren yoğun hesaplamalı işlevleri gerekip gerekmediğidir. S&amp;ouml;z gelimi tarayıcıda &amp;ccedil;alıştırılan oyunlar i&amp;ccedil;in WASM pekala ideal bir &amp;ccedil;&amp;ouml;z&amp;uuml;md&amp;uuml;r. 3D grafik uygulamaları, y&amp;uuml;ksek matematik hesaplamalar gerektiren bilimsel &amp;ccedil;alışmalar, fizik kurallarına tabi modellemeler, b&amp;uuml;y&amp;uuml;k veri k&amp;uuml;meleri ile ilgili analizler ve hatta legacy uygulamaların web ortamına taşınması gibi farklı senaryolarda ele alınabilir.&lt;/p&gt;
&lt;p&gt;Bu teorik bilgileri bir kenara bırakalım ve gelin &lt;strong&gt;Rust&lt;/strong&gt; dilinide işin i&amp;ccedil;erisine katıp basit bir WASM uygulaması yazalım. Senaryomuzda bir sunucudan/sunuculardan CPU ve Memory istatistiklerini toplayan bir servis var. Bu &lt;strong&gt;REST&lt;/strong&gt; tabanlı bir servis olarak tasarlanabilir. S&amp;ouml;z konusu servisin &amp;ccedil;ıktılarını alıp anlık istatistikler &amp;ccedil;ıkartan yapımızı ise bir Rust k&amp;uuml;t&amp;uuml;phanesi olarak tasarlayıp WASM tarafında kullandıracağız. Burada cpu ve memory değerlerine g&amp;ouml;re ileri tarihli tahminlemeler yaptığımızı ve bu hesaplamaların tarayıcıdak WASM mod&amp;uuml;llerinde ger&amp;ccedil;ekleştirildiğini tahayy&amp;uuml;l edebiliriz. İstemci uygulamanın aşağıdakine benzer bir dashboard sağlayacağını d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2025/Ocak/ServerStatsRuntime.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Adım adım ilerleyelim.&lt;/p&gt;
&lt;h2&gt;&amp;Ouml;n Gereklilikler (Prerequisites)&lt;/h2&gt;
&lt;p&gt;Sistemimizde Rust'ın y&amp;uuml;kl&amp;uuml; olduğunu varsayarak devam edebiliriz ama değilse &lt;a href="https://rust-lang.org/" target="_blank"&gt;şuraya uğramakta&lt;/a&gt; yarar var.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;1. wasm-pack:&lt;/strong&gt; Bu ara&amp;ccedil; wasm paketlerinin oluşturulması ve wasm uyumlu rust projesi oluşturulmasında yardımcı olacak bir ara&amp;ccedil;. cargo aracı ile sistemimize kurabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;cargo install wasm-pack&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;2. Node.js and npm:&lt;/strong&gt; Sonu&amp;ccedil;ta bir web aray&amp;uuml;z&amp;uuml; var ve bunun servis edilmesi i&amp;ccedil;in bir runtime gerekiyor. Burada node.js ve npm işimize yarar. Bunların kurulumları i&amp;ccedil;inse nereye bakmanız gerektiğini biliyorsunuz ;) &lt;a href="https://nodejs.org/" target="_blank"&gt;İşte buraya&lt;/a&gt;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;3. Webpack:&lt;/strong&gt; Birde web paketlerinin build edilmesi, sunucunun başlatılması gibi işlerde bize yardımcı olacak webpack aracına ihtiyacımız var. Bunu projede www klas&amp;ouml;r&amp;uuml;n&amp;uuml; oluşturduktan sonra kuracağız. Yani aşağıdaki adımları takip etmeye devam edelim.&lt;/p&gt;
&lt;h2&gt;CPU/Memory Veri Toplama Servisi&lt;/h2&gt;
&lt;p&gt;&amp;Ouml;ncelikle işlemci ve bellek kullanımlarına ait bilgileri toplayan servis tarafını yazmaya başlayalım. Bu servisi de &lt;strong&gt;Rust&lt;/strong&gt; dilini kullanarak geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;cargo new cpu-mem-service

# Gerekli Crate'lerin y&amp;uuml;klenmesi
cargo add actix-web actix-cors sysinfo serde_json chrono
cargo add serde -F derive&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;actix-web&lt;/strong&gt; k&amp;uuml;fesini web framework olarak kullanacağız ve belki &lt;strong&gt;CORS&lt;/strong&gt; hatası olabilir diye &lt;strong&gt;actix-cors&lt;/strong&gt;'u da ele alacağız. Programın &amp;ccedil;alıştığı sistemdeki bilgileri toparlamak i&amp;ccedil;in &lt;strong&gt;sysinfo&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesi&lt;em&gt;(crate) &lt;/em&gt;kullanılabilir. &lt;strong&gt;REST&lt;/strong&gt; tabanlı bir servis olduğundan servis &amp;ccedil;ıktılarını &lt;strong&gt;JSON&lt;/strong&gt; formatından serileştirebiliriz. Burada da &lt;strong&gt;serde_json&lt;/strong&gt; ve &lt;strong&gt;serde&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phaneleri işimizi kolaylaştıracaktır. Tarih ve zaman bilgisi ilgili işleri kolaylaştırmak i&amp;ccedil;inse &lt;strong&gt;chrono&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesi ele alınmaktadır. Esasında sunucu tarafı kodlarımız olduk&amp;ccedil;a basit ve aşağıdaki gibi geliştirilebilir.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;use actix_cors::Cors;
use actix_web::{web, App, HttpServer, Responder};
use serde::Serialize;
use std::sync::Mutex;
use sysinfo::System;

#[actix_web::main]
async fn main() -&amp;gt; std::io::Result&amp;lt;()&amp;gt; {
    let app_state = web::Data::new(AppState {
        history: Mutex::new(Vec::new()),
    });

    let address = "0.0.0.0:8080";
    println!("Starting server on {}", address);

    HttpServer::new(move || {
        App::new()
            .app_data(app_state.clone())
            .route("/machine/stats", web::get().to(get_sys_stats))
            .wrap(
                Cors::default()
                    .allow_any_origin()
                    .allow_any_header()
                    .allow_any_method(),
            )
    })
    .bind(address)?
    .run()
    .await?;

    Ok(())
}

struct AppState {
    history: Mutex&amp;lt;Vec&amp;lt;SystemStats&amp;gt;&amp;gt;,
}

#[derive(Serialize, Clone)]
struct SystemStats {
    timestamp: u64,
    cpu_usage: f32,
    memory_total: u64,
    memory_used: u64,
}

async fn get_sys_stats(data: web::Data&amp;lt;AppState&amp;gt;) -&amp;gt; impl Responder {
    let mut system = System::new_all();
    system.refresh_all();

    let cpu_usage = system.global_cpu_usage();
    let memory_total = system.total_memory();
    let memory_used = memory_total - system.available_memory();
    let timestamp = chrono::Utc::now().timestamp() as u64;

    let stats = SystemStats {
        timestamp,
        cpu_usage,
        memory_total,
        memory_used,
    };

    let mut history = data.history.lock().unwrap();
    history.push(stats.clone());
    if history.len() &amp;gt; 50 {
        history.remove(0);
    }

    web::Json(history.clone())
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;get_sys_stats&lt;/strong&gt; isimli fonksiyon işlemci ve bellek kullanımlarını &lt;strong&gt;SystemStats&lt;/strong&gt; isimli nesneden oluşan bir vekt&amp;ouml;rde topluyor. Pek tabii bu bir web servisi olduğundan ve aynı andan birden fazla &lt;strong&gt;request&lt;/strong&gt; geleceğinden verinin kendisini talepler arasında &lt;strong&gt;thread safe&lt;/strong&gt; olarak koruma altına almak lazım. &lt;strong&gt;Mutex&lt;/strong&gt; kullanmamızın bir sebebi de bu.&lt;/p&gt;
&lt;p&gt;Servis tarafını tamamladıktan sonra en azından bir kere test etmekte yarar var. Bunun i&amp;ccedil;in tarayıcıdan &lt;strong&gt;localhost:8080/machine/stats&lt;/strong&gt; adresine gidebiliriz. Sayfayı her yenilediğimizde &lt;strong&gt;JSON&lt;/strong&gt; i&amp;ccedil;eriğinin artması &lt;em&gt;(max 50 kayıt tutar)&lt;/em&gt; gerekiyor. B&amp;ouml;ylece istemci tarafının sunucudaki son 50 istatistik bilgisini baz alarak işletilmesi sağlanabilir. &amp;Ccedil;alışma zamanı takriben aşağıdakine benzer olmalıdır. &lt;em&gt;(Ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; docker ge&amp;ccedil;işi sonrası alındığında port bilgisi 6501'dir)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2025/Ocak/MachineStats.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Pek tabii veriler servis &amp;ccedil;alıştığı s&amp;uuml;rece tutulur, zira bellekte mutex ile koruma altına alınmış bir vector kullanılmıştır. Kalıcı olmasını sağlamak adına fiziki bir depolama alanı &lt;em&gt;(dosya sistemi, veritabanı veya cloud provider)&lt;/em&gt; d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Bu durumda tutulan verinin &amp;ouml;rnek k&amp;uuml;mesi daha da artırılabilir. Burada şu soruyu sorabilirsiniz; "madem verileri sunucu tarafı sağlıyor, istatistik hesaplamasını da bir zahmet orası yapıp versin" :D &amp;Ccedil;ok haklısınız bu benimde kafamı kurcalayan birşey ama Rust ve WASM kullanımına hello world demek i&amp;ccedil;in ideal bir giriş senaryosu gibi de duruyor ;)&lt;/p&gt;
&lt;h2&gt;Opsiyonel Adım &lt;em&gt;(Servisin Dockerize Edilmesi)&lt;/em&gt;&lt;/h2&gt;
&lt;p&gt;Deneysel ama&amp;ccedil;la geliştirilmiş bu servis istenirse &lt;strong&gt;Dockerize&lt;/strong&gt; edilerek container ortamında da işletilebilir. Bunun i&amp;ccedil;in projeye aşağıdaki &lt;strong&gt;Dockerfile&lt;/strong&gt; ve &lt;strong&gt;docker-compose.yml&lt;/strong&gt; i&amp;ccedil;eriklerini eklemek yeterlidir.&lt;/p&gt;
&lt;p&gt;Dockerfile dosyası&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;FROM rust:1.84.0 as builder

WORKDIR /app
COPY . .
RUN cargo build --release

FROM debian:bookworm-slim
RUN apt-get update &amp;amp;&amp;amp; apt-get install -y libssl-dev ca-certificates &amp;amp;&amp;amp; rm -rf /var/lib/apt/lists/*

WORKDIR /app
COPY --from=builder /app/target/release/cpu-mem-service /app/

CMD ["./cpu-mem-service"]&lt;/pre&gt;
&lt;p&gt;ve&lt;strong&gt; docker-compose.yml&lt;/strong&gt; dosyası. &lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;services:
  cpu-mem-service:
    build: .
    ports:
      - "6501:8080"&lt;/pre&gt;
&lt;p&gt;Buna g&amp;ouml;re docker &amp;ccedil;alışma zamanında localhost:6501 portuna gelen istekler, container i&amp;ccedil;indeki 8080 portuna doğru y&amp;ouml;nlendirilecektir. Pek tabii programın docker container olarak hayat ge&amp;ccedil;mesi i&amp;ccedil;in iki k&amp;uuml;&amp;ccedil;&amp;uuml;k adımımız var. Aşağıdaki terminal komutları ile bu işlemleri ger&amp;ccedil;ekleştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# Docker build işlemi
docker-compose build

# &amp;Ccedil;alıştırmak i&amp;ccedil;inse
docker-compose up&lt;/pre&gt;
&lt;p&gt;Artık istemci tarafının geliştirilmesine başlayabiliriz.&lt;/p&gt;
&lt;h2&gt;WASM Uygulamasının Geliştirilmesi&lt;/h2&gt;
&lt;p&gt;Rust tarafında WASM ile ilgili işleri kolaylaştırmak i&amp;ccedil;in &lt;strong&gt;wasm-pack&lt;/strong&gt; aracından yararlanılabilir. &amp;Ouml;n gereksinimler kısmında sistemimize bu aracı nasıl y&amp;uuml;kleyeceğimizi belirtmiştik. &lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;wasm-pack new mach-dash-app
cd mach-dash-app

# json serileştirme desteği i&amp;ccedil;in serde_json
# asenkron fonksiyon desteği i&amp;ccedil;inse wasm-bindgen-futures
cargo add serde_json wasm-bindgen-futures&lt;/pre&gt;
&lt;p&gt;Bu işlemin ardından &lt;strong&gt;Cargo.toml&lt;/strong&gt; dosyasını kontrol etmekte yarar var. &amp;Ouml;zellikle &lt;strong&gt;dependencies&lt;/strong&gt; kısmında&lt;strong&gt; wasm-bindgen&lt;/strong&gt; mod&amp;uuml;l&amp;uuml;n&amp;uuml;n eklenmiş olması gerekiyor. Bu mod&amp;uuml;l &lt;strong&gt;WASM&lt;/strong&gt; ve &lt;strong&gt;Javascript&lt;/strong&gt; arasındaki iletişimde &amp;ouml;nemli bir role sahip.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;[dependencies]
wasm-bindgen = "0.2"&lt;/pre&gt;
&lt;p&gt;lib.rs dosyasının i&amp;ccedil;eriğini de aşağıdaki gibi oluşturabiliriz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;use wasm_bindgen::prelude::*;

#[wasm_bindgen]
pub async fn analyze_stats(json_data: &amp;amp;str) -&amp;gt; JsValue {
    let data: Vec&amp;lt;serde_json::Value&amp;gt; = serde_json::from_str(json_data).unwrap();

    let cpu_usages: Vec&amp;lt;f32&amp;gt; = data
        .iter()
        .map(|entry| entry["cpu_usage"].as_f64().unwrap() as f32)
        .collect();
    let avg_cpu_usage = cpu_usages.iter().sum::&amp;lt;f32&amp;gt;() / cpu_usages.len() as f32;

    let memory_usages: Vec&amp;lt;u64&amp;gt; = data
        .iter()
        .map(|entry| entry["memory_used"].as_u64().unwrap())
        .collect();
    let avg_memory_used = memory_usages.iter().sum::&amp;lt;u64&amp;gt;() / memory_usages.len() as u64;

    let result = serde_json::json!({
        "avg_cpu_usage": avg_cpu_usage,
        "avg_memory_used": avg_memory_used
    }).to_string();

    JsValue::from(&amp;amp;result)
}&lt;/pre&gt;
&lt;p&gt;Buradaki fonksiyon json olarak gelen veri i&amp;ccedil;eriğini alıp i&amp;ccedil;inden &amp;ccedil;eşitli istatistiki değerleri okuyor ve ortalama kullanım değerlerini hesaplıyor. Fonksiyonumuz esasında sadece bu kadar ancak siz buraya daha gelişmiş bir &amp;ouml;zellik katabilirsiniz. &amp;Ouml;rneğin bir regresyan analizi işletilebilir. Sonu&amp;ccedil;ta buradaki hesaplamalar tarayıcı tarafında ger&amp;ccedil;ekleştirilecektir. Kodlarımızı tamamladıktan sonra ise &lt;strong&gt;wasm-pack&lt;/strong&gt; ile gerekli paketleri oluşturmamız gerekiyor. Bu paket istemci tarafına indirilecek i&amp;ccedil;eriği barındırmakta.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;wasm-pack build --target web&lt;/pre&gt;
&lt;p&gt;Build işlemi sonrasında &lt;strong&gt;pkg&lt;/strong&gt; isimli bir klas&amp;ouml;r oluşacaktır. Bu klas&amp;ouml;rde&lt;strong&gt; wasm, js&lt;em&gt;(javascript)&lt;/em&gt; ve ts&lt;em&gt;(typescript)&lt;/em&gt;&lt;/strong&gt; uzantılı dosyalar olduğuna dikkat edelim. &lt;strong&gt;Webpack&lt;/strong&gt; gerekli i&amp;ccedil;eriklerin deployment ortamına alınması sırasında&amp;nbsp; işimizi kolaylaştıracaktır.&lt;/p&gt;
&lt;h2&gt;Frontend Geliştirmeleri&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;WASM&lt;/strong&gt; mod&amp;uuml;llerini kullanacak &amp;ouml;ny&amp;uuml;z tarafının geliştirilmesi ile yazımıza devam edelim. Bu ama&amp;ccedil;la &lt;strong&gt;root&lt;/strong&gt; klas&amp;ouml;r altında &lt;strong&gt;www&lt;/strong&gt; isimli başka bir alt klas&amp;ouml;r oluşturup i&amp;ccedil;erisinde &lt;strong&gt;nodejs&lt;/strong&gt; ortamının hazırlanması gerekiyor.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;mkdir www
cd www

# node initialize işlemleri (Bir Package.json oluşturur)
npm init -y

# Webpack mod&amp;uuml;llerinin y&amp;uuml;klenmesi
npm install --save-dev webpack webpack-cli webpack-dev-server copy-webpack-plugin&lt;/pre&gt;
&lt;p&gt;Az &amp;ouml;ncede belirttiğimiz &amp;uuml;zere webpack, deployment işlerini kolaylaştırmak i&amp;ccedil;in ele aldığımız bir ara&amp;ccedil;. Bu adımlardan sonra &lt;strong&gt;package.json&lt;/strong&gt; dosyasının aşağıdaki gibi olmasını sağlayalım. &lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;{
  "name": "mach-dash-app",
  "version": "1.0.0",
  "description": "Machine CPU Memory Measurement Dashboard",
  "main": "index.js",
  "scripts": {
    "start": "webpack serve --open",
    "build": "webpack"
  },
  "author": "Burak Selim Senyurt",
  "license": "MIT",
  "devDependencies": {
    "webpack": "^5.97.1",
    "webpack-cli": "^6.0.1",
    "webpack-dev-server": "^5.2.0"
  },
  "dependencies": {
    "copy-webpack-plugin": "^12.0.2",
    "chart.js": "^4.4.7"
  }
}
&lt;/pre&gt;
&lt;p&gt;start ve build, terminalden işleteceğimiz komutları işaret etmekte. Buna g&amp;ouml;re build işlemi webpack aracını devreye alacakken, start komutu webpack &amp;uuml;zerinden hot reload &amp;ouml;zelliği ile birlikte sunucu tarafını otomatik olarak başlatacaktır. Şimdi www klas&amp;ouml;r&amp;uuml; altında &lt;strong&gt;webpack.config.js&lt;/strong&gt; isimli bir dosya oluşturup i&amp;ccedil;eriğini aşağıdaki gibi oluşturalım.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;const path = require("path");
const CopyWebpackPlugin = require("copy-webpack-plugin");

module.exports = {
    entry: "./index.js",
    output: {
        path: path.resolve(__dirname, "dist"),
        filename: "bundle.js",
    },
    mode: "development",
    plugins: [
        new CopyWebpackPlugin({
            patterns: [{from: "index.html", to: "index.html"}],
        }),
    ],
    devServer: {
        static: "./dist",
        port: 6502,
        open: true,
    },
    experiments: {
        asyncWebAssembly: true,
    },
};&lt;/pre&gt;
&lt;p&gt;Burada belki de en &amp;ouml;nemli detay &lt;strong&gt;experiments&lt;/strong&gt; sekmesindeki &lt;strong&gt;asyncWebAssembly&lt;/strong&gt; &amp;ouml;zelliği. Bu &amp;ouml;nceki s&amp;uuml;r&amp;uuml;mlerde varsayılan olarak a&amp;ccedil;ık geliyordu diye hatırlıyorum ancak g&amp;uuml;ncel s&amp;uuml;r&amp;uuml;mde Web Assembly desteğini sunmak i&amp;ccedil;in a&amp;ccedil;ık&amp;ccedil;a belirtilmesi bekleniyor. Diğer yandan uygulamamız development ortamında 6502 nolu porttan hizmet verecek. Ayrıca index.js i&amp;ccedil;eriği bundle.js olarak paketlenecek. Genellikle birden fazla js dosyası varsa bundle.js gibi tek bir &amp;ccedil;ıktı i&amp;ccedil;erisine paketlenmesi &amp;ouml;neriliyor.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizde son kullanıcı a&amp;ccedil;ısından belki de en kıymetli kısım istatistiklerin grafiksel g&amp;ouml;sterimi elbette. Bunun i&amp;ccedil;in &lt;strong&gt;chart.js&lt;/strong&gt; isimli a&amp;ccedil;ık kaynak &lt;strong&gt;javascript&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesini kullanabiliriz. Pek tabii bu tip a&amp;ccedil;ık kaynak k&amp;uuml;t&amp;uuml;phaneleri şirket &amp;ccedil;&amp;ouml;z&amp;uuml;mlerinden kullanırken dikkatli olmakta fayda var zira g&amp;uuml;venlik a&amp;ccedil;ıkları barındırabilirler. B&amp;ouml;yle olmasa bile her yama(patch) &amp;ccedil;ıktığında denetlenmeleri ve &amp;ccedil;alışma ortamını bozmadıklarından emin olunması gerekir. Şimdi diyeceğim ki kendimiz yazalım ama bununla da uğraşılmaz doğrusu :D&lt;/p&gt;
&lt;p&gt;Artık &amp;ouml;ny&amp;uuml;z tarafını tasarlayabiliriz. Bu ama&amp;ccedil;la &lt;strong&gt;index.js&lt;/strong&gt; ve &lt;strong&gt;index.html&lt;/strong&gt; i&amp;ccedil;eriklerini sırasıyla aşağıdaki gibi geliştirelim.&lt;/p&gt;
&lt;p&gt;index.html;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;
&amp;lt;head&amp;gt;
    &amp;lt;meta charset="UTF-8"&amp;gt;
    &amp;lt;meta name="viewport" content="width=device-width, initial-scale=1.0"&amp;gt;
    &amp;lt;title&amp;gt;Server System Statistics - Trend Analysis&amp;lt;/title&amp;gt;
    &amp;lt;link href="https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css" rel="stylesheet"&amp;gt;
    &amp;lt;script src="https://cdn.jsdelivr.net/npm/chart.js"&amp;gt;&amp;lt;/script&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body&amp;gt;
    &amp;lt;div class="container mt-5"&amp;gt;
        &amp;lt;h1 class="text-center"&amp;gt;Server System Statistics - Trend Analysis&amp;lt;/h1&amp;gt;
        &amp;lt;div class="row"&amp;gt;
            &amp;lt;div class="col-md-12"&amp;gt;
                &amp;lt;canvas id="trendChart"&amp;gt;&amp;lt;/canvas&amp;gt;
            &amp;lt;/div&amp;gt;
        &amp;lt;/div&amp;gt;
        &amp;lt;div class="row mt-5"&amp;gt;
            &amp;lt;div class="col-md-6"&amp;gt;
                &amp;lt;h4&amp;gt;Average Memory Used: &amp;lt;span id="avgMemory"&amp;gt;&amp;lt;/span&amp;gt; MB&amp;lt;/h4&amp;gt;
            &amp;lt;/div&amp;gt;
            &amp;lt;div class="col-md-6"&amp;gt;
                &amp;lt;h4&amp;gt;Average CPU Usage: &amp;lt;span id="avgCpu"&amp;gt;&amp;lt;/span&amp;gt;%&amp;lt;/h4&amp;gt;
            &amp;lt;/div&amp;gt;
        &amp;lt;/div&amp;gt;
    &amp;lt;/div&amp;gt;

    &amp;lt;script type="module" src="./bundle.js"&amp;gt;&amp;lt;/script&amp;gt;
&amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;HTML&lt;/strong&gt; tasarımından ziyade esasında &lt;strong&gt;Javascript&lt;/strong&gt; i&amp;ccedil;eriği daha &amp;ouml;nemli. İlk satırda dikkat edileceği &amp;uuml;zere &lt;strong&gt;mack_dash_app.js&lt;/strong&gt; isimli dosyaya bir referans eklenmiş durumda. Bu referans kendi i&amp;ccedil;erisinde derlenmiş wasm mod&amp;uuml;l&amp;uuml;n&amp;uuml; kullanır. Bir başka deyişle, &amp;ouml;ny&amp;uuml;z tarafı i&amp;ccedil;in &lt;strong&gt;wasm&lt;/strong&gt; mod&amp;uuml;l&amp;uuml;n&amp;uuml;n bir soyutlamasını&lt;em&gt;(abstraction)&lt;/em&gt; sağlar ki bu da wasm i&amp;ccedil;erisine aldığımız fonksiyonları kullanmamızı kolaylaştırır.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;import init, { analyze_stats } from '../pkg/mach_dash_app.js';

await init();

const trendChart = new Chart(document.getElementById('trendChart'), {
    type: 'line',
    data: {
        labels: [],
        datasets: [
            {
                label: 'CPU Usage (%)',
                data: [],
                borderColor: 'rgba(75, 192, 192, 1)',
                tension: 0.1,
            },
            {
                label: 'Memory Used (MB)',
                data: [],
                borderColor: 'rgba(153, 102, 255, 1)',
                tension: 0.1,
            },
        ],
    },
});

async function updateStats() {
    const response = await fetch('http://localhost:6501/machine/stats');
    const data = await response.json();

    const analysis = await analyze_stats(JSON.stringify(data));
    const result = JSON.parse(analysis);

    document.getElementById('avgCpu').textContent = result.avg_cpu_usage.toFixed(2);
    document.getElementById('avgMemory').textContent = (result.avg_memory_used / 1024).toFixed(2);

    trendChart.data.labels = data.map((d) =&amp;gt;
        new Date(d.timestamp * 1000).toLocaleTimeString()
    );
    trendChart.data.datasets[0].data = data.map((d) =&amp;gt; d.cpu_usage);
    trendChart.data.datasets[1].data = data.map((d) =&amp;gt; d.memory_used / 1024);
    trendChart.update();
}

setInterval(updateStats, 5000);
updateStats();&lt;/pre&gt;
&lt;p&gt;Koda g&amp;ouml;re &lt;strong&gt;updateStats&lt;/strong&gt; fonksiyonu her beş saniyede bir &lt;strong&gt;REST&lt;/strong&gt; servisine &amp;ccedil;ağrıda bulunur, g&amp;uuml;ncel makine kullanım istatistiklerini i&amp;ccedil;eren veriyi &amp;ccedil;eker, bunu gerekli hesaplamaların yapılması i&amp;ccedil;in &lt;strong&gt;WASM&lt;/strong&gt; mod&amp;uuml;l&amp;uuml;ndeki &lt;strong&gt;analyze_stats&lt;/strong&gt; fonksiyonuna g&amp;ouml;nderir ve en nihayetinde fonksiyon &amp;ccedil;ıktısı da grafik k&amp;uuml;t&amp;uuml;phanesine girdi haline getirilir. I know, I know... &lt;strong&gt;WASM&lt;/strong&gt;'ın esprisi bu senaryoda sadece &lt;strong&gt;analyze_stats&lt;/strong&gt; fonksiyonunun kullanımı ile ilgili oldu. Ancak sanıyorum gidiş yolunu anladınız. &amp;Ouml;yleyse artık projeyi derleme&lt;em&gt;(build)&lt;/em&gt; ve &amp;ccedil;alıştırma&lt;em&gt;(run)&lt;/em&gt; adımlarına ge&amp;ccedil;ebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# www klas&amp;ouml;r&amp;uuml;ndeyken
# build işlemi
npm run build

# Projenin &amp;ccedil;alıştırılması
npm run start&lt;/pre&gt;
&lt;p&gt;Eğer build aşamasında bir sorun olmadıysa &lt;strong&gt;localhost:6502&lt;/strong&gt; adresine gittiğimizde işlemci ve bellek kullanım oranlarının yakalandığı bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; alabilmeliyiz. Ayrıca bu grafik her beş saniyede bir yenilenmeli. Ben tabii sistemde işlemci kullanımını tavan noktalara &amp;ccedil;ekecek veya belleği aşırı t&amp;uuml;ketecek işlemleri yakalayamadım ve d&amp;uuml;z bir &amp;ccedil;izgi elde ettim ve buda yazdıklarımı kontrol etmeniz i&amp;ccedil;in bir sebep ;)&lt;/p&gt;
&lt;p&gt;Aslında geliştirme adımları itibariyle biraz karışık g&amp;ouml;r&amp;uuml;n&amp;uuml;yor değil mi? Bence de &amp;ouml;yle :D Microsoft'un Blazor ile Visual Studio IDE'si &amp;uuml;st&amp;uuml;nden ya da proje şablonları yardımıyla &lt;strong&gt;dotnet&lt;/strong&gt; komut satırı aracından sağladığı kolaylığı hen&amp;uuml;z bu ortamda bulabilmiş değilim. Yine de amacımız bu rahatlıktan ziyade &lt;strong&gt;Rust ile WASM&lt;/strong&gt;'ın bir arada ele alındığı ve ger&amp;ccedil;ek hayat senaryolarına yakın bir &amp;ouml;rneği ele almaktı. Bu senaryoyu genişletmek tamamen sizin elinizde. &amp;Ouml;rneğin chart k&amp;uuml;t&amp;uuml;phanesini terk edip &amp;ccedil;izdirme işlemini WASM mod&amp;uuml;l&amp;uuml; i&amp;ccedil;erisine almayı deneyebilirsiniz ;) Ya da ger&amp;ccedil;ekten regresyon analizini WASM mod&amp;uuml;l&amp;uuml;ndeki fonksiyonda yaptıracak bir geliştirme yapabilirsiniz. Ayrıca local storage'da izin verilen b&amp;ouml;lgelere &amp;ccedil;ıkıp belki son birka&amp;ccedil; 50 par&amp;ccedil;alık istatistiği tarayıcı tarafında &amp;ouml;nbelleğe alarak ilerlemeyi deneyebilirsiniz. Bana kalırsa bu işin nirvanası tarayıcıda &amp;ccedil;alışan bir oyun yazma. &lt;a href="https://github.com/buraksenyurt/rust-farm/tree/main/handson/running_rectangle" target="_blank"&gt;Tamda şurada olduğu gibi&lt;/a&gt; :D&lt;/p&gt;
&lt;p&gt;Umarım bilgi verici olmuştur. Bir başka yazıda g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;Proje kodlarına &lt;a href="https://github.com/buraksenyurt/friday-night-programmer/tree/main/src" target="_blank"&gt;github reposundan&lt;/a&gt; ulaşabilirsiniz &lt;em&gt;(&lt;strong&gt;cpu-mem-service&lt;/strong&gt; ve &lt;strong&gt;mach-dash-app&lt;/strong&gt; isimli klas&amp;ouml;rler)&lt;/em&gt;&lt;/p&gt;</content>
  <pubDate>2025-01-27 14:29:00</pubDate>
  <slug>sunucu-metriklerini-izleme-rust-ve-wasm-ile</slug>
  <tags>
    <tag>rust</tag>
    <tag>rust-programming-language</tag>
    <tag>rust-lang</tag>
    <tag>wasm</tag>
    <tag>web-assembly</tag>
    <tag>rest</tag>
    <tag>rest-api</tag>
    <tag>webpack</tag>
    <tag>nodejs</tag>
    <tag>npm</tag>
  </tags>
  <categories>
    <category>Rust</category>
  </categories>
</post>