<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>LINQ to SQL ile CRUD İşlemleri</title>
  <description>Language Integrated Query(LINQ) mimarisi özellikle programatik ortamlarda tasarlanan nesneler üzerinde, SQL cümlelerine benzer ifadeler ile sorgulamalar yapılmasına izin vermektedir. Çok doğal olarak veritabanı(database) tarafında yer alan tablo(Table), saklı yordam(Stored Procedure), görünüm(View), fonksiyon(Function) gibi unsurlarında programatik tarafta birer varlık(Entity) olarak ifade edilebilmesi, LINQ kurallarının SQL üzerindede gerçekleştirilebilmesini sağlamaktadır. Burada varlık katmanı(Entity Layer) olarakda düşünebileceğimiz yapı üzerinde yer alan nesneler, veritabanından çekilen sonuçları saklayabilmektedir. Bunun yanında programatik ortamdaki varlıklar üzerinde yeni varlık oluşturma, güncelleme, silme gibi operasyonlarda yapılabilmektedir.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Language Integrated Query(LINQ) &lt;/strong&gt;mimarisi &amp;ouml;zellikle programatik ortamlarda tasarlanan nesneler &amp;uuml;zerinde, &lt;strong&gt;SQL&lt;/strong&gt; c&amp;uuml;mlelerine benzer ifadeler ile sorgulamalar yapılmasına izin vermektedir. &amp;Ccedil;ok doğal olarak &lt;strong&gt;veritabanı(database)&lt;/strong&gt; tarafında yer alan &lt;strong&gt;tablo(Table),&lt;/strong&gt; &lt;strong&gt;saklı yordam(Stored Procedure), g&amp;ouml;r&amp;uuml;n&amp;uuml;m(View), fonksiyon(Function)&lt;/strong&gt; gibi unsurlarında programatik tarafta birer &lt;strong&gt;varlık(Entity)&lt;/strong&gt; olarak ifade edilebilmesi, LINQ kurallarının SQL &amp;uuml;zerindede ger&amp;ccedil;ekleştirilebilmesini sağlamaktadır. Burada &lt;strong&gt;varlık katmanı(Entity Layer)&lt;/strong&gt; olarakda d&amp;uuml;ş&amp;uuml;nebileceğimiz yapı &amp;uuml;zerinde yer alan nesneler, veritabanından &amp;ccedil;ekilen sonu&amp;ccedil;ları saklayabilmektedir. Bunun yanında programatik ortamdaki varlıklar &amp;uuml;zerinde yeni varlık oluşturma, g&amp;uuml;ncelleme, silme gibi operasyonlarda yapılabilmektedir. İşte bu makalemizde &amp;ccedil;oğunlukla &lt;strong&gt;CreateRetrieveUpdateDelete (CRUD)&lt;/strong&gt; işlemleri olarak belirtilen bu operasyonları nasıl yapabileceğimizi, adım adım basit &amp;ouml;rnekler &amp;uuml;zerinden incelemeye &amp;ccedil;alışıyor olacağız. &lt;em&gt;(Bu makalede geliştirilmekte olan &amp;ouml;rnek kod par&amp;ccedil;aları &lt;strong&gt;Visual Studio 2008 RTM&lt;/strong&gt; ortamında yazılmıştır.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak &amp;ouml;rnek bir &lt;strong&gt;SQL&lt;/strong&gt; veritabanındaki &lt;strong&gt;tablo(table)&lt;/strong&gt; yapılarını programatik ortamda taşıyacak olan sınıfların &amp;uuml;retilmesi gerekmektedir. Bu ama&amp;ccedil;la &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; &amp;uuml;zerinde basit bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması a&amp;ccedil;arak ilerleyebiliriz. Burada dikkat edilmesi gereken &amp;ouml;nemli noktalardan birisi &lt;strong&gt;New Project&lt;/strong&gt; se&amp;ccedil;imi sonrası karşımıza &amp;ccedil;ıkacak olan iletişim penceresinden &lt;strong&gt;.Net Framework 3.5&lt;/strong&gt; versiyonunun işaretlenmiş olmasıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_1.gif" alt="" width="553" height="157" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu şart olmamakla birlikte, &lt;strong&gt;LINQ&lt;/strong&gt; i&amp;ccedil;in gerekli olan &lt;strong&gt;assembly&lt;/strong&gt;' ların(&amp;ouml;rneğin &lt;strong&gt;System.Data.DataSetExtensions&lt;/strong&gt; gibi) otomatik olarak referans edilmesini sağlamaktadır. Bu adımdan sonra &lt;strong&gt;entity&lt;/strong&gt; sınıflarının kolay bir şekilde oluşturulmasını sağlayan &lt;strong&gt;LINQ To SQL Class&lt;/strong&gt; &amp;ouml;ğesini projemize eklememiz gerekmektedir.&lt;em&gt;(LINQ to SQL sınıflarının oluşturulması ile ilişkili detaylı bilgiyi C#Nedir? yer alan &lt;a href="http://www.csharpnedir.com/videoindir.asp?id=71"&gt;g&amp;ouml;rsel&lt;/a&gt; dersten &amp;ouml;ğrenebilirsiniz.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_2.gif" alt="" width="630" height="345" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece veritabanı &amp;uuml;zerindeki nesnel yapıları programatik ortamda ifade edebileceğimiz &lt;strong&gt;Database Markup Language(dbml)&lt;/strong&gt; dosyası otomatik olarak oluşturulmaktadır. &lt;strong&gt;Adventure.dbml &lt;/strong&gt;dosyasnın kod tarafına bakıldığında &lt;strong&gt;DataContext&lt;/strong&gt; tipinden t&amp;uuml;retilmiş olan bir sınıfın yazıldığı g&amp;ouml;r&amp;uuml;lmektedir. Şimdi yapmamız gereken, &amp;uuml;zerinde işlemler ger&amp;ccedil;ekleştirilecek olan veritabanı nesnelerini tasarım ortamına s&amp;uuml;r&amp;uuml;kleyip bırakmaktır. İlk etapta &amp;ouml;rneğin basit olması a&amp;ccedil;ısından sadece &lt;strong&gt;Production&lt;/strong&gt; şemasında(schema) yer alan &lt;strong&gt;ProductCategory&lt;/strong&gt; isimli tablo tasarım ortamına, &lt;strong&gt;Server Explorer&lt;/strong&gt; pencersinden s&amp;uuml;r&amp;uuml;klenmiştir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_3.gif" alt="" width="531" height="299" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu basit operasyonun ardından aşağıdaki &lt;strong&gt;sınıf diagramında(Class Diagram)&lt;/strong&gt; olduğu gibi &lt;strong&gt;ProductCategory&lt;/strong&gt; i&amp;ccedil;in bir tipin yazıldığı ve bununla ilişkili olaraktanda, &lt;strong&gt;DataContext&lt;/strong&gt; tipinden t&amp;uuml;reyen &lt;strong&gt;AdventureDataContext&lt;/strong&gt; sınıfı i&amp;ccedil;erisine &lt;strong&gt;ProductCategories&lt;/strong&gt; isimli bir &amp;ouml;zelliğin(Properties) atıldığı g&amp;ouml;r&amp;uuml;lmektedir. ProductCategories &amp;ouml;zelliği generic Table&amp;lt;ProductCategory&amp;gt; tipinden bir nesne referansını işaret etmektedir. Bu generic tip tahmin edileceği &amp;uuml;zere ProductCategory tabosundaki t&amp;uuml;m i&amp;ccedil;eriği taşıyan sınıftır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_4.gif" alt="" width="565" height="415" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Artık bu noktadan sonra &lt;strong&gt;AdventureDataContext&lt;/strong&gt; sınıfına ait nesne &amp;ouml;rneklerini kullanarak kategorilerin elde edilmesi, sorgulanması, yeni kategorilerin oluşturulması(Insert), var olanlardan bir veya bir ka&amp;ccedil;ının silinmesi(Delete) yada g&amp;uuml;ncellenmesi(Update) gibi işlemler kolaylıkla yapılabilir. İlk olarak yeni bir kategoriyi nasıl ekleyebileceğimizi &amp;ouml;rnek bir kod par&amp;ccedil;ası &amp;uuml;zerinden incelemeye &amp;ccedil;alışalım. Bu ama&amp;ccedil;la &lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisine aşağıdaki kod satırlarını eklediğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;AdventureDataContext adwContext = new AdventureDataContext();

ProductCategory tools = new ProductCategory() 
                                                                        { 
                                                                            Name = "Tools" 
                                                                            , ModifiedDate=new DateTime(2001,1,1)
                                                                        };

adwContext.ProductCategories.InsertOnSubmit(tools);&lt;/pre&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;AdventureDataContext&lt;/strong&gt; tipine ait bir nesne &amp;ouml;rneği oluşturulmaktadır. Bu işlemin arkadasındanda eklenmek istenen &lt;strong&gt;ProductCategory&lt;/strong&gt; nesne &amp;ouml;rneği &lt;strong&gt;C# 3.0&lt;/strong&gt; ile birlikte gelen &lt;strong&gt;nesne başlatıcılarından(Object Initializers)&lt;/strong&gt; yararlanılarak &amp;ouml;rneklenmektedir. Bu noktada &lt;strong&gt;Table&amp;lt;T&amp;gt; &lt;/strong&gt;generic tipinden olan &lt;strong&gt;ProductCategories&lt;/strong&gt; sınıfının &lt;strong&gt;InsertOnSubmit&lt;/strong&gt; metodu, koleksiyonuna ilave edilmek &amp;uuml;zere yeni bir ProductCategory nesne &amp;ouml;rneğinin eklenmesi i&amp;ccedil;in kullanılmaktadır. Burada &amp;uuml;zerinde durulması gereken &amp;ouml;nemli bir nokta vardır. &lt;strong&gt;InsertOnSubmit&lt;/strong&gt; metodu sadece Table&amp;lt;T&amp;gt; koleksiyonuna ilave edilmek &amp;uuml;zere bir nesne eklemektedir. Bir başka deyişle ProductCategories koleksiyonu &amp;uuml;zerinde yapılacak bir for d&amp;ouml;ng&amp;uuml;s&amp;uuml;nde eklenen nesne(ler) g&amp;ouml;r&amp;uuml;lmeyecektir. Bunu test etmek i&amp;ccedil;in aşağıdaki gibi bir kod par&amp;ccedil;asını ele alabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var categories = from category in adwContext.ProductCategories
                            select category.Name; 

foreach(string ctgr in categories)
    Console.WriteLine(ctgr);&lt;/pre&gt;
&lt;p&gt;Bunun sonucu olarak &amp;ccedil;alışma zamanında(run time) aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_5.gif" alt="" width="302" height="136" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada sebep son derece a&amp;ccedil;ıktır. &lt;strong&gt;var&lt;/strong&gt; anahtar kelimesinden(keyword) sonra &lt;strong&gt;foreach&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml;n iterasyona başlamasıyla birlikte &lt;strong&gt;SQL&lt;/strong&gt; sunucusu &amp;uuml;zerinde bir &lt;strong&gt;select&lt;/strong&gt; sorgusu &amp;ccedil;alışamaktadır. Bu sorgu &lt;strong&gt;SQL Profiler&lt;/strong&gt; yardımıyla kolay bir şekilde yakalanabilir. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde bu durum g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_6.gif" alt="" width="515" height="302" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dolayısıyla &lt;strong&gt;eklenmek(Insert)&lt;/strong&gt; &amp;uuml;zere ilave edilen ProductCategory nesne &amp;ouml;rneği hen&amp;uuml;z veritabanına doğru g&amp;ouml;nderilmemiştir. Bu işlemin nasıl yapıldığını g&amp;ouml;rmeden &amp;ouml;nce koleksiyona eklenen ve insert işlemi i&amp;ccedil;in sırada bekleyen nesne &amp;ouml;rneklerini nasıl elde edebileceğimize bakalım. Burada &lt;strong&gt;DataContext&lt;/strong&gt; sınıfına ait &lt;strong&gt;GetChangeSet&lt;/strong&gt; metodundan yararlanılmaktadır. Bu metod ile elde edilen &lt;strong&gt;ChangedSet&lt;/strong&gt; nesne &amp;ouml;rneği &amp;uuml;zerinden &lt;strong&gt;Inserts,Deletes&lt;/strong&gt; veya &lt;strong&gt;Updates&lt;/strong&gt; &lt;strong&gt; &amp;ouml;zellikleri(Properties)&lt;/strong&gt; kullanılarak eklenen, silinen veya g&amp;uuml;ncellenen &amp;ouml;rnekler yakalanabilir.&lt;/p&gt;
&lt;table id="table181" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td valign="top" width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;&lt;strong&gt;Inserts&lt;/strong&gt;, &lt;strong&gt;Deletes&lt;/strong&gt; ve &lt;strong&gt;Updates&lt;/strong&gt; &amp;ouml;zellikleri geriye &lt;strong&gt;IList&amp;lt;T&amp;gt;&lt;/strong&gt; tipinden bir referans d&amp;ouml;nd&amp;uuml;rmektedir. Bu referans bilgisinden yararlanılarak eklenen, silinen veya g&amp;uuml;ncellenen t&amp;uuml;m nesnelerin yakalanması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. &lt;strong&gt;IList&amp;lt;T&amp;gt;&lt;/strong&gt; &lt;strong&gt;aray&amp;uuml;z&amp;uuml;(Interface) .Net 2.0&lt;/strong&gt; versiyonundan beri mevcuttur. Ayrıca &lt;strong&gt;IEnumerable&amp;lt;T&amp;gt;&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;nden t&amp;uuml;remiş olduğundan, elde edilen referans &amp;uuml;zerinde &lt;strong&gt;LINQ&lt;/strong&gt; sorgularıda yazılabilir. Bu sayede eklenen, silinen veya g&amp;uuml;ncellenen nesnelerin veritabanına yazılmadan &amp;ouml;nce sorgulanmalarıda m&amp;uuml;mk&amp;uuml;n olmaktadır.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;&lt;img src="/makale/images/mk235_7.gif" alt="" width="337" height="160" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek uygulamada bu kod par&amp;ccedil;ası denenirse eklenen tool isimli yeni kategorininde elde edildiği g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_8.gif" alt="" width="469" height="202" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak &lt;strong&gt;ProductCategoryID&lt;/strong&gt; gibi alanlar veritabanı &amp;uuml;zerindeki tabloda otomatik olarak &amp;uuml;retildiklerinden ve kod i&amp;ccedil;erisinde herhangibir değer atanmadığından hen&amp;uuml;z oluşturulmamıştır. Yapılan bu ekleme(Insert) işleminin veritabanına g&amp;ouml;nderilmesi i&amp;ccedil;in tek yapılması gereken ise &lt;strong&gt;DataContext&lt;/strong&gt; tipinin &lt;strong&gt;SubmitChanges&lt;/strong&gt; metodunu &amp;ccedil;alıştırmaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;adwContext.SubmitChanges();&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;SubmitChanges&lt;/strong&gt; metodu &amp;ccedil;alıştırıldığında &lt;strong&gt;Insert&lt;/strong&gt;, &lt;strong&gt;Update&lt;/strong&gt; veya &lt;strong&gt;Delete&lt;/strong&gt; kuyruğunda bekleyen t&amp;uuml;m nesneler i&amp;ccedil;in gerekli &lt;strong&gt;SQL&lt;/strong&gt; &lt;strong&gt;sorguları(Queries)&lt;/strong&gt; y&amp;uuml;r&amp;uuml;t&amp;uuml;lmektedir. S&amp;ouml;z gelimi yukarıdaki &amp;ouml;rneğe g&amp;ouml;re &lt;strong&gt;SQL Profiler&lt;/strong&gt; ile arkada &amp;ccedil;alışan kodlar izlenirse aşağıdaki sonu&amp;ccedil;ların elde edildiği g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;exec sp_executesql N'INSERT INTO [Production].[ProductCategory]([Name], [rowguid], [ModifiedDate])
VALUES (@p0, @p1, @p2)

SELECT CONVERT(Int,SCOPE_IDENTITY()) AS [value]',N'@p0 nvarchar(5),@p1 uniqueidentifier,@p2 datetime',@p0=N'Tools',@p1='00000000-0000-0000-0000-000000000000',@p2='2001-01-01 00:00:00:000'&lt;/pre&gt;
&lt;p&gt;Bu &amp;ccedil;alışan sorgu(Query) basit olarak &amp;uuml;retilen varlık nesnesinin(Entity Object) veritabanına doğru yazılmasını sağlamaktadır. İstenirse toplu olarak veri ekleme işlemleride ger&amp;ccedil;ekleştirilebilir. Bunun i&amp;ccedil;in tek yapılması gereken &lt;strong&gt;InsertAllOnSubmit&lt;/strong&gt; metodunu kullanmaktadır. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asında toplu bir ekleme işleminin nasıl yapılabileceği g&amp;ouml;sterilmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;adwContext.ProductCategories.InsertAllOnSubmit(
                                                            new List&amp;lt;ProductCategory&amp;gt;()
                                                                {
                                                                    new ProductCategory(){Name="Kategori X", ModifiedDate=new DateTime(2006,12,3),rowguid=Guid.NewGuid()}
                                                                    ,new ProductCategory(){Name="Kategori Y",ModifiedDate=new DateTime(2006,5,6),rowguid=Guid.NewGuid()}
                                                                    ,new ProductCategory(){Name="Kategori Z",ModifiedDate=new DateTime(2007,1,4),rowguid=Guid.NewGuid()}
                                                                }
                                                            );

var eklenenler = adwContext.GetChangeSet().Inserts;

foreach (ProductCategory eklenen in eklenenler)
    Console.WriteLine(eklenen.Name);

adwContext.SubmitChanges();&lt;/pre&gt;
&lt;p&gt;Yine nesne başlatıcılarından(Object Initializers) yararlanılarak, &lt;strong&gt;InsertAllOnSubmit&lt;/strong&gt; metodu i&amp;ccedil;erisinde &lt;strong&gt;ProductCategory&lt;/strong&gt; tipinden &amp;ouml;rnekler alabilecek generic List koleksiyonu oluşturulmuş ve 3 &amp;ouml;rnek ProductCategory eklenmiştir. İlave edilen satırları elde edebilmek i&amp;ccedil;in yine &lt;strong&gt;GetChangeSet&lt;/strong&gt; metodu &amp;uuml;zerinden &lt;strong&gt;Inserts&lt;/strong&gt; &amp;ouml;zelliği kullanılmaktadır. &lt;strong&gt;DataContext&lt;/strong&gt; tipi &amp;uuml;zerinden &lt;strong&gt;SubmitChanges&lt;/strong&gt; metodunun &amp;ccedil;alıştırılması ile birlikte, &lt;strong&gt;varlık(Entity) &lt;/strong&gt;tiplerine eklenen 3 ProductCategory nesnesi i&amp;ccedil;inde birer &lt;strong&gt;Insert&lt;/strong&gt; sorgusu &lt;strong&gt;SQL&lt;/strong&gt; sunucusu &amp;uuml;zerinde y&amp;uuml;r&amp;uuml;t&amp;uuml;lmektedir. Bu durumu daha iyi analiz etmek i&amp;ccedil;in &lt;strong&gt;SQL Profiler &lt;/strong&gt;aracı kullanıldığında aşağıdakine benzer sonu&amp;ccedil;lar alındığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_9.gif" alt="" width="546" height="357" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere her bir varlık nesnesi(Entity Object) i&amp;ccedil;in birer &lt;strong&gt;Insert&lt;/strong&gt; sorgusu y&amp;uuml;r&amp;uuml;t&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;Gelelim silme işlemlerine. Silme(Delete) operasyonlarındada ekleme işlemlerine benzer şekilde &lt;strong&gt;DeleteOnSubmit&lt;/strong&gt; ve &lt;strong&gt;DeleteAllOnSubmit&lt;/strong&gt; gibi metodlar yer almaktadır. Herzamanki gibi varlık nesneleri &amp;uuml;zerinden yapılan silme işlemleri &lt;strong&gt;GetChangeSet&lt;/strong&gt; metodu &amp;uuml;zerinden ulaşılan &lt;strong&gt;Deletes&lt;/strong&gt; &amp;ouml;zelliği yardımıyla elde edilebilir. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asında tek bir satırın silme işleminin nasıl yapılabileceği g&amp;ouml;sterilmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;ProductCategory silinecekVeri = (from cat in adwContext.ProductCategories
                                                        where cat.ProductCategoryID == 25
                                                            select cat).Single&amp;lt;ProductCategory&amp;gt;();

adwContext.ProductCategories.DeleteOnSubmit(silinecekVeri);

var silinenler = adwContext.GetChangeSet().Deletes;

foreach(ProductCategory silinen in silinenler)
    Console.WriteLine(silinen.Name);

adwContext.SubmitChanges();&lt;/pre&gt;
&lt;p&gt;Burada dikkat edilmesi gerken bazı noktalar vardır. Silinmek istenilen satır veya satırların &amp;ouml;ncelikli olarak bulunması gerekir. Bu &amp;ccedil;ok doğal olarak &lt;strong&gt;Table&amp;lt;T&amp;gt; &lt;/strong&gt;tipi &amp;uuml;zerinden bir &lt;strong&gt;LINQ&lt;/strong&gt; sorgusu ile m&amp;uuml;mk&amp;uuml;n olabilir. Dolayısıyla yukarıdaki kod par&amp;ccedil;asına g&amp;ouml;re, silinecekVeri isimli koleksiyon elde edilirken arka planda aşağıdaki sorgu c&amp;uuml;mlesi &amp;ccedil;alışacaktır.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;exec sp_executesql N'SELECT TOP (1) [t0].[ProductCategoryID], [t0].[Name], [t0].[rowguid], [t0].[ModifiedDate]
FROM [Production].[ProductCategory] AS [t0]
WHERE [t0].[ProductCategoryID] = @p0',N'@p0 int',@p0=25&lt;/pre&gt;
&lt;p&gt;Bu adımdam sonra &lt;strong&gt;DeleteOnSubmit&lt;/strong&gt; metoduna, silinmek istenen &lt;strong&gt;varlık(Entity)&lt;/strong&gt; &amp;ouml;rneği parametre olarak verilmektedir. Bu işlem sadece silinecek olan veriler i&amp;ccedil;in kuyruğa bir ekleme yapmaktadır. &amp;Ouml;yleki bu metod &amp;ccedil;ağırıldıktan sonra &lt;strong&gt;ProductCategories&lt;/strong&gt; koleksiyonuna bakılırsa, 25 numaralı &lt;strong&gt;ProductCategory&lt;/strong&gt; tipinin halen daha mevcut olduğu g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_10.gif" alt="" width="478" height="339" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Silinmek istenen verinin programatik ortamda elde edilmesi i&amp;ccedil;in tek yapılması gereken &lt;strong&gt;GetChangeSet&lt;/strong&gt; metodu &amp;uuml;zerinden &lt;strong&gt;Deletes&lt;/strong&gt; &amp;ouml;zelliğine ulaşmaktır. &amp;Ccedil;alışma zamanı &lt;strong&gt;SubmitChanges&lt;/strong&gt; metodunu y&amp;uuml;r&amp;uuml;tt&amp;uuml;ğ&amp;uuml;nde ise silinmek istenen &lt;strong&gt;entity&lt;/strong&gt; nesnesi ile ilgili olaraktan aşağıdaki sorgu c&amp;uuml;mlesi &lt;strong&gt;SQL&lt;/strong&gt; tarafında işletilecektir.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;exec sp_executesql N'DELETE FROM [Production].[ProductCategory] 
WHERE 
      ([ProductCategoryID] = @p0) AND ([Name] = @p1) AND ([rowguid] = @p2) AND ([ModifiedDate] = @p3)',N'@p0 int,@p1 nvarchar(10),@p2 uniqueidentifier,@p3 datetime',@p0=25,@p1=N'Kategori Y',@p2='B68CEBC9-CFFF-4AD5-9F5A-ADEC8823E88A',@p3='2006-06-05 00:00:00:000'&lt;/pre&gt;
&lt;p&gt;Sorgu c&amp;uuml;mlesindende dikkat edileceği &amp;uuml;zere &lt;strong&gt;Where&lt;/strong&gt; ifadesinden sonra t&amp;uuml;m alanlar hesaba katılmaktadır. Bunun sebebi &lt;strong&gt;LINQ to SQL &lt;/strong&gt;mimarisinin &lt;strong&gt;Optimistic(İyimser) Concurrency&lt;/strong&gt; modelini kullanmasıdır. Bu modellde bilindiği &amp;uuml;zere kontrol edilebilir t&amp;uuml;m alanlar &lt;strong&gt;Where&lt;/strong&gt; ifadesinden sonra hesaba katılmaktadır. Bir başka deyişle model, veriyi başkasının silip silmediğini, g&amp;uuml;ncelleştirip g&amp;uuml;ncelleştirmediğini araştırmaktadır.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekte 25 numaralı kategoriye ait satırı silmeden &amp;ouml;nce başka birisi değiştirmişse eğer, &amp;ccedil;alışma zamanında &lt;strong&gt;ChangeConflictException&lt;/strong&gt; istisnası alınır. Bu durumu daha iyi analiz etmek i&amp;ccedil;in 25 numaralı satırı silmek istediğimizi g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. &lt;strong&gt;SubmitChanges&lt;/strong&gt; metodu &amp;ccedil;ağırılmadan &amp;ouml;ncede veritabanından manuel olarak yada başka bir program &amp;uuml;zerinden 25 numaralı satırın &lt;strong&gt;Name&lt;/strong&gt; alanının değerini Kategori X' den Kategori XL' ye değiştirelim. Bunu kolay bir şekilde ger&amp;ccedil;ekleştirmek i&amp;ccedil;in &lt;strong&gt;SubmitChanges&lt;/strong&gt; satırına &lt;strong&gt;breakpoint&lt;/strong&gt; koyup ilerlemeden &amp;ouml;nce tabloda değişiklik yapmak yeterli olacaktır. B&amp;ouml;yle bir durumda &amp;ccedil;alışma zamanında(run time) aşağıdaki gibi bir durum olaşacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_11.gif" alt="" width="481" height="158" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Nitekim biz silmek istediğimiz veriyi &amp;ccedil;ektikten sonra &lt;strong&gt;Name&lt;/strong&gt; alanının değeri Kategori X iken, &lt;strong&gt;SubmitChanges&lt;/strong&gt;' den &amp;ouml;nce Kategori XL' ye değiştirilmiştir. Buda doğal olarak &lt;strong&gt;Where&lt;/strong&gt; ifadesinin ge&amp;ccedil;ersiz olması anlamına gelmektedir. Ancak bu durum istenirse değiştirilebilir. &amp;Ouml;yleki, &lt;strong&gt;varlık(Entity) &lt;/strong&gt;sınıflarında yer alan &lt;strong&gt;&amp;ouml;zelliklerin(Properties) Column&lt;/strong&gt; isimli &lt;strong&gt;niteliklerine(Attribute) &lt;/strong&gt;ait &lt;strong&gt;ColumnChange&lt;/strong&gt; &amp;ouml;zelliğinin değeri &lt;strong&gt;Never&lt;/strong&gt; yapıldığında s&amp;ouml;z konusu &amp;ouml;zelliklerin Where ifadelerinden sonrasına katılmadığı g&amp;ouml;r&amp;uuml;lmektedir. S&amp;ouml;z gelimi &amp;ouml;rnekte yer alan ProductCategory sınıfının &lt;strong&gt;Name&lt;/strong&gt;, &lt;strong&gt;rowguid&lt;/strong&gt; ve &lt;strong&gt;ModifiedDate&lt;/strong&gt; &amp;ouml;zelliklerinde yer alan &lt;strong&gt;Column&lt;/strong&gt; niteliğinde aşağıdaki gibi bir değişiklik yaptığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[Column(Storage="_Name", DbType="NVarChar(50) NOT NULL", CanBeNull=false,UpdateCheck=UpdateCheck.Never)]
public string Name&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;UpdateCheck&lt;/strong&gt; değerine &lt;strong&gt;Never&lt;/strong&gt; atanması sonucu s&amp;ouml;z konusu &amp;ouml;zelliğin değeri &lt;strong&gt;WHERE&lt;/strong&gt; ifadesine parametre olarak dahil edilmeyecektir. Bu işlemin ardından &amp;ouml;rnek olarak başka bir satırı daha silmek istersek arka tarafta &amp;ccedil;alışan &lt;strong&gt;Delete&lt;/strong&gt; sorgusunun aşağıdaki gibi oluşturulduğunu g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;exec sp_executesql N'DELETE FROM [Production].[ProductCategory] 
     WHERE [ProductCategoryID] = @p0',N'@p0 int',@p0=29&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi sadece &lt;strong&gt;ProductCategoryID&lt;/strong&gt; alanı &lt;strong&gt;WHERE&lt;/strong&gt; ifadesinden sonrasına katılmıştır. &lt;em&gt;(Kodun bundan sonraki kısımlarında Optimistic Concurrency modeline g&amp;ouml;re ilerleneceğinden UpdateCheck değişiklikleri geri alınmıştır.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;İstenirse toplu olarak silme işlemleride ger&amp;ccedil;ekleştirilebilir. &amp;Ouml;rneğin Name &amp;ouml;zelliğinin i&amp;ccedil;erisinde Kategori kelimesi ge&amp;ccedil;en satırları silmek istediğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu ama&amp;ccedil;la aşağıdaki gibi bir kod par&amp;ccedil;ası g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. &amp;Ouml;ncelikli olarak Contains metodu ile Kategori kelimesi ge&amp;ccedil;en ProductCategory nesnelerinin bir listesinin elde edilemsi gerekmektedir. LINQ sorgusu buna g&amp;ouml;re d&amp;uuml;zenlenmiştir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var kategoriGecenler = from k in adwContext.ProductCategories
                                        where k.Name.Contains("Kategori")
                                            select k;

adwContext.ProductCategories.DeleteAllOnSubmit&amp;lt;ProductCategory&amp;gt;(kategoriGecenler);

adwContext.SubmitChanges();&lt;/pre&gt;
&lt;p&gt;S&amp;ouml;z konusu kod i&amp;ccedil;erisinde &lt;strong&gt;SubmitChanges&lt;/strong&gt; metodu &amp;ccedil;alıştırıldığında &lt;strong&gt;SQL&lt;/strong&gt; tarafında, silinmek istenen her satır i&amp;ccedil;in bir &lt;strong&gt;Delete&lt;/strong&gt; sorgu ifadesinin y&amp;uuml;r&amp;uuml;t&amp;uuml;ld&amp;uuml;ğ&amp;uuml; g&amp;ouml;r&amp;uuml;lecektir. &amp;Ouml;rnekte bu kategoriye uyan 5 satır bulunmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_12.gif" alt="" width="608" height="309" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim &lt;strong&gt;g&amp;uuml;ncelleme(Update) &lt;/strong&gt;işlemlerine. G&amp;uuml;ncelleme s&amp;uuml;re&amp;ccedil;lerinde, &lt;strong&gt;Insert&lt;/strong&gt; ve &lt;strong&gt;Delete&lt;/strong&gt; işlemlerindeki gibi metodlar s&amp;ouml;z konusu değildir. Nitekim g&amp;uuml;ncelleme işlemi aslında varlık nesnesinin herhangibir &amp;ouml;zelliğinin(&amp;ouml;zelliklerinin) değerinin değiştirilmesinden başka bir şey değildir. Dolayısıyla tek yapılması gereken değişiklikler tamamlandıktan sonra &lt;strong&gt;SubmitChanges&lt;/strong&gt; metodunu &amp;ccedil;ağırmaktır. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asında &amp;ouml;rnek olarak &lt;strong&gt;Product&lt;/strong&gt; tablosuna ait bir &lt;strong&gt;varlık sınıfı(Entity Class)&lt;/strong&gt; kullanılmaktadır. Bu sınıfı oluşturmak i&amp;ccedil;in tek yapılması gereken tahmin edileceği &amp;uuml;zere &lt;strong&gt;Server&lt;/strong&gt; &lt;strong&gt;Explorer&lt;/strong&gt;' dan &lt;strong&gt;Product&lt;/strong&gt; tablosunu &lt;strong&gt;Adventure.dbml &lt;/strong&gt;&amp;uuml;zerine tasarım zamanında s&amp;uuml;r&amp;uuml;kleyip bırakmaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var guncellenecekler = from p in adwContext.Products
                                    where p.ProductSubcategoryID == 1
                                        select p;

foreach (Product prd in guncellenecekler)
    prd.ListPrice += 10;

var bekleyenGuncellemeler = adwContext.GetChangeSet().Updates;

adwContext.SubmitChanges();&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında &lt;strong&gt;ProductSubCategoryId&lt;/strong&gt; değeri 1 olan nesneler elde edilmekte ve herbirinin &lt;strong&gt;ListPrice&lt;/strong&gt; değeri 10 birim arttırılmaktadır. &amp;Ccedil;ok doğal olarak yapılan bu g&amp;uuml;ncellemelerde &lt;strong&gt;Updates&lt;/strong&gt; kuyruğuna atılacaktır. S&amp;ouml;z gelimi &amp;ouml;rneğe g&amp;ouml;re varsayılan olarak kuyruğa 32 Product nesnesi atılmaktadır. Elbette koşula uyan kategorilerin her birinin ListPrice &amp;ouml;zelliklerinin değerleri değiştirildiğinde bu g&amp;uuml;ncellemeler &lt;strong&gt;Products&lt;/strong&gt; koleksiyonunada yansıyacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_13.gif" alt="" width="471" height="273" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;SubmitChanges&lt;/strong&gt; metodunun işletilmesi ile birlikte g&amp;uuml;ncelleme kuyruğunda bekleyen 32 adet &lt;strong&gt;Product&lt;/strong&gt; nesne &amp;ouml;rneği i&amp;ccedil;in veritabanında &lt;strong&gt;Update&lt;/strong&gt; sorguları &amp;ccedil;alıştırılacaktır. Aşağıdaki&lt;strong&gt; SQL Profiler&lt;/strong&gt; ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde bu sorguların bir kısmı yer almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_14.gif" alt="" width="519" height="433" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Buraya kadarki kısımda basit olarak&lt;strong&gt; ekleme(Insert), silme(Delete) ve g&amp;uuml;ncelleme(Update) &lt;/strong&gt;işlemlerini nasıl yapabileceğimizi g&amp;ouml;rmeye &amp;ccedil;alıştık. &amp;Ouml;nemli olan noktalardan biriside değişikliklerden vazge&amp;ccedil;ersek ne olacağıdır. Bu &amp;ouml;nemli bir sıkıntıdır. Nitekim &lt;strong&gt;GetChangeSet &lt;/strong&gt;metodu &amp;uuml;zerinden elde edilen &lt;strong&gt;ChangeSet&lt;/strong&gt; tipinin sunduğu &lt;strong&gt;Deletes&lt;/strong&gt;, &lt;strong&gt;Inserts&lt;/strong&gt;, &lt;strong&gt;Updates&lt;/strong&gt; &amp;ouml;zelliklerinin d&amp;ouml;nd&amp;uuml;rdğ&amp;uuml; &lt;strong&gt;IList&amp;lt;T&amp;gt;&lt;/strong&gt; koleksiyonları &amp;ccedil;alışma zamanında &lt;strong&gt;yanlız okunabilir(read-only) &lt;/strong&gt; şekilde ele alınabilmektedir. Bu nedenle &lt;strong&gt;Clear&lt;/strong&gt;, &lt;strong&gt;Remove&lt;/strong&gt;, &lt;strong&gt;RemoveAt&lt;/strong&gt; gibi metod &amp;ccedil;ağrıları hatta &lt;strong&gt;null&lt;/strong&gt; değer atanması sonrası &amp;ccedil;alışma zamanı istisnaları alınmaktadır. S&amp;ouml;z gelimi son &amp;ouml;rnek koddaki g&amp;uuml;ncelleştirmeleri onaylamak istemediğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu ama&amp;ccedil;la &lt;strong&gt;Clear&lt;/strong&gt; metoduna başvurulması d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Ancak bu durumda &amp;ccedil;alışma zamanında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan &lt;strong&gt;NotSupportedException&lt;/strong&gt; istisnası alınacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_15.gif" alt="" width="423" height="96" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu noktada &lt;strong&gt;Table&amp;lt;T&amp;gt;&lt;/strong&gt; tipi &amp;uuml;zerinden ulaşılabilen &lt;strong&gt;GetOriginalEntityState&lt;/strong&gt; metodu alternatif bir yol olarak ele alınabilir. Nitekim bu metod, parametre olarak verilen &lt;strong&gt;varlık nesnesinin(Entity Object) &lt;/strong&gt;değiştirilmeden &amp;ouml;nceki halini elde etmemizi sağlamaktadır. &amp;Ouml;rneğin aşağıdaki kod par&amp;ccedil;asını ele alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var bekleyenGuncellemeler = adwContext.GetChangeSet().Updates;

Product prdNew = (Product)bekleyenGuncellemeler[0];
Console.WriteLine(prdNew.ListPrice.ToString());

Product prdOriginal = adwContext.Products
                                 .GetOriginalEntityState((Product)bekleyenGuncellemeler[0]);
Console.WriteLine(prdOriginal.ListPrice.ToString());&lt;/pre&gt;
&lt;p&gt;Burada g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi prdNew nesne &amp;ouml;rneğinin ListPrice değeri 3419.99 iken prdOriginal' in değeri 3409.00 dur. Aşağıdaki &amp;ccedil;alışma zamanı g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde bu durum net bir şekilde g&amp;ouml;r&amp;uuml;lebilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_16.gif" alt="" width="462" height="298" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Ancak bu teknik yardımıyla g&amp;uuml;ncellenmiş olan t&amp;uuml;m satırların geri alınması olduk&amp;ccedil;a zordur. Nitekim&lt;strong&gt; Table&amp;lt;T&amp;gt; &lt;/strong&gt;tipinin &lt;strong&gt;yapıcı metodunun(Constructor)&lt;/strong&gt; kullanılamadığı, bu y&amp;uuml;zden &lt;strong&gt;new&lt;/strong&gt; ile &amp;uuml;retilemediği ortadadır. Ayrıca var olan &lt;strong&gt;DataContext&lt;/strong&gt; nesnesinin Table&amp;lt;T&amp;gt; tipinden &amp;ouml;zellikleri &lt;strong&gt;ReadOnly&lt;/strong&gt;' dir. Bir başka deyişle bu &amp;ouml;zelliklere doğrudan atama da yapılamamaktadır. Sonu&amp;ccedil; olarak &lt;strong&gt;DataContext&lt;/strong&gt; tipinin yeniden &amp;ouml;rneklenmesi sorunu &amp;ccedil;&amp;ouml;zmek i&amp;ccedil;in yeterli olacaktır.&lt;/p&gt;
&lt;table id="table182" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td valign="top" width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;&lt;strong&gt;Table&amp;lt;T&amp;gt;&lt;/strong&gt; generic tipi &amp;uuml;zerinden kullanılan &lt;strong&gt;GetModifiedMembers&lt;/strong&gt; metodu ile, parametre olarak verilen &lt;strong&gt;varlık(entity)&lt;/strong&gt; nesne &amp;ouml;rneğinin değişikliğe uğrayan değerlerinin &lt;strong&gt;orjinal(OriginalValue)&lt;/strong&gt; ve &lt;strong&gt; anlık(CurrentValue)&lt;/strong&gt; hallerinin elde edilmesi sağlanabilmektedir. GetModifiedMembers metodu geriye &lt;strong&gt;ModifiedMemberInfo&lt;/strong&gt; tipinden bir dizi d&amp;ouml;nd&amp;uuml;rmektedir. Aşağıdaki şekilde &amp;ouml;rnek olarak g&amp;uuml;ncellenen satırlardan ilki i&amp;ccedil;in orjinal ve g&amp;uuml;ncel &lt;strong&gt;ListPrice&lt;/strong&gt; değerlerinin elde edilişi g&amp;ouml;sterilmektedir.&lt;/em&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_17.gif" alt="" width="459" height="149" border="0" /&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Normal şartlarda &lt;strong&gt;SubmitChanges&lt;/strong&gt; metodunun &amp;ccedil;ağırılmasından sonra g&amp;uuml;ncelleme, ekleme ve silme işlemleri otomatik olarak transaction i&amp;ccedil;erisinde &amp;ccedil;alıştırılırlar. Bir başka deyişle SubmitChanges metodu, veritabanı &amp;uuml;zerinde yapılacak işlemlerin, biz s&amp;ouml;ylemeden otomatik olarak bir &lt;strong&gt;transaction&lt;/strong&gt; i&amp;ccedil;erisinde olmasını sağlamaktadır. S&amp;ouml;z gelimi aşağıdaki kod par&amp;ccedil;asını ele alalım. Bu kod par&amp;ccedil;asında g&amp;uuml;ncelleme(Update) ve yeni &amp;uuml;r&amp;uuml;n ekleme(Insert) işlemleri s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var guncellenecekler = from p in adwContext.Products
                            where p.Class == "M" &amp;amp;&amp;amp; p.ProductSubcategoryID==1
                                select p;

foreach (Product prd in guncellenecekler)
    prd.ListPrice += 10;

Product newProduct = new Product() 
    { 
        Name = "Yeni Urun"
        , ProductSubcategoryID = 1, Color = "Red"
        , Class = "M", ListPrice = 100
        , ProductNumber = "PRD-1204", ReorderPoint = 10
        , StandardCost = 90, ProductModelID = 123
        , SafetyStockLevel = 45,SellStartDate=new DateTime(2007,1,1)
        , SellEndDate=new DateTime(2008,1,1), DiscontinuedDate=new DateTime(2006,6,6)
        , ModifiedDate=DateTime.Now
    };

adwContext.Products.InsertOnSubmit(newProduct);

adwContext.SubmitChanges();&lt;/pre&gt;
&lt;p&gt;İlk olarak Class değeri M ve ProductSubCategoryID değeri 1 olan Product tiplerine ait bir koleksiyon &amp;ccedil;ekilmektedir. Daha sonra bu koleksiyon &amp;uuml;zerinde d&amp;ouml;n&amp;uuml;lerek ListPrice değerleri sembolik olarak 10' ar birim arttırılmaktadır. Hemen arkasıdan &amp;ouml;rnek bir Product nesnesi oluşturulmakta ve InsertOnSubmit metodu ile eklenecekler listesine aktarılmaktadır. Uygulama &amp;ccedil;alıştırıldığında&lt;strong&gt; SQL Profiler&lt;/strong&gt; aracılığıyla arkadaki işlemler incelenecek olursa aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;ların elde edildiği g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_18.gif" alt="" width="561" height="398" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edilecek olursa &lt;strong&gt;Insert&lt;/strong&gt; ve &lt;strong&gt;Update &lt;/strong&gt;ifadelerinin tamamı aynı &lt;strong&gt;Transaction&lt;/strong&gt; i&amp;ccedil;erisinde y&amp;uuml;r&amp;uuml;t&amp;uuml;lmektedir. Diğer taraftan aynı kodun aşağıdaki gibi değiştirildiğini d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var guncellenecekler = from p in adwContext.Products
                            where p.Class == "M" &amp;amp;&amp;amp; p.ProductSubcategoryID==1
                                select p;

foreach (Product prd in guncellenecekler)
    prd.ListPrice += 10;
adwContext.SubmitChanges();

Product newProduct = new Product() 
    { 
        Name = "Yeni Urun"
        , ProductSubcategoryID = 1, Color = "Red"
        , Class = "M", ListPrice = 100
        , ProductNumber = "PRD-1204", ReorderPoint = 10
        , StandardCost = 90, ProductModelID = 123
        , SafetyStockLevel = 45,SellStartDate=new DateTime(2007,1,1)
        , SellEndDate=new DateTime(2008,1,1), DiscontinuedDate=new DateTime(2006,6,6)
        , ModifiedDate=DateTime.Now
    };

adwContext.Products.InsertOnSubmit(newProduct);

adwContext.SubmitChanges();&lt;/pre&gt;
&lt;p&gt;Burada SubmitChanges metodu g&amp;uuml;ncelleme ve ekleme işlemlerinden sonra birer kez ayrı ayrı &amp;ccedil;ağırılmaktadır. Bu durumda &lt;strong&gt;SQL Profiler&lt;/strong&gt; aşağıdaki sonu&amp;ccedil;ları &amp;uuml;retecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk235_19.gif" alt="" width="502" height="522" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;SubmitChanges&lt;/strong&gt; her &amp;ccedil;ağırıldığında o ana kadar ger&amp;ccedil;ekleştirilen ne kadar ekleme, g&amp;uuml;ncelleme veya silme işlemi varsa ayrı bir &lt;strong&gt;Transaction&lt;/strong&gt; kapsamı i&amp;ccedil;erisinde &amp;ccedil;alışmaktadır. Elbetteki istenirse son kod par&amp;ccedil;asındaki t&amp;uuml;m sorgu işlemlerin aynı &lt;strong&gt;transaction kapsamı(Scope) &lt;/strong&gt;i&amp;ccedil;erisine dahil edilmeside sağlanabilir. Bunun i&amp;ccedil;in &lt;strong&gt;TransactionScope&lt;/strong&gt; nesnesinden yararlanılabilir. Aşağıdaki &amp;ouml;rnek bu durum basit olarak ele alınmaktadır.&lt;em&gt;(&lt;strong&gt;TransactionScope&lt;/strong&gt; sınıfının kullanılabilmesi i&amp;ccedil;in &lt;strong&gt;.Net Framework 2.0&lt;/strong&gt; ile birlikte gelen &lt;strong&gt;System.Transactions.dll assembly'ının&lt;/strong&gt; projeye referans edilmesi gerekmektedir.)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using (TransactionScope tScope = new TransactionScope())
{
    var guncellenecekler = from p in adwContext.Products
                                        where p.Class == "M" &amp;amp;&amp;amp; p.ProductSubcategoryID==1
                                            select p;

    foreach (Product prd in guncellenecekler)
        prd.ListPrice += 10;

    adwContext.SubmitChanges();

    Product newProduct = new Product() 
        { 
            Name = "Yeni Urun"
            , ProductSubcategoryID = 1, Color = "Red"
            , Class = "M", ListPrice = 100
            , ProductNumber = "PRD-1204", ReorderPoint = 10
            , StandardCost = 90, ProductModelID = 123
            , SafetyStockLevel = 45, SellStartDate=new DateTime(2007,1,1)
            , SellEndDate=new DateTime(2008,1,1), DiscontinuedDate=new DateTime(2006,6,6)
            , ModifiedDate=DateTime.Now
        };

    adwContext.Products.InsertOnSubmit(newProduct);
    adwContext.SubmitChanges();

    tScope.Complete();
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere t&amp;uuml;m kod par&amp;ccedil;ası TransactionScope nesne &amp;ouml;rneğine ait bir &lt;strong&gt;using&lt;/strong&gt; bloğu i&amp;ccedil;erisine alınmış ve en sonra Complete metodu &amp;ccedil;ağırılmıştır. Bu durumda &lt;strong&gt; SubmitChanges&lt;/strong&gt; &amp;ccedil;ağrıları ayrı ayrı yapılmış olsada t&amp;uuml;m işlemler aynı &lt;strong&gt;transaction kapsamına(Transaction Scope&lt;/strong&gt;) dahil edilecektir. &lt;strong&gt; TransactionScope&lt;/strong&gt; kullanılması &amp;ccedil;ok doğal olarak programatik taraftan &lt;strong&gt;Transaction&lt;/strong&gt; ile ilgili daha fazla y&amp;ouml;netsel işlemin yapılabilmesi anlamınada gelmektedir. S&amp;ouml;z gelimi izolasyon seviyeleri(Isolation Level) daha kontroll&amp;uuml; bir şekilde ele alınabilir. Hatta dağıtık transaction(Distributed Transaction) ge&amp;ccedil;işleri daha kolay programlanabilir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;TransactionScope&lt;/strong&gt; kullanımı dışında yerel transaction kullanılarakta ilgili işlemlerin aynı &lt;strong&gt; Transaction&lt;/strong&gt; i&amp;ccedil;erisinde ger&amp;ccedil;ekeştirilmesi sağlanabilir. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asında bu durum ele alınmaya &amp;ccedil;alışılmaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;try
{
    var guncellenecekler = from p in adwContext.Products
                                        where p.Class == "M" &amp;amp;&amp;amp; p.ProductSubcategoryID == 1
                                            select p;

    foreach (Product prd in guncellenecekler)
        prd.ListPrice += 10;

    // Transaction başlatılması i&amp;ccedil;in bağlantının a&amp;ccedil;ık olması gerekir.
    adwContext.Connection.Open();

    // Transaction başlatılır ve AdventureContext tipine bildirilir.
    adwContext.Transaction = adwContext.Connection.BeginTransaction();

    adwContext.SubmitChanges();

    Product newProduct = new Product() 
        { 
            Name = "Yeni Urun"
            , ProductSubcategoryID = 1, Color = "Red"
            , Class = "M", ListPrice = 100
            , ProductNumber = "PRD-1204", ReorderPoint = 10
            , StandardCost = 90, ProductModelID = 123
            , SafetyStockLevel = 45, SellStartDate=new DateTime(2007,1,1)
            , SellEndDate=new DateTime(2008,1,1), DiscontinuedDate=new DateTime(2006,6,6)
            , ModifiedDate=DateTime.Now
        };

    adwContext.Products.InsertOnSubmit(newProduct);

    adwContext.SubmitChanges();

    // Herşey yolunda ise Transaction onaylanır
    adwContext.Transaction.Commit();
}
catch
{
    // Bir aksilik olduysa Transaction geri alınır
    adwContext.Transaction.Rollback();
}
finally
{
    if (adwContext.Connection.State == ConnectionState.Open)
        adwContext.Connection.Close();
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;DataContext&lt;/strong&gt; tipinin &lt;strong&gt;Transaction&lt;/strong&gt; &amp;ouml;zelliğine değer atanırken &lt;strong&gt;Connection&lt;/strong&gt; &amp;uuml;zerinden gidilmiş ve &lt;strong&gt;BeginTransaction&lt;/strong&gt; metodu kullanılmıştır. BeginTransaction metodunun parametresinden yararlanılarak, Transaction' ın &lt;strong&gt;izolasyon seviyeside(Isolation Level) &lt;/strong&gt;değiştirilebilir. Burada &lt;strong&gt;Transaction&lt;/strong&gt;' ın oluşturulabilmesi i&amp;ccedil;in bağlantının(Connection) a&amp;ccedil;ık olması gerekmektedir. Bu sebeptende &lt;strong&gt;finally&lt;/strong&gt; bloğu i&amp;ccedil;erisinde a&amp;ccedil;ık kalan bağlantının kontroll&amp;uuml; bir şekilde kapatılması sağlanmaktadır. Transaction' a dahil olan işlemlerin onaylanması i&amp;ccedil;in &lt;strong&gt;Commit&lt;/strong&gt; metodu kullanılırken bir sorun ile karşılaşılması halinde o ana kadar yapılan işlemlerin geri alınması i&amp;ccedil;inde &lt;strong&gt;Rollback&lt;/strong&gt; metoduna başvurulmaktadır. Sonu&amp;ccedil; olarak &lt;strong&gt;SQL Profiler&lt;/strong&gt; aracı izlendiğinde &lt;strong&gt; ekleme(insert)&lt;/strong&gt; ve &lt;strong&gt;g&amp;uuml;ncelleme(update)&lt;/strong&gt; işlemlerinin yine tek bir &lt;strong&gt;Transaction&lt;/strong&gt; kapsamı i&amp;ccedil;erisinde ele alındığı g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;LINQ To SQL&lt;/strong&gt; mimarisin şu ana kadar işlenen temel &lt;strong&gt;CRUD&lt;/strong&gt; işlemlerinde ele alınması gereken başka hususlarda vardır. S&amp;ouml;z gelimi eş zamanlı &amp;ccedil;alışan programların aynı veriler &amp;uuml;zerinde işlemler yaptığı durumlarda oluşan &lt;strong&gt; &amp;ccedil;akışmaların(Conflict)&lt;/strong&gt; ele alınması gibi. Bu ve benzeri konuları ilerleyen makalelerimizde ve g&amp;ouml;rsel derslerimizde incelemeye &amp;ccedil;alışıyor olacağız. Bu makalemizde &amp;ccedil;ok basit ve temel seviyede &lt;strong&gt;ekleme(Insert), Silme(Delete) ve G&amp;uuml;ncelleme(Update)&lt;/strong&gt; işlemlerini nasıl yapabileceğimizi incelemeye &amp;ccedil;alıştık. Ayrıca bu işlemleri yaparken &lt;strong&gt; Transaction&lt;/strong&gt;' ların nasıl kullanılabildiğinide g&amp;ouml;rd&amp;uuml;k. Varsayılan olarak bilin&amp;ccedil;siz şekilde başlatılan Transaction' ları TransactionScope ile veya Local Transaction teknikleri nasıl kontrol edebileceğimiz g&amp;ouml;rd&amp;uuml;k. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/LinqToSqlCRUD.rar"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2007-12-15 08:00:00</pubDate>
  <slug>LINQ-to-SQL-ile-CRUD-Islemleri-bsenyurt-com-dan</slug>
  <tags>
    <tag>linq-to-sql</tag>
    <tag>linq</tag>
    <tag>crud</tag>
  </tags>
  <categories>
    <category>LINQ to SQL</category>
  </categories>
</post>