<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Angular ile Yazılmış Bir Web Uygulamasını PWA Uyumlu Hale Getirmek</title>
  <description>PWA(Progressive Web App) tipindeki uygulamalar özellikle mobil cihazlarda kullanılırken sanki AppStore veya PlayStore'dan indirilmiş native uygulamalarmış gibi görünürler. Ancak native uygulamalar gibi dükkandan indirilmezler ve bir web sunucusundan talep edilirler. Https desteği sunduklarından hat güvenlidir. Bağlı olan istemcilere push notification ile bildirimde bulunabilirler. Cihaz bağımsız olarak her tür form-factor'ü desteklerler. Bu uygulama modelinde Service Worker'lar iş başındadır ve sürekli taze kalınmasını sağlarlar. Düşük internet bağlantılarında veya internet olmayan ortamlarda çevrim dışı da çalışabilirler. URL üzerinden erişilen uygulamalar olduklarından kurulum ihtiyaçları yoktur.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2019/06/28/LesEclaireurs.png" alt="" /&gt;Geminin neredeyse t&amp;uuml;m seyr&amp;uuml;sefer&amp;nbsp;sistemi ve radarı arka arkaya gelen alarm sinyalleri sonrası bozulmuştu.&amp;nbsp;G&amp;uuml;ney pasifiği terk etmek &amp;uuml;zere olan koca tekne en son Arjantin kıyılarına yakın seyrediyordu.&amp;nbsp;Gecenin zifiri karanlığında ilerlerken&amp;nbsp;kaptanın en b&amp;uuml;y&amp;uuml;k yol bulma &amp;uuml;mitlerinden olan kuzey yıldızı bulutlarla kaplı g&amp;ouml;ky&amp;uuml;z&amp;uuml;nden saatlerdir g&amp;ouml;r&amp;uuml;lm&amp;uuml;yordu.&lt;/p&gt;
&lt;p&gt;Altı kişilik g&amp;uuml;verte m&amp;uuml;rettabı normal şartlarda geminin seyri i&amp;ccedil;in fazlasıyla yeterliydi. Yaklaşık yirmibin groston ağırlığındaki gemi son teknloji cihazlarla donatıldığı i&amp;ccedil;in az sayıda personel ile kıtalar arası seyahat edebiliyordu.&lt;/p&gt;
&lt;p&gt;Ama şimdi kaptan ve yardımcısı dışındaki m&amp;uuml;rettebat geminin &amp;ccedil;eşitli noktalarına yayılmış, d&amp;uuml;rb&amp;uuml;nleriyle bir şeyler arıyordu. Korkutucu olan, y&amp;ouml;n&amp;uuml; belirleyemezlerse kendilerini Antartika g&amp;uuml;zergahında bulabilecek olmalarıydı. Koca okyanusta bu derecede bir rota sapması işlerin daha da korkun&amp;ccedil; bir hal almasına neden olabilirdi.&lt;/p&gt;
&lt;p&gt;Derken kı&amp;ccedil; tarafa giden denizcinin sesi duyuldu telsizden. G&amp;uuml;verte umuttan daha da fazla bir hisle dolmuştu anında. Gemi, g&amp;uuml;&amp;ccedil;l&amp;uuml; bir manevra ile geri d&amp;ouml;n&amp;uuml;p ufukta belirmiş ve aralıklarla yanıp s&amp;ouml;nen ışığa doğru y&amp;ouml;neldi. Kaptan m&amp;uuml;rettabatı tekrar g&amp;uuml;verteye davet ederken yardımcısına ş&amp;ouml;yle seslendi "Tanrıya ş&amp;uuml;k&amp;uuml;r Eric. Sonunda Les Eclaireurs y&amp;uuml;z&amp;uuml;n&amp;uuml; g&amp;ouml;sterdi"&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Les Eclaireurs...1920 yılında inşa edilen bu deniz feneri, Arjantinin en g&amp;uuml;ney şehri olarak bilinen Ushuaia'nın yaklaşık 9.3 km doğusundadır. "D&amp;uuml;nyanın Ucundaki Fener" olarak da bilinir. Turistlerin pop&amp;uuml;ler uğrak noktası olan ve k&amp;uuml;&amp;ccedil;&amp;uuml;k bir ada &amp;uuml;zerinde duran fener tarih boyunca bir &amp;ccedil;ok denizci i&amp;ccedil;in yol g&amp;ouml;sterici olmuştur. Deniz feneri kelimesinin İngilizce karşılığı Lighthouse'dur ve bu kelime &lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;bir cumartesi gecesi &amp;ccedil;alışması&lt;/a&gt;nda bana yol g&amp;ouml;stericilik yapmıştır. &amp;Ouml;yleyse gelin derlememize başlayalım&amp;nbsp;&lt;em&gt;(Biraz eski bir araştırma olsa da &lt;a href="https://10mosttoday.com/10-most-famous-lighthouses-in-the-world/" target="_blank"&gt;d&amp;uuml;nyanın 10 &amp;uuml;nl&amp;uuml; feneri i&amp;ccedil;in şu yazıya&lt;/a&gt; bakabilirsiniz. Ben &amp;ouml;zellikle İsko&amp;ccedil;ya'daki Bell Rock deniz fenerinden &amp;ccedil;ok etkilendim)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;PWA&lt;em&gt;(Progressive Web App)&lt;/em&gt; tipindeki uygulamalar &amp;ouml;zellikle mobil cihazlarda kullanılırken sanki AppStore veya PlayStore'dan indirilmiş native uygulamalarmış gibi g&amp;ouml;r&amp;uuml;n&amp;uuml;rler. Ancak native uygulamalar gibi d&amp;uuml;kkandan indirilmezler ve bir web sunucusundan talep edilirler. Https desteği sunduklarından hat g&amp;uuml;venlidir. Bağlı olan istemcilere push notification ile bildirimde bulunabilirler. Cihaz bağımsız olarak her t&amp;uuml;r form-factor'&amp;uuml; desteklerler. Bu uygulama modelinde Service Worker'lar iş başındadır ve s&amp;uuml;rekli taze kalınmasını sağlarlar. D&amp;uuml;ş&amp;uuml;k internet bağlantılarında veya internet olmayan ortamlarda &amp;ccedil;evrim dışı da &amp;ccedil;alışabilirler. URL &amp;uuml;zerinden erişilen uygulamalar olduklarından kurulum ihtiya&amp;ccedil;ları yoktur.&lt;/p&gt;
&lt;p&gt;Benim bu cumartesi gecesi &amp;ccedil;alışmasındaki amacım ise gayet basitti. Biraz yabancısı olduğum Angular ile basit bir web uygulaması yazmak ve bunu PWA uyumlu hale getirmek.&lt;/p&gt;
&lt;p&gt;Peki bir web sayfasından gelen i&amp;ccedil;eriğin PWA uyumluluğunu nasıl test edebiliriz? Bunun i&amp;ccedil;in Google'ın geliştirdiği ve Chrome &amp;uuml;zerinde bulunan Lighthouse isimli uygulamadan yararlanabiliriz&lt;em&gt;(Ta taaaa...Hikayeyi bağladım işte)&lt;/em&gt;&amp;nbsp;F12 ile a&amp;ccedil;ılan Developer Tools'tan kolayca erişilebilen Lighthouse ile o anki sayfa i&amp;ccedil;in uyumluluk testleri yapabiliriz. &amp;Ouml;rneğin kendi blogum i&amp;ccedil;in bunu yaptığımda mobile cihazlardaki PWA uyumluluğunun %50 olarak &amp;ccedil;ıktığını g&amp;ouml;rd&amp;uuml;m :/ Yarı yarıya uyumsuz. Bu nedir arkadaş ya?&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/06/28/credit_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bakalım boş bir uygulama i&amp;ccedil;in bu durumu değiştirebilecek miyiz?&lt;/p&gt;
&lt;h2&gt;&amp;Ouml;n Hazırlıklar&lt;/h2&gt;
&lt;p&gt;Angular ile ilgili işlemler i&amp;ccedil;in command-line interface&lt;em&gt;(CLI)&lt;/em&gt; aracından yararlanabiliriz. Yoksa aşağıdaki ilk komutla kurmak lazım tabii.&amp;nbsp;Angular CLI komut satırı bir &amp;ccedil;ok konuda yardımcı olacaktır. Projenin oluşturulması, angular i&amp;ccedil;in yazılmış paketlerin kolayca eklenmesi vb...İkinci komutla projemizi hazır şablonla oluşturuyoruz. UI tarafında Material Design kullanmayı &amp;ouml;ğrenmeye &amp;ccedil;alışacağım. Bu nedenle proje klas&amp;ouml;r&amp;uuml;ne girdikten sonra &lt;strong&gt;ng add&lt;/strong&gt; komutu ile material'ın angular s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; de projeye ilave etmemiz lazım&amp;nbsp;&lt;em&gt;(Prebuilt tema se&amp;ccedil;imini Indigo/Pink olarak bıraktım)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo npm install -g @angular/cli
ng new quotesify
cd quotesify
ng add @angular/material&lt;/pre&gt;
&lt;h2&gt;Kod Tarafı&lt;/h2&gt;
&lt;p&gt;Kodları m&amp;uuml;mk&amp;uuml;n mertebe a&amp;ccedil;ıklamalarla&amp;nbsp;desteklemeye &amp;ccedil;alıştım ancak genel hatları ile &amp;ouml;ny&amp;uuml;z bileşenini değiştirdiğimiz, farklı bir adresle haberleşecek bir servis yazdığımızı ifade edebiliriz. İşe ilk olarak app.module.ts dosyasından başlayalım. app.module.ts dosyasında HTTP &amp;ccedil;ağrılarını yapmamızı sağlayan HttpClientModule mod&amp;uuml;l&amp;uuml;n&amp;uuml; tanımlıyoruz. B&amp;ouml;ylece HttpClient, ana mod&amp;uuml;le bağlı t&amp;uuml;m bileşen ve servislere enjekte edilebilir&lt;em&gt;(Evet burada da Dependency Injection var. O her yerde :P ) &lt;/em&gt;Ayrıca&amp;nbsp;UI tarafı kontrolleri i&amp;ccedil;in ilgili Material mod&amp;uuml;llerini de eklememiz lazım. &amp;Ouml;rnekte Toolbar, Card ve Button kontrollerine ait mod&amp;uuml;lleri ele almaktayız. Kodda ge&amp;ccedil;en diğer mod&amp;uuml;ller zaten şablon ile birlikte gelmiş olanlar.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;import { BrowserModule } from '@angular/platform-browser';
import { NgModule } from '@angular/core';

import { AppComponent } from './app.component';
import { NoopAnimationsModule } from '@angular/platform-browser/animations';

/*
UI tasarımında kullanacağımız Material bileşenlerine ait mod&amp;uuml;l bildirimleri
*/
import { MatToolbarModule } from '@angular/material/toolbar';
import { MatCardModule } from '@angular/material/card';
import { MatButtonModule } from '@angular/material/button';

/* 
 HttpClientModule'&amp;uuml; burada import ettik.
 B&amp;ouml;ylece HTTP &amp;ccedil;ağrıları yapabilmemizi sağlayan
 HttpClient nesnesini ana mod&amp;uuml;le bağlı olan 
 t&amp;uuml;m componenetlere enjekte edebiliriz.

 HttpClient'ı aray&amp;uuml;ze veri d&amp;ouml;nd&amp;uuml;ren dummy bir API
 servisine Get &amp;ccedil;ağrısı yapmak i&amp;ccedil;in kullanacağız.
 */
import { HttpClientModule } from '@angular/common/http';
import { ServiceWorkerModule } from '@angular/service-worker';
import { environment } from '../environments/environment';

@NgModule({
  declarations: [
    AppComponent
  ],
  imports: [
    BrowserModule,
    NoopAnimationsModule,
    HttpClientModule, //Buraya da eklemeyi unutmamak lazım
    // Aşağıdakilerde Material mod&amp;uuml;lleri i&amp;ccedil;in yapılan ilaveler
    MatToolbarModule,
    MatCardModule,
    MatButtonModule,
    // PWA g&amp;uuml;ncellemesi sonrası eklenen Worker Service kaydının yapılması
    ServiceWorkerModule.register('ngsw-worker.js', { enabled: environment.production })],
  providers: [],
  bootstrap: [AppComponent]
})
export class AppModule { }&lt;/pre&gt;
&lt;p&gt;Bu adımdan sonra &lt;strong&gt;ng g service dummy&lt;/strong&gt; terminal komutunu kullanarak DummyService isimli bir servis sınıfı ekliyoruz.&amp;nbsp;&lt;a href="https://jsonplaceholder.typicode.com/posts" target="_blank"&gt;Şuradaki dummy servis&lt;/a&gt; adresinden veri &amp;ccedil;ekip sunmakla g&amp;ouml;revli bir mod&amp;uuml;l esas itibariyle. Sunmak derken uygulama aray&amp;uuml;z&amp;uuml;ndeki bileşenleri besleyecek diyebiliriz.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;/*
Servisin g&amp;ouml;revi https://jsonplaceholder.typicode.com/posts adresinden
dummy veri &amp;ccedil;ekmek ve bunu bir Observable nesne olarak sunmak.
*/
import { Injectable } from '@angular/core';
import { HttpClient } from '@angular/common/http'; // HttpClient nesnesini i&amp;ccedil;eriye constructor &amp;uuml;zerinden enjekte edeceğiz
import { Observable } from 'rxjs'; //RxJS k&amp;uuml;t&amp;uuml;phanesinden Observable tipini kullanıyoruz

/*
JSON servisinden d&amp;ouml;nen &amp;ouml;ğeleri ifade eden aray&amp;uuml;z tanımı.
Post tipini temsilen bazı alanlar i&amp;ccedil;eriyor.
*/
export interface Post {
  userId: number;
  id: number;
  title: string;
  body: string;
}

@Injectable({
  providedIn: 'root'
})

/*
DummyService'i &amp;uuml;retmek i&amp;ccedil;in komut satırından 
ng g service dummy
komutunu kullandık
*/
export class DummyService {

  // Constructor bazlı dependency injection
  constructor(private httpClient: HttpClient) { }

  /* 
    get metodu Observable tipte bir koleksiyon d&amp;ouml;nd&amp;uuml;r&amp;uuml;r 
  */
  get(): Observable&amp;lt;Post[]&amp;gt; {
    var url = "https://jsonplaceholder.typicode.com/posts";
    /*
      url ile belirtilen adrese get talebi g&amp;ouml;nderiyor
      ve i&amp;ccedil;eriğini Post dizisi olarak alıp
      Observable nesnesiyle geriye d&amp;ouml;n&amp;uuml;yoruz
    */
    return &amp;lt;Observable&amp;lt;Post[]&amp;gt;&amp;gt;this.httpClient.get(url);
  }
}&lt;/pre&gt;
&lt;p&gt;Oluşturulan servisi app.component.ts dosyasında kullanabilmek i&amp;ccedil;inse bir takım eklemeler yapmalıyız.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;import { Component, OnInit } from '@angular/core';
import {DummyService} from './dummy.service'; // yeni eklediğimiz servisi kullanacağımızı belirtiyoruz
import {Post} from './dummy.service'; //ki Post aray&amp;uuml;z tipinide oradan export etmiştik

@Component({
  selector: 'app-root',
  templateUrl: './app.component.html',
  styleUrls: ['./app.component.css']
})

// AppComponent, OnInit metodunu uygulamalı
export class AppComponent implements OnInit {
  title = 'Dummy Posts';
  posts: Array&amp;lt;Post&amp;gt;; // &amp;ccedil;ekilen Post verilerini saklamak i&amp;ccedil;in kullanacağımız dizi

  constructor(private dummyService:DummyService){

  }

  /*
  OnInit, Angular bileşeninin yaşam d&amp;ouml;ng&amp;uuml;s&amp;uuml;nde &amp;ccedil;alışan metodlardan birisi.
  Component oluşturulurken devreye girip ilgili servisten veriyi &amp;ccedil;eken bir 
  işlevi y&amp;uuml;r&amp;uuml;tecek şekilde programlandı.

  OnInit AppComponent bileşeni oluşurken bir seferliğine &amp;ccedil;ağrılır.
  */
  ngOnInit(){
    /*
    Constructor'dan enjekte edilen DummyService &amp;ouml;rneğini kullanarak
    get metoduna başvuruyor ve Post dizisini &amp;ccedil;ekiyoruz.

    DummyService servisindeki get metodu Observable bir nesne d&amp;ouml;nd&amp;uuml;r&amp;uuml;yor.
    Burada ona abone(subscribe) oluyoruz. Asenkron &amp;ccedil;alışma durumu s&amp;ouml;z konusu
    olduğunda servis ilgili veriyi &amp;ccedil;ektiğinde kendisine abone olanları da bilgilendirecektir.
    Yani &amp;ccedil;ekilen Post dizisindeki değişim(bu senaryoda servisten alınması) component'e
    bildirilmiş olacaktır. 
    
    */
    this.dummyService.get().subscribe((data:Array&amp;lt;Post&amp;gt;)=&amp;gt;{
      this.posts=data;
    },(err)=&amp;gt;{
      console.log(err);
    });
  }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ny&amp;uuml;z bileşeni olarak src/app/app.component.html i&amp;ccedil;eriği de tamamen değiştirildi. Material bileşenlerine yer verildi.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;mat-toolbar&amp;gt;
  &amp;lt;mat-toolbar-row&amp;gt;
    &amp;lt;span&amp;gt;Some dummy posts from universe&amp;lt;/span&amp;gt;
  &amp;lt;/mat-toolbar-row&amp;gt;
&amp;lt;/mat-toolbar&amp;gt;
&amp;lt;main&amp;gt;
  &amp;lt;mat-card *ngFor="let post of posts"&amp;gt;
    &amp;lt;mat-card-header&amp;gt;
      &amp;lt;mat-card-title&amp;gt;{{post.title}}&amp;lt;/mat-card-title&amp;gt;
    &amp;lt;/mat-card-header&amp;gt;
    &amp;lt;mat-card-content&amp;gt;
      {{post.body}}
    &amp;lt;/mat-card-content&amp;gt;
  &amp;lt;/mat-card&amp;gt;
&amp;lt;/main&amp;gt;&lt;/pre&gt;
&lt;p&gt;Toolbar tipinde bir Navigation kontrol&amp;uuml;, Post bilgilerini g&amp;ouml;stermek i&amp;ccedil;inse Card kontrol&amp;uuml;nden yararlanıyoruz. UI, bağlı olduğu AppComponent i&amp;ccedil;erisindeki posts dizisini kullanıyor. T&amp;uuml;m dizi elemanlarında gezmek i&amp;ccedil;inse *ngFor komutundan yararlanılmakta. Bir &amp;ouml;zellik değerini aray&amp;uuml;zde g&amp;ouml;stermek istediğimizde {{post.title}} benzeri notasyonlar kullandığımız da g&amp;ouml;zden ka&amp;ccedil;mamalı.&lt;/p&gt;
&lt;h2&gt;PWA Uyumluluğu i&amp;ccedil;in Hazırlıklar&lt;/h2&gt;
&lt;p&gt;Amacımız uygulamanın PWA uygunluğunu kontrol etmek olduğu i&amp;ccedil;in &amp;ouml;ncelikle onu canlı ortam i&amp;ccedil;in hazırlamalıyız&lt;em&gt;(Yani Production Build işlemini yapmamız gerekiyor)&lt;/em&gt; Nitekim PWA &amp;ouml;zelliklerinin bir &amp;ccedil;oğu geliştirme ortamına dahil edilmemekte. Build işlemi i&amp;ccedil;in ng CLI aracını aşağıdaki gibi kullanabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;ng build --prod&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/06/28/credit_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulama dist klas&amp;ouml;r&amp;uuml;ne build edilmiş olur. Hizmete sunmak i&amp;ccedil;in http-server gibi bir ara&amp;ccedil;tan yararlanılabilir. Eğer sistemde y&amp;uuml;kl&amp;uuml; değilse npm ile kurmamız gerekir. İlk komutla bunu yapıyoruz. İkinci terminal komutuysa uygulamayı localhost &amp;uuml;zerinden ayağa kaldırmakta.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo npm install -g http-server
cd dist
cd quotesify
http-server -o&lt;/pre&gt;
&lt;p&gt;Bunun sonucu olarak 127.0.0.1:8080 veya 8081 portundan yayın yapılır ve uygulama a&amp;ccedil;ılır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/06/28/credit_3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulama &amp;ccedil;alıştıktan sonra F12 ile Audits kısmına gidip 'Run Audit' ile PWA testi başlatılırsa, Lighthouse bize aşağıdakine benzer sonu&amp;ccedil;lar verecektir&lt;em&gt;(Tabii sizin denediğiniz vakitlerde bu kurallar değişmiş olabilir. O nedenle bilgileri g&amp;uuml;ncellemekte yarar var)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/06/28/credit_4.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;PWA uyumluluğu olduk&amp;ccedil;a d&amp;uuml;ş&amp;uuml;k ki bu zaten şu aşamada beklediğimiz bir şey. PWA uyumlu hale getirmek i&amp;ccedil;in neler yapılabilir bakalım.&lt;/p&gt;
&lt;h2&gt;İhlal Edilen PWA Kriterleri&lt;/h2&gt;
&lt;p&gt;&amp;Ouml;nce hangi kuralların ihlal edildiğinde ve bunların ne anlama geldiğine bir bakalım.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Uygulamanın HTTPS desteği olmazsa olmazlardandır. Development tarafında sıkıntı olmasa da uygulamayı &amp;uuml;retim ortamlarına aldığımızda sertifika tabanlı iletişim sağlanmalıdır.&lt;/li&gt;
&lt;li&gt;Service Worker olmaması sebebiyle offline &amp;ccedil;alışma ve cache kabiliyetlerinin yanı sıra push notification kabiliyletleri de ortada yoktur. Service Worker, ağ proxy'si gibi bir g&amp;ouml;rev &amp;uuml;stlenir ve uygulamanın &amp;ccedil;ektiği&amp;nbsp;&amp;ouml;ğeler&lt;em&gt;(asset)&lt;/em&gt; ile veriyi&amp;nbsp;taleplerden&lt;em&gt;(requests)&lt;/em&gt; yakalayıp &amp;ouml;nbelleğe alma operasyonlarında işe yarar.&lt;/li&gt;
&lt;li&gt;Manifesto dosyasının bulunmayışı ki bu dosyada uygulama adı, kısa a&amp;ccedil;ıklaması, icon'lar ve diğer gerekli bilgiler yer alır. Ayrıca manifesto dosyası sayesinde add-to-home-screen ve splash screen &amp;ouml;zellikleri de etkinleşir.&lt;/li&gt;
&lt;li&gt;Progressive Enhancment desteğinin olmaması da bir PWA ihlalidir. Uygulamanın &amp;ccedil;ağırıldığı tarayıcıya g&amp;ouml;re ileri seviye &amp;ouml;zelliklerin kullanılabileceğinin ifade edilmesi beklenmektedir.&lt;/li&gt;
&lt;/ul&gt;
&lt;h2&gt;PWA Uyumluluğu i&amp;ccedil;in Yapılanlar&lt;/h2&gt;
&lt;p&gt;Angular tarafında uygulamayı PWA uyumlu hale getirmek i&amp;ccedil;in aşağıdaki terminal komutunu &amp;ccedil;alıştırmak yeterlidir. &lt;em&gt;(Proje klas&amp;ouml;r&amp;uuml;nde &amp;ccedil;alıştırdığımıza dikkat edelim)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;ng add @angular/pwa&lt;/pre&gt;
&lt;p&gt;Komut &amp;ccedil;alıştırıldığında eksik olan manifesto ve service worker dosyaları eklenir. Ayrıca assets altındaki icon'ların form factor desteği a&amp;ccedil;ısından farklı boyutları oluşur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/06/28/credit_5.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Yeni bir dağıtım paketi &amp;ccedil;ıktığımızda PWA i&amp;ccedil;in eklenen Service Worker ve manifesto dosyalarını da g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/06/28/credit_6.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tekrardan Lighthouse raporunu &amp;ccedil;ektiğimizde aşağıdaki gibi %92lik bir karşılama oranı oluştuğunu g&amp;ouml;rebiliriz. Fena değil ama eksik. &amp;Ccedil;&amp;uuml;nk&amp;uuml; HTTPS desteğini g&amp;ouml;remedi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/06/28/credit_7.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Peki ya kalan HTTPS ihlalini development ortamında nasıl aşabiliriz? Aşabilir miyiz? Eğer buraya kadar gelebildiyseniz bir adım daha ilerleyebilirsiniz sevgili okur ;)&lt;/p&gt;
&lt;h2&gt;Ben Neler &amp;Ouml;ğrendim?&lt;/h2&gt;
&lt;p&gt;&lt;a href="https://github.com/buraksenyurt/saturday-night-works/tree/master/No%2028%20-%20PWA%20with%20Angular" target="_blank"&gt;Yirmisekiz numaralı bu cumartesi gecesi &amp;ccedil;alışması&lt;/a&gt;nın da bana kattığı değerli bilgiler oldu elbette. Bunları kabaca aşağıdaki gibi sıralayabilirim.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Angular CLI'ın&lt;em&gt;(command-line interface)&lt;/em&gt; temel komutlarını&lt;/li&gt;
&lt;li&gt;Component'lere servislerin nasıl enjekte edilebileceğini&lt;/li&gt;
&lt;li&gt;&amp;Ccedil;ok basit anlamda Material bileşenlerini aray&amp;uuml;zde nasıl kullanabileceğimi&lt;/li&gt;
&lt;li&gt;PWA tipindeki uygulamaların genel karakteristiklerini ve avantajlarını&lt;/li&gt;
&lt;li&gt;PWA ihlallerinin kısaca ne anlama geldiklerini ve tespitinde Lighthouse'un nasıl kullanılabileceğini&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir maceramızın daha sonuna. Bu yazıda basit bir Angular uygulaması geliştirip bunu Progressive Web App modelinde yayınlanabilecek kıvama getirmeye &amp;ccedil;alıştık. Umarım sizler i&amp;ccedil;in de faydalı bir &amp;ccedil;alışma olmuştur. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2019-06-28 07:00:00</pubDate>
  <slug>angular-ile-yazilmis-bir-web-uygulamasini-pwa-uyumlu-hale-getirmek</slug>
  <tags>
    <tag>angular</tag>
    <tag>angular-cli</tag>
    <tag>material-design</tag>
    <tag>typescript</tag>
    <tag>javascript</tag>
    <tag>pwa</tag>
    <tag>progressive-web-app</tag>
    <tag>google-chrome</tag>
    <tag>service-worker</tag>
    <tag>form-factor</tag>
    <tag>command-line-interface</tag>
    <tag>cli</tag>
    <tag>lighthouse</tag>
    <tag>chrome-developer-tools</tag>
  </tags>
  <categories>
    <category>Angular</category>
  </categories>
</post>