<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Task Parallel Library(TPL) - İptal İşlemi [Beta 2]</title>
  <description>Uzun süredir .Net Framework 4.0' ın bir parçası olarak gelen paralel programlama alt yapısı ile uğraşmıyordum. En son Beta 1 sürümündeyken Task Parallel Library ve PLINQ ile ilişkili konulara bakma fırsatım olmuştu. Zaman ilerledi ve .Net Framework 4.0 Beta 2 sürümü yayınlandı.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Uzun s&amp;uuml;redir &lt;strong&gt;.Net Framework 4.0'&lt;/strong&gt; ın bir par&amp;ccedil;ası olarak gelen paralel programlama alt yapısı ile uğraşmıyordum. En son &lt;strong&gt;Beta 1&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;ndeyken&lt;strong&gt; Task Parallel Library&lt;/strong&gt; ve &lt;strong&gt;PLINQ &lt;/strong&gt;ile ilişkili konulara bakma fırsatım olmuştu. Zaman ilerledi ve&lt;strong&gt; .Net Framework 4.0 Beta 2&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml; yayınlandı. Bu s&amp;uuml;r&amp;uuml;mde &lt;strong&gt;Beta 1' &lt;/strong&gt;e g&amp;ouml;re bazı farklılıklar bulunmakta. Yani farklılıkları yeniden &amp;ouml;ğrenme aşamasına gelmiş durumdayız.&amp;nbsp;Bunu &lt;strong&gt;WF&lt;/strong&gt; tarafında, &lt;strong&gt;WCF&lt;/strong&gt; tarafında g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z gibi halen gelişmekte olan Paralel programlama alt yapısında da g&amp;ouml;rmekteyiz. İşte bu g&amp;uuml;nk&amp;uuml; yazımızda herhangibir &lt;strong&gt;Task'&lt;/strong&gt; in iptal s&amp;uuml;recinin &lt;strong&gt;Beta 2&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nde nasıl değerlendirildiğini incelemeye &amp;ccedil;alışıyoruz olacağız. &lt;strong&gt;Beta 1&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nde bir &lt;strong&gt;Task'&lt;/strong&gt; in iptal edilmesi i&amp;ccedil;in aşağıdaki kod tasarımı kullanılmaktaydı.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Task parallelTask= Task.Factory.StartNew(() =&amp;gt;
{
 for (; ; )
 {
  if (Task.Current.IsCancellationRequested)
  {
   Task.Current.AcknowledgeCancellation();
   return;
  }
  //TODO: Gerekli işlemler
 }
});&lt;/pre&gt;
&lt;p&gt;ve kodun herhangibir yerinde &lt;strong&gt;Task'&lt;/strong&gt; in iptal edilmesi i&amp;ccedil;in ilgili &lt;strong&gt;Task&lt;/strong&gt; nesne &amp;ouml;rneği &amp;uuml;zerinden &lt;strong&gt;Cancel&lt;/strong&gt; metodu &amp;ccedil;ağırılmaktaydı.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;parallelTask.Cancel();&lt;/pre&gt;
&lt;p&gt;Bu modelde bir &lt;strong&gt;Task'&lt;/strong&gt; in iptal istemi geldiğinde, &amp;ccedil;alışmakta olan g&amp;uuml;ncel &lt;strong&gt;Task'&lt;/strong&gt; in &amp;uuml;zerinden &lt;strong&gt;IsCancellationRequested&lt;/strong&gt; &amp;ouml;zelliğinin değerine bakılması gerekmekteydi. Eğer bu &amp;ouml;zelliğin değeri &lt;strong&gt;true&lt;/strong&gt; ise bu durumda ilgili &lt;strong&gt;Task'&lt;/strong&gt; in iptal işlemi ile ilişkili olaraktan bilgilendirilmesi amacıyla &lt;strong&gt;AcknowledgeCancellation&lt;/strong&gt; metodu &amp;ccedil;ağırılmakta ve &amp;ouml;rneğin &lt;strong&gt;return&lt;/strong&gt; gibi bir &amp;ccedil;ağrı ile paralel y&amp;uuml;reyen operasyondan &amp;ccedil;ıkılmaktaydı. Ancak &lt;strong&gt;Beta 1&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;ndeki bu yaklaşımın bazı handikapları da bulunmaktaydı. S&amp;ouml;z gelimi iptal isteğinin kontrol&amp;uuml; sırasında y&amp;uuml;r&amp;uuml;yen s&amp;uuml;reci kesmek i&amp;ccedil;in return gibi bir &amp;ccedil;ıkış kullanılması, Task tipi &amp;uuml;zerinden static Current &amp;ouml;zelliğne gidilmek zorunda kalınması, iptal ile ilişkili t&amp;uuml;m fonksiyonellik ve &amp;ouml;zelliklerin Task tipi &amp;uuml;zerinde yer alması vb...Bu sebeplerden dolayı &lt;strong&gt;Beta 2&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nde bir &lt;strong&gt;Task'&lt;/strong&gt; in iptal edilme işlemi yeniden değerlendirelerek daha tutarlı bir hale getirildi. Buna g&amp;ouml;re yeni modeli aşağıdaki &amp;ouml;rnekte g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &amp;ouml;zetleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Threading;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace TaskParallelLibrary
{
    public partial class Form1 : Form
    {
        CancellationTokenSource source;
        CancellationToken token;
        Task parallelTask;

        public Form1()
        {
            InitializeComponent();

            source = new CancellationTokenSource();
            token = source.Token;
        }

        private void btnStart_Click(object sender, EventArgs e)
        {
            parallelTask = Task.Factory.StartNew(() =&amp;gt;
            {
                for (int i = 1000; i &amp;lt; 1000000; i++)
                {
                    // Eğer Cancel isteği gelirse OperationCancelled istisnası fırlatılır.
                    token.ThrowIfCancellationRequested();
                    // Burada bir takım işlemler yapılmakta olduğunu d&amp;uuml;ş&amp;uuml;nebiliriz
                }
            }
            , token
            ); // StarNew metodunda kullanılan ikinci parametre ile CancellationToken referansının aktarıldığında dikkat edelim.
        }

        private void btnCancel_Click(object sender, EventArgs e)
        {
            source.Cancel(); // İptal işlemi i&amp;ccedil;in Task referansı yerine CancellationTokenSource referansı kullanılmaktadır.
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Beta 2&lt;/strong&gt; ile gelen iptal modelinde &lt;strong&gt;CancellationTokenSource&lt;/strong&gt;, &lt;strong&gt;CancellationToken&lt;/strong&gt; isimli yeni tiplerin kullanıldığı g&amp;ouml;r&amp;uuml;lmektedir. Dikkat &amp;ccedil;ekici noktalardan birisi, &lt;strong&gt;Task'&lt;/strong&gt; in başlatılması işlemi sırasında ikinci parametre olarak bir &lt;strong&gt;CancellationToken&lt;/strong&gt; referansının g&amp;ouml;nderilmesidir. Bu referanstan yararlanılarak &lt;strong&gt;for&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; i&amp;ccedil;erisinde &lt;strong&gt;ThrowIfCancellationRequested&lt;/strong&gt; metodu &amp;ccedil;ağırılmaktadır. İşte bir yenilik daha. Bu metod, token referansı ile ilişkilendirilmiş olan &lt;strong&gt;Task'&lt;/strong&gt; e bir iptal isteği gelip gelmediğini kontrol etmektedir. Eğer b&amp;ouml;yle bir istek gelmişse &lt;strong&gt;OperationCancelledException&lt;/strong&gt; tipinden olan istisnayı fırlatmakta ve &amp;ccedil;alışmakta olan &lt;strong&gt;Task'&lt;/strong&gt; in iptal edilmesine neden olmaktadır. Bir &amp;ouml;nceki modelde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi bir &lt;strong&gt;if&lt;/strong&gt; kontrol&amp;uuml; yapılmasına ve &lt;strong&gt;return&lt;/strong&gt; gibi bir &amp;ccedil;ıkış yolu kullanılmasına gerek kalmamaktadır. Bir diğer &amp;ouml;nemli noktada, iptal işlemi i&amp;ccedil;in &lt;strong&gt;Task&lt;/strong&gt; referansı yerine &lt;strong&gt;CancellationTokenSource&lt;/strong&gt; nesne &amp;ouml;rneğinin kullanılıyor olmasıdır.&lt;/p&gt;
&lt;p&gt;İptal işlemi ile ilişkili &amp;uuml;yelerin tamamı &lt;strong&gt;Task&lt;/strong&gt; tipinden &amp;ccedil;ıkartılmıştır&lt;strong&gt;(Cancel,AcknowledgeCancellation,IsCancellationRequested,CurrentTask vb...)&lt;/strong&gt; &lt;strong&gt;Cancel&lt;/strong&gt; &amp;ccedil;ağrısı i&amp;ccedil;in &lt;strong&gt;CancellationTokenSource&lt;/strong&gt; , &lt;strong&gt;ThrowIfCancellationRequested&lt;/strong&gt; &amp;ccedil;ağrısı ile iptal kontrol&amp;uuml; ve operasyonun kesilmesi i&amp;ccedil;in &lt;strong&gt;CancellationToken&lt;/strong&gt; referanslarının kullanıldığına dikkat edelim. Buna g&amp;ouml;re bir iptal işlemi, aynı &lt;strong&gt;CancellationToken&lt;/strong&gt; referansını kullanan birden fazla &lt;strong&gt;Task'&lt;/strong&gt; ede uygulanabilir.&amp;nbsp;Zaten bu&amp;nbsp;ama&amp;ccedil;la,&amp;nbsp;&lt;strong&gt;StartNew&lt;/strong&gt; gibi bazı metodların yeni aşırı y&amp;uuml;klenmiş versiyonlarına &lt;strong&gt;CancellationToken&lt;/strong&gt; referansının taşınabiliyor olması sağlanmıştır.&lt;/p&gt;
&lt;p&gt;Bakalım&lt;strong&gt; Beta 2&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;ne g&amp;ouml;re paralel programlama alt yapısında başka ne gibi yenilikler bulunmaktadır. Bunları ilerleyen yazılarımızda incelemeye devam ediyor olacağız. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2009-11-12 02:00:00</pubDate>
  <slug>Task-Parallel-Library(TPL)-Iptal-Islemi-Beta-2</slug>
  <tags>
    <tag>task-parallel-library</tag>
  </tags>
  <categories>
    <category>TPL</category>
  </categories>
</post>