<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tek Fotoluk İpucu 139 - Singleton Method</title>
  <description>Gün geçmiyor ki Ruby dilinde beni şaşırtan bir kabiliyet ile daha karşılaşmayayım. Dün gece Ruby kitapları arasında dolanırken öğrendiğim yeni bir kavram var; Singleton Method. Instance metodlarından farklı olarak sadece belli bir nesne örneği için çalışabilecek fonksiyonellikler tanımlayabilmemizi sağlayan önemli bir yetenek. Yani sınıf tanımı içerisinde yer almayıp nesne örneği üzerinden tanımlanabilen ve sadece o örnek için kullanılabilen fonksiyonlar geliştirebildiğimizi düşünün. Konuyu aşağıdaki fotoğrafta yer alan kod parçasında daha net bir şekilde görebiliriz.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;G&amp;uuml;n ge&amp;ccedil;miyor ki Ruby dilinde beni şaşırtan bir kabiliyet ile daha karşılaşmayayım. D&amp;uuml;n&amp;nbsp;gece Ruby kitapları arasında dolanırken&amp;nbsp;&amp;ouml;ğrendiğim yeni bir kavram var; Singleton Method. Instance metodlarından farklı olarak sadece belli bir nesne &amp;ouml;rneği i&amp;ccedil;in &amp;ccedil;alışabilecek fonksiyonellikler tanımlayabilmemizi sağlayan &amp;ouml;nemli bir yetenek. Yani sınıf tanımı i&amp;ccedil;erisinde yer almayıp nesne &amp;ouml;rneği &amp;uuml;zerinden tanımlanabilen ve sadece o &amp;ouml;rnek i&amp;ccedil;in kullanılabilen fonksiyonlar geliştirebildiğimizi d&amp;uuml;ş&amp;uuml;n&amp;uuml;n. Konuyu aşağıdaki fotoğrafta yer alan kod par&amp;ccedil;asında daha net bir şekilde g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/10/tfip_139.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Player isimli bir sınıfımız var.&amp;nbsp;Her bir oyuncunun adını ve oyundaki pozisyonunu tutuyoruz. Bununla birlikte oyuncuların hareket etmelerini sağlayan&amp;nbsp;Move isimli bir metodumuz da var. Normal şartlarda burki isimli nesne &amp;ouml;rneği &amp;uuml;zerinden Move isimli fonksiyonu &amp;ccedil;ağırabiliriz. Hatta başka Player nesne &amp;ouml;rnekleri i&amp;ccedil;in de bu fonksiyonellik ge&amp;ccedil;erli. Ancak kodun ilerleyen kısımlarında sadece burki nesnesi i&amp;ccedil;in ge&amp;ccedil;erli olacak Jump isimli bir fonksiyon&lt;em&gt;(Singleton Method)&lt;/em&gt; tanımı ve kullanımı s&amp;ouml;z konusu. Bu fonksiyonu sharp isimli diğer bir Player nesne &amp;ouml;rneği ile kullanamayız, nitekim kodun &amp;ccedil;alışması sırasında "undefined method..." hatası aldığımızı fark etmişsinizdir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;Bir diğer enteresan durumda &lt;/span&gt;&lt;span style="line-height: 1.8;"&gt;fonksiyon ezilmesi(overriding)&lt;/span&gt;&lt;span style="line-height: 1.8;"&gt;. Player sınıfı i&amp;ccedil;erisinde tanımlı olan Move fonksiyonunu sadece sharp nesne &amp;ouml;rneği i&amp;ccedil;in &lt;/span&gt;&lt;span style="line-height: 1.8;"&gt;ezdik ve &amp;ccedil;alışma şeklini değiştirdik&lt;/span&gt;&lt;span style="line-height: 1.8;"&gt;.&amp;nbsp;&lt;/span&gt;&lt;span style="line-height: 1.8;"&gt;Singleton metodların &amp;ouml;zellikle Unit Test'ler de &amp;ouml;nemli bir yeri olduğu s&amp;ouml;yleniyor. Bir sınfın her Unit Test sırasında&amp;nbsp;tekrarlayarak &amp;ccedil;alışan ama o anki vaka i&amp;ccedil;in gerekli olmayan&amp;nbsp;fonksiyonlarını&amp;nbsp;Override etme yeteneğini ile devre dışı bırakma şansımız var &amp;ouml;rneğin.&amp;nbsp;Ayrıca&amp;nbsp;&amp;ccedil;alışma zamanında&amp;nbsp;belli&amp;nbsp;bir nesne &amp;ouml;rneği i&amp;ccedil;in&amp;nbsp;ek davranışların tasarlanmasında da Singleton metodlardan yararlanabiliriz.&amp;nbsp;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;B&amp;ouml;ylece geldik bir tek fotoluk ipucunun daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/span&gt;&lt;/p&gt;</content>
  <pubDate>2016-10-30 21:30:00</pubDate>
  <slug>tek-fotoluk-ipucu-139-singleton-method</slug>
  <tags>
    <tag>ruby</tag>
    <tag>singleton-method</tag>
    <tag>override</tag>
    <tag>overriding</tag>
    <tag>functional-programming</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>