<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tembellik Etmek İstiyorum (Generic Lazy Tipi ile Et)</title>
  <description>Aslında geliştiriciler için Lazy olmanın başka manaları da vardır. Olay sadece çimler üzerinde uzanmaktan ibaret değildir anlayacağınız. İlk akla gelen ORM(Object Relational Mapping) araçlarının birincil özelliklerinden birisi olan Lazy Loading kavramıdır. Kısaca Entity tabanlı nesnelerin/koleksiyonlarının gerektiğinde yüklenmesi şeklinde açıklayabiliriz. Ne varki .Net Framework 4.0 sürümü ile birlikte hayatımıza bir de Lazy&lt;T&gt; tipi girmektedir. Base Class Library içerisine dahil edilen bu yeni generic sınıf sayesinde T tipi için Lazy Initialization işlemi gerçekleştirilebilmektedir.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f5%2fblg194_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Yaz g&amp;uuml;nlerinde pek &amp;ccedil;ok geliştirici tembellik yapmak ister. Hatta benim gibi kocaman bir&amp;nbsp;&lt;strong&gt;&amp;Uuml;niversite Kamp&amp;uuml;s&amp;uuml;&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &amp;ccedil;alışma ortamınız var ise ve kamp&amp;uuml;s&amp;uuml;n&amp;uuml;z&amp;uuml;n &amp;ccedil;imleri &amp;uuml;zerinde yatıp ş&amp;ouml;yle beş on dakika kestirmeye m&amp;uuml;saitse. Tabi tembelliğin &amp;ccedil;eşitli t&amp;uuml;revleri vardır. &amp;Ccedil;imler &amp;uuml;zerinde uzanmak bunlardan sadece birisi.&lt;/p&gt;
&lt;p&gt;Aslında geliştiriciler i&amp;ccedil;in &lt;strong&gt;Lazy &lt;/strong&gt;olmanın başka manaları da vardır. Olay sadece &amp;ccedil;imler &amp;uuml;zerinde uzanmaktan ibaret değildir anlayacağınız. İlk akla gelen &lt;strong&gt;ORM(Object Relational Mapping)&amp;nbsp;&lt;/strong&gt;ara&amp;ccedil;larının birincil &amp;ouml;zelliklerinden birisi olan &lt;strong&gt;Lazy Loading&lt;/strong&gt; kavramıdır. Kısaca &lt;strong&gt;Entity&lt;/strong&gt; tabanlı nesnelerin/koleksiyonlarının gerektiğinde y&amp;uuml;klenmesi şeklinde a&amp;ccedil;ıklayabiliriz. Ne varki&lt;strong&gt; .Net Framework 4.0&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml; ile birlikte hayatımıza bir de &lt;strong&gt;Lazy&amp;lt;T&amp;gt;&lt;/strong&gt; tipi girmektedir. &lt;strong&gt;Base Class Library&lt;/strong&gt; i&amp;ccedil;erisine dahil edilen bu yeni generic sınıf sayesinde &lt;strong&gt;T&lt;/strong&gt; tipi i&amp;ccedil;in &lt;strong&gt;Lazy Initialization&lt;/strong&gt; işlemi ger&amp;ccedil;ekleştirilebilmektedir.&lt;/p&gt;
&lt;p&gt;Bu nokta da &lt;strong&gt;Lazy&amp;lt;T&amp;gt;&lt;/strong&gt; tipinin iki &amp;ouml;nemli &lt;strong&gt;&amp;ouml;zelliği(Property)&lt;/strong&gt; olduğunu ifade etmemiz gerekiyor. &lt;strong&gt;Value&lt;/strong&gt; ve &lt;strong&gt;IsValueCreated&lt;/strong&gt;. Aslında &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliği ve &lt;strong&gt;ToString()&lt;/strong&gt; metodu &amp;ccedil;ağırılana kadar &lt;strong&gt;T&lt;/strong&gt; tipi ile ilişkili bir y&amp;uuml;kleme işlemi yapılmadığını s&amp;ouml;ylersek sanıyorum ki olay daha net bir şekilde anlaşılabilir. Ancak konuyu kod yardımıyla irdelemek elbetteki en iyi yoldur. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;&amp;nbsp;İlk etapta aşağıdaki &lt;strong&gt;Console &lt;/strong&gt;uygulaması kodlarına sahip olduğumuzu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic;

namespace LazyInitializations
{
 class Program
 {
  static void Main(string[] args)
  {
   var productList = GetProducts();
   IncreaseListPrice(productList);
  }

  static void IncreaseListPrice(List&amp;lt;Product&amp;gt; products)
  {
   Console.WriteLine("Liste Fiyatları 1 birim arttırılacak");
   foreach (Product product in products)
   {
    product.ListPrice += 1; 
   }
  }
 
  static List&amp;lt;Product&amp;gt; GetProducts()
  {
   Console.WriteLine("\tProduct listesi oluşturulacak");
   return new List&amp;lt;Product&amp;gt;
   {
    new Product{ProductId=2,Name="Avaya IP Phone", ListPrice=100.99},
    new Product{ProductId=3,Name="Toshiba 106 inc Tv", ListPrice=1200.99},
    new Product{ProductId=4,Name="Hp 6730b Laptop", ListPrice=980.49}
   };
  }
 }
 
 class Product
 {
  public int ProductId { get; set; }
  public string Name { get; set; }
  public double ListPrice { get; set; }
 }
}&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında yer alan &lt;strong&gt;GetProducts&lt;/strong&gt; isimli metod &lt;strong&gt;Product&lt;/strong&gt; tipinden nesne &amp;ouml;rneklerinden oluşan bir &lt;strong&gt;List&amp;lt;T&amp;gt;&lt;/strong&gt; koleksiyonunu geriye d&amp;ouml;nd&amp;uuml;rmektedir. Diğer yandan &lt;strong&gt;IncreaseListPrice&lt;/strong&gt; isimli metod da, parametre olarak gelen &lt;strong&gt;Product&lt;/strong&gt; listesindeki her bir &amp;uuml;r&amp;uuml;n&amp;uuml;n birim fiyatını 1 birim arttırmaktadır. &lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisinde kod işleyiş sırasına baktığımızda &amp;ouml;nce &lt;strong&gt;List&amp;lt;Product&amp;gt;&lt;/strong&gt; tipinden olan koleksiyonunun doldurulduğunu, sonrasında ise &lt;strong&gt;IncreaseListPrice&lt;/strong&gt; isimli metodun &amp;ccedil;ağırıldığını g&amp;ouml;rebiliriz. Bu &amp;ouml;rnek uygulamada aslında olağan&amp;uuml;st&amp;uuml; veya şaşırtıcı bir durum s&amp;ouml;z konusu değildir. Ancak bizi &lt;strong&gt;Lazy Initialization&lt;/strong&gt;' a g&amp;ouml;t&amp;uuml;recek bir nedende olabilir. S&amp;ouml;z gelimi bu kod par&amp;ccedil;asına g&amp;ouml;re &amp;uuml;r&amp;uuml;n listesinin elde edilmesi beklenenden uzun s&amp;uuml;r&amp;uuml;yor olabilir ve &amp;ouml;zellikle &lt;strong&gt;IncreaseListPrice&lt;/strong&gt; metod &amp;ccedil;ağrısı &amp;ouml;ncesinde başka işlerin yapıldığı da d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. &amp;Ccedil;ok basit bir şekilde sembolize etmek istersek;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var productList = GetProducts();
// Bir takım Business &amp;ccedil;ağrılar yapıldığını d&amp;uuml;ş&amp;uuml;nelim
IncreaseListPrice(productList);&lt;/pre&gt;
&lt;p&gt;Buna g&amp;ouml;re aslında &lt;strong&gt;&amp;uuml;r&amp;uuml;n listesinin(List&amp;lt;Product&amp;gt;)&lt;/strong&gt; sadece işlem yapılacağı yerde y&amp;uuml;klenmesini, başlangı&amp;ccedil;ta y&amp;uuml;klenerek zaman kaybına neden &lt;span style="text-decoration: underline;"&gt;olunmamasını&lt;/span&gt; isteyebiliriz ki bu durumda Business &amp;ccedil;ağrıların bekletilmemesi de sağlanmış olacaktır. İşte b&amp;ouml;yle bir durumda &lt;strong&gt;Lazy&amp;lt;T&amp;gt;&lt;/strong&gt; tipine ait bir nesne &amp;ouml;rneği gerekli tembelliği bize sunabilir. Nasıl mı?&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
 // var productList = GetProducts();
 Lazy&amp;lt;List&amp;lt;Product&amp;gt;&amp;gt; lazyProductList = new Lazy&amp;lt;List&amp;lt;Product&amp;gt;&amp;gt;(
    () =&amp;gt; GetProducts()
   );
 // Bir takım Business &amp;ccedil;ağrılar yapıldığını d&amp;uuml;ş&amp;uuml;nelim
 Console.WriteLine("Product listesi y&amp;uuml;klendi mi?  {0}",lazyProductList.IsValueCreated?"Evet":"Hayır");
 IncreaseListPrice(lazyProductList.Value);
 Console.WriteLine("Product listesi y&amp;uuml;klendi mi? {0}", lazyProductList.IsValueCreated ? "Evet" : "Hayır");
 // IncreaseListPrice(productList);
}&lt;/pre&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;Lazy&amp;lt;List&amp;lt;Product&amp;gt;&amp;gt;&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneği oluşturulduğu g&amp;ouml;r&amp;uuml;lmektedir. Buna g&amp;ouml;re&lt;strong&gt; T&lt;/strong&gt; olarak belirtilen &lt;strong&gt;List&amp;lt;Product&amp;gt;&lt;/strong&gt; tipinden nesne &amp;ouml;rneği d&amp;ouml;nd&amp;uuml;recek bir operasyon i&amp;ccedil;in &lt;strong&gt;Lazy Initialization&lt;/strong&gt; işleminin uygulanacağı bildirilmektedir. &lt;strong&gt;Lazy&amp;lt;T&amp;gt;&lt;/strong&gt; tipinin bir ka&amp;ccedil; &lt;strong&gt;aşırı y&amp;uuml;klenmiş y&amp;uuml;klenici metodu(Overloaded Constructor)&lt;/strong&gt; bulunmaktadır. &amp;Ouml;rnekte &lt;strong&gt;Func&amp;lt;T&amp;gt; temsilcisini(Delegate)&lt;/strong&gt; kullanan versiyon ele alınmıştır. Tahmin edileceği &amp;uuml;zere burada &lt;strong&gt;GetProducts&lt;/strong&gt; isimli metod &amp;ccedil;ağırısı ger&amp;ccedil;ekleştirilmektedir. İzleyen satırda bir takım &lt;strong&gt;Business&lt;/strong&gt; işlemlerin yapıldığı d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde &lt;strong&gt;Product&lt;/strong&gt; listesinin y&amp;uuml;klenmesi işlemlerinin, bu operasyonu engellemediği d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Nitekim hen&amp;uuml;z &lt;strong&gt;Product&lt;/strong&gt; listesi &lt;span style="text-decoration: underline;"&gt;y&amp;uuml;klenmemiştir&lt;/span&gt;. Bunu kod tarafında anlamanın yolu&lt;strong&gt; Lazy&amp;lt;T&amp;gt;&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt;IsValueCreated&lt;/strong&gt; &amp;ouml;zelliğine bakmtaktır. Diğer yandan uygulamayı &lt;strong&gt;Debug&lt;/strong&gt; ettiğimizde tam bu noktada durduğumuz takdirde aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f5%2fblg194_Debug1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;IsValueCreatted&lt;/strong&gt; &amp;ouml;zelliği, &lt;strong&gt;Lazy&amp;lt;T&amp;gt;&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliği kullanılana kadar &lt;strong&gt;False &lt;/strong&gt;değere sahiptir.&amp;nbsp;&lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliğinin &amp;ccedil;ağırılması artık yapıcı metod i&amp;ccedil;erisinde &lt;strong&gt;Func&amp;lt;T&amp;gt; &lt;/strong&gt;temsilcisi ile bildirilen metodun icra edilmesi anlamına gelmektedir. Bir başka deyişle s&amp;ouml;z konusu &lt;strong&gt;Product&lt;/strong&gt; listesinin y&amp;uuml;klenmesi işlemi ger&amp;ccedil;ekleştirilecektir. Bu durumda kod tarafında &lt;strong&gt;IsValueCreated&lt;/strong&gt; &amp;ouml;zelliği &lt;strong&gt;true&lt;/strong&gt; değere sahip olacaktır. Yine &lt;strong&gt;Debug&lt;/strong&gt; penceresinden olaya baktığımızda aşağıdaki ekran &amp;ccedil;ıktısı ile karşılaştığımızı g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f5%2fblg194_Debug2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliği&lt;strong&gt; 3&lt;/strong&gt; adet &lt;strong&gt;Product&lt;/strong&gt; nesne &amp;ouml;rneğini işaret etmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Lazy&amp;lt;T&amp;gt;&lt;/strong&gt; kullanımında dikkate değer noktalardan biriside &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliğine ilk &amp;ccedil;ağrıdan sonra tekrar erişilmesi halidir. Durumu aşağıdaki kod par&amp;ccedil;ası ile irdeleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;...
IncreaseListPrice(lazyProductList.Value);
Console.WriteLine("Product listesi y&amp;uuml;klendi mi? {0}", lazyProductList.IsValueCreated ? "Evet" : "Hayır");
// IncreaseListPrice(productList);
var productList = lazyProductList.Value;
IncreaseListPrice(productList);&lt;/pre&gt;
&lt;p&gt;Burada &lt;strong&gt;IncreaseListPrice&lt;/strong&gt; metodunun parametresinde &lt;strong&gt;Lazy&amp;lt;T&amp;gt;&lt;/strong&gt; nesne &amp;ouml;rneği i&amp;ccedil;in bir &lt;strong&gt;Value&lt;/strong&gt; &amp;ccedil;ağrısı yapılmaktadır. Bu &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliği i&amp;ccedil;in yapılan &lt;strong&gt;ilk &amp;ccedil;ağrı&lt;/strong&gt; olduğundan&lt;strong&gt; GetProducts()&lt;/strong&gt; metodunun &amp;ccedil;ağırılması işlemi bu noktada yapılmaktadır. Ancak son iki satırda &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliği tekrardan kullanılmıştır. İlk olarak &lt;strong&gt;productList&lt;/strong&gt; isimli bir değişkene değer ataması ger&amp;ccedil;ekleştirilmiş arından elde edilen değer &lt;strong&gt;IncreaseListPrice&lt;/strong&gt; metoduna parametre olarak ge&amp;ccedil;irilmiştir. Burada &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliğine bir &amp;ccedil;ağrı yapılması nedeni ile &lt;strong&gt;GetProducts&lt;/strong&gt; isimli metodun bir kere daha &amp;ccedil;alıştırılacağı d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Ama b&amp;ouml;yle olmayacaktır. Bunu &lt;strong&gt;debug&lt;/strong&gt; sırasında g&amp;ouml;rebileceğimiz gibi kodun &amp;ccedil;alışma zamanı &amp;ccedil;ıktısında da fark edebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f5%2fblg194_Runtime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi "&lt;strong&gt;Product&lt;/strong&gt; &lt;strong&gt;Listesi Oluşturulacak" &lt;/strong&gt;ifadesi sadece bir kere &amp;ccedil;ağırılmıştır. Son olarak &lt;strong&gt;Lazy&amp;lt;T&amp;gt;&lt;/strong&gt; tipinin&lt;strong&gt; Thread Safety&lt;/strong&gt;' yi varsayılan olarak sunduğunu bu nedenle &lt;strong&gt;Concurrent&lt;/strong&gt; operasyonlarda ele alınabileceğini de belirtelim.&amp;nbsp;&lt;strong&gt;Base Class Library&lt;/strong&gt; i&amp;ccedil;erisine &lt;strong&gt;.Net Framework&amp;nbsp;4.0 &lt;/strong&gt;ile birlikte gelen pek &amp;ccedil;ok yeni tip s&amp;ouml;z konusudur. &lt;strong&gt;Lazy&amp;lt;T&amp;gt;&lt;/strong&gt; bunlardan sadece bir tanesiydi. İlerleyen zamanlarda diğer yenilikleri de incelemeye &amp;ccedil;alışıyor olacağız. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f5%2fLazyInitializations_.rar"&gt;LazyInitializations_.rar (27,13 kb)&lt;/a&gt;&lt;strong&gt;&amp;nbsp;[&amp;Ouml;rnek Visual Studio 2010 Ultimate s&amp;uuml;r&amp;uuml;m&amp;uuml; ile geliştirilmiş ve test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-10-11 12:20:00</pubDate>
  <slug>Tembellik-Etmek-Istiyorum-(Generic-Lazy-Tipi-ile-Et)</slug>
  <tags>
    <tag>c#-40</tag>
    <tag>bcl</tag>
    <tag>base-class-library</tag>
    <tag>lazy-initialization</tag>
    <tag>lazy&lt;t&gt;</tag>
  </tags>
  <categories>
    <category>C# 4.0</category>
  </categories>
</post>