<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Copilot SDK ile İlk Deneyimler</title>
  <description>İçimiz dışımız, sağımız solumuz yapay zekadan geçilmiyor. Öyle bir dönemdeyiz ne ona burun kıvırabiliriz ne de her şeyimizle teslim. Halen daha işin özünde problemi anlamanın, parçalara bölebilmenin, doğru metodolojileri ve araçları kullanarak ideal çözüm yollarını geliştirebilmenin önemli olduğunu düşünüyorum. Bunun içinde kendimizi donatmaya devam etmemiz gerektiğini biliyorum. Ayrıca yapay zeka araçlarını tanımanın ve yazılımcılara ne gibi avantajlar ya da tam tersi dezavantajlar getireceğini de araştırmalıyız diyorum. Ne yazık ki yapay zeka denildiğinde onu sadece chat-gpt'den ibaret bir şey olduğunu düşünenler var. Bunun böyle olmadığını deneyimlediğim araçlar bana gösteriyor. Tanımak lazım. İşte bugünkü yazımızın konularından birisi de bu; Microsoft'un Copilot SDK paketini kullanarak neler yapabilirizin basit bir Hello World demosu.</description>
  <content>&lt;p&gt;İ&amp;ccedil;imiz dışımız, sağımız solumuz yapay zekadan ge&amp;ccedil;ilmiyor. &amp;Ouml;yle bir d&amp;ouml;nemdeyiz ne ona burun kıvırabiliriz ne de her şeyimizle teslim. Halen daha işin &amp;ouml;z&amp;uuml;nde problemi anlamanın, par&amp;ccedil;alara b&amp;ouml;lebilmenin, doğru metodolojileri ve ara&amp;ccedil;ları kullanarak ideal &amp;ccedil;&amp;ouml;z&amp;uuml;m yollarını geliştirebilmenin &amp;ouml;nemli olduğunu d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Bunun i&amp;ccedil;inde kendimizi donatmaya devam etmemiz gerektiğini biliyorum. Ayrıca yapay zeka ara&amp;ccedil;larını tanımanın ve yazılımcılara ne gibi avantajlar ya da tam tersi dezavantajlar getireceğini de araştırmalıyız diyorum. Ne yazık ki yapay zeka denildiğinde onu sadece chat-gpt'den ibaret bir şey olduğunu d&amp;uuml;ş&amp;uuml;nenler var. Bunun b&amp;ouml;yle olmadığını deneyimlediğim ara&amp;ccedil;lar bana g&amp;ouml;steriyor. Tanımak lazım. İşte bug&amp;uuml;nk&amp;uuml; yazımızın konularından birisi de bu; &lt;strong&gt;Microsoft&lt;/strong&gt;'un &lt;a href="https://github.com/github/copilot-sdk" target="_blank"&gt;&lt;strong&gt;Copilot SDK&lt;/strong&gt;&lt;/a&gt; paketini kullanarak neler yapabilirizin basit bir Hello World demosu.&lt;/p&gt;
&lt;p&gt;Pek tabii &lt;strong&gt;CLI&lt;em&gt;(Command Line Interface)&lt;/em&gt;&lt;/strong&gt; aracı olarak yapay zeka modellerinin nasıl konumlandığına bir bakmak gerekiyor. Kendi sistemlerimizde &lt;strong&gt;Claude&lt;/strong&gt;'nin, &lt;strong&gt;Github&lt;/strong&gt;'ın veya benzerlerinin komut satırı ara&amp;ccedil;larını kullanarak da bir&amp;ccedil;ok şey yapabiliyoruz. Planlama, g&amp;ouml;rev tayin etme, proje &amp;uuml;retme vs gibi bir&amp;ccedil;ok aksiyonu icra edebilmekteyiz. Peki &lt;strong&gt;Copilot SDK&lt;/strong&gt; ile neler yapabiliriz? İlk bakışta deneyimlediğim &amp;ouml;rnekleri paylaşmak isterim. &amp;Ouml;ncelikle sistemimizde Copilot CLI'ın y&amp;uuml;kl&amp;uuml; olması gerekiyor. Bunu &amp;ouml;ğrenmek i&amp;ccedil;in komut satırından versiyon bilgisini alabiliriz velev ki yok o zaman &lt;a href="https://docs.github.com/en/copilot/how-tos/copilot-cli/set-up-copilot-cli/install-copilot-cli" target="_blank"&gt;şu adresten indirip&lt;/a&gt; deneyebilirsiniz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;copilot --version&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2026/Mart/HelloCopilotSDK_00.png" alt="" /&gt;&lt;br /&gt;Teori olduk&amp;ccedil;a basit. &lt;strong&gt;SDK&lt;/strong&gt;, sanki &lt;strong&gt;VS Code AI&lt;/strong&gt; chat pencersini veya &lt;strong&gt;Copilot CLI&lt;/strong&gt; aracını kullanıyormuşuz gibi dil modelleri ile entegre uygulamalar geliştirebilmemizi sağlayan fonksiyonellikleri barındırıyor. Giriş &amp;ouml;rneğimizde basit bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması oluşturup gerekli &lt;strong&gt;Nuget&lt;/strong&gt; paketini ekleyerek devam edelim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# Console projesinin oluşturulması
dotnet new console -n HelloCopilotSDK
cd HelloCopilotSDK
# Copilot SDK Nuget paketinin projeye eklenmesi
dotnet add package GitHub.Copilot.Sdk&lt;/pre&gt;
&lt;p&gt;Resmi github dok&amp;uuml;mantasyonunun ilk &amp;ouml;rneğinde &lt;strong&gt;gpt-4.1&lt;/strong&gt;'e &lt;strong&gt;2+2&lt;/strong&gt; işlemi soruluyor &lt;em&gt;(L&amp;uuml;tfen bildiğiniz şeyler i&amp;ccedil;in yapay zeka ara&amp;ccedil;larını kullanmayın derim :D)&lt;/em&gt; Ama sonu&amp;ccedil;ta SDK'yı tanımak i&amp;ccedil;in basit bir &amp;ouml;rnek hazırlamam da gerekiyor. Bu ama&amp;ccedil;lar en azından belli sayıda &lt;strong&gt;Fibonacci&lt;/strong&gt; değerini &lt;strong&gt;Chuck Norris&lt;/strong&gt; ile birlikte ele abileceğimiz bir sorguyla işi renklendirebiliriz diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. İşte kodlarımız;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using GitHub.Copilot.SDK;

await using var client = new CopilotClient();

var modelName = "claude-sonnet-4.5";
var intro = $"Starting Copilot session with model: {modelName}";
Console.WriteLine(intro);
Console.WriteLine(new string('-', intro.Length));
Console.WriteLine();

await using var session = await client.CreateSessionAsync(
    new SessionConfig
    {
        Model = modelName,
        OnPermissionRequest = PermissionHandler.ApproveAll,
        Streaming = true
    }
);

session.On(e =&amp;gt;
{
    switch (e)
    {
        case AssistantMessageDeltaEvent messageEvent:
            Console.Write(messageEvent.Data.DeltaContent);
            break;
        case SessionIdleEvent messageEvent:
            Console.WriteLine("");
            break;
    }
});

await session.SendAndWaitAsync(
    new MessageOptions
    {
        Prompt = "Give me the first 10 Fibonacci numbers and then find the related Norris Joke."
    }
);&lt;/pre&gt;
&lt;p&gt;Kodda neler yaptığımız ş&amp;ouml;yle bir bakalım dilerseniz. Bu &lt;strong&gt;console&lt;/strong&gt; uygulaması ile &lt;strong&gt;Anthropic&lt;/strong&gt;' in &lt;strong&gt;Claude Sonnet 4.5&lt;/strong&gt; modelini kullanarak bir konuşma ger&amp;ccedil;ekleştirmek istiyoruz. Sorumuz da olduk&amp;ccedil;a basit ama birbirleriyle tamamen alakasız iki par&amp;ccedil;adan oluşuyor :D&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikle bir &lt;strong&gt;CopilotClient&lt;/strong&gt; nesnesi &amp;ouml;rnekliyoruz ve bu nesne yardımıyla asenkron bir oturum&lt;em&gt;(Session)&lt;/em&gt; başlatıyoruz. Malum istemci olarak bizim ve modelin arasında bir ağ trafiği s&amp;ouml;z konusu - tipik bir &lt;strong&gt;Client-Server&lt;/strong&gt; tasarım diyebiliriz. &lt;strong&gt;SessionConfig&lt;/strong&gt; sınıfını kullanarak oturum i&amp;ccedil;in gerekli bazı ayarlamaları yapıyoruz. Hangi modelle &amp;ccedil;alışacağımız dışında birde t&amp;uuml;m yetki taleplerini kabul ediyoruz. Bunu sadece geliştirme aşamasında yaptığımızı belirtmek isterim. Normal şartlarda g&amp;uuml;venlik gereği ge&amp;ccedil;erli bir yetkilendirme&lt;em&gt;(Authorize)&lt;/em&gt;&amp;nbsp;ile birlikte ilgili modele gidilmesi gerekir. Ben şimdilik kolaya ka&amp;ccedil;tım zira bunu yapmadığım takdirde bir &amp;ccedil;alışma zamanı hatası almaktayım.&lt;/p&gt;
&lt;p&gt;Diğer yandan a&amp;ccedil;ılan oturum sırasında modelden gelen bilgilerin anlık olarak g&amp;ouml;r&amp;uuml;nmesini de sağlayabiliriz. Tahmin edileceği &amp;uuml;zere &lt;strong&gt;Streaming&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;true&lt;/strong&gt; değeri atamamızın sebebi bu. &lt;strong&gt;Streaming&lt;/strong&gt; kullanmadığımız takdirde cevabı yine alırız ancak cevabın tamamı gelene kadar beklemek gerekir. Oysa &lt;strong&gt;Streaming&lt;/strong&gt; ile cevabın par&amp;ccedil;alar halinde gelmesini sağlayarak cevabın o anki kısmını ekrana yazdırabiliriz. Takibimiz kolaylaşır.&lt;/p&gt;
&lt;p&gt;Devam eden kısımda ise oturum sırasında ger&amp;ccedil;ekleşen olayları&lt;em&gt;(events)&lt;/em&gt; dinlediğimiz bir metod bloğu var. &lt;strong&gt;On&lt;/strong&gt; metodu ile oturum sırasında ger&amp;ccedil;ekleşen olayları dinliyoruz ki bu &amp;ouml;rnekte iki olayı ele almaktayız. Bunlardan birisi modelden gelen cevabın par&amp;ccedil;alarını temsil eden &lt;strong&gt;AssistantMessageDeltaEvent&lt;/strong&gt; t&amp;uuml;r&amp;uuml;nden olanı. Bu olay ger&amp;ccedil;ekleştiğinde cevabın o anki par&amp;ccedil;asını ekrana yazdırma şansımız var. Diğer yandan &lt;strong&gt;SessionIdleEvent&lt;/strong&gt; t&amp;uuml;r&amp;uuml;nden bir olay da var ki bu da model cevabı tamamen d&amp;ouml;nd&amp;uuml;kten sonra ger&amp;ccedil;ekleşiyor ya da sistem Idle'a d&amp;uuml;şt&amp;uuml;ğ&amp;uuml; zaman icra ediliyor desek daha mı doğru olur. Bilemiyorum Altan...Bu olay ger&amp;ccedil;ekleştiğinde terminalde bir alt satıra ge&amp;ccedil;ip cevabın tamamlandığını belirtmiş oluyoruz.&lt;/p&gt;
&lt;p&gt;Son olarak da &lt;strong&gt;SendAndWaitAsync&lt;/strong&gt; metodu yardımıyla modele sormak istediğimiz soruyu g&amp;ouml;nderiyoruz. Bu metodun asenkron olduğunu ve oturumun sonlanmasını beklediğini de belirtelim. Bir başka deyişle cevap gelene kadar uygulama sonlanmayacaktır. İşte ilk &amp;ouml;rneğimizin &amp;ccedil;alışma zamanına ait bir &amp;ccedil;ıktı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2026/Mart/HelloCopilotSDK_01.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi işi bir seviye daha ileri g&amp;ouml;t&amp;uuml;relim. Yapay zeka modelleri ile &amp;ccedil;alışırken &amp;ccedil;oğunlukla genel dil modellerinin eğitilmiş olduğu veri k&amp;uuml;meleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınır. Oysa ki iş d&amp;uuml;nyasında &amp;uuml;zerinde &amp;ccedil;alıştığımız sistemler ağırlıklı olarak belli domain &amp;ccedil;er&amp;ccedil;evelerine sahiptir. Bu nedenle modele gitmeden &amp;ouml;nce bazen &amp;ouml;n hazırlıklar yapılır. Modelin &amp;ouml;zellikle bakmasını istediğimiz i&amp;ccedil;erikler, sistem &lt;strong&gt;prompt&lt;/strong&gt;'larının &amp;uuml;retilmesinde kullanılır ve buda dil modelinin belirlediğimi &amp;ccedil;er&amp;ccedil;evedeki verilere bakarak &amp;ccedil;ıktıları &amp;uuml;retmesini kolaylaştırabilir.&lt;/p&gt;
&lt;p&gt;Yapay zeka ara&amp;ccedil;larının sadece cevap vermek değil, g&amp;ouml;revler de icra edebildiği bir ortamda bu girdileri oturumlar sırasında kullanmak hal&amp;uuml;sinasyon riskini de azaltır. Tabii mevzu burada birka&amp;ccedil; c&amp;uuml;mle ile a&amp;ccedil;ıklanabilecek gibi değil. İşin i&amp;ccedil;erisine &lt;strong&gt;MCP&lt;em&gt;(Model Context Protocol)&lt;/em&gt;&lt;/strong&gt; sunucular,&lt;strong&gt; RAG&lt;em&gt;(Retreival Augmented Generation)&lt;/em&gt;&lt;/strong&gt; kurguları veya &lt;strong&gt;Fine-Tunning&lt;/strong&gt; gibi ciddi kas g&amp;uuml;c&amp;uuml; isteyen bir&amp;ccedil;ok mevzu ve dahası da dahil oluyor. Şimdilik bu detaylı ve kapsamlı konuları bir kenara bırakacağım ancak &lt;strong&gt;SDK&lt;/strong&gt;, oturum sırasında modele giderken &amp;ccedil;eşitli &lt;strong&gt;ara&amp;ccedil;ları&lt;em&gt;(tool)&lt;/em&gt; &lt;/strong&gt;kullanabilme imkanı da sağlıyor. Bu ara&amp;ccedil; yerel bir metod olabileceği gibi, harici bir servis &amp;ccedil;ağrısı, &lt;strong&gt;MCP&lt;/strong&gt; sunucusu da olabilir elbette. Gelin nasıl yapıldığına kısaca bir bakalım.&lt;/p&gt;
&lt;p&gt;Resmi dok&amp;uuml;manda bir şehir i&amp;ccedil;in rastgele hava sıcaklığı &amp;uuml;reten bir fonksiyon kullanılmış. Yine basit ama farklı bir &amp;ouml;rnekle gidelim. &amp;Ouml;rneğin modelin bilgisayar sarf malzemeleri ile ilgili stok bilgisi veren bir ara&amp;ccedil;tan yararlanmasını sağlayalım. Bu ara&amp;ccedil; bize stokta bulunan &amp;uuml;r&amp;uuml;nlerin isimlerini ve adetlerini versin. Hatta bunu bayii bazlı yapalım.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;- "Ankara Merkez stoğunda hangi &amp;uuml;r&amp;uuml;nlerden ka&amp;ccedil; adet var?"&lt;br /&gt;- "Şişli bayisinde Envidya GTX 2000 ekran kartlarından ka&amp;ccedil; adet kaldı?"&lt;br /&gt;- "Hangi bayilerde 32 GB RAM var?"&lt;br /&gt;- "Stoğuna RAM bulunmayan bayiler hangileri?"&lt;br /&gt;- "24 in&amp;ccedil; ve &amp;uuml;st&amp;uuml; monit&amp;ouml;r bulunduran bayiler hangileri?"&lt;/p&gt;
&lt;p&gt;Buradaki d&amp;uuml;ş&amp;uuml;nce tarzım genelde modele sorulacak soruları &amp;ouml;nceden &amp;ccedil;ıkarıp gerekli ara&amp;ccedil;ları buna g&amp;ouml;re yazmak. Elimizde devasa bir veritabanı ve hatta vekt&amp;ouml;rel olarak kavramlar arası ilişkilerin yakınlıklarını matematiksel ifade edebilen Rust ile yazılmış QDrant gibi bir veri tabanı olduğunda modelin y&amp;uuml;ksek tutarlıklı cevaplar &amp;uuml;retmesi, g&amp;ouml;revler icra etmesi pekala m&amp;uuml;mk&amp;uuml;n oluyor. Bizzat deneyimledim, g&amp;ouml;z&amp;uuml;mle g&amp;ouml;rd&amp;uuml;m&lt;em&gt;(İlk paragrafta dediğim gibi yapay zeka ara&amp;ccedil;larını sadece bir &amp;ccedil;et pencersinden ibaret şeylermiş gibi d&amp;uuml;ş&amp;uuml;nmemek lazım)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Yaş alınca insanın &amp;ccedil;enesine vuruyor galiba. &amp;Ccedil;ok konuştum sadede geleyim :D Senaryoyu renklendirmek adına bayi istatistiklerini yine .Net ile yazacağımız minimal bir Web API &amp;uuml;zerinden &amp;ccedil;ekebiliriz. Servis i&amp;ccedil;eriğini pekala aşağıdaki gibi kodlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Microsoft.AspNetCore.Http.HttpResults;
using System.Text.Json.Serialization;

var builder = WebApplication.CreateSlimBuilder(args);

builder.Services.ConfigureHttpJsonOptions(options =&amp;gt;
{
    options.SerializerOptions.TypeInfoResolverChain.Insert(0, AppJsonSerializerContext.Default);
});

builder.Services.AddOpenApi();

var app = builder.Build();

if (app.Environment.IsDevelopment())
{
    app.MapOpenApi();
}

Dealer[] data = StockStatsApi.SeedData.GetDealers();

var dataApi = app.MapGroup("/dealers");
dataApi.MapGet("/", () =&amp;gt; data)
        .WithName("GetAllStats");

dataApi.MapGet("/{id}", Results&amp;lt;Ok&amp;lt;Dealer&amp;gt;, NotFound&amp;gt; (int id) =&amp;gt;
    data.FirstOrDefault(a =&amp;gt; a.Id == id) is { } dealer
        ? TypedResults.Ok(dealer)
        : TypedResults.NotFound())
    .WithName("GetDealerById");

app.Run();

public record Dealer(int Id, string Title, string City, List&amp;lt;Stats&amp;gt; Stats);
public record Stats(int Id, string Product, int Quantity);

[JsonSerializable(typeof(Dealer[]))]
internal partial class AppJsonSerializerContext : JsonSerializerContext
{

}&lt;/pre&gt;
&lt;p&gt;Kodda yer alan &lt;strong&gt;SeedData.GetDealers()&lt;/strong&gt; metodu statik bir kod dosyası ve tamamen hayali veriler i&amp;ccedil;ermekte. Yazıda yer alan &amp;ouml;rnekler ile ilgili github referanslarını son kısımda bulabilirsiniz. &lt;strong&gt;HTTP Rest&lt;/strong&gt; modelinde &amp;ccedil;alışan servisimiz şu an i&amp;ccedil;in &lt;strong&gt;5101&lt;/strong&gt; nolu porttan &amp;ccedil;alışıyor ve &lt;strong&gt;dealers&lt;/strong&gt;, &lt;strong&gt;dealers/{id}&lt;/strong&gt; gibi iki endpoint &amp;uuml;zerinden hizmet veriyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2026/Mart/HelloCopilotSDK_02.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi gelelim &lt;strong&gt;Copilot SDK&lt;/strong&gt; kullanan istemci uygulama tarafına. Bu &lt;strong&gt;API&lt;/strong&gt;'yi &amp;ccedil;ağıran başka bir metodu &lt;strong&gt;tool&lt;/strong&gt; olarak oturuma dahil edeceğiz. Program kodlarını aşağıdaki gibi geliştirerek devam edelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using GitHub.Copilot.SDK;
using Microsoft.Extensions.AI;
using System.ComponentModel;

await using var client = new CopilotClient();

var getAllDealerStats = AIFunctionFactory.Create(
    () =&amp;gt;
    {
        // Optimizasyon i&amp;ccedil;in istemci tarafında servis &amp;ccedil;ıktısı cache'lenebilir.
        var httpClient = new HttpClient();
        var response = httpClient.GetAsync("http://localhost:5101/dealers").Result;
        var content = response.Content.ReadAsStringAsync().Result;
        return content;
    },
    "get_all_dealer_stats",
    "Get the full dealer stats"
);

await using var session = await client.CreateSessionAsync(new SessionConfig
{
    Model = "claude-sonnet-4.5",
    Streaming = true,
    Tools = [getAllDealerStats],
    OnPermissionRequest = PermissionHandler.ApproveAll,
});

session.On(e =&amp;gt;
{
    switch (e)
    {
        case AssistantMessageDeltaEvent messageEvent:
            Console.Write(messageEvent.Data.DeltaContent);
            break;
        case SessionIdleEvent messageEvent:
            Console.WriteLine("");
            break;
    }
});

Console.WriteLine("📊  Dealer Stats Assistant (type 'exit' to quit)");
Console.WriteLine("   Try: 'Ankara Merkez stoğunda hangi &amp;uuml;r&amp;uuml;nlerden ka&amp;ccedil; adet var?' or 'Şişli bayisinde Envidya GTX 2000 ekran kartlarından ka&amp;ccedil; adet kaldı?'\n");

while (true)
{
    Console.Write("--&amp;gt; ");
    var input = Console.ReadLine();

    if (string.IsNullOrEmpty(input) || input.Equals("exit", StringComparison.OrdinalIgnoreCase))
    {
        break;
    }

    Console.Write("Thinking...");
    await session.SendAndWaitAsync(new MessageOptions { Prompt = input });
    Console.WriteLine("\n");
}&lt;/pre&gt;
&lt;p&gt;Neler olduğuna kısaca bir bakalım. İşin belki de en can alıcı kısmı &lt;strong&gt;AIFunctionFactory.Create&lt;/strong&gt; metodu ile &lt;strong&gt;AIFunction&lt;/strong&gt;&amp;nbsp;abstract sınıfı tarafından taşınabilen bir nesne &amp;ouml;rneği oluşturulması. Bu nesne aslında model tarafından kullanılacak olan fonksiyonelliği işaret ediyor. Beraberinde bu ara&amp;ccedil;la ilgili kısa isimlendirme ve a&amp;ccedil;ıklama bilgilerine de veriyoruz. Model, gelen soruya istinaden &amp;ccedil;ağrıyı hangi araca delege edeceğine karar verebiliyor ki bunu &lt;strong&gt;Session&lt;/strong&gt; ayarlarında &lt;strong&gt;Tools&lt;/strong&gt; &amp;ouml;zelliğindeki listede belirtiyoruz. Tam olarak &lt;strong&gt;AIFunction&lt;/strong&gt; t&amp;uuml;r&amp;uuml;nden bir&amp;nbsp;&lt;strong&gt;generic&lt;/strong&gt; &lt;strong&gt;ICollection&lt;/strong&gt; listesi s&amp;ouml;z konusu. Dolayısıyla modelimiz, s&amp;ouml;z konusu oturum sırasında birden fazla aracı da ele alabilir. &amp;Ouml;rneğin bayi adına g&amp;ouml;re istatistik &amp;ccedil;eken bir servis metodumuz daha var dikkat ederseniz. Bunu &amp;ccedil;ağıran bir başka ara&amp;ccedil; da senaryoya dahil edilebilir. Bir deneyim derim.&lt;/p&gt;
&lt;p&gt;Kodun akan kısmında sonsuz bir while d&amp;ouml;ng&amp;uuml;s&amp;uuml; kullandığımız da dikkatlerden ka&amp;ccedil;mamış olsa gerek. Tipik bir &lt;strong&gt;chatbot&lt;/strong&gt; deneyimi yaratmak istediğimiz i&amp;ccedil;in kullanıcıdan s&amp;uuml;rekli olarak girdi alıp modele g&amp;ouml;nderiyoruz taa ki kullanıcı &lt;strong&gt;exit&lt;/strong&gt; komutu verene ya da &lt;strong&gt;CTRL+C&lt;/strong&gt; ile uygulamayı sonlandırana kadar.&lt;/p&gt;
&lt;p&gt;Pek tabii &amp;ccedil;alışma zamanında bayi istatitik bilgilerini getiren servisimizin ayakta olması gerektiğini hatırlatalım. Aksi durumda &amp;ccedil;alışma zamanı hatası alırız demek isterdim ancak işin i&amp;ccedil;erisinde artık bir yapay zeka aracı var. Dolayısıyla sonu&amp;ccedil; pekala aşağıdaki gibi olabilir :D&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2026/Mart/HelloCopilotSDK_04.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Servisimizi ayağa kaldırdıktan sonra ise aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer bir deneyim yaşamanız olasıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2026/Mart/HelloCopilotSDK_03.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında herhangibir yapay zeka aracının konuşma penceresindeymişiz gibi değil mi? İşte bunu belki de domain odaklı hale getirip daha işler hale getirmek gerekir. Hemen &amp;ouml;rnek bir senaryodan bahsedelim. Belli bir domain i&amp;ccedil;erisindeki s&amp;uuml;re&amp;ccedil;lerin markdown formatında dok&amp;uuml;mante edilmiş olduğunu, dok&amp;uuml;manlar arasındaki kavramsal ilişkilerin y&amp;uuml;ksek başarımlı &lt;strong&gt;text-embedding&lt;/strong&gt; ara&amp;ccedil;ları ile vekt&amp;ouml;rel bir veritabanına alındığını ve bu veritabanını sorgulayabildiğimiz api noktalarımız olduğunu d&amp;uuml;ş&amp;uuml;nelim. Pekala bu servis noktaları birer ara&amp;ccedil; haline getirilebilir ve terminal yerine g&amp;ouml;rsel arabirimi olan bir istemci yazılıp analistlere sunulabilir. İşte size şirketinizin dok&amp;uuml;manlarını kullanarak merak edilen sorulara cevaplar veren bir chat-bot uygulaması.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Ne yazık ki bu senaryoları kurgulamak olduk&amp;ccedil;a maliyetli olabilir. Hatta şirket dışına &amp;ccedil;ıkmak istemeyenlerin local ortamlarda ele alacağı dil modelleri s&amp;ouml;z konusu olursa donanım ve işlem zamanı maliyetleri beklenmedik değerlere ulaşabilir. Tabii ki şimdilik. Dok&amp;uuml;manları kalitesi, sayısı, formatı, par&amp;ccedil;alama&lt;em&gt;(chunking)&lt;/em&gt; tekniği, veritabanının hızı, ne kadar g&amp;uuml;ncel tutulduğu gibi bir&amp;ccedil;ok ufak detayı hi&amp;ccedil; saymıyorum bile. Lakin bir&amp;ccedil;ok optimizasyon tekniği burada ele alınabilir durumda. Yakın geleceekte optimizasyon problemlerine farklı parametrelerin gireceği aşikar...diyerek bu yazımızı da sonlandırmak istiyorum.&lt;/p&gt;
&lt;p&gt;Bu &amp;ccedil;alışmada &lt;strong&gt;Copilot SDK&lt;/strong&gt;'yi .Net tabanlı uygulamalarda nasıl kullanabileceğimize dair &amp;ccedil;ok basit iki &amp;ouml;rnek ele aldık. Sonraki aşamada bir &lt;strong&gt;MCP server&lt;/strong&gt;'ın kullanımını ele alabiliriz de. Hatta kendi tasarladığımız bir &lt;strong&gt;MCP&lt;/strong&gt; server'da pekala işi renklendirir ve nasıl yapılıyor tadından bir i&amp;ccedil;erik ortaya &amp;ccedil;ıkabilir. Bakalım zaman ayırabilecek miyim. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="https://github.com/buraksenyurt/friday-night-programmer/tree/main/src/HelloCopilotSDK" target="_blank"&gt;İlk &amp;ouml;rneğimize ait github kodları&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="https://github.com/buraksenyurt/friday-night-programmer/tree/main/src/UseToolOnCopilotSDK" target="_blank"&gt;Tool kullandığımız ikinci &amp;ouml;rneğimize ait github kodları&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="https://github.com/buraksenyurt/friday-night-programmer/tree/main/src/StockStatsApi" target="_blank"&gt;Kobay api servisimize ait github kodları&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2026-03-03 14:40:00</pubDate>
  <slug>copilot-sdk-ile-ilk-deneyimler</slug>
  <tags>
    <tag>dotnet</tag>
    <tag>c-sharp</tag>
    <tag>copilot</tag>
    <tag>sdk</tag>
    <tag>ai</tag>
    <tag>claude-sonnet</tag>
    <tag>yapayzeka</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>