<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>FizzBuzz ile Basit Bir TDD Pratiği</title>
  <description>DevOps felsefesinin içerdiği önemli pratiklerden birisi de test süreçleridir ve bu noktada TDD(Test Driven Development) büyük önem taşımaktadır. TDD, temel olarak Unit Tests, Integration Tests, User Acceptance Tests gibi pratikleri içerir ve en azından bunların DevOps süreçlerine dahil edilmesi beklenir.  Ancak TDD ve DevOps söz konusu olunca daha bir çok test tekniği vardır. Smoke Testing, Penetration Testing, Stress Testing, A/B testing, Fuzz Testing ve Boundary Testing gibi.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;a href="https://medium.com/@burakselyum/devops-e%C4%9Fitiminden-akl%C4%B1mda-kalanlar-6853070d89d6" target="_blank"&gt;DevOps felsefesinin&lt;/a&gt; i&amp;ccedil;erdiği &amp;ouml;nemli pratiklerden birisi de test s&amp;uuml;re&amp;ccedil;leridir ve bu noktada TDD&lt;strong&gt;&lt;em&gt;(Test Driven Development)&lt;/em&gt;&lt;/strong&gt; b&amp;uuml;y&amp;uuml;k &amp;ouml;nem taşımaktadır. TDD, temel olarak Unit Tests, Integration Tests, User Acceptance Tests gibi pratikleri i&amp;ccedil;erir ve en azından bunların DevOps s&amp;uuml;re&amp;ccedil;lerine dahil edilmesi beklenir.&amp;nbsp; Ancak TDD ve DevOps s&amp;ouml;z konusu olunca daha bir &amp;ccedil;ok test tekniği vardır. Smoke Testing, Penetration Testing, Stress Testing, A/B testing, Fuzz Testing ve Boundary Testing gibi.&lt;/p&gt;
&lt;p&gt;Geliştiriciler olarak bizlerin TDD'ye yatkın olması bu a&amp;ccedil;ıdan &amp;ouml;nemlidir.&amp;nbsp;Yazılım geliştirmeye yeni&amp;nbsp;başlayanlar i&amp;ccedil;in TDD pratiklerini &amp;ouml;ğrenmenin g&amp;uuml;zel yollarından birisi de Code Kata'sı yapmaktır. Ben daha &amp;ouml;nceden verdiğim eğitimlerde de basit Code Kata'ları ile TDD pratiklerini anlatmaya &amp;ccedil;alışmıştım. Bu pratikler bize &amp;ouml;nemli&amp;nbsp;bir test odaklı bakış a&amp;ccedil;ısı disiplini kazandırmak i&amp;ccedil;in idealdir. Ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde şirkette yakaladığım yaklaşık 20 dakikalık bir boşluk olunca hemen FizzBuzz katasını bir hatırlayayım istedim.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;A&amp;ccedil;tım Spotify'ı başladım Toto'dan Africa ile kodlamaya. OBS ile ekran kaydı da almayı ihmal ettim. FizzBuzz katası temel olarak aşağıdaki sayı dizilimini i&amp;ccedil;eren kod par&amp;ccedil;asının geliştirmek i&amp;ccedil;in kullanılıyor.&lt;/p&gt;
&lt;p&gt;1,2,Fizz,4,Buzz,Fizz,7,8,Fizz,Buzz,11,Fizz,13,14,FizzBuzz,16,17,Fizz,19,Buzz,...&lt;/p&gt;
&lt;p&gt;Algoritma olduk&amp;ccedil;a basit. 3 ile tam b&amp;ouml;l&amp;uuml;nebilen sayılar i&amp;ccedil;in Fizz, 5 ile tam b&amp;ouml;l&amp;uuml;nebilen sayılar i&amp;ccedil;in Buzz, hem 3 hem 5 ile tam b&amp;ouml;l&amp;uuml;nebilen sayılar i&amp;ccedil;in FizzBuzz yazılması isteniyor. Dizideki diğer sayılar i&amp;ccedil;inse sayının kendisi yazılmalı. Pek tabii bu pratiği TDD felsefesi ile geliştirmemiz bekleniyor. &amp;Ouml;nce hata aldıracak şekilde testlere başlayıp, sonrasında bunları &amp;ccedil;alışır hale getirip en sonunda kodu refactor etmeyi &amp;ouml;ğreniyoruz. Temel olarak Red Green Blue ilkelerini kullanmaya &amp;ccedil;alışıyoruz. Hatta Fake değer ve &amp;ccedil;ok basit anlamda Triangulation'e yer veriyoruz.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;iframe src="https://www.youtube.com/embed/eyeSAFc4N3I?rel=0" width="640" height="360" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;Bu katayı siz de yapmaya &amp;ccedil;alışın. Daha &amp;ouml;nceden yapmadığınız bir kata ise adım adım bakarak ilerlemeli sonrasında ise bakmadan yapmaya &amp;ccedil;alışmalısınız. Umarım yazılım tarafında TDD ile ilk kez tanışan ve Code Kata'sı yapmak isteyen arkadaşlarımız i&amp;ccedil;in yararlı olur.&amp;nbsp;Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2018-08-09 07:52:00</pubDate>
  <slug>fizzbuzz-ile-basit-bir-tdd-pratigi</slug>
  <tags>
    <tag>tdd</tag>
    <tag>test-driven-development</tag>
    <tag>unit-test</tag>
    <tag>mstest</tag>
    <tag>dotnet</tag>
    <tag>dotnet-core</tag>
    <tag>net-core</tag>
    <tag>c#</tag>
    <tag>code-kata</tag>
    <tag>triangulation</tag>
    <tag>testing</tag>
  </tags>
  <categories>
    <category>CodeKata</category>
  </categories>
</post>