<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>TFS–Client Object Model için Hello World</title>
  <description>Team Foundation Server’ ın çok geniş bir kavram olduğunu ve bir makaleye sığdırılamayacak kadar çok özelliği bulunduğunu gönül rahatlığı ile ifade edebilirim .out loud Diğer yandan bugünkü yazımıza konu olan onun küçük görünen ama çok önemli işlerin altına imza eden bir parçası…</description>
  <content>&lt;p&gt;&lt;a href="/pics/commodore.jpg"&gt;&lt;img style="margin: 4px 0px; display: inline; float: right;" title="commodore" src="/pics/commodore_thumb.jpg" alt="commodore" width="280" height="210" align="right" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok eskidendi diyemeyeceğimiz kadar yakın bir zamanda, bilgisayar programcılarının ilah olduğu devirlerde, evimizin 37 ekran TV&amp;rsquo; lerine girmiş &lt;strong&gt;Commodore 64K&lt;/strong&gt;,&lt;strong&gt; Amiga&lt;/strong&gt; oyunlarına sabaha kadar vakit ayırdığımız yıllarda; ne &lt;strong&gt;Source Code Control &lt;/strong&gt;denen bir kavram vardı, ne de 9 kişilik askeri manga misali &amp;ccedil;alışan &lt;strong&gt;Scrum&lt;/strong&gt; ekipleri. Ancak teknoloji ve yazılım d&amp;uuml;nyası &amp;ouml;ylesine hızla ilerledi ki&amp;hellip;Koşar adımlarla geldiğimiz g&amp;uuml;n&amp;uuml;m&amp;uuml;zde, &amp;ouml;zellikle &lt;strong&gt;Enterprise&lt;/strong&gt; &amp;ccedil;apta y&amp;uuml;r&amp;uuml;t&amp;uuml;len projelerde, ekip olmadan hareket etmek neredeyse imkansız hale geldi.&lt;/p&gt;
&lt;p&gt;Yazılıma başladığım yıllarda &lt;strong&gt;Microsoft&lt;/strong&gt;&amp;nbsp;&lt;strong&gt;Visual SourceSafe&lt;/strong&gt; kullanan birisi olarak olayın uzun bir s&amp;uuml;re &amp;ouml;nce kod kontrol&amp;uuml; ve saklanmasının &amp;ouml;tesine ge&amp;ccedil;tiğini s&amp;ouml;ylesem sanırım hepimiz bu noktada hem fikir oluruz &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_179.png" alt="Winking smile" /&gt; Artık &lt;strong&gt;ALM&lt;/strong&gt;&lt;em&gt;(&lt;strong&gt;Application Lifecycle Management)&lt;/strong&gt;&lt;/em&gt; olarak ifade edilen ve &amp;uuml;r&amp;uuml;n geliştirmenin sadece koddan oluşmadığını ifade eden &amp;ouml;nemli bir kavram var hayatımızda. Hatta bu kavramın i&amp;ccedil;erisine giren &lt;strong&gt;MSF&lt;em&gt;(Microsoft Solution Frameworks)&lt;/em&gt;&lt;/strong&gt;,&amp;nbsp; &lt;strong&gt;SCRUM&lt;/strong&gt;, &lt;strong&gt;CMMI&lt;em&gt;(Capability Maturity Model Integration) &lt;/em&gt;&lt;/strong&gt;gibi pek &amp;ccedil;ok s&amp;uuml;re&amp;ccedil;te mevcut. M&amp;uuml;şteri ihtiya&amp;ccedil;larının daha hızlı daha &amp;ccedil;evik bir şekilde karşılanması esasına dayalı bu s&amp;uuml;re&amp;ccedil;ler &amp;ccedil;ok ama &amp;ccedil;ok pop&amp;uuml;ler.&lt;/p&gt;
&lt;p&gt;Tabii işin &amp;ouml;nemli bir par&amp;ccedil;asını da &lt;strong&gt;ALM&lt;/strong&gt; i&amp;ccedil;in kullanılan etkili ara&amp;ccedil;lar &amp;uuml;stlenmekte. &lt;strong&gt;Microsoft&lt;/strong&gt; bu alanda 2000li yılların ortalarından itibaryen &lt;strong&gt;Visual SourceSafe&lt;/strong&gt;&amp;rsquo; i terk edip &lt;strong&gt;Team Foundation Server&lt;/strong&gt;&amp;rsquo; a ge&amp;ccedil;iş yaptı. &lt;strong&gt;Team Foundation Server&lt;/strong&gt; şu an geldiği &lt;strong&gt;2012&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml; ile, yazılım alanındaki &amp;ouml;nemli bir ihtiyacı da karşılamakta: &lt;strong&gt;ALM&amp;rsquo; in dijital ortamda y&amp;ouml;netimi, y&amp;uuml;r&amp;uuml;t&amp;uuml;m&amp;uuml; ve kontrol&amp;uuml;&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Team Foundation Server&lt;/strong&gt;&amp;rsquo; ın &amp;ccedil;ok geniş bir kavram olduğunu ve bir makaleye sığdırılamayacak kadar &amp;ccedil;ok &amp;ouml;zelliği bulunduğunu g&amp;ouml;n&amp;uuml;l rahatlığı ile ifade edebilirim &lt;img class="wlEmoticon wlEmoticon-laughingoutloud" style="border-style: none;" src="/pics/wlEmoticon-laughingoutloud_7.png" alt="Laughing out loud" /&gt; Diğer yandan bug&amp;uuml;nk&amp;uuml; yazımıza konu olan onun k&amp;uuml;&amp;ccedil;&amp;uuml;k g&amp;ouml;r&amp;uuml;nen ama &amp;ccedil;ok &amp;ouml;nemli işlerin altına imza eden bir par&amp;ccedil;ası&amp;hellip;&lt;/p&gt;
&lt;h1&gt;&lt;strong&gt;Client Object Model &lt;/strong&gt;&lt;/h1&gt;
&lt;p&gt;Peki, &lt;a href="http://visualstudiogallery.msdn.microsoft.com/f30e5cc7-036e-449c-a541-d522299445aa" target="_blank"&gt;Microsoft adresinden download edebileceğiniz&lt;/a&gt; bu nesne modeli bize ne sunuyor? Olaya aşağıdaki grafik ile başlayalım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/comhello_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="comhello_1" src="/pics/comhello_1_thumb.png" alt="comhello_1" width="614" height="438" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Yukarıdaki grafik anlatımında &lt;strong&gt;TFS&lt;/strong&gt;&amp;rsquo; in uygulama modeline ait &amp;ouml;rnek bir dağılıma yer verilmektedir. Hepimiz esas itibariyle &lt;strong&gt;Team Foundation Server&lt;/strong&gt;&amp;rsquo; ın, n sayıda makine &amp;uuml;zerine fiziki olarak dağıtılabilen bir uygulama sunucusu ve &amp;ccedil;evre programlar b&amp;uuml;t&amp;uuml;n&amp;uuml; olduğunu biliyoruz. Bu anlamda &lt;strong&gt;TFS&lt;/strong&gt; uygulama sunucusuna bağlanan pek &amp;ccedil;ok istemci &amp;ccedil;eşidi de mevcut. &amp;Ouml;rneğin &lt;strong&gt;Continous&lt;/strong&gt; &lt;strong&gt;Integration&lt;/strong&gt; gibi modelleri destekleyen &lt;strong&gt;Build&lt;/strong&gt; planlarının y&amp;ouml;netildiği &lt;strong&gt;Build Server&lt;/strong&gt; veya bir geliştirici makinesi &amp;uuml;zerinde koşan &lt;strong&gt;Visual Studio&lt;/strong&gt; gibi.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;TFS&amp;rsquo; i bir d&amp;uuml;nyadan ziyade bir evren olarak nitelendirmek sanıyorum ki yanlış olmaz. Sadece kurulum sonrasında elimizin altında Application Server, Sharepoint ve SSRS&lt;em&gt;(Sql Server Reporting Services)&lt;/em&gt;, SSAS&lt;em&gt;(Sql Server Analysis Services)&lt;/em&gt;, Build Server gibi par&amp;ccedil;alar oluşmakta. Hatta sanallaştırma da işin i&amp;ccedil;erisinde girdiğinde Lab Management i&amp;ccedil;in gerekli ek bir &amp;ccedil;ok ortam t&amp;uuml;remekte. T&amp;uuml;m bunlara bir de Tool setlerini eklediğinizde G&amp;uuml;neş Sisteminin &amp;uuml;retmiş olabilirsiniz.&lt;/p&gt;
&lt;p&gt;Evren demiştik&amp;hellip;&amp;Ccedil;&amp;uuml;nk&amp;uuml; G&amp;uuml;neş Sistemi dışına &amp;ccedil;ıkarak farklı sistemleri de bu &amp;ccedil;embere dahil edebilirsiniz(&lt;em&gt;LINUX&amp;rsquo; dan UNIX&amp;rsquo;e, MacOS X&amp;rsquo; den Eclipse&amp;rsquo; e, Oracle&amp;rsquo; dan TIBCO&amp;rsquo; ya&amp;hellip;)&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Aslında &lt;strong&gt;TFS&lt;/strong&gt; sistemine dahil olabilecek istemcileri d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde &amp;ccedil;oğumuzun aklına standart bir geliştirici makinesi ve &amp;uuml;zerinde y&amp;uuml;kl&amp;uuml; olan &lt;strong&gt;Visual Studio&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml; gelmektedir. Oysaki &lt;strong&gt;TFS&lt;/strong&gt;&amp;rsquo; i kullanabilen istemcilerin b&amp;ouml;yle bir zorunluluğu yoktur. &lt;strong&gt;TFS&lt;/strong&gt;&amp;rsquo; in &amp;ccedil;evre birimler ile olan entegrasyonu adına aşağıdakileri ifade edebiliriz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Visual Studio IDE&lt;/strong&gt;&amp;rsquo; sinin bir par&amp;ccedil;ası olan &lt;strong&gt;Team Explorer&lt;/strong&gt; &amp;uuml;cretsizdir. Geliştirici olmayan birisi tarafından rahatlıkla kullanılabilir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;MS Office&lt;/strong&gt; uygulamaları &lt;strong&gt;TFS&lt;/strong&gt;&amp;rsquo; e entegre olabilir, dolayısıyla &lt;strong&gt;Work Item&lt;/strong&gt;&amp;rsquo; lar&lt;em&gt;(Se&amp;ccedil;tiğiniz s&amp;uuml;re&amp;ccedil; şablonuna g&amp;ouml;re değişiklik g&amp;ouml;sterebilir) &lt;/em&gt;&amp;ouml;rneğin &lt;strong&gt;Excel&lt;/strong&gt;&amp;rsquo; e indirebilir, g&amp;uuml;ncellenebilir&lt;em&gt;(Hatta Ms Project ile proje planınızı aktarabilirsiniz vs)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Takım &amp;uuml;yeleri &lt;strong&gt;Web&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; kullanıp &lt;strong&gt;TFS&lt;/strong&gt; ortamına bağlanabilir, &lt;strong&gt;ALM&lt;/strong&gt;&amp;rsquo; e dahil olabilir, &lt;strong&gt;Source Code&lt;/strong&gt;&amp;rsquo; ları g&amp;ouml;rebilir, hatta raporlama hizmetlerine&lt;em&gt;(SSRS-Sql Server Reporting Services)&lt;/em&gt; ulaşıp g&amp;uuml;ncel duruma bakabilir&lt;em&gt;(Elbette yetkilendirmelere bağlı olarak neleri g&amp;ouml;r&amp;uuml;p neleri g&amp;ouml;remeyeceklerini nerelere erişip nerelere erişemeyeceklerini belirleyebilirsiniz)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Sharepoint&lt;/strong&gt; portalı ile dok&amp;uuml;man bazlı proje akışları &lt;strong&gt;Team Project&lt;/strong&gt;&amp;rsquo; ler ile ilişkilendirebilir.&lt;/li&gt;
&lt;li&gt;&lt;a href="http://www.microsoft.com/en-us/download/details.aspx?id=30661" target="_blank"&gt;Team Explorer Everywhere&lt;/a&gt; sayesinde herhangi bir &lt;strong&gt;Eclipse IDE&lt;/strong&gt; ile de &lt;strong&gt;Team Explorer&lt;/strong&gt;&amp;rsquo; ın avantajlarından yararlanılabilir. Dolayısıyla &amp;ouml;rneğin &lt;strong&gt;Java &lt;/strong&gt;ekipleri &lt;strong&gt;TFS&lt;/strong&gt;&amp;rsquo; e entegre olabilir. &lt;strong&gt;*&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;Son olarak &lt;a href="http://visualstudiogallery.msdn.microsoft.com/bce06506-be38-47a1-9f29-d3937d3d88d6" target="_blank"&gt;MSSCCI Provider&lt;/a&gt; hizmetinden yararlanıp, yabancı ara&amp;ccedil;larında&lt;em&gt;(SQL Navigator, PowerBuilder, Solaris UNIX, LINUX, TIBCO vb)&lt;/em&gt; &lt;strong&gt;TFS&lt;/strong&gt;&amp;rsquo; e entegre olması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;strong&gt;*&lt;/strong&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;*&lt;/strong&gt; Son iki madde saha da tecr&amp;uuml;be edilmiştir &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_179.png" alt="Winking smile" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Esas itibariyle istemciler, uygulama sunucusu &amp;uuml;zerinde yer alan &lt;strong&gt;TFS Web servislerini&lt;/strong&gt; kullanırlar. Bu a&amp;ccedil;ıdan bakıldığında s&amp;ouml;z konusu servisleri t&amp;uuml;keten istemci uygulamalar bu işi &lt;strong&gt;Client Object Model&lt;/strong&gt; &amp;uuml;zerinden icra etmektedirler. Bu şu anlama da geliyor; TFS&amp;rsquo; i kullanacak kendi istemci uygulamalarımızı geliştirebiliriz.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;a href="https://tfs.visualstudio.com/" target="_blank"&gt;Online olarak da Cloud tabanlı hizmet veren TFS&lt;/a&gt;&amp;rsquo; in yakında zaman da &lt;a href="https://tfsodata.visualstudio.com/" target="_blank"&gt;OData protokol&amp;uuml;n&amp;uuml; baz alan servisleri&lt;/a&gt; yayınlandı. Bu &lt;a href="http://blogs.msdn.com/b/briankel/archive/2013/01/24/bringing-odata-to-team-foundation-service.aspx" target="_blank"&gt;konuda Brian Keller&amp;rsquo; ın şu adresteki yazısını&lt;/a&gt; incelemenizi &lt;span style="text-decoration: underline;"&gt;şiddetle&lt;/span&gt; tavsiye ederim.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;TFS&lt;/strong&gt; a&amp;ccedil;ısından olaya bakıldığında 3 farklı nesne modeli olduğunu ifade edebiliriz. Sunucu tarafı i&amp;ccedil;in &lt;strong&gt;Server Object Model&lt;/strong&gt;, istemci tarafı i&amp;ccedil;in bu yazımızda ele alacağımız&lt;strong&gt; Client Object Model&lt;/strong&gt; ve son olarak da &lt;strong&gt;Build Service&lt;/strong&gt;&amp;rsquo; lerin, &lt;strong&gt;COM&lt;/strong&gt; ile olan iletişiminde devreye giren&lt;strong&gt; Build Process Object Model&lt;/strong&gt;. Biz bu yazımızda sadece &lt;strong&gt;Client Object Model&lt;/strong&gt;&amp;rsquo; in nasıl kullanılabileceğini basit bir Hello World uygulaması ile irdelemeye &amp;ccedil;alışıyor olacağız.&lt;/p&gt;
&lt;h1&gt;Hello Client Object Model&lt;/h1&gt;
&lt;p&gt;Client Object Model&amp;rsquo; i y&amp;uuml;klendikten sonra &lt;strong&gt;.Net&lt;/strong&gt; projesine aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan &lt;strong&gt;Microsoft.TeamFoundation.Client&lt;/strong&gt; ve &lt;strong&gt;Microsoft.TeamFoundation.Common assembly&lt;/strong&gt; referanslarının eklenmesi yeterli olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/comhello_2.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="comhello_2" src="/pics/comhello_2_thumb.png" alt="comhello_2" width="270" height="295" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Olur da Reference penceresinde Extensions kısmında &amp;ccedil;ıkmazlar, bu durumda C:\Program Files\Microsoft Visual Studio 11.0\Common7\IDE\ReferenceAssemblies\v2.0\ adresine bir uğrayın derim &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_179.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Şimdi dilerseniz ilk &amp;ouml;rnek kodlarımızı yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Microsoft.TeamFoundation.Client; 
using Microsoft.TeamFoundation.Framework.Client; 
using Microsoft.TeamFoundation.Framework.Common; 
using System; 
using System.Configuration; 
using System.Net;

namespace HelloTFSCOM 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            Uri tfsAddress = new Uri(ConfigurationManager.AppSettings["TfsAddress"]);

            TfsConfigurationServer tfsServer = 
                TfsConfigurationServerFactory.GetConfigurationServer(tfsAddress); 
            tfsServer.Credentials = new NetworkCredential( 
                ConfigurationManager.AppSettings["Username"], 
                ConfigurationManager.AppSettings["Password"], 
                ConfigurationManager.AppSettings["Domain"] 
                ); 
            tfsServer.Connect(ConnectOptions.IncludeServices); 
            Console.WriteLine("TFS Server : {0}\n" 
                ,tfsServer.Name                
                );

            var teamCollections = tfsServer.CatalogNode.QueryChildren( 
                new[] { CatalogResourceTypes.ProjectCollection }, 
                false, CatalogQueryOptions.None);

            foreach (var teamCollection in teamCollections) 
            { 
                Guid teamCollectionId = new Guid(teamCollection.Resource.Properties["InstanceId"]); 
                TfsTeamProjectCollection teamProjectCollection = tfsServer.GetTeamProjectCollection(teamCollectionId);

                Console.WriteLine("Team Project Collection : {0}\n" 
                    ,teamProjectCollection.Name                    
                    );

                var teamProjects = teamCollection.QueryChildren( 
                    new[] { CatalogResourceTypes.TeamProject }, 
                    false, CatalogQueryOptions.None);

                foreach (CatalogNode teamProject in teamProjects) 
                { 
                    Console.WriteLine("Team Project {0}\n\tDescription {1}" 
                        ,teamProject.Resource.DisplayName 
                        ,teamProject.Resource.Description 
                        ); 
                } 
            } 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;TfsConfigurationServer&lt;/strong&gt; tipine ait bir nesne &amp;ouml;rneği oluşturuyoruz. Bunun i&amp;ccedil;in &lt;strong&gt;TfsConfigurationServerFactory&lt;/strong&gt; fabrika sınıfından ve &lt;strong&gt;GetConfigurationServer&lt;/strong&gt; metodundan yararlanılmaktadır. Operasyona gelen parametre &lt;strong&gt;TFS&lt;/strong&gt; sunucu adresidir. Bu adresi &lt;strong&gt;app.config/web.config&lt;/strong&gt; gibi bir dosyadan alabiliriz. &amp;Ccedil;ok doğal olarak &lt;strong&gt;TFS&lt;/strong&gt; sunucuları genellikle &lt;strong&gt;domain&lt;/strong&gt; kontrol&amp;uuml; altında kurulurlar. Bu sebepten &lt;strong&gt;domain&lt;/strong&gt; i&amp;ccedil;erisinde yetkisi olan kullanıcıların sunucuya erişebilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bu sebepten şirket ortamlarında kullanıcı adı ve şifre haricinde bir de &lt;strong&gt;domain&lt;/strong&gt; bilgisine ihtiya&amp;ccedil; vardır. Kod par&amp;ccedil;asında bu 3 bilgi, &lt;strong&gt;NetworkCredential&lt;/strong&gt; sınıfına ait bir nesne &amp;ouml;rneğinde toplanarak, &lt;strong&gt;Credentials&lt;/strong&gt; &amp;ouml;zelliğine atanmıştır.&lt;/p&gt;
&lt;p&gt;Sonraki adımlarda sırasıyla bir bağlantı işlemi ve sonrasında da &lt;strong&gt;TFS&lt;/strong&gt; sunucusu &amp;uuml;zerinde yer alan &lt;strong&gt;Team Project Collection&lt;/strong&gt; i&amp;ccedil;eriklerinin sorgulanması işlemi ger&amp;ccedil;ekleştirilmektedir. Aslında sorgulamaların ortak noktası, dikkat edileceği &amp;uuml;zere &lt;strong&gt;QueryChildren&lt;/strong&gt; isimli bir metottan yararlanılması ve neyin sorgulanacağını belirtmek i&amp;ccedil;in &lt;strong&gt;CatalogResourceTypes&lt;/strong&gt; &lt;strong&gt;enum&lt;/strong&gt; sabitinden yararlanılmasıdır. Bu sabitin alacağı değerleri g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;zde aslında bu seviyede neleri sorgulayabileceğinizi de anlamış oluyorsunuz &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_84.png" alt="Smile" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/comhello_4.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="comhello_4" src="/pics/comhello_4_thumb.png" alt="comhello_4" width="597" height="493" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dolayısıyla &lt;strong&gt;TFS&lt;/strong&gt; &amp;uuml;zerinde olduk&amp;ccedil;a fazla nesneyi sorgulayabiliriz. &amp;Ouml;rneğimizde sadece &lt;strong&gt;Team&lt;/strong&gt;&amp;nbsp;&lt;strong&gt;Project&lt;/strong&gt;&amp;nbsp;&lt;strong&gt;Collection&lt;/strong&gt; ve i&amp;ccedil;erisinde yer alan &lt;strong&gt;Team&lt;/strong&gt; &lt;strong&gt;Project&lt;/strong&gt; &amp;ouml;rnekleri değerlendirilmiştir. Oysaki test ortamından raporlara, Sharepoint Proje portallerinden SQL veri tabanı &amp;ouml;rneklerine kadar pek &amp;ccedil;ok i&amp;ccedil;erik sorgulanabilmektedir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek uygulamayı &amp;ccedil;alıştırdığımızda ben aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;ları aldım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/comhello_7_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="comhello_7" src="/pics/comhello_7_thumb_1.png" alt="comhello_7" width="588" height="187" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bu &amp;ouml;rnek &lt;strong&gt;tfs.visualstudio.com&lt;/strong&gt; &amp;uuml;zerinde oluşturduğum bir koleksiyona aittir. &lt;strong&gt;seddulbahir.visualstudio.com&lt;/strong&gt; adresinden ulaşabildiğim koleksiyon i&amp;ccedil;erisinde bir ka&amp;ccedil; deneme projesi oluşturdum. Tahmin edeceğiniz &amp;uuml;zere &lt;strong&gt;Windows Live ID&lt;/strong&gt; ile burada yer almanız ve eğer bir değişiklik olmadıysa 5 kişiye kadar &amp;uuml;cretsiz olarak yararlanmanız m&amp;uuml;mk&amp;uuml;n. Yani 5 kişilik bir ekibiniz var ise hemen bir TFS hesabı a&amp;ccedil;ıp &amp;ccedil;alışmaya başlayabilirsiniz &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_179.png" alt="Winking smile" /&gt; Bu arada Windows Live ID ile bağlandığımız bu sistemde Credential i&amp;ccedil;in bir Domain bilgisi vermenize gerek yoktur.&lt;/p&gt;
&lt;h1&gt;TFS Proje İskeleti&lt;/h1&gt;
&lt;p&gt;Aslında bu tip bir &amp;ouml;rneği işletmeden &amp;ouml;nce &lt;strong&gt;TFS&lt;/strong&gt;&amp;rsquo; in genel olarak proje iskelet yapısını bilmekte de yarar vardır. Aşağıdaki şekilde bu durum kısaca &amp;ouml;zetlenmeye &amp;ccedil;alışılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/comhello_3.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="comhello_3" src="/pics/comhello_3_thumb.png" alt="comhello_3" width="636" height="427" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Normal şartlarda &lt;strong&gt;TFS&lt;/strong&gt; i kurduğumuzda&lt;em&gt;(ki install işlemi eğer farm &amp;uuml;zerine kurulum yapıyorsanız biraz sıkıntılı olabilir &lt;img class="wlEmoticon wlEmoticon-confusedsmile" style="border-style: none;" src="/pics/wlEmoticon-confusedsmile_29.png" alt="Confused smile" /&gt;)&lt;/em&gt; hep &lt;strong&gt;Default Collection&lt;/strong&gt; &amp;uuml;zerinden &amp;ccedil;alışırız. &lt;strong&gt;Default Collection&lt;/strong&gt; aslında &lt;strong&gt;SQL&lt;/strong&gt; tarafında da bir veri tabanına karşılık gelmektedir. Oysaki 100lerce projeye sahip olup, bunların &amp;ccedil;oğunu &lt;strong&gt;Enterprise&lt;/strong&gt; seviyede inşa eden firmalarda birden fazla &lt;strong&gt;Team Project Collection&lt;/strong&gt; kullanıldığı da g&amp;ouml;r&amp;uuml;lmektedir. Her &lt;strong&gt;Team Project Collection&lt;/strong&gt; aslında bir &lt;strong&gt;Team Project&lt;/strong&gt; ailesini işaret etmektedir. Bir başka deyişle bir &lt;strong&gt;Team Project Collection i&amp;ccedil;erisinde n sayıda Team Project&lt;/strong&gt; barındırabilirsiniz. &amp;Ccedil;ok doğal olarak her &lt;strong&gt;bir Team Project de kendi i&amp;ccedil;erisinde birden fazla proje&lt;/strong&gt; barındırabilir.&lt;/p&gt;
&lt;p&gt;Ne yazık ki &lt;strong&gt;Team Project&lt;/strong&gt; ile &lt;strong&gt;Project&lt;/strong&gt; kavramları zaman zaman birbirlerine karışabilmektedir. Aslında bu ayırım uygulanmak istenen s&amp;uuml;re&amp;ccedil; noktasında kendisini daha belirgin g&amp;ouml;sterir. Nitekim bir &lt;strong&gt;Team Project&lt;/strong&gt; oluştururken &lt;strong&gt;Scrum, MSF, CMMI&lt;/strong&gt; veya &amp;ouml;zelleştirilmiş bir &lt;strong&gt;Process Template&lt;/strong&gt; se&amp;ccedil;ilmelidir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Var olan bir Process Template&amp;rsquo; i indirip, XML i&amp;ccedil;erikleri ile oynayabilir ve şirket k&amp;uuml;lt&amp;uuml;r&amp;uuml;n&amp;uuml;ze uygun farklı bir s&amp;uuml;re&amp;ccedil; şablonu oluşturabilirsiniz. Bu anlamda &lt;a href="http://visualstudiogallery.msdn.microsoft.com/b1ef7eb2-e084-4cb8-9bc7-06c3bad9148f" target="_blank"&gt;Microsoft&amp;rsquo; un Power Tools&lt;/a&gt; &amp;uuml;r&amp;uuml;n&amp;uuml;n&amp;uuml; kullanmanızı &amp;ouml;neririm. Visual Studio 2012&amp;rsquo; ye bir eklenti şeklinde gelip şablonları g&amp;ouml;rsel olarak y&amp;ouml;netebilmenize olanak tanımaktadır.&lt;a href="/pics/comhello_6.png"&gt; &lt;br /&gt; &lt;br /&gt;&lt;img style="margin: 4px 0px; display: inline;" title="comhello_6" src="/pics/comhello_6_thumb.png" alt="comhello_6" width="562" height="138" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Yani &lt;strong&gt;ALM&lt;/strong&gt; yoğurt yiyiş şekli belirlenmelidir. Sonrasında ise bu &lt;strong&gt;Team Project&lt;/strong&gt; i&amp;ccedil;erisine dahil olan ve aynı şekilde yoğurt yiyecek olan ekip elemanları, n sayıda ve n &amp;ccedil;eşitte proje &amp;uuml;zerinde &amp;ccedil;alışabilir. Bu projeler .Net uygulamaları olabileceği gibi .Net dışı ortamlar da olabilir. &amp;Ouml;nemli olan t&amp;uuml;m bu projelerin aynı &lt;strong&gt;Team Project&lt;/strong&gt; i&amp;ccedil;erisinde dahil olmalarıdır.&lt;/p&gt;
&lt;h1&gt;WorkItemStore ile Work Item &amp;Ouml;ğelerini Sorgulamak&lt;/h1&gt;
&lt;p&gt;Şimdi &amp;ouml;rneği biraz daha ilerletelim ve diğer &lt;strong&gt;TFS Web Service&lt;/strong&gt;&amp;rsquo; lerinden nasıl yararlanabileceğimize bakalım. S&amp;ouml;z gelimi bir &lt;strong&gt;Team Project&lt;/strong&gt; i&amp;ccedil;in s&amp;ouml;z konusu &lt;strong&gt;Work Item&lt;/strong&gt;&amp;rsquo; ları &amp;ccedil;ekmeye &amp;ccedil;alışalım. Bu ama&amp;ccedil;la &amp;ouml;rnek kodlarımızı aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;WorkItemStore tipi Microsoft.TeamFoundation.WorkItemTracking.Client.dll assembly&amp;rsquo; ı i&amp;ccedil;erisinde yer aldığından s&amp;ouml;z konusu k&amp;uuml;t&amp;uuml;phanenin projeye referans edilmesi gerekmektedir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;Work Item&lt;/strong&gt;&amp;rsquo; ların sorgulanabilmesi i&amp;ccedil;in &lt;strong&gt;WorkItemStore&lt;/strong&gt; servisinden yararlanılabilir. Bu servise ait bir nesne &amp;ouml;rneğini elde etmek i&amp;ccedil;inse var olan bir&lt;strong&gt; TFS Team Project Collection&lt;/strong&gt;&amp;rsquo; dan faydalanılabilir. Bu sebepten &amp;ouml;rnek kod par&amp;ccedil;asında &lt;strong&gt;TfsTeamProjectCollection&lt;/strong&gt; tipinden bir &amp;ouml;rnek &amp;uuml;retilmiştir. Adres kısmındaki &lt;strong&gt;/DefaultCollection&lt;/strong&gt; ilavesine l&amp;uuml;tfen dikkat edelim. Bu şekilde &lt;strong&gt;DefaultCollection&lt;/strong&gt;&amp;rsquo; ı işaret eden bir &amp;ouml;rnek oluşturmuş bulunuyoruz. Sonrasında &lt;strong&gt;tfsCollection&lt;/strong&gt; değişkeni &amp;uuml;zerinden &lt;strong&gt;GetService&lt;/strong&gt; fonksiyonunu &amp;ccedil;ağırmaktayız. Dikkat edileceği &amp;uuml;zere fonksiyon parametre olarak &lt;strong&gt;WorkItemStore&lt;/strong&gt; tipini almaktadır. Bu durumda &lt;strong&gt;TFS&lt;/strong&gt; Sunucusuna şunu s&amp;ouml;ylemiş oluyoruz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&lt;em&gt;Ey o adresteki DefaultCollection. Bana, tuttuğun Work Item &amp;ouml;rneklerini sorgulayabilmem i&amp;ccedil;in bir servis referansı verrrr!!!&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından artık &lt;strong&gt;Work Item&lt;/strong&gt;&amp;rsquo; ların sorgulanmasına başlanıyor. Aslında tipik bir &lt;strong&gt;SQL&lt;/strong&gt; sorgusu diyebileceğimiz ama literat&amp;uuml;rde &lt;strong&gt;WIQL&lt;em&gt;(WorkItem Query Language)&lt;/em&gt;&lt;/strong&gt; olarak ge&amp;ccedil;en ifademizi &lt;strong&gt;Query&lt;/strong&gt; metoduna parametre olarak veriyoruz. Sorgumuz son derece basit. &lt;strong&gt;ARGE&lt;/strong&gt; isimli &lt;strong&gt;Team Project&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &lt;strong&gt;WorkItem&lt;/strong&gt;&amp;rsquo; lardan &lt;strong&gt;Task &lt;/strong&gt;tipinden olanları, &amp;ouml;nce &lt;strong&gt;State&lt;/strong&gt;&amp;rsquo; e g&amp;ouml;re &lt;strong&gt;A&amp;hellip;Z &lt;/strong&gt;sırasında, sonrasında da son değişiklik zamanına&lt;em&gt;(Changed Date)&lt;/em&gt; g&amp;ouml;re &lt;strong&gt;Z&amp;hellip;A&lt;/strong&gt; sırasında talep ediyoruz. Sonu&amp;ccedil; olarak benim deneme ama&amp;ccedil;lı olarak kullandığım &lt;strong&gt;ARGE&lt;/strong&gt; isimli &lt;strong&gt;Team Project&lt;/strong&gt; i&amp;ccedil;in aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;ları elde ettiğimi ifade edebilirim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/comhello_5.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="comhello_5" src="/pics/comhello_5_thumb.png" alt="comhello_5" width="316" height="295" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;ARGE&lt;/strong&gt; projesine ait &lt;strong&gt;Task&lt;/strong&gt; tipinden &lt;strong&gt;Work Item&lt;/strong&gt; &amp;ouml;ğelerinin başlıkları&lt;em&gt;(Title)&lt;/em&gt;, g&amp;uuml;ncel durumları&lt;em&gt;(State) &lt;/em&gt;ve son değişiklik zamanları&lt;em&gt;(Changed Date)&lt;/em&gt; elde edilebilmiştir. Bu noktada neler yapabileceğinizi ifade etmek istediğimizde sadece &lt;strong&gt;Team Explorer&lt;/strong&gt; ile veya &lt;strong&gt;TFS&lt;/strong&gt;&amp;rsquo; in Web aray&amp;uuml;z&amp;uuml; ile yapabildiklerinizi d&amp;uuml;ş&amp;uuml;nmeniz kafi olacaktır.&lt;em&gt;(&lt;strong&gt;WIQL&lt;/strong&gt;&amp;rsquo; in &amp;ouml;rnek kullanımları ve 5 par&amp;ccedil;adan oluşan iskelet yapısının teknik detayı i&amp;ccedil;in &lt;/em&gt;&lt;a href="http://msdn.microsoft.com/en-us/library/vstudio/bb130306.aspx" target="_blank"&gt;&lt;em&gt;MSDN adresini ziyaret&lt;/em&gt;&lt;/a&gt;&lt;em&gt; edebilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Microsoft.TeamFoundation.Client; 
using Microsoft.TeamFoundation.Framework.Client; 
using Microsoft.TeamFoundation.Framework.Common; 
using Microsoft.TeamFoundation.WorkItemTracking.Client; 
using System; 
using System.Configuration; 
using System.Net;

namespace HelloTFSCOM 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            #region Bir Team Project Collection' daki Task' ların &amp;Ccedil;ekilmesi

            TfsTeamProjectCollection tfsCollection = new TfsTeamProjectCollection( 
                new Uri(ConfigurationManager.AppSettings["TfsAddress"] + "/DefaultCollection")); 
            tfsCollection.Credentials = new NetworkCredential( 
                ConfigurationManager.AppSettings["Username"], 
                ConfigurationManager.AppSettings["Password"] 
                , ConfigurationManager.AppSettings["Domain"] 
                );

            WorkItemStore store = (WorkItemStore)tfsCollection.GetService(typeof(WorkItemStore));

           WorkItemCollection queryResults = store.Query(@" 
                           Select [State], [Title] 
                           From WorkItems 
                           Where [Work Item Type] = 'Task' and [Team Project]='ARGE' 
                           Order By [State] Asc, [Changed Date] Desc");

            for (int i = 0; i &amp;lt; queryResults.Count; i++) 
            { 
                Console.WriteLine("{0}\n{1}\n{2}\n",queryResults[i].Title, queryResults[i].State, queryResults[i].ChangedDate.ToString());            
            }

            #endregion Bir Team Project Collection' daki Task' ların &amp;Ccedil;ekilmesi 
        } 
    } 
}&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;WorkItemStore dışında kullanılabilen pek &amp;ccedil;ok servis vardır. &amp;Ouml;rneğin ISecurityService, ILocationService, IBuildServer, IProcessTemplates, VersionControlServer vb&amp;hellip;S&amp;ouml;z konusu servislerden bazıları Team Project Collection, bazıları da TFS Server seyiyesinde kullanılabilmektedir. &lt;a href="http://msdn.microsoft.com/en-us/library/vstudio/bb286958.aspx#services" target="_blank"&gt;Detaylı bilgiye bu adresten ulaşabilirsiniz&lt;/a&gt;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bu yazımızda &lt;strong&gt;TFS Client Object Model&lt;/strong&gt; ile basit de olsa el sıkışmaya &amp;ccedil;alıştık. Elbetteki &amp;ouml;rneği devam ettirip ilerletmek sizin elinizde. S&amp;ouml;z gelimi iyi bir antrenman olarak &lt;strong&gt;Visual Studio Team Explorer&lt;/strong&gt; penceresinin bir benzerini ve hatta &lt;strong&gt;Windows Phone 8&lt;/strong&gt; veya &lt;strong&gt;Windows 8&lt;/strong&gt; &amp;uuml;zerinde &amp;ccedil;alışacak şekilde zengin kullanıcı deneyimi sunacak olan bir t&amp;uuml;revini geliştirebilirsiniz. Dokunmatikliği işin i&amp;ccedil;erisine katın &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_179.png" alt="Winking smile" /&gt; B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2013%2f1%2fHelloTFSCOM.zip"&gt;HelloTFSCOM.zip (181,68 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2013-03-15 02:30:00</pubDate>
  <slug>TFS-2012-Client-Object-Model-icin-Hello-World</slug>
  <tags>
    <tag>tfs</tag>
    <tag>team-foundation-server</tag>
    <tag>team-explorer-everywhere</tag>
    <tag>client-object-model</tag>
    <tag>tfs-2012</tag>
    <tag>source-control</tag>
    <tag>work-item</tag>
    <tag>task</tag>
    <tag>scrum</tag>
    <tag>cmmi</tag>
    <tag>msf</tag>
    <tag>workitemstore</tag>
    <tag>server-object-model</tag>
    <tag>build-process-object-model</tag>
  </tags>
  <categories>
    <category>Team Foundation Server</category>
  </categories>
</post>