<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tek Fotoluk İpucu 133 - Yüklü OLEDB Provider Listesinin Bulunması</title>
  <description>Malumunuz büyük çaplı sistemler kolay kolay yenilenmiyorlar. Ancak teknolojik gereklilikler ve değişen ihtiyaçlar ister istemez bu yaşayan organizmaların yeni sunucular üzerinde hayata devam etmelerini gerektirebiliyor. Yeniden yazma maliyetlerinin yüksek olduğu durumlarda var olan sistemin kullandığı pek çok bileşenin de bu sunucular ile uyumlu olması gerekiyor(bekleniyor). Uyumlu olmayanların yerine geçici çözümler uygulanıyor. Tabii mümkün mertebede. Bazen yeni sunuculara taşınan sistem üzerinde yıllardır yaşamını sürdüren C,C++ gibi derlendikten sonra pek de geri çevrilip içeriği görülemeyeccek kodlar da söz konusu oluyor. Böyle bir durumla karşı karşıya kalırsanız vay halinize. Ben ve değerli ekip arkadaşım bu durumdam çok çektik.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Malumunuz b&amp;uuml;y&amp;uuml;k &amp;ccedil;aplı sistemler kolay kolay yenilenmiyorlar. Ancak teknolojik gereklilikler ve değişen ihtiya&amp;ccedil;lar ister istemez bu yaşayan organizmaların yeni sunucular &amp;uuml;zerinde hayata devam etmelerini gerektirebiliyor. Yeniden yazma maliyetlerinin y&amp;uuml;ksek olduğu durumlarda var olan sistemin kullandığı pek &amp;ccedil;ok bileşenin de bu sunucular ile uyumlu olması gerekiyor&lt;em&gt;(bekleniyor)&lt;/em&gt;. Uyumlu olmayanların yerine ge&amp;ccedil;ici &amp;ccedil;&amp;ouml;z&amp;uuml;mler uygulanıyor. Tabii m&amp;uuml;mk&amp;uuml;n mertebede. Bazen yeni sunuculara taşınan sistem &amp;uuml;zerinde yıllardır yaşamını s&amp;uuml;rd&amp;uuml;ren C,C++ gibi derlendikten sonra pek de geri &amp;ccedil;evrilip i&amp;ccedil;eriği g&amp;ouml;r&amp;uuml;lemeyeccek kodlar da s&amp;ouml;z konusu oluyor. B&amp;ouml;yle bir durumla karşı karşıya kalırsanız vay halinize. Ben ve değerli ekip arkadaşım bu durumdam &amp;ccedil;ok &amp;ccedil;ektik.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Gelelim ipucumuzun konusuna. Yukarıdaki gibi bir senaryo ile karşılaştığımızı d&amp;uuml;ş&amp;uuml;nelim. Bu kez mesele yeni &lt;strong&gt;Windows Server 2012&lt;/strong&gt; sunucusunda &lt;strong&gt;MSDAORA&lt;/strong&gt; isimli &lt;strong&gt;OLEDB&lt;/strong&gt; provider' ını kullanan &lt;strong&gt;ASP&lt;/strong&gt; kod par&amp;ccedil;alarının &amp;ccedil;alışmaması&lt;em&gt;(Aslında &amp;ccedil;alışmama sebebi b&amp;uuml;y&amp;uuml;k ihtimalle ilgili nesnenin Windows Server 2012 de zaten desteklenmemesi)&lt;/em&gt;&amp;nbsp;&amp;Ouml;ncelikle bu sunucuda hangi&lt;strong&gt; OLEDB provider&lt;/strong&gt;' larının y&amp;uuml;kl&amp;uuml; olduğunu &amp;ouml;ğrenmeye &amp;ccedil;alışarak işe başlamaya karar verdik. Siz olsanız bunun i&amp;ccedil;in ne yapardınız. Aşağıdaki gibi bir kod par&amp;ccedil;ası olabilir mi?&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/08/tfi133n.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında tek yapılan şey &lt;strong&gt;OleDbEnumerator&lt;/strong&gt; sınıfının &lt;strong&gt;static GetRootEnumerator&lt;/strong&gt; metodu ile d&amp;ouml;nen listede hareket etmek ve o anki &amp;ouml;ğenin t&amp;uuml;m bilgilerini ekrana yazdırmak. B&amp;ouml;ylece geldik bir ipucunun daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-09-15 21:01:00</pubDate>
  <slug>tek-fotoluk-ipucu-133-yuklu-oledb-provider-listesinin-bulunmasi</slug>
  <tags>
    <tag>c#</tag>
    <tag>adonet</tag>
    <tag>ado</tag>
    <tag>provider</tag>
    <tag>oledb</tag>
    <tag>enumerator</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>