<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Client Side SponshorShip</title>
  <description>Son makalemizde, remoting uygulamalarında uzak nesnelere ait kiralama sürelerinin (Lease Time) nasıl yönetilebileceğinden bahsetmiştik. Bununla birlikte bir uzak nesnenin kiralama süresinin sonlamasının ardından gelecek olan metod çağrılarında istemcilerin olmayan bir referansa erişmeye çalıştığını ve bu nedenlede çalışma zamanı istisnaları ile karşılaşabileceklerini görmüştük. Bu makalemizde, kiralama sürelerini otomatik olarak uzatmak için istemci taraflı destek modelinden (Client Side sponsorShip) nasıl yararlanabileceğimizi incemeleye çalışacağız.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Son makalemizde, remoting uygulamalarında uzak nesnelere ait kiralama s&amp;uuml;relerinin (Lease Time) nasıl y&amp;ouml;netilebileceğinden bahsetmiştik. Bununla birlikte bir uzak nesnenin kiralama s&amp;uuml;resinin sonlamasının ardından gelecek olan metod &amp;ccedil;ağrılarında istemcilerin olmayan bir referansa erişmeye &amp;ccedil;alıştığını ve bu nedenlede &amp;ccedil;alışma zamanı istisnaları ile karşılaşabileceklerini g&amp;ouml;rm&amp;uuml;şt&amp;uuml;k. Bu makalemizde, kiralama s&amp;uuml;relerini otomatik olarak uzatmak i&amp;ccedil;in istemci taraflı destek modelinden (Client Side sponsorShip) nasıl yararlanabileceğimizi incemeleye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;SponsorShip mimarisi temel olarak, uzak nesnelerin yaşam s&amp;uuml;relerini otomatik olarak arttırmak i&amp;ccedil;in kullanılır. İki şekilde uygulanabilir. Bunlardan birisi istemci tarafında diğeri ise sunucu tarafında yapılabilen destekleme sistemidir. Her iki destek t&amp;uuml;r&amp;uuml;n&amp;uuml;nde birbirlerine g&amp;ouml;re avantajları ve dezavantajları vardır. İstemci taraflı destek modelinde (Client Side Sponsorship), istemcinin kullandığı uzak nesnenin kiralama y&amp;ouml;neticisi (Lease Manager) ile, ISponsor aray&amp;uuml;z&amp;uuml;nden t&amp;uuml;retilen bir sınıfın iş birliği s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;Bu işbirliğinin bir sonucu olarak, uzak nesneye ait referansın yaşam s&amp;uuml;resini doldurması halinde, istemci taraflı sponsor otomatik olarak devreye girecek ve kiralama s&amp;uuml;resini uzatacaktır. Bu modelin &amp;ccedil;alışabilmesi i&amp;ccedil;in, sunucudan gelen geri bildirimlerin(Callbacks) istemci tarafından ele alınabilmesi gerekmektedir. Bu da istemcinin yeri geldiğinde sunucu isteklerini kabul eden bir davranış sergilemesi demektir. İşte bu nedenle, &amp;ouml;zellikle firewall gibi g&amp;uuml;veli sistemlerin arkasında kalan istemcilere sunucunun erişememesi halinde istemci taraflı destek modeli bir işe yaramayacaktır. Bu istemci taraflı destek sistemi a&amp;ccedil;ısından bir dezavantaj olarak g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;Peki istemci taraflı modeli nasıl uygulayacağız? Bunu anlamanın en iyi yolu basit bir &amp;ouml;rnek &amp;uuml;zerinden gitmek ile olacaktır. Teorik olarak yapmak istediğimiz şey, istemcilerin kullandığı uzak nesnelere ait kirlama s&amp;uuml;relerini otomatik olarak arttırabilmek ve b&amp;ouml;ylece &amp;ccedil;alışma zamanında meydana gelecek kayıp referans &amp;ccedil;ağrılarının &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ebilmektir. İlk olarak uzak nesnemizi geliştirmekle işe başlayalım. Uzak nesnemizin aşağıda g&amp;ouml;r&amp;uuml;len modele sahip olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk156_1.gif" alt="" width="207" height="199" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class RemoteObj : MarshalByRefObject
{
    public RemoteObj()
    {
        Console.WriteLine("Uzak nesne yapıcı metodu &amp;ccedil;ağırıldı...");
    }

    public int GetTotal(int orderID)
    {
        return orderID * 100;
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi vakit kaybetmeden sunucu uygulamamızıda aşağıdaki gibi geliştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
    RemotingConfiguration.Configure("..\\..\\ServerApp.config",true);
    Console.WriteLine("Sunucu dinlemede...Kapatmak i&amp;ccedil;in bir tuşa basın...");
    Console.ReadLine();
}&lt;/pre&gt;
&lt;p&gt;Sunucu uygulamamıza ait remoting ayarlarını bir konfigurasyon dosyasında tutacağız. Dikkat ederseniz, kiralama s&amp;uuml;resini m&amp;uuml;mk&amp;uuml;n olduğunca kısa tutmaya &amp;ccedil;alıştık. Uzak nesneye ait bir referans oluşturulduktan sonra yaklaşık olarak 3 saniyelik bir &amp;ouml;mr&amp;uuml; olacaktır. Diğer taraftan remoting mimarimizi CAO (Client Activated Object) modelini baz alarak geliştirdik. Bu nedenle istemci tarafında bir uzak nesne &amp;ouml;rneği oluşturulur oluşturulmaz, sunucu &amp;uuml;zerinde bu nesneye bağlı bir referans hemen oluşturulacaktır.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
    &amp;lt;configuration&amp;gt;
        &amp;lt;system.runtime.remoting&amp;gt;
            &amp;lt;application&amp;gt;
                &amp;lt;service&amp;gt;
                    &amp;lt;activated type="RemoteLib.RemoteObj,RemoteLib"/&amp;gt;
                &amp;lt;/service&amp;gt;
                &amp;lt;lifetime leaseTime="3" renewOnCallTime="1" leaseManagerPollTime = "1" /&amp;gt;
                &amp;lt;channels&amp;gt;
                    &amp;lt;channel ref="tcp" port="4567"&amp;gt;
                        &amp;lt;serverProviders&amp;gt;
                            &amp;lt;formatter ref="binary" typeFilterLevel="Full"/&amp;gt;
                        &amp;lt;/serverProviders&amp;gt;
                        &amp;lt;clientProviders&amp;gt;
                            &amp;lt;formatter ref="binary"/&amp;gt;
                        &amp;lt;/clientProviders&amp;gt;
                    &amp;lt;/channel&amp;gt;
                &amp;lt;/channels&amp;gt;
            &amp;lt;/application&amp;gt;
        &amp;lt;/system.runtime.remoting&amp;gt;
    &amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu konfigurasyon dosyasında standart ayarların yanında &amp;ouml;zellikle channel boğumu i&amp;ccedil;erisinde yer alan serverProviders ve clientProviders isimli alt boğumlar hemen g&amp;ouml;ze &amp;ccedil;arpmaktadır. Bu alt boğumlar aynen istemci tarafındada kullanılmak zorundadır.&lt;/p&gt;
&lt;table id="table58" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Konfigurasyon dosyasında serverProviders ve clientProviders boğumlarını kullanmassak (ki istemci destek modelinde bunları hem istemci hem sunucu konfigurasyon dosyalarında kullanmalıyız) g&amp;uuml;venlik ile ilgili bir &amp;ccedil;alışma zamanı hatasını aşağıdaki gibi alırız.&amp;nbsp; &lt;br /&gt; &lt;br /&gt; &lt;/em&gt;&lt;img src="/makale/images/mk156_4.gif" alt="" width="402" height="66" border="0" /&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Gelelim istemci uygulamamıza. İstemci uygulamamızı ilk olarak aşağıdaki gibi herhangibir destek nesnesi (sponsor object) olmadan geliştireceğiz. İstemci uygulamamız basit olarak, uzak nesneye ait bir nesne &amp;ouml;rneğini client activated object modelinde oluşturmaktadır. Daha sonra istemci, uzak nesne referansını kullanarak GetTotal isimli metodu arka arkaya 10 defa &amp;ccedil;ağırmaktadır. Bu metod &amp;ccedil;ağırımlarının her birinde istemci uygulama yaklaşık olarak 3 saniye s&amp;uuml;reyle uyutulmaktadır. Dolayısıyla bu gecikmeler, uzak referansın kiralama s&amp;uuml;resinin dolmasına ve bu s&amp;uuml;re dolmadan metod &amp;ccedil;ağırımlarının tamamlanamamasına neden olacaktır. İşte buda bizim sponsor y&amp;ouml;netimine gitmemizi sağlayacak etkendir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
    RemoteObj rm = null;

    try
    {
        RemotingConfiguration.Configure("..\\..\\ClientApp.config", true);
        rm = new RemoteObj();
  
        for (int i = 0; i &amp;lt; 10; i++)
        {
            Console.WriteLine(i+"nci &amp;ccedil;ağrı..."+rm.GetTotal(i).ToString());
            System.Threading.Thread.Sleep(3000);
        }
    }
    catch (Exception err)
    {
        Console.WriteLine(err.Message);
    }
    finally
    {
        
    }
    Console.WriteLine("Programı kapatmak i&amp;ccedil;in bir tuşa basın...");
    Console.ReadLine();
}&lt;/pre&gt;
&lt;p&gt;İstemci uygulamamıza ait konfigurasyon dosyası ise aşağıdaki gibidir. Dikkat ederseniz, channel bilgisinde tcp tipini ve 0 numaralı bir portu hizmete sunduğumuzu g&amp;ouml;r&amp;uuml;yorsunuz. Port bilgisinin 0 olması, bir sunucunun bu istemciye bağlanmaya &amp;ccedil;alışması sırasında, uygun olan boş portlardan birinin sunucuya hizmet i&amp;ccedil;in tahsis edilmesini sağlar. Burada b&amp;ouml;yle bir channel tipi kullanmamızın tek nedeni, istemcinin destek modelini kullanabilmesini sağlamaktır. Nitekim bu modelde, sunucu uygulama, istemci tarafına geri bildirimlerde bulunabilmelidir. Buda istemcinin yeri geldiğinde sunucu gibi davranmasını gerektirir ki bu ancak uygun bir portun sunucuya verilmesi ile ger&amp;ccedil;ekleşebilir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
    &amp;lt;configuration&amp;gt;
        &amp;lt;system.runtime.remoting&amp;gt;
            &amp;lt;application&amp;gt;
                &amp;lt;client url="tcp://manchester:4567"&amp;gt;
                    &amp;lt;activated type="RemoteLib.RemoteObj,RemoteLib"/&amp;gt;
                &amp;lt;/client&amp;gt;
                &amp;lt;channels&amp;gt;
                    &amp;lt;channel ref="tcp" port="0"&amp;gt;
                        &amp;lt;serverProviders&amp;gt;
                            &amp;lt;formatter ref="binary" typeFilterLevel="Full"/&amp;gt;
                        &amp;lt;/serverProviders&amp;gt;
                        &amp;lt;clientProviders&amp;gt;
                            &amp;lt;formatter ref="binary"/&amp;gt;
                        &amp;lt;/clientProviders&amp;gt;
                &amp;lt;/channel&amp;gt;
            &amp;lt;/channels&amp;gt;
        &amp;lt;/application&amp;gt;
    &amp;lt;/system.runtime.remoting&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;İstemci uygulamamızı bu haliyle test ettiğimizde &amp;ccedil;alışma zamanında daha ikinci metod &amp;ccedil;ağırımına ge&amp;ccedil;emeden aşağıdaki ekranda g&amp;ouml;r&amp;uuml;len hata mesajı ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk156_3.gif" alt="" width="638" height="96" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu hatanın nedeni son derece a&amp;ccedil;ıktır. Uzak nesneye ait referansın kiralama s&amp;uuml;resi (Lease Time) dolduğu i&amp;ccedil;in istemci uygulamamız, &amp;ccedil;alışma zamanında olmayan bir referansa ait kayıp metod &amp;ccedil;ağırılarında bulunmaktadır. O halde artık, destek modelini kullanarak bu hatanın &amp;ouml;n&amp;uuml;ne nasıl ge&amp;ccedil;ebileceğimize bakabiliriz. İlk olarak istemci taraflı destek mimarisini (Client Side SponsorShip) kullandığımız i&amp;ccedil;in, istemci tarafında bir takım değişiklikler yapmamız gerekecektir. Bunlardan birincisi, sponsor hizmetini kullanacak olan bir sınıfın tasarlanmasıdır. Bu sınıfı aşağıdaki gibi geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk156_2.gif" alt="" width="276" height="228" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class ClientSponsor : MarshalByRefObject, ISponsor
{
    #region ISponsor Members

    public TimeSpan Renewal(ILease lease)
    {
        Console.WriteLine("Sponsor s&amp;uuml;re yenileme metodu &amp;ccedil;alıştırıldı.");
        return TimeSpan.FromSeconds(5);
    }

    #endregion
}&lt;/pre&gt;
&lt;p&gt;Dikkat ederseniz, istemci taraflı bir sponsor nesnesi MarshalByRefObject ile ISponsor tiplerinden t&amp;uuml;rer. ISponsor tipi, Renewal isimli bir metod sunar. Bu metodun geri d&amp;ouml;n&amp;uuml;ş tipi TimeSpan t&amp;uuml;r&amp;uuml;nden bir s&amp;uuml;redir ve sponsor nesnesinin ilişkilendirildiği uzak nesne referansının yeni kiralama s&amp;uuml;resini belirtmektedir. Bu metod Lease Manager ile konuşabilmek i&amp;ccedil;in parametre olarak ILease aray&amp;uuml;z&amp;uuml; tipinden bir nesneyi kullanır.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizde kiralama s&amp;uuml;resini 5 saniye kadar uzatıyoruz. Dolayısıyla, uzak nesne refaransına ait kiralama s&amp;uuml;resinin sonlanması halinde oluşacak kayıp metod &amp;ccedil;ağırılarının da &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;miş oluyoruz. Ancak hen&amp;uuml;z işimizi tamamlamış değiliz. Yazmış olduğumuz bu sınıfın g&amp;ouml;revini yerine getirebilmesi i&amp;ccedil;in, &amp;ccedil;alışma zamanında g&amp;uuml;ncel Lease Manager' a kayıt edilmesi (register) gerekmektedir. Kaydetme işleminin tam tersi olan unregister işlemi ise, sponsor nesnesi ile Lease Manager' ın ortaklığını kesen bir davranış g&amp;ouml;sterir. İstemci uygulamamızın client side sponsor sınıfını kullanacak yeni hali aşağıdaki gibi olmalıdır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
    ILease il=null;
    ClientSponsor cs=null;
    RemoteObj rm = null;

    try
    {
        RemotingConfiguration.Configure("..\\..\\ClientApp.config", true);
        rm = new RemoteObj();
    
        #region Sponsor register edilir.

        il = (ILease)rm.GetLifetimeService();
        cs = new ClientSponsor();
        il.Register(cs);

        #endregion

        for (int i = 0; i &amp;lt; 10; i++)
        {
            Console.WriteLine(i+"nci &amp;ccedil;ağrı..."+rm.GetTotal(i).ToString());
            System.Threading.Thread.Sleep(3000);
        }
    }
    catch (Exception err)
    {
        Console.WriteLine(err.Message);
    }
    finally
    {
        il.Unregister(cs);
    }
    Console.WriteLine("Programı kapatmak i&amp;ccedil;in bir tuşa basın...");
    Console.ReadLine();
}&lt;/pre&gt;
&lt;p&gt;Sponsor sınıfımıza ait nesne &amp;ouml;rneğini &amp;ccedil;alışma zamanında, istemci tarafından kullanılan uzak nesne referansına ait Lease Manager ile ilişkilendirebilmek i&amp;ccedil;in yine g&amp;uuml;ncel Life Time Servisini elde etmemiz gerekir. Bunun sonucu olarak oluşan ILease aray&amp;uuml;z&amp;uuml; tipini kullanarak sponsor nesnemizi Lease Manager i&amp;ccedil;in kayıt edebiliriz.(Register) Uygulamamızı şimdi bu haliyle &amp;ccedil;alıştıracak olursak hi&amp;ccedil; bir problemle karşılaşılmadığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Dikkat ederseniz belirli zaman aralıklarında kiralama s&amp;uuml;releri sona ermeden otomatik olarak uzatılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;object id="obj1" width="425" height="453" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/ClienSponsor1.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="425" height="453" src="http://www.buraksenyurt.com/makale/images/ClienSponsor1.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj1" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;T&amp;uuml;m metodlar &amp;ccedil;alıştırılmasını tamamladıktan sonra, finally bloğu i&amp;ccedil;erisinde sponsor sınıfımıza ait nesne &amp;ouml;rneğide unregister edilerek Lease Manager ile olan işbirliğine son verilmektedir. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi istemci taraflı destek modeli ile, kiralama s&amp;uuml;releri sona ermiş olan referansların yol a&amp;ccedil;acağı kayıp metod &amp;ccedil;ağırımlarının &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ebilir ve uygulamanın devamlılığını sağlayabiliriz. İstemci taraflı bu modelin dışında bir de sunucu taraflı bir destek modeli olduğundan bahsetmiştik. (Server Side Sponsorship) Bu modelide bir sonraki makalemizde incelemeye &amp;ccedil;alışacağız. B&amp;ouml;ylece geldik bir makalemizin daha sonuna bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/ClientSponsor.rar"&gt;&amp;Ouml;rnek kod i&amp;ccedil;in tıklayınız.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2006-04-12 12:00:00</pubDate>
  <slug>Client-Side-SponshorShip-bsenyurt-com-dan</slug>
  <tags>
    <tag>net-remoting</tag>
  </tags>
  <categories>
    <category>.Net Remoting</category>
  </categories>
</post>