<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF RIA Services - Custom Authorization [Beta 2]</title>
  <description>Geçtiğimiz günlerde uzun süredir yemediğim şu meşhur Dunkin &amp; Donuts' tan bir iki kurabiye almak istedim. Wink Ansızın gelen bu dayanılmaz istek üzerine oturduğumuz semte en yakın dükkanına gidip hem kendim hemde eşim için bir kaç tane aldım.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f12%2fblg116_Giris.jpg" alt="" /&gt;Merhababa Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde uzun s&amp;uuml;redir yemediğim şu meşhur Dunkin &amp;amp; Donuts' tan bir iki kurabiye almak istedim. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Ansızın gelen bu dayanılmaz istek &amp;uuml;zerine oturduğumuz semte en yakın d&amp;uuml;kkanına gidip hem kendim hemde eşim i&amp;ccedil;in bir ka&amp;ccedil; tane aldım. Sonrası malum...Yanında g&amp;uuml;zel bir kahve ve harika bir tat...Tattıları afiyetle mideye indirdikten sonra evde sessiz ve sakin bir ortamın olduğunu farkettim. Bizim azman&amp;nbsp;ufaklık uyumuş ve gıkı bile &amp;ccedil;ıkmıyorken, yorduğu eşim divanda mışıl mışıl sızmıştı.&lt;/p&gt;
&lt;p&gt;Herkesin b&amp;ouml;yle huzurlu bir ortamı hakkettiğini d&amp;uuml;ş&amp;uuml;n&amp;uuml;rken,&amp;nbsp;yağmur damlalarının cama vuruşunu izliyordum. Derken ansızın bir ilham geldi ve bloğuma bir şeyler yazmamın iyi olacağı kanısına vardım. Nede olsa gerekli glikoz y&amp;uuml;klemesi fazlasıyla yapılmıştı.&amp;nbsp;G&amp;uuml;nl&amp;uuml;ğ&amp;uuml;me yazılacaklar listeme baktığımda, &amp;nbsp;sıradaki konunun &lt;strong&gt;WCF RIA Service'&lt;/strong&gt; lerinde &lt;strong&gt;&amp;ouml;zel yetkilendirme niteliklerinin(Custom Authorization Attributes)&lt;/strong&gt;&amp;nbsp;nasıl yazılacağının anlatılması olduğunu farkettim. Neyseki hafta i&amp;ccedil;i bu konu ile ilişkili olaraktan internetteki az sayıda kaynaktan bilgi edinmiştim. Tabiki en g&amp;uuml;ncel ve ge&amp;ccedil;erli kaynak her zamanki gibi &lt;strong&gt;MSDN'&lt;/strong&gt; di.&lt;/p&gt;
&lt;p&gt;Hatırlayacağınız gibi bir &amp;ouml;nceki yazımızda&amp;nbsp;niteliklerden yararlanarak yetkilendirme işlemlerinin nasıl yapılabileceğini basit bir &amp;ouml;rnek &amp;uuml;zerinden incelemeye &amp;ccedil;alışmıştık. Buna g&amp;ouml;re &amp;ouml;nemli olan nokta, &lt;strong&gt;nitelik(Attribute)&lt;/strong&gt; yardımıyla &amp;ccedil;alışma zamanının nasıl davranacağının belirlenebilmesidir. Ancak bazen, &lt;strong&gt;yetkilendirme(Authorization)&lt;/strong&gt; kontrol&amp;uuml; i&amp;ccedil;in &amp;ouml;zel durumların ele alınması da gerekebilir. Nitekim sadece istemcinin i&amp;ccedil;inde bulunduğu role g&amp;ouml;re karar vermenin dışında yapılması gereken&amp;nbsp;yetki kontrolleri s&amp;ouml;z konusu olabilir.&amp;nbsp;B&amp;ouml;yle bir durumda &amp;ccedil;alışma zamanının anlayacağı kendi niteliklerimizi yazmamız gerekmektedir.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak bu geliştirme işleminde yazılacak olan nitelik tipinin, &amp;ccedil;alışma zamanının anlayacağı ve kullanacağı bir veya daha fazla operasyonu uygulaması şarttır. Burada tipik olarak, &amp;ccedil;alışma zamanının değerlendireceği fonksiyonellikleri barındıran bir ata nitelik sınıfından yapılacak olan &lt;strong&gt;t&amp;uuml;retme(Inherit)&lt;/strong&gt; işleminden bahsettiğimizi ifade edebiliriz. Dilerseniz konuyu daha iyi anlamak i&amp;ccedil;in bu yazımızda geliştireceğimiz &amp;ouml;rnek senaryomuzdan kısaca bahsedelim.&lt;/p&gt;
&lt;p&gt;Senaryomuza g&amp;ouml;re &lt;strong&gt;Domain Service&lt;/strong&gt; i&amp;ccedil;erisinde tanımlanmış olan herhangibir operasyonun ger&amp;ccedil;ekleştirilmesi sırasında, talepte bulunan kullanıcının i&amp;ccedil;erisinde bulunduğu role değil, adının &amp;ouml;zel olarak tutulan yasaklı bir listede bulunup bulunmadığına bakılması durumu ele alınmaktadır. Bu yasaklı listenin &lt;strong&gt;ASP.NET Membership &lt;/strong&gt;tarafından hazır olarak tutulan veritabanına extend edilmiş bir tablo i&amp;ccedil;erisinde tutulması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bunun dışında dosya tabanlı olarak &lt;strong&gt;XML&lt;/strong&gt; veya basit &lt;strong&gt;Text &lt;/strong&gt;formatında dahi tutulabilir. Hatta olayı biraz abartıp &lt;strong&gt;Windows Registry&lt;/strong&gt; ayarlarında dahi tutulması ve benzer saklama alanları d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;Hatta bu listenin bir uzak sunucuda&amp;nbsp;duruyor ve&amp;nbsp;ancak servis&amp;nbsp;bazlı bir operasyon yardımıyla kontrollerin yapılabiliyor olması da s&amp;ouml;z konusu olabillir.&amp;nbsp;Tabiki dosya tabanlı olan saklama şekli bu se&amp;ccedil;enekler arasında en az g&amp;uuml;venli olanıdır. Nitekim dosyanın g&amp;uuml;venliğini sağlamak, veritabanı i&amp;ccedil;erisindeki bir tabloya g&amp;ouml;re &amp;ccedil;ok daha zor olabilir. Ancak amacımız yetkilendirme işlemi i&amp;ccedil;in &amp;ouml;zel nitelik yazılması ve kullanılması olduğundan bebek adımlarıyla ilerleyeceğiz. Bu nedenle geliştireceğimiz &amp;ouml;rnekte basit olarak yasaklı listenin bir &lt;strong&gt;Text&lt;/strong&gt; dosyada d&amp;uuml;zenli olarak tutulduğunu varsayıyor olacağız.&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re &lt;strong&gt;System.Web.DomainServices.AuthorizationAttribute&lt;/strong&gt; niteliğinden t&amp;uuml;rettiğimiz tipin i&amp;ccedil;erisinde yer alan &lt;strong&gt;Authorize&lt;/strong&gt; metodu i&amp;ccedil;erisinde gelen kullanıcı adının, yasaklı listede olup olmadığını kontrol etmemiz yeterli olacaktır. İşte sunucu tarafında yer alan &lt;strong&gt;CheckBannedListAttribute&lt;/strong&gt; sınıfı i&amp;ccedil;eriğimiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg116_ClassDiagram.gif" alt="" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.IO;
using System.Linq;
using System.Web;
using System.Web.DomainServices;

namespace ChinookCustomAuthorization.Web
{
    public class CheckBannedListAttribute
        :AuthorizationAttribute
    {
        public override bool Authorize(System.Security.Principal.IPrincipal principal)
        {
            string filePath = HttpContext.Current.Server.MapPath("~\\BannedList.txt");
            string[] bannedList=File.ReadAllLines(filePath);
            return !bannedList.Contains(principal.Identity.Name);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;CheckBannedListAttribute&lt;/strong&gt; sınıfı &lt;strong&gt;AuthorizationAttribute&lt;/strong&gt; tipinden t&amp;uuml;remektedir. Buna g&amp;ouml;re sınıf diagramı g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nden de fark edileceği &amp;uuml;zere, &lt;strong&gt;abstract&lt;/strong&gt; olan &lt;strong&gt;Authorize&lt;/strong&gt; metodunu ezmek zorundadır. &lt;strong&gt;Authorize&lt;/strong&gt; metodu, niteliğin uygulanacağı metodlar i&amp;ccedil;in gerekli yetki kontrol&amp;uuml; operasyonunu &amp;uuml;stlenmektedir. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Authorize&lt;/strong&gt; metodu parametre olarak tanıdık bir aray&amp;uuml;z&amp;uuml; almaktadır; &lt;strong&gt;IPrincipal&lt;/strong&gt;. Bu aray&amp;uuml;ze gelen &amp;ccedil;alışma zamanı referansından yararlanarak sisteme giriş yapan kullanıcının adını, hangi rolde yer aldığını, doğrulanıp doğrulanmadığını &amp;ouml;ğrenebiliriz.&lt;/p&gt;
&lt;p&gt;Biz &amp;ouml;rnek senaryomuza g&amp;ouml;re &lt;strong&gt;Login&lt;/strong&gt; olan kullanıcı adının yasaklı listenin tutulduğu &lt;strong&gt;text&lt;/strong&gt; tabanlı dosya i&amp;ccedil;erisinde olup olmadığını incelemeyi hedefliyoruz. Bu sebepten &lt;strong&gt;Authorize&lt;/strong&gt; metodu i&amp;ccedil;erisinde&amp;nbsp;&lt;strong&gt;BannedList&lt;/strong&gt; isimli ve sunucu proje i&amp;ccedil;erisinde tutulan &lt;span style="text-decoration: underline;"&gt;text tabanlı&lt;/span&gt; dosyanın t&amp;uuml;m satırlarının y&amp;uuml;klenmesi ve elde edilen dizi i&amp;ccedil;erisinde olup olmadığına g&amp;ouml;re &lt;strong&gt;bool&lt;/strong&gt; tipte bir sonucun d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi s&amp;ouml;z konusu.&amp;nbsp;Yazmış olduğumuz &amp;ouml;zel nitelik tipini sunucu tarafında yer alan &lt;strong&gt;ChinookDomainService&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde uygulamamız ise son derece kolay.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;Ouml;rneğimizin kalan kısmı daha &amp;ouml;nceki yazımızda geliştirdiğimiz ile benzer.&amp;nbsp;Bu nedenle detaya girerek konudan uzaklaşmamayı tercih etmekteyim.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace ChinookCustomAuthorization.Web
{
    using System.Linq;
    using System.Web.DomainServices;
    using System.Web.DomainServices.Providers;
    using System.Web.Ria;


    [RequiresAuthentication]
    [EnableClientAccess()]
    public class ChinookDomainService 
        : LinqToEntitiesDomainService&amp;lt;ChinookEntities&amp;gt;
    {
        [CheckBannedList]
        public IQueryable&amp;lt;Album&amp;gt; GetAlbums()
        {
            return this.ObjectContext.Albums;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;CheckBannedList&lt;/strong&gt; niteliği, yasaklı liste yetki kontrol&amp;uuml; yapılmak istenen operasyonun &amp;uuml;zerinde uygulanmaktadır. Buna g&amp;ouml;re &amp;ccedil;alışma zamanında &lt;strong&gt;Login&lt;/strong&gt; olan bir kullanıcının s&amp;ouml;z konusu &lt;strong&gt;GetAlbums&lt;/strong&gt; operasyonunu talep etmesi halinde devreye girecektir. S&amp;ouml;z gelimi &lt;strong&gt;text&lt;/strong&gt; dosyamız i&amp;ccedil;erisinde aşağıdaki isimlerin yer aldığını varsayalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg116_Banned.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re &amp;ouml;rneğin &lt;strong&gt;buraks&lt;/strong&gt; isimli kullanıcı ile &lt;strong&gt;Login&lt;/strong&gt; olup alb&amp;uuml;m listesinin y&amp;uuml;klendiği operasyonu talep ettiğimizde, tarayıcı uygulama &amp;uuml;zerinde aşağıdaki script hatasını aldığımızı g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg116_Error.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere&lt;strong&gt; Access Denied&lt;/strong&gt; kelimeleri hata mesajı i&amp;ccedil;erisinde yer almaktadır. &amp;Ccedil;ok doğal olarak yasaklı liste i&amp;ccedil;erisinde yer almayan bir kullanıcı ile sistem girdiğimizde&lt;em&gt;(&amp;ouml;rneğin senaryomuza g&amp;ouml;re bill olabilir) &lt;/em&gt;alb&amp;uuml;m listesinin başarılı bir şekilde elde edildiği g&amp;ouml;r&amp;uuml;lecektir. Aynen aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg116_Complete.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil; olarak eklediğimiz &amp;ouml;zel &lt;strong&gt;authorization&lt;/strong&gt; niteliği yardımıyla, &lt;strong&gt;Domain Service&lt;/strong&gt; &amp;uuml;zerinden &amp;ccedil;ağırılacak bir operasyon i&amp;ccedil;in, sisteme giriş yapan&amp;nbsp;kullanıcının rol&amp;uuml;ne&amp;nbsp;bakmatan&amp;nbsp;farklı bir yetkilendirme kontrol&amp;uuml; ger&amp;ccedil;ekleştirebildiğimizi g&amp;ouml;rm&amp;uuml;ş olduk. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f12%2fCustomAuthorization.rar"&gt;CustomAuthorization.rar (1,29 mb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2010-01-26 01:52:00</pubDate>
  <slug>WCF-RIA-Services-Custom-Authorization</slug>
  <tags>
    <tag>wcf-ria-services</tag>
    <tag>net-ria-services</tag>
    <tag>wcf</tag>
    <tag>wcf-eco-system</tag>
  </tags>
  <categories>
    <category>WCF Eco System</category>
    <category>WCF RIA Services</category>
  </categories>
</post>