<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Silverlight İstemcileri için Duplex Service Geliştirmek</title>
  <description>Bilindiği üzere WCF(Windows Communication Foundation) tarafında geliştirilen servislerin Duplex iletişimi kullanaraktan istemciler üzerinde operasyonlar gerçekleştirmesi, bir başka deyişle metod çağrılarında bulunabilmeleri mümkündür.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f3%2fblg172_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Lost &lt;/strong&gt;dizisinin m&amp;uuml;ptelası olan arkadaşlar&lt;strong&gt; "Push The Button" &lt;/strong&gt;repliğini bilirler. Hikayeye g&amp;ouml;re &lt;strong&gt;DHARMA &lt;/strong&gt;girişimin labaratuvarında yer alan ve &lt;strong&gt;108 &lt;/strong&gt;dakikadan geriye doğru sayan bir numarator vardır. Zaman sayacı sıfırlanmadan &amp;ouml;nce toplamları &lt;strong&gt;108 &lt;/strong&gt;olan &lt;strong&gt;4,8,15,16,23,42 &lt;/strong&gt;sayı dizisinin klavyeden girilmesi ve &lt;strong&gt;Enter &lt;/strong&gt;tuşuna basılması gerekmektedir. Tabi ben Lost dizisinin t&amp;uuml;m sezonlarını takip etmemiş ve hatta sonunu getirememiş birisi olarak ne olduğunu tam olarak anlayabilmiş değilim.&lt;/p&gt;
&lt;p&gt;Lakin bu &lt;strong&gt;Push The Button&lt;/strong&gt; mevzusunda d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m genelde, sunucu &amp;uuml;zerindeki bir servisin &lt;strong&gt;Pusher Service&lt;/strong&gt; olarak hizmet vermesi olmuştur. Buna g&amp;ouml;re, servis kendisine bağlı olan istemci modundaki lokasyonlara bir bildiri yapmaktadır diyerek konuyu bir şekilde bağlmaya &amp;ccedil;alışayım. Bu g&amp;uuml;nk&amp;uuml; yazımızda &lt;strong&gt;Silverlight &lt;/strong&gt;istemcilerinin &lt;strong&gt;Duplex&lt;/strong&gt; iletişim &amp;uuml;zerinden hizmet verebilen servisler yardımıyla nasıl tetiklenebileceğini incelemeye &amp;ccedil;alışıyor olacağız. Sanıyorum &lt;strong&gt;Siverlight &lt;/strong&gt;tabanlı &lt;strong&gt;chat &lt;/strong&gt;programları geliştirmek isteyenlerin ilgisini &amp;ccedil;ekecek en azından biraz bilgi verecek bir yazı olacaktır.&lt;/p&gt;
&lt;p&gt;Bilindiği &amp;uuml;zere &lt;strong&gt;WCF(Windows Communication Foundation) &lt;/strong&gt;tarafında geliştirilen servislerin &lt;strong&gt;Duplex &lt;/strong&gt;iletişimi kullanaraktan istemciler &amp;uuml;zerinde operasyonlar ger&amp;ccedil;ekleştirmesi, bir başka deyişle metod &amp;ccedil;ağrılarında bulunabilmeleri m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Burada &amp;ccedil;ift kanallı olarak ger&amp;ccedil;ekleştirilen bir iletişim s&amp;ouml;z konusudur. Daha &amp;ccedil;ok &lt;strong&gt;chat&lt;/strong&gt; uygulamalarında veya istemcinin her hangibir durum değişikliğinde uyarılması gerektiği vakalarda bu tip servislerden yararlanılabilir. S&amp;ouml;z gelimi bu yazımızda geliştireceğimiz &lt;strong&gt;WCF Servis &lt;/strong&gt;&amp;ouml;rneği, istemcilerden aldığı şehir bilgisine g&amp;ouml;re anlık hava durumu bilgisini d&amp;ouml;nd&amp;uuml;recektir. Bu c&amp;uuml;mle ilk bakışta istemcinin yapacağı normal bir servis &amp;ccedil;ağrısından ve sonucunun alınmasından farksız bir operasyonmuş gibi g&amp;ouml;r&amp;uuml;nebilir. Ancak g&amp;ouml;zden ka&amp;ccedil;ırılmaması gereken bir husus vardır; o da hava durumu bilgisinin bildirilme işleminin, servis tarafından istemci &amp;uuml;zerindeki bir operasyon &amp;ccedil;ağrısı ile yapılacağıdır.&lt;/p&gt;
&lt;p&gt;Tabi yazımızın başlığından da anlayacağınız &amp;uuml;zere s&amp;ouml;z konusu &lt;strong&gt;WCF Servisini &lt;/strong&gt;bir &lt;strong&gt;Silverlight &lt;/strong&gt;istemcisi &amp;uuml;zerinden test etmeye &amp;ccedil;alışıyor olacağız. Duplex &lt;strong&gt;WCF Servisinin&lt;/strong&gt; geliştirilmesi başlı başına karmaşık bir s&amp;uuml;re&amp;ccedil; gerektiğinden yazımızı iki seriye b&amp;ouml;l&amp;uuml;yor olacağız. İlk b&amp;ouml;l&amp;uuml;mdeki hedefimiz &lt;strong&gt;Duplex &lt;/strong&gt;iletişimi sağlayacak olan &lt;strong&gt;WCF Servisini &lt;/strong&gt;geliştirmek olacak. İşe &lt;strong&gt;Visual Studio 2010 Ultimate RC &lt;/strong&gt;ortamında &lt;strong&gt;WorldWeatherService &lt;/strong&gt;isminde bir &lt;strong&gt;WCF Service Application&lt;/strong&gt; uygulaması a&amp;ccedil;arak ve hemen&lt;strong&gt; C:\Program Files (x86)\Microsoft SDKs\Silverlight\v4.0\Libraries\Server&lt;/strong&gt; adresinde yer alan &lt;strong&gt;System.ServiceModel.PollingDuplex.dll&lt;/strong&gt; &lt;strong&gt;assembly&lt;/strong&gt;' ını referans ederek başlayabiliriz. Nitekim bu referans i&amp;ccedil;erisindeki tiplere sunucu tarafında ihtiyacımız olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f3%2fblg172_ServerReference.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi servis i&amp;ccedil;in gerekli s&amp;ouml;zleşmeleri yazabiliriz. &lt;strong&gt;WCF Duplex&lt;/strong&gt; servisleri iki &lt;strong&gt;s&amp;ouml;zleşme(Contract)&lt;/strong&gt; i&amp;ccedil;ermektedir. Bunlardan birisi istemci tarafından &amp;ccedil;ağırılacak olan operasyonları i&amp;ccedil;eren s&amp;ouml;zleşmedir. Ancak diğer s&amp;ouml;zleşme &lt;strong&gt;geri bildirim(Callback)&lt;/strong&gt; sırasında kullanılacak s&amp;ouml;zleşmedir. Aşağıda s&amp;ouml;z konusu s&amp;ouml;zleşmelere ait &lt;strong&gt;aray&amp;uuml;z(Interface)&lt;/strong&gt; i&amp;ccedil;erikleri yer almaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ServiceModel;

namespace WorldWeatherService
{
    // Servis s&amp;ouml;zleşmesinin kullanacağı geri bildirim s&amp;ouml;zleşmesi CallbackContract &amp;ouml;zelliği ile bildirilir.
    [ServiceContract(CallbackContract=typeof(IWeatherDuplexClient))]
    public interface IWeatherDuplexService
    {
        [OperationContract]
        void SetCity(string cityName);
    }

    [ServiceContract]
    public interface IWeatherDuplexClient
    {
        // Servisin istemci tarafında tetikleyeceği Notice operasyonunun geriye bir şey d&amp;ouml;nd&amp;uuml;rmeyeceği bir başka deyişle tek y&amp;ouml;nl&amp;uuml; &amp;ccedil;alışan bir metod olduğu IsOneWay niteliği sayesinde bildirilir.
        [OperationContract(IsOneWay=true)]
        void Notice(WeatherStatus weather);
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;IWeatherDuplexService &lt;/strong&gt;s&amp;ouml;zleşmesi i&amp;ccedil;in kullanılan &lt;strong&gt;ServiceContract &lt;/strong&gt;niteliğinde, geri bildirim s&amp;ouml;zleşmesi &lt;strong&gt;CallbackContract &lt;/strong&gt;&amp;ouml;zelliği yardımıyla bildirilmiştir. Bu sayede servis s&amp;ouml;zleşmesini uygulayan tip, &amp;ccedil;alışma zamanında gerekli geri bildirim nesne &amp;ouml;rneğini değerlendirebilecektir. Diğer yandan servisin istemci &amp;uuml;zerinde tetiklemede bulunacağı s&amp;ouml;zleşme, &lt;strong&gt;IWeatherDuplexClient &lt;/strong&gt;adlı &lt;strong&gt;interface &lt;/strong&gt;tipi olarak tanımlanmıştır. Bu s&amp;ouml;zleşme i&amp;ccedil;in &amp;ouml;nem arz eden konu ise &lt;strong&gt;Notice &lt;/strong&gt;metodunun &lt;strong&gt;OperationContract &lt;/strong&gt;niteliğinde yer alan &lt;strong&gt;IsOneWay &lt;/strong&gt;&amp;ouml;zelliğinin &lt;strong&gt;true &lt;/strong&gt;değere sahip olmasıdır. Nitekim servisin yaptığı istemci bazlı geri bildirimlerden bir sonu&amp;ccedil; beklenmemelidir. Bu da ilgili operasyonun tek y&amp;ouml;nl&amp;uuml; &amp;ccedil;alışacak şekilde işaretlenmesi ile m&amp;uuml;mk&amp;uuml;n olacaktır. Gelelim servis s&amp;ouml;zleşmesinin uygulandığı tipe.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using System.Threading;

namespace WorldWeatherService
{
    public class WeatherDuplexService 
        : IWeatherDuplexService
    {
        #region Variables

        IWeatherDuplexClient client;
        string[] posibilities ={"G&amp;uuml;neşli",
                                  "Yağmurlu",
                                  "Par&amp;ccedil;alı Bulutlu",
                                  "Kar Yağışlı",
                                  "Tipi",
                                  "Fırtına",
                                  "Bulutlu",
                                  "R&amp;uuml;zgarlı",
                                  "Zaman zaman yağışlı"
                              };

        #endregion

        #region IWeatherDuplexService Members

        public void SetCity(string cityName)
        {
            // İstemci kanalı yakalanıyor ki geri bildirim sırasında hangi kanal &amp;uuml;zerinden gidileceği bilinsin.
            client = OperationContext.Current.GetCallbackChannel&amp;lt;IWeatherDuplexClient&amp;gt;();
            // Geri bildirimlerde devreye girecek metod bloğunu işaret edecek TimerCallback tipinden bir temsilci kullanılır.

            Random rnd = new Random();
            TimerCallback tCallback = o =&amp;gt; {
                // Sembolik olarak bir hava durumu bilgisi oluşturulur                
                string summary=posibilities[rnd.Next(0,posibilities.Length-1)];
                int heat = rnd.Next(0, 30);

                // İstemci tarafındaki Notice metodu &amp;ccedil;ağırılır ve s&amp;ouml;z konusu şehir i&amp;ccedil;in anlık hava durumu bilgisi g&amp;ouml;nderilir(Tabiki hayali olarak)
                client.Notice(new WeatherStatus { City = cityName, Heat = heat, Summary = summary });
            };
            // Olayı simule etmek i&amp;ccedil;in,
            // Belirli s&amp;uuml;re duraksatma yapılır ve sonunda tCallback isimli temsilcinin işaret ettiği metod bloğunun &amp;ccedil;alıştırılması sağlanır.
            using (Timer tmr = new Timer(tCallback, null, 500, 500))
            {
                Thread.Sleep(2000);
            }
        }

        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;WeatherDuplexService &lt;/strong&gt;sınıfı &lt;strong&gt;IWeatherDuplexService aray&amp;uuml;z&amp;uuml;n&amp;uuml;(Interfaca)&lt;/strong&gt; uygulamaktadır. Bu uyarlamaya g&amp;ouml;re &lt;strong&gt;SetCity &lt;/strong&gt;metodunu ezmektedir. &lt;strong&gt;SetCity &lt;/strong&gt;metodu i&amp;ccedil;erisinde en can alıcı nokta ise, &lt;strong&gt;Callback Channel &lt;/strong&gt;nesne referansının yakalanmasıdır. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;GetCallbackChannel &lt;/strong&gt;metodu &lt;strong&gt;generic &lt;/strong&gt;olarak &lt;strong&gt;IWeatherDuplexClient &lt;/strong&gt;aray&amp;uuml;z&amp;uuml;n&amp;uuml; kullanmaktadır. Buna g&amp;ouml;re, &amp;ccedil;alışma zamanında istemcinin servise g&amp;ouml;nderdiği &amp;ccedil;ağrıya g&amp;ouml;re yakalayacağı kanalın, &lt;strong&gt;IWeatherDuplexClient &lt;/strong&gt;aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamış bir tip olacağı ortadadır. E haliyle bu aray&amp;uuml;z&amp;uuml;n i&amp;ccedil;erisinde tanımlanmış bir de operasyonumuz bulunmaktadır. &lt;strong&gt;Notice &lt;/strong&gt;isimli metod.&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Dolayısıyla yakalanan kanal &amp;uuml;zerinden yapılabilecek olan bir &lt;strong&gt;Notice &lt;/strong&gt;operasyon &amp;ccedil;ağrısı mevcuttur ve bu &amp;ccedil;ağrı servis tarafından istemci &amp;uuml;zerinde ger&amp;ccedil;ekleştirilecektir. Kod i&amp;ccedil;erisinde sembolik olarak bir gecikme işlemi uygulanmış ve bunun sonucunda &lt;strong&gt;TimerCallback temsilci tipinin(Delegate)&lt;/strong&gt; işaret ettiği bir metod g&amp;ouml;vdesinin de devreye girmesi sağlanmıştır. Bu metod bloğu i&amp;ccedil;erisindeyse &lt;strong&gt;Notice &lt;/strong&gt;metod &amp;ccedil;ağrısı ger&amp;ccedil;ekleştirilmekte ve aşağıdaki i&amp;ccedil;eriğe sahip olan &lt;strong&gt;WeatherStatus &lt;/strong&gt;tipinden bir nesne &amp;ouml;rneği &amp;uuml;retilmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace WorldWeatherService
{
    public class WeatherStatus
    {
        public int Heat { get; set; }
        public string Summary { get; set; }
        public string City { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Sırada servis tarafının &amp;ccedil;alışma zamanını ilgilendiren konfigurasyon ayarlarının yapılması yer almakta. Burada işler biraz karışıyor. &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt; Neyseki &lt;strong&gt;MSDN &lt;/strong&gt;&amp;uuml;zerinden konu ile ilişkili yardımcı d&amp;ouml;k&amp;uuml;manların fazlasıyla yararı olduğunu ifade edebilirim. İşte sunucu uygulamamıza ait &lt;strong&gt;web.config&lt;/strong&gt; i&amp;ccedil;eriğimiz.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0"?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;extensions&amp;gt;
            &amp;lt;bindingExtensions&amp;gt;
                &amp;lt;add name="duplexHttpBinding" type="System.ServiceModel.Configuration.PollingDuplexHttpBindingCollectionElement, System.ServiceModel.PollingDuplex, Version=4.0.0.0, Culture=neutral, PublicKeyToken=31bf3856ad364e35"/&amp;gt;
            &amp;lt;/bindingExtensions&amp;gt;
        &amp;lt;/extensions&amp;gt;
        &amp;lt;bindings&amp;gt;
            &amp;lt;duplexHttpBinding&amp;gt;
                &amp;lt;binding name="duplexHttpBindingConfiguration" duplexMode="MultipleMessagesPerPoll" maxOutputDelay="00:00:05"/&amp;gt;
            &amp;lt;/duplexHttpBinding&amp;gt;
        &amp;lt;/bindings&amp;gt;
        &amp;lt;behaviors&amp;gt;
            &amp;lt;serviceBehaviors&amp;gt;
                &amp;lt;behavior name=""&amp;gt;
                    &amp;lt;serviceMetadata httpGetEnabled="true"/&amp;gt;
                    &amp;lt;serviceDebug includeExceptionDetailInFaults="false"/&amp;gt;
                &amp;lt;/behavior&amp;gt;
            &amp;lt;/serviceBehaviors&amp;gt;
        &amp;lt;/behaviors&amp;gt;
        &amp;lt;serviceHostingEnvironment multipleSiteBindingsEnabled="true"/&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service name="WorldWeatherService.WeatherDuplexService"&amp;gt;
                &amp;lt;endpoint address="" binding="duplexHttpBinding" bindingConfiguration="duplexHttpBindingConfiguration" contract="WorldWeatherService.IWeatherDuplexService"/&amp;gt;
                &amp;lt;endpoint address="mex" binding="mexHttpBinding" contract="IMetadataExchange"/&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
    &amp;lt;system.web&amp;gt;
        &amp;lt;compilation debug="true"/&amp;gt;
  &amp;lt;/system.web&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Anneciğimmm!!! Sakın korkmayın. Ezberlemeye gerek yok. Ancak bir &amp;ouml;zet ge&amp;ccedil;memizde yarar olduğu kanısındayım. &amp;Ouml;ncelikli olarak &lt;strong&gt;Silverlight &lt;/strong&gt;tarafı i&amp;ccedil;in gerekli bir takım işlemler yapıldığını s&amp;ouml;yleyebiliriz. Bunlardan ilki bir &lt;strong&gt;bindingExtension &lt;/strong&gt;bildirimidir. Sanırım projeyi oluşturduktan sonra neden &lt;strong&gt;System.ServiceModel.PollingDuplex.dll&lt;/strong&gt; &lt;strong&gt;assembly&lt;/strong&gt;' ını referans ettiğimizi anlamışsınızdır. S&amp;ouml;z konusu &lt;strong&gt;extension &lt;/strong&gt;ile yeni bir &lt;strong&gt;bağlayıcı tip(Binding Type)&lt;/strong&gt; tanımlayarak kullanıma sunuyoruz. &lt;strong&gt;duplexHttpBinding &lt;/strong&gt;olarak isimlendirdiğimiz bağlayıcı tipin bir takım &amp;ouml;zellikleri de&lt;em&gt;(duplexMode, maxOutputDelay)&lt;/em&gt; belirtilmiş durumdadır.&lt;/p&gt;
&lt;p&gt;Peki ya bundan sonrası? &amp;Ouml;rneğimizi &lt;strong&gt;Asp.Net Development Server &lt;/strong&gt;yerine &lt;strong&gt;IIS &lt;/strong&gt;altında konuşlandıracak şekilde tesis edebiliriz. Aslında projeyi doğrudan &lt;strong&gt;IIS &lt;/strong&gt;altına &lt;strong&gt;Publish &lt;/strong&gt;ettikten sonra servisi bir tarayıcı uygulama ile a&amp;ccedil;arak sorunsuz bir şekilde &amp;ccedil;ağırılıp &amp;ccedil;ağırılmadığını g&amp;ouml;rmekte yarar olacağı kanısındayım. &lt;strong&gt;Publish &lt;/strong&gt;se&amp;ccedil;enekleri aşağıdakine resimde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi yapılabilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f3%2fblg172_PublishSettingsLast.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizi test ettiğimiz aşağıdaki gibi bir sonu&amp;ccedil; ile karşılaşırsak her şey yoldundadır diyebiliriz. Diyebiliriz &amp;ccedil;&amp;uuml;nk&amp;uuml; asıl test &lt;strong&gt;Silverlight &lt;/strong&gt;istemcisi tarafından servise erişmeye ve kullanmaya &amp;ccedil;alıştığımızda oluşacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f3%2fblg172_ServiceOnBrowser.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Servis tarafında dikkat edilmesi gereken noktalardan birisi de &lt;strong&gt;Client Access Policy&lt;/strong&gt; konusudur. Servisimizi &lt;strong&gt;IIS &lt;/strong&gt;altına &lt;strong&gt;Publish&lt;/strong&gt; etsek bile herhangibir &lt;strong&gt;Silverlight &lt;/strong&gt;istemcisinin kullanabilmesi i&amp;ccedil;in &lt;strong&gt;ClientAccessPolicy.xml&lt;/strong&gt; i&amp;ccedil;eriğinin &lt;strong&gt;Domain Root &lt;/strong&gt;altında yer alması gerekmektedir. S&amp;ouml;z konusu dosyasnın i&amp;ccedil;eriğini etkileyen pek &amp;ccedil;ok fakt&amp;ouml;r vardır ve a&amp;ccedil;ık&amp;ccedil;ası bu kadar detaya girmemize şimdilik gerek yoktur. Ancak en ge&amp;ccedil;erli kaynaklardan birisi olarak &lt;strong&gt;Time Heuer&lt;/strong&gt;' in &lt;a title="Silverlight cross domain policy file helper" href="http://timheuer.com/blog/archive/2008/04/06/silverlight-cross-domain-policy-file-snippet-intellisense.aspx" target="_blank"&gt;blog girdisinden&lt;/a&gt; ve tabiki &lt;strong&gt;Microsoft&lt;/strong&gt;' un &lt;a title="Network Security Access Restirctions in Silverlight" href="http://msdn.microsoft.com/en-us/library/cc645032(VS.95).aspx" target="_blank"&gt;&lt;strong&gt;Network Security Access Restricions in Silverlight&lt;/strong&gt;&lt;/a&gt; yazısından yararlanabilirsiniz. &amp;Ouml;rneğimiz i&amp;ccedil;in aşağıdaki gibi bir i&amp;ccedil;erik yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding ="utf-8"?&amp;gt;
&amp;lt;access-policy&amp;gt;
  &amp;lt;cross-domain-access&amp;gt;
    &amp;lt;policy&amp;gt;
      &amp;lt;allow-from&amp;gt;
        &amp;lt;domain uri="*" /&amp;gt;
      &amp;lt;/allow-from&amp;gt;
      &amp;lt;grant-to&amp;gt;
        &amp;lt;resource path="/WorldWeatherService" include-subpaths="true"/&amp;gt;
      &amp;lt;/grant-to&amp;gt;
    &amp;lt;/policy&amp;gt;
  &amp;lt;/cross-domain-access&amp;gt;
&amp;lt;/access-policy&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu i&amp;ccedil;eriğe sahip olan &lt;strong&gt;ClientAccessPolicy.xml &lt;/strong&gt;dosyasının ise &lt;strong&gt;WCF &lt;/strong&gt;Servisimizi &lt;strong&gt;Publish &lt;/strong&gt;ettiğimiz &lt;strong&gt;IIS &lt;/strong&gt;sunucusundaki ilgili &lt;strong&gt;Domain' &lt;/strong&gt;e ait &lt;strong&gt;root &lt;/strong&gt;klas&amp;ouml;rde yer alması gerekmektedir. Aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f3%2fblg172_ClientAccessPolicy.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Artık farklı bir &lt;strong&gt;domainde &lt;/strong&gt;yer alan herhangibir &lt;strong&gt;Silverlight &lt;/strong&gt;istemcisi &lt;strong&gt;WorldWeatherService&lt;/strong&gt;' ini kullanabilecektir. Artık geride istemci tarafının yazılması ve test edilmesinden başka bir şey kalmamıştır. Ancak biraz nefes alalım ve bunu bir sonraki yazımıza bırakalım. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f3%2fWorldWeatherService.rar"&gt;WorldWeatherService.rar (157,92 kb)&lt;/a&gt; &lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 Ultimate RC s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde geliştirilmiş ve test edilmiştir.]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-06-18 04:50:00</pubDate>
  <slug>Silverlight-Istemcileri-icin-Duplex-Service-Gelistirmek</slug>
  <tags>
    <tag>wcf</tag>
    <tag>silverlight</tag>
    <tag>wcf-service</tag>
    <tag>duplex-service</tag>
    <tag>duplex-communication</tag>
    <tag>push</tag>
  </tags>
  <categories>
    <category>Silverlight 4.0</category>
    <category>WCF</category>
  </categories>
</post>