<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Struct Kavramı ve Class ile Struct Arasındaki Farklar</title>
  <description>Bugünkü makalemizde struct kavramını incelemeye çalışacağız. Hatırlayacağınız gibi, kendi tanımladığımız veri türlerinden birisi olan Numaralandırıcıları (Enumerators) görmüştük. Benzer şekilde diğer bir veri tipide struct (yapı) lardır.Yapılar, sınıflar ile büyük benzerleklik gösterirler. Sınıf gibi tanımlanırlar. Hatta sınıflar gibi, özellikler,metodlar,veriler, yapıcılar vb... içerebilirler. Buna karşın sınıflar ile yapılar arasında çok önemli farklılıklar vardır.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde struct kavramını incelemeye &amp;ccedil;alışacağız. Hatırlayacağınız gibi, kendi tanımladığımız veri t&amp;uuml;rlerinden birisi olan Numaralandırıcıları (Enumerators) g&amp;ouml;rm&amp;uuml;şt&amp;uuml;k. Benzer şekilde diğer bir veri tipide struct (yapı) lardır.Yapılar, sınıflar ile b&amp;uuml;y&amp;uuml;k benzerleklik g&amp;ouml;sterirler. Sınıf gibi tanımlanırlar. Hatta sınıflar gibi, &amp;ouml;zellikler,metodlar,veriler, yapıcılar vb... i&amp;ccedil;erebilirler. Buna karşın sınıflar ile yapılar arasında &amp;ccedil;ok &amp;ouml;nemli farklılıklar vardır.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Herşeyden &amp;ouml;nce en &amp;ouml;nemli fark, yapıların değer t&amp;uuml;r&amp;uuml; olması ve sınıfların referans t&amp;uuml;r&amp;uuml; olmasıdır. Sınıflar referans t&amp;uuml;r&amp;uuml;nden oldukları i&amp;ccedil;in, bellekte tutuluş bi&amp;ccedil;imleri değer t&amp;uuml;rlerine g&amp;ouml;re daha farklıdır. Referans tiplerinin sahip olduğu veriler belleğin &amp;ouml;bek(heap) adı verilen tarafında tutulurken, referansın adı stack(yığın) da tutulur ve &amp;ouml;bekteki verilerin bulunduğu adresi işaret eder. Ancak değer t&amp;uuml;rleri belleğin stack denilen kısmında tutulurlar. Aşağıdaki şekil ile konuyu daha net canlandırabiliriz.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;img src="/makale/images/mk12_1.gif" alt="" width="363" height="414" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;Ş&lt;em&gt;ekil 1. Referans Tipleri&lt;/em&gt; &amp;nbsp;&lt;em&gt;&amp;nbsp;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Aşağıdaki şekilde ise değer tiplerinin bellekte nasıl tutulduğunu g&amp;ouml;r&amp;uuml;yorsunuz.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&amp;nbsp;&lt;em&gt;&lt;img src="/makale/images/mk12_2.gif" alt="" width="164" height="257" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;Ş&lt;em&gt;ekil 2. Değer Tipleri&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;İşte sınıflar ile yapılar arasındaki en b&amp;uuml;y&amp;uuml;k fark budur. Peki bu farkın bize sağladığı getiriler nelerdir? Ne zaman yapı ne zaman sınıf kullanmalıyız? &amp;Ouml;zellikle metodlara veriler aktarırken bu verileri sınıf i&amp;ccedil;erisinde tanımladığımızda, t&amp;uuml;m veriler metoda aktarılacağını sadece bu verilerin &amp;ouml;bekteki başlangı&amp;ccedil; adresi aktarılır ve ilgili parametrenin de bu adresteki verilere işaret etmesi sağlanmış olur. B&amp;ouml;ylece b&amp;uuml;y&amp;uuml;k boyutlu verileri stack&amp;rsquo;ta kopyalayarak gereksiz miktarda bellek harcanmasının &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ilmiş olunur. Ancak k&amp;uuml;&amp;ccedil;&amp;uuml;k boyutlarda veriler ile &amp;ccedil;alışırken bu verileri sınıflar i&amp;ccedil;erisinde kullandığımızda bu kezde gereksiz yere bellek kullanıldığı &amp;ouml;bek şişer ve performans d&amp;uuml;şer. Bu konudaki uzman g&amp;ouml;r&amp;uuml;ş 16 byte&amp;rsquo;tan k&amp;uuml;&amp;ccedil;&amp;uuml;k veriler i&amp;ccedil;in yapıların kullanılması, 16 byte&amp;rsquo;tan b&amp;uuml;y&amp;uuml;k veriler i&amp;ccedil;in ise sınıfların kullanılmasıdır.&lt;/p&gt;
&lt;p&gt;Diğer taraftan yapılar ile sınıflar arasında başka farklılıklarda vardır. &amp;Ouml;rneğin bir yapı i&amp;ccedil;in varsayılan yapıcı metod (default constructor) yazamayız. Derleyici hatası alırız. Ancak bu değişik sayıda parametreler alan yapıcılar yazmamızı engellemez. Oysaki sınıflarda istersek sınıfın varsayılan yapıcı metodunu kendimiz yazabilmekteyiz.&lt;/p&gt;
&lt;p&gt;Bir yapı i&amp;ccedil;ersinde yer alan constructor metod(lar) i&amp;ccedil;inde tanımlamış olduğumuz alanlara başlangı&amp;ccedil; değerlerini atamak zorundayız. Oysaki bir sınıftaki constructor(lar) i&amp;ccedil;inde kullanılan alanlara başlangı&amp;ccedil; değerlerini atamaz isek, derleyici bizim yerimize sayısal değerlere 0, boolean değerlere false vb... gibi başlangı&amp;ccedil; değerlerini kendisi otomatik olarak yapar. Ancak derleyici aynı işi yapılarda yapmaz. Bu nedenle bir yapı i&amp;ccedil;inde kullandığımız constructor(lar)daki tanımlamış olduğumuz alanlara mutlaka ilk değerlerini vermemiz gerekir. Ancak yinede dikkat edilmesi gereken bir nokta vardır. Eğer yapı &amp;ouml;rneğini varsayılan yapılandırıcı ile oluşturursak bu durumda derleyici yapı i&amp;ccedil;inde kullanılan alanlara ilk değerleri atanmamış ise kendisi ilk değerleri atar. Unutmayın, parametreli constructorlarda her bir alan i&amp;ccedil;in başlangı&amp;ccedil; değerlerini bizim vermemiz gerekmektedir. &amp;Ouml;rneğin, aşağıdaki Console uygulamasını inceleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace StructSample1
{
    struct Zaman
    {
        private int saat, dakika, saniye;
        private string kosucuAdi;
        public string Kosucu
        {
            get
            {
                return kosucuAdi;
            }
            set
            {
                kosucuAdi =value;
            }
        }
        public int Saat
        {
            get
            {
                return saat;
            }
            set
            {
                saat =value;
            }
        }

        public int Dakika
        {
            get
            {
                return dakika;
            }
            set
            {
                dakika =value;
            }
        }

        public int Saniye
        {
            get
            {
                return saniye;
            }
            set
            {
                saniye =value;
            }
        }
    }

    class Class1
    {
        [STAThread]
        static void Main(string[] args)
        {
            Zaman z;
            Console.WriteLine("Koşucu:" + z.Kosucu);
            Console.WriteLine("Saat:" + z.Saat.ToString());
            Console.WriteLine("Dakika:" + z.Dakika.ToString());
            Console.WriteLine("Saniye:" + z.Saniye.ToString());
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;br /&gt;Yukarıdaki kod derlenmeyecektir. Nitekim derleyici &lt;strong style="mso-bidi-font-weight: normal;"&gt;&amp;ldquo;Use of unassigned local variable 'z'&amp;rdquo; &lt;/strong&gt; hatası ile z yapısı i&amp;ccedil;in ilk değerlerin atanmadığını bize s&amp;ouml;yleyecektir. Ancak z isimli Zaman yapı t&amp;uuml;r&amp;uuml;n&amp;uuml; new anahtarı ile tanımlarsak durum değişir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Zaman z; 

Satırı yerine 

Zaman z=new Zaman();&lt;/pre&gt;
&lt;p&gt;yazalım .Bu durumda kod derlenir. Uygulama &amp;ccedil;alıştığında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşırız.&amp;nbsp; G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi z isimli yapı &amp;ouml;rneğini new yapılandırıcısı ile tanımladığımızda, derleyici bu yapı i&amp;ccedil;indeki &amp;ouml;zelliklere ilk değerleri kendi atamıştır. Kosucu isimli &amp;ouml;zellik i&amp;ccedil;in null, diğer integer &amp;ouml;zellikler i&amp;ccedil;in ise 0. &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;img src="/makale/images/mk12_3.jpg" alt="" width="256" height="103" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em&gt; Şekil 3.New yapılandırıcısı ile ilk değer ataması.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Yine &amp;ouml;nemli bir farkta yapılarda t&amp;uuml;retme yapamıyacağımızdır. Bilindiği gibi bir sınıf oluşturduğumuzda bunu başka bir temel sınıftan kalıtım yolu ile t&amp;uuml;retebilmekteyiz ki inheritance olarak ge&amp;ccedil;en bu kavramı ilerliyen makalelerimizde işleyeceğiz. Ancak bir yapıyı başka bir yapıyı temel alarak t&amp;uuml;retemeyiz. Şimdi yukarıda verdiğimiz &amp;ouml;rnekteki yapıdan başka bir yapı t&amp;uuml;retmeye &amp;ccedil;alışalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;struct

yeni:Zaman
{ 

} &lt;/pre&gt;
&lt;p&gt;satırlarını&amp;nbsp; kodumuza ekleyelim.Bu durumda&amp;nbsp; uygulamayı derlemeye &amp;ccedil;alıştığımızda aşağıdaki hata mesajını alırız.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;strong style="mso-bidi-font-weight: normal;"&gt; 'Zaman' : type in interface list is not an interface&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Bu belirgin farklılıklarıda inceledikten sonra dilerseniz &amp;ouml;rneklerimiz ile konuyu pekiştirmeye &amp;ccedil;alışalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 

namespace StructSample1
{
     struct Zaman
     {
        private int saat,dakika,saniye;
        private string kosucuAdi;
        /* Yapı i&amp;ccedil;in parametreli bir constructor metod tanımladık. Yapı i&amp;ccedil;inde yer alan kosucuAdi,saat,dakika,saniye alanlarına ilk değerlerin atandığına dikkat edelim. Bunları atamassak derleyici hatası alırız. */
        public Zaman(string k,int s,int d,int sn)
        {
               kosucuAdi=k;
               saat=s;
               dakika=d;
               saniye=sn;
          } 

     /* Bir dizi &amp;ouml;zellik tanımlayarak private olarak tanımladığımız asıl alanların kullanımını kolaylaştırıyoruz. */
    public string Kosucu
    {
        get
        {
            return kosucuAdi;
        }
        set
        {
            kosucuAdi=value;
        }
    } 
         public int Saat
         {             
             get
             {               
                 return saat;
             }
             set
             {
                 saat=value;
             }
         }  
         public int Dakika
         {
             get
             {
                 return dakika;
             }         
             set
             {
                 dakika=value;
             }
         }       
         public int Saniye
         {
             get
             {
                 return saniye;
             }            
             set
             {
                 saniye=value;
             }
          }
     } 
    class Class1
    {         
        static void Main(string[] args)
        {
            /* Zaman yapısı i&amp;ccedil;inde kendi yazdığımız parametreli constuructorlar ile Zaman yapısı &amp;ouml;rnekleri oluşturuyoruz. Yaptığımız bu tanımlamarın ardından belleğin stack b&amp;ouml;lgesinde derhal 4 adet değişken oluşturulur ve değerleri atanır. Yani kosucuAdi,saat,dakika,saniye isimli private olarak tanımladığımız alanlar bellekte stack b&amp;ouml;lgesinde oluşturulur ve atadığımız değerleri alırlar. Bu oluşan veri dizisinin adıda Zaman yapısı tipinde olan Baslangic ve Bitis değişkenleridir. */ 
 &lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk12_4.gif" alt="" width="364" height="251" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;               Zaman Baslangic= new Zaman("Burak",1,15,23);
               Zaman Bitis=new Zaman("Burak",2,20,25); 
              

/* Zaman yapısı i&amp;ccedil;inde tanımladığımız &amp;ouml;zelliklere erişip işlem yapıyoruz. Burada elbette zamanları birbirinden bu şekilde &amp;ccedil;ıkarmak matematiksel olarak bir cinayet. Ancak amacımız yapıların kullanımını anlamak. Bu satırlarda yapı i&amp;ccedil;indeki &amp;ouml;zelliklerimizin değerlerine erişiyor ve bunların değerleri ile sembolik işlemler yapıyoruz */             

int saatFark=Bitis.Saat-Baslangic.Saat;
              
int dakikaFark=Bitis.Dakika-Baslangic.Dakika;
              
int saniyeFark=Bitis.Saniye-Baslangic.Saniye; 
               Console.WriteLine("Fark {0} saat, {1} dakika, {2} saniye",saatFark,dakikaFark,saniyeFark);      
          }
     }
} &lt;/pre&gt;
&lt;p&gt;Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2003-12-04 11:00:00</pubDate>
  <slug>struct-kavrami-ve-class-ile-struct-arasindaki-farklar</slug>
  <tags>
    <tag>struct</tag>
    <tag>class</tag>
    <tag>c#</tag>
    <tag>c#-temelleri</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>