<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tek Fotoluk İpucu 141 - Dosyadan Rastgele Satır Çekmek</title>
  <description>Elinizde N sayıda şarkı adının kayıtlı olduğu fiziki bir dosya olduğunu düşünün. Amacımız ise bu dosya içerisinden rastgele şarkılar çekmek. Ancak bunu yaparken ilgili dosyanın tamamını belleğe açmak istemiyorsunuz. Nitekim dosyayı okuma modunda açıp readlines gibi bir metod ile tüm içeriğ okuduktan sonra içinden rastgele bir satırı seçme yolunu tercih edebilirsiniz. Ama bu büyük boyutlu bir dosyanın tamamen belleğe yüklenmesine de neden olacaktır. Performans ve hız açısından farklı bir şey yapılabilmelidir. Örneğin belleğe sadece o anki satırı okuyup ileri yönlü hareket edecek bir iterasyon kodu geliştirilebilir. Peki Ruby'de bunun için nasıl bir yol izlerdiniz? Aşağıdaki fotoğraftaki gibi olabilir mi?</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Elinizde N sayıda şarkı adının kayıtlı olduğu fiziki bir dosya olduğunu d&amp;uuml;ş&amp;uuml;n&amp;uuml;n. Amacımız ise bu dosya i&amp;ccedil;erisinden rastgele şarkılar &amp;ccedil;ekmek. Ancak bunu yaparken ilgili dosyanın tamamını belleğe a&amp;ccedil;mak&amp;nbsp;istemiyorsunuz. Nitekim dosyayı okuma modunda a&amp;ccedil;ıp readlines gibi bir metod ile t&amp;uuml;m i&amp;ccedil;eriğ okuduktan sonra i&amp;ccedil;inden rastgele bir satırı se&amp;ccedil;me yolunu tercih edebilirsiniz. Ama bu b&amp;uuml;y&amp;uuml;k boyutlu bir dosyanın tamamen belleğe y&amp;uuml;klenmesine de neden olacaktır. Performans ve hız a&amp;ccedil;ısından farklı bir şey yapılabilmelidir. &amp;Ouml;rneğin belleğe sadece o anki satırı okuyup ileri y&amp;ouml;nl&amp;uuml; hareket edecek bir iterasyon kodu geliştirilebilir. Peki&amp;nbsp;Ruby'de bunun i&amp;ccedil;in nasıl bir yol izlerdiniz? Aşağıdaki fotoğraftaki gibi olabilir mi?&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/11/tfi_141.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Enumerable mod&amp;uuml;l&amp;uuml; i&amp;ccedil;erisine getRandomLine isimli bir metod yerleştirdik. Metod aslında numaralandırıcı olarak gelen listeyi dolaşmakta. Bunun i&amp;ccedil;in each_with_index fonksiyonundan yararlanıyoruz. each_with_index fonksiyonu iki parametre alıyor. İlki numaralandırıcının o an &amp;uuml;zerinde olduğu veri&lt;em&gt;(ki &amp;ouml;rneğimizde bu dosya satırı olacak)&lt;/em&gt;, ikincisi ise index numaras&lt;em&gt;(ki bu da hangi satırda olduğumuzu g&amp;ouml;sterecek)&lt;/em&gt;&amp;nbsp;Blok i&amp;ccedil;erisinde rastgele sayı &amp;uuml;retip bir kontrol ger&amp;ccedil;ekleştiriyor ve o anki satırın bu koşula&amp;nbsp;uyması halinde line değişkenine atanmasını ve son olarak nil değilse geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesini sağlıyoruz.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek metin dosyasını a&amp;ccedil;tıktan sonra getRandomLine metodunu &amp;uuml;zerinde uygulayabiliriz &amp;ccedil;&amp;uuml;nk&amp;uuml; satır bazında ileri y&amp;ouml;nl&amp;uuml; itere edilebilir bir nesne &amp;ouml;rneği vermektedir. Dikkat edilmesi gereken nokta ise rewind &amp;ccedil;ağrısıdır. Nitekim satır bulunurken mutlak olarak dosya sonuna gelinmektedir. Yani her satır okunur. Bu y&amp;uuml;zden tekrar başa d&amp;ouml;nmezsek sadece ilk seferde şarkı se&amp;ccedil;imi ger&amp;ccedil;ekleşir ve sonraki iterasyonlarda nil değerler alınır&lt;em&gt;(Şarkıları rahat&amp;ccedil;a g&amp;ouml;rebilmek i&amp;ccedil;in program Thread'ini 2 saniye s&amp;uuml;reyle uyutuyoruz ki konumuzla &amp;ccedil;ok alakalı değil)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu tekniği i&amp;ccedil;eriğinde farklı veriler tutan pek &amp;ccedil;ok dosya i&amp;ccedil;in uygulayabilirsiniz. &amp;Ouml;rneğin kullanıcılara rastgele promosyon uygulanacağı durumlarda verinin fiziki dosyada saklanması s&amp;ouml;z konusu ise bu tip bir metod olduk&amp;ccedil;a işe yarayacaktır. B&amp;ouml;ylece geldik bir ipucunun&amp;nbsp;daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-11-01 21:36:00</pubDate>
  <slug>tek-fotoluk-ipucu-141-dosyadan-rastgele-satir-cekmek</slug>
  <tags>
    <tag>ruby</tag>
    <tag>enumerable</tag>
    <tag>mixin</tag>
    <tag>i-o</tag>
    <tag>random</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>