<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF Interceptors</title>
  <description>WCF(Windows Communication Foundation) alt yapısının popüler olmasının en büyük nedenlerinden birisi de, hemen her seviyede genişletilebilir olmasıdır. Genişleyebilirlik, bir Framework için oldukça önemli bir özelliktir. Nitekim bu yeteneğin olması, geliştiricilerin daha fazla noktada müdahalede bulunabilme ve ihtiyaçları daha fazla yerde çözümleyebilme kabiliyetini kazanabilmesi anlamına gelmektedir.</description>
  <content>&lt;p&gt;&lt;a href="/pics/32484720231_large.jpg"&gt;&lt;img style="margin: 4px 0px; display: inline; float: right;" title="32484720231_large" src="/pics/32484720231_large_thumb.jpg" alt="32484720231_large" width="320" height="213" align="right" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Hepimizin hafızasında yer eden ve defalarca seyretse de asla sıkılmayacağı k&amp;uuml;lt filmler vardır. Hatta nesiller ilerledik&amp;ccedil;e, her neslin mutlaka en az bir kere uğradığı, uğraması gereken yapımlar vardır.&lt;/p&gt;
&lt;p&gt;The Godfather, Starwars, Matrix, The Good the bad and the ugly, Back to the future vb&amp;hellip;Bunlardan birisi de benim i&amp;ccedil;in &lt;strong&gt;&lt;a href="http://www.imdb.com/title/tt0079501/" target="_blank"&gt;Mad Max&lt;/a&gt;&lt;/strong&gt;&amp;rsquo; dir.&lt;/p&gt;
&lt;p&gt;Serinin ilgin&amp;ccedil; konusu dışında en &amp;ccedil;ok dikkatimi &amp;ccedil;eken&lt;em&gt;(pek &amp;ccedil;ok erkeğin de dikkatini &amp;ccedil;etkiği &amp;uuml;zere)&lt;/em&gt; filmde kullanılan ara&amp;ccedil;lardır. Bunlardan birisi de o zamanlar yol devriyesi olarak g&amp;ouml;rev yapan &lt;strong&gt;V8&lt;/strong&gt; motora sahip &lt;strong&gt;1974 &lt;/strong&gt;model &lt;strong&gt;Ford Falcon XB&lt;/strong&gt; dir. Tabi bunu tahmin edeceğiniz &amp;uuml;zere siyah&amp;nbsp; renkli efsanevi &lt;strong&gt;Ford GT351&lt;/strong&gt; takip etmiştir. &lt;a href="http://en.wikipedia.org/wiki/Mad_Max#Vehicles" target="_blank"&gt;Detaylar i&amp;ccedil;in wikipedia&amp;rsquo; dan bilgi alabilirsiniz&lt;/a&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Peki bizimle ne alakası var &lt;img class="wlEmoticon wlEmoticon-whome" style="border-style: none;" src="/pics/wlEmoticon-whome_2.png" alt="Who me?" /&gt; Bu yazımızda farklı bir &lt;strong&gt;Interceptor&lt;/strong&gt; kavramını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alıyor olacağız.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF(Windows Communication Foundation)&lt;/strong&gt; alt yapısının pop&amp;uuml;ler olmasının en b&amp;uuml;y&amp;uuml;k nedenlerinden birisi de, hemen her seviyede genişletilebilir olmasıdır. Genişleyebilirlik, bir &lt;strong&gt;Framework&lt;/strong&gt; i&amp;ccedil;in olduk&amp;ccedil;a &amp;ouml;nemli bir &amp;ouml;zelliktir. Nitekim bu yeteneğin olması, geliştiricilerin daha fazla noktada m&amp;uuml;dahalede bulunabilme ve ihtiya&amp;ccedil;ları daha fazla yerde &amp;ccedil;&amp;ouml;z&amp;uuml;mleyebilme kabiliyetini kazanabilmesi anlamına gelmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF&lt;/strong&gt; tarafındaki &lt;strong&gt;genişletilebilirlik&lt;/strong&gt;&lt;em&gt;(extendability)&lt;/em&gt; ve hatta yeniden yazabilme yetenekleri, &lt;strong&gt;WCF&lt;/strong&gt; alt yapısı &amp;uuml;zerine oturmuş yan &amp;uuml;r&amp;uuml;nlerin de oluşmasına neden olmuştur. S&amp;ouml;z gelimi&lt;strong&gt; Data Service&amp;rsquo;&lt;/strong&gt; ler veya &lt;strong&gt;WCF Web API&lt;/strong&gt; bu duruma verilebilecek en g&amp;uuml;zel &amp;ouml;rneklerdendir. Tabi bunun dışında daha ince ayarlar da yapılabilir. S&amp;ouml;z gelimi kendi &lt;strong&gt;ServiceHost&lt;/strong&gt; ortamımızı yazabiliriz veya &amp;ouml;zel &lt;strong&gt;kanal yığını&lt;/strong&gt;&lt;em&gt;(Channel Stack)&lt;/em&gt; oluşturup g&amp;uuml;venlik i&amp;ccedil;in daha etkin &amp;ccedil;&amp;ouml;z&amp;uuml;mler &amp;uuml;retebiliriz. Ya da kendi &lt;strong&gt;Binding&lt;/strong&gt; tipimizi geliştirerek şirketimize ait bir mesajlaşma protokol&amp;uuml;n&amp;uuml;n devreye alınmasını sağlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF&lt;/strong&gt; &amp;ccedil;alışma mantığı d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde istemci ve servis tarafı&lt;em&gt;(Dispatcher diyelim bu yazımız i&amp;ccedil;in)&lt;/em&gt; arasındaki iletişim sırasında da araya girebileceğimiz konumlar bulunmaktadır. Sonu&amp;ccedil;ta istemci bir mesajı servis tarafına g&amp;ouml;nderir ve karşılığında genellikle bir cevap bekler&lt;em&gt;(veya beklemez. OneWay tipindeki operasyonları d&amp;uuml;ş&amp;uuml;nelim)&lt;/em&gt; İşte bu s&amp;uuml;re&amp;ccedil;te parametre dahil, mesaj seviyesinde dahi araya girebilir ve istediklerimizi ger&amp;ccedil;ekleştirebiliriz. İşte bu yazımızın konusu da budur. &lt;strong&gt;Interceptors&lt;/strong&gt; &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_144.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Interceptor kelimesi durdurucu, yol kesen, &amp;ouml;nleme u&amp;ccedil;ağı gibi anlamlara gelmektedir. Lakin ilerleyen kısımlarda g&amp;ouml;receğiniz gibi kendi geliştireceğimiz &amp;ouml;zel kesici tipler Inspector kelimesini i&amp;ccedil;eren aray&amp;uuml;zleri(Interface) uygular. Inspector ise kontrol&amp;ouml;r, denetleyici, denetmen, m&amp;uuml;fettiş gibi anlamlara gelmektedir. Dolayısıyla kelimeler ve kavramlar birbirleri yerine ge&amp;ccedil;ebilirler. Algıda bir karmaşa olmaması adına belirtmek isterim.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;Interceptor&amp;rsquo;&lt;/strong&gt; ler bir servis operasyonu &amp;ouml;ncesinde veya sonrasında devreye girebilmektedirler. WCF tarafında kesmede bulunabileceğimiz 4 yer vardır. &amp;Ouml;ncelikli olarak bir servis operasyonunun parametrelerini değerlendirebilir ve hatta değiştirebiliriz. Yani bir servis operasyonunun parametresi işlenmeden &amp;ouml;nce m&amp;uuml;dahalede bulunma şansına sahibiz.&lt;/p&gt;
&lt;p&gt;2nci olarak servis tarafına gelen bir mesajın yakalanması da m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bu mesaj ele alınıp yine d&amp;uuml;zenlenebilir ve bir kontrol s&amp;uuml;recine dahil edilebilir. Hatta d&amp;ouml;necek olan mesaj i&amp;ccedil;eriğ i&amp;ccedil;in de aynı durum s&amp;ouml;z konusudur. 3nc&amp;uuml; olarak bir mesajın formatına m&amp;uuml;dahalede bulunulabilecek seviyede kesme yapılabilir. 4nc&amp;uuml; ve son olarak da &amp;ccedil;ağırılan bir operasyonun kendisi i&amp;ccedil;in kesme işlemi uygulanabilir.&lt;/p&gt;
&lt;p&gt;Biz bu yazımızda mesaj ve parametre seviyesinde kesme işlemlerinin nasıl uygulanabileceğini incelemeye &amp;ccedil;alışıyor olacağız. Bu ama&amp;ccedil;la ilk olarak &lt;strong&gt;Visual Studio&lt;/strong&gt;&lt;em&gt;(2010 veya 2012 olabilir)&lt;/em&gt; ortamında basit bir&lt;strong&gt; WCF Service Application&lt;/strong&gt; projesi oluşturalım. Başlangı&amp;ccedil; i&amp;ccedil;in aşağıdaki sınıf diyagramında yer alan tipleri yazabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfi_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfi_1" src="/pics/wcfi_1_thumb.png" alt="wcfi_1" width="585" height="304" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Servis s&amp;ouml;zleşmesi olan &lt;strong&gt;IShipService&lt;/strong&gt; aşağıdaki gibi yazılabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ServiceModel;

namespace SomeServiceApp 
{ 
    [ServiceContract] 
    public interface IShipService 
    { 
        [OperationContract] 
        string SaveWorkItem(WorkItem item);

        [OperationContract] 
        bool ProcessCadImage(byte[] sourceData); 
    } 
}&lt;/pre&gt;
&lt;p&gt;Servis s&amp;ouml;zleşmesine ait implementasyonu ger&amp;ccedil;ekleştirdiğimiz tip ise şu şekilde yazılabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace SomeServiceApp 
{ 
    public class ShipService 
       : IShipService 
    { 
        public string SaveWorkItem(WorkItem item) 
        { 
            return string.Format("{0}[{3}] {1} tarihinde {2} tarafından oluşturuldu" 
                , item.Title 
                ,item.CreatedDate 
                ,item.Owner 
                ,item.Type); 
        }

        public bool ProcessCadImage(byte[] sourceData) 
        { 
            return true; 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Bu basit servis i&amp;ccedil;erisinde iki operasyon uygulanmaktadır. &lt;strong&gt;SaveWorkItem&lt;/strong&gt; aşağıda i&amp;ccedil;eriği verilen &lt;strong&gt;WorkItem&lt;/strong&gt; tipinden bir parametre almakta ve bunu sembolik olarak işlemektedir. &lt;strong&gt;ProcessCadImage&lt;/strong&gt; operasyonu ise&lt;strong&gt; byte[]&lt;/strong&gt; tipinden bir parametre ile &amp;ccedil;alışmaktadır. Yine bu operasyonun i&amp;ccedil; yapısı da &amp;ccedil;ok &amp;ouml;nemli olmadığından varsayılan olarak &lt;strong&gt;true&lt;/strong&gt; d&amp;ouml;nd&amp;uuml;recek şekilde geliştirilmiştir.&lt;/p&gt;
&lt;p&gt;WorkItem sınıfı i&amp;ccedil;eriği;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace SomeServiceApp 
{ 
    public class WorkItem 
    { 
        public string Title { get; set; } 
        public DateTime CreatedDate { get; set; } 
        public string Owner { get; set; } 
        public WorkItemType Type { get; set; } 
    } 
}&lt;/pre&gt;
&lt;p&gt;WorkItemType Enum sabiti;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace SomeServiceApp 
{ 
    public enum WorkItemType 
    { 
        UserStory, 
        Task, 
        TestCase, 
        Bug 
    } 
}&lt;/pre&gt;
&lt;h2&gt;&lt;strong&gt;Parametre Bazlı Kontrol&amp;ouml;r (Parameter Inspector)&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Parametre bazlı kesme tiplerinin kullanılabileceği senaryolardan ilk akla gelen sanıyorumki doğrulama operasyonlarıdır. S&amp;ouml;z gelimi &amp;ouml;rnek servisimizi g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda, &lt;strong&gt;ProcessCadImage&lt;/strong&gt; operasyonuna gelen &lt;strong&gt;byte[]&lt;/strong&gt; tipinden dizinin i&amp;ccedil;eriğini kontrol ettirebilir ve ger&amp;ccedil;ekten bir &lt;strong&gt;Image&lt;/strong&gt; olup olmadığını denetleyebiliriz. Ama bu kadar komplike d&amp;uuml;ş&amp;uuml;nmemize şu aşamada pek gerek yoktur &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_144.png" alt="Winking smile" /&gt; Sonu&amp;ccedil;ta basit bir boyut kontrol&amp;uuml; de pekala işimizi g&amp;ouml;recektir. Buna g&amp;ouml;re ilk yapmamız gereken bir parametre kesicisi yazmaktır. Bunun i&amp;ccedil;in &lt;strong&gt;System.ServiceModel.Dispatcher&lt;/strong&gt; isim alanında bulunan &lt;strong&gt;IParameterInspector&lt;/strong&gt; t&amp;uuml;revli bir tip geliştirmemiz gerekecek. Aynen aşağıda olduğu gibi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ServiceModel; 
using System.ServiceModel.Dispatcher;

namespace SomeServiceApp 
{ 
    public class CADSizeInspector 
        :IParameterInspector 
    { 
        public double DefaultControlSize { get; set; }

        // Operasyon &amp;ccedil;ağrısı tamamlandıktan sonra devreye girecektir. 
        public void AfterCall(string operationName, object[] outputs, object returnValue, object correlationState) 
       { 
            
        }

        // &amp;Ccedil;ağırılan operasyon başlatılmadan &amp;ouml;nce devreye girecektir 
        public object BeforeCall(string operationName, object[] inputs) 
        { 
            // Operasyon adını kontrol ediyoruz 
            if (operationName == "ProcessCadImage") 
            { 
                // Gelen ilk parametre operasyonumuza g&amp;ouml;re byte[] dizisi. Eğer DefaultControlSize' dan b&amp;uuml;y&amp;uuml;kse geriye bir FaultException d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmektedir 
                if (((byte[])inputs[0]).Length &amp;gt; DefaultControlSize) 
                    throw new FaultException("CAD &amp;ccedil;izimine ait mesaj boyutu varsayılandan b&amp;uuml;y&amp;uuml;k."); 
            }

            // Herhangibir sıkıntı yoksa null d&amp;ouml;nerek operasyonun devam etmesini sağlayabiliriz. 
           return null; 
       } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;IParameterInspector&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;&lt;em&gt;(Interface)&lt;/em&gt; ile birlikte gelen iki kritik operasyon vardır. Bunlardan birisi &lt;strong&gt;AfterCall&lt;/strong&gt; diğeri ise &lt;strong&gt;BeforeCall&amp;rsquo;&lt;/strong&gt; dur. Geriye bir şey d&amp;ouml;nd&amp;uuml;rmeyen &lt;strong&gt;AfterCall&lt;/strong&gt; metodu, tahmin edileceği &amp;uuml;zere ilgili servis operasyonu işleyişini tamamladıktan sonra devreye girmektedir. Tabiri yerinde ise iş işten ge&amp;ccedil;tikten sonra diyebiliriz &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_64.png" alt="Smile" /&gt; İşin aslı, burada servis operasyon &amp;ccedil;ağrısının tamamlanması sonrası ger&amp;ccedil;ekleştirilecek işlemlere yer verebiliriz. Belki loglama veya performans &amp;ouml;l&amp;ccedil;&amp;uuml;mleri adına ideal bir yer olabilir.&lt;/p&gt;
&lt;p&gt;Geriye &lt;strong&gt;object&lt;/strong&gt; tipinden değer d&amp;ouml;nd&amp;uuml;ren ve &amp;ccedil;ağrıda bulunulan operasyon adı ile o operasyona gelen parametreler i&amp;ccedil;in &lt;strong&gt;object&lt;/strong&gt; tipinden bir diziyi parametre olarak alan &lt;strong&gt;BeforeCall&lt;/strong&gt; metodu ise, kesme işleminin uygulanabileceği en ideal yerdir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekteki kod par&amp;ccedil;asında, servis operasyonunun &lt;strong&gt;ProcessCadImage&lt;/strong&gt; olup olmadığı kontrol edilmiş ve bu işlemin ardından gelen ilk parametrenin &lt;strong&gt;byte[]&lt;/strong&gt; tipinden olan karşılığının uzunluğuna bakılmıştır. S&amp;ouml;z konusu uzunluk değeri bu sınıfın bir &amp;ouml;zelliğidir&lt;em&gt;(Property).&lt;/em&gt; Dolayısıyla kesme sınıfını &amp;uuml;rettiğimiz yerde belirlenebilir. Eğer servis operasyonuna g&amp;ouml;nderilen &lt;strong&gt;byte[]&lt;/strong&gt; dizisinin boyutu kabul edilebilir olandan &amp;ccedil;ok b&amp;uuml;y&amp;uuml;kse ortama bir &lt;strong&gt;FaultException&lt;/strong&gt; fırlatılmaktadır. &amp;Ccedil;ok doğal olarak bu istisna bilgisi istemci tarafına da gidecektir&lt;em&gt;(Eğer includeExceptionDetailInFaults niteliğinin değeri true ise)&lt;/em&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Aslında bu tip boyut kontrolleri i&amp;ccedil;in konfigurasyon dosyasında yer alan binding nitelikleri de kullanılabilir. Lakin bu ayarlarda daha &amp;ccedil;ok mesajın boyutu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınmaktadır. Bizim senaryomuzda ise dikkat edileceği &amp;uuml;zere operasyona gelen bir parametreye &amp;ouml;zg&amp;uuml; olacak şekilde boyut kontrol&amp;uuml; ger&amp;ccedil;ekleştirilmektedir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Peki parametre i&amp;ccedil;in gerekli kesme tipini tanımladık. Bunu WCF &amp;ccedil;alışma zamanı nasıl bilebilir? &lt;img class="wlEmoticon wlEmoticon-sarcasticsmile" style="border-style: none;" src="/pics/wlEmoticon-sarcasticsmile_11.png" alt="Sarcastic smile" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z konusu kesme operasyonu aslında bir servis metoduna ait olduğundan, nitelik bazlı bir davranış&lt;em&gt;(Attribute -ased Behavior)&lt;/em&gt; olarak ortama bildirilebilir. Yani, bir &lt;strong&gt;Custom Behavior&lt;/strong&gt; tipi s&amp;ouml;z konusudur. Bu ama&amp;ccedil;la aşağıdaki sınıfı geliştirmemiz yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.ServiceModel.Channels; 
using System.ServiceModel.Description; 
using System.ServiceModel.Dispatcher;

namespace SomeServiceApp 
{   
    public class CADSizeOperationBehavior 
        :Attribute,IOperationBehavior 
    { 
        public void AddBindingParameters(OperationDescription operationDescription, BindingParameterCollection bindingParameters) 
        { 
        }

        public void ApplyClientBehavior(OperationDescription operationDescription, ClientOperation clientOperation) 
        { 
        }

        // Servis tarafındaki dispatch s&amp;uuml;recinde araya girilmesi i&amp;ccedil;in gerekli tanımlamanın yapıldığı metoddur 
        public void ApplyDispatchBehavior(OperationDescription operationDescription, DispatchOperation dispatchOperation) 
        { 
            // s&amp;uuml;rece bir Parametre kesici tipi bildirilmektedir 
            dispatchOperation.ParameterInspectors.Add( 
                new CADSizeInspector 
                { 
                    DefaultControlSize = 1024 // Bu kontrol değeri ve benzeri &amp;ouml;zellikler Behavior tipi i&amp;ccedil;erisinde tanımlanıp ge&amp;ccedil;irilebilir de 
                } 
                ); 
        }

        public void Validate(OperationDescription operationDescription) 
        { 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;CADSizeOperationBehavior&lt;/strong&gt; tipi &lt;strong&gt;Attribute&lt;/strong&gt; sınıfından t&amp;uuml;remekte ve &lt;strong&gt;IOperationBehavior&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;&lt;em&gt;(Interface)&lt;/em&gt; uygulamaktadır. Bu aray&amp;uuml;z i&amp;ccedil;erisinde gelen ve &lt;strong&gt;ezilmesi&lt;/strong&gt;&lt;em&gt;(override)&lt;/em&gt; gereken 4 temel metod bulunmaktadır. Senaryoya uygun olacak şekilde bu fonksiyonelliklerden biri veya bir ka&amp;ccedil;ı ele alınabilir.&lt;/p&gt;
&lt;p&gt;Bizim senaryomuzda parametre bazlı bir kesicinin, &lt;strong&gt;Dispatch&lt;/strong&gt; işlemi sırasında devreye girmesi beklenmektedir. Bir başka deyişle servis tarafındaki işlem s&amp;uuml;reci sırasında y&amp;uuml;r&amp;uuml;rl&amp;uuml;ğe girecek bir kesici tipden bahsedilmektedir. Bu sebepten &lt;strong&gt;ApplyDispatchBehavior&lt;/strong&gt; metodu i&amp;ccedil;erisinde bir tanımlama yapılmıştır. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;DispatchOperation&lt;/strong&gt; tipinden olan &lt;strong&gt;dispatchOperation&lt;/strong&gt; parametresinin &lt;strong&gt;ParameterInspectors&lt;/strong&gt; koleksiyonuna yeni bir &lt;strong&gt;CADSizeInspector&lt;/strong&gt; sınıf &amp;ouml;rneği ilave edilmiştir.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak tanımlanan bu davranışın servis operasyonunun implemente edildiği metod i&amp;ccedil;inde bildirilmesi gerekecektir. &lt;strong&gt;Attribute&lt;/strong&gt; t&amp;uuml;revli bir tip geliştirdiğimizden &lt;strong&gt;ProcessCadImage&lt;/strong&gt; operasyonuna bu davranışı aşağıdaki gibi enjekte edebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;// ProccessCad i&amp;ccedil;in &amp;ouml;zel bir &amp;ccedil;alışma zamanı davranışı belirtilmiştir. 
[CADSizeOperationBehavior] 
public bool ProcessCadImage(byte[] sourceData) 
{ 
    return true; 
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;zetle servis tarafında Parametre bazlı kesici i&amp;ccedil;in aşağıdaki sınıf diagramında g&amp;ouml;r&amp;uuml;len tiplerin geliştirildiğini ifade edebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfi_2.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfi_2" src="/pics/wcfi_2_thumb.png" alt="wcfi_2" width="480" height="456" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Artık istemci tarafı i&amp;ccedil;in &amp;ouml;rnek bir uygulama geliştirebilir ve sonu&amp;ccedil;ları irdeleyebiliriz. Basit bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması işimizi g&amp;ouml;recektir. Servis referansını istemci tarafına ilave ettikten sonra aşağıdaki &amp;ouml;rnek kod satırlarını yazabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using ClientApp.ShipServiceReference; 
using System;

namespace ClientApp 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            ShipServiceClient proxy = null; 
            try 
            { 
                proxy = new ShipServiceClient("BasicHttpBinding_IShipService");

                WorkItem wi = new WorkItem 
                { 
                    CreatedDate = DateTime.Now, 
                    Owner = "Burak", 
                    Title = "Login sayfasına ait Web User Control geliştirilmesi", 
                    Type = WorkItemType.Task 
                };

                string swiResult = proxy.SaveWorkItem(wi); 
                Console.WriteLine(swiResult);

                byte[] someImageData = new byte[2048]; 
                bool pcResult = proxy.ProcessCadImage(someImageData); 
                Console.WriteLine(pcResult); 
            } 
            catch (Exception excp) 
            { 
                Console.WriteLine(excp.Message); 
            } 
            finally 
            { 
                if (proxy != null 
                    &amp;amp;&amp;amp; proxy.State == System.ServiceModel.CommunicationState.Opened) 
                    proxy.Close(); 
            } 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;İstemci tarafı sırasıyla &lt;strong&gt;SaveWorkItem&lt;/strong&gt; ve &lt;strong&gt;ProcessCadImage&lt;/strong&gt; isimli servis operasyonlarını &amp;ccedil;ağırmaktadır. S&amp;ouml;z konusu işlemler bir &lt;strong&gt;try&amp;hellip;catch&amp;hellip;finally&lt;/strong&gt; bloğu i&amp;ccedil;erisinde icra edilmektedir. İlk &amp;ouml;nce &lt;strong&gt;Fault&lt;/strong&gt; durumunu kontrol etmek istediğimizden, &lt;strong&gt;ProcessCadImage&lt;/strong&gt; metodu i&amp;ccedil;in &lt;strong&gt;byte[]&lt;/strong&gt; tipinden olan dizinin parametresi kasıtlı olarak &lt;strong&gt;1024&lt;/strong&gt;&amp;rsquo; &amp;uuml;n &amp;uuml;st&amp;uuml;nde tutulmuştur. Buna g&amp;ouml;re &amp;ccedil;alışma zamanında aşağıdakine benzer bir sonu&amp;ccedil;la karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfi_3.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfi_3" src="/pics/wcfi_3_thumb.png" alt="wcfi_3" width="588" height="103" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Parametre bazlı &amp;ccedil;alışan kesici tip devreye girmiş ve servis tarafında &amp;uuml;retilen &lt;strong&gt;Fault&lt;/strong&gt; mesajı istemci tarafında da ele alınabilmiştir. &lt;em&gt;(Bu noktada AfterCall metoduna hi&amp;ccedil; uğranılmayacağını da ifade edebiliriz)&lt;/em&gt; Tabi tam tersi durumu da test etmemiz yerinde olacaktır. Yani uygun bir boyut g&amp;ouml;nderdiğimizde true değerini aldığımızı da g&amp;ouml;rmeliyiz &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_144.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Mesaj Bazlı Kesici (Message Interceptor)&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Gelelim mesaj bazında kesme işleminin nasıl yapılabileceğine. Mesaj kesme işlemini istemci veya servis tarafında ger&amp;ccedil;ekleştirebiliriz. Eğer servis tarafında&lt;em&gt;(Dispatch kısmı)&lt;/em&gt; bir kesici s&amp;ouml;z konusu ise &amp;ouml;ncelikli olarak &lt;strong&gt;IDispatchMessageInspector&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; implemente edecek bir sınıfın geliştirilmesi gerekmektedir. İstemci taraflı bir kesme operasyonu i&amp;ccedil;in de &lt;strong&gt;IClientMessageInspector&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; uygulanmalıdır. Bazı senaryolarda her iki aray&amp;uuml;z&amp;uuml;n implemente edildiği tek bir hybrid tip de s&amp;ouml;z konusu olabilir. Bu sayede hem istemci hem de servis tarafı i&amp;ccedil;in &amp;ccedil;alışabilecek bir mesaj kesicisi geliştirilebilir. Biz &amp;ouml;rnek senaryomuzda mesajın toplandığı servis tarafını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alarak ilerleyeceğiz. Bu nedenle &lt;strong&gt;IDispatchMessageInspector&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; değerlendiriyor olacağız.&lt;/p&gt;
&lt;p&gt;Mesaj kesicilerini yazmanın en zorlu yanı gelen bilginin formatına g&amp;ouml;re bir parser ihtiyacı olmasıdır. Varsayılan ve bildiğimiz &amp;uuml;zere mesajın i&amp;ccedil;eriği tamamen &lt;strong&gt;XML&lt;/strong&gt; formatındadır. Ancak &lt;strong&gt;WCF Web API&lt;/strong&gt; gibi alt yapıların sunduğu &lt;strong&gt;JSON&lt;/strong&gt; formatlı i&amp;ccedil;erikler de servis tarafına gelebilir. Dolayısıyla b&amp;ouml;yle bir durumda &lt;strong&gt;JSON&lt;/strong&gt; tabanlı bir &lt;strong&gt;parsing&lt;/strong&gt; işlemi de işin i&amp;ccedil;erisine girecektir.&amp;nbsp; Aynı durum TCP bazlı &amp;ccedil;alışan mesajların olduğu durumda daha farklı bir hal alacaktır.&lt;/p&gt;
&lt;p&gt;Fazla vakit kaybetmeden hemen bir implementasyona başlayalım dilerseniz. İlk olarak &lt;strong&gt;IDispatchMessageInspector&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulayan bir sınıf ile işe başlıyoruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ServiceModel; 
using System.ServiceModel.Channels; 
using System.ServiceModel.Dispatcher;

namespace SomeServiceApp 
{ 
    public class ShipServiceMessageInspector 
       :IDispatchMessageInspector 
    { 
        // Operasyon talebi servis tarafına ulaştıkan sonra devreye giriyor olacak 
        public object AfterReceiveRequest(ref Message request, IClientChannel channel, InstanceContext instanceContext) 
       { 
            // Gelen request nesnesinin i&amp;ccedil;eriği ele alınır ;)

            return null; 
       }

        // Cevap istemci tarafına g&amp;ouml;nderilmeden &amp;ouml;nce &amp;ccedil;ağırılacak. Tabi eğer istisnai bir durum oluşmamışsa 
        public void BeforeSendReply(ref Message reply, object correlationState) 
       {             
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;AfterReceiveRequest&lt;/strong&gt; tahmin edileceği &amp;uuml;zere istemciden ilgili operasyon i&amp;ccedil;in gelen talep alındığında devreye girmektedir. Burada mesaj i&amp;ccedil;eriği hen&amp;uuml;z &lt;span style="text-decoration: underline;"&gt;işlenmemiştir&lt;/span&gt;. Bir başka deyişle taleb edilen operasyon hen&amp;uuml;z &amp;ccedil;alıştırılmamıştır. Dolayısıyla gelen mesaj alınıp, istenirse değiştirilebilir &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_144.png" alt="Winking smile" /&gt;&lt;em&gt;(Message tipinden olan request değişkeninin ref ile tanımlandığına dikkat edelim. Dolayısıyla runtime&amp;rsquo; da mesajın geldiği yerde bulunan mesaj i&amp;ccedil;eriği buradan değiştirilebilir)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;BeforeSendReply&lt;/strong&gt; metodu ise istemcinin talep ettiği operasyonun işlenmesi sonrası cevap d&amp;ouml;n&amp;uuml;lmeden &amp;ouml;nce devreye giren fonksiyondur. Burada da dikkat edileceği &amp;uuml;zere d&amp;ouml;n&amp;uuml;ş i&amp;ccedil;in kullanılan mesaj ele alınabilir ve istenirse değiştirilebilir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizde her iki operasyon i&amp;ccedil;eriği de boş bırakılmıştır. Siz, s&amp;ouml;z konusu implementasyonu yaparken bir senaryo &amp;uuml;zerinden gidebilirsiniz. &amp;Ouml;rneğin gelen mesaj i&amp;ccedil;eriğinde yer alan T&amp;uuml;rk&amp;ccedil;e karakterleri ayrıştırma veya d&amp;ouml;n&amp;uuml;ş sırasında &amp;uuml;retilen mesajı kendi geliştirdiğiniz ve şirketinize &amp;ouml;zel algoritmaya g&amp;ouml;re şifreleyerek g&amp;ouml;ndermek gibi &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_144.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;p&gt;Mesaj tabanlı kesici tip geliştirildikten sonra, parametre kesicilerindekine benzer olarak, &amp;ccedil;alışma zamanına bir bildirimde bulunmamız gerekecektir. Bu sefer bu bildirimi konfigurasyon bazlı olacak şekilde ger&amp;ccedil;ekleştireceğiz. Bu ama&amp;ccedil;la bir &lt;strong&gt;Endpoint&lt;/strong&gt; davranışı belirleyip bunu konfigurasyon dosyasında değerlendirilebilecek şekilde ele almamız yeterlidir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Ancak istenirse s&amp;ouml;zleşme bazlı bir davranış da bildirilebilir. Bunun i&amp;ccedil;in de IContractBehavior aray&amp;uuml;z&amp;uuml;nden yararlanılmalıdır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;İlk olarak aşağıdaki tipi geliştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ServiceModel.Channels; 
using System.ServiceModel.Description; 
using System.ServiceModel.Dispatcher;

namespace SomeServiceApp 
{ 
    public class MessageInspectorEndpointBehavior 
        :IEndpointBehavior 
    { 
        public void AddBindingParameters(ServiceEndpoint endpoint, BindingParameterCollection bindingParameters) 
        { 
        }

        public void ApplyClientBehavior(ServiceEndpoint endpoint, ClientRuntime clientRuntime) 
        { 
        }

        public void ApplyDispatchBehavior(ServiceEndpoint endpoint, EndpointDispatcher endpointDispatcher) 
        { 
            endpointDispatcher.DispatchRuntime.MessageInspectors.Add(new ShipServiceMessageInspector()); 
        }

        public void Validate(ServiceEndpoint endpoint) 
        { 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;IEndpointBehavior&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulayan &lt;strong&gt;MessageInspectorEndpointBehavior&lt;/strong&gt; tipi i&amp;ccedil;erisinde &lt;strong&gt;ApplyDispatchBehavior&lt;/strong&gt; metodunun işlendiği g&amp;ouml;r&amp;uuml;lmektedir. Bu metod i&amp;ccedil;erisinde WCF &amp;ccedil;alışma zamanında bir &lt;strong&gt;Endpoint&lt;/strong&gt; davranışının bildirilmesi işlemi icra edilmektedir. Buna g&amp;ouml;re herhangibir &lt;strong&gt;Endpoint&lt;/strong&gt; i&amp;ccedil;in &lt;strong&gt;ShipServiceMessageInspector&lt;/strong&gt; isimli bir davranış tipi belirlenebilecektir. İkinci olarak s&amp;ouml;z konusu davranışın konfigurasyon dosyasında ele alınabilmesini sağlamak adına bir &lt;strong&gt;Element&lt;/strong&gt; tipi geliştirilmelidir. Aynen aşağıda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.ServiceModel.Configuration;

namespace SomeServiceApp 
{ 
    public class MessageInspectorExtensionElement 
        :BehaviorExtensionElement 
    { 
        public override Type BehaviorType 
       { 
            get { return typeof(MessageInspectorEndpointBehavior); } 
        }

        protected override object CreateBehavior() 
        { 
           return new MessageInspectorEndpointBehavior(); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Buraya kadar geliştirdiğimiz tiplerin &amp;ouml;zeti aşağıdaki sınıf &amp;ccedil;izelgesinde&lt;em&gt;(Class Diagram)&lt;/em&gt; olduğu gibidir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfi_4.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfi_4" src="/pics/wcfi_4_thumb.png" alt="wcfi_4" width="614" height="707" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Artık servis uygulamamızı geliştirdiğimiz&lt;strong&gt; WCF Serice Application&lt;/strong&gt; projesindeki &lt;strong&gt;web.config&lt;/strong&gt; dosyasında aşağıdaki gibi &amp;ouml;zel bir Endpoint davranışı belirleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt; 
&amp;lt;configuration&amp;gt; 
    &amp;lt;system.serviceModel&amp;gt; 
      &amp;lt;services&amp;gt; 
        &amp;lt;service name="SomeServiceApp.ShipService"&amp;gt; 
          &amp;lt;endpoint address="" binding="basicHttpBinding" contract="SomeServiceApp.IShipService" behaviorConfiguration="ShipServiceEndpointBehavior" /&amp;gt; 
        &amp;lt;endpoint address="mex" binding="mexHttpBinding" contract="IMetadataExchange" /&amp;gt; 
        &amp;lt;/service&amp;gt;          
      &amp;lt;/services&amp;gt; 
        &amp;lt;behaviors&amp;gt; 
            &amp;lt;serviceBehaviors&amp;gt; 
                &amp;lt;behavior name=""&amp;gt; 
                    &amp;lt;serviceMetadata httpGetEnabled="true"/&amp;gt; 
                    &amp;lt;serviceDebug includeExceptionDetailInFaults="true" /&amp;gt; 
                &amp;lt;/behavior&amp;gt; 
            &amp;lt;/serviceBehaviors&amp;gt; 
        &amp;lt;endpointBehaviors&amp;gt; 
        &amp;lt;behavior name="ShipServiceEndpointBehavior"&amp;gt; 
          &amp;lt;messageInspector/&amp;gt; 
        &amp;lt;/behavior&amp;gt; 
      &amp;lt;/endpointBehaviors&amp;gt; 
     &amp;lt;/behaviors&amp;gt; 
    &amp;lt;extensions&amp;gt; 
      &amp;lt;behaviorExtensions&amp;gt; 
        &amp;lt;add name="messageInspector" type="SomeServiceApp.MessageInspectorExtensionElement, SomeServiceApp"/&amp;gt; 
      &amp;lt;/behaviorExtensions&amp;gt; 
    &amp;lt;/extensions&amp;gt; 
    &amp;lt;/system.serviceModel&amp;gt; 
  &amp;lt;system.web&amp;gt; 
    &amp;lt;compilation debug="true"/&amp;gt; 
  &amp;lt;/system.web&amp;gt; 
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;extensions&lt;/strong&gt; elementi altında, &lt;strong&gt;MessageInspectorExtensionElement&lt;/strong&gt; tipi bildirilmiştir. Ancak bu bildirimden sonra &lt;strong&gt;messageInspector&lt;/strong&gt; adıyla bir elementin kullanılması ve ge&amp;ccedil;erli olması s&amp;ouml;z konusu olabilir. Bu tanımlamanın ardından g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;ShipServiceEndpointBehavior&lt;/strong&gt; isimli bir behavior bildirilmiş ve i&amp;ccedil;erisinde &lt;strong&gt;messageInspector&lt;/strong&gt; alt elementi kullanılmıştır. Son olarak bu davranışın &lt;strong&gt;Endpoint&lt;/strong&gt; i&amp;ccedil;in bildiriminin yapılması yeterli olmuştur.&lt;/p&gt;
&lt;p&gt;Yapılan bu ilavelerin ardından istemci tarafındaki &lt;strong&gt;proxy&lt;/strong&gt; tipinin de g&amp;uuml;ncelleştirilmesi gerekir. Eğer istemci ve servis tarafı &lt;strong&gt;Debug&lt;/strong&gt; edilerek ilerlenirse mesaj bazlı kesici i&amp;ccedil;erisinde yer alan &lt;strong&gt;AfterReceiveRequest&lt;/strong&gt; ve &lt;strong&gt;BeforeSendReply&lt;/strong&gt; operasyonlarında aşağıdaki mesaj i&amp;ccedil;eriklerinin hareket ettiği g&amp;ouml;zlemlenebilir.&lt;/p&gt;
&lt;p&gt;İlk &amp;ccedil;ağırılan &lt;strong&gt;SaveWorkItem&lt;/strong&gt; operasyonunda &lt;strong&gt;AfterReceiveRequest&amp;rsquo;&lt;/strong&gt; e gelen mesaj i&amp;ccedil;eriği,&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&amp;gt; 
  &amp;lt;s:Header&amp;gt; 
    &amp;lt;To s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none"&amp;gt; 
http://localhost:56119/ShipService.svc&amp;lt;/To&amp;gt; 
    &amp;lt;Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none"&amp;gt; 
http://tempuri.org/IShipService/SaveWorkItem&amp;lt;/Action&amp;gt; 
  &amp;lt;/s:Header&amp;gt; 
  &amp;lt;s:Body&amp;gt; 
    &amp;lt;SaveWorkItem xmlns="http://tempuri.org/"&amp;gt; 
      &amp;lt;item xmlns:a="http://schemas.datacontract.org/2004/07/SomeServiceApp" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&amp;gt; 
        &amp;lt;a:CreatedDate&amp;gt;2012-10-30T13:21:34.2638133+02:00&amp;lt;/a:CreatedDate&amp;gt; 
        &amp;lt;a:Owner&amp;gt;Burak&amp;lt;/a:Owner&amp;gt; 
        &amp;lt;a:Title&amp;gt;Login sayfasına ait Web User Control geliştirilmesi&amp;lt;/a:Title&amp;gt; 
        &amp;lt;a:Type&amp;gt;Task&amp;lt;/a:Type&amp;gt; 
      &amp;lt;/item&amp;gt; 
    &amp;lt;/SaveWorkItem&amp;gt; 
  &amp;lt;/s:Body&amp;gt; 
&amp;lt;/s:Envelope&amp;gt;&lt;/pre&gt;
&lt;p&gt;İlk &amp;ccedil;ağırılan &lt;strong&gt;SaveWorkItem&lt;/strong&gt; operasyonunda d&amp;ouml;n&amp;uuml;şe ge&amp;ccedil;ildikten sonra, &lt;strong&gt;BeforeSendReply&lt;/strong&gt; metodunda ele alınan mesaj i&amp;ccedil;eriği,&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&amp;gt; 
  &amp;lt;s:Header&amp;gt; 
    &amp;lt;Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none"&amp;gt; 
http://tempuri.org/IShipService/SaveWorkItemResponse&amp;lt;/Action&amp;gt; 
  &amp;lt;/s:Header&amp;gt; 
  &amp;lt;s:Body&amp;gt; 
    &amp;lt;SaveWorkItemResponse xmlns="http://tempuri.org/"&amp;gt; 
      &amp;lt;SaveWorkItemResult&amp;gt;Login sayfasına ait Web User Control geliştirilmesi[Task] 10/30/2012 1:29:39 PM tarihinde Burak tarafından oluşturuldu&amp;lt;/SaveWorkItemResult&amp;gt; 
    &amp;lt;/SaveWorkItemResponse&amp;gt; 
  &amp;lt;/s:Body&amp;gt; 
&amp;lt;/s:Envelope&amp;gt;&lt;/pre&gt;
&lt;p&gt;İkinci olarak yapılan &lt;strong&gt;ProcessCadImage&lt;/strong&gt; operasyon i&amp;ccedil;in &lt;strong&gt;AfterReceiveRequest&lt;/strong&gt; metoduna gelen mesaj i&amp;ccedil;eriği,&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&amp;gt; 
  &amp;lt;s:Header&amp;gt; 
    &amp;lt;To s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none"&amp;gt; 
http://localhost:56119/ShipService.svc&amp;lt;/To&amp;gt; 
    &amp;lt;Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none"&amp;gt; 
http://tempuri.org/IShipService/ProcessCadImage&amp;lt;/Action&amp;gt; 
  &amp;lt;/s:Header&amp;gt; 
  &amp;lt;s:Body&amp;gt; 
    &amp;lt;ProcessCadImage xmlns="http://tempuri.org/"&amp;gt; 
      &amp;lt;sourceData&amp;gt;AAAAAAAA(burada bi s&amp;uuml;r&amp;uuml; A vardı)=&amp;lt;/sourceData&amp;gt; 
    &amp;lt;/ProcessCadImage&amp;gt; 
  &amp;lt;/s:Body&amp;gt; 
&amp;lt;/s:Envelope&amp;gt;&lt;/pre&gt;
&lt;p&gt;İkinci olarak yapılan ProcessCadImage operasyonundan d&amp;ouml;n&amp;uuml;l&amp;uuml;rken ele alınan mesaj i&amp;ccedil;eriği,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&amp;gt; 
  &amp;lt;s:Header&amp;gt; 
    &amp;lt;Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none"&amp;gt; 
http://tempuri.org/IShipService/ProcessCadImageResponse&amp;lt;/Action&amp;gt; 
  &amp;lt;/s:Header&amp;gt; 
  &amp;lt;s:Body&amp;gt; 
    &amp;lt;ProcessCadImageResponse xmlns="http://tempuri.org/"&amp;gt; 
      &amp;lt;ProcessCadImageResult&amp;gt;true&amp;lt;/ProcessCadImageResult&amp;gt; 
    &amp;lt;/ProcessCadImageResponse&amp;gt; 
  &amp;lt;/s:Body&amp;gt; 
&amp;lt;/s:Envelope&amp;gt;&lt;/pre&gt;
&lt;p&gt;Mesaj bazlı kesici tip, &lt;strong&gt;Endpoint&lt;/strong&gt; seviyesinde bir davranış olarak tanımlandığından, bu &lt;strong&gt;Endpoint&lt;/strong&gt; adına gelen ne kadar operasyon var ise her biri i&amp;ccedil;in devreye girecektir. Diğer yandan &lt;strong&gt;Parametre&lt;/strong&gt; bazlı kesicimizin bir &lt;strong&gt;FaultException&lt;/strong&gt; &amp;uuml;retmesi halinde, &lt;strong&gt;BeforeSendReply&lt;/strong&gt; metodları hatanın &amp;uuml;retildiği servis operasyonu i&amp;ccedil;in devreye girmiyor olacaktır.&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere parametre ve mesaj seviyesinde kesme işlemlerini uygulamak &amp;ccedil;ok zor olmadığı gibi dikkat gerektiren bir işlemler b&amp;uuml;t&amp;uuml;n&amp;uuml;nden oluşmaktadır. Bu yazımızda &lt;strong&gt;Parametre&lt;/strong&gt; ve &lt;strong&gt;Mesaj&lt;/strong&gt; bazlı kesici tiplerin &lt;strong&gt;WCF&lt;/strong&gt; tarafında nasıl yazılabileceğini incelemeye &amp;ccedil;alıştık. Bu kesicilerin bir diğer implementasyonu da &lt;strong&gt;WCF Data Service&lt;/strong&gt; tarafındadır. Bu konuyu da incelemenizi tavsiye ederim. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;span style="color: #ff0000;"&gt;[Bu makale &lt;/span&gt;&lt;a href="http://www.formspring.me/BurakSenyurt" target="_blank"&gt;&lt;span style="color: #ff0000;"&gt;Formspring&lt;/span&gt;&lt;/a&gt;&lt;span style="color: #ff0000;"&gt; &amp;uuml;zerinden gelen bir soru &amp;uuml;zerine hazırlanmıştır. Soruyu soran arkadaşımıza teşekk&amp;uuml;r etmek isterim]&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2012%2f10%2fHowTo_WCF_Interceptors.zip"&gt;HowTo_WCF_Interceptors.zip (86,34 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2012-12-02 19:53:00</pubDate>
  <slug>WCF-Interceptors</slug>
  <tags>
    <tag>windows-communication-foundation</tag>
    <tag>wcf</tag>
    <tag>interceptor</tag>
    <tag>parameter-inspector</tag>
    <tag>message-inspector</tag>
    <tag>custom-behavior</tag>
    <tag>iparameterinspector</tag>
    <tag>ioperationbehavior</tag>
    <tag>attribute</tag>
    <tag>iendpointbehavior</tag>
    <tag>endpoint-behavior</tag>
  </tags>
  <categories>
    <category>WCF 4.5</category>
  </categories>
</post>