<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Xml Web Servislerine Giriş - 1</title>
  <description>Bir Web Servisi, uzak istemcilerin başvuruda bulunduğu çeşitli işlevsel metod çağırımlarını bardındırdan, çok yönlü ve merkezileştirilmiş bir ünitedir. Bir web servisi, çok sayıda istemci tarafından erişilebilen  bir yapıya sahiptir. Onu diğer dağıtık nesne modellerinden farklı kılan sahip olduğu alt yapı sistemi sayesinde, platform bağımsız uygulanabilirliği sağlamasıdır. Web servislerinin geliştirilmesinde en büyük etken, özellikle bir merkezdeki uygulamalar üzerinde, ortak amaçları gerçekleştiren işlevselliklere sahip nesnelerin, geliştirildikleri ağın iletişim protokolü gibi kısıtlamaların varlığıdır.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bu makalemizde, kısaca bir XML Web Servisinin ne olduğuna, ne işe yaradığına değinecek ve basit bir Xml Web Servisinin notepad ile nasıl oluşturulabileceğini incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;Bir Web Servisi, uzak istemcilerin başvuruda bulunduğu &amp;ccedil;eşitli işlevsel metod &amp;ccedil;ağırımlarını bardındırdan, &amp;ccedil;ok y&amp;ouml;nl&amp;uuml; ve merkezileştirilmiş bir &amp;uuml;nitedir. Bir web servisi, &amp;ccedil;ok sayıda istemci tarafından erişilebilen&amp;nbsp; bir yapıya sahiptir. Onu diğer dağıtık nesne modellerinden farklı kılan sahip olduğu alt yapı sistemi sayesinde, platform bağımsız uygulanabilirliği sağlamasıdır. Web servislerinin geliştirilmesinde en b&amp;uuml;y&amp;uuml;k etken, &amp;ouml;zellikle bir merkezdeki uygulamalar &amp;uuml;zerinde, ortak ama&amp;ccedil;ları ger&amp;ccedil;ekleştiren işlevselliklere sahip nesnelerin, geliştirildikleri ağın iletişim protokol&amp;uuml; gibi kısıtlamaların varlığıdır.&lt;/p&gt;
&lt;p&gt;Bir web servisi, standart olarak HTTP iletişim protokol&amp;uuml; &amp;uuml;zerinden veri alışverişine izin veren bir yapıdadır. HTTP tabanlı bu sistemin bilgi otobanı XML temelleri &amp;uuml;zerine dayandırılmıştır. XML' in bizlere sağladığı esneklik, kolay geliştirilebilirlik &amp;ouml;zelliklerinin yanı sıra, sağlamış olduğu global standartlar, platform bağımsız veri transferi kavramını dahada geliştirmiştir. Web servislerinin kullanılmasında yatan en b&amp;uuml;y&amp;uuml;k kavram xml tabanlı veri akışının belirli standartlar dahilinde ger&amp;ccedil;ekleştirilmesidir. Bu, web servislerinin platform bağımsız olarak herhangibir ateş duvarına (Firewall) yakalanmadan istemciler ile haberleşebilmesini sağlar.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk98_1.gif" alt="" width="586" height="402" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. XML Web Servisleri Neyi İfade Eder?&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bir web servisi, tek başına bir anlam ifade etmez. Web servisini kullanan istemcilerin de olması gerekir. İstemciler internet ortamında olabileceği gibi, &amp;ccedil;alıştığımız şirketin network sisteminde yada evimizdeki makinenin yerel sunucusu &amp;uuml;zerinde olabilir. Bir istemci, bir web servisini kullanmak istediğinde tek yapması gereken, bu web servisi ile konuşabilecek ortak bir takım standartları uygulamaktır. XML tabanlı bu standartlar sayesinde istemciler, web servisine ulaşabilir, bu servis &amp;uuml;zerinden metodlar &amp;ccedil;ağırabilir, bu metodlara parametreler g&amp;ouml;nderebilir ve metodlardan d&amp;ouml;nen değerleri &amp;ouml;rneğin veri k&amp;uuml;melerini elde edebilir.&lt;/p&gt;
&lt;p&gt;Web servislerinin kullanımına verilebilecek en g&amp;uuml;zel &amp;ouml;rnek, hava durumuna ilişkin bilgilerinin en g&amp;uuml;ncel halleriyle, &amp;ccedil;eşitli platformlarda &amp;ccedil;alışan istemcilere sunulduğu bir sistem olabilir. Hava durumuna ilişkin &amp;ccedil;eşitli bilgileri bir veri k&amp;uuml;mesi halinde tedarik eden merkezi web servisine istemciler, bir web sayfasından, bir windows yada java uygulmasından, bir mobil uygulamadan veya başka bir platformdan kolayca erişebilir. Web servisleri merkezi uygulamalar olduklarından, verilerdeki değişiklikler bu servisleri kullanan t&amp;uuml;m uygulamalar i&amp;ccedil;in de eş zamanlı ve eş g&amp;uuml;ncellikte olacaktır. Web servisleri ve bu servisleri kullanan istemciler arasındaki ilişkiler, y&amp;uuml;zeysel olarak bakıldığında aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi değerlendirilebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk98_2.gif" alt="" width="570" height="458" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. En basit haliyle Xml Web Servislerinin hayatımızdaki yeri.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Web servislerinin, onları kullanan istemciler ile arasındaki ilişki, ş&amp;uuml;phesiz ki bu şekilde g&amp;ouml;r&amp;uuml;nd&amp;uuml;ğ&amp;uuml; kadar basit değildir. Herşeyden &amp;ouml;nce, web servislerini kullanacak istemciler ile arada kurulucak ilişkinin belli standartlara dayandırılması gerekir. Her ne kadar, web servisleri HTTP &amp;uuml;zerinden gidecek XML veri par&amp;ccedil;alarını kullanıyor olsada bunların, istemcilerin işleyebileceği ve anlayabileceği bir hale getirilmeleri gerekir. Bu noktada devreye Web Servisleri i&amp;ccedil;in &amp;ouml;nemli ve gerekli temellerden birisi olan SOAP &lt;em&gt;(Simple Object Access Protocol - Basit Nesne Erişim Antlaşması )&lt;/em&gt; girer.&lt;/p&gt;
&lt;p&gt;Bir istemci, kullanacağı web servisine ait bir takım bilgilere sahip olmak zorundadır. İstemci bu bilgileri kullanarak web servisinden SOAP protokol&amp;uuml;ne uygun olarak hazırlanan XML mesajını g&amp;ouml;nderir. Kodlanarak (Encoding) g&amp;ouml;nderilen bu mesaj, Web Servisi tarafından &amp;ccedil;&amp;ouml;z&amp;uuml;l&amp;uuml;r (Decoding) , gerekli parametreler ve metod &amp;ccedil;ağırım bilgileri eşliğinde bir takım işlemler ger&amp;ccedil;ekleştirir.&amp;nbsp; Bu işlemler sonrasında Web Servisi, istemciye d&amp;ouml;nd&amp;uuml;receği cevap bilgileri i&amp;ccedil;in yine SOAP protokol&amp;uuml;ne uygun XML mesajlarını oluşturur. Bu mesajlar HTTP &amp;uuml;zerinden istemci uygulamaya ulaşır, burada &amp;ccedil;&amp;ouml;z&amp;uuml;l&amp;uuml;r ve değerlendirilir.&lt;/p&gt;
&lt;p&gt;Elbette şekildeki senaryoda yer alan istemci sistemler bunlar ile sınırılı değildir. &amp;Ccedil;ok &amp;ccedil;eşitli platformlar da web servislerini kullanabilir. Web servisinin &amp;ouml;n&amp;uuml;nde &amp;ccedil;alışan bir Firewall (Ateş Duvarı) olması bilgilerin kolayca taşınabilmesini engellemez. &amp;Ccedil;&amp;uuml;nk&amp;uuml; mesajlar, istemciler ve web servisleri arasında XML tabanlı bilgi par&amp;ccedil;acıkları şeklinde taşınmaktadır.&lt;/p&gt;
&lt;p&gt;İstemcilerin kullanacakları web servisindeki bilgileri &amp;ouml;nceden bilmeleri gerekir. WSDL (Web Services Description Language - Web Servisleri Tanımlama Dili ) bu noktada devreye giren bir diğer &amp;ouml;nemli&amp;nbsp; unsurdur. İstemci uygulamalar WSDL yardımıyla, kullanacakları web servisine ait bilgileri &amp;ouml;nceden tedarik ederler. Bu istemcinin web servisi &amp;uuml;zerindeki bir web metodunun varlığından haberdar olması, onu nasıl kullanacağını bilmesi anlamına gelmektedir. Web servislerinin mimarisini daha derin ve detaylı bir şekilde incelemeden &amp;ouml;nce, ilk Web Servisi uygulamamızı yazmaya başlıyoruz.&lt;/p&gt;
&lt;p&gt;Bir Web Servisini oluşturmak i&amp;ccedil;in, Notepad gibi basit bir metin editorunu kullanabileceğimiz gibi, Visual Studio.NET gibi ileri seviyede bir yazılım geliştirme platformunuda kullanabiliriz. İlk &amp;ouml;nce Notepad &amp;uuml;zerinden bir web servisinin nasıl yazılacağını g&amp;ouml;receğiz. Bir web servisi her şeyden &amp;ouml;nce, intranet veya internet &amp;uuml;zerinde yer alan bir sunucuda konuşlandırılmalıdır. Yerel bir makinede bu iş i&amp;ccedil;in, IIS (Internet Information Services) kullanılabilir. Bu nedenle ilk olarak, web servisimizi barındırıcak sanal bir klas&amp;ouml;r oluşturmakla işe başlamalıyız. Windows XP işletim sistemine sahip bir bilgisayarda, IIS altında sanal klas&amp;ouml;r&amp;uuml;m&amp;uuml;z&amp;uuml; oluşturabilmek i&amp;ccedil;in Start men&amp;uuml;s&amp;uuml;, Administrative Tool, Internet Informatin Services kısmına girelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk98_3.gif" alt="" width="439" height="125" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. IIS&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Ardından Default Web Site (yada web sunucusunun adı) kısmında sağ men&amp;uuml; tuşuna basıp New kısmından Virtual Directory' yi se&amp;ccedil;elim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk98_4.gif" alt="" width="321" height="156" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. Virtual Directory.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Karışımıza &amp;ccedil;ıkacak olan sihirbazda Alias kısmına Geometri girelim. Klas&amp;ouml;r&amp;uuml;m&amp;uuml;z&amp;uuml; ise, C:\Inetpub\wwwroot\Geometri olarak oluşturalım. Buradaki adımları tamamladıktan sonra, web servisimizi bu klas&amp;ouml;r altında oluşturabiliriz. Web servisleri, asmx uzantılı dosyalar olarak oluşturulurlar. Bu nedenle, asmx uzantılı dosyamızı, yerel web sunucumuzda oluşturduğumuz sanal klas&amp;ouml;r&amp;uuml;n işaret ettiği fiziki klas&amp;ouml;rde aşağıdaki kodlar ile hazırlayalım.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;% @ WebService Language="C#" CodeBehind="GeoMat.asmx.cs" class="GeoWebServis.TemelIsler" %&amp;gt;&lt;/pre&gt;
&lt;p&gt;Hazırladığımız bu dosyayı, GeoMat.asmx uzantısı ile kaydedelim. Kodlarda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, web servisimizin asıl işlevselliğini, GeoMat.asmx.cs isimli Code-Behind dosyasında ger&amp;ccedil;ekleştireceğiz. Burada kullanacağımız programlama dilinide Language &amp;ouml;zelliğine C# değerini atayarak belirledik. Ancak en &amp;ouml;nemlisi kaydedilen bu asmx dosyasının bir web servisi olarak değerlendirileceğini belirten WebService anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml;n kullanılmasıdır. Şimdi Code-Behind dosyamızı oluşturalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Web;
using System.Web.Services;

namespace GeoWebServis
{

    [WebService(Namespace="http://ilk/servis/",Description="Geometrik Hesaplamalar &amp;Uuml;zerine Metodlar İ&amp;ccedil;erir. Ucgen, Dortgen gibi şekillere y&amp;ouml;nelik alan ve &amp;ccedil;evre hesaplamaları.",Name="Geometrik Hesaplamalar")]
    public class TemelIsler : System.Web.Services.WebService
    {
        private const double pi=3.14;

        [WebMethod(Description="Daire Alan Hesabı Yapar")]
        public double DaireAlan( double r)
        {
            return (r*r)*pi;
        }

        [WebMethod(Description="Daire &amp;Ccedil;evre Hesabı Yapar.")]
        public double DaireCevre( double r)
        {
            return 2*pi*r;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Yazdığımız bu dosyayı GeoMat.asmx.cs ismi ile asmx dosyamızın bulunduğu klas&amp;ouml;re kayıt edelim. Kodları kısaca incelediğimizde ilk olarak, k&amp;ouml;şeli parantezler i&amp;ccedil;erisindeki ifadeler dikkatimizi &amp;ccedil;ekmektedir. Bu ifadeler birer nitelik (attribute) olup, web servisindeki sınıf ve metodlara ilişkin bir takım bilgileri, bu servisi kullanacak olan istemcilere sağlarlar.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin WebService niteliğinde, Namespace &amp;ouml;zelliği ile, bu servisin tanımını i&amp;ccedil;erecek XML d&amp;ouml;k&amp;uuml;manında kullanılacak Namespace' i belirtmiş oluruz. Description &amp;ouml;zelliği ile, web servisindeki bu sınıfın neler yaptığını &amp;ouml;zetleyen kısa bilgileri belirleriz. Name &amp;ouml;zelliği ilede, bu sınıfa bir isim vermiş oluruz. Bu bilgiler &amp;ouml;zellikle web servisini keşfettiğimizde (Discovery) , olduk&amp;ccedil;a işe yaramaktadır. WebService niteliğine benzer olarak WebMethod niteliği, izleyen metodun bir web servisi metodu olduğunu belirtmek i&amp;ccedil;in kullanılır. Burada iki web servisi metodumuz yer almaktadır. Her birinin ne iş yaptığına dair kısa bilgileride WebMethod niteliğinin Description &amp;ouml;zelliği ile belirtebiliriz.&lt;/p&gt;
&lt;p&gt;Burada kullandığımız isim alanı ve sınıf adlarının, asmx dosyasında belirtiğimiz class tanımlamalarındaki ile aynı olduğuna dikkat edelim. Bir web servisi yazdığımızda, bu web servisini oluşturacak olan sınıfın, System.Web.Services.WebService isim alanından t&amp;uuml;retilmesi gerekir. Yazmış olduğumuz bu web servisi temel olarak iki metoda sahiptir ve bu metodların herbiri double t&amp;uuml;r&amp;uuml;nden birer parametre alarak, yine double t&amp;uuml;r&amp;uuml;nden sonu&amp;ccedil;lar &amp;uuml;retmekte ve metodun &amp;ccedil;ağırıldığı yere d&amp;ouml;nd&amp;uuml;rmektedirler. Burada kullanılan parametreler istemci bilgisayarların, web servisindeki ilgili metodları &amp;ccedil;ağırımları sırasında kullanılır. D&amp;ouml;n&amp;uuml;ş değerleri ise, ilgili metodları &amp;ccedil;ağıran istemcilere g&amp;ouml;nderilir.&lt;/p&gt;
&lt;p&gt;Web servisimize ait asmx dosyamızı ve Code-Behind dosyamızı oluşturduktan sonra, Code-Behind dosyamızı dll k&amp;uuml;t&amp;uuml;phanesi olarak derleyip, bin isimli bir klas&amp;ouml;r i&amp;ccedil;erisine koymalıyız. Bu ama&amp;ccedil;la komut satırından aşağıdaki komutu vererek, Code-Behind dosyamızı bir sınıf k&amp;uuml;t&amp;uuml;phanesi olacak şekilde csc yardımıyla derliyoruz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;csc /target:library GeoMat.asmx.cs&lt;/pre&gt;
&lt;p&gt;Oluşturulan dll dosyasını asmx dosyamızın blunduğu klas&amp;ouml;r altındaki bin isimli bir klas&amp;ouml;r i&amp;ccedil;erisine taşıdıktan sonra web servisimize herhangibir tarayıcıdan rahatlıkla erişebiliriz. Bunun i&amp;ccedil;in, Internet Explorer penceresinde adres satırına&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;http://localhost/Geometri/GeoMat.asmx&lt;/pre&gt;
&lt;p&gt;url bilgisini yazmamız yeterli olucaktır. Bu işlem sonrasında web servisimizin &amp;ccedil;alışır hali aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk98_5.gif" alt="" width="622" height="242" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 5. Xml Web Servisinin tarayıcıdan talep edilmesinin sonucu.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi asmx uzantılı dosyamızı kullanarak, geliştirmiş olduğumuz web servisine ait bilgilere eriştik. Burada yazılan bilgilerin, WebService ve WebMethod niteliklerinde belirtmiş olduğumuz değerlerin aynısı olduğu dikkatinizi &amp;ccedil;ekmiştir. Dilersek bu pencerede servisimizi deniyebiliriz. Web servisimizde geliştirdiğimiz metodlara ait linklerden hernangibirisine tıkladığımızda, bu metodu &amp;ccedil;ağırmamız i&amp;ccedil;in kullanabileceğimiz bir sayfa ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk98_6.gif" alt="" width="494" height="338" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 6. Bir Web Metodunun &amp;ccedil;ağırılması.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu ekranda, value ile belirtilen bir metin kutusu olduğuna dikkat edin. Bu metin kutusu metodumuzun dışarıdan aldığı double tipten parametreye istinaden oluşturulmuştur. Buraya bir değer girerek metodun &amp;ccedil;ağırılmasını sağlayabiliriz. Bu durumda metodun &amp;ccedil;alıştırılması sonucu elde edilecek sonu&amp;ccedil;(lar) bir XML bilgisi şeklinde elde edilecek ve tarayıcı penceresinde aşağıda olduğu gibi g&amp;ouml;r&amp;uuml;necektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk98_7.gif" alt="" width="491" height="51" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Web servisimizin ana sayfasında Service Description isimli bir bağlantı vardır. Bu bağlantıya tıkladığımızda aşağıdaki gibi uzun bir XML bilgisi elde ederiz.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
 &amp;lt;definitions xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:s="http://www.w3.org/2001/XMLSchema" xmlns:s0="http://ilk/servis/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" targetNamespace="http://ilk/servis/" xmlns="http://schemas.xmlsoap.org/wsdl/"&amp;gt;
 &amp;lt;types&amp;gt;
 &amp;lt;s:schema elementFormDefault="qualified" targetNamespace="http://ilk/servis/"&amp;gt;
 &amp;lt;s:element name="DaireAlan"&amp;gt;
 &amp;lt;s:complexType&amp;gt;
 &amp;lt;s:sequence&amp;gt;
  &amp;lt;s:element minOccurs="1" maxOccurs="1" name="r" type="s:double" /&amp;gt;
  &amp;lt;/s:sequence&amp;gt;
  &amp;lt;/s:complexType&amp;gt;
  &amp;lt;/s:element&amp;gt;
 &amp;lt;s:element name="DaireAlanResponse"&amp;gt;
 &amp;lt;s:complexType&amp;gt;
 &amp;lt;s:sequence&amp;gt;
  &amp;lt;s:element minOccurs="1" maxOccurs="1" name="DaireAlanResult" type="s:double" /&amp;gt;
  &amp;lt;/s:sequence&amp;gt;
  &amp;lt;/s:complexType&amp;gt;
  &amp;lt;/s:element&amp;gt;
 &amp;lt;s:element name="DaireCevre"&amp;gt;
 &amp;lt;s:complexType&amp;gt;
 &amp;lt;s:sequence&amp;gt;
  &amp;lt;s:element minOccurs="1" maxOccurs="1" name="r" type="s:double" /&amp;gt;
  &amp;lt;/s:sequence&amp;gt;
  &amp;lt;/s:complexType&amp;gt;
  &amp;lt;/s:element&amp;gt;
 &amp;lt;s:element name="DaireCevreResponse"&amp;gt;
 &amp;lt;s:complexType&amp;gt;
 &amp;lt;s:sequence&amp;gt;
  &amp;lt;s:element minOccurs="1" maxOccurs="1" name="DaireCevreResult" type="s:double" /&amp;gt;
  &amp;lt;/s:sequence&amp;gt;
  &amp;lt;/s:complexType&amp;gt;
  &amp;lt;/s:element&amp;gt;
  &amp;lt;/s:schema&amp;gt;
  &amp;lt;/types&amp;gt;
 &amp;lt;message name="DaireAlanSoapIn"&amp;gt;
  &amp;lt;part name="parameters" element="s0:DaireAlan" /&amp;gt;
  &amp;lt;/message&amp;gt;
 &amp;lt;message name="DaireAlanSoapOut"&amp;gt;
  &amp;lt;part name="parameters" element="s0:DaireAlanResponse" /&amp;gt;
  &amp;lt;/message&amp;gt;
 &amp;lt;message name="DaireCevreSoapIn"&amp;gt;
  &amp;lt;part name="parameters" element="s0:DaireCevre" /&amp;gt;
  &amp;lt;/message&amp;gt;
 &amp;lt;message name="DaireCevreSoapOut"&amp;gt;
  &amp;lt;part name="parameters" element="s0:DaireCevreResponse" /&amp;gt;
  &amp;lt;/message&amp;gt;
 &amp;lt;portType name="Geometrik_x0020_HesaplamalarSoap"&amp;gt;
 &amp;lt;operation name="DaireAlan"&amp;gt;
  &amp;lt;documentation&amp;gt;Daire Alan Hesabi Yapar&amp;lt;/documentation&amp;gt;
  &amp;lt;input message="s0:DaireAlanSoapIn" /&amp;gt;
  &amp;lt;output message="s0:DaireAlanSoapOut" /&amp;gt;
  &amp;lt;/operation&amp;gt;
 &amp;lt;operation name="DaireCevre"&amp;gt;
  &amp;lt;documentation&amp;gt;Daire &amp;Ccedil;evre Hesabi Yapar.&amp;lt;/documentation&amp;gt;
  &amp;lt;input message="s0:DaireCevreSoapIn" /&amp;gt;
  &amp;lt;output message="s0:DaireCevreSoapOut" /&amp;gt;
  &amp;lt;/operation&amp;gt;
  &amp;lt;/portType&amp;gt;
 &amp;lt;binding name="Geometrik_x0020_HesaplamalarSoap" type="s0:Geometrik_x0020_HesaplamalarSoap"&amp;gt;
  &amp;lt;soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document" /&amp;gt;
 &amp;lt;operation name="DaireAlan"&amp;gt;
  &amp;lt;soap:operation soapAction="http://ilk/servis/DaireAlan" style="document" /&amp;gt;
 &amp;lt;input&amp;gt;
  &amp;lt;soap:body use="literal" /&amp;gt;
  &amp;lt;/input&amp;gt;
 &amp;lt;output&amp;gt;
  &amp;lt;soap:body use="literal" /&amp;gt;
  &amp;lt;/output&amp;gt;
  &amp;lt;/operation&amp;gt;
 &amp;lt;operation name="DaireCevre"&amp;gt;
  &amp;lt;soap:operation soapAction="http://ilk/servis/DaireCevre" style="document" /&amp;gt;
 &amp;lt;input&amp;gt;
  &amp;lt;soap:body use="literal" /&amp;gt;
  &amp;lt;/input&amp;gt;
 &amp;lt;output&amp;gt;
  &amp;lt;soap:body use="literal" /&amp;gt;
  &amp;lt;/output&amp;gt;
  &amp;lt;/operation&amp;gt;
  &amp;lt;/binding&amp;gt;
 &amp;lt;service name="Geometrik_x0020_Hesaplamalar"&amp;gt;
  &amp;lt;documentation&amp;gt;Geometrik Hesaplamalar &amp;Uuml;zerine Metodlar I&amp;ccedil;erir. Ucgen, Dortgen gibi sekillere y&amp;ouml;nelik alan ve &amp;ccedil;evre hesaplamalari.&amp;lt;/documentation&amp;gt;
 &amp;lt;port name="Geometrik_x0020_HesaplamalarSoap" binding="s0:Geometrik_x0020_HesaplamalarSoap"&amp;gt;
  &amp;lt;soap:address location="http://localhost/Geometri/GeoMat.asmx" /&amp;gt;
  &amp;lt;/port&amp;gt;
  &amp;lt;/service&amp;gt;
&amp;lt;/definitions&amp;gt;&lt;/pre&gt;
&lt;p&gt;Burada g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi bir XML belgesine neden ihtiyacımız olabilir? Dikkat edilecek olursa, bu XML belgesinde, Web Servisimize ait bir takım bilgiler yer almaktadır. &amp;Ouml;rneğin, Metodlara ilişkin parametre bilgileri veya WebService ve WebMethod niteliklerinde belirttiğimiz tanımlamalar gibi. İşte istemci bilgisayarlar bu XML &amp;ccedil;ıktısını kullanarak, iletişim kuracakları web servsileri hakkında bilgi sahibi olurlar. Ancak burada asıl &amp;ouml;nemli olan nokta, Service Description bağlantısının, aşağıdaki şekilde oluşudur. Bu aslında, bir istemcinin, herhangibir web servisi hakkındaki bilgilere nasıl ulaşabileceğini g&amp;ouml;stermektedir.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;http://localhost/Geometri/GeoMat.asmx?WSDL&lt;/pre&gt;
&lt;p&gt;Bir Web Servisini Visual Studio.NET ortamında geliştirmek, şu ana kadar yaptıklarımızdan pek farklı değildir. Ancak Visual Studio.Net ortamının sağladığı avantajlar nedeniyle &amp;ccedil;ok daha kolaydır. Bir sonraki makalemizde bir web servisinin Visual Studio.Net ortamında nasıl geliştirileceğini ve bu web servisine erişecek bir istemcinin nasıl yazılacağını incelemeye &amp;ccedil;alışacağız. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-09-29 09:00:00</pubDate>
  <slug>Xml-Web-Servislerine-Giris-1-bsenyurt-com-dan</slug>
  <tags>
    <tag>xml-web-services</tag>
  </tags>
  <categories>
    <category>XML Web Services</category>
  </categories>
</post>