<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Oyun Geliştirmede Kullanılan Temel Matematik Enstrümanlar</title>
  <description>Oyun sahasına ekranın sağından gelip düz ve çapraz bir çizgide ilerledikten sonra dairesel hareketle devam edip rastgele zamanlarda ateş eden uzay gemisinin kodlamasını öğrenirken ortaya döküken kosinüs ve sinüs çağrıları sonrası ise şöyle bir durup düşünmeye başladım. Öncesinde kağıt kalem alıp biraz karalama yapmalıydım. Bugünün popüler oyun motorlarından Unity, Unreal Engine gibilerinin çoğu fizik motorlarından ışıklandırmaya, gölgeleme efektlerinden çarpışma hesaplamalarına, izdüşümsel kamera bazlı 2D sahalardan sıçrama efektlerine kadar pek çok şeyin temel hesaplamasını hazır olarak sunmakta. Hatta IDE desteği sunanlar çok daha öne çıkmakta. Ancak oyun programlamanın temellerinde her zaman olduğu gibi matematik var ve bu atlanmaması gereken bir mevzu...</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2022/Ekim/math101_00.png" alt="" /&gt;Bir s&amp;uuml;redir Rust tarafındaki oyun motorlarını&amp;nbsp;incelemekteyim.&amp;nbsp;Bu konuda sayısız youtube videosu ve &amp;ouml;ğreti buldum. Hem rust kodlama pratiklerimi geliştirmek hem de meraklı olduğum oyun programlama&amp;nbsp;tekniklerini deneyimlemek i&amp;ccedil;in biraz zaman harcadım. Ping Pong oyunundan, uzaydaki g&amp;ouml;ktaşlarını patlatan gemiye, karşısındaki farklı t&amp;uuml;rden blokları onlara top fırlatarak&amp;nbsp;patlatan dikd&amp;ouml;rtgenden, derin zindanlarda ortografik projeksiyon&amp;nbsp;bazlı kamera kullanan sahalara neredeyse her yerde temel matematikten yararlanıldığına şahit oldum&lt;em&gt;(&amp;Ouml;ğretilere ait uyguladığım pratikleri ve ortaya &amp;ccedil;ıkan sonu&amp;ccedil;ları &lt;a title="Game Development with Rust" href="https://github.com/buraksenyurt/game-dev-with-rust" target="_blank"&gt;game-dev-with-rust&lt;/a&gt; reposunda bulabilirsiniz)&lt;/em&gt; Bunu zaten biliyordum ama unuttuğum&amp;nbsp;&amp;ccedil;ekirdek matematik bilgim ile yapıldıklarını g&amp;ouml;r&amp;uuml;nce aslında onlarca yıl &amp;ouml;nce &amp;ouml;ğrendiklerimin ne kadar &amp;ccedil;ok işe yaradığını fark ettim&amp;nbsp;&lt;em&gt;(Ne yazık ki)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Oyun sahasına&amp;nbsp;ekranın sağından gelip d&amp;uuml;z ve &amp;ccedil;apraz bir &amp;ccedil;izgide ilerledikten sonra dairesel hareketle devam edip rastgele zamanlarda ateş eden uzay gemisinin kodlamasını &amp;ouml;ğrenirken ortaya d&amp;ouml;k&amp;uuml;ken kosin&amp;uuml;s ve sin&amp;uuml;s &amp;ccedil;ağrıları sonrası ise ş&amp;ouml;yle bir durup d&amp;uuml;ş&amp;uuml;nmeye başladım. Devam etmek istiyorsam &amp;ouml;ncesinde kağıt kalem alıp biraz karalama yapmalıydım. Bug&amp;uuml;n&amp;uuml;n pop&amp;uuml;ler oyun motorlarından Unity, Unreal Engine gibilerinin &amp;ccedil;oğu fizik motorlarından ışıklandırmaya, g&amp;ouml;lgeleme efektlerinden &amp;ccedil;arpışma hesaplamalarına, izd&amp;uuml;ş&amp;uuml;msel kamera&amp;nbsp;bazlı 2D sahalardan sı&amp;ccedil;rama efektlerine kadar pek &amp;ccedil;ok şeyin temel hesaplamasını hazır olarak sunmakta. Hatta IDE desteği sunanlar &amp;ccedil;ok daha &amp;ouml;ne &amp;ccedil;ıkmakta. Ancak oyun programlamanın temellerinde her zaman olduğu gibi matematik var ve bu atlanmaması gereken bir mevzu&lt;em&gt;(Az biraz cebir fazlasıyla trigonometri)&lt;/em&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Oyun platformlarının &amp;ccedil;oğunda sahne ve nesneler arası ilişkilerde kodlama yapılan yerler oluyor. Bu kısımlar genellikle script diller ile beslenmekte. Ne var ki ister 2D ister 3D olsun vector, normalize, projection, sin, cos, dot, distance, projection, rotate, collision vb kelimeler i&amp;ccedil;eren fonksiyonlara rastlıyoruz. Bunları etkin kullanabilmek i&amp;ccedil;in hangi matematik enstr&amp;uuml;manlardan yararlandıklarını bilmek gerekiyor. Bu sebeple pek &amp;ccedil;ok oyun motoru dok&amp;uuml;mantasyonunda temel matematik bilgileri i&amp;ccedil;in b&amp;ouml;l&amp;uuml;mler var. Benim gibi her şeye sıfırdan başlıyorsanız mutlaka bakmanız gerek.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bu ama&amp;ccedil;la &amp;ouml;ğrendiklerimi her zaman olduğu gibi not almaya başladım. Bu notların hem kendim hem de meraklıları i&amp;ccedil;in yararlı olacağını d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m.&amp;nbsp;İzleyen anlatımda temel seviyede oyun geliştirme i&amp;ccedil;in bilinmesi gereken matematik enstr&amp;uuml;manlara yer verilmekte. Yazının sonunda yer alan kaynakların bu notların oluşmasında b&amp;uuml;y&amp;uuml;k bir yeri olduğunu baştan belirtmek isterim. Olaya daha orta okul sıralarından beri bildiğimiz ama teorik kaldığında &amp;ccedil;ok anlamlı gelmeyen bir enstr&amp;uuml;manla başlayalım.&lt;/p&gt;
&lt;h2&gt;Pisagor Teoremi&lt;/h2&gt;
&lt;p&gt;Oyuncunun roketi iki boyutlu sahada ilerlerken etrafını saran d&amp;uuml;şman gemileri rastgele y&amp;ouml;nlerde hareket ediyordu. Bazı d&amp;uuml;şman gemileri oyuncuya belli mesafe yaklaşınca ateş a&amp;ccedil;ıyordu. İşte soru; d&amp;uuml;şman gemisinin ateş etmek i&amp;ccedil;in oyuncuya ne kadar yaklaştığını nasıl buluruz? Problemi basitleştirmek adına oyunun iki boyutlu bir sahada yazıldığını d&amp;uuml;ş&amp;uuml;nelim. Pek &amp;ccedil;ok oyun motorunda koordinat d&amp;uuml;zlemi ekranın sol &amp;uuml;st k&amp;ouml;şesini 0,0 başlangı&amp;ccedil; noktası olarak kabul eder. Bizde b&amp;ouml;yle olduğunu d&amp;uuml;ş&amp;uuml;nebiliriz. Tabii 2D kartezyen koordinat sisteminde olduğumuz i&amp;ccedil;in işimiz nispeten kolay. Lakin 3D kartezyen sistemine ge&amp;ccedil;tiğimizde sağ el veya sol el kurallarına g&amp;ouml;re koordinat sisteminin 24 farklı versiyonunun kullanılması s&amp;ouml;z konusu&amp;nbsp;&lt;em&gt;(2D i&amp;ccedil;in bu sayı 8)&lt;/em&gt; Şimdilik bu detayları geride bırakalım ve problemimize geri d&amp;ouml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Ekim/math_101_01.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında oyun karakterlerinin&lt;em&gt;(sprite olarak ifade edebiliriz)&lt;/em&gt;&amp;nbsp;merkez x,y değerlerini biliyorsak, bir dik &amp;uuml;&amp;ccedil;genden yararlanarak hipoten&amp;uuml;s hesabından hareketle yakınlık değerini bulabiliriz. Bunun nasıl &amp;ccedil;alıştığını basit&amp;ccedil;e g&amp;ouml;rmek isterseniz&amp;nbsp;Rust ile yazılmış &lt;a href="https://github.com/buraksenyurt/game-dev-with-rust/tree/main/math101" target="_blank"&gt;math101 &amp;ouml;rneğine bakabilirsiniz&lt;/a&gt;. Aşağıda g&amp;ouml;rd&amp;uuml;l&amp;uuml;ğ&amp;uuml; gibi daire, kareye 50 pixel mesafeden daha fazla yaklaştığında ekrana bir uyarı mesajı geliyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Ekim/pisagor.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Vekt&amp;ouml;rler ve A&amp;ccedil;ılar&lt;/h2&gt;
&lt;p&gt;Oyunlarda vekt&amp;ouml;rler sıklıkla kullanılır. Esasında vekt&amp;ouml;r denilince matematik&amp;ccedil;iler a&amp;ccedil;ısından ilk etapta bir sayı serisi akla gelir. Bu son derece doğaldır. Nitekim V&lt;sub&gt;1&lt;/sub&gt;= [1,2] veya V&lt;sub&gt;2&lt;/sub&gt; = [3,4,6] ve hatta V&lt;sub&gt;3&lt;/sub&gt; = [x,y,z,w] g&amp;ouml;sterimleri birer vekt&amp;ouml;rel ifadedir. Hatta bir&amp;ccedil;ok programlama dilinde Vector isimli ve sayısal dizileri işaret eden nesneler bulunur. Lakin oyunlar ve coğrafi &amp;ouml;zellikleri &amp;ouml;n plana &amp;ccedil;ıkınca vekt&amp;ouml;rlerin geometrik anlamı değer kazanır. İki veya &amp;uuml;&amp;ccedil; boyutlu uzaya ait vekt&amp;ouml;rler fazlasıyla kullanılır hatta yeri geldiğinde bu vekt&amp;ouml;rler d&amp;ouml;rd&amp;uuml;nc&amp;uuml; bir boyut olarak zamanı da b&amp;uuml;nyesine katabilir.&lt;/p&gt;
&lt;p&gt;Bir vekt&amp;ouml;r ile b&amp;uuml;y&amp;uuml;kl&amp;uuml;k&lt;em&gt;(daha &amp;ccedil;ok uzunluk olarak da rastlarız)&lt;/em&gt;&amp;nbsp;ve belki de en &amp;ouml;nemlisi y&amp;ouml;n bilgisi ifade edilebilir. Bu sayede oyun sahasındaki bir nesnenin hareket y&amp;ouml;n&amp;uuml; vekt&amp;ouml;rler ile ifade edilebilir. B&amp;uuml;y&amp;uuml;kl&amp;uuml;k&amp;nbsp;&lt;em&gt;(Magnitude)&lt;/em&gt;&amp;nbsp;yerine y&amp;ouml;n&amp;nbsp;&lt;em&gt;(direction)&lt;/em&gt;&amp;nbsp;bilgisinin &amp;ouml;nemli olduğu durumlarda ise birim vekt&amp;ouml;r &amp;ouml;ne &amp;ccedil;ıkar. Bir vekt&amp;ouml;r&amp;uuml;n uzunluğunu&amp;nbsp;&lt;em&gt;(b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;n&amp;uuml;)&lt;/em&gt;&amp;nbsp;bulmak i&amp;ccedil;in yine&amp;nbsp;pisagor teoremi kullanılabilir. Nitekim uzaydaki bir vekt&amp;ouml;r&amp;uuml;n uzunluğu iki nokta arasındaki mesafeye tekab&amp;uuml;l eder ki bu da pisagor &amp;uuml;&amp;ccedil;geninden yararlanılarak hesap edilir. İşte form&amp;uuml;ller i&amp;ccedil;in &amp;ouml;zet bir g&amp;ouml;rsel.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Ekim/math_101_02.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında matematiğin oyun programlama tarafındaki yorumlamaları &amp;ccedil;ok &amp;ouml;nemlidir. Onları sadece matematiksel form&amp;uuml;ller veya tanımlar olarak değil fiziki d&amp;uuml;nyada anlamlandırılan birer enstr&amp;uuml;man olarak d&amp;uuml;ş&amp;uuml;nmek lazım. Bu anlamda &amp;uuml;stteki grafiği biraz yorumlamaya &amp;ccedil;alışalım. Aracın son konumunu merkez kooridnatlara g&amp;ouml;re E&lt;sub&gt;x&lt;/sub&gt; ve E&lt;sub&gt;y&lt;/sub&gt; ile ifade edebiliriz. Ancak&amp;nbsp;merkezden (E&lt;sub&gt;x&lt;/sub&gt;,E&lt;sub&gt;y&lt;/sub&gt;) konumuna olan uzaklık&amp;nbsp;vekt&amp;ouml;rel olarak da ifade edilebilir. (E&lt;sub&gt;x&lt;/sub&gt;,E&lt;sub&gt;y&lt;/sub&gt;)'yi vekt&amp;ouml;r olarak d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde ş&amp;ouml;yle bir paragraf d&amp;uuml;ş&amp;uuml;nebiliriz. Oyuncunun kullandığı araba g&amp;uuml;ney doğu y&amp;ouml;n&amp;uuml;nde 4 birim ilerledikten sonra doğuya doğru 2 birim ardından g&amp;uuml;neye 2.5 birim ve son olarak da g&amp;uuml;ney batıya doğru 3 birim hareket etmektedir. Dikkat edileceği &amp;uuml;zere burada koordinatlar belli değildir. Sadece bir yer değiştirme hareketi s&amp;ouml;z konusudur&lt;em&gt;(Displacement)&lt;/em&gt; Bir başka deyişle vekt&amp;ouml;rler aslında nesnelerin yer değiştirmeleri ile sıkı bir şekilde ilgilenir. Bu nedenle (E&lt;sub&gt;x&lt;/sub&gt;,E&lt;sub&gt;y&lt;/sub&gt;)'nin standart olarak x,y cinsinden merkeze uzaklığının ifadesinden farklı bir anlam taşır. Başka bir &amp;ouml;rnek verelim; Gemimiz kuzey y&amp;ouml;n&amp;uuml;nde saatte 340 km hızlar ilerliyor. Burada dikkat edileceği &amp;uuml;zere herhangi bir uzay koordinatı bilgisi yoktur. Hatta konum bilgisi tamamen g&amp;ouml;receli bir olgu haline gelmiştir. Konum Lizbon limanına g&amp;ouml;re farklı, oyuncunun baktığı ekrana g&amp;ouml;re farklı ve hatta g&amp;uuml;neşin konumuna g&amp;ouml;re dahi farklıdır. Vekt&amp;ouml;rel olarak ifadesi ile aslında y&amp;ouml;n&amp;uuml; ve b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;&lt;em&gt;(ki burada hız oluyor)&lt;/em&gt; anlatılmaktadır.&lt;/p&gt;
&lt;p&gt;Bu sebeplerden vekt&amp;ouml;rler sayesinde bir noktanın merkeze olan uzaklığını ifade etmek de kolaydır. &amp;Ouml;rneğin g&amp;ouml;rseldeki araba her y&amp;ouml;n değiştirdiğinde gittiği mesafeyi b&amp;uuml;y&amp;uuml;kl&amp;uuml;k olarak kabul eden ve bir y&amp;ouml;n&amp;uuml; olan vekt&amp;ouml;rler ile matematiksel olarak ifade edilebilir. Buna g&amp;ouml;re aracın son geldiği (E&lt;sub&gt;x&lt;/sub&gt;,E&lt;sub&gt;y&lt;/sub&gt;)&amp;nbsp;noktasının vekt&amp;ouml;rel formdaki karşılığını bulmak kolaydır. Ayrıca (E&lt;sub&gt;x&lt;/sub&gt;,E&lt;sub&gt;y&lt;/sub&gt;) noktasının vekt&amp;ouml;rel ifadesi arabanın merkezden&lt;em&gt;(merkez olarak başka bir nesne konumu &amp;ouml;rneğin yol kenarındaki bariyer de kabul edilebilir)&lt;/em&gt;&amp;nbsp;ne kadar uzakta olduğunu s&amp;ouml;yler. Lakin az &amp;ouml;nce belirttiğimiz &amp;uuml;zere &amp;ouml;zellikle iki boyutlu saha kullanan oyunlarda vekt&amp;ouml;r&amp;uuml;n b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;&lt;em&gt;(uzunluğu)&lt;/em&gt; g&amp;ouml;z ardı edilebilir. Y&amp;ouml;n&lt;em&gt;(direction)&lt;/em&gt; daha &amp;ouml;nemli ise. Bu sebeple birim vekt&amp;ouml;re&lt;em&gt;(Unit Vector)&lt;/em&gt;&amp;nbsp;sıklıkla rastlanır. Herhangi bir vekt&amp;ouml;r&amp;uuml; normalleştirme&lt;em&gt;(normalizing)&lt;/em&gt; işlemine tabi tutarak birim vekt&amp;ouml;r cinsinden ifade etmek m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Yukarıdaki g&amp;ouml;rselde yer alan senaryonun cebirsel ifadesini d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde V&lt;sub&gt;5&lt;/sub&gt; vekt&amp;ouml;r&amp;uuml;n&amp;uuml;n diğer vekt&amp;ouml;rlerin toplamı olarak ifade edilebileceğini de s&amp;ouml;yleyebiliriz. Burada &amp;uuml;&amp;ccedil;gen kuralı&lt;em&gt;(Triangle Rule)&lt;/em&gt; kullanılmaktadır ve V&lt;sub&gt;5&amp;nbsp;&lt;/sub&gt;= V&lt;sub&gt;1&amp;nbsp;&lt;/sub&gt;+ V&lt;sub&gt;2&amp;nbsp;&lt;/sub&gt;+ V&lt;sub&gt;3&amp;nbsp;&lt;/sub&gt;+ V&lt;sub&gt;4&lt;/sub&gt; eşitliği ge&amp;ccedil;erlidir. Bir başka deyişle başlangı&amp;ccedil; noktasından itibaren y&amp;ouml;n değiştirerek ilerleyen bir aracın son konumunu ifade eden bir vekt&amp;ouml;r tanımına ulaşabiliriz. Buradan hareketle birim vekt&amp;ouml;re d&amp;ouml;n&amp;uuml;ş&amp;uuml;t&amp;uuml;r&amp;uuml;p g&amp;ouml;receli olarak başka şeylerle kıyaslayabilir, ilersinde mi gerisinde mi ters y&amp;ouml;nde mi aynı y&amp;ouml;nde mi gibi sonu&amp;ccedil;lara da varabiliriz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Vekt&amp;ouml;rlerde 0,0 konumuna g&amp;ouml;re kurulan dik &amp;uuml;&amp;ccedil;genlerden yararlanılarak y&amp;ouml;n&amp;uuml; belirten a&amp;ccedil;ılar da kolaylıkla hesaplanabilir. Genelde bu hesaplamalar dik &amp;uuml;&amp;ccedil;genin karşıt kenarı ile komşu kenar arasındaki oranın arktanjantı şeklinde hesaplanır&lt;em&gt;(tanjantının -1 &amp;uuml;ss&amp;uuml; yani kotanjant değeridir esasında)&lt;/em&gt; ve derece cinsinden bulunur. Oyun motorlarının &amp;ccedil;oğunda derece yerine radyan kullanılır. Bir daireyi d&amp;ouml;rt eşit dilim olarak b&amp;ouml;ld&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde radyan ile dilimlerin pi değeri cinsinden ifade edilmesi sağlanır. Bulunan a&amp;ccedil;ının radyana &amp;ccedil;evrilmesi ya da tam tersinin yapılması da form&amp;uuml;ller ile m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;Y&amp;ouml;n i&amp;ccedil;in &amp;ouml;nem arz eden a&amp;ccedil;ının bulunmasında sadece tanjant değil zaman zaman sin&amp;uuml;s ve kosin&amp;uuml;s fonksiyonları da kullanılabilir. Aslında varmak istediğim nokta biraz da şu. Elimizde radyan cinsinden a&amp;ccedil;ı ve &amp;ouml;rneğin bir kenar bilgisi varsa oluşan dik &amp;uuml;&amp;ccedil;genin diğer kenarını hesap etmek, başka bir deyişle hedef x,y koordinatlarına ulaşmak kolaydır. Buna g&amp;ouml;re,&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Elimizde a&amp;ccedil;ının karşı kenar uzunluğu ile hipoten&amp;uuml;s değeri varsa sin&amp;uuml;s fonksiyonundan yararlanılarak a&amp;ccedil;ı bulunabilir.&lt;/li&gt;
&lt;li&gt;Elimizde bulunmak istenen a&amp;ccedil;ının karşıt kenar uzunluğu ile komşu kenar uzunluğu varsa tanjant fonksiyonundan yararlanılır.&lt;/li&gt;
&lt;li&gt;Son olarak elimizde bulunmak istenen a&amp;ccedil;ının komşu kenar uzunluğu ile hipoten&amp;uuml;s değeri varsa kosin&amp;uuml;s fonksiyonundan yararlanılabilir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bu noktada a&amp;ccedil;ı ile vekt&amp;ouml;r arasındaki ilişkiyi ve dolayısıyla bir vekt&amp;ouml;r&amp;uuml;n y&amp;ouml;n&amp;uuml;n&amp;uuml; bulmayı iyi anlamak gerekir. Elimizde bir a&amp;ccedil;ı varsa birim vekt&amp;ouml;r cinsinden y&amp;ouml;n&amp;uuml; bulmak olduk&amp;ccedil;a kolaydır. Buna g&amp;ouml;re a&amp;ccedil;ının sin&amp;uuml;s&amp;uuml; y değerini, kosin&amp;uuml;s&amp;uuml; de x değerini bulmamızı sağlar. Araştırmalarıma g&amp;ouml;re a&amp;ccedil;ı bilgisine sahip olduğumuz durumlarda x,y değerlerinden hangisinin kosin&amp;uuml;s hangisinin sin&amp;uuml;s ile hesaplanacağını alfabetik sıralamalardan bulabiliriz. Alfabetik sıralarına g&amp;ouml;re x, y'den &amp;ouml;nce geldiği i&amp;ccedil;in cos'da sin'den &amp;ouml;nce gelmelidir... Sanırım ne demek istediğimi anladınız :)&lt;/p&gt;
&lt;p&gt;Gelin bir sin&amp;uuml;s eğrisinin kullanıldığı &amp;ouml;rnek kod par&amp;ccedil;asının &amp;ccedil;alışmasına bakalım. Sol ve sağ ok tuşlarına basıldığında dairenin x kooridanatı değerine g&amp;ouml;re sin&amp;uuml;s değeri hesaplanır ve y değeri buna g&amp;ouml;re değiştirilir. Sonu&amp;ccedil;ta altın renkli topun sin&amp;uuml;s eğrisine g&amp;ouml;re hareketi s&amp;ouml;z konusudur. Tabi normalde sin&amp;uuml;s eğrisine baktığımızda ilk hareketin yukarı y&amp;ouml;nl&amp;uuml; başladığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Ancak burada koordinat sisteminde 0,0 orjininin ekranın sol &amp;uuml;st k&amp;ouml;şesinde olduğunu hatırlayalım. Yine de y değerinin artım ve azaltımını duruma g&amp;ouml;re değiştirip aşağı ve yukarı y&amp;ouml;nl&amp;uuml; hareketleri kontrol edebileceğimizi unutmayalım. Tabii bu s&amp;ouml;ylediğim kanun h&amp;uuml;km&amp;uuml;nde kararname değildir ve bu kadar katı d&amp;uuml;ş&amp;uuml;nmeye gerekte yoktur. &amp;Ccedil;&amp;uuml;nk&amp;uuml;;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Oyun sahası oyuncunun hakimiyetindedir ve oyun programlamada altın bir kuraldan bahsedilir. Doğru g&amp;ouml;r&amp;uuml;n&amp;uuml;yorsa doğrudur&amp;nbsp;&lt;em&gt;(If it looks right, it is right - 3D Math Primer for Graphics and Game Development, Fletcher Dunn)&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Ekim/sinecurve.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Nokta &amp;Ccedil;arpım&lt;em&gt;(Dot Product)&lt;/em&gt;&lt;/h2&gt;
&lt;p&gt;İki boyutlu oyun sahasında nesnelerin y&amp;ouml;nleri arasındaki a&amp;ccedil;ının değerlendirildiği pek &amp;ccedil;ok durum var. &amp;Ouml;rneğin bir u&amp;ccedil;ağın bir checkpoint noktasından ge&amp;ccedil;ip ge&amp;ccedil;mediğini anlarken ya da karakterin yokuş aşağıya indiğini veya yukarı doğru &amp;ccedil;ıktığını hesaplarken a&amp;ccedil;ıları kullanabiliriz. Aşağıdaki g&amp;ouml;sterimde u&amp;ccedil;ağın y&amp;ouml;n&amp;uuml; ile checkpoint noktasının y&amp;ouml;n&amp;uuml; arasındaki ilişkinin nokta &amp;ccedil;arpım ile ele alınışı değerlendirilmekte. Bu senaryolarda birim vekt&amp;ouml;rlerin g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığını baştan belirteyim. Nitekim buradaki senaryoda vekt&amp;ouml;r&amp;uuml;n b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;nden ziyade y&amp;ouml;n&amp;uuml; &amp;ouml;nemli. Birim vekt&amp;ouml;r cinsinden bir nesnenin y&amp;ouml;n&amp;uuml;n&amp;uuml; ifade ettiğimizde aradaki a&amp;ccedil;ıyı bulmak i&amp;ccedil;in nokta &amp;ccedil;arpımı form&amp;uuml;lasyonundan da yararlanabiliyor. Nokta &amp;ccedil;arpım hesaplaması ters tanjant ya da ters kosin&amp;uuml;s ile bulunan a&amp;ccedil;ı hesaplamasına g&amp;ouml;re işlemciye daha az y&amp;uuml;k bindirmekte. Yani işlem maliyeti &amp;ccedil;ok daha ucuz. Bu sebeple pek &amp;ccedil;ok oyun motoru bu fonksiyonelliği hazır olarak da sunmakta.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Ekim/dotproduct1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Nokta &amp;ccedil;arpımını birim vekt&amp;ouml;re indirgediğimizde elde edilen skalar değer -1 ile 1 aralığında olacaktır. Buna g&amp;ouml;re vekt&amp;ouml;rlerin aynı veya ters y&amp;ouml;nde olduklarını ya da birbirlerine yaklaştıklarını veya uzaklaştıklarını anlayabiliriz. Yani a&amp;ccedil;ısal olarak anlamlandırdığımızda dar veya geniş a&amp;ccedil;ıların farkındalığına g&amp;ouml;re bir karar verebiliriz. Aşağıdaki g&amp;ouml;rselde birim vekt&amp;ouml;rlerin konumlarına g&amp;ouml;re u&amp;ccedil; nokta değerleri g&amp;ouml;r&amp;uuml;lmektedir. Şimdi size kendi başınıza bir &amp;ccedil;alışma &amp;ouml;nerisinde bulunayım. Sağ vekt&amp;ouml;r&amp;uuml;n bitiş noktasından tekrar kendisine gelecek şekilde bir &amp;ccedil;ember &amp;ccedil;izin. &amp;Ccedil;emberin ana kartezyen doğruları ile kesim noktalarını pi cinsinden ifade etmeye &amp;ccedil;alışın. Ardından &amp;ccedil;ember &amp;uuml;st&amp;uuml;ndeki herhangi bir noktanın x,y koordinat değerlerini trigonometrik fonksiyonları kullanarak bulmayı deneyin. İşte bir &amp;ccedil;ember y&amp;ouml;r&amp;uuml;ngesinde hareket ettirmek istediğiniz uzay gemisi i&amp;ccedil;in gerekli hesaplamaların temel matematiğini keşfettiniz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Ekim/dotproduct2.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Skaler İzd&amp;uuml;ş&amp;uuml;m (Scalar Projection)&lt;/h2&gt;
&lt;p&gt;Vekt&amp;ouml;rler arası nokta &amp;ccedil;arpım operasyonunun bir kullanım şekli de skaler izd&amp;uuml;ş&amp;uuml;m değerinin bulunmasıdır. Esasında bu değer yardımıyla &amp;ouml;rneğin bir yarışta &amp;ouml;n&amp;uuml;m&amp;uuml;zdeki aracın ne kadar mesafe gerisinde olduğumuzu&amp;nbsp;hesaplamak i&amp;ccedil;in bu enstr&amp;uuml;mandan yararlanabiliriz. Ancak bu senaryoda vekt&amp;ouml;rlerden birisi birim vekt&amp;ouml;re indirgenir(Normalizasyon) ardından diğer vekt&amp;ouml;r ile nokta &amp;ccedil;arpım işlemine tabii tutulur. Elde edilen sonucun işareti(pozitif veya negatif olması) y&amp;ouml;n&amp;uuml; de ifade eder ama daha da &amp;ouml;nemlisi aradaki mesafe farkını &amp;ouml;ğreniriz. Burada izd&amp;uuml;ş&amp;uuml;msel bir tespit s&amp;ouml;z konusudur. Aşağıdaki grafikte durum biraz daha net anlaşılabilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Ekim/scaler_projection2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İki boyutlu koordinat sistemimize g&amp;ouml;re g&amp;uuml;ney doğu y&amp;ouml;n&amp;uuml;nde hareket eden iki yarış arabası var. Arkadaki aracın &amp;ouml;ndekinden ne kadar mesafe geride olduğunu bulmak istiyoruz. &amp;Ouml;ncelikle ilk aracın y&amp;ouml;n&amp;uuml;n&amp;uuml; ifade eden vekt&amp;ouml;r&amp;uuml;(V&lt;span style="font-size: 11.6667px;"&gt;a&lt;/span&gt;) birim vekt&amp;ouml;re &amp;ccedil;evireceğiz(V&lt;sub&gt;1&lt;/sub&gt;). Ardından elde edilen vekt&amp;ouml;r&amp;uuml;&amp;nbsp;şekilde &amp;ccedil;izilen ikinci vekt&amp;ouml;r ile(V&lt;sub&gt;&lt;span style="font-size: 11.6667px;"&gt;3&lt;/span&gt;&lt;/sub&gt;) ile nokta &amp;ccedil;arpım işlemine tabii tutacağız. Birim vekt&amp;ouml;re &amp;ccedil;evirme işlemi(normalizasyon) bilindiği &amp;uuml;zere vekt&amp;ouml;r&amp;uuml;n kendisinin, b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;ne oranı ile hesap ediliyor. Buradan elde edeceğimiz vekt&amp;ouml;r&amp;uuml; &amp;ouml;rnekte(V&lt;sub&gt;&lt;span style="font-size: 11.6667px;"&gt;4&lt;/span&gt;&lt;/sub&gt;) olarak isimlendirdik. Geometrik olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;rsek yaptığımız işlem V&lt;sub&gt;3&lt;/sub&gt; vekt&amp;ouml;r&amp;uuml;n&amp;uuml;n V&lt;sub&gt;1&lt;/sub&gt; birim vekt&amp;ouml;r&amp;uuml; &amp;uuml;st&amp;uuml;nden ge&amp;ccedil;en hayali doğrudaki izd&amp;uuml;ş&amp;uuml;m&amp;uuml;n&amp;uuml; bulmak. Dikkat edileceği &amp;uuml;zere izd&amp;uuml;ş&amp;uuml;m&amp;uuml; oluşan dik &amp;uuml;&amp;ccedil;genin V&lt;sub&gt;1&lt;/sub&gt; vekt&amp;ouml;r d&amp;uuml;zlemindeki kenarına karşılık geliyor. B&amp;ouml;ylece aynı paraleldeki bu iki araba arasındaki mesafeyi A aracına g&amp;ouml;re hesap etmiş olduk&lt;em&gt;(A aracına g&amp;ouml;re dedim dikkat ederseniz)&lt;/em&gt; Konuyu pekiştirmek adına bir antrenman sorusu &amp;uuml;st&amp;uuml;nde d&amp;uuml;ş&amp;uuml;nelim.&amp;nbsp;B aracının y&amp;ouml;n&amp;uuml;n&amp;uuml; işaret eden vekt&amp;ouml;r&amp;uuml; birim vekt&amp;ouml;re d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;p, B'dan A aracına &amp;ccedil;izilen yeni bir vekt&amp;ouml;r ile nokta &amp;ccedil;arpım işlemine tabii tutsaydık aynı mesafe değerini bulur muyduk ve bulursak işareti negatif mi yoksa pozitif mi olurdu?&lt;/p&gt;
&lt;p&gt;Nokta &amp;ccedil;arpımı ve birim vekt&amp;ouml;r ilişkisi ile ilgili olarak şu &amp;ouml;zeti de ge&amp;ccedil;ebiliriz. İki birim vekt&amp;ouml;re arasındaki a&amp;ccedil;ıyı bulmak i&amp;ccedil;in nokta &amp;ccedil;arpımların ters kosin&amp;uuml;s&amp;uuml;(arkkosin&amp;uuml;s) fonksiyonundan yararlanılabilir. Aradaki a&amp;ccedil;ıyı bulmak i&amp;ccedil;in birim vekt&amp;ouml;r kullanmak zorunda da değiliz. Nitekim iki vekt&amp;ouml;r&amp;uuml;n nokta &amp;ccedil;arpımı b&amp;uuml;y&amp;uuml;kl&amp;uuml;kleri ile aradaki a&amp;ccedil;ının kosin&amp;uuml;s değerinin &amp;ccedil;arpımına eşittir. Buradan yola &amp;ccedil;ıkarak iki vekt&amp;ouml;r&amp;uuml;n nokta &amp;ccedil;arpımının, vekt&amp;ouml;r b&amp;uuml;y&amp;uuml;kl&amp;uuml;klerinin &amp;ccedil;arpımına olan oranının arkkosin&amp;uuml;s değeri bize yine aradaki a&amp;ccedil;ıyı verecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Ekim/dotproduct3.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Doğrusal İnterpolasyon&lt;em&gt;(Linear Interpolation)&lt;/em&gt;&lt;/h2&gt;
&lt;p&gt;Oyun sahasında başvurulan matematik enstr&amp;uuml;manlarından bir diğeri de Linear Interpolation kavramıdır. &amp;Ouml;rneğin motion efektlerinde, belli bir rotayı izlemesi istenen unsurlarda, renk ge&amp;ccedil;işlerinde, giderek hızlanan veya yavaşlayan nesnelerde sıklıkla başvurulur. En basit formu da iki nokta arasında gidilmesi istenen mesafenin zamansal olarak kesin bilindiği hareket efektleridir. &amp;Ouml;rneklendirirsek daha iyi olacak. Diyelim ki 2D kartezyen sisteminde x,y değerlerini bildiğimiz A ve B noktaları var. Diğer yandan oyun nesnesinin A noktasından B noktasına tam tamına 10 saniyede varacağını planlıyoruz. Amacımız herhangi bir t anında bu nesnenin iki nokta arasındaki doğruda hangi x,y koordinatlarında olduğunu &amp;ouml;ğrenmek ki buna g&amp;ouml;re onun otomatik hareketlenmesini sağlamamız m&amp;uuml;mk&amp;uuml;n olur. Aşağıdaki grafikte bu hesaplama i&amp;ccedil;in kullanılabilecek form&amp;uuml;llere yer veriliyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Ekim/linear_inter_01.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Başlangı&amp;ccedil; aşamasında A konumunda olan nesnenin 10ncu saniyede B konumunda olacağını biliyoruz. Buna g&amp;ouml;re &amp;ouml;rneğin C konumundan ge&amp;ccedil;erken mevcut x,y koordinatlarını bulmak istersek nasıl bir form&amp;uuml;l kullanırız? Esasında zaman &amp;ccedil;izelgesini y&amp;uuml;zdesel olarak ifade edersek işimiz &amp;ccedil;ok daha kolaylaşıyor. Başlangı&amp;ccedil; konumu olasılığı %0 hali ile ifade edilirse 10ncu saniyede varış noktasına gelmiş olmamız da %100'e karşılık gelir. Yani varış noktasında isek nesne y&amp;uuml;zde y&amp;uuml;z kesinlikte rotasını tamamlamıştır. Bir başka deyişle başlangı&amp;ccedil; ve bitiş noktalarını y&amp;uuml;zdesel olarak d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde 0 ile 1 arasında yer alan bir olasılık değerinden bahsedebiliriz. Bu değer form&amp;uuml;l&amp;uuml;m&amp;uuml;zdeki t parametresine karşılık gelir ve oyunda kullanılan FPS&lt;em&gt;(frame per second)&lt;/em&gt;&amp;nbsp;bilgisine g&amp;ouml;re ayarlanır. &amp;Ouml;rneğin her bir frame 0.1 saniyede ge&amp;ccedil;iliyorsa bir T anını T = T + 0.1 gibi ifade edebiliriz. Kendi senaryomuzda bu T değerinin 10'a b&amp;ouml;l&amp;uuml;m&amp;uuml; hesaplamadaki t değerini verecektir. Bir başka deyişle elimizde FPS değeri varsa herhangi bir andaki t değerini hesaplamak kolaydır.&lt;/p&gt;
&lt;p&gt;İşin zorlaştığı noktalardan bir tanesi yer&amp;ccedil;ekiminin devreye girdiği ya da rotanın doğrusal olarak ifade edilemediği eğrilerden oluşan senaryolardır. &amp;Ouml;rneğin &amp;ouml;n&amp;uuml;ndeki tepeden space tuşuna basınca sı&amp;ccedil;yarak karşı tepeye ulaşmaya &amp;ccedil;alışan bir arabayı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. B&amp;ouml;yle bir durumda yer&amp;ccedil;ekimine g&amp;ouml;re bir eğri &amp;ccedil;izilmesi ve bunun zaman bağımlı olarak hesaplanması gerekir. Bu senaryo i&amp;ccedil;in aşağıdaki şekli g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz. Hareket halindeki aracın bulunduğu noktayı bir vekt&amp;ouml;r olarak ifade edeceğiz&lt;em&gt;(P ile ifade edilen kısım)&lt;/em&gt; Ayrıca t anında gittiği y&amp;ouml;n&amp;uuml; taşıyan birde hız vekt&amp;ouml;r&amp;uuml; kullanmaktayız&lt;em&gt;(V ile ifade edilen)&lt;/em&gt;&amp;nbsp;t ile oyun motorlarının bize genellikle hazır olarak verdiği delta time değerini ifade ediyoruz. Nitekim oyuncunun oynadığı platform ne olursa olsun herkesin aynı s&amp;uuml;resel değeri kullanması &amp;ouml;nemli. &amp;Ccedil;ok oyunculu &amp;ccedil;evrimi&amp;ccedil;i platformlarda da FPS farklılıklarını ortadan kaldıracak bir &amp;ouml;zellik diyebiliriz sanırım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Ekim/linear_inter_02.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aracın t+1 anındaki konumunu ifade eden vekt&amp;ouml;r&amp;uuml; bulmak i&amp;ccedil;in hız vekt&amp;ouml;r&amp;uuml; ile delta time bilgisinin yer aldığı bir form&amp;uuml;l kullanılır. Ancak &amp;ouml;ncesinde o anki hız değerini işaret eden vekt&amp;ouml;r&amp;uuml;n yine delta time ve yer &amp;ccedil;ekimi vekt&amp;ouml;r&amp;uuml;n&amp;uuml;n hesaba katılacağı bir form&amp;uuml;l ile bulunması gerekir. A ile ifade edilen&lt;em&gt;(genelde Acceleration olarak bilinir)&lt;/em&gt;&amp;nbsp;vekt&amp;ouml;r bu senaryoda yer&amp;ccedil;ekimini işaret eden sabit bir vekt&amp;ouml;r değeridir.&lt;/p&gt;
&lt;h2&gt;Birim &amp;Ccedil;ember ve Dairesel Hareket&lt;/h2&gt;
&lt;p&gt;Az &amp;ouml;nce kartezyen &amp;uuml;zerindeki bir oyun nesnesine dairsel bir rotada hareket vermek istersek x,y koordinatlarını nasıl hesap edebileceğimizi sormuştuk. Esasında bazı oyun nesnelerinde &amp;ccedil;emberin b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;nden ziyade merkez koordinatlarına g&amp;ouml;re hangi y&amp;ouml;ne gideceğinin belirlenmesinde birim &amp;ccedil;emberi baz alan vekt&amp;ouml;rlere sıklıkla başvurulduğu g&amp;ouml;r&amp;uuml;l&amp;uuml;yor. Aşağıdaki grafikle durumu biraz daha iyi anlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Ekim/math_101_04.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;emberin yarı&amp;ccedil;apının birim vekt&amp;ouml;r olduğunu kabul edelim. Bu y&amp;uuml;zden &amp;ccedil;emberimiz de birim &amp;ccedil;ember olarak ifade edilir. Buna g&amp;ouml;re 0&amp;deg; a&amp;ccedil;ıya g&amp;ouml;re konuşlanan bir vekt&amp;ouml;r&amp;uuml;n &amp;theta;&lt;em&gt;(teta)&lt;/em&gt; a&amp;ccedil;ısı kadar saat y&amp;ouml;n&amp;uuml;n&amp;uuml;n tersine doğru hareket etmesi, &amp;ccedil;emberin yarı&amp;ccedil;apı kadar olan bir y&amp;ouml;r&amp;uuml;ngede belli bir mesafe yol kat edilmesi anlamına gelir. İşte bu kat edilen mesafeyi radyan cinsinden ifade edebiliriz. Hatta g&amp;ouml;sterimde &amp;ccedil;ember eğrisi &amp;uuml;st&amp;uuml;ndeki rotada bir hareket s&amp;ouml;z konusudur. Bu hareketi cebimize koyalım ve v = [1,0] vekt&amp;ouml;r&amp;uuml;ne g&amp;ouml;re oluşan a&amp;ccedil;ı değişimi i&amp;ccedil;in de bir şeyler s&amp;ouml;yleyelim. Genelde halk arasında a&amp;ccedil;ılar hep derece cinsinden ele alınır lakin matematik&amp;ccedil;iler a&amp;ccedil;ı yerine daha &amp;ccedil;ok radyan birimini kullanmayı tercih ederler. Nitekim bir &amp;ccedil;ember ile tarif edilen ve 0&amp;deg; ile 360&amp;deg; arasında değişen a&amp;ccedil;ıları 𝜋&lt;em&gt;(pi)&lt;/em&gt; cinsinden tanımlamak ve buna g&amp;ouml;re &amp;ccedil;ember &amp;uuml;st&amp;uuml;nde kat edilen mesafeyi de 𝜋 değerlerine g&amp;ouml;re ifade etmek m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. S&amp;ouml;z gelimi 0&amp;deg;, 0 radyan iken tam tur yani 360&amp;deg; bir d&amp;ouml;n&amp;uuml;ş 2𝜋 değeri ile ifade edilebilir. Buradan yola &amp;ccedil;ıkarak bir radyanın 180&amp;deg;/𝜋 ile ifade edilebileceğini g&amp;ouml;rebiliriz. Diğer yandan bilinmeyen bir radyan değeri i&amp;ccedil;in g&amp;ouml;rseldeki form&amp;uuml;lden yararlanılabilir. Aşağıdaki tabloda bazı pop&amp;uuml;ler a&amp;ccedil;ıların derece, radyan, kosin&amp;uuml;s, sin&amp;uuml;s ve tanjant tringonometrik fonksiyonları cinsinden değerlerine yer verilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;&lt;img src="/image.axd?picture=/2022/Ekim/math_101_03.png" alt="" /&gt;&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ember &amp;uuml;st&amp;uuml;ndeki harekete ait dikkat edeceğimiz &amp;ouml;nemli noktalardan birisi de aslında x,y koordinatları i&amp;ccedil;in hep bir dik &amp;uuml;&amp;ccedil;genin &amp;ccedil;izilebilecek olmasıdır. Pozitif x ekseni &amp;uuml;st&amp;uuml;ndeki birim vekt&amp;ouml;r&amp;uuml;n b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;n&amp;uuml;n &amp;ccedil;ember hareketi sırasında 1 ile -1 arasında hareket ettiğini fark etmiş olmalısınız. Buna karşın &amp;ccedil;ember &amp;uuml;st&amp;uuml;ndeki vekt&amp;ouml;r&amp;uuml;n merkeze olan mesafesi s&amp;uuml;rekli olarak dik &amp;uuml;&amp;ccedil;genin durumuna g&amp;ouml;re değişmektedir. x ve y değerlerinin bu dik &amp;uuml;&amp;ccedil;gene g&amp;ouml;re pisagor teoremini kullanarak hesaplanması da olduk&amp;ccedil;a kolaydır. Hipoten&amp;uuml;s&amp;uuml;n de aslında bir vekt&amp;ouml;r olarak ifade edilebileceğini belirtelim. Ele aldığımız senaryoda [1,0] birim vekt&amp;ouml;r&amp;uuml;m&amp;uuml;z ve a&amp;ccedil;ı bilinmekte. Dolayısıyla trigonometrik fonksiyonlar yardımıyla x,y değerlerini hesaplayabilir ve dairesel hareketin t&amp;uuml;m noktalarını gezebiliriz. Peki t&amp;uuml;m bunlar ne anlama geliyor? Eğer yarı&amp;ccedil;apını bildiğimiz bir &amp;ccedil;ember varsa a&amp;ccedil;ıyı 0 ile 2𝜋 arasında dolaştırarak x ve y değerlerini bulabiliriz. x değeri a&amp;ccedil;ının kosin&amp;uuml;s&amp;uuml;n&amp;uuml;n yarı&amp;ccedil;ap ile &amp;ccedil;arpımına, y ise a&amp;ccedil;ının sin&amp;uuml;s&amp;uuml;n&amp;uuml;n yarı&amp;ccedil;ap ile &amp;ccedil;arpımına eşit olacaktır. Aşağıdaki animasyonda yine rust ile yazdığımız &amp;ouml;rnekte oluşan sonucu g&amp;ouml;rebilirsiniz. Space tuşuna basınca kahverengi daire dairesel bir hareket ger&amp;ccedil;ekleştirmektedir.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt; &lt;img src="/image.axd?picture=/2022/Ekim/circle_move.gif" alt="" /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu &amp;ouml;rneklerden yola &amp;ccedil;ıkarak size tavsiyem hakim olduğunuz programlama dilini kullanarak bir eliptik y&amp;ouml;r&amp;uuml;nge hareketini uygulamaya &amp;ccedil;alışmanız olacaktır.&lt;/p&gt;
&lt;p&gt;Elbette oyun geliştirmede kullanılan matematiksel enstr&amp;uuml;manlar bunlarla sınırlı değil. Matrisler, lineer cebir gibi daha bir &amp;ccedil;ok konu başlığı bulunmakta. İlerleyen zamanlarda bu konulara da değinmek istiyorum. Yine de basit oyun kinematiği &amp;uuml;zerine gerekli denklemlerin &amp;uuml;zerinden ge&amp;ccedil;tiğimizi s&amp;ouml;yleyebilirim. Sadece vekt&amp;ouml;r ve a&amp;ccedil;ıları kullanarak bile sahadaki karakterleri y&amp;ouml;nlendirmek, hızlandırmak, bir yerlere &amp;ccedil;arpıp &amp;ccedil;arpmadığını bulmak kolaydır. Fakat unutulmaması gereken bir husus var; Aynı sonuca varmak i&amp;ccedil;in farklı denklemler kullanılabilir ve bazıları işlemciyi daha az yoracak t&amp;uuml;rden olabilir.&lt;/p&gt;
&lt;p&gt;Tabii t&amp;uuml;m bu teroik bilgileri bir şekilde denemek de gerekiyor. Ben biraz daha zor olan yolu se&amp;ccedil;ip Rust tarafındaki oyun motorlarından faydalanmaya &amp;ccedil;alıştım. Nitekim Unity, Unreal Engine gibi zengin IDE desteğine sahip platformlarda bu matematik bilgilerine ihtiya&amp;ccedil; duyulmayabilir. G&amp;ouml;rsel geliştirme ortamları &amp;ccedil;oğunlukla s&amp;uuml;r&amp;uuml;kle bırak y&amp;ouml;ntemi ile bir&amp;ccedil;ok şeyin &amp;uuml;stesinden geliyor. Rotayı &amp;ccedil;iziyor, s&amp;uuml;releri veriyorsunuz ve ta taaa... Yabancı gemi o formasyonda hareket ediveriyor. Siz yine de asıl dinamikleri &amp;ouml;ğrenmeye bakın. B&amp;ouml;ylece geldik bir maceranın daha sonuna. Bir başka yazıda buluşmak &amp;uuml;zere hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;Ouml;zet &amp;Ccedil;evirinin Hazırlanmasında Yararlandığım Kaynaklar&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href="https://www.youtube.com/watch?v=DPfxjQ6sqrc)" target="_blank"&gt;Essential Mathematics For Aspiring Game Developers&lt;/a&gt; &lt;strong&gt;&lt;em&gt;(Birincil kaynağımdı diyebilirim)&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;3D Math Primer for Graphics and Game Development, Fletcher Dunn&lt;/li&gt;
&lt;li&gt;Foundations of Game Engine Development, Volume 1: Mathematics, Eric Lengyel&lt;/li&gt;
&lt;li&gt;&lt;a href="https://youtu.be/fjOdtSu4Lm4" target="_blank"&gt;Math for Game Devs [2022, part 1]&lt;/a&gt; - Numbers, Vectors &amp;amp; Dot Product (Freya Holm&amp;eacute;r)&lt;/li&gt;
&lt;/ul&gt;</content>
  <pubDate>2022-10-14 11:20:00</pubDate>
  <slug>oyun-gelistirmede-kullanilan-temel-matematik-enstrumanlar</slug>
  <tags>
    <tag>oyun-programlama</tag>
    <tag>matematik</tag>
    <tag>rust</tag>
    <tag>pisagor</tag>
    <tag>trigonometri</tag>
    <tag>vektörler</tag>
    <tag>açılar</tag>
    <tag>nokta-çarpımı</tag>
    <tag>birim-vektör</tag>
    <tag>normalizasyon</tag>
    <tag>doğrusal-denklem</tag>
    <tag>interpolasyon</tag>
    <tag>oyun-matematiği</tag>
  </tags>
  <categories>
    <category>Rust</category>
  </categories>
</post>