<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Caching Mekanizmasını Anlamak - 1</title>
  <description>Bu makalemiz ile birlikte, web sayfalarının istemcilere daha hızlı bir şekilde ulaştırılmasında kullanılan tekniklerden birisi olan Caching (Ara Belleğe Alma) mekanizmasını incelemeye başlıyacağız. Akıllıca kullanıldığı takdirde web uygulamalarında istemcilere nazaran göreceli olarak performans artışına neden olan Caching (Ara Belleğe Alma) mekanizması, teorik olarak bir web sayfasının tamamının ya da bir parçasının ara belleğe alınarak belli bir süre boyunca burada tutulması prensibini temel alarak çalışır. Asp.Net uygulamaları söz konusu olduğunda bir sayfanın tamamını, belli bir veri kümesini veya sayfa üzerindeki herhangibir kontrolü ara belleğe alabiliriz. Buna göre Asp.Net uygulamalarındaki Caching (Ara Belleğe Alma) mekanizması aşağıdaki üç farklı tekniği destekler.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemiz ile birlikte, web sayfalarının istemcilere daha hızlı bir şekilde ulaştırılmasında kullanılan tekniklerden birisi olan Caching (Ara Belleğe Alma) mekanizmasını incelemeye başlıyacağız. Akıllıca kullanıldığı takdirde web uygulamalarında istemcilere nazaran g&amp;ouml;receli olarak performans artışına neden olan Caching (Ara Belleğe Alma) mekanizması, teorik olarak bir web sayfasının tamamının ya da bir par&amp;ccedil;asının ara belleğe alınarak belli bir s&amp;uuml;re boyunca burada tutulması prensibini temel alarak &amp;ccedil;alışır. Asp.Net uygulamaları s&amp;ouml;z konusu olduğunda bir sayfanın tamamını, belli bir veri k&amp;uuml;mesini veya sayfa &amp;uuml;zerindeki herhangibir kontrol&amp;uuml; ara belleğe alabiliriz. Buna g&amp;ouml;re Asp.Net uygulamalarındaki Caching (Ara Belleğe Alma) mekanizması aşağıdaki &amp;uuml;&amp;ccedil; farklı tekniği destekler.&lt;/p&gt;
&lt;table id="table1" style="border-collapse: collapse; width: 479px;" border="1" cellpadding="5" bgcolor="#cccccc"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="467"&gt;&lt;strong&gt;Asp.Net Uygulamaları İ&amp;ccedil;in Caching (Ara Belleğe Alma) Teknikleri&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="467"&gt;1 - Output Caching ( &amp;Ccedil;ıktının Ara Belleğe Alınması )&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="467"&gt;2 - Data Caching ( Verilerin Ara Belleğe Alınması )&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="467"&gt;3 - Fragment Caching ( Par&amp;ccedil;aların Ara Belleğe Alınması )&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Output Caching tekniğinde, bir aspx sayfasının t&amp;uuml;m i&amp;ccedil;eriği ara belleğe alınır ve belirli bir s&amp;uuml;re boyunca burada tutulur. Bu mekanizmanın &amp;ccedil;alışma bi&amp;ccedil;imini aşağıdaki şekil ile daha kolay irdeleyebiliriz. Bu &amp;ccedil;alışma sistemi temel olarak diğer Caching mekanizmalarında da aynı şekilde işlemektedir. Değişen sadece ara belleğe alınan HTML g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml;n i&amp;ccedil;eriği olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk113_1.gif" alt="" width="490" height="455" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak, birinci istemci web sunucusundan bir aspx sayfasını talep eder. Web sunucusu sayfanın ilişkili kodlarını &amp;ccedil;alıştırarak bir &amp;ccedil;ıktı &amp;uuml;retir ve bu sayfa i&amp;ccedil;in Output Caching (&amp;Ccedil;ıktının Ara Belleğe Alınması) aktif ise &amp;uuml;retilen HTML sonu&amp;ccedil;larını istemciye g&amp;ouml;nderir. Hemen ardından g&amp;ouml;nderilen HTML i&amp;ccedil;eriğini belirtilen s&amp;uuml;re boyunca(duration) tutmak &amp;uuml;zere sunucu &amp;uuml;zerindeki ara belleğe alır.&lt;/p&gt;
&lt;p&gt;Şimdi ikinci bir istemcinin devamlılık s&amp;uuml;resi (Duration) i&amp;ccedil;erisindeyken aynı sayfayı sunucudan talep ettiğini d&amp;uuml;ş&amp;uuml;nelim. Bu durumda web sunucusu, talep edilen sayfanın Cache (Ara Bellek) &amp;uuml;zerinde olup olmadığına bakar. Eğer ikinci kullanıcı talebini, Devamlılık S&amp;uuml;resi (Duration) i&amp;ccedil;erisindeki bir zaman diliminde iletmiş ise, web sunucusu istemciye sayfanın ara bellekteki hazır halini g&amp;ouml;nderir. Dolayısıyla sayfanın &amp;uuml;retilmesinde &amp;ccedil;alıştırılan arka plan kodlarının hi&amp;ccedil; biri tekrardan y&amp;uuml;r&amp;uuml;t&amp;uuml;lmez. Bu elbetteki ikinci kullanıcının talep ettiği sayfa i&amp;ccedil;in daha kısa s&amp;uuml;rede cevap almasını sağlar.&lt;/p&gt;
&lt;p&gt;Output Caching mekanizmasını bir aspx sayfasına uygulayabilmek i&amp;ccedil;in tek yapılması gereken OutputCache direktifinin sayfanın aspx kodlarının olduğu kısıma eklemek yeterlidir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ OutputCache Duration="300" VaryByParam="None"%&amp;gt;&lt;/pre&gt;
&lt;p&gt;Burada, Duration &amp;ouml;zelliği ile sayfanın ilk talep edilişinden sonra 300 saniye (5 dakika) s&amp;uuml;re ile ara bellekte tutulacağını bildirmiş oluyoruz. VaryByName parametresini daha sonra inceleyeceğiz.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdi dilerseniz, kısa bir &amp;ouml;rnek ile Output Caching mekanizmasının etkilerini incelemeye &amp;ccedil;alışalım. Basit bir web uygulaması geliştireceğiz. Bu uygulamada, Sql Sunucusunda yer alan Pubs isimli veri tabanındaki Authors isimli tabloya ait verileri bir DataGrid kontrol&amp;uuml; i&amp;ccedil;erisine aktaracağız.&lt;/p&gt;
&lt;p&gt;default.aspx sayfamızın kodları;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void Baglan()
{
    con=new SqlConnection("data source=localhost;initial catalog=pubs;integrated security=SSPI");
    cmd=new SqlCommand("SELECT * FROM authors",con);
    con.Open();
}
private void Doldur()
{
    dr=cmd.ExecuteReader(CommandBehavior.CloseConnection);
    dgVeriler.DataSource=dr;
    dgVeriler.DataBind();
    dr.Close();
}

private void Page_Load(object sender, System.EventArgs e)
{
    Baglan();
    Doldur();
}&lt;/pre&gt;
&lt;p&gt;Uygulama &amp;ccedil;alıştığında ve default.aspx sayfasının &amp;ccedil;ıktısı &amp;uuml;retildiğinde bu sayfanın son halinin bir kopyasıda ara belleğe alınır. Yeni koypa ara bellekte 300 saniye (5 dakika ) boyunca kalacaktır. Aynı sayfayı başka bir tarayıcı' da a&amp;ccedil;tığımızda ya da aynı tarayıcı penceresinde iken ileri geri gittiğimizde sayfanın ara bellekte bulunan halini elde ederiz. Ancak bu &amp;ouml;rnekte dikkat edilmesi gereken bir nokta vardır. Bu durumu simule etmek i&amp;ccedil;in sayfayı refresh edelim. Bu durumda sayfanın i&amp;ccedil;eriği aşağıdakine benzer olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk113_2.gif" alt="" width="566" height="226" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Daha sonra Duration s&amp;uuml;resi dolmadan &amp;ouml;nce ilk satırın değerini Sql Sunucusu &amp;uuml;zerinden değiştirelim. Bu durumda sayfada Output Caching uygulanmamış olsaydı, sayfayı bir sonraki talep edişimizde Load metodu &amp;ccedil;alışacak ve tablonun en g&amp;uuml;ncel hali kullanıcıya sunulacaktı. Oysaki şimdi sayfayı talep ettiğimizde, yapılan değişikliğin g&amp;ouml;r&amp;uuml;nmediğini farkederiz.&lt;/p&gt;
&lt;p&gt;Değişiklik;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk113_3.gif" alt="" width="487" height="71" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Yeni bir tarayıcı ile aynı sayfayı talep ettiğimizde;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk113_4.gif" alt="" width="566" height="226" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işleyiş bazen b&amp;uuml;y&amp;uuml;k bir risk olabilir. &amp;Ouml;rneğin, sayfanın daha dinamik olduğu durumlarda ve hatta olay metodlarına cevap vermesi gerektiği durumlarda sayfanın tamamının ara belleğe alınması, aslında istemcilere sayfanın en g&amp;uuml;ncel halinin g&amp;ouml;nderilmesi demek değildir. Bu gibi durumlarda &amp;ccedil;oğunlukla ya veri k&amp;uuml;melerinin ya da sayfa &amp;uuml;zerindeki belirli kısımların (kontrollerin) ara belleğe alınması tekniği tercih edilir. Bu teknikleri bir sonraki makalemizde inceleyeceğiz.&lt;/p&gt;
&lt;p&gt;Bir sayfanın tamamını ara belleğe aldığımızda, sayfanın arabellekte yer alacak birden fazla kopyasına ihtiya&amp;ccedil; duyduğumuz durumlar s&amp;ouml;z konusu olabilir. &amp;Ccedil;oğunlukla QueryString kullanımı sırasında başka sayfalara &amp;ccedil;eşitli parametreleri ve değerlerini g&amp;ouml;ndeririz. İşte VaryByParam &amp;ouml;zelliği sayesinde sayfanın, g&amp;ouml;nderdiğimiz her parametre i&amp;ccedil;in ayrı ayrı veya sadece belirli parametreler i&amp;ccedil;in ayrı ayrı kopyalarını ara bellekte tutabiliriz.&lt;/p&gt;
&lt;p&gt;Bu durumu daha yakından inceleyebilmek i&amp;ccedil;in pubs veritabanındaki titles tablosunu kullancağımız bir &amp;ouml;nrek geliştirelim. Uygulamanın default.aspx sayfasında bu kez titles tablosunda yer alan her bir satır i&amp;ccedil;in title alanının değerlerini g&amp;ouml;stereceğiz. Kullanıcı her hangibir başlığa tıkladığında bu kitap ile ilgili detaylı bilgilerin olduğu başka bir sayfaya(detay.aspx) gidecek. Detay sayfası kitabın Primary Key değerini (title_id) QueryString parametresi olarak alacak. Bu durumda, detay sayfası i&amp;ccedil;in ara belleğe alma işlemini ger&amp;ccedil;ekleştirebiliriz. Konuyu daha iyi anlayabilmek i&amp;ccedil;in &amp;ouml;rnek &amp;uuml;zerinden adım adım gidelim. İlk olarak ana sayfamızın (default.aspx) aspx i&amp;ccedil;eriğini aşağıdaki gibi değiştirmeliyiz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:DataGrid id="dgVeriler" style="Z-INDEX: 101; LEFT: 56px; POSITION: absolute; TOP: 88px" runat="server" AutoGenerateColumns="False" Height="160px" Width="264px" BorderColor="#DEBA84" BorderStyle="None" BorderWidth="1px" CellSpacing="2" BackColor="#DEBA84" CellPadding="3"&amp;gt;
&amp;lt;FooterStyle ForeColor="#8C4510" BackColor="#F7DFB5"&amp;gt;&amp;lt;/FooterStyle&amp;gt;
&amp;lt;SelectedItemStyle Font-Bold="True" ForeColor="White" BackColor="#738A9C"&amp;gt;&amp;lt;/SelectedItemStyle&amp;gt;
&amp;lt;ItemStyle ForeColor="#8C4510" BackColor="#FFF7E7"&amp;gt;&amp;lt;/ItemStyle&amp;gt;
&amp;lt;HeaderStyle Font-Bold="True" ForeColor="White" BackColor="#A55129"&amp;gt;&amp;lt;/HeaderStyle&amp;gt;
&amp;lt;PagerStyle HorizontalAlign="Center" ForeColor="#8C4510" Mode="NumericPages"&amp;gt;&amp;lt;/PagerStyle&amp;gt;
&amp;lt;Columns&amp;gt;
&amp;lt;asp:HyperLinkColumn DataNavigateUrlField="title_id" DataNavigateUrlFormatString="Detay.aspx?title_id={0}" DataTextField="title" HeaderText="Başlık"&amp;gt;&amp;lt;/asp:HyperLinkColumn&amp;gt; 
&amp;lt;/Columns&amp;gt;
&amp;lt;/asp:DataGrid&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu değişiklik sayesinde, dataGrid kontrol&amp;uuml;m&amp;uuml;zden Detay.aspx sayfasına title_id alanının değerini parametre olarak g&amp;ouml;nderebileceğiz. Şimdi Detay.aspx sayfamının kodlarını aşağıdaki gibi geliştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void Baglan(string Id)
{
    con=new SqlConnection("data source=localhost;initial catalog=pubs;integrated security=SSPI");
    cmd=new SqlCommand("SELECT title_id,title,price,pubdate FROM titles WHERE title_id='"+Id+"'",con);
    con.Open();
}
private void Doldur()
{
    dr=cmd.ExecuteReader(CommandBehavior.CloseConnection);
    dgDetaylar.DataSource=dr;
    dgDetaylar.DataBind(); 
    dr.Close();
}

private void Page_Load(object sender, System.EventArgs e)
{ 
    string id=Request.Params["title_id"].ToString();
    Baglan(id);
    Doldur();
}&lt;/pre&gt;
&lt;p&gt;Burada ara belleğe alma işlemini Detay.aspx sayfası &amp;uuml;zerinde uyguluyoruz. &amp;Ccedil;&amp;uuml;nk&amp;uuml; detay.aspx, dinamik olarak i&amp;ccedil;eriği gelen parametre değerine g&amp;ouml;re değişen bir sayfadır. Biz gelen parametre değerine g&amp;ouml;re &amp;uuml;retilen sayfaların html &amp;ccedil;ıktılarını ara belleğe almak istiyoruz. İşte bunun i&amp;ccedil;in yine aspx kodlarının başına OutputCache direktifini aşağıdaki gibi eklememiz gerekiyor.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ OutputCache Duration="300" VaryByParam="title_id"%&amp;gt;&lt;/pre&gt;
&lt;p&gt;B&amp;ouml;ylece detay.aspx sayfası her &amp;ccedil;alıştırıldığında gelen title_id değeri baz alınarak ara bellekte 300 saniye s&amp;uuml;reyle duracak olan html &amp;ccedil;ıktılarının oluşturulmasına imkan sağlıyoruz. Olayı şu şekilde irdelersek daha anlaşılır olacaktır;&lt;/p&gt;
&lt;table id="table7" style="border-collapse: collapse;" border="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td colspan="2" width="%100"&gt;
&lt;p align="center"&gt;&lt;strong&gt;Parametre tabanlı OutputCache işlemi&lt;/strong&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="446"&gt;İstemci title_id değeri BU1032 olan satırı detay.aspx sayfasından ister. Bu durumda detay.aspx sayfasının i&amp;ccedil;eriği ara belleğe alınır. Bu sayfayı A olarak d&amp;uuml;ş&amp;uuml;nelim.&lt;/td&gt;
&lt;td width="265"&gt;detay.aspx in &lt;strong&gt;A&lt;/strong&gt; koypası oluşturulur.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="446"&gt;Başka bir İstemci title_id değeri MC2222 olan sayfayı talep eder. Bu durumda detay.aspx sayfasının yeni halinin kopyası ara belleğe alınır.&lt;/td&gt;
&lt;td width="265"&gt;detay.aspx in &lt;strong&gt;B&lt;/strong&gt; koypası oluşturulur.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="446"&gt;Başka bir İstemci title_id değeri MC2222 olan sayfayı talep eder. Eğer duration s&amp;uuml;resi dolmadıysa talep edilen bu sayfanın &amp;ccedil;ıktısı ara bellekte zaten olduğundan istemciye direkt olarak bu &amp;ccedil;ıktı g&amp;ouml;nderilir.&lt;/td&gt;
&lt;td width="265"&gt;detay.aspx in var olan &lt;strong&gt;B&lt;/strong&gt; kopyası d&amp;ouml;ner.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="446"&gt;Başka bir İstemci title_id değeri BU1032 olan sayfayı talep eder. Eğer duration s&amp;uuml;resi dolmadıysa talep edilen bu sayfanın &amp;ccedil;ıktısı ara bellekte zaten olduğundan istemciye direkt olarak bu &amp;ccedil;ıktı g&amp;ouml;nderilir.&lt;/td&gt;
&lt;td width="265"&gt;detay.aspx in var olan &lt;strong&gt;A&lt;/strong&gt; kopyası d&amp;ouml;ner.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td colspan="2" width="%100"&gt;&lt;em&gt; * Duration s&amp;uuml;releri dolduğunda ise gelen talebe g&amp;ouml;re ara bellekteki sayfa &amp;ccedil;ıktıları tekrardan oluşturulur.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi VaryByParam &amp;ouml;zelliği ile, bir sayfanın kendisine QeuryString ile gelen parametrelerinin değerine g&amp;ouml;re farklı ara bellek g&amp;ouml;r&amp;uuml;nt&amp;uuml;lerini elde edebilmekteyiz. Bazı durumlarda talep edilen sayfaya birden fazla parametre g&amp;ouml;nderildiği veya hi&amp;ccedil; parametre g&amp;ouml;nderilmeden &amp;ccedil;ağrıldığıda olur. Bu durumu karşılamak i&amp;ccedil;in VaryByParam &amp;ouml;zelliğine * değerini atayabiliriz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ OutputCache Duration="300" VaryByParam="*" %&amp;gt;&lt;/pre&gt;
&lt;p&gt;Her ne kadar bir sayfanın Output Cache tekniği ile ara belleğe alınması avantajlı g&amp;ouml;r&amp;uuml;nsede, &amp;ouml;zellikle olay kodlamalı sayfaların işleyişinde bu kullanım sorunlara yol a&amp;ccedil;abilir. Her şeyden &amp;ouml;nce sayfa i&amp;ccedil;inde postback' e neden olan kodlamalar var ise, sayfa ilk &amp;ccedil;ağrıldıktan sonra ara belleğe alınacağından bu kod satırları duration s&amp;uuml;resi sonlanana kadar y&amp;uuml;r&amp;uuml;t&amp;uuml;lmeyecektir. Diğer yandan zaman zaman, sayfalarımızın i&amp;ccedil;eriği dinamik olarak değişmek zorunda kalabilir. Bu gibi durumlarda da sayfanın tamamının ara belleğe alınması iyi bir y&amp;ouml;ntem değildir. &amp;Ccedil;&amp;ouml;z&amp;uuml;m, sayfanın belirli par&amp;ccedil;alarının veya sayfadaki herhangibir veri k&amp;uuml;mesinin(k&amp;uuml;melerinin) ara belleğe alınmasıdır. Data Caching ve Fragment Caching tekniklerini bir sonraki makalemizde inceleyeceğiz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/Caching1.rar"&gt;&amp;Ouml;rnek uygulama i&amp;ccedil;in tıklayın.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2005-01-21 08:00:00</pubDate>
  <slug>Caching-Mekanizmasc4b1nc4b1-Anlamak-1-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet</tag>
    <tag>caching</tag>
  </tags>
  <categories>
    <category>Asp.Net</category>
  </categories>
</post>