<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Parallel Programming–Reduction</title>
  <description>Şimdi şöyle düşünelim; elimizde yüsek boyutlu sayısal bir dizi veya koleksiyon olsun ve biz bu sayı kümesi üzerinde örneğin 7 ile tam bölünebilenlerin sayısını bulmak istediğimizi var sayalım. Standart bir for döngüsü ile bu işlemi yapabileceğimiz gibi, çok yüksek boyutlu bir sayı olması halinde Parallel.For veya Parallel.ForEach metodlarını da söz konusu hesaplama için kullanabiliriz pekala...</description>
  <content>&lt;p&gt;&lt;a href="/pics/wolfenstein.jpg"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; float: right; padding-top: 0px; border: 0px;" title="wolfenstein" src="/pics/wolfenstein_thumb.jpg" alt="wolfenstein" width="320" height="243" align="right" border="0" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Neredeyse son bir ka&amp;ccedil; saattir yoğun bir şekilde &lt;strong&gt;Wolfenstein&lt;/strong&gt; isimli bilgisayar oyununu oynamaktaydım. Aslında &amp;ccedil;ok fazla bilgisayar oyunu oynayan birisi değilimdir. Hatta bu oyunun ilk versiyonunu &amp;ccedil;ok &amp;ccedil;ok uzun zaman &amp;ouml;nce oynadığımı ve arada &amp;ccedil;ok az oyunla haşır neşir olduğumu itiraf edebilirim &lt;img class="wlEmoticon wlEmoticon-confusedsmile" style="border-style: none;" src="/pics/wlEmoticon-confusedsmile_12.png" alt="Confused smile" /&gt;&lt;/p&gt;
&lt;p&gt;Lakin bazen oyun perisi gelip beni bir d&amp;uuml;rtmekte ve saatlerce bilgisayar başından kalkmadan oyun oynamamı istemekte. Bu gece kendisini kıramadım işte &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_21.png" alt="Smile" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Aslında gece boyunca Wolfenstein her ne kadar beni aşırı derece de s&amp;uuml;r&amp;uuml;klemiş olsa da aklımın bir k&amp;ouml;şesinde beni kemiren paralel programlama konulu d&amp;uuml;ş&amp;uuml;ncelerimin &amp;ouml;n&amp;uuml;ne de ge&amp;ccedil;emedim. Doğruyu s&amp;ouml;ylemek gerekirse şu anda &amp;ccedil;ok ge&amp;ccedil; bir saat de olsa konuyu a&amp;ccedil;ıklığa kavuşturmanın ve bununla ilişkili bir blog girdisi &amp;uuml;retmenin tam zamanıdır diye d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m ve işte karşınızdayım. Oyun perisinin ensesinde biten ilham perisinin isteğiydi bu sanırım. Lafı fazla uzatmadan konuya giriş yapalım dilerseniz.(&lt;em&gt;Bunu belirtmek istedim &amp;ccedil;&amp;uuml;nk&amp;uuml; bu kısa girişleri sevmeyen bir s&amp;uuml;r&amp;uuml; geliştirici de tanıyorum&lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_21.png" alt="Smile" /&gt;)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Olay paralel programlamada veriyi paralelize etmek ile alakalı. Aslında &amp;ccedil;ok basit ama g&amp;ouml;zden ka&amp;ccedil;tığı takdirde &amp;ouml;nemli hatalara neden olabilecek bir durum s&amp;ouml;z konusu. Bunu izah etmenin en iyi yolu belkide basit bir &amp;ouml;rnek &amp;uuml;zerinden ilerlemekle olacaktır. Şimdi ş&amp;ouml;yle d&amp;uuml;ş&amp;uuml;nelim; elimizde y&amp;uuml;sek boyutlu sayısal bir dizi veya koleksiyon olsun ve biz bu sayı k&amp;uuml;mesi &amp;uuml;zerinde &amp;ouml;rneğin 7 ile tam b&amp;ouml;l&amp;uuml;nebilenlerin sayısını bulmak istediğimizi var sayalım. Standart bir &lt;strong&gt;for&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile bu işlemi yapabileceğimiz gibi, &amp;ccedil;ok y&amp;uuml;ksek boyutlu bir sayı olması halinde &lt;strong&gt;Parallel.For&lt;/strong&gt; veya &lt;strong&gt;Parallel.ForEach&lt;/strong&gt; metodlarını da s&amp;ouml;z konusu hesaplama i&amp;ccedil;in kullanabiliriz pekala &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_72.png" alt="Winking smile" /&gt; Elimizde &amp;ccedil;ok &amp;ccedil;ekirdekli veya &amp;ccedil;ok işlemcili bir sistem var ise, paralel d&amp;ouml;ng&amp;uuml;leri kullanmak pek &amp;ccedil;ok a&amp;ccedil;ıdan avantajlı olabilir nitekim. Şimdi az &amp;ouml;nce bahsetmiş olduğumuz senaryoyu aşağıdaki &lt;strong&gt;Console&lt;/strong&gt; uygulamasına ait kod satırlarında sim&amp;uuml;le ettiğimizi var sayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Collections.Generic; 
using System.Threading.Tasks;

namespace ReductionSample 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            List&amp;lt;int&amp;gt; numbers = Helper.GetRandomNumberList(9000000);

            #region Klasik Yol

            int count=0; 
            for (int i = 0; i &amp;lt; numbers.Count; i++) 
            { 
                if (numbers[i] %7==0) 
                    count++;

            }

            Console.WriteLine("[Klasik For] 7 ile b&amp;ouml;l&amp;uuml;nebilen {0} sayı vardır",count.ToString());

            #endregion

           #region Parallel For

            int parallelCount=0;

            Parallel.For(0, numbers.Count, (i) =&amp;gt; 
            { 
                if (numbers[i] % 7 == 0) 
                    parallelCount++; 
           } 
            );

            Console.WriteLine("[Parallel.For] 7 ile b&amp;ouml;l&amp;uuml;nebilen {0} sayı vardır",parallelCount.ToString());

            #endregion

        } 
    }

    static class Helper 
    { 
        public static List&amp;lt;int&amp;gt; GetRandomNumberList(int NumberCount) 
        { 
            List&amp;lt;int&amp;gt; result = new List&amp;lt;int&amp;gt;();
            Random rnd = new Random(); 
            for (int i = 0; i &amp;lt; NumberCount; i++) 
            { 
                result.Add(rnd.Next(1, 100)); 
            }
            return result; 
        }
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;static &lt;/strong&gt;olarak tanımlanmış olan &lt;strong&gt;Helper&lt;/strong&gt; sınıfı belirli sayıda rastgele tam sayı &amp;uuml;retmek &amp;uuml;zere yazılmış &lt;strong&gt;GetRandomNumberList&lt;/strong&gt; isimli bir metod i&amp;ccedil;ermektedir. Uygulamaya ait &lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisinde ise &amp;ouml;nce standart bir &lt;strong&gt;for&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile ardından da bunun &lt;strong&gt;paralel&lt;/strong&gt; versiyonu ile birer iterasyon ger&amp;ccedil;ekleştirilmekte ve&lt;strong&gt; 7 ile b&amp;ouml;l&amp;uuml;nebilen sayıların toplam sayısı &lt;/strong&gt;hesap edilerek ekrana yazdırılmaktadır.&lt;/p&gt;
&lt;p&gt;Aslında sayı aralığı ne kadar y&amp;uuml;ksek olursa standart &lt;strong&gt;for&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml;n hesaplama i&amp;ccedil;in daha fazla zaman harcayacağı ve &lt;strong&gt;Parallel.For&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml;n aynı işi daha kısa s&amp;uuml;rede bitireceği aşikardır. Ne varki burada &amp;ouml;ng&amp;ouml;remediğimiz ve belki de tahmin etmediğimiz bir durum daha s&amp;ouml;z konusudur. Bunu anlamak i&amp;ccedil;in kodun &amp;ccedil;alışma zamanındaki bir ka&amp;ccedil; &amp;ccedil;ıktısına bakabiliriz &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_72.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Birinci &amp;ccedil;alıştırmanın sonu&amp;ccedil;ları;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/artcl_1_1.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="artcl_1_1" src="/pics/artcl_1_1_thumb.gif" alt="artcl_1_1" width="434" height="126" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;O oooo!!! &lt;img class="wlEmoticon wlEmoticon-surprisedsmile" style="border-style: none;" src="/pics/wlEmoticon-surprisedsmile_1.png" alt="Surprised smile" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;İkinci &amp;ccedil;alıştırmanın sonu&amp;ccedil;ları;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/artcl_1_2.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="artcl_1_2" src="/pics/artcl_1_2_thumb.gif" alt="artcl_1_2" width="431" height="126" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;O ooooo too!!! &lt;img class="wlEmoticon wlEmoticon-surprisedsmile" style="border-style: none;" src="/pics/wlEmoticon-surprisedsmile_1.png" alt="Surprised smile" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; &amp;ccedil;alıştırmanın sonu&amp;ccedil;ları;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/artcl_1_3.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="artcl_1_3" src="/pics/artcl_1_3_thumb.gif" alt="artcl_1_3" width="432" height="126" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Şaka mı bu ? &lt;img class="wlEmoticon wlEmoticon-surprisedsmile" style="border-style: none;" src="/pics/wlEmoticon-surprisedsmile_1.png" alt="Surprised smile" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edilecek olursa &lt;strong&gt;Parallel.For&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; 7 ile b&amp;ouml;l&amp;uuml;nebilen sayıların miktarını her defasında standart for d&amp;ouml;ng&amp;uuml;s&amp;uuml;ne g&amp;ouml;re farklı hesaplamış ve aslında hi&amp;ccedil; birisinde de doğru sonucu tutturamamıştır. Bu aslına bakılacak olursa son derece doğal bir sonu&amp;ccedil;tur. Nitekim &lt;strong&gt;Parallel.For&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; &amp;ccedil;alışmaya başladıktan sonra birden fazla &lt;strong&gt;Task&lt;/strong&gt; oluşturmakta ve bunları bir veya daha fazla &lt;strong&gt;Thread&amp;rsquo;&lt;/strong&gt; in y&amp;ouml;netimine sunmaktadır. G&amp;ouml;zden ka&amp;ccedil;an nokta, bu &lt;strong&gt;Task&amp;rsquo;&lt;/strong&gt; ların her birinin aslında aynı değişken &amp;uuml;zerinde hesaplama yapmaya &amp;ccedil;alışıyor olmalarıdır. Yani, &amp;ouml;rneğimizde a&amp;ccedil;ılan &lt;strong&gt;Task&lt;/strong&gt; bloklarının her biri aslında aynı &lt;strong&gt;parallelCount&lt;/strong&gt; değişkeni &amp;uuml;zerinde bir artım ger&amp;ccedil;ekleştirmeye &amp;ccedil;alışmaktadır. Bu da &amp;ccedil;ok doğal olarak doğru sonucun &lt;span style="text-decoration: underline;"&gt;hesaplanamamasına&lt;/span&gt; neden olmaktadır. Peki ya&amp;nbsp; &amp;ouml;yleyse &amp;ccedil;&amp;ouml;z&amp;uuml;m nedir?&lt;/p&gt;
&lt;p&gt;Standart bir &lt;strong&gt;for&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml;n kullanılması tercih edilebilir &lt;img class="wlEmoticon wlEmoticon-openmouthedsmile" style="border-style: none;" src="/pics/wlEmoticon-openmouthedsmile_19.png" alt="Open-mouthed smile" /&gt; Lakin bu durumda &lt;strong&gt;Parallel&lt;/strong&gt; olmanın avantajları kaybedilecektir. Buradaki gibi bir sayı aralığında bu &amp;ccedil;ok &amp;ouml;nemli g&amp;ouml;z&amp;uuml;kmese de, bilimsel veya finansal hesaplama yapan bir uygulamada bu ayrım, performans a&amp;ccedil;ısında &amp;ccedil;ok kritik bir fark doğurabilir. Bu nedenle &lt;strong&gt;Parallel&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;ler ile devam edecek isek &lt;strong&gt;Reduction&lt;/strong&gt; olarak tanımlanan ve aslında ilerleyen zamanlarda işleyeceğimiz &lt;strong&gt;MapReduce&lt;/strong&gt; deseninin temelini oluşturan bir konuyu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alarak ilerlememiz gerekmektedir. Aslında teorik olarak &amp;ccedil;ok fazla sıkmak istemiyorum sizi, ancak &amp;ouml;zet olarak işleyişi ifade etmek isterim. &lt;strong&gt;Parallel.For&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml; &amp;ouml;yle bir &amp;ccedil;alıştırmalıyız ki, a&amp;ccedil;ılacak olan &lt;strong&gt;Thread&amp;rsquo;&lt;/strong&gt; ler ve bunların i&amp;ccedil;erisinde yer alacak olan &lt;strong&gt;Task&amp;rsquo;&lt;/strong&gt; lar, &lt;strong&gt;parallelCount&lt;/strong&gt; sayısının aslında aralarında paylaştıkları bir veri olduğunu bilmelidirdler&lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_72.png" alt="Winking smile" /&gt; &amp;Uuml;stelik her bir Thread kendi i&amp;ccedil;erisinde bir toplam sayı hesabı yapmalı ve işleyişini bitirdiğinde de herkes i&amp;ccedil;in ortak olan bir değişkene bunu eklemelidir. Bu ekleme işinin ise senkronize edilerek yapılması şarttır.&lt;/p&gt;
&lt;p&gt;Neyseki &lt;strong&gt;Parallel.For&lt;/strong&gt; ve &lt;strong&gt;Parallel.ForEach&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;leri bu ortak paylaşımlı veri değişkenlerine izin veren &lt;strong&gt;aşırı y&amp;uuml;klenmiş(Overload)&lt;/strong&gt; versiyonlara sahiptirler. &amp;Ccedil;&amp;ouml;z&amp;uuml;m olarak kodumuzu aşağıdaki gibi değiştirmemiz yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;#region Reduction

int reductionCount = 0;

Parallel.For(0, numbers.Count, 
    () =&amp;gt; 0, 
    (i, state, currentTotal) =&amp;gt; 
    { 
        if (numbers[i] % 7 == 0) 
            currentTotal++;

        return currentTotal; 
    }, 
    (currentTotal) =&amp;gt; 
    { 
        Console.WriteLine("{0} Current Total {1}",Thread.CurrentThread.ManagedThreadId,currentTotal.ToString()); 
        Interlocked.Add(ref reductionCount, currentTotal); 
    } 
    );

Console.WriteLine("[Reduction] 7 ile b&amp;ouml;l&amp;uuml;nebilen {0} sayı vardır",reductionCount.ToString());

#endregion&lt;/pre&gt;
&lt;p&gt;Aslında &lt;strong&gt;Parallel.For&lt;/strong&gt; i&amp;ccedil;in biraz karmaşık bir yazım s&amp;ouml;z konusu. İlk iki parametre tanıdık. &amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; parametrede herhangibir işlem yapmadan ge&amp;ccedil;iyoruz. &amp;Ouml;nemli olan ise metodun aldığı son iki parametre. Bunlardan ilki &lt;strong&gt;Func&amp;lt;int,ParallelLoopState,TLocal,TLocal&amp;gt;&lt;/strong&gt; tipinden. Diğeri ise &lt;strong&gt;Action&amp;lt;TLocal&amp;gt;&lt;/strong&gt; t&amp;uuml;r&amp;uuml;ndendir. Teorik olarak yapılmak istenen her bir &lt;strong&gt;Thread&lt;/strong&gt;&amp;rsquo; in kendi i&amp;ccedil;erisinde değerlendireceği &lt;strong&gt;&amp;ouml;zel bir yerel değişken oluşturmak(Private Thread-Local Variable)&lt;/strong&gt; ve t&amp;uuml;m paralel &amp;ccedil;alışma tamamlandığında bu &amp;ouml;zel yerel değişkenlerin bir toplamını hesaplayarak sonuca ulaşmaktır. Bir başka deyişle a&amp;ccedil;ılan &lt;strong&gt;Thread&lt;/strong&gt;&amp;rsquo; ler kendi &amp;ouml;zel toplam değişkenlerini arttıracaklardır. Bu işlemi,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;(i, state, currentTotal) =&amp;gt; 
{ 
     if (numbers[i] % 7 == 0) 
          currentTotal++;

     return currentTotal; 
}&lt;/pre&gt;
&lt;p&gt;kısmı ger&amp;ccedil;ekleştirmektedir.&lt;/p&gt;
&lt;p&gt;Paralel &amp;ccedil;alışmaya dahil olan &lt;strong&gt;Thread&amp;rsquo;&lt;/strong&gt; ler işlemlerini bitirdikten sonra da,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;(currentTotal) =&amp;gt; 
{ 
        Console.WriteLine("{0} Current Total {1}",Thread.CurrentThread.ManagedThreadId,currentTotal.ToString()); 
        Interlocked.Add(ref reductionCount, currentTotal); 
}&lt;/pre&gt;
&lt;p&gt;kodu devreye girmekte ve &lt;strong&gt;Thread&amp;rsquo;&lt;/strong&gt; ler i&amp;ccedil;in hesaplanan &lt;strong&gt;currentTotal&lt;/strong&gt; değerlerini &lt;strong&gt;ref&lt;/strong&gt; ile &lt;strong&gt;reductionCount&lt;/strong&gt; değerine eklemektedir. B&amp;ouml;ylece t&amp;uuml;m &lt;strong&gt;Thread&amp;rsquo;&lt;/strong&gt; lerin kendi yerel alanlarındaki veriler &amp;uuml;zerinde yaptığı 7 ile b&amp;ouml;l&amp;uuml;nebilen sayıların miktarı, birleştirilmektedir. &lt;strong&gt;Interlocked&lt;/strong&gt; burada devreye giren &amp;ouml;nemli bir fonksiyonellik sunmakta ve senkronize bir şekilde currentTotal değerlerinin reductionTotal değişkenine eklenmesine olanak sağlamaktadır. İşte bir koleksiyon i&amp;ccedil;eriğinin bu şekilde tekil bir değere indirgenmesine &lt;strong&gt;Reduction&lt;/strong&gt; adı verilmektedir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizi az &amp;ouml;nceki testte olduğu gibi yine arka arkaya 3 defa &amp;ccedil;alıştırırsak aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alanlara benzer sonu&amp;ccedil;ları elde ettiğimizi g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;İlk &amp;ccedil;alışma sonucu;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/artcl_1_4.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="artcl_1_4" src="/pics/artcl_1_4_thumb.gif" alt="artcl_1_4" width="439" height="184" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ikinci &amp;ccedil;alışma sonucu;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/artcl_1_5.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="artcl_1_5" src="/pics/artcl_1_5_thumb.gif" alt="artcl_1_5" width="431" height="212" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; &amp;ccedil;alışma sonucu&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/artcl_1_6.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="artcl_1_6" src="/pics/artcl_1_6_thumb.gif" alt="artcl_1_6" width="434" height="220" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_72.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;Reduction&lt;/strong&gt; tekniğine g&amp;ouml;re yapılan hesaplama sonu&amp;ccedil;ları ile klasik &lt;strong&gt;for&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile yapılan hesaplama sonu&amp;ccedil;ları bire bir &amp;ouml;rt&amp;uuml;şmektedir. Elbetteki her &amp;ccedil;alışma sonrasında &lt;strong&gt;Parallel.For&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml;n başlatacağı &lt;strong&gt;Thread&amp;rsquo;&lt;/strong&gt; ler farklı olacaktır. Bu y&amp;uuml;zden son &lt;strong&gt;Action&lt;/strong&gt; temsilcisinin icrası sonucu &amp;uuml;retilen &lt;strong&gt;currentTotal&lt;/strong&gt; değerleri farklılıklar g&amp;ouml;sterecektir. Bu y&amp;uuml;zden Current Total değerleri hep farklı sonu&amp;ccedil;lar vermiştir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zetle &lt;strong&gt;Reduction&lt;/strong&gt; tekniğini kullandığımızda, paralel olarak işletilen &lt;strong&gt;Thread&amp;rsquo;&lt;/strong&gt; lerin kendi yerel değişkenleri ile &amp;ccedil;alışmaları sağlanabilmekte ve bunlar sonu&amp;ccedil; olarak tek bir değişkene indirgenerek bu tip senaryolarda g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilmektedir. Yazımızın başında belirttiğimiz &amp;uuml;zere &lt;strong&gt;Reduction&lt;/strong&gt; tekniği aslında &lt;strong&gt;MapReduce&lt;/strong&gt; deseninin temelini oluşturan &amp;ouml;nemli bir kavramdır. Bu deseni ilerleyen yazılarımızda sizlere &amp;ouml;rnek bir senaryo &amp;uuml;zerinden aktarmaya &amp;ccedil;alışıyor olacağım. Eğer bu ve bunun gibi diğer paralel programlama desenlerini merak ediyorsanız &lt;strong&gt;Microsoft&amp;rsquo;&lt;/strong&gt; un &amp;uuml;cretsiz olarak indirebileceğiniz &lt;a href="http://www.microsoft.com/download/en/details.aspx?id=19222"&gt;Patterns for Parallel Programming : Understanding and Applying Parallel Patterns with .Net Framework 4.0&lt;/a&gt; d&amp;ouml;k&amp;uuml;manını okuyabilirsiniz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2011%2f10%2fReductionSample.rar"&gt;ReductionSample.rar (24,88 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2011-12-02 11:51:00</pubDate>
  <slug>Parallel-Programming-Reduction</slug>
  <tags>
    <tag>tpl</tag>
    <tag>parallel-programming</tag>
    <tag>reduction</tag>
    <tag>mapreduce-pattern</tag>
    <tag>map-reduce</tag>
    <tag>parallelfor</tag>
    <tag>parallelforeach</tag>
  </tags>
  <categories>
    <category>Parallel Programming</category>
  </categories>
</post>