<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tek Fotoluk İpucu 137 - Temporary File ile Çalışmak</title>
  <description>Geliştirdiğimiz uygulamanın sadece çalışma zamanında oluşturup kullanacağı ve herhangi bir anda ortadan kaldıracağı geçici bilgilere ihtiyacı olduğunu düşünelim. İlk akla gelen bu tip bilgileri bir yerlerde işi bitene kadar saklamak olacaktır. Bunun için veritabanında geçici bir tabloyu veya işletim sisteminin Registry gibi alanlarını kullanabiliriz. Aslında nesne yönelimli dünyada söz konusu içerikleri birer sınıf örneği olarak tutmakta mümkün.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Geliştirdiğimiz uygulamanın sadece &amp;ccedil;alışma zamanında oluşturup&amp;nbsp;kullanacağı&amp;nbsp;ve herhangi bir anda ortadan kaldıracağı ge&amp;ccedil;ici bilgilere ihtiyacı olduğunu d&amp;uuml;ş&amp;uuml;nelim. İlk akla gelen bu tip bilgileri bir yerlerde işi bitene kadar saklamak olacaktır. Bunun i&amp;ccedil;in veritabanında ge&amp;ccedil;ici bir tabloyu veya işletim sisteminin Registry gibi alanlarını kullanabiliriz. Aslında nesne y&amp;ouml;nelimli d&amp;uuml;nyada s&amp;ouml;z konusu i&amp;ccedil;erikleri birer sınıf &amp;ouml;rneği olarak tutmakta m&amp;uuml;mk&amp;uuml;n.&lt;/p&gt;
&lt;p&gt;Ancak bazı hallerde s&amp;ouml;z konusu bilgileri ge&amp;ccedil;ici bir dosyada&lt;em&gt;(Temp File)&lt;/em&gt; tutmakta gerekebilir. Bu dosya benzersiz olmalıdır ve sadece i&amp;ccedil;inde oluştuğu uygulama Process'inde veya oluşturulduğu Thread'de kullanılmalıdır. Yani dışarıdan başka Thread'lerin bu dosyaya erişimi olmamalıdır. Hatta uygulamanın dosya ile&amp;nbsp;işi bitince otomatik olarak sistemden kaldırılmalıdır. İşte Ruby dilinde bu ihtiya&amp;ccedil; i&amp;ccedil;in kullanılabilen hazır bir gem var. İşte basit bir &amp;ouml;rnek.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/10/tfi137.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;ici bir dosya oluşturmak i&amp;ccedil;in Tempfile sınıfına ait bir nesne &amp;ouml;rneği oluşturmamız yeterli. Parametre olarak gelen dosya adının sonuna otomatik olarak sistem zamanı ve benzersiz bir ID değeri eklenir. Bu şekilde ge&amp;ccedil;ici dosyanın benzersiz olması da sağlanmaktadır. Nitekim aynı uygulamanın birden fazla &amp;ouml;rneğin sistemde n sayıda ge&amp;ccedil;ici dosyanın eş zamanlı olarak oluşmasına neden olacaktır.&lt;/p&gt;
&lt;p&gt;Dosya i&amp;ccedil;erisine bilgi atmak ise olduk&amp;ccedil;a kolay. write metodunu veya &amp;lt;&amp;lt; operat&amp;ouml;r&amp;uuml;n&amp;uuml; bu iş i&amp;ccedil;in kullanabiliriz. Dosyanın başına gitmek i&amp;ccedil;in aynen kaset&amp;ccedil;alarlarda olduğu gibi rewind operasyonunu kullanıyoruz. &amp;Ccedil;alışma zamanında oluşan&amp;nbsp;i&amp;ccedil;eriği&amp;nbsp;read metodu ile okuyabilir ve oluşturulduğu yeri g&amp;ouml;rmek i&amp;ccedil;in path niteliğine başvurabiliriz. close metoduna yapılan &amp;ccedil;ağrı&amp;nbsp;sonrası ilgili dosya oluşturulduğu yerden otomatik olarak kaldırılacaktır. Gayet basit. Benzersiz, sadece o Thread i&amp;ccedil;inde kullanılabilien ge&amp;ccedil;ici bir bilgi havuzu.&lt;/p&gt;
&lt;p&gt;Bir başka ipucunda g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-10-20 21:30:00</pubDate>
  <slug>tek-fotoluk-ipucu-137-temporary-file-ile-calismak</slug>
  <tags>
    <tag>ruby</tag>
    <tag>io</tag>
    <tag>temp-file</tag>
    <tag>tek-fotoluk-ipucu</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>