<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Firebase Cloud Messaging ile Abonelere Bildirim Yollamak</title>
  <description>Tarayıcı üzerinde yaşayan ve çevrim dışı ya da çok düşük internet hızlarında da çalışabilme özelliğine sahip olan PWA(Progressive Web Applications) uygulamalarının en önemli kabiliyetlerinden birisi de Push Notification'dır. Bu, mobil platformlardan yapılan erişimler düşünüldüğünde oldukça önemli bir nimettir. Arka planda içerik güncelleme (updating) özelliği de bir diğer önemli kabiliyettir. Bu yetenekler uygulama için tekrardan submit operasyonuna gerek kalmadan güncel kalabilmek anlamına da gelir.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2019/07/31/friendship.png" alt="" /&gt;Servis kapısı a&amp;ccedil;ıldığında g&amp;ouml;zlerini herkesten ka&amp;ccedil;ırıp&amp;nbsp;araca binerken&amp;nbsp;heyecanlı ses tonuyla "G&amp;uuml;naydın" diyerek en arka koltuğa ge&amp;ccedil;en kadının ruh hali her y&amp;ouml;n&amp;uuml;yle tanıdık geliyordu. Bir bu&amp;ccedil;uk yıl kadar &amp;ouml;nce yine bu servise bindiğim ilk g&amp;uuml;n bende benzer kaygıları hissetmiştim. Oysa hayatımda ilk kez servis binmiyordum.&lt;/p&gt;
&lt;p&gt;Ama işte o ilk biniş sırasında s&amp;ouml;ylenen "G&amp;uuml;naydın" kelimesi ardından ben ve şof&amp;ouml;r&amp;uuml;m&amp;uuml;z İhsan Bey&amp;nbsp;dışında kimsenin karşılık vermediği ve onun g&amp;ouml;zlerini aradığım sırada ge&amp;ccedil;en kısa&amp;nbsp;zaman diliminde aklından ge&amp;ccedil;enleri tahmin ettiğim anlar, en arka koltuğa oturduğunu g&amp;ouml;rd&amp;uuml;kten sonra toplum psikolojisine ayak uydurup&amp;nbsp;&amp;ouml;n&amp;uuml;me doğru&amp;nbsp;bakmamla son bulmuştu.&lt;/p&gt;
&lt;p&gt;Servis şirkete vardıktan sonra her birimiz fabrikanın farklı noktalarına doğru y&amp;uuml;r&amp;uuml;meye başladık. Bizim binamız yolun karşı tarafında kalıyordu ve can g&amp;uuml;venliği nedeniyle&amp;nbsp;bir &amp;uuml;st ge&amp;ccedil;itten ge&amp;ccedil;ilerek ulaşılabiliyordu. Merdivenleri &amp;ccedil;ıkarken onun ne durumda olduğunu bile unutmuşum. Tesad&amp;uuml;fen arkamı d&amp;ouml;n&amp;uuml;p baktığımda tek başına ve biraz da şaşkın bir şekilde ne y&amp;ouml;ne gideceğini anlamaya &amp;ccedil;alıştığını fark ettim. Yanlış y&amp;ouml;ne gittiği apa&amp;ccedil;ık ortadaydı. &amp;Ccedil;elimsizliğinden, gencecik y&amp;uuml;z&amp;uuml;nden ve taşıdığı not defterinden &amp;uuml;niversite talebesi olan bir stajyer olduğu biraz da olsa anlaşılıyordu. Ge&amp;ccedil;en yılın aynı vakitlerinde de benzer manzaralar fabrikanın &amp;ccedil;eşitli sabahlarında yaşanmıştı.&lt;/p&gt;
&lt;p&gt;Merdivenleri&amp;nbsp;tekrar indim ve arkasından ona yetişerek "Merhaba...Yeni başladınız sanırım. Nereye gidecektiniz?" dedim. Aynı g&amp;uuml;n&amp;uuml;n akşamında koltuğuma oturmuş hareket saatini beklerken kapıda yine o tedirgin duruşuyla beliriverdi. İlk adımını attığında y&amp;uuml;z&amp;uuml;ndeki gerginlik az da olsa okunabiliyordu. Aklından ge&amp;ccedil;en "iyi akşamlar diyeceğim ve sanırım kimse sallamayacak" d&amp;uuml;ş&amp;uuml;ncesi bir bulut olup kafasının &amp;uuml;zerinden belirmişti. Ama o sabah ki yardımın etkisinde olsa gerek&amp;nbsp;bu kez y&amp;uuml;z&amp;uuml;m&amp;uuml; aradı ve g&amp;ouml;r&amp;uuml;nce hafif bir tebess&amp;uuml;mle "iyi akşamlar" dedi. "İyi akşamlar. Eee ilk g&amp;uuml;n&amp;uuml;n nasıl ge&amp;ccedil;ti bakalım..." diye karşılık verince bir yanımdaki koltuğa oturdu. Artık daha iyi hissediyordu.&lt;/p&gt;
&lt;p&gt;Biraz sonraki derlemeye nasıl giriş yapacağımı bilemediğim g&amp;uuml;nlerden birindeyiz anlayacağınız &amp;uuml;zere. O y&amp;uuml;zden yakın zamanda başıma gelen bir olayı sizinle paylaşarak başlamak istedim. Kıssadan hisse herkesin kendisine pay&amp;nbsp;&amp;ccedil;ıkaracağını d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Hepimiz stayjer olduk. Onların daha &amp;ccedil;ok farkına varmamız gerektiği konusunda ufak bir hatırlatmam olsun burada.&lt;/p&gt;
&lt;p&gt;...&lt;/p&gt;
&lt;p&gt;Cumartesi gecesi &amp;ccedil;alışmalarının &lt;a href="https://github.com/buraksenyurt/saturday-night-works/tree/master/No%2031%20-%20Push%20Notifications%20on%20PWA" target="_blank"&gt;31nci &amp;ouml;rneğinde&lt;/a&gt; Firebase Cloud Messaging sistemini kullanarak uygulamalara&lt;em&gt;(&amp;ouml;rnek &amp;ouml;zelinde bir PWA programına)&lt;/em&gt; nasıl bildirimde bulunulabileceğini anlamaya &amp;ccedil;alışmışım. Her zaman olduğu gibi &amp;ouml;rneği WestWorld&lt;em&gt;(Ubuntu 18.04, 64bit)&lt;/em&gt; &amp;uuml;zerinde geliştirmişim. Şimdi notların &amp;uuml;st&amp;uuml;nden ge&amp;ccedil;me, unutulanları hatırlama ve eksikleri giderme zamanı. &amp;Ouml;yleyse gelin notlarımızı derlemeye başlayalım.&lt;/p&gt;
&lt;p&gt;Tarayıcı &amp;uuml;zerinde yaşayan ve &amp;ccedil;evrim dışı ya da &amp;ccedil;ok d&amp;uuml;ş&amp;uuml;k internet hızlarında da &amp;ccedil;alışabilme &amp;ouml;zelliğine sahip olan PWA&lt;em&gt;(Progressive Web Applications)&lt;/em&gt; uygulamalarının en &amp;ouml;nemli kabiliyetlerinden birisi de Push Notification'dır. Bu, mobil platformlardan yapılan erişimler d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde olduk&amp;ccedil;a &amp;ouml;nemli bir nimettir. Uygulamaya otomatik bildirim d&amp;uuml;şmesi veya arka plan veri g&amp;uuml;ncellemeleri kullanıcı deneyimi a&amp;ccedil;ısından bakıldığında değerli bir işlevselliktir. Bu yetenekler uygulama i&amp;ccedil;in tekrardan submit operasyonuna gerek kalmadan g&amp;uuml;ncel&amp;nbsp;kalabilmeleri anlamına gelir.&lt;/p&gt;
&lt;p&gt;Geliştireceğimiz &amp;ouml;rnek bir basketbol ma&amp;ccedil;ı i&amp;ccedil;in g&amp;uuml;ncel haber bilgisinin abone olan uygulamalara g&amp;ouml;nderilmesi &amp;uuml;zerine kurgulanmakta. Burada mesajlaşma servisi olarak Firebase Cloud Messaging altyapısını kullanacağımız i&amp;ccedil;in ilgi &amp;ccedil;ekici bir &amp;ouml;rnek olduğunu ifade edebilirim. Şimdi hazırlıklarımıza başlayabiliriz.&lt;/p&gt;
&lt;div&gt;
&lt;div&gt;
&lt;div&gt;
&lt;h2&gt;&amp;Ouml;n Hazırlıklar&lt;/h2&gt;
&lt;div&gt;İki uygulama geliştireceğiz. Birisi &amp;ccedil;ok sade HTML i&amp;ccedil;eriğine sahip olan PWA uygulaması. İkinci uygulama ise bir servis.&amp;nbsp;Kullanıcıların bildirim servisine abone olma ve &amp;ccedil;ıkma&amp;nbsp;işlemlerinin y&amp;ouml;netimi ile bağlı olanlara bildirim yapma g&amp;ouml;revini&lt;em&gt;(işte bu noktada Firebase Cloud Messaging sisteminden yararlanacak)&lt;/em&gt; &amp;uuml;stlenecek. İlk olarak basketbol haberlerini takip edeceğimiz basit &amp;ouml;ny&amp;uuml;z uygulamasını geliştirmeye başlayım. Klas&amp;ouml;r&amp;nbsp;yapısını aşağıdaki terminal komutları ile oluşturabiliriz.&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;mkdir basketkolik
cd basketkolik
touch index.html
touch sworker.js
touch main.js
touch efes_barca.html&lt;/pre&gt;
&lt;div&gt;
&lt;div&gt;Ayrıca uygulama testlerini HTTP &amp;uuml;zerinden kolayca yapabilmek i&amp;ccedil;in serve isimli bir npm paketinden yararlanacağız. Kurulumu i&amp;ccedil;in aşağıdaki terminal komutunu kullanmak yeterli.&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo npm install -g serve&lt;/pre&gt;
&lt;/div&gt;
&lt;/div&gt;
&lt;/div&gt;
&lt;/div&gt;
Kodları yazmaya başlamadan &amp;ouml;nce Google tarafıyla haberleşme noktasında gerekli olan bir manifesto dosyasının oluşturulması gerekiyor.&lt;/div&gt;
&lt;div&gt;
&lt;div&gt;
&lt;h2&gt;Manifesto Dosyası&lt;/h2&gt;
&lt;div&gt;
&lt;div&gt;
&lt;div&gt;Manifesto dosyası PWA'nın Firebase tarafında etkinleştirilecek Push Notification &amp;ouml;zelliği i&amp;ccedil;in gereklidir. İ&amp;ccedil;erisinde Sender ID değerini barındırır&lt;em&gt;(ilerde karşınıza &amp;ccedil;ıkacak)&lt;/em&gt;&amp;nbsp;ve &amp;ouml;ny&amp;uuml;z&amp;uuml;n kullandığı main mod&amp;uuml;l&amp;uuml;, abonelik başlatılırken&amp;nbsp;bu değeri karşı tarafa iletmekle y&amp;uuml;k&amp;uuml;ml&amp;uuml;d&amp;uuml;r. Peki bu dosyayı nasıl &amp;uuml;reteceğiz?&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;&amp;Ouml;ncelikle &lt;a href="https://app-manifest.firebaseapp.com/" target="_blank"&gt;Firebase&lt;/a&gt;&amp;nbsp;kontrol paneline gidilir ve PWA i&amp;ccedil;in metadata bilgilerini tutacak bir Web App Manifest dosyası &amp;uuml;retilir. Ben &amp;ouml;rnekte aşağıdaki bilgileri kullandım.&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;&lt;img src="/image.axd?picture=/2019/07/31/credit_1.png" alt="" /&gt;&lt;/div&gt;
&lt;/div&gt;
&lt;/div&gt;
&lt;/div&gt;
&lt;/div&gt;
&lt;div&gt;
&lt;div&gt;Sonrasında Zip dosyasını&amp;nbsp;bilgisayara indirip&amp;nbsp;proje klas&amp;ouml;r&amp;uuml;ne a&amp;ccedil;mamız gerekiyor. Manifest.json dosyası ile birlikte images isimli bir klas&amp;ouml;r de gelecektir. Images klas&amp;ouml;r&amp;uuml;nde kendi eklediğimiz active.png dosyasının farklı cihazlar i&amp;ccedil;in standartlaştırılmış boyutları yer alır. Bu bilgiler manifest.json dosyasına da konur.&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;İşimiz hen&amp;uuml;z bitmedi! Uygulama i&amp;ccedil;in Push Notification &amp;ouml;zelliğini de etkinleştirmek gerekiyor. Bunun i&amp;ccedil;in &lt;a href="https://console.firebase.google.com/" target="_blank"&gt;Firebase Console&lt;/a&gt; arabirimine gidip yeni bir proje oluşturmalı ve ardından proje ayarlarına&lt;em&gt;(Project Overview -&amp;gt; Project Settings)&lt;/em&gt;&amp;nbsp;ulaşıp Cloud Messaging sekmesine gelinmeli&amp;nbsp;&lt;em&gt;(Ben "basketin-cepte-project'" isimli bir proje oluşturdum :P Hayaller başka tabii ama eldeki malzeme şimdilik bu)&amp;nbsp;&lt;/em&gt;&lt;/div&gt;
&lt;div&gt;&lt;br /&gt;
&lt;div&gt;Bu b&amp;ouml;l&amp;uuml;mde proje i&amp;ccedil;in oluşturulan Server Key ve Sender ID değerleri yer alır. Az &amp;ouml;nce bahsedildiği gibi Sender ID değerinin manifest.json dosyasına eklenmesi gerekiyor&amp;nbsp;&lt;em&gt;(gcm_sender_id yazan kısma bakınız)&lt;/em&gt;&lt;/div&gt;
&lt;/div&gt;
&lt;h2&gt;PWA Kodları&lt;/h2&gt;
&lt;div&gt;Artık&amp;nbsp;basketkolik klas&amp;ouml;r&amp;uuml;ndeki dosyalarımızı kodlamaya başlayabiliriz.&amp;nbsp;index.html sayfası aslında haber kaynağına aboneliği başlatıp durdurabileceğimiz bir test sahası gibi. Tek dikkat edilmesi gereken nokta manifest dosyası ile bağ kurulmuş olması. Tasarım son derece aptalca yapıldı ama esas amacımız elbette şukela bir g&amp;ouml;rsellik sunmanın dışında push notification kabiliyletlerini deneyimlemek. Index sayfası ile işe başlayalım.&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;!DOCTYPE html&amp;gt;
&amp;lt;html&amp;gt;

&amp;lt;head&amp;gt;
    &amp;lt;title&amp;gt;Basketin Cepte&amp;lt;/title&amp;gt;
    &amp;lt;link rel="manifest" href="manifest.json"&amp;gt;
    &amp;lt;!--Bunu eklemeyi unutmamak lazım--&amp;gt;
&amp;lt;/head&amp;gt;

&amp;lt;body&amp;gt;
    &amp;lt;h3&amp;gt;Euroleague Haberleri&amp;lt;/h3&amp;gt;
    &amp;lt;p&amp;gt;&amp;lt;i&amp;gt;D&amp;uuml;ğmeye bas ve ne olacağına bakalım&amp;lt;/i&amp;gt;&amp;lt;/p&amp;gt;
    &amp;lt;div id="divPush"&amp;gt;
        &amp;lt;img id="buttonPush" width="50px" src="active.png" /&amp;gt;
    &amp;lt;/div&amp;gt;
    &amp;lt;script src="main.js"&amp;gt;&amp;lt;/script&amp;gt;
&amp;lt;/body&amp;gt;

&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;/div&gt;
&lt;div&gt;efes_barca.html isim dosya da şimdilik bildirim alındığında g&amp;ouml;sterilecek i&amp;ccedil;eriği barındırıyor. Bunun dinamik olduğunu bir d&amp;uuml;ş&amp;uuml;nsenize. Abone olduktan sonra yeni bir haber geldiğinde efes_barcha benzeri dinamik HTML i&amp;ccedil;erikleri kullanılacak.&amp;nbsp;T&amp;uuml;m uygulamayı tamamladıktan sonra bu tip bir &amp;ouml;zellikle &amp;ouml;rneğinizi daha da zenginleştirebilirsiniz.&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;!DOCTYPE html&amp;gt;
&amp;lt;html&amp;gt;

&amp;lt;head&amp;gt;
    &amp;lt;title&amp;gt;Euroleague'de Efes Farkı&amp;lt;/title&amp;gt;
&amp;lt;/head&amp;gt;

&amp;lt;body&amp;gt;
    &amp;lt;p&amp;gt;Anadolu Efes, kritik ma&amp;ccedil;ta Barcelona'yı kendi evinde farklı yenerek...
    &amp;lt;/p&amp;gt;
&amp;lt;/body&amp;gt;

&amp;lt;/html&amp;gt;&lt;/pre&gt;
Sworker mod&amp;uuml;l&amp;uuml; aslında Service Worker g&amp;ouml;revini &amp;uuml;stlenmekte. Kodlar arasına katmaya &amp;ccedil;alıştığım yorumlarla m&amp;uuml;mk&amp;uuml;n mertebe neler olduğunu anlamaya ve anlatmaya &amp;ccedil;alıştım.&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;/*
main.js i&amp;ccedil;erisinde Service Worker olarak bildirimi yapılan dosyamız.
İki olay metodu i&amp;ccedil;erir.
Uygulama herhangibir bildirim aldığında push metodu tetiklenir. 
Bildirim almasını sağlamak i&amp;ccedil;in yazdığımız PusherAPI servisine talep g&amp;ouml;ndermemiz yeterlidir. http://localhost:8080/news/push gibi.
Bu metod i&amp;ccedil;erisinde showNotification ile bir bildirim penceresi g&amp;ouml;sterilir.
Pencereye tıklandığındaysa notificationclick isimli olay tetiklenir.
Bu olayın ele alındığı fonksiyonda ise temsilen bir web sayfası i&amp;ccedil;eriği a&amp;ccedil;tırılır.
*/

self.addEventListener('push', function (event) {
    console.log('push olayı tetiklendi');
    var title = 'Euroleague Haberleri';
    var body = {
        'body': 'G&amp;uuml;ncel skor bilgileri i&amp;ccedil;in tıklayın',
        'tag': 'pwa',
        'icon': './images/48x48.png'
    };
    event.waitUntil(
        self.registration.showNotification(title, body)
    );
});

self.addEventListener('notificationclick', function (event) {
    //TODO: Burada statik bir sayfa i&amp;ccedil;eriği g&amp;ouml;sterilmesi yerine haber bilgisini servisten alacak kodu ekleyebilirsiniz
    console.log('Şimdi bildirime ait sayfa a&amp;ccedil;ılacak');
    var url = './efes_barca.html';
    event.notification.close();
    event.waitUntil(clients.openWindow(url));
});&lt;/pre&gt;
Bu taraf i&amp;ccedil;in son olarak main i&amp;ccedil;eriğini de aşağıdaki gibi geliştirebiliriz.&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;// load aşamasında Service Worker i&amp;ccedil;in register işlemi yapılır
window.addEventListener('load', e =&amp;gt; {
    if (!('serviceWorker' in navigator)) {
        console.log('Service worker desteklenmiyor');
        return;
    }
    navigator.serviceWorker.register('sworker.js')
        .then(function () {
            console.log('Servis Worker kaydoldu');
        })
        .catch(function (err) {
            console.log('Hımm...Sanırım bir hata oluştu : ', err);
        });
});

// Push Notification durumunu g&amp;uuml;nceller
// Aktifse active.png, değilse passive.png
function updateStatus(status) {
    divPush.dataset.checked = status; // statu bilgisini set et
    if (status) { //true ise aktif
        buttonPush.src = "./assets/active.png";
    }
    else { // değilse pasif olan ikonu g&amp;ouml;ster
        buttonPush.src = "./assets/passive.png";
    }
}

function isPushNotifyEnabled() {
    if (Notification.permission === 'denied') {
        alert('Kullanıcı Push Notification hizmetini bloklamış');
        return;
    }

    if (!('PushManager' in window)) {
        alert('&amp;Uuml;zg&amp;uuml;n&amp;uuml;m ama Push Notification bu tarayıcı modelinde desteklenmiyor');
        return;
    }

    /*
    Kullanıcı Push Notification'ı engellememiş ve tarayıcı da bunu destekliyorsa
    buraya geliriz.
    Eğer Service Worker hazır ve kaydolmuşsa abonelik y&amp;ouml;netimine başlanabilir. 
    */
    navigator.serviceWorker.ready.then(function (reg) {
        reg.pushManager.getSubscription() //abone ol
            .then(function (subs) { // abonelik durumuna g&amp;ouml;re stat&amp;uuml;leri g&amp;uuml;ncelle
                if (subs) {
                    updateStatus(true);
                }
                else {
                    updateStatus(false);
                }
            })
            .catch(function (err) { // bir hata oluştuysa tarayıcı console'una hata basıyoruz.
                console.error('Bir hata oluştu : ', err);
            });
    });
}

// Uygulamayı Push Notification hizmetine abone etmek i&amp;ccedil;in
function subscribe() {
    navigator.serviceWorker.ready
        .then(function (reg) {
            if (!reg.pushManager) {
                alert('Tarayıcı Push Notification hizmetini desteklemiyor');
                return false;
            }
            reg.pushManager.subscribe(
                { userVisibleOnly: true }
            ).then(function (subs) {
                console.log('Abonelik başladı.');
                console.log(subs);
                sendSubsID(subs); // Abonelik IDsini REST servise g&amp;ouml;nderen metodu &amp;ccedil;ağırdık
                updateStatus(true);
            }).catch(function (err) {
                updateStatus(false);
                console.error('Abone olma işlemi sırasında hata oluştu: ', err);
            });
        });
}

// Abonelikten &amp;ccedil;ıkartmak i&amp;ccedil;in
function unsubscribe() {
    navigator.serviceWorker.ready
        .then(function (reg) {
            reg.pushManager.getSubscription()
                .then(function (subs) {
                    if (!subs) {
                        alert('Abonelikten &amp;ccedil;ıkılamıyor yahu :S');
                        return;
                    }
                    subs.unsubscribe()
                        .then(function () {
                            console.log('Abonelikten &amp;ccedil;ıkıldı');
                            console.log(subs);
                            deleteSubsID(subs); // Aboneliği silerken ID'yi &amp;ccedil;ıkartacak olan REST servis metodunu &amp;ccedil;ağırdık
                            updateStatus(false);
                        })
                        .catch(function (err) {
                            console.error(err);
                        });
                })
                .catch(function (err) {
                    console.error('Abonelikten &amp;ccedil;ıkarken bir hata oluştu : ', err);
                });
        })
}

// Sunucuya Subscription ID bilgisini g&amp;ouml;ndermek i&amp;ccedil;in kullanıyoruz
// Bunun i&amp;ccedil;in yazdığımız PusherAPI node servisini kullanıyoruz
function sendSubsID(subscription) {
    var id = subscription.endpoint.split('gcm/send/')[1];
    fetch('http://localhost:8080/subscribers', {
        method: 'post',
        headers: {
            'Accept': 'application/json',
            'Content-Type': 'application/json'
        },
        body: JSON.stringify({ subscriptionid: id })
    });
}

function deleteSubsID(subscription) {
    var id = subscription.endpoint.split('gcm/send/')[1];
    fetch('http://localhost:8080/subscribers/' +
        id, {
            method: 'delete',
            headers: {
                'Accept': 'application/json',
                'Content-Type': 'application/json'
            }
        });
}

// div ve button elementlerini alıyoruz
var divPush = document.getElementById('divPush');
var buttonPush = document.getElementById('buttonPush');

/*
div elementinde mouse ile tıklandığı zaman ger&amp;ccedil;ekleşecek olayı
dinleyecek bir listener bildirimi yaptık
*/
divPush.addEventListener('click', function () {
    //console.log('Click');
    if (divPush.dataset.checked === 'true') {
        //console.log('Unsubscribe');
        unsubscribe();
    }
    else {
        //console.log('Subscribe');
        subscribe();
    }
});

isPushNotifyEnabled();&lt;/pre&gt;
&lt;/div&gt;
&lt;h2&gt;İlk Test&lt;/h2&gt;
&lt;div&gt;Kodları tamamladıktan sonra kısa bir test ile push notification hizmetinin &amp;ccedil;alışıp &amp;ccedil;alışmadığı hemen kontrol edilebilir. Bunun i&amp;ccedil;in terminalden&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;serve&lt;/pre&gt;
komutunu verip uygulamayı ayağa kaldırmamız yeterli. Eğer&amp;nbsp;aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;lerindekine benzer sonu&amp;ccedil;lar elde edebiliyorsak REST API uygulamasını yazmaya başlayabiliriz.&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;&lt;img src="/image.axd?picture=/2019/07/31/credit_2.png" alt="" /&gt;&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;&lt;img src="/image.axd?picture=/2019/07/31/credit_3.png" alt="" /&gt;&lt;/div&gt;
&lt;div&gt;
&lt;blockquote&gt;
&lt;div&gt;Uygulama, Push Notification hizmeti i&amp;ccedil;in abone olunurken benzersiz bir ID değeri alır. Firebase Cloud Messaging sistem bu değeri kullanarak kime bildirim yapılacağını bilebilir.&lt;/div&gt;
&lt;/blockquote&gt;
&lt;h2&gt;REST API Uygulamasının Yazılması&lt;/h2&gt;
&lt;div&gt;
&lt;div&gt;Abone olan uygulamaların ID bilgilerini y&amp;ouml;netmek i&amp;ccedil;in Node.js tabanlı bir REST servisi yazabiliriz.&amp;nbsp;Servis temel olarak PWA'nın FCM ile olan iletişiminde devreye girmektedir. Hem abonelik y&amp;ouml;netimi hem de istemcilere bildirim yapılması ki bunu tek başına yapmayacaktır. Service Worker dolaylı olarak FCM &amp;uuml;zerinden bu servisle yakın ilişki i&amp;ccedil;erisindedir.&amp;nbsp;&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;Bu servisi ayrı bir klas&amp;ouml;rde projelendirmek iyi olur. Pek tabii node.js tarafında REST Servisi yazımını kolaylaştırmak i&amp;ccedil;in bazı paketlerden destek alınabilir. express dışında HTTP mesajlarındaki g&amp;ouml;vdeleri kolayca ele almak i&amp;ccedil;in body-parser, servisin Firebase Cloud Messaging ile konuşabilmesini sağlamak amacıyla da fcm-node paketi kullanılablir. morgan mod&amp;uuml;l&amp;uuml;n&amp;uuml; ise sunucu tarafındaki HTTP trafiğini loglamak i&amp;ccedil;in değerlendirebiliriz.&amp;nbsp;Aşağıdaki terminal komutları ile klas&amp;ouml;r ağacını oluşturup server dosyasını kodlayarak derlememize devam edelim.&lt;/div&gt;
&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;mkdir PusherAPI
cd PusherAPI
touch server.js
sudo npm install express body-parser fcm-node morgan&lt;/pre&gt;
server mod&amp;uuml;l&amp;uuml;&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;var express = require('express');
var app = express();
var bodyParser = require('body-parser');
var FCM = require('fcm-node');
var morgan = require('morgan');
app.use(morgan('combined'));

// Firebase Cloud Messaging nesnesini &amp;ouml;rneklerken
// bizim i&amp;ccedil;in &amp;uuml;retilen server key değerini veriyoruz
var fcm = new FCM('bu kod sizde var...');

app.use(bodyParser.json());
app.use(bodyParser.urlencoded({
    extended: true
}));

app.use(function (req, res, next) {
    // CORS problemi yaşamamak i&amp;ccedil;in gerekli header tanımlamaları yapılır
    res.setHeader('Access-Control-Allow-Origin', '*');
    res.setHeader('Access-Control-Allow-Headers', 'X-Requested-With,content-type');
    res.setHeader('Access-Control-Allow-Methods', 'GET,PUT,POST,DELETE');
    next();
})

//abonelerin ID bilgilerini tutacağımız array. 
// Bunun yerine daha kalıcı bir repository tercih edilebilir
var subscribers = []

// Web uygulaması HTTP Post ile subscriptionID g&amp;ouml;nderdiğinde &amp;ccedil;alışan metod 
app.post('/subscribers/', function (req, res) {
    // Mesaj g&amp;ouml;vdesinden abonelik bilgisini almaya &amp;ccedil;alışr
    if (!req.body.hasOwnProperty('subscriptionid')) {
        res.statusCode = 400;
        res.send('G&amp;ouml;nderilen bilgilerde eksik veya hata var');
        return;
    }
    // bulduysan diziye ekle ve başarılı olduğu bilgisini ilet
    subscribers.push(req.body.subscriptionid)
    res.statusCode = 200; //HTTP 200 Ok basıyoruz
    res.send('ID alındı');
});

// Web uygulaması abonelikten &amp;ccedil;ıkarken HTTP Delete ile &amp;ccedil;ağırdığı metod
app.delete('/subscribers/:id', function (req, res) {
    // dizideki indis değerini URLden gelen id değerine g&amp;ouml;re bul
    const index = subscribers.indexOf(req.params.id)
    // varsa diziden &amp;ccedil;ıkart
    if (index !== -1) {
        subscribers.splice(index, 1)
    }
    res.statusCode = 200;
    res.send('ID silindi');
});

/*
    Abonelere bildirim g&amp;ouml;ndermek i&amp;ccedil;in tetiklenen REST metodu
    localhost:8080/news/push &amp;ccedil;ağrısı geldiğinde &amp;ccedil;alışır.
*/
app.get('/news/push', function (req, res) {
    // Aboneler i&amp;ccedil;in mesaj hazırlanır
    var message = {
        registration_ids: subscribers,
        collapse_key: 'i_love_this_game',
    };
    // Firebase Cloud Messaging &amp;uuml;zerinden mesaj g&amp;ouml;nderilir
    fcm.send(message, function (err, response) {
        if (err) {
            console.log(err)
        } else {
            console.log("Mesaj başarılı bir şekilde g&amp;ouml;nderildi: ", response);
        }
    });
    res.sendStatus(200);
});

app.listen(8080);
console.log('Pusher API servisi 8080 &amp;uuml;st&amp;uuml;nden dinlemede');&lt;/pre&gt;
&lt;/div&gt;
&lt;h2&gt;&amp;Ccedil;alışma Dinamikleri&lt;/h2&gt;
&lt;/div&gt;
&lt;div&gt;
&lt;div&gt;Uygulamanın &amp;ccedil;alışma dinamiklerini anlamak olduk&amp;ccedil;a &amp;ouml;nemli. Index.html olarak d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z web uygulamamız &amp;ccedil;alıştırıldığında iki aksiyonumuz var. Basketbol topuna basıp bir abonelik başlatmak veya tekrar basarak aboneliği durdurmak.&lt;/div&gt;
&lt;br /&gt;
&lt;div&gt;Abonelik başlatıldığında FCM benzersiz bir ID değeri &amp;uuml;retir ve bunu PusherAPI servisi kendisine gelen &amp;ccedil;ağrı ile kayıt altına alır&lt;em&gt;(diziye eklediğimiz yer)&lt;/em&gt; Sonraki herhangi bir t zamanında PusherAPI servisinin abonelere bildirim g&amp;ouml;nderen HTTP metodu tetiklenirse, Firebase Cloud Messaging devreye girer ve dizideki ID bilgilerini kullanarak abonelerine bildirimde bulunur. Bildirimler web uygulaması tarafındaki Service Worker&lt;em&gt;(sworker.js)&lt;/em&gt; tarafından push olayıyla yakalanır. Push olayı şimdilik sadece statik bir sayfa g&amp;ouml;sterimi yapmakta ki aslında asıl i&amp;ccedil;eriği yine servis &amp;uuml;st&amp;uuml;nden veya web aracılığıyla başka bir adresten aldırabiliriz.&lt;/div&gt;
&lt;h2&gt;&amp;Ccedil;alışma Zamanı(Development Ortamı)&lt;/h2&gt;
&lt;div&gt;Testler i&amp;ccedil;in PWA ve servis tarafını ayrı ayrı &amp;ccedil;alıştırmalıyız.&lt;/div&gt;
&lt;div&gt;
&lt;div&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;serve&lt;/pre&gt;
terminal komutu ile web uygulamasını&lt;/div&gt;
&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;node server.js&lt;/pre&gt;
ile de REST servisini başlatabiliriz. Aboneliği başlattıktan sonra http://localhost:8080/news/push adresine talepte bulunursak bir bildirim mesajı ile karşılaşırız&lt;em&gt;(sworker daki push olayı tetiklenir)&lt;/em&gt; Aynen aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi.&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;&lt;img src="/image.axd?picture=/2019/07/31/credit_4.png" alt="" /&gt;&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;Bildirim kutusuna tıklarsak statik olarak belirlediğimiz sayfa a&amp;ccedil;ılacaktır&lt;em&gt;(yani notificationclick olayı tetiklenir)&lt;/em&gt;&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;&lt;img src="/image.axd?picture=/2019/07/31/credit_5.png" alt="" /&gt;&lt;/div&gt;
&lt;h2&gt;PWA ve Service Uygulamalarının Firebase Hosting'e Alınması&lt;/h2&gt;
&lt;div&gt;Her iki uygulamada local&amp;nbsp;geliştirme ortamında gayet g&amp;uuml;zel &amp;ccedil;alışıyor. Ancak bunu anlamlı hale getirmek i&amp;ccedil;in her iki &amp;uuml;r&amp;uuml;n&amp;uuml; de Firebase &amp;uuml;zerine alıp&amp;nbsp;genel&amp;nbsp;kullanıma a&amp;ccedil;mamız lazım. Web uygulamasını Firebase Hosting ile REST servisini de Firebase Function ile yayınlamalıyız. Bu işlemler i&amp;ccedil;in firebase-tools aracına ihtiyacımız olacak. Terminalden aşağıdaki komutu kullanarak ilgili aracı sisteme y&amp;uuml;kleyebiliriz.&lt;/div&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo npm install -g firebase-tools&lt;/pre&gt;
&lt;h3&gt;Basketkolik'in Dağıtımı&lt;/h3&gt;
&lt;div&gt;Yeni bir dağıtım klas&amp;ouml;r&amp;uuml; oluşturmalı, initializion işlemini ger&amp;ccedil;ekleştirip basketkolik uygulama kodlarını oluşan public klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisine atmalıyız. Ardından &amp;uuml;zerinde &amp;ccedil;alışacağımız projeyi se&amp;ccedil;ip deploy işlemini yapabiliriz. Bu işlemler i&amp;ccedil;in aşağıdaki terminal komutlarından yararlanılabilir.&lt;/div&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;mkdir dist
cd dist
firebase init
cp -a ../basketkolik/. ./public/
firebase use --add basketin-cepte-project
firebase deploy&lt;/pre&gt;
&lt;div&gt;firebase init işleminde bize bazı se&amp;ccedil;enekler sunulacaktır. Burada aşağıdaki g&amp;ouml;r&amp;uuml;nt&amp;uuml;de yer alan se&amp;ccedil;imlerle ilerleyebiliriz. En azından ben &amp;ouml;yle yaptım.&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;&lt;img src="/image.axd?picture=/2019/07/31/credit_6.png" alt="" /&gt;&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;Eğer dağıtım işlemi başarılı olursa aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer sonu&amp;ccedil;lar elde edilmelidir.&lt;/div&gt;
&lt;br /&gt;
&lt;div&gt;&lt;img src="/image.axd?picture=/2019/07/31/credit_7.png" alt="" /&gt;&lt;/div&gt;
&lt;h3&gt;PusherAPI servisinin Dağıtımı&lt;/h3&gt;
&lt;div&gt;Hatırlanacağı &amp;uuml;zere web uygulaması bir REST Servisi yardımıyla FCM sistemini kullanıyordu. PusherAPI isimli uygulama, Fireabase tarafı i&amp;ccedil;in bir Function anlamına gelmektedir&lt;em&gt;(Serverless App olarak d&amp;uuml;ş&amp;uuml;nelim)&lt;/em&gt; &amp;Ouml;l&amp;ccedil;eklenebilirliği, HTTPS g&amp;uuml;venliği, otomatik olarak ayağa kalkması gibi bir &amp;ccedil;ok iş Google Cloud ortamı tarafından ele alınır. Şimdi aşağıdaki terminal komutu ile fonksiyon klas&amp;ouml;r&amp;uuml;n&amp;uuml; oluşturalım&amp;nbsp;&lt;em&gt;(dist klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisinde &amp;ccedil;alıştığımıza dikkat edelim)&lt;/em&gt;&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;firebase init functions&lt;/pre&gt;
&lt;/div&gt;
&lt;div&gt;Yine bazı se&amp;ccedil;enekler karşımıza gelecektir. Burada gelen sorulara ş&amp;ouml;yle cevaplar verebiliriz;&lt;/div&gt;
&lt;ul&gt;
&lt;li&gt;Dil olarak Javascript se&amp;ccedil;elim.&lt;/li&gt;
&lt;li&gt;ESLint kullanımına Yes diyelim.&lt;/li&gt;
&lt;li&gt;npm dependency'lerin kurulmasına da Yes diyelim ki uygulamanın gereksinim duyduğu node paketleri de y&amp;uuml;klensin.&lt;/li&gt;
&lt;/ul&gt;
&lt;div&gt;Devam eden adımda functions klas&amp;ouml;r&amp;uuml;ndeki index dosyasının i&amp;ccedil;eriğini PusherAPI'deki server i&amp;ccedil;eriği ile değiştirmeliyiz. Ancak bu kez express'in firebase-functions ile kullanılması gerekiyor. İhtiyacımız olan express, body-parser ve fcm-node paketlerini &amp;uuml;zerinde &amp;ccedil;alıştığımız functions klas&amp;ouml;r&amp;uuml; i&amp;ccedil;inede de y&amp;uuml;klemeliyiz. Son olarak dist klas&amp;ouml;r&amp;uuml;ndeki firebase.json dosyasına rewrites isimli yeni bir b&amp;ouml;l&amp;uuml;m ekleyip fonksiyonumuzu deploy edebiliriz.&lt;/div&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;cd functions
sudo npm install express body-parser fcm-node
firebase deploy&lt;/pre&gt;
&lt;div&gt;Yapmamız gereken bir şey daha var. Web uygulamasının kullandığı main dosyasının i&amp;ccedil;eriğini, yeni eklediğimiz google functions ile uyumlu hale getirmek. Tahmin edileceği &amp;uuml;zere gidilen servis adreslerini, oluşturulan firebase proje adresleri ile değiştirmemiz lazım&amp;nbsp;&lt;em&gt;(dist/public/main.js i&amp;ccedil;eriğini kontrol edin)&amp;nbsp;&lt;/em&gt;Web uygulamasındaki bu değişikliği Cloud ortamına taşımak i&amp;ccedil;inse public klas&amp;ouml;r&amp;uuml;ndeyken yeniden bir deploy işlemi başlatmamız yeterli olacaktır.&lt;/div&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;firebase deploy&lt;/pre&gt;
&lt;h2&gt;&amp;Ccedil;alışma Zamanı&lt;em&gt;(Production Ortamı)&lt;/em&gt;&lt;/h2&gt;
&lt;div&gt;Uygulama artık https://basketin-cepte-project.firebaseapp.com/ adresinden yayında&amp;nbsp;&lt;em&gt;(En azından bir s&amp;uuml;re i&amp;ccedil;in yayındaydı ki aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; de bunun kanıtıdır)&lt;/em&gt;&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;&lt;img src="/image.axd?picture=/2019/07/31/credit_8.png" alt="" /&gt;&lt;/div&gt;
&lt;h2&gt;Ben Neler &amp;Ouml;ğrendim?&lt;/h2&gt;
&lt;div&gt;Bu &amp;ccedil;alışmanın da bana kattığı bir &amp;ccedil;ok şey oldu elbette. &amp;Ouml;zellikle bir uygulamaya uzak sunuculardan bildirim yollanması ve bunun abonelik temelli yapılması merak edip &amp;ouml;ğrenmek istediğim konulardan birisiydi. İşin i&amp;ccedil;erisine basit bir PWA modeli de ekleyince &amp;ccedil;alışma ilgi &amp;ccedil;ekici bir hal almıştı. Yapılan hazırlıklar d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde aslında bizi &amp;ccedil;ok fazla yormayacak bir geliştirme s&amp;uuml;reci olduğunu ifade edebiliriz. Derlemeyi sonlandırmacan &amp;ouml;nce yanıma kar kalanların neler olduğunu aşağıdaki maddeler ile&amp;nbsp;&amp;ouml;zetleyebilirim.&lt;/div&gt;
&lt;ul&gt;
&lt;li&gt;Firebase Cloud Messaging&lt;em&gt;(FCM)&lt;/em&gt; sisteminin kabaca ne işe yaradığını&lt;/li&gt;
&lt;li&gt;PWA uygulamasının FCM ile nasıl haberleşebileceğini&lt;/li&gt;
&lt;li&gt;Abone olan istemciye bildirimlerin nasıl g&amp;ouml;nderilebileceğini&lt;/li&gt;
&lt;li&gt;Service Worker &amp;uuml;zerindeki push ve notificationclick olaylarının ne anlama geldiğini&lt;/li&gt;
&lt;li&gt;serve paketinin kullanımını&lt;/li&gt;
&lt;li&gt;firebase terminal aracı ile deployment işlemlerinin nasıl yapıldığını&lt;/li&gt;
&lt;li&gt;Web uygulaması ve Functions'ın Google Cloud tarafından bakıldığında farklılıklarını&lt;/li&gt;
&lt;/ul&gt;
&lt;div&gt;Bu arada proje&amp;nbsp;b&amp;uuml;y&amp;uuml;k ihtimalle&amp;nbsp;Google platformundan kaldırılmıştır. Malum istenmeyen bir y&amp;uuml;klenme sonrası y&amp;uuml;kl&amp;uuml; bir fatura ile karşılaşmamak adına k&amp;uuml;&amp;ccedil;&amp;uuml;k bir tedbir olduğunu ifade edebilirim. O nedenle kendiniz başarmaya &amp;ccedil;alışırsanız daha kıymetli olacaktır. Konseptin basketbol olması &amp;ouml;nemli değil. Abonelerinize bildirimlerde bulunacağınız herhangi bir senaryo olması yeterli olur. Bildirim yapan servisi de planlanmış bir d&amp;uuml;zeneğe bağlayabiliriz. S&amp;ouml;z gelimi g&amp;uuml;n&amp;uuml;n belirli anlarında bir konu ile ilgili bildirimlerin y&amp;ouml;nlendirilmesi işini &amp;uuml;stlenebilir. B&amp;ouml;ylece geldik bir &lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;saturday-night-works&lt;/a&gt;&amp;nbsp;macerasının daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/div&gt;
&lt;/div&gt;
&lt;/div&gt;
&lt;/div&gt;</content>
  <pubDate>2019-08-02 17:48:00</pubDate>
  <slug>firebase-cloud-messaging-ile-abonelere-bildirim-yollamak</slug>
  <tags>
    <tag>firebase</tag>
    <tag>google-cloud-platform</tag>
    <tag>progressive-web-app</tag>
    <tag>pwa</tag>
    <tag>push-notification</tag>
    <tag>node</tag>
    <tag>nodejs</tag>
    <tag>express</tag>
    <tag>rest-api</tag>
    <tag>fcm</tag>
    <tag>fcm-node</tag>
    <tag>service-worker</tag>
    <tag>google-cloud-functions</tag>
    <tag>javascript</tag>
    <tag>npm</tag>
  </tags>
  <categories>
    <category>GCP</category>
  </categories>
</post>