<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>PLINQ (Parallel LINQ) - Hello World [Beta 1]</title>
  <description>Bildiğiniz gibi son yazımı deniz kenarında bir kafede tatildeyken yazmıştım Wink Ama tatil bitti malesef ve tekrardan Morpheus' un sözleri kulaklarımda çınladı "Wellcome to the real world". Cry Yinede 1 haftalığınada olsa tatil yapabildiğime şükrediyorum. Gerçek dünyaya döndükten sonra tabiki bir süre adaptasyon sorunları ile karşılaşıyor insan doğal olaraktan. Bu adaptasyon sorunları içerisinde boğuşurken, neleri araştırabilirim diye düşünürken buluverdim kendimi.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bildiğiniz gibi son yazımı deniz kenarında bir kafede tatildeyken yazmıştım&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Ama tatil bitti malesef ve tekrardan Morpheus' un s&amp;ouml;zleri kulaklarımda &amp;ccedil;ınladı &lt;strong&gt;"Wellcome to the real world".&lt;/strong&gt; &lt;img title="Cry" src="/editors/tiny_mce3/plugins/emotions/img/smiley-cry.gif" alt="Cry" border="0" /&gt;&amp;nbsp;Yinede 1 haftalığınada olsa tatil yapabildiğime ş&amp;uuml;krediyorum. Ger&amp;ccedil;ek d&amp;uuml;nyaya d&amp;ouml;nd&amp;uuml;kten sonra tabiki bir s&amp;uuml;re adaptasyon sorunları ile karşılaşıyor insan doğal olaraktan. Bu adaptasyon sorunları i&amp;ccedil;erisinde boğuşurken, neleri araştırabilirim diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;rken buluverdim kendimi.&lt;/p&gt;
&lt;p&gt;Herşeyden &amp;ouml;nce &lt;strong&gt;.Net Framework 4.0&lt;/strong&gt; ve &lt;strong&gt;&lt;a title="Visual Studio 2010 Beta 1" href="http://www.microsoft.com/downloads/details.aspx?FamilyID=255fc5f1-15af-4fe7-be4d-263a2621144b&amp;amp;displaylang=en" target="_blank"&gt;Visual Studio 2010 Beta 1&lt;/a&gt;&lt;/strong&gt; s&amp;uuml;r&amp;uuml;mlerinin&amp;nbsp;yayınlandığını hepimiz biliyoruz. Dolayısıyla odaklanılacak konu zaten ap a&amp;ccedil;ık ortadaydı. .Net Framework 4.0 i&amp;ccedil;erisinde entegre olarak gelen bir yenilik hemen ilgi odağım oldu. &lt;strong&gt;PLINQ(Parallel Language INtegrated Query)&lt;/strong&gt;.&amp;nbsp;Aslında PLINQ yeni &amp;ccedil;ıkmış bir eklenti değil. Zaten uzun s&amp;uuml;redir &lt;strong&gt;.Net&amp;nbsp;Framework&amp;nbsp;3.5 &lt;/strong&gt;ve &lt;strong&gt;Visual Studio 2008 &lt;/strong&gt;&amp;uuml;zerinde CTP s&amp;uuml;r&amp;uuml;m&amp;uuml; ile testlerimizi yapabiliyorduk. Ne varki, .Net Framework 4.0 g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında PLINQ ile ilişkili tiplerin &lt;strong&gt;System.Core.dll&lt;/strong&gt; assembly' ının &lt;strong&gt;4.0&lt;/strong&gt; versiyonu i&amp;ccedil;erisine doğrudan ilave edildiğini g&amp;ouml;r&amp;uuml;yoruz. Aşağıdaki Visual Studio 2010 Object Browser' dan alınan g&amp;ouml;r&amp;uuml;nt&amp;uuml;de bu durum a&amp;ccedil;ık bir şekilde g&amp;ouml;zlemlenebiliyor.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f5%2fblg18_1big.gif" target="_blank"&gt;&lt;img src="/pics/2009%2f5%2fblg18_1mini.gif" alt="" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Tabiki &amp;ouml;ncelikli olarak &lt;strong&gt;PLINQ&lt;/strong&gt; kavramından biraz bahsetmemizde yarar var. PLINQ aslında, &lt;strong&gt;Microsfot Research &lt;/strong&gt;ve &lt;strong&gt;CLR(Common Language Runtime)&amp;nbsp;&lt;/strong&gt;takımları tarafından ortaklaşa geliştirilen &lt;strong&gt;Parallel Extensions &lt;/strong&gt;isimli genişletmelerin sadece bir pa&amp;ccedil;asıdır. Diğer par&amp;ccedil;a ise &lt;strong&gt;TBL(Task Parallel Library) &lt;/strong&gt;dir.(Bunu ilerleyen yazılarımda ele almaya &amp;ccedil;alışacağım)&amp;nbsp;Her iki yapının kullanım amacı, &lt;strong&gt;Y&amp;ouml;netimli Kod(Managed Code)&lt;/strong&gt;&amp;nbsp;tarafındaki eş zamanlı işleyişlerin kolay bir şekilde sağlanmasıdır. S&amp;ouml;z konusu yapı PLINQ olunca haliyle, LINQ sorgularının kendi i&amp;ccedil;erisine par&amp;ccedil;alanarak farklı &lt;strong&gt;thread'&lt;/strong&gt; lerde &amp;ccedil;alışması ve bu par&amp;ccedil;aların paralel y&amp;uuml;r&amp;uuml;yerek sonu&amp;ccedil;ların elde edilmesi akla gelmektedir. Ger&amp;ccedil;ektende PLINQ yapısının temel amacı bu şekilde &amp;ouml;zetlenebilir. Hatta PLINQ i&amp;ccedil;in&amp;nbsp;&lt;strong&gt;Eş Zamanlı Sorgu Y&amp;uuml;r&amp;uuml;tme Motorudur(Concurrency Query Execution Engine)&lt;/strong&gt; diyebiliriz. PLINQ temel olarak &lt;strong&gt;LINQ to XML &lt;/strong&gt;ve &lt;strong&gt;LINQ to Objects &lt;/strong&gt;gibi uygulama alanları &amp;uuml;zerinde etkin bir şekilde&amp;nbsp;kullanılabilmektedir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Unutulmaması gereken noktalardan biriside, PLINQ ifadelerinin aslında &amp;ccedil;ift &amp;ccedil;ekirdek ve &amp;uuml;st&amp;uuml; işlemcilerin yada birden fazla işlemcinin olduğu sistemlerde anlamlı olmasıdır. Nitekim, PLINQ motoru, &amp;ccedil;alışmakta olan sorgu s&amp;uuml;recini, makinenin sahip olduğu &amp;ccedil;ekirdek sayısına g&amp;ouml;re par&amp;ccedil;alara ayırır ve y&amp;uuml;r&amp;uuml;t&amp;uuml;r. Bu &amp;ouml;zellikle b&amp;uuml;y&amp;uuml;k &amp;ccedil;aplı projeler g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında, şirketin sahip olduğu ka&amp;ccedil; bilgisayar var ise hepsini en azından &amp;ccedil;ift &amp;ccedil;ekirdekli olacak şekilde yenilemek gibi bir maliyet anlamına da &lt;span style="text-decoration: underline;"&gt;gelmemelidir&lt;/span&gt;.&lt;/p&gt;
&lt;p&gt;Nitekim bazı istemci-sunucu mimarilerinde, sunucu tarafında &amp;ccedil;alışmakta olan pek &amp;ccedil;ok LINQ sorgusu, PLINQ motoru kullanılaraktan daha efektif hale getirilebilir. Bir başka deyişle, istemciler birden fazla &amp;ccedil;ekirdekli işlemcilere sahip olmasalarda, m&amp;uuml;mk&amp;uuml;n mertebe LINQ ifadelerini i&amp;ccedil;eren iş&amp;nbsp; mantıklarının, sunucu tarafında olduğu senaryolarda PLINQ b&amp;uuml;y&amp;uuml;k avantajlar sağlayabilir(&amp;Ccedil;ok kısa bir s&amp;uuml;re &amp;ouml;nce &amp;ccedil;alışmakta olduğum bir projede yer alan test makinesinin, 8 işlemcili olduğunu hatırlıyorum&amp;nbsp;&lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt; )&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Tabi burada var olan nesneler &amp;uuml;zerindeki LINQ sorgularının paralel olarak &amp;ccedil;alıştırılması i&amp;ccedil;in, &lt;strong&gt;Select, Where &lt;/strong&gt;gibi &lt;strong&gt;genişletme metodlarının(Extension Methods) &lt;/strong&gt;&amp;ccedil;alışma sırasında işi farklı par&amp;ccedil;alara b&amp;ouml;lebilecek versiyonlarının olması gerektiği d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. İşte bu noktada devreye, &lt;strong&gt;System.Core assembly' &lt;/strong&gt;ının &lt;strong&gt;4.0 &lt;/strong&gt;versiyonu i&amp;ccedil;erisinde yer alan ve &lt;strong&gt;System.Linq &lt;/strong&gt;isim alanında bulunan &lt;strong&gt;ParallelEnumerable &lt;/strong&gt;adlı &lt;strong&gt;static &lt;/strong&gt;sınıf girmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f5%2fblg18_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu sınıftaki en &amp;ouml;nemli genişletme &lt;strong&gt;AsParallel&lt;/strong&gt; isimli fonksiyondur. Bu metodun g&amp;ouml;revi, &lt;strong&gt;IEnumerable&lt;/strong&gt; t&amp;uuml;revli bir koleksiyonun paralel olarak sorgulanabilir hale getirilmesi veya hazırlanmasıdır. &amp;Ouml;yleki, metod geriye &lt;strong&gt;ParallelQuery &lt;/strong&gt;isimli sınıfa ait bir nesne &amp;ouml;rneği d&amp;ouml;nd&amp;uuml;rmektedir. &lt;strong&gt;ParallelQuery &lt;/strong&gt;sınıfı &lt;strong&gt;IEnumerable &lt;/strong&gt;aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamaktadır ama herşeyden &amp;ouml;nemlisi paralel sorgulanabilme i&amp;ccedil;in gerekli &amp;ouml;n hazırlıkları i&amp;ccedil;eren operasyonlarada sahiptir.&lt;/p&gt;
&lt;p&gt;Bu teknik detaylar eminimki bir Hello World yazısında&amp;nbsp;sizede sıkıcı gelmiştir. Hi&amp;ccedil; vakit kaybetmeden basit bir &amp;ouml;rnek ile ilerlemekte yarar olduğunu d&amp;uuml;ş&amp;uuml;nmekteyim. Aşağıdaki kod par&amp;ccedil;ası &lt;strong&gt;Visual Studio 2010 Beta 1 &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml;nde yazılmış basit bir &lt;strong&gt;Console &lt;/strong&gt;uygulamasına aittir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Diagnostics;
using System.Linq;

namespace HelloWorld
{
    class Program
    {
        static void Main(string[] args)
        {
            List&amp;lt;Product&amp;gt; products = FillProducts();
            Console.WriteLine("Liste dolduruldu. İşlemlere devam etmek i&amp;ccedil;in tıklayın");
            Console.ReadLine();

            Stopwatch watch = Stopwatch.StartNew();

            var result1 = from p in products
                          where p.ListPrice &amp;gt;= 10 &amp;amp;&amp;amp; p.InStock == true
                          orderby p.Name descending
                          select p;
            Console.WriteLine("Toplam {0} adet &amp;uuml;r&amp;uuml;n bulundu",result1.ToList().Count.ToString());

            Console.WriteLine("Toplam s&amp;uuml;re {0}",watch.ElapsedMilliseconds.ToString());
            Console.WriteLine("Parallel Olduğunda");

            Stopwatch watch2 = Stopwatch.StartNew();

            var result2 = from p in products.AsParallel()
                          where p.ListPrice &amp;gt;= 10 &amp;amp;&amp;amp; p.InStock==true
                          orderby p.Name descending
                          select p;
            Console.WriteLine("Toplam {0} adet &amp;uuml;r&amp;uuml;n bulundu", result2.ToList().Count.ToString());

            Console.WriteLine("Toplam s&amp;uuml;re {0}", watch2.ElapsedMilliseconds.ToString());
        }

        static List&amp;lt;Product&amp;gt; FillProducts()
        {
            List&amp;lt;Product&amp;gt; products = new List&amp;lt;Product&amp;gt;();

            for (long i = 1; i &amp;lt; 1750000; i++)
            {
                Product prd = new Product { 
                    Id = i
                    , Name = "Product" + i.ToString()
                    , ListPrice = i * 0.1M
                    , InStock=i%2==0?true:false
                };
                products.Add(prd);
            }

            return products;
        }
    }

    
    class Product
    {
        public long Id { get; set; }
        public string Name { get; set; }
        public decimal ListPrice { get; set; }
        public bool InStock { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulama i&amp;ccedil;erisinde &lt;strong&gt;Products&lt;/strong&gt; isimli bir sınıf ve bu tipe ait nesne &amp;ouml;rneklerinden oluşan bir koleksiyon veri kaynağı olarak kullanılmaktadır. Dikkat edileceği &amp;uuml;zere, iki adet &lt;strong&gt;LINQ&lt;/strong&gt; sorgusu bulunmaktadır. Product tipinden olan generic &lt;strong&gt;List &lt;/strong&gt;koleksiyonu, &lt;strong&gt;FillProducts &lt;/strong&gt;metodu yardımıyla tamamen hayali veriler ile doldurulmuştur. Her iki sorguda &lt;strong&gt;ListPrice değeri 10' un &amp;uuml;zerinde olan ve stokta bulunan &amp;uuml;r&amp;uuml;nleri&lt;/strong&gt;, &lt;strong&gt;adlarına g&amp;ouml;re ters sırada&lt;/strong&gt; d&amp;ouml;nd&amp;uuml;rmektedir. Ancak &amp;ouml;nemli olan nokta ikinci LINQ ifadesinde &lt;strong&gt;AsParallel&lt;/strong&gt; metodunun kullanılmasıdır. Bu &amp;ouml;rnek kod par&amp;ccedil;asını &amp;ccedil;alıştırdığımda, aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;ları aldım.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f5%2fblg18_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hemen şunu belirteyim. Programı yazdığım makinede &lt;strong&gt;&amp;ccedil;ift &amp;ccedil;ekirdekli Intel işlemci &lt;/strong&gt;ve &lt;strong&gt;4 Gb Ram &lt;/strong&gt;bulunmakta. İşletim sistemi olarakta &lt;strong&gt;Windows Vista &lt;/strong&gt;Enterprise yer alıyor. Tabi bu &amp;ouml;rnek i&amp;ccedil;in Intel tabanlı işlemcinin daha b&amp;uuml;y&amp;uuml;k &amp;ouml;nem taşıdığını hemen s&amp;ouml;yleyebiliriz. &amp;Ccedil;alışma zamanındanda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, paralel olarak y&amp;uuml;r&amp;uuml;t&amp;uuml;len LINQ ifadesi neredeyse &lt;strong&gt;%50&lt;/strong&gt; daha az zamanda tamamlanmıştır. (Aslında bu kod par&amp;ccedil;asını 4 &amp;ccedil;ekirdekli bir işlemcide test etmeyi &amp;ccedil;ok istiyorum. Bu konuda siz değerli okurlarımın yorumlarını ve test sonu&amp;ccedil;larını bekliyor olacağım &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;)&lt;/p&gt;
&lt;p&gt;Uygulama &amp;ccedil;alışırken &lt;strong&gt;Task Manager&lt;/strong&gt; aracı ile &lt;strong&gt;CPU&lt;/strong&gt; kullanım durumuna baktığımda ise aşağıdaki sonu&amp;ccedil;lar ile karşılaştım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f5%2fblg18_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;lar tam anlamıyla durmun net analizi olmasada bir par&amp;ccedil;a olsun fikir vermektedir. Yuvarlak i&amp;ccedil;erisine aldığımda kısımlar, sorgunun &lt;strong&gt;PLINQ&lt;/strong&gt; motoru tarafından ele alınmaya başladığı yerlerdeki &amp;ouml;l&amp;ccedil;&amp;uuml;m değerleridir. Dikkat edileceği &amp;uuml;zere CPU &amp;ccedil;ekirdeklerinin kullanım değerleri &lt;strong&gt;%100'&lt;/strong&gt; e vurmuş durumdadır ki buda aslında, sorgunun &amp;ccedil;alıştırılması sırasında t&amp;uuml;m işlemci g&amp;uuml;c&amp;uuml;n&amp;uuml;n kullanıldığı anlamınada gelmektedir. (Aslında Einstein' ın kuramına g&amp;ouml;re bu durum &lt;span style="text-decoration: underline;"&gt;g&amp;ouml;receli olarak iyi&lt;/span&gt; sayılabilir. Ama sayılmayadabilir &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;)&lt;/p&gt;
&lt;p&gt;Yazdığım &amp;ouml;rnek kod par&amp;ccedil;asında işlemleri ger&amp;ccedil;ekten yavaşlatmak adına bir sıralama işlemide kullandım. Anacak bunun yapılması zorunlu değildir. &amp;Ouml;zellikle sıralama kullanılmadığında sorgu &amp;ccedil;alıştırma s&amp;uuml;relerinin birbirlerine &amp;ccedil;ok yakın olduğunu g&amp;ouml;rd&amp;uuml;m. A&amp;ccedil;ık&amp;ccedil;ası, &lt;strong&gt;PLINQ'&lt;/strong&gt; in avantajı ger&amp;ccedil;ekten &amp;ccedil;ok uzun s&amp;uuml;rebilecek sorgular s&amp;ouml;z konusu olduğunda ortaya &amp;ccedil;ıkmata. Bu nedenle her LINQ sorgusunun PLINQ formatına d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmesininde anlamlı &lt;span style="text-decoration: underline;"&gt;olmadığını(olmayacağını)&lt;/span&gt; s&amp;ouml;yleyebiliriz. Nitekim, bazı durumlarda herşey tersine d&amp;ouml;nebilir. &amp;Ouml;rneğin aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;int[] values = new int[100];Random rnd = new Random();
for (int i = 1; i &amp;lt; values.Length; i++)
{
 values[i] = rnd.Next(1, 1000);
}

Stopwatch watch3 = Stopwatch.StartNew();
var result3 = from value in values
              where value % 2 == 0
              select value;
Console.WriteLine("Toplam {0} &amp;ccedil;ift sayı var",result3.ToList().Count.ToString());
Console.WriteLine(watch3.ElapsedMilliseconds.ToString());

Stopwatch watch4 = Stopwatch.StartNew();
var result4 = from value in values.AsParallel()
              where value % 2 == 0
              select value;
Console.WriteLine("Toplam {0} &amp;ccedil;ift sayı var", result4.ToList().Count.ToString());
Console.WriteLine(watch4.ElapsedMilliseconds.ToString());&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asındaki LINQ sorgularında,&amp;nbsp;100 tane raslantısal ve 1 ile 1000 arasında olan&amp;nbsp;tamsayı değerlerinden oluşan bir dizi i&amp;ccedil;erisinde ka&amp;ccedil; &amp;ccedil;ift sayı olduğu tespit edilmektedir. İkinci sorgu, PLINQ motoru tarafından ele alınmaktadır. PLINQ' in, sorguyu paralel olan iş par&amp;ccedil;alarına b&amp;ouml;lerek &amp;ccedil;alıştırdığı d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde, ikinci ifadenin birincisine g&amp;ouml;re &amp;ccedil;ok daha hızlı &amp;ccedil;alışması gerektiği tahmin edilebilir. Ama ger&amp;ccedil;ekten b&amp;ouml;ylemi olacaktır. İşte sonu&amp;ccedil;lar...&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f5%2fblg18_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında bu sonu&amp;ccedil; son derece doğaldır. &lt;strong&gt;PLINQ&lt;/strong&gt; motoru &amp;ccedil;alışma zamanında, &amp;ccedil;ekirdeklere b&amp;ouml;l&amp;uuml;necek işler i&amp;ccedil;in hazırlıklar yapmalıdır, thread' leri ayarlamalıdır vb...&amp;nbsp;Bu &amp;ouml;n hazırlıklar nedeni ile zaten sorgunun s&amp;uuml;rece girmesi başlı başına bir zaman kaybı anlamına gelmektedir. Bu &amp;ouml;rnek en basit anlamda, PLINQ' in her LINQ ifadesi i&amp;ccedil;in ele &lt;span style="text-decoration: underline;"&gt;alınmaması&lt;/span&gt; gerektiğinide g&amp;ouml;stermektedir.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tatil d&amp;ouml;n&amp;uuml;ş&amp;uuml; sonrası &amp;uuml;zerimdeki adaptasyon bıkkınlığını hafifleten bu yazımda sizlere,&lt;strong&gt; .Net&amp;nbsp;Framework 4.0 &lt;/strong&gt;i&amp;ccedil;erisinde artık standart olarak&amp;nbsp;yer alan ve&amp;nbsp;&lt;strong&gt;Parallel Extension &lt;/strong&gt;mimarisinin bir par&amp;ccedil;ası olan &lt;strong&gt;PLINQ &lt;/strong&gt;konusunu anlatmaya &amp;ccedil;alıştım. Elbetteki PLINQ i&amp;ccedil;erisindede &amp;ccedil;ok daha fazlası var. Bunlarıda ilerleyen yazılarımda aktarmaya &amp;ccedil;alışıyor olacağım. Sizlerde &lt;a title="Parallel Extension Blog" href="http://blogs.msdn.com/pfxteam/default.aspx" target="_blank"&gt;bu &lt;/a&gt;adresten Parallel Extension ile ilişkili son bilgileri alabilirsiniz. Hatta şu saatlerde VS 2010 ile gelen yeniliklerde anlatılmakta.&amp;nbsp;Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f5%2fHelloWorld.rar"&gt;HelloWorld.rar (21,81 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-05-21 19:11:00</pubDate>
  <slug>PLINQ-(Parallel-LINQ)-Hello-World</slug>
  <tags>
    <tag>plinq</tag>
    <tag>linq</tag>
  </tags>
  <categories>
    <category>LINQ</category>
    <category>PLINQ</category>
  </categories>
</post>