<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>DataTable Sınıfını Kullanarak Programatik Olarak Tablolar Oluşturmak-2</title>
  <description>Hatırlayacağınız gibi yazı dizimizin ilk bölümünde, DataTable sınıfını kullanarak bellekte bir tablonun ve bu tabloya ait alanların nasıl yaratıldığını işlemiştik. Bugünkü makalemizde oluşturmuş olduğumuz bu tabloya kayıtlar ekleyeceğiz ve sonra bu DataTable nesnesini bir DataSet’e aktarıp içerisindeki verileri bir DataGrid kontrolünde göstereceğiz.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&amp;nbsp;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Hatırlayacağınız gibi yazı dizimizin ilk b&amp;ouml;l&amp;uuml;m&amp;uuml;nde, DataTable sınıfını kullanarak bellekte bir tablonun ve bu tabloya ait alanların nasıl yaratıldığını işlemiştik. Bug&amp;uuml;nk&amp;uuml; makalemizde oluşturmuş olduğumuz bu tabloya kayıtlar ekleyeceğiz ve sonra bu DataTable nesnesini bir DataSet&amp;rsquo;e aktarıp i&amp;ccedil;erisindeki verileri bir DataGrid kontrol&amp;uuml;nde g&amp;ouml;stereceğiz.&lt;/p&gt;
&lt;p&gt;Bir dataTable nesnesinin bellekte temsil ettiği tabloya yeni satırlar başka bir deyişle kayıtlar eklemek i&amp;ccedil;in, DataRow sınıfından nesneleri kullanacağız. Dilerseniz hi&amp;ccedil; vakit kaybetmeden uygulamamıza başlayalım. İlk &amp;ouml;rneğimizin devamı niteliğinde olucak bu &amp;ccedil;alışmamızda kullanıcının oluşturduğu tablodaki alan sayısı kadar textBox nesnesinide label nesneleri ile birlikte programatik olarak oluşturacağız.&amp;nbsp;İşte programımızın kodları,&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;DataTable dt; /* DataTable nesnemizi uygulama boyunca kullanabilmek i&amp;ccedil;in t&amp;uuml;m metodlarin disinda tanimladik. */ 
private void btnTabloOlustur_Click(object sender, System.EventArgs e)
{
     dt=new DataTable(txtTabloAdi.Text);
     MessageBox.Show(dt.TableName.ToString()+" TABLOSU BELLEKTE OLUSTURULDU");
     lblTabloAdi.Text=dt.TableName.ToString(); /* TableName &amp;ouml;zelligi DataTable nesnesinin bellekte temsil ettigi tablonun adini vermektedir.*/ 

     /*Tablo olusturuldugunda otomatik olarak bir ID alani ekleyelim. Bu alan benzersiz bir alan olucak yani i&amp;ccedil;erdigi veriler tekrar etmiyecek. 1 den baslayarak birer birer otomatik olarak articak. Ayni zamanda primary key olucak. Primary key oldugu zaman arama gibi islemleri yaparken bu alani kullanacagiz.*/ 
     DataColumn dcID=new DataColumn(); /* DataColumn nesnesi olusturulur.*/
     dcID.ColumnName="ID"; /* Alanin adi veriliyor*/
     dcID.DataType=Type.GetType("System.Int32"); /* Alanin veritipi belirleniyor*/

     dcID.Unique=true;/* Alanin i&amp;ccedil;erdigi verilerin tekrar etmeyecegi s&amp;ouml;yleniyor.*/
     dcID.AutoIncrement=true;/* Alanin degerlerinin otomatik olarak artacagi s&amp;ouml;yleniyor.*/
     dcID.AutoIncrementSeed=1;/* Ilk degeri 1 olucak.*/
     dcID.AutoIncrementStep=1;/* Alanin degerleri 1'er articak.*/
     dt.Columns.Add(dcID);/* Yukarida &amp;ouml;zellikleri belirtilen ID alani tablomuza ekleniyor. */ 
     /* Asagidaki kod satirlari ile ID isimli alani Primary Key olarak belirliyoruz. */
     DataColumn[] anahtarlar=new DataColumn[1];
     anahtarlar[0]=dt.Columns["ID"];
     dt.PrimaryKey=anahtarlar; 
     lstAlanlar.Items.Add(dt.Columns["ID"].ColumnName.ToString()+" Primary Key"); 
} 
private void btnAlanEkle_Click(object sender, System.EventArgs e)
{
     /*&amp;Ouml;nce yeni alanimiz i&amp;ccedil;in bir DataColumn nesnesi olusturulur*/
     DataColumn dc=new DataColumn();
     /*Simdi ise DataTable nesnemizin Columns koleksiyonuna olusturulan alanimizi ekliyoruz. Ilk parametre, alanin adini temsil ederken, ikinci parametre ise alanin veri t&amp;uuml;r&amp;uuml;n&amp;uuml; belirtmektedir. Add metodu bu &amp;ouml;zellikleri ile olusturulan DataColumn nesnesini dataTable'a ekler. Bu sayede tabloda alanimiz olusturulmus olur.*/
     dt.Columns.Add(txtAlanAdi.Text,Type.GetType("System."+cmbAlanTuru.Text));
     lstAlanlar.Items.Add("Alan Adi: "+dt.Columns[txtAlanAdi.Text].ColumnName.ToString()+" Veri Tipi: "+dt.Columns[txtAlanAdi.Text].DataType.ToString());
     /* ColumnName &amp;ouml;zelligi ile eklenen alanin adini, DataType &amp;ouml;zelligi ilede bu alanin veri t&amp;uuml;r&amp;uuml;n&amp;uuml; &amp;ouml;greniyoruz.*/
} 

public void KontrolOlustur(string alanAdi,int index)
{
     /* Aşağıdaki kodları asıl konumuzdan uzaklaşmadan,a&amp;ccedil;ıklamak istiyorum. DataTable'daki her bir alan i&amp;ccedil;in bir TextBox nesnesi ve Label nesnesi oluşturulup formumuza ekleniyor. Top &amp;ouml;zelliğinin ayarlanışına dikkatinizi &amp;ccedil;ekmek isterin. Top &amp;ouml;zelliğini bu metoda g&amp;ouml;nderdiğimiz index paramteresi ile &amp;ccedil;arpıyoruz. B&amp;ouml;ylece, o sırada hangi indexli datacolumn nesnesinde isek ilgili kontrol&amp;uuml;n formun &amp;uuml;st noktasından olan uzaklığı o kadar KAT artıyor. Elbette en &amp;ouml;nemli &amp;ouml;zellik kontrollerin adlarının verilemsi. Tabi her bir kontro&amp;uuml; this.Controls.Add syntax'ı formumuza eklemeyi unutmuyoruz. */
     System.Windows.Forms.TextBox txtAlan=new System.Windows.Forms.TextBox();
     txtAlan.Text="";
     txtAlan.Left=275;
     txtAlan.Top=30*index;
     txtAlan.Name="txt"+alanAdi.ToString();
     txtAlan.Width=100;
     txtAlan.Height=30;
     this.Controls.Add(txtAlan); 
     System.Windows.Forms.Label lblAlan=new System.Windows.Forms.Label();
     lblAlan.Text=alanAdi.ToUpper();
     lblAlan.Left=200;
     lblAlan.Top=30*index;
     lblAlan.AutoSize=true;
     this.Controls.Add(lblAlan);
} 
private void btnKontrol_Click(object sender, System.EventArgs e)
{
     /* Aşağıdaki d&amp;ouml;ng&amp;uuml; ile dataTable nesnemizdeki DataColumn sayısı kadar d&amp;ouml;necek bir d&amp;ouml;ng&amp;uuml; oluşturuyoruz. Yanlık ID alanımız (0 indexli alan) değeri otomatik olarak atandığı i&amp;ccedil;in bu kontrol&amp;uuml; oluşturmamıza gerek yok. Bu nedenle d&amp;ouml;ng&amp;uuml;m&amp;uuml;z 1 den başlıyor. D&amp;ouml;ng&amp;uuml; her bir DataColumn nesnesi i&amp;ccedil;in, bu alanın adını parametre olarak alan ve ilgili textBox ve label nesnesini oluşturacak olan KontrolOlustur isimli metodu &amp;ccedil;ağırıyor.*/
     for(int i=1;i&amp;lt;dt.Columns.Count;++i)
     {
          KontrolOlustur(dt.Columns[i].ColumnName.ToString(),i);
     } 
     dgKayitlar.DataSource=dt; /* Burada dataGrid nesnemizin DataSource &amp;ouml;zelliğini DataTable nesnemiz ile ilişkilendirerek dataGrid'i oluşturduğumuz tabloya bağlamış oluyoruz. */ 
} 
private void btnKayıtEkle_Click(object sender, System.EventArgs e)
{
     /* Bu butona tıklandığında kullanıcının oluşturmuş olduğu kontrollere girdiği değerler, tablonun ilgili alanlarına ekleniyor ve sonu&amp;ccedil;lar DataGrid nesnemizde g&amp;ouml;steriliyor. */ 
     string kontrol;
     /* &amp;Ouml;ncelikle yeni bir dataRow nesnesi tanımlıyoruz ve DataTable sınıfına ait NewRow metodunu kullanarak dataTable'ımızın bellekte işaret ettiği tabloda, veriler ile doldurulmak &amp;uuml;zere boş bir satır a&amp;ccedil;ıyoruz. */
     DataRow dr;
     dr=dt.NewRow();
     /* Aşağıdaki d&amp;ouml;ng&amp;uuml; g&amp;ouml;z&amp;uuml;n&amp;uuml;ze korkutucu gelmesin. Yaptığımız işlem DataTable'daki alan sayısı kadar s&amp;uuml;recek bir d&amp;ouml;ng&amp;uuml;. Her bir alana, kullanıcının ilgili textBox'ta girdiği değeri eklemek i&amp;ccedil;in, dr[i] satırını kullanıyoruz. dr[i] dataRow nesnesinin temsil ettiği i indexli alana işaret ediyor. Peki ya i indexli bu DataRow alanının dataTable'daki hangi alana işaret ettiği nereden belli. İşte dt.NewRow() dediğimizde, dataTable'daki alanlardan oluşan bir DataRow yani satır oluşturmuş oluyoruz. Daha sonra yapmamız gereken ise textBox kontrol&amp;uuml;ndeki veriyi almak ve bunu DataRow nesnesindeki ilgili alana aktarmak. Bunun i&amp;ccedil;in formdaki t&amp;uuml;m kontroller taranıyor ve her bir kontrol acaba alanlar i&amp;ccedil;in oluşturulmuş TextBox nesnesi mi? ona bakılıyor. Eğer &amp;ouml;yleyse dataRow nesnesinin i indexli alanına bu kontrol&amp;uuml;n i&amp;ccedil;erdiği text aktarılıyor.*/
     for(int i=1;i&amp;lt;dt.Columns.Count;++i)
     {
          kontrol="txt"+dt.Columns[i].ColumnName.ToString();
          for(int j=0;j&amp;lt;this.Controls.Count;++j)
          {
               if(this.Controls[j].Name==kontrol)
               {
                    dr[i]=this.Controls[j].Text;
               }
          }
     }
     /* Artık elimizde i&amp;ccedil;indeki alanları bizim girdiğimiz veriler ile dolu bir DataRow nesne &amp;ouml;rneği var. Tek yapmamız gereken bunu dataTable nesnemizin Rows koleksiyonuna eklemek. Daha sonra ise dataGrid nesnemizi tazeleyerek g&amp;ouml;r&amp;uuml;nt&amp;uuml;n&amp;uuml;n yenilenmesini ve girdiğimiz satırın burada g&amp;ouml;r&amp;uuml;nmesini sağlıyoruz. */
     dt.Rows.Add(dr);
     .Refresh();
} &lt;/pre&gt;
&lt;p&gt;Şimdi&amp;nbsp;&amp;nbsp; programımızı deneyelim.&amp;nbsp; Ben &amp;ouml;rnek olarak Ad ,Soyad ve Birim&amp;nbsp; alanlarından oluşan bir tablo oluşturdum ve iki kayıt girdi.&amp;nbsp; İşte sonu&amp;ccedil;,&lt;/p&gt;
&lt;p class="MsoNormal" align="left"&gt;&lt;img src="/makale/images/mk14_1.gif" alt="" width="636" height="396" border="0" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" align="left"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 1. Programın &amp;ccedil;alışmasının sonucu.&amp;nbsp;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Geldik bir makalemizin daha sonuna. Bir sonraki makalemizde, DataRelation nesnesi yardımı ile birbirleri ilişkili tabloların nasıl oluşturulacağını g&amp;ouml;receğiz. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;</content>
  <pubDate>2003-12-05 12:00:00</pubDate>
  <slug>DataTable-Sc4b1nc4b1fc4b1nc4b1-Kullanarak-Programatik-Olarak-Tablolar-Olusturmak-2c2a0-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>datatable</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>