<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>.NET Remoting'i Kavramak</title>
  <description>Bu makalemizde, .net remoting sistemini anlamaya çalışacak ve .net remoting sistemini oluşturan temel yapılar üzerinde duracağız. Öncelikle .net remoting' in ne olduğunu ve ne işe yaradığını tanımlamakla işe başlılayım. Remoting sistemi, kısaca, farklı platformlarda çalışan uygulamalar arasında veri alışverişine imkan sağlayan bir sistemdir. Bu tanımda söz konusu olan platformlar farklı işletim sistemlerinin yer aldığı farklı ve birbirlerinden habersiz proseslerde çalışan uygulamaları içerebilir. Olayın en kilit noktasıda, farklı sistemlerin veri alışverişinde bulunabilmelerinin sağlanmasıdır.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, .net remoting sistemini anlamaya &amp;ccedil;alışacak ve .net remoting sistemini oluşturan temel yapılar &amp;uuml;zerinde duracağız. &amp;Ouml;ncelikle .net remoting' in ne olduğunu ve ne işe yaradığını tanımlamakla işe başlılayım. Remoting sistemi, kısaca, farklı platformlarda &amp;ccedil;alışan uygulamalar arasında veri alışverişine imkan sağlayan bir sistemdir. Bu tanımda s&amp;ouml;z konusu olan platformlar farklı işletim sistemlerinin yer aldığı farklı ve birbirlerinden habersiz proseslerde &amp;ccedil;alışan uygulamaları i&amp;ccedil;erebilir. Olayın en kilit noktasıda, farklı sistemlerin veri alışverişinde bulunabilmelerinin sağlanmasıdır.&lt;/p&gt;
&lt;p&gt;Konuyu daha iyi irdeleyebilmek amacıyla, Microsoft tarafından belirtilen şu &amp;ouml;rneği g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz. Bir pocket pc aygıtında, Windows CE işletim sistem &amp;uuml;zerinde, C# dili ile yazılmış bir uygulamamız olduğunu d&amp;uuml;ş&amp;uuml;nelim. Bu uygulama herhangibir par&amp;ccedil;ası olmadığı bir ağda yer alan bir uygulamanın ilgili metodlarını &amp;ccedil;ağırıyor olsun. Uzak network &amp;uuml;zerinde kurulu olan bu uygulama, Windows 2000 işletim sisteminde &amp;ccedil;alışan VB ile yazılmış ve başka bir sql sunucusunda yer alan bir takım bilgileri tedarik eden bir yapıya sahip olabilir. İşte .net remoting ile bu iki farklı uzak nesne arasında kolayca iletişim kurabilir ve veri alışverişini sağlayabiliriz.&lt;/p&gt;
&lt;p&gt;Remoting sisteminin bize vadettiği aslında, herhangibir zamanda, yerde ve aygıt &amp;uuml;zerinden bilgi erişimine izin verilebilmesidir. Bu aşağıdaki şekilde daha anlaşılır bir bi&amp;ccedil;imde ifade edilmeye &amp;ccedil;alışılmıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk71_1.gif" alt="" width="526" height="157" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 1. NET Remoting Sisteminde Temel Ama&amp;ccedil;&lt;/p&gt;
&lt;p&gt;Gelelim .net remoting sisteminin temel olarak nasıl &amp;ccedil;alıştığına ve nelere ihtiya&amp;ccedil; duyduğuna. &amp;Ouml;ncelikli olarak sistemde uzak sınırlarda yer alan nesnelerin olduğunu s&amp;ouml;yleyebiliriz. Bu nesneler arasında meydana getirilecek iletişim, .net remoting alt yapısında yer alan bir takım &amp;uuml;yeler ile sağlanacak. Herşeyden &amp;ouml;nce, uzak nesneler arasında hareket edicek mesajların taşınması işlemi ile, iletişim kanallarının (Communication Channels) ilgilendiğini s&amp;ouml;yleyebiliriz. Uzak nesneler arasındaki t&amp;uuml;m mesajlar bu kanal nesneleri yardımıyla taşınacak, kodlanacak (encoding) ve &amp;ccedil;&amp;ouml;z&amp;uuml;lecektir (decoding) . Kodlamaktan kastımız, uzak nesneler arasında taşınacak mesajların, kullanılan iletişim protokol&amp;uuml;n&amp;uuml;n tipine g&amp;ouml;re belli bir formatta serileştirilmesi (serialization)dir. Diğer yandan kodlanan bu mesajın aynı kurallar &amp;ccedil;evr&amp;ccedil;esinde diğer uzak nesne tarafından &amp;ccedil;&amp;ouml;z&amp;uuml;mlenmesi (decoding) gerekecektir. Zaten aradaki mesajların yaygın iletişim protokolleri &amp;uuml;zerinden ger&amp;ccedil;ekleştirilmesi, remoting'in en temel &amp;ouml;zelliklerinden birisidir.&lt;/p&gt;
&lt;p&gt;Bir iletişim kanalı nesnesi yardımıyla taşınan mesajlar, doğal .net serleştirici formatları (binary, soap) kullanılarak, kodlanır ve &amp;ccedil;&amp;ouml;z&amp;uuml;l&amp;uuml;rler. Bir uzak nesne, başka bir uzak nesneye mesaj g&amp;ouml;nderdiğinde, bu mesaj, kullanılan kanal nesnelerinin esas aldığı protokoller &amp;ccedil;er&amp;ccedil;evesinde serileştirilerek binary yada xml formatına d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;l&amp;uuml;r. Mesajı alan uzak nesne ise, serileştirilmiş bu mesajı uygun protokol tabanlı .net serileştirme formatlarını kullanarak a&amp;ccedil;ar ve kullanır. Serileştirme amacıyla kullanılan iki kodlama &amp;ccedil;eşidi vardır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk71_2.gif" alt="" width="469" height="271" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 2. Serileştirme Se&amp;ccedil;enekleri&lt;/p&gt;
&lt;p&gt;Gelelim diğer &amp;ouml;nemli bir konuya. Uzak nesneler nasıl kullanılacak. &amp;Ouml;zellikle server (Sunucu) nitelikli merkezi nesnelere, client (istemci) uygulamalardan nasıl erişilebilecek. Bunun i&amp;ccedil;in uzak nesnelere ait referanslara ihtiyacımız olucaktır. Ancak burada karşımıza adresleme sorunu &amp;ccedil;ıkacaktır. Nitekim, herhangibir proses i&amp;ccedil;inde &amp;ccedil;alışan bir nesne i&amp;ccedil;in, uzak nesnelerin &amp;ccedil;alıştığı prosesler anlamlı değildir. Bu sorunun aşılmasında kullanılabilecek ilk yol sunucu nesnesinin, istemcilere kopyalanmasıdır. Bu durumda istemci uygulama, sunucu nesnesinin bir &amp;ouml;rneğine ihtiya&amp;ccedil; duyduğunda bunu local olarak kullanabilecektir.&lt;/p&gt;
&lt;p&gt;Ancak kopylama y&amp;ouml;nteminin bir takım dezavantajları vardır. Herşeyden &amp;ouml;nce &amp;ccedil;ok sayıda metod i&amp;ccedil;eren b&amp;uuml;y&amp;uuml;k boyutlu nesnelerin kopylanması verimlilik ve performans a&amp;ccedil;ısından negatif bir etki yaratacaktır. Bununla birlikte, istemci uygulamalar, server nesnelerinin sadece belirli metodlarını kullanıyor olabilirler. Buda nesnenin tamamımın kopyalanmasının anlamsız olmasına neden olan bir diğer durumdur. Bir diğer dezavantaj ise, server nesnesinin bulunduğu sistemdeki fiziki adreslere referanslar i&amp;ccedil;erebiliecek olmasıdır. &amp;Ouml;rneğin dosya sistemine başvuruda bulunan nesneleri barındıran server nesneleri s&amp;ouml;z konusu olabilir. B&amp;ouml;yle bir durumda elbetteki kopyalama sonucu bu referanslar yitirilecek ve istemci tarafından kullanılamıyacaktır. Son olarak, server nesnesinin kopyalanmasının, istemci kaynaklarını harcadığını s&amp;ouml;yleyebiliriz.&lt;/p&gt;
&lt;p&gt;Bu dezavantajlar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında bize başka bir y&amp;ouml;ntem gerekmektedir. Bu teknikte, server nesnelerini kullanmak i&amp;ccedil;in, bu nesnelere referansta bulunan proxy nesneleri kullanılır. İstemci uygulama, bir uzak nesneye ihtiya&amp;ccedil; duyduğunda, bu talebini proxy nesnesine iletecektir. Proxy nesnesi ise, .net remoting'in sağlamış olduğu imkanlar dahilinde, ilgili uzak nesnesin ilgili &amp;uuml;yesinin referansına başvuracak, bu metodu &amp;ccedil;alıştıracak ve d&amp;ouml;nen sonu&amp;ccedil;ları yine proxy nesnesi aracılığıyla, istemci uygulamaya ulaştıracaktır. Bu konuyu aşağıdaki şekil ile daha net bir bi&amp;ccedil;imde zihnimizde canlandırabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk71_3.gif" alt="" width="439" height="222" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 3. Proxy Nesnesinin Kullanılması&lt;/p&gt;
&lt;p&gt;Remoting sisteminde kullanılan nesnelerin kopyalanabilmesi veya refarans olarak değerlendirilmesi, remoting nesnelerinin iki temel kategoriye ayrılmalarına neden olmuştur. Remotable nesneler ve NonRemotable nesneler. Remotable nesneler, Başka uygulamalarca kopyalanma veya referans tekniği ile erişilebilen nesnelerdir. NonRemotable nesneler ise, diğer uygulamalar tarafından erişilemiyen nesnelerdir. &amp;Ccedil;oğunlukla b&amp;uuml;y&amp;uuml;k boyutlu, &amp;ccedil;ok sayıda metod i&amp;ccedil;eren veya local olarak fiziki adres referanslarına ihtiya&amp;ccedil; duyan uzak nesnelerin, nonRemotable olarak belirtilmesi sık g&amp;ouml;r&amp;uuml;len bir tekniktir. Peki bu durumda bu nesneleri kullanmak isteyen uzak uygulamalar nasıl bir yol izleyebilir ? İşte bu noktada, nonRemotable nesnelerin, istemcilere a&amp;ccedil;ılabilecek olan b&amp;ouml;l&amp;uuml;mleri i&amp;ccedil;in remotable nesneler kullanılır.&lt;/p&gt;
&lt;p&gt;Diğer yandan remotable nesneler, kopylama veya referans taşımaya imkan veren uzak nesnelerdir. Burada ise karşımıza iki &amp;ccedil;eşit remotable nesne oluşumu &amp;ccedil;ıkar. Marshall By Value tipi remotable nesneler ve Marshall by Reference tipi remotable nesneler. Bu kategorilendirme şekilsel olarak aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk71_4.gif" alt="" width="475" height="304" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 4. Uzak Nesnelerin Temel Kategorilendirilmesi.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle remotable nesneler i&amp;ccedil;in yapılan ayrım kullanım a&amp;ccedil;ısından &amp;ccedil;ok &amp;ouml;nemlidir. Marshall By Value olarak belirlenmiş remotable nesneler, bir istemci tarafından talep edildiklerinde, &amp;ouml;zellikle bu nesnenin herhangibir metodu istemci tarafından &amp;ccedil;ağırıldığında, .net remoting sistemi bu nesnenin bir kopyasını oluşturur ve bu kopyayı iletşim kanal nesneleri yardımıyla serileştirerek, &amp;ccedil;ağrıyı yapan istemciye g&amp;ouml;nderir. İstemci tarafında yer alan, .net remoting sistemi ise bu kopyayı &amp;ccedil;&amp;ouml;z&amp;uuml;mler ve bir nesnenin bir kopyasını istemci makinede oluşturur. Nesnenin, istemciye kopyalanabilmesi i&amp;ccedil;in serileştirme işlemi uygulanır. Burada &amp;ouml;nemli olan nokta, serileştirmenin otomatik olarak ger&amp;ccedil;ekleştirilebilmesi i&amp;ccedil;in, nesneye ISerializable aray&amp;uuml;z&amp;uuml;n&amp;uuml;n uygulanmasıdır. Nesnelerin, istemcilere bu yolla taşınması &amp;ouml;zellikle istemciler a&amp;ccedil;ısından işlem zamanını kısaltıcı bir etken olarak karşımıza &amp;ccedil;ıkmaktadır. Nitekim istemcinin talep ettiği metodlara, artık istemcideki uzak nesnenin kopyası &amp;uuml;zerinden erişilmektedir.&lt;/p&gt;
&lt;p&gt;Marshall By Reference nesneleri ise, istemci uygulamalar i&amp;ccedil;in bu sistemlerde birer proxy nesnesi şeklinde oluşturulur. Bu proxy nesnesi, asıl uzak nesneye ilişkin referansları i&amp;ccedil;eren metadata bilgilerine sahiptir. Uzak nesnenin herhangibir metodu &amp;ccedil;ağırıldığında, proxy nesnesi ilgili metodun referansı ile hareket eder ve bir takım bilgileri sunucuya g&amp;ouml;nderir. Sunucu gelen bilgi paketini &amp;ccedil;&amp;ouml;z&amp;uuml;mledikten sonra ilgili parametreleri değerlendirerek talep edilen metodu &amp;ccedil;alıştırır ve bunun sonucu olarak geri d&amp;ouml;n&amp;uuml;ş değerlerini istemci makinedeki proxy nesnesine g&amp;ouml;nderir. Sonu&amp;ccedil;lar istemciye bu proxy nesnesi yardımıyla g&amp;ouml;nderilecektir.&lt;/p&gt;
&lt;p&gt;Bir uzak nesnenin herhangibir metodunun &amp;ccedil;ağırılmasında veya uzak nesneye ait bir &amp;ouml;rneğin istemcide new anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; ile oluşturulmaya &amp;ccedil;alışılmasında, uzak nesnenin davranış bi&amp;ccedil;imi ve aktifleştirilmesi &amp;ouml;nem kazanır. Nitekim uzak nesnenin aktif hale gelmesi iki teknik ile ger&amp;ccedil;ekleştirilebilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk71_5.gif" alt="" width="442" height="264" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 5. Nesne Etkinleştirme.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikle sunucu taraflı etkinleştirmeden bahsedelim. Bu etkinleştirme tekniğinde, istemci tarafından sunucu nesnesinin bir metodu &amp;ccedil;ağrıldığında, sunucu tarafından bu nesneye ait bir &amp;ouml;rnek oluşturulur. Daha sonrada bu nesne &amp;ouml;rneğinin proxy nesnesi, istemci tarafında oluşturulur. Burada dikkat &amp;ccedil;ekici nokta nesne &amp;ouml;rneğinin, new anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; ile değil, sunucu nesneye ait bir metod &amp;ccedil;ağırıldığında oluşturuluyor olmasıdır.&lt;/p&gt;
&lt;p&gt;Bu etkinleştirme tekniğine &amp;ouml;rnek olarak şunu g&amp;ouml;sterebiliriz. Devlet dairelerindeki sunuculara bağlı b&amp;uuml;rolar olduğunu d&amp;uuml;ş&amp;uuml;nelim. Sunucu nesnemiz, bu b&amp;uuml;rolara, vergi numarasına g&amp;ouml;re kontrol ve kimlik bilgisi değerlerini g&amp;ouml;nderiyor olsun. Bu &amp;ouml;rnekte b&amp;uuml;ro istemcilerinin, sunucuya s&amp;uuml;rekli bağlı olduklarını d&amp;uuml;ş&amp;uuml;nelim. İstemci, bir vergi numarasını kontrol etmek istediğinde, sunucu nesnesindeki ilgili metodu &amp;ccedil;ağıracaktır. İşte bu noktada sunucu taraflı etkinleştirme devereye girerek, metod &amp;ccedil;ağırımına karşılık sunucu nesnesinin &amp;ouml;rneğini oluşturur.&lt;/p&gt;
&lt;p&gt;Diğer yandan sunucu taraflı etkinleştirmede, Singleton ve SingleCall teknikleri kullanımaktadır. Singleton tekniğine g&amp;ouml;re etkinleştirmede, sunucu nesneyi kullanan ka&amp;ccedil; istemci olursa olsun, her bir istemcinin metod &amp;ccedil;ağırımları sunucu tarafındaki tek bir nesne &amp;ouml;rneği tarafından y&amp;ouml;netilmektedir. SingleCall tekniğinde ise, istemci tarafından yapılan her metod &amp;ccedil;ağırısına karşılık birer sunucu nesnesi &amp;ouml;rneği oluşturulacaktır.&lt;/p&gt;
&lt;p&gt;İstemci taraflı etkinleştirmeye gelince. Bu kez sunucu taraflı etkinleştirmenin aksine, new anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; ile bir sunucu nesne &amp;ouml;rneği istemci uygulamada oluşturulduğunda, sunucu &amp;uuml;zerinde sunucu nesnesinin &amp;ouml;rneği oluşturulacaktır. Bu tip kullanıma &amp;ouml;rnek olarak chat uygulamalarını g&amp;ouml;sterebiliriz.&lt;/p&gt;
&lt;p&gt;Remoting sisteminde uzak nesneler dışında en &amp;ouml;nemli unsur mesajları taşıyan kanal nesneleridir. (Channels) Kanal nesneleri uzak bilgisayarlarda yer alan uzak nesneler arasındaki haberleşmede rol oynayan kilit nesnelerdir. Aradaki iletişimi sağlamak i&amp;ccedil;in kullanılan kanal nesneleri, bu iletişim &amp;uuml;zerinden mesajların g&amp;ouml;nderilmesi, taşınması ve alınması gibi işlemlerden sorumludurlar. Bildiğiniz gibi kanal nesnelerinin taşıdığı mesajlar HTTP veya TCP protokolleri &amp;ccedil;er&amp;ccedil;evesinde hareket ederler. Bir kanal nesnesi yardımıyla, uzak kanallara mesaj g&amp;ouml;nderebilir yada uzak kanallardan gelen &amp;ccedil;ağrıları dinleyebiliriz.&lt;/p&gt;
&lt;p&gt;Bir uzak nesne, başka bir uzak nesneye mesaj g&amp;ouml;nderdiğinde, kanal nesneleri devreye girerek bu mesajı binary veya xml formatında serileştirir. Mesajı yani &amp;ccedil;ağrıyı alan uzak nesne ise, bu mesajın i&amp;ccedil;eriğini, buradaki kanalın mesajı binary veya xml formattan &amp;ccedil;&amp;ouml;z&amp;uuml;mlemesi ile okuyabilir. Remoting sisteminde kullanılan kanallara ilişkin sınıflar ve aray&amp;uuml;zler System.Runtime.Remoting.Channels isim alanında yer almaktadır.&lt;/p&gt;
&lt;p&gt;Temelde b&amp;uuml;t&amp;uuml;n kanal nesneleri IChannels aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamaktadır. Kanal nesneleri iletişimde oynayacakları role g&amp;ouml;re kategorilendirilirler. Eğer kanal nesnesi &amp;ccedil;ağrıları dinlemek amacıyla kullanılacaksa, alıcı (receiver) veya server (sunucu) olarak adlandırılırlar. Bununla birlikte, mesaj g&amp;ouml;ndericek olan kanal nesneleri sender (g&amp;ouml;nderici) veya client (istemci) olarak adlandırılırlar.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk71_6.gif" alt="" width="289" height="137" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 6. Kanallar.&lt;/p&gt;
&lt;p&gt;Receiver kanallar, IChannelSender aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulayan kanallardır. Kullandıkları protokollere g&amp;ouml;re HttpClientChannel ve TcpClientChannel sınıflarından oluşturulurlar. Diğer yandan Sender kanallar, IChannelReceiver aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulayan TcpServerChannel ve HttpServerChannel nesneleridir. Diğer &amp;ouml;nemli iki kanal nesnesi ise HttpChannel ve TcpChannel nesneleridir.&lt;/p&gt;
&lt;p&gt;Şimdi dilerseniz bu kanalların .net remoting sisteminde oynadıkları rolleri kısaca incelemeye &amp;ccedil;alışalım. Burada &amp;ouml;nemli olan, mesajlaşmanın ger&amp;ccedil;ekleştirileceği protokold&amp;uuml;r. Nitekim HTTP protokol&amp;uuml;n&amp;uuml; kullanacaksak buna uygun kanal nesnelerini kullanmalı, TCP protokol&amp;uuml;n&amp;uuml; kullanacaksakta buna uygun kanal nesnelerini kullanmalıyız. Eğer HTTP protokol&amp;uuml; kullanılacaksa, System.Runtime.Remoting.Channels.Http isim alanında yer alan kanal sınıflarını kullanırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk71_7.gif" alt="" width="478" height="136" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 7. Http Kanalları.&lt;/p&gt;
&lt;p&gt;İstemciden, uzak nesnelere mesaj g&amp;ouml;ndermek i&amp;ccedil;in HttpClientChannel sınıfına ait nesne &amp;ouml;rnekleri kullanılır. Diğer taraftan, istemcilerden gelicek &amp;ccedil;ağrıları dinleyecek kanal nesneleri ise, HttpServerChannel sınıfından &amp;ouml;rneklenir. HttpClient sınıfına ait nesne &amp;ouml;rnekleri ise mesaj almak ve mesaj g&amp;ouml;ndermek i&amp;ccedil;in kullanılırlar. HttpClientChannel nesne &amp;ouml;rnekleri oluşturulurken, bu kanalın kullanacağı bir port numarasını &amp;ouml;zellikle belirtmemiz gerekmez. Remoting sistemi o an i&amp;ccedil;in kullanılabilen serbest portlardan birisini bu kanal nesnesi i&amp;ccedil;in tahsis edecektir. Diğer yandan &amp;ccedil;ağrıları dinlemek amacıyla tanımlanan bir HttpServerChannel kanal nesnesinin belirli bir port numarası &amp;uuml;zerinden oluşturulması gerekmektedir. Şayet o an i&amp;ccedil;in kullanımda olan bir port belirlenirse &amp;ccedil;alışma zamanında istisna alırız. Bununla birlikte HttpServerChannel nesnesinin yapıcı metoduna 0 değerini g&amp;ouml;ndererek, port se&amp;ccedil;me insiyatifini otomatik olarak .net remoting sistemine bırakabiliriz.&lt;/p&gt;
&lt;p&gt;Http kanalları SoapFormatter sınıfını kullanarak, mesajları xml formatında serileştirirler. Bununka birlikte, TCP protokol&amp;uuml;n&amp;uuml; kullanan kanal nesneleri ise, serileştirme işlemini binary olarak yapar ve bunun i&amp;ccedil;inde BinaryFormatter sınıfını kullanırlar. TCP protokol&amp;uuml;n&amp;uuml; taban alan kanal nesneleri, System.Runtime.Remoting.Channels.Tcp isim alanında yer alan sınıflardan &amp;ouml;rneklenirler.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk71_8.gif" alt="" width="478" height="136" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 8. Tcp Kanalları.&lt;/p&gt;
&lt;p&gt;Tcp isim alanında yer alan sınıflar, Http'dekiler ile aynı işlevlere sahiptirler. Tek fark, kullanılan serileştirme işleminin farklı oluşudur. Her iki isim alanı i&amp;ccedil;inde, oluşturulan kanal nesne &amp;ouml;rneklerinin ChannelServices sınıfında yer alan static RegisterChannel metodu ile sisteme kayıt edilmeleri gerekmektedir.(Registiration)&lt;/p&gt;
&lt;p&gt;Kanallaların kullanımında dikkat edilmesi gereken en &amp;ouml;nemli nokta, uzak nesnelerin aynı protokol&amp;uuml; destekleyen kanalları kullanmalarının gerekli olduğudur. &amp;Ouml;rneğin, istemcilerden gelen &amp;ccedil;ağrıları dinlemek amacıyla Http protokol&amp;uuml;n&amp;uuml; taban alan kanal nesneleri kullanılıyorsa, istemcilerdede mesaj g&amp;ouml;ndermek i&amp;ccedil;in Http protokol&amp;uuml;n&amp;uuml; taban alan kanal nesneleri kullanılmalıdır. Nitekim farklı protokol tabanlı kanalların kullanılmasında istisnalar alırız. Bunun sebebi, farklı protokol kullanımının sonucu olarak kodlama ve &amp;ccedil;&amp;ouml;z&amp;uuml;mleme işlemlerinin farklı serileştirme teknikleri i&amp;ccedil;erisinde yapılıyor olmasıdır. Http ve Tcp kanalları arasındaki farkları şu şekilde &amp;ouml;zetleyebiliriz.&lt;/p&gt;
&lt;table id="table1" style="border-collapse: collapse; width: 100%;" border="1" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#c0c0c0" width="40" height="43"&gt;&lt;strong&gt; 1&lt;/strong&gt;&lt;/td&gt;
&lt;td height="43"&gt;Http kanal nesneleri Http protokol&amp;uuml;n&amp;uuml;, Tcp kanal nesneleri ise Tcp protokol&amp;uuml;n&amp;uuml; kullanır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#c0c0c0" width="40"&gt;&lt;strong&gt; 2&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Serileştirme işleminde, Http kanal nesneleri SoapFormatter sınıfını kullanırken, Tcp kanal nesneleri BinaryFormatter sınıfını kullanır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#c0c0c0" width="40"&gt;&lt;strong&gt; 3&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Http kanal nesneleri i&amp;ccedil;in serileştirme xml tabanlı yapılırken, Tcp kanal nesneleri i&amp;ccedil;in serileştirme binary formatta yapılır.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Bu makalemiz ile .net remoting sisteminin temel yapıtaşlarını tanımaya &amp;ccedil;alıştık. Bir sonraki makalemizde, en basit anlamda bir remoting uygulamasının nasıl yapıldığını incelemeye &amp;ccedil;alışacak ve teoride anlattıklarımızın programatik olarak nasıl yazılacağını g&amp;ouml;receğiz. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-05-22 09:00:00</pubDate>
  <slug>-NET-Remotingi-Kavramak-bsenyurt-com-dan</slug>
  <tags>
    <tag>net-remoting</tag>
    <tag>hello-world</tag>
    <tag>http</tag>
    <tag>tcp</tag>
    <tag>data-communication</tag>
  </tags>
  <categories>
    <category>.Net Remoting</category>
  </categories>
</post>