<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Binary Search Tree' yi Anlamak</title>
  <description>İkili ağaç yapısı basitliği ve hızlı sonuç üretimi açısından bakıldığında, arama algoritmalarından tutunda oyun programlamaya, ilişkisel veri tabanlarından, karmaşık matematik modellere kadar pek çok alanda kullanılmaktadır...</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2012%2f1%2foldradio.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;İnsan hafızası gizemli &amp;ccedil;alışan ama &amp;ccedil;oğu zamanda bizleri şaşırtan bir mekaniğe sahiptir. Doğduğumuz andan itibaren 3 yaşına kadar ge&amp;ccedil;en zaman dilimi i&amp;ccedil;erisinde g&amp;ouml;rsel olarak ne izlersek kaparız. Ancak neredeyse bunların hi&amp;ccedil; birini hatırlamayız.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ocukluğumuz, ergenliğimiz, yetişkinliğimiz, orta yaş halimiz ve yaşlılığımız. T&amp;uuml;m bu zaman dilimlerinde beynimiz s&amp;uuml;rekli olarak bir şeyleri hafıza da tutma ihtiyacı hisseder. Zaman zaman &amp;ouml;ğrendiğimiz pek &amp;ccedil;ok bilgiyi kolayca unutur ve ihtiyacımız olduğunda hatırlamakta zorlanırız. Ama kimi bilgilerde bilin&amp;ccedil; altımıza neredeyse kazınır ve ge&amp;ccedil;erli bir sağlık problemi oluşmadığı s&amp;uuml;rece hi&amp;ccedil; unutmayız&lt;em&gt;(&amp;Ccedil;arpım tablosu, matematik d&amp;ouml;rt işlemin nasıl yapıldığı veya hangi ışıkta durulması gerektiği gibi)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Peki kolayca unutabileceğimiz bilgiler nasıl oluşurlar?&amp;nbsp;&lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Genelde &amp;ouml;ğrendiklerimizi &amp;ccedil;ok sık kullanmadığımız veya tekrar etmediğimiz durumlarda unutmak ka&amp;ccedil;ınılmaz ger&amp;ccedil;eklerden birisidir. Kullanmama s&amp;uuml;resi arttığında ise, ihtiya&amp;ccedil; duyulduğu anda s&amp;ouml;z konusu bilgileri tekrardan hatırlamak da giderek zorlaşmaktadır. Aslında &amp;ccedil;ok sık kullanılmayan ama yaşamın herhangibir anında ihtiya&amp;ccedil; duyabileceğimiz bilgileri yazarak bir yerlerde saklamak, m&amp;uuml;cadele etme yollarından birisidir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin &amp;Uuml;niversitede okutulan veri yapıları ve algoritmalar derslerini d&amp;uuml;ş&amp;uuml;nelim. &amp;Ouml;ğrenmek, kavrayabilmek, kodlarını geliştirebilmek i&amp;ccedil;in epey kafa patlattığımız zorlayıcı bu i&amp;ccedil;erikler, kolayca unutulabilecek cinstendir&amp;nbsp;&lt;img title="Frown" src="/editors/tiny_mce3/plugins/emotions/img/smiley-frown.gif" alt="Frown" border="0" /&gt; Tabi eğer bunları her d&amp;ouml;nem anlatan bir akademisyen veya s&amp;uuml;rekli matematik modeller geliştiren bir uzman değilseniz. Eğer ki,&lt;strong&gt; .Net Framework, Java EE, SAP&lt;/strong&gt; gibi ortamları kullanarak ağırlıklı olarak veri odaklı uygulamalar geliştiriyorsanız, zaten bu ders i&amp;ccedil;eriğinin yakınından &amp;ccedil;ok nadir olarak ge&amp;ccedil;ersiniz. İşte ben de bu hafıza kaybını yaşadığım şu d&amp;ouml;nemlerde, eski bilgilerimi hatırlamaya &amp;ccedil;alışmak istedim. İlk g&amp;ouml;z&amp;uuml;me kestirdiğim konu ise &lt;strong&gt;ikili ağa&amp;ccedil; yapısı(Binary Tree)&lt;/strong&gt; ve bunun &amp;uuml;zerinden arama, ekleme gibi temel işlemlerin nasıl yapıldığı oldu?&lt;/p&gt;
&lt;p&gt;İkili ağa&amp;ccedil; yapısı basitliği ve hızlı sonu&amp;ccedil; &amp;uuml;retimi a&amp;ccedil;ısından bakıldığında, arama algoritmalarından tutunda oyun programlamaya, ilişkisel veri tabanlarından, karmaşık matematik modellere kadar pek &amp;ccedil;ok alanda kullanılmaktadır. &lt;strong&gt;Binary Tree&lt;/strong&gt; veri yapısı ve bu yapı &amp;uuml;zerinde ger&amp;ccedil;ekleştirilecek &amp;ccedil;eşitli operasyonlar&lt;em&gt;(arama, ekleme, silme gibi)&lt;/em&gt; g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında ilk etapta bu ağacın nasıl oluşturulduğunun kavranması gerekmektedir. Aslında ikili ağa&amp;ccedil;lar, şirketlerin organizasyon ağacına benzer bir i&amp;ccedil;eriğe sahiptirler. Tabi teknik olarak d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde bu ağacı oluşturmanın bazı kuralları vardır. Şimdi gelin teknik terim karmaşası i&amp;ccedil;erisine girmeden konuyu bir &amp;ouml;rnek &amp;uuml;zerinde kavramaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;p&gt;Elimizde ş&amp;ouml;yle bir sayı dizisi olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: large;"&gt;&lt;strong&gt;7,4,9,1,3,10,12,8,5,6,9,11&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;Şimdi bu rakamsal dizinin &lt;strong&gt;Binary Tree &lt;/strong&gt;grafiğini oluşturmaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;p&gt;İlk olarak 7 rakamından başlayıp, bunun &lt;strong&gt;K&amp;ouml;k Boğum(Root Node)&lt;/strong&gt; olduğunu d&amp;uuml;ş&amp;uuml;nerekten en başa yerleştirelim. Ardınan ikinci rakama ge&amp;ccedil;elim. İkinci rakam, ilk rakam olan 7' ye bağlı olmak durumda. Bir başka deyişle onun &lt;strong&gt;alt boğumu/&amp;ccedil;ocuk boğumu(Child Node)&lt;/strong&gt; olacak. 4, 7' den k&amp;uuml;&amp;ccedil;&amp;uuml;k bir rakam. Bu sebepten onu sol alt tarafa alalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2012%2f1%2fbt1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;3nc&amp;uuml; rakamımız ise 9. Root Node ile karşılaştırdığımızda ondan b&amp;uuml;y&amp;uuml;k olduğunu g&amp;ouml;r&amp;uuml;yoruz. Bu y&amp;uuml;zden onu 7nin sağ alt node' u olacak şekilde grafiğimize yerleştirelim.&lt;img src="/pics/2012%2f1%2fbt2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hımmm...&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Demek ki bir kuralımız var.&lt;strong&gt; "Bir node değeri eğer bağlı olduğu node' un i&amp;ccedil;indeki değerden k&amp;uuml;&amp;ccedil;&amp;uuml;kse onun solunda, değilse sağında yer alıyor olmalı."&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;4nc&amp;uuml; rakamdan devam edelim.1, root node olan 7den k&amp;uuml;&amp;ccedil;&amp;uuml;k. Dolayısıyla sol dalda yer almalı. Ancak sol dalda 4 değeri de var. 1, 4ten k&amp;uuml;&amp;ccedil;&amp;uuml;k olduğundan ve az &amp;ouml;nce bahsettiğimiz kuraldan dolayı sol alt node olarak grafiğe eklenmeli.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2012%2f1%2fbt3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;5nci rakamımız ise 3. Yine Root Node' dan aşağıya doğru inmeye başlıyoruz. Kuralımıza g&amp;ouml;re 3, 7den k&amp;uuml;&amp;ccedil;&amp;uuml;k ve onun sol dalında yer almalı. Bir alt seviyeye indiğimizde 4 ile karşılaşılıyor. 3, 4ten k&amp;uuml;&amp;ccedil;&amp;uuml;k olduğu i&amp;ccedil;in kuralımıza g&amp;ouml;re sol alt node olmalı ama yol devam ediyor. &amp;Ccedil;&amp;uuml;nk&amp;uuml; sol alt node' da 1 var. 3, 1den b&amp;uuml;y&amp;uuml;k olduğu i&amp;ccedil;in kuralımıza g&amp;ouml;re sağ alt node' olmalı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2012%2f1%2fbt4.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;6ncı rakamımız 10. 10, root node olan 7den b&amp;uuml;y&amp;uuml;k olduğu i&amp;ccedil;in kuralımıza g&amp;ouml;re sağ dalda yer almalı. Sağ daldan aşağıya doğru indiğimizde 1nci seviyede 9 olduğunu g&amp;ouml;r&amp;uuml;yoruz. 10, 9dan b&amp;uuml;y&amp;uuml;k olduğu i&amp;ccedil;in sağ alt node' unda yer almalı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2012%2f1%2fbt5n.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;7nci rakamımız 12. Yine Root Node ile kıyaslayarak başladığımızda kuralımıza g&amp;ouml;re sağ dalda olması gerekiyor. 12, 9 dan b&amp;uuml;y&amp;uuml;k olduğu i&amp;ccedil;in sağ daldan inmeye devam ediyor ve yine 10dan b&amp;uuml;y&amp;uuml;k olduğu i&amp;ccedil;in sağ alt node olarak 3nc&amp;uuml; seviyedeki yerini alıyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2012%2f1%2fbt6.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;8nci elemanımız ise 8. Root node olan 7den b&amp;uuml;y&amp;uuml;k olduğu i&amp;ccedil;in sağ daldan aşağıya doğru akması gerekiyor. Yol &amp;uuml;st&amp;uuml;nde ilk olarak karşılaştığı 9dan k&amp;uuml;&amp;ccedil;&amp;uuml;k olduğu i&amp;ccedil;inse sol alt node olarak 2nci seviyedeki yerini alıyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/2012-1-bt12.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;9ncu elemanımız 5. Root Node olan 7den k&amp;uuml;&amp;ccedil;&amp;uuml;k olduğu i&amp;ccedil;in kuralımıza g&amp;ouml;re sol daldan aşağıya doğru kaydırılması gerekiyor. 1nci seviyede karşılaştığımız 4ten b&amp;uuml;y&amp;uuml;k bir değer olduğu i&amp;ccedil;inse sağ alt node olarak 2nci seviyedeki yerini alıyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/2012-1-bt11.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;10ncu elemanımız 9. Ancak 9 zaten rakam dizimizde bir kez kullanıldı ve bir kere daha kullanılmaması gerekiyor. Hımm...&amp;Ouml;yleyse bir kural daha ortaya &amp;ccedil;ıkıyor.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;"Zaten dizide var olan bir elemanı ağa&amp;ccedil;a tekrardan ekleyemeyiz."&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizde yer alan son elemanımız ise 11. Yine root node ile başladığımızda 7den b&amp;uuml;y&amp;uuml;k olduğu i&amp;ccedil;in kuralımıza g&amp;ouml;re sağ dalda yer alması gerekiyor. Rakamı sağ daldan aşağıya doğru kaydırdığımızda, 1nci seviyedeki 9dan b&amp;uuml;y&amp;uuml;k olduğunu g&amp;ouml;r&amp;uuml;yoruz. Buna g&amp;ouml;re sağ daldan devam edilmeli. Sıradaki 10 rakamından da b&amp;uuml;y&amp;uuml;k olduğundan yine sağ dalda kalmalı. Sonradan gelen 12 rakamından k&amp;uuml;&amp;ccedil;&amp;uuml;k olduğu i&amp;ccedil;inse sol alt dal olarak son seviyede yerini almalı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/2012-1-bt9n.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Daha başka sayımız kalmadığı i&amp;ccedil;in Binary Tree grafiğini tamamlamış bulunuyoruz. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Root Node' dan aşağıda doğru inen ağa&amp;ccedil; yapısında &lt;strong&gt;her boğuma en fazla iki boğum bağlanabilmektedir&lt;/strong&gt;&lt;em&gt;(Zaten Binary denmesinin sebebi de budur &lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt;)&lt;/em&gt;. Bunun temel sebebi ise b&amp;uuml;y&amp;uuml;k ve k&amp;uuml;&amp;ccedil;&amp;uuml;k olma durumuna g&amp;ouml;re ilgili boğumun sağ veya sol alt boğum olarak grafiğe ekleniyor olmasıdır. Tabi bunun dışında zaten ağa&amp;ccedil; i&amp;ccedil;erisinde yer almış bir elemanın tekrardan yer almaması gerekliliği ortaya konulmuştur. Dallar haricinde aslında boğumlar belirli seviyelere denk gelirler. T&amp;uuml;m bu bilgiler ışığında sayı dizisinin &lt;strong&gt;Binary Tree&lt;/strong&gt; grafiği aşağıdaki nihai halini alır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/2012-1-bt10n.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Peki bu tip bir ağa&amp;ccedil; yapısını programatik ortamda tasarlamak istersek?&lt;/p&gt;
&lt;p&gt;Aslında bu ağa&amp;ccedil; yapısı i&amp;ccedil;erisinde dolaşmak bile başlı başına bir iş. Kağıt &amp;uuml;zerinde her ne kadar kolay olsa da teorik olarak bunun bilinen 3 y&amp;ouml;ntemi bulunmaktadır. &lt;strong&gt;Traverse &lt;/strong&gt;adı verilen bu dolaşım teknikleri InOrder&lt;em&gt;(Sol dalı dolaş, root' a uğra, sağ dalı dolaş)&lt;/em&gt;, PreOrder&lt;em&gt;(Root' dan başla, sol dalı yukarıdan aşağı gez, sol dalı yukarıdan aşağı gez) &lt;/em&gt;ve PostOrder&lt;em&gt;(Sol dalı aşağıdan yukarı tara, sağ dalı aşağıdan yukarı tara, root' a uğra) &lt;/em&gt;olarak ge&amp;ccedil;mektedir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Ne yazık ki &lt;strong&gt;.Net Framework&lt;/strong&gt; tarafında&lt;strong&gt; Binary Tree&lt;/strong&gt; yapısını destekleyen hazır bir tip ve &amp;ouml;zellikle koleksiyon bulunmamaktadır. Dolayısıyla bunu kendimiz oluşturmak durumundayız. Biraz uğraştırıcı olsa da buna hizmet edecek bir geliştirme yapabiliriz. Bize iki temel tip gerekmektedir. Birincisi ağa&amp;ccedil; yapısındaki her bir boğumu temsil edecek olan tiptir. Bu tip bir Node' un değerini, kendinden sonraki Sol ve Sağ Node' ları ve bağlı olduğu Parent Node' u bilecek şekilde tasarlanmalıdır. Yani aşağıdaki gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2012%2f1%2fbt13.png" alt="" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class BinaryTreeNode&amp;lt;T&amp;gt;
{
	public T Value { get; set; }
	public BinaryTreeNode&amp;lt;T&amp;gt; ParentNode { get; set; }
	public BinaryTreeNode&amp;lt;T&amp;gt; LeftNode { get; set; }
	public BinaryTreeNode&amp;lt;T&amp;gt; RightNode { get; set; }
	public bool IsRoot { get { return ParentNode == null; } }
	public bool IsLeaf { get { return LeftNode == null &amp;amp;&amp;amp; RightNode == null; } }

	public BinaryTreeNode(T RealValue)
	{
		Value = RealValue;
	}

	public BinaryTreeNode(T RealValue, BinaryTreeNode&amp;lt;T&amp;gt; Parent)
	{
		Value = RealValue;
		ParentNode = Parent;
	}

	public BinaryTreeNode(T RealValue, BinaryTreeNode&amp;lt;T&amp;gt; Parent, BinaryTreeNode&amp;lt;T&amp;gt; Left, BinaryTreeNode&amp;lt;T&amp;gt; Right)
	{
		Value = RealValue;
		RightNode = Right;
		LeftNode = Left;
		ParentNode = Parent;
	}
}&lt;/pre&gt;
&lt;p&gt;Bu basit bir tip. Asıl &amp;ouml;nemli olan ağacın grafiğini kodsal olarak sembolize edecek, Add, Remove ve Traverse gibi işlemlerini yapacak olan tipi geliştirmek. Onu da biraz uğraştıktan sonra aşağıdaki gibi yazabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2012%2f1%2fbt14.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;BinaryTree &lt;/strong&gt;sınıfı &lt;strong&gt;generic &lt;/strong&gt;olarak tasarlanmış ve &lt;strong&gt;ICollection&amp;lt;T&amp;gt;&lt;/strong&gt; ile &lt;strong&gt;IEnumerable&amp;lt;T&amp;gt;&lt;/strong&gt; &lt;strong&gt;aray&amp;uuml;zlerini(Interface)&lt;/strong&gt; uygulamıştır. Bu nedenle zorunlu olarak ezmesi gereken bazı &amp;uuml;yeleri vardır. Ayrıca &lt;strong&gt;BinaryTree&lt;/strong&gt; i&amp;ccedil;erisinde yer alacak olan &lt;strong&gt;BinaryTreeNode&lt;/strong&gt; nesne &amp;ouml;rneklerinin en azından değer bazında karşılaştırma yapılabilir olması gerekmektedir. Nitekim değerlerin bibirlerinden b&amp;uuml;y&amp;uuml;k ve k&amp;uuml;&amp;ccedil;&amp;uuml;k olma durumlarına g&amp;ouml;re bir yerleştirme ve arama s&amp;ouml;z konusudur. Bu y&amp;uuml;zden bir de generic &lt;strong&gt;Constraint &lt;/strong&gt;konularak &lt;strong&gt;T&lt;/strong&gt; tipinin &lt;strong&gt;IComparable&amp;lt;T&amp;gt; &lt;/strong&gt;aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulama zorunluluğu konulmuştur. Sınıfımıza ait kodlar ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class BinaryTree&amp;lt;T&amp;gt; 
        : ICollection&amp;lt;T&amp;gt;, IEnumerable&amp;lt;T&amp;gt; 
        where T : IComparable&amp;lt;T&amp;gt;
{
	public BinaryTreeNode&amp;lt;T&amp;gt; RootNode { get; set; }
	public int NodeCount { get; set; }
	public bool IsEmpty { get { return RootNode == null; } }

	// Ağa&amp;ccedil; i&amp;ccedil;erisindeki en k&amp;uuml;&amp;ccedil;&amp;uuml;k değerli elemanı d&amp;ouml;nd&amp;uuml;r&amp;uuml;r
	public T MinValue
	{
		get
		{
			if (IsEmpty)
				throw new Exception("Ağa&amp;ccedil; i&amp;ccedil;erisinde hi&amp;ccedil; bir eleman yok");
			BinaryTreeNode&amp;lt;T&amp;gt; tempNode = RootNode;

			while (tempNode.LeftNode != null) // Sol dallarda değer olduğu s&amp;uuml;rece dolaş
				tempNode = tempNode.LeftNode;
			
			return tempNode.Value;
		}
	}

	// Ağa&amp;ccedil; i&amp;ccedil;erisindeki en b&amp;uuml;y&amp;uuml;k değerli elemanı d&amp;ouml;nd&amp;uuml;r&amp;uuml;r
	public T MaxValue
	{
		get
		{
			if (IsEmpty)
				throw new Exception("Ağa&amp;ccedil; i&amp;ccedil;erisinde hi&amp;ccedil; bir eleman yok");

			BinaryTreeNode&amp;lt;T&amp;gt; tempNode = RootNode;
			while (tempNode.RightNode != null) // Sağ dallarda değer olduğu s&amp;uuml;rece dolaş
				tempNode = tempNode.RightNode;
			
			return tempNode.Value;
		}
	}

	// Ka&amp;ccedil; eleman olduğunu d&amp;ouml;nd&amp;uuml;r&amp;uuml;r
	public int Count
	{
		get { return NodeCount+1; }
	}

	public BinaryTree(BinaryTreeNode&amp;lt;T&amp;gt; Root)
	{
		RootNode = Root;
		NodeCount = 0;
	}

	public IEnumerator&amp;lt;T&amp;gt; GetEnumerator()
	{            
		foreach (BinaryTreeNode&amp;lt;T&amp;gt; tempNode in Traversal(RootNode))
			yield return tempNode.Value; // &amp;Ccedil;ok ş&amp;uuml;k&amp;uuml;rki 2.0 ile gelen yield keyword' &amp;uuml; var :)
	}

	IEnumerator IEnumerable.GetEnumerator()
	{
		foreach (BinaryTreeNode&amp;lt;T&amp;gt; tempNode in Traversal(RootNode))
			yield return tempNode.Value;
	}

	// Koleksiyona eleman ekleyebilmek i&amp;ccedil;in kullanılır
	public void Add(T SourceItem)
	{
		if (RootNode == null)
		{
			RootNode = new BinaryTreeNode&amp;lt;T&amp;gt;(SourceItem);
			NodeCount++;
		}
		else if(Contains(SourceItem))
			return;
		else
			Insert(SourceItem);
	}

	public void Clear()
	{
		RootNode = null;
	}

	// Koleksiyonda T tipinden olan eleman olup olmadığını araştırır
	public bool Contains(T SourceItem)
	{
		if (IsEmpty)
			return false;

		BinaryTreeNode&amp;lt;T&amp;gt; tempNode = RootNode;
		while (tempNode != null)
		{
			int comparedValue = tempNode.Value.CompareTo(SourceItem);

			if (comparedValue == 0)
				return true;
			else if (comparedValue &amp;lt; 0)
				tempNode = tempNode.LeftNode;
			else
				tempNode = tempNode.RightNode;
		}

		return false;
	}

	// Koleksiyon i&amp;ccedil;eriğinin aynı tipten bir Array' e kopyalar
	public void CopyTo(T[] TargetArray, int IndexNo)
	{
		T[] tempArray = new T[NodeCount+1];
		int Counter = 0;
		foreach (T value in this)
		{
			tempArray[Counter] = value;
			Counter++;
		}
		Array.Copy(tempArray, 0, TargetArray, IndexNo, this.NodeCount);
	}

	// Koleksiyondan eleman &amp;ccedil;ıkartmak i&amp;ccedil;in kullanılır
	public bool Remove(T SourceItem)
	{
		BinaryTreeNode&amp;lt;T&amp;gt; item = Find(SourceItem);
		if (item == null)
			return false;

		List&amp;lt;T&amp;gt; values = new List&amp;lt;T&amp;gt;();
		foreach (BinaryTreeNode&amp;lt;T&amp;gt; tempNode in Traversal(item.LeftNode))
			values.Add(tempNode.Value);

		foreach (BinaryTreeNode&amp;lt;T&amp;gt; tempNode in Traversal(item.RightNode))
			values.Add(tempNode.Value);

		if (item.ParentNode.LeftNode == item)
			item.ParentNode.LeftNode = null;
		else
			item.ParentNode.RightNode = null;

		item.ParentNode = null;
		foreach (T value in values)
			Add(value);

		return true;
	}

	public bool IsReadOnly
	{
		get { return false; }
	}

	BinaryTreeNode&amp;lt;T&amp;gt; Find(T SourceItem)
	{
		foreach (BinaryTreeNode&amp;lt;T&amp;gt; item in Traversal(RootNode))
			if (item.Value.Equals(SourceItem))
				return item;

		return null;
	}

	// InOrder modeline g&amp;ouml;re elemanlar dolaşılır.
	IEnumerable&amp;lt;BinaryTreeNode&amp;lt;T&amp;gt;&amp;gt; Traversal(BinaryTreeNode&amp;lt;T&amp;gt; Node)
	{
		if (Node.LeftNode != null)
			foreach (BinaryTreeNode&amp;lt;T&amp;gt; leftNode in Traversal(Node.LeftNode))
				yield return leftNode;
		
		yield return Node;
		
		if (Node.RightNode != null)
			foreach (BinaryTreeNode&amp;lt;T&amp;gt; rightNode in Traversal(Node.RightNode))
				yield return rightNode;
	}

	void Insert(T SourceItem)
	{
		BinaryTreeNode&amp;lt;T&amp;gt; tempNode = RootNode;
		bool found = false;
		while (!found)
		{
			int comparedValue = tempNode.Value.CompareTo(SourceItem);
			if (comparedValue &amp;lt; 0)
			{
				if (tempNode.LeftNode == null)
				{
					tempNode.LeftNode = new BinaryTreeNode&amp;lt;T&amp;gt;(SourceItem, tempNode);
					NodeCount++;
					return;
				}
				else
				{
					tempNode = tempNode.LeftNode;
				}
			}
			else if (comparedValue &amp;gt; 0)
			{
				if (tempNode.RightNode == null)
				{
					tempNode.RightNode = new BinaryTreeNode&amp;lt;T&amp;gt;(SourceItem, tempNode);
					NodeCount++;
					return;
				}
				else
				{
					tempNode = tempNode.RightNode;
				}
			}
			else
			{
				return;
			}
		}
	}
}&lt;/pre&gt;
&lt;p&gt;Artık yeni tiplerimizi denemeye &amp;ccedil;ıkabiliriz. Bu ama&amp;ccedil;la program kodunda aşağıdaki test kodları g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class Program
{
	static void Main(string[] args)
	{
		BinaryTree&amp;lt;int&amp;gt; numbers = new BinaryTree&amp;lt;int&amp;gt;(new BinaryTreeNode&amp;lt;int&amp;gt;(7));

		numbers.Add(4);
		numbers.Add(9);
		numbers.Add(1);
		numbers.Add(3);
		numbers.Add(10);
		numbers.Add(12);
		numbers.Add(8);
		numbers.Add(5);
		numbers.Add(6);
		numbers.Add(9);
		numbers.Add(11);

		Console.WriteLine("{0} eleman aktarıldı", numbers.Count);

		foreach (int number in numbers)
			Console.WriteLine(number);

		Console.WriteLine("{0} değeri koleksiyonda {1}",5,numbers.Contains(5)?"Var":"Yok");

		Console.WriteLine("Max {0} Min {1}",numbers.MaxValue,numbers.MinValue);
		
		int[] array = new int[numbers.Count];
		numbers.CopyTo(array, 0);
	}
}&lt;/pre&gt;
&lt;p&gt;Temel olarak koleksiyonumuza eklediğimiz temel operasyonlardan bazılarını kullanmaya &amp;ccedil;alıştık. Uygulamanın &lt;strong&gt;Runtime &lt;/strong&gt;&amp;ccedil;ıktısı aşağıdakine benzer olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2012%2f1%2fbt15.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabi kodda g&amp;ouml;zden ka&amp;ccedil;ırdığım bazı noktalar olabilir. Ben elimden geldiğince test etsem de farklı g&amp;ouml;zlerin bakmasında yarar var. Ancak temel olarak &lt;strong&gt;Binary Tree&lt;/strong&gt; veri yapısını, C# ile nasıl kodlanabileceğini kavradığınızı d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2012%2f1%2fBinarySearchTree.zip"&gt;BinarySearchTree.zip (42,36 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2012-01-09 11:01:00</pubDate>
  <slug>Binary-Search-Tree-yi-Anlamak</slug>
  <tags>
    <tag>binary-tree</tag>
    <tag>binary-search-tree</tag>
    <tag>tree-node</tag>
    <tag>data-structures</tag>
    <tag>algorithms</tag>
  </tags>
  <categories>
    <category>Algoritma</category>
    <category>C#</category>
    <category>Data Structures, Algorithms</category>
  </categories>
</post>