<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Server Side SponsorShip</title>
  <description>Bir önceki makalemizde Remoting mimarisinde istemci taraflı destek modelini incelemeye çalışmıştık. İstemci taraflı destek modelinin en büyük problemlerinden birisi, istemcilerin firewall arkasında olması halinde ortaya çıkmaktadır. Bu engel, sunucuların istemcilere erişimini kısıtlayacağından istemci taraflı destek modelinin çalışması garanti altına alınmamış olabilir. Bu nedenle, istemcilerin firewall arkasında olup olmadıklarının bilinmediği durumlarda kesinlikle sunucu taraflı destek (server side sponsorship) modeli kullanılmalıdır. Bu makalemizde sunucu taraflı destek modelinin işleyiş şeklinden bahsedecek ve örnek bir uygulama geliştireceğiz.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki makalemizde Remoting mimarisinde istemci taraflı destek modelini incelemeye &amp;ccedil;alışmıştık. İstemci taraflı destek modelinin en b&amp;uuml;y&amp;uuml;k problemlerinden birisi, istemcilerin firewall arkasında olması halinde ortaya &amp;ccedil;ıkmaktadır. Bu engel, sunucuların istemcilere erişimini kısıtlayacağından istemci taraflı destek modelinin &amp;ccedil;alışması garanti altına alınmamış olabilir. Bu nedenle, istemcilerin firewall arkasında olup olmadıklarının bilinmediği durumlarda kesinlikle sunucu taraflı destek (server side sponsorship) modeli kullanılmalıdır. Bu makalemizde sunucu taraflı destek modelinin işleyiş şeklinden bahsedecek ve &amp;ouml;rnek bir uygulama geliştireceğiz.&lt;/p&gt;
&lt;p&gt;İlk olarak modelin teorisinden birazda olsa bahsetmekte fayda var. Sunucu taraflı destek modelinde, uzak nesne haricinde bu nesnenin kiralama s&amp;uuml;resini kontrol eden ve gerektiğinde otomatik olarak uzatan bir destek nesnesi(Sponsor Object) vardır. Yanlız bu sponsor nesne sunucu tarafında olduğu i&amp;ccedil;in, istemci tarafından bir şekilde &amp;ccedil;ağırılabilmeli ve kullanılabilmelidir. Dolayısıyla uzak nesnenin kiralama s&amp;uuml;resini kontrol eden sponsor nesnemizde aslında bir uzak nesnedir. Yani MarshallByRefObject tipinden t&amp;uuml;retilmiştir. Diğer taraftan bu sponsor nesnenin, uzak nesne referansına ait kiralama s&amp;uuml;resini, sunucu tarafında kontrol edebilmesi i&amp;ccedil;in ayrıca ISponsor aray&amp;uuml;z&amp;uuml;n&amp;uuml;de uygulaması gerekmektedir. Bildiğiniz gibi ISponsor aray&amp;uuml;z&amp;uuml;n&amp;uuml;n sağladığı Renewal metodu ile kiralama s&amp;uuml;releri uzatılabilir.&lt;/p&gt;
&lt;p&gt;Peki istemci tarafındaki uygulamalar uzak nesnenin kiralama s&amp;uuml;resini kontrol eden bu sponsor nesnesini nasıl kullanmalıdır? İstemci, uzak nesnesine ait kiralama s&amp;uuml;resinin &amp;ouml;mr&amp;uuml;n&amp;uuml; kontrol edecek uzak sponsor nesnesinide belirli aralıklarla ele alabilmelidir. Bu ama&amp;ccedil;la, istemci uygulama &amp;uuml;zerinde sadece uzak sponsor' u belirli periyotlarla kontrol eden ve ayrı bir thread i&amp;ccedil;erisinde &amp;ccedil;alışacak başka bir sınıf daha gereklidir. Bu sınıf i&amp;ccedil;erisinde belirli zaman aralıklarında, uzak sponsor nesnesine ait herhangibir &amp;uuml;ye metod &amp;ccedil;ağırılır. Buradaki ama&amp;ccedil;, istemci tarafından bir şekilde uzak sponsor nesnesini aktif olarak tutmaktır. Nitekim, uzak nesne kiralama s&amp;uuml;resinin y&amp;ouml;netecek olan referans sunucu &amp;uuml;zerinde duran sponsor nesne referansıdır.&lt;/p&gt;
&lt;p&gt;Model biraz karışık g&amp;ouml;r&amp;uuml;nebilir. Ancak &amp;ouml;rneğimizi geliştirirken &amp;ccedil;ok daha net anlaşılabileceğini d&amp;uuml;ş&amp;uuml;nmekteyim. Dilerseniz hi&amp;ccedil; vakit kaybetmeden &amp;ouml;rneğimizi geliştirelim. İşe hem sunucu hemde istemci uygulamamızın ortak olarak kullanacağı class library' yi tasarlamakla başlayalım. Bu k&amp;uuml;t&amp;uuml;phane i&amp;ccedil;erisinde, hem uzak nesnemiz, hem de uzak sponsor nesnemiz i&amp;ccedil;in gerekli interface tanımlamalarını yapacağız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk157_1.gif" alt="" width="447" height="218" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Runtime.Remoting.Lifetime;

namespace RemoteFace
{
    public interface IRemoteObject
    {
        double Toplam(double x, double y);
    }

    public interface ISponsorObject:ISponsor 
    {
        void CanliKal();
    }
}&lt;/pre&gt;
&lt;p&gt;IRemoteObject isimli aray&amp;uuml;z&amp;uuml;m&amp;uuml;z (interface), uzak nesnemiz i&amp;ccedil;in gerekli prototipi sunmaktadır. Bu k&amp;uuml;t&amp;uuml;phanede asıl &amp;ouml;nemli olan aray&amp;uuml;z ise ISponsorObject aray&amp;uuml;z&amp;uuml;m&amp;uuml;zd&amp;uuml;r. Bu aray&amp;uuml;z&amp;uuml;m&amp;uuml; ayrıca ISponsor aray&amp;uuml;z&amp;uuml;nden de t&amp;uuml;rettik. B&amp;ouml;ylece sponsor nesnemizin hem ISponsorObject aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamasını hem de, kiralama y&amp;ouml;netimi i&amp;ccedil;in gerekli olan ve ISponsor aray&amp;uuml;z&amp;uuml;nden gelen Renewal metodunu uygulamasını sağlamış olacağız. Burada &amp;ouml;zellikle interface' leri kullanmamızın nedeni bildiğiniz gibi, istemci uygulamanın sunucu tarafındaki uzak nesnelerin sağladığı metodlarda olacak değişikliklerden etklilenmemesini sağlamaktır. &amp;Ouml;yleki biz istemci tarafında bu aray&amp;uuml;zleri kullanarak uzak nesne ve sponsorumuza ait referansları &amp;ccedil;ağırabileceğiz. Polimirfizim (Polymorphsym) sağolsun. Gelelim sunucu tarafına. Sunucu tarafımızdaki uygulamamızda uzak nesnemizi ve uzak sponsor nesnemizi aşağıdaki gibi oluşturacağız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk157_2.gif" alt="" width="474" height="318" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Uzak Nesne Sınıfımız;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class RemoteObj:MarshalByRefObject,IRemoteObject 
{
    public RemoteObj()
    {
        Console.WriteLine("Uzak nesne &amp;ouml;rneği oluşturuldu " + DateTime.Now.ToString());
    }
    #region IRemoteObject Members

    public double Toplam(double x, double y)
    {
        return x + y;
    }

    #endregion
}&lt;/pre&gt;
&lt;p&gt;Uzak Sponsor Sınıfımız;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class ServerSponsor:MarshalByRefObject,ISponsorObject
{
    public ServerSponsor()
    {
        Console.WriteLine("Uzak sponsor nesne oluşturuldu " + DateTime.Now.ToString());
    }

    #region ISponsorObject Members

    public void CanliKal()
    {
        Console.WriteLine("Canli kal metodu &amp;ccedil;ağırıldı " + DateTime.Now.ToString());
    }

    #endregion

    #region ISponsor Members

    public TimeSpan Renewal(System.Runtime.Remoting.Lifetime.ILease lease)
    {
        Console.WriteLine("Uzak nesne i&amp;ccedil;in kiralama s&amp;uuml;resi yenilendi " + DateTime.Now.ToString());
        return TimeSpan.FromSeconds(6);
    }

    #endregion
}&lt;/pre&gt;
&lt;p&gt;Uzak nesne sınıfımızdan ziyade, uzak sponsor nesne sınıfımızın işleyişi bizim i&amp;ccedil;in &amp;ccedil;ok daha &amp;ouml;nemlidir. Dikkat ederseniz, sponsor sınıfımızın i&amp;ccedil;erisinde bir iş yapmayan CanliKal isimli bir metod vardır. Bu metodu istemci tarafında yer alan başka bir sınıfımız kullanacak. Bunu biraz sonra a&amp;ccedil;ıklamakta fayda var. Sponsor sınıfımızın Renewal metodu kiralama s&amp;uuml;resini 6 saniye kadar uzatıyor. Peki bu kimin kiralama s&amp;uuml;resi? İşte istemci tarafında yer alacak kodlarımızda, bu sponsor nesnesinin ele alacağı Lease Manager' ı se&amp;ccedil;erken, uzak nesnenin kiralama y&amp;ouml;neticisini ele alıp sponsor nesnemize g&amp;ouml;ndereceğiz. Bir başka deyişle, uzak nesnemizin kiralama y&amp;ouml;neticisine, sponsor nesnemizi register edeceğiz. B&amp;ouml;ylece uzak nesnenin kiralama s&amp;uuml;resini, sunucu &amp;uuml;zerindeki sponsor nesne &amp;ouml;rneğimiz &amp;uuml;stlenmiş olacak. Vakit kaybetmeden sunucu uygulamamızın kodlarını ve konfigurasyon dosyasını aşağıdaki gibi geliştirelim.&lt;/p&gt;
&lt;p&gt;Server;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
    RemotingConfiguration.Configure(@"..\\..\\ServerApp.config",true);
    Console.WriteLine("Sunucu dinlemede...");
    Console.ReadLine();
}&lt;/pre&gt;
&lt;p&gt;ServerApp.config&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.runtime.remoting&amp;gt;
        &amp;lt;application&amp;gt;
            &amp;lt;channels&amp;gt;
                &amp;lt;channel ref="tcp" port="4378"&amp;gt;
                    &amp;lt;serverProviders&amp;gt;
                        &amp;lt;formatter ref="binary" typeFilterLevel="Full" /&amp;gt;
                    &amp;lt;/serverProviders&amp;gt;
                &amp;lt;/channel&amp;gt;
            &amp;lt;/channels&amp;gt;
            &amp;lt;service&amp;gt;
                &amp;lt;wellknown type="Server.RemoteObj,Server" objectUri="RemObj" mode="Singleton"/&amp;gt;
                    &amp;lt;wellknown type="Server.ServerSponsor,Server" objectUri="RemSpn" mode="Singleton"/&amp;gt;
            &amp;lt;/service&amp;gt;
            &amp;lt;lifetime leaseTime="6" renewOnCallTime="2" leaseManagerPollTime="1"/&amp;gt;
        &amp;lt;/application&amp;gt;
    &amp;lt;/system.runtime.remoting&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Dikkat ederseniz, hem uzak nesnemiz hemde sponsor nesnemiz i&amp;ccedil;in ayrı ayrı SAO (Server Activated Object) tipinde ve Singleton modeline uygun tanımlamalar yapıyoruz. Sunucu &amp;uuml;zerinde &amp;ccedil;alışacak uzak nesnelerimiz i&amp;ccedil;in ge&amp;ccedil;erli kiralama s&amp;uuml;relerinide lifetime boğumunda (node) belirtmekteyiz. Elbette, buradaki kiralama s&amp;uuml;releri t&amp;uuml;m referanslar i&amp;ccedil;in ge&amp;ccedil;erli olacaktır. Yani hem uzak nesnemiz hemde sponsor nesnemiz i&amp;ccedil;in. Dilerseniz bu referansların kiralama s&amp;uuml;relerini ayrı ayrıda tanımlayabilirsiniz. Bunun i&amp;ccedil;in tek yapmanız gereken InitializeLifetimeService metodunu uzak nesne sınıfları i&amp;ccedil;erisinde override etmektir.&lt;/p&gt;
&lt;p&gt;Gelelim istemci tarafındaki kodlara. Sunucu taraflı sponsor kullanımına ait teoriden bahsederken, istemci tarafında sunucu &amp;uuml;zerindeki sponsor referansını d&amp;uuml;zenli olarak tetikleyecek bir sınıf olacağından bahsetmiştik. İşte bu sınıfımızı istemci uygulamamızda aşağıdaki gibi geliştireceğiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk157_3.gif" alt="" width="305" height="223" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;PollingObject&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class PollingObject
{
    private bool _canliBirak;
    private ISponsorObject _sponsorObject;

    public bool CanliBirak
    {
        get { return _canliBirak; }
        set { _canliBirak = value; }
    } 

    public PollingObject(ISponsorObject sponsorObject)
    {
        _canliBirak = true;
        _sponsorObject = sponsorObject;
        Thread currTrd=new Thread(this.CanliTut);
        currTrd.Start();
    }

    public void CanliTut()
    {
        while (CanliBirak)
        {
            _sponsorObject.CanliKal();
            Thread.Sleep(2000);
        } 
    }
}&lt;/pre&gt;
&lt;p&gt;PollingObject isimli sınıfımızın en b&amp;uuml;y&amp;uuml;k &amp;ouml;zelliği, &amp;ouml;rneği oluşturulurken parametre olarak ISponsorObject tipinden bir nesne alması. Bu &amp;ccedil;alışma zamanında bizim oluşturacağımız uzak sponsor nesne &amp;ouml;rneğimiz (ServerSponsor) olacaktır. Basit olarak yapıcı metod bu nesne &amp;ouml;rneğini kullanacak CanliTut isimli metodu, ayrı bir thread i&amp;ccedil;erisinde ve CanliBirak isimli &amp;ouml;zellik değeri true olduğu m&amp;uuml;ddet&amp;ccedil;e, &amp;ccedil;ağıracaktır. Bu metodun &amp;ccedil;ağırılması ile, istemci tarafından kullanılan uzak nesneye ait kiralama s&amp;uuml;resinin, sunucu &amp;uuml;zerindeki sponsor nesne &amp;ouml;rneği tarafından kontrol altına alınması sağlanmış olunur. İşleyişi istemci uygulamamızın kodları &amp;ccedil;ok daha iyi anlatmaktadır.&lt;/p&gt;
&lt;p&gt;Client&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
    RemotingConfiguration.Configure("..\\..\\ClientApp.config", true);
    
    IRemoteObject remObj = (IRemoteObject)Activator.GetObject(typeof(IRemoteObject), "tcp://manchester:4378/RemObj");

    #region Server Side Sponsor Kullanılmaya Başlanır

    ISponsorObject spnObj = (ISponsorObject)Activator.GetObject(typeof(ISponsorObject), "tcp://manchester:4378/RemSpn");

    PollingObject pllObj = new PollingObject(spnObj);

    ILease il = (ILease)((MarshalByRefObject)remObj).GetLifetimeService();
    il.Register(spnObj);

    #endregion

    for (int i = 0; i &amp;lt; 8; i++)
    {
        Console.WriteLine(remObj.Toplam(i, i + 1).ToString());
        System.Threading.Thread.Sleep(4000);
    }
    Console.WriteLine("Metodlar sonlandırıldı...");
    il.Unregister(spnObj);
    pllObj.CanliBirak = false;
    Console.WriteLine("Programı kapatmak i&amp;ccedil;in bir tuşa basın...");
    Console.ReadLine();
}&lt;/pre&gt;
&lt;p&gt;İlk olarak uzak nesnemizi (RemoteObject) kullanabilmemizi sağlayacak IRemoteObject referansı elde edilir. Ardından aynı yol ile ISponsorObject referansı elde edilir. Sonrasında ise PollingObject tipimize ait bir nesne &amp;ouml;rneğini oluşturuyoruz. İşte bu andan itibaren, parametre olarak g&amp;ouml;nderdiğimiz spnObj aray&amp;uuml;z&amp;uuml; ile sunucu &amp;uuml;zerindeki sponsor nesne referansını kullanmaya başlıyoruz. İzleyen satırda, uzak nesne &amp;ouml;rneğini referans eden remObj' nin kiralama y&amp;ouml;neticisini ILease aray&amp;uuml;z&amp;uuml;ne atıyoruz. İşte can alıcı nokta burası. ILease referansına, sunucu &amp;uuml;zerinde yer alan sponsor nesnemizi kayıt ediyoruz. Dolayısıyla, PollingObject i&amp;ccedil;erisinde ayrı bir iş par&amp;ccedil;acığı olarak &amp;ccedil;alışan CanliTut isimli metod 2 saniyelik aralıklarla uzak sponsor nesne referansının CanliKal metodunu &amp;ccedil;ağırmaya başlıyor. Bu &amp;ccedil;ağırılar sonucu uzak nesnenin kiralama s&amp;uuml;reside, ILease referansını unregister edip, CanliTut metodunun işleyişini CanliBirak isimli &amp;ouml;zelliğe false değerini atayıp kesinceye kadar, uzamaya devam ediyor. Kısacası, istemcinin kullandığı uzak nesnenin kiralama s&amp;uuml;resinin y&amp;ouml;netimini, sunucu &amp;uuml;zerinde yer alan ve istemci tarafından belirli periyotlarla kontrol edilen uzak sponsor nesne referansına devretmiş oluyoruz. Uygulamamızı test etmeden &amp;ouml;nce, istemci tarafındaki konfigurasyon dosyasınıda aşağıdaki gibi oluşturalım.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.runtime.remoting&amp;gt;
        &amp;lt;application&amp;gt;
            &amp;lt;channels&amp;gt;
                &amp;lt;channel ref="tcp"&amp;gt;
                    &amp;lt;clientProviders&amp;gt;
                        &amp;lt;formatter ref="binary" /&amp;gt;
                    &amp;lt;/clientProviders&amp;gt;
                &amp;lt;/channel&amp;gt;
            &amp;lt;/channels&amp;gt;
            &amp;lt;client&amp;gt;
                &amp;lt;wellknown type="RemoteFace.IRemoteObject,RemoteFace" url="tcp://manchester:4378/RemObj/"/&amp;gt;
                &amp;lt;wellknown type="RemoteFace.ISponsorObject,RemoteFace" url="tcp://manchester:4378/RemSpn/"/&amp;gt;
            &amp;lt;/client&amp;gt;
        &amp;lt;/application&amp;gt;
    &amp;lt;/system.runtime.remoting&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Şimdi olayı iyice analiz edebilmek i&amp;ccedil;in client tarafındaki kodlarımızda sponsor nesne ile ilgili olan kısımları kaldırıp &amp;ccedil;alıştıracağız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
    RemotingConfiguration.Configure("..\\..\\ClientApp.config", true);
    
    IRemoteObject remObj = (IRemoteObject)Activator.GetObject(typeof(IRemoteObject), "tcp://manchester:4378/RemObj");

    for (int i = 0; i &amp;lt; 8; i++)
    {
        Console.WriteLine(remObj.Toplam(i, i + 1).ToString());
        System.Threading.Thread.Sleep(4000);
    }
    Console.WriteLine("Metodlar sonlandırıldı...");
    Console.WriteLine("Programı kapatmak i&amp;ccedil;in bir tuşa basın...");
    Console.ReadLine();
}&lt;/pre&gt;
&lt;p&gt;Kullandığımız uzak nesne &amp;ouml;rneğini SAO olarak Singleton modunda tasarlamıştık. Bununla birlikte uzak nesne i&amp;ccedil;in varsayılan kiralama s&amp;uuml;relerinide belirtmiştik. İstemci tarafı peş peşe uzak nesne metodlarını &amp;ccedil;ağırdığında, her kiralama s&amp;uuml;resi sonlandıktan sonra sunucu &amp;uuml;zerinde yeni bir referansın oluşturulmuş olması gerekmektedir. Yani yapıcı metodların birden fazla kez &amp;ccedil;ağırılması durumu s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk157_4.gif" alt="" width="498" height="563" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi, uzak nesne &amp;ouml;rneğine ait kiralama s&amp;uuml;releri sona erdik&amp;ccedil;e yeni uzak nesne referansları sunucu &amp;uuml;zerinde oluşturulmuştur. Ancak Sponsor kodlarımızı tekrardan uygulamaya dahil edersek aşağıdaki sonu&amp;ccedil;ları elde ederiz.&lt;em&gt;(Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; flash formatında olup, flash player y&amp;uuml;klemenizi gerektirebilir...)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;object id="obj1" width="509" height="573" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/ServerSponsor2.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="509" height="573" src="http://www.buraksenyurt.com/makale/images/ServerSponsor2.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj1" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;Bu sefer, uzak nesne &amp;ouml;rneğimize ait tek bir referans t&amp;uuml;m uygulama boyunca yaşamaktadır. &amp;Ccedil;&amp;uuml;nk&amp;uuml; uzak sponsorumuz kiralama s&amp;uuml;relerini otomatik olarak yenilemektedir. Sunucu taraflı destek kontrol&amp;uuml; uygulanış a&amp;ccedil;ısından zor g&amp;ouml;r&amp;uuml;nsede istemci taraflı destek modelinin bazı dezavantajlarını ortadan kaldırmaktadır. &amp;Ouml;rneğin FireWall engellerini. Bu y&amp;uuml;zdende remoting uygulamalarında sık&amp;ccedil;a tercih edilen bir y&amp;ouml;ntemdir. B&amp;ouml;ylece geldik bir makalemizin daha sonuna bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/ServerSideSponsors.rar"&gt;&amp;Ouml;rnek kod i&amp;ccedil;in tıklayınız.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2006-04-19 12:00:00</pubDate>
  <slug>Server-Side-SponsorShip-bsenyurt-com-dan</slug>
  <tags>
    <tag>net-remoting</tag>
  </tags>
  <categories>
    <category>.Net Remoting</category>
  </categories>
</post>