<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>GoLang - Static Web İçeriği ve JSON Üretimi</title>
  <description>Bir önceki yazımızda yönlendiricileri tanımaya çalışmış ve github üzerinden sunulan httpRouter paketini kullanarak dinamik HTML içeriği ürettiğimiz bir örnek geliştirmiştik. HttpRouter paketi oldukça ilgimi çekti ve çeşitli örnekler ile konuyu pekiştirmeye çalıştım. Bu yeni örneğimizde static web içeriğini ve gelen taleplere göre JSON bazlı çıktı üretecek yönlendirme işlemlerini ele almaya çalışacağız. Başrol oyuncusu olarak yine Star Wars dünyasından bir kaç modeli kullanmaya gayret edeceğiz. Bu kez şu adresten yararlandığımı ifade edebilirim.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/06/gorouting_6.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki yazımızda web programlamada &amp;ouml;nemli bir yere sahip olan y&amp;ouml;nlendiricileri(Router) tanımak adına github &amp;uuml;zerinden sunulan httpRouter paketini kullanarak dinamik HTML i&amp;ccedil;eriği &amp;uuml;rettiğimiz bir &amp;ouml;rnek geliştirmiştik. Bu hafta i&amp;ccedil;inde HttpRouter paketi hakkında &amp;ouml;ğrendiklerimi &amp;ccedil;eşitli &amp;ouml;rnekler ile pekiştirmeye &amp;ccedil;alıştım. Bu sefer hem static web i&amp;ccedil;eriğinin hem de talebe g&amp;ouml;re JSON formatlı veri sunumu yapacak dinamiklerin yer alacağı konu &amp;uuml;zerinde durdum. Web programlama konusunda acemi olduğum i&amp;ccedil;in &amp;ouml;rneği sonuca ulaştırırken takıldığım bir ka&amp;ccedil; nokta da oldu. Yazımızda bu konulara da değinmeye &amp;ccedil;alışacağım.&lt;/p&gt;
&lt;p&gt;Bu tip &amp;ouml;rneklerde işe yarar bir veri k&amp;uuml;mesi ile &amp;ccedil;alışmak her zaman i&amp;ccedil;in tercih ettiğim y&amp;ouml;ntemlerden birisi. Hatırlıyorum da Microsoft'un bu alanda olduk&amp;ccedil;a başarılı veri k&amp;uuml;meleri bulunuyordu. AdventureWorks ve Northwind veritabanları bize yıllarca yardımcı oldu. Eminim ki &amp;ccedil;oğumuzun kobay taboları vardır. Product ve Category gibi. Ben bu &amp;ouml;rneğimizde kendi hafif veri setimi bellekte konuşlandırdım. Pratik geldi :) Başrol oyuncusu olarak Star Wars d&amp;uuml;nyasından bir ka&amp;ccedil; modeli kullanmaya &amp;ccedil;alıştım. Kategori bazlı olacak şekilde bu evrendeki ara&amp;ccedil;ları basit nitelikleri ile ele aldım. Bu kez &lt;a href="http://www.blastr.com/2015-9-11/v-wing-millennium-falcon-50-best-star-wars-vehicles-ranked" target="_blank"&gt;şu adresten&lt;/a&gt; yararlandım.&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;Entity İ&amp;ccedil;eriğini Paket Olarak Tutmak&lt;/h1&gt;
&lt;p&gt;&amp;Ouml;nceki &amp;ouml;rnekten farklı olarak bu kez kullanacağımız entity tiplerini ayrı bir paket i&amp;ccedil;erisinde toplamaya karar verdim. Sistemimde y&amp;uuml;kl&amp;uuml; olan GOPATH bilgisine g&amp;ouml;re c:\go works\samples\src klas&amp;ouml;r&amp;uuml; altında aşağıdaki hiyerarşiyi kurguladım.&lt;/p&gt;
&lt;p&gt;- entity&lt;br /&gt;- entity\starwars&lt;br /&gt;- entity\starwars\starwars.go&lt;/p&gt;
&lt;p&gt;Bundan sonra sistemde kullanacağım başka entity&amp;nbsp;tipleri olursa burada alt klas&amp;ouml;rler i&amp;ccedil;erisinde toplamayı d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Bir paketi oluşturduğumuzda bunun GOPATH'in tanımladığı lokasyonlarda inşa edilmesi olduk&amp;ccedil;a &amp;ouml;nemli. Aksi takdirde ilgili paket sistemde bulunamaz ve dolayısıyla kullanılamaz. starwars.go i&amp;ccedil;eriğini aşağıdaki gibi oluşturabiliriz. Model ve Category isimli iki yapı barındırıyor.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package starwars

type Model struct {
	Id       int
	Title    string
	Price    float32
	Category Category
}

type Category struct {
	Id   int
	Name string
}&lt;/pre&gt;
&lt;p&gt;Paketi LiteIDE ile oluşturup build edebiliriz. Sonrasında pkg klas&amp;ouml;r&amp;uuml;nde build edilmiş i&amp;ccedil;eriğin ikili&lt;em&gt;(binary)&lt;/em&gt; formattaki &amp;ccedil;ıktısını g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/gorouting_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Artık makinedeki diğer go &amp;ouml;rneklerimizde entity/starwars şeklinde paket tanımlayıp kullanabiliriz.&lt;/p&gt;
&lt;h1&gt;&amp;Ouml;rneğin Klas&amp;ouml;r Yapısı&lt;/h1&gt;
&lt;p&gt;Uygulamamızda statik web i&amp;ccedil;eriğini ve REST tadındaki GET taleplerini karşılayacak y&amp;ouml;nlendirmeleri bir arada sunacağız. Burada dikkat edilmesi gereken nokta statik i&amp;ccedil;eriğin bir alt alanda oluşturulması. Aksi halde joker karakter kullanımı&lt;em&gt;(*filepath şeklinde olan)&lt;/em&gt; t&amp;uuml;m y&amp;ouml;nlendirme taleplerini karşılayacağından build işleminde hata alırız. Bu y&amp;uuml;zden &amp;ouml;rneğin klas&amp;ouml;r yapısını aşağıdaki gibi oluşturabiliriz.&lt;/p&gt;
&lt;p&gt;-\&lt;br /&gt;-\main.go&lt;br /&gt;-\static&lt;br /&gt;-\static\index.html&lt;br /&gt;-\static\cover.jpg&lt;br /&gt;-\static\common.css&lt;/p&gt;
&lt;p&gt;Static klas&amp;ouml;r&amp;uuml; tahmin edeceğiniz &amp;uuml;zere alt alanımız olarak g&amp;ouml;rev yapacak.&lt;/p&gt;
&lt;h1&gt;&amp;Ouml;n Hazırlıklar&lt;/h1&gt;
&lt;p&gt;main.go i&amp;ccedil;eriğine ge&amp;ccedil;meden &amp;ouml;nce static klas&amp;ouml;r&amp;uuml;ndeki index.html ve common.css i&amp;ccedil;eriklerini tasarlayalım. A&amp;ccedil;ılış sayfası gibi d&amp;uuml;ş&amp;uuml;nebileceğimiz index.html i&amp;ccedil;eriği şu şekildedir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;
&amp;lt;head&amp;gt;
	&amp;lt;title&amp;gt;Starwars Models&amp;lt;/title&amp;gt;
	&amp;lt;link rel="stylesheet" href="common.css"&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body&amp;gt;
	&amp;lt;h1&amp;gt;My Starwars Collection&amp;lt;/h1&amp;gt;
	&amp;lt;img src="cover.gif"/&amp;gt;
	&amp;lt;p&amp;gt;This is a JSON based data service&amp;lt;br&amp;gt;Try this url : &amp;lt;a href="/category/fighter"&amp;gt;category/fighter&amp;lt;/a&amp;gt;&amp;lt;/p&amp;gt;
	&amp;lt;a href="/category"&amp;gt;All Categories&amp;lt;/a&amp;gt;
&amp;lt;/body&amp;gt;&lt;/pre&gt;
&lt;p&gt;ve common.css&lt;/p&gt;
&lt;pre class="brush:css;auto-links:false;toolbar:false" contenteditable="false"&gt;body{
	border:3px solid #BA4A00;
	border-radius: 16px;
	border-width: 10px;
	text-align: center;
	width: 420px;
	height: 500px;
	margin: auto;
	font-family:Tahoma, sans-serif;
	font-size:18px;
	color:#212F3D;
}&lt;/pre&gt;
&lt;p&gt;Sonu&amp;ccedil;ta aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki gibi bir i&amp;ccedil;erik oluşturmaya &amp;ccedil;alışıyoruz. Benim i&amp;ccedil;in &amp;ouml;rneği biraz daha keyifli hale getirdiğini s&amp;ouml;yleyebilirim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/gorouting_9.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edilmesi gereken nokta index.html'e ulaşırken http://localhost:4569/static&amp;nbsp;adresi &amp;uuml;zerinden gidiyor olmamız. main paketinde&amp;nbsp;buna g&amp;ouml;re bir kodlama yapacağız.&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;main.go&lt;/h1&gt;
&lt;p&gt;Nihayet yazımızın en &amp;ouml;nemli kısmına geldik. İşte main paketimize ait&amp;nbsp;kodlarımız.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"encoding/json"
	"entity/starwars"
	"fmt"
	"net/http"
	"strings"

	"github.com/julienschmidt/httprouter"
)

func main() {
	router := httprouter.New()

	router.ServeFiles("/static/*filepath", http.Dir("static"))
	router.GET("/category", GetCategories)
	router.GET("/category/:name", GetModelsByCategoryName)

	http.ListenAndServe(":4569", router)
}

func GetCategories(response http.ResponseWriter, request *http.Request, params httprouter.Params) {
	c, _ := loadDataSet()
	cJson, _ := json.Marshal(c)
	response.Header().Set("Content-Type", "application/json")
	response.WriteHeader(200)
	fmt.Fprintf(response, "%s", cJson)
}

func GetModelsByCategoryName(response http.ResponseWriter, request *http.Request, params httprouter.Params) {
	_, models := loadDataSet()
	var result []starwars.Model
	for _, m := range models {
		if strings.ToLower(m.Category.Name) == strings.ToLower(params.ByName("name")) {
			result = append(result, m)
		}
	}
	cJson, _ := json.Marshal(result)
	response.Header().Set("Content-Type", "application/json")
	response.WriteHeader(200)
	fmt.Fprintf(response, "%s", cJson)
}

func loadDataSet() (categories []starwars.Category, models []starwars.Model) {
	fighter := starwars.Category{Id: 1, Name: "Fighter"}
	cruiser := starwars.Category{Id: 2, Name: "Cruiser"}

	vwing := starwars.Model{Id: 1, Title: "V-Wing Fighter", Price: 45.50, Category: fighter}
	n1 := starwars.Model{Id: 2, Title: "Naboo N-1 Starfighter", Price: 250.45, Category: fighter}
	republicCruiser := starwars.Model{Id: 3, Title: "Republic Cruiser", Price: 450.00, Category: cruiser}
	attackCruiser := starwars.Model{Id: 4, Title: "Republic Attack Cruiser", Price: 950.00, Category: cruiser}
	eta2 := starwars.Model{Id: 5, Title: "ETA-2 Jedi Starfighter", Price: 650.50, Category: fighter}
	delta7 := starwars.Model{Id: 6, Title: "Delta-7 Jedi Starfighter", Price: 250.35, Category: fighter}
	bwing := starwars.Model{Id: 7, Title: "B-Wing", Price: 195.50, Category: fighter}
	ywing := starwars.Model{Id: 8, Title: "Y-Wing", Price: 45.50, Category: fighter}
	monCalamari := starwars.Model{Id: 9, Title: "Mon Calamari Star Crusier", Price: 1500.00, Category: cruiser}

	categories = append(categories, fighter, cruiser)
	models = append(models, vwing, n1, republicCruiser, attackCruiser, eta2, delta7, bwing, ywing, monCalamari)

	return categories, models
}&lt;/pre&gt;
&lt;p&gt;JSON &amp;ccedil;ıktısı &amp;uuml;reteceğimiz i&amp;ccedil;in encoding/json, web sunucusu dinlemesi yapacağımız i&amp;ccedil;in net/http, y&amp;ouml;nlendirme işlemleri i&amp;ccedil;in github.com/julienschmidt/httprouter, k&amp;uuml;&amp;ccedil;&amp;uuml;k harfe &amp;ccedil;evirerek kıyaslama yapmak i&amp;ccedil;in strings, star wars tiplerini kullanmak i&amp;ccedil;in entity/starwars ve son olarak Fprintf fonksiyonlliği ile HTML&amp;nbsp;&amp;ccedil;ıktısını oluşturmak i&amp;ccedil;in fmt paketlerini kullandığımızı s&amp;ouml;yleyelim.&lt;/p&gt;
&lt;p&gt;En sonda yer alan loadDataSet fonksiyonu Category ve Model tipinden slice &amp;ouml;rnekleri oluşturup d&amp;ouml;nd&amp;uuml;r&amp;uuml;yor. Onunla ilgili olarak s&amp;ouml;yleyebileceğimiz en g&amp;uuml;zel şey n sayıda parametre d&amp;ouml;nd&amp;uuml;ren fonksiyonlara&amp;nbsp;bir &amp;ouml;rnek olması. append &amp;ccedil;ağrıları&amp;nbsp;ile n sayıda tipi ilave ettiğimiz de dikkatten ka&amp;ccedil;mamalı. main fonksiyonu i&amp;ccedil;erisinde Router nesnesini &amp;ouml;rnekleyerek işe başıyoruz. Bu sefer bir &amp;ouml;nceki yazımızda ele aldığımız GET &amp;ccedil;ağrıları dışında ServeFiles isimli bir kullanım da s&amp;ouml;z konusu. Bu fonksiyon ilk parametre olarak statik sayfalarımızı tuttuğumuz adreslemeyi alıyor. *filepath kullanımına dikkat etmek lazım. Case-Sensitive bir ifade olduğunu belirtelim. * işareti nedeniyle ikinci parametre ile bildirilen klas&amp;ouml;rdeki her dosyanın ele alınacağını bildiriyoruz. Bu tanımlama ile static adresine gelecek taleplerin hangi fiziki adresten karşılanacağını belirtmiş olduk. ServeFiles bildiriminde&amp;nbsp;daha geniş imkanlara da sahibiz. Nitekim statik dosyaların ele alınması sırasında araya girip HTTP paketine m&amp;uuml;dahale edebilir Header kısımlarını kurcalayabiliriz&amp;nbsp;&lt;em&gt;(&lt;a href="https://github.com/julienschmidt/httprouter/issues/40" target="_blank"&gt;Şu adresteki tartışmayı&lt;/a&gt; incelemenizi &amp;ouml;neririm. Statik sayfalarda Cache-Control header bilgisinin nasıl ilave edilebileceği incelenmiş)&lt;/em&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Eğer /static/*filepath bildirimi yerine /*filepath şeklinde bir tanımlama yaparsak kodun derlenmesi sırasında aşağıdaki hataları alırız.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;panic: '/category' in new path '/category' conflicts with existing wildcard '/*filepath' in existing prefix '/*filepath'

goroutine 1 [running]:
panic(0x5fd040, 0x125624d0)
	C:/Go/src/runtime/panic.go:500 +0x331
github.com/julienschmidt/httprouter.(*node).addRoute(0x1254a630, 0x6379cc, 0x9, 0x65ead8)
	c:/go works/samples/src/github.com/julienschmidt/httprouter/tree.go:162 +0x6db
github.com/julienschmidt/httprouter.(*Router).Handle(0x125d0340, 0x636829, 0x3, 0x6379cc, 0x9, 0x65ead8)
	c:/go works/samples/src/github.com/julienschmidt/httprouter/router.go:236 +0x1b2
github.com/julienschmidt/httprouter.(*Router).GET(0x125d0340, 0x6379cc, 0x9, 0x65ead8)
	c:/go works/samples/src/github.com/julienschmidt/httprouter/router.go:180 +0x4a
main.main()
	C:/Go Works/Samples/book/Web Programming/Lesson_26/Server.go:25 +0xe2
Error: process exited with code 2.&lt;/pre&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;GET ile yapılan fonksiyon y&amp;ouml;nlendirmelerinde JSON &amp;uuml;retimi i&amp;ccedil;in gerekli adımlar atılıyor. JSON &amp;ccedil;ıktısı i&amp;ccedil;in Marshal fonksiyonunu kullanmamız yeterli. Bunların dışında &amp;ccedil;ıktıyı &amp;uuml;retirken Header'a i&amp;ccedil;erik tipinin JSON&amp;nbsp;formatında olduğunu belirtiyoruz ki istemciler gelen i&amp;ccedil;eriğin ne olduğunu anlayabilsinler. WriteHeader fonksiyonuna verilen 200 değeri tahmin edeceğiniz &amp;uuml;zere HTTP 200 kodunu belirtmekte. JSON &amp;ccedil;ıktısını cevap olarak yazmak i&amp;ccedil;in Fprintf fonksiyonunu ele alıyoruz. GetModelsByCategoryName fonksiyonunda parametreye gelen kategori adını kullanarak bir sonu&amp;ccedil; k&amp;uuml;mesi oluşturmaktayız. Kategori adını params.ByName &amp;ccedil;ağrısını kullanarak yakalıyoruz. Buna g&amp;ouml;re belli bir kategorideki modelleri elde ederek JSON &amp;ccedil;ıktısı &amp;uuml;retiyoruz.&lt;/p&gt;
&lt;h1&gt;Sonu&amp;ccedil;lar&lt;/h1&gt;
&lt;p&gt;Eğer doğrudan / lokasyonuna gidersek pek tabii HTTP 404 not found hatası alırız. Nitekim bu adres i&amp;ccedil;in bir y&amp;ouml;nlendirme yapmadık. Statik i&amp;ccedil;eriklerimiz /static altında yer alıyor. Diğer yandan index.html'deki All Categories bağlantısına basarsak veya URL bilgisi olarak /category şeklinde bir talep g&amp;ouml;nderirsek aşağıdaki JSON i&amp;ccedil;eriğini elde ettiğimizi g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/gorouting_10.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Eğer fighter ya da cruiser kategorisindeki modelleri g&amp;ouml;rmek istersek g&amp;ouml;ndereceğimiz taleplere karşın aşağıdaki sonu&amp;ccedil;ları alırız.&lt;/p&gt;
&lt;p&gt;/category/fighter&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/gorouting_11.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;/category/cruiser i&amp;ccedil;in&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/gorouting_12.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Pek tabii olmayan kategori i&amp;ccedil;in slice i&amp;ccedil;eriği boş olacağından null bir JSON &amp;ccedil;ıktısına ulaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/gorouting_13.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu noktada belki de &amp;ccedil;ok daha şık bir HTML hata sayfasına y&amp;ouml;nlendirme yaptırabiliriz ne dersiniz? G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Router nesne &amp;ouml;rnekleri &amp;uuml;zerinden ServeFiles, GET gibi fonksiyonları bir arada kullanarak static i&amp;ccedil;erik sunabilen ve REST davranış g&amp;ouml;sterip HTTP&amp;nbsp;taleplerine JSON &amp;ccedil;ıktılarla cevap veren bir web uygulaması geliştirmek olduk&amp;ccedil;a kolay. Bu tekniği kullanarak veri i&amp;ccedil;eriği sunan basit REST servisleri help sayfaları ile birlikte geliştirmeniz m&amp;uuml;mk&amp;uuml;n. Yine de ka&amp;ccedil;ırdığım &amp;ccedil;ok şey olduğundan adım gibi eminim. Şu konuda HTTP Post, Put, Delete, Patch gibi fonksiyonellikleri bir deneyimlemek lazım. Bunları da ilerleyen zamanlarda incelemeye &amp;ccedil;alışacağım. Şimdilik bu kadar. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-07-01 10:45:00</pubDate>
  <slug>golange-static-web-icerigi-ve-json-uretimi</slug>
  <tags>
    <tag>golang</tag>
    <tag>go-programming-language</tag>
    <tag>web-programming-model</tag>
    <tag>json</tag>
    <tag>rest</tag>
    <tag>data-services</tag>
    <tag>http</tag>
    <tag>httprouting</tag>
    <tag>routers</tag>
  </tags>
  <categories>
    <category>GoLang</category>
  </categories>
</post>