<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tasarım Prensipleri - Dependency Inversion</title>
  <description>Bu yazımızda Dependency Inversion isimli tasarım prensibinden bahsediyor olacağız. Bu prensip kabaca, alt sınıflar ve üst sınıflar arasında kuvvetli bir bağ olmamasını önermektedir. Bunun en büyük gerekçesi, alt sınıflarda olabilecek sık değişiklerin, üst sınıfında değişmesine neden olabilecek olmasıdır ki bu hızla değişen yazılım ihtiyaçlarında sorunlara neden olmaktadır.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bu yazımızda &lt;strong&gt;Dependency&lt;/strong&gt; &lt;strong&gt;Inversion &lt;/strong&gt;isimli tasarım prensibinden bahsediyor olacağız. Bu prensip kabaca,&amp;nbsp;alt sınıflar ve &amp;uuml;st sınıflar arasında kuvvetli bir bağ olmamasını &amp;ouml;nermektedir.&amp;nbsp;Bunun en b&amp;uuml;y&amp;uuml;k gerek&amp;ccedil;esi, alt sınıflarda olabilecek sık değişiklerin, &amp;uuml;st sınıfında değişmesine neden olabilecek olmasıdır ki&amp;nbsp;bu hızla değişen yazılım&amp;nbsp;ihtiya&amp;ccedil;larında sorunlara neden olmaktadır. Buna birde&amp;nbsp;yeni alt tipler ile genişletilebilme olasılıklarınıda eklersek,&amp;nbsp;&amp;uuml;st&amp;nbsp;ve alt sınıflar arasındaki bağımlılıkların&amp;nbsp;ortadan kaldırılmasının &lt;em&gt;(bağımsızlık olarak d&amp;uuml;ş&amp;uuml;nmek istesemde, bağımlılığın tersine &amp;ccedil;evrilmesi olarak bilmek&amp;nbsp;zorundayız&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;)&lt;/em&gt;&amp;nbsp;aslında ne kadar &amp;ouml;nemli olduğu&amp;nbsp;anlaşılabilir.&amp;nbsp;Durumu daha iyi kavrayabilmek adına basit bir &amp;ouml;rnek &amp;uuml;zerinden ilerlemek &amp;ccedil;ok daha doğrudur. &amp;Ouml;ncelikli olarak aşağıdaki sınıf diagramı ve kod i&amp;ccedil;eriğinde g&amp;ouml;r&amp;uuml;len &amp;ouml;rnek &lt;strong&gt;Console&lt;/strong&gt; uygulamasını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg39_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace Problem
{
    // Low Level Class
    class XmlContent
    {
        public string Content { get; set; }

        public void Parse()
        {
            Console.WriteLine("parsing işlemi");
        }
    }

    // High Level Class
    class Parser
    {
        XmlContent xContent { get; set; }

        public Parser(XmlContent xmlContent)
        {
            xContent = xmlContent;
        }

        public void DoWork()
        {
            // Kompleks işlemler yapıldığını varsayabiliriz.
            xContent.Parse();
        }
    }

    class Program
    {
        static void Main(string[] args)
        {
            Parser prsr = new Parser(new XmlContent { Content = "&amp;lt;Kitaplar&amp;gt;&amp;lt;Kitap&amp;gt;&amp;lt;Ad&amp;gt;C#&amp;lt;/Ad&amp;gt;&amp;lt;/Kitap&amp;gt;&amp;lt;Kitap&amp;gt;&amp;lt;Ad&amp;gt;VB.Net&amp;lt;/Ad&amp;gt;&amp;lt;/Kitap&amp;gt;&amp;lt;/Kitaplar&amp;gt;" });
            prsr.DoWork();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rnekte yer alan &lt;strong&gt;Parser&lt;/strong&gt; sınıfı, kendi i&amp;ccedil;erisinde tanımlı olan &lt;strong&gt;XmlContent&lt;/strong&gt; tipine bağımlıdır. XmlContent tipi temel olarak bir &lt;strong&gt;Xml&lt;/strong&gt; i&amp;ccedil;eriğini ifade etmek &amp;uuml;zere tasarlanmış olup, ayrıştırma işlemi i&amp;ccedil;in &amp;ouml;zel bir metoda sahiptir. Diğer yandan &lt;strong&gt;Parser&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde yer alan &lt;strong&gt;DoWork&lt;/strong&gt; metodu, &lt;strong&gt;XmlContent&lt;/strong&gt; tipinin &lt;strong&gt;Parse&lt;/strong&gt; metodunu &amp;ccedil;ağırmaktadır. &lt;strong&gt;DoWork&lt;/strong&gt; metodu i&amp;ccedil;erisinde aslında, &lt;strong&gt;XmlContent&lt;/strong&gt; tipi ile ilişkili olaraktan farklı ve hatta karmaşık bazı iş kurallarının uygulandığı farz edilebilir. Ancak &lt;strong&gt;alt sınıf(Low Level Class)&lt;/strong&gt;&amp;nbsp;olarak kabul edebileceğimiz &lt;strong&gt;XmlContent&lt;/strong&gt; tipinin yapısında olabilecek değişikliker tahmin edileceği &amp;uuml;zere &lt;strong&gt;&amp;uuml;st sınıfı(High Level Class)&lt;/strong&gt;&amp;nbsp;doğrudan etkileyecektir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellike &amp;uuml;st sınıfta kod değişikliğine gidilmesi gerekecektir. Diğer yandan senaryoya yeni bir tip eklenmek istendiğinde de &lt;strong&gt;Parser&lt;/strong&gt; tipinin bozulması ve i&amp;ccedil;eriğinin değiştirilmesi gerekecektir. Yani genişletilebilirlik s&amp;ouml;z konusu olduğunda,&amp;nbsp;&amp;nbsp;&amp;uuml;st sınıfta kod meydana gelecek kod değişimi ka&amp;ccedil;ınılmaz olacaktır. Şimdi senaryomuzu genişletip sorunu ortaya koymaya &amp;ccedil;alışalım. Bu ama&amp;ccedil;la var olan sisteme, yeni bir alt sınıfın eklendiğini farzedelim. &amp;Ouml;rneğin &lt;strong&gt;Parser&lt;/strong&gt; sınıfının, &lt;strong&gt;Json&lt;/strong&gt; formatındaki d&amp;ouml;k&amp;uuml;manları ifade eden bir sınıf ilede &amp;ccedil;alışması istenebilir. Bu durumda 3 temel sorundan bahsedebiliriz;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Yeni eklenen tip nedeniyle Parser sınıfının kendisine m&amp;uuml;dahele edilmesi ve DoWork metodunun kod i&amp;ccedil;eriğinin değiştirilmesi gerekecektir.&lt;/li&gt;
&lt;li&gt;DoWork metodu veya Parser sınıfı i&amp;ccedil;erisindeki bazı fonksiyonelliklerin işleyişi olumsuz y&amp;ouml;nde etkilenebilir.&lt;/li&gt;
&lt;li&gt;Her ne olursa olsun, Unit Test işlemlerinin tekrardan oluşturulması ve yapılması gerekecektir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Şimdi biraz durup bu sorunların &amp;uuml;stesinden nasıl gelebileceğinizi d&amp;uuml;ş&amp;uuml;nmenizini &amp;ouml;neririm. Hatta d&amp;uuml;ş&amp;uuml;n&amp;uuml;rken bir kahve arası verebilir ve &amp;ccedil;evrenizde bu konu ile ilgili kişiler varsa onlarla durumu tarışabilirsiniz.&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Dependency Inversion&lt;/strong&gt; prensibi, yukarıda bahsediğimiz tipte&amp;nbsp;bir senaryonun oluşmasını engellemek i&amp;ccedil;in, &amp;uuml;st sınıf ile alt sınıf arasına bir &lt;strong&gt;soyutlayıcının(abstract class veya interface)&lt;/strong&gt; konulmasını belirtir. Yani&amp;nbsp;&amp;uuml;st sınıf ve alt sınıf arasında bir &lt;strong&gt;interface&lt;/strong&gt; veya &lt;strong&gt;abstract&lt;/strong&gt; tipin kullanılması &amp;ouml;nerilmektedir.&amp;nbsp;İşte &amp;ouml;rnek senaryomuzun &lt;strong&gt;Dependency Inversion&lt;/strong&gt; prensibine uygun olarak geliştirilen son hali.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg39_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace Solution
{
    // Abstraction Layer
    interface IContent
    {
        string Content { get; set; }

        void Parse();
    }

    // Low Level Class
    class XmlContent
        :IContent
    {
        #region IContent Members

        public string Content { get; set; }

        public void Parse()
        {
            Console.WriteLine("Xml parsing işlemi");
        }

        #endregion
    }

    // Low Level Class
    class JsonContent
        : IContent
    {
        #region IContent Members

        public string Content { get; set; }

        public void Parse()
        {
            Console.WriteLine("Json parsing işlemi");
        }

        #endregion
    }

    // High Level Class
    class Parser
    {
        IContent content { get; set; }

        public Parser(IContent cntnt)
        {
            content = cntnt;
        }

        public void DoWork()
        {
            // Kompleks işlemler yapıldığını varsayabiliriz.
            content.Parse();
        }
    }

    class Program
    {
        static void Main(string[] args)
        {
            Parser prsr = new Parser(new XmlContent { Content = "" });
            prsr.DoWork();

            prsr = new Parser(new JsonContent { Content = "" });
            prsr.DoWork();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;XmlContent&lt;/strong&gt; ve &lt;strong&gt;JsonContent&lt;/strong&gt; isimli tiplerimiz &lt;strong&gt;IContent&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;nden t&amp;uuml;retilmiştir. Buna bağlı olarakta &lt;strong&gt;Parser&lt;/strong&gt; tipi ile IContent aray&amp;uuml;z&amp;uuml; arasında bir bağlantı oluşturulmuştır. Bir başka deyişle, Parser tipinden XmlContent veya JsonContent tiplerine &lt;strong&gt;doğrudan&lt;/strong&gt; &lt;strong&gt;bir bağ mevcut değildir&lt;/strong&gt;. Artık alt sınıflar olan XmlContent ve JsonContent i&amp;ccedil;erisinde istenilen değişiklikler yapılabilir. S&amp;ouml;z gelimi Parse metodlarının iş mantığında değişimler olabilir yada tipler i&amp;ccedil;erisine yeni &amp;uuml;yeler eklenebilir. Sonu&amp;ccedil; olarak; &lt;strong&gt;aray&amp;uuml;z&amp;uuml;n(veya soyut tipin)&lt;/strong&gt;&amp;nbsp;&lt;strong&gt;yapısının değiştirilmediği d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde, &amp;uuml;st sınıfın, alt sınıflardaki&amp;nbsp;olası değişiklier ve sistemdeki genişletmelere karşı bağımsız olması&lt;/strong&gt; garanti altına alınmış olur.&lt;/p&gt;
&lt;p&gt;Bir sonraki yazımızda g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f6%2fDIP.rar"&gt;DIP.rar (40,27 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-06-30 10:45:00</pubDate>
  <slug>Tasarc4b1m-Prensipleri-Dependency-Inversion</slug>
  <tags>
    <tag>design-principles</tag>
  </tags>
  <categories>
    <category>Tasarım Prensipleri(Design Principles)</category>
  </categories>
</post>