<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ado.Net 2.0 ile Mars' a Ayak Basıyoruz</title>
  <description>Bu makalemizde, MARS (Multiple Active Results Sets) kavramını incelemeye çalışacağız. MARS kavramı Ado.Net 2.0 mimarisine monte edilmiş yeni bir yapıdır. Bu yapının bize sağladığı avantajları anlayabilmek için, Ado.Net 1.0/1.1 sürümlerinin kabiliyetlerine ve kısıtlamalarına kısaca bir göz atmak gerekmektedir.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bu makalemizde, MARS (Multiple Active Results Sets) kavramını incelemeye &amp;ccedil;alışacağız. MARS kavramı Ado.Net 2.0 mimarisine monte edilmiş yeni bir yapıdır. Bu yapının bize sağladığı avantajları anlayabilmek i&amp;ccedil;in, Ado.Net 1.0/1.1 s&amp;uuml;r&amp;uuml;mlerinin kabiliyetlerine ve kısıtlamalarına kısaca bir g&amp;ouml;z atmak gerekmektedir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Edit&amp;ouml;r&amp;uuml;n Notu :&lt;/strong&gt; &lt;span style="color: #800000;"&gt;Final s&amp;uuml;r&amp;uuml;m&amp;uuml;nde, ConnectionString katarı i&amp;ccedil;erisinde MultipleActiveResultSets=true kullanılmaması halinde, MARS etkisi g&amp;ouml;r&amp;uuml;lmemektedir. Varsayılan olarak MultipleActiveResultSets &amp;ouml;zelliğinin değeri false' dur. MARS tekniği, MultipleActiveResultSets değeri a&amp;ccedil;ık&amp;ccedil;a true' ya set edildiği takdirde &amp;ccedil;alışmaktadır.&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Ado.Net' in &amp;ouml;nceki s&amp;uuml;r&amp;uuml;mlerinde, &amp;ouml;zellikle veri k&amp;uuml;melerini uygulama ortamına &amp;ccedil;ekmek istediğimizde kullanabileceğimiz iki temel teknik vardır. Birincisi, bağlantısız katmana veri alabilmek i&amp;ccedil;in DataAdapter, DataTable, DataSet gibi nesnelerin kullanılmasıdır. İkincisi ise, daha s&amp;uuml;ratli veri &amp;ccedil;ekmemizi sağlayan ve veri kaynağına olan bağlantının sql komutunun işleyişi boyunca a&amp;ccedil;ık olmasını gerektiren, DataReader nesnelerinin kullanıldığı tekniktir.&lt;/p&gt;
&lt;p&gt;Bu tekniklerin hangisi kullanılırsa kullanılısın &amp;ouml;zellikle aynı bağlantı &amp;uuml;zerinden eş zamanlı olarak y&amp;uuml;r&amp;uuml;t&amp;uuml;len sql komutlarının &amp;ccedil;alıştırılmasına izin veren bir yapı yoktur. Yani, veri kaynağından bir DataReader nesnesi ile veri &amp;ccedil;ekerken, aynı a&amp;ccedil;ık bağlantı &amp;uuml;zerinden g&amp;uuml;ncelleme, ekleme, silme gibi işlemleri i&amp;ccedil;eren sql komutlarını &amp;ccedil;alıştıramayız. İşte bu imkansızlığı gidermek amacıyla Ado.Net mimarisi i&amp;ccedil;ine MARS, Asenkron Komut Y&amp;uuml;r&amp;uuml;tme ve ObjectSpace gibi yeni ve k&amp;ouml;kl&amp;uuml; değişiklikler eklenmiştir. Biz bu g&amp;uuml;nk&amp;uuml; makalemizde, aynı a&amp;ccedil;ık bağlantı &amp;uuml;zerinden birden fazla kayıt k&amp;uuml;mesini uygulama ortamına &amp;ccedil;ekmemize ve onlara erişmemize imkan sağlayan MARS (Multiple Active Results Sets) yapısını tanımaya &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;MARS, &amp;ouml;zellikle aynı a&amp;ccedil;ık bağlantı &amp;uuml;zerinden birden fazla satır k&amp;uuml;mesini elde edebileceğimiz sql komutlarının eş zamanlı olarak &amp;ccedil;alıştırılmasına imkan verir. &amp;Ouml;rneğin Ado.Net' in eski s&amp;uuml;r&amp;uuml;mlerinde şu senaryoyu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım; aynı veri kaynağında yer alan ve aynı bağlantı &amp;uuml;zerinden erişeceğimiz &amp;uuml;&amp;ccedil; kayıt k&amp;uuml;mesi olsun. Bu kayıt k&amp;uuml;melerini 3 farklı SqlDataReader nesnesi ile ortama &amp;ccedil;ekmek istediğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu işlemi sim&amp;uuml;le edebilmek i&amp;ccedil;in VS.NET 2003' de basit bir Console uygulaması geliştireceğiz. Uygulamamızın kodları aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data.SqlClient;
using System.Data;

namespace MultipleReader
{
    class AdoNet1nokta1de
    {
        [STAThread]
        static void Main(string[] args)
        {
            try
            {
                SqlConnection con=new SqlConnection("data source=localhost;initial catalog=Northwind;integrated security=SSPI");

                SqlDataReader dr1;
                SqlDataReader dr2;
                SqlDataReader dr3;

                SqlCommand cmd1=new SqlCommand("SELECT * FROM Customers",con);
                SqlCommand cmd2=new SqlCommand("SELECT * FROM Orders",con);
                SqlCommand cmd3=new SqlCommand("SELECT * FROM [Order Details]",con);

                con.Open();
            
                dr1=cmd1.ExecuteReader();
                dr2=cmd2.ExecuteReader();
                dr3=cmd3.ExecuteReader();

                con.Close();
            }
            catch(Exception hata)
            {
                Console.WriteLine(hata.Message);
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda &amp;ccedil;alışma zamanında bir istisnanın fırlatıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk95_1.gif" alt="" width="637" height="61" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. Ado.Net 1.0./1.1' deki durum.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Sorun şudur ki, ilk &amp;ccedil;alıştırılan SqlDataReader nesnesini kapatmadan diğerlerini &amp;ccedil;alıştırmamız da m&amp;uuml;mk&amp;uuml;n değildir. Nitekim SqlDataReader nesnesi, &amp;ccedil;alıştırdığı Sql komutunu ile verileri &amp;ccedil;ekebilmek i&amp;ccedil;in ilgili bağlantının kendisi i&amp;ccedil;in tahsis edilmesini ve işi bitene kadar da başkaları tarafından kullanılmamasını gerektirir. Bu, tamamıyla Ado.Net' in mimarisinden kaynaklanan bir g&amp;uuml;&amp;ccedil;l&amp;uuml;kt&amp;uuml;r. Bununla birlikte, akla ş&amp;ouml;yle bir &amp;ccedil;&amp;ouml;z&amp;uuml;m yolu gelebilir. Her bir SqlDataReader nesnesini kendi SqlConnection havuzu i&amp;ccedil;inde &amp;ccedil;alıştırmak. Yani yukarıdaki kodu aşağıdaki gibi yazmak.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection con1=new SqlConnection("data source=localhost;initial catalog=Northwind;integrated security=SSPI");
SqlConnection con2=new SqlConnection("data source=localhost;initial catalog=Northwind;integrated security=SSPI");
SqlConnection con3=new SqlConnection("data source=localhost;initial catalog=Northwind;integrated security=SSPI");
SqlDataReader dr1;
SqlDataReader dr2;
SqlDataReader dr3;

SqlCommand cmd1=new SqlCommand("SELECT * FROM Customers",con1);
SqlCommand cmd2=new SqlCommand("SELECT * FROM Orders",con2);
SqlCommand cmd3=new SqlCommand("SELECT * FROM [Order Details]",con3);

con1.Open();
con2.Open();
con3.Open();

dr1=cmd1.ExecuteReader();
dr2=cmd2.ExecuteReader();
dr3=cmd3.ExecuteReader();

con1.Close();
con2.Close();
con3.Close();&lt;/pre&gt;
&lt;p&gt;Bu haliyle uygulama &amp;ccedil;alışacak ve herhangibir hata mesajı yada istisna vermeyecektir. Uygulanan bu teknik her ne kadar &amp;ccedil;&amp;ouml;z&amp;uuml;mm&amp;uuml;ş gibi g&amp;ouml;r&amp;uuml;nsede, gereksiz yere kaynak t&amp;uuml;ketimine neden olmaktadır. Nitekim aynı bağlantı i&amp;ccedil;in &amp;uuml;&amp;ccedil; kez SqlConnection nesnesi &amp;ouml;rneklendirilmiş ve sql sunucuna &amp;uuml;&amp;ccedil; adet ayrı isimli ama aynı &amp;ouml;zellikte bağlantı hattı tesis edilmiştir. Dahası bu teknik kullanıldığı takdirde her &amp;ccedil;alışan Sql komutunun işleyişi sonlanana kadar, bir sonraki sql komutuna ge&amp;ccedil;ilemiyecektir. Bunu &amp;ccedil;&amp;ouml;zmek i&amp;ccedil;inde, bu veri &amp;ccedil;ekme işlemlerini ayrı metodlar halinde tanımlayıp &amp;ccedil;ok-kanallı (multi-threading) programlama tekniklerini uygulayabiliriz. Ancak bu yaklaşımlar elbetteki &amp;ccedil;ok verimli yada &amp;ouml;l&amp;ccedil;eklenebilir değildir.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;&amp;ouml;z&amp;uuml;m, .Net mimarları tarafından Ado.Net 2.0' a yerleştirilmiştir ve MARS olarak adlandırılmıştır. Şimdi ilk yazdığımız uygulamayı birde .Net framework 2.0 ortamında geliştirelim. Kodlarımızı hi&amp;ccedil; değiştirmeyeceğiz. Bu kez Yukon &amp;uuml;zerinde yer alan AdventureWorks isimli veritabanındaki iki tabloya aynı a&amp;ccedil;ık bağlantı &amp;uuml;zerinden aynı zamanda erişmeye &amp;ccedil;alışacağız. İşte kodlarımız,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;#region Using directives

using System;
using System.Collections.Generic;
using System.Text;
using System.Data.SqlClient;
using System.Data;

#endregion

namespace MarsEtkisi
{
    class Program
    {
        static void Main(string[] args)
        {
            try
            {
                SqlConnection con = new SqlConnection("data source=localhost;initial catalog=AdventureWorks;integrated security=SSPI");

                SqlCommand cmd1 = new SqlCommand("SELECT TOP 10 * FROM Person.address", con);
                SqlCommand cmd2 = new SqlCommand("SELECT TOP 3 * FROM Person.contact", con);

                SqlDataReader dr1;
                SqlDataReader dr2;

                con.Open();
                
                dr1 = cmd1.ExecuteReader();
                dr2 = cmd2.ExecuteReader();

                while (dr1.Read())
                {
                    Console.WriteLine(dr1["AddressLine1"]);
                }
                Console.WriteLine("-------------");
                while (dr2.Read())
                {
                    Console.WriteLine(dr2["FirstName"]);
                }
    
                con.Close();
                Console.WriteLine("-------------");
                Console.ReadLine();
            }
            catch (SqlException hata)
            {
                Console.WriteLine(hata.Message);
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamayı bu haliyle &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, SqlDataReader nesneleri, diğerinin kapatılmasına gerek duymadan veri kaynağından veri &amp;ccedil;ekebilmiştir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk95_2.gif" alt="" width="284" height="251" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. MARS Etkisi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu &amp;ouml;rnek basit olarak MARS kavramını a&amp;ccedil;ıklamaktadır. Olayı daha iyi kavrayabilmek amacıyla aşağıdaki şekildende faydalanabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk95_5.gif" alt="" width="557" height="410" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. MARS (Multiple Active Results Sets)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şekildende g&amp;ouml;r&amp;uuml;lebileceği gibi, bir veritabanında yer alan &amp;ccedil;eşitli sayıdaki tabloya ait veri k&amp;uuml;melerini aynı uygulama ortamına, farklı ama tek bir ortak bağlantıyı kullanan DataReader nesneleri yardımıyla erişebilmemiz m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;Şimdi dilerseniz, MARS etkisini daha iyi g&amp;ouml;rebileceğimiz başka bir &amp;ouml;rneği g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. Bu kez bir birleriyle bire-&amp;ccedil;ok ilişkisi olan iki tabloyu ele alacağız. Bu tablolara ait verileri uygulama ortamına yine DataReader nesneleri yardımıyla &amp;ccedil;ekeceğiz. Ancak işin ilgin&amp;ccedil; yanı, bir DataReader nesnesi &amp;ccedil;alışırken ve satırları arasında iterasyon yaparken, diğerine parametre g&amp;ouml;ndererek her bir satır i&amp;ccedil;in diğer DataReader' ında &amp;ccedil;alıştırılmasının sağlanmış olacağıdır. Bu &amp;ouml;rneği ger&amp;ccedil;ekleştirmek i&amp;ccedil;in aşağıdaki kodları yazarak, Visual Studio.Net 2005' de basit bir Console uygulaması geliştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
    try
    {
        SqlConnection con = new SqlConnection("data source=localhost;initial catalog=Dukkan;integrated security=SSPI");

        SqlCommand cmd1 = new SqlCommand("SELECT * FROM DepartmanSinif", con);
        SqlCommand cmd2 = new SqlCommand("SELECT * FROM PersonelDetay WHERE PersonelID=@PersonelID", con);
        cmd2.Parameters.Add("@PersonelID", SqlDbType.Int);

        SqlDataReader dr1;
        SqlDataReader dr2;

        con.Open();
        dr1 = cmd1.ExecuteReader();
        while (dr1.Read())
        {
            Console.WriteLine(dr1["Departman"]);
            Console.WriteLine(" ALTINDAKI ELEMANLARI....");
            cmd2.Parameters["@PersonelID"].Value = dr1["PersonelID"];
            dr2 = cmd2.ExecuteReader();
            while (dr2.Read())
            {
                Console.WriteLine(dr2["Ad"]+" "+dr2["Soyad"]+" "+dr2["Mail"]);
            }
            dr2.Close();
            Console.WriteLine("------------");
        }

        con.Close();
        Console.ReadLine();
    }
    catch (Exception hata)
    {
        Console.WriteLine(hata.Message);
        Console.ReadLine();
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda ilişkili tablolara ait verilerin ekrana yazdırıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk95_3.gif" alt="" width="605" height="235" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. MARS Etkisi sayesinde i&amp;ccedil;i&amp;ccedil;e &amp;ccedil;alışan SqlDataReader' lar.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizde, SqlDataReader nesnelerini kullanarak Yukon sunucusu &amp;uuml;zerinde yer alan ilişkili iki tabloya ait verileri console uygulamasından ekrana yazdırmaktayız. dr1 isimli SqlDataReader nesnesi yardımıyla DepartmanSinif isimli master tablodan satırları bir while d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile okumaktayız. Bu d&amp;ouml;ng&amp;uuml;n&amp;uuml;n i&amp;ccedil;erisinde ceyran eden olaylar ise bizim i&amp;ccedil;in MARS etkisinin g&amp;uuml;c&amp;uuml;n&amp;uuml; bir kere daha g&amp;ouml;stermektedir. Nitekim, dr1 nesnesi ile master tablodan her bir satır okunduğunda bu satıra ait olan PersonelID alanının değeri, başka bir komuta parametre olarak gitmekte ve en &amp;ouml;nemliside bu komutu bir SqlDataReader nesnesi, diğeri halen daha a&amp;ccedil;ıkken y&amp;uuml;r&amp;uuml;terek uygulama ortamına sonu&amp;ccedil; k&amp;uuml;mesini d&amp;ouml;nd&amp;uuml;rmektedir. Aynı kod mantığını Ado.Net 1.1 verisyonunda Sql 2000 sunucusu &amp;uuml;zerinde ger&amp;ccedil;ekeştirmeye &amp;ccedil;alıştığımız aşağıdaki &amp;ouml;rneği g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda ise;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;try
{
    SqlConnection con = new SqlConnection("data source=localhost;initial catalog=Northwind;integrated security=SSPI");

    SqlCommand cmd1 = new SqlCommand("SELECT * FROM Orders", con);
    SqlCommand cmd2 = new SqlCommand("SELECT * FROM [Order Details] WHERE OrderID=@OrderID", con);
    cmd2.Parameters.Add("@OrderID", SqlDbType.Int);

    SqlDataReader dr1;
    SqlDataReader dr2;

    con.Open();
    dr1 = cmd1.ExecuteReader();
    while (dr1.Read())
    {
        Console.WriteLine(dr1["OrderDate"]);
        Console.WriteLine(" ALTINDAKI ELEMANLARI....");
        cmd2.Parameters["@OrderID"].Value = dr1["OrderID"];
        dr2 = cmd2.ExecuteReader();
        while (dr2.Read())
        {
            Console.WriteLine(dr2["ProductID"]+" "+dr2["UnitPrice"]+" "+dr2["Quantity"]);
        }
        dr2.Close();
        Console.WriteLine("------------");
    }

    con.Close();
    Console.ReadLine();
}
catch (Exception hata)
{
    Console.WriteLine(hata.Message);
    Console.ReadLine();
}&lt;/pre&gt;
&lt;p&gt;Bu kez Ado.Net 1.1' in mimarisi bu tarz bir işleme izin vermeyecek ve while d&amp;ouml;ng&amp;uuml;s&amp;uuml; i&amp;ccedil;inden elde edilen ilk tablo satırından sonra, ikinci SqlDataReader nesnesi y&amp;uuml;r&amp;uuml;t&amp;uuml;lmeye &amp;ccedil;alışıldığında, halen &amp;ccedil;alışmakta olan SqlDataReader' ın işlemini sonlandırması gerektiğini s&amp;ouml;yleyecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk95_4.gif" alt="" width="639" height="90" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 5. Ado.Net 1.1'deki durum.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, MARS yapısı var olan sınıfların kabiliyetlerini arttırarak aynı a&amp;ccedil;ık bağlantı &amp;uuml;zerinden birden fazla sayıda kayıt k&amp;uuml;mesine erişebilme imkanına sahip olmamızı sağlamıştır. İşin g&amp;uuml;zel yanı MARS etkisini uygulamalarımıza yansıtabilmek i&amp;ccedil;in, sınıflarımıza has &amp;ccedil;eşitli ayarlamalar yapamamıza gerek olmayışıdır. Aynen Ado.Net 1.1 uygulamaları yazar gibi yazabiliriz kodlarmızı. Elbetteki bu mimari değişiklikler sayesinde Ado.Net sınıflarının imkan ve kabiliyetleri &amp;ouml;nemli derecede artmıştır. Ado.Net 2.0 ile gelen tek yenilik MASR değildir. Bunun yanında, aynı anda birden fazla sql komutunu &amp;ccedil;alıştırmamıza yarayan asenkron komut y&amp;uuml;r&amp;uuml;tme teknikleride eklenmiştir. Bu konuyuda bir sonraki makalemizde incelemeye &amp;ccedil;alışacağız. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-09-20 12:00:00</pubDate>
  <slug>Ado-Net-2-0-ile-Mars-a-Ayak-Basc4b1yoruz-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet-20</tag>
    <tag>asynchronous</tag>
    <tag>async</tag>
  </tags>
  <categories>
    <category>Ado.net 2.0</category>
  </categories>
</post>