<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Indeksleyiciler (Indexers)</title>
  <description>Bugünkü makalemizde kısaca indeksleyicilerin C# programlama dilindeki kullanımını incelemeye çalışacağız. Bir indeksleyici, bir sınıfı dizi şeklinde kullanabilmek ve bu sınıftan türetilen nesneleri dizinleyebilmek amacıyla kullanılır. Başka bir deyişle bir indeksleyici, nesnelere dizi gibi davranılabilmesini sağlar. Indeksleyiciler tanımlanışları itibariyle, özelliklere (properties) çok benzerler . Ancak aralarında temel farklılıklarda vardır. Herşeyden önce bu benzerlik, indeksleyicilerin tanımlanmasında göze çarpar. Bir indeksleyiciyi teorik olarak aşağıdaki söz dizimi ile tanımlanır.</description>
  <content>&lt;p align="left"&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde kısaca indeksleyicilerin C# programlama dilindeki kullanımını incelemeye &amp;ccedil;alışacağız. Bir indeksleyici, bir sınıfı dizi şeklinde kullanabilmek ve bu sınıftan t&amp;uuml;retilen nesneleri dizinleyebilmek amacıyla kullanılır. Başka bir deyişle bir indeksleyici, nesnelere dizi gibi davranılabilmesini sağlar.&lt;/p&gt;
&lt;p&gt;Indeksleyiciler tanımlanışları itibariyle, &amp;ouml;zelliklere (properties) &amp;ccedil;ok benzerler . Ancak aralarında temel farklılıklarda vardır. Herşeyden &amp;ouml;nce bu benzerlik, indeksleyicilerin tanımlanmasında g&amp;ouml;ze &amp;ccedil;arpar. Bir indeksleyiciyi teorik olarak aşağıdaki s&amp;ouml;z dizimi ile tanımlanır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public int this[int indis]
{
     get
     {
         // Kodlar
     }
     set
     {
         // Kodlar
     }
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi bir indeksleyici tanımlanması, &amp;ouml;zellik tanımlanması ile neredeyse aynıdır. Ancak bir indeksleyici tanımlarken uymamız gereken bir takım kurallarda vardır. Bu kurallar aşağıdaki tabloda belirtilmiştir.&lt;/p&gt;
&lt;div align="left"&gt;
&lt;table id="AutoNumber2" border="1" width="100%" cellspacing="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td bgcolor="#CCCCCC" width="100%" height="49"&gt;
&lt;p align="center"&gt;&lt;span style="font-size: 10pt; font-weight: bold; font-family: Verdana;"&gt;Indeksleyici Kuralları&lt;/span&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="justify" width="100%" height="58"&gt;&lt;span style="font-family: Verdana; font-size: small;"&gt;&amp;nbsp;&amp;nbsp; Bir indeksleyici mutlaka bir geri d&amp;ouml;n&amp;uuml;ş tipine sahip olmalıdır. Yani bir indeksleyiciyi void olarak tanımlayamayız.&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="justify" width="100%" height="58"&gt;&lt;span style="font-family: Verdana; font-size: small;"&gt;&amp;nbsp;&amp;nbsp; Bir indeksleyiciyi static olarakta tanımlayamayız.&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="justify" width="100%" height="54"&gt;&lt;span style="font-family: Verdana; font-size: small;"&gt;&amp;nbsp;&amp;nbsp; Bir indeksleyici en az bir parametre almalıdır. Bununla birlikte, bir indeksleyici birden fazla ve &amp;ccedil;eşitte parametrede alabilmektedir.&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="justify" width="100%" height="52"&gt;&lt;span style="font-family: Verdana; font-size: small;"&gt;&amp;nbsp;&amp;nbsp; Indeksleyicileri aşırı y&amp;uuml;kleyebiliriz (Overload). Ancak bir indeksleyiciyi aşırı y&amp;uuml;klediğimizde, bu indeksleyicileri birbirlerinden ayırırken ele aldığımız imzalar sadece parametreler ile belirlenir. Indeksleyicinin geri d&amp;ouml;n&amp;uuml;ş değeri bu imzada ele alınmaz.&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="justify" width="100%" height="48"&gt;&lt;span style="font-family: Verdana; font-size: small;"&gt;&amp;nbsp;&amp;nbsp; Indeksleyici parametrelerine , normal değişkenlermiş gibi davranamayız. Bu nedenle bu parametreleri ref ve out anahtar s&amp;ouml;zc&amp;uuml;kleri ile y&amp;ouml;nlendiremeyiz.&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="justify" width="100%" height="50"&gt;&lt;span style="font-family: Verdana; font-size: small;"&gt;&amp;nbsp;&amp;nbsp; Bir indeksleyici her zaman this anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; ile tanımlamalıyız. Nitekim this anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; , indeksleyicinin kullanıldığı sınıf nesnelerini temsil etmektedir. B&amp;ouml;ylece sınıfın kendisi bir dizi olarak kullanılabilir.&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p align="left"&gt;&lt;em&gt;Tablo 1. Indeksleyici tanımlama kuralları.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Indeksleyicileri siz değerli okurlarıma anlatmanın en iyi yolunun basit bir &amp;ouml;rnek geliştirmek olduğunu d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Dilerseniz vakit kaybetmeden &amp;ouml;rneğimize ge&amp;ccedil;elim.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikle bir sınıf tanımlayacağız. Bu sınıfımız, Sql veri tabanında oluşturduğumu Personel isimli tablonun satırlarını temsil edebilecek bir yapıda olucak. Tablomuz &amp;ouml;rnek olarak Personelimize ilişkin ID,Ad,Soyad bilgilerini tutan basit bir veri tablosu. Her bir alan, bahsetmiş olduğumuz sınıf i&amp;ccedil;inde birer &amp;ouml;zellik olarak tanımlanacak. Diğer yandan başka bir sınıfımızda daha var olucak. Bu sınıfımız ise, bir indeksleyiciye sahip olucak. Bu indeksleyiciyi kullanarak, veri satırlarını temsil eden sınıf &amp;ouml;rneklerini, bu sınıfı i&amp;ccedil;erisinde tanımlayacağımız object t&amp;uuml;r&amp;uuml;nden bir dizide tutacağız. Sonu&amp;ccedil; olarak tablo satırlarına, sınıf dizi elemanlarıymış gibi erişebileceğiz. Burada indeksleyiciler sayesinde sınıfımıza sanki bir diziymiş gibi davrancak ve i&amp;ccedil;erdiği veri satırlarına indeks değerleri ile erişebileceğiz. &amp;Ouml;rneğimizi geliştirdiğimizde konuyu daha iyi kavrayacağınıza inanıyorum. Şimdi dilerseniz bir console uygulaması a&amp;ccedil;alım ve aşağıdaki kodları yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections;
using

System.Data.SqlClient;

namespace Indexers1
{
      /* Tablomuzda yer alan satırları temsil eden sınıfımızı ve bu tablodaki her bir alanı temsil edicek &amp;ouml;zelliklerimizi tanımlıyoruz. */
 
     public class Personel
     {
          private int perid;
          private string perad;
          private string persoyad;

          public int PerID
          {
               get
               {
                    return perid;
               }
               set
               {
                    perid=value;
               }
          }
          public string PerAd
          {
               get
               {
                    return perad;
               }
               set
               {
                     perad=value;
                }
           }
           public string PerSoyad
          {
               get
               {
                    return persoyad;
               }
               set
               {
                     persoyad=value;
                }
           }
     }

     /* PersonelListesi sınıfımız, Personel tipinden nesneleri tutucak Object t&amp;uuml;r&amp;uuml;nden bir tanımlar. Bu dizimizde, Personel sınıfı t&amp;uuml;r&amp;uuml;nden nesneleri tutacağız. Bu nedenle Object t&amp;uuml;r&amp;uuml;nden tanımladık. Ayrıca sınıfımız bir indeksleyiciye sahip. Bu indeksleyici, object t&amp;uuml;r&amp;uuml;nden dizimizdeki elemanlara erişirken, bu sınıftan t&amp;uuml;retilen nesneyi bir diziymiş gibi kullanabilmemize imkan sağlayacak. Yani uygulamamızda, bu sınıftan bir nesne t&amp;uuml;retip nesneadi[indis] gibi bir satır yazdığımızda buradaki indis değeri, indeksleyicinin tanımlandığı bloğa aktarılıcak ve get veya set blokları i&amp;ccedil;in kullanılacak. Bu bloklar aldıkları bu indis parametresinin değerini Object t&amp;uuml;r&amp;uuml;nden dizimizde kullanarak, karşılık gelen dizi elemanı &amp;uuml;zerinde işlem yapılmasına imkan sağlamaktadırlar.*/ 

     public class PersonelListesi
     {
          private Object[] liste=new Object[10];

          /* Indeksleyicimizi tanımlıyoruz.*/

          public Personel this[int indis]
          {
               get
               {
                    /* liste isimli Object t&amp;uuml;r&amp;uuml;nden dizimizin indis indeksli değerini d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Bunu d&amp;ouml;nd&amp;uuml;r&amp;uuml;rken Personel sınıfı tipinden d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. B&amp;ouml;ylece iligili elemandan Personel sınıfındaki &amp;ouml;zelliklere, dolayısıyla tablo alanlarındaki değere ulaşmış oluruz. */
                    return (Personel)liste[indis];
                }
               set
               {
                    /* liste isimli Object t&amp;uuml;r&amp;uuml;nden dizimizdeki indis indeksli elemana value değerini aktarır. */
                    liste[indis]=(Personel)value;
                }
           }
     }
     class Class1
     {
          static void Main(string[] args)
          {
                SqlConnection con=new SqlConnection("data source=localhost;initial catalog=Northwind;integrated security=sspi");
 
               SqlCommand cmd=new SqlCommand("Select * From Personel",con);
                SqlDataReader dr;
                con.Open();
                dr=cmd.ExecuteReader();
                PersonelListesi pliste=new PersonelListesi(); /* Indeksleyicimizi kullandığımız sınıftan bir nesne t&amp;uuml;retiyoruz. */
 
               int PersonelSayisi=0;
               int i=0;
               try
               {
                    /* SqlDataReader nesnesi ile, satırlarımızı okurken bu satıra ait alanların değerlerini tutacak Personel tipinden bir sınıf nesnesi oluşturulur ve ilgili alan değerleri bu nesnenin ilgili &amp;ouml;zelliklerine atanır. */
                    while(dr.Read())
                    {
                          Personel p=new Personel();
                          p.PerID=(int)dr[0];
                          p.PerAd=dr[1].ToString();
                          p.PerSoyad=dr[2].ToString();
                          /* Şimdi PersonelListesi sınıfı t&amp;uuml;r&amp;uuml;nden nesnemize g&amp;uuml;ncel satırı temsil eden Personel nesnesini atıyoruz. Bunu yaparken bu sınıf &amp;ouml;rneğine sanki bir diziymiş gibi davrandığımıza dikkat edelim. İşte bunu sağlayan indeksleyicimizdir. Burada PersonelListesi i&amp;ccedil;indeki, object t&amp;uuml;r&amp;uuml;nden liste isimli dizideki i indeksli elemana p nesnesi aktarılıyor. */
                         pliste[i]=p;
                         i+=1;
                         PersonelSayisi+=1;
                    }
                    /* Bu d&amp;ouml;ng&amp;uuml;de, pliste isimli PersonelListesi t&amp;uuml;r&amp;uuml;nden nesneye, i indeksini kullanarak  i&amp;ccedil;erdiği object t&amp;uuml;r&amp;uuml;nden liste isimli dizi elemanlarına, tanımladığımız indeksleyici sayesinde bir dizi elemanına erişir gibi erişiyoruz. */

                    for(int j=0;j&amp;lt;PersonelSayisi;++j)
                    {
                         /* pliste'nin t&amp;uuml;retildiği PersonelListesi sınıfı indeksleyicisinin kullandığı dizi elemanlarnı Personel t&amp;uuml;r&amp;uuml;ne d&amp;ouml;n&amp;uuml;şt&amp;uuml;rerek elde ettiğimiz i&amp;ccedil;in, bu nesnenin &amp;ouml;zelliklerinede yani veri satırı alanlarınada kolayca erişebiliyoruz. */

                         Console.WriteLine(pliste[j].PerAd.ToString()+" "+pliste[j].PerSoyad.ToString()+" "+pliste[j].PerID.ToString());
                    }
               }
               catch(Exception hata)
               {
                    Console.WriteLine(hata.Message.ToString());
               }
               finally
               {
                    dr.Close();
                    con.Close();
               }
          }
     }
}&lt;/pre&gt;
&lt;p&gt;Kodlar size karmaşık gelebilir o nedenle aşağıdaki şekil indeksleyicilerin kullanımını daha iyi anlayabilmemizi sağlayacaktır.&lt;/p&gt;
&lt;p align="left"&gt;&lt;span style="font-family: Verdana; font-size: small;"&gt;&lt;em&gt; &lt;img src="/makale/images/mk47_2.gif" alt="" width="497" height="442" border="0" /&gt;&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;span style="font-size: 10pt; font-style: italic; font-family: Verdana;"&gt;Şekil 1. Indeksleyicilerin Kullanımı&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;Uygulamamızda pliste[i]=p; satırı ile, Personel sınıfı t&amp;uuml;r&amp;uuml;nden nesnemiz, pliste isimli PersonelListesi sınıfının i indeksli elemanı olarak belirleniyor. Bu satır derleyici tarafından işlendiğinde, PersonelListesi sınıfındaki indeksleyicimizin set bloğu devreye girer. Set bloğu pliste[i] deki i değerini indis parametresi olarak alır ve Object t&amp;uuml;r&amp;uuml;nden liste isimli dizide indis indeksine sahip elemana nesnemizi aktarır.&lt;/p&gt;
&lt;p&gt;Diğer yandan, pliste[j] ile PersonelListesi sınıfına erişildiğinde, indeksleyicinin get bloğu devreye girer. Get bloğunda, indeksleyicinin parametre olarak aldığı indis değeri j değeridir. Bu durumda, liste[indis] ile, j indeksli liste dizisi elemanı &amp;ccedil;ağırılır. Sonra bu eleman Personel tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;l&amp;uuml;r. Bu sayedede pliste[j].PerAd.ToString() gibi bir ifade ile, bu nesnenin temsil ettiği &amp;ouml;zellik değerinede ulaşılabilir.&lt;/p&gt;
&lt;p align="left"&gt;Uygulamamızı &amp;ccedil;alıştıralım ve deneyelim. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p align="left"&gt;&lt;span style="font-size: 10pt; font-style: italic; font-family: Verdana;"&gt; &lt;img src="/makale/images/mk47_1.gif" alt="" width="461" height="127" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;span style="font-size: 10pt; font-style: italic; font-family: Verdana;"&gt;Şekil 2. Uygulamanın &amp;Ccedil;alışmasının Sonucu.&lt;/span&gt;&lt;/p&gt;
&lt;p align="left"&gt;Geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-01-27 12:00:00</pubDate>
  <slug>Indeksleyiciler-(Indexers)-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>indexers</tag>
    <tag>interface</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>