<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ruby Kod Parçacıkları 22 - Twitter API'sinin Basit Kullanımı</title>
  <description>Bazı günler şirketten geç çıkıyorum. Özellikle el ayak çekildiğinde ofis ortamı bir şeylere çalışmak için son derece ideal oluyor. Tam da istediğim ortam. Kendi çalışmalarıma vakit ayırabildiğim hoşuma giden zamanlar. Hele de akşam güneşi camdan içeri giriyor ve en sevdiğim sarı rengi masamın üstüne bırakıyorsa...</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2016/04/rubytwt_7.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bazı g&amp;uuml;nler şirketten ge&amp;ccedil; &amp;ccedil;ıkıyorum. &amp;Ouml;zellikle el ayak &amp;ccedil;ekildiğinde&amp;nbsp;ofis ortamı bir şeylere &amp;ccedil;alışmak i&amp;ccedil;in son derece ideal&amp;nbsp;oluyor. Tam da istediğim ortam. Kendi &amp;ccedil;alışmalarıma vakit ayırabildiğim hoşuma giden zamanlar. Hele de akşam g&amp;uuml;neşi camdan i&amp;ccedil;eri giriyor ve en sevdiğim sarı rengi masamın &amp;uuml;st&amp;uuml;ne bırakıyorsa.&lt;/p&gt;
&lt;p&gt;İşte bu huzur ve sakinlik i&amp;ccedil;erisinde bu akşam mesaiden sonra ş&amp;ouml;yle oturayım da iki satır Ruby kodu &amp;ccedil;alışayım dedim. Aklıma bir ka&amp;ccedil; &lt;strong&gt;gem&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesini araştırıp kullanmaya &amp;ccedil;alışmak geldi. İlk g&amp;ouml;z&amp;uuml;me kestirdiğim ise &lt;a href="http://www.rubydoc.info/gems/twitter" target="_blank"&gt;twitter gem&lt;/a&gt;&amp;nbsp;oldu. Bu gem'i kullanarak tweet' lerimi okumak ve hatta bir tweet'i ruby kodundan paylaşmak amacındaydım.&lt;/p&gt;
&lt;p&gt;İlk yapmam gereken bir ara hasbelkader kurmayı başardığım &lt;strong&gt;Ruby&lt;/strong&gt; ortamıma ilgili gem'i y&amp;uuml;klemekti. Bu aslında .Net ortamına bir &lt;strong&gt;NuGet&lt;/strong&gt; paketini indirmekten farksız bir işlemdi. Ne varki şirket g&amp;uuml;venlik politikaları gereği ne &lt;strong&gt;Nuget&lt;/strong&gt; ne de &lt;strong&gt;ruby gem&lt;/strong&gt; sunucularına erişemiyordum. T&amp;uuml;m hevesim kursağımda kalmıştı. Başımı &amp;ouml;ne eğip &amp;ccedil;alışma odama ge&amp;ccedil;mekten başka &amp;ccedil;arem yoktu. Ama yılmadım ve bu tweet'leri &amp;ccedil;ekeceğim dedim. Azmettim ve sonunda bu yazı ortaya &amp;ccedil;ıktı.&amp;nbsp;&lt;/p&gt;
&lt;h2&gt;Twitter Gem'in Kurulumu&lt;/h2&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;Ruby&lt;/strong&gt; komut satırından &lt;strong&gt;twitter&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesini sistemime y&amp;uuml;kledim. Eğer sisteminizde &lt;strong&gt;ruby&lt;/strong&gt; ve &lt;a href="https://github.com/oneclick/rubyinstaller/wiki/Development-Kit"&gt;ruby development kit&lt;/a&gt; y&amp;uuml;kl&amp;uuml; ise &lt;strong&gt;gem&lt;/strong&gt;' lerin sorunsuz bir şekilde indirilip kurulabiliyor olması gerekir. Aynen aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/04/rubytwt_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Twitter API i&amp;ccedil;in Gerekli Kaydın Yapılması&lt;/h2&gt;
&lt;p&gt;Servis tabanlı &amp;ccedil;alışan pek &amp;ccedil;ok &lt;strong&gt;API&lt;/strong&gt;' de olduğu gibi &lt;strong&gt;Twitter&lt;/strong&gt;' ın geliştiricilere a&amp;ccedil;ılan hizmetlerini kullanabilmek i&amp;ccedil;in &amp;ouml;ncelikle uygulama bazında kayıt yaptırmamız gerekir. Bunun i&amp;ccedil;in&amp;nbsp;&lt;a href="https://apps.twitter.com/"&gt;https://apps.twitter.com/&lt;/a&gt;&amp;nbsp;adresine gidip yeni bir uygulama oluşturarak işe başlamalıyız. Ben gerekli girişleri yaparak bir deneme uygulaması oluşturdum.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/04/rubytwt_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulama oluşturulurken dikkat edilmesi gereken noktalardan birisi de &lt;strong&gt;Access&amp;nbsp;Token&lt;/strong&gt;' larının &amp;uuml;rettirilmesi&lt;em&gt;(Varsayılan olan bu token bilgileri oluşturulmuyor)&lt;/em&gt; &lt;strong&gt;Twitter&lt;/strong&gt;' ın &lt;strong&gt;REST&lt;/strong&gt; servislerinin kullanılabilmesi i&amp;ccedil;in &lt;strong&gt;consumer key&lt;/strong&gt;, &lt;strong&gt;consumer secret&lt;/strong&gt;, &lt;strong&gt;access token&lt;/strong&gt; ve &lt;strong&gt;access token secret&lt;/strong&gt; değerlerine ihtiya&amp;ccedil;&amp;nbsp;var. Bu değerler &lt;strong&gt;twitter&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesi i&amp;ccedil;erisinde yer alan istemci sınıfının oluşturulmasında kullanılacak.&lt;/p&gt;
&lt;h2&gt;İlk Olarak Tweet' lerimi &amp;Ccedil;ektim&lt;/h2&gt;
&lt;p&gt;İlk olarak kendime ait &lt;strong&gt;tweet&lt;/strong&gt;' leri &amp;ccedil;ekmek ve hatta bunları &lt;strong&gt;YAML&lt;/strong&gt; formatlı bir i&amp;ccedil;erik olarak kaydetmek istedim. Bunun &amp;uuml;zerine aşağıdaki kod satırlarını geliştirerek işe başladım.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require 'twitter'
require 'yaml'

client=Twitter::REST::Client.new do |config|
             config.consumer_key="."
             config.consumer_secret="."
             config.access_token=".."
             config.access_token_secret="."
end

# Bir kullanciya ait tweet'lerin cekilmesi ve kalici olarak dosyaya yazilmasi

myTweets=client.user_timeline('burakselyum',count:3)
myTweets.each{|t| puts "\n"+t.full_text}
File.write('LastTweets.yml',YAML.dump(myTweets))rr&lt;/pre&gt;
&lt;p&gt;Kod par&amp;ccedil;asında ilk olarak gerekli &lt;strong&gt;gem&lt;/strong&gt; bildirimleri yapılıyor. ardından &lt;strong&gt;Twitter&lt;/strong&gt; i&amp;ccedil;erisindeki &lt;strong&gt;REST&lt;/strong&gt; hizmetine ait bir nesne &amp;ouml;rneği oluşturuluyor. Nesne &amp;ouml;rneği oluşturulurken dikkat edilmesi gereken nokta ise verilen konfigurasyon parametre değerleri&lt;em&gt;(Siz tabii ki kendi uygulamanıza ait&amp;nbsp;&lt;strong&gt;key&lt;/strong&gt; ve &lt;strong&gt;secret&lt;/strong&gt; değerlerinizi kullanmalısınız)&lt;/em&gt; Sonrasında &lt;strong&gt;client&lt;/strong&gt; &amp;ouml;rneği &amp;uuml;zerinden &lt;strong&gt;user_timeline&lt;/strong&gt; isimli fonksiyonu &amp;ccedil;ağırmaktayız. Bu fonksiyona gelen ilk parametre &lt;strong&gt;tweet&lt;/strong&gt;' leri alınacak kullanıcı hesabını işaret ediyor. İkinci parametre ile ka&amp;ccedil; tane &lt;strong&gt;tweet&lt;/strong&gt;' ini alacağımızı ifade etmekteyiz. &lt;strong&gt;each&lt;/strong&gt; metodunu kullanarak her bir &lt;strong&gt;tweet&lt;/strong&gt;' in metinsel i&amp;ccedil;eriğini&amp;nbsp;&lt;strong&gt;full_text&lt;/strong&gt; niteliğini kullanarak komut satırına basmaktayız.&amp;nbsp;Son olarak &lt;strong&gt;File&lt;/strong&gt; sınıfının &lt;strong&gt;write&lt;/strong&gt; metodunu &amp;ccedil;ağırıyor&amp;nbsp;ve t&amp;uuml;m &lt;strong&gt;tweet&lt;/strong&gt; i&amp;ccedil;eriğini &lt;strong&gt;LastTweets.yml&lt;/strong&gt; isimli dosyaya &lt;strong&gt;YAML&lt;/strong&gt; formatında yazdırıyoruz.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Kodu ilk denediğinizde aynı benim gibi&amp;nbsp;bir &lt;strong&gt;SSL&lt;/strong&gt; sertifika hatası alabilirsiniz. Bu, &lt;strong&gt;Windows&lt;/strong&gt; işletim sisteminde ilgili sertifikanın y&amp;uuml;kl&amp;uuml; olmayışından ve sisteme doğru &lt;strong&gt;path&lt;/strong&gt; ile bildirilmeyişinden kaynaklanıyor olabilir. &amp;Ccedil;&amp;ouml;z&amp;uuml;m i&amp;ccedil;in &lt;a href="https://superdevresources.com/ssl-error-ruby-gems-windows/"&gt;bu adresteki adımları izleyebilirsiniz&lt;/a&gt;. Şahsen ben &amp;ouml;yle yaptım.&amp;nbsp;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Sertifika hatasını aşınca ve Ruby kodunu &amp;ccedil;alıştırınca ta taaa...&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/04/rubytwt_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere o g&amp;uuml;n girdiğim son &amp;uuml;&amp;ccedil; tweet' imi başarılı bir şekilde alabildim. Hatta &lt;strong&gt;LastTweets.yml&lt;/strong&gt; isimli dosya da başarıl bir şekilde oluştu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/04/rubytwt_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında bu şekilde &lt;strong&gt;tweet&lt;/strong&gt;' lerin tamamını fiziki olarak indirebiliriz. Dolayısıyla basit arşivleme&amp;nbsp;yapabiliriz.&lt;/p&gt;
&lt;h2&gt;ve Tabii İlk Tweet' imi Attım&lt;/h2&gt;
&lt;p&gt;Macera yeni yeni heyecan kazanıyordu. Sıradaki hedefim ise koddan bir &lt;strong&gt;Tweet&lt;/strong&gt; g&amp;ouml;nderebilmekti. Bu da olduk&amp;ccedil;a basit bir işlemdi. Tek yapılması gereken &lt;strong&gt;update&lt;/strong&gt; metodunu aşağıdaki gibi kullanmaktı.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;client.update("Bu tweet, Twitter gem kullanilarak Ruby kodundan atilmistir.")&lt;/pre&gt;
&lt;p&gt;Kodu tekrar &amp;ccedil;alıştırdıktan sonra heyecanla &lt;strong&gt;twitter&lt;/strong&gt; hesabımı a&amp;ccedil;tım ve aşağıdaki sonucu g&amp;ouml;rd&amp;uuml;m.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/04/rubytwt_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Vuhu huuuu :) &lt;strong&gt;client&lt;/strong&gt; nesne &amp;ouml;rneği &amp;uuml;zerinden &amp;ccedil;ağırılan &lt;strong&gt;update&lt;/strong&gt; metodu, &lt;strong&gt;twitter&lt;/strong&gt; uygulamasının sahibi olan kişi adına parametre olarak gelen i&amp;ccedil;eriği g&amp;ouml;ndermişti.&lt;/p&gt;
&lt;h2&gt;Ek Bilgi&lt;/h2&gt;
&lt;p&gt;Peki kayıt ettiğimiz &lt;strong&gt;YAML&lt;/strong&gt; i&amp;ccedil;eriğini nasıl okuyabiliriz? Bunun i&amp;ccedil;in aşağıdaki basit kod par&amp;ccedil;asını ele alabiliriz.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;loadedTweets=YAML.load_file('LastTweets.yml')
loadedTweets.each{|t| puts "\n"+t.full_text}&lt;/pre&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;YAML&lt;/strong&gt; sınıfı &amp;uuml;zerinden &lt;strong&gt;load_file&lt;/strong&gt; metodunu &amp;ccedil;ağırıyor ve parametre olarak gelen i&amp;ccedil;eriğin &lt;strong&gt;loadedTweets&lt;/strong&gt; değişkenine aktarılmasını sağlıyoruz. Hemen ardından yine bir &lt;strong&gt;each&lt;/strong&gt; iterasyonuna gidiyor ve ilgili &lt;strong&gt;tweet&lt;/strong&gt; i&amp;ccedil;eriklerini ekrana basıyoruz.&lt;/p&gt;
&lt;p&gt;İ&amp;ccedil;eriğin &lt;strong&gt;YAML&lt;/strong&gt; formatında tutulması elbette şart değil. Pekala &lt;strong&gt;JSON&lt;/strong&gt; veya &lt;strong&gt;XML&lt;/strong&gt; gibi pop&amp;uuml;ler formatları da kullanabiliriz. Diğer yandan&amp;nbsp;&lt;strong&gt;twitter REST API&lt;/strong&gt; fonksiyonları &lt;strong&gt;update&lt;/strong&gt; ve &lt;strong&gt;user_timeline&lt;/strong&gt; operasyonlarından da ibaret değil. Yapılabilecek pek &amp;ccedil;ok şey var. Daha fazla detay i&amp;ccedil;in &lt;a href="https://dev.twitter.com/rest/public" target="_blank"&gt;twitter'ın ilgili sitesine&lt;/a&gt; bakmanızda yarar olacağı kanısındayım. &amp;Ouml;rneğin tweet' ler &amp;uuml;zerinde arama yaptırabilir, pop&amp;uuml;ler hashtag konularını &amp;ccedil;ekebilir, istediğiniz arkadaş listesinin favori tweet' lerini alabilir, aradığınız bir konuya istinaden otomatik tweet' ler atabilir ve hatta &amp;ccedil;eşitli SEO &amp;ccedil;alışmaları kapsamında robot g&amp;ouml;revi &amp;uuml;stelenen uygulamalar da yazabilirsiniz.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir Ruby kod par&amp;ccedil;acığımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-04-04 15:00:00</pubDate>
  <slug>ruby-ile-twitter-api-sinin-basit-kullanimi</slug>
  <tags>
    <tag>ruby</tag>
    <tag>gem</tag>
    <tag>twitter-api</tag>
    <tag>ssl</tag>
    <tag>install-gem</tag>
    <tag>ruby-kod-parçacıkları</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>