<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Kurumsal Yazılımcının Oyun Geliştirme ile İmtihanı</title>
  <description>Aslında benim dünyam iş modellerinin nesne yönelimli dillerle buluştuğu birçok yazılım prensibinin uygulanıp teknik borçların da yer aldığı devasa bir evren. Hal böyle olunca insan ister istemez arada bir düzen dışına çıkıp bambaşka maceralara dalmak istiyorum. Ben bunun için ağırlıklı olarak farklı programlama dillerini öğrenmeye çalışıyorum. Java, Ruby, Python ve Go bunlardan bazıları. Ancak en ciddi seviyede ilgilendiğim bir diğer dil Rust. Onunla yaklaşık 3 yıldır hararetli bir şekilde ilgilenmekteyim ve bana kalırsa bir programlama dilini öğrenmenin en eğlenceli yanı onunla oyunlar yazmaya çalışmak.</description>
  <content>&lt;p&gt;Bu yazıyı yazdığım tarih itibariyle SGK d&amp;ouml;k&amp;uuml;m&amp;uuml;m&amp;nbsp;20 yıl 1 aydır &amp;ccedil;alışmakta olduğumu ifade ediyor. Sekt&amp;ouml;re sigortalı bir &amp;ccedil;alışan olarak adım attığım 1999 yılında Delphi dili ile geliştirme yapan yeni yetme bir bilgisayar programcısıydım. 20 yıllık iş hayatımın %90'ında ise .Net teknolojileri ve C# programlama dilini kullandım, kullanmaya da devam ediyorum. Bu zaman diliminde telekominikasyondan finansa, eğitimden otomotive farklı sekt&amp;ouml;rlerde &amp;ccedil;alışma fırsatı buldum. Aslında benim d&amp;uuml;nyam iş modellerinin nesne y&amp;ouml;nelimli dillerle buluştuğu, bir&amp;ccedil;ok yazılım prensibinin uygulanıp teknik bor&amp;ccedil;ların hortladığı, b&amp;uuml;y&amp;uuml;k &amp;ouml;l&amp;ccedil;ekli teknoloji değişimlerinin yapılıp &amp;ccedil;evik metodolojilerle ilerlendiği i&amp;ccedil;inde Enterprise kelimesinin sıklıkla zikredildiği devasa bir evren. Bu evrende bir &amp;ccedil;ok Neo ve Trinity var. G&amp;uuml;nd&amp;uuml;zleri kurumsal d&amp;uuml;nyanın rutin &amp;ccedil;arklarına adapte olup geceleri farklı d&amp;uuml;nyaların kapılarını a&amp;ccedil;maya &amp;ccedil;alışan. Hal b&amp;ouml;yle olunca insan ister istemez arada bir d&amp;uuml;zen dışına &amp;ccedil;ıkıp kendi konfor alanını terk ederek bambaşka maceralara dalmak istiyor. Ben bunun i&amp;ccedil;in ağırlıklı olarak farklı programlama dillerini &amp;ouml;ğrenmeye &amp;ccedil;alışıyorum. Java, Ruby, Python ve Go bunlardan sadece bazıları. Ciddi anlamda ilgilendiğim bir diğer programlama dili ise Rust.&lt;/p&gt;
&lt;p&gt;Esasında benim gibi yıllarını kurumsal projelerde ge&amp;ccedil;iren ve managed ortamlarda koşturan bir geliştirici i&amp;ccedil;in olduk&amp;ccedil;a ters k&amp;ouml;şe yapan bir dil olduğunu ifade edebilirim. Sadece Ownership, Borrow Checker, Resource Acquisition is Initialization(RAII) gibi unsurları anlamak, Garbage Collection, Null Reference ve Exception Handling gibi y&amp;ouml;netimli kod d&amp;uuml;nyasının mekanizmaları olmadan &amp;ccedil;alışmak bile ilk etapta sizi fazlasıyla zorlayabiliyor. Bu konseptleri anladıktan sonra ise y&amp;uuml;ksek performanslı ve g&amp;uuml;venilir kod yapılarını inşa etmek i&amp;ccedil;in C, C++ gibi dillerden &amp;ccedil;ok daha ciddi bir alternatif olduğu da ortaya &amp;ccedil;ıkıyor&lt;em&gt;(&amp;Ouml;zellikle C, C++ tarafından aşina olduğumuz double free, use after free, dangling pointer gibi kritik hataların hen&amp;uuml;z derleme zamanında &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;tiğini d&amp;uuml;ş&amp;uuml;n&amp;uuml;rsek...)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Rust ile&amp;nbsp;yaklaşık &amp;uuml;&amp;ccedil; yıldır hararetli bir şekilde uğraşmaktayım ve bana kalırsa bir programlama dilini &amp;ouml;ğrenmenin en eğlenceli yollarından birisi de onunla oyunlar yazmaya &amp;ccedil;alışmaktan ge&amp;ccedil;iyor&lt;em&gt;(S&amp;ouml;z gelimi Python ile uğraşıyorsanız onu &amp;ouml;ğrenmenin eğlenceli yollarından birisi IoT cihazlarda kullanmak bir diğeri de onunla eğlenceli terminal oyunları yazmaktır diyebilirim. Tecr&amp;uuml;beyle sabittir)&lt;/em&gt; &amp;Ccedil;ok basit bir terminal oyunu bile dile hakim olma noktasında &amp;ouml;nemli yetkinlikler kazandırabilir. Rust tarafındaki oyun motorları olduk&amp;ccedil;a yetenekli. Her ne kadar hen&amp;uuml;z Unity veya Unreal Engine gibi gelişmiş IDE'ler s&amp;ouml;z konusu olmasa da bir oyun motorunun nasıl &amp;ccedil;alıştığı veya oyun dinamiklerinin ne olduğunu &amp;ouml;ğrenmek i&amp;ccedil;in uğraşmaya değer. Rust oyun programlama tarafı ile ilgili ilk durak noktanız ise &lt;a href="https://arewegameyet.rs/" target="_blank"&gt;Are We Game Yet&lt;/a&gt; olmalı.&lt;/p&gt;
&lt;p&gt;İşin başında temel bazı matematik enstr&amp;uuml;manları da hatırlamak gerekiyor, benden s&amp;ouml;ylemesi :) İşte bu d&amp;uuml;ş&amp;uuml;nceler ışığında ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde&lt;a title="&amp;Ouml;zg&amp;uuml;r Yazılım Topluluğu" href="https://kommunity.com/ozgur-yazilim-toplulugu/events/past" target="_blank"&gt;&lt;strong&gt; &amp;Ouml;zg&amp;uuml;r Yazılım Topluluğunun&lt;/strong&gt;&lt;/a&gt; davetlisi olarak bir sunum ger&amp;ccedil;ekleştirdim. Bir saatlik sunumu iki saat zannedip bana ayrılan zamanı fazlasıyla aştım ve anlatmak istediklerimin tamamını aktaramadım. Bunun i&amp;ccedil;in ikinci bir program yapmaya karar verdik ancak şimdilik bu oturumu paylaşabilirim. L&amp;uuml;tfen yazmaya &amp;ccedil;alıştığım &amp;ccedil;oğu yarım kalan&amp;nbsp;oyunlarımdan y&amp;uuml;ksek bir beklentiniz olmasın. Aslında hepsi &amp;ccedil;&amp;ouml;p ancak ben yazmaya &amp;ccedil;alışırken acayip keyif aldım:) İyi seyirler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;iframe title="YouTube video player" src="https://www.youtube.com/embed/i8vu3XbW3rw?si=dZ8xguuY6zXZtJll" width="560" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;Sunumda &amp;uuml;zerinde durduğum oyunlara ait kodlara aşağıdaki github adreslerinden ulaşabilirsiniz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href="https://github.com/buraksenyurt/game-dev-with-rust/tree/main/lunar_landing" target="_blank"&gt;Lunar Landing&lt;/a&gt;&amp;nbsp;: SDL2&lt;em&gt;(Simple DirectMedia Library)&lt;/em&gt; k&amp;uuml;t&amp;uuml;phanesi kullanılarak, 1969 yapımı Lunar Landing oyunundan esinlenilerek geliştirilmiştir.&lt;/li&gt;
&lt;li&gt;&lt;a href="https://github.com/buraksenyurt/game-dev-with-rust/tree/main/slam-dunk-manager" target="_blank"&gt;Slam Dunk Manager&lt;/a&gt; : Herhangi bir oyun motoru kullanmayan, sadece terminalden &amp;ccedil;alışmak &amp;uuml;zere planlanmış bir basketbol menejerlik oyunudur. İlk kez kurcaladığım Game Design Document &amp;ouml;rneğini de i&amp;ccedil;ermektedir.&lt;/li&gt;
&lt;li&gt;&lt;a href="https://github.com/buraksenyurt/game-dev-with-rust/tree/main/tetra-pong" target="_blank"&gt;Tetra Pong&lt;/a&gt;&amp;nbsp;: Tetra framework kullanılarak geliştirilmiş bir oyundur.&lt;/li&gt;
&lt;li&gt;&lt;a href="https://github.com/buraksenyurt/game-dev-with-rust/tree/main/wing-pilot-2042" target="_blank"&gt;Wing&amp;nbsp;Pilot 2024&lt;/a&gt;&amp;nbsp;: Macroquad motoru kullanılarak Commodor 64 i&amp;ccedil;in yazılmış 1942 oyunundan esinlenilerek geliştirilmiştir.&lt;/li&gt;
&lt;li&gt;&lt;a href="https://github.com/buraksenyurt/game-dev-with-rust/tree/main/on-my-way" target="_blank"&gt;On My Way&lt;/a&gt;&amp;nbsp;: Bevy oyun motoru ile geliştirilmiş ECS&lt;em&gt;(Entity Component System)&lt;/em&gt;&amp;nbsp;altyapısı kullanılan bir oyundur.&lt;/li&gt;
&lt;li&gt;&lt;a href="https://github.com/buraksenyurt/rust-farm/tree/main/Practices/packman" target="_blank"&gt;Packyman&lt;/a&gt;&amp;nbsp;:&amp;nbsp;Hands-on Rust: Effective Learning through 2D Game Development and Play isimli kitabın yazarı Herbert Wolverson tarafından geliştirilmiş Bracket-Lib k&amp;uuml;t&amp;uuml;phanesi kullanılarak yazılmış bir oyundur.&lt;/li&gt;
&lt;li&gt;&lt;a href="https://github.com/buraksenyurt/missile-command" target="_blank"&gt;Missile Command&lt;/a&gt; : Macroquad ile geliştirilmiş efsanevi Atari Missile Command oyununun ilkel bir klonudur.&lt;/li&gt;
&lt;li&gt;&lt;a href="https://github.com/buraksenyurt/learning_unity" target="_blank"&gt;Unity Learning&lt;/a&gt;&amp;nbsp;: Linux &amp;uuml;zerinde Unity ile ilgili &amp;ouml;ğrendiklerime yer verdiğim repodur.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Ayrıca oyun geliştirme macerasında bana yardımcı olan, referans olarak kullandığım kitapları da ş&amp;ouml;yle sıralayabilirim.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href="https://www.amazon.com/Math-Primer-Graphics-Game-Development/dp/1568817231" target="_blank"&gt;3D Math Primer for Graphics and Game Development&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="https://www.amazon.com/Engine-Architecture-Third-Jason-Gregory/dp/1138035459" target="_blank"&gt;Game Engine Architecture&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="https://www.amazon.com/Game-Development-Rust-WebAssembly-building/dp/1801070970" target="_blank"&gt;Game Development with Rust and WebAssembly: Learn how to run Rust on the web while building a game&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="https://www.amazon.com/Exploring-Game-Mechanics-Principles-Techniques-ebook/dp/B0BQZS568Q/" target="_blank"&gt;Exploring Game Mechanics: Principles and Techniques to Make Fun, Engaging Games&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="https://www.amazon.com/Mazes-Programmers-Twisty-Little-Passages-ebook/dp/B013HA1UY4/" target="_blank"&gt;Mazes for Programmers: Code Your Own Twisty Little Passages&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="https://www.amazon.com/Hands-Rust-Herbert-Wolverson-ebook/dp/B09BK8Q6GY/" target="_blank"&gt;Hands-on Rust&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="https://www.amazon.com/Big-Book-Small-Python-Programming-ebook/dp/B08FH9FV7M/" target="_blank"&gt;The Big Book of Small Python Projects: 81 Easy Practice Programs&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="https://www.amazon.com/Essential-Mathematics-Games-Interactive-Applications/dp/B01K0U7RKU/" target="_blank"&gt;Essential Mathematics for Games and Interactive Applications: A Programmer's Guide&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="https://www.amazon.com/Beginning-NET-Game-Programming-C/dp/1590593197/" target="_blank"&gt;Beginning .NET Game Programming in C#&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;</content>
  <pubDate>2024-02-28 16:03:00</pubDate>
  <slug>kurumsal-yazilimcinin-oyun-gelistirme-ile-imtihani</slug>
  <tags>
    <tag>game-programming</tag>
    <tag>rust</tag>
    <tag>unity-framework</tag>
    <tag>unity</tag>
    <tag>c#</tag>
    <tag>matematik</tag>
    <tag>oyun-matematiği</tag>
    <tag>oyun-programlama</tag>
  </tags>
  <categories>
    <category>Rust</category>
  </categories>
</post>