<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tek Fotoluk İpucu 128 - IFormattable ile Sihir</title>
  <description>Bildiğiniz üzere .Net Framework çatısı altında bir çok arayüz(Interface) vardır. Özellikle plug-in tabanlı geliştirmelerde sıklıkla başvurduğumuz bu arayüzleri zaman zaman inceliyor ve nerelerde kullanılabileceğine bakıyorum. Yine bu araştırmaları yaptığım bir gün IFormattable arayüzünün kullanımına ilişkin örnekler ile karşılaştım. Senaryomuz şu; bir nesne örneğini String sınıfının Format metodu ile kullanırken {0:JSON} gibi bir ifade kullanabilmek ve çalışma zamanı içeriğini JSON(JavaScript Object Notation) formatında elde etmek istiyoruz. Hatta {0:ALL} , {0:ID,Title} gibi ifadelere de yer vermek istiyoruz.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bildiğiniz &amp;uuml;zere &lt;strong&gt;.Net Framework&lt;/strong&gt; &amp;ccedil;atısı altında bir &amp;ccedil;ok &lt;strong&gt;aray&amp;uuml;z&lt;em&gt;(Interface)&lt;/em&gt;&lt;/strong&gt; vardır. &amp;Ouml;zellikle &lt;strong&gt;plug-in&lt;/strong&gt; tabanlı geliştirmelerde sıklıkla başvurduğumuz bu aray&amp;uuml;zleri zaman zaman inceliyor ve nerelerde kullanılabileceğine bakıyorum. Yine bu araştırmaları yaptığım bir g&amp;uuml;n &lt;strong&gt;IFormattable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n kullanımına ilişkin &amp;ouml;rnekler ile karşılaştım.&lt;/p&gt;
&lt;p&gt;Senaryomuz şu; bir nesne &amp;ouml;rneğini &lt;strong&gt;String&lt;/strong&gt; sınıfının &lt;strong&gt;Format&lt;/strong&gt; metodu ile kullanırken &lt;strong&gt;{0:JSON}&lt;/strong&gt; gibi bir ifade kullanabilmek ve &amp;ccedil;alışma zamanı i&amp;ccedil;eriğini&lt;strong&gt; JSON&lt;em&gt;(JavaScript Object Notation)&lt;/em&gt;&lt;/strong&gt; formatında elde etmek&amp;nbsp;istiyoruz. Hatta &lt;strong&gt;{0:ALL} , {0:ID,Title}&lt;/strong&gt;&amp;nbsp;gibi ifadelere de yer vermek istiyoruz.&lt;/p&gt;
&lt;p&gt;İşte bu ifadede &lt;strong&gt;{0:&lt;/strong&gt; dan sonra gelen par&amp;ccedil;a,&amp;nbsp;&lt;strong&gt;IFormattable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; kullanarak &lt;strong&gt;String&lt;/strong&gt; sınıfının &lt;strong&gt;Format&lt;/strong&gt; metoduna &amp;ouml;ğretebileceğimiz kısım. Nasıl mı? Aynen aşağıdaki fotoğrafta g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/01/TFI_127.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Kodun &amp;ccedil;alışma prensibi olduk&amp;ccedil;a basit. &lt;strong&gt;Product&lt;/strong&gt; sınıfı &lt;strong&gt;IFormattable aray&amp;uuml;z&amp;uuml;n&amp;uuml;&lt;em&gt;(Interface)&lt;/em&gt;&lt;/strong&gt; uyguladığında &lt;strong&gt;ToString&lt;/strong&gt; metodunun ezilmesi gerekiyor. Tabi ezilen bu &lt;strong&gt;ToString&lt;/strong&gt; metodu &lt;strong&gt;String.Format&lt;/strong&gt; tarafından kullanılmakta&lt;em&gt;(L&amp;uuml;tfen kodu debug edip i&amp;ccedil;erisinde basit&amp;ccedil;e gezinin)&lt;/em&gt; &lt;strong&gt;ToString&lt;/strong&gt; metoduna gelen format değişkeni &lt;strong&gt;{0:&lt;/strong&gt; dan sonraki kısmı işaret etmektedir. Buna gelen değerlere g&amp;ouml;re bir switch bloğu &amp;ccedil;alışmış ve istenen string i&amp;ccedil;erikler geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;lm&amp;uuml;şt&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;Tabii kod i&amp;ccedil;erisinde dikkat edilmesi gereken bir takım hususlar var. &amp;Ouml;rneğin &lt;strong&gt;Object&lt;/strong&gt; tipinden gelen &lt;strong&gt;ToString&lt;/strong&gt; metodu kullanılmak istendiğinde &amp;ccedil;alışma zamanı nasıl bir &amp;ccedil;ıktı &amp;uuml;retir.&amp;nbsp;Yani &lt;strong&gt;product&lt;/strong&gt; nesne &amp;ouml;rneği &amp;uuml;zerinden &lt;strong&gt;ToString()&lt;/strong&gt; &amp;ccedil;ağırırsak ne olur? Bir şey olmazsa olması i&amp;ccedil;in ne yapılabilir? &lt;strong&gt;case "XML":&lt;/strong&gt; sonrasında bir &lt;strong&gt;XML&lt;/strong&gt; serileştirme yapılabilir. Tabii geriye &lt;strong&gt;string&lt;/strong&gt; olarak d&amp;ouml;n&amp;uuml;lmelidir. &lt;strong&gt;{0:&lt;/strong&gt; sonrası i&amp;ccedil;in farklı ifadeler de ele alınabilir. Bu kutsal g&amp;ouml;revi de siz değerli okurlarıma bırakıyorum. B&amp;ouml;ylece geldik bir ipucunun daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-01-13 19:00:00</pubDate>
  <slug>tek-fotoluk-ipucu-128-iformattable-ile-sihir</slug>
  <tags>
    <tag>i-formattable</tag>
    <tag>interface</tag>
    <tag>plugin</tag>
    <tag>json</tag>
    <tag>newtonsoft</tag>
    <tag>serialization</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>