<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Distributed Transactions</title>
  <description>Bildiğiniz gibi bir önceki makalemizde Transaction kavramından bahsetmiş, ancak birden fazla veritabanı için geçerli olucak Transaction işlemlerinin Dağıtık Transaction’lar olarak adlandırıldığından sözetmiştik.</description>
  <content>&lt;p&gt;Değerli Okurlarım,&amp;nbsp;&amp;nbsp; Merhabalar.&lt;/p&gt;
&lt;p&gt;Bildiğiniz gibi bir &amp;ouml;nceki makalemizde Transaction kavramından bahsetmiş, ancak birden fazla veritabanı i&amp;ccedil;in ge&amp;ccedil;erli olucak Transaction işlemlerinin Dağıtık Transaction&amp;rsquo;lar olarak adlandırıldığından s&amp;ouml;zetmiştik. Bu makalemizde Dağıtık Transaction&amp;rsquo;ları inceleyecek ve her zaman olduğu gibi konuyu a&amp;ccedil;ıklayıcı basit bir &amp;ouml;rnek geliştireceğiz.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;İş uygulamalarında, &lt;strong style="mso-bidi-font-weight: normal;"&gt;Online Transaction Processing(OLTP)&lt;/strong&gt; dediğimiz olay &amp;ccedil;ok sık kullanılmaktadır. Buna verilecek en g&amp;uuml;zel &amp;ouml;rnek bankaların ATM uygulamalarıdır. Veriler eş zamanlı olarak aynı anda bir b&amp;uuml;t&amp;uuml;n halinde işlenmekte ve g&amp;uuml;ncellenmektedir. Bu tarz projelerin uygulanmasında OLTP tekniği yaygın bir bi&amp;ccedil;imde kullanılmaktadır. Bu tekniğin uygulanabilmesi Dağıtık Transaction&amp;rsquo;ların kullanılmasını gerektirir. .NET ile Dağıtık Transaction&amp;rsquo;lar yazmak i&amp;ccedil;in&lt;strong&gt; Component Services&lt;/strong&gt;&amp;rsquo;ı kullanmamız gerekmektedir. &amp;Ouml;zellikle,&amp;ccedil;ok katlı mimari dediğimiz iş uygulamalarında Dağıtık Transaction&amp;rsquo;ları &amp;ccedil;ok sık kullanırız. Burada Dağıtık Transaction&amp;rsquo;lar başka componentler tarafından &amp;uuml;stlenilir ve Sunu Katmanı ile Veritabanları arasındaki işlemlerin ger&amp;ccedil;ekleştirilmesinde rol oynarlar. Bu component&amp;rsquo;lerin bulunduğu katman İş Katmanı olarakda adlandırılmaktadır.&lt;/p&gt;
&lt;p&gt;Nitekim Componentler aslında Transaction başlatıp gerekli metodları &amp;ccedil;alıştırarak veriler &amp;uuml;zerindeki b&amp;uuml;t&amp;uuml;nsel işlevleri yerine getirir ve transaction&amp;rsquo;ı sonlandırırlar. Yani Sunum Katmanı&amp;rsquo; nda yer alan uygulamalar sadece gerekli verileri parametre olarak iş katmanında yer alan componentlere g&amp;ouml;nderirler. Dolayısıyla &amp;uuml;zerlerinde ilgili veritabanı verileri i&amp;ccedil;in herhangibir fonksiyon veya metodun &amp;ccedil;alıştırılmasına gerek yoktur. B&amp;uuml;t&amp;uuml;n sorumluluk Component Services &amp;lsquo; da yer alan COM+ componentindedir. Burada veirtabanlarına bağlanılır , gerekli d&amp;uuml;zenlemeler bir Transaction i&amp;ccedil;ersinde ger&amp;ccedil;ekleştirilir ve sorunsuz bir transaction t&amp;uuml;m iş par&amp;ccedil;acıkları ile teyid edilerek gerekli d&amp;uuml;zenlemeler veritabanlarına yansıtılır.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;En basit haliyle 3 katlı mimaride, Sunum Katmanı ile Veritabanları arasındaki transaction işlemlerini COM+ Component&amp;rsquo;leri ile ger&amp;ccedil;ekleştirebiliriz. Bu component&amp;rsquo;ler Windows 2000&amp;rsquo; den itibaren Component Service olarak adlandırılan bir servis altında yer almaktadırlar. Elbetteki bu component&amp;rsquo;i biz geliştireceğiz. Component&amp;rsquo;in g&amp;ouml;revi , transaction işlemlerinin otomatik yada manuel olarak ger&amp;ccedil;ekleştirilmesini sağlamaktır. Bir dll dosyası haline getirilen bu component&amp;rsquo;leri istenilen Sunum Katmanı uygulamasına ekleyerek kullanabiliriz.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Yazacağımız component i&amp;ccedil;inde Transaction işlemlerini kullanabilmek amacıyla .NET i&amp;ccedil;erisinde yer alan &lt;strong&gt;System.EnterpriseServices&lt;/strong&gt; sınıfının metodlarını kullanırız. Oluşturulan component&amp;rsquo;i &amp;ouml;rneklerimizde de g&amp;ouml;receğiniz gibi bir &lt;strong&gt;Strong Name&lt;/strong&gt; haline getirmemizde gerekmektedir. &amp;Ouml;rneğimizi yazarken bunları daha iyi anlıyacaksınız.&amp;Uuml;&amp;ccedil; katlı mimaride, Dağıtık Transaction uygulamalarının aşağıdaki şekil ile zihnimizde daha berrak canlanacağı kanısındayım.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&amp;nbsp;&lt;img src="/makale/images/mk7_1.gif" alt="" width="500" height="500" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 1. 3 Katlı Mimari i&amp;ccedil;in COM+ Kullanımı&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zetlemek gerekirse, Dağıtık Transaction&amp;rsquo; ların kullanıldığı uygulamalarda Component Services kullanılması gerekmektedir. Bir Dağıtık Transaction Component&amp;rsquo;i yazdığımızda, transaction işlemlerini otomotik olarak Component Service&amp;rsquo;a yaptırabiliriz. Bunun yanında &lt;strong&gt;ContexrUtil&lt;/strong&gt; adı verilen nesneyi ve bu nesneye ait &lt;strong style="mso-bidi-font-weight: normal;"&gt;SetComplete()&lt;/strong&gt;, &lt;strong&gt;SetAbort()&lt;/strong&gt; gibi metodları kullanarak Transaction işlmelerini elle de yapılandırabiliriz. Bu makalemizde otomatik olanı se&amp;ccedil;tim. Bir sonraki makalede işlemleri manuel olarak yapıcağız.Dilerseniz &amp;ouml;rneğimize ge&amp;ccedil;elim . Bu uygulamızda 2 veritabanı &amp;uuml;zerindeki 2 farklı tablo i&amp;ccedil;in, bir Transaction i&amp;ccedil;erisinde basit veri giriş işlemleri ger&amp;ccedil;ekleştireceğiz. &amp;Ouml;ncelikle tablolarımın yapısını ve databaselerimizi belirtelim.&amp;nbsp;Firends isimli bir Veritabanı&amp;rsquo; nda kullanacağımız basit bir tablo var. Satislar isimli bu tabloda Ad,Soyad ve SatisTutari alanları yer almakta.&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&amp;nbsp;&lt;img src="/makale/images/mk7_2.gif" alt="" width="404" height="455" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 2. Satislar tablosunun yapısı.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;İkinci Veritabanımız ise IstanbulMerkez. Tablolamuzun adı Primler. Bu tabloda ise yine Ad,Soyad ve Prim bilgisi yer alıyor.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;&lt;img src="/makale/images/mk7_3.gif" alt="" width="404" height="455" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 3. Primler tablosunun yapısı.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Uygulamamızda Satislar isimli tabloya bilgi girildikten sonra SatisTutari&amp;rsquo;nin %10&amp;rsquo; u &amp;uuml;zerinden prim hesaplanıcak ve aynı anda Primler tablosuna bu bilgiler eklenecek. Tabiki bu iki basit veritabanı işlemi bir Transaction i&amp;ccedil;inde ger&amp;ccedil;ekleştirilecek. Uygulamamızı tasarlamaya başlayalım. &amp;Ouml;nce yeni bir C# ile yeni bir &lt;strong style="mso-bidi-font-weight: normal;"&gt;Windows Application&lt;/strong&gt; oluşturalım. Bu uygulamanın i&amp;ccedil;erdiği Form Sunum Katmanı&amp;rsquo; nda yer alan veri giriş ekranımız olucaktır. Formu aşağıdakine benzer veya aynı şekilde tasarlayalım. &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;img src="/makale/images/mk7_4.gif" alt="" width="319" height="224" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 4. Formun yapısı.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Kullanıcı bu ekrandan Ad,Soyad ve Satış Tutarı bilgilerini girecek. Girilen bu bilgiler, yazacağımız COM+ Componentindeki metoda parametre olarak gidicek ve bu metod i&amp;ccedil;inde işlenerek veritabanlarındaki tablolarda gerekli d&amp;uuml;zenlemeler yapılıcak. Eğer t&amp;uuml;m işlmeler başarılı olursa ve metod tam olarak &amp;ccedil;alışırsa geriyede işlemlerin dolayısıyla Transaction&amp;rsquo;ın başarıl olduğuna dair bir string bilgi g&amp;ouml;nderecek.&amp;nbsp;Evet şimdi uygulamanın en &amp;ouml;nemli kısmına sıra geldi . Componentin tasarlanmasına. İlk &amp;ouml;nce, Project men&amp;uuml;s&amp;uuml;nden &lt;strong style="mso-bidi-font-weight: normal;"&gt;Add Component&lt;/strong&gt; komutunu vererek component&amp;rsquo; imizi uygulamamıza ekliyoruz.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&amp;nbsp;&lt;img src="/makale/images/mk7_5.gif" alt="" width="531" height="399" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;Ş&lt;em&gt;ekil 5. Component Eklemek.&amp;nbsp;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Ben componentimize SatisPrimEkle adini verdim. Bu durumda Solution&amp;rsquo;ımıza SatisPrimEkle.cs isimli dosya eklenir ve Visual Studio.NET IDE&amp;rsquo;de aşağıdaki gibi g&amp;ouml;r&amp;uuml;n&amp;uuml;r. &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;img src="/makale/images/mk7_6.gif" alt="" width="478" height="233" border="0" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 6. Componentin ilk eklendiğinde IDE&amp;rsquo; de durum.&amp;nbsp;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdi ise bu component i&amp;ccedil;ersinde yer alıcak dağıtık transaction işlemleri i&amp;ccedil;in gerekli olan referansımızın projemize eklememize gerekiyor. Daha &amp;ouml;ncede System.EnterpriseServices olarak bahsettiğimiz bu sınıfı eklemek i&amp;ccedil;in yine, Project men&amp;uuml;s&amp;uuml;nden, &lt;strong style="mso-bidi-font-weight: normal;"&gt;Add Reference&lt;/strong&gt; komutunu veriyoruz. Burada ise .NET sekmesinden &lt;strong&gt;System.EnterpriseServices&lt;/strong&gt; sınıfını ekliyoruz.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&amp;nbsp;&lt;img src="/makale/images/mk7_7.gif" alt="" width="566" height="446" border="0" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;Şekil 7. System.EnterpriseServices Sınıfının eklenmesi.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdi Componentimizin kodlarını yazmaya başlayabiliriz. &lt;strong style="mso-bidi-font-weight: normal;"&gt;To Switch To Code Window&lt;/strong&gt; linkine tıklayarak component&amp;rsquo; imizin kodlarına ge&amp;ccedil;iş yapıyoruz. İlk haliye kodlar aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ComponentModel;
using System.Collections;
using System.Diagnostics; 
namespace distrans
{
     /// &amp;lt;summary&amp;gt;
     /// Summary description for SatisPrimEkle.
     /// &amp;lt;/summary&amp;gt;
     public class SatisPrimEkle : System.ComponentModel.Component
     {
          /// &amp;lt;summary&amp;gt;
          /// Required designer variable.
          /// &amp;lt;/summary&amp;gt;
          private System.ComponentModel.Container components = null;
           public SatisPrimEkle(System.ComponentModel.IContainer container)
          {
               ///
               /// Required for Windows.Forms Class Composition Designer support
               ///
               container.Add(this);
               InitializeComponent();
                //
               // TODO: Add any constructor code after InitializeComponent call
               //
          } 
          public SatisPrimEkle()
          {
               ///
               /// Required for Windows.Forms Class Composition Designer support
               ///
               InitializeComponent();
               //
               // TODO: Add any constructor code after InitializeComponent call
               //
          } 
          /// &amp;lt;summary&amp;gt;
          /// Clean up any resources being used.
          /// &amp;lt;/summary&amp;gt;
          protected override void Dispose( bool disposing )
          {
               if( disposing )
               {
                    if(components != null)
                    {
                         components.Dispose();
                    }
               }
               base.Dispose( disposing );
          } 
          #region Component Designer generated code
          /// &amp;lt;summary&amp;gt;
          /// Required method for Designer support - do not modify
          /// the contents of this method with the code editor.
          /// &amp;lt;/summary&amp;gt;
          private void InitializeComponent()
          {
               components = new System.ComponentModel.Container();
          }
          #endregion
     }
}&lt;/pre&gt;
&lt;p&gt;Biz buradaki&amp;nbsp; kodları aşağıdaki şekliyle d&amp;uuml;zenleyecek ve yukarıda yazılı &amp;ccedil;oğu kodu &amp;ccedil;ıkartacağız. Haydi&amp;nbsp; başlayalım. &amp;Ouml;ncelikle using&amp;nbsp; kısmına,&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Data.SqlClient;
using System.EnterpriseServices;&lt;/pre&gt;
&lt;p&gt;&lt;br /&gt;sınıflarını&amp;nbsp; eklememiz gerekiyor. &amp;Ccedil;&amp;uuml;nk&amp;uuml; Transaction&amp;nbsp; işlemleri i&amp;ccedil;in &lt;strong style="mso-bidi-font-weight: normal;"&gt;EnterpriseServices&lt;/strong&gt;&amp;nbsp; sınıfını ve veritabanı&amp;nbsp; işlemlerimiz i&amp;ccedil;inde &lt;strong style="mso-bidi-font-weight: normal;"&gt;SqlClient&lt;/strong&gt; sınıfında yer alan nesnelerimizi kullanacağız.&amp;nbsp;&amp;nbsp; İkinci&amp;nbsp; k&amp;ouml;kl&amp;uuml; değişimiz ise SatisPrimEkle isimli sınıfımızın &lt;strong&gt;ServicedComponent&lt;/strong&gt; sınfından t&amp;uuml;retilmiş&amp;nbsp; olması. Bu değişikliği ve&amp;nbsp; diğer fazlalıkları &amp;ccedil;ıkarttığımız takdirde,&amp;nbsp; kodlarımızın son hali&amp;nbsp; aşağıdaki gibi olucaktır.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ComponentModel;
using System.Collections;
using System.Diagnostics;
using System.Data.SqlClient;
using System.EnterpriseServices; 
namespace distrans
{
     public class SatisPrimEkle : ServicedComponent
     {   
     }
}&lt;/pre&gt;
&lt;p&gt;Şimdi&amp;nbsp; metodumuzu ekliyelim ve gerekli kodlamaları yazalım.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ComponentModel;
using System.Collections;
using System.Diagnostics;
using System.Data.SqlClient;
using System.EnterpriseServices; 
namespace distrans
{
     /* [Transaction(TransactionOption.Required)] satırı ile belirtilen şudur. Component&amp;rsquo; imiz var olan Transaction i&amp;ccedil;erisinde &amp;ccedil;alıştırılacaktır. Ancak eğer oluşturulmuş yani başlatılmış bir transaction yoksa, bu component&amp;rsquo; imiz i&amp;ccedil;in yeni bir tane oluşturulması sağlanacaktır. Burada,

     TransactionOption'ın sahip olabileceği diğer değerler Disabled, NotSupported, RequiresNew ve Supported dır.

     Disabled durumunda, transaction &amp;ouml;zelliği g&amp;ouml;rmezden gelinir. Default olarak bu değer kabul edilir. Bu durumda Transaction başlatılması gibi işlemler manuel olarak yapılır.

     Not Supported durumunda ise Component&amp;rsquo; imiz bir transaction var olsa bile bu transaction'ın dışında &amp;ccedil;alışıcaktır.

     RequiresNew durumunda, Component&amp;rsquo; imiz i&amp;ccedil;in bir transaction var olsada olmasada mutlaka yeni bir transaction başlatılacaktır.

     Supported durumu ise , var olan bir transaction olması durumunda, Component&amp;rsquo; imizin bu transaction'a katılmasını sağlar.

     Biz uygulamamızda otomatik transaction tekniğini kullandığımız i&amp;ccedil;in Required se&amp;ccedil;eneğini kullanıyoruz.

     */

     [Transaction(TransactionOption.Required)]public class SatisPrimEkle : ServicedComponent
     {
     /* AutoComplete() satırı izleyen metodun bir transaction i&amp;ccedil;erisinde yer alacağını ve transaction işlemlerinin başlatılması ve bitirilmesini Component Services 'ın &amp;uuml;stleneceğini belirtir. Dolayısıyla Component&amp;rsquo; imizin bu metodunu &amp;ccedil;alıştırdığımızda bir transaction başlatılır ve ContexUtil nesnesi ile manuel olarak yapacağımız SetComplete (Commit) ve SetAbort(Rollback) hareketlerini COM+ Servisi kendisi yapar. */ 
          [AutoComplete()]public string VeriGonder(string ad,string soyad,double satisTutari)
          {
               SqlConnection conFriends = new SqlConnection("initial catalog=Friends;data source=127.0.0.1;integrated security=sspi;packet size=4096");
               SqlConnection conIstanbulMerkez = new SqlConnection("initial catalog=IstanbulMerkez;data source=127.0.0.1;integrated security=sspi;packet size=4096"); 
               /* Yukarıdaki SqlConnection nesneleri tanımlanırken data source &amp;ouml;zelliklerine sql sunucusunun bulunduğu ip adresi girildi. Bu farklı ip'lere sahip sunucular s&amp;ouml;z konusu olduğunda farklı veritabanlarınıda kullanabiliriz anlamına gelmektedir. Uygulamamızı aynı sunucu &amp;uuml;zerinde ger&amp;ccedil;ekleştirmek zorunda olduğum i&amp;ccedil;in aynı ip adreslerini verdim.*/ 
               /* Aşğıdaki satırlarda veri girişi i&amp;ccedil;in gerekli sql c&amp;uuml;mlelerini hazırladık ve bunları SqlCommand nesneleri ile ilişkilendirip &amp;ccedil;alıştırdık. */
               string sql1="INSERT INTO Satislar (Ad,Soyad,SatisTutari) VALUES ('"+ad+"','"+soyad+"',"+satisTutari+")";
               double prim=satisTutari*0.10; 
               string sql2="INSERT INTO Primler (Ad,Soyad,Prim) VALUES ('"+ad+"','"+soyad+"',"+prim+")"; 
               SqlCommand cmdSatisGir=new SqlCommand(sql1,conFriends);
               SqlCommand cmdPrimGir=new SqlCommand(sql2,conIstanbulMerkez);
               conFriends.Open();
               conIstanbulMerkez.Open(); 
               cmdSatisGir.ExecuteNonQuery();
               cmdPrimGir.ExecuteNonQuery(); 
               return "ISLEM TAMAM"; /* Metod başarılı bir şekilde &amp;ccedil;alıştığında, COM+ sevisi transaction'ı otomatik olarak sonlandırır ve metodumuz geriye ISLEM TAMAM stringini d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. */ 
          }
     }
}&lt;/pre&gt;
&lt;p&gt;Component&amp;rsquo; imizi&amp;nbsp; oluşturduktan sonar bunu Sunum&amp;nbsp; Katmanındaki uygulamalarda kullanabilmek ve COM+ Servisi&amp;rsquo;nede eklenmesini sağlamak i&amp;ccedil;in bir &lt;strong style="mso-bidi-font-weight: normal;"&gt;Strong Name Key&lt;/strong&gt; dosyası oluşturmamız gerekiyor. Bu IDE dışından ve &lt;strong style="mso-bidi-font-weight: normal;"&gt;sn.exe&lt;/strong&gt; isimli dosya ile yapılan bir işlemdir. &amp;nbsp;Bunun i&amp;ccedil;in D:\Program Files\Microsoft.NET\FrameworkSDK\Bin\sn.exe dosyasını kullanacağız. İşte komutun &amp;ccedil;alıştırılışı;&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;img src="/makale/images/mk7_8.gif" alt="" width="638" height="338" border="0" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 8. sn.exe ile snk(strong name key) dosyasının oluşturulması.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong style="mso-bidi-font-weight: normal;"&gt;snk&lt;/strong&gt; &lt;strong style="mso-bidi-font-weight: normal;"&gt; uzantılı&lt;/strong&gt; dosyamız oluşturuldu. Şimdi Formumuzda bu Component&amp;rsquo; imize ait metodu kullanabilmek i&amp;ccedil;in oluşturulan bu snk uzantılı dosyayı Solution&amp;rsquo;ımıza &lt;strong style="mso-bidi-font-weight: normal;"&gt;Add Exciting Item&lt;/strong&gt; se&amp;ccedil;eneği ile eklememiz gerekiyor. Aşağıdaki 3 şekilde bu adımları g&amp;ouml;rebilirsiniz.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&amp;nbsp;&lt;img src="/makale/images/mk7_9.gif" alt="" width="287" height="314" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;img src="/makale/images/mk7_10.gif" alt="" width="601" height="393" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;img src="/makale/images/mk7_11.gif" alt="" width="201" height="225" /&gt; &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 9 . SatisPrimEkle.snk dosyasının projemize eklenmesi.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Formumuzda Component&amp;rsquo; imize ait metodu kullanabilmek i&amp;ccedil;in yapmamız gereken bir adım daha var. Oda uygulamanın &lt;strong&gt;AssemblyInfo.cs&lt;/strong&gt; dosyasına aşağıdaki kod satırını eklemek.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[assembly: AssemblyKeyFile("..\\..\\SatisPrimEkle.snk")]&lt;/pre&gt;
&lt;p&gt;Şimdi formumuzdaki kodları inceleyelim. &amp;Ouml;ncelikle SatisPrimEkle tipinde bir nesne tanımlıyoruz. Şimdi bu nesnesin VeriGonder isimli metoduna eriştiğimizde aşağıdaki şekilde g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi IntelliSense &amp;ouml;zelliği bize kullanabileceğimiz parametreleride g&amp;ouml;steriyor.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&amp;nbsp;&lt;img src="/makale/images/mk7_12.gif" alt="" width="529" height="162" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 10. Metodun kullanım.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdi t&amp;uuml;m kodumuzu tamamlayalım ve &amp;ouml;rneğimizi &amp;ccedil;alıştıralım.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnGonder_Click(object sender, System.EventArgs e)
{
     SatisPrimEkle comp=new SatisPrimEkle();
     double st=System.Convert.ToDouble(txtSatisTutari.Text); 
     try
     {
MessageBox.Show(comp.VeriGonder(txtAd.Text,txtSoyad.Text,st)); 
     }
     catch(Exception hata)
     {
          MessageBox.Show(hata.Source + ":" + hata.Message);
     }
}&lt;/pre&gt;
&lt;p&gt;Şimdi &amp;ouml;rneğimizi &amp;ccedil;alıştıralım. &amp;nbsp;&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;img src="/makale/images/mk7_13.gif" alt="" width="320" height="224" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;img src="/makale/images/mk7_14.gif" alt="" width="104" height="107" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 11. ISLEM TAMAM&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi , metodumuz başarılı bir şekilde &amp;ccedil;alıştırıldı. Hemen tablolarımızı kontrol edelim. &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;img src="/makale/images/mk7_15.gif" alt="" width="559" height="58" border="0" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 12. IstanbulMerkez veritabanındaki Primler Tablosu.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;img src="/makale/images/mk7_16.gif" alt="" width="559" height="102" border="0" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 13. Friends veritabanındaki Satislar tablosu.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdi &lt;strong style="mso-bidi-font-weight: normal;"&gt;Component Services&amp;rsquo;a&lt;/strong&gt; bakıcak olursak oluşturmuş olduğumuz distrans isimli Component Application&amp;rsquo;ı ve i&amp;ccedil;erdiği SatisPrimEkle isimli Component&amp;rsquo;i, burada da g&amp;ouml;rebiliriz.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;img src="/makale/images/mk7_17.gif" alt="" width="640" height="480" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt;Şekil 14. Componet Services.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bir sonraki makalemizde aynı &amp;ouml;rneği Manuel y&amp;ouml;ntemelerle ve dolayısıyla ContextUtil sınıfının metodları ile ger&amp;ccedil;ekleştireceğiz. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2003-11-19 12:00:00</pubDate>
  <slug>Distributed-Transactionsc2a0-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>tansactions</tag>
    <tag>distributed-transactions</tag>
    <tag>com+</tag>
    <tag>component-services</tag>
    <tag>oltp</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>