<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF - One Way Ticket</title>
  <description>One Way Ticket...One Way Ticket... Bu sözleri duyduğumda aklıma bu şarkıyı yapan eruption ve cover versiyonunu söyleyip efsaneleşen Boney M grupları gelir. Ancak One Way ikilisi ne tesadüftürki .Net Remoting mimarisinde de karşımıza çıkmaktadır.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;One Way Ticket...One Way Ticket... Bu s&amp;ouml;zleri duyduğumda aklıma bu şarkıyı yapan eruption ve cover versiyonunu s&amp;ouml;yleyip efsaneleşen Boney M grupları gelir. Ancak One Way ikilisi ne tesad&amp;uuml;ft&amp;uuml;rki .Net Remoting mimarisinde de karşımıza &amp;ccedil;ıkmaktadır. Kısaca tek y&amp;ouml;n olarak &amp;ccedil;evirebileceğimiz bu iki kelime aslında fırlat ve unut&lt;strong&gt;(fire and forget) &lt;/strong&gt;&amp;nbsp;anlamındada d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Yada bir başka deyişle istemci tarafından olaya bakıldığında, "metodu &amp;ccedil;ağırdım gerisi umrumda değil" de denebilir. Aynı kelimelerin &lt;strong&gt;Windows Communication Foundation&lt;/strong&gt; i&amp;ccedil;erisinde de yer alması elbetteki şaşırtıcı değildir. Nitekim One Way operasyonlar aslında asenkron istemci-sunucu modelininde &amp;ouml;nemli bir par&amp;ccedil;asıdır.&lt;/p&gt;
&lt;p&gt;Normal şartlarda Windows Communication Foundation istemcileri servisten bir talepte bulunduklarında, proxy tarafından hazırlanan mesaj sunucuya g&amp;ouml;nderilir. Servis gelen mesajı alır, &amp;ccedil;&amp;ouml;z&amp;uuml;mler ve gereken y&amp;uuml;r&amp;uuml;tme işlemlerini ger&amp;ccedil;ekleştirir. Burada s&amp;ouml;z konusu y&amp;uuml;r&amp;uuml;tmeye dahil olan metodların &amp;ccedil;alıştırılmasının sonucunda istemciye bu işlemin tamamlandığı bilgisi eğer geri d&amp;ouml;n&amp;uuml;ş değeri var ise onunla birlikte d&amp;ouml;ner. Bu, talep/cevap mesajlaşma deseni &lt;strong&gt; (request/response messaging pattern)&lt;/strong&gt; olarak adlandırılan klasik &amp;ccedil;alışma modelidir. Ancak burada istemcinin &amp;ccedil;ağrıda bulunduğu metodun tamamlanışını beklemesi gerekir. Aksi takdirde ilerlemesi s&amp;ouml;z konusu değildir. Burada bahsi ge&amp;ccedil;en konu kod satırında bir alt ifadeye ge&amp;ccedil;ilememesidir. &amp;Ccedil;ok doğal olarak servis tarafındaki metodun &amp;ccedil;alışmasının uzun s&amp;uuml;rd&amp;uuml;ğ&amp;uuml; durumlarda istemci uygulama beklemede olacaktır.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle istemci tarafındaki uygulamaların &amp;ccedil;ağrıda bulundukları metodlar geriye değer d&amp;ouml;nd&amp;uuml;rm&amp;uuml;yorlarsa asenkron programlama (&lt;strong&gt;asynchronous programmin&lt;/strong&gt;) adına &lt;strong&gt;One Way&lt;/strong&gt; tekniğinden yararlanılabilir. One Way tekniği uygulanması kolay olmasına rağmen dikkat edilmesi gereken noktalara sahiptir. İşte bu makalemizde s&amp;ouml;z konusu noktalara değinerek One Way tekniğinin WCF a&amp;ccedil;ısından detaylarını g&amp;ouml;rmeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;İstemci programların uzak metod &amp;ccedil;ağrımlarında uygulamaları duraksatmasını engellemek adına kullanılabilecek tek yol &lt;strong&gt;One Way&lt;/strong&gt; değildir. Diğer Asenkron erişim modelleride ele alınabilir. Bunlar ilerleyen makalelerimizde ele alınacaktır. One Way ve diğer asenkron modellerinde istemci ve sunucu uygulamaların aynı zaman diliminde &amp;ccedil;alışıyor olmaları gerekir. Bunun aksi bir durumda ise &lt;strong&gt;Message Queue&lt;/strong&gt; sisteminin kullanılmasında fayda vardır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;One Way formasyonuna uygun bir &amp;ccedil;ağrım i&amp;ccedil;in &lt;strong&gt;OperationContract&lt;/strong&gt; niteliğinin &lt;strong&gt;IsOneWay&lt;/strong&gt; &amp;ouml;zelliğine true değerini aktarmak yeterlidir. OneWay metodlar ile ilişkili bilinmesi gereken &amp;ouml;ncelikli kurallar vardır. Herşeyden &amp;ouml;nce OneWay olarak işaretlenenen metodlar geri d&amp;ouml;n&amp;uuml;ş değerine sahip olmazlar. Bir başka deyişle bu metodlar &lt;strong&gt;void&lt;/strong&gt; olarak tanımlanırlar. Burada metoda parametre olarak &lt;strong&gt;ref&lt;/strong&gt; veya &lt;strong&gt;out&lt;/strong&gt; tipinden aktarımlar yapılmak istenebilir ancak buda m&amp;uuml;mk&amp;uuml;n değildir. Diğer taraftan s&amp;ouml;z konusu metodlar i&amp;ccedil;erisinde &amp;ccedil;ok doğal olarak istisnalar(Exceptions) olabilir. Burada s&amp;ouml;z konusu olan SOAP hata mesajları&lt;strong&gt; (SOAP Fault Message)&lt;/strong&gt; istemci tarafına g&amp;ouml;nderilmez. Bu sebeplerden &amp;ouml;t&amp;uuml;r&amp;uuml; istemci servis &amp;uuml;zerindeki metodun başarılı bir şekilde tamamlanıp tamamlanmadığını asla bilemez.&lt;/p&gt;
&lt;p&gt;Ancak en azından istemcinin g&amp;ouml;nderdiği metod &amp;ccedil;ağrısı mesajının servise ulaşıp ulaşmadığının bilinmesinde yarar vardır. Eğer servis uygulaması &amp;ccedil;alışmıyorsa &amp;ccedil;ok doğal olarak istemci bir istisna alacaktır ki bu durumda istemciden g&amp;ouml;nderilen talebin ulaşmadığı zaten doğrudan anlaşılabilir. Ancak bazı iletişim protokollerinde (&amp;ouml;rneğin &lt;strong&gt;Tcp&lt;/strong&gt;) gelen mesajlar tampona alınırarak işlenirler. Arka arkaya gelen bu taleplere ait mesajların toplu olarak bir maksimum sayısı vardır. Sonu&amp;ccedil;ta birden fazla istemci s&amp;ouml;z konusudur ve bunların g&amp;ouml;nderecekleri sayısız &amp;ccedil;ağrı bulunmaktadır.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;yle bir durumda eğer servis tarafında kabul edilebilen maksimum talep sayısı aşılırsa gelen yeni talepler var olan yarım kalmışlar tamamlanıncaya kadar beklemeye alınır. Dolayısıyla istemci uygulama her ne kadar OneWay &amp;ccedil;ağrısı yapsada beklemede kalır. Bu durumla başedebilmek i&amp;ccedil;in g&amp;uuml;venilir oturumlar &lt;strong&gt; (Reliable Session)&lt;/strong&gt; a&amp;ccedil;ılmasında fayda vardır. G&amp;uuml;venilir oturumlar sayesinde servis, bir &amp;ccedil;ağrı aldığında gelen mesajı işlemeye başladığına dair istemciye bilgi g&amp;ouml;nderebilir.&lt;/p&gt;
&lt;p&gt;One Way tekniği istemci i&amp;ccedil;in &amp;ouml;nem arz eden &lt;strong&gt;SendTimeout&lt;/strong&gt; s&amp;uuml;relerini &amp;ouml;nemsemez. Normal şartlarda istemciler bir metod &amp;ccedil;ağrısında bulunduklarında varsayılan olarak 1 dakikalık bir timeout s&amp;uuml;releri vardır. Eğer bu s&amp;uuml;re i&amp;ccedil;erisinde servisten bir cevap gelmesse otomatik olarak &lt;strong&gt;TimeoutException&lt;/strong&gt; tipinden bir &amp;ccedil;alışma zamanı hatası alınır. One way operasyonlarında &amp;ccedil;ok doğal olarak bu tip bir s&amp;uuml;re kontrol&amp;uuml; &amp;ouml;nemli değildir. Nitekim istemci tarafı &amp;ccedil;ağrıda bulunduğu metod i&amp;ccedil;in bir cevap beklememektedir. Ama varsayılan olarak bazı aksilikler olacaktır ki ilerleyen kısımlarda buna değinmeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;Şimdi &amp;ouml;rnek bir uygulama &amp;uuml;zerinden ilerleyerek One Way tekniğini nasıl ele alabileceğimizi inclemeye &amp;ccedil;alışacak ve dikkat edilmesi gereken durumları analiz edeceğiz. Bu makalemizdeki &amp;ouml;rneğimizde, file-based olarak web &amp;uuml;zerinde barındırılan bir servis uygulaması yer alacaktır. İstemciyi olayları kolay bir şekilde takip edebilmek adına bir konsol uygulaması olarak tasarlayabiliriz. Burada diğer makalelerimizden farklı olarak &lt;strong&gt; wsHttpBinding&lt;/strong&gt; bağlayıcı tipini ele alacağız. Bu tip aslında &lt;strong&gt; BasicHttpBinding&lt;/strong&gt; bağlayıcı tipine benzerdir ancak g&amp;uuml;venilir oturumlara &lt;strong&gt;(reliable sessions)&lt;/strong&gt; sahip, &lt;strong&gt;transcation&lt;/strong&gt; y&amp;ouml;netimine izin veren &lt;strong&gt;Http&lt;/strong&gt; ve &lt;strong&gt;Https&lt;/strong&gt; iletişim protokollerinin kullanılabildiği, &lt;strong&gt;WS-Adressing&lt;/strong&gt; işlemlerin yapılabildiği bir ortam sunarak ekstra imkanlar sağlar.&lt;/p&gt;
&lt;p&gt;Geliştirilecek servis uygulaması i&amp;ccedil;in &lt;strong&gt;WCF Service &lt;/strong&gt;şablonu kullanılabilir. Bu ama&amp;ccedil;la ilk olarak Visual Studio 2005 ile aşağıdaki gibi bir servis uygulaması a&amp;ccedil;arak işe başlanmalıdır. WCF Service uygulaması f&lt;strong&gt;ile-based&lt;/strong&gt; olarak host edileceğinden ve istemcilerin tek bir adresten ilgili servise erişmeleri istendiğinden projenin Properties penceresindeki &amp;ouml;zelliklerden port numarası sabit bir değere ayarlanabilir. Bu işlem i&amp;ccedil;in &amp;ouml;ncelikle &lt;strong&gt;Dynamic Ports&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;false&lt;/strong&gt; değer atamak gerekir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk206_1.gif" alt="" width="282" height="155" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Servisimiz i&amp;ccedil;in gerekli tiplerimizi ise aşağıdaki gibi geliştirebiliriz. S&amp;ouml;z konusu tipler &lt;strong&gt;App_Code&lt;/strong&gt; klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisinde yer almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk206_2.gif" alt="" width="253" height="299" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;IRaporUretici Aray&amp;uuml;z&amp;uuml; İ&amp;ccedil;eriği;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[ServiceContract(Name = "RaporlamaServisi", Namespace = "http://www.bsenyurt.com/RaporlamaServisi/2007/30/05")]
public interface IRaporUretici
{
    [OperationContract(IsOneWay = true)]
    void RaporUret(string kullaniciAdi);
    [OperationContract(IsOneWay = true)]
    void SatisYapildi(int productId);
}&lt;/pre&gt;
&lt;p&gt;RaporUretici sınıfı i&amp;ccedil;eriği;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class RaporUretici
               : IRaporUretici
{
    #region IRaporUretici Members

    public void RaporUret(string kullaniciAdi)
    {
        Thread.Sleep(65000); // 1 dakika 5 saniye duraksatma
        FileStream fs = new FileStream("C:\\Izleme.txt", FileMode.Append, FileAccess.Write);
        StreamWriter writer = new StreamWriter(fs);
        writer.WriteLine(kullaniciAdi + " İ&amp;Ccedil;İN RAPOR &amp;Uuml;RETME EMRİ VERİLDİ");
        writer.Close();
        fs.Close();
    }

    public void SatisYapildi(int productId)
    {
        Thread.Sleep(65000); // 1 dakika 5 saniye duraksatma
        FileStream fs = new FileStream("C:\\Izleme.txt", FileMode.Append, FileAccess.Write);
        StreamWriter writer = new StreamWriter(fs);
        writer.WriteLine(productId + " &amp;Uuml;R&amp;Uuml;N&amp;Uuml; İ&amp;Ccedil;İN SATIŞ YAPILDI");
        writer.Close();
        fs.Close();
    }

    #endregion
}&lt;/pre&gt;
&lt;p&gt;Aray&amp;uuml;z tanımlaması i&amp;ccedil;erisinde dikkat edilecek olursa &lt;strong&gt;OperationContract&lt;/strong&gt; niteliğinin &lt;strong&gt;IsOneWay&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;true&lt;/strong&gt; değeri atanmıştır. Servis s&amp;ouml;zleşmesini uygulayan sınıf i&amp;ccedil;erisinde sembolik olarak iki metod yer almaktadır. &amp;Ouml;zellikle bu metodların i&amp;ccedil;erisinde &lt;strong&gt;Thread&lt;/strong&gt; sınıfının static &lt;strong&gt;Sleep&lt;/strong&gt; metodu yardımıyla uygulama 65 saniye duraksatılmaktadır. Burada 1 dakikalık TimeOut sınırının aşılmasının doğuracağı bazı sonu&amp;ccedil;lar olacaktır. Bu sonu&amp;ccedil;lar ilerleyen kısımlarda ele alınacaktır. Servis tarafında yer alan web.config dosyasının i&amp;ccedil;eriği aşağıdaki gibi tasarlanabilir.&lt;/p&gt;
&lt;p&gt;web.config i&amp;ccedil;eriği;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0"?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service behaviorConfiguration="RaporlamaServisiBehavior" name="RaporlamaServisi.RaporUretici"&amp;gt;
                &amp;lt;endpoint address="http://localhost:2215/RaporlamaServisi/Service.svc" binding="wsHttpBinding" bindingConfiguration="" name="RaporlamaServisiEndPoint" contract="RaporlamaServisi.IRaporUretici" /&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
        &amp;lt;behaviors&amp;gt;
            &amp;lt;serviceBehaviors&amp;gt;
                &amp;lt;behavior name="RaporlamaServisiBehavior"&amp;gt;
                    &amp;lt;serviceMetadata httpGetEnabled="true"/&amp;gt;
                &amp;lt;/behavior&amp;gt;
            &amp;lt;/serviceBehaviors&amp;gt;
        &amp;lt;/behaviors&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
    &amp;lt;system.web&amp;gt;
        &amp;lt;compilation debug="true"/&amp;gt;
    &amp;lt;/system.web&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Servis web tabanlı olarak host edildiğinden &lt;strong&gt;svc&lt;/strong&gt; uzantılı bir dosyanında var olması gerekmektedir. Bu dosyanın i&amp;ccedil;eriğinde servis s&amp;ouml;zleşmesini uygulayan sınıfın adı ve fiziki dosya adı aşağıdaki gibi yer alır.&lt;/p&gt;
&lt;p&gt;Service.svc;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;% @ServiceHost Language=C# Debug="true" Service="RaporlamaServisi.RaporUretici" CodeBehind="~/App_Code/Service.cs" %&amp;gt;&lt;/pre&gt;
&lt;p&gt;Servis ile ilgili işlemlere ge&amp;ccedil;meden &amp;ouml;nce &amp;ccedil;alıştığından emin olmakta fayda vardır. Servis başarılı bir şekilde hazırlanmışsa aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml;n elde edilmesi gerekir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk206_3.gif" alt="" width="578" height="291" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Artık istemci i&amp;ccedil;in gerekli kodlar yazılıp testlere başlanabilir. &amp;Ouml;ncelikli olarak istemci uygulamalar i&amp;ccedil;in gerekli proxy tipinin &amp;uuml;retilmesi gerekir. Bunun i&amp;ccedil;in komut satırında (Visual Studio 2005 Command Prompt) &lt;strong&gt;svcutil.exe&lt;/strong&gt; aracı kullanılabilir yada Visual Studio 2005 ortamında konsol uygulamasında &lt;strong&gt; Add Service Reference&lt;/strong&gt; se&amp;ccedil;eneği ile aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi eklenebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk206_4.gif" alt="" width="530" height="216" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından istemci uygulamasına ait proje i&amp;ccedil;erisinde gerekli proxy tipi ve &lt;strong&gt;App.config&lt;/strong&gt; konfigurasyon dosyası &amp;uuml;retilmiş olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk206_5.gif" alt="" width="241" height="232" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İstemci uygulamaya ait kodlar aşağıdaki gibi geliştirilebilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Text;
using System.ServiceModel;
using System.Collections.Generic;
using Istemci.localhost;

namespace Istemci
{
    class Program
    {
        static void Main(string[] args)
        {
            try
            {
                RaporlamaServisiClient srv = new RaporlamaServisiClient("RaporlamaServisiEndPoint");
                Console.WriteLine("Rapor &amp;uuml;retimini başlat..." + DateTime.Now.ToString());
                srv.RaporUret("Mayk");
                Console.WriteLine("Rapor &amp;uuml;retimi başlatıldı..." + DateTime.Now.ToString());
                Console.WriteLine("&amp;Uuml;r&amp;uuml;n satışı yapıldı bilgisini g&amp;ouml;nder..." + DateTime.Now.ToString());
                srv.SatisYapildi(1001);
                Console.WriteLine("&amp;Uuml;r&amp;uuml;n satışı yapıldı bilgisi g&amp;ouml;nderildi..." + DateTime.Now.ToString());

                srv.Close();
            }
            catch (Exception hata)
            {
                Console.WriteLine(hata.Message);
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;RaporlamaServisiClient nesnesi &amp;ouml;rneklendikten sonra RaporUret ve SatisYapildi isimli metodlar &amp;ccedil;ağırılmaktadır. Bu metodları işaret eden servis s&amp;ouml;zleşmesinde &lt;strong&gt;OneWay&lt;/strong&gt; oldukları belirtilmiştir. Buna g&amp;ouml;re istemci uygulamanın, bu metodlar i&amp;ccedil;erisindeki 65 saniyelik s&amp;uuml;relerden etkilenmeden diğer kod satırlarını işletmesi gerekmektedir. Bakalım ger&amp;ccedil;ekten b&amp;ouml;yle mi olacak?&lt;/p&gt;
&lt;p&gt;Testleri yapabilmek i&amp;ccedil;in hem sunucu uygulamanın hemde istemci uygulamanın aynı zaman diliminde &amp;ccedil;alışıyor olmaları gerekmektedir. Dolayısıyla &lt;strong&gt;Solution&lt;/strong&gt; &amp;ouml;zelliklerinde &lt;strong&gt; Multiple Startup Projects &lt;/strong&gt;se&amp;ccedil;ilmeli ve &amp;ouml;nce servis uygulaması ardından istemci uygulama &amp;ccedil;alışacak şekilde ayarlanmalıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk206_6.gif" alt="" width="303" height="154" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu aşamadan sonra uygulama &amp;ccedil;alıştırılırsa ilk etapta aşağıdaki gibi bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşılır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk206_7.gif" alt="" width="482" height="96" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi RaporUret &amp;ccedil;ağrısı kolayca aşılmış ancak, &lt;strong&gt;SatisYapildi&lt;/strong&gt; &amp;ccedil;ağrısından sonra istemci uygulama ekranı duraksamıştır. Oysaki ikinci metodda &lt;strong&gt;OneWay&lt;/strong&gt; olarak &amp;ccedil;ağrılmaktadır. Dolayısıyla aynen ilk metod &amp;ccedil;ağrısında olduğu gibi buradada istemci uygulamanın diğer kod satırlarından işlemlerine devam etmesi beklenir. Ne varki b&amp;ouml;yle olmamıştır. Sonu&amp;ccedil; olarak bir s&amp;uuml;re bekledikten sonra aşağıdaki ekranda g&amp;ouml;r&amp;uuml;len hata mesajı ile karşılaşılır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk206_8.gif" alt="" width="640" height="120" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Peki sorun nedir? İstemci uygulama neden &amp;ccedil;alışma zamamında bir istisna alarak sonlanmıştır? Hatta yeterli s&amp;uuml;re beklenildiğinde sunucu tarafında &lt;strong&gt;Izleme.txt &lt;/strong&gt;dosyasının i&amp;ccedil;eriğine bakıldığında metod i&amp;ccedil;eriklerinin &amp;ccedil;alıştığıda g&amp;ouml;zlemlenebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk206_9.gif" alt="" width="423" height="164" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Ne varki istemci a&amp;ccedil;ısından bazı sorunlar olduğu ortadadır. Problemin nedeni oturumlardır&lt;strong&gt; (Sessions)&lt;/strong&gt;. Aynı oturum i&amp;ccedil;erisinde gelen arka arkaya iki &amp;ccedil;ağrı s&amp;ouml;z konusudur. Bu &amp;ccedil;ağrılar doğal olarak aynı andalık ilkesine &lt;strong&gt;(Concurrency)&lt;/strong&gt; g&amp;ouml;re değerlendirilir. Dolayısıyla ikinci &amp;ccedil;ağrıdan sonra istemci uygulama, ilk &amp;ccedil;ağrı sonucunun tamamlanmasını beklemek durumunda kalmıştır. Bu sebepten servisin &amp;ouml;zellikle aynı oturum i&amp;ccedil;erisinden gelecek eş zamanlı metod &amp;ccedil;ağrılarına cevap verebilecek şekilde &amp;ouml;zelleştirilmesi gerekir. Burada elebetteki Session moddan vazge&amp;ccedil;ilmesi tercih edilebilir. &amp;Ouml;rneğin &lt;strong&gt; PerCall&lt;/strong&gt; mode se&amp;ccedil;ilebilir. Ancak oturumların &lt;strong&gt;(Sessions) &lt;/strong&gt; kullanım ama&amp;ccedil;ları g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında bir &amp;ccedil;&amp;ouml;z&amp;uuml;m yolu bulunmasında fayda vardır. Yapılması gereken servis s&amp;ouml;zleşmesini uygulayan RaporUretici sınıfına, &lt;strong&gt;ServiceBehavior&lt;/strong&gt; niteliğini uygulamak ve &lt;strong&gt; ConcurrencyMode&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;Multiple&lt;/strong&gt; değerini aşağıdaki gibi vermektir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace RaporlamaServisi
{
    [ServiceBehavior(ConcurrencyMode= ConcurrencyMode.Multiple)]
    public class RaporUretici
                        : IRaporUretici
    {&lt;/pre&gt;
&lt;p&gt;Uygulamamızı bu haliyle test ettiğimizde ise aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk206_14.gif" alt="" width="640" height="134" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Herşey ilk etapta yolunda gibidir. Nitekim SatisYapildi metod &amp;ccedil;ağrısı sonrasındaki kodlarda &amp;ccedil;alışmıştır. Ancak uygulama kapanırken yine bir hata mesajı alınmıştır. Bu hata mesajının &amp;uuml;retildiği nokta istemci tarafında servis i&amp;ccedil;in &lt;strong&gt;Close&lt;/strong&gt; metodunun &amp;ccedil;ağrıldığı yerdir. Bu &amp;ccedil;ağrıya gelindiğinde istemci uygulama uzun bir s&amp;uuml;re beklemede kalmıştır. Sonrasında ise bir istisna mesajı fırlatarak sonlanmıştır. Bunun sebebi kullanılan WsHttpBinding tipinin &amp;ouml;zellikleridir. &lt;strong&gt;WsHttpBinding&lt;/strong&gt; oturumları kullanan ve varsayılan olarak mesaj seviyesinde g&amp;uuml;venlik &lt;strong&gt;(Message-Level Security)&lt;/strong&gt; kullanan bir bağlayıcı &lt;strong&gt;(Binding)&lt;/strong&gt; tipidir.&lt;/p&gt;
&lt;p&gt;İstemci Close metodunu &amp;ccedil;ağırdığında servis tarafında kendisi i&amp;ccedil;in a&amp;ccedil;ılan oturumu(Session) kapatmak ister. Buna karşılık servis ilgili oturuma ait işlemlerin bitmesini bekler ve tamamlandıklarından emin olduktan sonra bunu istemciye bir mesaj ile bildirir. &amp;Ouml;rnekte &amp;ccedil;ok doğal olarak servis tarafındaki işlemler 1 dakika sınırını aştığından, s&amp;ouml;z konusu mesaj istemciye iletilemez. Buda doğal olarak istemci tarafında bir istisna mesajı fırlamasına neden olur. &amp;Ccedil;&amp;ouml;z&amp;uuml;m olarak g&amp;uuml;venlik ile ilgili ayarlar kapatılabilir ki bu &amp;ouml;nerilen bir y&amp;ouml;ntem değildir. Diğer bir y&amp;ouml;ntem ise iletişim seviyesinde g&amp;uuml;venlik &lt;strong&gt;(transport levet security)&lt;/strong&gt; kullanmaktır. Ancak bu y&amp;ouml;ntemde sertifika kullanılması gerekir nitekim Https politikası s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;Ancak mesaj seviyesinde yapılabilecek bir se&amp;ccedil;enek daha vardır. Buda g&amp;uuml;venilir bir oturum &lt;strong&gt;(Reliable Session)&lt;/strong&gt; a&amp;ccedil;maktır. Nitekim bu sayede istemcinin yaptığı &amp;ccedil;ağrılar sonucu servisten bir bilgi beklenmesine gerek kalmayacaktır. Bunun i&amp;ccedil;in servis tarafında ve istemci tarafında &lt;strong&gt;wsHttpBinding&lt;/strong&gt; tipi i&amp;ccedil;in konfigurasyon ayarları yapılmalı ve &lt;strong&gt;ReliableSession&lt;/strong&gt; i&amp;ccedil;in &lt;strong&gt;Enabled&lt;/strong&gt; &amp;ouml;zelliklerine &lt;strong&gt;true&lt;/strong&gt; değeri atanmalıdır. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde servis tarafı i&amp;ccedil;in ilgili değişikliklerin &lt;strong&gt;Microsoft Service Configuration Editor&lt;/strong&gt; yardımıyla nasıl yapıldığı g&amp;ouml;sterilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk206_10.gif" alt="" width="578" height="394" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu değişiklikler sonucu servis tarafı i&amp;ccedil;in konfigurasyon dosyasının i&amp;ccedil;eriği aşağıdaki gibi olur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk206_11.gif" alt="" width="609" height="343" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Benzer değişikliklerin istemci tarafı i&amp;ccedil;inde yapılması gerekir. Bunun sonucu olarak istemci tarafındaki konfigurasyon dosyasındada aşağıdaki değişiklikler olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk206_12.gif" alt="" width="619" height="570" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Artık uygulamımızı bu haliyle test edebiliriz. Aşağıda uygulamanın son halinin test sonu&amp;ccedil;larına ait ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; yer almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk206_13.gif" alt="" width="495" height="95" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil; itibariyle basit bir &lt;strong&gt;One Way Ticket&lt;/strong&gt; şarkısından olduk&amp;ccedil;a farklı noktalara geldik. Bu ana kadar g&amp;ouml;rd&amp;uuml;klerimizden aşağıdaki sonu&amp;ccedil;ları &amp;ccedil;ıkartabiliriz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;OneWay tekniği ile Windows Communication Foundation uygulamalarında asenkron &amp;ccedil;ağırımlar ger&amp;ccedil;ekleştirilebilir ve &lt;strong&gt;performans&lt;/strong&gt; artışı sağlanır. &amp;Ccedil;&amp;uuml;nk&amp;uuml; istemci uygulama, servis tarafındaki metod sonu&amp;ccedil;larını beklemeden yoluna devam eder.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;G&amp;uuml;nvenilir oturumlara (Reliable Sessions)&lt;/strong&gt; izin verilmesi halinde istemci tarafında &lt;strong&gt;Close&lt;/strong&gt; metodu uygulandığında servis ile olan &lt;strong&gt;bağlantı(Connection)&lt;/strong&gt;, servisten cevap beklenmeden sonlandırılabilir.&lt;/li&gt;
&lt;li&gt;&amp;Ouml;zellikle &lt;strong&gt;oturum(Session)&lt;/strong&gt; kullanıldığı durumlarda servis &amp;uuml;zerinde aynı oturuma ait arka arkaya metod &amp;ccedil;ağırımlarında, istemci uygulamanın duraksamasını engellemek adına &lt;strong&gt;ConcurrencyMode&lt;/strong&gt; &amp;ouml;zelliğinin değeri &lt;strong&gt;Multiple&lt;/strong&gt; olarak set edilebilir.&lt;/li&gt;
&lt;li&gt;ConcurrencyMode &amp;ouml;zelliğinin Multiple olarak belirlenmesi halinde servisin ger&amp;ccedil;ektende &lt;strong&gt; thread-safe&lt;/strong&gt; olup olmadığına dikkat edilmelidir. Nitekim Multiple değeri ile, servis tarafındaki uygulama &lt;strong&gt;Multi-Thread&lt;/strong&gt; hale gelmektedir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bu makalemizde asenkron programlama &amp;ccedil;eşitlerinden birisi olan One Way metod &amp;ccedil;ağırım tekniğini incelemeye &amp;ccedil;alıştık. Asenkron programlamaya ilişkin başka &amp;ouml;rnekleri ilerleyen makalelerimizde incelemeye &amp;ccedil;alışacağız. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/OneWayInceleme.zip"&gt;&amp;Ouml;rnek Uygulama İ&amp;ccedil;in Tıklayınız.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2007-05-31 09:00:00</pubDate>
  <slug>WCF-One-Way-Ticket-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>