<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Electron ile Cross-Platform Uygulama Geliştirmek</title>
  <description>Haftasonu kendimi bir şekilde ilginç bir maceranın içerisinde buldum. West-World'de Windows Forms benzeri bir uygulama yazabileceğimi ve bunu hem macos hem de windows platformunda yapabileceğimi öğrendim. Bunun için HTML, Node.js ve CSS yeterli. İşin aslı electron isimli açık kaynak geliştirilen ürün sayesinde platform bağımsız masaüstü uygulamaları geliştirmek mümkünmüş. Hızlı bir deneyim için interneti taramaya ve basit bir "Hello World" yazmaya karar verdim. Amacım West-World(Ubuntu) üzerinde geliştireceğim masaüstü uygulamasını hem macox hem de windows üzerinde çalıştırabilmekti...</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/11/galvatron.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bu aralar işler doğruyu s&amp;ouml;ylemek gerekirse biraz can sıkıcı. KVKK&lt;em&gt;(Kişisel Verilerin Korunması Kanunu)&lt;/em&gt; olarak bilinen ve&amp;nbsp;m&amp;uuml;şteri&amp;nbsp;verilerinin anonimleştirilmesini gerektiren bir &amp;ccedil;alışma i&amp;ccedil;erisindeyiz. Verinin dağınık olması, hacimsel b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;, kurum i&amp;ccedil;i s&amp;uuml;re&amp;ccedil;lerin karmaşıklığı, monolitleşmiş ERP uygulamamız &amp;uuml;zerindeki etkilerinin &amp;ccedil;ıkartılmasındaki&amp;nbsp;zorluklar, araya giren başla işler nedeniyle yavaş ilerliyoruz. Kurumun tamamını ilgilendiren bir reg&amp;uuml;lasyon s&amp;ouml;z konusu olduğu i&amp;ccedil;in de biraz&amp;nbsp;fazlasıyla statik elektrik&amp;nbsp;y&amp;uuml;kl&amp;uuml;y&amp;uuml;z. Yani ş&amp;ouml;yle bir Galvatron &amp;ccedil;ıksa i&amp;ccedil;imizden ya da Megatron, Electron ortalığı kasıp kavura...Imm, şey...Ne diyorum ben yahu. Electron'da nereden &amp;ccedil;ıktı :) Aslında tesad&amp;uuml;fen karşıma &amp;ccedil;ıktı ve bu karşılaşma sayesinde kendimi ilgin&amp;ccedil; ve zevkli bir maceranın&amp;nbsp;i&amp;ccedil;erisinde buldum.&lt;/p&gt;
&lt;p&gt;West-World'de&amp;nbsp;masa&amp;uuml;st&amp;uuml; uygulama yazabileceğimi ve bunu hem&amp;nbsp;MacOS&amp;nbsp;hem de Windows platformunda &amp;ccedil;alıştırabileceğimi &amp;ouml;ğrendim. Bu yeni bir şey değil ve hatta aklımıza Mono, Miguel de Icaza, Xamarin Forms geliyor ancak, bunu ger&amp;ccedil;ekleştirmek i&amp;ccedil;in HTML, Node.js ve CSS kullanarak ilerleyebileceğimiz bir yol daha var.&lt;/p&gt;
&lt;p&gt;İşin aslı vakti zamanında&amp;nbsp;GitHub tarafından a&amp;ccedil;ık kaynak olarak geliştirilen&amp;nbsp;&lt;a href="https://electronjs.org/docs/tutorial/about" target="_blank"&gt;electron&lt;/a&gt; isimli &amp;ccedil;atı sayesinde platform bağımsız masa&amp;uuml;st&amp;uuml; uygulamaları yazmak m&amp;uuml;mk&amp;uuml;n&lt;em&gt;(Hemde epey zamandır) &lt;/em&gt;Bu oluşumda&amp;nbsp;Chromium ile Node.js alt yapısının hazırladığı bir senaryo s&amp;ouml;z konusu. Chromium ile HTML bazlı sayfaları bir masa&amp;uuml;st&amp;uuml; formu gibi sunmak m&amp;uuml;mk&amp;uuml;n. Node.js sayesinde alt seviye işletim sistemi işlemleri de yapabileceğimiz i&amp;ccedil;in web platformunun geliştirme olanaklarını masa&amp;uuml;st&amp;uuml;ne taşıyabildiğimizi d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;p&gt;Sonunda hızlı bir deneyim i&amp;ccedil;in interneti taramaya ve basit bir "Hello World" programı yazmaya karar verdim. Zaten&amp;nbsp;ara ara&amp;nbsp;Linux &amp;uuml;zerinde masa&amp;uuml;st&amp;uuml; uygulamaları yazabilmek i&amp;ccedil;in ne yapabileceğimi araştırıyordum. En &amp;ouml;nemli motivasyonumu, West-World&lt;em&gt;(Ubuntu)&lt;/em&gt; &amp;uuml;zerinde&amp;nbsp;yazacağım&amp;nbsp;masa&amp;uuml;st&amp;uuml; uygulamasını&amp;nbsp;MacOS&amp;nbsp;ve&amp;nbsp;Windows platformlarında &amp;ccedil;alıştırabilmek şeklinde belirledim.&lt;/p&gt;
&lt;h2&gt;West-World &amp;Uuml;zerindeki Geliştirmeler&lt;/h2&gt;
&lt;p&gt;İşe Ubuntu &amp;uuml;zerinde yapacağım geliştirmelerle başladım. Ortamda Node.js olması yeterliydi. &amp;Ouml;ncelikle bir klas&amp;ouml;r hazırladım ve npm ortamını tesis ettikten sonra electron &amp;ccedil;atısına ait npm paketini sisteme y&amp;uuml;klettim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm init
npm install --save-dev electron&lt;/pre&gt;
&lt;p&gt;npm init ile gelen sorulara bir ka&amp;ccedil; cevap verip package.json i&amp;ccedil;eriğini aşağıdaki hale getirdim.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;{
  "name": "helloforms",
  "version": "1.0.0",
  "description": "a simple desktop application for cross platform",
  "main": "main.js",
  "scripts": {
    "start": "electron .",
    "test": "echo \"Error: no test specified\" &amp;amp;&amp;amp; exit 1"
  },
  "author": "burak selim senyurt",
  "license": "ISC",
  "devDependencies": {
    "electron": "^3.0.5"
  }
}&lt;/pre&gt;
&lt;p&gt;start kısmındaki electron . ifadesi &amp;ccedil;alışma zamanı i&amp;ccedil;in gerekli. Uygulamanın giriş noktası olarak main.js dosyasını kullanacağız. Aslında electron, chromium ile bir ana process başlatacak ve biz istersek diğer alt process'ler ile&lt;em&gt;(Renderer Process olarak ifade ediliyor)&lt;/em&gt; IPC&lt;em&gt;(Inter Process Communication)&lt;/em&gt; protokol&amp;uuml; &amp;uuml;zerinden mesajlaşabileceğiz. Bu şu anlama geliyor; ana process ve&amp;nbsp;a&amp;ccedil;ılacak başka alt process'ler&lt;em&gt;(&amp;ouml;rneğin ekranlar veya diğer arka plan işlerini yapan javascript kodları)&lt;/em&gt; IPC &amp;uuml;zerinden haberleşebilirler. Bu sayede &amp;ouml;rneğin main.js dışındaki bir ekrandaki d&amp;uuml;ğmeye tıklandığında tetiklenen olaydan, main.js'teki bir dinleyiciye mesaj g&amp;ouml;nderebilir ve d&amp;ouml;n&amp;uuml;ş alabiliriz. İşleyiş esasında bir Windows Forms&amp;nbsp;uygulamasının yaşam d&amp;ouml;ng&amp;uuml;s&amp;uuml;nden pek de farklı değil. Bu durumu &amp;ouml;rnekte anlatmaya &amp;ccedil;alışacağım&lt;em&gt;(&amp;Ouml;ğrenebildiğim kadarıyla)&lt;/em&gt; Main.js, index.html ve index.js isimli dosyalara ihtiyacımız var. Main.js i&amp;ccedil;eriğini yazarak işe başlayalım.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;const { app, BrowserWindow, ipcMain } = require('electron')
console.log(process.platform)

let win

function createWindow() {
    win = new BrowserWindow({ width: 640, height: 480 })
    win.loadFile('index.html')
    //win.webContents.openDevTools()
    win.on('closed', () =&amp;gt; {
        win = null
    })
}

app.on('ready', (createWindow))

app.on('window-all-closed', () =&amp;gt; {
    if (process.platform !== 'darwin') {
        app.quit()
    }
})

app.on('activate', () =&amp;gt; {
    if (win === null) {
        createWindow()
    }
})

ipcMain.on("btnclick", (event, arg) =&amp;gt; {
    var response = "Hello " + arg + ".How are you today?"
    event.sender.send("btnclick-task-finished", response);
})&lt;/pre&gt;
&lt;p&gt;electron mod&amp;uuml;l&amp;uuml;nden app, BrowserWindow ve ipcMain tiplerini tanımlayarak işe başlıyoruz. Sonrasında gelen satırda &amp;ccedil;alıştığımız platformu console ekranına yazdırmaktayız. Bunu Windows, Linux veya MacOS'da &amp;ccedil;alışıp &amp;ccedil;alışmadığımdan emin olmak i&amp;ccedil;in ekledim. win isimli değişkenimiz BrowserWindow tipinden. Tahmin edeceğiniz gibi bu nesne ile bir ekran&lt;em&gt;(pencere, form artık nasıl d&amp;uuml;ş&amp;uuml;nmek isterseniz)&lt;/em&gt; tanımlıyoruz. createWindow fonksiyonunda ekranın nasıl oluşturulduğunu g&amp;ouml;rebilirsiniz. Genişlik ve y&amp;uuml;kseklik belirttikten sonra index.html dosyasının bu pencere i&amp;ccedil;erisine a&amp;ccedil;ılacağını belirtiyoruz. Sanki Windows Forms'da bir tarayıcı kontrol&amp;uuml; i&amp;ccedil;erisinde yerel bir&amp;nbsp;HTML&amp;nbsp;dosyasını g&amp;ouml;steriyormuşuz gibi d&amp;uuml;ş&amp;uuml;nebiliriz sanırım. Başlangı&amp;ccedil;ta yorum satırı olarak belirttiğimiz openDevTools fonksiyon &amp;ccedil;ağrısı ile Chrome Developer penceresi a&amp;ccedil;ılıyor. Şimdilik bu &amp;ouml;zellik kapalı.&lt;/p&gt;
&lt;p&gt;win değişkeni &amp;uuml;zerinden ve ilerleyen satırlardaki app, ipcMain nesneleri&amp;nbsp;tarafından da&amp;nbsp;&amp;ccedil;ağırılan on isimli metodlar, belli olayların tetiklenmesi sonrası devreye giren fonksiyonlar. &amp;Ouml;rneğin a&amp;ccedil;ılan pencere i&amp;ccedil;in closed olayı tetiklenirse win nesnesi bellekten atılmak &amp;uuml;zere null değerle işaretleniyor. Ya da uygulama hazır olduğunda createWindow fonksiyonu &amp;ccedil;ağırılıyor. Birden fazla pencerenin olması da muhtemel tabii. Bu nedenle t&amp;uuml;m pencerelerin kapatılması sonucu tetiklenen window-all-closed sonrası eğer &amp;uuml;zerinde olduğumuz platform darwin&lt;em&gt;(yani macOS)&lt;/em&gt; değilse quit &amp;ccedil;ağrısı ile uygulama kapatılıyor.&lt;/p&gt;
&lt;p&gt;Kodun son kısmında yer alan ve ipcMain nesnesi &amp;uuml;zerinden &amp;ccedil;ağırılan btnclick olay kontrol&amp;uuml;, index.js i&amp;ccedil;eriğini yazdığımız zaman anlam kazanacak. Şimdilik btnclick isimli bir olayın tetiklenmesi sonrası arg değişkeni ile gelen veriyi tekrardan geriye yolladığımızı s&amp;ouml;yleyebiliriz&lt;em&gt;(Tabii geriye derken nereye, tahmininiz var mı?)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Gelelim index.html ve index.js i&amp;ccedil;eriklerine.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;!DOCTYPE html&amp;gt;
&amp;lt;html&amp;gt;

&amp;lt;head&amp;gt;
    &amp;lt;meta charset="UTF-8"&amp;gt;
    &amp;lt;title&amp;gt;Electron Sample - I&amp;lt;/title&amp;gt;
&amp;lt;/head&amp;gt;

&amp;lt;body&amp;gt;
    &amp;lt;h1&amp;gt;Hello Electron! I am MEGATRON :P&amp;lt;/h1&amp;gt;
    &amp;lt;div&amp;gt;
        &amp;lt;label&amp;gt;What's your name?&amp;lt;/label&amp;gt;
        &amp;lt;input type="text" id="text-name" placeholder="name"&amp;gt;
    &amp;lt;/div&amp;gt;
    &amp;lt;div&amp;gt;
        &amp;lt;button id="button-hello"&amp;gt;Say Something&amp;lt;/button&amp;gt;
    &amp;lt;/div&amp;gt;    
    &amp;lt;div id="div-response"&amp;gt;&amp;lt;/div&amp;gt;
    &amp;lt;script src="index.js"&amp;gt;&amp;lt;/script&amp;gt;
&amp;lt;/body&amp;gt;

&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;HTML sayfamızda&amp;nbsp;basit bir tasarımımız var. Normalde CSS ile zenginleştirilebilir ama ben kısa yoldan &amp;ouml;ğrenmenin ve olanları anlamanın peşinde olduğumdan bu durumu es ge&amp;ccedil;tim&lt;em&gt;(CSS bilmemem de işin cabası tabii)&lt;/em&gt; HTMLce okuduğumuzda kullanıcının adını sorduğumuz ve d&amp;uuml;ğmeye basmasını beklediğimiz bir pencere olduğunu s&amp;ouml;yleyebiliriz. Tabii text kontrol&amp;uuml;n&amp;uuml;n i&amp;ccedil;eriğini alabilmek i&amp;ccedil;in id niteliğinden yararlanacağız. button-hello ve div-response kimlikleri de index.js i&amp;ccedil;erisinde anlam kazanacaklar. index.html ile&amp;nbsp;alakalı javascirpt i&amp;ccedil;eriklerini g&amp;ouml;m&amp;uuml;l&amp;uuml; olarak da yazabiliriz ama ben index.js ismiyle ayrı bir dosyada tutmaya karar verdim. Html ve javascript dosyaları arasındaki ilişkiyi sonlarda yer alan script bloğunda kurduğumuza da dikkat edelim &lt;em&gt;(Bu arada kişisel tavsiyem &amp;ouml;n y&amp;uuml;z tarafında Bootstrap gibi bir yapıyı kullanarak ilerlemeniz. &amp;Ccedil;ok daha şık ve her cihaza cevap verebilir aray&amp;uuml;zler oluşturabilirsiniz. Github'daki electron repoda Bootstrap ile ilgili &amp;ouml;rnek yer alıyor)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;const ipcRenderer = require('electron').ipcRenderer;
var btnClick = document.getElementById('button-hello');

btnClick.addEventListener('click', () =&amp;gt; {
    var name = document.getElementById('text-name').value
    ipcRenderer.send("btnclick", name)
})

ipcRenderer.on('btnclick-task-finished', (event, param) =&amp;gt; {
    var div = document.getElementById('div-response')
    div.innerText = param
});&lt;/pre&gt;
&lt;p&gt;index.js kodları electron'dan ipcRenderer nesnesini alarak işe başlıyor. Hatırlarsanız Main.js i&amp;ccedil;erisinde ipcMain isimli nesneden yararlanmıştık. ipcRenderer, Main process ile&amp;nbsp;ilişkili alt process'ler i&amp;ccedil;in kullanılıyor. Ekrandaki button bileşenini klasik getElementById ile yakaladıktan sonra, click isimli bir eventListener ekliyoruz. Bu olay metodu i&amp;ccedil;erisinde text-name kontrol&amp;uuml;n&amp;uuml;n veri i&amp;ccedil;eriğini yakalayıp, ipcRenderer'ın send fonksiyonu &amp;uuml;zerinden btnclick takısı ile bir yere g&amp;ouml;nderiyoruz...Sizce nereye g&amp;ouml;ndermiş olabiliriz? Sanırım şu anda ipcMain kullanarak Main.js i&amp;ccedil;erisinde yakaladığımız btnclick&amp;nbsp;takma adlı olay metodu daha da anlam kazandı değil mi? Son olarak ipcRenderer &amp;uuml;zerinden bu kez btnclick-task-finished takılı bir olay metodunu kodladığımızı g&amp;ouml;rebilirsiniz. Buraya akan mesaj, main process'den geliyor. Yakalanan mesajı div-response isimli div&amp;nbsp;kontrol&amp;uuml; &amp;uuml;zerine&amp;nbsp;basıyoruz.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zetle ekrandan yazılan metni main process'e g&amp;ouml;nderiyor ve oradan da index.js i&amp;ccedil;in a&amp;ccedil;ılan alt process'e karşılık veriyoruz. Bunu pekala ekrandan main process &amp;uuml;zerinde &amp;ccedil;alıştırılacak paralel g&amp;ouml;revlerin&amp;nbsp;icra edilmesi gibi işlemlerde ele alabiliriz. Ancak işin &amp;ouml;nemli kısmı bir tane main process'in olduğu ve diğer alt process'lerin main process ile IPC &amp;uuml;zerinden iletişim kurduğudur&lt;em&gt;(Bunun mutlaka başka faydaları da vardır ama neler olduğunu &amp;ouml;ğrenmem lazım. Araştırmaya devam Burak)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Aslında &amp;ouml;rnek kodlarım tamamen bu kadardı. Hemen west-world komut satırından&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm start&lt;/pre&gt;
&lt;p&gt;ile programı &amp;ccedil;alıştırdım ve aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaştım. Bir masa&amp;uuml;st&amp;uuml; uygulamam olmuştu artık.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/11/electron_linux_0.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hatta developer modu etkinleştirince&lt;em&gt;(win.webContents.openDevTools() satırını a&amp;ccedil;araktan)&amp;nbsp;&lt;/em&gt;&amp;ccedil;ok tanıdık olduğumuz bir ekranla karşılaştım. Chrome &amp;uuml;zerinden Debug yapıp bir şeyleri keşfetmeye &amp;ccedil;alışanlar aşinadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/11/electron_linux_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Şirketteki Windows'ta Olanlar&lt;/h2&gt;
&lt;p&gt;West-World ile yaptığım &amp;ccedil;alışmaları bitirdikten sonra değişiklikleri github reposuna push edip uyku moduna ge&amp;ccedil;tim. Ertesi sabah işe gider gitmez ilk olarak repodaki kodları indirdim. &amp;Ccedil;ok doğal olarak ilk &amp;ccedil;alıştırma da hata aldım. &amp;Ccedil;&amp;uuml;nk&amp;uuml; electron npm paketi sistemde y&amp;uuml;kl&amp;uuml; değildi. Bu beraberinde başka bir konuyu g&amp;uuml;ndeme getirdi. Aslında uygulamayı West-World'de yazdıktan sonra paketleyebilmeliydim. Bunu araştıracaktım lakin Windows &amp;uuml;zerindeki sonu&amp;ccedil;ları da &amp;ccedil;ok merak ediyordum. electron paketini y&amp;uuml;kledim ve yine&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm start&lt;/pre&gt;
&lt;p&gt;ile programı &amp;ccedil;alıştırdım. Volaaaa...&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/11/electron_win.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil; olduk&amp;ccedil;a tatmin ediciydi benim i&amp;ccedil;in. Console loguna g&amp;ouml;re Windows platformunda olduğum aşikardı. Diğer taraftan metin kutusuna yazdığım bilgi, butona bastıktan sonra da işlenmişti. &amp;Ouml;n&amp;uuml;mde tek bir engel kalıyordu. Aynı kod par&amp;ccedil;asını bir Apple bulup MacOS &amp;uuml;zerinde deneyimlemek.&lt;/p&gt;
&lt;h2&gt;G&amp;ouml;kan'ın MacOS'unda&amp;nbsp;Yapılanlar&lt;/h2&gt;
&lt;p&gt;Sevgili dostum G&amp;ouml;khan sağolsun emektar Apple'ını kullanmama izin verdi. Kendisi her ne kadar yazılımcılıkla uğraşmasa da bilgisayarını teredd&amp;uuml;ts&amp;uuml;z emrime amade etti. Pek tabii makinede pek bir şey yoktu. Node.js'i ve git'i kurmam gerekti. Sonrasında versiyon kontrollerini yaptım ve github adresime attığım projeyi yerel bilgisayara klonladım. electron paketinin olmaması ihtimaline karşın onu da npm &amp;uuml;zerinden y&amp;uuml;kledim. Kabaca aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer bir durum oluştu diyebilirim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;node --version
npm --version
git --version
git clone https://github.com/buraksenyurt/nodejs-tutorials.git
cd Day09
npm i --save-dev electron&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/11/electron_apple_0.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ve derhal npm start komutunu vererek uygulamanın &amp;ccedil;alışıp &amp;ccedil;alışmadığını kontrol ettim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/11/electron_apple_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Mutluluk!!!&lt;/p&gt;
&lt;p&gt;West-World &amp;uuml;zerinde electron kullanarak geliştirilen Chromium tabanlı bir masa&amp;uuml;st&amp;uuml; uygulamasını, hem Windows hem de MacOS'da sorunsuz şekilde &amp;ccedil;alıştırabildim. &amp;Uuml;stelik &amp;ccedil;ok az eforla. Cross-Platform adına Xamarin sonrası g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m &amp;ouml;nemli&amp;nbsp;&amp;ccedil;atılardan birisi oldu electron. &amp;Ouml;zellikle işin arkasında GitHub'ın olması, a&amp;ccedil;ık kaynak topluluk desteği,&amp;nbsp;versiyonlardaki&amp;nbsp;s&amp;uuml;rekli kararlılık, node.js'in g&amp;uuml;c&amp;uuml;,&amp;nbsp;HTML ve CSS kullanarak aynen web uygulaması geliştiriyormuş&amp;ccedil;asına ilerleyebilme imkanı cezbedici unsurlar diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Evdeki Linux, şirketteki Windows, komşudaki MacOS. Hepsinde github reposundan &amp;ccedil;ekip &amp;ccedil;alıştırdığım aynı aray&amp;uuml;ze sahip masa&amp;uuml;st&amp;uuml; uygulamaları koşuyor. Eğer bunu paketleyerek dağıtmayı da &amp;ouml;ğrenirsem&amp;nbsp;pek şukela olacak diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Ben bunu araştırıyorken siz de boş durmayın &amp;ouml;ğrenin.&amp;nbsp;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="https://github.com/buraksenyurt/electron" target="_blank"&gt;Ayrıca electron ile ilgili Tutorial tadındaki &amp;ouml;rnek kodlara github'dan ulaşabilirsiniz&lt;br /&gt;&lt;/a&gt;&lt;a href="https://github.com/buraksenyurt/nodejs-tutorials" target="_blank"&gt;Bu uygulama kodlarını&amp;nbsp;da buradan&amp;nbsp;klonlayabilirsiniz&amp;nbsp;(Day09)&lt;br /&gt;&lt;/a&gt;&lt;a href="https://github.com/electron" target="_blank"&gt;Electron Github projesi&lt;br /&gt;&lt;/a&gt;&lt;a href="https://codeburst.io/build-a-todo-app-with-electron-d6c61f58b55a" target="_blank"&gt;Eğer bir sonraki adım ne olmalı derseniz ben şuradaki yazıyı takip edeceğim derim&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2018-11-30 05:06:00</pubDate>
  <slug>electron-ile-cross-platform-uygulama-gelistirmek</slug>
  <tags>
    <tag>electron</tag>
    <tag>net-core</tag>
    <tag>linux</tag>
    <tag>windows-7</tag>
    <tag>macos</tag>
    <tag>cross-platform-development</tag>
    <tag>windows-forms</tag>
    <tag>npm</tag>
    <tag>nodejs</tag>
    <tag>javascript</tag>
    <tag>html</tag>
    <tag>ipc</tag>
    <tag>inter-process-communication</tag>
    <tag>chromium</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
  </categories>
</post>