<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net Core Web API için Custom MiddleWare Yazmak</title>
  <description>Bu yazımızda IApplicationBuilder arayüzünü genişleterek özelleştirilmiş bir ara katman(MiddleWare) yazıyor ve bunu var olan pipeline'e ekleyerek çalışma zamanında ele alınmasını sağlıyoruz.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/11/custom_mw4.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Uzun zamandır televizyon dizisi izlemiyorum. Aslında bir d&amp;ouml;nem d&amp;uuml;zenli olarak takip ettiğim diziler vardı. Bir tanesi de usta oyuncular Benedict Cumberbatch&lt;em&gt;(Sherlock Holmes)&lt;/em&gt; ve Martin Freeman&lt;em&gt;(Dr. John Watson)&lt;/em&gt;&amp;nbsp;ın oynadığı&amp;nbsp;Sherlock Holmes idi. Bu Cumartesi gecesi bir şekilde dizinin bir b&amp;ouml;l&amp;uuml;m&amp;uuml;ne rastladım. Keyifli bir b&amp;ouml;l&amp;uuml;m tekrarı yaptım. Oyunculuklara yine hayran kaldım. Sherlock'un keskin zekasına, Watson'un her zamanki sorgulayıcı d&amp;uuml;ş&amp;uuml;nce tarzının eklendiği bir b&amp;ouml;l&amp;uuml;md&amp;uuml;.&lt;/p&gt;
&lt;p&gt;Ardından kahvemi alıp West-World'e doğru yola &amp;ccedil;ıktım. Bu kez Sergei Rachmaninof, Henry Auguste ve Dan Hawkins'in aralarında yer aldığı piyano tınıları eşliğindeydim. Saatler gece yarısını ge&amp;ccedil;eli bir ka&amp;ccedil; dakika olmuştu. &amp;Ccedil;antamı a&amp;ccedil;tım ve hafta i&amp;ccedil;i .Net Core tarafındaki ara katmanın&lt;em&gt;(Middleware)&lt;/em&gt; ne işe yaradığını anlamaya &amp;ccedil;alışırken karaladığım notlarımı buldum. Bilgilerimi toparlamanın ve g&amp;uuml;zel bir &amp;ouml;rnek&amp;nbsp;yapıp tekrar unutmamak &amp;uuml;zere bloğuma bir şeyler yazmanın tam&amp;nbsp;vaktiydi.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/11/custom_mw5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;.Net Core a&amp;ccedil;ık kaynak olarak geliştirilmiş Kestrel web sunucusunu kullanmakta. Kestrel, web&amp;nbsp;&amp;ccedil;alışma zamanının ayağa kaldırılmasından, istemciden gelen taleplerin&lt;em&gt;(Request)&lt;/em&gt; hat &amp;uuml;zerindeki ara katman mod&amp;uuml;llerine&lt;em&gt;(pipeline middleware)&lt;/em&gt; ge&amp;ccedil;irilmesinden ve tabii ki &amp;uuml;retilen cevabın tekrar istemciye d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesinden sorumlu&lt;em&gt;(En temel fonksiyonellikleri bunlar)&lt;/em&gt; IIS gibi geniş kabiliyet ve y&amp;ouml;netsel &amp;ouml;zelliklere sahip g&amp;ouml;r&amp;uuml;nmese de bence &amp;ccedil;arpraz platformlarda microservice mimarisi i&amp;ccedil;in ideal bir&amp;nbsp;&amp;ccedil;atı&amp;nbsp;sunucusu. Benim ilgimi &amp;ccedil;ekense Pipeline Middleware tarafı. Burada, se&amp;ccedil;ilen web projesine g&amp;ouml;re varsayılan olarak gelen ara katman mod&amp;uuml;lleri zaten mevcut. Peki kendi middleware tipimizi de sisteme dahil edebilir miyiz? &lt;em&gt;(Sa&amp;ccedil;ma bir soru. Tabii ki de edebilirsin Burak; ama nasıl?)&lt;/em&gt; O zaman gelin bu işi nasıl yapabileceğimize bir bakalım.&lt;/p&gt;
&lt;p&gt;Başlangı&amp;ccedil;ta aşağıdaki terminal komutunu kullanarak standart bir Web API projesi oluşturarak işe başlayabiliriz. &amp;Ouml;rneğimizdeki amacımız orta katmana yeni bir arabirim ekleyebilmek. Bu nedenle ValuesController yapısını olduğu gibi bırakabiliriz.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new webapi -o CustomMW&lt;/pre&gt;
&lt;p&gt;Asp.Net Core tarafında oluşturulan projeler bildiğiniz gibi standart bir takım kodlarla gelmekte. Startup.cs i&amp;ccedil;eriği bu a&amp;ccedil;ından &amp;ouml;nemlidir. Nitekim web sunucusu ayağa kalkarken ger&amp;ccedil;ekleştirilecek bir &amp;ccedil;ok &amp;ouml;n hazırlık ve &amp;ccedil;alışma zamanı hareketliliklerine ait işleyişler burada ele alınır.&amp;nbsp;Configure metodunda yer alan app değişkeni, IApplicationBuilder aray&amp;uuml;z&amp;uuml;n&amp;uuml;n&amp;nbsp;olduk&amp;ccedil;a şık bir uyarlamasını kullanır ve bir &amp;ccedil;ok yeni ara katman &amp;ouml;zelliğinin &amp;ccedil;alışma zamanına dahil edilebilmesine olanak sağlar. Neler olduklarını g&amp;ouml;rmek i&amp;ccedil;in Use &amp;ouml;n eki ile başlayan metodlara bakmamız yeterli.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/11/custom_mw2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dilersek ara katmanda devreye girebilir ve pipeline &amp;uuml;zerinden hareket eden mesajları yakalayabiliriz&lt;em&gt;(Aslında pek &amp;ccedil;ok kaynakta ilk yapılan &amp;ouml;rnek bu)&lt;/em&gt; Bunun en basit yolu belli bir tipe bağlı olmadan kullanılabilen Use fonksiyonunu yazmaktan ge&amp;ccedil;mekte. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını ele alaım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void Configure(IApplicationBuilder app, IHostingEnvironment env)
{
    if (env.IsDevelopment())
    {
        app.UseDeveloperExceptionPage();
    }

    app.Use(async (HttpContext ctx,Func&amp;lt;Task&amp;gt; next)=&amp;gt;{
        var request=ctx.Request;
        Console.WriteLine("REQUEST {0}",DateTime.Now.ToLongTimeString());
        Console.WriteLine("{0}-{1}{2}",request.Method,request.Host,request.Path);

        await next.Invoke();

        var response=ctx.Response;
        Console.WriteLine("RESPONSE:{0}",DateTime.Now.ToLongTimeString());
        Console.WriteLine("{0}\t({1}){2}",response.ContentType,response.StatusCode, (HttpStatusCode)response.StatusCode);
    });

    app.UseMvc();

}&lt;/pre&gt;
&lt;p&gt;Use metodu HttpContext ve Func&amp;lt;Task&amp;gt; tipinden parametreler alan metodları işaret edebilecek bir temsilci&lt;em&gt;(delegate)&lt;/em&gt;&amp;nbsp;ile &amp;ccedil;alışır. HttpContext ile web &amp;ccedil;alışma zamanına gelen ve giden i&amp;ccedil;erikleri kontrol edebiliriz. &amp;Ouml;rnekte gelen mesaj ile ilgili HTTP metodu, adres bilgisi gibi değerler &amp;ccedil;ekilip Console penceresine yazdırılmaktadır. Sonrasında işleyişin&amp;nbsp;sıradaki ara katman hattına devredilmesi sağlanır&lt;em&gt;(Invoke &amp;ccedil;ağırımı)&lt;/em&gt; Ardından istemciye g&amp;ouml;nderilecek cevaba ait bir takım bilgiler yazdırılır. &amp;Ouml;rneğin d&amp;ouml;nen i&amp;ccedil;eriğin tipi ve durum kodu bilgisi gibi. &amp;Ccedil;alışma zamanında yapılan denemelerin sonu&amp;ccedil;larından &amp;ouml;rnek bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/11/custom_mw1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere yapılan her talebe ilişkin bir takım bilgiler terminal penceresine yazılmıştır. IApplicationBuilder aray&amp;uuml;z&amp;uuml; &amp;uuml;zerinden Use operasyonunu kullanılarak ilerlenilmesi basit ve pratik bir yol sunsa da, UseBlaBlaBla kullanımı kadar doğru değildir. Ara katmana dahil etmek istediğimiz operasyonları bir sınıf ile ilişkilendirmek sorumluluğun doğru y&amp;ouml;ne alınması ve tekrarlı kodların &amp;ouml;nlenmesi a&amp;ccedil;ısından iyi bir tercih olacaktır&lt;em&gt;(Hatta siz ayrı bir Class Library i&amp;ccedil;erisine alarak ilerleseniz daha iyi olur)&lt;/em&gt; &amp;Ouml;yleyse yazının en heyecan verici kısmına başlayalım.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Senaryomuz olduk&amp;ccedil;a anlamsız ama olsun. En nihayetinde varmak istediğimiz nokta app.UseWatson gibi bir ara katman mod&amp;uuml;l&amp;uuml;n&amp;uuml; boru hattına entegre edebilmek. Ben &amp;ouml;rnek olarak HTTP Post ile gelen mesajların i&amp;ccedil;erik boyutlarını kontrol etmeyi ve belli bir sınırın &amp;uuml;st&amp;uuml;nde olmaları halinde terminal penceresine uyarı &amp;ccedil;ıkartmayı planlıyorum. &amp;Ouml;rneğin yeni bir value eklenmek istendiğinde istemcinin JSON formatında bir i&amp;ccedil;erik g&amp;ouml;ndermesi gerekiyor. Bu i&amp;ccedil;eriğin boyutunun kontrol&amp;uuml;n&amp;uuml; ş&amp;uuml;pheci Watson'a verebiliriz. Pek tabii bir ger&amp;ccedil;ek hayat senaryosunda talebin doğrudan NotAllowed gibi bir durum koduna &amp;ccedil;ekilerek reddedilmesi de sağlanabilir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Senaryoda kritik olan noktalardan birisi mevzubahis i&amp;ccedil;erik limitinin bir yerlerden alınması gerekliliği. Kuvvetle muhtemel bunu app.UseWatson gibi bir fonksiyonla birlikte kullanmalıyız. &amp;Ouml;nce bu se&amp;ccedil;eneği i&amp;ccedil;erecek basit bir sınıfı projeye ekleyelim. İşte WatsonOptions.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Net;

public class WatsonOptions
{
    public long MaxSizeForPostContent{get;set;}
}&lt;/pre&gt;
&lt;p&gt;Bu sınıf &amp;uuml;zerinden i&amp;ccedil;erik limit kontrol&amp;uuml;n&amp;uuml; yapabilmek i&amp;ccedil;in maksimum boyut değerini taşıyacağız. Peki nereye? Ara katman mod&amp;uuml;l&amp;uuml;m&amp;uuml;z olan Watson sınıfına.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.IO;
using System.Threading.Tasks;
using Microsoft.AspNetCore.Http;
using Microsoft.Extensions.Options;

public class Watson
{
    private readonly RequestDelegate _nextMiddleWare;
    private readonly WatsonOptions _options;

    public Watson(RequestDelegate next, IOptions&amp;lt;WatsonOptions&amp;gt; options)
    {
        _nextMiddleWare = next;
        _options = options.Value;
    }

    public async Task Invoke(HttpContext context)
    {
        var request=context.Request;
        if(request.Method=="POST")
        {
            var contentLength=request.ContentLength;
            Console.WriteLine("[{0}]:{1}-{2}",DateTime.Now.ToLongTimeString(),request.Method,request.Path);
            
            if(contentLength&amp;gt;_options.MaxSizeForPostContent)
            {
                Console.ForegroundColor=ConsoleColor.Red;
                Console.WriteLine("POST size limit violation : {0} bytes\nLimit-&amp;gt;{1}",contentLength,_options.MaxSizeForPostContent);
                Console.ForegroundColor=ConsoleColor.White;
                //TODO Something
            }
            else
            {
                Console.ForegroundColor=ConsoleColor.Green;
                Console.WriteLine("Length is OK ({0})",contentLength);
                Console.ForegroundColor=ConsoleColor.White;
            }
        }

        await _nextMiddleWare(context);                  
    }  
}&lt;/pre&gt;
&lt;p&gt;Watson, metodları rastgele tanımlanmış bir sınıf değil. Yapıcı&lt;em&gt;(Constructor)&lt;/em&gt; metodu bir yana Task tipinden nesne d&amp;ouml;nd&amp;uuml;ren ve HttpContext &amp;ouml;rneğini parametre alan Invoke isimli bir fonksiyon i&amp;ccedil;ermekte. Sanki ilk yazdığımız app.Use() metodunun kullandığı temsilciye&lt;em&gt;(RequestDelegate)&lt;/em&gt; olduk&amp;ccedil;a benziyor değil mi? Hatta tıpkısının aynısı diyebiliriz. Bu metod i&amp;ccedil;erisinde HttpContext nesnesini kullanarak o anki talebin HTTP Post olup olmadığını kontrol ediyor ve eğer &amp;ouml;yleyse gelen i&amp;ccedil;eriğin boyutuna bakıyoruz. Şimdilik sadece ekrana bilgi yazdıran bir operasyon s&amp;ouml;z konusu. Metodun sonunda&amp;nbsp;yapılan &amp;ccedil;ağrı ile ilk başta gelen i&amp;ccedil;eriğin&amp;nbsp;&amp;ccedil;alışma zamanındaki bir sonraki ara katman mod&amp;uuml;l&amp;uuml;ne devredilmesi sağlanıyor.&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil;ta pipeline &amp;uuml;zerinde bir metod zinciri s&amp;ouml;z konusu diyebiliriz. Ayrıca ilk başta kullandığımız app.Use() fonksiyonelliğinin sorumluluğunu başka bir tipe aldığımızı ifade edebiliriz.&lt;/p&gt;
&lt;p&gt;Yalnız ortada k&amp;uuml;&amp;ccedil;&amp;uuml;k bir sorun var. Configure metodunda kullanılan IApplicationBuilder değişkeninin ardından UseWatson gibi bir metodu nasıl &amp;ccedil;ıkartacağız? Neyse ki fii tarihinde .Net'e Extension Methods diye bir kavram eklenmiş :) Yapacağımız şey bu. S&amp;ouml;z konusu genişletme işini WatsonExtensions isimli sınıfa şu şekilde yıkabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Microsoft.AspNetCore.Builder;
using Microsoft.Extensions.Options;

public static class WatsonExtensions
{
    public static IApplicationBuilder UseWatson(this IApplicationBuilder app,WatsonOptions options)
    {
        return app.UseMiddleware&amp;lt;Watson&amp;gt;(Options.Create(options));
    }
}&lt;/pre&gt;
&lt;p&gt;İlk parametre ile gelen app değişkeni &amp;uuml;zerinden UseMiddlerware metodunun generic versiyonunu &amp;ccedil;ağırıyoruz. Generic&amp;nbsp;tipimiz Watson sınıfı.&amp;nbsp;Parametre olarak da maksimum boyut &amp;ouml;zelliğini i&amp;ccedil;eren options değişkenini aktarıyoruz. En dikkat &amp;ccedil;ekici noktalardan birisi de UseWatson metodunun genişlettiği IApplicationBuilder tipinden bir referans d&amp;ouml;nd&amp;uuml;rmesi.&amp;nbsp;Resmen Fleunt bir Interface akımı s&amp;ouml;z konusu gibi ;) Yapılan bu değişikliklere g&amp;ouml;re Startup.cs i&amp;ccedil;erisindeki Configure metodunda aşağıdaki gibi bir kullanım artık m&amp;uuml;mk&amp;uuml;n.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;app.UseWatson(new WatsonOptions{
	MaxSizeForPostContent=1024
});&lt;/pre&gt;
&lt;p&gt;Volaaa!!! A&amp;ccedil;ık&amp;ccedil;ası bu yaklaşım &amp;ccedil;ok hoşuma gitti diyebilirim. Bir interface veya abstract sınıf t&amp;uuml;retimi ile plug-in mantığında bir genişletme yerine Fluent yapıyı benimseyen bir interface tipini genişleterek&amp;nbsp;pipeline &amp;uuml;zerine yeni bir middleware&amp;nbsp;ekleyebildik. Bunu sıfırdan kurgulamaya &amp;ccedil;alışıp kendimizi daha da geliştirebiliriz ama şimdilik &amp;ouml;d&amp;uuml;l&amp;uuml;m&amp;uuml;z olan &amp;ccedil;alışma zamanı sonu&amp;ccedil;larına bir bakalım derim. Firefox HttpRequester ile normal ve izin verilen limit &amp;uuml;st&amp;uuml;ndeki boyutlarda POST işlemleri yaptığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer sonu&amp;ccedil;lar alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/11/custom_mw3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabii burada gelen ge&amp;ccedil;en t&amp;uuml;m mesajları boyutu ne olursa olsun işlettik. Belki de boyut kontrol&amp;uuml;n&amp;uuml;n başka bir yolu da vardır ama amacımız &amp;ouml;zel bir ara katman mod&amp;uuml;l&amp;uuml;n&amp;uuml; nasıl entegre edebileceğimizi g&amp;ouml;rmekti. Hayal g&amp;uuml;c&amp;uuml;n&amp;uuml;z&amp;uuml; zorlayın ve nasıl ara katman ekleyebilirsiniz bir d&amp;uuml;ş&amp;uuml;n&amp;uuml;n. Bu yapıyı sadece Web API tarafında değil Kestrel kullanılan t&amp;uuml;m .Net Core projelerinde ele alabiliriz. Dilerseniz benzer &amp;ouml;rneği farklı bir senaryo ile bir MVC projesinde deneyerek bilgilerinizi pekiştirebilirsiniz. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-12-18 06:01:00</pubDate>
  <slug>web-api-icin-custom-middleware-yazmak</slug>
  <tags>
    <tag>net-core-20</tag>
    <tag>aspnet-core</tag>
    <tag>aspnet-core-webapi</tag>
    <tag>webapi</tag>
    <tag>middleware</tag>
    <tag>custom-middleware</tag>
    <tag>kestrel</tag>
    <tag>pipeline</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
    <category>Asp.Net Core</category>
  </categories>
</post>