<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF - Transaction Yonetimi (Transaction Management) - 1</title>
  <description>Transaction (İşlem) yönetimi özellikle veritabanı kaynakları söz konusu olduğunda her sistemde büyük bir önem sahiptir. Basit olarak transaction bir veya daha çok işlem bütününü temsil eder. Bütünü oluşturan söz konusu işlem parçaları çoğunlukla birbirleriyle ilişkilidir ve hepsinin başarılı bir şekilde tamamlanabilmesi sonrasında transaction' ın başarılı olduğu söylenebilir. Bu doğal olarak işlem parçalarından herhangibirinin başarısız olması sonucunda transaction' ınında başarısız olması anlamına gelmektedir. Aşağıdaki şekilde bir transaction' ın süreç içerisinde sistemin belirli bir konumdan başka bir konuma geçişi sırasında üstlendiği rol ifade edilmeye çalışılmaktadır.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Transaction (İşlem) y&amp;ouml;netimi &amp;ouml;zellikle veritabanı kaynakları s&amp;ouml;z konusu olduğunda her sistemde b&amp;uuml;y&amp;uuml;k bir &amp;ouml;nem sahiptir. Basit olarak transaction bir veya daha &amp;ccedil;ok işlem b&amp;uuml;t&amp;uuml;n&amp;uuml;n&amp;uuml; temsil eder. B&amp;uuml;t&amp;uuml;n&amp;uuml; oluşturan s&amp;ouml;z konusu işlem par&amp;ccedil;aları &amp;ccedil;oğunlukla birbirleriyle ilişkilidir ve hepsinin başarılı bir şekilde tamamlanabilmesi sonrasında transaction' ın başarılı olduğu s&amp;ouml;ylenebilir. Bu doğal olarak işlem par&amp;ccedil;alarından herhangibirinin başarısız olması sonucunda transaction' ınında başarısız olması anlamına gelmektedir. Aşağıdaki şekilde bir transaction' ın s&amp;uuml;re&amp;ccedil; i&amp;ccedil;erisinde sistemin belirli bir konumdan başka bir konuma ge&amp;ccedil;işi sırasında &amp;uuml;stlendiği rol ifade edilmeye &amp;ccedil;alışılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk209_1.gif" alt="" width="406" height="207" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re sistemin belirli bir konumdan başka bir konuma ge&amp;ccedil;mesi sırasında yapılacak işlemlerin tamamı bir b&amp;uuml;t&amp;uuml;n olarak ele alınmalıdır. S&amp;ouml;z konusu b&amp;uuml;t&amp;uuml;n i&amp;ccedil;erisinde meydana gelebilecek aksamalarda sistem ilk konumuna (Konum A) d&amp;ouml;nebilmelidir. Tam tersine t&amp;uuml;m işlemler başarılı olduğunda sistem yeni konumuna (Konum B) ge&amp;ccedil;ebilir. Bu şekilde d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;ne transaction ACID(&lt;strong&gt;A&lt;/strong&gt;tomicity&lt;strong&gt;C&lt;/strong&gt;onsistency&lt;strong&gt;I&lt;/strong&gt;solation&lt;strong&gt;D&lt;/strong&gt;urability) adı verilen standartları sağlamak durumundadır. Makalemizin konusu Windows Communication Foundation sistemi &amp;uuml;zerinde transaction y&amp;ouml;netiminin nasıl sağlanabileceğinin temellerini incelemektir. Yinede &lt;strong&gt; ACID&lt;/strong&gt; ilkelerinden kısaca bahsetmek gerektiği en azından hatırlanmasında fayda olacağı kanısındayım.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Atomicity&lt;/strong&gt; ilkesine g&amp;ouml;re bir transaction' ın başarılı olması, i&amp;ccedil;erisinde yer alan t&amp;uuml;m işlem par&amp;ccedil;alarının ayrı ayrı başarılı olması anlamına gelmektedir. &lt;strong&gt; Consistency&lt;/strong&gt; ilkesi, yapılan işlemler sonucunda oluşan &amp;ccedil;ıktıların tutarlılığı anlamına gelir. Her zaman verilen bir &amp;ouml;rnek tutarlılık ilkesini son derece g&amp;uuml;zel anlatmaktadır. Bankalar arası yapılan bir havale işlemi sırasında bir hesaptan &amp;ccedil;ıkan miktar ne kadar ise diğer hesaba aktarılanında o kadar olması gerekir. Ne bir fazla ne de bir eksik olmamalıdır. İşte bu verinin tutarlılığını korumak olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. &lt;strong&gt;Isolation&lt;/strong&gt; ilkesine g&amp;ouml;re bir transaction i&amp;ccedil;erisindeki t&amp;uuml;m işlem par&amp;ccedil;aları diğer transactionlardan izole olacak şekilde &amp;ccedil;alışmalıdır. Bu olmadığı takdirde tutarsızlıklar oluşabilir.&lt;/p&gt;
&lt;p&gt;Elbette transaction' larda s&amp;ouml;z konusu olabilecek &lt;strong&gt;Dirty-Read&lt;/strong&gt;, &lt;strong&gt;Phantom&lt;/strong&gt;, &lt;strong&gt;Non-Repeatable Read&lt;/strong&gt; gibi durumların hangisinin tercih edileceğine g&amp;ouml;re &amp;ccedil;eşitli izolasyon seviyeleri &lt;strong&gt;(Isolation Levels)&lt;/strong&gt; pek &amp;ccedil;ok veri tabanı sisteminde ele alınmaktadır. Bunlar .Net tarafındaki Transaction sınıflarıncada kullanılmakta ve &lt;strong&gt;IsolationLevel&lt;/strong&gt; enum sabitleri ile işaret edilmektedir. S&amp;ouml;z konusu seviyeler &lt;strong&gt;WCF&lt;/strong&gt; i&amp;ccedil;erisindede bir servis davranışı (Service Behavior) olarak belirtilebilmektedir. S&amp;ouml;z konusu bildirim &lt;strong&gt;ServiceBehavior&lt;/strong&gt; niteliğinin &lt;strong&gt;TransactionIsolationLevel&lt;/strong&gt; &amp;ouml;zelliğinin değeri ile sabitlenmektedir.&lt;em&gt;&lt;br /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Temel Olarak Transaction' larda D&amp;uuml;ş&amp;uuml;nelecek Senaryolar;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Phantom; &lt;/strong&gt;başlatılan iki transaction olduğunu d&amp;uuml;ş&amp;uuml;nelim. Bu transactionların birisi a&amp;ccedil;ık iken yeni bir veri girişi yapıp işlemi onaylıyor (Commit) olsun. Bu durumda halen daha a&amp;ccedil;ık olan diğer transaction aynı veri k&amp;uuml;mesini tekrardan talep ettiğinde daha &amp;ouml;nce kendisinde var olmayan yeni eklenmiş bir satır ile karşılaşacaktır. Bu satırlar hayalet(Phantom) olarak adlandırılır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Non-Repeatable Read; &lt;/strong&gt; yine başlatılmış iki transaction olduğunu d&amp;uuml;ş&amp;uuml;nelim. Bu sefer a&amp;ccedil;ık olan transaction' lardan birisi var olan veri k&amp;uuml;mesinde belirli bir satırda(satırlarda) g&amp;uuml;ncelleme işlemi yapmış olsun. Sonrasında ise yapılan bu değişiklikleri onaylasın(Commit). A&amp;ccedil;ık kalan diğer transaction'ın tekrardan aynı veri k&amp;uuml;mesini &amp;ccedil;ektiğini d&amp;uuml;ş&amp;uuml;nelim. Bu durumda a&amp;ccedil;ık olan transaction daha &amp;ouml;nce baktığı verilerin değiştiğini g&amp;ouml;recektir. Bu Non-Repeatable Read olarak adlandırılan bir durumdur.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Dirty-Read;&lt;/strong&gt; yine başlatılmış iki transaction olduğunu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. Bunlardan birisi veri k&amp;uuml;mesine herhangibir satır eklemiş veya g&amp;uuml;ncellemiş olsun. Ancak bu sırada diğer transaction'ın tekrardan veri &amp;ccedil;ektiğini d&amp;uuml;ş&amp;uuml;nelim. Burada dikkat edilmesi gereken durum şudur; iki transaction a&amp;ccedil;ık iken, herhangibiri commit edilmeden &amp;ouml;nce diğeri veri &amp;ccedil;ekebilmektedirler. Dolayısıyla diğer transaction var olan ekleme ve değişiklikleri o an i&amp;ccedil;in g&amp;ouml;recektir. Ne varki bu senaryoda değişiklikleri yapan transaction işlemleri &lt;strong&gt; Commit&lt;/strong&gt; &lt;strong&gt;etmez&lt;/strong&gt;. Aksine geri alır&lt;strong&gt;(Rollback)&lt;/strong&gt;. Bu durumda daha &amp;ouml;nce tekrardan veri &amp;ccedil;eken a&amp;ccedil;ık transaction' da aslında geri alınmış g&amp;uuml;ncellemeler ve eklemeler g&amp;ouml;r&amp;uuml;lmektedir. Bu Dirty-Read durumu olarak adlandırılmaktadır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;Durability&lt;/strong&gt; ilkesine g&amp;ouml;re transaction i&amp;ccedil;erisinde yer alan iş par&amp;ccedil;alarında bir aksaklık olması halinde sistemin ilk haline d&amp;ouml;nebilmesi gerekir. Yani taşlar ilk konumlarındaki yerlerinde kalabilmeldir.&lt;/p&gt;
&lt;p&gt;Gelelim WCF i&amp;ccedil;erisindeki duruma. Transaction' lar &lt;strong&gt;servis y&amp;ouml;nelimli mimari (Service Oriented Architecture) &lt;/strong&gt;&amp;uuml;zerinde ele alındığında işin i&amp;ccedil;erisine giren fakt&amp;ouml;rler transaction y&amp;ouml;netimini zorlaştırmaktadır. Nitekim işlem par&amp;ccedil;alarının farklı makinelerdeki, farklı uygulama alanları &lt;strong&gt; (AppDomain) &lt;/strong&gt;i&amp;ccedil;erisinde&lt;em&gt;(Dolayısıyla farklı s&amp;uuml;re&amp;ccedil;-process' lerde)&lt;/em&gt; olmaları s&amp;ouml;z konusudur. Bu işlem par&amp;ccedil;aları &amp;ccedil;eşitli kaynakları &lt;strong&gt; (Resources)&lt;/strong&gt; kullanacaktır. S&amp;ouml;z konusu kaynaklar farklı veritabanı sistemleride olabilir. &amp;Ouml;rneğin bir servis Microsoft SQL Server &amp;uuml;zerinde bir işlem ger&amp;ccedil;ekleştiriyorken, buna bağlı olan diğer bir işlem par&amp;ccedil;asıda Oracle veritabanı kullanan başka bir servisin par&amp;ccedil;ası olabilir. Dahası farklı uygulama alanları(Application Domain) i&amp;ccedil;erisindeki taraflar basit birer istemci dışında başka servislerde olabilir ve bunlar farklı platformlar &amp;uuml;zerinde yer alabilir. En iyimser haliyle d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde tek bir AppDomain i&amp;ccedil;erisinde konuşlandırılmış bir WCF Servis uygulaması, kendisine bağlı bir veya daha &amp;ccedil;ok kaynak &lt;strong&gt;(resource)&lt;/strong&gt; &amp;uuml;zerinde &amp;ccedil;alışacak transaction' ları kolay bir şekilde y&amp;ouml;netebilir. Aşağıdaki şekilde bu durum analiz edilmeye &amp;ccedil;alışılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk209_2.gif" alt="" width="426" height="192" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada bilinen Ado.Net Transaction tiplerinin kullanılması bile yeterlidir. Ne varki az &amp;ouml;nce bahsettiğimiz gibi servis y&amp;ouml;nelimli mimari aslında aşağıdaki şekildekine benzer bir durumuda i&amp;ccedil;ermektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk209_3.gif" alt="" width="503" height="413" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sanıyorumki şimdi durum biraz daha karıştı. Bu şekle g&amp;ouml;re istemcinin talepte bulunduğu işlemler sonrası Servis A, Servis B ve Servis C &amp;uuml;zerindeki kaynaklardaki işlem par&amp;ccedil;alarının başarılı bir şekilde tamamlanmasını istemektedir. Bir başka deyişle Servis B , Servis C ve Servis A &amp;uuml;zerindeki işlem par&amp;ccedil;alarının hepsinin ayrı ayrı başarılı olmaları gerekmektedir. Burada ortaya bir koordinasyon problemi &amp;ccedil;ıktığıda son derece a&amp;ccedil;ıktır. &amp;Ouml;rneğin aşağı maddeler halinde sıralanmış olan soruların s&amp;ouml;z konusu sistemde nasıl karşılanabileceği d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde, sadece bu işler i&amp;ccedil;in neden g&amp;uuml;&amp;ccedil;l&amp;uuml; koordinasyon uygulamaları yazıldığı daha kolay bir şekilde anlaşılmaktadır.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Acaba bu sistemde Transaction' ı kim başlatacak?&lt;/li&gt;
&lt;li&gt;Diyelimki Transaction birisi tarafından başlatıldı. Diğer işlem par&amp;ccedil;alarını a&amp;ccedil;ılan bu Transaction' a kim dahil edecek &lt;strong&gt;(auto enlist)&lt;/strong&gt;? &amp;Ouml;yleki dahil olmadan transaction' ın farklı sistemlere yayıldığı nasıl anlaşılacak?&lt;/li&gt;
&lt;li&gt;Geri alma&lt;strong&gt;(Rollback) &lt;/strong&gt;veya onaylama&lt;strong&gt;(Commit)&lt;/strong&gt; işlemlerini kim &amp;uuml;stlenecek?&lt;/li&gt;
&lt;li&gt;Birden fazla servis s&amp;ouml;z konusu olduğundan bunlar &amp;uuml;zerinde toplu bir rollback veya commit kararı nasıl ve neye g&amp;ouml;re verilecek?&lt;/li&gt;
&lt;li&gt;Eğer Transaction' ı &amp;uuml;stlenen, bir başka deyişle s&amp;uuml;reci başlatıp bitirecek olan servis, diğer servislerdeki işlem par&amp;ccedil;alarının sonu&amp;ccedil;larından nasıl haberdar olacak?&lt;/li&gt;
&lt;li&gt;Bahsedilen bu işlem par&amp;ccedil;alarını i&amp;ccedil;eren ve y&amp;uuml;r&amp;uuml;ten servisler farklı platformlarda hatta farklı iletişim seviyelerinde&lt;em&gt;(Http, Tcp gibi)&lt;/em&gt; olduğu zaman nasıl kontrol altına alınacak?&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere sorular ve sorunlar giderek artmaktadır. &amp;Ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;n adı &lt;strong&gt;dağıtık transaction (Distributed Transactions)&lt;/strong&gt; dır. Ger&amp;ccedil;ektende servis y&amp;ouml;nelimli mimarilerde(SOA-Service Oriented Architecture) yer alan işlem par&amp;ccedil;alarını kontrol altına almanın tek yol&amp;uuml; dağıtık transaction' ları kullanmaktadır. Dağıtık transaction' lar iki &amp;ouml;nemli par&amp;ccedil;aya sahiptir. İlk olarak bu modelde &amp;ccedil;ift y&amp;ouml;nl&amp;uuml; ge&amp;ccedil;erli kılma &lt;strong&gt;(two phase commit)&lt;/strong&gt; adı verilen bir protokol s&amp;ouml;z konusudur. İkinciside transaction y&amp;ouml;netimini &amp;uuml;stlenen ve genelde &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; parti olarak tedarik edilen bir y&amp;ouml;netici uygulamadır &lt;strong&gt;(Dedicated Transaction Manager)&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok basit olarak &lt;strong&gt;two phase commit&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml; a&amp;ccedil;ıklamaya &amp;ccedil;alışarak devam edelim. Bu protokol iki aşamadan oluşur. İlk aşamada transaction' a katılan işlem par&amp;ccedil;alarından sorumlu servisler kendi işlemlerinin başarılı olup olmadıklarına dair y&amp;ouml;neticiye bilgi g&amp;ouml;nderirler&lt;em&gt;(Pek &amp;ccedil;ok kaynakta bu işlem oylama-&lt;strong&gt;voting&lt;/strong&gt; olarakta ge&amp;ccedil;mektedir)&lt;/em&gt;. Buradaki y&amp;ouml;netici root g&amp;ouml;revini &amp;uuml;stlenen bir servise adanmış da olabilir. İkinci aşamada y&amp;ouml;netici, a&amp;ccedil;mış olduğu transaction i&amp;ccedil;erisine katılmış işlem par&amp;ccedil;alarının oylamalarını değerlendirir. Eğer hepsi ge&amp;ccedil;erli ise t&amp;uuml;m bağlı olan işlem par&amp;ccedil;aları i&amp;ccedil;in ilgili servislere onaylayın bilgisini g&amp;ouml;nderir(Commit aşaması). Elbetteki tam tersi durumda bağlı servislere işlemleri geri almalarına dair başka bir bilgi g&amp;ouml;nderilecektir(Rollback aşaması).&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z konusu &amp;ccedil;ift y&amp;ouml;nl&amp;uuml; ge&amp;ccedil;erli kılma protokol&amp;uuml;n&amp;uuml;n yanı sıra, Windows Communication Foundation servislerin bulundukları farklı platformlara, aradaki iletişim protokollerinin &amp;ccedil;eşitliliğine g&amp;ouml;re &amp;uuml;&amp;ccedil; ayrı transaction protokol&amp;uuml; i&amp;ccedil;erir. Bunlar &lt;strong&gt; Lightweight, OleTx&lt;/strong&gt; ve&lt;strong&gt; WSAT (WS-Atomic)&lt;/strong&gt; transaction protokolleridir. Aslında OleTx ve WS-Atomic kendi i&amp;ccedil;lerinde two phase commit protokol&amp;uuml;n&amp;uuml; zaten ele almaktadırlar.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Lightweight&lt;/strong&gt; transaction protokol&amp;uuml;ne g&amp;ouml;re işlem par&amp;ccedil;aları yerel olarak servis i&amp;ccedil;erisinde ele alınır. Bir başka deyişle s&amp;ouml;z konusu transaction servis sınırları dışına &amp;ccedil;ıkartılamaz. Buda ilgili iş par&amp;ccedil;alarının başka servislerde başlatılacak hizmetlere katılamayacağı anlamına gelir. Tipik olarak bir istemci ve servisin s&amp;ouml;z konusu olduğu durumlarda ele alınabilir. Servis i&amp;ccedil;erisinde yerel olarak kullanıldıklarından performans y&amp;ouml;n&amp;uuml;nden avantajlıdır diğer modellerine g&amp;ouml;re daha avantajlıdır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;OleTx&lt;/strong&gt; tipinde, transaction başlatıldığı servis, uygulama alanı ve makine sınırlarını aşabilir. Dolayısıyla dağıtık transaction' ların y&amp;ouml;netimi sırasında kolayca ele alınabilir. Ancak bu protokol intranet tabanlı Windows sistemleri &amp;uuml;zerine tasarlanmıştır. Bu sebepten firewall gibi sistemlere takılma riski vardır. Ayrıca Windows tabanlı geliştirildiğinden farklı tipteki platformlar tarafından desteklenmeyecektir. Bu nedenle OleTx tipi transaction protokol&amp;uuml; Windows tabanlı &lt;strong&gt;intranet&lt;/strong&gt; sistemlerinde tercih edilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WSAT (Web Service Atomic)&lt;/strong&gt; tipinden transactionlar aynen OleTx' de oluduğu gibi servis, uygulama alanı ve makine sınırlarını aşabilir. Diğer taraftan WS-Atomic global bir standarttır. &amp;Ouml;zellikle web servislerinde yaygın olarak kullanılmaktadır. Bu nedele a&amp;ccedil;ık metin tabanlı olarak &amp;ccedil;alıştığında farklı platformlar tarafından kullanılabilir ve OleTx tipinde olduğu gibi firewall engeline takılmaz. Bu sebeten &lt;strong&gt;internet&lt;/strong&gt; tabanlı sistemlerdeki dağıtık transaction' ların y&amp;ouml;netiminde tercih edilen bir protokold&amp;uuml;r. Elbetteki intranet tabanlı sistemlerede istenirse uygulanabilir.&lt;/p&gt;
&lt;p&gt;Bildiğiniz gibi Windows Communication Foundation i&amp;ccedil;erisinde servisler ile istemciler arasındaki iletişim sağlanırken pek &amp;ccedil;ok ayarlamayı b&amp;uuml;nyesinde barındıran bağlayıcı tipler &lt;strong&gt; (Binding Type)&lt;/strong&gt; kullanılmaktadır. Bağlayıcı tipler iletişim protokol&amp;uuml;, g&amp;uuml;venlik ayarları dışında, transaction protokollerininde kolay bir şekilde belirlenmesinde &amp;ouml;nemli g&amp;ouml;revler &amp;uuml;stlenir. Bunların bir kısmının &lt;strong&gt;OleTx&lt;/strong&gt; yada &lt;strong&gt;WSAT&lt;/strong&gt; transaction protokolleri i&amp;ccedil;in desteği bulunmamaktadır. Bir kısmınında hi&amp;ccedil; bir transaction protokol&amp;uuml;ne desteği bulunmamaktadır. Aşağıdaki tabloda var olan Windows Communication Foundation bağlayıcı tiplerinin desteklediği &lt;span style="text-decoration: underline;"&gt;&lt;strong&gt; varsayılan&lt;/strong&gt; transaction protokolleri yer almaktadır.&lt;/span&gt;&lt;/p&gt;
&lt;table id="table96" style="border-collapse: collapse; width: 454px;" border="1" cellspacing="0" cellpadding="5"&gt;&lt;colgroup&gt; &lt;col style="width: 103pt;" width="137" /&gt; &lt;col style="width: 154pt;" width="205" /&gt; &lt;/colgroup&gt;
&lt;tbody&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;td style="width: 200px; height: 12.75pt; text-align: left; vertical-align: middle; background-color: #cccccc;" height="17"&gt;Binding Tipi&lt;/td&gt;
&lt;td style="width: 247px; text-align: left; vertical-align: middle; background-color: #cccccc;"&gt;Transaction Protokol&amp;uuml; Desteği&lt;/td&gt;
&lt;/tr&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;" height="17"&gt;BasicHttpBinding&lt;/td&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;"&gt;Destek yok&lt;/td&gt;
&lt;/tr&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;" height="17"&gt;WSHttpBinding&lt;/td&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;"&gt;WSAT&lt;/td&gt;
&lt;/tr&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;" height="17"&gt;WSDualHttpBinding&lt;/td&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;"&gt;WSAT&lt;/td&gt;
&lt;/tr&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;" height="17"&gt;WSFederationHttpBinding&lt;/td&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;"&gt;WSAT&lt;/td&gt;
&lt;/tr&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;" height="17"&gt;NetTcpBinding&lt;/td&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;"&gt;OleTx&lt;/td&gt;
&lt;/tr&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;" height="17"&gt;NetPeerTcpBinding&lt;/td&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;"&gt;Destek yok&lt;/td&gt;
&lt;/tr&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;" height="17"&gt;NetNamedPipesBinding&lt;/td&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;"&gt;OleTx&lt;/td&gt;
&lt;/tr&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;" height="17"&gt;NetMsmqBinding&lt;/td&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;"&gt;Destek yok&lt;/td&gt;
&lt;/tr&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;" height="17"&gt;MsmqIntegrationBinding&lt;/td&gt;
&lt;td style="width: 200px; height: 12.75pt; vertical-align: top;"&gt;Destek yok&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Burada dikkat edilmesi gereken konulardan biriside &lt;strong&gt;NetTcpBinding&lt;/strong&gt;, &lt;strong&gt;NetNamedPipesBinding&lt;/strong&gt; i&amp;ccedil;in varsayılan olan &lt;strong&gt;OleTx&lt;/strong&gt; transaction desteğinin &lt;strong&gt;WSAT&lt;/strong&gt; olarak da ayarlanabileceğidir. Ancak intranet &amp;uuml;zerinde koşan Windows tabanlı bir sistemde bu performası olumsuz etkileyecek bir değişiklik olabilir. Yinede istenirse, intranet &amp;uuml;zerinde farklı platformlar s&amp;ouml;z konusu olduğunda ilgili bağlayıcı tipler i&amp;ccedil;in WSAT desteği se&amp;ccedil;ilebilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bilindiği gibi Windows Communication Foundation uygulamalarında kendi bağlayıcı tiplerimizi &lt;strong&gt;(user defined binding type)&lt;/strong&gt; yazabiliriz. B&amp;ouml;yle bir durumda hangi transaction protokol&amp;uuml;n&amp;uuml;n kullanılacağı tam olarak geliştiriciye bağlıdır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Artık bağlayıcı tipin ele alabileceği transaction protokolleri bilindiğine g&amp;ouml;re geriye bir tek transaction y&amp;ouml;netimini &amp;uuml;stlenecek bir uygulama bulmak kalmaktadır. Bu tip bir uygulamayı geliştirmek olduk&amp;ccedil;a zor olduğundan &amp;ccedil;oğunlukla &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; parti programlar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınmaktadır. Windows Communication Foundation d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde kullanılabilecek s&amp;ouml;z konusu y&amp;ouml;neticiler, &lt;strong&gt;LTM (LightWeight Transaction Manager), KTM (Kernel Transaction Manager)&lt;/strong&gt; ve &lt;strong&gt;DTC (Distributed Transaction Cooridantor) &lt;/strong&gt;tipleridir. Bu tiplerden KTM, &lt;strong&gt;Windows Vista&lt;/strong&gt; ile birlikte gelmektedir.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z konusu y&amp;ouml;neticiler arasında bizi en &amp;ccedil;ok ilgilendirenlerden ve aşina olduklarımızdan birisi DTC' dir. &amp;Ouml;zellikle Ado.Net 2.0 ile birlikte gelen &lt;strong&gt;TransactionScope&lt;/strong&gt; nesnesinin otomatik olarak DTC &amp;ouml;zelliğini aktifleştirebildiği ve dağıtık transaction' ların daha kolay y&amp;ouml;netilebilirliğini sağladığı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında, servis y&amp;ouml;nelimli mimari model i&amp;ccedil;in ne kadar anlamlı olduğu a&amp;ccedil;ık bir şekilde ortadadır. Dağıtık transaction koordinat&amp;ouml;r&amp;uuml;, hem &lt;strong&gt; OleTx&lt;/strong&gt; hemde &lt;strong&gt;WSAT&lt;/strong&gt; transaction protokollerini destekler. Dolayısıyla internet veya intranet tabanlı sistemlerde yer alabilecek servis uygulamalarında transaction' ların servis sınırları dışarısına yayınlanabilmesine olanak sağlar.&lt;/p&gt;
&lt;p&gt;DTC(Distributed Transaction Coordinator) transactionların oluşturulup başlatılmasından, s&amp;uuml;re&amp;ccedil; i&amp;ccedil;erisindeki diğer uygulama alanlarında&lt;strong&gt;(AppDomain)&lt;/strong&gt; yer alan servislere ait işlem par&amp;ccedil;alarının var olan transaction' a katılmasından &lt;strong&gt;(enlist)&lt;/strong&gt;, kaynak y&amp;ouml;neticilerinden&lt;strong&gt;(Resoruce Managers)&lt;/strong&gt; gelen onay mesajlarının &lt;strong&gt;(vote)&lt;/strong&gt; toplanmasından ve elbetteki t&amp;uuml;m işlemlerin onaylanması&lt;strong&gt;(Commit) &lt;/strong&gt;veya geri alınmasından&lt;strong&gt;(Rollback)&lt;/strong&gt; sorumlu genel bir sistem servisi olarak g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Bu a&amp;ccedil;ıdan bakıldığında Windows Communication Foundation ile arasında olduk&amp;ccedil;a sıkı bir ilişki olması ka&amp;ccedil;ınılmazdır. Konuyu daha iyi kavrayabilmek i&amp;ccedil;in aşağıdaki şekil g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk209_4.gif" alt="" width="578" height="374" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İstemci uygulama, Makine A &amp;uuml;zerinde yer alan servisten bir işlem i&amp;ccedil;in talepte bulunmaktadır. Makine A &amp;uuml;zerinde yer alan servis bu senaryoda root olarak g&amp;ouml;rev yapmaktadır. Buna g&amp;ouml;re transaction' ın başlatılmasından hatta sonlandırılmasında&lt;em&gt;n (ister commit ister rollback)&lt;/em&gt; kendisi sorumludur. Makine A' da yer alan servis işlemlerin geri kalanı i&amp;ccedil;in Makine B ve C &amp;uuml;zerinde yer alan servisleride kullanmaktadır. Burada root servis kendi proxy nesnesi yardımıyla B ve C servislerine bir transaction ID değeri g&amp;ouml;nderir. Bu transaction ID sistem tarafından &amp;uuml;retilen benzersiz ve tekrar etmeyen bir değerdir. Bunu programlama ortamında da kullanabildiğimiz GUID (Global Unique IDentifier) değeri olarak d&amp;uuml;ş&amp;uuml;nebiliriz. S&amp;ouml;z konusu ID, B ve C servisleri tarafından kendi makinelerindeki &lt;strong&gt;DTC&lt;/strong&gt; hizmetlerinede bildirilir. Bir başka deyişle B ve C makinelerinde yapılmak &amp;uuml;zere olan işlemlerin, transaction ID' si belirtilen s&amp;uuml;rece ait oldukları bildirilir. Dolayısıyla B ve C servislerinin y&amp;uuml;r&amp;uuml;tt&amp;uuml;kleri işlemler otomatik olarak, root servis tarafından a&amp;ccedil;ılan transaction' a dahil edilmiş olurlar.&lt;/p&gt;
&lt;p&gt;Bu işlemlerin ardından tahmin edileceği &amp;uuml;zere &amp;ccedil;ift y&amp;ouml;nl&amp;uuml; ge&amp;ccedil;erli kılma protokol&amp;uuml;&lt;strong&gt;(two phase commit protocol)&lt;/strong&gt; başlar. Yani root servis, transaction' a dahil olmuş diğer servislerden oylarını ister. Burada diğer makinelerdeki DTC servisleri devreye girerek oylama&lt;strong&gt;(vote)&lt;/strong&gt; sonu&amp;ccedil;larını root DTC servisine iletirler. Eğer herkes kabul ediyorsa, bir başka deyişle transaction' a dahil olan t&amp;uuml;m servisler yaptıkları işlemlere onay vermişse, root servis ikinci aşamaya ge&amp;ccedil;er. Bu aşamada da transaction' a dahil olan servislere işlemleri onaylamalarına dair bilgi gider. Sonu&amp;ccedil; olarak işlemler onaylanır &lt;strong&gt;(Commit)&lt;/strong&gt;. Elbetteki diğer makinelerdeki DTC' lerden gelecek tek bir iptal isteği, t&amp;uuml;m transaction' ın iptal edileceği ve işlemlerin geri alınması i&amp;ccedil;in root DTC' den, bağlı olan servislere bilgi g&amp;ouml;nderileceği anlamına da gelmektedir&lt;strong&gt;(Rollback)&lt;/strong&gt;. Burada dikkat edilmesi gereken noktalardan biriside, y&amp;ouml;netsel işlemleri &amp;uuml;stlenen Dağıtık Transaction Koordinasyon(DTC) servisinin, root makinede olmasıdır. Bir başka deyişle Servis Y&amp;ouml;nelimli Mimari (SOA) modelindeki t&amp;uuml;m DTC' lerin oylarını kontrol edip, kabul edilmeleri veya iptal işlemlerini ger&amp;ccedil;ekleştirebilecek tek bir DTC var olabilir.&lt;/p&gt;
&lt;p&gt;Windows Communication Foundation, transaction' lara otomatik olarak bir transaction y&amp;ouml;neticisi (transaction manager) atar. Varsayılan olarak tek başına &amp;ccedil;alışan ve farklı makineler yada s&amp;uuml;re&amp;ccedil;lerdeki(process) servislere transaction yayınlamayan sistemler s&amp;ouml;z konusu olduğunda otomatik olarak ilgili transaction' la &lt;strong&gt;LTM(LightWeight Transaction Manager)&lt;/strong&gt; ilişkilendirilir. Ancak servis tarafından başlatılan transaction' ın kendi uygulama alanı sınırları dışına &amp;ccedil;ıkması bir başka deyişle farklı makine veya s&amp;uuml;re&amp;ccedil;lere yayınlanması halinde transaction y&amp;ouml;neticisinin seviyesi otomatik olarak &lt;strong&gt;DTC(Distributed Transaction Coordinator)&lt;/strong&gt; servisine devredilir. KTM g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında &amp;ccedil;ok değişken kaynaklar (Volatile Resource) vardır. Yinede servis sınırları dışına &amp;ccedil;ıkılması halinde DTC' ye terfi edilme s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;Burada elbetteki kaynak y&amp;ouml;neticisinin&lt;strong&gt;(resource manager)&lt;/strong&gt; bahsedilen y&amp;ouml;neticilerden hangisine destek verdiğide &amp;ccedil;ok &amp;ouml;nemlidir. Kaynak y&amp;ouml;neticisi olarak SQL Server 2005, Oracle, MSMQ gibi pek &amp;ccedil;ok sistem g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. SQL Server 2005 veritabanı servisine ait kaynak y&amp;ouml;neticisinin şu an i&amp;ccedil;in &lt;strong&gt;KTM(Kernel Transaction Manager)&lt;/strong&gt; dışında LTM ve DTC' yi desteklediği bilinmektedir. Aslında DTC değişken olabilecek her t&amp;uuml;rde kaynak y&amp;ouml;neticisi tarafından desteklenmektedir.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalemizde teorik olarak Windows Communication Foundation ortamında transaction y&amp;ouml;netiminin temellerini incelemeye &amp;ccedil;alıştık. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi y&amp;ouml;netimin arka tarafında dikkate alınması gereken pek &amp;ccedil;ok etken bulunmaktadır. Dahasıda vardır. WCF ile ilgili bir sonraki makalemizde transaction y&amp;ouml;netimini &amp;ouml;rnekler ile incelemeye ve diğer temelleride g&amp;ouml;rmeye &amp;ccedil;alışacağız. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2007-06-19 09:00:00</pubDate>
  <slug>WCF-Transaction-Yonetimi-(Transaction-Management)-1-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>transaction-management</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>