<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ruby Kod Parçacıkları 28 - Multithreading ve Mutex Kullanımı</title>
  <description>Ruby Kod Parçacıkları serimizin bir önceki bölümünde çoklu iş parçacıklarının(Multithreading) nasıl yazılabileceğini incelemeye başlamıştık. Başrol oyuncumuz olan Thread sınıfının kullanımını gördük. Lakin birden fazla iş parçacığının ele alındığı senaryolarda dikkat edilmesi gereken önemli konulardan birisi de ortak veriler üzerinde işlemler yapıldığında ortaya çıkmaktadır. Eş zamanlı olarak çalışan iş parçacıkları bazı durumlarda verinin tutarlılığının bozulmasına neden olabilir. Nitekim n sayıda iş parçacığının farklı anlarda aynı veri üzerinde işlem yapması söz konusudur. Birbirlerinin işlerini kesebilirler.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Ruby Kod Par&amp;ccedil;acıkları serimizin bir &amp;ouml;nceki b&amp;ouml;l&amp;uuml;m&amp;uuml;nde &amp;ccedil;oklu iş par&amp;ccedil;acıklarının&lt;em&gt;(Multithreading)&lt;/em&gt; nasıl yazılabileceğini incelemeye başlamıştık. Başrol oyuncumuz olan Thread sınıfının kullanımını g&amp;ouml;rd&amp;uuml;k. Lakin birden fazla iş par&amp;ccedil;acığının ele alındığı&amp;nbsp;senaryolarda dikkat edilmesi gereken &amp;ouml;nemli konulardan birisi de ortak veriler &amp;uuml;zerinde işlemler yapıldığında ortaya &amp;ccedil;ıkmaktadır. Eş zamanlı olarak &amp;ccedil;alışan iş par&amp;ccedil;acıkları bazı durumlarda verinin tutarlılığının bozulmasına neden olabilir. Nitekim n sayıda iş par&amp;ccedil;acığının&amp;nbsp;farklı anlarda aynı veri &amp;uuml;zerinde işlem yapması s&amp;ouml;z konusudur. Birbirlerinin işlerini kesebilirler.&lt;/p&gt;
&lt;p&gt;Eğer ortak verinin tutarlılığı/kararlılığı &amp;ouml;nemli ise ilgili iş par&amp;ccedil;acıklarının senkronize edilmesi gereklidir. Bu pek &amp;ccedil;ok programlama dilinde benzer teknikler ile &amp;ccedil;&amp;ouml;z&amp;uuml;len&amp;nbsp;bir problemdir. Ruby tarafında Mutex sınıfını&amp;nbsp;kullanarak bu&amp;nbsp;sorunun kontroll&amp;uuml; bir şekilde ele alınması sağlanabilir. Mutex ile atomik olmayan metodların atomikleştirilmesi, memory barier konulması&amp;nbsp;vb işler yapılabilir. Kısacası thread-safe&amp;nbsp;denilen g&amp;uuml;venli paralelliği sağlayabiliriz.&lt;/p&gt;
&lt;p&gt;Tabii &amp;ouml;ncelikle meseleyi anlamamız gerekiyor. Ortak veri nasıl olur da&amp;nbsp;bozulabilir? İşe aşağıdaki basit kod par&amp;ccedil;ası ile başlayabiliriz.&lt;/p&gt;
&lt;h2&gt;Concurrency'nin Temel İlkesi Atomicity'nin Bozulması&lt;/h2&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require 'thread'

for i in 1..5 do
  points = [0, 0, 0, 0, 0]
  
  threads = 100.times.map do
    Thread.new do
      5000.times do
        points.map! { |i| i + 1 }
      end
    end
  end
  threads.each{|t|t.join}  
  puts points.to_s
end&lt;/pre&gt;
&lt;p&gt;Kodu dikkatli bir şekilde incelemeliyiz. Anlamlı bir iş yapmıyor ancak bize Concurrency konusunda &amp;ouml;nemli dersler veriyor. 5 sefer &amp;ccedil;alışan bir test s&amp;uuml;recimiz&amp;nbsp;s&amp;ouml;z konusu. Her seferinde 100 farklı iş par&amp;ccedil;acığı&amp;nbsp;a&amp;ccedil;ıyoruz&lt;em&gt;(Thread nesnesi &amp;ouml;rnekleyerek)&lt;/em&gt; Her bir iş par&amp;ccedil;acığı&amp;nbsp;i&amp;ccedil;inde 5000 kez yapılan bir işlem s&amp;ouml;z konusu. Bu işlem sırasında points isimli dizinin eleman değerleri arttırılıyor. Uygulama tamamlandığında&amp;nbsp;dizideki her bir elemanın&amp;nbsp;500000&amp;nbsp;olmasını bekleriz değil mi? Oysaki &amp;ccedil;alışma zamanı sonu&amp;ccedil;ları olduk&amp;ccedil;a farklıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/11/mutex_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; Eclipse IDE'sine aittir. Eclipse'e &lt;a title="Ruby Plugin for Eclipse" href="https://marketplace.eclipse.org/content/ruby-dltk" target="_blank"&gt;şu adresteki plug-in'i y&amp;uuml;kleyerek&lt;/a&gt;&amp;nbsp;Ruby i&amp;ccedil;in geliştirme yapabilirsiniz.&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere sadece bir sefer 500000 değeri tutturulabilmiş&lt;em&gt;(siz yapacağınız denemelerde daha fazla tutturabilir veya hi&amp;ccedil; tutturamayabilirsiniz de)&lt;/em&gt; ve kalan&amp;nbsp;diğer&amp;nbsp;denemelerde farklı sayılar elde edilmiştir. Buradaki sıkıntı points dizisi i&amp;ccedil;erisindeki elemanlara erişen iş par&amp;ccedil;acıkları&amp;nbsp;i&amp;ccedil;erisinde atomiklik ilkesini bozan map! metodunun kullanılmasıdır.&amp;nbsp;Bu durumu&amp;nbsp;biraz daha a&amp;ccedil;maya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alışan iş par&amp;ccedil;acıklarından&amp;nbsp;birisi points dizisindeki bir elemanı okumuş olsun. Okuma işlemi sonrası bunun değerini bir arttıracaktır. Lakin arttırma işlemi &amp;ouml;ncesi diğer bir iş par&amp;ccedil;acığının ilk iş par&amp;ccedil;acığının işleyişini kestiğini d&amp;uuml;ş&amp;uuml;nelim. Hatta bu ikinci iş par&amp;ccedil;acığı dizideki ilgili elemanı okuyup arttırmış ve başarılı bir şekilde kayıt etmiş olsun &lt;em&gt;(O değerle ilgilenen ilk iş par&amp;ccedil;acığı hen&amp;uuml;z işini bitirememişken)&lt;/em&gt; İşte problem.&lt;/p&gt;
&lt;p&gt;Bu y&amp;uuml;zden 500000 değerinden k&amp;uuml;&amp;ccedil;&amp;uuml;k ve birbirlerinde&amp;nbsp;farklı sayısal değerler elde ettik. Problem iş par&amp;ccedil;acıklarının birbirini karşılıklı kesmesi dışında Conccurency'nin temel gerekliliklerinden olan Atomicity ilkesini bozan&amp;nbsp;map! metodunun kullanılmasıdır. &amp;Ouml;yleyse sorunu &amp;ccedil;&amp;ouml;zelim&lt;em&gt;(Bu arada Conccurency denince &amp;uuml;&amp;ccedil; temel ilke s&amp;ouml;z konusu. Atomicity, Visibility-bir thread tarafından oluşturulan etkinin diğer thread'ler tarafından da g&amp;ouml;r&amp;uuml;lmesi ve Ordering. Visibility&amp;nbsp;ve Ordering konularını ilerleyen zamanlarda&amp;nbsp;ele almaya&amp;nbsp;&amp;ccedil;alışacağım)&lt;/em&gt;&lt;/p&gt;
&lt;h2&gt;map! Kullanımını Atomikleştirmek&lt;/h2&gt;
&lt;p&gt;Mutex sınıfını kullanarak map operasyonunu atomik hale getirebiliriz. Aslında yapacağımız şey bir iş par&amp;ccedil;acıklarını ilgili veri ile uğraşırken kitlemek ve diğer iş par&amp;ccedil;acıklarını bu iş sırasında bekletmekten ibaret. Kodu aşağıdaki gibi değiştirerek ilerleyelim.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require 'thread'

mtx=Mutex.new()

for i in 1..5 do
  points = [0, 0, 0, 0, 0]
  
  threads = 100.times.map do
    Thread.new do
      5000.times do
        mtx.synchronize(){
          points.map! { |i| i + 1 }
        }
      end
    end
  end
  threads.each{|t|t.join}  
  puts points.to_s
end&lt;/pre&gt;
&lt;p&gt;Yaptığımız ilk şey mtx isimli bir Mutex nesnesi &amp;ouml;rneklemek. Sonrasında atomikleştirmek istediğimiz kod par&amp;ccedil;asını synchronize metoduna ait kod bloğu i&amp;ccedil;erisine alıyoruz. Bu şekilde&amp;nbsp;map operasyonunu senkronize etmiş oluyoruz. Senkronizasyonu sağlayarak &amp;ccedil;alışmakta olan iş par&amp;ccedil;acıklarının aynı veri &amp;uuml;zerinde işlem yaparken&amp;nbsp;birbirlerini kesmemesi ve veri b&amp;uuml;t&amp;uuml;nl&amp;uuml;ğ&amp;uuml;n&amp;uuml;n&amp;nbsp;bozulmaması m&amp;uuml;mk&amp;uuml;n hale geliyor. İşte &amp;ccedil;alışma zamanı sonu&amp;ccedil;ları.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/11/mutex_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi t&amp;uuml;m denemelerde points dizisi elemanları beklediğimiz gibi aynı toplam değerini &amp;uuml;retmiştir. İş par&amp;ccedil;acıklarını senkronize olarak &amp;ccedil;alıştırmak bazı durumlarda işlemlerin daha yavaş tamamlanmasına da neden olabilir ancak verinin tutarlılığı olduk&amp;ccedil;a &amp;ouml;nemli bir konudur. B&amp;ouml;ylece geldik bir kod par&amp;ccedil;acığının daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-12-09 21:30:00</pubDate>
  <slug>ruby-kod-parcaciklari-28-multithreading-ve-mutex-kullanimi</slug>
  <tags>
    <tag>ruby-kod-parçacıkları</tag>
    <tag>rubyist</tag>
    <tag>ruby</tag>
    <tag>mutex</tag>
    <tag>multi-thread</tag>
    <tag>multithreading</tag>
    <tag>concurrency</tag>
    <tag>atomicity</tag>
    <tag>ordering</tag>
    <tag>visibility</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>