<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tek Fotoluk İpucu 155 - C# 7.0 Tuple İyileştirmeleri</title>
  <description>C# 7.0 tarafında geliştiricileri mutlu eden iyileştirmelerden birisi de Tuple tipi ile ilgili. Klasik olarak bir tip tanımı yapmamıza ihtiyaç duymadan özellikle metodlardan dönüş yaptığımız noktalarda faydalanabildiğimiz generic Tuple tipinin en büyük handikapı üye isimlendirmesiydi. Aşağıdaki kod parçasında bu durumu görebilirsiniz.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;C# 7.0 tarafında geliştiricileri mutlu eden iyileştirmelerden birisi de Tuple tipi ile ilgili. Klasik olarak bir tip tanımı yapmamıza ihtiya&amp;ccedil; duymadan &amp;ouml;zellikle metodlardan d&amp;ouml;n&amp;uuml;ş yaptığımız noktalarda faydalanabildiğimiz generic Tuple tipinin en b&amp;uuml;y&amp;uuml;k handikapı, &amp;uuml;ye isilmendirmeleri.&amp;nbsp;Aşağıdaki kod par&amp;ccedil;asında bu durumu a&amp;ccedil;ık bir şekilde&amp;nbsp;g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace Classics
{
    class Program
    {
        static void Main(string[] args)
        {
            var result = Calculate(8.2, 4.6);
            Console.WriteLine("{0},{1},{2},{3}",
                result.Item1,
                result.Item2,
                result.Item3,
                result.Item4
                );
        }

        static Tuple&amp;lt;double, double, double, double&amp;gt; Calculate(double x, double y)
        {
            return new Tuple&amp;lt;double, double, double, double&amp;gt;(
                x+y,
                x-y,
                x*y,
                x/y
                );
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Calculate isimli kobay metodumuz x ve y değişkenleri i&amp;ccedil;in 4 işlem yapıp sonu&amp;ccedil;ları bir Tuple tipi ile geri d&amp;ouml;nd&amp;uuml;rmekte. Hoşa gitmeyen nokta bu alanlara Item1,Item2,Item3 ve Item4 gibi isimlerle erişiyor olmamız. Normalde bir sınıf yazdığımızda &amp;ouml;zellik adları ile i&amp;ccedil;eriğine erişmek isteriz. &amp;Uuml;stelik bu kullanımda&amp;nbsp;geliştirici dostu pek &amp;ccedil;ok dildeki yazım stilinden uzak bir tanımlama şekli s&amp;ouml;z konusu&lt;em&gt;(Biraz Ruby, biraz Python, az biraz Go yazınca g&amp;ouml;ze hoş gelen pratik sytnax'lara alışıyor insan)&lt;/em&gt; Peki C# 7.0 tarafında Tuple tipi i&amp;ccedil;in ne gibi yenilikler s&amp;ouml;z konusu. Aşağıdaki fotoğrafta bir kısmını g&amp;ouml;rebilirsiniz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/03/tfi155_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İlk g&amp;ouml;ze &amp;ccedil;arpan muhtemelen Tuple diye bir anahtar kelime kullanmıyor oluşumuzdur. codes'a string t&amp;uuml;rde iki değeri olan bir tuple atamaktayız. Alan adlarını belirtmediğimizden ilgili değerlere codes .Item1 ve codes.Item2 şeklinde erişebiliriz. cCodes'un tanımlanmasında ise xCode ve yCode isimli alanları i&amp;ccedil;eren bir Tuple tipi s&amp;ouml;z konusudur. Dilersek ItemN adlarını eşitliğin sağ tarafında değişken değerleri verirken de belirtebiliriz. mCodes değişkeni i&amp;ccedil;in&amp;nbsp;bu tip bir kullanım ger&amp;ccedil;ekleştirilmektedir. Calculate metodu sum,dif,mul ve div isimli alan adlarını i&amp;ccedil;eren bir Tuple d&amp;ouml;nd&amp;uuml;rmektedir. Dikkat edilmesi gereken nokta Calculate metodunun&amp;nbsp;Tuple &amp;ouml;rneğini nasıl d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml;d&amp;uuml;r. result değişkenine atanan nesne &amp;ouml;rneği &amp;uuml;zerinden sum,dif,mul ve div isimli &amp;ouml;ğelere de erişilmiştir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;C# 7.0 da Tuple ile ismi anılan bir diğer kavram da Deconstruct metodudur. Bu yetenek sayesinde bir nesne &amp;ouml;rneğinin doğrudan bir Tuple tipine atanıp kullanılabilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Aşağıdaki fotoğrafı inceleyelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/03/tfi155_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Product sınıfında Deconstruct isimli bir metod tanımlanmıştır.&amp;nbsp;Metodda out ile belirtilen parametrelere sınıfın ProductId ve Title &amp;ouml;zelliklerinin değerleri atanmıştır. Main metodunda box isimli değişken de bu parametre yapısına uygun bir Tuple'a atanmıştır. Yani bir sınıf &amp;ouml;rneğinin Tuple t&amp;uuml;r&amp;uuml;ne nasıl atanabileceğini belirtebiliriz.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir ipucumuzun daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-04-09 21:42:00</pubDate>
  <slug>tek-fotoluk-ipucu-155-c-7-0-tuple-iyilestirmeleri</slug>
  <tags>
    <tag>c#-70</tag>
    <tag>tuple</tag>
    <tag>tuple&lt;&gt;</tag>
    <tag>deconstruction</tag>
  </tags>
  <categories>
    <category>C# 7.0</category>
  </categories>
</post>