<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF Data Services– Annotations Builder</title>
  <description>Gün geçmiyor ki Microsoft ürünlerinde yeni bir sürüm, yeni bir güncelleme görmeyelim Gülümseme Şurada daha iki gün oldu Entity Framework 4.2 RC ile ilişkili bir şeyler yazmaya çalışmıştım. Bu gün de ne duyduk dersiniz? WCF Data Services October 2011 CTP yayınlanmış Gülümseme Biraz sitemkar bir giriş oldu ama boşverin…</description>
  <content>&lt;p&gt;&lt;a href="/pics/Huzun.jpg"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; float: right; padding-top: 0px; border: 0px;" title="Huzun" src="/pics/Huzun_thumb.jpg" alt="Huzun" width="240" height="161" align="right" border="0" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Yağmurlu bu sonbahar g&amp;uuml;nlerinde eminim ki kimse h&amp;uuml;z&amp;uuml;nlenmek, kara kara d&amp;uuml;ş&amp;uuml;nmek istemez. Ama bazen o kadar garip sorunlar ile karşı karşıya kalırız ki&amp;hellip;Ne yapacağımızı bilemeyiz ve kara kara d&amp;uuml;ş&amp;uuml;n&amp;uuml;r&amp;uuml;z. Mesela ben bu girişi yazdığım sırada, aslında tamamlamış olduğum makalenin sonucunda bir yere varamamış ve beklentilerimi karşılayamamış birisi modundayım. Neden mi? Gelin anlatayım.&lt;/p&gt;
&lt;p&gt;G&amp;uuml;n ge&amp;ccedil;miyor ki &lt;strong&gt;Microsoft&lt;/strong&gt; &amp;uuml;r&amp;uuml;nlerinde yeni bir s&amp;uuml;r&amp;uuml;m, yeni bir g&amp;uuml;ncelleme g&amp;ouml;rmeyelim &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_18.png" alt="G&amp;uuml;l&amp;uuml;mseme" /&gt; Şurada daha iki g&amp;uuml;n oldu&lt;strong&gt; Entity Framework 4.2 RC&lt;/strong&gt; ile ilişkili bir şeyler yazmaya &amp;ccedil;alışmıştım. Bu g&amp;uuml;n de ne duyduk dersiniz? &lt;a href="http://www.microsoft.com/download/en/details.aspx?id=27728"&gt;WCF Data Services October 2011 CTP&lt;/a&gt; yayınlanmış &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_18.png" alt="G&amp;uuml;l&amp;uuml;mseme" /&gt; Biraz sitemkar bir giriş oldu ama boşverin&amp;hellip;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak hemen arkasında s&amp;ouml;z konusu yeni &lt;strong&gt;CTP&lt;/strong&gt; ile ilişkili ilk blog girişleri de &lt;strong&gt;Team Blog&lt;/strong&gt; &amp;uuml;zerinden yayınlanmaya başladı. Ben de bunun &amp;uuml;zerine gelen yeniliklerden birisi olan &lt;strong&gt;Vocabularies&lt;/strong&gt; kavramını &amp;ouml;zellikle getirildiği Annotations yapısı ile birlikte incelemeye ve anlamaya &amp;ccedil;alıştım. Dilerseniz yine t&amp;uuml;mden gelimden hareket edelim ve &amp;ouml;nce senaryomuzu geliştirip sonunda elde ettiğimiz&lt;em&gt;(ve hatta elde edemediğimiz)&lt;/em&gt; bulguları değerlendirelim. &lt;em&gt;(Bundan sonraki kısımda daha &amp;ouml;nceden &lt;strong&gt;WCF Data Service&lt;/strong&gt; ile geliştirme yaptığınızı ve biraz aşina olduğunuzu varsayarak ilerleyeceğim)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Tabi ilk olarak &lt;a href="http://www.microsoft.com/download/en/details.aspx?id=27728"&gt;WCF Data Services October 2011 CTP&lt;/a&gt; adresinden son s&amp;uuml;r&amp;uuml;m&amp;uuml; indirmeniz gerekiyor. Bunu yaptığımız takdirde &lt;strong&gt;Visual Studio 2010&lt;/strong&gt; ortamına aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan yeni bir proje &amp;ouml;ğesinin eklendiğini g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/bei_25.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="bei_25" src="/pics/bei_25_thumb.gif" alt="bei_25" width="472" height="109" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bildiğiniz &amp;uuml;zere &lt;strong&gt;WCF Data Service&amp;rsquo;&lt;/strong&gt; ler veri odaklı &amp;ccedil;alışan, &lt;strong&gt;HTTP&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml;n &lt;strong&gt;GET,POST,PUT,DELETE&lt;/strong&gt; metodlarına cevap verebilen ve g&amp;uuml;n&amp;uuml;m&amp;uuml;zde &lt;strong&gt;OData&lt;/strong&gt; formatına da destek sağlayan &amp;ouml;zelleştirilmiş &lt;strong&gt;WCF(Windows Communication Foundation)&lt;/strong&gt; Servisleridir. &lt;strong&gt;Data Centric&lt;/strong&gt; &amp;ouml;zellikleri nedeniyle de genellikle &lt;strong&gt;Ado.Net Entity Framework&lt;/strong&gt; tabanlı ORM modelleri &amp;uuml;zerinden sunulmaktadırlar. Bu nedenle &amp;ouml;rnek uygulamamızda &amp;ccedil;ok basit olarak &lt;strong&gt;AdventureWorks&lt;/strong&gt; veritabanındaki &lt;strong&gt;Product&lt;/strong&gt; tablosunu modelleyen bir &lt;strong&gt;Entity Data Model&lt;/strong&gt; olduğunu d&amp;uuml;ş&amp;uuml;nerek ilerleyeceğiz. S&amp;ouml;z konusu ekleme işlemi sonrasında Web uygulamamıza dahil edeceğimiz &lt;strong&gt;WCF DataService OCT 2011 CTP&lt;/strong&gt; &amp;ouml;ğesinin kod i&amp;ccedil;eriğini de aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic; 
using System.Data.Services; 
using System.Data.Services.Common; 
using System.Xml; 
using Microsoft.Data.Edm; 
using Microsoft.Data.Edm.Csdl; 
using Microsoft.Data.Edm.Validation;

namespace AdventureWorksDataServices 
{ 
    public class ProductDataService 
: DataService&amp;lt;AdventureWorksEntities&amp;gt; 
    { 
        public static void InitializeService(DataServiceConfiguration config) 
        { 
            config.SetEntitySetAccessRule("Products", EntitySetRights.All); 
            config.DataServiceBehavior.MaxProtocolVersion = DataServiceProtocolVersion.V3;

            config.AnnotationsBuilder = (model) =&amp;gt; 
                { 
                    IEdmModel edmModel; 
                    IEnumerable&amp;lt;EdmError&amp;gt; errors;

                    XmlReader[] readers =new XmlReader[] { 
                        XmlReader.Create("f:\\ProductsAnnotations.xml") 
                    };


                    bool parsed = CsdlReader.TryParse(readers, out edmModel, out errors, model); 
                    return parsed ? new IEdmModel[] { edmModel } : null; 
                }; 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Piuvvvv &lt;img class="wlEmoticon wlEmoticon-confusedsmile" style="border-style: none;" src="/pics/wlEmoticon-confusedsmile_9.png" alt="Kafası karışmış g&amp;uuml;l&amp;uuml;mseme" /&gt; Burada neler oldu b&amp;ouml;yle? Daha &amp;ouml;nceden yaptığımız &lt;strong&gt;Ado.Net Data Service&lt;/strong&gt; geliştirmelerine hi&amp;ccedil; ama hi&amp;ccedil; benzemiyor gibi. Daha &amp;ouml;nceden sadece ilgili &lt;strong&gt;Entity&lt;/strong&gt; tiplerini belirli erişim kuralları &amp;ccedil;er&amp;ccedil;evesinde&lt;em&gt;(&amp;Ouml;rneğin sadece okuma ama&amp;ccedil;ı a&amp;ccedil;ılsınlar) &lt;/em&gt;dış d&amp;uuml;nyaya a&amp;ccedil;an bir &lt;strong&gt;InitializeService&lt;/strong&gt; metodu bulunurdu aslında &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_69.png" alt="G&amp;ouml;z kırpan g&amp;uuml;l&amp;uuml;mseme" /&gt; Aslında olayı kısaca a&amp;ccedil;ıklayayım.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;DataServiceConfiguration&lt;/strong&gt; tipine eklenen yeni &lt;strong&gt;AnnotationsBuilder&lt;/strong&gt; &amp;ouml;zelliği aslında&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;public Func&amp;lt;Microsoft.Data.Edm.IEdmModel, IEnumerable&amp;lt;Microsoft.Data.Edm.IEdmModel&amp;gt;&amp;gt;&lt;/strong&gt; &lt;strong&gt;AnnotationsBuilder&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;ile işaret edilen bir metodu g&amp;ouml;stermektedir. Bu metod i&amp;ccedil;erisinde biz, &lt;strong&gt;Entity Data Model&amp;rsquo;&lt;/strong&gt; in &lt;strong&gt;CSDL(Conceptual Schema Definition Language)&lt;/strong&gt; i&amp;ccedil;eriğine m&amp;uuml;dahale ederek &amp;ouml;rnek bazı değişikliklerde bulunuyoruz. Bu değişiklikler koda g&amp;ouml;re XmlReader yardımıyla okunan &lt;strong&gt;ProductsAnnotations.xml&lt;/strong&gt; isimli dosyada yer almaktadır. Dikkat edecek olursak eğer &lt;strong&gt;CsdlReader&lt;/strong&gt; tipinin &lt;strong&gt;TryParse&lt;/strong&gt; metodu bir den fazla &lt;strong&gt;XmlReader&lt;/strong&gt; referansı alabilmektedir. Bir başka deyişle bir &lt;strong&gt;CSDL&lt;/strong&gt; i&amp;ccedil;eriğine &lt;strong&gt;n adet Annotation&lt;/strong&gt; kuralının enjekte edilmesi de m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. &amp;Ouml;rneğimizde kullandığımız dosya i&amp;ccedil;eriği ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Schema Namespace="AdventureWorksModel" Alias="AdventureWorksModel" xmlns="http://schemas.microsoft.com/ado/2009/11/edm"&amp;gt; 
  &amp;lt;Using NamespaceUri="http://vocabularies.odata.org/Validation" Alias="Validation"/&amp;gt; 
  &amp;lt;Annotations Target="AdventureWorksModel.Product.ListPrice"&amp;gt; 
    &amp;lt;TypeAnnotation Term="Validation.Range"&amp;gt; 
      &amp;lt;PropertyValue Property="Min" Decimal="0" /&amp;gt; 
      &amp;lt;PropertyValue Property="Max" Decimal="5000" /&amp;gt; 
    &amp;lt;/TypeAnnotation&amp;gt; 
  &amp;lt;/Annotations&amp;gt; 
&amp;lt;/Schema&amp;gt;&lt;/pre&gt;
&lt;p&gt;Burada son &lt;strong&gt;CTP&lt;/strong&gt; ile gelen &amp;ouml;nemli bir nokta &lt;strong&gt;Using&lt;/strong&gt; elementi ve i&amp;ccedil;erisindeki &lt;strong&gt;NamespaceUri&lt;/strong&gt; niteliğinin değeridir. Bu detaylar bir kenara dursun aslında bu dosyanın ne s&amp;ouml;ylediğini anlamak şu anda bizim i&amp;ccedil;in &amp;ccedil;ok daha &amp;ouml;nemlidir &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_69.png" alt="G&amp;ouml;z kırpan g&amp;uuml;l&amp;uuml;mseme" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Annotations&lt;/strong&gt; elementine ait &lt;strong&gt;Target&lt;/strong&gt; niteliğinde bir tanımlama yapılmıştır. Buna g&amp;ouml;re &lt;strong&gt;AdventureWorksModel&lt;/strong&gt; şemasında yer alan &lt;strong&gt;Product Entity tipinin&lt;/strong&gt; &lt;strong&gt;ListPrice&lt;/strong&gt; &amp;ouml;zelliği i&amp;ccedil;in &lt;strong&gt;Validation.Range&lt;/strong&gt; formatında bir &lt;strong&gt;TypeAnnotation&lt;/strong&gt; bildirimi yapılmaktadır. Bir başka deyişle &lt;strong&gt;ListPrice&lt;/strong&gt; &amp;ouml;zelliği i&amp;ccedil;in &amp;ccedil;alışma zamanında &amp;uuml;retilen &lt;strong&gt;metadata&lt;/strong&gt; i&amp;ccedil;eriğine enjekte edilecek bir doğrulama kalıbı sunulmaktadır.&lt;/p&gt;
&lt;p&gt;Bu kalıba g&amp;ouml;re &lt;strong&gt;ListPrice&lt;/strong&gt; &amp;ouml;zelliğinin &lt;strong&gt;Decimal&lt;/strong&gt; veri tipinden olan &lt;strong&gt;minimum&lt;/strong&gt; ve &lt;strong&gt;maximum&lt;/strong&gt; alan değerleri belirtilmektedir. Senaryomuza g&amp;ouml;re &lt;strong&gt;ListPrice&lt;/strong&gt; &amp;ouml;zelliği&lt;strong&gt; 0 ile 5000 birim arasında&lt;/strong&gt; olmalıdır. İşte kod tarafında kullanılan &lt;strong&gt;TryParse&lt;/strong&gt; metodu eğer &lt;strong&gt;XML&lt;/strong&gt; dosyasını okuyabilme işlemi başarılı olursa, ilgili validasyonu &amp;ccedil;alışma zamanındaki metadata i&amp;ccedil;eriğine dahil edecektir. Eğer&lt;strong&gt; Data Service&lt;/strong&gt; &amp;ouml;rneği herhangibir tarayıcıda a&amp;ccedil;ılır ve &lt;strong&gt;metadata&lt;/strong&gt; i&amp;ccedil;eriğine ulaşılırsa aşağıdaki &amp;ccedil;ıktı ile karşılaşıldığı g&amp;ouml;r&amp;uuml;lecektir. &lt;em&gt;(Benim &amp;ouml;rneğimde s&amp;ouml;z konusu Data Service adresi &lt;/em&gt;&lt;a title="http://localhost:4860/ProductDataService.svc/$metadata" href="http://localhost:4860/ProductDataService.svc/$metadata"&gt;&lt;em&gt;http://localhost:4860/ProductDataService.svc/$metadata&lt;/em&gt;&lt;/a&gt;&lt;em&gt; şeklindedir)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/bei_27.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="bei_27" src="/pics/bei_27_thumb.gif" alt="bei_27" width="572" height="564" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_18.png" alt="G&amp;uuml;l&amp;uuml;mseme" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bakın burası &amp;ccedil;ok &amp;ouml;nemli. Bir &lt;strong&gt;WCF Data Service&amp;rsquo;&lt;/strong&gt; in &amp;ccedil;alışma zamanındaki &lt;strong&gt;metadata&lt;/strong&gt; &amp;ccedil;ıktısına bir doğrulama kuralı enjekte edilmektedir.&lt;em&gt; (Bu tip bir &amp;ccedil;alışma zamanı alt yapısını sıfırdan nasıl yazabileceğinizi, hangi tasarım kalıplarına veya yazılım prensiplerine ihtiyacınız olacağını bir d&amp;uuml;ş&amp;uuml;n&amp;uuml;n &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_69.png" alt="G&amp;ouml;z kırpan g&amp;uuml;l&amp;uuml;mseme" /&gt; )&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Peki ama bu ne işimize yarayacak? Bunun i&amp;ccedil;in &amp;ouml;ncelikli olarak basit bir Client uygulaması geliştirmeyi d&amp;uuml;ş&amp;uuml;nebiliriz. &lt;strong&gt;Console Application&lt;/strong&gt; şeklinde tasarlayabileceğimiz bu uygulama &amp;ccedil;ok basit olarak ilgili &lt;strong&gt;WCF Data Service&amp;rsquo;&lt;/strong&gt; i referans etmelidir. Sonrasında test amacıyla herhangibir &lt;strong&gt;Product&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt;ListPrice&lt;/strong&gt; &amp;ouml;zelliğinin değeri &lt;strong&gt;0-5000&lt;/strong&gt; aralığı dışında &lt;strong&gt;set&lt;/strong&gt; edilerek nasıl bir sonu&amp;ccedil; elde edildiğine bakılabilir. Ben bu ama&amp;ccedil;la istemci tarafına ilgili servis referansını eklemeye &amp;ccedil;alışarak işe başladım. İşe başladım diyorum &amp;ccedil;&amp;uuml;nk&amp;uuml; &lt;strong&gt;Visual Studio 2010&amp;rsquo;&lt;/strong&gt; a ait &lt;strong&gt;Add Service Reference&lt;/strong&gt; ekleme aracı bir &lt;strong&gt;Namespace&lt;/strong&gt;&amp;rsquo; i bulamadığı i&amp;ccedil;in s&amp;ouml;z konusu &lt;strong&gt;proxy&lt;/strong&gt; tipini &amp;uuml;retmeyi başaramadı &lt;img class="wlEmoticon wlEmoticon-sadsmile" style="border-style: none;" src="/pics/wlEmoticon-sadsmile_7.png" alt="&amp;Uuml;zg&amp;uuml;n g&amp;uuml;l&amp;uuml;mseme" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/bei_28.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="bei_28" src="/pics/bei_28_thumb.gif" alt="bei_28" width="496" height="184" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Ben de bunun &amp;uuml;st&amp;uuml;ne s&amp;ouml;z konusu servis referansını komut satırından &lt;strong&gt;DataSvcUtil&lt;/strong&gt; aracı ile &amp;uuml;retmeyi denedim. İşte sonu&amp;ccedil; &lt;img class="wlEmoticon wlEmoticon-sadsmile" style="border-style: none;" src="/pics/wlEmoticon-sadsmile_7.png" alt="&amp;Uuml;zg&amp;uuml;n g&amp;uuml;l&amp;uuml;mseme" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/bei_29.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="bei_29" src="/pics/bei_29_thumb.gif" alt="bei_29" width="640" height="176" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Hal b&amp;ouml;yle olunca tabi heyecanlı bir şekilde makaleyi yazmaya &amp;ccedil;alışan bir yazılım sevdalısının nasıl da h&amp;uuml;srana uğradığını zannediyorum ki anlayabilirsiniz &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_18.png" alt="G&amp;uuml;l&amp;uuml;mseme" /&gt; Eğer &lt;strong&gt;Proxy&lt;/strong&gt; &amp;uuml;retimi başarılı bir şekilde ger&amp;ccedil;ekleşseydi bu durumda aşağıdaki il&amp;uuml;sturasyon da yer alan bir kod par&amp;ccedil;asını denemeye tabi tutacaktık.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Linq; 
using ConsoleApp.AdventureWorks;

namespace ClientApp 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            AdventureWorksEntities works = new AdventureWorksEntities(new Uri("http://localhost:4860/ProductDataService.svc"));

            var product = (from p in works.Products 
                           where p.ProductID == 1 
                           select p).FirstOrDefault(); 
            if (product != null) 
            { 
                product.ListPrice = 5001M; 
            } 
            works.UpdateObject(product);

            var response = works.SaveChanges(); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;ve &amp;ouml;zellikle &amp;ouml;rnek bir &lt;strong&gt;Product&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt;ListPrice&lt;/strong&gt; &amp;ouml;zelliğinin değerini, &lt;strong&gt;Annotations&amp;rsquo;&lt;/strong&gt; da belirttiğimiz aralığın dışına &amp;ccedil;ıkartmaya &amp;ccedil;alışacak ve &lt;strong&gt;SaveChanges&lt;/strong&gt; &amp;ccedil;ağrısı sonucu servis tarafından gelen &lt;strong&gt;Response&amp;rsquo;&lt;/strong&gt; a bakacaktık. Bu noktada tahmin edeceğiniz &amp;uuml;zere beklentimiz validasyon ihlali nedeniyle &lt;strong&gt;Update&lt;/strong&gt; işleminin yapılmaması ve buna uygun bir Response kodunun istemci tarafında d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi olacaktı. En azından benim beklentim bu y&amp;ouml;ndeydi.&lt;/p&gt;
&lt;p&gt;Yine de buraya kadar yazdıklarımız ile aslında &lt;strong&gt;WCF Data Service&lt;/strong&gt; tarafındaki &lt;strong&gt;Annotations&lt;/strong&gt; bildirimlerinin, yeni &lt;strong&gt;CTP&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml; ile gelen &lt;strong&gt;Vocabularies&lt;/strong&gt; &lt;strong&gt;namespace&amp;rsquo;&lt;/strong&gt; i ile ilişkilendirildiğini d&amp;uuml;ş&amp;uuml;nebiliriz. Ama&amp;ccedil; ise &lt;strong&gt;Entity, Property, Navigation Property&lt;/strong&gt; gibi bazı yapılarda doğrulama kurallarını uygulatabilmektir. Bu konu ile ilişkili olarak ben de &lt;a href="http://blogs.msdn.com/b/astoriateam/archive/2011/10/13/vocabularies-in-wcf-data-services.aspx"&gt;şu&amp;nbsp;adresteki&lt;/a&gt;&amp;nbsp;girdiye ait yorumları takip etmeye &amp;ccedil;alışıyor olacağım. Malum istemci tarafı i&amp;ccedil;in gerekli bir testi ger&amp;ccedil;ekleştiremedik/ger&amp;ccedil;ekleştiremedim. Dolayısıyla şimdilik yazımızı sonlandırmak durumundayız. Buruk bir son oldu ama ne yapalım.&lt;img class="wlEmoticon wlEmoticon-sadsmile" style="border-style: none;" src="/pics/wlEmoticon-sadsmile_7.png" alt="&amp;Uuml;zg&amp;uuml;n g&amp;uuml;l&amp;uuml;mseme" /&gt; Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2011-10-14 14:00:00</pubDate>
  <slug>WCF-Data-Servicese28093-Annotations-Builder</slug>
  <tags>
    <tag>wcf-data-services</tag>
    <tag>astoria</tag>
    <tag>wcf</tag>
    <tag>annotations</tag>
    <tag>wcf-data-services-october-2011-ctp</tag>
  </tags>
  <categories>
    <category>WCF Data Services</category>
  </categories>
</post>