<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Oyun Programlamaya Giriş (Çarpışma Teknikleri - 3)</title>
  <description>Geçtiğimiz hafta boyunca, Oyun Programcılığı ile ilgili olaraktan aldığım kitapları fırsat buldukça okumaya ve çalışmaya devam ettim. Konular o kadar heyecanlı ve sürükleyici ki araştırmak için zaman kavramı anlmasız hale geliyor. Öyleki, dün gece sabaha karşı saat 03:00 sularında kağıt kalem ile boğuşuyor ve Çarpışma Tekniklerinden birisinin daha matematiksel modelinin C# ile nasıl uygulanabileceğini araştırıyordum. Sonuç olarak işe bir kaç saatlik uykuyla gitmek zorunda kaldım. Ancak buna rağmen tüm gün dinçtim. Çünkü, çarpışma tekniklerinden birisini daha öğrenmiştim. Sıra anlatmaya gelmişti. İşte bugünkü makalemizde 3ncü çarpışma tekniğini incelemeye çalışacağız.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;tiğimiz hafta boyunca, Oyun Programcılığı ile ilgili olaraktan aldığım kitapları fırsat bulduk&amp;ccedil;a okumaya ve &amp;ccedil;alışmaya devam ettim. Konular o kadar heyecanlı ve s&amp;uuml;r&amp;uuml;kleyici ki araştırmak i&amp;ccedil;in zaman kavramı anlmasız hale geliyor. &amp;Ouml;yleki, d&amp;uuml;n gece sabaha karşı saat 03:00 sularında kağıt kalem ile boğuşuyor ve &amp;Ccedil;arpışma Tekniklerinden birisinin daha matematiksel modelinin C# ile nasıl uygulanabileceğini araştırıyordum. Sonu&amp;ccedil; olarak işe bir ka&amp;ccedil; saatlik uykuyla gitmek zorunda kaldım. Ancak buna rağmen t&amp;uuml;m g&amp;uuml;n din&amp;ccedil;tim. &amp;Ccedil;&amp;uuml;nk&amp;uuml;, &amp;ccedil;arpışma tekniklerinden birisini daha &amp;ouml;ğrenmiştim. Sıra anlatmaya gelmişti. İşte bug&amp;uuml;nk&amp;uuml; makalemizde 3nc&amp;uuml; &amp;ccedil;arpışma tekniğini incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;Oyun programcılığında &amp;ouml;nemli bir yere sahip olan &amp;ccedil;arpışma tekniklerinde, bu makaleye gelinceye kadar iki ana konuyu inceleme fırsatı bulduk. İlk olarak iki d&amp;ouml;rtgensel nesnenin bir birleriyle olan &amp;ccedil;arpışmalarını inceledik. Daha sonraki makalemizde ise, eski dostumuz Pisagor' u anıp, iki dairesel nesnenin birbirleriyle olan &amp;ccedil;arpışmalarını araştırdık. Sırada bu iki durumun kombinasyonu var. Yani, bir d&amp;ouml;rtgen ile dairesel bir nesnenin birbirleriyle olan &amp;ccedil;arpışmalarının tespit edilmesi. Bu teknikte yine Pisagor teroeminden yararlanacağız. Ancak dikkat etmemiz gereken &amp;ouml;nemli koordinat noktaları var. Bu durumu daha iyi analiz etmek i&amp;ccedil;in aşağıdaki şekli g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk108_1.gif" alt="" width="500" height="480" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. D&amp;ouml;rt B&amp;ouml;lge.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu teoride, d&amp;ouml;rtgenin dairesel nesneye g&amp;ouml;re olan konumlarını ele almamız gerekiyor. Bu da bizim, d&amp;ouml;rtgen nesnesine ait olan maksimum ve minimum sınır noktalarını bilmemiz gerektiğini g&amp;ouml;stermektedir. Buna g&amp;ouml;re, d&amp;ouml;rtgensel nesnenin k&amp;ouml;şe noktalarının x ve y koordinatları ele alınır. Kısaca, oluşturacağımız pisagor &amp;uuml;&amp;ccedil;geni i&amp;ccedil;in bu maksimum ve minimum x, y koordinatlarını bilmemiz gerekiyor. &amp;Ccedil;arpışma teoremine gelince;&lt;/p&gt;
&lt;table id="table1" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;D&amp;ouml;rtgenin dairesel nesneye en yakın olan k&amp;ouml;şe noktalarından yola &amp;ccedil;ıkılarak oluşturulan dik &amp;uuml;&amp;ccedil;gene ait hipoten&amp;uuml;s değeri, dairesel nesnenin yarı&amp;ccedil;apından k&amp;uuml;&amp;ccedil;&amp;uuml;k ise &amp;ccedil;arpışma vardır.&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Şimdi buradaki d&amp;ouml;rt b&amp;ouml;lgeyi kısaca inceleyelim. &amp;Ouml;rnek olarak 4&amp;uuml;nc&amp;uuml; b&amp;ouml;lgeyi aşağıdaki şekilde olduğu gibi ele alabiliriz. Esasen t&amp;uuml;m b&amp;ouml;lgelerde, d&amp;ouml;rtgensel nesneye ait minX,maxX,minY ve maxY koordinatları b&amp;uuml;y&amp;uuml;k &amp;ouml;neme sahiptir. &amp;Ouml;rneğin PRO &amp;uuml;&amp;ccedil;genini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda, kenarların uzunluklarını bulabilmek i&amp;ccedil;in R noktasının koordinatlarından yararlanılmaktadır. R noktasına dikkat edecek olursanız, d&amp;ouml;rtgenin en uzak X ve en uzak Y değerlerine sahip olduğunu g&amp;ouml;r&amp;uuml;rs&amp;uuml;n&amp;uuml;z. Dolayısıyla biz, PO uzaklığını bulmak istiyorsak, Ox değerinden RmaxX değerini &amp;ccedil;ıkartmamız gerekecektir. Aynı durum RP kenarının boyunu bulurken de ge&amp;ccedil;erlidir. Bu durumda, Oy değerinden RmaxY değerini &amp;ccedil;ıkartırız. Burada d&amp;ouml;rtgenin d&amp;ouml;rd&amp;uuml;nc&amp;uuml; b&amp;ouml;lgeye d&amp;uuml;şt&amp;uuml;ğ&amp;uuml;n&amp;uuml; anlamak i&amp;ccedil;in dairenin x,y koordinatları ile R noktasının koordinatları karşılaştırılır. Burada dikkat etmemiz gereken husus, R noktasının koordiantlarını&amp;nbsp; d&amp;ouml;rtenin daireye olan konumuna g&amp;ouml;re değişeceğidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk108_2.gif" alt="" width="500" height="500" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. D&amp;ouml;rd&amp;uuml;nc&amp;uuml; b&amp;ouml;lge i&amp;ccedil;in durum.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu anlattıklarım size biraz karmaşık geldiyse sıkı durun. Diğer b&amp;ouml;lgelerin grafiksel ifadeleride aşağıda yer almaktadır. Dikkat edecek olursanız, R noktasının koordinatları her b&amp;ouml;lge i&amp;ccedil;in farklıdır. Buda &amp;uuml;&amp;ccedil;gene ait dik kenarlar hesaplanırken uygun R noktası koordinatlarını kullanmamız gerektiğini, başka bir deyişle programlama algoritmasınıda, s&amp;ouml;z konusu&amp;nbsp; b&amp;ouml;lgeleri if koşulları ile tespit ederek geliştirmemiz gerektiğini g&amp;ouml;sterir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk108_3.gif" alt="" width="500" height="500" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. &amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; b&amp;ouml;lge i&amp;ccedil;in durum.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk108_4.gif" alt="" width="500" height="500" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. Birinci b&amp;ouml;lge i&amp;ccedil;in durum.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk108_5.gif" alt="" width="500" height="500" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 5. İkinci b&amp;ouml;lge i&amp;ccedil;in durum.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdi sıra geldi bu teoremi C# kodları ile ger&amp;ccedil;ekleştirmeye. Bu ama&amp;ccedil;la aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne sahip basit bir windows uygulaması geliştirdim. Her zamanki gibi işlemleri kolaylaştırmak amacıyla, dairesel nesneyi sabit tutup, d&amp;ouml;rtgensel nesneyi A,S,D,W tuşları ile hareket ettiriyorum. Bizim i&amp;ccedil;in &amp;ouml;nemli olan kısımlar, 4 durumdada ge&amp;ccedil;erli olan &amp;uuml;&amp;ccedil;gene ait dik kenarların FarkX ve FarkY şeklinde hesap edilmeleri ve buradan yola &amp;ccedil;ıkılarak hipoten&amp;uuml;s değerlerinin bulunması. Son olarak bu hipoten&amp;uuml;s değerini, dairenin yarı&amp;ccedil;apı ile karşılaştırıp &amp;ccedil;arpışma olup olmadığını inceliyoruz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk108_6.gif" alt="" width="398" height="343" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 6. Uygulama formu.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdi gelelim uygulama kodlarımıza.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;/*global degiskenlerimizi tanimliyoruz. */
float Daire_X,Daire_Y,Dortgen_X,Dortgen_Y,Daire_R;
float Dortgen_MinX,Dortgen_MaxX,Dortgen_MinY,Dortgen_MaxY;
double Hipotenus,FarkX,FarkY;


/*Daire i&amp;ccedil;in X,Y koordinatlar, yarı&amp;ccedil;ap D&amp;ouml;rtgen i&amp;ccedil;in ise X,Y, minimum ve maksimum X,Y koordinatları hesaplanıyor.*/
private void Hesapla()
{
    Daire_R=Daire.Width/2;
    Daire_X=Daire.Left+Daire_R;
    Daire_Y=Daire.Top+Daire_R;

    Dortgen_X=Dortgen.Left+Dortgen.Width/2;
    Dortgen_Y=Dortgen.Top+Dortgen.Height/2;
    Dortgen_MinX=Dortgen.Left;
    Dortgen_MaxX=Dortgen.Left+Dortgen.Width;
    Dortgen_MinY=Dortgen.Top;
    Dortgen_MaxY=Dortgen.Top+Dortgen.Height;

    /*Burada temel olarak, d&amp;ouml;rtgenin hangi b&amp;ouml;lgelere denk d&amp;uuml;şt&amp;uuml;ğ&amp;uuml;ne bakarak dik &amp;uuml;&amp;ccedil;gene ait FarkX ve FarkY değerlerini hesap ediyoruz.*/
    if(Daire_Y&amp;lt;Dortgen_MinY)
    {
        FarkY=Daire_Y-Dortgen_MinY;
    }
    if(Daire_Y&amp;gt;Dortgen_MaxY)
    {
        FarkY=Daire_Y-Dortgen_MaxY;
    }
    if(Daire_X&amp;gt;Dortgen_MaxX)
    {
        FarkX=Daire_X-Dortgen_MaxX;
    }
    if(Daire_X&amp;lt;Dortgen_MinX)
    {
        FarkX=Daire_X-Dortgen_MinX;
    }
    /*Dik &amp;uuml;&amp;ccedil;gene ait hipoten&amp;uuml;s&amp;uuml; buluyoruz.*/
    Hipotenus=Math.Sqrt((FarkX*FarkX)+(FarkY*FarkY));
}

/* &amp;Ouml;l&amp;ccedil;&amp;uuml;mleri ekrana yazdirmak i&amp;ccedil;in string deger d&amp;ouml;nd&amp;uuml;ren bir metod hazirliyoruz.*/
private string Olcumler()
{
    string olcum="Daire i&amp;ccedil;in X:"+Daire_X.ToString();
    olcum+=" Y:"+Daire_Y.ToString();
    olcum+=" R:"+Daire_R.ToString();
    olcum+=" | Dortgen İ&amp;ccedil;in X:"+Dortgen_X.ToString();
    olcum+=" Y:"+Dortgen_Y.ToString();
    olcum+=" | Dortgen İ&amp;ccedil;in MinX:"+Dortgen_MinX;
    olcum+=" | Dortgen İ&amp;ccedil;in MaxX:"+Dortgen_MaxX;
    olcum+=" | Dortgen İ&amp;ccedil;in MinY:"+Dortgen_MinY;
    olcum+=" | Dortgen İ&amp;ccedil;in MaxY:"+Dortgen_MaxY;
    olcum+=" | Hipoten&amp;uuml;s:"+Hipotenus.ToString();
    return olcum;
}
/* Form &amp;uuml;zerinde A,S,D,W tuslarina basildiginda, Dortgen isimli pictureBox' in hareket etmesini sagliyoruz.*/
private void frmCollision2_KeyPress(object sender, System.Windows.Forms.KeyPressEventArgs e)
{
    if(e.KeyChar==(Char)Keys.A)
    {
        Dortgen.Left-=1;
        Hesapla();
        lblOlcumler.Text=Olcumler();
    }
    if(e.KeyChar==(Char)Keys.D)
    {
        Dortgen.Left+=1;
        Hesapla();
        lblOlcumler.Text=Olcumler();
    } 
    if(e.KeyChar==(Char)Keys.S)
    {
        Dortgen.Top+=1;
        Hesapla();
        lblOlcumler.Text=Olcumler();
    }
    if(e.KeyChar==(Char)Keys.W)
    {
        Dortgen.Top-=1;
        Hesapla();
        lblOlcumler.Text=Olcumler();
    }
    Kontrol();
}

/* &amp;Ccedil;arpisma kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; yapiyoruz. */
private void Kontrol()
{
    if(Hipotenus&amp;lt;Daire_R)
    {
        this.Text="";
        this.Text+=" |!!! &amp;Ccedil;ARPISMA VAR !!!| ";
    }
    else
        this.Text="";
}&lt;/pre&gt;
&lt;p&gt;Kodlarımız son derece a&amp;ccedil;ık ve kolay. Uygulamamızı &amp;ccedil;alıştırdığımızda, &amp;ccedil;arpışma teorimizin başarılı bir şekilde &amp;ccedil;alıştığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;img src="/makale/images/mk108_7.gif" alt="" width="408" height="344" border="0" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 7. &amp;Ccedil;arpışma durumu.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi artık oyun programlamada &amp;ouml;nemli noktalardan birisi olan &amp;ccedil;arpışma teorilerinde bayağı bir yol aldık. Ancak her zaman bu teknikleri kullanmayacağız. &amp;Ouml;rneğin zaman zaman, ekranın eşit karelere b&amp;ouml;l&amp;uuml;nd&amp;uuml;ğ&amp;uuml;n&amp;uuml; (aynı kareli defterler gibi) ve nesnelerin bu kareler &amp;uuml;zerindeki konumlarına g&amp;ouml;re &amp;ccedil;arpışıp &amp;ccedil;arpışmadıklarının belirlendiğini &amp;ouml;ğrendim. &amp;Ouml;n&amp;uuml;m&amp;uuml;zdeki hafta b&amp;uuml;y&amp;uuml;k bir ihtimalle bu konuyu incelemeye &amp;ccedil;alışacağım. Kaynaklardan incelediğim kadarı ile bu karelere b&amp;ouml;lme tekniği tam anlamıyla PackMan tarzı oyunlara y&amp;ouml;nelik geliştirilmiş bir model. İşin i&amp;ccedil;ine bu kez matris dizileri girecek. Bakalım başımıza neler gelicek. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-11-19 10:00:00</pubDate>
  <slug>Oyun-Programlamaya-Giriş-(Çarpışma-Teknikleri-3)-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>game-programming</tag>
    <tag>net</tag>
    <tag>collasion</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>