<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Microsoft.Net Services - Service Bus için REST Tabanlı Hello World</title>
  <description>Bir önceki yazımızda Microsoft.Net Services alt yapsının önemli parçalarından birisi olan Service Bus hizmetini incelemeye çalışmış ve basit bir Hello World uygulama koleksiyonu geliştirmiştik. Bu yazımızda ise REST bazlı geliştirilen bir WCF servisine herhangibir tarayıcı yardımıyla HTTP Get metoduna göre, Service Bus üzerinden nasıl ulaşabileceğimizi incelemeye çalışacağız...</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki &lt;a title="Microsoft.Net Services - Service Bus i&amp;ccedil;in Hello World" href="/post/Microsoft-DotNet-Services-Service-Bus-Hello-World" target="_blank"&gt;yazımızda &lt;/a&gt;&lt;strong&gt;Microsoft.Net Services&lt;/strong&gt; alt yapsının &amp;ouml;nemli par&amp;ccedil;alarından birisi olan &lt;strong&gt;Service Bus&lt;/strong&gt; hizmetini incelemeye &amp;ccedil;alışmış ve basit bir &lt;strong&gt;Hello World&lt;/strong&gt; uygulama koleksiyonu geliştirmiştik. Bu yazımızda ise &lt;strong&gt;REST&lt;/strong&gt; bazlı geliştirilen bir &lt;strong&gt;WCF&lt;/strong&gt; servisine herhangibir tarayıcı yardımıyla &lt;strong&gt;HTTP Get&lt;/strong&gt; metoduna g&amp;ouml;re, &lt;strong&gt;Service Bus&lt;/strong&gt; &amp;uuml;zerinden nasıl ulaşabileceğimizi incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;REST &lt;/strong&gt;bazlı modelde bilindiği &amp;uuml;zere Web tabanlı olarak yayınlanan servislere &lt;strong&gt;HTTP&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml;n &lt;strong&gt;Get,Post,Put,Delete &lt;/strong&gt;gibi metodları yardımıyla erişilebilmektedir. Bu &lt;strong&gt;URL&lt;/strong&gt; bazlı erişim sayesinde herhangibir tarayıcı uygulamanın s&amp;ouml;z konusu servis operasyonlarını kullanabilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. &amp;Uuml;stelik istemciler arada bir &lt;strong&gt;proxy&lt;/strong&gt; nesnesine ihtiya&amp;ccedil; duymadan doğrudan &lt;strong&gt;HTTP&lt;/strong&gt;&amp;nbsp;taleplerini g&amp;ouml;nderebilir.&amp;nbsp;Bunlara ek olarak birde servis operasyonlarının &lt;strong&gt;Syndication(RSS,Atom gibi)&lt;/strong&gt;&amp;nbsp;tabanlı i&amp;ccedil;erik yayınlayabilme kabiliyetleri eklendiğinde Web programlama modeline uygun bir hizmet &amp;uuml;retiminin ger&amp;ccedil;ekleştirilebildiği g&amp;ouml;zlemlenecektir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF&lt;/strong&gt; mimarisi, &lt;strong&gt;.Net Framework 3.5 &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml;nden bu yana Web programlama modelini desteklemektedir. Bu nedenle &lt;strong&gt;REST(Representational State Transfer)&lt;/strong&gt; bazlı &lt;strong&gt;WCF &lt;/strong&gt;servisleri kolayca geliştirilebilir. Bizde bu g&amp;uuml;nk&amp;uuml; &amp;ouml;rneğimizde sunucu tarafında, &lt;strong&gt;RSS 2.0 &lt;/strong&gt;formatında i&amp;ccedil;erik yayınlaması yapan ve &lt;strong&gt;REST&lt;/strong&gt; tabanlı olarak &amp;ccedil;alışabilen bir &lt;strong&gt;WCF&lt;/strong&gt; servisini geliştirecek ve buna olan istemci erişimleri i&amp;ccedil;in &lt;strong&gt;Service Bus'&lt;/strong&gt; tan yararlanacağız. Tahmin edeceğiniz &amp;uuml;zere &lt;strong&gt;Microsoft.Net Services&lt;/strong&gt; &amp;uuml;zerinde &amp;ouml;rneğimiz i&amp;ccedil;in bir&lt;strong&gt; Service Namespace'&lt;/strong&gt; i oluşturulması gerekmektedir. Ben bu g&amp;uuml;nk&amp;uuml; &amp;ouml;rneğimiz i&amp;ccedil;in g&amp;uuml;nl&amp;uuml;k &amp;ouml;neri yemek listesini sunacak bir hizmete uygun aşağıdaki isimlendirmeyi kullanmayı tercih ettim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg98_ServiceNamespace.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bundan sonraki ilk adımımız servis uygulamasını geliştirmek olacaktır. S&amp;ouml;z konusu uygulama &lt;strong&gt;WCF Web programlama&lt;/strong&gt; &lt;strong&gt;modelini(Web Programming Model)&lt;/strong&gt;&amp;nbsp;kullanacağından ve &lt;strong&gt;Service Bus&lt;/strong&gt; &amp;uuml;zerinden iletişimi sağlayacağından aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len &lt;strong&gt;Microsoft.ServiceBus, System.ServiceModel.Web&lt;/strong&gt; ve &lt;strong&gt;System.ServiceModel&lt;/strong&gt; &lt;strong&gt;assembly&lt;/strong&gt;' larını referans etmelidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg98_References.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim sunucu uygulama tarafındaki kodlarımıza;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.ServiceModel;
using System.ServiceModel.Syndication;
using System.ServiceModel.Web;
using Microsoft.ServiceBus;

namespace ServerApp
{
    // Servis s&amp;ouml;zleşmesi
    [ServiceContract(Namespace = "http://www.buraksenyurt.com/MyFoodCompany")]
    public interface IDailyFoodListContract
    {
        [OperationContract]
        [WebGet] // Http Get taleplerine cevap verecek bir operasyon olduğunu belirtiyoruz
        Rss20FeedFormatter GetDailyFoodList(string Day);
    }

    // Servisi uygulayan tip
    [ServiceBehavior(Name = "DailyFoodListService", Namespace = "http://www.buraksenyurt.com/MyFoodCompany")]
    public class DailyFoodListService
        :IDailyFoodListContract
    {
        #region IDailyFoodListContract Members
        
        // GetDailyFoodList metodu RSS 2.0 Formatında basit bir Syndication i&amp;ccedil;eriği d&amp;ouml;nd&amp;uuml;rmektedir.
        public Rss20FeedFormatter GetDailyFoodList(string Day)
        {
            // &amp;Ouml;ncelikli olarak Feed oluşturulur
            SyndicationFeed foodFeed = new SyndicationFeed();
            foodFeed.Id=String.Format("Day_{0}",Day);
            foodFeed.Title = new TextSyndicationContent("G&amp;uuml;nl&amp;uuml;k Yemek Listesi");

            // Feed i&amp;ccedil;erisindeki Item listesi hazırlanır
            List&amp;lt;SyndicationItem&amp;gt; foodItems = new List&amp;lt;SyndicationItem&amp;gt;();
            foodItems.Add(new SyndicationItem( "Aperatifler","Patlıcanlı Musakka", new Uri("http://myfoodcompany/Food/Musakka"), "10001", DateTime.Now));
            foodItems.Add(new SyndicationItem("&amp;Ccedil;orbalar", "Mercimek &amp;Ccedil;orbası", new Uri("http://myfoodcompany/Food/MercimekCorba"), "12034", DateTime.Now));
            foodItems.Add(new SyndicationItem("Ana Yemekler", "Mozeralla Peynirli Makarna", new Uri("http://myfoodcompany/Food/MakarnaMozeralla"), "10025", DateTime.Now));

            // Item listesi feed' e eklenir.
            foodFeed.Items=foodItems;

            // RSS 2.0 formatındaki Feed i&amp;ccedil;eriği &amp;uuml;retimi i&amp;ccedil;in SyndicationFeed nesne &amp;ouml;rneği Rss20FeedFormatter sınıfının yapıcı metoduna parametre olarak ge&amp;ccedil;irilir.
            return new Rss20FeedFormatter(foodFeed);
        }

        #endregion
    }

    //// Kanal aray&amp;uuml;z&amp;uuml;
    //public interface IDailyFoodListChannel
    //    : IDailyFoodListContract, IClientChannel
    //{
    //}

    class Program
    {
        static void Main(string[] args)
        {
            Uri address = ServiceBusEnvironment.CreateServiceUri("https", "MyFoodCompany", "Foods");

            // REST bazlı bir WCF Servisi host işlemi ger&amp;ccedil;ekleştirileceğinden WebServiceHost nesne &amp;ouml;rneğinden yararlanılır
            WebServiceHost host = new WebServiceHost(typeof(DailyFoodListService), address);
            host.Open(); // Servis a&amp;ccedil;ılır

            Console.WriteLine("Servis a&amp;ccedil;ıldı. Servis durumu {0}\nService Adresi {1}", host.State,address.ToString());
            Console.WriteLine("Operasyon Adı : GetDailyFoodList\n");
            Console.WriteLine("&amp;Ccedil;ıkmak i&amp;ccedil;in bir tuşa basınız");
            Console.ReadLine();

            host.Close(); // Servis kapatılır
        }
    }
}&lt;/pre&gt;
&lt;p&gt;WCF Servis s&amp;ouml;zleşmemiz i&amp;ccedil;erisinde yer alan &lt;strong&gt;GetDailyFoodList&lt;/strong&gt; operasyonu,&amp;nbsp;&lt;strong&gt;string&lt;/strong&gt; parametre alıp &lt;strong&gt;RSS 2.0&lt;/strong&gt; formatında i&amp;ccedil;erik &amp;uuml;reten basit bir fonksiyonellik sunmaktadır. Bu operasyonun &lt;strong&gt;HTTP Get &lt;/strong&gt;taleplerine cevap verebilmesi istendiğinden &lt;strong&gt;WebGet&lt;/strong&gt; niteliği ile imzalanması gerekmektedir. Diğer yandan WCF &amp;ccedil;alışma zamanının &lt;strong&gt;REST&lt;/strong&gt; tabanlı talepleri değerlendirmesi istendiğinden &lt;strong&gt;ServiceHost&lt;/strong&gt; yerine &lt;strong&gt;WebServiceHost&lt;/strong&gt; tipinin kullanılması gerektiğide aşikardır. Bunun dışında servis operasyonumuz tamamen deneysel olarak g&amp;uuml;nl&amp;uuml;k &amp;ouml;neri yemek listesini &amp;uuml;retmektedir.&lt;/p&gt;
&lt;p&gt;Pekala d&amp;uuml;nya &amp;uuml;zerindeki restoran zincirlerine veya herhangibir evin mutfağındaki dokunmatik ekranlara bu tip bir servis yardımıyla hizmet g&amp;ouml;t&amp;uuml;r&amp;uuml;yor olsaydık daha fazla parametre alacak ve veri kaynağı olarak &lt;strong&gt;Azure&lt;/strong&gt; &amp;uuml;zerinde yer alacak bir &lt;strong&gt;Database Service'&lt;/strong&gt; ini kullanacak bir operasyon da geliştirebilirdik. Kimbilir belki ilerleyen zamanlarda bu tip komple bir &amp;ouml;rneğide geliştirme fırsatımız olur. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Servis uygulamamız tarafında &amp;ccedil;alışma zamanı konfigurasyon bilgileri i&amp;ccedil;inde &lt;strong&gt;App.config&lt;/strong&gt; dosyasının aşağıdaki gibi d&amp;uuml;zenlenmesi yeterlidir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
  &amp;lt;system.serviceModel&amp;gt;
    &amp;lt;bindings&amp;gt;
      &amp;lt;webHttpRelayBinding&amp;gt;
        &amp;lt;binding name="DailyFoodListServiceBinding"&amp;gt;
          &amp;lt;security relayClientAuthenticationType="None" /&amp;gt;
        &amp;lt;/binding&amp;gt;
      &amp;lt;/webHttpRelayBinding&amp;gt;
    &amp;lt;/bindings&amp;gt;
    &amp;lt;services&amp;gt;
      &amp;lt;service behaviorConfiguration="DailyFoodServiceBehavior" name="ServerApp.DailyFoodListService"&amp;gt;
        &amp;lt;endpoint address="" behaviorConfiguration="credentialBehavior" binding="webHttpRelayBinding" bindingConfiguration="DailyFoodListServiceBinding" name="RelayEndpoint" contract="ServerApp.IDailyFoodListContract" /&amp;gt;
      &amp;lt;/service&amp;gt;
    &amp;lt;/services&amp;gt;
    &amp;lt;behaviors&amp;gt;
      &amp;lt;endpointBehaviors&amp;gt;
        &amp;lt;behavior name="credentialBehavior"&amp;gt;
          &amp;lt;transportClientEndpointBehavior credentialType="SharedSecret"&amp;gt;
            &amp;lt;clientCredentials&amp;gt;
              &amp;lt;sharedSecret issuerName="Sizin Issuer Name değeriniz" issuerSecret="Sizin i&amp;ccedil;in &amp;uuml;retilen Key değeri"/&amp;gt;
            &amp;lt;/clientCredentials&amp;gt;
          &amp;lt;/transportClientEndpointBehavior&amp;gt;
        &amp;lt;/behavior&amp;gt;
      &amp;lt;/endpointBehaviors&amp;gt;
      &amp;lt;serviceBehaviors&amp;gt;
        &amp;lt;behavior name="DailyFoodServiceBehavior"&amp;gt;
          &amp;lt;serviceDebug httpHelpPageEnabled="false" httpsHelpPageEnabled="false" includeExceptionDetailInFaults="True" /&amp;gt;
        &amp;lt;/behavior&amp;gt;
      &amp;lt;/serviceBehaviors&amp;gt;
    &amp;lt;/behaviors&amp;gt;
  &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Konfigurasyon i&amp;ccedil;eriğinde dikkat &amp;ccedil;ekici noktaların başında kullanılan bağlayıcı tip gelmektedir(&lt;strong&gt;webHttpRelayBinding&lt;/strong&gt;). Bu gereklidir nitekim &lt;strong&gt;Service Bus&lt;/strong&gt; ile iletişim kurulacaktır. Diğer yandan &lt;strong&gt;clientCredentials&lt;/strong&gt; elementi i&amp;ccedil;erisinde, &lt;strong&gt;Service Bus&lt;/strong&gt; projemizdeki ilgili &lt;strong&gt;Namespace&lt;/strong&gt; i&amp;ccedil;in &amp;uuml;retilen &lt;strong&gt;Issuer Name &lt;/strong&gt;ve &lt;strong&gt;Issuer Key &lt;/strong&gt;değerleri yer almalıdır. Bundan sonrası son derece kolaydır. Servis uygulaması &amp;ccedil;alıştırıldıktan sonra tarayıcı &amp;uuml;zerinden &lt;strong&gt;GetDailyFoodList&lt;/strong&gt; operasyonuna yapılan &amp;ccedil;ağrı aşağıdaki &amp;ouml;rnek ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi karşılanacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg98_Runtime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;Wednesday&lt;/strong&gt; i&amp;ccedil;in bir talepte bulunulmuş ve bir i&amp;ccedil;erik elde edilmiştir. Bu &amp;ouml;rnekte en &amp;ccedil;ok dikkat edilmesi gereken nokta ise operasyon talebinin yapıldığı adres bilgisidir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;https&lt;/strong&gt;://myfoodcompany.servicebus.windows.net/Foods/&lt;strong&gt;GetDailyFoodList?Day=Wednesday&lt;/strong&gt; Volaaa!!! &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&amp;nbsp;Parametreyi nasıl g&amp;ouml;nderdiğimize, https protokol&amp;uuml;ne g&amp;ouml;re bir URL bilgisi yazıldığına dikkat edilmelidir.&lt;/p&gt;
&lt;p&gt;Tabiki işin sağlamasını yapmak amacıyla servis uygulamasını kapatıp aynı talebi g&amp;ouml;ndermeyi deneyebilirisiniz. Bu durumda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg98_ServiceNotRunning.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Yanlız burada dikkat edilmesi gereken noktalardan birisi de, geriye bir istisna(Exception) mesajının g&amp;ouml;nderilmeyişidir. Bu &amp;ccedil;ok doğaldır nitekim servis uygulaması &amp;ccedil;alışmıyor olsa bile Service Bus &amp;uuml;zerinde gelen talebin değerlendirildiği bir hizmet bulunmaktadır.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneği geliştirirken meraktan yaptığım bir testte yanlış &lt;strong&gt;Issuer Key &lt;/strong&gt;değeri g&amp;ouml;ndermek oldu. B&amp;ouml;yle bir vakada g&amp;ouml;nderilen&lt;strong&gt; HTTP Get&lt;/strong&gt; talebi sonrası aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg98_WrongKey.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;401 Unauthorized&lt;/strong&gt;&amp;nbsp;hatasını aldık. Bir başka deyişle &lt;strong&gt;Credential&lt;/strong&gt; bilgilerimiz doğrulanmadı.&lt;/p&gt;
&lt;p&gt;Bu hızlı &amp;ouml;rnek ile &lt;strong&gt;Service Bus&lt;/strong&gt; hizmetinden &lt;strong&gt;REST&lt;/strong&gt; bazlı olarakta nasıl yararlanabileceğimizi g&amp;ouml;rm&amp;uuml;ş olduk. Bir &amp;ouml;nceki yazımızda kullandığımız &amp;ouml;rnekte geliştirdiğimiz istemci uygulamada hatırlayacağınız &amp;uuml;zere, s&amp;ouml;zleşme tanımlamış, kanal oluşturmuş ve TCP bazlı olan iletişim &amp;uuml;zerinden kanal bazlı metod &amp;ccedil;ağrısı ile isteğimizi &lt;strong&gt;Service Bus &lt;/strong&gt;tarafına g&amp;ouml;ndermiştik. &lt;strong&gt;REST&lt;/strong&gt; modelinde ise bir istemci geliştirmediğimizi sadece bir &lt;strong&gt;URL&lt;/strong&gt; kullandığımızı hatırlatmak isterim. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f11%2fRestBased.rar"&gt;RestBased.rar (25,30 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-11-19 23:45:00</pubDate>
  <slug>MicrosoftNet-Services-Service-Bus-icin-REST-Tabanli-Hello-World</slug>
  <tags>
    <tag>windows-azure</tag>
    <tag>service-bus</tag>
    <tag>wcf</tag>
    <tag>rest</tag>
  </tags>
  <categories>
    <category>Windows Azure</category>
  </categories>
</post>