<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF Eco System</title>
  <description>Özellikle son bir iki yıllık zaman dilimi içerisinde .Net tarafında pek çok servis modeli ve ismiyle karşılaştık. Örneğin Astoria kod adıyla başlayan Ado.Net Data Services, Silverlight gibi Rich Internet Application' ları hedef alan .Net RIA Services vb... (Eğer Microsoft' un ürünleri için kullandığı kod adlarını merak ediyorsanız Wikipedia' daki ilgili listeye bakmanızı öneririm) Hal böyle olunca ortada bir sürü kod adı ve isim oluşmaya başladı. Buda çok doğal olarak bizim gibi geliştricilerin kafasında pek çok soru işaretine neden oldu. Acaba hangi servis modelini hangi amaçlar ile kullanmalıyız? Bunların nihai sürümler yaklaştıkça isimlendirmeleri neler olacak? Ne gibi avantaj veya dez avantajları var?</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle son bir iki yıllık zaman dilimi i&amp;ccedil;erisinde &lt;strong&gt;.Net&lt;/strong&gt; tarafında pek &amp;ccedil;ok servis modeli ve ismiyle karşılaştık. &amp;Ouml;rneğin &lt;strong&gt;Astoria&lt;/strong&gt; kod adıyla başlayan &lt;strong&gt;Ado.Net Data Services&lt;/strong&gt;, &lt;strong&gt;Silverlight&lt;/strong&gt; gibi &lt;strong&gt;Rich Internet Application' &lt;/strong&gt;ları hedef alan &lt;strong&gt;.Net RIA Services&lt;/strong&gt; vb... (&lt;em&gt;Eğer Microsoft' un &amp;uuml;r&amp;uuml;nleri i&amp;ccedil;in kullandığı kod adlarını merak ediyorsanız &lt;a title="Microsoft Product Code Names" href="http://en.wikipedia.org/wiki/List_of_Microsoft_codenames" target="_blank"&gt;Wikipedia&lt;/a&gt;' daki ilgili listeye bakmanızı &amp;ouml;neririm)&lt;/em&gt; Hal b&amp;ouml;yle olunca ortada bir s&amp;uuml;r&amp;uuml; kod adı ve isim oluşmaya başladı. Buda &amp;ccedil;ok doğal olarak bizim gibi geliştricilerin kafasında pek &amp;ccedil;ok soru işaretine neden oldu. Acaba hangi servis modelini hangi ama&amp;ccedil;lar ile kullanmalıyız? Bunların nihai s&amp;uuml;r&amp;uuml;mler yaklaştık&amp;ccedil;a isimlendirmeleri neler olacak? Ne gibi avantaj veya dez avantajları var?&lt;/p&gt;
&lt;p&gt;Soruları arttırmak m&amp;uuml;mk&amp;uuml;n. Aslında kabul edilmesi gereken &amp;ouml;nemli bir nokta var; T&amp;uuml;m bu servis modelleri &lt;strong&gt;.Net Framework&amp;nbsp;3.0'&lt;/strong&gt; dan beri var olan ve her s&amp;uuml;r&amp;uuml;mde &amp;ouml;nemli yetenekler kazanan &lt;strong&gt;Windows Communication Foundation(WCF) &lt;/strong&gt;alt yapısı(Infrastructure diyebiliriz) &amp;uuml;zerinde konuşlandırılmış durumda. Şu an i&amp;ccedil;inde bulunduğumuz servis modellerinin &amp;ccedil;eşitliliğini ve sayısını d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde ise bir &lt;strong&gt;Eco System'&lt;/strong&gt; in oluştuğunu net bir şekilde ifade edebiliriz. Aşağıdaki tabloda &lt;strong&gt;WCF Eco System'&lt;/strong&gt; in par&amp;ccedil;aları yer almakta olup kısaca ama&amp;ccedil;ları &amp;ouml;zetlenmeye &amp;ccedil;alışılmaktadır.&lt;/p&gt;
&lt;table style="width: 100%;" border="1" cellspacing="0" cellpadding="5" align="center"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="background-color: #deb887;" valign="top"&gt;
&lt;p&gt;&lt;strong&gt;Model&lt;/strong&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;td style="background-color: #deb887;" valign="top"&gt;
&lt;p&gt;&lt;strong&gt;&amp;Ouml;zet Bilgi&lt;/strong&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #deb887;" valign="top"&gt;
&lt;p&gt;&lt;strong&gt;SOAP Services Modeli&lt;/strong&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;td&gt;
&lt;p&gt;&lt;strong&gt;Interoperability&lt;/strong&gt; standartlarına uygun olan b&amp;ouml;ylece &amp;ouml;rneğin &lt;strong&gt;Java&lt;/strong&gt; gibi platformlar ile konuşabilen, &lt;strong&gt;mesaj tabanlı g&amp;uuml;venliği(Message Based Security)&lt;/strong&gt;&amp;nbsp;baz alabilen, &lt;strong&gt;transaction akışına(Transaction Flow)&lt;/strong&gt;&amp;nbsp;izin veren, &lt;strong&gt;IIS&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;HTTP&lt;/strong&gt; tabanlı veya &lt;strong&gt;IIS&lt;/strong&gt; dışından host edilebilen&lt;em&gt;(&amp;ouml;rneğin bir Windows Service, Windows Forms veya WPF uygulaması yada basit bir Console programı olarak)&lt;/em&gt;, pek &amp;ccedil;ok &lt;strong&gt;WS-*&lt;/strong&gt; standardını destekleyen tipteki servisler olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Bu servis modeli &lt;strong&gt;.Net Framework 3.0&lt;/strong&gt; versiyonundan bu yana mevcuttur. Geliştiricilere &amp;ccedil;ok daha fazla kontrol imkanı sunan bir model olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Diğer servis modellerindeki gibi belirli bir konuya odaklanmaktan ziyade ihtiya&amp;ccedil;lara g&amp;ouml;re d&amp;uuml;ş&amp;uuml;n&amp;uuml;len &amp;ccedil;&amp;ouml;z&amp;uuml;mlerde değerlendirilir.&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #deb887;" valign="top"&gt;
&lt;p&gt;&lt;strong&gt;WebHttp Services Modeli&lt;/strong&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;td&gt;
&lt;p&gt;&lt;strong&gt;URI(Uniform Resource Identifier)&lt;/strong&gt;&amp;nbsp;bazlı olaraktan servis operasyonlarının &lt;strong&gt;RESTful&lt;/strong&gt; yaklaşımına g&amp;ouml;re sunulduğu fonksiyonellikleri barındıran servis modelidir. &lt;strong&gt;WCF &lt;/strong&gt;tarafındaki bu yetenekler &lt;strong&gt;.Net Framework 3.5&lt;/strong&gt; ile birlikte gelen &lt;strong&gt;Web programlama modeli(Web Programming Model)&lt;/strong&gt;&amp;nbsp;sayesinde ortaya &amp;ccedil;ıkartılmış olup &lt;strong&gt;.Net Framework 4.0' &lt;/strong&gt;da ek &amp;ouml;zellikler ile arttırılmıştır. Bu modelde verinin&amp;nbsp;&lt;strong&gt;Get,Post,Put &lt;/strong&gt;ve &lt;strong&gt;Delete &lt;/strong&gt;gibi &lt;strong&gt;HTTP &lt;/strong&gt;protokol metodlarına uygun olaraktan sunulması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Geliştiriciler verinin sunulması sırasındaki &lt;strong&gt;URI&lt;/strong&gt; bilgisine, &amp;ccedil;ıktı formatına&lt;em&gt;(&amp;ouml;rneğin JavaScript Object Notation tipinden olması) &lt;/em&gt;m&amp;uuml;dahalede bulunabilir.&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #deb887;" valign="top"&gt;
&lt;p&gt;&lt;strong&gt;Data Services Modeli&lt;/strong&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;td&gt;
&lt;p&gt;&lt;strong&gt;Veri modelimizi(Data Model)&lt;/strong&gt;&amp;nbsp;ve bu modelin i&amp;ccedil;erdiği iş mantığın bir &lt;strong&gt;RESTful&lt;/strong&gt;&amp;nbsp;aray&amp;uuml;z&amp;uuml; &amp;uuml;zerinden sunmak istediğimiz durumlarda kullandığımız servis modeli yaklaşımıdır. &lt;strong&gt;.Net&lt;/strong&gt; i&amp;ccedil;in &lt;strong&gt;Open Data Protocol &lt;/strong&gt;desteğini de i&amp;ccedil;ermektedir. Aslında ilk olarak &lt;strong&gt;.Net Framework 3.5 Service Pack 1&lt;/strong&gt; ile ve &lt;strong&gt;Ado.Net Data Services &lt;/strong&gt;adıyla ortaya &amp;ccedil;ıkmıştır. Bu yaklaşımda servisin sunacağı veri kaynağına ulaşırken &lt;strong&gt;Ado.Net Entity Framework &lt;/strong&gt;gibi gelişmiş &lt;strong&gt;ORM &lt;/strong&gt;birimlerinden yararlanılabilir. Ancak istenildiğinde &lt;strong&gt;Custom LINQ Provider' &lt;/strong&gt;lardanda faydalanılıp farklı veri kaynaklarının kullanılması m&amp;uuml;mk&amp;uuml;n olabilir.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;* RIA Services&lt;/strong&gt; ile &lt;strong&gt;Data Services&lt;/strong&gt; zaman zaman bir birlerine karıştırılmaktadır. Aslında &lt;strong&gt;Data Services&lt;/strong&gt;, veri modelinin ve bu model ile ilişkili iş mantığının sunulması ile ilgilenmekte iken &lt;strong&gt;RIA Service'&lt;/strong&gt; leri &lt;strong&gt;Silverlight &lt;/strong&gt;uygulamalarının &lt;strong&gt;end-to-end&lt;/strong&gt; modelinde&amp;nbsp;geliştirilmesine odaklanmaktadır. Bu nedenle benzer olmalarına rağmen ilgilendikleri vakalar tamamen farklıdır. &lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;**&lt;/strong&gt; Yine&lt;strong&gt; Data Service'&lt;/strong&gt; lerin zaman zaman &lt;strong&gt;WebHttp Service'&lt;/strong&gt; leri ile karıştırılmasıda s&amp;ouml;z konusudur. Ancak yine her iki servis modelinin ilgilendiği vakalar farklıdır. &lt;strong&gt;WebHttp Service'&lt;/strong&gt; leri &lt;strong&gt;URI, format &lt;/strong&gt;ve &lt;strong&gt;protocol &lt;/strong&gt;bilgileri &amp;uuml;zerinde tam y&amp;ouml;netime izin verecek şekilde &lt;strong&gt;RESTful&lt;/strong&gt; servisler geliştirebilmemize olanak sağlar. Ancak &lt;strong&gt;Data Service'&lt;/strong&gt; lerde &lt;strong&gt;RESTful&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; zaten hazırdır ve sadece veri modeli ile ilişkilendirilmesi yeterlidir.&lt;/em&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #deb887;" valign="top"&gt;
&lt;p&gt;&lt;strong&gt;Workflow Services Modeli&lt;/strong&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;td&gt;
&lt;p&gt;&lt;strong&gt;Uzun s&amp;uuml;reli(Long Running)&lt;/strong&gt;&amp;nbsp;ve &lt;strong&gt;kalıcılık(Persistence)&lt;/strong&gt; desteği olması gereken &lt;strong&gt;Workflow&lt;/strong&gt; uygulamalarının servis bazlı olarak kullanılabilmesini sağlayan modeldir. Bu modele g&amp;ouml;re &lt;strong&gt;Workflow&lt;/strong&gt; nesnelerinin &lt;strong&gt;WCF&lt;/strong&gt; servisi olarak sunulması, t&amp;uuml;ketilmesi ve ayrıca &lt;strong&gt;Workflow&lt;/strong&gt; nesnelerinin i&amp;ccedil;erisinde &lt;strong&gt;WCF&lt;/strong&gt; servislerinin &amp;ccedil;ağrılıp değerlendirilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;* .&lt;strong&gt;Net Framework 3.0'&lt;/strong&gt; da birbirlerine uzaktan bakan &lt;strong&gt;WF&lt;/strong&gt; ve &lt;strong&gt;WCF &lt;/strong&gt;alt yapıları, &lt;strong&gt;.Net Framework 3.5 &lt;/strong&gt;ile fl&amp;ouml;rt etmeye başlamış ve &lt;strong&gt;.Net Framework 4.0' &lt;/strong&gt;da evlenmiştir. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #deb887;" valign="top"&gt;
&lt;p&gt;&lt;strong&gt;RIA Services Modeli&lt;/strong&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;td&gt;
&lt;p&gt;&lt;strong&gt;Sliverlight&lt;/strong&gt; gibi &lt;strong&gt;Rich Internet Application(RIA) &lt;/strong&gt;uygulamalarında orta katmandaki iş modelinin servis bazlı olarak hem istemci hemde sunucu tarafında y&amp;ouml;netilmesini, oluşturulmasını ve kullanılmasnı kolaylaştıran &lt;strong&gt;end-to-end&lt;/strong&gt; servis modelidir. &amp;Ouml;nceki adı &lt;strong&gt;.Net RIA Services&lt;/strong&gt; olmasına rağmen değişen adıyla birlikte tam olarak &lt;strong&gt;Silverlight 4.0&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nde nihai versiyonuna ulaşacağı tahmin edilmektedir.&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Tabi buradaki bilgiler dışında aşağıdaki &amp;ccedil;izelgeyide g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almamızda yarar vardır. Bu &amp;ccedil;izelgede WCF Eco System' in mimari modeli g&amp;ouml;sterilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblgWCFEcoSystem.jpg" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında &lt;strong&gt;WCF&lt;/strong&gt; alt yapısı &amp;uuml;zerinde duran servis programlama modelleri, geliştiricilerin vakaya g&amp;ouml;re WCF alt yapı detaylarından uzaklaşmasını sağlamaktadır. Bu, &amp;ouml;zellikle &lt;strong&gt;Data Services&lt;/strong&gt; ve &lt;strong&gt;RIA Services &lt;/strong&gt;modellerinde &amp;ouml;n plana &amp;ccedil;ıkmaktadır. Yine de istenildiğinde bu modelleri esnetebileceğimizi bilmeliyiz. Hatta bana kalırsa &lt;strong&gt;WCF&lt;/strong&gt; alt yapısı &amp;uuml;zerine oturan kendi programlama modellerimizi de geliştirebiliriz. Ancak buna gerek olup olmadığını tartışmalıyız.&lt;/p&gt;
&lt;p&gt;Umarım WCF Eco System hakkında biraz fikir sahibi olabilmişizdir. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2010-01-05 01:30:00</pubDate>
  <slug>WCF-Eco-System</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-ria-services</tag>
    <tag>workflow-services</tag>
    <tag>data-services</tag>
    <tag>adonet-data-services</tag>
    <tag>web-http-services</tag>
    <tag>soap-services</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>