<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Google Cloud Pub/Sub Service Macerası</title>
  <description>Bu makalemizde Google Cloud Platform'un önemli servislerinden birisi olan Pub/Sub API'yi incelemeye çalışıyoruz. gCloud ile komut satırından topic oluşturup, buna abone oluyor ve mesaj yayınlayıp, yayınlanan mesajı okuyoruz. Ardından .Net Core ile geliştirdiğimiz uygulamada Google.Cloud.PubSub.V1 paketini kullanarak mesaj yayınlama ve yayınlanan mesajları okuma işlemlerini nasıl gerçekleştirebileceğimize bakıyoruz.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/02/surfing.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Yeni yuvam ile evimin arası 40 km. Uzaklık nedeniyle mesailerimiz erken başlıyor. Sabah 05:50de &amp;ccedil;alan alarmla g&amp;uuml;ne başlıyorum. &amp;Uuml;st baş, kişisel bakım,&amp;nbsp;seyahat boyu bana eşlik edecek filtre kahveyi hazırlama vs derken 06:35 sıralarında sevgili servis şof&amp;ouml;r&amp;uuml;m&amp;uuml;z İhsan ağabey ile buluşup yola devam ediyorum. Yaklaşık 40-45 dakikalık bir seyahatten sonra iş yerine ulaşıyorum. Yol boyunca "o saatte kim ayakta olur?" sorusunu cevaplarcasına her sabah onlarca kez ezen insanla karşılaşıyorum. Mevsime g&amp;ouml;re evlerin&amp;nbsp;sarı beyaz&amp;nbsp;oda ışıkları, seyir halindeki arabalar, &amp;ccedil;alışanları işe g&amp;ouml;t&amp;uuml;ren servisler, otob&amp;uuml;sler, minib&amp;uuml;sler, duraklarda bekleyen &amp;ouml;ğrenciler... O vakitlerde empati yapmak farklı bir deneyim.&lt;/p&gt;
&lt;p&gt;Ama bazı sabahlarda Feedly sayfama d&amp;uuml;şen yazıları okuyorum. Şirkete ulaştığımda mesainin başladığı 07:45e kadar da neredeyse yarım saatlik serbest zamanım oluyor. Genelde beğendiğim ve Feedly listemde favorilere eklediğim bir yazının devamını o zaman diliminde getiriyorum. Bazı yazıları da tekrar tekrar okuyorum. İşte tam da b&amp;ouml;yle bir sabahtı Google'ın iş ortaklarından olan &lt;a href="https://www.incentro.com/en/" target="_blank"&gt;Incentro&lt;/a&gt;&amp;nbsp;firmasının&lt;em&gt;(Internet sayfaları &amp;ccedil;ok hoş)&lt;/em&gt; direkt&amp;ouml;r&amp;uuml;&amp;nbsp;Kees van Bemmel'ın kaleminde &amp;ccedil;ıkan yazıyı okuduğumda. Makale, Cloud Platform temelli olarak geliştirilen bir &amp;ccedil;&amp;ouml;z&amp;uuml;m hakkındaydı.&lt;em&gt;&amp;nbsp;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şirkete varır varmaz ilk işim yazının &amp;uuml;st&amp;uuml;nden bir kere daha ge&amp;ccedil;mek olmuştu. Sadece başlığında Publisher/Subscriber, Cloud Function, Machine Learning, Serverless kelimeleri ge&amp;ccedil;iyordu. Bunlar ilgi &amp;ccedil;ekici olması i&amp;ccedil;in fazlasıyla yeterliydi. Google'un bloğuna konu olan vakada, video, resim ve ses gibi i&amp;ccedil;erikleri y&amp;ouml;netmeye &amp;ccedil;alışan bir firmanın Google Cloud Platform ile uyguladığı Serverless &amp;ccedil;&amp;ouml;z&amp;uuml;m anlatılıyordu. Sorun bu i&amp;ccedil;eriklerin takı bazında kayıt altına&amp;nbsp;alınması ve aramalarda doğru konumlandırılamamasıyla alakalıydı.&lt;/p&gt;
&lt;p&gt;Ş&amp;ouml;yle d&amp;uuml;ş&amp;uuml;nebiliriz; m&amp;uuml;şteri olarak elimizde tonlarca video, resim ve ses i&amp;ccedil;eriği bulunuyor. Bunları tag sistemi ile teker teker kategorize etmeye &amp;ccedil;alışırken ne kadar doğru sonu&amp;ccedil;lar &amp;uuml;retebiliyoruz? Ka&amp;ccedil;ını yanlış takılarla, hatta takıları olmadan sisteme dahil ediyoruz. İşte s&amp;ouml;z konusu &amp;ccedil;&amp;ouml;z&amp;uuml;mde hem takı belirleme hem de arama işleri i&amp;ccedil;in gerekli i&amp;ccedil;eriklerin Elasticsearch &amp;uuml;zerinde indekslenmesinde Google Cloud Platform'un &amp;ccedil;eşitli hizmetlerinden nasıl yararlanıldığı anlatılıyordu. Biliyorum "ne bu? ne bu?" diyorsunuz. &lt;a href="http://cloudplatform.googleblog.com/2018/01/how-we-built-a-serverless-digital-archive-with-machine-learning-APIs-Cloud-Pub-Sub-and-Cloud-Functions.html" target="_blank"&gt;Buradaki yazıyı&lt;/a&gt; okumanızı şiddetle tavsiye ederim.&amp;nbsp;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Şunu hayal edin...Diyelim ki aksiyon videoları/fotoğrafları &amp;ccedil;ekenlerin&amp;nbsp;olduğu bir internet arşivinin sahibisiniz. M&amp;uuml;şterileriniz videolarını&amp;nbsp;y&amp;uuml;kledik&amp;ccedil;e i&amp;ccedil;eriklerindeki bir takım imgelere g&amp;ouml;re otomatik olarak takılarla işaretlenmelerini&lt;em&gt;(mesela r&amp;uuml;zgar s&amp;ouml;rf&amp;uuml;n&amp;uuml; otomatik olarak algılayıp windsurfing takısı ile işaretlenmesi)&lt;/em&gt; ve hatta konuşmalarındaki metinsel ifadelere g&amp;ouml;re de&lt;em&gt;("ala&amp;ccedil;atı'nın r&amp;uuml;zgarları s&amp;ouml;rf yapmak i&amp;ccedil;in idealmiş ahbap...")&lt;/em&gt; hangi sporlarla uğraştıklarını ve belki de konuşanın hangi &amp;uuml;nl&amp;uuml; olabileceğini kayıt altına almak istiyorsunuz. Hatta &amp;uuml;yelerinizin &amp;ccedil;ekip y&amp;uuml;kledikleri fotoğraflarda sizin tanımladığınız imgelerin otomatik olarak algılanıp takı bazında değerlendirilmesini istiyorsunuz vs&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Ben yazıyı okuduktan sonra masamın başına ge&amp;ccedil;tiğimde yaptığım ilk iş, mimari resmin bir benzerini &amp;ccedil;izmeye &amp;ccedil;alışmak oldu. Her zaman okuduğumu bakarak da olsa&lt;em&gt;(az bakarak yapılanı kabul, hi&amp;ccedil; bakmadan tek seferde yapılanı makbuldur)&lt;/em&gt; &amp;ccedil;izmeye &amp;ccedil;alışırdım. Kendi notlarımı ekleyerek &amp;ouml;ğrenmeyi pekiştirmeye gayret ederdim. Sonu&amp;ccedil;ta kurşun kalemle de olsa aşağıdaki gibi bir şeylere ulaştım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/gcpps_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Kabaca olayı anlamış gibiydim. Eğer işlenmesini istediğim bir değer varsa(asset diyelim), bunu Google Cloud Storage'a atmam yeterliydi. Sonrasında Google'ın Handler fonksiyonları devreye girip bu değeri &amp;ccedil;eşidine g&amp;ouml;re işleyişin y&amp;uuml;r&amp;uuml;t&amp;uuml;ld&amp;uuml;ğ&amp;uuml; hattaki uygun enstr&amp;uuml;mana&lt;em&gt;(yazının konusu olan Pub/Sub hizmetine)&lt;/em&gt; y&amp;ouml;nlendirecekti. Bu y&amp;ouml;nlendirme sırasında resim, video ve ses ile ilgili işleme fonksiyonları&lt;em&gt;(Google Cloud Functions)&lt;/em&gt; devreye girecekti. Sonrası Elasticsearch'e atılan bilgilerden ibaretti. Benim ilgimi &amp;ccedil;eken Machine Learning, Speech to Text gibi akıllı hizmetlerin sunulduğu Google Cloud Functions alanıydı. Lakin daha &amp;ouml;nceden bir şekilde incelemiş olmama rağmen aradaki bir katmanı &amp;ouml;ğrenmeden ilerleyemeyeceğimi anlamıştım. Google Pub/Sub hizmeti.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Esasında bir resmin i&amp;ccedil;erisindeki nesnelere g&amp;ouml;re Tensorflow'un bile araya girebildiği anlamlaştırma ya da bir video i&amp;ccedil;erisindeki sesin Speech API ile metne d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;l&amp;uuml;p konunun ne olduğunun &amp;ccedil;ıkartılması ve t&amp;uuml;m bunların EleasticSearch &amp;uuml;zerine yazılması gibi fonksiyonellikler bir şekilde tetikleniyordu. Genellikle bir HTTP talebi bunun i&amp;ccedil;in yeterli ancak Publisher/Subscriber modeli de bu tetikleyicilerden birisiydi. İşte benim &amp;ouml;ncelikli olarak Google Cloud Platform &amp;uuml;zerindeki Publisher/Subscriber hizmetini anlamam gerekiyordu.&lt;/p&gt;
&lt;p&gt;Temel olarak bu hizmeti şu şekilde ifade edebiliriz; Uygulamalar arasında g&amp;uuml;venilir şekilde hızlı ve asenkron olarak mesaj değiş tokuşuna izin veren bir Google hizmeti olarak tanımlasak yanlış olmaz. Sistem klasik Publisher/Subscriber modelini baz alır. Publisher rol&amp;uuml;n&amp;uuml; &amp;uuml;stlenen taraf belli bir konu(topic) i&amp;ccedil;in mesaj yayımlar. Subscriber rol&amp;uuml;n&amp;uuml; &amp;uuml;stlenen taraf eğer ilgili konuya(topic) abone olmuşsa yayıncının mesajını istediği zaman &amp;ccedil;ekebilir. Google'ın bu hizmetindeki mesajlar alıcıya ulaşana kadar belli bir s&amp;uuml;re boyunca&lt;em&gt;(ben araştırırken 7 g&amp;uuml;nd&amp;uuml;)&lt;/em&gt; korunmaktadır.&lt;/p&gt;
&lt;p&gt;Bu teorik bilgiyi pekiştirmek ve &amp;ouml;zellikle bunu West-World gibi Ubuntu tabanlı bir d&amp;uuml;nyada, .Net Core,Go,Ruby, Python, Node.js gibi dilleri kullanarak deneyimlemek benim i&amp;ccedil;in &amp;ouml;nemliydi. Ana amacım Google Cloud Platform'da Pub/Sub servisini belli bir proje i&amp;ccedil;in etkinleştirmek ve sonrasında .Net Core tarafında belli bir topic i&amp;ccedil;in mesaj yayınlayıp bu mesajı okuyabilmek. Zaten Google Cloud Platform a&amp;ccedil;ısından ama&amp;ccedil; da bu. Uygulamalar arasında g&amp;uuml;venilir bir hat &amp;uuml;zerinden mesaj akışına izin veren y&amp;uuml;ksek performanslı tamamen asenkron &amp;ccedil;alışan bir boru hattı&lt;em&gt;(pipeline)&lt;/em&gt; &amp;Ouml;yleyse gelin adım adım ilerleyerek konuyu anlamaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;h1&gt;gCloud ile İlk Deneyim&lt;/h1&gt;
&lt;p&gt;Google bu konu ile ilişkili olduk&amp;ccedil;a zengin ve basit &amp;ouml;ğreti d&amp;ouml;k&amp;uuml;manları sunmakta&lt;em&gt;(Diğer bulut bilişim sistemlerinde olduğu gibi)&lt;/em&gt; Bende ilgili dok&amp;uuml;manları takip ettim ve ilk olarak gCloud aracını kullanarak var olan bir Google projemde Publisher/Subscriber modelini deneyimlemeye &amp;ccedil;alıştım.&amp;nbsp;my-starwars-game-project isimli projemi se&amp;ccedil;tikten sonra Google Console-&amp;gt; API sekmesinden Enable APIS and Services linkine tıklayarak ilerledim. Big Data&amp;nbsp;kısmında yer alan Google Cloud Pub/Sub API hizmetini se&amp;ccedil;ip&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/gcpsp_2n.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Enable yazan d&amp;uuml;ğmeye bastım. B&amp;ouml;ylece Google Cloud Platform &amp;uuml;zerinde yer alan&amp;nbsp;bir projem&amp;nbsp;i&amp;ccedil;in Pub/Sub API hizmetini etkinleştirmiş oldum.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;GCP &amp;uuml;zerinde, doğal dil işleme hizmetinden(Google Cloud Natural Language API) &amp;ccedil;eviri servisine(Google Cloud Translation API), tahminlemeden(Prediction API) makine &amp;ouml;ğrenimine(Google Machine Learning Engine) kadar farklı farklı kategorilerde bir &amp;ccedil;ok API olduğunu ve proje bazlı kullanılabildiğini ifade edebilirim. Tabii bunları deneyimlemeden &amp;ouml;nce mutlaka &amp;uuml;cret politikasını incelemekte yarar var.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bundan sonra iş West-World terminalindeydi. gCloud komutunu kullanarak&lt;em&gt;(daha &amp;ouml;nceden West-World'e kurmuştum)&lt;/em&gt; bir topic oluşturmayı, bu topic'e abone olup mesaj g&amp;ouml;ndermeyi ve diğer bir abone ile de bu mesajı okumayı denedim. İşte West-World'&amp;uuml;n bu denemeler sonrası g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml;.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/gcpps_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikle şunu belirtmem lazım; işe gcloud init komutu ile başlamakta yarar olabilir. Nitekim projeniz i&amp;ccedil;in makinedeki ayarların tekrardan yapılması gerekebilir. Ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nden de g&amp;ouml;r&amp;uuml;leceği &amp;uuml;zere pubsub uygulamasına ait komutları kullanarak string bir mesajı codeTopic isimli bir konu başlığı altında yayınlıyor ve&amp;nbsp;tekrardan okuyoruz. Kullanılan komutlara kısaca bakacak olursak şunları s&amp;ouml;yleyebiliriz;&lt;/p&gt;
&lt;p&gt;codeTopic isimli bir konu başlığı oluşturmak i&amp;ccedil;in şu komutu kullanıyoruz,&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;gcloud pubsub topics create codeTopic&lt;/pre&gt;
&lt;p&gt;Ben oluşturulan topikleri nasıl g&amp;ouml;rebileceğimizi de merak ettiğimden ş&amp;ouml;yle bir komut buldum.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;gcloud pubsub topics list&lt;/pre&gt;
&lt;p&gt;Tabii bu konu başlığına mesaj atmak veya okumak i&amp;ccedil;in &amp;ouml;ncelikle abone olunması gerekiyor. westworldSubscription isimli bir aboneliği aşağıdaki komutla oluşturmak m&amp;uuml;mk&amp;uuml;n.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;gcloud pubsub subscriptions create --topic codeTopic westworldSubscription&lt;/pre&gt;
&lt;p&gt;Eğer abonelerin bir listesini g&amp;ouml;rmek istersek de şu komut işimize yarayacaktır.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;gcloud pubsub subscriptions list&lt;/pre&gt;
&lt;p&gt;Bir topic ve bir abone var. Bu durumda uzaya doğru bir mesaj fırlatılabilir. S&amp;ouml;z gelimi codeTopic başlığı altında "convert this message to C#" şeklinde bir mesaj g&amp;ouml;nderebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;gcloud pubsub topics publish codeTopic --message "convert this message to c#"&lt;/pre&gt;
&lt;p&gt;Peki g&amp;ouml;nderdiğimiz bu mesajı nasıl &amp;ccedil;ekeceğiz? Bunun aslında iki yolu var. Birisi Push diğeri ise Pull olarak ge&amp;ccedil;iyor. Push modelinde google cloud platform tarafının abone olan tarafa mesaj g&amp;ouml;ndermesi gibi bir durum s&amp;ouml;z konusu. Pull modelinde ise abonenin kendisi gidip mesajı alıyor. Aşağıdaki komut pull modeline g&amp;ouml;re &amp;ccedil;alışmakta &lt;em&gt;(&lt;a href="https://cloud.google.com/pubsub/docs/subscriber#push_pull" target="_blank"&gt;Şu adreste&lt;/a&gt; Push ve Pull metodlarının &amp;ccedil;alışması ve hangi durumda hangisinin tercih edilmesi gerektiğine dair bir takım bilgiler bulunmakta)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;gcloud pubsub subscriptions pull --auto-ack westworldSubscription&lt;/pre&gt;
&lt;p&gt;Ben mesajı g&amp;ouml;nderip almayı başardıktan sonra ilgili konu başlığı ve aboneliği nasıl sileceğimi de &amp;ouml;ğrendim. Şu komutlarla codeTopic ve buna abone olan westworldSubscription'ı silebiliyoruz. Elbette bu tip oluşturma ve silme işlemlerini Google Cloud Platform arabirimi &amp;uuml;zerinden de yapabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;gcloud pubsub topics delete codeTopic
gcloud pubsub subscriptions delete westworldSubscription&lt;/pre&gt;
&lt;h1&gt;.Net Core Tarafı&lt;/h1&gt;
&lt;p&gt;Gelelim kod tarafına. Komut satırından &amp;ccedil;alışırken West-World &amp;uuml;zerinden gCloud aracılığıyla topic oluşturabileceğimi, bu topic i&amp;ccedil;in bir abonelik kullanabileceğimi ve mesaj g&amp;ouml;nderip okuyabileceğimi &amp;ouml;ğrenmiştim. Pek tabii bunu bir program kodu ile nasıl yapabileceğimi de keşfetmem&amp;nbsp;gerekiyordu. İlk olarak West-World'&amp;uuml;n en sevilen sakinlerinden olan Visual Studio Code'un kapısını &amp;ccedil;aldım. Ondan bana basit bir Console projesi a&amp;ccedil;masını istedim.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new console -o gcppubsubhello&lt;/pre&gt;
&lt;p&gt;Sonrasındaysa işimi kolaylaştıracak olan Google.Cloud.PubSub k&amp;uuml;t&amp;uuml;phanesinin yazıyı hazırladığım tarihte &amp;ouml;nerilen s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; projeye ekledim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet add package Google.Cloud.PubSub.V1 --version 1.0.0-beta16&lt;/pre&gt;
&lt;p&gt;Artık paketi kullanarak Pub/Sub API ile konuşmaya başlayabilirdim.&amp;nbsp;İlk olarak bir topic oluşturmayı ve bu topic i&amp;ccedil;in mesajlar yayınlamayı denedim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using Google.Cloud.PubSub.V1;

namespace gcppubsubhello
{
    class Program
    {
        static void Main(string[] args)
        {
            var projectId = "subtle-seer-193315";
            var topicId = "codeTopic";

            PublisherServiceApiClient psClient = PublisherServiceApiClient.Create();

            TopicName topicName = new TopicName(projectId, topicId);
            psClient.CreateTopic(topicName);
            IEnumerable&amp;lt;Topic&amp;gt; topics = psClient.ListTopics(new ProjectName(projectId));
            foreach (Topic t in topics)
                Console.WriteLine($"{t.Name}");

            PublisherClient publisher = PublisherClient.Create(topicName, new[] { psClient });
            var result = publisher.PublishAsync("Convert.ToQBit function");
            Console.WriteLine(result.Result);

            result = publisher.PublishAsync("GetFactorial function");
            Console.WriteLine(result.Result);           
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İşin başında PublisherServiceApiClient t&amp;uuml;r&amp;uuml;nden bir nesne oluşturmak gerekiyor. Bunu Create metodu ile sağlıyoruz. Sonrasında TopicName t&amp;uuml;r&amp;uuml;nden bir &amp;ouml;rnek oluşturuluyor. İlk parametre GCPdeki projenin ID değeri, diğeri ise topic i&amp;ccedil;in verilecek string bir bilgi(Topic ID) CreateTopic fonksiyonu&amp;nbsp;kullanılarak&amp;nbsp;ilgili Topic'in Google tarafında oluşturulması sağlanıyor. Ki &amp;ouml;rneği ilk &amp;ccedil;alıştırdığımda bunu g&amp;ouml;rebildim.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/gcpps_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ListTopics metodu ile var olan t&amp;uuml;m topic bilgilerini elde edebiliriz. Bende bunu denemek istedim. Mesaj yayınlamak i&amp;ccedil;inse bir PublisherClient &amp;ouml;rneğine ihtiya&amp;ccedil; var. Bunu oluştururken ilk parametre ile topic nesnesini, ikinci parametre ile de PublisherServiceApiClient &amp;ouml;rneğini veriyoruz. B&amp;ouml;ylece hangi Google projesinin hangi konusuna abone olacağımızı bildirmiş oluyoruz. Sonrası olduk&amp;ccedil;a kolay. PublishAsync fonksiyonunu kullanarak bir konu başlığına mesaj bırakılıyor. Ben &amp;ouml;rnek olarak iki tane string i&amp;ccedil;erik g&amp;ouml;nderdim. Sonu&amp;ccedil; olarak elde edilen bilgiler ise bu mesajlar i&amp;ccedil;in &amp;uuml;retilen AcknowledgeID değerleridir. Topic altına bırakılan her mesajın&lt;em&gt;(sonradan aynı i&amp;ccedil;eriğe sahip mesajlar tekrar geldiğinde farklı olacak şekilde)&lt;/em&gt; birer ackID değeri bulunur. Kodu arka arkaya &amp;ccedil;alıştırdığımda aşağıdaki sonu&amp;ccedil;ları elde ettim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/gcpps_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İlk &amp;ccedil;alıştırma normal sonu&amp;ccedil;lansa da ikinci &amp;ccedil;alıştırmada bir exception almıştım. Aslında hata olduk&amp;ccedil;a basitti.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;Unhandled Exception: Grpc.Core.RpcException: Status(StatusCode=AlreadyExists, Detail="Resource already exists in the project (resource=codeTopic).")&lt;/pre&gt;
&lt;p&gt;Zaten codeTopic isimli bir Topic vardı. Tekrar yaratmaya &amp;ccedil;alışınca bir &amp;ccedil;alışma zamanı istisnası oluştu. Bu gibi durumları engellemek i&amp;ccedil;in topic nesnesinin var olup olmadığını kontrol etmekte ve yoksa oluşturmaya &amp;ccedil;alışmakta yarar var. Silme işlemi i&amp;ccedil;in DeleteTopic fonksiyonu kullanılabilir. Oluşturulma adımıysa try...catch...when yapısı ile daha g&amp;uuml;venli hale getirilebilir. Ben bu kadarlık ipucu vereyim. Gerisini siz deneyin ;)&lt;/p&gt;
&lt;p&gt;Topic oluşturulması ve mesaj yayınlandığını g&amp;ouml;rmek benim i&amp;ccedil;in yeterliydi. Sıradaki adım codeTopic konusuna atılan mesajları okumaktı. İlk olarak bir abone&amp;nbsp;oluşturmak gerekiyor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var projectId = "subtle-seer-193315";
var topicId = "codeTopic";

TopicName topicName = new TopicName(projectId, topicId);
SubscriberServiceApiClient subsClient = SubscriberServiceApiClient.Create();
SubscriptionName subsName = new SubscriptionName(projectId, "einstein");
subsClient.CreateSubscription(subsName, topicName, pushConfig: null, ackDeadlineSeconds: 120);&lt;/pre&gt;
&lt;p&gt;Abone &amp;uuml;retme işi bu kez SubscriberServiceApiClient nesnesinde. Create metodu ile bu nesne &amp;ouml;rneklendikten sonra CreateSubscription fonksiyonu ile de aboneyi oluşturmaktayız. Abonemiz einstein isimli bir ID değerine sahip, Push değil de Pull modelini kullanan bir abone. Kodu ilk &amp;ccedil;alıştırdığımda abonenin my-starwars-game-project i&amp;ccedil;in başarılı bir şekilde oluşturulduğunu g&amp;ouml;rd&amp;uuml;m.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/gcpps_9.gif" alt="" width="640" height="173" /&gt;&lt;/p&gt;
&lt;p&gt;Pek tabii kodu ikince kez denediğimde zaten var olan bir aboneyi tekrar oluşturmaya &amp;ccedil;alıştığım i&amp;ccedil;in exception almam gayet normaldi.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;Grpc.Core.RpcException: Status(StatusCode=AlreadyExists, Detail="Resource already exists in the project (resource=einstein).")&lt;/pre&gt;
&lt;p&gt;&amp;Ccedil;&amp;ouml;z&amp;uuml;m olarak abonenin zaten var olup olmadığı kontrol edilebilir. Aynen Topic oluşturma vakasında olduğu gibi(Bunu benim i&amp;ccedil;in denersiniz değil mi? :) )&lt;/p&gt;
&lt;p&gt;Bir abonem olduğuna g&amp;ouml;re onu kullanarak codeTopic &amp;uuml;zerine bırakılan mesajları okumayı deneyebilirdim. İşte kodlar.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Linq;
using System.Text;
using System.Threading;
using Google.Cloud.PubSub.V1;

namespace gcppubsubhello
{
    class Program
    {
        static void Main(string[] args)
        {
            var projectId = "subtle-seer-193315";

            SubscriberServiceApiClient subsClient = SubscriberServiceApiClient.Create();
            SubscriptionName subsName = new SubscriptionName(projectId, "einstein");
            SubscriberClient einstein = SubscriberClient.Create(subsName, new[] { subsClient });
            bool acknowledge = false;
            einstein.StartAsync(
                async (PubsubMessage pubSubMessage, CancellationToken cancel) =&amp;gt;
                {
                    string msg = Encoding.UTF8.GetString(pubSubMessage.Data.ToArray());
                    await Console.Out.WriteLineAsync($"{pubSubMessage.MessageId}: {msg}");
                    return acknowledge ? SubscriberClient.Reply.Ack : SubscriberClient.Reply.Nack;
                });
            Thread.Sleep(5000);
            einstein.StopAsync(CancellationToken.None).Wait();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;B&amp;uuml;t&amp;uuml;n iş einstein isimli nesnede bitiyor. StartAync metodu i&amp;ccedil;erisinde, abonenin daha &amp;ouml;nceki kod par&amp;ccedil;asında oluşturulurken abone olduğu Topic &amp;uuml;st&amp;uuml;ne atılan mesajlar alınıyor. Ne kadar mesaj varsa gelecektir. Eğer mesaj başarılı bir şekilde alınabilmişse bu Reply.Ack ile ifade edilir(Message handled successfully) Aksi durumda Reply.Nack olur(Message not handled successfully)&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/gcpps_10.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi .Net Core tarafında uygun k&amp;uuml;t&amp;uuml;phaneleri kullanarak Pub/Sub API ile konuşmak olduk&amp;ccedil;a basit. Elbette yapılabilecek bir &amp;ccedil;ok şey var. S&amp;ouml;z gelimi bu &amp;ouml;rnekte .Net Core uygulaması Google hizmetini kullanırken hi&amp;ccedil;bir credential bilgisi kullanmadık. Nitekim West-World'e &amp;ccedil;ok &amp;ouml;nceden&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;export GOOGLE_APPLICATION_CREDENTIALS="my-starwars-game-project-d977a50a19f5.json"&lt;/pre&gt;
&lt;p&gt;şeklinde bir terminal komutu ile gerekli credential bilgilerini işlemiştim. Eğer yazdığımız &amp;uuml;r&amp;uuml;n&amp;uuml; bir sunucuya atacak ve oradan Google Pub/Sub hizmetini kullandırmak isteyeceksek bu tip Credential bilgilerini de kod tarafında y&amp;uuml;klememiz gerekebilir. Bunun nasıl yapılabileceği ile ilgili olarak Google'ın &lt;a href="https://cloud.google.com/docs/authentication/production" target="_blank"&gt;şu adresindeki yazıya&lt;/a&gt; bakabilirsiniz.&lt;/p&gt;
&lt;p&gt;Benim i&amp;ccedil;in sıradaki aşama bir Google fonksiyonunu Pub/Sub API &amp;uuml;zerinden tetikletmek. Yani yazının başında bahsettiğim vakadaki &amp;ccedil;alışmanın minik bir hattını canlandırmaya &amp;ccedil;alışmak. Bakalım yolda karşıma &amp;ouml;ğrenmem gereken daha neler neler &amp;ccedil;ıkacak. Siz buradaki kullanım şekillerini geliştirerek ilerlemeye devam edebilirsiniz. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2018-07-19 21:10:00</pubDate>
  <slug>Google-Cloud-PubSub-Service-Macerası</slug>
  <tags>
    <tag>google</tag>
    <tag>google-cloud-platform</tag>
    <tag>publisher-subscriber-model</tag>
    <tag>machine-learning</tag>
    <tag>image-processing</tag>
    <tag>gcloud</tag>
    <tag>http</tag>
    <tag>net-core</tag>
    <tag>go</tag>
    <tag>go-programming-language</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
    <category>GCP</category>
  </categories>
</post>