<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF Rest Starter Kit Preview 2 ile Twitter Reader</title>
  <description>Örneğin, XML içeriğini managed tarafta kolayca ele alabilmemiz için gerekli tiplerin üretimini kolaylaştıran Paste XML As Types Laughing Örneği geliştirebilmek için çok sık kullanmasamda Twitter' da bir hesap oluşturdum ve bildiğim geliştiricilerin Tweet' lerini takip etmeye başladım. İşe başlamadan önce, Twitter'da ne olup bittiğine bir bakayım dedim.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f8%2fblg56_giris.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Minik bir &amp;ccedil;ocukken Televizyon bağımlılığı&lt;em&gt;(Malesef bu aptal kutuda &amp;ccedil;ok vakiy ge&amp;ccedil;irebiliyor &amp;ccedil;ocuklar &lt;img title="Frown" src="/editors/tiny_mce3/plugins/emotions/img/smiley-frown.gif" alt="Frown" border="0" /&gt;&amp;nbsp;)&lt;/em&gt; nedeniyle pek &amp;ccedil;ok &amp;ccedil;izgi filmi izlediğimi hatırlıyorum. Voltran, Transformers, Red Kit ve Daltonlar, Denver The Last Dinasour, Clementine filan derken arada sıradada "Bi kedi g&amp;ouml;rd&amp;uuml;m sanki" diyen Tweety&amp;nbsp;&lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt; Şimdi bu konuya nereden geldiğimi d&amp;uuml;ş&amp;uuml;nebilirsiniz. Şu sıralarda sık sık takip ettiğim &lt;strong&gt;geekswithblogs&lt;/strong&gt; sitesinde twitter' da&lt;em&gt;(Sanırım niye cikcik diyerek yazımıza başladığımızı anlamışsınızdır&amp;nbsp;&lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt; )&amp;nbsp;&lt;/em&gt;yayınlanan i&amp;ccedil;eriklerin &lt;strong&gt;WCF Rest Starter Kit Preview 2&lt;/strong&gt; ile birlikte gelen &lt;strong&gt;HttpClient&lt;/strong&gt; sınıfı yardımıyla nasıl kolayca ele alınabileceğine dair bazı yazılar g&amp;ouml;rd&amp;uuml;m.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;Konunun i&amp;ccedil;erisinde &lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;REST &lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt;bazlı iletişim ve &lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;WCF&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; s&amp;ouml;z konusu olunca hemen kolları sıvadım ve Windows tabanlı basit bir &amp;ouml;rnek geliştirmeye karar verdim. Tabi başlamadan &amp;ouml;nce projemizin amacından biraz bahsetmek isterim. &lt;/span&gt;&lt;a style="line-height: 1.8;" title="Twitter" href="http://twitter.com/"&gt;Twitter &lt;/a&gt;&lt;span style="line-height: 1.8;"&gt;&amp;uuml;zerinde yayınlanan girişleri &lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;HTTP&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; &amp;uuml;zerinden &lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;GET&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; metodu ile &amp;ccedil;ekmeyi, buna g&amp;ouml;re eklenen g&amp;uuml;ncel i&amp;ccedil;erikleri uygulamamızda g&amp;ouml;stermeyi ve yenilerinide kendi &lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;Twitter&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; hesabımız &amp;uuml;zerinden, &lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;HTTP Post&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; metodu ile ekleyebilmeyi planlıyoruz. Aslında olay bir RSS Reader yazmak kadar basit. Diğer yandan burada bahsettiğimiz işlevsellikleri geliştirmek i&amp;ccedil;in elimizde &lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;WCF Rest Starter Kit Preview 2&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; olmasına da gerek yoktur. Ancak Kit' in bize sağladığı bazı avantajlar ve kolaylıklar bulunmaktadır. &lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;&amp;Ouml;rneğin, XML i&amp;ccedil;eriğini managed tarafta kolayca ele alabilmemiz i&amp;ccedil;in gerekli tiplerin &amp;uuml;retimini kolaylaştıran &lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;Paste XML As Types&amp;nbsp;&lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; &amp;Ouml;rneği geliştirebilmek i&amp;ccedil;in &amp;ccedil;ok sık kullanmasamda Twitter' da bir hesap oluşturdum ve bildiğim geliştiricilerin Tweet' lerini takip etmeye başladım. İşe başlamadan &amp;ouml;nce, Twitter'da ne olup bittiğine bir bakayım dedim.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg56_Twitter.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İşte buradaki i&amp;ccedil;eriği Windows Uygulamasına &amp;ccedil;ekmeyi hedefliyoruz. Rest Starter Kit' in nimetlerinden yararlanabilmek i&amp;ccedil;in, Windows uygulamasını oluşturulduktan sonra, WCF Rest Starter Kit Preview 2 ile birlikte gelen &lt;strong&gt;Microsoft.Http&lt;/strong&gt; ve &lt;strong&gt;Microsoft.Http.Extensions&lt;/strong&gt; assembly' larının projeye referans edilmesi gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg56_WindowsReferences.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Referansların eklenmesinden sonra yolumuza, Twitter' da yayınlanan Feed i&amp;ccedil;eriğinin managed taraftaki karşılıklarını oluşturarak devam edebiliriz. Bu noktada, &lt;a href="http://twitter.com/statuses/friends_timeline.xml"&gt;http://twitter.com/statuses/friends_timeline.xml&lt;/a&gt; adresinde keni twitter hesabım ile baktığımda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan XML i&amp;ccedil;eriği ile karşılaştığımı g&amp;ouml;rd&amp;uuml;m.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg56_TwitterTimelineXML.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu i&amp;ccedil;eriği sayfanın &lt;strong&gt;View Source&lt;/strong&gt; kısmını kullanarak kopyalayıp, &lt;strong&gt;Paste XML as Types&lt;/strong&gt; se&amp;ccedil;eneğini yardımıyla&lt;em&gt;(WCF Rest Starter Kit Preview 2 ile Visual Studio 2008 ortamına eklenmiştir)&lt;/em&gt; y&amp;ouml;netimli kod tarafına d&amp;ouml;n&amp;uuml;şt&amp;uuml;rebiliriz. &lt;em&gt;(Burada XML i&amp;ccedil;eriğinden managed tipleri oluştururken dikkat edilmesi gereken noktalardan birisi, &lt;strong&gt;https&lt;/strong&gt; değil &lt;strong&gt;http&lt;/strong&gt; ile talepte bulunmamızdır. Aksi durumda &lt;strong&gt;View Source&lt;/strong&gt; se&amp;ccedil;eneği &amp;ccedil;alışmamaktadır.)&lt;/em&gt; Diğer taraftan bu adres talebi sonrası var olan twitter hesabımız ile giriş yapmamız gerekmektedir. İşlem başarılı bir şekilde tamamlandığında sınıf diagramında aşağıdaki tiplerin oluştuğunu g&amp;ouml;zlemledim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg56_ClassDiagram.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Harika! G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere XML i&amp;ccedil;eriğinin karşılığı olan sınıflar başarılı bir şekilde oluşturulmuştur. Dikkat edilmesi gereken noktalardan birisi, XML deki Child Node bağlantılarının sınıf bazında nasıl ifade edildiğidir. &amp;Ouml;rneğin &lt;strong&gt;statuses&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde &lt;strong&gt;statusesStatus&lt;/strong&gt; tipinden bir dizi olarak tanımlanmış &lt;strong&gt;status&lt;/strong&gt; &amp;ouml;zelliği... Bu &amp;ouml;zelliği kod tarafında değerlendirerek, &lt;strong&gt;tweet&lt;/strong&gt; i&amp;ccedil;eriğini giren &lt;strong&gt;User'&lt;/strong&gt; a dahi ulaşabiliriz. Nitekim bunun i&amp;ccedil;in &lt;strong&gt;statusesStatus&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde, &lt;strong&gt;statusesStatusUser&lt;/strong&gt; tipinden &lt;strong&gt;user&lt;/strong&gt; isimli bir &amp;ouml;zellik tanımlanmıştır. Zaten işin en &amp;ouml;nemli kısımlarından biriside bu XML i&amp;ccedil;eriğinin, kod tarafınaki ifade şekli değil midir? Teşekk&amp;uuml;rler &lt;strong&gt;Paste Xml As Types&lt;/strong&gt;&amp;nbsp;&lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt; Managed tiplerde oluşturulduğuna g&amp;ouml;re artık arka plan kodlarımızı geliştirebiliriz. &lt;em&gt;(Hemen şunu hatırlatalım.Paste Xml As Types ile &amp;uuml;retilen sınıf ve &amp;uuml;yelerinin adlarını dilediğiniz gibi değiştirebilirsiniz. &amp;Ouml;zellikle yazım standartlarına uygun-CamelCasing isimlendirmeler yapılmasında yarar vardır. Şu an &amp;ouml;rneği hızlı bir şekilde geliştirme istediğinde bu noktaları atlamış bulunuyorum)&lt;/em&gt; Windows Form' unu aşağıdaki gibi tasarlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg56_Form.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve kodlarımız;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Net;
using System.Windows.Forms;
using System.Xml.Serialization;  // ReadAsXmlSerializable&amp;lt;&amp;gt; genişletme metodunun &amp;ccedil;ıkması i&amp;ccedil;in eklenmelidir.
using Microsoft.Http;// HttpClient i&amp;ccedil;in gerekli olan isim alanı.
using System.Drawing;

namespace TwitterReader
{
    public partial class Form1 : Form
    {
        // Siz kendi Twiteer kullanıcı adı ve şifrenizi kullanmalısınız.
        private string username = "sizin kullanıcı adınız"; 
        private string password = "sizin şifreniz";

        public Form1()
        {
            InitializeComponent();
        }

        private void btnGetFeeds_Click(object sender, EventArgs e)
        {
            try
            {
                pnlFeeds.Controls.Clear();

                // &amp;Ouml;ncelikle HttpClient nesne &amp;ouml;rneği oluşturulur.
                HttpClient client = new HttpClient();
                // Xml verisini yukarıdaki adresten &amp;ccedil;ekebilmek i&amp;ccedil;in ge&amp;ccedil;erli bir Twitter hesabı ile erişmemiz gerekecektir. Bu nedenle NetworkCredential oluşturulur ve Credentials koleksiyonuna eklenir.
                client.TransportSettings.Credentials = new NetworkCredential(username, password);
                ServicePointManager.Expect100Continue = false;

                // XML i&amp;ccedil;eriğine, HttpClient nesne &amp;ouml;rneği &amp;uuml;zerinden GET talebinde bulunulur. Sonu&amp;ccedil; HttpResponseMessage nesne &amp;ouml;rneğine aktarılır.
                HttpResponseMessage response = client.Get("http://twitter.com/statuses/friends_timeline.xml");
                // İşlemin başarılı olunduğundan emin olunması sağlanır. HTTP 200 OK Kontrolu
                response.EnsureStatusIsSuccessful();

                // XML İ&amp;ccedil;eriği okunur ve statuses tipinden nesne &amp;ouml;rneğine aktarılır.
                statuses stats = response.Content.ReadAsXmlSerializable&amp;lt;statuses&amp;gt;();

                // statuses nesne &amp;ouml;rneğinin status &amp;ouml;zelliği ile işaret edilen statusesStatus tipinden dizinin her bir elemanı dolaşılır.
                foreach (statusesStatus s in stats.status)
                {
                    // &amp;Ouml;rnek i&amp;ccedil;eriği g&amp;ouml;stermek amacıyla her bir statusesStatus i&amp;ccedil;in birer Label &amp;uuml;retilir

                    Label lbl = new Label();
                    lbl.AutoSize = false;
                    lbl.Width = pnlFeeds.Width - 25;
                    lbl.BorderStyle = BorderStyle.FixedSingle;
                    lbl.Height = 75;
                    // &amp;Ouml;rnek bilgi olarak bilginin ne zaman eklendiği, i&amp;ccedil;eriği ve kim tarafından oluşturulduğu ele alınır
                    lbl.Text = string.Format("{0} \n {1} ({2})", s.created_at, s.text, s.user.name);

                    pnlFeeds.Controls.Add(lbl);
                }
            }
            catch
            {
                lblStatus.Text = "Error!";
            }
        }

        private void btnPostNew_Click(object sender, EventArgs e)
        {
            try
            {
                // &amp;Ouml;ncelikle HttpClient nesne &amp;ouml;rneği oluşturulur. Parametre olarak takip edeceğimiz twitter adresi girilir.
                HttpClient client = new HttpClient("http://twitter.com/statuses/");
                // Xml verisini yukarıdaki adresten &amp;ccedil;ekebilmek i&amp;ccedil;in ge&amp;ccedil;erli bir Twitter hesabı ile erişmemiz gerekecektir. Bu nedenle NetworkCredential oluşturulur ve Credentials koleksiyonuna eklenir.
                client.TransportSettings.Credentials = new NetworkCredential(username, password);
                ServicePointManager.Expect100Continue = false;

                HttpResponseMessage response = client.Get("friends_timeline.xml");

                // Yeni bilgi girişi i&amp;ccedil;in bir form oluşturulur
                HttpUrlEncodedForm form = new HttpUrlEncodedForm();
                // status i&amp;ccedil;in TextBox1 kontrol&amp;uuml;n&amp;uuml;n i&amp;ccedil;eriğinin girileceği belirtilir
                form.Add("status", txtEntry.Text);
                // Bu kez HTTP Post metoduna g&amp;ouml;re update.xml adresine form i&amp;ccedil;eriği g&amp;ouml;nderilir
                response = client.Post("update.xml", form.CreateHttpContent());
                // İşlemin başarılı olduğundan emin olunur
                response.EnsureStatusIsSuccessful();

                lblStatus.Text = "Entry posted.";
            }
            catch
            {
                lblStatus.ForeColor = Color.Red;
                lblStatus.Text = "Aaa...Houston...We have a problem...";
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rneğimizi &amp;ccedil;alıştırıp Get Feed başlıklı Button kontrol&amp;uuml;ne tıkladığımda aşağıdakine benzer sonu&amp;ccedil;lar ile karşılaştım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg56_GetFeeds.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &amp;ouml;rneği geliştirdiğim sıradaki t&amp;uuml;m Tweet girişlerini elde edebilmiştim. Evet, tasarım biraz k&amp;ouml;t&amp;uuml;&amp;nbsp;&lt;img title="Embarassed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-embarassed.gif" alt="Embarassed" border="0" /&gt; Hatta &amp;ccedil;ok k&amp;ouml;t&amp;uuml;&amp;nbsp;&lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt; Dahada g&amp;uuml;zelleştirilmesini size bırakıyorum.&lt;/p&gt;
&lt;p&gt;Peki yeni bir Tweet girdiğimizde. &amp;Ouml;rneğin aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki gibi,&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg56_PostNewFeed.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İşlem başarılı olduktan sonra Twitter sitesine baktığımda aşağıdaki gibi yeni Tweet' in eklenmiş olduğunu g&amp;ouml;rd&amp;uuml;m. Bu arada tweet' in kaynağı olarak &lt;strong&gt;from API&lt;/strong&gt; yazdığına dikkat edin. Bu dış ortama sunulan &lt;strong&gt;Twitter API&lt;/strong&gt; yardımıyla bir giriş yaptığımızı ifade etmektedir. Peki biz bu &lt;strong&gt;API&lt;/strong&gt; i&amp;ccedil;in projemize bir referans ekledik mi? Hayır. Nitekim API'yi &lt;strong&gt;REST&lt;/strong&gt; bazlı olarak kullanıyoruz. İşte işin g&amp;uuml;zel yanlarından birisi daha.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg56_NewTweetLast.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Windows uygulamasında tekrardan &lt;strong&gt;Get Feed&lt;/strong&gt; d&amp;uuml;ğmesini kullandığımda aşağıdaki gibi son eklenen Tweet bilgisinin de geldiğini g&amp;ouml;rd&amp;uuml;m.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg56_PostNewFeedWin.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında web &amp;uuml;zerinden takip edilen Tweet i&amp;ccedil;eriğinin bir Windows uygulaması yerine zengin g&amp;ouml;rselliğe sahip bir &lt;strong&gt;WPF&lt;/strong&gt; uygulamasında ele alınması &amp;ccedil;ok daha şık sonu&amp;ccedil;lar doğurabilir. Bu &amp;ouml;rnekte bizim i&amp;ccedil;in dikkate değer olan noktalardan biriside, &lt;strong&gt;WCF Rest Starter Kit Preview 2&lt;/strong&gt; ile birlikte gelen &lt;strong&gt;HttpClient&lt;/strong&gt;,&lt;strong&gt; Paste Xml As Types&lt;/strong&gt; gibi yeniliklerin, ger&amp;ccedil;ek hayat senaryosunda başarılı bir şekilde ele alınabilmiş olmasıdır.&lt;/p&gt;
&lt;p&gt;Peki &amp;ouml;rnekte yapmadıklarım neler?&lt;/p&gt;
&lt;p&gt;Her şeyden &amp;ouml;nce asenkron bir erişim s&amp;ouml;z konusu değildir. Bu nedenle verilerin &amp;ccedil;ekilmesi veya yeni bir Tweet' in eklenmesi sırasında ekranda donmalar olmaktadır. Diğer taraftan &amp;ccedil;ok g&amp;uuml;&amp;ccedil;l&amp;uuml; bir Exception y&amp;ouml;netimiz yok. Belki bir loglama sistemi koyarark Exception' ların uygulamayı geliştirenler i&amp;ccedil;in saklanması sağlanabilir. &amp;Ouml;rneği geliştirirken bir Exception almamış olmama rağmen Tweet bilgilerinin &amp;ccedil;ekilmesi sırasında bağlantıdaki aksaklıklar nedeni ile &lt;strong&gt;Time out&lt;/strong&gt; istisnalarına d&amp;uuml;ş&amp;uuml;lebileceğini tahmin ediyorum. Bunu kod i&amp;ccedil;erisinde kontroll&amp;uuml; bir şekilde ele almak yerinde olacaktır. Diğer taraftan &lt;strong&gt;Button&lt;/strong&gt; kontrol&amp;uuml; yardımıyla veri &amp;ccedil;ekmek yerine, kullanıcının kendisinin set edebileceği zaman dilimleri i&amp;ccedil;erisinde veri &amp;ccedil;ekilmesi sağlanabilir. Bu işi bir &lt;strong&gt;Timer&lt;/strong&gt; bileşeni kolayca halledebilir. Birde tasarım konusunda beni takip etmemenizi &amp;ouml;neririm&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Bunları deneyin ve &amp;ccedil;ok daha iyisini yapmaya &amp;ccedil;alışın. Umarım yararlı bir yazı olmuştur. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f8%2fTwitterReader.rar"&gt;TwitterReader.rar (187,66 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-08-04 23:47:00</pubDate>
  <slug>WCF-Rest-Starter-Kit-Preview-2-ile-Twitter-Reader</slug>
  <tags>
    <tag>wcf</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>