<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net 2.0 DetailsView Kontrolü ile Insert,Update,Delete</title>
  <description>Bu makalemizde, Whidbey ile gelen yeni kontrollerden birisi olan DetailsView bileşeni ile, satır ekleme, silme ve güncelleme gibi işlemlerin nasıl yapıldığını incelemeye çalışacağız. Bununla birlikte öncesinde, DetailsView kontrolünü genel hatları ile kısaca araştıracağız. DetailsView kontrolü, Asp.Net 2.0' a eklenen yeni data-bound kontrollerinden birisidir. Bu kontrolün en büyük özelliği, t zamanında sadece bir satır verinin gösterilmesini sağlamasıdır. Bu noktada GridView kontrolünden ayrılmasına rağmen, bir veri kümesi üzerinden navigasyon linkleri yardımıyla hareket edilmesinede izin verir.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bu makalemizde, Whidbey ile gelen yeni kontrollerden birisi olan DetailsView bileşeni ile, satır ekleme, silme ve g&amp;uuml;ncelleme gibi işlemlerin nasıl yapıldığını incelemeye &amp;ccedil;alışacağız. Bununla birlikte &amp;ouml;ncesinde, DetailsView kontrol&amp;uuml;n&amp;uuml; genel hatları ile kısaca araştıracağız. DetailsView kontrol&amp;uuml;, Asp.Net 2.0' a eklenen yeni data-bound kontrollerinden birisidir. Bu kontrol&amp;uuml;n en b&amp;uuml;y&amp;uuml;k &amp;ouml;zelliği, t zamanında sadece bir satır verinin g&amp;ouml;sterilmesini sağlamasıdır. Bu noktada GridView kontrol&amp;uuml;nden ayrılmasına rağmen, bir veri k&amp;uuml;mesi &amp;uuml;zerinden navigasyon linkleri yardımıyla hareket edilmesinede izin verir. Konuyu daha iyi anlayabilmek i&amp;ccedil;in, bir &amp;ouml;nceki makalemizde yer alan Access veritabanımızı kullanacağımız bir &amp;ouml;rnek geliştireceğiz. Bu &amp;ouml;rneğimizde de, Access veri kaynağımıza bağlanmak ve Select, Insert, Update, Delete işlemlerini ger&amp;ccedil;ekleştirebilmek amacıyla bir AccessDataSource bileşeni kullanacağız. Bu bileşenimizi aşağıdaki aspx kodları ile oluşturalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:AccessDataSource ID="AccessDataSource1" Runat="server" DataFile="Data/veriler.mdb" SelectCommand="Select * From MailListesi" InsertCommand="Insert Into MailListesi (Ad,Soyad,Mail) Values (@Ad,@Soyad,@Mail)" UpdateCommand="Update MailListesi Set Ad=@Ad,Soyad=@Soyad,Mail=@Mail Where ID=@ID" DeleteCommand="Delete From MailListesi Where ID=@ID"&amp;gt;
    &amp;lt;InsertParameters&amp;gt;
        &amp;lt;asp:Parameter Name="Ad"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
        &amp;lt;asp:Parameter Name="Soyad"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
        &amp;lt;asp:Parameter Name="Mail"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
    &amp;lt;/InsertParameters&amp;gt;
    &amp;lt;UpdateParameters&amp;gt;
        &amp;lt;asp:Parameter Name="Ad"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
        &amp;lt;asp:Parameter Name="Soyad"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
        &amp;lt;asp:Parameter Name="Mail"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
        &amp;lt;asp:Parameter Name="ID"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
    &amp;lt;/UpdateParameters&amp;gt;
    &amp;lt;DeleteParameters&amp;gt;
        &amp;lt;asp:Parameter Name="ID"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
    &amp;lt;/DeleteParameters&amp;gt;
&amp;lt;/asp:AccessDataSource&amp;gt;&lt;/pre&gt;
&lt;p&gt;AccessDataSource kontrol&amp;uuml;m&amp;uuml;z, bağlanacağı veri bileşeni &amp;uuml;zerinde, Select, Update, Insert ve Delete işlemlerinin ger&amp;ccedil;eklşetirilebilmesini sağlamak amacıyla, SelectCommand, InsertCommand, DeleteCommand ve UpdateCommand &amp;ouml;zelliklerini kullanmaktadır. &amp;Ouml;zellikle veri girişi, g&amp;uuml;ncelleme ve silme işlemleri i&amp;ccedil;in kullanılan sorgular, parametreler i&amp;ccedil;ermektedir.&lt;/p&gt;
&lt;p&gt;Bu parametreleri, hangi komut i&amp;ccedil;in kullanacak isek, o komuta ait parametre koleksiyonuna birer Parameter nesnesi olarak eklemeliyiz. Bu nedenle, InsertParameters, UpdateParameters ve DeleteParameters koleksiyonları kullanılmıştır. Bunun dışında, AccessDataSource kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n, hangi access veritabanına bağlanacağını, DataFile &amp;ouml;zelliğine atadığımız dosya yol bilgisi ile belirliyoruz. Gelelim, DetailsView kontrol&amp;uuml;m&amp;uuml;ze. İlk aşamada bu kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; aşağıdaki aspx kodları ile oluşturalım.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:DetailsView ID="DetailsView1" Runat="server" DataSourceID="AccessDataSource1"
AllowPaging="True" PagerSettings-Mode="NextPreviousFirstLast" AutoGenerateInsertButton="True" AutoGenerateEditButton="True" AutoGenerateDeleteButton="True" Font-Names="Verdana" Font-Size="X-Small" DataKeyNames="ID"&amp;gt;
&amp;lt;/asp:DetailsView&amp;gt;&lt;/pre&gt;
&lt;p&gt;DetailsView kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n, DataSourceID &amp;ouml;zelliğine atadığımız bileşen adı ile, hangi veri kaynağını ve sql sorgularını kullanacağını belirliyoruz. AllowPaging &amp;ouml;zelliği, her nekadar GridView' daki sayfalama &amp;ouml;zelliğini &amp;ccedil;ağrıştırsada burada sayfa numarası yerine, satır numaralarını temsil etmektedir. Yani n sayıda kaydı olan bir veri k&amp;uuml;mesi i&amp;ccedil;in, n adet sayfa numarası yer alacaktır. &amp;Ccedil;&amp;uuml;nk&amp;uuml; DetailsView bileşeni, bir anda yanlız bir satırı ekranda g&amp;ouml;stermektedir. Bununla birlikte, sayfalama g&amp;ouml;steriminin ne şekilde olacağını belirtmek amacıyla, PagerSettings-Mode &amp;ouml;zelliği kullanılmıştır. Burada verdiğimiz değer haricinde atayabileceğimiz diğer değerlerde şunlardır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk90_1.gif" alt="" width="329" height="92" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. PagerSettings-Mode değerleri.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;AutoGenerateInsertButton &amp;ouml;zelliği bileşende satır ekleme i&amp;ccedil;in gerekli linkerlin g&amp;ouml;sterilmesini sağlar. Benzer şekilde, AutoGenerateEditButton &amp;ouml;zelliğide, d&amp;uuml;zenleme linklerinin g&amp;ouml;sterilmesini sağlar. Son olarak AutoGenerateDeleteButton &amp;ouml;zelliğide Delete linkinin g&amp;ouml;sterilmesini sağlamaktadır. Elbette bileşenimiz i&amp;ccedil;in kilit noktalardan biriside, DataKeyNames &amp;ouml;zelliğine atanan Field değeridir. Bu değer, &amp;ouml;nceki makalelerimizdende hatırlayacağınız gibi, Update ve Delete sorguları (hatta bazı durumlarda Select sorgusu) i&amp;ccedil;inde kullanılacak Primary Key alanını ifade etmektedir. Nitekim, tek bir satır &amp;uuml;zerinde yapılacak g&amp;uuml;ncelleme ve silme işlemleri, o satırın benzersiz bir numara ile ifade edilebilmesi halinde başarıya ulaşacaktır. İşte bu noktada primary key alanları b&amp;uuml;y&amp;uuml;k &amp;ouml;nem kazanır. Sayfamızı bu haliyle &amp;ccedil;alıştırdığımız takdirde aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk90_2.gif" alt="" width="271" height="245" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. Uygulamanın &amp;ccedil;alışması sonucu.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, bir anda sayfada sadece tek bir satıra ait veriler g&amp;ouml;r&amp;uuml;lmektedir. Veri k&amp;uuml;mesinin Select sorgusu ile elde edilen satırlar arasında gezebilmek i&amp;ccedil;in, Navigasyon linkeri kullanılır. Burada standart olarak bileşenimiz, Select sorgusuna g&amp;ouml;re t&amp;uuml;m Field' ları getirmiştir. Ancak dilersek sadece belirli Field' ların kontrol&amp;uuml;m&amp;uuml;zde g&amp;ouml;r&amp;uuml;nmesini sağlayabiliriz. Nasıl ki, GridView kontrol&amp;uuml;nde bu iş i&amp;ccedil;in kullandığımız Columns koleksiyonu varsa, DetailsView bileşnindede aynı işi yapan Fields koleksiyonu vardır. Elbette koleksiyon isminin Fields olması tesad&amp;uuml;fi değildir. Nitekim, DetailsView bileşeni, satırlarını Field bazında g&amp;ouml;sterir. Oysa GridView k&amp;uuml;me bazında ve s&amp;uuml;tunları esas alarak g&amp;ouml;stermektedir. Dolayısıyla bileşenimizin aspx kodlarını aşağıdaki gibi d&amp;uuml;zenleyerek sadece belirli field' ların g&amp;ouml;r&amp;uuml;nmesini sağlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:DetailsView ID="DetailsView1" Runat="server" DataSourceID="AccessDataSource1"
AllowPaging="True" PagerSettings-Mode="NextPreviousFirstLast" AutoGenerateInsertButton="True" AutoGenerateEditButton="True" AutoGenerateDeleteButton="True" Font-Names="Verdana" Font-Size="X-Small" DataKeyNames="ID" AutoGenerateRows="false"&amp;gt;
    &amp;lt;Fields&amp;gt; 
        &amp;lt;asp:BoundField DataField="Ad" HeaderText="Adı"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
        &amp;lt;asp:BoundField DataField="Soyad" HeaderText="Soyadı"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
        &amp;lt;asp:BoundField DataField="Mail" HeaderText="Mail Adresi"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
    &amp;lt;/Fields&amp;gt;
&amp;lt;/asp:DetailsView&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu haliyle sayfamızı a&amp;ccedil;tığımızda, aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz. Dikkat edecek olursanız sadece Ad,Soyad ve Mail alanları g&amp;ouml;r&amp;uuml;nmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk90_3.gif" alt="" width="268" height="230" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. Kendi belirlediğimiz alanların g&amp;ouml;sterilmesi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Burada, AutoGenerateRows &amp;ouml;zelliğine dikkat etmenizi istiyorum. Bu &amp;ouml;zelliğe false değerini vermeseydik eğer, Select sorgusundan alınan t&amp;uuml;m alanlar g&amp;ouml;sterilecek ve sonrada bizim belirlediğimiz alanlar ekrana gelecekti. Aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk90_4.gif" alt="" width="269" height="283" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. AutoGenerateRows &amp;ouml;zelliğine false değeri vermeseydik.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Artık bileşnimiz yardımıyla, satır ekleme, silme ve g&amp;uuml;ncelleme işlemlerini kolayca ger&amp;ccedil;ekleştirebiliriz. Son olarak, sayfamızın kodlarını aşağıdaki hale getirerek sayfamızı ve en &amp;ouml;enmlisi DetalisView bileşenimizi biraz makyajlayalım.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" CompileWith="Default.aspx.cs" ClassName="Default_aspx" %&amp;gt;
&amp;lt;!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd"&amp;gt;
&amp;lt;html xmlns="http://www.w3.org/1999/xhtml" &amp;gt;
&amp;lt;head runat="server"&amp;gt;
&amp;lt;title&amp;gt;Untitled Page&amp;lt;/title&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body&amp;gt;
    &amp;lt;form id="form1" runat="server"&amp;gt;
    &amp;lt;div&amp;gt;
        &amp;lt;asp:AccessDataSource ID="AccessDataSource1" Runat="server" DataFile="Data/veriler.mdb" SelectCommand="Select * From MailListesi" InsertCommand="Insert Into MailListesi (Ad,Soyad,Mail) Values (@Ad,@Soyad,@Mail)" UpdateCommand="Update MailListesi Set Ad=@Ad,Soyad=@Soyad,Mail=@Mail Where ID=@ID" DeleteCommand="Delete From MailListesi Where ID=@ID"&amp;gt;
            &amp;lt;InsertParameters&amp;gt;
                &amp;lt;asp:Parameter Name="Ad"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
                &amp;lt;asp:Parameter Name="Soyad"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
                &amp;lt;asp:Parameter Name="Mail"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
            &amp;lt;/InsertParameters&amp;gt;
            &amp;lt;UpdateParameters&amp;gt;
                &amp;lt;asp:Parameter Name="Ad"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
                &amp;lt;asp:Parameter Name="Soyad"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
                &amp;lt;asp:Parameter Name="Mail"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
                &amp;lt;asp:Parameter Name="ID"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
            &amp;lt;/UpdateParameters&amp;gt;
            &amp;lt;DeleteParameters&amp;gt;
                &amp;lt;asp:Parameter Name="ID"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
            &amp;lt;/DeleteParameters&amp;gt;
        &amp;lt;/asp:AccessDataSource&amp;gt;&amp;lt;br /&amp;gt;
        &amp;lt;span style="font-size: 24pt; color: #663333; font-family: Agency FB"&amp;gt;&amp;lt;b&amp;gt;Mail Listesi&amp;lt;br /&amp;gt;
        &amp;lt;/b&amp;gt;&amp;lt;/span&amp;gt;
        &amp;lt;asp:DetailsView ID="DetailsView1" Runat="server" DataSourceID="AccessDataSource1"
AllowPaging="True" PagerSettings-Mode="NextPreviousFirstLast" AutoGenerateInsertButton="True" AutoGenerateEditButton="True" AutoGenerateDeleteButton="True" Font-Names="Verdana" Font-Size="X-Small" DataKeyNames="ID" CellPadding="4" BorderColor="#DEDFDE" GridLines="Vertical" BorderWidth="1px" ForeColor="Black" BackColor="White" AutoGenerateRows="False" BorderStyle="None"&amp;gt; 
            &amp;lt;FooterStyle BackColor="#CCCC99"&amp;gt;&amp;lt;/FooterStyle&amp;gt;
            &amp;lt;RowStyle BackColor="#F7F7DE"&amp;gt;&amp;lt;/RowStyle&amp;gt;
            &amp;lt;PagerStyle ForeColor="Black" HorizontalAlign="Right" BackColor="#F7F7DE"&amp;gt;&amp;lt;/PagerStyle&amp;gt;
            &amp;lt;Fields&amp;gt; 
                &amp;lt;asp:BoundField DataField="Ad" HeaderText="Adı"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
                &amp;lt;asp:BoundField DataField="Soyad" HeaderText="Soyadı"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
                &amp;lt;asp:BoundField DataField="Mail" HeaderText="Mail Adresi"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
            &amp;lt;/Fields&amp;gt;
            &amp;lt;HeaderStyle ForeColor="White" Font-Bold="True" BackColor="#6B696B"&amp;gt;&amp;lt;/HeaderStyle&amp;gt;
            &amp;lt;EditRowStyle ForeColor="White" Font-Bold="True" BackColor="#CE5D5A"&amp;gt;&amp;lt;/EditRowStyle&amp;gt;
            &amp;lt;AlternatingRowStyle BackColor="White"&amp;gt;&amp;lt;/AlternatingRowStyle&amp;gt;
        &amp;lt;/asp:DetailsView&amp;gt;
    &amp;lt;/div&amp;gt;
    &amp;lt;/form&amp;gt;
&amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk90_5.gif" alt="" width="249" height="173" border="0" /&gt;&lt;img src="/makale/images/mk90_6.gif" alt="" width="259" height="183" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 5. DetailsView bileşenin makyajlanmış hali ve New linkine tıklandığında.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek olarak, Yeni bir satır girdiğimizde, bu satırını başarılı bir şekilde veri kayanağına eklendiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z. &amp;Ouml;rneğin, aşağıdaki kayıt bilgisini Insert linki ile eklediğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk90_7.gif" alt="" width="262" height="179" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 6. Yeni satır verisi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Insert linkine bastıktan sonra, tekrar son satıra gidersek, yeni satırımızın başarılı bir şekilde eklendiğini ve en &amp;ouml;nemliside, Access tablosundaki otomatik olarak artan ID değerinin, başarılı bir şekilde oluşturulduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Tekrar hatırlatmakta fayda var, burada yaptığımız veri girişi doğrudan, tabloyada yansıtılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk90_8.gif" alt="" width="199" height="163" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 7. Eklenen satır.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-09-08 12:00:00</pubDate>
  <slug>Asp-Net-2-0-DetailsView-Kontrolu-ile-InsertUpdateDelete-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet-20</tag>
    <tag>detailsview</tag>
    <tag>insert</tag>
    <tag>update</tag>
    <tag>delete</tag>
  </tags>
  <categories>
    <category>Asp.Net 2.0</category>
  </categories>
</post>