<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Entity Framework Code First için Doğrulama(Validation) Stratejileri</title>
  <description>Bir verinin çeşitli kurallara göre doğrulanması, verinin işlenmek üzere gönderilmeden önce yapılması gereken önemli işlemlerden birisidir. Özellikle Entity Framework gibi veri merkezli(Data-Centric) uygulama geliştirme alt yapılarında bu durum daha da önem arz etmektedir.</description>
  <content>&lt;p&gt;&lt;a href="/pics/checklist1.gif"&gt;&lt;img style="margin: 4px 0px; display: inline; float: right;" title="checklist1" src="/pics/checklist1_thumb.gif" alt="checklist1" width="240" height="264" align="right" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;a href="http://nedirtv.com/video/entity-framework-code-first-validation" target="_blank"&gt;&lt;span style="color: #ff0000;"&gt;[Bu yazıda ele alınan konuları i&amp;ccedil;eren Webiner(Webcast) kayıtlarına Nedirtv?com sayfasından erişebilir, izleyebilir ve indirebilirsiniz]&lt;/span&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bir verinin &amp;ccedil;eşitli kurallara g&amp;ouml;re doğrulanması, verinin işlenmek &amp;uuml;zere g&amp;ouml;nderilmeden &amp;ouml;nce yapılması gereken &amp;ouml;nemli işlemlerden birisidir. &amp;Ouml;zellikle &lt;strong&gt;Entity Framework&lt;/strong&gt; gibi &lt;strong&gt;veri merkezli(Data-Centric)&lt;/strong&gt; uygulama geliştirme alt yapılarında bu durum daha da &amp;ouml;nem arz etmektedir.&lt;/p&gt;
&lt;p&gt;Burada s&amp;ouml;z konusu olan, g&amp;ouml;rsel bir kontrol&amp;uuml;n i&amp;ccedil;erik denetiminden ziyade, &amp;ccedil;alışma zamanı &lt;strong&gt;Entity&lt;/strong&gt; &amp;ouml;rneklerine ait &lt;strong&gt;&amp;ouml;zelliklerin(Property)&lt;/strong&gt; değerlerinin denetlenmesidir. &amp;Ccedil;ok doğal olarak verilerde tutarsızlıklara neden olabilecek &amp;ccedil;eşitli ihlallerin tespit edilmesi, toplanması, gerektiğinde son kullanıcıya bildirilmesi ya da farklı bir yere raporlanması/loglanması gerekmektedir.&lt;/p&gt;
&lt;p&gt;Peki verinin doğrulanmasından tam olarak beklentilerimiz neler olabilir? Bunu bir ka&amp;ccedil; ger&amp;ccedil;ek hayat ihtiyacı ile cevaplayabiliriz.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin,&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Kullanıcı isminin en az 5, en fazla 25 karakter olması istenebilir.&lt;/li&gt;
&lt;li&gt;Oyuncunun kullanmak istediği dil sadece ingilizce, almanca ve fransızca olsun, şeklinde bir zorlama yapılması s&amp;ouml;z konusu olabilir.&lt;/li&gt;
&lt;li&gt;Doğum tarihinin bu g&amp;uuml;n&amp;uuml;n &amp;ouml;tesinde olmaması gerekebilir.&lt;/li&gt;
&lt;li&gt;Girilen URL adresinin istenen formatta olması beklenebilir.&lt;/li&gt;
&lt;li&gt;Yazarın vermiş olduğu sosyal g&amp;uuml;venlik numarasının ger&amp;ccedil;ekten de var olmaması bir doğrulama ihlali olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&lt;/li&gt;
&lt;li&gt;vb...&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;Ouml;rnekler duruma g&amp;ouml;re &amp;ccedil;oğaltılabilir elbette. &lt;strong&gt;Entity&lt;/strong&gt; &lt;strong&gt;Framework&lt;/strong&gt;, &amp;ouml;zelliklerin doğrulanması i&amp;ccedil;in bir ka&amp;ccedil; noktada araya girmemizi sağlayacak imkanlar sunmaktadır. Biz bu &amp;ouml;rneğimizde &lt;strong&gt;Code-First&lt;/strong&gt; yaklaşımı &amp;uuml;zerinden ilgili doğrulama kurallarını hangi noktalardan ve nasıl enjekte edebileceğimizi incelemeye &amp;ccedil;alışıyor olacağız. Doğrulama işlemlerini temelde &lt;strong&gt;Entity&lt;/strong&gt; ve &lt;strong&gt;Context&lt;/strong&gt; seviyesinde olmak &amp;uuml;zere iki ana dala ayırabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Doğrulama kuralları(Validation Rules),&lt;/strong&gt; &lt;strong&gt;Entity&lt;/strong&gt; seviyesinde iki şekilde yaptırılabilir.&lt;strong&gt; Nitelik(Attribute)&lt;/strong&gt; bazlı veya &lt;strong&gt;IValidatableObject&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n implementasyonu ile. Nitelik bazlı enjektelerde,&lt;strong&gt; System.ComponentModel.DataAnnotations&lt;/strong&gt; &lt;strong&gt;isim alanı(namespace)&lt;/strong&gt; altında yer alan bazı nitelik tiplerinden yararlanılır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Context&lt;/strong&gt; seviyesinde ise &lt;strong&gt;ValidateEntity&lt;/strong&gt; sanal metodunun &lt;strong&gt;ezilmesi(override)&lt;/strong&gt; suretiyle s&amp;ouml;z konusu denetimler yaptırılabilir.&lt;/p&gt;
&lt;p&gt;Hangi teknik se&amp;ccedil;ilirse se&amp;ccedil;ilsin, ilgili doğrulama kurallarının ge&amp;ccedil;ersiz olması halinde, ortama fırlatılan &lt;strong&gt;Exception'&lt;/strong&gt; ların da k&amp;uuml;m&amp;uuml;latif olarak toplanıp sunulması &amp;ouml;nemlidir. Bilindiği &amp;uuml;zere normal şartlarda, kod akarken oluşan bir &lt;strong&gt;Exception&lt;/strong&gt; sonucu &amp;ccedil;alışma zamanı catch bloğuna atlayacak ve &lt;strong&gt;try&lt;/strong&gt; bloğu i&amp;ccedil;erisindeki akışına devam etmeyecektir. &lt;strong&gt;Entity&lt;/strong&gt; &lt;strong&gt;Framework&lt;/strong&gt; gibi kullanım alanlarında, birden fazla Entity s&amp;ouml;z konusu olmakla birlikte bunların herhangibirisine ait &amp;ouml;zelliklerde oluşacak olan doğrulama ihlallerin toplanıp sunulması &amp;ccedil;ok daha doğru bir yaklaşım olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Entity&lt;/strong&gt; &lt;strong&gt;Framework&lt;/strong&gt; bu noktada bize yardımcı olacak bir Exception tipi i&amp;ccedil;erir; &lt;strong&gt;DbEntityValidationException&lt;/strong&gt;. Bu &lt;strong&gt;exception&lt;/strong&gt; tipine ait &lt;strong&gt;EntityValidationErros&lt;/strong&gt; koleksiyonu, &lt;strong&gt;Entity'&lt;/strong&gt; ler i&amp;ccedil;in s&amp;ouml;z konusu olabilecek t&amp;uuml;m doğrulama ihlallerini b&amp;uuml;nyesinde toplamaktadır. Bu sayede kullanıcıya toplu bir hata listesini d&amp;ouml;nd&amp;uuml;rmemiz m&amp;uuml;mk&amp;uuml;n olabilir.&lt;/p&gt;
&lt;p&gt;Şimdi dilerseniz basit bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması &amp;uuml;zerinden s&amp;ouml;z konusu teknikleri irdelemeye &amp;ccedil;alışalım.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Code-First yaklaşımını tercih ettiğimiz bu &amp;ouml;rnekte NuGet yardımıyla ilgili Entity Framework paketinin y&amp;uuml;klenmiş olduğunu varsayıyoruz. &amp;Ouml;rneği Entity Framework' &amp;uuml;n 4.5 s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde geliştirmekteyiz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;İlk olarak aşağıdaki sınıf &amp;ccedil;izelgesinde yer alan &lt;strong&gt;Layer&lt;/strong&gt; &lt;strong&gt;POCO&lt;/strong&gt; tipini geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/efv_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="efv_1" src="/pics/efv_1_thumb.png" alt="efv_1" width="266" height="162" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ComponentModel.DataAnnotations;

namespace HowTo_Validation 
{ 
    public class Layer 
    { 
        public int LayerId { get; set; } 
        
        [MaxLength(25,ErrorMessage="Katman başlığı en fazla 25 karakter olabilir") 
        , Required(ErrorMessage="Bir başlık girilmelidir")] 
        public string Title { get; set; } 
        
       [Required(ErrorMessage="Maximum oyuncu kapasitesini girmelisiniz") 
        , Range(5,100,ErrorMessage="En az 5 en fazla 100 oyuncu olabilir")] 
        public int MaxPlayerCapacity { get; set; }

        [RegularExpression(@"^([\w\.\-]+)@([\w\-]+)((\.(\w){2,3})+)$", ErrorMessage = "Ge&amp;ccedil;ersiz posta adresi")] 
        public string ModeratorMail { get; set; } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Layer&lt;/strong&gt; tipi i&amp;ccedil;erisinde yer alan &lt;strong&gt;Title&lt;/strong&gt;, &lt;strong&gt;MaxPlayerCapacity&lt;/strong&gt; ve &lt;strong&gt;ModeratorMail&lt;/strong&gt; &amp;ouml;zelliklerine &amp;ccedil;eşitli nitelikler uygulandığı g&amp;ouml;r&amp;uuml;lmektedir. Bu niteliklerin &lt;strong&gt;ErrorMessage&lt;/strong&gt; kısmında genellikle ihlallere ilişkin bir mesaj kullanılır. &lt;strong&gt;MaxLength&lt;/strong&gt;, tahmin edileceği &amp;uuml;zere ilgili &amp;ouml;zelliğin maksimum karakter sayısını ifade etmektedir. Diğer yandan &lt;strong&gt;Range&lt;/strong&gt; niteliği ile sayısal bir &amp;ouml;zellik i&amp;ccedil;in gerekli olan alt ve &amp;uuml;st sınır değerleri belirtilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Required&lt;/strong&gt; niteliği, ilgili &amp;ouml;zelliğin mutlaka girilmesini gerektirir. Kullanılabilecek olan bir diğer faydalı nitelikte&lt;em&gt;(ki bana g&amp;ouml;re en işe yararlarından birisidir) &lt;/em&gt;&lt;strong&gt;RegularExpression'&lt;/strong&gt; dır. İlk parametre olarak bir &lt;strong&gt;RegEx&lt;/strong&gt; ifadesi almaktadır. &amp;Ouml;rneğimzde &lt;strong&gt;ModeratorMail&lt;/strong&gt; &amp;ouml;zelliğinin taşıyacağı &amp;ccedil;alışma zamanı değerinin ge&amp;ccedil;erli bir &lt;strong&gt;e-mail&lt;/strong&gt; adresi olup olmadığı kontrol edilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Entity'&lt;/strong&gt; lere ait &amp;ouml;zellikler seviyesinde yapılabilen bu doğrulama işlemleri &amp;ouml;zellikle tipin g&amp;ouml;rsel bileşenlere &lt;strong&gt;bağlanabildiği(Binding)&lt;/strong&gt; uygulama &amp;ccedil;eşitlerinde epey kullanışlıdır. Bir başka deyişle &lt;strong&gt;Model View Controller(MVC)&lt;/strong&gt; veya &lt;strong&gt;Model View View Model(MVVM)&lt;/strong&gt; tarzı yapılarda değerlendirilebilir. Tabi &lt;strong&gt;Entity&lt;/strong&gt; i&amp;ccedil;erisinde &amp;ccedil;ok fazla sayıda &amp;ouml;zellik olabilir ve her biri i&amp;ccedil;in ilgili doğrulama kriterleri ortaklık g&amp;ouml;sterebilir. S&amp;ouml;z gelimi hi&amp;ccedil; bir &lt;strong&gt;Entity&lt;/strong&gt; &amp;ouml;zelliğinin boş ge&amp;ccedil;ilmemesi istenebilir.&lt;/p&gt;
&lt;p&gt;Diğer yandan nitelikler seviyesinde ger&amp;ccedil;ekleştirilmesi pek kolay olmayan bazı doğrulama kuralları da s&amp;ouml;z konusu olabilir ve bunlar farklı yerlerde fonksiyonel hale gelmiş k&amp;uuml;t&amp;uuml;phaneler i&amp;ccedil;erisinde yer alabilirler. Bu durumda sanki &lt;strong&gt;Entity&lt;/strong&gt; seviyesinde s&amp;ouml;z konusu olabilecek bir metod daha ideal olabilir. Bu tip bir vakayı karşılamak i&amp;ccedil;in &lt;strong&gt;Entity&lt;/strong&gt; tipine yine &lt;strong&gt;System.ComponentModel.DataAnnotations&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &lt;strong&gt;IValidatableObject&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; uyarlamak ve beraberinde gelen Validate metodunu ezmek yeterlidir. Şimdi &amp;ouml;rneğimize aşağıdaki sınıf &amp;ccedil;izelgesinde g&amp;ouml;r&amp;uuml;len &lt;strong&gt;Player POCO(Plain Old CLR Object)&lt;/strong&gt; tipini eklediğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/efv_2.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="efv_2" src="/pics/efv_2_thumb.png" alt="efv_2" width="476" height="360" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Collections.Generic; 
using System.ComponentModel.DataAnnotations; 
using System.Linq;

namespace HowTo_Validation 
{ 
    public class Player 
       :IValidatableObject 
    { 
        public int PlayerId { get; set; } 
        public string NickName { get; set; } 
        public string FirstName { get; set; } 
        public short Level { get; set; } 
        public string Country { get; set; }

        public IEnumerable&amp;lt;ValidationResult&amp;gt; Validate(ValidationContext validationContext) 
        { 
            if (String.IsNullOrEmpty(NickName) || String.IsNullOrEmpty(FirstName) || String.IsNullOrEmpty(Country)) 
                yield return new ValidationResult("Nickname, FirstName veya Country değerleri boş bırakılamaz" 
                    , new string[] { "NickName", "FirstName", "Country" } 
                    );

            if (NickName.Length &amp;lt; 3 || NickName.Length&amp;gt;10) 
                yield return new ValidationResult("NickName en az 3 karakter en fazla 10 karakter olmalıdır",new string[]{"NickName"});

           if (!Constants.Levels.Contains(Level)) 
                yield return new ValidationResult("Ge&amp;ccedil;ersiz oyuncu seviyesi.", new string[] { "Level" });

            if (!Constants.Countries.Contains(Country)) 
                yield return new ValidationResult("Ge&amp;ccedil;ersiz &amp;uuml;lke.", new string[] { "Country" });

        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rnekte &lt;strong&gt;Player&lt;/strong&gt; tipinin &lt;strong&gt;Nickname&lt;/strong&gt;, &lt;strong&gt;FirstName&lt;/strong&gt;, &lt;strong&gt;Country&lt;/strong&gt; ve &lt;strong&gt;Level&lt;/strong&gt; &amp;ouml;zellikleri i&amp;ccedil;in uygulanmış olan bazı doğrulama kriterleri olduğu g&amp;ouml;r&amp;uuml;lmektedir. Dikkat edileceği &amp;uuml;zere Validate metodu, doğrulama işlemine ait &amp;ccedil;alışma zamanı i&amp;ccedil;eriğini &lt;strong&gt;ValidationContext&lt;/strong&gt; tipinden olan parametre ile kontrol altına almaktadır. Bu &amp;ouml;zelliğin değeri elbetteki &amp;ccedil;alışma zamanında asıl &lt;strong&gt;Context&lt;/strong&gt; nesnesi tarafından dolduralacak ve o &lt;strong&gt;Player&lt;/strong&gt; entity tipine ait canlı nesne değerleri ile beslenecektir. &lt;strong&gt;Validate&lt;/strong&gt; metodu geriye bir numaralandırıcı d&amp;ouml;nd&amp;uuml;rmektedir. Dolayısıyla &lt;strong&gt;yield&lt;/strong&gt; anahtar kelimesinden yararlanılabilir ve bu sayede n sayıda doğrulama ihlalinin asıl ortama d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi m&amp;uuml;mk&amp;uuml;n olabilir.&lt;/p&gt;
&lt;p&gt;D&amp;ouml;n&amp;uuml;ş koleksiyonu i&amp;ccedil;erisinde yer alan tipler &lt;strong&gt;ValidationResult&lt;/strong&gt; sınıfına ait &amp;ouml;rneklerdir. Bu sınıfa ait &amp;ouml;rnekler &amp;uuml;retilirken genellikle ilk parametre olarak hata mesajı verilir. İkinci parametre ise ihlale sebebiyet veren &amp;ouml;zelliği ifade etmektedir. Bu iki bilgi yine &amp;ccedil;alışma zamanındaki &lt;strong&gt;Catch&lt;/strong&gt; bloğunda yakalanan &lt;strong&gt;DbEntityValidationException&lt;/strong&gt; &amp;ouml;rneği i&amp;ccedil;erisinden alınabilir ve son kullanıcıya bilgilendirme de kullanılabilir.&lt;/p&gt;
&lt;p&gt;Ancak bu y&amp;ouml;ntem i&amp;ccedil;in de bir dezavantaj da s&amp;ouml;z konusu olabilir. Uygulamada kullanılan &lt;strong&gt;Entity&lt;/strong&gt; tiplerinin sayısı arttık&amp;ccedil;a ve benzer doğrulama kriterlerinin pek &amp;ccedil;ok &lt;strong&gt;Entity&lt;/strong&gt; i&amp;ccedil;in yapılması s&amp;ouml;z konusu ise attribute bazlı enjekte y&amp;ouml;ntemi terk edilebilir. B&amp;ouml;yle bir durumda doğrudan Context nesnesi &amp;uuml;zerinden bir doğrulama tekniği tercih edilebilir. Aynen aşağıda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;p&gt;Bu a&amp;ccedil;ılardan bakıldığında &lt;strong&gt;Entity&lt;/strong&gt; &lt;strong&gt;Framework'&lt;/strong&gt; deki doğrulama kontrolleri, &lt;strong&gt;ASP.Net&lt;/strong&gt; tarafındaki hata y&amp;ouml;netimini andırmaktadır. &lt;strong&gt;Asp.Net&lt;/strong&gt; tarafında bildiğiniz &amp;uuml;zere sırasıyla Metod, Sayfa(Page) ve uygulama(Application-global.asax.cs) seviyesinde hata kontrolleri ger&amp;ccedil;ekleştirilir. &lt;strong&gt;EF'&lt;/strong&gt; de de &lt;strong&gt;property'&lt;/strong&gt; den başlayan, sınıf i&amp;ccedil;i bir metod ile devam eden ve son olarak &lt;strong&gt;context&lt;/strong&gt; nesnesi &amp;uuml;zerinde ele alınabilen doğrulama enjekte noktaları mevcuttur. Hangi sırada &amp;ccedil;alıştıklarını merak ediyorsanız &lt;strong&gt;Debug&lt;/strong&gt; edip denemenizi &amp;ouml;neririm &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_123.png" alt="Winking smile" /&gt; Belki de bu sıra duruma g&amp;ouml;re değişiklik arz, eder kim bilir &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_55.png" alt="Smile" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/efv_3.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="efv_3" src="/pics/efv_3_thumb.png" alt="efv_3" width="599" height="384" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace HowTo_Validation 
{ 
    public class Author 
    { 
        public int AuthorId { get; set; } 
        public string FirstName { get; set; } 
        public string Scenario { get; set; } 
        public DateTime Birthday{ get; set; } 
    } 
}

using System; 
using System.Collections.Generic; 
using System.Data; 
using System.Data.Entity; 
using System.Data.Entity.Infrastructure; 
using System.Data.Entity.Validation;

namespace HowTo_Validation 
{ 
    public class GameContext 
        :DbContext 
    { 
        public DbSet&amp;lt;Player&amp;gt; Players { get; set; } 
        public DbSet&amp;lt;Layer&amp;gt; Layers { get; set; } 
        public DbSet&amp;lt;Author&amp;gt; Authors { get; set; }

        protected override DbEntityValidationResult ValidateEntity(DbEntityEntry entityEntry, 
IDictionary&amp;lt;object, object&amp;gt; items) 
        { 
            var result = base.ValidateEntity(entityEntry, items);

            if (entityEntry.State == EntityState.Added &amp;amp;&amp;amp; 
                entityEntry.Entity is Author) 
            { 
                var author = entityEntry.Entity as Author;

                if (author.Birthday &amp;gt; DateTime.Today) 
                { 
                   result.ValidationErrors.Add( 
                        new DbValidationError( 
                            "Yazar doğum tarihi", 
                            "Doğum tarihi bug&amp;uuml;nden b&amp;uuml;y&amp;uuml;k olamaz.") 
                            ); 
                } 
            } 
            return result; 
       } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Standart olarak &lt;strong&gt;DbContext&lt;/strong&gt; t&amp;uuml;revli olarak tasarlanan &lt;strong&gt;GameContext&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde &lt;strong&gt;ValidateEntity&lt;/strong&gt; metodunun ezildiği g&amp;ouml;r&amp;uuml;lmektedir(override). Metod geriye &lt;strong&gt;DbEntityValidationResult&lt;/strong&gt; tipnden bir &amp;ouml;rnek d&amp;ouml;nd&amp;uuml;rmektedir. Olası &lt;strong&gt;n sayıdaki kural ihlali&lt;/strong&gt;, bu tipin nesne &amp;ouml;rneğine ait &lt;strong&gt;ValidationErros&lt;/strong&gt; koleksiyonunda toplanabilir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekte o anda &amp;uuml;zerinde işlem yapılan &lt;strong&gt;Entity&lt;/strong&gt; &amp;ouml;rneği &lt;strong&gt;DbEntityEntry&lt;/strong&gt; tipinden olan &lt;strong&gt;entityEntry&lt;/strong&gt; isimli metod parametresidir. Bu parametreden yararlanılarak &lt;strong&gt;State&lt;/strong&gt; &amp;ouml;zelliğine bakılır ve ayrıca ilgili &lt;strong&gt;Entity'&lt;/strong&gt; nin bir &lt;strong&gt;Author&lt;/strong&gt; tipi olup olmadığı tespit edilir. Eğer yeni bir yazar ekleniyorsa bu durumda doğrulama işlemi yaptırılmaktadır. Sembolik olarak yazarın doğum tarihinin bu g&amp;uuml;n&amp;uuml;n tarihinden b&amp;uuml;y&amp;uuml;k olmaması istenmiştir. Eğer bir ihlal s&amp;ouml;z konusu ise bu durumda &lt;strong&gt;ValidationErros&lt;/strong&gt; &amp;ouml;zelliğinin işaret ettiği koleksiyona yeni bir &lt;strong&gt;DbValidationError&lt;/strong&gt; &amp;ouml;rneği eklenir.&lt;/p&gt;
&lt;p&gt;Buraya kadar ki &amp;ouml;rneklerimizle doğrulama kriterlerini 3 farklı seviyede ele alabildiğimizi g&amp;ouml;rd&amp;uuml;k. Şimdi &lt;strong&gt;Program&lt;/strong&gt; kodu i&amp;ccedil;erisinde gerekli &lt;strong&gt;try...catch&lt;/strong&gt; bloğunu uygulayarak &amp;ouml;rneğimizi test edelim ve &amp;ccedil;alışma zamanı sonu&amp;ccedil;larını irdeleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Collections.Generic; 
using System.Data.Entity; 
using System.Data.Entity.Validation;

namespace HowTo_Validation 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            #region Code First i&amp;ccedil;in Doğrulama Teknikleri

            // Initialization stratejisi olarak modelde bir değişiklik olursa yeni baştan &amp;uuml;retilmesini ifade ediyoruz 
            Database.SetInitializer&amp;lt;GameContext&amp;gt;(new DropCreateDatabaseIfModelChanges&amp;lt;GameContext&amp;gt;());

            // Context nesnesi &amp;ouml;rneklenir 
            using (GameContext context = new GameContext()) 
            { 
                try 
                { 
                    Player jedi = new Player(); 
                    jedi.NickName = "jd"; 
                    jedi.Level = 5000; 
                    jedi.Country = "Coroban";

                    context.Players.Add(jedi);

                    Layer layerSubZero = new Layer(); 
                    layerSubZero.Title = "bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla bla"; 
                    layerSubZero.ModeratorMail = "birmailiste"; 
                    layerSubZero.MaxPlayerCapacity = 200;

                    context.Layers.Add(layerSubZero);

                    Author me = new Author(); 
                    me.FirstName = "Burak"; 
                    me.Scenario = "G&amp;uuml;zel bir oyun senaryosu var burada"; 
                    me.Birthday = new DateTime(2014, 1, 1);

                    context.Authors.Add(me); 
                                        
                    context.SaveChanges();

                } 
                catch (DbEntityValidationException exception) // Validasyon ile ilişkili Exception' lar yakalanır 
                { 
                   WriteErrosToConsole(exception.EntityValidationErrors); // Exception loglanmak amacıyla ilgili metoda g&amp;ouml;nderirilir 
                } 
            }

            #endregion 
        }

        private static int WriteErrosToConsole(IEnumerable&amp;lt;DbEntityValidationResult&amp;gt; validationErrors) 
        { 
            int errorCount = 0; 
            // Her bir Validation Error dolaşılmaya başlanır 
           foreach (DbEntityValidationResult validationError 
                in validationErrors) 
           { 
                // Doğrulama hatasına neden olan Entity bilgisi verilir 
                Console.WriteLine( 
                    "Entity bazlı hata : {0}", 
                    validationError.Entry.Entity);

                // Entity i&amp;ccedil;erisinde doğrulama hatasına takılan &amp;ouml;zelliklerin her biri dolaşılır 
                foreach (DbValidationError propertyError 
                    in validationError.ValidationErrors) 
                { 
                    // Doğrulama hatasına takılan &amp;ouml;zelliğin adı ve hata mesajı yazdırılır 
                    Console.WriteLine( 
                        @" ""{0}"" &amp;ouml;zelliğinde : ""{1}"" hatası s&amp;ouml;z konusudur.", 
                        propertyError.PropertyName, 
                        propertyError.ErrorMessage); 
                } 
                errorCount++; 
            } 
            return errorCount; 
        } 
    } 
}&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;Ouml;rnekte Code-First yaklaşımı kullanılmıştır. Bu yaklaşımda connection string bilgisi de &amp;ouml;nemlidir. Biz aksini belirtmedik&amp;ccedil;e uygulama SQL Express s&amp;uuml;r&amp;uuml;m&amp;uuml; ve DbContext t&amp;uuml;revli tip adını baz alarak bir veritabanı oluşturacaktır. Biz &amp;ouml;rneğimizde aşağıdaki gibi bir connection string bilgisi kullandık.&lt;/p&gt;
&lt;p&gt;&amp;lt;?xml version="1.0" encoding="utf-8"?&amp;gt; &lt;br /&gt;&amp;lt;configuration&amp;gt; &lt;br /&gt;&amp;nbsp; &amp;lt;configSections&amp;gt; &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp; &amp;lt;section name="entityFramework" type="System.Data.Entity.Internal.ConfigFile.EntityFrameworkSection, EntityFramework, Version=5.0.0.0, Culture=neutral, PublicKeyToken=b77a5c561934e089" requirePermission="false" /&amp;gt; &lt;br /&gt;&amp;nbsp; &amp;lt;/configSections&amp;gt; &lt;br /&gt;&amp;nbsp; &amp;lt;startup&amp;gt; &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp; &amp;lt;supportedRuntime version="v4.0" sku=".NETFramework,Version=v4.5" /&amp;gt; &lt;br /&gt;&amp;nbsp; &amp;lt;/startup&amp;gt; &lt;br /&gt;&amp;nbsp; &amp;lt;entityFramework&amp;gt; &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp; &amp;lt;defaultConnectionFactory type="System.Data.Entity.Infrastructure.SqlConnectionFactory, EntityFramework" /&amp;gt; &lt;br /&gt;&amp;nbsp; &amp;lt;/entityFramework&amp;gt; &lt;br /&gt;&amp;nbsp; &amp;lt;connectionStrings&amp;gt; &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp; &amp;lt;add name="GameContext" connectionString="data source=.;database=Gamers;integrated security=SSPI" providerName="System.Data.SqlClient"/&amp;gt; &lt;br /&gt;&amp;nbsp; &amp;lt;/connectionStrings&amp;gt; &lt;br /&gt;&amp;lt;/configuration&amp;gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Main metodu i&amp;ccedil;erisinde &amp;uuml;retilen &lt;strong&gt;GameContext&lt;/strong&gt; &amp;ouml;rneği i&amp;ccedil;in &amp;ouml;rnek bir &lt;strong&gt;Player&lt;/strong&gt;, &lt;strong&gt;Author&lt;/strong&gt; ve &lt;strong&gt;Layer&lt;/strong&gt; &amp;ouml;rneğinin eklenmesi s&amp;ouml;z konusudur. Bu &amp;ouml;rnekler eklendikten sonra yapılan &lt;strong&gt;SaveChanges&lt;/strong&gt; &amp;ccedil;ağrısı sırasında ilgili doğrulama kodları devreye girecek ve olası hatalar toplanarak catch bloğu i&amp;ccedil;erisinde yakalanacaktır. Bu hataları kolay bir şekilde yazdırabilmek amacıyla, &lt;strong&gt;WriteErrorsToConsole&lt;/strong&gt; isimli bir metoddan yararlanılmaktadır.&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere bu metod i&amp;ccedil;erisinde ihlale neden olan Entity &amp;ouml;rneği &lt;strong&gt;DbEntityValidationResult&lt;/strong&gt; &amp;ouml;rneklerine ait &lt;strong&gt;Entry.Entity&lt;/strong&gt; &amp;ouml;zelliğinden yakalanmaktadır. &lt;strong&gt;Entity'&lt;/strong&gt; den hemen bir alt seviye olan &amp;ouml;zelliklerdeki ihlallere inmek i&amp;ccedil;in de &lt;strong&gt;ValidationErros&lt;/strong&gt; koleksiyonunda dolaşılmakta ve &lt;strong&gt;PropertyName&lt;/strong&gt; ile &lt;strong&gt;ErrorMessage&lt;/strong&gt; değerlerine bakılmaktadır. &amp;Ouml;rneği &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki benzer bir hata mesajı ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/efv_4.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="efv_4" src="/pics/efv_4_thumb.png" alt="efv_4" width="508" height="244" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi t&amp;uuml;m seviyelerdeki kural ihlalleri toplu olarak yakalanabilmiştir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;Ouml;rneği &amp;ccedil;alıştırırken mutlaka debug edip adım adım ilerlemenizi &amp;ouml;neririm. Bu sayede kodun sırasıyla hangi doğrulama kriterlerini &amp;ccedil;alıştırdığını daha net g&amp;ouml;rebilirisiniz ;)&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;Ouml;rnekte dikkati &amp;ccedil;eken noktalardan birisi de, ilgili doğrulama işlemlerinin &lt;strong&gt;SaveChanges&lt;/strong&gt; metoduna yapılan &amp;ccedil;ağrı ile devreye girmiş olmasıdır. &amp;Ccedil;ok doğal olarak bu &amp;ccedil;ağrıyı yapmadan &amp;ouml;nce bir yerlerde ilgili doğrulama kurallarını &amp;ccedil;alıştırmak ve olası ihlalleri toplamak isteyebiliriz. Bu tip bir durumda yine &lt;strong&gt;Context&lt;/strong&gt; nesnesine ait olan &lt;strong&gt;GetValidationErros&lt;/strong&gt; metodundan yararlanılabilir. Aşağıdaki kod par&amp;ccedil;asında olduğu gibi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var validationErros = context.GetValidationErrors(); 
var errorCount=WriteErrosToConsole(validationErros); 
if(errorCount==0) 
&amp;nbsp;&amp;nbsp;&amp;nbsp; context.SaveChanges();&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;GetValidationErros&lt;/strong&gt; metodu&lt;strong&gt; IEnumerable&amp;lt;DbEntityValidationResult&amp;gt;&lt;/strong&gt; tipinden bir referans d&amp;ouml;nd&amp;uuml;rmektedir. &amp;Ccedil;ok doğal olarak bu i&amp;ccedil;erik en az 1 ihlal dahi i&amp;ccedil;erse &lt;strong&gt;context&lt;/strong&gt; nesne &amp;ouml;rneğine ait &lt;strong&gt;SaveChanges&lt;/strong&gt; metodunun &amp;ccedil;ağırılması istenmeyebilir.&lt;/p&gt;
&lt;p&gt;Peki &amp;ouml;zellikle &lt;strong&gt;attribute&lt;/strong&gt; seviyesinde yapılan doğrulama kontrollerini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alırsak, kendi &amp;ouml;zel kriterlerimizi i&amp;ccedil;eren nitelikler tanımlayamaz mıyız? Elbetteki b&amp;ouml;yle bir esnekli var &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_123.png" alt="Winking smile" /&gt; Nitekim &lt;strong&gt;System.ComponentModel.DataAnnotations&lt;/strong&gt; isim alanı altında yer alan doğrulama kriterlerinin ortak &amp;ouml;zelliği, &lt;strong&gt;ValidationAttribute&lt;/strong&gt; niteliğinden t&amp;uuml;remiş olmalarıdır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/efv_5.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="efv_5" src="/pics/efv_5_thumb.png" alt="efv_5" width="473" height="289" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ValidationAttribute&lt;/strong&gt; niteliği de doğal olarak &lt;strong&gt;Attribute&lt;/strong&gt; tipinden t&amp;uuml;remektedir. &amp;Ouml;yleyse kendi doğrulama niteliklerimizi yazmanın bir yolunu bulduğumuzu ifade edebiliriz &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_123.png" alt="Winking smile" /&gt; S&amp;ouml;z gelimi &lt;strong&gt;Author&lt;/strong&gt; tipimize &lt;strong&gt;SocialSecurityNumber&lt;/strong&gt; isimli &lt;strong&gt;string&lt;/strong&gt; bir &amp;ouml;zellik eklediğimizi ve buraya girilen değerlerin ge&amp;ccedil;erli bir numara olup olmadığını denetleyecek bir doğrulama niteliği geliştirmek istediğimizi farz edelim. Aşağıdaki şekilde ilerleyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/efv_6.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="efv_6" src="/pics/efv_6_thumb.png" alt="efv_6" width="526" height="538" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.ComponentModel.DataAnnotations;

namespace HowTo_Validation 
{ 
    [AttributeUsage(AttributeTargets.Property)] 
    public class SSNValidatorAttribute 
        :ValidationAttribute 
    { 
        private bool CheckIsValid(string ssn) 
        { 
            //TODO@Burak Do Something for SSN check

            return false; 
        }

        public override bool IsValid(object value) 
        { 
            return CheckIsValid(value.ToString()); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Tabi duruma g&amp;ouml;re s&amp;ouml;z konusu niteliğin ezmesi gereken &amp;uuml;ye sayısı daha fazla olabilir. Biz &amp;ouml;rneğimizde sadece &lt;strong&gt;IsValid&lt;/strong&gt; metodunu ezdik. &amp;Ccedil;alışma zamanında bu metoda girildiğinde &lt;strong&gt;object&lt;/strong&gt; tipinden olan &lt;strong&gt;value&lt;/strong&gt; parametresinin değeri, niteliğin uygulandığı &amp;ouml;zelliğin &amp;ccedil;alışma zamanındaki i&amp;ccedil;eriği olacaktır. &lt;em&gt;(Burada sembolik olarak kontrol işlemini &amp;uuml;stlenen ayrı bir metod private olarak tanımlanmıştır. Ger&amp;ccedil;ek hayatta bu metod ger&amp;ccedil;ekten de harici bir servisi &amp;ccedil;ağırarak denetleme işlemini yapabilir)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/efv_7.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="efv_7" src="/pics/efv_7_thumb.png" alt="efv_7" width="520" height="407" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bunu kontrol ederek duruma g&amp;ouml;re geriye &lt;strong&gt;true&lt;/strong&gt; veya &lt;strong&gt;false&lt;/strong&gt; değer d&amp;ouml;nd&amp;uuml;rmemiz yeterlidir. Niteliği &lt;strong&gt;Author&lt;/strong&gt; &lt;strong&gt;Entity&lt;/strong&gt; tipi i&amp;ccedil;in aşağıdaki kod par&amp;ccedil;asında g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; şekilde uygulayabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace HowTo_Validation 
{ 
    public class Author 
    { 
        public int AuthorId { get; set; } 
        public string FirstName { get; set; } 
        public string Scenario { get; set; } 
        public DateTime Birthday{ get; set; } 
        
        [SSNValidator(ErrorMessage="Hatalı sosyal g&amp;uuml;venlik numarası")] 
        public string SocialSecurityNumber { get; set; } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Şu andaki &lt;strong&gt;test&lt;/strong&gt; kodumuz her vaziyette &lt;strong&gt;SSN&lt;/strong&gt; doğrulamasında false değer &amp;uuml;retecektir. Sonu&amp;ccedil;ta ekran &amp;ccedil;ıktısını bu işlem de aşağıdakine benzer bir şekilde yansıtılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/efv_8.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="efv_8" src="/pics/efv_8_thumb.png" alt="efv_8" width="508" height="311" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zetle &lt;strong&gt;Entity&lt;/strong&gt; &lt;strong&gt;Framework&lt;/strong&gt; tarafındaki doğrulama işlemlerini &lt;strong&gt;Entity&lt;/strong&gt; seviyesinde&lt;strong&gt; nitelikler(Attribute)&lt;/strong&gt; ve &lt;strong&gt;IValidatableObject&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; sayesinde ger&amp;ccedil;ekleştirebilirken, &lt;strong&gt;Context&lt;/strong&gt; tipi seviyesinde de &lt;strong&gt;ezilebilen(overridable)&lt;/strong&gt; &lt;strong&gt;ValidateEntity&lt;/strong&gt; metodu i&amp;ccedil;erisinde yapabiliriz. Bu makalemizde &amp;ccedil;ok basit seviyede de olsa, &lt;strong&gt;Code-First Entity Framework &lt;/strong&gt;tabanlı doğrulama işlemlerini ele almaya &amp;ccedil;alıştık. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2012%2f9%2fHowTo_Validation.zip"&gt;HowTo_Validation.zip (2,59 mb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2012-11-18 06:38:00</pubDate>
  <slug>Entity-Framework-Code-First-icin-Dogrulama(Validation)-Stratejileri</slug>
  <tags>
    <tag>entity-framework</tag>
    <tag>code-first</tag>
    <tag>validation</tag>
    <tag>attribute</tag>
    <tag>data-annotations</tag>
  </tags>
  <categories>
    <category>Entity Framework</category>
  </categories>
</post>