<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF 4.5–SingleWSDL</title>
  <description>Daha dün gibi hatırlıyorum. Windows Communication Foundation 4.0 ile gelen yenilikleri inceliyor, öğrendiklerimi derhal bloğumda paylaşıyordum. Zaman ya çok hızlı akıyor ya da Microsoft zamanın önünde koşuyor Smile Nitekim .Net Framework 4.5 ha çıktı çıkacak derken, çoktan çıkmış da profesyonel projelerde kullanılmaya başlanmış bile.</description>
  <content>&lt;p&gt;&lt;a href="/pics/what-wsdl-defines.jpg"&gt;&lt;img style="margin: 4px 0px; display: inline; float: right;" title="what-wsdl-defines" src="/pics/what-wsdl-defines_thumb.jpg" alt="what-wsdl-defines" width="240" height="246" align="right" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Daha d&amp;uuml;n gibi hatırlıyorum. &lt;strong&gt;Windows Communication Foundation 4.0&lt;/strong&gt; ile gelen yenilikleri inceliyor, &amp;ouml;ğrendiklerimi derhal bloğumda paylaşıyordum. Zaman ya &amp;ccedil;ok hızlı akıyor ya da Microsoft zamanın &amp;ouml;n&amp;uuml;nde koşuyor &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_56.png" alt="Smile" /&gt; Nitekim &lt;strong&gt;.Net Framework 4.5 &lt;/strong&gt;ha &amp;ccedil;ıktı &amp;ccedil;ıkacak derken, &amp;ccedil;oktan &amp;ccedil;ıkmış da profesyonel projelerde kullanılmaya başlanmış bile.&lt;/p&gt;
&lt;p&gt;Dolayısıyla zaman yine benim gibi aciz geliştiriciler i&amp;ccedil;in bir şeyleri daha &amp;ouml;ğrenme vaktidir. İşte ben de bu hevesle &amp;ccedil;ok fazla makale tadında olmayan ama yeniliklerden haberdar olmamızı&lt;em&gt;(en &amp;ccedil;ok da balık hafızamın unuttuklarını kayıt almamı sağlıyor)&lt;/em&gt; sağlayacak bir ka&amp;ccedil; yazıya yer vermek istedim. İlk konumuz &lt;strong&gt;SingleWSDL &lt;/strong&gt;&lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_124.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Windows Communication Foundation 4.5&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml; ile birlikte gelen yeniliklerden birisi de &lt;strong&gt;WSDL&lt;/strong&gt; i&amp;ccedil;eriklerinin tekil bir dosya halinde elde edilebilme imkanıdır. &lt;strong&gt;SingleWSDL&lt;/strong&gt; anahtar kelimesi sayesinde tek bir&lt;strong&gt; WSDL(Web Service Description Language)&lt;/strong&gt; i&amp;ccedil;eriğine, servis tarafının kullandığı t&amp;uuml;m &lt;strong&gt;veri s&amp;ouml;zleşmelerinin(Data Contract)&lt;/strong&gt; eklenmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bir WSDL i&amp;ccedil;eriği ile, servisin hangi operasyonları sunduğu, bu operasyonlardan d&amp;ouml;nen tiplerin ne olduğu ve bu tiplerin şema yapılarının nasıl oluşturulması gerektiği &amp;ouml;ğrenilebilir. WSDL, XML dili ile &amp;uuml;retilen bir servis tanımlama/keşfetme protokol&amp;uuml;d&amp;uuml;r.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bunun ne anlama geldiğini anlamak i&amp;ccedil;in dilerseniz basit bir &amp;ouml;rnek &amp;uuml;zerinden ilerlemeye &amp;ccedil;alışalım. Bu ama&amp;ccedil;la &lt;strong&gt;Visual Studio 2012&lt;/strong&gt; ortamında bir &lt;strong&gt;WCF Service Application&lt;/strong&gt; projesi oluşturalım. Proje i&amp;ccedil;erisinde yer alan s&amp;ouml;zleşme ve diğer tipler aşağıdaki sınıf diagramında g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfnf_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfnf_1" src="/pics/wcfnf_1_thumb.png" alt="wcfnf_1" width="218" height="414" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ICommonService&lt;/strong&gt; isimli &lt;strong&gt;servis s&amp;ouml;zleşmesi(Service Contract)&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &lt;strong&gt;GetRegion&lt;/strong&gt; isimli fonksiyon, &lt;strong&gt;Country&lt;/strong&gt; tipinden elemanlardan oluşan bir listeyi d&amp;ouml;nd&amp;uuml;rmekte olan servis operasyonunu tanımlamaktadır. &lt;strong&gt;Country&lt;/strong&gt; tipi ise basit bir &lt;strong&gt;POCO&lt;/strong&gt; olup aşağıdaki i&amp;ccedil;eriğe sahiptir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace ContosoService 
{ 
    public class Country 
    { 
        public int Level { get; set; } 
        public string Name { get; set; } 
        public int Id { get; set; } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Servis s&amp;ouml;zleşmesi ve uygulayıcı tip i&amp;ccedil;erikleri ise şu şekildedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Servis s&amp;ouml;zleşmesi;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic; 
using System.ServiceModel;

namespace ContosoService 
{ 
    [ServiceContract] 
    public interface ICommonService 
    { 
        [OperationContract] 
        List&amp;lt;Country&amp;gt; GetRegion(); 
    } 
}

using System; 
using System.Collections.Generic;

namespace ContosoService 
{ 
    public class CommonService 
        : ICommonService 
    { 
       public List&amp;lt;Country&amp;gt; GetRegion() 
        { 
            List&amp;lt;Country&amp;gt; asiaRegion = new List&amp;lt;Country&amp;gt; 
            { 
                new Country{Id=1,Name="Japan",Level=100}, 
                new Country{Id=2,Name="S. Korea",Level=200}, 
                new Country{Id=3,Name="Singapur",Level=300} 
            }; 
            return asiaRegion; 
        } 
    } 
}&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;Bonus Yenilik:&lt;/p&gt;
&lt;p&gt;WCF 4.5 konfigurasyon i&amp;ccedil;eriklerinde doğrulama(Validation) artık daha etkili ve kabiliyetli. Aşağıdaki şekilde yer alan Warning mesajlarına dikkat &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_124.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfnf_8.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfnf_8" src="/pics/wcfnf_8_thumb.png" alt="wcfnf_8" width="599" height="506" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Amacımız &lt;strong&gt;WSDL&lt;/strong&gt; &amp;ccedil;ıktılarına bakmak olduğundan sadece &lt;strong&gt;POCO(Plain Old CLR Object)&lt;/strong&gt; tip kullanan bir &lt;strong&gt;Dummy&lt;/strong&gt; servis geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nebiliriz. Şu noktada servisi tarayıcı uygulamadan &amp;ccedil;ağırdığımızda aşağıda g&amp;ouml;r&amp;uuml;len ekran &amp;ccedil;ıktısı ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfnf_2.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfnf_2" src="/pics/wcfnf_2_thumb.png" alt="wcfnf_2" width="442" height="320" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;WSDL&lt;/strong&gt; i&amp;ccedil;eriklerine iki farklı adres ile talepte bulunabiliriz. &amp;Uuml;stte yer alan &lt;strong&gt;http://localhost:51938/CommonService.svc?wsdl&lt;/strong&gt; adresinden yapılan standart sorgu, bildiğimiz &lt;strong&gt;WSDL&lt;/strong&gt; &amp;ccedil;ıktısını d&amp;ouml;nd&amp;uuml;recektir ki s&amp;ouml;z konusu i&amp;ccedil;erik aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfnf_3.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfnf_3" src="/pics/wcfnf_3_thumb.png" alt="wcfnf_3" width="632" height="486" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Şimdi burada duralım. Servisimiz bilindiği &amp;uuml;zere &lt;strong&gt;Country&lt;/strong&gt; tipi ile &amp;ccedil;alışacak şekilde tasarlanmıştır. Dolayısıyla istemci tarafı i&amp;ccedil;in gerekli proxy &amp;uuml;retimi sırasında bu tipinde karşı tarafta oluşturulması gerekir. Bunun i&amp;ccedil;inse ilgili tip tanımlamalarının &lt;strong&gt;WSDL&lt;/strong&gt; d&amp;ouml;k&amp;uuml;manında bulunması şarttır ki, &lt;strong&gt;svcutil&lt;/strong&gt; aracı veya &lt;strong&gt;Add Service Reference&lt;/strong&gt; se&amp;ccedil;eneği hangi şemaya bakarak nasıl bir sınıf &amp;uuml;reteceğini bilsin.&lt;/p&gt;
&lt;p&gt;Yukarıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne bakıldığında &lt;strong&gt;XSD(Xml Schema Definition)&lt;/strong&gt; tanımlamaları i&amp;ccedil;in harici referanslar verildiği de g&amp;ouml;r&amp;uuml;lmektedir. S&amp;ouml;z gelimi &lt;strong&gt;http://localhost:51938/CommonService.svc?xsd=xsd2&lt;/strong&gt; talebi ger&amp;ccedil;ekleştirildiğinde aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan &amp;ccedil;ıktıya ulaşılır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfnf_4.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfnf_4" src="/pics/wcfnf_4_thumb.png" alt="wcfnf_4" width="572" height="380" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Fark edileceği &amp;uuml;zere bu &lt;strong&gt;XSD&lt;/strong&gt; i&amp;ccedil;eriğinde &lt;strong&gt;Country&lt;/strong&gt; tipi ve &lt;strong&gt;Country&lt;/strong&gt; tipinden oluşan dizi tanımı&lt;strong&gt;(ArrayOfCountry)&lt;/strong&gt; s&amp;ouml;z konusudur. Bu şema da &lt;strong&gt;Country&lt;/strong&gt; tipinin i&amp;ccedil;erdiği &lt;strong&gt;&amp;ouml;zellikler(Properties)&lt;/strong&gt; ve bu &amp;ouml;zelliklerin tipleri yer almaktadır.&lt;/p&gt;
&lt;p&gt;Şimdi de &lt;strong&gt;http://localhost:51938/CommonService.svc?singleWsdl&lt;/strong&gt; adresi i&amp;ccedil;in yapılan talebin sonu&amp;ccedil;larına bakalım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfnf_5.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfnf_5" src="/pics/wcfnf_5_thumb.png" alt="wcfnf_5" width="574" height="599" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi servis tarafının kullandığı &lt;strong&gt;veri s&amp;ouml;zleşmesi(Data Contract)&lt;/strong&gt; ve gerekli diğer tip tanımlamaları aynı &lt;strong&gt;WSDL&lt;/strong&gt; d&amp;ouml;k&amp;uuml;manı i&amp;ccedil;erisine bir element ağacı olarak entegre edilmiştir. Bir başka deyişle &lt;strong&gt;XSD&lt;/strong&gt; kaynaklarının harici &lt;strong&gt;URL &lt;/strong&gt;adresleri &amp;uuml;zerinden referans edilmediği, bunun yerine aynı d&amp;ouml;k&amp;uuml;man i&amp;ccedil;erisine enjekte edildikleri g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF 4.5&lt;/strong&gt; tarafında gelmiş olan bir ka&amp;ccedil; yenilik daha bulunmaktadır. Genelde &amp;ccedil;ok k&amp;uuml;&amp;ccedil;&amp;uuml;k ve pek de g&amp;ouml;ze &amp;ccedil;arpmayacak yenilikler olmasına rağmen, &amp;ouml;nemlidirler. S&amp;ouml;z gelimi configurasyon dosyası i&amp;ccedil;erikleri i&amp;ccedil;in &lt;strong&gt;doğrulama(Validation)&lt;/strong&gt; kabiliyetleri arttırılmış, &lt;strong&gt;IIS&lt;/strong&gt; i&amp;ccedil;in otomatik &lt;strong&gt;HTTPS&lt;/strong&gt; &lt;strong&gt;end&lt;/strong&gt; &lt;strong&gt;point&lt;/strong&gt; tanımlaması getirilmiş, &lt;strong&gt;WebSockets&lt;/strong&gt; &amp;uuml;zerinden haberleşme imkanı sunulmuş vb&amp;hellip;Bu tip yenilikleri kısa kısa da olsa paylaşmaya &amp;ccedil;alışıyor olacağım. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bonus Yenilik :&lt;/p&gt;
&lt;p&gt;WCF konfigurasyon dosyası &amp;uuml;zerinde artık daha fazla hakimiyetimiz var. Eğer sizlerde benim gibi WCF Service Configuration Editor yerine config dosyası i&amp;ccedil;erisinde ilerleyenlerdenseniz &amp;ouml;zellikle intelli-sense desteğinin eksik olmasından yakınanlardansınızdır.&lt;/p&gt;
&lt;p&gt;Ancak WCF 4.5 ile bu konuda &amp;ouml;nemli avantajlarımız var. &amp;Ouml;rneğin hatırlayamadığımız veya i&amp;ccedil;eride hangi s&amp;ouml;zleşme var bilmediğimiz durumlarda intelli-sense yardımımıza yetişiyor. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_124.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfnf_7.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfnf_7" src="/pics/wcfnf_7_thumb.png" alt="wcfnf_7" width="614" height="225" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href="/pics/2012%2f9%2fContosoService.zip"&gt;ContosoService.zip (23,61 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2012-09-18 05:50:00</pubDate>
  <slug>WCF-4-Dot-5-SingleWSDL</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
    <tag>wcf-45</tag>
    <tag>wsdl</tag>
    <tag>singlewsdl</tag>
  </tags>
  <categories>
    <category>WCF 4.5</category>
  </categories>
</post>