<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF WebHttp Services - Error Handling</title>
  <description>Bu yazımızda WCF Eco System' in bir parçası olan WebHttp Service' lerinde hata yönetimini(Error Management) etkili bir şekilde nasıl ele alabileceğimizi incelemeye çalışıyor olacağız.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f1%2fblg136_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bu yazımızda &lt;strong&gt;WCF Eco System'&lt;/strong&gt; in bir par&amp;ccedil;ası olan &lt;strong&gt;WebHttp Service'&lt;/strong&gt; lerinde &lt;strong&gt;hata y&amp;ouml;netimini(Error Management)&lt;/strong&gt;&amp;nbsp;etkili bir şekilde nasıl ele alabileceğimizi incelemeye &amp;ccedil;alışıyor olacağız. &lt;strong&gt;WCF WebHttp Service'&lt;/strong&gt; leri &amp;uuml;zerinden &amp;ccedil;ağırılan bir servis operasyonundan, istemci tarafına kendi insiyatifimizde hata mesajları g&amp;ouml;nderilmesini sağlayabiliriz.&lt;/p&gt;
&lt;p&gt;&amp;Uuml;stelik bu mesajları bilinen &lt;strong&gt;HTTP durum kodları(HTTP Status Code)&lt;/strong&gt;&amp;nbsp;&amp;ccedil;er&amp;ccedil;evesinde yayınlayabiliriz. Bu tip bir isteğin &amp;ccedil;eşitli sebepleri olabilir. Hemen bir ger&amp;ccedil;ek hayat senaryosu &amp;uuml;zerinden ilerleyerek bu basit konuyu pekiştirmeye &amp;ccedil;alışalım. Bu ama&amp;ccedil;la &lt;strong&gt;Visual Studio 2010 Ultimate RC &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde geliştirdiğimiz ve &amp;nbsp;aşağıdaki kod i&amp;ccedil;eriğine&amp;nbsp;sahip bir &lt;strong&gt;WCF REST Service Application&lt;/strong&gt; projemiz olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic;
using System.Linq;
using System.ServiceModel;
using System.ServiceModel.Activation;
using System.ServiceModel.Web;

namespace ServerApp
{
    [ServiceContract]
    [AspNetCompatibilityRequirements(RequirementsMode = AspNetCompatibilityRequirementsMode.Allowed)]
    [ServiceBehavior(InstanceContextMode = InstanceContextMode.PerCall)]
    public class AzonBookService
    {
        static List&amp;lt;Book&amp;gt; books = new List&amp;lt;Book&amp;gt;
            {
                new Book{ Id=1002, Name="Programming WCF 4.0",ListPrice=12.00M},
                new Book{Id=9034,Name="Pro Asp.Net 4.0",ListPrice=34.90M},
                new Book{Id=4560,Name="Algebra",ListPrice=122.39M},
                new Book{Id=1200,Name="C# 3.5 Cookbook",ListPrice=14.45M},
                new Book{Id=1201,Name="Pro C# 4.0 and .Net Framework 4.0",ListPrice=34.05M},
                new Book{Id=1201,Name="Beginning Ado.Net Entity Framework",ListPrice=14.55M}
            };

        [WebGet(UriTemplate = "/{firstLetter}")]
        public List&amp;lt;Book&amp;gt; GetBooks(string firstLetter)
        {
            return (from book in books
                   where book.Name.StartsWith(firstLetter)
                   select book).ToList();
        }
    }

    public class Book
    {
        public int Id { get; set; }
        public string Name { get; set; }
        public decimal ListPrice { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;AzonBookService&lt;/strong&gt; &amp;ccedil;ok basit ve tek bir operasyona sahiptir. &lt;strong&gt;GetBooks&lt;/strong&gt; isimli operasyon &lt;strong&gt;HTTP Get &lt;/strong&gt;metoduna g&amp;ouml;re hizmet vermekte olup baş harfleri &lt;strong&gt;firstLetter &lt;/strong&gt;parametresin ile gelen değer ile başlayan bir &lt;strong&gt;List&amp;lt;Book&amp;gt; &lt;/strong&gt;koleksiyonunu geriye d&amp;ouml;nd&amp;uuml;rmektedir. Bu servisi bir tarayıcı uygulama &amp;uuml;zerinden test ettiğimizde ve &amp;ouml;rneğin &lt;strong&gt;Pro &lt;/strong&gt;kelimesi ile başlayan kitapları elde etmek istediğimizde aşağıdaki ekran g&amp;ouml;r&amp;uuml;t&amp;uuml;s&amp;uuml;ndekine benzer sonu&amp;ccedil;lar ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg136_Runtime1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu noktaya kadar zaten herhangibir sorun bulunmamaktadır.&amp;nbsp;Ancak &amp;ouml;rneğin&amp;nbsp;&lt;strong&gt;&amp;Ccedil; &lt;/strong&gt;harfi ile başlayan kitapların listesini elde etmek istediğimizde, aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg136_Runtime2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi bu noktada geliştirici olarak bir karar verebiliriz. İstemci tarafına bu şekilde boş bir &lt;strong&gt;XML&lt;/strong&gt; i&amp;ccedil;eriği d&amp;ouml;nd&amp;uuml;rmemiz halinde, istemci tarafının &lt;strong&gt;&amp;Ccedil; &lt;/strong&gt;harfi ile başlayan kitapların olmaması durumunu ele alması gerekmektedir. Yani istemci tarafına ek bir iş y&amp;uuml;k&amp;uuml; getirmiş olabiliriz. Nitekim istemcinin d&amp;ouml;nen listenin eleman sayısına bakara bir karar vermesi gerekmektedir. Diğer yandan istemciyi bilin&amp;ccedil;li bir şekilde uyarabiliriz de. Nasıl mı? Servis tarafındaki &amp;ccedil;alışma zamanında &amp;uuml;reteceğimiz ve o anki vakaya uygun bir &lt;strong&gt;istisna(Exception) &lt;/strong&gt;ile. Tabiki bu istisna mesajı servis bazlı bir yapı &amp;uuml;zerinden ele alınacağı i&amp;ccedil;in istemci tarafına g&amp;ouml;nderilecek paketin i&amp;ccedil;erisine g&amp;ouml;m&amp;uuml;lecektir. &lt;strong&gt;WCF WebHttp Service' &lt;/strong&gt;lerinde bu tip istisnaları ele almak i&amp;ccedil;in &lt;strong&gt;WCF &lt;/strong&gt;tarafından bildiğimiz &lt;strong&gt;FaultException &lt;/strong&gt;tipinden t&amp;uuml;reyen &lt;strong&gt;WebFaultException &lt;/strong&gt;sınıfından yararlanılır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg136_WebFaultException.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;System.ServiceModel.Web&lt;/strong&gt; isim alanı altında yer alan &lt;strong&gt;WebFaultException&lt;/strong&gt; tipinin normal ve generic olan versiyonları bulunmaktadır. İlgili tipleri kullanımları son derece basittir. Yukarıdaki senaryomuza g&amp;ouml;re istemciye aradığı kriterlere uygun bir i&amp;ccedil;erik bulunamadığını bildirmek amacıyla, &lt;strong&gt;GetBooks&lt;/strong&gt; isimli servis operasyonunu&amp;nbsp;aşağıdaki gibi değiştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[WebGet(UriTemplate = "/{firstLetter}")]
public List&amp;lt;Book&amp;gt; GetBooks(string firstLetter)
{
	var result=(from book in books
		   where book.Name.StartsWith(firstLetter)
		   select book).ToList();

	if (result.Count == 0)
		throw new WebFaultException&amp;lt;string&amp;gt;("Talep edilen kelime ile başlayan kitaplar sistemde mevcut değiller.", System.Net.HttpStatusCode.NotFound);

	return result;
}&lt;/pre&gt;
&lt;p&gt;Burada dikkat edileceği &amp;uuml;zere sonu&amp;ccedil; listesinin eleman sayısı kontrol edilmiş ve eğer &lt;strong&gt;0 &lt;/strong&gt;ise &lt;strong&gt;WebFaultException &lt;/strong&gt;tipinden bir istisna mesajı fırlatılması sağlanmıştır. &lt;strong&gt;WebFaultException &lt;/strong&gt;tipinin &amp;ouml;rneklenmesi sırasında dikkat edilmesi gereken hususlardan biriside &lt;strong&gt;HttpStatusCode.NotFound Enum sabiti &lt;/strong&gt;değerinin verilmesidir. Bu şekilde istemci tarafına hangi &lt;strong&gt;HTTP durum kodunun(Status Code) &lt;/strong&gt;g&amp;ouml;nderileceği belirlenmektedir. Tahmin edeceğiniz &amp;uuml;zere pek &amp;ccedil;ok&lt;strong&gt; HTTP Status Code&lt;/strong&gt; değeri bulunmaktadır.&lt;/p&gt;
&lt;p&gt;Aslında tam liste&amp;nbsp;i&amp;ccedil;eriği şudur&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Accepted, Ambiguous, BadGateway, BadRequest, Conflict, Continue, Created, Expectation Failed, Forbidden, Found, GatewayTimeout, Gone, HttpVersionNotSupported, InternalServerError, LengthRequired, MethodNotAllowed, Moved, MovedPermanently, MultipleChoices, NoContent, NonAuthoritativeInformation, NotAcceptable, NotFound, NotImplemented, NotModified, OK, PartialContent, PaymentRequired, PreconditionFailed, ProxyAuthenticationRequired, Redirect, RedirectKeepVerb, RedirectMethod, RequestedRangeNotSatisfiable, RequestEntityTooLarge, RequestTimeout, RequestUriTooLong, ResetContent, SeeOther, ServiceUnavailable, SwitchingProtocols, TemporaryRedirect, Unauthorized, UnsupportedMediaType, Unused, UseProxy&lt;/p&gt;
&lt;p&gt;Operasyonumuzu bu yeni haliyle denediğimizde ise tarayıcı uygulama &amp;uuml;zerinde aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len &amp;ccedil;ıktı ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg136_HTTP404.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ki bu son derece doğaldır.&lt;/p&gt;
&lt;p&gt;Nitekim zaten &lt;strong&gt;HTTP 404&lt;/strong&gt; mesajının istemci tarafına g&amp;ouml;nderilmesi sağlanmaktadır. &lt;strong&gt;WebFaultException&amp;lt;T&amp;gt; &lt;/strong&gt;sınıfının &amp;ouml;rneklenmesi sırasında &lt;strong&gt;T &lt;/strong&gt;parametresi de &amp;ouml;nemlidir. &amp;Ouml;rneğimizde basit bir string tipi kullanılmıştır. Peki ya kullanıcı tanımlı bir tip buraya dahil edilebilir mi? Gelin hem bu durumu hemde istemci uygulamanın geliştiriciler tarafından yazılması halinde s&amp;ouml;z konusu hata mesajlarının nasıl ele alındığı &amp;ouml;rneğimizi g&amp;uuml;ncelleyerek irdelemeye &amp;ccedil;alışalım. Bu ama&amp;ccedil;la servisimizi aşağıdaki hale getirelim.&lt;/p&gt;
&lt;p&gt;...Kodun diğer kısmı&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt; [WebGet(UriTemplate = "/{firstLetter}")]
        public List&amp;lt;Book&amp;gt; GetBooks(string firstLetter)
        {
            var result=(from book in books
                   where book.Name.StartsWith(firstLetter)
                   select book).ToList();

            if (result.Count == 0)
                throw new WebFaultException&amp;lt;ErrorInformation&amp;gt;(
                    new ErrorInformation { SearchLetter = firstLetter, SearchTime = DateTime.Now, Summary = "Talep edilen kelime ile başlayan kitaplar sistemde mevcut değiller." }
                    , System.Net.HttpStatusCode.NotFound);

            return result;
        }
    }

    public class ErrorInformation
    {
        public string SearchLetter { get; set; }
        public DateTime SearchTime { get; set; }
        public string Summary { get; set; }  
    }&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında &lt;strong&gt;WebHttpException&amp;lt;ErrorInformation&amp;gt;&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneklenmiştir. Buna g&amp;ouml;re istemci tarafına bu i&amp;ccedil;eriğin &lt;strong&gt;XML&lt;/strong&gt; veya &lt;strong&gt;JSON &lt;/strong&gt;formatında g&amp;ouml;nderilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Gelelim istemci tarafının kodlarına. Nitekim bir şekilde servis tarafından gelen i&amp;ccedil;eriği kontrol atlına almamız gerekmekte.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using Microsoft.Http;

namespace ClientApp
{
    class Program
    {
        static void Main(string[] args)
        {
            using (HttpClient client = new HttpClient("http://localhost:12654/Azon/"))
            {
                HttpResponseMessage response=client.Get("&amp;Ccedil;");

                Console.WriteLine("Http Status Code : {0}\n",response.StatusCode.ToString());
                Console.WriteLine("Content : {0}\n",response.Content.ReadAsString());

            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;&amp;Ccedil;&lt;/strong&gt; harfi ile başlayan kitapların elde edilmesi i&amp;ccedil;in bir talep oluşturulmakta ve bu talep &lt;strong&gt;Get&lt;/strong&gt; metodu yardımıyla servis tarafına g&amp;ouml;nderilmektedir. &lt;strong&gt;Get&lt;/strong&gt; metodunun &amp;ccedil;ıktısı &lt;strong&gt;HttpResponseMessage&lt;/strong&gt; tipindendir. Elde edilen &lt;strong&gt;HttpResponseMessage&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt;StatusCode&lt;/strong&gt; &amp;ouml;zelliği yardımıyla servis tarafında &amp;uuml;retilen &lt;strong&gt;HttpStatusCode&lt;/strong&gt; &lt;strong&gt;Enum sabitinin &lt;/strong&gt;değeri elde edilir. Diğer yandan eğer istemci tarafından bir hata oluşuyorsa &lt;strong&gt;WebFaultException&lt;/strong&gt; nesnesinin oluşturulması sırasında kullanılan &lt;strong&gt;ErrorInformation&lt;/strong&gt; nesne &amp;ouml;rneğinin serileştirilmiş hali &lt;strong&gt;Content&lt;/strong&gt; &amp;ouml;zelliği &amp;uuml;zerinden elde edilebilmektedir. Buna g&amp;ouml;re &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg136_Client.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere servis operasyonu i&amp;ccedil;erisinde &amp;uuml;retilen &lt;strong&gt;ErrorInformation&lt;/strong&gt; bilgisi istemci tarafına &lt;strong&gt;XML&lt;/strong&gt; formatlı olacak şekilde aktarılmıştır. Sonu&amp;ccedil; olarak olası veya beklenen hatalar karşısında istemci tarafına uygun bir bildirim yapılması &lt;strong&gt;HTTP&lt;/strong&gt; durum kodları bazında m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f2%2fLesson4_RC.rar"&gt;Lesson4_RC.rar (174,57 kb)&lt;/a&gt; &lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 &lt;/strong&gt;&lt;strong&gt;Ultimate &lt;/strong&gt;&lt;strong&gt;Beta 2 S&amp;uuml;r&amp;uuml;m&amp;uuml;nde geliştirilmiş ancak RC s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde de test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-03-04 23:10:00</pubDate>
  <slug>WCF-WebHttp-Services-Error-Handling</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-40</tag>
    <tag>webhttp-services</tag>
    <tag>restful</tag>
    <tag>non-soap</tag>
    <tag>wcf-webhttp-services</tag>
  </tags>
  <categories>
    <category>WCF Eco System</category>
    <category>WCF WebHttp Services</category>
  </categories>
</post>