<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tuple Nedir? Anlamak, Bilmek İstiyorum.</title>
  <description>Tuple’ ın Türkçe' deki kelime karşılığı Demet olarak ifade edilmektedir. Matematikte elementlerin sıralanmış bir liste tasarımı olarak tanımlanmaktadır. Diğer yandan İlişkisel Veritabanı Sistemlerinde(Relational Database Management Systems) tablo içerisindeki bir satır olarak düşünülür. Dolayısıyla burada da sütunların sıralı bir dizisinden oluşan liste şeklinde ifade edildiğinde, Matematiksel tanımını da işaret ettiği ifade edilebilir.</description>
  <content>&lt;p&gt;&lt;a href="/pics/blg200_Giris.jpg"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border-width: 0px;" title="blg200_Giris" src="/pics/blg200_Giris_thumb.jpg" alt="blg200_Giris" width="304" height="229" align="right" border="0" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Matematik M&amp;uuml;hendisliği eğitimi almış birisi olarak hayatımın &amp;ouml;nemli bir kısmını teorem ispatlarına harcadığımı itiraf edebilirim. Tabi yaşamımın mesleki olarak kırılma anı sanıyorum ki &amp;uuml;niversite yıllarında bilgisayara merak salmam ve programlama ile alakalı dersleri daha &amp;ccedil;ok sevmemdi. Kısacası Matematik &amp;uuml;zerine eğilmekten vazge&amp;ccedil;ip&lt;em&gt;(ki bundan biraz pişmanlık duyduğumu ifade edebilirim)&lt;/em&gt; yazılım alanında ilerlemeyi kafama koymuştum.&lt;/p&gt;
&lt;p&gt;Ama tabiki insanoğlu Matematik&amp;rsquo; ten ka&amp;ccedil;amıyor. Hayatının belirli noktalarında &amp;ouml;yle ya da b&amp;ouml;yle karşılaşıyor. S&amp;ouml;z gelimi &amp;ccedil;alıştığım projelerin bazılarında, m&amp;uuml;şterinin sorunlarının &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; i&amp;ccedil;in matematiksel modellerin kullandığını s&amp;ouml;yleyebilirim. &amp;Ouml;rneğin bir &amp;uuml;retim hattının minimum maliyet gibi değerlere ulaşabilmesi i&amp;ccedil;in &amp;ccedil;alıştıracağı optimizasyon modelleri, d&amp;uuml;nyanın en zor matematik form&amp;uuml;llerini i&amp;ccedil;ermektedir. Yazıya yaptığımız bu giriş sizleri korkutmasın. Bu g&amp;uuml;nk&amp;uuml; konumuzun Matematik ile &amp;ccedil;ok alakası yok. Ancak Matematik d&amp;uuml;nyasından bir ismin yazılım tarafına ge&amp;ccedil;irlişini inceleyeceğimizi ifade edebilirim. Bu g&amp;uuml;nk&amp;uuml; konumuz, &lt;strong&gt;.Net Framework 4.0&lt;/strong&gt; ile birlikte gelen &lt;strong&gt;Tuple&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;&lt;a title="wikipedia Tuple" href="http://en.wikipedia.org/wiki/Tuple" target="_blank"&gt;Tuple&lt;/a&gt;&amp;rsquo; ın T&amp;uuml;rk&amp;ccedil;e' deki kelime karşılığı &lt;strong&gt;Demet&lt;/strong&gt; olarak ifade edilmektedir. Matematikte elementlerin sıralanmış bir liste tasarımı olarak tanımlanmaktadır. Diğer yandan &lt;strong&gt;İlişkisel Veritabanı Sistemlerinde(Relational Database Management Systems) &lt;/strong&gt;tablo i&amp;ccedil;erisindeki bir satır olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;l&amp;uuml;r. Dolayısıyla burada da s&amp;uuml;tunların sıralı bir dizisinden oluşan liste şeklinde ifade edildiğinde, Matematiksel tanımını da işaret ettiği ifade edilebilir. Bilgisayar literat&amp;uuml;r&amp;uuml;nde birden fazla par&amp;ccedil;adan oluşan yapı anlamında kullanılmaktadır. &lt;strong&gt;Python&lt;/strong&gt; dilinde ise&amp;nbsp;i&amp;ccedil;eriği değiştirilemeyen bir dizidir. &lt;strong&gt;Python&lt;/strong&gt; demişken. Aslında fonksiyonel programlama dillerinde &lt;strong&gt;Tuple&lt;/strong&gt; kavramının uzun s&amp;uuml;redir var olduğunu da ifade edebiliriz. Hatta &lt;strong&gt;F#&lt;/strong&gt; programlama dilinde de tuple kullanımı mevcuttur.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Not : Bildiğiniz &amp;uuml;zere Pyhton, LISP, Perl gibi dynamic dillerde tip belirtmeden değişken tanımlayabilmek m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Oysaki C# gibi static dillerde tip belirtme zorunluluğu vardır. Nitekim derleme işlemi sırasında değişkenlerin tiplerinin belli olması gereklidir. Bu dinamik dillerin değişken tanımlamada ve kullanmada sağladığı esnekliğin static dilde olmadığı anlamanı gelmektedir. Ancak static diller bu sayede daha az hata meyillidir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Diğer yandan &lt;strong&gt;Tuple&lt;/strong&gt; kavramı, &lt;strong&gt;C#&lt;/strong&gt; gibi static dillerde en azından&lt;strong&gt; 4.0&lt;/strong&gt; versiyonuna kadar ge&amp;ccedil;erli değildir. &lt;strong&gt;.Net Framework 4.0&lt;/strong&gt; ile birlikte gelen &amp;ouml;nemli yeniliklerden birisi de bildiğiniz &amp;uuml;zere dinamik diller ile olan etkileşimdir. Bu etkileşimin bir meyvesi veya &amp;ouml;n hazırlığı olarak &lt;strong&gt;Tuple&lt;/strong&gt; kavramının&lt;strong&gt; .Net Framework&lt;/strong&gt; b&amp;uuml;nyesine katıldığını da ifade edebiliriz.&lt;/p&gt;
&lt;p&gt;Bu kadar laf kalablığından sonra dilerseniz &amp;ouml;rnekler ile &lt;strong&gt;Tuple&lt;/strong&gt; tipini incelemeye &amp;ccedil;alışalım. &lt;strong&gt;System&lt;/strong&gt; isim alanı altında yer alan &lt;strong&gt;Tuple&lt;/strong&gt; sınıfı, &lt;strong&gt;Tuple&lt;/strong&gt; nesnelerinin &amp;uuml;retimi i&amp;ccedil;in bir &lt;strong&gt;fabrika(Factory)&lt;/strong&gt; g&amp;ouml;revi &amp;uuml;stlenmektedir. Bunun i&amp;ccedil;in &lt;a title="MSDN - Tuple Type" href="http://msdn.microsoft.com/en-us/library/system.tuple_members(v=VS.100).aspx" target="_blank"&gt;static Create&lt;/a&gt; metoduna ve &lt;strong&gt;aşırı y&amp;uuml;klenmiş(Overload)&lt;/strong&gt; versiyonlarına sahiptir. &lt;strong&gt;Tuple&lt;/strong&gt; tiplerini kullanmak i&amp;ccedil;in &amp;ccedil;eşitli sebepler ve senaryolar d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Şimdi bu durumları analiz etmeye &amp;ccedil;alışalım.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;1- Metodlardan İsimsiz Tip(Anonymous Type) D&amp;ouml;nd&amp;uuml;r&amp;uuml;lemediği Durumlar&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Aslında &lt;strong&gt;Anonymous&lt;/strong&gt; tipler &amp;ouml;zellikle &lt;strong&gt;LINQ(Language Integrated Query)&lt;/strong&gt;&amp;nbsp;sorguları i&amp;ccedil;in tasarlanmıştır. &lt;strong&gt;LINQ&lt;/strong&gt; sorgulaması sonucu elde edilen sonu&amp;ccedil; k&amp;uuml;mesinden anlık olarak karar verilen bir tipin ele alınması istendiği durumlarda olduk&amp;ccedil;a değerlidir. Lakin bu tipler metodlardan geriye &lt;span style="text-decoration: underline;"&gt;d&amp;ouml;nd&amp;uuml;r&amp;uuml;lememektedir&lt;/span&gt;. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Collections.Generic; 
using System.Linq;

namespace TupleKavrami 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            List&amp;lt;Person&amp;gt; employees = new List&amp;lt;Person&amp;gt; 
            { 
                new Person{ PersonId=1,Name="Burak", Surname="Şenyurt", City="İstanbul",Salary=1000}, 
                new Person{ PersonId=2,Name="Maykıl", Surname="Cordın", City="Chicago",Salary=1250}, 
                new Person{ PersonId=3,Name="Şakiyıl", Surname="Oniyıl", City="Los Angles",Salary=1100} 
            };

            List&amp;lt;Tuple&amp;lt;string, string,double&amp;gt;&amp;gt; result = GetEmployees(employees); 
            foreach (Tuple&amp;lt;string,string,double&amp;gt; r in result) 
            { 
                Console.WriteLine("{0} {1} Salary : {2}",r.Item1,r.Item2,r.Item3.ToString("C2")); 
            } 
        }

        static List&amp;lt;Tuple&amp;lt;string, string,double&amp;gt;&amp;gt; GetEmployees(List&amp;lt;Person&amp;gt; employees) 
        { 
            var result = (from e in employees 
                         select new Tuple&amp;lt;string, string,double&amp;gt;(e.Name, e.Surname,e.Salary)).ToList&amp;lt;Tuple&amp;lt;string,string,double&amp;gt;&amp;gt;();

            return result; 
        } 
    }

    class Person 
    { 
        public int PersonId { get; set; } 
        public string Name { get; set; } 
        public string Surname { get; set; } 
        public string City { get; set; } 
        public double Salary { get; set; } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında kayda değer pek &amp;ccedil;ok yeni &amp;ouml;zellik bulunmaktadır. &lt;strong&gt;GetEmployees&lt;/strong&gt; isimli metod, parametre olarak aldığı &lt;strong&gt;List&amp;lt;Person&amp;gt;&lt;/strong&gt; tipinden bir koleksiyon i&amp;ccedil;eriğini&amp;nbsp;sorgulamaktadır. Bu sorgulama sonucunda aslında bir &lt;strong&gt;anonymous&lt;/strong&gt; tip ile ifade edilebilecek yeni bir yapı değerlendirilmektedir. &lt;strong&gt;Person&lt;/strong&gt; tipi i&amp;ccedil;erisinde &lt;strong&gt;PersonId,Name,Surname,City&lt;/strong&gt; ve &lt;strong&gt;Salary&lt;/strong&gt; &amp;ouml;zellikleri yer alırken sorgu sonucu elde edilen satırlarda &lt;strong&gt;Name,Surname&lt;/strong&gt; ve &lt;strong&gt;Salary&lt;/strong&gt; &amp;ouml;zelliklerinin olması istenmektedir. Bu &amp;ouml;zellikler tahmin edileceği &amp;uuml;zere bir &lt;strong&gt;anonymous&lt;/strong&gt; tip i&amp;ccedil;erisinde yer alabilirler. Ancak &lt;strong&gt;Anonymous&lt;/strong&gt; tipin metoddan geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;lemediğini ifade etmiştik. İşte bu noktada devreye &lt;strong&gt;Tuple&lt;/strong&gt; tipini kattık.&lt;/p&gt;
&lt;p&gt;Dikkat edilecek olursa &lt;strong&gt;LINQ&lt;/strong&gt; sorgusu i&amp;ccedil;erisinde &lt;strong&gt;Tuple&amp;lt;string,string,double&amp;gt;&lt;/strong&gt; tipinden bir tanımlama yapılmaktadır. Bu noktada kodun o anki satırında 3 alandan oluşacak bir tip tasarladığımızı d&amp;uuml;ş&amp;uuml;nebiliriz. Bu tipin &amp;ouml;zelliklerine ait değerler ise o anki &lt;strong&gt;Person&lt;/strong&gt; nesne &amp;ouml;rneği i&amp;ccedil;erisinden alınmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Tuple&lt;/strong&gt; tipi ile ilişkili olarak dikkate değer noktalardan biriside &lt;strong&gt;foreach&lt;/strong&gt; bloğu i&amp;ccedil;erisinde kendisini g&amp;ouml;stermektedir. &lt;strong&gt;Tuple&lt;/strong&gt; tipinin &amp;ouml;rneklenen versiyonunda belirtilen &lt;strong&gt;generic&lt;/strong&gt; parametrelere g&amp;ouml;re &amp;ouml;zellikler &lt;strong&gt;Item1, Item2&lt;/strong&gt; ve &lt;strong&gt;Item3 &lt;/strong&gt;olarak ayarlanmıştır. Bu bir handikap olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Nitekim ele aldığımız &amp;ouml;rnekteki vakka d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde &lt;strong&gt;Person&lt;/strong&gt; tipi i&amp;ccedil;erisinden &amp;ccedil;ekilen &lt;strong&gt;Name,Surname&lt;/strong&gt; ve &lt;strong&gt;Salary&lt;/strong&gt; alan adlarının &lt;strong&gt;Item1, Item2 &lt;/strong&gt;ve &lt;strong&gt;Item3 &lt;/strong&gt;yerine kullanılması daha esnektir. Bildiğiniz &amp;uuml;zere &lt;strong&gt;Anoynmous&lt;/strong&gt; tiplerde, oluşacak nesnenin o anki &amp;ouml;zelliklerinin adları aynen korunabileceği gibi geliştirici tarafından da tanımlanabilmektedir. Bu yeteniğin &lt;strong&gt;Tuple&lt;/strong&gt; tipine de ekleneceğini &amp;uuml;mit etmekteyim.&lt;/p&gt;
&lt;p&gt;Tabi bir diğer &amp;ouml;nemli nokta &lt;strong&gt;Tuple&lt;/strong&gt; nesne &amp;ouml;rneklemesi sırasında kullanılan &lt;strong&gt;T&lt;/strong&gt; tipinin &lt;strong&gt;generic&lt;/strong&gt;&amp;rsquo; liğidir. Buna g&amp;ouml;re &lt;strong&gt;Tuple&lt;/strong&gt; tipinin i&amp;ccedil;ereceği diğer tiplerin aynı olması zorunlu değildir. &amp;Ouml;rnekte &lt;strong&gt;string,string,double&lt;/strong&gt; tipinden bir oluşum s&amp;ouml;z konusudur. &amp;Ccedil;alışma zamanı sonu&amp;ccedil;ları aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg200_FirstRuntime.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg200_FirstRuntime" src="/pics/blg200_FirstRuntime_thumb.gif" alt="blg200_FirstRuntime" width="434" height="113" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;2 &amp;ndash; Metodlardan Birden Fazla Değer D&amp;ouml;nd&amp;uuml;rmek İstediğimiz ve out Parametrelerini Tercih Ettiğimiz Durumlar.&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Aslında bunun i&amp;ccedil;in pek &amp;ccedil;ok yol mevcuttur. &lt;strong&gt;out&lt;/strong&gt; tipinden metod parametreleri veya d&amp;ouml;n&amp;uuml;ş tipi olarak bir koleksiyon ya da dizi kullanılması s&amp;ouml;z konusu olabilir. Ancak &lt;strong&gt;Tuple&lt;/strong&gt; tipi de bu anlamda değerlendirilebilir. S&amp;ouml;z gelimi aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Collections.Generic; 
using System.Linq;

namespace TupleKavrami 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            int r1, r2, r3, r4; 
            Calculate(4, 2, out r1, out r2, out r3, out r4); 
            Console.WriteLine("{0} {1} {2} {3}",r1,r2,r3,r4); 
        }

        static void Calculate(int x, int y, out int result1, out int result2, out int result3, out int result4) 
        { 
            result1 = x + y; 
            result2 = x - y; 
            result3 = x * y; 
            result4 = x / y; 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında yer alan &lt;strong&gt;Calculate&lt;/strong&gt; metodu d&amp;ouml;rt işlemi ger&amp;ccedil;ekleştirmekte ve elde edilen sonu&amp;ccedil;ları &lt;strong&gt;out&lt;/strong&gt; tipinden metod parametreleri ile geriye d&amp;ouml;nd&amp;uuml;rmektedir. Bu &amp;ouml;rnekte &lt;strong&gt;out&lt;/strong&gt; parametrelerinin kullanımı yerine geri d&amp;ouml;n&amp;uuml;ş tipinin &lt;strong&gt;Tuple&lt;/strong&gt; olarak tanımlaması da d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Aşağıdaki kod par&amp;ccedil;asında bu durum ele alınmaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Collections.Generic; 
using System.Linq;

namespace TupleKavrami 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            Tuple&amp;lt;int, int, int, int&amp;gt; calculation = CalculateV2(4, 2); 
            Console.WriteLine("{0} {1} {2} {3}",calculation.Item1,calculation.Item2,calculation.Item3,calculation.Item4); 
        }

        static Tuple&amp;lt;int, int, int, int&amp;gt; CalculateV2(int x, int y) 
        { 
            return Tuple.Create&amp;lt;int, int, int, int&amp;gt;(x + y, x - y, x * y, x / y); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;a href="/pics/blg200_SecondRuntime.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg200_SecondRuntime" src="/pics/blg200_SecondRuntime_thumb.gif" alt="blg200_SecondRuntime" width="389" height="79" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;CalculateV2&lt;/strong&gt; isimli metod geriye &lt;strong&gt;Tuple&amp;lt;int,int,int,int&amp;gt;&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneği d&amp;ouml;nd&amp;uuml;recek şekilde programlanmıştır. Bu seferki kod &amp;ouml;rneğimizde &lt;strong&gt;Tuple&lt;/strong&gt; nesne &amp;ouml;rneğini oluşturmak i&amp;ccedil;in &lt;strong&gt;Tuple&lt;/strong&gt; sınıfının &lt;strong&gt;static Create&lt;/strong&gt; metodu tercih edilmiştir. Tabi bu &amp;ouml;rnekte &lt;strong&gt;Tuple&lt;/strong&gt; nesne &amp;ouml;rneği i&amp;ccedil;erisindeki t&amp;uuml;m tipler &lt;strong&gt;integer &lt;/strong&gt;olarak tanımlanmıştır.&amp;nbsp;Ancak b&amp;ouml;yle bir zorunluluk olmadığını da daha &amp;ouml;nceden belirtmiştik. Yani &lt;strong&gt;Tuple&lt;/strong&gt; tipi, kendi i&amp;ccedil;erisinde farklı tipleri barındırabilmektedir. Tabi sonu&amp;ccedil;ları ele aldığımız kod satırından &lt;strong&gt;Tuple&lt;/strong&gt; nesne &amp;ouml;rneği i&amp;ccedil;erisindeki değerlere yine &lt;strong&gt;Item1, Item2 , Item3&lt;/strong&gt; ve &lt;strong&gt;Item4&lt;/strong&gt; isimli &amp;ouml;zellikler ile erişebildiğimize dikkat edelim.&lt;/p&gt;
&lt;p&gt;Aslında &lt;strong&gt;Tuple&lt;/strong&gt; nesne &amp;ouml;rnekleri oluşturulurken daha kısa kod notasyonları da tercih edilebilir. &lt;strong&gt;CalculateV2&lt;/strong&gt; metodunun i&amp;ccedil;eriğini bu anlamda aşağıdaki gibi de kullanabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static Tuple&amp;lt;int, int, int, int&amp;gt; CalculateV2(int x, int y) 
{ 
	//return Tuple.Create&amp;lt;int, int, int, int&amp;gt;(x + y, x - y, x * y, x / y); 
	return Tuple.Create(x + y, x - y, x * y, x / y); 
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere burada &lt;strong&gt;Create&lt;/strong&gt; metodunun parametrelerine doğrudan hesaplama sonu&amp;ccedil;ları atanmış ama herhangibir şekilde tip bilgisi belirtilmemiştir.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;3 &amp;ndash; Bir metoda birden fazla parametre g&amp;ouml;ndermek istediğimiz bazı durumlarda&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Zaten bir metoda &lt;strong&gt;n&lt;/strong&gt; sayıda parametre g&amp;ouml;nderebilmekteyiz. Ancak bizim m&amp;uuml;dahale edemediğimiz &amp;ouml;nceden tanımlanmış tip metodları, sadece tek parametre alarak &lt;strong&gt;n&lt;/strong&gt; sayıda parametre aktarımını biraz zorlaştırmaktadır. Bu tip durumlar elbetteki &amp;ccedil;&amp;ouml;z&amp;uuml;ms&amp;uuml;z değildir. S&amp;ouml;z gelimi dizi veya koleksiyon yardımıyla birden fazla parametre taşınması s&amp;ouml;z konusu olabilir. Ancak bu tip bir vakada &lt;strong&gt;Tuple&lt;/strong&gt; tiplerinden de yararlanabiliriz. Bu anlamda parametre alabilen metodların &lt;strong&gt;Thread&lt;/strong&gt; y&amp;ouml;netimlerini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Collections.Generic; 
using System.Linq; 
using System.Threading;

namespace TupleKavrami 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            ParameterizedThreadStart ts = new ParameterizedThreadStart(ThreadMethod); 
            Thread t = new Thread(ts); 
            t.Start(Tuple.Create(1, 9.23F, 2)); 
        }

        static void ThreadMethod(object values) 
        { 
            Tuple&amp;lt;int, float, int&amp;gt; tpl = (Tuple&amp;lt;int,float,int&amp;gt;)values; 
            Console.WriteLine("Gelen değerler {0} {1} {2}",tpl.Item1,tpl.Item2,tpl.Item3); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;ParameterizedThreadStart&lt;/strong&gt;, &lt;strong&gt;Thread&lt;/strong&gt;' lerin başlatacağı metodlara parametre aktarımına izin vermektedir. Ancak bu noktada &lt;strong&gt;object&lt;/strong&gt; tipinden parametre alan metodlar işaret edilebilmektedir. &amp;Ouml;rnek kod par&amp;ccedil;asında&lt;strong&gt; t&lt;/strong&gt; isimli &lt;strong&gt;Thread&lt;/strong&gt; nesne &amp;ouml;rneği &amp;uuml;zerinden &lt;strong&gt;Start&lt;/strong&gt; metodu &amp;ccedil;ağrısı ger&amp;ccedil;ekleştirilirken, bir &lt;strong&gt;Tuple&lt;/strong&gt; nesne &amp;ouml;rneği g&amp;ouml;nderilmektedir. &lt;strong&gt;ThreadMethod&lt;/strong&gt; i&amp;ccedil;erisindeki kod bloğunda ise dikkat edileceği &amp;uuml;zere &lt;strong&gt;object&lt;/strong&gt; tipinden olan parametre bilin&amp;ccedil;li bir şekilde&amp;nbsp;&lt;strong&gt;Tuple&amp;lt;int,float,int&amp;gt;&lt;/strong&gt; tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;ld&amp;uuml;kten&amp;nbsp;sonra kullanılabilmiştir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg200_Runtime3.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg200_Runtime3" src="/pics/blg200_Runtime3_thumb.gif" alt="blg200_Runtime3" width="416" height="74" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Peki Tuple Tipi i&amp;ccedil;in Eleman Sayısı Sınırı var mıdır?&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Bu &amp;ouml;rnekler ile Tuple kullanımının nasıl yapılabildiğini ve hangi durumlarda değerlendirilebildiğini kısaca incelemeye &amp;ccedil;alıştık. Son olarak &lt;strong&gt;Tuple&lt;/strong&gt; tipinin ka&amp;ccedil; i&amp;ccedil; tip ile &amp;ccedil;alışabildiğine bakıyor olacağız. Normal şartlar altında aşırı y&amp;uuml;klenmiş &lt;strong&gt;static Create&lt;/strong&gt; veya&lt;strong&gt; yapıcı metodlarına(Constructors)&lt;/strong&gt; baktığımızda en fazla 8 elemanın s&amp;ouml;z konusu olduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;static Create metodu i&amp;ccedil;in;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public static Tuple&amp;lt;T1, T2, T3, T4, T5, T6, T7, Tuple&amp;lt;T8&amp;gt;&amp;gt; Create&amp;lt;T1, T2, T3, T4, T5, T6, T7, T8&amp;gt;( 
    T1 item1, 
    T2 item2, 
    T3 item3, 
    T4 item4, 
    T5 item5, 
    T6 item6, 
    T7 item7, 
    T8 item8 
)&lt;/pre&gt;
&lt;p&gt;yapıcı metodu i&amp;ccedil;in;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public Tuple( 
    T1 item1, 
    T2 item2, 
    T3 item3, 
    T4 item4, 
    T5 item5, 
    T6 item6, 
    T7 item7, 
    TRest rest 
)&lt;/pre&gt;
&lt;p&gt;Dolayısıya bu notkada sadece 8 elemanlı bir &lt;strong&gt;Tuple&lt;/strong&gt; oluşturabileceğimizi zannedebiliriz. Ancak ş&amp;ouml;yle bir kural da yoktur;&lt;strong&gt; Tuple i&amp;ccedil;erisindeki item değişkenleri Tuple olamaz&lt;/strong&gt;&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Yani k&amp;uuml;&amp;ccedil;&amp;uuml;k bir&amp;nbsp;hile yapıyor olacağız.&amp;nbsp;Aşağıda g&amp;ouml;r&amp;uuml;len &amp;ouml;rnek kod par&amp;ccedil;asını ele alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var nTuple = Tuple.Create( 
                1 
                , "Burak" 
                , true 
                , Tuple.Create(1, 2, 4, 6, 0) 
                , new Person 
                { 
                    PersonId = 1 
                    , Name = "Burak" 
                    , Surname = "Şenyurt" 
                    , City = "İstanbul" 
                    , Salary = 1000 } 
                , 90.45F 
                , 91023 
                ,'A' 
                );&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;nTuple&lt;/strong&gt; isimli değişken ilk etapta 8 elemanlı g&amp;ouml;r&amp;uuml;lmektedir. Ancak &lt;strong&gt;4nc&amp;uuml;&lt;/strong&gt; elemanın kendisi de bir &lt;strong&gt;Tuple&amp;nbsp;&lt;/strong&gt;nesne &amp;ouml;rneğidir&amp;nbsp;ve 5 eleman i&amp;ccedil;ermektedir. Dolayısıyla bu tip bir kullanım sayesinde 8 eleman zorunluluğu aşılabilir. Tabi bu durumda &lt;strong&gt;4nc&amp;uuml; &lt;/strong&gt;elemana ulaşıldığında kendi altındaki elemanlarında yine &lt;strong&gt;Item[indis]&lt;/strong&gt; isimlendirmesi ile sunulduğu g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg200_DebugTime.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg200_DebugTime" src="/pics/blg200_DebugTime_thumb.gif" alt="blg200_DebugTime" width="234" height="212" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Biraz &amp;ouml;nceki &amp;ouml;rnekte&amp;nbsp;&lt;strong&gt;Create &lt;/strong&gt;metodu değerlendirilmektedir. Eğer &lt;strong&gt;Constructor&lt;/strong&gt; metod i&amp;ccedil;in benzer bir durum ele alınmak istenirse en sonda yer alan &lt;strong&gt;Rest&lt;/strong&gt; isimli parametrenin kullanılması tercih edilir. Aşağıdaki kod par&amp;ccedil;asında bu durumda ele alınmaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var nTupleV2 = new Tuple&amp;lt;byte, string, bool, Person, float, int, char, Tuple&amp;lt;int,int, int, int, int&amp;gt;&amp;gt; 
            ( 
            1 
            , "Burak" 
            , true                
            , new Person 
            { 
                PersonId = 1, 
                Name = "Burak", 
                Surname = "Şenyurt", 
                City = "İstanbul", 
                Salary = 1000 
            } 
            , 90.45F 
            , 91023 
            , 'A' 
            , Tuple.Create(1, 2, 4, 6, 0) 
            );&lt;/pre&gt;
&lt;p&gt;Burada dikkat edileceği &amp;uuml;zere son parametrede yine bir &lt;strong&gt;Tuple&lt;/strong&gt; nesnesi &amp;ouml;rneklenmiştir. Bu durumda &lt;strong&gt;Rest&lt;/strong&gt; isimli &amp;ouml;zellik &amp;uuml;zerinden,&amp;nbsp;en sonda&amp;nbsp;eklenen &lt;strong&gt;Tuple&lt;/strong&gt; nesne &amp;ouml;rneği i&amp;ccedil;eriği yakalanabilir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg200_DebugTime2.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg200_DebugTime2" src="/pics/blg200_DebugTime2_thumb.gif" alt="blg200_DebugTime2" width="225" height="204" border="0" /&gt;&lt;/a&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Sanıyorum ki &lt;strong&gt;Tuple&lt;/strong&gt; tipi ve kullanım alanları hakkında az da olsa fikir sahibi olduk. .Net Framework 4.0 ile gelen yenilikleri incelemeye devam ediyor olacğaız. Bir sonraki yazımızda g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f6%2fTupleKavrami.rar"&gt;TupleKavrami.rar (25,36 kb)&lt;/a&gt;&lt;strong&gt;&amp;nbsp;[&amp;Ouml;rnek Visual Studio 2010 Ultimate s&amp;uuml;r&amp;uuml;m&amp;uuml;nde geliştirilmiş ve test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-12-01 03:55:00</pubDate>
  <slug>Tuple-Nedir-Anlamak-Bilmek-Istiyorum</slug>
  <tags>
    <tag>c#-40</tag>
    <tag>tuple</tag>
  </tags>
  <categories>
    <category>.Net Framework 4.0</category>
    <category>C# 4.0</category>
  </categories>
</post>