<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Oyun Programlamaya Giriş (Çarpışma Teknikleri - 1)</title>
  <description>Yaklaşık bir ay kadar önce evde dinlenirken, şu ana kadar yaptığım işleri ve projeleri düşündüm. Kesin olarak şunu söyliyebilirim ki, profesyonel anlamda ilgilendiğim ve kullandığım tek dil C# idi. C# dilini kullanarak, .Net platformu altında veritabanı ağırılıklı olmak üzere çeşitli çalışmalar yaptım. Ancak bir süre sonra farkettim ki, bir Matematik Mühendisi olarak lisans eğitimim sırasında gördüğüm o devasa cebir problemleri, teorem ispatları hiç bir zaman işin içine girmemişti. Matematiğin belkide çok az olmakla birlikte dört işleminin ve bir takım algoritmalar için gerekli iteratif ifadelerinin yer aldığı uygulamalar dışında, onu çok yoğun şekilde kullanmamıştım.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Yaklaşık bir ay kadar &amp;ouml;nce evde dinlenirken, şu ana kadar yaptığım işleri ve projeleri d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m. Kesin olarak şunu s&amp;ouml;yliyebilirim ki, profesyonel anlamda ilgilendiğim ve kullandığım tek dil C# idi. C# dilini kullanarak, .Net platformu altında veritabanı ağırılıklı olmak &amp;uuml;zere &amp;ccedil;eşitli &amp;ccedil;alışmalar yaptım. Ancak bir s&amp;uuml;re sonra farkettim ki, bir Matematik M&amp;uuml;hendisi olarak lisans eğitimim sırasında g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m o devasa cebir problemleri, teorem ispatları hi&amp;ccedil; bir zaman işin i&amp;ccedil;ine girmemişti. Matematiğin belkide &amp;ccedil;ok az olmakla birlikte d&amp;ouml;rt işleminin ve bir takım algoritmalar i&amp;ccedil;in gerekli iteratif ifadelerinin yer aldığı uygulamalar dışında, onu &amp;ccedil;ok yoğun şekilde kullanmamıştım.&lt;/p&gt;
&lt;p&gt;Belki finansal veya istatistiki bir projede yoğun olarak ekonomi teoremlerini ve bunlara bağlı olarak matematiksel denklemleri kullanmak gerekmekteydi ancak &amp;ccedil;ok yoğun bir şekilde bunları kurcalamamıştım. D&amp;uuml;ş&amp;uuml;nd&amp;uuml;k&amp;ccedil;e, g&amp;uuml;n&amp;uuml;m&amp;uuml;z d&amp;uuml;nyasında artık algoritmalar ile, matematik ile uğraşan yazılımcıların azaldığı kanısına vardım. Hepimizde matematik temeli var. Hepimiz bu konuda &amp;ccedil;eşitli sınavlardan ge&amp;ccedil;tik. Ama sonu&amp;ccedil; itibariyle &amp;ccedil;ok az projede, daha &amp;ouml;nceden g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z eşsiz teoremleri kullandık. O dakikalarda neden bu y&amp;ouml;ne eğilmiyorum, biraz eğlenceli hatta matematik y&amp;uuml;kl&amp;uuml; &amp;ccedil;alışmalara el atmıyorum diye d&amp;uuml;ş&amp;uuml;nmeye başladım. Derken &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; son derece eğlenceli ama bir o kadarda &amp;ouml;nemli bir sahada buldum. Oyun Programcılığı.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;oğumuz, yazılım geliştirirken bir g&amp;uuml;n b&amp;uuml;y&amp;uuml;k bir oyunu yazan ekibin i&amp;ccedil;inde olmayı, onun geliştiricilerinden birisi olarak anılmayı hayal etmişizdir. Bu &amp;ccedil;ok &amp;ccedil;alışmayı ve birazda zeki olmayı gerektiren bir kişilik ister. Kendi kendime d&amp;uuml;ş&amp;uuml;n&amp;uuml;rken, elbette g&amp;uuml;n&amp;uuml;m&amp;uuml;z&amp;uuml;n pop&amp;uuml;ler oyunlarından birisini yazan herhangibir ekipte olabilmek i&amp;ccedil;in &amp;ccedil;ok erken olduğunu zaten biliyordum. Ama en azından bir oyun i&amp;ccedil;in gerekli en temel bileşene biraz da olsa aşinalığım vardı. Matematik. Oyun programlama i&amp;ccedil;erisinde, oyun motorlarının geliştirilmesinden aksiyonların uygulanışına, yapay zeka taktiklerinden stratejik karar mekanizmalarına kadar her aşamada Matematiksel algoritmaların yer aldığını gayet iyi biliyordum. Benim i&amp;ccedil;in bunları &amp;ouml;ğrenmeye &amp;ccedil;alışmak, uygulamak ve denemek, benim i&amp;ccedil;in heyecan verici olacaktı. Diğer taraftan eski Matematik g&amp;uuml;nlerimi hatırlamış bir başka deyişle saksıyı biraz daha &amp;ccedil;alıştırmış olacaktım.&lt;/p&gt;
&lt;p&gt;B&amp;uuml;y&amp;uuml;k bir hevesle bir taslak plan hazırladım ve işe koyuldum. Bana &amp;ouml;ncelikle oyun programlamadaki temel teknikleri başlangı&amp;ccedil; seviyesinden itibaren anlatacak ve yeri geldiğinde de uzmanlık seviyesine kadar &amp;ccedil;ıkartacak kitaplar gerekliydi. Hemen Amazon.com' da kısa bir araştırmadan sonra aşağıdaki kitapların siparişlerini verdim.&lt;/p&gt;
&lt;table id="table3" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td colspan="2" align="center"&gt;&lt;strong&gt; Oyun Programlama İle İlgili Kaynak Kitaplar&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="14%"&gt;&lt;img src="/makale/images/mk106_6.gif" alt="" width="108" height="143" border="0" /&gt;&lt;/td&gt;
&lt;td width="82%"&gt;&lt;strong&gt;Beginning .Net Game Programming in C# &lt;/strong&gt;&lt;br /&gt; APress&lt;br /&gt; David Weller, Alexandre Santos Lobao, Elen Hatton&lt;br /&gt; 414 Sayfa&lt;br /&gt; Amazon Fiyatı : 30.59$&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="14%"&gt;&lt;img src="/makale/images/mk106_7.gif" alt="" width="108" height="143" border="0" /&gt;&lt;/td&gt;
&lt;td width="82%"&gt;&lt;strong&gt;C# and Game Programming: A Beginner's Guide&lt;/strong&gt;&lt;br /&gt; AK Peters Ltd.&lt;span style="font-family: Verdana;"&gt;&lt;br /&gt; &lt;span style="font-size: small;"&gt;Salvatore A. Buono&lt;br /&gt; 592 Sayfa&lt;br /&gt; Amazon Fiyatı : 39$&lt;br /&gt; &amp;nbsp;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="14%"&gt;&lt;img src="/makale/images/mk106_8.gif" alt="" width="109" height="143" border="0" /&gt;&lt;/td&gt;
&lt;td width="82%"&gt;&lt;strong class="sans"&gt; Beginning C# Game Programming (Game Development)&lt;br /&gt; &lt;/strong&gt; Muska &amp;amp; Lipman/Premier-Trade&lt;span style="font-size: small;"&gt;&lt;strong class="sans"&gt;&lt;br /&gt; &lt;/strong&gt;&lt;span style="font-family: Verdana;"&gt;Ron Penten&lt;br /&gt; 344 Sayfa&lt;br /&gt; Amazon Fiyatı : 20.39$&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="14%"&gt;&lt;img src="/makale/images/mk106_9.gif" alt="" width="108" height="143" border="0" /&gt;&lt;/td&gt;
&lt;td width="82%"&gt;&lt;strong class="sans"&gt; Managed DirectX 9 Kick Start : Graphics and Game Programming&lt;br /&gt; &lt;/strong&gt; Sams&lt;span style="font-size: small;"&gt;&lt;strong class="sans"&gt;&lt;br /&gt; &lt;/strong&gt;&lt;span style="font-family: Verdana;"&gt;Tom Miller&lt;br /&gt; 432 Sayfa&lt;br /&gt; Amazon Fiyatı : 23.79 $&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Bu anlattığım olaylar yaklaşık bir ay kadar &amp;ouml;nce ger&amp;ccedil;ekleşti. Şu anda bu kitaplarda az da olsa ilerlemiş durumdayım. İnanın sevgili okurlarım bu işe giriştiğim i&amp;ccedil;in &amp;ccedil;ok ama &amp;ccedil;ok memnunum. Biraz matematik, biraz teori biraz pratik derken bir şeyler kapmaya başladım bile. Herşeyden &amp;ouml;nce ilk konularda, eski dostumuz Hipoten&amp;uuml;s' &amp;uuml; g&amp;ouml;rmek bile son derece g&amp;uuml;zeldi. Konuları anlamaya başladığıma g&amp;ouml;re şimdi tek yapmam gereken &amp;ouml;ğrendiklerimi uygulayarak pekiştirmek ve sizler ile paylaşmak. Artık bu kadar laf kalabalığından sonra, bu makalemizin konusunada değinme zamanı geldi.&lt;/p&gt;
&lt;p&gt;Bu g&amp;uuml;n, oyun programlamanın &amp;ouml;nemli temellerden birisi olan &amp;Ccedil;arpışma (Collision) tekniklerine giriş yapacağız. Bir oyunda, bir birinden bağımsız &amp;ouml;ğelerin bir birleriyle &amp;ccedil;arpışmaları &amp;uuml;zerinde duracağımız asıl konu olacak. Bir savaş oyununda tarafların bir birlerine karşı yaptıkları hamleler sonucu kimin kime vurduğunu tespit etmek, vuruşların y&amp;ouml;n&amp;uuml;ne veya şiddetine g&amp;ouml;re, darbeyi alan nesnelerin ne t&amp;uuml;r hareketlerde bulunacağına karar vermek a&amp;ccedil;ısıdından &amp;Ccedil;arpışma teknikleri ger&amp;ccedil;ekten &amp;ouml;nemlidir. Bu teknikler bir ka&amp;ccedil; tanedir. Bu g&amp;uuml;n ben sizlere, 2&amp;nbsp; boyutlu koordinat sisteminde d&amp;ouml;rtgensel şekillerin &amp;ccedil;arpışmalarının nasıl tespit edilebileceğini anlatmaya &amp;ccedil;alışacağım.&lt;/p&gt;
&lt;table id="table1" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;Dortgenlerin baz alındığı bu teknikte ama&amp;ccedil;, objeleri i&amp;ccedil;ine alan ve sınırlayan d&amp;ouml;rtgensel alanların birbirleri &amp;uuml;st&amp;uuml;ne gelip gelmediklerinin tespit edilebilmesidir.&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;&amp;Ouml;ncelikle durumu analiz edebilmek amacıyla aşağıdaki şekli g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk106_1.gif" alt="" width="481" height="324" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. Senaryo.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Senaryo gereği, k&amp;ouml;pek balığı ve yarış arabası nesnelerimizin hareketli olduklarını d&amp;uuml;ş&amp;uuml;nelim. Burada, yarış arabası ve k&amp;ouml;pek balığı aslında ekranda piksel olarak yer kaplamaktadır. Bu iki piksel topluluğunun &amp;ccedil;arpışıp &amp;ccedil;arpışmadıklarını test edebilmek i&amp;ccedil;in kullanılabilecek en basit teknik, nesnelerin &amp;ccedil;evresini saran d&amp;ouml;rtgenlerin bir birleri &amp;uuml;st&amp;uuml;ne gelip gelmediklerini tespit etmektir. Bu nedenle, senaryomuzda yarış arabımızı A isimli, k&amp;ouml;pek balığımızı ise B isimli d&amp;ouml;rtgenler ile &amp;ccedil;evrelediğimizi d&amp;uuml;ş&amp;uuml;nelim. İşte bu noktadan sonra işin i&amp;ccedil;ine biraz matematik girecek.&lt;/p&gt;
&lt;table id="table2" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;Eğer bu iki nesnenin X koordinatları arasındaki fark, genişliklerinin yarılarının toplamından k&amp;uuml;&amp;ccedil;&amp;uuml;k ise ve iki nesnenin Y koordinatları arasındaki fark, y&amp;uuml;ksekliklerinin yarılarının toplamından k&amp;uuml;&amp;ccedil;&amp;uuml;k ise, bu iki d&amp;ouml;rtgen &amp;uuml;st &amp;uuml;ste gelmiş dolayısıyla &amp;ccedil;arpışma (Collision) ger&amp;ccedil;ekleşmiş demektir.&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Bunun matematiksel olarak aşağıdaki şekil ile daha iyi anlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk106_2.gif" alt="" width="481" height="324" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. Koordinat, genişlik ve y&amp;uuml;kseklik &amp;ouml;l&amp;ccedil;&amp;uuml;leri.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Burada, her iki d&amp;ouml;rtgenin ekranın sol &amp;uuml;st k&amp;ouml;şesine olan uzaklıkları ve genişlik ile y&amp;uuml;kseklikleri belirtilmektedir. Elbette bir nesnenin X koordinatı uygulamada bu nesnenin Left &amp;ouml;zelliğinin değerine, Y koordinatı ise Top &amp;ouml;zelliğinin değerine işaret etmektedir. Aynı şekilde genişlik i&amp;ccedil;in Width, y&amp;uuml;kseklik i&amp;ccedil;in ise Height &amp;ouml;zelliklerinden yararlanılacaktır. Yukarıda bahsettiğimiz &amp;ccedil;arpışma koşulunun matematiksel ifadesi ise aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk106_3.gif" alt="" width="227" height="120" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. &amp;Ccedil;arpışma (Collision) koşulları.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edecek olursanız eşitsizliklerin sol taraflarındaki ifadelerde mutlak değer s&amp;ouml;z konusudur. Bu nedenle Math sınıfının Abs isimli metodu işimize &amp;ccedil;ok yarayacaktır. Bu ifadedeki her iki eşitsizliğinde ger&amp;ccedil;ekleşmesi halinde, d&amp;ouml;rtgenlerin &amp;uuml;st &amp;uuml;ste geldiklerinden, dolayısıyla &amp;ccedil;arpıştıklarından s&amp;ouml;z edebiliriz. Bu teorimin ger&amp;ccedil;ekliğini kontrol etmenin en g&amp;uuml;zel yolu uygulama &amp;uuml;zerinde olacaktır. Bu ama&amp;ccedil;la aşağıdaki gibi basit bir windows uygulaması oluşturdum.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk106_4.gif" alt="" width="542" height="528" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. Uygulama.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu uygulamada, A isimli d&amp;ouml;rtgen nesnesini klavyedeki A,S,D,E tuşları ile hareket ettirebileceğiz. Bizim buradaki amacımız, &amp;Ccedil;arpışma olduğu takdirde bunun ger&amp;ccedil;ekleşip ger&amp;ccedil;ekleşmediğini tespit edebilmek. Bu ama&amp;ccedil;la, nesnelerin ekrandaki koordinatlarınıda izlediğimiz label nesnelerimiz var. Gelelim uygulamamızın kodlarına.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void Yaz()
{
    lblXA.Text=A.Left.ToString();
    lblYA.Text=A.Top.ToString();
    lblWidthA.Text=Convert.ToString((A.Width/2));
    lblHeightA.Text=Convert.ToString((A.Height/2));

    lblXB.Text=B.Left.ToString();
    lblYB.Text=B.Top.ToString();
    lblWidthB.Text=Convert.ToString((B.Width/2));
    lblHeightB.Text=Convert.ToString((B.Height/2));
}

private void frmCarpisma_Load(object sender, System.EventArgs e)
{
    Yaz();
}

/* &amp;Ccedil;arpışma Kontrol&amp;uuml;n&amp;uuml;n ger&amp;ccedil;ekleştirildiği metod */
private bool CarpismaKontrol()
{
    float mutlakX=Math.Abs((A.Left+(A.Width/2))-(B.Left+(B.Width/2)));
    float mutlakY=Math.Abs((A.Top+(A.Height/2))-(B.Top+(B.Height/2)));

    float farkGenislik=(A.Width/2)+(B.Width/2);
    float farkYukselik=(A.Height/2)+(B.Height/2);

    if((farkGenislik&amp;gt;mutlakX)&amp;amp;&amp;amp;(farkYukselik&amp;gt;mutlakY))
    {
        return true;
    }
    else
        return false;
    } 
}
private void frmCarpisma_KeyPress(object sender, System.Windows.Forms.KeyPressEventArgs e)
{
    if(e.KeyChar==(Char)Keys.D)
    {
        A.Left+=10;
    }
    if(e.KeyChar==(Char)Keys.A)
    {
        A.Left-=10;
    }
    if(e.KeyChar==(Char)Keys.W)
    {
        A.Top-=10;
    }
    if(e.KeyChar==(Char)Keys.S)
    {
        A.Top+=10;
    }
    
    Yaz();
    if(CarpismaKontrol())
    {
        lblCarpismaKontrol.Text="&amp;Ccedil;arpisma var...";
    }
    else
    {
        lblCarpismaKontrol.Text="";
    } 
}&lt;/pre&gt;
&lt;p&gt;Uygulamada dikkat ederseniz, teoremi aşağıdaki kod satırlarındaki gibi uyguladık.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;float mutlakX=Math.Abs((A.Left+(A.Width/2))-(B.Left+(B.Width/2)));/* X koordinatları arası farkın mutlak değeri. */
float mutlakY=Math.Abs((A.Top+(A.Height/2))-(B.Top+(B.Height/2)));/* Y koordinatları arası farkın mutlak değeri . */

float farkGenislik=(A.Width/2)+(B.Width/2); /*Genişliklerin yarılarının toplamı.*/
float farkYukselik=(A.Height/2)+(B.Height/2); /* Y&amp;uuml;ksekliklerin yarılarının toplamı. */

if((farkGenislik&amp;gt;mutlakX)&amp;amp;&amp;amp;(farkYukselik&amp;gt;mutlakY)) /* Eğer koşul doğru ise &amp;ccedil;arpışma vardır. */
{
   return true;
}
else
   return false;
}&lt;/pre&gt;
&lt;p&gt;Şimdi uygulamamızı test edelim. A, S, D, W tuşları ile (bunlara basarken Caps Lock a&amp;ccedil;ık olmalı) A isimli buton kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; 10' ar birim hareket ettirebilmekteyiz. Eğer kutuları &amp;uuml;st&amp;uuml;ste getirirsek &amp;ccedil;arpışma teoreminin başarılı bir şekilde ger&amp;ccedil;ekleştiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk106_5.gif" alt="" width="542" height="528" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 5. &amp;Ccedil;arpışma ger&amp;ccedil;ekleşti.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu teknik en basit &amp;ccedil;arpışma modelidir. Nesnelerin d&amp;ouml;rtgenler i&amp;ccedil;erisinde d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmesi araba şeklinde olduğu gibi, boşluğa denk d&amp;uuml;şen alanlarında hesaba katılmasına neden olmaktadır. Ancak iş dairesel nesnelerin &amp;ccedil;arpışmasına geldiğinde (&amp;ouml;rneğin tenis toplarının raketler &amp;ccedil;arpması) hatta, daire ve karesel nesnelerin &amp;ccedil;arpışmasına geldiğinde dahada karmaşıklaşmaktadır.&lt;/p&gt;
&lt;p&gt;Artık ilerleyen zamanlarda bu teoremleri incelemeye &amp;ccedil;alışacağım. &amp;Ouml;ğrendik&amp;ccedil;ede siz değerli okurlarıma aktaracağım. Artık 24 b&amp;ouml;l&amp;uuml;mm&amp;uuml; s&amp;uuml;rer bir tetris oyunu yazmamız, 24 ay mı s&amp;uuml;rer bilemiyorum. En azından daha &amp;ouml;nceden bildiğim hatta mutlaka bildiğim ama farkına varamadığım algoritmaları &amp;ouml;ğrenmek beni olduk&amp;ccedil;a memnun etti. Umuyorum ki sizlerde bu yazı dizisinden hoşnut kalırsınız. Tekrar g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-11-06 04:00:00</pubDate>
  <slug>Oyun-Programlamaya-Giriş-(Çarpışma-Teknikleri-1)-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>game-programming</tag>
    <tag>matematik</tag>
    <tag>oyun-programlama</tag>
    <tag>çarpışma-teorileri</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>