<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Python Tarafında ProtoBuf (Protocol Buffers) Serileştirme</title>
  <description>Protocol Buffer, Google'ın yapısal verilerin (structured data) serileştirilmesi için geliştirdiği bir protokol. gRPC ile sıklıkla anılır. XML benzeri düşünebiliriz ama çok daha az yer tutar ve serileştirme süreleri hızlıdır. Şu sıkça gördüğümüz proto uzantılı dosyaların ana fikridir. Nam-ı diğer ProtoBuf örneğin ağ üzerinden gönderilecek verinin tanımını yapan bir sözleşmedir. Sözleşmenin ana unsuru mesajdır. Dosya içeriğine bakınca anlaşılması kolay bir mevzu. Tek başına bir anlamı yoktur. protoc isimli derleyiciden geçmesi gerekir. Bu derleme sonucu insan gözüyle pek de okunamayan binary bir türev ortaya çıkar. Bunu ağ üstünden gönderebilir, bir yerlerde veri olarak saklayabilir ya da ille de okumak istersek JSON, XML gibi formatlara dönüştürebiliriz.</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/10/protobuf2.png" alt="" align="right" /&gt;Protocol Buffer, Google'ın yapısal verileri&lt;em&gt;(structured data)&lt;/em&gt; serileştirmek i&amp;ccedil;in geliştirdiği bir protokol&lt;em&gt;(Hatta gRPC ile sıklıkla anılır)&lt;/em&gt;&amp;nbsp;Onu XML&lt;em&gt;(eXtensible Markup Language)&lt;/em&gt; benzeri bir veri tanımlama formatı olarak d&amp;uuml;ş&amp;uuml;nebiliriz ama &amp;ccedil;ok daha az yer tutar ve serileştirme s&amp;uuml;resi &amp;ccedil;ift y&amp;ouml;nl&amp;uuml; olarak daha kısadır. Şu sık&amp;ccedil;a g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z proto uzantılı dosyaların ana fikridir.&lt;/p&gt;
&lt;p&gt;Nam-ı diğer ProtoBuf &amp;ouml;rneğin ağ &amp;uuml;zerinden g&amp;ouml;nderilecek verinin tanımını yapan bir s&amp;ouml;zleşmedir. S&amp;ouml;zleşmenin ana unsuru ise mesajdır. Dosya i&amp;ccedil;eriğine bakınca anlaşılması kolay bir mevzu iken tek başına bir anlamı yoktur, nitekim protoc isimli derleyiciden de ge&amp;ccedil;mesi gerekir. Bu derleme sonucu insan g&amp;ouml;z&amp;uuml;yle pek de okunamayan binary bir versiyon ortaya &amp;ccedil;ıkar. Bunu ağ &amp;uuml;st&amp;uuml;nden g&amp;ouml;nderebilir bir yerlerde veri olarak saklayabilir ya da ille de okumak istersek JSON, XML gibi formatlara d&amp;ouml;n&amp;uuml;şt&amp;uuml;rebiliriz.&lt;/p&gt;
&lt;p&gt;Mikroservisler denince akla gelen&amp;nbsp;REST, WebSockets ve GraphQL iyidir hoştur ama y&amp;uuml;ksek hız gerektiren durumlar varsa low-level RPCs&lt;em&gt;(Remote Procedure Calls)&lt;/em&gt; &amp;ouml;nem kazanır. Lakin uygulanması &amp;ccedil;ok kolay olmadığından bizleri over-engineering anti-pattern'ine de s&amp;uuml;r&amp;uuml;kleyebilir. Bu arada ProtoBuf'ın JSON serileştirmeli &amp;ouml;rneklerden 6 kat daha performanslı olduğu da iddia edilmiş. Detaylı bilgi i&amp;ccedil;in &lt;a href="https://auth0.com/blog/beating-json-performance-with-protobuf/" target="_blank"&gt;buraya&lt;/a&gt; bakınız.&lt;/p&gt;
&lt;p&gt;Benim bu &amp;ouml;rnekteki amacım ProtoBuf serileştirme işlemini Heimdall&lt;em&gt;(Ubuntu 20.04)&lt;/em&gt; &amp;uuml;zerinde Python kodları ile kullanabilmekti. Bir veri deseni oluşturmak ve bunu &amp;ccedil;ift y&amp;ouml;nl&amp;uuml; olarak serileştirmek kafi olacaktı. ProtoBuf'ın uygulandığı t&amp;uuml;m dillerde esas itibariyle benzer altyapı s&amp;ouml;z konusu. Olay bir proto s&amp;ouml;zleşmesinin yazılıp ilgili dil i&amp;ccedil;in protoc derleyicisi ile hazırlanması ve kullanımından ibaret.&lt;/p&gt;
&lt;h2&gt;Hazırlıklar, Kodlama ve &amp;Ccedil;alışma Zamanı&lt;/h2&gt;
&lt;p&gt;Tabii heimdall &amp;uuml;zerinde protoc derleyicisi y&amp;uuml;kl&amp;uuml; değildi. Yani yazıyı okuyan siz değerli okurun sisteminde de bu derleyici y&amp;uuml;kl&amp;uuml; olmayabilir. Bu nedenle ben &lt;a href="http://google.github.io/proto-lens/installing-protoc.html" target="_blank"&gt;şu adresteki&lt;/a&gt; kurulum talimatlarını izledim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;PROTOC_ZIP=protoc-3.7.1-linux-x86_64.zip
curl -OL https://github.com/protocolbuffers/protobuf/releases/download/v3.7.1/$PROTOC_ZIP
sudo unzip -o $PROTOC_ZIP -d /usr/local bin/protoc
sudo unzip -o $PROTOC_ZIP -d /usr/local 'include/*'
rm -f $PROTOC_ZIP

protoc --version&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnekte birde protobuf dosyamız mevcut elbette. Yani ağ &amp;uuml;zerinden koşturacağımız veri desenimiz. Ben &amp;ouml;rnek olarak bir g&amp;ouml;rev bilgisini tasarlamaya &amp;ccedil;alıştım. G&amp;ouml;revin başlığı, a&amp;ccedil;ıklaması, durumu gibi bilgilerin yer aldığı bir veri modeli...&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;syntax="proto3"; // Kullandığımız ProtoBuf versiyonu

package company;

// g&amp;ouml;rev durumunu tutacağımız enum sabiti
enum State{
    PLANNED=0;
    IN_PROGRESS=1;
    DONE=2;
}

// ana tipimiz Job
// i&amp;ccedil;inde n sayıda Task i&amp;ccedil;erebilir ki o da bir s&amp;ouml;zleşme tipidir
// niteliklere atanan sayılar binary encode edilen &amp;ccedil;ıktıdaki alanları işaret eden benzersiz sayılardır. 
// Bir nevi eşleştirme veya yer bulma tekniği.
message Job{    
    int32 job_id=1;
    string title=2;

    // İşteki g&amp;ouml;revleri tanımlayan tipimiz
    message Task{
        int32 task_id=1;
        string title=2;
        string description=3;
        State state=4; //enum sabiti tipinden
    }

    repeated Task tasks=3; //Task tipinin tekrarlanabileceğini belirtiyor
}&lt;/pre&gt;
&lt;p&gt;Başta da belittiğimiz &amp;uuml;zere yazılan bu proto dosyasının pyhton &amp;ccedil;alışma zamanı ortamında kullanılabilmesi i&amp;ccedil;in bir derleme işleminden ge&amp;ccedil;mesi gerekiyor. Bunu aşağıdaki terminal komutları yardımıyla ger&amp;ccedil;ekleştirebiliriz. Sonu&amp;ccedil; olarak&amp;nbsp;jobs_pb2.py isimli bir dosya &amp;uuml;retilecektir. Bu paket izleyen app.py i&amp;ccedil;erisinde kullanılmaktadır. Yorum satırlarını takip edelim ;)&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;protoc -I=. --python_out=. ./jobs.proto&lt;/pre&gt;
&lt;p&gt;Gelelim protobuf i&amp;ccedil;eriğini kullanarak &amp;ouml;rnek serileştirme ve ters-serileştirme işlemlerini yapan Python kodlarımızın yer aldığı app nesnesine.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;# encoding:utf-8

import jobs_pb2 as Job  # Protoc dosyasından &amp;uuml;retilen paketi ekledik

# Yeni bir Job nesnesi tanımlayıp i&amp;ccedil;ine birka&amp;ccedil; Task ekliyoruz
job = Job.Job()
job.job_id = 1802234
job.title = "Şube personeli fatura onay s&amp;uuml;recine olarak belge y&amp;uuml;kleyebileceğim bir ekran istiyorum."

task1 = job.tasks.add()
task1.task_id = 1
task1.title = "Ekran Tasarımı"
task1.description = "Fatura y&amp;uuml;kleme ekranının tasarımı"
task1.state = Job.State.Value("IN_PROGRESS")

task2 = job.tasks.add()
task2.task_id = 2
task2.title = "Fatura Şema Tasarımı"
task2.description = "Fatura i&amp;ccedil;eriği i&amp;ccedil;in gerekli protoc i&amp;ccedil;eriğinin tasarımı"
task2.state = Job.State.Value("PLANNED")

# print(job)  # Ekrana &amp;ccedil;ıktıyı basalım

# Job i&amp;ccedil;eriğini jobs.data isimli dosya i&amp;ccedil;ine serileştiriyoruz
with open("./jobs.data", "wb") as file:
    file.write(job.SerializeToString())

print("İ&amp;ccedil;erik Serileştirildi...")
print(job.SerializeToString())
print()

incoming_job = Job.Job()  # yeni bir job nesnesi oluşturalım
# jobs.data i&amp;ccedil;eriğini okuyup incoming_job i&amp;ccedil;erisine ters serileştirelim
with open("./jobs.data", "rb") as file:
    incoming_job.ParseFromString(file.read())

print("Şimdi Dosyadan Ters Serileştirildi")
print(incoming_job)&lt;/pre&gt;
&lt;p&gt;Yazdığımız &amp;ouml;rneği aşağıdaki terminal komutu ile &amp;ccedil;alıştırabilir ve sonu&amp;ccedil;ları irdeleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;python3 app.py&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/10/Screenshot_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Esasında &amp;ouml;rnekte protobuf olarak tasarlanmış bir nesnenin python ile serileştirme işlemlerinde nasıl kullanıldığını incelemiş olduk. Ger&amp;ccedil;ek hayat &amp;ouml;rneği i&amp;ccedil;in bu kurguyu bir servisin arkasına taşımak &amp;ccedil;ok daha doğru olur. &amp;Ouml;rneğin Flask ile bir servis geliştirip istemci ile haberleşilen veriler i&amp;ccedil;in JSON yerine protobuf kullanımı &amp;ouml;rneklenebilir. Bu pekala sizin i&amp;ccedil;in g&amp;uuml;zel bir &amp;ouml;dev de olabilir :) O halde ne duruyorsunuz!? Haydi başlayın.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin t&amp;uuml;m kodlarına ve ilk notlarına&amp;nbsp;&lt;a href="https://github.com/buraksenyurt/skynet/tree/master/No%2010%20-%20Protocol%20Buffers%20with%20Python/src" target="_blank"&gt;Skynet github reposu&lt;/a&gt;ndan erişebilirsiniz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2020-01-14 21:00:00</pubDate>
  <slug>python-tarafinda-protobuf-protocol-buffers-serilestirme</slug>
  <tags>
    <tag>python</tag>
    <tag>protobuf</tag>
    <tag>rest</tag>
    <tag>websockets</tag>
    <tag>protocol</tag>
  </tags>
  <categories>
    <category>python</category>
  </categories>
</post>