<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>C# 2.0 ve Nullable Değer Tipleri</title>
  <description>C# programlama dilinde bildiğiniz gibi veri türlerini Referans Türleri(Reference Types) ve Değer Türleri (Value Types) olmak üzere iki kısma ayırıyoruz. Bu iki tür arasında bellek üzerinde fiziki tutuluş şekillerinden tutunda birbirleri arasındaki atamalara kadar pek çok farklılık vardır. Bu farklılıklardan birisi de, referans türlerinin null değerleri alabilmelerine karşın, değer türlerinin aynı özelliğe sahip olmayışlarıdır.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;C# programlama dilinde bildiğiniz gibi veri t&amp;uuml;rlerini Referans T&amp;uuml;rleri(Reference Types) ve Değer T&amp;uuml;rleri (Value Types) olmak &amp;uuml;zere iki kısma ayırıyoruz. Bu iki t&amp;uuml;r arasında bellek &amp;uuml;zerinde fiziki tutuluş şekillerinden tutunda birbirleri arasındaki atamalara kadar pek &amp;ccedil;ok farklılık vardır. Bu farklılıklardan birisi de, referans t&amp;uuml;rlerinin null değerleri alabilmelerine karşın, değer t&amp;uuml;rlerinin aynı &amp;ouml;zelliğe sahip olmayışlarıdır.&lt;/p&gt;
&lt;p&gt;Bu durum &amp;ouml;zellikle veritabanı tablolarında null değer alabilen alanların, dil i&amp;ccedil;erisindeki tip karşılığı değer t&amp;uuml;r&amp;uuml;ne denk d&amp;uuml;şt&amp;uuml;ğ&amp;uuml;nde bazı zorluklar &amp;ccedil;ıkartabilmektedir. İşte bu makalemizde, C# 2.0 diliyle gelen yeni &amp;ouml;zelliklerden birisi olan Nullable Value Types (Null değer alabilen değer t&amp;uuml;rleri) ni incelemeye &amp;ccedil;alışacağız. Başlangı&amp;ccedil; olarak C# 1.1 versiyonundaki durumu analiz ederek işe başlayalım. Aşağıdaki kod par&amp;ccedil;asında bir referans t&amp;uuml;r&amp;uuml;ne ve bir de değer t&amp;uuml;r&amp;uuml;ne null değerler atanmaya &amp;ccedil;alışılmaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace ConsoleApplication2
{
    class Class1
    {
        static void Main(string[] args)
        {
            string refTuru=null;
            int degerTuru=null;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu uygulamayı derlemeye &amp;ccedil;alıştığımızda &lt;em&gt;&lt;strong&gt;Cannot convert null to 'int' because it is a value type&lt;/strong&gt; &lt;/em&gt;hatasını alırız. Aynı durumu kendi tanımladığımız referans ve değer t&amp;uuml;rleri i&amp;ccedil;inde ger&amp;ccedil;ekleştirebiliriz. Aşağıdaki kod par&amp;ccedil;asında bu durum &amp;ouml;rneklenmiştir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace ConsoleApplication2
{
    class Kitap
    {
    }
    struct Dvd
     {
     }
    class Class1
    {
        static void Main(string[] args)
        {
            Kitap kitap=null;
            Dvd dvd=null;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asındada aynı hatayı alırız. &amp;Ccedil;&amp;uuml;nk&amp;uuml; struct' lar değer t&amp;uuml;r&amp;uuml;d&amp;uuml;r ve bu sebeple null değerler alamazlar. Oysaki aynı istisnai durum class gibi kendi tanımlamış olduğumuz referans t&amp;uuml;rleri i&amp;ccedil;in ge&amp;ccedil;erli değildir. Peki değer t&amp;uuml;rlerinin null değer i&amp;ccedil;erme ihtiyacı ne zaman doğabilir? Bir veritabanı uygulamasını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. Bu tabloda int, double gibi değer t&amp;uuml;rlerine karşılık gelecek alanların var olduğunu d&amp;uuml;ş&amp;uuml;nelim. Veri girişi sırasında bu int ve double değişkenleri null olarak tabloya aktarmak isteyebiliriz.&lt;/p&gt;
&lt;p&gt;Ya da tablodan veri &amp;ccedil;ekerken, değer t&amp;uuml;r&amp;uuml; karşılığı alanların null değer i&amp;ccedil;erip i&amp;ccedil;ermediğini anlamak isteyebiliriz. İşte bu gibi durumlarda değer t&amp;uuml;rlerinin null veriler i&amp;ccedil;erebilecek yapıda olması, kodumuzun &amp;ouml;l&amp;ccedil;eklenebilirliğini arttıracak bir yetkinlik olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Veritabanları i&amp;ccedil;in ge&amp;ccedil;erli olan bu senaryoyu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almadan &amp;ouml;nce C# 2.0 i&amp;ccedil;in değer t&amp;uuml;rlerinin nasıl null veriler taşıyabileceğini incelemeye &amp;ccedil;alışalım. Değer t&amp;uuml;rlerinin C# 2.0 i&amp;ccedil;in iki versiyonu vardır. Nullable değer t&amp;uuml;rleri ve Non-Nullable değer t&amp;uuml;rleri. Bir değer t&amp;uuml;r&amp;uuml;n&amp;uuml;n null değerler i&amp;ccedil;erecek tipte olacağını belirtmek i&amp;ccedil;in ? tip belirleyicisi kullanılır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Text;

namespace TestOfNullableValues
{
    class Program
    {
        static void Main(string[] args)
        {
            int? maas;
            double? pi;
            maas = null;
            pi = null;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Yukarıdaki kod par&amp;ccedil;ası sorunsuz olarak derlenecek ve &amp;ccedil;alışacaktır. ? ile tanımlanan değer t&amp;uuml;rleri null veriler taşıyabilen değer tipindendir. Aynı durum kendi tanımladığımız bir struct i&amp;ccedil;inde ge&amp;ccedil;erlidir. Aşağıdaki kod par&amp;ccedil;asında Personel isimli struct' a null değer ataması yapılmıştır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;struct Personel
{
}

class Program
{
    static void Main(string[] args)
    {
        Personel? person = null;
    }
}&lt;/pre&gt;
&lt;p&gt;Elbette referans t&amp;uuml;rlerinde bu tarz bir kullanım ge&amp;ccedil;erli olmayacaktır. &amp;Ouml;rneğin aşağıdaki kod par&amp;ccedil;asında kendi tanımlamış olduğumuz bir sınıf nesnesine ve string t&amp;uuml;r&amp;uuml;nden bir değişkene ? belirleyicisi vasıtasıyla null değerler atanmaya &amp;ccedil;alışılmıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk125_4.GIF" alt="" width="400" height="415" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Oysaki referans t&amp;uuml;rleri zaten null değerler alabilmektedir.&lt;/p&gt;
&lt;table id="table7" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;em&gt;Referans t&amp;uuml;rlerine ? tip belirleyicisi uygulayarak null değer ataması yapılamaz.&lt;/em&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;? tip belirleyicisi aslında tanımlanan değer t&amp;uuml;r&amp;uuml;n&amp;uuml;n null veri taşıyabilecek başka bir versiyonunu kullanılacağını belirtmektedir. Bu yeni değer t&amp;uuml;r&amp;uuml; versiyonları ise null verileri taşıyabilecek bir yapıda tasarlanmışlardır. ? belirleyicisinin uygulandığı bir değer t&amp;uuml;r&amp;uuml;n&amp;uuml;n null değerler i&amp;ccedil;erip i&amp;ccedil;ermediğine &lt;strong&gt; HasValue&lt;/strong&gt; &amp;ouml;zelliği ilede bakılabilmektedir. Bu &amp;ouml;zellik, ilgili değer t&amp;uuml;r&amp;uuml; null veri i&amp;ccedil;erdiği s&amp;uuml;rece false d&amp;ouml;nd&amp;uuml;recektir. &amp;Ouml;rneğin,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;int? Yas;
Yas = null; // Yas değer t&amp;uuml;r&amp;uuml;ne null veri atanıyor.
if (Yas.HasValue) // false d&amp;ouml;necektir
{
    Console.WriteLine("Yas null değil...");
}
else
{
    Console.WriteLine("Yas null..."); // Bu satır işletilir.
}&lt;/pre&gt;
&lt;p&gt;C# 2.0 diline ? tip belirleyicisinden yola &amp;ccedil;ıkılaraktan yeni bir operat&amp;ouml;r eklenmiştir. ?? operat&amp;ouml;r&amp;uuml;. Bu operat&amp;ouml;r kısaca bir değer t&amp;uuml;r&amp;uuml;n&amp;uuml;n i&amp;ccedil;eriğinin null olup olmamasına g&amp;ouml;re koşullu olarak atama yapmaktadır. Eğer operat&amp;ouml;rde kullanılan null veri taşıyabilir değer t&amp;uuml;r&amp;uuml;n&amp;uuml;n o anki değeri null ise, koşul olarak belirtilen değer ilgili değişkene atanır. Aksi takdirde, değer t&amp;uuml;r&amp;uuml;n&amp;uuml;n o anki verisi, ilgili değişkene atanır. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asında bu operat&amp;ouml;r&amp;uuml;n kullanım şekli g&amp;ouml;sterilmeye &amp;ccedil;alışılmıştır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;int? Yas; // null değer alabilecek bir değer t&amp;uuml;r&amp;uuml; tanımlanıyor.

Yas = null; // null değer ataması
int yasi = Yas ?? 0; // Eğer Yas null ise yasi alanına 0 atanır.
Console.WriteLine(yasi); // 0 yazar

Yas = 12;
yasi = Yas ?? 0; // Eğer Yas null değil ise yasi alanına Yas' ın o anki değeri atanır.
Console.WriteLine(yasi); // 12 yazar&lt;/pre&gt;
&lt;p&gt;İlk kullanımda, Yas değer t&amp;uuml;r&amp;uuml;n&amp;uuml;n sahip olduğu veri null olarak belirlenmiştir. ?? operat&amp;ouml;r&amp;uuml; bu durumda yasi alanına 0 değerini atayacaktır. İkinci kullanımda ise Yas değer t&amp;uuml;r&amp;uuml;n&amp;uuml;n verisi 12 olarak belirlenmiştir. Buna g&amp;ouml;rede ?? operat&amp;ouml;r&amp;uuml; yasi değişkenine 12 değerini (yani Yas nullable değer t&amp;uuml;r&amp;uuml;n&amp;uuml;n o anki verisini) atayacaktır. Burada dikkat ederseniz Yas null değer alabilen bir int tipidir. Bununla birlikte ?? operat&amp;ouml;r&amp;uuml; ile yapılan veri ataması null değerler i&amp;ccedil;eremiyen normal bir int tipine doğru yapılmaktadır. Burada s&amp;ouml;z konusu olan atama işlemini biraz irdelemekte fayda vardır. Aşağıdaki kod par&amp;ccedil;asını ele alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;int? pi = 3;
int m_Pi;
m_Pi = pi;&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rnek derlenmeyecektir. Bunun sebebi ise null değer alabilen bir değer t&amp;uuml;r&amp;uuml;n&amp;uuml;, normal bir değer t&amp;uuml;r&amp;uuml;ne bilin&amp;ccedil;siz olarak atamaya &amp;ccedil;alışmamızdır. Dolayısıyla,&lt;/p&gt;
&lt;table id="table11" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;em&gt;Nullable Değer t&amp;uuml;rleri bilin&amp;ccedil;siz olarak normal değer t&amp;uuml;rlerine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lemez.&lt;/em&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Ancak aşağıdaki kod par&amp;ccedil;asında g&amp;ouml;r&amp;uuml;len t&amp;uuml;r d&amp;ouml;n&amp;uuml;ş&amp;uuml;m işlemi ge&amp;ccedil;erlidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;int? pi = 3;
int m_Pi;
m_Pi = (int)pi;&lt;/pre&gt;
&lt;p&gt;Elbette burada dikkat edilmesi gereken bir durum daha vardır. Eğer o anki değeri null olan bir değer t&amp;uuml;r&amp;uuml;n&amp;uuml; normal bir değer t&amp;uuml;r&amp;uuml;ne bilin&amp;ccedil;li olarak atamaya &amp;ccedil;alışırsak &amp;ccedil;alışma zamanında InvalidOperationException hatası alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk125_5.GIF" alt="" width="481" height="220" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dolayısıyla bu tip atamalarda ?? operat&amp;ouml;r&amp;uuml;n&amp;uuml; tercih etmek &amp;ccedil;ok daha akılcı bir yaklaşım olacaktır. Nullable değer t&amp;uuml;rlerine, normal değer t&amp;uuml;rlerinin atanmasında ise bilin&amp;ccedil;siz t&amp;uuml;r d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml; de ge&amp;ccedil;erlidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;double e = 2.7;
double? E;
E = (double?)e; // Bilin&amp;ccedil;li t&amp;uuml;r d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml;
E = e; // Bilin&amp;ccedil;siz t&amp;uuml;r d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml;&lt;/pre&gt;
&lt;p&gt;Yukarıdaki kod par&amp;ccedil;asında E null değerler taşıyabilen bir değer t&amp;uuml;r&amp;uuml;d&amp;uuml;r. e ise normal değer t&amp;uuml;r&amp;uuml;d&amp;uuml;r.&lt;/p&gt;
&lt;table id="table14" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;em&gt;Normal değer t&amp;uuml;rleri, nullable değer t&amp;uuml;rlerine hem bilin&amp;ccedil;li hem de bilin&amp;ccedil;siz olarak d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lebilir.&lt;/em&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Makalemizin sonunda bir veritabanı uygulamasında null değerler alabilen değer t&amp;uuml;rlerinin nasıl kullanılabildiğini incelemeye &amp;ccedil;alışacağız. İlk olarak C# 1.1 versiyonunda aşağıdaki yapıda bir uygulama geliştirelim. Bu &amp;ouml;rneğimizde, Sporculara ait bir takım temel bilgileri tutan bir tabloyu kullanacağız. Tablomuzda tanımlı olan Sporcu, Boy ve Yaş alanları null değerler i&amp;ccedil;erebilecek şekilde yapılandırılmıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk125_2.gif" alt="" width="296" height="102" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek olarakta aşağıdaki iki satır verinin var olduğunu d&amp;uuml;ş&amp;uuml;nelim. Dikkat ederseniz ikinci satırda değer t&amp;uuml;r&amp;uuml; olarak ele alacağımız alanlara &amp;lt;Null&amp;gt; değerler atanmıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk125_3.gif" alt="" width="245" height="60" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulama kodlarımız ise başlangı&amp;ccedil; olarak aşağıdaki gibidir. Basit olarak Sporcuları temsil edecek bir sınıf ve tablo &amp;uuml;zerindeki temel veritabanı işlemlerini ger&amp;ccedil;ekleştirecek bir katman sınıfı yer almaktadır. Katman sınıfımız şu an i&amp;ccedil;in sadece ve sadece Sporcu tablosundaki verileri okuyup, her bir satır i&amp;ccedil;in birer Sporcu nesnesi yaratan ve onun override edilmiş ToString metodu ile bilgilerini ekrana yazdıran bir metoda sahiptir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.Data.SqlClient;

namespace TestNullableValues
{
    class Sporcu
    {
        private int m_id;
        private string m_sporcu;
        private double m_boy;
        private int m_kilo;
        public Sporcu(int id,string sporcu,double boy,int kilo)
        {
            m_id=id;
            m_sporcu=sporcu;
            m_boy=boy;
            m_kilo=kilo;
        }
        public override string ToString()
        {
            return m_id.ToString()+" "+m_sporcu+" "+m_boy.ToString()+" "+m_kilo.ToString();
        }
    }

    class SporYonetim
    {
        SqlConnection con;
        SqlCommand cmd;
        SqlDataReader dr;
    
        public SporYonetim()
        {
            con=new SqlConnection("data source=localhost;database=MyBase;user id=sa;password=");
        }

        public void SporcuListesi()
        {
            cmd=new SqlCommand("Select ID,Sporcu,Boy,Kilo From Sporcular",con);
            con.Open();
            dr=cmd.ExecuteReader(CommandBehavior.CloseConnection);
            while(dr.Read())
            {
                int id=(int)dr["ID"];
                string sporcu=dr["Sporcu"].ToString();
                double boy=(double)dr["Boy"];
                    int kilo=(int)dr["Kilo"];
                Sporcu sprc=new Sporcu(id,sporcu,boy,kilo);
                Console.WriteLine(sprc.ToString());
            }
        }
    }

    class Class1
    {
        [STAThread]
        static void Main(string[] args)
        {
            SporYonetim ynt=new SporYonetim();
            ynt.SporcuListesi();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bizim i&amp;ccedil;in &amp;ouml;nemli olan nokta Boy ve Yas alanlarının değererinin double ve int alanlara atıldığı yerdir. Uygulamamızı bu haliyle &amp;ccedil;alıştırdığımızda aşağıdaki hata mesajını alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk125_1.gif" alt="" width="460" height="440" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sebep gayet net ve a&amp;ccedil;ıktır. Değer t&amp;uuml;rleri null veri i&amp;ccedil;eremeyeceği i&amp;ccedil;in cast işlemleri &amp;ccedil;alışma zamanında InvalidCastException tipinden bir istisna nesnesi fırlatılmasına neden olmuştur. Bu sorunu aşmak i&amp;ccedil;in kullanabileceğimiz tekniklerden bir tanesi aşağıdaki gibidir. dr ile okunan tablo alanları object tipinden geriye d&amp;ouml;nd&amp;uuml;ğ&amp;uuml;nden ve object tipide referans t&amp;uuml;r&amp;uuml; olduğundan null değerler i&amp;ccedil;erebilir. Burada alanın o anki verisinin null olup olmamasına g&amp;ouml;re uygun atamalar ger&amp;ccedil;ekleştirilmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;double boy;
int kilo;
if(dr["Boy"]==System.DBNull.Value)
    boy=0;
else
    boy=(double)dr["Boy"];
if(dr["Kilo"]==System.DBNull.Value)
    kilo=0;
else
    kilo=(int)dr["Kilo"];
Sporcu sprc=new Sporcu(id,sporcu,boy,kilo);&lt;/pre&gt;
&lt;p&gt;Aynı &amp;ouml;rneği aşağıdaki haliyle C# 2.0 versiyonunda daha farklı bir yaklaşım ile yazabiliriz. Bu kez, Sporcu sınıfımızın yapıcı metodunda yer alan boy ve kilo parametleri ile private field olarak tanımladığımız m_Boy ve m_Kilo alanlarını null değer i&amp;ccedil;erebilecek şekilde tanımlayarak işe başlayacağız. Yine SqlDataReader ile okuduğumuz alanların null değer i&amp;ccedil;erip i&amp;ccedil;ermediğini kontrol edeceğiz. Ancak bu kez null değer i&amp;ccedil;erseler dahi onları taşayabilecek değer t&amp;uuml;rlerimiz elimizde olacak. B&amp;ouml;ylece tablomuzda null değere sahip olan alanlarımızı ekrana yazdırabileceğiz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.Data.SqlClient;
using System.Collections.Generic;
using System.Text;

namespace UsingNullableValues
{
    class Sporcu
    {
        //Diğer kod satırları

        // Sınıf i&amp;ccedil;i bu iki alanı null değerler taşıyabilecel tipten tanımladık.
        private double? m_boy;
          private int? m_kilo;

        // Diğer kod satırları
    }

    class SporYonetim
    {
        // Diğer kod satırları

        public void SporcuListesi()
        {    
            // Diğer kod satırları
            while (dr.Read())
            {
                // Diğer kod satırları
                
                double? boy=null;
                    int? kilo=null;
                    if(dr["Boy"]!=System.DBNull.Value)
                         boy=(double)dr["Boy"];
                    if (dr["Kilo"] != System.DBNull.Value)
                         kilo = (int)dr["Kilo"];

                // nullable değişkenleri Sporcu sınıfının yapıcı metoduna parametre olarak g&amp;ouml;nderiyoruz.
                Sporcu sprc = new Sporcu(id, sporcu, boy, kilo);
                Console.WriteLine(sprc.ToString());
            }
        }
    }
    class Program
    {
        static void Main(string[] args)
        {
            SporYonetim ynt = new SporYonetim();
            ynt.SporcuListesi();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk125_6.gif" alt="" width="364" height="95" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulamamızı bu haliyele &amp;ccedil;alıştırdığımızda tablodaki t&amp;uuml;m satırların ekrana yazdırıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. C# 1.1 de geliştirdiğimiz uygulama ile bu versiyon arasındaki en &amp;ouml;nemli fark, nullable değer t&amp;uuml;rlerinin kullanılarak null verilerin uygulama i&amp;ccedil;erisinde kullanılabilmesidir. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2005-06-22 12:00:00</pubDate>
  <slug>C#-2-0-ve-Nullable-Değer-Tipleri-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#-2</tag>
    <tag>value-types</tag>
    <tag>nullable</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>