<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>DataReader Nesnelerini Kullanırken…</title>
  <description>Bir önceki makalemizde Command nesnelerini kullanırken dikkat etmemiz gereken noktalara değinmiştik. Bu makalemizde ise DataReader nesnelerini kullanırken bizlere avantaj sağlayacak tekniklere değinmeye çalışacağız. Önceki makalemizde olduğu gibi ağırlık olarak SqlDataReader nesnesini ve Sql veritanını kullanacağız. DataReader nesneleri bildiğiniz gibi, bağlantılı katman (connected-layer) üzerinde çalışmaktadır.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki makalemizde Command nesnelerini kullanırken dikkat etmemiz gereken noktalara değinmiştik. Bu makalemizde ise DataReader nesnelerini kullanırken bizlere avantaj sağlayacak tekniklere değinmeye &amp;ccedil;alışacağız. &amp;Ouml;nceki makalemizde olduğu gibi ağırlık olarak SqlDataReader nesnesini ve Sql veritanını kullanacağız. DataReader nesneleri bildiğiniz gibi, bağlantılı katman (connected-layer) &amp;uuml;zerinde &amp;ccedil;alışmaktadır. G&amp;ouml;revleri veri kaynağından, uygulama ortamına doğru belli bir akım &amp;uuml;zerinden hareket edecek veri par&amp;ccedil;alarının taşınmasını sağlamaktır.&lt;/p&gt;
&lt;p&gt;DataReader nesneleri ile veri almak bağlantısız katman (disconnected-layer) nesnelerine veri &amp;ccedil;ekmekten &amp;ccedil;ok daha hızlıdır. &amp;Ccedil;oğunlukla DataReader nesnelerinin kullanılmasının tercih edileceği durumlar vardır. Uygulamalarımız geliştirirken &amp;ccedil;oğu zaman bağlantılı katman ile bağlantısız katman nesneleri arasında se&amp;ccedil;im yapmakta zorlanırız. Aşağıdaki tablo &lt;em&gt;"Ne zaman DataReader kullanırız?" &lt;/em&gt;sorusuna ışık tutan noktalara değinmektedir.&lt;/p&gt;
&lt;table id="table1" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;Eğer Windows veya Asp.Net uygulaması geliştiriyor ve birden fazla form(page) i&amp;ccedil;in veri bağlama (data-binding) &lt;span style="text-decoration: underline;"&gt;&lt;strong&gt;&lt;em&gt;ger&amp;ccedil;ekleştirmiyorsanız&lt;/em&gt;&lt;/strong&gt;,&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;Veriyi ara belleğe alma (caching) &lt;span style="text-decoration: underline;"&gt; &lt;em&gt;&lt;strong&gt;ihtiyacınız yok ise&lt;/strong&gt;&lt;/em&gt;.&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;Eğer tablolarınız arasındaki ilişkileri (relations) uygulamalarınızda &lt;span style="text-decoration: underline;"&gt;&lt;em&gt;&lt;strong&gt;kullanmıyorsanız&lt;/strong&gt;&lt;/em&gt;.&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#cccccc"&gt;&lt;strong&gt;DataReader Kullanmayı Tercih Edin.&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Gelelim DataReader nesnelerini kullanırken dikkat edeceğimiz altın noktalara. Bu teknikler uygulamalarımızın performansını arttıracak nitelikte olup aşağıdaki tabloda belirtilmektedir.&lt;/p&gt;
&lt;table id="table2" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;DataReader nesnelerini kullanırken a&amp;ccedil;ık Connection' ların kapatılmasını unutmayın.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;Sorgu sonucu sadece tek bir satır d&amp;ouml;neceği kesin ise SingleRow tekniğini kullanın.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;Toplu sorgular (Batch Queries) i&amp;ccedil;in Next Result tekniğini kullanın.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff"&gt;Binary veya Text bazlı alan verilerini okurken SequentialAccess tekniğini kullanın.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Şimdi bu teknikleri birer birer inceleyelim.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;A&amp;ccedil;ık Connection' ları Kapatmayı Unutmamak İ&amp;ccedil;in&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;DataReader nesneleri a&amp;ccedil;ık ve ge&amp;ccedil;erli bir Connection nesnesine ihtiya&amp;ccedil; duyarlar. Lakin aynı Connection' ı kullanan DataReader nesneleri s&amp;ouml;z konusu ise, her bir DataReader' ın kullanılabilmesi i&amp;ccedil;in bir &amp;ouml;nceki DataReader' ın kullandığı Connection nesnesinin kapatılmış olması gerekir. (Bu aynı Connection nesnesini kullanan DataReader' lar var ise ge&amp;ccedil;erlidir.) &amp;Ouml;rneğin aşağıdaki uygulama kodunu ele alalım;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.Data.SqlClient;

namespace DataReaderDikkat
{
    public class DbWork
    {
        private SqlConnection con;
        private SqlDataReader dr;

        /* CloseConnection kullanımına &amp;ouml;rnek metod.*/
        public DbWork(string conStr)
        { 
            con=new SqlConnection(conStr);
        }

        public SqlDataReader Results(string selectQuery)
        {
            SqlCommand cmd=new SqlCommand(selectQuery,con);
            con.Open();
            dr=cmd.ExecuteReader(); // Hatalı kullanım.
            return dr; 
        }      
    }
}&lt;/pre&gt;
&lt;p&gt;DbWork sınıfımız constructor metodunda bir SqlConnection nesnesi oluşturur. Results isimli metodumuz ise parametre olarak aldığı sorgu sonucu bir SqlDataReader nesnesi ile geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Şimdi bu sınıfı kullanan aşağıdaki uygulamamızı ele alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.Data.SqlClient;

namespace DataReaderDikkat
{
    class ClosingDataReader
    { 
        [STAThread]
        static void Main(string[] args)
        { 
            DbWork worker=new DbWork("data source=BURKI;database=Northwind;integrated security=SSPI");
            #region CloseConnection Kullanın.

            SqlDataReader drOrders=worker.Results("SELECT TOP 10 * FROM Orders");
            while(drOrders.Read())
            {
                Console.WriteLine(drOrders[0].ToString()+" "+drOrders[1].ToString());
            }
            drOrders.Close();
            SqlDataReader drCustomers=worker.Results("SELECT TOP 10 * FROM Customers");
            while(drCustomers.Read())
            {
                Console.WriteLine(drCustomers[0].ToString()+" "+drCustomers[1].ToString());
            }
            drCustomers.Close();
            #endregion
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı bu haliyle &amp;ccedil;alıştırdığımızda aşağıdaki istisnayı alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk119_2.gif" alt="" width="638" height="252" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sebep ilk drOrders SqlDataReader nesnesinin kullandığı SqlConnection nesnesinin kapatılmamış olması ve bağlantının halen daha a&amp;ccedil;ık olarak kalmasıdır. &amp;Ouml;zellikle yukarıdaki gibi iş nesneleri &amp;uuml;zerinden y&amp;uuml;r&amp;uuml;t&amp;uuml;len sorgularda Connection nesnelerinin otomatik olarak kapatılmasını sağlamak i&amp;ccedil;in CommandBehavior numaralandırıcısının CloseConnection değerini kullanmayı unutmamak gerekir. Dolayısıyla DbWork sınıfımızdaki Results metodunu aşağıdaki gibi d&amp;uuml;zenlersek istediğimiz sonucu elde eder ve istisnanın &amp;uuml;stesinden geliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public SqlDataReader Results(string selectQuery)
{
    SqlCommand cmd=new SqlCommand(selectQuery,con);
    con.Open();
    dr=cmd.ExecuteReader(CommandBehavior.CloseConnection); // Doğru Kullanım.
    // dr=cmd.ExecuteReader(); // Hatalı kullanım.
    return dr; 
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk119_3.gif" alt="" width="388" height="323" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Sorgu Sonucu Tek Bir Satır D&amp;ouml;nd&amp;uuml;ğ&amp;uuml; Kesin İse&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Bazı durumlarda tablolardan d&amp;ouml;nen satır sayısının 1 olacağı kesindir. Bu satırlar &amp;ccedil;oğunlukla belirli key alanı &amp;uuml;zerinden elde edilen parametrik sorguların sonucudur. &amp;Ouml;rneğin, benzersiz değer alan (unique), ve otomatik olarak artan alanların parametre olarak kullanıldığı sorgular g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz. Bu tarz sorgularda, bağlantısız katman nesnelerini kullanmak gereksiz yere kaynak t&amp;uuml;ketimine neden olacaktır. B&amp;ouml;yle bir durumda DataReader nesneleri&amp;nbsp; bağlantısız katman nesnelerine oranla &amp;ccedil;ok daha performanslı ve hızlı &amp;ccedil;alışacaktır. Burada &amp;ouml;nemli olan DataReader ile d&amp;ouml;nen satırı okumak i&amp;ccedil;in ilgili Command nesnesinin ExecuteReader metoduna verilecek CommandBehavior numaralandırıcısının değeridir. Aşağıda bu tekniğin kullanımına bir &amp;ouml;rnek verilmiştir. Veritabanı işlemlerimizi topladığımız DbWork sınıfı basit olarak constructor metodu ile bir SqlConnection nesnesi &amp;ouml;rneklendirir. GetRow metodumuz ise gelen sorguya ve parametre değerine g&amp;ouml;re bulunan satırı okuyacak bir SqlDataReader nesnesini geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;r.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.Data.SqlClient;

namespace DataReaderDikkat
{
    public class DbWork
    {
        private SqlConnection con;
        private SqlDataReader dr;

        /* CloseConnection kullanımına &amp;ouml;rnek metod.*/
        public DbWork(string conStr)
        { 
            con=new SqlConnection(conStr);
        }

        public SqlDataReader GetRow(string FindQuery,int orderID)
        {
            SqlCommand cmd=new SqlCommand(FindQuery,con);
            cmd.Parameters.Add("@OrderID",SqlDbType.Int);
            cmd.Parameters["@OrderID"].Value=orderID;
            con.Open();
            dr=cmd.ExecuteReader((CommandBehavior)40);
            return dr;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Burada ExecuteReader metodunun kullanılışına dikkatinizi &amp;ccedil;ekerim. CommandBehavior numaralandırıcısının alacağı değerlerin sayısal karşılıkları vardır. SingleRow değerinin integer karşılığı 8, CloseConnection numaralandırıcısının integer karşılığı ise 32' dir. Dolayısıyla (CommandBehavior)40, oluşturulan SqlDataReader nesnesine sadece tek bir satır d&amp;ouml;nd&amp;uuml;receğini ve SqlDataReader nesnesi kapatıldığında SqlConnection nesnesinin de otomatik olarak kapatılacağını belirtir. Gelelim ana program kodlarımıza;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.Data.SqlClient;

namespace DataReaderDikkat
{
    class ClosingDataReader
    { 
        [STAThread]
        static void Main(string[] args)
        { 
            DbWork worker=new DbWork("data source=BURKI;database=Northwind;integrated security=SSPI");

            #region SingleRow Kullanın.
            SqlDataReader drFind=worker.GetRow("SELECT * FROM Orders WHERE OrderID=@OrderID",10248);
            drFind.Read();
            Console.WriteLine("BULUNAN SATIR "+drFind[0].ToString());
            drFind.Close();

            drFind=worker.GetRow("SELECT * FROM Orders WHERE OrderID=@OrderID",10249);
            drFind.Read();
            Console.WriteLine("BULUNAN SATIR "+drFind[0].ToString());
            drFind.Close();
            #endregion
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk119_1.gif" alt="" width="316" height="107" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Toplu Sorgula İ&amp;ccedil;in DataReader Kullanın&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle birden fazla sonu&amp;ccedil; k&amp;uuml;mesini (result set) almak istiyorsanız ve DataReader kullanmaya karar verdiyseniz en uygun y&amp;ouml;ntem NextResult metodunun uygulanmasıdır. Ger&amp;ccedil;ek şu ki, b&amp;ouml;yle bir durumda birden fazla DataReader nesnesi peş peşe &amp;ccedil;alıştırılabilir. Aynı bu makalemizdeki ilk &amp;ouml;rneğimizde olduğu gibi. Eğer bu tarz sonu&amp;ccedil; k&amp;uuml;melerini ger&amp;ccedil;ekten arka arkaya alıyorsak ve aynı Connection' ı kullanıyorsak, birden fazla DataReader nesnesi kullandığımız i&amp;ccedil;in aynı Connection' ı kullanıyor olsakta veritabanına doğru birden fazla sayıda tur atmış oluruz. &amp;Ccedil;&amp;uuml;nk&amp;uuml; her bir DataReader nesnesinden sonradan gelen DataReader nesnelerinin aynı Connection' ı kullanmalarına imkan sağlamamız i&amp;ccedil;in ilgili Connection' ları kapatmak gibi bir zorunluluğumuz vardır.&lt;/p&gt;
&lt;p&gt;Oysaki bu sorguları Batch Query olarak hazırlarsak tek bir DataReader nesnesi ve tek bir Connection ile daha hızlı sonu&amp;ccedil; elde edebiliriz. Aynı aşağıdaki &amp;ouml;rnekte olduğu gibi. DbWork sınıfımıza bu sefer, Batch Query &amp;ccedil;alıştıracak bir metot ekledik. Metodumuz gelen string dizisi i&amp;ccedil;indeki sorgu c&amp;uuml;mlelerini alıp bir StringBuilder yardımıyla birleştiriyor. Bu işlemin sonucu olarak "sorgu c&amp;uuml;mlesi 1;sorgu c&amp;uuml;mlesi 2;sorgu c&amp;uuml;mlesi 3;" tarzında bir query string' i oluşturuyoruz ki bu bizim Batch Qeury' mizdir. Daha sonra ilgili sorgu topluluğunu &amp;ccedil;alıştıracak bir SqlCommand nesnesi oluşturuyor ve bu komutu y&amp;uuml;r&amp;uuml;terek elde ettiğimiz SqlDataReader nesnesini geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;yoruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.Data.SqlClient;
using System.Text;

namespace DataReaderDikkat
{
    public class DbWork
    {
        private SqlConnection con;
        private SqlDataReader dr;

        /* CloseConnection kullanımına &amp;ouml;rnek metod.*/
        public DbWork(string conStr)
        { 
            con=new SqlConnection(conStr);
        }
    
        public SqlDataReader BatchResults(string[] sorgular)
        {
            StringBuilder sbSorgular=new StringBuilder();
            for(int i=0;i&amp;lt;sorgular.Length;i++)
            {
                sbSorgular.Append(sorgular[i]+";"); 
            }
            SqlCommand cmd=new SqlCommand(sbSorgular.ToString(),con);
            con.Open();
            SqlDataReader dr=cmd.ExecuteReader(CommandBehavior.CloseConnection);
            return dr;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Gelelim uygulama kodlarımıza;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.Data.SqlClient;

namespace DataReaderDikkat
{
    class ClosingDataReader
    { 
        [STAThread]
        static void Main(string[] args)
        { 
            DbWork worker=new DbWork("data source=BURKI;database=Northwind;integrated security=SSPI");

            #region BatchQuery' lerde
            string[] sorguKumesi={"SELECT TOP 5 * FROM Orders","SELECT TOP 5 * FROM Customers","SELECT TOP 5 * FROM [Order Details]"};
            SqlDataReader drToplu=worker.BatchResults(sorguKumesi);
            do
            {
                while(drToplu.Read())
                {
                    Console.WriteLine(drToplu[0].ToString()+" "+drToplu[1].ToString());
                }
                Console.WriteLine("------------");
            }while(drToplu.NextResult());
            drToplu.Close();
            #endregion
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk119_4.gif" alt="" width="388" height="323" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Binary ve Text Tipindeki Alanları Okurken&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Bazı tablolar i&amp;ccedil;erisinde text veya binary tabanlı alanlar tutarız. &amp;Ouml;rneğin resim dosyalarının tablolarda binary olarak saklanması veya makalelerin html verisinin text tipli alanlar olarak saklanması gibi. &amp;Ouml;zellikle bu tarz alanları okurken DataReader nesnelerini kullanıyorsak, SequentialAccess tekniğini kullanmak bize avantaj sağlayabilir. &amp;Ouml;yle ki bu tekniği uyguladığımızda ilgili satırın tamamı okunacağına bunun yerine bir stream oluşturulur. Siz bu stream' i kullanarak ilgili alana ait binary yada text veriyi okursunuz. &amp;Ouml;rneğin aşağıdaki kodlar ile Northwind database' inde yer alan Categories tablosundaki Text tipindeki Description alanının ilk 150 karakteri okunmaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public SqlDataReader ReadText(string Query)
{
    SqlCommand cmd=new SqlCommand(Query,con);
    con.Open();
    dr=cmd.ExecuteReader((CommandBehavior)48); // Bu kez hem SequentialAccess hem de CloseConnection se&amp;ccedil;ili.
    return dr; 
}&lt;/pre&gt;
&lt;p&gt;Metodumuzun kullanılışı ise aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlDataReader drText=worker.ReadText("SELECT CategoryName,Description,Picture FROM Categories");
char[] tampon=new char[150];
while(drText.Read()) 
{ 
    drText.GetChars(1,0,tampon,0,150);
    for(int i=0;i&amp;lt;150;i++)
    {
        Console.Write(tampon[i].ToString());
    }
    Console.WriteLine();
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk119_5.gif" alt="" width="516" height="263" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu makalemizde DataReader nesnelerini kullanırken dikkat edeceğimiz ve bize avantaj sağlayacak teknikleri incelemeye &amp;ccedil;alıştık. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/DataReaderDikkat.zip"&gt;&amp;Ouml;rnek i&amp;ccedil;in tıklayın.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2005-04-04 12:00:00</pubDate>
  <slug>DataReader-Nesnelerini-Kullanc4b1rkene280a6-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>sqldatareader</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>