<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF - P2P(Peer-to-peer) Programlamaya Giriş</title>
  <description>Dağıtık mimari uygulamaları(Distributed Applications) geliştirilirken çoğunlukla Client/Server veya N-Tier modelleri göz önüne alınmaktadır. Oysaki dağıtık mimari uygulamaları için Peer-to-Peer(P2P) modelide söz konusudur. P2P modelinde istemci ve sunucu arasında bir fark yoktur ve alt yapı hazırlıkları diğer modellere göre biraz daha karmaşıktır. Programlama zorluğu nedeni ile geliştiriciler zaman zaman bu modelden kaçınırlar.</description>
  <content>&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Değerli Okurlarım Merhabalar,&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Dağıtık mimari uygulamaları(Distributed Applications)&lt;/strong&gt; geliştirilirken &amp;ccedil;oğunlukla &lt;strong&gt;Client/Server&lt;/strong&gt; veya &lt;strong&gt; N-Tier &lt;/strong&gt;modelleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınmaktadır. Oysaki dağıtık mimari uygulamaları i&amp;ccedil;in &lt;strong&gt;Peer-to-Peer(P2P)&lt;/strong&gt; modelide s&amp;ouml;z konusudur. &lt;strong&gt; P2P&lt;/strong&gt; modelinde istemci ve sunucu arasında bir fark yoktur ve alt yapı hazırlıkları diğer modellere g&amp;ouml;re biraz daha karmaşıktır. Programlama zorluğu nedeni ile geliştiriciler zaman zaman bu modelden ka&amp;ccedil;ınırlar. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Oysaki g&amp;uuml;n&amp;uuml;m&amp;uuml;zde P2P &amp;uuml;zerine kurulu olan pek &amp;ccedil;ok sistem yer almaktadır. P2P uygulamalarına &amp;ouml;rnek olarak, &lt;strong&gt;IRC(Internet Relay Chat), anında mesajlaşma(Instant Messaging), dosya paylaşım(File Sharing), Oyunlar, g&amp;ouml;rsel ve sesli veri aktarımı, veri kopyalama(Data Replication) &lt;/strong&gt; programları g&amp;ouml;sterilebilir. Dolayısıyla P2P modelinin dağıtık mimari &amp;ccedil;&amp;ouml;z&amp;uuml;mlerinde aslında &amp;ouml;nemli bir yeri bulunmaktadır. P2P tabanlı sistemlerde &amp;ouml;zellikle &lt;strong&gt;&amp;ouml;l&amp;ccedil;eklenebilirlik(Scalability)&lt;/strong&gt; ve &lt;strong&gt; g&amp;uuml;venilirlik(Reliability)&lt;/strong&gt;, diğer dağıtık mimari modelleri ile kıyaslandığında daha y&amp;uuml;ksek verimlilik g&amp;ouml;stermektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;P2P programlar başarılı bir şekilde tesis edildiklerinde scalability ve reliability manasında belirgin &amp;uuml;st&amp;uuml;nl&amp;uuml;k ve avantajlar sağlamaktadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Scalability : Kaynak kullanımının artmasıyla sistem performansının değer kaybetmeden y&amp;uuml;kselebilmesi &amp;ouml;l&amp;ccedil;eklenebilirlik olarak ifade edilebilir. Bu oranın y&amp;uuml;ksek olması bir avantaj olarak g&amp;ouml;r&amp;uuml;lebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Reliability : Kurulu olan sistemin g&amp;uuml;venilirliğini, aynı zamanda devamlılığını ifade eder.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ccedil;ok doğal olarak &lt;strong&gt;Windows Communication Foundation(WCF)&lt;/strong&gt; i&amp;ccedil;erisindede &lt;strong&gt;P2P&lt;/strong&gt; desteği bulunmaktadır. Bu b&amp;ouml;l&amp;uuml;mde WCF mimarisi ile P2P &amp;ccedil;&amp;ouml;z&amp;uuml;mlerinin nasıl geliştirilebileceğine giriş yapılmaktadır. Başlamadan &amp;ouml;nce diğer dağıtık mimari modellerine kısaca bir g&amp;ouml;z atmakta ve P2P ile aralarındaki farkları analiz etmeye &amp;ccedil;alışmakta yarar bulunmaktadır. &lt;strong&gt; Client/Server(İstemci/Sunucu)&lt;/strong&gt; modeli aşağıdaki şekil ile basit&amp;ccedil;e &amp;ouml;zetlenebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk252_1.gif" alt="" width="454" height="426" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu modelde istemci, sunucu &amp;uuml;zerinden yayınlanan fonksiyonellikler i&amp;ccedil;in &lt;strong&gt;talepte(Request)&lt;/strong&gt; bulunur. Sunucunun g&amp;ouml;revi ise bu taleplere karşılık &lt;strong&gt;cevaplar(Response)&lt;/strong&gt; &amp;uuml;retmektir. Bu mimariye verilebilecek en g&amp;uuml;zel &amp;ouml;rnek &lt;strong&gt;Web sunucuları&lt;/strong&gt; ve &lt;strong&gt;tarayıcı uygulamalardır(Browser Applications)&lt;/strong&gt;. S&amp;ouml;z gelimi &lt;strong&gt; IIS(Internet Information Services)&lt;/strong&gt; sunucu g&amp;ouml;revini &amp;uuml;stlenirken,&lt;strong&gt; Internet Explorer, Netscape Navigator, Mozilla Firefox &lt;/strong&gt;gibi tarayıcı uygulamalar istemci rol&amp;uuml;n&amp;uuml; y&amp;uuml;klenmektedir. Bu modelde aslında istemci ve sunucu uygulamalar aynı sistemin bir par&amp;ccedil;asıdır. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Her zaman &lt;strong&gt;IIS&lt;/strong&gt; yada &lt;strong&gt;Internet Explorer&lt;/strong&gt; gibi hazır program aray&amp;uuml;zleri olmayabilir. S&amp;ouml;z gelimi WCF mimarisinde &lt;strong&gt;Self Hosting&lt;/strong&gt; tekniğine g&amp;ouml;re sunucu program, &lt;strong&gt; Console&lt;/strong&gt;, &lt;strong&gt;Windows&lt;/strong&gt;, &lt;strong&gt;WPF&lt;/strong&gt;, &lt;strong&gt;Windows Service,&lt;/strong&gt; &lt;strong&gt; WAS(Windows Activation Service) &lt;/strong&gt;uygulaması olacak şekilde geliştirilebilir. Buna paralel olarak istemci tarafı i&amp;ccedil;inde aynı durum ge&amp;ccedil;erlidir. Yinede sonu&amp;ccedil; itibariyle istemci tarafı talepte bulunan, sunucu tarafı ise bu talepleri karşılayan roldedir. Client/Server modelinde merkezileştirme olanağının bulunması bir avantaj olarak g&amp;ouml;r&amp;uuml;lebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;N-Tier&lt;/strong&gt; yada &amp;ccedil;ok katmanlı mimaride, dağıtık uygulama geliştirme modellerinden birisidir. Aslında bu model dağıtık mimari tarafında &amp;ccedil;oğunlukla &lt;strong&gt;3 katmanlı(3-Tier)&lt;/strong&gt; olacak şekilde uygulanmaktadır. Aşağıdaki şekilde bu durum kısaca ifade edilmeye &amp;ccedil;alışılmaktadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk252_2.gif" alt="" width="238" height="419" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu model aslında &lt;strong&gt;Client/Server&lt;/strong&gt; mimarinin genişletilmiş bir hali olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Katmanlar ayrı fiziki par&amp;ccedil;alara b&amp;ouml;l&amp;uuml;mlenebilmektedir. Dağıtık mimari a&amp;ccedil;ısından &amp;ouml;zellikle &lt;strong&gt;iş mantığının(Business Logic)&lt;/strong&gt; farklı bir makineye alınması &lt;strong&gt;&amp;ouml;l&amp;ccedil;eklenebilirliği(Scalability) &lt;/strong&gt;arttıran bir fakt&amp;ouml;rd&amp;uuml;r. Hatta bu fiziki b&amp;ouml;l&amp;uuml;nme ile &lt;strong&gt;y&amp;uuml;k dengesinin dağıtılması(Load Balancing)&lt;/strong&gt;, daha &lt;strong&gt;g&amp;uuml;venli(Secure)&lt;/strong&gt; bir ortamın tesis edilmesi gibi avantajlarda sağlanabilmektedir. Tabiki, bu fiziki b&amp;ouml;l&amp;uuml;n&amp;uuml;m i&amp;ccedil;in donanıma yapılan yatırımda bu işin cabası olarak g&amp;ouml;r&amp;uuml;lebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;P2P&lt;/strong&gt; modelinde ise sistemin t&amp;uuml;m katılımcıları&lt;em&gt;(ki bunlar peer node-boğum olaraktanda adlandırılmaktadır) &lt;/em&gt;&amp;ccedil;oğunlukla hem istemci hemde sunucu g&amp;ouml;revini &amp;uuml;stlenebilmektedir. &lt;strong&gt;Client/Server&lt;/strong&gt; veya &lt;strong&gt;N-Tier&lt;/strong&gt; modelleri ile dağıtık uygulama &amp;ccedil;&amp;ouml;z&amp;uuml;mleri geliştirilmesi &lt;strong&gt;P2P&lt;/strong&gt;' e g&amp;ouml;re daha kolaydır. Ayrıca y&amp;ouml;netimin merkezileştirilmesi yada g&amp;uuml;venliğin g&amp;uuml;&amp;ccedil;l&amp;uuml; bir şekilde sağlanmasıda s&amp;ouml;z konusudur. Fakat b&amp;ouml;l&amp;uuml;m&amp;uuml;n başındada belirtildiği &amp;uuml;zere, &lt;strong&gt; &amp;ouml;l&amp;ccedil;eklenebilirlik(Scalability) &lt;/strong&gt;ve &lt;strong&gt;g&amp;uuml;venilirlik(Reliability)&lt;/strong&gt; gibi konularda P2P mimarisi ger&amp;ccedil;ekten &amp;ouml;ne &amp;ccedil;ıkmaktadır. &lt;em&gt;(Tabiki, &amp;ouml;l&amp;ccedil;eklenebilirlik olgusu, P2P dışındaki modellerdede vardır ancak maliyeti daha y&amp;uuml;ksek olmaktadır. &amp;Ouml;zellikle sunucu yatırımları g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında.)&lt;/em&gt; Elbetteki bu farklılıklar ger&amp;ccedil;ek hayat vakalarında duruma g&amp;ouml;re tercih edilebilirler. Hatta bazı vakalarda karma modellerin kullanıldığıda g&amp;ouml;r&amp;uuml;lmektedir. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Genel olarak &lt;strong&gt;P2P&lt;/strong&gt; modelinde yer alan uygulamalar bir &lt;strong&gt;Mesh Network&lt;/strong&gt; i&amp;ccedil;erisinde gruplanırlar. S&amp;ouml;z konusu &lt;strong&gt;Mesh Network'&lt;/strong&gt; lerin iki farklı uygulanış bi&amp;ccedil;imi vardır. Bunlardan birisi &lt;strong&gt;Par&amp;ccedil;alı Bağlı Mesh(Partially Connected Mesh)&lt;/strong&gt; modelidir ve aşağıdaki şekildekine benzer bir yaklaşım sunmaktadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk252_4.gif" alt="" width="372" height="358" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu modele g&amp;ouml;re &lt;strong&gt;Mesh Network&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &lt;strong&gt;boğumlar(Peer Nodes)&lt;/strong&gt; yakınlarındaki komşularına doğrudan bağlıdır. Bir başka deyişle sistem i&amp;ccedil;erisindeki programlar en yakın bilgisayardaki ile konuşabilmektedir. &lt;em&gt;(Birbirlerinin komuş boğumları olarakta g&amp;ouml;r&amp;uuml;lebilirler.)&lt;/em&gt; Bu modelde boğumların tamamı birbirlerine bağlı değildir. Bu nedenle &amp;ouml;rneğin komşu olmayan bir boğumda yer alan katılımcıya mesaj aktarımı i&amp;ccedil;in, mesajın sırayla birbirlerine bağlı olan boğumlar &amp;uuml;zerinden hareket etmesi gerekmektedir. Bu bir dezavantaj olarak g&amp;ouml;r&amp;uuml;lebilir. Diğer taraftan bu tip sistemlerde Mesh Network' e dahil olan katılımcı sayısının artması ile birlikte, &lt;strong&gt; &amp;ouml;l&amp;ccedil;eklenebilirliğinde&lt;/strong&gt; &lt;strong&gt;arttrığı&lt;/strong&gt; g&amp;ouml;zlemlenmektedir. Doğal olarak bu bir avantajdır. Diğer modelde ise &lt;strong&gt;Mesh Network &lt;/strong&gt; i&amp;ccedil;erisinde yer alan t&amp;uuml;m katılımcılar(PeerNode) birbirlerine bağlıdır. Bu durum aşağıdaki şekil ile &amp;ouml;zetlenebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk252_3.gif" alt="" width="378" height="364" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ccedil;oğunlukla&lt;strong&gt; Mesh Network&lt;/strong&gt; i&amp;ccedil;erisindeki katılımcı sayılarının d&amp;uuml;ş&amp;uuml;k olduğu durumlarda tercih edilen bir modeldir. &amp;Ccedil;ok doğal olarak Mesh ağlarında katılımcı uygulamaların birbirlerini bulabilmesi veya haberleşebilmesi i&amp;ccedil;in bir takım protokollerin rol oynaması gerekmektedir. S&amp;ouml;z gelimi &lt;strong&gt;UDP(User Datagram Protocol)&lt;/strong&gt; gibi. &lt;strong&gt;Windows Communication Foundation&lt;/strong&gt; bu ama&amp;ccedil;la &lt;strong&gt;Peer Name Resolution Protocol(PNRP)&lt;/strong&gt; isimli protokol&amp;uuml; varsayılan olarak kullanmaktadır. Bu protokol &lt;strong&gt;Windows XP Service Pack 2&lt;/strong&gt; ve &lt;strong&gt; Windows Vista&lt;/strong&gt; ile birlikte gelmektedir. Ancak istenirse &lt;strong&gt;PNRP&lt;/strong&gt; yerine kullanılacak &amp;ouml;zel &lt;strong&gt;&amp;ccedil;&amp;ouml;z&amp;uuml;c&amp;uuml;ler(Resolver)&lt;/strong&gt; ele alınabilir ki bu b&amp;ouml;l&amp;uuml;mde ele alınacaktır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;PNRP(Peer Name Resolution Protocol) protokol&amp;uuml; sistemde y&amp;uuml;kl&amp;uuml; değilse, Windows XP Service Pack 2 i&amp;ccedil;in Add Remove Windows Components kımsına girip, Network Services bileşenlerinden Peer to Peer birimini eklemek yeterli olacaktır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk252_5.gif" alt="" width="449" height="344" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ouml;zellikle uygulama geliştirildikten sonra&lt;span style="color: #000000;"&gt; "System.InvalidOperationException&lt;/span&gt;: Resolver must be specified. The default resolver (PNRP) is not available." gibi bir &amp;ccedil;alışma zamanı istisnasının(Runtime Exception) alınmasının nedeni ilgili PNRP hizmetinin y&amp;uuml;klenmemiş olmasıdır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;PNRP y&amp;uuml;klenmesi tek başına yeterli değildir. Peer Name Resolution Protocol Service &amp;ccedil;alışıyor olması gerekmektedir. Bunun i&amp;ccedil;in Administrator Tools b&amp;ouml;l&amp;uuml;mden yer alan Services kısmından yararlanılabilir yada komut satırından net start pnrpsvc emri aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde oldugu gibi uygulanabilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk252_6.gif" alt="" width="481" height="140" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Ne varki PNRP sadece XP ve Vista i&amp;ccedil;in ge&amp;ccedil;erlidir. S&amp;ouml;z gelimi Windows Server 2003 sisteminde &amp;ccedil;alıştırılamamaktadır. Diğer taraftan PNRP IPv6 alt yapısını kullanmaktadır. Bu nedenle IPv6 desteği olmayan y&amp;ouml;nlendiricilerin(Routers) olduğu sistemlerde ala alınamamaktadır. Ayrıca Vista ile birlikte PNRP 2.0 versiyonu gelmektedir. Buna g&amp;ouml;re XP ile Vista sistemlerin birbirleriyle konuşması gerektiği durumlarda XP sistemler i&amp;ccedil;in ek y&amp;uuml;kleme yapılması gerekmektedir. İşte bu tip sorunların olabileceği vakalarda, &amp;ouml;zel peer &amp;ccedil;&amp;ouml;z&amp;uuml;c&amp;uuml;lerinin(Custom Peer Resolver) geliştirilmesi ve kullanılması &amp;ouml;nerilmektedir. Bu sayede Mesh Network i&amp;ccedil;erisine dahil olan katılımcıların tutuluş şekilleride &amp;ouml;zelleştirilebilir. S&amp;ouml;z gelimi veritabanı &amp;uuml;zerinde saklanabilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;P2P&lt;/strong&gt; programlamada &amp;ouml;nem arz eden konulardan biriside mesajların ulaştırılma şeklidir. Bu noktada iki farklı teknik bulunmaktadır. &lt;strong&gt;Directional&lt;/strong&gt; ve &lt;strong&gt;Flooding&lt;/strong&gt;. &lt;strong&gt; Directional&lt;/strong&gt; mesajlaşmaya g&amp;ouml;re, &lt;strong&gt;Mesh Network&lt;/strong&gt; i&amp;ccedil;erisinde yer alan herhangibir boğumdan(Node) &amp;ccedil;ıkan mesaj, &lt;strong&gt;hedef boğuma(node)&lt;/strong&gt; ulaşıncaya kadar komşu boğumlar &amp;uuml;zerinden y&amp;ouml;nlendirilir. &lt;strong&gt;Flooding&lt;/strong&gt; haberleşmede ise mesaj,&lt;strong&gt; Mesh Network&lt;/strong&gt; i&amp;ccedil;erisindeki t&amp;uuml;m boğumlara g&amp;ouml;nderilir ve mesajı alması gereken boğum tarafından yakalanır. &amp;Ccedil;ok doğal olarak &lt;strong&gt;Flooding&lt;/strong&gt; modelinde aynı &lt;strong&gt;Mesh Network &lt;/strong&gt;i&amp;ccedil;erisinde yer alan bir boğumda &amp;ccedil;alışan uygulamaya mesajın defalarca gelmesi s&amp;ouml;z konusu olabilmektedir. &lt;strong&gt;WCF&lt;/strong&gt;&amp;nbsp;mimarisi, &lt;strong&gt;P2P&lt;/strong&gt; programlamada &lt;strong&gt;Flooding&lt;/strong&gt; mesajlaşma modelini kullanmaktadır. Bununla birlikte &lt;strong&gt;WCF&lt;/strong&gt; geliştiricisi i&amp;ccedil;in en &amp;ouml;nemli olan noktalardan birisininde bağlayıcı tip se&amp;ccedil;imi olduğu bilinmektedir. &lt;strong&gt;WCF,&lt;/strong&gt; P2P i&amp;ccedil;in &lt;strong&gt;bağlayıcı tip(Binding Type)&lt;/strong&gt; olarak &lt;strong&gt;NetPeerTcpBinding&lt;/strong&gt; sınıfını ele alınmaktadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu basit teknik detaylardan sonra &lt;strong&gt; WCF&lt;/strong&gt; tarafından &lt;strong&gt;P2P&lt;/strong&gt; tarzı bir uygulamanın nasıl geliştirilebileceği adım adım incelenebilir. &amp;Ouml;rnekte &lt;strong&gt;PNRP&lt;/strong&gt; hizmeti yerine &lt;strong&gt;CustomPeerResolverService&lt;/strong&gt; tipi kullanılarak bir servis uygulaması tasarlanacak ve &lt;strong&gt;IRC&lt;/strong&gt; benzeri basit bir program ortamı geliştirilecektir. Bu &amp;ccedil;&amp;ouml;z&amp;uuml;msel yaklaşım aynı zamanda &lt;strong&gt;Microsoft&lt;/strong&gt; tarafındanda &amp;ouml;nerilmektedir. Bu ama&amp;ccedil;la &amp;ouml;zel &amp;ccedil;&amp;ouml;z&amp;uuml;c&amp;uuml;y&amp;uuml; i&amp;ccedil;eren ayrı bir servis uygulaması yazılmalıdır. &amp;Ouml;rnek olarak bu bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması olabilir. S&amp;ouml;z konusu uygulamanın kod i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ouml;zel &amp;Ccedil;&amp;ouml;z&amp;uuml;c&amp;uuml; Service Kodu;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using System.ServiceModel.PeerResolvers;

namespace IRCServer
{
    class Program
    {
        static void Main(string[] args)
        {
            CustomPeerResolverService resolver = new CustomPeerResolverService();
            ServiceHost customResolver = new ServiceHost(resolver);

            resolver.Open();
            customResolver.Open();
            Console.WriteLine("&amp;Ccedil;&amp;ouml;z&amp;uuml;mleyici aktif. &amp;Ccedil;ıkmak i&amp;ccedil;in bir tuşa basınız...");
            Console.ReadLine();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Burada dikkat edilmesi gereken ilk nokta &lt;strong&gt;CustomPeerResolverService&lt;/strong&gt; sınıfına ait bir nesne &amp;ouml;rneği kullanılmasıdır. &lt;strong&gt;CustomPeerResolverService&lt;/strong&gt; sınıfı &amp;ouml;zel peer &amp;ccedil;&amp;ouml;z&amp;uuml;c&amp;uuml; i&amp;ccedil;in gerekli &lt;strong&gt;temel uyarlamaları(Basic Implementations)&lt;/strong&gt; i&amp;ccedil;ermektedir. S&amp;ouml;z konusu tip &lt;strong&gt; IPeerResolverContract&lt;/strong&gt; &lt;strong&gt;aray&amp;uuml;z&amp;uuml;nden(Interface)&lt;/strong&gt; t&amp;uuml;retilmiştir. &lt;strong&gt;IPeerResolverContract&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; &amp;ouml;zellikle peer uyarlamasında &amp;ouml;zel işlemler yapılması istendiği durumlarda ele alınmaktadır. S&amp;ouml;z gelimi peer &amp;ccedil;&amp;ouml;z&amp;uuml;mleyicisinin veritabanı ilişkili olması isteniyorsa, &lt;strong&gt; IPeerResolverContract&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulayan bir sınıfın yazılması ve ilgili &amp;uuml;yelerin ezilmesi gerekmektedir. Sonrasında ise uygulama i&amp;ccedil;erisinde bu sınıfın, peer &amp;ccedil;&amp;ouml;z&amp;uuml;c&amp;uuml; olarak kullanılacağı belirtilmelidir. &amp;Ouml;rnekte b&amp;ouml;yle bir ihtiya&amp;ccedil; olmadığından &lt;strong&gt;.Net Framework 3.0&lt;/strong&gt; ile birlikte gelen hazır &lt;strong&gt; CustomPeerResolverService&lt;/strong&gt; sınıfı kullanılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ccedil;&amp;ouml;z&amp;uuml;c&amp;uuml; Servise ait konfigurasyon i&amp;ccedil;eriği;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service name="System.ServiceModel.PeerResolvers.CustomPeerResolverService"&amp;gt;
                &amp;lt;endpoint address="net.tcp://localhost:4500/IRCResolver" binding="netTcpBinding" bindingConfiguration="ResolverBindingConfig" contract="System.ServiceModel.PeerResolvers.IPeerResolverContract" /&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
        &amp;lt;bindings&amp;gt;
            &amp;lt;netTcpBinding&amp;gt;
                &amp;lt;binding name="ResolverBindingConfig"&amp;gt;
                    &amp;lt;security mode="None"/&amp;gt;
                &amp;lt;/binding&amp;gt;
            &amp;lt;/netTcpBinding&amp;gt;
        &amp;lt;/bindings&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;s&lt;/span&gt;&lt;/strong&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;ervices&lt;/strong&gt; elementi i&amp;ccedil;erisine dikkat edilecek olursa, &lt;strong&gt;net.tcp://localhost:4500/IRCResolver&lt;/strong&gt; adresi &amp;uuml;zerinden &lt;strong&gt;NetTcpBinding&lt;/strong&gt; bağlayıcı tipini ele alan, herhangibir g&amp;uuml;venlik modunun kullanılmadığı ve &lt;strong&gt;IPeerResolverContract&lt;/strong&gt; &lt;strong&gt; s&amp;ouml;zleşmesini(Service Contract) &lt;/strong&gt;bildiren bir &lt;strong&gt;EndPoint&lt;/strong&gt; tanımlaması yapıldığı g&amp;ouml;r&amp;uuml;lmektedir. Elbette, &lt;strong&gt;Mesh Network&lt;/strong&gt; i&amp;ccedil;erisine dahil olacak olan katılımcıların&lt;em&gt;(PeerNode)&lt;/em&gt; birbirleriyle haberleşebilmeleri i&amp;ccedil;in tasarlanan bu &amp;ouml;zel peer &amp;ccedil;&amp;ouml;z&amp;uuml;c&amp;uuml; servis uygulamasının &amp;ccedil;alışıyor olması gerekmektedir. &amp;Ccedil;ok doğal olarak bu uygulama ağ ortamında bir sunucu &amp;uuml;zerinde host edildiği takdirde&lt;em&gt;(S&amp;ouml;z gelimi &lt;strong&gt;Windows Server 2003 &lt;/strong&gt;&amp;uuml;zerinde koşan bir &lt;strong&gt;Windows Service &lt;/strong&gt; i&amp;ccedil;erisinden sunulabilir)&lt;/em&gt; ağa bağlı t&amp;uuml;m istemci uygulamaların birbirleriyle &lt;strong&gt;P2P&lt;/strong&gt; &amp;uuml;zerinden haberleşebilmesi sağlanabilir. &amp;Uuml;stelik TCP bazlı yayınlama yapıldığı i&amp;ccedil;in performans a&amp;ccedil;ısından da olduk&amp;ccedil;a tatmin edici sonu&amp;ccedil;lar alınacaktır.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;İstemci tarafında yer alacak ve Mesh ağına katılımcı(PeerNode) olarak dahil olacak program basit bir &lt;strong&gt;Windows&lt;/strong&gt; uygulaması olarak tasarlanmaktadır. Bu uygulamanın g&amp;ouml;rsel aray&amp;uuml;z&amp;uuml; aşağıdaki gibidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk252_7.gif" alt="" width="236" height="281" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Kullanıcılar istedikleri bir isim ile &lt;strong&gt;Mesh ağına&lt;/strong&gt; dahil olabileceklerdir. Bununla birlikte mesaj g&amp;ouml;ndermek, diğer katılımcıların mesajlarını g&amp;ouml;rmek veya &lt;strong&gt;IRC&lt;/strong&gt; kanalından ayrılmak gibi işlemleride yapabileceklerdir. Katılımcılar i&amp;ccedil;in &amp;ouml;nemli olan &amp;uuml;&amp;ccedil; operasyon s&amp;ouml;z konusudur. &lt;strong&gt;Mesh&lt;/strong&gt; ağına dahil olmak, ağdan ayrılmak ve ağdaki herkese mesaj g&amp;ouml;nderebilmek. Bunların bir servis s&amp;ouml;zleşmesine ait operasyonlar olduğu a&amp;ccedil;ıktır. Dolayısıyla istemci tarafında bu işlevsellikleri barındıran bir s&amp;ouml;zleşme aray&amp;uuml;z&amp;uuml; tasarlanmalıdır. Diğer taraftan bu tip bir &lt;strong&gt;P2P&lt;/strong&gt; &amp;ccedil;alışmada, kanalın &lt;strong&gt;&amp;ccedil;ift y&amp;ouml;nl&amp;uuml; iletişim(Duplex Communication)&lt;/strong&gt; sağlayacak şekilde &amp;ccedil;alışabiliyor olması ve hatta s&amp;ouml;z konusu operasyonların asenkron olarak y&amp;uuml;r&amp;uuml;t&amp;uuml;lebilmesi gereklidir. Bu sebepten &lt;strong&gt; DuplexChannel&lt;/strong&gt; kullanılması ve operasyonların &lt;strong&gt;OneWay&lt;/strong&gt; olarak işaretlenmesi gereklidir. &lt;strong&gt;Windows&lt;/strong&gt; uygulamasına ait olan &lt;strong&gt;Form&lt;/strong&gt; sınıfının kendisi bu senaryoda &lt;strong&gt;s&amp;ouml;zleşmeyi(Service Contract) &lt;/strong&gt; uygulayan tip olacaktır. Bunlara ek olarak istemci tarafından a&amp;ccedil;ılacak olan kanal i&amp;ccedil;inde &lt;strong&gt;IClientChannel&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n hesaba katılması gerekmektedir. Katılımcı uygulama tarafından bakıldığında &lt;strong&gt;sınıf diagramı(Class Diagram) &lt;/strong&gt;i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk252_8.gif" alt="" width="307" height="291" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk252_9.gif" alt="" width="363" height="523" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Katılımcı uygulamanın kodları aşağıdaki gibidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Windows.Forms;
using System.ServiceModel;
using System.ServiceModel.Channels;

namespace ChatApp
{
    public partial class Form1 
        : Form
        ,IIRCSozlesmesi
    {
        string _kullanici=null;
        InstanceContext _instanceContext=null;
        DuplexChannelFactory&amp;lt;IIRCChannel&amp;gt; _fabrika = null;
        IIRCChannel _katilimci = null;
        IOnlineStatus _onlineDurum = null;

        public Form1()
        {
            InitializeComponent();
        }

        private void Form1_Load(object sender, EventArgs e)
        {
            btnKatil.Enabled = true;
            btnAyril.Enabled = false;
            btnMesajiGonder.Enabled = false; 
            txtMesajlar.ScrollBars = ScrollBars.Vertical; 
        }

        #region IChat Members
    
        public void DahilEt(string uyeAdi)
        {
            txtMesajlar.Text += String.Format("*** {0} IRC' ye katıldı. ***", uyeAdi);
            txtMesajlar.Text += Environment.NewLine;
        }

        public void MesajGonder(string uyeAdi, string mesaj)
        {
            txtMesajlar.Text += String.Format("({0}) -&amp;gt; {1}", uyeAdi,mesaj);
            txtMesajlar.Text += Environment.NewLine;
        }

        public void Ayril(string uyeAdi)
        {
            txtMesajlar.Text += String.Format("*** {0} IRC' den ayrıldı. ***", uyeAdi);
            txtMesajlar.Text += Environment.NewLine;
        }

        #endregion

        private void btnKatil_Click(object sender, EventArgs e)
        {
            if (!String.IsNullOrEmpty(txtKullaniciAdi.Text))
                _kullanici = txtKullaniciAdi.Text;
            else
                _kullanici = "İsimsiz";
        
            _instanceContext = new InstanceContext(this);
            _fabrika = new DuplexChannelFactory&amp;lt;IIRCChannel&amp;gt;(_instanceContext, "ClientEndPoint");
            _katilimci = _fabrika.CreateChannel();
            _onlineDurum = _katilimci.GetProperty&amp;lt;IOnlineStatus&amp;gt;(); 
        
            _onlineDurum.Online += delegate(object snd, EventArgs ea)
                                            {
                                                  txtMesajlar.Text += "*** Hat A&amp;ccedil;ık ***";
                                                  txtMesajlar.Text += Environment.NewLine;
                                                  txtMesajlar.Text += _onlineDurum.ToString();
                                                  txtMesajlar.Text += Environment.NewLine;
                                            };
            _onlineDurum.Offline += delegate(object snd, EventArgs ea)
                                            {
                                                  txtMesajlar.Text += "*** Hat Kapalı ***";
                                                  txtMesajlar.Text += Environment.NewLine;
                                                  txtMesajlar.Text += _onlineDurum.ToString();
                                                  txtMesajlar.Text += Environment.NewLine;
                                            };
            _katilimci.Open();
            _katilimci.DahilEt(_kullanici);
    
            btnKatil.Enabled = false;
            btnAyril.Enabled = true;
            btnMesajiGonder.Enabled = true;
        }

        private void btnAyril_Click(object sender, EventArgs e)
        {
            _katilimci.Ayril(_kullanici);
            _katilimci.Close();
            _fabrika.Close();
        
            btnKatil.Enabled = true;
            btnAyril.Enabled = false;
            btnMesajiGonder.Enabled = false;
        }

        private void btnMesajiGonder_Click(object sender, EventArgs e)
        {
            _katilimci.MesajGonder(_kullanici, txtMesaj.Text);
            txtMesaj.Clear();
        }
    }

    public interface IIRCChannel
        : IIRCSozlesmesi, IClientChannel
    {
    }

    [ServiceContract(CallbackContract = typeof(IIRCSozlesmesi))]
    public interface IIRCSozlesmesi
    {
        [OperationContract(IsOneWay = true)]
        void DahilEt(string uyeAdi);

        [OperationContract(IsOneWay = true)]
        void MesajGonder(string uyeAdi, string mesaj);
        
        [OperationContract(IsOneWay = true)]
        void Ayril(string uyeAdi);
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;IIRCSozlemesi&lt;/strong&gt; isimli aray&amp;uuml;z(Interface), servis s&amp;ouml;zleşmesini tanımlamaktadır. Bu s&amp;ouml;zleşme i&amp;ccedil;erisinde yer alan &lt;strong&gt; DahilEt&lt;/strong&gt;,&lt;strong&gt; MesajGonder&lt;/strong&gt; ve &lt;strong&gt;Ayril&lt;/strong&gt; isimli operasyonlar asenkron(asynchronous) olarak &amp;ccedil;alışmaktadır ve tek y&amp;ouml;nl&amp;uuml;d&amp;uuml;r(OneWay). Bu sebepten &lt;strong&gt;IsOneWay&lt;/strong&gt; &amp;ouml;zelliklerine &lt;strong&gt;true&lt;/strong&gt; değeri atanmıştır. Diğer taraftan &lt;strong&gt; CallbackContract&lt;/strong&gt; olarak &lt;strong&gt;IIRCSozlesmesi&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n kendisi bildirilmiştir. Bilindiği gibi &lt;strong&gt;&amp;ccedil;ift y&amp;ouml;nl&amp;uuml; iletişim(Duplex Communication) &lt;/strong&gt;kurulacağından bir &lt;strong&gt;geri bildirim s&amp;ouml;zleşmesinin(Callback Contract)&lt;/strong&gt; tanımlanması gerekmektedir. B&amp;ouml;ylece istemciler birbirleri &amp;uuml;zerinden bağımsız olarak operasyon &amp;ccedil;ağrıları ger&amp;ccedil;ekleştirebilir ki, &lt;strong&gt;P2P&lt;/strong&gt; haberleşmede tarafların birbirleri &amp;uuml;zerinde operasyon geri bildirimlerinde bulunması gereklidir. Bu sayede bir katılımcının g&amp;ouml;ndereceği bir mesaj Mesh ağa dahil olan diğer kullanıcılarada iletilebilir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ouml;rnekte yer alan &lt;strong&gt;form&lt;/strong&gt; uygulamasının kendisine ait nesne &amp;ouml;rneği, &lt;strong&gt;Mesh ağın&lt;/strong&gt; bir katılımcısı olarak rol oynamaktadır. Bu sebepten &lt;strong&gt;InstanceContext&lt;/strong&gt; &amp;ouml;rneği oluşturulurken parametre olarak &lt;strong&gt;this&lt;/strong&gt; verilmiştir. &lt;em&gt;(Burada this doğal olarak &amp;ccedil;alışma zamanında Form1 nesne &amp;ouml;rneğini işaret etmektedir.)&lt;/em&gt; Sonrasında ise bir &lt;strong&gt; DuplexChannelFactory&amp;lt;T&amp;gt;&lt;/strong&gt; nesne &amp;ouml;rneği, InstanceContext nesne &amp;ouml;rneğinin kendisi ve konfigurasyon dosyasında belirtilen &lt;strong&gt;EndPoint&lt;/strong&gt; değeri i&amp;ccedil;in &amp;ouml;rneklenmektedir. &lt;strong&gt;DuplexChannelFactory&amp;lt;T&amp;gt;&lt;/strong&gt; generic sınıfı ile, &amp;ccedil;ift y&amp;ouml;nl&amp;uuml; iletişimi ele alacak olan bir referansın &amp;uuml;retilmesi sağlanmaktadır. Bu katılımcıların her biri &amp;ccedil;ift y&amp;ouml;nl&amp;uuml; iletişimi sağlayabilecek şekilde birer kanalı, &lt;strong&gt;Mesh&lt;/strong&gt; ağına doğru a&amp;ccedil;maktadır. Bu kanalın oluşturulması sırasındada devreye &lt;strong&gt;CreateChannel&lt;/strong&gt; metodu girmektedir. Mesh ağına dahil olan kullanıcı referansından yararlanılarak &lt;strong&gt;online&lt;/strong&gt; ve &lt;strong&gt;offline&lt;/strong&gt; olma durumlarına ait olaylar da ele alınabilir. Bu ama&amp;ccedil;la &lt;strong&gt;IOnlineStatus&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n &amp;ccedil;alışma zamanında taşıdığı referanstan yararlanılmaktadır. &amp;Ouml;rnekte &amp;ouml;nemli olan noktalardan biriside konfigurasyon i&amp;ccedil;erisinde yer alan istemci taraflı &lt;strong&gt;EndPoint&lt;/strong&gt; bildirimidir. S&amp;ouml;z konusu uygulama i&amp;ccedil;in bu bildirim aşağıdaki gibidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;client&amp;gt;
            &amp;lt;endpoint address="net.p2p://BizimIRC" binding="netPeerTcpBinding" bindingConfiguration="Varsayilan" contract="ChatApp.IIRCSozlesmesi" name="ClientEndPoint" /&amp;gt;
        &amp;lt;/client&amp;gt;
        &amp;lt;bindings&amp;gt;
            &amp;lt;netPeerTcpBinding&amp;gt;
                &amp;lt;binding name="Varsayilan" port="0"&amp;gt;
                    &amp;lt;security mode="None" /&amp;gt;
                    &amp;lt;resolver mode="Custom"&amp;gt;
                        &amp;lt;custom address = "net.tcp://localhost:4500/IRCResolver" binding="netTcpBinding" bindingConfiguration="ResolverBindingConfig" /&amp;gt;
                    &amp;lt;/resolver&amp;gt;
                &amp;lt;/binding&amp;gt;
            &amp;lt;/netPeerTcpBinding&amp;gt;
            &amp;lt;netTcpBinding&amp;gt;
                &amp;lt;binding name="ResolverBindingConfig"&amp;gt;
                    &amp;lt;security mode="None"/&amp;gt;
                &amp;lt;/binding&amp;gt;
            &amp;lt;/netTcpBinding&amp;gt;
        &amp;lt;/bindings&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Konfigurasyon dosyasında dikkat edilmesi gereken en &amp;ouml;nemli noktalardan birisi &lt;strong&gt;netPeerTcpBinding&lt;/strong&gt; elementi i&amp;ccedil;erisinde yer alan resolver boğumudur. Bu boğum i&amp;ccedil;erisinde &lt;strong&gt; mode&lt;/strong&gt; &lt;strong&gt;niteliğine(attribute) &lt;/strong&gt;verilen &lt;strong&gt;Custom&lt;/strong&gt; değeri ile &amp;ouml;zel bir peer &amp;ccedil;&amp;ouml;z&amp;uuml;c&amp;uuml; servisinin kullanılacağı ifade edilmektedir. Diğer tarafan s&amp;ouml;z konusu &amp;ouml;zel peer &amp;ccedil;&amp;ouml;z&amp;uuml;c&amp;uuml; servisin hangi adres &amp;uuml;zerinden &lt;strong&gt; host&lt;/strong&gt; ediliği , hangi bağlayıcı tipin(Binding Type) kullanıldığı bilgileri ise &lt;strong&gt;custom&lt;/strong&gt; isimli elementin &lt;strong&gt;address&lt;/strong&gt; ve &lt;strong&gt;binding&lt;/strong&gt; niteliklerinde belirtilmektedir. Dikkat edilecek olursa &lt;strong&gt;address&lt;/strong&gt; niteliğinin değeri servis uygulamasının &lt;strong&gt;host&lt;/strong&gt; ettiği adrestir. &lt;strong&gt;client&lt;/strong&gt; elementi i&amp;ccedil;erisinde tanımlanan &lt;strong&gt;endpoint&lt;/strong&gt; boğumunda ise &lt;strong&gt;address&lt;/strong&gt; kısmında&lt;strong&gt; net.p2p://BizimIRC&lt;/strong&gt; adresi yer almaktadır. Bu adres Mesh ağının adresi olarakta d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Bir başka deyişle katılımcıların dahil olacağı Mesh ağının yolu tayin edilmektedir. Ayrıca bağlayıcı tip olarak &lt;strong&gt;netPeerTcpBinding&lt;/strong&gt; kullanılmaktadır. Geliştirilen &amp;ouml;rnek g&amp;uuml;venlik ile ilişkili olaraktan ek bir &amp;ouml;zellik i&amp;ccedil;ermemektedir. Bu nedenle &lt;strong&gt;security&lt;/strong&gt; elementlerinde yer alan &lt;strong&gt;mode&lt;/strong&gt; değerleri &lt;strong&gt; None&lt;/strong&gt; olarak bildirilmiştir. &lt;strong&gt;netPeerTcpBinding&lt;/strong&gt; elementinde yer alan &lt;strong&gt;port&lt;/strong&gt; niteliğinin değeri &lt;strong&gt;0&lt;/strong&gt; olduğu i&amp;ccedil;in, katılımcı uygulamalar &amp;ccedil;alıştıkları makinede boş buldukları bir port &amp;uuml;zerinden kanal oluşturacaklar ve Mesh ağına a&amp;ccedil;acaklardır. &lt;em&gt;(&lt;strong&gt;.Net Remoting&lt;/strong&gt; mimarisinde geliştirilen &amp;ouml;rneklerdede port değerine 0 verilmesi ile aynı anlamda olduğuna dikkat edelim.) &lt;/em&gt;Artık uygulamalar test edilebilir. Aşağıdaki Flash animasyonunda senaryoya ait sonu&amp;ccedil;lar irdelenmektedir. &lt;em&gt;(Flash Video boyutu 560 Kb olup y&amp;uuml;klenmesi sabır isteyebilir.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt; &lt;object id="obj1" width="465" height="625" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/mk252.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="465" height="625" src="http://www.buraksenyurt.com/makale/images/mk252.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj1" /&gt;
&lt;/object&gt; &lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi B isimli katılımcı Mesh ağına dahil olduktan sonra sistem online moda ge&amp;ccedil;miştir. Bununla birlikte Mesh ağına giren her kullanıcı bilgisi diğer bağlı PeerNode' larada anında iletilir. B&amp;ouml;ylece katılımcılar ağa dahil olan kullanıcıları g&amp;ouml;rebilmektedir. Katılımcıların g&amp;ouml;nderikleri mesajlar diğer t&amp;uuml;m katılımcıların ekranında anında g&amp;ouml;r&amp;uuml;lebilmektedir. Diğer taraftan ağdan ayrılan katılımcıların bilgileride diğerlerine iletilmektedir. Burada ilgi &amp;ccedil;ekici noktalardan biriside her katılımcı i&amp;ccedil;in ayrı Peer Node ID değerlerinin &amp;uuml;retilmesidir. Sistemin offline moda ge&amp;ccedil;mesi ise sadece bir katılımcı kalması durumunda meydana gelmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalemizde &lt;strong&gt;WCF&lt;/strong&gt; mimarisi &amp;uuml;zerinde &lt;strong&gt;P2P(Peer-to-Peer) &lt;/strong&gt;programlamaya giriş yapmaya &amp;ccedil;alıştık ve &amp;ouml;rnek olarak basit bir &lt;strong&gt;IRC&lt;/strong&gt; senaryosu geliştirdik. Senaryoda, var olan &lt;strong&gt;PNRP(Peer Name Resolution Protocol)&lt;/strong&gt; servisi yerine &lt;strong&gt;.Net Framework &lt;/strong&gt;ile birlikte gelen &lt;strong&gt; CustomPeerResolverService&lt;/strong&gt; sınıfını kullandık. İlerleyen makalelerimizde P2P tabanlı senaryolarda, geliştirici tarafından yazılmış &amp;ouml;zel bir peer &amp;ccedil;&amp;ouml;z&amp;uuml;mleyici servisin nasıl ele alınabileceğini ve g&amp;uuml;venliği nasıl sağlayabileceğimizi incelemeye &amp;ccedil;alışacağız. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;a href="/makale/images/PeerToPeerProgramming.rar"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;</content>
  <pubDate>2008-05-25 09:00:00</pubDate>
  <slug>WCF-P2P(Peer-to-peer)-Programlamaya-Giris-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>