<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF ile WF Entegrasyonu - 1</title>
  <description>Bilindiği üzere Window Communication Foundation ve Windows Workflow Foundation, .Net Framework 3.0 ile birlikte gelen önemli teknolojilerdendir. WCF servis yönelimli mimariye(Service Oriented Architecture) yeni bir yaklaşım getirip, dağıtık mimari uygulama geliştirme kavramlarını bir çatı altında toplayarak güçlü, daha platform bağımsız ve güvenilir bir ortamda geliştirme yapılabilmesini olanaklı kılan bir alt yapı sunmaktadır.</description>
  <content>&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Değerli Okurlarım Merhabalar,&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bilindiği &amp;uuml;zere &lt;strong&gt;Window Communication Foundation&lt;/strong&gt; ve &lt;strong&gt;Windows Workflow Foundation&lt;/strong&gt;, &lt;strong&gt;.Net Framework 3.0&lt;/strong&gt; ile birlikte gelen &amp;ouml;nemli teknolojilerdendir. WCF &lt;strong&gt;servis y&amp;ouml;nelimli mimariye(Service Oriented Architecture)&lt;/strong&gt; yeni bir yaklaşım getirip, dağıtık mimari uygulama geliştirme kavramlarını bir &amp;ccedil;atı altında toplayarak g&amp;uuml;&amp;ccedil;l&amp;uuml;, daha platform bağımsız ve g&amp;uuml;venilir bir ortamda geliştirme yapılabilmesini olanaklı kılan bir alt yapı sunmaktadır. WF ise, birden fazla adımdan oluşan kod s&amp;uuml;re&amp;ccedil;lerinin &lt;strong&gt;iş akışı(Workflow)&lt;/strong&gt; tarzında &lt;strong&gt;olay g&amp;uuml;d&amp;uuml;ml&amp;uuml;(Event-Driven)&lt;/strong&gt; yada &lt;strong&gt; sırasal (Sequential)&lt;/strong&gt; olacak şekilde tasarlanarak &amp;ccedil;eşitli .Net uygulamalarında kullanılabilmelerini m&amp;uuml;mk&amp;uuml;n kılan bir alt yapı tesit etmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Workflow&lt;/strong&gt;, s&amp;uuml;re&amp;ccedil;lere ait akışların hazırlanmasında ağırlıklı olarak &lt;strong&gt;aktivite&lt;/strong&gt; &lt;strong&gt;tiplerini(Activity Types)&lt;/strong&gt; kullanmaktadır. Bu aktivitelerin dallara ayrılması, &amp;ccedil;atallanması, birbirlerine katılması gibi pek &amp;ccedil;ok işlem de, Workflow ortamı tarafından sunulmaktadır. WF ile geliştirilen iş akışları kısa s&amp;uuml;receği gibi uzunda&lt;strong&gt;(Long-Running Workflows)&lt;/strong&gt; s&amp;uuml;rebilir. Bu nedenle WF ortamı &amp;ouml;zellikle uzun s&amp;uuml;ren akışların, &lt;strong&gt;sistem yeniden başlatmaları(reboot)&lt;/strong&gt; gibi vakalara karşı ayakta durabilmesi i&amp;ccedil;in kalıcı olarak saklama işlemlerine destek de vermektedir. WF mimarisinin yetenekleri sadece bununlada sınırlı değildir. &amp;Ouml;rneğin Transaction desteği diğer yetenekleri arasında g&amp;ouml;sterilebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Windows Workflow Foundation ile Windows Communication Foundation arasındaki entegrasyon ger&amp;ccedil;ek anlamda .Net Framework 3.5 ve Visual Studio 2008 ile birlikte sağlanmıştır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;WF aslında, &lt;strong&gt;.Net Framework 3.5&lt;/strong&gt; ve &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; ile gelen yenilikler sayesinde &lt;strong&gt;WCF&lt;/strong&gt; ortamının ger&amp;ccedil;ek anlamda bir &lt;strong&gt;tamamlayıcısı&lt;/strong&gt; teknoloji olarak g&amp;ouml;r&amp;uuml;lmektedir. Bu anlamda WF uygulamaları i&amp;ccedil;erisinden WCF servislerinin &amp;ccedil;ağırılması ve kod akışının ilgili &lt;strong&gt;servis noktaları(Service EndPoint) &lt;/strong&gt;&amp;uuml;zerinden y&amp;uuml;r&amp;uuml;t&amp;uuml;lmesi sağlanabilmektedir. Tam tersine WF i&amp;ccedil;erisindende servis yayınlaması yapılabilmektedir. Bu entegrasyon sayesinde s&amp;uuml;re&amp;ccedil;lerin istemcilere &lt;strong&gt;g&amp;uuml;&amp;ccedil;l&amp;uuml;(Robust), g&amp;uuml;venilir(Reliable)&lt;/strong&gt; ve &lt;strong&gt;g&amp;uuml;venli(Secure)&lt;/strong&gt; bir şekilde sunulmasıda sağlanmaktadır. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ouml;yleki bu entegrasyonun doğal sonucu olarak iş mantığının(Logic) farklı formatlarda&lt;em&gt;&lt;strong&gt;(MTOM, SOAP, Binary, JSON, X509 vb...) &lt;/strong&gt;&lt;/em&gt; dolaşımı, &lt;strong&gt;IIS(Internet Information Services), WAS(Windows Activation Service) ve Windows Service&lt;/strong&gt; gibi ortamlar &amp;uuml;zerinden &lt;strong&gt;host&lt;/strong&gt; edilme imkanı gibi pek &amp;ccedil;ok fonksiyonellik ele alınabilmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;WCF&lt;/strong&gt; ile &lt;strong&gt;WF&lt;/strong&gt; entegrasyonu sırasında servis ile olan etkileşimin modellenebilmesi i&amp;ccedil;in &lt;strong&gt;Send, Receive&lt;/strong&gt; gibi aktivitelerden yararlanılmaktadır. &lt;strong&gt;Send&lt;/strong&gt; aktivitesi sayesinde &lt;strong&gt;WF&lt;/strong&gt; i&amp;ccedil;erisinden &lt;strong&gt;bir&lt;/strong&gt; &lt;strong&gt;WCF&lt;/strong&gt; &lt;strong&gt; servisine mesaj g&amp;ouml;nd&lt;/strong&gt;erilmesi sağlanabilir ki bu noktada &lt;strong&gt;Proxy&lt;/strong&gt; nesneleride devreye girmektedir. Diğer taraftan &lt;strong&gt;Receive&lt;/strong&gt; aktivitesi sayesinde &lt;strong&gt;workflow&lt;/strong&gt;' un kendisinin &lt;strong&gt;bir servis gibi sunulabilmesi&lt;/strong&gt; olanaklı hale gelmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p style="text-align: left;"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;SendActivity ve ReceiveActivity tipleri .Net Framework 3.5 ile birlikte gelmiştir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img style="float: left;" src="/makale/images/mk249_5.gif" alt="" width="208" height="144" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;nbsp;Aktivasyon alt yapısının host edilmesi i&amp;ccedil;inse &lt;strong&gt;ServiceHostBase abstract&lt;/strong&gt; sınıfından t&amp;uuml;reyen ve &lt;strong&gt; .Net Framework 3.5&lt;/strong&gt; ile birlikte gelen &lt;strong&gt;WorkflowServiceHost&lt;/strong&gt; tipinden yararlanılmaktadır. Servis ve istemci arasındaki &amp;ouml;nemli konulardan biriside korelasyonun sağlanmasıdır. Bu bir anlamda istemcinin doğru servis &amp;ouml;rneği ile iletişime ge&amp;ccedil;ebilmesi demektir ki bunun sağlanabilmesi i&amp;ccedil;in eklenmiş olan yeni &lt;strong&gt;davranış(Behavior) &lt;/strong&gt; ve &lt;strong&gt;bağlayıcılar(Bindings)&lt;/strong&gt; s&amp;ouml;z konusudur. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu teorik bilgilerden sonra &amp;ouml;rnekler ile devam edelim. İlk olarak &lt;strong&gt;bir WF uygulaması i&amp;ccedil;erisinde bir WCF servisinin nasıl &amp;ccedil;ağırılabileceğini &lt;/strong&gt;incelemeye &amp;ccedil;alışacağız. WF i&amp;ccedil;erisinden bir WCF servis noktasına ulaşmak i&amp;ccedil;in &lt;strong&gt;SendActivity, InvokeWebServiceActivity, CodeActivity&lt;/strong&gt; aktivite tiplerinden yararlanılabilir. Bunlardan en g&amp;uuml;&amp;ccedil;l&amp;uuml; olanı SendActivity dir. &lt;strong&gt; InvokeWebServiceActivity&lt;/strong&gt; &lt;strong&gt;Web&lt;/strong&gt; &lt;strong&gt;servislerinin&lt;/strong&gt; &lt;strong&gt;proxy&lt;/strong&gt; sınıfı aracılığıyla &amp;ccedil;ağırılmasını sağlamaktadır. WCF tarafından &lt;strong&gt;asmx&lt;/strong&gt; modeline uygun yayınlama yapılabildiğinden bu aktivite tipide tercih edilebilir. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Nevarki &lt;strong&gt;SendActivity&lt;/strong&gt; tipine g&amp;ouml;re herhangibir &amp;uuml;st&amp;uuml;nl&amp;uuml;ğ&amp;uuml; bulunmamaktadır. &lt;strong&gt;SendActivity&lt;/strong&gt; WCF servisi ile &lt;strong&gt; senkron(synchronous)&lt;/strong&gt; olarak haberleşilmesini sağlar ve &lt;strong&gt;tek y&amp;ouml;nl&amp;uuml;(One-Way), talep-cevap(Request-Response), talep-hata(Request-Fault)&lt;/strong&gt; desenlerini ele alır. Tek y&amp;ouml;nl&amp;uuml; desene g&amp;ouml;re servise talepte bulunulduktan sonra bir cevap beklenmez. Talep-Cevap desenine g&amp;ouml;re ise servisten yapılan isteğe bir sonu&amp;ccedil; gelinceye kadar beklenir(Synchronous). Son desene g&amp;ouml;re ise ya cevap gelir yada &lt;strong&gt;hata mesajı(Fault Message)&lt;/strong&gt;. Bunların dışında &lt;strong&gt;&amp;ouml;zel aktiviteler(Custom Activity)&lt;/strong&gt; yazılarak iş mantığının s&amp;ouml;z konusu aktivite tip i&amp;ccedil;erisine g&amp;ouml;m&amp;uuml;lmesi ve servisin ele alınmasıda sağlanabilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Elbette ilk olarak bir servis k&amp;uuml;t&amp;uuml;phanesinin(WCF Service Library) ve host uygulamanın tasarlanması gerekmektedir. &amp;Ouml;rnekte kullanılacak olan servis k&amp;uuml;t&amp;uuml;phanesinin i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk249_1.gif" alt="" width="266" height="404" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;Product sınıfı;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[DataContract]
public class Product
{
    [DataMember]
    public int ProductId { get; set; }
    [DataMember]
    public string Name { get; set; }
    [DataMember]
    public double ListPrice { get; set; }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Product&lt;/strong&gt; sınıfı &lt;strong&gt; Production.Product&lt;/strong&gt; tablosundaki herhangibir satıra ait &lt;strong&gt;ProductID&lt;/strong&gt;,&lt;strong&gt;Name&lt;/strong&gt; ve &lt;strong&gt;ListPrice&lt;/strong&gt; bilgilerini taşımak &amp;uuml;zere tasarlanmış ve bu sebepten bir &lt;strong&gt;veri s&amp;ouml;zleşmesi(DataContract)&lt;/strong&gt; olacak şekilde tanımlanmıştır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;IProductManager aray&amp;uuml;z&amp;uuml;(Interface);&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[ServiceContract(Name="Urun Servisi",Namespace="http://www.bsenyurt.com/UrunServisi")]
public interface IProductManager
{
    [OperationContract]
    Product GetProduct(int productId);
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Servis s&amp;ouml;zleşmesi(Service Contract)&lt;/strong&gt; Product tipinden nesne &amp;ouml;rnekleri d&amp;ouml;nd&amp;uuml;ren tek bir operasyon tanımı i&amp;ccedil;ermektedir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;ProductManager sınıfı;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class ProductManager
            : IProductManager
{
    #region IProductManager Members

    public Product GetProduct(int productId)
    {
        Product prd = null;
        using (SqlConnection conn = new SqlConnection("data source=.;database=AdventureWorks;integrated security=SSPI"))
        {
            SqlCommand cmd = new SqlCommand("Select ProductId,Name,ListPrice From Production.Product Where ProductId=@PrdId", conn);
            cmd.Parameters.AddWithValue("@PrdId", productId);
            conn.Open();
            SqlDataReader reader = cmd.ExecuteReader();
            if (reader.Read())
                prd = new Product { ProductId = Convert.ToInt32(reader["ProductId"]), Name = reader["Name"].ToString(), ListPrice = Convert.ToDouble(reader["ListPrice"]) };
            reader.Close();
        }
        return prd;
    }

    #endregion
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;ProductManager&lt;/strong&gt; sınıfında yazılan &lt;strong&gt;GetProduct&lt;/strong&gt; metodu, parametre olarak gelen değere g&amp;ouml;re &lt;strong&gt; Production&lt;/strong&gt;.&lt;strong&gt;Product&lt;/strong&gt; tablosundan bir satır verisini &amp;ccedil;ekmektedir. Eğer parametre olarak gelen id değerine bağlı bir satır varsa &lt;strong&gt;ProductId&lt;/strong&gt;,&lt;strong&gt;Name&lt;/strong&gt;,&lt;strong&gt;ListPrice&lt;/strong&gt; değerlerinin toplandığı &lt;strong&gt;Product&lt;/strong&gt; nesne &amp;ouml;rneği geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmektedir. Sınıf k&amp;uuml;t&amp;uuml;phanesinin tanımlanmasından sonra host servis uygulamasının yazılması gerekmektedir. &amp;Ouml;rnekte Host, basit bir Console uygulaması olacak şekilde aşağıdaki gibi tasarlanmıştır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;Program sınıfı i&amp;ccedil;eriği;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using ProductServices;

namespace Sunucu
{
    class Program
    {
        static void Main(string[] args)
        {
            ServiceHost host = new ServiceHost(typeof(ProductManager));
            host.Open();
            Console.WriteLine("Sunucu dinlemede...");
            Console.ReadLine();
            host.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;App.config i&amp;ccedil;eriği;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;behaviors&amp;gt;
            &amp;lt;serviceBehaviors&amp;gt;
                &amp;lt;behavior name="UrunServisiBehavior"&amp;gt;
                    &amp;lt;serviceMetadata/&amp;gt;
                &amp;lt;/behavior&amp;gt;
            &amp;lt;/serviceBehaviors&amp;gt;
        &amp;lt;/behaviors&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service behaviorConfiguration="UrunServisiBehavior" name="ProductServices.ProductManager"&amp;gt;
                &amp;lt;endpoint address="" binding="netTcpBinding" bindingConfiguration="" name="UrunServisiTcpEndPoint" contract="ProductServices.IProductManager" /&amp;gt;
                &amp;lt;endpoint address="mex" binding="mexTcpBinding" name="UrunServisiMexEndPoint" contract="IMetadataExchange" /&amp;gt;
                &amp;lt;host&amp;gt;
                    &amp;lt;baseAddresses&amp;gt;
                        &amp;lt;add baseAddress="net.tcp://localhost:9001/UrunServisi" /&amp;gt;
                    &amp;lt;/baseAddresses&amp;gt;
                &amp;lt;/host&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;İlerlemeden &amp;ouml;nce &lt;strong&gt;App.config&lt;/strong&gt; dosyası i&amp;ccedil;eriğinin incelenmesinde yarar vardır. Servis uygulaması iki adet &lt;strong&gt;EndPoint&lt;/strong&gt; sunmaktadır. &lt;strong&gt;UrunServisiTcpEndPoint&lt;/strong&gt; isimli servis noktası TCP&lt;em&gt;(netTcpBinding bağlayıcısını kullandığına dikkat edelim)&lt;/em&gt; bazlı olacak şekilde bir yayınlama yapmaktadır. &lt;strong&gt;address&lt;/strong&gt; bilgisi verilmemiş olmasına rağmen &lt;strong&gt;host&lt;/strong&gt; elementi i&amp;ccedil;erisinde tanımlanan &lt;strong&gt;baseAdress&lt;/strong&gt; bilgisi kullanılmaktadır. Diğer EndPoint ise &lt;strong&gt;IMetadaExchange&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; servis s&amp;ouml;zleşmesi olarak kullanan ve &lt;strong&gt;mexTcpBinding&lt;/strong&gt; bağlayıcısını baz alarak &lt;strong&gt;mex&lt;/strong&gt; isimli bir adres &amp;uuml;zerinden yayınlama yapan bir servis noktası sunmaktadır.&lt;/p&gt;
&lt;p&gt;Bu EndPoint sayesinde baseAddress elementi ile bildirilen &lt;strong&gt;TCP&lt;/strong&gt; adresi &amp;uuml;zerinden &lt;strong&gt;Metadata Exchange&lt;/strong&gt; işlemi ger&amp;ccedil;ekleştirilebilir. Bir başka deyişle &amp;ccedil;alışmakta olan servis uygulamasına bağlı adres &amp;uuml;zerinden &lt;strong&gt;proxy&lt;/strong&gt; nesnesi &amp;uuml;retimi ger&amp;ccedil;ekleştirilebilir. &amp;Ouml;nemli olan noktalardan biriside proxy &amp;uuml;retiminin sağlanmasıdır. Bu nedenle servise metadata yayınlaması i&amp;ccedil;in bir &lt;strong&gt;servis davranışı(Service Behavior)&lt;/strong&gt; eklenmiştir. B&amp;ouml;ylece servis operasyonlar servis dışına sunulabilir hale gelmiştir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;WF uygulaması, dışarıdan bir WCF servisini &amp;ccedil;ağırmak i&amp;ccedil;in proxy nesnesinden yararlanmaktadır. Bu proxy nesnesi Visual Studio 2008 ortamında Add Service Reference ile kolay bir şekilde eklenebileceği gibi svcutil aracı yardımıylada aşağıdaki şekilde olduğu gibi &amp;ccedil;ekilebilirde.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk249_2.gif" alt="" width="562" height="245" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Hangisi tercih edilirise edilsin &amp;ouml;rneğe g&amp;ouml;re servis uygulamasının &amp;ccedil;alışır durumda olması gerekmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Artık WF uygulamasının yazılmasına başlanabilir. &amp;Ouml;rnekte &lt;strong&gt;Sequential Workflow Console Application&lt;/strong&gt; şablonu kullanılmaktadır. Proje a&amp;ccedil;ıldıktan sonra servis uygulamasının &amp;ccedil;alışıyor olmasına dikkat edereken, &lt;strong&gt;Add Service Reference&lt;/strong&gt; se&amp;ccedil;eneği ile proxy sınıfının &amp;uuml;retilmesi ve WF uygulamasına eklenmesi sağlanabilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk249_3.gif" alt="" width="535" height="436" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu işlemin arkasından WF uygulaması i&amp;ccedil;erisinde aşağıdaki gibi servisa ait bilgilerin indirildiği ve proxy sınıfının&lt;em&gt;(Reference.cs i&amp;ccedil;erisinde yer almaktadır)&lt;/em&gt; &amp;uuml;retildiği g&amp;ouml;r&amp;uuml;lebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk249_4.gif" alt="" width="367" height="176" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ouml;rnekte WF i&amp;ccedil;erisinden servisi &amp;ccedil;ağırmak i&amp;ccedil;in &lt;strong&gt;SendActivity&lt;/strong&gt; tipi kullanılacaktır. İlk olarak Workflow1 tasarım ortamına &lt;strong&gt;SendActivity&lt;/strong&gt; bileşeni s&amp;uuml;r&amp;uuml;klenmelidir. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk249_6.gif" alt="" width="464" height="265" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;SendActivity&lt;/strong&gt; bileşeninin &amp;ouml;nemli olan bazı &amp;uuml;yeleri vardır. Bunlardan &lt;strong&gt;ServiceOperationInfo&lt;/strong&gt; &amp;ouml;zelliği yardımıyla etkileşimde bulunulacak olan servisin ve ilgili operasyonunun se&amp;ccedil;ilmesi sağlanır. &lt;strong&gt;AfterResponse&lt;/strong&gt; alanının işaret ettiği olay sayesinde, servis tarafından cevap geldikten sonra işletilmesi istenen kodların icra edilmesi sağlanmaktadır. Benzer şekilde &lt;strong&gt;BeforeSend&lt;/strong&gt; alanının işaret ettiği olay sayesinde, servise mesaj g&amp;ouml;nderilmeden &amp;ouml;nce işletilmesi gereken bir kod mantığı var ise, bunun icra edilmesi sağlanmaktadır. İstenirse &amp;ouml;zel servis adresleri &lt;strong&gt;CustomAdress&lt;/strong&gt; &amp;ouml;zelliği ile tanımlanabilir. &amp;Ouml;rnekte ilk olarak &lt;strong&gt;ServiceOperationInfo&lt;/strong&gt; &amp;ouml;zelliğinden yararlanılarak kullanılacak operasyon se&amp;ccedil;ilmelidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk249_7.gif" alt="" width="634" height="618" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Import&lt;/strong&gt; d&amp;uuml;ğmesine basıldıktan sonra ekrana gelen ara birimde, projeye az &amp;ouml;nce referans edilmiş olan serviste g&amp;ouml;r&amp;uuml;lecektir&lt;em&gt;(ServiceReference1)&lt;/em&gt;. Bu işlemin hemen arkasından &lt;strong&gt;UrunServisi&lt;/strong&gt; tipine &amp;ccedil;ift tıklanırsa aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; elde edilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk249_8.gif" alt="" width="493" height="500" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi servise ait &lt;strong&gt; GetProduct&lt;/strong&gt; operasyonu eklenmiştir. &lt;strong&gt;Parameters&lt;/strong&gt; kısmında, operasyonun aldığı ve geri d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml; değişkenlere ait bir takım bilgiler yer almaktadır. Buna operasyon productId isimli Int32 tipinden bir parametre almakta ve Product tipinden bir sonu&amp;ccedil; d&amp;ouml;nd&amp;uuml;rmektedir. &lt;strong&gt; OK&lt;/strong&gt; d&amp;uuml;ğmesine basıldıktan sonra &lt;strong&gt;Parameters&lt;/strong&gt; kısmında yer alan değişkenlerin &lt;strong&gt;Properties&lt;/strong&gt; penceresine birer &amp;ouml;zellik olaraktan eklendiği izlenebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk249_9.gif" alt="" width="276" height="246" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu &amp;ouml;zelliklerin yanında yer alan &amp;uuml;&amp;ccedil; nokta d&amp;uuml;ğmelerine basıldığında, ilgili alanların servis operasyonuna bağlanması i&amp;ccedil;in gerekli &lt;strong&gt;&amp;ouml;zellik/alan(Property/Field)&lt;/strong&gt; tanımlamalarının yapılacağı bir ekran ile karşılaşılır. Bu ekrandan yararlanılarak &lt;strong&gt;Workflow&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde yazılmış var olan &amp;ouml;zelliklere/alanlara bağlama yapılabileceği gibi &lt;strong&gt;Bind to a new member&lt;/strong&gt; sekmesinden faydalanılarak yeni &amp;ouml;zelliklerin anında oluşturulmasıda sağlanabilir. &amp;Ouml;rneğin &lt;strong&gt;ReturnValue&lt;/strong&gt; &amp;ouml;zelliği i&amp;ccedil;in aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan se&amp;ccedil;imler kullanılmış ve anında &lt;strong&gt; sendActivity1_ReturnValue1&lt;/strong&gt; isimli bir &amp;uuml;yenin oluşturulması sağlanmıştır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk249_10.gif" alt="" width="510" height="260" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Aynı işlem &lt;strong&gt;productId&lt;/strong&gt; isimli aktivite &amp;ouml;zelliği i&amp;ccedil;inde yapılmalıdır. Bu işlemlerin ardından Workflow1 sınıfı i&amp;ccedil;erisine DependencyProperty tipinden iki yeni &amp;ouml;zelliğin aşağıdaki gibi eklendiği g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace WfdenServis
{
    public sealed partial class Workflow1: SequentialWorkflowActivity
    {
        public Workflow1()
        {
            InitializeComponent();
        }

        public static DependencyProperty sendActivity1__ReturnValue_1Property = DependencyProperty.Register("sendActivity1__ReturnValue_1", typeof(WfdenServis.ServiceReference1.Product), typeof(WfdenServis.Workflow1));

        [DesignerSerializationVisibilityAttribute(DesignerSerializationVisibility.Visible)]
        [BrowsableAttribute(true)]
        [CategoryAttribute("Parameters")]
        public WfdenServis.ServiceReference1.Product sendActivity1__ReturnValue_1
        {
            get
            {
                return ((WfdenServis.ServiceReference1.Product)(base.GetValue(WfdenServis.Workflow1.sendActivity1__ReturnValue_1Property)));
            }
            set
            {
                base.SetValue(WfdenServis.Workflow1.sendActivity1__ReturnValue_1Property, value);
            }
        }

        public static DependencyProperty sendActivity1_productId1Property = DependencyProperty.Register("sendActivity1_productId1", typeof(System.Int32), typeof(WfdenServis.Workflow1));

        [DesignerSerializationVisibilityAttribute(DesignerSerializationVisibility.Visible)]
        [BrowsableAttribute(true)]
        [CategoryAttribute("Parameters")]
        public Int32 sendActivity1_productId1
        {
            get
            {
                return ((int)(base.GetValue(WfdenServis.Workflow1.sendActivity1_productId1Property)));
            }
            set
            {
                base.SetValue(WfdenServis.Workflow1.sendActivity1_productId1Property, value);
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Son olarak SendActivity bileşeninin &lt;strong&gt; ChannelToken&lt;/strong&gt; &amp;ouml;zelliği ayarlanarak &lt;strong&gt;EndPoint&lt;/strong&gt; bilgilerinin verilmesi ve WF' in hangi servis ile nasıl mesajlaşacağının ele alınması gerekmektedir. Bu bilgiler &amp;ccedil;ok doğal olarak &lt;strong&gt;Add Service Reference&lt;/strong&gt; işlemi sonrası gelen &lt;strong&gt;App.config&lt;/strong&gt; dosyası i&amp;ccedil;erisinde yer almaktadır. Bu ama&amp;ccedil;la&lt;strong&gt; ChannelToken&lt;/strong&gt; &amp;ouml;zelliğine bir isim verildikten sonra gelecek olan &lt;strong&gt;EndpointName&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt; App.config &lt;/strong&gt;dosyası i&amp;ccedil;erisindeki ilgili servis noktasının adı yazılmalıdır. Sonrasında ise &lt;strong&gt;ChannelToken&lt;/strong&gt; nesnesinin kapsamı(Scope) belirlenir. Bu kapsam &lt;strong&gt;OwnerActivityName&lt;/strong&gt; &amp;ouml;zelliği yardımıyla set edilmektedir. &amp;Ouml;rnekte s&amp;ouml;z konusu &amp;ouml;zellikler aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi belirlenebilir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk249_11.gif" alt="" width="492" height="281" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Artık test işlemleri başlatılabilir. &lt;strong&gt; Console&lt;/strong&gt; formatında bir &lt;strong&gt;Workflow&lt;/strong&gt; uygulaması geliştirildiğinden &lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisinde gerekli parametre tanımlama ve sonu&amp;ccedil; alma işlemleri kolaylıkla ger&amp;ccedil;ekleştirilebilir. Bu ama&amp;ccedil;la &lt;strong&gt;Main&lt;/strong&gt; metodu aşağıdaki gibi genişletilebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading;
using System.Workflow.Runtime;
using System.Workflow.Runtime.Hosting;
using WfdenServis.ServiceReference1;

namespace WfdenServis
{
    class Program
    {
        static void Main(string[] args)
        {
            using(WorkflowRuntime workflowRuntime = new WorkflowRuntime())
            {
                AutoResetEvent waitHandle = new AutoResetEvent(false);
                workflowRuntime.WorkflowCompleted += delegate(object sender, WorkflowCompletedEventArgs e) 
                    { 
                        waitHandle.Set();
                        Product result = e.OutputParameters["sendActivity1__ReturnValue_1"] as Product;
                        if(result!=null)
                            Console.WriteLine("{0} : {1} {2}", result.ProductId.ToString(), result.Name, result.ListPrice.ToString("C2"));
                        else
                            Console.WriteLine("&amp;Uuml;r&amp;uuml;n bulunamadı");
                    };

                workflowRuntime.WorkflowTerminated += delegate(object sender, WorkflowTerminatedEventArgs e)
                    {
                        Console.WriteLine(e.Exception.Message);
                        waitHandle.Set();
                    };

                    Dictionary&amp;lt;string, object&amp;gt; parametreler = new Dictionary&amp;lt;string, object&amp;gt;() { { "sendActivity1_productId1", 680 } };
                    WorkflowInstance instance = workflowRuntime.CreateWorkflow(typeof(WfdenServis.Workflow1),parametreler);
    
                    instance.Start();
        
                    waitHandle.WaitOne();
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bilindiği gibi &lt;strong&gt;WorkflowInstance&lt;/strong&gt; nesne &amp;ouml;rneği oluşturulurken &lt;strong&gt;Dictionary&amp;lt;string,object&amp;gt;&lt;/strong&gt; tipinden olan ikinci parametre ile iş akışı i&amp;ccedil;erisindeki &amp;ouml;zelliklere değer aktarımı ger&amp;ccedil;ekleştirilebilmektedir. Bu sebepten &amp;ouml;rnekte &lt;strong&gt;parametreler&lt;/strong&gt; isimli &lt;strong&gt;Dictionary&amp;lt;string,object&amp;gt;&lt;/strong&gt; tipinden bir koleksiyon tanımlanmış ve &lt;strong&gt;sendActivity1_productId1&lt;/strong&gt; ismi ile &lt;strong&gt;680&lt;/strong&gt; değeri verilmiştir. &lt;strong&gt;sendActivity1_productId1&lt;/strong&gt; isimli &amp;ouml;zellik hatırlanacağı gibi &lt;strong&gt;SendActivity&lt;/strong&gt; bileşeninin bir par&amp;ccedil;asıdır ve &lt;strong&gt; GetProduct&lt;/strong&gt; metodunun aldığı &lt;strong&gt;productId&lt;/strong&gt; alanına eş d&amp;uuml;şmektedir. Bu sayede servis tarafındaki ilgili operasyona parametre g&amp;ouml;nderimi ger&amp;ccedil;ekleştirilmektedir. Servis tarafındaki işlemler sonlandığında tasarlanan iş akışına g&amp;ouml;re otomatik olarak &lt;strong&gt;WorkflowCompleted&lt;/strong&gt; olayı tetiklenmektedir.&lt;/p&gt;
&lt;p&gt;Bu olayın &lt;strong&gt;WorkflowCompletedEventArgs&lt;/strong&gt; tipinden olan e parametresine ait &lt;strong&gt;OutputParameters&lt;/strong&gt; &amp;ouml;zelliğinin işaret ettiği koleksiyon, iş akışına ait t&amp;uuml;m &amp;ouml;zelliklere ulaşılabilmesini sağlamaktadır ki bunlardan biriside &lt;strong&gt;GetProduct&lt;/strong&gt; isimli servis metodunun d&amp;ouml;n&amp;uuml;ş değerini işaret eden ve &lt;strong&gt;SendActivity&lt;/strong&gt; bileşenine ait olan &lt;strong&gt;sendActivity1_ReturnValue_1&lt;/strong&gt; isimli &lt;strong&gt; anahtardır(key)&lt;/strong&gt;. Bu anahtarın sonucu &lt;strong&gt;Product&lt;/strong&gt; tipinden olacağı i&amp;ccedil;in &lt;strong&gt;as&lt;/strong&gt; anahtar kelimesi ile bir d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi yapılmakta ve sonu&amp;ccedil; &lt;strong&gt;null&lt;/strong&gt; değilse elde edilen değişkene ait bilgiler ekrana yazdırılmaktadır. Uygulamanın test edilebilmesi i&amp;ccedil;in &lt;strong&gt;&amp;ouml;ncelikli olarak servis tarafının &amp;ccedil;alışıyor olması&lt;/strong&gt; gerekmektedir. Buna g&amp;ouml;re iş akışı uygulamasının &lt;strong&gt;680&lt;/strong&gt; &lt;strong&gt;productId&lt;/strong&gt; değeri i&amp;ccedil;in vereceği &amp;ccedil;ıktı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk249_12.gif" alt="" width="334" height="52" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Elbette tasarlanan akışın tipine bağlı olaraktan, servise ait operasyonların adımların arasında herhangibir yerde tetiklenmesi ve arkasından sonu&amp;ccedil;ların alınması i&amp;ccedil;in başka aktivitelerin(&amp;ouml;rneğin CodeActivity) iş akışına eklenmeside s&amp;ouml;z konusudur. S&amp;ouml;z gelimi yazılan son &amp;ouml;rnekte ek bir CodeActivity bileşeni kullanılabilir. Bunun i&amp;ccedil;in tasarım zamanında aşağıdaki gibi bir &lt;strong&gt; CodeActivity&lt;/strong&gt; bileşeni eklendiğini ve &lt;strong&gt;ExecuteCode&lt;/strong&gt; &amp;ouml;zelliğindede &lt;strong&gt;UrunuGetir&lt;/strong&gt; isimli bir metod bildirimi yapıldığını varsayalım.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk249_13.gif" alt="" width="563" height="315" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Buna g&amp;ouml;re &lt;strong&gt;UrunuGetir&lt;/strong&gt; metodunun i&amp;ccedil;eriği aşağıdaki gibi tasarlanıp &lt;strong&gt;SendActivity&lt;/strong&gt; &amp;ccedil;ağrısından sonra &lt;strong&gt;GetProduct&lt;/strong&gt; operasyonunun sonu&amp;ccedil;larının alınması sağlanabilir. &lt;em&gt; (Burada &lt;strong&gt;sendActivity1_ReturnValue_1&lt;/strong&gt; değerine &amp;ouml;zelliğine doğrudan erişilmesi son derece doğaldır nitekim metodun tanımlandığı yer &lt;strong&gt; Workflow1&lt;/strong&gt; sınıfının i&amp;ccedil;idir.)&lt;/em&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void UrunuGetir(object sender, EventArgs e)
{
    WfdenServis.ServiceReference1.Product prd = sendActivity1__ReturnValue_1 as WfdenServis.ServiceReference1.Product;
    Console.WriteLine(prd.Name + " " + prd.ListPrice.ToString("C2"));
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;SendActivity&lt;/strong&gt; bileşeni sayesinde bir iş akışı nesnesi i&amp;ccedil;erisinden &lt;strong&gt;WCF&lt;/strong&gt; tabanlı servis &amp;ccedil;ağırılması, bu servisten sunulan operasyonların icra edilmesi, varsa operasyon sonu&amp;ccedil;larının alınması gibi aksiyonlar kolay bir şekilde ger&amp;ccedil;ekleştirilebilmektedir. Bu yazıda bir WCF servisinin, WF i&amp;ccedil;erisinden nasıl &amp;ccedil;ağırılabileceğinin temelleri &amp;uuml;zerinde durulmuş ve basit bir &amp;ouml;rnek adım adım işlenmeye &amp;ccedil;alışılmıştır. Bir sonraki makalede ise bir WF uygulamasının servis olarak nasıl sunulacağı konularına değinilmeye &amp;ccedil;alışılacaktır. B&amp;ouml;ylece geldik bir makalemizin daha sonunda. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;a href="/makale/images/WFileWCF.rar"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;</content>
  <pubDate>2008-04-17 12:00:00</pubDate>
  <slug>WCF-ile-WF-Entegrasyonu-1-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
    <tag>wf</tag>
    <tag>windows-workflow-foundation</tag>
  </tags>
  <categories>
    <category>WCF</category>
    <category>WF</category>
  </categories>
</post>