<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Klasik ASP Sayfasından REST Servis Çağırmak</title>
  <description>Özellikle kurumsal çözümler üreten/kullanan firmalarda görev alanların sıklıkla dahil olduğu vakalardan birisi de, eski ve yeni teknolojilerin iç içe kullanıldığı senaryolardır. Bazen geliştirilen ürünler yıllara varan yaşam döngüleri boyunca çalışmaya devam eder. Yenileme maliyetlerinin yüksek olması nedeniyle de tekrardan yazılmak yerine var olan yeni teknolojiler ile entegre edilmeye çalışılırlar.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2016/02/asprest_0.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle kurumsal &amp;ccedil;&amp;ouml;z&amp;uuml;mler &amp;uuml;reten/kullanan firmalarda g&amp;ouml;rev&amp;nbsp;alanların sıklıkla dahil olduğu vakalardan&amp;nbsp;birisi de, eski ve yeni teknolojilerin i&amp;ccedil; i&amp;ccedil;e kullanıldığı senaryolardır. Bazen geliştirilen &amp;uuml;r&amp;uuml;nler yıllara varan yaşam d&amp;ouml;ng&amp;uuml;leri boyunca &amp;ccedil;alışmaya devam eder. Yenileme maliyetlerinin y&amp;uuml;ksek olması nedeniyle de tekrardan yazılmak yerine var olan yeni teknolojiler ile entegre edilmeye &amp;ccedil;alışılırlar.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;İşte ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde yine bizim turuncu bankamızda buna benzer bir ihtiya&amp;ccedil; doğdu. Klasik &lt;strong&gt;ASP&lt;/strong&gt; ile yazılmış ve neredeyse 10 yaşından b&amp;uuml;y&amp;uuml;k olan bir &amp;uuml;r&amp;uuml;n&amp;uuml;n yeni nesil bir teknoloji ile entegre olması gerekti. S&amp;ouml;z konusu &lt;strong&gt;ASP&lt;/strong&gt; uygulaması bunca yıl &amp;ccedil;alıştığı i&amp;ccedil;in &amp;uuml;zerine eklenen kodlar sebebiyle tam bir &lt;a href="https://sourcemaking.com/antipatterns/lava-flow"&gt;Lawa-Flow AntiPattern&lt;/a&gt; oluşmasına da sebebiyet vermişti. &lt;em&gt;(İ&amp;ccedil;ine giren kayboluyor herhangibir yerine m&amp;uuml;dahale etmek ger&amp;ccedil;ekten y&amp;uuml;rek istiyordu)&lt;/em&gt; Ancak kullanıcı alışkanlıkları, yenileme maliyetleri ve kaynak sıkıntısı nedeniyle tekrardan yazılamıyordu. &amp;Uuml;r&amp;uuml;n&amp;uuml;n g&amp;uuml;ncel sıkıntısı ise i&amp;ccedil;erdiği &lt;strong&gt;C tabanlı API&lt;/strong&gt;'nin yeni nesil &lt;strong&gt;64bit&lt;/strong&gt; sunucularda &amp;ccedil;alışmamasıydı. İlgili k&amp;uuml;t&amp;uuml;phane yıllarca &amp;ouml;nce dış kaynak bir firma tarafından yazılmıştı. İlgili firmadan &amp;ccedil;&amp;ouml;z&amp;uuml;m i&amp;ccedil;in destek alınabilirdi. Şayet firma hala var olsaydı. Var olan C k&amp;uuml;t&amp;uuml;phanesi banka dışı kurum ile &lt;strong&gt;SNA&lt;/strong&gt; isimli eski bir&amp;nbsp;protokol &amp;uuml;zerinden haberleşme yapan fonksiyonellikler i&amp;ccedil;eriyordu. Ne var ki dış kurum yakın zamanda bu protokol&amp;uuml; terk edip TCP/IP tabanlı bir alt yapıya ge&amp;ccedil;eceğini duyurmuştu. Dolayısıyla C k&amp;uuml;t&amp;uuml;phanesinin değiştirilmesi &amp;ouml;ncelikli bir gereksinim haline gelmişti.&amp;nbsp;&lt;span style="line-height: 1.8;"&gt;&amp;Ccedil;&amp;ouml;z&amp;uuml;m olarak C k&amp;uuml;t&amp;uuml;phanesinin ger&amp;ccedil;ekleştirdiği bu haberleşmeyi &amp;uuml;stlenen &lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;REST&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; tipinden bir servisin devreye alınmasına karar verildi. Problem basitti;&amp;nbsp;&lt;strong&gt;.Net&lt;/strong&gt; ile geliştirilecek olan &lt;strong&gt;REST&lt;/strong&gt; servisin, &lt;strong&gt;HTTP POST/GET &lt;/strong&gt;gibi metodlar ile &amp;ccedil;alışacak&amp;nbsp;operasyonları klasik&amp;nbsp;&lt;strong&gt;ASP&lt;/strong&gt; sayfasından nasıl t&amp;uuml;ketilebilirdi? &lt;em&gt;(Senaryomuzu şekilsel olarak aşağıdaki gibi &amp;ouml;zetleyebiliriz. Aslında canlı halini g&amp;ouml;rseniz sarı kağıt &amp;uuml;zerinde kurşun kalemli olan bu &amp;ccedil;izim gayet renkli ve canlı duruyor)&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/02/asprest_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;REST Servisin Geliştirilmesi&lt;/h2&gt;
&lt;p&gt;Şimdi bu problemi nasıl &amp;ccedil;&amp;ouml;zebileceğimize bir bakalım. İlk olarak basit bir &lt;strong&gt;WCF REST&amp;nbsp;&lt;/strong&gt;servis geliştireceğiz. Burada &lt;strong&gt;Web API&lt;/strong&gt;, &lt;strong&gt;Service Stack&lt;/strong&gt; veya diğer &amp;ouml;zel bir &amp;ccedil;&amp;ouml;z&amp;uuml;m kullanabiliriz&lt;em&gt;(&lt;a href="/post/ruby-kod-parcaciklari-20-rest-servis-gelistirmek" target="_blank"&gt;İlgili servisi Ruby ile yazabiliriz &amp;ouml;rneğin&lt;/a&gt;)&lt;/em&gt; Sonu&amp;ccedil; itibariyle &lt;strong&gt;REST&lt;/strong&gt; tabanlı &amp;ccedil;alışan bir servise ihtiyacımız var. Ben basit olması a&amp;ccedil;ısından boş bir web uygulaması a&amp;ccedil;ıp i&amp;ccedil;erisine aşağıdaki servis i&amp;ccedil;eriğini eklemeyi tercih ettim.&lt;/p&gt;
&lt;p&gt;ICommonService isimli servis s&amp;ouml;zleşmemiz&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ServiceModel;
using System.ServiceModel.Web;

namespace ServiceSilo
{    
    [ServiceContract
    (Namespace="http://www.buraksenyurt.com/services/silo/common"
    ,Name="CommonOperation")
    ]
    public interface ICommonService
    {
        [OperationContract]
        [WebInvoke(
            Method="POST"
            ,ResponseFormat=WebMessageFormat.Xml
            ,RequestFormat=WebMessageFormat.Xml
            ,BodyStyle=WebMessageBodyStyle.Wrapped
            ,UriTemplate="doWork"
            )]
        string DoWork(string input);
    }
}&lt;/pre&gt;
&lt;p&gt;Servis s&amp;ouml;zleşmesinde &amp;ouml;nemli olan noktaların başında &lt;strong&gt;WebInvoke&lt;/strong&gt; &lt;strong&gt;niteliğinin&lt;em&gt;(attribute)&lt;/em&gt;&lt;/strong&gt; kullanımı gelir. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;POST&lt;/strong&gt; tipinden bir &lt;strong&gt;HTTP&lt;/strong&gt; metod bildirimi s&amp;ouml;z konusudur&lt;em&gt;(Tabii siz kendi denemelerinizde GET, PUT ve DELETE operasyonlarını da işin i&amp;ccedil;erisine katabilirsiniz)&lt;/em&gt; Operasyonumuzun adı &lt;strong&gt;doWork&lt;/strong&gt; olarak ifade edilmiştir. &lt;strong&gt;Request&lt;/strong&gt; ve &lt;strong&gt;Response&lt;/strong&gt;&amp;nbsp;mesaj formatları ise &lt;strong&gt;XML&lt;/strong&gt; şeklindedir. Klasik &lt;strong&gt;ASP&lt;/strong&gt; tarafında &lt;strong&gt;XML&lt;/strong&gt; ile daha rahat &amp;ccedil;alışabileceğimizi d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zden bu y&amp;ouml;nde bir tercih yaptığımızı belirtebilirim.&amp;nbsp;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Web uygulamasında REST bazlı servis &amp;ouml;zelliklerini kullanabilmek i&amp;ccedil;in projeye&amp;nbsp;System.ServiceModel.Web assembly' ının referans edilmesi gerekmektedir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;CommonService i&amp;ccedil;eriği&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace ServiceSilo
{
    public class CommonService 
        : ICommonService
    {
        public string DoWork(string input)
        {
            string result = string.Format("{0}-Incoming Messaage : {1}",DateTime.Now.ToLongTimeString(),input);
            return result;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;DoWork&lt;/strong&gt; metodu &amp;ouml;zel bir şey yapmıyor. Sadece gelen i&amp;ccedil;eriği alıp bir string değişkende&amp;nbsp;kullanarak geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;yor. Pek tabii ger&amp;ccedil;ek hayat senaryosunda &lt;strong&gt;Data Transfer Object&lt;/strong&gt; gibi &lt;strong&gt;request&lt;/strong&gt; ve &lt;strong&gt;response&lt;/strong&gt; formatları da kullanılabilir. Yani bir &lt;strong&gt;Entity&lt;/strong&gt; i&amp;ccedil;eriğinin&lt;em&gt;(&amp;ouml;rneğin bir Kategori tipinin parametre olarak ge&amp;ccedil;ilip buna bağlı &amp;uuml;r&amp;uuml;n listesinin d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi)&lt;/em&gt; parametre olarak ge&amp;ccedil;işmesi ve buna g&amp;ouml;re bir karmaşık tipin g&amp;ouml;nderilmesi s&amp;ouml;z konusu olabilir. Şu an i&amp;ccedil;in &amp;ouml;nemli&amp;nbsp;olan bu mesaj yapılarının klasik &lt;strong&gt;ASP&lt;/strong&gt; tarafında nasıl kullanıldığıdır.&lt;/p&gt;
&lt;p&gt;web.config&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0"?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.web&amp;gt;
      &amp;lt;compilation debug="true" targetFramework="4.5.1" /&amp;gt;
      &amp;lt;httpRuntime targetFramework="4.5.1" /&amp;gt;
    &amp;lt;/system.web&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
      &amp;lt;services&amp;gt;
        &amp;lt;service name="ServiceSilo.CommonService" behaviorConfiguration="RestBehavior"&amp;gt;
          &amp;lt;endpoint 
            address="" 
            binding="webHttpBinding" 
            contract="ServiceSilo.ICommonService" 
            behaviorConfiguration="web"/&amp;gt;
        &amp;lt;/service&amp;gt;
      &amp;lt;/services&amp;gt;
        &amp;lt;behaviors&amp;gt;
            &amp;lt;serviceBehaviors&amp;gt;
                &amp;lt;behavior name="RestBehavior"&amp;gt;
                    &amp;lt;serviceMetadata httpGetEnabled="true" httpsGetEnabled="true" /&amp;gt;
                    &amp;lt;serviceDebug includeExceptionDetailInFaults="true" /&amp;gt;
                &amp;lt;/behavior&amp;gt;
            &amp;lt;/serviceBehaviors&amp;gt;
          &amp;lt;endpointBehaviors&amp;gt;
            &amp;lt;behavior name="web"&amp;gt;
              &amp;lt;webHttp helpEnabled="true"/&amp;gt;
            &amp;lt;/behavior&amp;gt;
          &amp;lt;/endpointBehaviors&amp;gt;
        &amp;lt;/behaviors&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Servis uygulamasına ait konfigurasyon i&amp;ccedil;eriğinde dikkat edilmesi gerekenler&amp;nbsp;&lt;strong&gt;webHttp&lt;/strong&gt; &lt;strong&gt;endPoint&lt;/strong&gt; davranışının uygulanması ve &lt;strong&gt;webHttpBinding&lt;/strong&gt; &lt;strong&gt;Binding&lt;/strong&gt; tipinin kullanılmış olmasıdır. B&amp;ouml;ylece servis uygulamamız &lt;strong&gt;HTTP&lt;/strong&gt; &lt;strong&gt;Post&lt;/strong&gt;, &lt;strong&gt;Put&lt;/strong&gt;, &lt;strong&gt;Get&lt;/strong&gt; ve &lt;strong&gt;Delete&lt;/strong&gt; gibi metodlara cevap verebilecek &amp;ccedil;alışma ortamına kavuşmuş olacaktır. &amp;Ouml;rneği &lt;strong&gt;IIS&lt;/strong&gt; &amp;uuml;zerine &lt;strong&gt;publish&lt;/strong&gt; ettikten sonra aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer yardım i&amp;ccedil;eriklerine&amp;nbsp;erişebilmemiz gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/02/asprest_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Klasik ASP Sayfasının Geliştirilmesi&lt;/h2&gt;
&lt;p&gt;Senaryo gereği &lt;strong&gt;doWork&lt;/strong&gt; isimli metoda bir &lt;strong&gt;POST&lt;/strong&gt; &amp;ccedil;ağrısı ger&amp;ccedil;ekleştirmek istiyoruz. Bu nedenle &lt;strong&gt;ASP&lt;/strong&gt; tarafında &lt;strong&gt;XML&lt;/strong&gt; paketi şeklinde oluşturacağımız i&amp;ccedil;eriği g&amp;ouml;ndermenin yolunu bulmamız gerekiyor. Bunun i&amp;ccedil;in&amp;nbsp;&lt;strong&gt;MSXML2.ServerXMLHTTP&lt;/strong&gt; nesnesinden yararlanacağız. &amp;Ouml;rnek olarak aşağıdaki &lt;strong&gt;default.asp&lt;/strong&gt; i&amp;ccedil;eriğini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;
&amp;lt;head&amp;gt;
&amp;lt;title&amp;gt;REST Service Call Sample&amp;lt;/title&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body bgcolor="black" text="green"&amp;gt;
	&amp;lt;form method="post" action="default.asp"&amp;gt;
		Input : &amp;lt;input type="text" name="txtInput"/&amp;gt;
		&amp;lt;p/&amp;gt;
		&amp;lt;input type="submit" value="HTTP Post"/&amp;gt;
	&amp;lt;/form&amp;gt;
	&amp;lt;%
		Dim input
		input=Request.Form("txtInput")
		
		set xmlhttp = CreateObject("MSXML2.ServerXMLHTTP")    
		xmlhttp.open "POST", "http://localhost/ServiceSilo/CommonService.svc/doWork", false 
		xmlhttp.setRequestHeader "Content-Type", "text/xml"    
		xmlhttp.send "&amp;lt;string xmlns='http://schemas.microsoft.com/2003/10/Serialization/'&amp;gt;"&amp;amp;input&amp;amp;"&amp;lt;/string&amp;gt;"
		serviceResponse =  xmlhttp.responseText 
		httpResponse = xmlhttp.status 
		httpStatusText = xmlhttp.statustext
		set xmlhttp = nothing 
		
		Response.Write("HTTP Status : " &amp;amp; httpResponse &amp;amp; "&amp;lt;p/&amp;gt;")
		Response.Write("Response : " &amp;amp; httpStatusText&amp;amp; "&amp;lt;p/&amp;gt;")
		Response.Write("Response text : " &amp;amp; serviceResponse&amp;amp; "&amp;lt;p/&amp;gt;")
		
	%&amp;gt;
&amp;lt;/body&amp;gt;&lt;/pre&gt;
&lt;p&gt;Aslında &lt;strong&gt;ASP&amp;nbsp;&lt;/strong&gt;formu olduk&amp;ccedil;a basit. &lt;strong&gt;Submit&lt;/strong&gt; işlemi ger&amp;ccedil;ekleştirildiğinde yine kendi &amp;uuml;zerine d&amp;ouml;nen bir sayfa s&amp;ouml;z konusu. &lt;strong&gt;txtInput&lt;/strong&gt; i&amp;ccedil;eriği &lt;strong&gt;Request.Form&lt;/strong&gt; ile alındıktan sonraki kısım bizim i&amp;ccedil;in daha &amp;ouml;nemli. &lt;strong&gt;MSXML2.ServerXMLHTTP&lt;/strong&gt; nesnesi &amp;ouml;rneklendikten sonra &lt;strong&gt;open&lt;/strong&gt; metoduna &amp;uuml;&amp;ccedil;&amp;nbsp;parametre veriyoruz. İlki &lt;strong&gt;HTTP&lt;/strong&gt; metodunun tipi, ikincisi talebin g&amp;ouml;nderileceği adres&lt;em&gt;(ki sondaki doWork uzantısına dikkat edelim)&lt;/em&gt; sonuncusu ise işlemin asenkron olarak ger&amp;ccedil;ekleştirilip ger&amp;ccedil;ekleştirilmeyeceğidir. &lt;strong&gt;open&lt;/strong&gt; &amp;ccedil;ağrısı sonrası &lt;strong&gt;HTTP&lt;/strong&gt; &lt;strong&gt;Header&lt;/strong&gt; i&amp;ccedil;in &lt;strong&gt;i&amp;ccedil;erik tipi&lt;em&gt;(Content-Type)&lt;/em&gt;&lt;/strong&gt; belirlenir. Paketler &lt;strong&gt;XML&amp;nbsp;&lt;/strong&gt;formatında g&amp;ouml;nderilecektir. Nitekim servis tarafının kabul ettiği format budur&lt;em&gt;(WebInvoke niteliğini bir kontrol edin)&lt;/em&gt; İzleyen adımda &lt;strong&gt;send&lt;/strong&gt; metodu ile paket g&amp;ouml;nderimi ger&amp;ccedil;ekleştirilir. Burada i&amp;ccedil;eriğin &lt;strong&gt;XML&amp;nbsp;&lt;/strong&gt;formatında olduğunda l&amp;uuml;ften dikkat edelim. &lt;strong&gt;XML&lt;/strong&gt; i&amp;ccedil;eriğinin nasıl olması gerektiği noktasında, &lt;strong&gt;REST&lt;/strong&gt; servisin &lt;strong&gt;help&lt;/strong&gt; sayfasından yardım alabiliriz(&lt;strong&gt;http://localhost/ServiceSilo/CommonService.svc/help&lt;/strong&gt;)&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Yazılan ASP sayfasının IIS 7.5 &amp;uuml;zerinde host edildiğini belirteyim. Bu işlem sırasında Application Pool'un Classic modda &amp;ccedil;alıştırıldığında, IUSR kullanıcısı i&amp;ccedil;in Permission ayarlarının yapıldığını belirtmek isterim. IIS &amp;uuml;zerinde klasik ASP kullanımı makale sınırlarımız dışında olduğundan derinlemesine detaylandırmıyorum.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Yapılan &amp;ccedil;ağrıya ait sonu&amp;ccedil;lar &lt;strong&gt;xmlhttp&lt;/strong&gt; değişkeni &amp;uuml;zerinden yakalanbilirler. &lt;strong&gt;responseText&lt;/strong&gt; ile gelen cevabı, &lt;strong&gt;status&lt;/strong&gt; ile &lt;strong&gt;HTTP&lt;/strong&gt; durum kodunu, &lt;strong&gt;statustext&lt;/strong&gt; ile de durum koduna ait a&amp;ccedil;ıklamayı yakalayabiliriz. Bu işlemin ardından yapılan tek şey elde edilen sonu&amp;ccedil;ları ekrana basmaktır. &amp;Ouml;rnek başarılı bir şekilde &amp;ccedil;alıştığında aşağıdakine benzer bir sonu&amp;ccedil; g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/02/asprest_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zetleyecek olursak eski nesil bir &lt;strong&gt;ASP&lt;/strong&gt; sayfasından, yeni nesil &lt;strong&gt;REST&lt;/strong&gt; tipinden bir servisi &amp;ccedil;ağırmayı başarabildiğimizi ifade edebiliriz. Tabii ki bu benim nasıl yapılır sorusu i&amp;ccedil;in uğraştığım ilk kod par&amp;ccedil;ası. Asıl ihtiyacımızda bu servis entegrasyonunun var olan miras uygulamasının&amp;nbsp;hangi &lt;strong&gt;ASP&lt;/strong&gt;&amp;nbsp;sayfalarında yapılacağının bulunması, gelen i&amp;ccedil;eriklerin kodda kullanılabilir kıvama getirilmesi gibi gereksinimler s&amp;ouml;z konusu. Bize kolay gelsin.&amp;nbsp;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-02-24 12:00:00</pubDate>
  <slug>klasik-asp-sayfasindan-rest-servis-cagirmak</slug>
  <tags>
    <tag>http</tag>
    <tag>rest</tag>
    <tag>rest-services</tag>
    <tag>aspnet</tag>
    <tag>classic-asp</tag>
    <tag>wcf</tag>
    <tag>http-post</tag>
    <tag>m-s-x-m-l2</tag>
    <tag>server-x-m-l-h-t-t-p</tag>
  </tags>
  <categories>
    <category>REST</category>
  </categories>
</post>