<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Microsoft.Net Services - Service Bus için Hello World</title>
  <description>Daha önceki Windows Azure Service Platformu Hakkında İlk İzlenimler başlıklı yazımızda Amazon' dan Cloud Computing with Windows Azure Platform isimli bir kitabı sipariş ettiğimi ve önümüzdeki dönemlerde bu konu ile ilişkili yazılarımı sizlerle paylaşacağımı belirtmiştim.</description>
  <content>&lt;p&gt;&lt;strong&gt;&lt;img style="float: right;" src="/pics/2009%2f11%2fblg97_Giris.jpg" alt="" /&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bu g&amp;uuml;n itibairyle &lt;strong&gt;İstanbul'&lt;/strong&gt; da sağnak yağışlı bir hava hakim. Oysaki&amp;nbsp;bir ka&amp;ccedil; g&amp;uuml;ne kadar g&amp;uuml;neşli ve ılıman bir hava vardı.&amp;nbsp;Hal b&amp;ouml;yle olunca &lt;strong&gt;Cloud Computing&lt;/strong&gt; ile ilgili bir şeyler karıştırmanın tam vaktidir diye d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m. Daha &amp;ouml;nceki&amp;nbsp;&lt;a title="Windows Azure Service Platformu Hakkında İlk İzlenimler" href="/post/Windows-Azure-Service-Platform-What-Is" target="_blank"&gt;Windows Azure Service Platformu Hakkında İlk İzlenimler &lt;/a&gt;başlıklı yazımızda &lt;a title="Amazon Bookstore" href="http://www.amazon.com" target="_blank"&gt;Amazon' &lt;/a&gt;dan &lt;strong&gt;Cloud Computing&lt;/strong&gt; &lt;strong&gt;with Windows Azure Platform &lt;/strong&gt;isimli bir kitabı sipariş ettiğimi ve &amp;ouml;n&amp;uuml;m&amp;uuml;zdeki d&amp;ouml;nemlerde bu konu ile ilişkili yazılarımı sizlerle paylaşacağımı belirtmiştim.&lt;/p&gt;
&lt;p&gt;Ne var ki aradan ge&amp;ccedil;en uzun s&amp;uuml;reye ve &lt;strong&gt;Amazon' &lt;/strong&gt;dan kitabı elden teslim eden kurye ile sipariş etmeme rağmen kitap elime bir t&amp;uuml;rl&amp;uuml; ulaşmadı &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;ve Amerika' da bir &amp;ccedil;ıkış noktasında takıldı kaldı. Oysaki k&amp;uuml;t&amp;uuml;phanede yer alan sayısız kitap hep sorunsuz ulaşmıştı.&amp;nbsp;Bir kargo firması bir Amazon ile yazışma derken arada gidip gelen sayısız elektronik postanın arkasından en azından paramı geri almaya başardım ama ne varki kitabıma ulaşamadım. Peki yıldım mı? Yılmadım. Bu kez siparişimi &lt;a title="Amazon Co Uk" href="http://www.amazon.co.uk" target="_blank"&gt;Amazon.co.uk &lt;/a&gt;sitesinden verdim&lt;em&gt;(Sterlin farklarını hesaba katmanızı &amp;ouml;neririm)&lt;/em&gt;. Kitap siparişin bir sonraki g&amp;uuml;n&amp;uuml;nde &lt;strong&gt;UPS&lt;/strong&gt; tarafından bana ulaştırıldı.&lt;/p&gt;
&lt;p&gt;En azından i&amp;ccedil;im rahatladı ve kitabıma kavuştum.&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Gel gelelim şu an okuduğunuz yazıyı yazmak i&amp;ccedil;in bu kitabı bir g&amp;uuml;nde bitirmedim elbetteki. Aslına bakarsanız ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde &lt;strong&gt;.Net Services SDK'&lt;/strong&gt; sının Kasım s&amp;uuml;r&amp;uuml;m&amp;uuml; ve &amp;ccedil;ok doğal olarak d&amp;ouml;k&amp;uuml;mantasyonu yayınlandı. İşte bu yazımızda d&amp;ouml;k&amp;uuml;mantasyondan edindiğim ilk izlenimler ışığında geliştireceğimiz basit bir Hello World &amp;ouml;rneği yazmaya &amp;ccedil;alışıyor olacağız.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Windows Azure &lt;/strong&gt;platformunun &amp;ouml;nemli par&amp;ccedil;alarından birisi olan&lt;strong&gt; Microsoft .Net Services&lt;/strong&gt;, internet tabanlı uygulama servisleri olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Bu anlmada internet tabanlı uygulamaların Cloud &amp;uuml;zerinde yer alan uygulamalar veya &lt;strong&gt;kaynaklar(Resources)&lt;/strong&gt; ile iletişimini servis bazlı olarak koordine edebilen bir servis alt yapısı olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Şu aşamada &lt;strong&gt;Microsoft .Net Service'&lt;/strong&gt; lerin iki uygulama bi&amp;ccedil;imi vardır.&amp;nbsp;&lt;strong&gt;Service Bus &lt;/strong&gt;ve &lt;strong&gt;Access Control Service&lt;/strong&gt;. &amp;Ouml;zellikle &lt;strong&gt;Firewall &lt;/strong&gt;arkasında kalan istemcilerin &lt;strong&gt;Cloud &lt;/strong&gt;&amp;uuml;zerinde yer alan bir uygulama ile haberleşmesi sırasında gerekli olan karmaşık konfigurasyon işlemleri, g&amp;uuml;venlik gibi konuları &lt;strong&gt;Service Bus &lt;/strong&gt;&amp;uuml;zerine alarak kolay bir şekilde &amp;ccedil;&amp;ouml;z&amp;uuml;mlemeye &amp;ccedil;alışır.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;yleki Firewall arkasında duran uygulamaların Cloud &amp;uuml;zerindeki bir uygulama ile olan haberleşmesinde genellikle port a&amp;ccedil;ılması veya VPN kullanılması yolu tercih edilir. Port a&amp;ccedil;ılması bir g&amp;uuml;venlik riski doğurmakla birlikte, VPN kullanımında da&amp;nbsp;sistem seviyesinde&amp;nbsp;karmaşık konfigurasyon ayarları yapılması gerekmektedir. Oysaki Service Bus bu karmaşıklığı ele alarak istemcilerin Cloud &amp;uuml;zerindeki uygulamalar ile konuşabilmesini kolaylaştırmaktadır. &amp;Uuml;stelin&amp;nbsp;&lt;strong&gt;Authentication &lt;/strong&gt;gibi&amp;nbsp;işlevlere de sahiptir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Service Bus&lt;/strong&gt; &amp;ccedil;ok basit anlamda birbirlerine &lt;strong&gt;zayıf bağlı olan(Loosely Coupled) &lt;/strong&gt;uygulamaların g&amp;uuml;venli bir şekilde iletişim kurabilmesini sağlamak,&amp;nbsp;platforma bakılmaksızın gerekli karmaşık konfigurasyon ayarlarını&amp;nbsp;sağlamak&amp;nbsp;amacıyla kullanılmaktadır. İlk etapta &lt;strong&gt;Windows Azure&lt;/strong&gt; platformu &amp;uuml;zerinde yer alan &lt;strong&gt;Azure&lt;/strong&gt; ve &lt;strong&gt;SQL Service &lt;/strong&gt;uygulamaları ile olan iletişiminde kullanılabileceği d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&amp;nbsp;Bu a&amp;ccedil;ıdan bakıldığında Azure platformu &amp;uuml;zerindeki uygulamalar ve veritabanları ile haberleşilirken kullanılan bir servis alt yapısı olarakta g&amp;ouml;r&amp;uuml;lebilir. Aşağıdaki şekil &lt;strong&gt;Service Bus&lt;/strong&gt; alt yapısını bu a&amp;ccedil;ıdan değerlendirmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg97_ArchitectureLast.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında bu şekil bize şunları ifade etmektedir; &lt;strong&gt;App A&lt;/strong&gt;, &amp;uuml;zerinde bulunduğu &lt;strong&gt;Platform&lt;/strong&gt;' daki &lt;strong&gt;Firewall &lt;/strong&gt;gibi sorunlara takılmadan &lt;strong&gt;Azure Platform' &lt;/strong&gt;u &amp;uuml;zerinde konuşlandırılmış bir Cloud servisine, uygulamasına veya kaynağına(Resource) erişmek i&amp;ccedil;in &lt;strong&gt;Service Bus &lt;/strong&gt;alt yapısını kullanmaktadır. Şekilde yer alan &lt;strong&gt;App B&lt;/strong&gt;, Cloud &amp;uuml;zerinde yer alan bir uygulama olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmektedir. Buna g&amp;ouml;re &lt;strong&gt;App A &lt;/strong&gt;ile &lt;strong&gt;App B' &lt;/strong&gt;nin haberleşmesinde &lt;strong&gt;Service Bus&lt;/strong&gt; gerekli bağlantıyı, koordinasyonu sağlamakta ve g&amp;uuml;venli bir iletişimi tesis etmektedir. Diğer taraftan &lt;strong&gt;App A&lt;/strong&gt; yine &lt;strong&gt;Service Bus &lt;/strong&gt;aracılığıyla başka bir platform &amp;uuml;zerinde yer alan &lt;strong&gt;App C&lt;/strong&gt; isimli uygulama ilede g&amp;uuml;venli bir iletişim sağlayabilmektedir.&lt;/p&gt;
&lt;p&gt;Peki&lt;strong&gt; Service Bus&lt;/strong&gt; alt yapısının en belirgin &amp;ouml;zellikleri nelerdir?&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Firewall, NAT Gateway&lt;/strong&gt; gibi unsurların arkasında duran uygulama ve servislerin birbirleriyle haberleşebilmelerini gerekli konfigurasyon ayarlamalarını &amp;uuml;st&amp;uuml;ne aldığı i&amp;ccedil;in kolaylaştırır. Geliştiricinin veya tarafların hangi sistem gereksinimlerine ihtiya&amp;ccedil;ları olduğunu, bulundukları farklı platformlar arasındaki haberleşme sorunlarını d&amp;uuml;ş&amp;uuml;nmelerine gerek yoktur.&lt;/li&gt;
&lt;li&gt;Standart &lt;strong&gt;REST&lt;/strong&gt; modelini de desteklediğinden kolay bir şekilde kullanılabilir ama istenirse &lt;strong&gt;WCF&lt;/strong&gt; bazlı yaklaşım değerlendirilerek profesyon programcılar tarafından değerlendirilmeside&amp;nbsp;sağlanabilir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;.Net&lt;/strong&gt; platformundan olmayan uygulamalara &lt;strong&gt;REST&lt;/strong&gt; ve &lt;strong&gt;HTTP&lt;/strong&gt; tabanlı erişilebilmesini sağlar.&lt;/li&gt;
&lt;li&gt;Cloud &amp;uuml;zerindeki servislere &lt;strong&gt;Anonymous&lt;/strong&gt; kullanıcıların erişebilmesi, izin verildiği takdirde m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/li&gt;
&lt;li&gt;Servislerin internet &amp;uuml;zerinden erişilebilen sabit &lt;strong&gt;URL&lt;/strong&gt; adresleri&amp;nbsp;ile &lt;strong&gt;keşfedilmesi(Discovery)&lt;/strong&gt; lokasyona bakılmaksızın m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/li&gt;
&lt;li&gt;Servislere yapılan ş&amp;uuml;pheli saldırıların bloklanmasına yardımcı olur.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;vb...&lt;/p&gt;
&lt;p&gt;Bu kısa &lt;strong&gt;How To&lt;/strong&gt; niteliğindeki yazımızda aynı makine &amp;uuml;zerinde yer alan bir istemci ile yine aynı makine &amp;uuml;zerinde yer alan ve servisi host eden başka bir uygulama arasında&amp;nbsp;&lt;strong&gt;Service Bus&lt;/strong&gt; aracılığıyla &lt;strong&gt;Credential&lt;/strong&gt; bazlı bir iletişimin nasıl kurulabileceği incelenmektedir. Ger&amp;ccedil;ek anlamda &lt;strong&gt;Cloud&lt;/strong&gt; &amp;uuml;zerindeki bir uygulama, servis veya kaynak ile haberleşilmese de durumu simule edebileceğimiz bir &amp;ouml;rnek olacaktır.&lt;/p&gt;
&lt;p&gt;Tabiki işin daha &amp;ccedil;ok detayı vardır ancak adet olduğu &amp;uuml;zere konuyu kavramının en iyi yolunun &amp;ccedil;ok basit bir &amp;ouml;rnek geliştirmekle m&amp;uuml;mk&amp;uuml;n olabileceği kanısındayım. İşlemlere başlamadan &amp;ouml;nce &lt;a title="Microsoft.Net Services SDK" href="http://www.microsoft.com/downloads/details.aspx?FamilyID=c80ebadf-7eb8-4a62-abcd-0b57fa3855f8&amp;amp;displaylang=en" target="_blank"&gt;Microsoft .Net Services SDK' sının Kasım 2009 &lt;/a&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; indirmemiz ve sistemimize y&amp;uuml;klememiz gerekmektedir. Bu &lt;strong&gt;SDK&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt;.Net Services&lt;/strong&gt; olanaklarından yararlabilmemiz i&amp;ccedil;in gerekli tipler ve &amp;uuml;yeleri yer almaktadır. &lt;strong&gt;SDK'&lt;/strong&gt; nın y&amp;uuml;klenmesi yeterli değildir. Ayrıca &lt;strong&gt;Windows Azure&lt;/strong&gt; platformu &amp;uuml;zerinden bir servis hesabının a&amp;ccedil;ılması ve burada kullanacağımız&lt;strong&gt; Service Bus&lt;/strong&gt; i&amp;ccedil;in bir &lt;strong&gt;Namespace&lt;/strong&gt; bildirimi yapılması gerekmektedir. S&amp;ouml;z konusu hizmetlerden şu an i&amp;ccedil;in &amp;uuml;cretsiz yararlanılabilmekte olup &lt;strong&gt;2010&lt;/strong&gt; i&amp;ccedil;erisinde &amp;uuml;crete tabi olacağına dair bilgiler de yer almaktadır. &lt;em&gt;(Ancak yazıyı hazırladığım bu g&amp;uuml;nlerde &lt;strong&gt;Microsoft.Net Service'&lt;/strong&gt; leri &amp;uuml;cretsiz olarak kullanılabilmekteydi.)&lt;/em&gt; Kayıt işlemleri i&amp;ccedil;in&amp;nbsp;&lt;a href="https://netservices.azure.com/"&gt;https://netservices.azure.com/&lt;/a&gt;&amp;nbsp;adresinden yararlanılmaktadır. &amp;Ouml;rneğin benim &lt;strong&gt;Azure&lt;/strong&gt; &amp;uuml;zerinde yer alan projemde bu yazımızdaki &amp;ouml;rnek i&amp;ccedil;in oluşturduğum &lt;strong&gt;AlgebraService Namespace &lt;/strong&gt;ve bilgileri aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg97_ServiceNamespace.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dilerseniz &lt;strong&gt;Namespace&lt;/strong&gt; detaylarına da bakabilir gerekirse silerek hizmetten kaldırabilirsiniz. &lt;strong&gt;Namespace&lt;/strong&gt; oluşturulduktan sonra istemci ve servis tarafının kullanacağı &lt;strong&gt;ehliyet(Credential)&lt;/strong&gt; bilgilerinin de otomatik olarak oluşturulduğu g&amp;ouml;r&amp;uuml;lecektir. &lt;strong&gt;Service Bus&lt;/strong&gt; &amp;ouml;rneğimiz i&amp;ccedil;in bunlar &lt;strong&gt;Default Issuer Name&lt;/strong&gt; ve &lt;strong&gt;Default Issuer Key&lt;/strong&gt; değerleridir. Bu bilgiler &lt;strong&gt;Service Namespace'&lt;/strong&gt; ine ait &lt;strong&gt;Summary&lt;/strong&gt; b&amp;ouml;lgesinde g&amp;ouml;r&amp;uuml;lebilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg97_Summary.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizde servis ve istemci uygulamalar aynı makine &amp;uuml;zerinde geliştirilecek olsalarda, aralarındaki &lt;strong&gt;Credential&lt;/strong&gt; tabanlı iletişim i&amp;ccedil;in yukarıda bilgileri yer alan Service Bus hizmeti kullanılacaktır. &lt;strong&gt;Service&lt;/strong&gt; ve &lt;strong&gt;Host&lt;/strong&gt; uygulamalarımız &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; ortamında geliştirilmekte olan basit &lt;strong&gt;Console&lt;/strong&gt; uygulamalarıdır ve her ikiside,&amp;nbsp;&lt;strong&gt;System.ServiceModel&lt;/strong&gt; ile &lt;strong&gt;.Net Services SDK'&lt;/strong&gt; sının y&amp;uuml;klenmesi sonrasında gelen &lt;strong&gt;Microsoft.ServiceBus&lt;/strong&gt; &lt;strong&gt;assembly'&lt;/strong&gt; larını referans etmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg97_References.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Servis tarafındaki kodlarımızı aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using System.ServiceModel.Description;
using Microsoft.ServiceBus;

namespace AlgebraHost
{
    // Servis s&amp;ouml;zleşmesi
    [ServiceContract(Namespace = "http://algebraservice/ServiceBus/")]
    public interface IAlgebraContract
    {
        [OperationContract]
        double Sum(double x, double y);
    }

    public interface IAlgebraChannel 
        : IAlgebraContract, IClientChannel
    {
    }

    // S&amp;ouml;zleşmeyi uygulayan tip
    [ServiceBehavior(Name="Algebra")]
    public class AlgebraService
        : IAlgebraContract
    {
        #region IAlgebraContract Members

        public double Sum(double x, double y)
        {
            return x + y;
        }

        #endregion
    }


    class Program
    {
        static void Main(string[] args)
        {
            // Servis adresi elde edilir
            // İlk parametre schema, ikinci parametre Service Bus &amp;uuml;zerinde oluşturulan Solution adı ve &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; parametrede servis yoludur
            Uri serviceUri = ServiceBusEnvironment.CreateServiceUri("sb", "AlgebraService", "AlgebraService");

            // İletişim i&amp;ccedil;in gerekli olan issuer adı ve şifresi bilgileri TransportClientEndpointBehavior nesne &amp;ouml;rneğinde toplanır
            TransportClientEndpointBehavior credential = new TransportClientEndpointBehavior();
            credential.CredentialType = TransportClientCredentialType.SharedSecret; // Credential tipi
            credential.Credentials.SharedSecret.IssuerName = "SİZİN ISSUER NAME DEĞERİNİZİ"; // Issuer adı
            credential.Credentials.SharedSecret.IssuerSecret = "SİZİN İ&amp;Ccedil;İN &amp;Uuml;RETİLEN KEY DEĞERİ// Issuer i&amp;ccedil;in otomatik &amp;uuml;retilmiş olan key değeri

            // ServiceHost nesne &amp;ouml;rneklenir
            // İlk parametre servis tipidir
            // İkinci parametre ise servis adresidir
            ServiceHost host = new ServiceHost(typeof(AlgebraService), serviceUri);
            IEndpointBehavior serviceRegistrySettings = new ServiceRegistrySettings(DiscoveryType.Public);

            // Config dosyasında tanımlanan t&amp;uuml;m Endpoint' lere gerekli Credential davranışı eklenir.
            foreach (ServiceEndpoint endpoint in host.Description.Endpoints)
            {
                endpoint.Behaviors.Add(serviceRegistrySettings);
                endpoint.Behaviors.Add(credential);
            }

            // Servis a&amp;ccedil;ılır
            host.Open();

            Console.WriteLine("Servisin orjina adresi \n {0}:\n Service Durumu {1} ",serviceUri,host.State);
            Console.WriteLine("Kapatmak i&amp;ccedil;in bir tuşa basınız");
            Console.ReadLine();

            // Servis kapatılır
            host.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Aslında standart bir &lt;strong&gt;WCF&lt;/strong&gt; Servisi yazılmış ve &lt;strong&gt;host&lt;/strong&gt; edilmiştir. Ancak &lt;strong&gt;Service Bus&lt;/strong&gt; &amp;uuml;zerinde tanımlı &lt;strong&gt;Service Namespace'&lt;/strong&gt; in kullanılması i&amp;ccedil;inde bir takım ek işlemler yapılmıştır. S&amp;ouml;z gelimi bu iletişim i&amp;ccedil;in gerekli &lt;strong&gt;Credential&lt;/strong&gt; bilgileri &lt;strong&gt;TransportClientCredentialType&lt;/strong&gt; tipi yardımıyla servisin &amp;uuml;zerindeki t&amp;uuml;m &lt;strong&gt;endPoint'&lt;/strong&gt; lere birer &amp;ccedil;alışma zamanı &lt;strong&gt;davranışı(Behavior)&lt;/strong&gt; olarak bildirilmektedir. Buna g&amp;ouml;re servis, istemci ile olan t&amp;uuml;m iletişiminde &lt;strong&gt;Azure&lt;/strong&gt; &amp;uuml;zerindeki projemiz i&amp;ccedil;in &amp;uuml;retilen &lt;strong&gt;Name&lt;/strong&gt; ve &lt;strong&gt;Key &lt;/strong&gt;değerleri kullanılacaktır.&lt;/p&gt;
&lt;p&gt;Diğer yandan servisin adresi belirlenirken, &lt;strong&gt;Service Namespace &lt;/strong&gt;bilgisinin kullanıldığı dikkatten ka&amp;ccedil;mamalıdır. Nitekim &lt;strong&gt;Azure&lt;/strong&gt; &amp;uuml;zerindeki ilgili servisin adresinin bilinmesi gerekmektedir. Bu ama&amp;ccedil;la &lt;strong&gt;sb&lt;/strong&gt; isimli &lt;strong&gt;Service Bus&lt;/strong&gt; schema adından da &lt;strong&gt;CreateServiceUri&lt;/strong&gt; metodu i&amp;ccedil;erisinde yararlanılmaktadır. Elbette servis tarafında &lt;strong&gt;WCF &amp;ccedil;alışma zamanı(WCF Runtim)&lt;/strong&gt;&amp;nbsp;i&amp;ccedil;in gerekli konfigurasyon ayarlarının da bildirilmesi gerekmektedir. Bu ama&amp;ccedil;la servis uygulamasına ait&amp;nbsp;&lt;strong&gt;App.config &lt;/strong&gt;dosyası aşağıdaki gibi geliştirilebilir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
  &amp;lt;system.serviceModel&amp;gt;
    &amp;lt;services&amp;gt;
      &amp;lt;service name="AlgebraHost.AlgebraService"&amp;gt;
        &amp;lt;endpoint contract="AlgebraHost.IAlgebraContract" binding="netTcpRelayBinding"/&amp;gt;
      &amp;lt;/service&amp;gt;
    &amp;lt;/services&amp;gt;
  &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Dikkat &amp;ccedil;ekici nokta &lt;strong&gt;TCP&lt;/strong&gt; bazlı iletişim i&amp;ccedil;in kullanılan &lt;strong&gt;bağlayıcı tiptir(Binding Type).&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Gelelim yine Console olarak tasarladığımız istemci uygulama tarafı kodlarına.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using Microsoft.ServiceBus;

namespace AlgebraClient
{
    // S&amp;ouml;zleşme tipi(Contract Type)
    [ServiceContract(Namespace = "http://algebraservice/ServiceBus/")]
    public interface IAlgebraContract
    {
        [OperationContract]
        double Sum(double x, double y);
    }

    public interface IAlgebraChannel
        : IAlgebraContract, IClientChannel
    {
    }

    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Başlamak i&amp;ccedil;in bir tuşa basınız");
            Console.ReadLine();
            
            // Bağlantı protokol&amp;uuml;n&amp;uuml;n (Http, Tcp) otomatik olarak belirleneceği bildirilir
            ServiceBusEnvironment.SystemConnectivity.Mode = ConnectivityMode.AutoDetect;

            string sbNamespace = "AlgebraService";
            string sbIssuer = "SİZİN ISSUER NAME DEĞERİNİZ";
            string sbIssuerKey = "SİZİN ISSUER KEY DEĞERİNİZ";

            // Servis adresi &amp;uuml;retilir
            Uri serviceUri = ServiceBusEnvironment.CreateServiceUri("sb", sbNamespace, "AlgebraService");

            // İletişim i&amp;ccedil;in gerekli olan issuer adı ve şifresi TransportClientEndpointBehavior tipinden nesne &amp;ouml;rneği ile bildirilir.
            TransportClientEndpointBehavior credential = new TransportClientEndpointBehavior();
            credential.CredentialType = TransportClientCredentialType.SharedSecret;
            credential.Credentials.SharedSecret.IssuerName = sbIssuer;
            credential.Credentials.SharedSecret.IssuerSecret = sbIssuerKey;

            // İletişimin kanalını &amp;uuml;retecek olan fabrika nesnesi oluşturulur. İlk parametre ile config dosyasındaki Client Endpoint yeri belirtilir, ikinci parametre ilede Service Bus &amp;uuml;zerindeki adres bilgisi belirtilir
            ChannelFactory&amp;lt;IAlgebraChannel&amp;gt; channelFactory = new ChannelFactory&amp;lt;IAlgebraChannel&amp;gt;("AlgebraEndpoint", new EndpointAddress(serviceUri));
            // İletişimin hangi kullanıcı adı ve şifre ile ger&amp;ccedil;ekleştirileceği ilgili TransportClientEndpointBehavior nesne &amp;ouml;rneğinin davranış olarak bildirilmesiyle ger&amp;ccedil;eklenir
            channelFactory.Endpoint.Behaviors.Add(credential);

            // İletişim kanalı oluşturulur ve a&amp;ccedil;ılır
            IAlgebraChannel clientChannel = channelFactory.CreateChannel();
            clientChannel.Open();            
          
            // Sum operasyonuna &amp;ccedil;ağrı yapılır
            Console.WriteLine("Sum Result {0} + {1} = {2} ", 2,4,clientChannel.Sum(2,4).ToString());
          
            // İletişim kanalı ve kanal &amp;uuml;retme fabrikası kapatılır
            clientChannel.Close();
            channelFactory.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İstemci tarafında da dikkat edileceği &amp;uuml;zere Servis s&amp;ouml;zleşmesnin bir kopyası yer almaktadır. Nitekim &amp;ccedil;alışma zamanındaki &lt;strong&gt;proxy&lt;/strong&gt; &amp;uuml;retimi i&amp;ccedil;in servis s&amp;ouml;zleşmesinin sunduğu i&amp;ccedil;eriğin bilinmesi gerekmektedir. Burada devreye ilgili servis s&amp;ouml;zleşmesini implemente&amp;nbsp;eden kanal aray&amp;uuml;z referansıda girmektedir.&amp;nbsp;İstemci tarafı i&amp;ccedil;in yapılan adımlar aslında sırasıyla aşağıdaki gibidir;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Bağlantı modu belirlenir&lt;strong&gt;&lt;em&gt;(ConnectivityMode)&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;Host servisin adresi belirlenir&lt;em&gt;(Uri bilgisi belirlenirken Azure Projesi &amp;uuml;zerinde oluşturduğumuz &lt;strong&gt;Service Namespace &lt;/strong&gt;adı kullanılır)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Gerekli &lt;strong&gt;Crendetial&lt;/strong&gt; tanımlamaları yapılır ve bağlantı i&amp;ccedil;in uygulanması sağlanır&lt;strong&gt;&lt;em&gt;(TransportClientEndpointBehavior)&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;Kanal oluşturulur ve &lt;strong&gt;Credential'&lt;/strong&gt; ı değerlendirmesi &lt;strong&gt;davranış(Behavior)&lt;/strong&gt; eklenmesi yardımıyla belirtilir&lt;/li&gt;
&lt;li&gt;Kanal bağlantısı a&amp;ccedil;ılır.&lt;/li&gt;
&lt;li&gt;Gerekli servis operasyonları icra edilir.&lt;em&gt;(Kobay olarak sık&amp;ccedil;a kulladığımız &lt;strong&gt;Sum &lt;/strong&gt;operasyonu &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Bağlantılar kapatılır.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak istemci uygulamanın &lt;strong&gt;WCF &amp;Ccedil;alışma zamanı&lt;/strong&gt; i&amp;ccedil;inde bir takım konfigırasyon ayarlarının yapılması gerekmektedir. İşte istemci tarafı config dosyası i&amp;ccedil;eriği;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
  &amp;lt;system.serviceModel&amp;gt;
    &amp;lt;client&amp;gt;
      &amp;lt;endpoint name="AlgebraEndpoint" contract="AlgebraClient.IAlgebraContract" binding="netTcpRelayBinding"/&amp;gt;
      &amp;lt;!-- Service Bus ile iletişim kurmak i&amp;ccedil;in TCP protokol&amp;uuml; kullanılacaktır. netTcpRelayBinding bunu belirtmektedir--&amp;gt;
    &amp;lt;/client&amp;gt;
  &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;nce sunucu uygulamamız sonrasında ise istemci uygulamamız &amp;ccedil;alıştırıldığında aşağıdakine benzer bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşılması muhtemeldir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg97_Runtime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Eğer bu şekilde bir sonu&amp;ccedil; aldıysak istemci uygulamamızın host edilen servis ile &lt;strong&gt;Service Bus&lt;/strong&gt; &amp;uuml;zerinden haberleştiğini d&amp;uuml;ş&amp;uuml;nebiliriz. Aslında emin olmak i&amp;ccedil;in deneme amacıyla oluşturduğumuz &lt;strong&gt;Service Namespace'&lt;/strong&gt; ini kaldırmamız yeterli olacaktır &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Lakin bu durumda aşağıdaki sonu&amp;ccedil; ile karşılaşırız&lt;strong&gt;(EndpointNotFoundException)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg97_Exception.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece &lt;strong&gt;Azure Service Platformu&lt;/strong&gt; &amp;uuml;zerindeki ilk atılımımızı ger&amp;ccedil;ekleştirmiş olduk arkadaşlar. Umarım birşeyler aktarabilmişimdir. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f11%2fAlgebraHost.rar"&gt;AlgebraHost.rar (47,27 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-11-11 00:45:00</pubDate>
  <slug>Microsoft-DotNet-Services-Service-Bus-Hello-World</slug>
  <tags>
    <tag>windows-azure</tag>
    <tag>service-bus</tag>
    <tag>wcf</tag>
  </tags>
  <categories>
    <category>Windows Azure</category>
  </categories>
</post>