<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WF 4.0 - Workflow Yapısı ve Object Initialization[Beta 1]</title>
  <description>Workflow Foundation 4.0 ile ilgili yenilikleri araştırdığım şu günlerde, yaptığım araştırmalar sırasında ilgimi çeken noktalardan biriside, bir Workflow' un kod tarafında tek bir ifade satırı ile oluşturulabiliyor olmasıydı.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Workflow Foundation 4.0&lt;/strong&gt; ile ilgili yenilikleri araştırdığım şu g&amp;uuml;nlerde, yaptığım araştırmalar sırasında ilgimi &amp;ccedil;eken noktalardan biriside, bir &lt;strong&gt;Workflow' &lt;/strong&gt;un kod tarafında tek bir &lt;strong&gt;ifade satırı &lt;/strong&gt;ile oluşturulabiliyor olmasıydı. Burada &lt;strong&gt;Workflow &lt;/strong&gt;sisteminin hiyerarşik yapısının, &lt;strong&gt;Object Oriented &lt;/strong&gt;seviyede etkili bir kullanımının s&amp;ouml;z konusu olduğunu belirtmek isterim. Ancak konuya &amp;ccedil;ekirdek bilgilerden başlayarak yaklaşmakta yarar var.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Workflow&lt;/strong&gt; i&amp;ccedil;erisindeki lego par&amp;ccedil;alarının temelini &lt;strong&gt;aktiviteler(Activities) &lt;/strong&gt;oluşturmaktadır. &lt;strong&gt;WF 4.0&lt;/strong&gt; mimarsinde t&amp;uuml;m aktiviteler &lt;strong&gt;WorkflowElement&lt;/strong&gt; bileşeninden t&amp;uuml;remektedir. Aktivitleri aslında &lt;strong&gt;Workflow' &lt;/strong&gt;ların &lt;strong&gt;iş birimleri(Work Units) &lt;/strong&gt;olarak d&amp;uuml;ş&amp;uuml;nebiliriz. İki ve daha fazla iş biriminin bir araya gelerekten aktivite oluşturmaları da &amp;ccedil;ok doğal olarak m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Aslında buradan ilgin&amp;ccedil; olan bir tespit vardır. Bir aktivite, hiyerarşinin en &amp;uuml;st&amp;uuml;nde yer alıyorsa bir &lt;strong&gt;Workflow &lt;/strong&gt;halini alır ve kendi i&amp;ccedil;erisinde pek &amp;ccedil;ok aktiviteyi barındırabilir. Bunu şu şekilde de d&amp;uuml;ş&amp;uuml;nebiliriz; &lt;strong&gt;"Bir metodun kendi i&amp;ccedil;erisinde birden fazla metodu &amp;ccedil;ağırması". &lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Nitekim metodun kendi i&amp;ccedil;erisinde &amp;ccedil;ağırdığı ardışıl fonksiyonlar, yukarıdan aşağıya doğru hareket eden bir iş akışını oluşturmaktadır. Bu a&amp;ccedil;ıdan bakıldığında&lt;strong&gt; Workflow Foundation &lt;/strong&gt;olmasa dahi, kod bazında iş akışlarının en temel seviyede fonksiyonlar yardımıyla ger&amp;ccedil;ekleştirilebileceğini bilmek gerekir&lt;em&gt;(Hatta &amp;ccedil;alıştığım son projede bu tip bir mimari kullanılmaktadır).&lt;/em&gt; &lt;strong&gt;Workflow Foundation 3.X &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml;nden beridir &lt;strong&gt;Sequence &lt;/strong&gt;gibi &lt;strong&gt;&amp;uuml;st seviye(Top Level) &lt;/strong&gt;aktiviteleri barındırmaktadır. Bunlar &lt;strong&gt;Top Level &lt;/strong&gt;olarak kullanıldıklarında&amp;nbsp;bir Workflow' u ifade etmektedir. Tabiki &lt;strong&gt;Sequence &lt;/strong&gt;&amp;ouml;rnekleri kendi i&amp;ccedil;lerinde başka &lt;strong&gt;Sequence &lt;/strong&gt;&amp;ouml;rnekleri de barındıralabilirler.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Burada ilgin&amp;ccedil; olan noktalardan birisi, &lt;strong&gt;Workflow'&lt;/strong&gt; ları sadece tek bir ifade i&amp;ccedil;erisinde oluşturabilmemizdir. &lt;img title="Surprised" src="/editors/tiny_mce3/plugins/emotions/img/smiley-surprised.gif" alt="Surprised" border="0" /&gt;&amp;nbsp;Bunun i&amp;ccedil;in &lt;strong&gt;nesne başlatıcılarından(Object Initializers)&lt;/strong&gt; yararlanılmaktadır. Nasıl mı? Gelin &lt;strong&gt;Visual Studio 2010 Beta 1&lt;/strong&gt; &amp;uuml;zerinde basit bir &lt;strong&gt;Console Application &lt;/strong&gt;oluşturup &lt;strong&gt;Program.cs &lt;/strong&gt;i&amp;ccedil;eriğini aşağıdaki gibi oluşturduğumuz d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Not: Console uygulaması &amp;uuml;zerinde Workflow aktivitileri kullanılacağından, projeye System.Activities.dll Assembly' ının referans edilmesi gerekmektedir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace WorkflowStructure
{
    using System;
    using System.Activities;
    using System.Activities.Statements;

    class Program
    {
        static void Main(string[] args)
        {
            // Yeni bir Sequence aktivitesi oluşturulur. Top Level olduğu i&amp;ccedil;in workflow' un kendisidir.
            // Tek satırlık ifade i&amp;ccedil;erisinde bir Workflow tanımlandığına dikkat edilmelidir
            Sequence flow1 =new Sequence
            {
                DisplayName = "Hello Workflow World",
                // Activity tipinden elamanlar taşıyan koleksiyonun i&amp;ccedil;erisinde alt aktiviteler tanımlanır 
                Activities =
                {
                    new WriteLine{ DisplayName="Workflow Start", Text="Starting..."},//Basit bir WriteLine aktivitesi
                    new InvokeMethod{ DisplayName="5 Times Say Hello", MethodName="SayHello", TargetType=typeof(Logic)} // Logic sınıfından SayHello metodunu &amp;ccedil;ağıracak olan InvokeMethod aktivitesi tanımlanır 
                }                 
            };

            WorkflowInvoker.Invoke(flow1); // Workflow &amp;ouml;rneği &amp;ccedil;alıştırılır :)
        }
    }

    // Harici bir sınıf ve metod
    class Logic
    {
        public static void SayHello()
        {
            for (int i = 0; i &amp;lt; 5; i++)
            {
                Console.WriteLine("\tHello");
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rnek kod par&amp;ccedil;asında &lt;strong&gt;Sequence&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneği oluşturulmaktadır. Nesne oluşturulurken, &lt;strong&gt;Activities &lt;/strong&gt;&amp;ouml;zelliği i&amp;ccedil;erisinde alt aktivite &amp;ouml;rnekleri kullanılmıştır. &lt;strong&gt;Activities &lt;/strong&gt;&amp;ouml;zelliği &lt;strong&gt;Collection&amp;lt;Activity&amp;gt; &lt;/strong&gt;tipinden bir koleksiyonu işaret etmektedir. Dolayısıyla herhangibir &lt;strong&gt;Activity &lt;/strong&gt;referansına ait &amp;ouml;rnek, s&amp;ouml;z konusu koleksiyona eklenerek akışın g&amp;ouml;vdersi oluşturulabilir. &amp;Ouml;rnekte ilk olarak &lt;strong&gt;System.Activities.Statements &lt;/strong&gt;isim alanında yer alan &lt;strong&gt;WriteLine &lt;/strong&gt;aktivite bileşeni kullanılarak ekrana basit bir &amp;ccedil;ıktı verilmektedir. Takip eden adımda, &lt;strong&gt;InvokeMethod &lt;/strong&gt;aktivite bileşeni kullanılmaktadır. Bu bileşenin &amp;ouml;zellikleri ile, &lt;strong&gt;Logic &lt;/strong&gt;sınıfı i&amp;ccedil;erisinde yer alan &lt;strong&gt;SayHello &lt;/strong&gt;metodunun &amp;ccedil;alıştırılacağı belirtilmiştir&lt;em&gt;(Burada &lt;strong&gt;TargetType &lt;/strong&gt;veya &lt;strong&gt;TargetObject &lt;/strong&gt;&amp;ouml;zelliklerinden birisinin mutlaka set edilmesi gerekir. &lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;B&amp;ouml;ylece&amp;nbsp;&lt;strong&gt;MethodName &lt;/strong&gt;&amp;ouml;zelliğinde belirtilen fonskiyonun &amp;ccedil;alışma zamanında hangi tipe ait nese &amp;ouml;rneği i&amp;ccedil;erisinden &amp;ccedil;ağırılacağı belirtilmiş olur)&lt;/em&gt; Tabiki &lt;strong&gt;flow1 &lt;/strong&gt;isimli &lt;strong&gt;Sequence &lt;/strong&gt;nesne &amp;ouml;rneğinin &amp;ccedil;alıştırılması i&amp;ccedil;in &lt;strong&gt;WorkflowInvoker&lt;/strong&gt; tipi &amp;uuml;zerinden &lt;strong&gt;static Invoke &lt;/strong&gt;metodu kullanılmıştır. Olaya noktalı virg&amp;uuml;ller a&amp;ccedil;ısından baktığımızda sadece iki satırda bir Workflow' un tasarlanıp y&amp;uuml;r&amp;uuml;t&amp;uuml;ld&amp;uuml;ğ&amp;uuml;n&amp;uuml; ifade edebiliriz. Ancak g&amp;ouml;rsel bir tasarım ortamının olması elbetteki &amp;ccedil;ok daha m&amp;uuml;himdir ve tercih edilmelidir. Nitekim ger&amp;ccedil;ek hayat &amp;ccedil;&amp;ouml;z&amp;uuml;mlerindeki iş akışlarının &amp;ccedil;oğu bu kadar basit Workflow &amp;ouml;rnekleri ile ifade edilememektedir. Geliştirdiğimiz &lt;strong&gt;Workflow&lt;/strong&gt; herhangibir anlam i&amp;ccedil;ermesede&amp;nbsp;&lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt;&amp;nbsp;&amp;ouml;nemli olan, tek satırlık bir ifade ile &lt;strong&gt;object initializer&lt;/strong&gt; kavramından da yararlanarak, bir &lt;strong&gt;Workflow &lt;/strong&gt;&amp;ouml;rneğinin tesis edilebileceğinin farkında olmaktır. &amp;Ouml;rneği y&amp;uuml;r&amp;uuml;tt&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde &amp;ccedil;alışma zamanı i&amp;ccedil;in aşağıdaki sonu&amp;ccedil;ları aldığımızı g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f10%2fblg88_Runtime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere akış başarılı bir şekilde işletilmiştir. Bu kısa yazımızda &lt;strong&gt;Workflow&lt;/strong&gt; yapısının kod tarafında &lt;strong&gt;Object Initializers &lt;/strong&gt;yardımıyla ele alınışını incelemeye &amp;ccedil;alıştık. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f10%2fWorkflowStructure.rar"&gt;WorkflowStructure.rar (19,38 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-10-04 23:29:00</pubDate>
  <slug>WF-40-Workflow-ve-Object-Initialization</slug>
  <tags>
    <tag>wf-40</tag>
  </tags>
  <categories>
    <category>WF 4.0 Beta 1</category>
  </categories>
</post>