<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Data Form Wizard Yardımıyla İlişkili Tablo Uygulamalarının Hazırlanması</title>
  <description>Bu makalemizde, Visual Studio.NET ortamında, Data Form Wizard yardımıyla, veritabanı uygulamalarının ne kadar kolay bir şekilde oluşturulabileceğini inceleyeceğiz. Pek çok programcı, uygulamalarını geliştirirken sihirbazları kullanmaktan açıkça kaçınır. Bunun bir nedeni, sihirbazların işlemleri çok fazla kolaylaştırması ve programcıyı tembelliğe itmesidir. Gerçektende, bir Data Form Wizard yardımıyla uzun sürede programlayacağınız bir veritabanı uygulamsını inanılmaz kısa sürede tamamlayabilirisiniz. Diğer yandan, bir programcı için bir uygulamayı geliştirmekteki en önemli unsur belkide şu kelimenin arkasında gizlidir; Kontrol.</description>
  <content>&lt;p align="justify"&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p align="justify"&gt;Bu makalemizde, Visual Studio.NET ortamında, Data Form Wizard yardımıyla, veritabanı uygulamalarının ne kadar kolay bir şekilde oluşturulabileceğini inceleyeceğiz. Pek &amp;ccedil;ok programcı, uygulamalarını geliştirirken sihirbazları kullanmaktan a&amp;ccedil;ık&amp;ccedil;a ka&amp;ccedil;ınır. Bunun bir nedeni, sihirbazların işlemleri &amp;ccedil;ok fazla kolaylaştırması ve programcıyı tembelliğe itmesidir. Ger&amp;ccedil;ektende, bir Data Form Wizard yardımıyla uzun s&amp;uuml;rede programlayacağınız bir veritabanı uygulamsını inanılmaz kısa s&amp;uuml;rede tamamlayabilirisiniz. Diğer yandan, bir programcı i&amp;ccedil;in bir uygulamayı geliştirmekteki en &amp;ouml;nemli unsur belkide şu kelimenin arkasında gizlidir; Kontrol.&lt;/p&gt;
&lt;p align="justify"&gt;Kontrol bir programcı i&amp;ccedil;in, uygulamanın her yerinde hakim olmak demektir. Yazılabilecek her kodun programcı tarafından yazılması, olabilecek t&amp;uuml;m hataların d&amp;uuml;zeltilmesi, mantıksal b&amp;uuml;t&amp;uuml;nl&amp;uuml;klerin sağlanması ve kullanıcının ihtiya&amp;ccedil;larına en &amp;uuml;st d&amp;uuml;zeyde cevap verilebilmesi, programcının kontrol&amp;uuml;n&amp;uuml; g&amp;uuml;&amp;ccedil;lendiren unsurlar arasında yer alır. Ger&amp;ccedil;ektende ben size, ger&amp;ccedil;ek hayatta sihirbazları &amp;ccedil;ok fazla kullanmamanızı tavsiye ederim. Herşeyden &amp;ouml;nce, sihirbazlar tek d&amp;uuml;zelik sağlarlar ve s&amp;uuml;rekli aynı adımları atarlar. Bu bir s&amp;uuml;re sonra hem sizi tembelleştirecek hemde ger&amp;ccedil;ek bir programcı gibi d&amp;uuml;ş&amp;uuml;nmekten &amp;ouml;rneğin oluşabilecek programatik hataların &amp;ouml;nceden sezilebilmesi yetenğinden mahrum bırakacaktır.&lt;/p&gt;
&lt;p align="justify"&gt;Ancak t&amp;uuml;m bu olumsuzlukların yanında, bir&amp;nbsp; Data Form Wizard aracını kullanaraktan, .NET ortamında veritabanı programlamasını &amp;ouml;ğrenmeye &amp;ccedil;alışan bir programcı i&amp;ccedil;in, neler yapılabileceği? , bunların hangi temel adımlarla ger&amp;ccedil;ekleştirildiği? , hatta Visual Studio.NET tarafından otomatik olarak oluşturulan kodların nerelerde devreye girdiği? gibi sorunların anlaşılmasıda olduk&amp;ccedil;a kolay olucaktır. Diğer yandan profesyonel programcılarda zaman zaman, sadece kendileri i&amp;ccedil;in bir takım verileri kolayca izleyebilmek amacıyla yada ani m&amp;uuml;dahalelerde bulunmak amacıyla oluşturacakları uygulamalarda aynı kodları tekrardan yazmak yerine sihirbazları kullanmayı tercih edebilirler. Dolayısıyla zaman zaman sihirbazları kullanmak olduk&amp;ccedil;a işe yarayabilir ama bunu alışkanlık halinede getirmemek gerekir. İşte bu makalemizde, bir Ado.Net uygulamasının, ilişkili iki tablo i&amp;ccedil;in nasıl kolayca oluşturulabileceğini incelyeceğiz. Uygulamamız sona erdiğinde, tabloları izleyebilecek, ilişkili kayıtları inceleyebilecek, yeni kayıtlar ekleyebilecek, var olanları d&amp;uuml;zenleyip silebilecek ve kayıtlar arasında gezinebileceğiz. Ayrıca sihirbazımız, programatik olarak oluşturulan Ado.Net uygulamalarında da hangi adımları takip edeceğimiz hakkında bize kılavuzluk etmiş olucak. Şimdi dilerseniz uygulamamızı yazmaya başlayalım. &amp;Ouml;ncelikle Visual Studio ortamında bir C# Windows Uygulaması a&amp;ccedil;alım. Daha sonra veritabanı uygulamamızı taşıyacak formu eklemek i&amp;ccedil;in, Solution sekmesinde, projemize sağ tuş ile tıklayalım ve Add New Item &amp;ouml;ğesini se&amp;ccedil;elim.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk52_1.gif" alt="" width="372" height="363" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 1. Add New Item.&lt;/p&gt;
&lt;p align="justify"&gt;Bu durumda karşımıza aşağıdaki pencere gelecektir. Bu pencerede Data Form Wizard aracını se&amp;ccedil;elim. Data Form Wizard aracı t&amp;uuml;m adımları bitirildikten sonra, projemize cs uzantılı bir sınıf ve bu sınıfı kullanan bir Form ekleyecektir. Veritabanına bağlanılması, tabloların dolduruluması, satırlar arasında gezinme gibi pek &amp;ccedil;ok işlevi yerine getiren metodlar, &amp;ouml;zellikler ve nesneler, Data Form Wizard ile oluşturulan bu sınıf i&amp;ccedil;erisine yazılacaktır. Burada Form dosyanıza anlamlı bir isim vermenizi &amp;ouml;neririm.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk52_2.gif" alt="" width="531" height="399" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 2. Data Form Wizard&lt;/p&gt;
&lt;p align="justify"&gt;Bundan sonra, artık uygulamayı oluşturacağımız adımlara ge&amp;ccedil;miş oluruz.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk52_3.gif" alt="" width="500" height="451" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 3. Adımlara başlıyoruz.&lt;/p&gt;
&lt;p align="justify"&gt;İlk adımımız DataSet nesnemizin isimlendirilmesi. Bir DataSet, veritabanından bağımsız olarak uygulamanın &amp;ccedil;alıştığı sistemin belleğinde oluşturulan bir alana referans eden kuvvetli bir nesnedir. Bir DataSet i&amp;ccedil;ersine, tablolar, tablolar arası ilişkiler vb. ekleyebiliriz. Bir DataSet ile,&amp;nbsp; veritabanındanki gerekli veriler DataSet nesnesinin bellekte temsil ettiği b&amp;ouml;lgeye y&amp;uuml;klendikten sonra bu veritabanına bağlı olmaksızın &amp;ccedil;alışabiliriz. Dahada &amp;ouml;nemlisi, veritabanına bağlı olmaksızın, veriler ekleyebilir, verileri d&amp;uuml;zenleyebilir, silebilir, yeni tablolara, g&amp;ouml;r&amp;uuml;n&amp;uuml;mler, ilişkiler oluşturabiliriz. DataSet, ADO.NET 'in en &amp;ouml;nemli yeniliklerinden birisi olmakla birlikte, bağlantısız katman dediğimiz kısımın bir par&amp;ccedil;asıdır. DataSet'i ilerleyen makalelerimizde daha detaylı olarak da inceleyeceğiz. Şu an i&amp;ccedil;in bilmeniz gereken, oluşturacağımız DataSet'in Sql sunucumuzda (veya başka bir databasede) yer alan ilişkili tablolarımızı ve aralarındaki ilişkiyi i&amp;ccedil;erecek olan bağlantısız ( ADO' daki RecordSet gibi, Veritabanına s&amp;uuml;rekli bir bağlantıyı gerektirmeyen ) bir nesne oluşudur. Şimdi burada uygulamaya &amp;ouml;nceden eklediğimiz bir DataSet nesnesini se&amp;ccedil;ebileceğimiz gibi yeni bir tanede oluşturabiliriz. Biz yeni bir DataSet oluşturacağımızdan, Creat a new database named alanına, DataSet'imizin adını giriyoruz.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk52_4.gif" alt="" width="500" height="451" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 4. İlk adımımız DataSet nesnemizi belirleyeceğimiz ad ile oluşturmak.&lt;/p&gt;
&lt;p align="justify"&gt;Sıradaki adım, veritabanına olan bağlantımızı ger&amp;ccedil;ekleştirecek nesnemizi tanımlayacak. Herşeyden &amp;ouml;nce DataSet nesnemize bir veritabanından veriler y&amp;uuml;kleyeceksek, bir veri sağlayıcısı &amp;uuml;zerinden bu verileri &amp;ccedil;ekmemiz gerekecektir. İşte bu ama&amp;ccedil;la, pek &amp;ccedil;ok ADO.NET nesnesi i&amp;ccedil;in gerekli olan ve belirtilen veri sağlayıcısı &amp;uuml;zerinden ilgili veri kaynağına bir bağlantı a&amp;ccedil;mamıza yarayan bir bağlantı ( Connection ) nesnesi kullanacağız. Burada uygulamamızda Sql Sunucumuzda yer alan veritabanına OleDb &amp;uuml;zerinden erişmek istediğimiz i&amp;ccedil;in, sihirbazımız bize bir OleDbConnection nesnesi &amp;ouml;rneği oluşturacaktır. Veri sağlayıcısının tipine g&amp;ouml;re, OleDbConnection, SqlConnection, OracleConnection, OdbcConnection bağlantı nesnelerini oluşturabiliriz. New Connection se&amp;ccedil;eneğini se&amp;ccedil;erek yeni bir bağlantı oluşturmamızı sağlayacak diğer bir sihirbaza ge&amp;ccedil;iş yapıyoruz.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk52_5.gif" alt="" width="500" height="451" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 5. Connection nesnemizi oluşturmaya başlıyoruz.&lt;/p&gt;
&lt;p align="justify"&gt;Şimdi karşımızda Data Link Properties penceresi yer almakta. Burada, Provider kısmında Microsoft OLE DB Provider For Sql Server se&amp;ccedil;eneği se&amp;ccedil;ili olmalıdır.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk52_6.gif" alt="" width="367" height="467" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 6. Provider.&lt;/p&gt;
&lt;p align="justify"&gt;Connection sekmesinde ise &amp;ouml;ncelikle bağlanmak istediğimiz sql sunucusunun adını girmeliyiz. Sql sunucumuz bu uygulamada, istemci bilgisayar &amp;uuml;zerinde kurulu olduğundan buraya localhost yazabiliriz. 2nci se&amp;ccedil;enekte, sql sunucusuna log in olmamız i&amp;ccedil;in gerekli bilgileri veriyoruz. Eğer sql sunucumuz windows authentication'ı kullanıyorsa, Use Windows Integrated Security se&amp;ccedil;eneğini se&amp;ccedil;ebiliriz. Bu durumda sql sunucusuna bağlanmak i&amp;ccedil;in windows kullanıcı bilgileri kontrol edilecektir. Bunun sonucu olarak username ve password kutucukları ge&amp;ccedil;ersiz kılınıcakatır.&amp;nbsp; Diğer yandan sql sunucusuna, burada oluşturulmuş bir sql kullanıcı hesabı ilede erişebiliriz. Ben uygulamamda sa kullanıcısını kullandım. Bildiğiniz gibi sa sql kullanıcısı admin yetkilerine sahip bir kullanıcı olarak sql sunucusunun kurulması ile birlikte sisteme default olarak y&amp;uuml;klenir. Ancak ilk y&amp;uuml;klemede herhangibir şifresi yoktur. G&amp;uuml;venlik amacıyla bu kullanıcıya mutlaka bir şifre verin.(Bunu sql ortamında ger&amp;ccedil;ekleştireceksiniz.) Allow Saving Password se&amp;ccedil;eneğini işaretlemediğimiz takdirde, uygulamayı kim kullanıyor ise, uygulama başlatıldığında sql sunucusuna bağlanabilmek i&amp;ccedil;in kendisinden bu kulllanıcı adına istinaden şifre sorulacaktır. Eğer bu se&amp;ccedil;eneği işaretlersek, program &amp;ccedil;alıştırıldığında buraya girilen şifre sorulmayacaktır. Şimdi 3nci se&amp;ccedil;eneğe ge&amp;ccedil;ersek ve combo box kontrol&amp;uuml;n&amp;uuml; a&amp;ccedil;arsak sql sunucusunda yer alan veritabanlarının t&amp;uuml;m&amp;uuml;n&amp;uuml; g&amp;ouml;rebiliriz. Buradan kullanacağımız veritabanını se&amp;ccedil;eceğiz.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk52_7.gif" alt="" width="367" height="467" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 7. Connection bilgileri giriliyor.&lt;/p&gt;
&lt;p align="justify"&gt;Dilersek Test Connection butonuna tıklayarak, sql sunucusuna bağlanıp bağlanamadığımızı kontrolde edebiliriz. Şimdi OK diyelim ve Data Link Properties penceresini kapatalım. Bu durumda karşımıza bir Login penceresi &amp;ccedil;ıkacaktır. Bu az &amp;ouml;nce Allow Saving Password se&amp;ccedil;eneğini işaretlemediğimiz i&amp;ccedil;in karşımıza gelmiştir. Şifremizi tekrardan girerek bu adımı ge&amp;ccedil;iyoruz. Bu durumda, sql sunucumuz i&amp;ccedil;in gerekli bağlantıyı sağlıyacak connection nesnemizde oluşturulmuş olur.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk52_8.gif" alt="" width="359" height="165" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 8. Login penceresi.&lt;/p&gt;
&lt;p align="justify"&gt;Sıradaki adımımızda ise, uygulamamızda kullanacağımız tabloları se&amp;ccedil;eceğiz. Bu adımda, bağlandığımız veritabanında yer alan tablolar ve g&amp;ouml;r&amp;uuml;n&amp;uuml;mler yer almaktadır. Biz hemen ekleyeceğimiz iki tabloyu se&amp;ccedil;ip pencerenin sağ tarafında yer alan Seleceted Item(s) kısmına aktarıyoruz. Bu tabloların her biri birer DataTable nesnesi olucak şekilde DataSet nesnemize eklenir. DataTable nesneleri tablolara ait bilgilerinin ve verilerinin bellekte y&amp;uuml;klendiği belli bir alanı referans ederler. Bir DataSet nesnesi birden fazla DataTable i&amp;ccedil;erebilir. B&amp;ouml;ylece veritabanı ortamını DataSet nesnesi ile uygulamanın &amp;ccedil;alıştığı sistem belleğinde simule etmiş oluruz.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk52_9.gif" alt="" width="500" height="451" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 9. Tablolar se&amp;ccedil;iliyor.&lt;/p&gt;
&lt;p align="justify"&gt;Bu iki tablomuz hakkında yeri gelmişken kısaca bilgi verelim. Sepetler tablosunda alışveriş sepetlerine ait bilgiler yer alıyor. Siparsler tablosu ise bu belirli sepetin i&amp;ccedil;inde yer alan &amp;uuml;r&amp;uuml;nlerin listesini tutuyor. Yani Sepetler tablosundan Siparisler tablosuna doğru bire-&amp;ccedil;ok ilişki s&amp;ouml;z konusu. Bu adımıda tamamladıktan sonra, veri kaynağına log in olmamız i&amp;ccedil;in tekrar bir şifre ekranı ile karşılacağız. Burayıda ge&amp;ccedil;tikten sonra sıra, iki tablo arasındaki ilişkiyi kuracağımız adıma geldi. Burada aralarında ilişki oluşturmak istediğimiz tabloları ve ilgili kolonları se&amp;ccedil;erek ilişkimiz i&amp;ccedil;in bir isim belirleyeceğiz. Bunun sonucu olarak sihirbazımız bir DataRelation nesnesi oluşturacak ve bu nesneyi DataSet'e ekliyecek. B&amp;ouml;ylece veritabanından bağımsız olarak &amp;ccedil;alışırken, DataSet k&amp;uuml;memiz bu DataRelation nesnesini kullanarak tablolar arasındaki b&amp;uuml;t&amp;uuml;nl&amp;uuml;ğ&amp;uuml;de sağlamış olucak. &amp;Ouml;ncelikle bu ilişki i&amp;ccedil;in anlmalı bir ad belirleyin. &amp;Ccedil;oğunlukla ilişkinin hangi taboladan hangi tabloya doğru olduğuna bağlı olunarak bir isimlendirme yapılır. Daha sonra Parent(Master) tablo ve Primary Key se&amp;ccedil;ilir. Ardından Foreign Key alanını i&amp;ccedil;eren tabloda, Child(Detail) tablo olarak se&amp;ccedil;ilir. Uyulamamızda Sepetler tablosu ile Siparisler tablosu SepetID alanları ile birbirlerine ilişkilendirilmiştir.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk52_10.gif" alt="" width="500" height="451" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 10. DataRelation nesnesi oluşturuluyor.&lt;/p&gt;
&lt;p align="justify"&gt;Bir sonraki adımımızda tabloların hangi alanlarının Form &amp;uuml;zerinde g&amp;ouml;r&amp;uuml;nt&amp;uuml;leneceğini belirleriz. Başlangı&amp;ccedil; i&amp;ccedil;in b&amp;uuml;t&amp;uuml;n alanlar se&amp;ccedil;ili haldedir. Bizde bunu uygulamamızda bu halde bırakacağız.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk52_11.gif" alt="" width="500" height="451" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 11. G&amp;ouml;r&amp;uuml;nt&amp;uuml;lenecek Alanların Se&amp;ccedil;ilmesi.&lt;/p&gt;
&lt;p align="justify"&gt;Son adım ise, Formun tasarımının nasıl olacağıdır. İstersek master tabloyu DataGrid kontrol&amp;uuml; i&amp;ccedil;inde g&amp;ouml;sterebiliriz. Ya da Master tabloya ait verileri bağlanmış kontollerlede g&amp;ouml;sterebiliriz. Bunun i&amp;ccedil;in Single record in individual controls se&amp;ccedil;eneğini se&amp;ccedil;elim. Diğer se&amp;ccedil;enekleride olduğu gibi bırakalım.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk52_12.gif" alt="" width="500" height="451" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 12. Son Adım. Formun g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml;n ayarlanması.&lt;/p&gt;
&lt;p align="justify"&gt;B&amp;ouml;ylece Data Form Wizard yardımıyla veritabanı uygulamamız i&amp;ccedil;in gerekli formu oluşturmuş olduk. Karşımıza aşağıdaki gibi bir Form &amp;ccedil;ıkacaktır.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk52_13.gif" alt="" width="545" height="466" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 13. Formun son hali.&lt;/p&gt;
&lt;p align="justify"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi t&amp;uuml;m kontrolleri ile birlikte uygulamamız oluşturulmuştur. Sql sunucumuza Ole Db veri sağlayıcısı &amp;uuml;zerinden erişmemizi sağlıyan OleDbConnection nesnemiz, tablolardaki verileri DataSet nesnesine y&amp;uuml;klemek (Fill) ve bu tablolardaki değişiklikleri, veritabanına yansıtmak (update) i&amp;ccedil;in kullanılan OleDbDataAdapter nesneleri, tabloları ve tablolar arası ilişkiyi bellekte sakayıp veritabanından bağımsız olarak &amp;ccedil;alışmamızı sağlayan DataSet nesnemiz ve diğerleri... Hepsi sihirbazımız sayesinde kolayca oluşturulmuştur. Gelelim bu form ile neler yapabileceğimize.&lt;/p&gt;
&lt;p align="justify"&gt;Her şeyden &amp;ouml;nce uygulamamızı &amp;ccedil;alıştırdığımızda hi&amp;ccedil; bir kontrolde verilerin g&amp;ouml;r&amp;uuml;nmediğine şahit olucaksınız. &amp;Ouml;nce, veritabanından ilgili tablolara ait verilerin DataSet &amp;uuml;zerinden DataTable nesnelerine y&amp;uuml;klenmesi gerekir. Bu Fill olarak tanımlanan bir işlemdir. Load butonu bu işlemi ger&amp;ccedil;ekleştirir. Load başlıklı butonun koduna bakarasak;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnLoad_Click(object sender, System.EventArgs e)
{
     try
     {
          // Attempt to load the dataset.
          this.LoadDataSet();
     }
     catch (System.Exception eLoad)
     {
          // Add your error handling code here.
          // Display error message, if any.
        System.Windows.Forms.MessageBox.Show(eLoad.Message);
     }
     this.objdsSatislar_PositionChanged();
}&lt;/pre&gt;
&lt;p align="justify"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi kod LoadDataSet adlı bir procedure'e y&amp;ouml;nlendirilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void LoadDataSet()
{
     // Create a new dataset to hold the records returned from the call to FillDataSet.
     // A temporary dataset is used because filling the existing dataset would
     // require the databindings to be rebound.
     Wizard.dsSatislar objDataSetTemp;
     objDataSetTemp = new Wizard.dsSatislar();
     try
     {
          // Attempt to fill the temporary dataset.
          this.FillDataSet(objDataSetTemp);
     }
     catch (System.Exception eFillDataSet)
     {
          // Add your error handling code here.
          throw eFillDataSet;
     }
     try
     {
          grdSiparisler.DataSource = null;
          // Empty the old records from the dataset.
          objdsSatislar.Clear();
          // Merge the records into the main dataset.
          objdsSatislar.Merge(objDataSetTemp);
          grdSiparisler.SetDataBinding(objdsSatislar, "Sepetler.drSepetlerToSiparisler");
     }
     catch (System.Exception eLoadMerge)
     {
          // Add your error handling code here.
          throw eLoadMerge;
     }
}&lt;/pre&gt;
&lt;p align="justify"&gt;Bu metodda da y&amp;uuml;kleme işlemi i&amp;ccedil;in bir DataSet nesnesi oluşturulur veFillDataSet procedure'&amp;uuml; bu DataSet'i parametre alarak &amp;ccedil;ağırılır. Bu kodlarda ise OleDbDataAdapter nesnelerinin Fill metodlarıa tablolara ait verileri, veritabanından alarak DataTable nesnelerine y&amp;uuml;klerler. Bunu yaparken OleDbDataAdapter nesneleri Select sorgularını kullanır. Bu sorgular, program i&amp;ccedil;inde oluşturulmuş SqlCommand nesnelerinde saklanmaktadır. Her bir tablo i&amp;ccedil;in bir OleDbDataAdapter, bu tabodaki verileri almak i&amp;ccedil;in &amp;ccedil;alıştıracağı bir Sql sorgusunu, bir SqlCommand nesnesinden alır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void FillDataSet(Wizard.dsSatislar dataSet)
{
     // Turn off constraint checking before the dataset is filled.
     // This allows the adapters to fill the dataset without concern
     // for dependencies between the tables.
     dataSet.EnforceConstraints = false;
     try
     {
          // Open the connection.
          this.oleDbConnection1.Open();
          // Attempt to fill the dataset through the OleDbDataAdapter1.
          this.oleDbDataAdapter1.Fill(dataSet);
          this.oleDbDataAdapter2.Fill(dataSet);
     }
     catch (System.Exception fillException)
     {
          // Add your error handling code here.
          throw fillException;
     }
     finally
     {
          // Turn constraint checking back on.
          dataSet.EnforceConstraints = true;
          // Close the connection whether or not the exception was thrown.
          this.oleDbConnection1.Close();
     }
}&lt;/pre&gt;
&lt;p align="justify"&gt;Uygulamanın diğer butonlarına ilişkin kodlarıda incelediğinizde herşeyin otomatik olarak sihirbaz tarafından uygulandığını g&amp;ouml;receksiniz. Uygulamanın t&amp;uuml;m kodlarını ekteki &lt;a href="/admin/app/editor/DataForm1.cs"&gt;DataForm1.cs&lt;/a&gt; dosyası i&amp;ccedil;inden inceleyebilirsiniz. Şimdi uygulamamızı &amp;ccedil;alıştıralım ve g&amp;ouml;relim. Uygulamayı &amp;ccedil;alıştırdığınızda Form1'in ekrana geldiğini ve DataForm1 in g&amp;ouml;r&amp;uuml;nmediğini g&amp;ouml;receksiniz. Bu durumu d&amp;uuml;zeltmek i&amp;ccedil;in, projenin başlangı&amp;ccedil; formunu değiştirmemiz gerekiyor.Bunun i&amp;ccedil;in, Form1'in Main Procedure'&amp;uuml;n&amp;uuml;n kodunu aşağıdaki gibi değiştirmemiz yeterlidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main()
{
     Application.Run(new DataForm1());
}&lt;/pre&gt;
&lt;p align="justify"&gt;Şimdi uygulamamızı &amp;ccedil;alıştırabiliriz. Load başlıklı button kontrol&amp;uuml;ne tıkladığımızda tablo verilerinin ekrana geldiğini ve kontrollere y&amp;uuml;klendiğini g&amp;ouml;receksiniz. Y&amp;ouml;n kontrolleri ile Sepetler tablosunda gezinirken DataGrid kontrol&amp;uuml;ndeki verilerinde değiştiğine dikkatinizi &amp;ccedil;ekmek isterim.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk52_14.gif" alt="" width="450" height="510" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 14.Uygulamanın &amp;ccedil;alışmasının sonucu.&lt;/p&gt;
&lt;p align="justify"&gt;Dilerseniz veriler &amp;uuml;zerinde değişiklikler yapabilirsiniz. Ancak yaptığınız bu değişiklilker bellekteki DataSet k&amp;uuml;mesi &amp;uuml;zerinde ger&amp;ccedil;ekleşecektir. Bu değişiklikleri eğer, veritabanınada yazmak isterseniz Update başlıklı button kontrol&amp;uuml;ne tıklamanız gerekir. Bu durumda temel olarak, OleDbDataAdapter nesnesi, DataSet &amp;uuml;zerindeki t&amp;uuml;m değişiklikleri alıcak ve veritabanını Update metodu ile g&amp;uuml;ncelleyecektir. Bu işlem i&amp;ccedil;in OleDbDataAdapter nesnesinin Update metodu,&amp;nbsp; UpdateCommand &amp;ouml;zelliğine bakar.&amp;nbsp; UpdateCommand &amp;ouml;zelliği, Update sorgusu i&amp;ccedil;eren bir SqlCommand nesnesini işaret eder. B&amp;ouml;ylece g&amp;uuml;ncelleme işlemi bu komut vasıtasıyla ger&amp;ccedil;ekleşir. Bu işlemler yanında yeni satırlar ekleyebilir, var olanlarını silebilirsiniz. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi komple bir veritabanı uygulaması oldu. Bunun dışında uygulamamızın g&amp;uuml;&amp;ccedil;l&amp;uuml; y&amp;ouml;nleride vardır. &amp;Ouml;rneğin yeni bir Siparis girin. Ancak Siparis numarasını aşağıdaki gibi var olmayan bir SepetID olarak belirleyin.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk52_15.gif" alt="" width="447" height="249" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 15. Var olmayan bir ForeignKey girdik.&lt;/p&gt;
&lt;p align="left"&gt;Bu durumda aşağıdaki uyarıyı alırsınız.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk52_16.gif" alt="" width="629" height="120" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 16. ForeignKeyConstraint durumu.&lt;/p&gt;
&lt;p align="left"&gt;Bu durumda Yes derseniz buradaki değer otomatik olarak 1000 yapılır. İşte bu olay DataRelation nesnemizin becerisidir. Değerli okurlarım uzun ama bir okadarda faydalı olduğuna inandığım bir makalemizin daha sonuna geldik. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-02-09 12:00:00</pubDate>
  <slug>Data-Form-Wizard-Yardc4b1mc4b1yla-Iliskili-Tablo-Uygulamalarc4b1nc4b1n-Hazc4b1rlanmasc4b1-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>dataform</tag>
    <tag>wizard</tag>
    <tag>visual-studio</tag>
    <tag>identity</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>