<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Generic Mimaride Kısıtlamaların(Constraints) Kullanımı</title>
  <description>Bu makalemizde .Net 2.0 ile birlikte gelen Generic mimarisinin uygulanışında, kısıtlamaların rolünü basit örnekler ile incelemeye çalışacağız. Generic mimari her ne kadar tür bağımsız algoritmaların geliştirilmesine izin versede, bazı durumlarda çeşitli zorlamaların uygulanmasınıda gerektirir. Örneğin generic olması planlanan tiplerin sadece referans tipleri ile çalışmasını isteyebiliriz. Generic bir tipe her hangibir zorunluluk kuralını uygulayabilmek için where anahtar sözcüğünü içeren bir ek ifade kullanılır. Bu ifadeler 5 adettir ve aşağıdaki tabloda gösterilmektedir.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bu makalemizde .Net 2.0 ile birlikte gelen Generic mimarisinin uygulanışında, kısıtlamaların rol&amp;uuml;n&amp;uuml; basit &amp;ouml;rnekler ile incelemeye &amp;ccedil;alışacağız. Generic mimari her ne kadar t&amp;uuml;r bağımsız algoritmaların geliştirilmesine izin versede, bazı durumlarda &amp;ccedil;eşitli zorlamaların uygulanmasınıda gerektirir. &amp;Ouml;rneğin generic olması planlanan tiplerin sadece referans tipleri ile &amp;ccedil;alışmasını isteyebiliriz. Generic bir tipe her hangibir zorunluluk kuralını uygulayabilmek i&amp;ccedil;in where anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml; i&amp;ccedil;eren bir ek ifade kullanılır. Bu ifadeler 5 adettir ve aşağıdaki tabloda g&amp;ouml;sterilmektedir.&lt;/p&gt;
&lt;table id="table8" style="border-collapse: collapse;" border="1" width="394" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="197"&gt;&lt;strong&gt; Koşul&lt;/strong&gt;&lt;/td&gt;
&lt;td width="173"&gt;&lt;strong&gt; Syntax&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="197"&gt;Değer tipi olma zorunluluğu&lt;/td&gt;
&lt;td width="173"&gt;where Tip : struct&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="197"&gt;Referans tipi olma zorunluluğu&lt;/td&gt;
&lt;td width="173"&gt;where Tip : class&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="197"&gt;Constructor zorunluluğu&lt;/td&gt;
&lt;td width="173"&gt;where Tip : new()&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="197"&gt;T&amp;uuml;reme zorunluluğu&lt;/td&gt;
&lt;td width="173"&gt;where Tip : &amp;lt;Temel Sınıf&amp;gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="197"&gt;Interface zorunluluğu&lt;/td&gt;
&lt;td width="173"&gt;where Tip : &amp;lt;Interface&amp;gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;İlk olarak struct ve class zorunluluklarını incelemeye &amp;ccedil;alışacağız. Bu kısıtlamaları, Generic bir tip i&amp;ccedil;erisinde yer alan tiplerin değer t&amp;uuml;r&amp;uuml; veya referans t&amp;uuml;rlerinden mutlaka ve sadece birisi olmasını istediğimiz durumlarda kullanırız. Generic' lik, uygulandığı tip i&amp;ccedil;in t&amp;uuml;r bağımsızlığını ortaya koyan bir yapıdır. Generic mimari sayesinde bir tipin &amp;ccedil;alışma zamanında kullanacağı &amp;uuml;yelerin t&amp;uuml;r&amp;uuml;n&amp;uuml; belirleyebiliriz. Ancak, hangi t&amp;uuml;r olursa olsun, ya değer t&amp;uuml;r&amp;uuml; ya da referans t&amp;uuml;r&amp;uuml; s&amp;ouml;z konusu olacaktır. İşte kısıtlamaları kullanarak, generic mimari &amp;uuml;zerinde referans t&amp;uuml;r&amp;uuml;m&amp;uuml; yoksa değer t&amp;uuml;r&amp;uuml;m&amp;uuml; olacağını belirleyebiliriz.&lt;/p&gt;
&lt;p&gt;Konuyu daha iyi anlayabilmek i&amp;ccedil;in şu &amp;ouml;rneği g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. Bildiğiniz gibi C# 2.0 beraberinde,&amp;nbsp; Framework 1.1 ile gelen koleksiyonların generic karşılıklarını da getirmiştir. Generic koleksiyonlarlar &amp;ccedil;alışma zamanında sadece belirtilen t&amp;uuml;rden nesneleri kullanır. Doğal olarka ya değer t&amp;uuml;rlerini ya da referans t&amp;uuml;rlerini kullanılar. Peki ya generic bir koleksiyonun sadece değer t&amp;uuml;rlerini taşımasını istersek ne yapabiliriz. Bir şekilde T tipinin sadece değer t&amp;uuml;r&amp;uuml; olması zorunluluğunu bildirmemiz gerekecektir. Aşağıdaki şemada BenimKoleksiyonum isimli &amp;ouml;zel bir koleksiyon tanımı yer almaktadır. BenimKoleksiyonum isimli generic sınıfımız i&amp;ccedil;eride List t&amp;uuml;r&amp;uuml;nden bir generic koleksiyonu kullanmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk142_4.gif" alt="" width="422" height="235" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class BenimKoleksiyonum&amp;lt;T&amp;gt; :IEnumerable&amp;lt;T&amp;gt;
{
    private List&amp;lt;T&amp;gt; icListe = new List&amp;lt;T&amp;gt;();
    public void Ekle(T urun)
    {
        icListe.Add(urun);
    }
    public T Oku(int indis)
    {
        return icListe[indis];
    }
    #region IEnumerable&amp;lt;T&amp;gt; Members

    public IEnumerator&amp;lt;T&amp;gt; GetEnumerator()
    {
        return icListe.GetEnumerator() ;
    }
    #endregion

    #region IEnumerable Members

    System.Collections.IEnumerator System.Collections.IEnumerable.GetEnumerator()
    {
        return icListe.GetEnumerator();
    }

    #endregion
}&lt;/pre&gt;
&lt;p&gt;Burada sınıfımız i&amp;ccedil;erisinde yer alan icListe isimli List tipinden generic koleksiyonumuz, T t&amp;uuml;r&amp;uuml;nden elemanlar ile iş yapacak şekilde tasarlanmıştır. Aynı şekilde, Ekle, Oku ve GetEnumerator metodunun bir versiyonuda sadece T tipinden elemanlar &amp;uuml;zerinde iş yapmaktadır. Şimdi BenimKoleksiyonum sınıfına ek olarak aşağıda bilgileri verilen iki yapımız(struct) olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk142_5.gif" alt="" width="478" height="212" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dvd.cs ve Kitap.cs;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;struct Kitap
{
    private string mBaslik;
    private double mFiyat;

    public Kitap(string baslik, double fiyat)
    {
        mBaslik = baslik;
        mFiyat = fiyat;
    }
    public override string ToString()
    {
        return mBaslik + " " + mFiyat;
    }
}
struct Dvd
{
    private string mBaslik;
    private double mFiyat;
    private int mSure;

    public Dvd(string baslik, double fiyat,int sure)
    {
        mBaslik = baslik;
        mFiyat = fiyat;
        mSure = sure;
    }
    public override string ToString()
    {
        return mBaslik + " " + mFiyat+" "+mSure;
    }
}&lt;/pre&gt;
&lt;p&gt;Diyelimki BenimKoleksiyonum isimli sınıfın uygulama i&amp;ccedil;erisinde sadec yukarıda bilgileri verilen Kitap, Dvd ve ileride bunlar gibi geliştirilebilecek başka struct' lar ile ilgili işlemler yapmasını istiyoruz. Yani asla ve asla referans tiplerinin kullanmasını istemediğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu durumda tek yapmamız gereken şey BenimKoleksiyonum isimli sınıfa bir generic Constraint uygulamaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class BenimKoleksiyonum&amp;lt;T&amp;gt; :IEnumerable&amp;lt;T&amp;gt; where T:struct&lt;/pre&gt;
&lt;p&gt;Nasıl ki generic tipi değer t&amp;uuml;r&amp;uuml;nden olmaya yukarıdaki s&amp;ouml;z dizimde olduğu gibi zorlayabiliyorsak, aynı işi referans t&amp;uuml;rlerine zorlamak i&amp;ccedil;inde yapabiliriz. Tek yapmamız gereken struct yerine class anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml; kullanmak olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class BenimKoleksiyonum&amp;lt;T&amp;gt; :IEnumerable&amp;lt;T&amp;gt; where T:class&lt;/pre&gt;
&lt;p&gt;Struct zorlamasını kullandığımız takdirde eğer ki, BenimKoleksiyonum sınıfını kod i&amp;ccedil;erisinde herhangibir referans t&amp;uuml;r&amp;uuml; ile kullanmaya &amp;ccedil;alışırsak (&amp;ouml;rneğin string referans t&amp;uuml;r&amp;uuml; ile) derleme zamanında aşağıdaki hata mesajlarını alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk142_6.gif" alt="" width="634" height="197" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizde kullandığımız değer t&amp;uuml;r&amp;uuml; kısıtlaması her ne kadar koleksiyonun sadece struct' ları kullanmasını sağlıyorsada, eğer sadece Kitap ve Dvd gibi kendi tanımladığımız struct' ların kullanılmasına bir zorunluluk getirmemektedir. Nitekim int, double gibi struct' larıda BenimKoleksiyonum ile birlikte kullanabilirsiniz. Bu noktada daha g&amp;uuml;&amp;ccedil;l&amp;uuml; bir kısıtlama kullanmakta fayda vardır. Tam olarak soy bağımlılığı kısıtlaması bu talebimizi karşılar. Bu kısıtlamaya g&amp;ouml;re generic olarak kullanılan t&amp;uuml;r&amp;uuml;n belli bir tipten veya bu tipten t&amp;uuml;reyen başka tip(tipler)den olması zorunluluğu vardır. Dolayısıyla, ister değer t&amp;uuml;r&amp;uuml; ister refarans t&amp;uuml;r&amp;uuml; olsun, belli bir t&amp;uuml;r veya bu t&amp;uuml;rden kalıtımsal olarak t&amp;uuml;reyen tiplerin kullanılmasını zorunlu hale getirebiliriz. Bu kısıtlamayı uygulamak i&amp;ccedil;in aşağıdaki s&amp;ouml;z dizimi kullanılır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;where Tip : &amp;lt;Temel Sınıf&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu kısıtlamayı anlamak i&amp;ccedil;in şu &amp;ouml;rneği g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. Otomobillere ait &amp;ccedil;eşitli &amp;uuml;r&amp;uuml;nleri nesneye dayalı mimari altında tasarlamaya &amp;ccedil;alıştığımızı d&amp;uuml;ş&amp;uuml;nelim. Her &amp;uuml;r&amp;uuml;n&amp;uuml; ayrı bir sınıf olarak tasarlayabiliriz. Lakin pek &amp;ccedil;ok &amp;uuml;r&amp;uuml;n&amp;uuml;n ortak olan bir takım &amp;ouml;zellikleri ve işlevleride vardır. Bu tip &amp;uuml;yeleri temel bir sınıfta toplayabiliriz. &amp;Ccedil;ok basit olarak aşağıdaki sınıf diagramında g&amp;ouml;r&amp;uuml;len bir &amp;ouml;rnek geliştirelim. Burada Lastik ve Silecek isimli sınıflarımız, UrunTemel sınıfından t&amp;uuml;remiştir. UrunTemel isimli sınıfımız t&amp;uuml;m &amp;uuml;r&amp;uuml;nler i&amp;ccedil;in ortak olan &amp;uuml;r&amp;uuml;n kodu , fiyat ve kısa a&amp;ccedil;ıklama bilgileri i&amp;ccedil;in gerekli &amp;ouml;zellikleri barındırmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk142_1.gif" alt="" width="626" height="515" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Yukarıdaki şemada g&amp;ouml;r&amp;uuml;len UrunTemel, Lastik ve Silecek isimli sınıflarımıza ait kod satırlarımız ise aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;UrunTemel.cs&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Text;

namespace UsingGenericConstrainst
{
    public class UrunTemel
    {
        private int urunKodu;
        private double urunFiyati;
        private string urunBilgisi;

        public UrunTemel(int kod,double fiyat,string bilgi)
        {
            urunKodu = kod;
            urunFiyati = fiyat;
            urunBilgisi = bilgi;
        }

        public int UrunKodu
        {
            get{return urunKodu;}
        }
        public double BirimFiyat
        {
            get{return urunFiyati;}
        }

        public string UrunTanimi
        {
            get{return urunBilgisi;}
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Lastik.cs&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Text;

namespace UsingGenericConstrainst
{
    public class Lastik : UrunTemel
    {
        private int capi;
        private int genislik;
        private string tipi;

        public Lastik(int kodu, double fiyat, string bilgi)
            : base(kodu, fiyat, bilgi)
        {
        }

        public int Cap
        {
            get{return capi;}
            set{capi = value;}
        }

        public int Genislik
        {
            get{return genislik;}
            set{genislik = value;}
        }

        public string Tip
        {
            get{return tipi;}
            set{tipi = value;}
        }

        public override string ToString()
        {
            return UrunKodu.ToString() + " " + BirimFiyat.ToString() + " " + UrunTanimi + " " + Cap.ToString() + " " + Genislik.ToString() + Tip;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Silecek.cs&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Text;

namespace UsingGenericConstrainst
{
    public class Silecek : UrunTemel
    {
        private int uzunluk;

        public Silecek(int kodu, double fiyat, string bilgi)
            : base(kodu, fiyat, bilgi)
        {
        }
        public int Uzunluk
        {
            get{return uzunluk;}
            set{uzunluk = value;}
        }

        public override string ToString()
        {
            return UrunKodu.ToString() + " " + BirimFiyat.ToString() + " " + UrunTanimi + " " + Uzunluk.ToString();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi buradaki soy ilişkisini kullanacak tipte bir y&amp;ouml;netici sınıf geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim. Urunler isimli bu sınıfımızı değişik tipleri barındırabilecek bir generic koleksiyon ile birlikte kullanacağız. Doğal olarak, Urunler isimli sınıfımızıda generic bir mimaride geliştireceğiz. Urunler isimli sınıfımıza ait şema bilgisini ve kod satırlarını aşağıdaki grafikte g&amp;ouml;rebilirsiniz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk142_2.gif" alt="" width="172" height="204" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Urunler.cs&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Text;

namespace UsingGenericConstrainst
{
    public class Urunler&amp;lt;T&amp;gt; // where T : UrunTemel
    {
        private List&amp;lt;T&amp;gt; urunListe;

        public Urunler()
        {
            urunListe = new List&amp;lt;T&amp;gt;();
        }

        public void Ekle(T uye)
        {
            urunListe.Add(uye);
        }
        public void Sil(T uye)
        {
            urunListe.Remove(uye);
        }
        public void Listele()
        {
            foreach (T uye in urunListe)
            {
                Console.WriteLine(uye.ToString());
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi bu sınıflarımızı Main metodumuzda aşağıdaki kod satırları ile kullanmaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Urunler&amp;lt;Int16&amp;gt; urunler = new Urunler&amp;lt;short&amp;gt;();
urunler.Ekle(13);
urunler.Ekle(15);
urunler.Ekle(24);
urunler.Listele();&lt;/pre&gt;
&lt;p&gt;Uygulamamızı bu haliyle &amp;ccedil;alıştırdığımızda her hangibir sorun ile karşılaşmayız. Urunler isimli sınıfımız Generic bir yapıda olduğundan Short veri t&amp;uuml;r&amp;uuml;nden değişkenleri işleyecek şekilde tasarlayabiliriz. Fakat bu istediğimiz bir kullanım şekli değildir. Nitekim biz Urunler isimli sınıfımızın generic olmasını ama sadece Urun grubu ile ilgili t&amp;uuml;rleri işlemesini istemekteyiz. Bu sebepten yorumsal olarak yazdığımız kısıtlama satırını kaldırmamız ve bu sayede Urunler sınıfını sadece UrunTemel soyundan gelecek tiplerin kullanımına a&amp;ccedil;mamız gerekiyor. Uygulamamızı yukarıdaki kodları ile bırakıp, kısıtlamamızı devreye soktuğumuzda, build işleminden sonra aşağıdaki hata mesajları alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk142_3.gif" alt="" width="498" height="312" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Urunler isimli işlevsel sınıfımız, generic tip olarak sadece TemelUrun ve soyundan gelen sınıf nesne &amp;ouml;rnekleri ile &amp;ccedil;alışabilecek şekilde kısıtlandırıldığı i&amp;ccedil;in bu hata mesajları alınmıştır. Ancak uygulama kodlarımızı aşağıdaki gibi değiştirdiğimizde herhangibir problem ile karşılaşmayız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Urunler&amp;lt;UrunTemel&amp;gt; urunler = new Urunler&amp;lt;UrunTemel&amp;gt;();

Lastik lst = new Lastik(1000, 10, "Otomobil Lastiği");
lst.Tip = "Kış Lastiği";
lst.Cap = 185;
lst.Genislik = 75;

Silecek slc = new Silecek(1001, 5, "On silecek takimi");
slc.Uzunluk = 60;

urunler.Ekle(lst);
urunler.Ekle(slc);

urunler.Listele();&lt;/pre&gt;
&lt;p&gt;Generic kısıtlamalar ile ilgili olarak g&amp;ouml;receğimiz bir diğer modelde interface uygulama zorunluluğudur. Bu kurala g&amp;ouml;re, generic mimari i&amp;ccedil;inde kullanılacak olan t&amp;uuml;r, koşul olarak belirtilen interface' i veya ondan t&amp;uuml;reyenlerini mutlaka implemente etmiş bir tip olmak zorundadır. &amp;Ouml;rneğin aşağıdaki mimariyi g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. Bu &amp;ouml;rnekte bir veritabanı sisteminde yer alan varlıklar &amp;ccedil;eşitli sınıflar ile temsil edilmeye &amp;ccedil;alışılmıştır. Bu varlıkların ortak &amp;ouml;zelliği mutlaka ve mutlaka IGenelVeriIslem isimli aray&amp;uuml;z&amp;uuml; uyguluyor olmalarıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk142_7.gif" alt="" width="550" height="413" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bizim bu varlıkları y&amp;ouml;netecek bir sınıfımız var ise ve bu sınıfı generic bir mimari i&amp;ccedil;erisinde kullanmak istiyorsak sadece IGenelVeriIslem aray&amp;uuml;z&amp;uuml;n&amp;uuml; ugulayan tiplerin kullanılmasını da garanti edebiliriz. Tek yapmamız gereken ilgili y&amp;ouml;netici sınıfımıza aray&amp;uuml;z kısıtlamasını aşağıdaki kod satırlarında g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi eklemek olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class entYonetici&amp;lt;T&amp;gt; where T:IGenelVeriIslem
{
    // &amp;ouml;rnek kod satırları
}&lt;/pre&gt;
&lt;p&gt;Burada T tipinin mutlaka IGenelVeriIslem aray&amp;uuml;z&amp;uuml;n&amp;uuml; implemente etmiş bir t&amp;uuml;r olması zorunluluğu getirilmektedir. B&amp;ouml;ylece y&amp;ouml;netici sınıfımız &amp;ccedil;eşitli tipleri kullanabiliyor olmakla birlikte şu an i&amp;ccedil;in sadece ilgili aray&amp;uuml;z&amp;uuml; uygulayan varlık sınıflarına destek vermektedir.&lt;/p&gt;
&lt;p&gt;Generic kısıtlamalar ile ilgili bir diğer &amp;ouml;zellikte, varsayılan yapıcı metod olması zorunluluğudur. Buna g&amp;ouml;re generic mimari i&amp;ccedil;erisinde kullanılan bağımsız t&amp;uuml;r&amp;uuml;n mutlaka varsayılan yapıcı (default constructor-parameterless constructor) metoda sahip olması ama&amp;ccedil;lanmaktadır. Bunu daha iyi anlayabilmek i&amp;ccedil;in, varsayılan yapıcısı olmayan bir tipi, generic olarak kullanmaya &amp;ccedil;alışmalıyız. Aşağıdaki &amp;ouml;rneği g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk142_8.gif" alt="" width="174" height="353" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu &amp;ouml;rnekte, CDKoleksiyon basit olarak tasarlanmış generic tipte bir koleksiyondur. Cd isimli referans tipimizi pekala bu generic koleksiyon i&amp;ccedil;erisinde kullanabiliriz. Lakin Cd isimli sınıfımızın default constructor metodu mevcut değildir. Bunun yerine parametre alan overload edilmiş bir versiyonu kullanılmıştır. CDKoleksiyon sınıfının, taşıyacağı generic tiplerin mutlaka ve mutlaka varsayılan yapıcı metodları i&amp;ccedil;ermesini isteyeceğimiz durumlar s&amp;ouml;z konusu olabilir. Bu zorlamayı ger&amp;ccedil;ekleştirmek i&amp;ccedil;in tek yapmamız gereken new kısıtlamasını kullanmak olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class CDKoleksiyon&amp;lt;T&amp;gt; where T:new()
{
    private List&amp;lt;T&amp;gt; icListe = new List&amp;lt;T&amp;gt;();

    public void Ekle(T cd)
    {
        icListe.Add(cd);
    }

    public T Oku(int indis)
    {
        return icListe[indis];
    }
}
public class Cd
{
    private int BarkodNo;
    public Cd(int id)
    {
        BarkodNo = id;
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamada CDKoleksiyon sınıfına ait bir nesne &amp;ouml;rneğini Cd tipini kullanacak şekilde oluşturmaya &amp;ccedil;alıştığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde verilen hata mesajlarını alırız. Buna g&amp;ouml;re, generic tipin mutlaka parametresiz bir constructor kullanması gerektiği derleme zamanında hata mesajı olarak bildirilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk142_9.gif" alt="" width="494" height="263" border="0" /&gt;&lt;/p&gt;
&lt;table id="table20" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Dilersek generic kısıtlamaların bir ka&amp;ccedil;ını bir arada kullanabiliriz. &amp;Ouml;rneğin bir generic t&amp;uuml;r&amp;uuml;n hem belli bir tipten gelmesini hemde struct olmasını sağlayabiliriz. Bu kombinasyonları arttırmamız m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Buradaki tek şart, eğer varsayılan yapıcı kısıtlamasıda var ise new anahtarının her zaman i&amp;ccedil;in en sonda belirtilmesi gerekliliğidir.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Bu sayede, zorlamaları kullanarak tip g&amp;uuml;venliğini daha belirleyici şekilde sağlamış oluyoruz. Bu makalemizde generic mimarinin &amp;ouml;nemli &amp;ouml;zelliklerinden birisi olan kısıtlamaları incelemeye &amp;ccedil;alıştık. Kısıtlamalar yardımıyla t&amp;uuml;r bağımsızlığını kullanırken belirli şartların sağlanmasını zorunlu hale getirebileceğimizi g&amp;ouml;rd&amp;uuml;k. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2005-12-31 08:00:00</pubDate>
  <slug>Generic-Mimaride-Kısıtlamaların(Constraints)-Kullanımı-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#-20</tag>
    <tag>generics</tag>
    <tag>constraints</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>