<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF Data Services – Reflection Provider Kullanımı</title>
  <description>Windows Communication Foundation(WCF) yıllardır Microsoft mimarisinde önemli bir yere sahip. Özellikle servis bazlı uygulama geliştirme modeline kazandırdığı pek çok yeni yaklaşım sayesinde, var olan ve gelecek Microsoft ürünlerinin de pek çok noktasında kullanılmaya başlandı. Bana göre WCF modeli özellikle 3.5 sürümü ile başlayan gelişmeler ile birlikte programlama modelini önemli derece de geliştirdi. Bu gün mimari programlama modeline kuşbakışı baktığımızda aşağıdaki çizelge de görülen servis çeşitlerinin kullanımda olduğunu biliyoruz.</description>
  <content>&lt;p&gt;&lt;img style="border-style: initial; border-color: initial; float: right;" src="/pics/2012%2f3%2f1316795_bicycle.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bundan bir ka&amp;ccedil; yıl &amp;ouml;ncesiydi. Daha d&amp;uuml;n gibi hatırlıyorum. &lt;strong&gt;.Net Framework 3.0&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nde &amp;ccedil;ıkması beklenen yeni &lt;strong&gt;Foundation &lt;/strong&gt;alt yapıları &amp;uuml;zerine &lt;strong&gt;Microsoft &lt;/strong&gt;ekibinden gelen elektronik bir postayı okuyordum. O zamana kadar &lt;strong&gt;XML Web Service&lt;/strong&gt;' leri ve &amp;ouml;zellikle&lt;strong&gt; .Net Remoting&lt;/strong&gt; ile yakın ilişkiler i&amp;ccedil;erisinde bulunduğumdan, dikkatimi ilk &amp;ccedil;eken &lt;strong&gt;Windows Communication Foundation&lt;/strong&gt; isimli konsept olmuştu. Kısaca &lt;strong&gt;WCF &lt;/strong&gt;olarak adlandırılıyordu. Mutlaka &amp;uuml;zerine eğilmem gerektiğini d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m bir konuydu. Benim i&amp;ccedil;in yeni bir macera başlıyordu.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Hem heyecanlıydım hem de biraz korkmuştum &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;&amp;Ccedil;&amp;uuml;nk&amp;uuml; var olan t&amp;uuml;m servis yaklaşımlarını tek bir &amp;ccedil;atı altında toplayacak bir modelden bahsediliyordu&lt;em&gt;(Onun şimdiki halini ve yaygınlığını d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde, Microsoft' un bu vizyonunda ger&amp;ccedil;ekten de haklı olduğunu bir kez daha g&amp;ouml;rebiliyorum) &lt;/em&gt;Hemen araştırmalara başlamalıydım. Internet Explorer' ımı a&amp;ccedil;tım ve &lt;strong&gt;WCF&lt;/strong&gt; kelimesini googleladım. Bir de ne g&amp;ouml;reyim. Karşıma &lt;strong&gt;D&amp;uuml;nya Bisiklet Federasyonu(World Cycling Federations)&lt;/strong&gt; ile ilişkili sonu&amp;ccedil;lar &amp;ccedil;ıktı. Yandaki fotoğrafın anlamı bundandır&amp;nbsp;&lt;img title="Tongue out" src="/editors/tiny_mce3/plugins/emotions/img/smiley-tongue-out.gif" alt="Tongue out" border="0" /&gt;&amp;nbsp;Geyiği bir kenara bırakıp konumuza d&amp;ouml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Windows Communication Foundation(WCF)&lt;/strong&gt; yıllardır &lt;strong&gt;Microsoft&lt;/strong&gt; mimarisinde &amp;ouml;nemli bir yere sahip. &amp;Ouml;zellikle servis bazlı uygulama geliştirme modeline kazandırdığı pek &amp;ccedil;ok yeni yaklaşım sayesinde, var olan ve gelecek &lt;strong&gt;Microsoft&lt;/strong&gt; &amp;uuml;r&amp;uuml;nlerinin de pek &amp;ccedil;ok noktasında kullanılmaya başlandı. Bana g&amp;ouml;re &lt;strong&gt;WCF&lt;/strong&gt; modeli &amp;ouml;zellikle &lt;strong&gt;3.5&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml; ile başlayan gelişmeler ile birlikte programlama modelini &amp;ouml;nemli derece de geliştirdi. Bu g&amp;uuml;n mimari programlama modeline kuşbakışı baktığımızda aşağıdaki &amp;ccedil;izelge de g&amp;ouml;r&amp;uuml;len servis &amp;ccedil;eşitlerinin kullanımda olduğunu biliyoruz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/dsrp_1.png"&gt;&lt;img style="display: inline;" title="dsrp_1" src="/pics/dsrp_1_thumb.png" alt="dsrp_1" width="542" height="360" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Standart &lt;strong&gt;SOAP(Simple Object Access Protocol)&lt;/strong&gt; servisleri&lt;em&gt;(klasik XML Web Service yaklaşımı olarak da d&amp;uuml;ş&amp;uuml;nebiliriz)&lt;/em&gt;, b&amp;uuml;g&amp;uuml;nlerde ASP.NET takımınca ele alınan ve &lt;strong&gt;Asp.Net&lt;/strong&gt; &lt;strong&gt;Web API&lt;/strong&gt; olarak adlandırılan &lt;strong&gt;HTTP&lt;/strong&gt; bazlı &lt;strong&gt;REST(Representational State Transfer)&lt;/strong&gt; modeli, &amp;ouml;zellikle &lt;strong&gt;veri odaklı(Data-Centric)&lt;/strong&gt; &amp;ccedil;alışmak &amp;uuml;zere tasarlanmış &lt;strong&gt;Entity Framework&lt;/strong&gt; odaklı &lt;strong&gt;Data Service&amp;rsquo;&lt;/strong&gt; ler, &lt;strong&gt;Silverlight&lt;/strong&gt; tarafında kullanılan &lt;strong&gt;RIA(Rich Internet Application)&lt;/strong&gt; &amp;ccedil;eşidi ve tabiki &lt;strong&gt;Workflow Foundation&lt;/strong&gt; i&amp;ccedil;erisinde yerini almış &lt;strong&gt;Workflow Service&amp;rsquo;&lt;/strong&gt; ler.&lt;/p&gt;
&lt;p&gt;Bu geniş servis yelpazesinin uygulandığı alanlar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında, &lt;strong&gt;SQL Server, Sharepoint, BizTalk &lt;/strong&gt;gibi pek &amp;ccedil;ok &amp;uuml;r&amp;uuml;n grubu işin i&amp;ccedil;erisine giriyor ki buna bir de Cloud &amp;uuml;zerindeki WCF u&amp;ccedil; noktalarını etkilediğimizde modelin ne kadar etkili bir alana yayıldığını daha iyi g&amp;ouml;rebiliyoruz. Dolayısıyla &lt;strong&gt;WCF, &lt;/strong&gt;etkisini pek &amp;ccedil;ok noktadan pozitif anlamda hissettiriyor. Peki biz bu yazımızda neyi inceliyor olacağız?&amp;nbsp;&lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;oğunluka &lt;strong&gt;Entity Framework&lt;/strong&gt; odaklı olarak kullanılan &lt;strong&gt;Data Service&amp;rsquo;&lt;/strong&gt; ler, basit &lt;strong&gt;HTTP&lt;/strong&gt; protokol&amp;uuml; &amp;uuml;zerinden, &lt;strong&gt;Querystring&lt;/strong&gt; bazlı olacak şekilde i&amp;ccedil;erik yayınlanmasına izin vermektedir. Bu anlamda &lt;strong&gt;HTTP&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml;n basit &lt;strong&gt;Get, Post, Put, Delete&lt;/strong&gt; metodları ile &amp;ccedil;alışabilen, &lt;strong&gt;XML, JSON&lt;/strong&gt; veya &lt;strong&gt;OData&lt;/strong&gt; standardında &lt;strong&gt;Entity&lt;/strong&gt; &amp;ccedil;ıktılarını verebilen bir servis yapısı s&amp;ouml;z konusudur. Burada kafamıza takılan veya &amp;ccedil;ok fazla ilişmediğimiz konulardan birisi ise,&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Data Service&amp;rsquo; leri her zaman Entity Framework tabanlı olarak kullanmak zorunda olup olmadığımızdır?&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;G&amp;uuml;zel soru &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt;&amp;nbsp;Acaba var olan &lt;strong&gt;Data Service&lt;/strong&gt; &amp;ccedil;alışma modeli esnetilip &lt;strong&gt;Entity Framework&lt;/strong&gt; yerine kendi &lt;strong&gt;veri sağlayıcılarımız(Provider)&lt;/strong&gt; ile &amp;ccedil;alışabilir miyiz? Bir başka deyişle, &amp;ouml;rneğin &lt;strong&gt;ASP.NET &lt;/strong&gt;&amp;uuml;zerindeki &lt;strong&gt;Membership Provider, Profile Provider&lt;/strong&gt; gibi yapılarda uygulanabilen &amp;ouml;zelleştirme mantığını, &lt;strong&gt;Data Service&amp;rsquo;&lt;/strong&gt; ler tarafında da yapabilir miyiz? İşte bu yazımızda bu konuyu ele alıyor olacağız.&lt;/p&gt;
&lt;p&gt;Olayı kolay ve hızlı bir şekilde kavrayabilmek adına İşe basit bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması a&amp;ccedil;ıp, &amp;ccedil;&amp;ouml;z&amp;uuml;me aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len &lt;strong&gt;.Net assembly&amp;rsquo;&lt;/strong&gt; larını referans ederek başlamalıyız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/dsrp_3.png"&gt;&lt;img style="display: inline;" title="dsrp_3" src="/pics/dsrp_3_thumb.png" alt="dsrp_3" width="249" height="436" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Burada g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere uygulamamızda &lt;strong&gt;DataService&lt;/strong&gt; tipini kullanarak bir &lt;strong&gt;Self-Host&lt;/strong&gt; işlemi ger&amp;ccedil;ekleştiriyor olacağız. Diğer yandan kendi &lt;strong&gt;provider&amp;rsquo;&lt;/strong&gt; ımızı yazacağımız i&amp;ccedil;in de bazı &lt;strong&gt;assembly&amp;rsquo;&lt;/strong&gt; lara ihtiyacımız var&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;System.Data.Services&lt;/li&gt;
&lt;li&gt;System.Data.Services.Client&lt;/li&gt;
&lt;li&gt;System.ServiceModel&lt;/li&gt;
&lt;li&gt;System.ServiceModel.Web&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;Ouml;rnek uygulamamızda &lt;strong&gt;felsefeyi&lt;/strong&gt; anlamaya odaklanacağımız i&amp;ccedil;in &amp;ccedil;ok basit bir &lt;strong&gt;Text&lt;/strong&gt; dosyasını veri kaynağı olarak kullanıyor olacağız. Bu text dosya i&amp;ccedil;erisinde &lt;strong&gt;|&lt;/strong&gt; işaretleri ile ayrılmış şekilde bir personel verisini tutmayı planlıyoruz. Personel numarası, adı, soyadı, &amp;uuml;nvanı ve bulunduğu &amp;uuml;lke &amp;ouml;rnek veri alanlarımız olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Pek tabi &amp;ccedil;ok daha farklı bir veri kaynağını da senaryoya dahil edebilirsiniz. &amp;Ouml;rneğin donanımsal bir aray&amp;uuml;z&amp;uuml;n verilerini bu şekilde Data Service &amp;lsquo;ler &amp;uuml;zerinden sunabileceğinizi d&amp;uuml;ş&amp;uuml;n&amp;uuml;n. S&amp;ouml;z gelimi bu bir mobil cihaz &amp;uuml;zerinde bir s&amp;uuml;redir &amp;ccedil;alışmakta olan GPS servisinin topladığı i&amp;ccedil;erik olabilir&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href="/pics/dsrp_4.png"&gt;&lt;img style="display: inline;" title="dsrp_4" src="/pics/dsrp_4_thumb.png" alt="dsrp_4" width="336" height="83" /&gt;&lt;/a&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Gelelim uygulamamız i&amp;ccedil;erisindeki asıl kodlara. &amp;Ouml;nce &lt;strong&gt;Class Diagram&amp;rsquo;&lt;/strong&gt; a bir bakalım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/dsrp_2.png"&gt;&lt;img style="display: inline;" title="dsrp_2" src="/pics/dsrp_2_thumb.png" alt="dsrp_2" width="625" height="386" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Person&lt;/strong&gt; sınıfı aslında bizim i&amp;ccedil;in &lt;strong&gt;POCO(Plain Old CLR Object)&lt;/strong&gt; niteliği g&amp;ouml;steren bir tip olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Bu tipi, &lt;strong&gt;text&lt;/strong&gt; dosya i&amp;ccedil;erisindeki satırların nesnel karşılıklarını ifade etmek i&amp;ccedil;in kullanacağız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Data.Services.Common;

namespace ReflectionProvider 
{ 
    [DataServiceKey("PersonId")] 
    public class Person 
    { 
        public int PersonId { get; set; } 
        public string Name { get; set; } 
        public string Surname { get; set; } 
        public string Title { get; set; } 
        public string Country { get; set; } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Tabi bu tip i&amp;ccedil;erisinde sınıf seviyesinde uygulanan &lt;strong&gt;DataServiceKey&lt;/strong&gt; niteliğine dikkat etmemiz gerekiyor. Bu nitelik ile &lt;strong&gt;Person&lt;/strong&gt; tiplerinin &lt;strong&gt;Unique&amp;rsquo;&lt;/strong&gt; liğini &lt;strong&gt;PersonId&lt;/strong&gt; &amp;ouml;zelliklerine bağladığımızı ifade etmiş oluyoruz. Nitekim &lt;strong&gt;Data&lt;/strong&gt; &lt;strong&gt;Service&lt;/strong&gt; sınıfları, &lt;strong&gt;Entity Framework Entity&lt;/strong&gt; tipleri ile &amp;ccedil;alışırken ilgili sınıflarda bu niteliğin kullanılmasını beklemektedir. Aynı davranışın burada da uyarlanması gerekmektedir. Gelelim &lt;strong&gt;Bag&lt;/strong&gt; sınıfına.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Collections.Generic; 
using System.Configuration; 
using System.IO; 
using System.Linq;

namespace ReflectionProvider 
{ 
    public class Bag 
    { 
       private static List&amp;lt;Person&amp;gt; persons = new List&amp;lt;Person&amp;gt;();

        static Bag() 
        { 
            string[] personLines=File.ReadAllLines(ConfigurationManager.AppSettings["FilePath"]); 
            foreach (string personLine in personLines) 
            { 
                string[] columns=personLine.Split('|'); 
                Person person = new Person(); 
                person.PersonId = Int32.Parse(columns[0]); 
                person.Name = columns[1]; 
                person.Surname = columns[2]; 
                person.Title = columns[3]; 
                person.Country = columns[4]; 
                persons.Add(person); 
            } 
        }

        public IQueryable&amp;lt;Person&amp;gt; Persons { 
           get 
            { 
                return persons.AsQueryable(); 
            } 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Bag&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde &lt;strong&gt;text&lt;/strong&gt; tabanlı dosya i&amp;ccedil;eriğinin okunması ve &lt;strong&gt;Person&lt;/strong&gt; tipinden &lt;strong&gt;generic&lt;/strong&gt; bir &lt;strong&gt;List&lt;/strong&gt; koleksiyonuna atanması işlemleri yapılmaktadır. Bu işlemler &lt;strong&gt;static&lt;/strong&gt; &lt;strong&gt;yapıcı metod(Constructor)&lt;/strong&gt; i&amp;ccedil;erisinde ger&amp;ccedil;ekleştirilmektedir. Diğer yandan sınıfın olabilecek belki de en &amp;ouml;nemli &amp;ouml;zelliği &lt;strong&gt;Persons&lt;/strong&gt; &amp;uuml;yesidir. Dikkat edileceği &amp;uuml;zere bu &amp;uuml;ye geriye &lt;strong&gt;IQueryable&amp;lt;Person&amp;gt;&lt;/strong&gt; tipinden bir referans d&amp;ouml;nd&amp;uuml;rmektedir. Bu sayede biz &lt;strong&gt;Data Service&lt;/strong&gt; &lt;strong&gt;host&lt;/strong&gt; ortamına, &lt;strong&gt;URL&lt;/strong&gt; bazlı olarak sorgulanabilir bir i&amp;ccedil;erik sağlayacağımızı da belirtmiş olacağız&lt;em&gt;(Bir başka deyişle &lt;strong&gt;EntitySet&lt;/strong&gt; tipini ifade etmiş olmaktayız)&lt;/em&gt; Tabi bu belirtme işlemini asıl &lt;strong&gt;DataService&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde ger&amp;ccedil;ekleştireceğiz. Aynen aşağıda olduğu gibi&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Data.Services;

namespace ReflectionProvider 
{ 
    public class BagDataService 
        :DataService&amp;lt;Bag&amp;gt; 
    { 
        public static void InitializeService(IDataServiceConfiguration configuration) 
        { 
            configuration.SetEntitySetAccessRule("Persons", EntitySetRights.All); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;InitializeService&lt;/strong&gt; metodu, servisi host edeceğimiz ortamda tetikleniyor olacak. Bu metod i&amp;ccedil;erisinde standart &lt;strong&gt;Data&lt;/strong&gt; &lt;strong&gt;Service&lt;/strong&gt; şablonunda da yapıldığı gibi gerekli erişim kuralları belirlenmektedir. Tabi bu sefer &lt;strong&gt;Bag&lt;/strong&gt; tipi i&amp;ccedil;erisinde yer alan &lt;strong&gt;Persons&lt;/strong&gt; isimli &amp;ouml;zellik i&amp;ccedil;in &lt;strong&gt;full&lt;/strong&gt; erişim a&amp;ccedil;ılması s&amp;ouml;z konusudur. Bir başka deyişle &lt;strong&gt;GET, POST, PUT ve DELETE&lt;/strong&gt; metodlarına hizmet edecektir. &lt;em&gt;(Ancak&lt;strong&gt; POST, PUT, DELETE&lt;/strong&gt; gibi metod etkileşimleri i&amp;ccedil;in Bag tipine &lt;strong&gt;IUpdatable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n de uygulanması gerekmektedir ki bu yazımızda bu konu ele alınmamıştır. Bir sonraki yazımızda kısmetse)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Artık tek yapılması gereken &lt;strong&gt;DataService&lt;/strong&gt; tipinden yararlanarak bir &lt;strong&gt;Host&lt;/strong&gt; &amp;ouml;rneğini oluşturmak ve belirli bir &lt;strong&gt;URL&lt;/strong&gt; &amp;uuml;zerinden istemci taleplerini dinleyecek şekilde ayağa kaldırmaktan ibarettir. Bu ama&amp;ccedil;la &lt;strong&gt;Console&lt;/strong&gt; uygulamamıza ait Main metodu i&amp;ccedil;eriğini aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Data.Services;

namespace ReflectionProvider 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            Type serviceType = typeof(BagDataService); 
            Uri baseAddress = new Uri("http://localhost:8080"); 
           Uri[] baseAddresses = new Uri[] { baseAddress };

            DataServiceHost host = new DataServiceHost( 
                serviceType, 
               baseAddresses);

            host.Open(); 
            Console.WriteLine("Host durumu {0}. Kapatmak i&amp;ccedil;in bir tuşa basın",host.State); 
            Console.ReadLine(); 
            host.Close(); 
            Console.WriteLine("Host duruumu {0}. G&amp;uuml;le g&amp;uuml;le!",host.State); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Şimdi buraya kadar yaptıklarımızı bir test edelim. İlk olarak &lt;strong&gt;Console&lt;/strong&gt; uygulamamızı &amp;ccedil;alıştıralım. Sonrasında ise herhanbiri tarayıcı &amp;uuml;zerinden uygulamamıza sorgulama talepleri g&amp;ouml;nderelim.&lt;/p&gt;
&lt;p&gt;İlk sorgumuzda&lt;strong&gt; http://localhost:8080/Persons&lt;/strong&gt; talebini deneyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img style="border-style: initial; border-color: initial;" src="/pics/2012%2f3%2fdsrp_6.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Text &lt;/strong&gt;dosyamız i&amp;ccedil;erisinde yer alan t&amp;uuml;m i&amp;ccedil;erik &lt;strong&gt;XML &lt;/strong&gt;formatında tarayıcı uygulamaya gelmiştir.&lt;/p&gt;
&lt;p&gt;İkinci sorgumuzda ise belirli bir &lt;strong&gt;PersonId &lt;/strong&gt;değerine sahip i&amp;ccedil;eriği getirmeye &amp;ccedil;alışacağız. Hatırlayacağınız gibi &lt;strong&gt;Person &lt;/strong&gt;tipine uyguladığımız&amp;nbsp;&lt;strong&gt;DataServiceKey &lt;/strong&gt;niteliği ile, &lt;strong&gt;PersonId &lt;/strong&gt;&amp;ouml;zelliğinin &lt;strong&gt;unique &lt;/strong&gt;anahtar olduğunu belirtmiştik. Bu ama&amp;ccedil;la &lt;strong&gt;http://localhost:8080/Persons(10002)&lt;/strong&gt; URL' ini deneyebiliriz. İşte sonu&amp;ccedil;&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2012%2f3%2fdsrp_7.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak servise başka sorgular da ger&amp;ccedil;ekleştirilebilir. &amp;Ouml;rneğin &lt;strong&gt;Country &lt;/strong&gt;&amp;ouml;zelliğinin değerine g&amp;ouml;re alfabetik sırada listenin elde edilmesi sağlanabilir. Bunun i&amp;ccedil;in &lt;strong&gt;orderby &lt;/strong&gt;anahtar kelimesini kullanmak yeterlidir. Tabi dikkat edilmesi gereken noktalardan birisi de, sorgu i&amp;ccedil;erisinde yer alan &amp;ouml;zellik adlarının&lt;strong&gt; case-sensitive&lt;/strong&gt; olarak ele alınması gerekliliğidir. Bir başka deyişle, &lt;strong&gt;Country &lt;/strong&gt;yerine &lt;strong&gt;country &lt;/strong&gt;yazmak hataya neden olacak ve bir sonu&amp;ccedil; k&amp;uuml;mesi d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmeyecektir. Dolayısıyla &lt;strong&gt;http://localhost:8080/Persons?$orderby=Country&lt;/strong&gt; şeklindeki &lt;strong&gt;URL &lt;/strong&gt;ifadesi aşağıdaki sonucun &amp;uuml;retilmesini sağlayacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2012%2f3%2fdsrp_8.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;WCF Data Service&lt;/strong&gt;' lerde &lt;strong&gt;Reflection Provider&lt;/strong&gt;' larını kullanarak &lt;strong&gt;Entity Framework&lt;/strong&gt; dışındaki kaynakları kullanmak son derece kolaydır. Bu yazıda geliştirdiğimiz &amp;ouml;rnekte, &lt;strong&gt;POST, PUT &lt;/strong&gt;ve &lt;strong&gt;DELETE &lt;/strong&gt;sorguları i&amp;ccedil;in gerekli destek yoktur. Bunun i&amp;ccedil;in &lt;strong&gt;IUpdatable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n ve onunla birlikte tanımlanan &amp;uuml;yelerin &lt;strong&gt;ezilmesi(override) &lt;/strong&gt;gerekmektedir. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2012%2f3%2fReflectionProvider.rar"&gt;ReflectionProvider.rar (36,11 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2012-05-01 01:25:00</pubDate>
  <slug>WCF-Data-Services-Reflection-Provider</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-data-services</tag>
    <tag>reflection-provider</tag>
  </tags>
  <categories>
    <category>WCF Data Services</category>
  </categories>
</post>