<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Workflow Foundation Öğreniyorum Başladı - Ders 0 - Hello World</title>
  <description>Workflow Foundation Öğreniyorum isimli serideki amacımız, Workflow Foundation konusunu başlangıç seviyesinden, orta seviyeye kadar incelemek ve öğrenmek. Bu amaçla, haftada bir yayınlanacak görsel derslerimiz ile hedefe ulaşmaya çalışıyor olacağız. Hedefimiz 24 derse ulaşabilmek ancak en az 18 dersin olacağını şimdiden ifade edebilirim. Tabi ki ilk bölüm çok basit bir Hello World uygulamasını içeriyor olacak. Ancak ilerleyen zamanlarda daha da derinlere inmeye başlıyor olacağız(İçeriğimizde çok sıkı konuların yer aldığını şimdiden ifade etmek isterim). Workflow Foundation tarafında uygulama geliştirmeye başlamak isteyenler için faydalı bir çalışma olacağını ümit ediyorum.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f4%2fEntry_Logo.png" alt="" width="250" height="187" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bundan bir ka&amp;ccedil; yıl(tam olarak &lt;strong&gt;16 Mart 2004&lt;/strong&gt;) &amp;ouml;nce &lt;strong&gt;Java&lt;/strong&gt; programlama dilini &amp;ouml;ğrenmeye &amp;ccedil;alışırken, bunu bir yazı dizisi ile eş zamanlı hale getirmeye &amp;ccedil;alışmış ve edit&amp;ouml;rl&amp;uuml;ğ&amp;uuml;n&amp;uuml; yaptığım &lt;a title="C#Nedir?" href="http://www.csharpnedir.com" target="_blank"&gt;C#Nedir?&lt;/a&gt; topluluğunda yayınlamaya başlamıştım. &lt;a title="Java ile 24 Kahve Molası" href="http://www.bsenyurt.com/Java24.aspx" target="_blank"&gt;"Java ile 24 Kahve Molası"&lt;/a&gt; isimli bu seride yer alan her makalede, başımdan ge&amp;ccedil;enleri anlatıyor ve tecr&amp;uuml;belerimi paylaşıyordum.&lt;/p&gt;
&lt;p&gt;Artık buna benzer bir seriye daha başlamanın zamanı geldi. Bu kez, &lt;a title="NedirTv?" href="http://www.nedirtv.com" target="_blank"&gt;NedirTv?com&lt;/a&gt; sponsorluğunda ve kurucusu &lt;a title="Uğur Umutluoğlu Kişisel Blog" href="http://www.umutluoglu.com/" target="_blank"&gt;Uğur Umutluoğlu&lt;/a&gt;' nun &lt;strong&gt;(MVP - Asp.Net)&lt;/strong&gt; desteğinde, kısa g&amp;ouml;rsel derslerden oluşan yeni bir seri ile karşınızdayız. İlk serimizin adı &lt;a title="Workflow Foundation &amp;Ouml;ğreniyorum" href="http://www.nedirtv.com/kategori/Workflow-Foundation-Ogreniyorum.aspx" target="_blank"&gt;&lt;strong&gt;"Workflow Foundation 4.0 &amp;Ouml;ğreniyorum"&lt;/strong&gt;&lt;/a&gt;. Bu da şu anlama geliyor. Başka serilerde olacak &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Workflow Foundation &amp;Ouml;ğreniyorum&lt;/strong&gt; isimli serideki amacımız,&lt;strong&gt; Workflow Foundation&lt;/strong&gt; konusunu &lt;strong&gt;başlangı&amp;ccedil; seviyesinden, orta seviyeye kadar&lt;/strong&gt; incelemek ve &amp;ouml;ğrenmek. Bu ama&amp;ccedil;la, haftada bir yayınlanacak g&amp;ouml;rsel derslerimiz ile hedefe ulaşmaya &amp;ccedil;alışıyor olacağız. Hedefimiz 24 derse ulaşabilmek ancak en az 18 dersin olacağını şimdiden ifade edebilirim. Tabi ki ilk b&amp;ouml;l&amp;uuml;m &amp;ccedil;ok basit bir Hello World uygulamasını i&amp;ccedil;eriyor olacak. Ancak ilerleyen zamanlarda daha da derinlere inmeye başlıyor olacağız&lt;em&gt;(İ&amp;ccedil;eriğimizde &amp;ccedil;ok sıkı konuların yer aldığını şimdiden ifade etmek isterim)&lt;/em&gt;. &lt;strong&gt;Workflow Foundation &lt;/strong&gt;tarafında uygulama geliştirmeye başlamak isteyenler i&amp;ccedil;in faydalı bir &amp;ccedil;alışma olacağını &amp;uuml;mit ediyorum.&lt;/p&gt;
&lt;p&gt;Elbette &amp;ccedil;ekimler sırasında dilimizin s&amp;uuml;r&amp;ccedil;t&amp;uuml;ğ&amp;uuml; noktalar olabilir. &lt;strong&gt;Her ne kadar s&amp;uuml;r&amp;ccedil;&amp;uuml; lisan ettiysek affola&lt;/strong&gt; diyerek sizleri ilk g&amp;ouml;rsel dersimizle baş başa bırakıyorum.&lt;/p&gt;
&lt;p&gt;&lt;iframe src="https://www.youtube.com/embed/8DM8NHPyQUk" width="420" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;&lt;a title="Ders 0 - Hello World" href="http://www.nedirtv.com/video/Ders-0---Hello-World.aspx" target="_blank"&gt;Ders 0 - Hello World&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;S&amp;uuml;re : 09:55&lt;/p&gt;
&lt;p&gt;Dosya Boyutu : 12.1 Mb&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek &lt;a href="/pics/2010%2f4%2fLesson0.rar"&gt;Lesson0.rar (34,74 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2010-04-19 21:55:00</pubDate>
  <slug>Workflow-Foundation-Ogreniyorum-Basladi-Ders-0-Hello-World</slug>
  <tags>
    <tag>workflow-foundation-40</tag>
    <tag>workflow-foundation</tag>
    <tag>visual-studio-2010</tag>
  </tags>
  <categories>
    <category>Workflow Foundation Öğreniyorum</category>
  </categories>
</post>