<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Business Delegate Pattern</title>
  <description>Epey zamandır tasarım kalıpları tarafına bakmadığımı fark ettim. Hem kalıpları tekrar etmek hem de yeni bir şeyler var mı diye internette gezinirken JEE tarafında sıklıkla başvurulan Business Delegate isimli bir desene rastladım. Aslında delegate dediğimiz zaman bir işi başkasına devrettiğimizi düşünebiliriz (Delegasyon ile ilgili olarak internette resim ararken de işte yandaki gibi eğlenceli bir tanesine rastladım) Business Delegate kalıbı temel olarak sunum katmanı(presentation layer) ile iş katmanını(Business Layer) arasındaki iletişimde aynı isimli fonksiyonların ele alınmasında değerlendiriliyor. Zaten adından da anlaşılacağı üzere sunum katmanındaki bir fonksiyonelliğin asıl iş katmanındaki karşılığına devredilmesi söz konusu. Burada önemli noktalardan birisi talebi olan nesnenin talep ile ilgili içeriği(Context diyebiliriz) aynen ikinci bir nesneye delege etmesidir.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2016/05/Bdpattern_4.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Epey zamandır tasarım kalıpları tarafına bakmadığımı fark ettim. Hem kalıpları tekrar etmek hem de yeni bir şeyler var mı diye internette gezinirken &lt;strong&gt;JEE&amp;nbsp;&lt;/strong&gt;tarafında sıklıkla başvurulan &lt;strong&gt;Business Delegate&lt;/strong&gt; isimli bir desene rastladım. Aslında delegate dediğimiz zaman bir işi başkasına devrettiğimizi d&amp;uuml;ş&amp;uuml;nebiliriz &lt;em&gt;(Delegasyon ile ilgili olarak internette resim ararken de işte yandaki gibi eğlenceli bir tanesine rastladım)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Normal şartlarda standart olarak kabul g&amp;ouml;ren &lt;strong&gt;Gangs of Four&lt;/strong&gt;&lt;em&gt;(Erich Gamma, Richard Helm, Ralph Johnson ve John Vlissides)&lt;/em&gt; desenlerinde yer almıyor ancak genel yazılım tasarım kalıpları i&amp;ccedil;erisinde yer verilmiş.&amp;nbsp;&lt;em&gt;(T&amp;uuml;m deseneler ile ilişkili olarak &lt;a href="https://en.wikipedia.org/wiki/Design_Patterns" target="_blank"&gt;Wikipedia adresine&lt;/a&gt;&amp;nbsp;giderseniz diğer desenler kısmında yer aldığını g&amp;ouml;rebilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;GoF un tanımladığı tasarım desneleri haricinde literat&amp;uuml;re giren farklı kalıplar da bulunuyor. Bu tip kalıpları araştırmak, hangi problemelere &amp;ccedil;&amp;ouml;z&amp;uuml;m olarak ele alındıklarını &amp;ouml;ğrenmek, kişisel gelişim a&amp;ccedil;ısından &amp;ouml;nemli.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;Business Delegate&lt;/strong&gt; kalıbı&amp;nbsp;temel olarak &lt;strong&gt;sunum katmanı&lt;em&gt;(presentation layer)&lt;/em&gt;&lt;/strong&gt; ile &lt;strong&gt;iş katmanını&lt;em&gt;(Business Layer)&lt;/em&gt;&lt;/strong&gt; arasındaki iletişimde aynı isimli fonksiyonların ele alınmasında değerlendiriliyor. Zaten adından da anlaşılacağı &amp;uuml;zere sunum katmanındaki bir fonksiyonelliğin asıl iş katmanındaki karşılığına devredilmesi&amp;nbsp;s&amp;ouml;z konusu. Burada &amp;ouml;nemli noktalardan birisi talebi olan nesnenin talep ile ilgili &lt;strong&gt;i&amp;ccedil;eriği&lt;em&gt;&lt;strong&gt;(&lt;/strong&gt;Context diyebiliriz)&lt;/em&gt;&lt;/strong&gt; aynen ikinci bir nesneye delege etmesidir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Teorik olarak aşağıdaki gibi bir &amp;ccedil;izelge&amp;nbsp;desenin kullanımı ile ilişkili bir ipucu verebilir. Aslında Adapter ve Bridge&amp;nbsp;tasarım kalıpları da tercih edilir. Kullanım alanı olarak .Net tarafındaki &lt;strong&gt;asenkron tabanlı&lt;em&gt;(async-based)&lt;/em&gt;&lt;/strong&gt;&amp;nbsp;programlama ihtiya&amp;ccedil;larında kullanılabilir&lt;em&gt;(&amp;Ouml;rneğin bir servis &amp;ccedil;ağrısının asenkron olarak ger&amp;ccedil;ekleştirilmesi ve işlemin tamamlanmasını takiben geriye d&amp;ouml;nen &lt;strong&gt;Task&lt;/strong&gt;'ın işaret ettiği fonksiyonun &amp;ccedil;ağırılması)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/05/Bdpattern_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Temel olarak desende yer alan akt&amp;ouml;rler ş&amp;ouml;yledir.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Caller(Client) :&lt;/strong&gt; Talep edilen metod &amp;ccedil;ağrısını ger&amp;ccedil;ekleştiren asıl nesne olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Aray&amp;uuml;z tarafındaki bir kod par&amp;ccedil;ası olabilir. Sunum katmanında yer alır.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Business Delegate :&lt;/strong&gt; Talepte bulunan nesne &amp;ccedil;ağrılarının&amp;nbsp;asıl iş servisi metodlarına ge&amp;ccedil;işisini sağlayan temsilcidir. Genellikle tek bir giriş noktası&lt;em&gt;(endPoint olarak isimlendirelim)&lt;/em&gt; sunar.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;LookUp Service :&lt;/strong&gt; İlişkili iş nesnelerinin &amp;uuml;retiminden sorumludur. &amp;Ccedil;oğunlukla dışarıdan verilen bilgiye g&amp;ouml;re &lt;strong&gt;Business Service Interface&lt;/strong&gt; t&amp;uuml;revli bir nesnenin &amp;uuml;retimini ger&amp;ccedil;ekleştirir&amp;nbsp;&lt;em&gt;(&lt;strong&gt;Service Locator&lt;/strong&gt; gibi de&amp;nbsp;d&amp;uuml;ş&amp;uuml;nebiliriz)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Business Service Interface&lt;/strong&gt; : Asıl iş fonksiyonelliklerini bulunduran sınıfların şema tanımlamasını i&amp;ccedil;eren &lt;strong&gt;aray&amp;uuml;zd&amp;uuml;r&lt;em&gt;(Interface)&lt;/em&gt;&lt;/strong&gt;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Şimdi basit bir &amp;ouml;rnek ile bu deseni incelemeye &amp;ccedil;alışalım. Aşağıdaki sınıf &amp;ccedil;izelgesinde yer alan tiplerin yer aldığı &lt;strong&gt;Console&lt;/strong&gt;&amp;nbsp;uygulamasını geliştirerek&amp;nbsp;ilerleyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/05/Bdpattern_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace TheBusinessDelegatePattern
{
    class Program
    {
        static void Main(string[] args)
        {
            BusinessMessagingDelegate bsnDelegate = new BusinessMessagingDelegate();
            bsnDelegate.ServiceType = "SMS";

            Caller client = new Caller(bsnDelegate);
            string smsMesssage = "Son 4 hanesi 1111 olan kartınız d&amp;ouml;nem borcu -1000 Liradır. Bu kez &amp;ouml;deme bizden.";
            string emailMessage = "Son 4 hanesi 1111 olan kartınızı d&amp;ouml;nem ekstresi ektedir. A&amp;ccedil;ınız şaşırınız.";
            client.Do(smsMesssage);

            bsnDelegate.ServiceType = "EMAIL";
            client.Do(emailMessage);
        }
    }

    public interface IMessagingService
    {
        void SendMessage(string message);
    }

    public class SMSMessagingService
    : IMessagingService
    {
        public void SendMessage(string message)
        {
            Console.WriteLine(message);
        }
    }

    public class MailMessagingService
    : IMessagingService
    {
        public void SendMessage(string message)
        {
            Console.WriteLine(message);
        }
    }

    public class BusinessServiceLookUp
    {
        public IMessagingService GetBusinessService(String serviceType)
        {
            if (serviceType.Equals("SMS"))
            {
                return new SMSMessagingService();
            }
            else
            {
                return new MailMessagingService();
            }
        }
    }

    public class BusinessMessagingDelegate
    {
        BusinessServiceLookUp lookupService = new BusinessServiceLookUp();
        IMessagingService businessService;
        public string ServiceType { get; set; }

        public void Do(string message)
        {
            businessService = lookupService.GetBusinessService(ServiceType);
            businessService.SendMessage(message);
        }
    }

    public class Caller
    {
        BusinessMessagingDelegate _businessService;

        public Caller(BusinessMessagingDelegate businessService)
        {
            _businessService = businessService;
        }

        public void Do(string message)
        {
            _businessService.Do(message);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Dilerseniz kodda neler yaptığımızı kısace değinelim. Temel olarak &lt;strong&gt;SMS&lt;/strong&gt; ve &lt;strong&gt;EMail&lt;/strong&gt; g&amp;ouml;nderim işlemlerinin ele alındığını mesajlaşma hizmetleri s&amp;ouml;z konusu. &lt;strong&gt;SMSMessagingService&lt;/strong&gt; ve &lt;strong&gt;MailMessagingService&lt;/strong&gt; sınıflarının ortak &amp;ouml;zelliği &lt;strong&gt;IMessagingService&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;nden t&amp;uuml;remiş olmaları. Bu sınıfların iş katmanındaki asıl tipler olduğunu varsayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Caller&lt;/strong&gt; sınıfı talepte bulunan aray&amp;uuml;z nesnes kullanıcısı olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Aray&amp;uuml;z katmanında olduğunu varsaydığımız bu tipin &amp;ouml;nemli kabiliyetlerinden&amp;nbsp;birisi, hangi iş hizmetini kullanacağını bilmesidir. Bunun i&amp;ccedil;in &lt;strong&gt;yapıcı metoduna&lt;em&gt;(Constructor)&lt;/em&gt; &lt;/strong&gt;parametre olarak gelen &lt;strong&gt;BusinessMessagingDeletage&lt;/strong&gt; tipinden yararlanır. Bu tipin &lt;strong&gt;ServiceType&lt;/strong&gt; &amp;ouml;zelliği, delegasyonun yapılacağı iş biriminin &amp;uuml;retiminde kullanılır. &amp;Uuml;retim aşamasında ise&amp;nbsp;&lt;strong&gt;BusinessServiceLookUp&lt;/strong&gt; isimli sınıf&amp;nbsp;devreye girmekte ve &lt;strong&gt;BusinessMessageDelegate&lt;/strong&gt; sınıfının &lt;strong&gt;ServiceType&lt;/strong&gt; &amp;ouml;zelliğine g&amp;ouml;re bir &lt;strong&gt;IMessagingService&lt;/strong&gt;&amp;nbsp;uyumlu&amp;nbsp;referansı kullanımı i&amp;ccedil;in vermektedir.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alışan program kodunda &lt;strong&gt;Caller&lt;/strong&gt; nesne &amp;ouml;rneği &amp;uuml;zerinden &lt;strong&gt;Do&lt;/strong&gt; metoduna ger&amp;ccedil;ekleştirilen iki farklı &amp;ccedil;ağrı s&amp;ouml;z konusudur. Kod temsilcinin &amp;uuml;retim bi&amp;ccedil;imine g&amp;ouml;re uygun olan iş birimi hizmetine y&amp;ouml;nlenir. Kodun &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/05/Bdpattern_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Pek tabii ger&amp;ccedil;ek hayat senaryolarında asıl iş birimi metodlarının &lt;strong&gt;string&lt;/strong&gt; parametre yerine bir i&amp;ccedil;erik tipi ile&lt;em&gt;(&amp;ouml;rneğin &lt;strong&gt;Context&lt;/strong&gt; isimli bir sınıf)&lt;/em&gt; &amp;ccedil;alışması ve geriye bir referans d&amp;ouml;nd&amp;uuml;rmesi muhtemeldir. Hatta bu tipler genellikle sunum ve iş katmanı arasında hareket eden transfer nesneleri de olabilir.&lt;/p&gt;
&lt;p&gt;Bu yazımızda&amp;nbsp;pek g&amp;ouml;z &amp;ouml;n&amp;uuml;nde olmayan tasarım kalıplarından birisine değinmeye &amp;ccedil;alıştık. Bir başka makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-05-02 06:00:00</pubDate>
  <slug>business-delegate-pattern</slug>
  <tags>
    <tag>design-patterns</tag>
    <tag>software-design-patterns</tag>
    <tag>gof</tag>
    <tag>service-locator</tag>
    <tag>interface</tag>
    <tag>inheritance</tag>
    <tag>bridge</tag>
    <tag>adapter</tag>
    <tag>c#</tag>
  </tags>
  <categories>
    <category>Tasarım Kalıpları(Design Patterns)</category>
  </categories>
</post>