<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Using İfadesi ile Garanti Dispose</title>
  <description>Bellek yönetimi özellikle büyük çaplı projelerde performans kazanımı açısından çok önemlidir. Günümüz sistemlerinin yüksek Ram kapasitesine sahip oldukları göz önüne alındığında bu durum çoğu zaman göz ardı edilmektedir. Ancak sayısız kullanıcının bağlandığı sunucu(server) sistemleri üzerinde çalışan windows veya web servisleri gibi uygulamalar göz önüne alındığında bellek sorunları ile her zaman için karşılaşılma olasılığı vardır.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bellek y&amp;ouml;netimi &amp;ouml;zellikle b&amp;uuml;y&amp;uuml;k &amp;ccedil;aplı projelerde performans kazanımı a&amp;ccedil;ısından &amp;ccedil;ok &amp;ouml;nemlidir. G&amp;uuml;n&amp;uuml;m&amp;uuml;z sistemlerinin y&amp;uuml;ksek Ram kapasitesine sahip oldukları g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında bu durum &amp;ccedil;oğu zaman g&amp;ouml;z ardı edilmektedir. Ancak sayısız kullanıcının bağlandığı sunucu(server) sistemleri &amp;uuml;zerinde &amp;ccedil;alışan windows veya web servisleri gibi uygulamalar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında bellek sorunları ile her zaman i&amp;ccedil;in karşılaşılma olasılığı vardır.&lt;/p&gt;
&lt;p&gt;Bildiğiniz gibi .Net ağırlıklı olarak y&amp;ouml;netimli kodu (managed code) desteklemektedir. CLR (Common Language RunTime - Ortak Dil &amp;Ccedil;alışma Zamanı), yazmış olduğumuz uygulamarı &amp;ccedil;alıştırmaktan, kaynakları y&amp;ouml;netmekten ve sonlandırmaktan sorumlu bir ortam olarak bu y&amp;ouml;netim işini &amp;uuml;stlenmiştir. CLR i&amp;ccedil;erisinde istisna y&amp;ouml;netimi, tip g&amp;uuml;venliği gibi &amp;ccedil;eşitli kontrol ve y&amp;ouml;netim mekanizmaları vardır. Bunlardan belkide en &amp;ouml;nemlisi (uygulama geliştiricileri &amp;ouml;zellikle C++' tan gelenleri bir nebze olsun rahatlatan) GC (Garbage Collector- &amp;Ccedil;&amp;ouml;p Toplayıcı) mekanizmasıdır. GC, kapsama alanı (scope) dışına &amp;ccedil;ıkan referans tiplerinin bellekten atılması g&amp;ouml;revini &amp;uuml;stlenir. Oysaki C++ ile geliştirilen uygulamalarda, nesnelerin bellekten atılması elle yapılmak zorundadır. Dolayısıyla GC uygulama geliştiricilere b&amp;uuml;y&amp;uuml;k avantaj sağlar.&lt;/p&gt;
&lt;p&gt;GC' nin sağlamış olduğu y&amp;ouml;netim mekanizması her ne kadar avantajlı g&amp;ouml;z&amp;uuml;ksede uygulamaların performansı a&amp;ccedil;ısından dikkat edilmesi gereken bir nokta vardır. GC işleri biten referans t&amp;uuml;rlerini bellekten anında atmaz. Bu atılma s&amp;uuml;resi genelde belirsizdir ve nesnenin kendisinin bağlı olduğu başka referanslara veya nesnenin i&amp;ccedil;inde bulunduğu kapsama alanının (scope) yaşam s&amp;uuml;resine g&amp;ouml;re değişmektedir. Bahsi ge&amp;ccedil;en s&amp;uuml;reler, &amp;ouml;zellikle birbirlerine bağlı referans t&amp;uuml;rlerinin &amp;ccedil;ok fazla sayıda kullanıldığı sunucu uygulamalarında belleğin gereksiz yere şismesine neden olmaktadır. (Hatta ben geliştirmiş olduğumuz bir projede OutOfMemoryException hatasını g&amp;ouml;rebildiğimi s&amp;ouml;yleyebilirim.) Aslında bu durumu anlayabilmek i&amp;ccedil;in bellek &amp;uuml;zerinde referans tiplerinin tutuluşunu ve GC tarafından sistemden kaldırılışını &amp;ccedil;ok basit seviyede d&amp;uuml;ş&amp;uuml;nmek gerekir. Aşağıdaki senaryoda basit olarak bu durum incelenmeye &amp;ccedil;alışılmaktadır.&lt;/p&gt;
&lt;p&gt;Bir uygulamamız olduğunu ve uygulama kodlarının &amp;ccedil;alışma zamanında 3 farklı nesneyi oluşturduğunu d&amp;uuml;ş&amp;uuml;nelim. Bu nesne &amp;ouml;rnekleri bizim kendi oluşturduğumuz tiplere ait olabileceği gibi FCL (Framework Class Library) i&amp;ccedil;erisinde yer alan tiplerden de olabilir. Burada &amp;ouml;nemli olan bunların referans t&amp;uuml;r&amp;uuml;nden olmaları ve new operat&amp;ouml;r&amp;uuml; ile oluşturulmalarıdır. Bildiğiniz gibi referans t&amp;uuml;rleri belleğin heap adı verilen b&amp;ouml;lgesinde tutulmaktadır. Bu durumda belleğin heap b&amp;ouml;lgesindeki yerleşim aşağıdakine benzer bir yapıda farzedilebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk136_1.gif" alt="" width="564" height="78" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada nesnelerin arka arkaya dizildiğini g&amp;ouml;r&amp;uuml;yorsunuz. &amp;Ccedil;oğu zaman uygulamalarımızda nesneler ile işimiz bittiğinde (&amp;ouml;zellikle kendi yazdığımız sınıflara ait nesneler ile işimiz bittiğinde ) bu nesneye ait kaynakları serbest bırakmak amacıyla null değer atamasına başvururuz. Nesne &amp;ouml;rneğine null değer atanması aslında o nesneye izleyen kod satırlarında erişilememesini garanti eden bir durumdur. Peki ya bu nesneye ait bellek kaynakları ger&amp;ccedil;ekten ne zaman serbest kalacaktır. Senaryomuza geri d&amp;ouml;nelim. Null değer ataması yaptığımızda bellek g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml;nde herhangibibir değişiklik olmaz. Sadece Y Nesnesi artık erişilebilir konumda değildir &amp;ccedil;&amp;uuml;nk&amp;uuml; onu işaret eden adresleme artık mevcut değildir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk136_2.gif" alt="" width="564" height="109" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şu noktada yeni bir nesne &amp;ouml;rneğini daha oluşturduğumuzu d&amp;uuml;ş&amp;uuml;nelim. Aslında oluşturmaya &amp;ccedil;alıştığımızı d&amp;uuml;ş&amp;uuml;n&amp;uuml;rsek daha iyi olur. &amp;Ouml;rneğin Q nesnemizin aşağıdaki gibi bellekte konumlanacağını farzedelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk136_3.gif" alt="" width="638" height="106" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada Q nesnemizin boyutunun, belleğin sınırlarını aştığını temsil etmeye &amp;ccedil;alışıyoruz. Bu OutOfMemoryException' a yol a&amp;ccedil;abilecek bir durumdur. Neyseki Garbage Collector (Artık Toplayıcı) durum bu noktaya gelmeden &amp;ouml;nce devreye girererek managed code i&amp;ccedil;erisinde &amp;ccedil;alışmakta olan referans t&amp;uuml;rlerini g&amp;ouml;zden ge&amp;ccedil;irir ve uzun s&amp;uuml;redir kullanılmayan nesnelerin olup olmadığını devamlı suretle kontrol eder. Bu senaryoya g&amp;ouml;re ilk yapacağı iş null ataması yapılmış nesneyi bulmak ve bellekteki adreslemeleri yeniden d&amp;uuml;zenleyerek yer tahsislerini kaydırmaktır. Sonu&amp;ccedil; olarak belleğin yeni g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml; aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk136_4.gif" alt="" width="618" height="81" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu durum kapsama alanından &amp;ccedil;ıkan her nesne i&amp;ccedil;in ge&amp;ccedil;erlidir. Kısacası,&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;GC, kapsama alanı dışına &amp;ccedil;ıkmış olan nesnelere ait kaynakları hemen serbest bırakmaz. Bu serbest bırakma s&amp;uuml;resi genellikle belli değildir. S&amp;uuml;renin belirsiz oluşu ve gereksiz nesneler toplanıncaya kadar bellekte kalarak adres alanı işgal ediyor olmaları sistemin yavaşlamasına neden olur.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Elbetteki GC' nin yaptığı işi k&amp;uuml;&amp;ccedil;&amp;uuml;mseyemeyiz. Bellekteki kullanım dışı kalmış nesnelerin bir mekanizma sayesinde otomatik olarak sistemden kaldırılması ger&amp;ccedil;ekten işimizi kolaylaştırmaktadır. Ancak yukarıdaki gibi bir senaryoyu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda bellek &amp;uuml;zerindeki nesnelere ait yapılan yer değiştirmeler uygulamanın yavaşlamasına neden olacaktır. İşte bu y&amp;uuml;zden kullandığımız nesneler ile ilgili işimiz bittiğinde onlara ait bellek kaynaklarının kesin olarak serbest bırakılmasını sağlamak isteyebiliriz. Bu noktada IDisposable aray&amp;uuml;z&amp;uuml;nden t&amp;uuml;remiş nesnelerin Dispose metodlarını kullanabiliriz. Dispose metodunda gerekli kodlamaları yaparak ilgili nesnenin anında bellekten atılmasını sağlayabiliriz.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bir nesne &amp;uuml;zerinde Dispose metodunu kullanabilmek i&amp;ccedil;in, bu nesnenin IDisposable aray&amp;uuml;z&amp;uuml;n&amp;uuml; mutlaka implemente etmesi gerekmektedir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;FCL i&amp;ccedil;erisinde yer alan sayısız nesne IDisposable aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamaktadır. Bu nesneleri using ifadesi ile veya try-catch-finally bloğunun uygulandığı desenler yarıdımıyla bellekten daha kısa s&amp;uuml;rede atabiliriz. İlk olarak try-catch-finally bloğu ile bu işi nasıl ger&amp;ccedil;ekleştirebileceğimize bakalım. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;ası, basit olarak bir referans tipinin işi bittiğinde derhal bellekten atılmasının nasıl sağlanacağını g&amp;ouml;stermektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.Data.SqlClient;

namespace InvestigateForDispose
{
    class AnaProgram
    {
        static void Main(string[] args)
        {
            SqlCommand cmd=null;
            SqlConnection con=null;
            try
            {
                con=new SqlConnection("data source=localhost;database=AdventureWorks2000;user id=sa;password=");
                cmd=new SqlCommand("SELECT TOP 1 * FROM Customer",con);
                con.Open(); 
                cmd.ExecuteNonQuery();
            }
            catch(SqlException exp)
            {
                Console.WriteLine(exp.Message);
            }
            finally
            {
                con.Dispose();
                cmd.Dispose();
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Finally blokları try bloğunda yer alan kodlarda istisna fırlatılmasına neden olacak hatalar olsa da olmasa da devreye girer. Bu sebeple serbest bırakılacak nesneler i&amp;ccedil;in Dispose metodlarını &amp;ccedil;ağıracağımız en uygun yer finally bloklarıdır. Yukarıdaki &amp;ouml;rnekte yer alan SqlConnection ve SqlCommand, IDisposable aray&amp;uuml;z&amp;uuml;n&amp;uuml; implemente eden sınıflardır. Bu sebepten Dispose metodları mevcuttur. Yukarıdaki desenin sağladığı işlevselliğin aynısını using ifadesi ile de ger&amp;ccedil;ekleştirebiliriz. Aşağıdaki kod par&amp;ccedil;ası yukarıdaki &amp;ouml;rneğin using ifadeleri ile nasıl kodlandığını g&amp;ouml;stermektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using(SqlConnection con=new SqlConnection("data source=localhost;database=AdventureWorks2000;user id=sa;password="))
{
    using(SqlCommand cmd=new SqlCommand("SELECT TOP 1 * FROM Customer",con))
    {
        con.Open();
        cmd.ExecuteNonQuery();
    }
}&lt;/pre&gt;
&lt;p&gt;Using bloğunun yazımı try-catch-finally desenine g&amp;ouml;re daha kolaydır. Aslında Using bloğuda bir nevi try-finally bloğudur. Bu durumu daha iyi anlayabilmek i&amp;ccedil;in using ifadesinin MSIL (Microsoft Intermediate Language) koduna bakmakta fayda var. ILDASM aracı ile uygulamamızın Main metodundaki kodlara baktığımızda aslında Dispose işlemi i&amp;ccedil;in try-finally bloklarının uygulandığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bir başka deyişle using ifademiz IL kodu i&amp;ccedil;erisinde try-finally bloğuna d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lm&amp;uuml;şt&amp;uuml;r.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;.method private hidebysig static void Main(string[] args) cil managed
{
    .entrypoint
    // Code size 61 (0x3d)
    .maxstack 3
    .locals ([0] class [System.Data]System.Data.SqlClient.SqlConnection con,
    [1] class [System.Data]System.Data.SqlClient.SqlCommand cmd)
    IL_0000: ldstr "data source=localhost;database=AdventureWorks2000;"
    + "user id=sa;password="
    IL_0005: newobj instance void [System.Data]System.Data.SqlClient.SqlConnection::.ctor(string)
    IL_000a: stloc.0
    .try
    {
        IL_000b: ldstr "SELECT TOP 1 * FROM Customer"
        IL_0010: ldloc.0
        IL_0011: newobj instance void [System.Data]System.Data.SqlClient.SqlCommand::.ctor(string,
        class [System.Data]System.Data.SqlClient.SqlConnection)
        IL_0016: stloc.1
        .try
        {
            IL_0017: ldloc.0
            IL_0018: callvirt instance void [System.Data]System.Data.SqlClient.SqlConnection::Open()
            IL_001d: ldloc.1
            IL_001e: callvirt instance int32 [System.Data]System.Data.SqlClient.SqlCommand::ExecuteNonQuery()
            IL_0023: pop
            IL_0024: leave.s IL_0030
        } // end .try
        finally
        {
            IL_0026: ldloc.1
            IL_0027: brfalse.s IL_002f
            IL_0029: ldloc.1
            IL_002a: callvirt instance void [mscorlib]System.IDisposable::Dispose()
            IL_002f: endfinally
        } // end handler
        IL_0030: leave.s IL_003c
    } // end .try
    finally
    {
        IL_0032: ldloc.0
        IL_0033: brfalse.s IL_003b
        IL_0035: ldloc.0
        IL_0036: callvirt instance void [mscorlib]System.IDisposable::Dispose()
        IL_003b: endfinally
    } // end handler
    IL_003c: ret
} // end of method AnaProgram::Main&lt;/pre&gt;
&lt;p&gt;Biz uygulamamızda i&amp;ccedil; i&amp;ccedil;e iki using bloğu kullandığımızdan, uygulamanın IL kodunda i&amp;ccedil; i&amp;ccedil;e ge&amp;ccedil;miş iki try-finally bloğu yer almaktadır. Dikkat ettiyseniz finally bloklarında SqlConnection ve SqlCommand nesnelerine ait Dispose metodları &amp;ccedil;ağırılmıştır. Eğer IDisposable aray&amp;uuml;z&amp;uuml;n&amp;uuml; implemente etmemiş bir nesne &amp;ouml;rneği i&amp;ccedil;in using veya try-catch-finally desenini kullanırsak derleme zamanı hatası alırız.&lt;/p&gt;
&lt;p&gt;Using bloğu i&amp;ccedil;in aşağıdaki hata alınır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk136_6.gif" alt="" width="492" height="516" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Try-catch-finally deseninde de zaten Nesne &amp;uuml;zerinden erişebileceğimiz bir Dispose metodu yoktur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk136_7.gif" alt="" width="376" height="438" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında bu gibi durumlarda using bloğunda kullanılacak nesnenin IDisposable aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulayıp uygulamadığını bilmek ve buna g&amp;ouml;re davranmak olduk&amp;ccedil;a etkili bir yaklaşım olabilir.&lt;/p&gt;
&lt;p&gt;Peki kendi sınıflarımıza Dispose yeteneğini nasıl kazandırabiliriz? Bunun i&amp;ccedil;in sınıfımıza IDisposable aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygularız. IDisposable aray&amp;uuml;z&amp;uuml; sadece Dispose metoduna ilişkin bir bildirim i&amp;ccedil;erir. Sınıfın Dispose metodunda managed ve unmanaged kaynaklar i&amp;ccedil;in gerekli yoketme işlemlerini ger&amp;ccedil;ekleştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class VeriYonetim:IDisposable
{
    public VeriYonetim()
    {}
    public void Baglan()
    {}

    #region IDisposable Members

    public void Dispose()
    {
        // Managed ve Unmanaged kaynakların serbest bırakılması.
    }
    
    #endregion
}
class AnaProgram
{
    static void Main(string[] args)
    {
        using(VeriYonetim vy=new VeriYonetim())
        {
            // Bir takım işlemler
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Disposable nesnelerin kullanımında dikkat edilmesi gereken bir nokta daha vardır. Bazı durumlarda, nesne &amp;ouml;rneklerimiz unmanaged (y&amp;ouml;netilmeyen) referanslara sahip olabilirler. Bu tip unmanaged referanslar s&amp;ouml;z konusu olduğunda bunların a&amp;ccedil;ık bir şekilde sonlandırılmaları gerekir. Bu bir nesnenin yaşam d&amp;uuml;zeni ile ilgilidir. &amp;Ouml;yleki bir nesne heap b&amp;ouml;lgesinde ge&amp;ccedil;irdiği zaman s&amp;uuml;resi boyunca aşağıdaki şekilde tasvir edilen evrelerden ge&amp;ccedil;er.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk136_5.gif" alt="" width="339" height="395" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Her nesne &amp;ouml;nce oluşturulur. &amp;Ccedil;oğunlukla new operat&amp;ouml;r&amp;uuml; ile ger&amp;ccedil;ekleştirilen bu işlemin ardından nesne uygulama i&amp;ccedil;erisinde kullanılır. Kullanım sona erdiğinde ve nesne scope (kapsama alanı) dışına &amp;ccedil;ıktığında kullanılamaz hale gelir. Bu makalenin başında belirttiğimiz gibi nesneye ait kaynakların serbest bırakılması anlamına gelmez. Sadece referans yok edilmiştir. Daha sonra nesnemiz sonlandırılabilir hale gelir ve nesne &amp;ouml;mr&amp;uuml; sonlandırılır. Sonlandırma işleminde genellikle nesne i&amp;ccedil;erisinde var olan unmanaged referansların bellekten atılması işlemi ger&amp;ccedil;ekleştirilir. Nihayetinde sonlandırılmış nesneye ait bellek b&amp;ouml;lgeleri serbest bırakılır. İşte biz Dispose metodunu ve SuppressFinalize metodunu kullanarak sonlandırma aşamasını otomatik olarak atlayabilir ve nesneye ait kaynakların iade edilmesini sağlayabiliriz. &lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bir nesnenin referans ettiği unmanaged kaynakları yok etmek i&amp;ccedil;in ya Dispose metodunun i&amp;ccedil;eriği kullanılır ya da sınıfa ait destructor(yokedici) metod i&amp;ccedil;erisinde bu yok etme işlemi ger&amp;ccedil;ekleştiriliz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Peki b&amp;ouml;yle bir imkan var ise neden sonlandırma s&amp;uuml;reci s&amp;ouml;z konusudur? Managed olarak oluşturulmuş nesneler GC kontrol&amp;uuml;nde yok edilirler. Ancak i&amp;ccedil;erisinde unmanaged referanslar var ise, bu referansların a&amp;ccedil;ık&amp;ccedil;a yok edilmeleri bir başka deyişle kaynaklarının serbest bırakılmaları gerekir. Oysaki GC bu işlemin nasıl yapılabileceğini tahmin edemez. Bu tarz durumlarda unmanaged referanslara ait kaynakları serbest bırakmak i&amp;ccedil;in nesnelerin destructor metodlarından faydalanılabilir.&lt;/p&gt;
&lt;p&gt;Diğer yandan her nesne i&amp;ccedil;in GC tarafından y&amp;ouml;netilen bir sonlandırma kuyruğu(finalizable queue) s&amp;ouml;z konusudur. Bu kuyruk finalize edilebilir nesneleri tutan bir koleksiyondur. GC oluşturulan nesneler i&amp;ccedil;in buraya giriş yapar ve nesne sonlandırma s&amp;uuml;recine girdiğinde ilgili sonlandırma işlemini uygulayacağı nesne bilgilerini almak i&amp;ccedil;in yine bu kuyruğu kullanır. Eğer ki Dispose etmek istediğimiz nesnenin unmanaged referansları varsa bunlarıda dispose işlemi ile birlikte anında serbest bırakmak i&amp;ccedil;in GC sınıfının SuppressFinalize metodu kullanılabilir.&lt;/p&gt;
&lt;p&gt;Bu koşullar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında &amp;ccedil;oğunlukla kullanılan bir desen vardır. Bu desende hem IDisposable aray&amp;uuml;z&amp;uuml; implemente edilir hemde sınıfa ait desctructor (yokedici) metod kullanılır. Desctructor metodlar bildiğiniz gibi nesne GC tarafından yok edilmeden &amp;ouml;nce &amp;ccedil;alışan son metoddur. Burada &amp;ccedil;oğunlukla unmanaged referansların serbest bırakılma işlemleri ele alınır. S&amp;ouml;z konusu desen aşağıdaki yapıya sahiptir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class VeriYonetim:IDisposable
{
    ~VeriYonetim()
    {
        Dispose(false);
    }

    protected virtual void Dispose(bool disposeDurumu)
    {
        if(disposeDurumu==true)
        {
            // Managed kaynaklar i&amp;ccedil;in Dispose metodu uygulanır.
        }
        // UnManaged kaynaklar temizlenir.
    }

    #region IDisposable Members

    public void Dispose()
    {
        Dispose(true);
        GC.SuppressFinalize(this);
    }

    #endregion
}&lt;/pre&gt;
&lt;p&gt;Bu desendeki yaklaşım kısaca şudur; nesnemizi eğer Dispose metodunu kullanarak &amp;ccedil;ağırırsak bu durumda overload ettiğimiz ve sadece bu sınıftan t&amp;uuml;reyen sınıflar tarafından erişilip override edilebilen Dispose metodu devreye girecektir. Bu metod i&amp;ccedil;erisinde managed kodlarımız i&amp;ccedil;in gerekli temizleme işlemleri yapılır. Hemen ardından da unmanaged kaynaklar silinir. Peki desctructor metodu neden kullanıyoruz?&lt;/p&gt;
&lt;p&gt;Nesnemizin illede a&amp;ccedil;ık&amp;ccedil;a Dispose edilmesi gibi biri durum s&amp;ouml;z konusu değildir. Pekala, nesne doğal yollardan scope dışına &amp;ccedil;ıktığında GC tarafından serbest bırakılabilir. İşte bu serbest bırakma anından hemen &amp;ouml;nce desctructor metodu devreye girmektedir. Desctructor metodumuzdan yine overload ettiğimi virtual Dispose metodumuzu &amp;ccedil;ağırırız. Ancak bu kez managed kaynaklar zaten GC tarafından serbest bırakılacağından durumu m&amp;uuml;dahale etmeyiz. Bu y&amp;uuml;zden metoda parametre false olarak g&amp;ouml;nderilir. Ancak yine de unmanaged kaynaklar bizim tarafımızdan serbest bırakılacaktır.&amp;nbsp; Son olarak Dipose metodumuzda kullandığımız GC.SuppressFinalize metod &amp;ccedil;ağırımı ile o anki nesneye ait sonlandırma kuyruğundaki kaynaklarıda serbest bırakmış oluruz.&lt;/p&gt;
&lt;p&gt;Bir başka makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2007-10-27 21:37:00</pubDate>
  <slug>Using-Ifadesi-ile-Garanti-Dispose</slug>
  <tags>
    <tag>c#</tag>
    <tag>using</tag>
    <tag>garbage-collector</tag>
    <tag>disposable-objects</tag>
    <tag>idisposable</tag>
    <tag>dispose</tag>
    <tag>overriding</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>