<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Kullanıcı Web Kontrollerini Daha Etkin Kullanmak</title>
  <description>Kullanıcı web kontrolleri (web user control) kendi içlerinde birden fazla kontrolü barındırabilen komposit tipteki görsel bileşenlerdir. Asp.Net 1.0/1.1 den veri var olan kullanıcı web kontrollerini çoğunlukla, birden fazla sayfada kullandığımız durumlarda (hatta aynı sayfada bir çok yerde aynı kontrol kümelerini kullanmak istediğimizde) düşünür ve geliştiririz...</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Kullanıcı web kontrolleri (web user control) kendi i&amp;ccedil;lerinde birden fazla kontrol&amp;uuml; barındırabilen komposit tipteki g&amp;ouml;rsel bileşenlerdir. Asp.Net 1.0/1.1 den veri var olan kullanıcı web kontrollerini &amp;ccedil;oğunlukla, birden fazla sayfada kullandığımız durumlarda &lt;em&gt;(hatta aynı sayfada bir &amp;ccedil;ok yerde aynı kontrol k&amp;uuml;melerini kullanmak istediğimizde)&lt;/em&gt; d&amp;uuml;ş&amp;uuml;n&amp;uuml;r ve geliştiririz. Bu kontroller tek bir yerde durdukları i&amp;ccedil;in g&amp;uuml;ncelleştirilmeleri halinde, kullanıldıkları t&amp;uuml;m sayfalara ilgili değişiklikler yansıyacaktır. G&amp;uuml;ncelleme kolaylığı, kullanıcı web kontrollerini tercih etmemizin en b&amp;uuml;y&amp;uuml;k nedenlerinden birisidir.&lt;/p&gt;
&lt;p&gt;Ancak bu kontroller bir a&amp;ccedil;ıdan bakıldığında, herhangibir web sayfasına eklenen web sunucu kontrollerinden (web server control) yada html sunucu kontrollerinden (html server control) &amp;ccedil;ok da farklı d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmemelidir. Nasıl ki bir web sunucu kontrol&amp;uuml;n&amp;uuml;n &amp;ouml;zellikleri (properties) ve olayları(events) oluyorsa bir web kullanıcı kontrol&amp;uuml;n&amp;uuml;nde &amp;ouml;zellikleri ve olayları olabilir. Nihayetinde, bir kullanıcı tanımlı web kontrol&amp;uuml; aslında &lt;strong&gt;System.Web.UI.UserControl&lt;/strong&gt; sınıfından t&amp;uuml;rerler ve kullanıldığı sayfanın bir par&amp;ccedil;ası olarak sunucu tarafında nesne bazında ele alınırlar. Dolayısıyla kullanıldıkları sayfada yakalanabilecek olayları ve kullanılabilecek &amp;ouml;zellikleri olabilir. Hatta bir web kontrol&amp;uuml;n&amp;uuml; nasıl dinamik olarak oluşturabiliyorsak bir kullanıcı web kontrol&amp;uuml;n&amp;uuml; de dinamik olarak oluşturabilir ve sayfanın o anki i&amp;ccedil;eriğine ekleyebiliriz. İşte bu makalemizde daha &amp;ccedil;ok bu konular &amp;uuml;zerinde durmaya &amp;ccedil;alışacağız. Temel olarak aşağıdaki &amp;uuml;&amp;ccedil; maddede duracağız.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;Ouml;zellik (Property) kullanımı&lt;/li&gt;
&lt;li&gt;Kullanıcı web kontrollerini dinamik oluşturma&lt;/li&gt;
&lt;li&gt;Olay (Event) kullanımı&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;strong&gt;1. &amp;Ouml;zellik (Property) Kullanımı&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Kullanıcı web kontrollerinin aslında System.Web.UI.Control tipinden t&amp;uuml;reyen sınıflar şeklinde ifade edilebileceğinden bahsetmiştik. Bu nedenle kullanıcı web kontrollerine &amp;ouml;zellik ekleyebiliriz. Bu &amp;ouml;zellikler yardımıyla &amp;ouml;rneğin bir kullanıcı tanımlı kontrol i&amp;ccedil;erisindeki bileşenlerin bazı &amp;ouml;zelliklerine dışarıdan erişebilir hatta değiştirebiliriz. Dilerseniz &amp;ouml;rnek bir senaryo &amp;uuml;zerinden gidelim. Aşağıdaki ekran &amp;ccedil;ıktısına sahip olan bir web user control' &amp;uuml;m&amp;uuml;z olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk181_1.gif" alt="" width="284" height="187" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;AdresBilgisi.ascx;&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Control Language="C#" AutoEventWireup="true" CodeFile="AdresBilgisi.ascx.cs" Inherits="AdresBilgisi" %&amp;gt;
&amp;lt;table&amp;gt;
    &amp;lt;tr&amp;gt;
        &amp;lt;td &amp;gt;İl&amp;lt;/td&amp;gt;
        &amp;lt;td &amp;gt;&amp;lt;asp:DropDownList ID="ddlIl" runat="server" &amp;gt;&amp;lt;/asp:DropDownList&amp;gt;&amp;lt;/td&amp;gt;
    &amp;lt;/tr&amp;gt;
    &amp;lt;tr&amp;gt;
        &amp;lt;td &amp;gt;İl&amp;ccedil;e&amp;lt;/td&amp;gt;
        &amp;lt;td &amp;gt;&amp;lt;asp:TextBox ID="txtIlce" runat="server"&amp;gt;&amp;lt;/asp:TextBox&amp;gt;&amp;lt;/td&amp;gt;
    &amp;lt;/tr&amp;gt;
    &amp;lt;tr&amp;gt;
        &amp;lt;td &amp;gt;Cadde&amp;lt;/td&amp;gt;
        &amp;lt;td &amp;gt;&amp;lt;asp:TextBox ID="txtCadde" runat="server"&amp;gt;&amp;lt;/asp:TextBox&amp;gt;&amp;lt;/td&amp;gt;
    &amp;lt;/tr&amp;gt;
    &amp;lt;tr&amp;gt;
        &amp;lt;td &amp;gt;Sokak&amp;lt;/td&amp;gt;
        &amp;lt;td &amp;gt;&amp;lt;asp:TextBox ID="txtSokak" runat="server"&amp;gt;&amp;lt;/asp:TextBox&amp;gt;&amp;lt;/td&amp;gt;
    &amp;lt;/tr&amp;gt;
    &amp;lt;tr&amp;gt;
        &amp;lt;td &amp;gt;Posta Kodu&amp;lt;/td&amp;gt;
        &amp;lt;td &amp;gt;&amp;lt;asp:TextBox ID="txtPostakodu" runat="server"&amp;gt;&amp;lt;/asp:TextBox&amp;gt;&amp;lt;/td&amp;gt;
    &amp;lt;/tr&amp;gt;
&amp;lt;/table&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;AdresBilgisi.ascx.cs;&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public partial class AdresBilgisi : System.Web.UI.UserControl
{
    protected void Page_Load(object sender, EventArgs e)
    {
        string[] iller = new string[] { "Istanbul", "Ankara", "Izmir" };
        foreach (string il in iller)
            ddlIl.Items.Add(il);
    }
}&lt;/pre&gt;
&lt;p&gt;AdresBilgisi isimli kullanıcı tanımlı web kontrol&amp;uuml;m&amp;uuml;z i&amp;ccedil;erisinde basit olarak İl, İl&amp;ccedil;e, Cadde, Sokak, PostaKodu gibi bilgiler tutulmaktadır. Elbette burada sade d&amp;uuml;ş&amp;uuml;nmek zorunda olduğumuzdan kontrol&amp;uuml; m&amp;uuml;mk&amp;uuml;n olduğunca basit tasarladık. Normal şartlar altında bu kontrole doğrulama (validation) bileşenlerini ilave etmek, il ve il&amp;ccedil;e gibi bilgileri bir birleri ile ilişkili olacak şekilde gerekli veri k&amp;uuml;melerinden &amp;ccedil;ekmek gibi işlemleri g&amp;ouml;z ardı ediyoruz. Odaklanacağımız nokta bu kontrol i&amp;ccedil;in kendi &amp;ouml;zelliklerimizi yazmak ve kullanmak olacak. Şimdi bu kontrollerden iki tanesini kullanacağımız aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne sahip bir web sayfası olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk181_2.gif" alt="" width="313" height="529" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında senaryomuz olduk&amp;ccedil;a tanıdık gelecektir. Bir alış veriş sitesinde, teslimat adresi ve fatura adresi bilgilerinin aynı olması halinde aynı tipten iki web user control arasında nasıl iletişim kuracağız. &lt;em&gt;(&amp;Ccedil;ok doğal olarak burada bir CheckBox kontrol&amp;uuml; kullanıp teslima adresinin fatura adresi olraakta kullanılacağını belirtebilir ve işi tek bir kullanıcı tanımlı web kontrol ile halledebileceğimizi d&amp;uuml;ş&amp;uuml;nebiliriz. Ancak b&amp;ouml;yle bir durumdada farklı bir Fatura adresi girilmesi m&amp;uuml;mk&amp;uuml;n olmayacaktır.)&lt;/em&gt; İşte bu nokta bize web user control i&amp;ccedil;erisindeki kontrollerin dışarıdan erişebilir olmasını sağlayacak &amp;ouml;zellikler gerekecektir. Bu ama&amp;ccedil;la, AdresBilgisi isimli kullanıcı tanımlı web kontroll&amp;uuml;m&amp;uuml;ze aşağıdaki gibi &amp;ouml;zellikler eklememiz gerekecektir. &amp;Ouml;zelliklerimiz kullanıcı web kontrol&amp;uuml; i&amp;ccedil;erisindeki bileşenlerin Text, SelectedIndex gibi &amp;ouml;zelliklerinin değerlerini dış ortama a&amp;ccedil;maktan sorumludur.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public int Il
{
    get { return ddlIl.SelectedIndex; }
    set { ddlIl.SelectedIndex = value; }
}
public string Ilce
{
    get { return txtIlce.Text; }
    set { txtIlce.Text = value; }
}
public string Cadde
{
    get { return txtCadde.Text; }
    set { txtCadde.Text = value; }
}
public string Sokak
{
    get { return txtSokak.Text; }
    set { txtSokak.Text = value; }
}
public string PostaKodu
{
    get { return txtPostakodu.Text; }
    set { txtPostakodu.Text = value; }
}&lt;/pre&gt;
&lt;p&gt;Artık AdresBilgisi kontrol&amp;uuml; i&amp;ccedil;erisindeki &amp;uuml;yelere kod tarafında erişebilir, dahada &amp;ouml;nemlisi d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z senaryoyu ger&amp;ccedil;ekleyebiliriz. Bunun i&amp;ccedil;in tek yapmamız gereken default.aspx.cs i&amp;ccedil;erisinde aşağıdaki kod par&amp;ccedil;asını yazmaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void btnAyniAdres_Click(object sender, EventArgs e)
{
    AdresBilgisi2.Il = AdresBilgisi1.Il;
    AdresBilgisi2.Ilce = AdresBilgisi1.Ilce;
    AdresBilgisi2.Cadde = AdresBilgisi1.Cadde;
    AdresBilgisi2.Sokak = AdresBilgisi1.Sokak;
    AdresBilgisi2.PostaKodu = AdresBilgisi1.PostaKodu;
}&lt;/pre&gt;
&lt;p&gt;Şimdi &amp;ouml;rneğimizi &amp;ccedil;alıştıralım ve Teslimat adresi bilgilerini girdikten sonra Fatura İ&amp;ccedil;in Aynı Adresi Kullan d&amp;uuml;ğmesine basalım.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;İlk Durum;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk181_3.gif" alt="" width="362" height="544" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;D&amp;uuml;ğmeye basıldıktan sonra;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk181_4.gif" alt="" width="369" height="529" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil;ta, AdresBilgisi1 isimli kullanıcı web kontrol&amp;uuml; i&amp;ccedil;erisindeki bileşenlere ait değerler AdresBilgisi2 isimli kullanıcı web kontrol&amp;uuml; i&amp;ccedil;erisinde bileşenlere aynen g&amp;ouml;nderilmiştir. Dolayısıyla hem kullanıcıyı aynı bilgileri girme zahmetinden kurtardık hemde aynı web user control' e ait birden fazla &amp;ouml;rnek arasında nasıl veri transferi yapabileceğimizi aydınlatmış olduk. Gelelim ikinci konumuza.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;2. Kullanıcı web kontrollerini dinamik oluşturma&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alışma zamanında (run time) web kontrollerini dinamik olarak oluşturmak hatta bunları aynı event metodlarına y&amp;ouml;nlendirmek &amp;ouml;zellikle portal tarzı sistemlerde &amp;ouml;nemlidir. Benzer davranışı kullanıcı web kontrolleri i&amp;ccedil;inde ger&amp;ccedil;ekleştirebiliriz. Burada dikkat edilmesi gereken husus, kullanıcı tanımlı web kontrol&amp;uuml;n&amp;uuml;n ele alınacağı sayfa i&amp;ccedil;erisinde kayıt edilerek (register) bildirilmesi gerektiğidir. Bunun i&amp;ccedil;in &lt;strong&gt;Register&lt;/strong&gt; direktifinden yararlanabiliriz. &amp;Ouml;rneğin AdresBilgisi.ascx kullanıcı tanımlı web kontrol&amp;uuml;n&amp;uuml; dinamik olarak default2.aspx isimli bir sayfada kullanmak istediğimizi d&amp;uuml;ş&amp;uuml;nelim. İlk olarak Register direktifini aşağıdaki gibi eklemeliyiz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" AutoEventWireup="true" CodeFile="Default2.aspx.cs" Inherits="Default2" %&amp;gt;
&amp;lt;%@ Register Src="~/AdresBilgisi.ascx" TagName="Adres" TagPrefix="adr" %&amp;gt;&lt;/pre&gt;
&lt;p&gt;Aslında bir web user control herhangi bir sayfaya eklendiği zaman, bu direktif otomatik olarak eklenmektedir. Bizim şu anki amacımız kontrolden bir ka&amp;ccedil; tanesini dinamik olarak oluşturup ilgili web sayfasına eklemek olduğundan kod tarafında ilgili kontrol tipine erişebilmemiz gerekmektedir. Bu nedenle ilgili web kullanıcı kontrol&amp;uuml;n&amp;uuml; register ettik. Dinamik olarak ger&amp;ccedil;ekleştirilecek işlemler i&amp;ccedil;in sayfanın &lt;strong&gt;Page_Init&lt;/strong&gt; olay metodunu tercih edebiliriz. &lt;em&gt;(Bu olay metodu bir web sayfasının yaşam d&amp;ouml;ng&amp;uuml;s&amp;uuml;nde genellikle kontrol&amp;uuml;n dinamik olarak oluşturulması istendiği durumlarda tercih edilmektedir. Elbetteki bu bir zorunluluk değildir. İstenildiğinde Page_PreInit yada Page_Load gibi event metodlarınıda dinamik kontrol oluşturma amacıyla g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void Page_Init(object sender, EventArgs e)
{
    AdresBilgisi kontrol1=(AdresBilgisi)LoadControl("AdresBilgisi.ascx");
    AdresBilgisi kontrol2 = (AdresBilgisi)LoadControl("AdresBilgisi.ascx");

    kontrol1.Ilce = "İl&amp;ccedil;e giriniz...";
    kontrol2.PostaKodu = "90000";

    phKontroller.Controls.Add(kontrol1); 
    phKontroller.Controls.Add(kontrol2);
}&lt;/pre&gt;
&lt;p&gt;Dikkat ederseniz, AdresBilgisi isimli kullanıcı web kontrollerini &amp;ouml;ncelikle y&amp;uuml;klememiz gerekmektedir. Bu işlem i&amp;ccedil;in &lt;strong&gt;LoadControl&lt;/strong&gt; metodu kullanılmıştır. Bu metod o anki sayfaya &lt;strong&gt;(Page) &lt;/strong&gt;ait bir metoddur ve geriye Control tipinden bir nesne &amp;ouml;rneği d&amp;ouml;nd&amp;uuml;rmektedir. Kontrol&amp;uuml; bu şekilde y&amp;uuml;kledikten sonra hemen ilgili taşıyıcı nesneye eklemeyi tercih edebiliriz elbette. Ancak biz kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n Ilce, PostaKodu gibi &amp;ouml;zelliklerinede kod i&amp;ccedil;erisinde erişmek istediğimizden doğru bir tip d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml;ne ihtiyacımız vardır. Bu nedenle LoadControl ile elde edilen Control nesnesi AdresBilgisi tipine cast operat&amp;ouml;r&amp;uuml; yardımıyla d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmektedir. &amp;Ouml;rneğimizi &amp;ccedil;alıştırdığımızda phKontroller isimli PlaceHolder bileşeninin Controls koleksiyonuna, AdresBilgisi kontrollerinin aşağıdaki gibi eklendiği g&amp;ouml;zlemlenebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk181_5.gif" alt="" width="368" height="398" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;3. Olay (Event) Kullanımı&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Kullanıcı web kontrollerini, sıradan bir web sunucu kontrol&amp;uuml; olarak d&amp;uuml;ş&amp;uuml;nmeye &amp;ccedil;alıştığımızda olaylara sahip olabileceğini de s&amp;ouml;yleyebiliriz. &amp;Ouml;rneğin bir Button nesnesi bir web sayfasına eklendiğinde ve bu nesneye mouse ile basıldığında Click event' i &lt;em&gt;(eğer y&amp;uuml;klenmiş ise)&lt;/em&gt; aktif hale gelir. Web tabanlı uygulamaların doğası gereği bu olaya ilişkin metodlar, her ne kadar sayfanın i&amp;ccedil;erisindeki &amp;uuml;yeler olsalarda hemen &amp;ccedil;alıştırılmazlar. Bunun sebebi, sunucu tarafında ilgili web sayfasının nesnel olarak &amp;uuml;retilmesi sırasında &amp;ccedil;alışan yaşam d&amp;ouml;ng&amp;uuml;s&amp;uuml; &lt;strong&gt;(page life cycle)&lt;/strong&gt; d&amp;uuml;r. İstemci aslında bir d&amp;uuml;ğmeye bastığında, sayfa istemci tarayıcı penceresinden sunucuya doğru i&amp;ccedil;eriği ile birlikte g&amp;ouml;nderilir &lt;em&gt;(Bu işlemi genellikle Postback olarak adlandırıyoruz)&lt;/em&gt;. Bunun &amp;uuml;zerine sunucu tarafında g&amp;ouml;nderilen sayfanın bir &amp;ouml;rneği oluşturulur ve &amp;ccedil;ok genel hatları ile aşağıdaki yaşam d&amp;ouml;ng&amp;uuml;s&amp;uuml; &amp;ccedil;alışır.&lt;/p&gt;
&lt;p&gt;Page_PreInit&lt;br /&gt; Page_Init&lt;br /&gt; Page_Load&lt;br /&gt; Button i&amp;ccedil;in Click / Change Olay Metodları&lt;br /&gt; Page_PreRender&lt;br /&gt; Page_UnLoad&lt;/p&gt;
&lt;p&gt;Peki biz kendi geliştirdiğimiz kullanıcı web kontrollerine olay eklemek istersek ne olur. &amp;Ouml;ncelikle olarak sayfanın yaşam d&amp;ouml;ng&amp;uuml;s&amp;uuml; aşağıdakine benzer bir sırada işleyecektir.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Aspx sayfası ilk talep edildiğinde;&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;Default3.aspx Page_PreInit
  Urun.ascx Init 
  Urun.ascx Init 
Default3.aspx Page_Init
Default3.aspx Load
  Urun.ascx Load
  Urun.ascx Load
  Urun.ascx UnLoad 
  Urun.ascx UnLoad 
Default3.aspx Page_UnLoad&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;Sayfadaki Web User Control i&amp;ccedil;erisinden bir olay tetiklendiğinde;&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;Default3.aspx Page_PreInit
  Urun.ascx Init 
  Urun.ascx Init 
Default3.aspx Page_Init
Default3.aspx Load
  Urun.ascx Load
  Urun.ascx Load
Default3.aspx i&amp;ccedil;inde &amp;ccedil;alışan web user control olayı
  Urun.ascx UnLoad 
  Urun.ascx UnLoad 
Default3.aspx Page_UnLoad&lt;/pre&gt;
&lt;p&gt;Yaşam d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml;n işleyişini kısaca inceledikten sonra kullanıcı web kontrolleri i&amp;ccedil;in olayları nasıl yazabileceğimize bir bakalım. İlk olarak, bir temsilci (delegate) tanımlanır. Temsilcinin amacı, ilgili olay tetiklendiğinde devreye girecek olan olay metodunun yapısını tanımlamak ve &amp;ccedil;alışma zamanında bu metodun adresini işaret etmektir. Sonrasında ise bir event tanımlanır. Tanımladığımız event, user control' &amp;uuml; kullandığımız sayfalarda ele alınabilecektir.&lt;/p&gt;
&lt;p&gt;Bir başka deyişle, kullanıcı web kontrol&amp;uuml; i&amp;ccedil;erisinde tanımlanan olay ger&amp;ccedil;ekleştiğinde, sayfa i&amp;ccedil;erisinde yazılan olay metodu devreye girecektir. Genel olarak olay metodları iki parametre ile &amp;ccedil;alışırlar. İlk parametre &amp;ccedil;oğunlukla olayı meydana getiren nesneyi referans eder. İkinci parametre ise, olay metoduna olay ile ilgili bir takım bilgiler aktarabilir. &amp;Ouml;rneğin EventArgs gibi. Dolayısıyla kendi parametre sınıflarımızı yazıp, olay metodu i&amp;ccedil;erisine bilgi taşıyabiliriz. Şimdi dilerseniz bu işlemleri bir senaryo &amp;uuml;zerinden incelemeye &amp;ccedil;alışalım.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek senaryomuzda, Urun.ascx isimli bir web user control nesnemiz var. Bu nesne i&amp;ccedil;erisinde dinamik olarak oluşturulan CheckBox kontrollerinde g&amp;uuml;nler tutulmakta. Kullanıcı &amp;uuml;r&amp;uuml;nlerin teslim edilebileceği g&amp;uuml;nleri se&amp;ccedil;ebilmektedir. Kontrol &amp;uuml;zerinde yer alan d&amp;uuml;ğmeye basıldığında ise, SecilenleriAl isimli bir olay manual olarak tetiklenmektedir. &amp;Ouml;nemli olan nokta, SecilenleriAl isimli olayın kontrol&amp;uuml;n kullanıldığı sayfa i&amp;ccedil;erisinde yakalanabileceği ve ele alınabileceğidir. Bu kontrol i&amp;ccedil;erisinde tanımladığımız temsilcimiz kendi i&amp;ccedil;erisinde KontrolBilgileri isimli bir sınıfı olay parametresi olarak kullanmaktadır. Bir başka deyişle KontrolBilgileri sınıfını EventArgs sınıfı gibi d&amp;uuml;ş&amp;uuml;nebiliriz. &amp;Ouml;nce KontrolBilgileri sınıfını tasarlayarak işe başlayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class KontrolBilgileri
{
    private List&amp;lt;string&amp;gt; m_Kontroller;

    public List&amp;lt;string&amp;gt; Kontroller
    {
        get { return m_Kontroller; }
    }

    public KontrolBilgileri(PlaceHolder ph)
    {
        m_Kontroller = new List&amp;lt;string&amp;gt;();
        for (int i = 0; i &amp;lt; ph.Controls.Count; i++)
        {
            if (ph.Controls[i] is CheckBox)
            {
                CheckBox currentChk=ph.Controls[i] as CheckBox;
                if (currentChk.Checked)
                    m_Kontroller.Add(currentChk.Text);
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;KontrolBilgileri sınıfının g&amp;ouml;revi, olay metodu i&amp;ccedil;erisine, kullanıcı web kontrol&amp;uuml;nde se&amp;ccedil;ili olan CheckBox bileşenlerinin Text bilgilerini string tipinden elemanlar taşıyan generic bir koleksiyon şeklinde d&amp;ouml;nd&amp;uuml;rmektir. Olay i&amp;ccedil;ine bilgi taşıyacak sınıfımızı tasarladıktan sonra kullanıcı web kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Urun.ascx;&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Control Language="C#" AutoEventWireup="true" CodeFile="Urun.ascx.cs" Inherits="Urun" %&amp;gt;
&amp;lt;asp:PlaceHolder ID="phGunler" runat="server"&amp;gt;&amp;lt;/asp:PlaceHolder&amp;gt;
&amp;lt;br /&amp;gt;
&amp;lt;br /&amp;gt;
&amp;lt;asp:Button ID="btnIsaretle" runat="server" Text="Isaretle" OnClick="btnIsaretle_Click" /&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;Urun.ascx.cs;&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public partial class Urun : System.Web.UI.UserControl
{
    public delegate void SecilenleriAlHandler(KontrolBilgileri args);
    public event SecilenleriAlHandler SecilenleriAl;

    protected void Page_Load(object sender, EventArgs args)
    {
        string[] gunler = new string[] { "Pazartesi", "Salı", "&amp;Ccedil;arşamba", "Perşembe", "Cuma", "Cumartesi", "Pazar" };
        foreach (string gun in gunler)
        {
            CheckBox chkBox = new CheckBox();
            chkBox.ID = gun;
            chkBox.Text = gun;
            phGunler.Controls.Add(chkBox);
            LiteralControl lc = new LiteralControl("&amp;lt;br/&amp;gt;");
            phGunler.Controls.Add(lc);
        }
    }
    protected void btnIsaretle_Click(object sender, EventArgs e)
    {
        if (SecilenleriAl != null)
            SecilenleriAl(new KontrolBilgileri(phGunler));
    }
}&lt;/pre&gt;
&lt;p&gt;Kontrol&amp;uuml;m&amp;uuml;zde, SecilenleriAlHandler isimli temsilci(delegate) ve SecilenleriAl isimli olay (event) &amp;uuml;yesi yer almaktadır. btnIsaretle isimli d&amp;uuml;ğmemize ait Click olay metounda, SecilenleriAl isimli bir olay kontrol&amp;uuml; kullanan bir sayfa tarafından y&amp;uuml;klenmiş ise manual olarak tetiklenmektedir. Bu şu anlama gelir. Eğer kontrol&amp;uuml; kullandığımız bir web sayfasında, bu kontrole ait SecilenleriAl isimli bir olay y&amp;uuml;klenmiş ise, bununla ilişkili olay metodu &amp;ccedil;alıştırılacaktır. Bu ama&amp;ccedil;la default3.aspx isimli &amp;ouml;rnek bir sayfada aşağıdaki kodları geliştirelim.&lt;/p&gt;
&lt;p&gt;default3.aspx;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk181_6.gif" alt="" width="342" height="163" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk181_7.gif" alt="" width="611" height="465" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;default3.aspx.cs;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public partial class Default3 : System.Web.UI.Page
{
    protected void Secilenler(KontrolBilgileri kb)
    {
        for (int i = 0; i &amp;lt; kb.Kontroller.Count; i++)
            Response.Write(kb.Kontroller[i]+"&amp;lt;br/&amp;gt;");
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamamız &amp;ccedil;alıştırdığımızda, user control &amp;uuml;zerinde bazı se&amp;ccedil;enekleri işaretlediğimizde ve d&amp;uuml;ğmeye bastığımızda o sayfa &amp;uuml;zerinde tanımladığımız Secilenler isimli olay metodunun &amp;ccedil;alıştığını ve se&amp;ccedil;ilen g&amp;uuml;nlerin ekrana yazıldığını g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk181_8.gif" alt="" width="365" height="411" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edilmesi gereken bir nokta vardır. &amp;Ccedil;oğunlukla kontrolleri dinamik olarak oluşturup bir web sayfasına eklediğimizde bu kontrollerin hepsini tek bir olay metoda y&amp;ouml;nlendirebiliriz. İlgili olay metodu i&amp;ccedil;erisinde hangi kontrolden gelindiğini anlamak i&amp;ccedil;in ise genellike object tipinden gelen ve ismi &amp;ccedil;oğunlukla sender olarak bilinen değişkeni ilgili tipe cast ederiz. Benzer yapıyı Urun.ascx kontrol&amp;uuml; i&amp;ccedil;in d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde, SecilenleriAl isimli olay metoduna aynı işlevselliği sağlayacak eklentiyi yapamız gerekecektir. Bunun i&amp;ccedil;in temsilciyi, olayı tetikleyen metoddaki &amp;ccedil;ağrıyı ve sınıf &amp;uuml;zerindeki kontrole ait olay metodunu aşağıdaki gibi değiştirmemiz yeterli olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Urun.ascx.cs' de temsilci;&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public delegate void SecilenleriAlHandler(object gonderen,KontrolBilgileri args);&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;Urun.ascx.cs' de olayı tetikleyen button_Click metodu;&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void btnIsaretle_Click(object sender, EventArgs e)
{
    if (SecilenleriAl != null)
        SecilenleriAl(this,new KontrolBilgileri(phGunler));
}&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;default3.aspx.cs' deki Secilenler olay metod;&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void Secilenler(object sender,KontrolBilgileri kb)
{
    for (int i = 0; i &amp;lt; kb.Kontroller.Count; i++)
        Response.Write(kb.Kontroller[i]+"&amp;lt;br/&amp;gt;");
}&lt;/pre&gt;
&lt;p&gt;Bu değişiklik bize, kontrole ait olay metodu i&amp;ccedil;erisinde hangi web kullanıcı kontrol&amp;uuml;n&amp;uuml;n tetiklendiğini algılama imkanı verecektir. B&amp;ouml;ylece birden fazla web kullanıcı kontrol&amp;uuml;n&amp;uuml; aynı olay metoduna y&amp;ouml;nlendirdiğimizde her birinin &amp;ouml;zelliklerini ve &amp;uuml;yelerini aynı metod i&amp;ccedil;erisinde ele alabiliriz. &amp;Ouml;rneğin Urun.ascx i&amp;ccedil;erisinde g&amp;uuml;nler dışında ekstradan bilgi girilebilecek notların olduğu bir TextBox olduğunu ve bu TextBox' ın i&amp;ccedil;eriğine dış ortamdan erişebilmemizi sağlayan read only bir &amp;ouml;zellik eklediğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public string Notlar
{
    get{return txtNot.Text;}
}&lt;/pre&gt;
&lt;p&gt;Default3.aspx sayfasında Urun.ascx kontrol&amp;uuml;nden &amp;ouml;rneğin 2 tane olduğunu ve bunların aynı olay metoda y&amp;ouml;nlendirildiğini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne. Bu durumda ilgili olay metodu i&amp;ccedil;erisinde, hangi kontrol tarafından bir tetikleme olduğunu tespit edebilir. &amp;Ccedil;&amp;uuml;nk&amp;uuml; artık olayı tetikleyen nesneyi taşıyan bir parametremiz vardır. Dolayısıyla bu parametre &amp;uuml;zerinden ilgili Notlar &amp;ouml;zelliğe ge&amp;ccedil;ebilir ve hangi kontrolden gelindiyse onun notlarını alabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void Secilenler(object sender,KontrolBilgileri kb)
{
    Urun urn = (Urun)sender;
    Response.Write(urn.Notlar + "&amp;lt;br/&amp;gt;");

    for (int i = 0; i &amp;lt; kb.Kontroller.Count; i++)
        Response.Write(kb.Kontroller[i]+"&amp;lt;br/&amp;gt;");
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk181_9.gif" alt="" width="362" height="438" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu makalemizde kullanıcı web kontrollerini daha etkin şekilde nasıl kullanabileceğimizi incelemeye &amp;ccedil;alıştık. Aslında &amp;ccedil;ıkış noktamız bir web kullanıcı kontrol&amp;uuml;n&amp;uuml; normal bir web sunucu kontrol&amp;uuml;ne benzer bir sınıf olarak d&amp;uuml;ş&amp;uuml;nmekti. Bu sayede kullanıcı web kontrollerine &amp;ouml;zellik, olay ekleyebileceğimizi ve dinamik olarak &amp;ccedil;alışma zamanında oluşturabileceğimizi g&amp;ouml;rd&amp;uuml;k. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/UsingWebUserControls.rar"&gt;&amp;Ouml;rnek kod i&amp;ccedil;in tıklayın.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2006-11-21 12:00:00</pubDate>
  <slug>Kullanıcı-Web-Kontrollerini-Daha-Etkin-Kullanmak-bsenyurt-com-dan</slug>
  <tags>
    <tag>asp-net</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>