<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>.NET Core 2.0 ile Basit Bir Web API Geliştirmek</title>
  <description>Bir süredir de .Net Core tarafına bakmak ve servis geliştirme noktasında neler yapılabileceğini incelemek istiyordum. İşlerden boşluk bulduğum bir sırada Web API nasıl yazılır araştırayım ve yaptığım örneği bloğuma ekleyeyim istedim.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/10/bogazmini.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;G&amp;uuml;nler yoğun ge&amp;ccedil;iyor. Bir s&amp;uuml;redir sosyal medyadan da uzaktayım. Kendimce sebeplerim var. Ağırlık g&amp;ouml;rev değişikliği sonrası kritik geliştirmeler barındıran işimdeki yoğunluk. Bunun dışında daha &amp;ccedil;ok kitap okuduğumu, telefona neredeyse hi&amp;ccedil; bakmadığımı&lt;em&gt;(T&amp;uuml;rkiye ortalamasına g&amp;ouml;re bir kişi g&amp;uuml;nde 70 kez telefona bakıyormuş-kahrolsun Instagram &amp;ccedil;ağı)&lt;/em&gt;, Serdar Kuzuloğlu'ndan &lt;a href="https://www.dunyahalleri.com/" target="_blank"&gt;d&amp;uuml;nya hallerini&lt;/a&gt; daha &amp;ccedil;ok okuduğumu, G&amp;uuml;ndem &amp;Ouml;zel'i daha &amp;ccedil;ok izlediğimi&lt;em&gt;(Yazıyı yazdığım g&amp;uuml;nlerdeki &lt;a href="https://www.youtube.com/watch?v=GYwyBC5XfFQ" target="_blank"&gt;şu yayınlarını&lt;/a&gt; tavsiye ederim. &lt;a href="http://www.hasansoylemez.com/" target="_blank"&gt;Hasan S&amp;ouml;ylemez'i&lt;/a&gt; de takip edin kitabını alın derim)&lt;/em&gt;, okuyup dinlediklerimden kendime k&amp;uuml;&amp;ccedil;&amp;uuml;k k&amp;uuml;&amp;ccedil;&amp;uuml;k notlar &amp;ccedil;ıkarttığımı, daha &amp;ccedil;ok basketbol oynadığımı, işe gittiğim her g&amp;uuml;n gerek otob&amp;uuml;s gerek metorb&amp;uuml;s gerek minib&amp;uuml;s daha &amp;ccedil;ok sıkıştığımı&lt;em&gt;(tutunmadan seyahat edebilmek dahil)&lt;/em&gt; ama Beşiktaş-&amp;Uuml;sk&amp;uuml;dar arası motor hattında nefes alarak huzur bulabildiğim g&amp;uuml;nler ge&amp;ccedil;irdiğimi ifade edebilirim. Kalan zamanlarda eskisi kadar &amp;ccedil;ok olmasa da bir şeyler &amp;ouml;ğrenmeye gayret ediyorum. Bir s&amp;uuml;redir de .Net Core tarafında servis geliştirme noktasında neler yapılabileceğini incelemek istiyordum. İşlerden boşluk bulduğum&amp;nbsp;bir sırada Web API nasıl yazılır araştırayım ve yaptığım &amp;ouml;rneği bloğuma ekleyeyim dedim.&lt;/p&gt;
&lt;h1&gt;Ortam Hazırlıkları&lt;/h1&gt;
&lt;p&gt;İlk olarak &lt;a href="https://www.microsoft.com/net/download/core" target="_blank"&gt;Microsoft'un ilgili adresinden&lt;/a&gt; .Net Core'un son s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; indirdim. &amp;Ccedil;alışmaya başladığım tarih itibariyle 2.0 versiyonu bulunuyordu. Kurulumu Windows 7 işletim sistemi olan bir makinede ger&amp;ccedil;ekleştirdim&lt;em&gt;(Şirket bilgisayarı)&lt;/em&gt; Saha Hizmetleri ekibimizin de desteği ile makineye 2.0 s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; sorunsuz şekilde y&amp;uuml;kledim&lt;em&gt;(Malum makinede Local Admin'lik olmayınca)&lt;/em&gt;&amp;nbsp;Ardından komut satırını ve Notepad++ uygulamasını a&amp;ccedil;tım. Amacım Visual Studio ailesinin&amp;nbsp;&lt;em&gt;(Code dahil)&lt;/em&gt; &amp;uuml;r&amp;uuml;nlerini kullanmadan Web API geliştirmenin temellerini anlamaktı. Hem bu sayede hazır şablonların i&amp;ccedil;eridiği kod par&amp;ccedil;alarını daha iyi anlayabilirdim. Sonrasında terminal penceresine ge&amp;ccedil;tim ve incelediğim kaynaklardan derlediğim notlara da bakarak ilk komutumu verdim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet --help&lt;/pre&gt;
&lt;p&gt;ile dotnet komut satırı aracının nasıl kullanılabileceğini incelemeye &amp;ccedil;alıştım. .Net Core'un komut satırında proje şablonlarını otomatik olarak hazırlayan new komutunun nasıl kullanılabileceğini g&amp;ouml;rmek i&amp;ccedil;in de&amp;nbsp;şu komutu kullandım. Bu sayede dotnet'in pop&amp;uuml;ler ve gerekli build, restore, run gibi komutlarını nasıl kullanabileceğimizi detaylı bir şekilde g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;pre class="brush:cf;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new --help&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/corewebapi_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sonrasında .Net Core &amp;ccedil;alışmaları i&amp;ccedil;in a&amp;ccedil;tığım klas&amp;ouml;rde aşağıdaki komutu vererek Fabrika isimli bir Web API projesi oluşturdum.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new webapi -o Fabrika&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/corewebapi_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Peki şimdi ne oldu? -o parametresi ile verdiğimiz Fabrika ismi nedeniyle Fabrika adında bir klas&amp;ouml;r oluştu ve i&amp;ccedil;erisine gerekli t&amp;uuml;m proje dosyaları hazır olarak eklendi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/corewebapi_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere Controllers isimli bir klas&amp;ouml;r de bulunuyor. Temel olarak Model View Controller desenini kullanmaya hazır bir şablon oluşturulduğunu ifade edebiliriz. Bir başka deyişle kullanıcılardan gelecek REST taleplerini kontrol eden(Controllers)&amp;nbsp;geriye d&amp;ouml;necek varlıkları(Models) varsayılan olarak JSON tipinde basacak(View) bir desen s&amp;ouml;z konusu. Varsayılan olarak Models klas&amp;ouml;r&amp;uuml; yoktu. Bunu kendim ekledim.&lt;/p&gt;
&lt;p&gt;Oluşturulan proje yapısından sonra ilk yaptığım şey kaynaklarda da belirtildiği &amp;uuml;zere ortamı &amp;ccedil;alıştırmaktı.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet run&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/corewebapi_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere http://localhost:5000 adresinden ayağa kalkan ve istemci taleplerini dinlemeye hazır bir sunucu s&amp;ouml;z konusu. Tabii direkt bu adrese gidersek bir sonu&amp;ccedil; alamayız. &amp;Ccedil;&amp;uuml;nk&amp;uuml; varsayılan olarak gelen bir y&amp;ouml;nlendirme&lt;em&gt;(Router)&lt;/em&gt; sistemi var. Bu adres Controllers klas&amp;ouml;r&amp;uuml;ndeki Controller tipinden t&amp;uuml;reyen sınıfa g&amp;ouml;re şekilleniyor. Hazır şablonla gelen ValuesControllers sınıfının kodlarına baktığımızda Route niteliğinin(attribute) kullanıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bu nitelikte ifade edilen api/[Controller] bildirimi talep edebileceğimiz HTTP adresinin şeklini belirler ki bu durumda aşağıdaki gibi olmalıdır.&lt;/p&gt;
&lt;p&gt;http://localhost:5000/api/values&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil;ta &amp;ouml;rnek olarak konulmuş string dizi i&amp;ccedil;eriği elde edilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/corewebapi_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Elbette varsayılan bir Controller sınıfı s&amp;ouml;z konusu. ValuesController sınıfının i&amp;ccedil;erisinde yer alan metodlar incelendiğinde HTTP Get, Post, Put ve Delete operasyonları i&amp;ccedil;in gerekli hazır fonksiyonların konulduğu g&amp;ouml;r&amp;uuml;l&amp;uuml;r. Hangi metodun hangi HTTP talebine cevap vereceğini belirtmek i&amp;ccedil;in HttpGet, HttpPost, HttpPut ve HttpDelete niteliklerinden yararlanılmaktadır.&lt;/p&gt;
&lt;h1&gt;EntityFrameworkCore Paketinin Y&amp;uuml;klenmesi&lt;/h1&gt;
&lt;p&gt;Ben bunun &amp;uuml;zerine işin i&amp;ccedil;erisine EntityFrameworkCore'u da katmaya ve klasik &amp;uuml;r&amp;uuml;n listelemesi yapan REST servis &amp;ouml;rneğini inşa etmeye karar verdim. Tabii ilk bulmam gereken Entity Framework Core s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml;n bu projeye nasıl ekleneceğiydi. S&amp;ouml;z konusu k&amp;uuml;t&amp;uuml;phane bir NuGet paketi olarak ele alınabildiğinden projenin kullandığı paketler listesinde tanımlanması yeterli olacaktı.&amp;nbsp;Bu y&amp;uuml;zden Fabrika.csproj isimli proje dosyasını a&amp;ccedil;tım ve EntityFrameworkCore paketi i&amp;ccedil;in ItemGroup elementi altına bir PackageReference bildirimi ekledim.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Project Sdk="Microsoft.NET.Sdk.Web"&amp;gt;

  &amp;lt;PropertyGroup&amp;gt;
    &amp;lt;TargetFramework&amp;gt;netcoreapp2.0&amp;lt;/TargetFramework&amp;gt;
  &amp;lt;/PropertyGroup&amp;gt;

  &amp;lt;ItemGroup&amp;gt;
    &amp;lt;Folder Include="wwwroot\" /&amp;gt;
  &amp;lt;/ItemGroup&amp;gt;

  &amp;lt;ItemGroup&amp;gt;
    &amp;lt;PackageReference Include="Microsoft.AspNetCore.All" Version="2.0.0" /&amp;gt;
	&amp;lt;PackageReference Include="Microsoft.EntityFrameworkCore.InMemory" Version="2.0.0"/&amp;gt;
  &amp;lt;/ItemGroup&amp;gt;

  &amp;lt;ItemGroup&amp;gt;
    &amp;lt;DotNetCliToolReference Include="Microsoft.VisualStudio.Web.CodeGeneration.Tools" Version="2.0.0" /&amp;gt;
  &amp;lt;/ItemGroup&amp;gt;

&amp;lt;/Project&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu işlemin ardından aşağıdaki komutu kullanarak Microsoft.EntityFrameworkCore.InMemory paketinin 2.0.0 versiyonunun indirilmesini sağlanır. restore ile bildirimi yapılan t&amp;uuml;m paketler &amp;ccedil;&amp;ouml;z&amp;uuml;mlenir ve projenin kullanımı i&amp;ccedil;in gerekli indirme işlemleri yapılır.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet restore&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/corewebapi_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Model Sınıflarının Yazılması&lt;/h1&gt;
&lt;p&gt;EntityFrameworkCore paketi eklendiğine g&amp;ouml;re gerekli Model i&amp;ccedil;eriklerini yazarak ilerleyebilirdim. Product ve FabrikaContext isimli iki sınıfı Models klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisine aşağıdaki i&amp;ccedil;eriklerle ekledim.&lt;/p&gt;
&lt;p&gt;Product sınıfı&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace Fabrika.Models
{
	public class Product
	{
		public long Id {get;set;}
		public string Name {get;set;}
		public double UnitPrice {get;set;}
	}
}&lt;/pre&gt;
&lt;p&gt;FabrikaContext sınıfı&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Microsoft.EntityFrameworkCore;

namespace Fabrika.Models
{
	public class FabrikaContext
		:DbContext
	{
		public DbSet&amp;lt;Product&amp;gt; Products{get;set;}
		
		public FabrikaContext(DbContextOptions&amp;lt;FabrikaContext&amp;gt; options)
			:base(options)
			{			
			}
	}
}&lt;/pre&gt;
&lt;p&gt;Product tipik bir POCO&lt;em&gt;(Plain Old C# Object)&lt;/em&gt; olarak tasarlanmıştır. FabrikaContext ise DbContext t&amp;uuml;revli basit bir sınıftır ve i&amp;ccedil;erisinde Product tipini kullanan Products isimli bir DbSet barındırmaktadır. base kullanımı nedeniyle&amp;nbsp;varsayılan bir nesne oluşumu s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;h1&gt;Controller Sınıfının Yazılması&lt;/h1&gt;
&lt;p&gt;Model i&amp;ccedil;erikleri de hazır olduğuna g&amp;ouml;re, istemciden gelecek HTTP talebine g&amp;ouml;re devreye girecek kontrolc&amp;uuml;y&amp;uuml;&lt;em&gt;(Controller)&lt;/em&gt; yazarak ilerleyebilirim. Bu ama&amp;ccedil;la Controllers klas&amp;ouml;r&amp;uuml;ne ProductsController isimli aşağıdaki i&amp;ccedil;eriğe sahip sınıfı ekledim. Kontrolc&amp;uuml;n&amp;uuml;n g&amp;ouml;revi istemciden gelecek talebi ele alıp modelden yararlanarak bir &amp;ccedil;ıktı &amp;uuml;retmekten ibaret.&lt;/p&gt;
&lt;p&gt;ProductsController sınıfı&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.AspNetCore.Mvc;
using Fabrika.Models;

namespace Fabrika.Controllers
{
    [Route("Fabrika/restapi/[controller]")]
    public class ProductsController : Controller
    {
		private readonly FabrikaContext _context;
		
		public ProductsController(FabrikaContext context)
		{
			_context=context;
			
			if(_context.Products.Count()==0)
			{
				_context.Products.Add(new Product{Id=19201,Name="Lego Nexo Knights King I",UnitPrice=45});
				_context.Products.Add(new Product{Id=23942,Name="Lego Starwars Minifigure Jedi",UnitPrice=55});
				_context.Products.Add(new Product{Id=30021,Name="Star Wars &amp;ccedil;ay takımı ",UnitPrice=35.50});
				_context.Products.Add(new Product{Id=30492,Name="Star Wars kahve takımı",UnitPrice=24.40});
				
				_context.SaveChanges();
			}
		}
        
        [HttpGet]
        public IEnumerable&amp;lt;Product&amp;gt; Get()
        {
			return _context.Products.ToList();
        }

        
        [HttpGet("{id}")]
        public IActionResult Get(int id)
        {
			var product=_context.Products.FirstOrDefault(t=&amp;gt;t.Id==id);
			if(product==null)
			{
				return NotFound();
			}
			return new ObjectResult(product);
        }

        [HttpPost]
        public void Post([FromBody]string value)
        {
			//TODO:Yazılacak
        }

        [HttpPut("{id}")]
        public void Put(int id, [FromBody]string value)
        {
			//TODO:Yazılacak
        }

        [HttpDelete("{id}")]
        public void Delete(int id)
        {
			//TODO:Yazılacak
        }
    }
}&lt;/pre&gt;
&lt;p&gt;ProductsController sınıfında route adresinin değiştirildiğinde, DbContext t&amp;uuml;revli FabrikaContext tipinin kullanıldığında dikkat edelim. Get taleplerini karşılayan iki metodumuz bulunuyor. Birisi t&amp;uuml;m &amp;uuml;r&amp;uuml;n listesini d&amp;ouml;nd&amp;uuml;rmekte. Bu nedenle generi IEnumerable tipini d&amp;ouml;nd&amp;uuml;rmekte. Diğer Get metodu ise belli bir Id'ye ait &amp;uuml;r&amp;uuml;n&amp;uuml; d&amp;ouml;nd&amp;uuml;r&amp;uuml;yor. Bu d&amp;ouml;n&amp;uuml;ş i&amp;ccedil;in IActionResult aray&amp;uuml;z&amp;uuml;n&amp;uuml;n taşıyabileceği bir nesne &amp;ouml;rneği kullanılmakta&lt;em&gt;(ObjectResult)&lt;/em&gt;&amp;nbsp;Yapıcı metod i&amp;ccedil;erisinde &amp;uuml;r&amp;uuml;n olmama ihtimaline karşın bir ka&amp;ccedil; tane &amp;ouml;rnek &amp;uuml;r&amp;uuml;n eklenmekte. Eklenen &amp;uuml;r&amp;uuml;nler SaveChanges ile veritabanına kayıt altına da alınmakta&lt;em&gt;(Hen&amp;uuml;z Post, Put ve Delete metodlarını tamamlamadım. Bu fonksiyonlar sonraki boşluk i&amp;ccedil;in kendime atadığım g&amp;ouml;revler)&lt;/em&gt;&lt;/p&gt;
&lt;h1&gt;İlk Deneme&lt;/h1&gt;
&lt;p&gt;Hemen&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet build&lt;/pre&gt;
&lt;p&gt;komutu ile kodu derledim. Hatasız olduğunu g&amp;ouml;r&amp;uuml;nce de sevindim ve&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet run&lt;/pre&gt;
&lt;p&gt;ile sunucuyu başlatıp &amp;uuml;r&amp;uuml;nler i&amp;ccedil;in tarayıcıdan bir talep girdim.&lt;/p&gt;
&lt;p&gt;http://localhost:5000/Fabrika/restapi/products&lt;/p&gt;
&lt;p&gt;Ancak &amp;ccedil;alışma zamanı hataları ile karşılaştım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/corewebapi_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;FabrikaContext tipi i&amp;ccedil;in gerekli servis &amp;ccedil;&amp;ouml;z&amp;uuml;mlemesi bir şekilde yapılamıyordu. Sonrasında DbContext tipini servis olarak eklemeyi unuttuğumu fark ettim. Startup.cs dosyasını a&amp;ccedil;arak ConfigureServices metoduna aşağıdaki satırı ilave etmek sorunun &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; i&amp;ccedil;in yeterliydi&lt;em&gt;(Fabrika.Models ve Microsoft.EntityFrameworkCore namespace bildirimlerini de aldığım hatalar sonrası eklemem gerektiğini itiraf etmek isterim. Biraz daha dikkatli ol Burak!)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void ConfigureServices(IServiceCollection services)
{
	services.AddDbContext&amp;lt;FabrikaContext&amp;gt;(opt=&amp;gt;opt.UseInMemoryDatabase("FabrikaDb"));
	services.AddMvc();
}&lt;/pre&gt;
&lt;p&gt;Burada bellekte &amp;ccedil;alışacak şekilde FabrikaDb isimli bir veritabanını, uygulamanın kullanacağı&amp;nbsp;servisler listesine eklemiş oluyoruz. &amp;Ouml;rneği tekrar &amp;ccedil;alıştırdığımda sorun yaşamadım ve tarayıcıdan yaptığım bazı taleplere karşılık aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;lerinde yer alan sonu&amp;ccedil;ları elde ettiğimi g&amp;ouml;rd&amp;uuml;m.&lt;/p&gt;
&lt;p&gt;http://localhost:5000/Fabrika/restApi/products talebi sonrası&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/corewebapi_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;http://localhost:5000/fabrika/restapi/products/30021 talebi sonrası&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/corewebapi_9.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;http://localhost:5000/fabrika/restapi/products/999 talebi sonrası&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/corewebapi_10.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;--Derken--&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Derken Post işlemini de en iyi kaynaklardan birisi olan &lt;a href="https://docs.microsoft.com/en-us/aspnet/core/tutorials/web-api-vsc#implement-the-other-crud-operations" target="_blank"&gt;şuradan&lt;/a&gt; &amp;ouml;ğrenip araya sıkıştırayım dedim ve bu paragraf a&amp;ccedil;ılmış oldu.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[HttpPost]
public IActionResult Post([FromBody]Product newProduct)
{
	if(newProduct==null)
		return BadRequest();

	_context.Products.Add(newProduct);
	_context.SaveChanges();
	return CreatedAtRoute("GetProduct",new {id=newProduct.Id},newProduct);				
}&lt;/pre&gt;
&lt;p&gt;İlk olarak metodun IActionResult d&amp;ouml;nd&amp;uuml;recek şekilde değiştirildiğini belirtelim. FromBody niteliği &amp;uuml;r&amp;uuml;n bilgisinin HTTP talebinin Body kısmından okunacağını belirtmekte. Eğer bir &amp;uuml;r&amp;uuml;n bilgisi gelmezse BadRequest mesajı basılıyor. &amp;Uuml;r&amp;uuml;n&amp;uuml;n veritabanına eklenmesi işi standart bir Entity Framework işi. CreatedAtRoute fonksiyonu HTTP 201 mesajının basılmasını sağlarken aynı zamanda GetProduct isimli bir metoda talepte bulunuyor. Tahmin edeceğiniz &amp;uuml;zere yeni eklenen &amp;uuml;r&amp;uuml;n&amp;uuml;n id bilgisini kullanarak bir HTTP Get talebi yapmakta. &amp;Ouml;nemli olan kısım ilk parametredeki adın nerede tanımlandığı. Bunu anlayana kadar bir ka&amp;ccedil; hata aldım da...&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[HttpGet("{id}",Name="GetProduct")]
public IActionResult Get(int id)&lt;/pre&gt;
&lt;p&gt;Name niteliğine atanan değer CreateAtRoute'un kullandığı fonksiyon adı. B&amp;ouml;ylece istemciye hem işlemin başarılı olduğunu s&amp;ouml;yl&amp;uuml;yor hem de yeni oluşan &amp;uuml;r&amp;uuml;n i&amp;ccedil;eriğini g&amp;ouml;nderiyoruz. Tabii senaryoyu test etmenin en pratik yolu Postman gibi bir ara&amp;ccedil;tan yararlanarak JSON tipinden bir talep g&amp;ouml;ndermek. Aynen aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;lerinde olduğu gibi.&lt;img src="/image.axd?picture=/2017/10/corewebapi_13.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;--Derken--&lt;/strong&gt;&lt;/p&gt;
&lt;h1&gt;Varsayılan Port Bilgisinin Değiştirilmesi&lt;/h1&gt;
&lt;p&gt;Merak ettiğim konulardan birisi de 5000 nolu port bilgisini nasıl değiştirebileceğimdi. Bunun i&amp;ccedil;in Program.cs dosyasına uğramak gerekiyor. BuildWebHost fonksiyonunda ortamla ilişkili bir takım ayarlamalar yapılabilir. &amp;Ouml;rneğin 5555 nolu portun kullanılacağı bilgisi ifade edilebilir. UseUrls fonksiyonuna dikkat edelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public static IWebHost BuildWebHost(string[] args) =&amp;gt;
	WebHost.CreateDefaultBuilder(args)
		.UseStartup&amp;lt;Startup&amp;gt;()
		.UseUrls("http://localhost:5555/") 
		.Build();&lt;/pre&gt;
&lt;p&gt;Bu arada Fluent bir metod zinciri s&amp;ouml;z konusu olduğunu ifade edelim &lt;em&gt;(Bilmeyenler Fluent API nasıl yazılır, Fluent Interface nedir gibi sorularla bir araştırma yapsınlar derim. Buradaki pek &amp;ccedil;ok projemizde bu tip Fluent yapılar kullanıyoruz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/corewebapi_11.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Statik İ&amp;ccedil;eriklere İzin Verilmesi&lt;/h1&gt;
&lt;p&gt;Merak ettiğim bir diğer konu da hazır olarak gelen wwwroot klas&amp;ouml;r&amp;uuml;n&amp;uuml; hangi ama&amp;ccedil;larla kullanabileceğimizdi. Araştırmalarım sonucunda burada static sayfalara yer verebileceğimizi &amp;ouml;ğrendim ve ş&amp;ouml;yle bir HTML sayfası ekledim.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;
&amp;lt;body&amp;gt;
	Fabrika'da &amp;uuml;retilen &amp;lt;b&amp;gt;&amp;lt;a href="http://localhost:5555/fabrika/restapi/products"&amp;gt;&amp;uuml;r&amp;uuml;nler&amp;lt;/a&amp;gt;&amp;lt;/b&amp;gt;.
&amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;
&lt;/pre&gt;
&lt;p&gt;Ne varki sayfaya bir t&amp;uuml;rl&amp;uuml; erişemedim. Sonrasında statik dosyaları kullanacağımı &amp;ccedil;alışma zamanına bildirmem gerektiğini &amp;ouml;ğrendim. Bunun i&amp;ccedil;in startup.cs i&amp;ccedil;erisindeki Configure metodunda UseStaticFiles fonksiyon bildirimini yapmak yeterli.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void Configure(IApplicationBuilder app, IHostingEnvironment env)
{
	if (env.IsDevelopment())
	{
		app.UseDeveloperExceptionPage();
	}

	app.UseStaticFiles();
	app.UseMvc();
}&lt;/pre&gt;
&lt;p&gt;Sonrasında index.html sayfasının geldiğini de g&amp;ouml;rd&amp;uuml;m.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/corewebapi_12.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu arada varsayılan olarak wwwroot olarak tanımlanan klas&amp;ouml;r bilgisini UseWebRoot metodunu kullanarak farklı bir konuma da y&amp;ouml;nlendirebiliriz&lt;em&gt;(Static sayfaların kullanımı ile ilgili daha fazla detay da var. &lt;a href="https://docs.microsoft.com/en-us/aspnet/core/fundamentals/static-files" target="_blank"&gt;Şu adrese&lt;/a&gt; bakmanızı &amp;ouml;neririm)&lt;/em&gt;&lt;/p&gt;
&lt;h1&gt;Swagger Tabanlı Yardım Sayfasının Eklenmesi&lt;/h1&gt;
&lt;p&gt;&lt;a href="https://swagger.io/" target="_blank"&gt;Swagger&lt;/a&gt; altyapısını baz alan&amp;nbsp;Swashbuckle isimli NuGet paketini kullanarak etkileyici g&amp;ouml;r&amp;uuml;n&amp;uuml;me sahip yardım sayfaları oluşturabiliriz. B&amp;ouml;ylece API'nin versiyonu, ne t&amp;uuml;r operasyonlar i&amp;ccedil;erdiği, nasıl kullanıldığı hakkında bilgiler verebilir hatta o an &amp;ouml;rnek test verileri ile denemeler yaptırtabiliriz. Bunu denemek i&amp;ccedil;in ilk olarak komut satırından Fabrika isimli projeye ilgili paketi aşağıdaki ifadeyle ekledim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet add Fabrika.csproj package Swashbuckle.AspNetCore&lt;/pre&gt;
&lt;p&gt;Komutu &amp;ccedil;alıştırdıktan sonra proje dosyasına yeni bir PackageReference bildirimi eklendiğini g&amp;ouml;rebiliriz&lt;em&gt;(Bu arada bir paketi manuel olarak proje dosyasına&amp;nbsp;ekleyip dotnet restore komutu ile ilerlemek yerine bu şekilde işlem yapılabileceğini de &amp;ouml;ğrenmiş bulundum. Mutluyum)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;ItemGroup&amp;gt;
	&amp;lt;PackageReference Include="Microsoft.AspNetCore.All" Version="2.0.0" /&amp;gt;
	&amp;lt;PackageReference Include="Microsoft.EntityFrameworkCore.InMemory" Version="2.0.0" /&amp;gt;
	&amp;lt;PackageReference Include="Swashbuckle.AspNetCore" Version="1.0.0" /&amp;gt;
&amp;lt;/ItemGroup&amp;gt;&lt;/pre&gt;
&lt;p&gt;İlgili servisi kullanıma sunmak i&amp;ccedil;inse Startup.cs sınıfındaki ConfigureServices ve Configure metodlarında bazı değişiklikler yapılması&amp;nbsp;gerekiyor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;//Diğer isim alanları
using Swashbuckle.AspNetCore.Swagger;

namespace Fabrika
{
    public class Startup
    {
        public void ConfigureServices(IServiceCollection services)
        {
			//Diğer kodlar
			
			services.AddSwaggerGen(c =&amp;gt;
			{
				c.SwaggerDoc("v1", new Info { Title = "Fabrika API", Version = "v1" });
			});
        }

        public void Configure(IApplicationBuilder app, IHostingEnvironment env)
        {
			//Diğer kodlar
			
			app.UseSwagger();
			app.UseSwaggerUI(c=&amp;gt;
			{
				c.SwaggerEndpoint("/swagger/v1/swagger.json","Fabrika API v1.0");
			});
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İki &amp;ouml;nemli ek s&amp;ouml;z konusu. İlk olarak ConfigureServices metodu i&amp;ccedil;erisinde ilgili Swagger servisinin orta katmana eklenmesi sağlanıyor. Configure fonksiyonunda ise kullanıcı aray&amp;uuml;z&amp;uuml; i&amp;ccedil;in gerekli json i&amp;ccedil;eriğinin adresi&lt;em&gt;(Endpoint bilgisi)&lt;/em&gt; belirtilmekte ve Swagger &amp;ccedil;atısının kullanılacağı ifade edilmekte. Bu ekleri yaptıktan sonra aşağıdaki adrese talep g&amp;ouml;nderdim ve otomatik olarak &amp;uuml;retilen bir JSON &amp;ccedil;ıktısı ile karşılaştım.&lt;/p&gt;
&lt;p&gt;http://localhost:5555/swagger/v1/swagger.json&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/corewebapi_14.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sonrasında ise takip ettiğim MSDN dok&amp;uuml;manının s&amp;ouml;ylediği gibi doğrudan swagger adresine gittim.&lt;/p&gt;
&lt;p&gt;http://localhost:5555/swagger/&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil; inanılmaz g&amp;uuml;zeldi benim i&amp;ccedil;in&lt;em&gt;(Otursam b&amp;ouml;yle bir tasarım yapamayacağım i&amp;ccedil;in olsa gerek)&lt;/em&gt; Kendimi &amp;ccedil;ok fazla yormadan hazır bir swagger paketini kullanarak s&amp;ouml;z konusu API operasyonlarını g&amp;ouml;rebileceğim, test edebileceğim bir i&amp;ccedil;eriğe ulaştım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/corewebapi_15.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Artık Fabrika API'sinin yardım sayfası en temel haliyle hazır diyebiliriz. Pek tabi bunu &amp;ouml;zelleştirmek de gerekiyor ki gayet g&amp;uuml;zel bir şekilde &amp;ouml;zelleştirebiliyoruz. A&amp;ccedil;ıklamaları genişletebiliyor, XML Comment'leri kullanarak operasyonlar hakkında daha detaylı bilgiler verebiliyoruz vs...&amp;nbsp;&lt;a href="https://docs.microsoft.com/en-us/aspnet/core/tutorials/web-api-help-pages-using-swagger?tabs=netcore-cli" target="_blank"&gt;Şu adreste&lt;/a&gt; bu konu ile&amp;nbsp;ilgili detaylı bilgiye ulaşabilirsiniz.&amp;nbsp;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Mesela AddSwaggerGen fonksiyonunu aşağıdaki gibi zengileştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;services.AddSwaggerGen(c =&amp;gt;
{
	c.SwaggerDoc("v1", new Info { 
		Title = "Fabrika API"
		, Version = "v1" 
		, Description ="Fabrika'da &amp;uuml;retilen &amp;uuml;r&amp;uuml;nler hakkında bilgiler"
		, Contact=new Contact{
			Name="Burak Selim Şenyurt"
			, Email="", Url="http://www.buraksenyurt.com"},
		License=new License{
			Name="Under GNU"
			, Url="http://www.buraksenyurt.com"}
		});
});&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/corewebapi_16.gif" alt="" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;Son S&amp;ouml;zler&lt;/h1&gt;
&lt;p&gt;Yazıyı bitirmekte olduğum şu anda i&amp;ccedil;im biraz olsun huzurla doldu beynimdeki dopamin salınımı da arttı diyebilirim. En azından .Net Core 2.0'ı kullanarak, Visual Studio ailesine de el atmadan Notepad++ ile REST tabanlı basit bir Web API servisi yazabildim. Şimdi bunu evdeki Ubuntu &amp;uuml;zerinde&amp;nbsp;yapmaya &amp;ccedil;alışacağım.&lt;/p&gt;
&lt;p&gt;Tabii ger&amp;ccedil;ek hayat senaryolarında durum biraz daha farklı. Bir firmanın dışarıya a&amp;ccedil;acağı servis bazlı API'leri d&amp;uuml;ş&amp;uuml;nelim. Manuel olarak tek tek servis yazmak istenmeyecektir. Şirket i&amp;ccedil;indeki hazır veri &amp;uuml;retimi yapan birimlerin dinamik kodlar yardımıyla ayağa kalkacak servisler şeklinde sunulmasına &amp;ccedil;alışılacaktır. Kısacası bu tip Web API'leri bir Factory yardımıyla dinamik olarak nasıl &amp;uuml;retebiliriz sorusu da g&amp;uuml;ndeme geliyor. &amp;Ouml;rneğin şirketinizde n sayıda k&amp;uuml;t&amp;uuml;phanenin belirli fonksiyonlarının Web API'ler ile a&amp;ccedil;ılacağını d&amp;uuml;ş&amp;uuml;n&amp;uuml;n. Her bir k&amp;uuml;t&amp;uuml;phane i&amp;ccedil;in Web API servisi yazmaya &amp;ccedil;alışmak yerine otomatik olarak bunları ayağa kaldıracak, yetkilendirmelere tabii tutacak bir mekanizma yazmak &amp;ccedil;ok daha avantajlı olacaktır. Bu a&amp;ccedil;ılardan konuyu d&amp;uuml;ş&amp;uuml;nmemizde ve &amp;ouml;ğrenmeye devam etmemizde yarar olduğu kanısındayım. B&amp;ouml;ylece geldim bir makalemin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;h2&gt;Yazmaya &amp;Uuml;şenenler İ&amp;ccedil;in&lt;/h2&gt;
&lt;p&gt;&lt;a class="download" href="/file.axd?file=/2017/10/ProductsController.cs"&gt;ProductsController.cs (2,38 kb)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a class="download" href="/file.axd?file=/2017/10/FabrikaContext.cs"&gt;FabrikaContext.cs (271,00 bytes)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a class="download" href="/file.axd?file=/2017/10/Product.cs"&gt;Product.cs (161,00 bytes)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a class="download" href="/file.axd?file=/2017/10/Program.cs"&gt;Program.cs (665,00 bytes)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a class="download" href="/file.axd?file=/2017/10/Startup.cs"&gt;Startup.cs (1,31 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2017-10-04 09:58:00</pubDate>
  <slug>net-core-2-0-ile-basit-bir-web-api-gelistirmek</slug>
  <tags>
    <tag>net-core</tag>
    <tag>web-api</tag>
    <tag>rest-services</tag>
    <tag>http</tag>
    <tag>entity-framework</tag>
    <tag>entity-framework-core</tag>
    <tag>swagger</tag>
    <tag>net-core-20</tag>
    <tag>core</tag>
    <tag>rest-api</tag>
    <tag>middleware</tag>
    <tag>mvc</tag>
    <tag>model-view-controller</tag>
    <tag>dotnet</tag>
    <tag>build</tag>
    <tag>run</tag>
    <tag>restore</tag>
    <tag>command-prompt</tag>
  </tags>
  <categories>
    <category>Asp.Net Web API</category>
  </categories>
</post>