<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ado.Net Data Services 1.5 CTP2 - Web Friendly Feeds</title>
  <description>Ado.Net Data Services v1.5 CTP1 ile gelen Web Friendly Feeds özelliği, CTP2 sürümünde eklenen iki yeni eşleştirme seçeneği ile genişletilmiştir. Durun bir dakika...Web Friendly Feeds nedir? Undecided Arkadaşlıktan farklı bir şey olsa gerek Wink Öncelikle bu konuya açıklık getirmek gerekiyor. Web Friendly Feeds özelliği, bir Entity'nin herhangibir özelliğini(Property), Ado.Net Data Service' inden çıktı olarak üretilen Atom içeriğindeki bir elemente eşleştirmekte kullanılmaktadır. Nitekim servisin ürettiği varsayılan Atom içeriğinde yer alan author name, url, title vs... gibi bilgiler zaten standart olarak kabul edilmiştir ve bu nedenle söz konusu elementleri değerlendiren yorumlayıcılara, var olan Entity içeriğindeki bazı özellik değerlerinin aktarılması istenebilir. Bir başka deyişle, servisin ürettiği içeriğin kaynağındaki özelliklerin çıktıda map edileceği yerler, Atom içeriğindeki belirli noktalar olarak belirlenebilir.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f9%2fblg80_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Ado.Net Data Services v1.5 CTP1&lt;/strong&gt; ile gelen &lt;strong&gt;Web Friendly Feeds&lt;/strong&gt; &amp;ouml;zelliği, &lt;strong&gt;CTP2 &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml;nde eklenen iki yeni eşleştirme se&amp;ccedil;eneği ile genişletilmiştir. Durun bir dakika...&lt;strong&gt;Web Friendly Feeds &lt;/strong&gt;nedir? &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;Arkadaşlıktan farklı bir şey olsa gerek &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;&amp;Ouml;ncelikle bu konuya a&amp;ccedil;ıklık getirmek gerekiyor.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Web Friendly Feeds&lt;/strong&gt; &amp;ouml;zelliği, bir &lt;strong&gt;Entity&lt;/strong&gt;'nin herhangibir &lt;strong&gt;&amp;ouml;zelliğini(Property)&lt;/strong&gt;, &lt;strong&gt;Ado.Net Data Service'&lt;/strong&gt; inden &amp;ccedil;ıktı olarak &amp;uuml;retilen &lt;strong&gt;Atom &lt;/strong&gt;i&amp;ccedil;eriğindeki bir &lt;strong&gt;elemente &lt;/strong&gt;eşleştirmekte kullanılmaktadır. Nitekim servisin &amp;uuml;rettiği varsayılan &lt;strong&gt;Atom&lt;/strong&gt; i&amp;ccedil;eriğinde yer alan &lt;strong&gt;author name, url, title&lt;/strong&gt; vs... gibi bilgiler zaten standart olarak kabul edilmiştir ve bu nedenle s&amp;ouml;z konusu elementleri değerlendiren yorumlayıcılara, var olan Entity i&amp;ccedil;eriğindeki bazı &amp;ouml;zellik değerlerinin aktarılması istenebilir. Bir başka deyişle, servisin &amp;uuml;rettiği i&amp;ccedil;eriğin kaynağındaki &amp;ouml;zelliklerin&amp;nbsp;&amp;ccedil;ıktıda map edileceği yerler, Atom i&amp;ccedil;eriğindeki belirli noktalar olarak belirlenebilir.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak eşleştirmenin &amp;ccedil;alışma zamanında değerlendirilmesi gerekmektedir. &lt;strong&gt;Ado.Net Data Servislerin&lt;/strong&gt;, arka planda &lt;strong&gt;Entity Framework&lt;/strong&gt; veya &lt;strong&gt;Custom LINQ Provider &lt;/strong&gt;kullandığı d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde, eşleştirme işleminin nerede bildirileceği şu anda bizim i&amp;ccedil;in &amp;ouml;ğrenilmesi gereken yegane noktadır. Bir geliştirici olarak s&amp;ouml;z konusu eşleştirme bildirimlerinin &lt;strong&gt;nitelik(attribute)&lt;/strong&gt; veya &lt;strong&gt;konfigurasyon&lt;/strong&gt; bazlı olarak yapılacağının d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmesi son derece doğaldır ki bunların &amp;ccedil;alışma zamanında ele alınması gerekmektedir. Biz bu yazımızda &amp;ouml;nce eksikliği anlamaya &amp;ccedil;alışacak, sonrasında ise &lt;strong&gt;Entity Framework&lt;/strong&gt; kullanılması halinde eşleştirmeyi nasıl ger&amp;ccedil;ekleştirebileceğimizi inceleyeceğiz.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikle basit bir &lt;strong&gt;Asp.Net Web &lt;/strong&gt;uygulaması oluşturalım ve aşağıdaki &lt;strong&gt;EDM &lt;/strong&gt;grafiğinde g&amp;ouml;r&amp;uuml;len &lt;strong&gt;Ado.Net Entity Data Model&lt;/strong&gt; &amp;ouml;ğesini s&amp;ouml;z konusu projeye ekleyelim. Her zamanki gibi kobay olarak AdventureWorks veritabanını hedef alıyor olacağız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f9%2fblg80_Edm.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Contact &lt;/strong&gt;tablosunu değerlendirmek amacıyla basit bir &lt;strong&gt;Ado.Net Data Services v1.5 CTP2 &lt;/strong&gt;&amp;ouml;ğesini projeye ekleyerek devam edelim. &amp;Ouml;ğemizin kod i&amp;ccedil;eriğini aşağıdaki gibi geliştirmemiz konumuz i&amp;ccedil;in yeterlidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Data.Services;

namespace WebFriendlyFeed
{
    public class AdventureServices 
        : DataService&amp;lt;AdventureWorksEntities&amp;gt;
    {
        public static void InitializeService(DataServiceConfiguration config)
        {           
            config.SetEntitySetAccessRule("*", EntitySetRights.AllRead);        
            config.DataServiceBehavior.MaxProtocolVersion = System.Data.Services.Common.DataServiceProtocolVersion.V2;
     }
    }
}&lt;/pre&gt;
&lt;p&gt;S&amp;ouml;z konusu servis &amp;uuml;zerinden Contact tablosundaki &amp;ouml;rneğin ilk 3 satırı talep ettiğimizde aşağıdakine benzer bir &amp;ccedil;ıktı elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f9%2fblg80_FirstRun.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Eksiklik şudur; standart &lt;strong&gt;atom feed&lt;/strong&gt; i&amp;ccedil;eriğinde yer alan &lt;strong&gt;author/name &lt;/strong&gt;ve &lt;strong&gt;title &lt;/strong&gt;elementlerinin i&amp;ccedil;eriği boştur. Bu bilgilerin eksik olması şu aşamada &amp;ouml;nemli değilmiş gibi g&amp;ouml;r&amp;uuml;nebilir. Ama bu &lt;strong&gt;atom feed &lt;/strong&gt;&amp;ccedil;ıktısını değerlendiren bir uygulamada s&amp;ouml;z konusu alanlar belirli ama&amp;ccedil;lar ile kullanılıyor olabilir ve bu nedenden boş olmaları yararlı olmayabilir. &amp;Ouml;rneğin &lt;strong&gt;Internet Explorer' &lt;/strong&gt;ın feed i&amp;ccedil;eriklerini g&amp;ouml;rsel olarak yorumlama &amp;ouml;zelliğini&lt;strong&gt;(Turn on feed reading view)&lt;/strong&gt; a&amp;ccedil;tığımızda aynı sorgu aşağıdaki sonucu &amp;uuml;retecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f9%2fblg80_FirstRunViewer.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ilk etapta &lt;strong&gt;feed entry'&lt;/strong&gt; leri ile ilişkili &lt;strong&gt;title &lt;/strong&gt;veya &lt;strong&gt;author/name &lt;/strong&gt;gibi elementler doldurulmadığı i&amp;ccedil;in okunabilir bir i&amp;ccedil;eriğin oluşmadığı g&amp;ouml;r&amp;uuml;lmektedir. &amp;Uuml;stelik &lt;strong&gt;Title &lt;/strong&gt;gibi alanlara g&amp;ouml;re sıralama işlemi yapılmasıda m&amp;uuml;mk&amp;uuml;n değildir. İşte &lt;strong&gt;Ado.Net Data Services 1.5&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nde getirilen &lt;strong&gt;Web Friendly Feed &lt;/strong&gt;&amp;ouml;zelliği, s&amp;ouml;z konusu standart &lt;strong&gt;entry elementlerinden&amp;nbsp;&lt;/strong&gt;bazılarının, &lt;strong&gt;entity &lt;/strong&gt;i&amp;ccedil;eriğinden beslenmesini sağlayabilmektedir. Peki ama nasıl? &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;&amp;Ouml;rneğimizde &lt;strong&gt;Entity Framework&lt;/strong&gt; modeli kullanıldığından, &lt;strong&gt;Conceptual Schema Definition Language(CSDL)&lt;/strong&gt; i&amp;ccedil;eriğinde bazı ayarlamalar yapılması gerekmektedir. &lt;em&gt;(Tabi Entity modelinin &lt;strong&gt;Update &lt;/strong&gt;edilmesi halinde bu değişikliklerin u&amp;ccedil;abileceğini hatırlatmam gerekir.)&lt;/em&gt; Aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f9%2fblg80_EdmChange.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak bir &lt;strong&gt;namespace &lt;/strong&gt;ilave edildiğini g&amp;ouml;r&amp;uuml;yoruz. Bu namespace ilave edilmez ise, &lt;strong&gt;FC_KeepInContent &lt;/strong&gt;veya &lt;strong&gt;FC_TargetPath &lt;/strong&gt;gibi nitelikleri kullanamayız. Yeri gelmişken bu niteliklerin ne iş yaptıklarını a&amp;ccedil;ıklayalım. &lt;strong&gt;CSDL &lt;/strong&gt;i&amp;ccedil;eriğinde yer alan &lt;strong&gt;FirstName &lt;/strong&gt;&amp;ouml;zelliğinin değerinin &lt;strong&gt;Atom Feed &lt;/strong&gt;i&amp;ccedil;erisindeki &lt;strong&gt;author/name &lt;/strong&gt;elementinde &amp;ccedil;ıkması i&amp;ccedil;in &lt;strong&gt;FC_TargetPath &lt;/strong&gt;niteliğine &lt;strong&gt;SyndicationAuthorName &lt;/strong&gt;değeri atanmıştır. Benzer şekilde &lt;strong&gt;Atom Feed &lt;/strong&gt;i&amp;ccedil;eriğinin bir &lt;strong&gt;Contact &lt;/strong&gt;i&amp;ccedil;in &amp;uuml;retilen &lt;strong&gt;Title &lt;/strong&gt;elementinde &lt;strong&gt;LastName &lt;/strong&gt;&amp;ouml;zelliğinin değerinin &amp;ccedil;ıkması i&amp;ccedil;in, FC_&lt;strong&gt;TargetPath&lt;/strong&gt; niteliğine &lt;strong&gt;SyndicationTitle &lt;/strong&gt;değeri atanmıştır.&lt;/p&gt;
&lt;p&gt;Aynı işlem &lt;strong&gt;Email &lt;/strong&gt;adresi i&amp;ccedil;inde ger&amp;ccedil;ekleştirilmiş ve &amp;ouml;zellik değerinin &lt;strong&gt;author/email &lt;/strong&gt;elementinde &amp;ccedil;ıkması i&amp;ccedil;in &lt;strong&gt;FC_TargetPath &lt;/strong&gt;niteliğine &lt;strong&gt;SyndicationAuthorEmail &lt;/strong&gt;değeri atanmıştır. Buna g&amp;ouml;re &lt;strong&gt;FC_TargetPath &lt;/strong&gt;niteliğinin değerinin, &lt;strong&gt;entity &lt;/strong&gt;&amp;ouml;zelliğinin hangi &lt;strong&gt;atom &lt;/strong&gt;alanında &amp;ccedil;ıkacağını belirttiğini ifade edebiliriz. &lt;strong&gt;FC_KeepInContent &lt;/strong&gt;niteliğine atanan &lt;strong&gt;false &lt;/strong&gt;değeri ilede, &lt;strong&gt;atom feed' &lt;/strong&gt;in element noktlarında &amp;ccedil;ıkan değerlerin, &amp;uuml;retilen &lt;strong&gt;Contact &lt;/strong&gt;elementine ait &lt;strong&gt;content &lt;/strong&gt;i&amp;ccedil;eriğinde &lt;span style="text-decoration: underline;"&gt;g&amp;ouml;sterilmemesi&lt;/span&gt; sağlanmaktadır. Buna g&amp;ouml;re biraz &amp;ouml;nce yaptığımız talebi tekrarlarsak aşağıdaki &amp;ccedil;ıktıları alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f9%2fblg80_SecondRunPreview.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ve atom &amp;ccedil;ıktısını i&amp;ccedil;eriği;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f9%2fblg80_SecondRunSource.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;FirstName&lt;/strong&gt; ve &lt;strong&gt;EmailAddress &lt;/strong&gt;bilgileri, &lt;strong&gt;author &lt;/strong&gt;elementi altındaki &lt;strong&gt;name &lt;/strong&gt;ve &lt;strong&gt;email &lt;/strong&gt;alt elementlerine yazılmıştır. Ayrıca &lt;strong&gt;entry' &lt;/strong&gt;nin &lt;strong&gt;title &lt;/strong&gt;elementinin i&amp;ccedil;eriğinede &lt;strong&gt;LastName &lt;/strong&gt;&amp;ouml;zelliğinin değerinin yazıldığı g&amp;ouml;r&amp;uuml;lmektedir. Bununla birlikte buradaki &amp;ouml;zellikler, &lt;strong&gt;entry &lt;/strong&gt;elementi altındaki &lt;strong&gt;content &lt;/strong&gt;elementi i&amp;ccedil;eriğindende &amp;ccedil;ıkartılmıştır. S&amp;uuml;per &lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt;&amp;nbsp;Peki &lt;strong&gt;Atom Feed Entry Elementlerinden &lt;/strong&gt;hangilerine atamalar yapabiliriz? İşte &lt;strong&gt;Ado.Net Data Services v1.5 CTP2 &lt;/strong&gt;eklentilerinin de yer aldığı son liste.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Entity tip &amp;ouml;zelliklerini hangi Atom Entry elementlerine eşleştirebiliriz.&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;author/email&amp;nbsp;-&amp;gt; SyndicationItemProperty.AuthorEmail &lt;br /&gt;author/name -&amp;gt; SyndicationItemProperty.AuthorName &lt;br /&gt;author/uri&amp;nbsp; -&amp;gt; SyndicationItemProperty.AuthorUri &lt;br /&gt;published&amp;nbsp; -&amp;gt; SyndicationItemProperty.Published &lt;br /&gt;rights&amp;nbsp; -&amp;gt; SyndicationItemProperty.Rights &lt;br /&gt;summary&amp;nbsp;-&amp;gt; SyndicationItemProperty.Summary &lt;em&gt;(CTP2 ile Gelmiştir)&lt;/em&gt;&lt;br /&gt;title&amp;nbsp; -&amp;gt; SyndicationItemProperty.Title &lt;br /&gt;Updated -&amp;gt; SyndicationItemProperty.Updated &lt;em&gt;(CTP2 ile Gelmiştir)&lt;/em&gt;&lt;br /&gt;contributor/name -&amp;gt; SyndicationItemProperty.ContributorName &lt;br /&gt;contributor/email -&amp;gt; SyndicationItemProperty.ContributorEmail &lt;br /&gt;contributor/uri -&amp;gt; SyndicationItemProperty.ContributorUri&lt;/p&gt;
&lt;p&gt;Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f9%2fWebFriendlyFeed.rar"&gt;WebFriendlyFeed.rar (35,28 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-10-31 11:25:00</pubDate>
  <slug>AdoNet-Data-Services-15-CTP2-Web-Friendly-Feeds</slug>
  <tags>
    <tag>adonet-data-services</tag>
    <tag>web-firendly-feeds</tag>
    <tag>linq</tag>
    <tag>entity-framework</tag>
    <tag>odata</tag>
  </tags>
  <categories>
    <category>Ado.Net Data Services</category>
  </categories>
</post>