<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>.Net Remoting - Lease Time (Kiralık Süre) Yönetimi</title>
  <description>Remoting mimarisi göz önüne alındığında dikkat çekici noktalardan bir tanesi, sunucu tarafında oluşturulan uzak nesnelerin (remote object) yaşam süreleridir. İstemciler, uzak nesnelere ait referansları kullanırken bunların yaşam sürelerini sunucu tarafındaki konfigurasyon belirler. Bu istemcilerin sunucu tarafındaki referanslara ait kaynaklara açıkça müdahale edememesinin de bir sonucu olarak görülebilir. Sunucu tarafında yapılan bu yaşam sürelerinin yönetimine kısaca Kiralık Süre Yönetimi (Lease Time Management) denmektedir. Bu makalemizde kısaca bu konuyu incelemeye çalışacağız.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Remoting mimarisi g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında dikkat &amp;ccedil;ekici noktalardan bir tanesi, sunucu tarafında oluşturulan uzak nesnelerin (remote object) yaşam s&amp;uuml;releridir. İstemciler, uzak nesnelere ait referansları kullanırken bunların yaşam s&amp;uuml;relerini sunucu tarafındaki konfigurasyon belirler. Bu istemcilerin sunucu tarafındaki referanslara ait kaynaklara a&amp;ccedil;ık&amp;ccedil;a m&amp;uuml;dahale edememesinin de bir sonucu olarak g&amp;ouml;r&amp;uuml;lebilir. Sunucu tarafında yapılan bu yaşam s&amp;uuml;relerinin y&amp;ouml;netimine kısaca Kiralık S&amp;uuml;re Y&amp;ouml;netimi (Lease Time Management) denmektedir. Bu makalemizde kısaca bu konuyu incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;Bir istemci, uzak nesneye ait bir referans oluşturduğunda sunucu tarafında bu referans i&amp;ccedil;in bir geri sayım s&amp;uuml;resi başlatılır. Buna &amp;ccedil;oğunlukla &lt;strong&gt;Initial Lease Time&lt;/strong&gt; (Başlangı&amp;ccedil; Kiralama S&amp;uuml;resi) denir. Bu s&amp;uuml;re geriye doğru hareket eder ve sunucu tarafında &amp;ccedil;alışan &lt;strong&gt;Lease Manager &lt;/strong&gt;yardımıyla belirli aralıklarla (varsayılan olarak 10 saniyede 1) kontrol edilir. Eğer bir referansın geriye doğru işleyen kiralama s&amp;uuml;resi sonlanırsa (ki bu o anki s&amp;uuml;renin 0 olması anlamına gelir), garbage collector tarafından toplanılmak &amp;uuml;zere işaretlenir. İşte bu andan sonra istemci, aynı referansa ait bir &amp;uuml;yeyi &amp;ccedil;ağırdığında&amp;nbsp; &amp;ccedil;alışma zamanında bir exception ile karşılaşır. Bunun sebebi istemci tarafından oluşturulan uzak nesnenin sunucu &amp;uuml;zerindeki kiralama s&amp;uuml;resinin sıfırlanmış bir başka deyişle yaşam s&amp;uuml;resinin bitmiş olması ve bu nesneye ait referansın artık sunucuda bulunamayışıdır.&lt;/p&gt;
&lt;p&gt;Başlangı&amp;ccedil;ta bir uzak nesnenin &lt;strong&gt;InitialLeaseTime&lt;/strong&gt; s&amp;uuml;resi 300 saniyedir. Yani 5 dakika kiralama s&amp;uuml;resi s&amp;ouml;z konusudur. İstemcileri var olmayan bir referansa ait metodları &amp;ccedil;ağırmaları halinde karşılaşacakları exception' lardan korumanın &amp;ccedil;eşitli yolları vardır. Bunlardan birisi uzak nesneye ait &lt;strong&gt;RenewOnCallTime&lt;/strong&gt; &amp;ouml;zelliğinin değeridir. Bu değere verilen s&amp;uuml;re, bir uzak nesne referansının Lease Time s&amp;uuml;resi dolmadan &amp;ouml;nce, istemci tarafından gelebilecek bir metod &amp;ccedil;ağırımının ele alınmasında &amp;ouml;nemli rol oynamaktadır. Bunu ş&amp;ouml;yle a&amp;ccedil;ıklayabiliriz. Bir uzak nesnenin kiralama s&amp;uuml;resinin 6 saniye olduğunu ve RenewOnCallTime s&amp;uuml;resininde 2 saniye olduğunu d&amp;uuml;ş&amp;uuml;nelim. İstemci uzak nesneye ait bir referansı ilk oluşturduğunda, kiralama s&amp;uuml;resi geriye doğru azalmaya başlayacaktır. Sunucu &amp;uuml;zerindeki g&amp;uuml;ncel kiralama s&amp;uuml;resi (Current Lease Time) 2 saniyeye geldiğinde, eğer istemci tarafından bir metod &amp;ccedil;ağırısı daha yapılırsa, nesnenin kiralama s&amp;uuml;resi otomatik olarak RenewOnCallTime' da belirtilen s&amp;uuml;reye ayarlanır. Bu durumda bu s&amp;uuml;re 2 saniye olacaktır. RenewOnCallTime s&amp;uuml;resinin işleyişini &amp;ouml;rneklerimizde daha yakından analiz edeceğiz ve daha kolay anlayacağız.&lt;/p&gt;
&lt;p&gt;Uzak nesnelere ait referansların yaşam s&amp;uuml;relerini istersek değiştirebiliriz. Bunu ger&amp;ccedil;ekleştirebilmek i&amp;ccedil;in uzak nesneye ait kalıtım yolu ile gelen &lt;strong&gt;InitializeLifeTimeService&lt;/strong&gt; isimli metodu override (ezmek) etmemiz gerekecektir. Bu metod temel olarak uygulandığı tipe ait kiralama s&amp;uuml;relerinin y&amp;ouml;netiminin sağlanmasından sorumludur. Buradaki ayarlamalar yardımıyla bir uzak nesne referansının InitialLeaseTime ve RenewOnCallTime s&amp;uuml;relerini ayarlayabiliriz. Hatta referansın sonsuza dek (elbetteki &amp;ccedil;evre koşulları uygun olduğu s&amp;uuml;rece) yaşamasınıda sağlayabiliriz.&lt;/p&gt;
&lt;table id="table40" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Kiralama s&amp;uuml;relerinin (Lease Time) y&amp;ouml;netimi sadece Client Activated Object' ler i&amp;ccedil;in ve Server Activated Object' lerdede sadece Singleton modeli i&amp;ccedil;in ge&amp;ccedil;erlidir. Yani SingleCall i&amp;ccedil;in kiralama s&amp;uuml;releri uygulanamaz. Nitekim SingleCall modelinde uzak nesne referansları metod &amp;ccedil;ağırımlarından sonra zaten yok edilirler. &lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Şimdi kiralama s&amp;uuml;relerini y&amp;ouml;netebileceğimiz basit bir &amp;ouml;rnek ile konumuzun derinlerine inmeye &amp;ccedil;alışalım. İlk olarak RenewOnCallTime s&amp;uuml;resinin sağladığı etkiyi incelemeye &amp;ccedil;alışacağız. Sunucu tarafımızda yer alacak uzak nesne modelinde, kiralama s&amp;uuml;relerini y&amp;ouml;neteceğiz ve ardından istemci tarafında bu nesneye ait &amp;ouml;rneklemelerin ve &amp;uuml;ye &amp;ccedil;ağırımlarının etkilerini incelemeye &amp;ccedil;alışacağız. Model olarak işimizi kolaylaştırması a&amp;ccedil;ısından Client Activated Object tipinden uzak nesneler kullanacağız. İlk olarak uzak nesnemizi aşağıdaki gibi oluşturalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class RemoteObj : MarshalByRefObject
{
    public string Info(string prm)
    {
        return "Remote Metod " + prm;
    }

    public RemoteObj()
    {
        Console.WriteLine("Nesne oluşturuldu...");
    }

    public override object InitializeLifetimeService()
    {
        ILease lease = (ILease)base.InitializeLifetimeService();
        if (lease.CurrentState == LeaseState.Initial)
        {
            lease.InitialLeaseTime = TimeSpan.FromSeconds(6);
            lease.RenewOnCallTime = TimeSpan.FromSeconds(2);
        }
        return lease;
    }
}&lt;/pre&gt;
&lt;p&gt;Uzak nesnemizi incelediğimizde bizim i&amp;ccedil;in belkide en &amp;ouml;nemli metod override edilmiş olan InitializeLifeTimeService' dır. Peki bu ezme işlemi ile ne yapıyoruz biz? Bu metod tam olarak &amp;ccedil;alışma zamanında bir uzak nesnenin ilk oluşturulduğu sırada, sadece o nesne &amp;ouml;rneğine ait referans i&amp;ccedil;in ge&amp;ccedil;erli olacak kiralama s&amp;uuml;relerini belirlemektedir. &amp;Ouml;rneğin buradaki değerlere g&amp;ouml;re referans 6 saniye boyunca sunucu &amp;uuml;zerinde kiralanacaktır. Eğer nesnenin &amp;ouml;mr&amp;uuml;n&amp;uuml;n bitmesine 2 saniye kaldığında, bu son s&amp;uuml;re i&amp;ccedil;erisinde de bir metod &amp;ccedil;ağırımı ger&amp;ccedil;ekleşirse kiralama s&amp;uuml;resi RenewOnCallTime' da belirtildiği &amp;uuml;zere 2 saniyeye set edilecektir. Nesnemizin bu yaşam s&amp;uuml;releri ile kullanışını incelemek amacıyla sunucu ve istemci tarafındaki kodlarımızı aşağıdaki gibi geliştirelim.&lt;/p&gt;
&lt;p&gt;Sunucu;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
    TcpServerChannel srvC = new TcpServerChannel(4500);
    ChannelServices.RegisterChannel(srvC,true);
    RemotingConfiguration.RegisterActivatedServiceType(typeof(RemoteObj));
    LifetimeServices.LeaseManagerPollTime=TimeSpan.FromSeconds(1);
    Console.WriteLine("Server dinlemede...");
    Console.ReadLine();
}&lt;/pre&gt;
&lt;p&gt;Sunucu tarafında yer alan kodlarımızda, LeaseManager i&amp;ccedil;in LeaseManagerPollTime s&amp;uuml;resini 1 saniye olarak ayarlamaktayız. Bu, LeaseManager' ın her bir saniyede, sunucu &amp;uuml;zerindeki uzak nesne referanslarının kiralama s&amp;uuml;relerini kontrol edeceği anlamına gelmektedir.&lt;/p&gt;
&lt;p&gt;İstemci;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
    try
    {
        TcpClientChannel cliC = new TcpClientChannel();
        ChannelServices.RegisterChannel(cliC, true);
        RemotingConfiguration.RegisterActivatedClientType(typeof(RemoteObj), "tcp://manchester:4500/");
        RemoteObj rmo = new RemoteObj();
        for (int i = 1; i &amp;lt; 6; i++)
        {
            Console.WriteLine(rmo.Info("Test " + i.ToString()));
            ILease currLease = (ILease)rmo.GetLifetimeService();
            Console.WriteLine(currLease.CurrentLeaseTime.ToString());
            System.Threading.Thread.Sleep(2000);
        }
    }
    catch (System.Exception err)
    {
        Console.WriteLine(err.Message);
    }
    Console.ReadLine();
}&lt;/pre&gt;
&lt;p&gt;İstemci tarafında yaptıklarımıza gelince. Burada uzak nesneye ait &amp;ouml;rnek oluşturulduktan sonra, bu referansa ait Info isimli metod arka arkaya 6 kez &amp;ccedil;alıştırılmaktadır. Her bir metod &amp;ccedil;ağırımından sonra uzak nesne referansının sunucu &amp;uuml;zerinde kalan kiralama s&amp;uuml;resi &amp;ouml;mr&amp;uuml; istemci tarafındaki Console penceresine yazılmaktadır. Daha sonrasında ise process 2 saniye kadar uyutulur. Şimdi uygulamanın &amp;ccedil;alışmasını izleyelim. &lt;em&gt;(Aşağıdaki video g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; flash formatında olup bilgisayarınıza flash player kurmanızı gerektirebilir.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;object id="obj1" width="405" height="445" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/Lease_1.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="405" height="445" src="http://www.buraksenyurt.com/makale/images/Lease_1.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj1" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;Burada dikkat ederseniz, metodun 3nc&amp;uuml; &amp;ccedil;ağırılışından itibaren nesneye ait kiralama s&amp;uuml;resi hep 2 saniye olarak kalmıştır. Bunun sebebi, 2nci &amp;ccedil;ağırıştan sonra gelen 3nc&amp;uuml; metod &amp;ccedil;ağırışının artık RenewOnCallTime s&amp;uuml;resi sınırlarına dahil olmasıdır. Bu nedenle referansa ait kiralama s&amp;uuml;resi sonraki &amp;ccedil;ağırımlarda s&amp;uuml;rekli olarak 2 saniyeye set edilmiştir. Bu sayede istemci 6 metod &amp;ccedil;ağırımınıda başarılı bir şekilde yapabilmiştir. Oysaki kiralama s&amp;uuml;releri aslında &amp;ccedil;ok hassas dengeler &amp;uuml;zerinde &amp;ccedil;alışmaktadır. Yapılacak ufak hatalar istemcileri başına sorun a&amp;ccedil;abilir. Bunu g&amp;ouml;rmek i&amp;ccedil;in istemci tarafındaki bekleme s&amp;uuml;resini 4 saniyeye &amp;ccedil;ıkartalım ve uygulamamızı yeniden test edelim.&lt;em&gt;(Aşağıdaki video g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; flash formatında olup bilgisayarınıza flash player kurmanızı gerektirebilir.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;object id="obj2" width="405" height="445" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/Lease_2.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="405" height="445" src="http://www.buraksenyurt.com/makale/images/Lease_2.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj2" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;Dikkat ederseniz, 3nc&amp;uuml; metod &amp;ccedil;ağırımında uygulama bir istisna ile sonlanmaktadır. İlk metod &amp;ccedil;ağırımında kiralama s&amp;uuml;resi yaklaşık olarak 6 saniye civarındadır. İkinci &amp;ccedil;ağırıma ge&amp;ccedil;erken uygulama 4 saniye duraksamıştır. Bu nedenle kiralama s&amp;uuml;resi bu nesne &amp;ouml;rneğimiz i&amp;ccedil;in yaklaşık 2 saniyeye kadar inmiştir. 3nc&amp;uuml; metod &amp;ccedil;ağırımında &amp;ouml;nce istemci uygulama 4 saniye daha bekler. Oysa bu s&amp;uuml;re i&amp;ccedil;erisinde, uzak nesne referansı kiralama &amp;ouml;mr&amp;uuml;n&amp;uuml; doldurduğundan, garbage collector tarafından toplanılmak &amp;uuml;zere işartlenir. Dahası bu 4 saniyelik bekleme s&amp;uuml;resi i&amp;ccedil;erisinde başka bir metod &amp;ccedil;ağırımı olmadığından RenewOnCallTime s&amp;uuml;resinin sınırlarıda artık ge&amp;ccedil;erli değildir.&lt;/p&gt;
&lt;p&gt;Dolayısıyla istemci artık olmayan bir referansa &amp;ccedil;ağrıda bulunmaya &amp;ccedil;alışmaktadır. Bunun doğal sonucu olarakta istemci uygulamada bir istisna oluşacaktır. Dolayısıyla &amp;ccedil;alışma zamanında bu gibi durumların oluşabileceğini d&amp;uuml;ş&amp;uuml;nmek ve buna g&amp;ouml;re hareket etmekte fayda vardır. Dilerseniz, bir uzak nesne referansının m&amp;uuml;mk&amp;uuml;n olduğunca uzun s&amp;uuml;re yaşamasını isteyebilirsiniz. Buna genellikle sonsuz kiralama s&amp;uuml;resi &lt;strong&gt;(infinity lease time)&lt;/strong&gt; denir. Bunun i&amp;ccedil;in tek yapmanız gereken uzak nesnede ezdiğimiz InitializeLifetimeService metodundan geriye null bir referans d&amp;ouml;nd&amp;uuml;rmek olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public override object InitializeLifetimeService()
{
    return null;
}&lt;/pre&gt;
&lt;p&gt;Bu durumda az &amp;ouml;nce duraklama s&amp;uuml;resi 4 saniye olan istemci uygulamayı &amp;ccedil;alıştırdığımızda bir sorun ile karşılaşmadan t&amp;uuml;m metod &amp;ccedil;ağrıların sonu&amp;ccedil;landırıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. &lt;em&gt;(Aşağıdaki video g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; flash formatında olup bilgisayarınıza flash player kurmanızı gerektirebilir.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;object id="obj3" width="397" height="437" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/Lease_3.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="397" height="437" src="http://www.buraksenyurt.com/makale/images/Lease_3.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj3" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;Tabi burada istemci tarafında dikkat edilmesi gereken bir husus vardır. Buda Infinity Lease Time olması durumunda, istemci &amp;uuml;zerinden o anki referansa ait CurrentLeaseTime s&amp;uuml;resinin okunamayacağıdır. Buda &amp;ccedil;alışma zamanında istisnaya neden olacak bir durumdur.&lt;/p&gt;
&lt;p&gt;Bir uzak nesneye ait kiralama s&amp;uuml;relerini sadece kod tarafında değil xml tabanlı konfigurasyon dosyalarında da tutabiliriz. Bildiğiniz gibi, Remoting uygulamalarının daha esnek olması a&amp;ccedil;ısından channel, port, type, objectUri gibi bir takım bilgileri konfigurasyon dosyalarında tutmaktayız. Dolayısıyla sunucu uygulamamız i&amp;ccedil;in gerekli konfigurasyon dosyasını aşağıdaki gibi oluşturabiliriz.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;configuration&amp;gt;
    &amp;lt;system.runtime.remoting&amp;gt;
        &amp;lt;application&amp;gt;
            &amp;lt;channels&amp;gt;
                &amp;lt;channel ref="tcp" port="4500" /&amp;gt;
            &amp;lt;/channels&amp;gt;
            &amp;lt;lifetime leaseTime="6" renewOnCallTime="2" leaseManagerPollTime = "1" /&amp;gt;
            &amp;lt;service&amp;gt;
                &amp;lt;activated type="RemoteObjects.RemoteObj,RemoteObjects"/&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/application&amp;gt;
    &amp;lt;/system.runtime.remoting&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Kiralama s&amp;uuml;relerine ait bilgiler eğer aksi belirtilmesse her zaman saniye cinsinden uzunlukları temsil eder. Ancak farklı takılar kullanarak bu s&amp;uuml;re cinslerini değiştirmemiz m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bu değerleri aşağıdaki tabloda bulabilirsiniz.&lt;/p&gt;
&lt;table id="table46" style="border-collapse: collapse; width: 314px;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="width: 81px;"&gt;&lt;strong&gt; Harf&lt;/strong&gt;&lt;/td&gt;
&lt;td style="width: 81px;"&gt;&lt;strong&gt; Anlamı&lt;/strong&gt;&lt;/td&gt;
&lt;td style="width: 81px;"&gt;&lt;strong&gt; &amp;Ouml;rnek&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="81"&gt;D&lt;/td&gt;
&lt;td width="63"&gt;G&amp;uuml;n&lt;/td&gt;
&lt;td width="134"&gt;3D (3 g&amp;uuml;n)&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="81"&gt;H&lt;/td&gt;
&lt;td width="63"&gt;Saat&lt;/td&gt;
&lt;td width="134"&gt;2H (2 saat)&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="81"&gt;M&lt;/td&gt;
&lt;td width="63"&gt;Dakika&lt;/td&gt;
&lt;td width="134"&gt;45M (45 dakika)&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="81"&gt;S&lt;/td&gt;
&lt;td width="63"&gt;Saniye&lt;/td&gt;
&lt;td width="134"&gt;15 (15 saniye)&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="81"&gt;MS&lt;/td&gt;
&lt;td width="63"&gt;Milisaniye&lt;/td&gt;
&lt;td width="134"&gt;100 (100 milisaniye)&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;&amp;Ouml;zetlemek gerekirse, bir uzak nesnenin varsayılan kiralama s&amp;uuml;resini (lease time) değiştirebilir ve referansların yaşam s&amp;uuml;relerini etkilyebiliriz. Bu makalemizde bunu ger&amp;ccedil;ekleştirmek i&amp;ccedil;in programatik olarak ve konfigurasyon bazında kullanabileceğimiz yolları inceledik. Bir sonraki makalemizde, Sponsor tekniğini incelemeye &amp;ccedil;alışacağız. B&amp;ouml;ylece geldik bir makalemizin daha sonuna bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/LeaseManagement.rar"&gt;&amp;Ouml;rnek kod i&amp;ccedil;in tıklayınız.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2006-04-06 12:00:00</pubDate>
  <slug>-Net-Remoting-Lease-Time-(Kiralc4b1k-Sure)-Yonetimi-bsenyurt-com-dan</slug>
  <tags>
    <tag>net-remoting</tag>
    <tag>lease-time-management</tag>
  </tags>
  <categories>
    <category>.Net Remoting</category>
  </categories>
</post>