<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Değişken Atamalarında Bir Efsane</title>
  <description>Bu kod parçasında double tipinden olan x, y ve z değişkenlerine tek satırda Pi değerinin atanması söz konusudur. Bu son derece doğaldır nitekim eşitliğin sağından başlayan bir atama sırası mevcuttur. Hatta buna göre aşağıdaki ifade de doğrudur.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f2%2fblg149_MythBusters.jpg" alt="" width="260" height="173" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Yandaki resimde g&amp;ouml;r&amp;uuml;len kahramanları tanıyanınız var mı? Biraz d&amp;uuml;ş&amp;uuml;n&amp;uuml;n isterseniz...&lt;strong&gt;Jamie Hyneman &lt;/strong&gt;ve &lt;strong&gt;Adam Savage &lt;/strong&gt;ikilisi tarafından sunulan ve &lt;strong&gt;Wikipedia'&lt;/strong&gt; daki verilere g&amp;ouml;re &lt;strong&gt;Discovery Channel&lt;/strong&gt; aracılığıyla ilk yayınını&lt;strong&gt; 23 Ocak 2003&lt;/strong&gt; tarihinde ger&amp;ccedil;ekleştiren &lt;strong&gt;MythBusters&lt;/strong&gt; isimli bu belgesel dizide, bilimsel metodlardan yararlanılarak bazı şehir efsanelerinin ger&amp;ccedil;eklikleri ispatlanmaya &amp;ccedil;alışılmaktadır.&lt;/p&gt;
&lt;p&gt;Aslında film sanayisinin ne kadar &amp;ccedil;ok geliştiğini ispat eden bir dizidir. Nitekim&amp;nbsp;dizinin sunucuları &lt;strong&gt;Hollywood'&lt;/strong&gt; un tanınan film efekti teknisyenleridir &lt;em&gt;(ki bu nedenle bilimsel anlamda gayet donanımlıdırlar)&amp;nbsp;&lt;/em&gt;ve son derece ilgin&amp;ccedil; efsaneleri araştırırlar. &amp;Ouml;rneğin &lt;strong&gt;"Yağmurda koşan mı yoksa y&amp;uuml;r&amp;uuml;yen mi daha &amp;ccedil;ok ıslanır?"&lt;/strong&gt;, &lt;strong&gt;"Benzin istasyonunda cep telefonu kullanmak patlmaya neden olur mu?"&lt;/strong&gt;, &lt;strong&gt;"Piercing yapan insanları yıldırım &amp;ccedil;arpar mı?"&lt;/strong&gt;, &lt;strong&gt;"Emprise State binasının tepesinden yere serbest d&amp;uuml;ş&amp;uuml;şle bırakılan metal bir para betona saplanır mı?" &lt;/strong&gt;ve daha nice ilgin&amp;ccedil; efsaneyi bilimsel taktikler ile &amp;ccedil;&amp;ouml;zm&amp;uuml;şlerdir ve &amp;ccedil;&amp;ouml;zmeye devam etmektedirler. A&amp;ccedil;ık&amp;ccedil;ası bende evdeki afacan m&amp;uuml;sade ettiği s&amp;uuml;rece bu tip belgeselleri ka&amp;ccedil;ırmamaya &amp;ccedil;alışıyorum ve size de izlemenizi şiddetle tavsiye ediyorum.&lt;/p&gt;
&lt;p&gt;Gelelim bu dizinin bu yazımızdaki konuyla ilgisinin ne olduğuna. Her zamanki gibi &amp;ouml;nce g&amp;uuml;zel bir giriş yapalım istedim. Ama asıl mesele&lt;strong&gt; C#&lt;/strong&gt; tarafında da bazı efsanelerin olabileceği. &amp;Uuml;stelik bunların&amp;nbsp;&amp;ccedil;oğundan habersisiz. Ancak Internet &amp;uuml;zerinde siz de benim gibi yeteri kadar araştırma yaparsanız bu konulara ilişkin son derece g&amp;uuml;zel yazıların olduğunu keşfedebilirsiniz. Ben bu yazımızda değişken atamaları ile ilişkili bir konuyu incelemeye &amp;ccedil;alışacağım. Olayın &amp;ccedil;ıkış noktası ise aşağıdaki kod par&amp;ccedil;amız olacak.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Vaka 1;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace AssignMyth
{
    class Program
    {
        static void Main(string[] args)
        {
            double x, y, z;

            x = y = z = Math.PI;

            Console.WriteLine("x={0}\ny={1}\nz={2}",x,y,z);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamanın &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg149_Runtime1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında &lt;strong&gt;double&lt;/strong&gt; tipinden olan&lt;strong&gt; x, y&lt;/strong&gt; ve &lt;strong&gt;z &lt;/strong&gt;değişkenlerine tek satırda &lt;strong&gt;Pi&lt;/strong&gt; değerinin atanması s&amp;ouml;z konusudur. Bu son derece doğaldır nitekim eşitliğin sağından başlayan bir atama sırası mevcuttur. Hatta buna g&amp;ouml;re aşağıdaki ifade de doğrudur.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;x = (y = (z = Math.PI));&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Nitekim parantezlerin olaya kattığı her hangibir &amp;ouml;ncelik bulunmamaktadır. Fakat aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda eşitliğin en sağ tarafındaki değerden başlayarak en soldaki değişkene doğru yapılan atamaların her zaman sanıldığı gibi olmadığı izlenimine varmamız s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Vaka 2;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace AssignMyth
{
    class Program
    {
        static void Main(string[] args)
        {
            object x;
            double y;
            const float z = 3.14f;

            x = y = z;

            Console.WriteLine(x.GetType().ToString());
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Ekran &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg149_Runtime2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hımmm...Enteresan bir durum s&amp;ouml;z konusu sanırım. &lt;img title="Surprised" src="/editors/tiny_mce3/plugins/emotions/img/smiley-surprised.gif" alt="Surprised" border="0" /&gt;&amp;nbsp;Eşitliğin en sağında yer alan &lt;strong&gt;z&lt;/strong&gt; isimli değişken aslında &lt;strong&gt;float&lt;/strong&gt; tipinden tanımlanmıştır. Ardından hemen solunda yer alan &lt;strong&gt;double&lt;/strong&gt; tipinden değişkene aktarılmıştır. &lt;strong&gt;y&lt;/strong&gt; isimli değişken &lt;strong&gt;double&lt;/strong&gt; tipindendir. Son olarak eşitliğin en solunda yer alan &lt;strong&gt;x&lt;/strong&gt; isimli &lt;strong&gt;object&lt;/strong&gt; tipinden değişkene bir atama yapılarak &lt;strong&gt;3.14&lt;/strong&gt; değeri en sağdan en soldaki değişkene doğru taşınmıştır. Lakin değişkenin tipi eşitliğin en sağından en soluna kadar korunamamıştır. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Ekran &amp;ccedil;ıktısına dikkat edilecek olursa, &lt;strong&gt;x&lt;/strong&gt; değişkeni gelen değeri&amp;nbsp;&lt;strong&gt;float&lt;/strong&gt; tipi yerine &lt;strong&gt;double&lt;/strong&gt; tipi olarak ele almıştır. Yani &lt;strong&gt;x=y=z&lt;/strong&gt; atamasında en soldaki x değişkeninin tipi &lt;strong&gt;y'&lt;/strong&gt; nin tipine g&amp;ouml;re belirlenmektedir. Bu durumda eşitliğin en sağındaki değişkenin tipinin en soldaki &lt;strong&gt;object&lt;/strong&gt; tipine taşınmasında bir anlamda&amp;nbsp;bozulma olduğunu d&amp;uuml;ş&amp;uuml;nebiliriz. Konuyu biraz daha ileri g&amp;ouml;t&amp;uuml;relim ve bu kez aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Vaka 3;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace AssignMyth
{
    class Program
    {
        static void Main(string[] args)
        {
            Person burak = new Person();

            object name = burak.Name = null;
            Console.WriteLine("name null mı? {0}",name==null);
            Console.WriteLine("burak.Name null mı? {0}",burak.Name==null);
        }
    }

    public class Person
    {
        private string _name;

        public string Name
        {
            get { return _name==null?"":_name; }
            set { _name = value; }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Dilerseniz kodun &amp;ccedil;alışma sonrası &amp;uuml;retilen &amp;ccedil;ıktıyı g&amp;ouml;rmeden &amp;ouml;nce neler olduğuna bir bakalım. &lt;strong&gt;Person&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde &lt;strong&gt;Name&lt;/strong&gt; isimli bir &lt;strong&gt;&amp;ouml;zellik(Property)&lt;/strong&gt; yer almaktadır. Bu &amp;ouml;zelliğe ait &lt;strong&gt;get&lt;/strong&gt; bloğunda dikkat edilecek olursa &lt;strong&gt;null&lt;/strong&gt; kontrol&amp;uuml; yapılmaktadır. Bu kontrole g&amp;ouml;re &lt;strong&gt;String&lt;/strong&gt; tipinden olan&amp;nbsp;&lt;strong&gt;_name&lt;/strong&gt; alanının değerinin &lt;strong&gt;null&lt;/strong&gt; olması halinde geriye boş bir &lt;strong&gt;string&lt;/strong&gt; d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi tercih edilmiştir. Aksi durumda ise &lt;strong&gt;_name&lt;/strong&gt; değerinin kendisi d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmektedir. Buna g&amp;ouml;re aslında &lt;strong&gt;Person&lt;/strong&gt; tipinin &lt;strong&gt;Name&lt;/strong&gt; &amp;ouml;zellliği ya boş &lt;strong&gt;string&lt;/strong&gt; ya da bir i&amp;ccedil;eriğe sahiptir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisindeki kod par&amp;ccedil;asına baktığımızda ise ilgi &amp;ccedil;ekici nokta &lt;strong&gt;null&lt;/strong&gt; değer atamasının yapıldığı satırıdr. Eşitliğin en sağında yer alan &lt;strong&gt;burak&lt;/strong&gt; isimli değişkenin &lt;strong&gt;Name&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;null&lt;/strong&gt; değer atanmaktadır. Sonrasında ise bu değer &lt;strong&gt;object&lt;/strong&gt; tipinden olan &lt;strong&gt;name&lt;/strong&gt; değişkenine taşınmaktadır. İzleyen iki satırda ise &lt;strong&gt;object&lt;/strong&gt; tipinden olan &lt;strong&gt;name&lt;/strong&gt; değişkeni ile &lt;strong&gt;burak&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt;Name&lt;/strong&gt; &amp;ouml;zelliklerinin değerlerinin &lt;strong&gt;null&lt;/strong&gt; olup olmadığı kontrol edilmekte ve sonu&amp;ccedil;lar ekrana yazdırılmaktadır.&lt;/p&gt;
&lt;p&gt;Normal şartlarda d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde &lt;strong&gt;burak.Name&lt;/strong&gt; i&amp;ccedil;in geriye &lt;strong&gt;null&lt;/strong&gt; değer d&amp;ouml;nmesi s&amp;ouml;z konusu değildir. Nitekim &lt;strong&gt;get&lt;/strong&gt; bloğunda bunun i&amp;ccedil;in bir kontrol yapılmaktadır. Bu durumda son satırın sonucunda &lt;strong&gt;false&lt;/strong&gt; değer d&amp;ouml;nmesi beklenmektedir. Diğer yandan en soldaki &lt;strong&gt;name&lt;/strong&gt; değişkenine yapılan atamaya g&amp;ouml;re de &lt;strong&gt;null&lt;/strong&gt; değer yerine &lt;strong&gt;""&lt;/strong&gt; değeri taşınmış olmalıdır ki buna g&amp;ouml;re de &lt;strong&gt;name&lt;/strong&gt; değerinin &lt;strong&gt;null&lt;/strong&gt; olması sonucunun &lt;strong&gt;false&lt;/strong&gt; d&amp;ouml;nmesi gerekmektedir. Ama uygulamayı &amp;ccedil;alıştırdığımızda sonu&amp;ccedil;ların aşağıdaki gibi olduğu g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg149_Runtime3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Oda ne? &lt;img title="Surprised" src="/editors/tiny_mce3/plugins/emotions/img/smiley-surprised.gif" alt="Surprised" border="0" /&gt;&amp;nbsp;&lt;strong&gt;burak.Name== null&lt;/strong&gt; i&amp;ccedil;in &lt;strong&gt;False &lt;/strong&gt;değer d&amp;ouml;nm&amp;uuml;şt&amp;uuml;r ve bu beklediğimiz sonu&amp;ccedil;tur. Ancak&lt;strong&gt; name==null&lt;/strong&gt; kontrol&amp;uuml;n&amp;uuml;n değeri &lt;strong&gt;true&lt;/strong&gt; olarak gelmiştir. Oysaki atamaya g&amp;ouml;re &lt;strong&gt;name&lt;/strong&gt; değişkenine &lt;strong&gt;""&lt;/strong&gt; değerinin gelmesi ve bu nedenle &lt;strong&gt;null&lt;/strong&gt; olmaması gerekmektedir. İlgin&amp;ccedil; değil mi?&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil; olarak bu yazıda bahsettiğimiz şekliyle ger&amp;ccedil;ekleştirilen atamalarda, eşitliğin en sağındaki değerin sola doğru taşındığı efsanesinin tam olarak doğru olmadığı ispatlanmış bulunmaktadır. Nitekim ilk vakada eşitliğin en sağından soluna aynı değer başarılı bir şekilde atanmaktadır. Ancak ikinci vakaya g&amp;ouml;re aslında en soldaki değişkenin bir sağındakinin tipine b&amp;uuml;r&amp;uuml;nd&amp;uuml;ğ&amp;uuml; de g&amp;ouml;r&amp;uuml;lmektedir. &amp;Uuml;stelik &lt;strong&gt;Vaka 3&lt;/strong&gt;' e g&amp;ouml;re en soldaki değişken en&amp;nbsp;sağdan atanan değere b&amp;uuml;r&amp;uuml;nm&amp;uuml;ş ve bir sağındakini kaale bile almamıştır...Kafanız karıştı mı? Bakalım başka ne gibi efsaneler var. İlerleyen yazılarda değinmeye &amp;ccedil;alışıyor olacağım. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f2%2fAssignMyth_RC.rar"&gt;AssignMyth_RC.rar (20,03 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2010-04-12 02:30:00</pubDate>
  <slug>Degisken-Atamalarinda-Bir-Efsane</slug>
  <tags>
    <tag>c#</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>