<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>GoLang - Built-In JSON Desteği</title>
  <description>JSON(JavaScriptObjectNotation) ile barışık yaşamayan programlama dili neredeyse yok gibi. Özellikle son on yıl zarfında geliştirilen veya ön plana çıkan ne kadar dil varsa JSON için çekirdekten destek sunuyor. GoLang için de benzer durum söz konusu. Nasıl mı? Aynen aşağıdaki kod parçasında görüldüğü gibi.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/05/gophergo.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Mesajlaşma formatlarından &amp;ccedil;eşitli NoSQL sistemlerine, REST tabanlı veri servislerinden mobil cihazlardaki depolama kabiliyetlerine kadar pek &amp;ccedil;ok alanda JSON&lt;em&gt;(JavaScriptObjectNotation)&amp;nbsp;&lt;/em&gt;standardının kullanıldığını g&amp;ouml;r&amp;uuml;yoruz. &amp;Ouml;zellikle XML&lt;em&gt;(eXtensible Markup Language)&lt;/em&gt; kadar fazla yer tutmuyor oluşu da onu &amp;ouml;n plana &amp;ccedil;ıkartan &amp;ouml;zelliklerinden birisi. Hatta sıkıştırılmış formatının kullanıldığı ağ protokolleri bile olabiliyor. Verinin rahat&amp;ccedil;a okunabildiği bu standart ile&amp;nbsp;barışık olmayan programlama dili neredeyse yok gibi&lt;em&gt;(Internet Engineering Task Force kurumunun JSON veri değiş-tokuş standartları ile ilgili yazısına &lt;a href="https://tools.ietf.org/html/rfc7159" target="_blank"&gt;buradan&lt;/a&gt;, JSON API standartları ile ilgili DevNot &amp;uuml;zerinden yayınlanan yazıya da &lt;a href="http://devnot.com/2017/json-api-standardi/" target="_blank"&gt;şuradan&lt;/a&gt; bakabilirsiniz)&lt;/em&gt; &amp;Ouml;zellikle son on yıl zarfında geliştirilen veya &amp;ouml;n plana &amp;ccedil;ıkan ne kadar dil varsa JSON i&amp;ccedil;in &amp;ccedil;ekirdekten destek sunuyor. Sunmayanlar da bu s&amp;uuml;rede ek paket veya eklentilerle bu veri modelini kullandırıyor. GoLang i&amp;ccedil;in de benzer durum s&amp;ouml;z konusu. Nasıl mı? Aynen aşağıdaki kod par&amp;ccedil;asında olduğu gibi.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	"encoding/json"
	"os"
)

func main() {
	// json serileştirme i&amp;ccedil;in kullanacağımız Game yapısından bir tip tanımlıyoruz
	goldZone:=Game{
		5555,
		"Mohani Gezegeni G&amp;ouml;revi",
		[]Player{
			Player{100,"deli","cevat",10.90},
			Player{102,"nadya","komena&amp;ccedil;&amp;ccedil;i",12.45},
			Player{103,"biricit","bardot",900.45},
		},
	}	
	
	jsonOutput,_:=json.Marshal(goldZone)
	fmt.Println(string(jsonOutput))
	
	var game Game	
	if err := json.Unmarshal(jsonOutput,&amp;amp;game); err != nil {
        	panic(err)
    	}
	
	fmt.Printf("Game : %s\n",game.Name)
	for _,player:=range game.Players{
		fmt.Println(player.Id,player.FirstName,player.Point)
	}
	
	// dilersek json sınıfının NewEncoder metodunu kullanarak
	// &amp;ccedil;ıktıları farklı yerlere y&amp;ouml;nlendirebiliriz
	// işletim sistemi ekranı veya bir HTTP mesajının g&amp;ouml;vdesi gibi
	encoder := json.NewEncoder(os.Stdout)    	
    	encoder.Encode(game)    	
}

type Player struct{
	Id int `json:"PlayerId"` // İstersek bir alanın JSON &amp;ccedil;ıktısında nasıl adlandırılacağını s&amp;ouml;yleyebiliriz
	FirstName string // B&amp;uuml;y&amp;uuml;k harf public'lik anlamındadır!
	lastName string //k&amp;uuml;&amp;ccedil;&amp;uuml;k harfle başlayanlar private'lık kazanır. O y&amp;uuml;zden json &amp;ccedil;ıktısına yansımaz
	Point float32
}

type Game struct{
	Id int
	Name string
	Players []Player
}&lt;/pre&gt;
&lt;p&gt;Kodun &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/05/gojson.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Primitive tiplerin JSON formatında serileştirilmesi olduk&amp;ccedil;a kolay zaten. Bu nedenle &amp;ouml;rnek uygulamamızda Game ve Player isimli iki struct tipi kullanıyoruz. Game tipi i&amp;ccedil;inde Player tipinden bir slice yer alıyor. JSON serileştirme ve ters-serileştirme işlemlerini Marshal ve Unmarshal metodları ile ger&amp;ccedil;ekleştirebiliriz. json tipi encoding/json paketi i&amp;ccedil;erisinde yer almaktadır. Marshal &amp;ccedil;ıktısını aldıktan sonra ekrana basarken string tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi uyguladık&lt;em&gt;(Bunu yapmadığımız takdirde nasıl bir sonu&amp;ccedil; elde edeceğinizi inceleyin l&amp;uuml;tfen)&lt;/em&gt; Unmarshal metodu sırasında oluşabilecek bir paniği kontrol altına almaya da &amp;ccedil;alıştık. Marshal ve Unmarshal &amp;ccedil;ağrıları dışında NewEncoder metodunu&amp;nbsp;kullanarak &amp;ccedil;ıktıların bir Stream'e doğru y&amp;ouml;nlendirilmesi de sağlanabilir. Bu stream işletim sistemine ait terminali g&amp;ouml;sterebileceği gibi bir HTTP mesajının body kısmı da olabilir. Son kod satırında bu işlem ele alınmış ve &amp;ccedil;ıktılar doğrudan terminale verilmiştir. İlgili &amp;ouml;zelliği kullanabilmek i&amp;ccedil;in os paketi koda dahil edilmiştir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;Ouml;rnek kodu &amp;ccedil;alışırken ilk başta JSON &amp;ccedil;ıktısına hi&amp;ccedil;bir alan adının yazılmadığını fark ettim. Sonrasında bunları k&amp;uuml;&amp;ccedil;&amp;uuml;k harfle yazdığımı g&amp;ouml;rd&amp;uuml;m. K&amp;uuml;&amp;ccedil;&amp;uuml;k harf ile başlamak GO dilinde private'lık anlamına geliyor. B&amp;uuml;y&amp;uuml;k harf ile başlandığınında ise ilgili &amp;uuml;yeye public'lik kazandırmış oluyoruz. Bunu yeni &amp;ouml;ğrendim. Utanıyorum.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Uygulamanın ekrana bastığı JSON i&amp;ccedil;eriğini Chorme gibi bir tarayıcıda g&amp;ouml;stermek isterseniz aşağıdaki sonu&amp;ccedil;ları g&amp;ouml;rmemiz gerekiyor&lt;em&gt;(Chorme'da JSONView eklentisini kullandığımı belirteyim)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/05/tfi159_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Pek tabii size d&amp;uuml;şen bir ka&amp;ccedil; g&amp;ouml;rev var. &amp;Ouml;rneğin bu &amp;ccedil;ıktıyı fiziki bir dosyaya kaydetmeyi deneyebilirsiniz. Sonrasında ise kaydedilen dosya i&amp;ccedil;eriğinden ilgili i&amp;ccedil;erikleri canlandırmaya &amp;ccedil;alışabilirsiniz. Bu işi biraz daha ileri g&amp;ouml;t&amp;uuml;r&amp;uuml;p JSON formatında veriler ile &amp;ccedil;alışan basit bir NoSQL veritabanı sistemi yazabilir hatta fonksiyonelliklerini(ekleme,&amp;ccedil;ıkartma,arama vb) REST API olarak dış d&amp;uuml;nyaya sunabilirsiniz. Bence bunu bir deneyin. B&amp;ouml;ylece geldik kısa bir kod par&amp;ccedil;asının daha sonuna.&amp;nbsp;Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-06-16 06:18:00</pubDate>
  <slug>golang-built-in-json-destegi</slug>
  <tags>
    <tag>go-programming-language</tag>
    <tag>golang</tag>
    <tag>json</tag>
    <tag>json-serialization</tag>
    <tag>javascriptobjectnotation</tag>
  </tags>
  <categories>
    <category>GoLang</category>
  </categories>
</post>