<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>C# 3.0 - İlk Bakışta DLINQ</title>
  <description>Bildiğiniz gibi uzun bir süredir Microsoft LINQ (.Net Language Integrated Query) adını verdiği ve C# 3.0' ın amacı olan bir projeyi sürdürmekte. Projenin en büyük amacı, özellikle veri üzerinde yapılabilecek sorgulama tekniklerinin dahada yaygınlaştırılması ve dil ortamına entegre edilebilmesi...</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bildiğiniz gibi uzun bir s&amp;uuml;redir Microsoft LINQ (.Net Language Integrated Query) adını verdiği ve C# 3.0' ın amacı olan bir projeyi s&amp;uuml;rd&amp;uuml;rmekte. Projenin en b&amp;uuml;y&amp;uuml;k amacı, &amp;ouml;zellikle veri &amp;uuml;zerinde yapılabilecek sorgulama tekniklerinin dahada yaygınlaştırılması ve dil ortamına entegre edilebilmesi. &amp;Ouml;rneğin LINQ sayesinde IEnumerable&amp;lt;T&amp;gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; (interface) uygulamış herhanbir tip (type) &amp;uuml;zerinde sql sorgularına benzer ifadeler kullanabilir ve alt k&amp;uuml;meler &amp;ccedil;ekebiliriz.&lt;/p&gt;
&lt;p&gt;LINQ' nun bu &amp;ouml;zelliklerini kullanabilmek i&amp;ccedil;in C# dilinin 3.0 versiyonunda pek &amp;ccedil;ok yenilik bulunmaktadır. &amp;Ouml;rneğin var anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; ile, tip belirtmeden değişken tanımlayabilmek (&lt;strong&gt;var keyword&lt;/strong&gt;), nesne &amp;ouml;rneklerini oluştururken yapıcı metodlara gerek kalmadan başlangı&amp;ccedil; değerlerini belirleyebilmek (&lt;strong&gt;object initializing&lt;/strong&gt;), isimsiz tipler oluşturabilmek (&lt;strong&gt;anonymous types&lt;/strong&gt;) hatta lambda ( &lt;strong&gt;=&amp;gt; &lt;/strong&gt;) isimli yeni bir operat&amp;ouml;r sayesinde isimsiz metodları bir adım ileriye g&amp;ouml;t&amp;uuml;rebilmek vb... m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Ancak asıl etki az &amp;ouml;ncede bahsettiğimiz gibi LINQ ile gelmektedir.&lt;/p&gt;
&lt;p&gt;LINQ' nun iki farklı uygulama alanı daha vardır. Bunlar &lt;strong&gt;XLINQ - XML Store and Language Integrated Query&lt;/strong&gt; ve &lt;strong&gt;DLINQ - Database Language Integrated Queries&lt;/strong&gt;' dur. XLINQ ile xml verileri &amp;uuml;zerinde dil ile t&amp;uuml;mleştirilmiş sorgulama ifadeleri yazmak m&amp;uuml;mk&amp;uuml;n olabilmektedir. DLINQ ise bug&amp;uuml;nk&amp;uuml; makalemizin asıl konusudur. DLINQ ilişkisel verilerin nesne olarak ifade edilebildiği ortamlar i&amp;ccedil;in dil destekli sorgular kullanabilmemizi sağlamaktadır. Buna g&amp;ouml;re, bir veritabanına ait herhangibir tabloyu uygulama tarafında sınıf olarak temsil ettiğimiz durumlarda (entity), bu sınıflara ait &amp;ouml;rneklerin &amp;ccedil;alışma zamanında veritabanından doldurulmasını sağlayabilir ve ilgili nesne &amp;ouml;rnekleri &amp;uuml;zerinde LINQ ifadelerini kullanarak sorgular &amp;ccedil;alıştırabiliriz. Bunun tersi durumda ge&amp;ccedil;erlidir. Yani nesnelerin bellekte işaret ettikleri i&amp;ccedil;erikte değişiklik yapıp veritabanına doğru y&amp;ouml;nlendirilebilir. Konuyu daha iyi anlayabilmek i&amp;ccedil;in bir &amp;ouml;rnek &amp;uuml;zerinden hareket edelim. Bu &amp;ouml;rneğimizde AdventureWorks i&amp;ccedil;erisinde kendi oluşturduğumuz bir tabloyu ele alacağız. Kullanacağımız &amp;ouml;rnek tabloyu aşağıdaki script yardımıyla oluşturabilirsiniz.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;USE [AdventureWorks]
GO

SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE TABLE [dbo].[Calisanlar](
[Id] [int] IDENTITY(1,1) NOT NULL,
[Ad] [nvarchar](50) COLLATE SQL_Latin1_General_CP1_CI_AS NOT NULL,
[Soyad] [nvarchar](50) COLLATE SQL_Latin1_General_CP1_CI_AS NOT NULL,
[Maas] [money] NOT NULL,
[GirisTarihi] [datetime] NOT NULL,
[DogumTarihi] [datetime] NOT NULL,
[Unvan] [nvarchar](50) COLLATE SQL_Latin1_General_CP1_CI_AS NOT NULL,
[Departman] [nvarchar](50) COLLATE SQL_Latin1_General_CP1_CI_AS NOT NULL,
CONSTRAINT [PK_Calisanlar] PRIMARY KEY CLUSTERED 
(
[Id] ASC
)WITH (PAD_INDEX = OFF, IGNORE_DUP_KEY = OFF) ON [PRIMARY]
) ON [PRIMARY]&lt;/pre&gt;
&lt;p&gt;DLINQ i&amp;ccedil;in kilit nokta DataContext isimli sınıftır. DataContext sınıfı &amp;ccedil;alışma zamanında, entity sınıfları ile asıl veri kaynağının haberleşebilmesine imkan tanır. &amp;Ccedil;oğunlukla DLINQ uygulamaları i&amp;ccedil;erisinde, &lt;strong&gt;Strongly Typed DataContext&lt;/strong&gt; sınıfları yer almaktadır. Bu sınıflar i&amp;ccedil;lerinde, entity sınıflarına ait generic tipler kullanır. DataContext &amp;uuml;zerinden t&amp;uuml;retme yardımıyla oluşturulan tipler sayesinde LINQ ifadelerini nesne &amp;ouml;rnekleri &amp;uuml;zerinde &amp;ccedil;alıştırabiliriz. Aynı zamanda nesne &amp;ouml;rnekleri &amp;uuml;zerinde yapılacak değişiklikleri veritabanı tarafına doğru g&amp;ouml;nderebiliriz. Bu bilgilerden yola &amp;ccedil;ıkarak hareket ettiğimizde ilk yapmamız gereken aşağıdaki gibi bir entity sınıfı yazmak olacaktır. Bu sınıf temel olarak Calisanlar tablosundaki her bir satırı temsil edebilme yeteneğine sahip olacak şekilde tasarlanmalıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk175_2.gif" alt="" width="211" height="223" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[Table(Name="Calisanlar")]
class Calisan
{
    [Column(Name="Id",Id=true)]
    public int Id;

    [Column(Name="Ad")]
    public string Adi;

    [Column(Name="Soyad")]
    public string Soyadi;

    [Column(Name="Maas")]
    public decimal Maasi;

    [Column()]
    public DateTime GirisTarihi;

    [Column()]
    public DateTime DogumTarihi;

    [Column(Name="Unvan")]
    public string Unvani;

    [Column(Name="Departman")]
    public string Departmani;
}&lt;/pre&gt;
&lt;p&gt;DLINQ bir sınıfın, nesne &amp;ouml;rneği olduğunda veritabanındaki hangi tabloya karşılık geldiğini, alanlarının (fields) tablo &amp;uuml;zerindeki hangi kolonlara (columns) denk d&amp;uuml;şt&amp;uuml;ğ&amp;uuml;n&amp;uuml; ve temel &amp;ouml;zelliklerinin neler olacağını belirtmemize yarayan nitelikler(attributes) i&amp;ccedil;ermektedir. &amp;Ouml;rneğin yazmış olduğumuz Calisan isimli sınıfın, veritabanındaki hangi tabloya karşılık geldiğini &lt;strong&gt;Table&lt;/strong&gt; isimli attribute yardımıyla belirleyebiliriz. Buna g&amp;ouml;re Calisan isimli sınıfımız Calisanlar isimli tabloya ait olacaktır.&lt;/p&gt;
&lt;table id="table107" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Column, Table gibi nitelikler (attributes) ve biraz sonra g&amp;ouml;receğimiz DataContext sınıfı, &lt;strong&gt;System.Data.DLinq&lt;/strong&gt; isim alanı (namespace) altında yer almaktadır.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Benzer şekilde sınıf i&amp;ccedil;erisinde tanımlı alanların, Calisanlar tablosu &amp;uuml;zerinde karşılık geldikleri kolonları &lt;strong&gt;Column&lt;/strong&gt; isimli nitelik (attribute) yardımıyla belirlemekteyiz. Column niteliği yardımıyla eşleştirilecek kolon adının ne olacağını belirlemek dışında başka &amp;ouml;zellikleride ayarlayabiliriz. &amp;Ouml;rneğin Id isimli alanın aynı zamanda identity olacağını Id &amp;ouml;zelliğine true değeri atayarak belirlemekteyiz. Benzer şekilde bir alanın veri t&amp;uuml;r&amp;uuml;n&amp;uuml;de DBType &amp;ouml;zelliği ile Column niteliği i&amp;ccedil;erisinde ayarlayabiliriz. Aşağıdaki şekilde Column niteliği i&amp;ccedil;erisinde kullanabileceğimiz diğer &amp;ouml;zellikler g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk175_1.gif" alt="" width="375" height="169" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Entity sınıfımızın ardından Strongly Typed DataContext sınıfını yazmamız gerekmektedir. Bu tip sınıflar genellikle bir veritabanı i&amp;ccedil;erisindeki tabloların satırlarını temsil eden entity &amp;ouml;rneklerine ait toplu veri k&amp;uuml;melerini barındırmak ve y&amp;ouml;netmek amacıyla yazılmaktadır. Aşağıdaki kod par&amp;ccedil;asında yer alan AdventureWorks isimli sınıfın temel amacı budur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk175_3.gif" alt="" width="240" height="171" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data.DLinq;

namespace UsingDLINQ
{
    class AdventureWorks:DataContext
    {
        public Table&amp;lt;Calisan&amp;gt; SirketCalisanlari;

        public AdventureWorks(string conStr)
                : base(conStr)
        {
        }
    }
}&lt;/pre&gt;
&lt;p&gt;AdventureWorks isimli sınıfımız DataContext' ten t&amp;uuml;retilmektedir. Yapıcı metodumuz i&amp;ccedil;erisinde dikkat edecek olursanız parametre olarak bağlantı bilgisini alıp DataContext sınıfının ilgili yapıcı metoduna (Constructor) g&amp;ouml;ndermekteyiz. AdventureWorks isimli sınıfın bir diğer &amp;ouml;nemli &amp;uuml;yesi SirketCalisanlari' dir. Bu &amp;uuml;yenin tipi Table' dır. Table tipi burada generic' tir ve Calisan sınıfı tipinden &amp;ouml;rnekler barındırabileceği belirtilmektedir. &amp;Ouml;yleyse biz SirketCalisanlari ile, Calisanlar tablosunun t&amp;uuml;m satırlarını referans edebiliriz. Şimdi gelelim LINQ' yu işin i&amp;ccedil;erisine katarak &amp;ccedil;alışma zamanında Calisanlar isimli tablodan nasıl sorgulama yapabileceğimize. Bu ama&amp;ccedil;la oluşturacağımız &lt;strong&gt;LINQ Preview Console&lt;/strong&gt; uygulaması i&amp;ccedil;erisinde aşağıdaki kodları yazmamız gerekiyor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Query;

namespace UsingDLINQ
{
    class Program
    {
        static void Main(string[] args)
        {
            AdventureWorks adw = new AdventureWorks("data source=localhost;database=AdventureWorks;integrated security=SSPI");

            var calisanListesi=from clsn in adw.SirketCalisanlari select clsn;

            foreach(var c in calisanListesi)
            {
                Console.Write(c.Id.ToString());
                Console.Write("\t"+c.Adi+" ");
                Console.Write(c.Soyadi);
                Console.Write("\t"+c.Maasi.ToString());
                Console.Write("\t"+c.DogumTarihi.ToString());
                Console.WriteLine("\t"+c.Departmani.ToString());
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;ları elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk175_4.gif" alt="" width="628" height="167" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat ederseniz burada C# 3.0 ile gelen bir ka&amp;ccedil; yenilik yer almaktadır. Bunlardan birisi var anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml;n kullanılmasıdır. Bildiğiniz gibi var anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; ile bir değişkeni, tipini belirtmeden tanımlayabilir ve kullanabiliriz. İkinci &amp;ouml;nemli yenilik ise C# 3.0 ' ın asıl konusunu oluşturuan LINQ ifadelerinin kullanılmasıdır. &lt;strong&gt;from&lt;/strong&gt; anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; ile başlayan ifademizde AdventureWorks sınıfına ait nesne &amp;ouml;rneği i&amp;ccedil;erisinde yer alan Table tipindeki SirketCalisanlari nesne &amp;ouml;rneği &amp;uuml;zerinden basit bir select sorgusu atılmaktadır. Burada yazım tarzı T-Sql g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında biraz ters gelebilir. Ancak uygulamacı g&amp;ouml;z&amp;uuml;yle baktığımızda son derece mantlık bir sorgu c&amp;uuml;mlesi ortaya &amp;ccedil;ıkmaktadır. Şimdi sorgumuzu biraz değiştirip aşağıdaki hale getirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var calisanListesi=from clsn in adw.SirketCalisanlari where clsn.Departmani=="Yazılım" select clsn;&lt;/pre&gt;
&lt;p&gt;Bu durumda uygulamamızı &amp;ccedil;alıştırdığımızda sadece yazılım departmanına ait &amp;ccedil;alışanları elde edebiliriz.&lt;/p&gt;
&lt;table id="table111" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Sorgu ifadelerinin doğru &amp;ccedil;alışabilmesi i&amp;ccedil;in (&amp;ouml;rneğin &lt;strong&gt;where&lt;/strong&gt; anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml; kullanabilmek i&amp;ccedil;in) &lt;strong&gt;System.Query&lt;/strong&gt; isim alanını uygulamamıza dahil etmemiz gerekmektedir.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;&lt;img src="/makale/images/mk175_5.gif" alt="" width="593" height="118" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu durumda sonu&amp;ccedil; şu şekilde olacaktır. Şimdi &amp;ouml;rneğimizi biraz daha geliştirelim ve DLINQ kullanarak ilişkili verilerin nesnel bazda nasıl sorgulanabileceğini ele almaya &amp;ccedil;alışalım. Bu ama&amp;ccedil;la Sql Server 2005 &amp;uuml;zerinde bizim emektar Northwind veritabanını kullanacağız. Senaryo olarak Categories ve Products tablolarının birleştirilmiş hallerini (bir başka deyişle join edilmiş hallerini) ele almaya &amp;ccedil;alışacağız. Yanlız bu kez bu birleştirilmiş veri k&amp;uuml;mesini kod tarafındaki katmanlarda ele alacağız. Bizim i&amp;ccedil;in gerekenler &amp;ouml;ncelikli olarak Categories ve Products tabloları i&amp;ccedil;in birer entity sınıfı. Sonrasında ise yazmış olduğumuz bu entity sınıfları ile asıl tablolarımız arasındaki ilişkiyi sağlayacak DataContext' ten t&amp;uuml;remiş bir sınıf. DataContext tipinden t&amp;uuml;reteceğimiz bu sınıf i&amp;ccedil;erisinde tablolar arasındaki ilişkiyide nesnel bazda sağlamamız gerekecektir. Bunun i&amp;ccedil;inde &lt;strong&gt;Association&lt;/strong&gt; niteliğinden ve &lt;strong&gt;EntitySet&lt;/strong&gt; tipinden yararlanacağız. İlk olarak entity sınıflarımızı aşağıdaki gibi geliştirelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk175_6.gif" alt="" width="569" height="215" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data.DLinq;

namespace UsingDLINQ
{
    [Table(Name="Categories")]
    class Kategori
    {
        [Column(Name="CategoryID",Id=true)]
        public int KategoriId;

        [Column(Name="CategoryName")]
        public string KategoriAdi;

        private EntitySet&amp;lt;Urun&amp;gt; m_urunDetay;

        [Association(Storage="m_urunDetay",OtherKey="KategoriId")]
        public EntitySet&amp;lt;Urun&amp;gt; UrunDetaylari
        {
            get { return m_urunDetay; }
            set { m_urunDetay.Assign(value); }
        }
    }

    [Table(Name="Products")]
    class Urun
    {
        [Column(Name="ProductID",Id=true)]
        public int UrunId;

        [Column(Name="ProductName")]
        public string UrunAdi;
    
        [Column(Name="UnitPrice")]
        public decimal BirimFiyat;

        [Column(Name="CategoryID")]
        public int KategoriId;

        private EntityRef&amp;lt;Kategori&amp;gt; m_kategorisi;

        [Association(Storage = "m_kategorisi", ThisKey = "KategoriId")]
        public Kategori Kategorisi
        {
            get { return m_kategorisi.Entity; }
            set { m_kategorisi.Entity = value; }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Buradaki kod par&amp;ccedil;asında, Kategori ve Urun sınıfları arasında &amp;ccedil;alışma zamanında ifade edilebilecek bire-&amp;ccedil;ok (one-to-many) ilişkide tanımlanmıştır. Kategori sınıfı i&amp;ccedil;erisinde bu işi UrunDetaylari isimli &amp;ouml;zellik ger&amp;ccedil;ekleştirmektedir. &amp;Ouml;zelliğe uygulanan Association isimli nitelik, bir kategoriye bağlı &amp;uuml;r&amp;uuml;nlerin nerede saklanacağını &lt;strong&gt;storage&lt;/strong&gt; &amp;ouml;zelliği yardımıyla belirtmektedir. İkinci parametremiz ise bire-&amp;ccedil;ok ilişki i&amp;ccedil;in gerekli anahtar(key) alanı işaret eder ki buda ilgili kategorinin id değeri olacaktır. Şimdide DataContext' ten t&amp;uuml;rettiğimiz Strongly Typed tipimizi yazalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk175_7.gif" alt="" width="238" height="179" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data.DLinq;

namespace UsingDLINQ
{
    class Northwind:DataContext
    {
        public Table&amp;lt;Kategori&amp;gt; Kategoriler;
        public Table&amp;lt;Urun&amp;gt; Urunler;

        public Northwind(string conStr)
            : base(conStr)
        {
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Dilerseniz daha fazla detaya girmeden nesnel bazda ifade edebileceğimiz bu ilişkiyi LINQ &amp;uuml;zerinden nasıl kullanabileceğimize bakalım. Bu ama&amp;ccedil;la programımıza aşağıdaki kod satırlarını ekleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Northwind nrth=new Northwind("data source=localhost;database=Northwind;integrated security=SSPI");

var sonuclar = from urn in nrth.Urunler from ktg in nrth.Kategoriler where urn.KategoriId == ktg.KategoriId select urn;

var altSonuclar=from snc in sonuclar where snc.KategoriId==2 select snc;

Console.WriteLine("\t Join &amp;Uuml;zerinden Belirli Kategori Altında Olanlar...");
Console.WriteLine();

foreach (Urun u in altSonuclar)
{
    Console.WriteLine(u.KategoriId.ToString()+"\t"+u.Kategorisi.KategoriAdi+"\t"+u.UrunAdi+"\t"+u.BirimFiyat.ToString());
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı bu haliyle &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz. G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi KategoriId değeri 2 olan &amp;uuml;r&amp;uuml;nleri &amp;ccedil;ekebilmekteyiz. Bu ama&amp;ccedil;la iki adet LINQ ifadesi kullanılmıştır. İlk ifade aslında Urunler ve Kategoriler isimli Table nesne &amp;ouml;rneklerine ait veri k&amp;uuml;melerini KategoriId alanları &amp;uuml;zerinden birleştiren ve T-Sql deki Join benzeri bir işlevselliği sağlayan yapıdadır. İkinci LINQ ifadesinde ise bu Join yapısı &amp;uuml;zerinden KategoriId' ye bir alt k&amp;uuml;me &amp;ccedil;ekilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk175_8.gif" alt="" width="604" height="239" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Yapmış olduğumuz &amp;ouml;rneklerdende anlayabileceğiniz gibi DLINQ aslında iş katmanında yer alan tiplerin &amp;uuml;zerinden T-Sql tarzında sorguların yapılabilmesini sağlamaktadır. DLINQ ana konu olarak LINQ ifadelerini kullandığından, &amp;ccedil;alışma zamanında bellek &amp;uuml;zerinde bulunan nesneler &amp;uuml;zerinde istenilen sorgulamalar yapılabilir. DLINQ kendi i&amp;ccedil;erisinde kayıt d&amp;uuml;zenleme, transaction kullanımı gibi daha ileri seviye imkanlara da sahiptir. Bu konular ile ilgili daha detaylı bilgileri &lt;a href="http://msdn.microsoft.com/vcsharp/future/default.aspx"&gt; sitesinden&lt;/a&gt; bulabilirsiniz. Bu makalemizde kısaca DLINQ teknolojisine kısaca bakmaya ve tanımaya &amp;ccedil;alıştık. Makale i&amp;ccedil;erisinde ge&amp;ccedil;en bilgilerin &amp;ccedil;oğunun C# 3.0 ın son hali yayımlanana kadar değişiklik g&amp;ouml;sterebileceğini de g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almamız gerektiğini unutmayalım. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/UsingDLINQ.rar"&gt; &amp;Ouml;rnek Uygulama İ&amp;ccedil;in Tıklayın.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2006-09-25 12:00:00</pubDate>
  <slug>C#-3-0-İlk-Bakışta-DLINQ-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#-30</tag>
    <tag>linq</tag>
    <tag>language-integrated-query</tag>
    <tag>lambda-operator</tag>
    <tag>anonymous-types</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>