<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WF Ado.Net Entity Pack - Hello World</title>
  <description>Ne var ki ilerleyen zamanlarda çıkan PreBeta, Beta 1, Beta 2, RC ve nihayet RTM sürümlerinde yer alan Activity Component setinde bu tip bileşenlerin yer almadığına da şahit olduk. Hatta WF 4.0 öncesinde aşina olduğumuz State Machine tipinden şablonlarında kaldırıldığını gördük. Geçtiğimiz günlerde ise Codeplex üzerinden iki WF 4.0 Activity Pack yayınlandı. Bunlardan birisi WF Ado.Net Activity Pack CTP 1 iken diğer ise WF State Machine Activity Pack 1 isimli paketti.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f5%2fblg191_Giris.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;2008 &lt;/strong&gt;yılının son &amp;ccedil;eyreğinde &lt;strong&gt;Microsoft &lt;/strong&gt;tarafından d&amp;uuml;zenlenen &lt;strong&gt;Yazılım Geliştiriciler Zirvesinde&lt;/strong&gt;, &lt;strong&gt;WCF &amp;amp; WF 4.0&lt;/strong&gt; konulu bir sunumum olmuştu. &lt;strong&gt;Derinlere Dalıyoruz &lt;/strong&gt;mesajını i&amp;ccedil;eren etkinliğin sunum dosyalarının arka plan resminde, dipteki bilgisayara ulaşmaya &amp;ccedil;alışan bir balık adam motifi yer almaktaydı. Sevgili &lt;strong&gt;Mehmet Emre&lt;/strong&gt;' nin beni davet ettiği bu oturuma hazırlanırken, &lt;strong&gt;Microsoft PDC 2008&lt;/strong&gt;' de dağıtılan &lt;strong&gt;VHD&lt;/strong&gt;' ler &amp;uuml;zerinde &amp;ccedil;alışmıştım. O zamanlarda &lt;strong&gt;WF Designer&lt;/strong&gt; &amp;uuml;zerinde dikkatimi &amp;ccedil;eken noktaların başında, &lt;strong&gt;WF &lt;/strong&gt;aktivitelerindeki &amp;ccedil;eşitlilik yer almaktaydı. &amp;Ouml;zellike &lt;strong&gt;DbQuery, DbUpdate&lt;/strong&gt; isimli &lt;strong&gt;SQL &lt;/strong&gt;odaklı aktivite bileşenleri dikkatimi &amp;ccedil;ekmişti.&lt;/p&gt;
&lt;p&gt;Ne var ki ilerleyen zamanlarda &amp;ccedil;ıkan &lt;strong&gt;PreBeta, Beta 1, Beta 2, RC &lt;/strong&gt;ve nihayet &lt;strong&gt;RTM &lt;/strong&gt;s&amp;uuml;r&amp;uuml;mlerinde yer alan &lt;strong&gt;Activity Component&lt;/strong&gt; setinde bu tip bileşenlerin yer almadığına da şahit olduk. Hatta &lt;strong&gt;WF 4.0 &lt;/strong&gt;&amp;ouml;ncesinde aşina olduğumuz &lt;strong&gt;State Machine&lt;/strong&gt; tipinden şablonlarında kaldırıldığını g&amp;ouml;rd&amp;uuml;k. Ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde ise &lt;strong&gt;Codeplex &lt;/strong&gt;&amp;uuml;zerinden iki&lt;strong&gt; WF 4.0 Activity Pack &lt;/strong&gt;yayınlandı. Bunlardan birisi &lt;a title="WF Ado.Net Activity Pack CTP 1" href="http://wf.codeplex.com/releases/view/43585" target="_blank"&gt;WF Ado.Net Activity Pack CTP 1&lt;/a&gt; iken diğer ise &lt;a title="WF State Machine Activity Pack CTP 1" href="http://wf.codeplex.com/releases/view/43586" target="_blank"&gt;WF State Machine Activity Pack 1&lt;/a&gt; isimli paketti.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z konusu paketleri indirip kurduğumuzda &lt;strong&gt;Visual Studio 2010 Workflow Designer&lt;/strong&gt;' a aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan kontrollerin eklendiğini fark edebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f5%2fblg191_Components.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İşte bu yazımızda &amp;ccedil;ok basit olarak &lt;strong&gt;WF Ado.Net Activity Pack&lt;/strong&gt; i&amp;ccedil;erisindeki kontrollerden birisini tanımaya &amp;ccedil;alışacak ve basit bir &amp;ouml;rnek geliştiriyor olacağız. Bu tip &lt;strong&gt;Pack&lt;/strong&gt;' leri işlerimizi son derece kolaylaştıracak ve &lt;strong&gt;Activity &lt;/strong&gt;bileşenlerinin daha zengin bir &amp;ccedil;er&amp;ccedil;evede değerlendirilmesine olanak sağlayacak genişletmeler olarak d&amp;uuml;ş&amp;uuml;nmemizde yarar vardır. &amp;Ouml;zellikle &lt;strong&gt;Codeplex &lt;/strong&gt;gibi a&amp;ccedil;ık kaynak kodlu projeleri yayınlayan ve &lt;strong&gt;Microsoft &lt;/strong&gt;tarafından desteklenen bu tip bileşen paketleri, kişisel d&amp;uuml;ş&amp;uuml;nceme g&amp;ouml;re WF tasarımlarında &amp;ouml;nemli bir rol &amp;uuml;stlenecekler gibi g&amp;ouml;r&amp;uuml;nmekte. Haydi gelin parmaklarımızı sıvayalım ve basit bir &lt;strong&gt;Workflow Console Application&lt;/strong&gt; projesi oluşturarak yola koyulalım. İlk olarak senaryomuzdan bahsetmemizde yarar olacağı kanısındayım.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizde bir &lt;strong&gt;Select SQL&lt;/strong&gt; sorgusunu, &lt;strong&gt;SQL 2008&lt;/strong&gt; sunucusu &amp;uuml;zerinde konuşlandırılmış ve yine &lt;strong&gt;Codeplex &lt;/strong&gt;sitesinden indirip kurabileceğiniz &lt;strong&gt;Chinook &lt;/strong&gt;veritabanı &amp;uuml;zerindeki &lt;strong&gt;Track &lt;/strong&gt;tablosunda &amp;ccedil;alıştırıyor olacağız. Bu sorgunun &amp;ccedil;alıştırılması sonucu elde edilen &lt;strong&gt;veri k&amp;uuml;mesi(Result Set)&lt;/strong&gt; i&amp;ccedil;erisindeki her bir satırı ise, aşağıda tasarımı g&amp;ouml;r&amp;uuml;len &lt;strong&gt;Track &lt;/strong&gt;isimli sınıfa ait nesne &amp;ouml;rneklerinin oluşturulmasında kullanacağız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace HelloAdoNetActivityPack
{
    public class Track
    {
        public int TrackId { get; set; }
        public string Name { get; set; }
        public string Composer { get; set; }
        public int Milliseconds { get; set; }

        public override string ToString()
        {
            return string.Format("{0}  Şarkı : {1} Besteci : {2} S&amp;uuml;re : {3} ", TrackId.ToString(), Name, Composer, Milliseconds.ToString());
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi &lt;strong&gt;Workflow &lt;/strong&gt;ortamımızda &lt;strong&gt;Sequence &lt;/strong&gt;diagramı i&amp;ccedil;erisine bir adet &lt;strong&gt;ExecuteSqlQuery&amp;lt;T&amp;gt;&lt;/strong&gt; tipinden bileşeni s&amp;uuml;r&amp;uuml;kleyelip bırakalım. S&amp;uuml;r&amp;uuml;kleme işlemi sonrasında &lt;strong&gt;T &lt;/strong&gt;tipi i&amp;ccedil;in aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan soru ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f5%2fblg191_SelectTypes.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak sorgu sonu&amp;ccedil;larının &lt;strong&gt;Track &lt;/strong&gt;tipinden nesne &amp;ouml;rnekleri i&amp;ccedil;erisinde toplanmasını planladığımızdan bu sınıfı se&amp;ccedil;memiz gerekmektedir. &lt;strong&gt;Browse for Types&lt;/strong&gt; kısmından &lt;strong&gt;Track &lt;/strong&gt;sınıfını işaretledikten sonra kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n &lt;strong&gt;WF Designer&lt;/strong&gt; ortamına aşağıdaki gibi eklendiğini g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f5%2fblg191_FirstState.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Eğer bu tip bir &lt;strong&gt;Activity &lt;/strong&gt;bileşenini kendimiz tasarlıyor olsaydık, &amp;ccedil;ok doğal olarak sorgunun &amp;ccedil;alıştırılması i&amp;ccedil;in gerekli bağlantıyı ve sorgunun kendisini birer &lt;strong&gt;&amp;ouml;zellik(Property)&lt;/strong&gt; olarak sunmayı planlardık. Benzer durum&lt;strong&gt; ExecuteSqlQuery&amp;lt;T&amp;gt;&lt;/strong&gt; bileşeni i&amp;ccedil;in de ge&amp;ccedil;erlidir. Bir başka deyişle &lt;strong&gt;ConnectionString, CommandText &lt;/strong&gt;ve &lt;strong&gt;CommandType &lt;/strong&gt;&amp;ouml;zelliklerinin bildirilmesi gerekmektedir. Tam bu noktada s&amp;ouml;z konusu bileşenin &lt;strong&gt;SqlCommand &lt;/strong&gt;nesne &amp;ouml;rneğinin g&amp;ouml;rsel bir formatı olduğunu da ifade edebiliriz.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle &lt;strong&gt;CommandType, ProviderName &lt;/strong&gt;&amp;ouml;zellikleri aldığı değerler ile bunu ispat eder niteliktedir. &lt;strong&gt;CommandType &lt;/strong&gt;&amp;ouml;zelliğine &lt;strong&gt;Text, StoredProcedure, TableDirect &lt;/strong&gt;değerlerinden birisini verebiliriz. Buna g&amp;ouml;re bir &lt;strong&gt;Stored Procedure&lt;/strong&gt;' &amp;uuml;n, &lt;strong&gt;Tablo &lt;/strong&gt;adının veya bizim tarafımızdan yazılacak bir &lt;strong&gt;SQL Sorgusunun &lt;/strong&gt;kullanılabilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Ayrıca parametreli sorgulamalar i&amp;ccedil;in &lt;strong&gt;Parameters &lt;/strong&gt;&amp;ouml;zelliği g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilmektedir. Standart olarak &lt;strong&gt;SqlClient Veri Sağlayıcısı(Data Provider) &lt;/strong&gt;kullanılmaktadır. Ancak dilerseniz diğer &lt;strong&gt;Provider &lt;/strong&gt;tiplerini de se&amp;ccedil;ebilir ve farklı veri kaynakları i&amp;ccedil;in gerekli sorguları y&amp;uuml;r&amp;uuml;tebilirsiniz. &lt;strong&gt;ConnectionString, Parameters&lt;/strong&gt; ve &lt;strong&gt;CommandText &lt;/strong&gt;vb &amp;ouml;zelliklerinin yanında bulunan &lt;strong&gt;&amp;uuml;&amp;ccedil; nokta d&amp;uuml;ğmeleri&lt;/strong&gt;, sağladıkları arabirimler ile ilgili &amp;ouml;zelliklerin kolayca belirlenebilmesini sağlamaktadır.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizde &lt;strong&gt;ConnectionString &lt;/strong&gt;i&amp;ccedil;in aşağıdaki ayarlar kullanılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f5%2fblg191_Connection.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;CommandText &amp;ouml;zelliğini ise aşağıdaki gibi belirlediğimizi d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f5%2fblg191_CommandTezxt.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re &lt;strong&gt;AlbumId &lt;/strong&gt;değerine g&amp;ouml;re &lt;strong&gt;Track &lt;/strong&gt;bilgilerini getiren bir SQL sorgusunu &amp;ccedil;alıştırıyor olacağız. &lt;strong&gt;SQL &lt;/strong&gt;sorgusunda &lt;strong&gt;@AlbumId &lt;/strong&gt;isimli bir parametre kullandığımızdan bunun değerini ortama alabilmek amacıyla bir &lt;strong&gt;Argument &lt;/strong&gt;&amp;ouml;rneğinden yararlanıyor olacağız. S&amp;ouml;z konusu parametre bildirimini ise aşağıdaki gibi yaptığımızı d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f5%2fblg191_Parameters.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Buraya kadar her şey g&amp;uuml;zel. Peki elde ettiğimiz veri k&amp;uuml;mesini nasıl değerlendireceğiz? Aslında &lt;strong&gt;ExecuteSqlQuery&amp;lt;T&amp;gt; &lt;/strong&gt;kontrol&amp;uuml; sorgu sonu&amp;ccedil;larının &lt;strong&gt;SqlDataReader &lt;/strong&gt;yardımıyla dolaşılmasına olanak sağlamaktadır. Bu nedenle &lt;strong&gt;Map Each record to target &lt;/strong&gt;gibi bir alt i&amp;ccedil;eriğe sahiptir. Biz de buradaki alanda &amp;ouml;rnek olarak bir &lt;strong&gt;Assign&lt;/strong&gt; aktivitesi kullanacak ve &lt;strong&gt;target &lt;/strong&gt;nesne &amp;ouml;rneklerini oluşturacağız. Burada s&amp;ouml;z konusu olan &lt;strong&gt;target &lt;/strong&gt;değişkeni &lt;strong&gt;T &lt;/strong&gt;tipindendir. Dolayısıyla &lt;strong&gt;Track &lt;/strong&gt;sınıfını işaret etmektedir. Diğer yandan &lt;strong&gt;record &lt;/strong&gt;değişkeni ise, sorgu sonucu okunmakta olan her bir satırı ifade etmektedir. Bu bilgiler ışığında kontrol&amp;uuml;n i&amp;ccedil;eriğini ve &lt;strong&gt;Assign &lt;/strong&gt;aktivitesinin &lt;strong&gt;To &lt;/strong&gt;&amp;ouml;zelliğini aşağıdaki &lt;strong&gt;Visual Basic Expression &lt;/strong&gt;ile tamamlayabiliriz. &lt;em&gt;(Bildiğiniz &amp;uuml;zere &lt;strong&gt;WF &lt;/strong&gt;tarafındaki t&amp;uuml;m &lt;strong&gt;Expression&lt;/strong&gt;' lar &lt;strong&gt;Visual Basic Syntax&lt;/strong&gt; ' ında yazılmaktadır)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f5%2fblg191_Record.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;Track &lt;/strong&gt;nesne &amp;ouml;rneğini oluştururken &lt;strong&gt;record &lt;/strong&gt;değişkeni &amp;uuml;zerinden ilgili &lt;strong&gt;alan değerleri(Field Values)&lt;/strong&gt; belirlenmiş ve ilgili &lt;strong&gt;&amp;ouml;zelliklere(Property)&lt;/strong&gt; atanmıştır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;Ouml;rneği geliştirirken C1020: Build error occurred in the XAML MSBuild task: ''xml:space' is a duplicate attribute name i&amp;ccedil;erikli bir derleme zamanı hatası ile karşılaştım. Bunun &amp;uuml;zerine aşağıdaki XAML i&amp;ccedil;eriğinde yer alan xml:space="preserve" kısmını kaldırarak hatanın &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;tim. S&amp;ouml;z konusu hatanın sebebinin araştırmaya devam ediyorum.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;InArgument x:TypeArguments="local:Track" xml:space="preserve"&amp;gt;[New Track() With {
    .TrackId = record.GetInt32(0),
    .Name = record.GetString(1),
    .Composer = record.GetString(2),
    .Milliseconds = record.GetInt32(3)
    }]&amp;lt;/InArgument&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;ExecuteSqlQuery&amp;lt;T&amp;gt;&lt;/strong&gt; kontrol&amp;uuml;n&amp;uuml;n y&amp;uuml;r&amp;uuml;tt&amp;uuml;ğ&amp;uuml; sorgu sonu&amp;ccedil;larını aslında &lt;strong&gt;List&amp;lt;T&amp;gt;&lt;/strong&gt; tipinden bir koleksiyonda toplanmaktadır. Dolayısıyla sorgu sonu&amp;ccedil;ları &amp;ouml;rneğimize g&amp;ouml;re &lt;strong&gt;List&amp;lt;Track&amp;gt;&lt;/strong&gt; tipinden bir koleksiyon i&amp;ccedil;erisine de aktarılmaktadır. Bu sorgu sonucu da &lt;strong&gt;List&amp;lt;Track&amp;gt; &lt;/strong&gt;tipinden bir &lt;strong&gt;Variable &lt;/strong&gt;veya &lt;strong&gt;Argument&lt;/strong&gt;' a atanarak kullanılabilir. Tabi bunun i&amp;ccedil;in &lt;strong&gt;ExecuteSqlQuery&amp;lt;T&amp;gt;&lt;/strong&gt; bileşeninin &lt;strong&gt;Result&lt;/strong&gt; &amp;ouml;zelliğinin uygun değişkene atanarak kontrol&amp;uuml;n dış ortamına sunulması gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f5%2fblg191_Result.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Artık basit bir &lt;strong&gt;ForEach&amp;lt;T&amp;gt;&lt;/strong&gt; aktivitesini kullanarak elde edilen veri k&amp;uuml;mesi &amp;uuml;zerinden hareket edebiliriz. Buna g&amp;ouml;re &lt;strong&gt;Workflow1 &lt;/strong&gt;&amp;ouml;rneğinin son hali aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi tamamlanabilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f5%2fblg191_DesignerLast.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ForEach&amp;lt;T&amp;gt;&lt;/strong&gt; aktivite bileşeni de &lt;strong&gt;Track &lt;/strong&gt;tipi ile &amp;ccedil;alışacak şekilde tesis edilmiş ve bu sayede&lt;strong&gt; ExecuteSqlQuery&amp;lt;T&amp;gt; &lt;/strong&gt;aktivitesinin &amp;uuml;rettiği&lt;strong&gt; List&amp;lt;Track&amp;gt;&lt;/strong&gt; tipinden olan koleksiyon &amp;uuml;zerinde dolaşmak &amp;uuml;zere ayarlanmıştır. Olayı &amp;ccedil;ok basit bir şekilde ele almak i&amp;ccedil;in sadece bir &lt;strong&gt;WriteLine &lt;/strong&gt;aktivitesi kullanılmış ve varsayılan değeri &lt;strong&gt;1 &lt;/strong&gt;olan &lt;strong&gt;AlbumId &lt;/strong&gt;değerli Track &amp;ouml;rneklerinin i&amp;ccedil;eriği ekrana yazdırılmıştır. İşte &amp;ccedil;alışma zamanı sonu&amp;ccedil;ları.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f5%2fblg191_Runtime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;S&amp;uuml;per &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;SQL &lt;/strong&gt;sorgu c&amp;uuml;mlelerinin icra edilmesi ve &amp;ouml;zellikle &amp;uuml;retilen veri k&amp;uuml;mesinin &lt;strong&gt;Workflow &lt;/strong&gt;tarafında ele alınması olduk&amp;ccedil;a kolay bir hale getirilmiştir. &amp;Ouml;rneğimizin &lt;strong&gt;Sequence &lt;/strong&gt;bileşenine ait &lt;strong&gt;XAML &lt;/strong&gt;&amp;ccedil;ıktısı aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Sequence sad:XamlDebuggerXmlReader.FileName="D:\Vs 2010\RTM\Workflow Foundation\HelloAdoNetActivityPack\HelloAdoNetActivityPack\Workflow1.xaml" sap:VirtualizedContainerService.HintSize="309,637"&amp;gt;
    &amp;lt;Sequence.Variables&amp;gt;
      &amp;lt;Variable x:TypeArguments="scg3:List(local:Track)" Name="TracksByAlbumId" /&amp;gt;
    &amp;lt;/Sequence.Variables&amp;gt;
    &amp;lt;sap:WorkflowViewStateService.ViewState&amp;gt;
      &amp;lt;scg3:Dictionary x:TypeArguments="x:String, x:Object"&amp;gt;
        &amp;lt;x:Boolean x:Key="IsExpanded"&amp;gt;True&amp;lt;/x:Boolean&amp;gt;
      &amp;lt;/scg3:Dictionary&amp;gt;
    &amp;lt;/sap:WorkflowViewStateService.ViewState&amp;gt;
    &amp;lt;mda:ExecuteSqlQuery x:TypeArguments="local:Track" CommandText="Select TrackId,Name,Composer,Milliseconds From Track Where AlbumId=@AlbumId" ConnectionString="Data Source=.;Initial Catalog=Chinook;Integrated Security=True" sap:VirtualizedContainerService.HintSize="287,267" ProviderName="System.Data.SqlClient" Result="[TracksByAlbumId]"&amp;gt;
      &amp;lt;mda:ExecuteSqlQuery.RecordProcessor&amp;gt;
        &amp;lt;ActivityFunc x:TypeArguments="sd:IDataRecord, local:Track"&amp;gt;
          &amp;lt;ActivityFunc.Argument&amp;gt;
            &amp;lt;DelegateInArgument x:TypeArguments="sd:IDataRecord" Name="record" /&amp;gt;
          &amp;lt;/ActivityFunc.Argument&amp;gt;
          &amp;lt;ActivityFunc.Result&amp;gt;
            &amp;lt;DelegateOutArgument x:TypeArguments="local:Track" Name="track" /&amp;gt;
          &amp;lt;/ActivityFunc.Result&amp;gt;
          &amp;lt;Assign sap:VirtualizedContainerService.HintSize="252,100"&amp;gt;
            &amp;lt;Assign.To&amp;gt;
              &amp;lt;OutArgument x:TypeArguments="local:Track"&amp;gt;[track]&amp;lt;/OutArgument&amp;gt;
            &amp;lt;/Assign.To&amp;gt;
            &amp;lt;Assign.Value&amp;gt;
              &amp;lt;InArgument x:TypeArguments="local:Track"&amp;gt;[New Track() With { .TrackId = record.GetInt32(0), .Name = record.GetString(1), .Composer = record.GetString(2), .Milliseconds = record.GetInt32(3) }]&amp;lt;/InArgument&amp;gt;
            &amp;lt;/Assign.Value&amp;gt;
          &amp;lt;/Assign&amp;gt;
        &amp;lt;/ActivityFunc&amp;gt;
      &amp;lt;/mda:ExecuteSqlQuery.RecordProcessor&amp;gt;
      &amp;lt;InArgument x:TypeArguments="x:Int32" x:Key="AlbumId"&amp;gt;1&amp;lt;/InArgument&amp;gt;
    &amp;lt;/mda:ExecuteSqlQuery&amp;gt;
    &amp;lt;ForEach x:TypeArguments="local:Track" DisplayName="ForEach&amp;lt;Track&amp;gt;" sap:VirtualizedContainerService.HintSize="287,206" Values="[TracksByAlbumId]"&amp;gt;
      &amp;lt;ActivityAction x:TypeArguments="local:Track"&amp;gt;
        &amp;lt;ActivityAction.Argument&amp;gt;
          &amp;lt;DelegateInArgument x:TypeArguments="local:Track" Name="trck" /&amp;gt;
        &amp;lt;/ActivityAction.Argument&amp;gt;
        &amp;lt;WriteLine sap:VirtualizedContainerService.HintSize="257,100" Text="[trck.ToString()]" /&amp;gt;
      &amp;lt;/ActivityAction&amp;gt;
    &amp;lt;/ForEach&amp;gt;
  &amp;lt;/Sequence&amp;gt;&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;zellikle&lt;strong&gt; ExecuteSqlQuery&amp;lt;T&amp;gt;&lt;/strong&gt; tipinin &lt;strong&gt;bold &lt;/strong&gt;olarak işaretlenmiş nitelikleri ve değerleri bizim i&amp;ccedil;in dikkat edilmesi gereken noktalar arasında yer almaktadır. Bundan sonraki kısımda size d&amp;uuml;şenleri ise şu şekilde &amp;ouml;zetleyebiliriz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Aynı &amp;ouml;rneği bir &lt;strong&gt;Stored Procedure&lt;/strong&gt; kullanacak ve parametre değerlerini &amp;ccedil;alışma zamanında(Runtime) kullanıcıdan alacak hale getirmeyi deneyebilirsiniz. Ayrıca sorgu sonu&amp;ccedil;larını &lt;strong&gt;Workflow&lt;/strong&gt; dışına &amp;ccedil;ıkartmak i&amp;ccedil;in gerekli hamleleri yapmayı deneyebilirsiniz(Argument kullanımı)&lt;/li&gt;
&lt;li&gt;Bu yazımızda değinmediğimiz &lt;strong&gt;ExecuteSqlNonQuery&lt;/strong&gt; Activity bileşeninin ne ama&amp;ccedil;la kullanıldığını incelemeye &amp;ccedil;alışabilirsiniz.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;ExecuteSqlQuery&amp;lt;T&amp;gt;&lt;/strong&gt; bileşeninin &lt;strong&gt;CommandType &lt;/strong&gt;&amp;ouml;zelliğinden yararlaran doğrudan Tablo adını belirtmek suretiyle ilgili sonu&amp;ccedil; k&amp;uuml;mesini değerlendirmeye &amp;ccedil;alışabilirsiniz.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f5%2fHelloAdoNetActivityPack.rar"&gt;HelloAdoNetActivityPack.rar (73,63 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2010-05-03 01:00:00</pubDate>
  <slug>WF-AdoNet-Entity-Pack-Hello-World</slug>
  <tags>
    <tag>workflow-foundation-40</tag>
    <tag>wf-adonet-activity-pack</tag>
    <tag>wf-state-machine-activity-pack</tag>
    <tag>wf</tag>
    <tag>wf-40</tag>
    <tag>activity</tag>
  </tags>
  <categories>
    <category>WF 4.0</category>
  </categories>
</post>