<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF 4.0 Yenilikleri - Announcement Kullanımı [Beta 1]</title>
  <description>WCF 4.0 tarafında WS-Discovery tabanlı olarak gerçekleştirilen uygulamalarda önem arz eden noktalardan biriside, servislerin online veya offline olma durumlarını, bulundukları ağ üzerindeki dinleyicilere(Listeners) bildirmeleridir(Announce).</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF 4.0 &lt;/strong&gt;tarafında &lt;strong&gt;WS-Discovery&lt;/strong&gt; tabanlı olarak ger&amp;ccedil;ekleştirilen uygulamalarda &amp;ouml;nem arz eden noktalardan biriside, servislerin &lt;strong&gt;online&lt;/strong&gt; veya &lt;strong&gt;offline&lt;/strong&gt; olma durumlarını, bulundukları ağ &amp;uuml;zerindeki &lt;strong&gt;dinleyicilere(Listeners)&lt;/strong&gt; &lt;strong&gt;bildirmeleridir(Announce)&lt;/strong&gt;. Bildiri şeklinde yapılan yayınlamalar aslında istemcinin ağ &amp;uuml;zerine yaydığı &lt;strong&gt;multicast&lt;/strong&gt; mesajların yoğunluğunu azaltmak gibi olumlu bir etkiye&amp;nbsp;de sahiptir. Şimdi bu bildirim işlemlerinin nasıl yapılacağını incelemeye &amp;ccedil;alışalım. &lt;strong&gt;Ad Hoc&lt;/strong&gt; modelinin uygulanması ile ileişkili yazımızdaki &amp;ouml;rneğimizi bu ama&amp;ccedil;la devam ettirebiliriz. Servis tarafında konfigurasyon dosyasında sadece aşağıdaki eklemeleri yapmamız yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
  &amp;lt;system.serviceModel&amp;gt;
    &amp;lt;behaviors&amp;gt;
      &amp;lt;serviceBehaviors&amp;gt;
        &amp;lt;behavior&amp;gt;
          &amp;lt;serviceDiscovery&amp;gt;
            &amp;lt;announcementEndpoints&amp;gt;
              &amp;lt;endpoint kind="udpAnnouncementEndpoint"/&amp;gt;
            &amp;lt;/announcementEndpoints&amp;gt;
          &amp;lt;/serviceDiscovery&amp;gt;
          &amp;lt;serviceMetadata/&amp;gt;
        &amp;lt;/behavior&amp;gt;
      &amp;lt;/serviceBehaviors&amp;gt;
    &amp;lt;/behaviors&amp;gt;    
    &amp;lt;services&amp;gt;
      &amp;lt;service name="ServerApp.CalculusService"&amp;gt;
        &amp;lt;endpoint address="" binding="basicHttpBinding" contract="ServerApp.ICalculus"/&amp;gt;
        &amp;lt;endpoint address="Mex" kind="mexEndpoint" /&amp;gt;
        &amp;lt;endpoint name="udpDiscovery" kind="udpDiscoveryEndpoint" /&amp;gt;
      &amp;lt;/service&amp;gt;
    &amp;lt;/services&amp;gt;
  &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Konfigurasyon dosyasında, Servis tarafına yeni bir &lt;strong&gt;davranış(Service Behavior)&lt;/strong&gt;&amp;nbsp;eklenmiş ve bu davranış i&amp;ccedil;in &lt;strong&gt;udpAnnouncementEndpoint&lt;/strong&gt; tipinden bir &lt;strong&gt;Endpoint&lt;/strong&gt; kullanılacağı belirtmiştir. Bu endpoint tipi &amp;ccedil;alışma zamanında, servisin ağ &amp;uuml;zerindeki dinleyicilere mesaj g&amp;ouml;nderebilmesi i&amp;ccedil;in gerekli alt yapının oluşturulmasını sağlamaktadır. Bir bakşa deyişle işimizi olduk&amp;ccedil;a kolaylaştırmaktadır &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Ancak istemci tarafında biraz kod eforu sarfedilmelidir. İstemci tarafı bir dinleyici olarak, servisin ortama g&amp;ouml;nderdiği "ben geldim" veya "ben gittim" tadındaki mesajları yakaladığında devreye girecek olan iki olay metodunu ele alabilmelidir. Tabi bunlardan daha &amp;ouml;nemlisi&amp;nbsp;&amp;ccedil;alışma zamanı i&amp;ccedil;in gerekli alt yapı hazırlıklarınıda&amp;nbsp;ger&amp;ccedil;ekleştirmelidir.&amp;nbsp;Şimdi istemci tarafındaki kodlarımızı aşağıdaki gibi geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using System.ServiceModel.Discovery;

namespace ClientV2
{
    class Program
    {
        static void Main(string[] args)
        {
            // Servisin online/offline olma durumlarında yaptığı bildirimleri yakalayan nesne &amp;ouml;rneği
            AnnouncementService aService = new AnnouncementService();

            // Servis online olduğunda devreye giren olay metodu
            aService.OnlineAnnouncementReceived += delegate(object sender, AnnouncementEventArgs e)
            {    
                // Online olan servisin etkinleştirilmiş Endpoint noktalarının Address bilgileri ve o anki mesajın numarası yazdırılır. 
                Console.WriteLine("\nMessage No : {0}\n\t{1} adresli EndPoint ONLINE oldu",
                    e.AnnouncementMessage.MessageSequence.MessageNumber,
                    e.AnnouncementMessage.EndpointDiscoveryMetadata.Address.ToString());

                // Etkinleşen Endpoint' ler &amp;uuml;zerinden sunulan servis s&amp;ouml;zleşmeleri yazdırılır
                Console.WriteLine("Contracts ");
                foreach (var contractType in e.AnnouncementMessage.EndpointDiscoveryMetadata.ContractTypeNames)
                {
                    Console.WriteLine("\t{0}",contractType.Name);
                }
            };

            // Servis offline olduğunda devreye giren olay metodu
            aService.OfflineAnnouncementReceived += delegate(object sender, AnnouncementEventArgs e)
            {
                // Kapatılan servis &amp;uuml;zerindeki Endpoint bilgileri yazdırılır.
                Console.WriteLine("\nMessage No : {0}\n\t{1} adresli EndPoint OFFLINE oldu",
                                    e.AnnouncementMessage.MessageSequence.MessageNumber,
                                    e.AnnouncementMessage.EndpointDiscoveryMetadata.Address.ToString());
            };

            // AnnouncementService &amp;ouml;rneği kullanılarak bir ServiceHost nesnesi &amp;ouml;rneklenir
            ServiceHost host = new ServiceHost(aService);
            // Service yeni bir UdpAnnouncementEndpoint eklenir
            host.AddServiceEndpoint(new UdpAnnouncementEndpoint());
            // Dinleme işlemleri i&amp;ccedil;in servis a&amp;ccedil;ılır
            host.Open();

            Console.WriteLine("Dinlemedeyiz...&amp;Ccedil;ıkmak i&amp;ccedil;in bir tuşa basınız");
            Console.ReadLine();

            // Servis kapatılır
            host.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Her ne kadar istemci tarafını geliştiriyor olsakta pek istemci tarzında olmadığını eminimki farketmişsinizdir.&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Nitekim istemci tarafında &lt;strong&gt;ServiceHost&lt;/strong&gt; nesnesi &amp;ouml;rneklenmekte ve kullanılmaktadır. Aslında bu son derece doğaldır. Nitekim online veya offline olan servislerin, istemciler &amp;uuml;zerinde tetikleyebildiği iki olay s&amp;ouml;z konusudur. Buda istemcinin bir anlamda servis gibide davranış g&amp;ouml;sterebilmesini gerektirmektedir. &lt;em&gt;(Normal şartlar altında servisin, istemciler &amp;uuml;zerinde olay tetikletmesi gerektiği durumlarda &amp;ouml;zellikle &lt;strong&gt;.Net Remoting&lt;/strong&gt; gibi modellerde &amp;ccedil;ok kafa karıştırıcı kodlamalar yapılması gerektiğini hatırlatmak isterim.&lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF 4.0 &lt;/strong&gt;tarafında ise tek yapmamız gereken bu iş y&amp;uuml;k&amp;uuml;n&amp;uuml; &lt;strong&gt;AnnouncementService&lt;/strong&gt; tipine atmaktır. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;ServiceHost&lt;/strong&gt; nesnesi &amp;ouml;rneklenirken parametre olarak &lt;strong&gt;AnnouncementService&lt;/strong&gt; referansı verilmektedir. Sonrasında ise &lt;strong&gt;ServiceHost&lt;/strong&gt; nesnesine, &lt;strong&gt;UpdAnnouncementEndpoint&lt;/strong&gt; tipinden bir &lt;strong&gt;Endpoint&lt;/strong&gt; ilave edilmiştir. &amp;Ouml;rnekle ilişkili ilgin&amp;ccedil; noktalardan biriside istemci tarafında &lt;strong&gt;App.config&lt;/strong&gt; dosyasının bulunmayışıdır.&lt;em&gt;(&amp;Ouml;rnekten bu dosyası bilin&amp;ccedil;li bir şekilde &amp;ccedil;ıkarttığımı belirtmek isterim)&lt;/em&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;İstemci uygulama&amp;nbsp;dinlemede kaldığı s&amp;uuml;re boyunca, online veya offline olan t&amp;uuml;m endPoint noktalarına ait &lt;strong&gt;announce&lt;/strong&gt; mesajlarını yakalayabilmektedir. Bunlara ek olarak, istemcinin belirli bir servise odaklanmadığı da g&amp;ouml;r&amp;uuml;lmektedir. Yerel ağ &amp;uuml;zerindeki herhangibir servisten gelen &lt;strong&gt;announce&lt;/strong&gt; mesajlarını dinleyebilmektedir. Modeli test etmek i&amp;ccedil;in istemci uygulama a&amp;ccedil;ık iken, bir veya daha fazla servisin&lt;em&gt;(tabiki bunların &lt;strong&gt;WS-Discovery&lt;/strong&gt; tabanlı olarak geliştirilmiş olma şartları vardır)&lt;/em&gt; kapatılıp a&amp;ccedil;ılması yeterlidir. Ben test sırasında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;ları aldım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg69_Runtime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere servisin bir ka&amp;ccedil; kere a&amp;ccedil;ılması ve kapatılmasının ardından istemci tarafındaki &lt;strong&gt;OnlineAnnouncementReceived&amp;nbsp; &lt;/strong&gt;ve &lt;strong&gt;OfflineAnnouncementReceived &lt;/strong&gt;olayları tetiklenmiş ve gerekli bildirimler yakalanmıştır. Artık bu noktadan sonra istemcinin sadece online olan &lt;strong&gt;Endpoint&lt;/strong&gt; noktalarına g&amp;ouml;re proxy nesnelerini oluşturması ve kullanması yeterli olacaktır.&lt;/p&gt;
&lt;p&gt;Bir sonraki yazımızda Ad Hoc modelini terkedip, &lt;strong&gt;Managed Discovery&lt;/strong&gt; modelini incelemeye &amp;ccedil;alışacağız. Bildiğiniz &amp;uuml;zere &lt;strong&gt;Ad Hoc&lt;/strong&gt; modelde yerel/alt ağlar s&amp;ouml;z konusudur ve ağın &amp;ouml;tesine ge&amp;ccedil;ilmesi halinde proxy tabanlı bir sistemin kullanılması gerekmektedir. Bakalım bizi ne gibi s&amp;uuml;rprizler bekliyor olacak...&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f8%2fAdHocDiscoveryForAnnouncement.rar"&gt;AdHocDiscoveryForAnnouncement.rar (82,45 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-08-21 04:00:00</pubDate>
  <slug>WCF-40-Yenilikleri-Announcement-Kullanimi</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-40</tag>
  </tags>
  <categories>
    <category>WCF 4.0 Beta 1</category>
  </categories>
</post>