<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF RIA Services - Gerçekten WCF</title>
  <description>Uzun ve yorucu bir geceydi...Dün gece WCF RIA Service' leri ile ilişkili görsel bir dersin hazırlıklarını yaparken sevgili Mehmet Cengiz arkadaşımın hediyesi olan tablet üzerinde aşağıdaki şekli çizdiğimi farkettim. Bu şekilde WCF RIA Service' i kullanan basit bir Silverlight uygulamasının anlaşılır hali yer almaktadır...</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Uzun ve yorucu bir geceydi...D&amp;uuml;n gece &lt;strong&gt;WCF RIA Service'&lt;/strong&gt; leri ile ilişkili g&amp;ouml;rsel bir dersin hazırlıklarını yaparken sevgili &lt;strong&gt;Mehmet Cengiz&lt;/strong&gt; arkadaşımın hediyesi olan tablet &amp;uuml;zerinde aşağıdaki şekli &amp;ccedil;izdiğimi farkettim. Bu şekilde &lt;strong&gt;WCF RIA Service'&lt;/strong&gt; i kullanan basit bir &lt;strong&gt;Silverlight&lt;/strong&gt; uygulamasının anlaşılır hali yer almaktadır. &lt;strong&gt;Web&lt;/strong&gt; uygulamamız, i&amp;ccedil;erisinde &lt;strong&gt;Silverlight &lt;/strong&gt;nesnesi barındıran test sayfası ve &lt;strong&gt;Domain Service&lt;/strong&gt; sınıfı, dışarıda veya aynı alanda duran &lt;strong&gt;Ado.Net Entity Data Model&lt;/strong&gt; i&amp;ccedil;eriği ve onun kullandığı veritabanı. Soru işareti i&amp;ccedil;eren ok ve Winforms kutucuğunu ise sonradan eklemeye karar verdim ve araştırmam da işte bu şekilde başladı &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg107_Plan.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ger&amp;ccedil;ektende &lt;strong&gt;Silverlight&lt;/strong&gt; uygulamlarını &lt;strong&gt;RIA Service'&lt;/strong&gt; lerini kullanacak şekilde oluşturduğumuzda, genellikle &lt;strong&gt;Silverlight&lt;/strong&gt; nesnesini host eden bir &lt;strong&gt;Web&lt;/strong&gt; uygulaması olması gerekmektedir. Bu web uygulamasının i&amp;ccedil;erisinde yer alan ve &lt;strong&gt;Sliverlight&lt;/strong&gt; tarafına veri hizmeti sunan&lt;strong&gt; RIA Service'&lt;/strong&gt; leri, harici bir &lt;strong&gt;Class Library &lt;/strong&gt;i&amp;ccedil;erisinde bulunabilen bir &lt;strong&gt;Entity Data Model'&lt;/strong&gt; i(yada aynı web domain i&amp;ccedil;erisindekini) kullanabilir. Bu şekli &amp;ccedil;izmeye &amp;ccedil;alışırken aklıma takılan ve soru işareti bırakan husus ise şudur; &lt;strong&gt;Web uygulaması dışarısında yer alan bir diğer uygulamanın, Web alanı i&amp;ccedil;erisinde yer alan bir RIA Service' ini kullanması m&amp;uuml;mk&amp;uuml;n olabilir mi? &lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil; itibariyle &lt;strong&gt;WCF&lt;/strong&gt; alt yapısı &amp;uuml;zerine oturan &lt;strong&gt;RIA Service'&lt;/strong&gt; leri web tabanlı olarak host edilmekte ve hizmet sunarken WCF &amp;ccedil;alışma zamanı motoru tarafından y&amp;uuml;r&amp;uuml;t&amp;uuml;lmektedirler. Bu nedenle belkide dışarıya &lt;strong&gt;WSDL&lt;/strong&gt; i&amp;ccedil;eriği sunabilir ve &lt;strong&gt;Silverlight&lt;/strong&gt; gibi &lt;strong&gt;Rich Internet Application'&lt;/strong&gt; lar dışındaki uygulamalar tarafından da kullanılabilirler. İşte bu sorunun cevabını ararken&amp;nbsp;&lt;a title="WCF RIA Service is a WCF Service" href="http://blogs.msdn.com/brada/archive/2009/11/22/ria-services-a-domainservice-is-a-wcf-service-add-service-reference.aspx" target="_blank"&gt;Brad Abrams' ın blog yazısı&lt;/a&gt;&amp;nbsp;ile karşılaştım. &lt;strong&gt;Brad Abrams&lt;/strong&gt; blog yazısında &lt;strong&gt;Silverlight Business Application&lt;/strong&gt; tipinden geliştirdiği bir proje &amp;uuml;zerinden ilgili konuyu irdeleyerek &lt;strong&gt;RIA Service'&lt;/strong&gt; lerin aslında birer &lt;strong&gt;WCF Service&lt;/strong&gt; olduğunu ispat etmektedir. Konuyu bende bu haliyle incelemek istediğimden aynı &amp;ouml;rneğin benzerini bu kez &lt;strong&gt;Silverlight Application &lt;/strong&gt;tipinden olan bir projede yapmayı denedim. Ancak &amp;ccedil;ok k&amp;uuml;&amp;ccedil;&amp;uuml;k bir &amp;ouml;zelliği kullanmamam nedeni ile hata ile karşılaştım. Bu hatanın sebebini ve &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;n&amp;uuml; bulmam biraz zamanımı aldı. Dolayısıyla &lt;strong&gt;Brad Abrams'&lt;/strong&gt; ın kullandığı proje şablonu yerine normal bir &lt;strong&gt;Silverlight Application&lt;/strong&gt; &amp;uuml;zerinden benzer bir senaryoyu uygulamaya karar verdim. İşte bu tecr&amp;uuml;benin hikayesi;&lt;/p&gt;
&lt;p&gt;İlk olarak aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len tipte bir Solution i&amp;ccedil;eriği oluşturarak işe başlamaya karar verdim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg107_Solution.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Silverlight Application&lt;/strong&gt; şablonunda bir &lt;strong&gt;Solution&lt;/strong&gt; a&amp;ccedil;ılmasına rağmen aslında &lt;strong&gt;ChinookMusicSotreApp&lt;/strong&gt; isimli proje hi&amp;ccedil; kullanılmayacaktır.&lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp; &lt;strong&gt;ChinookMusicStoreApp.Web&lt;/strong&gt; isimli web projesi, &lt;strong&gt;ChinookEDM&lt;/strong&gt; isimli sınıf k&amp;uuml;t&amp;uuml;phanesini referans etmektedir. Bu şekilde &lt;strong&gt;Albums &lt;/strong&gt;ve &lt;strong&gt;Artist &lt;/strong&gt;isimli &lt;strong&gt;Chinook &lt;/strong&gt;tablolarına ait Entity karşılıklarını&amp;nbsp;i&amp;ccedil;ermekte olan&lt;strong&gt; Ado.Net Entity Data Model&lt;/strong&gt; &amp;ouml;ğesini kullanabilmektedir. Diğer yandan Web tarafına eklenen &lt;strong&gt;Domain Service&lt;/strong&gt; sınıfı i&amp;ccedil;eriğinde &lt;strong&gt;Album&lt;/strong&gt; tipi &amp;uuml;zerinden &lt;strong&gt;Insert, Update, Delete&lt;/strong&gt; işlemleri yapılmasına izin verecek şekilde geliştirmeler yapılmıştır. Bu adımları tamamladıktan sonra&amp;nbsp;&lt;strong&gt;ChinookDomainService&lt;/strong&gt; sınıfının i&amp;ccedil;eriği biraz değiştirerek aşağıdaki hale getirdim. Aslında tek yaptığım GetAlbumsByFirstLetter isimli metodu eklemek oldu.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace ChinookMusicStoreApp.Web
{
    using System.Data;
    using System.Linq;
    using System.Web.DomainServices.Providers;
    using System.Web.Ria;
    using ChinookEDM;

    [EnableClientAccess()]
    public class ChinookDomainService 
        : LinqToEntitiesDomainService&amp;lt;ChinookEntities&amp;gt;
    {
        // firstLetter parametresi ile başlayan Album' lerin getirilmesini sağlar
        public IQueryable&amp;lt;Album&amp;gt; GetAlbumsByFirstLetter(string firstLetter)
        {
            return from album in ObjectContext.Albums
                   where album.Title.StartsWith(firstLetter)
                   orderby album.Title
                   select album;
        }


        // T&amp;uuml;m Artist' lerin getirilmesini sağlar
        public IQueryable&amp;lt;Artist&amp;gt; GetArtists()
        {
            return this.ObjectContext.Artists;
        }

        // Yeni bir Album eklenmesi i&amp;ccedil;in kullanılır
        public void InsertAlbum(Album album)
        {
            if ((album.EntityState != EntityState.Added))
            {
                if ((album.EntityState != EntityState.Detached))
                {
                    this.ObjectContext.ObjectStateManager.ChangeObjectState(album, EntityState.Added);
                }
                else
                {
                    this.ObjectContext.AddToAlbums(album);
                }
            }
        }

        // Bir Album' &amp;uuml; g&amp;uuml;ncelleştirmek i&amp;ccedil;in kullanılır
        public void UpdateAlbum(Album currentAlbum)
        {
            if ((currentAlbum.EntityState == EntityState.Detached))
            {
                this.ObjectContext.AttachAsModified(currentAlbum, this.ChangeSet.GetOriginal(currentAlbum));
            }
        }

        // Bir Albumu silmek i&amp;ccedil;in kullanılır
        public void DeleteAlbum(Album album)
        {
            if ((album.EntityState == EntityState.Detached))
            {
                this.ObjectContext.Attach(album);
            }
            this.ObjectContext.DeleteObject(album);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Domain Service&lt;/strong&gt; sınıfı bu şekilde hazırlandıktan sonra artık asıl işimize odaklanabiliriz. İlk hedefimiz &lt;strong&gt;ChinookDomainService&lt;/strong&gt; isimli sınıfın aslında &amp;ccedil;alışma zamanı i&amp;ccedil;in bir &lt;strong&gt;WCF Service&lt;/strong&gt; olduğunu g&amp;ouml;stermektir. Buna g&amp;ouml;re Web &amp;uuml;zerinden &lt;strong&gt;svc&lt;/strong&gt; uzantılı olarak erişilebiliyor olması gerekmektedir. Peki WCF &amp;ccedil;alışma zamanı i&amp;ccedil;in herhangibir yerde bir tanımlama yer almakta mıdır? Aslında &lt;strong&gt;web.config&lt;/strong&gt; dosyası i&amp;ccedil;eriğine bakıldığında &lt;strong&gt;system.ServiceModel &lt;/strong&gt;elementinin aşağıdaki gibi eklenmiş olduğu g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg107_Webconfig.gif" alt="" /&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;Ouml;nemli Not : &amp;Ouml;rneğimizde EDM' yi&amp;nbsp;Web uygulamamıza referans ettiğimiz bir Class&amp;nbsp;Library i&amp;ccedil;erisinde tuttuğumuz i&amp;ccedil;in, bu&amp;nbsp;k&amp;uuml;t&amp;uuml;phanenin&amp;nbsp;App.config dosyası i&amp;ccedil;erisine yazılan connectionString bilgisinin, Web uygulamasının web.config dosyasına eklenmesi gerekmektedir. Aksi takdirde &amp;ccedil;alışma zamanında hata alınacaktır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Hımmm...O halde &lt;strong&gt;Asp.net development server' &lt;/strong&gt;ın &amp;ccedil;alıştırılmasını sağlayıp herhangibir tarayıcıdan &amp;ouml;rneğimize g&amp;ouml;re&amp;nbsp;&lt;strong&gt;http://localhost:4977/ChinookMusicStoreApp-Web-ChinookDomainService.svc&lt;/strong&gt;&amp;nbsp;adresini talep ettiğimde bir Service ekranı ile karşılaşmam gerekmektedir. Oysaki bu denemenin ardından ben aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaştım. &lt;img title="Frown" src="/editors/tiny_mce3/plugins/emotions/img/smiley-frown.gif" alt="Frown" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg107_Error.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Oysaki &lt;strong&gt;Brad Abrams&lt;/strong&gt; &amp;ouml;rneğinde svc uzantısından sonra servis i&amp;ccedil;eriği g&amp;ouml;r&amp;uuml;nt&amp;uuml;lenmiş hatta &lt;strong&gt;WSDL&lt;/strong&gt; &amp;ccedil;ıktısı bile elde edilebilmiştir. Acaba sorun nerededir?&lt;/p&gt;
&lt;p&gt;Yaptığım araştırmalar sonucunda bu servise erişmek i&amp;ccedil;in bir &lt;strong&gt;Authentication&lt;/strong&gt; ayarlamasının yapılması gerektiğini &amp;ouml;ğrendim. Bu &amp;ccedil;ok doğaldı &amp;ccedil;&amp;uuml;nk&amp;uuml; &lt;strong&gt;RIA Service'&lt;/strong&gt; in kullanılmak istendiği &lt;strong&gt;Web Domain'&lt;/strong&gt; i dışarısına a&amp;ccedil;ılması gibi bir durum s&amp;ouml;z konusuydu. Dolayısıyla &lt;strong&gt;web.config&lt;/strong&gt; dosyası i&amp;ccedil;erisinde &lt;strong&gt;system.Web&lt;/strong&gt; elementi altında &lt;strong&gt;authentication&lt;/strong&gt; i&amp;ccedil;in gerekli tanımlamaların yapılması gerekmekteydi. Bu &amp;ouml;rnekte herhangibir doğrulama kullanmadığımdan&lt;em&gt;(Forms, Passport vb...) &lt;/em&gt;&lt;strong&gt;mode &lt;/strong&gt;değerini &lt;strong&gt;None &lt;/strong&gt;olarak bırakmayı tercih ettim.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0"?&amp;gt;
&amp;lt;configuration&amp;gt;

    &amp;lt;system.web&amp;gt;
        &amp;lt;httpModules&amp;gt;
            &amp;lt;add name="DomainServiceModule" type="System.Web.Ria.Services.DomainServiceHttpModule, System.Web.Ria, Version=4.0.0.0, Culture=neutral, PublicKeyToken=31BF3856AD364E35" /&amp;gt;
        &amp;lt;/httpModules&amp;gt;
        &amp;lt;compilation debug="true" targetFramework="4.0" /&amp;gt;
      &amp;lt;authentication mode="None"/&amp;gt;
    &amp;lt;/system.web&amp;gt;
.
.
.&lt;/pre&gt;
&lt;p&gt;Bu işlemin ardından&lt;strong&gt; http://localhost:4977/ChinookMusicStoreApp-Web-ChinookDomainService.svc&lt;/strong&gt;&amp;nbsp;adresine tekrardan talepte bulunduğumda aşağıdaki g&amp;ouml;r&amp;uuml;nt&amp;uuml; ile karşılaştım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg107_Runtime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hatta &lt;strong&gt;WSDL&lt;/strong&gt; talebi sonrası s&amp;ouml;z konusu servisin &lt;strong&gt;Description&lt;/strong&gt; i&amp;ccedil;eriğinin de geldiğini g&amp;ouml;rd&amp;uuml;m.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg107_Wsdl.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Demekki&lt;strong&gt; Domain Service&lt;/strong&gt; sınıfı yada geliştirdiğimiz&lt;strong&gt; RIA Service&lt;/strong&gt; ger&amp;ccedil;ektende bir WCF Service' miş. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Ancak ispatı tamamlamak i&amp;ccedil;in s&amp;ouml;z konusu servisi &amp;ouml;rnek bir istemcide kullanabiliyor olmam da gerekmekteydi. Bu nedenle &lt;strong&gt;Solution &lt;/strong&gt;i&amp;ccedil;erisinde yer alan &lt;strong&gt;Win Forms&lt;/strong&gt; uygulamasına &lt;strong&gt;Add Service Reference&lt;/strong&gt; ile &lt;strong&gt;http://localhost:4977/ChinookMusicStoreApp-Web-ChinookDomainService.svc&lt;/strong&gt; adresinden gerekli &lt;strong&gt;Proxy&lt;/strong&gt; &amp;uuml;retiminin ger&amp;ccedil;ekleştirilmesi yeterli olacaktı. Ben bu şekilde yoluma devam ettim ve aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu ilgili servis i&amp;ccedil;eriğini izin verilen operasyonları ile&lt;em&gt;(SubmitChanges metodunun da olduğuna dikkat edelim)&lt;/em&gt; &amp;uuml;retilebildiğini g&amp;ouml;rd&amp;uuml;m.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg107_AddServiceRef.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İlgili ekleme işlemi sonrasında &lt;strong&gt;app.config&lt;/strong&gt; dosyası i&amp;ccedil;eriğinin aşağıdaki gibi &amp;uuml;retildiğini farkettim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg107_Appconfig.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere iki adet &lt;strong&gt;EndPoint&lt;/strong&gt; tanımlaması yapıldığı g&amp;ouml;r&amp;uuml;lmektedir. Ben yazının bundan sonraki kısmında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne sahip bir &lt;strong&gt;Form&lt;/strong&gt; geliştirerek ilerlemeyi tercih etmekteyim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg107_Form.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında bir &amp;ouml;nceki yazımızda yaptığımız gibi A' dan Z'ye Button bileşenlerimiz bulunmaktadır ve herhangibirine basıldığında bu harf ile başlayan alb&amp;uuml;mler listelenmektedir. Buna ek olarak yeni bir Album ekleme &amp;ouml;zelliğide bulunmaktadır. Yeni bir Album nesnesi &amp;ouml;rneklendiğinde &lt;strong&gt;Title&lt;/strong&gt; ve &lt;strong&gt;ArtistId &lt;/strong&gt;değerlerinin mutlaka girilmesi gerekmektedir. &lt;strong&gt;ArtistId&lt;/strong&gt; i&amp;ccedil;inse kullanıcının var olan &lt;strong&gt;Artist'&lt;/strong&gt; lerden herhangibirini se&amp;ccedil;mesi sağlanmaktadır. İşte Form uygulamamıza ait kodlarımız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Windows.Forms;
using ChinookClient.ChinookRef;


namespace ChinookClient
{
    public partial class Form1 
        : Form
    {
        ChinookDomainServiceClient proxy;

        public Form1()
        {
            InitializeComponent();

            proxy = new ChinookDomainServiceClient("BasicHttpBinding_ChinookDomainService");
        }

        private void Form1_Load(object sender, EventArgs e)
        {
            for (int i = 65; i &amp;lt; 91; i++)
            {
                Button btn = new Button();
                btn.Width = 24;
                btn.Height = 24;
                btn.Text = ((char)i).ToString();
                btn.Click += (snd, ea) =&amp;gt;
                    {
                        grdAlbums.DataSource=proxy.GetAlbumsByFirstLetter(btn.Text).RootResults;
                    };
                pnlButtons.Controls.Add(btn);
            }

            cmbArtists.DataSource=proxy.GetArtists().RootResults;
        }

        private void btnAddNewAlbum_Click(object sender, EventArgs e)
        {
            if (!String.IsNullOrEmpty(txtTitle.Text))
            {
                Album albm = new Album
                {
                    Title = txtTitle.Text,
                     ArtistId=((Artist)cmbArtists.SelectedItem).ArtistId
                };

                ChangeSetEntry[] entry = new ChangeSetEntry[]{
                    new ChangeSetEntry {
                      Entity=albm,
                       Operation= DomainOperation.Insert
                }
                };

                proxy.SubmitChanges(entry);
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Album' lerin alfabetik olarak elde edilmesi veya Artist listesinin getirilmesi bir yana, en &amp;ouml;nemli noktalardan biriside yeni bir Album nesnesinin nasıl eklendiğidir. Dikkat edileceği &amp;uuml;zere bu işlem i&amp;ccedil;in &lt;strong&gt;ChangeSetEntry&lt;/strong&gt; tipinden bir dizi kullanılmıştır. Aslında &lt;strong&gt;Insert, Update&lt;/strong&gt; ve &lt;strong&gt;Delete&lt;/strong&gt; işlemlerinde bu tipten yararlanılmakta ve toplu olarak değişikliklerin bildirilmesi sağlanabilmektedir. &amp;Ouml;rnekte bir &lt;strong&gt;Album&lt;/strong&gt; nesnesinin eklenmesi istendiğinden &lt;strong&gt;ChangeSetEntry&lt;/strong&gt; oluşturulurken &lt;strong&gt;Operation&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;DomainOperation.Insert&lt;/strong&gt; sabit değeri atanmıştır. Buna g&amp;ouml;re &lt;strong&gt;albm&lt;/strong&gt; isimli &lt;strong&gt;Album&lt;/strong&gt; nesne &amp;ouml;rneği i&amp;ccedil;in bir &lt;strong&gt;Insert&lt;/strong&gt; işlemi yapılacağı vurgulanmaktadır. &lt;strong&gt;ChangeSetEntry&lt;/strong&gt; dizisi i&amp;ccedil;erisinde yer alan &lt;strong&gt;insert, update&lt;/strong&gt; ve &lt;strong&gt;delete&lt;/strong&gt; işlemlerinin servis tarafına g&amp;ouml;nderilmesi i&amp;ccedil;inse &lt;strong&gt;SubmitChanges&lt;/strong&gt; metodunun kullanılması yeterlidir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;Ouml;nemli Not : Artist bilgilerinin ComboBox i&amp;ccedil;erisinde g&amp;ouml;r&amp;uuml;lebilmesi i&amp;ccedil;in istemci tarafına atılan Artist sıfınında ToString metodu override edilmiştir.&lt;/p&gt;
&lt;p&gt;Bilindiği &amp;uuml;zere &lt;strong&gt;Windows Forms&lt;/strong&gt; uygulamalarında &lt;strong&gt;List&lt;/strong&gt; kontrollerinin i&amp;ccedil;eriklerine &lt;strong&gt;Object&lt;/strong&gt; t&amp;uuml;r&amp;uuml;nden herhangibir referans atanabilmektedir. &amp;Ouml;rneğimizde de &lt;strong&gt;Artist&lt;/strong&gt; nesne &amp;ouml;rneklerinin atanması s&amp;ouml;z konusudur. Ancak &lt;strong&gt;ComboBox&lt;/strong&gt; i&amp;ccedil;erisindeki &amp;ouml;ğelerde hangi bilgilerin g&amp;ouml;r&amp;uuml;neceği &lt;strong&gt;ToString&lt;/strong&gt; metodunun ezilmesi ile sağlanabilir. Tabi bu durumda bir sorunda ortaya &amp;ccedil;ıkmaktadır. &lt;strong&gt;Service'&lt;/strong&gt; te yapılacak değişiklikler sonrasında istemci tarafındaki referans g&amp;uuml;ncellenirse &lt;strong&gt;Entity&lt;/strong&gt; sınıfları tekrardan oluşturulacağından &lt;strong&gt;ezilen(Override)&lt;/strong&gt; &lt;strong&gt;ToString&lt;/strong&gt; metodunun u&amp;ccedil;acağı g&amp;ouml;r&amp;uuml;lecektir. Bu duruma dikkat etmek gerekir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;İşte &amp;ccedil;alışma zamanına ait &amp;ouml;rnek bir g&amp;ouml;r&amp;uuml;nt&amp;uuml;.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg107_NewAlbum.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Test olarak &lt;strong&gt;Van Halen&lt;/strong&gt; isimli grub i&amp;ccedil;in &lt;strong&gt;Benim Şarkılarım&lt;/strong&gt; isimli yeni bir alb&amp;uuml;m eklenmeye &amp;ccedil;alışılmıştır. Bu işlemin ardınan SQL tarafına bakıldığında &lt;strong&gt;Album&lt;/strong&gt; isimli tabloya da ilgili satırın eklendiği g&amp;ouml;zlemlenebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg107_Sql.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İşte bu kadar. &lt;strong&gt;WCF RIA Service'&lt;/strong&gt; ler ile ilişkili araştırmalarıma devam etmekteyim. Yeni bilgiler edindik&amp;ccedil;e sizlerle paylaşıyor olacağım. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f11%2fChinookMusicStoreApp.rar"&gt;ChinookMusicStoreApp.rar (590,82 kb)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg107_Override.gif" alt="" /&gt;&lt;/p&gt;</content>
  <pubDate>2009-11-25 23:19:00</pubDate>
  <slug>WCF-RIA-Services-Gercekten-WCF</slug>
  <tags>
    <tag>wcf-ria-services</tag>
    <tag>net-ria-services</tag>
    <tag>wcf</tag>
    <tag>wcf-eco-system</tag>
  </tags>
  <categories>
    <category>WCF Eco System</category>
    <category>WCF RIA Services</category>
  </categories>
</post>