<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Specification Tasarım Kalıbına Gitmeye Çalışırken Ben</title>
  <description>Şu sıralar üzerinde çalışmakta olduğumuz bir projede karşılaştığımız bir sorun var. Belli bir Domain içerisinde yer alan bazı varlıkların(Entity türleri diyelim) çeşitli kriterlere uyanlarının liste olarak çekilmesi gerekiyor. Senaryonun ilginçleştiği kısım ise farklı Entity tipleri için zaman içerisinde farklı kriterlerin de sisteme dahil edilmek istenebileceği. Bu sayede veri kümesi üzerinde çeşitli araştırma senaryolarını denemek  de mümkün hale geliyor. Bir başka deyişle aklımıza geldikçe yeni bir kriteri(örneğin bir filtreleme ölçütünü) tanımlayıp istediğimiz Entity kümeleri üzerinde kullanmak istiyoruz.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2016/09/istebeyle2.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Şu sıralar &amp;uuml;zerinde &amp;ccedil;alışmakta olduğumuz bir projede karşılaştığımız bir sorun var. Belli bir Domain i&amp;ccedil;erisinde yer alan bazı varlıkların&lt;em&gt;(Entity t&amp;uuml;rleri diyelim)&lt;/em&gt;&amp;nbsp;&amp;ccedil;eşitli kriterlere uyanlarının liste olarak &amp;ccedil;ekilmesi gerekiyor. Senaryonun ilgin&amp;ccedil;leştiği kısım ise farklı Entity tipleri i&amp;ccedil;in zaman i&amp;ccedil;erisinde farklı kriterlerin de sisteme dahil edilmek istenebileceği. Bu sayede veri k&amp;uuml;mesi &amp;uuml;zerinde &amp;ccedil;eşitli araştırma&amp;nbsp;senaryolarını denemek &amp;nbsp;de m&amp;uuml;mk&amp;uuml;n hale geliyor.&amp;nbsp;Bir başka deyişle&amp;nbsp;aklımıza geldik&amp;ccedil;e yeni bir kriteri&lt;em&gt;(&amp;ouml;rneğin bir filtreleme &amp;ouml;l&amp;ccedil;&amp;uuml;t&amp;uuml;n&amp;uuml;)&lt;/em&gt; tanımlayıp istediğimiz Entity k&amp;uuml;meleri &amp;uuml;zerinde kullanmak istiyoruz.&lt;/p&gt;
&lt;p&gt;Konu bir s&amp;uuml;re sonra sıkıcı hale gelmeye başlayınca pek tabii bilinen yazılım kalıpları ile &amp;ccedil;&amp;ouml;z&amp;uuml;lebilir mi diye de araştırmaya başladım&lt;em&gt;(Nasıl araştırdım derseniz yandaki şekle bakabilirsiniz)&lt;/em&gt; Aklıma gelen bazı &amp;ccedil;&amp;ouml;z&amp;uuml;mler&amp;nbsp;vardı ve nihayet sonunda kendimi Specification tasarım kalıbını araştırırken buldum. &lt;a href="https://en.wikipedia.org/wiki/Specification_pattern" target="_blank"&gt;Wikipedia' daki benim i&amp;ccedil;in karmaşık olan &amp;ouml;rnek&lt;/a&gt; ve Master Martin Fowler'ın konu ile ilgili yazısını takiben basit bir kod par&amp;ccedil;ası&amp;nbsp;araştırarak ge&amp;ccedil;irdiğim bunaltıcı saatlerden sonra konuyu kendimce yazıya d&amp;ouml;kerek a&amp;ccedil;ıklayabilirim diye d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m.&lt;/p&gt;
&lt;p&gt;İlk olarak sorunu masaya yatırmaya &amp;ccedil;alışalım. Elimizde aşağıdaki gibi bir sınıf olduğunu d&amp;uuml;ş&amp;uuml;nelim. Bu sınıf yardımı ile belli bir domain i&amp;ccedil;erisindeki m&amp;uuml;şterileri temsil ettiğimizi varsayabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Customer
{
	public int CustomerID { get; set; }
	public string Fullname { get; set; }
	public decimal Salary { get; set; }
	public string City { get; set; }
}&lt;/pre&gt;
&lt;p&gt;Kuvvetle muhtemel m&amp;uuml;şteri bilgileri bir veri kaynağından beslenecektir. Burada sadece m&amp;uuml;şteri k&amp;uuml;mesini temsil etmesi a&amp;ccedil;ısından eklenmiştir. Şimdi geliştirmekte olduğumuz uygulamanın ş&amp;ouml;yle bir ihtiyacı olduğunu d&amp;uuml;ş&amp;uuml;nelim; Istanbul'da yaşayan m&amp;uuml;şterileri g&amp;ouml;rmek istiyoruz. Aslında şehrin adının &amp;ccedil;ok &amp;ouml;nemi yok.&amp;nbsp;Ankara'da ikamet eden m&amp;uuml;şterilerimizi de g&amp;ouml;rmek isteyebiliriz. Ayrıca maaşı belli bir değer aralığında olanları da g&amp;ouml;rmek isteyebiliriz. Kısacası belirli kriterlere uyan m&amp;uuml;şteri k&amp;uuml;melerini &amp;ccedil;ekmek istediğimiz operasyonlarımız olduğunu d&amp;uuml;ş&amp;uuml;nelim. Bu durumda aşağıdakine benzer bir sınıf tasarlamak aklımıza gelecek ilk &amp;ccedil;&amp;ouml;z&amp;uuml;mlerden birisidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class CustomerAnalyzer
{
	public List&amp;lt;Customer&amp;gt; GetCustomerByCity(string city)
	{
		throw new NotImplementedException();
	}
	public List&amp;lt;Customer&amp;gt; GetCustomerNameContains(string letter)
	{
		throw new NotImplementedException();
	}
}&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;(&amp;Ouml;rnek kod par&amp;ccedil;ası sadece g&amp;ouml;sterim amacıyla yazıldığından metod i&amp;ccedil;lerinde bilin&amp;ccedil;li olarak NotImplementedException istisnası fırlatılmıştır)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Aslında gayet anlaşılır g&amp;ouml;r&amp;uuml;n&amp;uuml;yor &amp;ouml;yle değil mi? Fakat duayenlere g&amp;ouml;re m&amp;uuml;şterilerimizi araştırmak adına yeni bir fonksiyonellik s&amp;ouml;z konusu olursa CustomerAnalyzer sınıfına yeni bir metod daha eklememiz gerekecektir. Oysa ki, kalıp&amp;nbsp;olarak daha efektif bir &amp;ccedil;&amp;ouml;z&amp;uuml;m olmalı. &amp;Ouml;ncelikle CustomerAnalyzer sınıfına ait karmaşıklığı ortadan kaldırmamız ve daha sonradan eklenebilecek filtreleme kriterleri i&amp;ccedil;in gevşek bağlı&lt;em&gt;(Loosely Coupled)&lt;/em&gt; bir yapı tasarlamaya &amp;ccedil;alışmalıyız. Bunu ger&amp;ccedil;ekleştirmek i&amp;ccedil;in işe&amp;nbsp;&amp;ccedil;eşitli tipte kriterler i&amp;ccedil;in genel bir şablon tanımlayarak başlayabiliriz. Aşağıdaki kod par&amp;ccedil;asında yer alan CustomerSpecification sınıfı bu ama&amp;ccedil;la tasarlanmıştır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public abstract class CustomerSpecification
{
	public abstract bool IsSatisfiedBy(Customer customer);
}

public static class CustomerAnalyzer
{
	// Bu Customer listesinin bir şekilde bir yerlerden dolduğunu d&amp;uuml;ş&amp;uuml;nelim
	private static List&amp;lt;Customer&amp;gt; customers = new List&amp;lt;Customer&amp;gt;();

	public static List&amp;lt;Customer&amp;gt; GetCustomerBySpecification(CustomerSpecification spec)
	{
		foreach (var customer in customers)
		{
			if (spec.IsSatisfiedBy(customer))
				customers.Add(customer);
		}

		return customers;
	}
}&lt;/pre&gt;
&lt;p&gt;CustomerSpecification isimli abstract sınıf tek bir metod i&amp;ccedil;ermektedir. IsSatisfiedBy&lt;em&gt;(ki bu ismi bu desenin anlatıldığı kaynaklarda sıklıkla g&amp;ouml;rmekteyiz)&lt;/em&gt; metodunun en &amp;ouml;nemli &amp;ouml;zelliği geriye bool değer d&amp;ouml;nd&amp;uuml;r&amp;uuml;p parametre olarak Customer tipinden bir değişken almasıdır. Bu sınıf tahmin edeceğiniz &amp;uuml;zere yeni bir şartname i&amp;ccedil;in gerekli taban aray&amp;uuml;z&amp;uuml;&lt;em&gt;(her ne kadar hen&amp;uuml;z bir interface olmasa da)&lt;/em&gt; tanımlamaktadır. Yani m&amp;uuml;şteri k&amp;uuml;mesine uygulanacak herhangi bir filtre i&amp;ccedil;in bu sınıftan t&amp;uuml;reyen bir tipin tasarlanması yeterlidir. Bu anlamda CustomerAnalyzer sınıfının yapısı değişmiştir. Dikkat edileceği &amp;uuml;zere GetCustomerBySpecification metodu bir kriter almaktadır. S&amp;ouml;z konusu kriter CustomerSpecification tipinden t&amp;uuml;reyen bir sınıf &amp;ouml;rneğidir. Metod i&amp;ccedil;erisinde bu kritere uyan m&amp;uuml;şterilerin listeye eklenerek d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi işlemi s&amp;ouml;z konusudur&lt;em&gt;(LINQ-Language INtegrated Query tarafında da buna benzer yapılar olduğu mutlaka aklınıza gelmiştir. Orada da benzer prensiplerin uygulandığını s&amp;ouml;yleyebiliriz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdi yeni bir kriter eklemek istediğimizde tek yapmamız gereken yeni bir şartname hazırlamak ve bunu CustomerAnalyzer tipinde ele almaktır. &amp;Ouml;rneğin belirli bir şehirde yaşayan m&amp;uuml;şterilerin tespiti i&amp;ccedil;in aşağıdaki gibi bir şartname hazırlanır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class CustomerCitySpecification
	:CustomerSpecification
{
	private string _city;

	public CustomerCitySpecification(string city)
	{
		_city = city;
	}
	public override bool IsSatisfiedBy(Customer customer)
	{
		return customer.City.ToUpper() == _city.ToUpper();
	}
}&lt;/pre&gt;
&lt;p&gt;Maaşı belirli bir değer aralığında olan m&amp;uuml;şterileri mi almak istiyoruz? O zaman yeni bir şartname hazırlayarak ilerleyebiliriz.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class CustomerSalarySpecification
	:CustomerSpecification
{
	private decimal _minimum;
	private decimal _maximum;
	public CustomerSalarySpecification(decimal minimum,decimal maximum)
	{
		_minimum = minimum;
		_maximum = maximum;
	}
	public override bool IsSatisfiedBy(Customer customer)
	{
		return (customer.Salary &amp;gt;= _minimum &amp;amp;&amp;amp; customer.Salary &amp;lt;= _maximum);
	}
}&lt;/pre&gt;
&lt;p&gt;Kriterlerin kullanımı da son derece kolay olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var result1=CustomerAnalyzer.GetCustomerBySpecification(new CustomerCitySpecification("İstanbul"));
var result2 = CustomerAnalyzer.GetCustomerBySpecification(new CustomerSalarySpecification(1000, 5000));&lt;/pre&gt;
&lt;p&gt;Bu sayede CustomerAnalyzer sınıfı i&amp;ccedil;in s&amp;ouml;z konusu olabilecek ne kadar &amp;ouml;zelleştirilmiş operasyon varsa kaldırılmış ve daha da &amp;ouml;nemlisi bu operasyonları sisteme dışarıdan &amp;ouml;ğretebilir hale getirmiş oluyoruz&lt;em&gt;(Bir nevi plug-in tabanlı bir ortama doğru ilerlediğimizi ifade edebiliriz)&lt;/em&gt;&amp;nbsp;Yaptığımız &amp;ouml;rnek farklı ihtiya&amp;ccedil;lar i&amp;ccedil;in de değerlendirilebilir. &amp;Ouml;rneğin Domain Driven Design i&amp;ccedil;erisinde Entity'lerin belirli kriterlere g&amp;ouml;re doğrulanması gerektiği hallerde ele alınabilir. Bu yaklaşım biraz daha profesyonel olarak ele alındığında ortaya mimari kalıplar arasında yer alan &lt;strong&gt;Specification Design Pattern&lt;/strong&gt; &amp;ccedil;ıkmaktadır.&lt;/p&gt;
&lt;p&gt;C# tarafında generic mimarinin ve Interface kullanımının da işe katılması halinde &amp;ccedil;&amp;ouml;z&amp;uuml;m daha da zenginleştirilebilir. Nitekim s&amp;ouml;z konusu &amp;ouml;rnekte bazı handikaplar vardır. &amp;Ccedil;&amp;ouml;z&amp;uuml;m sadece Customer tipi i&amp;ccedil;in s&amp;ouml;z konusudur. T t&amp;uuml;r&amp;uuml;nden bir Entity tipi i&amp;ccedil;in benzer senaryo inşa edilmek istenebilir. Bu durumda C#'ın generic nimetlerinden&amp;nbsp;de yararlanabiliriz. Hatta şartname bir aray&amp;uuml;z(Interface) olarak da tasarlanabilir. Nitekim bu aray&amp;uuml;zden t&amp;uuml;retmeler yapılarak kompozit şartnamelerin hazırlanması&lt;em&gt;(and, or gibi mantıksal birleştirme yaklaşımlarını i&amp;ccedil;eren)&lt;/em&gt; ve zincir şeklinde metod kullanımlarına imkan tanınarak aynı entity i&amp;ccedil;in ardışıl kriterlerin entegre edilmesi m&amp;uuml;mk&amp;uuml;n hale getirilebilir&lt;em&gt;(Bu karmaşık c&amp;uuml;mleyi daha iyi anlamak i&amp;ccedil;in &lt;a href="https://en.wikipedia.org/wiki/Specification_pattern" target="_blank"&gt;wikipedia adresine&lt;/a&gt; bakmanızı &amp;ouml;neririm)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/09/specpttrn_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public interface ISpecification&amp;lt;T&amp;gt;
{
	bool IsSatisfiedBy(T entity);
}

public static class CustomerAnalyzer
{
	// Bu Customer listesinin bir şekilde bir yerlerden dolduğunu d&amp;uuml;ş&amp;uuml;nelim
	private static List&amp;lt;Customer&amp;gt; customers = new List&amp;lt;Customer&amp;gt;();

	public static List&amp;lt;Customer&amp;gt; GetCustomerBySpecification(ISpecification&amp;lt;Customer&amp;gt; spec)
	{
		foreach (var customer in customers)
		{
			if (spec.IsSatisfiedBy(customer))
				customers.Add(customer);
		}

		return customers;
	}
}

public class CustomerCitySpecification
	:ISpecification&amp;lt;Customer&amp;gt;
{
	private string _city;

	public CustomerCitySpecification(string city)
	{
		_city = city;
	}
	public bool IsSatisfiedBy(Customer customer)
	{
		return customer.City.ToUpper() == _city.ToUpper();
	}
}

public class CustomerSalarySpecification
	:ISpecification&amp;lt;Customer&amp;gt;
{
	private decimal _minimum;
	private decimal _maximum;
	public CustomerSalarySpecification(decimal minimum,decimal maximum)
	{
		_minimum = minimum;
		_maximum = maximum;
	}
	public bool IsSatisfiedBy(Customer customer)
	{
		return (customer.Salary &amp;gt;= _minimum &amp;amp;&amp;amp; customer.Salary &amp;lt;= _maximum);
	}
}&lt;/pre&gt;
&lt;p&gt;Tabii konunun en detaylı ve ilmi a&amp;ccedil;ıklaması &lt;a href="http://martinfowler.com/apsupp/spec.pdf" target="_blank"&gt;bu adresteki dok&amp;uuml;manda&lt;/a&gt;&amp;nbsp;Martin Fowler tarafından yapılmıştır.&amp;nbsp;B&amp;ouml;ylece geldik bir maceramızın daha sonuna. Her şey DB tarafından &amp;ccedil;ekilen bir nesne topluluğu &amp;uuml;zerinde bug&amp;uuml;n bilinen ama yarın &amp;ccedil;oğalabilecek farklı filtreleme kriterlerini nasıl ele alabileceğimi araştırmakla&amp;nbsp;başlamıştı. Ben bir şeyler daha &amp;ouml;ğrendim, ufkum genişledi. Umarım sizler i&amp;ccedil;in de faydalı olmuştur. Bir başka makalede g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-09-20 21:30:00</pubDate>
  <slug>specification-tasarim-kalibina-gitmeye-calisirken-ben</slug>
  <tags>
    <tag>design-pattern</tag>
    <tag>architecture-design-pattern</tag>
    <tag>software-design-patterns</tag>
    <tag>martin-fowler</tag>
    <tag>interface</tag>
    <tag>abstract-class</tag>
    <tag>c#</tag>
  </tags>
  <categories>
    <category>Tasarım Kalıpları(Design Patterns)</category>
  </categories>
</post>