<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tek Fotoluk İpucu 136 - Dosyayı Külçeler Halinde Okumak</title>
  <description>Büyük boyutlu dosyalar neredeyse her programlama ortamının en büyük sorunlarındadır. Nitekim bu tip içeriklerin bir yerden bir yere taşınması, içeriklerinde arama yapılması ve benzeri senaryolarda oluşan sistemsel yükler söz konusudur. Tek işlemli süreçlerde sıkıntı olmasa da eş zamanlı olarak n sayıda dosya üzerinde toplu işlemler söz konusu olduğunda farklı tekniklerin uygulanması önerilmektedir.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;B&amp;uuml;y&amp;uuml;k boyutlu dosyalar neredeyse her programlama ortamının en b&amp;uuml;y&amp;uuml;k sorunlarındadır. Nitekim bu tip i&amp;ccedil;eriklerin&amp;nbsp;bir yerden bir yere taşınması, i&amp;ccedil;eriklerinde&amp;nbsp;arama yapılması ve benzeri senaryolarda&amp;nbsp;oluşan sistemsel y&amp;uuml;kler s&amp;ouml;z konusudur. Tek işlemli s&amp;uuml;re&amp;ccedil;lerde sıkıntı olmasa da eş zamanlı olarak n sayıda dosya &amp;uuml;zerinde toplu işlemler s&amp;ouml;z konusu olduğunda farklı tekniklerin uygulanması &amp;ouml;nerilmektedir.&lt;/p&gt;
&lt;p&gt;Doğal olarak &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k boyutlu bir dosyayı tamamıyla belleğe a&amp;ccedil;maya &amp;ccedil;alışmak pek anlamlı değildir. B&amp;ouml;yle hallerde genellikle dosyanın belli boyutlu par&amp;ccedil;alar(chunk diyelim) halinde okunması tercih edilir&lt;em&gt;(&amp;Ouml;rneğin 4Kb lık boyutlarda par&amp;ccedil;a par&amp;ccedil;a okumak gibi)&amp;nbsp;&lt;/em&gt;Ruby tarafında da bu iş aslında son derece basit. &amp;Ouml;rneğin&amp;nbsp;binary i&amp;ccedil;erikli aşağıdaki resim dosyasının belirli boyutlarda okunmasını istediğimizi d&amp;uuml;ş&amp;uuml;nelim.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/10/einstien_3.jpg" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tek yapmamız gereken File sınıfına işleri kolaylaştıracak bir metod eklemekten ibaret. Nasıl mı? Aynen aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/10/tfi136.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;readChunk metodunu Monkey Patching tekniğini kullanarak eklemiş bulunuyoruz. Aslında File sınıfını bu fonksiyon ile genişlettiğimizi ifade edebiliriz. readChunk metodu varsayılan olarak 4096 byte'lık bloklar halinde okuma yapacak şekilde tanımlanmış&amp;nbsp;durumda. İ&amp;ccedil;erisinde yield operat&amp;ouml;r&amp;uuml;n&amp;uuml; kullanarak File sınıfının &amp;ccedil;alışma zamanında sahibi olduğu dosya &amp;uuml;zerinde ileri y&amp;ouml;nl&amp;uuml; okuma işlemini ger&amp;ccedil;ekleştirmekteyiz. Bu okuma işlemi dosya sonuna kadar yapılmakta ki bunun i&amp;ccedil;in until eof? ifadesini kullanıyoruz. Kodun ilerleyen kısmında ise s&amp;ouml;z konusu operasyonu test etmekteyiz. open metoduna yapılan &amp;ccedil;ağrı sonucu f ile ifade edilen nesne &amp;uuml;zerinden readChunk metodu &amp;ccedil;ağırılabilir. &amp;Ouml;rnekte 1024 byte' lık okumalar ger&amp;ccedil;ekleştirmekteyiz.&lt;/p&gt;
&lt;p&gt;Pek tabii bu teknik bir servis metodunun par&amp;ccedil;ası olabilir. S&amp;ouml;z konusu servis b&amp;uuml;y&amp;uuml;k boyutlu binary i&amp;ccedil;erikleri karşı tarafa par&amp;ccedil;alar halinde verebilir.&amp;nbsp;B&amp;uuml;y&amp;uuml;k boyutlu binary i&amp;ccedil;eriklerde yapmak istediğimiz işlemlerde ele alabileceğimiz basit bir kod. Tekrar g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek&amp;nbsp;hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-10-19 21:30:00</pubDate>
  <slug>tek-fotoluk-ipucu-136-dosyayi-kulceler-halinde-okumak</slug>
  <tags>
    <tag>ruby</tag>
    <tag>large-objects</tag>
    <tag>file-operations</tag>
    <tag>io</tag>
    <tag>input-output</tag>
    <tag>file-read-operations</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>