<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Self Referencing Relations ve Recursive(Yinelemeli) Metodlar</title>
  <description>Çoğumuz çalıştığımız projelerde müdür,müdür yardımcısı gibi ast üst ilişkisine sahip olan organizasyonel yapılarla karşılamışızdır. Örneğin işletmelerin Genel Müdür’ den başlayarak en alt kademedeki personele kadar inen organizasyonel yapılar gibi. Burada söz konusu olan ilişkiler çoğunlukla pozisyonel bazdadır. Yani çok sayıda personel birbirlerine pozisyonel bazda bağımlıdır ve bu bağımlılık en üst pozisyondan en alt pozisyona kadar herkesi kapsar. Bu tarz bir sistemin uygulama ortamında canlandırılabilmesi için pozisyonel ilişkileri ifade edebilecek tablo yapılarına başvurulur. Özellikle pozisyonlar arasındaki ilişkiyi kendi içerisinde referans edebilen tablolar bu tarz ihtiyaçların karşılanması için biçilmiş kaftandır. Örneğin aşağıdaki tabloyu göz önüne alalım.</description>
  <content>&lt;p&gt;&amp;Ccedil;oğumuz &amp;ccedil;alıştığımız projelerde m&amp;uuml;d&amp;uuml;r,m&amp;uuml;d&amp;uuml;r yardımcısı gibi ast &amp;uuml;st ilişkisine sahip olan organizasyonel yapılarla karşılamışızdır. &amp;Ouml;rneğin işletmelerin Genel M&amp;uuml;d&amp;uuml;r&amp;rsquo; den başlayarak en alt kademedeki personele kadar inen organizasyonel yapılar gibi. Burada s&amp;ouml;z konusu olan ilişkiler &amp;ccedil;oğunlukla pozisyonel bazdadır. Yani &amp;ccedil;ok sayıda personel birbirlerine pozisyonel bazda bağımlıdır ve bu bağımlılık en &amp;uuml;st pozisyondan en alt pozisyona kadar herkesi kapsar. Bu tarz bir sistemin uygulama ortamında canlandırılabilmesi i&amp;ccedil;in pozisyonel ilişkileri ifade edebilecek tablo yapılarına başvurulur. &amp;Ouml;zellikle pozisyonlar arasındaki ilişkiyi kendi i&amp;ccedil;erisinde referans edebilen tablolar bu tarz ihtiya&amp;ccedil;ların karşılanması i&amp;ccedil;in bi&amp;ccedil;ilmiş kaftandır. &amp;Ouml;rneğin aşağıdaki tabloyu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk117_1.gif" alt="" width="396" height="211" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Tabloda, X şirketinin &amp;ccedil;alışan personelleri arasındaki pozisyonel hiyerarşiyi temsil eden bir yapı kullanılmıştır. Dikkat edilecek olursa, her satırın Amiri alanının değeri yine tablo i&amp;ccedil;inde yer alan bir PersonelNo alanını işaret etmektedir. Bu ilişki Self Referencing Relations olarak adlandırılır. Elbette bu tarz bir sistemde hiyerarşinin nereden başladığının bir şekilde bilinmesi gerekir. &amp;Ccedil;&amp;uuml;nk&amp;uuml; tepeden aşağıya doğru inmek i&amp;ccedil;in en &amp;uuml;st birimin diğerlerinden tamamen benzersiz bir şekilde ifade edilmesine ihtiya&amp;ccedil; vardır. Buradaki gibi Amiri alanının değeri Null olan bir satır kimseye bağlı değildir. Ancak kendisine bağlı olan bir organizasyonel hiyerarşi s&amp;ouml;z konusudur. İşte bunu sağlayabilmek i&amp;ccedil;in en tepede yer alacak satırın Amiri field&amp;rsquo; ının değeri Null olarak belirlenmiştir. Tabloyu daha yakından analiz edecek olursak aşağıdaki hiyerarşik yapının oluşturulabileceğini kolayca g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk117_2.gif" alt="" width="288" height="344" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İşte bu makalemizde yukarıda g&amp;ouml;rm&amp;uuml;ş olduğumuz hiyerarşik yapıyı bir TreeView kontrol&amp;uuml;nde nasıl ifade edebileceğimizi incelemeye &amp;ccedil;alışacağız. Burada anahtar noktalar, &lt;strong&gt;Self Referencing Relations&lt;/strong&gt; oluşturmak ve bu ilişkileri &lt;strong&gt;Recursive (Yinelemeli) &lt;/strong&gt;bir Metod ile uygulayabilmektir. &amp;Ouml;ncelikle Self Referencing Relation tablomuz &amp;uuml;zerinde g&amp;ouml;rmeye &amp;ccedil;alışalım. &amp;Ouml;rneğin 5 numaralı PersonelNo değerine sahip satırımızı ele alalım. Bu satırın Amiri field&amp;rsquo; ının değeri 2 dir. Yani organizasyonel yapıda, 5 numaralı satır aslında 2 numaralı satırın altında yer almaktadır. Kaldı ki, 2 numaralı satırda 1 numaralı satırın altındadır. Bu şekilde t&amp;uuml;m satırların birbirleri ile olan bağlantılarını tespit edebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk117_3.gif" alt="" width="368" height="198" border="0" /&gt;&lt;/p&gt;
&lt;table id="table4" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;Self Referencing Relation &amp;ouml;zelliğini sağlayan tablolarda bir satır(satırların) bağlı olduğu satırın yine bu tabloda var olmasını sağlamak veri tutarlılığı (consistency) a&amp;ccedil;ısından &amp;ouml;nemlidir.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Buradaki ilişkiyi uygulamalarımızda tanımlamak i&amp;ccedil;in DataRelation nesnelerini kullanabiliriz. &amp;Ouml;rneğin;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;DataRelation dr=new DataRelation("self",ds.Tables[0].Columns["PersonelNo"],ds.Tables[0].Columns["Amiri"],false);&lt;/pre&gt;
&lt;p&gt;Bizim i&amp;ccedil;in ikinci &amp;ouml;nemli nokta bu ilişkiyi kullanacak olan Recursive(Yinelemeli) bir metodun geliştirilmesidir. Yinelemeli metodumuzu geliştirirken tablo i&amp;ccedil;erisindeki her bir satırı ele alacak ve bu satırların var ise alt satırlarına da bakacak bir algoritmayı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almamız gerekiyor. &amp;Ouml;rneğin aşağıdaki Console uygulamasını ele alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class Worker
{
    SqlConnection con=new SqlConnection("data source=BURKI;database=Veritabanim;integrated security=SSPI");
    SqlDataAdapter da;
    DataSet ds; 
    DataRelation dr;

    public void Baglan()
    {
        if(con.State==ConnectionState.Closed)
        con.Open();
    }

    public void VeriCek()
    {
        da=new SqlDataAdapter("SELECT * FROM Kadro",con);
        ds=new DataSet(); 
        da.Fill(ds);
        dr=new DataRelation("self",ds.Tables[0].Columns["PersonelNo"],ds.Tables[0].Columns["Amiri"],false);
        ds.Relations.Add(dr);
    }
    //Recursive metodumuz.
    public void DetayiniAl(DataRow dr,string giris)
    {
        Console.WriteLine(giris+dr["Personel"].ToString()); 
        foreach(DataRow drChild in dr.GetChildRows("self"))
        {
            DetayiniAl(drChild,giris+"...");
        }
    }

    public void AgacOlustur()
    {
        foreach(DataRow dr in ds.Tables[0].Rows)
        {
            if(dr.IsNull("Amiri"))
            {
                DetayiniAl(dr,"");
            }
        }
    }
}

class Class1
{
    [STAThread]
    static void Main(string[] args)
    {
        Worker wrk=new Worker();
        wrk.Baglan();
        wrk.VeriCek();
        wrk.AgacOlustur();
    }
}&lt;/pre&gt;
&lt;p&gt;Bu uygulamada basit olarak tablomuzdaki verileri &amp;ccedil;ekiyor ve organizasyonel yapıyı hiyerarşik olarak elde ediyoruz. Ağacımızı oluşturduğumuz AgacOlustur metodu, DataTable i&amp;ccedil;erisindeki t&amp;uuml;m satırları gezen bir foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml; kullanıyor. Herşeyden &amp;ouml;nce bizim en tepedeki satırı bir başka deyişle en &amp;uuml;stteki pozisyonu bulmamız gerekiyor.&lt;/p&gt;
&lt;p&gt;Tablo yapımızdan Amiri alanının değeri Null olan satırın hiyerarşinin tepesinde olması gerektiğini biliyoruz. Bu nedenle if koşulu ile bu alanı buluyoruz. Ardından bulduğumuz satırı DetayiniAl isimli Recursive(Yinelemeli) metodumuza g&amp;ouml;nderiyoruz. Yinelemeli metodumuz gelen DataRow nesnesinin Child satırlarını gezen başka bir foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml; kullanıyor. Eğer Child satırlar var ise yinelemeli metodumuz tekrardan &amp;ccedil;ağırılıyor. Bu işlem t&amp;uuml;m satırların okunması bitene kadar devam edecektir. Sonu&amp;ccedil; itibariyle Console uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk117_4.gif" alt="" width="252" height="215" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim, Windows uygulamamızda bu hiyerarşiyi nasıl şekillendirebileceğimize. İzleyeceğimiz yol Console uygulamamızdaki ile tamamen aynıdır. Tek fark bu kez bir DataRow&amp;rsquo; a bağlı alt satırları alırken yinelemeli metodumuza parent node&amp;rsquo; un &lt;em&gt;(ki burada bir TreeNode nesnesidir)&lt;/em&gt; ge&amp;ccedil;irilişidir. &amp;Ouml;rnek uygulamayı aşağıda bulabilirsiniz. &lt;em&gt;(Uygulamanın &amp;ccedil;alışmasını daha iyi anlayabilmek i&amp;ccedil;in Trace etmenizi &amp;ouml;neririm.) &lt;/em&gt;Burada &amp;ouml;zellike, child satırların hangi TreeNode&amp;rsquo; nesnesine eklenmesi gerektiğinin tespiti son derece &amp;ouml;nemlidir. Dikkat ederseniz AgacOlustur metodumuzda ilk olarak Amiri alanının değeri Null olan satırı temsil edecek bir TreeNode nesnesi oluşturulmuş ve TreeView kontrol&amp;uuml;ne eklenmiştir. Daha sonra yinelemeli metodumuza bu TreeNode ve o anki DataRow nesneleri g&amp;ouml;nderilmiştir. B&amp;ouml;ylece DetayiniAl metodu i&amp;ccedil;erisinde child satırların hangi TreeNode i&amp;ccedil;erisine alınacağı tespit edilebilir.&lt;/p&gt;
&lt;p&gt;TreeView kullanımı;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection con=new SqlConnection("data source=BURKI;database=Veritabanim;integrated security=SSPI");
SqlDataAdapter da;
DataSet ds; 
DataRelation dr;

private void Baglan()
{
    if(con.State==ConnectionState.Closed)
    con.Open();
}

private void VeriCek()
{
    da=new SqlDataAdapter("SELECT * FROM Kadro",con);
    ds=new DataSet(); 
    da.Fill(ds);
    dr=new DataRelation("self",ds.Tables[0].Columns["PersonelNo"],ds.Tables[0].Columns["Amiri"],false);
    ds.Relations.Add(dr);
}

private void DetayiniAl(DataRow dr,TreeNode t)
{
    foreach(DataRow drChild in dr.GetChildRows("self"))
    {
        TreeNode tnChild=new TreeNode(drChild["Personel"].ToString());
        t.Nodes.Add(tnChild);
        DetayiniAl(drChild,tnChild);
    }
}

private void AgacOlustur()
{
    foreach(DataRow dr in ds.Tables[0].Rows)
    {
        if(dr.IsNull("Amiri"))
        {
            TreeNode tn=new TreeNode(dr["Personel"].ToString());
            treeView1.Nodes.Add(tn);
            DetayiniAl(dr,tn);
        }
    }
}

private void Form1_Load(object sender, System.EventArgs e)
{
    Baglan();
    VeriCek();
    AgacOlustur();
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk117_2.gif" alt="" width="288" height="344" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu makalemizde kendi satırlarını işaret eden satırların var olduğu ilişkileri taşıyan tablolarda, satır arasındaki hiyerarşik yapının Recursive(Yinelemeli) metodlar ile uygulama ortamına nasıl aktarılabileceğini incelemeye &amp;ccedil;alıştık. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/SelfRefOrn.zip"&gt;&amp;Ouml;rnek kodlar i&amp;ccedil;in tıklayın.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2005-03-14 12:00:00</pubDate>
  <slug>Self-Referencing-Relations-ve-Recursive(Yinelemeli)-Metodlar-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>relations</tag>
    <tag>recursive-functions</tag>
    <tag>self-referencing</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>