<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Effective Engine — Bir Uzay Macerası</title>
  <description>Altunizade’nin bahar aylarında insanı epey dinlendiren yeşil yapraklı ağaçları ile çevrelenmiş caddesinin hemen sonunda, köprüye bağlanmadan iki yüz metre kadar öncesinde dört katlı bir bina vardır. Araba ile geçerken eğer kırmızı ışığa denk gelmediyseniz pek fark edilmez ama yürürken önündeki geniş kaldırımları ile dikkat çeker. Ana cadde tarafındaki yeşillikler binanın ilk katlarını gizemli bir şekilde saklar. Binanın bulunduğu adanın etrafı cadde ve ara sokaklarla çevrilidir. Bir sokağın karşısında yeni yapılmış hastane ile metro çıkışı, ana cadde tarafında ev yapımı tatlılarının kokusu ile insanı baştan çıkaran pastane, eczane, kuaför, camii ve minik bir park bulunur. Dört yola bakan diğer cadde tarafında ise eskiden karakol olan ama çok uzun zamandır kreş olarak işletilen bir komşu yer alır.</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/asset_cover.png" alt="" align="right" /&gt;Altunizade&amp;rsquo;nin bahar aylarında insanı epey dinlendiren yeşil yapraklı ağa&amp;ccedil;ları ile &amp;ccedil;evrelenmiş cadde&lt;span id="rmm"&gt;s&lt;/span&gt;inin hemen sonunda, k&amp;ouml;pr&amp;uuml;ye bağlanmadan iki y&amp;uuml;z metre kadar &amp;ouml;ncesinde d&amp;ouml;rt katlı bir bina vardır. Araba ile ge&amp;ccedil;erken eğer kırmızı ışığa denk gelmediyseniz pek fark edilmez ama y&amp;uuml;r&amp;uuml;rken &amp;ouml;n&amp;uuml;ndeki geniş kaldırımları ile dikkat &amp;ccedil;eker. Ana cadde tarafındaki yeşillikler binanın ilk katlarını gizemli bir şekilde saklar. Binanın bulunduğu adanın etrafı cadde ve ara sokaklarla &amp;ccedil;evrilidir. Bir sokağın karşısında yeni yapılmış hastane ile metro &amp;ccedil;ıkışı, ana cadde tarafında ev yapımı tatlılarının kokusu ile insanı baştan &amp;ccedil;ıkaran pastane, eczane, kuaf&amp;ouml;r, camii ve minik bir park bulunur. D&amp;ouml;rt yola bakan diğer cadde tarafında ise eskiden karakol olan ama &amp;ccedil;ok uzun zamandır kreş olarak işletilen bir komşu yer alır.&lt;/p&gt;
&lt;p&gt;Bu binanın bende &amp;ouml;zel bir yeri vardır. Bir zamanlar Netron adıyla da bilinen yazılım eğitim kurumlarının genel merkeziydi. Şirket eğitimlerindeki başarısı ve iyi eğitmenleri ile adından s&amp;ouml;z ettirmiş bir kurumdu. 2005 yılının sonlarına doğru adım attığım eğitmenlik kariyeriminin başlangı&amp;ccedil; noktasıydı. Geniş, yemyeşil bir bah&amp;ccedil;esi ve&amp;nbsp;&lt;em class="ik"&gt;Proxy&lt;/em&gt;&amp;nbsp;isimli bir k&amp;ouml;peği vardı. Her sabah o g&amp;uuml;zel bah&amp;ccedil;eye bakan camekanlı kafesinde taze simit ve poğa&amp;ccedil;alar olur, &amp;uuml;cretsiz dağıtılırdı. İsteyen istediği kadar alabilirdi. Camekanlı kafeye giriş kapsının &amp;ouml;n&amp;uuml;ndeki basamaklardan indiğinizde solunuzda kalan birde bilgisayar vardı. Ş&amp;ouml;yle CRT t&amp;uuml;pl&amp;uuml; monit&amp;ouml;r&amp;uuml; olan bir bilgisayar. Otururak kullanabildiğiniz değil de bir bar sandalyesi &amp;uuml;st&amp;uuml;nde hafif rahatsız bi&amp;ccedil;imde kullanabildiğiniz yavaş bir bilgisayar. Uzunca bir s&amp;uuml;re sınıflardaki birka&amp;ccedil; eğitmen bilgisayarı dışında o binada internete bağlanabilinen tek bilgisayar O olmuştu. Şifresiz ve herkesin kullanımına a&amp;ccedil;ıktı. O zamanlar &amp;ouml;ğrencilerin ders sırasında veya arasında sınıftaki bilgisayarları kullanarak internete &amp;ccedil;ıkmalarını pek istemezdik. Nitekim derste &amp;ouml;ğretilenler ile bir şeyleri &amp;ccedil;&amp;ouml;zebileceklerini umut eder, onları buna y&amp;ouml;nlendirmeye &amp;ccedil;alışırdık &amp;mdash;&amp;nbsp;&lt;em class="ik"&gt;Lakin bir defasında Ogame filosuna saldırdıkları i&amp;ccedil;in olduk&amp;ccedil;a endişeli g&amp;ouml;r&amp;uuml;nen bir &amp;ouml;ğrencim sebebiyle ders arasını birka&amp;ccedil; dakika erken vermiştim.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;O yıllarda eğitimler genellikle Microsoft&amp;rsquo;un sertifika sınavlarına g&amp;ouml;re şekillendirdiği m&amp;uuml;fredata uygun olarak verilirdi. Microsoft&amp;rsquo;un eğitimciler i&amp;ccedil;in hazırladığı eğitim dok&amp;uuml;manları epey kallavi olurdu ve &amp;ouml;n hazırlıkları bile zaman alırdı. Bazen bir ders saati i&amp;ccedil;in t&amp;uuml;m haftasonumu heba ettiğim olurdu. &amp;ouml;zellikle kurumsal bir eğitim s&amp;ouml;z konusu ise şirketlerin deneyimli personelinden gelen acımasız soruları cevaplayabilmek adına ekstra efor sarf etmek gerekiyordu. Bu durum zamanla deneyim kazanan eğitmenler i&amp;ccedil;in sorun olmasa da yeni başlayan bir eğitmen ve onun ilk &amp;ouml;ğrencileri i&amp;ccedil;in bazı hazin sonu&amp;ccedil;lara sebebiyet verebilirdi. Derken sekt&amp;ouml;r&amp;uuml;n ihtiya&amp;ccedil;larına bakıp kendi i&amp;ccedil;eriklerimizi planlamaya başladık. Hatta &amp;ccedil;oğu zaman kendi eğitim materyallerimizi hazırladık. Keyifli ama bir o kadar da k&amp;uuml;lfetli bir işti. Nitekim sahip olunan insan g&amp;uuml;c&amp;uuml; d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde s&amp;uuml;rekli değişen yeniliklere adapte olmak ve materyalleri g&amp;uuml;ncellemek başlı başına zor oluyordu. Sanki sadece yenilikleri takip edip bu materyalleri hazırlayacak ayrı bir ekip gerekliydi. Ger&amp;ccedil;i bu endişeler &amp;ccedil;ok geride kaldı.&lt;/p&gt;
&lt;p&gt;Profesyonel anlamda eğitmenliği bırakalı olduk&amp;ccedil;a uzun bir zaman oldu. En azından on yıldan fazladır bir eğitim kurumunda eğitmen olarak g&amp;ouml;rev almıyorum. Sadece son d&amp;ouml;nemlerde &amp;ccedil;alıştığım firmalar i&amp;ccedil; eğitmenlik programları kapsamında benden destek istediler. Elimden geldiğince yardımcı olmaya &amp;ccedil;alıştım/&amp;ccedil;alışıyorum. İşte 2021'in şeker bayramında eve kapandığımız vakitlerde b&amp;ouml;yle sıfırdan uzun soluklu bir eğitim vermem gerekse nasıl hazırlanırdım diye d&amp;uuml;ş&amp;uuml;nmeye başladım.&lt;/p&gt;
&lt;p&gt;&amp;ouml;yle ya, artık eğitimlerin veriliş şekilleri ve eğitmenlerden beklentiler &amp;ccedil;ok değişti. Artık sınıf eğitimlerinden ziyade &amp;ccedil;evrimi&amp;ccedil;i ulaştığımız ve &amp;ouml;nceden hazırlanıp kaydedilmiş eğitimler daha pop&amp;uuml;ler g&amp;ouml;r&amp;uuml;n&amp;uuml;yor. Ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; kaydetmenin, akış olarak internet ortamına y&amp;uuml;klemenin &amp;ccedil;ok daha kolay olduğu bu zaman diliminde hafif hazırlıklar ile bir eğitimi sunmak daha kolay g&amp;ouml;r&amp;uuml;n&amp;uuml;yor &amp;mdash;&amp;nbsp;&lt;em class="ik"&gt;sizi sıkıştıran anlık soruların olmadığı bir ortam olması sebebiyle bireysel anlamda yeni nesil eğitmenleri ne kadar zorluyor bu da tarışılır tabii.&lt;/em&gt;&amp;nbsp;Bununla birlikte uzun metrajlı i&amp;ccedil;erikler algı ve odaklanma s&amp;uuml;relerimize g&amp;ouml;re yerini mikro anlatımlara bırakıyor. Fiziki sınıf eğitimlerinde karşımızdakilerle beden dili kullanarak kurduğumuz sıcak ilişkiyi &amp;ccedil;evrimi&amp;ccedil;i ortamda sağlamak zor olduğundan, Icebreaker denen oyunlaştırılmış ara&amp;ccedil;lar kullanılıyor &amp;mdash;&amp;nbsp;&lt;em class="ik"&gt;ki bana g&amp;ouml;re hi&amp;ccedil;bir şey ger&amp;ccedil;ek anlamda g&amp;ouml;rsel ve işitsel temas ile kurulan bağın &amp;ouml;tesine ge&amp;ccedil;emez&lt;/em&gt;.&lt;/p&gt;
&lt;p&gt;Ancak her ne olursa olsun yazılım alanındaki bir eğitimin bazı temel prensipleri ve ara&amp;ccedil;ları değişmemelidir. Bu anlamda inandığım bazı ilkeler var.&lt;/p&gt;
&lt;ul class=""&gt;
&lt;li&gt;Halen daha eğitmenin konuya olan hakimiyeti &amp;ccedil;evrimdışı bir eğitim bile olsa &amp;ccedil;ok &amp;ouml;nemli. Bu hakimiyet &amp;ouml;ğrenciye sorulacak sorular i&amp;ccedil;in de zemin hazırlıyor. Yeri geldiğinde karşıda video kaydedici bile olsa d&amp;uuml;ş&amp;uuml;nd&amp;uuml;r&amp;uuml;c&amp;uuml; bir soru y&amp;ouml;neltip es vermek gerekiyor.&lt;/li&gt;
&lt;li&gt;Kendi eğitmenlik zamanlarımda da &amp;ouml;nem arz eden bir diğer konu ise saha tecr&amp;uuml;besi. Teorik bilgi birikimi ne kadar y&amp;uuml;ksek olursa olsun sahada karşılaşılan problemlerin verdiği tecr&amp;uuml;be aktarımı bir başka oluyor. Nitekim yazılım eğitimlerinin en zor kısımlarından birisi soyutlaşan kavramların ger&amp;ccedil;ek hayatla &amp;ouml;rt&amp;uuml;şt&amp;uuml;ğ&amp;uuml; noktaları karşı tarafa aktarabilmek &amp;mdash;&amp;nbsp;&lt;em class="ik"&gt;ki benim &amp;uuml;stadlarım bana &amp;ldquo;gerekirse konuyu &amp;ccedil;&amp;ouml;p adam kullanarak tahtaya &amp;ccedil;izip anlatmaya &amp;ccedil;alış&amp;rdquo; demişti. Tahtanın yerini şimdi Whiteboard ve dokunmatik ekranlar aldı belki ama prensip aynı; Basitleştirerek anlatmak.&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Bir eğitim her şeyi eğitmenin yaptığı değil aksine &amp;ouml;ğrencinin de bir şeyler yaptığı şekilde olmalı. &amp;ccedil;&amp;uuml;nk&amp;uuml; araştırma ve sorgulayarak cevap bulma kasları bilişim sekt&amp;ouml;r&amp;uuml; personeli i&amp;ccedil;in &amp;ccedil;ok &amp;ouml;nemli. Bu nedenle eğitmenin bilhassa a&amp;ccedil;ık bıraktığı bazı noktaları keşfetmesi i&amp;ccedil;in &amp;ouml;ğrencilerine &amp;ouml;devler vermesi gerekiyor.&lt;/li&gt;
&lt;li&gt;G&amp;ouml;rev addetmek m&amp;uuml;him bir mesele olsa da onu takip etmek ve karşılıklı m&amp;uuml;zakere yollarını keşfederek &amp;ouml;nerilerde bulunmak &amp;ccedil;ok daha &amp;ouml;nemli. &amp;ouml;neride bulunup &amp;ouml;ğrencinin yerine yapmaya &amp;ccedil;alışmak ise iyi bir pratik değil.&lt;/li&gt;
&lt;li&gt;Senaryolaştırmak, bazen konunun ne olduğuna bağlı olarak &amp;ouml;ncesinde bitmiş eseri g&amp;ouml;sterip sonra adım adım ilerletmek de kıymetli bir yaklaşım. Bazen yalın bir Hello World hi&amp;ccedil;bir şey ifade etmez ama senaryosu olan bir Hello World &amp;ccedil;ok şey ifade edebilir.&lt;/li&gt;
&lt;li&gt;Eğitime konu olan &amp;ouml;rneklerin b&amp;uuml;t&amp;uuml;nl&amp;uuml;ğ&amp;uuml; de kritik bir mesele. Pek &amp;ccedil;ok uygulamalı kitabın ilk noktasından son noktasına gelindiğinde, anlatılan her şeyin kullanıldığı bir &amp;uuml;r&amp;uuml;n ortaya &amp;ccedil;ıkmış oluyor. Bu pratiği eğitimin kendisine yaymak kolay değil ve daha da &amp;ouml;nemlisi olduk&amp;ccedil;a titiz bir hazırlık s&amp;uuml;reci gerektiriyor.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;D&amp;uuml;ş&amp;uuml;nceme g&amp;ouml;re bir eğitime hazırlanmak ger&amp;ccedil;ekten de kolay değil. B&amp;uuml;y&amp;uuml;k sorumluluk, b&amp;uuml;y&amp;uuml;k mesuliyet, iyi hazırlık, iyi meziyet gerektirmekte. Bu vesile ile bende bir deneme yapmak istedim. &amp;ouml;ncesinde ge&amp;ccedil;miş yıllarımdan bir tecr&amp;uuml;be birka&amp;ccedil; anı kırıntısı bulmaya &amp;ccedil;alıştım. Havaların erken karardığı ve eğitimin akşam 19:00da başladığı bir Netron g&amp;uuml;n&amp;uuml;nde anlattığım Xml Web Service konusu geldi aklıma. Ne ilgin&amp;ccedil;tir ki o zamandan beri Microsoft&amp;rsquo;un bir&amp;ccedil;ok materyalindeki konsept değişmedi. O bir saatlik eğitime hazırlandığım resmi Microsoft eğitim d&amp;ouml;k&amp;uuml;manının ilgili b&amp;ouml;l&amp;uuml;m&amp;uuml;nde bir hava durumu servisinin geliştirilmesi &amp;ouml;ğretilmekteydi.&lt;/p&gt;
&lt;p&gt;&amp;ouml;nce bitmiş Web servis &amp;ccedil;alıştırılıp elde edilmesi beklenen sonu&amp;ccedil; g&amp;ouml;steriliyor, sonrasında Request nesnesine ait XML&amp;rsquo;in hazırlanması &amp;ouml;ğretiliyor ve nihayetinde bu işin geliştirme ortamında nasıl yapılacağına değiniliyordu. Felsefesi gayet doğruydu. Bir Web Servis temel olarak ne işe yarar baştan g&amp;ouml;rebiliyordunuz. Eğitim seviyesi sebebiyle i&amp;ccedil; dinamiklerinde XML ne anlama geliyor, bir SOAP talebi hangi par&amp;ccedil;alardan oluşuyor &amp;ouml;ğreniyordunuz. Ne elde edeceğim, nasıl &amp;ccedil;alışıyor terapisinden sonra pratiğe ge&amp;ccedil;iliyor ve uygulama geliştiriliyordu. Bug&amp;uuml;nk&amp;uuml; .Net 5 d&amp;uuml;nyasına &amp;mdash;&amp;nbsp;&lt;em class="ik"&gt;veya .Net Core tarafına&amp;nbsp;&lt;/em&gt;baktığımızda da bir Web API servisi s&amp;ouml;z konusu ise benzer bir senaryo koşulduğunu biliyor olmalısınız. Artık bilin&amp;ccedil; altımıza işlemiş olan, her şablonda karşımıza &amp;ccedil;ıkan WeatherForecast senaryosu.&lt;/p&gt;
&lt;p&gt;Pek &amp;ccedil;ok saygın kitapta veya &amp;ccedil;evrimi&amp;ccedil;i eğitimde olduğu gibi uzun vadedeki &amp;ccedil;&amp;ouml;z&amp;uuml;mler veri odaklı bir d&amp;uuml;nya &amp;uuml;zerine inşa ediliyor. Ulaşılmak istenen nokta ister Blazor ister MVC olsun, ister Progressive Web App ister Mobil &amp;ccedil;&amp;ouml;z&amp;uuml;m veya bir başkası olsun o b&amp;uuml;y&amp;uuml;k kitabın veya sekiz saatlik eğitimin başlarında bir yerlerde bir REST veya gRPC servisi s&amp;ouml;z konusu oluyor. &amp;uuml;stelik bu servis pratik olması a&amp;ccedil;ısından genellikle In-Memory tabanlı, Docker ile kurgulanmış veya local formasyonda &amp;ccedil;alışan bir veritabanı kullanıyor. İşte eğitimcinin yaratıcılığı bu noktada başlıyor. Renkli bir senaryo kurgulamak, hikayenin bazı noktalarında &amp;ouml;ğrencinin isteklerini kabul ederek yeni şeyleri s&amp;uuml;rece katmak&lt;em class="ik"&gt;(Farklı entity nesneleri veya fonksiyonellikler gibi)&lt;/em&gt;, In-Memory veritabanı ile başlatıp Docker ile diğer t&amp;uuml;rlere ge&amp;ccedil;işlerin yapılacağı &amp;ouml;devler vermek vs&lt;/p&gt;
&lt;p&gt;Peki ya bunu nasıl yapacak? İşte bir eğitmenin bence sahip olması gereken en &amp;ouml;nemli &amp;ouml;zelliklerden birisi. Yazarak adım adım planlamak. Ben bu tip bir işe kalkışsam sanırım en b&amp;uuml;y&amp;uuml;k yardımcılarım Markdown formatındaki bir Readme dosyası ile&amp;nbsp;&lt;a class="bv it" href="https://github.com/buraksenyurt/effective-engine" rel="noopener nofollow"&gt;kodları planlayarak tutabileceğim github benzeri bir kaynak deposu&lt;/a&gt;&amp;nbsp;olurdu. Hatta o depoyu da belki branch&amp;rsquo;ler ile kurgulayarak &amp;ouml;nce ş&amp;ouml;yle, şimdi b&amp;ouml;yle, sonra da &amp;ouml;yle gibi ifade etmek gerekirdi.&amp;nbsp;&lt;a class="bv it" href="https://github.com/buraksenyurt/hands-on-aspnetcore-di" rel="noopener nofollow"&gt;&amp;ouml;rneğin&amp;hellip;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil; olarak aşağıdaki gibi amat&amp;ouml;r bir kurgu oluşturdum. Umarım şirket i&amp;ccedil;i eğitmenlere yol g&amp;ouml;sterici olur.&lt;/p&gt;
&lt;h2&gt;Senaryo&lt;/h2&gt;
&lt;p&gt;Haftasonu sıkılan .Net geliştiricisi i&amp;ccedil;in eğlencelik bir Web API kodlaması d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m. Şirket i&amp;ccedil;i eğitimlerde bir Web API&amp;rsquo;ye ihtiya&amp;ccedil; duyduğumuz durumlar i&amp;ccedil;in g&amp;uuml;zel olabilir. Hani kobay bir Web API servisi olur ya hep, g&amp;ouml;rsellik katılınca s&amp;uuml;kseli duran. İşte onun i&amp;ccedil;in g&amp;uuml;zel bir senaryo olabileceğini d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Senaryoyu aşağıdaki gibi &amp;ccedil;izmeye &amp;ccedil;alıştım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/assets_01.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Gelecekte ge&amp;ccedil;en bir zaman diliminde galaksinin uzak diyarlarını keşfetmek &amp;uuml;zere Uzay Yolu&amp;rsquo;nu izlemiş m&amp;uuml;rettabattan oluşan gemiler vardır. G&amp;uuml;neşin ve ayın konumuzla bir alakası yok ama kompozisyonu tamamlarlar diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;p resme dahil ettim. Bir uzay gemisi&lt;em class="ik"&gt;(Spaceship)&lt;/em&gt;&amp;nbsp;i&amp;ccedil;inde en az 2 en fazla 7 m&amp;uuml;rettebat&lt;em class="ik"&gt;(Voyager)&amp;nbsp;&lt;/em&gt;olabilir. M&amp;uuml;rettebat g&amp;ouml;rev kontrol&amp;uuml;n&lt;em class="ik"&gt;(MissionControl)&lt;/em&gt;&amp;nbsp;uygun g&amp;ouml;rd&amp;uuml;ğ&amp;uuml; gemiyle bir g&amp;ouml;reve&lt;em class="ik"&gt;(Mission)&lt;/em&gt;&amp;nbsp;&amp;ccedil;ıkar. Her g&amp;ouml;rev tek bir gemiyle ilişkilendirilir ama itirazınız varsa bunu &amp;ccedil;oklayabiliriz de. G&amp;ouml;revin başlatılması i&amp;ccedil;in bir adının olması, kendilerine has takma isimleri olan m&amp;uuml;rettebatın bulunması, g&amp;ouml;rev s&amp;uuml;resi verilmesi&lt;em class="ik"&gt;(En az 12 en fazla 24 ay)&lt;/em&gt;, bir gemiyle g&amp;ouml;revin ilişkilendirilmesi yeterlidir. Senaryoyu birlikte genişletebiliriz ama varsayılan hali aşağıdaki gibidir.&amp;mdash;&amp;nbsp;&lt;em class="ik"&gt;Burası &amp;ouml;ğrencilere senaryonun anlatıldığı kısım. Eğlenceli olmalı, ilgi &amp;ccedil;ekmeli, hatta eğitmen bunu canlı olarak &amp;ccedil;izerek anlatmalıdır.&lt;/em&gt;&lt;/p&gt;
&lt;h2&gt;0 &amp;mdash; Başlangı&amp;ccedil;&lt;/h2&gt;
&lt;p&gt;&lt;em class="ik"&gt;Solution ve projenin ilk aşamasıdır. Giriş kısmı olduğu i&amp;ccedil;in sarf edilen s&amp;ouml;zler &amp;ouml;nemlidir. Neden bir Class Library a&amp;ccedil;arak başladık ve ona neden EntityFrameworkCore diye bir paketi ekledik anlatmamız gerekir.&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# Bir Solution oluşturdum
dotnet new sln -o GalaxyExplorer

# Sonra Voyager, Spaceship ve Mission olarak adlandırdığım nesneler i&amp;ccedil;in Entity ile DbContext'in duracağı bir class library oluşturup solution'a ekledim.
cd GalaxyExplorer
dotnet new classlib -o GalaxyExplorer.Entity
dotnet sln add .\GalaxyExplorer.Entity\GalaxyExplorer.Entity.csproj

# EntityFrameworkCore kullanacağım i&amp;ccedil;in birde gerekli paketi ekledim
cd GalaxyExplorer.Entity
dotnet add package Microsoft.EntityFrameworkCore -v 5.0.6&lt;/pre&gt;
&lt;h2&gt;1 &amp;mdash; Entity Sınıflarının İnşası&lt;/h2&gt;
&lt;p&gt;Uzay gemilerini Spaceship sınıfı ile işaret edeceğiz. Adı ve ışık yılı olarak gidebileceği mesafeyi taşıması yeterli.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace GalaxyExplorer.Entity
{
    public class Spaceship
    {
        public int SpaceshipId { get; set; }
        public string Name { get; set; }
        public double Range { get; set; }
        public bool OnMission { get; set; }
        public int MaxCrewCount { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;M&amp;uuml;rettebatı ise Voyager olarak tanımlayabiliriz. Şimdilik aşağıdaki gibi kullanacağız. Kaşifin adı, r&amp;uuml;tbesi, ilk g&amp;ouml;rev tarihi, aktif olup olmadığı bilgileri olsun yeterli.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace GalaxyExplorer.Entity
{
    public class Voyager
    {
        public int VoyagerId { get; set; }
        public string Name { get; set; }
        public string Grade { get; set; }
        public DateTime FirstMissionDate { get; set; }
        public int MissionId { get; set; }
        public bool OnMission { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Bir g&amp;ouml;rev s&amp;ouml;z konusu. Bunu Mission sınıfı ile temsil edebiliriz. Bir g&amp;ouml;rev bir gemiyle ilişkili olmalıdır diye ifade etmiştik. Ayrıca bir g&amp;ouml;reve birden fazla m&amp;uuml;rettebat da dahil olabilmelidir. Bu d&amp;uuml;ş&amp;uuml;nceleri resmeden bir sınıfı aşağıdaki gibi yazabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;

namespace GalaxyExplorer.Entity
{
    public class Mission
    {
        public int MissionId { get; set; }
        public int SpaceshipId { get; set; }
        public string Name { get; set; }
        public int PlannedDuration { get; set; }
        public DateTime StartDate { get; set; }
        public IEnumerable&amp;lt;Voyager&amp;gt; Voyagers { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;em class="ik"&gt;&amp;ldquo;Neden bu entity sınıflarını inşa ediyoruz?&amp;rdquo; diye sormalı karşılıklı g&amp;ouml;r&amp;uuml;ş almalıyız.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong class="ho cu"&gt;2 &amp;mdash; DbContext Sınıfının Yazılması&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Senaryomuzda hangi veritabanını kullanacağımıza hen&amp;uuml;z karar vermedik lakin Entity Framework Core&amp;rsquo;dan yararlanmaktayız. Code First modeli ile ilerliyoruz ama Model First ve Database First şeklinde farklı versiyonlar olduğunu da hatırlayalım. Şu anda Domain&amp;rsquo;e ait tipleri tasarlayıp sonrasında veritabanına ge&amp;ccedil;eceğiz. İlerleyen derslerde isteyen istediği veritabanı ile &amp;ccedil;alışabilir olacak&lt;em class="ik"&gt;(Uygun olan veritabanı tabii)&lt;/em&gt;&amp;nbsp;Bu ama&amp;ccedil;la GalaxyExplorerDbContext sınıfını aşağıdaki gibi yazarak devam edelim. İ&amp;ccedil;inde kullanıma hazır uzay gemileri de var &amp;mdash;&lt;em class="ik"&gt;&amp;nbsp;Burada &amp;ouml;ğrencilerden de uzay gemisi adları alabiliriz. Hayal g&amp;uuml;&amp;ccedil;lerini kullanmaları her zaman etkileşimi y&amp;uuml;kseltir&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Microsoft.EntityFrameworkCore;

namespace GalaxyExplorer.Entity
{
    public class GalaxyExplorerDbContext
        : DbContext
    {
        public GalaxyExplorerDbContext(DbContextOptions options)
            : base(options)
        {
        }

        public DbSet&amp;lt;Spaceship&amp;gt; Spaceships { get; set; }
        public DbSet&amp;lt;Voyager&amp;gt; Voyagers { get; set; }
        public DbSet&amp;lt;Mission&amp;gt; Missions { get; set; }
        protected override void OnModelCreating(ModelBuilder modelBuilder)
        {
            modelBuilder.Entity&amp;lt;Mission&amp;gt;().HasMany(m =&amp;gt; m.Voyagers).WithOne();

            modelBuilder.Entity&amp;lt;Spaceship&amp;gt;().HasData(
                new Spaceship
                {
                    SpaceshipId=1,
                    Name = "Saturn IV Rocket",
                    OnMission = false,
                    Range = 1.2,
                    MaxCrewCount=2
                },
                new Spaceship
                {
                    SpaceshipId = 2,
                    Name = "Pathfinder",
                    OnMission = true,
                    Range = 2.6,
                    MaxCrewCount = 5
                },
                new Spaceship
                {
                    SpaceshipId = 3,
                    Name = "Event Horizon",
                    OnMission = false,
                    Range = 9.9,
                    MaxCrewCount = 3
                },
                new Spaceship
                {
                    SpaceshipId = 4,
                    Name = "Captain Marvel",
                    OnMission = false,
                    Range = 3.14,
                    MaxCrewCount = 7
                },
                new Spaceship
                {
                    SpaceshipId = 5,
                    Name = "Lucky Tortiinn",
                    OnMission = false,
                    Range = 7.7,
                    MaxCrewCount = 7
                },
                new Spaceship
                {
                    SpaceshipId = 6,
                    Name = "Battle Master",
                    OnMission = false,
                    Range = 10,
                    MaxCrewCount = 5
                },
                new Spaceship
                {
                    SpaceshipId = 7,
                    Name = "Zerash Guidah",
                    OnMission = true,
                    Range = 3.35,
                    MaxCrewCount = 3
                },
                new Spaceship
                {
                    SpaceshipId = 8,
                    Name = "Ayran Hayd",
                    OnMission = false,
                    Range = 5.1,
                    MaxCrewCount = 4
                },
                new Spaceship
                {
                    SpaceshipId = 9,
                    Name = "Nebukadnezar",
                    OnMission = false,
                    Range = 9,
                    MaxCrewCount = 7
                },
                new Spaceship
                {
                    SpaceshipId = 10,
                    Name = "Sifiyus Alpha Siera",
                    OnMission = false,
                    Range = 7.7,
                    MaxCrewCount = 7
                }
            );
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong class="ho cu"&gt;3 &amp;mdash; DTO Tipleri i&amp;ccedil;in Bir K&amp;uuml;t&amp;uuml;phane Oluşturulması&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;rev kontrol tarafına ilk etapta sadece bir başlatma emri gelsin istiyoruz. G&amp;ouml;revin adı, katılacak m&amp;uuml;rettebatın isimleri gibi az sayıda bilgi yeterli olabilir. Entity t&amp;uuml;rlerini doğrudan API &amp;uuml;zerinden a&amp;ccedil;mak yerine bir ViewModel vasıtasıyla sadece aksiyona &amp;ouml;zg&amp;uuml; değişkenlerle sunmak niyetindeyiz. O y&amp;uuml;zden Data Transfer Object olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilecek sınıfları kullanacağız&amp;mdash; &amp;ldquo;&lt;em class="ik"&gt;DTO&amp;rsquo;lar yazılım d&amp;uuml;nyasının hangi noktasında karşımıza &amp;ccedil;ıkarlar? Bu senaryoda ki kullanım ama&amp;ccedil;ları dışında bir rolleri olabilir mi?&amp;rdquo; şeklinde sorular sorup m&amp;uuml;zakere etmek gerekiyor.&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# DTO Projesini a&amp;ccedil;tım
dotnet new classlib -o GalaxyExplorer.DTO

# ve Solution'a ekledim
dotnet sln add .\GalaxyExplorer.DTO\GalaxyExplorer.DTO.csproj&lt;/pre&gt;
&lt;p&gt;Sonrasında yeni bir g&amp;ouml;rev başlatmak i&amp;ccedil;in kullanacağımız aşağıdaki DTO sınıflarını ekleyerek devam edelim.&lt;/p&gt;
&lt;p&gt;G&amp;ouml;reve katılacak m&amp;uuml;rettebat i&amp;ccedil;in VoyageRequest sınıfı.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ComponentModel.DataAnnotations;

namespace GalaxyExplorer.DTO
{
    public class VoyagerRequest
    {
        [Required]
        [MinLength(3)]
        [MaxLength(25)]
        public string Name { get; set; }
        [Required]
        public string Grade { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;revin kendisi i&amp;ccedil;inse MissionStartRequest sınıfı. En az iki en fazla yedi m&amp;uuml;rettebat katılabilen g&amp;ouml;revlerden bahsetmiştik. Gemi ataması ise havuzdaki m&amp;uuml;sait olanlardan yapılmalı. Bu y&amp;uuml;zden g&amp;ouml;rev gemisi ile ilgili bir bilgi eklemedik. Bu noktada da fark edeceğiniz &amp;uuml;zere bir g&amp;ouml;revi başlatmak i&amp;ccedil;in ihtiya&amp;ccedil; duyulan veri modeli ile Entity tam olarak &amp;ouml;rt&amp;uuml;şm&amp;uuml;yor. İşte Data Transfer Object i&amp;ccedil;in bir başka bahane. &amp;mdash;&amp;nbsp;&lt;em class="ik"&gt;Bu noktada ger&amp;ccedil;ekten doğru bir şeyler s&amp;ouml;yl&amp;uuml;yor muyum diye sorgulatmak lazım. &amp;ouml;ğrencilerle tartışılması gereken bir konu daha.&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.ComponentModel.DataAnnotations;

namespace GalaxyExplorer.DTO
{
    public class MissionStartRequest
    {
        [Required]
        [MinLength(10)]
        [MaxLength(50)]
        public string Name { get; set; }
        [Required]
        [Range(12,24)] // En az 12 en fazla 24 aylık g&amp;ouml;rev olabilir
        public int PlannedDuration { get; set; }
        [Required]
        [MinLength(2)]
        [MaxLength(7)] //Minimum 2 maksimum 7 m&amp;uuml;rettebat olsun diye
        public List&amp;lt;VoyagerRequest&amp;gt; Voyagers { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;em class="ik"&gt;G&amp;ouml;revi başlatma sırasında oluşacak hatalar ile ilgili ayrı bir d&amp;ouml;n&amp;uuml;ş tipi kullanmak yararlı olabilir. Bunu sağlamak i&amp;ccedil;in MissionStartResponse sınıfını ekleyebiliriz. &amp;mdash;&amp;nbsp;&lt;em class="ik"&gt;Bu noktada &amp;ldquo;Servis portlarının girdi ve &amp;ccedil;ıktı mesajlarında bir standart kullnamak gerekir mi?&amp;rdquo; sorusunu sorup tartışabiliriz.&lt;/em&gt;&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace GalaxyExplorer.DTO
{
    public class MissionStartResponse
    {
        public bool Success { get; set; }
        public string Message { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;em class="ik"&gt;Başka ne t&amp;uuml;r validasyon nitelikleri kullanılabilir, araştırmalarını s&amp;ouml;yleyebiliriz. Tabi s&amp;ouml;ylemek yetmez takibini de yapmamız gerekir. Bir sonraki ders kısa bir tekrar sonrası sorulan sorular &amp;uuml;st&amp;uuml;nde tartışmak verimli bir &amp;ouml;ğrenim s&amp;uuml;reci sağlar.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong class="ho cu"&gt;4 &amp;mdash; Servis Bileşenleri i&amp;ccedil;in K&amp;uuml;t&amp;uuml;phane Eklenmesi&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Web API haricinde buradaki kurguyu farklı bir ortamda da kullanmak isteyebiliriz. Controller tipinin kullanacağı Entity Framework işlerini başka bir k&amp;uuml;t&amp;uuml;phanede toplayacak şekilde proje bazında soyutlasak g&amp;uuml;zel olabilir. Hatta servisleştirirsek &amp;ccedil;ok daha iyi olur. B&amp;ouml;ylece Dependency Injection &amp;ccedil;atısını kullanarak asıl &amp;uuml;r&amp;uuml;ne eklememiz de kolay olur. &amp;ouml;nce bir k&amp;uuml;t&amp;uuml;phane oluşturalım ve gerekli projeleri referans edelim&amp;mdash;&amp;nbsp;&lt;em class="ik"&gt;Dependency Injection. Hassas, &amp;ccedil;ok hassas bir konu. Burada gerekirse uzun s&amp;uuml;reli es verip karşılıklı konuşmak,&amp;nbsp;&lt;/em&gt;&lt;a class="bv it" href="https://medium.com/dogustech/asp-net-corea-nas%C4%B1l-merhaba-deriz-4469c0e06ff5" rel="noopener"&gt;&lt;em class="ik"&gt;&amp;ouml;nceki derslerde anlatılan kısımlara refernas&lt;/em&gt;&lt;/a&gt;&lt;em class="ik"&gt;&amp;nbsp;ederek y&amp;ouml;nlendirmek gerekebilir.&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# Projeyi oluştur
dotnet new classlib -o GalaxyExplorer.Service
# Solution'a ekle
dotnet sln add .\GalaxyExplorer.Service\GalaxyExplorer.Service.csproj
# Proje i&amp;ccedil;ine gir
cd .\GalaxyExplorer.Service
# DTO projesini referans et
dotnet add reference ..\GalaxyExplorer.DTO\GalaxyExplorer.DTO.csproj

# DbContext'e ihtiyacım olacak.
dotnet add reference ..\GalaxyExplorer.Entity\GalaxyExplorer.Entity.csproj&lt;/pre&gt;
&lt;p&gt;&amp;ouml;nce soyutlamayı sağlayacak aray&amp;uuml;z tipini ekleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using GalaxyExplorer.DTO;
using System.Threading.Tasks;

namespace GalaxyExplorer.Service
{
    public interface IMissionService
    {
        Task&amp;lt;MissionStartResponse&amp;gt; StartMissionAsync(MissionStartRequest request);
    }
}&lt;/pre&gt;
&lt;p&gt;Sonra asıl işi yapan sınıfı(Concrete Class)&amp;nbsp;yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using GalaxyExplorer.DTO;
using GalaxyExplorer.Entity;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace GalaxyExplorer.Service
{
    public class MissionService
        : IMissionService
    {
        private readonly GalaxyExplorerDbContext _dbContext;
        // Servisi kullanan uygulamanın DI Container Service Registery'si &amp;uuml;zerinden gelecektir.
        // O anki opsiyonları ile birlikte gelir. SQL olur, Postgresql olur, Mongo olur bilemiyorum.
        // Entity modelin uygun d&amp;uuml;şen bir DbContext gelecektir.
        public MissionService(GalaxyExplorerDbContext dbContext)
        {
            _dbContext = dbContext;
        }
        public async Task&amp;lt;MissionStartResponse&amp;gt; StartMissionAsync(MissionStartRequest request)
        {
            using var transaction = await _dbContext.Database.BeginTransactionAsync(); // Transaction başlatalım
            try
            {
                // M&amp;uuml;rettebat sayısı uygun olup aktif g&amp;ouml;revde olmayan bir gemi bulmalıyız. Aday havuzunu &amp;ccedil;ekelim.
                var crewCount = request.Voyagers.Count;
                var candidates = _dbContext.Spaceships.Where(s =&amp;gt; s.MaxCrewCount &amp;gt;= crewCount &amp;amp;&amp;amp; s.OnMission == false).ToList();
                if (candidates.Count &amp;gt; 0)
                {
                    Random rnd = new();
                    var candidateId = rnd.Next(0, candidates.Count);
                    var ship = candidates[candidateId]; // Index değerine g&amp;ouml;re rastgele bir tanesini alalım

                    ship.OnMission = true;
                    await _dbContext.SaveChangesAsync(); // Gemiyi g&amp;ouml;revde durumuna alalım

                    // G&amp;ouml;rev nesnesini oluşturalım
                    Mission mission = new Mission
                    {
                        Name = request.Name,
                        PlannedDuration = request.PlannedDuration,
                        SpaceshipId = ship.SpaceshipId, // Gemi ile ilişkilendirdik
                        StartDate = DateTime.Now
                    };
                    await _dbContext.Missions.AddAsync(mission);
                    await _dbContext.SaveChangesAsync(); // G&amp;ouml;rev nesnesini db'ye yollayalım

                    // Gelen gezginlerin listesini dolaşıp
                    var voyagers = new List&amp;lt;Voyager&amp;gt;();
                    foreach (var v in request.Voyagers)
                    {
                        Voyager voyager = new Voyager // Her biri i&amp;ccedil;in bir Voyager nesnesi &amp;ouml;rnekleyelim
                        {
                            Name = v.Name,
                            Grade = v.Grade,
                            OnMission = true,
                            MissionId = mission.MissionId // G&amp;ouml;revle ilişkilendirdik
                        };
                        voyagers.Add(voyager);
                    }
                    await _dbContext.Voyagers.AddRangeAsync(voyagers); // Bunları topluca Voyagers listesine ekleyelim
                    await _dbContext.SaveChangesAsync(); // Değişiklikleri kaydedelim.
                    await transaction.CommitAsync(); // Transaction'ı commit edelim

                    return new MissionStartResponse
                    {
                        Success = true,
                        Message = "G&amp;ouml;rev başlatıldı."
                    };
                }
                else // M&amp;uuml;sait veya uygun gemi yoksa burda durmamızın anlamı yok
                {
                    await transaction.RollbackAsync();

                    return new MissionStartResponse
                    {
                        Success = false,
                        Message = "Şu anda g&amp;ouml;rev i&amp;ccedil;in m&amp;uuml;sait gemi yok"
                    };
                }                
            }
            catch (Exception exp)
            {
                await transaction.RollbackAsync();
                return new MissionStartResponse
                {
                    Success = false,
                    Message = $"Sistem Hatası:{exp.Message}"
                };
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;em class="ik"&gt;Yazılan servis kodundan &amp;ccedil;eşitli sorular sorulabilir. &amp;ouml;rneğin hangi t&amp;uuml;r injection tekniği kullanılmaktadır, başka ne t&amp;uuml;rleri vardır, veritabanı belli midir, belli ise bağlantı bilgisi nerededir, transaction a&amp;ccedil;ılmasının sebebi nedir, temel transaction ilkeleri nelerdir vb. Buradan yola &amp;ccedil;ıkarak &amp;ldquo;BASE&amp;rsquo;i duymuş muydunuz?&amp;rdquo; diye bir soru sorulabilir ve NoSQL ilkelerine ge&amp;ccedil;ilip dağıtık sistemler i&amp;ccedil;in &amp;ouml;nem arz eden CAP teoremine atıfta bulunulabilinir. Detaylar ders harici zamanlarda merak edenlerle konuşulur veya araştırma &amp;ouml;devi olarak atanır.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong class="ho cu"&gt;5 &amp;mdash; Sırada Controller var. Yani Web API&amp;rsquo;nin İnşası&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;ouml;nce projeyi oluşturup gerekli paketleri ve proje referanslarını aşağıdaki gibi ekleyelim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# Web API projesini oluştur
dotnet new webapi -o GalaxyExplorer.API
# Solution'a ekle
dotnet sln add .\GalaxyExplorer.API\GalaxyExplorer.API.csproj
# Proje klas&amp;ouml;r&amp;uuml;ne ge&amp;ccedil;
cd .\GalaxyExplorer.API
# EntityFrameworkCore paketini ekle
dotnet add package Microsoft.EntityFrameworkCore -v 5.0.6
# Local SQL kullanmak istedim. Onun paketini ekle
dotnet add package Microsoft.EntityFrameworkCore.SqlServer -v 5.0.6
# Migration i&amp;ccedil;in gerekli olacak paket
dotnet add package Microsoft.EntityFrameworkCore.Design -v 5.0.6

# WeatherForecast* tiplerini sildim

# Service ve DTO projelerini referasn ettim
dotnet add reference ..\GalaxyExplorer.Service\GalaxyExplorer.Service.csproj
dotnet add reference ..\GalaxyExplorer.DTO\GalaxyExplorer.DTO.csproj
dotnet add reference ..\GalaxyExplorer.Entity\GalaxyExplorer.Entity.csproj&lt;/pre&gt;
&lt;p&gt;Startup.cs i&amp;ccedil;erisindeki ConfigureServices metodunu da takip eden kod par&amp;ccedil;asında olduğu gibi d&amp;uuml;zenleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void ConfigureServices(IServiceCollection services)
{
    // DI serivslerine DbContext t&amp;uuml;revini ekliyoruz. 
    services.AddDbContext&amp;lt;GalaxyExplorerDbContext&amp;gt;(options =&amp;gt;
    {
        // SQL Server baz alınacak ve appsettings.json'dan GalaxyDbConnStr ile belirtilen bağlantı bilgisi kullanılacak.
        options.UseSqlServer(Configuration.GetConnectionString("GalaxyDbConnStr"), b =&amp;gt; b.MigrationsAssembly("GalaxyExplorer.API"));
    });
    services.AddControllers();
    services.AddSwaggerGen(c =&amp;gt;
    {
        c.SwaggerDoc("v1", new OpenApiInfo { Title = "GalaxyExplorer.API", Version = "v1" });
    });
}&lt;/pre&gt;
&lt;p&gt;Bu senaryo &amp;ouml;zelinde makinelerimizde de hazır olması sebebiyle Local SQL Server&amp;rsquo;ı kullanmayı tercih edebiliriz. Gerekli ConnectionString bilgisini AppSettings.json dosyasına aşağıdaki gibi eklemek gerekir &amp;mdash;&amp;nbsp;&lt;em class="ik"&gt;Sınıfı katılımcı sayısına g&amp;ouml;re gruplara b&amp;ouml;l&amp;uuml;p farklı veritabanı ile &amp;ccedil;alışmalarını da sağlatabiliriz. Postgresql&amp;rsquo;in Docker Container kullanan bir versiyonu ideal &amp;ccedil;&amp;ouml;z&amp;uuml;m olabilir.&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;"ConnectionStrings": {
      "GalaxyDbConnStr": "Data Source=(localdb)\\MSSQLLocalDB;Initial Catalog=GalaxyExplorer;Integrated Security=True"
    }&lt;/pre&gt;
&lt;p&gt;Ardından projeye MissionController isimli bir Controller sınıfını ekleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using GalaxyExplorer.DTO;
using GalaxyExplorer.Service;
using Microsoft.AspNetCore.Mvc;
using System.Threading.Tasks;

namespace GalaxyExplorer.API.Controller
{
    [Route("api/[controller]")]
    [ApiController]
    public class MissionController : ControllerBase
    {
        // DI Container'a kayıtlı IMissionService uyarlaması kimse o gelecek
        private readonly IMissionService _missionService;
        public MissionController(IMissionService missionService)
        {
            _missionService = missionService;
        }
        [HttpPost]
        public async Task&amp;lt;IActionResult&amp;gt; StartAsync([FromBody] MissionStartRequest request) // JSON Body'den request nesnesini alsın
        {
            if (!ModelState.IsValid)
                return BadRequest(); // Model validasyon kurallarında ihlal olursa

            // Servis metodunu &amp;ccedil;ağıralım
            var startResult = await _missionService.StartMissionAsync(request);
            if (startResult.Success) // Sonu&amp;ccedil; başarılı ise HTTP OK
                return Ok(startResult.Message);
            else
                return BadRequest(startResult.Message); // Değilse HTTP Bad Request
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Controller sınıfının IMissionService implementasyonunu kullanabilmesi i&amp;ccedil;in Startup dosyasında yer alan DI servislerine gerekli bildirimi yapmayı da ihmal etmemek lazım. &amp;mdash;&lt;em class="ik"&gt;&amp;nbsp;Kullanılan Constructor Injection tekniğine g&amp;ouml;re bu Controller&amp;rsquo;a talep geldiğinde hazır edilecek bileşenin nerede bildirilmesi gerektiğini &amp;ouml;nce sınıfa soralım, sonrasında biz g&amp;ouml;sterelim.&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;services.AddTransient&amp;lt;IMissionService, MissionService&amp;gt;();&lt;/pre&gt;
&lt;p&gt;Artık bir şeyleri elle tutulur şekilde g&amp;ouml;sterebilmek de gerekiyor. Bunun i&amp;ccedil;in veri tabanının oluşması lazım. Dolayısıyla mevzu Migration. Migration işlemleri i&amp;ccedil;in dotnet ef aracını kullanabiliriz ancak &amp;ouml;ğrencilerin sisteminde bu kurulu olmayabilir. Bu gibi durumlarda sorun yaşamamak ve &amp;ouml;ğrenciyi kaybetmemek adında &amp;ldquo;Eğitime Gelmeden &amp;ouml;nce Makinenizde Yapmanız Gerekenler&amp;rdquo; tadında basit bir kılavuz hazırlayıp paylaşmak iyi olabilir. Biz aşağıdaki gibi ilerleyerek devam edelim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# Tool kurulumu i&amp;ccedil;in
dotnet tool install --global dotnet-ef
# tool'u g&amp;uuml;ncellemek i&amp;ccedil;in
dotnet tool update --global dotnet-ef
# tool'u projede kullanmak i&amp;ccedil;in
dotnet add package Microsoft.EntityFrameworkCore.Design
# kurulduğunu g&amp;ouml;rmek i&amp;ccedil;in
dotnet ef

# Aşağıdaki komutları Web API projesi i&amp;ccedil;inde &amp;ccedil;alıştırdım.
dotnet ef migrations add Initial -o Db/Migrations
dotnet ef database update&lt;/pre&gt;
&lt;p&gt;&lt;em class="ik"&gt;Tam bu noktada SQL tarafına ge&amp;ccedil;ip bir veri tabanı oluştuğundan ve hatta Spaceship tablosuna &amp;ouml;rnek verilerin dolduğundan emin olmak lazım. Diğer yandan Local SQL yerine Docker&amp;rsquo;dan yararlanarak pop&amp;uuml;ler bir başka veritabanını basit&amp;ccedil;e kullanabileceğimizi de belirtmemiz &amp;ouml;nemli.&amp;nbsp;&lt;/em&gt;&lt;a class="bv it" href="https://github.com/buraksenyurt/studious-adventure" rel="noopener nofollow"&gt;&lt;em class="ik"&gt;Şuradaki gibi diyerek referans da g&amp;ouml;sterebiliriz&lt;/em&gt;&lt;/a&gt;&lt;em class="ik"&gt;.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong class="ho cu"&gt;6 &amp;mdash; &amp;ouml;nc&amp;uuml; Testler&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Artık testlere başlanabilir. Ş&amp;uuml;k&amp;uuml;r ki Swagger gibi yapılar artık proje şablonlarına entegre edilmiş şekilde geliyorlar. Dolayısıyla &amp;ouml;rneğimizde Web API&amp;rsquo;yi doğrudan &amp;ccedil;alıştırınca aşağıdaki şık aray&amp;uuml;zle karşılaşmamız gerekir. Dolayısıyla ilk testleri yapmak olduk&amp;ccedil;a kolay olur. Eskiden buralar dutluktu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/assets_02.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;ouml;rnek bir JSON i&amp;ccedil;eriğini aşağıdaki gibi uygulayabiliriz.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;{
  "name": "Ufuk &amp;ouml;tesi Macerası",
  "plannedDuration": 18,
  "voyagers": [
    {
      "name": "Kaptan Tupolev",
      "grade": "Y&amp;uuml;zbaşı"
    },
    {
      "name": "Melani Garbo",
      "grade": "Bilim Subayı"
    },
    {
      "name": "Dursun Durmaz",
      "grade": "Seyr&amp;uuml;seferci"
    }
  ]
}&lt;/pre&gt;
&lt;p&gt;Gerekirse diye bir Curl komutu da verebiliriz &amp;mdash;&amp;nbsp;&lt;em class="ik"&gt;Her platformu d&amp;uuml;ş&amp;uuml;nmemiz lazım.&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;curl -X POST "https://localhost:44306/api/Mission" -H  "accept: */*" -H  "Content-Type: application/json" -d "{\"name\":\"Ufuk &amp;ouml;tesi Macerası\",\"plannedDuration\":18,\"voyagers\":[{\"name\":\"Kaptan Tupolev\",\"grade\":\"Y&amp;uuml;zbaşı\"},{\"name\":\"Melani Garbo\",\"grade\":\"Bilim Subayı\"},{\"name\":\"Dursun Durmaz\",\"grade\":\"Seyr&amp;uuml;seferci\"}]}"&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rnek JSON talebi sonrası elde edilen sonu&amp;ccedil;lar da istediğimiz gibi olmalıdır&lt;em&gt;&amp;mdash;&amp;nbsp;&amp;ouml;ğrencilerin elde ettiği sonu&amp;ccedil;ları da g&amp;ouml;zlemlemek gerekir.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;img src="/image.axd?picture=/2021/Mayis/assets_03.png" alt="" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Doğrulama ifadelerinin işe yarayıp yaramadığını g&amp;ouml;rmek i&amp;ccedil;inse aşağıdaki gibi bir JSON talebi kullandırabiliriz. M&amp;uuml;mk&amp;uuml;n mertebe her t&amp;uuml;r testi g&amp;ouml;stermemiz yararlı olabilir.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;{
  "name": " ",
  "plannedDuration": 10,
  "voyagers": [
    {
      "name": "The Choosen One",
      "grade": "Hacker"
    }
  ]
}&lt;/pre&gt;
&lt;p&gt;Buna g&amp;ouml;re ş&amp;ouml;yle bir &amp;ccedil;ıktı elde etmemiz gerekir. İşler yolunda gitmekte.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/assets_04.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em class="ik"&gt;Bu andan itibaren başka ne gibi fonksiyonelliklere ihtiyacımız olabilir diye tartışmaya a&amp;ccedil;mak lazım. D&amp;uuml;ş&amp;uuml;n&amp;uuml;len yeni fonksiyonellikleri &amp;ouml;ğrencilerin uygulaması istenebilir. &amp;ouml;nc&amp;uuml; olması a&amp;ccedil;ısından da &amp;ldquo;Ek Geliştirmeler&amp;rdquo; başlığı altındaki adımlar paylaştırılabilir.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong class="ho cu"&gt;7 &amp;mdash; Ek Geliştirmeler&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Temel senaryo aslında tamam ancak&amp;hellip;&lt;/p&gt;
&lt;p&gt;Gezginler zaman i&amp;ccedil;erisinde sayıca artacaktır. Genelde bu tip senaryolarda HTTP Get ile &amp;ccedil;ağırılan fonksiyonlar t&amp;uuml;m listeyi d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. En azından basite ka&amp;ccedil;tığımız senaryolarda b&amp;ouml;yledir. Ancak satır sayısı fazla ise servisten her şeyi d&amp;ouml;nd&amp;uuml;rmek iyi bir pratik olmayabilir. Bunun yerine kriter bazlı veri d&amp;ouml;nd&amp;uuml;rmek daha iyi olur. &amp;ouml;rneğin aktif g&amp;ouml;revde olan veya olmayanların listesini &amp;ccedil;ekmek. Bu bile fazla sayıda satır d&amp;ouml;nmesine sebebiyet verebilir. Ağ trafiği ve servislerin cevap verebilirlik s&amp;uuml;releri her zaman kritiktir. Şimdi olmasa bile kullanıcı sayısı arttığında &amp;ouml;nem arz edecektir. Dolayısıyla sayfalama kriteri eklemek iyi bir &amp;ccedil;&amp;ouml;z&amp;uuml;m olabilir. Bu sebeple Response ve Request i&amp;ccedil;in bazı DTO tiplerini aşağıdaki gibi tasarlayabiliriz. &amp;mdash;&lt;em class="ik"&gt;&amp;nbsp;Ger&amp;ccedil;ek hayat senaryolarından dem vurarak bazı &amp;ouml;ğ&amp;uuml;tlerde bulunmamız olduk&amp;ccedil;a elzem.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Controller tipinin ilgili metoduna gelecek talep i&amp;ccedil;in aşağıdaki sınıfı tasarlayarak devam edelim. Ka&amp;ccedil;ıncı sayfadan itibaren ka&amp;ccedil; satır alınacağını belirttiğimiz basit bir kurgu var. Ek olarak g&amp;ouml;revde olup olmama durumunu taşıdığımız boolean bir &amp;ouml;zellik bulunuyor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ComponentModel.DataAnnotations;

namespace GalaxyExplorer.DTO
{
    public class GetVoyagersRequest
    {
        [Required]
        public int PageNumber { get; set; }
        [Required]
        [Range(5,20)] // Sayfa başına minimum 5 maksimum 20 satır kabul edelim
        public int PageSize { get; set; }
        public bool OnMission { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;API metodunun d&amp;ouml;n&amp;uuml;ş&amp;uuml;n&amp;uuml; ise aşağıdaki gibi geliştirelim. Toplam gezgin sayısı, aktif g&amp;ouml;revdeki gezgin sayısı, istenen sayfa listesi ve sonraki sayfaya ge&amp;ccedil;iş i&amp;ccedil;in yardımcı bağlantı bilgisini d&amp;ouml;nd&amp;uuml;rmeyi d&amp;uuml;ş&amp;uuml;nebiliriz. Sayfalama yapılan servislerde &amp;ouml;nceki ve sonraki b&amp;ouml;l&amp;uuml;mlere ge&amp;ccedil;işi kolaylaştıran referans linkleri paylaşmak standart bir pratiktir. &amp;mdash;&amp;nbsp;&lt;em class="ik"&gt;&amp;ouml;nceki sayfa linkinin eklenmesi, gidilecek sayfa kalmaması halinde alınması gereken &amp;ouml;nlem veya yapılması gereken işin ne olduğu &amp;ouml;ğrencilere g&amp;ouml;rev olarak verilebilir.&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic;

namespace GalaxyExplorer.DTO
{
    public class GetVoyagersResponse
    {
        public int TotalVoyagers { get; set; }
        public int TotalActiveVoyagers { get; set; }
        public List&amp;lt;VoyagerResponse&amp;gt; Voyagers { get; set; }
        public string NextPage { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu response tipinde kullanılan liste elemanını ise aşağıdaki gibi ekleyelim. Gezginin adı ve r&amp;uuml;tbesi dışında hakkında detaylı bilgi almak i&amp;ccedil;in Detail isimli bir &amp;ouml;zellik de bulunmakta.&lt;em class="ik"&gt; &amp;mdash;&amp;nbsp;&lt;em class="ik"&gt;Detay kısmında b&amp;uuml;y&amp;uuml;k ihtimalle ID kullanılması gerekecektir. Bunu s&amp;ouml;ylemeden Detail kısmını nasıl oluşturmamız gerektiği &amp;ouml;ğrenciler ile karşılıklı olarak tartışılabilinir.&lt;/em&gt;&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace GalaxyExplorer.DTO
{
    public class VoyagerResponse
    {
        public string Name { get; set; }
        public string Grade { get; set; }
        public string Detail { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Sonrasında Servis aray&amp;uuml;z&amp;uuml;ne yeni fonksiyon bildirimini eklememiz gerekir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Task&amp;lt;GetVoyagersResponse&amp;gt; GetVoyagers(GetVoyagersRequest request);&lt;/pre&gt;
&lt;p&gt;Pek tabii eklenen yeni operasyonun MissionService &amp;uuml;zerinde uygulanması gerekir. Bunu aşağıdaki şekilde yapabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public async Task&amp;lt;GetVoyagersResponse&amp;gt; GetVoyagers(GetVoyagersRequest request)
{
    var currentStartRow = (request.PageNumber - 1) * request.PageSize;
    var response = new GetVoyagersResponse
    {
        // Kolaylık olsun diye sonraki sayfa i&amp;ccedil;in de bir link bıraktım
        // Lakin başka kayıt yoksa birinci sayfaya da d&amp;ouml;nd&amp;uuml;rebiliriz
        NextPage = $"api/voyager?PageNumber={request.PageNumber + 1}&amp;amp;PageSize={request.PageSize}&amp;amp;OnMission={request.OnMission}", 
        TotalVoyagers = await _dbContext.Voyagers.CountAsync(),
        TotalActiveVoyagers = await _dbContext.Voyagers.CountAsync(v =&amp;gt; v.OnMission == true)
    };

    var voyagers = await _dbContext.Voyagers
        .Where(v =&amp;gt; v.OnMission == request.OnMission)
        .Skip(currentStartRow)
        .Take(request.PageSize)
        .Select(v =&amp;gt; new VoyagerResponse
        {
            Name = v.Name,
            Grade = v.Grade,
            Detail = $"api/voyager/{v.VoyagerId}" // Bu Voyager'ın detaylarını g&amp;ouml;rmek i&amp;ccedil;in bir sayfaya gitmek isterse diye
        })
        .ToListAsync();
    response.Voyagers = voyagers;

    return response;
}&lt;/pre&gt;
&lt;p&gt;Bu yeni fonksiyonu kullanabilmek i&amp;ccedil;in Controller tarafına da m&amp;uuml;dahale etmek gerekir. Voyager ile ilgili bir işlem s&amp;ouml;z konusu olduğundan VoyagerController isimli yeni bir Controller tipi eklemek &amp;ccedil;ok daha doğrudur.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using GalaxyExplorer.DTO;
using GalaxyExplorer.Service;
using Microsoft.AspNetCore.Mvc;
using System.Threading.Tasks;

namespace GalaxyExplorer.API.Controller
{
    [Route("api/[controller]")]
    [ApiController]
    public class VoyagerController : ControllerBase
    {
        // DI Container'a kayıtlı IMissionService uyarlaması kimse o gelecek
        private readonly IMissionService _missionService;
        public VoyagerController(IMissionService missionService)
        {
            _missionService = missionService;
        }
        [HttpGet]
        public async Task&amp;lt;IActionResult&amp;gt; GetVoyagers([FromQuery] GetVoyagersRequest request) // Parametreleri QueryString &amp;uuml;zerinden almayı tercih ettim
        {
            var voyagers = await _missionService.GetVoyagers(request);
            return Ok(voyagers);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;em class="ik"&gt;Burada biraz durup tartışma başlatmak da gerekiyor. İdeal bir Controller dağılımı s&amp;ouml;z konusu gibi. Voyager ile ilgili operasyonları VoyagerController, Mission ile ilgili operasyonları MissionController &amp;uuml;stleniyor. A&amp;ccedil;ıkta bıraktığımız nokta her ikisinin IMissionService t&amp;uuml;revli bileşenleri kullanması. İdeal bir tasarımda IVoyagerService de s&amp;ouml;z konusu olmalıdır. Lakin bunun bir soru olarak gelmesini beklemeliyiz. Gelmezse &amp;ldquo;Sizce ideal bir tasarım oldu mu?&amp;rdquo; şeklinde sorup &amp;ouml;ğrencileri bu noktaya &amp;ccedil;ekmeliyiz.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Uygulamayı tekrar &amp;ccedil;alıştırıp başka g&amp;ouml;revler de başlattıktan sonra Get metodunu yine Swagger arabirimi &amp;uuml;zerinden test etmemiz gerekir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/assets_05.png" alt="" /&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# curl ile test etmek isterseniz
curl -X GET "https://localhost:44306/api/Voyager?PageNumber=1&amp;amp;PageSize=5&amp;amp;OnMission=true" -H  "accept: */*&lt;/pre&gt;
&lt;p&gt;Aşağıdakine benzer bir &amp;ccedil;ıktı alabilmeliyiz.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;{
  "totalVoyagers": 14,
  "totalActiveVoyagers": 11,
  "voyagers": [
    {
      "name": "Kaptan Tupolev",
      "grade": "Y&amp;uuml;zbaşı",
      "detail": "api/voyager/1"
    },
    {
      "name": "Melani Garbo",
      "grade": "Bilim Subayı",
      "detail": "api/voyager/2"
    },
    {
      "name": "Di Ays Men",
      "grade": "İkinci Pilot",
      "detail": "api/voyager/4"
    },
    {
      "name": "Healseying",
      "grade": "Sağlık Subayı",
      "detail": "api/voyager/6"
    },
    {
      "name": "Kaptan Fasma",
      "grade": "Tugay Komutanı",
      "detail": "api/voyager/7"
    }
  ],
  "nextPage": "api/voyager?PageNumber=2&amp;amp;PageSize=5&amp;amp;OnMission=True"
}&lt;/pre&gt;
&lt;p&gt;Tabi sonraki sayfayı da nextPage ile gelen url bilgisini kullanarak denememiz lazım ki işe yarayıp yaramadığını g&amp;ouml;relim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/assets_06.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em class="ik"&gt;Buraya kadar &amp;ouml;ğrenciler başarılı bir şekilde gelebiliyse harika! Eğlenceli sayılabilecek ama a&amp;ccedil;ık noktaları da olan bir senaryo &amp;uuml;st&amp;uuml;nden iki temel fonksiyon kullanmış olduk. Biraz Dependency Injection, biraz Entity Framework, biraz LINQ, biraz asenkron operasyon kullanımı, biraz migration işleri, biraz Swagger farkındalığı vs&amp;hellip; Bu kazanımları &amp;ldquo;Aklınızda neler kaldı?&amp;rdquo; diyerek &amp;ouml;ğrencilere anlattırmak gerekiyor. Sorular da alındıktan sonra onlara bazı &amp;ouml;devler vermek şart.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong class="ho cu"&gt;&amp;ouml;ğrenciye Neler Yaptırılabilir?&lt;/strong&gt;&lt;/p&gt;
&lt;ul class=""&gt;
&lt;li&gt;Voyager listesinden herbir gezginin şu ana kadar katıldığı toplam g&amp;ouml;rev sayısını d&amp;ouml;nd&amp;uuml;rebiliriz.&lt;/li&gt;
&lt;li&gt;Voyager listesinden d&amp;ouml;nen Detail &amp;ouml;zelliğinin karşılığı olan Controller metodunu tamamlayabiliriz.&lt;/li&gt;
&lt;li&gt;Aktif g&amp;ouml;revler ve bu g&amp;ouml;revlerdeki gezginlerin listesini d&amp;ouml;nd&amp;uuml;recek bir fonksiyon ekletebiliriz.&lt;/li&gt;
&lt;li&gt;VoyagerController i&amp;ccedil;in MissionService yerine başka bir soyutlama yaptırabiliriz&amp;nbsp;&lt;em class="ik"&gt;(IVoyagerService ve VoyagerService gibi)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Tamamlanan g&amp;ouml;revle ilgili g&amp;uuml;ncellemeri yapacak bir PUT fonksiyonu dahil ettirilebiliriz. Bu, ilgili g&amp;ouml;revin durumunu tamamlandıya &amp;ccedil;ekip, g&amp;ouml;reve katılan m&amp;uuml;rettebatı yeni g&amp;ouml;rev almaya uygun olarak işaretleyen bir fonksiyon olabilir. Eksik Entity alanları varsa onların fark edilmesi ve yeni bir Migration planı hazırlanıp &amp;ccedil;alıştırılmasını isteyebiliriz.&lt;/li&gt;
&lt;li&gt;ve &amp;ouml;ğrencilerin aklına gelen diğer ekler.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &amp;ccedil;ok sık yazılan, anlatılan, &amp;ouml;ğretilen bir konu i&amp;ccedil;in hazırlık yapmak &amp;ouml;nemli bir efor ve &amp;ccedil;aba gerektiriyor. &amp;uuml;stelik varılan sonu&amp;ccedil;ların tutarlı olması ve ortak stadartlar &amp;uuml;zerinde durması da &amp;ouml;nemli.&lt;/p&gt;
&lt;p&gt;Faydalı olması ve ilham vermesi dileğiyle&amp;hellip;&lt;/p&gt;
&lt;p&gt;&lt;em class="ik"&gt;&amp;nbsp;&lt;/em&gt;&lt;/p&gt;</content>
  <pubDate>2021-05-14 18:22:00</pubDate>
  <slug>effective-engine-bir-uzay-macerasi</slug>
  <tags>
    <tag>web-api</tag>
    <tag>aspnet-web-api</tag>
    <tag>net-5</tag>
    <tag>swagger</tag>
    <tag>entity-framework-core</tag>
    <tag>c#</tag>
    <tag>programlama</tag>
    <tag>eğitimcinin-eğitimi</tag>
    <tag>eğitim-teknolojileri</tag>
  </tags>
  <categories>
    <category>Asp.Net Web API</category>
  </categories>
</post>