<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>TFS OData Desteği</title>
  <description>Özellikle ALM(Application Lifecycle Management) gibi geniş konuların uygulandığı ürünlerin değerlendirildiği firmalar ve kalabalık ekipleri düşünüldüğünde, bu heterojenlik kendini iyiden iyiye hissettir. Dolayısıyla ürünün geliştiriciler açısından ne kadar ve nasıl genişletilebileceği önem kazanır...</description>
  <content>&lt;p&gt;&lt;span style="color: #ff0000;"&gt;&lt;a href="/pics/almworld.jpg"&gt;&lt;img style="float: right; margin: 4px 0px; display: inline;" title="almworld" src="/pics/almworld_thumb.jpg" alt="almworld" width="300" height="231" align="right" /&gt;&lt;/a&gt;[Orjinal Yazım Tarihi 3/20/2013]&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;oğu zaman geliştirilen yazılım &amp;uuml;r&amp;uuml;nleri ile farklı profilden insanları ortak bir payda da buluşturmayı hedefleriz. Farklı &amp;ouml;zelliklere sahip insanları, &amp;uuml;r&amp;uuml;ne nasıl katabileceğimizi keşfetmeye &amp;ccedil;alışırız. Tabi geliştirilen &amp;uuml;r&amp;uuml;n&amp;uuml;n hedef kitlesi de burada &amp;ouml;nemli bir rol oynar.&lt;/p&gt;
&lt;p&gt;Bazı &amp;uuml;r&amp;uuml;nlerin aray&amp;uuml;zlerinin son derece basit tasarlanması yeterli iken bazılarında ise tam tersi bir durum s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;Hangisi olursa olsun kullanıcı bir insan olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde &amp;ccedil;ok da fazla zorlanmamalı veya kolayca adapte olabilmelidir. Ne kadar kolay kullanılırsa, hedef kitle i&amp;ccedil;erisinde o kadar fazla sayıda farklı profile de ulaşılabilinir. Ancak bazı hallerde &amp;uuml;r&amp;uuml;n&amp;uuml;n hedef kitlesi o kadar dağınıktır ki, hepsini &amp;ccedil;ekebilmek ya da bir başka deyişle kazanabilmek i&amp;ccedil;in yapılan genişletmeler yeterli gelmeyebilir. B&amp;ouml;yle bir durumda &amp;ccedil;evreye şu mesajı vermeniz gerekebilir;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Ey ahali&amp;hellip;Bu g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z, &amp;uuml;r&amp;uuml;n&amp;uuml;m&amp;uuml;z&amp;uuml;n dışarıya a&amp;ccedil;ılmış olan servisi/servisleri/sdk&amp;rsquo;sı/api&amp;rsquo;si. Buyrun istediğiniz gibi uyarlayın, kullanın. Sonu&amp;ccedil;ta &amp;uuml;r&amp;uuml;n&amp;uuml;m&amp;uuml;z&amp;uuml;n yaşamının bir par&amp;ccedil;ası olabileceksiniz &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_195.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;Ouml;zellikle &lt;strong&gt;ALM&lt;em&gt;(Application Lifecycle Management)&lt;/em&gt;&lt;/strong&gt; gibi geniş konuların uygulandığı &amp;uuml;r&amp;uuml;nlerin değerlendirildiği firmalar ve kalabalık ekipleri d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde, bu heterojenlik kendini iyiden iyiye hissettir. Dolayısıyla &amp;uuml;r&amp;uuml;n&amp;uuml;n geliştiriciler a&amp;ccedil;ısından ne kadar ve nasıl &lt;strong&gt;genişletilebileceği &lt;/strong&gt;&amp;ouml;nem kazanır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Ekipleriniz i&amp;ccedil;indeki profilleri d&amp;uuml;ş&amp;uuml;n&amp;uuml;n! Yazılımcılar IDE&amp;rsquo; leri, iş analistleri Word dok&amp;uuml;manlarını, M&amp;uuml;d&amp;uuml;r&amp;rsquo; ler web browser &amp;uuml;zerinden erişilebilen raporları, Release Manager&amp;rsquo; lar Team Explorer&amp;rsquo; ı, Proje Y&amp;ouml;neticileri Ms Project&amp;rsquo; i, CIO&amp;rsquo; lar ise &amp;uuml;r&amp;uuml;nlerinin hangi sprint&amp;rsquo; ler de olup ne kadarlık işlerinin kaldığını okuyabildikleri e-postaları, sever. Listeyi uzatmak m&amp;uuml;mk&amp;uuml;n &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_195.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bu felsefeden baktığımızda bence &lt;strong&gt;Microsoft&lt;/strong&gt;&amp;rsquo; un &lt;strong&gt;Team Foundation Server&lt;/strong&gt; &amp;uuml;r&amp;uuml;n&amp;uuml; epey &amp;ouml;nemli bir noktada yer alıyor. Hatta &lt;strong&gt;Gartner&lt;/strong&gt;&amp;rsquo; ın &lt;strong&gt;Application Lifecycle Management&lt;/strong&gt; konusundaki bi raprunda yer alan &lt;strong&gt;Magic&lt;/strong&gt; &lt;strong&gt;Quadrant&lt;/strong&gt; grafiği de, bunu doğrular nitelikte. Kabiliyet ve sunulan vizyon a&amp;ccedil;ısından &lt;strong&gt;Microsoft&lt;/strong&gt; liderler arasında en iyi noktada yer alıyor diyebiliriz &lt;em&gt;(Rapor hakkında detaylı bilgiye &lt;a href="http://www.gartner.com/technology/reprints.do?id=1-1ASCXON&amp;amp;ct=120606&amp;amp;st=sb" target="_blank"&gt;bu adresten&lt;/a&gt; ulaşabilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/odatatfs_15.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="odatatfs_15" src="/pics/odatatfs_15_thumb.png" alt="odatatfs_15" width="400" height="436" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;h1&gt;Peki &lt;strong&gt;TFS&lt;/strong&gt; takımı bunu nasıl başarıyor?&lt;/h1&gt;
&lt;p&gt;Bildiğiniz &amp;uuml;zere&lt;strong&gt; Team Foundation Server&lt;/strong&gt; ailesi i&amp;ccedil;erisinde, &lt;strong&gt;.Net&lt;/strong&gt; tabanlı kullanılabilen &lt;strong&gt;Object&lt;/strong&gt; &lt;strong&gt;Modeller&lt;em&gt;(Client Object Model, Server Object Model, Build Process Object Model)&lt;/em&gt;&lt;/strong&gt;, yabancı &amp;uuml;r&amp;uuml;nlerin entegre olabilmesini sağlayan &lt;strong&gt;Provider&lt;/strong&gt;&amp;rsquo; lar &lt;em&gt;&lt;strong&gt;(MSSCCI Provider ve Team Explorer Everywhere)&lt;/strong&gt;&lt;/em&gt;, servis bazlı entegrasyon i&amp;ccedil;in &lt;strong&gt;XML Web hizmetleri&lt;/strong&gt; var. Ayrıca bilindiği &amp;uuml;zere &lt;strong&gt;TFS&lt;/strong&gt; in &lt;strong&gt;Cloud&lt;/strong&gt; tabanlı &amp;ccedil;alışan bir başka verisyonu daha bulunmakta.&lt;/p&gt;
&lt;h1&gt;Cloud Tabanlı TFS&lt;/h1&gt;
&lt;p&gt;&lt;strong&gt;Team&lt;/strong&gt; &lt;strong&gt;Foundation&lt;/strong&gt; &lt;strong&gt;Server&lt;/strong&gt; bilindiği &amp;uuml;zere bir s&amp;uuml;redir &lt;strong&gt;Cloud Service&lt;/strong&gt; olarak da hizmet vermekte. &lt;strong&gt;5 Windows Live ID&lt;/strong&gt; hesabına kadar &amp;uuml;cretsiz kullanılabilen hizmet, sunucu modelli kurulum sonucu yapılabilen hemen herşeyi karşılamakta. &lt;strong&gt;Scrum, MSF, CMMI&lt;/strong&gt; gibi şablonları doğrudan destekleyen servis, &lt;strong&gt;TFS Web Access&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; ile de olduk&amp;ccedil;a kolay bir kullanıma sahip. &lt;strong&gt;Visual Studio&lt;/strong&gt; ailesine, &lt;strong&gt;Excel&lt;/strong&gt; gibi ofis &amp;uuml;r&amp;uuml;nlerine kolayca bağlanabilmekte. Hatta son zamanlarda &lt;strong&gt;Git&lt;/strong&gt; ile olan entegrasyonu sayesinde, &lt;strong&gt;Git&lt;/strong&gt; fanatiği geliştiricilerin de dikkatini &amp;ccedil;ekmeyi başardı.&lt;/p&gt;
&lt;p&gt;Bir bulut servisi olduğu i&amp;ccedil;in, &lt;strong&gt;TFS&lt;/strong&gt; ortamının kurulumunu d&amp;uuml;ş&amp;uuml;nmemize gerek yok. Sadece abone oluyor veya lisanslı kullanıcı iseniz kira bedelini &amp;ouml;d&amp;uuml;yorsunuz. Kurulumu d&amp;uuml;ş&amp;uuml;nm&amp;uuml;yor olmanız beraberinde &lt;strong&gt;&amp;ouml;l&amp;ccedil;eklenebilirlik&lt;em&gt;(Scalability)&lt;/em&gt;,&lt;/strong&gt; sunucu performansı, donanım alımı, personel istihdamı gibi mevzuları da d&amp;uuml;ş&amp;uuml;nmemize gerek olmadığı anlamına gelmekte.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Pek tabi bazı kurumlar halen daha bulut servislerine temkinli yaklaşmakta ve hatta doğrudan geri &amp;ccedil;evirmekte. &amp;Ouml;rneğin &amp;uuml;lkemizdeki BDDK gibi kurumlar, bankaların bu tip bulut tabanlı yapılar ile &amp;ccedil;alışmalarını ve bilgi alışverişinde bulunmalarını epeyce sorgulamakta ve kolay kolay izin vermemekte.&lt;/p&gt;
&lt;p&gt;A&amp;ccedil;ık&amp;ccedil;ası askeri ve stratejik a&amp;ccedil;ıdan d&amp;uuml;ş&amp;uuml;n&amp;uuml;rsek &amp;uuml;lke ekonomisine ait değerli bilgilerin 3nc&amp;uuml; parti sunucularda, &amp;uuml;lke dışında tutmak &amp;ccedil;ok da doğru değil bana kalırsa.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href="http://tfs.visualstudio.com"&gt;http://tfs.visualstudio.com&lt;/a&gt; adresinden ulaşılabilen hizmete son aylarda eklenen ve halen geliştirilme aşamasında olan &amp;ouml;nemli bir yenilikte &lt;strong&gt;OData&lt;em&gt;(Open Data Protocol)&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;&amp;nbsp;&lt;/em&gt;servis desteği. &lt;strong&gt;XML&lt;em&gt;(eXtensible Markup Language)&lt;/em&gt;&lt;/strong&gt; &amp;uuml;zerine oturan ve &lt;strong&gt;URL&lt;/strong&gt; bazlı sorgulama yetenekleri tanıyan bu protokol, bir d&amp;uuml;nya standardı. Standardın hedefi ise veri odaklı yayınlayıcılar&lt;strong&gt;&lt;em&gt;(Publishers)&lt;/em&gt;&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;Hal b&amp;ouml;yle olunca herhangibir veri kaynağının, &amp;ouml;zellikle internet ortamı &amp;uuml;zerinden &lt;strong&gt;OData&lt;/strong&gt; protokol&amp;uuml;ne g&amp;ouml;re sorgulanabilmesi m&amp;uuml;mk&amp;uuml;n hale geliyor. Bunun tam karşılığı ise, platform bağımsızlıktan başka bir şey değil. Ama bu son derece &amp;ouml;nemli bir yetenek. Nitekim bulut &amp;uuml;zerinde koşan &lt;strong&gt;TFS&lt;/strong&gt; hizmetini kullanabilecek istemcileri her hangi bir platform i&amp;ccedil;in geliştirebileceğimiz anlamına gelmekte.&lt;/p&gt;
&lt;p&gt;&lt;a href="http://www.odata.org/" target="_blank"&gt;OData&lt;/a&gt; protokol&amp;uuml;n&amp;uuml;n &amp;ouml;n g&amp;ouml;rd&amp;uuml;ğ&amp;uuml; veri odaklı sorgular bilindiği &amp;uuml;zere tamamen &lt;strong&gt;URL&lt;/strong&gt; bazlı olarak &amp;ccedil;alışmakta. Bu nedenle bulut &lt;strong&gt;TFS&lt;/strong&gt; servisi &amp;uuml;zerinde duran bilgileri basit bir tarayıcı uygulamayı kullanarak sorgulayabilirsiniz de. Bunun sonucu olarak dilerseniz &lt;strong&gt;TFS&lt;/strong&gt; projenizin bazı raporlarını veya y&amp;ouml;netsel arabirimi &amp;ouml;zelliklerini, &amp;ouml;rneğin mobil cihazınıza kadar indirebilirsiniz. &lt;em&gt;(Bu konu ile ilişkili olarak &lt;/em&gt;&lt;a href="http://blogs.msdn.com/b/nishasingh/archive/2013/01/08/tfs-dashboard-a-sample-windows-8-store-app-for-team-foundation-server.aspx" target="_blank"&gt;&lt;em&gt;Nisha Singh&amp;rsquo; in Windows 8 uygulamasına&lt;/em&gt;&lt;/a&gt;&lt;em&gt; bir g&amp;ouml;z atmanızı &amp;ouml;neririm)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Gelelim bu yazımızdaki konumuza. Hi&amp;ccedil; kod yazmayacak ve geliştirme yapmayacağız aslında &lt;img class="wlEmoticon wlEmoticon-disappointedsmile" style="border-style: none;" src="/pics/wlEmoticon-disappointedsmile_5.png" alt="Disappointed smile" /&gt; Bir tarayıcı uygulama,&lt;strong&gt; tfs.visualstudio.com&lt;/strong&gt; &amp;uuml;zerindeki hesabımız ve &lt;strong&gt;OData&lt;/strong&gt; servislerinden&amp;nbsp; yararlanarak sorgulamalar ger&amp;ccedil;ekleştireceğiz.&lt;/p&gt;
&lt;h1&gt;Seddulbahir&lt;/h1&gt;
&lt;p&gt;Bu ama&amp;ccedil;la ben &lt;strong&gt;seddulbahir.visualstudio.com&lt;/strong&gt; adresinde konuşlandırılmış olan ve sahibi olduğum &lt;strong&gt;Team Project Collection &lt;/strong&gt;alanını kullanıyor olacağım. &lt;strong&gt;OData&lt;/strong&gt; &amp;ouml;rnekleri i&amp;ccedil;in &amp;ccedil;ok basit olarak &lt;strong&gt;SoniK&lt;/strong&gt; isimli uydurmasyon bir &lt;strong&gt;Team&lt;/strong&gt; &lt;strong&gt;Project&lt;/strong&gt; oluşturdum. S&amp;ouml;z konusu proje&lt;strong&gt; Scrum 2.2&lt;/strong&gt; şablonuna g&amp;ouml;re kullanılmakta. Şimdilik tek &amp;uuml;yesi benim ve t&amp;uuml;m &lt;strong&gt;Task&lt;/strong&gt;&amp;rsquo; lar &amp;uuml;zerimde &lt;img class="wlEmoticon wlEmoticon-confusedsmile" style="border-style: none;" src="/pics/wlEmoticon-confusedsmile_30.png" alt="Confused smile" /&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;tfs.visualstudio.com servisinin en g&amp;uuml;zel yanlarından birisi de, son g&amp;uuml;ncellemeleri haberiniz olmasa dahi hızla ve ilk elden implemente ediyor oluşu. S&amp;ouml;z gelimi Scrum&amp;rsquo; ın yeni bir versiyonunun &amp;ccedil;ıktığını fark etmemiş olabilirsiniz. Ama bulut &amp;uuml;zerinde bu g&amp;uuml;ncelleme &amp;ccedil;ıktığı gibi entegre edilmiştir de.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Tabi &lt;strong&gt;OData&lt;/strong&gt; servisleri ile bir &lt;strong&gt;Team Project&amp;rsquo;&lt;/strong&gt; in sorgulanması denince dikkatler hemen &lt;strong&gt;Work Item &lt;/strong&gt;i&amp;ccedil;eriklerine &amp;ccedil;evrilecektir. Yani &lt;strong&gt;Product Backlog Item&lt;/strong&gt;, &lt;strong&gt;Task&lt;/strong&gt;, &lt;strong&gt;Test&lt;/strong&gt; &lt;strong&gt;Case&lt;/strong&gt;, &lt;strong&gt;Bug&lt;/strong&gt;, &lt;strong&gt;Impediment&lt;/strong&gt; gibi &amp;ouml;ğelere&lt;em&gt;(Scrum i&amp;ccedil;in s&amp;ouml;z konusu olan bu Work Item &amp;ccedil;eşitleri, se&amp;ccedil;ilen s&amp;uuml;re&amp;ccedil; şablonuna g&amp;ouml;re elbetteki değişiklik g&amp;ouml;sterebilir) &lt;/em&gt;Bu nedenle &lt;strong&gt;SoniK&lt;/strong&gt; isimli proje i&amp;ccedil;erisine aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan bazı &lt;strong&gt;Work Item&amp;rsquo;&lt;/strong&gt; ları ekledim ve bunları şimdilik, 2 haftalık s&amp;uuml;reye sahip olan &lt;strong&gt;Sprint 1&lt;/strong&gt; i&amp;ccedil;erisinde değerlendirmeye aldım. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;TO DO&lt;/strong&gt;&amp;rsquo; dan &lt;strong&gt;IN PROGRESS&lt;/strong&gt;&amp;rsquo;e aldığım iki &lt;strong&gt;Task&lt;/strong&gt;&amp;rsquo; ım var &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_95.png" alt="Smile" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/odatatfs_2.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="odatatfs_2" src="/pics/odatatfs_2_thumb.png" alt="odatatfs_2" width="640" height="415" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/odatatfs_4.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="odatatfs_4" src="/pics/odatatfs_4_thumb.png" alt="odatatfs_4" width="640" height="311" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Sorgulama işlemine başlamadan &amp;ouml;nce yapılması gereken k&amp;uuml;&amp;ccedil;&amp;uuml;k bir hazırlık daha var. &lt;strong&gt;OData &lt;/strong&gt;servislerini etkinleştirmek i&amp;ccedil;in &lt;strong&gt;TFS&lt;/strong&gt; hesabımızın profil &amp;ouml;zelliklerinden&lt;strong&gt; Enable Aternate Credentials&lt;/strong&gt; se&amp;ccedil;eneğini aktif hale getirmemiz ve bir kullanıcı adı ile şifre belirlememiz gerekiyor.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/odatatfs_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="odatatfs_1" src="/pics/odatatfs_1_thumb.png" alt="odatatfs_1" width="599" height="499" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından &lt;a href="https://tfsodata.visualstudio.com/defaultcollection"&gt;https://tfsodata.visualstudio.com/defaultcollection&lt;/a&gt; adresine girerek başlama vuruşunu yapabiliriz &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_95.png" alt="Smile" /&gt;&amp;nbsp;&lt;strong&gt;domainAdı\kullanıcıAdı &lt;/strong&gt;ve &lt;strong&gt;şifre &lt;/strong&gt;ile giriş yapabiliriz. &amp;Ouml;rneğin benim &lt;strong&gt;TFS&lt;/strong&gt; projem &lt;strong&gt;seddulbahir.visualstudio.com&lt;/strong&gt; olduğundan, &lt;strong&gt;seddulbahir\AlternatifKullanıcıAdı &lt;/strong&gt;ve &lt;strong&gt;şifre &lt;/strong&gt;ile giriş yapmam gerekiyor. &lt;strong&gt;defaultcollection&lt;/strong&gt; adresini sorguladığımızda standart bir &lt;strong&gt;OData&lt;/strong&gt; servisinden beklediğimiz sonu&amp;ccedil;lar ile karşılaşırız. Bize &lt;strong&gt;TFS&lt;/strong&gt; hizmeti i&amp;ccedil;in sorgulanabilir olan &lt;strong&gt;Entity&lt;/strong&gt; adlarının adreslerini i&amp;ccedil;eren bir sayfa &amp;uuml;retilecektir. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki gibi.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/odatatfs_3.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="odatatfs_3" src="/pics/odatatfs_3_thumb.png" alt="odatatfs_3" width="595" height="667" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere kullanıcılardan &lt;strong&gt;Area&lt;/strong&gt;&amp;rsquo; lara, &lt;strong&gt;Work Item&lt;/strong&gt;&amp;rsquo; lardan, &lt;strong&gt;Team Project Collection &lt;/strong&gt;i&amp;ccedil;erisindeki &lt;strong&gt;Team Project&lt;/strong&gt;' lere, &lt;strong&gt;Build &lt;/strong&gt;tanımlamalarından, &lt;strong&gt;Iteration&lt;/strong&gt;&amp;rsquo; lara kadar sorgulanabilecek olduk&amp;ccedil;a geniş bir yelpaze s&amp;ouml;z konusudur. Şimdi dilerseniz &amp;ouml;rnek projemiz i&amp;ccedil;in bir ka&amp;ccedil; &lt;strong&gt;OData &lt;/strong&gt;sorgusu icra edelim ve sonu&amp;ccedil;ları g&amp;ouml;rmeye &amp;ccedil;alışalım.&lt;/p&gt;
&lt;h1&gt;&amp;Ouml;rnek Sorgular&lt;/h1&gt;
&lt;p&gt;Aşağıdaki tabloda sorguya ait &lt;strong&gt;URL&lt;/strong&gt; ifadeleri, bazı kısa a&amp;ccedil;ıklamalar ve &lt;strong&gt;SoniK&lt;/strong&gt; i&amp;ccedil;in &amp;uuml;retilen sonu&amp;ccedil;lara ait ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;leri yer almaktadır.&lt;/p&gt;
&lt;table style="width: 640px;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;strong&gt;Team Project Collection i&amp;ccedil;erisinde yer alan Team Project &amp;ouml;ğelerinin &amp;ccedil;ekilmesi&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;https://tfsodata.visualstudio.com/DefaultCollection/Projects&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;Yukarıdaki sorgu hesabımıza ait Team Project Collection i&amp;ccedil;erisinde ne kadar Team project var ise d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Dikkat &amp;ccedil;ekici &lt;strong&gt;entry&lt;/strong&gt; &amp;ouml;zelliklerinden birisi, belirli bir projeye erişebilmek i&amp;ccedil;in &lt;strong&gt;id&lt;/strong&gt; elementi ile gelen &lt;strong&gt;URL&lt;/strong&gt; değeridir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;a href="/pics/odatatfs_5.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="odatatfs_5" src="/pics/odatatfs_5_thumb.png" alt="odatatfs_5" width="605" height="661" /&gt;&lt;/a&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;strong&gt;Belirli bir Team Project i&amp;ccedil;erisinde tanımlanmış olan Area bilgilerinin &amp;ccedil;ekilmesi&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;https://tfsodata.visualstudio.com/DefaultCollection/Projects('Sonik')/AreaPaths&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;Bir proje i&amp;ccedil;erisinde pek &amp;ccedil;ok &lt;strong&gt;Area&lt;/strong&gt; tanımlanmış olabilir. Genellikle aynı projede birden fazla takımın kendilerine ait &lt;strong&gt;Area&lt;/strong&gt;&amp;rsquo; lar &amp;uuml;zerinde yetkilendirilerek &amp;ccedil;alışması gibi ihtiya&amp;ccedil;larda ideal bir &amp;ccedil;&amp;ouml;z&amp;uuml;md&amp;uuml;r. Sorguda &amp;ouml;nce Projects &amp;uuml;zerinden SoniK&amp;rsquo; e gidilmiş ve &lt;strong&gt;AreaPaths&lt;/strong&gt; alt entity i&amp;ccedil;eriği talep edilmiştir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;a href="/pics/odatatfs_6.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="odatatfs_6" src="/pics/odatatfs_6_thumb.png" alt="odatatfs_6" width="589" height="492" /&gt;&lt;/a&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;strong&gt;Bir Area&amp;rsquo; nın altında yer alan alt Area&amp;rsquo; ların &amp;ccedil;ekilmesi&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;https://tfsodata.visualstudio.com/DefaultCollection/AreaPaths('SoniK%3CDevelopment')/SubAreas&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;Bazı durumlarda bir &lt;strong&gt;Area&lt;/strong&gt; altında birden fazla &lt;strong&gt;Child&lt;/strong&gt; &lt;strong&gt;Area&lt;/strong&gt; a&amp;ccedil;ılmış olabilir. Hatta bu, bir ka&amp;ccedil; seviyelendirme şeklinde yapılmış da olabilir. &amp;Ouml;rnek projede aşağıdaki gibi bir &lt;strong&gt;Area&lt;/strong&gt; yapısı s&amp;ouml;z konusudur ve yukardaki &lt;strong&gt;OData&lt;/strong&gt; sorgusu ile bu i&amp;ccedil;erik &lt;strong&gt;XML &lt;/strong&gt;formatında elde edilebilir. &lt;br /&gt;&lt;a href="/pics/odatatfs_7.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="odatatfs_7" src="/pics/odatatfs_7_thumb.png" alt="odatatfs_7" width="427" height="443" /&gt;&lt;/a&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;a href="/pics/odatatfs_8.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="odatatfs_8" src="/pics/odatatfs_8_thumb.png" alt="odatatfs_8" width="515" height="215" /&gt;&lt;/a&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;strong&gt;Bir Team Project i&amp;ccedil;in s&amp;ouml;z konusu olan Work Item &amp;Ouml;ğelerinin toplam sayısını bulmak&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;https://tfsodata.visualstudio.com/DefaultCollection/Projects('Sonik')/WorkItems/$count&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&amp;Ouml;rneğin &lt;strong&gt;Sonik&lt;/strong&gt; isimli &lt;strong&gt;Team&lt;/strong&gt; &lt;strong&gt;Project&lt;/strong&gt; i&amp;ccedil;erisinde yer alan toplam &lt;strong&gt;work&lt;/strong&gt; &lt;strong&gt;item&lt;/strong&gt; sayısını &lt;strong&gt;count OData&lt;/strong&gt; fonksiyonundan yararlanarak bulabiliriz.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;a href="/pics/odatatfs_9.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="odatatfs_9" src="/pics/odatatfs_9_thumb.png" alt="odatatfs_9" width="405" height="126" /&gt;&lt;/a&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;strong&gt;Belirli bir Id değerine sahip Work Item&amp;rsquo; ın elde edilmesi&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;https://tfsodata.visualstudio.com/DefaultCollection/Projects('Sonik')/WorkItems(3)&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;Bu sorgu ile &lt;strong&gt;3 numaralı ID değerine sahip Work&lt;/strong&gt; &lt;strong&gt;Item&lt;/strong&gt; bilgisi elde edilmektedir. Tabi &amp;ccedil;ok fazla &amp;ouml;zellik olduğundan element sayısı da epeyce fazladır. Azaltmak i&amp;ccedil;in bir sonraki &amp;ouml;rnekte olduğu gibi &lt;strong&gt;projection&lt;/strong&gt; &lt;strong&gt;type&lt;/strong&gt; kullanımı tercih edilebilir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;a href="/pics/odatatfs_10.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="odatatfs_10" src="/pics/odatatfs_10_thumb.png" alt="odatatfs_10" width="592" height="788" /&gt;&lt;/a&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;strong&gt;Work Item&amp;rsquo; lardan ilk 2sinin sadece Title ve Type bilgilerini &amp;ccedil;ekmek&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;https://tfsodata.visualstudio.com/DefaultCollection/Projects('Sonik')/WorkItems?$select=Title,Type&amp;amp;$top=2&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;Burada aslında bir &lt;strong&gt;projection&lt;/strong&gt; kullanımı s&amp;ouml;z konusudur. &lt;strong&gt;select&lt;/strong&gt; anahtar kelimesini takiben, &amp;ccedil;ekilmek istenen &amp;ouml;zelliklerin adları verilmiştir. &lt;strong&gt;top&lt;/strong&gt; anahtar kelimesi ile de ka&amp;ccedil; tane element &amp;ccedil;ekileceği ifade edilir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;a href="/pics/odatatfs_11.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="odatatfs_11" src="/pics/odatatfs_11_thumb.png" alt="odatatfs_11" width="573" height="627" /&gt;&lt;/a&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;strong&gt;Sorgu &amp;ccedil;ıktısını JSON(JavaScript Object Notation) formatında elde etmek&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;https://tfsodata.visualstudio.com/DefaultCollection/Projects('Sonik')/WorkItems?$select=Title,Type&amp;amp;$top=3&amp;amp;$format=json&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&amp;Ccedil;ıktının sadece &lt;strong&gt;XML&lt;/strong&gt; formatında elde edilmesi şart değildir. &amp;Ouml;rneğin daha az yer tutan &lt;strong&gt;JSON&lt;/strong&gt; tipinde bir &amp;ccedil;ıktı &amp;uuml;retilmesi i&amp;ccedil;in &lt;strong&gt;format&lt;/strong&gt; anahtar kelimesinden yararlanılabilir. Yukarıdaki sorguda &lt;strong&gt;Sonik&lt;/strong&gt; projesindeki ilk 3 Work Item&amp;rsquo; ın &lt;strong&gt;Title&lt;/strong&gt; ve &lt;strong&gt;Type&lt;/strong&gt; değerlerini i&amp;ccedil;eren &lt;strong&gt;JSON&lt;/strong&gt; &amp;ccedil;ıktısı talep edilmektedir. Sonu&amp;ccedil; aşağıdaki gibidir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;a href="/pics/odatatfs_12.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="odatatfs_12" src="/pics/odatatfs_12_thumb.png" alt="odatatfs_12" width="584" height="374" /&gt;&lt;/a&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;strong&gt;Bir projedeki belirli bir Work Item tipine ait &amp;ouml;ğeleri &amp;ccedil;ekmek&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;https://tfsodata.visualstudio.com/DefaultCollection/WorkItems?$filter=Project eq 'Sonik' and Type eq 'Test Case'&amp;amp;$select=Project,Type,Title,AreaPath&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&amp;Ouml;rnek sorguda &lt;strong&gt;filter&lt;/strong&gt; ve &lt;strong&gt;select&lt;/strong&gt; anahtar kelimelerinden yararlanılmış olup, &lt;strong&gt;Sonik&lt;/strong&gt; isimli projede yer alan &lt;strong&gt;Test&lt;/strong&gt; &lt;strong&gt;Case&lt;/strong&gt; tipindeki &lt;strong&gt;Work Item&lt;/strong&gt;&amp;rsquo; ların &lt;strong&gt;Project&lt;/strong&gt;, &lt;strong&gt;Type&lt;/strong&gt;, &lt;strong&gt;Title &lt;/strong&gt;ve &lt;strong&gt;AreaPath &lt;/strong&gt;bilgileri talep edilmiştir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;a href="/pics/odatatfs_13.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="odatatfs_13" src="/pics/odatatfs_13_thumb.png" alt="odatatfs_13" width="584" height="435" /&gt;&lt;/a&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;strong&gt;Belirli bir Sprint i&amp;ccedil;indeki Work Item bilgilerinin &amp;ccedil;ekilmesi&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;https://tfsodata.visualstudio.com/DefaultCollection/WorkItems?$filter=Project eq 'Sonik' and Type eq 'Product Backlog Item' and IterationPath eq 'SoniK\Release 1\Sprint 1'&amp;amp;$select=Project,Type,Title,AreaPath,IterationPath&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&amp;Ouml;rnekte &lt;strong&gt;Sprint 1&lt;/strong&gt; i&amp;ccedil;erisine alınmış olan &lt;strong&gt;Product&lt;/strong&gt; &lt;strong&gt;Backlog&lt;/strong&gt; &lt;strong&gt;Item&lt;/strong&gt; &amp;ouml;ğelerinin &lt;strong&gt;Project&lt;/strong&gt;, &lt;strong&gt;Type&lt;/strong&gt;, &lt;strong&gt;Title&lt;/strong&gt;, &lt;strong&gt;AreaPath&lt;/strong&gt;, &lt;strong&gt;IterationPath&lt;/strong&gt; değerleri sorgulanmaktadır. &lt;strong&gt;filter&lt;/strong&gt; anahtar kelimesi ile birden fazla kriterin hesaba katılması noktasında &lt;strong&gt;and&lt;/strong&gt; ve &lt;strong&gt;or&lt;/strong&gt; operat&amp;ouml;rlerinden yararlanılır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="640"&gt;&lt;a href="/pics/odatatfs_14.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="odatatfs_14" src="/pics/odatatfs_14_thumb.png" alt="odatatfs_14" width="551" height="784" /&gt;&lt;/a&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Şu an i&amp;ccedil;in &lt;strong&gt;TFS&lt;/strong&gt; &lt;strong&gt;Odata&lt;/strong&gt; servis sorgularında &lt;strong&gt;filter&lt;/strong&gt;, &lt;strong&gt;count&lt;/strong&gt;, &lt;strong&gt;select&lt;/strong&gt;, &lt;strong&gt;orderby&lt;/strong&gt;, &lt;strong&gt;top&lt;/strong&gt;, &lt;strong&gt;skip&lt;/strong&gt;, &lt;strong&gt;format&lt;/strong&gt; ve &lt;strong&gt;callback&lt;/strong&gt; anahtar kelimeleri kullanılabilmektedir. Ancak bu anahtar kelime seti artabilir. Sorgular sırasında &lt;strong&gt;?&lt;/strong&gt; ve &lt;strong&gt;$&lt;/strong&gt; harflerine de dikkat edilmelidir. T&amp;uuml;m &lt;strong&gt;OData&lt;/strong&gt; komutlarının &amp;ouml;n&amp;uuml;nde dikkat edileceği &amp;uuml;zere &lt;strong&gt;$&lt;/strong&gt; harfi yer almaktadır. Her ne kadar &amp;ouml;rneklerde ağırlıklı olarak &lt;strong&gt;Work Item&lt;/strong&gt;&amp;rsquo; lar &amp;uuml;zerinde durulmuş olsa da &lt;strong&gt;DefaultCollection&lt;/strong&gt; altında sunulan &lt;strong&gt;Entity&lt;/strong&gt;&amp;rsquo; lerin &amp;ccedil;oğu &amp;uuml;zerinde sorgulamalar yapılabilir. Bunu denemenizi &amp;ouml;neririm &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_195.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere s&amp;ouml;z konusu &lt;strong&gt;OData&lt;/strong&gt; sorgularını kullanarak farklı platformlar &amp;uuml;zerinde &amp;ccedil;alışacak istemci uygulamaların geliştirilmesinin &amp;ouml;n&amp;uuml; son derece a&amp;ccedil;ıktır. Şu anda halen geliştirilmekte olan &lt;a href="https://tfsodata.visualstudio.com/" target="_blank"&gt;TFS OData servislerinin kullanımına ilişkin detaylı bilgileri bu adresten takip edebilirsiniz&lt;/a&gt;. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;span style="color: #ff0000;"&gt;[Orjinal Yazım Tarihi 3/20/2013]&lt;/span&gt;&lt;/p&gt;</content>
  <pubDate>2013-08-25 10:35:00</pubDate>
  <slug>TFS-OData-Destegi</slug>
  <tags>
    <tag>tfs</tag>
    <tag>team-foundation-server</tag>
    <tag>tfs-2012</tag>
    <tag>odata</tag>
    <tag>odata-services</tag>
    <tag>open-data-protocol</tag>
    <tag>xml</tag>
    <tag>http-get</tag>
    <tag>tfsvisualstudiocom</tag>
    <tag>filter</tag>
    <tag>count</tag>
    <tag>select</tag>
    <tag>orderby</tag>
    <tag>top</tag>
    <tag>skip</tag>
    <tag>format</tag>
    <tag>json</tag>
    <tag>java-script-object-notation</tag>
    <tag>callback</tag>
    <tag>default-collection</tag>
    <tag>team-project</tag>
    <tag>team-project-collection</tag>
  </tags>
  <categories>
    <category>Team Foundation Server</category>
  </categories>
</post>