<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Oyun Programlamaya Giriş (Matrisler Yardımıyla Çarpışma Kontrolü)</title>
  <description>Hafta sonu evde bilgisayarım başında internette gezinirken, tarihi oyunların anlatıldığı bir site ile karşılaştım. Aslında zaten eski oyunları araştırıyordum. Amacım bu oyunlara, oyun oynamak isteyen bir çocuk gözü ile değil, onların yapılarını ve çekirdeklerini anlamaya çalışacak bir yazılımcı gözüyle bakabilmekti. Sonuçta, içimdeki çocuk ağır basıp bir kaç tanesini saatlerce oynadım.  Aralarında en çok hoşuma gidenlerden birisi PackMan' di. Packman, doğrusal düzlemde 4 yöne hareket edebilen bir kahramandı. Yolda kendisini rastgele konumlardan gelerek yakalamaya çalışan böceklerden kaçıyor ve bulduğu meyveleri yiyerekte puanlar topluyordu. Tam oyunu bitirmeme az kalmıştıki hiç beklenmedik bir şekilde böceklerden birisi tarafından yendim. Aslında ekrana bir süre donuk gözler ile bakmıştım. Nitekim, oyunu oynarken aklıma geçen gün okuduğum Oyun Programlama kitabı gelmişti.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Hafta sonu evde bilgisayarım başında internette gezinirken, tarihi oyunların anlatıldığı bir site ile karşılaştım. Aslında zaten eski oyunları araştırıyordum. Amacım bu oyunlara, oyun oynamak isteyen bir &amp;ccedil;ocuk g&amp;ouml;z&amp;uuml; ile değil, onların yapılarını ve &amp;ccedil;ekirdeklerini anlamaya &amp;ccedil;alışacak bir yazılımcı g&amp;ouml;z&amp;uuml;yle bakabilmekti. Sonu&amp;ccedil;ta, i&amp;ccedil;imdeki &amp;ccedil;ocuk ağır basıp bir ka&amp;ccedil; tanesini saatlerce oynadım.&amp;nbsp; Aralarında en &amp;ccedil;ok hoşuma gidenlerden birisi PackMan' di. Packman, doğrusal d&amp;uuml;zlemde 4 y&amp;ouml;ne hareket edebilen bir kahramandı. Yolda kendisini rastgele konumlardan gelerek yakalamaya &amp;ccedil;alışan b&amp;ouml;ceklerden ka&amp;ccedil;ıyor ve bulduğu meyveleri yiyerekte puanlar topluyordu. Tam oyunu bitirmeme az kalmıştıki hi&amp;ccedil; beklenmedik bir şekilde b&amp;ouml;ceklerden birisi tarafından yendim. Aslında ekrana bir s&amp;uuml;re donuk g&amp;ouml;zler ile bakmıştım. Nitekim, oyunu oynarken aklıma ge&amp;ccedil;en g&amp;uuml;n okuduğum Oyun Programlama kitabı gelmişti.&lt;/p&gt;
&lt;p&gt;Kitabın bir b&amp;ouml;l&amp;uuml;m&amp;uuml;nde, ekranda yer alan aynı boyutlu nesnelerin &amp;ccedil;arpışmalarının kontrol&amp;uuml;nde iki boyutlu bir matris dizisinden faydalanılıyordu. O anda, &amp;ccedil;arpışma tekniklerinin farklı bir teoremini Packman'a benzeyecek bir oyun ile inceleyebileceğimi d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m. Her ne kadar amacım t&amp;uuml;m&amp;uuml;yle bir oyunu yazmak olmasada en azından Packman' imi ekrandaki duvarların i&amp;ccedil;inden ge&amp;ccedil;irmeyecek şekilde hareket ettirmek istiyordum.&lt;/p&gt;
&lt;p&gt;Teori gayet basitti. İlk olarak oyun sahasını, eşit boyutlu karelere b&amp;ouml;lecektim. Bu karelerin boyutları oyundaki nesnelerin &amp;ccedil;evresini saran hayali karelerinki ile aynı olacaktı. B&amp;ouml;ylece bir kare i&amp;ccedil;inde her zaman tek bir oyun elemanı tam olarak sığmış bulunacaktı. Daha sonra ekrandaki elemanları iki boyutlu bir matris dizisi i&amp;ccedil;inde bir şekilde konumlandıracaktım. Son olarak, kahramanın her hareketinde y&amp;ouml;ne bağlı olaraktan &amp;ouml;nceki veya sonraki kare alanlarını kontrol edecek ve orada bir Duvar nesnesi var ise &amp;ccedil;arpışma olduğunu belirterek o y&amp;ouml;ne olan hareketi kesecektim.&lt;/p&gt;
&lt;table id="table1" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;Teoremin kilit noktası, oyun alanındaki karelerde bulunan elemanları, iki boyutlu bir Matris dizisi i&amp;ccedil;erisinde temsil edebilmekti.&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;İlk olarak aşağıdaki gibi bir oyun alanını d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk109_1.gif" alt="" width="400" height="400" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. Oyun Sahası.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikle, Duvar, Muz ve kahramanımız Packo' ya ait imajları tasvir ettim. Bunların her birisi 20 piksel X 20 Piksel boyutlarındaki bir karenin i&amp;ccedil; kenarlarına teğer olacak b&amp;uuml;y&amp;uuml;kl&amp;uuml;kteydiler. Daha sonra, oyun sahamı 20 Piksel X 20 Piksel' lik kareler ile doldurdum. Dolayısıyla artık elimde, 20' ye 20' lik bir Matris vardı. Bu Matris yardımıyla ekrandaki her bir elemanın konumunu bilebilirdim. Tek yapmam gerken Matrisin ilgili elemanına, orada duran nesneyi temsil edecek sayısal bir değer vermekti. &amp;Ouml;rneğin şu anki haliyle, Packo' nun Matris' deki konumunu aşağıdaki gibi ifade edebilirdim.&lt;/p&gt;
&lt;p&gt;Matris[5,8]=1;&lt;/p&gt;
&lt;p&gt;Bu durumda, Packo' nun sağa doğru olan hareketinde herhangibir duvara &amp;ccedil;arpıp &amp;ccedil;arpmadığını kontrol etmek i&amp;ccedil;in, Y değerinin 1 fazlasına bakmak yeterli olacaktı.&lt;/p&gt;
&lt;p&gt;Yani;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;eğer Matris[5,8+1]=2 ise (ki Duvarlarıda 2 sayısı ile ifade edebilirdim.)
     &amp;Ccedil;arpışma var, Sağa gitme.
eğer Matris[5,8+1]=3 ise (ki Muzları 3 ile ifade edebilirdim.)
     Sağa git, Matris[5,9] daki Muzu ekrandan sil, Puanı arttır.
eğer Matris[5,8+1]=0 ise (ne duvar ne de Muz var ise.)
     &amp;Ccedil;arpışma yoktur. Yola devam et.&lt;/pre&gt;
&lt;p&gt;Bu kontrol&amp;uuml; Packo' nun yapacağı doğrusal her hareket i&amp;ccedil;in uygulayabilirdim. B&amp;ouml;ylece ,&lt;/p&gt;
&lt;table id="table3" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;Hareket y&amp;ouml;n&amp;uuml;ne g&amp;ouml;re bir sonraki adımda yer alan elemanları Matris dizisi i&amp;ccedil;inde bularak &amp;ccedil;arpışma kontrol&amp;uuml;n&amp;uuml; ger&amp;ccedil;ekleştirebilirdim.&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Teoremi kafamda pekiştirdikten sonra, sıra bunu uygulamaya d&amp;ouml;kmeye gelmişti. Elbetteki bir Windows uygulaması i&amp;ccedil;in b&amp;ouml;yle bir teoremi araştırmaya &amp;ccedil;alışırken bir takım zorluklar ile karşılaşabilirdim. &amp;Ouml;rneğin, oyun başladığında Duvarların, Muzların ve Packonun rastgele ekrana konumlandırılması. Ekranda piksel bazında tutulan karesel alanların, Matris dizisi i&amp;ccedil;erisinde nasıl indislendirilebileceği. &amp;Ouml;yle ya, 400 piksel' e 400 piksel' lik bir Form alanını, 400*400 elemanlı bir Matris dizisinde aynen uygulamak gereksiz yere hafıza t&amp;uuml;ketimine neden olurdu. Ya da, ekrandaki bir Muz' un &amp;uuml;st&amp;uuml;nden ge&amp;ccedil;ildiğinde o resmin nasıl kaldırılacağı. Bu gibi pek &amp;ccedil;ok sorunu &amp;ouml;nceden d&amp;uuml;ş&amp;uuml;nmek ve uygulamayı ona g&amp;ouml;re planlamak gerekiyordu. Bu ama&amp;ccedil;la &amp;ouml;nce d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m ve sonra aşağıdaki kodları geliştirdim.&lt;/p&gt;
&lt;p&gt;Konumlandırma işlemleri i&amp;ccedil;in kullandığım sınıf,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace Packo
{
    /* Bu sinif yardimiyla oyun alaninda kullandigimiz nesnelerin X ve Y koordinatlari ve duvar sayilari i&amp;ccedil;in rastgele degerler &amp;uuml;rettiriyoruz. Ekranimizi 20' ye 20'e lik karelere ayirdigimiz i&amp;ccedil;in random sinifinin Next metodunu buna uygun sekilde &amp;ccedil;agiriyoruz. */
    public class Konumlandir
    {
        private int X,Y,duvarSayisi;
        System.Random r;

        public Konumlandir()
        {
            r=new Random(); 
        }
    
        /* X koordinatlari i&amp;ccedil;in (herhangibir oyun elemaninin Left &amp;ouml;zelliginin degeri i&amp;ccedil;in) bir &amp;ouml;zellik tanimliyoruz. Bu &amp;ouml;zellik Read-Only formatindadir. */
        public int YerlestirX
        {
            get
            {
                X=r.Next(1,20)*20; /* Oyun alani 400 piksele 400 piksel boyutunda oldugu i&amp;ccedil;in, 1 ile 20 arasindaki rakami 20 kat sayisi ile &amp;ccedil;arpiyoruz.*/
                return X;
            }
        }

        /* Y koordinatlari i&amp;ccedil;in (herhangibir oyun elemaninin Top &amp;ouml;zelliginin degeri i&amp;ccedil;in) bir &amp;ouml;zellik tanimliyoruz. Bu &amp;ouml;zellik Read-Only formatindadir. */
        public int YerlestirY
        {
            get
            {
                Y=r.Next(1,20)*20;
                return Y;
            }
        }
        /* Ekrana 10 ile 30 arasinda restgele bir degerde Duvarlar koymak i&amp;ccedil;in bu &amp;ouml;zelligi kullaniyoruz. Bu &amp;ouml;zellik Read-Only formatindadir. */
        public int DuvarSayisi
        {
            get
            {
                duvarSayisi=r.Next(10,30);
                return duvarSayisi;
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Ana Program;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Konumlandir k;

/* Ekrani 20*20 lik bir matris ile ele alacagiz. */
int[,] Matris=new int[20,20];

/* Matristeki her bir elemanin hangi oyun nesnesini (duvar,kahramanimiz packocuk ve Muz) temsil ettigini daha kolay kontrol edebilmek i&amp;ccedil;in sayisal degerleri bir enum sabiti ile anlamlandiriyoruz.*/
enum AlanSahibi
{
    Pakocuk=1,
    Duvar=2,
    Muz=3
}

/* Ekrana duvar elemani, rastgele koordinatlara gelecek sekilde ekleniyor.*/
private void DuvarEkle()
{ 
    /*Bir PictureBox nesnesi tanimlaniyor.*/
    PictureBox pb=new PictureBox();
    /*Nesnemizin i&amp;ccedil;erecegi resim y&amp;uuml;kleniyor. */
    pb.Image=System.Drawing.Image.FromFile("duvar.jpg");
    /*Nesnemizin ekrandaki yerlesimi i&amp;ccedil;in gerekli koordinat ayarlamalari yapiliyor.*/
    pb.Top=k.YerlestirY;
    pb.Left=k.YerlestirX;
    /* Duvarin ekrandaki piksel bazli koordinatlarini Matrisimizdeki elemanlar ile uyusturabilmek i&amp;ccedil;in 20 ile b&amp;ouml;l&amp;uuml;yoruz.     Matrisin bu elemanina Duvar enum sabitinin degerinin veriyoruz.*/
    Matris[pb.Left/20,pb.Top/20]=(int)AlanSahibi.Duvar;
    /* Nesnemizin boyutlari belirleniyor.*/
    pb.Width=20;
    pb.Height=20;
    pb.SizeMode=PictureBoxSizeMode.StretchImage;
    /* Nesnemiz formumuzun Controls koleksiyonuna ekleniyor.*/
    this.Controls.Add(pb);
}

/* Ekrana bir Muz elemani, rastgele koordinatlara gelecek sekilde yerlestiriliyor.*/
private void MuzEkle()
{ 
    /*Muz nesnesinin &amp;uuml;zerinden ge&amp;ccedil;ildiğinde onu ekrandan kaldırabilmek i&amp;ccedil;in kontrol&amp;uuml;n adını bilmem gerekiyor.Bunun i&amp;ccedil;in MuzEkle metodunun adını bulunduğu koordinata g&amp;ouml;re tanımlıyoruz.*/
    string ad; 
    PictureBox pb=new PictureBox(); 
    pb.Image=System.Drawing.Image.FromFile("muz.jpg");
    pb.Top=k.YerlestirY;
    pb.Left=k.YerlestirX;
    Matris[pb.Left/20,pb.Top/20]=(int)AlanSahibi.Muz;
    ad="MUZ_"+Convert.ToString((pb.Left/20))+"_"+Convert.ToString((pb.Top/20));
    pb.Name=ad;
    pb.Width=20;
    pb.Height=20;
    pb.SizeMode=PictureBoxSizeMode.StretchImage;
    this.Controls.Add(pb); 
}

/* Kahramanimiz Packo' nun ekrandaki konumu, Matris dizisindeki yeri ve saga veya sola bakacagi resmi belirleniyor. Ayrica, ekrana DuvarSayisi kadar Duvar ve Muz elemanlari ekleniyor.*/
private void Baslat()
{
    /* Rastegele X,Y ve duvar sayilari i&amp;ccedil;in kullandigimi Konumlandir sinifina ait bir nesne &amp;ouml;rnegi olusturuluyor.*/
    k=new Konumlandir();
    resPacko.Left=k.YerlestirX;
    resPacko.Top=k.YerlestirY;
    Matris[resPacko.Left/20,resPacko.Top/20]=(int)AlanSahibi.Pakocuk;
    /*Egere resPacko ekranin sol yarim k&amp;uuml;resinde ise, Sola bakan resmi g&amp;ouml;steriliyor.*/
    if(resPacko.Left&amp;lt;200)
        resPacko.Image=System.Drawing.Image.FromFile("packoSol.jpg");
    /*Egere resPacko ekranin sag yarim k&amp;uuml;resinde ise, Saga bakan resmi g&amp;ouml;steriliyor.*/
    if(resPacko.Left&amp;gt;200)
        resPacko.Image=System.Drawing.Image.FromFile("packoSag.jpg");
    resPacko.Visible=true;
    for(int i=1;i&amp;lt;k.DuvarSayisi;i++)
    {
        DuvarEkle();
        MuzEkle();
    }
}

int carpismaDurumu=0;

/* Eğer &amp;uuml;st&amp;uuml;nden ge&amp;ccedil;tiğimiz nesne Muz ise onu ekrandan kaldırıyoruz. Bunu yaparken Form &amp;uuml;zerindeki kontrollerde gezinip, kontrol&amp;uuml;n adını buluyor ve Remove metodunu &amp;ccedil;ağırıyoruz.*/
private void MuzYokEt(int X,int Y)
{ 
    /*&amp;Ouml;nce Matirsimizin X,Y elemanının Muz olup olmadığına bakıyoruz.*/
    if(Matris[X,Y]==(int)AlanSahibi.Muz)
    {
        /*Eğer Muz ise dizinin bu elemanının değerini 0 yapıyoruz. B&amp;ouml;ylece Muz nesnemizi diziden &amp;ccedil;ıkarmış oluyoruz.*/
        Matris[X,Y]=0;
        /* Daha sonra PictureBox' ımızın adını tedarik ediyoruz. */
        string muzX=X.ToString();
        string muzY=Y.ToString();
        string KontrolAdi="MUZ_"+muzX+"_"+muzY;
        /*D&amp;ouml;ng&amp;uuml; ile, Form i&amp;ccedil;indeki t&amp;uuml;m kontroller arasında geziniyoruz.*/
        for(int i=0;i&amp;lt;this.Controls.Count;i++)
        {
            /*Eğer g&amp;uuml;ncel kontrol&amp;uuml;n adı, bizim Muz nesnemizinki ile aynı ise, bu PictureBox' ı Formumuzdan &amp;ccedil;ıkartıyoruz.*/
            if(this.Controls[i].Name.ToString()==KontrolAdi)
            {
                this.Controls.Remove(this.Controls[i]);
            }    
        }
    }
}

/* &amp;Ccedil;arpisma kontrol&amp;uuml;n&amp;uuml;n yapildigi metod. Bu metod Packo' nun X, Y koordinatlari ile hareket ettigi y&amp;ouml;n&amp;uuml; (saga,sola,yukariya,asagiya) parametre olarak aliyor. Aldigi X,Y koordinatlari ve y&amp;ouml;ne g&amp;ouml;re, bir sonraki kare alaninda bir Duvar nesnesi olup olmadigina bakiyor.*/ 
private void CarpismaKontrol(int X,int Y,char Yon)
{
    /*Eger sola hareket ediyorsak ve Matrisimizin [X indisinin 1 &amp;ouml;nceki elemani,Y] AlanSahibi.Duvar enum sabitinin degerine esit ise &amp;ccedil;arpisma vardir. */
    if(Yon=='A')
    {
        int alanSahibi=Matris[X-1,Y];
        if(alanSahibi==(int)AlanSahibi.Duvar)
            carpismaDurumu=1;
        else
            carpismaDurumu=0;
        MuzYokEt(X,Y);
    }
    /*Eger saga hareket ediyorsak ve Matrisimizin [X indisinin 1 sonraki elemani,Y] AlanSahibi.Duvar enum sabitinin degerine esit ise &amp;ccedil;arpisma vardir. */
    if(Yon=='D')
    {
        int alanSahibi=Matris[X+1,Y];
        if(alanSahibi==(int)AlanSahibi.Duvar)
            carpismaDurumu=1;
        else
            carpismaDurumu=0;
        MuzYokEt(X,Y);
    }
    /*Eger asagi hareket ediyorsak ve Matrisimizin [X,Y indisinin 1 sonraki elemani] AlanSahibi.Duvar enum sabitinin degerine esit ise &amp;ccedil;arpisma vardir. */
    if(Yon=='S')
    {
        int alanSahibi=Matris[X,Y+1];
        if(alanSahibi==(int)AlanSahibi.Duvar)
            carpismaDurumu=1;
        else
            carpismaDurumu=0;
        MuzYokEt(X,Y);
    }
/*Eger yukari hareket ediyorsak ve Matrisimizin [X,Y indisinin 1 &amp;ouml;nceki elemani] AlanSahibi.Duvar enum sabitinin degerine esit ise &amp;ccedil;arpisma vardir. */
    if(Yon=='W')
    {
        int alanSahibi=Matris[X,Y-1];
        if(alanSahibi==(int)AlanSahibi.Duvar)
            carpismaDurumu=1;
        else
            carpismaDurumu=0;
        MuzYokEt(X,Y);
    }
}

/*Form &amp;uuml;zerinde A (sol), S (asagi), D (saga), W (yukari) tuslarina basildik&amp;ccedil;a &amp;ccedil;arpisma kontrol&amp;uuml; yapiliyor. Eger &amp;ccedil;arpisma var ise, belirtilen y&amp;ouml;ndeki dogrusal harekete (20 piksellik &amp;ouml;teleme) izin verilmiyor. Aksi halde harekete devam ediliyor.*/
private void frmPacko_KeyPress(object sender, System.Windows.Forms.KeyPressEventArgs e)
{
    int x=resPacko.Left/20;
    int y=resPacko.Top/20;

    if(e.KeyChar==(Char)Keys.A)
    {
        resPacko.Image=System.Drawing.Image.FromFile("packoSol.jpg");
        CarpismaKontrol(x,y,'A');
        if(carpismaDurumu==1)
            MessageBox.Show("DUVARA &amp;Ccedil;ARPTIN");
        else
            resPacko.Left-=20;
    }
    if(e.KeyChar==(Char)Keys.D)
    {
        resPacko.Image=System.Drawing.Image.FromFile("packoSag.jpg");
        CarpismaKontrol(x,y,'D');
        if(carpismaDurumu==1)
            MessageBox.Show("DUVARA &amp;Ccedil;ARPTIN");
        else
            resPacko.Left+=20;
    } 
    if(e.KeyChar==(Char)Keys.S)
    {
        resPacko.Image=System.Drawing.Image.FromFile("packoAsagi.jpg");
        CarpismaKontrol(x,y,'S');
        if(carpismaDurumu==1)
            MessageBox.Show("DUVARA &amp;Ccedil;ARPTIN");
        else
            resPacko.Top+=20;
    }
    if(e.KeyChar==(Char)Keys.W)
    {
        resPacko.Image=System.Drawing.Image.FromFile("packoYukari.jpg");
        CarpismaKontrol(x,y,'W');
        if(carpismaDurumu==1)
            MessageBox.Show("DUVARA &amp;Ccedil;ARPTIN");
        else
            resPacko.Top-=20;
    }
} 

/*Oyunu kapatmak ve baslatmak kullandigimiz men&amp;uuml;leri ContextMenu i&amp;ccedil;erisinde kullaniyoruz.*/
private void menuItem3_Click(object sender, System.EventArgs e)
{
    Close();
}

private void menuItem1_Click(object sender, System.EventArgs e)
{
    Baslat();
}

/* Kontrol amaciyla, Matris dizisinin degerlerini Text tabanli bir dosyaya da yazabiliyoruz.*/
private void menuItem4_Click(object sender, System.EventArgs e)
{
    System.IO.FileStream fs=new System.IO.FileStream("kontrol.txt",System.IO.FileMode.OpenOrCreate,System.IO.FileAccess.Write);
    System.IO.StreamWriter sw=new System.IO.StreamWriter(fs);
    for(int i=0;i&amp;lt;20;i++)
    {
        for(int j=0;j&amp;lt;20;j++)
        {
            sw.Write("{0,2},{1,2}={2,3}",i,j,Matris[i,j]);
        }
        sw.WriteLine();
    }
    sw.Flush();
    sw.Close();
    fs.Close();
}&lt;/pre&gt;
&lt;p&gt;Kodlar her ne kadar uzun g&amp;ouml;r&amp;uuml;nsede programın tek yaptığı, Packo' yu duvarların i&amp;ccedil;inden ge&amp;ccedil;irmeden hareket ettirmek ve yolda g&amp;ouml;rd&amp;uuml;ğ&amp;uuml; Muz' ları toplamasını sağlamak. &amp;Ouml;rneğin, uygulamayı &amp;ccedil;alıştırdığımızda bir duvara hangi y&amp;ouml;nden gelirsek gelelim, Matris dizimiz i&amp;ccedil;inde Packo' dan sonraki elemanlar kontrol edilecek ve duvara &amp;ccedil;arpılıp &amp;ccedil;arpılmadığına bakılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk109_2.gif" alt="" width="399" height="396" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. Duvara &amp;Ccedil;arpış.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Diğer yandan, eğer Packo bir Muz &amp;uuml;zerinden ge&amp;ccedil;erse, bu Muz nesnesini temsil eden PictureBox Form &amp;uuml;zerinden kaldırılacak, aynı zamanda Matris dizimizdeki ilgili Muz elemanın değeride sıfırlanacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk109_3.gif" alt="" width="184" height="365" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. Packo Muzları Yiyebiliyor.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, Matris tekniği ile eşit karelere b&amp;ouml;l&amp;uuml;nm&amp;uuml;ş sahalardaki nesnelerin birbirleri ile olan &amp;ccedil;arpışmalarını kontrol edebilmek son derece basit. Bu minik program elbetteki başlangı&amp;ccedil; aşamasında. &amp;Ouml;rneğin, her muz yiyişinden sonra puanlama sistemi olması, duvarların seri olacak şekilde ekrana dizilmesi, Packo dışında hareket eden ve Packo' yu yemeye &amp;ccedil;alışan b&amp;ouml;ceklerin farklı hareketleri vs... Bu kısımların geliştirilmesinide siz değerli okurlarıma bırakıyorum. Uygulamaya kaldığı yerden devam edebilirsiniz.&amp;nbsp;Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-12-04 12:00:00</pubDate>
  <slug>Oyun-Programlamaya-Giriş-(Matrisler-Yardımıyla-Çarpışma-Kontrolü)-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>oyun-programlama</tag>
    <tag>collasion</tag>
    <tag>net</tag>
    <tag>arrays</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>