<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Paralel Programlamada Performans, Hız, Verimlilik ve Ölçeklenebilirlik Ölçümleri</title>
  <description>Ben Matematik Mühendisliği eğitimi almış bir bireyim. Öğrenim hayatım boyunca en çok yaptığım işlerden birisi, matematiksel teoremlerin bilimsel ispatlarını gerçekleştirmek olmuştur. Hemen hemen mühandisliğin her alanındaki farklı problemlerin modellenmesi ve ispatlarının yapılarak en uygun yol olduklarının gösterilmesi adına pek çok kağıt karalamış ve tüketmişimdir.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f1%2fblg135_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Ben &lt;strong&gt;Matematik M&amp;uuml;hendisliği&lt;/strong&gt; eğitimi almış bir bireyim. &amp;Ouml;ğrenim hayatım boyunca en &amp;ccedil;ok yaptığım işlerden birisi, matematiksel teoremlerin bilimsel ispatlarını ger&amp;ccedil;ekleştirmek&amp;nbsp;olmuştur. Hemen hemen m&amp;uuml;handisliğin her alanındaki farklı problemlerin modellenmesi ve ispatlarının yapılarak en uygun yol olduklarının g&amp;ouml;sterilmesi adına pek &amp;ccedil;ok kağıt karalamış ve t&amp;uuml;ketmişimdir.&lt;/p&gt;
&lt;p&gt;Zaman zaman neden yaptığımızı anlamadığım ispatlardan tutunda,&amp;nbsp;lastiğine konumuş olan sineğin bisikletin ileriye y&amp;ouml;nl&amp;uuml; ama d&amp;uuml;z bir rotada olmayan hareketi boyunca &amp;ccedil;izdiği sarmalımsının denklemini &amp;ccedil;ıkartmaya kadar matematiğin bir o kadar garip ama gizemli evreninde dolaşıp durduğumu hatırlıyorum. Hatta bir g&amp;uuml;n&amp;nbsp;Matematik Analiz dersinin finalinde karşılaştığım bir soruda ne hikmetse &lt;strong&gt;1=2&lt;/strong&gt; sonucuna ulaşmışımdır. Halbuki &lt;strong&gt;1=1'&lt;/strong&gt; e ulaşmış olmam gerekirdi. &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt;&amp;nbsp;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Tabi zaman ilerleyip iş para kazanmaya gelince kimsenin teorem ispatları ile uğraşmadığnı acı olarak farketmiştim. İlgi duyduğum yazılım sekt&amp;ouml;r&amp;uuml;ne gireli uzun yıllar olduğu i&amp;ccedil;in matematiksel teorem ispatlarında tam anlamıyla pas tutmuş durumdayım. Yine de zaman zaman yazılım i&amp;ccedil;erisinde matematiği basit haliyle bile g&amp;ouml;rebilmek, en azından bazı konuların ispatında kullanabiliyor olmak sevindirici.&lt;/p&gt;
&lt;p&gt;Gelelim bu yazımızın konusuna. Bildiğiniz &amp;uuml;zere bir s&amp;uuml;redir paralel programlama ile ilişkili konuları incelemeye &amp;ccedil;alışıyor ve &amp;ouml;ğrenebildiklerimi sizlerle paylaşıyorum. Yine bu vesile ile ge&amp;ccedil;tiğimiz haftalar i&amp;ccedil;erisinde internette dolaşırken g&amp;ouml;z&amp;uuml;me ilişen kısa ve &amp;ouml;zl&amp;uuml; bir yazı ile karşılaştım. &lt;a title="Performance, SpeedUp, Efficiency, Scalability" href="http://blogs.msdn.com/pfxteam/archive/2010/01/19/9950541.aspx" target="_blank"&gt;Microsoft Paralel programlama takımı tarafından yayınlanan FAQ girdisinde&lt;/a&gt;, &amp;ccedil;eşitli kriterlere g&amp;ouml;re hangi kodun daha iyi olduğunun &amp;ouml;l&amp;ccedil;&amp;uuml;mlenebilmesi i&amp;ccedil;in hangi kriterlere bakılabileceği &amp;ouml;zetlenmektedir. Kısaca elimizde aşağıdaki tabloda yer alan kriterler mevcut. Bu kriterlere g&amp;ouml;re&amp;nbsp;seri ve paralel olarak yazılmış kod algoritmalarının kıyaslanması m&amp;uuml;mk&amp;uuml;n. &amp;Ouml;zellikle yazdığımız paralel program kodlarının normal versiyonlarına g&amp;ouml;re daha iyi olup olmadıklarının tespit edilmesi noktasında son derece m&amp;uuml;him kriterler olduklarını d&amp;uuml;ş&amp;uuml;nmekteyim.&lt;/p&gt;
&lt;table style="width: 100%;" border="1" cellspacing="0" cellpadding="1"&gt;
&lt;tbody&gt;
&lt;tr style="background-color: #deb887;" valign="top"&gt;
&lt;td&gt;
&lt;p&gt;&lt;strong&gt;Kriter&lt;/strong&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;td&gt;
&lt;p&gt;&lt;strong&gt;A&amp;ccedil;ıklama&lt;/strong&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #deb887;" valign="top"&gt;
&lt;p&gt;&lt;strong&gt;Performance(Performans)&lt;/strong&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;td&gt;
&lt;p&gt;Genel olarak seri ve paralel yazılmış kodların performans &amp;ouml;l&amp;ccedil;&amp;uuml;mlerinde algoritmanın toplam icra s&amp;uuml;releri hesaba katılmaktadır. &amp;Ccedil;oğunlukla ve pek tabii olarak bir&amp;nbsp;algoritmanın y&amp;uuml;r&amp;uuml;t&amp;uuml;lme s&amp;uuml;resinin diğerine g&amp;ouml;re daha d&amp;uuml;ş&amp;uuml;k olması tercih edilir ki bu iyi bir perfomans anlamına gelmektedir.&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #deb887;" valign="middle"&gt;
&lt;p&gt;&lt;strong&gt;SpeedUp(Hızlanma)&lt;/strong&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;td&gt;
&lt;p&gt;Hızlanma değerini hesap etmek i&amp;ccedil;in şu form&amp;uuml;l kullanılır;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;SpeedUp = Seri &amp;Ccedil;alışma S&amp;uuml;resi / Paralel &amp;Ccedil;alışma S&amp;uuml;resi&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Bu form&amp;uuml;l&amp;uuml;n sonucuna g&amp;ouml;re bir algoritmanın diğerinden ka&amp;ccedil; kat hızlı olduğu belirlenebilir.&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #deb887;" valign="middle"&gt;
&lt;p&gt;&lt;strong&gt;Efficiency(Verimlilik/Etkinlik)&lt;/strong&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;td&gt;
&lt;p&gt;Tabiki yazılan algoritmanın &amp;ccedil;alıştırıldığı seri veya paralel işleyişin hangisinin tercih edileceği kararını vermede rol oynan kriterlerden birisi de hangisinin daha verimli olduğudur. Verimliliği veya etkinliği hesap etmek i&amp;ccedil;inse aşağıdaki form&amp;uuml;lden yararlanıldığı g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Efficiency = Hızlanma / İşlemci &amp;Ccedil;ekirdek Sayısı&lt;/strong&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #deb887;" valign="middle"&gt;
&lt;p&gt;&lt;strong&gt;Scalability(&amp;Ouml;l&amp;ccedil;eklenebilirlik)&lt;/strong&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;td&gt;
&lt;p&gt;&amp;Ouml;l&amp;ccedil;eklenme bilimsel alanda son derece yaygın kullanılan etkili bir terimdir. Şu anki konumuza baktığımızda ise yazılan algoritmanın seri ve paralel denemelerine ait &lt;strong&gt;SpeedUp&lt;/strong&gt; değerlerinin farklı sayıda &amp;ccedil;ekirdek/işlemci i&amp;ccedil;in nasıl sonu&amp;ccedil;lar verdiği ile alakalıdır. İşlemci veya &amp;ccedil;ekirdek sayısının artması ile &lt;strong&gt;SpeedUp&lt;/strong&gt; değerlerinin d&amp;uuml;şmesi bir başka deyişle daha hızlı sonu&amp;ccedil;lar elde edilmesi, pozitif &amp;ouml;l&amp;ccedil;eklenmenin ispatı olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Yani işlemci/&amp;ccedil;ekirdek sayısının artması dolayısıyla ortamın b&amp;uuml;y&amp;uuml;mesi karşılığında hızlanmanında artması beklenir.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;Kişisel Not :&lt;/strong&gt; Her ne kadar s&amp;ouml;z konusu yazıda sadece &amp;ccedil;ekirdek sayıları hesaba katılsa da bana g&amp;ouml;re ram ve işlemci tiplerinin de s&amp;ouml;z konusu algoritmanın seri veya paralel &amp;ccedil;alışması durumlarındaki &amp;ouml;l&amp;ccedil;eklenmeyi etkileyeceği ve hesaba katılması gerektiği d&amp;uuml;ş&amp;uuml;ncesindeyim.&lt;/em&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Haydi gelin buradaki &amp;ouml;l&amp;ccedil;&amp;uuml;m değerlerini &amp;ouml;rnek bir kod &amp;uuml;zerinden incelemeye &amp;ccedil;alışalım. Bu ama&amp;ccedil;la &lt;strong&gt;Visual Studio 2010 Ultimate&amp;nbsp;RC&lt;/strong&gt; ve &lt;strong&gt;.Net Framework 4.0&amp;nbsp;RC &lt;/strong&gt;&amp;uuml;zerinde basit bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması geliştiriyor olacağız. &amp;Ouml;rneğe ait senaryomuz ise şu şekilde olacaktır.&lt;/p&gt;
&lt;p&gt;Bir klas&amp;ouml;r i&amp;ccedil;erisinde yer alan &lt;strong&gt;jpg&lt;/strong&gt; uzantılı resim dosyalarının boyutlarının arttırılmasını ele alan bir kod par&amp;ccedil;ası geliştireceğiz. Resimlerin boyut arttırım işleminin zaman alan ve yorucu bir işlem olduğu d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde, seri ve paralel kodların &amp;uuml;rettiği sonu&amp;ccedil;ları yukarıdaki kriterler eşliğinde değerlendirmeye &amp;ccedil;alışacağız. Ne yazık ki elimde sadece &amp;ccedil;ift &amp;ccedil;ekirdekli iki makine olduğundan &lt;strong&gt;Scalability&lt;/strong&gt; kriterini bu &amp;ouml;rnekte sizlere g&amp;ouml;steremiyorum &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;Ancak sizler uygun test ortamlarına sahipseniz, &amp;ouml;l&amp;ccedil;eklenebilirlik kriterini değerlendirebilirsiniz ki değerlendirmenizi tavsiye ederim.&amp;nbsp;İşte Console uygulaması kodlarımız...&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Diagnostics;
using System.Drawing;
using System.IO;
using System.Threading.Tasks;

namespace ProofOfConcept
{
    class Program
    {
        static void Main(string[] args)
        {
            string[] files = Directory.GetFiles("..\\..\\Images\\", "*.jpg");

            // Execution s&amp;uuml;releri t&amp;uuml;m kriterlerde &amp;ouml;nemlidir. Bu hesaplama i&amp;ccedil;in Diagnostics isim alanında yer alan Stopwatch tipinden yararlanılır
            Stopwatch watcher = new Stopwatch();
            watcher.Start();
            SerialExecution(files);
            watcher.Stop();
            // Seri &amp;ccedil;alışmanın toplam işlem s&amp;uuml;resi milisaniye cinsinden elde edilir
            float serialElapsed=Convert.ToSingle(watcher.ElapsedMilliseconds);
            
            watcher.Restart();
            ParallelExecution(files);
            watcher.Stop();
            // Paralel &amp;ccedil;alışmanın toplam işlem s&amp;uuml;resi milisaniye cinsinden elde edilir
            float parallelElapsed = Convert.ToSingle(watcher.ElapsedMilliseconds);

            // Kriterler hesaplanır
            Console.WriteLine("Serial Performance {0} mili saniye \t Parallel Perfomance {1} mili saniye",serialElapsed,parallelElapsed);
            float SpeedUp = serialElapsed / parallelElapsed;
            Console.WriteLine("SpeedUp {0}",SpeedUp);
            double Efficiency = SpeedUp / Environment.ProcessorCount;
            Console.WriteLine("Efficiency {0} (% {1})", Efficiency,Efficiency*100);
            Console.WriteLine("Scalability bu &amp;ouml;rneğimizde ne yazıkki test edilemedi");
        }

        // Seri &amp;ccedil;alıştırma metodumuz
        static void SerialExecution(string[] fileList)
        {
            foreach (string file in fileList)
            {
                Resize(file);
            }
        }

        // Paralel &amp;ccedil;alıştırma metodumuz
        static void ParallelExecution(string[] fileList)
        {
            // Dosyaları Paralel ForEach d&amp;ouml;ng&amp;uuml;s&amp;uuml;ne g&amp;ouml;re ele almakta.
            Parallel.ForEach&amp;lt;string&amp;gt;(fileList, s =&amp;gt; Resize(s));
        }

        // Resim dosyasını yeniden boyutlandırmak i&amp;ccedil;in kullandığımız metod
        static void Resize(string fileName)
        {
            // &amp;Ouml;nce Image tipi elde edilir
            Image img = Image.FromFile(fileName);
            //Yeni genişlik ve y&amp;uuml;kseklik değerleri belirlenir. &amp;Ouml;rnek olarak % 40 artım yapılmıştır
            int newWidth = Convert.ToInt32(img.Width * 1.40);
            int newHeight = Convert.ToInt32(img.Height * 1.40);
            // Yeni boyutlarına g&amp;ouml;re bir Bitmap nesnesi &amp;ouml;rneklenir
            Bitmap btmp = new Bitmap(img, new Size(newWidth, newHeight));
        }        
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamayı kendi makinemde (Intel Core2Duo, 2.5 Gb Ram), 45 resim(44.8 Mb) &amp;uuml;zerinde test ettiğimde aşağıdaki sonu&amp;ccedil;ları elde ettim. Burada seri ve paralel y&amp;uuml;r&amp;uuml;tmeler arasındaki farklılıklar kriterler bazında a&amp;ccedil;ık bir şekilde ortaya &amp;ccedil;ıkmakta.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg135_Runtime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re paralel &amp;ccedil;alıştırmanın &lt;strong&gt;performansı&lt;/strong&gt; seri olana g&amp;ouml;re daha y&amp;uuml;ksektir. Ayrıca paralel &amp;ccedil;alıştırma, seri olana g&amp;ouml;re&amp;nbsp;&lt;strong&gt;1,55 kata kadar daha hızlıdır&lt;/strong&gt;.&amp;nbsp;İlaveten paralel olan &amp;ccedil;alıştırmanın seri olana g&amp;ouml;re &lt;strong&gt;%77&lt;/strong&gt; &lt;strong&gt;daha verimli/etkili&lt;/strong&gt; olduğu sonucuna ulaşılabilir. Tabi bu kodu farklı sayıdaki işlemci veya &amp;ccedil;ekirdek sayısına sahip sistemlerde defalarca test edip bir istatistik &amp;ccedil;ıkartmak ve bunun sonu&amp;ccedil;larına bakmak daha doğru olacaktır. İsterseniz bu kod par&amp;ccedil;asında farklı bir deneyimi tecr&amp;uuml;be edebilirsiniz. &amp;Ouml;rneğin &lt;strong&gt;SerialExecution&lt;/strong&gt; ve &lt;strong&gt;ParallelExecution &lt;/strong&gt;metodlarını arka arkaya &lt;strong&gt;10&lt;/strong&gt; kez &amp;ccedil;alıştırıp sonu&amp;ccedil;ları &lt;strong&gt;Excel&lt;/strong&gt; tablosunda istatistikleştirip gerekli analizleri yapabilir ve hangisini tercih edebileceğinize daha kolay karar verebilirsiniz. En azından ispatı daha g&amp;uuml;&amp;ccedil;l&amp;uuml; kılarsınız. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f2%2fProofOfConcept_RC.rar"&gt;ProofOfConcept_RC.rar (4,33 mb)&lt;/a&gt;&amp;nbsp;&lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 Ultimate RC s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde geliştirilmiş ve test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-02-21 23:05:00</pubDate>
  <slug>Paralel-Programlamada-Performans-Hiz-Verimlilik-ve-Olceklenebilirlik-Olcumleri</slug>
  <tags>
    <tag>parallel-programming</tag>
    <tag>task-parallel-library</tag>
    <tag>net-framework-40</tag>
    <tag>c#-40</tag>
  </tags>
  <categories>
    <category>Parallel Programming</category>
  </categories>
</post>