<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Arayüz(Interface), Sınıf(Class) ve Çoklu Kalıtım</title>
  <description>Bugünkü makalemizde, arayüzleri incelemeye devam ediceğiz. Bir önceki makalemizde, arayüzleri kullanmanın en büyük nedenlerinden birisinin sınıflara çoklu kalıtım desteği vermesi olduğunu söylemiştik. Önce basit bir uygulama ile bunu gösterelim.</description>
  <content>&lt;p align="left"&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde, aray&amp;uuml;zleri incelemeye devam ediceğiz. Bir &amp;ouml;nceki makalemizde, aray&amp;uuml;zleri kullanmanın en b&amp;uuml;y&amp;uuml;k nedenlerinden birisinin sınıflara &amp;ccedil;oklu kalıtım desteği vermesi olduğunu s&amp;ouml;ylemiştik. &amp;Ouml;nce basit bir uygulama ile bunu g&amp;ouml;sterelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace Interfaces2
{
     public interface IMusteri
     {
          void MusteriDetay();
          int ID{get;}
          string Isim{get;set;}
          string Soyisim{get;set;}
          string Meslek{get;set;}
     }

     public interface ISiparis
     {
         int SiparisID{get;}
          string Urun{get;set;}
          double BirimFiyat{get;set;}
          int Miktar{get;set;}
          void SiparisDetay();
     }
     public class Sepet:IMusteri,ISiparis /* Sepet isimli sınıfımız hem IMusteri aray&amp;uuml;z&amp;uuml;n&amp;uuml; hemde ISiparis aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulayacaktır. */
     {
          private int id,sipId,mkt;
          private string ad,soy,mes,ur;
          private double bf;
          public int ID
          {
               get{return id;}
          }
          public string Isim
          {
               get{return ad;}
               set{ad=value;}
          }
          public string Soyisim
          {
               get{return soy;}
               set{soy=value;}
          }
          public string Meslek
          {
               get{return mes;}
               set{mes=value;}
          }
          public void MusteriDetay()
          {
               Console.WriteLine(ad+" "+soy+" "+mes);
          }
          public int SiparisID
          {
               get{return sipId;}
          }
          public string Urun
          {
               get{return ur;}
               set{ur=value;}
          }
          public double BirimFiyat
          {
               get{return bf;}
               set{bf=value;}
          }
          public int Miktar
          {
               get{return mkt;}
               set{mkt=value;}
          }
          public void SiparisDetay()
          {
               Console.WriteLine("----Siparisler----");
               Console.WriteLine("Urun:"+ur+" Birim Fiyat"+bf.ToString()+" Miktar:"+mkt.ToString());
          }
     }
     class Class1
     {
          static void Main(string[] args)
          {
               Sepet spt1=new Sepet();

               spt1.Isim="Burak";
               spt1.Soyisim="Software";
               spt1.Meslek="Mat.M&amp;uuml;h";
               spt1.Urun="Modem 56K";
               spt1.BirimFiyat=50000000;
               spt1.Miktar=2;
               spt1.MusteriDetay();
               spt1.SiparisDetay();
          }
     }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk39_1.gif" alt="" width="388" height="145" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 1. Programın &amp;Ccedil;alışmasının Sonucu.&lt;/p&gt;
&lt;p&gt;Yukarıdaki kodlarda aslında değişik olarak yaptığımız bir şey yok. Sadece oluşturduğumuz aray&amp;uuml;zleri bir sınıfa uyguladık ve &amp;ccedil;ok kalıtımlılığı ger&amp;ccedil;ekleştirmiş olduk. Ancak bu noktada dikkat etmemiz gereken bir unsur vardır. Eğer aray&amp;uuml;zler aynı isimli metodlara sahip olurlarsa ne olur? Bu durumda aray&amp;uuml;zlerin uygulandığı sınıfta, ilgili metodu bir kez yazmamız yeterli olucaktır. S&amp;ouml;z gelimi, yukarıdaki &amp;ouml;rneğimizde, Baslat isimli ortak bir metodun aray&amp;uuml;zlerin ikisi i&amp;ccedil;inde tanımlanmış olduğunu varsayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public interface IMusteri
{
     void MusteriDetay();
     int ID{get;}
     string Isim{get;set;}
     string Soyisim{get;set;}
     string Meslek{get;set;}
     void Baslat();
}

public interface ISiparis
{
     int SiparisID{get;}
     string Urun{get;set;}
     double BirimFiyat{get;set;}
     int Miktar{get;set;}
     void SiparisDetay();
     void Baslat();
}&lt;/pre&gt;
&lt;p&gt;Şimdi bu iki aray&amp;uuml;zde aynı metod tanımına sahip. Sınıfımızda bu metodları iki kez yazmak anlamsız olucaktır. O nedenle sınıfımza aşağıdaki gibi tek bir Baslat metodu ekleriz. Sınıf nesnemizi oluşturduğumuzda, Baslat isimli metodu aşağıdaki gibi &amp;ccedil;alıştırabiliriz.&lt;/p&gt;
&lt;p&gt;spt1.Baslat();&lt;/p&gt;
&lt;p&gt;Fakat bazı durumlarda, aray&amp;uuml;zlerdeki metodlar aynı isimlide olsalar, aray&amp;uuml;zlerin uygulandığı sınıf i&amp;ccedil;erisinde s&amp;ouml;z konusu metod, aray&amp;uuml;zlerin her biri i&amp;ccedil;in ayrı ayrıda yazılmak istenebilir. B&amp;ouml;yle bir durumda ise sınıf i&amp;ccedil;erisindeki metod yazımlarında aray&amp;uuml;z isimlerini de belirtiriz.&amp;Ouml;rneğin;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;void IMusteri.Baslat()
{
     Console.WriteLine("M&amp;uuml;şteriler hazırlandı...");
}
void ISiparis.Baslat()
{
     Console.WriteLine("Siparişler hazırlandı...");
}&lt;/pre&gt;
&lt;p&gt;Metodların isimleri başında hangi aray&amp;uuml;z i&amp;ccedil;in yazıldıklarına dikkat edelim. Diğer &amp;ouml;nemli bir nokta public belirtecinin kullanılmayışıdır. Public belirtecini kullanmamız durumunda, "The modifier 'public' is not valid for this item" derleyici hatasını alırız. &amp;Ccedil;&amp;uuml;nk&amp;uuml;, metodumuzu public olarak tanımlamaya gerek yoktur. Nitekim, bu metodların kullanıldığı sınıflara ait nesnelerden, bu metodları &amp;ccedil;ağırmak istediğimizde doğrudan &amp;ccedil;ağıramadığımız g&amp;ouml;r&amp;uuml;r&amp;uuml;z. &amp;Ccedil;&amp;uuml;nk&amp;uuml; derleyici hangi aray&amp;uuml;zde tanımlanmış metodun &amp;ccedil;ağırılması gerektiğini bilemez. Bu metodları kullanabilmek i&amp;ccedil;in, nesne &amp;ouml;rneğini ilgili aray&amp;uuml;z tiplerine&amp;nbsp; d&amp;ouml;n&amp;uuml;şt&amp;uuml;rmemiz gerekmektedir. Bu d&amp;ouml;n&amp;uuml;şt&amp;uuml;rmenin yapılması ilgili sınıf nesnesinin, aray&amp;uuml;z tipinden değişkenlere a&amp;ccedil;ık bir şekilde d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmesi ile oluşur. İşte bu y&amp;uuml;zdende bu tip metodlar, tanımlandıkları sınıf i&amp;ccedil;inde public yapılamazlar. Bu a&amp;ccedil;ık&amp;ccedil;a d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemide aşağıdaki &amp;ouml;rnek satırlarda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi olur.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;IMusteri m=(IMusteri)spt1;
ISiparis s=(ISiparis)spt1;&lt;/pre&gt;
&lt;p&gt;İşte şimdi istediğimiz metodu, bu değişken isimleri ile birlikte aşağıdaki &amp;ouml;rnek satırlarda olduğu gibi &amp;ccedil;ağırabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;m.Baslat();
s.Baslat();&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk39_2.gif" alt="" width="436" height="145" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 2. Programın &amp;Ccedil;alışmasının Sonucu.&lt;/p&gt;
&lt;p align="left"&gt;Geldik bir makalemizin daha sonuna ilerleyen makalelerimizde aray&amp;uuml;zleri incelemeye devam edeceğiz. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-01-09 12:00:00</pubDate>
  <slug>Arayüz(Interface),-Sınıf(Class)-ve-Çoklu-Kalıtım-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>oop</tag>
    <tag>interface</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>