<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>C# Temelleri : Referans Tipi Olmak</title>
  <description>.Net üzerinde kullanılabilen veri türleri (data types) referans türleri (reference types) ve değer türleri (value types) olmak üzere iki kategoriye ayrılmaktadır. Temel olarak değer türleri (value types) fiziki belleğin stack adı verilen bölgesinde tutulur...</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;.Net &amp;uuml;zerinde kullanılabilen veri t&amp;uuml;rleri (data types) referans t&amp;uuml;rleri (reference types) ve değer t&amp;uuml;rleri (value types) olmak &amp;uuml;zere iki kategoriye ayrılmaktadır. Temel olarak değer t&amp;uuml;rleri (value types) fiziki belleğin stack adı verilen b&amp;ouml;lgesinde tutulur. Referans t&amp;uuml;rleri ise, veriyi heap bellek b&amp;ouml;lgesinde tutarken, stack b&amp;ouml;lgesinden verilerin adresini g&amp;ouml;steren işaret&amp;ccedil;iler kullanır. .Net Framework i&amp;ccedil;erisinde yer alan int, double, float, bool gibi ilkel tiplerin &amp;ccedil;oğu değer t&amp;uuml;rleridir.&lt;/p&gt;
&lt;p&gt;Geliştiriciler struct ve enum tiplerini kullanarak kendi değer t&amp;uuml;rlerini tasarlayabilirler. Aslında ilkel değer t&amp;uuml;rlerinin (int, double gibi) .Net Framework i&amp;ccedil;erisinde karşılık geldikleri struct ' lar vardır (&amp;ouml;rneğin int i&amp;ccedil;in System.Int32). Bunlar aynı zaman Common Type System' in &amp;uuml;yeleridir. Referans tipleri cephesine bakacak olursak; string ve object t&amp;uuml;rleri &amp;ouml;nceden tanımlı olan referans tipleridir. Geliştiriciler class, delegate gibi tipleri kullanarak kendi referans t&amp;uuml;rlerini yazabilirler. Değer ve referans t&amp;uuml;rleri ile ilgili bu kısa a&amp;ccedil;ıklamalardan sonra dilerseniz makalemizde işleyeceğimiz konu başlıklarına bir bakalım.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Referans tipleri arası atamalar sonrası durumu.&lt;/li&gt;
&lt;li&gt;Struct' lar i&amp;ccedil;erisinde referans tipleri kullanılması halinde, tipler arası atamalar sonrası durum.&lt;/li&gt;
&lt;li&gt;Var olan referans t&amp;uuml;rlerini klonlamak.&lt;/li&gt;
&lt;li&gt;Referans t&amp;uuml;rlerini metod parametrelerinde değer t&amp;uuml;r&amp;uuml; gibi kullanmak.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;1. Referans tipleri arası atamalar sonrası durumu.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Referans tipleri arasında yapılan atamalar dikkat edilmesi gereken durumlardan birisidir. &amp;Ouml;zellikle atamalar sonrası tip &amp;uuml;zerinde sahip olunan verilerde yapılacak değişiklikler diğer nesne &amp;ouml;rneklerine ait verileride doğrudan etkileyecektir. Bu tamamıyle referans tiplerinin bellek &amp;uuml;zerinde tutuluş şekliyle alakalı bir durumdur. Bu durumu analiz etmek i&amp;ccedil;in NoktaBilgisi isimli bir sınıfı ele alalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk176_1.gif" alt="" width="245" height="193" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class NoktaBilgisi
{
    private string m_Aciklama;
    public NoktaBilgisi(string aciklama)
    {
        m_Aciklama = aciklama;
    }
    public string Aciklama
    {
        get { return m_Aciklama; }
        set { m_Aciklama = value; }
    }
}&lt;/pre&gt;
&lt;p&gt;NoktaBilgisi isimli sınıfımız Aciklama isimli bir &amp;ouml;zelliğe ve bu &amp;ouml;zelliğin kullandığı m_Aciklama isimli alanı set etmekte kullanılan bir yapıcı metoda sahiptir. Bu koddaki amacımı işe yarar sınıftan &amp;ccedil;ok bir referans tipini ele almaya &amp;ccedil;alışmaktır. Console uygulamamıza ait kodlar aşağıda olduğu gibidir. İlk olarak NoktaBilgisi sınıfına ait nb1 isimli bir &amp;ouml;rnek oluşturulmaktadır. Sonrasında ise bu &amp;ouml;rnek nb2 isimiyle tanımlanmış bir NoktaBilgisi referansına eşitlenmektedir. Bu eşitleme işleminden sonra nb2 isimli &amp;ouml;rnek &amp;uuml;zerinden Aciklama isimli &amp;ouml;zelliğin değeri değiştirilir. İşte her şey bu noktadan sonra karışır. Atama sonrasında artık nesne &amp;ouml;rnekleri heap &amp;uuml;zerindeki aynı veri alanlarını işaret ettiklerinden değişiklikler istenmeyen bir sonu&amp;ccedil; doğurabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Console.WriteLine("\t Nokta 1 nesnesi oluşturulur...");
NoktaBilgisi nb1 = new NoktaBilgisi("Nokta A&amp;ccedil;ıklaması");
Console.WriteLine("\t Nokta 2 nesnesi tanımlanır ve Nokta 1 nesnesi atanır...");
NoktaBilgisi nb2 = nb1;
Console.WriteLine("\t Nokta nesneleri i&amp;ccedil;in A&amp;ccedil;ıklama bilgileri...");
Console.WriteLine("Nokta 1.A&amp;ccedil;ıklama -&amp;gt;"+nb1.Aciklama);
Console.WriteLine("Nokta 2.A&amp;ccedil;ıklama -&amp;gt;"+nb2.Aciklama);
Console.WriteLine("\t Nokta 2 nesnesi &amp;uuml;zerinde A&amp;ccedil;ıklama bilgisi değiştirilir...");
nb2.Aciklama = "Yeni A&amp;ccedil;ıklama";
Console.WriteLine("\t Nokta nesneleri i&amp;ccedil;in A&amp;ccedil;ıklama bilgileri son durum...");
Console.WriteLine("Nokta 1.A&amp;ccedil;ıklama -&amp;gt;"+nb1.Aciklama);
Console.WriteLine("Nokta 2.A&amp;ccedil;ıklama -&amp;gt;"+nb2.Aciklama);&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda elde edeceğimiz ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk176_2.gif" alt="" width="572" height="167" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat ederseniz atama işlemi sonrasında nb2 nesne &amp;ouml;rneği &amp;uuml;zerinden yapılan değişiklik nb1 nesne &amp;ouml;rneğinin i&amp;ccedil;eriğinide doğrudan etkilemiştir. Bu referans tipleri i&amp;ccedil;in zaten beklenen davranıştır. Olay aşağıdaki şekilde grafiksel olarak ifade edilmeye &amp;ccedil;alışılmıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk176_4.gif" alt="" width="440" height="121" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Ne varki NoktaBilgisi isimli sınıfımızı struct (yapı) haline getirdiğimizde &lt;em&gt;(bunu class anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; yerine struct yazarak ger&amp;ccedil;ekleştirebiliriz.)&lt;/em&gt; &amp;ccedil;ok daha farklı bir sonu&amp;ccedil;la karşılaşırız ve aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk176_3.gif" alt="" width="564" height="179" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Yapı kullanıldığında atama sonrası bellekte iki farklı NoktaBilgisi nesne &amp;ouml;rneği oluşmaktadır. Bu nedenlede nb2 nesne &amp;ouml;rneğine ait Aciklama alanında yapılan değişiklik nb1 nesnesini etkilememiştir. Olay aşağıdaki şekilde grafiksel olarak ifade edilmeye &amp;ccedil;alışılmıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk176_5.gif" alt="" width="440" height="121" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Peki gelelim &amp;ouml;nemli soruya. Yapılar arası atama sonrasında değişiklikler birbirlerini etkilemiyorlarsa, bir struct i&amp;ccedil;erisinde bir referans t&amp;uuml;r&amp;uuml; kullanıldığında durum ne olacaktır? Bu soruyu 2nci madde i&amp;ccedil;erisinde incelemeye &amp;ccedil;alışalım.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;2. Struct' lar i&amp;ccedil;erisinde referans tipleri kullanılması halinde, tipler arası atamalar sonrası durum.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Birinci maddedeki &amp;ouml;rneğimizde, NoktaBilgisi sınıfını struct olarak kullandığımızda, atama işlemi sonrasında stack bellek b&amp;ouml;lgesinde farklı kopyalar oluşturulduğunu g&amp;ouml;rm&amp;uuml;şt&amp;uuml;k. Bu da kopyalanan nesne &amp;ouml;rnekleri &amp;uuml;zerindeki değişikliklerin birbirlerini etkilemeyeceği anlamına gelmekteydi. Ancak yapılar (structs) i&amp;ccedil;erisinde referans tiplerini kullanırsak durum biraz daha farklı olacaktır. Bunun i&amp;ccedil;in aşağıdaki gibi bir yapımız (struct) olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk176_6.gif" alt="" width="239" height="270" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;struct Nokta
{
    private int m_X;
    private int m_Y;
    private NoktaBilgisi m_bilgi;

    public int X
    {
        get { return m_X; }
        set { m_X = value; }
    }

    public int Y
    {
        get { return m_Y; }
        set { m_Y = value; }
    } 

    public NoktaBilgisi Bilgi
    {
        get { return m_bilgi; }
        set { m_bilgi = value; }
    }

    public Nokta(string bilgi, int x, int y)
    {
        m_bilgi = new NoktaBilgisi(bilgi);
        m_X = x;
        m_Y = y;
    }
    public override string ToString()
    {
        return m_X.ToString() + " " + m_Y.ToString() + " " + m_bilgi.Aciklama;
    }
}&lt;/pre&gt;
&lt;p&gt;Nokta isimli yapımız (struct) herhangibir noktaya ait x ve y koordinatlarını tutacak ve konumuza &amp;ouml;rnek teşkil etmesi a&amp;ccedil;ısından i&amp;ccedil;erisinde NoktaBilgisi isimli sınıfımıza ait referans tipini kullanacak şekilde tasarlanmıştır. Şimdi teorimize ge&amp;ccedil;meden &amp;ouml;nce Nokta yapımızı Console uygulamamız i&amp;ccedil;erisinde aşağıdaki gibi kullanalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Console.WriteLine("\tNokta 1 oluşturulur...");
Nokta nokta_1 = new Nokta("Başlangı&amp;ccedil; Noktası", 10, 102);
Console.WriteLine("\tNokta 1 den Nokta 2' ye Atama yapılır...");
Nokta nokta_2 = nokta_1;
Console.WriteLine("\tNokta Nesne bilgileri...");
Console.WriteLine("Nokta 1 : \t" + nokta_1.ToString());
Console.WriteLine("Nokta 2 : \t" + nokta_2.ToString());
Console.WriteLine("\tNokta 2 i&amp;ccedil;in alanlar değiştirilir...");
nokta_2.Bilgi.Aciklama = "Yeni A&amp;ccedil;ıklama";
nokta_2.X = 18;
nokta_2.Y = 204;
Console.WriteLine("\tSon Durum");
Console.WriteLine("Nokta 1 : \t" + nokta_1.ToString());
Console.WriteLine("Nokta 2 : \t" + nokta_2.ToString());&lt;/pre&gt;
&lt;p&gt;Her zaman olduğu gibi ilk olarak nokta_1 isimli bir yapı nesnesi &amp;ouml;rneklenmekte ve sonrasında nokta_2 isimli bir yapı tanımlamasına doğru bir atama ger&amp;ccedil;ekleştirilmektedir. Atama işlemi sonrasında ise nokta_2 &amp;uuml;zerindeki &amp;uuml;yelerde bir takım değişiklikler yapmaktayız. Burada &amp;uuml;zerinde durmamız gereken nokta, NoktaBilgisi referansına ait Aciklama &amp;ouml;zelliği &amp;uuml;zerinde yapılan değişikliktir. Uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk176_7.gif" alt="" width="436" height="191" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Normal şartlar altında nokta_1 isimli yapı &amp;ouml;rneğini nokta_2 isimli yapıya aktardığımızda bellek &amp;uuml;zerinde iki farklı değişken alanı oluşturulacaktır. Dolayısıyla nokta_2 isimli nesne &amp;ouml;rneği &amp;uuml;zerinden X ve Y alanları i&amp;ccedil;in yaptığımız değişiklikerin nokta_1 nesne &amp;ouml;rneğini etkilemeyeceği ortadadır. Ancak aynı davranış bi&amp;ccedil;imi, i&amp;ccedil;eride kullandığımız NoktaBilgisi tipi i&amp;ccedil;in ge&amp;ccedil;erli olmamıştır. Bu durumu aşağıdaki grafik ile daha net canlandırabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk176_8.gif" alt="" width="431" height="219" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Olayın sebebi gayet a&amp;ccedil;ıktır. İki yapı &amp;ouml;rneği i&amp;ccedil;erisindeki m_bilgi alanları heap &amp;uuml;zerindeki aynı b&amp;ouml;lgeyi referans etmektedir. Bu atamanın bir sonucu olarak karşımıza &amp;ccedil;ıkmaktadır. &amp;Ccedil;&amp;ouml;z&amp;uuml;m olarak yapımıza IClonable aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulayabilir ve derin kopyalama (deep copy) tekniğini kullanabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;3. Var olan referans t&amp;uuml;rlerini klonlamak&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bazı durumlarda referans t&amp;uuml;rlerine ait bir nesne &amp;ouml;rneğini o anki i&amp;ccedil;eriğiyle alıp yeni bir nesne &amp;ouml;rneği olarak kullanmak, bazı değerlerini değiştirmek ama bunları yaparken atama sırasında kullanılan diğer nesneyi(nesneleri) etkilememek isteyebiliriz. Bir başka deyişle bir referans t&amp;uuml;r&amp;uuml;n&amp;uuml; klonlamak isteyebiliriz. Bu tip işlemler i&amp;ccedil;in .Net Framework i&amp;ccedil;erisinde yer alan ICloneable isimli aray&amp;uuml;z&amp;uuml;n ilgili sınıfa uyarlanması gerekmektedir. Bu durumu daha iyi analiz edebilmek i&amp;ccedil;in aşağıdaki gibi bir Dortgen sınıfımız olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk176_9.gif" alt="" width="191" height="270" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Dortgen:ICloneable
{
    private int m_En;
    private int m_Boy;

    public int En
    {
        get { return m_En; }
        set { m_En = value; }
    }
    public int Boy
    {
        get { return m_Boy; }
        set { m_Boy = value; }
    }
    public Dortgen(int en, int boy)
    {
        m_En = en;
        m_Boy = boy;
    }
    public override string ToString()
    {
        return "En : " + m_En.ToString() + " Boy : " + m_Boy.ToString();
    }
    public object Clone()
    {
        return new Dortgen(this.m_En, this.m_Boy);
    }
}&lt;/pre&gt;
&lt;p&gt;ICloneable aray&amp;uuml;z&amp;uuml; (interface) Clone isimli, parametre almayan ve geriye object tipinden değer d&amp;ouml;nd&amp;uuml;ren bir metod tanımlar. Dortgen isimli sınıfımız i&amp;ccedil;erisinde bu metodu kullanırken, o anki m_En ve m_Boy değerlerini ele alarak yeni bir Dortgen nesne &amp;ouml;rneğini geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;yoruz. Dolayısıyla &amp;ccedil;alışma zamanında, Dortgen sınıfına ait bir nesne &amp;ouml;rneğini klonlama şansına sahip oluyoruz. Aşağıdaki kod par&amp;ccedil;asında bu işlemin nasıl ger&amp;ccedil;ekleştirilebileceği g&amp;ouml;sterilmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Console.WriteLine("\t Dortgen 1 nesnesi oluşturulur...");
Dortgen drt1 = new Dortgen(10, 12);
Console.WriteLine("\t Dortgen 1 nesnesi Dortgen 2 nesnesine atanır...");
Dortgen drt2 = (Dortgen)drt1.Clone();
Console.WriteLine("\t Atama sonrası bilgiler...");
Console.WriteLine("Dortgen 1 i&amp;ccedil;in " + drt1.ToString());
Console.WriteLine("Dortgen 2 i&amp;ccedil;in " + drt2.ToString());
Console.WriteLine("\t Dortgen 2 nesnesinin eni ve boyu değiştirilir...");
drt2.En = 4;
drt2.Boy = 5;
Console.WriteLine("\t Dortgen 2 değişikliği sonrası bilgiler...");
Console.WriteLine("Dortgen 1 i&amp;ccedil;in " + drt1.ToString());
Console.WriteLine("Dortgen 2 i&amp;ccedil;in " + drt2.ToString());&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdaki sonucu alırız. G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi klonlama işleminden sonra, drt2 nesne &amp;ouml;rneği &amp;uuml;zerinde yapılan değişiklikler hi&amp;ccedil; bir şekilde drt1 nesne &amp;ouml;rneğini etkilememiştir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk176_10.gif" alt="" width="492" height="179" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Klonlama işlemi sonrası bellekte oluşan durumu aşağıdaki grafikte olduğu gibi d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk176_11.gif" alt="" width="426" height="219" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dortgen sınıfımızın i&amp;ccedil; &amp;uuml;yeleri değer t&amp;uuml;r&amp;uuml;ndendir. Bu sebepten dolayı Clone metodu i&amp;ccedil;erisinde MemberwiseClone fonksiyonu kullanılaraktan da aynı etki sağlanabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public object Clone()
{
    return this.MemberwiseClone();
}&lt;/pre&gt;
&lt;p&gt;Ancak Dortgen sınıfının başka referans tipleri i&amp;ccedil;erdiği ve kullandığı bazı durumlarda MemberwiseClone metodu tam bir klonlama işlemi ger&amp;ccedil;ekleştiremeyebilir. S&amp;ouml;z konusu durumu analiz edebilmek i&amp;ccedil;in Dortgen sınıfı i&amp;ccedil;erisinde, DortgenBilgi isimli bir referans tipi kullanacağız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class DortgenBilgi
{
    private string m_Bilgi;
    public string Bilgi
    {
        get { return m_Bilgi; }
        set { m_Bilgi = value; }
    }
    public DortgenBilgi(string bilgi)
    {
        m_Bilgi = bilgi;
    }
}&lt;/pre&gt;
&lt;p&gt;Dortgen sınıfı i&amp;ccedil;erisindede aşağıdaki değişiklikleri yapalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Dortgen:ICloneable
{
    private int m_En;
    private int m_Boy;
    public DortgenBilgi DortgenBilgisi=new DortgenBilgi("D&amp;ouml;rtgen");

    public int En
    {
        get { return m_En; }
        set { m_En = value; }
    }
    public int Boy
    {
        get { return m_Boy; }
        set { m_Boy = value; }
    }
    public Dortgen(int en, int boy,string bilgi)
    {
        m_En = en;
        m_Boy = boy;
        DortgenBilgisi.Bilgi = bilgi;
    }
    public override string ToString()
    {
        return "En : " + m_En.ToString() + " Boy : " + m_Boy.ToString() + " " + DortgenBilgisi.Bilgi ;
    }
    public object Clone()
    {
        return this.MemberwiseClone();
    }
}&lt;/pre&gt;
&lt;p&gt;Dortgen sınıfımız i&amp;ccedil;erisinde mızık&amp;ccedil;ılık yapacak olan ve klonlama işleminde sorun &amp;ccedil;ıkartacak olan &amp;uuml;ye DortgenBilgi isimli alandır. Console uygulamamıza ait kodlarımızıda son olarak aşağıdaki gibi tamamlayalım. Bu sefer drt2 nesne &amp;ouml;rneği &amp;uuml;zerinden DortgenBilgisi referansına gidiyor ve Bilgi isimli alanın değerini değiştiriyoruz. Yukarıdaki satırlarda Clone metodunu kullandığımız i&amp;ccedil;in beklentimiz, Bilgi alanındaki değişikliğin drt1 nesnesini etkilememesi olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Console.WriteLine("\t Dortgen 1 nesnesi oluşturulur...");
Dortgen drt1 = new Dortgen(10, 12,"Dikd&amp;ouml;rtgen");
Console.WriteLine("\t Dortgen 1 nesnesi Dortgen 2 nesnesine atanır...");
Dortgen drt2 = (Dortgen)drt1.Clone();
Console.WriteLine("\t Atama sonrası bilgiler...");
Console.WriteLine("Dortgen 1 i&amp;ccedil;in " + drt1.ToString());
Console.WriteLine("Dortgen 2 i&amp;ccedil;in " + drt2.ToString());
Console.WriteLine("\t Dortgen 2 nesnesinin eni ve boyu değiştirilir...");
drt2.En = 4;
drt2.Boy = 4;
drt2.DortgenBilgisi.Bilgi = "Kare"; 
Console.WriteLine("\t Dortgen 2 değişikliği sonrası bilgiler...");
Console.WriteLine("Dortgen 1 i&amp;ccedil;in " + drt1.ToString());
Console.WriteLine("Dortgen 2 i&amp;ccedil;in " + drt2.ToString());&lt;/pre&gt;
&lt;p&gt;Oysaki uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk176_12.gif" alt="" width="500" height="179" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi drt2 nesnesi &amp;uuml;zerinden DortgenBilgisi referansına ait Bilgi &amp;ouml;zelliğinin değeri değiştirildiğinde aynı etki drt1 i&amp;ccedil;inde meydana gelmiştir. Dolayısıyla Clone metodu tam olarak işlevini yerine getirmemiştir. Bunun sebebi Clone metodu i&amp;ccedil;erisinde kullanılan MemberwiseClone metodunun referans tipi i&amp;ccedil;in adres kopyalaması ger&amp;ccedil;ekleştirmiş olmasıdır. &amp;Ccedil;&amp;ouml;z&amp;uuml;m olarak Clone metodu i&amp;ccedil;erisinde Dortgen sınıfına ait bir nesne &amp;ouml;rneği, o anki değerleri ile tekrardan &amp;ouml;rneklenip geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;return new Dortgen(this.m_En, this.m_Boy,this.DortgenBilgisi.Bilgi);&lt;/pre&gt;
&lt;p&gt;Uygulamayı bu haliyle &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz. G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi bu sefer tam anlamıyla bir derinlemesine kopylama işlemi ger&amp;ccedil;ekleşmiştir. &lt;em&gt;(Dortgen sınıfı i&amp;ccedil;in kullandığımız bu klonlama tekniğini 2nci maddede kullandığımız Nokta yapısı i&amp;ccedil;inde kullanabiliriz.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk176_13.gif" alt="" width="492" height="179" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Aynı etkiyi aşağıdaki kod par&amp;ccedil;asında olduğu gibide sağlayabiliriz. Bu tekniğie g&amp;ouml;re, MemberwiseClone metodu ile g&amp;uuml;ncel Dortgen referansının t&amp;uuml;m değer t&amp;uuml;rleri sağlıklı bir şekilde alınmaktadır. Sonrasında ise bir DortgenBilgi sınıfına ait nesne &amp;ouml;rneği oluşturulmakta ve i&amp;ccedil;eriği g&amp;uuml;ncel Dortgen nesne &amp;ouml;rneği &amp;uuml;zerinden alınmaktadır ki burada s&amp;ouml;z konusu olan i&amp;ccedil;erik Bilgi isimli alandır. Son olarakta Dortgen sınıfına ait yeni nesne referansı metoddan geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Dortgen drt = (Dortgen)this.MemberwiseClone();
DortgenBilgi blg = new DortgenBilgi("");
blg.Bilgi = this.DortgenBilgisi.Bilgi;
drt.DortgenBilgisi = blg;
return drt;&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;4. Referans t&amp;uuml;rlerini metod parametrelerinde değer t&amp;uuml;r&amp;uuml; gibi kullanmak.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bildiğiniz gibi değer t&amp;uuml;rlerini (value types) metodlara referans t&amp;uuml;r&amp;uuml; olarak olarak ge&amp;ccedil;irebilmekteyiz. Bunun i&amp;ccedil;in ref ve out anahtar s&amp;ouml;zc&amp;uuml;klerinden yararlanmaktayız. Lakin bazı durumlarda referans t&amp;uuml;rlerini metodlara değer t&amp;uuml;r&amp;uuml; gibi ge&amp;ccedil;irmekde isteyebiliriz. Bu daha &amp;ccedil;ok, metod i&amp;ccedil;erisinde gelen referans &amp;uuml;zerinde yapılacak değişikliklerin orjinal referansı değiştirmesini istemediğimiz durumlarda işe yarayacak bir yoldur. Konuyu daha net anlayabilmek i&amp;ccedil;in NoktaBilgisi isimli sınıfımıza ait referansı parametre olarak kullanan aşağıdaki metoda sahip olduğumuzu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void NoktaDegistir(NoktaBilgisi noktaBlg)
{
    Console.WriteLine("\t Metod i&amp;ccedil;erisi...A&amp;ccedil;ıklama değiştirilir...");
    noktaBlg.Aciklama = "Yeni A&amp;ccedil;ıklama";
}&lt;/pre&gt;
&lt;p&gt;NoktaDegistir isimli metodumuz NoktaBilgisi tipinden aldığı parametre &amp;uuml;zerinden Aciklama alanının değerini değiştirmektedir. Uygulamamıza ait Main metodu i&amp;ccedil;erisinde ise aşağıdaki kodları yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Console.WriteLine("\t NoktaBilgisi Oluşturulur...");
NoktaBilgisi bilgi = new NoktaBilgisi("&amp;Ouml;zel M&amp;uuml;lk");
Console.WriteLine("Bilgi : " + bilgi.Aciklama);
Console.WriteLine("\t Metod &amp;ccedil;ağırılır ve Bilgi nesnesi metoda aktarılır...");
NoktaDegistir(bilgi);
Console.WriteLine("Bilgi : " + bilgi.Aciklama);&lt;/pre&gt;
&lt;p&gt;Uygulamamızı bu haliyle &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz. G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi metod i&amp;ccedil;erisinde yapılan değişiklik otomatik olarak orjinal konumdaki nesne &amp;ouml;rneğinide etkilemiştir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk176_14.gif" alt="" width="532" height="131" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi NoktaDegistir isimli metod i&amp;ccedil;eriğini aşağıdaki gibi değiştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void NoktaDegistir(NoktaBilgisi noktaBlg)
{ 
    noktaBlg = new NoktaBilgisi("Yeni A&amp;ccedil;ıklama");
    // noktaBlg &amp;uuml;zerinden istenilen diğer işlemler ger&amp;ccedil;ekleştirilir.
}&lt;/pre&gt;
&lt;p&gt;Bu kez gelen parametreyi i&amp;ccedil;eride bizzat &amp;ouml;rneklemekteyiz.&lt;em&gt;(new ile yeni bir &amp;ouml;rneğini oluşturmaktayız)&lt;/em&gt; Bu durumda uygulamamızı yeninden &amp;ccedil;alıştıracak olursak NoktaDegistir metodu i&amp;ccedil;erisinde yapılan değişikliğin Main metodu i&amp;ccedil;erisinde yer alan NoktaBilgisi nesne &amp;ouml;rneği &amp;uuml;zerinde bir etki yapmadığını g&amp;ouml;rebiliriz. Dolayısıyla orjinal konumdaki nesne &amp;ouml;rneğinin i&amp;ccedil;eriğini koruyabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk176_15.gif" alt="" width="524" height="107" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu makalemizde referans tiplerini daha yakından incelemeye &amp;ccedil;alıştık. Referans tipleri arası atamaların sonucundan yola &amp;ccedil;ıkarak, struct lar i&amp;ccedil;erisinde referans t&amp;uuml;rlerini kullanmamız halinde neler olabileceğine baktık. Ayrıca bir referans tipinin tam bir kopyasının nasıl &amp;ccedil;ıkarılabileceğini ve bunu yaparkende ICloneable aray&amp;uuml;z&amp;uuml;n&amp;uuml;n nasıl kullanılabileceğini incelemeye &amp;ccedil;alıştık. Son olarakta bir referans tipini herhangibir metoda bir değer t&amp;uuml;r&amp;uuml; olarak nasıl alabileceğimizi g&amp;ouml;rd&amp;uuml;k. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/UsingReferenceTypes.rar"&gt;&amp;Ouml;rnek Uygulama İ&amp;ccedil;in Tıklayın.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2006-10-02 06:00:00</pubDate>
  <slug>C#-Temelleri-:-Referans-Tipi-Olmak-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>stacktrace</tag>
    <tag>heap</tag>
    <tag>memory-management</tag>
    <tag>garbage-collection</tag>
    <tag>referance-types</tag>
    <tag>value-types</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>