<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF RIA Services - Authentication Domain Service - Attribute Bazlı Yetkilendirme [Beta 2]</title>
  <description>Bildiğiniz üzere bir süredir WCF RIA Service' lerinde doğrulama(Authentication), yetkilendirme(Authorization), Role ve Profile yönetimi konularına değinmekteyiz. WCF RIA Service' lerinin temel amaçlarından birisininde RIA tipindeki uygulamalar için Ado.Net Entity Framework gibi kaynaklar üzerinden CRUD(CreateReadUpdateDelete) operasyonlarını sağlanması olduğu düşünüldüğünde, servis fonksiyonelliklerinin yetkilendirilmeside güvenlik açısından önem arz eden konuların başında gelmektedir. Bu konu, WCF RIA Service' lerinde nitelikler(Attributes) yardımıyla ele alınabilmektedir.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f12%2fblg115_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bildiğiniz &amp;uuml;zere bir s&amp;uuml;redir&lt;strong&gt; WCF RIA Service'&lt;/strong&gt; lerinde &lt;strong&gt;doğrulama(Authentication), yetkilendirme(Authorization), Role &lt;/strong&gt;ve &lt;strong&gt;Profile &lt;/strong&gt;y&amp;ouml;netimi konularına değinmekteyiz.&amp;nbsp;&lt;strong&gt;WCF RIA Service'&lt;/strong&gt; lerinin temel ama&amp;ccedil;larından birisininde &lt;strong&gt;RIA&lt;/strong&gt; tipindeki&amp;nbsp;uygulamalar i&amp;ccedil;in &lt;strong&gt;Ado.Net Entity Framework&lt;/strong&gt; gibi kaynaklar &amp;uuml;zerinden&amp;nbsp;&lt;strong&gt;CRUD(CreateReadUpdateDelete)&lt;/strong&gt; operasyonlarını sağlanması olduğu d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde, servis fonksiyonelliklerinin yetkilendirilmeside&amp;nbsp;g&amp;uuml;venlik a&amp;ccedil;ısından &amp;ouml;nem arz eden konuların başında gelmektedir. Bu konu, &lt;strong&gt;WCF RIA Service'&lt;/strong&gt; lerinde &lt;strong&gt;nitelikler(Attributes)&lt;/strong&gt; yardımıyla ele alınabilmektedir.&lt;/p&gt;
&lt;p&gt;Bu noktada iki &amp;ouml;nemli niteliğin olduğunu s&amp;ouml;yleyebiliriz. Bunlardan birisi&lt;strong&gt; Domain Service&lt;/strong&gt; sınıfının &lt;strong&gt;Authentication&lt;/strong&gt; işlemleri &amp;ccedil;er&amp;ccedil;evesinde değerlendirilmesi gerektiğini&amp;nbsp;&amp;ccedil;alışma zamanına s&amp;ouml;yleyen &lt;strong&gt;RequiresAuthentication &lt;/strong&gt;niteliğidir. Bu niteliği &lt;strong&gt;Domain Service&lt;/strong&gt; tipine uygulamak yeterlidir. Diğer taraftan&lt;strong&gt;, Domain Service&lt;/strong&gt; i&amp;ccedil;erisinde tanımlanmış olan operasyonların hangi yetkiler altında &amp;ccedil;alıştırılabileceğini belirtmek i&amp;ccedil;in &lt;strong&gt;RequiresRole&lt;/strong&gt; isimli nitelikten yararlanılmaktadır. &lt;strong&gt;RequiresRole&lt;/strong&gt; niteliği &lt;strong&gt;string&lt;/strong&gt; tipinde birden fazla parametre alabilmektedir. Bu parametre değerleri tahmin edileceği &amp;uuml;zere rolleri ifade etmektedir. Bu teoriye g&amp;ouml;re bir&lt;strong&gt; Domain Service&lt;/strong&gt; operasyonunun rol bazlı olaraktan yetki altında &amp;ccedil;alıştırılmasının sağlanması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;Tabi teoride bahsettiğimiz bu kavramları pratiğe d&amp;ouml;kmemiz bizim i&amp;ccedil;in &amp;ouml;nemlidir. Bu nedenle yazımızın bundan sonraki kısmında basit olarak Chinook veritabanındaki kobay tablolarımızdan olan &lt;strong&gt;Album&lt;/strong&gt; i&amp;ccedil;eriğine ulaşmak i&amp;ccedil;in kullanılan bir operasyon &amp;uuml;zerinde, rol bazlı yetkilendirme işlemlerini nasıl uygulayabileceğimizi incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;Kişisel Not :&lt;/strong&gt; Başlamadan &amp;ouml;nce &lt;strong&gt;Silverlight&lt;/strong&gt; uygulamasında daha &amp;ouml;nceki yazılarda sıklıkla anlattığımız şekilde &lt;strong&gt;Form bazlı doğrulama(Form-Based&amp;nbsp;Authentication)&amp;nbsp;&lt;/strong&gt;i&amp;ccedil;in gerekli ayarları yapmamız gerektiğini hatırlatalım. &amp;Ouml;zellikle &lt;strong&gt;role &lt;/strong&gt;y&amp;ouml;netimini etkinleştirmemiz gerektiğini ve hem sunucu hemde istemci tarafında gerekli konfigurasyon ve kod ayarlarını uygulamamız gerektiğini unutmayalım. &amp;Ouml;rneğimizde yine &lt;strong&gt;buraks&lt;/strong&gt; ve &lt;strong&gt;bill &lt;/strong&gt;isimli kullanıcıları değerlendiriyor olacağız. Bunlardan birisi &lt;strong&gt;Employee&lt;/strong&gt; rol&amp;uuml;nde iken diğeri &lt;strong&gt;Finance&lt;/strong&gt; rol&amp;uuml;ndedir. Ama&amp;ccedil;lanan sadece &lt;strong&gt;Finance&lt;/strong&gt; rol&amp;uuml;ndekilerin, alb&amp;uuml;m listesini &amp;ccedil;ekebilmesini sağlamaktır. Tabiki &lt;strong&gt;Chinook&lt;/strong&gt; isimli veritabanını &lt;strong&gt;Silverlight&lt;/strong&gt; uygulamasında kullanabilmek i&amp;ccedil;in gerekli &lt;strong&gt;Domain Service(ChinookDomainService)&lt;/strong&gt; &amp;ouml;ğesinide eklememiz gerektiğini hatırlatmak isterim. Pek &amp;ccedil;ok hatırlatmada bulundum ama &amp;ouml;nceki yazıları takip edip uygulayan arkadaşlarımız i&amp;ccedil;in &amp;ouml;rneği bu aşamaya getirmek son derece kolay olacaktır d&amp;uuml;ş&amp;uuml;ncesindeyim &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Gelelim &amp;ouml;rneğimize. İlk olarak durumu kuş bakışı değerlendirmeye &amp;ccedil;alışalım. Buna g&amp;ouml;re aşağıdaki şekli g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg115_Case.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şekildende g&amp;ouml;r&amp;uuml;leceği &amp;uuml;zere sunucu uygulama tarafında &lt;strong&gt;Chinook&lt;/strong&gt; veritabanına ulaşılmasını ve &amp;uuml;zerinde &lt;strong&gt;CRUD&lt;/strong&gt; işlemleri yapılabilmesini sağlayan&lt;em&gt;(ki bu &amp;ouml;rnekte sadece veri &amp;ccedil;ekiyor olacağız)&amp;nbsp;&lt;/em&gt;&lt;strong&gt;ChinookDomainService&lt;/strong&gt; isimli &lt;strong&gt;Domain Service&lt;/strong&gt; tipi bulunmaktadır. Bu tip arada &lt;strong&gt;Ado.Net Entity Framework&lt;/strong&gt; modelini kullanmaktadır. Diğer taraftan doğrulama işlemleri i&amp;ccedil;in &lt;strong&gt;ASP.NET Membership&lt;/strong&gt; alt yapısı kullanılmakta olup istemci tarafının bu hizmeti değerlendirebilmesi i&amp;ccedil;in birde &lt;strong&gt;Authentication Domain Service(ChinookDomainService)&lt;/strong&gt; &amp;ouml;ğesi yer almaktadır. İstemci tarafı veri ve g&amp;uuml;venlik işlemleri i&amp;ccedil;in bu iki servisten yararlanacaktır. &amp;Ouml;nemli olan noktalardan biriside&amp;nbsp;hangi operasyonu nasıl yetkilendireceğimizi bilmektir. Bu noktada &lt;strong&gt;ChinookDomainService&lt;/strong&gt; sınıfını aşağıdaki şekilde oluşturduğumuzu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace SilverlightApplication8.Web
{
    using System.Linq;
    using System.Web.DomainServices;
    using System.Web.DomainServices.Providers;
    using System.Web.Ria;

    [RequiresAuthentication] // Servis operasyonlarında Authentication uygulanacağını belirtiyoruz.
    [EnableClientAccess()]
    public class ChinookDomainService : LinqToEntitiesDomainService&amp;lt;ChinookEntities&amp;gt;
    {
        [RequiresRole("Finance")] // Sadece Finance rol&amp;uuml;ndekilerin aşağıdaki operasyonu kullanabileceğini belirtmekteyiz.
        public IQueryable&amp;lt;Album&amp;gt; GetAlbums(int artistId)
        {
            // &amp;Ouml;rnek olarak ArtistId bilgisine g&amp;ouml;re alb&amp;uuml;m listesini Title bilgisine g&amp;ouml;re A...Z sırasında d&amp;ouml;nd&amp;uuml;r&amp;uuml;yoruz
            return from a in ObjectContext.Albums
                   where a.ArtistId == artistId
                   orderby a.Title
                   select a;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;ChinookDomainService&lt;/strong&gt; tipine &lt;strong&gt;RequiresAuthentication&lt;/strong&gt; niteliği uygulanmıştır. Bununla birlikte sadece &lt;strong&gt;Finance&lt;/strong&gt; rol&amp;uuml;ndekilerin kullanımına sunulan &lt;strong&gt;GetAlbums&lt;/strong&gt; isimli bir operasyon yer almaktadır. Yazımızın başında da belirttiğimiz &amp;uuml;zere &lt;strong&gt;RequiresRole&lt;/strong&gt; niteliğine parametre olarak birden fazla rol adı verilebilir. Sunucu tarafında rol bazlı yetkilendirme i&amp;ccedil;in yapmamız gerekenler sadece bu kadardır. Gelelim istemci tarafına. Bu ama&amp;ccedil;la &lt;strong&gt;MainPage.xaml&lt;/strong&gt; i&amp;ccedil;eriğini ve kod kısmını aşağıdaki gibi geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;MainPage.xaml;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg115_MainPage.gif" alt="" /&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;UserControl x:Class="SilverlightApplication8.MainPage"
    xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation"
    xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml"
    xmlns:d="http://schemas.microsoft.com/expression/blend/2008"
    xmlns:mc="http://schemas.openxmlformats.org/markup-compatibility/2006"
    mc:Ignorable="d"
    d:DesignHeight="300" d:DesignWidth="400" xmlns:data="clr-namespace:System.Windows.Controls;assembly=System.Windows.Controls.Data" xmlns:dataInput="clr-namespace:System.Windows.Controls;assembly=System.Windows.Controls.Data.Input"&amp;gt;

    &amp;lt;Grid x:Name="LayoutRoot" Background="White"&amp;gt;
        &amp;lt;Button Content="Load Albums" Height="23" HorizontalAlignment="Left" Margin="305,18,0,0" Name="btnLoadAlbums" VerticalAlignment="Top" Width="83" Click="btnLoadAlbums_Click" /&amp;gt;
        &amp;lt;data:DataGrid AutoGenerateColumns="True" Height="105" HorizontalAlignment="Left" Margin="10,87,0,0" Name="grdAlbums" VerticalAlignment="Top" Width="378" /&amp;gt;
        &amp;lt;dataInput:Label Height="80" HorizontalAlignment="Left" Margin="10,208,0,0" Name="lblStatus" VerticalAlignment="Top" Width="378" Content="Olası hata mesajı..." /&amp;gt;
        &amp;lt;dataInput:Label Height="28" HorizontalAlignment="Left" Margin="12,18,0,0" Name="label1" VerticalAlignment="Top" Width="59" Content="Username" /&amp;gt;
        &amp;lt;TextBox Height="23" HorizontalAlignment="Left" Margin="77,18,0,0" Name="txtUsername" VerticalAlignment="Top" Width="120" /&amp;gt;
        &amp;lt;dataInput:Label Height="28" HorizontalAlignment="Left" Margin="14,54,0,0" Name="label2" VerticalAlignment="Top" Width="57" Content="Password" /&amp;gt;
        &amp;lt;PasswordBox Height="23" HorizontalAlignment="Left" Margin="77,54,0,0" Name="txtPassword" VerticalAlignment="Top" Width="120" /&amp;gt;
        &amp;lt;Button Content="Login" Height="23" HorizontalAlignment="Left" Margin="203,18,0,0" Name="btnLogin" VerticalAlignment="Top" Width="82" Click="btnLogin_Click" /&amp;gt;
        &amp;lt;Button Content="Logout" Height="23" HorizontalAlignment="Left" Margin="203,54,0,0" Name="btnLogout" VerticalAlignment="Top" Width="82" Click="btnLogout_Click" /&amp;gt;
    &amp;lt;/Grid&amp;gt;
&amp;lt;/UserControl&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;MainPage.xaml.cs;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Ria;
using System.Windows.Ria.ApplicationServices;
using SilverlightApplication8.Web;

namespace SilverlightApplication8
{
    public partial class MainPage : UserControl
    {
        // DomainContext ve AuthenticationService kullanımı i&amp;ccedil;in gerekli &amp;ouml;rnekler
        ChinookDomainContext context;
        AuthenticationService authSrv;

        public MainPage()
        {
            InitializeComponent();

            btnLoadAlbums.IsEnabled = false;
            btnLogout.IsEnabled = false;
            
            context = new ChinookDomainContext();
            authSrv = WebContext.Current.Authentication;

            // Login işlemi olduğunda devreye girecek olay metodu y&amp;uuml;klenir
            authSrv.LoggedIn += new EventHandler&amp;lt;AuthenticationEventArgs&amp;gt;(authSrv_LoggedIn);
            // Logout işlemi tamamlandığında devreye girecek olay metodu y&amp;uuml;klenir
            authSrv.LoggedOut += new EventHandler&amp;lt;AuthenticationEventArgs&amp;gt;(authSrv_LoggedOut);
        }

        private void btnLogin_Click(object sender, RoutedEventArgs e)
        {
            // Login işlemi yapılır
            LoginOperation logOp = authSrv.Login(new LoginParameters(txtUsername.Text, txtPassword.Password));
        }

        private void btnLogout_Click(object sender, RoutedEventArgs e)
        {
            // Logout işlemi yapılır. Hata var ise exception fırlatılması sağlanır
            authSrv.Logout(true);
        }

        void authSrv_LoggedIn(object sender, AuthenticationEventArgs e)
        {
            // Login olan kullanıcı i&amp;ccedil;in g&amp;uuml;ncel User bilgileri alınır
            Web.User currentUser = WebContext.Current.User;
            // Kullanıcının dahil olduğu roller ve adı bilgilendirme ama&amp;ccedil;lı &amp;ouml;ğrenilir
            string roles=String.Empty;            
            foreach (var role in currentUser.Roles)
            {
                roles += String.Format("{0}|", role);
            }
            lblStatus.Content =String.Format("Kullanıcı {0} Rolleri : {1}",currentUser.Name,roles);
            
            btnLoadAlbums.IsEnabled = true;
            btnLogout.IsEnabled = true;
            btnLogin.IsEnabled = false;
        }

        void authSrv_LoggedOut(object sender, AuthenticationEventArgs e)
        {
            btnLogout.IsEnabled = false;
            btnLoadAlbums.IsEnabled = false;
            btnLogin.IsEnabled = true;
        }

        private void btnLoadAlbums_Click(object sender, RoutedEventArgs e)
        {   
            // Login olunduktan sonra Album listesinin y&amp;uuml;klenmesi aşamasına ge&amp;ccedil;ilir.
            // DomainService &amp;uuml;zerinde yer alan GetAlbums operasyonundaki role gerekliliği nedeni ile sadece Finance rol&amp;uuml; i&amp;ccedil;in y&amp;uuml;kleme yapıldığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r. Aksi durumda ise bir &amp;ccedil;alışma zamanı hatası oluşacak ve script error olarak tarayıcı &amp;uuml;zerinde g&amp;ouml;r&amp;uuml;lecektir.
            LoadOperation&amp;lt;Album&amp;gt; op = context.Load&amp;lt;Album&amp;gt;(context.GetAlbumsQuery(1));
            grdAlbums.ItemsSource = op.Entities;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Aslında istemci tarafında yapılan tek şey kullanıcının &lt;strong&gt;Login&lt;/strong&gt; ve &lt;strong&gt;Logout&lt;/strong&gt; olmasını sağlayacak operasyonlar ile &amp;ouml;rnek olması a&amp;ccedil;ısından 1 numaralı şarkıcıya ait alb&amp;uuml;m listesinin &amp;ccedil;ekilmesini sağlamaktır. Dikkat edileceği &amp;uuml;zere yetkilendirme kontrol&amp;uuml; istemci tarafında yapılamamaktadır. Bu kontrol sunucu tarafında &amp;ccedil;alışma zamanı tarafından ele alınan&lt;strong&gt; Domain Service&lt;/strong&gt; sınıfı &amp;uuml;zerinden ele alınmaktadır. Buna g&amp;ouml;re &lt;strong&gt;Login&lt;/strong&gt; olan ge&amp;ccedil;erli kullanıcının &lt;strong&gt;Finance&lt;/strong&gt; rol&amp;uuml;nde olmaması halinde alb&amp;uuml;m bilgilerini &lt;span style="text-decoration: underline;"&gt;getirememesi&lt;/span&gt; gerekmektedir ki bu ger&amp;ccedil;ektende b&amp;ouml;yledir. İşte yetkisiz bir kullanıcının alb&amp;uuml;mleri y&amp;uuml;klemek istemesi halinde &amp;ccedil;alışma zamanında oluşacak durum;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg115_Error.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hata mesajında yer alan &lt;strong&gt;Access Denied&lt;/strong&gt; kelimeleri olayı t&amp;uuml;m &amp;ccedil;ıplaklığıyla &amp;ouml;zetlemektedir. Diğer yandan senaryomuza g&amp;ouml;re &lt;strong&gt;Finance&lt;/strong&gt; rol&amp;uuml;nde yer alan &lt;strong&gt;bill&lt;/strong&gt; isimli kullanıcı ile &lt;strong&gt;Login&lt;/strong&gt; olunup alb&amp;uuml;m listesi &amp;ccedil;ekilmek istendiğinde, bilgilerin başarılı bir şekilde &lt;strong&gt;DataGrid&lt;/strong&gt; kontrol&amp;uuml;ne &amp;ccedil;ekildiği g&amp;ouml;zlemlenir. Aynen aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg115_AuthorizationOk.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabi bu yazımızda yetkilendirme nedeniyle oluşan istisna durumu ele kontrol altına alınmamıştır. Uygulama bu istisna ile karşılaştığında sonlandırılmaktadır ve hata mesajı &lt;strong&gt;script error&lt;/strong&gt; olarak tarayıcı uygulama &amp;uuml;zerinden yakalanmaktadır. Ancak en basit haliyle &lt;strong&gt;attribute&lt;/strong&gt; bazlı olaraktan yetkilendirme işlemi sunucu tarafında yer&amp;nbsp;alan servisler kanalıyla&amp;nbsp;ger&amp;ccedil;ekleştirilebilmiştir. Bu noktada vurgulanması gereken durumlardan biriside kendi &lt;strong&gt;Authorization&lt;/strong&gt; &lt;strong&gt;niteliklerimizi(Attribute)&lt;/strong&gt; yazabileceğimizdir. S&amp;ouml;z gelimi role g&amp;ouml;re değil ama başka bir kritere g&amp;ouml;re yetkilendirme yapmak isteyebiliriz. Bu durumu ilerleyen yazılarımızda ele almaya &amp;ccedil;alışıyor olacağım. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;</content>
  <pubDate>2010-01-22 00:45:00</pubDate>
  <slug>WCF-RIA-Services-Authentication-Domain-Service-Attribute-Bazli-Yetkilendirme-(Attribute-Based-Authorization)</slug>
  <tags>
    <tag>wcf-ria-services</tag>
    <tag>net-ria-services</tag>
    <tag>wcf</tag>
    <tag>wcf-eco-system</tag>
  </tags>
  <categories>
    <category>WCF Eco System</category>
    <category>WCF RIA Services</category>
  </categories>
</post>