<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF 4.0 Yenilikleri - Routing Service - MatchAll Filtresi [Beta 1]</title>
  <description>Bundan önceki yazılarımızda WCF 4.0 için yönlendirme servislerinin(Router Service) nasıl yazılabileceğini incelemeye çalışmıştık. Fark edeceğiniz üzere yönlendirme servislerinin en önemli noktaları arasında filtreleme tablosu ve filtrelerin olduğunu gördük...</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f8%2fblg75_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bundan &amp;ouml;nceki yazılarımızda&lt;strong&gt; WCF 4.0&lt;/strong&gt; i&amp;ccedil;in &lt;strong&gt;y&amp;ouml;nlendirme servislerinin(Router&amp;nbsp;Service)&lt;/strong&gt;&amp;nbsp;nasıl yazılabileceğini incelemeye &amp;ccedil;alışmıştık. Fark edeceğiniz &amp;uuml;zere y&amp;ouml;nlendirme servislerinin en &amp;ouml;nemli noktaları arasında filtreleme tablosu ve filtrelerin olduğunu g&amp;ouml;rd&amp;uuml;k. Bununla birlikte sadece &lt;strong&gt;Action&lt;/strong&gt; tipinde bir filtreleme kullanıp, istemciden gelen &lt;strong&gt;SOAP&lt;/strong&gt; paketinin &lt;strong&gt;Action&lt;/strong&gt; kısmından yararlanılarak bir y&amp;ouml;nlendirme yapılmasını inceledik.&lt;/p&gt;
&lt;p&gt;Oysaki filtreleme tipi olarak &lt;strong&gt;Action&lt;/strong&gt; dışında, &lt;strong&gt;Address, AddressPrefix, StrictAnd, EndpointName, MatchAll, XPath &lt;/strong&gt;gibi se&amp;ccedil;eneklerimiz de bulunmaktadır. İşte bu yazımızda &lt;strong&gt;MatchAll&lt;/strong&gt; se&amp;ccedil;eneğini incelemeye &amp;ccedil;alışıyor olacağız. &lt;strong&gt;MatchAll&lt;/strong&gt; se&amp;ccedil;eneğine g&amp;ouml;re, istemciden gelen mesajın i&amp;ccedil;eriği ne olursa olsun, s&amp;ouml;z konusu talebin tanımlanan birden fazla &lt;strong&gt;DownStream&lt;/strong&gt; servise y&amp;ouml;nlendirilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Ancak &amp;ouml;nemli bir kısıtlama vardır.&lt;/p&gt;
&lt;p&gt;Bu kısıtlamaya g&amp;ouml;re sadece &lt;strong&gt;One-Way &lt;/strong&gt;veya &lt;strong&gt;Duplex &lt;/strong&gt;modeldeki &lt;strong&gt;iletişim(Communication)&lt;/strong&gt; desteklenir. Dolayısıyla &lt;strong&gt;Request/Reply&lt;/strong&gt; modelde olan&amp;nbsp;iletişimi ele alan tipleri y&amp;ouml;nlendirme servisi &amp;uuml;zerinde kullanamayız. Bu kısıtlamaya rağmen bazı senaryolarda&lt;em&gt;(&amp;ouml;rneğin asenkron modellerde),&lt;/em&gt; istemciden gelen talebin birden fazla &lt;strong&gt;DownStream' &lt;/strong&gt;e aktarılmasının &lt;strong&gt;WCF 4.0&lt;/strong&gt; ile gelen &amp;ouml;zellikler sayesinde kolaylaştırılmış olması, geliştiriciler a&amp;ccedil;ısından olduk&amp;ccedil;a heyecan vericidir.&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;yleyse vakit kaybetmeden basit bir &amp;ouml;rnek &amp;uuml;zerinden ilerlemeye ne dersiniz. Ben yazıyı gecenin ge&amp;ccedil; bir vaktinde yazdığım i&amp;ccedil;in yanımda&amp;nbsp;bir adet sıcak kahveyi bulundurmayı ihmal etmedim. &lt;img title="Cool" src="/editors/tiny_mce3/plugins/emotions/img/smiley-cool.gif" alt="Cool" border="0" /&gt;&amp;nbsp;&amp;Ouml;rnek senaryomuzda aynı &lt;strong&gt;servis s&amp;ouml;zleşmesini(Service Contract)&lt;/strong&gt; implemente eden 3 farklı alt servisimiz bulunmaktadır. &lt;strong&gt;Router Service&lt;/strong&gt;, istemciden gelen talebi alıp ne olduğu ile ilgilenmeden doğrudan bu 3 servise aktarma işlemini &amp;uuml;stlenmektedir. Dolayısıyla ispat etmemiz gereken noktalardan birisi, istemciden gelen talebin sonrasında operasyonun 3 servis &amp;uuml;zerinde de &amp;ccedil;alışıyor olmasıdır. &lt;strong&gt;OneWay&lt;/strong&gt; veya &lt;strong&gt;Duplex&lt;/strong&gt; kısıtlamasından dolayı biz &amp;ouml;rneğimizde &lt;strong&gt;OneWay&lt;/strong&gt; olarak imzalanmış basit bir servis operasyonu kullanıyor olacağız. &amp;Ouml;ncelikle &amp;ouml;rneğimize ait mimari modelimize bir g&amp;ouml;z atalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg75_Architecture.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere sadece &lt;strong&gt;Endpoint&lt;/strong&gt; tanımlamaları a&amp;ccedil;ısından farklı olan&lt;em&gt;(ve ger&amp;ccedil;ek hayat senaryolarında istenirse farklı makinelerde bulunabilecek olan)&lt;/em&gt; ama aynı s&amp;ouml;zleşmeyi uygulayan&lt;strong&gt; 3 Downstream&lt;/strong&gt; servisimiz bulunmaktadır. Servislerimizin uyguladığı s&amp;ouml;zleşme aşağıdaki kod par&amp;ccedil;asında olduğu gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ServiceModel;
using System.Runtime.Serialization;

namespace AdventureContracts
{
    [ServiceContract(Namespace="http://adventure/productService")]
    public interface IAdventureContract
    {
        [OperationContract(IsOneWay=true)]
        void ProcessProduct(Product product);
    }

    [DataContract]
    public class Product
    {
        [DataMember]
        public int ProductId { get; set; }
        [DataMember]
        public string Name { get; set; }
        [DataMember]
        public double ListPrice { get; set; }
        [DataMember]
        public int Amount { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Servislerimizin &amp;uuml;&amp;ccedil;&amp;uuml;n&amp;uuml;n kodlarını burada ayrı ayrı yazmamıza gerek olmadığını d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Nitekim hem odaklanmamız gereken nokta &lt;strong&gt;Router&lt;/strong&gt; servis tarafıdır hemde yazımızın okunurluğunun zorlaşmaması gerekmektedir. Tabiki &amp;ouml;rneği indirip incelemenizi şiddetle &amp;ouml;neririm. Gelelim y&amp;ouml;nlendirme servisimize. Y&amp;ouml;nlendirme servisimizin &lt;strong&gt;App.config&lt;/strong&gt; dosyası i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Router Service konfigurasyon i&amp;ccedil;eriği(App.config);&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
  &amp;lt;system.serviceModel&amp;gt;
    &amp;lt;behaviors&amp;gt;
      &amp;lt;serviceBehaviors&amp;gt;
        &amp;lt;behavior&amp;gt;
          &amp;lt;routing routingTableName="RTable"/&amp;gt;
          &amp;lt;serviceDebug includeExceptionDetailInFaults="true"/&amp;gt;
        &amp;lt;/behavior&amp;gt;
      &amp;lt;/serviceBehaviors&amp;gt;
    &amp;lt;/behaviors&amp;gt;
    &amp;lt;client&amp;gt;
      &amp;lt;endpoint address="net.tcp://localhost:60001/Adventure/BackendMirror/ProductService1" binding="netTcpBinding" contract="*" name="ProductServiceEndpoint1" /&amp;gt;
      &amp;lt;endpoint address="http://localhost:60002/Adventure/Backend/ProductService2" binding="wsHttpBinding" contract="*" name="ProductServiceEndpoint2"/&amp;gt;
      &amp;lt;endpoint address="http://localhost:60003/Adventure/Internal/ProductService3" binding="wsHttpBinding" contract="*" name="ProductServiceEndpoint3" /&amp;gt;
    &amp;lt;/client&amp;gt;
    &amp;lt;services&amp;gt;
      &amp;lt;service name="System.ServiceModel.Routing.RoutingService"&amp;gt;
        &amp;lt;host&amp;gt;
          &amp;lt;baseAddresses&amp;gt;
            &amp;lt;add baseAddress="http://localhost:60005/Adventure/ProductService"/&amp;gt;
          &amp;lt;/baseAddresses&amp;gt;
        &amp;lt;/host&amp;gt;
        &amp;lt;endpoint binding="wsHttpBinding" contract="System.ServiceModel.Routing.ISimplexSessionRouter"/&amp;gt;
      &amp;lt;/service&amp;gt;
    &amp;lt;/services&amp;gt;
    &amp;lt;routing&amp;gt;
      &amp;lt;filters&amp;gt;
        &amp;lt;filter filterType="MatchAll" name="ProductFilter"/&amp;gt;
      &amp;lt;/filters&amp;gt;
      &amp;lt;routingTables&amp;gt;
        &amp;lt;table name="RTable"&amp;gt;
          &amp;lt;entries&amp;gt;
            &amp;lt;add endpointName="ProductServiceEndpoint1" filterName="ProductFilter"/&amp;gt;
            &amp;lt;add endpointName="ProductServiceEndpoint2" filterName="ProductFilter"/&amp;gt;
            &amp;lt;add endpointName="ProductServiceEndpoint3" filterName="ProductFilter"/&amp;gt;
          &amp;lt;/entries&amp;gt;
        &amp;lt;/table&amp;gt;
      &amp;lt;/routingTables&amp;gt;
    &amp;lt;/routing&amp;gt;
  &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;fiterType&lt;/strong&gt; niteliğine &lt;strong&gt;MatchAll&lt;/strong&gt; değeri verilmiştir. Bu değere g&amp;ouml;re, istemciden gelecek olan &lt;strong&gt;talep(Request)&lt;/strong&gt; &lt;strong&gt;name&lt;/strong&gt; niteliğine atanan değere eş d&amp;uuml;şen &lt;strong&gt;endPoint&lt;/strong&gt; noktalarına iletilmelidir ki bu bildirimlerde yine &lt;strong&gt;entries&lt;/strong&gt; elementi i&amp;ccedil;erisinde yapılmaktadır. &lt;strong&gt;entries&lt;/strong&gt; elementi i&amp;ccedil;erisindeki &lt;strong&gt;filterName&lt;/strong&gt; niteliğinin değeri ile, &lt;strong&gt;filter&lt;/strong&gt; elementi i&amp;ccedil;erisindeki &lt;strong&gt;name&lt;/strong&gt; niteliğinin değerlerinin aynı olduğuna l&amp;uuml;tfen dikkat edelim.&lt;/p&gt;
&lt;p&gt;Konfigurasyon dosyasında &amp;ouml;nem arz eden noktalardan bir diğeride, y&amp;ouml;nlendirme servisi i&amp;ccedil;in kullanılan s&amp;ouml;zleşme tipidir&lt;strong&gt;(ISimplexSessionRouter)&lt;/strong&gt;. Hatırlayacağınız gibi,&lt;strong&gt; Request/Reply&lt;/strong&gt; modelin desteklenmediğinden bahsetmiştik. Bu nedenle daha &amp;ouml;nceki &amp;ouml;rneklerimizde kullandığımız &lt;strong&gt;IRequestRepyleRouter&lt;/strong&gt; built-in s&amp;ouml;zleşme tipini bu senaryoda kullanamayız.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizi test ettiğimizde &amp;ccedil;alışma zamanında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne benzer sonu&amp;ccedil;ları alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg75_Runtime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi t&amp;uuml;m &lt;strong&gt;DownStream &lt;/strong&gt;servisleri, istemciden gelen &lt;strong&gt;Product&lt;/strong&gt; tipini ele almış ve basit bir şekilde kullanmıştır. Biz &amp;ouml;rneğimizde sadece gelen bilgiyi ekrana yazdırıyoruz. Aynı istemci paketinin, n sayıda &lt;strong&gt;DownStream &lt;/strong&gt;servisi tarafından değerlendirilip &amp;uuml;zerlerinde farklı şekillerde işlemler uygulanması s&amp;ouml;z konusu olduğunda, &lt;strong&gt;MatchAll&lt;/strong&gt; filtereleme modelini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz. Tabiki &lt;strong&gt;Request/Reply&lt;/strong&gt; kısıtlamasını unutmamak gerekir. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f8%2fRouter+Project+3.rar"&gt;Router Project 3.rar (249,84 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-09-13 21:00:00</pubDate>
  <slug>WCF-40-Yenilikleri-Routing-Service-MatchAll-Filtresi</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-40</tag>
  </tags>
  <categories>
    <category>WCF 4.0 Beta 1</category>
  </categories>
</post>