<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>jQuery İçerisinden Bir WCF Servisini Kullanmak</title>
  <description>Son yıllarda özellikle Web uygulamalarında jQuery’ nin oldukça fazla yaygınlaştığını görmekteyiz. Özellikle Asp.Net MVC(Model View Controller) disiplinin de…Ben her ne kadar Javascript vey jQuery tarafında uzman olmasam da sonuçta bu istemcilerin çağrıda bulunabileceği WCF(Windows Communication Foundation) servisleri olabileceğini biliyorum Sarcastic smile Dolayısıyla bu günkü yazımızda jQuery içerisinden JSON(JavaScript Object Notation) ve XML(eXtensible Markup Language) formatında veri sunan operasyonlara sahip bir WCF servisinin nasıl kullanılabileceğini incelemeye çalışıyor olacağız.</description>
  <content>&lt;p&gt;&lt;a href="/pics/blg234_Giris.jpg"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; float: right; padding-top: 0px; border: 0px;" title="blg234_Giris" src="/pics/blg234_Giris_thumb.jpg" alt="blg234_Giris" width="320" height="240" align="right" border="0" /&gt;&lt;/a&gt;Kahramanımız &lt;strong&gt;Netspecter&lt;/strong&gt; &lt;strong&gt;Malezyadaki&lt;/strong&gt; m&amp;uuml;şterisi ile buluşmak &amp;uuml;zere &lt;strong&gt;caf&amp;eacute;&amp;rsquo;&lt;/strong&gt; de beklerken, detektiflik işine girdiğinden beri en &amp;ccedil;ok sevdiği i&amp;ccedil;ecek olan &lt;strong&gt;Java Chip Chocolate&amp;rsquo;&lt;/strong&gt; ını keyifli bir şekilde yudumlamaktadır.&lt;/p&gt;
&lt;p&gt;G&amp;uuml;neş batmış ve hava &amp;ccedil;oktan kararmıştır. M&amp;uuml;şterileri &amp;ccedil;oğunlukla buluşmalara ge&amp;ccedil; kalır. Aslında &amp;ccedil;evrede oturanları gizlice g&amp;ouml;zlemlediğinde onlardan birisinin kalkıp yanına geleceğini ve kendisini m&amp;uuml;şterisi olarak tanıtacağını gayet iyi bilmektedir. Bir a&amp;ccedil;ıdan m&amp;uuml;şterilerinin aslında kendinden &amp;ouml;nce geldiğini ama tedrigin oldukları i&amp;ccedil;in yaklaşmakta zorlandıklarını bilmektedir. Daha &amp;ouml;nce bu &amp;ccedil;ok sık başına gelmiştir.&lt;/p&gt;
&lt;p&gt;Masadaki metal pe&amp;ccedil;etelikten arkasına doğru baktığında &amp;ccedil;ok fazla dikkat &amp;ccedil;ekmeyen ama m&amp;uuml;şterisi olabilecek bir kişinin oturduğunu uzun s&amp;uuml;re &amp;ouml;nce fark etmiştir. Cam kapıdaki yansımadan okumakta olduğu gazeteye tersten baktığı anlaşılmaktadır. Derken tahmin ettiği gibi olur&amp;hellip;Adam ayağa kalkar ve masasına doğru yavaş ve tedirgin adımlarla y&amp;uuml;r&amp;uuml;r. &lt;strong&gt;Netspecter&lt;/strong&gt; sakin bir şekilde &lt;strong&gt;Java Chip Chocolate&amp;rsquo;&lt;/strong&gt; inden bir yudum daha alır. Elini pardes&amp;uuml;s&amp;uuml;n&amp;uuml;n cebine g&amp;ouml;t&amp;uuml;r&amp;uuml;r ve en gelişmiş silahı &lt;strong&gt;38lik Obfuscator&lt;/strong&gt;&amp;rsquo; unu hazırlar. Derken adam karşısına gelir ve&amp;hellip;.&lt;/p&gt;
&lt;p&gt;&amp;ldquo;Bay &lt;strong&gt;Netspecter&lt;/strong&gt;&amp;hellip;Ben m&amp;uuml;şteriniz &lt;strong&gt;jQuery&lt;/strong&gt;&amp;rdquo; der &lt;img class="wlEmoticon wlEmoticon-smilewithtongueout" style="border-style: none;" src="/pics/wlEmoticon-smilewithtongueout.png" alt="Smile with tongue out" /&gt;&lt;/p&gt;
&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Son yıllarda &amp;ouml;zellikle &lt;strong&gt;Web&lt;/strong&gt; uygulamalarında &lt;strong&gt;jQuery&lt;/strong&gt;&amp;rsquo; nin olduk&amp;ccedil;a fazla yaygınlaştığını g&amp;ouml;rmekteyiz. &amp;Ouml;zellikle &lt;strong&gt;Asp.Net MVC(Model View Controller) &lt;/strong&gt;disiplinin de&amp;hellip;Ben her ne kadar &lt;strong&gt;Javascript &lt;/strong&gt;vey &lt;strong&gt;jQuery &lt;/strong&gt;tarafında uzman olmasam da sonu&amp;ccedil;ta bu istemcilerin &amp;ccedil;ağrıda bulunabileceği &lt;strong&gt;WCF(Windows Communication Foundation) &lt;/strong&gt;servisleri olabileceğini biliyorum &lt;img class="wlEmoticon wlEmoticon-sarcasticsmile" style="border-style: none;" src="/pics/wlEmoticon-sarcasticsmile_2.png" alt="Sarcastic smile" /&gt; Dolayısıyla bu g&amp;uuml;nk&amp;uuml; yazımızda &lt;strong&gt;jQuery &lt;/strong&gt;i&amp;ccedil;erisinden &lt;strong&gt;JSON(JavaScript Object Notation) &lt;/strong&gt;ve &lt;strong&gt;XML(eXtensible Markup Language) &lt;/strong&gt;formatında veri sunan operasyonlara sahip bir &lt;strong&gt;WCF &lt;/strong&gt;servisinin nasıl kullanılabileceğini incelemeye &amp;ccedil;alışıyor olacağız.&lt;/p&gt;
&lt;p&gt;İlk olarak &amp;ouml;rneğimizde &lt;strong&gt;jQuery&lt;/strong&gt;&amp;rsquo; nin g&amp;uuml;ncel &lt;strong&gt;1.4.3 &lt;/strong&gt;s&amp;uuml;r&amp;uuml;ml&amp;uuml; versiyonunu kullandığımızı belirtmek isterim. S&amp;ouml;z konusu &lt;strong&gt;javascript&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesinin en son s&amp;uuml;r&amp;uuml;m&amp;uuml;ne &lt;a title="http://jquery.com/" href="http://jquery.com/"&gt;http://jquery.com/&lt;/a&gt; adresinden ulaşabilirsiniz. Bu k&amp;uuml;t&amp;uuml;phaneyi &amp;ccedil;ok doğal olarak bir &lt;strong&gt;Asp.Net Web Application &lt;/strong&gt;projesi i&amp;ccedil;erisinde kullanıyor olacağız. Aşağıdaki &lt;strong&gt;Solution&lt;/strong&gt; g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde projenin i&amp;ccedil;erisinde yer alan &amp;ouml;nemli enstr&amp;uuml;manları g&amp;ouml;rebilirsiniz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg234_Solution.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="blg234_Solution" src="/pics/blg234_Solution_thumb.gif" alt="blg234_Solution" width="434" height="240" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Solution&lt;/strong&gt; i&amp;ccedil;eriğinden de anlaşılacağı &amp;uuml;zere &lt;strong&gt;Scripts&lt;/strong&gt; klas&amp;ouml;r&amp;uuml; altında &lt;strong&gt;jQuery&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanemiz yer almakta olup bir de &lt;strong&gt;WCF&lt;/strong&gt; Servis &amp;ouml;rneği kullanılmaktadır. Dilerseniz yola &lt;strong&gt;WCF&lt;/strong&gt; servisimizi geliştirerek devam edelim.Bu ama&amp;ccedil;la uygulamamıza &lt;strong&gt;AJAX-enabled WCF Service &lt;/strong&gt;tipinden bir &amp;ouml;ğe ekliyoruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ServiceModel; 
using System.ServiceModel.Activation; 
using System.ServiceModel.Web;

namespace JQueryAndWCF 
{ 
    [ServiceContract(Namespace = "http://www.azon.com/Services/Product")] 
    [AspNetCompatibilityRequirements(RequirementsMode = AspNetCompatibilityRequirementsMode.Allowed)] 
    public class ProductService 
    { 
        private static Category[] Categories = new Category[]{ 
                new Category{ CategoryId=1, Name="Kitap"}, 
                new Category{ CategoryId=2, Name="Dergi"}, 
                new Category{ CategoryId=3, Name="Dvd"}, 
                new Category{ CategoryId=4, Name="Cd"} 
        };

        [OperationContract] 
        [WebGet(ResponseFormat=WebMessageFormat.Json)] 
        public Category[] GetCategoriesJson() 
        { 
            return Categories; 
        }

        [OperationContract] 
        [WebGet(ResponseFormat = WebMessageFormat.Xml)] 
        public Category[] GetCategoriesXml() 
        { 
            return Categories; 
        } 
    }

    public class Category 
    { 
        public int CategoryId { get; set; } 
        public string Name { get; set; } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;ProductService&lt;/strong&gt; isimli&lt;strong&gt; Ajax-Enabled WCF Service&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt;GetCategoriesJson&lt;/strong&gt; ve &lt;strong&gt;GetCategoriesXml &lt;/strong&gt;isimli iki servis operasyonu yer almaktadır. Adlarından da anlaşılacağı &amp;uuml;zere, &lt;strong&gt;JSON&lt;/strong&gt; ve &lt;strong&gt;XML&lt;/strong&gt; formatında veri d&amp;ouml;nd&amp;uuml;rmek &amp;uuml;zere tasarlanmış bu operasyonlar, &lt;strong&gt;Categories&lt;/strong&gt; isimli &lt;strong&gt;Category&lt;/strong&gt; tipinden bir diziye ait &amp;ccedil;alışma zamanı &amp;ouml;rneğini geriye d&amp;ouml;nd&amp;uuml;rmektedirler.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;JSON&lt;/strong&gt; formatında veri &amp;ccedil;ıktısı &amp;uuml;retmek i&amp;ccedil;in, dikkat edileceği &amp;uuml;zere &lt;strong&gt;WebGet&lt;/strong&gt; niteliğinin &lt;strong&gt;ResponseFormat&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;WebMessageFormat.Json&lt;/strong&gt; sabit değeri atanmıştır. Benzer şekilde &lt;strong&gt;XML&lt;/strong&gt; &amp;ccedil;ıktısı &amp;uuml;retmek i&amp;ccedil;inde s&amp;ouml;z konusu sabitin &lt;strong&gt;WebMessageFormat.Xml&lt;/strong&gt; değeri kullanılmıştır. Tabi &lt;strong&gt;WebGet&lt;/strong&gt; niteliğini kullanmış olmamız nedeni ile s&amp;ouml;z konusu servis operasyonlarına &lt;strong&gt;HTTP&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml;n &lt;strong&gt;GET &lt;/strong&gt;metodu yardımıyla erişilmesi s&amp;ouml;z konusudur. Bu &amp;ouml;nemlidir nitekim &lt;strong&gt;jQuery&lt;/strong&gt; i&amp;ccedil;erisinden yapacağımız servis &amp;ccedil;ağrısında &lt;strong&gt;GET&lt;/strong&gt; metoduna g&amp;ouml;re talepte bulunulması gerekmektedir.&lt;/p&gt;
&lt;p&gt;Dilerseniz &lt;strong&gt;Default.aspx &lt;/strong&gt;sayfamızı geliştirerek ilerlemeye &amp;ccedil;alışalım. İlk etapta amacımız &lt;strong&gt;jQuery&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt;JSON&lt;/strong&gt; ve &lt;strong&gt;XML&lt;/strong&gt; formatlı &amp;ccedil;ıktıları &amp;ccedil;ekebilmek olacaktır. Sonraki aşamada ise gelen veri i&amp;ccedil;eriğini istemci tarafında değerlendirmeye gayret edeceğiz. &lt;strong&gt;Asp.Net&lt;/strong&gt; sayfasını aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi tasarlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg234_DefaultAspx.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="blg234_DefaultAspx" src="/pics/blg234_DefaultAspx_thumb.gif" alt="blg234_DefaultAspx" width="164" height="227" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" AutoEventWireup="true" CodeBehind="Default.aspx.cs" Inherits="JQueryAndWCF.Default" %&amp;gt;

&amp;lt;!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"&amp;gt;

&amp;lt;script type="text/jscript" src="Scripts/jquery-1.4.3.min.js"&amp;gt; 
&amp;lt;/script&amp;gt;

&amp;lt;script language="javascript" type="text/javascript"&amp;gt;

    function GetCategoriesJson() {

        $.ajax( 
        { 
            type:"GET", 
            url:"ProductService.svc/GetCategoriesJson", 
            data:"{}", 
            contentType: "application/json; charset=utf-8",  
            dataType: "json",  
            success: OnSuccessJson,  
            error: OnErrorJson 
        });

        }

        function OnSuccessJson(data, status) { 
            var result = data; 
        }

        function OnErrorJson(data, status) { 
            alert("Exception"); 
        }

        function GetCategoriesXml() {

            $.ajax( 
        { 
            type: "GET", 
            url: "ProductService.svc/GetCategoriesXml", 
            data: "{}", 
            contentType: "application/xml; charset=utf-8", 
            dataType: "xml", 
            success: OnSuccessXml, 
            error: OnErrorXml 
        });

        }

        function OnSuccessXml(data, status) { 
            var result = data; 
        }

        function OnErrorXml(data, status) { 
            alert("Exception"); 
        }

&amp;lt;/script&amp;gt;

&amp;lt;html xmlns="http://www.w3.org/1999/xhtml"&amp;gt; 
&amp;lt;head runat="server"&amp;gt; 
    &amp;lt;title&amp;gt;&amp;lt;/title&amp;gt; 
&amp;lt;/head&amp;gt; 
&amp;lt;body&amp;gt; 
    &amp;lt;form id="form1" runat="server"&amp;gt; 
    &amp;lt;div&amp;gt; 
       &amp;lt;input type="button" OnClick="GetCategoriesJson()" value="Get Categories (JSON)" /&amp;gt; 
        &amp;lt;br /&amp;gt; 
        &amp;Uuml;r&amp;uuml;n Kategorileri : &amp;lt;br /&amp;gt; 
        &amp;lt;asp:ListBox ID="lstCategoriesJson" runat="server"  Width="150px"/&amp;gt; 
        &amp;lt;br /&amp;gt; 
        &amp;lt;input type="button" OnClick="GetCategoriesXml()" value="Get Categories (XML)" /&amp;gt; 
        &amp;lt;br /&amp;gt; 
        &amp;Uuml;r&amp;uuml;n Kategorileri : &amp;lt;br /&amp;gt; 
        &amp;lt;asp:ListBox ID="lstCategoriesXml" runat="server"  Width="150px"/&amp;gt; 
    &amp;lt;/div&amp;gt; 
    &amp;lt;/form&amp;gt; 
&amp;lt;/body&amp;gt; 
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Evetttt &lt;img class="wlEmoticon wlEmoticon-openmouthedsmile" style="border-style: none;" src="/pics/wlEmoticon-openmouthedsmile_5.png" alt="Open-mouthed smile" /&gt; Bakalım burada neler yaptık?&lt;/p&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;jQuery&lt;/strong&gt; kullanmak istediğimiz i&amp;ccedil;in bu k&amp;uuml;t&amp;uuml;phaneyi bildirimemiz gerekmektedir. Dolayısıla ilk &lt;strong&gt;script&lt;/strong&gt; elementi i&amp;ccedil;erisinde ilgili &lt;strong&gt;jQuery &lt;/strong&gt;dosyasını işaret etmemiz şart. Bunun dışında &lt;strong&gt;javascript &lt;/strong&gt;fonksiyonlarına baktığımızda &lt;strong&gt;GetCategoriesJson &lt;/strong&gt;ve &lt;strong&gt;GetCategoriesXml &lt;/strong&gt;isimli iki &amp;ouml;nemli operasyon olduğunu g&amp;ouml;rmekteyiz. Her iki fonksiyonda kendi i&amp;ccedil;erisinde &lt;strong&gt;$.ajax( &lt;/strong&gt;ile başlayan bir metod &amp;ccedil;ağrısında bulunmaktadır ki yazının kalbi de bu kod i&amp;ccedil;eriğidir.&lt;/p&gt;
&lt;p&gt;Bu &amp;ccedil;ağrı i&amp;ccedil;erisinde tahmin edileceği &amp;uuml;zere &lt;strong&gt;WCF&lt;/strong&gt; servisinin ilgili operasyonuna bir talepte bulunulmaktadır. &lt;strong&gt;type&lt;/strong&gt; &amp;ouml;zelliğine atanan değer ile &lt;strong&gt;HTTP Get&lt;/strong&gt; metoduna g&amp;ouml;re bir talep g&amp;ouml;nderileceği işaret edilmektedir. &lt;strong&gt;url &lt;/strong&gt;&amp;ouml;zelliğinde ise servis adı ve &amp;ccedil;ağırılacak olan servis operasyonu bilgisi tanımlanır. Servis tarafında tasarlamış olduğumuz operasyonlar herhangibir parametre almadığından, &lt;strong&gt;data &lt;/strong&gt;&amp;ouml;zelliğine bir değer g&amp;ouml;nderimi yapılmamıştır. Ancak parametre s&amp;ouml;z konusu olduğunda &lt;strong&gt;data&lt;/strong&gt; &amp;ouml;zelliğine gerekli değişken bildirimlerinin de yapılması gerekir. &lt;strong&gt;contentType &lt;/strong&gt;ile servisten d&amp;ouml;nen i&amp;ccedil;erik tipi belirlenirken &lt;strong&gt;dataType&lt;/strong&gt; &amp;ouml;zelliği ile de d&amp;ouml;nen verinin tipi belirlenmiş olur.&lt;/p&gt;
&lt;p&gt;Diğer yandan yapılan bu servis &amp;ccedil;ağrılarının sonu&amp;ccedil;larını iki şekilde değerlendirmemiz gerekmektedir.. Bu ama&amp;ccedil;la servis operasyonuna yapılan &amp;ccedil;ağrı başarılı bir şekilde tamamlandıysa &lt;strong&gt;success&lt;/strong&gt;, eğer hatalı şekilde sonlandıysa da &lt;strong&gt;error&lt;/strong&gt; &amp;ouml;zelliklerine atanan &lt;strong&gt;javascript&lt;/strong&gt; fonksiyonlarını &amp;ccedil;ağırılmaktadır. Tabiki bu &lt;strong&gt;javacript&lt;/strong&gt; fonksiyonlarını &amp;ccedil;ağırmak i&amp;ccedil;in &amp;ouml;rneğimizde iki adet &lt;strong&gt;Button&lt;/strong&gt; kontrol&amp;uuml; ele alınmıştır. Bu kontroller dikkat edileceği &amp;uuml;zere &lt;strong&gt;Postback&lt;/strong&gt; işlemi yapan &lt;strong&gt;ASP.NET &lt;/strong&gt;sunucu kontrollerinden değil aksine tipi &lt;strong&gt;Button&lt;/strong&gt; olan standart &lt;strong&gt;HTML input&lt;/strong&gt; elementleridir. &lt;strong&gt;OnClientClick&lt;/strong&gt; niteliklerine atanan metod adları, &lt;strong&gt;jQuery&lt;/strong&gt; ile ilgili servis &amp;ccedil;ağrısını yapmak &amp;uuml;zere tasarlanmış &lt;strong&gt;javascript&lt;/strong&gt; fonksiyonlarını işaret etmektedir.&lt;/p&gt;
&lt;p&gt;İlk olarak uygulamamızı &lt;strong&gt;debug&lt;/strong&gt; modda &amp;ccedil;alıştırıp &lt;strong&gt;OnSuccessJson&lt;/strong&gt; ve &lt;strong&gt;OnSuccessXml &lt;/strong&gt;fonksiyonlarına gelen &lt;strong&gt;data &lt;/strong&gt;parametrelerinin ne şekilde oluşturulduğunu g&amp;ouml;zlemlemeye &amp;ccedil;alışalım. İşte &lt;strong&gt;JSON&lt;/strong&gt; &amp;ccedil;ıktısı.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg234_JsonDebug.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="blg234_JsonDebug" src="/pics/blg234_JsonDebug_thumb.gif" alt="blg234_JsonDebug" width="586" height="491" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Category&lt;/strong&gt; tipinden 4 adet nesne &amp;ouml;rneği bir dizi olarak &lt;strong&gt;data&lt;/strong&gt; değişkeni i&amp;ccedil;erisine doldurulmaktadır. Eğer &lt;strong&gt;XML&lt;/strong&gt; formatlı talepte bulunan &lt;strong&gt;Button&lt;/strong&gt; bileşenini kullanırsak bu durumda &lt;strong&gt;OnSuccessXml&lt;/strong&gt; &lt;strong&gt;javascript&lt;/strong&gt; fonksiyonuna gelen &lt;strong&gt;data&lt;/strong&gt; değişkeninin i&amp;ccedil;eriğinin aşağıdaki şekildeki gibi oluşturulduğunu g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg234_XmlDebug.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="blg234_XmlDebug" src="/pics/blg234_XmlDebug_thumb.gif" alt="blg234_XmlDebug" width="634" height="497" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Category&lt;/strong&gt; tipinden olan dizinin i&amp;ccedil;eriği &lt;strong&gt;XML&lt;/strong&gt; formatında elde edilmektedir. Tabi &lt;strong&gt;JSON&lt;/strong&gt; ve &lt;strong&gt;XML &lt;/strong&gt;&amp;ccedil;ıktıları farklı şekillerde ele alınmalıdır. &lt;strong&gt;JSON &lt;/strong&gt;tarafında nesne bazlı bir yaklaşım daha kolay bir şekilde ele alınabilirken &lt;strong&gt;XML &lt;/strong&gt;&amp;ccedil;ıktısı i&amp;ccedil;in biraz &lt;strong&gt;Node, Element, Attribute &lt;/strong&gt;seviyesinde d&amp;uuml;ş&amp;uuml;nmek ve &lt;strong&gt;Parse&lt;/strong&gt; işlemlerini buna g&amp;ouml;re yapmak gerekmektedir.&lt;/p&gt;
&lt;p&gt;Şu an geldiğimiz noktaya bakdığımızda, &lt;strong&gt;jQuery&lt;/strong&gt; i&amp;ccedil;erisinden &lt;strong&gt;WCF&lt;/strong&gt; servis operasyonlarının &amp;ccedil;ağırılması ve &lt;strong&gt;JSON&lt;/strong&gt; ile &lt;strong&gt;XML&lt;/strong&gt; formatında veri alınması s&amp;ouml;z konusudur. Bir de bu verileri kullanabilirsek s&amp;uuml;per olmaz mı? &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_4.png" alt="Winking smile" /&gt; Bu ama&amp;ccedil;la servis &amp;ccedil;ağrılarının başarılı olması sonucu devreye giren &lt;strong&gt;Success &lt;/strong&gt;metodlarındaki&amp;nbsp; &lt;strong&gt;javascript&lt;/strong&gt; kodlarını aşağıdaki gibi değiştirmemiz yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;script language="javascript" type="text/javascript"&amp;gt;

    function GetCategoriesJson() {

        $.ajax( 
        { 
            type: "GET", 
            url: "ProductService.svc/GetCategoriesJson", 
            data: "{}", 
            contentType: "application/json; charset=utf-8", 
            dataType: "json", 
            success: OnSuccessJson, 
            error: OnErrorJson 
        });

    }

    function OnSuccessJson(data, status) { 
        var ddl = document.getElementById("lstCategoriesJson"); 
        
        //Minik bir temizlik 
        for (i = ddl.options.length - 1; i &amp;gt;= 0; i--) { 
            ddl.remove(i); 
        }

       for (i = 0; i &amp;lt; data.d.length; i++) {

            var option = document.createElement("option"); 
            option.innerHTML = data.d[i].Name.toString(); 
            option.value = data.d[i].CategoryId.toString(); 
            ddl.appendChild(option); 
        } 
    }

    function OnErrorJson(data, status) { 
        alert("Exception"); 
    }

    function GetCategoriesXml() {

        $.ajax( 
        { 
            type: "GET", 
            url: "ProductService.svc/GetCategoriesXml", 
            data: "{}", 
            contentType: "application/xml; charset=utf-8", 
            dataType: "xml", 
            success: OnSuccessXml, 
            error: OnErrorXml 
        });

    }

    function OnSuccessXml(data, status) { 
        var ddl = document.getElementById("lstCategoriesXml");

        //Minik bir temizlik 
        for (i = ddl.options.length - 1; i &amp;gt;= 0; i--) { 
            ddl.remove(i); 
        }

        for (i = 0; i &amp;lt; data.childNodes[0].childNodes.length; i++) { 
            var option = document.createElement("option"); 
            option.value = data.childNodes[0].childNodes[i].childNodes[0].text; 
            option.innerHTML = data.childNodes[0].childNodes[i].childNodes[1].text; 
            ddl.appendChild(option); 
        } 
    }

    function OnErrorXml(data, status) { 
        alert("Exception"); 
    }

&amp;lt;/script&amp;gt;&lt;/pre&gt;
&lt;p&gt;Tabi &lt;strong&gt;JSON&lt;/strong&gt; ve &lt;strong&gt;XML&lt;/strong&gt; formatındaki&amp;nbsp; veri d&amp;ouml;n&amp;uuml;şleri birbirlerinden farklı şekilde ele alınmak zorundadır. &amp;Ouml;zellikle &lt;strong&gt;JSON&lt;/strong&gt; tarafında nesne bazlı bir yaklaşım s&amp;ouml;z konusu olduğundan &lt;strong&gt;data&lt;/strong&gt; i&amp;ccedil;eriğinden &lt;strong&gt;Category &lt;/strong&gt;tipi i&amp;ccedil;in tanımlanmış olan &lt;strong&gt;Name &lt;/strong&gt;veya &lt;strong&gt;CategoryId &lt;/strong&gt;gibi &amp;ccedil;alışma zamanı &amp;ouml;zelliklerine ulaşmak olduk&amp;ccedil;a kolaydır. Ne varki &lt;strong&gt;XML &lt;/strong&gt;veri okuması sırasında &lt;strong&gt;Node&lt;/strong&gt;&amp;rsquo; lar i&amp;ccedil;erisinde&lt;em&gt;(&amp;Ouml;zellikle childNodes attribute ile gelen listelerde)&lt;/em&gt; dolaşmak gerekir. Her iki fonksiyonda basit anlamda sayfa &amp;uuml;zerinde yer alan liste kontrollerini bulmakta ve &lt;strong&gt;option&lt;/strong&gt; tipinden elementler ilave etmektedir. Bu elementlerin &lt;strong&gt;innerHTML&lt;/strong&gt; niteliklerine &lt;strong&gt;Name &lt;/strong&gt;, &lt;strong&gt;value&lt;/strong&gt; niteliklerine ise &lt;strong&gt;CategoryId&lt;/strong&gt; değerleri atanmaktadır. Uygulamamızı bu haliyle &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;ları elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg234_RuntimeResult.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="blg234_RuntimeResult" src="/pics/blg234_RuntimeResult_thumb.gif" alt="blg234_RuntimeResult" width="389" height="335" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;jQuery&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesi i&amp;ccedil;erisinden bir &lt;strong&gt;WCF&lt;/strong&gt; servis &amp;ccedil;ağrısını ger&amp;ccedil;ekleştirmek ve operasyon &amp;ccedil;ağrısı sonucu &amp;uuml;retilen veriyi &lt;strong&gt;javascript&lt;/strong&gt; tarafında ele almak son derece kolaydır. Tabi bu noktada akla gelen sorulardan biriside bu tip bir işlevselliğin &lt;strong&gt;ASP.NET MVC &lt;/strong&gt;tarafında nasıl ele alınabileceğidir &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_4.png" alt="Winking smile" /&gt; Bunu da ilerleyen yazılarımızdan birisinde ele almaya &amp;ccedil;alışıyor olacağım. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f10%2fJQueryAndWCF.rar"&gt;JQueryAndWCF.rar (47,04 kb)&lt;/a&gt;&amp;nbsp;&lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 Ultimate s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde geliştirilmiş ve test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2011-03-13 21:27:00</pubDate>
  <slug>jQuery-Icerisinden-Bir-WCF-Servisini-Kullanmak</slug>
  <tags>
    <tag>wcf</tag>
    <tag>jquery</tag>
  </tags>
  <categories>
    <category>WCF</category>
    <category>WCF 4.0</category>
  </categories>
</post>