<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Webiner - WCF RIA Services</title>
  <description />
  <content>&lt;p&gt;&lt;img style="FLOAT: left" src="http://www.buraksenyurt.com/pics/2009%2f12%2fblg121_Giris.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bildiğiniz &amp;uuml;zere ge&amp;ccedil;tiğimiz hafta i&amp;ccedil;erisinde kişisel bilgisayarımdaki&amp;nbsp;teknik bir aksaklık nedeniyle &lt;strong&gt;NedirTv?com&lt;/strong&gt; sitesi&amp;nbsp;aracılığıyla yayınladığımız &lt;strong&gt;WCF RIA Services &lt;/strong&gt;webinerimiz yarım kalmıştı.&amp;nbsp;&lt;strong&gt;18.12.2009 Cuma &lt;/strong&gt;gecesi 21:00 - 22:00 saatleri arasında&amp;nbsp;ise herhangibir sorun olmadan Webinerimizi tamamlamayı başardık. Ayrıca &lt;a title="Webiner - WCF RIA Services" href="http://www.nedirtv.com/video/Webiner---WCF-RIA-Services.aspx" target="_blank"&gt;Webiner kaydı &lt;strong&gt;NedirTv?com&lt;/strong&gt; sitesi &amp;uuml;zerinden yayınlandı&lt;/a&gt;.&lt;/p&gt;
&lt;p&gt;Bu Webinerimizde kısaca&lt;strong&gt; WCF RIA Service&lt;/strong&gt; kavramını tanımaya &amp;ccedil;alıştık. Bildiğiniz &amp;uuml;zere &lt;strong&gt;.Net RIA Services&lt;/strong&gt; ismi &lt;strong&gt;WCF RIA Services&lt;/strong&gt; olarak değiştirildi. Bu &lt;strong&gt;WCF Eco System&lt;/strong&gt; yaklaşımının bir sonucu.&amp;nbsp;&lt;strong&gt;WCF RIA Service' &lt;/strong&gt;leri, &lt;strong&gt;zengin i&amp;ccedil;erikli internet uygulamalarının(Rich Internet Applications), &amp;ccedil;ok katmanlı mimariyi(N-Tier)&lt;/strong&gt; uygulamaları halinde sunucu &amp;uuml;zerindeki kaynaklara ulaşmalarında b&amp;uuml;y&amp;uuml;k &amp;ouml;nem taşımaktadır. &amp;Ouml;zellikle &lt;strong&gt;sunum katmanı(Presentation Layer)&lt;/strong&gt;&amp;nbsp;ile &lt;strong&gt;orta katman(Middler Tier) &lt;/strong&gt;arasındaki&lt;strong&gt; uygulama mantığının(Application Logic)&lt;/strong&gt; paylaşılmasında &amp;ouml;nemli bir rol &amp;uuml;stlenmektedirler. Bu anlamda sunucu kaynaklarının kullanımına ilişkin olarak, uygulama mantığının etkili ve kolay bir şekilde ele alınması m&amp;uuml;mk&amp;uuml;n hale gelmektedir. &amp;Uuml;stelik geliştiricilerin servis alt yapısı, iletişim şekli gibi bir takım detayları d&amp;uuml;ş&amp;uuml;nmesine gerek yoktur. Nitekim, &lt;strong&gt;Visual Studio&lt;/strong&gt; ortamına entegre gelen &lt;strong&gt;Domain Service&lt;/strong&gt; şablonu yardımıyla sadece uygulama mantığı &amp;uuml;zerine odaklanılması yeterlidir. Elbette veri kaynağına olan erişiminde kullanılabilen &lt;strong&gt;Entity Data Model' &lt;/strong&gt;in yetenekleride yadsınamaz.&lt;/p&gt;
&lt;p&gt;Tabi konu &lt;strong&gt;RIA&lt;/strong&gt; uygulamaları olunca akla ilk gelen &lt;strong&gt;Silverlight &lt;/strong&gt;nesneleridir. Bizde Webinerimizde &lt;strong&gt;Silverlight 4.0&lt;/strong&gt; odaklı olarak geliştirilen bir uygulamada &lt;strong&gt;WCF RIA Service&lt;/strong&gt; kullanımını incelemeye &amp;ccedil;alıştık. Keyifli seyirler dilerim...&lt;/p&gt;
&lt;p&gt;S&amp;uuml;re -&amp;gt; &lt;strong&gt;54:52&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2009-12-19 15:10:00</pubDate>
  <slug>Webiner-WCF-RIA-Services</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-ria-services</tag>
    <tag>silverlight</tag>
    <tag>wcf-eco-system</tag>
  </tags>
  <categories>
    <category>WCF Eco System</category>
    <category>WCF RIA Services</category>
  </categories>
</post>