<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Workflow Foundation Öğreniyorum - Ders 2 - Kodla Başbaşayız</title>
  <description>"Workflow Foundation 4.0 Öğreniyorum" serimizin üçüncü dersi ile karşınızdayız. Bu kez bir sıçrama yaparak Level değerimizi 101' den 110' a çekiyoruz. Bunu yaparken de kendimize biraz eziyet ediyoruz. Eziyet etmek içinde, bir önceki dersimizde ele aldığımız Visual Studio 2010 IDE' sinin sunduğu WPF tabanlı güzelim Workflow Designer ortamını bırakarak, bir Workflow örneğinin ve tüm içeriğinin tamamen kod bazlı olarak nasıl geliştirilebileceğini görmeye çalışıyoruz. Ancak bu eziyet sayesinde, yeri geldiğinde söz konusu akışların kod yardımıyla dinamik olaraktan üretilebileceğini öğreniyor ve bunun bazı vakaları karşılayacağını farkediyoruz. Örnek akışta bir önceki akışın aynısının kod tarafına geliştirilmesini gerçekleştiriyoruz. Bu sırada Variable, InArgument, OutArgument, ActivityContext, ExpressionServices gibi önemli tipleri de öğreniyor ve nasıl kullanıldıklarını görüyoruz. Bakalım eziyetimize değecek mi? İyi seyirler dilerim.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f4%2fwfOgreniyorum_Ders2.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;a title="Workflow Foundation &amp;Ouml;ğreniyorum" href="http://www.nedirtv.com/kategori/Workflow-Foundation-Ogreniyorum.aspx" target="_blank"&gt;&lt;strong&gt;"Workflow Foundation 4.0 &amp;Ouml;ğreniyorum"&lt;/strong&gt;&lt;/a&gt; serimizin &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; dersi ile karşınızdayız. Bu kez bir sı&amp;ccedil;rama yaparak &lt;strong&gt;Level &lt;/strong&gt;değerimizi &lt;strong&gt;101&lt;/strong&gt;' den &lt;strong&gt;110&lt;/strong&gt;' a &amp;ccedil;ekiyoruz. Bunu yaparken de kendimize biraz eziyet ediyoruz. Eziyet etmek i&amp;ccedil;inde, bir &amp;ouml;nceki dersimizde ele aldığımız &lt;strong&gt;Visual Studio 2010 IDE&lt;/strong&gt;' sinin sunduğu &lt;strong&gt;WPF &lt;/strong&gt;tabanlı g&amp;uuml;zelim &lt;strong&gt;Workflow Designer &lt;/strong&gt;ortamını bırakarak, bir &lt;strong&gt;Workflow &lt;/strong&gt;&amp;ouml;rneğinin ve t&amp;uuml;m i&amp;ccedil;eriğinin tamamen kod bazlı olarak nasıl geliştirilebileceğini g&amp;ouml;rmeye &amp;ccedil;alışıyoruz. Ancak bu eziyet sayesinde, yeri geldiğinde s&amp;ouml;z konusu akışların kod yardımıyla dinamik olaraktan &amp;uuml;retilebileceğini &amp;ouml;ğreniyor ve bunun bazı vakaları karşılayacağını farkediyoruz. &amp;Ouml;rnek akışta bir &amp;ouml;nceki akışın aynısının kod tarafına geliştirilmesini ger&amp;ccedil;ekleştiriyoruz. Bu sırada &lt;strong&gt;Variable, InArgument, OutArgument, ActivityContext, ExpressionServices &lt;/strong&gt;gibi &amp;ouml;nemli tipleri de &amp;ouml;ğreniyor ve nasıl kullanıldıklarını g&amp;ouml;r&amp;uuml;yoruz. Bakalım eziyetimize değecek mi? İyi seyirler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;iframe src="https://www.youtube.com/embed/Xlxjmt0Jw9k" width="420" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;&lt;a title="Ders 2 - Kodla Başbaşayız" href="http://www.nedirtv.com/video/Ders-2---Kodla-Basbasayiz.aspx" target="_blank"&gt;Ders 2 - Kodla Başbaşayız&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;S&amp;uuml;re : 17:15&lt;/p&gt;
&lt;p&gt;Dosya Boyutu : 18.3 Mb&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek : &lt;a title="Lesson 2 - Kodla Başbaşayız" href="/pics/2010%2f4%2fLesson2_KodlaBasbasayiz.rar" target="_blank"&gt;Lesson2_KodlaBasbasayiz.rar (40,12 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2010-05-04 03:25:00</pubDate>
  <slug>Workflow-Foundation-Ogreniyorum-Ders-2-Kodla-Basbasayiz</slug>
  <tags>
    <tag>workflow-foundation-40</tag>
    <tag>workflow-foundation</tag>
    <tag>visual-studio-2010</tag>
  </tags>
  <categories>
    <category>Workflow Foundation Öğreniyorum</category>
  </categories>
</post>