<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ruby Kod Parçacıkları 29 - Kod Yazan Kodlar</title>
  <description>Ruby programlama dilinin öne çıkan özellikleri arasında dinamiklik ve meta programlama yetenekleri de yer almaktadır. Aslında işin özeti kod yazan kodlardır diyebiliriz. Ruby yorumlamalı bir dildir ve doğal olarak her şey çalışma zamanında icra edilmektedir. Ancak bazı senaryolarda metinsel olarak gelen bir içeriğin kod parçası şeklinde değerlendirilmesi ve çalışma zamanında yürütülmesi istenebilir. Hatta çalışan kod üzerinde değişiklikler yapılabilmesi de belli ölçülerde mümkündür. Konu pek tabii benim burada anlatacağım kadar basit değil. Örneğin Amazon'da bu konu üzerine yazılmış kitaplar bulabilirsiniz. Bu yazımızda kodu çalışma zamanında üretmek veya çalışan kodu manipule etmek için yapılabileceklerden bir kaçına değinmeye çalışacağız.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Ruby programlama dilinin &amp;ouml;ne &amp;ccedil;ıkan &amp;ouml;zellikleri&amp;nbsp;arasında dinamiklik ve meta programlama&amp;nbsp;yetenekleri de yer almaktadır. Aslında işin &amp;ouml;zeti kod yazan kodlardır diyebiliriz. Ruby yorumlamalı bir dildir ve doğal olarak her şey &amp;ccedil;alışma zamanında icra edilmektedir. Ancak bazı&amp;nbsp;senaryolarda metinsel olarak gelen bir i&amp;ccedil;eriğin kod par&amp;ccedil;ası şeklinde değerlendirilmesi ve &amp;ccedil;alışma zamanında y&amp;uuml;r&amp;uuml;t&amp;uuml;lmesi istenebilir. Hatta &amp;ccedil;alışan kod &amp;uuml;zerinde değişiklikler yapılabilmesi de belli &amp;ouml;l&amp;ccedil;&amp;uuml;lerde m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Konu pek tabii benim burada anlatacağım kadar basit değil. &amp;Ouml;rneğin &lt;a href="https://www.amazon.com/Metaprogramming-Ruby-Program-Like-Facets/dp/1941222129/ref=sr_1_1?s=books&amp;amp;ie=UTF8&amp;amp;qid=1481543025&amp;amp;sr=1-1&amp;amp;keywords=ruby+metaprogramming" target="_blank"&gt;Amazon'da bu konu &amp;uuml;zerine yazılmış kitap&lt;/a&gt;lar bulabilirsiniz. Bu yazımızda&amp;nbsp;kodu &amp;ccedil;alışma zamanında &amp;uuml;retmek veya &amp;ccedil;alışan kodu manipule etmek i&amp;ccedil;in yapılabileceklerden bir ka&amp;ccedil;ına değinmeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bazı durumlarda Meta-programlama ile Reflection birbirleri ile karışıtırılır. Normal de Reflection Meta-programlama'nın bir alt dalı olarak karşımıza &amp;ccedil;ıkar ve &amp;ouml;zellikle yorumlamalı betik dillerde program kodu hakkında &amp;ccedil;alışma zamanına bilgi sağlamak amacıyla kullanılır. Bir sınıfın &amp;ouml;zellik adlarını yakalamak gibi. Oysa ki meta-programlama ile &amp;ccedil;alışan kodun &amp;ccedil;alışma zamanında değiştirilmesi veya &amp;ccedil;alışabilecek metinsel kod par&amp;ccedil;alarının yine &amp;ccedil;alışma zamanında ayağa kaldırılıp y&amp;uuml;r&amp;uuml;t&amp;uuml;lmesi gibi işlemler kastedilir. Bu a&amp;ccedil;ıdan bakıldığında meta-programlama'nın yer bulduğu en &amp;ouml;nemli alan Domain Specific Language yazılmasıdır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2&gt;Eval ile &amp;Ccedil;alışma Zamanında Kod İşletmek&lt;/h2&gt;
&lt;p&gt;İlk &amp;ouml;rneğimizde eval fonksiyonelliğini ele alarak metinsel bir kod par&amp;ccedil;asını nasıl &amp;ccedil;alıştırabileceğimizi anlamaya &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;puts 'insert a simple code'
code=gets
eval code

someCodes="puts 'whats your name?'
        name=gets
        puts name.upcase!()
"
eval someCodes&lt;/pre&gt;
&lt;p&gt;İlk olarak &amp;ccedil;alışma zamanı &amp;ccedil;ıktısına bir bakalım dilerseniz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/12/ruby29_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sizi bilemem ama ben bu kod par&amp;ccedil;asına baktığımda epeyce etkileniyorum. İlk olarak kullanıcıdan ekrana bir kod par&amp;ccedil;ası girmesini istiyoruz. Tabii &amp;ouml;rnekte işletilebilir bir kod par&amp;ccedil;ası eklediğimizi itiraf etmeliyim&lt;em&gt;(Hatalı bir kod par&amp;ccedil;asının nasıl tepki vereceğini incelemek ise size bir &amp;ouml;dev olsun)&lt;/em&gt; Sonrasında ise birden fazla satıra yayılan bir kod par&amp;ccedil;ası s&amp;ouml;z konusu. &amp;Ouml;nemli olan nokta code ve someCodes değişkenlerinin eval ile birlikte kullanılması. Yani &amp;ccedil;alışan bir kodun i&amp;ccedil;erisinde başka bir ruby kodunun &amp;ccedil;alıştırılmasını sağlamış olduk. eval, parametre olarak gelen ifadenin değerlendirilmesini yapıp yorumlanacak şekilde ruby ortamına aktarmakla g&amp;ouml;revli. Bu arada eval, RubyKernel API'si i&amp;ccedil;erisinde yer alan instance metodlarından birisidir.&lt;/p&gt;
&lt;h2&gt;Binding&lt;/h2&gt;
&lt;p&gt;Bir diğer Kernel metodu ise&amp;nbsp;binding'dir. eval fonksiyonu ile birlikte kullanılır. Temel olarak bir metod ve değişkenlerini program ortamı i&amp;ccedil;erisinde başka bir noktaya bağlayabilmemize olanak sunar. Konuyu a&amp;ccedil;ıklamak i&amp;ccedil;in aşağıdaki kod par&amp;ccedil;asını ele alalım.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;def doSomething
  puts "in doSomething"
  return binding
end
bind=doSomething{3.times{puts "arigatou"}}
eval "yield",bind&lt;/pre&gt;
&lt;p&gt;ve &amp;ccedil;alışma zamanı g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/12/ruby29_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;doSomething metodu i&amp;ccedil;erisinde binding kullanılmıştır. Buna g&amp;ouml;re &amp;ccedil;alışma zamanında doSomething metodu ve parametrik yapısı yaklanarak eval ifadesi &amp;uuml;zerinden kendisine kod par&amp;ccedil;ası&amp;nbsp;g&amp;ouml;nderilebilir. Şimdi konuyu dikkatlice inceleyelim. &amp;Ccedil;alışma zamanında ekrana ilk olarak "in doSomething" yazar. Sonrasında ise 3 kez "arigatou". Bunu 3.times{puts "arigatou"} ifadesinin ger&amp;ccedil;ekleştirdiği aşikardır. Bu ifadenin doSomething&amp;nbsp;metodu&amp;nbsp;i&amp;ccedil;erisine&amp;nbsp;g&amp;ouml;nderilmesi i&amp;ccedil;inse&amp;nbsp;eval fonksiyonuna&amp;nbsp;iki parametre ge&amp;ccedil;ilmiştir. İlki yield anahtar kelimesi, ikincisi ise metodun bağlandığı değişken olan bind&lt;em&gt;(A&amp;ccedil;ık&amp;ccedil;ası binding konusu bana biraz karışık geldi. Daha iyi bir şekilde &amp;ouml;ğrenmek i&amp;ccedil;in uğraşıyorum)&lt;/em&gt;&lt;/p&gt;
&lt;h2&gt;Bir Sabitin &amp;Ccedil;alışma Zamanında Yakalanması&lt;/h2&gt;
&lt;p&gt;Pek tabii dinamiklik ve meta-programlama&amp;nbsp;s&amp;ouml;z konusu ise ortada reflection gibi konularda yer alacaktır. &amp;Ouml;rneğin &amp;ccedil;alışma zamanında bir değişmezi(Constant) yakalamak i&amp;ccedil;in const_get metodundan yararlanılabilir&lt;em&gt;(eval'e g&amp;ouml;re daha performanslı olduğu ifade edilmektedir)&amp;nbsp;&lt;/em&gt;Aşağıdaki kod par&amp;ccedil;asını ele alalım.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;eValue="E"
piValue="PI"
result1=Math.const_get(eValue)*10
result2=Math.const_get(piValue)*10*10
puts result1,result2

pi=eval "Math::PI"
puts pir&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında Math sınıfında yer alan PI ve E değişmezlerinin &amp;ccedil;alışma zamanında bir string &amp;uuml;zerinden yorumlanması &amp;ouml;rneklenmektedir. eValue ve piValue değişkenleri dikkat edileceği &amp;uuml;zere string veri t&amp;uuml;r&amp;uuml;ndedir. Math sınıfı &amp;uuml;zerinden const_get metodu kullanılarak bu iki değişmezin değeri yakalanabilir. Dolayısıyla&amp;nbsp;kendi tanımladığımız bir sabitin değerini de bu şekilde &amp;ccedil;alışma zamanında yakalamamız m&amp;uuml;mk&amp;uuml;n. İkinci kod par&amp;ccedil;asında sabit değerinin eval ile yorumlanması &amp;ouml;rneklenmiştir. &amp;Ccedil;alışma zamanına ait &amp;ccedil;ıktımız aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/12/ruby29_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Bir Sınıfı Adından &amp;Ouml;rneklemek&amp;nbsp;&lt;/h2&gt;
&lt;p&gt;Dilersek bir sınıfı yine metin olarak gelen adından &amp;ouml;rnekleyebiliriz. .Net tarafında da reflection teknikleri ile yapabildiğimiz bir operasyon olduğunu biliyoruz.&amp;nbsp;Aslında bir sınıfın &amp;ccedil;alışma zamanında &amp;ouml;rneklenmesi olarak ifade edebileceğimiz bir durum&lt;em&gt;(Tabii Ruby'de her şey &amp;ccedil;alışma zamanında ger&amp;ccedil;ekleşiyor bunu da unutmamak lazım)&lt;/em&gt; Konuyu aşağıdaki &amp;ouml;rnekle anlamaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;module Game
  class Player
    attr_accessor :name,:point
    def initialize(name,point)
      @name,@point=name,point
    end
    def to_s
      "#{@name}-(#{@point})"
    end
  end
end

# sinif module icinde oldugundan :: notasyonu kullaniliyor
obj=Object.const_get("Game::Player") #sinif adini alip
o=obj.new("burk",100) #ornekliyoruz
puts o.to_s #ve icindeki bir metodu kullaniyoruz&lt;/pre&gt;
&lt;p&gt;Game mod&amp;uuml;l&amp;uuml; i&amp;ccedil;erisinde &amp;ouml;rnek olarak ele aldığımız Player isimli bir sınıf bulunuyor. Sınıfa sembolik olarak bir ka&amp;ccedil; nitelik ve ezilmiş to_s metodunu ekledik. Bizi ilgilendiren kısım ise Object sınıfı &amp;uuml;zerinden &amp;ccedil;ağırdığımız const_get fonksiyonu. Bu, parametre olarak "Game::Player" şeklinde bir metin&amp;nbsp;almakta. Player sınıfı bir mod&amp;uuml;l i&amp;ccedil;erisine yer aldığından :: notasyonuna başvuruyoruz. Bu satır ile Player tipinden bir &amp;ouml;rnek &amp;uuml;retiliyor ve obj isimli değişkene aktarılıyor. Player.new gibi bir oluşumdan farklı bir şey yaptığımızı fark ediyorsunuz değil mi? Nitekim obj.new ile Player nesnesi oluşturmaktayız evet ama nesne adı string olarak gelmekte. Hatta yapıcı metoda parametrelerini g&amp;ouml;nderip to_s metodunu da kullanıyoruz. İşte &amp;ccedil;alışma zamanı &amp;ccedil;ıktıları.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/12/ruby29_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;define_method ile &amp;Ccedil;alışma Zamanında Metod Oluşturmak&lt;/h2&gt;
&lt;p&gt;Ruby dilini &amp;ouml;ğrenmeye &amp;ccedil;alışırken &amp;ouml;zellikle dinamik olması ve meta-programlama&amp;nbsp;yetenekleri i&amp;ccedil;ermesi nedeniyle&amp;nbsp;anlamakta zorlandığım pek &amp;ccedil;ok kısım oluyor. define_method'da bunlardan birisi. Temel olarak &amp;ccedil;alışma zamanında metod &amp;uuml;retebilmemize izin veren bir fonksiyonellik olarak d&amp;uuml;ş&amp;uuml;nebiliriz. Konuyu &amp;ouml;ğrenirken ki tek sıkıntım işe yaramayacak olsa da nasıl uygulandığını g&amp;ouml;steren bir &amp;ouml;rnek bulmak oldu. İlk olarak aşağıdaki gibi bir sınıfımız olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;class GameZone
  def title=(zone_name)
    @title=zone_name
  end
  def title
    @title
  end
  def capacity=(player_count)
    @capacity=player_count
  end
  def capacity
    @capacity
  end
  def color=(color)
    @color=color
  end
  def color
    @color
  end
end
rogue_one=GameZone.new
rogue_one.title="Rogue One"
rogue_one.capacity=48
rogue_one.color="black"
puts rogue_one.title,rogue_one.capacity,rogue_one.color&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında GameZone isimli bir sınıf ve bir ka&amp;ccedil; nitelik metodu tanımı g&amp;ouml;r&amp;uuml;yoruz. Aslında title,capacity ve color nitelikleri i&amp;ccedil;in attr_accessor da kullanılabilir ki genelde &amp;ouml;yle yapılıyor ancak amacımız bu metod ihtiya&amp;ccedil;larının &amp;ccedil;alışma zamanında nasıl &amp;uuml;retilebileceğini g&amp;ouml;rmek. Aşağıdaki kod par&amp;ccedil;asını inceleyince ne demek istediğimi daha iyi anlayacaksınız.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;class GameZoneV2
   PROPERTIES=["title","capacity","color"]
   
   PROPERTIES.each{|p|
     define_method("#{p}="){|i|
       instance_variable_set("@#{p}",i)
     }
     
     define_method("#{p}"){
       instance_variable_get("@#{p}")
     }
   }
end
zone_gold=GameZoneV2.new
zone_gold.title="Gold zone"
zone_gold.capacity=34
zone_gold.color="Gold"
puts zone_gold.title,zone_gold.capacity,zone_gold.color&lt;/pre&gt;
&lt;p&gt;GameZoneV2 i&amp;ccedil;erisinde yine sihirli bir şeyler var. PROPERTIES isimli dizi i&amp;ccedil;erisindeki her bir eleman i&amp;ccedil;in getter ve setter metodları define_method yardımıyla &amp;ccedil;alışma zamanında &amp;uuml;retilmekte. each bloğu i&amp;ccedil;erisinde her bir p değişkeni&lt;em&gt;(PROPERTIES elemanı)&lt;/em&gt;&amp;nbsp;i&amp;ccedil;in iki define_metod &amp;ccedil;ağrısı s&amp;ouml;z konusu. İlkinde = ile biten setter metod oluşturuluyor ki burada instance_variable_set ile atama bildirimi de yapılmakta. İkinci define_method ile de getter fonksiyonu tanımlamakta. Kodun ilerleyen kısımlarında zone_gold isimli nesne &amp;ouml;rneği &amp;uuml;zerinden title, capacity ve color niteliklerinin kullanılabildiğine şahit oluyoruz. İşte &amp;ccedil;alışma zamanı sonu&amp;ccedil;ları.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/12/ruby29_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Demek ki &amp;ccedil;alışma zamanında gelecek bir takım parametrelere g&amp;ouml;re sınıflara farklı operasyonları eklememiz m&amp;uuml;mk&amp;uuml;n. Dikkat edin &amp;ccedil;alışma zamanında diyorum.&lt;/p&gt;
&lt;h2&gt;self.class.send Kullanarak metod işletmek&lt;/h2&gt;
&lt;p&gt;Olayı biraz daha ilgin&amp;ccedil; hale getirmeye ne dersiniz? Mesela sınıfa dahil etmek istediğimiz getter ve setter metodlarının sahibi olacak nitelikleri de dışarıdan verebiliyor olalım. Aşağıdaki kor par&amp;ccedil;asını bu anlamda ele alabiliriz.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;class Person
  def createGetterSetter(*args)
    Array(args).each{|attr|
      self.class.send(:define_method,"#{attr}="){|v|
        instance_variable_set("@#{attr}", v)
      }
      self.class.send(:define_method,"#{attr}") {
        instance_variable_get("@#{attr}")
      }
    }
  end
end
logan=Person.new
logan.createGetterSetter("name","salary")
logan.name="burki"
logan.salary=1250
puts "#{logan.name}-(#{logan.salary})"&lt;/pre&gt;
&lt;p&gt;Person sınıfı i&amp;ccedil;erisinde yer alan createGetterSetter metodu değişken sayıda parametre alabilmektedir. İ&amp;ccedil;inde yer alan each bloğunda her bir arg&amp;uuml;man i&amp;ccedil;in birer getter ve setter metodu tanımlanması sağlanmaktadır. Burada dikkat edilmesi gereken nokta define_method'un kullanım şeklidir. define_method&amp;nbsp;private tanımlanmış bir sınıf fonksiyonudur. Bunu Player &amp;ouml;rneği &amp;uuml;zerinden &amp;ccedil;ağırmak i&amp;ccedil;in self.class.send şeklinde bir yol izlenmelidir. Kodun ilerleyen kısımlarında createGetterSetter metoduna &amp;ouml;rnek iki eleman yollanmış ve kullanılmıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/12/ruby29_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aynı &amp;ouml;rnekte işi biraz daha ileriye g&amp;ouml;t&amp;uuml;rebiliriz. Zaten attr_accessor bir nitelik i&amp;ccedil;in gerekli getter ve setter operasyonlarını hazır olarak sunmaktadır. Peki aynı &amp;ouml;rnekteki nitelikleri attr_accessor ile tanımlayabilir miyiz? Tabii &amp;ccedil;alışma zamanında. Aşağıdaki kod par&amp;ccedil;ası işimizi g&amp;ouml;recektir.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;class Person
  def createAttr(*args)
    Array(args).each{|attr|
      self.class.send(:attr_accessor,"#{attr}")
    }
  end
end
logan=Person.new
logan.createAttr(:name,:salary)
logan.name="burki"
logan.salary=1250
puts "#{logan.name}-(#{logan.salary})"&lt;/pre&gt;
&lt;p&gt;Yine self.class.send metodunun kullanıldığına dikkat edelim. Bunun dışında createAttr metoduna :name ve :salary isimli iki symbol g&amp;ouml;ndermekteyiz.&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi metinsel olarak gelen bir kod par&amp;ccedil;asını &amp;ccedil;alışma zamanında işletmemiz m&amp;uuml;mk&amp;uuml;n. Bir sınıfa &amp;ccedil;alışma zamanında gelecek bilgiler ve y&amp;ouml;nergeler doğrultusunda yeni fonksiyonellikler katmamız da s&amp;ouml;z konusu. Bir&amp;nbsp;sınıfı adından yola &amp;ccedil;ıkarak &amp;ouml;rneklememiz veya i&amp;ccedil;erisindeki değişmez değeri yakalamamız da m&amp;uuml;mk&amp;uuml;n. Daha yapılabilecek pek &amp;ccedil;ok şey olduğu da ortada. Bunları ilerleyen b&amp;ouml;l&amp;uuml;mlerimizde incelemeye gayret edeceğim.&amp;nbsp;B&amp;ouml;ylece geldik bir kod par&amp;ccedil;asının daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-12-16 16:51:00</pubDate>
  <slug>ruby-kod-parcaciklari-29-kod-yazan-kodlar</slug>
  <tags>
    <tag>metaprogramming</tag>
    <tag>dynamic-languages</tag>
    <tag>refactoring</tag>
    <tag>eval</tag>
    <tag>binding</tag>
    <tag>const_get</tag>
    <tag>define_method</tag>
    <tag>ruby</tag>
    <tag>ruby-kod-parçacıkları</tag>
    <tag>rubyist</tag>
    <tag>domain-specific-language</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>