<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF ile WF Entegrasyonu - 2</title>
  <description>Bir önceki yazımızda WCF(Windows Communication Foundation) servislerinin, WF(Windows WorkFlow) uygulamaları içerisinden nasıl çağırıldığını incelemiştik. Bu yazımızda ise tam tersine, bir Workflow örneğinin servis olarak nasıl sunulabileceğini analiz ediyor olacağız. Bazı durumlarda kod akışlarının birer servis olarak istemcilere sunulması gerekebilir.</description>
  <content>&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Değerli Okurlarım Merhabalar,&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bir &amp;ouml;nceki yazımızda &lt;strong&gt;WCF(Windows Communication Foundation)&lt;/strong&gt; servislerinin, &lt;strong&gt;WF(Windows WorkFlow)&lt;/strong&gt; uygulamaları i&amp;ccedil;erisinden nasıl &amp;ccedil;ağırıldığını incelemiştik. Bu yazımızda ise tam tersine, bir &lt;strong&gt;Workflow&lt;/strong&gt; &amp;ouml;rneğinin servis olarak nasıl sunulabileceğini analiz ediyor olacağız. Bazı durumlarda kod akışlarının birer servis olarak istemcilere sunulması gerekebilir. Burada s&amp;ouml;z konusu kod akışlarının &lt;strong&gt;Servis Y&amp;ouml;nelimli Mimarinin(Service Oriented Architecture)&lt;/strong&gt; imkanlarından yararlanıyor olması isteği &amp;ouml;n plana &amp;ccedil;ıkmatadır. &amp;Ccedil;ok doğal olarak servis gibi yayınlanan &lt;strong&gt;akış tipleri(Workflow Instance)&lt;/strong&gt;, istemci ile olan mesajlaşmalarında &lt;strong&gt; SOA&lt;/strong&gt; temelli olanakları kullanabilir hale gelmektedir. Bu noktada &lt;strong&gt; WCF&lt;/strong&gt; ile &lt;strong&gt;WF&lt;/strong&gt; entegrasyonu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınmalıdır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;WCF&lt;/strong&gt; servisleri &lt;strong&gt;WF&lt;/strong&gt; uygulamaları i&amp;ccedil;erisinden &amp;ccedil;ağırılırken ağırlıklı olarak &lt;strong&gt;.Net Framework 3.5&lt;/strong&gt; ile birlikte gelen &lt;strong&gt;SendActivity&lt;/strong&gt; bileşeni kullanılmaktadır. &lt;strong&gt;WF&lt;/strong&gt; &amp;ouml;rneklerinin servis olarak yayınlamasında ise başrol oyuncusu yine .Net Framework 3.5 ile birlikte gelen &lt;strong&gt; ReceiveActivity&lt;/strong&gt; isimli activity bileşenidir. &amp;Ouml;zellikle &lt;strong&gt;Visual Studio 2008 &lt;/strong&gt;kullanılarak servis destekli &lt;strong&gt;Workflow&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phaneleri kolay bir şekilde geliştirilebilmektedir. Bu ama&amp;ccedil;la &lt;strong&gt; Visual Studio 2008&lt;/strong&gt; ortamına &lt;strong&gt;Sequential&lt;/strong&gt; &lt;strong&gt;Workflow&lt;/strong&gt; &lt;strong&gt; Service&lt;/strong&gt; &lt;strong&gt;Library&lt;/strong&gt; ve &lt;strong&gt;State&lt;/strong&gt; &lt;strong&gt;Machine&lt;/strong&gt; &lt;strong&gt;Workflow&lt;/strong&gt; &lt;strong&gt;Service&lt;/strong&gt; &lt;strong&gt;Library&lt;/strong&gt; proje şablonları eklenmiştir. Tabi &amp;ccedil;ok doğal olarak geliştirilen iş akışı servislerinin bir uygulama tarafından barındırılması(Hosting) ve yayınlanmasıda gerekmektedir. &lt;strong&gt;Host&lt;/strong&gt; se&amp;ccedil;enekleri &lt;strong&gt;WF&lt;/strong&gt; servisleri i&amp;ccedil;inde aynıdır. &lt;strong&gt;IIS&lt;/strong&gt; &amp;uuml;zerinde, &lt;strong&gt; WAS(Windows Activation Service) &lt;/strong&gt;yardımıyla veya &lt;strong&gt;Self-Hosting&lt;/strong&gt; se&amp;ccedil;eneklerine g&amp;ouml;re barındırma ve yayınlama yapılabilir. &amp;Ouml;nemli olan noktalardan birisie normal WCF servislerinden farklı olaraktan &lt;strong&gt;Host&lt;/strong&gt; &amp;ccedil;alışma ortamını &lt;strong&gt;WorkflowServiceHost&lt;/strong&gt; tipinin y&amp;ouml;netmesidir. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;WF&lt;/strong&gt; uygulamasının servis olarak yayınlanması i&amp;ccedil;in istemcilere bir &lt;strong&gt;s&amp;ouml;zleşme(Contract)&lt;/strong&gt; bildirimi yapılması gerekmektedir. &amp;Ccedil;ok doğal olarak bu &lt;strong&gt;s&amp;ouml;zleşme(Contract)&lt;/strong&gt; bir &lt;strong&gt;aray&amp;uuml;z(Interface)&lt;/strong&gt; olarak tanımlanmalıdır. Aray&amp;uuml;z i&amp;ccedil;erisinde yer alan operasyonlar dışarıya &lt;strong&gt;ReceiveActivity&lt;/strong&gt; bileşeni ile sunulabilirler. Buna g&amp;ouml;re s&amp;ouml;zleşme i&amp;ccedil;erisinde tanımlanan her operasyon i&amp;ccedil;in&lt;em&gt;(&lt;strong&gt;OperationContract&lt;/strong&gt; niteliği ile imzalanmış metodlar)&lt;/em&gt; birer &lt;strong&gt;ReceiveActivity&lt;/strong&gt; oluşturulmalıdır. Bu noktada karşılaşılan &amp;ouml;nemli sorulardan biriside, istemcinin bu operasyona nasıl parametre g&amp;ouml;ndereceği veya cevap alacağıdır. Nitekim bir WCF k&amp;uuml;t&amp;uuml;phanesinde &amp;ccedil;oğunlukla asıl işi yapan bileşen, s&amp;ouml;zleşme tipinin uygulandığı bir sınıftır(Class). WF a&amp;ccedil;ısından bakıldığında ise bu g&amp;ouml;revi &lt;strong&gt;Workflow&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde tanımlanan &lt;strong&gt;&amp;ouml;zellikler(Properties)&lt;/strong&gt; yada &lt;strong&gt; alanlar(fields)&lt;/strong&gt; &amp;uuml;stlenmektedir. Bir başka deyişle, &lt;strong&gt; ReceiveActivity&lt;/strong&gt; irtibatta olduğu operasyon i&amp;ccedil;in gerekli parametreler ile haberleşmek adına s&amp;ouml;z konusu &amp;ouml;zellik veya alanlardan yararlanır. Dolayısıyla asıl iş &lt;strong&gt;ReceiveActivity&lt;/strong&gt; i&amp;ccedil;erisinden yapılmalıdır. &lt;strong&gt; ReceiveActivity&lt;/strong&gt; bileşeninin &lt;strong&gt;composite&lt;/strong&gt; bir bileşen olarak tanımlanmasının sebebide budur. &lt;strong&gt;ReceiveActivity&lt;/strong&gt; i&amp;ccedil;erisine &amp;ouml;rneğin &lt;strong&gt;CodeActivity&lt;/strong&gt; gibi bileşenler dahil edilerek operasyonun asıl işinin yapılacağı kod bloklarının işletilmesi sağlanabilir. İstemci a&amp;ccedil;ısından olaya bakıldığında yine bir &lt;strong&gt;proxy&lt;/strong&gt; nesnesinin servis ile olan haberleşmeyi sağladığı ortadadır. Aslında aşağıdaki şekil durumu biraz daha kolay bir şekilde a&amp;ccedil;ıklamaktadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_1.gif" alt="" width="540" height="485" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Şekle g&amp;ouml;re &lt;strong&gt;WorkflowActivity&lt;/strong&gt; sınıfının &lt;strong&gt;ReceiveActivity&lt;/strong&gt; bileşenleri, dışarıya servis &amp;uuml;zerinden sunulan operasyonlar ile ilişkili talep alma ve cevap g&amp;ouml;nderme işlemlerini &amp;uuml;stlenmektedir. &amp;Ccedil;ok doğal olarak servisi bir &lt;strong&gt;EndPoint&lt;/strong&gt; &amp;uuml;zerinden dışarıya sunmak gerekmektedir. &lt;strong&gt;EndPoint&lt;/strong&gt; tanımında dikkat edilmesi gereken noktalardan biriside,&lt;strong&gt; bağlayıcı tipin(Binding Type)&lt;/strong&gt; &lt;strong&gt;basicHttpContextBinding&lt;/strong&gt;, &lt;strong&gt;netTcpContextBinding&lt;/strong&gt; yada &lt;strong&gt;wsHttpContextBinding&lt;/strong&gt; bileşenlerinden birisi olmaslıdır. Bu bağlayıcı tiplerin ortak &amp;ouml;zelliği servis destekli iş akışları(Service-Enabled Workflow) ile haberleşilebilmesini sağlamalarıdır. Ancak istenirse &amp;ouml;zel bağlayıcılara &lt;strong&gt; ContextBindingElement&lt;/strong&gt; tipi uygulanarak workflow destekli hale getirilmeleride sağlanabilir. İstemci uygulama &amp;ccedil;ok doğal olarak servis ile olan haberleşme sırasında proxy sınıfından yararlanmak durumundadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;WF ve WCF entegrasyonun bir sonucu olarak istemciler bir Workflow aktivitesini servis bazlı olacak şekilde &amp;ccedil;ağırıp kullanabilmektedir. B&amp;ouml;ylece istemciler bir kod akışı s&amp;uuml;reciniservis tabanlı d&amp;uuml;ş&amp;uuml;nerek ele alabilirler. Buna JSON(JavaScriptObjectNotation) gibi mesajlaşma desteklerinin eklenebileceği d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde bir Workflow &amp;ouml;rneğinin herhangibir platform &amp;uuml;zerinden kullanılabilmeside m&amp;uuml;mk&amp;uuml;n hale gelmektedir. Bu WCF tanımında yer alan "her hangibir CLR tipinin servis olarak yayınlanabilmesi" ilkesinin bir sonucu olarak g&amp;ouml;r&amp;uuml;lebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu kadar karmaşık ve teorik bilgiden sonra &amp;ouml;rnek bir uygulama &amp;uuml;zerinden hareket ederek &lt;strong&gt;WF&lt;/strong&gt; uygulamaları i&amp;ccedil;erisinde servis yayınlamasının nasıl yapılabileceğini adım adım incelemeye &amp;ccedil;alışalım. İşe ilk olarak servis s&amp;ouml;zleşmesini ve operasyonlar i&amp;ccedil;in gerekli aktivite bileşenlerini i&amp;ccedil;erecek olan k&amp;uuml;t&amp;uuml;phaneyi tasarlamak ile başlamak doğru olacaktır. Bu ama&amp;ccedil;la &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; ortamında bir &lt;strong&gt;Sequential Workflow Service Library&lt;/strong&gt; projesi a&amp;ccedil;tığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;em&gt;(Bu şablon &lt;strong&gt;New Project-&amp;gt;WCF&lt;/strong&gt; sekmesi altında yer almaktadır.)&lt;/em&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_2.gif" alt="" width="616" height="217" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;S&amp;ouml;z konusu &lt;strong&gt;servis k&amp;uuml;t&amp;uuml;phanesine(WFSiparisKutuphanesi) &lt;/strong&gt;bakıldığında ilk dikkati &amp;ccedil;eken nokta referanslar kısmına &lt;strong&gt;Workflow&lt;/strong&gt; desteği i&amp;ccedil;in eklenen &lt;strong&gt; assembly&lt;/strong&gt;' lardır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_3.gif" alt="" width="268" height="300" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu noktada şablon olarak getirilen &lt;strong&gt; IWorkflow1.cs, Workflow1.cs&lt;/strong&gt; ve &lt;strong&gt;App.config&lt;/strong&gt; isimli dosyalar silinmiştir. &amp;Ouml;rnekte kullanılan servis s&amp;ouml;zleşmesi i&amp;ccedil;eriği ise aşağıdaki sınıf diagramında g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_6.gif" alt="" width="266" height="272" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using System.Runtime.Serialization;

namespace WFSiparisKutuphanesi
{
    [ServiceContract(Namespace = "http://www.bsenyurt.com/UrunSiparisServisi", Name = "UrunSiparisServisi")]
    public interface ISiparisSozlesmesi
    {
        [OperationContract]
        string SiparisVer(UrunBilgisi urun);
    }

    [DataContract]
    public class UrunBilgisi
    {
        [DataMember]
        public string UrunKodu { get; set; }
        [DataMember]
        public int Adet { get; set; }
        [DataMember]
        public DateTime SiparisTarihi { get; set; }
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;ISiparisSozlesmesi&lt;/strong&gt; isimi &lt;strong&gt; servis s&amp;ouml;zleşmesi(Service Contract)&lt;/strong&gt; &lt;strong&gt;SiparisVer&lt;/strong&gt; isimli tek bir operayon sunmaktadır. &lt;strong&gt;SiparisVer&lt;/strong&gt; metodu parametre olarak &lt;strong&gt; UrunBilgisi&lt;/strong&gt; sınıfına ait bir nesne &amp;ouml;rneği almaktadır. Bu nesneye ait veri, &amp;ccedil;alışma zamanında istemci tarafından servise doğru geleceğinden serileştirilebilir olması gerekmektedir. Bu sebepten doğal olarak &lt;strong&gt; veri s&amp;ouml;zleşmesi(Data Contract)&lt;/strong&gt; olacak şekilde tasarlanmıştır. SiparisVer isimli operasyon aynı zamanda geriye &lt;strong&gt;string&lt;/strong&gt; tipinden bir değerde d&amp;ouml;nd&amp;uuml;rmektedir. B&amp;ouml;ylece dışarıya sunulacak olan servis s&amp;ouml;zleşmesi tanımlanmıştır. Artık bu s&amp;ouml;zleşmeyi kullanacak olan aktivite sınıfının yazılması gerekmektedir. &amp;Ouml;rnekte bunun i&amp;ccedil;in bir adet &lt;strong&gt; Sequential Workflow Activity&lt;/strong&gt; sınıfı ele alınacaktır. Bunun i&amp;ccedil;in projeye &lt;strong&gt;Add-&amp;gt;Sequential Workflow &lt;/strong&gt;se&amp;ccedil;eneği ile yeni bir akış sınıfı eklenmelidir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_4.gif" alt="" width="417" height="201" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu adımda &lt;strong&gt;Sequential Workflow(with code seperation) &lt;/strong&gt;se&amp;ccedil;eneği işaretlenerek devam edilebilir. B&amp;ouml;ylece dizayn tarafı ile kodu birbirinden ayrı tutacak bir akış tipi oluşturulacaktır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_5.gif" alt="" width="540" height="459" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;WFSiparis.xoml (XOML-eXtensible Object Markup Language)&lt;/strong&gt; tasarım zamanında gerekli aktivite tiplerini barındıracaktır. &lt;strong&gt;WFSiparis&lt;/strong&gt; isimli sınıf &lt;strong&gt; SequentialWorkflowActivity&lt;/strong&gt; tipinden t&amp;uuml;remektedir. Servis s&amp;ouml;zleşmesi i&amp;ccedil;erisinde yer alan &lt;strong&gt;SiparisVer&lt;/strong&gt; metodu bu akış nesnesi i&amp;ccedil;erisinde &lt;strong&gt;ReceiveActivity&lt;/strong&gt; bileşeni tarafından ele alınmalıdır. Bununla birlikte &lt;strong&gt;SiparisVer&lt;/strong&gt; metodunun &lt;strong&gt;UrunBilgisi&lt;/strong&gt; ve d&amp;ouml;nd&amp;uuml;receği değer i&amp;ccedil;in birer &lt;strong&gt;&amp;ouml;zellik/alan(Property/Field)&lt;/strong&gt; i&amp;ccedil;ermesi gerekmektedir. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ouml;ncelikli olarak bir &lt;strong&gt;ReceiveActivity&lt;/strong&gt; bileşeni tasarım ekranına s&amp;uuml;r&amp;uuml;klenip bırakılmalıdır. &lt;strong&gt;ReceiveActivity&lt;/strong&gt; bileşeni &lt;strong&gt;SendActivity&lt;/strong&gt; bileşenine benzer olaraktan &lt;strong&gt; ServiceOperationInfo&lt;/strong&gt; &amp;ouml;zelliğini i&amp;ccedil;ermektedir. &amp;Ccedil;ok doğal olarak bu &amp;ouml;zellikten yararlanılarak hangi operasyonun ele alınacağı ve kullanılacak&lt;em&gt;(yada otomatik olarak &amp;uuml;retilecek)&lt;/em&gt; olan parametreler belirlenmelidir. &lt;strong&gt;ServiceOperationInfo&lt;/strong&gt; &amp;ouml;zelliğinde yer alan &amp;uuml;&amp;ccedil; nokta d&amp;uuml;ğmesine basıldıktan sonra aşağıdaki aray&amp;uuml;z ile karşılaşılır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_7.gif" alt="" width="493" height="99" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Burada yine &lt;strong&gt;Import&lt;/strong&gt; se&amp;ccedil;eneği kullanılarak aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi ilgili servis s&amp;ouml;zleşmesinin se&amp;ccedil;ilmesi gerekmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_8.gif" alt="" width="636" height="542" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ccedil;ok doğal olarak &lt;strong&gt;ISiparisSozlesmesi&lt;/strong&gt; otomatik olarak gelecektir. Bu noktada &lt;strong&gt;Workflow&lt;/strong&gt; i&amp;ccedil;erisinde birden fazla servis s&amp;ouml;zleşmesi tutulabileceği de unutulmamalıdır. Bu se&amp;ccedil;im işlemini takiben aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; elde edilir ve artık operasyon se&amp;ccedil;imi ve bunun i&amp;ccedil;in gerekli sınıf &amp;ouml;zelliklerinin oluşturulması adımına ge&amp;ccedil;ilebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_9.gif" alt="" width="493" height="500" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Parameters&lt;/strong&gt; kısmında &lt;strong&gt;String&lt;/strong&gt; tipinden y&amp;ouml;n&amp;uuml; &lt;strong&gt;Out&lt;/strong&gt; olan ve &lt;strong&gt;UrunBilgisi&lt;/strong&gt; tipinden y&amp;ouml;n&amp;uuml; &lt;strong&gt;In&lt;/strong&gt; olan birer parametre g&amp;ouml;r&amp;uuml;lmektedir. Bu parametrelerin akış i&amp;ccedil;erisinde ele alınması i&amp;ccedil;in karşılığı olan &amp;ouml;zelliklerin veya alanların sınıf i&amp;ccedil;erisine ya manuel yada otomatik olarak dahil edilmesi şarttır. Sonu&amp;ccedil; olarak aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşılacaktır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_10.gif" alt="" width="638" height="290" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Burada &lt;strong&gt;ReturnValue&lt;/strong&gt; ve &lt;strong&gt;urun&lt;/strong&gt; &amp;ouml;zellikleri i&amp;ccedil;in otomatik &amp;ouml;zellik &amp;uuml;rettirilmesi sağlanabilir. S&amp;ouml;z gelimi aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde &amp;ouml;rnek olarak &lt;strong&gt;SiparisVer&lt;/strong&gt; metodunun geri d&amp;ouml;n&amp;uuml;ş tipi i&amp;ccedil;in otomatik &amp;ouml;zellik &amp;uuml;rettirilmesinin nasıl sağlandığı g&amp;ouml;sterilmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_11.gif" alt="" width="380" height="344" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Aynı işlem urun &amp;ouml;zelliği i&amp;ccedil;inde yapıldıktan sonra &lt;strong&gt;receiveActivity1&lt;/strong&gt; i&amp;ccedil;in son durum aşağıdaki gibi olacaktır&lt;strong&gt;.&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_12.gif" alt="" width="472" height="255" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ccedil;ok doğal olarak bu yapılan değişiklikler sonrasında &lt;strong&gt;WFServis&lt;/strong&gt; isimli sınıfın i&amp;ccedil;eriği aşağıdaki gibi değişecektir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace WFSiparisKutuphanesi
{
    public partial class WFSiparis : SequentialWorkflowActivity
    {
        public static DependencyProperty receiveActivity1_urun1Property = DependencyProperty.Register("receiveActivity1_urun1", typeof(WFSiparisKutuphanesi.UrunBilgisi), typeof(WFSiparisKutuphanesi.WFSiparis));
        public static DependencyProperty receiveActivity1__ReturnValue_1Property = DependencyProperty.Register("receiveActivity1__ReturnValue_1", typeof(System.String), typeof(WFSiparisKutuphanesi.WFSiparis));

        [DesignerSerializationVisibilityAttribute(DesignerSerializationVisibility.Visible)]
        [BrowsableAttribute(true)]
        [CategoryAttribute("Parameters")]
        public UrunBilgisi receiveActivity1_urun1
        {
            get
            {
                return ((WFSiparisKutuphanesi.UrunBilgisi)(base.GetValue(WFSiparisKutuphanesi.WFSiparis.receiveActivity1_urun1Property)));
            }
            set
            {
                base.SetValue(WFSiparisKutuphanesi.WFSiparis.receiveActivity1_urun1Property, value);
            }
        }

        [DesignerSerializationVisibilityAttribute(DesignerSerializationVisibility.Visible)]
        [BrowsableAttribute(true)]
        [CategoryAttribute("Parameters")]
        public string receiveActivity1__ReturnValue_1
        {
            get
            {
                return ((string)(base.GetValue(WFSiparisKutuphanesi.WFSiparis.receiveActivity1__ReturnValue_1Property)));
            }
            set
            {
                base.SetValue(WFSiparisKutuphanesi.WFSiparis.receiveActivity1__ReturnValue_1Property, value);
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Artık &lt;strong&gt;ReceiveActivity&lt;/strong&gt; i&amp;ccedil;erisine istemcilere d&amp;ouml;nd&amp;uuml;r&amp;uuml;lecek olan cevap i&amp;ccedil;in gerekli &lt;strong&gt;activity&lt;/strong&gt; bileşeninin eklenmesi adımına ge&amp;ccedil;ilebilir. Sonu&amp;ccedil; itibariyle istemciler &lt;strong&gt;SiparisVer&lt;/strong&gt; metoduna &amp;ccedil;ağrıda bulunduktan sonra bir aktivitenin işletilmesi gerekmektedir. Bu aktivite &lt;strong&gt;ReceiveActivity&lt;/strong&gt; i&amp;ccedil;erisinde tanımlanabilir. S&amp;ouml;z gelimi &lt;strong&gt;CodeActivity&lt;/strong&gt; bu işlem i&amp;ccedil;in idealdir. Operasyona istemciden gelen bilgi, aktivite sınıfının &lt;strong&gt; receiveActivity1_urun1&lt;/strong&gt; &amp;ouml;zelliği &amp;uuml;zerinden elde edilebilir.&lt;/p&gt;
&lt;p&gt;Metoddan istemciye d&amp;ouml;nd&amp;uuml;r&amp;uuml;lecek olan &lt;strong&gt;string&lt;/strong&gt; değer ise &lt;strong&gt; receiveActivity1_ReturnValue1&lt;/strong&gt; &amp;ouml;zelliğine set edilmelidir. Bu atama işlemide CodeActivity bileşeni i&amp;ccedil;erisinde yapılabilir. &lt;em&gt;(Burada &lt;strong&gt; CodeActivity&lt;/strong&gt; kullanılması şart değildir. &amp;Ouml;nemli olan aktivite sınıfı i&amp;ccedil;erisine eklenen &amp;ouml;zellikler yardımıyla istemciden operasyona gelen parametre bilgilerinin alınabilmesi veya geriye d&amp;ouml;nd&amp;uuml;relecek bir sonucun &amp;uuml;retilebilmesi ve istemci tarafından ele alınabilmesidir.)&lt;/em&gt; Şimdi &lt;strong&gt; ReceiveActivity&lt;/strong&gt; i&amp;ccedil;erisine bir &lt;strong&gt;CodeActivity&lt;/strong&gt; eklediğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_13.gif" alt="" width="205" height="255" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;CodeActivity1&lt;/strong&gt; bileşeninin &lt;strong&gt; ExecuteCode&lt;/strong&gt; &amp;ouml;zelliğine &amp;ouml;rnek olarak &lt;strong&gt;SiparisiIsle&lt;/strong&gt; değerini verip kod i&amp;ccedil;eriğini aşağıdaki gibi geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim. &lt;em&gt;(Şu anda ama&amp;ccedil; WF servislerinin nasıl yazılacağını g&amp;ouml;rmek olduğundan &lt;strong&gt; Console&lt;/strong&gt; tabanlı host ve istemci uygulamalar yazılacaktır. Bu nedenle &lt;strong&gt;CodeActivity&lt;/strong&gt; bileşeninin işaret edeceği metod i&amp;ccedil;erisinden o andaki talep bilgilerini değerlendirmek amacıyla Console ekranına bilgi yazdırılmaktadır.)&lt;/em&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void SiparisiIsle(object sender, EventArgs e)
{
    // Operasyona gelen istemci &amp;ccedil;ağrısında UrunBilgisi nesne &amp;ouml;rneğine ait veriler bulunmaktadır. Bu verilere aktivite sınıfının &amp;ouml;zellikleri &amp;uuml;zerinden erişilebilir.
    Console.WriteLine("Adet talebi : {0} Urun Numarası : {1} İstek Tarihi : {2}", receiveActivity1_urun1.Adet, receiveActivity1_urun1.UrunKodu, receiveActivity1_urun1.SiparisTarihi.ToString());
    receiveActivity1__ReturnValue_1 = "Istek Alınmıştır"; // İstemciye operasyonda d&amp;ouml;necek olan sonu&amp;ccedil;
}&lt;/pre&gt;
&lt;p&gt;Artık servisi barındıracak olan &lt;strong&gt;Host&lt;/strong&gt; uygulamanın yazılmasına başlanabilir. Host uygulama daha &amp;ouml;ncedende bahsedildiği gibi &lt;strong&gt;WCF&lt;/strong&gt; mimarisinin izin verdiği herhangibir &amp;ccedil;eşitte olabilir&lt;strong&gt; &lt;em&gt;(IIS, Console, WPF, WAS, Windows Service...)&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;.&lt;/em&gt; &amp;Ouml;rnekte &lt;strong&gt;Host&lt;/strong&gt; uygulama basit bir &lt;strong&gt;Console&lt;/strong&gt; projesi olarak geliştirilmektedir. Host uygulamada &amp;ouml;nemli olan noktalardan birisi, &lt;strong&gt; Workflow&lt;/strong&gt; &lt;strong&gt;Service&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesi ile birlikte, &lt;strong&gt;Workflow&lt;/strong&gt; ve &lt;strong&gt;WCF&lt;/strong&gt; &amp;ccedil;alışma ortamları i&amp;ccedil;in gerekli &lt;strong&gt;assembly&lt;/strong&gt;' lara ihtiya&amp;ccedil; olduğudur.&lt;/p&gt;
&lt;p&gt;Bu nedenle ilk etapta Console uygulamasında &lt;strong&gt; System.ServiceModel, System.Workflow.Activites, System.Workflow.ComponentModel, System.WorkflowServices&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanelerinin referans edilmesi gerekmektedir. Host uygulama i&amp;ccedil;in &amp;ouml;nem arz eden noktalardan biriside &amp;ccedil;alışma zamanı ortamı i&amp;ccedil;in gerekli konfigurasyon ayarlarıdır. Aynen WCF servislerinin yazılmasında olduğu gibi config dosyalarından yararlanılabilir yada kod bazında gerekli ayarlamalar yapılabilir. &amp;Ouml;rnekte kullanılan config dosyası i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;Host Uygulama App.config;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service behaviorConfiguration="WFSiparisBehavior" name="WFSiparisKutuphanesi.WFSiparis"&amp;gt;
                &amp;lt;endpoint address="" binding="wsHttpContextBinding" name="WfSiparisWsHttpEndPoint" contract="WFSiparisKutuphanesi.ISiparisSozlesmesi" /&amp;gt;
                &amp;lt;endpoint address="mex" binding="mexHttpBinding" name="MexEndPoint" contract="IMetadataExchange" /&amp;gt;
                &amp;lt;host&amp;gt;
                    &amp;lt;baseAddresses&amp;gt;
                        &amp;lt;add baseAddress="http://localhost:10001/WFSiparisServisi" /&amp;gt;
                    &amp;lt;/baseAddresses&amp;gt;
                &amp;lt;/host&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
        &amp;lt;behaviors&amp;gt;
            &amp;lt;serviceBehaviors&amp;gt;
                &amp;lt;behavior name="WFSiparisBehavior" &amp;gt;                    
                    &amp;lt;serviceMetadata httpGetEnabled="true" /&amp;gt;
                         &amp;lt;serviceDebug includeExceptionDetailInFaults="true"/&amp;gt;
                &amp;lt;/behavior&amp;gt;
            &amp;lt;/serviceBehaviors&amp;gt;
        &amp;lt;/behaviors&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Konfigurasyon dosyasında g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi iki adet &lt;strong&gt;EndPoint&lt;/strong&gt; tanımlaması yapılmaktadır. Bunlardan birisi bağlayıcı olarak &lt;strong&gt;wsHttpContextBinding&lt;/strong&gt; tipini kullanmaktadır. Diğer &lt;strong&gt;EndPoint&lt;/strong&gt; ise &lt;strong&gt;base&lt;/strong&gt; &lt;strong&gt;address&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt; metadata&lt;/strong&gt; erişimine izin veren bir &lt;strong&gt;Mex(Metadata Exchange)&lt;/strong&gt; &lt;strong&gt; EndPoint&lt;/strong&gt; olarak tanımlanmıştır. &lt;em&gt;(Elbette host uygulamanın IIS &amp;uuml;zerinde tutulduğu bir senaryoda Mex EndPoint bildirimine gerek yoktur.)&lt;/em&gt; Host uygulamanın &lt;strong&gt;Main&lt;/strong&gt; metoduna ait kodlar ise aşağıdaki gibi geliştirilebilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using System.Workflow.Runtime;
using WFSiparisKutuphanesi;

namespace Sunucu
{
    class Program
    {
        static void Main(string[] args)
        {
            // Workflow servisi i&amp;ccedil;in gerekli &amp;ccedil;alışma ortamının hazırlanmasını WorkflowServiceHost tipi &amp;uuml;stlenir
            // Parametre olarak yayınlanacak servis bazlı kullanılacak olan aktivite sınıfı belirtilir.
            WorkflowServiceHost host = new WorkflowServiceHost(typeof(WFSiparis));
            // Host uygulama a&amp;ccedil;ıldığından devreye girecek olay metodu
            host.Opened += delegate(object sender, EventArgs arg) 
            {
                Console.WriteLine("Host opened");
            };
            // Host uygulama kapatıldığında devreye girecek olan olay metodu
            host.Closed += delegate(object sender, EventArgs arg)
            {
                Console.WriteLine("Host Closed");
            };
            host.Open(); // Host a&amp;ccedil;ılır
            Console.WriteLine("Servis &amp;ccedil;alışıyor. Kapatmak i&amp;ccedil;in bir tuşa basın");
            Console.ReadLine();
            host.Close(); // Host kapatılır
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Artık istemci uygulamanın yazılmasına ge&amp;ccedil;ilebilir. Ama &amp;ouml;ncesinde istemci i&amp;ccedil;in gerekli &lt;strong&gt;proxy&lt;/strong&gt; tipinin ve &lt;strong&gt;konfigurasyon&lt;/strong&gt; dosyası i&amp;ccedil;eriğinin &amp;uuml;retilmesi gerekmektedir. İki se&amp;ccedil;enek vardır. &lt;strong&gt;Svcutil&lt;/strong&gt; aracı ve &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; ortamında ele alınabilen &lt;strong&gt;Add Service Reference&lt;/strong&gt;. &lt;strong&gt;Svcutil&lt;/strong&gt; aracı komut satırından aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer aldığı gibi kullanılabilir. Tabiki bu işlem sırasında &lt;strong&gt;Host&lt;/strong&gt; uygulamanın &amp;ccedil;alışıyor olması ve servisin dışarıdan erişilebilir durumda bulunması gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_14.gif" alt="" width="630" height="265" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Visual Studio 2008 &lt;/strong&gt;ortamında &lt;strong&gt; Add Service Reference &lt;/strong&gt;se&amp;ccedil;eneği yardımıyla da Proxy ve config &amp;uuml;retimi ger&amp;ccedil;ekleştirilebilir. Elbette bu yaklaşımda da Host uygulamanın &amp;ccedil;alışıyor olması gerekmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_15.gif" alt="" width="585" height="564" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ouml;rneğimizde yer alan &lt;strong&gt;proxy&lt;/strong&gt; ve &lt;strong&gt; config&lt;/strong&gt; dosyalarının &amp;uuml;retimi i&amp;ccedil;in &lt;strong&gt;Add Service Reference&lt;/strong&gt; yaklaşımı kullanılmıştır. Yukarıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndende takip edilebileceği gibi istemci uygulama &lt;strong&gt;base address&lt;/strong&gt; ile belirtilen &lt;strong&gt;Url&lt;/strong&gt; adresi &amp;uuml;zerinden servis s&amp;ouml;zleşmesine erişebilmekte ve yayınlanan servis operasyonlarını g&amp;ouml;rebilmektedir. İstemci uygulamada basit bir &lt;strong&gt;Console&lt;/strong&gt; projesi olarak tasarlanmıştır ve &lt;strong&gt;Main&lt;/strong&gt; metodunun kod i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using Istemci.WFSiparisServisi;

namespace Istemci
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Sipariş i&amp;ccedil;in bir tuşa basın");
            Console.ReadLine();

            // SiparisVer metodu i&amp;ccedil;in gerekli parametre &amp;uuml;retilir
            UrunBilgisi urn = new UrunBilgisi() 
                { 
                    Adet = 10, 
                    UrunKodu = "AB-100", 
                    SiparisTarihi = DateTime.Now 
                };

            // Proxy &amp;uuml;retimi ger&amp;ccedil;ekleştirilir
            UrunSiparisServisiClient servis = new UrunSiparisServisiClient();
            Console.WriteLine("Talep g&amp;ouml;nderiliyor");
            // WF Servis operasyonu &amp;ccedil;ağırılır
            string cevap=servis.SiparisVer(urn);
            // Operasyon sonucu g&amp;ouml;sterilir
            Console.WriteLine(cevap);
    
            Console.ReadLine();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;nce &lt;strong&gt;Host&lt;/strong&gt; uygulama sonrasında istemci uygulama &amp;ccedil;alıştırılarak test edildiğinde aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; elde edilir. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi istemci uygulama &lt;strong&gt;Workflow&lt;/strong&gt; operasyonunu başarılı bir şekilde kullanabilmiştir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_16.gif" alt="" width="529" height="166" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Hatta birden fazla istemci uygulama &amp;ccedil;alıştırıldığındada WF servisinin başarılı bir şekilde her istemciye cevap verdiği g&amp;ouml;r&amp;uuml;lmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_18.gif" alt="" width="527" height="396" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Ancak dikkat edilmesi gereken &amp;ouml;nemli bir durum vardır. Aynı istemci uygulama tarafından ikinci bir sipariş isteği geldiğinde, bir başka deyişle &lt;strong&gt;SiparisVer&lt;/strong&gt; metodu aynı proxy &amp;ouml;rneği &amp;uuml;zerinden ikinci bir kez &amp;ccedil;ağırıldığında ne olacaktır? Bunun i&amp;ccedil;in koda aşağıdaki satırları eklediğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;cevap = servis.SiparisVer(new UrunBilgisi() { Adet = 8, SiparisTarihi = DateTime.Now, UrunKodu = "KL-450" });
Console.WriteLine(cevap);&lt;/pre&gt;
&lt;p&gt;Uygulama test edildiğinde &amp;ccedil;alışma zamanında ikinci &lt;strong&gt;SiparisVer&lt;/strong&gt; metodu &amp;ccedil;ağrısında aşağıdaki istisna(Exception) mesajının alındığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;em&gt;(Detaylı hata mesajının istemci tarafındanda g&amp;ouml;r&amp;uuml;lebilmesi i&amp;ccedil;in servis tarafında &lt;strong&gt; &amp;lt;serviceDebug includeExceptionDetailInFaults ="true"/&amp;gt; &lt;/strong&gt;bilgisinin eklenmiş olması gerekmektedir.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk250_17.gif" alt="" width="614" height="318" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bunun sebebi gelen talep sonrasında sunucu tarafında ilgili istemci i&amp;ccedil;in &amp;uuml;retilen Workflow servis &amp;ouml;rneğinin cevap verdikten sonra artık olmayışıdır. Bu nedenle ikinci talep aslında istemcinin daha &amp;ouml;nceden kullandığı Workflow servis &amp;ouml;rneği i&amp;ccedil;in yaptığı istektir. Oysaki &lt;strong&gt;host&lt;/strong&gt; uygulama tarafında bu Workflow servis &amp;ouml;rneğinin işi &amp;ouml;nceki talebin sonu&amp;ccedil;lanması ile bitmiştir. &lt;em&gt;(Tabi burada kolaya ka&amp;ccedil;ılarak pratik bir &amp;ccedil;&amp;ouml;z&amp;uuml;m olarak istemci uygulama i&amp;ccedil;erisinde her operasyon &amp;ccedil;ağrısı &amp;ouml;ncesinde yeni bir proxy &amp;uuml;retimi yoluna gidilebilir ki bu tavsiye edilen bir yol değildir.) &lt;/em&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;İşte burada uzun s&amp;uuml;reli durağan olması gereken bir Workflow servisi &amp;ouml;rneği s&amp;ouml;z konusudur. Yani &lt;strong&gt; Workflow&lt;/strong&gt; &amp;ouml;rneğinin durumunu koruması gerekmektedir. &lt;strong&gt;Persistence&lt;/strong&gt; servisleri kullanılarak bu sorun &amp;ccedil;&amp;ouml;z&amp;uuml;mlenebilir. Bu ama&amp;ccedil;la &lt;strong&gt; SqlWorkflowPersistenceService&lt;/strong&gt; tipinden yararlanılarak ilgili durağanlığın ger&amp;ccedil;ekleştirilmesi sağlanabilir. Tabi bu ama&amp;ccedil;la &amp;ouml;ncelikli olarak SQL &amp;uuml;zerinde ilgili veritabanının oluşturulması ve tabloların hazırlanması gerekmektedir. Sonrasında ise ilgili PersistenceService' in &amp;ouml;rneklenip Workflow servisi &amp;ccedil;alışma ortamına kod yardımıyla yada konfigurasyon bazında bildirilmesi gerekmektedir. Bu konu yazının kapsamı dışına &amp;ccedil;ıktığından burada ele alınmayacaktır. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalede basit olarak Workflow &amp;ouml;rneklerinin birer servis olarak nasıl yayımlanabileceğini adım adım incelemeye &amp;ccedil;alıştık. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;a href="/makale/images/WFServisleri.rar"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;</content>
  <pubDate>2008-04-23 12:00:00</pubDate>
  <slug>WCF-ile-WF-Entegrasyonu-2-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
    <tag>wf</tag>
    <tag>windows-workflow-foundation</tag>
  </tags>
  <categories>
    <category>WCF</category>
    <category>WF</category>
  </categories>
</post>