<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Xml Web Servisleri - 3 ( Mimarinin Temelleri - SOAP)</title>
  <description>Bir web servisinin, istemci uygulamalar tarafından nasıl kullanılabildiğini anlamak, web servislerinin mimarisini iyi bilmekle mümkündür. Mimariyi kolay bir şekilde anlayabilmek için, daha önceki makalemizde geliştirdiğimiz web servisi ve istemci uygulamayı göz önüne alacağız. Herşeyden önce geliştirdiğimiz web servisi local olarak test edilebilen ve tarayıcı üzerinde çalışabilen bir asmx dosyasından ve buna bağlı Code-Behind dosyasından oluşmaktadır. Web servisini test etmek için, web servisinin bulunduğu adresteki asmx uzantılı dosyayı, tarayıcı penceresinden çalıştırmak yeterlidir. Bunun sonucunda, tarayıcı penceresinde bu web servisi hakkındaki bilgilere ulaşabilir ve içerdiği metodları görebiliriz.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, Xml Web Servislerinin mimarisine daha yakında bakmaya &amp;ccedil;alışacak ve SOAP (Simple Object Access Protocol) 'ı kısaca tanımaya &amp;ccedil;alışacağız. Bir web servisinin, istemci uygulamalar tarafından nasıl kullanılabildiğini anlamak, web servislerinin mimarisini iyi bilmekle m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Mimariyi kolay bir şekilde anlayabilmek i&amp;ccedil;in, daha &amp;ouml;nceki makalemizde geliştirdiğimiz web servisi ve istemci uygulamayı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alacağız. Herşeyden &amp;ouml;nce geliştirdiğimiz web servisi local olarak test edilebilen ve tarayıcı &amp;uuml;zerinde &amp;ccedil;alışabilen bir asmx dosyasından ve buna bağlı Code-Behind dosyasından oluşmaktadır. Web servisini test etmek i&amp;ccedil;in, web servisinin bulunduğu adresteki asmx uzantılı dosyayı, tarayıcı penceresinden &amp;ccedil;alıştırmak yeterlidir. Bunun sonucunda, tarayıcı penceresinde bu web servisi hakkındaki bilgilere ulaşabilir ve i&amp;ccedil;erdiği metodları g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;Ancak burada yer alan Service Description bağlantısı bize başka bir olanak daha sağlamaktadır. Bu bağlantı yardımıyla web servisimizin t&amp;uuml;m i&amp;ccedil;eriğini anlatan bir WSDL d&amp;ouml;k&amp;uuml;manına erişebiliriz. WSDL d&amp;ouml;k&amp;uuml;manının en &amp;ouml;nemli yanı, XML tabanlı bir i&amp;ccedil;eriğe sahip olmasıdır. Diğer yandan bu d&amp;ouml;k&amp;uuml;man, web servisinde kullanılabilecek t&amp;uuml;m metodlara, parametrelere ve d&amp;ouml;n&amp;uuml;ş değerlerine ilişkin bilgileri i&amp;ccedil;ermektedir.&lt;/p&gt;
&lt;p&gt;Peki bu WSDL d&amp;ouml;k&amp;uuml;manı ne i&amp;ccedil;in oluşturulur? İşte bu noktada istemci uygulamaya bir g&amp;ouml;z atmakta fayda vardır. İstemci uygulamanın web servisini kullanabilmesi i&amp;ccedil;in, ilk &amp;ouml;nce web servisinin bulunduğu adrese başvurması gerekir. Bu başvurunun ardından web servisine ait referansı istemci uygulamaya eklediğimizde, bir takım yeni dosyalarında uygulamaya eklendiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bu dosyalardan belkide en &amp;ouml;nemli olanı Reference.cs isimli dosyadır. Geliştirdiğimiz uygulama ele alındığında Reference.cs dosyasının i&amp;ccedil;eriği aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Diagnostics;
using System.Xml.Serializationg
using System;
using System.Web.Services.Protocols;
using System.ComponentModel;
using System.Web.Services;

[System.Diagnostics.DebuggerStepThroughAttribute()]
[System.ComponentModel.DesignerCategoryAttribute("code")]
[System.Web.Services.WebServiceBindingAttribute(Name="Geometrik HesaplamalarSoap", Namespace="http://ilk/servis/")]
public class GeometrikHesaplamalar : System.Web.Services.Protocols.SoapHttpClientProtocol 
{
    public GeometrikHesaplamalar() 
    {
        this.Url = "http://localhost/GeoWebServis/GeoMat.asmx";
    }
    
    [System.Web.Services.Protocols.SoapDocumentMethodAttribute("http://ilk/servis/DaireAlan", RequestNamespace="http://ilk/servis/", ResponseNamespace="http://ilk/servis/", Use=System.Web.Services.Description.SoapBindingUse.Literal, ParameterStyle=System.Web.Services.Protocols.SoapParameterStyle.Wrapped)]
    public System.Double DaireAlan(System.Double r)
    {
        object[] results = this.Invoke("DaireAlan", new object[]{r});
        return ((System.Double)(results[0]));
    }
    
    public System.IAsyncResult BeginDaireAlan(System.Double r, System.AsyncCallback callback, object asyncState) 
    {
        return this.BeginInvoke("DaireAlan", new object[] {r}, callback, asyncState);
    }
    
    public System.Double EndDaireAlan(System.IAsyncResult asyncResult) 
    {
        object[] results = this.EndInvoke(asyncResult);
        return ((System.Double)(results[0]));
    }
    
    [System.Web.Services.Protocols.SoapDocumentMethodAttribute("http://ilk/servis/DaireCevre",     RequestNamespace="http://ilk/servis/", ResponseNamespace="http://ilk/servis/", Use=System.Web.Services.Description.SoapBindingUse.Literal, ParameterStyle=System.Web.Services.Protocols.SoapParameterStyle.Wrapped)]
    public System.Double DaireCevre(System.Double r) 
    {
        object[] results = this.Invoke("DaireCevre", new object[] {r});
        return ((System.Double)(results[0]));
    }
    
    public System.IAsyncResult BeginDaireCevre(System.Double r, System.AsyncCallback callback, object asyncState) 
    {
        return this.BeginInvoke("DaireCevre", new object[] {r}, callback, asyncState);
    } 

    public System.Double EndDaireCevre(System.IAsyncResult asyncResult) 
    {
        object[] results = this.EndInvoke(asyncResult);
        return ((System.Double)(results[0]));
    }
}&lt;/pre&gt;
&lt;p&gt;Visual Studio.NET tarafından otomatik olarak oluşturulan bu dosyada dikkat &amp;ccedil;ekici noktalar vardır. Herşeyden &amp;ouml;nce, karşımızda, web servisimizin bir g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; yer almaktadır. Web servisimizde yazdığımız metodlar kullandıkları parametreler ve daha başka bilgiler. Ancak &amp;ouml;nemli olan bu dosya sayesinde, istemci uygulamanın artık web servisine ait bir nesne &amp;ouml;rneğini oluşturup kullanabilecek olmasıdır. Dolayısıyla, istemci uygulamamıza web servisimize ait referansı eklediğimizde, istemci uygulamda bu servise ait bir nesne yapısı oluşturulabilmiştir. Bu sayede aşağıdaki gibi bir bildirim ge&amp;ccedil;erli hale gelir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;localhost.GeometrikHesaplamalar gh=new Istemci.localhost.GeometrikHesaplamalar();&lt;/pre&gt;
&lt;p&gt;Dahası, bu nesne &amp;uuml;zerinden, web servisindeki metodları aynı isimler ile kullanabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;lblAlan.Text=gh.DaireAlan(r).ToString();
lblCevre.Text=gh.DaireCevre(r).ToString();&lt;/pre&gt;
&lt;p&gt;Olaya daha detaylı bakıldığında, Reference.cs&amp;rsquo; nin aslında, istemci ve web servisi arasındaki haberleşmeyi sağlayacak bir Proxy nesnesini oluşturmak amacıyla kullanıldığını s&amp;ouml;yleyebiliriz. Dolayısıyla, istemci uygulama bu servisi kullanmak istediğinde, yani bu servis &amp;uuml;zerinden bir metodu &amp;ccedil;ağırmak istediğinde, bu talebi proxy nesnesinden ister. Proxy nesnesi ise bu talebi , web servisine iletir. Web servisi gelen talebi değerlendirir ve &amp;uuml;rettiği cevabı yine istemci uygulamadaki proxy nesnesine g&amp;ouml;nderir. Proxy nesneside sonu&amp;ccedil;ları, uygulama ortamına iletir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk100_1.gif" alt="" width="511" height="431" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. Proxy Nesnesini ve SOAP' ın Xml Web Servisi Mimarisindeki yeri.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Diğer bir sorun, proxy nesnesine gelen taleplerin, web servisine giderken hi&amp;ccedil; bir engel ile karşılaşmadan nasıl hareket edeceği ve geri geleceğidir. İstemci uygulama, proxy nesnesinde normal olarak talepte bulunur ve cevapları alır. Buradaki ilişki normal olarak bir nesne.metod ilişkisidir. Ancak proxy nesnesi bu mesajları, esnek, kolay okunabilir, herhangibir engele takılmayacak bir hale getirmek durumundadır. Bu iş i&amp;ccedil;in XML tabanlı bir bilgi akışı bi&amp;ccedil;ilmiş kaftandır. Yinede hareket edecek mesajların uygun bir formasyonda taşınmaları ve web servisinin anlayabileceği bir dilde ifade edilebilmeleri daha doğrudur. Bu noktada &lt;strong&gt;SOAP (Simple Object Access Protocol &amp;ndash; Basit Nesne Erişim Antlaşması)&amp;nbsp;&lt;/strong&gt; devreye girer.&lt;/p&gt;
&lt;p&gt;Web servislerinin kullanılmasında, web servisleri ve istemciler arasındaki haberleşmenin belirli standartlar &amp;ccedil;er&amp;ccedil;evesinde geliştirilmesi &amp;ccedil;ok &amp;ouml;nemlidir. SOAP (Simple Access Object Protocol) işte bu noktada devreye giren ve web servisi-istemci sisteminin en &amp;ouml;nemli kısmını oluşturan bir yapı taşıdır. SOAP, web servisleri ve istemciler arasında gidip gelecek mesajların, XML tabanlı olarak belirlendiği standartlara uygun formatta taşınmasını sağlayan bir protokold&amp;uuml;r. &amp;Ccedil;oğunlukla HTTP &amp;uuml;zerinde &amp;ccedil;alışan SOAP, FTP ve SMTP gidi diğer iletişim protokolleri &amp;uuml;zerinden de kullanılabilir.&lt;/p&gt;
&lt;p&gt;SOAP protokol&amp;uuml;, web servisleri ile istemciler arasında ger&amp;ccedil;ekleştirilen veri alışverişinde, karşılıklı olarak akıcak mesajların nasıl ve ne şekilde paketleneceğini yada başka bir deyişle bilgilerin nasıl kaps&amp;uuml;lleneceğini belirtir. SOAP, &amp;ouml;z&amp;uuml;nde XML tabanlı mesajların oluşturulmasını belirtir. Bu nedenle SOAP protokol&amp;uuml;n&amp;uuml; uygulayan mesajlar (ki bunlar SOAP Mesajı olarak adlandırılır), herhangibir ağ ortamında hi&amp;ccedil; bir sorunla karşılaşmadan uzak makineler arasında iletilebilirler. SOAP protokol&amp;uuml;, 4 temel &amp;uuml;zerine inşa edilmiştir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk100_2.gif" alt="" width="408" height="222" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. SOAP Protokol&amp;uuml;n&amp;uuml;n Temelleri.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;SOAP protokol&amp;uuml;n&amp;uuml;n dayandığı bu temel kurallar i&amp;ccedil;erisinde en &amp;ouml;nemlisi Envelope kısmıdır. Bir SOAP mesajı mutlaka bir zarf olarak teşkil edilmeli ve Zarf kurallarına g&amp;ouml;re tasarlanmalıdır. Diğer temellerin uygulanması zorunlu değildir. Veri kodlama kuralları, &amp;ouml;zellikle serileştirilen nesneler i&amp;ccedil;in bir model sunar. Başka&amp;nbsp; bir deyişle, tanımlanmış veri tiplerinin uygulama i&amp;ccedil;in kullanılma kurallarına karar verir. Bu katmandaki kuralların uygulanması opsiyoneldir. Mesaj değişim modeli, web servisi ile istemciler arasında değiş tokuş edilen mesajlar i&amp;ccedil;in bir istek/cevap deseni tanımlar. SOAP, Remote Procedure Call tip mekanizmasını esas alan bir veri değiş tokuş desenini kullansada bu bir zorunluluk değildir. Mesaj değişim modelide opsiyoneldir. Veri bağlama kuralları ile, SOAP&amp;rsquo;ın iletişim protokollerinin birbirlerine nasıl bağlanacağına dair tanımlamalar i&amp;ccedil;erir. Veri bağlama kurallarıda opsiyoneldir.&lt;/p&gt;
&lt;p&gt;Kısaca SOAP protokol&amp;uuml;, mutlaka iletişimsel mesajların SOAP Zarf kurallarına uygun bir bi&amp;ccedil;imde tasarlanmasını zorunlu kılar. SOAP mesajlarının zarf kurallarına uygun bir bi&amp;ccedil;imde tasarlanması i&amp;ccedil;in aşağıdaki şekilde belirtilen format kullanılır. Burada bir SOAP zarfının temel yapısı belirtilmiştir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk100_3.gif" alt="" width="587" height="132" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. SOAP Zarfının Temel Yapısı.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;SOAP Zarfları bir SOAP mesajının başlık ve g&amp;ouml;vde olmak &amp;uuml;zere iki ana kısımdan oluşması gerektiğini belirtir. En &amp;ouml;nemli kısım g&amp;ouml;vdedir. Burada, yapılan metod &amp;ccedil;ağırımlarına ilişkin bilgiler ile &amp;ccedil;ağrı sonucu istemcilere g&amp;ouml;nderilecek cevaplara ait xml tabanlı bilgiler yer alır.&lt;/p&gt;
&lt;p&gt;SOAP mesajlarını anlamanın en iyi yolu, onları ger&amp;ccedil;ek bir uygulamada takip etmektir. Bu ama&amp;ccedil;la, geliştirmiş olduğumuz Web servisini ve istemci uygulamamızı kullanacağız. İstemci ve web servisi arasında hareket eden SOAP mesajlarını takip edebilmek amacıyla Microsoft firmasının sunduğu &lt;strong&gt;SOAP Tookit&lt;/strong&gt; aracını kullanabiliriz. Bu aracı bug&amp;uuml;n itibariyle &lt;a href="http://download.microsoft.com/download/2/e/0/2e068a11-9ef7-45f5-820f-89573d7c4939/soapsdk.exe"&gt;http://download.microsoft.com/download/2/e/0/2e068a11-9ef7-45f5-820f-89573d7c4939/soapsdk.exe&lt;/a&gt; adresinden temin edebilirsiniz. SOAP mesajlarını takip edebilmek amacıyla istemci uygulamamızda ufak bir değişiklik yapmamız gerekiyor. Bunun i&amp;ccedil;in istemci uygulamda, web servisine ait proxy nesnesinin sınıf dosyası i&amp;ccedil;erisinde (reference.cs) yer alan,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;this.Url = "http://localhost/GeoWebServis/GeoMat.asmx";&lt;/pre&gt;
&lt;p&gt;satırını&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;this.Url = "http://localhost:8080/GeoWebServis/GeoMat.asmx";&lt;/pre&gt;
&lt;p&gt;şeklinde değiştirmeliyiz. Şimdi SOAP Toolkit 3.0 ile y&amp;uuml;klenen &lt;strong&gt;Trace Utility&lt;/strong&gt; aracını &amp;ccedil;alıştıralım. Ardından Trace Utility aracında, &lt;strong&gt;New&lt;/strong&gt; men&amp;uuml;s&amp;uuml;nden, &lt;strong&gt;Formatted Trace&lt;/strong&gt;&amp;rsquo; i se&amp;ccedil;elim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk100_4.gif" alt="" width="284" height="115" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. Yeni bir Trace a&amp;ccedil;ıyoruz.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Karşımıza &amp;ccedil;ıkacak olan aşağıdaki pencereyi bu hali ile bırakalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk100_5.gif" alt="" width="352" height="244" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 5. Trace Setup.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Ardından istemci uygulamamızı &amp;ccedil;alıştıralım ve web servisimizi kullanalım. Tekrardan Trace Utility penceremize d&amp;ouml;nelim. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; elde ederiz. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, trace utility aracı, web servisimiz ile istemci uygulamamız arasındaki SOAP mesajlarını yakalamıştır. Burada iki mesaj sekmesi g&amp;ouml;r&amp;uuml;nmektedir. Bunların herbiri web servisimizdeki bir metoda karşılık gelmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk100_6.gif" alt="" width="638" height="460" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 6. SOAP Mesajları.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin Message #1 sekmesini inceleyelim. &amp;Uuml;steki XML bilgisi, istemcinin web servisine g&amp;ouml;nderdiği talebi (Request) g&amp;ouml;stermektedir. Alttaki mesaj ise, web servisinden istemciye gelen cevabı (Response) g&amp;ouml;sterir. İstemcinin talebini incelediğimizde aşağıdaki XML d&amp;ouml;k&amp;uuml;manını elde ederiz.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt; 
 &amp;lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&amp;gt;
 &amp;lt;soap:Body&amp;gt;
 &amp;lt;DaireAlan xmlns="http://ilk/servis/"&amp;gt;
  &amp;lt;r&amp;gt;10&amp;lt;/r&amp;gt; 
  &amp;lt;/DaireAlan&amp;gt;
  &amp;lt;/soap:Body&amp;gt;
  &amp;lt;/soap:Envelope&amp;gt;&lt;/pre&gt;
&lt;p&gt;Burada istemciden web servisine giden SOAP mesajı g&amp;ouml;r&amp;uuml;lmektedir. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi mesaj &amp;lt;soap:Envelope tag&amp;rsquo; ı ile başlamaktadır. Soap mesajımızın g&amp;ouml;vdesi ise &amp;lt;soap:Body&amp;gt; tagı ile başlar. Burada istemci tarafından &amp;ccedil;ağırılan metodun ismi ve bu metoda g&amp;ouml;nderilen parametre değeri yer almaktadır. Ayrıca metodun hangi isim alanı i&amp;ccedil;inde yer aldığıda belirtilmiştir. Bu isim alanının web servisin i&amp;ccedil;erisindeki WebService niteliği ile belirttiğimiz isim alanı olduğuna dikkat ediniz. Soap mesajımızın başlık kısmı ise, HTTP Header sekmesinde g&amp;ouml;r&amp;uuml;lebilir. Buradaki XML satırları i&amp;ccedil;erisinde en &amp;ouml;nemlisi &amp;lt;soapaction&amp;gt; tagının olduğu satırdır.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;soapaction&amp;gt;"http://ilk/servis/DaireAlan"&amp;lt;/soapaction&amp;gt;&lt;/pre&gt;
&lt;p&gt;Soapaction tagı, kullanılan web servisinde belirtmiş olduğumuz xml isim alanının sonuna web servisinde yer alan metodun ismi eklenerek oluşturulmuştur. Burada, Soap mesajının web servisi tarafından &amp;ccedil;&amp;ouml;z&amp;uuml;mlenmesi sırasında, karşılık gelecek isim alanının (WebService sekmesinde belirttiğimiz) ve bu isim alanı i&amp;ccedil;inden &amp;ccedil;ağırılan metodun (WebMethod niteliği ile belirttiğimiz) tanımlamaları yer alır. B&amp;ouml;ylece web servisi gelen soap mesajına karşılık gelen metodu bulup &amp;ccedil;alıştırabilir. Gelelim web servisinden istemciye d&amp;ouml;nen SOAP Mesajına.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt; 
 &amp;lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&amp;gt;
 &amp;lt;soap:Body&amp;gt;
 &amp;lt;DaireAlanResponse xmlns="http://ilk/servis/"&amp;gt;
  &amp;lt;DaireAlanResult&amp;gt;314&amp;lt;/DaireAlanResult&amp;gt; 
  &amp;lt;/DaireAlanResponse&amp;gt;
  &amp;lt;/soap:Body&amp;gt;
  &amp;lt;/soap:Envelope&amp;gt;&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, web servisinden istemciye d&amp;ouml;nen Soap mesajında en dikkat &amp;ccedil;ekici nokta Response ve Result anahtar kelimeleridir. İstemci tarafından &amp;ccedil;&amp;ouml;zl&amp;uuml;lecek olan bu Soap mesajı, istemci tarafından metodun &amp;ccedil;ağırıldığı satıra d&amp;ouml;necek geri d&amp;ouml;n&amp;uuml;ş değerlerini i&amp;ccedil;erir. Yine buradaki g&amp;ouml;vdede yer alan metod tanımında kullanılan isim alanı ile (xmlns="http://ilk/servis/), istemciye ait proxy nesnesini oluşturan sınıf i&amp;ccedil;erisindeki WebService niteliğinde kullanılan isim alanının aynı olduğuna dikkat edelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[System.Web.Services.WebServiceBindingAttribute(Name="Geometrik HesaplamalarSoap", Namespace="http://ilk/servis/")]&lt;/pre&gt;
&lt;p&gt;Burada g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi SOAP mesajlarımız tek parametre alan metodlar ve tek sonu&amp;ccedil; i&amp;ccedil;eren geri d&amp;ouml;n&amp;uuml;ş değerlerini istemci ve web servisi arasında belirli bir standart dahilinde taşımaktadır. Diğer yandan, &amp;ouml;zellikle değişken sayıda parametre alan ve geriye dizi veya veri k&amp;uuml;mesi d&amp;ouml;nd&amp;uuml;rebilen SOAP mesajlarıda m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bu durumu analiz edebilmek amacıyla web servisimize parametre olarak bir dizi alan ve geriye bu dizinin işlenmiş halini d&amp;ouml;nd&amp;uuml;recek bir metod ilave edelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[WebMethod(Description="Daire Cevre Hesabini Dizi Elamanlarina Uygular.")] public double[] DaireCevreDizi( double[] r)
{
	int eleman_Sayisi=r.Length;      double[] dizi=new double[eleman_Sayisi];
	for(int i=0;i&amp;lt;eleman_Sayisi;i++)
	{
		dizi[i]=r[i]*pi*2;
	}
	return dizi;
}&lt;/pre&gt;
&lt;p&gt;Bu web metodumuz, istemciden double t&amp;uuml;r&amp;uuml;nden bir dizi alacak ve bu dizideki elemanlara &amp;ccedil;evre hesaplaması işlemlerini uygulayacak. Sonu&amp;ccedil;lar ise yine bir dizi şeklinde istemci bilgisayara geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;lecek. İstemci uygulamamızda bu yeni metodu test edebilmemiz i&amp;ccedil;in, proxy nesnesinin, web servisinin yeni versiyonuna uygun bir şekilde g&amp;uuml;ncellenmesi gerekir. Bunun i&amp;ccedil;in, istemci uygulamada Solution Explorer penceresinde, Web References sekemsinde localhost &amp;ouml;ğesine sağ tıklayarak a&amp;ccedil;ılan men&amp;uuml;den, &lt;strong&gt;Update Web Reference&lt;/strong&gt;&amp;rsquo; i se&amp;ccedil;memiz yeterli olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk100_7.gif" alt="" width="232" height="346" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 7. Xml Web Servisini G&amp;uuml;ncellemek.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu durumda, istemci uygulamamız web servisimiz i&amp;ccedil;in oluşturduğu proxy nesnesini yeniliklere g&amp;ouml;re g&amp;uuml;ncelleyecektir. Aksi takdirde web servisimize eklediğimiz metodu kullanamayız. Bu işlemlerin ardından, istemci uygulamamıza aşağıdaki kod satırlarını ilave edelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;double[] dizi=new double[3]; dizi[0]=1; dizi[1]=2; dizi[2]=3;   double[] diziSonuc=new double[3]; diziSonuc=gh.DaireCevreDizi(dizi); foreach(double eleman in diziSonuc) {      lblDizi.Text+=eleman.ToString()+" ";
}&lt;/pre&gt;
&lt;p&gt;Burada yaptığımız, 3 elemanlı double t&amp;uuml;r&amp;uuml;nden bir dizi tanımlamak ve bu diziye atadığımız elemanları, web servisimizdeki metodumuza parametre olarak g&amp;ouml;nderip sonu&amp;ccedil;ları bir label kontrol&amp;uuml;nde yazdırmak. Bizim i&amp;ccedil;in &amp;ouml;nemli olan kodların yazılış tarzından &amp;ccedil;ok, web servisine bir dizinin g&amp;ouml;nderilmesi, orada işlenmesi ve sonu&amp;ccedil;ların geri gelmesi sırasında, SOAP mesajlarının ne şekilde oluşacağıdır.&lt;/p&gt;
&lt;p&gt;Şimdi Trace Utility &amp;lsquo;den SOAP mesajlarını yenide inceleyelim. Yerel makinede &amp;ccedil;alıştığımız ve proxy nesnemizide g&amp;uuml;ncellediğimiz i&amp;ccedil;in, proxy sınıfındaki localhost tanımlamasını tekrardan localhost:8080 olarak değiştirmemiz, SOAP mesajlarını Trace Utility aracılığıyla yakalayabilmemiz a&amp;ccedil;ısından gerekli olabilir. SOAP Toolkit Trace Utility aracıyla, SOAP mesajlarına baktığımızda, istemciden web servisine DaireCevreDizi metodu i&amp;ccedil;in giden XML tabanlı bilgilerin aşağıdaki şekilde oluşturulduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt; 
&amp;lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&amp;gt;
 &amp;lt;soap:Body&amp;gt;
 &amp;lt;DaireCevreDizi xmlns="http://ilk/servis/"&amp;gt;
 &amp;lt;r&amp;gt;
&amp;nbsp; &amp;lt;double&amp;gt;1&amp;lt;/double&amp;gt; 
&amp;nbsp; &amp;lt;double&amp;gt;2&amp;lt;/double&amp;gt; 
&amp;nbsp; &amp;lt;double&amp;gt;3&amp;lt;/double&amp;gt; 
&amp;nbsp; &amp;lt;/r&amp;gt;
&amp;nbsp; &amp;lt;/DaireCevreDizi&amp;gt;
&amp;nbsp; &amp;lt;/soap:Body&amp;gt;
&amp;nbsp; &amp;lt;/soap:Envelope&amp;gt;&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi web metoda g&amp;ouml;nderdiğimiz dizi elemanları double XML veri tipinden elemanlar olarak SOAP mesajının g&amp;ouml;vdesine katılmıştır. Aynı şekilde web servisinden geri d&amp;ouml;nen mesaja baktığımızda aşağıdaki sonucu elde ederiz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt; 
- &amp;lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"&amp;gt;
 &amp;lt;soap:Body&amp;gt;
 &amp;lt;DaireCevreDiziResponse xmlns="http://ilk/servis/"&amp;gt;
 &amp;lt;DaireCevreDiziResult&amp;gt;
  &amp;lt;double&amp;gt;6.28&amp;lt;/double&amp;gt; 
  &amp;lt;double&amp;gt;12.56&amp;lt;/double&amp;gt; 
  &amp;lt;double&amp;gt;18.84&amp;lt;/double&amp;gt; 
  &amp;lt;/DaireCevreDiziResult&amp;gt;
  &amp;lt;/DaireCevreDiziResponse&amp;gt;
  &amp;lt;/soap:Body&amp;gt;
  &amp;lt;/soap:Envelope&amp;gt;&lt;/pre&gt;
&lt;p&gt;Sonu&amp;ccedil;lar yine double XML veri tipi elemanı olarak geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;lm&amp;uuml;şt&amp;uuml;r. Şu ana kadar yaptığımız &amp;ouml;rneklerde, istemci uygulamanın web servisindeki sınıf ve metodları bir proxy nesnesi yardımıyla nasıl kullandığına şahit olduk. Peki istemci bir uygulama, kendisine web referansı olarak eklediği web servisine dair bir proxy nesnesini nasıl oluşturabildi? Bu sorunun cevabını Web Servislerinin SOAP&amp;rsquo; tan sonra olmassa olmaz materyali olan WSDL verebilir. WSDL konusunu bir sonraki makalemizde incelemeye &amp;ccedil;alışacağız. Tekrarda g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-10-01 12:00:00</pubDate>
  <slug>Xml-Web-Servisleri-3-(-Mimarinin-Temelleri-SOAP)-bsenyurt-com-dan</slug>
  <tags>
    <tag>xml-web-services</tag>
    <tag>soap</tag>
  </tags>
  <categories>
    <category>XML Web Services</category>
  </categories>
</post>