<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ruby Kod Parçacıkları 33 - Observer Deseninin Uygulanışı</title>
  <description>Bir önceki kod parçasında Singleton kalıbının Ruby tarafında nasıl uygulandığını incelemeye çalışmıştık. Hatırlayacağınız gibi hazır Singleton modülünü kullanarak bu işi gerçekleştirmek son derece kolaydı. Benzer durum Observer tasarım kalıbı için de geçerli...</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/01/notifyg.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki kod par&amp;ccedil;asında &lt;a href="/post/ruby-kod-parcaciklari-32-singleton" target="_blank"&gt;Singleton kalıbının Ruby tarafında nasıl uygulandığını&lt;/a&gt; incelemeye &amp;ccedil;alışmıştık. Hatırlayacağınız gibi hazır singleton mod&amp;uuml;l&amp;uuml;n&amp;uuml; kullanarak bu işi ger&amp;ccedil;ekleştirmek olduk&amp;ccedil;a&amp;nbsp;kolaydı. Benzer durum Observer tasarım kalıbı i&amp;ccedil;in de ge&amp;ccedil;erli. Bu kalıp bir nesnenin durumunda meydana gelen değişiklikler sonrası ilgili diğer nesnelerin uyarılması amacıyla kullanılan pop&amp;uuml;ler yazılım desenlerinden birisi. &lt;em&gt;(.Net tarafındaki uygulanış şekli ile ilgili olarak &lt;a href="/post/Tasarc4b1m-Desenleri-Observer" target="_blank"&gt;şu eski yazımdan&lt;/a&gt;&amp;nbsp;yararlanabilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Dilerseniz &amp;ouml;rnek bir senaryo &amp;uuml;zerinden hareket ederek bu deseni nasıl uygulayabileceğimize kısaca bakalım. Bir oyun kodunda oyuncuların belirli puan noktalarını&amp;nbsp;aşmaları&amp;nbsp;sonrası oyuncu nesnesi ile ilişkili başka nesnelerin bilgilendirilmesini istediğimizi d&amp;uuml;ş&amp;uuml;nelim. S&amp;ouml;z gelimi bu bilgilendirmeler sırasında oyuncuların seviyelerini bir diğer nesne &amp;uuml;zerinden değiştirelim. Tasarım kalıbının uygulanış bi&amp;ccedil;imine g&amp;ouml;re g&amp;ouml;zlemlenebilir&lt;em&gt;(observable)&lt;/em&gt;&amp;nbsp;bir oyuncu nesnesi&amp;nbsp;ve bu nesnedeki&amp;nbsp;durum değişikliklerini ele alacak bir g&amp;ouml;zlemci&lt;em&gt;(observer)&lt;/em&gt; &amp;ouml;rneğine ihtiya&amp;ccedil;&amp;nbsp;bulunuyor. Aşağıdaki kod par&amp;ccedil;asını &amp;ouml;rnek olarak ele alabiliriz.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require 'observer'

class PlayerObserver
  def notify(player,point)
    puts "Player's current point is #{point}"
    player.level="Looser" if player.point&amp;lt;0
    player.level="Pro gamer" if player.point &amp;gt;1000
    player.level="Blackhat" if player.point&amp;gt;2000
  end
end

class Player
  include Observable
  
  attr_accessor :level,:title
  attr_reader :point
  
  def initialize(title)
    @title,@point,@level=title,100,"Standard gamer"
    add_observer(PlayerObserver.new,"notify")
  end
  
  def set_point(v)
      @point=v
      changed
      notify_observers(self,v)
  end  
end

rudi=Player.new("rudii the ram")
puts rudi.level
rudi.set_point(1240)
puts rudi.level
rudi.set_point(2300)
puts rudi.level
rudi.set_point(-300)
puts rudi.level&lt;/pre&gt;
&lt;p&gt;Neler yaptığımıza kısaca bakalım.&lt;/p&gt;
&lt;p&gt;observer kalıbını kullanmak i&amp;ccedil;in ilgili mod&amp;uuml;l bildirimini yaparak kodlamaya başlıyoruz. PlayerObserver sınıfı g&amp;ouml;zlemci rol&amp;uuml;n&amp;uuml; &amp;uuml;stleniyor. Bu sınıfta&amp;nbsp;yer alan notify metodu, Player nesne &amp;ouml;rneklerinin&amp;nbsp;puanlarında olan değişiklilere g&amp;ouml;re tetiklenecek. notify metodu i&amp;ccedil;erisinde o anki Player nesnesinin point değerine bakıp level niteliğini değiştiriyoruz.&lt;/p&gt;
&lt;p&gt;Player sınıfı ise observable mod&amp;uuml;l&amp;uuml;n&amp;uuml; kullanacağını&amp;nbsp;belirterek başlıyor. Standart olarak bir ka&amp;ccedil; niteliği var. Oyununcun lakabını title niteliğinde tutarken, seviyesini level ve g&amp;uuml;ncel puanını da point &amp;ouml;zelliklerinde tutuyoruz. Dikkat edilmesi gereken ilk nokta initialize metodundaki add_observer fonksiyonunun kullanımı. Bu metod iki parametre alıyor. İlki g&amp;ouml;zlemci nesne &amp;ouml;rneği, ikincisi ise bildirim i&amp;ccedil;in tetiklenecek olan fonksiyon adı&lt;em&gt;(Eğer herhangibir metod adı belirtilmezse varsayılan olarak update metodu aranacaktır. Hafiften bir duck typing durumu da s&amp;ouml;z konusudur)&lt;/em&gt; Oyuncunun g&amp;uuml;ncel puanını d&amp;uuml;zenleyen set_point metodunda ise notify_observers &amp;ccedil;ağrısı yapılıyor. Bu &amp;ccedil;ağrıya g&amp;ouml;re PlayerObserver sınıfındaki notify metoduna o anki Player nesne &amp;ouml;rneğinin kendisi&lt;em&gt;(self kullanımı ile)&lt;/em&gt; ve puanı taşınıyor. Tahmin edeceğiniz gibi birden fazla observer nesnesinin tanımlanması ve tamamına ait olay yayınlanması m&amp;uuml;mk&amp;uuml;n.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Uygulamanın &amp;ccedil;alışma zamanı sonu&amp;ccedil;ları aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/rubyobsrv_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi oyuncunun puanları değiştik&amp;ccedil;e bunu g&amp;ouml;zlemleyen sınıftaki notify metodu tetiklenmiş ve bir takım aksiyonlar oluşmuştur. Bu &amp;ouml;rnekte sadece ekrana bildirim yapılmış olsa da ger&amp;ccedil;ek hayat &amp;ouml;rneklerinde ilgili bildirim operasyonlarında &amp;ccedil;ok daha farklı işlemler ger&amp;ccedil;ekleştirebilir. S&amp;ouml;z gelimi oyuncu i&amp;ccedil;in puanına g&amp;ouml;re bir promosyon kodunun &amp;uuml;retilip kendisine alternatif kanallar ile bildirilmesi ve benzeri kuyruklanabilecek asenkron operasyonlar d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&amp;nbsp;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Pek tabii set_point metodu i&amp;ccedil;erisinde o anki Player nesne &amp;ouml;rneğinin level değeri belirlenebilir. Buradaki ama&amp;ccedil; nesnenin &amp;ccedil;alışma zamanındaki varlığında olacak değişiklikler sonucu bir diğer nesne&lt;em&gt;(veya nesnelerin)&lt;/em&gt; uyarılmasıdır. Farklı nesne &amp;ouml;rnekleri &amp;uuml;zerinde olacak değişiklilerin &amp;ccedil;eşitli g&amp;ouml;zlemleyiciler tarafından veya bir nesne &amp;ouml;rneğinde olacak değişiklilerin n sayıda g&amp;ouml;zlemci tarafından yakalanması gibi vakalarda değerlendirilebilecek bir tasarım kalıbı olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmesinde yarar vardır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir kod par&amp;ccedil;acığının daha sonuna. Bu kısa yazımızda Observer tasarım kalıbının Ruby tarafında nasıl uygulanabileceğini basit&amp;ccedil;e incedik. Size tavsiyem &lt;a href="https://ruby-doc.org/stdlib-1.9.3/libdoc/observer/rdoc/Observable.html#method-i-changed" target="_blank"&gt;Observable mod&amp;uuml;l&amp;uuml;n&amp;uuml;&lt;/a&gt; detaylı bir şekilde incelemeniz. Nitekim eklenen bir g&amp;ouml;zlemcinin nasıl kaldırılabileceği, ilgili g&amp;ouml;zlemcinin bir bildirim operasyonunun olup olmadığını kontrol&amp;uuml;, ortamda ka&amp;ccedil; g&amp;ouml;zlemcinin olduğu ve benzeri işlevsellikleri de kullanmanız gerekebilir. Bir başka kod par&amp;ccedil;asında g&amp;ouml;r&amp;uuml;şmek &amp;uuml;zere hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-02-12 21:47:00</pubDate>
  <slug>ruby-kod-parcaciklari-33-observer-deseninin-uygulanisi</slug>
  <tags>
    <tag>ruby-kod-parçacıkları</tag>
    <tag>design-pattern</tag>
    <tag>observer-pattern</tag>
    <tag>tasarım-kalıpları</tag>
    <tag>observable-module</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>