<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>IIS RESTful API Hello World</title>
  <description>Öğrendiğime göre Microsoft IIS(Internet Information Services) takımı yönetimsel işlemler için Asp.Net Core teknolojisini kullanan RESTFul tipinden bir servis üzerinde çalışmalar yapmakta. Micro Service mimarisi benimsenerek geliştirilen alt yapı, kullanıcılarına IIS Administration ile ilgili gerekli fonksiyonellikleri modern bir API olarak sunuyor. API, Self-Hosted Window Service olarak yayınlanmakta. In-Proc çalışmalar için Hostable Web Core yapısına da sahip. Aşağıdaki şekil teknik mimarisi hakkında biraz daha fikir verecektir. (Takımın çizdiği mimari resim kadar başarılı değil ama bakmadan çizmeye çalışırsanız konuyu güzelce pekiştirebilirsiniz)</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2016/05/iisrestful_3.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;n 20 Mayıs Cuma. D&amp;uuml;n 19 Mayıs nedeniyle resmi tatil olan bankamız bug&amp;uuml;n de toplu olarak tatil. Ancak şirkette kalmak isteyenler durumlarını bildirip gelebiliyor.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alıştığım şirkettlerde işlerin hafiflediği d&amp;ouml;nemler genellikle makale yazdığım d&amp;ouml;nemler oluyor. Hazır ge&amp;ccedil;tiğimiz g&amp;uuml;n de&lt;strong&gt; IIS Restful API&lt;/strong&gt; hakkında araştırmalara başlamışken bug&amp;uuml;n biraz daha &amp;uuml;zerine eğileyim, şu &lt;strong&gt;Hello World&lt;/strong&gt; uygulamasını yaparak nedir ne değildir anlayayım istedim. Malzemelerimi hazırladım. En &amp;ouml;nemlisi elbetteki kafeindi. Her ne kadar &amp;ccedil;alışma masamdaki kadim dostum &lt;strong&gt;&lt;a href="http://www.lego.com/en-us/mixels/products/series-1/41501-vulk" target="_blank"&gt;VULK&lt;/a&gt;&lt;/strong&gt;&amp;nbsp;kahveme sulansa da...&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ğrendiğime g&amp;ouml;re &lt;strong&gt;Microsoft IIS&lt;em&gt;(Internet Information Services)&lt;/em&gt;&lt;/strong&gt; takımı y&amp;ouml;netimsel işlemler i&amp;ccedil;in &lt;strong&gt;Asp.Net Core&lt;/strong&gt; teknolojisini kullanan &lt;strong&gt;RESTFul &lt;/strong&gt;tipinden&lt;strong&gt;&amp;nbsp;&lt;/strong&gt;bir&lt;strong&gt;&amp;nbsp;&lt;/strong&gt;servis &amp;uuml;zerinde &amp;ccedil;alışmalar yapmakta. &lt;strong&gt;Micro Service&lt;/strong&gt; mimarisi benimsenerek geliştirilen alt yapı,&amp;nbsp;kullanıcılarına &lt;strong&gt;IIS Administration&lt;/strong&gt; ile ilgili gerekli fonksiyonellikleri modern bir API olarak sunuyor. &lt;strong&gt;API&lt;/strong&gt;,&lt;strong&gt; Self-Hosted Window Service&lt;/strong&gt; olarak yayınlanmakta. &lt;strong&gt;In-Proc&lt;/strong&gt; &amp;ccedil;alışmalar i&amp;ccedil;in &lt;strong&gt;Hostable&lt;/strong&gt; &lt;strong&gt;Web&lt;/strong&gt; &lt;strong&gt;Core&lt;/strong&gt; yapısına da sahip. Aşağıdaki şekil teknik mimarisi hakkında biraz daha fikir verecektir. &lt;em&gt;(Takımın &amp;ccedil;izdiği mimari resim kadar başarılı değil ama bakmadan &amp;ccedil;izmeye &amp;ccedil;alışırsanız konuyu g&amp;uuml;zelce pekiştirebilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/05/IISRestful_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bildiğiniz &amp;uuml;zere &lt;strong&gt;IIS&lt;/strong&gt;, &lt;strong&gt;Microsoft&lt;/strong&gt; cephesinde kod geliştirenlerin yakından tanıdığı bir host uygulama olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. &lt;strong&gt;Web sitelerini&lt;em&gt;(asp.net, asp vb)&lt;/em&gt;&lt;/strong&gt;, &lt;strong&gt;servisleri&lt;em&gt;(asmx, wcf vb)&lt;/em&gt;&lt;/strong&gt;, &lt;strong&gt;HTTP Handler&lt;/strong&gt; ve &lt;strong&gt;Module&lt;/strong&gt;' leri bu uygulama &amp;uuml;zerinden kolayca yayınlayabiliyoruz.&amp;nbsp;&lt;span style="line-height: 1.8;"&gt;&lt;strong&gt;IIS&amp;nbsp;Manager&lt;/strong&gt;&lt;em&gt;(komut satırından inetmgr aracı ile)&lt;/em&gt;&amp;nbsp;gibi aray&amp;uuml;zleri de kullanarak istediğimiz y&amp;ouml;netsel işlemleri&lt;em&gt;(Application Pool' ların y&amp;ouml;netimi, SSL'in a&amp;ccedil;ılıp kapatılması, site konfigurasyonlarının yapılması, Session ayarlamaları, y&amp;ouml;nlendirmeler, Handler y&amp;uuml;klemeleri&amp;nbsp;vb)&lt;/em&gt; g&amp;ouml;rsel olarak yapabilmekteyiz. &lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;Aslında &lt;strong&gt;.Net&lt;/strong&gt; tarafında &lt;strong&gt;IIS&lt;/strong&gt;'i kod bazlı y&amp;ouml;netebiliyoruz. Ancak şu aşamada sunulan &lt;strong&gt;RESTFul API&lt;/strong&gt; ile istemci tarafı teknolojisini de bağımsızlaştırılıyor. Bir başka deyişle herhangi bir t&amp;uuml;rden istemci&lt;em&gt;(Client)&lt;/em&gt; IIS ile ilgili y&amp;ouml;netsel işlemleri &lt;strong&gt;RESTFul&lt;/strong&gt; servise g&amp;ouml;ndereceği basit &lt;strong&gt;HTTP&lt;/strong&gt; &amp;ccedil;ağrıları ile ger&amp;ccedil;ekleştirebilecek&lt;em&gt;(Gelecek zaman kullanıyorum &amp;ccedil;&amp;uuml;nk&amp;uuml; proje hen&amp;uuml;z geliştirilme aşamasında)&lt;/em&gt; Yani &lt;strong&gt;Powershell&lt;/strong&gt;' den y&amp;ouml;netim yapılabileceği gibi &lt;strong&gt;Java&lt;/strong&gt; ile yazılmış bir istemci de kullanılabilir. Hatta bu y&amp;ouml;netsel operasyonlar mobil cihazlara kadar indirgenebilir. &lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;İşten &amp;ccedil;ıktınız ve eve gidiyorsunuz. Bir uyarı mesajı geldi. Test sunucusundaki sitelerden birisi sorun yaşıyor. IIS Reset değil ama sitenin Recycle edilmesi ge&amp;ccedil;ici bir &amp;ccedil;&amp;ouml;z&amp;uuml;m olabilir. Mobil cihazınızdan o an sorun yaşayan bu siteyi Recycle ettiğinizi, bazı konfig&amp;uuml;rasyon ayarlarını değiştirebildiğinizi d&amp;uuml;ş&amp;uuml;nsenize. Tabii g&amp;uuml;venilir bir oturum &amp;ccedil;er&amp;ccedil;evesinde ki IIS takımı SSL sertifika ve API' ye &amp;ouml;zel Key:Value bilgileri ile bunu sağlıyor.&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;&lt;strong&gt;IIS&lt;/strong&gt; takımının bu &amp;ccedil;alışmalarını test edebilmek i&amp;ccedil;in sunulan &amp;ouml;rnek bir site de var. &lt;strong&gt;&lt;a href="/admin/app/editor/%20https:/jimmyca-srv2.cloudapp.net:55539" target="_blank"&gt;Azure &amp;uuml;zerinde host edilen siteye&lt;/a&gt;&lt;/strong&gt; genel kullanıma a&amp;ccedil;ık bir &lt;strong&gt;Authentication Token&lt;/strong&gt; ile ulaşılabiliyor. &lt;/span&gt;&lt;/p&gt;
&lt;h2&gt;&amp;Ouml;rnek Kod&lt;/h2&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;Peki &lt;strong&gt;Microservice&lt;/strong&gt; mimarisine g&amp;ouml;re tasarlanmış&lt;strong&gt; Asp.Net Core&lt;/strong&gt; &amp;uuml;zerinde oturan bu &lt;strong&gt;RESTFul&lt;/strong&gt; &lt;strong&gt;API&lt;/strong&gt;'yi&lt;strong&gt; .Net&lt;/strong&gt; tabanlı bir istemci ile nasıl kullanabiliriz? &amp;Ccedil;ok zor olmasa gerek değil mi? Altı &amp;uuml;st&amp;uuml; ge&amp;ccedil;erli bir sertifika oluşturup &lt;strong&gt;REST&lt;/strong&gt; tabanlı &amp;ccedil;ağrı ger&amp;ccedil;ekleştireceğiz. Dikkat edilmesi gereken noktalar, &lt;strong&gt;HTTP&lt;/strong&gt; taleplerinin &lt;strong&gt;Header&lt;/strong&gt; bilgisi i&amp;ccedil;erisinde ge&amp;ccedil;erli &lt;strong&gt;Key&lt;/strong&gt; ve &lt;strong&gt;Value&lt;/strong&gt; değerleri ile g&amp;ouml;nderilmesi ve sunucu bazlı sertifika doğrulatma işleminin yapılması. Gelin bunları g&amp;ouml;z &amp;ouml;n&amp;uuml;nde bulundurarak &amp;ouml;rnek &lt;strong&gt;Console&lt;/strong&gt; uygulama kodlarımızı aşağıdaki gibi yazalım.&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Net;
using System.Net.Http;
using System.Security.Cryptography.X509Certificates;

namespace UnitsNetHelloWorld
{
    class Program
    {
        static void Main(string[] args)
        {
            IISManager manager = new IISManager();
            
            Console.WriteLine("App Pools\n{0}",manager.GetAppPools());
            Console.WriteLine("Default Web Site\n{0}", manager.GetDefaultWebSiteInformations());
            Console.WriteLine("Web Sites\n{0}", manager.GetWebSites());
        }
    }
    class IISManager
    {
        const string thumbprint = "3BEA286D400717ACA726181593B827955115EDFC";
        const string headerKey = "X-Authorization";
        const string headerValue = "Bearer OgMks6N7CtZTptX2DTnLe8JvkmATOuqw1ZJnZzK1RojeYs251Wlfvg";
        const string rootPath = "https://jimmyca-srv2.cloudapp.net:55539/";

        public IISManager()
        {
            ServicePointManager.ServerCertificateValidationCallback 
                = (sender, certificate, chain, sslPolicyErrors) =&amp;gt;
            {
                X509Certificate2 apiCert = certificate as X509Certificate2;
                return apiCert == null ? false : apiCert.Thumbprint == thumbprint;
            };
        }

        public string GetAppPools()
        {
            return Get(String.Concat(rootPath,"api/webserver/application-pools"));
        }
        public string GetWebSites()
        {
            return Get(string.Concat(rootPath,"api/webserver/websites"));
        }
        public string GetDefaultWebSiteInformations()
        {
            return Get(string.Concat(rootPath,"api/webserver/websites/QnizhC7cy49v1mIHNH5Gdw"));
        }
        public string Get(string request)
        {
            string result=string.Empty;
            using (var client = new HttpClient())
            {
                client.DefaultRequestHeaders.Add(headerKey, headerValue);
                var response = client.GetAsync(request).Result;

                if (response.StatusCode == HttpStatusCode.OK)
                    result=response.Content.ReadAsStringAsync().Result;
            }
            return result;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;&amp;Ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibi olacaktır. &lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;&lt;img src="/image.axd?picture=/2016/05/IISRestful_1.gif" alt="" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;Tamam kabul ediyorum okunurluğu epey zor. &lt;strong&gt;Matrix&lt;/strong&gt; kodları i&amp;ccedil;erisinde y&amp;uuml;z&amp;uuml;yor gibiyiz. Sonu&amp;ccedil;lar &lt;strong&gt;JSON&lt;/strong&gt; formatında gelmiş durumda. Burada &lt;strong&gt;Newtonsoft&lt;/strong&gt;' u devreye sokup daha okunabilir &amp;ccedil;ıktılar elde edebiliriz. Hatta &lt;strong&gt;JSON&lt;/strong&gt;'dan tipe d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;p sonu&amp;ccedil;ların &lt;strong&gt;domain&lt;/strong&gt; i&amp;ccedil;erisinde anlamlı nesneler olarak ele alınmasını da sağlayabiliriz. Bilin bakalım ben bu kutsal g&amp;ouml;revi kime bırakacağım...&lt;/span&gt;&lt;/p&gt;
&lt;h2&gt;&lt;span style="line-height: 1.8;"&gt;Peki Kodda Neler Oluyor?&lt;/span&gt;&lt;/h2&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;En b&amp;uuml;y&amp;uuml;k yardımcımız &lt;strong&gt;IISManager&lt;/strong&gt; isimli sınıfımız. Nesne &amp;ouml;rneği oluşturulurken &lt;strong&gt;ServicePointManager&lt;/strong&gt;&amp;nbsp;tipinden yararlanarak sunucu bazlı bir sertifika doğrulama işlemi icra ediyoruz. &amp;Ccedil;ekirdek metodumuz &lt;strong&gt;Get&lt;/strong&gt; isimli fonksiyon. Bu metod bir &lt;strong&gt;HttpClient&lt;/strong&gt; nesnesinden yararlanarak &lt;strong&gt;HTTP&lt;/strong&gt; taleplerini asenkron olarak g&amp;ouml;nderiyor. Kullanımı i&amp;ccedil;in &lt;strong&gt;HTTP&lt;/strong&gt; paketinin &lt;strong&gt;Header&lt;/strong&gt; kısmında yer alacak Key ve Value değerlerinin doğru girilmesi şart. &lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;&lt;strong&gt;GetAsync&lt;/strong&gt; metoduna gelen parametre,&amp;nbsp;&lt;strong&gt;API&lt;/strong&gt; ile ilgili ge&amp;ccedil;erli bir &lt;strong&gt;HTTP&lt;/strong&gt; talebini i&amp;ccedil;eriyor. &amp;Ouml;rneğin sunucuda yer alan &lt;strong&gt;Application Pool&lt;/strong&gt;' ları g&amp;ouml;rmek i&amp;ccedil;in buraya&amp;nbsp;&lt;strong&gt;api/webserver/application-pools&lt;/strong&gt; bilgisini vermemiz gerekiyor. Bu bilginin başına da &lt;strong&gt;Root&lt;/strong&gt; Path i&amp;ccedil;eriği eklenince istenilen adres oluşuyor &lt;em&gt;(https://jimmyca-srv2.cloudapp.net:55539/api/webserver/application-pools gibi)&lt;strong&gt;&amp;nbsp;&lt;/strong&gt;&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;Kolaylık olması a&amp;ccedil;ısından bir ka&amp;ccedil; &lt;strong&gt;HTTP&lt;/strong&gt; &amp;ccedil;ağrısını metodlaştırdık. &lt;strong&gt;GetWebSites&lt;/strong&gt; ile web sitelerini &lt;strong&gt;GetDefaultWebSiteInformations&lt;/strong&gt; ile &lt;strong&gt;Default Web Site&lt;/strong&gt;' a ait temel bilgileri elde edebiliyoruz. Bazı adreslerden d&amp;ouml;nen sonu&amp;ccedil;lar kendi i&amp;ccedil;erisinde farklı adresler de i&amp;ccedil;eriyor. &amp;Ouml;rneğin siteleri &amp;ccedil;ektiğimizde bu siteler ile ilişkili bilgilere ulaşabileceğimiz başka &lt;strong&gt;EndPoint&lt;/strong&gt; adresleri ile de karşılaşıyoruz. Dolayısıyla y&amp;ouml;netimsel a&amp;ccedil;ıdan aklımıza gelebilecek bir &amp;ccedil;ok senaryoyu uygulamak m&amp;uuml;mk&amp;uuml;n. Pek tabi daha farklı talepler de girilebilir. &lt;a href="https://jimmyca-srv2.cloudapp.net:55539/#/api/webserver" target="_blank"&gt;Tam liste i&amp;ccedil;in şu adrese bakabilirsiniz&lt;/a&gt;.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;S&amp;ouml;z konusu &lt;strong&gt;API&lt;/strong&gt; halen daha geliştirilme aşamasında. Bu &lt;strong&gt;API&lt;/strong&gt;'nin kendi &lt;strong&gt;IIS&lt;/strong&gt; sunucularımızda nasıl kullanılacağına dair hen&amp;uuml;z bir bilgi edinebilmiş değilim ancak şirketlerin bu &lt;strong&gt;API&lt;/strong&gt; ile kendilerine hoş y&amp;ouml;netim ara&amp;ccedil;ları yazabileceği kanısındayım. &amp;Ouml;zellikle y&amp;ouml;netsel fonksiyonellikleri mobilize olarak sunabilmek b&amp;uuml;y&amp;uuml;k bir nimettir diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. DevOps k&amp;uuml;lt&amp;uuml;r&amp;uuml;nde de kendine g&amp;uuml;zel bir yer edinecektir kanımca.&amp;nbsp;&lt;/span&gt;&lt;span style="line-height: 1.8;"&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;span style="line-height: 1.8;"&gt;Kaynak :&amp;nbsp;&lt;a href="https://blogs.msdn.microsoft.com/webdev/2016/05/09/introducing-the-iis-administration-api/"&gt;https://blogs.msdn.microsoft.com/webdev/2016/05/09/introducing-the-iis-administration-api/&lt;/a&gt;&amp;nbsp;&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;</content>
  <pubDate>2016-05-19 17:00:00</pubDate>
  <slug>tek-fotoluk-ipucu-132-iis-restful-api-denemesi</slug>
  <tags>
    <tag>iis</tag>
    <tag>net-core</tag>
    <tag>aspnet-core</tag>
    <tag>restful-api</tag>
    <tag>restful-services</tag>
    <tag>microservice</tag>
    <tag>c#</tag>
  </tags>
  <categories>
    <category>REST</category>
  </categories>
</post>