<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Çok Kanallı(Multithread) Uygulamalar</title>
  <description>Bugünkü makelemiz ile birlikte threading kavramını en basit haliyle tanımaya çalışacağız. Sonraki makalelerimizde de threading kavramını daha üst seviyede işlemeye çalışacağız. Bugün hepimiz bilgisayar başındayaken aynı anda pek çok uygulamanın sorunsuz bir şekilde çalıştığını görürüz. Bir belge yazarken, aynı zamanda müzik dinleyebilir, internet üzerinden program indirebilir ve sistemimizin kaynaklarının elverdiği ölçüde uygulamayla eşzamanlı olarak çalışabiliriz. Bu bize, günümüz işlemcilerinin ve üzerlerinde çalışan işletim sistemlerinin ne kadar yetenekli oluğunu gösterir. Gösterir mi acaba?</description>
  <content>&lt;p align="left"&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p align="left"&gt;Bug&amp;uuml;nk&amp;uuml; makelemiz ile birlikte threading kavramını en basit haliyle tanımaya &amp;ccedil;alışacağız. Sonraki makalelerimizde de threading kavramını daha &amp;uuml;st seviyede işlemeye &amp;ccedil;alışacağız.&amp;nbsp;Bug&amp;uuml;n hepimiz bilgisayar başındayaken aynı anda pek &amp;ccedil;ok uygulamanın sorunsuz bir şekilde &amp;ccedil;alıştığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bir belge yazarken, aynı zamanda m&amp;uuml;zik dinleyebilir, internet &amp;uuml;zerinden program indirebilir ve sistemimizin kaynaklarının elverdiği &amp;ouml;l&amp;ccedil;&amp;uuml;de uygulamayla eşzamanlı olarak &amp;ccedil;alışabiliriz. Bu bize, g&amp;uuml;n&amp;uuml;m&amp;uuml;z işlemcilerinin ve &amp;uuml;zerlerinde &amp;ccedil;alışan işletim sistemlerinin ne kadar yetenekli oluğunu g&amp;ouml;sterir. G&amp;ouml;sterir mi acaba?&lt;/p&gt;
&lt;p align="left"&gt;Aslında tek işlemcili makineler g&amp;uuml;n&amp;uuml;m&amp;uuml;z&amp;uuml;n modern sihirbazları gibidirler. Ger&amp;ccedil;ekte &amp;ccedil;alışan uygulamaların t&amp;uuml;m işlemleri aynı anda ger&amp;ccedil;ekleşmemektedir. Fakat işlemciler &amp;ouml;ylesine b&amp;uuml;y&amp;uuml;k saat hızlarına sahiptirlerki. İşlemcinin yaptığı, &amp;ccedil;alıştırılan uygulamaya ait işlemleri iş par&amp;ccedil;acacıkları(thread) halinde ele almaktır. Her bir iş par&amp;ccedil;acağı bir işlemin birden fazla par&amp;ccedil;aya b&amp;ouml;l&amp;uuml;nmesinden oluşur. İşlemciler her iş par&amp;ccedil;acığı i&amp;ccedil;in bir zaman dilimi belirler. T zaman diliminde bir işlem par&amp;ccedil;acığı y&amp;uuml;r&amp;uuml;t&amp;uuml;l&amp;uuml;r ve bu zaman dilim bittiğinde işlem par&amp;ccedil;acığı ge&amp;ccedil;ici bir s&amp;uuml;re i&amp;ccedil;in durur. Ardından kuyrukta bekleyen diğer iş par&amp;ccedil;acağı başka bir zaman dilimi i&amp;ccedil;inde &amp;ccedil;alıştırılır. Bu b&amp;ouml;ylece devam ederken, işlemcimiz her iş par&amp;ccedil;acığına geri d&amp;ouml;ner ve t&amp;uuml;m iş par&amp;ccedil;acıkları sıra sıra &amp;ccedil;alıştırılır. Dedik ya, işlemciler bu işlemleri &amp;ccedil;ok y&amp;uuml;ksek saat ve frekans hızında ger&amp;ccedil;ekleştiri. İşte bu y&amp;uuml;ksek hız nedeniyle t&amp;uuml;m bu olaylar saniyenin milyon s&amp;uuml;relerinde ger&amp;ccedil;ekleşir ve sanki t&amp;uuml;m bu uygulamalar aynı anda &amp;ccedil;alışıyor hissi verir.&lt;/p&gt;
&lt;p align="left"&gt;Ger&amp;ccedil;ektende uygulamaları birbirleriyle paralel olarak ve eş zamanlı &amp;ccedil;alıştırmak aslında birden fazla işlemciye sahip sistemler i&amp;ccedil;in ger&amp;ccedil;eklenir.&lt;/p&gt;
&lt;p align="left"&gt;Bug&amp;uuml;nk&amp;uuml; uygulamamız ile, bahsetmiş olduğumuz threadin kavramına basit bir giriş yapıcağız. Nitekim threading kavramı ve teknikleri, uygulamalarda profesyonel olarak kod yazmayı gerektirir. Daha a&amp;ccedil;ık şekilde s&amp;ouml;ylemek gerekirse bir uygulama i&amp;ccedil;inde yazdığımız kodlara uygulayacağımı thread'ler her zaman avantaj sağlamaz. Bazı durumlarda dezavantaja d&amp;ouml;n&amp;uuml;ş&amp;uuml;p programların daha yavaş &amp;ccedil;alışmasına neden olabilir. Nitekim thread'lerin &amp;ccedil;alışma mantığını iyi kavramak ve uygulamalarda titiz davranmak gerekir.&lt;/p&gt;
&lt;p align="left"&gt;&amp;Ouml;rneğin thread'lerin zaman dilimlerine b&amp;ouml;l&amp;uuml;nd&amp;uuml;klerinde sistemin nasıl bir &amp;ouml;nceki veya daha &amp;ouml;nceki thread'i &amp;ccedil;alıştırabildiğini d&amp;uuml;ş&amp;uuml;nelim. İşlemci zaman dilimini dolduran bir thread i&amp;ccedil;in donanımda bir kesme işareti bırakır, bunun ardında thread'e ait bir takım bilgiler belleğe yazılır ve sonra bu bellek b&amp;ouml;lgesinde Context adı verilen bir veri yapısına depolanır. Sistem bu thread'e d&amp;ouml;neceği zaman Context'te yer alan bilgilere bakar ve hangi donanımın kesme sinyali verdiğini bulur. Ardından bu sinyal a&amp;ccedil;ılır ve işlemin bir sonraki işlem par&amp;ccedil;acığının &amp;ccedil;alışacağı zaman dilimine girilir. Eğer thread işlemini &amp;ccedil;ok fazla kullanırsanız bu durumda bellek kaynaklarınıda fazlası ile t&amp;uuml;ketmiş olursunuz. Bu thread'leri neden titiz bir şekilde programlamamız gerektiğini anlatan nedenlerden sadece birisidir. &amp;Ouml;yleki yanlış yapılan thread programlamaları sistemlerin kilitlenmesine de yol a&amp;ccedil;acaktır.&lt;/p&gt;
&lt;p align="left"&gt;Threading g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi &amp;ccedil;ok basit olmayan bir kavramdır. Bu nedenle olayı daha iyi a&amp;ccedil;ıklayabileceğimi d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m &amp;ouml;rneklerime ge&amp;ccedil;mek istiyorum. Uygulamamızın formu aşağıdaki şekildeki gibi olucak.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="http://www.buraksenyurt.com/makale/images/mk33_1.gif" alt="" width="365" height="245" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 1. Form Tasarımımız.&lt;/p&gt;
&lt;p align="left"&gt;Şimdi kodlarımızı yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void z1() 
{ 
    for (int i = 1; i &amp;lt; 60; ++i) 
    { 
        zaman1.Value += 1; 
        for (int j = 1; j &amp;lt; 10000000; ++j) 
        { 
            j += 1; 
        } 
    } 
}
public void z2() 
{ 
    for (int k = 1; k &amp;lt; 100; ++k) 
    { 
        zaman2.Value += 1; 
        for (int j = 1; j &amp;lt; 25000000; ++j) 
        { 
            j += 1; 
        } 
    } 
}
private void btnBaslat_Click(object sender, System.EventArgs e) 
{ 
    z1(); 
    z2(); 
}&lt;/pre&gt;
&lt;p&gt;Program kodlarımızı kısaca a&amp;ccedil;ıklayalım. Z1 ve z2 isimli metodlarımız progressBar kontrolllerimizin değerlerini belirli zaman aralıklarıyla arttırıyorlar. Bu işlemleri ge&amp;ccedil;ekleştirmek i&amp;ccedil;in, Başlat başlıklı butonumuza tıklıyoruz. Burada &amp;ouml;nce z1 daha sonrada z2 isimli metodumuz &amp;ccedil;alıştırılıyor. Bunun sonucu olarak &amp;ouml;nce zaman1 isimli progressBar kontrol&amp;uuml;m&amp;uuml;z doluyor ve dolması bittikten sonra zaman2 isimli progressBar kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n value değeri arttırılarak dolduruluyor.&lt;/p&gt;
&lt;p align="left"&gt;Şimdi bu programın ş&amp;ouml;yle &amp;ccedil;alışmasını istediğimizi d&amp;uuml;ş&amp;uuml;nelim. Her iki progressBar'da aynı anda dolmaya başlasınlar. İstediğimiz zaman z1 ve z2 metodlarının &amp;ccedil;alışmasını durduralım ve tekrar başlatabilelim. Tekrar başlattığımızda ise progressBar'lar kaldıkları yerden dolmaya devam etsinler. S&amp;ouml;z ettiğimiz aslında her iki metodunda aynı anda &amp;ccedil;alışmasıdır. İşte bu işi başarmak i&amp;ccedil;in bu metodları sisteme birer iş par&amp;ccedil;acağı ( thread ) olarak tanıtmalı ve bu thread'leri y&amp;ouml;netmeliyiz.&lt;/p&gt;
&lt;p align="left"&gt;.Net ortamında thread'ler i&amp;ccedil;in System.Threading isim uzayını kullanırız. &amp;Ouml;ncelikle programımıza bu isim uzayını ekliyoruz. Ardından z1 ve z2 metodlarını birer iş par&amp;ccedil;acığı olarak tanımlamamız gerekiyor. İşte kodlarımız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void z1()
{
    for (int i = 1; i &amp;lt; 60; ++i)
    {
        zaman1.Value += 1;
        for (int j = 1; j &amp;lt; 10000000; ++j)
        {
            j += 1;
        }
    }
}
public void z2()
{
    for (int k = 1; k &amp;lt; 100; ++k)
    {
        zaman2.Value += 1;
        for (int j = 1; j &amp;lt; 25000000; ++j)
        {
            j += 1;
        }
    }
}
ThreadStart ts1;
ThreadStart ts2;
Thread t1;
Thread t2;
private void btnBaslat_Click(object sender, System.EventArgs e)
{
    ts1 = new ThreadStart(z1);
    /* ThreadStart iş par&amp;ccedil;acığı olarak kullanılıcak metod i&amp;ccedil;in bir temsilcidir. 
        * Bu metod i&amp;ccedil;in tanımlanacak thread sınıfı nesnesi i&amp;ccedil;in paramtere olucak ve 
        * bu nesnenin hangi metodu iş par&amp;ccedil;acığı olarak g&amp;ouml;receğini belirtecektir. 
        */
    ts2 = new ThreadStart(z2);
    t1 = new Thread(ts1);
    t2 = new Thread(ts2);
    t1.Start(); /* İş par&amp;ccedil;ağını Start metodu ile başlatıyoruz. */
    t2.Start();

    btnBaslat.Enabled = false;
}
private void btnDurdur_Click(object sender, System.EventArgs e)
{
    t1.Suspend();
    /* İş par&amp;ccedil;acağı ge&amp;ccedil;ici bir s&amp;uuml;re i&amp;ccedil;in uyku moduna ge&amp;ccedil;er. 
        * Uyku modundaki bir iş par&amp;ccedil;acağını tekrar aktif hale getirmek i&amp;ccedil;in Resume metodu kullanılır. */
    t2.Suspend();
}
private void btnDevam_Click(object sender, System.EventArgs e)
{
    t1.Resume();
    /* Uyku modundaki iş par&amp;ccedil;acığının kaldığı yerden devam etmesini sağlar. */
    t2.Resume();
}
private void btnKapat_Click(object sender, System.EventArgs e)
{
    if (t1.IsAlive)
    /* Eğer iş par&amp;ccedil;acıkları hen&amp;uuml;z sonlanmamışsa bunlar canlıdır ve IsAlive &amp;ouml;zellikleri true değerine sahiptir. 
        * Programımızda ilk biten iş par&amp;ccedil;acığı t1 olucağından onun bitip bitmediğini kontrol ediyoruz. 
        * Eğer bitmiş ise programımız close metodu sayesinde kapatılabilir. */
    {
        MessageBox.Show("&amp;Ccedil;alışan threadler var program sonlanamaz.");
    }
    else
    {
        this.Close();
    }
}&lt;/pre&gt;
&lt;p align="left"&gt;Uygulamamızda z1 ve z2 isimli metodlarımızı birer iş par&amp;ccedil;acığı (thread) haline getirdik. Bunun i&amp;ccedil;in System.Threding isim uzayında yer alan ThreadStart ve Thread sınıflarını kullandık. ThreadStart sınıfı , iş par&amp;ccedil;acığı olucak metodu temsil eden bir delegate gibi davranır. İş par&amp;ccedil;acıklarını başlatıcak(start), durdurucak(suspend), devam ettirecek(resume) thread nesnelerimizi tanımladığımız yapıcı metod ThreadStart sınıfından bir temsilciyi parametre olarak alır. Sonu&amp;ccedil; itibariyle kullanıcı Başlat başlıklı button kontrol&amp;uuml;ne tıkladığında, her iki progressBar kontrol&amp;uuml;n&amp;uuml;nde aynı zamanda dolmaya başladığını ve ilerlediklerini g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bu aşamada Durdur isimli button kontrol&amp;uuml;ne tıklarsak her iki progressBar'ın ilerleyişinin durduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Nitekim iş par&amp;ccedil;acıklarının Suspend metodu &amp;ccedil;ağırılmış ve metodların &amp;ccedil;alıştırılması durdurulmuştur.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="http://www.buraksenyurt.com/makale/images/mk33_2.gif" alt="" width="368" height="248" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 2. Suspend metodu sonrası.&lt;/p&gt;
&lt;p align="left"&gt;Bu andan sonra tekrar Devam button kontrol&amp;uuml;ne tıklarsak thread nesnelerimiz Resume metodu sayesinde &amp;ccedil;alışmalarına kaldıkları yerden devam ediceklerdir. Dolayısıyla progressBar kontrolllerimizde kaldıkları yerden dolmaya devam ederler. Bu sırada programı kapatmaya &amp;ccedil;alışmamız hen&amp;uuml;z sonlanmamış iş par&amp;ccedil;acıkları nedeni ile hataya neden olur. Bu nedenle Kapat button kontrol&amp;uuml;nde IsAlive &amp;ouml;zelliği ile iş par&amp;ccedil;acıklarının canlı olup olmadığı yani metodların &amp;ccedil;alışmaya devam edip etmediği kontrol edilir. Eğer sonlanmamışsa kullanıcı aşağıdaki mesaj kutusu ile uyarılır.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="http://www.buraksenyurt.com/makale/images/mk33_3.gif" alt="" width="360" height="247" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 3. İş Par&amp;ccedil;acıkları hen&amp;uuml;z sonlanmamış ise.&lt;/p&gt;
&lt;p align="left"&gt;Evet geldik Threading ile ilgili makale dizimizin ilk b&amp;ouml;l&amp;uuml;m&amp;uuml;n&amp;uuml;n sonuna . Bir sonraki makalemizde Threading kavramını dahada derinlemesine incelemeye &amp;ccedil;alışacağız. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-01-01 12:00:00</pubDate>
  <slug>Çok-Kanallı(Multithread)-Uygulamalar-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>thread</tag>
    <tag>multi-thread</tag>
    <tag>net</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>