<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tip Güvenli (Type Safety ) Koleksiyonlar Oluşturmak - 2</title>
  <description>Bir önceki makalemizde tip güvenli koleksiyon nesnelerimizi CollectionBase sınıfı yardımıyla nasıl oluşturabileceğimizi incelemiştik. CollectionBase bize ArrayList benzeri koleksiyon sınıflarını yazma fırsatı vermektedir. Diğer yandan Hashtable koleksiyonunda olduğu gibi key (anahtar) - value (değer) çiftlerinden oluşacak tip güvenli bir koleksiyon sınıfı yazmak isteyebiliriz. Bu durumda, DictionaryBase sınıfından yaralanabiliriz. DictionaryBase sınıfıda CollectionBase sınıfı gibi abstract yapıdadır. Yani kendisini örnekleyemeyiz. Temel olarak DictionaryBase key-value çiftlerine sahip bir koleksiyonun kullanması gereken üyeleri sunan arayüzlerden türemiştir. Yani IDictionary, IEnumerable ve ICollection arayüzlerini uyarlamaktadır. Dikkat ederseniz CollectionBase sınıfınında türediği IEnumerable ve ICollection arayüzleri DictionaryBase içinde söz konusudur.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki makalemizde tip g&amp;uuml;venli koleksiyon nesnelerimizi CollectionBase sınıfı yardımıyla nasıl oluşturabileceğimizi incelemiştik. CollectionBase bize ArrayList benzeri koleksiyon sınıflarını yazma fırsatı vermektedir. Diğer yandan Hashtable koleksiyonunda olduğu gibi key (anahtar) - value (değer) &amp;ccedil;iftlerinden oluşacak tip g&amp;uuml;venli bir koleksiyon sınıfı yazmak isteyebiliriz. Bu durumda, DictionaryBase sınıfından yaralanabiliriz. DictionaryBase sınıfıda CollectionBase sınıfı gibi abstract yapıdadır. Yani kendisini &amp;ouml;rnekleyemeyiz. Temel olarak DictionaryBase key-value &amp;ccedil;iftlerine sahip bir koleksiyonun kullanması gereken &amp;uuml;yeleri sunan aray&amp;uuml;zlerden t&amp;uuml;remiştir. Yani IDictionary, IEnumerable ve ICollection aray&amp;uuml;zlerini uyarlamaktadır. Dikkat ederseniz CollectionBase sınıfınında t&amp;uuml;rediği IEnumerable ve ICollection aray&amp;uuml;zleri DictionaryBase i&amp;ccedil;inde s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk131_1.gif" alt="" width="398" height="346" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;CollectionBase sınıfı gerekli fonksiyonelliği sağlamak i&amp;ccedil;in nasıl ki bir ArrayList koleksiyonunu &amp;ccedil;evreliyorsa (encapsulate), DictionaryBase sınıfıda bir Hashtable koleksiyonunu &amp;ccedil;evreler. DictionaryBase sınıfının protected &amp;ouml;zellikleri (Dictonary , InnerHashtable) yardımıyla oluşturduğumuz koleksiyon i&amp;ccedil;indeki key-value &amp;ccedil;iftlerine erişilebilir ve eleman ekleme, silme, arama vb. gibi pek &amp;ccedil;ok var olan aksiyonu ger&amp;ccedil;ekleştirebiliriz. &amp;Ouml;rneğimizi incelediğimizde DictionaryBase yardımıyla tip g&amp;uuml;venli bir koleksiyon nesnesi oluşturmanın, CollectionBase kullanıldığında ger&amp;ccedil;ekleştirilen uyarlama ile neredeyse aynı olduğunu g&amp;ouml;recekseniz. Tek fark, i&amp;ccedil;eride erişilen nesnenin bir Dictionary nesnesi olması ve key-value &amp;ccedil;iftlerinin s&amp;ouml;z konusu olmasıdır.&lt;/p&gt;
&lt;table id="table6" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;DictionaryBase sınıfı key-value (anahtar - değer) &amp;ccedil;iftlerinin kullanıldığı Hashtable tipi koleksiyon sınıflarını yazmamızı ve kendi tip g&amp;uuml;venliğimizi oluşturabilmemizi sağlar.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Şimdi gelin bir &amp;ouml;rnek &amp;uuml;zerinden bu konuyu incelemeye &amp;ccedil;alışalım. Bu sefer anahtar-değer &amp;ccedil;iftleri yapısına uygun bir koleksiyon nesnesi olarak ISBN numarasına sahip Kitapları g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alacağız. ISBN numaraları bizim i&amp;ccedil;in key (anahtar) olacak. Bunun karşılığında ise bir Kitap nesnesini value(değer) olarak tutacağız. Bu elbette tipik olarak bir Hashtable koleksiyonu ile de yapılabilir. Ancak bizim amacımız anahtarların(keys) mutlaka integer ve değerlerin (values) mutlaka Kitap tipinden nesne &amp;ouml;rnekleri olmasıdır. Normal bir Hashtable key-value &amp;ccedil;iftlerini object tipinden tuttuğu i&amp;ccedil;in, herhangibir tipi bu &amp;ccedil;iftlere atayabiliriz. İşte burada tip g&amp;uuml;venliği bizim esas olan amacımız olmaktadır. Bu nedenlede DictionaryBase sınıfı yardımıyla kendi koleksiyon sınıfımızı yazacağız. İlk olarak Kitap nesnemize ait sınıfımızı oluşturalım. Sınıfımızın basit yapısı aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk131_2.gif" alt="" width="202" height="141" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sınıfımız kodları;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace StrongCollections
{
    public class Kitap
    {
        private int m_ISBN;
        private string m_Baslik;
        private int m_Fiyat;

        public int ISBN
        {
            get{return m_ISBN;}
            set{m_ISBN=value;}
        }
        public string Baslik
        {
            get{return m_Baslik;}
            set{m_Baslik=value;}
        }
        public int Fiyat
        {
            get{return m_Fiyat;}
            set{m_Fiyat=value;}
        }
        public Kitap(int isbn,string baslik,int fiyat)
        {
            m_ISBN=isbn;
            m_Baslik=baslik;
            m_Fiyat=fiyat;
        }
        public override string ToString()
        {
            return m_ISBN.ToString()+" "+m_Baslik+" "+m_Fiyat.ToString();
        }
        public Kitap()
        {
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi kendi tip g&amp;uuml;venli koleksiyon sınıfımızı yazalım. Sınıfımızı DictionaryBase' den t&amp;uuml;rettikten sonra i&amp;ccedil;eriden Dictionary &amp;ouml;zelliğine erişerek eleman ekleme, &amp;ccedil;ıkarma, arama, bulma gibi işlemleri yapacağımız metodlar ile bir indeksleyici ve anahtarlar(keys) &amp;uuml;zerinde &amp;ouml;teleme yapabileceğimiz bir numarator metod ekleyeceğiz. Basit olarak sınıfımızın i&amp;ccedil;eriği aşağıdaki gibi olacak.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk131_3.gif" alt="" width="223" height="297" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sınıf kodlarımız;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections;

namespace StrongCollections
{
    public class KitapKoleksiyon:DictionaryBase
    {
        public void Ekle(int isbn,Kitap kitap)
        {
            Dictionary.Add(isbn,kitap);
        }
        public void Cikart(int isbn)
        {
            Dictionary.Remove(isbn);
        }
        public bool Varmi(int isbn)
        {
            return Dictionary.Contains(isbn);
        }
        public Kitap Bul(int isbn)
        {
            return (Kitap)Dictionary[isbn];
        }
        public Kitap this[int isbn]
        {
            get{return (Kitap)Dictionary[isbn];}
            set{Dictionary[isbn]=value;}
        }
        public IEnumerator NumaratorAl()
        {
             return Dictionary.Keys.GetEnumerator();
        }
        public KitapKoleksiyon()
        {
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Ekle metodumuz iki parametre almaktadır. Tahmin edeceğiniz gibi ilk parametremiz Hashtable koleksiyonu i&amp;ccedil;in gerekli key (anahtar), ikinci parametremiz ise value(değer) dir. Bu metod sayesinde, belli bir isbn numarasının karşılığı olarak bir Kitap nesne &amp;ouml;rneğini koleksiyonumuza eklemiş oluruz. Cikart metodu, parametre olarak verilen isbn değerini Dictionary i&amp;ccedil;erisinde bulur ve listeden &amp;ccedil;ıkartır. Varmi metodumuz geriye bool tipinden bir değer d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Amacı belirtilen isbn değerinin koleksiyonda yer alıp almadığını belirlemektir. Bunun i&amp;ccedil;in Dictionary &amp;ouml;zelliği &amp;uuml;zerinden Contains metodunu &amp;ccedil;ağırırız.&lt;/p&gt;
&lt;p&gt;Bul metodumuz ise, parametre olarak girilen isbn' i Dictionary &amp;uuml;zerinde arar ve sonucu geriye bir Kitap nesne &amp;ouml;rneği şeklinde d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Bu d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme gereklidir &amp;ccedil;&amp;uuml;nk&amp;uuml; Dictionary geriye object tipinden bir nesne &amp;ouml;rneğini d&amp;ouml;nd&amp;uuml;recektir. Indeksleyicimizin indeks değerleri bu sefer key (anahtar) lardır. Dikkat ederseniz t&amp;uuml;m metodlarımız int-Kitap tipinden anahtar-değer &amp;ccedil;iftlerini kullanmaktadır. B&amp;ouml;ylece aslında tip g&amp;uuml;venliğinide sağlamış oluyoruz. Son olarak eklediğimiz NumaratorAl isimli metodumuz Dictionary &amp;uuml;zerinde Key değerleri i&amp;ccedil;in bir IEnumerator nesne &amp;ouml;rneğini geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;yor. Bunu &amp;ccedil;alışma zamanında koleksiyonumuz i&amp;ccedil;indeki anahtarlar &amp;uuml;zerinden &amp;ouml;teleme yaparak Kitap nesnelerini elde etmek i&amp;ccedil;in kullanabiliriz. Kısacası bir listemele işlemi i&amp;ccedil;in kullanabiliriz. Şimdi koleksiyonumuzu kullanacağımız bir &amp;ouml;rnek uygulama yazalım.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections;

namespace StrongCollections
{
    class Uygulama
    {
        static KitapKoleksiyon kitapCol;
    
        static void Listele()
        { 
            IEnumerator numarator=kitapCol.NumaratorAl();
            while(numarator.MoveNext())
            {
                Console.WriteLine(kitapCol[Convert.ToInt32(numarator.Current)].ToString());
            }
        }
    
        static void KoleksiyonOlustur()
        {
            kitapCol.Ekle(1000,new Kitap(1000,"Her Y&amp;ouml;n&amp;uuml;yle C#",1));
            kitapCol.Ekle(1001,new Kitap(1001,"Thinking in C#",1));
            kitapCol.Ekle(1002,new Kitap(1002,"Truva",1));
            kitapCol.Ekle(1003,new Kitap(1003,"Java in a Nuthshell",1));
        } 

        static void Main(string[] args)
        {
            // KitapKoleksiyon nesne &amp;ouml;rneğimizi oluşturuyoruz.
            kitapCol=new KitapKoleksiyon();
            // Koleksiyonumuza bir ka&amp;ccedil; &amp;ouml;rnek Kitap elemanını ekliyoruz.( key-value &amp;ccedil;ifti olarak)
            KoleksiyonOlustur();
            // Koleksiyonumuzdaki elemanları listeliyoruz.
            Listele();
            Console.WriteLine("-------------");
            // Koleksiyonda belirtilen isbn değerine sahip Kitap nesnesi olup olmadığına bakıyoruz. (Sonu&amp;ccedil;lar bool tipinden)
            Console.WriteLine("ISBN: 1000 var mı? {0}",kitapCol.Varmi(1000));
            Console.WriteLine("ISBN: 9999 var mı? {0}",kitapCol.Varmi(9999));
            Console.WriteLine("-------------");
            // Koleksiyonumuzdan key değeri 1001 olan key-value &amp;ccedil;iftini &amp;ccedil;ıkartıyoruz.
            kitapCol.Cikart(1001);
            Console.WriteLine("ISBN: 1001 &amp;ccedil;ıktı"); 
            // Koleksiyonumuzdaki elemanların son halini listeliyoruz. (Artık 1001 numaraları eleman yok)
            Listele();
            Console.WriteLine("-------------");
            // Koleksiyonumuzda 1003 isbn değerine sahip key-value &amp;ccedil;iftini buluyoruz.
            Kitap bulunanKitap=kitapCol.Bul(1003);
            // Bulunan Kitap nesnesinin i&amp;ccedil;eriğini override ettiğimiz ToString metodu ile ekrana yazdırıyoruz.
            Console.WriteLine(bulunanKitap.ToString());
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk131_4.gif" alt="" width="292" height="263" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi KitapKoleksiyon isimli koleksiyonumuza eleman eklemek istediğimizde bizden bir key-value &amp;ccedil;ifti beklenmektedir. &amp;Ouml;yleki key integer tipinde, value ise Kitap tipinde olmak zorundadır. Bunu tasarım zamanında koleksiyonumuza eleman eklerken kolayca g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk131_5.gif" alt="" width="420" height="128" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İşte bu bizim i&amp;ccedil;in tip g&amp;uuml;venliğini sağlamaktadır. &amp;Ccedil;&amp;uuml;nk&amp;uuml; KitapKoleksiyon tipinden nesne &amp;ouml;rneğimize int-Kitap tipi dışında bir anahtar-değer &amp;ccedil;ifti ekleyemiz. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2005-07-31 12:00:00</pubDate>
  <slug>Tip-Güvenli-(Type-Safety-)-Koleksiyonlar-Oluşturmak-2-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>strongly-typed-collections</tag>
    <tag>collections</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>