<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Windows Azure Service Platformu Hakkında İlk İzlenimler</title>
  <description>Microsoft' un son yıllarda Cloud Computing mimarisi için getirdiği geliştirmelerden biriside Windows Azure Services platformudur. Bu platformu servis bazlı bir işletim sistemi olarak düşünebiliriz. Ama bu çok basit bir yaklaşım olur. Bu konuda aslında pek çok kaynakta yazılmakta ve çizilmektedir. Ancak ürün henüz nihai halini almadığından sürekli olarak değişimlere uğramaktadır. Söz gelimi daha önce yayınlanan SDK içerisine Microsoft.Net Services bloku içerisinde yer alan Workflow Services modeli, Temmuz 2009' da yayınlanan CTP sürümünde kaldırılmışdır. Aslında konunun detaylarına girdiğimde çok kısa bir sürede kaybolduğumu ifade edebilirim. Bu nedenle yazımızın bundan sonraki kısımlarında mimarinin ne getirdiğini sizlere araştırma sonuçlarımdan aktarmaya çalışacağım.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f10%2fblg91_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;G&amp;uuml;neşli a&amp;ccedil;ık bir hava ve sessiz bir g&amp;uuml;n yada gece...Deniz kenarında veya caddenin herhangibir k&amp;ouml;şesinde...Mutlaka zaman zaman g&amp;ouml;ky&amp;uuml;z&amp;uuml;ne bakıp bulutları bazı nesnelere benzettiğimiz olmuştur. Yandaki resimde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi g&amp;uuml;len bir bulutla karşılaşma ihtimalimiz az olsada, arabaya, &amp;ouml;rdeğe veya başka bir şekle benzettiğimiz bulut sayısı olduk&amp;ccedil;a fazladır. Bug&amp;uuml;nk&amp;uuml; yazımızda bulutlar ile pek bir haşır neşir olacağımızı d&amp;uuml;ş&amp;uuml;nebilirsiniz. Ancak tabiki yazılımsal anlamda &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Microsoft'&lt;/strong&gt; un son yıllarda &lt;strong&gt;Cloud Computing&lt;/strong&gt; mimarisi i&amp;ccedil;in getirdiği geliştirmelerden biriside &lt;strong&gt;Windows Azure Services&lt;/strong&gt; platformudur. Bu platformu servis bazlı bir işletim sistemi olarak d&amp;uuml;ş&amp;uuml;nebiliriz. Ama bu &amp;ccedil;ok basit bir yaklaşım olur.&amp;nbsp;Bu konuda aslında pek &amp;ccedil;ok kaynakta yazılmakta ve &amp;ccedil;izilmektedir. Ancak &amp;uuml;r&amp;uuml;n hen&amp;uuml;z nihai halini almadığından s&amp;uuml;rekli olarak değişimlere uğramaktadır. S&amp;ouml;z gelimi daha &amp;ouml;nce yayınlanan &lt;strong&gt;SDK&lt;/strong&gt; i&amp;ccedil;erisine &lt;strong&gt;Microsoft.Net Services &lt;/strong&gt;bloku i&amp;ccedil;erisinde yer alan &lt;strong&gt;Workflow Services&lt;/strong&gt; modeli, &lt;strong&gt;Temmuz 2009'&lt;/strong&gt; da yayınlanan &lt;strong&gt;CTP &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml;nde kaldırılmışdır. Aslında konunun detaylarına girdiğimde &amp;ccedil;ok kısa bir s&amp;uuml;rede kaybolduğumu ifade edebilirim. Bu nedenle yazımızın bundan sonraki kısımlarında mimarinin ne getirdiğini sizlere araştırma sonu&amp;ccedil;larımdan aktarmaya &amp;ccedil;alışacağım.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Windows Azure Service&lt;/strong&gt; Platformu iki ana par&amp;ccedil;ayı i&amp;ccedil;ermektedir. İlk par&amp;ccedil;a olan &lt;strong&gt;Windows Azure&lt;/strong&gt;, bulut tabanlı işletim sistemidir. Bu işletim sistemi &amp;uuml;zerinde ise &amp;ccedil;eşitli servis inşa blokları(&lt;strong&gt;Building Blocks&lt;/strong&gt;) yer alır&lt;em&gt;(Microsoft SQL Services, Microsoft .Net Services, Live Services, Microsoft Sharepoint Services, Microsoft Dynamics CRM Services) &lt;/em&gt;gibi. Aşağıdaki şekilde s&amp;ouml;z konusu mimari model daha net g&amp;ouml;r&amp;uuml;lebilmektedir.&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f10%2fblg91_Architecture.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Windows Azure&lt;/strong&gt; platformunu aslında şu c&amp;uuml;mle ile tanımlayabiliriz; &lt;strong&gt;Azure&lt;/strong&gt;, &lt;strong&gt;internet tabanlı bulut bilişim ortamını(Internet Based Cloud Computing) &lt;/strong&gt;sağlayarak, uygulamaların &amp;ccedil;alıştırılması veya verinin saklanması i&amp;ccedil;in &lt;strong&gt;Microsoft&lt;/strong&gt; &lt;strong&gt;veri merkezlerinin(Data Centers)&lt;/strong&gt; kullanılabilmesini sağlayan bir platformdur. Bu tanımlamaya g&amp;ouml;re &lt;strong&gt;Windows Azure Service&lt;/strong&gt; platformunu bir &lt;strong&gt;Cloud Computing Fabrikası &lt;/strong&gt;olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. &amp;Ouml;yleki bir veri merkezi olarak, uygulama veya servislerin &lt;strong&gt;Internet&lt;/strong&gt; &amp;uuml;zerinde &lt;strong&gt;geliştirilmesi(Development)&lt;/strong&gt;, &lt;strong&gt;dağıtılması(Deployement, y&amp;ouml;netilmesi(Management) &lt;/strong&gt;m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bu a&amp;ccedil;ıdan bakıldığında &lt;strong&gt;Windows Azure Service&lt;/strong&gt; platformunun iki temel fonksiyonelliği olduğu s&amp;ouml;ylenebilir. Uygulama &amp;ccedil;alıştırmak ve veri saklamak.&lt;/p&gt;
&lt;p&gt;Peki &lt;strong&gt;Internet&lt;/strong&gt; &amp;uuml;zerinde yer alan b&amp;ouml;yle bir bulut k&amp;uuml;mesinin ne gibi bir faydası olabilir? Herşeyden &amp;ouml;nce uygulamaların &amp;ccedil;alıştırılacağı verinin fiziki olarak saklanacağı ortama ait &lt;strong&gt;IT&lt;/strong&gt; karmaşıklığını d&amp;uuml;ş&amp;uuml;nememize gerek kalmamaktadır. Bir başka deyişle &lt;strong&gt;host &lt;/strong&gt;ortamının fiziki sunucu &amp;ouml;zelliklerinin ayarlanması, oluşturulması, bunlar i&amp;ccedil;in gerekli yazılımların tesis edilmesi gibi maliyetlerin d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmesine gerek kalmamaktadır. &amp;Uuml;stelik &lt;strong&gt;Cloud &lt;/strong&gt;i&amp;ccedil;erisine dahil edilen uygulama veya veri k&amp;uuml;melerinin istenen anda istenilen yerden kullanılabilmesi de m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Windows Azure&lt;/strong&gt; tarafında &amp;ouml;nem arz eden kavramlardan olan &lt;strong&gt;veri depolama(Data Storage)&lt;/strong&gt; bloku, &lt;strong&gt;BLOB(Binary Large OBjects), kuyruk(Queue) &lt;/strong&gt;ve &lt;strong&gt;basit tablo(Simple Table) &lt;/strong&gt;verilerinin saklanması i&amp;ccedil;in gerekli servisleri sunmaktadır. Ancak aksine ilişkisel veritabanları tarafından sunulan, &lt;strong&gt;sorgulama(query), arama(Search),raporlama(Reporting) &lt;/strong&gt;vb yetenekleri sağlamamaktadır. Bu yeteneklerin, &lt;strong&gt;Cloud &lt;/strong&gt;&amp;uuml;zerinde saklanan veri k&amp;uuml;melerinde kullanılabilmesi i&amp;ccedil;in &lt;strong&gt;Microsoft SQL Services'&lt;/strong&gt; lerden yararlanılması gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Microsoft .Net Services&lt;/strong&gt; şu anda 2 temel fonksiyonelliği karşılamaktadır. &lt;strong&gt;Uygulamalar arası bağlanabilirlik(Application Connectivity) &lt;/strong&gt;ve&lt;strong&gt;&amp;nbsp;Erişim kontrol&amp;uuml;(Access Control).&lt;/strong&gt;&amp;nbsp; Uygulamalar arası bağlanılabilirlik i&amp;ccedil;in &lt;strong&gt;Microsoft .NET Services Bus&lt;/strong&gt; bloku kullanılmaktadır. Bu blok, &amp;ccedil;eşitli mesajlaşma desenlerine g&amp;ouml;re &lt;strong&gt;Internet&lt;/strong&gt; &amp;uuml;zerindeki uygulamalar arasında bir &lt;strong&gt;network&lt;/strong&gt; altyapısının oluşturulabilmesini sağlamaktadır. Erişim kontrol&amp;uuml; i&amp;ccedil;in &lt;strong&gt;Microsoft .NET Access Control Service&lt;/strong&gt; bloku ele alınır. Bu blok ile aslında &lt;strong&gt;Claims&lt;/strong&gt; tabanlı erişim kontrol&amp;uuml;n&amp;uuml;n Cloud &amp;uuml;zerinde ger&amp;ccedil;eklenmesi sağlanır.&lt;/p&gt;
&lt;p&gt;Aslında &lt;strong&gt;Microsoft .Net Service'&lt;/strong&gt; leri, b&amp;uuml;t&amp;uuml;n&amp;uuml;yle servis bazlı geliştirme fabrikası olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. &lt;strong&gt;Microsoft .Net Service'&lt;/strong&gt; lerini geliştirirken kullanılan &lt;strong&gt;SDK&lt;/strong&gt;, &lt;strong&gt;WCF&lt;/strong&gt; ile entegrasyon da sağlamaktadır. Bu sayede var olan &lt;strong&gt;.Net&lt;/strong&gt; geliştirme teknikleri ile tasarlanan &lt;strong&gt;WCF&lt;/strong&gt; uygulamalarının &lt;strong&gt;Cloud&lt;/strong&gt; servisi haline getirilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. &amp;Ouml;nemli olan noktalardan bir diğeride, &lt;strong&gt;Microsoft .Net Service'&lt;/strong&gt; in sadece &lt;strong&gt;.Net&lt;/strong&gt; geliştiriciler i&amp;ccedil;in tasarlanmış olmayışıdır. Desteklenen&lt;strong&gt; REST, SOAP, WS*&lt;/strong&gt; gibi protokoller sayesinde &lt;strong&gt;Java&lt;/strong&gt; ve &lt;strong&gt;Ruby &lt;/strong&gt;gibi diller i&amp;ccedil;in geliştirilmiş olan &lt;strong&gt;SDK'&lt;/strong&gt; lardan yararlanarak da &lt;strong&gt;Cloud&lt;/strong&gt; servisleri geliştirilebilir.&lt;/p&gt;
&lt;p&gt;&lt;a title="Clodu Computing with the Windows Azure Platform" href="http://www.amazon.com/gp/product/0470506385/ref=ox_ya_oh_product" target="_blank"&gt;&lt;img style="float: right;" src="/pics/2009%2f10%2fblg91_Book2.jpg" alt="" width="108" height="135" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Windows Azure&lt;/strong&gt; platformu ile ilişkili olarak başlangı&amp;ccedil; noktamız &lt;a href="http://www.microsoft.com/windowsazure/"&gt;http://www.microsoft.com/windowsazure/&lt;/a&gt;&amp;nbsp;adresi olmalıdır. Bu adresten gerekli &lt;strong&gt;SDK&lt;/strong&gt; ve &lt;strong&gt;Visual Studio 2008/2010 Beta&amp;nbsp;X &lt;/strong&gt;ara&amp;ccedil;larının indirilierek kurulması geliştirilmeye başlanması i&amp;ccedil;in yeterlidir. Ek olarak &amp;ouml;rneğin .Net Services geliştirilmesi yapılacaksa bu konu ile ilişkili SDK' nın &lt;a href="http://www.microsoft.com/windowsazure/developers/dotnetservices/"&gt;http://www.microsoft.com/windowsazure/developers/dotnetservices/&lt;/a&gt;&amp;nbsp;adresinden tedarik edilmesi gerekmektedir.&lt;/p&gt;
&lt;p&gt;Ben bu konuya olduk&amp;ccedil;a meraklıyım aslında. Nitekim işin i&amp;ccedil;erisinde &lt;strong&gt;Service&lt;/strong&gt; kavramı var &lt;img title="Cool" src="/editors/tiny_mce3/plugins/emotions/img/smiley-cool.gif" alt="Cool" border="0" /&gt;&amp;nbsp;Bu nedenle bende boş durmadım ve &amp;ouml;n&amp;uuml;m&amp;uuml;zdeki sene &lt;strong&gt;Cloud Computing&lt;/strong&gt; ve &lt;strong&gt;Windows Azure &lt;/strong&gt;ile ilişkili olan araştırmalarımı daha sağlıklı devam ettirebilmek adına &lt;strong&gt;Amazon'&lt;/strong&gt; dan &lt;strong&gt;&lt;a title="Cloud Computing with the Azure Platform" href="http://www.amazon.com/Cloud-Computing-Windows-Platform-Programmer/dp/0470506385/ref=sr_1_1?ie=UTF8&amp;amp;s=books&amp;amp;qid=1256228080&amp;amp;sr=8-1" target="_blank"&gt;Cloud Computing with the Azure Platform &lt;/a&gt;&lt;/strong&gt;adlı&amp;nbsp;kitabı sipariş ettim. Bakalım &amp;ouml;n&amp;uuml;m&amp;uuml;zdeki sene &lt;strong&gt;Azure&lt;/strong&gt; ile ilişkili olarak ne gibi bir macera beni&lt;em&gt;(ve doğal olarak siz değerli okurlarımı)&lt;/em&gt;&amp;nbsp;bekliyor olacak. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2009-10-22 07:15:00</pubDate>
  <slug>Windows-Azure-Service-Platform-What-Is</slug>
  <tags>
    <tag>cloud-computing</tag>
    <tag>windows-azure</tag>
  </tags>
  <categories>
    <category>Windows Azure</category>
  </categories>
</post>