<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Nedir Bu MSBuild?</title>
  <description>Microsoft Build Engine aslında başlı başına bir platformdur. Kısaca MSBuild olarak anılmaktadır ve bir uygulamanın inşa edilmesi noktasında devreye giren XML(eXtensible Markup Language) tabanlı bir Script bütününü esas alır. Kısacası uygulamanın inşa edilmesi sırasındaki aşamalar XML tabanlı bir akış olarak ifade edilebilmektedir. MSBuild platformunun en önemli özelliği ise, inşa sürecinde Visual Studio gibi bir araca ihtiyaç duymuyor oluşudur...</description>
  <content>&lt;p&gt;&lt;span style="color: #ff0000;"&gt;&lt;a href="/pics/msbuild_9.jpg"&gt;&lt;img style="background-image: none; float: right; padding-top: 0px; padding-left: 0px; margin: 4px 0px; display: inline; padding-right: 0px; border-width: 0px;" title="msbuild_9" src="/pics/msbuild_9_thumb.jpg" alt="msbuild_9" width="204" height="204" align="right" border="0" /&gt;&lt;/a&gt;[Orjinal Yazım Tarihi &amp;ndash; 25/02/2013]&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Yıllar &amp;ouml;ncesinde bir ka&amp;ccedil; seneliğine de olsa saygın bir eğitim kurumunda eğitmen olarak g&amp;ouml;rev alma şansını yakalamıştım. &amp;Ouml;zellikle &lt;strong&gt;C#&lt;/strong&gt;&amp;rsquo; ın &amp;ouml;ğretilmeye &amp;ccedil;alışıldığı başlangı&amp;ccedil; niteliğindeki seanslarda dilin temel &amp;ouml;zelliklerini anlatırken, t&amp;uuml;m dış &amp;ccedil;evre ile olan bağlantıyı kesip, sadece anahtar kelime(keyword), ifade ve materyale odaklanmaya &amp;ccedil;alışırdık. Bu sebepten genellikle ilk &amp;ouml;rneklerimiz ve &lt;strong&gt;Hello World &lt;/strong&gt;uygulamamız, &lt;strong&gt;Notepad &lt;/strong&gt;gibi bir program ve komut satırındaki&lt;strong&gt; csc&lt;em&gt;(C# Compiler)&lt;/em&gt;&lt;/strong&gt; ile inşa edilirdi.&lt;/p&gt;
&lt;p&gt;O zamanlar bu bizim i&amp;ccedil;in yeterli g&amp;ouml;r&amp;uuml;n&amp;uuml;yordu ama tabi &lt;strong&gt;.Net Framework 2.0&lt;/strong&gt; ile birlikte hayatımıza yeni bir inşa s&amp;uuml;reci de girdi. Aslında bu g&amp;uuml;nk&amp;uuml; konumuzda da, &lt;strong&gt;Notepad&lt;em&gt;(tam olarak Notepad 2)&lt;/em&gt;&lt;/strong&gt; ve komut satırı aracını kullanarak ilerlemeye &amp;ccedil;alışıyor olacağız. Amacımız &lt;strong&gt;MSBuild&lt;/strong&gt; platformunu &amp;ccedil;ok kısaca tanımaya ve anlamaya &amp;ccedil;alışmak.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Microsoft Build Engine&lt;/strong&gt; aslında başlı başına bir platformdur. Kısaca &lt;strong&gt;MSBuild&lt;/strong&gt; olarak anılmaktadır ve bir uygulamanın inşa edilmesi noktasında devreye giren &lt;strong&gt;XML&lt;em&gt;(eXtensible Markup Language)&lt;/em&gt;&lt;/strong&gt; tabanlı bir &lt;strong&gt;Script&lt;/strong&gt; b&amp;uuml;t&amp;uuml;n&amp;uuml;n&amp;uuml; esas alır. Kısacası uygulamanın inşa edilmesi sırasındaki aşamalar &lt;strong&gt;XML&lt;/strong&gt; tabanlı bir akış olarak ifade edilebilmektedir. &lt;strong&gt;MSBuild&lt;/strong&gt; platformunun en &amp;ouml;nemli &amp;ouml;zelliği ise, inşa s&amp;uuml;recinde &lt;strong&gt;Visual Studio&lt;/strong&gt; gibi bir araca ihtiya&amp;ccedil; duymuyor oluşudur.&lt;/p&gt;
&lt;p&gt;Evet &lt;strong&gt;Visual Studio&lt;/strong&gt;&amp;rsquo; nun kendisi, &lt;strong&gt;Build &lt;/strong&gt;işlemlerinde bu platformu kullanmaktadır doğru ama, tam tersi durum ge&amp;ccedil;erli değildir. Yani istersek &lt;strong&gt;MSBuild&lt;/strong&gt; aracını kullanarak, bir uygulamanın veya uygulama ortamının &amp;uuml;retilmesi sırasındaki aşamaları, basit bir &lt;strong&gt;Notepad&lt;/strong&gt; aracı ile tasarlayabilir ve &lt;strong&gt;MSBuild.exe&lt;/strong&gt;&amp;rsquo; den yararlanarak hayata ge&amp;ccedil;irebiliriz&lt;em&gt;(Ancak bu g&amp;uuml;n şanslısınız &amp;ccedil;&amp;uuml;nk&amp;uuml; &lt;strong&gt;Notepad2 &lt;/strong&gt;isimli &amp;uuml;r&amp;uuml;n&amp;uuml; kullanacağız. &lt;a href="http://sourceforge.net/projects/notepad2/"&gt;Sourceforge adresinden indirebilirsiniz&lt;/a&gt;&amp;nbsp; &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_91.png" alt="Smile" /&gt; )&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu fikir tabi ki otomatize edilmiş &lt;strong&gt;Build&lt;/strong&gt; işlemlerinin de icra edilebileceği anlamına gelmektedir. Ki &lt;strong&gt;Team Foundation Server&lt;/strong&gt; &amp;uuml;r&amp;uuml;n&amp;uuml; de &lt;strong&gt;MSBuild&lt;/strong&gt;&amp;rsquo; un etkin bir şekilde kullanılmasına olanak tanımaktadır. &amp;Ouml;zellikle &lt;strong&gt;Team Foundation Build &lt;/strong&gt;olarak anılan platform i&amp;ccedil;erisinde &lt;strong&gt;Build Server&lt;/strong&gt;&amp;rsquo; un kurulduğu ortam &lt;strong&gt;MSBuild Script&lt;/strong&gt;&amp;rsquo; lerini kullanarak &amp;uuml;retim işlemlerini ger&amp;ccedil;ekleştirmektedir. S&amp;ouml;z gelimizi &lt;strong&gt;TFS &lt;/strong&gt;tarafında eğer &lt;strong&gt;Continous Integration &lt;/strong&gt;gibi bir strateji tercih edilmişse, kodlamacıların &lt;strong&gt;Check-In&lt;/strong&gt; işlemleri sonrası &lt;strong&gt;Team Foundation Build&lt;/strong&gt; devreye girecek ve &lt;strong&gt;MSBuild script&lt;/strong&gt;&amp;rsquo; leri otomatik olarak &amp;ccedil;alıştırılarak inşa işlemleri icra edilecektir. &lt;em&gt;(&lt;strong&gt;Team Foundation Build&lt;/strong&gt; ayrıca incelenmesi gereken bir konu olduğundan bu yazımızda detaylandırılmamıştır)&lt;/em&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Visual Studio&lt;/strong&gt; ortamında geliştirdiğimiz projeleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda, oluşturulan proje dosyaları i&amp;ccedil;erisinde, &lt;strong&gt;MSBuild&lt;/strong&gt;&amp;rsquo; un kullanacağı &lt;strong&gt;ayarlar&lt;em&gt;(Settings) &lt;/em&gt;&lt;/strong&gt;ve bazı koşul bağlı işlevsellikler konuşlandırılmaktadır. Tabi geliştirici olarak bu kısımlar ile pek fazla uğraşmayız ve nihayetinde &lt;strong&gt;Visual Studio&lt;/strong&gt; bizim i&amp;ccedil;in bu akışları otomatik olarak inşa eder. Ancak &lt;strong&gt;Release Manager&lt;/strong&gt; gibi pozisyonlar &amp;ouml;zellikle bu proje dosya i&amp;ccedil;eriklerini değerlendirerek genişletmeler yapabilir ve &lt;strong&gt;MSBuild&lt;/strong&gt; s&amp;uuml;recini farklılaştırabilirler.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Visual Studio ile geliştirilen proje dosyaları C# tarafı i&amp;ccedil;in csproj, Visual Basic tarafı i&amp;ccedil;in vbproj, Managed C++ tarafı i&amp;ccedil;inse vcxproj uzantılı olanlardır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;Hangi Durumlarda MSBuild&lt;/h1&gt;
&lt;p&gt;Peki &lt;strong&gt;MSBuild&lt;/strong&gt; ağırlık olarak hangi hallerde ele alınır.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;En bilinen sebep elimizde &lt;strong&gt;Visual Studio&lt;/strong&gt; olmayan bir ortamda inşa etme işlemlerinde değerlendirilebiliyor olmasıdır.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Compiler&lt;/strong&gt; devreye girmeden &amp;ouml;nce bazı dosyaların &lt;strong&gt;Process&lt;/strong&gt; edilmesi gereken durumlarda ele alınabilir.&lt;em&gt;(Pre-Processing Steps)&lt;/em&gt;&amp;nbsp;&lt;/li&gt;
&lt;li&gt;Benzer şekilde &lt;strong&gt;Process&lt;/strong&gt; sonrası yapılması istenen işlemler i&amp;ccedil;inde kullanılabilir&lt;em&gt;(Post-Processing Steps)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Build&lt;/strong&gt; işlemi sonucu &amp;ccedil;ıktıların farklı bir klas&amp;ouml;re taşınması sağlanabilir. &lt;em&gt;(Ki bu klas&amp;ouml;r pek &amp;ccedil;ok projenin ortaktaşa kullandığı bir assembly i&amp;ccedil;in paylaşımdaki bir makine bile olabilir)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;&amp;Ccedil;ıktıların sıkıştırılması istendiği bir durumda ele alınabilir.&lt;/li&gt;
&lt;li&gt;İnşa işleminin birden fazla &lt;strong&gt;Process&amp;rsquo;&lt;/strong&gt; e b&amp;ouml;l&amp;uuml;nerek daha hızlı tamamlanması istendiği durumlarda değerlendirilebilir. &lt;em&gt;(&amp;Ouml;zellikle Enterprise &amp;ccedil;&amp;ouml;z&amp;uuml;mlerde, n sayıda Branch&amp;rsquo; in ve dolayısıyla &amp;ccedil;ıktının s&amp;ouml;z konusu olabileceği senaryolarda, uzun s&amp;uuml;rebilecek Build işlemleri i&amp;ccedil;in kritik bir &amp;ouml;zelliktir)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;MSBuild 64bitlik &lt;/strong&gt;bir sistem i&amp;ccedil;in inşa işlemini icra edebilir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Build&lt;/strong&gt; işleminin herhangibir noktasında harici bir aracın kullanılması istendiği hallerde g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;ve benzeri pek &amp;ccedil;ok durumda &lt;strong&gt;MSBuild&lt;/strong&gt;&amp;rsquo; u a&amp;ccedil;ık bir şekilde &amp;ouml;zelleştirerek kullanabiliriz.&lt;/p&gt;
&lt;h1&gt;Proje Dosyasının İ&amp;ccedil;ine Bakalım&lt;/h1&gt;
&lt;p&gt;Hızlı bir şekilde uygulama geliştirme işine giren pek &amp;ccedil;ok yazılımcı &amp;ccedil;oğunlukla &lt;strong&gt;MSBuild &lt;/strong&gt;gibi programların &amp;uuml;rettiği &amp;ccedil;ıktıları g&amp;ouml;z ardı etmektedir. Nasıl olsa binlerce dolar verilerek satın alınan &lt;strong&gt;Visual Studio &lt;/strong&gt;bizim yerimize pek g&amp;uuml;zel bu işi halletmektedir. Ancak ger&amp;ccedil;ek hayatta &amp;ouml;yle vakalar ve senaryolara vuku bulmaktadır ki, bunların &amp;uuml;stesinden gelebilmek i&amp;ccedil;in &amp;ouml;zelleştirmelere gidilmesi şart olmaktadır. Bu &amp;ouml;zelleştirme konsepti &lt;strong&gt;MSBuild &lt;/strong&gt;tarafı i&amp;ccedil;in de ge&amp;ccedil;erlidir. Bu sebepten proje dosyalarının i&amp;ccedil;eriğinin az da olsa bilinmesi en azından şema yapısının anlaşılması yararlıdır. Tipik olarak bir &lt;strong&gt;Console &lt;/strong&gt;uygulaması dahi a&amp;ccedil;sak, &amp;uuml;retilen proje dosyası i&amp;ccedil;erisinde&lt;em&gt;(ki &amp;ouml;rneğimiz &lt;strong&gt;csproj &lt;/strong&gt;uzantılı olandır)&lt;/em&gt; aşağıdakine benzer bir i&amp;ccedil;erik oluştuğu g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8"?&amp;gt; 
&amp;lt;Project ToolsVersion="4.0" DefaultTargets="Build" xmlns="http://schemas.microsoft.com/developer/msbuild/2003"&amp;gt; 
  &amp;lt;Import Project="$(MSBuildExtensionsPath)\$(MSBuildToolsVersion)\Microsoft.Common.props" Condition="Exists('$(MSBuildExtensionsPath)\$(MSBuildToolsVersion)\Microsoft.Common.props')" /&amp;gt; 
  &amp;lt;PropertyGroup&amp;gt; 
    &amp;lt;Configuration Condition=" '$(Configuration)' == '' "&amp;gt;Debug&amp;lt;/Configuration&amp;gt; 
    &amp;lt;Platform Condition=" '$(Platform)' == '' "&amp;gt;AnyCPU&amp;lt;/Platform&amp;gt; 
    &amp;lt;ProjectGuid&amp;gt;{21E86FBF-5A78-4175-8522-A6FC854BB637}&amp;lt;/ProjectGuid&amp;gt; 
    &amp;lt;OutputType&amp;gt;Exe&amp;lt;/OutputType&amp;gt; 
    &amp;lt;AppDesignerFolder&amp;gt;Properties&amp;lt;/AppDesignerFolder&amp;gt; 
    &amp;lt;RootNamespace&amp;gt;ConsoleApplication33&amp;lt;/RootNamespace&amp;gt; 
    &amp;lt;AssemblyName&amp;gt;ConsoleApplication33&amp;lt;/AssemblyName&amp;gt; 
    &amp;lt;TargetFrameworkVersion&amp;gt;v4.5&amp;lt;/TargetFrameworkVersion&amp;gt; 
    &amp;lt;FileAlignment&amp;gt;512&amp;lt;/FileAlignment&amp;gt; 
  &amp;lt;/PropertyGroup&amp;gt; 
  &amp;lt;PropertyGroup Condition=" '$(Configuration)|$(Platform)' == 'Debug|AnyCPU' "&amp;gt; 
    &amp;lt;PlatformTarget&amp;gt;AnyCPU&amp;lt;/PlatformTarget&amp;gt; 
    &amp;lt;DebugSymbols&amp;gt;true&amp;lt;/DebugSymbols&amp;gt; 
    &amp;lt;DebugType&amp;gt;full&amp;lt;/DebugType&amp;gt; 
    &amp;lt;Optimize&amp;gt;false&amp;lt;/Optimize&amp;gt; 
    &amp;lt;OutputPath&amp;gt;bin\Debug\&amp;lt;/OutputPath&amp;gt; 
    &amp;lt;DefineConstants&amp;gt;DEBUG;TRACE&amp;lt;/DefineConstants&amp;gt; 
    &amp;lt;ErrorReport&amp;gt;prompt&amp;lt;/ErrorReport&amp;gt; 
    &amp;lt;WarningLevel&amp;gt;4&amp;lt;/WarningLevel&amp;gt; 
  &amp;lt;/PropertyGroup&amp;gt; 
  &amp;lt;PropertyGroup Condition=" '$(Configuration)|$(Platform)' == 'Release|AnyCPU' "&amp;gt; 
    &amp;lt;PlatformTarget&amp;gt;AnyCPU&amp;lt;/PlatformTarget&amp;gt; 
    &amp;lt;DebugType&amp;gt;pdbonly&amp;lt;/DebugType&amp;gt; 
    &amp;lt;Optimize&amp;gt;true&amp;lt;/Optimize&amp;gt; 
    &amp;lt;OutputPath&amp;gt;bin\Release\&amp;lt;/OutputPath&amp;gt; 
    &amp;lt;DefineConstants&amp;gt;TRACE&amp;lt;/DefineConstants&amp;gt; 
    &amp;lt;ErrorReport&amp;gt;prompt&amp;lt;/ErrorReport&amp;gt; 
    &amp;lt;WarningLevel&amp;gt;4&amp;lt;/WarningLevel&amp;gt; 
  &amp;lt;/PropertyGroup&amp;gt; 
  &amp;lt;ItemGroup&amp;gt; 
    &amp;lt;Reference Include="System" /&amp;gt; 
    &amp;lt;Reference Include="System.Core" /&amp;gt; 
    &amp;lt;Reference Include="System.Xml.Linq" /&amp;gt; 
    &amp;lt;Reference Include="System.Data.DataSetExtensions" /&amp;gt; 
    &amp;lt;Reference Include="Microsoft.CSharp" /&amp;gt; 
    &amp;lt;Reference Include="System.Data" /&amp;gt; 
    &amp;lt;Reference Include="System.Xml" /&amp;gt; 
  &amp;lt;/ItemGroup&amp;gt; 
  &amp;lt;ItemGroup&amp;gt; 
    &amp;lt;Compile Include="Program.cs" /&amp;gt; 
    &amp;lt;Compile Include="Properties\AssemblyInfo.cs" /&amp;gt; 
  &amp;lt;/ItemGroup&amp;gt; 
  &amp;lt;ItemGroup&amp;gt; 
    &amp;lt;None Include="App.config" /&amp;gt; 
  &amp;lt;/ItemGroup&amp;gt; 
  &amp;lt;Import Project="$(MSBuildToolsPath)\Microsoft.CSharp.targets" /&amp;gt; 
  &amp;lt;!-- To modify your build process, add your task inside one of the targets below and uncomment it. 
       Other similar extension points exist, see Microsoft.Common.targets. 
  &amp;lt;Target Name="BeforeBuild"&amp;gt; 
  &amp;lt;/Target&amp;gt; 
  &amp;lt;Target Name="AfterBuild"&amp;gt; 
  &amp;lt;/Target&amp;gt; 
  --&amp;gt; 
&amp;lt;/Project&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu &lt;strong&gt;XML&lt;/strong&gt; i&amp;ccedil;eriğinin şema yapısına bakıldığında aşağıdaki grafikte g&amp;ouml;r&amp;uuml;len iskeletin s&amp;ouml;z konusu olduğu g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/msbuild_2.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="msbuild_2" src="/pics/msbuild_2_thumb.png" alt="msbuild_2" width="331" height="595" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Aslında i&amp;ccedil;erik okunduğunda, &lt;strong&gt;Visual Studio&lt;/strong&gt; &lt;strong&gt;Proje&lt;/strong&gt; &lt;strong&gt;&amp;Ouml;zelliklerinden&lt;/strong&gt; de ayarladığımız pek &amp;ccedil;ok &amp;ouml;ğenin buraya yazıldığı g&amp;ouml;r&amp;uuml;lebilir. &amp;Ouml;rneğin &lt;strong&gt;PropertyGroup&lt;/strong&gt; elementlerinde &lt;strong&gt;Debug&lt;/strong&gt;, &lt;strong&gt;Debug-Any CPU&lt;/strong&gt; ve &lt;strong&gt;Release-Any CPU&lt;/strong&gt; i&amp;ccedil;in bazı atamalar s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Debug&lt;/strong&gt; ile alakalı &lt;strong&gt;PropertyGroup&lt;/strong&gt;&amp;rsquo; a bakıldığında uygulamanın vereceği &amp;ccedil;ıktının &lt;strong&gt;exe&lt;/strong&gt; olacağı,&lt;strong&gt; .Net&lt;/strong&gt; &lt;strong&gt;Framework 4.5&lt;/strong&gt; platformunu hedef aldığı, &lt;strong&gt;Assembly&lt;/strong&gt; adının &lt;strong&gt;ConsoleApplication33&lt;/strong&gt; olduğu ve buna bağlı olarak da &lt;strong&gt;Root&lt;/strong&gt; &lt;strong&gt;Namespace&amp;rsquo;&lt;/strong&gt; in yine &lt;strong&gt;ConsoleApplication33&lt;/strong&gt; şeklinde set edildiği g&amp;ouml;r&amp;uuml;lebilir. &lt;strong&gt;Condition&lt;/strong&gt; niteliklerinde belirtilen kısımlar, &lt;strong&gt;MSBuild&lt;/strong&gt; uygulamasına bazı kriterlere g&amp;ouml;re nasıl &amp;ccedil;ıktı &amp;uuml;retmesi gerektiğini de s&amp;ouml;ylemektedir. &amp;Ouml;rneğin uygulama &lt;strong&gt;Release&lt;/strong&gt; modda inşa edildiğinde, &amp;ccedil;ıktının&lt;strong&gt; bin\Release&lt;/strong&gt; klas&amp;ouml;r&amp;uuml;ne doğru yapılması gerektiği yine bir &lt;strong&gt;PropertyGroup&lt;/strong&gt; i&amp;ccedil;erisinde ifade edilmiştir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Condition niteliklerinde kullanılan $ notasyonu mutlaka dikkatinizi &amp;ccedil;ekmiştir. Aslında burada $[PropertyName] şeklinde bir kullanım s&amp;ouml;z konusudur. Burada inanılmaz geniş bir esneklik vardır.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin $(registery:Hive\SomeKey\SomeSubKey@Value) gibi bir ifade ile Registery&amp;rsquo; deki bir değeri okuyabilir ve Build i&amp;ccedil;erisinde kullanabiliriz. Ya da $([System.DateTime]::Now.ToString("yyyy.MM.dd")) gibi bir kullanım ile o anki zamanı istediğimiz formatta elde edebiliriz vb&amp;hellip;&lt;/p&gt;
&lt;p&gt;[PropertyName] yerine gelecek MSBuild &amp;ouml;zelliklerinin neler olabileceğini &lt;a href="http://msdn.microsoft.com/en-us/library/ms171458.aspx"&gt;MSDN adresinden&lt;/a&gt; &amp;ouml;ğrenebilirsiniz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;ItemGroup&lt;/strong&gt; elementleri i&amp;ccedil;erisine bakıldığında, uygulamanın referans ettiği diğer &lt;strong&gt;Assembly&amp;rsquo;&lt;/strong&gt; ların adları, &lt;strong&gt;Compile&lt;/strong&gt; işlemi sırasında derlemeye tabi olacak &lt;strong&gt;C#&lt;/strong&gt; dosyaları gibi bilgiler yer almaktadır. &lt;strong&gt;Visual Studio&amp;rsquo;&lt;/strong&gt; nun &amp;uuml;rettiği &lt;strong&gt;XML&lt;/strong&gt; i&amp;ccedil;eriğine bakıldığında, son kısımda yorum satırları i&amp;ccedil;erisine dahil edilmiş &lt;strong&gt;Target&lt;/strong&gt; isimli bir element daha olduğu g&amp;ouml;r&amp;uuml;lmektedir. Bu elementi kullanarak &lt;strong&gt;MSBuild&lt;/strong&gt; i&amp;ccedil;in bazı &lt;strong&gt;Task&amp;rsquo;&lt;/strong&gt; lar tanımlanabilir ve inşa işlemi sırasında devreye girmeleri sağlanabilir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Task&lt;/strong&gt; olarak yapılan tanımlamalar paylaşılabilir ve farklı geliştirme &lt;strong&gt;Build&amp;rsquo;&lt;/strong&gt; larında da kullanılabilir. Bu y&amp;uuml;zden bir yazılım evinin &lt;strong&gt;Build&lt;/strong&gt; işlemlerinde standart olarak ger&amp;ccedil;ekleştirdiği bazı y&amp;uuml;r&amp;uuml;tmeler, &lt;strong&gt;Task&lt;/strong&gt; olarak tanımlanıp ilgili &lt;strong&gt;Build&lt;/strong&gt; paketlerine g&amp;ouml;m&amp;uuml;lebilir. Ayrıca &lt;strong&gt;Task&amp;rsquo;&lt;/strong&gt; lar &lt;strong&gt;Reusable&lt;/strong&gt; &amp;ouml;zelliği taşımaktadır. &lt;em&gt;(&lt;strong&gt;Target&lt;/strong&gt; elementleri genellikle yazıldıkları sırada &amp;ccedil;alışmaktadır. Yani belirli bir sırada icra edilmesi istenen &lt;strong&gt;Task&amp;rsquo;&lt;/strong&gt; lar var ise, &lt;strong&gt;Target&lt;/strong&gt; elementinin buna uygun olacak şekilde kullanılması gerekir)&lt;/em&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Schema yapısı bu kadar basit değildir. Kullanılabilecek t&amp;uuml;m elementler i&amp;ccedil;in &lt;a href="http://msdn.microsoft.com/en-us/library/5dy88c2e.aspx"&gt;MSDN &amp;uuml;zerindeki şu adrese gitmenizi&lt;/a&gt; &amp;ouml;neririm.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;Klavye Başına&lt;/h1&gt;
&lt;p&gt;Yazımızın bu b&amp;ouml;l&amp;uuml;m&amp;uuml;nde basit bir &amp;ouml;rnek geliştirmeye &amp;ccedil;alışıyor olacağız. Amacımız temel seviyede &lt;strong&gt;MSBuild&lt;/strong&gt; aracını kullanmak ve konsepti anlamaya &amp;ccedil;alışmak olacaktır. İlk olarak basit bir &lt;strong&gt;C#&lt;/strong&gt; koduna ihtiyacımız var. Bu ama&amp;ccedil;la &amp;ouml;rneğin &lt;strong&gt;C:\Samples\HowToMSBuild\&lt;/strong&gt; isimli klas&amp;ouml;r altında, aşağıdaki i&amp;ccedil;eriğe sahip bir &lt;strong&gt;C#&lt;/strong&gt; dosyası oluşturduğumuzu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/msbuild_3.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="msbuild_3" src="/pics/msbuild_3_thumb.png" alt="msbuild_3" width="596" height="451" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bu adımdan sonra yine &lt;strong&gt;Notepad2&lt;/strong&gt; aracını kullanarak aşağıdaki i&amp;ccedil;eriğe sahip bir &lt;strong&gt;csproj&lt;/strong&gt; dosyası &amp;uuml;reterek devam edelim.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Project xmlns="http://schemas.microsoft.com/developer/msbuild/2003"&amp;gt; 
  &amp;lt;ItemGroup&amp;gt; 
    &amp;lt;Compile Include="MSBuildHowTo.cs" /&amp;gt; 
  &amp;lt;/ItemGroup&amp;gt; 
  &amp;lt;Target Name="Build"&amp;gt; 
    &amp;lt;Csc Sources="@(Compile)"/&amp;gt;  
  &amp;lt;/Target&amp;gt; 
&amp;lt;/Project&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Project&lt;/strong&gt; i&amp;ccedil;erisinde bir adet &lt;strong&gt;ItemGroup&lt;/strong&gt; ve &lt;strong&gt;Target&lt;/strong&gt; elementi yer almaktadır. &lt;strong&gt;ItemGroup&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &lt;strong&gt;Compile&lt;/strong&gt; elementi, &lt;strong&gt;Include&lt;/strong&gt; &lt;strong&gt;niteliğinde&lt;em&gt;(attribute)&lt;/em&gt;&lt;/strong&gt;, derleme işlemine tabi olacak dosyayı belirtmektedir. &lt;strong&gt;Target&lt;/strong&gt; altındaki &lt;strong&gt;Csc&lt;/strong&gt; elementinin &lt;strong&gt;Sources&lt;/strong&gt; niteliğinde ise &lt;strong&gt;Compile&lt;/strong&gt; isimli bir komut yer almaktadır. Dolayısıyla bu &lt;strong&gt;Task&lt;/strong&gt;, &lt;strong&gt;MSBuild&lt;/strong&gt; aracına, &lt;strong&gt;Compile&lt;/strong&gt; elementine dahil edilen dosyanın derlenmesi gerektiğini s&amp;ouml;ylemektedir.&lt;/p&gt;
&lt;p&gt;Bu i&amp;ccedil;eriği &lt;strong&gt;Builder.csproj&lt;/strong&gt; adı ile kaydettikten sonra ise sıradaki operasyon, &lt;strong&gt;MSBuild&lt;/strong&gt; komut satırı aracını kullanarak inşa işlemini y&amp;uuml;r&amp;uuml;tt&amp;uuml;rmektir. Bunun i&amp;ccedil;in &lt;strong&gt;MSBuild&amp;rsquo;&lt;/strong&gt; u aşağıdaki gibi kullanabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;msbuild Builder.csproj /t: Build /verbosity: detailed&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/msbuild_5.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="msbuild_5" src="/pics/msbuild_5_thumb.png" alt="msbuild_5" width="642" height="698" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &amp;ccedil;alışma sonrasında &lt;strong&gt;MSBuildHowTo&lt;/strong&gt; isimli bir &lt;strong&gt;exe&lt;/strong&gt; dosyası oluşmuştur. S&amp;ouml;z konusu &lt;strong&gt;exe&lt;/strong&gt; dosyasını doğrudan &amp;ccedil;alıştırdığımızda ise, &lt;strong&gt;pre-precessor&lt;/strong&gt; direktifi dışında kalan kod par&amp;ccedil;asının y&amp;uuml;r&amp;uuml;t&amp;uuml;ld&amp;uuml;ğ&amp;uuml; g&amp;ouml;zlemlenecektir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;MSBuild &amp;ouml;zellikle kurulu olan .Net Framework versiyonuna bağlı olaraktan Microsoft.Net\Framework\vX.X.XXXXX altında yer almaktadır. &amp;Ouml;rneğin ben kendi sistemimde aşağıdaki klas&amp;ouml;rde yer alan s&amp;uuml;r&amp;uuml;m&amp;uuml; kullandım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/msbuild_4.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="msbuild_4" src="/pics/msbuild_4_thumb.png" alt="msbuild_4" width="374" height="171" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bunu sistem&amp;rsquo; de Path olarak belirtebiliriz ama dilerseniz doğrudan Visual Studio Command Prompt&amp;rsquo; tan da yararlanabiliriz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;CSPROJ İ&amp;ccedil;eriğini Genişletelim&lt;/h1&gt;
&lt;p&gt;Şimdi &lt;strong&gt;csproj&lt;/strong&gt; dosyasının i&amp;ccedil;eriğini biraz daha genişletelim ve aşağıdaki hale getirelim.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Project xmlns="http://schemas.microsoft.com/developer/msbuild/2003"&amp;gt; 
  &amp;lt;PropertyGroup&amp;gt; 
    &amp;lt;AssemblyName&amp;gt;MSBuildHowTo&amp;lt;/AssemblyName&amp;gt; 
    &amp;lt;OutputPath&amp;gt;Bin\&amp;lt;/OutputPath&amp;gt; 
  &amp;lt;/PropertyGroup&amp;gt; 
  &amp;lt;ItemGroup&amp;gt; 
    &amp;lt;Compile Include="MSBuildHowTo.cs" /&amp;gt; 
  &amp;lt;/ItemGroup&amp;gt; 
  &amp;lt;Target Name="Build"&amp;gt; 
    &amp;lt;MakeDir Directories="$(OutputPath)" Condition="!Exists('$(OutputPath)')" /&amp;gt; 
    &amp;lt;Csc Sources="@(Compile)" OutputAssembly="$(OutputPath)$(AssemblyName).exe" /&amp;gt; 
  &amp;lt;/Target&amp;gt; 
&amp;lt;/Project&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu sefer &lt;strong&gt;PropertyGroup&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt;assembly&lt;/strong&gt; adını&lt;em&gt;&lt;strong&gt;(AssemblyName elementi)&lt;/strong&gt;&lt;/em&gt; ve &lt;strong&gt;build&lt;/strong&gt; işlemi sonrası ortaya &amp;ccedil;ıkacak olan &amp;ccedil;ıktının konuşlandırılacağı klas&amp;ouml;r&amp;uuml; de belirttik&lt;em&gt;&lt;strong&gt;(OutputPath)&lt;/strong&gt;&lt;/em&gt;. Diğer yandan bu &amp;ouml;rneğimizde yer alan en &amp;ouml;nemli kısım &lt;strong&gt;Build &lt;/strong&gt;isimli &lt;strong&gt;Target&lt;/strong&gt; elementinin i&amp;ccedil;eriğidir. Dikkat edilecek olursa ilk sırada &lt;strong&gt;MakeDir&lt;/strong&gt; isimli element yer almaktadır. Burada &lt;strong&gt;$(OutputPath) &lt;/strong&gt;ile &amp;ccedil;ıktının yapılacağı klas&amp;ouml;r işaretlenirken aslında &lt;strong&gt;PropertyGroup&amp;gt;OutputPath &lt;/strong&gt;elementinin i&amp;ccedil;eriği ifade edilmektedir. &amp;Ouml;nemli olan kısım ise &lt;strong&gt;Condition&lt;/strong&gt; niteliğinde yazılan değerdir. &lt;strong&gt;!Exists(&amp;lsquo;$(OutputPath)&amp;rsquo;)&lt;/strong&gt; ifadesi ile şu s&amp;ouml;ylenmektedir. &lt;strong&gt;&amp;ldquo;OutputPath yoksa&amp;hellip;&amp;rdquo;&lt;/strong&gt;. Buna g&amp;ouml;re eğer &lt;strong&gt;Condition&lt;/strong&gt; sağlanırsa, &lt;strong&gt;MakeDir&lt;/strong&gt; &lt;strong&gt;OutputPath&lt;/strong&gt;&amp;rsquo; in oluşturulması gerektiğini belirtecektir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Csc&lt;/strong&gt; elementinde ise derleme işlemi i&amp;ccedil;in kullanılacak olan kaynak &lt;strong&gt;Sources&lt;/strong&gt; elementi ile ifade edilirken, aslında &lt;strong&gt;ItemGroup&lt;/strong&gt; i&amp;ccedil;erisindeki &lt;strong&gt;Compile&lt;/strong&gt; elementinde yer alan &lt;strong&gt;Include&lt;/strong&gt; niteliğinin değeri işaret edilmektedir. &lt;strong&gt;OutputAssembly&lt;/strong&gt; niteliğine atanan değer ise, &lt;strong&gt;OutputhPath&lt;/strong&gt; &amp;ouml;zelliğinin belirttiği klas&amp;ouml;r&amp;uuml;n altına &lt;strong&gt;AssemblyName&amp;rsquo;&lt;/strong&gt; in işaret ettiği isimle bir &lt;strong&gt;exe&lt;/strong&gt; &amp;uuml;retilmesi gerektiğini belirtmektedir. Buna g&amp;ouml;re komut satırından yapılan &lt;strong&gt;MSBuild&lt;/strong&gt; &amp;ccedil;ağrısı sonucu aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;msbuild Builder.csproj /t: Build /verbosity: detailed&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/msbuild_6.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="msbuild_6" src="/pics/msbuild_6_thumb.png" alt="msbuild_6" width="639" height="782" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Olduk&amp;ccedil;a zevkli &amp;ouml;yle değil mi? &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_91.png" alt="Smile" /&gt;&lt;/p&gt;
&lt;h1&gt;Target Belirtmek&lt;/h1&gt;
&lt;p&gt;&amp;Ouml;yleyse gelin olayı biraz daha genişleterek devam edelim.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Project DefaultTargets="Build" xmlns=" http://schemas.microsoft.com/developer/msbuild/2003"&amp;gt; 
  &amp;lt;PropertyGroup&amp;gt; 
    &amp;lt;AssemblyName&amp;gt;MSBuildHowTo&amp;lt;/AssemblyName&amp;gt; 
    &amp;lt;OutputPath&amp;gt;Bin\&amp;lt;/OutputPath&amp;gt; 
  &amp;lt;/PropertyGroup&amp;gt; 
  &amp;lt;ItemGroup&amp;gt; 
    &amp;lt;Compile Include="MSBuildHowTo.cs" /&amp;gt; 
  &amp;lt;/ItemGroup&amp;gt; 
  &amp;lt;Target Name="Build"&amp;gt; 
    &amp;lt;MakeDir Directories="$(OutputPath)" Condition="!Exists('$(OutputPath)')" /&amp;gt; 
    &amp;lt;Csc Sources="@(Compile)" OutputAssembly="$(OutputPath)$(AssemblyName).exe" /&amp;gt; 
  &amp;lt;/Target&amp;gt; 
  &amp;lt;Target Name="Clean" &amp;gt; 
    &amp;lt;Delete Files="$(OutputPath)$(AssemblyName).exe" /&amp;gt; 
  &amp;lt;/Target&amp;gt; 
  &amp;lt;Target Name="Rebuild" DependsOnTargets="Clean;Build" /&amp;gt; 
&amp;lt;/Project&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu seferki &amp;ccedil;alışmada &lt;strong&gt;3 adet&lt;/strong&gt; &lt;strong&gt;Target&lt;/strong&gt; elementi s&amp;ouml;z konusudur. Ancak her birinin &lt;strong&gt;Name&lt;/strong&gt; niteliğinin değerleri farklıdır. Buna g&amp;ouml;re, &lt;strong&gt;Build, Clean&lt;/strong&gt; ve &lt;strong&gt;Rebuild&lt;/strong&gt; isimli &lt;strong&gt;Target&amp;rsquo;&lt;/strong&gt; lar olduğunu ve aslında bunların &lt;strong&gt;3 ayrı Task&lt;/strong&gt;&amp;rsquo; ı ifade ettiğini d&amp;uuml;ş&amp;uuml;nebiliriz. Yani &lt;strong&gt;MSBuild&lt;/strong&gt; aracını kullanırken &lt;strong&gt;/t: [TargetNameValue]&lt;/strong&gt; şeklinde bir yaklaşım ile, istediğimiz &lt;strong&gt;Target&amp;rsquo;&lt;/strong&gt; ın y&amp;uuml;r&amp;uuml;t&amp;uuml;lmesini sağlayabiliriz. S&amp;ouml;z gelimi;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;msbuild Builder.csproj /t: Clean /verbosity: detailed&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;şeklinde yapılan &amp;ccedil;ağrı sonucunda, proje dosyasındaki &lt;strong&gt;Target&lt;/strong&gt; elementlerinden &lt;strong&gt;Clean&lt;/strong&gt; isimli olanı &amp;ccedil;alıştırılacaktır. Bu elementte ise &lt;strong&gt;Delete&lt;/strong&gt; isimli bir alt element yer almakta olup &lt;strong&gt;Files&lt;/strong&gt; niteliğinde belirtilen kritere g&amp;ouml;re, &lt;strong&gt;Bin&lt;/strong&gt; klas&amp;ouml;re altında &lt;strong&gt;assembly&lt;/strong&gt; adı ile duran &lt;strong&gt;exe&lt;/strong&gt; dosyasının silinmesi gerektiği ifade edilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/msbuild_7.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="msbuild_7" src="/pics/msbuild_7_thumb.png" alt="msbuild_7" width="638" height="547" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Eğer &lt;strong&gt;Rebuild&lt;/strong&gt; takısını kullanırsak bu durumda &lt;strong&gt;Target-&amp;gt;Name&lt;/strong&gt; niteliği &lt;strong&gt;Rebuild&lt;/strong&gt; olan b&amp;ouml;l&amp;uuml;m devreye girecektir. Bu vakada dikkat edilmesi gereken ise &lt;strong&gt;DependsOnTargets&lt;/strong&gt; niteliği i&amp;ccedil;erisinde yazılan &lt;strong&gt;Clean;Build&lt;/strong&gt; ifadesidir. Yani şunu ifade etmiş oluruz;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Ey MSBuild!&amp;hellip;&amp;Ouml;nce Clean isimli Target, sonrasında ise Build isimli Target i&amp;ccedil;eriğini icra et&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;ki bu durumda &lt;strong&gt;Bin&lt;/strong&gt; klas&amp;ouml;r&amp;uuml; i&amp;ccedil;eriği silinecek ve tekrardan bir derleme işlemi yapılarak, orada ilgili &lt;strong&gt;exe&lt;/strong&gt; &amp;ccedil;ıktısının &amp;uuml;retilmesi sağlanacaktır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;msbuild Builder.csproj /t: Rebuild /verbosity: detailed&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/msbuild_8.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="msbuild_8" src="/pics/msbuild_8_thumb.png" alt="msbuild_8" width="638" height="785" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekler daha da &amp;ccedil;oğaltılabilir. Yapılabilecek pek &amp;ccedil;ok şey var &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_189.png" alt="Winking smile" /&gt; Bunun i&amp;ccedil;in mutlaka &lt;strong&gt;MSDN&lt;/strong&gt; orjinli&amp;nbsp; bir kaynağa başvurmanızı veya yazımızın sonunda belirttiğimiz tarzdaki bir kitabı tedarik etmenizi &amp;ouml;neririm. Ancak temel mantığı ifade edebildiğimizi varsayıyorum. Bundan sonrasında &lt;strong&gt;Condition&amp;rsquo;&lt;/strong&gt; lara ve kullanılabilecek &lt;strong&gt;element/attribute&lt;/strong&gt; tiplerine bakılması yeterli olur d&amp;uuml;ş&amp;uuml;ncesindeyim.&lt;/p&gt;
&lt;h1&gt;.Net Framework 4.5 ile Gelen Yenilikler&lt;/h1&gt;
&lt;p&gt;&lt;strong&gt;MSBuild&lt;/strong&gt; &amp;uuml;r&amp;uuml;n&amp;uuml;ne &lt;strong&gt;Framework 4.5&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml; ile birlikte bazı geliştirmeler ve yeni &amp;ouml;zellikler de katılmıştır. Hen&amp;uuml;z inceleme fırsatı bulamadığım bu &amp;ouml;zellikleri aşağıdaki maddeler ile &amp;ouml;zetleyebiliriz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;ARM&lt;em&gt;(Advanced RISC Machine)&lt;/em&gt;&lt;/strong&gt; desteği gelmiştir. Yani &lt;strong&gt;Build&lt;/strong&gt; &amp;ccedil;ıktıları &lt;strong&gt;ARM&lt;/strong&gt; işlemcilerini hedef alacak şekilde &amp;uuml;retilebilir.&lt;/li&gt;
&lt;li&gt;Bir &lt;strong&gt;Task&lt;/strong&gt;&lt;em&gt; (Target elementi ile belirtilen bir g&amp;ouml;rev diyelim)&lt;/em&gt; s&amp;uuml;re&amp;ccedil; dışı&lt;em&gt;&lt;strong&gt;(Out of Process)&lt;/strong&gt;&lt;/em&gt; modda &amp;ccedil;alışmaya zorlanabilir.&lt;/li&gt;
&lt;li&gt;Yeni bazı &lt;strong&gt;XML&lt;/strong&gt; &lt;strong&gt;element&lt;/strong&gt; ve &lt;strong&gt;nitelikleri&lt;em&gt;(Attributes)&lt;/em&gt;&lt;/strong&gt; gelmiştir.&lt;/li&gt;
&lt;li&gt;Klasik bir c&amp;uuml;mle olacak ama, &lt;strong&gt;Performans&lt;em&gt;(Performance)&lt;/em&gt;&lt;/strong&gt; ve &lt;strong&gt;&amp;Ouml;l&amp;ccedil;eklendirme&lt;em&gt;(Scabilitiy)&lt;/em&gt;&lt;/strong&gt; noktasında iyileştirmeler vardır &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_91.png" alt="Smile" /&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;MSBuild&amp;rsquo; un etkili kullanımı &amp;uuml;zerine geliştirilmiş bazı ara&amp;ccedil;lar da vardır. G&amp;ouml;rsel arabirimleri olan bu ara&amp;ccedil;lar yardımıyla MSBuild akışlarını daha kolay y&amp;ouml;netebiliriz. Attrice firmasının bu alanda &amp;ouml;n plana &amp;ccedil;ıkan &lt;a href="http://www.attrice.info/msbuild/index.htm"&gt;Microsoft Build Sidekick&lt;/a&gt; isimli &amp;uuml;r&amp;uuml;n&amp;uuml; gibi.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;&amp;Ouml;neri Kitap&lt;/h1&gt;
&lt;p&gt;&lt;a href="/pics/msbuild_1.jpg"&gt;&lt;img style="float: left; margin: 4px 0px; display: inline;" title="msbuild_1" src="/pics/msbuild_1_thumb.jpg" alt="msbuild_1" width="129" height="160" align="left" /&gt;&lt;/a&gt;&lt;strong&gt;Microsoft&lt;/strong&gt;&amp;rsquo; un &lt;strong&gt;Visual Studio&lt;/strong&gt; ailesi ve geliştirme platformu olduk&amp;ccedil;a geniş bir alana yayılmakta olup, pek &amp;ccedil;ok notkasında uzmanlık gerektiren yapılar i&amp;ccedil;ermektedir. Bu sebepten s&amp;ouml;z konusu yapılara y&amp;ouml;nelik pek &amp;ccedil;ok yayın da&lt;em&gt;(kitap, official site, blog vb) &lt;/em&gt;mevcuttur.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin &lt;strong&gt;MSBuild&lt;/strong&gt; tarafında daha &amp;ouml;nceden yayınlanmış olan &lt;strong&gt;Inside The Microsoft Build Engine&lt;/strong&gt; isimli kitabın &lt;strong&gt;Nisan &lt;/strong&gt;ayı i&amp;ccedil;erisinde yayınlanan yeni bir tamamlayıcı baskısı mevcuttur. Yaklaşık olarak 120 sayfalık bir kitap olmasına rağmen odaklandığı konu &amp;ouml;z&amp;uuml;nde &lt;strong&gt;MSBuild &lt;/strong&gt;&amp;uuml;r&amp;uuml;n&amp;uuml;d&amp;uuml;r. Kitaba &lt;a href="http://www.amazon.com/Supplement-Inside-Microsoft%C2%AE-Build-Engine/dp/0735678162/ref=sr_1_1?s=books&amp;amp;ie=UTF8&amp;amp;qid=1361775657&amp;amp;sr=1-1&amp;amp;keywords=msbuild"&gt;Amazon &amp;uuml;zerinden bu adres yardımıyla&lt;/a&gt; erişebilirsiniz.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Bu yazımızda kısada olsa, &lt;strong&gt;MSBuild&lt;/strong&gt; platformunu ve &lt;strong&gt;XML&lt;/strong&gt; tarafındaki &lt;strong&gt;betikleri&lt;em&gt;(Scripts)&lt;/em&gt;&lt;/strong&gt; anlamaya &amp;ccedil;alıştık. Ağırlıklı olarak bir inşa s&amp;uuml;recine m&amp;uuml;dahale edebildiğimizi, bunun i&amp;ccedil;in platformun sunduğu bazı standart element ve niteliklerin olduğunu g&amp;ouml;rd&amp;uuml;k. Devamı sizde artık &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_91.png" alt="Smile" /&gt; Bir başka yazımızda g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;span style="color: #ff0000;"&gt;[Orjinal Yazım Tarihi &amp;ndash; 25/02/2013]&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://blogs.msdn.com/b/visualstudio/archive/2013/07/24/msbuild-is-now-part-of-visual-studio.aspx" target="_blank"&gt;&lt;span style="color: #ff0000;"&gt;[G&amp;uuml;ncel bilgi &amp;ndash;&amp;gt; MS Build is now part of Visual Studio!]&lt;/span&gt;&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2013-08-01 07:47:00</pubDate>
  <slug>Nedir-Bu-MSBuild</slug>
  <tags>
    <tag>microsoft-build-engine</tag>
    <tag>build</tag>
    <tag>compile</tag>
    <tag>xml</tag>
    <tag>project-file</tag>
    <tag>command-prompt</tag>
    <tag>visual-studio</tag>
    <tag>platform</tag>
    <tag>team-foundation-build</tag>
    <tag>build-server</tag>
    <tag>build-service</tag>
    <tag>c#</tag>
    <tag>c#-project</tag>
    <tag>project-properties</tag>
  </tags>
  <categories>
    <category>.Net Framework 4.0</category>
    <category>.Net Framework 4.5</category>
    <category>Visual Studio</category>
  </categories>
</post>