<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Adım Adım State Machine Workflow Geliştirmek</title>
  <description>Öyle iş akışları vardırki, süreç(Process) içerisinde yer alan adımlar arasındaki geçişler herhangibir zamanda ve herhangibir olayın meydana gelmesi sonrasında mümkün olur. Çoğunlukla terminolojide Sonlu Durum Makinesi(Finite State Machine) olarak geçen bu yaklaşıma göre, herhangibir nesnel varlığın zaman içerisinde sahip olabileceği durumlar işaret edilmektedir. Çok doğal olarak bu durum, programatik ortamda yer alan iş problemlerinin çözümündede göz önüne alınmaktadır. İşte bu makalemizde Sonlu Durum Makinesi(Finite State Machine) kavramını irdelemeye ve Windows Workflow Foundation içerisindeki kullanımını araştırmaya çalışacağız. Başlamadan önce Sonlu Durum Makinesi(Finite State Machine) kavramını anlamaya çalışamakta yarar vardır.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;&amp;Ouml;yle iş akışları vardırki, &lt;strong&gt;s&amp;uuml;re&amp;ccedil;(Process)&lt;/strong&gt; i&amp;ccedil;erisinde yer alan adımlar arasındaki ge&amp;ccedil;işler herhangibir zamanda ve herhangibir olayın meydana gelmesi sonrasında m&amp;uuml;mk&amp;uuml;n olur. &amp;Ccedil;oğunlukla terminolojide &lt;strong&gt;Sonlu Durum Makinesi(Finite State Machine)&lt;/strong&gt; olarak ge&amp;ccedil;en bu yaklaşıma g&amp;ouml;re, herhangibir nesnel varlığın zaman i&amp;ccedil;erisinde sahip olabileceği durumlar işaret edilmektedir. &amp;Ccedil;ok doğal olarak bu durum, programatik ortamda yer alan iş problemlerinin &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;ndede g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınmaktadır. İşte bu makalemizde &lt;strong&gt;Sonlu Durum Makinesi(Finite State Machine)&lt;/strong&gt; kavramını irdelemeye ve &lt;strong&gt;Windows Workflow Foundation&lt;/strong&gt; i&amp;ccedil;erisindeki kullanımını araştırmaya &amp;ccedil;alışacağız. Başlamadan &amp;ouml;nce Sonlu Durum Makinesi(Finite State Machine) kavramını anlamaya &amp;ccedil;alışamakta yarar vardır.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikli olarak sonlu kelimesinin kullanılmasının sebebi s&amp;ouml;z konusu nesnel varlığın sahip olabileceği &lt;strong&gt;durumların(State)&lt;/strong&gt; sayılı olmasıdır. Bir başka deyişle bu yaklaşıma g&amp;ouml;re bir makinenin sahip olabileceği durumların sayısı bellidir. Diğer taraftan makinenin zaman i&amp;ccedil;erisinde sahip olabileceği haller onun durumlarını(States) ifade etmektedir. Makine doğal olarak bu durumlara sahip olan nesnel yapıyı temsil etmektedir. &lt;strong&gt;Sonlu durum makinelerinde(Finite State Machine)&lt;/strong&gt; durumlar arasındaki ge&amp;ccedil;işler bir aksiyon sonucu ger&amp;ccedil;ekleşir.&lt;/p&gt;
&lt;p&gt;Tahmin edileceği &amp;uuml;zere s&amp;ouml;z konusu aksiyonlar &amp;ccedil;oğunlukla bir olaydır ve genellikle insan etkileşimi sonrası ger&amp;ccedil;ekleşmektedir. Ne varki burada insan etkileşimi sonucu olay tetiklenmesi zorunluluk değildir. İnsan etkileşimi olması nedeniyle, olaylar herhangibir zaman dilimi i&amp;ccedil;erisinde meydana gelebilir. Bu tip vakalara m&amp;uuml;hendislik eğitimlerinde verilmekte olan iki basit &amp;ouml;rnek vardır. Hepimizin yakından tanıdığı, metro istasyonlarında, duraklarda, okullarda veya bazı kafelerde g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z otomat makineleri ile herkese a&amp;ccedil;ık olan &amp;ccedil;amaşırhanelerde yer alan ve jeton ile &amp;ccedil;alışan yıkama makineleri bu iki &amp;ouml;rneği oluşturmaktadır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Finite State Machine' lerde insan ile olan etkileşim &amp;ouml;n planda olup, durumlar(States) arası ge&amp;ccedil;işler &amp;ccedil;oğunlukla insanlar tarafından tetiklenen olaylara(Events) bağlıdır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;Otomat&lt;/strong&gt; makinesinin kendisi g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında zaman i&amp;ccedil;erisinde sahip olabileceği bazı &lt;strong&gt;durumlar(State) &lt;/strong&gt;vardır. &amp;Ouml;rneğin makine &amp;ccedil;alışmıyordur, &amp;ccedil;alışıyordur, para veya jeton bekliyordur, se&amp;ccedil;ilen &amp;uuml;r&amp;uuml;n&amp;uuml; veriyordur yada tadilattadır. Burada bahsedilen hallerin tamamı birer &lt;strong&gt;durum(State)&lt;/strong&gt; olarak irdelenir. Bu durumlar arasındaki ge&amp;ccedil;işler i&amp;ccedil;in &amp;ccedil;oğunlukla makinenin bazı ara&amp;ccedil;ları insanlar tarafından kullanılır. Dikkat edilecek olursa makine zaman i&amp;ccedil;erisinde herhangibir anda herhangibir durumuna ge&amp;ccedil;ebilir. Tabiki bazı durumlara ge&amp;ccedil;işler sırasında bazı koşulların sağlanması gerekebilir. Benzer senaryo yıkama makinesi &amp;ouml;rneği i&amp;ccedil;inde ge&amp;ccedil;erlidir. &lt;em&gt;(İlerlemeden &amp;ouml;nce para veya jeton ile &amp;ccedil;alışan bir &amp;ccedil;amaşır makinesinin zaman i&amp;ccedil;inde sahip olabileceği durumları ve bu durumlar arasındaki ge&amp;ccedil;işler i&amp;ccedil;in gereken olayların neler olabileceğini kağıt &amp;uuml;zerinde tasarlamaya &amp;ccedil;alışmanızı &amp;ouml;neririm.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Finite State Machine&lt;/strong&gt;' ler otomat, &amp;ccedil;amaşır makinesi gibi ger&amp;ccedil;ek hayat &amp;ouml;rnekleri dışında &amp;uuml;retim hattında yer alan sanayi makinelerinin otomasyon s&amp;uuml;re&amp;ccedil;lerinde, oyun programlamada yer alan karakterlerin zaman i&amp;ccedil;erisindeki hareket dağılımlarında, &lt;strong&gt;transaction&lt;/strong&gt; i&amp;ccedil;erisinde &amp;ccedil;alışan bir para aktarma veya kredilendirme s&amp;uuml;recinde ve benzer senaryolarda g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Modelin b&amp;ouml;ylesine pop&amp;uuml;ler olması, &amp;ouml;zellikler programatik ortamlarda kolay bir şekile anlaşılabilmelerini sağlamak amacıyla &lt;strong&gt;UML&lt;/strong&gt; formasyonunda da ifade edilmesini gerektirmiştir. S&amp;ouml;z gelimi aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde otomat makinesinin Finite State Machine diagramı yer almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_1.gif" alt="" width="489" height="521" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Normal şartlarda bu diagramlarda ekranda g&amp;ouml;r&amp;uuml;len kırmızı baloncuklar elbetteki yer almaz. Herşeyden &amp;ouml;nce Finite State Machine i&amp;ccedil;erisinde yer alan makinenin mutlaka bir &lt;strong&gt;başlangı&amp;ccedil; durumu(Initial State)&lt;/strong&gt; ve &lt;strong&gt;son durumu(Finalization State veya Terminal State&lt;/strong&gt; olarak adlandırılır- i&amp;ccedil; i&amp;ccedil;e iki yuvarlağın olduğu par&amp;ccedil;a ile ifade edilir) vardır. Başlangı&amp;ccedil; durumunda makinenin ilk konumdaki hali g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınır. Son durumda ise makinenin var olan durumlar sona erdikten sonraki hali ele alınmaktadır. Şekilde başlangı&amp;ccedil; durumundan, Para Bekleniyor isimli duruma ge&amp;ccedil;iş yapılabilmektedir. Bu ge&amp;ccedil;iş i&amp;ccedil;in gereken, makineyi kullanan kişinin para atmasıdır. Para Bekleniyor durumuda, para yeterli oluncaya kadar kendisine ge&amp;ccedil;iş yapılmasına sağlayacak şekilde bir olaya sahiptir. Para yeterli olduktan sonra ise &amp;Uuml;r&amp;uuml;n Se&amp;ccedil;imi Bekleniyor isimli duruma ge&amp;ccedil;iş yapılabilir. Burada ise kişi &amp;uuml;r&amp;uuml;n&amp;uuml; se&amp;ccedil;mekte ve sonrasında makine se&amp;ccedil;ilen &amp;uuml;r&amp;uuml;n&amp;uuml; hazırlayarak Bitiş durumuna girmektedir. Bu senaryoda pek &amp;ccedil;ok durum g&amp;ouml;z ardı edilmiştir. &amp;Ouml;rneğin se&amp;ccedil;im yapıldıktan sonra makinenin arıza yapıp &amp;uuml;r&amp;uuml;n&amp;uuml; vermemesi halinde girilecek durum veya para &amp;uuml;st&amp;uuml; verme durumları gibi.&lt;/p&gt;
&lt;p&gt;Hemen ikinci bir &amp;ouml;rnek ile devam edelim. S&amp;ouml;z gelimi bir &lt;strong&gt;Windows&lt;/strong&gt; uygulaması &amp;uuml;zerinden kontrol edilen uzaktan kumandalı bir otomobilin sahip olabileceği durumlara ait bir &lt;strong&gt;Finite State Machine&lt;/strong&gt; diagramı s&amp;ouml;z konusu olabilir. Bu diagram aşağıdakine benzer bir şekilde ele alınabilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_2.gif" alt="" width="593" height="482" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada otomobilin kendisi programatik ortamda bir nesne ile ifade edilebilir. &lt;strong&gt;Durumlar(States)&lt;/strong&gt; arasındaki ge&amp;ccedil;işleri sağlayan ise &lt;strong&gt;Windows&lt;/strong&gt; uygulamasından tetiklenen nesne &lt;strong&gt;olayları(Events)&lt;/strong&gt; olabilir. Arabanın şekle g&amp;ouml;re sahip olabileceği durumlar belirlidir. Bu durumlarda s&amp;ouml;z konusu olabilecek olaylarda aynı şekilde belirli ve sayılıdır. Bir durumdan başka bir durumua ge&amp;ccedil;iş veya ge&amp;ccedil;işlerde birden fazla sayıda olay s&amp;ouml;z konusu olabilir. S&amp;ouml;z gelimi Motor &amp;Ccedil;alışıyor durumundayken, &lt;strong&gt;OnIlerle&lt;/strong&gt;, &lt;strong&gt;OnMotoruDurdur&lt;/strong&gt; veya &lt;strong&gt;OnGeriGit&lt;/strong&gt; gibi olaylar tetiklenerek &amp;uuml;&amp;ccedil; farklı duruma ge&amp;ccedil;iş yapılması sağlanabilir. Buda bize durumlar arasındaki ge&amp;ccedil;işlerde birden fazla olayın s&amp;ouml;z konusu olabileceğini g&amp;ouml;stermektedir. Hatta bazı noktalarda ortak olaylarda s&amp;ouml;z konusudur. &amp;Ouml;rneğin araba ileri veya geri giderken &lt;strong&gt;OnDur&lt;/strong&gt; olayı tetiklenerek durması sağlanabilir. OnDur olay hem Geri Gidiyor hemde Ilerliyor &lt;strong&gt;durumları(States)&lt;/strong&gt; i&amp;ccedil;in ge&amp;ccedil;erli ortak bir olaydır.&lt;/p&gt;
&lt;p&gt;Sanıyorumki buraya kadar anlatılanlar sayesinde &lt;strong&gt;Finite State Machine&lt;/strong&gt; yaklaşımı hakkında biraz fikir sahibi olunmuştur. Bundan sonraki kısımlarımızda ise &lt;strong&gt;.Net Framework 3.0&lt;/strong&gt; ile gelen &lt;strong&gt;Windows Workflow Foundation &lt;/strong&gt;a&amp;ccedil;ısından &lt;strong&gt;Finite State Machine&lt;/strong&gt; modeline bakıyor olacağız. Nitekim s&amp;ouml;z konusu model ger&amp;ccedil;ek hayat &amp;ouml;rneklerine benzer olacak şekilde programatik ortamdaki nesnel yapılar i&amp;ccedil;inde s&amp;ouml;z konusu olabilmektedir. Bu noktada WWF bize kolaylaştırıcı bir yaklaşım sunmakta ve State Machine tarzı iş s&amp;uuml;re&amp;ccedil;lerinin .Net uygulamalarında rahat&amp;ccedil;a ele alınabilmelerine olanak tanımaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Windows Workflow Foundation(WWF) &lt;/strong&gt;iki temel iş akışı modelini ele alır. &lt;strong&gt;Sequential Workflows &lt;/strong&gt;ve &lt;strong&gt;State Machine Workflows&lt;/strong&gt;. Daha &amp;ouml;ncedende bahsedildiği gibi Sequential Workflows tipinden olan iş akışlarında adımlar yada aktiviteler arasındaki ge&amp;ccedil;işlerin nasıl ve ne zaman olacağı bellidir. Hatta bu ge&amp;ccedil;işler sırasında koşulların kullanılması &amp;ccedil;ok sık rastlanan bir durumdur. Stata Machine Workflow tipindeki iş akışlarında ise daha &amp;ouml;ncedende değinildiği gibi adımlar veya durumlar arasındaki ge&amp;ccedil;işler dış olayların tetiklenmesine bağlıdır. State Machine Workflow akışlarından, aktivitenin kendisi &lt;strong&gt;StateMachineWorkflowActivity&lt;/strong&gt; sınıfından &amp;ouml;rneklenmektedir. &lt;em&gt;(Workflow mimarisindeki herşeyin birer &lt;strong&gt;aktivite(Activity)&lt;/strong&gt; tipi olduğunu hatırlayalım)&lt;/em&gt; &lt;strong&gt;StateMachineWorkflowActivity&lt;/strong&gt; tipinin .&lt;strong&gt;Net&lt;/strong&gt; i&amp;ccedil;erisindeki yerine bakıldığında aşağıdaki &lt;strong&gt;sınıf diagramında(Class Diagram)&lt;/strong&gt; yer alan hiyerarşide olduğu g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_6.gif" alt="" width="603" height="497" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;StateMachineWorkflowActivite&lt;/strong&gt; sınıfıda eninde sonunda bir &lt;strong&gt;Activity&lt;/strong&gt; tipidir. Kendi i&amp;ccedil;erisinde tanımlanmış olan &amp;uuml;yelerden bir ka&amp;ccedil;ını a&amp;ccedil;ıklayarak devam edelim. &lt;strong&gt;CompletedStateName&lt;/strong&gt; &amp;ouml;zelliği ile, &lt;strong&gt;bitiş durumu(Finalization State)&lt;/strong&gt; ifade edilir. Bu &amp;ouml;zellik &amp;ouml;nemlidir nitekim &lt;strong&gt;Workflow&lt;/strong&gt;' un hangi durumdan sonra sonlanacağını belirtmektedir. Ancak yazılmadığı vakalarda vardır. Benzer şekilde &lt;strong&gt;InitialStateName&lt;/strong&gt; &amp;ouml;zelliği başlangı&amp;ccedil;taki durum aktivitesini işaret etmektedir. &amp;Ccedil;alışma zamanında istenirse o anda makinenin bulunduğu durum adı &lt;strong&gt;CurrentStateName&lt;/strong&gt; &amp;ouml;zelliği ile elde edilebilir. Benzer şekilde &lt;strong&gt;PreviousStateName&lt;/strong&gt; &amp;ouml;zelliği ile o anda bulunulan durumdan bir &amp;ouml;nceki durum adı elde edilebilir ki bu hangi durumdan gelindiğini &amp;ouml;ğrenmek i&amp;ccedil;in kullanılabilir. Buradaki &amp;ouml;rnek &lt;strong&gt;&amp;ouml;zellikler(Properties)&lt;/strong&gt; dışında &amp;uuml;st sınıflardan gelen pek &amp;ccedil;ok &lt;strong&gt;&amp;uuml;ye(Member)&lt;/strong&gt; yer almaktadır. Amacımız şu an i&amp;ccedil;in bu tipin t&amp;uuml;m &amp;uuml;yelerini &amp;ouml;ğrenmek değildir. Bunun yanında bir &lt;strong&gt;StateMachineWorkflowActivity&lt;/strong&gt; tasarlanırken i&amp;ccedil;erisinde &amp;ccedil;oğunlukla aşağıdaki şekilde yer alan tipler kullanılır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_3.gif" alt="" width="366" height="491" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada belkide en kritik ve değerli tip &lt;strong&gt;StateActivity&lt;/strong&gt; sınıfıdır. StateActivity, aslında makinenin i&amp;ccedil;erisinde bulunacağı durumları işaret etmektedir. &amp;Ccedil;ok doğal olarak bir StateActivity i&amp;ccedil;erisinde &lt;strong&gt;StateInitializationActivity&lt;/strong&gt; yada &lt;strong&gt;StateFinalizationActivity&lt;/strong&gt; tanımlanabilir. Ancak bir StateActivity i&amp;ccedil;erisinde bunlardan sadece bir tane bulunabilir. &amp;Ouml;te yandan StateActivity i&amp;ccedil;erisinde, &lt;strong&gt;StateInitializationActivity&lt;/strong&gt; veya &lt;strong&gt;StateFinalizationActivity&lt;/strong&gt; tiplerinin tanımlanması zorunlu değildir. Bunlar opsiyonel olarak ele alınmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Durumlar(States)&lt;/strong&gt; arasındaki ge&amp;ccedil;işler i&amp;ccedil;in &lt;strong&gt;EventDrivenActivity&lt;/strong&gt; tipi kullanılmaktadır. StateActivity i&amp;ccedil;erisinde birden fazla &lt;strong&gt;EventDrivenActivity&lt;/strong&gt; nesnesi tanımlanabilir. Nitekim daha &amp;ouml;ncedende bahsettiğimiz gibi, bir durumda(State) s&amp;ouml;z konu olabilecek birden fazla &lt;strong&gt;olay(Event)&lt;/strong&gt; olabilir. Her EventDrivenActivity mutlaka olayları alabilecek bir aktivite tipi i&amp;ccedil;erir. Bunu sağlayan &lt;strong&gt;HandleExternalEventActivity&lt;/strong&gt; tipidir. S&amp;ouml;z konusu aktivite tipini takiben herhangibir başka aktivitede gelebilir. &amp;Ouml;rneğin bir olayın tetiklenmesinin ardından host uygulama &amp;uuml;zerinden &amp;ccedil;ağırılabilecek harici metodların ele alınması, kod işletilmesi gibi işlemler yapılabilmektedir. Şekilde dikkat edileceği &amp;uuml;zere &lt;strong&gt;EventDrivenActivity&lt;/strong&gt; i&amp;ccedil;erisinde son olarak &lt;strong&gt;SetStateActivity&lt;/strong&gt; kullanılmaktadır. Bu tip sayesinde bulunulan durumdan diğer bir duruma ge&amp;ccedil;ilmesi sağlanmaktadır.&lt;/p&gt;
&lt;p&gt;Şekilde dikkat edilmesi gereken noktalardan biriside &lt;strong&gt;StateActivity&lt;/strong&gt; tipleri dışında ve &lt;strong&gt;StateMachineWorkflowActivity&lt;/strong&gt; i&amp;ccedil;erisinde kalan alanda &lt;strong&gt;EventDrivenActivity&lt;/strong&gt; bileşenlerinin tanımlanabilmesidir. Bazı hallerde durumlar(States) arasındaki ge&amp;ccedil;işlerde kullanılmayan olaylar(Events) s&amp;ouml;z konusu olabilir. S&amp;ouml;z gelimi otomobilin selekt&amp;ouml;r yapması herhangibir anda herhangibir duruma ge&amp;ccedil;iş yapılmasını gerektirmeyecek bir vaka olarak ele alınır. Bu sebepten bu vakaya ilişkin olayı ele alacak &lt;strong&gt;EventDrivenActivity&lt;/strong&gt; nesnesinin bir &lt;strong&gt;StateActivity&lt;/strong&gt; i&amp;ccedil;erisinde tanımlanmasına da gerek yoktur.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bazı durumlarda &lt;strong&gt;StateActivity&lt;/strong&gt; bileşenleri kendi i&amp;ccedil;lerindede birden fazla &lt;strong&gt;StateActivity&lt;/strong&gt; i&amp;ccedil;erebilir. Bu genellikle i&amp;ccedil;erideki aktivitelerin aynı olayları ele aldığı durumlarda s&amp;ouml;z konusudur. Bu tip aktiviteler &lt;strong&gt;Recursive Compositon Activities&lt;/strong&gt; olarakda adlandırılmaktadır. Aşağıda şekilde bu durum ele alınmaya &amp;ccedil;alışılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_4.gif" alt="" width="489" height="497" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada her iki &lt;strong&gt;StateActivity&lt;/strong&gt; tipi i&amp;ccedil;erisinde yer alan &lt;strong&gt;HandleExternalEventActivity&lt;/strong&gt; nesneleri aynı olay ile ilgilenmektedir. B&amp;ouml;yle bir durumda s&amp;ouml;z konusu &lt;strong&gt;StateActivity&lt;/strong&gt; aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibide tasarlanabilir. &lt;em&gt;(Otomobil &amp;ouml;rneği g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında Geri gitme veya ileri gitme durumları i&amp;ccedil;erisinden Durma durumuna ge&amp;ccedil;ilmesi i&amp;ccedil;in aynı olaylar ele alınmaktadır.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_5.gif" alt="" width="512" height="288" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;StateActivity1&lt;/strong&gt; ve &lt;strong&gt;StateActivity2&lt;/strong&gt; nesne &amp;ouml;rnekleri genel bir &lt;strong&gt;StateActivity&lt;/strong&gt; nesnesi i&amp;ccedil;erisine alınmıştır. Bununla birlikte her ikisinin &lt;strong&gt;EventDrivenActivity&lt;/strong&gt; nesneleri dışarı alınarak tek bir noktada toplanmıştır. Nitekim her iki alt aktivitede aynı &lt;strong&gt;EventDrivenActivity&lt;/strong&gt; nesnelerini ele almaktadır.&lt;/p&gt;
&lt;p&gt;Bu kadar teorik bilgiden sonra bir &amp;ouml;rnek yaparak devam etmekte yarar vardır. Makale yazılmadan &amp;ouml;nce yapılmış olan araştırmalarda &lt;strong&gt;Microsoft&lt;/strong&gt;' un &lt;strong&gt;Otomat&lt;/strong&gt; makinesi &amp;ouml;rneğini kullandığı, &lt;strong&gt;APress&lt;/strong&gt;' in ise bir arabanın durumlarını ele aldığı g&amp;ouml;zlenmiştir. Bizde senaryo olarak &lt;strong&gt;APress&lt;/strong&gt; tarafından ele alınan Otomobil &amp;ouml;rneğini kendimize g&amp;ouml;re adım adım geliştirmeye ve anlamaya &amp;ccedil;alışacağız. İşe ilk olarak yeni bir &lt;strong&gt;State Machine Workflow Library&lt;/strong&gt; projesi a&amp;ccedil;arak başlayalım. Bunun i&amp;ccedil;in &lt;strong&gt;Visual&lt;/strong&gt; &lt;strong&gt;Studio&lt;/strong&gt; &lt;strong&gt;2008 &lt;/strong&gt;ortamında &lt;strong&gt;New&lt;/strong&gt; &lt;strong&gt;Project-&amp;gt;WF&lt;/strong&gt; sekmesinden ilgili &lt;strong&gt;proje şablonunu(Project Template)&lt;/strong&gt; se&amp;ccedil;memiz yeterlidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_7.gif" alt="" width="630" height="375" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Proje oluşturulduğunda otomatik olarak &lt;strong&gt;Workflow1&lt;/strong&gt;.cs dosyası tasarım penceresinde a&amp;ccedil;ılacak ve aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; oluşacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_8.gif" alt="" width="424" height="232" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;Workflow1&lt;/strong&gt;.cs i&amp;ccedil;erisinde varsayılan olarak bir &lt;strong&gt;InitialState&lt;/strong&gt; bileşeni bulunmaktadır. Şimdi &amp;ouml;rneğin temasını oluşturan arabanın zaman i&amp;ccedil;erisindeki durumları g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Bu durumları listeledikten sonra ise gerekli tiplerin hazırlanmasına başlanabilir. Herşeyden &amp;ouml;nce arabanın zaman i&amp;ccedil;erisindeki durumları arasındaki ge&amp;ccedil;işleri sağlayacak olan olayların veri değişimi sağlayacak şekilde tasarlanmış bir &lt;strong&gt;aray&amp;uuml;z(Interface)&lt;/strong&gt; i&amp;ccedil;erisinde yer alması sağlanmalıdır. Bu ama&amp;ccedil;la projeye aşağıda sınıf diagramı(Class Diagram) ve kod &amp;ccedil;ıktısı yer alan &lt;strong&gt;aray&amp;uuml;z(Interface)&lt;/strong&gt; eklenir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_9.gif" alt="" width="386" height="280" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[ExternalDataExchange]
public interface IArabaHizmetleri
{
    event EventHandler&amp;lt;ExternalDataEventArgs&amp;gt; ArabayiCalistir;
    event EventHandler&amp;lt;ExternalDataEventArgs&amp;gt; MotoruDurdur;
    event EventHandler&amp;lt;ExternalDataEventArgs&amp;gt; Dur;
    event EventHandler&amp;lt;ExternalDataEventArgs&amp;gt; Ilerle;
    event EventHandler&amp;lt;ExternalDataEventArgs&amp;gt; GeriGit;
    event EventHandler&amp;lt;ExternalDataEventArgs&amp;gt; ArabadanCik;
    event EventHandler&amp;lt;ExternalDataEventArgs&amp;gt; SelektorYap;

    void OnMesajGonder(string message);
} &lt;/pre&gt;
&lt;p&gt;Bu aray&amp;uuml;z(Interface) basit olarak iş akışına&lt;strong&gt; yerel bir servis(Local Service)&lt;/strong&gt; &amp;uuml;zerinden sunulabilecek &amp;uuml;ye bildirilmlerini i&amp;ccedil;ermektedir ki bunlar &amp;ccedil;oğunlukla olay ve metod tanımlamalarıdır. Diğer taraftan aray&amp;uuml;z tipi &lt;strong&gt;ExternalDataExchange&lt;/strong&gt; niteliği(attribute) ile işaretlenmiştir. Bu &lt;strong&gt;niteliğin(Attribute) &lt;/strong&gt;uygulanması sayesinde aray&amp;uuml;z tipi, iş akışları tarafından &lt;strong&gt;yerel bir servis(Local Service) &lt;/strong&gt;olarak kullanılabilir hale gelir. Aray&amp;uuml;z(Interface) i&amp;ccedil;erisinde durum ge&amp;ccedil;işleri(State Transitions) i&amp;ccedil;in gerekli temel olay tanımlamaları yer almaktadır. &amp;Ouml;rneğin arabanın ilerlemesi i&amp;ccedil;in &lt;strong&gt;Ilerle&lt;/strong&gt; yada geriye gitmesi i&amp;ccedil;in &lt;strong&gt;GeriGit&lt;/strong&gt; olaylarına ait bildirimler bulunmaktadır. Bununla birlikte aray&amp;uuml;z, &lt;strong&gt;OnMesajGonder&lt;/strong&gt; isimli bir metod bildirimi de i&amp;ccedil;ermektedir. Bu metod iş akışı(Workflow) tarafından, &lt;strong&gt;host&lt;/strong&gt; uygulamaya mesaj g&amp;ouml;ndermek amacıyla kullanılacaktır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bilindiği gibi aray&amp;uuml;zler(Interface), sadece &amp;uuml;ye bildirimleri i&amp;ccedil;eren tiplerdir. Polimorfik yapıları vardır ve &amp;ccedil;oklu kalıtıma(Multi Inheritance) destek verirler. &amp;Ccedil;oğunlukla t&amp;uuml;retme(Inheritance) i&amp;ccedil;in kullanılır ve t&amp;uuml;reyen &amp;uuml;yelerin mutlaka uyması gereken kuralları bildirirler. Plug-In tabanlı programlamada, tip genişletmelerinde, ortak s&amp;ouml;zleşmelerin sunulmasında(S&amp;ouml;z gelimi WCF gibi SOA-Service Oriented Architecture mimarilerinde) vb... gibi senaryolarda sıklıkla kullanılırlar.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Aray&amp;uuml;z&amp;uuml;n tanımlanmasından sonra bunu uygulayan sınıfın tasarlanması gerekmektedir. Bu &lt;strong&gt;sınıf(Class)&lt;/strong&gt; aynı zamanda yerel bir &lt;strong&gt;servis(Local Service) &lt;/strong&gt;olacaktır. S&amp;ouml;z konusu sınıf ve &lt;strong&gt;MesajGonder&lt;/strong&gt; i&amp;ccedil;in kullanılan yardımcı olay parametresinin i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;MesajAlindiEventArgs&lt;/strong&gt; &lt;strong&gt;sınıfı;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_10.gif" alt="" width="328" height="232" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[Serializable]
public class MesajAlindiEventArgs : ExternalDataEventArgs
{
    private string _bilgi;

    public string Bilgi
    {
        get { return _bilgi; }
        set { _bilgi = value; }
    }
    public MesajAlindiEventArgs(Guid ornekId, string bilgi)
            : base(ornekId)
    {
        _bilgi = bilgi;
    }
} &lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;ExternalDataEventArgs&lt;/strong&gt; sınıfının t&amp;uuml;m yapıcı metod(Constructor Method) versiyonları &lt;strong&gt;Guid&lt;/strong&gt; tipinden bir ilk parametre alırlar. Bu sebepten &lt;strong&gt;base&lt;/strong&gt; anahtar kelimesi kullanılarak &lt;strong&gt;MesajAlindiEventArgs&lt;/strong&gt; sınıfına gelen &lt;strong&gt;Guid&lt;/strong&gt; değerinin &amp;uuml;st sınıf &amp;ouml;rneğine g&amp;ouml;nderilmesi sağlanmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ArabaYerelServisi sınıfı;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_11.gif" alt="" width="386" height="444" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class ArabaYerelServisi :IArabaHizmetleri
{
    #region IArabaHizmetleri Members

    public event EventHandler&amp;lt;ExternalDataEventArgs&amp;gt; ArabayiCalistir;
    public event EventHandler&amp;lt;ExternalDataEventArgs&amp;gt; MotoruDurdur;
    public event EventHandler&amp;lt;ExternalDataEventArgs&amp;gt; Dur;
    public event EventHandler&amp;lt;ExternalDataEventArgs&amp;gt; Ilerle;
    public event EventHandler&amp;lt;ExternalDataEventArgs&amp;gt; GeriGit;
    public event EventHandler&amp;lt;ExternalDataEventArgs&amp;gt; ArabadanCik;
    public event EventHandler&amp;lt;ExternalDataEventArgs&amp;gt; SelektorYap;

    public void OnMesajGonder(string message)
    {
        if (MesajAlindi != null)
        {
            MesajAlindiEventArgs args = new MesajAlindiEventArgs(WorkflowEnvironment.WorkflowInstanceId, message);
            MesajAlindi(this, args);
        }
    }

    #endregion
    
    #region Host uygulama tarafından kullanılan &amp;uuml;yeler
    
    public event EventHandler&amp;lt;MesajAlindiEventArgs&amp;gt; MesajAlindi;

    public void OnArabayiCalistir(ExternalDataEventArgs args)
    {
        if (ArabayiCalistir != null)
            ArabayiCalistir(null, args);
    }

    public void OnMotoruDurdur(ExternalDataEventArgs args)
    {
        if (MotoruDurdur != null)
            MotoruDurdur(null, args);
    }

    public void OnDur(ExternalDataEventArgs args)
    {
        if (Dur != null)
            Dur(null, args);
    }

    public void OnIlerle(ExternalDataEventArgs args)
    {
        if (Ilerle != null)
            Ilerle(null, args);
    }

    public void OnGeriGit(ExternalDataEventArgs args)
    {
        if (GeriGit != null)
            GeriGit(null, args);
    }

    public void OnSelektorYap(ExternalDataEventArgs args)
    {
        if (SelektorYap != null)
            SelektorYap(null, args);
    }

    public void OnArabadanCik(ExternalDataEventArgs args)
    {
        if (ArabadanCik != null)
            ArabadanCik(null, args);
    }

    #endregion
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;ArabaYerelSinifi&lt;/strong&gt; isimli sınıf(Class), ilgili &lt;strong&gt;aray&amp;uuml;z&amp;uuml;(Interface)&lt;/strong&gt; uygulamak dışında &lt;strong&gt;Host&lt;/strong&gt; uygulama tarafından tetiklenebilecek metodlarda i&amp;ccedil;ermektedir. Bu metodlar kendi i&amp;ccedil;lerindende akışa ait durum ge&amp;ccedil;işleri i&amp;ccedil;in gerekli olayların tetiklenmesinde kullanılmaktadır. Sınıf i&amp;ccedil;erisinde yer alan &lt;strong&gt;OnMesajGonder&lt;/strong&gt; isimli metod parametre olarak &lt;strong&gt;string&lt;/strong&gt; tipinden bir değişken almaktadır. Bu parametre değeri &lt;strong&gt;iş akışından(Workflow)&lt;/strong&gt; gelmekte olup &lt;strong&gt;Host&lt;/strong&gt; uygulamaya iletilmektedir. Bu iletim sırasında &lt;strong&gt;MesajAlindi&lt;/strong&gt; isimli olay devreye girmektedir ki bu olay sadece iş akışını barındıran Host uygulama tarafından ele alınabilir. Tahmin edileceği &amp;uuml;zere &lt;strong&gt;OnMesajGonder&lt;/strong&gt; metodunun parametre değeri iş akışı tasarlanırken belirlenecektir.&lt;strong&gt; MesajAlindi&lt;/strong&gt; olayı tetiklenirken parametre olarak &lt;strong&gt;ExternalDataEventArgs&lt;/strong&gt; sınıfından t&amp;uuml;remiş olan &lt;strong&gt;MesajAlindiEventArgs&lt;/strong&gt; sınıfı kullanılmaktadır.&lt;/p&gt;
&lt;p&gt;Bu işlemlerin tamamlanmasının ardından &lt;strong&gt;Durum Makinesinin(State Machine) &lt;/strong&gt;tasarlanmasına başlanabilir. Bu ama&amp;ccedil;la &lt;strong&gt;Workflow1.cs&lt;/strong&gt; &amp;uuml;zerinden gerekli d&amp;uuml;zenlemelerin yapılması gerekmektedir. İlk olarak arabanın sahip olabileceği t&amp;uuml;m durumlar &lt;strong&gt;StateActivity&lt;/strong&gt; bileşenleri yardımıyla iş akışı &amp;uuml;zerine alınırlar. Başlangı&amp;ccedil;ta &lt;strong&gt;StateActivity&lt;/strong&gt; bileşenlerinin &lt;strong&gt;Name&lt;/strong&gt; &amp;ouml;zelliklerinin değerlerinin aşağıdaki tabloda yer aldığı gibi değiştirildiğini d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;table style="border-collapse: collapse; width: 555px;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="width: 157px; background-color: #ffffff;" bgcolor="#336699" width="157"&gt;&lt;strong&gt; StateActivity Bileşeni &lt;br /&gt; Name &amp;Ouml;zelliği Değeri&lt;/strong&gt;&lt;/td&gt;
&lt;td style="width: 157px; background-color: #ffffff;" bgcolor="#336699" width="374"&gt;&lt;strong&gt; Kısa Bilgi&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="157"&gt;&lt;strong&gt;MotorCalismiyor&lt;/strong&gt;&lt;/td&gt;
&lt;td width="374"&gt;Arabanın motorunun &amp;ccedil;alışmadığı durumu işaret eder.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="157"&gt;&lt;strong&gt;MotorCalisiyor&lt;/strong&gt;&lt;/td&gt;
&lt;td width="374"&gt;Arabanın motorunun &amp;ccedil;alışmak olduğu durumu işaret eder.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="157"&gt;&lt;strong&gt;ArabaIlerliyor&lt;/strong&gt;&lt;/td&gt;
&lt;td width="374"&gt;Arabanın ileri doğru hareket ettiği durumu işaret eder.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="157"&gt;&lt;strong&gt;ArabaGeriGidiyor&lt;/strong&gt;&lt;/td&gt;
&lt;td width="374"&gt;Arabanın geriye doğru hareket ettiği durumu işaret eder.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="157"&gt;&lt;strong&gt;ArabadanCikilmistir&lt;/strong&gt;&lt;/td&gt;
&lt;td width="374"&gt;Arabadan inildikten sonraki durumu işaret eder.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Bunun sonrasında iş akışına(Workflow) ait ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_12.gif" alt="" width="437" height="421" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Son işlemleri takiben iş akışının başlangı&amp;ccedil; ve bitiş durumları belirlenebilir. Bunun i&amp;ccedil;in &lt;strong&gt;Workflow1&lt;/strong&gt;' in &amp;ouml;zellikler(Properties) penceresinden &lt;strong&gt;InitialStateName&lt;/strong&gt; ve &lt;strong&gt;CompletedStateName&lt;/strong&gt; &amp;ouml;zelliklerine ilgili değerlerin verilmesi gerekmektedir. Senaryo gereği &lt;strong&gt;MotorCalismiyor&lt;/strong&gt; başlangı&amp;ccedil; ve &lt;strong&gt;ArabadanCikilmistir&lt;/strong&gt; bitiş&lt;strong&gt; durumlarını(State)&lt;/strong&gt; bildirmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_13.gif" alt="" width="314" height="230" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Artık ilk durumdan diğerine ge&amp;ccedil;isi sağlayacak olan olay aktivitesi tanımlanabilir. Bu ama&amp;ccedil;la &lt;strong&gt;MotorCalismiyor&lt;/strong&gt; isimli &lt;strong&gt;StateActivity&lt;/strong&gt; i&amp;ccedil;erisine bir adet &lt;strong&gt;EventDrivenActivity&lt;/strong&gt; bileşeni s&amp;uuml;r&amp;uuml;klenir. &lt;strong&gt;EventDrivenActivity&lt;/strong&gt; bileşeninin &lt;strong&gt;Name&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;MotorCalistirOlayi&lt;/strong&gt; adı verilebilir. Sonu&amp;ccedil; olarak ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_14.gif" alt="" width="451" height="241" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Daha &amp;ouml;ncedende bahsettiğimiz gibi &lt;strong&gt;EventDrivenActivity&lt;/strong&gt; i&amp;ccedil;erisinde genel olarak 3 farklı aktivite kullanılır. Bu senaryoda s&amp;ouml;z konusu olayın tetiklenmesi i&amp;ccedil;in &lt;strong&gt;HandleExternalEventActivity&lt;/strong&gt; bileşeni ele alınmalıdır. Diğer taraftan yerel servis &amp;uuml;zerinden harici metod &amp;ccedil;ağrısı i&amp;ccedil;in &lt;strong&gt;CallExternalMethodActivity&lt;/strong&gt; bileşeni değerlendirilir. Son olarak olayın tetiklenmesi sonrası ge&amp;ccedil;ilecek olan durumu işaret etmek i&amp;ccedil;in &lt;strong&gt;SetStateActivity&lt;/strong&gt; bileşeni kullanılmalıdır. &lt;strong&gt;EventDrivenActivity&lt;/strong&gt; bileşeni i&amp;ccedil;erisine bahsedilen kontrolleri oluşturmak i&amp;ccedil;in &lt;strong&gt;MotorCalistirOlayi&lt;/strong&gt; &amp;uuml;zerinde &amp;ccedil;ift tıklanması yeterlidir. Sonu&amp;ccedil; olarak ilk durum i&amp;ccedil;in tasarlanan &lt;strong&gt;EventDrivenActivity&lt;/strong&gt; bileşeninin i&amp;ccedil;eriği aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer aldığı gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_15.gif" alt="" width="434" height="428" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;HandleExternalActivity&lt;/strong&gt; bileşeni ile başlayalım. Bu bileşenin &lt;strong&gt;InterfaceType&lt;/strong&gt; &amp;ouml;zelliğine tetiklenecek olan olayın bildirimini i&amp;ccedil;eren aray&amp;uuml;z adı verilmelidir. Bu ama&amp;ccedil;la &amp;uuml;&amp;ccedil; nokta d&amp;uuml;ğmesine basıldığında aşağıdakine benzer bir arabirim ile karşılaşılır. Bu arabirimden aynı proje i&amp;ccedil;erisindeki veya farklı bir projedeki &lt;strong&gt;ExternalDataExchange&lt;/strong&gt; niteliğini uygulayan aray&amp;uuml;zler g&amp;ouml;r&amp;uuml;lebilir. &amp;Ouml;rneğimizdede &lt;strong&gt;IArabaHizmetleri&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; aktif olarak gelmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_16.gif" alt="" width="637" height="229" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Aray&amp;uuml;z se&amp;ccedil;imi yapıldıktan sonra &lt;strong&gt;EventName&lt;/strong&gt; &amp;ouml;zelliğinde ele alınabilecek olan, bir başka deyişle &lt;strong&gt;interface&lt;/strong&gt; tipi i&amp;ccedil;erisinde bildirilmiş olan olayların listesi gelecektir. &amp;Ouml;rneğimizdeki ilk durum i&amp;ccedil;in &lt;strong&gt;ArabayiCalistir&lt;/strong&gt; olayı se&amp;ccedil;ilmelidir. &lt;strong&gt;EventDrivenActivity&lt;/strong&gt; i&amp;ccedil;in s&amp;ouml;z konusu olan durum aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_17.gif" alt="" width="365" height="259" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim &lt;strong&gt;CallExternalMethodActivity&lt;/strong&gt; bileşenine. Bu bileşen i&amp;ccedil;inde yine aray&amp;uuml;z(Interface) se&amp;ccedil;imi yapılmalıdır. &lt;strong&gt;InterfaceType&lt;/strong&gt; &amp;ouml;zelliğine yapılan atamanın ardından &amp;ccedil;alıştırılacak olan harici metodun adı &lt;strong&gt;MethodName&lt;/strong&gt; &amp;ouml;zelliğinden se&amp;ccedil;ilir. &amp;Ouml;rnekte harici metodun aldığı &lt;strong&gt;string&lt;/strong&gt; bir parametrede s&amp;ouml;z konusudur. Bu parametrede &lt;strong&gt;message&lt;/strong&gt; isimli &amp;ouml;zelliğe atanan değer ile belirtilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_18.gif" alt="" width="358" height="220" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada dikkat edilmesi gereken noktalardan biriside, &lt;strong&gt;OnMesajGonder&lt;/strong&gt; metodunun parametrik yapısına uygun olacak şekilde bir &amp;ouml;zelliğin &lt;strong&gt;IDE&lt;/strong&gt;' deki &lt;strong&gt;Properties&lt;/strong&gt; penceresine eklenmiş olmasıdır. &amp;Ouml;rnekte message isimli olan parametre, &amp;ouml;zellik penceresine birer bir aynı olacak şekilde gelmiştir. Harici metod &amp;ccedil;ağırılmasınıda tamamladıktan sonra ge&amp;ccedil;ilecek olan durum bileşenini belirlemek gerekmektedir. Bunun i&amp;ccedil;inde &lt;strong&gt;SetStateActivity&lt;/strong&gt; bileşeninin &lt;strong&gt;TargetStateName&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;StateActivity&lt;/strong&gt; adının atanması yeterlidir. İlk durumda aracın motoru &amp;ccedil;alıştırıldıktan sonra MotorCalisiyor durumuna(State) ge&amp;ccedil;ilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_19.gif" alt="" width="341" height="166" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İstenirse ilk durum i&amp;ccedil;in &lt;strong&gt;StateInitializationActivity&lt;/strong&gt; bileşeni de eklenebilir. B&amp;ouml;ylece makinenin ilk konumdaki durumu i&amp;ccedil;in gerekli hazırlıkların yapılması sağlanabilir. S&amp;ouml;z gelimi &amp;ouml;rnek senaryoda &lt;strong&gt;OnMesajGonder&lt;/strong&gt; metodunun harici olarak &amp;ccedil;ağırılması ve mesaj olarakta "Araba hazır" denilmesi sağlanabilir. Bunun i&amp;ccedil;in &lt;strong&gt;MotorCalismiyor&lt;/strong&gt; aktivitesi i&amp;ccedil;erisine bir adet &lt;strong&gt;StateInitializationActivity&lt;/strong&gt; bileşeni atanması ve bu bileşenin i&amp;ccedil;erisinede bir adet &lt;strong&gt;CallExternalMethodActivity&lt;/strong&gt; bileşeni eklenerek &lt;strong&gt;InterfaceType&lt;/strong&gt;, &lt;strong&gt;MethodName&lt;/strong&gt; ve &lt;strong&gt;message&lt;/strong&gt; &amp;ouml;zelliklerinin değerlerinin belirlenmesi yeterlidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_20.gif" alt="" width="627" height="328" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece ilk durum tamamıyle hazırdır. Akışın şu andaki g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_21.gif" alt="" width="399" height="403" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada yapmış olduğumuz adımların aynılarını diğer durumlar i&amp;ccedil;inde ger&amp;ccedil;ekleştirmeliyiz. Makalemizin dahada uzamaması i&amp;ccedil;in buradaki adımların g&amp;ouml;sterilmesini atlıyoruz. Gereken ayarlamalar yapıldıktan sonra iş akışının son hali aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki gibi olmalıdır. Dikkat edileceği &amp;uuml;zere olası durum ge&amp;ccedil;işleri ince ok &amp;ccedil;izgiler ile daha belirgin haldedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_22.gif" alt="" width="576" height="445" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada ekstradan selekt&amp;ouml;r yapma durumununda, &lt;strong&gt;State&lt;/strong&gt; &lt;strong&gt;Machine&lt;/strong&gt; &amp;uuml;zerinde ayrı bir &lt;strong&gt;EventDrivenActivity&lt;/strong&gt; olarak tanımlanması gereklidir. Bu aktivite i&amp;ccedil;erisinde sadece &lt;strong&gt;HandleExternalEventActivity&lt;/strong&gt; ve &lt;strong&gt;CallExternalMethodActivity&lt;/strong&gt; bileşenlerinin kullanılması yeterlidir. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;SetStateActivity&lt;/strong&gt; kontrol&amp;uuml;n&amp;uuml;n kullanılması gerekli değildir. Nitekim selekt&amp;ouml;r yapma olayının arkasından ge&amp;ccedil;ilecek herhangibir durum g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınmamaktadır. Bu nedenle &lt;strong&gt;SelektorYapOlayı&lt;/strong&gt; isimli &lt;strong&gt;EventDrivenActivity&lt;/strong&gt; i&amp;ccedil;erisinde aşağıdaki bileşenlerin tasarlanması yeterlidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_23.gif" alt="" width="178" height="230" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Host&lt;/strong&gt; uygulamaya ge&amp;ccedil;meden &amp;ouml;nce şu durumda g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınmalıdır. Tasarım penceresine bakıldığında &lt;strong&gt;ArabaGeriGidiyor&lt;/strong&gt; ve &lt;strong&gt;ArabaIlerliyor&lt;/strong&gt; &lt;strong&gt;StateActivity&lt;/strong&gt; bileşenleri i&amp;ccedil;erisinde aynı &lt;strong&gt;EventDrivenActivity&lt;/strong&gt; nesnelerinin kullanıldığı g&amp;ouml;r&amp;uuml;lmektedir ki buda aracı durdurma olayını işaret etmektedir. Bu nedenle makalemizin başındada belirttiğimiz gibi bu &lt;strong&gt;StateActivity&lt;/strong&gt; bileşenlerinin ortak bir &lt;strong&gt;StateActivity&lt;/strong&gt; i&amp;ccedil;erisine alınması d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Bu sebepten tasarım ekranına ortak bir &lt;strong&gt;StateActivity&lt;/strong&gt; bileşeni s&amp;uuml;r&amp;uuml;klenip, diğerlerini i&amp;ccedil;ine alması sağlanmalıdır. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; bu durumu a&amp;ccedil;ık bir şekilde ifade etmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_24.gif" alt="" width="538" height="537" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikli olarak &lt;strong&gt;HareketEdiyor&lt;/strong&gt; isimli &lt;strong&gt;StateActivity&lt;/strong&gt; i&amp;ccedil;erisine &lt;strong&gt;ArabaGeriGidiyor&lt;/strong&gt; ve &lt;strong&gt;ArabaIlerliyor&lt;/strong&gt; isimli &lt;strong&gt;StateActivity&lt;/strong&gt; nesneleri s&amp;uuml;r&amp;uuml;klenmiştir. Sonrasında ise bunlardan herhangibirisinde yer alan &lt;strong&gt;ArabayiDurdurOlayi&lt;/strong&gt; isimli &lt;strong&gt;EventDrivenActivity&lt;/strong&gt; bileşeni &lt;strong&gt;HareketEdiyor&lt;/strong&gt; isimli &lt;strong&gt;StateActivity&lt;/strong&gt; i&amp;ccedil;erisine &amp;ccedil;ıkartılmış ve diğerininki silinmiştir.&lt;/p&gt;
&lt;p&gt;Artık host uygulamanın yazılmasına başlanabilir. &amp;Ouml;rneğimizde &lt;strong&gt;host&lt;/strong&gt; uygulaması basit bir &lt;strong&gt;WPF(Windows Presentation Foundation) &lt;/strong&gt;programı olarak tasarlanacaktır. S&amp;ouml;z konusu WPF uygulamasının &lt;strong&gt;State&lt;/strong&gt; &lt;strong&gt;Machine Workflow k&amp;uuml;t&amp;uuml;phanesi(Library) &lt;/strong&gt;dışında, &lt;strong&gt;System.Workflow.Activities, System.Workflow.Components &lt;/strong&gt;ve &lt;strong&gt;System.Workflow.Hosting assembly&lt;/strong&gt;' larınıda referans etmesi gerekmektedir. YarisPisti isimli &lt;strong&gt;WPF&lt;/strong&gt; uygulamamızın &lt;strong&gt;Window1&lt;/strong&gt; penceresine ait ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ve &lt;strong&gt;XAML(eXtensible Application Markup Language)&lt;/strong&gt; i&amp;ccedil;eriği ise aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk239_25.gif" alt="" width="322" height="323" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;XAML i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Window x:Class="YarisPisti.Window1" xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation" xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml" Title="Window1" Height="300" Width="300"&amp;gt;
    &amp;lt;Grid&amp;gt;
        &amp;lt;Label Height="42" Margin="28,0,22,32" Name="lblGelenMesaj" VerticalAlignment="Bottom" Content="Durum Bilgisi"&amp;gt;&amp;lt;/Label&amp;gt;
        &amp;lt;Button Height="23" HorizontalAlignment="Left" Margin="26,25,0,0" Name="btnYeniAraba" VerticalAlignment="Top" Width="88" Click="btnYeniAraba_Click"&amp;gt;Yeni Araba&amp;lt;/Button&amp;gt;
        &amp;lt;Button Height="23" Margin="26,60,0,0" Name="btnMotoruCalistir" VerticalAlignment="Top" Click="btnMotoruCalistir_Click" HorizontalAlignment="Left" Width="88"&amp;gt;&amp;Ccedil;alıştır&amp;lt;/Button&amp;gt;
        &amp;lt;Button Height="23" HorizontalAlignment="Left" Margin="28,97,0,0" Name="btnMotoruKapat" VerticalAlignment="Top" Width="86" Click="btnMotoruKapat_Click"&amp;gt; Motoru Kapat&amp;lt;/Button&amp;gt;
        &amp;lt;Button HorizontalAlignment="Right" Margin="0,129,44,110" Name="btnSelektorYap" Width="84" Click="btnSelektorYap_Click"&amp;gt;Selekt&amp;ouml;r&amp;lt;/Button&amp;gt;
        &amp;lt;Button Height="23" HorizontalAlignment="Right" Margin="0,26,44,0" Name="btnIlerle" VerticalAlignment="Top" Width="83" Click="btnIlerle_Click"&amp;gt;İlerle&amp;lt;/Button&amp;gt;
        &amp;lt;Button Height="23" HorizontalAlignment="Right" Margin="0,58,44,0" Name="btnGeriGit" VerticalAlignment="Top" Width="83" Click="btnGeriGit_Click"&amp;gt;Geri Git&amp;lt;/Button&amp;gt;
        &amp;lt;Button Height="23" HorizontalAlignment="Right" Margin="0,95,44,0" Name="btnDur" VerticalAlignment="Top" Width="83" Click="btnDur_Click"&amp;gt;Dur&amp;lt;/Button&amp;gt;
        &amp;lt;Button HorizontalAlignment="Left" Margin="28,129,0,110" Name="btnArabadanIn" Width="86" Click="btnArabadanIn_Click"&amp;gt;İn&amp;lt;/Button&amp;gt;
    &amp;lt;/Grid&amp;gt;
&amp;lt;/Window&amp;gt;&lt;/pre&gt;
&lt;p&gt;Window1 penceremizin kod i&amp;ccedil;eriği ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Navigation;
using System.Windows.Shapes;
using ArabaStateMachineLib;
using System.Workflow.Runtime;
using System.Workflow.Activities;

namespace YarisPisti
{
    public partial class Window1 : Window
    {
        // Workflow &amp;ccedil;alışma ortamı i&amp;ccedil;in gerekli nesne tanımlanır
        WorkflowRuntime _wf;
        ArabaYerelServisi _arabaServisi; // Yerel Servis nesnesi tanımlanır
        Guid ornekId = Guid.Empty; //ExternalDataEventArgs sınıfı parametre olarak Guid almaktadır. Bu sebepten ornekId isimli bir değişlen tanımlanmıştır.

        public Window1()
        {
            InitializeComponent();

            _wf = new WorkflowRuntime(); // &amp;Ccedil;alışma zamanı oluşturulur
            _wf.StartRuntime(); // WF &amp;ccedil;alışma zamanı başlatılır
                ExternalDataExchangeService excSrv = new ExternalDataExchangeService(); // Bir adet ExternalDataExchangeService servisi oluşturulur ve şu anki WF &amp;ccedil;alışma zamanına AddService metodu ile eklenir.
            _wf.AddService(excSrv);

            // Yerel Servis(Local Servis) nesnesi &amp;ouml;rneklenir.
            _arabaServisi = new ArabaYerelServisi();
            // Host &amp;uuml;zerinden ele alınacak MesajAlindi olayı y&amp;uuml;klenir.
            _arabaServisi.MesajAlindi+=new EventHandler&amp;lt;MesajAlindiEventArgs&amp;gt;(_arabaServisi_MesajAlindi);
            // Yerel servis ExternalDataExchangeService &amp;ouml;rneğine eklenir
            excSrv.AddService(_arabaServisi);
        }

        // Label i&amp;ccedil;eriğinin g&amp;uuml;ncellenmesi i&amp;ccedil;in aşağıdaki gibi Invoker kullanımı gereklidir. Aksi takdirde &amp;ccedil;alışma zamanında istisna alınır.
        private delegate void GuncellemeTemsilcisi();
        void _arabaServisi_MesajAlindi(object sender, MesajAlindiEventArgs e)
        {
            ornekId = e.InstanceId;
            GuncellemeTemsilcisi dlg = delegate()
            {
                lblGelenMesaj.Content = e.Bilgi.ToString();
            };
            // Normal Windows uygulamalarında this.Invoke ile &amp;ccedil;ağırabilmemiz m&amp;uuml;mk&amp;uuml;nken WPF uygulamalarında Dispatcher nesnesinden yararlanılmaktadır
            Dispatcher.Invoke(System.Windows.Threading.DispatcherPriority.Normal, dlg); 
        }

        // Yeni araba aslında Workflow1 tipinden yeni bir State Machine Workflow &amp;ouml;rneği oluşturulmasını sağlamaktadır.
        private void btnYeniAraba_Click(object sender, RoutedEventArgs e)
        {
            WorkflowInstance wfOrnegi = _wf.CreateWorkflow(typeof(Workflow1), null);
            wfOrnegi.Start(); // State Machine Workflow başlatılır
            ornekId = wfOrnegi.InstanceId; // ExternalDataEventArgs' ta kullanılmak &amp;uuml;zere InstanceId değeri alını ve GUID tipinden olan ornekId değişkenine atanır.
        }

        // Olaylar i&amp;ccedil;in gerekli arg&amp;uuml;manların alınması sağlanan metod
        private ExternalDataEventArgs ArgumanAl()
        {
            ExternalDataEventArgs args = new ExternalDataEventArgs(ornekId);
            args.WaitForIdle = true; 
            return args;
        }

        private void btnIlerle_Click(object sender, RoutedEventArgs e)
        {
            try
            {
                _arabaServisi.OnIlerle(ArgumanAl()); // Servis &amp;uuml;zerinden ilgili olay metodu tetiklenir
            }
            catch (Exception ex)
            {
                MessageBox.Show(ex.Message);
            }
        }

        private void btnMotoruCalistir_Click(object sender, RoutedEventArgs e)
        {
            try
            {
                _arabaServisi.OnArabayiCalistir(ArgumanAl());
            }
            catch (Exception ex)
            {
                MessageBox.Show(ex.Message);
            }
        }

        private void btnGeriGit_Click(object sender, RoutedEventArgs e)
        {
            try
            {
                _arabaServisi.OnGeriGit(ArgumanAl());
            }
            catch (Exception ex)
            {
                MessageBox.Show(ex.Message);
            }
        }

        private void btnMotoruKapat_Click(object sender, RoutedEventArgs e)
        {
            try
            {
                _arabaServisi.OnMotoruDurdur(ArgumanAl());
            }
            catch (Exception ex)
            {
                MessageBox.Show(ex.Message);
            }
        }

        private void btnDur_Click(object sender, RoutedEventArgs e)
        {
            try
            {
                _arabaServisi.OnDur(ArgumanAl());
            }
            catch (Exception ex)
            {
                MessageBox.Show(ex.Message);
            }
        }

        private void btnArabadanIn_Click(object sender, RoutedEventArgs e)
        {
            try
            {
                _arabaServisi.OnArabadanCik(ArgumanAl());
            }
            catch (Exception ex)
            {
                MessageBox.Show(ex.Message);
            }
        }

        private void btnSelektorYap_Click(object sender, RoutedEventArgs e)
        {
            try
            {
                _arabaServisi.OnSelektorYap(ArgumanAl());
            }
            catch (Exception ex)
            {
                MessageBox.Show(ex.Message);
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdaki video g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki gibi &lt;strong&gt;State Machine Workflow&lt;/strong&gt; başarılı bir şekilde y&amp;uuml;klendiği ve &amp;ccedil;alıştığı g&amp;ouml;r&amp;uuml;lmektedir. Tabiki ge&amp;ccedil;iş yapılamayan durumlarda s&amp;ouml;z konusudur. &amp;Ouml;rneğin araba ileri gidiyorken geri gidiyor durumuna ge&amp;ccedil;ilmesi s&amp;ouml;z konusu değildir. Bu tip hallerde, &lt;strong&gt; try...catch&lt;/strong&gt; blokları devreye girerek &amp;uuml;retilen i&lt;strong&gt;stisna(Exception)&lt;/strong&gt; mesajları MessageBox i&amp;ccedil;erisinde g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;object id="obj1" width="300" height="300" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/mk239Video.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="300" height="300" src="http://www.buraksenyurt.com/makale/images/mk239Video.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj1" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir uzun makalemizin daha sonuna. Bu makalemizde &lt;strong&gt;State&lt;/strong&gt; &lt;strong&gt;Machine&lt;/strong&gt; &lt;strong&gt;Workflow&lt;/strong&gt; tipinden iş akışlarını kısaca ne olduklarını, nasıl tasarlandıklarını incelemeye &amp;ccedil;alıştık. Bunu yaparken StateActivity, EventDrivenActivity, HandleExternalEventActivity, SetStateActivity, CallExternalMethodActivity vb aktivite tiplerinden bir ka&amp;ccedil;ına değinme fırsatımızda oldu. Ayrıca &lt;strong&gt;durumlar(States) &lt;/strong&gt;arası ge&amp;ccedil;işleri sağlayan olayların &lt;strong&gt;yerel bir servis(Local Service) &lt;/strong&gt;i&amp;ccedil;erisinde nasıl geliştirilebileceğini g&amp;ouml;rd&amp;uuml;k. Son olarakta geliştirilen &lt;strong&gt;Workflow&lt;/strong&gt; projesini bir &lt;strong&gt;WPF&lt;/strong&gt; host uygulamasında y&amp;uuml;r&amp;uuml;tmeyi inceledik.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek senaryo olarak &lt;strong&gt;APress&lt;/strong&gt; yayınlarından olan ve &lt;strong&gt;Bruce Bukovics&lt;/strong&gt; tarafından yazılan &lt;strong&gt;Pro WF&lt;/strong&gt; kitabında yer alan &lt;strong&gt;CarService&lt;/strong&gt; iş akışının daha basit bir versiyonunu adım adım a&amp;ccedil;ıklamalı olarak &amp;ouml;rneklemeye &amp;ccedil;alıştık. &amp;Ouml;zel olarak host uygulamayı WPF &amp;uuml;zerinde geliştirdik. B&amp;ouml;ylece &lt;strong&gt;Window&lt;/strong&gt; uygulamalarında kullandığımız &lt;strong&gt;method invoker &lt;/strong&gt;kavramının burada &lt;strong&gt;Dispatcher&lt;/strong&gt; &amp;ouml;zelliği &amp;uuml;zerinden ele alınabileceğini g&amp;ouml;rme fırsatını elde ettik.&lt;em&gt;(Dispatcher kavramına ilerleyen makalelerimizde değinmeye &amp;ccedil;alışıyor olacağım)&lt;/em&gt; &lt;strong&gt; State&lt;/strong&gt; &lt;strong&gt;Machine&lt;/strong&gt; &lt;strong&gt;Workflow&lt;/strong&gt; tipinden iş akışlarının, bu senaryo dışında ger&amp;ccedil;ek .&lt;strong&gt;Net&lt;/strong&gt; nesneleri i&amp;ccedil;erisindeki kullanımını araştırmanızı ve &amp;ouml;rneklemeye &amp;ccedil;alışmanızı şiddetle tavsiye ederim. İlerleyen makalalerimizde &lt;strong&gt;Windows Workflow Foundation&lt;/strong&gt; ile ilgili farklı konulara değinmeye devam ediyor olacağız. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/StateMachineOrnegi.rar"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2008-01-15 06:00:00</pubDate>
  <slug>Adc4b1m-Adc4b1m-State-Machine-Workflow-Gelistirmek-bsenyurt-com-dan</slug>
  <tags>
    <tag>wf</tag>
    <tag>windows-workflow-foundation</tag>
    <tag>state-machine</tag>
  </tags>
  <categories>
    <category>WF</category>
  </categories>
</post>