<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net 2.0 URL Rewriting Hakkında Gerçekler</title>
  <description>Çok kısa süreliğinede olsa tatilde olduğum şu günlerde yazılım dünyasından kopmak hiç içimden gelmedi. Bu nedenle dinlendiğim zamanlardan arta kalan sürelerde azda olsa bir şeyler karalamak istedim. Sonuç olarak daha hafif ve tatil moduna uygun olacak bir yazı ile yeniden beraberiz. Bu makalemizde Asp.Net 2.0 ile geliştirilen web uygulamalarında, URL eşleştirmelerinin (Url Mapping) nasıl düzenlenebileceğini, bir başka deyişle nasıl özelleştirilebileceğini incelemeye çalışacağız. Son kullanıcılar web ortamında, kendi tarayıcı(browser) uygulamalarında yer alan adres satırlarında zaman zaman karışık ve uzun URL bilgileri ile karşılaşırlar. Genellikle sorgu katarlarının(QueryString) kullanıldığı ve bunların sayılarının çok olduğu durumlarda adres satırlarını okumak gerçekten güçleşebilir. Söz gelimi aşağıdaki URL bilgisini göz önüne alalım.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok kısa s&amp;uuml;reliğinede olsa tatilde olduğum şu g&amp;uuml;nlerde yazılım d&amp;uuml;nyasından kopmak hi&amp;ccedil; i&amp;ccedil;imden gelmedi. Bu nedenle dinlendiğim zamanlardan arta kalan s&amp;uuml;relerde azda olsa bir şeyler karalamak istedim. Sonu&amp;ccedil; olarak daha hafif ve tatil moduna uygun olacak bir yazı ile yeniden beraberiz. Bu makalemizde Asp.Net 2.0 ile geliştirilen web uygulamalarında, URL eşleştirmelerinin &lt;strong&gt;(Url Mapping)&lt;/strong&gt; nasıl d&amp;uuml;zenlenebileceğini, bir başka deyişle nasıl &amp;ouml;zelleştirilebileceğini incelemeye &amp;ccedil;alışacağız. Son kullanıcılar web ortamında, kendi &lt;strong&gt;tarayıcı(browser)&lt;/strong&gt; uygulamalarında yer alan adres satırlarında zaman zaman karışık ve uzun URL bilgileri ile karşılaşırlar. Genellikle sorgu katarlarının&lt;strong&gt;(QueryString)&lt;/strong&gt; kullanıldığı ve bunların sayılarının &amp;ccedil;ok olduğu durumlarda adres satırlarını okumak ger&amp;ccedil;ekten g&amp;uuml;&amp;ccedil;leşebilir. S&amp;ouml;z gelimi aşağıdaki URL bilgisini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;http://www.azonsitesi.com/urunler.aspx?urunKategori=1&amp;amp;urunAdi=Bilgisayar%20Kitaplari&amp;amp;Sinifi=Ingilizce&amp;amp;BasimYili=2006&lt;/pre&gt;
&lt;p&gt;Bunun yerine aşağıdaki gibi bir URL bilgisi &amp;ccedil;ok daha kullanışlı ve son kullanıcı a&amp;ccedil;ısından okunaklı olabilir.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;http://www.azonsitesi.com/Ingilizce/BilgisayarKitaplari/2006Basimi/Goster.aspx&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnekler &amp;ccedil;oğaltılabilir. S&amp;ouml;z gelimi blog sitelerinde, adres satırlarında okunan i&amp;ccedil;eriğe ait bilgilerin QueryString şeklinde durması yerine &amp;ouml;rneğin&lt;strong&gt;http://buraginblogu/Agustos/7/2007/UrlEslestirme/Oku.aspx&lt;/strong&gt; gibi bir formata sahip olması son kullanıcı a&amp;ccedil;ısından &amp;ccedil;ok daha cezbedicidir.&lt;/p&gt;
&lt;p&gt;Bu ve benzer durumlarda, adres satırındaki bilginin daha kolay anlaşılabileceği hale getirilmesi &lt;strong&gt;son kullanıcı(End User)&lt;/strong&gt; i&amp;ccedil;in &amp;ouml;nemli bir hizmettir. Peki bu tarz bir ihtiya&amp;ccedil; nasıl karışalanabilir. İlk olarak istemciden gelen adres talebine eş d&amp;uuml;şecek yeni URL bilgisinin sunucu tarafında ele alınıyor olması gerekir. Sonrasında ise sonu&amp;ccedil;lar istemci tarayıcı programına istenen formatta g&amp;ouml;nderilir. &lt;strong&gt;Asp.Net 1.1 &lt;/strong&gt;kullanıldığı takdirde bu işin &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; &amp;ouml;zel &lt;strong&gt;HttpHandler&lt;/strong&gt; ve &lt;strong&gt;HttpModule&lt;/strong&gt; sınıflarının yazılması ile m&amp;uuml;mk&amp;uuml;n olabilir.&lt;em&gt;(Kendi HttpHandler yada HttpModuler tiplerimizi nasıl yazabileceğimize dair bilgileri daha &amp;ouml;nceden yayınlanan &lt;/em&gt;&lt;em&gt;&lt;span style="font-family: Verdana; color: #ff0000;"&gt;&lt;strong&gt;&lt;a href="http://www.bsenyurt.com/MakaleGoster.aspx?ID=183"&gt;makalemizden&lt;/a&gt;&lt;/strong&gt; takip edebilirsiniz)&lt;/span&gt;&lt;/em&gt; &lt;strong&gt;Asp.Net 2.0&lt;/strong&gt; mimarisindeyse, sadece URL eşleştirilmelerinin daha kolay yapılabilmesini sağlamak amacıyla &lt;strong&gt;web.config&lt;/strong&gt; dosyasında yer alan &lt;strong&gt;system.web&lt;/strong&gt; boğumu&lt;strong&gt;(node)&lt;/strong&gt; i&amp;ccedil;erisinde ele alınabilecek bir &lt;strong&gt;urlMappings&lt;/strong&gt; elementi ve bunun &lt;strong&gt;Configuration API&lt;/strong&gt;' sinde karşılğı olan &lt;strong&gt;UrlMappingsSection&lt;/strong&gt; sınıfı geliştirilmiştir. Bu sayede konfigurasyon bazında URL eşleştirmeleri yapılabilmekte ve &amp;ouml;zel HttpHandler yada HttpModule tipleri yazılmasına gerek kalmamaktadır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Her ne kadar &lt;strong&gt;urlMappings&lt;/strong&gt; elementi veya &lt;strong&gt;UrlMappingsSection&lt;/strong&gt; tipi sayesinde, URL eşleştirmelerinin yapılması kolaylaşmışsada bazı &amp;ouml;zel durumlarda yine HttpHandler veya HttpModule tipleri geliştirmek gerekebilir. S&amp;ouml;z gelimi, urlMappings elementinin doğrudan bir&lt;strong&gt;regular expression &lt;/strong&gt;desteği yoktur. Dolayısıyla benzer yazıma sahip URL bilgileri i&amp;ccedil;in ortak eşleştirme yapmak adına element bazında bir hamle yapılması zordur. Bunu sağlamak i&amp;ccedil;in HttpModule ve HttpHandler yazmak gerekmektedir. B&amp;ouml;yle bir ihtiya&amp;ccedil; i&amp;ccedil;in kendi HttpModule ve HttpHandler tipinizi yazmaya &amp;ccedil;alışmanız &amp;ouml;nerilir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Aslında Asp.Net 2.0 mimarisinde yer alan URL eşleştirme sistemi aşağıdaki grafikte g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &amp;ccedil;alışmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk217_1.gif" alt="" width="575" height="396" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re istemciden gelen talepler sonrası, ilgili web uygulaması Asp.Net &amp;ccedil;alışma zamanı i&amp;ccedil;erisinde normal s&amp;uuml;recine devam eder. Taki sayfanın son hali Render işlemine tabi tutulup istemciye g&amp;ouml;nderilene kadar. Bir başka deyişle Render işleminde &amp;ouml;nce, &lt;strong&gt;Asp.Net &amp;ccedil;alışma zamanı(Asp.Net RunTime)&lt;/strong&gt; web.config i&amp;ccedil;erisinde herhangibir eşleştirme olup olmadığına bakar. Eğer talep edilen URL i&amp;ccedil;in bir eşleştirme varsa buna g&amp;ouml;re &lt;strong&gt;HttpContext&lt;/strong&gt; tipinin &lt;strong&gt;RewritePath&lt;/strong&gt; metodu işletilir ve URL adresi değiştirilir. Sonrasında ise sayfa istemciye g&amp;ouml;nderilir.&lt;/p&gt;
&lt;p&gt;Dilerseniz &amp;ouml;rnek bir senaryo &amp;uuml;zerinden hareket ederek URL eşleştirmelerinin Asp.Net 2.0 mimarisinde nasıl yapıldığını yakından incelemeye &amp;ccedil;alışalım. Senaryo gereği kullanıcının alt kategorisi ve sınıfına g&amp;ouml;re bazı &amp;uuml;r&amp;uuml;nleri listelediğini d&amp;uuml;ş&amp;uuml;nebiliriz. Bu ama&amp;ccedil;la &lt;strong&gt;SQL Server 2005&lt;/strong&gt; ile gelen &lt;strong&gt;AdventureWorks&lt;/strong&gt; veritabanındaki &lt;strong&gt;ProductSubCategories&lt;/strong&gt; ve &lt;strong&gt;Product&lt;/strong&gt; tablolarını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. Bu tablolara arasında aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len &lt;strong&gt;bire-&amp;ccedil;ok(one to many)&lt;/strong&gt; ilişki vardır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk217_2.gif" alt="" width="558" height="315" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak default.aspx sayfamızı aşağıdaki gibi geliştirelim.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" %&amp;gt;

&amp;lt;!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"&amp;gt;

&amp;lt;script runat="server"&amp;gt;
&amp;lt;/script&amp;gt;

&amp;lt;html xmlns="http://www.w3.org/1999/xhtml" &amp;gt;
&amp;lt;head runat="server"&amp;gt;
    &amp;lt;title&amp;gt;URL Mapping Ornegi&amp;lt;/title&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body&amp;gt;
    &amp;lt;form id="form1" runat="server"&amp;gt;
    &amp;lt;div&amp;gt;
        &amp;lt;asp:GridView ID="GridView1" runat="server" DataSourceID="dsCategories" AllowPaging="True" AutoGenerateColumns="False"&amp;gt;
            &amp;lt;Columns&amp;gt;
                &amp;lt;asp:HyperLinkField DataNavigateUrlFields="Name,Class" DataNavigateUrlFormatString="~/Urunler/{0}/{1}/Goster.aspx" DataTextField="Title" HeaderText="Alt Kategori ve Sınıfı" /&amp;gt;
            &amp;lt;/Columns&amp;gt;
        &amp;lt;/asp:GridView&amp;gt;
        &amp;lt;asp:SqlDataSource ID="dsCategories" runat="server" ConnectionString="&amp;lt;%$ ConnectionStrings:AdvConStr %&amp;gt;" SelectCommand="SELECT DISTINCT PSC.ProductSubcategoryID, Replace(PSC.Name,' ','') AS Name, RTRIM(PRD.Class) as Class, PSC.Name+' '+PRD.Class AS Title FROM Production.ProductSubcategory AS PSC INNER JOIN Production.Product AS PRD ON PSC.ProductSubcategoryID = PRD.ProductSubcategoryID WHERE (PRD.Class IS NOT NULL)"&amp;gt;
        &amp;lt;/asp:SqlDataSource&amp;gt;
    &amp;lt;/div&amp;gt;
    &amp;lt;/form&amp;gt;
&amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Default.aspx sayfası i&amp;ccedil;erisinde yer alan GridView kontrol&amp;uuml;, Product ve ProductSubCategory tablolarının birleşiminden bir sonu&amp;ccedil; k&amp;uuml;mesine ait satırları g&amp;ouml;stermek &amp;uuml;zere tasarlanmıştır. S&amp;ouml;z konusu sonu&amp;ccedil; k&amp;uuml;mesi elde edilirken Name ve Class alanındaki boşlukların alınması i&amp;ccedil;in &lt;strong&gt;Replace&lt;/strong&gt; ve &lt;strong&gt;RTrim&lt;/strong&gt; isimli T-SQL fonksiyonlarına başvurulmaktadır. GridView bileşenine dikkat edilecek olursa i&amp;ccedil;eride &lt;strong&gt;HyperLinkField&lt;/strong&gt; tipinden bir kontrol kullanılmaktadır. Bu kontrol&amp;uuml;n dikkate değer &amp;ouml;zelliği ise &lt;strong&gt; DataNavigateUrlFormatString&lt;/strong&gt; niteliğidir. Sayfa &amp;ccedil;alışma zamanında aşağıdakine benzer bir sonu&amp;ccedil; verecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk217_6.gif" alt="" width="386" height="424" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edilecek olursa bağlantıların(Links) hedef URL bilgisi, &lt;strong&gt;HyperLinkField&lt;/strong&gt; kontrol&amp;uuml;n&amp;uuml;n &lt;strong&gt;DataNavigateUrlFormatString&lt;/strong&gt; niteliğinin değerine g&amp;ouml;re şekillenmektedir. S&amp;ouml;z gelimi, &amp;ouml;rnek ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer aldığı gibi M sınıfındaki Bottom Brackets &amp;uuml;r&amp;uuml;nleri i&amp;ccedil;in URL bilgisi aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;http://localhost:1292/UrlRewriting/Urunler/BottomBrackets/M/Goster.aspx&lt;/pre&gt;
&lt;p&gt;Dikkat edilecek olursa bu URL bilgisinin Urunler kelimesinden itibaren olan kısmı &amp;ccedil;ok daha okunaklı ve anlamlıdır. Peki biz bu linke tıkladığımızda Bottom Brackets kategorisinde ve M sınıfında yer alan &amp;uuml;r&amp;uuml;nlerin listesi nasıl elde edilebilir. Bu işlemin Urunler.aspx gibi bir sayfa i&amp;ccedil;erisinde ele alınması d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml; takdirde, se&amp;ccedil;ilen bağlantı bilgisine g&amp;ouml;re ilgili kategori ve sınıf bilgilerinin sorgu katarı&lt;strong&gt;(QueryString) &lt;/strong&gt;ile diğer sayfaya g&amp;ouml;nderilmesi gerekmektedir. Buda &amp;ccedil;ok doğal olarak, default.aspx sayfasında se&amp;ccedil;ilen URL bilgisine eş d&amp;uuml;şecek asıl URL bilgisinin tanımlanması ile m&amp;uuml;mk&amp;uuml;n olabilir. İşte bu noktada, Urunler.aspx sayfasını tasarlamadan &amp;ouml;nce, &lt;strong&gt;web.config&lt;/strong&gt; i&amp;ccedil;erisinde aşağıdaki ilaveler yapılmalıdır.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0"?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;appSettings/&amp;gt;
    &amp;lt;connectionStrings&amp;gt;
        &amp;lt;add name="AdvConStr" connectionString="Data Source=.;Initial Catalog=AdventureWorks;Integrated Security=True" providerName="System.Data.SqlClient"/&amp;gt;
    &amp;lt;/connectionStrings&amp;gt;
    &amp;lt;system.web&amp;gt;
        &amp;lt;urlMappings enabled="true"&amp;gt;
            &amp;lt;add url="~/Urunler/BottomBrackets/H/Goster.aspx" mappedUrl="~/Urunler.aspx?AltKategoriId=5&amp;amp;AltKategoriAdi=Bottom%20Brackets&amp;amp;Sinifi=H"/&amp;gt;
            &amp;lt;add url="~/Urunler/BottomBrackets/L/Goster.aspx" mappedUrl="~/Urunler.aspx?AltKategoriId=5&amp;amp;AltKategoriAdi=Bottom%20Brackets&amp;amp;Sinifi=L"/&amp;gt;
            &amp;lt;add url="~/Urunler/BottomBrackets/M/Goster.aspx" mappedUrl="~/Urunler.aspx?AltKategoriId=5&amp;amp;AltKategoriAdi=Bottom%20Brackets&amp;amp;Sinifi=M"/&amp;gt;
            &amp;lt;add url="~/Urunler/Cranksets/H/Goster.aspx" mappedUrl="~/Urunler.aspx?AltKategoriId=5&amp;amp;AltKategoriAdi=Cranksets&amp;amp;Sinifi=H"/&amp;gt;
        &amp;lt;/urlMappings&amp;gt;
        &amp;lt;compilation debug="true"/&amp;gt;
        &amp;lt;authentication mode="Windows"/&amp;gt;
    &amp;lt;/system.web&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;URL eşleştirmeleri i&amp;ccedil;in system.web elementi i&amp;ccedil;erisinde yer alan &lt;strong&gt;urlMappings&lt;/strong&gt; boğumu kullanılmaktadır. Bu boğumda, &lt;strong&gt;add&lt;/strong&gt; elementi i&amp;ccedil;erisinde yer alan &lt;strong&gt;url&lt;/strong&gt; ve &lt;strong&gt;mappedUrl&lt;/strong&gt; nitelikleri ilede gereken eşleştirmeler yapılmaktadır. Buna g&amp;ouml;re, &lt;strong&gt;~/Urunler/BottomBrackets/M/Goster.aspx&lt;/strong&gt; gibi bir talep geldiğinde bu, &lt;strong&gt;~/Urunler.aspx?AltKategoriId=5&amp;amp;amp;AltKategoriAdi=Bottom%20Brackets&amp;amp;amp;Sinifi=M &lt;/strong&gt;olarak algılanacaktır. &amp;amp; operat&amp;ouml;r&amp;uuml;n&amp;uuml;n ele alınması sırasında &amp;amp;amp; ifadesinin kullanılmasına dikkat etmek gerekir. Eğer &amp;amp; işareti kullanılırsa derleme zamanıda hata mesajı alınır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk217_10.gif" alt="" width="619" height="123" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Artık gerekli bildirimler yapıldığına g&amp;ouml;re Urunler.aspx sayfası aşağıdaki gibi tasarlanabilir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" %&amp;gt;

&amp;lt;!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"&amp;gt;

&amp;lt;script runat="server"&amp;gt;
    protected void Page_Load(object sender, EventArgs e)
    {
        lblAltKategoriAdi.Text = Request.QueryString["AltKategoriAdi"]!=null?Request.QueryString["AltKategoriAdi"].ToString():"";
        lblSinifi.Text = Request.QueryString["Sinifi"]!=null?Request.QueryString["Sinifi"].ToString():"";
    } 
&amp;lt;/script&amp;gt;

&amp;lt;html xmlns="http://www.w3.org/1999/xhtml" &amp;gt;
&amp;lt;head runat="server"&amp;gt;
    &amp;lt;title&amp;gt;Kategori ve sınıf bazlı &amp;uuml;r&amp;uuml;nler&amp;lt;/title&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body&amp;gt;
    &amp;lt;form id="form1" runat="server"&amp;gt;
    &amp;lt;div&amp;gt;
        &amp;lt;asp:Label ID="lblAltKategoriAdi" runat="server" Font-Bold="True" Font-Size="X-Large" Font-Underline="True" ForeColor="#C00000"&amp;gt;&amp;lt;/asp:Label&amp;gt;
        Alt Kategorisi
        &amp;lt;asp:Label ID="lblSinifi" runat="server" Font-Bold="True" Font-Size="X-Large" Font-Underline="True" ForeColor="#C00000"&amp;gt;&amp;lt;/asp:Label&amp;gt; sınıfı&amp;lt;br /&amp;gt;
        &amp;lt;br /&amp;gt;
        &amp;lt;asp:GridView ID="grdUrunler" runat="server" AutoGenerateColumns="False" DataKeyNames="ProductId" DataSourceID="dsProducts"&amp;gt;
            &amp;lt;Columns&amp;gt;
                &amp;lt;asp:BoundField DataField="ProductId" HeaderText="ProductId" InsertVisible="False" ReadOnly="True" SortExpression="ProductId" /&amp;gt;
                    &amp;lt;asp:BoundField DataField="Name" HeaderText="Name" SortExpression="Name" /&amp;gt;
                    &amp;lt;asp:BoundField DataField="ListPrice" HeaderText="ListPrice" SortExpression="ListPrice" /&amp;gt;
                    &amp;lt;asp:BoundField DataField="Class" HeaderText="Class" SortExpression="Class" /&amp;gt;
                    &amp;lt;asp:BoundField DataField="SellStartDate" HeaderText="SellStartDate" SortExpression="SellStartDate" /&amp;gt;
            &amp;lt;/Columns&amp;gt;
        &amp;lt;/asp:GridView&amp;gt;
        &amp;lt;asp:SqlDataSource ID="dsProducts" runat="server" ConnectionString="&amp;lt;%$ ConnectionStrings:AdvConStr %&amp;gt;" SelectCommand="Select ProductId,Name,ListPrice,Class,SellStartDate From Production.Product Where ProductSubCategoryId=@SubCatId and Class=@Class"&amp;gt;
            &amp;lt;SelectParameters&amp;gt;
                &amp;lt;asp:QueryStringParameter DefaultValue="1" Name="SubCatId" QueryStringField="AltKategoriId" /&amp;gt;
                &amp;lt;asp:QueryStringParameter DefaultValue="M" Name="Class" QueryStringField="Sinifi" /&amp;gt;
            &amp;lt;/SelectParameters&amp;gt;
        &amp;lt;/asp:SqlDataSource&amp;gt;
    &amp;lt;/div&amp;gt;
    &amp;lt;/form&amp;gt;
&amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu sayfa sadece &lt;strong&gt;QueryString&lt;/strong&gt; ile gelen parametreler değerlendirmekte ve buna g&amp;ouml;re belirli bir alt kategori ve sınıfa ait &amp;uuml;r&amp;uuml;nlerin bazı alanlarının listelenmesini sağlamaktadır. Bu ama&amp;ccedil;la yine &lt;strong&gt;GridView&lt;/strong&gt; ve &lt;strong&gt;SqlDataSource&lt;/strong&gt; kontrollerinden yararlanılmış ve uygun sorgu c&amp;uuml;mleleri kullanılmıştır. &amp;Ouml;rnek senaryoda yer alan Bottom Brockets alt kategorisi ve M sınıfı se&amp;ccedil;ilirse, Urunler.aspx sayfasında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan &amp;ccedil;ıktılar elde edilecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk217_5.gif" alt="" width="471" height="203" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Yukarıdaki &amp;ccedil;ıktıya dikkat edilecek olursa URL satırı bizim belirlediğimiz şekilde kalmıştır. Bu &amp;ccedil;ıktının aynısını elde etmek i&amp;ccedil;in halen daha &lt;strong&gt;sorgu katarı(QueryString)&lt;/strong&gt; ifadeleride a&amp;ccedil;ık&amp;ccedil;a kullanılabilir. Aynı web uygulamasında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan URL talebi, aynı sonu&amp;ccedil;ları verecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk217_4.gif" alt="" width="636" height="197" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Ne varki halen daha bazı problemler vardır. Herşeyden &amp;ouml;nce en azından s&amp;ouml;z konusu senaryo g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında, var olabilecek t&amp;uuml;m olasılıklar i&amp;ccedil;in web.config dosyasına teker teker URL eşleştirmelerinin eklenmesi gerekmektedir. Bir geliştirici olarak bunun kod i&amp;ccedil;erisinden daha etkili bir şekilde ele alınması &amp;ccedil;ok doğal bir istektir. Neyseki Asp.Net 2.0 ile gelen g&amp;uuml;&amp;ccedil;l&amp;uuml; Configuration API alt yapısı sayesinde istersek, kod i&amp;ccedil;erisinde &lt;strong&gt;urlMappings&lt;/strong&gt; kısmına dinamik olarak yeni &lt;strong&gt;elemanlar(elements)&lt;/strong&gt; ekleyebilir, d&amp;uuml;zenleyebilir ve &amp;ccedil;ıkartabiliriz. Bu ama&amp;ccedil;la bir admin sayfası veya farklı bir uygulama olacak şekilde bir admin paneli dahi g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir.(&lt;em&gt;&lt;strong&gt;Configuration API'&lt;/strong&gt; sinin y&amp;ouml;netiminin daha detaylı bir şekilde &amp;ouml;ğrenmek isterseniz daha &amp;ouml;nce yazılmış olan bir &lt;span style="font-family: Verdana; color: #ff0000;"&gt;&lt;strong&gt;&lt;a href="http://www.bsenyurt.com/MakaleGoster.aspx?ID=163"&gt;makaleden&lt;/a&gt;&lt;/strong&gt; yararlanabilirsiniz.&lt;/span&gt;&lt;/em&gt;) Bunun i&amp;ccedil;in aşağıdaki gibi bir sayfa tasarladığımızı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" %&amp;gt;
&amp;lt;%@ Import Namespace="System.Data" %&amp;gt;
&amp;lt;%@ Import Namespace="System.Data.SqlClient" %&amp;gt;
&amp;lt;%@ Import Namespace="System.Web.Configuration" %&amp;gt;

&amp;lt;!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"&amp;gt;

&amp;lt;script runat="server"&amp;gt;

    private static void AddMappings()
    {
        Configuration cfg = ConfigurationManager.OpenExeConfiguration("");
        UrlMappingsSection urlMapSct = (UrlMappingsSection)cfg.GetSection("system.web/urlMappings");
        urlMapSct.UrlMappings.Clear();

        string query = "SELECT DISTINCT PSC.ProductSubcategoryID, PSC.Name,PRD.Class FROM Production.ProductSubcategory AS PSC INNER JOIN Production.Product AS PRD ON PSC.ProductSubcategoryID = PRD.ProductSubcategoryID WHERE (PRD.Class IS NOT NULL) ORDER BY PSC.Name, PRD.Class";

        using (SqlConnection conn = new SqlConnection(cfg.ConnectionStrings.ConnectionStrings["AdvConStr"].ConnectionString))
        {
            SqlCommand cmd = new SqlCommand(query, conn);
            conn.Open();
            string url = "", mappedUrl = "";
    
            SqlDataReader reader = cmd.ExecuteReader();
            while (reader.Read())
            {
                url = "~/Urunler/" + reader.GetString(1).Replace(" ","") + "/" + reader.GetString(2).Replace(" ","") + "/Goster.aspx";
                mappedUrl = "~/Urunler.aspx?AltKategoriId=" + reader["ProductSubCategoryID"].ToString() + "&amp;amp;AltKategoriAdi=" + reader["Name"].ToString() + "&amp;amp;Sinifi=" + reader["Class"].ToString();
                UrlMapping map = new UrlMapping(url, mappedUrl);
                urlMapSct.UrlMappings.Add(map);
            }
            reader.Close();
        }
        cfg.Save();
    }

    protected void btnMappEkle_Click(object sender, EventArgs e)
    {
        AddMappings();
    } 

&amp;lt;/script&amp;gt;

&amp;lt;html xmlns="http://www.w3.org/1999/xhtml" &amp;gt;
    &amp;lt;head runat="server"&amp;gt;
        &amp;lt;title&amp;gt;Yonetici Sayfasi&amp;lt;/title&amp;gt;
    &amp;lt;/head&amp;gt;
    &amp;lt;body&amp;gt;
        &amp;lt;form id="form1" runat="server"&amp;gt;
            &amp;lt;div&amp;gt;
                &amp;lt;asp:Button ID="btnMappEkle" runat="server" Text="G&amp;uuml;ncel URL Eşleştirmelerini Ekle" OnClick="btnMappEkle_Click" /&amp;gt;
            &amp;lt;/div&amp;gt;
        &amp;lt;/form&amp;gt;
    &amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Şimdi burada geliştirdiğimiz kodları kısaca inceleyelim. Configuration alt yapısına g&amp;ouml;re, web.config dosyası i&amp;ccedil;erisinde bilinen hemen her &lt;strong&gt;boğumun(Node)&lt;/strong&gt; birer &lt;strong&gt;y&amp;ouml;netimli tip(Managed Type) &lt;/strong&gt;karşılığı vardır. Buradaki tipimiz &lt;strong&gt;UrlMappingsSection&lt;/strong&gt; sınıfıdır. UrlMappingsSection sınıfıda Asp.Net 2.0 ile birlikte gelmiş bir sınıftır. Sınıf diagramından ele alındığında UrlMappingsSection sınıfının Framework i&amp;ccedil;erisindeki yeri aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk217_11.gif" alt="" width="362" height="425" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi UrlMappingsSection sınıfının &lt;strong&gt;UrlMappings&lt;/strong&gt; &amp;ouml;zelliği aslında UrlMapping tipinden elemanlar taşıyan &amp;ouml;zel bir koleksiyonu&lt;strong&gt;(UrlMappingCollection)&lt;/strong&gt; işaret etmektedir. Yeni bir &lt;strong&gt;UrlMapping&lt;/strong&gt; nesne &amp;ouml;rneği eklenmek istendiğinde bu koleksiyondan yararlanılır. Bu koleksiyondaki elemanları oluşturan UrlMapping tipinin Framework i&amp;ccedil;erisindeki yeri ise aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk217_12.gif" alt="" width="354" height="390" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu tipi o anki web.config dosyasından elde etmek amacıyla Configuration nesne &amp;ouml;rneğinin &lt;strong&gt;GetSection&lt;/strong&gt; metodu kullanılmaktadır. Bu metod bilindiği gibi &lt;strong&gt;XPath&lt;/strong&gt; ifadelerini parametre olarak alır.&lt;em&gt;(XPath ile ilgili detaylı bilgiyi daha &amp;ouml;nceki bir &lt;/em&gt;&lt;em&gt;&lt;strong&gt;&lt;a href="http://www.bsenyurt.com/MakaleGoster.aspx?ID=147"&gt;makalemizden&lt;/a&gt;&lt;/strong&gt; edinebilirsiniz) &lt;/em&gt;Sonrasında ise veritabanından yapılan sorgu sonucu elde edilen veri k&amp;uuml;mesine g&amp;ouml;re &lt;strong&gt;url&lt;/strong&gt; ve &lt;strong&gt;mappedUrl&lt;/strong&gt; değerleri oluşturulur. Bu değişkenler, her bir satır i&amp;ccedil;in &lt;strong&gt;web.config&lt;/strong&gt; dosyasına eklenecek &lt;strong&gt;UrlMapping&lt;/strong&gt; tiplerinin &lt;strong&gt;yapıcı metodlarına(Constructor)&lt;/strong&gt; parametre olarak verilmektedir. Son olarak oluşan UrlMapping nesne &amp;ouml;rneği, &lt;strong&gt;Add&lt;/strong&gt; metodu ile web.config/urlMappings elementi i&amp;ccedil;erisindeki yerini almaktadır.&lt;/p&gt;
&lt;p&gt;Elbette, bellek &amp;uuml;zerinde yapılan bu değişikliklerin kalıcı olması adına &lt;strong&gt;Configuration&lt;/strong&gt; tipinin &lt;strong&gt;Save&lt;/strong&gt; metodu kullanılmaktadır. Dikkat edilmesi gereken noktalardan biriside URL değeri oluşturulurken &lt;strong&gt;Replace&lt;/strong&gt; metodu ile Name ve Class alanlarındaki boşlukların alınmasıdır. Eğer s&amp;ouml;z konusu boşluklar alınmassa (&amp;ouml;zellike Class alanlarındakiler alınmassa) bu linklere tıklandığında &amp;ccedil;alışma zamanında sayfaların bulunamadığına dair hata mesajları alınabilir. Bu aynı zamanda, URL i&amp;ccedil;erisinde ge&amp;ccedil;ersiz olabilecek karakterler var ise bunlarında &amp;ccedil;ıkartılması veya değiştirilmesi gerektiği anlamınada gelmektedir. &amp;Ouml;rneğin boşlukar &amp;ccedil;oğunlukla URL satırına %20 şeklinde aktarılırlar. Ancak &amp;ouml;rnekteki URL bilgisinde klas&amp;ouml;r tabanlı bir yaklaşım tercih edildiğinden b&amp;uuml;t&amp;uuml;n boşlukların &amp;ccedil;ıkartılması yolu tercih edilmiştir. Bu işlemlerin arkasından Admin sayfası &amp;ccedil;alıştırılır ve d&amp;uuml;ğme tıklanırsa web.config dosyasının aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi değiştiği g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk217_7.gif" alt="" width="591" height="560" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edilecek olursa, elde edilen veri k&amp;uuml;mesine g&amp;ouml;re, s&amp;ouml;z konusu olabilecek t&amp;uuml;m URL eşleştirmeleri ilave edilmiştir. Configuration API'si sağolsun :) Şimdi default.aspx sayfası &amp;ccedil;ağırılırsa, artık GridView kontrol&amp;uuml; i&amp;ccedil;erisindeki her bir bağlantının karşılığının olduğu ve &amp;ccedil;alıştığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r. Default.aspx i&amp;ccedil;in &amp;ouml;rnek g&amp;ouml;r&amp;uuml;nt&amp;uuml; aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk217_8.gif" alt="" width="344" height="421" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İlgili bağlantının tıklanması sonrası ise aşağıdaki sonu&amp;ccedil;lara benzer &amp;ccedil;ıktılar elde edilebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk217_9.gif" alt="" width="456" height="216" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Buraya kadar &amp;ouml;rnek bir senaryo &amp;uuml;zerinden URL eşleştirmesini incelemeye &amp;ccedil;alıştık. Son teknikte dinamik olarak URL eşleştirmelerini ekledik. Bu teknik her ne kadar g&amp;ouml;ze hoş gelsede dezavantajıda vardır. &amp;Ouml;yleki, veri kaynağında değişiklikler yapıldığında &amp;ouml;rneğin Alt kategori adı değiştiğinde yada yenileri eklendiğinde web.config dosyası i&amp;ccedil;erisinde yeni d&amp;uuml;zenlemelerin yapılması, bir başka deyişle ilgili fonksiyonun tekrardan &amp;ccedil;ağırılması gerekcektir. Bu &amp;ccedil;eşitli teknikler ile &amp;ccedil;&amp;ouml;z&amp;uuml;lebilir ama yinede d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmesi gereken bir adımdır.&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil; olarak Asp.Net 2.0 ile birlikte gelen &lt;strong&gt;urlMappings&lt;/strong&gt; elementi her ne kadar bazı avantajlar sağlasada &amp;ccedil;eşitli kısıtlamalarda i&amp;ccedil;ermektedir. Regular Expression ifadeleri kullanılamadığından, her bir URL i&amp;ccedil;in gereken eşleştirmeler teker teker web.config dosyası i&amp;ccedil;erisinde yazılmalıdır. Ger&amp;ccedil;i &lt;strong&gt;Configuration API'&lt;/strong&gt; si yardımıyla bu bir nebzede olsa aşılabilmektedir ancak &lt;strong&gt;Regular Expression'&lt;/strong&gt;ın yerini tam anlamıyla tutmamaktadır. Regular Expression desteği i&amp;ccedil;in geliştiricinin &amp;ouml;zel &lt;strong&gt;HttpModule&lt;/strong&gt; ve &lt;strong&gt;HttpHandler&lt;/strong&gt; tiplerini geliştirmesi gerekliliği ise bir zorluktur. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/UrlRewriting.zip"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2007-08-07 12:00:00</pubDate>
  <slug>Asp-Net-2-0-URL-Rewriting-Hakkc4b1nda-Gercekler-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet</tag>
    <tag>url-rewriting</tag>
    <tag>url-routing</tag>
    <tag>url</tag>
  </tags>
  <categories>
    <category>Asp.Net</category>
  </categories>
</post>