<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>VSTS 2008 için Custom Check-In Policy Geliştirmek</title>
  <description>Bir süredir Team Foundation Server üzerinde ve doğal olarak Visual Studio Team System 2008 geliştirme ortamında çalışmaktayım. Tabi uzun yıllar Visual Source Safe ile vakit geçirmenin sonucunda, TFS ile birlikte gelen pek çok nimetin farkına çok geç varabiliyoruz.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f8%2fblg58_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir s&amp;uuml;redir &lt;strong&gt;Team Foundation&lt;/strong&gt; &lt;strong&gt;Server&lt;/strong&gt; &amp;uuml;zerinde ve doğal olarak &lt;strong&gt;Visual Studio Team System 2008&lt;/strong&gt;&amp;nbsp;geliştirme ortamında&amp;nbsp;&amp;ccedil;alışmaktayım. Tabi uzun yıllar &lt;strong&gt;Visual Source Safe&lt;/strong&gt; ile vakit ge&amp;ccedil;irmenin sonucunda, &lt;strong&gt;TFS&lt;/strong&gt; ile birlikte gelen pek &amp;ccedil;ok nimetin farkına &amp;ccedil;ok ge&amp;ccedil; varabiliyoruz. Herşeyden &amp;ouml;nce TFS'in,&amp;nbsp;&lt;strong&gt;MSF(Microsoft Solution Framework) &lt;/strong&gt;ve &lt;strong&gt;CMMI(Capability Maturity Model Integration)&lt;/strong&gt; gibi yazılım geliştirme s&amp;uuml;re&amp;ccedil; modellerinin uygulanabildiği profesyonel bir &amp;ccedil;evre sağladığını bilmemiz gerekiyor.&lt;/p&gt;
&lt;p&gt;İşin i&amp;ccedil;erisine &lt;strong&gt;Reporting Services'&lt;/strong&gt; ile etkili raporlama, &lt;strong&gt;SharePoint&lt;/strong&gt; ile tutarlı, &amp;ouml;l&amp;ccedil;eklenebilir d&amp;ouml;k&amp;uuml;man y&amp;ouml;netimi gibi pek &amp;ccedil;ok yararlı &amp;uuml;r&amp;uuml;nde giriyor.&amp;nbsp;Tabiki bu tip sistemlerin uygulanması her zaman kolay değildir. Her şeyden &amp;ouml;nce bir &amp;ouml;ğrenme s&amp;uuml;reci i&amp;ccedil;in geliştirme ekibinin ciddi&amp;nbsp;zaman ayrılması şarttır. &amp;Ouml;yleki, model i&amp;ccedil;erisinde &lt;strong&gt;&amp;ccedil;evik(Agile)&lt;/strong&gt; s&amp;uuml;re&amp;ccedil;lerin uygulanabilirliği s&amp;ouml;z konusudur ki bunlarda başlı başlına birer konsepttir.&lt;/p&gt;
&lt;p&gt;Biz bu yazımızda &lt;strong&gt;Visual Studio Team System 2008&lt;/strong&gt; ile &amp;ccedil;alışırken, &amp;ouml;zel &lt;strong&gt;Check-In ilkelerinin(Custom Check-In Policy)&lt;/strong&gt;&amp;nbsp;nasıl geliştirilebileceğini basit bir &amp;ouml;rnek &amp;uuml;zerinden ele almaya &amp;ccedil;alışacağız. Genellikle yazılım projelerinde g&amp;ouml;rev alan geliştiricilerin, en alt kademeden en &amp;uuml;st kademeye doğru &amp;ccedil;ıktık&amp;ccedil;a&lt;strong&gt;(Junior -&amp;gt; Architect)&lt;/strong&gt; &amp;ccedil;ok daha az sayıda&lt;strong&gt; Check-In&lt;/strong&gt; yaptıkları g&amp;ouml;r&amp;uuml;lebilir&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Bu aslında iyi yazılım geliştirme s&amp;uuml;re&amp;ccedil;lerinde bir kural olarak değerlendirilmesi gereken durumlardandır. S&amp;ouml;z gelimi bir projenin mesai sonunda eğer derlenemiyorsa Check-In' lenmemesi&lt;em&gt;(ki bunu VSTS &amp;uuml;zerinden vereceğiniz hazır bir Policy ile kolayca garantileyebilirsiniz),&lt;/em&gt; g&amp;uuml;n i&amp;ccedil;inde belkide 1 en fazla 2 Check-In yapılmasına izin verilmesi, &amp;ouml;zellikle versiyon takibi a&amp;ccedil;ısından da son derece &amp;ouml;nemlidir. Peki &lt;strong&gt;VSTS&lt;/strong&gt; tarafından bizlere sunulan hazır &lt;strong&gt;Check-In&lt;/strong&gt; ilkeleri&lt;strong&gt;(Builds, Code Analysis, Testing Policy, Work Items)&lt;/strong&gt; dışında kendi &amp;ouml;zel politikalarımızı nasıl geliştirebilir ve projeye uygulayabiliriz?&lt;/p&gt;
&lt;p&gt;Aslında burada ama&amp;ccedil;, &lt;strong&gt;VSTS'&lt;/strong&gt; in dış ortama sunulan bazı aray&amp;uuml;zlerini kullanarak kendisine&amp;nbsp;yeni davranışlar&amp;nbsp;ekleyebilmektir. Yani bir &lt;strong&gt;Plug-In&lt;/strong&gt; modeli ile karşı karşıya olduğumuzu d&amp;uuml;ş&amp;uuml;nebiliriz. Dilerseniz bu fikirden yola &amp;ccedil;ıkalım. İşe ilk olarak basit bir &lt;strong&gt;Class Library&lt;/strong&gt; geliştirerek başlamamız gerekiyor. S&amp;ouml;z konusu sınıf k&amp;uuml;t&amp;uuml;phanesine, &lt;strong&gt;Microsoft.TeamFoundation.Version.Client&lt;/strong&gt;&amp;nbsp;isimli referansın eklenmesi gerekmektedir. Bu referans varsayılan kuruluma g&amp;ouml;re&amp;nbsp;&lt;strong&gt;C:\Program Files\Microsoft Visual Studio 9.0\Common7\IDE\PrivateAssemblies&lt;/strong&gt; klas&amp;ouml;r&amp;uuml; altında bulunmaktadır. Refernasların eklenmesinin arından, &lt;strong&gt;PolicyBase&lt;/strong&gt; isimli tipten t&amp;uuml;retilen bir sınıfın geliştirilmesi ve bunun i&amp;ccedil;erisinde gerekli &amp;uuml;yelerin &lt;strong&gt;ezilmesi(Override)&lt;/strong&gt; gerekmektedir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizde, &lt;strong&gt;TFS&lt;/strong&gt; &amp;uuml;zerindeki bir projeye eklenen dosyaların oluşturulduktan sonra, ne kadar s&amp;uuml;re sonra&lt;strong&gt; Check-In' &lt;/strong&gt;lenebileceklerine dair bir ilke tanımlamaya &amp;ccedil;alışıyor olacağız. Eğer oluşturulma zamanı, g&amp;uuml;n değerinden k&amp;uuml;&amp;ccedil;&amp;uuml;k ise&lt;strong&gt; Check-In&lt;/strong&gt; işlemi yapılırken &lt;strong&gt;uyarı(Warning)&lt;/strong&gt; mesajı verilmesini sağlayacağız. Bununla birlikte&amp;nbsp;istenirse &lt;strong&gt;Check-In&lt;/strong&gt; i&amp;ccedil;in gerekli g&amp;uuml;n sayısını belirleyebileceğimiz basit bir&amp;nbsp;iletişim penceremizde olacak.&amp;nbsp;B&amp;ouml;ylece istenirse g&amp;uuml;n bazındaki Timeout s&amp;uuml;resi &lt;strong&gt;Edit&lt;/strong&gt; se&amp;ccedil;eneği ile değiştirilebilir olacak.&amp;nbsp;Bu tabiki tamamen sembolik bir &amp;ouml;rnek. &lt;em&gt;(Bazı kaynaklarda Check-In lenecek dosyalar i&amp;ccedil;erisinde yasaklı kelimelerin bulunmasının &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ilmesi veya kod standartlarından &amp;ccedil;ok &amp;ouml;zel olan bazılarına uyulmadığı durumlarının ele alınması i&amp;ccedil;in geliştirilen ilkeler yer almaktadır. Sizde projeninizin ihtiyacı olan ilkeleri modelleyebilirsiniz.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizde yer alan Timeout isimli sınıfa ait&amp;nbsp;kod yapısı aşağıda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using Microsoft.TeamFoundation.VersionControl.Client;
using System.Windows.Forms;

namespace TimeoutPolicy
{
    [Serializable] // Serileştirilebilir olma şartı
    public class Timeout
        : PolicyBase // Custom policy yazmak i&amp;ccedil;in PolicyBase tipinden t&amp;uuml;retme yapmak gerekmektedir
    {
        // Minimum Check-In s&amp;uuml;resi        
        public int TimeoutDay { get; set; }

        public Timeout()
        {
            TimeoutDay=1;
        }

        public override string Description
        {
            get { return "Bir Check-In işlemi yapılması i&amp;ccedil;in, dosyanın ilk oluşturulmasından sonra ge&amp;ccedil;mesi gereken minimum g&amp;uuml;n s&amp;uuml;resi kontrol&amp;uuml;n&amp;uuml; yapar"; }
        }

        // Policy i&amp;ccedil;erisinde yer alan g&amp;uuml;n değeri istenirse editlenebilir
        public override bool Edit(IPolicyEditArgs policyEditArgs)
        {
            // G&amp;uuml;n değerini almak i&amp;ccedil;in InputDayForm a&amp;ccedil;ılır
            // InputDayForm sınıfının yapıcı metoduna o anki Timeout sınıfının referansı g&amp;ouml;nderilir. B&amp;ouml;ylece form i&amp;ccedil;erisinde this referansına ait g&amp;uuml;n değeri set edilebilir.
            InputDayForm inputForm = new InputDayForm(this);
            inputForm.ShowDialog();
            return true;
        }

        // Policy kontrol&amp;uuml;n&amp;uuml;n yapıldığı yerdir. Geriye var ise hata bildirimlerini d&amp;ouml;nd&amp;uuml;r&amp;uuml;r
        public override PolicyFailure[] Evaluate()
        {
            List&amp;lt;PolicyFailure&amp;gt; failures = new List&amp;lt;PolicyFailure&amp;gt;();

            // Şu an beklemede olan t&amp;uuml;m PendingChange referansları dolaşılır
            foreach (var item in PendingCheckin.PendingChanges.AllPendingChanges)
            {                
                // Eğer değişiklik &amp;ouml;rneğin bir dosya ile ilgiliyse
               if(item.ItemType== ItemType.File)
               {                   
                   // Dosyanın oluşturulma tarihi ile g&amp;uuml;ncel tarih arasındaki farka bakılır
                   TimeSpan distance = DateTime.Now - item.CreationDate;
                   // Fark var ise
                   if (distance.TotalDays &amp;lt; TimeoutDay)
                   {                       
                       failures.Add(
                           new PolicyFailure(String.Format("{0} tarihli {1} i&amp;ccedil;in Check-In s&amp;uuml;resi dolmamış. L&amp;uuml;tfen {2} g&amp;uuml;n bekleyiniz",item.CreationDate,item.FileName,TimeoutDay), this)
                           ); // Bir PolicyFailure nesnesi &amp;ouml;rneklenir ve mesaj bilgisi yazdırırılır.
                   }
                }
            }

            if (failures.Count &amp;gt; 0)
                return failures.ToArray();
            else
                return null;
        }

        public override string Type
        {
            get { return "Chech-In Timeout(Day)"; }
        }

        public override string TypeDescription
        {
            get { return "G&amp;uuml;n bazlı Check-In s&amp;uuml;resi"; }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Timeout&lt;/strong&gt; sınıfı &lt;strong&gt;serileştirilebilir(Serializable)&lt;/strong&gt; olarak tanımlanmalıdır. Ayrıca &lt;strong&gt;PolicyBase&lt;/strong&gt; tipinden t&amp;uuml;remelidir. T&amp;uuml;reme sonucu &lt;strong&gt;ezilmesi(Override)&lt;/strong&gt; gereken bazı &amp;uuml;yeler olduğu g&amp;ouml;r&amp;uuml;lmektedir. Bunlardan belkide en &amp;ouml;nemlisi &lt;strong&gt;Evaluate&lt;/strong&gt; isimli metoddur. Bu metod i&amp;ccedil;erisinde, senaryoda yer alan ilkenin uygulanması ve ilkenin aşılması halinde geriye &lt;strong&gt;PolicyFailure&lt;/strong&gt; tipinden uyarı mesajlarının bir dizi şeklinde d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi sağlanmaktadır. Bizim &amp;ouml;rneğimizde dikkat edileceği &amp;uuml;zere beklemede olan t&amp;uuml;m &lt;strong&gt;Check-In'&lt;/strong&gt; ler i&amp;ccedil;erisinde tipi &lt;strong&gt;File&lt;/strong&gt; olanlar ele alınmakta ve &lt;strong&gt;CreationDate&lt;/strong&gt; &amp;ouml;zelliklerinin değerlerine bakılmaktadır. Eğer bu değer &lt;strong&gt;Timeout&lt;/strong&gt; sınıfının kendi &amp;ouml;zelliği olan &lt;strong&gt;TimeoutDay&lt;/strong&gt; değerinden k&amp;uuml;&amp;ccedil;&amp;uuml;k ise &lt;strong&gt;PolicyFailure&lt;/strong&gt; oluşturulmaktadır. Ezilen diğer bir metodda &lt;strong&gt;Edit&lt;/strong&gt; fonskiyonudur. Bu fonksiyon ile ilkenin d&amp;uuml;zenlenebilip d&amp;uuml;zenlemeyeceğine karar verilebilir. Biz &amp;ouml;rneğimizde, &lt;strong&gt;TimeoutDay&lt;/strong&gt; &amp;ouml;zelliğinin değerinin değiştirilebileceği basit bir &lt;strong&gt;Windows Form&lt;/strong&gt; kullanıyoruz. InputDayForm isimli bu Windows Form' un&amp;nbsp;g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ve kod i&amp;ccedil;eriği ise şu şekildedir;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg58_WinForm.gif" alt="" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Windows.Forms;

namespace TimeoutPolicy
{
    public partial class InputDayForm : Form
    {
        private Timeout _timeOut;

        public int Day
        {
            get { return Convert.ToInt16(nupDay.Value); }
        }

        public InputDayForm(Timeout timeOut)
        {
            InitializeComponent();
            _timeOut = timeOut;
            nupDay.Value = _timeOut.TimeoutDay;
            btnClose.DialogResult = DialogResult.OK;
        }

        private void btnClose_Click(object sender, EventArgs e)
        {
            _timeOut.TimeoutDay = (Int16)nupDay.Value;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Formumuz oluşturulurken, Timeout referansını almaktadır. B&amp;ouml;ylece Form &amp;uuml;zerindeki NumericUpDown kontrol&amp;uuml;nde yapılan değişimlere g&amp;ouml;re, Timeout i&amp;ccedil;erisindeki TimeoutDay değeri dinamik olarak değiştirilebilir.&lt;/p&gt;
&lt;p&gt;İşlemlerimiz bununla bitmiyor tabiki. Geliştirdiğimiz sınıf k&amp;uuml;t&amp;uuml;phanesinin, &lt;strong&gt;VSTS 2008&lt;/strong&gt; arabiriminde &lt;strong&gt;Team Exlporer&lt;/strong&gt; &amp;uuml;zerinden kullanılabilmesi i&amp;ccedil;in &lt;strong&gt;Registry'&lt;/strong&gt; de ufak bir ekleme yapmamız gerekmektedir &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;Aynen aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg58_RegEditContent.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu ekleme işlemi sırasında dikkat edilmesi gereken noktalardan birisi &lt;strong&gt;Value&lt;/strong&gt; adının &lt;strong&gt;assembly&lt;/strong&gt; adı ile aynı olmasıdır. &lt;strong&gt;Value Data&lt;/strong&gt; kısmında ise dikat edileceği &amp;uuml;zere geliştirdiğimiz sınıf k&amp;uuml;t&amp;uuml;phanesinin fiziki adresi bulunmaktadır. Peki şimdi elimize ne ge&amp;ccedil;ti. &lt;img title="Cool" src="/editors/tiny_mce3/plugins/emotions/img/smiley-cool.gif" alt="Cool" border="0" /&gt;&amp;nbsp;&lt;strong&gt;VSTS 2008&lt;/strong&gt; &amp;uuml;zerinde &lt;strong&gt;Source Settings&lt;/strong&gt; kısmını a&amp;ccedil;ıp(aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi),&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg58_SourceControlSettings.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;yeni bir &lt;strong&gt;Check-In Policy&lt;/strong&gt; eklemek istediğimizde aşağıdaki durum ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg58_AddCheckInPolicy.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi az &amp;ouml;nce geliştirdiğimiz &lt;strong&gt;Custom Check-In Policy&lt;/strong&gt; tipi burada yer almaktadır. &lt;strong&gt;Policy'&lt;/strong&gt; yi ekledikten sonra dilersek &lt;strong&gt;Edit&lt;/strong&gt; d&amp;uuml;ğmesinide kullanabilir ve &lt;strong&gt;TimeoutDay&lt;/strong&gt; &amp;ouml;zelliğinin değerini değiştirebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg58_SourceControl.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;S&amp;uuml;per. Artık durumu test edebiliriz. Ben &lt;strong&gt;TFS&lt;/strong&gt; &amp;uuml;zerindeki &amp;ouml;rnek bir projede bu ayarları yaptıktan ve yeni eklediğim bazı&amp;nbsp;dosyaları &lt;strong&gt;Check-In'&lt;/strong&gt; lemek istedikten sonra aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan&amp;nbsp;uyarılar ile karşılaştım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg58_CheckInPolicyWarnings.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;TimeoutDay&lt;/strong&gt; &amp;ouml;zelliğini 7 g&amp;uuml;n olarak set ettikten sonra başıma neler gelmiş neler ? &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt;&amp;nbsp;Elbette buradaki ilkeleri ezip ge&amp;ccedil;ebiliyoruz bildiğiniz &amp;uuml;zere ama izleri kalıyor... Bu &amp;ouml;rnek ilkeyi&amp;nbsp;uygulanızı &amp;ouml;nermem. Ancak sanıyorumki artık kendi &amp;ouml;zel Check-In ilkelerinizi nasıl geliştirebileceğinizi g&amp;ouml;rd&amp;uuml;n&amp;uuml;z.&amp;nbsp;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekraradan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f8%2fTimeoutPolicy.rar"&gt;TimeoutPolicy.rar (30,07 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-08-07 12:56:00</pubDate>
  <slug>VSTS-2008-icin-Custom-Check-In-Policy-Gelistirmek</slug>
  <tags>
    <tag>vsts-2008</tag>
  </tags>
  <categories>
    <category>Visual Studio</category>
  </categories>
</post>