<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Workflow Foundation 4.0 - Kodlama Zamanında Doğrulama(Validation)</title>
  <description>Bazen nerede duracağımızı bilmemiz gerekir ve bazende, mümkün olduğunca erken durup bazı şeyleri değiştirerek ilerlememiz...Bu teori yazılım geliştirmeninde pek çok noktasında karşımıza çıkmaktadır. Durmamız gereken noktalardan birisi, uygulamaların ürettiği ve önceden fark edebileceğimiz hatalardır(Genellikle Exception' ları düşünebiliriz).</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f12%2fblg110_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bazen nerede duracağımızı bilmemiz gerekir ve bazende, m&amp;uuml;mk&amp;uuml;n olduğunca erken durup bazı şeyleri değiştirerek ilerlememiz...Bu teori yazılım geliştirmeninde pek &amp;ccedil;ok noktasında karşımıza &amp;ccedil;ıkmaktadır. Durmamız gereken noktalardan birisi, uygulamaların &amp;uuml;rettiği ve &amp;ouml;nceden fark edebileceğimiz hatalardır&lt;em&gt;(Genellikle Exception' ları d&amp;uuml;ş&amp;uuml;nebiliriz)&lt;/em&gt;. Ancak bazı olası hataların uygulamaların &amp;ccedil;alışması sırasında değil, &amp;ccedil;alıştırılmaya başlamadan &amp;ouml;nce bilinmesinde hem zaman hemde maliyet kazancı a&amp;ccedil;ısından yarar vardır. Şimdi elimizdeki materyalleri bir d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&amp;Uuml;r&amp;uuml;n geliştirmek i&amp;ccedil;in kullandığımız &lt;strong&gt;Visual Studio&lt;/strong&gt; gibi gelişmiş bir ara&amp;ccedil;, &lt;strong&gt;.Net Framework &lt;/strong&gt;platformu vb...O halde bazı hataların &amp;ccedil;alışma zamanı yerine daha geliştirme aşamasındayken IDE &amp;uuml;zerinde fark edilmesinin &amp;ouml;nemli olduğunu s&amp;ouml;yleyebiliriz. Peki geliştirme safhasında, &amp;ouml;rneğin bir Workflow aktivitesini kullanırken...Hımmmm...Sanırım nereye varmak istediğimi anladınız.&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Bu yazımızda, &amp;ouml;zel aktivite bileşenlerinin kodlama zamanındayken olası hataları nasıl bildirebileceğini ve b&amp;ouml;ylece &lt;strong&gt;doğrulamanın(Validation)&lt;/strong&gt; nasıl sağlanabileceğini incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;Bundan &amp;ouml;nceki yazılarımızda &amp;ouml;zel aktivite bileşenlerimizi nasıl geliştirebileceğimizi incelemeye &amp;ccedil;alışmıştık. Bu ama&amp;ccedil;la yazdığımız &amp;ouml;rneklermizde &lt;strong&gt;CodeActivity&lt;/strong&gt; ve &lt;strong&gt;AsyncCodeActivity&lt;/strong&gt; t&amp;uuml;revli bileşenler geliştirmiştik. &amp;Ouml;zel aktivite bileşenleri geliştirilmesi sırasında dikkat edilmesi gereken &amp;ouml;nemli konulardan biriside kodlama zamanında ger&amp;ccedil;ekleştirilmesini istediğimiz &lt;strong&gt;doğrulama(Validation)&lt;/strong&gt; işlemleridir. Doğrulama i&amp;ccedil;in &lt;strong&gt;Workflow Foundation&amp;nbsp;4.0 &lt;/strong&gt;tarafında kullanılabilen birden fazla teknik bulunmaktadır. &lt;strong&gt;Nitelik(Attribute)&lt;/strong&gt; bazlı kullanım dışında &lt;strong&gt;Imperative&lt;/strong&gt; ve &lt;strong&gt;Declerative&lt;/strong&gt; olaraktan da doğrulama işlemlerini ger&amp;ccedil;ekleştirebiliriz. Aslında konuyu anlamanın en g&amp;uuml;zel yolu &amp;ouml;ncelikli olarak sorunu ortaya koymaktan ge&amp;ccedil;mektedir. Bu sebepten aşağıdaki gibi bir &lt;strong&gt;CodeActivity&lt;/strong&gt; bileşeni tasarladığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Activities;
using System.IO;
using System;
using System.Activities.Expressions;

namespace CustomActivities
{
    public sealed class FileCopy 
        : CodeActivity
    {
        public InArgument&amp;lt;string&amp;gt; Source { get; set; }
        public InArgument&amp;lt;string&amp;gt; Destination { get; set; }

        protected override void Execute(CodeActivityContext context)
        {
            File.Copy(Source.Get(context), Destination.Get(context));
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;FileCopy&lt;/strong&gt; isimli aktivite bileşenimizin g&amp;ouml;revi &lt;strong&gt;Source&lt;/strong&gt; &amp;ouml;zelliğinde belirtilen dosyayı, &lt;strong&gt;Destination&lt;/strong&gt; &amp;ouml;zelliğinde belirtilen yere kopyalamaktır. Bu işlem i&amp;ccedil;in &lt;strong&gt;CodeActivity&lt;/strong&gt; tarafından gelip &lt;strong&gt;ezilen(override)&lt;/strong&gt; &lt;strong&gt;Execute&lt;/strong&gt; metodu i&amp;ccedil;erisinde, &lt;strong&gt;File &lt;/strong&gt;sınıfının &lt;strong&gt;static Copy &lt;/strong&gt;metodundan yararlanılmaktadır. Ne varki bu aktivite bileşeninin &amp;ouml;zellikle &amp;ccedil;alışma zamanında &amp;uuml;reteceği bazı sorunlar vardır. Aslında bunları şimdiden tahmin etmemiz son derece kolaydır.&lt;/p&gt;
&lt;p&gt;Herşeyden &amp;ouml;nce, &lt;strong&gt;InArgument&amp;lt;string&amp;gt;&lt;/strong&gt; tipinden olan &lt;strong&gt;Source&lt;/strong&gt; ve &lt;strong&gt;Destination&lt;/strong&gt; &amp;ouml;zelliklerinin boş ge&amp;ccedil;ilmemesi yani veri ile doldurulması şarttır. Nitekim &lt;strong&gt;null&lt;/strong&gt; verilerin &lt;strong&gt;Copy&lt;/strong&gt; metodu i&amp;ccedil;erisinde kullanılması s&amp;ouml;z konusu olamaz. Diğer yandan &lt;strong&gt;Source&lt;/strong&gt; &amp;ouml;zelliğinde belirtilen dosyanın, sistemde ger&amp;ccedil;ekten var olması gerekmektedir. Dolayısıyla &lt;strong&gt;Source&lt;/strong&gt; &amp;ouml;zelliğinde bir değer olsa bile bunun ge&amp;ccedil;erli bir dosya olup olmadığına bakılmalıdır. &amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; olaraktan &lt;strong&gt;Destination&lt;/strong&gt; &amp;ouml;zelliğinde belirtilen dosya adının ge&amp;ccedil;erli olması ve belkide &lt;strong&gt;Source&lt;/strong&gt; ile belirtilen dosya uzantısında olması gerekmektedir. Hatta hedef dosya zaten var ise &amp;uuml;zerine yazılması durumu s&amp;ouml;z konusudur.&amp;nbsp;Bu vakaların herhangibirinin &amp;ccedil;alışma zamanında ger&amp;ccedil;eklenmesi sonrası &lt;strong&gt;istisnalar(Exceptions)&lt;/strong&gt; ile karşılaşılması ka&amp;ccedil;ınılmazdır. S&amp;ouml;z gelimi aktivitemizi bu haliyle &amp;ouml;rnek bir &lt;strong&gt;Workflow&lt;/strong&gt; i&amp;ccedil;erisinde icra ettirdiğimizde &amp;ccedil;alışma zamanında aşağıdaki istisna mesajını alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg110_Exception.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Source &lt;/strong&gt;&amp;ouml;zelliğinde null değer olduğundan &lt;strong&gt;Copy &lt;/strong&gt;operasyonunun icrası sırasında &lt;strong&gt;ArgumentNullException &lt;/strong&gt;alınmıştır. Oysaki bu hatanın &amp;ccedil;alışma zamanında değil kodlama zamanında,&amp;nbsp;yani &lt;strong&gt;Visual Studio&lt;/strong&gt; ortamında daha tasarımı ger&amp;ccedil;ekleştirirken farketmemiz &amp;ccedil;ok &amp;ouml;nemlidir. Bu bize&amp;nbsp;zaman ve&amp;nbsp;maliyet kazancı olarak geri d&amp;ouml;necektir.&amp;nbsp;İşte doğrulamanın sağlanması gereken yerlerden birisi burasıdır. Peki bunu nasıl ger&amp;ccedil;ekleştirebiliriz? &amp;Ouml;ncelikli olarak &lt;strong&gt;Source&lt;/strong&gt; ve &lt;strong&gt;Destination&lt;/strong&gt; isimli &lt;strong&gt;InArgument&amp;lt;string&amp;gt;&lt;/strong&gt; tipinden olan &amp;ouml;zelliklerin boş bırakılmamasını sağlamalıyız. Bunun i&amp;ccedil;in ilgili &amp;ouml;zellikleri &lt;strong&gt;RequiredArgument&lt;/strong&gt; niteliği ile aşağıdaki kod par&amp;ccedil;asında g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi işaretlememiz yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[RequiredArgument]
public InArgument&amp;lt;string&amp;gt; Source { get; set; }
[RequiredArgument]
public InArgument&amp;lt;string&amp;gt; Destination { get; set; }&lt;/pre&gt;
&lt;p&gt;Bu durumda tasarım zamanında aşağıdaki g&amp;ouml;r&amp;uuml;nt&amp;uuml; ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg110_DesignTime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Source&lt;/strong&gt; ve &lt;strong&gt;Destination&lt;/strong&gt; değelerinin doldurulması zorunlu hale getirilmiştir. &amp;Uuml;stelik bu durum derleme işleminden sonra a&amp;ccedil;ık bir şekilde adeta geliştiricinin g&amp;ouml;z&amp;uuml;ne sokulmaktadır. &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&amp;nbsp;&lt;strong&gt;RequiredArgument &lt;/strong&gt;niteliği ile ilişkili olarak dikkat edilmesi gereken noktalardan biriside &lt;strong&gt;Argument&lt;/strong&gt; tiplerine uygulandığında işe yarıyor olmasıdır. Yani &lt;strong&gt;Soruce&lt;/strong&gt; ve &lt;strong&gt;Destination&lt;/strong&gt; &amp;ouml;zelliklerinin &lt;strong&gt;string&lt;/strong&gt; tipinden olmaları gibi bir durumda bu niteliğin bir etkisi olmayacaktır.&lt;/p&gt;
&lt;p&gt;İlk vakayı &amp;ccedil;&amp;ouml;z&amp;uuml;mledik. Artık dosya adlarını girdiğimizi d&amp;uuml;ş&amp;uuml;nebiliriz. Sıradaki sorun &lt;strong&gt;Source&lt;/strong&gt; &amp;ouml;zelliğine girilen dosyanın sistemde olmaması halinde ortaya &amp;ccedil;ıkacaktır. Buna g&amp;ouml;re yine kopyalama işlemi sırasında bir &amp;ccedil;alışma zamanı hatası alınacaktır. Durumu irdeleyebilmek i&amp;ccedil;in &lt;strong&gt;Source&lt;/strong&gt; ve &lt;strong&gt;Destination&lt;/strong&gt; &amp;ouml;zelliklerini aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ayarladığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg110_SourceOk.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu durumda &amp;ccedil;alışma zamanında aşağıdaki hata mesajını alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg110_Exception2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabi burada c:\ klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisinde &lt;strong&gt;Source.txt&lt;/strong&gt; isimli bir dosyanın ger&amp;ccedil;ektende var olmadığını d&amp;uuml;ş&amp;uuml;n&amp;uuml;yoruz. Buradaki istisnaya g&amp;ouml;re kaynak dosyanın &amp;ouml;nceden kontrol edilmesi ve derleme işleminden sonra geliştiriciye bir uyarı veya hata mesajı ile durumun bildirilmesi istenebilir. Ancak burada basit bir nitelik yardımıyla aşabileceğimizin &amp;ouml;tesinde bir durum vardır. Nitekim doğrulama i&amp;ccedil;in &amp;ouml;zel bir &lt;strong&gt;iş mantığı(Bussines Logic)&lt;/strong&gt;&amp;nbsp;bulunmaktadır. İşte bu tip doğrulamaları ger&amp;ccedil;ekleştirebilmek i&amp;ccedil;in &lt;strong&gt;CodeActivity&lt;/strong&gt; ve &lt;strong&gt;NativeActivity&lt;/strong&gt; t&amp;uuml;revlerinde &lt;strong&gt;CacheMetadata&lt;/strong&gt; isimli metodun ezilmesi ve &lt;strong&gt;Visual Studio&lt;/strong&gt; ortamına doğrulama ile ilişkili bilgilendirmenin yapılması gerekmektedir. S&amp;ouml;z&amp;uuml;n &amp;ouml;z&amp;uuml; &lt;strong&gt;FileCopy&lt;/strong&gt; aktivite bileşenimizi aşağıdaki hale getirmemiz yeterli olacaktır &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Activities;
using System.IO;
using System;
using System.Activities.Expressions;

namespace CustomActivities
{
    public sealed class FileCopy 
        : CodeActivity
    {
        [RequiredArgument]
        public InArgument&amp;lt;string&amp;gt; Source { get; set; }
        [RequiredArgument]
        public InArgument&amp;lt;string&amp;gt; Destination { get; set; }

        protected override void Execute(CodeActivityContext context)
        {
            File.Copy(Source.Get(context), Destination.Get(context));
        }

        protected override void CacheMetadata(CodeActivityMetadata metadata)
        {
            base.CacheMetadata(metadata);
            string source = ((Literal&amp;lt;string&amp;gt;)Source.Expression).Value;

            if (!File.Exists(source))
                metadata.AddValidationError(new System.Activities.Validation.ValidationError("Kaynak dosya bulunamadı.", true));
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Burada &lt;strong&gt;Source&lt;/strong&gt; &amp;ouml;zelliğinin değerine bakılmakta ve belirtilen dosyanın sistemde ger&amp;ccedil;ekten var olup olmadığı tespit edilmektedir. Eğer s&amp;ouml;z konusu dosya sistemde yok ise &lt;strong&gt;"Kaynak dosya bulunamadı."&lt;/strong&gt; i&amp;ccedil;eriğine sahip bir &lt;strong&gt;uyarı mesajı(Warning)&lt;/strong&gt; &amp;uuml;retilir. Uyarı mesajı diyoruz &amp;ccedil;&amp;uuml;nk&amp;uuml; sonda yer alan &lt;strong&gt;true&lt;/strong&gt; değeri bunu sağlamaktadır. Yine derleme işleminden sonra oluşacak durum aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg110_Warning.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabi eğer &lt;strong&gt;true&lt;/strong&gt; yerine &lt;strong&gt;false&lt;/strong&gt; değerini kullanırsak aşağıda g&amp;ouml;r&amp;uuml;len nur topu gibi&lt;strong&gt; error'&lt;/strong&gt; un sahibi oluruz. &lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg110_WarningFalse.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu adımdan sonra ge&amp;ccedil;erli bir kaynak dosyayı &lt;strong&gt;Source&lt;/strong&gt; &amp;ouml;zelliğine atayarak devam edersek &lt;strong&gt;Destination&lt;/strong&gt; &amp;ouml;zelliğine atanan değer ile ilişkili kontrolleri yapmamız gerektiği sonucuna varabiliriz. Buna g&amp;ouml;re hedef dosyanın kaynak dosya ile uzantı bakımından uyumlu olması sağlanabilir. Tabiki arka arkaya yapılan &amp;ccedil;alıştırmalar sonrasında hedef dosya zaten var ise &lt;strong&gt;overwrite&lt;/strong&gt; ile ilişkili hataların oluşması da s&amp;ouml;z konusudur. Bu iki doğrulama işlemini siz değerli okurlarıma bir antrenman olması i&amp;ccedil;in bırakıyorum &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f12%2fCustomActivityValidation.rar"&gt;CustomActivityValidation.rar (50,30 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2010-01-15 01:08:00</pubDate>
  <slug>Workflow-Foundation-40-Dogrulama(Validation)</slug>
  <tags>
    <tag>wf-40</tag>
    <tag>wf</tag>
    <tag>workflow-foundation</tag>
  </tags>
  <categories>
    <category>WF 4.0 Beta 2</category>
  </categories>
</post>