<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Python - PEP8 Uyumlu Kod Geliştirmek</title>
  <description>Geçtiğimiz günlerde senelik kişisel gelişim döngümün ikinci yarısının ilk konusu olan Python'a başladım. Yine bir önceki yılın aynı dönemlerinde Raspberry Pi ile ilgili olarak Python üzerine bir şeyler yapmaya çalışmıştım. Döngünün bir sonraki adımında yine Python ile başbaşayım. Head First Python, A Brain Friendly Guilde isimli kitabı takip ediyorum. Her örneği tek tek yapmaya çalışıyorum. Bayram tatilinde ilgimi çeken bir konu ile karşılaştım. Yazdığımız python kodlarının PEP8(Python Enhancement Proposals) adı verilen standartlara uygun olup olmadığının tespiti.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/06/pythonpep_2.gif" alt="" width="248" height="287" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde senelik kişisel gelişim d&amp;ouml;ng&amp;uuml;m&amp;uuml;n ikinci yarısının ilk konusu olan Python'a tekrardan başladım. Bir &amp;ouml;nceki yılın&amp;nbsp;aynı d&amp;ouml;nemlerinde Raspberry Pi ile ilgili olarak Python &amp;uuml;zerine bir şeyler yapmaya &amp;ccedil;alışmıştım. Ruby ve Go ile devam eden iterasyonun sıradaki adımında Python'u bir başucu kitabını kullanarak tekrar etmekteyim. Bu ama&amp;ccedil;la&amp;nbsp;&lt;a href="http://shop.oreilly.com/product/0636920036777.do" target="_blank"&gt;Head First Python, A Brain Friendly Guilde&lt;/a&gt; isimli kitaptan yararlanıyorum. Her &amp;ouml;rneği tek tek yapmaya &amp;ccedil;alışıyorum. Bug&amp;uuml;n ilgimi &amp;ccedil;eken bir konu ile karşılaştım. Yazdığımız python kodlarının PEP8&lt;em&gt;(Python Enhancement Proposals)&lt;/em&gt; adı verilen standartlara uygun olup olmadığının tespiti. PEP konusu ile ilgili detaylı bilgilere &lt;a href="https://www.python.org/dev/peps/" target="_blank"&gt;şu adresten&lt;/a&gt; ulaşabilirsiniz. Hatta bu kısa yazıya konu olan PEP8 i&amp;ccedil;eriğine de &lt;a href="https://www.python.org/dev/peps/pep-0008/" target="_blank"&gt;bu adresten&lt;/a&gt; bakabilirsiniz.&lt;/p&gt;
&lt;p&gt;Tahminlerime g&amp;ouml;re bloğumu okuyan hemen herkes yazılım geliştiriyor ve bu işte kodlama standartlarının ne kadar &amp;ouml;nemli olduğunu da biliyor. Bu standartlarda değişken isimlendirmelerinden yorum satırlarının nasıl olması gerektiğine kadar pek &amp;ccedil;ok yazım stili &amp;ouml;nerisi de bulunuyor. Bu &amp;ouml;neriler kodun daha okunabilir ve diğer meslektaşlarımız ile aynı stilde i&amp;ccedil;erik &amp;uuml;retilmesi a&amp;ccedil;ısından m&amp;uuml;him. Python dili i&amp;ccedil;inde kodun standard k&amp;uuml;t&amp;uuml;phanenin yazım stiline uygun olup olmadığının kontrol&amp;uuml;n&amp;uuml; yapabileceğimiz bir kılavuz mevcut. Ger&amp;ccedil;i i&amp;ccedil;erik olarak bakıldığında daha &amp;ccedil;ok yazım stilinin &amp;ouml;n plana &amp;ccedil;ıktığı ve bu noktada bir tutarlılığın sağlanmaya &amp;ccedil;alışıldığı anlaşılabiliyor. Gelin Python ile yazdığımız kodların&lt;em&gt;(&amp;ouml;rneğin basit bir mod&amp;uuml;l i&amp;ccedil;eriğinin)&lt;/em&gt; PEP8 standartlarına uygunuluğunu kontrol edelim.&lt;/p&gt;
&lt;h1&gt;Gerekli Ara&amp;ccedil;lar&lt;/h1&gt;
&lt;p&gt;&amp;Ouml;ncelikle bu kontrol işlerini &amp;uuml;stlenecek yardımcı ara&amp;ccedil;ları &amp;ccedil;alışmakta olduğumuz sistemimize&amp;nbsp;kurmamız gerekiyor. pytest isimli ara&amp;ccedil;la pep8 standartlarını i&amp;ccedil;eren paketleri sistemimize almalıyız. &amp;Ouml;rnekleri Windows tarafında geliştirdiğimden pip y&amp;uuml;kleyicisini py komutu ile birlikte kullanmalıyım. -3 ile Python'un 3 ve sonrası s&amp;uuml;r&amp;uuml;m&amp;uuml; i&amp;ccedil;in bir y&amp;uuml;kleme işlemi yapılmasını belirtiyoruz. Sırasıyla &amp;ouml;nce pytest ardından da pytest-pep8 ara&amp;ccedil;larını kuruyoruz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;py -3 -m pip install pytest

py -3 -m pip install pytest-pep8&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/pythonpep_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Windows tarafındaki y&amp;uuml;kleme sonrası py.test aracının bulunamadığına dair bir hata mesajı ile karşılaşabilirsiniz. Bu, Python'un script klas&amp;ouml;r&amp;uuml;ne ait Path bildiriminin olmayışından kaynaklanmaktadır. Script klas&amp;ouml;r&amp;uuml;n&amp;uuml; Environment Variables-Path tanımına eklediğiniz takdirde sorun &amp;ccedil;&amp;ouml;z&amp;uuml;mlenecektir.&amp;nbsp;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;Bir Test Kodu&lt;/h1&gt;
&lt;p&gt;Pek tabii test i&amp;ccedil;in &amp;ouml;rnek bir kod par&amp;ccedil;asına ihtiyacımız var.&amp;nbsp;İ&amp;ccedil;eriğinin &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k bir &amp;ouml;nemi yok. Bizim i&amp;ccedil;in kobay olacak diyebiliriz.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;import math,os

# Bu fonksiyon iki sayısal değerin toplamını hesaplamak i&amp;ccedil;in kullanılır. İki int gibi.
def sum(x,y):
    return x+y

# Variadic function sample
def sum(*numbers):
    if not len(numbers)&amp;gt;0:
        return 0
    total=0
    for n in numbers:
        total+=n
    return total

# Calculate a Circle space
def circleSpace(r):
    return math.pi*r*r


class player:
   def __init__(self, name, level):
      self.name = name
      self.level = level
   
   def display(self):
      print("Name : ", self.name,  ", Level: ", self.level)

# test scripts
print(sum(2,3))
print(sum(1,3,5,7,9,11))
print(circleSpace(10))
throll=player("Throll",22)
throll.display()&lt;/pre&gt;
&lt;p&gt;Aslında &amp;uuml;&amp;ccedil; basit fonksiyonumuz ve bir de sınıfımız var. sum isimli fonksiyonun aşırı y&amp;uuml;klenmiş iki versiyonu bulunuyor. Birisi iki değerin toplamını almakta iken diğeri Variadic &amp;ouml;zelliğe sahip. Bir başka deyişle n sayının toplamını hesaplatabiliriz. Son fonksiyonumuz ise math mod&amp;uuml;l&amp;uuml;ndeki pi sabitini kullanarak daire alanının hesaplanmasında kullanılıyor. Her ne kadar kullanmıyor olsak da iki mod&amp;uuml;l bildirimi var. math ve os&lt;em&gt;(Eğer GoLang tarafında olsaydık derleme hatası alırdık biliyorsunuz değil mi? "Kullanmadığın paketi niye koyuyorsun" oraya derdi)&lt;/em&gt; player isimli sınıfımız bir oyuncuyu temsilen yazılmış durumda. Kodların IDLE &amp;uuml;zerinden F5 ile test edersek &amp;ccedil;alıştığını g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/pythonpep_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Peki ya PEP8 Kontrol&amp;uuml;&lt;/h1&gt;
&lt;p&gt;Kodlar g&amp;uuml;zel bir şekilde &amp;ccedil;alışıyor peki yazım tarzı&amp;nbsp;Guido van Rossum, Barry Warsaw, Nick Coghlan abilerimizin istediği gibi mi? Nitekim PEP8 dok&amp;uuml;mantasyonunda onların imzası var. Haydi bir bakalım. Komut satırından py.test aracını kullanarak testi &amp;ccedil;alıştırdığımızda beklenmedik sonu&amp;ccedil;larla karşılaşabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;py.test --pep8 algebra.py&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/pythonpep_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Liste aşağıya doğru uzayıp gitmekte. Temel olarak yazım stili ile ilgili kızılan şeyler var. &amp;Ouml;rneğin math ve os paket bildirimlerinin aynı satırda olmasına kızılıyor. Fonksiyon bildirimlerinden &amp;ouml;nce iki boş satır bekleniyor. Operatorlerden &amp;ouml;nce ve sonra birer boşluk isteniyor. Bir satırdaki karakter sayısının &amp;ccedil;ok fazla olduğu ifade ediliyor&lt;em&gt;(72 harfi ge&amp;ccedil;en bir yorum satırımız var) &lt;/em&gt;Sınıfın i&amp;ccedil;eriğini diğer bir dosyadan kopyalarken girintilerde kaymalar olduğu i&amp;ccedil;in 4 boşluklu tab kuralının bozulduğu dile getiriliyor&lt;em&gt;(Aslında PEP8 dok&amp;uuml;manına bakıldığında sınıf adları veya if kullanımları ile ilgili &amp;ouml;neriler de var. Lakin test aracından bunları &amp;ccedil;ıkarttıramadım)&lt;/em&gt; Şimdi kodun yazım stilini belirtilen uyarı mesajlarına g&amp;ouml;re yeniden d&amp;uuml;zenleyelim.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;import math
import os


# Bu fonksiyon iki sayısal değerin toplamını hesaplamak i&amp;ccedil;in kullanılır.
# İki int gibi.
def sum(x, y):
    return x+y


# Variadic function sample
def sum(*numbers):
    if not len(numbers) &amp;gt; 0:
        return 0
    total = 0
    for n in numbers:
        total += n
    return total


# Calculate a Circle space
def circleSpace(r):
    return math.pi*r*r


class player:
    def __init__(self, name, level):
        self.name = name
        self.level = level

    def display(self):
        print("Name : ", self.name,  ", Level: ", self.level)

# test scripts
print(sum(2, 3))
print(sum(1, 3, 5, 7, 9, 11))
print(circleSpace(10))
throll = player("Throll", 22)
throll.display()&lt;/pre&gt;
&lt;p&gt;import bildirimlerini iki ayrı satıra koydum. 72 karakteri ge&amp;ccedil;en yorum satırını da iki satıra b&amp;ouml;ld&amp;uuml;m. Fonksiyoların &amp;ouml;ncesinde ikişer satır boşluk bıraktım. Eşitlik, b&amp;uuml;y&amp;uuml;kt&amp;uuml;r gibi operat&amp;ouml;rlerin &amp;ouml;n&amp;uuml;ne ve arkasına birer boşluk dahil ettim. Fonksiyon parametrelerinde ve &amp;ccedil;ağırımlarındaki virg&amp;uuml;llerden sonrasına da birer boşluk koydum. Sınıfın i&amp;ccedil;erisindeki bozulan girinti yapısını tekrar elden ge&amp;ccedil;irdim. Sonu&amp;ccedil; ş&amp;ouml;yle oldu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/pythonpep_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi test başarılı. Elbette yapılan test sadece kodun yazım stilini denetleyen ve standart python k&amp;uuml;t&amp;uuml;phanesindeki ile tutarlı hale gelinmesini sağlayan t&amp;uuml;rde. Sonu&amp;ccedil;ta PEP8 ile tutarlılık sağlandı diyebiliriz. Lakin test aracı bir metodun parametre sayısının belli bir değerin &amp;uuml;st&amp;uuml;nde olması haline sınıf kullanın gibisinden bir &amp;ouml;neri sunmadı. İnsan Juval Lowy'nin eşsiz C# kodlama standartlarındaki gibi bir şeyler bekliyor ancak konu daha &amp;ccedil;ok g&amp;ouml;ze hoş gelen yazım stili gibi duruyor. Dok&amp;uuml;mantasyona bakıldığında yine de g&amp;uuml;zel &amp;ouml;neriler var. Şahsen GoLang tarafındaki bir takım stil kurallarının build mekanizmasına dahil edilmesinin &amp;ccedil;ok daha iyi olduğu kanaatindeyim. Nitekim bazı stillere uyulmadığı takdirde&lt;em&gt;(&amp;ouml;rneğin fonksiyon s&amp;uuml;sl&amp;uuml; a&amp;ccedil;ma parantezinin alt satırda olması hali)&lt;/em&gt; derleme hatası fırlatabilen, pek &amp;ccedil;oğumuza katı g&amp;ouml;r&amp;uuml;nen ama standartlığı en baştan sağlayan bir derleme mekanizması mevcut. Bu &amp;ouml;z eleştirimi de yaptıktan sonra huzurlarınızdan ayrılıyorum. Python kitabıma devam etmem lazım. Gitmem gereken yaklaşık 700 sayfa daha var. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-06-27 17:10:00</pubDate>
  <slug>PEP-8-Uyumlu-Kod-Gelistirmek</slug>
  <tags>
    <tag>pep8</tag>
    <tag>pytest</tag>
    <tag>python-enhancements-proposal-guide</tag>
    <tag>coding-standards</tag>
    <tag>kodlama-standartları</tag>
  </tags>
  <categories>
    <category>python</category>
  </categories>
</post>