<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Webiner - C# 4.0 - Yenilikler [Beta 2]</title>
  <description>Çok eskiden bir Delphi programıcısydım. Açıkçası o dönemlerde Delphi geliştirme ortamının hayranı olduğumu itiraf etmeliyim. Delphi 1.0 ile başlayan profesyonel iş yaşantımda ilk geliştirmeye çalıştığım ve neredeyse para kazanmak üzere olduğum programı üniversiteden çok değerli bir sınıf arkadaşım(Orkun Şentürk) ile birlikte yazamamıştık. Arkadaşımın motorsiklet satın aldığı bir mağazaya indirim karşılığında basit bit stok takip programı yazacaktık. Ne varki arkadaşım bir gün motorsikletinin sinyal lambasını kırdı ve 100 Mark değerinde olan lambayı karşılamak için programa yeni özellikler dahil ediliverdi.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f12%2fblg125_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok eskiden bir &lt;strong&gt;Delphi&lt;/strong&gt; programıcısydım. A&amp;ccedil;ık&amp;ccedil;ası o d&amp;ouml;nemlerde&amp;nbsp;&lt;strong&gt;Delphi&lt;/strong&gt; geliştirme ortamının hayranı olduğumu itiraf etmeliyim. &lt;strong&gt;Delphi 1.0&lt;/strong&gt; ile başlayan profesyonel iş yaşantımda ilk geliştirmeye &amp;ccedil;alıştığım ve neredeyse para kazanmak &amp;uuml;zere olduğum programı&amp;nbsp;&amp;Uuml;niversiteden &amp;ccedil;ok değerli bir sınıf arkadaşım&lt;em&gt;(Orkun Şent&amp;uuml;rk)&lt;/em&gt;&amp;nbsp;ile birlikte&amp;nbsp;&lt;span style="text-decoration: underline;"&gt;yazamamıştık&lt;/span&gt;. &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;Arkadaşımın motorsiklet satın aldığı bir mağazaya indirim karşılığında basit bit stok takip programı yazacaktık. Ne varki arkadaşım bir g&amp;uuml;n motorsikletinin sinyal lambasını kırdı ve &lt;strong&gt;100 Mark&lt;/strong&gt; değerinde olan lambayı karşılamak i&amp;ccedil;in programa yeni &amp;ouml;zellikler dahil ediliverdi.&lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;O zamanlar &lt;strong&gt;Delphi 2.0&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;ne hen&amp;uuml;z kavuşamamıştık ve &lt;strong&gt;Delphi 1.0&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nde veritabanı işlemleri ile ilişkili &amp;ouml;nemli sıkıntılar vardı. Sonu&amp;ccedil;ta programı yazamadık. Onun yerine bir muhasebe programı satın almalarını&lt;em&gt;(MSDOS tabanlı) &lt;/em&gt;&amp;ouml;nerdik. Tabi yine aynı arkadaşımla şeytanın bacağını bir sonraki projemizde kırdık ve yine Delphi 2.0 ile başarılı bir program yazıp satmayı başardık.&lt;/p&gt;
&lt;p&gt;Ancak profesyonel yazılım geliştirme yaşantım zaman i&amp;ccedil;erisinde &lt;strong&gt;Anders Heijslberg(C# ın babası diyebiliriz)'&lt;/strong&gt; in &lt;strong&gt;Microsoft&lt;/strong&gt; takımına ge&amp;ccedil;mesiyle tamamen y&amp;ouml;n değiştirdi. &lt;strong&gt;Anders'&lt;/strong&gt; in &lt;strong&gt;Microsoft'a&lt;/strong&gt; ge&amp;ccedil;işinden kısa bir s&amp;uuml;re sonra &lt;strong&gt;.Net Framework&lt;/strong&gt; platformunu ve &lt;strong&gt;C#&lt;/strong&gt; programlama dilini duyduk. Akabinde tabiki &lt;strong&gt;Visual Studio.Net&lt;/strong&gt; geliştirme ortamı.&lt;strong&gt; C#&lt;/strong&gt; programlama dilini daha g&amp;ouml;r&amp;uuml;r g&amp;ouml;rmez benimsemiş ve etkilenmiştim. Zaman ilerledik&amp;ccedil;e C# programlama dilide &amp;ouml;nemli gelişmeler g&amp;ouml;sterdi tabiki. &amp;Ccedil;&amp;uuml;nk&amp;uuml; yazılımların ihtiya&amp;ccedil;ları, gereksinimleri g&amp;uuml;nden g&amp;uuml;ne artıyor ve programlama dillerini kendilerine uymaları konusunda zorluyordu.&lt;/p&gt;
&lt;p&gt;Derken&lt;strong&gt; .Net Framework&amp;nbsp;2.0&lt;/strong&gt; k&amp;ouml;kl&amp;uuml; bir değişikliğin eklendiğini g&amp;ouml;rd&amp;uuml;k. &lt;strong&gt;Generic &lt;/strong&gt;mimari. K&amp;ouml;kl&amp;uuml;yd&amp;uuml; &amp;ccedil;&amp;uuml;nk&amp;uuml;&lt;strong&gt; CLR(Common Language Runtime)&lt;/strong&gt; &amp;uuml;zerinde değişikliklerin yapılmasını gerektiriyordu. &amp;Ccedil;ok doğal olaraktan dil i&amp;ccedil;erisinde buna destek verecek yenilikler yapıldığına ve dile &amp;ouml;zg&amp;uuml; başka ilavelerin getirildiğine tanık olduk. &lt;strong&gt;Anonymous&amp;nbsp;metodlar, yield&amp;nbsp;anahtar kelimesi&lt;/strong&gt;, &lt;strong&gt;static sınıflar &lt;/strong&gt;vb...Tabiki yapılan yeniliklerin belirli ama&amp;ccedil;ları olduğu kesindi. Bu ama&amp;ccedil;ların iyice belirgineştiği yer ise &lt;strong&gt;.Net Framework 3.5 &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml;yd&amp;uuml;.&amp;nbsp;Bu&amp;nbsp;vesileyle&amp;nbsp;&lt;strong&gt;Language INtegrated Query(LINQ) &lt;/strong&gt;hedefli olarak gelen yenilikler ve bunun i&amp;ccedil;in dilde yapılan geliştirmelerle karşılaştık. &lt;strong&gt;Extension metodlar, Anonymous tipler, lambda(=&amp;gt;) operat&amp;ouml;r&amp;uuml;,&amp;nbsp;Auto Property' ler, Object Initializer' lar, partial event' ler&amp;nbsp;&lt;/strong&gt;vb...&lt;/p&gt;
&lt;p&gt;Uzun bir s&amp;uuml;redirde &lt;strong&gt;C# 4.0 &lt;/strong&gt;dili birlikte gelmesi muhtemel yenilikler s&amp;ouml;z konusu. Halen daha &lt;strong&gt;Beta 2 &lt;/strong&gt;aşamasındayız ancak yakın&amp;nbsp;zamanda &lt;strong&gt;RC&lt;/strong&gt; versiyonu ile birlikte nihai s&amp;uuml;r&amp;uuml;me ulaşacağımızı biliyoruz. &lt;em&gt;(Her ne kadar zamanında bazı kişiler fake olarak C# 4.0 yeniliklerini bloglarında duyurup yayınlasalarda ger&amp;ccedil;ekleri yansıtmıyorlardı) &lt;/em&gt;&amp;Ouml;zellikle &lt;strong&gt;Dinamik Dil &amp;Ccedil;alışma Zamanı(Dynmaic Language Runtime)&amp;nbsp;&lt;/strong&gt;ile olan etkileşimin arttırılmasını hedef alan yeni dil &amp;ouml;zelliklerini &lt;a title="C# 4.0 ile Gelen Yenilikler" href="http://www.nedirtv.com/video/C-40-ile-Gelen-Yenilikler.aspx" target="_blank"&gt;NedirTV?com adına d&amp;uuml;zenlenen&amp;nbsp;webinerimizde &lt;/a&gt;detayları ile inceledik. Umarım sizler i&amp;ccedil;in yararlı olmuştur.&lt;/p&gt;
&lt;p&gt;S&amp;uuml;re&amp;nbsp;&lt;strong&gt;58:52&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-01-06 17:00:00</pubDate>
  <slug>Webiner-C-40-Yenilikler-Beta-2</slug>
  <tags>
    <tag>c#-40</tag>
    <tag>net-framework-40</tag>
    <tag>webiner</tag>
    <tag>webcast</tag>
  </tags>
  <categories>
    <category>C# 4.0</category>
  </categories>
</post>