<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>The Internet Computer (Internetin Yeniden Keşfi) ve Motoko'yu Duyunca Ben</title>
  <description>Herkese açık olan interneti genişletip kendi yazılım sistemlerimizi, kurumsal IT çözümlerimizi, web sitelerimizi, dağıtık bir ortamda firewall'lara ve yedekleme sistemlerine ihtiyacı duymadan güvenli bir şekilde konuşlandırabildiğimizi düşünelim. Hatta bunu sağlayan altyapı ile internete konan bu sistemler arasında fonksiyon çağrımı yapar gibi kolayca haberleşebildiğimizi(ve tabii ki güvenli bir ortamda) hayal edelim. Biraz blockchain benzeri bir dağıtık sistem kurugusu gibi değil mi? Tam olarak olmasa da oradaki teorileri baz almışlar gibi görünüyor. The Internet Computer adlı bu proje ICP(Internet Computer Protocol) adı verilen ve herhangi bir merkezi olmayan bir protokolü baz alarak, küresel ortamdaki bağımsız veri merkezlerinin, web sitelerinin, backend hizmetlerinin vb yazılımların aynı güvenlik garantileriyle çalıştığı kapatılamaz bir alt evren vaat ediyor.</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/33/motokon.jpg" alt="" align="right" /&gt;Herkese a&amp;ccedil;ık olan interneti genişletip kendi yazılım sistemlerimizi, kurumsal IT &amp;ccedil;&amp;ouml;z&amp;uuml;mlerimizi, web sitelerimizi, dağıtık bir ortamda firewall'lara ve yedekleme sistemlerine ihtiyacı duymadan g&amp;uuml;venli bir şekilde konuşlandırabildiğimizi d&amp;uuml;ş&amp;uuml;nelim. Hatta bunu sağlayan altyapı ile internete konan bu sistemler arasında fonksiyon &amp;ccedil;ağrımı yapar gibi kolayca haberleşebildiğimizi&lt;em&gt;(ve tabii ki g&amp;uuml;venli bir ortamda)&lt;/em&gt;&amp;nbsp;hayal edelim. Biraz blockchain benzeri bir dağıtık sistem kurugusu gibi değil mi? Tam olarak olmasa da oradaki teorileri baz almışlar gibi g&amp;ouml;r&amp;uuml;n&amp;uuml;yor. The Internet Computer adlı bu proje ICP&lt;em&gt;(Internet Computer Protocol)&lt;/em&gt; adı verilen ve herhangi bir merkezi olmayan bir protokol&amp;uuml; baz alarak, k&amp;uuml;resel ortamdaki bağımsız veri merkezlerinin, web sitelerinin, backend hizmetlerinin vb yazılımların aynı g&amp;uuml;venlik garantileriyle &amp;ccedil;alıştığı kapatılamaz bir alt evren vaat ediyor.&lt;/p&gt;
&lt;p&gt;Aslında ilk okumalarımda şunu anladığımı ifade edebilirim: Internete alacağımız bir hizmeti geliştirirken kodun g&amp;uuml;venliği ve &amp;uuml;r&amp;uuml;n&amp;uuml;n a&amp;ccedil;ıklarının kapatılması i&amp;ccedil;in &amp;ccedil;aba sarf ediliyor. Bu durum referans ettiğimiz paketler g&amp;uuml;ncellendiğinde benzer kontrollerin tekrar yapılmasını gerektiriyor, lakin hacker'lar bu a&amp;ccedil;ıkları &amp;ccedil;ok seviyor. Bağımlı olduğumuz sistemlerle belki de yeterince &amp;ouml;zg&amp;uuml;r bir ortama da sahip olamıyoruz. İşte The Internet Computer fikri, geliştirdiğimiz sistemlerin standart bir g&amp;uuml;venlik s&amp;ouml;zleşmesi ile ayağa kalkabildiği, asla kapatılamayacak ve kurcalanamayacak bir ortamın &amp;uuml;st&amp;uuml;nde &amp;ccedil;alışmasını garanti etme felsefesini &amp;ouml;ne s&amp;uuml;r&amp;uuml;yor.&lt;/p&gt;
&lt;p&gt;Birde Big Tech denilen şirketlerin internetteki neredeyse her t&amp;uuml;r SaaS&lt;em&gt;(Software as as Services)&lt;/em&gt;'ın altından &amp;ccedil;ıkmasının, topladıkları m&amp;uuml;şteri verilerini s&amp;uuml;rekli birbirleriyle paylaşmasının ve interneti sahiplenmesinin de bu projenin başlatılmasında &amp;ouml;nemi b&amp;uuml;y&amp;uuml;k&lt;em&gt;(Sahibi olmayan bir internet ortamında g&amp;uuml;venilir, kesintiye uğramayan uygulamaların geliştirilmesini sağlamak ama&amp;ccedil;lardan birisi)&lt;/em&gt; Proje &amp;ccedil;ok yeni de değil. &lt;a href="https://dfinity.org/"&gt;DFINITY&lt;/a&gt; adı verilen kar amacı g&amp;uuml;tmeyen bir kuruluşun 2016 yılında başlattığı bir &amp;ccedil;alışma.&lt;/p&gt;
&lt;h2&gt;Motoko&lt;/h2&gt;
&lt;p&gt;Konu esasında &amp;ccedil;ok &amp;ccedil;ok derin g&amp;ouml;r&amp;uuml;n&amp;uuml;yor. Detaylar i&amp;ccedil;in &lt;a href="https://dfinity.org/" target="_blank"&gt;şu adrese bir uğrayın&lt;/a&gt; derim. Pek tabii benim derdim nasıl geliştirme yapıldığı. Bu platformun da bir SDK'sı&lt;em&gt;(Canister Software Development Kit olarak ge&amp;ccedil;iyor :) )&lt;/em&gt; ve programlama dili var. Motoko, bahsedilen uygulamaları geliştirmek i&amp;ccedil;in kullanılan yazılım dili. Aslında benimde bu merak &amp;ccedil;alışmasındaki amacım Motoko'yu Heimdall&lt;em&gt;(Ubuntu-20.04)&lt;/em&gt; ile tanıştırmak.&lt;/p&gt;
&lt;h2&gt;&amp;Ouml;n Gereksinim ve Kurulumlar&lt;/h2&gt;
&lt;p&gt;&amp;Ouml;yleyse hi&amp;ccedil; vakit kaybetmeden maceramıza başlayalım. Sistemde eğer &amp;ouml;ny&amp;uuml;z geliştirmeleri de yapacaksak Node.js'in y&amp;uuml;kl&amp;uuml; olması bekleniyor. CSDK'yi y&amp;uuml;klemek i&amp;ccedil;inse aşağıdaki terminal komutu yeterli.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sh -ci "$(curl -fsSL https://sdk.dfinity.org/install.sh)"

# SDK'in doğru y&amp;uuml;klenip y&amp;uuml;klenmediğini anlamak i&amp;ccedil;in versiyona bakmak yeterli
dfx --version

# Yeni bir hello world projesi oluşturmak i&amp;ccedil;in
dfx new freedom&lt;/pre&gt;
&lt;p&gt;Motoko i&amp;ccedil;in bir Visual Studio Extension'da mevcut. &amp;Uuml;stelik new ile yeni proje oluşturduktan sonraki terminal g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; de &amp;ccedil;ok tatlı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/33/Screenshot_01.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim freedom i&amp;ccedil;erisindeki kodlarımıza. Burada iki dosyaya dokunduğumu s&amp;ouml;yleyebilirim. Birisi index.js.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;import freedom from 'ic:canisters/freedom';

freedom.sayHello(window.prompt("En sevdiğin renk")).then(lovelyColor =&amp;gt; {
  window.alert(lovelyColor);
});&lt;/pre&gt;
&lt;p&gt;ve diğeri de main.mo&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;actor {
    public func sayHello(color : Text) : async Text {
        return "Hımmm...Demek en sevdiğin renk " # color # "!";
    };
};&lt;/pre&gt;
&lt;h2&gt;İlk &amp;Ouml;rneğin &amp;Ccedil;alışma Zamanı&lt;/h2&gt;
&lt;p&gt;Yine terminal penceresinden ilerlemek lazım. Ben src altındaki main.mo ve asset'lerdeki index.js'i biraz kurcaladım ve ilişkilerini anlamaya &amp;ccedil;alıştım. Aslında motoko kodları main.mo i&amp;ccedil;erisinde yer alıyor. Asset dediğimiz &amp;ouml;rneğin &amp;ouml;ny&amp;uuml;z tarafı da public altındaki index.js. Index.js i&amp;ccedil;inden main.mo'daki bir fonksiyonu&lt;em&gt;(sayHello)&lt;/em&gt; &amp;ccedil;ağırabiliyoruz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# &amp;Ouml;nce makinedeki veya uzaktan erişilebilen bir Internet Computer ağına bağlanmak gerekiyor
# Bunu projenin package.json dosyasının olduğu klas&amp;ouml;rde yapmak lazım
dfx start

# Network oluşturulduktan sonra uygulamamız i&amp;ccedil;in buraya benzersiz bir Canister Id ile kayıt olmamız gerekiyor
# Bunu da yine package.json'ın olduğu yerde aşağıdaki komutla yapabiliriz 
dfx canister create --all

# Şimdi gerekli npm paketlerinin y&amp;uuml;klenmesi lazım
npm install

# Ve ardından bizim uygulamamızın build edilmesi
dfx build

# Build işlemi başarılı bir şekilde tamamlandıysa bunu az &amp;ouml;nce oluşturduğumuz
# Local Internet Network'&amp;uuml;ne dağıtmamız gerekiyor
dfx canister install --all

# Bu işlemlerin arından yazılan program fonksiyonunu terminalden anından test edebiliriz
# freedom uygulamasındaki sayHello fonksiyonunu Black parametresi ile &amp;ccedil;alıştır
dfx canister call freedom sayHello Black

# İşlerimiz bittikten sonra Network'&amp;uuml; kapatmak i&amp;ccedil;inse;
dfx stop&lt;/pre&gt;
&lt;p&gt;Ama birde node.js &amp;ouml;n y&amp;uuml;z&amp;uuml;m&amp;uuml;z vardı ;) Onu da tarayıcıya gidip localhost:8080 arkasına, uygulama i&amp;ccedil;in &amp;uuml;retilen Canister ID bilgisini dahil ederek test edebiliriz.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;http://127.0.0.1:8000/?canisterId=cxeji-wacaa-aaaaa-aaaaa-aaaaa-aaaaa-aaaaa-q&lt;/pre&gt;
&lt;p&gt;Canister register, build ve deploy işlemlerine ait bir g&amp;ouml;r&amp;uuml;nt&amp;uuml;y&amp;uuml; paylaşarak devam edelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/33/Screenshot_02.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve &amp;ccedil;alışma zamanına ait iki g&amp;ouml;r&amp;uuml;nt&amp;uuml;y&amp;uuml; de buraya bırakalım.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/33/Screenshot_03.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/33/Screenshot_04.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Bazı Tespitler&lt;/h2&gt;
&lt;p&gt;Bu ilk &amp;ouml;rneği geliştirirken bir takım tespitlerim oldu. Onları şu maddelerle ifade edebilirim;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;Ouml;ny&amp;uuml;z i&amp;ccedil;in Assets klas&amp;ouml;r&amp;uuml; altındaki index.js'i kurcalamak lazım.&lt;/li&gt;
&lt;li&gt;&amp;Ouml;ny&amp;uuml;z&amp;uuml;n kullandığı fonksiyonlar main.mo altında tutuluyor ancak bu şart değil. İkinci &amp;ouml;rnekte başka bir mo kaynağını kullanıyoruz.&lt;/li&gt;
&lt;li&gt;Local Network adres ve port i&amp;ccedil;in tanımlama dfx.json altında bulunuyor.&lt;/li&gt;
&lt;li&gt;Frontend tarafının entrypoint bilgisi ile main programlarının bildirimleri de dfx.json i&amp;ccedil;erisinde.&lt;/li&gt;
&lt;li&gt;Dağıtım tarafında webpack kullanılmış. Paket bağımlılıkları ise package.json &amp;uuml;st&amp;uuml;nde tutuluyor.&lt;/li&gt;
&lt;li&gt;Proje geliştirildikten sonra bir Local Network başlattık ve bu ortam i&amp;ccedil;in benzersiz bir Canister ID &amp;uuml;rettik. &amp;Uuml;retilen bu değeri başlatılan ağa kaydettik, projeyi build ettik ve sonrasında build olan projeyi bu ağa install ettik&lt;em&gt;(ki burada WebAssembly i&amp;ccedil;erisinde deploy oluyormuş)&lt;/em&gt;&amp;nbsp;En nihayetinde &amp;ouml;rneği test edip &amp;ccedil;alıştırdık.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bu arada build işlemi sonrası eğer terminalden aşağıdaki komutu&amp;nbsp;girersek,&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;ls -l .dfx/local/canisters/freedom/&lt;/pre&gt;
&lt;p&gt;WebAssembly oluşumlarını da&lt;em&gt;(wasm uzantılı dosya)&lt;/em&gt; g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/33/Screenshot_05.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Diğer yandan&amp;nbsp;&amp;ouml;rnekleri &amp;ccedil;oğaltmaya başlayıp Internet Computer Network ortamına yeni Canister'lar eklendik&amp;ccedil;e ş&amp;ouml;yle bir arabirimle de karşılaştım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/33/Screenshot_06.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;İkinci &amp;Ouml;rnek&lt;/h2&gt;
&lt;p&gt;Derken Motoko'yu tanımak i&amp;ccedil;in bir &amp;ouml;rnek daha yapayım dedim. Bu sefer algebra isimli bir proje oluşturdum. main.mo yanına einstein isimli yeni bir actor ekledim ve dfx.json'dan main.mo yerine bunu kullanacağımı belirttim. einstein.mo i&amp;ccedil;erisinde tek bir fonksiyon bulunuyor. İki integer değer aralığındaki sayıların toplamını buluyor.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;actor einstein {
    public func gauss_sum(x:Int,y:Int) : async Int {
        var total:Int=0;
        var counter=x;
        while(counter&amp;lt;=y)
        {
            total+=counter;
            counter+=1;
        };
        return total;
  };
  
};&lt;/pre&gt;
&lt;p&gt;dfx.json'daki kısım;&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;{
  "canisters": {
    "algebra": {
      "main": "src/algebra/einstein.mo",
      "type": "motoko"
    },
// Kod devam ediyor&lt;/pre&gt;
&lt;p&gt;Sonrasında uygulamayı aşağıdaki adımlardan ge&amp;ccedil;irerek test ettim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# Birinc terminalde (hepsi algebra klas&amp;ouml;r&amp;uuml; altında yapılmalı)
dfx start

# Ağ başlatıldıktan sonra ikinci terminalde sırasıyla aşağıdaki işlemleri yaptım
dfx canister create --all
dfx build algebra
dfx canister install algebra

# ve komut satırından denememi yaptım
dfx canister call algebra gauss_sum '(1,100)'&lt;/pre&gt;
&lt;p&gt;İşte 1 ile 100 arasındaki sayıların toplamının bağımsız internet bilgisayarındaki ağda bulunması :)&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/33/Screenshot_07.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;CanisterId'yi kullanarak aynı uygulamayı otomatik olarak &amp;uuml;retilen web sayfasıyla da test edebiliriz. Benim &amp;ouml;rneğimde bu adres http://127.0.0.1:8000/candid?canisterId=75hes-oqbaa-aaaaa-aaaaa-aaaaa-aaaaa-aaaaa-q şeklindeydi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/33/Screenshot_08.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Motoko ve The Internet Computer'un geleceği ne olur bilinmez ama &lt;a href="http://www.umutozel.com/" target="_blank"&gt;Umut &amp;Ouml;zel&lt;/a&gt; ile bir sohbetimiz sırasında ortaya &amp;ccedil;ıkan bu kavramı ş&amp;ouml;yle bir kurcalama fırsatı bulduğum i&amp;ccedil;in kendi adıma memnunum. &amp;Ouml;n&amp;uuml;m&amp;uuml;zdeki yıl bu alandaki gelişmeleri takip etmek istiyorum. Bu ilgin&amp;ccedil; araştırmaya ait kodları &lt;a href="https://github.com/buraksenyurt/skynet/tree/master/No%2033%20-%20Independent%20Internet%20Computer" target="_blank"&gt;skynet github reposu&lt;/a&gt;nda bulabilirsiniz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2020-10-31 22:31:00</pubDate>
  <slug>the-internet-computer-internetin-yeniden-kesfi-ve-motoko-yu-duyunca-ben</slug>
  <tags>
    <tag>the-internet-computer</tag>
    <tag>motoko</tag>
    <tag>canister</tag>
    <tag>internet-computer-protocol</tag>
    <tag>icp</tag>
  </tags>
  <categories>
    <category>Motoko</category>
  </categories>
</post>