<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>MemoryCache</title>
  <description>Asp.Net tarafında performans tarafında göz önüne alınan kriterlerden birisi de ön bellekleme mekanizmalarının kullanılmasıdır. Özellikle nesne tabanlı ön bellekleme işlemlerinde Cache tipinden sıklıkla yararlanıldığını görürüz. Bu tip yardımıyla herhangibir nesne örneğinin, içeriği ile birlikte bellek üzerinde tamponlanması mümkündür. Bu kullanıma göre ön bellekleme seçeneklerini zaman bazlı olarak değerlendirebiliriz.</description>
  <content>&lt;p&gt;&lt;a href="/pics/blg238_Giris.jpg"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; float: right; padding-top: 0px; border: 0px;" title="blg238_Giris" src="/pics/blg238_Giris_thumb.jpg" alt="blg238_Giris" width="304" height="229" align="right" border="0" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Deadline&lt;/strong&gt;&amp;hellip;Benim gibi yazılım geliştirici olan pek coğumuzun sevmediği kelimelerin başında geldiğinden eminim &lt;img class="wlEmoticon wlEmoticon-annoyed" style="border-style: none;" src="/pics/wlEmoticon-annoyed_2.png" alt="Annoyed" /&gt; Ancak ka&amp;ccedil;ınılmaz bir ger&amp;ccedil;ek olduğunu da biliyoruz. Her şeye rağmen onunla yaşamak veya yaşamasını &amp;ouml;ğrenmek zorundayız.&lt;/p&gt;
&lt;p&gt;Tabi &lt;strong&gt;Deadline&lt;/strong&gt;&amp;rsquo; lar her zaman i&amp;ccedil;in bir proje i&amp;ccedil;in s&amp;ouml;z konusu olmayabiliyorlar. S&amp;ouml;z gelimi şu sıralar hazırlanmakta olduğum &lt;strong&gt;Microsoft Teknoloji G&amp;uuml;nler Akşam Sınıfı Asp.Net 4.0 &lt;/strong&gt;eğitiminin 3 g&amp;uuml;n &amp;ouml;ncesi de benim i&amp;ccedil;in bir &lt;strong&gt;Deadline&lt;/strong&gt;&lt;em&gt;(Aslında ilke olarak her seminerin 3 g&amp;uuml;n &amp;ouml;ncesinden tam olarak hazır olmayı benimsemişimdir)&lt;/em&gt; Bu deadline zamanına hızla yaklaştığım şu g&amp;uuml;nlerde uykusuz geceler ile hazırlanmaya devam ediyorum. Ne varki olduk&amp;ccedil;a yoğun ve zorlu bir projenin de i&amp;ccedil;erisinde yer almaktayım. Ama ne demişler &lt;strong&gt;&amp;ldquo;No Sacrifice No Victory&amp;rdquo; &lt;/strong&gt;Bakalım bu gece ki konumuz neymiş &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_8.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Asp.Net &lt;/strong&gt;tarafında performans tarafında g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınan kriterlerden birisi de &amp;ouml;n bellekleme mekanizmalarının kullanılmasıdır. &amp;Ouml;zellikle nesne tabanlı &amp;ouml;n bellekleme işlemlerinde &lt;strong&gt;Cache&lt;/strong&gt; tipinden sıklıkla yararlanıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bu tip yardımıyla herhangibir nesne &amp;ouml;rneğinin, i&amp;ccedil;eriği ile birlikte bellek &amp;uuml;zerinde tamponlanması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bu kullanıma g&amp;ouml;re &amp;ouml;n bellekleme se&amp;ccedil;eneklerini zaman bazlı olarak değerlendirebiliriz&lt;strong&gt;&lt;em&gt;.(Absolute Expiration, Sliding Expiration)&lt;/em&gt;&lt;/strong&gt;. Hatta &amp;ouml;zellikle &lt;strong&gt;SQL&lt;/strong&gt; tarafında, tablo bazlı bağımlılıklar oluşturabilir ve buna g&amp;ouml;re &amp;ouml;n bellekte tutulma s&amp;uuml;relerini tablodaki değişikliklere bağımlı hale getirebiliriz&lt;strong&gt;&lt;em&gt;(SqlCacheDependency)&lt;/em&gt;&lt;/strong&gt;. Buna ilaveten dosya bazlı bağımlılıklar da oluşturmamız m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r&lt;strong&gt;&lt;em&gt;(File Based Dependency)&lt;/em&gt;&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;Tabi g&amp;uuml;n&amp;uuml;m&amp;uuml;zde ve &amp;ouml;ncesinde &amp;ouml;n bellekleme i&amp;ccedil;in kullanılabilecek farklı alt yapılar da bulunmaktadır. S&amp;ouml;z gelimi &lt;strong&gt;Enterprise Library&lt;/strong&gt; ile birlikte gelen &lt;strong&gt;Caching Application Block &lt;/strong&gt;ve hatta dağıtık mimari stratejilerini barındıran ve &lt;strong&gt;Clustered&lt;/strong&gt; &amp;ouml;n bellekleme modelini sunan &lt;strong&gt;Velocity&lt;/strong&gt; kod adlı&lt;strong&gt; Windows Server AppFabric Distributed Caching&lt;/strong&gt;. Ancak &amp;ouml;n bellekleme işlemlerinde &lt;strong&gt;Asp.Net&lt;/strong&gt; tarafından sunulan &lt;strong&gt;built-in&lt;/strong&gt; &amp;ouml;n bellekleme motoru en pop&amp;uuml;ler olanlarından birisidir diyebiliriz.&lt;/p&gt;
&lt;p&gt;Lakin &amp;ouml;zellikle &lt;strong&gt;Windows Forms, WPF, Console, Class Library&lt;/strong&gt; gibi web dışında kalan projeler i&amp;ccedil;in enteresan bir durum da s&amp;ouml;z konusudur. Bu proje &amp;ccedil;eşitlerinde de istenirse &lt;strong&gt;Asp.Net Cache &lt;/strong&gt;tipi kullanılabilir. Tek yapılması gereken s&amp;ouml;z konusu projeye &lt;strong&gt;System.Web.dll assembly&lt;/strong&gt;&amp;rsquo; ının referans edilmesidir &lt;img class="wlEmoticon wlEmoticon-confusedsmile" style="border-style: none;" src="/pics/wlEmoticon-confusedsmile_4.png" alt="Confused smile" /&gt;&lt;/p&gt;
&lt;p&gt;C&amp;uuml;mlenin sonundaki&lt;strong&gt; Confused Simle Emoticon&lt;/strong&gt;&amp;rsquo; u mutlaka dikkatinizi &amp;ccedil;ekmiştir. Evet ger&amp;ccedil;ekten de &lt;strong&gt;Asp.Net&lt;/strong&gt; tarafının &lt;strong&gt;System.Web.Caching&lt;/strong&gt; isim alanında(Namespace) yer alan &lt;strong&gt;Cache &lt;/strong&gt;tipini &amp;ouml;rneğin bir &lt;strong&gt;Windows Forms &lt;/strong&gt;uygulamasında kullanabiliriz. Ancak burada ters olan durum aslında &lt;strong&gt;Web &lt;/strong&gt;tarafı i&amp;ccedil;in tasarlanmış ve o mimari alana ait olan bir &lt;strong&gt;assembly&lt;/strong&gt;&amp;rsquo; ının&lt;strong&gt;&lt;em&gt;(System.Web.dll)&lt;/em&gt;&lt;/strong&gt;, konu ile pek alakası olmayan desktop tipinden bir uygulamaya referans edilmiş olmasıdır.&lt;/p&gt;
&lt;p&gt;İşte bu genel sıkıntı nedeni ile &lt;strong&gt;.Net Framework 4.0&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nde gelen yeni bir &lt;strong&gt;in-memory Caching&lt;/strong&gt; alt yapısı mevcuttur&lt;em&gt;(In-Memory olsa da aslında &amp;ouml;zelleştirilebilir ve farklı provider&amp;rsquo; lar ile farklı kaynaklara doğru &amp;ouml;n bellekleme işlemleri yapılabilir)&lt;/em&gt;. Bu yapı aynı zamanda&lt;strong&gt; Asp.Net 4.0&lt;/strong&gt; yenilikleri arasında değerlendirilmektedir. Buna g&amp;ouml;re &lt;strong&gt;Asp.Net&lt;/strong&gt;&amp;rsquo; in&lt;strong&gt; Caching&lt;/strong&gt; stratejisi, web bağımlılığından &amp;ccedil;ıkartılmakta ve t&amp;uuml;m &lt;strong&gt;.Net &lt;/strong&gt;uygulamalarının kullanabileceği bir model haline getirilmektedir. Bu sayede, i&amp;ccedil;erisinde barındırdığı temel tipler yardımıyla web programcılarının aşina olduğu &amp;ouml;n bellekleme teknikleri, web ortamı dışındaki uygulama &amp;ccedil;eşitleri tarafından da kullanılabilir.&lt;/p&gt;
&lt;p&gt;Yeni alt yapı(Infrastructure) &lt;strong&gt;System.Runtime.Caching.dll assembly&lt;/strong&gt;&amp;rsquo; ı i&amp;ccedil;erisinde yer almaktadır. Dilerseniz bu &lt;strong&gt;Cache&lt;/strong&gt; tipinin kullanımını &amp;ouml;rnek bir uygulama &amp;uuml;zerinden değerlendirmeye &amp;ccedil;alışalım. Bu ama&amp;ccedil;la basit bir &lt;strong&gt;Windows Forms&lt;/strong&gt; uygulaması geliştiriyor olacağız. İlk olarak s&amp;ouml;z konusu uygulamaya aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer aldığı &amp;uuml;zere &lt;strong&gt;System.Runtime.Caching assembly&lt;/strong&gt;&amp;rsquo; ını referans ederek işe başlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg238_Reference.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="blg238_Reference" src="/pics/blg238_Reference_thumb.gif" alt="blg238_Reference" width="261" height="257" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek uygulamamıza ait &lt;strong&gt;Windows Form&lt;/strong&gt; tasarımı ise aşağıdaki gibi olabilir. Burada&lt;strong&gt; Add Cache Items&lt;/strong&gt; isimli d&amp;uuml;ğmeye basıldığında bazı nesne &amp;ouml;rneklerinin &amp;ouml;n belleğe atılması işlemleri ger&amp;ccedil;ekleştiriliyor olacaktır. Diğer taraftan &lt;strong&gt;Get Cache Items&lt;/strong&gt; başlıklı d&amp;uuml;ğmeye basıldığında ise, &amp;ouml;n bellek &amp;uuml;zerinde o anda durmakta olan nesne &amp;ouml;rneklerinin elde edilmesi işlemi ger&amp;ccedil;ekleştirilecektir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg238_FormDesign.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="blg238_FormDesign" src="/pics/blg238_FormDesign_thumb.gif" alt="blg238_FormDesign" width="425" height="322" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Windows Forms&lt;/strong&gt; uygulamasına ait kod i&amp;ccedil;eriğini ise aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Collections.Generic; 
using System.Data; 
using System.Data.SqlClient; 
using System.IO; 
using System.Runtime.Caching; 
using System.Windows.Forms;

namespace NewCacheConcept 
{ 
    public partial class Form1 : Form 
    { 
        string filePath = Path.Combine(Environment.CurrentDirectory, "ASP_NET_4_and_Visual_Studio_2010_Web_Development_Overview.pdf"); 
        // In-Memory Caching i&amp;ccedil;in kullanılacak olan nesne &amp;ouml;rneklenir 
        MemoryCache mCache = MemoryCache.Default;

        public Form1() 
        { 
            InitializeComponent(); 
        }

        private void btnAddToCache_Click(object sender, EventArgs e) 
        { 
            // Dosya bazlı bir bağımlılık politikası &amp;uuml;retimi 
            CacheItemPolicy policy = new CacheItemPolicy(); // &amp;Ouml;nce Policy tipi oluşturulur

            // Policy tipi i&amp;ccedil;in yeni bir dosya değişikliğini takip eden monitor nesnesi eklenir 
            HostFileChangeMonitor cMonitor = new HostFileChangeMonitor( 
                new List&amp;lt;string&amp;gt; 
                { 
                    filePath 
                } 
                ); 
            // Monitor &amp;ouml;rneğin ilkelere eklenir 
            policy.ChangeMonitors.Add(cMonitor); 
            // &amp;Ouml;n belleğe PDF tipinden olan dosya bir byte[] dizisi şeklinde eklenir. İkinci parametre de dependency belirtilir 
            mCache.Add("Aspnet40", File.ReadAllBytes(filePath), policy);

            // Custom Type t&amp;uuml;revli bir &amp;ouml;rneğin &amp;ouml;n belleğe eklenmesi 
            Person burak = new Person(); 
            burak.Name = "Burak Selim"; 
            burak.Surname = "Şenyurt"; 
            burak.Salary = 1000.25; 
            burak.BirthDate = new DateTime(1976, 12, 4); 
            mCache.Add("Person", burak, DateTimeOffset.Now.AddSeconds(30)); // Eklenme anından itibaren 30 saniye s&amp;uuml;reyle &amp;ouml;n bellekte tutulacağı DateTimeOffset yardımıyla belirtilir

            // &amp;Ouml;n belleğe DataTable t&amp;uuml;r&amp;uuml;nden bir nesne &amp;ouml;rneğinin eklenmesi 
            DataTable table = new DataTable(); 
            using (SqlConnection conn = new SqlConnection("data source=.;database=AdventureWorks;integrated security=SSPI")) 
            { 
                SqlDataAdapter adapter = new SqlDataAdapter("Select * From Production.Product", conn); 
                adapter.Fill(table); 
            } 
            mCache.Add("Products", table, DateTimeOffset.Now.AddMinutes(2)); // DataTable i&amp;ccedil;eriği eklenme anından itibaren iki dakika s&amp;uuml;reyle &amp;ouml;n bellekte tutulacaktır 
        }

        private void btnGetCacheInfo_Click(object sender, EventArgs e) 
        { 
            GetDashboard(); 
        }

        private void GetDashboard() 
        { 
            // Fiziksel olarak &amp;ouml;n bellek ile ilişkili bazı bilgilerin &amp;ccedil;ekilmesi 
            lstHistories.Items.Add(String.Format("Cache i&amp;ccedil;in kullanılabilecek bellek oranı %{0} ", mCache.PhysicalMemoryLimit)); 
            lstHistories.Items.Add(String.Format("Cache i&amp;ccedil;in kullanılabilecek bellek miktarı {0}", mCache.CacheMemoryLimit)); 
            lstHistories.Items.Add(String.Format("Cache i&amp;ccedil;erisindeki nesne sayısı {0}", mCache.GetCount())); 
        }

        private void btnGetCacheItem_Click(object sender, EventArgs e) 
        { 
            GetDashboard(); 
            // byte[] tipinden &amp;ouml;n belleklenmiş olan PDF dosyasının elde edilişi 
            CacheItem cItem=mCache.GetCacheItem("Aspnet40"); 
            if (cItem != null) 
            { 
                byte[] cValue = cItem.Value as byte[]; 
                lstHistories.Items.Add(String.Format("Cache deki {0} key değerli nesnenin boyutu {1}", cItem.Key, cValue.Length)); 
            }

            // Person tipinden &amp;ouml;n belleklenen nesnenin elde edilişi 
            CacheItem cItemPerson = mCache.GetCacheItem("Person"); 
            if (cItemPerson != null) 
            { 
                Person cachedPerson = cItemPerson.Value as Person; 
                lstHistories.Items.Add(String.Format("Cache deki {0} key değerli nesnenin Name değeri {1}", cItemPerson.Key, cachedPerson.Name)); 
            } 
            
            // DataTable tipinden &amp;ouml;n belleklenen nesnenin elde edilişi 
            CacheItem cItemTable = mCache.GetCacheItem("Products"); 
            if (cItemTable != null) 
            { 
                DataTable table = cItemTable.Value as DataTable; 
                lstHistories.Items.Add(String.Format("Cache deki {0} key değerli nesnenin toplam satır sayısı {1}", cItemTable.Key, table.Rows.Count)); 
            }

            // Belirli key bilgilerine ait değerlerin &amp;ccedil;ekilmesi 
            var values = mCache.GetValues(keys: new string[] { "Person", "Products" }); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Olayın kalbi &lt;strong&gt;MemoryCache&lt;/strong&gt; isimli nesne &amp;ouml;rneğidir. Bu nesne &amp;ouml;rneğinden yararlanılarak &lt;strong&gt;byte[], Person&lt;/strong&gt; ve &lt;strong&gt;DataTable &lt;/strong&gt;tipinden nesne &amp;ouml;rneklerinin &amp;ouml;n belleğe atılması işlemleri ger&amp;ccedil;ekleştirilmektedir. &amp;Ouml;zellikle &lt;strong&gt;PDF &lt;/strong&gt;formatındaki dosya i&amp;ccedil;eriğinin&lt;em&gt;(ki i&amp;ccedil;erisinde Asp.Net 4.0 ile gelen yenilikler anlatılmaktadır &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_8.png" alt="Winking smile" /&gt; )&lt;/em&gt;&amp;nbsp;&lt;strong&gt;byte[] &lt;/strong&gt;dizisi olarak belleğe atılışı sırasında bir de &lt;strong&gt;ilke(Policy)&lt;/strong&gt; uygulandığına dikkat edilmelidir. &amp;Ouml;yleki bu ilkeye g&amp;ouml;re bir dosya bağımlılığı oluşturulmuştur. Ger&amp;ccedil;i &lt;strong&gt;PDF&lt;/strong&gt; dosyasının değiştirilmesi pek s&amp;ouml;z konusu olmasa da &amp;ouml;nemli olan bağımlılığın nasıl yaratıldığıdır. Bu, tipik olarak dosya da değişiklik olması halinde &amp;ouml;n bellekte duran nesnenin d&amp;uuml;ş&amp;uuml;r&amp;uuml;lmesi anlamına gelmektedir. Yani web tarafından aşina olduğumuz &lt;strong&gt;File Dependency&lt;/strong&gt; olayı &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_8.png" alt="Winking smile" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Person &lt;/strong&gt;ve &lt;strong&gt;DataTable &lt;/strong&gt;tipinden olan nesne &amp;ouml;rneklerinin &amp;ouml;n bellekte tutulması ise kesin s&amp;uuml;re sonlu olarak bildirilmiştir&lt;strong&gt;&lt;em&gt;(Absolute Time Expiration)&lt;/em&gt;&lt;/strong&gt;. Yani &amp;ouml;n belleğe atılan nesne &amp;ouml;rnekleri belirlediğimiz s&amp;uuml;re kadar tutulacaklardır. Dikkat edilmesi gereken noktalardan bir diğeri de, uygulamanın &amp;ccedil;alıştığı makinenin &amp;ouml;n bellekleme i&amp;ccedil;in kullanılabilecek alan değerlerinin y&amp;uuml;zdesel ve miktarsal olarak elde edilebiliyor olmasıdır.&lt;/p&gt;
&lt;p&gt;Şimdi &amp;ouml;rneğimizi &amp;ccedil;alıştırarak ilk testimizi yapalım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg238_Runtime1.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="blg238_Runtime1" src="/pics/blg238_Runtime1_thumb.gif" alt="blg238_Runtime1" width="414" height="300" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &amp;ouml;n belleğe atılan &lt;strong&gt;3&lt;/strong&gt; nesne &amp;ouml;rneği s&amp;ouml;z konusudur ve bunlara ait bir takım bilgilerde elde edilebilmektedir. S&amp;ouml;z gelimi &lt;strong&gt;PDF dosyasının boyutu&lt;/strong&gt;, &lt;strong&gt;Person nesne &amp;ouml;rneğinin Name değeri &lt;/strong&gt;ve &lt;strong&gt;DataTable i&amp;ccedil;erisinde duran toplam satır sayısı &lt;/strong&gt;gibi. Diğer yandan &amp;ouml;nem arz eden konulardan biriside &lt;strong&gt;Absolute Expiration&lt;/strong&gt; s&amp;uuml;relerinin dolması halinde ne olacağıdır. S&amp;ouml;z gelimi &lt;strong&gt;Person &lt;/strong&gt;nesne &amp;ouml;rneği &amp;ouml;n belleğe atıldıktan sonra &lt;strong&gt;30 saniye boyunca yaşayabilir&lt;/strong&gt;. Eğer s&amp;uuml;re dolduktan sonra bellek &amp;uuml;zerinde kalan nesnelere bakılırsa &lt;strong&gt;Person&lt;/strong&gt; nesne &amp;ouml;rneğinin artık olmadığı rahatlıkla g&amp;ouml;r&amp;uuml;lebilir.&lt;em&gt;(Diğer yandan uygulama kapatıldığı takdirde &amp;ouml;n belleğe atılan t&amp;uuml;m nesnelerin ge&amp;ccedil;erliliği ortadan kalkacaktır. Bir başka deyişle s&amp;uuml;releri veya bağımlılıkları bozulmasa dahi, uygulama a&amp;ccedil;ık iken eklenen &amp;ouml;n bellek nesnelerine, uygulama tekrar a&amp;ccedil;ıldığında erişilemeyecektir)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg238_Runtime2.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="blg238_Runtime2" src="/pics/blg238_Runtime2_thumb.gif" alt="blg238_Runtime2" width="414" height="300" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Şu an itibariyle &amp;ouml;n bellekte 2 nesne &amp;ouml;rneği yer almaktadır ve &lt;strong&gt;Person&lt;/strong&gt; tipine ait &amp;ouml;rnek bunların arasında değildir. Nitekim kendisi i&amp;ccedil;in belirlenen &amp;ouml;n bellekte yaşama s&amp;uuml;resi aşılmıştır.&lt;/p&gt;
&lt;p&gt;Aslında &amp;ouml;n bellekte duran n sayıda nesne olduğunda bunlardan sadece belirli &lt;strong&gt;Key &lt;/strong&gt;adlarına sahip olanlarının elde edilmesi de bazı senaryolarda işimize yarayabilir. Bu noktada &lt;strong&gt;MemoryCache &lt;/strong&gt;nesne &amp;ouml;rneği &amp;uuml;zerinden &amp;ccedil;ağırılabilen &lt;strong&gt;GetValues &lt;/strong&gt;metodu olduk&amp;ccedil;a işe yaramaktadır. Aşağıdaki &lt;strong&gt;Debug &lt;/strong&gt;zamanı ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde bu nesne &amp;ouml;rneği i&amp;ccedil;erisinde &lt;strong&gt;Person &lt;/strong&gt;ve &lt;strong&gt;Products &lt;/strong&gt;adları ile işaret edilen nesne &amp;ouml;rneklerine erişilebildiği işaret edilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg238_DebugView.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="blg238_DebugView" src="/pics/blg238_DebugView_thumb.gif" alt="blg238_DebugView" width="523" height="121" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;MemoryCache&lt;/strong&gt; nesne &amp;ouml;rneğinden yararlanarak &lt;strong&gt;Asp.Net&lt;/strong&gt; tarafında sık kullanılan&lt;strong&gt; in-memory&lt;/strong&gt; &lt;strong&gt;Caching&lt;/strong&gt; tekniğini,&lt;strong&gt; System.Web.dll assembly&lt;/strong&gt;&amp;rsquo; ına bağımlı olmadan web harici herhangibir uygulamada ele alabilmekteyiz. &lt;strong&gt;MemoryCache&lt;/strong&gt; nesnesinin kullanımı ile ilişkili olarak detaylı referans bilgisine &lt;a href="http://msdn.microsoft.com/en-us/library/system.runtime.caching.memorycache.aspx" target="_blank"&gt;MSDN&lt;/a&gt; &amp;uuml;zerinden ulaşabilirsiniz. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f11%2fASPNET40Ogreniyorum.rar"&gt;ASPNET40Ogreniyorum.rar (2,31 mb)&lt;/a&gt;&amp;nbsp;&lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 Ultimate s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde geliştirilmiş ve test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-11-08 03:34:00</pubDate>
  <slug>Asp-Net-4-0-Memory-Cache</slug>
  <tags>
    <tag>aspnet-40</tag>
    <tag>caching</tag>
    <tag>windows-forms</tag>
    <tag>memorycache</tag>
    <tag>in-memory-caching</tag>
    <tag>aspnet-caching</tag>
  </tags>
  <categories>
    <category>Asp.Net 4.0</category>
  </categories>
</post>