<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>.Net Memory Management’ i Kavramak</title>
  <description>Sanki C++ ile geliştirilmiş bir değişken tipiydi de, Release edilmesi unutulmuş ve bellek üzerinde bir şekilde ayakta kalmış bir programcıktı Smile Şimdi nereden çıktı bu Matrix, Merovingian diyeceksiniz. Konumuz .Net bellek yönetimi. Ama bu kez biraz daha farklı ve detaylı...</description>
  <content>&lt;p&gt;&lt;a href="/pics/Merovingian200px.png"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px;" title="Merovingian200px" src="/pics/Merovingian200px_thumb.png" alt="Merovingian200px" width="240" height="230" align="right" /&gt;&lt;/a&gt;&lt;span style="line-height: 1.8;"&gt;Merhaba Arkadaşlar,&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;Matix! Ne filmdi ama değil mi? &amp;Ouml;zellikle yazılım tarafına hakim olan bizler i&amp;ccedil;in, filmin i&amp;ccedil;erisindeki pek &amp;ccedil;ok g&amp;ouml;nderi anlamlı birer mesaj haline gelmişti. İlk b&amp;ouml;l&amp;uuml;m zaten efsanenin başlangıcı olma niteliğindeydi. İkinci b&amp;ouml;l&amp;uuml;mde işler daha da bir farklılaştı tabi. &amp;Ouml;rneğin, silinmeyen ve Matrix i&amp;ccedil;erisinde kendini geliştirip k&amp;uuml;&amp;ccedil;&amp;uuml;k bir krallık yaratan &lt;strong&gt;Merovingian&lt;/strong&gt; karakteri vardı. Bu sistem i&amp;ccedil;erisinde yer alan ve s&amp;uuml;resi dolduktan sonra silinmesi gereken bir program iken, kaynağa (Source) geri d&amp;ouml;nmemişti.&lt;/p&gt;
&lt;p&gt;Sanki C++ ile geliştirilmiş bir değişken tipiydi de, Release edilmesi unutulmuş ve bellek &amp;uuml;zerinde bir şekilde ayakta kalmış bir programcıktı &lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt; Şimdi nereden &amp;ccedil;ıktı bu &lt;strong&gt;Matrix, Merovingian&lt;/strong&gt; diyeceksiniz. Konumuz &lt;strong&gt;.Net bellek y&amp;ouml;netimi&lt;/strong&gt;. Ama bu kez biraz daha farklı ve detaylı.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;.Net Framework&lt;/strong&gt;&amp;rsquo; &amp;uuml;n bilindiği &amp;uuml;zere en &amp;ouml;nemli &amp;ouml;zelliklerinden birisi de&lt;strong&gt; Managed Code&lt;/strong&gt; adını verdiğimiz yaklaşımı destekliyor olmasıdır. Hatta &amp;ouml;zellikle bu yaklaşım &amp;uuml;zerine kurulmuş bir alt yapı mimarisi sunduğunu ifade edebiliriz. &lt;strong&gt;Managed Code&lt;/strong&gt; denildiğinde, &amp;uuml;retilen kodun &amp;ccedil;alışma zamanında bir ortam tarafından kontrol atlında tutulduğu sonucuna varmamız yeterlidir. &lt;strong&gt;.Net Framework&lt;/strong&gt;&amp;rsquo; &amp;uuml;n i&amp;ccedil;sel yapılarını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda, &amp;ccedil;alışma zamanı yani &lt;strong&gt;Common Language Runtime&lt;/strong&gt;, y&amp;uuml;r&amp;uuml;t&amp;uuml;lmekte olan &lt;strong&gt;Assembly&lt;/strong&gt;&amp;rsquo; lar ve ilişkili &lt;strong&gt;Module&lt;/strong&gt;&amp;rsquo; ler ile ilgili olarak bir &amp;ccedil;ok y&amp;ouml;netsel kontrol mekanizmasını devreye sokar. &amp;Ouml;rneğin &lt;strong&gt;Exception Handling, Code Access Security, Type Safety&lt;/strong&gt; ve en &amp;ouml;nemlilerinden birisi olan &lt;strong&gt;Memory Management&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle &lt;strong&gt;C++&lt;/strong&gt; gibi programlama dilleri, sistemler &amp;uuml;zerinde &amp;ouml;zg&amp;uuml;rce kod geliştirebilmemize olanak sağlamaktadır. &amp;Ouml;rneğin bellek &amp;uuml;zerinde &lt;strong&gt;pointer&lt;/strong&gt; gibi temel tipler yardımıyla her noktaya erişebilir ve nesnelerin yaşam d&amp;ouml;ng&amp;uuml;lerini &amp;ccedil;ok daha esnek bir bi&amp;ccedil;imde ele alabiliriz. Tabi bu &amp;ouml;zg&amp;uuml;rl&amp;uuml;k, &lt;strong&gt;development&amp;rsquo;&lt;/strong&gt; ı biraz daha zorlaştırır. Pointer aritmetiği ile uğraşılmak zorunda kalınır ve bellek y&amp;ouml;netimi g&amp;uuml;&amp;ccedil;leşir. Sonu&amp;ccedil; pek tabi, kaynağa geri d&amp;ouml;nmesi unutulan bir &lt;a href="http://en.wikipedia.org/wiki/Merovingian_%28The_Matrix%29" target="_blank"&gt;Merovingian&lt;/a&gt; olup &amp;ccedil;ıkar ki bunun doğal yansıması da genellikle &lt;strong&gt;Memory Leak&lt;/strong&gt; ve k&amp;ouml;t&amp;uuml; performans olur. Bu ve buna benzer bazı nedenlerden dolayı, &lt;strong&gt;.Net Framework &lt;/strong&gt;daha ilk s&amp;uuml;r&amp;uuml;m&amp;uuml;nden itibaren, kodu kontrol altında tutmuş ve belleği y&amp;ouml;netimini ağırlıklı olarak &amp;uuml;zerine almıştır. Bize de belirli &amp;ouml;l&amp;ccedil;&amp;uuml;lerde esnetmeler sunmuştur.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;.Net&lt;/strong&gt; ile geliştirme yapmaya veya onu &amp;ouml;ğrenmeye başlayan hemen her programcı aşağıdakine benzer bir şekil ile de mutlaka karşılaşır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/memmng_1.png"&gt;&lt;img style="display: inline;" title="memmng_1" src="/pics/memmng_1_thumb.png" alt="memmng_1" width="563" height="407" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bize &amp;ouml;ğretilen, bizim &amp;ouml;ğrendiğimiz ve hatta &amp;ouml;ğrettiğimiz haliyle, &lt;strong&gt;.Net Framework&lt;/strong&gt; i&amp;ccedil;erisinde veri t&amp;uuml;rleri iki ana dala ayrılır. Belleğin &lt;strong&gt;Stack&lt;/strong&gt; b&amp;ouml;lgesinde tutulan &lt;strong&gt;değer t&amp;uuml;rleri(Value Types)&lt;/strong&gt; ve belleğin &lt;strong&gt;Heap&lt;/strong&gt; b&amp;ouml;lgesinde tutulan &lt;strong&gt;referans t&amp;uuml;rleri(Reference Types).&lt;/strong&gt; &lt;strong&gt;int, double, Point, DateTime &lt;/strong&gt;gibi aslında &lt;strong&gt;Common Type System&lt;/strong&gt; i&amp;ccedil;erisinde birer &lt;strong&gt;struct&lt;/strong&gt; ile ifade edilebilen t&amp;uuml;m tipler değer t&amp;uuml;r&amp;uuml; iken, &lt;strong&gt;class&lt;/strong&gt; gibi tipler de referans t&amp;uuml;rleridir. &amp;Ouml;zellikle bunların kendi aralarındaki atamalarında bellek &amp;uuml;zerindeki işleyiş şekilleri de &amp;ccedil;ouğunlukla farklıdır. Aksi belirtilmediği ve m&amp;uuml;dahale edilmediği s&amp;uuml;rece referans t&amp;uuml;rleri arası yapılan atamalar, aslında &lt;strong&gt;stack&lt;/strong&gt; b&amp;ouml;lgesindeki adres işaret&amp;ccedil;ilerinin &amp;ccedil;oğullanması ama heap &amp;uuml;zerindeki aynı adres b&amp;ouml;lgesinin ifade edilmesidir. Değer t&amp;uuml;rlerinde ise bu durum tam tersidir. Değerler &lt;strong&gt;stack&lt;/strong&gt; b&amp;ouml;lgesinde atamalar sonrası kopyalanırlar.&lt;/p&gt;
&lt;p&gt;Aslında bu bilgiler bizim i&amp;ccedil;in temel niteliği taşımaktadır. Dedik ya, &lt;strong&gt;CLR&lt;/strong&gt; aslında &amp;ccedil;alışma zamanındaki bellek y&amp;ouml;netimini de &amp;uuml;stlenmektedir. O y&amp;uuml;zden &amp;ccedil;oğumuz, &lt;strong&gt;&amp;ldquo;nasıl olsa belleği birileri y&amp;ouml;netiyor, nesneleri de zamanı gelince temizliyor, ortalığı toparlıyor&amp;rdquo;&lt;/strong&gt; diyerek temel olan başka bir konuyu da atlarız. Ger&amp;ccedil;ekten de &lt;strong&gt;.Net Memory Management&lt;/strong&gt; acaba nasıl &amp;ccedil;alışmaktadır? Eğer bunu merak ediyorsanız, yaptığım araştırmalar ve kendimce edindiğim fikirler ile konuyu sizlere aktarmaya &amp;ccedil;alışıyor olacağım. Dolayısıyla bundan sonrasını merak ediyorsanız okumaya devam edin &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulamalarımızın &amp;ccedil;alışma zamanında &amp;uuml;rettiği referans tiplerinin &lt;strong&gt;Garbage&lt;/strong&gt; &lt;strong&gt;Collector&lt;/strong&gt; tarafından ele alındığını biliyoruz aslında. Hatta &lt;strong&gt;GC&lt;/strong&gt;, &lt;strong&gt;GCSettings&lt;/strong&gt; gibi tipler yardımıyla ona bir &amp;ouml;l&amp;ccedil;&amp;uuml;de m&amp;uuml;dahale etme şansımız da bulunmakta. Teorik olarak &lt;strong&gt;Heap&lt;/strong&gt; bellek b&amp;ouml;lgesindeki nesne &amp;ouml;rneklerinin yaşam d&amp;ouml;ng&amp;uuml;s&amp;uuml;nden, onların bellek &amp;uuml;zerindeki fragmantasyonlarından ve elbetteki serbest bırakılmalarından sorumlu olduğunu &amp;ouml;zetleyebiliriz. &lt;strong&gt;Garbage&lt;/strong&gt; &lt;strong&gt;Collector&lt;/strong&gt; ilke olarak iki tip nesne ile ilgilenir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/memmng_2.png"&gt;&lt;img style="display: inline;" title="memmng_2" src="/pics/memmng_2_thumb.png" alt="memmng_2" width="445" height="198" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Aslında bir &lt;strong&gt;.Net&lt;/strong&gt; uygulaması &lt;strong&gt;process&lt;/strong&gt; olarak belleğe a&amp;ccedil;ıldığında, &lt;strong&gt;Managed Heap&lt;/strong&gt; &amp;uuml;zerinde o process&amp;rsquo;e ait olacak şekilde iki farklı alan g&amp;ouml;z &amp;ouml;n&amp;uuml;na alınır. Bunlardan birisi uygulamanın &lt;strong&gt;83Kilobyte&lt;/strong&gt; ve daha az b&amp;uuml;y&amp;uuml;kl&amp;uuml;kteki nesneleri i&amp;ccedil;indir ki &lt;strong&gt;Small Object Heap(SOH)&lt;/strong&gt; olarak adlandırılır. Boyutu &lt;strong&gt;83Kb&lt;/strong&gt; &amp;uuml;zerinde olan nesneler i&amp;ccedil;inse &lt;strong&gt;Large Object Heap(LOH)&lt;/strong&gt; olarak adlandırılan başka bir &lt;strong&gt;heap&lt;/strong&gt; bloğu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Tekil bir .net Process&amp;rsquo; i Win32 platformunda &amp;ccedil;alıştırıldığında bellek &amp;uuml;zerinden maksimum 2Gb&amp;rsquo; a kadar yer kullanabilir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak &lt;strong&gt;Garbage Collector&lt;/strong&gt; s&amp;ouml;z konusu bu nesnelerin bellek &amp;uuml;zerinde yerleştirilmeleri(allocate), fragmante edilmeleri(re-allocate) ve geri &amp;ccedil;ağırılmaları(reclaim) vb işlemler sırasında kritik bir rol &amp;uuml;stlenir. Şimdi ilk olarak &lt;strong&gt;SOH&lt;/strong&gt; tarafına bir bakalım. &lt;strong&gt;SOH&lt;/strong&gt; temel olarak zaman i&amp;ccedil;erisinde nesne &amp;ouml;m&amp;uuml;rlerini 3 farklı jenerasyonda oluşacak şekilde ele almaktadır&lt;em&gt;(Generational yaklaşım)&lt;/em&gt;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Generation 0, Generation 1 ve Generation 2. &lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;SOH&lt;/strong&gt; i&amp;ccedil;erisinde yer alması gereken nesne &amp;ouml;rnekleri oluşturulduk&amp;ccedil;a &lt;strong&gt;Generation 0&lt;/strong&gt; adı verilen s&amp;uuml;re&amp;ccedil;te sırasyıla yerleştirilmeye başlarlar&lt;em&gt;(Burada C++ taki Linked List tarzındaki bellek a&amp;ccedil;ılımından farklı bir durum s&amp;ouml;z konusu)&lt;/em&gt;. &amp;Ccedil;ok doğal olarak zaman i&amp;ccedil;erisinde bu b&amp;ouml;lgede yer alan bazı nesneler &lt;strong&gt;Dispose&lt;/strong&gt; edilme aşamasına gelir. &lt;strong&gt;GC&lt;/strong&gt; varsayılan davranış stratejisine g&amp;ouml;re &lt;strong&gt;Generation 0&lt;/strong&gt; dolana kadar bir aksiyonda bulunmaz. &lt;strong&gt;Generation 0&lt;/strong&gt; dolduğunda, &lt;strong&gt;Dispose&lt;/strong&gt; s&amp;uuml;recine girmesi gereken atıl nesneler toplanmaya ve halen yaşamakta olan canlı nesnelerde &lt;strong&gt;Generation 1&lt;/strong&gt; b&amp;ouml;lgesine kopyalanarak taşınmaya başlanırlar.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Generation 1&lt;/strong&gt; b&amp;ouml;lgesinin de &amp;ccedil;ok doğal olarak bir kapasitesi vardır ve zaman i&amp;ccedil;erisinde buradaki canlı nesnelerden bazıları yine &lt;strong&gt;Dispose&lt;/strong&gt; s&amp;uuml;recine girecektir. Dolayısıyla &lt;strong&gt;Generation 1&lt;/strong&gt; b&amp;ouml;lgesinin de dolması sonrası yine canlı nesnelerin bu kez &lt;strong&gt;Generation 2&lt;/strong&gt; b&amp;ouml;lgesine kopyalanması ve atıl nesnelerin &lt;strong&gt;Generation 1&lt;/strong&gt; den atılması s&amp;ouml;z konusu olacaktır.&lt;/p&gt;
&lt;p&gt;Durumu kabaca bu şekilde d&amp;uuml;ş&amp;uuml;necek olursak aşağıdaki gibi bir zaman diagramını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almamız m&amp;uuml;mk&amp;uuml;n olabilir. Kabaca tabi&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; &lt;br /&gt;&lt;a href="/pics/memmng_3.png"&gt;&lt;img style="display: inline;" title="memmng_3" src="/pics/memmng_3_thumb.png" alt="memmng_3" width="486" height="634" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Ancak, olay bu kadar da basit değildir. Aslında &lt;strong&gt;GC&lt;/strong&gt; mekanizması ana uygulama &lt;strong&gt;Thread&amp;rsquo;&lt;/strong&gt; inden bağımsız olarak &amp;ccedil;alışan farklı bir &lt;strong&gt;Thread&lt;/strong&gt; olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde, s&amp;ouml;z konusu işlemleri &lt;strong&gt;concurrent&lt;/strong&gt; olarak ger&amp;ccedil;ekleştirmektedir. &amp;Ouml;zellikle &lt;strong&gt;Generation 0,1&lt;/strong&gt; ve &lt;strong&gt;2&lt;/strong&gt; b&amp;ouml;lgeleri &amp;uuml;zerinde her zaman şekilde olduğu gibi sıralı ve d&amp;uuml;zg&amp;uuml;n bir dizilim s&amp;ouml;z konusu olmayacaktır. Dolayısıyla kopyalama metoduna g&amp;ouml;re yapılan taşıma işlemleri sırasında, nesneler boş bulunan bellek b&amp;ouml;lgelerine atılırlar.&lt;/p&gt;
&lt;p&gt;Diğer yandan kopyalama işlemleri sırasında oluşabilecek bir sorun da vardır. &lt;strong&gt;GC&lt;/strong&gt; ayrı bir &lt;strong&gt;Thread&lt;/strong&gt; &amp;uuml;zerinden, bir alt &lt;strong&gt;Generation&amp;rsquo;&lt;/strong&gt; daki canlı nesneleri tespit ettikten sonra, bunları bir &amp;uuml;st generation&amp;rsquo; a kopyalar. Lakin alt &lt;strong&gt;Generation&amp;rsquo;&lt;/strong&gt; daki nesneler bu taşıma sırasında veya &amp;ouml;ncesinde halen daha ana veya farklı bir &lt;strong&gt;Thread&lt;/strong&gt; tarafından kullanılıyor olabilirler. Hımmm&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İşte bu noktada &lt;strong&gt;GC&lt;/strong&gt; ş&amp;ouml;yle bir yol izler. &lt;strong&gt;Thread&amp;rsquo;&lt;/strong&gt; ler arası g&amp;uuml;venli bir nokta oluşturur&lt;em&gt;(Safe Point)&lt;/em&gt; ve taşıma sırasında ilgili uygulama &lt;strong&gt;Thread&amp;rsquo;&lt;/strong&gt; lerinin tamamı durdurulur. Sonrasında ise kopyalanan t&amp;uuml;m i&amp;ccedil;eriği orjinal referansları ile eşleştirerek d&amp;uuml;zeni korur. G&amp;uuml;zel bir trick &amp;ouml;yle değil mi?&amp;nbsp;&amp;nbsp;&lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt; Bir o kadar da karışık aslına bakarsanız. &lt;em&gt;(Ben hala konu ile ilişkili kaynakları ve CLR via C#&amp;rsquo; ın ilgili b&amp;ouml;l&amp;uuml;mlerini okuyarak pekiştirmeye &amp;ccedil;alışıyorum)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Generation 2&lt;/strong&gt; b&amp;ouml;lgesi aslında performans &amp;ouml;l&amp;ccedil;&amp;uuml;mlerinde de ip ucu veren bir alan olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmektedir. Bu b&amp;ouml;lgenin &amp;ccedil;ok sık ve fazla şişerek dolması ileride programın bellek ile ilişkili sıkıntılar &amp;uuml;retebileceğinin de bir işaretedir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;a href="http://www.red-gate.com/products/dotnet-development/ants-memory-profiler/" target="_blank"&gt;ANTS Memory Profiler&lt;/a&gt; gibi ara&amp;ccedil;lar yardımıyla, uygulamalarımızın bellek &amp;uuml;zerindeki &amp;ouml;l&amp;ccedil;&amp;uuml;mlerini detaylamasına yapabiliriz. Tabi daha ucuz &amp;ccedil;&amp;ouml;z&amp;uuml;mler de var. CLR Performance Counter&amp;rsquo; lar &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Gelelim &lt;strong&gt;LOH(Large Object Heap)&lt;/strong&gt; b&amp;ouml;lgesine. &lt;strong&gt;83KB&lt;/strong&gt; &amp;uuml;zeri olarak belirtilen &lt;strong&gt;Large Object&amp;rsquo;&lt;/strong&gt; lerin taşıma/kopylama maliyetleri tahmin edileceği &amp;uuml;zere y&amp;uuml;ksektir. Bu sebepten dolayı &lt;strong&gt;SOH&lt;/strong&gt; i&amp;ccedil;in uygulanan &lt;strong&gt;Generations&lt;/strong&gt; tekniği yerine farklı bir yaklaşım kullanılır.&lt;strong&gt; Generation 2&lt;/strong&gt; par&amp;ccedil;asında &lt;strong&gt;Large Object&lt;/strong&gt; nesnelerinin, &amp;ouml;len nesnelerden boşalan yerlere iliştirilmesi s&amp;ouml;z konusudur. Aslında aşağıdaki şekil ile durumu biraz olsun ifade edebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/memmng_4.png"&gt;&lt;img style="display: inline;" title="memmng_4" src="/pics/memmng_4_thumb.png" alt="memmng_4" width="498" height="539" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bir &lt;strong&gt;LO&lt;/strong&gt; eklenmek istendiğinde &lt;strong&gt;Generation 2&lt;/strong&gt; kısmındaki ilk boş b&amp;ouml;lgeye a&amp;ccedil;ılması s&amp;ouml;z konusudur. Sonrasında sisteme dahil olacak diğer &lt;strong&gt;LO&amp;rsquo;&lt;/strong&gt; ler de &lt;strong&gt;Generation 2&amp;rsquo;&lt;/strong&gt; de boş olan yerlere serpiştirilirler. Tabi &lt;strong&gt;Generation 1&lt;/strong&gt; den gelen nesne &amp;ouml;rnekleri &lt;strong&gt;83Kb&lt;/strong&gt;&amp;rsquo; den k&amp;uuml;&amp;ccedil;&amp;uuml;k olduklarından, yeni gelen &lt;strong&gt;83Kb&amp;rsquo;&lt;/strong&gt; den b&amp;uuml;y&amp;uuml;k nesnelerin sığabilecekleri uygun yerlerinde &lt;strong&gt;Generation 2&lt;/strong&gt; &amp;uuml;zerinde var olması gerekir.&lt;/p&gt;
&lt;p&gt;Peki yoksa?&amp;nbsp;&lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt; Bu durumda uygulama daha fazla bellek alanının allocate edilmesi i&amp;ccedil;in işletim sisteminde bir talepte bulunacaktır. Hatta &lt;strong&gt;Heap&lt;/strong&gt; alanının yetmediği durumlarda, fiziki disk b&amp;ouml;lgelerinden sanal olarak bu alanların karşılanması istenecektir. Eğer işletim sisteminden olumlu bir cevap alamazsa bu durumda &lt;strong&gt;GC&amp;rsquo;&lt;/strong&gt; nin &lt;strong&gt;Generation 2&lt;/strong&gt; i&amp;ccedil;erisinde yapacağı &lt;strong&gt;de-allocate&lt;/strong&gt; işlemlerinin yeteri kadar yer ayırması beklenecektir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;LO&amp;rsquo;&lt;/strong&gt; ler i&amp;ccedil;in uygulanan strateji, generations sistematiğine g&amp;ouml;re daha performanslıdır. Nitekim bellek &amp;uuml;zerinde &lt;strong&gt;copy/move/re-refereance&lt;/strong&gt; işlemleri yoktur. Ancak belleğin fragmente edilme noktalarında da bir dezavantaj oluşturacaktır. Tabi LOH ile SOH&amp;rsquo; un bir arada &amp;ccedil;alıştığı da unutulmamalıdır. GC her iki t&amp;uuml;r i&amp;ccedil;in gerekli y&amp;ouml;netsel işlemleri &amp;uuml;stlenmektedir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;İşte t&amp;uuml;m bunlar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında karmaşık olan ve bize aslına bakarsanız &amp;ccedil;ok fazla sorun &amp;ccedil;ıkartıp baş ağrısı yapmayan en basit uygulamalarımızın bile, ş&amp;ouml;yle bir bellek testinden ge&amp;ccedil;irilerek ne yaptıklarının incelenmesinde yarar olduğu s&amp;ouml;ylenebilir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;.Net Framework &lt;/strong&gt;i&amp;ccedil;erisinde sisteme gelen ve &lt;strong&gt;CLR&amp;rsquo;&lt;/strong&gt; ın bellek y&amp;ouml;netimi odaklı olarak kullanılan pek &amp;ccedil;ok performans &amp;ouml;l&amp;ccedil;&amp;uuml;m kriteri bulunmaktadır.&lt;strong&gt; Bytes in all heaps, time spent in GC, allocated bytes per sec&lt;/strong&gt; vb&amp;hellip;Bu tip kriterlere bakılarak geliştirdiğimiz &lt;strong&gt;.Net&lt;/strong&gt; uygulamalarının bellek y&amp;ouml;netimi a&amp;ccedil;ısından daha performanslı hale getirilmesi, istatistiki bilgilerinin &amp;ccedil;ıkartılması, farklı &amp;uuml;r&amp;uuml;n stratejilerinin belirlenmesi de s&amp;ouml;z konusu olabilir. Diğer yandan &lt;strong&gt;Garbage Collector&amp;rsquo;&lt;/strong&gt; un kod tarafından da ele alınması ve bazı kurallarının değiştirilmesi s&amp;ouml;z konusu olabilir. &amp;Ouml;zellikle performans ve heap&amp;rsquo; in etkin kullanımı arasında fedakarlık yapılması gerektiği durumlarda&lt;em&gt;(kısaca performance ve heap etkinliği arası trade-off diyelim)&lt;/em&gt; uygun modun se&amp;ccedil;ilmesi sağlanabilir. Bu anlamda &lt;strong&gt;GC&lt;/strong&gt; iki temel modu desteklemektedir. &lt;strong&gt;Workstation&lt;/strong&gt; ve &lt;strong&gt;Server&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Workstation&lt;/strong&gt; modu, kullanıcıya maksimum cevap verilebilirlik i&amp;ccedil;in tercih edilmekte olup &lt;strong&gt;Concurrent&lt;/strong&gt; ve &lt;strong&gt;non-Concurrent&lt;/strong&gt; &amp;ccedil;alışacak şekilde ele alınabilir. Varsayılan olarak &lt;strong&gt;Concurrent&lt;/strong&gt; &amp;ccedil;alışma prensibi uygulanır. Buna g&amp;ouml;re &lt;strong&gt;GC&lt;/strong&gt; mekanizması uygulama ile birlikte ayrı bir &lt;strong&gt;Thread&lt;/strong&gt; &amp;uuml;zerinden işlemlerini ger&amp;ccedil;ekleştirir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Server&lt;/strong&gt; mode ağırlıklı olarak &lt;strong&gt;performans(Performance)&lt;/strong&gt;, &lt;strong&gt;&amp;ouml;l&amp;ccedil;eklenebilirlik(Scalability)&lt;/strong&gt; ve &lt;strong&gt;verimliliğin(throughput)&lt;/strong&gt; &amp;ouml;n plana &amp;ccedil;ıktığı &lt;strong&gt;sunucu ortamlarında(Server Environment)&lt;/strong&gt; g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınmaktadır. Bu modda, generation eşik değerleri ile bellekteki segment boyutları, &lt;strong&gt;Workstation Mode&amp;rsquo;&lt;/strong&gt; a g&amp;ouml;re &amp;ccedil;ok daha y&amp;uuml;ksektir. Bu son derece doğaldır nitekim sunucuların bellek kapasiteleri, workstation&amp;rsquo; lara g&amp;ouml;re daha fazldır&amp;nbsp;&lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt; &lt;strong&gt;Server Mode&lt;/strong&gt; ile &amp;ccedil;alışmanın en &amp;ouml;nemli artısı ise &lt;strong&gt;paralel&lt;/strong&gt; veya &lt;strong&gt;multi-thread&lt;/strong&gt; olarak &amp;ccedil;alışabilmesidir. Buna g&amp;ouml;re &lt;strong&gt;SOH&lt;/strong&gt; ve &lt;strong&gt;LOH&lt;/strong&gt; b&amp;ouml;lgeleri n sayıda fiziki işlemci tarafından ele alınabilir&lt;em&gt;(Tabi birbirlerini kesmeyecek şekilde)&lt;/em&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bu s&amp;ouml;ylenenlere g&amp;ouml;re Workstation&amp;rsquo; ların da Server Mode&amp;rsquo; da &amp;ccedil;alıştırılması d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Ancak bu modda kullanıcı cevap verilebilirliği ikinci plandadır. &amp;Ccedil;&amp;uuml;nk&amp;uuml; t&amp;uuml;m uygulama Thread&amp;rsquo; leri, GC&amp;rsquo; nin &amp;ccedil;alıştığı s&amp;uuml;relerde Suspend moda ge&amp;ccedil;ecektir ki bu kullanıcının direk uygulama ile olan etkileşiminde eksi puandır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bir de GC&amp;rsquo; nin tekrardan toplamasına gerek duyulmayacak şekilde kullanılabilen&lt;strong&gt; Weak Referance&lt;/strong&gt; tipleri bulunmaktadır. &lt;strong&gt;WeakReference&lt;/strong&gt; sınıfı bu noktada devreye girmektedir. Bu konuyu ilerleyen zamanlarda incelemeyi ve sizlerle paylaşmayı planlıyorum.&lt;/p&gt;
&lt;p&gt;Yukarıda bahsettiklerimiz anlamında &lt;strong&gt;GC&amp;rsquo;&lt;/strong&gt; i kod tarafında ve &lt;strong&gt;config&lt;/strong&gt; dosyası &amp;uuml;zerinde ayarlayabilir ve hangi modda ne şekilde &amp;ccedil;alışacağına karar verebiliriz. &amp;Ouml;rneğin uygulamaya ait &lt;strong&gt;config&lt;/strong&gt; dosyasına yapılacak aşağıdaki bildirim ile &lt;strong&gt;Server Mod&lt;/strong&gt; &amp;uuml;zerinde &amp;ccedil;alışılacağı ifade edilir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;configuration&amp;gt; 
&amp;nbsp; &amp;lt;runtime&amp;gt; 
&amp;nbsp;&amp;nbsp;&amp;nbsp; &amp;lt;gcServer enabled="true" /&amp;gt; 
&amp;nbsp; &amp;lt;/runtime&amp;gt; 
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;veya &amp;ouml;rneğin&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;configuration&amp;gt; 
&amp;nbsp; &amp;lt;runtime&amp;gt; 
&amp;nbsp;&amp;nbsp;&amp;nbsp; &amp;lt;gcServer enabled="false"/&amp;gt; 
&amp;nbsp;&amp;nbsp;&amp;nbsp; &amp;lt;gcConcurrent enabled="false"/&amp;gt; 
&amp;nbsp; &amp;lt;/runtime&amp;gt; 
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;bildirimi ile &lt;strong&gt;Workstation&lt;/strong&gt; modda ve&lt;strong&gt; non-concurrent&lt;/strong&gt; olarak &amp;ccedil;alışılacağı ifade edilebilir.&lt;/p&gt;
&lt;p&gt;Bunlara ek olarak &lt;strong&gt;GCLatencyMode&lt;/strong&gt; adında &amp;ouml;nemli bir ayar daha sunulmaktadır. Bu ayara g&amp;ouml;re daha fazla nesnenin bellekten toplanması bir başka deyişle &amp;ccedil;ok daha fazla alanın a&amp;ccedil;ılması sağlanabilir. Bilindiği &amp;uuml;zere &lt;strong&gt;GC&lt;/strong&gt;, &amp;ccedil;&amp;ouml;pleri topladığı sırada &amp;ccedil;alışmakta olan diğer t&amp;uuml;m &lt;strong&gt;Thread&amp;rsquo;&lt;/strong&gt; leri ge&amp;ccedil;ici olarak durdurur. Bu nedenle &lt;strong&gt;Latency(gecikme)&lt;/strong&gt; &amp;lsquo; nin kontrol altına alınması gereken uygulamalar s&amp;ouml;z konusu olabilir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;GCLatencyMode&lt;/strong&gt; &amp;ouml;zelliği &lt;strong&gt;Batch, Interactive&lt;/strong&gt; ve &lt;strong&gt;LowLatency&lt;/strong&gt; olmak &amp;uuml;zere 3 sabit değerden birisini alabilir. &lt;strong&gt;Batch&lt;/strong&gt; mode genellikle bir aray&amp;uuml;z&amp;uuml; veya sunucu taraflı operasyonu olmayan uygulamalarda tercih edilmektedir. Aray&amp;uuml;z&amp;uuml;(UI) bulunan uygulamalarda &lt;strong&gt;Interactive&lt;/strong&gt; &lt;strong&gt;mode&lt;/strong&gt; se&amp;ccedil;ilebilir. Bunun dışında bazı uygulamalar bilindiği &amp;uuml;zere bellek &amp;uuml;zerinde &amp;ccedil;ok daha fazla harekette bulunurlar. &amp;Ouml;zellikle &amp;ccedil;ok kısa s&amp;uuml;relerde işlemlerin yapılması gerekmektedir. &amp;Ouml;rneğin animasyon işlemleri ile uğraşan uygulamalar buna &amp;ouml;rnek olarak verilebilir. Bu tip uygulamalarda zaman olduk&amp;ccedil;a &amp;ouml;nemlidir. O nedenle &lt;strong&gt;LowLatency&lt;/strong&gt; modda &amp;ccedil;alıştırılmaları sağlanabilir. Latency Mode ile ilişkili daha detaylı bilgiyi &lt;a href="http://msdn.microsoft.com/en-us/library/bb384202.aspx"&gt;MSDN adresinden&lt;/a&gt; bulabilirsiniz.&lt;/p&gt;
&lt;p&gt;Devam eden yazımızda &lt;strong&gt;LOH&lt;/strong&gt; ve &lt;strong&gt;SOH&lt;/strong&gt; kullanımları sırasında uygulamalarımıza ait bellek değerlerini nasıl &amp;ouml;l&amp;ccedil;&amp;uuml;mlendirebileceğimizi aktarmaya &amp;ccedil;alışıyor olacağım. Şimdilik teoriyi pekiştirmemizde ve neyin ne olduğunu ayrıştırmamızda yarar var. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="http://www.amazon.com/CLR-via-C-Jeffrey-Richter/dp/0735627045/ref=sr_1_1?ie=UTF8&amp;amp;qid=1330694365&amp;amp;sr=8-1"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px;" title="memmng_5" src="/pics/memmng_5.png" alt="memmng_5" width="150" height="181" align="left" /&gt;&lt;/a&gt; Bu arada &lt;strong&gt;CLR&amp;rsquo;&lt;/strong&gt; ın &amp;ccedil;alışma şeklini daha iyi ve derinlemesine &amp;ouml;ğrenmek isterseniz sizlere tavsiyem &lt;strong&gt;MS Press&amp;rsquo;&lt;/strong&gt; in &lt;strong&gt;Jeffrey Ritcher&lt;/strong&gt; imzalı &lt;strong&gt;CLR via C#&lt;/strong&gt; isimli kitabı olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;896&lt;/strong&gt; sayfalık bu kitap i&amp;ccedil;erisinde elbetteki bulacağınız tek şek &lt;strong&gt;bellek y&amp;ouml;netimi(Memory Managemet) &lt;/strong&gt;değil. Ama yazdığımız temel C# kod par&amp;ccedil;alarının &lt;strong&gt;CLR(Common Language Runtime)&lt;/strong&gt; tarafından nasıl ele alındığını g&amp;ouml;rmek, &lt;strong&gt;CIL(Common Intermediate Language)&lt;/strong&gt; seviyesine kadar inebilmek m&amp;uuml;mk&amp;uuml;n. Fiyatı biraz y&amp;uuml;ksek g&amp;ouml;r&amp;uuml;nebilir ama bence elinizin altında olması gereken bir kaynaktır diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yor ve hatta bu konuda ısrar ediyorum.&lt;/p&gt;</content>
  <pubDate>2012-03-02 06:54:00</pubDate>
  <slug>Net-Memory-Management-Kavramak</slug>
  <tags>
    <tag>garbage-collection</tag>
    <tag>garbage-collector</tag>
    <tag>net-memory-management</tag>
    <tag>gc</tag>
  </tags>
  <categories>
    <category>.Net Framework 4.0</category>
  </categories>
</post>