<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Nasıl bir Web API Tasarımı?</title>
  <description>Web API'ler dahası RESTful API türünden servisler çok uzun zamandır hayatımızda. Benim de gerek blog yazılarımdaki örnekler olsun gerek iş yerinde kullandıklarımız olsun sürekli haşırneşir olduğum enstrümanlar. Ancak son zamanlarda okuduğum kaynaklardan sonra bir çok isimlendirme hatası yaptığımı fark ettim. Nedir bu işin doğru yolu diyerek ortak standartları araştırmaya başladım. Elde ettiğim bir takım sonuçlar oldu. Bu sonuçlardan basit bir çizelge de hazırladım. Öncesinde bir kaç kısa bilgi verelim.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/07/restful_guid_1.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Web API'ler ya da RESTful API t&amp;uuml;r&amp;uuml;nden servisler &amp;ccedil;ok uzun zamandır hayatımızda. Benim de gerek blog yazılarımdaki &amp;ouml;rnekler olsun gerek iş yerinde kullandıklarımız olsun s&amp;uuml;rekli haşırneşir olduğum enstr&amp;uuml;manlardan birisi. Ancak son zamanlarda okuduğum kaynaklardan sonra bir &amp;ccedil;ok tasarım hatası yaptığımı ve uygulamadığım şeyler olduğunu fark ettim. Nedir bu işin doğru yolu diyerek ortak standartları araştırmaya başladım. Elde ettiğim bir takım sonu&amp;ccedil;lar oldu. Bu sonu&amp;ccedil;lardan basit bir &amp;ccedil;izelge de hazırladım. Aşağıda g&amp;ouml;rebilirsiniz. Ama &amp;ouml;ncesinde bir ka&amp;ccedil; kısa bilgi verelim.&lt;/p&gt;
&lt;p&gt;Bu tip servisler &amp;ccedil;oğunlukla kaynaklarla(resources) ilgili temel işlemleri ger&amp;ccedil;ekleştirmek i&amp;ccedil;in kullanılmakta. Kaynakların listelenmesi, eklenmesi, silinmesi veya g&amp;uuml;ncellenmesi s&amp;ouml;z konusu temel operasyonlar olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&amp;nbsp;Servisler, kaynaklarla ilgili operasyonları belli adresler(endpoint diyebiliriz) &amp;uuml;zerinden sunar. Servislerin, sundukları kaynakların ve endpoint'lerin sayısı arttık&amp;ccedil;a baştan d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmesi gereken standartlar olduğunu fark ederiz. &amp;Ouml;zellikle bu servisler farklı takımlarca geliştiriliyorsa. Bu noktada kaynakların isimlendirilmesinden servis adresinin nasıl olacağına, versiyon bilgisinden serileştirme formatının bildirimine, operasyon adlarından d&amp;ouml;nd&amp;uuml;r&amp;uuml;lecek HTTP cevaplarından istemciden hangi metodlarla gelineceğine kadar bir &amp;ccedil;ok farklı kavram karşımıza &amp;ccedil;ıkıyor. Bu konulardan bir kısmı ile ilgili olarak şunları s&amp;ouml;yleyebiliriz.&lt;/p&gt;
&lt;p&gt;İsimlendirme standardı olarak aşağıdaki gibi kullanımlar &amp;ouml;neriliyor.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;https://blog.fabrikamai.com/sample/api/v1/categories
https://api.fabrikamai.com/v1/categories&lt;/pre&gt;
&lt;p&gt;İki kullanımdan birisi tercih edilebilir ama benim &amp;ouml;nerdiğim ikincisi. Dikkat edileceği &amp;uuml;zere her iki tanımlamada versiyonlama bilgisi i&amp;ccedil;ermekte.&amp;nbsp;Bazı kaynaklar versiyon bilgisinin Header i&amp;ccedil;erisinde g&amp;ouml;nderilebileceğini de dile getiriyor ancak yukarıdaki yazımda olduğu gibi a&amp;ccedil;ık olması daha doğru.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;HTTP Header kısmında daha &amp;ccedil;ok istemci ve sunucu arasındaki mesajlaşmanın formatı belirtiliyor. Content-type ile request, Accept ile de response formatlarını belirtmemiz m&amp;uuml;mk&amp;uuml;n.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;Content-Type: application/json
Accept: application/json&lt;/pre&gt;
&lt;p&gt;Diğer yandan sadece HTTP-Post ve Get desteği olan istemciler i&amp;ccedil;in mutlak suretle X-HTTP-Method-Override kullanılması bekleniyor. Bu konu ile ilgili &lt;a href="/post/Post-Gorunumlu-Put" target="_blank"&gt;şu yazıma&lt;/a&gt; bakabilirsiniz.&lt;/p&gt;
&lt;p&gt;Resource isimlendirmelerinde de &amp;ccedil;oğul ifadelerin kullanılması &amp;ouml;neriliyor. Yani category yerine categories şeklinde tanımlama yapmak lazım. Diğer kullanım &amp;ouml;nerilerini de şu şekilde &amp;ouml;zetleyebiliriz&lt;em&gt;(&lt;a href="/file.axd?file=/2018/07/RESTfulAPI.xlsx"&gt;Excel dosyasını indirmek i&amp;ccedil;in tıklayın&lt;/a&gt;)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;img src="/image.axd?picture=/2018/08/rest_table.png" alt="" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Artık elimde/elinizde RESTful API tasarlamak i&amp;ccedil;in g&amp;uuml;zel bir kılavuz var. Bir başka yazıda g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2018-08-05 21:30:00</pubDate>
  <slug>nasil-bir-web-api-tasarimi</slug>
  <tags>
    <tag>web-api</tag>
    <tag>aspnet-web-api</tag>
    <tag>restful</tag>
    <tag>rest-based-services</tag>
    <tag>http</tag>
    <tag>post</tag>
    <tag>put</tag>
    <tag>get</tag>
    <tag>delete</tag>
    <tag>service</tag>
    <tag>standarts</tag>
  </tags>
  <categories>
    <category>REST</category>
  </categories>
</post>