<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Identity Değerlerinin Çalışma Zamanında Elde Edilmesi</title>
  <description>Bu makalemizde, veritabanlarında otomatik olarak artan identity alanlarının değerlerinin, çalışma zamanında uygulama ortamlarına nasıl yansıtılabileceğini incelemeye çalışacağız. Çoğunlukla, tablolarımızda yer alan satırların birbirlerinden kolayca ayırt edilebilmelerini sağlamak için, primary key alanlarını kullanırız.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, veritabanlarında otomatik olarak artan identity alanlarının değerlerinin, &amp;ccedil;alışma zamanında uygulama ortamlarına nasıl yansıtılabileceğini incelemeye &amp;ccedil;alışacağız. &amp;Ccedil;oğunlukla, tablolarımızda yer alan satırların birbirlerinden kolayca ayırt edilebilmelerini sağlamak i&amp;ccedil;in, primary key alanlarını kullanırız. Genellikle bu alanları otomatik olarak artan sayısal değerler &amp;uuml;zerinde yapılandırırız. &amp;Ouml;rnek olarak aşağıdaki tabloyu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda, PersonelID alanının 1 sayısal değerinden başlayarak 1'er artan ve primary key &amp;ouml;zelliğine sahip olduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk80_1.gif" alt="" width="321" height="334" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 1. PersonelID alanının &amp;ouml;zellikleri&lt;/p&gt;
&lt;p&gt;Bu alanın değeri, tablonun bulunduğu sql sunucusu tarafından otomatik olarak arttırılmaktadır. Buraya kadar her şey zaten bildiğimiz olaylardır. Sorun, bir uygulamada bu tabloya yeni bir alan eklendiğinde, o an veritabanı tarafından otomatik olarak arttırılan alanın değerinin ortama yansıtılmasında ortaya &amp;ccedil;ıkmaktadır. Nitekim bu alanın yeni oluşan değerini elde etmek i&amp;ccedil;in, ilgili satırın uygulama ortamına yeniden &amp;ccedil;ekilmesi gerekmektedir. Bu ise &amp;ouml;zellikle tabloya ait t&amp;uuml;m satırların &amp;ccedil;ekildiği durumlarda gereksiz zaman kaybının yaşanmasına neden olmaktadır. Oysaki uygulayacağımız basit kodlamalar ile, yeni eklenen satırlara ait otomatik artan değerleri uygulama ortamına, minimum eforu sarfederek kolaylıkla alabiliriz. Sorunu daha iyi anlayabilmek amacıyla basit bir windows uygulaması geliştirelim. Form g&amp;ouml;r&amp;uuml;nt&amp;uuml;m&amp;uuml;z aşağıdakine benzer olmalıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk80_2.gif" alt="" width="560" height="336" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 2. Uygulama Formumuz.&lt;/p&gt;
&lt;p&gt;Uygulamamız basit olarak, Sql sunucusunda yer alan Northwind veritabanındaki Personel tablosuna ait verileri &amp;ccedil;ekmekte ve yeni satırlar eklenmesine izin vermektedir. Uygulamamıza ait ilk kodlar ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection con;
SqlDataAdapter da;
DataTable dt;

private void btnVeriCek_Click(object sender, System.EventArgs e)
{
    con=new SqlConnection("data source=localhost;initial catalog=Northwind;integrated security=SSPI");
    da=new SqlDataAdapter("SELECT * FROM PERSONEL",con); 
    dt=new DataTable("Personel");
    da.Fill(dt);
    dataGrid1.DataSource=dt;
}

private void btnEkle_Click(object sender, System.EventArgs e)
{ 
    DataRow dr;
    dr=dt.NewRow();
    dr[1]=txtPersonelAd.Text;
    dr[2]=txtPersonelSoyad.Text;
    dr[3]=txtSaatUcreti.Text;
    dr[4]=txtCalismaSuresi.Text;
    dt.Rows.Add(dr);

    SqlCommandBuilder cmb=new SqlCommandBuilder(da);
    da.Update(dt);
}&lt;/pre&gt;
&lt;p&gt;Şimdi uygulamamızı &amp;ccedil;alıştıralım, Veri &amp;Ccedil;ek başlıklı butona basalım ve dataGrid kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n Personel verileri ile dolduğunu g&amp;ouml;relim. Yeni bir personel kaydı girdiğimizde ve bu bilgileri Ekle butonuna basarak veritabanına g&amp;ouml;nderdiğimizde ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;m&amp;uuml;z&amp;uuml;n aşağıdaki gibi oluştuğunu farkederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk80_3.gif" alt="" width="560" height="336" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 3. Yeni satır eklenişi ve Identity alanının değeri.&lt;/p&gt;
&lt;p&gt;Dikkat edilecek olursa, yeni satırımız bağlantısız katman nesnemiz olan DataTable' ın Rows koleksiyonuna ve ayrıca sql sunucusu &amp;uuml;zerindeki Personel tablosuna başarılı bir şekilde eklenmiştir. Sorun şudurki, Veri &amp;Ccedil;ek butonuna basmadığımız ve Personel tablosuna ait verileri DataTable nesnesine tekrardan doldurmadığımız s&amp;uuml;rece, PersonelID alanının veritabanı tarafından otomatik olarak atanan değerini g&amp;ouml;remeyiz. Oysaki b&amp;ouml;yle bir değer, ger&amp;ccedil;ek bazlı bir projede başka bir işlem i&amp;ccedil;in veri olarak kullanılmak istenebilir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin, bir call center' daki operat&amp;ouml;r, m&amp;uuml;şterisi i&amp;ccedil;in yeni a&amp;ccedil;tığı bir dosyaya ait Identity değerini, dosya referans numarası olarak vermek durumunda olabilir. Kaldıki, eklediğimiz satır i&amp;ccedil;in ge&amp;ccedil;erli olan Identity değeri otomatik olarak oluşturulmuştur. Ancak bağlantısız katman nesnesinin hen&amp;uuml;z bundan haberi yoktur. Bu noktada programı sonlandırmadan Vs.Net ortamında, Personel tablosu bilgilerine bakıldığında, sql sorgusunu yeniden execute edersek Identity değerinin oluşturulmuş olduğunu g&amp;ouml;zlemleriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk80_4.gif" alt="" width="494" height="217" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 4. Identity değeri.&lt;/p&gt;
&lt;p&gt;İşte makalemize konu olan sorun bu alanın değerinin, satır veritabanına eklendiği zaman nasıl uygulama ortamına alınacağıdır. İki alternatif &amp;ccedil;&amp;ouml;z&amp;uuml;m yolumuz vardır. Bunlardan birincisi, SqlDataAdapter sınıfının RowUpdated olayının kullanılmasıdır. Diğer alternatif yol ise, yeni identity değerini uygulama ortamına &amp;ccedil;ekebileceğimiz bir Stored Procedure yardımıyla, satır ekleme işleminin yapılmasıdır. Hangi yolu se&amp;ccedil;ersek se&amp;ccedil;elim ikiside ortak bir anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; kullanmaktadır. Bu anahtar s&amp;ouml;zc&amp;uuml;k sql' e ait olan @@IDENTITY 'dir. Bu anahtar s&amp;ouml;c&amp;uuml;k, eklenen satıra ait, veritabanı tarafından otomatik olarak &amp;uuml;retilen identity değerini temsil etmektedir. İlk olarak RowUpdated olayı ile bu işin nasıl sağlanacağına bakalım. Tek yapmamız gereken SqlDataAdapter nesnemize, RowUpdated olayını eklemek ve bu olay metodunu kodlamaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnVeriCek_Click(object sender, System.EventArgs e)
{
    .
    .
    .
    da.RowUpdated+=new SqlRowUpdatedEventHandler(da_RowUpdated);
}

private void btnEkle_Click(object sender, System.EventArgs e)
{ 
    .
    .
    .
}

private void da_RowUpdated(object sender, SqlRowUpdatedEventArgs e)
{
    SqlCommand cmd=new SqlCommand("SELECT @@IDENTITY",con);
    if((e.Status==UpdateStatus.Continue) &amp;amp;&amp;amp; (e.StatementType==StatementType.Insert))
    {
        e.Row["PersonelID"]=cmd.ExecuteScalar();
        e.Row.AcceptChanges();
    }
}&lt;/pre&gt;
&lt;p&gt;Burada RowUpdated metodunda, veritabanına yeni bir satır eklendiğinde, @@IDENTITY değerini alacak sorguyu &amp;ccedil;alıştıran bir SqlCommand nesnesi kullanılmaktadır. B&amp;ouml;ylece, bağlantısız katmana ait yeni eklenen satırın ilgili alanına ( yani PersonelID alanına ), sorgunun sonucunu alabiliriz. Uygulamamızı bu haliyle &amp;ccedil;alıştırdığımızda ve yeni bir satır eklediğimizde, PersonelID alanı i&amp;ccedil;in veritabanı tarafından &amp;uuml;retilen otomatik değerinde, uygulama ortamına alındığını g&amp;ouml;zlemleriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk80_5.gif" alt="" width="560" height="336" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 5. Identity değerinin elde edilmesi.&lt;/p&gt;
&lt;p&gt;Gelelim ikinci yola. İkinci yolumuz ise, ekleme işleminin bir Stored Procedure yardımıyla yapılmasıdır. Bu Stored Procedure, ekleme işlemini yaparken, @@IDENTITY değerinide ortama bir Output parametresi vasıtasıyla g&amp;ouml;nderecektir. Bu ama&amp;ccedil;la Personel tablomuz i&amp;ccedil;in aşağıdaki Stored Procedure' &amp;uuml; oluşturalım.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;ALTER PROCEDURE dbo.PersonelEkle
(
    @PersonelID int OUTPUT,
    @PersonelAd varchar(50),
    @PersonelSoyad varchar(50),
    @SaatUcreti decimal,
    @CalismaSuresi decimal
)
AS
INSERT INTO Personel (PersonelAd,PersonelSoyad,SaatUcreti,CalismaSuresi) VALUES (@PersonelAd,@PersonelSoyad,@SaatUcreti,@CalismaSuresi)

SELECT @PersonelID=@@IDENTITY

RETURN&lt;/pre&gt;
&lt;p&gt;Bu Stored Procedure' de en &amp;ouml;nemli nokta Select sorgusunda @@IDENTITY değerinin, bir Output parametresine aktarılmış olmasıdır. Bu sayede, SP' yi &amp;ccedil;alıştırdığımızda, veri tabanı tarafından oluşturulan otomatik değeri, uygulama ortamımızda elde edebiliriz. Tek yapmamız gereken aşağıdaki kodları yazmaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnSPileEkle_Click(object sender, System.EventArgs e)
{
    SqlCommand cmd=new SqlCommand("dbo.PersonelEkle",con);
    cmd.CommandType=CommandType.StoredProcedure;

    cmd.Parameters.Add("@PersonelID",SqlDbType.Int);
    cmd.Parameters.Add("@PersonelAd",SqlDbType.VarChar,50); 
    cmd.Parameters.Add("@PersonelSoyad",SqlDbType.VarChar,50);
    cmd.Parameters.Add("@SaatUcreti",SqlDbType.Decimal); 
    cmd.Parameters.Add("@CalismaSuresi",SqlDbType.Decimal);

    cmd.Parameters["@PersonelID"].Direction=ParameterDirection.Output;

    cmd.Parameters["@PersonelAd"].Value=txtPersonelAd.Text.ToString();
    cmd.Parameters["@PersonelSoyad"].Value=txtPersonelSoyad.Text.ToString();
    cmd.Parameters["@SaatUcreti"].Value=Convert.ToDecimal(txtSaatUcreti.Text);
    cmd.Parameters["@CalismaSuresi"].Value=Convert.ToDecimal(txtCalismaSuresi.Text);

    con.Open();
    cmd.ExecuteNonQuery();

    /* Yeni satırı DataTable' ımızada ekliyoruz.*/
    DataRow dr;
    dr=dt.NewRow();
    dr[0]=cmd.Parameters["@PersonelID"].Value; /* Veritabanında hen&amp;uuml;z oluşturulan otomatik değeri alıp, satırın PersonelID alanına aktarıyoruz.*/
    dr[1]=txtPersonelAd.Text;
    dr[2]=txtPersonelSoyad.Text;
    dr[3]=txtSaatUcreti.Text;
    dr[4]=txtCalismaSuresi.Text;
    dt.Rows.Add(dr);
    dt.AcceptChanges();
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı bu haliyle &amp;ccedil;alıştırdığımızda yeni ekelenen satır i&amp;ccedil;in, veritabanı tarafından otomatik olarak arttırılan identity değerinin kolayca elde edilebildiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk80_6.gif" alt="" width="560" height="336" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 6. SP ile Identity değerinin elde edilmesi.&lt;/p&gt;
&lt;p&gt;Gelelim bu iki se&amp;ccedil;enekten hangisinin tercih edileceğine. Microsoft' un bu konuda yaptığı testlere g&amp;ouml;re, Stored Procedure yardımıyla Identity değerlerinin elde edilmesi, RowUpdated olayının kullanıldığı tekniğe nazaran daha performanslı ve verimli. Dolayısıyla SP kullanımını tercih etmek daha doğru bir se&amp;ccedil;enek gibi g&amp;ouml;z&amp;uuml;kmektedir. Bir başka konu ise, Access tipi tablolar i&amp;ccedil;in aynı senaryonun nasıl işleyeceğidir. Access tipi tablolarda, Output parametresi desteklenmediğinden, SP kullanımı ile identity değerinin elde edilmesi ger&amp;ccedil;ekleşmeyecektir. Bu nedenle tek se&amp;ccedil;enek, RowUpdated olayında @@IDENTITY değerinin elde edilmesidir. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinizde mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/Identity.zip"&gt;&amp;Ouml;rnek uygulama i&amp;ccedil;in tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2004-07-29 12:00:00</pubDate>
  <slug>Identity-Degerlerinin-Calc4b1sma-Zamanc4b1nda-Elde-Edilmesi-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>identity</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>