<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tasarım Prensipleri - Single Responsibility</title>
  <description>Sanıyorum benim gibi eskiler, yandaki resimde yer alan değerli ressamı hatırlayacaklardır. Bob Ross. Küçüklüğümde(ve halen Smile) Bob Ross' un TRT televizyonunda yayınlanan Resim Sevinci programlarını zaman zaman izler ve yarım saatlik sürede çizdiği doğa manzaralarına bakakalırdım. Rahmetli Bob bu günkü Tasarım Prensipleri uyarlanması sırasında Einstein ile birlikte küçük bir rol üstleniyor olacak. Öyleyse sözü fazla uzatmadan konumuza geçelim.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f6%2fbob-ross.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Sanıyorum benim gibi eskiler, yandaki resimde yer alan değerli ressamı hatırlayacaklardır. &lt;strong&gt;Bob Ross&lt;/strong&gt;. K&amp;uuml;&amp;ccedil;&amp;uuml;kl&amp;uuml;ğ&amp;uuml;mde(ve halen &lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt;) Bob Ross' un &lt;strong&gt;TRT&lt;/strong&gt; televizyonunda yayınlanan&lt;strong&gt; Resim Sevinci&lt;/strong&gt; programlarını zaman zaman izler ve yarım saatlik s&amp;uuml;rede &amp;ccedil;izdiği doğa manzaralarına bakakalırdım. Rahmetli Bob bu g&amp;uuml;nk&amp;uuml; &lt;strong&gt;Tasarım Prensipleri &lt;/strong&gt;uyarlanması sırasında &lt;strong&gt;Einstein&lt;/strong&gt; ile birlikte k&amp;uuml;&amp;ccedil;&amp;uuml;k bir rol &amp;uuml;stleniyor olacak. &amp;Ouml;yleyse s&amp;ouml;z&amp;uuml; fazla uzatmadan konumuza ge&amp;ccedil;elim.&lt;/p&gt;
&lt;p style="text-align: left;"&gt;Hatırlayacağınız gibi son iki blog yazımda, &lt;strong&gt;nesneye dayalı tasarım prensipleri &lt;/strong&gt;i&amp;ccedil;erisinde uyarlanan&amp;nbsp;ilkelere&amp;nbsp;değinmeye &amp;ccedil;alışmıştım. Bu g&amp;uuml;nk&amp;uuml; konumuz ise &lt;strong&gt;Single Responsibility &lt;/strong&gt;prensibi. Bu prensip anlaşılması kolay ancak &amp;ccedil;oğu zaman tespit edilmesi veya gerekliliğinin ortaya &amp;ccedil;ıkartılması zor bir ilke olarak karşımıza &amp;ccedil;ıkmaktadır. İlkenin savunduğu tez şudur; &lt;strong&gt;Bir sınıf sadece tek bir sorumluluk i&amp;ccedil;ermelidir. &lt;/strong&gt;Bir başka deyişle bir sınıfın birden fazla sorumluluğa sahip olmasına karşı bir ilkedir. Bunun en b&amp;uuml;y&amp;uuml;k nedeni olarak, sıklıkla yapılan ya da beklenen değişikliklerin, sorumluluk sayısı fazla olan sınıflar i&amp;ccedil;in&amp;nbsp;yeniden kullanılabilirliği(Reusable), test edilebilirliği, genişletilebilirliği&amp;nbsp;vb... zorlaştırıyor olmasıdır. Bu ilke aslında şu şekildede a&amp;ccedil;ıklanabilir; &lt;strong&gt;bir sınıfın değişikliğe uğraması i&amp;ccedil;in birden fazla neden olmamalıdır.&lt;/strong&gt;&lt;/p&gt;
&lt;p style="text-align: left;"&gt;Her zamanki gibi konuyu daha kolay kavrayabilmek adına basit bir &amp;ouml;rnek &amp;uuml;zerinden ilerlemekte yarar olduğu kanısındayım.&lt;/p&gt;
&lt;p style="text-align: left;"&gt;Bu konu ile ilişkili olaraktan &amp;ccedil;eşitli kaynaklarda olduk&amp;ccedil;a farklı ve g&amp;uuml;zel &amp;ouml;rnekler bulunmakta. &amp;Ouml;zellikle şu sıralar takip ettiğim, &lt;strong&gt;Robert C. Martin' &lt;/strong&gt;in&amp;nbsp;&lt;span id="btAsinTitle"&gt;&lt;strong&gt;&lt;a title="Agile Principles, Patterns and Practices in C#" href="http://www.amazon.com/Principles-Patterns-Practices-Robert-Martin/dp/0131857258/ref=sr_1_1?ie=UTF8&amp;amp;s=books&amp;amp;qid=1246047268&amp;amp;sr=8-1" target="_blank"&gt;Agile Principles, Patterns, and Practices in C# &lt;/a&gt;&lt;/strong&gt;kitabındaki &amp;ouml;rneklerden esinlendiğimi baştan belirtmek isterim. &lt;/span&gt;&lt;/p&gt;
&lt;p style="text-align: left;"&gt;&amp;Ouml;ncelikli olarak problemi i&amp;ccedil;eren Solution i&amp;ccedil;eriğimizi ele alalım. &amp;Ouml;rneğimizde &lt;strong&gt;Star&lt;/strong&gt; isimli bir sınıf bulunmaktadır. Bu sınıf basit anlamda 3 boyutlu bir yıldız şeklinin bazı değerlerini tutmaktadır. Ancak dahada &amp;ouml;nemlisi i&amp;ccedil;erisinde yıldızın hacmini hesaplayan ve yıldız şeklinde bir&lt;strong&gt; Windows Formu&lt;/strong&gt; &amp;ccedil;izen fonksiyonlar yer almaktadır&lt;em&gt;.(Bu son g&amp;ouml;revleri kafamızın bir k&amp;ouml;şesinde şimdiden tutalım &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;) &lt;/em&gt;Sınıfımız bir &lt;strong&gt;Class Library &lt;/strong&gt;i&amp;ccedil;erisindedir. Bu sınıf i&amp;ccedil;erisinde bir Windows Form' unun &amp;ccedil;izilmesi sağlandığından &lt;strong&gt;System.Windows.Forms assembly' &lt;/strong&gt;ını referans etmektedir. Diğer yandan Star isimli sınıfı kullanan iki farklı uygulama s&amp;ouml;z konusudur. Bunlardan birisi bir &lt;strong&gt;Windows&lt;/strong&gt; uygulaması olup &lt;strong&gt;Star&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde &lt;strong&gt;Form&lt;/strong&gt; &amp;ccedil;izen operasyonu ele almaktadır. Diğer uygulama ise basit bir &lt;strong&gt;Console&lt;/strong&gt; projesidir ve sadece generic List&amp;lt;T&amp;gt; tabanlı bir &lt;strong&gt;Star&lt;/strong&gt; nesne&amp;nbsp;koleksiyonundaki hacim değerlerini kullanarak bilimsel bir hesaplama ger&amp;ccedil;ekleştirmektedir. Solution i&amp;ccedil;eriği aşağıda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg37_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim kod i&amp;ccedil;eriğimize. GraphicLib isimli sınıf k&amp;uuml;t&amp;uuml;phanemizde yer alan Star sınıfına ait kodlar aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Windows.Forms;

namespace GraphicLib
{
    public class Star
    {
        public int CornerCount { get; set; }
        public int LineWidth { get; set; }
        public int zValue { get; set; }

        public Form Paint(string text)
        {
            Form frm = new Form();
            
            // Aslında yıldız şeklinde bir form &amp;ccedil;izdirildiği varsayılabilir
            frm.Text = text;
            frm.Width = LineWidth*2;
            frm.Height = Convert.ToInt32((CornerCount * LineWidth) / 3.14);

            return frm;
        }

        public double Volume()
        {
            // Tamamen hayali bir hacim hesaplaması. Normalde oluşturulan yıldızın hacminin hesaplandığı d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmektedir.
            return CornerCount * LineWidth;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Star sınıfı i&amp;ccedil;erisinde yapılan anlamsız işlemlere takılmayın. Amacımız tamamen işe yarar bir sınıfı kullanmak değil şu aşamada &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Ancak&amp;nbsp;Paint ve Volume metodları bizim i&amp;ccedil;in olduk&amp;ccedil;a &amp;ouml;nemlidir. Computer isimli Console uygulamamız i&amp;ccedil;erisinde Geometric isimli yardımcı bir sınıf bulunmaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic;
using GraphicLib;

namespace Computer
{
    class Geometric
    {
        // Sembolik bir matematiksel hesaplama yaptığı varsayılır
        public double Compute(List&amp;lt;Star&amp;gt; stars)
        {
            double total = 0;

            for (int i = 0; i &amp;lt; stars.Count; i++)
            {
                total += stars[i].Volume();
            }

            return total;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu sınıf i&amp;ccedil;erisinde yer alan &lt;strong&gt;Compute&lt;/strong&gt; metodu, parametre olarak gelen &lt;strong&gt;List&amp;lt;Star&amp;gt;&lt;/strong&gt; koleksiyonunundaki her bir eleman i&amp;ccedil;in &lt;strong&gt;Volume&lt;/strong&gt; metodunu ele almaktadır. Computer isimli programa ait test kodları ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using GraphicLib;
using System;

namespace Computer
{
    class Program
    {
        static void Main(string[] args)
        {
            Geometric einstein = new Geometric();

            double result=einstein.Compute(
                new System.Collections.Generic.List&amp;lt;GraphicLib.Star&amp;gt;{
                    new Star{CornerCount=10,LineWidth=12},
                    new Star{CornerCount=8,LineWidth=24},
                    new Star{CornerCount=5,LineWidth=35}
                }
                );
            System.Console.WriteLine("Bilimsel hesaplama yapılmıştır");
            
            System.Console.WriteLine(result.ToString());

            Console.ReadLine();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Peki ya &lt;strong&gt;WinForms&lt;/strong&gt; uygulamamız. Bu uygulama i&amp;ccedil;erisinde de &lt;strong&gt;Painter&lt;/strong&gt; isimli bir sınıf bulunmaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Windows.Forms;
using GraphicLib;

namespace ProblemWinForm
{
    class Painter
    {
        public void DrawScreen(Star aStar)
        {
            Form form = aStar.Paint("Yeni Form");
            
            form.Show();            
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu sınıf i&amp;ccedil;erisinde yer alan &lt;strong&gt;DrawScreen&lt;/strong&gt; metodu, parametre olarak &lt;strong&gt;Star&lt;/strong&gt; tipinden bir referans almakta ve &lt;strong&gt;Paint&lt;/strong&gt; metodunu &amp;ccedil;ağırmaktadır. Ve sıra &lt;strong&gt;Bob'&lt;/strong&gt; tadır. İşte Windows formumuzdaki Button kontrol&amp;uuml;ne basılınca olmasını istediklerimiz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Windows.Forms;
using GraphicLib;

namespace ProblemWinForm
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }

        private void btnDraw_Click(object sender, EventArgs e)
        {
            Painter bobRoss = new Painter();
            bobRoss.DrawScreen(new Star() { LineWidth = 100, CornerCount = 12 });
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Peki şimdi ne oldu? G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi tozu dumana kattık ve ortalığı iyice karştırdık. Karıştırdım &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt;&amp;nbsp;Aslında aşağıdaki şekil zihnimizi biraz daha kolay aydınlatabilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg37_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sanıyorumki durum şimdi biraz daha netleşmektedir. Yinede a&amp;ccedil;ıklamaya &amp;ccedil;alışayım. &lt;strong&gt;Windows&lt;/strong&gt; uygulamasında yer alan &lt;strong&gt;Painter&lt;/strong&gt; sınıfı i&amp;ccedil;in, &lt;strong&gt;Star&lt;/strong&gt; tipi i&amp;ccedil;erisinde kullanılan tek bir fonksiyonellik vardır. &lt;strong&gt;Paint&lt;/strong&gt; isimli metod. &lt;strong&gt;Painter&lt;/strong&gt; kesinlikle &lt;strong&gt;Volume&lt;/strong&gt; isimli fonskiyonla ilgilenmemektedir ki işinede yaramamaktadır zaten. Aksine &lt;strong&gt;Volume&lt;/strong&gt; metodu, &lt;strong&gt;Geometric&lt;/strong&gt; tipinin yer aldığı &lt;strong&gt;Console&lt;/strong&gt; uygulaması i&amp;ccedil;in &amp;ouml;nemlidir. Diğer yandan &lt;strong&gt;Geometric&lt;/strong&gt; sınıfı i&amp;ccedil;inde, &lt;strong&gt;Star&lt;/strong&gt; tipindeki &lt;strong&gt;Paint&lt;/strong&gt; metodunun bir &amp;ouml;nemi yoktur.&amp;nbsp;Buda uygulamaların taşınmaları veya dağıtılmaları esnasında gereksiz olan assembly' larında taşınması anlamına gelmektedir.&amp;nbsp;Bahsettiklerimizden yola &amp;ccedil;ıkarak şu sonuca varabiliriz;&amp;nbsp;Star sınıfı iki farklı sorumluluğu &amp;uuml;stlenmektedir ve bu,&amp;nbsp;&lt;strong&gt;Single Responsibility&lt;/strong&gt; ilkesine ters d&amp;uuml;şmektedir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;yleyse Single Responsibility prensibine uygun olacak şekilde nasıl bir &amp;ccedil;&amp;ouml;z&amp;uuml;m &amp;uuml;retebiliriz. Tek yapılması gereken sorumlulukları farklı sınıflara dağıtmak olacaktır. Yani iki farklı Star tipi tasarlanacak, bunlardan birisi Form &amp;ccedil;izme işlemini &amp;uuml;stlenirken diğeri ise sadece hesaplama işlemlerini &amp;uuml;zerine alacaktır. S&amp;ouml;z gelimi &lt;strong&gt;GeometricStar&lt;/strong&gt; ve &lt;strong&gt;GraphicStar&lt;/strong&gt; isimli iki farklı sınıf bu ama&amp;ccedil;la tasarlanabilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg37_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Grafiksel işlemlere ait sorumluluklar farklı bir sınıfa, bilimsel hesaplamalar ile ilişkili sorumluluklarda diğer bir sınıfa verilmiştir. Her iki sınıf i&amp;ccedil;in değişmez olan ortak &amp;ouml;zellikler ise bir &amp;uuml;st sınıfta toplanmıştır.&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ilke son derece basit ama bazen tespit edilmesi, g&amp;ouml;r&amp;uuml;lmesi ve hatta uygulanması&amp;nbsp;kolay olmayabilir. &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;S&amp;ouml;z gelimi bu yazıdaki &amp;ouml;rneklerde farklı &lt;strong&gt;Assembly'&lt;/strong&gt; lar yer almaktadır. Star sınıfı &amp;uuml;zerindeki sorumlulukları farklı sınıflara dağıtmış olsak bile, &lt;strong&gt;Console&lt;/strong&gt; ve &lt;strong&gt;Windows&lt;/strong&gt; uygulamalarının her ikiside aynı k&amp;uuml;t&amp;uuml;phaneyi referans etmekte ve her iki Star tipinede(dolayısıyla her iki sorumluluğada) erişebilmektedir. Belkide sadece sorumlulukları dahilindeki tiplere erişmeleri i&amp;ccedil;in bir takım &amp;ouml;nlemler alınması gerekebilir. Nitekim bu durumda, gereksiz tiplerinde taşınması s&amp;ouml;z konusudur ki buda &amp;uuml;r&amp;uuml;n&amp;uuml;n &amp;ccedil;evikliğini negatif etkileyebilir. İşte hepimize kafa karıştırıcı olduğu kadar gerekli olan bir tartışma konusu. Yorumlarınız, t&amp;uuml;m okurlarımız i&amp;ccedil;in değerli olacaktır.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Bu yazımızda basit bir şekilde &lt;strong&gt;Single Responsibility&lt;/strong&gt; prensibini incelemeye &amp;ccedil;alıştık.&amp;nbsp;&amp;Ouml;rnek tam olarak faydalı olmasada,&lt;strong&gt; bir sınıfın tek bir sorumluluğa sahip olması&lt;/strong&gt; gerekliliğinin Single Responsibility prensibinin kendisi olduğunu anlamış bulunuyoruz. &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&amp;nbsp;Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f6%2fSRP.rar"&gt;SRP.rar (109,33 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-06-26 16:04:00</pubDate>
  <slug>Tasarim-Prensipleri-Single-Responsibility</slug>
  <tags>
    <tag>design-principles</tag>
  </tags>
  <categories>
    <category>Tasarım Prensipleri(Design Principles)</category>
  </categories>
</post>