<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>XML Rapor Web Servisleri</title>
  <description>Bu makalemizde, Crystal Report'ların birer web servisi olarak nasıl yayınlanacaklarını ve istemciler tarafından kullanılacaklarını kısaca incelemeye çalışacağız. Hepimizin bildiği gibi Web Servislerinin günümüz teknolojilerine getirdiği en büyük yenilik, merkezileştirilmiş metodların, herhangibir platformda yer alan sayısız istemci tarafından, hiç bir engele yada kısıtlamaya takılmadan kolayca çağırılabilmeleri ve sonuçların aynı yollar ile kolayca sorunsuz elde edilebilmeleridir.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, Crystal Report'ların birer web servisi olarak nasıl yayınlanacaklarını ve istemciler tarafından kullanılacaklarını kısaca incelemeye &amp;ccedil;alışacağız. Hepimizin bildiği gibi Web Servislerinin g&amp;uuml;n&amp;uuml;m&amp;uuml;z teknolojilerine getirdiği en b&amp;uuml;y&amp;uuml;k yenilik, merkezileştirilmiş metodların, herhangibir platformda yer alan sayısız istemci tarafından, hi&amp;ccedil; bir engele yada kısıtlamaya takılmadan kolayca &amp;ccedil;ağırılabilmeleri ve sonu&amp;ccedil;ların aynı yollar ile kolayca sorunsuz elde edilebilmeleridir. &amp;Ouml;yleki, web servislerinin XML tabanlı olarak, SOAP protokol&amp;uuml;n&amp;uuml;n belirlediği kriterlerde HTTP gibi basit iletişim protokolleri &amp;uuml;zerinden anlaşmayı desteklemesi, onların esnek, genişleyebilir, kolay erişilebilir ve pop&amp;uuml;ler olmalarını sağlamıştır.&lt;/p&gt;
&lt;p&gt;İşte web servislerinin sunmuş olduğu bu imkanlardan, geliştirmiş olduğumuz Crsytal Report'larında faydalanmalarını sağlayabiliriz. &amp;Ccedil;oğunlukla, m&amp;uuml;şterilerimizin yada firmamız ile birlikte &amp;ccedil;alışan tedarik&amp;ccedil;ilerimizin, ortak bir noktadan, Crystal Report olarak hazırladığımız esnek ve g&amp;uuml;&amp;ccedil;l&amp;uuml; raporlara, her platformdan sorunsuz ulaşılabilmeleri amacıyla web servisi tabanlı raporlar geliştirilir.&lt;/p&gt;
&lt;p&gt;XML Rapor Web Servislerinin geliştirilmesi iki aşamalı bir işlemden ibarettir. İlk olarak, rapor dosyamızı baz alıcak bir web servisinin geliştirilemesi gerekir. Bu raporu kullanmak i&amp;ccedil;in ise, standart bir web servisinin kullanılmasında uygulanan prosed&amp;uuml;rler işletilir. Yani, web servisine ait referans, uygulamaya eklenir. Sonrasında ise, eğer uygulamayı Visual Studio.Net ile geliştirdiysek, web servisimiz i&amp;ccedil;in uygulamamızda bir proxy nesnesi, bu servisin istemci uygulamaya indirilen wsdl d&amp;ouml;k&amp;uuml;manı vasıtasıyla otomatik olarak oluşturulur. Sonrasında, istemci uygulamamız ile web servisimiz arasındaki mesajlaşmalar SOAP protokol&amp;uuml;n&amp;uuml;n belirlediği tipte bu proxy nesnesi yardımıyla ger&amp;ccedil;ekleştirilir. Dolayısıyla, geliştireceğimiz istemci uygulamada, bu proxy sınıfına ait nesne &amp;ouml;rneğini kullanmamız gerekecektir.&lt;/p&gt;
&lt;p&gt;Lafı fazla uzatmadan XML Rapor Web Servislerinin geliştirilmesi ile işe başlıyalım. Bu ama&amp;ccedil;la ilk olarak Visual Studio.Net ortamında bir Asp.Net Web Uygulaması a&amp;ccedil;alım. Bu noktada uygulamamıza, Solution Explorer'dan sağ tıklayarak a&amp;ccedil;tığımız men&amp;uuml;den Add Exsiting Item ile daha &amp;ouml;nceden geliştirmiş olduğumuz herhangibir rpt uzantılı rapor dosyasını ilave edelim. (Bu noktada asıl amacımız rapor dosyasının nasıl oluşturulduğu olmadığı i&amp;ccedil;in, bu konunun &amp;uuml;st&amp;uuml;nde fazla durmayacağım.)&lt;/p&gt;
&lt;p&gt;Ben uygulamamda &amp;ouml;rnek olarak, daha &amp;ouml;nceden geliştirdiğim &amp;ccedil;ok basit bir rapor dosyasını kullandım. Bu rapor, Sql Server sunucusunda yer alan Northwind veritabanındaki Customers tablosuna ait bir ka&amp;ccedil; veriden oluşmakta. Bizim i&amp;ccedil;in asıl &amp;ouml;nemli olan kısım, bu raporun, bir web servisi olarak yayınlanmak istenmesidir. İşte bu ama&amp;ccedil;la raporumuza sağ tıklıyor ve &amp;ccedil;ıkan men&amp;uuml;den Publish As Web Service se&amp;ccedil;eneğini işaretliyoruz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk72_1.gif" alt="" width="228" height="541" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 1: Raporun Web Servisi Olarak Yayınlanması.&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından raporumuz i&amp;ccedil;in, asmx uzantılı web servisi dosyamızın oluşturulduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk72_2.gif" alt="" width="237" height="54" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 2: Raporumuzun Web Servisi Haline Getirilmesi.&lt;/p&gt;
&lt;p&gt;Dilersek bu sayfayı web browser'dan &amp;ccedil;alıştırarak raporumuz ile ilgili olarak neler yapabileceğimi g&amp;ouml;rebiliriz. Artık elimizde, raporumuzu kullanmak isteyen istemcilere sunabileceğimiz bir web servisimiz var. Son adım olarak uygulamamızı derleyelim. Şimdi bu XML Rapor Web Servisini kullanmak isteyen istemcileri nasıl geliştireceğimize bakalım. Bunun i&amp;ccedil;in &amp;ouml;rnek olarak bir Asp.Net web uygulaması a&amp;ccedil;alım. Bu uygulamaya web servisinden elde edeceğimiz raporu g&amp;ouml;sterecek olan bir Cyrstal Report Viewer nesnesini ekleyelim. Sayfamız aşağıdakine benzer bir yapıda olabilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk72_3.gif" alt="" width="388" height="165" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 3: İstemci Asp.Net sayfasının tasarım g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml;.&lt;/p&gt;
&lt;p&gt;Tanımlanmış olan bir web servisini, bir istemciye eklemek i&amp;ccedil;in, Add Web Reference se&amp;ccedil;eneğini kullanırız. Bu durum, elbetteki XML Rapor Web Servisleri i&amp;ccedil;inde ge&amp;ccedil;erlidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk72_4.gif" alt="" width="231" height="266" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 4. XML Rapor Web Servisinin İstemci Uygulamaya Refernas Edilmesi.&lt;/p&gt;
&lt;p&gt;Buradab karşımıza aşağıdaki pencere gelicektir. Biz yerel makinede &amp;ccedil;alıştığımız ve web servisimizide localhost'umuzda geliştirdiğimiz i&amp;ccedil;in, kullanılabilir web servislerini &amp;ouml;ğrenmek amacıyla getirilen listeden, Web services on the local machine linkini se&amp;ccedil;ebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk72_5.gif" alt="" width="407" height="256" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 5. Kullanılabilir web servislerinin &amp;ouml;ğrenilmesi.&lt;/p&gt;
&lt;p&gt;Bu linki se&amp;ccedil;tiğimiz takdirde sistemde kullanabileceğimiz web servisleri ekrana gelicektir. Bu servislerden bir taneside, geliştirmiş olduğumuz XML Rapor Web Servisidir. Bu raporu se&amp;ccedil;erek, web servisine ait referansı uygulamamıza ekleyelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk72_6.gif" alt="" width="407" height="147" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 6. XML Rapor Web Servisimizin Se&amp;ccedil;ilmesi&lt;/p&gt;
&lt;p&gt;XML Rapor Web Servisimizin se&amp;ccedil;ilip, istemci uygulamamıza eklenmesi ile birlikte, vs.net bu web servisine ait wsdl dosyasını talep eder. Wsdl d&amp;ouml;k&amp;uuml;manı web servisinin public aray&amp;uuml;z&amp;uuml;n&amp;uuml;n bir g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; xml formatında istemci uygulamada kullanabilmemizi sağlar. Bu işlemin ardından, istemci uygulamada XML Rapor Web Servisimize ait Wsdl d&amp;ouml;k&amp;uuml;manıda otomatik olarak oluşturulur. Bu d&amp;ouml;k&amp;uuml;man yardımıyla da, web servisimiz ile aramızdaki ilişkiyi nesnesel bazda ger&amp;ccedil;ekleştirebilmemizi sağlayan proxy sınıfımız oluşturulacaktır. Bu durumda Solution Explorer' da projemizin son halinin aşağıdaki gibi olduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk72_7.gif" alt="" width="257" height="275" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 7. Proxy Sınıfımız Oluşturulur.&lt;/p&gt;
&lt;p&gt;Artık tek yapmamız gereken, XML Rapor Web Servisimizden elde edeceğimiz raporun i&amp;ccedil;eriğini, Crystal Report Viewer nesnemizde g&amp;ouml;stermek. Bunun i&amp;ccedil;in aşağıdaki basit kod satırlarını uygulamamıza eklememiz yeterli olucaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnRaporla_Click(object sender, System.EventArgs e)
{
    /* &amp;Ouml;ncelikle proxy sınıfımıza ait bir nesne &amp;ouml;rneğini oluşturuyoruz. */
    localhost.MusteriRaporlariService rapor=new RaporIstemci.localhost.MusteriRaporlariService(); 
    this.CrystalReportViewer1.ReportSource=rapor; // Web sayfamızdaki CrystalReportViewer nesnemize rapor kaynağı olarak, proxy nesnemizi atıyoruz. */
    this.CrystalReportViewer1.DataBind(); /* Nesnemizi gelen rapor verilerine bağlıyoruz.*/
}&lt;/pre&gt;
&lt;p&gt;Burada olanları kısaca &amp;ouml;zetlemek gerekirse; &amp;ouml;ncelikle XML Rapor Web Servisimizin istemci uygulama i&amp;ccedil;in oluşturulan proxy sınıfından bir nesne &amp;ouml;rnekledik. B&amp;ouml;ylece, istemcimizdeki Crystal Rapor nesnemiz, bu proxy sınıfından elde edilen verileri g&amp;ouml;sterecek. Elbetteki proxy nesnemizde bu verileri, XML Rapor Web Servisimizden almakta. Web sayfamızı &amp;ccedil;alıştırıp, buton kontrol&amp;uuml;m&amp;uuml;ze tıkladığımızda aşağıdakine benzer bir sayfa ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk72_8.gif" alt="" width="628" height="370" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 8. Raporun Elde Edilmesi.&lt;/p&gt;
&lt;p&gt;Bu makalemizde en basit haliyle, XML Rapor Web Servislerinin nasıl oluşturulduğunu ve kullanıldığını incelemeye &amp;ccedil;alıştık. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi kilit nokta, raporun web servisi olarak yayınlanmasıdır. (Publish As Web Service) Diğer taraftan geri kalan b&amp;uuml;t&amp;uuml;n işlemler web servislerinin istemcilerde kullanılmasındaki teknikler ile aynıdır. İlerleyen makalelerimizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-06-10 12:00:00</pubDate>
  <slug>XML-Rapor-Web-Servisleri-bsenyurt-com-dan</slug>
  <tags>
    <tag>xml-web-services</tag>
    <tag>report-services</tag>
  </tags>
  <categories>
    <category>XML Web Services</category>
  </categories>
</post>