<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF - MTOM ve Stream Kullanarak Veri Aktarımı</title>
  <description>Günümüzde resim,ses, video, doküman formatında kaynakların yoğun olarak kullanıldığı pek çok sistem bulunmaktadır. Söz gelimi içerik yönetim sistemleri(Content Management Systems) neredeyse sırf bu tip verilerin kullanılması üzerine kurulmuştur. Resim, ses, video formatındaki veri kaynaklarının oluşturduğu en büyük problem ise boyutlarının söz konusu sistemlerde ne kadar etkin bir şekilde ölçeklenebildiğidir. Büyük boyutlu dosyalar çeşitli amaçlarla kullanılabilirler.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;G&amp;uuml;n&amp;uuml;m&amp;uuml;zde resim,ses, video, dok&amp;uuml;man formatında kaynakların yoğun olarak kullanıldığı pek &amp;ccedil;ok sistem bulunmaktadır. S&amp;ouml;z gelimi &lt;strong&gt;i&amp;ccedil;erik y&amp;ouml;netim sistemleri(Content Management Systems) &lt;/strong&gt;neredeyse sırf bu tip verilerin kullanılması &amp;uuml;zerine kurulmuştur. Resim, ses, video formatındaki veri kaynaklarının oluşturduğu en b&amp;uuml;y&amp;uuml;k problem ise boyutlarının s&amp;ouml;z konusu sistemlerde ne kadar etkin bir şekilde &amp;ouml;l&amp;ccedil;eklenebildiğidir. B&amp;uuml;y&amp;uuml;k boyutlu dosyalar &amp;ccedil;eşitli ama&amp;ccedil;larla kullanılabilirler.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin bir şirketin t&amp;uuml;m d&amp;ouml;k&amp;uuml;mantasyon alt yapısı bu tip b&amp;uuml;y&amp;uuml;k b&amp;uuml;y&amp;uuml;k dosyalar &amp;uuml;zerine kurulu olabilir. Yada &amp;uuml;retim sekt&amp;ouml;r&amp;uuml;nde g&amp;ouml;rev alan bir firmanın teknik &amp;ccedil;izimleri &lt;strong&gt;ikili(binary) &lt;/strong&gt;formatta olacak şekilde veritabanı &amp;uuml;zerinde saklanıyor olabilir. Bu tarz verilerin(ister dosyalarda ister veritabanı alanlarında saklanıyor olsunlar) aynı bilgisayarda kullanıldığı uygulamalarda boyutların artması &amp;ccedil;ok fazla problem teşkil etmeyebilir. Ancak işin i&amp;ccedil;erisine &lt;strong&gt;istemci-sunucu(Client-Server)&lt;/strong&gt; tabanlı bir ortam girdiğinde boyutların artması &amp;ouml;zellikle &lt;strong&gt;ağ(Network) &lt;/strong&gt;&amp;uuml;zerindeki trafiğe olumsuz etkiler yansıtmaktadır. Dolayısıyla farklı makinelerde koşan uygulamaların arasında bu tip b&amp;uuml;y&amp;uuml;k boyutlu verilerin aktarımında dikkat edilmesi gereken bazı &amp;ouml;nemli noktalar vardır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Servis y&amp;ouml;nelimli mimari(Service Oriented Architecture) &lt;/strong&gt;uygulamaların geliştirilmesinde kullanılan bazı platformalar, istemci(Client) ve servisler(Service) arasında resim, ses, video gibi y&amp;uuml;ksek boyutlu i&amp;ccedil;eriklere sahip olabilecek verilerin taşınması amacıyla &amp;ccedil;oğunlukla &lt;strong&gt;MTOM(Message Transimision Optimization Mechanism)&lt;/strong&gt; standardını kullanırlar. &lt;strong&gt;WC3&lt;/strong&gt; tarafından kabul edilmiş bu standarda g&amp;ouml;re &lt;strong&gt;ikili(binary)&lt;/strong&gt; formattaki verilerin aktarılması daha performanslıdır. &lt;strong&gt;Windows Communication Foundation&lt;/strong&gt; mimarisi de, mesajların MTOM ile taşınabilmesine olanak sağlamaktadır.&lt;/p&gt;
&lt;p&gt;Normal şartlarda &lt;strong&gt;HTTP&lt;/strong&gt; &amp;uuml;zerinden hizmet veren herhangibir servis i&amp;ccedil;erisindeki metodların parametrik yapısı ve d&amp;ouml;n&amp;uuml;ş tipine bakıldığında, istemci ve servis arasında hareket eden &lt;strong&gt;SOAP(Simple Object Access Protocol)&lt;/strong&gt; paketlerinin ikili formattaki verileri text formatına kodlandığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r. &amp;Ccedil;ok doğal olarak bu &lt;strong&gt;kodlama(encoding) &lt;/strong&gt;işlemleri servis tarafına ek bir y&amp;uuml;k getirmektedir. Aynı y&amp;uuml;k istemciye ulaşan mesajın i&amp;ccedil;eriğindeki &lt;strong&gt;text&lt;/strong&gt; tabanlı bilginin tekrar &lt;strong&gt;&amp;ccedil;&amp;ouml;z&amp;uuml;mlenerek(decoding)&lt;/strong&gt; orjinal ikili formattaki haline getirilmesi i&amp;ccedil;inde s&amp;ouml;z konusudr. Buradaki metodun yapısı gereği sahip olduğu sayısal nitelikteki ikili değerleri text olarak kodlamalası(encoding) &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k problem değildir. Ne varki bir resim dosyasının bu şekilde ele alınması halinde boyutun artması, kodlama(encoding) işleminin uzaması ve zaman alması anlamınada gelmektedir. Burada ikili formattaki veri i&amp;ccedil;eriğinin text formatlı olması yerine 1 ve 0' lardan oluşacak şekilde kodlanması g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Ancak bu durumdada milyonlarca 1 ve 0' dan ibaret bir veri yığınının oluşmasıda ka&amp;ccedil;ınılmazdır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF(Windows Communication Foundation)&lt;/strong&gt; mimarisinde servis tarafındaki metodlar varsayılan olarak &lt;strong&gt;Base64&lt;/strong&gt; tabanlı olacak şekilde bir kodlama(encoding) ve &amp;ccedil;&amp;ouml;z&amp;uuml;mleme(decoding) işlemine tabi tutulurlar. Bu işlem sayesinde ikili (binary) formattaki verinin daha az yer tutması sağlanabilir. Ne varki Microsoft kaynaklarının belirttiğine g&amp;ouml;re, bu kodlama orjinal veri boyutunu yaklaşık olarak&lt;strong&gt; %140 &lt;/strong&gt;oranında da arttırmaktadır. İşte &lt;strong&gt;MTOM(Message Transmision Optimization Mechanism)&lt;/strong&gt; tabanlı mesajlaşma ile veri i&amp;ccedil;eriğinin&lt;strong&gt; kodlama(encoding)&lt;/strong&gt; ve &lt;strong&gt;&amp;ccedil;&amp;ouml;z&amp;uuml;mleme(decoding)&lt;/strong&gt; işlemine gerek kalmadan taraflar arasında taşınabilmesi sağlanmaktadır. Bunun en b&amp;uuml;y&amp;uuml;k nedeni MTOM' un ikili formattaki veri i&amp;ccedil;eriğini orjinal mesaja bir &lt;strong&gt;ek(Attachment)&lt;/strong&gt; olacak şekilde taşıtmasıdır. Aşağıdaki şekilde bu durum biraz daha net bir şekilde ifade edilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk232_1.gif" alt="" width="599" height="359" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekilde dikkat edileceği &amp;uuml;zere, binary formattaki i&amp;ccedil;erik bozulmadan bir &lt;strong&gt;MIME(Multipurpose Internet Mail Extension)&lt;/strong&gt; paketi i&amp;ccedil;erisine alınmaktadır. Kalan i&amp;ccedil;erik yine bozulmadan text tabanlı olacak şekilde &lt;strong&gt;SOAP Zarfı(Envelope)&lt;/strong&gt; halinde &lt;strong&gt;MIME&lt;/strong&gt; Mesajı i&amp;ccedil;erisine aktarılır. &lt;strong&gt;SOAP g&amp;ouml;vdesinde(Body)&lt;/strong&gt; artık MIME mesajına ilave edilen binary i&amp;ccedil;eriğin referansı tutulmaktadır. B&amp;ouml;ylece servis veya istemi tarafında, binary i&amp;ccedil;eriğin text formatına kodlanması(ve tam tersinin yapılması) işlemleri ortadan kalkmaktadır. Buda &amp;ccedil;ok doğal olarak mesajların hazırlanma, g&amp;ouml;nderme ve işlenme s&amp;uuml;relerinin inanılmaz derecede azalması anlamına gelmektedir.&lt;/p&gt;
&lt;table id="table178" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td valign="top" width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;MTOM(Message Transmision Optimization Mechanism) tabanlı mesajların g&amp;uuml;venliğinde &lt;/em&gt;&lt;strong&gt; &lt;em&gt;imzalar(signature)&lt;/em&gt; &lt;/strong&gt;&lt;em&gt;kullanılır. WCF bu imzaları kontrol ederek alınan veya g&amp;ouml;nderilen MIME i&amp;ccedil;eriğindeki eklerin(attachments) bozulup bozulmadığını anlayabilir ve buna g&amp;ouml;re uygun &amp;ccedil;alışma zamanı istisnalarını fırlatabilir.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Windows Communication Foundation mimarisinde &lt;strong&gt;HTTP&lt;/strong&gt; bazlı olan bağlayıcı tiplerin tamamı &lt;strong&gt;MTOM&lt;/strong&gt; tipinde mesajlaşmayı desteklemektedir. Ne varki &lt;strong&gt;TCP&lt;/strong&gt;, &lt;strong&gt;MSMQ&lt;/strong&gt; gibi protokoller &amp;uuml;zerinde &amp;ccedil;alışan &lt;strong&gt;bağlayıcı tiplerin(Binding Type) &lt;/strong&gt;bu tip bir desteği yoktur. Bunun en b&amp;uuml;y&amp;uuml;k sebebi ise, bu protokollerin &lt;strong&gt;ikili(binary) &lt;/strong&gt;formattaki veriler i&amp;ccedil;in kendi standartlarını kullanıyor olmalarıdır. Ancak daha &amp;ouml;ncedende değinildiği gibi, &lt;strong&gt;&amp;ouml;zel bağlayıcı tipler(Custom Binding Types) &lt;/strong&gt;geliştirilerek &lt;strong&gt;TCP&lt;/strong&gt; gibi bir protokol &amp;uuml;zerinde &lt;strong&gt;MTOM&lt;/strong&gt; kullanımı teorik olarak sağlanabilmektedir. Aşağıdaki tabloda MTOM tipinde mesajlaşmaya destek veren(vermeyen) bağlayıcı tipler işaret edilmektedir.&lt;/p&gt;
&lt;table style="border-collapse: collapse; width: 465px;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="width: 169px; background-color: #ffffff;" bgcolor="#336699" width="169"&gt;&lt;strong&gt; Bağlayıcı Tip&lt;br /&gt; (Binding Types)&lt;/strong&gt;&lt;/td&gt;
&lt;td style="width: 169px; background-color: #ffffff;" bgcolor="#336699" width="273"&gt;&lt;strong&gt; Mesaj Kodlama/&amp;Ccedil;&amp;ouml;z&amp;uuml;mleme Tipleri&lt;br /&gt; (Message Encoding/Decoding Types)&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="169"&gt;&lt;strong&gt; BasicHttpBinding&lt;/strong&gt;&lt;/td&gt;
&lt;td width="273"&gt;&lt;strong&gt;Text / MTOM&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="169"&gt;NetTcpBinding&lt;/td&gt;
&lt;td width="273"&gt;Binary&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="169"&gt;NetPeerTcpBinding&lt;/td&gt;
&lt;td width="273"&gt;Binary&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="169"&gt;NetNamedPipeBinding&lt;/td&gt;
&lt;td width="273"&gt;Binary&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="169"&gt;&lt;strong&gt;WSHttpBinding&lt;/strong&gt;&lt;/td&gt;
&lt;td width="273"&gt;&lt;strong&gt;Text / MTOM&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="169"&gt;&lt;strong&gt; WSFederationBinding&lt;/strong&gt;&lt;/td&gt;
&lt;td width="273"&gt;&lt;strong&gt;Text / MTOM&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="169"&gt;NetMsmqBinding&lt;/td&gt;
&lt;td width="273"&gt;Binary&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="169"&gt;MsmqIntegrationBinding&lt;/td&gt;
&lt;td width="273"&gt;Binary&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="169"&gt;&lt;strong&gt; WSDualHttpBinding&lt;/strong&gt;&lt;/td&gt;
&lt;td width="273"&gt;&lt;strong&gt;Text / MTOM&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Konuyu daha iyi anlayabilmek i&amp;ccedil;in &amp;ouml;rnek bir senaryo &amp;uuml;zerinden hareket etmekte fayda vardır. Bu ama&amp;ccedil;la &lt;strong&gt;AdventureWorks&lt;/strong&gt; veritabanında yer alan &amp;uuml;r&amp;uuml;nlere ait fotoğrafların tutulduğu &lt;strong&gt;ProductPhoto&lt;/strong&gt; tablosundan yararlanılabilir. S&amp;ouml;z konusu tabloda&lt;strong&gt; varBinary(MAX) &lt;/strong&gt;SQL tipinden &lt;strong&gt;LargePhoto&lt;/strong&gt; isimli bir alan yer almaktadır. İlerleyen &amp;ouml;rnekte LargePhoto isimli alanın i&amp;ccedil;eriğinin MTOM ve Stream bazlı olacak şekilde istemci tarafına aktarılması &amp;uuml;zerinde durulacaktır. Senaryoda g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınacak tablolar aşağıdaki &lt;strong&gt;veritabanı diagramında(Database Diagram) &lt;/strong&gt;olduğu gibidir. &amp;Ouml;ncelikli olarak en azından istemciye &amp;uuml;r&amp;uuml;n adı ve fotoğraf numarası bilgilerinin g&amp;ouml;nderilmesinde yarar vardır. Sonrasında istemcinin se&amp;ccedil;tiği &amp;uuml;r&amp;uuml;ne ait fotoğrafın binary i&amp;ccedil;eriği servis tarafından geriye doğru aktarılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk232_2.gif" alt="" width="556" height="438" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Servis tarafındaki uygulamanın istemciye &amp;uuml;r&amp;uuml;n listesini ve se&amp;ccedil;tiği &amp;uuml;r&amp;uuml;ne ait resmi veren fonksiyonellikler i&amp;ccedil;erdiği d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Bu fonksiyonellikleri i&amp;ccedil;eren servis sınıfı ve &amp;uuml;yeleri her zamanki gibi bir &lt;strong&gt;WCF Servis K&amp;uuml;t&amp;uuml;phanesi(WCF Servis Library)&lt;/strong&gt; olacak şekilde aşağıdaki gibi tasarlanabilir. S&amp;ouml;z konusu k&amp;uuml;t&amp;uuml;phane i&amp;ccedil;erisinde yer alacak temel tiplerin sınıf diagramındaki(Class Diagram) g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ise aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk232_3.gif" alt="" width="636" height="357" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekte &amp;uuml;r&amp;uuml;nlere ait fotoğraf bilgilerinin istemciye taşınması i&amp;ccedil;in &lt;strong&gt;ProductInfo&lt;/strong&gt; isimli bir sınıftan yararlanılmaktadır. Bu sınıfın i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Runtime.Serialization;

namespace ProductPhotoServiceLibrary
{
    [DataContract]
    public class ProductInfo
    {
        private int _productPhotoId;
        private string _name;

        [DataMember]
        public string Name
        {
            get { return _name; }
            set { _name = value; }
        }

        [DataMember]
        public int ProductPhotoId
        {
            get { return _productPhotoId; }
            set { _productPhotoId = value; }
        }

        public ProductInfo(int productId, string name)
        {
            ProductPhotoId = productId;
            Name = name;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu sınıfta dikkat edilmesi gereken nokta, bir &lt;strong&gt;veri s&amp;ouml;zleşmesi(Data Contract)&lt;/strong&gt; tanımlıyor olmasıdır. Bu nedenle &lt;strong&gt;sınıf(Class) DataContract&lt;/strong&gt;, &lt;strong&gt;&amp;ouml;zellikleri(Properties)&lt;/strong&gt; ise &lt;strong&gt;DataMember&lt;/strong&gt; nitelikleri ile imzalanmıştır. &lt;strong&gt;Servis s&amp;ouml;zleşmesi(Service Contract)&lt;/strong&gt; i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using System.Collections.Generic;

namespace ProductPhotoServiceLibrary
{
    [ServiceContract(Name="Photo Service",Namespace="http://www.bsenyurt.com/ProductPhotoService")]
    public interface IPhotoService
    {
        [OperationContract(IsInitiating=true)]
        List&amp;lt;ProductInfo&amp;gt; GetProducts();

        [OperationContract]
        byte[] GetPhotoByProductId(int productPhotoId);
    } 
}&lt;/pre&gt;
&lt;p&gt;Aray&amp;uuml;z&amp;uuml;n uygulandığı &lt;strong&gt;PhotoService&lt;/strong&gt; sınıfının i&amp;ccedil;eriği ise aşağıdaki gibidir&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data.SqlClient;
using System.Collections.Generic;

namespace ProductPhotoServiceLibrary
{
    public class PhotoService : IPhotoService
    {
        string conStr = "data source=.;database=AdventureWorks;integrated security=SSPI";

        #region IPhotoService Members
    
        // İstemci i&amp;ccedil;in gerekli olan &amp;uuml;r&amp;uuml;n adları ve fotoğraf numaraları, generic bir List koleksiyonu ile geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmektedir.
        public List&amp;lt;ProductInfo&amp;gt; GetProducts()
        {
            // Generic List koleksiyonu oluşturulur
            List&amp;lt;ProductInfo&amp;gt; infos = new List&amp;lt;ProductInfo&amp;gt;();

            using (SqlConnection conn = new SqlConnection(conStr))
            {
                // Sql sorgusunda Join kullanılmasının sebebi ProductPhotoId değerleri ve Name alanlarının değerlerinin elde edilmesidir.
                using (SqlCommand cmd = new SqlCommand("Select PP.ProductPhotoId,[Name] From Production.Product P Join Production.ProductProductPhoto PP on P.ProductId=PP.ProductID", conn))
                {
                    conn.Open();
                    SqlDataReader reader = cmd.ExecuteReader();
                    while (reader.Read())
                    {
                        // Elde edilen her bir satır i&amp;ccedil;in ProductInfo sınıfına ait bir nesne &amp;ouml;rneklenip generic koleksiyona eklenir.
                         infos.Add(new ProductInfo(Convert.ToInt16(reader[0]), reader[1].ToString()));
                    }
                    reader.Close();
                }
            }
            return infos;
        }

        // Belirli bir fotoğraf numarasına sahip olan LargePhoto alanının i&amp;ccedil;eriği byte dizisi olacak şekilde geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;r.
        public byte[] GetPhotoByProductId(int productPhotoId)
        {
            byte[] photoContent = null;
        
            using (SqlConnection conn = new SqlConnection(conStr))
            {
                using (SqlCommand cmd = new SqlCommand("Select LargePhoto From Production.ProductPhoto Where ProductPhotoId=@PId", conn))
                {
                    cmd.Parameters.AddWithValue("@PId", productPhotoId);
                    conn.Open();
                    SqlDataReader reader = cmd.ExecuteReader();
                    // Burada GetSqlBytes metodu ilgili alanın i&amp;ccedil;eriğinin binary olarak byte dizisine aktarılmasında yardımcı rol oynamaktadır.
                    if (reader.Read())
                        photoContent = reader.GetSqlBytes(0).Value;
                    reader.Close();
                }
            }
    
            return photoContent;
        }
    
        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;PhotoService&lt;/strong&gt; isimli sınıf şu an i&amp;ccedil;in iki adet metoda sahiptir. &lt;strong&gt;GetProducts&lt;/strong&gt; isimli metod basit olarak geriye &lt;strong&gt;ProductInfo&lt;/strong&gt; tipinden nesne &amp;ouml;rneklerinden oluşan &lt;strong&gt;generic&lt;/strong&gt; bir &lt;strong&gt;List&amp;lt;&amp;gt;&lt;/strong&gt; koleksiyonu d&amp;ouml;nd&amp;uuml;rmektedir. &lt;strong&gt;GetPhotoByProductId&lt;/strong&gt; metodu geriye &lt;strong&gt;byte[] &lt;/strong&gt;tipinden bir dizi d&amp;ouml;nd&amp;uuml;rmektedir. Bu dizi tahmin edileceği &amp;uuml;zere tabloda &lt;strong&gt;varbinary(MAX) &lt;/strong&gt;tipinden olan &lt;strong&gt;LargePhoto&lt;/strong&gt; isimli alanın i&amp;ccedil;eriğini taşımaktadır.&lt;/p&gt;
&lt;table id="table181" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td valign="top" width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;&lt;strong&gt;Binary&lt;/strong&gt; dosyanın boyutunun &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k olması halinde par&amp;ccedil;alı olacak şekilde veri i&amp;ccedil;eriğinin toplanması g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Yapılması gereken servis tarafındaki fonksiyonellik i&amp;ccedil;erisinde resim i&amp;ccedil;eriğini veritabanı tablosunda par&amp;ccedil;alı olacak şekilde okuyup toparlamaktır.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Şimdilik servis tarafı &lt;strong&gt;MTOM(Message Transmision Optimization Mechanism)&lt;/strong&gt; formatı yerine &lt;strong&gt;Text&lt;/strong&gt; formatında mesaj kodlaması yapmaktadır. Olayın daha net analiz edilmesi amacıylada gerekli &lt;strong&gt;Diagnostics&lt;/strong&gt; se&amp;ccedil;enekleri aktif hale getirilmektedir. Servis tarafının i&amp;ccedil;eriği basit olarak aşağıdaki gibidir. &lt;em&gt;(Servis IIS &amp;uuml;zerinde host edilecek şekilde tasarlanmaktadır.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Service.svc;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ ServiceHost Language="C#" Debug="true" Service="ProductPhotoServiceLibrary.PhotoService" %&amp;gt;&lt;/pre&gt;
&lt;p&gt;Servis(Service) tarafında mesajlaşma ile ilişkili olan i&amp;ccedil;eriği izleyebilmek adına &lt;strong&gt;Diagnostics&lt;/strong&gt; &amp;ouml;zellikleri a&amp;ccedil;ılmıştır. Buna g&amp;ouml;re &lt;strong&gt;web.config &lt;/strong&gt;dosyasının i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;web.config;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0"?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.diagnostics&amp;gt;
        &amp;lt;sources&amp;gt;
            &amp;lt;source name="System.ServiceModel.MessageLogging" switchValue="Verbose,ActivityTracing"&amp;gt;
                &amp;lt;listeners&amp;gt;
                    &amp;lt;add type="System.Diagnostics.DefaultTraceListener" name="Default"&amp;gt;
                        &amp;lt;filter type="" /&amp;gt;
                    &amp;lt;/add&amp;gt;
                    &amp;lt;add name="ServiceModelMessageLoggingListener"&amp;gt;
                        &amp;lt;filter type="" /&amp;gt;
                    &amp;lt;/add&amp;gt;
                &amp;lt;/listeners&amp;gt;
            &amp;lt;/source&amp;gt;
            &amp;lt;source name="System.ServiceModel" switchValue="Verbose,ActivityTracing" propagateActivity="true"&amp;gt;
                &amp;lt;listeners&amp;gt;
                    &amp;lt;add type="System.Diagnostics.DefaultTraceListener" name="Default"&amp;gt;
                        &amp;lt;filter type="" /&amp;gt;
                    &amp;lt;/add&amp;gt;
                    &amp;lt;add name="ServiceModelTraceListener"&amp;gt;
                        &amp;lt;filter type="" /&amp;gt;
                    &amp;lt;/add&amp;gt;
                &amp;lt;/listeners&amp;gt;
            &amp;lt;/source&amp;gt;
        &amp;lt;/sources&amp;gt;
        &amp;lt;sharedListeners&amp;gt;
            &amp;lt;add initializeData="C:\inetpub\wwwroot\AdventureProductService\ web_messages.svclog" type="System.Diagnostics.XmlWriterTraceListener, System, Version=2.0.0.0, Culture=neutral, PublicKeyToken=b77a5c561934e089" name="ServiceModelMessageLoggingListener" traceOutputOptions="Timestamp"&amp;gt;
                &amp;lt;filter type="" /&amp;gt;
            &amp;lt;/add&amp;gt;
            &amp;lt;add initializeData="C:\inetpub\wwwroot\AdventureProductService\ web_tracelog.svclog" type="System.Diagnostics.XmlWriterTraceListener, System, Version=2.0.0.0, Culture=neutral, PublicKeyToken=b77a5c561934e089" name="ServiceModelTraceListener" traceOutputOptions="Timestamp"&amp;gt;
                &amp;lt;filter type="" /&amp;gt;
            &amp;lt;/add&amp;gt;
        &amp;lt;/sharedListeners&amp;gt;
    &amp;lt;/system.diagnostics&amp;gt;
    &amp;lt;appSettings/&amp;gt;
    &amp;lt;connectionStrings/&amp;gt;
    &amp;lt;system.web&amp;gt;
        &amp;lt;compilation debug="true"&amp;gt;
        &amp;lt;/compilation&amp;gt;
        &amp;lt;authentication mode="Windows" /&amp;gt;
    &amp;lt;/system.web&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;behaviors&amp;gt;
            &amp;lt;serviceBehaviors&amp;gt;
                &amp;lt;behavior name="PhotoServiceBehavior"&amp;gt;
                    &amp;lt;serviceMetadata httpGetEnabled="true" /&amp;gt;
                    &amp;lt;serviceDebug includeExceptionDetailInFaults="true" /&amp;gt;
                &amp;lt;/behavior&amp;gt;
            &amp;lt;/serviceBehaviors&amp;gt;
        &amp;lt;/behaviors&amp;gt;
        &amp;lt;diagnostics&amp;gt;
            &amp;lt;messageLogging logEntireMessage="true" logMalformedMessages="true" logMessagesAtTransportLevel="true" /&amp;gt;
        &amp;lt;/diagnostics&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service behaviorConfiguration="PhotoServiceBehavior" name="ProductPhotoServiceLibrary.PhotoService"&amp;gt;
                &amp;lt;endpoint address="http://localhost/AdventureProductService/Service.svc" binding="basicHttpBinding" bindingConfiguration="" name="ProductPhotoHttpEndPoint" contract="ProductPhotoServiceLibrary.IPhotoService" /&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Servis tarafı &lt;strong&gt;basicHttpBinding&lt;/strong&gt; bağlayıcı tipini kullanan bir &lt;strong&gt;EndPoint&lt;/strong&gt; sunmaktadır. Bununla birlikte istemcilerin &lt;strong&gt;HTTP&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;proxy&lt;/strong&gt; sınıflarını elde edebilmeleri i&amp;ccedil;in &lt;strong&gt;metaData&lt;/strong&gt; &lt;strong&gt;Publishing&lt;/strong&gt; etkin kılınmıştır. Mesajların i&amp;ccedil;eriğinin daha detaylı bir şekilde analiz edilebilmesi amacıyla &lt;strong&gt;Tracing&lt;/strong&gt; ve &lt;strong&gt;Message Logging &lt;/strong&gt;&amp;ouml;zellikleri aktif hale getirilmiştir. Bu ayarlar elbetteki &lt;strong&gt;Microsoft Service Configuration Editor &lt;/strong&gt;yardımıyla belirlenmek istenirse aşağıdaki adımlar takip edilebilir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikli olarak Enable MessageLoging ve Enable Tracing tıklanarak aktif hale getirilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk232_4.gif" alt="" width="639" height="445" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sonrasında ise &lt;strong&gt;Diagnostics&lt;/strong&gt; altındaki &lt;strong&gt;Message Logging&lt;/strong&gt; klas&amp;ouml;r&amp;uuml;ne tıklandıktan sonra &amp;ouml;zellikler penceresinden &lt;strong&gt;LogEntireMessage&lt;/strong&gt; değeri &lt;strong&gt;true&lt;/strong&gt; olarak ayarlanmalıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk232_5.gif" alt="" width="557" height="276" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Sources&lt;/strong&gt; klas&amp;ouml;r&amp;uuml; altında yer alan &lt;strong&gt;System.ServiceModel.MessageLogging&lt;/strong&gt; ve &lt;strong&gt;System.ServiceModel&lt;/strong&gt; elementlerinin &lt;strong&gt;Trace Level&lt;/strong&gt; &amp;ouml;zelliklerine &lt;strong&gt;Verbose&lt;/strong&gt; değeri atanmalıdır. B&amp;ouml;ylece mesaj aktivitelerin en ince ayrıntısına kadar izlenmesi olanaklı hale gelecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk232_6.gif" alt="" width="615" height="270" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk232_7.gif" alt="" width="568" height="265" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim istemci tarafına. İstemci program basit bir &lt;strong&gt;Windows&lt;/strong&gt; uygulaması olarak tasarlanabilir. Programın aray&amp;uuml;z&amp;uuml; ve kodlarının i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk232_8.gif" alt="" width="577" height="316" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;(Servis tarafına ait Proxy sınıfının oluşturulması i&amp;ccedil;in &lt;strong&gt;Add Service Reference&lt;/strong&gt; se&amp;ccedil;eneği kullanılmaldırı.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Add Service Reference &lt;/strong&gt;sonrası otomatik olarak bir &lt;strong&gt;App.config &lt;/strong&gt;dosyası oluşturulacak ve i&amp;ccedil;erisine başlangı&amp;ccedil; değerleri atanacaktır.&lt;/p&gt;
&lt;p&gt;Windows uygulamasına ait kodlar ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.IO;
using System.Text;
using System.Data;
using System.Drawing;
using System.Windows.Forms;
using System.ComponentModel;
using Istemci.AdventureService;
using System.Collections.Generic;

namespace Istemci
{
    public partial class Form1 : Form
    {
        PhotoServiceClient client = null;

        public Form1()
        {
            InitializeComponent();
            client = new PhotoServiceClient();
        }

        private void button1_Click(object sender, EventArgs e)
        {
            // Servis tarafındaki GetProducts metodu ile ProductInfo tipinden dizi elde edilir ve her bir elemanı listBox1 isimli ListBox kontrol&amp;uuml;ne eklenir.
            ProductInfo[] infos=client.GetProducts();
            foreach (ProductInfo info in infos)
                listBox1.Items.Add(info);
        }

        private void listBox1_SelectedIndexChanged(object sender, EventArgs e)
        {
            short photoId = 0;
            // Se&amp;ccedil;ilen ListBox elemanı ProductInfo tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;ld&amp;uuml;kten sonra ProductPhotoId &amp;ouml;zelliğinin değeri elde edilir.
            Int16.TryParse(((ProductInfo)listBox1.SelectedItem).ProductPhotoId.ToString(), out photoId);
            // GetPhotoByProductId metoduna photoId değeri aktarılarak byte[] dizisi elde edilir ve bir MemoryStream nesnesi &amp;ouml;rneklenir.
            MemoryStream stream=new MemoryStream(client.GetPhotoByProductId(photoId));
            // MemoryStream &amp;ouml;rneğinden yararlanılarak Image nesnesi oluşturulur ve PictureBox kontrol&amp;uuml;n&amp;uuml;n Image &amp;ouml;zelliğine atanır.
            pictureBox1.Image=Image.FromStream(stream);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Burada dikkat edilmesi gereken birka&amp;ccedil; nokta vardır. &lt;strong&gt;GetProducts&lt;/strong&gt; metodu geriye&lt;strong&gt; List&amp;lt;ProductInfo&amp;gt; &lt;/strong&gt;tipinden bir generic koleksiyon yerine &lt;strong&gt;ProductInfo&lt;/strong&gt; tipinden bir dizi d&amp;ouml;nd&amp;uuml;rmektedir. Diğer taraftan istemci bir Windows uygulaması olduğundan ComboBox kontrol&amp;uuml; i&amp;ccedil;erisine dizi doğrudan bağlanamaz. Bir başka deyişle &lt;strong&gt;DataSource&lt;/strong&gt; &amp;ouml;zelliğini burada kullanmak yeterli olmayacaktır. Bu nedenle ProductInfo tipinden dizi i&amp;ccedil;erisindeki elemanların tek tek dolaşılması ve &amp;ouml;ğe olarak eklenmesi gerekmektedir. Ancak bu durumdada &lt;strong&gt;ListBox&lt;/strong&gt; i&amp;ccedil;erisinde &amp;uuml;r&amp;uuml;n adlarının g&amp;ouml;r&amp;uuml;lebilmesi i&amp;ccedil;in &lt;strong&gt;ToString&lt;/strong&gt; metodunun ezilmiş olması şarttır. Bilindiği gibi servis tarafındaki geliştirici tanımlı tiplere ait metodlar istemci tarafında serileştirilmemektedir. O nedenle, ToString metodunun ezilmiş hali sadece bu &amp;ouml;rnekte yardımcı olması a&amp;ccedil;ısından istemci tarafındaki uygulamada bilin&amp;ccedil;li olarak aşağıdaki gibi ezilmektedir. Bir ger&amp;ccedil;ek hayat senaryosunda bu &amp;ccedil;ok kontrol edilebilir bir durum olamayabilir. Nitekim g&amp;uuml;ncelleştirme ve &amp;ouml;l&amp;ccedil;eklendirme zorlaşmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk232_9.gif" alt="" width="639" height="260" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu değişikliğin arkasından &lt;strong&gt;ListBox&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;SelectedItem&lt;/strong&gt; &amp;ouml;zelliği ile elde edilen &lt;strong&gt;Object&lt;/strong&gt; referansı &lt;strong&gt;ProductInfo&lt;/strong&gt; tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;l&amp;uuml;p &lt;strong&gt;ProductPhotoId&lt;/strong&gt; &amp;ouml;zelliğinin değeri elde edilebilir. Dolayısıyla &amp;ouml;rnek &amp;ccedil;alıştırıldığında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer sonu&amp;ccedil;lar elde edilecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk232_10.gif" alt="" width="568" height="300" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim asıl konumuza. Bakalım log dosyalarında ne gibi sonu&amp;ccedil;lara varacağız. &amp;Ouml;ncelikli olarak &lt;strong&gt;Service Trace Viewer&lt;/strong&gt; yardımıyla &lt;strong&gt;web_tracelog.svc&lt;/strong&gt; dosyasının a&amp;ccedil;ılması gerekmektedir. Bu ana kadar yapılanların tek amacı s&amp;ouml;z konusu dosya i&amp;ccedil;erisinde, istemciye g&amp;ouml;nderilen mesaj formatının text tabanlı olduğunun ispat edilmesidir. İlk olarak &lt;strong&gt;Activity&lt;/strong&gt; kısmından &lt;strong&gt;Process action "http://www.bsenyurt.com/ProductPhotoService/ Photo_x0020_Service/GetPhotoByProductId&lt;/strong&gt; b&amp;ouml;l&amp;uuml;m&amp;uuml; se&amp;ccedil;ilir. Bu işlemin ardından &lt;strong&gt;A message was written&lt;/strong&gt; &lt;strong&gt;Description&lt;/strong&gt; b&amp;ouml;l&amp;uuml;m&amp;uuml;ne bakılırsa &lt;strong&gt;Encoder&lt;/strong&gt; isimli &amp;ouml;zelliğin değerinin aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi &lt;strong&gt;text/xml; charset=utf-8&lt;/strong&gt; olduğu g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk232_11.gif" alt="" width="630" height="483" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu aslında istemciye d&amp;ouml;nd&amp;uuml;r&amp;uuml;len &lt;strong&gt; byte[]&lt;/strong&gt; dizisinin &lt;strong&gt;text&lt;/strong&gt; tabanlı olacak şekilde &lt;strong&gt;XML&lt;/strong&gt; i&amp;ccedil;eriğine kodlandığının bir g&amp;ouml;stergesidir. Servis tarafından &lt;strong&gt;MTOM&lt;/strong&gt;' a uygun olacak şekilde mesaj d&amp;ouml;nd&amp;uuml;rmek i&amp;ccedil;in tek yapılması gereken &lt;strong&gt; BasicHttpBinding&lt;/strong&gt; bağlayıcı tipinin &lt;strong&gt;MessageEncoding&lt;/strong&gt; &amp;ouml;zelliğinin değerini &lt;strong&gt;MTOM&lt;/strong&gt; olarak değiştirmektir. Bunun i&amp;ccedil;in servis tarafında yeni bir &lt;strong&gt;Binding Configuration&lt;/strong&gt; elementinin &lt;strong&gt; BasicHttpBinding&lt;/strong&gt; tipi i&amp;ccedil;in aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi eklenmesi gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk232_13.gif" alt="" width="638" height="497" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sonrasında &lt;strong&gt;bağlayıcı tipin(Binding Type)&lt;/strong&gt; bu konfigurasyon ile eşleştirilmesi yeterli olacaktır. Bunun i&amp;ccedil;in &lt;strong&gt;ProductPhotoHttpEndPoint&lt;/strong&gt; &amp;ouml;zelliklerinden &lt;strong&gt; BindingConfiguration&lt;/strong&gt; elementinin değerinin aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi &lt;strong&gt;Microsoft Service Configuration Editor&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;ProductPhotoBindingConfiguration&lt;/strong&gt; olarak set edilmesi yeterlidir.&lt;/p&gt;
&lt;table id="table180" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td valign="top" width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Elbetteki servis tarafında yer alan konfigurasyon dosyasında da &lt;strong&gt;MessageEncoding&lt;/strong&gt; &amp;ouml;zelliğinin değerinin &lt;strong&gt;true&lt;/strong&gt; olarak set edilmesi gerekir. Bu yapılmadığı takdirde &lt;strong&gt;&amp;ccedil;alışma zamanında(Run Time) ProtocolException &lt;/strong&gt;tipinden bir istisna(Exception) alınabilir.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;img src="/makale/images/mk232_14.gif" alt="" width="606" height="189" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından istemci yeniden &amp;ccedil;alıştırılır ve &lt;strong&gt;Service Trace Viewer&lt;/strong&gt; kullanılarak GetProductPhotoId' den geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;len mesaj &amp;ouml;zelliklerine bakılırsa aşağıdaki sonucun ortaya &amp;ccedil;ıktığı g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk232_15.gif" alt="" width="634" height="373" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulama test edilirken dikkat &amp;ccedil;ekici noktalardan biriside bazı resim dosyaları a&amp;ccedil;ılırken aşağıdaki gibi bir &amp;ccedil;alışma zamanı hata mesajı alınmasıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk232_16.gif" alt="" width="600" height="382" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu hatanın sebebi aktarılmak istenen veri boyutunun varsayılan MaxArrayLength değerinden b&amp;uuml;y&amp;uuml;k olmasıdır. Bu sorunu &amp;ccedil;&amp;ouml;zmek i&amp;ccedil;in bağlayıcı tipin konfigurasyon ayarlarında yer alan &lt;strong&gt; MaxArrayLength&lt;/strong&gt; değerini değiştirmek yeterlidir. Bu &amp;ouml;zelliğin varsayılan değeri &lt;strong&gt;16384&lt;/strong&gt; byte' dır. &amp;Ouml;rnekte bu değer sembolik olarak &lt;strong&gt;65536&lt;/strong&gt; yapılmaktadır. Elbetteki bu &amp;ouml;zelliğin değerinin hem istemci hemde servis tarafında yapılması şarttır. S&amp;ouml;z konusu &amp;ouml;zellik aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi &lt;strong&gt;Microsoft Service Configuration Editor&lt;/strong&gt; yardımıyla değiştirilebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk232_17.gif" alt="" width="502" height="263" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından &amp;ouml;rnek uygulama &amp;ccedil;alıştırılırsa sonu&amp;ccedil;ların başarılı bir şekilde alındığı g&amp;ouml;r&amp;uuml;lebilir. Elbetteki boyutun dahada artması yine aynı &lt;strong&gt;istisnanın(Exception) &lt;/strong&gt; alınmasına neden olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;MTOM&lt;/strong&gt; standardına uygun olarak hazırlanan mesajlar sayesinde b&amp;uuml;y&amp;uuml;k boyutlu &lt;strong&gt;ikili(Binary)&lt;/strong&gt; verilerin gereksiz yere kodlanmadan aktarılması ve &amp;ccedil;&amp;ouml;z&amp;uuml;lmeden alınması m&amp;uuml;mk&amp;uuml;n olabilmektedir. Yinede veri boyutunun &amp;ccedil;ok fazla olması halinde MTOM tabanlı mesajların hazırlanmasıda zaman kaybına neden olacaktır. Nitekim s&amp;ouml;z konusu b&amp;uuml;y&amp;uuml;k veri dosyasının tek seferde &lt;strong&gt;istemciye(veya servise)&lt;/strong&gt; doğru aktarılması s&amp;ouml;z konusudur. Ayrıca bu b&amp;uuml;y&amp;uuml;k verinin alınması sırasında &lt;strong&gt;timeout&lt;/strong&gt;' lar oluşabilir. Peki &amp;ccedil;&amp;ouml;z&amp;uuml;m olarak neler yapılabilir? Eğer protokol uygunsa s&amp;ouml;z konusu b&amp;uuml;y&amp;uuml;k verilerin istemci ve servis arasında bir &lt;strong&gt;Stream&lt;/strong&gt; &amp;uuml;zerinden taşınması tercih edilmelidir. B&amp;ouml;ylece s&amp;ouml;z konusu performans kayıplarıda ortadan kalkacaktır. Nitekim mesajı tek seferde hazırlanıp tamamının g&amp;ouml;nderilmesi yerine iki taraf arasında a&amp;ccedil;ılan hat &amp;uuml;zerinden akması sağlanabilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF(Windows Communication Foundation)&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &lt;strong&gt;basicHttpBinding&lt;/strong&gt;, &lt;strong&gt; netTcpBinding&lt;/strong&gt;, &lt;strong&gt;netNamedPipeBinding&lt;/strong&gt; tipleri &lt;strong&gt;Stream&lt;/strong&gt; aktarımını desteklemektedir. Tahmin edileceği &amp;uuml;zere diğer bağlayıcı tiplerin buna tam desteği olmadığından &amp;ouml;zel &lt;strong&gt;bağlayıcı tipleri(Custom Binding Types&lt;/strong&gt;) kullanmak gerekmektedir. &lt;strong&gt;Stream&lt;/strong&gt; kullanılması i&amp;ccedil;in tek yapılması gereken &lt;strong&gt;TransferMode&lt;/strong&gt; &amp;ouml;zelliğinin değerini aşağıdaki tabloda yer alan değerlerden birisine set etmektir. &lt;em&gt; (Bağlayıcı tipin TransferMode &amp;ouml;zelliği, TransferMode enum sabiti tipinden değerler alabilmektedir.)&lt;/em&gt;&lt;/p&gt;
&lt;table style="border-collapse: collapse; width: 100%;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="width: 150px; background-color: #ffffff;" bgcolor="#336699" width="150"&gt;&lt;strong&gt; TransferMode Değeri&lt;/strong&gt;&lt;/td&gt;
&lt;td style="width: 150px; background-color: #ffffff;" bgcolor="#336699"&gt;&lt;strong&gt; A&amp;ccedil;ıklama&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="150"&gt;&lt;strong&gt;Streamed&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Serivise gelen ve servisten &amp;ccedil;ıkan mesajlar stream &amp;uuml;zerinden hareket ederler.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="150"&gt;&lt;strong&gt;StreamedRequest&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Sadece servis tarafına gelen &lt;strong&gt;taleplere(Request)&lt;/strong&gt; ait mesajların stream &amp;uuml;zerinden hareket etmesine izin verilir. Bu mod se&amp;ccedil;ildiğinde servis tarafındaki metodun parametresinin tek ve Stream sınıfından t&amp;uuml;reyen bir şekilde tasarlanmış olması şarttır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="150"&gt;&lt;strong&gt; StreamedResponse&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Sadece servis tarafından istemciye geri d&amp;ouml;nen &lt;strong&gt;cevaplara(Response)&lt;/strong&gt; ait mesajların stream &amp;uuml;zerinden hareket etmesine izin verilir. Bu mod se&amp;ccedil;ildiğinde servis tarafında yer alan operasyonun geriye Stream sınıfından t&amp;uuml;remiş bir tip d&amp;ouml;nd&amp;uuml;rmesi veya bunu out anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; ile metod parametrelerinde yapması şarttır.&lt;em&gt; (Burada Stream yerine IXmlSerializable aray&amp;uuml;z&amp;uuml;n&amp;uuml;-interface- uyarlamış bir tipin d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmeside sağlanabilir.)&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="150"&gt;&lt;strong&gt;Buffered&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Mesajlar stream &amp;uuml;zerinden hareket etmezler. Hangi taraf olursa olsun, &lt;strong&gt;ikili(binary)&lt;/strong&gt; i&amp;ccedil;eriğin tamamı g&amp;ouml;nderilmeye hazır hale geldiğinde karşı tarafa aktarılırlar. Karşı tarafa ulaştığında ise tamamı tampona alındıktan sonra uygulamaya işlenmek &amp;uuml;zere aktarılırlar. &lt;strong&gt; TransferMode&lt;/strong&gt; &amp;ouml;zelliğinin varsayılan(Default) değeri &lt;strong&gt; Buffered&lt;/strong&gt; olarak belirlenmiştir.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Her ne kadar stream &amp;uuml;zerinden mesaj g&amp;ouml;ndermek avantajlı g&amp;ouml;z&amp;uuml;ksede dikkat edilmesi gereken bazı hususlarda vardır. Herşeyden &amp;ouml;nce Stream kullanılması halinde &lt;strong&gt;mesaj seviyesinde g&amp;uuml;venlik(Message Level Security) &lt;/strong&gt;tesis edilememektedir. Bu nedenle &lt;strong&gt;iletişim seviyesinde g&amp;uuml;venlik(Transport Level Security)&lt;/strong&gt; kullanılmalıdır. &amp;Ouml;rneğin &lt;strong&gt;HTTPS&lt;/strong&gt; kullanımı &lt;strong&gt;HTTP&lt;/strong&gt; &amp;uuml;zerinden kullanılacak &lt;strong&gt;Stream&lt;/strong&gt;' ler i&amp;ccedil;in ge&amp;ccedil;erlidir. Bunların dışında Stream kullanımı i&amp;ccedil;inde bir mesaj alma sınırı vardır. Biraz &amp;ouml;nceki &amp;ouml;rnekte olduğu gibi belirlenen boyutun dışına &amp;ccedil;ıkıldığında &amp;ccedil;alışma zamanı istisnaları alınabilir. Ancak en &amp;ouml;nemli kısıtlardan birisi &lt;strong&gt;g&amp;uuml;venilir oturum(Reliable Session) &lt;/strong&gt;a&amp;ccedil;manın m&amp;uuml;mk&amp;uuml;n olmayışıdır. Nitekim g&amp;uuml;venilir oturumlar mesajların tamponlanması ve sıralanması ilkelerine g&amp;ouml;re &amp;ccedil;alışmaktadır.&lt;/p&gt;
&lt;p&gt;Geliştirilen &amp;ouml;rnekte &lt;strong&gt;Stream&lt;/strong&gt; kullanımı i&amp;ccedil;in tek yapılması gereken servis ve istemci tarafındaki konfigurasyon dosyalarında, bağlayıcı tip ile ilişkili &lt;strong&gt;TransferMode&lt;/strong&gt; &amp;ouml;zelliğinin değerini aşağıdaki gibi değiştirmektir.&lt;em&gt;(Bu ayarı istemci tarafı i&amp;ccedil;inde yapmak gerekmektedir.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk232_18.gif" alt="" width="605" height="331" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Buraya kadar anlatılanlar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında &lt;strong&gt;MTOM(Message Transmision Optimization Mechanism)&lt;/strong&gt; sayesinde mesajların i&amp;ccedil;eriklerinin &lt;strong&gt;encoding/decoding&lt;/strong&gt; işlemlerine tabi tutulmadan karşı tarafa aktarılabilmesi sağlanmaktadır. Bu aynı zamanda &lt;strong&gt;WCF(Windows Communication Foundation)&lt;/strong&gt; dışındaki platformlar ile haberleşmedede&lt;strong&gt;(Interoperability Desteği)&lt;/strong&gt; &amp;ouml;nemli bir yere sahiptir. Diğer taraftan &lt;strong&gt;MTOM&lt;/strong&gt;' un bazı dezavantajlarını ortadan kaldırmak adına &lt;strong&gt;Stream&lt;/strong&gt; kullanımı tercih edilebilir. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/MTOMKullanimi.rar"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2007-11-26 12:00:00</pubDate>
  <slug>WCF-MTOM-ve-Stream-Kullanarak-Veri-Aktarc4b1mc4b1-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
    <tag>mtom</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>