<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tasarım Desenleri - Observer</title>
  <description>Yaklaşık olarak 10 yılı aşkın bir süredir yazılım teknolojileri ile ilgilenmekteyim. Bu süre zarfı içerisinde Delphi 1.0' dan tutunda Java' ya, C++'tan C#' a, Visual Basic' ten Cobol' a kadar pek çok programlama dili ile uğraşma fırsatım oldu. Her ne kadar dünyada kaç nesne yönelimli programlama dili olursa olsun, hayatın ve dolayısıyla yazılım teknolojilerinin değişmez kuralları arasında tasarım kalıpları yer almakta...</description>
  <content>&lt;p&gt;&lt;img style="float: left;" src="/pics/2009%2f7%2fblg44_1.jpg" alt="" width="212" height="142" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Yaklaşık olarak 10 yılı aşkın bir s&amp;uuml;redir yazılım teknolojileri ile ilgilenmekteyim. Bu s&amp;uuml;re zarfı i&amp;ccedil;erisinde &lt;strong&gt;Delphi 1.0'&lt;/strong&gt; dan tutunda &lt;strong&gt;Java'&lt;/strong&gt; ya, &lt;strong&gt;C++&lt;/strong&gt;'tan &lt;strong&gt;C#&lt;/strong&gt;' a, &lt;strong&gt;Visual Basic'&lt;/strong&gt; ten &lt;strong&gt;Cobol&lt;/strong&gt;' a&amp;nbsp;kadar pek &amp;ccedil;ok programlama dili ile uğraşma fırsatım oldu. Her ne kadar d&amp;uuml;nyada ka&amp;ccedil; nesne y&amp;ouml;nelimli programlama dili olursa olsun, hayatın ve dolayısıyla yazılım teknolojilerinin değişmez kuralları arasında tasarım kalıpları yer almakta...&lt;/p&gt;
&lt;p&gt;Ve birde platform, dil, cihaz g&amp;ouml;zetmeksizin&amp;nbsp;var&amp;nbsp;olan&amp;nbsp;oyunlar. &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bende her ne kadar yazılımı bir hayat bi&amp;ccedil;imi olarak benimsemiş olsamda, zaman zaman eski g&amp;uuml;nlerdeki gibi strateji oyunlarını oynamıyor da değilim. &lt;strong&gt;Warcraft 2&lt;/strong&gt; ve &lt;strong&gt;"Yeş mi Lord"&lt;/strong&gt; ile başlayan bu ser&amp;uuml;vende, &lt;strong&gt;Starcraft'&lt;/strong&gt; taki &lt;strong&gt;Protosları&lt;/strong&gt;, &lt;strong&gt;Red Alert'&lt;/strong&gt; taki &lt;strong&gt;Yuri'&lt;/strong&gt; nin &lt;strong&gt;Mind&lt;/strong&gt; &lt;strong&gt;Control&lt;/strong&gt; makinelerini, &lt;strong&gt;Generals'&lt;/strong&gt; taki &lt;strong&gt;Stealth&lt;/strong&gt; &lt;strong&gt;Fighter'&lt;/strong&gt; ları ve daha nicelerini kullanma fırsatım oldu. Ge&amp;ccedil;en akşamda kafamda bir oyun canlandırmaya &amp;ccedil;alışırken, korumakta olduğum topraklara yapılan bir saldırıyı, filomdaki birimlere nasıl ileteceğimi d&amp;uuml;ş&amp;uuml;nmeye başladım&lt;em&gt;(&amp;Ccedil;ok doğal olarak telsizle bildir olsun bitsin diyebilirsiniz)&lt;/em&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bir saldırı anında tank, helikopter, yaya piyade veya deniz g&amp;uuml;c&amp;uuml;ndeki operat&amp;ouml;rlere bu durumun iletilmesi gerekiyordu. Aslında birilerininde s&amp;uuml;rekli olarak dinlemede olması şarttı. Aslında bu birimlerin hepsi oyun sahası i&amp;ccedil;erisinde yer alan birer nesne idi ve &lt;strong&gt;OOP&lt;/strong&gt; tarafında tip olarak modellenebilirlerdi. Dolayısıyla aralarında &lt;strong&gt;bire-&amp;ccedil;ok(one to many)&lt;/strong&gt; ilişki olabilecek nesnelerin olması ve birisinde meydana gelecek değişikliklerin diğerlerine bildirilmesi gibi senaryo ortaya &amp;ccedil;ıkmaktaydı.(Bir filonun komuta merkezinden, ona bağlı t&amp;uuml;m birimlere haber gitmesi durumu)&lt;/p&gt;
&lt;p&gt;Duruma farklı senaryolardan da bakabiliriz aslında. &amp;Ouml;rneğin,&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;bir stok takip sisteminde, stok hareketlerinde olan değişimlerin bayilere bildirimesi,&lt;/li&gt;
&lt;li&gt;haber ajanslarının, kendilerine bağlı olan b&amp;ouml;l&amp;uuml;mlere yeni başlıklar geldik&amp;ccedil;e bilgilendirmede bulunmaları,&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;gibi ger&amp;ccedil;ek hayat senaryoları s&amp;ouml;z konusu olabilir.&lt;/p&gt;
&lt;p&gt;Tahmin edeceğini &amp;uuml;zere varmakta olduğumuz nokta bu 3 basit senaryoda benzer vakanın ve ihtiya&amp;ccedil;ların olmasıdır. Buda bizi bir tasarım kalıbına g&amp;ouml;t&amp;uuml;rmektedir. &lt;strong&gt;Observer&lt;/strong&gt; tasarım deseni. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Bu desen o kadar yaygındır ki onu;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Model View Controller(MVC)&lt;/strong&gt; i&amp;ccedil;erisinde&lt;/li&gt;
&lt;li&gt;veya&lt;strong&gt; .Net&lt;/strong&gt; ile &lt;strong&gt;Java&lt;/strong&gt; tarafındaki &lt;strong&gt;olay g&amp;uuml;d&amp;uuml;ml&amp;uuml; programlamada(Event Based Programming) &lt;/strong&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;bulabiliriz.&lt;/p&gt;
&lt;p&gt;Aslında bu desen servis y&amp;ouml;nelimli mimarilerde dahi karşımıza &amp;ccedil;ıkmaktadır. &amp;Ouml;zetle &amp;ccedil;ok sık kullanılan bir kalıp olduğunu ifade edebiliriz. Desenin ilkesi az &amp;ouml;ncede belirttiğimiz &amp;uuml;zere birbirlerine bire-&amp;ccedil;ok ilişki ile bağlı nesnelerde olabilecek&amp;nbsp;değişiklikleri diğerlerine iletmektir. Bu nedenle izlenmeye değer bir konu ve bununla ilişkili nesneler&lt;strong&gt;(Subject, ConcreteSubject)&lt;/strong&gt; s&amp;ouml;z konusudur. Ayrıca konuyu takip edecek olan tiplerde&lt;strong&gt;(Observer, ConcreteObserver)&lt;/strong&gt; bulunmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f7%2fblg44_2.jpg" alt="" width="198" height="144" /&gt;Dilerseniz konumuza basit bir &amp;ouml;rnek ile devam edelim. Yazımıza giriş kısmında bahsettiğimiz askeri strateji bazlı senaryoyu bu bağlamda g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz. Senaryomuza g&amp;ouml;re konumuz, bir saldırı veya benzer durumlarda, istediğimiz bazı birliklerin operat&amp;ouml;rlerinin bilgilendirilmesidir.&lt;/p&gt;
&lt;p&gt;Burada bilgilendirmeyi yapacak olan &lt;strong&gt;yayımcılar(Publishers)&lt;/strong&gt; ve bunu dinleyecek olan &lt;strong&gt;aboneler(Subscribers)&lt;/strong&gt; olduğunuda d&amp;uuml;ş&amp;uuml;nebiliriz aslında. Aslında Observer deseni bir anlamda publisher/subscriber modelinin bir uygulanış bi&amp;ccedil;imi&amp;nbsp;olarakta d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&amp;nbsp;İşte sınıf diagramımız ve kodlarımız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f7%2fblg44_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;(Bu arada sınıf diagramı biraz farklı g&amp;ouml;r&amp;uuml;nebilir. Nitekim şu anda bu yazıyı kayınvalidemin bilgisayarında yazmaktayım. Makine Visual Studio yok belki ama SharpDevelop sağolsun her ihtiyacımı g&amp;ouml;r&amp;uuml;yor. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Ve kodlarımız;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;

namespace Observer
{
    /// &amp;lt;summary&amp;gt;
    /// Subject class
    /// &amp;lt;/summary&amp;gt;
    internal abstract class HeadQuarters
    {
        private string _information;
        private List&amp;lt;IOperator&amp;gt; _operators=null;

        protected HeadQuarters(string information)
        {
            _operators = new List&amp;lt;IOperator&amp;gt;();
            Information = information;
        }

        public string Information
        {
            get { return _information; }
            set { 
                _information = value; 
                NotifyOperators();
            }
        }

        public void AddOperator(IOperator opt)
        {
            _operators.Add(opt);
        }
        public void RemoveOperator(IOperator opt)
        {
            _operators.Remove(opt);
        }
        public void NotifyOperators()
        {
            foreach (IOperator opt in _operators)
            {
                opt.Update(this);
            }
        }
    }

    /// &amp;lt;summary&amp;gt;
    /// Concrete Subject class
    /// &amp;lt;/summary&amp;gt;
    internal class RedFleetBase
        :HeadQuarters
    {
        public RedFleetBase(string information)
           :base(information)
        {
            
        }

        public RedFleetBase()
            :base("...")
        {
            
        }
    }

    /// &amp;lt;summary&amp;gt;
    /// Observer class
    /// &amp;lt;/summary&amp;gt;
    internal interface IOperator
    {
        void Update(HeadQuarters headQuarters);
    }

    /// &amp;lt;summary&amp;gt;
    /// Concrete Observer class
    /// &amp;lt;/summary&amp;gt;
    internal class PlatoonOperator
        :IOperator
    {
        public string OperatorName { get; set; }

        #region IOperator Members

        public void Update(HeadQuarters headQuarters)
        {
            Console.WriteLine("[{0}] : {1}",OperatorName,headQuarters.Information);
        }

        #endregion
    }

    /// &amp;lt;summary&amp;gt;
    /// Concrete Observer Class
    /// &amp;lt;/summary&amp;gt;
    internal class TankOperator
        : IOperator
    {
        public int TankId  { get; set; }
        #region IOperator Members

        public void Update(HeadQuarters headQuarters)
        {
            Console.WriteLine("[{0}] : {1}", TankId, headQuarters.Information);
        }

        #endregion
    }


    /// &amp;lt;summary&amp;gt;
    /// Client App
    /// &amp;lt;/summary&amp;gt;
    class Program
    {
        static void Main()
        {
            RedFleetBase redFleetBase = new RedFleetBase {Information = "S&amp;uuml;per işlemciler piyasada"};
            redFleetBase.Information = "İşlemciler gelişiyor";

            redFleetBase.AddOperator(new PlatoonOperator { OperatorName="Azman"} );
            redFleetBase.AddOperator(new PlatoonOperator { OperatorName = "Kara Şahin"});
            redFleetBase.AddOperator(new PlatoonOperator { OperatorName="Kartal Kondu"});

            redFleetBase.Information = "T&amp;uuml;m birlikler Sarı Alarma! Sarı Alarma!";

            Console.WriteLine("");

            redFleetBase.Information = "Emir iptal! Emir iptal!";

            Console.WriteLine("");

            redFleetBase.AddOperator(new TankOperator{TankId=701});
            redFleetBase.AddOperator(new TankOperator{TankId=801});
            redFleetBase.Information = "Sınır ihlali.";
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Biraz kodları incelemekte fayda olduğu kanısındayım...&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Subject&lt;/strong&gt; tipimiz olan &lt;strong&gt;HeadQuarters&lt;/strong&gt;, &lt;strong&gt;Information&lt;/strong&gt; isimli bir &amp;ouml;zelliğe sahiptir. Bu &amp;ouml;zellik, &lt;strong&gt;Observer&lt;/strong&gt; tiplerinin değerlendireceği bir bilgidir. Bir başka deyişle, &lt;strong&gt;HeadQuarters'&lt;/strong&gt; tan, &lt;strong&gt;IOperator&lt;/strong&gt; t&amp;uuml;revlerine aktarılan bildirimdir. &lt;strong&gt;HeadQuarters&lt;/strong&gt; &lt;strong&gt;abstract&lt;/strong&gt; tipi i&amp;ccedil;erisinde bilgilendirilme yapılacak &lt;strong&gt;IOperator&lt;/strong&gt; t&amp;uuml;revleride bir koleksiyon i&amp;ccedil;erisinde saklanmaktadır. Buna g&amp;ouml;re, &lt;strong&gt;HeadQuarters&lt;/strong&gt; i&amp;ccedil;erisindeki &lt;strong&gt;Information&lt;/strong&gt; &amp;ouml;zelliğinde yapılacak bir değişilik sonrası devreye giren &lt;strong&gt;Set&lt;/strong&gt; bloğundan, &lt;strong&gt;NotifyOperators&lt;/strong&gt; isimli metod &amp;ccedil;ağırılmaktadır. Dikkat edileceği &amp;uuml;zere s&amp;ouml;z konusu metod, &lt;strong&gt;IOperator&lt;/strong&gt; tipinden olan &lt;strong&gt;List&lt;/strong&gt; koleksiyonundaki t&amp;uuml;m t&amp;uuml;revlerin &lt;strong&gt;Update&lt;/strong&gt; metodunu &amp;ccedil;ağırmakta ve &amp;ccedil;alışma zamanındaki &lt;strong&gt;HeadQuarters&lt;/strong&gt; nesne referansını alt sınıflara g&amp;ouml;ndermektedir. Dolayısıyla, bilgilendirme yaplılacak &lt;strong&gt;IOperator&lt;/strong&gt; t&amp;uuml;revlerinin s&amp;ouml;z konusu &lt;strong&gt;Subject&lt;/strong&gt; tipi i&amp;ccedil;erisinde saklanması i&amp;ccedil;in ekleme ve &amp;ccedil;ıkarma operasyonları da &lt;strong&gt;HeadQuarters&lt;/strong&gt; sınıfına dahil edilmiştir.&lt;/p&gt;
&lt;p&gt;Tabiki &lt;strong&gt;istemcinin(Console uygulamamız)&lt;/strong&gt;&amp;nbsp;asıl kullanacağı tip &lt;strong&gt;Subject'&lt;/strong&gt; ten t&amp;uuml;reyen &lt;strong&gt;ConcreteSubject&lt;/strong&gt; sınıfıdır(&lt;strong&gt;RedFleetBase&lt;/strong&gt;). İstemci, bu tip &amp;uuml;zerinde abonelerini bildirmektedir. Yani &lt;strong&gt;IOperator(Observer)&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; implemente eden &lt;strong&gt;PlatoonOperator&lt;/strong&gt; ve &lt;strong&gt;TankOperator&lt;/strong&gt; nesne &amp;ouml;rneklerini...Kodun i&amp;ccedil;erisinde &lt;strong&gt;RedFleetBase&lt;/strong&gt; nesne &amp;ouml;rneği &amp;uuml;zerinden yapılan her bir &lt;strong&gt;Information&lt;/strong&gt; değişikliği sonrası, ne kadar tank ve piyade operat&amp;ouml;r&amp;uuml; varsa bilgilendirilmektedir. Aynen aşağıdaki &amp;ouml;rnek &amp;ccedil;alışma zamanı &amp;ccedil;ıktısında olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f7%2fblg44_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Modelde dikkat edilmesi gereken noktalardan biriside, Subject ve Observer tiplerinden istenildiği kadar t&amp;uuml;retme yapılabilmesi ve bunların aralarında kuvvetli bir bağ ilişkisi olmamasıdır. Burada Subject tipinin kendi i&amp;ccedil;erisinde soyut bir Observer tip koleksiyonu kullanmasınında b&amp;uuml;y&amp;uuml;k bir anlamı vardır. B&amp;ouml;ylece geldik bir tasarım kalıbımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;iframe src="https://www.youtube.com/embed/X7NYBDeB2eM" width="560" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f7%2fObserver.rar"&gt;Observer.rar (29,47 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-07-09 07:35:00</pubDate>
  <slug>Tasarc4b1m-Desenleri-Observer</slug>
  <tags>
    <tag>design-patterns</tag>
    <tag>oop</tag>
    <tag>c#</tag>
  </tags>
  <categories>
    <category>Tasarım Kalıpları(Design Patterns)</category>
  </categories>
</post>