<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Minicik Session İçeriği</title>
  <description>Aslında .Net Framework 4.0 tarafını uzun süredir incelememe rağmen, en ince detaylarına kadar girmeden konuya hakim olmanın zor olacağını da gayet iyi biliyordum. Hatta bana göre yazarak anlatmak öğrenmenin en iyi yollarından birisi. İşte bu bi dolu düşünce altında başladığım gece çalışmasının sonucu olan küçük bir blog girdisi ile karşınızdayım. Bu yazımızda Asp.Net 4.0 tarafında gelen önemli yeniliklerden birisi olan serileştirilebilir Session içeriğini ufaltmak(daha teknik bir tabirle sıkıştırmak) konusuna değiniyor olacağız.</description>
  <content>&lt;p&gt;&lt;a href="/pics/blg237_Giris.jpg"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; float: right; padding-top: 0px; border-width: 0px;" title="blg237_Giris" src="/pics/blg237_Giris_thumb.jpg" alt="blg237_Giris" width="304" height="202" align="right" border="0" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bildiğiniz &amp;uuml;zere bir s&amp;uuml;redir &lt;strong&gt;Microsoft Teknoloji G&amp;uuml;nleri Akşam Sınıfı &lt;/strong&gt;etkinliklerini ger&amp;ccedil;ekleştirmekteyiz. &lt;strong&gt;Kasım &lt;/strong&gt;ayının konusu ise hemen her s&amp;uuml;r&amp;uuml;m&amp;uuml;nde k&amp;ouml;kl&amp;uuml; ve &amp;ouml;nemli yenilikler ile birlikte gelen &lt;strong&gt;Asp.Net' in 4.0 s&amp;uuml;r&amp;uuml;m&amp;uuml; &lt;/strong&gt;&lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_7.png" alt="Winking smile" /&gt; Web programlamanın gelişen ihtiya&amp;ccedil;ları nedeniyle &lt;strong&gt;Asp.Net &lt;/strong&gt;alt yapısında da her major s&amp;uuml;r&amp;uuml;mde fazlasıyla yenilik bulunmakta.&lt;/p&gt;
&lt;p&gt;Tabi yine bildiğiniz &amp;uuml;zere bendeniz web konusunda uzman değilim. Ağırlıklı olarak &lt;strong&gt;servis y&amp;ouml;nelimli mimari(Service Oriented Architecture)&lt;/strong&gt; tarafı ile ilgilenmekteyim. Ancak eğitmenlik yaptığım d&amp;ouml;nemlerden kalan bir hastalık olsa gerek, &lt;strong&gt;.Net&lt;/strong&gt;' in diğer pek &amp;ccedil;ok alanı ile de ilgilenmekteyim. Eğitime blog yazısını hazırladığım tarih itibaryile olduk&amp;ccedil;a az bir s&amp;uuml;re kaldı. &lt;strong&gt;&amp;Ccedil;ıraklık başvuruları, Microsoft g&amp;ouml;n&amp;uuml;ll&amp;uuml; &amp;ccedil;alışmaları, 11 haftalık proje planı olup bizden 4 haftada bitirmemizi istedikleri kocaman POC &amp;ccedil;alışması, S(h)arp Efe&lt;/strong&gt; derken zamanı etkin kullanmak konusunda sıkıntılar yaşamaya başladım &lt;img class="wlEmoticon wlEmoticon-confusedsmile" style="border-style: none;" src="/pics/wlEmoticon-confusedsmile_3.png" alt="Confused smile" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında&lt;strong&gt; .Net Framework 4.0&lt;/strong&gt; tarafını uzun s&amp;uuml;redir incelememe rağmen, en ince detaylarına kadar girmeden konuya hakim olmanın zor olacağını da gayet iyi biliyordum. Hatta bana g&amp;ouml;re yazarak anlatmak &amp;ouml;ğrenmenin en iyi yollarından birisi. İşte bu bi dolu d&amp;uuml;ş&amp;uuml;nce altında başladığım gece &amp;ccedil;alışmasının sonucu olan k&amp;uuml;&amp;ccedil;&amp;uuml;k bir blog girdisi ile karşınızdayım. Bu yazımızda &lt;strong&gt;Asp.Net 4.0&lt;/strong&gt; tarafında gelen &amp;ouml;nemli yeniliklerden birisi olan serileştirilebilir &lt;strong&gt;Session&lt;/strong&gt; i&amp;ccedil;eriğini ufaltmak&lt;em&gt;(daha teknik bir tabirle sıkıştırmak)&lt;/em&gt; konusuna değiniyor olacağız.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Session&lt;/strong&gt; bildiğiniz &amp;uuml;zere web &amp;ccedil;alışma modelinde &amp;ouml;nemli bir yere sahip. &amp;Ouml;zellikle oturum bazlı olarak veri tutulması istenen durumlarda, sunucu tarafında kullanılabilecek se&amp;ccedil;eneklerden birisi olduğunu ifade edebiliriz. &lt;strong&gt;Session&lt;/strong&gt; i&amp;ccedil;eriklerini kullanmak da son derece basit. Bu anlamda &lt;strong&gt;Asp.Net'&lt;/strong&gt; in başlangıcından beri var olan &lt;strong&gt;HttpSessionState&lt;/strong&gt; tipinden yararlanıldığını biliyoruz. Tabi &lt;strong&gt;Session&lt;/strong&gt; kullanımında dikkat edilmesi gereken bazı hususlarda var. S&amp;ouml;z gelimi varsayılan olarak&lt;strong&gt; In-Proc&lt;/strong&gt; mod adı verilen ve &amp;ccedil;alışmakta olan &lt;strong&gt;Asp.Net&lt;/strong&gt; uygulamasına ait&lt;strong&gt; Worker Process&lt;/strong&gt; ile ilişkili bellek alanlarında tutulan &lt;strong&gt;Session&lt;/strong&gt; i&amp;ccedil;eriklerinin, &lt;strong&gt;SQL&lt;/strong&gt; veritabanı veya farklı bir &lt;strong&gt;State Service'&lt;/strong&gt; e ait process altında tutulması da s&amp;ouml;z konusu. Bu farklı tutuluş şekillerine ilaveten &lt;strong&gt;object&lt;/strong&gt; tipi ile &amp;ccedil;alışabilen bir yapıdan bahsettiğimizi de ifade etmek isterim. Yani her t&amp;uuml;r .Net nesnesini atayabilirsiniz. Hımmm &lt;img class="wlEmoticon wlEmoticon-sarcasticsmile" style="border-style: none;" src="/pics/wlEmoticon-sarcasticsmile_3.png" alt="Sarcastic smile" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi &lt;strong&gt;In-Proc&lt;/strong&gt; mod dışındaki modları g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. &lt;strong&gt;SQL&lt;/strong&gt; sunucusu&lt;em&gt;(SQLServer modu)&lt;/em&gt; veya &lt;strong&gt;State Service(StateServer modu)&lt;/strong&gt; kullanan modları. Bu modlar kullanıldığında &lt;strong&gt;Session&lt;/strong&gt; i&amp;ccedil;erisine atılan verilerin serileştirilerek tutulması s&amp;ouml;z konusudur. Bu son derece mantıklıdır &amp;ccedil;&amp;uuml;nk&amp;uuml; &lt;strong&gt;object&lt;/strong&gt; tipi i&amp;ccedil;erisine &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k boyutlu nesnelerin dahi atılması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Ancak bu durum zamanla &lt;strong&gt;SQL &lt;/strong&gt;veya &lt;strong&gt;State Service &lt;/strong&gt;modlarının kullandığı alanların &amp;ouml;nemli &amp;ouml;l&amp;ccedil;&amp;uuml;de şişmesine de neden olabilir. İşte &lt;strong&gt;Asp.Net 4.0 &lt;/strong&gt;ile &lt;strong&gt;Session &lt;/strong&gt;ayarlamaları i&amp;ccedil;in eklenen &lt;strong&gt;compressionEnabled&lt;/strong&gt;&amp;nbsp; &amp;ouml;zelliği sayesinde, s&amp;ouml;z konusu &lt;strong&gt;Session&lt;/strong&gt; i&amp;ccedil;eriklerinin &amp;ouml;nemli &amp;ouml;l&amp;ccedil;&amp;uuml;de sıkıştırılması da m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bu noktada &lt;strong&gt;System.IO.Compression.GZipStream&lt;/strong&gt; tipinin b&amp;uuml;y&amp;uuml;k bir rol oynadığını ifade edebiliriz. Nitekim bu tip sayesinde serileştirilmiş olan verinin sıkıştırılması s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;Yazımızın ilerleyen kısımlarında sıkıştırmanın bu noktadaki &amp;ouml;nemini vurgulamak a&amp;ccedil;ısından basit bir &amp;ouml;rnek &amp;uuml;zerinden ilerlemeye &amp;ccedil;alışıyor olacağız. &amp;Ouml;rnek senaryomuzda &lt;strong&gt;Session&lt;/strong&gt; bilgilerini &lt;strong&gt;SQL&lt;/strong&gt; veritabanı &amp;uuml;zerinde tutuyor olacağız. Bu ama&amp;ccedil;la bir &amp;ouml;n hazırlık yapmamız gerekiyor. &lt;strong&gt;Visual Studio 2010 Command Prompt&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;aspnet_regsql&lt;/strong&gt; aracını kullanarak s&amp;ouml;z konusu veritabanını&lt;em&gt;(&amp;Ouml;rneğimizde SessionDB)&lt;/em&gt; oluşturabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Kurulum ;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;C:\Program Files (x86)\Microsoft Visual Studio 10.0\VC&amp;gt;aspnet_regsql -S localhost -E -ssadd -sstype c -d SessionDB&lt;/p&gt;
&lt;p&gt;Start adding session state.&lt;/p&gt;
&lt;p&gt;....&lt;/p&gt;
&lt;p&gt;Finished.&lt;/p&gt;
&lt;p&gt;To use this custom session state database in your web application, please specify it in the configuration file by using the 'allowCustomSqlDatabase' and 'sqlConnectionString' attributes in the &amp;lt;system.web&amp;gt;\&amp;lt;sessionState&amp;gt; section.&lt;/p&gt;
&lt;p&gt;Bu kurulum işlemi sonrasında &lt;strong&gt;SessionDB&lt;/strong&gt; i&amp;ccedil;erisinde oluşturulan &lt;strong&gt;ASPStateTempSessions&lt;/strong&gt; tablosunun yapısı da aşağıdaki gibi olacaktır. İki alan; &lt;strong&gt;SessionItemShort&lt;/strong&gt; ve &lt;strong&gt;SessionItemLong &lt;/strong&gt;şu an ki vakamız i&amp;ccedil;in &amp;ouml;nem arz etmektedir. Bu alanlarda serileştirilen &lt;strong&gt;Session&lt;/strong&gt; i&amp;ccedil;erikleri tutulmaktadır. Bununla birlikte serileşen i&amp;ccedil;eriğin b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;ne g&amp;ouml;re iki alandan bir tanesine veri eklenmesi de s&amp;ouml;z konusu olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg237_Table.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="blg237_Table" src="/pics/blg237_Table_thumb.gif" alt="blg237_Table" width="300" height="239" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Şimdi basit bir &lt;strong&gt;Asp.Net Web Application&lt;/strong&gt; &amp;uuml;zerinden ilerleyelim. S&amp;ouml;z konusu web uygulamasında en &amp;ouml;nemli nokta &lt;strong&gt;Session&lt;/strong&gt; kullanımına ait konfigurasyon ayarlarıdır. &lt;strong&gt;Default.aspx&lt;/strong&gt; sayfamız son derece basit bir fonksiyonelliğe sahiptir. &lt;strong&gt;Button&lt;/strong&gt; kontrol&amp;uuml;ne basıldığında &lt;strong&gt;Logo&lt;/strong&gt; isimli bir sınıf &amp;ouml;rneğinin &lt;strong&gt;Session&lt;/strong&gt; nesnesi olarak atılması s&amp;ouml;z konusudur. İşte &amp;ouml;rnek uygulama kodlarımız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.IO; 
using System.Data.SqlClient; 
using System.Data;

namespace OldStyleSession 
{ 
    [Serializable] 
    public class Logo 
    { 
        public string FileContent { get; set; } 
        public string Name { get; set; } 
        public DateTime CreationTime { get; set; } 
    }

    public partial class _Default 
        : System.Web.UI.Page 
    { 
        protected void btnAddToSession_Click(object sender, EventArgs e) 
        { 
            Logo lg = new Logo 
            { 
                 Name="Car" 
                 , CreationTime=DateTime.Now 
                 , FileContent=File.ReadAllText(Server.MapPath("/Bilgiler.txt"))               
            }; 
            Session.Add("Logo", lg); 
        } 

        protected void btnWriteSession_Click(object sender, EventArgs e) 
        { 
            using (SqlConnection conn = new SqlConnection("data source=.;database=SessionDB;integrated security=SSPI")) 
            { 
                SqlCommand cmd = new SqlCommand("Select SessionItemShort,SessionItemLong From AspStateTempSessions Where SessionId=@SessionId", conn); 
                cmd.Parameters.AddWithValue("@SessionId", txtSessionId.Text); 
                conn.Open(); 
                SqlDataReader reader = cmd.ExecuteReader(CommandBehavior.CloseConnection); 
                if (reader.Read()) 
                { 
                   var itemShort=reader.GetSqlBytes(0); 
                    var itemLong = reader.GetSqlBytes(1); 
                    Response.Write( 
                        String.Format("SessionItemShort length = {0}, SessionItemLong length = {1}" 
                        ,itemShort.IsNull?0:itemShort.Length 
                        ,itemLong.IsNull?0:itemLong.Length 
                        ) 
                        ); 
                } 
                reader.Close(); 
            } 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;Session&lt;/strong&gt; &amp;ouml;zelliğinin &lt;strong&gt;Add&lt;/strong&gt; metodundan yararlanılarak &lt;strong&gt;lg&lt;/strong&gt; isimli &lt;strong&gt;Logo&lt;/strong&gt; nesne &amp;ouml;rneğinin ilave edilmesi s&amp;ouml;z konusudur. Diğer yandan bir de &amp;uuml;retilen &lt;strong&gt;Session&lt;/strong&gt; i&amp;ccedil;in yazılan &lt;strong&gt;SessionItemLong&lt;/strong&gt; ve &lt;strong&gt;SessionItemShort&lt;/strong&gt; alanlarının i&amp;ccedil;eriklerinin &lt;strong&gt;byte&lt;/strong&gt; cinsinden uzunluklarını ekrana yazdırabileceğimiz bir metodumuz da bulunmaktadır. Bu metodu &amp;uuml;retilen &lt;strong&gt;Session&lt;/strong&gt; i&amp;ccedil;eriklerinin boyutlarını kıyaslamak i&amp;ccedil;in kullanıyor olacağız.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekte kullanılan &lt;strong&gt;Bilgiler.txt&lt;/strong&gt; isimli &lt;strong&gt;Text&lt;/strong&gt; tabanlı dosya &lt;strong&gt;328 Kb&lt;/strong&gt; b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;nde anlamsız bir i&amp;ccedil;eriğe sahiptir. Burada &lt;strong&gt;text&lt;/strong&gt; tabanlı bir i&amp;ccedil;erik s&amp;ouml;z konusu olduğundan sıkıştırma işlemini ele alacak olan algoritma &amp;ccedil;arpıcı sonu&amp;ccedil;lar &amp;uuml;retecektir. İlk etapta &lt;strong&gt;web.config&lt;/strong&gt; dosyasının i&amp;ccedil;eriğini aşağıdaki gibi tasarladığımızı d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0"?&amp;gt; 
&amp;lt;configuration&amp;gt; 
  &amp;lt;system.web&amp;gt; 
    &amp;lt;sessionState allowCustomSqlDatabase="true" sqlConnectionString="data source=.;database=SessionDB;integrated security=sspi" mode="SQLServer" compressionEnabled="false"/&amp;gt; 
    &amp;lt;compilation debug="true" targetFramework="4.0"&amp;gt; 
    &amp;lt;/compilation&amp;gt; 
  &amp;lt;/system.web&amp;gt; 
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;SessionDB&lt;/strong&gt; isimli bir veritabanı adı kullandığımızdan &lt;strong&gt;allowCustomSqlDatabase&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;true&lt;/strong&gt; değeri atanmıştır. &lt;strong&gt;sqlConnectionString&lt;/strong&gt; bilgisinde ise &lt;strong&gt;Session&lt;/strong&gt; bilgilerinin yazılacağı veritabanı bağlantısı belirtilmektedir. &lt;strong&gt;mode&lt;/strong&gt; niteliğine atanan değer ile &lt;strong&gt;Session&lt;/strong&gt; i&amp;ccedil;eriklerinin &lt;strong&gt;SQL&lt;/strong&gt; veritabanı &amp;uuml;zerinde&lt;em&gt;(sqlConnectionString ile belirtilen bağlantıya doğru)&lt;/em&gt; tutulacağı ifade edilmektedir. Şu an i&amp;ccedil;in &lt;strong&gt;compressionEnabled&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;false&lt;/strong&gt; değeri atanmıştır. Bu şekilde aslında &lt;strong&gt;Asp.Net 4.0&lt;/strong&gt; &amp;ouml;ncesinde olduğu gibi standart bir &lt;strong&gt;Session&lt;/strong&gt; tutma işlemi yapılacağı belirtilmektedir. &amp;Ouml;rneği bu şekilde test ettiğimizde &lt;strong&gt;ASPStateTempSessions&lt;/strong&gt; tablosunda &amp;uuml;retilen &lt;strong&gt;Session&lt;/strong&gt; satırına ait sorgulama sonucu, &lt;strong&gt;SessionItemLong&lt;/strong&gt; alanına &lt;strong&gt;binary&lt;/strong&gt; bir i&amp;ccedil;eriğin serileştirilmiş olduğu g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Sql tarafında Compression kullanılmadığı haldeki durum;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak sıkıştırma işlemini &lt;span style="text-decoration: underline;"&gt;kullanmadığımız&lt;/span&gt; durumu ele alalım. &lt;strong&gt;Add Session&lt;/strong&gt; işleminden sonra, &amp;uuml;retilen &lt;strong&gt;SessionID&lt;/strong&gt; değerini web sayfamız &amp;uuml;zerinde kullanırsak aşağıdaki sonu&amp;ccedil;lar ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg237_FirstCase.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="blg237_FirstCase" src="/pics/blg237_FirstCase_thumb.gif" alt="blg237_FirstCase" width="459" height="291" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;335141&lt;/strong&gt; uzunluğunda bir byte i&amp;ccedil;eriği s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;Gelelim sıkıştırılma durumuna. Bu sefer &lt;strong&gt;compressionEnabled&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;true&lt;/strong&gt; değerini vermemiz yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0"?&amp;gt; 
&amp;lt;configuration&amp;gt; 
  &amp;lt;system.web&amp;gt; 
    &amp;lt;sessionState allowCustomSqlDatabase="true" sqlConnectionString="data source=.;database=SessionDB;integrated security=sspi" mode="SQLServer" compressionEnabled="true"/&amp;gt; 
    &amp;lt;compilation debug="true" targetFramework="4.0"&amp;gt; 
    &amp;lt;/compilation&amp;gt; 
  &amp;lt;/system.web&amp;gt; 
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Sql tarafında Compression kullanılması haldeki durum ise aşağıdaki gibi olacaktır;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg237_SecondCase.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="blg237_SecondCase" src="/pics/blg237_SecondCase_thumb.gif" alt="blg237_SecondCase" width="444" height="287" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere bir &amp;ouml;nceki vakanın tersine serileştirilebilir i&amp;ccedil;erik &lt;strong&gt;SessionItemLong&lt;/strong&gt; alanı yerine &lt;strong&gt;SessionItemShort&lt;/strong&gt; i&amp;ccedil;erisine eklenmiştir. Bununla birlikte s&amp;ouml;z konusu sıkıştırılmış verinin i&amp;ccedil;eriği &lt;strong&gt;3686 &lt;/strong&gt;dır &lt;img class="wlEmoticon wlEmoticon-disappointedsmile" style="border-style: none;" src="/pics/wlEmoticon-disappointedsmile_1.png" alt="Disappointed smile" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Sıkıştırma algoritmasının uygulanması sonucu neredeyse standart &lt;strong&gt;session&lt;/strong&gt; i&amp;ccedil;eriğinin &lt;strong&gt;%0,0109983559158682 &amp;uuml;ne &lt;/strong&gt;kadar verinin k&amp;uuml;&amp;ccedil;&amp;uuml;lt&amp;uuml;lmesi s&amp;ouml;z konusudur. Elbette burada &lt;strong&gt;text&lt;/strong&gt; tabanlı bir i&amp;ccedil;erik kullanıldığından s&amp;ouml;z konusu farkın oluşması doğaldır. &amp;Ouml;zellikle &lt;strong&gt;binary&lt;/strong&gt; i&amp;ccedil;erikten oluşan&lt;em&gt;(&amp;ouml;rneğin resim formatı gibi)&lt;/em&gt; bir verinin serileştirilmesi esnasında veri boyutlarında &amp;ouml;nemli bir fark olmayadabilir. Bu durumu analiz etmek i&amp;ccedil;in aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void btnAddDataTable_Click(object sender, EventArgs e) 
{ 
    using (SqlConnection conn = new SqlConnection("data source=.;database=AdventureWorks;integrated security=SSPI")) 
    { 
        using (SqlDataAdapter adapter = new SqlDataAdapter("select * from Production.ProductPhoto", conn)) 
        { 
            DataSet ds = new DataSet("ProductPhoto"); 
            adapter.Fill(ds);

            Session.Add("ProductPhoto", ds); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Bu kez &lt;strong&gt;ProductPhoto&lt;/strong&gt; isimli tablonun t&amp;uuml;m i&amp;ccedil;eriğini &amp;ccedil;ektiğimiz bir &lt;strong&gt;DataSet&lt;/strong&gt; &amp;ouml;rneğini &lt;strong&gt;Session&lt;/strong&gt;' a ekliyoruz. Yine ilk olarak &lt;strong&gt;compressionEnabled&lt;/strong&gt; niteliğinin &lt;strong&gt;false&lt;/strong&gt; değere sahip olduğu ve sonrasında &lt;strong&gt;true&lt;/strong&gt; olması halini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. Bu durumda aşağıdaki &amp;ouml;rnek &amp;ccedil;ıktılar elde edilecektir.&lt;/p&gt;
&lt;p&gt;Sıkıştırılma kapalı iken;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg237_ThirdCase.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="blg237_ThirdCase" src="/pics/blg237_ThirdCase_thumb.gif" alt="blg237_ThirdCase" width="433" height="273" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Sıkıştırılma a&amp;ccedil;ık iken;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg237_FourthCase.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="blg237_FourthCase" src="/pics/blg237_FourthCase_thumb.gif" alt="blg237_FourthCase" width="435" height="276" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Sıkıştırılmama durumunda &lt;strong&gt;2712191&lt;/strong&gt; iken sıkıştırılma durumunda &lt;strong&gt;2711426&lt;/strong&gt;. Yani sadece &lt;strong&gt;% 1,000282139361355 &lt;/strong&gt;oradanın bir sıkıştırma s&amp;ouml;z konusu olmakta. &lt;img class="wlEmoticon wlEmoticon-cryingface" style="border-style: none;" src="/pics/wlEmoticon-cryingface_1.png" alt="Crying face" /&gt; Değer mi? Değmez. Buna g&amp;ouml;re serileştirilebilir i&amp;ccedil;eriklerin sıkıştırılabilir olmaları da &amp;ouml;nem kazanmaktadır. &lt;em&gt;(Nitekim bir PDF veya JPEG dosyasını sıkıştırdığınızda &amp;ouml;nemli &amp;ouml;l&amp;ccedil;&amp;uuml;de bir sıkıştırma olmadığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z)&lt;/em&gt; İnandırıcı geldi mi? &lt;img class="wlEmoticon wlEmoticon-annoyed" style="border-style: none;" src="/pics/wlEmoticon-annoyed_1.png" alt="Annoyed" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Varsayımsal Yaklaşım&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Tahmini olarak&lt;strong&gt; Asp.Net&lt;/strong&gt; &amp;ccedil;alışma zamanının &lt;strong&gt;Session&lt;/strong&gt; verisini nasıl işlediğini d&amp;uuml;ş&amp;uuml;nelim. Sıkıştırma modu kapalı iken, &lt;strong&gt;binary&lt;/strong&gt; formatta serileştirme işlemi yapılıp verinin i&amp;ccedil;eriye atılıyor olması s&amp;ouml;z konusu olabilir. Diğer yandan sıkıştırma modu a&amp;ccedil;ık olduğunda, serileşen i&amp;ccedil;eriğin olduğu gibi yazılmadan &amp;ouml;nce belki de bir &lt;strong&gt;GZipStream&lt;/strong&gt; işleminden ge&amp;ccedil;irilmesi ve sıkıştırılmaya &amp;ccedil;alışılması s&amp;ouml;z konusu olabilir.&lt;/p&gt;
&lt;p&gt;Bu varsayım altında şu şekilde ilerliyor olacağız. &lt;strong&gt;DataSet&lt;/strong&gt; nesnesinin kendisini standart bir &lt;strong&gt;binary&lt;/strong&gt; serileştirme işlemine tutacağız. Sonrasında ise bu i&amp;ccedil;eriği &lt;strong&gt;GZipStream&lt;/strong&gt; ile sıkıştırmayı deneyip i&amp;ccedil;eriklerin boyutlarına bakacağız. İspat i&amp;ccedil;in bu tekniği kullanıyor olacağız. Haydi parmakları sıvayalım. İşte &amp;ouml;rnek kod par&amp;ccedil;amız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using (SqlConnection conn = new SqlConnection("data source=.;database=AdventureWorks;integrated security=SSPI")) 
{ 
    using (SqlDataAdapter adapter = new SqlDataAdapter("select * from Production.ProductPhoto", conn)) 
    { 
        DataSet ds = new DataSet("ProductPhoto"); 
        adapter.Fill(ds);

        BinaryFormatter formatter = new BinaryFormatter(); 
        FileStream fs= new FileStream("c:\\DataSet.bin",FileMode.OpenOrCreate,FileAccess.Write); 
        formatter.Serialize(fs, ds); 
        fs.Close(); 
        
        FileStream fsZip= new FileStream("c:\\DataSetZip.bin",FileMode.OpenOrCreate,FileAccess.Write); 
        GZipStream gStream = new GZipStream(fsZip, CompressionMode.Compress); 
        byte[] dataSetBytes=File.ReadAllBytes("C:\\DataSet.bin"); 
        gStream.Write(dataSetBytes, 0,dataSetBytes.Length); 
        gStream.Close(); 
        fsZip.Close(); 
    } 
}&lt;/pre&gt;
&lt;p&gt;Kod par&amp;ccedil;asından g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere ilk olarak Binary formatta bir &lt;strong&gt;DataSet&lt;/strong&gt; i&amp;ccedil;eriğini serlişetirmekteyiz. Bu zaten &lt;strong&gt;Session&lt;/strong&gt; tarafında &lt;strong&gt;SessionItemLong&lt;/strong&gt; veya &lt;strong&gt;SessionItemShort&lt;/strong&gt; alanına atılan serileştirilebilir i&amp;ccedil;eriktir. Kodun ilerleyen kısımlarında ise serileştirilen i&amp;ccedil;eriği &lt;strong&gt;GZipStream&lt;/strong&gt; sınıfından yararlanarak sıkıştırmaya &amp;ccedil;alışıyoruz. Bunun sonucu olarak &amp;uuml;retilen dosya i&amp;ccedil;eriklerinin boyutlarına baktığımızda ise aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;ları elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg237_Last.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="blg237_Last" src="/pics/blg237_Last_thumb.gif" alt="blg237_Last" width="586" height="48" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere serileştirilmiş i&amp;ccedil;erik ile serileştirilmiş i&amp;ccedil;eriğin sıkıştırılmış versiyonları arasında boyut olarak pek bir fark yoktur. Bu da &lt;strong&gt;DataSet&lt;/strong&gt; tipinin ve &amp;ouml;zellikle &lt;strong&gt;ProductionPhoto&lt;/strong&gt; i&amp;ccedil;erisindeki &lt;strong&gt;binary&lt;/strong&gt; alanlarının iyi bir şekilde sıkıştırılamıyor olmalarından kaynaklanmaktadır. Son geliştirdiğimiz &amp;ouml;rnek tamamen ve tamamen &lt;strong&gt;GZipStream&lt;/strong&gt; ile sıkıştırma tekniğinin her zaman işe yaramayacağını ve veri boyutunda daima &amp;ouml;nemli &amp;ouml;l&amp;ccedil;&amp;uuml;de bir değişikliğe neden olmayacağını g&amp;ouml;stermek &amp;uuml;zere ele alınmıştır bunu unutmayalım. Sanıyorum ki iyi kullanıldığı takdirde &lt;strong&gt;Session&lt;/strong&gt; sıkıştırması &amp;ouml;zellikle &amp;ccedil;ok fazla oturumun a&amp;ccedil;ıldığı web uygulamalarında, &lt;strong&gt;SQL Server&lt;/strong&gt; veya &lt;strong&gt;State Server&lt;/strong&gt; mod kullanılması halinde &amp;ouml;nemli yer kazancı sağlayacak şekilde fayda getirmektedir. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f11%2fOldStyleSession.rar"&gt;OldStyleSession.rar (137,04 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2010-11-02 15:10:00</pubDate>
  <slug>Ufak-Session-Icerikleri</slug>
  <tags>
    <tag>aspnet</tag>
    <tag>aspnet-40</tag>
    <tag>session</tag>
    <tag>session-compression</tag>
  </tags>
  <categories>
    <category>Asp.Net 4.0</category>
  </categories>
</post>