<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Powershell'i Kurcalayan Bir Yazılımcı</title>
  <description>Aslında Powershell betikleri uzun zamandır yaygın ve etkin bir şekilde kullanılıyor. Sistem yöneticilerinin biraz programlama bilgisi ile veya programcıların da biraz sistem bilgisi ile bu dili temel seviyede kullanmaları mümkün. Elimizdeki Windows 7'den son sürüm Windows Server ailesine kadar pek çok sistemde Powershell betiklerini kullanabiliriz. Geçtiğimiz günlerde bir boşluk yakaladım ve en çok tavsiye edilen Powershell betikleri nelerdir öğrenmek istedim. Uzman olmadığım bir alan olsa da tanıma mahiyetinde neler yapılabileceğini görmek istiyordum.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/06/powershell_1.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Powershell betikleri uzun zamandır yaygın ve etkin bir şekilde Windows ailesinde yer almakta. &amp;Ouml;zellikle sunucu tarafındaki kullanımının &amp;ouml;ne &amp;ccedil;ıktığını g&amp;ouml;r&amp;uuml;yoruz. Temel olarak işletim sistemi &amp;uuml;zerinden betik dillerin avantajlarını da kullanarak pek &amp;ccedil;ok işlemin yapılabilmesine olanak sağlayan bir kabuk olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Powershell .Net Framework k&amp;uuml;t&amp;uuml;phanelerini de doğrudan kullanabildiğinden &amp;ouml;nemli avantajlar sağlamaktadır. Klas&amp;ouml;r listeleme veya dosya kopyalama gibi &amp;ccedil;ok basit işlemler&amp;nbsp;dışında, n sayıda sunucuya dağıtım paketi &amp;ccedil;ıkacak programcıkların geliştirilmesi benzeri operasyonları da i&amp;ccedil;eren geniş bir yetkinliğe sahiptir. DevOps k&amp;uuml;lt&amp;uuml;r&amp;uuml;nde Windows ailesi i&amp;ccedil;in değerli ve &amp;ouml;ne &amp;ccedil;ıkan bir programlama ortamıdır diyebiliriz.&lt;/p&gt;
&lt;p&gt;Sistem y&amp;ouml;neticilerinin biraz programlama bilgisi ile veya programcıların da biraz sistem bilgisi ile bu dili temel seviyede kullanmaları m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Elimizdeki Windows 7'den son s&amp;uuml;r&amp;uuml;m Windows Server ailesine kadar pek &amp;ccedil;ok sistemde Powershell betiklerini kullanabiliriz. Ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde bir boşluk yakaladım ve en &amp;ccedil;ok tavsiye edilen Powershell betikleri nelerdir araştırayım dedim. Uzman olmadığım bir alan olsa da tanıma mahiyetinde neler yapılabileceğini g&amp;ouml;rmek istiyordum. Daha &amp;ouml;nceden Powershell ile &amp;uuml;zerinde Gacutil olmayan bir makinede .Net Framework 1.1 ile yazılmış bir k&amp;uuml;t&amp;uuml;phanenin register edilmesi ve eğlence ama&amp;ccedil;lı olarak Star Wars marşının &amp;ccedil;aldırılması gibi işlemler yapmıştım ama &amp;ccedil;ok &amp;ccedil;ok daha fazlası olduğunu biliyordum.&lt;/p&gt;
&lt;h1&gt;Makinemdeki Servisler&lt;/h1&gt;
&lt;p&gt;İlk olarak sistemde y&amp;uuml;kl&amp;uuml; servislerin bir listesini nasıl alırım sorusunun cevabını aradım. B&amp;ouml;ylece işletim sisteminin y&amp;ouml;netsel alanlarından birisine ait bilgilere nasıl ulaşabileceğimi g&amp;ouml;recektim. Komut satırından Powershell'i a&amp;ccedil;tım ve ilk betiği aşağıdaki gibi yazdım.&lt;/p&gt;
&lt;pre class="brush:ps;auto-links:false;toolbar:false" contenteditable="false"&gt;Get-Service&lt;/pre&gt;
&lt;p&gt;Komutun &amp;ccedil;ıktısı aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki gibi olmuştu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/Powershell_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Makinemde y&amp;uuml;kl&amp;uuml; olan t&amp;uuml;m servislerin bilgisini g&amp;ouml;rebiliyordum. Adları&lt;em&gt;(Name)&lt;/em&gt;, kısa a&amp;ccedil;ıklamaları&lt;em&gt;(Display Name)&lt;/em&gt; ve o anki durumları&lt;em&gt;(Status)&lt;/em&gt;. Liste g&amp;ouml;z&amp;uuml;me kalabalık g&amp;ouml;r&amp;uuml;n&amp;uuml;nce acaba bir sorgu atabilir miyim diye kurcalamaya başladım. Belki de adı C harfi ile başlayan servislerin listesini de &amp;ccedil;ekebilirdim. Araştırınca get-service fonksiyonunu aşağıdaki gibi kullanabileceğimi &amp;ouml;ğrendim.&lt;/p&gt;
&lt;pre class="brush:ps;auto-links:false;toolbar:false" contenteditable="false"&gt;Get-Service -name C*&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/Powershell_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Artık elimde adının ilk harfi C olan servislerin bir listesi vardı. Asteriks kullanımı s&amp;ouml;z konusu&amp;nbsp;olduğuna g&amp;ouml;re farklı benzerlikleri de sorgulayabilirdik. &amp;Ouml;rneğin i&amp;ccedil;inde .NET ge&amp;ccedil;en servisleri bulmak m&amp;uuml;mk&amp;uuml;nd&amp;uuml;. Ne var ki, durum bilgisine g&amp;ouml;re servisleri bir t&amp;uuml;rl&amp;uuml; sorgulayamıyordum. Aynen name parametresi gibi status parametresi &amp;uuml;zerinden de sorgu atabileceğimi d&amp;uuml;ş&amp;uuml;nm&amp;uuml;şt&amp;uuml;m.&lt;/p&gt;
&lt;pre class="brush:ps;auto-links:false;toolbar:false" contenteditable="false"&gt;get-service -status "running"&lt;/pre&gt;
&lt;p&gt;Ancak &amp;ccedil;alışma sonrası aşağıdaki hata mesajını aldım. status parametresi desteklenmiyordu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/Powershell_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Yardım Lazımdı&lt;/h1&gt;
&lt;p&gt;Peki get-service fonksiyonunun nasıl kullanıldığının bir dok&amp;uuml;manı yok muydu? &amp;Ouml;ğrendim ki get-help komutu ile bir başka powershell komutunun nasıl &amp;ccedil;alıştığını &amp;ouml;ğrenebilirim.&lt;/p&gt;
&lt;pre class="brush:ps;auto-links:false;toolbar:false" contenteditable="false"&gt;get-help get-service&lt;/pre&gt;
&lt;p&gt;Bu komutla get-service kullanımına ait yardım i&amp;ccedil;eriğine ulaştım. Komutun ne işe yaradığı, yazım bi&amp;ccedil;iminin nasıl olması gerektiği, parametreleri, genel a&amp;ccedil;ıklması ve hatta &amp;ouml;rnekler sunan yardımcı internet adresli bile vardı.&lt;/p&gt;
&lt;pre class="brush:ps;auto-links:false;toolbar:false" contenteditable="false"&gt;PS C:\Users\buraksenyurt&amp;gt; get-help get-service

NAME
    Get-Service

SYNOPSIS
    Gets the services on a local or remote computer.


SYNTAX
    Get-Service [[-Name] &amp;lt;string[]&amp;gt;] [-ComputerName &amp;lt;string[]&amp;gt;] [-DependentServices] [-Exclude &amp;lt;string[]&amp;gt;] [-Include &amp;lt;s
    tring[]&amp;gt;] [-RequiredServices] [&amp;lt;CommonParameters&amp;gt;]

    Get-Service -DisplayName &amp;lt;string[]&amp;gt; [-ComputerName &amp;lt;string[]&amp;gt;] [-DependentServices] [-Exclude &amp;lt;string[]&amp;gt;] [-Include
     &amp;lt;string[]&amp;gt;] [-RequiredServices] [&amp;lt;CommonParameters&amp;gt;]

    Get-Service [-InputObject &amp;lt;ServiceController[]&amp;gt;] [-ComputerName &amp;lt;string[]&amp;gt;] [-DependentServices] [-Exclude &amp;lt;string[
    ]&amp;gt;] [-Include &amp;lt;string[]&amp;gt;] [-RequiredServices] [&amp;lt;CommonParameters&amp;gt;]


DESCRIPTION
    The Get-Service cmdlet gets objects that represent the services on a local computer or on a remote computer, includ
    ing running and stopped services.

    You can direct Get-Service to get only particular services by specifying the service name or display name of the se
    rvices, or you can pipe service objects to Get-Service.


RELATED LINKS
    Online version: http://go.microsoft.com/fwlink/?LinkID=113332
    Start-Service
    Stop-Service
    Restart-Service
    Resume-Service
    Suspend-Service
    Set-Service
    New-Service

REMARKS
    To see the examples, type: "get-help Get-Service -examples".
    For more information, type: "get-help Get-Service -detailed".
    For technical information, type: "get-help Get-Service -full".

PS C:\Users\buraksenyurt&amp;gt;&lt;/pre&gt;
&lt;h1&gt;Where ile Sorguyu Genişlettim&lt;/h1&gt;
&lt;p&gt;Ger&amp;ccedil;ekten de get-service komutunun -status gibi bir parametresi mevcut değildi ancak -InputObject parametre kullanımı dikkat &amp;ccedil;ekiyordu. Biraz araştırmadan sonra aşağıdaki gibi bir komut ile DisplayName bilgisinde "Service" kelimesi ge&amp;ccedil;enler hizmetlerden durmuş olanları alabileceğimi g&amp;ouml;rd&amp;uuml;m.&lt;/p&gt;
&lt;pre class="brush:ps;auto-links:false;toolbar:false" contenteditable="false"&gt;Get-Service * | Where-Object {$_.DisplayName -like "*Service*" -and $_.Status -eq "Stopped"}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/Powershell_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu komutu anlamak olduk&amp;ccedil;a kolaydı. * ile Get-Service'in d&amp;ouml;nd&amp;uuml;receği t&amp;uuml;m servis listesi &amp;uuml;zerinde işlem yapacağımızı belirmiştik. |&amp;nbsp;arkasından bir where koşulu geliyordu. S&amp;uuml;sl&amp;uuml; parantezler belli ki bu komutun alacağı kod bloğunu taşıyacaktı. $_. ile başlayan değişkenler ile DisplayName ve az &amp;ouml;nce alamadığımız Status alanlarına ulaşabiliyorduk. -like benzer , -and mantıksal ve, -eq ise eşitlik anlamında kullanılan komut parametreleriydi&lt;em&gt;(Bu durumda b&amp;uuml;y&amp;uuml;kt&amp;uuml;r veya k&amp;uuml;&amp;ccedil;&amp;uuml;kt&amp;uuml;r&amp;uuml; hatta veyayı nasıl ifade edebileceğimizi de &amp;ccedil;&amp;ouml;zm&amp;uuml;ş oluyoruz)&lt;/em&gt;&lt;/p&gt;
&lt;h1&gt;D&amp;ouml;ng&amp;uuml; Kullanımını Merak Edince&lt;/h1&gt;
&lt;p&gt;Internet kaynaklarını tararken dilin pek &amp;ccedil;ok diğer dilde olan temel &amp;ouml;zelliklere sahip olduğunu g&amp;ouml;rmek ka&amp;ccedil;ınılmazdı. Değişken tanımlamaları, koşullu ifadeler, d&amp;ouml;ng&amp;uuml;ler vb Hazır elim değmişken bir de d&amp;ouml;ng&amp;uuml; yazayım istedim. &amp;Ouml;rneğin şu an makinede &amp;ccedil;alışmakta olan Process'lere bakıp Id ve Name bilgilerini ekrana bastırmaya &amp;ccedil;alıştım.&lt;/p&gt;
&lt;pre class="brush:ps;auto-links:false;toolbar:false" contenteditable="false"&gt;Get-Process| ForEach-Object{[string]::Format("{0} - {1}",$_.id,$_.name)}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/Powershell_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Burada dikkat &amp;ccedil;ekici noktalardan birisi de .Net k&amp;uuml;t&amp;uuml;phanesinden bir fonksiyona erişilmesiydi. String sınıfının Format metodunu kullandığımız g&amp;ouml;z&amp;uuml;n&amp;uuml;zden ka&amp;ccedil;mamış olmalı. [Sınıf Adı]::[Metod Adı] notasyonu ile static tanımlanmış &amp;uuml;yelere erişmek m&amp;uuml;mk&amp;uuml;n. ForEach-Object komutu ise Get-Process'in &amp;uuml;rettiği her bir process nesnesini dolaşmakta. D&amp;ouml;ng&amp;uuml; i&amp;ccedil;erisinde o anki Process'in id ve name bilgilerine nasıl eriştiğimize dikkat edelim.&lt;/p&gt;
&lt;h1&gt;&amp;Ccedil;ıktıları Dosyaya Basalım&lt;/h1&gt;
&lt;p&gt;Yaptığımız denemelerin sonu&amp;ccedil;ları hep komut satırına basıldı. Anlık olarak iyi olsa da bazen bu &amp;ccedil;ıktıları bir dosyaya basmak ve bir yerlere g&amp;ouml;ndermek de isteyebiliriz&lt;em&gt;(Hatta inanıyorum ki bir powershell işlem &amp;ccedil;ıktısının &amp;uuml;rettiği dosyayı otomatik mail ile bir yerlere yollayabilir veya ortak bir ağ klas&amp;ouml;r&amp;uuml;ne kopyalatabiliriz. Bir deneyin)&lt;/em&gt;&amp;nbsp;Bunun i&amp;ccedil;in out-file parametresini eklemek yeterli.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:ps;auto-links:false;toolbar:false" contenteditable="false"&gt;Get-Service * | Where-Object {$_.DisplayName -like "*Service*" -and $_.Status -eq "Stopped"} | out-file "ServiceReport.txt"&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/Powershell_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Bunları Fonksiyon Haline Getiremez miydim?&lt;/h1&gt;
&lt;p&gt;Servisler i&amp;ccedil;in uyguladığım betiğin &amp;ccedil;ıktısını metin tabanlı bir dosyaya basmış oldum. Pratik g&amp;ouml;r&amp;uuml;n&amp;uuml;yor değil mi? Aslında tam olarak değil.&amp;nbsp;Betikleri fonksiyonelleştirmek yeniden kullanılabilirlik anlamında &amp;ccedil;ok daha mantıklı olabilir. &amp;Ouml;rneğin servis raporunu &amp;ccedil;ekerken like, status ve dosya kriterlerini parametrik olarak bir fonksiyona almak &amp;ccedil;ok daha işe yarardı. Sonunda aşağıdaki gibi bir şeyler yazılabileceğini g&amp;ouml;rd&amp;uuml;m.&lt;/p&gt;
&lt;pre class="brush:ps;auto-links:false;toolbar:false" contenteditable="false"&gt;function Service-Report ($name="A*",$status="Running",$fileName="Service_Report.txt")
{
	Get-Service * | Where-Object {$_.Name -like $name -and $_.Status -eq $status} | out-file $fileName
}
&lt;/pre&gt;
&lt;p&gt;Service-Report bir fonksiyon olarak 3 parametre ile &amp;ccedil;alışmakta. $ işareti ile tanımlanan parametreler metod bloğunda aynı şekilde bir değişken olarak ele alınıyorlar. Dikkat &amp;ccedil;ekici nokta parametrelere varsayılan değer verilebilmesi. Yani name, status ve fileName bilgileri boş ge&amp;ccedil;ilirse varsayılan değerleri kullanılacak. Komut satırından bu fonksiyonu &amp;ccedil;alıştırmak da olduk&amp;ccedil;a kolay.&lt;/p&gt;
&lt;pre class="brush:ps;auto-links:false;toolbar:false" contenteditable="false"&gt;Service-Report "C*" "Stopped" "Reports.txt"&lt;/pre&gt;
&lt;p&gt;Reports.txt dosyasının i&amp;ccedil;inde artık adı C harfi ile başlayan durdurulmuş servislerin bir &amp;ccedil;ıktısı yer alıyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/Powershell_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;ISE Diye Sevimli Bir IDE&lt;/h1&gt;
&lt;p&gt;Bu işlerle uğraşırken komut satırının hem sevimli hem de sevimsiz olduğunu fark ettim. Terminalden &amp;ccedil;alışmak her zaman i&amp;ccedil;in daha keyifliydi ama iş bir betik hazırlamaya geldiğinde basit bir edit&amp;ouml;r hayat kurtarabilirdi. En azından Notepad++ d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilirdi. &amp;Ccedil;ok daha iyisini buldum. Powershell'in ISE&lt;em&gt;(Integrated Scripting Environment)&lt;/em&gt; adında bir de kod edit&amp;ouml;r&amp;uuml; varmış. Bunun &amp;uuml;zerine ISE edit&amp;ouml;r&amp;uuml;n&amp;uuml; a&amp;ccedil;ıp i&amp;ccedil;erisine iki fonksiyonellik katıp tools.ps1 adıyla bulunduğum klas&amp;ouml;re kayıt ettim.&lt;/p&gt;
&lt;pre class="brush:ps;auto-links:false;toolbar:false" contenteditable="false"&gt;function Service-Report ($name="A*",$status="Running",$fileName="Service_Report.txt")
{
	Get-Service * | Where-Object {$_.Name -like $name -and $_.Status -eq $status} | out-file $fileName
}

function Process-Report($name,$cpuRate,$fileName="Process.txt")
{
    Get-Process | where-object {$_.name -eq $name -and $_.CPU -gt $cpuRate} |Format-List * -Force | out-file $fileName
}&lt;/pre&gt;
&lt;p&gt;Artık fonksiyonellikleri bir betik dosyası i&amp;ccedil;erisine konumlandırıp komut satırından bu şekilde &amp;ccedil;alıştırabilirdim. ISE yetenekli bir edit&amp;ouml;r. Betiği yazabildiğimiz aray&amp;uuml;z&amp;uuml; dışında yine kendi &amp;uuml;st&amp;uuml;nde yer alan komut satırı ile &amp;ccedil;alışmaların anında denenmesi m&amp;uuml;mk&amp;uuml;n. &amp;Uuml;stelik &amp;ccedil;ağırılan komutların geriye doğru log'unun tutulduğu bir penceresi de mevcut.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bu arada bir ps1 dosyasının y&amp;uuml;klenmesi sırasında "...cannot be loaded because the execution of scripts is disabled on this system" şeklinde bir hata alınıyorsa ExecutionPolicy değerinin RemoteSigned olarak değişitirilmesi &amp;ccedil;&amp;ouml;z&amp;uuml;m olabilir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/Powershell_9.gif" alt="" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;ISE edit&amp;ouml;r&amp;uuml;nde tools.sp1 dosyası i&amp;ccedil;erisindeki fonksiyonların kullanılabilmesi i&amp;ccedil;in &amp;ouml;ncelikde dosyanın sistem &amp;ccedil;alışma zamanına y&amp;uuml;klenmesi gerekiyor. Bir program &amp;ccedil;alıştırıyor gibi F5 ile veya Debug men&amp;uuml;s&amp;uuml;nden Run/Continue komutları sayesinde bu işlem ger&amp;ccedil;ekleştirilebilir.&amp;nbsp;Dosya başarılı bir şekilde y&amp;uuml;klendikten sonra i&amp;ccedil;erisindeki fonksiyonlar kullanılabilir hale gelir. S&amp;ouml;z gelimi tools.ps1'i y&amp;uuml;kledikten sonra sistemde o an a&amp;ccedil;ık olan chrome sekmelerinden CPU t&amp;uuml;ketimi belli bir değerin &amp;uuml;st&amp;uuml;nde olanları bulmak i&amp;ccedil;in aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne olduğu gibi ilerlememiz yeterlidir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/Powershell_10.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Kimbilir Powershell betikleri ile daha neler neler yapılabilir? Mesela &amp;ccedil;ok fazla bellek t&amp;uuml;keten process'lerin belirli kriterlere uyanlarını &amp;ouml;ld&amp;uuml;rebilecek, durmuş bir servisi tekrardan ayağa kaldırabilecek betikler yazabilir, ağ&amp;nbsp;&amp;uuml;zerinden ulaşılabilecek uzak sunucular hakkında anlık durum bilgilerine sahibi olabiliriz. Sistem &amp;uuml;zerinden ger&amp;ccedil;ekleştirilecek t&amp;uuml;m bu operasyonlarda sadece bu alana &amp;ouml;zel yazılmış bir betik dilin programlama &amp;ouml;zelliklerine sahip olmak da işin cabası.&lt;/p&gt;
&lt;p&gt;Bu yazıdaki anafikre&amp;nbsp;g&amp;ouml;re&amp;nbsp;kısa zamanda &amp;ouml;ğrenilebilecek bir betik dil ile işletim sistemi &amp;uuml;zerinde&amp;nbsp;hakimiyet sağlayıp pek &amp;ccedil;ok işi otomatize edecek geliştirmeler yapabileceğimizi d&amp;uuml;ş&amp;uuml;nebiliriz. İşte b&amp;ouml;yle sevgili okuyucu. Bir boşluğu iyi değerlendirmek adına Powershell ile yaptığım bir ka&amp;ccedil; saatli maceralarımı kısaca anlatmaya &amp;ccedil;alıştım. İşi daha da ileri g&amp;ouml;t&amp;uuml;rmek m&amp;uuml;mk&amp;uuml;n. Ara ara burada betikler yazılabilir. &lt;a href="https://www.amazon.com/s/ref=sr_st_date-desc-rank?keywords=powershell+scripting&amp;amp;rh=i%3Aaps%2Ck%3Apowershell+scripting&amp;amp;qid=1497268080&amp;amp;sort=date-desc-rank" target="_blank"&gt;Amazon'da konu ile ilgili pek &amp;ccedil;ok kitap&lt;/a&gt; var ama&amp;nbsp;şuradaki &lt;a href="http://powershelltutorial.net/" target="_blank"&gt;online tutorial seti&lt;/a&gt; de epey işe yarar g&amp;ouml;r&amp;uuml;n&amp;uuml;yor. Bir başka yazımızda g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-06-14 09:27:00</pubDate>
  <slug>powershell-ile-bir-seyler-yapmaya-calisan-bir-yazilimci</slug>
  <tags>
    <tag>powershell</tag>
    <tag>script-languages</tag>
    <tag>scripting</tag>
    <tag>betik-diller</tag>
    <tag>shell-programming</tag>
  </tags>
  <categories>
    <category>Powershell</category>
  </categories>
</post>