<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Sıkça Duyduğum Deno'ya Hello Dedim</title>
  <description>Şu sıralar adını sıklıkla duyduğum ve NodeJs'in yerini alır mı almaz mı tartışmalarını(ki öyle bir şey yok) okuduğum Deno'yu basit bir örnekle inceledim. Javascript haricinde dahili olarak Typescript desteği de sunan, V8 üzerinde koşan ve Rust ile yazılmış bir çalışma zamanı olarak nitelendiriliyor Deno. Ben nasıl bir geliştirme tecrübesi yaşatacağını tatmak istemiştim. Klasik kurgu olarak REST tipinden bir servisin birkaç operasyonunu icra etsem yeterliydi. Örnek verileri almak için International Chuck Norris veritabanını kullandım :D Keza biraz eğlence katmak lazımdı olaya. Hatta verileri SQLite veritabanında tutmak da fena olmayacak.</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/07/denverdino.jpg" alt="" align="right" /&gt;&lt;em&gt;Denver, the last dinosaur&lt;/em&gt;&lt;br /&gt;&lt;em&gt;He's my friend and a whole lot more&lt;/em&gt;&lt;br /&gt;&lt;em&gt;Denver, the last dinosaur&lt;/em&gt;&lt;br /&gt;&lt;em&gt;Shows me a world I never saw before...&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Ha ha haaa! Deno'nun logosunu g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m zaman her nedense aklıma, orta lise &amp;ccedil;ağlarımda&amp;nbsp;izlediğim &amp;ccedil;izgi dizi Denver'ın bu s&amp;ouml;zleri gelmişti. Ve hatta melodisi! O s&amp;ouml;zler eşliğinde 2020'nin herhangi bir noktasında sonradan eskiyeceğinden emin olduğum bir &amp;ccedil;alışmaya girişeyim istedim. Deno ile basit bir REST servisi ile merhaba demek. Notlar Github'daki skynet reposunda birikti. Buraya da derlenmiş bir &amp;ouml;zetini yazmak d&amp;uuml;şt&amp;uuml;.&lt;/p&gt;
&lt;p&gt;Bir s&amp;uuml;re &amp;ouml;nce adını sıklıkla duyduğum ve NodeJs'in yerini alır mı almaz mı tartışmalarını&lt;em&gt;(ki &amp;ouml;yle bir şey yok)&lt;/em&gt; okuduğum Deno'yu basit bir &amp;ouml;rnekle incelemek istedim. Deno, Javascript haricinde dahili olarak Typescript desteği de sunan&lt;em&gt;(ki &amp;ouml;rnekte de onu kullandım)&lt;/em&gt;, V8 &amp;uuml;zerinde koşan ve Rust ile yazılmış bir &amp;ccedil;alışma zamanı olarak nitelendiriliyor. İşin i&amp;ccedil;erisinde Rust olduğu i&amp;ccedil;in performans anlamında olduk&amp;ccedil;a &amp;ouml;nemli beklentiler de beraberinde geliyor. Ben nasıl bir geliştirme tecr&amp;uuml;besi yaşatacağını tatmak istemiştim. Klasik kurgu olarak REST tipinden bir servisin birka&amp;ccedil; operasyonunu icra etsem yeterli olacaktı. &amp;Ouml;rnek verileri almak i&amp;ccedil;in &lt;a href="http://www.icndb.com/" target="_blank"&gt;&lt;strong&gt;International Chuck Norris&lt;/strong&gt;&lt;/a&gt; veritabanını kullandım :D Keza&amp;nbsp;olaya biraz da olsa&amp;nbsp;eğlence katmak her zaman iyidir. Hatta verileri SQLite veritabanında tutmak da fena olmaz. Onu kullanmak i&amp;ccedil;in bir kurulum yapmaya da pek gerek yok doğrusu. Sadece Deno Land'den &amp;ccedil;ekeceğimizi s&amp;ouml;ylesek yeterli. &amp;Ouml;yleyse harakete ge&amp;ccedil;me zamanı.&lt;/p&gt;
&lt;h2&gt;Kurulum (Aslında Pek de Değil)&lt;/h2&gt;
&lt;p&gt;İlk olarak deno &amp;ccedil;alışma zamanını sistemime&lt;em&gt;(Heimdall - Ubuntu 20.04)&lt;/em&gt; y&amp;uuml;klemek gerekiyordu. &lt;a href="https://deno.land/#installation" target="_blank"&gt;Resmi adresinde&lt;/a&gt; basit bir kurulum kılavuzu mevcut. Ben şirket bilgisayarına&lt;em&gt;(powershell &amp;uuml;zerinden)&lt;/em&gt; ve evdeki Linux sistemime ilgili kurulumu aşağıdaki komutlarla yaptım. Windows tarafında tek bir exe geldi ki zaten Deno'nun &amp;ouml;zelliği de buymuş. NodeJs gibi bir kurulum gerektirmiyor ve tek binary yeterli oluyor. İhtiya&amp;ccedil; duyulan mod&amp;uuml;ller &lt;a href="https://deno.land/std" target="_blank"&gt;https://deno.land/std&lt;/a&gt; ve benzeri paket adreslerinden import ile uygulama ortamına indiriliyor. Doğruyu s&amp;ouml;ylemek gerekirse zahmetsiz bir kurulum oldu diyebilirim :)&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;$env:DENO_INSTALL = "C:\Program Files\deno"
iwr https://deno.land/x/install/install.ps1 -useb | iex
curl -fsSL https://deno.land/x/install/install.sh | sh&lt;/pre&gt;
&lt;p&gt;&amp;Ccedil;alışmak istediğim uygulama iskeletini ise aşağıdaki şekilde kurguladım. Servis basit bir şekilde yeni Chuck Norris şakaları eklenmesine ve var olan şakaların listelenmesine imkan tanıyacak.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;mkdir chuck_jokes
cd chuck_jokes
touch main.ts
mkdir controller route
touch controller/jokescontroller.ts route/jokesrouter.ts&lt;/pre&gt;
&lt;h2&gt;Kod İ&amp;ccedil;erikleri&lt;/h2&gt;
&lt;p&gt;Şakaları kod tarafında ifade etmek i&amp;ccedil;in model klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisinde yer alan joke sınıfını ve hatta &amp;ouml;rnek şakaları tutmak i&amp;ccedil;in jokesdb dosyasını kullanmıştım. Sonrasında ise SQLite'ı kullanmaya karar verdim. Bu nedenle controller sınıfını SQLite kullanacak hale d&amp;ouml;n&amp;uuml;şt&amp;uuml;rd&amp;uuml;m&lt;em&gt;(Her nedense birka&amp;ccedil; alan i&amp;ccedil;in ayrı bir model tipi kullanmayı terk etmişim. Sanırım &amp;ccedil;abuk bir Hello World olsun istemişim)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;import { open, save } from "https://deno.land/x/sqlite/mod.ts"; //SQLite'ı işin i&amp;ccedil;erisine katalım

//SQLite veritabanını bir hazırlayalım
const db = await open("ICNDB.db"); // International Chuck Norris Database :)
// Şayet veritabanı dosyasında Jokes tablosu yoksa oluşturalım
await db.query("CREATE TABLE IF NOT EXISTS Jokes (id INTEGER PRIMARY KEY AUTOINCREMENT, content TEXT,popularity TEXT)")
await save(db);

// Yeni bir şaka eklemek i&amp;ccedil;in kullanılır
export const insert = async ({ request, response }: { request: any; response: any }) =&amp;gt; {
    // HTTP Post Body'sinde bir şey yoksa 400 ile geri d&amp;ouml;nelim
    if (!request.hasBody) {
        response.status = 400;
        response.body = { msg: "Şaka mı yapıyorsun?" };
        return;
    }

    // body i&amp;ccedil;eriğini content ve popularity'ye alalım. (bunların da olup olmadığını kontrol etmek lazım)
    const {
        value: { content, popularity }
    } = await request.body();

    //console.log(content + ' ' + popularity);

    // Insert sorgusunu &amp;ccedil;alıştıralım
    await db.query("INSERT INTO Jokes (content,popularity) VALUES (?,?)", [content, popularity]);
    // Değişikliği kaydedip kapatalım
    await save(db);

    // HTTP 200 OK d&amp;ouml;nelim
    response.status = 200;
    response.body = { message: 'Chuck Norris buna sevindi :D' }
}

// Select All fonksiyonu
export const getAll = async ({ request, response }: { request: any; response: any }) =&amp;gt; {

    // Select sorgusunun sonucunu bir array'e alıyoruz
    const allJokes = [];
    for (const [id, content, popularity] of await db.query(
        "SELECT id,content,popularity FROM jokes ORDER BY id DESC")) {
        allJokes.push({ RuleNo: id, chuksMessage: content, Pop: popularity });
    }

    // HTTP 200 ile elde ettiğimiz i&amp;ccedil;eriği d&amp;ouml;nd&amp;uuml;r&amp;uuml;yoruz
    response.status = 200;
    response.type = "application/json";
    response.body = JSON.stringify(allJokes);
}

//TODO: getById, Delete, Update gibi operasyonlar eklenebilir&lt;/pre&gt;
&lt;p&gt;Olmazsa olmaz bu CRUD&lt;em&gt;(CreateReadUpdateDelete)&lt;/em&gt; operasyonlarının HTTP talepleri ile buluştuğu noktada devreye girecek bir sunucu da gerekiyor. Sunucu g&amp;ouml;revini ise jokesrouter sınıfı &amp;uuml;stleniyor. Kodu olduk&amp;ccedil;a basit. Kritik nokta gelen HTTP taleplerinin jokescontroller i&amp;ccedil;erisindeki fonksiyonlarla eşleştirilmesi.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;import { Router } from "https://deno.land/x/oak/mod.ts"; //HTTP Server g&amp;ouml;revini &amp;uuml;stlenecek typescript mod&amp;uuml;l&amp;uuml;
// deno.land/x adresinde 3rd Party mod&amp;uuml;ller yer alır
import { getAll, insert } from '../controller/jokescontroller.ts';

const router = new Router();

// Root web adresine gelen ki(http://localhost:5555 oluyor) talepler i&amp;ccedil;in y&amp;ouml;nlendirme
router
    .get("/", getAll)
    .post("/", insert);
    //TODO: getById, Delete, Update gibi operasyonlar eklenebilir

export default router;&lt;/pre&gt;
&lt;p&gt;Elbette uygulamanın ana &amp;ccedil;alıştırıcısının da kodlanması gerekir. İşte&amp;nbsp;&amp;ccedil;alıştırıcı g&amp;ouml;revini &amp;uuml;stlenen&amp;nbsp;main.ts i&amp;ccedil;eriği.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;import { Application } from "https://deno.land/x/oak/mod.ts"; //Mod&amp;uuml;l sistemi NodeJS ile farklı. URL kullanılıyor.
import router from "./route/jokesrouter.ts"; // Deno Varsayılan olarak Typescript kullanıyor ve destekliyor
import errorHandler from "./errorHandler.js";
import { open, save } from "https://deno.land/x/sqlite/mod.ts";

const PORT = 5555;
const app = new Application();

app.use(errorHandler);
// Middleware'e router eklendi.
app.use(router.routes());
// HTTP Get, Post, Put, Delete, Head, Options, Patch metodlarının kullanımına izin veriyoruz
app.use(router.allowedMethods());

console.log(`Chuck Norris ${PORT} nolu portta hazır :[] `);

// Portu a&amp;ccedil;ıp dinlemeye başlıyoruz
app.listen({ port: PORT });&lt;/pre&gt;
&lt;p&gt;K&amp;uuml;&amp;ccedil;&amp;uuml;k bir dipnot; hata y&amp;ouml;netimi i&amp;ccedil;in aşağıdaki errorHandler sınıfı kullanılmakta.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;export default async ({ response }, nextFn) =&amp;gt; {
    try {
        await nextFn();
    } catch (err) {
        response.status = 500;
        response.body = { msg: err.message };
    }
};&lt;/pre&gt;
&lt;p&gt;Kod tarafındaki bu hazırlıkları tamamladıktan sonra birka&amp;ccedil; deneme yaptım.&lt;/p&gt;
&lt;h2&gt;&amp;Ccedil;alışma Zamanı&lt;/h2&gt;
&lt;p&gt;Uygulamayı &amp;ccedil;alıştırırken internetten indirilecek bazı mod&amp;uuml;ller olması sebebiyle --allow-net ile erişime izin verilmesi gerekiyor. Ayrıca SQLite veritabanı i&amp;ccedil;in diske yazma ve diskten okuma iznini de bu uygulamaya vermek lazım. Sanırım NodeJs'in yaratıcısının dili bir takım zafiyetlerden dolayı epeyce yanmış. O nedenle bu insiyatif geliştiricinin sorumluluğunda.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;deno run --allow-net --allow-write --allow-read main.ts&lt;/pre&gt;
&lt;p&gt;İşte Heimdall&lt;em&gt;(Ubuntu 20.04)&lt;/em&gt; &amp;ccedil;alışma zamanına ait birka&amp;ccedil; g&amp;ouml;r&amp;uuml;nt&amp;uuml;&lt;em&gt;(Eğer aynı &amp;ouml;rneği kendi ortamınızda inşa edip benzer g&amp;ouml;r&amp;uuml;nt&amp;uuml;leri alamıyorsanız s&amp;uuml;r&amp;uuml;m farklılıklarına takılmış veya kod tarafında bir hata yapmış olabilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Terminalden gerekli izinleri verip uygulamayı &amp;ccedil;alıştırdıktan sonra curl ile &amp;ccedil;ektiğimiz &amp;ouml;rnek veriler...&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/07/screenshot_4.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alışma sırasında sık sık verilerin db'ye yazılıp yazılmadığını da Visual Studio Code &amp;uuml;st&amp;uuml;ndeki SQLite eklentisinden kontrol ettim. Başta s&amp;ouml;ylemeyi unuttum ama Ubuntu ortamımda&amp;nbsp;her zaman olduğu gibi geliştirme aracı olarak Visual Studio Code kullanmaktayım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/07/screenshot_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabii veri eklemek i&amp;ccedil;in en kolay yollardan birisi Postman. Aşağıda &amp;ouml;rnek bir POST &amp;ccedil;ağrısı ile bir Chuck Norris şakası ekleyişimiz resmedilmekte :)&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/07/screenshot_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Http Get ile t&amp;uuml;m listeyi de aşağıdaki gibi &amp;ccedil;ekebiliyoruz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/07/screenshot_3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Chuck Norris artık mutlu diyebilirim. Ancak yapılması gereken bir&amp;ccedil;ok şey var. &amp;Ouml;rneğin verinin devasallaşacağını d&amp;uuml;ş&amp;uuml;nerek servisin sayfalamalı bir şekilde cevap d&amp;ouml;nd&amp;uuml;rmesini sağlayabiliriz. Bunlara ek olarak g&amp;uuml;ncelleme ve silme gibi operasyonları da işin i&amp;ccedil;erisine katmak iyi bir pratik olabilir. Bunları Deno'nun g&amp;uuml;ncel s&amp;uuml;r&amp;uuml;mleri &amp;uuml;zerinden denemenizi &amp;ouml;neririm. Kodun son haline &lt;a href="https://github.com/buraksenyurt/skynet/tree/master/No%2007%20-%20What%20is%20Deno" target="_blank"&gt;github&lt;/a&gt;&amp;nbsp;SkyNet reposu &amp;uuml;zerinden ulaşabilirsiniz. Tekrarda g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2020-01-04 21:00:00</pubDate>
  <slug>sikca-duydugum-deno-ya-hello-dedim</slug>
  <tags>
    <tag>deno</tag>
    <tag>nodejs</tag>
    <tag>javascript</tag>
    <tag>linux</tag>
    <tag>sqlite</tag>
    <tag>router</tag>
    <tag>postman</tag>
    <tag>ubuntu</tag>
  </tags>
  <categories>
    <category>Node.js</category>
  </categories>
</post>