<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net 2.0 ve ObjectDataSource Kontrolü</title>
  <description>Bu makalemizde ObjectDataSource bileşenini incelemeye çalışacağız. ObjectDataSource bileşeni Asp.Net 2.0 ile gelen yeni bileşenlerden birisidir. Görevi, 3 katlı mimarinin uygulanması halinde, verikaynağı ile sunum katmanında yer alan veri bağlı kontroller arasındaki veri alışverişinin, iş katmanı üzerindeki herhangibir nesne yardımıyla gerçekleştirilebilmesini sağlamaktır. Başka bir deyişle, veri-bağlı kontroller ile, iş katmanında yer alan iş nesnesi arasındaki iletişimi sağlamaktadır.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bu makalemizde ObjectDataSource bileşenini incelemeye &amp;ccedil;alışacağız. ObjectDataSource bileşeni Asp.Net 2.0 ile gelen yeni bileşenlerden birisidir. G&amp;ouml;revi, 3 katlı mimarinin uygulanması halinde, verikaynağı ile sunum katmanında yer alan veri bağlı kontroller arasındaki veri alışverişinin, iş katmanı &amp;uuml;zerindeki herhangibir nesne yardımıyla ger&amp;ccedil;ekleştirilebilmesini sağlamaktır. Başka bir deyişle, veri-bağlı kontroller ile, iş katmanında yer alan iş nesnesi arasındaki iletişimi sağlamaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk92_6.gif" alt="" width="485" height="300" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. ObjectDataSource bileşenin 3 katlı mimarideki rol&amp;uuml;.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizi incelediğimizde ObjectDataSource nesnesinin 3 katlı mimarideki yerini daha kolay anlama fırsatı bulacağız. Şimdi şu senaryoyo g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. Web sitemizdeki veri bağlı kontrollerin herhangibir veri kaynağından veri &amp;ccedil;ekmek, veri eklemek, veri silmek ve veri g&amp;uuml;ncellemek gibi işlemler i&amp;ccedil;in bir sınıf ve metodlarını kullandığını d&amp;uuml;ş&amp;uuml;nelim. İşte bu sınıfın sağlamış olduğu fonksiyonellikleri, sunum katmanında yer alan veri-bağlı kontroller ile kolayca ger&amp;ccedil;ekleştirebilmek amacıyla ObjectDataSource nesnesini kullanabiliriz. &amp;Ouml;rnek olarak, Personel ile ilgili kayıtları tutan bir access tablomuz olduğunu d&amp;uuml;ş&amp;uuml;nelim. Amacımız ilk olarak, bu tablodaki verileri alıp getirecek ve yeni bir satır veri girilmesini sağlayacak bir metoda sahip olan bir sınıf yazmak olsun. Bunun i&amp;ccedil;in aşağıdaki kodlara sahip bir sınıf geliştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.Data.OleDb;
using System.Web;

public class IsNesnesi 
{
    public DataSet VerileriAl()
    {
        OleDbConnection con = new OleDbConnection("Provider=Microsoft.Jet.OLEDB.4.0;data source=" + HttpContext.Current.Server.MapPath("~/Data/Veriler.mdb"));
        OleDbDataAdapter da = new OleDbDataAdapter("Select * From Personel", con);
        DataSet ds = new DataSet();
        da.Fill(ds);
        return ds;
    }
    public int VeriGir(string ad, string soyad, string mail, string departman, DateTime giris)
    {
        OleDbConnection con = new OleDbConnection("Provider=Microsoft.Jet.OLEDB.4.0;data source=" + HttpContext.Current.Server.MapPath("~/Data/Veriler.mdb"));
        OleDbCommand cmd = new OleDbCommand("Insert Into Personel (PerAd,PerSoyad,Departman,Mail,GirisTarihi) Values ('" + ad + "','" + soyad + "','" + departman + "','" + mail + "','" + giris + "')", con);
        con.Open();
        int sonuc = cmd.ExecuteNonQuery();
        con.Close();
        return sonuc;
    }
    public IsNesnesi()
    {
    }
}&lt;/pre&gt;
&lt;p&gt;VerileriAl isimli metodumuz, Veriler isimli Access veritabanına bağlanarak burada yer alan Personel isimli tablodan t&amp;uuml;m satırları alıyor ve bu satırları y&amp;uuml;klediği DataSet nesnesini geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;yor. VeriGir isimli metodumuz ise, parametreler alarak, tablomuza yeni bir satır ekliyor ve OleDbCommand nesnesinin ExecuteNonQuery metodunun &amp;ccedil;alıştırılması sonucu d&amp;ouml;nen integer değeri &amp;ccedil;ağırıldığı yere aktarıyor. Şimdi bu sınıfımızı kullanacak bir web uygulaması inşa edelim. Web sitemizde, iş nesnemize ait IsNesnesi sınıfını Code klas&amp;ouml;r&amp;uuml;m&amp;uuml;z&amp;uuml;n altına yerleştireceğiz. Bununla birlikte, veritabanımızıda yine Data klas&amp;ouml;r&amp;uuml; altına kopyalayalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk92_5.gif" alt="" width="299" height="263" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. Uygulama yapımız.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu &amp;ouml;n hazırlıklardan sonra, default.aspx sayfamızıda aşağıdaki kontrolleri barındıracak şekilde oluşturalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk92_1.gif" alt="" width="517" height="438" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. default.aspx sayfamızın yapısı.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Burada&amp;nbsp; iş nesnesi ile formda yer alan bağlı kontroller arasındaki ilişkiyi sağlamak &amp;uuml;zere bir ObjectDataSource nesnemiz yer almaktadır. İlk &amp;ouml;nce, ObjectDataSource bileşenimizin aspx kodlarını aşağıdaki gibi tamamlayalım.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:ObjectDataSource ID="ObjectDataSource1" Runat="server" TypeName="IsNesnesi"
SelectMethod="VerileriAl" InsertMethod="VeriGir"&amp;gt;
    &amp;lt;InsertParameters&amp;gt;
        &amp;lt;asp:Parameter Name="ad"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
        &amp;lt;asp:Parameter Name="soyad"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
        &amp;lt;asp:Parameter Name="mail"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
        &amp;lt;asp:Parameter Name="departman"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
        &amp;lt;asp:Parameter Name="giris" Type="DateTime"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
    &amp;lt;/InsertParameters&amp;gt;
&amp;lt;/asp:ObjectDataSource&amp;gt;&lt;/pre&gt;
&lt;p&gt;ObjectDataSource bileşenimizin başarılı bir şekilde işleyebilmesi i&amp;ccedil;in en &amp;ouml;nemli gereklilikler, select, insert, update ve delete işlemleri i&amp;ccedil;in iş nesnesi &amp;uuml;zerindeki hangi metodların kullanacağının bildirilmesidir. Biz &amp;ouml;rneğimizde ye alan iş nesnesine ait sınıf i&amp;ccedil;erisinde, veri &amp;ccedil;ekmek ve veri girişi i&amp;ccedil;in iki metod tanımladık. ObjectDataSource bileşeninin SelectMethod ve InsertMethod &amp;ouml;zelliklerine, ilgili Select ve Insert işlevlerini ger&amp;ccedil;ekleştiren iş nesnesi metodlarının adlarını aktarıyoruz. Artık ObjectDataSource ile veriye bağlanacak olan nesneler, veri &amp;ccedil;ekmek ve veri girişi i&amp;ccedil;in burada belirtilen metodları kullanacaklardır. Tabiki, ObjectDataSource' un bu bilgiler dışında ilgili metodları i&amp;ccedil;ieren sınıf hakkında da bilgiye sahip olması gerekir. İşte bunun i&amp;ccedil;inde, TypeName &amp;ouml;zelliğine ilgili iş nesnesinin sınıf adı atanır.&lt;/p&gt;
&lt;p&gt;Şunu hemen belirtelim ki, burada tanımladığımız sınıf başka bir isim alanı altında olabilir. Bu durumda, bu sınıfa tam olarak ulaşılacak tip bilgisinin TypeName &amp;ouml;zelliğinde belirtilmesi gerekir. &amp;Ouml;rneğin, sınıfımız IsKatmani isimli bir isim alanında bulunuyorsa bu durumda TypeName &amp;ouml;zelliğine IsKatmani.IsNesnesi değeri girilmelidir.&lt;/p&gt;
&lt;p&gt;Diğer DataSource bileşenlerinde olduğu gibi, Insert, Update ve Delete gibi işlemler parametreler yolu ile gerşekleştirilmektedir. Bizimde burada, Insert metodumuzda kullandığımız bazı parametreler mevcuttur. İşte bu parametreleri temsil etmesi i&amp;ccedil;in, ObjectDataSource kontrol&amp;uuml;n&amp;uuml;n InsertParameters koleksiyonu kullanılmıştır. Delete ve Update işlemlerinde de DeleteParameters ve UpdateParameters koleksiyonları kullanılır.&lt;/p&gt;
&lt;p&gt;Gelelim, formumuzda yer alan veri bağlı kontrollere. Veri &amp;ccedil;ekme işlemi sonrasında, tablomuzda yer alan satırları GridView kontrol&amp;uuml;nde g&amp;ouml;stermek istediğimiz i&amp;ccedil;in, GridView kontrol&amp;uuml;ne ait aspx kodlarını aşağıdaki gibi yazmalıyız.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:GridView ID="GridView1" Runat="server" DataSourceID="ObjectDataSource1" AutoGenerateColumns="false"&amp;gt;
    &amp;lt;Columns&amp;gt;
        &amp;lt;asp:BoundField DataField="PerAd" HeaderText="Personel Adı"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
        &amp;lt;asp:BoundField DataField="PerSoyad" HeaderText="Personel Soyadı"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
        &amp;lt;asp:BoundField DataField="Departman" HeaderText="Departmanı"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
        &amp;lt;asp:BoundField DataField="GirisTarihi" DataFormatString="{0:dd.mm.yyyy}" HeaderText="İşe Başlama Tarihi"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
        &amp;lt;asp:BoundField DataField="Mail" HeaderText="Mail Adresi"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
    &amp;lt;/Columns&amp;gt;
&amp;lt;/asp:GridView&amp;gt;&lt;/pre&gt;
&lt;p&gt;GridView kontrol&amp;uuml;m&amp;uuml;zde DataSourceID &amp;ouml;zelliğine ObjectDataSource bileşenimizin ID değerini atamak ile, &amp;ccedil;alışma zamanında GridView kontrol&amp;uuml;nde, ObjectDataSource' un iş nesnesi &amp;uuml;zerinden &amp;ccedil;alıştırdığı Select metodundan d&amp;ouml;nen DataSet' e ait satırların g&amp;ouml;sterilmesini sağlamış oluyoruz. Eğer sayfamızı bu haliyle &amp;ccedil;alıştıracak olursak aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk92_2.gif" alt="" width="586" height="395" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. Select metodunun &amp;ccedil;alışması sonucu.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Gelelim Insert işlevinin nasıl ger&amp;ccedil;ekleştirileceğine. Yeni bir satır eklemek i&amp;ccedil;in Ekle başlıklı button kontrol&amp;uuml;m&amp;uuml;ze bir ka&amp;ccedil; satır kod yazacağız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;void btnEkle_Click(object sender, EventArgs e)
{
    ObjectDataSource1.InsertParameters["ad"].DefaultValue = txtAd.Text;
    ObjectDataSource1.InsertParameters["soyad"].DefaultValue = txtSoyad.Text;
    ObjectDataSource1.InsertParameters["mail"].DefaultValue = txtMail.Text;
    ObjectDataSource1.InsertParameters["departman"].DefaultValue = txtDepartman.Text;
    ObjectDataSource1.InsertParameters["giris"].DefaultValue = txtGiris.Text;
    ObjectDataSource1.Insert();
}&lt;/pre&gt;
&lt;p&gt;ObjectDataSource kontrol&amp;uuml;m&amp;uuml;z, iş nesnesi &amp;uuml;zerindeki Insert işlevini ger&amp;ccedil;ekleştirecek metodu bilmektedir. Ayrıca, bu metoda g&amp;ouml;ndermesi gereken parametrelerin ne olacağınıda bilir. Bununla birlikte, Insert işlevini ger&amp;ccedil;ekleştirecek olan iş nesnesi metodu i&amp;ccedil;in gerekli parametre değerlerinin bir şekilde g&amp;ouml;nderilmesi gerekmektedir. Bu ama&amp;ccedil;la, ObjectDataSource nesnesinin InsertParameters koleksiyonundaki her bir parametreye gerekli değerler g&amp;ouml;nderilir. Daha sonra ise bu parametrelerin değerleri, iş nesnesindeki metod i&amp;ccedil;inde var olan karşılıklarına g&amp;ouml;nderilir. Bu g&amp;ouml;nderme emrini ise Insert metodu verir.&lt;/p&gt;
&lt;p&gt;Başka bir deyişle, Insert metodu, ObjectDataSource kontrol&amp;uuml;n&amp;uuml;n InsertParameters koleksiyonunda yer alan parametre değerlerini, iş nesnesi &amp;uuml;zerindeki ilgili metoda g&amp;ouml;nderir ve bu metodu &amp;ccedil;alıştırır. Tabi burada ObjectDataSource bileşenindeki InsertParameters koleksiyonunda yer alan parametrelerinin Name &amp;ouml;zelliklerinin değerlerinin, iş nesnesindeki VeriGir metodundaki parametre isimleri ile aynı olduğunda dikkat etmemiz gerekmektedir. Sonu&amp;ccedil; olarak veri giriş işlemi ger&amp;ccedil;ekleşmiş olur. Şimdi uygulamamızı denersek, yeni satırlar ekleyebildiğimizi g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk92_3.gif" alt="" width="583" height="390" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 5. Yeni satırı eklemeden &amp;ouml;nce.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk92_4.gif" alt="" width="574" height="416" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 6. Yeni satır girildikten sonra.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Insert işleminde dikkat ederseniz, TextBox kontrollerine girdiğimiz değerleri InsertParameters koleksiyonundaki ilgili parametrelere aktardık. Dilersek, parametre değerlerinin aktarımını ilgili kontroller &amp;uuml;zerinden doğrudanda ger&amp;ccedil;ekleştirebiliriz. Bunun i&amp;ccedil;in, InsertParameters koleksiyonunda Parameter nesneleri yerine, ilgil parametre değerini taşıyan kontrol&amp;uuml; temsil edecek ControlParameter nesneleri kullanılır.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:ObjectDataSource ID="ObjectDataSource1" Runat="server" TypeName="IsNesnesi"
SelectMethod="VerileriAl" InsertMethod="VeriGir"&amp;gt;
    &amp;lt;InsertParameters&amp;gt;
        &amp;lt;asp:ControlParameter ControlID="txtAd" PropertyName="Text" Name="ad"&amp;gt;&amp;lt;/asp:ControlParameter&amp;gt;
        &amp;lt;asp:ControlParameter ControlID="txtSoyad" PropertyName="Text" Name="soyad"&amp;gt;&amp;lt;/asp:ControlParameter&amp;gt;
        &amp;lt;asp:ControlParameter ControlID="txtMail" PropertyName="Text" Name="mail"&amp;gt;&amp;lt;/asp:ControlParameter&amp;gt;
        &amp;lt;asp:ControlParameter ControlID="txtDepartman" PropertyName="Text" Name="departman"&amp;gt;&amp;lt;/asp:ControlParameter&amp;gt;
        &amp;lt;asp:ControlParameter ControlID="txtGiris" PropertyName="Text" Type="DateTime" Name="giris"&amp;gt;&amp;lt;/asp:ControlParameter&amp;gt; 
    &amp;lt;/InsertParameters&amp;gt;
&amp;lt;/asp:ObjectDataSource&amp;gt;&lt;/pre&gt;
&lt;p&gt;Dikkat edecek olursanız, ControlID ile hangi kontrol&amp;uuml;n kullanacağı, PropertyName &amp;ouml;zelliği ilede bu kontrol&amp;uuml;n hangi &amp;ouml;zelliğinin değerinin alınacağı belirtilir. Name &amp;ouml;zelliği ise, iş nesnesindeki ilgili insert metodunda kullanılacak parametreyi işaret etmektedir ve iş nesnesindeki metod parametresindeki isim ile aynıdır. Bu durumda, insert işlevini ger&amp;ccedil;ekleştirebilmek i&amp;ccedil;in tek yapmamız gereken ObjectDataSource bileşenine ait Insert metodunu &amp;ccedil;ağırmak olacaktır. Insert metodu &amp;ccedil;alıştırıldığında ObjectDataSource bileşeni, InsertParameters koleksiyonunda belirtilen kontroller &amp;uuml;zerindeki değerleri alıp ilgili insert metoduna g&amp;ouml;ndermektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;void btnEkle_Click(object sender, EventArgs e)
{
    ObjectDataSource1.Insert();
}&lt;/pre&gt;
&lt;p&gt;Delete ve Update işlevleride Insert işlevine benzer şekilde ger&amp;ccedil;ekleştirilir. Bu kez, ObjectDataSource bileşeni i&amp;ccedil;in DeleteCommand ve UpdateCommand &amp;ouml;zellikleri bildirilir ve ilgili parametre koleksiyonları eklenir. Bu makalemizde kısaca ObjectDataSource bileşenini incelemeye &amp;ccedil;alıştık. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-09-14 12:00:00</pubDate>
  <slug>Asp-Net-2-0-ve-ObjectDataSource-Kontrolu-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet-20</tag>
    <tag>objectdatasource</tag>
  </tags>
  <categories>
    <category>Asp.Net 2.0</category>
  </categories>
</post>