<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Raspberry Pi'den Python ile Tweet Göndermek</title>
  <description>Geçtiğimiz sene yaz ayı boyunca Ruby programlama dilini öğrenmeye çalışmıştım. Ruby dilinde orta seviyelere kadar bilgimi ilerletebildim ancak bu yaz dönemini paslanmamak adına farklı bir uğraş ile geçirmeye karar verdim. Ruby'yi öğrenmeye başlama amaçlarımın başında çocuklara programlama dilini öğretmek geliyordu. Benzer şekilde Raspberry Pi'nin de bu amaçla kullanılabildiğini öğrendim. Özellikle Scratch dilini kullanarak çocukların robotlara bir şeyler yaptırabilmesi ve bu şekilde programlamayı öğrenmeleri harika. Pek tabi Raspberry Pi'yi özel yapan bir diğer neden de IoT(Internet of Things).</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2016/06/raspi_0.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;tiğimiz sene yaz ayı boyunca Ruby programlama dilini &amp;ouml;ğrenmeye &amp;ccedil;alışmıştım. Ruby dilinde orta seviyelere kadar bilgimi ilerletebildim ancak bu yaz d&amp;ouml;nemini paslanmamak adına farklı bir uğraş ile ge&amp;ccedil;irmeye karar verdim. Ruby'yi &amp;ouml;ğrenmeye başlama ama&amp;ccedil;larımın başında &amp;ccedil;ocuklara programlama dilini &amp;ouml;ğretmek&amp;nbsp;geliyordu. Benzer şekilde Raspberry Pi'nin de bu ama&amp;ccedil;la kullanılabildiğini &amp;ouml;ğrendim. &amp;Ouml;zellikle Scratch dilini kullanarak &amp;ccedil;ocukların robotlara bir şeyler yaptırabilmesi ve bu şekilde programlamayı &amp;ouml;ğrenmeleri harika. Pek tabi Raspberry Pi'yi &amp;ouml;zel yapan bir diğer neden de IoT(Internet of Things).&lt;/p&gt;
&lt;p&gt;Bunun &amp;uuml;zerine aldım Bruce' u yanıma her zamanki gibi b&amp;uuml;y&amp;uuml;k bir hevesle koyuldum yola. &amp;Ouml;nce bir &lt;strong&gt;Raspberry Pi 3 Model B&lt;/strong&gt;&amp;nbsp;aldım&lt;em&gt;(Sonrasında 7inch dokunmatik ekran, sıcaklık sens&amp;ouml;r&amp;uuml;, HDMI bağlantı kablosu, 40 GPIO kablosu, bir adet servo motor kontrolc&amp;uuml;s&amp;uuml; gibi par&amp;ccedil;aları da dahil ederek kredi kartlarımdan birini epeyce şişirdim)&lt;/em&gt;&amp;nbsp;Ancak sonradan &amp;ouml;ğrendim ki &lt;a href="http://www.robotistan.com" target="_blank"&gt;Robotistan&lt;/a&gt;&amp;nbsp;gibi sitelerde Raspberry Pi ile ilgili komple setler satılıyor. Yeni başlayacaklara tavsiyem bir set alarak ilerlemeleri.&lt;/p&gt;
&lt;h2&gt;Raspi Hakkında Kısa Bilgi&lt;/h2&gt;
&lt;p&gt;Raspberry Pi yaklaşık olarak kredi kartından&amp;nbsp;biraz daha b&amp;uuml;y&amp;uuml;k olan bir kart. Maliyeti olduk&amp;ccedil;a d&amp;uuml;ş&amp;uuml;k olan Raspberry Pi aslında microprocessor i&amp;ccedil;eren&lt;em&gt;(ki bu noktada MicroController i&amp;ccedil;eren Arduino'dan ayrılıyor)&lt;/em&gt;&amp;nbsp;bir bilgisayar olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Dolayısıyla onunla her şeyi yapabilirsiniz. Bir Web Server haline de getirebilir&lt;em&gt;(ki denedim ve apache2 &amp;uuml;zerinde php kodlaması yaptım)&lt;/em&gt;&amp;nbsp;sıcaklık sens&amp;ouml;r&amp;uuml;ne sahip bir kahve fincanını kumanda da edebilirsiniz. Yapabilecekleriniz hayal g&amp;uuml;c&amp;uuml;n&amp;uuml;z ile sınırlı diyebilirim.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;evre &amp;uuml;nitelerle&lt;em&gt;(monit&amp;ouml;r, kamera, GPIO-General Purpose Input Output ile bağlanabilen her t&amp;uuml;rl&amp;uuml; elektronik alet, klavye, mouse vb)&lt;/em&gt; olan bağlantıları sağlayacak arabirimler &amp;uuml;zerinde yer alan kart uygun işletim sistemi y&amp;uuml;klendiğinde mini bir bilgisayar haline gelmekte. Bu anlamda&amp;nbsp;&lt;strong&gt;Windows 10 IoT, Ubuntu Mate&lt;/strong&gt;&amp;nbsp;ve kendi orjinal işletim sistemi &lt;strong&gt;Raspbian&lt;/strong&gt;'ı kullanabiliriz.&amp;nbsp;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Kart ile ilişkili &amp;ccedil;ok fazla detaya girmeyeceğim nitekim yeni yeni &amp;ouml;ğreniyorum ama bu konuda epey bilgili olan &lt;a href="https://youtu.be/LfTrBhXo8vk" target="_blank"&gt;Recep Duman hocam ile yaptığımız youtube s&amp;ouml;yleşisini&lt;/a&gt; mutlaka izlemenizi &amp;ouml;neririm.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Kullandığım Raspberry Pi &amp;uuml;zerinde &lt;strong&gt;Ruby&lt;/strong&gt; standart olarak y&amp;uuml;kl&amp;uuml;. Buna ek olarak &lt;strong&gt;python&lt;/strong&gt;&amp;nbsp;diline ait ortam da&amp;nbsp;hazır.&amp;nbsp;&lt;strong&gt;Java,Mathematica, Scratch&lt;/strong&gt; de diğer diller arasında sayılabilirler. Her biri i&amp;ccedil;in g&amp;uuml;zel birer IDE'de gelmekte.&lt;/p&gt;
&lt;p&gt;Aslında amacım bir motoru &lt;strong&gt;Raspberry Pi&lt;/strong&gt; ile programlayıp evdeki &lt;strong&gt;Lego Technic&lt;/strong&gt;'ler den birisini &amp;ouml;nceden tayin ettiğim rota doğrultusunda, engellere &amp;ccedil;arpmayacak şekilde dolaştırabilmek. Ama tabii bu mertebelere&amp;nbsp;gelmeden &amp;ouml;nce bir programlama diline de hakim olmak gerekiyor.&amp;nbsp;Tercihimi &lt;strong&gt;python&lt;/strong&gt;'dan yana kullanıyorum. B&amp;ouml;ylece&amp;nbsp;yeni bir programlama dilini araştırıp deneme şansım da&amp;nbsp;olacak. Internetteki kaynaklardan ve aldığım bir ka&amp;ccedil; kitaptan kısa bir giriş turu ile değişkenleri, d&amp;ouml;ng&amp;uuml;leri, range, tuple, dictionary gibi nesne koleksiyonlarını, mod&amp;uuml;lleri, metod tanımlamalarını, kodlardaki girintilerin &amp;ouml;nemi vb kavramları hızlıca denedikten sonra kendimi bir anda Raspberry Pi organizasyonuna ait sitedeki tutorial' ları &amp;ccedil;alışırken buldum.&lt;/p&gt;
&lt;p&gt;İlk g&amp;ouml;z&amp;uuml;me kestirdiğim ise&amp;nbsp;&lt;strong&gt;Twitter API&lt;/strong&gt; sini kullanarak Tweet atmak oldu. Daha &amp;ouml;nceden &lt;strong&gt;C#&lt;/strong&gt;&amp;nbsp;ve &lt;strong&gt;Ruby &lt;/strong&gt;dillerini kullanarak denediğim bir &amp;ccedil;alışmaydı. Ancak şimdi ki deneyim daha eğlenceliydi diyebilirim. Bloğuma da dilim d&amp;ouml;nd&amp;uuml;ğ&amp;uuml;nce vakayı yazayım hangi yollardan ge&amp;ccedil;tiğimi sonradan bakınca hatırlayayım istedim. Şimdi maceramıza başlayabiliriz.&lt;/p&gt;
&lt;h2&gt;Genel Prensipler Aynı&lt;/h2&gt;
&lt;p&gt;Twitte API sini kullanmanın belli başlı prensipleri var. Bunlar aslında platform bağımsız kabul edebileceğimiz prensipler. İlk &amp;ouml;nce hangi platformda olursak olalım &lt;strong&gt;Twitter&lt;/strong&gt; gibi sosyal ağları kolay bir şekilde kullanabilmek i&amp;ccedil;in servis bazlı &amp;ccedil;alışan kullanımı kolay&amp;nbsp;&lt;strong&gt;API&lt;/strong&gt;'lere&amp;nbsp;ihtiyacımız var. Genelde &lt;strong&gt;REST&lt;/strong&gt; tabanlı tasarlanan bu servisleri &lt;strong&gt;python&lt;/strong&gt; tarafında &lt;strong&gt;Twython&lt;/strong&gt; isimli mod&amp;uuml;l&amp;uuml; kullanarak ele almak son derece kolay. Bir diğer &amp;ouml;nemli kuralda bu API'yi kullanabilecek yetkilere sahip olmamızın gerektiği. &lt;strong&gt;Twitter&lt;/strong&gt; tarafından baktığımızda bu kullanım i&amp;ccedil;in &lt;strong&gt;consumer_key&lt;/strong&gt;, &lt;strong&gt;consumer_secret&lt;/strong&gt;, &lt;strong&gt;access_token&lt;/strong&gt; ve &lt;strong&gt;access_token_secret&lt;/strong&gt; değerlerine ihtiyacımız bulunmakta. &lt;a href="https://apps.twitter.com/" target="_blank"&gt;Şu adresten kendinize bir application oluşturup gerekli bilgileri alabilirsiniz&lt;/a&gt;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Şunu belirtelim ki bir k&amp;uuml;t&amp;uuml;phane kullanmak zorunda değilsiniz. Pekala Twitter REST servisleri i&amp;ccedil;in gerekli GET,POST paketlerini kendiniz de kod i&amp;ccedil;inde hazırlayıp g&amp;ouml;nderebilirsiniz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2&gt;İlk adım twython mod&amp;uuml;l&amp;uuml;n&amp;uuml; y&amp;uuml;klemek&lt;/h2&gt;
&lt;p&gt;.Net d&amp;uuml;nyasında &lt;strong&gt;nuget&lt;/strong&gt; paketleri, ruby tarafında &lt;strong&gt;gem&lt;/strong&gt;'ler...&lt;strong&gt;Python&lt;/strong&gt; tarafında ise &lt;strong&gt;module&lt;/strong&gt; olarak adlandırılan k&amp;uuml;t&amp;uuml;phaneler s&amp;ouml;z konusu. &lt;strong&gt;Tweet&lt;/strong&gt; atmamızı kolaylaştıracak olan &lt;strong&gt;twython&lt;/strong&gt;&lt;em&gt;(ki adı twitter ve python un birleşimi ile elde edilmiş. &amp;Ccedil;ok hoş bir isim değil mi?)&lt;/em&gt; k&amp;uuml;t&amp;uuml;phanesini sistemimize y&amp;uuml;klemek i&amp;ccedil;in terminalden&amp;nbsp;aşağıdaki komutları sırasıyla &amp;ccedil;alıştırmamız gerekiyor.&lt;/p&gt;
&lt;p&gt;Burada ki &lt;strong&gt;sudo&lt;/strong&gt; komutunu &lt;strong&gt;pi&lt;/strong&gt; isimli varsayılan kullanıcının ilgili operasyonlar sırasında&amp;nbsp;&lt;strong&gt;Permission Denied&lt;/strong&gt; almaması i&amp;ccedil;in kullanılmakta. &lt;strong&gt;apt-get&lt;/strong&gt; ile tahmin edeceğiniz &amp;uuml;zere sistem g&amp;uuml;ncellemesi ve yeni program y&amp;uuml;klemeleri gibi işlemleri ger&amp;ccedil;ekleştirmekteyiz. &lt;strong&gt;python&lt;/strong&gt; tarafına ilgili k&amp;uuml;t&amp;uuml;phaneyi y&amp;uuml;kleyecek asıl komut ise &lt;strong&gt;pip&lt;/strong&gt; &lt;strong&gt;install&lt;/strong&gt;. Son satır ile &lt;strong&gt;twython&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesini sisteme y&amp;uuml;klemiş bulunuyoruz.&lt;/p&gt;
&lt;p&gt;sudo apt-get update&lt;br /&gt;sudo apt-get upgrade&lt;br /&gt;sudo apt-get install python-setuptools&lt;br /&gt;sudo easy_install pip&lt;br /&gt;sudo pip install twython&lt;/p&gt;
&lt;h2&gt;Azcık Kod&lt;/h2&gt;
&lt;p&gt;İlgili k&amp;uuml;t&amp;uuml;phane y&amp;uuml;klendiğine g&amp;ouml;re artık gerekli kodlarımızı yazmaya başlayabiliriz.&amp;nbsp;Uygulama iki kod&amp;nbsp;dosyasından oluşmakta. &lt;strong&gt;py&lt;/strong&gt; uzantılı olarak kaydedilecek dosyalardan ilkinde &lt;strong&gt;consumer&lt;/strong&gt; ve &lt;strong&gt;access&lt;/strong&gt; bilgilerine ait değişkenleri tutacağız. Bunu bir nevi konfigurasyon i&amp;ccedil;eriği gibi de d&amp;uuml;ş&amp;uuml;nebiliriz&lt;em&gt;(Bu arada kodlar i&amp;ccedil;in Python 2 IDLE yi kullandığımı belirtmek isterim. Nitekim biraz sonra değineceğimiz twython k&amp;uuml;t&amp;uuml;phanesini python 3.4.2de kullanamadım. Ama işin peşindeyim)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;auth.py i&amp;ccedil;eriği&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;consumer_key="..."
consumer_secret="..."
access_token="..."
access_token_secret="..."&lt;/pre&gt;
&lt;p&gt;Tabii ki siz ... yazan kısımlara Twitter'ın sizin i&amp;ccedil;in &amp;uuml;rettiği değerleri girmelisiniz.&lt;/p&gt;
&lt;p&gt;İkinci dosyamızda&lt;em&gt;(twitter.py olarak kaydedebiliriz)&lt;/em&gt; ise aşağıdaki satırlara yer vereceğiz.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;from twython import Twython
from auth import(
consumer_key,
consumer_secret,
access_token,
access_token_secret
)

def send_tweet(message):
	twitter=Twython(
	consumer_key,
	consumer_secret,
	access_token,
	access_token_secret
	)
	twitter.update_status(status=my_message)
	print("\'%s\' seklinde mesaj gonderildi" % message)

my_message="Bu mesaj Raspi'den python kodu ile gonderilmistir"
send_tweet(my_message)&lt;/pre&gt;
&lt;p&gt;İlk iki satırda koda enjekte ettiğimiz tip ve değişkenler olduğunu d&amp;uuml;ş&amp;uuml;nebiliriz. &lt;strong&gt;Twython&lt;/strong&gt; nesnesini oluşturabilmek i&amp;ccedil;in ilgili tipi az &amp;ouml;nce y&amp;uuml;klediğimiz mod&amp;uuml;l i&amp;ccedil;inden &lt;strong&gt;import&lt;/strong&gt; etmekteyiz. Buna ek olarak aynı klas&amp;ouml;rde yer alan &lt;strong&gt;auth.py&lt;/strong&gt; dosyasından da &lt;strong&gt;consumer_key&lt;/strong&gt;,&lt;strong&gt;consumer_secret&lt;/strong&gt;,&lt;strong&gt;access_token&lt;/strong&gt; ve &lt;strong&gt;access_token_secret&lt;/strong&gt; isimli string değişkenleri koda alıyoruz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;send_tweet&lt;/strong&gt; bir metod tahmin edeceğiniz &amp;uuml;zere. &lt;strong&gt;Ruby&lt;/strong&gt;'deki gibi &lt;strong&gt;def&lt;/strong&gt; anahtar kelimesi ile tanımlanan fonksiyon &lt;strong&gt;:&lt;/strong&gt; işareti ile sonlanıyor&lt;em&gt;(aslında for, if gibi kod bloğuna sahip olabilecek ifadeler hep : kullanıyor)&lt;/em&gt; Sonrasında &amp;ouml;nemli olan konu ise metod i&amp;ccedil;erisindeki kod satırlarının girintili yazılması gerekliliği. Eğer b&amp;ouml;yle yapmazsak kodu kontrol ettirdiğimizde&lt;em&gt;(Alt+X)&lt;/em&gt; Invalid Syntax hatası alırız. Bu arada yorumlayıcı metodun bittiğini nasıl anlıyor derseniz;orada boş bir satır var ya...&lt;/p&gt;
&lt;p&gt;Koda import ettiğimiz değişkenler &lt;strong&gt;twitter&lt;/strong&gt; isimli nesnenin oluşturulması sırasında&lt;em&gt;(şimdilik benim yapıcı metod-constructor olarak d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m yerde)&lt;/em&gt; kullanılıyor. Metoda parametre olarak gelen &lt;strong&gt;message&lt;/strong&gt; isimli değişken i&amp;ccedil;eriği de &lt;strong&gt;update_status&lt;/strong&gt; isimli fonksiyon kullanılarak &lt;strong&gt;twitter&lt;/strong&gt;'a g&amp;ouml;nderiliyor. Son olarak &lt;strong&gt;print&lt;/strong&gt; fonksiyonunu ile&amp;nbsp;komut satırına bir bilgi basıyoruz. Sonu&amp;ccedil;lar mı?&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/06/twython_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Burada &lt;strong&gt;%&lt;/strong&gt; kullanımını bir t&amp;uuml;rl&amp;uuml; beceremediğimi fark etmişsinizdir :D O y&amp;uuml;zden arka arkaya bir ka&amp;ccedil; tweet gitmiş bulundu.&amp;nbsp;Ama sonu&amp;ccedil;lar ilk g&amp;uuml;n i&amp;ccedil;in olduk&amp;ccedil;a tatmin ediciydi. Kredi kartı b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;ndeki o bilgisayardan, python kodları ile harici bir k&amp;uuml;t&amp;uuml;phane kullanarak tweet atmayı başarabildim. Demek ki bir robotu Raspi ile kullanmaya başladığımda, robotun tweet atmasını artık sağlayabilirim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/06/twython_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Pek tabii mod&amp;uuml;l i&amp;ccedil;erisinde bir &amp;ccedil;ok fonksiyonellik bulunmakta. &amp;Ouml;rneğin timeline'ı, kendi tweet'lerimizi g&amp;ouml;rebilir, resim g&amp;ouml;nderebilir ve daha pek &amp;ccedil;ok işlemi ger&amp;ccedil;ekleştirebiliriz. Sonu&amp;ccedil;ta &lt;strong&gt;Twitter API&lt;/strong&gt;'sini kullanabileceğiniz k&amp;uuml;t&amp;uuml;phane elinizin altında. Bunları nasıl yapabileceğinizi g&amp;ouml;rmek i&amp;ccedil;in &lt;a href="https://www.raspberrypi.org/learning/getting-started-with-the-twitter-api/worksheet/" target="_blank"&gt;şu adresteki tutorial&lt;/a&gt;'ı aynen benim gibi adım adım yapmanızı &amp;ouml;neririm. Ben biraz farklı olarak metod kullandım.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Umarım eğlenceli bir yazı olmuştur. Raspi maceralarımıza devam edeceğiz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-06-14 06:00:00</pubDate>
  <slug>raspberry-pi-den-python-ile-tweet-gondermek</slug>
  <tags>
    <tag>python</tag>
    <tag>raspberry-pi</tag>
    <tag>twitter-api</tag>
  </tags>
  <categories>
    <category>python</category>
    <category>Raspberry Pi</category>
  </categories>
</post>