<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>.Net RIA Servisleri Nedir?</title>
  <description>Son yıllarda bildiğiniz üzere Servis Tabanlı Uygulamalar(Service Oriented Applications) hayatımızda oldukça fazla yer kaplamaya başladı. Microsoft cephesinden olaya baktığımızda, en büyük sıçramanın Windows Communication Foundation ile .Net Framework 3.0' da yaşandığını söyleyebiliriz. WCF' in getirdiği servis bazlı uygulama geliştirme yaklaşımı, .Net Framework 3.5 ile dahada zenginleşti. Eklenen Web programlama modeli(Web Programming Model) özellikleri sayesinde, REST(Representational State Transfer) bazlı servislerin geliştirilebilmesinin yolu açıldı. Sonrasında Workflow Foundation ile iç içe geçen WCF özellikleri sayesinde, iş akışlarının farklı domainler ile haberleşebilmesi veya servis gibi sunulabilmesi olanaklı hale geldi. Derken .Net Framework 3.5 Service Pack 1 ile hayatımıza başka bir kavram daha girdi. Ado.Net Data Services.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar&lt;/p&gt;
&lt;p&gt;Son yıllarda bildiğiniz &amp;uuml;zere &lt;strong&gt;Servis Tabanlı Uygulamalar(Service Oriented Applications)&lt;/strong&gt;&amp;nbsp;hayatımızda olduk&amp;ccedil;a fazla yer kaplamaya başladı. &lt;strong&gt;Microsoft &lt;/strong&gt;cephesinden olaya baktığımızda, en b&amp;uuml;y&amp;uuml;k sı&amp;ccedil;ramanın &lt;strong&gt;Windows Communication Foundation &lt;/strong&gt;ile &lt;strong&gt;.Net Framework 3.0' &lt;/strong&gt;da yaşandığını s&amp;ouml;yleyebiliriz. &lt;strong&gt;WCF&lt;/strong&gt;' in getirdiği servis bazlı uygulama geliştirme yaklaşımı, &lt;strong&gt;.Net Framework 3.5 &lt;/strong&gt;ile dahada zenginleşti. Eklenen &lt;strong&gt;Web programlama modeli(Web Programming Model)&lt;/strong&gt;&amp;nbsp;&amp;ouml;zellikleri sayesinde, &lt;strong&gt;REST(Representational State Transfer)&lt;/strong&gt; bazlı servislerin geliştirilebilmesinin yolu a&amp;ccedil;ıldı. Sonrasında &lt;strong&gt;Workflow Foundation&lt;/strong&gt; ile i&amp;ccedil; i&amp;ccedil;e ge&amp;ccedil;en &lt;strong&gt;WCF&lt;/strong&gt; &amp;ouml;zellikleri sayesinde, iş akışlarının farklı domainler ile haberleşebilmesi veya servis gibi sunulabilmesi olanaklı hale geldi. Derken &lt;strong&gt;.Net Framework 3.5 Service Pack 1 &lt;/strong&gt;ile hayatımıza başka bir kavram daha girdi. &lt;strong&gt;Ado.Net Data Services&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;Bu model ile, &lt;strong&gt;Ado.Net Entity Framework&lt;/strong&gt; veya &lt;strong&gt;LINQ(Language&amp;nbsp;INtegrated Query)&lt;/strong&gt;&amp;nbsp;bazlı sağlayıcılar &amp;uuml;zerinden verinin REST tabanlı olarak sunulabilmesi m&amp;uuml;mk&amp;uuml;n hale geldi.Tabi bu ge&amp;ccedil;işler sırasında &lt;strong&gt;Client Application Services&lt;/strong&gt; ve &lt;strong&gt;Azure&lt;/strong&gt; gibi kavramlar ile geliştiricinin hayatını kolaylaştıran &lt;strong&gt;REST Starter Kit&lt;/strong&gt; gibi pek &amp;ccedil;ok yeni fikir ve vizyon ile karşılaştık. Ama &lt;strong&gt;Microsoft&lt;/strong&gt; cephesindeki yenilikler t&amp;uuml;m hızıyla s&amp;uuml;rmeye devam etti, ediyor, edecek...&lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&amp;nbsp;Bir s&amp;uuml;redir &lt;strong&gt;.Net Framework 4.0 &lt;/strong&gt;ve bu etapta &lt;strong&gt;WF 4.0&amp;amp;WCF 4.0&lt;/strong&gt; yeniliklerini incelemekteyim. Ancak arada ka&amp;ccedil;ırdığım &amp;ouml;nemli bir konu var. &lt;strong&gt;.Net RIA(Rich Internet Application) Services&lt;/strong&gt; ve &lt;strong&gt;Silverlight&lt;/strong&gt;&amp;nbsp;&lt;img title="Embarassed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-embarassed.gif" alt="Embarassed" border="0" /&gt; Dolayısıyla bu yazımda sizlere, .Net RIA Servisleri ile ilişkili &amp;ouml;ğrendiklerimi ve bilgilerimi aktarmaya &amp;ccedil;alışıyor olacağım.&lt;/p&gt;
&lt;p&gt;En nihayetinde, &lt;strong&gt;Silverlight&lt;/strong&gt; sayesinde istemci tarafında &amp;ccedil;ok zengin i&amp;ccedil;eriklere sahip olabilecek ve tarayıcı tabanlı(ve hatta Silverlight 3.0 sonrası masa&amp;uuml;st&amp;uuml;...) uygulamaların geliştirilmesi m&amp;uuml;mk&amp;uuml;n. Ancak Silverlight gibi bir uygulama geliştirme modelinde, istemcinin sunucu &amp;uuml;zerinde yer alan bazı veri kaynaklarına erişmesi i&amp;ccedil;in, servislerin kullanılmasıda &lt;span style="text-decoration: underline;"&gt;ka&amp;ccedil;ınılmaz&lt;/span&gt; bir ger&amp;ccedil;ek. &lt;em&gt;(Nedenini biraz sonra daha iyi anlatabileceğim.) &lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle&lt;strong&gt; Silverlight 3.0&lt;/strong&gt; ve &lt;strong&gt;.Net RIA Service&lt;/strong&gt; &amp;ccedil;ıkana kadar, geliştiricilerin sunucu verilerine erişmesi i&amp;ccedil;in biraz daha fazla kodlama yapması gerekmektedir. Aslında olaya sadece Silverlight değil, &lt;strong&gt;Asp.Net Ajax&lt;/strong&gt; gibi istemciler a&amp;ccedil;ısından bakıldığında da, benzer kodlama s&amp;uuml;re&amp;ccedil;leri s&amp;ouml;z konusudur. Bu tip &lt;strong&gt;RIA&lt;/strong&gt; uygulamalarını, &lt;strong&gt;n-tier&lt;/strong&gt; tarzı mimariler ile geliştirmek istediğimizden, aslında &lt;strong&gt;sunum(Presentation)&lt;/strong&gt; katmanının standart &lt;strong&gt;Asp.Net&lt;/strong&gt; modelinden farklı olarak, tamamen istemci tarafına yıkıldığı olduk&amp;ccedil;a &amp;ouml;nemli bir noktadır. Sanıyorum burada biraz kafaları karıştırdım. &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;Gelin olayı standart &lt;strong&gt;n-tier&lt;/strong&gt; modelin Asp.Net uygulamalarındaki genel kullanımı ile analiz etmeye başlayalım. Aşağıdaki şekilde bu model vurgulanmaya &amp;ccedil;alışılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f5%2fblg14_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Klasik olarak bir &lt;strong&gt;Asp.Net Web&lt;/strong&gt; uygulamasında&lt;em&gt;(&amp;ccedil;oğunlukla Asp.Net Ajax i&amp;ccedil;inde benzer durum s&amp;ouml;z konusudur),&lt;/em&gt; katmanların tamamı sunucu &amp;uuml;zerinde yer alır. &lt;strong&gt;Uygulama mantığı(Application Logic-Business Layer), veriye erişim katmanı(Data Access Layer)&lt;/strong&gt;&amp;nbsp;ve istemcinin g&amp;ouml;receği HTML &amp;ccedil;ıktının &amp;uuml;retileceği &lt;strong&gt;sunum katmanı(Presentation Layer)&lt;/strong&gt;. Bunlara ek olarak web uygulaması i&amp;ccedil;erisinde, veri erişim katmanından dış servisler yardımıyla farklı kaynaklara gidilebilir veya uygulamanın kendisinin farklı alanlardaki programlara sunacağı bir takım hizmetler/servisler olabilir. Olduk&amp;ccedil;a basit ve kullanışlı.&lt;/p&gt;
&lt;p&gt;Ancak, g&amp;uuml;n&amp;uuml;m&amp;uuml;z uygulamalarında ve &amp;ouml;zellikle son yıllarda &lt;strong&gt;kullanıcı deneyimini(User Experience)&lt;/strong&gt;&amp;nbsp;zenginleştirecek şekilde yapılan bir &amp;ccedil;ok atılım vardır. &lt;em&gt;(Bu etkileşim &amp;ouml;zellikle web&amp;nbsp;tabanlı mimarilerde kendini daha da &amp;ouml;n plana &amp;ccedil;ıkarmaktayken, geliştirme s&amp;uuml;re&amp;ccedil;lerinin standart masa&amp;uuml;st&amp;uuml; uygulamalara nazaran daha karmaşık ve zor olduğuda s&amp;ouml;ylenebilir.)&lt;/em&gt;&amp;nbsp;Bu nedenle tarayıcı uygulamalar &amp;uuml;zerindeki kullanıcı deneyimini zenginleştirecek &lt;strong&gt;Silverlight&lt;/strong&gt; gibi geliştirme ortamları s&amp;ouml;z konusudur. Hal b&amp;ouml;yle olunca yukarıdaki şekilde &amp;ccedil;izdiğimiz katmanlı model biraz daha değişim g&amp;ouml;stermektedir. Aşağıdaki şekilde olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f5%2fblg14_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Zengin internet uygulamalarında, sunum katmanı/mantığı istemci tarafına yıkılmaktadır&lt;em&gt;(Hatırlayalım, Silverlight uygulamalarının &amp;ccedil;alıştırılması i&amp;ccedil;in istemci tarafında minik bir framework, add-in tarzında y&amp;uuml;klenmiş olmalıdır).&lt;/em&gt; Bu da kullanıcı etkileşimini dahada &amp;uuml;st seviyeye &amp;ccedil;ıkartmak anlamına gelmektedir. Ama doğal olarak&lt;strong&gt; n-tier&lt;/strong&gt; modelde sunum katmanı ile uygulama mantığı arasına internet ağının girmesi gerekmektedir. Buna g&amp;ouml;re &lt;strong&gt;RIA&lt;/strong&gt;' ları basit bir istemci uygulamadan ziyade, sunucu bileşenlerinide i&amp;ccedil;eren birer &lt;strong&gt;Internet uygulaması&lt;/strong&gt; olarak d&amp;uuml;ş&amp;uuml;nmek gerekmektedir. Hal b&amp;ouml;yle olunca, sunucu tarafındaki veri kaynaklarının sunum tarafında kullanılabilmesinde servisler &amp;ouml;nemli bir rol &amp;uuml;stlenmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;.Net RIA Servislerine&lt;/strong&gt; kadarki zaman diliminde, geliştiricilerin bu anlamda d&amp;uuml;ş&amp;uuml;nmesi gereken pek &amp;ccedil;ok kıstas vardır. Herşeyden &amp;ouml;nce veriyi istemci tarafına taşıyacak servisin ve metodlarının yazılması gerekir. Ayrıca istemci tarafında, bu servisin kullanılabilmesi i&amp;ccedil;in gerekli &lt;strong&gt;proxy&lt;/strong&gt; &amp;uuml;retiminin yapılması şarttır. &lt;strong&gt;Silverlight&lt;/strong&gt; tarafında kolay olan proxy &amp;uuml;retimi, &lt;strong&gt;Asp.Net Ajax&lt;/strong&gt; tarafı d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde ek &lt;strong&gt;javascript&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phaneleri anlamına gelmektedir. Yinede, sunucu tarafında &lt;strong&gt;Ado.Net Entity Framework&lt;/strong&gt; veya &lt;strong&gt;LINQ to SQL&lt;/strong&gt; gibi modelleri kullanabileceğimizden bu zahmete girmeye değmektedir. Microsoft'un s&amp;ouml;z konusu servislerin, &lt;strong&gt;n-tier&lt;/strong&gt; i&amp;ccedil;erisindeki uyarlanışını daha da kolaylaştırmak adına &lt;strong&gt;.Net RIA Servislerini&lt;/strong&gt; geliştirdiğini s&amp;ouml;yleyebiliriz. .Net RIA Servisleri kavramsal olarak iki ana par&amp;ccedil;adan oluşur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f5%2fblg14_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;DataService&lt;/strong&gt; sınıfı aslında, temel &lt;strong&gt;CRUD(CreateRetrieveUpdateDelete)&lt;/strong&gt; işlemlerini ve &amp;ouml;zel bir takım operasyonları i&amp;ccedil;erebilir. Bunlara ek olarak &lt;strong&gt;doğrulama(Validation), yetkilendirme(Authorization)&lt;/strong&gt; gibi kısıtlarıda ele alabilir. Bu nedenle &lt;strong&gt;DataService&lt;/strong&gt; sınıfının, veri i&amp;ccedil;in ele alınacak iş mantığını i&amp;ccedil;erdiğini s&amp;ouml;yleyebiliriz. DataService sınıfı genel olarak arka planda, &lt;strong&gt;hazır olan(built-in)&lt;/strong&gt; veri modellerini kullanır. Yani &lt;strong&gt;Ado.Net Entity Framework&lt;/strong&gt; veya &lt;strong&gt;LINQ to SQL&lt;/strong&gt; burada g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Elbetteki diğer veri kaynaklarıda gerek servisler, gerek &amp;ouml;zel kodlamalar yardımıyla kullanılabilir.&lt;/p&gt;
&lt;p&gt;İkinci b&amp;ouml;l&amp;uuml;mde yer alan&amp;nbsp;&lt;strong&gt;DataContext&lt;/strong&gt; sınıfı ise, servislerin istemciye sunduğu verilerin, tip bazındaki karşılıklarını i&amp;ccedil;ermektedir. Bu nedenle istemci tarafında, verilerin y&amp;uuml;klenmesi, &amp;uuml;zerinde yapılan değişikliklerin tekrardan sunucu tarafına g&amp;ouml;nderilmesi i&amp;ccedil;in gerekli kodlamaları ve metodlarıda hazır olarak i&amp;ccedil;ermektedir. Tahmin edeceğiniz &amp;uuml;zere, &lt;strong&gt;.Net RIA Servislerinin Visual Studio 2008&lt;/strong&gt; ortamında geliştirilmesi son derece kolay ve basittir. &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Son olarak .Net RIA Servisleri ile ilişkili olaraktan merak edilen sorulara cevap bulabileceğiniz ve gerekli y&amp;uuml;klemeleri edinebileceğini&amp;nbsp;bir &lt;a title=".NET RIA Services FAQ" href="http://silverlight.net/forums/t/80529.aspx" target="_blank"&gt;internet adresini&lt;/a&gt; paylaşmak isterim.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Bu yazımda sizlere .Net RIA Servislerini, anladığım kadarıyla&amp;nbsp;anlatmaya &amp;ccedil;alıştım. Bir sonraki yazımızda basit bir &amp;ouml;rnek geliştirerek Merhaba &lt;strong&gt;.Net RIA Servisi&lt;/strong&gt; diyeceğiz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2009-05-08 13:41:00</pubDate>
  <slug>Net-RIA-Servisleri-Nedir</slug>
  <tags>
    <tag>net-ria-services</tag>
    <tag>silverlight</tag>
  </tags>
  <categories>
    <category>.Net RIA Services</category>
  </categories>
</post>