<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Vue için Bebek Adımları</title>
  <description>Yazılım işine girdiğimden beri en çok zorlandığım konu Frontend tarafta kodlama yapmak. Ne yazık ki sadece Backend tarafta kalmak lüksümüz de pek bulunmuyor. Örneğin hali hazırda çalışmakta olduğum firmada yeni nesil birçok uygulama önyüz tarafında çeşitli Javascript çatıları(Framework) kullanılıyor. Pratikte bakınca oldukça iyi bir kurgu aslında. Önyüzü Vue, React vb yapılarla geliştirip, asıl iş kuralları için arka planda yer alan .Net Core Web API servislerine gelmek. C# ve .Net Core tarafına aşina olduğum için arka planı rahatça kodluyorum, önyüz tarafında ise önceden geliştirilmiş sayfalara bakarak bir şeyler yapabiliyorum. Yani işin özü Vue.Js çatısının temellerinde sorunlarım var. Bu amaçla SkyNet'e uğradığım bir gün oturdum ekran başına en basit adımlarıyla bu işi nasıl öğrenirim bir kurcalayayım dedim.</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/41/vue_manga.png" alt="" align="right" /&gt;Yazılım işine girdiğimden beri en &amp;ccedil;ok zorlandığım konu Frontend tarafında kodlama yapmak. Ne yazık ki sadece Backend tarafta kalma l&amp;uuml;ks&amp;uuml;m&amp;uuml;z de pek bulunmuyor. &amp;Ouml;rneğin hali hazırda &amp;ccedil;alışmakta olduğum firmada yeni nesil bir&amp;ccedil;ok uygulama &amp;ouml;ny&amp;uuml;z tarafında &amp;ccedil;eşitli Javascript &amp;ccedil;atıları&lt;em&gt;(Framework)&lt;/em&gt;&amp;nbsp;kullanıyor.&lt;/p&gt;
&lt;p&gt;Pratikte bakınca olduk&amp;ccedil;a iyi bir kurgu aslında. &amp;Ouml;ny&amp;uuml;z&amp;uuml; Vue, React, Angular vb yapılarla geliştirip, asıl iş kuralları i&amp;ccedil;in arka planda yer alan .Net Core Web API servislerine gelmek.&amp;nbsp;C# ve .Net Core tarafına aşina olduğum i&amp;ccedil;in arka planı rahat&amp;ccedil;a kodluyorum, &amp;ouml;ny&amp;uuml;z tarafında ise &amp;ouml;nceden geliştirilmiş sayfalara bakarak bir şeyler yapabiliyorum. Yani işin &amp;ouml;z&amp;uuml; Vue &amp;ccedil;atısının temellerinde sorunlarım var. Bu ama&amp;ccedil;la SkyNet'e uğradığım bir g&amp;uuml;n oturdum ekran başına en basit adımlarıyla bu işi nasıl &amp;ouml;ğrenirim bir kurcalayayım dedim.&lt;/p&gt;
&lt;p&gt;Tabii &amp;ouml;ncesinde Vue.Js ile ilgili bir bilgi vermek de lazım. A&amp;ccedil;ık kaynak olarak&amp;nbsp;sunulan ilk Commit'i 2013 ve ilk Release'i de 2014 olan Vue, temel olarak Singe Page Application geliştirmek i&amp;ccedil;in Model View ViewModel&lt;em&gt;(MVVM)&lt;/em&gt; desenini baz alan bir Javascript Framework olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. İşi g&amp;uuml;c&amp;uuml; aray&amp;uuml;z geliştirilmesini MVVM'in nimetlerinden yararlanarak kolaylaştırmak. Reactive olması, HTML'i direktifler ile genişletmesi ve DOM elementleri ile veriyi, olayları kolayca bağlaması &amp;ouml;ne &amp;ccedil;ıkan &amp;ouml;zellikleri arasında sayılabilir.&lt;/p&gt;
&lt;p&gt;Bu arada bug&amp;uuml;ne kadar &amp;ccedil;ıkan s&amp;uuml;r&amp;uuml;mlere Manga dizilerinin adları verilmiş. Son s&amp;uuml;r&amp;uuml;m One Piece, 2016 - Ghost in the Shell, 2015 - Dragon Ball, 2014 - Blade Runner, Cowboy Bebop ve Animatrix gibi isimlendirmeler kullanılmış&lt;em&gt;(Peki Animatrix ile başlayan bu Manga adlarının alfabetik sırada gittiğini biliyor muydunuz?)&lt;/em&gt; İşin magazin kısmı bir yana kalsın gelin biz basit adımlarla Vue'nun temel kabiliyetlerini tanımaya &amp;ccedil;alışalım. Bunun i&amp;ccedil;in Javascript k&amp;uuml;t&amp;uuml;phaneleri veya CLI ara&amp;ccedil;larını indirmemize de gerek yok.&amp;nbsp;Temel konular i&amp;ccedil;in Vue'nun CDN&lt;em&gt;(Content Delivery Network)&lt;/em&gt; kaynağından&lt;em&gt;(&lt;a href="https://unpkg.com/vue"&gt;https://unpkg.com/vue&lt;/a&gt;)&lt;/em&gt; yararlanmamız yeterli.&lt;/p&gt;
&lt;p&gt;İlk adımımızda onun ne kadar duyarlı olduğunu&lt;em&gt;(Reaktif)&lt;/em&gt; anlamaya &amp;ccedil;alışalım&lt;em&gt;(Yorum satırlarını okumayı ihmal etmeyin)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;touch vue_is_reactive.html&lt;/pre&gt;
&lt;p&gt;Kodlarımızı aşağıdaki gibi geliştirelim.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;

&amp;lt;head&amp;gt;
    &amp;lt;title&amp;gt;VueJs Bebek Adımları - 01&amp;lt;/title&amp;gt;
    &amp;lt;!-- CDN adresinden Vue.js'i kullanacağımızı s&amp;ouml;yledik--&amp;gt;
    &amp;lt;script src="https://unpkg.com/vue"&amp;gt;&amp;lt;/script&amp;gt;
&amp;lt;/head&amp;gt;

&amp;lt;body&amp;gt;
    &amp;lt;!--
        Vue'da DOM nesneleri ile veri(data) birbirine bağlıdır ve s&amp;uuml;rekli etkileşim halindedir.
    --&amp;gt;

    &amp;lt;div id="appComponent" style="text-align:center;"&amp;gt;
        &amp;lt;h1&amp;gt;Şu An &amp;Ccedil;alıştığım Kitap&amp;lt;/h1&amp;gt;
        &amp;lt;p&amp;gt;{{bookName}}&amp;lt;/p&amp;gt;
        &amp;lt;p&amp;gt;{{startDate}}&amp;lt;/p&amp;gt;
        &amp;lt;!-- Javascript expression i&amp;ccedil;erisinde aşağıdaki gibi fonksiyon &amp;ccedil;ağrıları da yapılabilir--&amp;gt;
        &amp;lt;p&amp;gt;{{bookName.split('').reverse().join('')}}&amp;lt;/p&amp;gt;
    &amp;lt;/div&amp;gt;


    &amp;lt;script type="text/javascript"&amp;gt;
        /*
            app bir Vue uygulama nesnesidir. 
            Parametre olarak &amp;ccedil;eşitli se&amp;ccedil;enekleri ihtiva eden bir JSON değişkeni alır.
            el(element) niteliği uygulama nesnesini appComponent ismiyle div elementine bağlar .
            Vue yapıcı fonksiyonundaki JSON nesnesinin data &amp;ouml;zelliği i&amp;ccedil;erisinde koyduğumuz alanlar, DOM i&amp;ccedil;erisinde {{ }} ifadelerinin olduğu yerlerde kullanılır.
            Mustache stilindeki {{ }} yerler javascript expression olarak adlandırılır. Vue bu ifadeleri g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;nde, data &amp;ouml;zelliğindeki karşılıkları ile değiştirir.
            Vue'nun nesne verileri(instance data) HTML'de referans edildikleri heryere bağlanır. 
            Bunu daha iyi anlamak i&amp;ccedil;in HTML sayfasını a&amp;ccedil;tıktan sonra F12 ile Developer b&amp;ouml;lgesine ge&amp;ccedil;in ve Console'da 
                app.bookName="Learning Vue"
            yazın. HTML i&amp;ccedil;eriğinde bookName olan heryerin anında değiştiğini g&amp;ouml;receksiniz. İşte bu Reactive olma &amp;ouml;zelliğidir.
        */
        var app = new Vue(
            {
                el: '#appComponent',
                data: {
                    bookName: "Rust Programming Cookbook",
                    startDate: "Today"
                }
            }
        )

    &amp;lt;/script&amp;gt;
&amp;lt;/body&amp;gt;

&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Oluşturduğumuz HTML sayfasını bir tarayıcıda a&amp;ccedil;tıktan sonra &amp;ouml;zellikle F12 ile Debug moduna ge&amp;ccedil;ip Vue uygulama nesnesi olan app değişkeninin data &amp;ouml;zelliğindeki bookName i&amp;ccedil;eriğini Console &amp;uuml;st&amp;uuml;nden değiştirmeyi deneyin. Bu değişiklik sayfada bookName'i kullanan t&amp;uuml;m elementlere yansıyacaktır. Buradan Vue ana bileşeninin&lt;em&gt;(Component&lt;/em&gt;) DOM ile etkileşim halinde olduğunu s&amp;ouml;yleyebiliriz. İşte bu reaktif olmanın bir sonucudur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/41/Screenshot_01.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve F12 - Console sonrası.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/41/Screenshot_02.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İkinci adımımızda Attribute Binding konusunu ele alacağız. HTML elementlerindeki nitelikleri&lt;em&gt;(&amp;Ouml;rneğin img elementinin src niteliğini)&lt;/em&gt; direktifler&lt;em&gt;(&amp;Ouml;rnekte v-bind)&lt;/em&gt; ile Vue verisine&lt;em&gt;(data &amp;ouml;zelliğinin değerleri)&lt;/em&gt; nasıl bağlayacağımızı g&amp;ouml;receğiz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;touch vue_attribute_binding.html&lt;/pre&gt;
&lt;p&gt;HTML sayfa kodlarını aşağıdaki gibi yazarak devam edelim&lt;em&gt;.&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;

&amp;lt;head&amp;gt;
    &amp;lt;title&amp;gt;VueJs Bebek Adımları - 02&amp;lt;/title&amp;gt;
    &amp;lt;!-- CDN adresinden Vue.js'i kullanacağımızı s&amp;ouml;yledik--&amp;gt;
    &amp;lt;script src="https://unpkg.com/vue"&amp;gt;&amp;lt;/script&amp;gt;
&amp;lt;/head&amp;gt;

&amp;lt;body&amp;gt;
    &amp;lt;!--
        HTML elementlerinin niteliklerini(attribute)'de veriye bağlamak isteyebiliriz.
        &amp;Ouml;rneğin aşağıdaki HTML yapısından yer alan src ve altText niteliklerini, data nesnesinin sırasıyla coverPhoto ve alternativeText alanlarına bağlamak istediğimizi d&amp;uuml;ş&amp;uuml;nelim.
        Bu durumda v-bind isimli y&amp;ouml;nergeyi(directive) kullanmamız gerekir.
        01 nolu &amp;ouml;rnekte olduğu gibi bu HTML'i a&amp;ccedil;tıktan sonra tarayıcının Console penceresinde
            app.coverPhoto="./images/book_2.jpeg"
        yazın. Fotoğrafın hemen değiştiğini g&amp;ouml;receksiniz. Yani v-bind direktifi ile bağlanan yerlerde veri değişikliğini anında yansıtır.
    --&amp;gt;

    &amp;lt;div id="app" style="text-align:center;"&amp;gt;

        &amp;lt;div id="book"&amp;gt;
            &amp;lt;h1&amp;gt;{{title}}&amp;lt;/h1&amp;gt;
            &amp;lt;p&amp;gt;{{description}}&amp;lt;/p&amp;gt;
        &amp;lt;/div&amp;gt;

        &amp;lt;div id="book-photo"&amp;gt;
            &amp;lt;!-- 
                v-bind direktifini : operat&amp;ouml;r&amp;uuml; ile daha kısa şekilde de kullanabiliriz.
                Yani v-bind:src yerine :src yazılabilir.
            --&amp;gt;
            &amp;lt;img :src="coverPhoto" v-bind:altText="alternativeText" /&amp;gt;
        &amp;lt;/div&amp;gt;

    &amp;lt;/div&amp;gt;


    &amp;lt;script type="text/javascript"&amp;gt;

        var app = new Vue(
            {
                el: '#app',
                data: {
                    title: "Rust Programming Cookbook",
                    description: "Perfect book about programming with rust",
                    coverPhoto: "./images/book_1.jpeg",
                    alternativeText: "Rust Programming Cookbook Cover Photo"
                }
            }
        )

    &amp;lt;/script&amp;gt;
&amp;lt;/body&amp;gt;

&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Sayfadaki img elementinin kullandığı resmi kaynağı ve a&amp;ccedil;ıklama kısmı Vue bileşeninin data &amp;ouml;zelliğinden beslenir. Yine F12 Debug moddayken bu i&amp;ccedil;eriklerin değişmesi anında elementlere de yansıyacaktır. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;lerinde olduğu gibi ;)&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/41/Screenshot_03.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve F12 Debug mod durumu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/41/Screenshot_04.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Buraya kadar az &amp;ccedil;ok bir Vue bileşeninin HTML DOM nesneleri ile nasıl konuştuğunu anladık diyebiliriz. &amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; adımımızda akış kontrol ifadelerinden if...else kullanımına bakalım.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;touch vue_conditional_render.html&lt;/pre&gt;
&lt;p&gt;Kodlarımızı da aşağıdaki gibi geliştirelim.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;

&amp;lt;head&amp;gt;
    &amp;lt;title&amp;gt;VueJs Bebek Adımları - 03&amp;lt;/title&amp;gt;
    &amp;lt;!-- CDN adresinden Vue.js'i kullanacağımızı s&amp;ouml;yledik--&amp;gt;
    &amp;lt;script src="https://unpkg.com/vue"&amp;gt;&amp;lt;/script&amp;gt;
&amp;lt;/head&amp;gt;

&amp;lt;body&amp;gt;
    &amp;lt;!--
        02nci &amp;ouml;rneğin aynısı ancak bu kez kitabın stoktaki miktarına g&amp;ouml;re HTML elementlerinin Render edilip edilmeyeceklerini belirliyoruz.
        v-if v-else, v-else-if, v-show gibi direktiflerle HTML elementlerinin Render operasyonları koşula bağlanabilir.
        stock-state isimli div i&amp;ccedil;erisinde p elementleri, quantity değerine g&amp;ouml;re g&amp;ouml;r&amp;uuml;nt&amp;uuml;lenmektedir.
        onDiscount, true veya false değer almaktadır. Bu gibi sıklıkla kapalı veya a&amp;ccedil;ık konuma ge&amp;ccedil;ecek bir element s&amp;ouml;z konusu olduğunda v-show direktifinin kullanılması &amp;ouml;nerilir.
        Pek tabii Vue tarafında da switch yapısı mevcuttur.
        Yine tarayıcı Console'unda onDiscount ve quantity değerleri ile oynayarak sayfanın nasıl değişikliklere uğradığını inceleyebilirsiniz.
    --&amp;gt;

    &amp;lt;div id="app" style="text-align:center;"&amp;gt;

        &amp;lt;div id="book"&amp;gt;
            &amp;lt;h1&amp;gt;{{title}}&amp;lt;/h1&amp;gt;
            &amp;lt;p&amp;gt;{{description}}&amp;lt;/p&amp;gt;
            &amp;lt;div id="stock-state" style="font-weight:bold;"&amp;gt;
                &amp;lt;p v-if="quantity&amp;gt;100"&amp;gt;Depoda yeterli miktarda var. Tam {{quantity}} adet. Sakin!&amp;lt;/p&amp;gt;
                &amp;lt;p v-else-if="quantity&amp;gt;50 &amp;amp;&amp;amp; quantity&amp;lt;100"&amp;gt;İdare ederizzzz... {{quantity}}&amp;lt;/p&amp;gt;
                &amp;lt;p v-else-if="quantity&amp;gt;0 &amp;amp;&amp;amp; quantity&amp;lt;50"&amp;gt;Imm..Şey. Sipariş etsek mi? Sadece {{quantity}} adet kalmış&amp;lt;/p&amp;gt;
                &amp;lt;p v-else&amp;gt;Ovv yooo!!! Bu da ne? {{quantity}}&amp;lt;/p&amp;gt;
            &amp;lt;/div&amp;gt;
            &amp;lt;p v-show="onDiscount"&amp;gt;İndirimde&amp;lt;/p&amp;gt;
        &amp;lt;/div&amp;gt;

        &amp;lt;div id="book-photo"&amp;gt;
            &amp;lt;img :src="coverPhoto" v-bind:altText="alternativeText" /&amp;gt;
        &amp;lt;/div&amp;gt;

    &amp;lt;/div&amp;gt;


    &amp;lt;script type="text/javascript"&amp;gt;

        var app = new Vue(
            {
                el: '#app',
                data: {
                    title: "Rust Programming Cookbook",
                    description: "Perfect book about programming with rust",
                    coverPhoto: "./images/book_1.jpeg",
                    alternativeText: "Rust Programming Cookbook Cover Photo",
                    quantity: 120,
                    onDiscount: true,
                    level:"Small"
                }
            }
        )

    &amp;lt;/script&amp;gt;
&amp;lt;/body&amp;gt;

&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Sayfada &amp;uuml;r&amp;uuml;n&amp;uuml;n miktarına g&amp;ouml;re stock-state altındaki paragraflardan hangisinin g&amp;ouml;sterileceğine karar veriliyor. Yani verinin durumuna g&amp;ouml;re bir elementin g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml;, i&amp;ccedil;eriği vs değiştirilebiliyor. İşte &amp;ouml;rneğe ait &amp;ccedil;alışma zamanı &amp;ccedil;ıktıları.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/41/Screenshot_05.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve F12 Console'dan quantity ile onDiscount değerlerini değiştirdikten sonraki durum.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/41/Screenshot_06.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak bu tip bir Vue sayfasında bileşenin kullandığı veri &amp;ouml;nemlidir. Data &amp;ouml;zelliğinin i&amp;ccedil;eriği bir servisten &amp;ccedil;ekilmiş bir liste olabilir. Bu durumda veriyi sayfada&amp;nbsp;g&amp;ouml;sterirken basit for d&amp;ouml;ng&amp;uuml;lerine ihtiya&amp;ccedil; duyarız. D&amp;ouml;rd&amp;uuml;nc&amp;uuml; adımda bu d&amp;ouml;ng&amp;uuml;y&amp;uuml; bir JSON dizisi i&amp;ccedil;in nasıl kullanacağımızı ele alıyoruz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;touch vue_for_loop.html&lt;/pre&gt;
&lt;p&gt;Kodlarımızı aşağıdaki gibi geliştirelim.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;

&amp;lt;head&amp;gt;
    &amp;lt;title&amp;gt;VueJs Bebek Adımları - 04&amp;lt;/title&amp;gt;
    &amp;lt;!-- CDN adresinden Vue.js'i kullanacağımızı s&amp;ouml;yledik--&amp;gt;
    &amp;lt;script src="https://unpkg.com/vue"&amp;gt;&amp;lt;/script&amp;gt;
&amp;lt;/head&amp;gt;

&amp;lt;body&amp;gt;
    &amp;lt;!--
       app nesnesinin data &amp;ouml;zelliği ile gelen JSON i&amp;ccedil;eriğinde bir liste olduğunu d&amp;uuml;ş&amp;uuml;nelim. 
       &amp;Ouml;rnekte kitap kategorisindeki birka&amp;ccedil; &amp;uuml;r&amp;uuml;n bilgisine yer veriliyor.
       Bu listeyi sıralı bir şekilde HTML' e yazdırmak i&amp;ccedil;in v-for direktifinden yararlanılabilir.
       &amp;Ccedil;alışma zamanında yine Chrome Console'a girilmiş ve anlık olarak books array'indeki değerlerle oynanmıştır.
    --&amp;gt;

    &amp;lt;div id="app" style="text-align:center;"&amp;gt;

        &amp;lt;div id="book"&amp;gt;
            &amp;lt;h1&amp;gt;'{{category}}' Kategorisindeki &amp;Uuml;r&amp;uuml;nler&amp;lt;/h1&amp;gt;

            &amp;lt;!--
                data &amp;ouml;zelliğindeki books dizisinin herbir elemanı book olarak isimlendirilmiştir.
                {{ }} notasyonu ile book &amp;uuml;st&amp;uuml;nden id, title, publisher ve level &amp;ouml;zelliklerine erişililir.
                D&amp;ouml;ng&amp;uuml;lerde Render edilen elementlerin tekil bir anahtar ile işaretlenmesi &amp;ouml;nerilir. 
                Bunun i&amp;ccedil;in :key direktifi kullanlır.
                &amp;Ouml;rnekte &amp;lt;p&amp;gt; elementlerinin id isimli &amp;ouml;zellik değeri ile tekil(unique) olması sağlanır.
            --&amp;gt;
            &amp;lt;div v-for="book in books" :key="book.id"&amp;gt;
                &amp;lt;p&amp;gt;{{book.title}} &amp;lt;i&amp;gt;({{book.publisher}}) - ${{book.listPrice}}&amp;lt;/i&amp;gt;&amp;lt;/p&amp;gt;
            &amp;lt;/div&amp;gt;

        &amp;lt;/div&amp;gt;

    &amp;lt;/div&amp;gt;


    &amp;lt;script type="text/javascript"&amp;gt;

        /*
            data &amp;ouml;zelliği bir JSON nesnesi alabildiğinden i&amp;ccedil;erisinde n elemanlı array'ler de barındırabilir.
        */
        var app = new Vue(
            {
                el: '#app',
                data: {
                    category: "Kitap",
                    books: [
                        { id: 1, title: "Programming C# for Beginners", publisher: "Wrox", listPrice: 19.95, level: 100 },
                        { id: 2, title: "Patterns of Enterprise Application Architecture", publisher: "Addison Wesley", listPrice: 34.50, level: 300 },
                        { id: 3, title: "Game Engine Architecture", publisher: "Gregory", listPrice: 45.50, level: 300 },
                    ]
                }
            }
        )

    &amp;lt;/script&amp;gt;
&amp;lt;/body&amp;gt;

&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu adımdan sonraki &amp;ccedil;alışma zamanı &amp;ccedil;ıktıları ise aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/41/Screenshot_07.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve F12 ile Console'a ge&amp;ccedil;ip dizinin elemanlarında değişiklik yaptıktan sonrası.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/41/Screenshot_08.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bir Web sayfası mutlaka kullanıcı ile etkileşim halindedir. Dolayısıyla sayfa &amp;uuml;st&amp;uuml;nde ger&amp;ccedil;ekleştireceği bazı olayların Vue bileşeni tarafında da ele alınması gerekir. Beşinci&amp;nbsp;adımda bunu anlamaya &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;touch vue_event_handling.html&lt;/pre&gt;
&lt;p&gt;HTML sayfasının kodları da ş&amp;ouml;yle.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;

&amp;lt;head&amp;gt;
    &amp;lt;title&amp;gt;VueJs Bebek Adımları - 05&amp;lt;/title&amp;gt;
    &amp;lt;!-- CDN adresinden Vue.js'i kullanacağımızı s&amp;ouml;yledik--&amp;gt;
    &amp;lt;script src="https://unpkg.com/vue"&amp;gt;&amp;lt;/script&amp;gt;
&amp;lt;/head&amp;gt;

&amp;lt;body&amp;gt;
    &amp;lt;!--
        Sayfadaki olaylar v-on direktifi kontrollere bağlanabilir.
        &amp;Ouml;rnekte kitap fiyatını artırmak ve azaltmak i&amp;ccedil;in iki button ve click olayları kullanılmaktadır.
    --&amp;gt;

    &amp;lt;div id="app" style="text-align:center;"&amp;gt;

        &amp;lt;h1&amp;gt;'{{category}}' Kategorisindeki &amp;Uuml;r&amp;uuml;nler&amp;lt;/h1&amp;gt;

        &amp;lt;div v-for="book in books" :key="book.id"&amp;gt;
            &amp;lt;p&amp;gt;
                &amp;lt;!-- 
                    CSS stillerini de veriye bağlayabiliriz.
                    span elementinin arkaplan rengini belirleyen backgrounColor değeri o anki book nesnesinin color &amp;ouml;zelliğine bağlanmıştır.
                --&amp;gt;
                &amp;lt;span :style="{backgroundColor: book.color}"&amp;gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;lt;/span&amp;gt;
                {{book.title}}
                &amp;lt;i&amp;gt;({{book.publisher}}) - ${{book.listPrice}}&amp;lt;/i&amp;gt;
                &amp;lt;!--
                    Fiyat artırma işini &amp;uuml;stlenen click olayı ger&amp;ccedil;ekleştiğinde ifade i&amp;ccedil;erisindeki kod &amp;ccedil;alışır. Bulunulan book nesnesinin listPrice değeri 1 artar.
                --&amp;gt;
                &amp;lt;button v-on:click="book.listPrice+=1"&amp;gt;+&amp;lt;/button&amp;gt;
                &amp;lt;!--
                    Ancak olayları aşağıdaki gibi fonksiyonlara devrederek kullanmak daha doğrudur.
                    Bu kez button click olayı ger&amp;ccedil;ekleştiğinde book.id değerini alan decreasePrice metodu &amp;ccedil;ağrılır.
                    Bu metod Vue nesnesinin opsiyonel parametrelerinden olan methods i&amp;ccedil;erisinde tanımlanır.
                    v-on direktifi aşağıdaki gibi @ ifadesi ile daha kısa şekilde yazılabilir.
                    &amp;Ouml;rnekte disabled niteliği de indirim yapılıp yapılmayacağını belirten incAvailable d&amp;uuml;ğmesine bağlanmıştır.
                    Mesela 2 numaralı &amp;uuml;r&amp;uuml;n i&amp;ccedil;in indirim uygulanamaz.
                --&amp;gt;
                &amp;lt;button @click="decreasePrice(book.id)" :disabled="!book.incAvailable"&amp;gt;-&amp;lt;/button&amp;gt;
            &amp;lt;/p&amp;gt;
        &amp;lt;/div&amp;gt;

    &amp;lt;/div&amp;gt;


    &amp;lt;script type="text/javascript"&amp;gt;

        var app = new Vue(
            {
                el: '#app',
                data: {
                    category: "Kitap",
                    books: [
                        { id: 0, title: "Programming C# for Beginners", publisher: "Wrox", listPrice: 19.95, level: 100, incAvailable: true, color: "blue" },
                        { id: 1, title: "Patterns of Enterprise Application Architecture", publisher: "Addison Wesley", listPrice: 34.50, level: 300, incAvailable: true, color: "red" },
                        { id: 2, title: "Game Engine Architecture", publisher: "Gregory", listPrice: 45.50, level: 300, incAvailable: false, color: "red" },
                    ]
                },
                methods: {
                    /*
                        button click olayı ger&amp;ccedil;ekleştiğinde &amp;ccedil;alıştırılan metot.
                    */
                    decreasePrice(id) {
                        console.log(id, ". eleman i&amp;ccedil;in 1 dolar indirim");
                        this.books[id].listPrice -= 1;
                    }
                }
            }
        )

    &amp;lt;/script&amp;gt;
&amp;lt;/body&amp;gt;

&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Kullanıcı kitap fiyatlarını artırıp azaltabilir. Her iki aksiyon i&amp;ccedil;in olay bildirimlerinin nasıl yapıldığına dikkat edin. Olayın ger&amp;ccedil;ekleşmesi sonucu &amp;ccedil;alışacak kod bir direktif ile birlikte yazılabileceği gibi Vue bileşeninin methods &amp;ouml;zelliği i&amp;ccedil;erisinde de konuşlandırılabilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/41/Screenshot_10.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Yine F12 - Console penceresinde CSS rengini değiştirecek şekilde veriyle oynayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/41/Screenshot_11.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Altıncı adımda verinin HTML elementlerinin i&amp;ccedil;eriğine g&amp;ouml;re bir hesaplamaya dahil edilmesine bakacağız. Burada Vue bileşeninin computed &amp;ouml;zelliğindeki fonksiyonlar devreye giriyor. Listelenen kitaplardan herhangi birinin &amp;uuml;st&amp;uuml;ne gelindiğinde o kitabın fiyatı g&amp;uuml;ncel d&amp;ouml;viz kuru değerine g&amp;ouml;re hesaplatılıp alt tarafta yazılıyor. Burada senaroyu biraz daha zengileştirebilirsiniz. &amp;Ouml;rneğin&amp;nbsp;fare imleci kitap adının &amp;uuml;st&amp;uuml;ne geldiğinde bir popup i&amp;ccedil;inde resmini ve a&amp;ccedil;ıklamasını g&amp;ouml;sterebilirsiniz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;touch vue_computed_props.html&lt;/pre&gt;
&lt;p&gt;Kodlarımızı aşağıdaki gibi geliştirelim.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;

&amp;lt;head&amp;gt;
    &amp;lt;title&amp;gt;VueJs Bebek Adımları - 06&amp;lt;/title&amp;gt;
    &amp;lt;!-- CDN adresinden Vue.js'i kullanacağımızı s&amp;ouml;yledik--&amp;gt;
    &amp;lt;script src="https://unpkg.com/vue"&amp;gt;&amp;lt;/script&amp;gt;
&amp;lt;/head&amp;gt;

&amp;lt;body&amp;gt;

    &amp;lt;div id="app" style="text-align:center;"&amp;gt;

        &amp;lt;h1&amp;gt;'{{category}}' Kategorisindeki &amp;Uuml;r&amp;uuml;nler&amp;lt;/h1&amp;gt;
        &amp;lt;!--
            book_count, bir computed property'dir.
        --&amp;gt;
        &amp;lt;p&amp;gt;&amp;lt;i&amp;gt;{{book_count}} adedi satışta&amp;lt;/i&amp;gt;&amp;lt;/p&amp;gt;

        &amp;lt;!--
            div &amp;uuml;zerinde mouse bir kitaba denk geldiğinde bu kitabın indis değeri markIndex isimli fonksiyona g&amp;ouml;nderilir.
            markIndex fonksiyonu gelen bu indis değerini data elementindeki selectedBookIndex'e set eder.
            Buna g&amp;ouml;re computed i&amp;ccedil;erisinde hangi kitap i&amp;ccedil;in işlem yapacağımızı anlayabiliriz.
        --&amp;gt;
        &amp;lt;div v-for="(book,index) in books" :key="book.id" @mouseover="markIndex(index)"&amp;gt;
            &amp;lt;p&amp;gt;
                {{book.title}} &amp;lt;i&amp;gt;${{book.listPrice}}&amp;lt;/i&amp;gt;
            &amp;lt;/p&amp;gt;
        &amp;lt;/div&amp;gt;
        &amp;lt;h3&amp;gt;G&amp;uuml;ncel kurdan fiyatı {{local_price}} liradır.&amp;lt;/h3&amp;gt;

    &amp;lt;/div&amp;gt;


    &amp;lt;script type="text/javascript"&amp;gt;

        /*
            Computed Properties.
            app nesnesinin computed &amp;ouml;zelliğinde local_price isimli bir fonksiyon bulunmaktadır.
            Bu fonksiyon selectedBookIndex değerine işaret eden &amp;uuml;r&amp;uuml;n&amp;uuml;n liste fiyatını g&amp;uuml;ncel d&amp;ouml;viz kuru ile &amp;ccedil;arpıp geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;r.
            D&amp;ouml;nd&amp;uuml;r&amp;uuml;len değer HTML i&amp;ccedil;erisinde for d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml;n dışındaki bir h3 elementine basılır.
        */
        var app = new Vue(
            {
                el: '#app',
                data: {
                    category: "Kitap",
                    books: [
                        { id: 0, title: "Programming C# for Beginners", publisher: "Wrox", listPrice: 19.95, onSale: true },
                        { id: 1, title: "Patterns of Enterprise Application Architecture", publisher: "Addison Wesley", listPrice: 34.50, onSale: true },
                        { id: 2, title: "Game Engine Architecture", publisher: "Gregory", listPrice: 45.50, onSale: false },
                    ],
                    selectedBookIndex: 0,
                },
                methods: {
                    markIndex(index) {
                        this.selectedBookIndex = index;
                        //console.log(index);
                    }
                },
                computed: {
                    /*
                        Computed Property'ler hesaplamaya dahil ettikleri veriler değişmediği s&amp;uuml;rece cache &amp;uuml;zerinde tutulurlar.
                        local_price, mouseover hareketine g&amp;ouml;re &amp;uuml;zerinde durulan kitabı alıp liste fiyatını bir işlemden ge&amp;ccedil;irir ve geriye bir değer d&amp;ouml;ner.
                        book_count ise satışta olan kitapların adedini bulur ve geriye d&amp;ouml;ner. 
                    */
                    local_price() {
                        //console.log(this.selectedBookIndex);
                        return this.books[this.selectedBookIndex].listPrice * 8.15;
                    },
                    book_count() {
                        count = 0;
                        for (i = 0; i &amp;lt; this.books.length; i++) {
                            if (this.books[i].onSale)
                                count++;
                        }
                        return count;
                    }
                }
            }
        )

    &amp;lt;/script&amp;gt;
&amp;lt;/body&amp;gt;

&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rneğin &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı ise aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/41/Screenshot_12.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Buraya kadarki adımlarda hep&amp;nbsp;ana Vue bileşeni ile &amp;ccedil;alıştık. &amp;Ccedil;ok doğal olarak HTML DOM yapısının birden fazla Vue bileşeni ile &amp;ccedil;alışması da istenebilir. Nitekim bir s&amp;uuml;re sonra ana bileşen &amp;ccedil;ok fazla kalabalıklaşır. Yedinci adımda bu durumu anlamaya &amp;ccedil;alışacağız.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;touch vue_components.html&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnekte yer alan&amp;nbsp;sportnews ve book iki ayrı Vue bileşeni olarak tasarlanmıştır. Template olarak birer div d&amp;ouml;nd&amp;uuml;rd&amp;uuml;klerine dikkat edelim. HTML'de konuşlandırılan aynı isimli elementler i&amp;ccedil;erisine bu şablonlar basılır. book bileşenindeki iLikeIt olayının kullanımı da &amp;ouml;nemli. book bir alt bileşen olarak &amp;uuml;zerinde ger&amp;ccedil;ekleşen olay sonrası app isimli ana bileşeni de uyarmaktadır. Yani alt bileşene ait bir olay tetiklendiğinde &amp;uuml;st bileşende de bir olay tetiklenmesini sağlayabiliriz. Dolayısıyla bileşenler&amp;nbsp;birbirleriyle olaylar &amp;uuml;zerinden de iletişim kurabilirler.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;

&amp;lt;head&amp;gt;
    &amp;lt;title&amp;gt;VueJs Bebek Adımları - 07&amp;lt;/title&amp;gt;
    &amp;lt;!-- CDN adresinden Vue.js'i kullanacağımızı s&amp;ouml;yledik--&amp;gt;
    &amp;lt;script src="https://unpkg.com/vue"&amp;gt;&amp;lt;/script&amp;gt;
&amp;lt;/head&amp;gt;

&amp;lt;body&amp;gt;

    &amp;lt;div id="app" style="text-align:left;color:white"&amp;gt;
        &amp;lt;sportnews&amp;gt;&amp;lt;/sportnews&amp;gt;
        &amp;lt;!--
            Bileşenleri aşağıdaki gibi de kullanabiliriz. book isimli bileşenin verisi app bileşenindeki data i&amp;ccedil;erisinde yer alan json dizisidir.
            book elementi i&amp;ccedil;erisinde :property_name şeklindeki tanımlamalar ile d&amp;ouml;ng&amp;uuml;n&amp;uuml;n dolaştığı book nesnesinin değerleri bileşen i&amp;ccedil;erisine aktarılır.
            :property_name bilgileri book bileşeninin props &amp;ouml;zelliğinde tanımlanmıştır.
            
            Ek: Alt bileşenden &amp;uuml;st bileşene bildirim yollamak.
            Ama&amp;ccedil; bir kitabın "Beğendim" butonuna basıldığında app bileşenindeki(&amp;uuml;st component) toplam beğeni sayısını artırmak.
            Bunun i&amp;ccedil;in book bileşeninde d&amp;uuml;ğmeye basıldığında, &amp;uuml;st bileşene bunu bildirecek şekilde bir mesaj g&amp;ouml;ndermek gerekir.
            Bu mesaj $emit fonksiyonu ile yollanabilir(book i&amp;ccedil;erisindeki iLikeIt metoduna bakın)
            @i-like-it niteliğinde belirtilen updateLikeCount fonksiyonu ise alt bileşenlerden birisi i-like-it mesajını yukarı fırlattığında &amp;ccedil;ağırılır.
            Bu arada hangi book bileşenine basıldığını anlamak i&amp;ccedil;in (b,index) &amp;ccedil;iftindeki index değerini updateLikeCount metoduna parametre olarak verebiliriz.
        --&amp;gt;
        &amp;lt;div v-for="(b,index) in books" :key="b.id"&amp;gt;
            &amp;lt;book :book_title="b.title" :book_summary="b.description" :book_authors="b.authors"
                :book_list_price="b.listPrice" @i-like-it="updateLikeCount(index)"&amp;gt;
            &amp;lt;/book&amp;gt;
        &amp;lt;/div&amp;gt;
        &amp;lt;p style="color: purple;"&amp;gt;Toplamda {{likeCount}} kere beğen d&amp;uuml;ğmelerine bastınız!&amp;lt;/p&amp;gt;
    &amp;lt;/div&amp;gt;


    &amp;lt;script type="text/javascript"&amp;gt;
        /*
            Bu &amp;ouml;rneğe kadar dikkat edileceği &amp;uuml;zere app nesnesinin data, computed, methods gibi &amp;ouml;zelliklerinin kalabalıklaşmaya başladığını g&amp;ouml;rd&amp;uuml;k.
            Y&amp;ouml;netilebilir ve mod&amp;uuml;ler yapıdaki bir Vue sayfası i&amp;ccedil;in bileşenler(component) kullanmak doğru bir yaklaşımdır.
            Yani ana sayfadaki component'in alt bileşenlerden oluştuğunu d&amp;uuml;ş&amp;uuml;nebiliriz.
            &amp;Ouml;rnekte iki component tanımlanmış ve app isimli div i&amp;ccedil;erisinde kullanılmıştır.
            
            sportnews isimli bileşen olduk&amp;ccedil;a sıradandır. Kendi verisini kullanır.
            book isimli bileşen ise app bileşenindeki data i&amp;ccedil;eriğini kullanır.
            
            Bileşenler component fonksiyonu ile tanımlanır.
            Her bileşen bir template kullanmalıdır. 
            template &amp;ouml;zelliği bir container d&amp;ouml;nd&amp;uuml;rmelidir(div gibi)
        */
        Vue.component('sportnews', {
            template:
                `
                &amp;lt;div class='sportnews' style='text-align:left;backgroundColor:purple;'&amp;gt;
                    &amp;lt;h2&amp;gt;G&amp;uuml;n&amp;uuml;n &amp;Ouml;ne &amp;Ccedil;ıkan Spor Haberi&amp;lt;/h2&amp;gt;
                    &amp;lt;p&amp;gt;&amp;lt;h3&amp;gt;{{title}}&amp;lt;/h3&amp;gt;&amp;lt;/p&amp;gt;
                    &amp;lt;p&amp;gt;{{summary}}&amp;lt;/p&amp;gt;
                &amp;lt;/div&amp;gt;
            `,
            data() {
                return {
                    title: "Shane Larkin Milli Takıma &amp;Ccedil;ağırıldı",
                    summary: "Bir s&amp;uuml;redir &amp;uuml;lkesi ABD'de olan Shane Larkin, Anadolu Efes kampına d&amp;ouml;nd&amp;uuml;kten sonra doğrudan milli takıma &amp;ccedil;ağırıldı."
                }
            }
        });

        Vue.component('book', {
            template:
                `
                &amp;lt;div class='book' style='text-align:right;backgroundColor:gold;color:purple'&amp;gt;
                    &amp;lt;p&amp;gt;&amp;lt;h3&amp;gt;{{book_title}}&amp;lt;/h3&amp;gt;&amp;lt;/p&amp;gt;
                    &amp;lt;p&amp;gt;{{book_summary}}, {{book_authors}}&amp;lt;br/&amp;gt;{{book_list_price}} TL&amp;lt;/p&amp;gt;
                    &amp;lt;button v-on:click="iLikeIt"&amp;gt;Beğendim&amp;lt;/button&amp;gt;
                &amp;lt;/div&amp;gt;
            `,
            methods: {
                iLikeIt() {
                    console.log('book bileşeninin iLikeIt olayı &amp;ccedil;ağrıldı');
                    /*
                        $emit ile button click olayı tetiklendiğinde &amp;uuml;st bileşene i-like-it olayı ger&amp;ccedil;ekleşti şeklinde bir bilgi yollanır.
                    */
                    this.$emit('i-like-it');
                }
            },
            props: {
                book_title: {
                    type: String,
                    required: true
                },
                book_summary: {
                    type: String,
                    required: true
                },
                book_authors: {
                    type: String,
                    required: true
                },
                book_list_price: {
                    type: Number,
                    required: true
                },
            }
        });

        var app = new Vue(
            {
                el: '#app',
                data: {
                    likeCount: 0, // Alt bileşenlerdeki d&amp;uuml;ğmeye basıldığında bu değeri artırıyoruz
                    books: [
                        {
                            id:1001,
                            title: "Veba",
                            description: "Camus adı &amp;ccedil;oğu okur i&amp;ccedil;in Yabancı romanıyla &amp;ouml;zdeşleşir. Ancak yazarın en &amp;ouml;nemli yapıtı aslında Veba'dır...",
                            authors: "Albert Camus",
                            listPrice: 34
                        },
                        {
                            id:1002,
                            title: "Mahur Beste",
                            description: "Mahur Beste'de Tanpınar'ın Huzur ve Sahnenin Dışındakiler adlı romanlarında &amp;ouml;nemli bir motif olan 'Mahur Beste' teması &amp;ouml;nemli yer tutar. Mahur Beste, acı bir aşk hikayesinin klasik musiki kalıplarıyla soyutlanmasıdır...",
                            authors: "Ahmet Hamdi Tanpınar",
                            listPrice: 23
                        },
                        {
                            id:1003,
                            title: "1Q84",
                            description: "Sarsıcı bir yolculuğa hazır mısınız? &amp;Ouml;yleyse kemerlerinizi bağlayın. Erkekleri, titizlikle geliştirdiği bir y&amp;ouml;ntemle &amp;ouml;teki d&amp;uuml;nyaya g&amp;ouml;nderen gen&amp;ccedil; bir kadınla tanışacaksınız. Ve amansız bir takiple onun peşine d&amp;uuml;şen fanatik bir cemaatin m&amp;uuml;ritleriyle&amp;hellip;",
                            authors: "Haruki Murakami",
                            listPrice: 23
                        },
                        {
                            id:1004,
                            title: "Beden Kayıt Tutar",
                            description: "Ne yazık ki şimdiki psikiyatri anlayışı, yakınmalarınızı anlatmanız ve hekimin de bu yakınmaları d&amp;uuml;zeltecek bir ila&amp;ccedil; &amp;ouml;nermesi &amp;uuml;zerine kurulu. Ancak 'Hi&amp;ccedil; bir ila&amp;ccedil;, k&amp;ouml;t&amp;uuml; ge&amp;ccedil;miş bir &amp;ccedil;ocukluğu d&amp;uuml;zeltmiyor'...",
                            authors: "Bessel A. van der Kolk",
                            listPrice: 41,
                        }
                    ]
                },
                methods: {
                    /*
                        Alt bileşenin emit ile g&amp;ouml;nderdiği mesaj sonrası tetiklenen metot
                    */
                    updateLikeCount(index) {
                        selected_title = this.books[index].title;
                        console.log("`", selected_title, "` isimli kitabı beğendin");
                        console.log('&amp;Uuml;st bileşen(app) i&amp;ccedil;in updateLikeCount olayı &amp;ccedil;ağırıldı');
                        this.likeCount += 1;
                    }
                }
            }
        );

    &amp;lt;/script&amp;gt;
&amp;lt;/body&amp;gt;

&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rneğe ait &amp;ccedil;ıktıları aşağıda g&amp;ouml;rebilirsiniz. G&amp;ouml;zleriniz kanayabilir o nedenle g&amp;uuml;neş g&amp;ouml;zl&amp;uuml;ğ&amp;uuml; kullanmanızı ya da monit&amp;ouml;rden beş metre kadar uzaklaşıp kısık g&amp;ouml;zle bakmanızı rica ederim :D&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/41/Screenshot_15.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Yine F12 - Console &amp;uuml;st&amp;uuml;nde oynayıp veri değişimlerini izlemekte yarar var.&lt;/p&gt;
&lt;p&gt;Bu tip kullanıcı etkileşimli sayfalarda bir diğer konu ise Form kullanımıdır. Yani Form verisi ile Vue tarafı nasıl haberleşebilir, POST edilen veri nasıl ele alınabilir sekizince ve son adımda bunu anlamaya &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;touch vue_forms.html&lt;/pre&gt;
&lt;p&gt;Son sayfamıza ait kodları aşağıdaki gibi yazabiliriz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;

&amp;lt;head&amp;gt;
    &amp;lt;title&amp;gt;VueJs Bebek Adımları - 08&amp;lt;/title&amp;gt;
    &amp;lt;!-- CDN adresinden Vue.js'i kullanacağımızı s&amp;ouml;yledik--&amp;gt;
    &amp;lt;script src="https://unpkg.com/vue"&amp;gt;&amp;lt;/script&amp;gt;
&amp;lt;/head&amp;gt;

&amp;lt;body&amp;gt;

    &amp;lt;div id="app" style="text-align:left"&amp;gt;

        &amp;lt;!--
            @new-book-created, book-form bileşeninin onSubmit olayı i&amp;ccedil;erisinden yapılan bildirimin adıdır.
            Bu bildirim ger&amp;ccedil;ekleştiğinde &amp;uuml;st bileşen yeni bir kitap &amp;uuml;retildiğini anlayabilir ve bu nesneyi kendi data nesnesindeki books isimli diziye ekleyebilir.
            Bunun i&amp;ccedil;in addBookToList metodu kullanılır.
        --&amp;gt;
        &amp;lt;book-form @new-book-created="addBookToList"&amp;gt;&amp;lt;/book-form&amp;gt;

        &amp;lt;div v-for="(b,index) in books" :key="b.id"&amp;gt;
            &amp;lt;p&amp;gt;
            &amp;lt;h2&amp;gt;{{b.title}} ({{b.like}} beğeni)&amp;lt;/h2&amp;gt;
            &amp;lt;/p&amp;gt;
            &amp;lt;p&amp;gt;{{b.summary}}&amp;lt;/p&amp;gt;
        &amp;lt;/div&amp;gt;

    &amp;lt;/div&amp;gt;


    &amp;lt;script type="text/javascript"&amp;gt;

        /*
            &amp;Ouml;rnekte bir form kullanılarak Submit işlemi ele alınıyor.
            input, textarea, select gibi girdi elemanları v-model direktifi yardımıyla data fonksiyonundan d&amp;ouml;nd&amp;uuml;r&amp;uuml;len alanlara bağlanırlar.
            select kontrol&amp;uuml;nde kullanılan .number, option i&amp;ccedil;eriğinin integer olarak d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmesini sağlar.
            Submit işlemi ger&amp;ccedil;ekleştiğinde @submit.prevent ile belirtilen onSubmit metodu tetiklenir.
            Form Validation i&amp;ccedil;in onSubmit metodunda bir takım tedbirler aldık. 
            Bu arada HTML 5 i&amp;ccedil;in required ifadesi ile elementlerin zorunlu hale getirilebileceğini de belirtelim.
        */
        Vue.component('book-form', {
            template:
                `
                &amp;lt;div class='book'&amp;gt;
                    &amp;lt;form class="new-book-form" @submit.prevent="onSubmit"&amp;gt;
                        &amp;lt;p&amp;gt;
                            &amp;lt;label for="title"&amp;gt;Kitabın adı nedir?&amp;lt;/label&amp;gt;
                            &amp;lt;input id="title" v-model="title" placeholder="title"&amp;gt;
                        &amp;lt;/p&amp;gt;                    
                        &amp;lt;p&amp;gt;
                            &amp;lt;label for="summary"&amp;gt;D&amp;uuml;ş&amp;uuml;ncelerin neler?&amp;lt;/label&amp;gt;      
                            &amp;lt;textarea id="summary" v-model="summary"&amp;gt;&amp;lt;/textarea&amp;gt;
                        &amp;lt;/p&amp;gt;                        
                        &amp;lt;p&amp;gt;
                            &amp;lt;label for="like"&amp;gt;Ne kadar beğendin?&amp;lt;/label&amp;gt;                        
                            &amp;lt;select id="like" v-model.number="like"&amp;gt;
                                &amp;lt;option&amp;gt;1&amp;lt;/option&amp;gt;
                                &amp;lt;option&amp;gt;2&amp;lt;/option&amp;gt;
                                &amp;lt;option&amp;gt;3&amp;lt;/option&amp;gt;
                                &amp;lt;option&amp;gt;4&amp;lt;/option&amp;gt;
                                &amp;lt;option&amp;gt;5&amp;lt;/option&amp;gt;
                            &amp;lt;/select&amp;gt;
                        &amp;lt;/p&amp;gt;                            
                        &amp;lt;p&amp;gt;
                            &amp;lt;input type="submit" value="Ekle"&amp;gt;  
                        &amp;lt;/p&amp;gt;            
                        &amp;lt;p v-if="errors.length" style="color:red;"&amp;gt;
                            &amp;lt;b&amp;gt;Hata : &amp;lt;/b&amp;gt;
                            &amp;lt;ul&amp;gt;
                                &amp;lt;li v-for="err in errors"&amp;gt;{{ err }}&amp;lt;/li&amp;gt;
                            &amp;lt;/ul&amp;gt;
                        &amp;lt;/p&amp;gt;            
                    &amp;lt;/form&amp;gt;                    
                &amp;lt;/div&amp;gt;
            `,
            data() {
                return {
                    title: null,
                    summary: null,
                    like: null,
                    errors: []  // Form doğrulama hatalarını tutmak i&amp;ccedil;in eklendi
                }
            },
            methods: {
                /* 
                    Submit d&amp;uuml;ğmesine basılınca tetiklenir.
                    this ile bu bileşenden gelen name, summary, like gibi alanlar ele alınabilir.
                    Bu değerler kullanılarak yeni bir nesne oluşturulur.
                */
                onSubmit() {
                    this.errors = [];
                    if (this.title &amp;amp;&amp;amp; this.summary) {
                        let newBook = {
                            title: this.title,
                            summary: this.summary,
                            like: this.like
                        }
                        /*
                            &amp;Uuml;st bileşene yeni bir girdi oluşturulduğuna dair bilgiyi yine $emit ile g&amp;ouml;nderebiliriz.
                            İkinci parametre ile oluşturulan nesne &amp;ouml;rneği &amp;uuml;st bileşene yollanır.
                        */
                        this.$emit('new-book-created', newBook)
                        /*
                            newBook &amp;ouml;rneklendikten sonra bu bileşenin verisi temizlenir ve yeni veri girişine uygun hale getirilir.
                        */
                        this.title = null
                        this.summary = null
                        this.like = null
                    } else {
                        /*
                            Doğrulama i&amp;ccedil;in koyduğumuz kısım.
                            Eğer başlık veya &amp;ouml;zet girilmemişse bunla ilgili olarak bu bileşenin errors dizisine bilgi ekliyoruz.
                        */
                        if (!this.title) this.errors.push("Kitap başlığı girilmeli.")
                        if (!this.summary) this.errors.push("Kitap i&amp;ccedil;in geri bildirim eklenmeli.")
                    }
                }
            }
        });

        var app = new Vue(
            {
                el: '#app',
                data: {
                    books: []
                },
                methods: {
                    addBookToList(book) {
                        /*
                            book-form bileşeninde Submit işlemi ile bir eleman eklendiğinde @new-book-created bildirimine g&amp;ouml;re bu metot &amp;ccedil;ağrılır.
                            book parametresi ile gelen nesne, push fonksiyonu ile books dizisine eklenir.
                        */
                        this.books.push(book)
                    }
                }
            }
        );

    &amp;lt;/script&amp;gt;
&amp;lt;/body&amp;gt;

&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;İlk denemelere ait bir ekran &amp;ccedil;ıktısını aşağıda bulabilirsiniz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/41/Screenshot_16.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Doğrulama ile ilgili kodların &amp;ccedil;ıktısı da ş&amp;ouml;yle.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/41/Screenshot_17.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/41/Screenshot_18.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekte ekrandan girilen kitap bilgileri books isimli JSON dizisine ekleniyor. Tahmin edileceği &amp;uuml;zere bu veri erişimi bir servise doğru yapılmalı. Yani uygulamanın bir servis &amp;uuml;zerinden bir veritabanı ile konuşması daha doğru olacaktır. Burada veritabanı hayal g&amp;uuml;c&amp;uuml;n&amp;uuml;ze kalmış. Senaryoya uygun bir NoSQL veya ilişkisel veritabanı kullanılabilir.&lt;/p&gt;
&lt;p&gt;Sekizinci &amp;ouml;rnekle birlikte Vue'nun en temel par&amp;ccedil;alarını bebek adımları ile biraz olsun incelemiş olduk. Konuyu kendi kendinize &amp;ccedil;alışabileceğinizi d&amp;uuml;ş&amp;uuml;nerek sizlere birka&amp;ccedil; soru ve &amp;ouml;dev bırakıyorum.&lt;/p&gt;
&lt;h2&gt;Bomba Sorular&lt;/h2&gt;
&lt;ul&gt;
&lt;li&gt;Vue'da v-switch direktifi var mıdır? Yoksa bile kullanmanın bir yolu olabilir mi?&lt;/li&gt;
&lt;li&gt;vue_event_handling &amp;ouml;rneğinde tek bir karakter ekleyerek oluşacak bug'ı bulun.&lt;/li&gt;
&lt;li&gt;Vue.component ile bileşen tanımlanırken computed, methods &amp;ouml;zelliklerini kullanabilir miyiz?&lt;/li&gt;
&lt;li&gt;vue_components.html &amp;ouml;rneğinde yer alan data neden bir fonksiyon şeklinde tanımlanmıştır?&lt;/li&gt;
&lt;li&gt;"Props'lar &amp;uuml;st bileşenden alt bileşene veri aktarımında kullanılırlar" ifadesi doğru mudur?&lt;/li&gt;
&lt;/ul&gt;
&lt;h2&gt;ve &amp;Ouml;devler&lt;/h2&gt;
&lt;ul&gt;
&lt;li&gt;vue_attribute_binding.html &amp;ouml;rneğinde kitap fotoğrafına bir link bağlayın&lt;em&gt;(a href)&lt;/em&gt; ve href niteliğinin data nesnesindeki url isimli bir &amp;ouml;zellikten beslenmesini sağlayın.&lt;/li&gt;
&lt;li&gt;vue_conditional_render.html &amp;ouml;rneğinde, level değişkeninin Small, Medium, Large, XLarge olmasına g&amp;ouml;re sayfanın sağ &amp;uuml;st k&amp;ouml;şesinde S,M,L,XL harflerinin ş&amp;ouml;yle janjanlı imajlar şeklinde g&amp;ouml;r&amp;uuml;nmesini sağlayın.&lt;/li&gt;
&lt;li&gt;vue_for_loop &amp;ouml;rneğinde yer alan level değerini kullanarak kitap fontlarını renklendirmeyi deneyin. 100 i&amp;ccedil;in farklı bir renk, 300 i&amp;ccedil;in farklı bir renk vb&lt;/li&gt;
&lt;li&gt;vue_event_handling &amp;ouml;rneğinde fiyat azaltmada 0 ve eksi değere ge&amp;ccedil;ilmesini &amp;ouml;nleyin. Ayrıca her &amp;uuml;r&amp;uuml;n fiyatı i&amp;ccedil;in bir &amp;uuml;st artırma limiti olsun ve artışlar bu değeri ge&amp;ccedil;emesin.&lt;/li&gt;
&lt;li&gt;Vue antrenmanı yaptığınız herhangi bir sayfada yine &amp;uuml;r&amp;uuml;nleri listeleyin ancak bir &amp;uuml;r&amp;uuml;n adının &amp;uuml;st&amp;uuml;ne geldiğinizde &amp;uuml;r&amp;uuml;n&amp;uuml;n fotoğrafının olduğu bir div elementini aktif hale getirin. Yani &amp;uuml;r&amp;uuml;n adı &amp;uuml;st&amp;uuml;ne gelince fotoğraf g&amp;ouml;sterilmesini sağlayın&lt;em&gt;(Popup ile uğraşmayın, sayfadaki bir div alanı g&amp;ouml;r&amp;uuml;n&amp;uuml;r hale gelsin yeterli)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Okduğunuz son beş kitabın sadece başlıklarını listeleyen bir bileşen tasarlayın. Bu bileşende her başlık yanında "Detay" isimli bir Button olsun. Bu d&amp;uuml;ğmeye basınca kitapla ilgili detayları i&amp;ccedil;eren başka bir bileşen başlığın hemen altında g&amp;ouml;r&amp;uuml;n&amp;uuml;r olsun.&lt;/li&gt;
&lt;li&gt;Vue_forms.html &amp;ouml;rneğinde kitap ekledik&amp;ccedil;e bunu ekrana listeleyen bir bileşeni for d&amp;ouml;ng&amp;uuml;s&amp;uuml; yardımıyla kullanmayı deneyiniz.&lt;/li&gt;
&lt;li&gt;Vue_forms.html &amp;ouml;rneğinde summary i&amp;ccedil;in maksimum 250 karakter girilmesine izin veren bir doğrulama fonksiyonelliği geliştirin.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;Ouml;rnek kodlara &lt;a href="https://github.com/buraksenyurt/skynet/tree/master/No%2041%20-%20Vueeeee" target="_blank"&gt;github reposu &amp;uuml;zerinden&lt;/a&gt; erişebilirsiniz.&amp;nbsp;B&amp;ouml;ylece geldik bir SkyNet derlememizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2020-12-21 08:46:00</pubDate>
  <slug>vue-icin-bebek-adimlari</slug>
  <tags>
    <tag>javascript</tag>
    <tag>vue</tag>
    <tag>vuejs</tag>
    <tag>framework</tag>
    <tag>frontend</tag>
    <tag>html</tag>
    <tag>mvvm</tag>
    <tag>programlama</tag>
  </tags>
  <categories>
    <category>Vue.js</category>
  </categories>
</post>