<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Koleksiyon Bazlı WCF Rest Servisleri</title>
  <description>Bildiğiniz üzere bir süredir WCF servislerinin REST modeline göre geliştirilmesi ile ilgili bilgilerimi ve öğrendiklerimi sizlerle paylaşmaktayım. Bu nedenle dün gece yaşadığım bir macerayıda aktararak başıma gelenleri sizlerle paylaşmak istiyorum.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bildiğiniz &amp;uuml;zere bir s&amp;uuml;redir &lt;strong&gt;WCF&lt;/strong&gt; servislerinin &lt;strong&gt;REST&lt;/strong&gt; modeline g&amp;ouml;re geliştirilmesi ile ilgili bilgilerimi ve &amp;ouml;ğrendiklerimi sizlerle paylaşmaktayım. Bu nedenle d&amp;uuml;n gece yaşadığım bir macerayıda aktararak başıma gelenleri sizlerle paylaşmak istiyorum. Bir s&amp;uuml;re &amp;ouml;nce &lt;a title="WCF Rest Starter Kit Preview 2" href="http://aspnet.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=24644" target="_blank"&gt;WCF Rest Starter Kit' &lt;/a&gt;i incelemeye başlamış ve bu konuyla ilgili olaraktan bir&amp;nbsp;g&amp;ouml;rsel video yayınlamıştım.(&lt;a title="ReadOnly Collection Service" href="http://www.nedirtv.com/video/WCF-REST-Bolum-2---Readonly-Collection-Service.aspx" target="_blank"&gt;NedirTv? bağlantısı&lt;/a&gt;)&lt;/p&gt;
&lt;p&gt;Bu g&amp;ouml;rsel derste, veri&amp;nbsp;kaynağı olarak i&amp;ccedil;erdikleri&amp;nbsp;koleksiyonları&amp;nbsp;yanlız okuma(Read-only) ama&amp;ccedil;lı ele alan REST bazlı WCF servislerinin, &lt;strong&gt;WCF Rest Start Kit Preview 1&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml; ile nasıl geliştirilebileceğini incelemeye &amp;ccedil;alışmıştım. Tabi aradan uzun zaman ge&amp;ccedil;ti ve &lt;strong&gt;WCF Rest Start Kit Preview 2&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml; yayınlandı. Ayrıca g&amp;ouml;rsel derste insert, update ve delete işlemlerini&amp;nbsp;ele almamıştım. Bende hazır fırsat varken, bu tip WCF servislerinde &lt;strong&gt;Insert, Update, Delete&lt;/strong&gt; işlemlerini nasıl yapabiliriz konusunu araştırmaya başladım. Starter Kit ile birlikte gelen Lab' lar i&amp;ccedil;erisinde (3nc&amp;uuml;&amp;nbsp;alıştırmada) bu konu olduk&amp;ccedil;a kolay anlaşılır bir şekilde ele alınmaktadır. Benim size aktaracaklarım daha &amp;ccedil;ok başıma nelerin geldiği.&lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;REST Collection Service&lt;/strong&gt; kavramını biraz a&amp;ccedil;mamızda yarar var. Starter Kit ile birlikte &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; ortamına&amp;nbsp;bir proje şablonu olarak gelen bu yapı, &lt;strong&gt;REST&lt;/strong&gt; modeline g&amp;ouml;re veri k&amp;uuml;melerinin, servis tarafında koleksiyon bazlı olaraktan ele alınmasını otomatikleştirmektedir. Veriler istemci tarafına &lt;strong&gt;XML&lt;/strong&gt; formatı dışında &lt;strong&gt;&lt;a title="JSON" href="http://www.json.org/json-tr.html" target="_blank"&gt;JSON(JavaScript Object Notation)&lt;/a&gt; &lt;/strong&gt;standartlarına g&amp;ouml;rede yayımlanabilir. Ayrıca daha &amp;ouml;nceki yazılarımızda değindiğimiz &lt;strong&gt;WebGet&lt;/strong&gt; niteliği ile &lt;strong&gt;UriTemplate'&lt;/strong&gt; ler oluşturulmasına gerek yoktur. &amp;Ccedil;&amp;uuml;nk&amp;uuml; buda hazır olarak gelmektedir. Bunlara ek olarak, &lt;strong&gt;HTTP POST, GET, DELETE&lt;/strong&gt; ve &lt;strong&gt;PUT&lt;/strong&gt; metodlarına cevap verecek şekilde bir &amp;ccedil;alışma zamanı alt yapısına sahiptir ki bu sayede Select dışında&amp;nbsp;Insert,Update,Delete gibi işlemleride yapabiliriz.&amp;nbsp;Tabiki request' leri doğru bir şekilde g&amp;ouml;nderebildiğimiz takdirde.&amp;nbsp;Şablonu &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; ortamında kullanmak son derece kolaydır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblg5_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında Lab i&amp;ccedil;erisindeki adımlarda ilerlerken ilk dikkat &amp;ccedil;eken noktalardan birisi, &lt;strong&gt;Service&lt;/strong&gt; tipinin &lt;strong&gt;CollectionServiceBase&amp;lt;TItem&amp;gt;&lt;/strong&gt; &lt;strong&gt;abstract&lt;/strong&gt; sınıfından t&amp;uuml;remesi ve &lt;strong&gt;ICollectionService&amp;lt;TItem&amp;gt;&lt;/strong&gt; &lt;strong&gt;aray&amp;uuml;z&amp;uuml;n&amp;uuml;(Interface)&lt;/strong&gt; uygulamasıydı. &lt;strong&gt;TItem&lt;/strong&gt; tipi koleksiyon i&amp;ccedil;erisinde kullanılacak veri tipini işaret etmektedir. CollectionServiceBase abstract sınıfı i&amp;ccedil;erisinde, Servis tipi tarafından uygulanması gereken bazı abstract metodlar yer almaktadır&lt;strong&gt;(OnGetItems, OnGetItem, OnAddItem, OnDeleteItem, OnUpdateItem)&lt;/strong&gt;. Diğer taraftan aray&amp;uuml;z&amp;uuml;n i&amp;ccedil;erisindede az &amp;ouml;nce belirttiğimiz metodların &lt;strong&gt;Json&lt;/strong&gt; ve &lt;strong&gt;Xml&lt;/strong&gt; formatları i&amp;ccedil;in olan tanımlamaları yer almaktadır. Aslında bir servis geliştirilirken bilindiği &amp;uuml;zere &lt;strong&gt;Servis S&amp;ouml;zleşmesi(Service Contract)&lt;/strong&gt; ve onu uygulayan asıl servis sınıfı ele alınmaktadır. &lt;strong&gt;REST Collection Service&lt;/strong&gt; şablonunda, s&amp;ouml;zleşme g&amp;ouml;revini &amp;uuml;stlenen aray&amp;uuml;z &lt;strong&gt;ICollectionService&amp;lt;TItem&amp;gt;&lt;/strong&gt; dır. Burada tanımlanan operasyonların sahip olduğu &lt;strong&gt;WebHelp, WebGet, WebInvoke&lt;/strong&gt; gibi niteliklerin i&amp;ccedil;eriklerinde istenirse oynamalar yapılabilir. Ancak şablon, bu niteliklere varsayılan değerlerini koyarak, hazır bir uygulanış bi&amp;ccedil;iminide sunmaktadır.&lt;/p&gt;
&lt;p&gt;Antrenmanı Lab &amp;uuml;zerinden adım adım yaparken, asıl veri kaynağı olarak neyi kullanacağımı d&amp;uuml;ş&amp;uuml;n&amp;uuml;yordum. Her zamanki gibi kolaya ka&amp;ccedil;ıp tembellik yaptığımdan, &lt;strong&gt;Northwind&lt;/strong&gt; veritabanında yer alan &lt;strong&gt;Products&lt;/strong&gt; tablosunu ve CUD işlemleri i&amp;ccedil;inde bir ka&amp;ccedil; &lt;strong&gt;SP&lt;/strong&gt; ile &lt;strong&gt;Enterprise Library&lt;/strong&gt; kullanmaya karar vermiştim. Genellikle profesyonel &amp;ccedil;aptaki projelerde basit CRUD işlemlerini Stored Procedure' ler i&amp;ccedil;erisine almak &amp;ccedil;ok sık yapılan bir şey değildir. Ancak amacım sadece bir veri k&amp;uuml;mesi kullanmak ve &lt;strong&gt;CUD(CreateUpdateDelete)&lt;/strong&gt; işlemlerini &lt;strong&gt;REST&lt;/strong&gt; modeli &amp;uuml;zerinden test etmek olduğu i&amp;ccedil;in bu durumu şimdilik g&amp;ouml;rmezden geldim.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Tabiki istenirse farklı veri kaynaklarıda koleksiyon bazlı olacak şekilde REST modeline g&amp;ouml;re servisleştirilebilir. &amp;Ouml;rneğin XML tabanlı bir veri kaynağı ele alınabilir yada program alanında tutulan bir koleksiyon. Nitekim servisin kullandığı Dictionary&amp;lt;string,TItem&amp;gt; koleksiyonu i&amp;ccedil;erisinde tutulan nesneler aslında veriyi sembolize eden birer entity olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmelidir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Neyse &amp;ccedil;ok fazla dağıtmadan konuyu devam edeyim. &lt;strong&gt;Stored Procedure&lt;/strong&gt;' leri temel &lt;strong&gt;CUD&lt;/strong&gt; işlemlerini ger&amp;ccedil;ekleştirmek &amp;uuml;zere aşağıdaki gibi tasarladım.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Ekleme işlemi&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;CREATE PROCEDURE InsertProduct
            @ProductName nvarchar(40)
           ,@SupplierID int
           ,@CategoryID int
           ,@QuantityPerUnit nvarchar(20)
           ,@UnitPrice money
           ,@UnitsInStock smallint
           ,@UnitsOnOrder smallint
           ,@ReorderLevel smallint
           ,@Discontinued bit
AS
INSERT INTO [Northwind].[dbo].[Products]
           (ProductName
           ,SupplierID
           ,CategoryID
           ,QuantityPerUnit
           ,UnitPrice
           ,UnitsInStock
           ,UnitsOnOrder
           ,ReorderLevel
           ,Discontinued
           )
     VALUES
           (
           @ProductName
           ,@SupplierID
           ,@CategoryID
           ,@QuantityPerUnit
           ,@UnitPrice
           ,@UnitsInStock
           ,@UnitsOnOrder
           ,@ReorderLevel
           ,@Discontinued
          ) 
Select SCOPE_IDENTITY()&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;G&amp;uuml;ncelleme işlemi&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;CREATE PROCEDURE UpdateProduct
    @ProductName nvarchar(40)
           ,@SupplierID int
           ,@CategoryID int
           ,@QuantityPerUnit nvarchar(20)
           ,@UnitPrice money
           ,@UnitsInStock smallint
           ,@UnitsOnOrder smallint
           ,@ReorderLevel smallint
           ,@Discontinued bit
           ,@ProductID int
AS

Update [Northwind].[dbo].[Products]
Set
           ProductName=@ProductName
           ,SupplierID=@SupplierID
           ,CategoryID=@CategoryID
           ,QuantityPerUnit=@QuantityPerUnit
           ,UnitPrice=@UnitPrice
           ,UnitsInStock=@UnitsInStock
           ,UnitsOnOrder=@UnitsOnOrder
           ,ReorderLevel=@ReorderLevel
           ,Discontinued=@Discontinued
Where
    ProductID=@ProductID&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Silme işlemi&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;CREATE PROCEDURE DeleteProduct
(
 @ProductID int 
)
AS
Delete From Products Where ProductID=@ProductID
RETURN&lt;/pre&gt;
&lt;p&gt;Daha sonrada Servis sınıfını aşağıdaki gibi yeniledim. Yeniledim diyorum, nitekim proje şablonu zaten i&amp;ccedil;erisinde hazır olarak bir uyarlama ger&amp;ccedil;ekleştirmekte ve &lt;strong&gt;SampleItem&lt;/strong&gt; isimli bir tipi koleksiyon i&amp;ccedil;erisinde kullanmaktadır. Ayrıca &lt;strong&gt;OnGetItems, OnGetItem, OnAddItem, OnUpdateItem&lt;/strong&gt; ve &lt;strong&gt;OnDeleteItem&lt;/strong&gt; metodları i&amp;ccedil;inde hazır kodlamalar yer almaktadır. (Bu tip şablonların &lt;strong&gt;Visual Studio 2010&lt;/strong&gt; i&amp;ccedil;erisinde dahada otomatikleştirilmesi s&amp;ouml;z konusu olabilir.)&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Runtime.Serialization;
using System.ServiceModel;
using Microsoft.ServiceModel.Web;
using System.ServiceModel.Activation;
using System.Net;
using Microsoft.ServiceModel.Web.SpecializedServices;
using Microsoft.Practices.EnterpriseLibrary.Data;
using System.Data;

[assembly: ContractNamespace("", ClrNamespace = "NorthwindV2")]

namespace NorthwindV2
{
    [ServiceBehavior(IncludeExceptionDetailInFaults = true, InstanceContextMode = InstanceContextMode.Single, ConcurrencyMode = ConcurrencyMode.Single)]
    [AspNetCompatibilityRequirements(RequirementsMode = AspNetCompatibilityRequirementsMode.Allowed)]
    public class Service 
        : CollectionServiceBase&amp;lt;Product&amp;gt;, ICollectionService&amp;lt;Product&amp;gt;
    {
        // products isimli Dictionary koleksiyonunda Product nesne &amp;ouml;rnekleri value, ProductID değerleri ise key olarak tutulmakta.
        Dictionary&amp;lt;string, Product&amp;gt; products = new Dictionary&amp;lt;string, Product&amp;gt;();
        // Enterprise Library' den yararlanarak Database nesnesi &amp;uuml;retiliyor.
        Database db = DatabaseFactory.CreateDatabase("NorthConStr");

        // Bu metod ile istemci tarafından gelecek talep sonrasında t&amp;uuml;m &amp;uuml;r&amp;uuml;nlerin istenilen formatta g&amp;ouml;sterilmesi sağlanmaktadır.
        // CategoryID değeri null olmayan satırlar &amp;ccedil;ekilir ve IDataReader &amp;uuml;zerinden Product nesnesi şeklinde oluşturulan &amp;ouml;rnekler, products koleksiyonuna eklenerek geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;r.
        // http://localhost:1000/Service.svc talebi sonrası bu metod devreye girer.
        protected override IEnumerable&amp;lt;KeyValuePair&amp;lt;string, Product&amp;gt;&amp;gt; OnGetItems()
        {            
            IDataReader reader = db.ExecuteReader(CommandType.Text, "Select * From Products where CategoryID is not null");

            while (reader.Read())
            {
                products.Add(reader["ProductID"].ToString(),
                    new Product
                    {
                        ProductID=Convert.ToInt32(reader["ProductID"]), 
                        CategoryID=Convert.ToInt32(reader["CategoryID"]),
                          Discontinued=Convert.ToBoolean(reader["Discontinued"]),
                           ProductName=reader["ProductName"].ToString(),
                            QuantityPerUnit=reader["QuantityPerUnit"].ToString(),
                             ReorderLevel=Convert.ToInt16(reader["ReorderLevel"]),
                              SupplierID=Convert.ToInt32(reader["SupplierID"]),
                               UnitPrice=Convert.ToDecimal(reader["UnitPrice"]),
                                UnitsInStock=Convert.ToInt16(reader["UnitsInStock"]),
                                 UnitsOnOrder=Convert.ToInt16(reader["UnitsOnOrder"])                           
                    }
                    );
            }
            return this.products;
        }

        // Id değeri &amp;uuml;zerinden bir Product' ın elde edilip geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi i&amp;ccedil;in kullanılır. &amp;Ouml;zellikle Update metodunda dahili olaraktan kullanılmaktadır.
        // Yani http://localhost:1000/Service.svc/4 gibi bir talep sonrası bu metod devreye girmektedir.
        protected override Product OnGetItem(string id)
        {
            int productId;
            // int tipinden olmayan bir ProductId değeri ise
            if (!Int32.TryParse(id, out productId))
            {
                // Exception fırlatılır
                throw new WebProtocolException(HttpStatusCode.BadRequest);
            }
            return this.products[id];
        }

        // Yeni bir Product tipinin eklenmesi i&amp;ccedil;in kullanılan bu metoddan geriye, yeni oluşturulan satırın ProductID değeri d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;r(eğer işlemler başarılı ise)
        protected override Product OnAddItem(Product initialValue, out string id)
        {
            try
            {
                id = db.ExecuteScalar("InsertProduct", initialValue.ProductName, initialValue.SupplierID, initialValue.CategoryID, initialValue.QuantityPerUnit, initialValue.UnitPrice, initialValue.UnitsInStock, initialValue.UnitsOnOrder, initialValue.ReorderLevel, initialValue.Discontinued).ToString();
                initialValue.ProductID = Convert.ToInt32(id);
                this.products.Add(id, initialValue);
            }
            catch(Exception excp)
            {
                throw new WebException(excp.Message.ToUpper(), WebExceptionStatus.RequestCanceled);
            }            
            return initialValue;
        }

        // Bir Product' ın g&amp;uuml;ncelleştirilmesi işlemi sırasında kullanılan metoddur. Metod başarılı bir şekilde g&amp;uuml;ncelleştirme işlemini yaparsa geriye Product tipinin son hali d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;r.
       protected override Product OnUpdateItem(string id, Product newValue)
       {       
            int result = 0;
            try
            {
                result = db.ExecuteNonQuery("UpdateProduct", newValue.ProductName, newValue.SupplierID, newValue.CategoryID, newValue.QuantityPerUnit, newValue.UnitPrice, newValue.UnitsInStock, newValue.UnitsOnOrder, newValue.ReorderLevel, newValue.Discontinued, Convert.ToInt32(id));
            }
            catch (Exception excp)
            {
                throw new WebException(excp.Message, WebExceptionStatus.RequestCanceled);
            }

            if (oldValue == null) // Eğer veri kaynağında g&amp;uuml;ncelleştirilecek bir Product nesnesi yoksa istisna mesajı verilir.
            {
                throw new WebProtocolException(HttpStatusCode.NotFound);
            }
           
            int result=db.ExecuteNonQuery("UpdateProduct", newValue.ProductName, newValue.SupplierID, newValue.CategoryID, newValue.QuantityPerUnit, newValue.UnitPrice, newValue.UnitsInStock, newValue.UnitsOnOrder, newValue.ReorderLevel, newValue.Discontinued, newValue.ProductID);

            if (result == 1) // ProductID değerleri Auto Identity tipinden olduklarında g&amp;uuml;ncelleştirilen kayıt sayısı 1 ise
            {                
                // products koleksiyonundaki değer g&amp;uuml;ncellenir
                this.products[id] = newValue;
                // g&amp;uuml;ncellenen değerlere sahip Product tipi geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;r.
                return newValue;
            }
            else
                return null; // Aksi durumda null d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;r
        }

        // Bir Product' ın silinmesi i&amp;ccedil;in kullanılan metoddur. Silme işleminin başarılı olması halinde true değeri d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;r.
        protected override bool OnDeleteItem(string id)
        {
            // İlk olarak silinmek istenen id değerine sahip Product tipi &amp;ccedil;ekilir
            Product item = OnGetItem(id);
            // Eğer ilgili Product null ise false değer d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;r
            if (item == null) 
                return false;
            // Eğer var ise Products tablosundan silme işlemi yapılır
            int result=db.ExecuteNonQuery("DeleteProduct", id);
            // Eğer 1 satır silinebildiyse,
            if (result == 1)
            {
                // products koleksiyonundan da &amp;ccedil;ıkartma işlemi yapılır.
                this.products.Remove(id);
                return true;
            }
            else
                return false;
        }
    }

    // Koleksiyon i&amp;ccedil;erisinde kullanılan Product sınıfı.
    public class Product
    {
        public int ProductID { get; set; }
        public string ProductName { get; set; }
        public int SupplierID { get; set; }
        public int CategoryID { get; set; }
        public string QuantityPerUnit { get; set; }
        public decimal UnitPrice { get; set; }
        public short UnitsInStock { get; set; }
        public short UnitsOnOrder { get; set; }
        public short ReorderLevel { get; set; }
        public bool Discontinued { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Artık herşey test i&amp;ccedil;in hazırdı. İlk etapta &lt;strong&gt;1000&lt;/strong&gt; numaralı port &amp;uuml;zerinden hizmet verecek olan servisi F5 ile &amp;ccedil;alıştırdım. &lt;strong&gt;Lab&lt;/strong&gt; i&amp;ccedil;erisinde s&amp;ouml;z konusu &lt;strong&gt;REST&lt;/strong&gt; servisinin testi sırasında &lt;strong&gt;Post, Put, Delete&lt;/strong&gt; talepleri i&amp;ccedil;in bir istemci uygulama yerine Fiddler aracı kullanılmaktaydı. Yani yeni bir &amp;uuml;r&amp;uuml;n eklemek, silmek veya g&amp;uuml;ncellemek istediğimde istemci tarafından g&amp;ouml;nderilecek olan &lt;strong&gt;HTTP&lt;/strong&gt; paketini &lt;strong&gt;Fiddler&lt;/strong&gt; aracı yardımıyla hazırlayıp g&amp;ouml;nderilmesi &amp;ouml;neriliyordu. Bu sadece test&amp;nbsp;ve i&amp;ccedil;erik analizi i&amp;ccedil;in bir &amp;ouml;neriydi.&amp;nbsp;Ancak daha o adımlara ge&amp;ccedil;meden &amp;ouml;nce ilk hata mesajım ile karşılaştım. İlk etapta sorun yok gibi g&amp;ouml;r&amp;uuml;n&amp;uuml;yordu. Ancak aynı servisi ikinci bir tarayıcı penceresinden talep ettiğimde aşağıdaki g&amp;ouml;r&amp;uuml;nt&amp;uuml; ile karşılaştım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblg5_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hata nerededir diye araştırırken aslında her talepte &lt;strong&gt;OnGetItems&lt;/strong&gt; metodunun &amp;ccedil;ağırıldığını ve bu sebeple koleksiyona veri ekleme işleminden &amp;ouml;nce aslında temizlenmesi gerektiğini farkettim. Dolayısıyla kodu aşağıdaki halde yenilemek sorunu &amp;ccedil;&amp;ouml;zd&amp;uuml;.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected override IEnumerable&amp;lt;KeyValuePair&amp;lt;string, Product&amp;gt;&amp;gt; OnGetItems()
{            
  products.Clear(); // Temizlemediğimizde ikinci bir request i&amp;ccedil;in hata mesajı alınır.            
  IDataReader reader = db.ExecuteReader(CommandType.Text, "Select * From Products where CategoryID is not null");&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;Tabii burada servisin &amp;ccedil;ok sık değişmeyen bir koleksiyonu yayınlaması durumunda, her talep i&amp;ccedil;in veritabanından bir Select sorgusu ile veri &amp;ccedil;ekmesi yerine, performansı arttırmak i&amp;ccedil;in belki &amp;ouml;nbellekleme(Caching) sistemi kullanılabilir. Nitekim servis, sonu&amp;ccedil; itibariyle Asp.Net Host ortamında sunulmaktadır. Bu nedenle Cache mimarisini ele alabilir. Hatta SqlCacheDependency kullanılarak Cache i&amp;ccedil;eriğinin ger&amp;ccedil;ekten tabloda değişiklik olduğu durumlarda ele alınmasıda sağlanabilir. Bu durumu ilerleyen yazılarımızda ele almayı planlıyorum.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Son sorunu &amp;ccedil;&amp;ouml;zd&amp;uuml;kten sonra hemen yeni bir satır Product eklemeye karar verdim. Aynen Lab' da belirtildiği gibi, paketi manuel olarak Fiddler aracı ile hazırlayıp servise g&amp;ouml;nderim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblg5_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Burada talep metodunun &lt;strong&gt;POST&lt;/strong&gt; olarak se&amp;ccedil;ildiğine, &lt;strong&gt;Content&lt;/strong&gt; tipinin&lt;strong&gt; text/xml&lt;/strong&gt; olarak belirtildiğine dikkat etmek lazım. Diğer tarafında &lt;strong&gt;RequestBody&lt;/strong&gt; kısmında manuel olarak yazdığımız &lt;strong&gt;XML&lt;/strong&gt; i&amp;ccedil;eriğinde &lt;strong&gt;ProductID&lt;/strong&gt; değeri yazmadığımı da belirtelim. Nitekim, &lt;strong&gt;ProductID&lt;/strong&gt; otomatik artan ve insert sorgusuna dahil edilmeyen bir alandır. Ancak ne varki &lt;strong&gt;Execute&lt;/strong&gt; işleminden sonra servis tarafından &lt;strong&gt;307&lt;/strong&gt; kodlu bir cevap gelmiştir&lt;strong&gt;(Temporary Redirect).&lt;/strong&gt;&amp;nbsp;&lt;img title="Frown" src="/editors/tiny_mce3/plugins/emotions/img/smiley-frown.gif" alt="Frown" border="0" /&gt; Oysaki &lt;strong&gt;201&lt;/strong&gt; cevabının gelmesi gerekirdi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblg5_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu hatayla uzun bir s&amp;uuml;re&amp;nbsp;cebelleştikten sonra, sorunun adres kısmını yanlış yazmamdan kaynaklandığını tespit ettim. Yani adresin&amp;nbsp;&lt;strong&gt;http://buraksenyurt:1000/Service.svc&lt;/strong&gt; adresinin &lt;strong&gt;http://buraksenyurt:1000/Service.svc&lt;span style="font-size: large;"&gt;/&lt;/span&gt;&lt;/strong&gt; olarak yazılması gerekiyormuş. Tamamen benim hatam...Adresi bu şekilde d&amp;uuml;zelttikten sonra insert işleminin ger&amp;ccedil;ekleştirildiğini ve hem koleksiyonda hemde Products tablosunda yeni Product tipi i&amp;ccedil;in gerekli eklemelerin yapıldığını g&amp;ouml;rebildim.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Fiddler g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblg5_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Tarayıcı g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblg5_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;SQL Tarafı&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblg5_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Artık g&amp;uuml;ncelleme ve silme işlemlerini tespit edebilirdim. G&amp;uuml;ncelleştirme işlemi sırasında dikkat etmem gereken noktalardan ilki, &lt;strong&gt;HTTP&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml;n&amp;nbsp;&lt;strong&gt;Put&lt;/strong&gt; metodunu kullanmam gerektiğiydi. Ancak ilk denemede yine patlayınca aslında g&amp;uuml;ncelleştirmek istediğim satırın &lt;strong&gt;ProductID&lt;/strong&gt; değerini &lt;strong&gt;Request Body&lt;/strong&gt; i&amp;ccedil;erisindeki &lt;strong&gt;XML&lt;/strong&gt; kısmında değil, &lt;strong&gt;URL&lt;/strong&gt; kısmında belirtmem gerektiğini farkettim. &lt;img title="Embarassed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-embarassed.gif" alt="Embarassed" border="0" /&gt;&amp;nbsp;Buna g&amp;ouml;re &lt;strong&gt;Fiddler&lt;/strong&gt; aracı yardımıyla aşağıdaki talebi g&amp;ouml;nderdiğimde,&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblg5_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;servis tarafından &lt;strong&gt;200-Ok&lt;/strong&gt; cevabını alabildiğimi g&amp;ouml;rd&amp;uuml;m.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblg5_9.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&amp;nbsp;İşte mutluluğun resmi.&lt;/p&gt;
&lt;p&gt;Resmi tamamlamak i&amp;ccedil;in son olarak&amp;nbsp;&lt;strong&gt;delete&lt;/strong&gt; işlemini test etmem gerekiyordu. Bu sefer &lt;strong&gt;HTTP&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml; kullanarak g&amp;ouml;ndereceğim talepte, &lt;strong&gt;Delete&lt;/strong&gt; metodunu se&amp;ccedil;mem gerektiğini biliyordum. Ayrıca silmek istediğim &lt;strong&gt;Product&lt;/strong&gt; satırının &lt;strong&gt;ProductID&lt;/strong&gt; değerinide bir &amp;ouml;nceki &lt;strong&gt;Update&lt;/strong&gt; işlemine g&amp;ouml;re &lt;strong&gt;URL&lt;/strong&gt; satırından g&amp;ouml;ndermem gerektiğinin farkındaydım. Hatta &lt;strong&gt;Request'&lt;/strong&gt; in &lt;strong&gt;body&lt;/strong&gt; kısmında herhangibir bilgi olmaması gerektiğinide tahmin edebilmiştim.&amp;nbsp;Dolayısıyla tek seferde &amp;ccedil;alıştırabileceğim d&amp;uuml;ş&amp;uuml;ncesindeydim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblg5_10.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İşte bu kadar. Bir maceramızın daha sonuna geldik. &lt;strong&gt;REST&lt;/strong&gt; bazlı &lt;strong&gt;WCF&lt;/strong&gt; servislerinin kullanımı ile ilişkili &amp;ccedil;alışmalarıma ve araştırmalarıma devam ederken bunları sizlerlede paylaşıyor olacağım. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek Uygulama ; &lt;a href="/pics/2009%2f4%2fNorthwindV2.rar"&gt;NorthwindV2.rar (322,50 kb)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Sp ler i&amp;ccedil;in script dosyası : &lt;a href="/pics/2009%2f4%2fscript.sql"&gt;script.sql (4,65 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-04-22 08:07:00</pubDate>
  <slug>Koleksiyon-Bazlı-WCF-Rest-Servisleri</slug>
  <tags>
    <tag>wcf</tag>
    <tag>rest</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>