<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Bağlantısız Katmanda Concurrency Violation Durumu</title>
  <description>Bağlantısız katman nesneleri ile çalışırken karşılaşabileceğimiz problemlerden bir tanesi güncelleme işlemleri sırasında oluşabilecek DBConcurrencyException istisnasıdır. Bu makalemizde, bu hatanın fırlatılış nedenini inceleyecek ve alabileceğimiz tedbirleri ele almaya çalışacağız. Öncelikle istisnanın ne olduğunu anlamak ile işe başlayalım. Bir DataAdapter nesnesine ait Update metodu güncelleme işlemleri için Optimistic(iyimser) yaklaşımı kullanan sql sorgularını çalıştırıyorsa DBConcurrencyException istisnasının ortama fırlatılması, başka bir deyişle Concurrency Violation (eş zamanlı uyumsuzluk) durumunun oluşması son derece doğaldır.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bağlantısız katman nesneleri ile &amp;ccedil;alışırken karşılaşabileceğimiz problemlerden bir tanesi g&amp;uuml;ncelleme işlemleri sırasında oluşabilecek DBConcurrencyException istisnasıdır. Bu makalemizde, bu hatanın fırlatılış nedenini inceleyecek ve alabileceğimiz tedbirleri ele almaya &amp;ccedil;alışacağız. &amp;Ouml;ncelikle istisnanın ne olduğunu anlamak ile işe başlayalım. Bir DataAdapter nesnesine ait Update metodu g&amp;uuml;ncelleme işlemleri i&amp;ccedil;in Optimistic(iyimser) yaklaşımı kullanan sql sorgularını &amp;ccedil;alıştırıyorsa DBConcurrencyException istisnasının ortama fırlatılması, başka bir deyişle Concurrency Violation (eş zamanlı uyumsuzluk) durumunun oluşması son derece doğaldır.&lt;/p&gt;
&lt;table id="table3" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;Optimistic yaklaşım modeli, Pessimistic&lt;/strong&gt; &lt;strong&gt; yaklaşım modelinin aksine g&amp;uuml;ncellenecek satırları kilitlemez. Buda sunucunun kilit a&amp;ccedil;ma, takip ve kapatma gibi işlemleri yapmaması dolayısıyla performansının artması anlamına gelir. &amp;Ouml;zellikle bağlantısız katman mimarisinde kullanılan optimistic yaklaşım modelinde tek sorun, g&amp;uuml;ncelleme işlemlerini ger&amp;ccedil;ekleştiren kullanıcıların bu işleri birbirlerinden habersiz şekilde yapmaları sonucu ortaya &amp;ccedil;ıkabilecek durumlardır.&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;&amp;Ouml;rneğin belli bir satıra ait verileri g&amp;uuml;ncellemek i&amp;ccedil;in kullanabileceğimiz aşağıdaki Sql sorgusunu ele alalım.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;UPDATE MAILS SET AD=@AD,SOYAD=@SOYAD,EMAIL=@EMAIL WHERE ID=@ORGID AND AD=@ORGAD AND SOYAD=@ORGSOYAD AND EMAIL=@ORGEMAIL&lt;/pre&gt;
&lt;p&gt;Sorgumuz basit&amp;ccedil;e, MAILS isimli veritabanındaki AD, SOYAD ve EMAIL alanlarının değerlerini g&amp;uuml;ncellemektedir. Bunu yaparkende optimistic (iyimser) yaklaşımını kullanır. Bu nedenle, Where koşulunda tabloya ait primary key alanı (ID) dahil olmak &amp;uuml;zere t&amp;uuml;m alanlar kullanılmaktadır. B&amp;ouml;ylece t&amp;uuml;m alanların eşleştirme i&amp;ccedil;in kullanıldığı bir sorgu ortaya &amp;ccedil;ıkar.&lt;/p&gt;
&lt;table id="table9" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td valign="top" width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;Optimistic yaklaşımda ele alınan yukarıdaki sorgu modeli i&amp;ccedil;in Sql Server ve benzeri veritabanı sistemlerinde daha etkili y&amp;ouml;ntemlerde vardır. &amp;Ouml;rneğin Sql &amp;uuml;zerinde &lt;strong&gt;timestamp&lt;/strong&gt; tipinden (yada &lt;strong&gt;uniqueIdentifier&lt;/strong&gt; tipinden) alanlar kullanılabilir. Timestamp t&amp;uuml;r&amp;uuml;nden olan alanlar satır &amp;uuml;zerinde yapılacak herhangibir g&amp;uuml;ncelleme işleme sonrasında sistem tarafından otomatik olarak benzersiz bir karakter dizisi ile değiştirilen alanlardır. B&amp;ouml;ylece yukarıdaki sorgunun yaptığı işin aynısını aşağıdaki gibide yapabiliriz. (Buradaki Kontrol alanı tipi timestamp tipindendir.
&lt;p&gt;Update Mails Set Ad=@Ad,Soyad=@Soyad,Email=@Email &lt;strong&gt;Where Id=@OrgId&lt;/strong&gt; And &lt;strong&gt; Kontrol=@Kontrol&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Bu ifadenin bize sağladığı en b&amp;uuml;y&amp;uuml;k avantaj elbetteki n sayıda alan i&amp;ccedil;eren bir tabloda where ifadesinden sonra sadece iki alan kontrol&amp;uuml; ile (primary key ve timestamp alanı) Concurrency Violation durumunu irdeleyebilecek olmamızdır. Biz makalemizde daha uzun olan yolu incelemeye &amp;ccedil;alışacağız. Lakin ger&amp;ccedil;ek hayat modellerinde &lt;strong&gt;timestamp&lt;/strong&gt; veya &lt;strong&gt;uniqueidentifier&lt;/strong&gt; ve benzeri tipten alanların karşılaştırma işlemi i&amp;ccedil;in ele alınması daha doğru ve g&amp;uuml;&amp;ccedil;l&amp;uuml; bir yaklaşım olacaktır.&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;B&amp;ouml;yle bir sorgunun neden olacağı istisnai durumu anlayabilmek i&amp;ccedil;in aşağıdaki senaryoyu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almakta fayda olacağı inancındayım. Senaryomuzda en az iki kullanıcı rol almaktadır. Bu kullanıcılarımıza A ve B takma isimlerini verdiğimizi d&amp;uuml;ş&amp;uuml;nelim. Her iki kullanıcıda database' den MAILS tablosundaki verileri bağlantısız katmana DataAdapter sınıfına ait nesne &amp;ouml;rneği vasıtasıyla almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk116_2.gif" alt="" width="582" height="468" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;A ve B verileri &amp;ccedil;ektikten sonra, A kullanıcısı herhangibir satır &amp;uuml;zerinde g&amp;uuml;ncelleme işlemini uygular. Bu durumda DataAdapter nesnesinin UpdateCommand &amp;ouml;zelliğine karşılık gelen SqlCommand nesnesi, yukarıda yazdığımız sorguyu &amp;ccedil;alıştıracaktır. Bu sorguda, satırların orjinal değerleri ile veritabanındaki halleri aynı olacağından g&amp;uuml;ncelleme işlemi başarılı bir şekilde ger&amp;ccedil;ekleştirilecektir. Lakin B kullanıcısı şu anda, A' nın g&amp;uuml;ncellemiş olduğu veri k&amp;uuml;mesinin eski haline bakmaktadır. Eğer B kullanıcısı, A kullanıcısının biraz &amp;ouml;nce g&amp;uuml;ncellemiş olduğu satırı tekrar g&amp;uuml;ncellemek isterse ne olacaktır?&lt;/p&gt;
&lt;p&gt;İşte bu durumda, sorgu i&amp;ccedil;indeki where koşuluna giren alan değerlerinin bağlantısız katmandaki orjinal halleri &lt;em&gt;(yani &lt;strong&gt;DataRowVersion&lt;/strong&gt; numaralandırıcısı tipinden &lt;strong&gt;Original&lt;/strong&gt; olan değerleri),&lt;/em&gt; veritabanındaki tabloda az &amp;ouml;nce g&amp;uuml;ncelleştirilmiş olan alanlara ait yeni değerler ile eşleşmeyeceğinden ilgili satır bulunamayacaktır. Bu da B kullanıcısının satırı update edememesine neden olur. Bu noktada CLR, DbConcurrencyException t&amp;uuml;r&amp;uuml;nden bir istisnayı process i&amp;ccedil;ine fırlatacaktır. Dilerseniz bu hatayı basit bir uygulama yardımıyla elde etmeye &amp;ccedil;alışalım. Uygulamamız şimdilik sadece Update işlevini ele alacaktır. İlk olarak basit bir windows uygulaması a&amp;ccedil;arak aşağıdakine benzer bir form ekranı oluşturalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk116_3.gif" alt="" width="420" height="256" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulamamız aşağıdaki field yapısına sahip olan ve Sql sunucusu &amp;uuml;zerinde barındırdığımız MAILS tablosunu kullanacaktır. Tablomuzdaki ID alanı otomatik artan bir primary key olarak tanımlanmıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk116_4.gif" alt="" width="376" height="114" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdide uygulama kodlarımızı yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection con;
SqlDataAdapter da;
DataSet ds;

/* SqlConnection nesnemizi oluşturduğumuz metodumuz. Bu metotda bağlantı bilgisini App.Config dosyasında tuttuğumuz connectionString isimli key' e ait value &amp;ouml;zelliğinden alıyoruz.*/
private void BaglantiHazirla()
{
    try
    {
        con=new SqlConnection(ConfigurationSettings.AppSettings["connectionString"].ToString());
    }
    catch(SqlException hata)
    {
        MessageBox.Show(hata.Message);
    }
}

/* Verileri y&amp;uuml;kleyen metodumuz parametre olarak aldığı string bilgiyi kullanan bir SqlDataAdapter nesnesi oluşturuyor. Daha sonra bu nesne yardımıyla DataSet' imiz dolduruluyor. Son olarak DataSet i&amp;ccedil;indeki tablomuza ait primary key kolonu belirleniyor.*/
private void VerileriYukle(string sorguCumlesi)
{
    BaglantiHazirla();
    da=new SqlDataAdapter(sorguCumlesi,con);
    ds=new DataSet();
    da.Fill(ds);
    ds.Tables[0].PrimaryKey=new DataColumn[]{ds.Tables[0].Columns["ID"]};
}

/* Veri &amp;Ccedil;ek başlıklı butona tıklandığında, MAILS tablosundaki t&amp;uuml;m verileri &amp;ccedil;ekeceğimiz sorguyu &amp;ccedil;alıştıracak VerileriYukle metodunu &amp;ccedil;ağırıyor ve sonu&amp;ccedil; k&amp;uuml;mesini DataGrid kontrol&amp;uuml;m&amp;uuml;ze bağlıyoruz. Ardından eğer SqlConnection nesnemiz a&amp;ccedil;ık ise kapatıyoruz.*/
private void btnVeriCek_Click(object sender, System.EventArgs e)
{
    VerileriYukle("SELECT * FROM MAILS");
    dgVeriler.DataSource=ds.Tables[0];
    if(con.State==ConnectionState.Open)
    {
        con.Close();
    }
}

/* VeriG&amp;uuml;ncelle metodu Update sorgusunu bizim tanımladığımız SqlDataAdapter nesnesini kullanarak g&amp;uuml;ncelleme işlemini ger&amp;ccedil;ekleştiriyor.*/
private void VeriGuncelle()
{
    try
    {
        string guncellemeCumlesi="UPDATE MAILS SET AD=@AD,SOYAD=@SOYAD,EMAIL=@EMAIL WHERE ID=@ORGID AND AD=@ORGAD AND SOYAD=@ORGSOYAD AND EMAIL=@ORGEMAIL";
        // Timestamp alanı olduğunda : Update Mails Set Ad=@Ad,Soyad=@Soyad,Email=@Email Where Id=@ORGID AND KONTROL=@KONTROL
        SqlCommand cmdUpdate=new SqlCommand(guncellemeCumlesi,con);
        /* Sorgumuz i&amp;ccedil;in gerekli parametreleri ekliyoruz. Parametre adlarını, veri tiplerini, boyutlarını ve DataTable daki hangi alanı source olarak alacaklarını belirliyoruz.*/
        cmdUpdate.Parameters.Add("@AD",SqlDbType.NVarChar,50,"AD");
        cmdUpdate.Parameters.Add("@SOYAD",SqlDbType.NVarChar,50,"SOYAD");
        cmdUpdate.Parameters.Add("@EMAIL",SqlDbType.NVarChar,50,"EMAIL");

        /* WHERE koşulunda kullanılan parametreleri giriyoruz. Burada parametre değerlerimiz field' ların orjinal değerleri olacak. Bunu sağlamak i&amp;ccedil;in SourceVersion &amp;ouml;zelliğine DataRowVersion numaralandırıcısının Original değerini atıyoruz.*/
        cmdUpdate.Parameters.Add("@ORGID",SqlDbType.NVarChar,50,"ID");
        cmdUpdate.Parameters["@ORGID"].SourceVersion=DataRowVersion.Original;
        cmdUpdate.Parameters.Add("@ORGAD",SqlDbType.NVarChar,50,"AD");
        cmdUpdate.Parameters["@ORGAD"].SourceVersion=DataRowVersion.Original;
        cmdUpdate.Parameters.Add("@ORGSOYAD",SqlDbType.NVarChar,50,"SOYAD");
        cmdUpdate.Parameters["@ORGSOYAD"].SourceVersion=DataRowVersion.Original;
        cmdUpdate.Parameters.Add("@ORGEMAIL",SqlDbType.NVarChar,50,"EMAIL");
        cmdUpdate.Parameters["@ORGEMAIL"].SourceVersion=DataRowVersion.Original;
// Where c&amp;uuml;mleciğinden timestamp veya uniqueIdentifier kullanıldığında yukarudaki parametre tanımlamaları yerine sadece Kontrol alanı i&amp;ccedil;in tek bir parametre tanımlamasının yapılması yeterli olacaktır.
        // cmdUpdate.Parameters.Add("@KONTROL",SqlDbType.Timestamp,8,"KONTROL");
        // cmdUpdate.Parameters["@KONTROL"].SourceVersion=DataRowVersion.Original;

        da.UpdateCommand=cmdUpdate;

        /* Son olarak Update metodunu &amp;ccedil;alıştırıyoruz.*/
        da.Update(ds);
    }
    catch(SqlException hata)
    {
        MessageBox.Show(hata.Message);
    } 
}

private void btnGuncelle_Click(object sender, System.EventArgs e)
{
    VeriGuncelle();
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızdan iki tane &amp;ccedil;alıştırdığımızı ve &amp;ouml;rneğin AD alanı A ve SOYAD alanı B olan satırların değerlerini sırasıyla ALİ ile VELİ olarak değiştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim. Eğer G&amp;uuml;ncelle butonuna tıklarsak işlemin başarılı bir şekilde ger&amp;ccedil;ekleştirildiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk116_1.gif" alt="" width="431" height="530" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi ikinci kullanıcımız aynı satırın verilerini değiştirsin ve yine G&amp;uuml;ncelle butonuna bassın. Bu durumda aşağıdaki gibi bir istisna mesajını alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk116_5.gif" alt="" width="485" height="561" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ikinci kullanıcı update işlemini ger&amp;ccedil;ekleştirmeye &amp;ccedil;alıştığında Concurrency Violation (eş zamanlı uyumsuzluk) durumu oluşacaktır. Bu belirleyici olarak DBConcurrencyException t&amp;uuml;r&amp;uuml;nden bir istisnadır. Peki oluşan bu istisnai durumun &amp;uuml;stesinden nasıl gelebiliriz? İlk akla gelen y&amp;ouml;ntem, istisna yakalandığında kullanıcıların verilerin en g&amp;uuml;ncel hallerini elde etmeleri konusunda uyarılmalarını sağlamak olacaktır. Ancak bağlantısız katman &amp;uuml;zerinde &amp;ccedil;alışırken, ikinci kullanıcılar bu &amp;ouml;rnekte olduğu gibi tek bir satırı g&amp;uuml;ncellemek dışında yeni satır girişleri, satır silmeler ve hatta başka satır g&amp;uuml;ncellemeleri gibi birden fazla sayıda işlemi ger&amp;ccedil;ekleştirmiş olabilirler.&lt;/p&gt;
&lt;p&gt;Eğer g&amp;uuml;ncelleme yapılan kod satırlarını istisna yakalama mekanizmaları ile izlemez ve DbConcurrencyException hatasını yakalamazsak, kullanıcının o ana kadar yaptığı t&amp;uuml;m değişiklikler uygulamanın istem dışı sonlanması nedeni ile kaybolacaktır. Bu elbetteki istenen bir durum değildir.&amp;nbsp; Alternatif bir yol olarak, DataAdapter nesnesinin &lt;strong&gt; ContinueUpdateOnError&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;true&lt;/strong&gt; değeri verilebilir. Bu durumda Update işlemi sırasında oluşacak olan hatalar g&amp;ouml;z ardı edilecektir. Yani Concurrency' ye neden olan satırlar var ise, bunların oluşturdukları istisnalar ortama fırlatılmayacaktır. &amp;Ouml;rneğimize bu durumu sim&amp;uuml;le edebileceğimiz bir checkBox kontrol&amp;uuml; koyalım. Kullanıcı bu kutucuğu işaretler ise update işlemi sırasında oluşacak olan Concurrency Violation (eş zamanlı uyumsuzluk) istisnası g&amp;ouml;rmezden gelinecektir. İlgili metodumuza ait kodlarımızı aşağıdaki gibi değiştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnGuncelle_Click(object sender, System.EventArgs e)
{
    if(chkContinueUpdateOnError.Checked==true)
    {
        da.ContinueUpdateOnError=true;
        VeriGuncelle();
    }
    else if(chkContinueUpdateOnError.Checked==false)
    {
        da.ContinueUpdateOnError=false;
        VeriGuncelle();
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi, yine Concurrency olayına neden olacak şekilde değişiklikler yapalım. Yani her iki kullanıcımızda verileri &amp;ccedil;ektikten sonra, birinci kullanıcımız belli bir satırı g&amp;uuml;ncellesin. Ardından ikinci kullanıcımız aynı satırı tekrar g&amp;uuml;ncellemeye &amp;ccedil;alışsın. Bu durumda her hangibir istisna fırlatılmaz ve uygulama istem dışı bir şekilde sonlanmaz. Dahası, ikinci kullanıcının yaptığı başka değişiklikler eğer var ise veritabanına başarılı bir şekilde yansıtılır.&lt;/p&gt;
&lt;p&gt;Ancak halen daha sorunlu olan satıra ait kullanıcı yeterli bilgiye sahip değildir. &lt;em&gt;(Her ne kadar DataGrid bunu &amp;uuml;nlem işaretleriyle belirtsede başka kontroller i&amp;ccedil;in bu &amp;ouml;zelliği sağlayamayabiliriz.) &lt;/em&gt;&amp;Ouml;rneğin kullanıcıyı hangi satırların Concurrency Violation (eş zamanlı uyumsuzluk) istisnasına neden olduğu konusunda daha detaylı bir şekilde uyarabiliriz. Burada DBConcurrencyException sınıfının prototipi aşağıdaki gibi olan Row &amp;ouml;zelliği işimize yarayabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public DataRow Row {get; set;}&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;zellik geriye hataya neden olan satırı işaret edebilecek bir DataRow nesne &amp;ouml;rneği d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. B&amp;ouml;ylece ilgili satıra ait detaylı bilgilere ulaşabiliriz. Ancak, istisnai durum Concurrency' e neden olan ilk satır g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde devreye girmektedir. Dolayısıyla ikinci kullanıcının elinde Concurrency istisnasına neden olacak birden fazla satır varsa t&amp;uuml;m bu satırları yakalamak i&amp;ccedil;in alternatif bir yol uygulamamız gerekmektedir. Ado.Net mimarisinde yer alan DataSet, DataTable ve DataRow sınıflarının &lt;strong&gt;HasErrors&lt;/strong&gt; &amp;ouml;zellikleri bu noktada bizim işimize yarayabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public bool HasErrors {get;}&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;zellik bool tipinden olup, herhangibir hata var ise geriye true değerini d&amp;ouml;nd&amp;uuml;recektir. Concurrency durumunu bu hatalar arasında sayabiliriz. Şimdi uygulama kodlarımıza aşağıdaki metodu ekleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void SonHaliAl()
{
    string satirBilgi;
    if(ds.Tables[0].HasErrors)
    {
        foreach(DataRow dr in ds.Tables[0].Rows)
        {
            if(dr.HasErrors)
            {
                satirBilgi=dr["AD"].ToString()+" "+dr["SOYAD"].ToString()+" Başkası tarafından değiştirilmiş. Satırın son halini elde etmek ister misiniz?";
                if(MessageBox.Show(satirBilgi,"Son hali al",MessageBoxButtons.YesNo,MessageBoxIcon.Question)==DialogResult.Yes)
                {
                    SqlCommand cmdSonHaliAl=new SqlCommand("SELECT * FROM MAILS WHERE ID="+(int)dr["ID"],con);
                    if(con.State==ConnectionState.Closed)
                    {
                        con.Open();
                    }
                    SqlDataReader drGuncelSatir=cmdSonHaliAl.ExecuteReader(CommandBehavior.SingleRow);
                    drGuncelSatir.Read(); 
                    dr.BeginEdit();
                    dr["ID"]=drGuncelSatir["ID"];
                    dr["AD"]=drGuncelSatir["AD"];
                    dr["SOYAD"]=drGuncelSatir["SOYAD"];
                    dr["EMAIL"]=drGuncelSatir["EMAIL"];
                    // Timestamp veya uniqueIdentifier tipinden bir alan kullandıysak (&amp;ouml;rneğimizdeki KONTROL alanı gibi) onuda g&amp;uuml;ncellememiz gerekir.
                    // dr["KONTROL"]=drGuncelSatir["KONTROL"];
                    dr.EndEdit();
                    con.Close();
                }
            }
        }
        ds.Tables[0].AcceptChanges();
    }
}&lt;/pre&gt;
&lt;p&gt;Bu metod ile ilk olarak dataTable' ın HasErrors &amp;ouml;zelliğine bakıyoruz. Eğer bir hata var ise, her bir satırı taramaya başlıyoruz. Her bir satırın HasErrors &amp;ouml;zelliğinin değerine bakarak hatalı satırları, bir başka deyişle Concurrency Violation (eş zamanlı uyumsuzluk)' a neden olanları buluyoruz. Sonra, hatalı satırın primary key olduğunu bildiğimiz ID değerini kullanarak ilgili satırın birinci kullanıcı tarafından g&amp;uuml;ncellenmiş olan halini &amp;ccedil;ekiyoruz. Bunu yaparkende SqlCommand ve SqlDataReader nesnelerimizi kullanıyoruz. Burada ID alanı primary key olduğundan ve benzersiz olarak satırları işaret edebildiğinden tek satır d&amp;ouml;neceğinden eminiz. Bu nedenle &lt;strong&gt; CommandBehavior&lt;/strong&gt; numaralandırıcısının &lt;strong&gt;SingleRow&lt;/strong&gt; değerini kullandık.&lt;/p&gt;
&lt;p&gt;Bu bize performans a&amp;ccedil;ısından ekstra zaman kazandıracaktır. Ardından Concurrency Violation (eş zamanlı uyumsuzluk) i&amp;ccedil;inde kalan satırın alanlarına ait değerleri, asıl veritabanından &amp;ccedil;ektiklerimiz ile değiştiriyoruz. İşte bu noktadan sonra eğer kullanıcı tekrarda aynı satırları update eder ise hi&amp;ccedil; bir problem ile karşılaşmayacaktır. Nitekim, satırların &lt;strong&gt;DataRowVersion.Original&lt;/strong&gt; değerleri veritabanındaki en g&amp;uuml;ncel halleri ile değiştirilmiş olacaktır. Dilersek, ikinci kullanıcının o ana kadar yapmış olduğu ve Concurrency Violation (eş zamanlı uyumsuzluk) altında kalan değişikliklerin tekrardan yazılmasını sağlayabiliriz.&lt;/p&gt;
&lt;p&gt;Tek yapmamız gereken Concurrency Violation (eş zamanlı uyumsuzluk)' de kalan alanların o anki değerlerini bir şekilde saklamak, alanların g&amp;uuml;ncel hallerini &amp;ccedil;ekerek orjinal değerleri yeni hallerine set etmek ve son olarak sakladığımız alan değerlerini tekrardan veritabanına g&amp;ouml;ndermektir. Yazdığımız SonHaliAl isimli metodu catch bloğu i&amp;ccedil;erisinde &amp;ccedil;ağırmaktayız. Nitekim Concurrency Violation (eş zamanlı uyumsuzluk) durumları ancak SqlDataAdapter nesnemizin Update metodunu &amp;ccedil;ağırdıktan sonra ortaya &amp;ccedil;ıkan istisna i&amp;ccedil;erisinde ele alınabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void VeriGuncelle()
{
    try    
    {
        // diğer kod satırları
        da.Update(ds);        
    }
    catch(DBConcurrencyException)
    {
        SonHaliAl();
    } 
}&lt;/pre&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalemizde kısaca bağlantısız katmanda meydana gelebilecek eş zamanlı &amp;ccedil;akışmaları nasıl ele alabileceğimizi incelemeye &amp;ccedil;alıştık. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hoş&amp;ccedil;akalın.&lt;/p&gt;</content>
  <pubDate>2005-03-06 10:00:00</pubDate>
  <slug>Baglantc4b1sc4b1z-Katmanda-Concurrency-Violation-Durumu-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>concurrency</tag>
    <tag>disconnected-layer</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>