<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Duck Typing Nedir?</title>
  <description>Son bir yıldır Ruby ve Python gibi script diller üzerinde araştırmalar yapıyor. Daha çok bu dilleri öğrenme, anlama gayretindeyim. En azından orta seviye bilgi sahibi olmak benim için yeterli.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2016/12/duffy.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Son bir yıldır Ruby ve Python gibi script diller &amp;uuml;zerinde araştırmalar yapıyorum. Daha &amp;ccedil;ok bu dilleri &amp;ouml;ğrenme, anlama gayretindeyim. En azından orta seviye bilgi sahibi olmak benim i&amp;ccedil;in yeterli. Bu dilleri incelerken uzun yıllardır &amp;ccedil;alıştığım dinamik tip sistemli ve derleyici odaklı yaklaşımları da sorgulamak durumunda kalıyoum. Nitekim farklı programlama yaklaşımlarına sahipler.&lt;/p&gt;
&lt;p&gt;Ruby, Python vb script diller &amp;ccedil;oğunlukla dinamik tip sistemini&lt;em&gt;(dynamic type system)&lt;/em&gt;&amp;nbsp;kullanıyorlar. Yani C#, Java, C++ benzeri dillerde&amp;nbsp;kullanılan&amp;nbsp;statik tip sisteminden&lt;em&gt;(static type system)&lt;/em&gt; farklı bir yaklaşım s&amp;ouml;z konusu. Ayrıca betik diller kodun &amp;ccedil;alışma zamanında yorumlanarak&lt;em&gt;(Interpret)&lt;/em&gt;&amp;nbsp;y&amp;uuml;r&amp;uuml;t&amp;uuml;lmesine&amp;nbsp;odaklandıklarından, derleme&lt;em&gt;(compiling)&lt;/em&gt;&amp;nbsp;yaklaşımını benimseyen dillerden epeyce farklılaşıyorlar. Hal b&amp;ouml;yle olunca diller arası bazı farklı teknikler ve yazım stilleri ortaya &amp;ccedil;ıkıyor. Bunlardan birisi de Duck Typing.&lt;/p&gt;
&lt;h2&gt;Tanım&lt;/h2&gt;
&lt;blockquote&gt;
&lt;p&gt;If it walks like a duck, and quakcs like a duck, then it must be a duck.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Enteresan bir tanımlama şekli olduğu aşikar. Kısaca bir şey &amp;ouml;rdek gibi y&amp;uuml;r&amp;uuml;yor ve &amp;ouml;rdek gibi konuşuyorsa O bir &amp;ouml;rdek olarak kabul edilebilir. Bu felsefeyi anlamak beni biraz uğraştırdı doğrusu. Yıllarca karşılaşmadığım Ruby ile uğraşmasam haberdar olamayacağım bir teknik. &amp;Ouml;ncelikle d&amp;uuml;ş&amp;uuml;nce yapımı değiştirdim. Programcı olarak bir nesnenin(object) ne olduğundan ziyade ne yapabileceğine odaklanmam gerektiğini benimsemem gerekiyordu.&lt;/p&gt;
&lt;p&gt;Duck Typing aslında &amp;ccedil;alışma zamanı ile ilgili de bir konu. Compile-Time ile Run-Time arasındaki davranış farklılıkları bu teknikte &amp;ouml;ne &amp;ccedil;ıkıyor. Nitekim duck typing stilinde, sistem &amp;ccedil;alışmadan &amp;ouml;nce &amp;ccedil;eşitli şartların sağlanmasını beklemiyor. Bunun yerine &amp;ccedil;alışma zamanında herhangibir şeyi&lt;em&gt;(&amp;ouml;rneğin parametre olarak gelen bir nesne &amp;uuml;zerinden bir fonksiyonun &amp;ccedil;alıştırılması)&lt;/em&gt; y&amp;uuml;r&amp;uuml;tmeyi deniyor. "Deniyor"&amp;nbsp;diyoruz &amp;ccedil;&amp;uuml;nk&amp;uuml; icra edilmesi istenen fonksiyonelliğin &amp;ouml;nceden tanımlanmış bir kuralı veya şablonu olmak zorunda değil.&amp;nbsp;&lt;/p&gt;
&lt;h2&gt;Ducy Typing Yokken&lt;/h2&gt;
&lt;p&gt;Kafalar biraz karıştı değil mi? Aslında benim de karışık. Haydi gelin bir &amp;ouml;rnek ile konuyu anlamaya &amp;ccedil;alışalım. İlk olarak Ducy Typing olmadan bir şeyleri g&amp;ouml;rmemiz gerekiyor. Bu anlamda aşağıdaki C# kodunu ele alacağız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ClassicTyping
{
    class Program
    {
        static void Main(string[] args)
        {
            Car frrari = new Car();
            Plane cesna = new Plane();
            Ship fery = new Ship();
            DriveVehicle(frrari);
            DriveVehicle(cesna);
            DriveVehicle(fery);
        }

        static void DriveVehicle(IVehicleOps vehicle)
        {
            vehicle.Drive();
        }
    }

    interface IVehicleOps
    {
        bool Drive();
    }

    class Car
        : IVehicleOps
    {
        public bool Drive()
        {
            Console.WriteLine("Driver is driving");
            return true;
        }
    }

    class Plane
        :IVehicleOps
    {

        public bool Drive()
        {
            Console.WriteLine("Pilot is driving");
            return true;
        }
    }

    class Ship
    {

    }
}&lt;/pre&gt;
&lt;p&gt;Kodu dikkatlice inceleyelim. Sizce bu kod derlenir mi? Aslında b&amp;ouml;yle sorduğuma g&amp;ouml;re derlenmiyor olması lazım değil mi? Uygulamada bir interface&amp;nbsp;ve &amp;uuml;&amp;ccedil; sınıf bulunmakta. Car ve Plane sınıfları IVehicleOps aray&amp;uuml;z&amp;uuml;n&amp;uuml; uyguluyorlar. Bu nedenle Drive isimli bir işlevselliğe sahipler. Ship isimli sınıfın ise bu aray&amp;uuml;z&amp;uuml; uygulamadığını g&amp;ouml;r&amp;uuml;yoruz. Dolayısıyla Drive isimli bir kabiliyete sahip değil. Program sınıfı i&amp;ccedil;erisinde yer alan DriveVehicle metodu parametre olarak IVehicleOps tipinden değişkenler alıyor. Dolayısıyla bu aray&amp;uuml;z&amp;uuml; uygulayan nesne &amp;ouml;rneklerini kendisine aktarıp Drive fonksiyonunu &amp;ccedil;ağırabiliriz. Lakin Ship sınıfına ait tasarımda b&amp;ouml;yle bir yetenek mevcut değil. Nitekim Ship, IVehicleOps tarafından taşınabilecek bir nesne modeli değil. Bu sebepten kod derlenmeyecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/12/ducktype_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ne zararı var peki? Programcı zaten tipleri &amp;ouml;nceden tanımlayarak geliştirme yapıyor. Kuralları biliyor. Interface kullanımı sayesinde metoda &amp;ccedil;ok bi&amp;ccedil;imli bir yapı kazandırıp OOP&lt;em&gt;(Object Oriented Programming)&lt;/em&gt; ilkelerinden birisini de uyguluyor. Ship nesne &amp;ouml;rneği &amp;uuml;zerinden Drive operasyonunun ger&amp;ccedil;ekleşmemesi normal bir sonu&amp;ccedil;. &amp;Ccedil;&amp;uuml;nk&amp;uuml; aray&amp;uuml;z tanımına uygun yapıda değil.&amp;nbsp;Burada bir &amp;ccedil;ok&amp;nbsp; tanımlama s&amp;ouml;z konusu. Kullanıcı tanımlı tipin &amp;ouml;nceden tasarlanması, uyacağı kuralların bildirilmesi gerekti.&lt;/p&gt;
&lt;h2&gt;Ducy Typing Yaklaşımı&lt;/h2&gt;
&lt;p&gt;Dinamik tip sistemli dillere gelindiğinde&amp;nbsp;farklı bir bakış a&amp;ccedil;ısı daha var.&amp;nbsp;Şimdi gelin bu farklılığı ortaya koyan&amp;nbsp;Duck Typing ile aynı senaryonun bir benzerinin nasıl ele alınacağına bakalım.&amp;nbsp;Ruby'de aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını yazarak işe başlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;class Car
  def drive
    puts "driver is driving"
  end
end
class Plane
  def drive
    puts "pilot is driving"
  end
end
def drive(vehicles)
  vehicles.each{|v|v.drive}
end

frrari=Car.new()
bat=Plane.new()
vehicle_array=[frrari,bat]
drive(vehicle_array)&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;&lt;img src="/image.axd?picture=/2016/12/ducktype_2.gif" alt="" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Ne olduğuna kısaca bakalım. Car, Plane sınıfları i&amp;ccedil;erisinde yine drive isimli birer metodumuz var. &amp;Ouml;rnekte vehicles isimli değişken alan drive metodunun işleyişi &amp;ouml;nemli. Dikkat edileceği &amp;uuml;zere vehicles&amp;nbsp;dizisinin i&amp;ccedil;erisindeki her v değişkeni &amp;uuml;zerinden drive fonksiyonu &amp;ccedil;ağırılıyor&lt;em&gt;(Aslında vehicles'ın Car, Plane gibi ara&amp;ccedil;lar taşıyacağı da kesin değil. Ne demiştik? Yaklaşımımızı farklılaştırmamız gerekiyor. Derleyici gibi değil yorumlayıcı g&amp;ouml;z&amp;uuml;yle bakıp kodu yazmalıyız)&lt;/em&gt; Buna g&amp;ouml;re vehicles değişkenini Car ve Plane gibi sınıflara ait nesne &amp;ouml;rnekleri ile doldurup topluca drive operasyonunu uygulatmamız m&amp;uuml;mk&amp;uuml;n. Ortada bir aray&amp;uuml;z bildirimi veya t&amp;uuml;retme gibi bir şey yok. &amp;Ccedil;alışma zamanı felsefesi basit. Ruby yorumlayıcısı vehicles elamanlarını gezerken &lt;strong&gt;eğer s&amp;uuml;r&amp;uuml;ş yeteneği varsa s&amp;uuml;rerim&lt;/strong&gt; diyor. &amp;Ccedil;ok doğal olarak Ship isimli ve drive metodu olmayan bir sınıf &amp;ouml;rneğini bu dizi i&amp;ccedil;erisine alıp kullanmak istesek &amp;ccedil;alışma zamanında hata alırız&lt;em&gt;(Dikkat edin derleme zamanı değil &amp;ccedil;alışma zamanı dedim)&lt;/em&gt;&amp;nbsp;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Eğer drive metoduna gelen değişken i&amp;ccedil;indeki nesne drive metodunu destekliyorsa sıkıntı yok. &amp;Ccedil;alıştırmayı dene! Ama drive metodu o anki nesne i&amp;ccedil;in s&amp;ouml;z konusu değilse &amp;ccedil;alışma zamanına hata fırlat.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/12/ducktype_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sanıyorum siz de benim gibi Duck Typing yaklaşımını&amp;nbsp;biraz daha iyi anladınız. Bakalım Ruby, Python gibi dilleri inceledik&amp;ccedil;e daha farklı nelerle karşılacağız!? Bir&amp;nbsp;başka&amp;nbsp;yazımızda g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-01-19 21:30:00</pubDate>
  <slug>duck-typing-nedir</slug>
  <tags>
    <tag>ruby</tag>
    <tag>type-systems</tag>
    <tag>duck-typing</tag>
    <tag>static-languages</tag>
    <tag>dynamic-languages</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>