<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF - Transaction Yonetimi (Transaction Management) - 2</title>
  <description>Windows Communication Foundation için transaction yönetimi ile ilgili bir önceki makalemizde teorik bilgiler üzerinde durmaya çalışmıştık. Bu makalemizde ise, transaction yönetimi için gerekli materyalleri toplamaya devam edecek ve bir örnek üzerinde konuyu daha net bir şekilde anlamaya çalışacağız.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Windows Communication Foundation i&amp;ccedil;in transaction y&amp;ouml;netimi ile ilgili bir &amp;ouml;nceki makalemizde teorik bilgiler &amp;uuml;zerinde durmaya &amp;ccedil;alışmıştık. Bu makalemizde ise, transaction y&amp;ouml;netimi i&amp;ccedil;in gerekli materyalleri toplamaya devam edecek ve bir &amp;ouml;rnek &amp;uuml;zerinde konuyu daha net bir şekilde anlamaya &amp;ccedil;alışacağız. &amp;Ouml;rneği geliştirmeden &amp;ouml;nce &amp;ouml;zellikle servis ve metod seviyesinde bilinmesi gerekenler olduğunu belirtelim. &amp;Ouml;zellikle servis nesnesi i&amp;ccedil;in &amp;ccedil;alışma zamanı davranışlarını belirlemek adına &lt;strong&gt;ServiceBehavior&lt;/strong&gt; niteliğinin bazı &amp;ouml;zelliklerini kullanmak gerekmektedir. Benzer şekilde operasyonların transaction ile ilişkili &amp;ccedil;alışma zamanı davranışlarını belirlemek i&amp;ccedil;inde, &lt;strong&gt; OperationBehavior&lt;/strong&gt; niteliğinin &amp;ouml;zelliklerinden faydalanılmaktadır.&lt;/p&gt;
&lt;p&gt;ServiceBehavior ve OperationBehavior dışında transacation y&amp;ouml;netimi i&amp;ccedil;in kullanılan bir diğer nitelik&lt;strong&gt;(attribute)&lt;/strong&gt; ise, &lt;strong&gt;TransactionFlow&lt;/strong&gt;' dur. Bu nitelik servis tarafındaki metodlara uygulanabilen t&amp;uuml;rdedir. TransactionFlow niteliği temel olarak bir servisin dış servisler ile olan ilişkilerinde servisler arasında akan transaction' ların operasyon kademesinde kabul edilme seviyelerinin belirlenmesinde kullanılır. S&amp;ouml;z konusu seviyeler &lt;strong&gt; TransactionFlowOption&lt;/strong&gt; isimli enum sabiti tarafından belirlenebilir. TransactionFlowOption enum sabitinin değerleri ve nasıl bir akışa izin verdikleri aşağıdaki tabloda g&amp;ouml;sterilmektedir.&lt;/p&gt;
&lt;table id="table96" style="border-collapse: collapse; width: 100%;" border="1" cellpadding="5"&gt;&lt;colgroup&gt; &lt;col style="width: 100pt;" width="137" /&gt; &lt;col style="width: 160pt;" width="205" /&gt; &lt;/colgroup&gt;
&lt;tbody&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;th style="width: 167px; height: 12.75pt; text-align: left; vertical-align: middle;" height="17"&gt;&lt;strong&gt;TransactionFlowOption &lt;br /&gt; Değeri&lt;/strong&gt;&lt;/th&gt;
&lt;th style="width: 167px; height: 12.75pt; text-align: left; vertical-align: middle;"&gt;&lt;strong&gt;A&amp;ccedil;ıklaması&lt;/strong&gt;&lt;/th&gt;
&lt;/tr&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;th style="width: 167px; height: 12.75pt; text-align: left; vertical-align: middle;" height="17"&gt;&lt;strong&gt; NotAllowed&lt;/strong&gt;&lt;/th&gt;
&lt;td style="width: 167px; height: 12.75pt; text-align: left; vertical-align: middle;"&gt;WCF &amp;ccedil;alışma zamanı (runtime) servise akan transactionları ge&amp;ccedil;ersiz kılıp her zaman i&amp;ccedil;in yeni bir tane oluşturur.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;th style="width: 167px; height: 12.75pt; text-align: left; vertical-align: middle;" height="17"&gt;&lt;strong&gt; Allowed&lt;/strong&gt;&lt;/th&gt;
&lt;td style="width: 167px; height: 12.75pt; text-align: left; vertical-align: middle;"&gt;Transaction istemci tarafında (istemci g&amp;uuml;ncel servisin konuştuğu başka bir serviste olabilir) a&amp;ccedil;ılır. Eğer a&amp;ccedil;ılmamışsa WCF &amp;ccedil;alışma zamanı(runtime) yeni bir tane oluşturur.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;th style="width: 167px; height: 12.75pt; text-align: left; vertical-align: middle;" height="17"&gt;&lt;strong&gt; Mandatory&lt;/strong&gt;&lt;/th&gt;
&lt;td style="width: 167px; height: 12.75pt; text-align: left; vertical-align: middle;"&gt;S&amp;ouml;z konusu operasyonun y&amp;uuml;r&amp;uuml;t&amp;uuml;lebilmesi i&amp;ccedil;in istemci uygulma (yada diğer servis) transaction a&amp;ccedil;mak zorundadır. S&amp;ouml;z konusu transaction' a ait bilgi SOAP Header (SOAP zarfının başlık kısmında) i&amp;ccedil;erisinde de taşınmaktadır.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Bir servisin başka servis veya istemcilerden gelecek transaction akışına izin verip vermemesi durumlarını kontrol etmek i&amp;ccedil;in ilgili bağlayıcı tiplerin (binding types) &lt;strong&gt;transactionFlow&lt;/strong&gt; elementi kullanılır. Varsayılan olarak transaction flow se&amp;ccedil;eneği aktif değildir(&lt;strong&gt;disabled&lt;/strong&gt;). Dolayısıyla transaction akışının kontrol altına alınmasının istendiği durumlarda bilin&amp;ccedil;li olarak a&amp;ccedil;ılması gerekmektedir. Bunun i&amp;ccedil;in transactionFlow niteliğine &lt;strong&gt;true&lt;/strong&gt; değerinin atanması yeterlidir.&lt;/p&gt;
&lt;p&gt;ServiceBehavior niteliğininde transaction y&amp;ouml;netiminde kullanılan &amp;ouml;nemli &amp;ouml;zellikleri vardır. Bunlar &lt;strong&gt; TransactionAutoCompleteOnSessionClose&lt;/strong&gt;, &lt;strong&gt; RelaseServiceInstanceOnTransactionComplete, TransactionTimeOut&lt;/strong&gt; ve &lt;strong&gt; TransactionIsolationLevel&lt;/strong&gt; isimli &amp;ouml;zelliklerdir. TransactionAutoCompleteOnSessionClose &amp;ouml;zelliği adındanda anlaşılacağı &amp;uuml;zere oturum kapatıldığında transaction' a ne olacağının belirlenmesinde kullanılır. Bunu oturum kapatıldığında transaction' ın tamamlanıp tamamlanmayacağının belirtilmesi olarakda d&amp;uuml;ş&amp;uuml;nebiliriz. Nitekim s&amp;ouml;z konusu &amp;ouml;zelliğin değeri true olarak belirlendiğinde &lt;span style="text-decoration: underline;"&gt;hatasız olarak tamamlanan bir oturum sonrasında ilgili transaction otomatik olarak kapatılır. Normal şartlar altında herhangibir problem nedeni ile ortama bir istisna(&lt;strong&gt;exception&lt;/strong&gt;) nesnesi fırlatıldığında otomatik olarak geri alma (&lt;strong&gt;rollback&lt;/strong&gt;) işlemi ger&amp;ccedil;ekleşir. Bu &amp;ouml;zelliğin true olarak belirlenmesi bu işlemin daha kontroll&amp;uuml; bir şekilde yapılmasınıda sağlar. Ne varki varsayılan değeri false' dur.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt; RelaseServiceInstanceOnTransactionComplete&lt;/strong&gt; &amp;ouml;zelliği, transaction tamamlandığında ilgili servis nesne &amp;ouml;rneğinin serbest&lt;strong&gt;(relase)&lt;/strong&gt; bırakılıp bırakılmayacağının belirlenmesinde kullanılır. Varsayılan değeri true olarak belirlenmiştir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Eğer &lt;strong&gt;OperationBehavior&lt;/strong&gt; niteliğinin &lt;strong&gt;TransactionScopeRequired&lt;/strong&gt; değeri &lt;strong&gt;true&lt;/strong&gt; ve &lt;strong&gt;ServiceBehavior&lt;/strong&gt; niteliğinin &lt;strong&gt;ConcurrencyMode&lt;/strong&gt; &amp;ouml;zelliğinin değeri &lt;strong&gt;Reentrant&lt;/strong&gt; ise&lt;strong&gt;RelaseServiceInstanceOnTransactionComplete&lt;/strong&gt; &amp;ouml;zelliğinin değeri &lt;strong&gt;false&lt;/strong&gt; yapılmalıdır. Aksi takdirde &amp;ccedil;alışma zamanında bir istisna&lt;strong&gt;(exception)&lt;/strong&gt; alınır. Bunun sebebi RelaseServiceInstanceOnTransactionComplete &amp;ouml;zelliğinin varsayılan değerinin &lt;strong&gt;true&lt;/strong&gt; olmasıdır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Burada RelaseServiceInstanceOnTransactionComplete &amp;ouml;zelliğine g&amp;ouml;re transaction' ları tamamlamanın &amp;ouml;ncelikli olan 4 farklı yolu vardır.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;OperationBehavior niteliğinde &lt;strong&gt; TransactionAutoComplete&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;true&lt;/strong&gt; değeri verilir.&lt;/li&gt;
&lt;li&gt;Servis tarafında &lt;strong&gt; SetTransactionComplete&lt;/strong&gt; metodu &amp;ccedil;ağırılır. Bu &amp;ouml;zellikle TransactionAutoComplete &amp;ouml;zelliğinin false olduğu durumlarda kullanılır. Genellikle geliştirme safhasında operasyonun transaction' ı tamamlama ihtiyacının tam olarak kararlaştırılamadığı durumlarda tercih edilebilir.&lt;/li&gt;
&lt;li&gt;İstemcinin (yada diğer bir servisin) dahil olduğu aktif bir transaction i&amp;ccedil;erisindeyken oturumu kapatması veya network hatası alınması halinde eğer &lt;strong&gt; TransactionAutoComplete&lt;/strong&gt; &amp;ouml;zelliğinin değeri &lt;strong&gt;false&lt;/strong&gt; ise otomatik olarak geri alma&lt;strong&gt;(rollback)&lt;/strong&gt; işlemi ger&amp;ccedil;ekleşir.&lt;/li&gt;
&lt;li&gt;Yukarıdaki durumların dışında oluşabilecek herhangibir neden transaction' ın iptal edilmesi &lt;strong&gt; (abort)&lt;/strong&gt; ve o ana kadar yapılmış işlemler var ise bunların geri alınması&lt;strong&gt;(Rollback)&lt;/strong&gt; anlamına gelmektedir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;ServiceBehavior niteliğinde transaction y&amp;ouml;netimi i&amp;ccedil;in kullanılan bir diğer &amp;ouml;zellikte &lt;strong&gt; TransactionIsolationLevel&lt;/strong&gt;' dır. Bu &amp;ouml;zelliğin değeri, servis i&amp;ccedil;erisinde yeni bir transaction a&amp;ccedil;ıldığında veya servise başka bir istemciden (veya bir servisten) bir transaction aktığında (Flow), değişken veriler &lt;strong&gt;(volatile datas)&lt;/strong&gt; i&amp;ccedil;in s&amp;ouml;z konusu olacak izolasyon seviyesinin &lt;strong&gt;(Isolation Level)&lt;/strong&gt; ne olacağını belirler.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bir transaction tarafından etkilenen veri, &lt;strong&gt;değişken veri(volatile data)&lt;/strong&gt; olarak adlandırılır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Izolasyon seviyeleri sayesinde ortak veriler &amp;uuml;zerinde diğer transaction' ların yaptığı değişikliklerin nasıl ele alınacağı yada transaction' ın değişikliğe uğrayan veriyi ne kadar s&amp;uuml;re kilitleyeceği gibi &amp;ouml;zellikler belirlenebilir. S&amp;ouml;z konusu &amp;ouml;zelliğin değeri &lt;strong&gt;IsolationLevel&lt;/strong&gt; enum sabiti t&amp;uuml;r&amp;uuml;nden olabilir. Temel olarak ele alınabilecek 5 farklı izolasyon seviyesi vardır (Chaos ve Unspecified haricinde). Bunlar aşağıdaki tabloda kısaca &amp;ouml;zetlenmektedir.&lt;/p&gt;
&lt;table id="table97" style="border-collapse: collapse; width: 100%;" border="1" cellpadding="5"&gt;&lt;colgroup&gt; &lt;col style="width: 100pt;" width="137" /&gt; &lt;col style="width: 160pt;" width="205" /&gt; &lt;/colgroup&gt;
&lt;tbody&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;th style="width: 167px; height: 12.75pt; text-align: left; vertical-align: middle;" height="17"&gt;Izolasyon Seviyesi&lt;br /&gt; Değeri&lt;/th&gt;
&lt;th style="width: 167px; height: 12.75pt; text-align: left; vertical-align: middle;"&gt;A&amp;ccedil;ıklaması&lt;/th&gt;
&lt;/tr&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;th style="width: 167px; height: 12.75pt; vertical-align: top;" height="17"&gt;&lt;strong&gt;ReadUncommited&lt;/strong&gt;&lt;/th&gt;
&lt;td style="width: 614px; vertical-align: top;"&gt;Transaction boyunca değişken veri &lt;strong&gt;(volatile data) &lt;/strong&gt;&amp;uuml;zerinde değişiklik ve okuma &lt;span style="text-decoration: underline;"&gt;yapılabilir. Bu en d&amp;uuml;ş&amp;uuml;k izolasyon seviyesi olarak nitelendirilir. Bu nedenle Phantoms, Non-Repeatable Read ve Dirty-Read durumları oluşabilir.&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;th style="width: 167px; height: 12.75pt; vertical-align: top;" height="17"&gt;&lt;strong&gt;ReadCommited&lt;/strong&gt;&lt;/th&gt;
&lt;td style="width: 614px; vertical-align: top;"&gt;Transaction boyunca değişken veri &amp;uuml;zerinde değişiklik &lt;span style="text-decoration: underline;"&gt;yapılabilir ama okuma &lt;span style="text-decoration: underline;"&gt;yapılamaz. Non Repetable Read ve Phantoms durumları oluşabilir. Ancak Dirty-Read durumları oluşmaz.&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;th style="width: 167px; height: 12.75pt; vertical-align: top;" height="17"&gt;&lt;strong&gt;Repeatable Read&lt;/strong&gt;&lt;/th&gt;
&lt;td style="width: 614px; vertical-align: top;"&gt;Transaction boyunca değişken veri &amp;uuml;zerinde değişiklik &lt;span style="text-decoration: underline;"&gt;yapılamaz ama okuma &lt;span style="text-decoration: underline;"&gt;yapılabilir. Bunun dışında Transaction boyunca yeni veri &lt;span style="text-decoration: underline;"&gt;eklenebilir. Phantoms durumu oluşabilir ancak Non-Repeatable Read ve Dirty-Read halleri oluşmaz.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;th style="width: 167px; height: 12.75pt; vertical-align: top;" height="17"&gt;&lt;strong&gt;Serializable&lt;/strong&gt;&lt;/th&gt;
&lt;td style="width: 614px; vertical-align: top;"&gt;En y&amp;uuml;ksek mertebeli izolasyon seviyesi olarak ele alınır. Buna g&amp;ouml;re Transaction boyunca değişken veri &lt;span style="text-decoration: underline;"&gt; okunabilir ama değiştirme veya ekleme &lt;span style="text-decoration: underline;"&gt;yapılamaz. Bu seviye Phantoms, Non-Repeatable Read ve Dirty-Read gibi durumların oluşmasına izin vemez.&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr style="height: 12.75pt;"&gt;
&lt;th style="width: 167px; height: 12.75pt; vertical-align: top;" height="17"&gt;&lt;strong&gt;Snapshot&lt;/strong&gt;&lt;/th&gt;
&lt;td style="width: 614px; vertical-align: top;"&gt;Bu seviye aslında ReadCommited' ın farklı bir formasyonudur ve &lt;strong&gt;SQL Server 2005&lt;/strong&gt; tarafından desteklenmektedir. Transaction boyunca değişken veri &lt;span style="text-decoration: underline;"&gt; okunabilir. Burada veri değiştirilmeden &amp;ouml;nce, son okumadan bu yana başka bir transaction'ın aynı veriyi değiştirip değiştirmediğine bakılır. Eğer b&amp;ouml;yle bir durum var ise hata fırlatılır.&amp;nbsp; Bu bir anlamda transaction' ın son onaylanan veriyi okumasını sağlayan bir yoldur. Bu seviye Phantoms, Non-Repeatable Read ve Dirty-Read gibi durumların oluşmasına izin &lt;span style="text-decoration: underline;"&gt;vermez. &lt;em&gt;(Snapshot izolasyon seviyesini kullanabilmek i&amp;ccedil;in SQL Server &amp;uuml;zerinde &lt;strong&gt;Snapshot&lt;/strong&gt; desteğinin ilgili veritabanı i&amp;ccedil;in a&amp;ccedil;ılması gerekmetekdir.)&lt;/em&gt;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;ServiceBehavior tarafında yer alan bir diğer &amp;ouml;zellik ise &lt;strong&gt;TransactionTimeOut&lt;/strong&gt;' dur. Bu &amp;ouml;zellik tahmin edileceği &amp;uuml;zere transaction i&amp;ccedil;in zaman aşımı s&amp;uuml;resini bildirir. Eğer belirtilen s&amp;uuml;rede transaction tamamlanmamışsa iptal &lt;strong&gt;(abort)&lt;/strong&gt; s&amp;uuml;reci başlatılır.&lt;/p&gt;
&lt;p&gt;Gelelim &lt;strong&gt;OperationBehavior&lt;/strong&gt; niteliğinin transaction i&amp;ccedil;in kullanılan &amp;ouml;zelliklerine. S&amp;ouml;z konusu &amp;ouml;zellikler, &lt;strong&gt;TransactionAutoComplete&lt;/strong&gt; ve &lt;strong&gt; TransactionScopeRequired&lt;/strong&gt;' dır. TransactionAutoComplete &amp;ouml;zelliğinin varsayılan değeri true' dur ve buna g&amp;ouml;re eğer ele alınamayacak&lt;strong&gt;(unhandled)&lt;/strong&gt; bir hata oluşmamışsa s&amp;ouml;z konusu operasyonun yer aldığı Transaction otomatik olarak tamamlanır (Commit). Ele alınamayan istisnalar otomatik olarak Transaction' ın &lt;strong&gt;iptal(abort)&lt;/strong&gt; edilmesini tetiklemektedir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Transaction' ın kod i&amp;ccedil;erisinden tamamlanması veya iptal edilmesi istendiğinde&lt;strong&gt;TransactionAutoComplete&lt;/strong&gt; &amp;ouml;zelliğinin varsayılan olarak true olan değerinin bilin&amp;ccedil;li bir şekilde &lt;strong&gt;false&lt;/strong&gt; olarak belirtilmesi gerekmektedir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;TransactionScopeRequired&lt;/strong&gt; &amp;ouml;zelliği, uygulandığı metodun &amp;ccedil;alışması sırasında bir transaction scope gerektirip gerektirmediğinin belirlenmesinde kullanılır. S&amp;ouml;z konusu &amp;ouml;zelliğin varsayılan değeri false' dur. Eğer metodun &amp;ccedil;alışması sırasında bir Transaction Scope gerekiyorsa true olarak belirlenir. Eğer başka bir yerden metoda akan bir transaction var ise, metod i&amp;ccedil;eriği gelen transaction' a dahil olacaktır. Tam aksine kullanılabilir bir transaction yoksa yeni bir tane oluşturulur ve y&amp;uuml;r&amp;uuml;tme yeni a&amp;ccedil;ılan bu Transaction i&amp;ccedil;erisinde ger&amp;ccedil;ekleştirilir.&lt;/p&gt;
&lt;p&gt;Aslında &lt;strong&gt;TransactionFlow&lt;/strong&gt; ve &lt;strong&gt; TransactionScopeRequired&lt;/strong&gt; &amp;ouml;zellikleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında bunların sahip olabileceği değerlerin etkisini iyi bir şekilde kavramak gerekir. Bu ama&amp;ccedil;la &amp;ouml;rnek bir senaryo olarak aşağıdaki şekli g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk210_1.gif" alt="" width="552" height="633" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak istemci uygulama Servis A &amp;uuml;zerinden bir operasyon &amp;ccedil;ağrısında bulunur. Şekle g&amp;ouml;re Servis A bağlayıcı tipini (Binding Type) istemcilerden gelecek transaction akışlarını destekleyecek bi&amp;ccedil;imde tasarlamıştır. &amp;Uuml;stelik &amp;ccedil;ağırılan operasyon i&amp;ccedil;in Servis A, Transaction akışına izin vermektedir. Bununla birlikte istemcide a&amp;ccedil;ılan bir Transaction mevcut değildir. Lakin Servis A i&amp;ccedil;in &lt;strong&gt;TransactionScopeRequired&lt;/strong&gt; &amp;ouml;zelliğinin değeri &lt;strong&gt;true&lt;/strong&gt; olarak belirlenmiştir. Buna g&amp;ouml;re s&amp;ouml;z konusu operasyon i&amp;ccedil;in Servis A otomatik olarak bir Transaction alanı (Scope) a&amp;ccedil;acaktır.&lt;/p&gt;
&lt;p&gt;Gelelim Servis B' ye. Servis A, Servis B &amp;uuml;zerinden de bir operasyon &amp;ccedil;ağrısı yapmaktadır. Servis B' ye ait bağlayıcı tip(binding type) diğer istemcilerden transaction akışına izin vermektedir. Bununla birlikte Servis B' deki operasyonun &lt;strong&gt; TransactionFlow&lt;/strong&gt; &amp;ouml;zelliği &lt;strong&gt;Mandatory&lt;/strong&gt; olarak belirlenmiştir. Bir başka deyişle Servis A' nın Servis B' ye bir Transaction akışı sağlaması şarttır. Diğer taraftan Servis B' deki TransactionScopeRequired &amp;ouml;zelliğinin değeri true olduğundan Servis B' deki operasyon, otomatik olarak Servis A' dan gelen &lt;strong&gt;Transaction Scope&lt;/strong&gt;' a dahil olacaktır. Buna g&amp;ouml;re Servis A ve Servis B aynı Transaction Scope i&amp;ccedil;erisinde &amp;ccedil;alışacaktır.&lt;/p&gt;
&lt;p&gt;Servis B, Servis C &amp;uuml;zerinden bir operasyon &amp;ccedil;ağırmaktadır. Servis C' deki duruma baktığımızda, bağlayıcı tipin başka servis veya istemcileriden gelen transaction akışına izin vermediği g&amp;ouml;r&amp;uuml;lmektedir. Bununla birlikte operasyon i&amp;ccedil;inde, transaction akışına izin verilmemektedir. Ancak &amp;ccedil;ağırılan operasyonun bir transaction i&amp;ccedil;erisinde &amp;ccedil;alıştırılması gereklidir. &amp;Ccedil;&amp;uuml;nk&amp;uuml; &lt;strong&gt; TransactionScopeRequired&lt;/strong&gt; &amp;ouml;zelliğinin değeri &lt;strong&gt;true&lt;/strong&gt; olarak ayarlanmıştır. Bu sebepten Servis C kendine ait Transaction alanı i&amp;ccedil;erisinde &amp;ccedil;alışmaktadır.&lt;/p&gt;
&lt;p&gt;Servis C, Servis D &amp;uuml;zerinden de bir operasyon &amp;ccedil;ağırmaktadır. Servis C' dekine benzer olarak diğer servis veya istemcilerden gelecek transaction akışına izin vermeyecek şekilde bağlayıcı tipi ayarlanmıştır. Diğer yandan &amp;ccedil;ağırılan operasyon i&amp;ccedil;inde transaction akışına izin verilmemekte ve yeni bir transaction oluşturulması da engellenmektedir. Dolayısıyla buradaki operasyon tamamen transaction haricinde kendi haline &amp;ccedil;alışmaktadır.&lt;/p&gt;
&lt;p&gt;Buradaki bilgiler ışığında pek &amp;ccedil;ok senaryo d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Kullanılan &amp;ouml;zellikler g&amp;ouml;z &amp;ouml;n&amp;uuml;nde bulundurulduğunda &amp;ccedil;ok doğal olarak olasılıkların sayısı artmakta ve ele alınmaları zorlaşmaktadır. Bu sebepten &amp;ouml;zelliklerin değerlerinin farklı kombinasyonlarının etkilerini daha kolay bir şekilde g&amp;ouml;rebilmek i&amp;ccedil;in, aşağıdaki tablodan yararlanılabilir.&lt;/p&gt;
&lt;table id="table100" style="border-collapse: collapse; width: 650px;" border="1" cellspacing="0" cellpadding="5" bgcolor="#336699"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="width: 194px; background-color: #ccffcc;" width="194"&gt;&lt;strong&gt; TransactionScopeRequired&lt;br /&gt; Değeri&lt;/strong&gt;&lt;/td&gt;
&lt;td style="width: 194px; background-color: #ccffcc;" width="168"&gt;&lt;strong&gt; TransactionFlowOption&lt;br /&gt; Değeri&lt;/strong&gt;&lt;/td&gt;
&lt;td style="width: 194px; background-color: #ccffcc;" width="118"&gt;&lt;strong&gt;transactionFlow&lt;br /&gt; Elementi Değeri&lt;/strong&gt;&lt;/td&gt;
&lt;td style="width: 194px; background-color: #ccffcc;" width="122"&gt;&lt;strong&gt;Transaction' ın &lt;br /&gt; Ele Alındığı Taraf&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffff99" width="194"&gt;true&lt;/td&gt;
&lt;td bgcolor="#ffff99" width="168"&gt;Allowed&lt;/td&gt;
&lt;td bgcolor="#ffff99" width="118"&gt;false&lt;/td&gt;
&lt;td rowspan="2" bgcolor="#ffff99" width="122"&gt;Servis Taraflı&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffff99" width="194"&gt;true&lt;/td&gt;
&lt;td bgcolor="#ffff99" width="168"&gt;NotAllowed&lt;/td&gt;
&lt;td bgcolor="#ffff99" width="118"&gt;false&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ccffff" width="194"&gt;true&lt;/td&gt;
&lt;td bgcolor="#ccffff" width="168"&gt;Mandatory&lt;/td&gt;
&lt;td bgcolor="#ccffff" width="118"&gt;true&lt;/td&gt;
&lt;td bgcolor="#ccffff" width="122"&gt;İstemci Taraflı&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ccccff" width="194"&gt;true&lt;/td&gt;
&lt;td bgcolor="#ccccff" width="168"&gt;Allowed&lt;/td&gt;
&lt;td bgcolor="#ccccff" width="118"&gt;true&lt;/td&gt;
&lt;td bgcolor="#ccccff" width="122"&gt;&amp;Ccedil;ift Tarafllı&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffcc99" width="194"&gt;false&lt;/td&gt;
&lt;td bgcolor="#ffcc99" width="168"&gt;Allowed&lt;/td&gt;
&lt;td bgcolor="#ffcc99" width="118"&gt;false&lt;/td&gt;
&lt;td rowspan="4" bgcolor="#ffcc99" width="122"&gt;Tarafsız&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffcc99" width="194"&gt;false&lt;/td&gt;
&lt;td bgcolor="#ffcc99" width="168"&gt;NotAllowed&lt;/td&gt;
&lt;td bgcolor="#ffcc99" width="118"&gt;false&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffcc99" width="194"&gt;false&lt;/td&gt;
&lt;td bgcolor="#ffcc99" width="168"&gt;Allowed&lt;/td&gt;
&lt;td bgcolor="#ffcc99" width="118"&gt;true&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffcc99" width="194"&gt;false&lt;/td&gt;
&lt;td bgcolor="#ffcc99" width="168"&gt;Mandatory&lt;/td&gt;
&lt;td bgcolor="#ffcc99" width="118"&gt;true&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Tabloda &lt;strong&gt;TransactionScopeRequired&lt;/strong&gt;, &lt;strong&gt;TransactionFlowOption&lt;/strong&gt; &amp;ouml;zelliklerinin ve &lt;strong&gt;transactionFlow&lt;/strong&gt; elementinin değerlerine g&amp;ouml;re transaction' ın hangi tarafta ele alınabileceği g&amp;ouml;r&amp;uuml;lmektedir. Servis taraflı modele g&amp;ouml;re, servis uygulaması her zaman i&amp;ccedil;in kendine ait bir transaction' a sahiptir. Ayrıca servis tarafı bu transaction' ı her zaman i&amp;ccedil;in istemci transaction' ından ayrı olacak şekilde ele alır. Bir başka deyişle servis tarafının her zaman i&amp;ccedil;in kendi transaction'ında &amp;ccedil;alıştığı d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Senaryoda yer alan Servis C bu durumu tam olarak karşılamaktadır.&lt;/p&gt;
&lt;p&gt;İstemci taraflı modele g&amp;ouml;re, servis kendisine istemci tarafından akan transaction' ı kullanır. &amp;Ouml;rnek senaryoda yer alan Servis C bu modele uygun bir şekilde &amp;ccedil;alışmaktadır. Bu modelde servisin istemciden akan bir transaction'ı alması zorunludur. Daha &amp;ccedil;ok, &lt;strong&gt;deadlock&lt;/strong&gt;' ların oluşmasının engellenmesi ve sistem tutarlılığının sağlanması istenilen durumlarda tercih edilebilir. Nitekim istemci tarafında a&amp;ccedil;ılan transaction, servis tarafına da dahil edildiğinden t&amp;uuml;m işlemler aslında aynı transaction scope i&amp;ccedil;erisinde yer alacaktır. Buda doğal olarak deadlock oluşma ihtimalini azaltmaktadır. Bunun dışında istemci ve servislerin sayısının arttığı bir modelde herkesin aynı transaction' a dahil olması, &lt;strong&gt;atomicity&lt;/strong&gt; ilkesinin en iyi bi&amp;ccedil;imde karşılanması anlamınada gelmektedir.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ift taraflı modelde servis istemciden kendisine doğru akan transaction' ı kullanabilir yada akan bir transaction yoksa kendi oluşturduğu transaction scope' u kullanır. Bu yararlı bir modeldir. Eğer istemci tarafından akan bir transaction var ise t&amp;uuml;m s&amp;uuml;recin atomikliği daha tutarlı bir şekilde sağlanabilir. Yinede istemci tarafından gelen bir transaction yok ise bu durumda servisin bir k&amp;ouml;k transaction &lt;strong&gt;(root transaction)&lt;/strong&gt; a&amp;ccedil;arak t&amp;uuml;m s&amp;uuml;reci &amp;uuml;st&amp;uuml;ne almasıda s&amp;ouml;z konusu olabilir. Bu a&amp;ccedil;ılardan bakıldığında &amp;ccedil;ok fazla tercih edilebilecek bir modeldir.&lt;/p&gt;
&lt;p&gt;Son olarak tarafsız modele g&amp;ouml;re, servis hi&amp;ccedil; bir durumda transaction' a sahip olmaz. &amp;Ouml;rnek senaryoda yer alan Servis D buna &amp;ouml;rnek olarak verilebilir. Tarafsız model daha &amp;ccedil;ok istemci tarafındaki transaction' ların, servis tarafından bozulması istenmeyen durumlarda ele alınabilir.&lt;/p&gt;
&lt;p&gt;Şimdi basit bir &amp;ouml;rnek ile transaction y&amp;ouml;netimini incelemeye &amp;ccedil;alışalım. Şu ana kadar anlatılanlar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında transaction kullanımının değişiklik varyasyonları olabileceği d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. &amp;Ouml;rnekte ilk olarak istemci tarafında oluşturulan bir transaction' ın servis tarafına aktarılması ve burada ele alınarak commit işleminin ger&amp;ccedil;ekleştirilmesi incelenecektir. Her zaman olduğu gibi işe servisin sunacağı aray&amp;uuml;z s&amp;ouml;zleşmesi ve uzak nesne sınıfını tasarlayarak başlamak gerekir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk210_2.gif" alt="" width="474" height="379" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ISiparisYonetici aray&amp;uuml;z&amp;uuml;;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Transactions;
using System.ServiceModel;

namespace NorthwindYonetici
{
    // IsolationLevel enum sabitinin kullanılabilmesi i&amp;ccedil;in System.Transactions.dll' inin projeye referans edilmesi gerekmektedir.
    [ServiceContract(Name="Siparis_Yonetim_Servisi", Namespace="http://www.bsenyurt.com/2007/23/6/SiparisYonetimServisi", SessionMode=SessionMode.Required)]
    public interface ISiparisYonetici
    {
        [OperationContract(Name="SepeteEkle",IsInitiating=true)]
        bool SepeteUrunEkle(int urunNumarasi);
    
        [OperationContract(Name="SepettenCikar",IsInitiating=false)]
        bool SepettenUrunCikart(int urunNumarais);

        [OperationContract(Name="SepetiOnayla",IsInitiating=false,IsTerminating=true)]
        bool Onayla();
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;SiparisYonetici sınıfı;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data.SqlClient;
using System.Transactions;
using System.ServiceModel;
using System.Text;

namespace NorthwindYonetici
{
    [ServiceBehavior(TransactionIsolationLevel= IsolationLevel.Serializable, TransactionTimeout="00:02:00", InstanceContextMode=InstanceContextMode.PerSession)]
    public class SiparisYonetici:ISiparisYonetici
    {
        private string TransactionInfo(Transaction trx,string mesaj)
        {
            StringBuilder builder = new StringBuilder();
            builder.AppendLine(mesaj);
            builder.AppendLine("G&amp;uuml;ncel Transaction Bilgileri");
            builder.Append("Oluşturulma zamanı (Creation Time): ");
            builder.AppendLine(trx.TransactionInformation.CreationTime.ToLongTimeString());
            builder.Append("Dağıtık GUID (Distributed GUID): ");
            builder.AppendLine(trx.TransactionInformation.DistributedIdentifier.ToString());
            builder.Append("Yered belirleyici (Local Identifier) : ");
            builder.AppendLine(trx.TransactionInformation.LocalIdentifier);
            builder.Append("Durum (Status) : ");
            builder.AppendLine(trx.TransactionInformation.Status.ToString());
            builder.AppendLine();
            return builder.ToString();
        }

        #region ISiparisYonetici Members
    
        [OperationBehavior(TransactionAutoComplete=false,TransactionScopeRequired=true)]
        [TransactionFlow( TransactionFlowOption.Mandatory)]
        public bool SepeteUrunEkle(int urunNumarasi)
        {
            // İstemci tarafında bu metoda yapılan her &amp;ccedil;ağrı sonrasında o anki transaction i&amp;ccedil;in bir TransactionCompleted olayı y&amp;uuml;klenir. Bu nedenle ka&amp;ccedil; metod &amp;ccedil;ağrısı var ise hepsi i&amp;ccedil;in TransactionCompleted olayı birer kez &amp;ccedil;alışır.
            Transaction.Current.TransactionCompleted += new TransactionCompletedEventHandler(Current_TransactionCompleted);
            Console.WriteLine(TransactionInfo(Transaction.Current,"SepeteUrunEkle metodu &amp;ccedil;ağırıldı"));
            return true;
        }

        void Current_TransactionCompleted(object sender, TransactionEventArgs e)
        {
            Console.WriteLine(TransactionInfo(e.Transaction,"TransactionCompleted Olayı tetiklendi"));
        } 

        [OperationBehavior(TransactionAutoComplete = false, TransactionScopeRequired = true)]
        [TransactionFlow(TransactionFlowOption.Mandatory)]
        public bool SepettenUrunCikart(int urunNumarais)
        {
            Console.WriteLine(TransactionInfo(Transaction.Current, "SepetenUrunCikart metodu &amp;ccedil;ağırıldı"));
            return true;
        }

        [OperationBehavior(TransactionAutoComplete = true, TransactionScopeRequired = true)]
        [TransactionFlow(TransactionFlowOption.Mandatory)]
        public bool Onayla()
        {
            Console.WriteLine(TransactionInfo(Transaction.Current,"Onayla metodu &amp;ccedil;ağırıldı"));
            /* Yorum satırı haline getirildiğinde TransactionAutoComplete false ise s&amp;ouml;z konusu transaction abort edilir. Ancak TransactionScopeAutoComplete true ise aşağıdaki metodu &amp;ccedil;ağırmaya gerek kalmadan transaction onaylanır. Ayrıca TransactionAutoComplete &amp;ouml;zelliği true ise, SetTransactionComplete metodunu &amp;ccedil;ağırmak &amp;ccedil;alışma zamanı hatasına neden olur. Bu aktif olan bir transaction var ise bununda iptal edilmesine neden olacaktır. */
            //OperationContext.Current.SetTransactionComplete(); // Bu &amp;ccedil;ağrıdan sonra Transaction.Current null değer d&amp;ouml;nd&amp;uuml;recektir.
            return true;
        }

        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;S&amp;ouml;z konusu servis sınıfı i&amp;ccedil;erisindeki metodlarda herhangibir bağlantı ifadesi yer almamaktadır. Sadece bir alış veriş sepetinin hayali bir uyarlaması bulunmaktadır. Ancak &amp;ouml;nemli olan bazı noktalar vardır. İstemci operasyon &amp;ccedil;ağrılarını ger&amp;ccedil;ekleştirirken ilk olarak &lt;strong&gt;SepeteUrunEkle&lt;/strong&gt; metodunu &amp;ccedil;ağırmalıdır. Operasyonların tamamlanması ise &lt;strong&gt;Onayla&lt;/strong&gt; metodunun &amp;ccedil;ağırılması ile ger&amp;ccedil;ekleşir. Bu metod sırasını sağlamak i&amp;ccedil;in aray&amp;uuml;ze (interface) ait &lt;strong&gt;OperationContract&lt;/strong&gt; niteliği ve &lt;strong&gt;IsInitiating&lt;/strong&gt; ile &lt;strong&gt;IsTerminating&lt;/strong&gt; &amp;ouml;zellikleri kullanılmıştır.&lt;/p&gt;
&lt;p&gt;SiparisYonetici sınıfındaki metodlarda istemci tarafında oluşturulması zorunlu olan bir transaction akışının gelmesini sağlamak i&amp;ccedil;in &lt;strong&gt;TransactionFlow&lt;/strong&gt; niteliklerinde &lt;strong&gt; Mandatory&lt;/strong&gt; değeri kullanılmıştır. Sınıf i&amp;ccedil;erisinde oluşturulan g&amp;uuml;ncel transaction' ları daha kolay takip edeilmek i&amp;ccedil;in TransactionInfo isimli bir metod kullanılmaktadır. &amp;Ccedil;alışma zamanında aktif olan bir transaction' ı elde etmek i&amp;ccedil;in Transaction sınıfının &lt;strong&gt;Current&lt;/strong&gt; &amp;ouml;zelliği ele alınabilir. &lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Servis veya istemci uygulamalarda, kod tarafında &lt;strong&gt;Transaction&lt;/strong&gt;, &lt;strong&gt;TransactionScope&lt;/strong&gt; gibi tipleri kullanabilmek i&amp;ccedil;in projeye &lt;strong&gt;System.Transactions.dll&lt;/strong&gt;' inin referans edilmesi gerekmektedir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;Current&lt;/strong&gt; &amp;ouml;zelliği ile &amp;ccedil;alışma zamanında elde edilen &lt;strong&gt;Transaction&lt;/strong&gt; nesne &amp;ouml;rneği &amp;uuml;zerinden &lt;strong&gt; TransactionInfo&lt;/strong&gt; &amp;ouml;zelliğine ge&amp;ccedil;ilerek g&amp;uuml;ncel transaction hakkında bazı bilgiler toplanabilir. &amp;Ouml;rneğin oluşturulma zamanı &lt;strong&gt;(Creation Time)&lt;/strong&gt;, dağıtık transaction a&amp;ccedil;ılmışsa bunun GUID numarası &lt;strong&gt; (Distributed Transaction Identifier)&lt;/strong&gt; ve hatta transaction' ın o anki durumu &lt;strong&gt;(status)&lt;/strong&gt; gibi. Bu tanımlamalara ek olarak servise ait transaction' ların izolasyon seviyesi &lt;strong&gt;Serializable&lt;/strong&gt;, transaction i&amp;ccedil;in ge&amp;ccedil;erli zaman aşımı &lt;strong&gt;(timeout) &lt;/strong&gt;s&amp;uuml;resi ise 2 dakika olarak belirlenmiştir.&lt;/p&gt;
&lt;p&gt;Servis uygulamasında kullanılacak olan konfigurasyon dosyasının i&amp;ccedil;eriği aşağıdaki gibi tasarlanmalıdır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Servis tarafındaki App.config dosyası;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;bindings&amp;gt;
            &amp;lt;netTcpBinding&amp;gt;
                &amp;lt;binding name="SiparisServisiBindingConfiguration" transactionFlow="true" transactionProtocol="OleTransactions"&amp;gt;
                &amp;lt;/binding&amp;gt;
            &amp;lt;/netTcpBinding&amp;gt;
        &amp;lt;/bindings&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service name="NorthwindYonetici.SiparisYonetici"&amp;gt;
                &amp;lt;endpoint address="net.tcp://localhost:4500/SiparisServisi" binding="netTcpBinding" bindingConfiguration="SiparisServisiBindingConfiguration" name="SiparisServisiEndPoint" contract="NorthwindYonetici.ISiparisYonetici" /&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Dikkat edilmesi gereken noktalardan birisi, &lt;strong&gt;netTcpBinding&lt;/strong&gt; bağlayıcısı i&amp;ccedil;in gerekli konfigurasyon ayarlarında &lt;strong&gt;transactionFlow&lt;/strong&gt; niteliğinin &lt;strong&gt;true&lt;/strong&gt;, &lt;strong&gt; transactionProtocol&lt;/strong&gt; niteliğinin ise &lt;strong&gt;OleTransactions&lt;/strong&gt; olarak set edilmiş olmasıdır. Servis tarafı, &amp;ouml;rneğin daha kolay bir şekilde incelenmesi i&amp;ccedil;in Console uygulaması olarak tasarlanmıştır ve kodları aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;ServiceHost host = new ServiceHost(typeof(NorthwindYonetici.SiparisYonetici));
host.Open();
Console.WriteLine("Sunucu dinlemede");
Console.WriteLine("Servisi durdurmak i&amp;ccedil;in bir tuşa basın");
Console.ReadLine();
host.Close();&lt;/pre&gt;
&lt;p&gt;Bu adımlardan sonra istemci tarafı i&amp;ccedil;in gerekli proxy nesnesinin oluşturulması gerekir. Bunun i&amp;ccedil;in yine &lt;strong&gt; svcutil&lt;/strong&gt; aracından yararlanılabilir. Dikkat edilmesi gereken noktalardan birisi şudur; servis tarafında &lt;strong&gt;TransactionFlow&lt;/strong&gt; niteliklerinde bir değişiklik yapıldığında bunun proxy sınıfı i&amp;ccedil;inde ger&amp;ccedil;ekleştirilmesi bir başka deyişle istemci tarafında g&amp;uuml;ncelleştirilmesi gerekir. Dolayısıyla proxy sınıfının yeniden &amp;uuml;retilmesi gerekecektir. Yada manuel olarak istemci tarafındaki proxy sınıfına m&amp;uuml;dahale edilip bu nitelikler a&amp;ccedil;ık bir şekilde değiştirilmelidir.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z gelimi SiparisYonetici sınıfındaki &lt;strong&gt;TransactionFlow&lt;/strong&gt; niteliklerini &lt;strong&gt;Allowed&lt;/strong&gt; olarak belirleyip, istemciler i&amp;ccedil;in gerekli proxy sınıfını &amp;uuml;rettiğimizi d&amp;uuml;ş&amp;uuml;nelim. Daha sonradan TransactionFlow niteliğinde &lt;strong&gt;Mandatory&lt;/strong&gt; se&amp;ccedil;eneğini kullanır ve proxy sınıfını g&amp;uuml;ncellenmez ise, WCF &amp;ccedil;alışma zamanında &lt;strong&gt; ProtocolException&lt;/strong&gt; tipinden bir istisna (exception) &amp;uuml;retilecektir.&lt;/p&gt;
&lt;p&gt;İstemci tarafında yer alacak konfigurasyon dosyasının i&amp;ccedil;eriğinin aşağıdaki gibi olması gerekmektedir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8"?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;bindings&amp;gt;
            &amp;lt;netTcpBinding&amp;gt;
                &amp;lt;binding name="SiparisYonetimServisiBinding" transactionFlow="true" transactionProtocol="OleTransactions"&amp;gt;
                &amp;lt;/binding&amp;gt;
            &amp;lt;/netTcpBinding&amp;gt;
        &amp;lt;/bindings&amp;gt;
        &amp;lt;client&amp;gt;
            &amp;lt;endpoint address="net.tcp://localhost:4500/SiparisServisi" binding="netTcpBinding" bindingConfiguration="SiparisYonetimServisiBinding" contract="Siparis_Yonetim_Servisi" name="Siparis_Yonetim_Servisi" /&amp;gt;
        &amp;lt;/client&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;İstemci uygulamayıda bir Console olarak tasarladığımızı d&amp;uuml;ş&amp;uuml;necek olursak, &lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisinde aşağıdaki kodları yazmamız gerekecektir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Console.WriteLine("Devam etmek i&amp;ccedil;in bir tuşa basınız");
Console.ReadLine();
Siparis_Yonetim_ServisiClient client = new Siparis_Yonetim_ServisiClient("Siparis_Yonetim_Servisi");
using (TransactionScope tx =new TransactionScope(TransactionScopeOption.RequiresNew))
{
    client.SepeteEkle(11);
    client.SepeteEkle(42);

    client.SepettenCikar(42);

    if(client.SepetiOnayla())
        tx.Complete(); 
}
Console.ReadLine();&lt;/pre&gt;
&lt;p&gt;İstemci uygulamada &lt;strong&gt;TransactionScope&lt;/strong&gt; tipine ait bir nesne &amp;ouml;rneği kullanılarak yeni bir transaction alanı a&amp;ccedil;ılması sağlanmaktadır. Bundan sonrasında ise istemci tarafından servis &amp;uuml;zerindeki bir ka&amp;ccedil; metod arka arkaya &amp;ccedil;ağırılır. Son olarak using bloğu terk edilmeden &amp;ouml;nce eğer SepetiOnayla metodunun d&amp;ouml;n&amp;uuml;ş değeri true ise tx isimli TransactionScope sınıfı nesne &amp;ouml;rneğine ait &lt;strong&gt;Complete&lt;/strong&gt; metodu &amp;ccedil;ağırılır. &amp;Ouml;nce sunucu ve sonrasında ise istemciyi &amp;ccedil;alıştırdığımızda servis tarafındaki console uygulamasında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; elde edilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk210_3.gif" alt="" width="624" height="614" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada dikkat edilmesi gereken ilk nokta, SepeteUrunEkle metodunun ilk &amp;ccedil;ağırılışıyla beraber elde edilen dağıtık transaction &lt;strong&gt;GUID&lt;/strong&gt; numarasının t&amp;uuml;m metod &amp;ccedil;ağrılarında aynı olmasıdır. Bu basit olarak, her operasyonun a&amp;ccedil;ılan transaction scope' a dahil edildiği anlamına da gelmektedir. SepeteUrunEkle metodu i&amp;ccedil;erisinde Transction i&amp;ccedil;in TransactionCompleted olayı y&amp;uuml;klenmiştir. İstemci tarafında SepeteUrunEkle metodu iki kez &amp;ccedil;ağırılmıştır. Bu nedenle iki adet &lt;strong&gt;TransactionCompleted&lt;/strong&gt; olay metodu y&amp;uuml;klenmiş ve g&amp;uuml;ncel transaction' a ait &lt;strong&gt;Commited&lt;/strong&gt; durumu iki kez yakalanmıştır. Olayı daha iyi kavrayabilmek i&amp;ccedil;in servis tarafındaki SiparisYonetici sınıfı i&amp;ccedil;erisindeki SepeteUrunEkle metodu i&amp;ccedil;erisinde aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi &lt;strong&gt;breakpoint&lt;/strong&gt; konulması yerinde bir harekete olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk210_4.gif" alt="" width="631" height="224" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İlk metod &amp;ccedil;ağrısı ile birlikte &lt;strong&gt; Compenent Services&lt;/strong&gt; i&amp;ccedil;erisindeki &lt;strong&gt;Distributed Transaction Coordinator&lt;/strong&gt; kısmına bakıldığında &lt;strong&gt;Transaction List &lt;/strong&gt;i&amp;ccedil;erisinde yeni bir OleTx transaction a&amp;ccedil;ıldığı ve &lt;strong&gt;Transaction Statistics&lt;/strong&gt; kısmındada bu transaction' ın aktif olarak yer aldığı g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk210_5.gif" alt="" width="490" height="136" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Aynı zamanda &lt;strong&gt;Transaction Statistics&lt;/strong&gt; kısmına bakılırsa aşağıdakine benzer bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşılır. Dikkat edilecek olursa aktif olan 1 adet transaction bulunmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk210_6.gif" alt="" width="511" height="374" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Eğer işlemler sonuna kadar devam ettirilirse, transaction' ın başarılı bir şekilde tamamlandığı yine istatistik kısmından g&amp;ouml;r&amp;uuml;lebilir. Burada dikkat edilmesi gereken değer &lt;strong&gt;Commited&lt;/strong&gt;' dır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk210_7.gif" alt="" width="513" height="360" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi Onayla metodundan geriye &lt;strong&gt;false&lt;/strong&gt; değer d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z&amp;uuml; d&amp;uuml;ş&amp;uuml;nelim. Bu durumda istemci tarafındaki &lt;strong&gt; TransactionScope&lt;/strong&gt; sınıfına ait nesne &amp;ouml;rneği &amp;uuml;zerinden &lt;strong&gt;Complete&lt;/strong&gt; metodu tetiklenemiyecektir. Dolayısıyla s&amp;ouml;z konusu transaction' ın iptal edilmiş olması gerekir. Ger&amp;ccedil;ektende uygulama &amp;ccedil;alıştırıldığında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi &lt;strong&gt;TransactionCompleted&lt;/strong&gt; isimli olay metodu tetiklendiğinde, o anki transaction' ın durumunun &lt;strong&gt;Aborted&lt;/strong&gt; olduğu g&amp;ouml;zlemlenebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk210_8.gif" alt="" width="623" height="219" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Benzer şekilde &lt;strong&gt;DTC&lt;/strong&gt; altındaki &lt;strong&gt; Transaction Statistics&lt;/strong&gt; b&amp;ouml;l&amp;uuml;m&amp;uuml;ne bakıldığında bir transaction' ın iptal edildiği bilgisi yer alacaktır. &lt;em&gt;(Bu aşamada olayın daha iyi analiz edilmesi i&amp;ccedil;in &lt;strong&gt;Services&lt;/strong&gt; kısmından &lt;strong&gt;Distributed Transaction Coordinator&lt;/strong&gt; servisi &lt;strong&gt;Restart&lt;/strong&gt; edilmiştir. Bu sebepten aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi &amp;ouml;nceki &amp;ouml;rnekle birlikte toplam 2 transaction olması gerekirken sadece 1 transaction yer almaktadır.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk210_9.gif" alt="" width="363" height="344" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat etmemiz gereken noktalardan biriside &lt;strong&gt;transactionFlow&lt;/strong&gt; elementinin değeridir. Eğer istemci tarafındaki konfigurasyon dosyasında bu &amp;ouml;zelliğin değeri &lt;strong&gt;false&lt;/strong&gt; olarak bildirilirse, &lt;strong&gt;Mandatory&lt;/strong&gt; se&amp;ccedil;eneği nedeni ile WCF &amp;ccedil;alışma zamanında &lt;strong&gt;InvalidOperationException&lt;/strong&gt; istisnası alınır. Benzer durum servis tarafı i&amp;ccedil;inde ge&amp;ccedil;erlidir. Eğer istemcide &amp;ouml;zelliğin değeri true ama servis tarafında false ise yine WCF &amp;ccedil;alışma zamanı servis tarafına bir InvalidOperationException istisnası fırlatacaktır.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalemizde WCF i&amp;ccedil;in transaction y&amp;ouml;netimini biraz daha derinlemesine incelemeye &amp;ccedil;alıştık. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/TransactionKullanimi.zip"&gt;&amp;Ouml;rnek uygulama i&amp;ccedil;in tıklayın.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2007-06-28 12:00:00</pubDate>
  <slug>WCF-Transaction-Yonetimi-(Transaction-Management)-2-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>transaction</tag>
    <tag>transaction-management</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>