<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Private Assembly ve Shared Assembly Kavramı</title>
  <description>Bu makalemizde, .NET'in temellerinden olan Assembly kavramının önemli bir bölümü olan Global Assembly Cache'i incelemeye çalışacağız. Net dilinde, assembly'ları private (özel) ve shared (paylaşımlı) olmak üzere iki kategoriye ayırabiliriz. Private assembly'lar oluşturulduklarında, çalıştırılabilmeleri için, uygulama ile aynı klasör altında yer almalıdırlar. Söz gelimi aşağıdaki gibi bir assembly'a sahip olduğumuzu düşünelim.</description>
  <content>&lt;p&gt;Değerli&amp;nbsp; Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, .NET'in temellerinden olan Assembly kavramının &amp;ouml;nemli bir b&amp;ouml;l&amp;uuml;m&amp;uuml; olan Global Assembly Cache'i incelemeye &amp;ccedil;alışacağız. Net dilinde, assembly'ları private (&amp;ouml;zel) ve shared (paylaşımlı) olmak &amp;uuml;zere iki kategoriye ayırabiliriz. Private assembly'lar oluşturulduklarında, &amp;ccedil;alıştırılabilmeleri i&amp;ccedil;in, uygulama ile aynı klas&amp;ouml;r altında yer almalıdırlar. S&amp;ouml;z gelimi aşağıdaki gibi bir assembly'a sahip olduğumuzu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace PriAsm
{
    public class Hesap
    {
        public double Topla(double a,double b)
        {    
            return a+b;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Visual Studio.Net ortamında bir class library olarak oluşturduğumuz bu assembly derlendiğinde, PriAsm.dll dosyasının oluşturulduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk64_1.gif" alt="" width="146" height="76" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 1. Assembly dosyamız.&lt;/p&gt;
&lt;p&gt;Şimdi, oluşturulan bu assembly i&amp;ccedil;indeki Hesap isimli sınıfımızı, başka bir klas&amp;ouml;rde yer alan bir uygulama i&amp;ccedil;erisinde kullanmak istediğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu durumda, PriAsm.dll dosyamızı, kullanmak istediğimiz uygulamanın klas&amp;ouml;r&amp;uuml;ne kopyalamamız yeterli olucaktır. &amp;Ouml;rneğin aşağıdaki uygulamayı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using PriAsm;

namespace Ornek
{
    class Class1
    {
        static void Main(string[] args)
        {

        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu Console uygulamasını derlemeye &amp;ccedil;alıştığımızda, &lt;strong&gt;"The type or namespace name 'PriAsm' could not be found (are you missing a using directive or an assembly reference?)"&amp;nbsp; &lt;/strong&gt;hatasını alırız. Bu hatayı almamız son derece doğaldır. &amp;Ccedil;&amp;uuml;nk&amp;uuml; PriAsm.dll assembly'ımız private bir assembly'dır. Bunun doğal sonucu uygulamamızın bu assembly hakkında hi&amp;ccedil; bir bilgiye sahip olmamasıdır. Uygulamamıza, PriAsm.dll assembly'ının referans edilmesi gerekmektedir. &amp;Ouml;ncelikle, PriAsm.dll dosyasını, uygulamamızın assembly'ının bulunduğu klas&amp;ouml;re kopylamamız gerekir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk64_2.gif" alt="" width="303" height="160" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 2. PriAsm.dll ile uygulama assemble'ı aynı yerde olmalı.&lt;/p&gt;
&lt;p&gt;Daha sonra ise uygulamamıza PriAsm.dll assembly'ını referans etmemiz gerekir. Bu ama&amp;ccedil;la solution explorer'da assembly ismine sağ tıklanır ve Add Reference se&amp;ccedil;ilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk64_3.gif" alt="" width="224" height="363" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 3. Add Reference.&lt;/p&gt;
&lt;p&gt;Karşımıza gelen Add Reference penceresinden, Projects kısmına ge&amp;ccedil;ilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk64_4.gif" alt="" width="566" height="446" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 4. Projects&lt;/p&gt;
&lt;p&gt;Burada Browse se&amp;ccedil;eneği ile, PriAsm.dll assembly'ının bulunduğu klas&amp;ouml;re gidilir ve bu dll dosyası se&amp;ccedil;ilerek referans ekleme işlemi tamamlanmış olur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk64_5.gif" alt="" width="566" height="446" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 5. Referansın eklenmesi.&lt;/p&gt;
&lt;p&gt;Bu noktadan sonra Solution Explorer penceresine baktığımızda, PriAsm isim alanının eklenmiş olduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk64_6.gif" alt="" width="207" height="215" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 6. PriAsm eklenmiş durumda.&lt;/p&gt;
&lt;p&gt;Artık uygulamamızda bu assembly i&amp;ccedil;indeki sınıfları kolayca kullanabiliriz. Aşağıdaki basit &amp;ouml;rnekte bunu g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using PriAsm;
namespace Ornek
{ 
    class Class1
    {
        static void Main(string[] args)
        {
            Hesap h=new Hesap();
            double sonuc=h.Topla(4,5);
            Console.WriteLine(sonuc.ToString());
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Private assembly'ları bu şekilde kullanmak her zaman tercih edilen bir yol değildir. Nitekim, PriAsm.dll assembly'ının erişebilmek bu dll'in, uygulamanın assembly'ı ile aynı klas&amp;ouml;rde olması gerekmektedir. (Nitekim, PriAsm.dll assembly'ının uygulamanın debug klas&amp;ouml;r&amp;uuml;nden başka bir yere taşınması, uygulamanın derleme zamanında hata vermesine yol a&amp;ccedil;ar. &amp;Ccedil;&amp;uuml;nk&amp;uuml; belirtilen adresteki referans dosyası yerinde değildir. ) Buna karşılık olarak bazen, oluşturduğumuz assembly'a birden fazla uygulamanın aynı yerden erişmesini isteyebiliriz. İşte bu durumda devreye Global Assembly Cahce girmektedir. GAC .NET uygulamaları tarafından paylaşılan bileşenlerin yer aldığı bir veri deposudur. Birden fazla uygulamanın ortak olarak kullanacağı assembly'lar sistemdeki Global Assembly Cache 'e y&amp;uuml;klenerek paylaşılmış(shared) assembly'lar oluşturabiliriz. GAC 'da tutulan assembly'ların g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne,&amp;nbsp; bir Win XP sisteminde C:\WINDOWS\assembly klas&amp;ouml;r&amp;uuml;nden ulaşabiliriz. Burada yer alan assembly'lar, C# kodu ilk olarak y&amp;uuml;r&amp;uuml;t&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde anında derlenir ve GAC &amp;ouml;nbelleğinde tutulurlar.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk64_7.gif" alt="" width="628" height="255" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 7. GAC Assembly'ları.&lt;/p&gt;
&lt;p&gt;Burada dikkat edicek olursanız &amp;ouml;rneğin, System.Data Assembly'ından iki adet bulunmaktadır. Bu iki assembly'ın sistemde sorunsuz bir şekilde &amp;ccedil;alışması, assembly'ların kimliklerinin farklılığı sayesinde m&amp;uuml;mk&amp;uuml;n olmaktadır. Bu farklılığı yaratan GAC i&amp;ccedil;ine kurulan her bir assembly'ın farklı strong name'lere sahip olmasıdır. Bir strong name, bir assembly'ın adı, versiyon numarası, dil bilgileri, dijital imzaları ve public anahtar değeri bilgilerinden oluşur. &amp;Ouml;rneğin System.Data assembly'ının iki versiyonu arasındaki farklar aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk64_8.gif" alt="" width="592" height="419" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk64_9.gif" alt="" width="624" height="363" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 8. Farklılıklar.&lt;/p&gt;
&lt;p&gt;Bir assembly'ın yukarıda bahsedilen bilgileri AssemblyInfo isimli dosyada tutulmaktadır.Şimdi dilerseniz geliştirmiş olduğumuz PriAsm.dll assembly'ını GAC'e nasıl kayıt edeceğimizi incelemeye &amp;ccedil;alışalım. İlk olarak bize bu assembly'ı sistem i&amp;ccedil;in benzersiz (unique) yapacak bir strong name gerekli. Bir strong name &amp;uuml;retmek i&amp;ccedil;in, .Net FrameWork'un sn.exe tool'unu kullanabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk64_10.gif" alt="" width="560" height="163" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 9. Strong Name'in oluşturulması.&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından oluşan Anahtar.sif isimli dosyayı, assembly'ımıza bildirmemiz gerekiyor. Bunun i&amp;ccedil;in AssemblyInfo dosyasındaki AssemblyKeyFile niteliğini kullanacağız. (Burada dosya uzantısının sif olmasının &amp;ouml;zel bir nedeni yok. Ben sifre'nin sif'ini kullandım. Sonu&amp;ccedil; olarak dosya binary yazılacağı i&amp;ccedil;in herhangibir format verilebilir.)&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[assembly: AssemblyKeyFile("D:\\vssamples\\PriAsm\\bin\\debug\\Anahtar.sif")]&lt;/pre&gt;
&lt;p&gt;Artık assembly'ımız bir strong name'e sahip. Dolayısıyla GAC i&amp;ccedil;indeki assembly'lardan ve sonradan gelibilecek olan assembly'lardan tamamıyle farklı bir yapıya b&amp;uuml;r&amp;uuml;nd&amp;uuml;. Artık oluşturduğumuz bu assembly'ı GAC'e alabiliriz. Bunu iki yolla ger&amp;ccedil;ekleştirebiliriz. İlk olarak, .Net Framework'&amp;uuml;n GACUtil.exe tool'unu bu iş i&amp;ccedil;in kullanabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk64_11.gif" alt="" width="572" height="163" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 10. Assembly'ın GAC'e kurulması.&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından GAC klas&amp;ouml;r&amp;uuml;ne baktığımızda, PriAsm assembly'ımızın eklenmiş olduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk64_12.gif" alt="" width="635" height="49" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 11. Assembly'ın GAC'e eklenmesi.&lt;/p&gt;
&lt;p&gt;Diğer yandan aynı işlemi, PriAsm.dll dosyasını bu klas&amp;ouml;re s&amp;uuml;r&amp;uuml;kleyerekte ger&amp;ccedil;ekleştirebiliriz. Artık bu noktadan itibaren, PriAsm assembly'ına ve i&amp;ccedil;indeki sınıflara, herhangibir .net uygulamasından kolayca erişebiliriz. &amp;Ouml;rneğin, herhangibir .net uygulamasından PriAsm assembly'ına ulaşmak i&amp;ccedil;in tek yapmamız gereken assembly'ı uygulamamıza aynı private assembly'larda olduğu gibi referans etmektir. Fakat bu sefer, PriAsm.dll assembly'ını uygulamamızın PE(Portable Executable) dosyasının bulunduğu debug klas&amp;ouml;r&amp;uuml;ne almak gibi bir zorunluluğumuz yoktur. &amp;Ccedil;&amp;uuml;nk&amp;uuml;, programın ilk derlenişinde, PriAsm.dll, GAC'e alınır ve burada tutulur. Dolayısıyla aşağıdaki &amp;ouml;rnek kodların yer aldığı Console Uygulamasının bulunduğu debug klas&amp;ouml;r&amp;uuml;ne PriAsm.dll dosyasının y&amp;uuml;klenmesi gerekmez.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using PriAsm;
namespace ConsoleApplication3
{
    class Class1
    {
        static void Main(string[] args)
        {
            Hesap h=new Hesap();
            double sonuc=h.Topla(1,2);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-04-22 09:00:00</pubDate>
  <slug>Private-Assembly-ve-Shared-Assembly-Kavramı-bsenyurt-com-dan</slug>
  <tags>
    <tag>framework</tag>
    <tag>assembly</tag>
    <tag>common-language-runtime</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>