<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Apache Üzerinden Bir Web API Hizmeti Sunmak</title>
  <description>Bu yazımızda West-World üzerine Apache kuruyor ve 80 portuna gelen talepleri Kestrel'e yönlendirerek bir Asp.Net Web API hizmetini nasıl sunabileceğimizi incelemeye çalışıyoruz. Daha önceden NginX için gerçekleştirdiğimiz vakayı Apache tarafı için ele aldığımızı ifade edebiliriz. Tabii farklı olan bazı noktalar var. Yine de teorinin aynı olduğunu ifade edebiliriz. Bakalım Apache, Ubuntu üzerinde nasıl Reverse Proxy Server haline geliyor. Haydi başlayalım.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/02/apachecore_12.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;K&amp;uuml;&amp;ccedil;&amp;uuml;k bir &amp;ccedil;ocukken her pazar sabahı TRT ekranlarında kovboy(Western) filmleri olurdu. Rahmetli babam ile severek ge&amp;ccedil;irdiğimiz nadide vakitlerdendi. Sanıyorum son yıllarda yine Pazar sabahları ekranlarımızı s&amp;uuml;sl&amp;uuml;yorlar&lt;em&gt;(Bakamıyorum &amp;ccedil;&amp;uuml;nk&amp;uuml; sabahlarımız basketbol antrenmanları ile ge&amp;ccedil;iyor)&lt;/em&gt; Kızılderililer ile s&amp;uuml;varilerin sıklıkla karşı karşıya geldiği, batının en hızlı silahş&amp;ouml;rlerinin yer aldığı filmlere ne hikmetse &amp;ccedil;ok bağlanmıştım.&lt;/p&gt;
&lt;p&gt;Oysa ki&amp;nbsp;okuduğumuz tarih kitapları o zamanlardaki olayların pek de filmlerde g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z gibi olmadığını yazıyor. &amp;Ouml;zellikle de kızılderili yerlilerin durumu d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde. O zamanların pek &amp;ccedil;ok yerli kabilesi g&amp;uuml;n&amp;uuml;m&amp;uuml;z&amp;uuml;n pek &amp;ccedil;ok teknolojisine de isim kaynağı oldu aslında.&amp;nbsp;Bunlardan en pop&amp;uuml;ler olanlarından birisi de sanıyorum ki Apache'dir&lt;em&gt;(Şu isimler de eminim ki &amp;ccedil;ağrışım yapacaktır;Siu, Cheyenn, Comanche...&lt;/em&gt;&lt;em&gt;)&lt;/em&gt;&amp;nbsp; &amp;Uuml;nl&amp;uuml; savaş helikopteri dışında hepimiz onun yazılım d&amp;uuml;nyasındaki &amp;uuml;n&amp;uuml;n&amp;uuml; de duymuşuzdur. Gelelim bug&amp;uuml;n inceleyeceğimiz konuya.&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;enlerde bir s&amp;uuml;redir West-World &amp;uuml;zerinde denemek istediğim vakaların &amp;uuml;st&amp;uuml;nden ge&amp;ccedil;tim. Gerek iş değişikliği gerek Salı,Perşembe g&amp;uuml;nleri veteranlar olarak yaptığımız basketbol ma&amp;ccedil;larının yoğunluğu sebebiyle kuyrukta baya bir araştırma konusu birikmiş durumda. Listeden sırayla ge&amp;ccedil;erken kafada hemen bir ağırlıklandırma yaptım&lt;em&gt;(Scrum i&amp;ccedil;imize işlemiş)&lt;/em&gt; En y&amp;uuml;ksek &amp;ouml;ncelik puanı "Apache &amp;uuml;zerinde bir .Net Core uygulamasının nasıl host ederim?" c&amp;uuml;mlesine aitti. Microsoft'un ilgili dok&amp;uuml;manında CentOS tabanlı sitemler i&amp;ccedil;in bir anlatım bulunuyordu ki bu benim Ubuntu 16.04 d&amp;uuml;nyasında farklı şekilde ele alınabilirdi&lt;em&gt;(ki &amp;ouml;ylede oldu)&lt;/em&gt; Gelin vakit kaybetmeden bu haftasonu West-World &amp;uuml;zerinde neler olmuş bir bakalım.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikle sisteme Apache kurulumunu ger&amp;ccedil;ekleştirdim. Konum ile &amp;ccedil;ok alakalı olmasa da Firewall ayarlarını yapıp, Apache'nin belirli komutlarını inceleyerek devam ettim. Ardından Apache &amp;uuml;zerinde y&amp;ouml;nlendirme(Redirect)&amp;nbsp;ger&amp;ccedil;ekleştirilebilmesi i&amp;ccedil;in konfigurasyon ayarlamaları yaptım. Standard Web API servisini geliştirip aynen NGinX odaklı yaklaşımda olduğu gibi sisteme bir Service dosyası atıp testleri ger&amp;ccedil;ekleştirdim. İlk adımla başlayalım.&lt;/p&gt;
&lt;h1&gt;Apache Kurulumu&lt;/h1&gt;
&lt;p&gt;Kurulum i&amp;ccedil;in standart olarak &amp;ouml;ncelikle bir sistem g&amp;uuml;ncellemesi yapmak, ardından da apache2'yi y&amp;uuml;klemek doğru olacaktı. West-World d&amp;uuml;nyasında her şeyin başı&amp;nbsp;apt-get update idi.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo apt-get update
sudo apt-get install apache2&lt;/pre&gt;
&lt;p&gt;Y&amp;uuml;kleme sonrası apache'nin kullanılabileceği bir ka&amp;ccedil; profil, firewall listesine ilave edilmekte&lt;em&gt;(edilirmiş)&lt;/em&gt;&amp;nbsp;Benim makinemdeki UFW&lt;em&gt;(Uncomplicated Firewall)&lt;/em&gt; listesini &amp;ccedil;ektiğimde aşağıdaki sonu&amp;ccedil;larla karşılaştım.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo ufw app list&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;Bu arada CUPS, Common Unix Printing Systems isimli bir servisin kısaltmasıymış. Bunu da &amp;ouml;ğrenmiş oldum.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/apachecore_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;nceden NginX ile ilgili denemeler de yaptığım i&amp;ccedil;in onlar da listede kendine yer bulmuştu&lt;em&gt;(West-World bir s&amp;uuml;re sonra &amp;ccedil;arpık&amp;nbsp;kentleşme nedeniyle tekrardan yapılandırılmalı sanıyorum ki)&lt;/em&gt; Apache i&amp;ccedil;in &amp;uuml;&amp;ccedil; farklı profil s&amp;ouml;z konusu. Apache isimli profil sadece 80 portunun a&amp;ccedil;ık olduğu ve şifresiz bir trafik imkanı sunmakta. Apache Full, Apache profiline ek olarak 443 nolu porttan şifrelenmiş web trafiğine imkan tanır&lt;em&gt;(Yani TLS/SSL desteği verir)&lt;/em&gt; Apache Secure ise sadece 443 portu kullanılacak şekilde şifrelenmiş web trafiği sağlar. Benim &amp;ouml;rneğim i&amp;ccedil;in 80 portunu kullandırmak yeterliydi. Bu nedenle aşağıdaki komutu kullanarak gerekli etkinleştirmeyi yaptım.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo ufw allow 'Apache'&lt;/pre&gt;
&lt;p&gt;G&amp;uuml;ncel duruma baktığımda ilgili tanımın UFW listesine eklendiğini de g&amp;ouml;rd&amp;uuml;m.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo ufw status&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/apachecore_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemler sonrasında yapmam gereken apache sunucusunun ayağa kalkıp kalkmadığını denetlemekti. Terminalden&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo systemctl status apache2&lt;/pre&gt;
&lt;p&gt;komutunu kullandığımda&amp;nbsp;servisin başarılı bir şekilde y&amp;uuml;klendiğini ve hizmet vermeye başladığını g&amp;ouml;rd&amp;uuml;m.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/apachecore_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;active (running) yazısını g&amp;ouml;rmek &amp;ouml;nemli ama yeterli değil.&amp;nbsp;Hani hepimizin aşina olduğu o Apache'nin varsayılan giriş sayfası var ya...Onu g&amp;ouml;rmek lazımdı.&amp;nbsp;localhost'a talep g&amp;ouml;nderdiğimde o yalın sayfa karşımdaydı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/apachecore_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Birka&amp;ccedil; Apache Komutu&lt;/h2&gt;
&lt;p&gt;Apache sunucusu ile &amp;ccedil;alışırken elbette bir takım y&amp;ouml;netimsel işlemlere gereksinim duyulabilir. Sunucuyu durdurmak, yeniden başlatmak, konfigurasyon değişikliklerini tekrardan y&amp;uuml;klemek ve diğerleri. Bu işlemler i&amp;ccedil;in aşağıdaki komutlardan yararlanılabilir.&lt;/p&gt;
&lt;p&gt;Durdurmak i&amp;ccedil;in,&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo systemctl stop apache2&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/apachecore_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Başlatmak i&amp;ccedil;in,&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo systemctl start apache2&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/apachecore_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Servisi durdurup tekrar başlatmak i&amp;ccedil;in,&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo systemctl restart apache2&lt;/pre&gt;
&lt;p&gt;Konfigurasyon değişikliklerini bağlantıyı kopartmadan y&amp;uuml;klemek i&amp;ccedil;inse&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo systemctl reload apache2&lt;/pre&gt;
&lt;h1&gt;ModProxy &amp;Ouml;zelliğini Etkinleştiriyoruz&lt;/h1&gt;
&lt;p&gt;Artık West-World'de gezinen bir Apache olduğuna g&amp;ouml;re basit bir .Net Core Web API hizmeti yazıp bunu apache &amp;uuml;zerinden host etmeyi deneyebilirdim. Aslında olay NginX senaryosundakine &amp;ccedil;ok benziyor. Apache'yi reverse proxy server rol&amp;uuml;nde &amp;ccedil;alışacak hale getirip localhost 80 portuna gelen taleplerin kestrel'e y&amp;ouml;nlendirilmesini sağlamak işin anafikri diyebiliriz&lt;em&gt;(Tam tersi istikamette s&amp;ouml;z konusu tabii)&amp;nbsp;&lt;/em&gt;İlk adım ise modproxy'yi etkinleştirmek. Bu sayede apache sunucumu&amp;nbsp;HTTP&amp;nbsp;taleplerini y&amp;ouml;nlendirecek kıvama getirebileceğim. Bunun i&amp;ccedil;in terminalden aşağıdaki komutu vermek gerekiyor.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo a2enmod proxy proxy_http proxy_html&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/apachecore_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Gerekli aktivasyonu sağladıktan sonra&amp;nbsp;konfigurasyon değişikliği yapıp y&amp;ouml;nlendirme tanımlarını sisteme ilave ettim.&amp;nbsp;S&amp;ouml;z konusu konfigurasyon değişiklikleri i&amp;ccedil;in env/apache2/sites-enabled altındaki 000-default.conf dosyasının i&amp;ccedil;eriğini d&amp;uuml;zenlemek gerekiyor.&amp;nbsp;Bu varsayılan site dosyası. Aslında bu klas&amp;ouml;re farklı sanal host tanımlama bilgileri i&amp;ccedil;eren conf uzantılı dosyalar y&amp;uuml;kleyebiliyoruz. Bu dosyalar apache sunucusu tarafından otomatik olarak değerlendirilmekte. &amp;Ouml;rneğin merak ettiğim konulardan birisi localhost'un farklı bir portu i&amp;ccedil;in sanal host konfigurasyon dosyası tanımlamak ve yine y&amp;ouml;nlendirmeler yaparak Kestrel'i ayağa kaldırmak&lt;em&gt;(Bunu bir araştırmam lazım)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;VirtualHost *:80&amp;gt;
ServerAdmin webmaster@localhost
DocumentRoot /var/www/html

ProxyPreserveHost On
ProxyPass / http://localhost:5558/
ProxyPassReverse / http://localhost:5558/
ErrorLog ${APACHE_LOG_DIR}/error.log
CustomLog ${APACHE_LOG_DIR}/access.log combined
&amp;lt;/VirtualHost&amp;gt;

# vim: syntax=apache ts=4 sw=4 sts=4 sr noet&lt;/pre&gt;
&lt;p&gt;Tahmin edileceği &amp;uuml;zere bir sanal host tanımı var. 80 portu ile Kestrel'in standart 5000 yerine bu &amp;ouml;rnek &amp;ouml;zelinde tercih ettiğim 5558 portu arasında reverse proxy kullanımı olacağı belirtiliyor. Bu değişiklikten sonra apache servisini tekrardan başlattım&lt;em&gt;(restart)&lt;/em&gt; ve g&amp;uuml;ncel durum bilgisini &amp;ccedil;ektim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo service apache2 restart
sudo service apache2 status&lt;/pre&gt;
&lt;p&gt;Şimdilik bir sorun g&amp;ouml;r&amp;uuml;nm&amp;uuml;yordu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/apachecore_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Web API ve Apache Service Dosyasının Oluşturulması&lt;/h1&gt;
&lt;p&gt;T&amp;uuml;m bunlar yeterli değil. Apache'nin bu konfigurasyon dosyası bilgisine g&amp;ouml;re, 80 portuna gelen talep i&amp;ccedil;in Kestrel &amp;ccedil;alışma zamanını da nasıl işleteceğini bilmesi lazım. Bir service dosyası oluşturmalı ve i&amp;ccedil;erisinde gerekli ortam bilgilendirmelerini belirtmeliyiz. Ama her şeyden &amp;ouml;nce bir Web API projesi oluştursam hi&amp;ccedil; fena olmazdı. Bunun yolunu artık siz de benim kadar iyi biliyorsunuz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new webapi -o apacheler&lt;/pre&gt;
&lt;p&gt;Kodda yaptığım tek değişiklik sunucu adresini ayarlamak oldu. Program.cs i&amp;ccedil;erisindeki BuilWebHost fonksiyonunu aşağıdaki gibi d&amp;uuml;zenledim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public static IWebHost BuildWebHost(string[] args) =&amp;gt;
WebHost.CreateDefaultBuilder(args)
.UseStartup&amp;lt;Startup&amp;gt;()
.UseUrls("http://localhost:5558")
.Build();&lt;/pre&gt;
&lt;p&gt;Kod d&amp;uuml;zenlemesi sonrası projeyi publish ettim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet publish -c Release&lt;/pre&gt;
&lt;p&gt;Apa&amp;ccedil;iler'in k&amp;uuml;lt&amp;uuml;rel &amp;ouml;zelliklerine ait bir &amp;ccedil;ok sırrı sunacağını hayal ettiğim web api servisimiz i&amp;ccedil;in /etc/systemd/system klas&amp;ouml;r&amp;uuml; altında kestrel-apacheler.service isimli bir dosya oluşturup i&amp;ccedil;eriğini aşağıdaki hale getirdim.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;[Unit]
Description=Apa&amp;ccedil;iler hakkında gizemli bilgiler sunan web api

[Service]
WorkingDirectory=/home/burakselyum/dotnetcore/apacheler
ExecStart=/usr/share/dotnet/dotnet /home/burakselyum/dotnetcore/apacheler/bin/Release/netcoreapp2.0/publish/apacheler.dll
Restart=always
RestartSec=30
SyslogIdentifier=apachelerlog
User=root
Environment=ASPNETCORE_ENVIRONMENT=Production

[Install]
WantedBy=multi-user.target&lt;/pre&gt;
&lt;p&gt;Dosyanın &amp;uuml;&amp;ccedil; par&amp;ccedil;ası bulunuyor. Unit kısmında servise ait bir a&amp;ccedil;ıklamaya yer verilmekte. Servisin &amp;ccedil;alışacağı klas&amp;ouml;r WorkingDirectory bilgisi ile belirtilmekte. ExecStart, dotnet.exe'yi&lt;em&gt;(West World i&amp;ccedil;in ge&amp;ccedil;erli olan bu lokasyon sizin ortamınızda farklı olabilir)&lt;/em&gt; kullanarak publish edilen apacheler hizmetini başlatmakta. Bir nevi dotnet start işlemini ger&amp;ccedil;ekleştirdiğini ifade edebiliriz. Hata olması halinde her zaman restart işlemi uygulanacağını da belirtiyoruz. Buradaki dayanma s&amp;uuml;remiz de 30 saniye. Servis hizmete girdikten sonra sistemden log'ları incelemek isteyebiliriz. SyslogIdentifier'a atanan apachelerlog kelimesi ile bu i&amp;ccedil;erikleri daha kolay ayırt etme şansımız var. Kullanıcı olarak ben root'a yetki verdim ama bunu alana &amp;ouml;zel bir kullanıcı bazında kullandırmak daha doğru olabilir.&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;Testler&lt;/h1&gt;
&lt;p&gt;Servis dosyası artık hazır. Şimdi bunu etkinleştirip devreye almak gerekiyor. Devreye aldıktan sonra da servis durumunu g&amp;ouml;zlemlemekte yarar var. Terminalden systemctl komutu kullanılarak bu işlemler ger&amp;ccedil;ekleştirilebilir. &amp;Ouml;nce etkinleştir(enable), sonra başlat(start) ve g&amp;uuml;ncel durumu izle(status).&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo systemctl enable kestrel-apacheler.service
sudo systemctl start kestrel-apacheler.service
sudo systemctl status kestrel-apacheler.service&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/apachecore_9.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;zlemlediğim kadarı ile kestrel-apacheler.service i&amp;ccedil;eriği ge&amp;ccedil;erliydi ve &amp;ccedil;alışır konumdaydı. Bunu g&amp;ouml;rd&amp;uuml;kten sonra Firefox'tan&amp;nbsp;http://localhost/api/values adresine gitmeyi denedim. Son ayların en pop&amp;uuml;ler değer listesine erişebilmiştim.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/apachecore_10.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;zlerime inanamıyordum. Emin olmak i&amp;ccedil;in onları bir ka&amp;ccedil; kez kırptım. Sonrasında daha ger&amp;ccedil;ek&amp;ccedil;i olmaya karar verdim ve service dosyasını durdurup aynı talebi tekrar g&amp;ouml;nderdim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo systemctl stop kestrel-apacheler.service&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/apachecore_11.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu &amp;ccedil;ok sevindirici bir gelişmeydi&lt;em&gt;(İnsanın Service Unavailable yazısını g&amp;ouml;r&amp;uuml;nce sevin&amp;ccedil;ten g&amp;ouml;zleri yaşarı mı?)&lt;/em&gt;&amp;nbsp;West-World'de Apache'ler ile barış sağlandığına g&amp;ouml;re artık dinlenmeye &amp;ccedil;ekilebilirdim. Tabii siz bu yazıdan ilham alarak konuyu geliştirmeyi deneyebilirsiniz. S&amp;ouml;z gelimi 000-default.conf yerine aynı klas&amp;ouml;rde farklı bir conf dosyasını kullanarak ilgili y&amp;ouml;nlendirmenin nasıl yapılabileceğini araştırabilirsiniz. &amp;Ouml;zellikle 80 yerine farklı bir Apache portu kullandırtmayı deneyebilirsiniz. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu yazımızda Ubuntu 16.04 &amp;uuml;zerinde kurduğumuz apache sunucusuna gelen talepleri, Kestrel tarafında host edilen bir Web API hizmetine y&amp;ouml;nlendirmeye &amp;ccedil;alıştık. Umarım yararlı bir makale olmuştur. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2018-03-22 03:13:00</pubDate>
  <slug>apache-uzerinden-bir-web-api-hizmeti-sunmak</slug>
  <tags>
    <tag>apache</tag>
    <tag>net-core</tag>
    <tag>net-core-20</tag>
    <tag>hosting</tag>
    <tag>reverse-proxy</tag>
    <tag>kestrel</tag>
    <tag>c#</tag>
    <tag>web-api</tag>
    <tag>aspnet-web-api</tag>
    <tag>systemctl</tag>
    <tag>modproxy</tag>
    <tag>ufw</tag>
    <tag>open-source</tag>
    <tag>apache-foundation</tag>
    <tag>ubuntu</tag>
    <tag>ubuntu-server</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
  </categories>
</post>