<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Bellek Yönetiminde Verimlilik için İpuçları (Rust Odaklı)</title>
  <description>Unmanaged ortamlarda gezinmek birçok yeni veya unutulmuş bilgiyi de karşıma çıkarıyor. Geçtiğimiz günlerde devasa boyutlarda JSON tabanlı logları işlerken Interning stratejisi ile belleğe alınan büyük boyutlu veri kümesinin nasıl optimize edilebileceğini öğrendim. Belli senaryolarda (her zaman da avantajlı olmayabiliyor) çok sık tekrar eden string içerikler için heap bölgesinde tahsisat yapılırken gereksiz alan ayırmak yerine, bunları referans eden tekil pointer'lardan yararlanmak ve hatta benzersiz sayısal değerlerle (örneğin pozitif bir tam sayı ile) bir vektör içerisinde tutup (Intern havuzu olarak da ifade ediliyor) erişimi hızlandırmak mümkün.</description>
  <content>&lt;p&gt;Unmanaged ortamlarda gezinmek bir&amp;ccedil;ok yeni veya unutulmuş bilgiyi de karşıma &amp;ccedil;ıkarıyor. Ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde devasa boyutlarda &lt;strong&gt;JSON&lt;/strong&gt; tabanlı logları işlerken &lt;strong&gt;Interning&lt;/strong&gt; stratejisi ile belleğe alınan b&amp;uuml;y&amp;uuml;k boyutlu veri k&amp;uuml;mesinin nasıl optimize edilebileceğini &amp;ouml;ğrendim. Belli senaryolarda&lt;em&gt;(her zaman da avantajlı olmayabiliyor)&lt;/em&gt; &amp;ccedil;ok sık tekrar eden &lt;strong&gt;string&lt;/strong&gt; i&amp;ccedil;erikler i&amp;ccedil;in &lt;strong&gt;heap&lt;/strong&gt; b&amp;ouml;lgesinde tahsisat yapılırken gereksiz alan ayırmak yerine, bunları referans eden tekil pointer'lardan yararlanmak ve hatta benzersiz sayısal değerlerle &lt;em&gt;(&amp;ouml;rneğin pozitif bir tam sayı ile)&lt;/em&gt; bir vekt&amp;ouml;r i&amp;ccedil;erisinde tutup&lt;em&gt;(&lt;strong&gt;Intern&lt;/strong&gt; havuzu olarak da ifade ediliyor)&lt;/em&gt; erişimi hızlandırmak m&amp;uuml;mk&amp;uuml;n. Tam anlamıyla bellek seviyesinde optimizasyon ve performans kazanımı s&amp;ouml;z konusu.&lt;/p&gt;
&lt;p&gt;Biraz karışık bir c&amp;uuml;mle oldu ama kaynak olarak sunacağım &lt;a href="https://gendignoux.com/blog/2025/03/03/rust-interning-2000x.html" target="_blank"&gt;şu yazının uzunluğu&lt;/a&gt;&amp;nbsp;d&amp;uuml;ş&amp;uuml;n&amp;uuml;l&amp;uuml;nce elden bu kadar geldi. Yazıda Paris'in herkese a&amp;ccedil;ık ulaşım verilerinden yararlanılıyor. Veriler &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k ve yazarın iddiasına g&amp;ouml;re 2bin kata kadar k&amp;uuml;&amp;ccedil;&amp;uuml;lt&amp;uuml;lebiliyor. &amp;Ouml;rneğin sadece &lt;strong&gt;String&lt;/strong&gt; veriler &amp;uuml;zerine yapılan &lt;strong&gt;Interning&lt;/strong&gt; tekniğinin &lt;strong&gt;%47&lt;/strong&gt; oranında yer kazanımı sağladığı ifade ediliyor. Tabii olay bellek y&amp;ouml;netimi, bellek operasyonlarında optimizasyon ve performans işlemleri denilince karşımıza &amp;ccedil;ıkan daha bir&amp;ccedil;ok konu var. &amp;Ouml;rneğin &lt;strong&gt;Region-Based Management&lt;/strong&gt; konseptinde yer bulan &lt;strong&gt;Area Allocators&lt;/strong&gt;, &lt;strong&gt;Copy on Write&lt;em&gt;(CoW)&lt;/em&gt;&lt;/strong&gt;, &lt;strong&gt;Zero Cost Abstraction&lt;/strong&gt;, &lt;strong&gt;Memory/Object Pooling&lt;/strong&gt;, &lt;strong&gt;Cache-Aware Programming&lt;/strong&gt;, Enum'larda &lt;strong&gt;Padding&lt;/strong&gt; ve &lt;strong&gt;Allignment&lt;/strong&gt; kullanımı gibi&lt;/p&gt;
&lt;p&gt;Bu yazıda ilgili kavramlar aşağıdaki konu başlıkları &amp;ccedil;er&amp;ccedil;evesinde ele alınmakta.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Cow - Copy on Write/Clone on Write
&lt;ul&gt;
&lt;li&gt;Dirty Cow Mevzusu&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Arena Allocators
&lt;ul&gt;
&lt;li&gt;AtomicUsize Kullanımı&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;Struct/Enum T&amp;uuml;rlerinde Padding ve Allignment&lt;/li&gt;
&lt;li&gt;Memory/Object Pooling&lt;/li&gt;
&lt;li&gt;Cache-Friendly Programming&lt;/li&gt;
&lt;li&gt;Zero Cost Abstraction&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Rust, zaten sahip olduğu bazı &amp;ouml;zellikleri ile&lt;em&gt;(&lt;strong&gt;Ownership&lt;/strong&gt;, &lt;strong&gt;borrow-checker&lt;/strong&gt;, &lt;strong&gt;lifetimes&lt;/strong&gt; vb)&lt;/em&gt; belleği g&amp;uuml;venli noktada tutmak i&amp;ccedil;in &amp;ccedil;eşitli imkanlar sağlıyor&lt;em&gt;(Bilindiği &amp;uuml;zere Rust'ta bir &lt;strong&gt;Garbage Collector&lt;/strong&gt; mekanizması yok)&lt;/em&gt; Yine de bazı senaryolarda belleği efektif kullanmak i&amp;ccedil;in az &amp;ouml;nce saydığım yaklaşımlara da değinmek gerekiyor. S&amp;ouml;z gelimi &lt;strong&gt;Interning&lt;/strong&gt; konusunda yazılmış duruma g&amp;ouml;re tercih edilebilecek bir&amp;ccedil;ok yardımcı crate mevcut.&lt;/p&gt;
&lt;h2&gt;CoW&lt;em&gt;(Copy on Write)&lt;/em&gt;&lt;/h2&gt;
&lt;p&gt;Sadece gerektiği zaman veri kopyalanmasını &amp;ouml;neren bir teknik olduğu ifade ediliyor. Bunu ş&amp;ouml;yle de ifade edebiliriz; Koypalama işlemini ilk yazma anına kadar &amp;ouml;telemek. Rust i&amp;ccedil;erisinde bu felsefe ile donatılmış &lt;strong&gt;Cow&lt;/strong&gt; isimli bir &lt;strong&gt;enum&lt;/strong&gt; t&amp;uuml;r&amp;uuml; bulunuyor&lt;em&gt;(ki bu ayrıca bir &lt;strong&gt;Smart Pointer&lt;/strong&gt; t&amp;uuml;r&amp;uuml;d&amp;uuml;r)&lt;/em&gt; Diğer yandan resmi kaynaklarda a&amp;ccedil;ılımı &lt;strong&gt;Clone on Write&lt;/strong&gt; şeklindedir. Bu enum t&amp;uuml;r&amp;uuml; i&amp;ccedil;erdiği veriyi ya &amp;ouml;d&amp;uuml;n&amp;ccedil; alır&lt;em&gt;(borrow)&lt;/em&gt; ya da yeni bir kopyası ile sahipliğini alır&lt;em&gt;(ownership)&lt;/em&gt; Dolayısıyla veriyi değiştirme ihtiyacı yoksa referansını kullanır ama değişiklik gerekirse de ilk değişiklik gerektiği noktada verinin bir klonu hazırlanıp sahipliği ele alınır. Bu noktada aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;use std::borrow::Cow;

fn main() {
    let user_one = "Super Mario";
    let player_two = "Ready Player One";
    let length = 16;

    println!("{}", padding_end(user_one, length));
    println!("{}", padding_end(player_two, length));
}

fn padding_end&amp;lt;'a&amp;gt;(input: &amp;amp;'a str, target_len: usize) -&amp;gt; Cow&amp;lt;'a, str&amp;gt; {
    if input.len() &amp;lt; target_len {
        // Yeni string oluşturur ve target_len'e g&amp;ouml;re belli sayıda _ karakteri ekler
        Cow::Owned(format!("{:_&amp;lt;width$}", input, width = target_len))
    } else {
        // Yeterli uzunlukta olduğu i&amp;ccedil;in yeni bir versiyon oluşturmadan orijinal referansı d&amp;ouml;nd&amp;uuml;r&amp;uuml;r
        Cow::Borrowed(input)
    }
}&lt;/pre&gt;
&lt;p&gt;Burada neler oluyor bir değerlendirelim. Son derece anlamsız bir fonksiyon olan &lt;strong&gt;padding_end&lt;/strong&gt;, parametre olarak gelen literalın sonuna &lt;strong&gt;target_len&lt;/strong&gt; ile belirtildiği kadar &lt;strong&gt;_&lt;/strong&gt; işareti ekliyor ancak gelen i&amp;ccedil;eriğin uzunluğu zaten o kadar ise eklemiyor. Yalnız bu ekleme ve &lt;span style="text-decoration: underline;"&gt;eklememe&lt;/span&gt; arasında &amp;ouml;nemli bir fark var. İfade sonunda boşluklar kalmışsa yeni bir &lt;strong&gt;String&lt;/strong&gt; değer oluşturuluyor ve sahipliği fonksiyondan geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;yor&lt;em&gt;(Owned &amp;ccedil;ağrısı)&lt;/em&gt;&amp;nbsp;Diğer durumda ise orjinal referans d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;yor&lt;em&gt;(Borrowed &amp;ccedil;ağrısı)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Copy on Write&lt;/strong&gt; metodolojisi işletim sistemlerinde ortak page kullanımlarında ya da &lt;strong&gt;immutable&lt;/strong&gt; veritabanı yapılarında yaygın olarak kullanılmakta. G&amp;ouml;zle g&amp;ouml;rmedim o y&amp;uuml;zden ispat edemem ancak Rust'ın &lt;strong&gt;Clone on Write&lt;/strong&gt; &amp;ouml;zelliğinin daha &amp;ccedil;ok programlama dili ile ilgili olduğu da belirtilmekte. Genel ve yaygın adı Copy on Write olsa da Rust tarafındaki CoW doğrudan mutasyona izin vermediği i&amp;ccedil;in daha &amp;ccedil;ok Clone on Write olarak ifade edilmektedir ama &amp;ouml;z&amp;uuml;nde benzer bir felsefeye sahip olduklarını ifade edebiliriz.&lt;/p&gt;
&lt;p&gt;Konuyu pekiştirmek amacıyla farklı bir &amp;ouml;rnekle devam edelim.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn remove_ellipsis_dots(input: &amp;amp;str) -&amp;gt; String {
    input.to_string().replace('`', "")
}&lt;/pre&gt;
&lt;p&gt;Yukarıdaki fonksiyon gelen literal i&amp;ccedil;erisindeki &amp;uuml;sten virg&amp;uuml;l işaretlerini bulup kaldırıyor. Burada yeni bir &lt;strong&gt;String&lt;/strong&gt; t&amp;uuml;r&amp;uuml;n&amp;uuml;n oluşturulması s&amp;ouml;z konusu ve bu her seferinde yapılıyor. Bir başka deyişle gelen input i&amp;ccedil;erisinde &amp;uuml;stten virg&amp;uuml;l işaret yoksa bile bir &lt;strong&gt;String&lt;/strong&gt; &amp;uuml;retimi s&amp;ouml;z konusu. İşte tam bu noktada eğer &amp;uuml;stten virg&amp;uuml;l yoksa aynı referansın kullanılmaya devam edilmesi sağlanabilir. Bunu &lt;strong&gt;Cow&lt;/strong&gt; t&amp;uuml;r&amp;uuml;n&amp;uuml; kullanarak aşağıdaki gibi ger&amp;ccedil;ekleştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn remove_ellipsis_dots(input: &amp;amp;str) -&amp;gt; Cow&amp;lt;str&amp;gt; {
    if input.contains('`') {
        Cow::Owned(input.to_string().replace('`', ""))
    } else {
        Cow::Borrowed(input)
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2025/Nisan/cow_runtime.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Veri manupilasyonu sadece gerektiği zamanlarda yapılmış olur.&lt;/p&gt;
&lt;h3&gt;Dirty Cow Mevzusu&lt;em&gt;(Pis İnek :P)&lt;/em&gt;&lt;/h3&gt;
&lt;p&gt;Dirty Cow olarak isimlendirilen &lt;a href="https://cve.mitre.org/cgi-bin/cvename.cgi?name=cve-2016-5195" target="_blank"&gt;bir g&amp;uuml;venlik zafiyeti&lt;/a&gt; var. &lt;strong&gt;Copy on Write&lt;/strong&gt; 'ın yanlış kullanımı neticesinde salt okunur veri alanına &amp;ccedil;eşitli ayrıcalıklar&lt;em&gt;(privilages)&lt;/em&gt; eklenmesi sonucu b&amp;ouml;yle bir zafiyet oluşmuş ve 2018 &amp;ouml;ncesi s&amp;uuml;r&amp;uuml;me sahip bir&amp;ccedil;ok Linux sistemi durumdan etkilenmiş. Aslında durumun vehameti &lt;a href="https://en.wikipedia.org/wiki/Dirty_COW" target="_blank"&gt;Wikipedia' da&lt;/a&gt; &amp;ouml;zetlenmiş. S&amp;ouml;z konusu g&amp;uuml;venlik zafiyetine konu olan &lt;strong&gt;Copy on Write&lt;/strong&gt; stratejisinin Rust tarafındaki &lt;strong&gt;CoW&lt;/strong&gt; kullanımı ile bir ilişkisi olmayabilir zira Rust&amp;rsquo;taki Cow, Linux &amp;ccedil;ekirdeği seviyesindeki Copy-on-Write mekanizmasıyla aynı değildir. Rust&amp;rsquo;taki &lt;strong&gt;Cow&lt;/strong&gt; t&amp;uuml;r&amp;uuml; tamamen kullanıcı seviyesi&lt;em&gt;(user-space)&lt;/em&gt; işleyen bir veri yapısıdır ve işletim sistemi seviyesinde process bazlı sayfa&lt;em&gt;(page)&lt;/em&gt; paylaşımı yapmaz. Tabii s&amp;ouml;z konusu g&amp;uuml;venlik zafiyeti &lt;strong&gt;Data Races&lt;/strong&gt; oluşması halinden, doğru zamanlama ile salt okunur bellek sayfalarına ayrıcalıklar &lt;em&gt;(privilages)&lt;/em&gt; eklenmesinden ve uzaktan root kullanıcı ayrıcalıklarına sahip olunabilmesinden bahseder ki bunlara sebebiyet veren durumlar Rust'ın &lt;strong&gt;ownership&lt;/strong&gt;, &lt;strong&gt;borrow checker&lt;/strong&gt; gibi mekanizmaları sayesinde hen&amp;uuml;z derleme aşamasından engellenir. Yine de &lt;strong&gt;unsafe&lt;/strong&gt; alanlarda &amp;ccedil;alışırken veya &lt;strong&gt;Arc&lt;/strong&gt; kullanımlarında dikkatli olmakta yarar var.&lt;/p&gt;
&lt;h2&gt;Arena Allocators&lt;/h2&gt;
&lt;p&gt;N sayıda nesne i&amp;ccedil;in bellekte baştan bir yer ayırıp&lt;em&gt;(allocate)&lt;/em&gt; bunları bu alanda toplamak ve sonrasında hepsini tek seferde d&amp;uuml;ş&amp;uuml;rmek&lt;em&gt;(deallocate)&lt;/em&gt; istediğimiz senaryolarda kullanılan bir teknik olarak ifade edilebilir. Temel &amp;ccedil;alışma prensibine g&amp;ouml;re program ayağa kalkarken bellekte belli bir b&amp;ouml;lge bu iş i&amp;ccedil;in tahsis edilir ve gerekli nesneler s&amp;ouml;z konusu alana ardışıl olarak yerleştirilir. B&amp;ouml;lgenin serbest bırakılması nesnelerin de topluca ve tek seferde bellekten d&amp;uuml;ş&amp;uuml;r&amp;uuml;lmesi anlamına gelir. Bir arena oluşturulduğunda işaret&amp;ccedil;i&lt;em&gt;(pointer)&lt;/em&gt; başlangı&amp;ccedil; konumuna alınır ve diğer nesnelere ardışıl olarak ulaşılması da kolaylaşır ki bunun da performans a&amp;ccedil;ısından &amp;ouml;nemli bir artısı olduğu s&amp;ouml;ylenebilir. Hatta bu alanlar işletim sistemlerinin kullandığı &amp;ouml;n belleklere de benzetilir.&lt;/p&gt;
&lt;p&gt;Bu stratejide t&amp;uuml;m bellek b&amp;ouml;lgesinin tek seferde d&amp;uuml;şmesi en &amp;ouml;nemli noktalardan birisidir ancak zamanı geldiğinde tek tek d&amp;uuml;ş&amp;uuml;r&amp;uuml;lmesi gereken nesneler s&amp;ouml;z konusu ise bunları arena i&amp;ccedil;erisinde ele almak m&amp;uuml;mk&amp;uuml;n değildir ya da tam tersi nesneler topluca serbest kalırken yaşaması gerekenler varsa bu y&amp;ouml;ntem kullanışlı olmayacaktr. Bir başka deyişle aynı yaşam &amp;ouml;mr&amp;uuml;ne&lt;em&gt;(life-time)&lt;/em&gt; sahip ya da birlikte sona eren ve &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k boyutlu olmayan nesnelerin organizasyonu i&amp;ccedil;in daha idealdir. Rust'ta bu ama&amp;ccedil;la kullanabilecek bir&amp;ccedil;ok crate mevcut. Bunlardan birisi de &lt;a href="https://crates.io/crates/bumpalo" target="_blank"&gt;bumpalo&lt;/a&gt; ve işte basit bir kullanım &amp;ouml;rneği.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;use bumpalo::Bump;

#[derive(Debug)]
struct Position {
    x_value: u32,
    y_value: u32,
    z_value: u32,
}

pub fn run() {
    let bump = Bump::new();

    let player_one = bump.alloc(Position {
        x_value: 10,
        y_value: 20,
        z_value: 0,
    });
    let player_two = bump.alloc(Position {
        x_value: 15,
        y_value: 5,
        z_value: 30,
    });
    let john_doe = bump.alloc(Position {
        x_value: 3,
        y_value: 5,
        z_value: 8,
    });

    println!("Player One Adresi {:p}", player_one);
    println!("Player Two Adresi {:p}", player_two);
    println!("John Doe Adresi {:p}", john_doe);

    let player_one_addr = player_one as *const _ as usize;
    let player_two_addr = player_two as *const _ as usize;
    let john_doe_addr = john_doe as *const _ as usize;

    println!(
        "Ger&amp;ccedil;ek Player Two - Player One adres farkı: {} byte",
        address_diff(player_two_addr, player_one_addr)
    );
    println!(
        "Ger&amp;ccedil;ek John Doe - Player Two adres farkı: {} byte",
        address_diff(john_doe_addr, player_two_addr)
    );
    
    // Arena burada scope'dan &amp;ccedil;ıkarken i&amp;ccedil;indeki t&amp;uuml;m Player nesneleri de tek seferde d&amp;uuml;ş&amp;uuml;r&amp;uuml;lecektir
}

fn address_diff(a: usize, b: usize) -&amp;gt; usize {
    if a &amp;gt; b { a - b } else { b - a }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnekte &lt;strong&gt;bump&lt;/strong&gt; nesnesi oluşturulduktan sonra i&amp;ccedil;erisine &amp;uuml;&amp;ccedil; farklı &lt;strong&gt;Position&lt;/strong&gt; değişkeni ekleniyor. Sadece bu &amp;ouml;rnek &amp;ouml;zelinde değişkenleri kodlama sırası ile olmasa da ardışıl olarak dizildiklerini ispat edebilmek i&amp;ccedil;in bellek adresleri arasındaki farklar hesaplanıyor. &lt;strong&gt;Position&lt;/strong&gt; yapısı 4 byte'tan oluşan 3 alan i&amp;ccedil;ermekte ve dolayısıyla &lt;em&gt;12 byte yer kaplamakta&lt;/em&gt;. Buna g&amp;ouml;re nesnelerin başlangı&amp;ccedil; adresleri arasında &lt;em&gt;12 byte mesafe olmalı&lt;/em&gt;. Elbette bunu &amp;ccedil;ok daha b&amp;uuml;y&amp;uuml;k boyutlu bir nesne k&amp;uuml;mesi i&amp;ccedil;in kontrol etmek lazım, tam bir ispattır diyemeyiz.&lt;/p&gt;
&lt;p&gt;Bilindiği &amp;uuml;zere rust programlama dili &amp;ccedil;alışma zamanında nesnelerin temizlenmesi i&amp;ccedil;in &lt;strong&gt;Resource Acquisition is Initialization&lt;em&gt;(RAII)&lt;/em&gt; &lt;/strong&gt;prensibini kullanır. Buna g&amp;ouml;re bir değer scope dışına &amp;ccedil;ıktığında bellekten otomatik olarak d&amp;uuml;şer ve hatta referans t&amp;uuml;rl&amp;uuml; yani heap bazlı bir nesne ise&lt;em&gt;(Box edilmiş bir t&amp;uuml;r, Vector gibi)&lt;/em&gt; &lt;strong&gt;drop trait&lt;/strong&gt; davranışı &amp;ccedil;alıştırılır. &lt;strong&gt;Area Allocator&lt;/strong&gt; teorisinde ise bu bellek alanının tek seferde d&amp;uuml;ş&amp;uuml;r&amp;uuml;lmesi s&amp;ouml;z konusu. Dolayısıyla b&amp;ouml;lgeye atılan nesneler i&amp;ccedil;in drop implementasyonlarının &amp;ccedil;alışmaması beklenir. Bumpalo k&amp;uuml;t&amp;uuml;phanesi a&amp;ccedil;ısından bakarsak aşağıdaki &amp;ouml;rnek kodla durumu &amp;ouml;zetleyebilir.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;use bumpalo::Bump;
use std::sync::atomic::{AtomicUsize, Ordering};

#[derive(Debug)]
struct Position {
    id: u32,
    x_value: u32,
    y_value: u32,
    z_value: u32,
}

static DROPPED_COUNT: AtomicUsize = AtomicUsize::new(0); // Threads-Safe olarak veriyi kitlemeden (lock-free) değişikliğe izin vermek i&amp;ccedil;in AtomicUsize kullanıldı

impl Drop for Position {
    fn drop(&amp;amp;mut self) {
        println!("{} nolu position i&amp;ccedil;in Drop &amp;ccedil;ağrısı", self.id);
        DROPPED_COUNT.fetch_add(1, Ordering::SeqCst);
    }
}

pub fn run() {
    let bump = Bump::new();

    { // Kasıtlı olarak scope a&amp;ccedil;ıldı
        let player_one = bump.alloc(Position {
            id: 1,
            x_value: 10,
            y_value: 20,
            z_value: 0,
        });
        let player_two = bump.alloc(Position {
            id: 2,
            x_value: 15,
            y_value: 5,
            z_value: 30,
        });
        let john_doe = bump.alloc(Position {
            id: 3,
            x_value: 3,
            y_value: 5,
            z_value: 8,
        });

        println!("Player One Adresi {:p}", player_one);
        println!("Player Two Adresi {:p}", player_two);
        println!("John Doe Adresi {:p}", john_doe);

        let player_one_addr = player_one as *const _ as usize;
        let player_two_addr = player_two as *const _ as usize;
        let john_doe_addr = john_doe as *const _ as usize;

        println!(
            "Ger&amp;ccedil;ek Player Two - Player One adres farkı: {} byte",
            address_diff(player_two_addr, player_one_addr)
        );
        println!(
            "Ger&amp;ccedil;ek John Doe - Player Two adres farkı: {} byte",
            address_diff(john_doe_addr, player_two_addr)
        );
    } // Scope dışındayız ama nesne drop'ları &amp;ccedil;alışmaz Area Allocation sebebiyle

    println!(
        "Dropped Position nesne sayısı {}",
        DROPPED_COUNT.load(Ordering::SeqCst)
    );

    // Arena burada scope'dan &amp;ccedil;ıkarken i&amp;ccedil;indeki t&amp;uuml;m Player nesneleri de tek seferde d&amp;uuml;ş&amp;uuml;r&amp;uuml;lecektir
}

fn address_diff(a: usize, b: usize) -&amp;gt; usize {
    if a &amp;gt; b {
        a - b
    } else {
        b - a
    }
}&lt;/pre&gt;
&lt;p&gt;Var olan &amp;ouml;rnek kodumuza birka&amp;ccedil; ekleme yaptık. En &amp;ouml;nemlisi &lt;strong&gt;Poistion&lt;/strong&gt; t&amp;uuml;r&amp;uuml; i&amp;ccedil;in &lt;strong&gt;Drop&lt;/strong&gt; trait davranışını eklememiz. Hatta i&amp;ccedil;erisinde &lt;strong&gt;AtomicUsize&lt;/strong&gt; t&amp;uuml;r&amp;uuml;nden bir saya&amp;ccedil; da kullanıyoruz. Eğer teorimiz doğruysa program sonlanırken scope dışında kalan Position değerleri i&amp;ccedil;in drop trait 'inin &amp;ccedil;alışmaması ve dolayısıyla &lt;strong&gt;DROOPED_COUNT&lt;/strong&gt; değişkeninin 0 olarak kalması gerekiyor. Kendi yaptığım &amp;ccedil;alışmada bu sonuca ulaştığımı s&amp;ouml;yleyebilirim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2025/Nisan/bumpalo_runtime.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dok&amp;uuml;mantasyona g&amp;ouml;re Bumpalo k&amp;uuml;t&amp;uuml;phanesi s&amp;ouml;z konusu bellek b&amp;ouml;lgelerini kendisi oluşturup y&amp;ouml;netmekte ve toplu serbest bırakma&lt;em&gt;(ya da Batch Deallocation)&lt;/em&gt; işlemi icra etmekte. Yani nesneleri tek tek drop etmek yerine ayrılan t&amp;uuml;m bellek bloğu i&amp;ccedil;in tek seferde boşaltma işlemi uygulamakta. İşte bu noktada Rust'ın &lt;strong&gt;RAII&lt;/strong&gt; modelini ezdiği d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir ki bu normaldir zira k&amp;uuml;t&amp;uuml;phane stack yerine kendi bellek b&amp;ouml;lgesini y&amp;ouml;netir.&lt;/p&gt;
&lt;p&gt;Aslında burada &lt;strong&gt;Drop&lt;/strong&gt; davranışı i&amp;ccedil;in de bir parantez a&amp;ccedil;mak lazım. Aynı &lt;strong&gt;Position&lt;/strong&gt; veri yapılarını &lt;strong&gt;heap&lt;/strong&gt; &amp;uuml;zerinde tahsis ederek ilerleyelim.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;use std::sync::atomic::{AtomicUsize, Ordering};

#[derive(Debug)]
struct Velocity {
    id: u32,
    value: u32,
    direction: i32,
}

static DROPPED_COUNT: AtomicUsize = AtomicUsize::new(0); // Threads-Safe olarak veriyi kitlemeden (lock-free) değişikliğe izin vermek i&amp;ccedil;in AtomicUsize kullanıldı

impl Drop for Velocity {
    fn drop(&amp;amp;mut self) {
        println!("{} nolu Velocity nesnesi i&amp;ccedil;in Drop &amp;ccedil;ağrısı", self.id);
        DROPPED_COUNT.fetch_add(1, Ordering::SeqCst);
    }
}

pub fn run() {
    { // Kasıtlı olarak Scope a&amp;ccedil;ıldı
        let _p1 = Box::new(Velocity {
            id: 1,
            value: 10,
            direction: 1,
        });
        let _p2 = Box::new(Velocity {
            id: 2,
            value: 20,
            direction: -1,
        });
        let _p3 = Box::new(Velocity {
            id: 3,
            value: 50,
            direction: 1,
        });
    } // Drop'lar &amp;ccedil;alışır

    println!(
        "Dropped Velocity nesne sayısı {}",
        DROPPED_COUNT.load(Ordering::SeqCst)
    );
}&lt;/pre&gt;
&lt;p&gt;Bu sefer Velocity isimli &lt;strong&gt;struct&lt;/strong&gt;' lardan birka&amp;ccedil; değişken tanımlıyoruz ancak dikkat edileceği &amp;uuml;zere bunları &lt;strong&gt;Box&lt;/strong&gt; ile kullanıyoruz. Bir başka deyişle kasıtlı olarak &lt;strong&gt;Heap&lt;/strong&gt; &amp;uuml;zerinde yerleşmelerini sağlıyoruz. Bu yeni durumda &lt;strong&gt;Drop trait&lt;/strong&gt;' lerinin otomatik olarak &amp;ccedil;alışması ve saya&amp;ccedil; değerimizin de 3 olması gerekiyor. İşte sonu&amp;ccedil;lar.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2025/Nisan/boxing_runtime.png" alt="" /&gt;&lt;/p&gt;
&lt;h3&gt;AtomicUsize Kullanımı&lt;/h3&gt;
&lt;p&gt;Yukarıdaki son iki &amp;ouml;rnek kodda &lt;strong&gt;AtomicUsize&lt;/strong&gt; veri t&amp;uuml;r&amp;uuml;n&amp;uuml; kullandık. Normalde statik değişkenler &lt;strong&gt;mutable&lt;/strong&gt; olamazlar zira bunlar global değişken olarak tanımlanır ve eşzamanlı&lt;em&gt;(concurrent)&lt;/em&gt; erişilme riskleri vardır. AtomicUsize tipi bir değişkenin &amp;ccedil;oklu thread'lerde kilitlemeye gerek olmadan&lt;em&gt;(lock-free)&lt;/em&gt; ve &lt;strong&gt;thread-safe&lt;/strong&gt; olarak değiştirilmesine izin verir. Tabii bunun yerine &lt;strong&gt;Mutex&amp;lt;Usize&amp;gt;&lt;/strong&gt; şeklinde bir kullanıma da gidilebilir. Karmaşık atomik işlemler gerektirmediğinden tercih edilebilir ama kilitleme gerektirir ve bunun bir maliyeti vardır, ayrıca &lt;strong&gt;Deadlock&lt;/strong&gt; oluşma ihtimali de s&amp;ouml;z konusudur. Alternatif olarak &lt;strong&gt;RwLock&lt;/strong&gt;&lt;em&gt;(Read-Write Lock)&lt;/em&gt; kullanılabilir.&lt;/p&gt;
&lt;p&gt;Bu t&amp;uuml;r eşzamanlı okumları &lt;strong&gt;thread-safe&lt;/strong&gt; icra ederken sadece yazma s&amp;ouml;z konusu olduğunda kitleme yapar. Dok&amp;uuml;manlara g&amp;ouml;re bazı durumlarda okuma ve yazma işlemlerinin &amp;ccedil;akışmasının s&amp;ouml;z konusu olabileceği belirtiliyor ancak diğer yandan &amp;ccedil;ok fazla yazma işlemi s&amp;ouml;z konusu ise kilitleme yine bir dezavantaj olarak karşımıza &amp;ccedil;ıkıyor. Bu arada birden fazla thread s&amp;ouml;z konusu değilse kilitleme mekanizmasına veya atomik işlemlere gerek yoktur ve &lt;strong&gt;Cell&lt;/strong&gt;, &lt;strong&gt;RefCell&lt;/strong&gt; gibi t&amp;uuml;rler kullanılabilir. &amp;Ccedil;ok alternatif var değil mi? :D Kıyaslama i&amp;ccedil;in ş&amp;ouml;yle bir şeyler karalayabiliriz tabii ama g&amp;uuml;ncelliğini kontrol etmekte yarar var. Bir saya&amp;ccedil; kullanmak istediğimizi d&amp;uuml;ş&amp;uuml;nelim;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Tek bir thread s&amp;ouml;z konusu ise Cell veya RefCell&amp;lt;Usize&amp;gt; iyi bir &amp;ccedil;&amp;ouml;z&amp;uuml;md&amp;uuml;r.&lt;/li&gt;
&lt;li&gt;&amp;Ccedil;oklu thread s&amp;ouml;z konusu ve basit bir kullanım yeterliyse Mutex&amp;lt;Usize&amp;gt; pekala iyi bir &amp;ccedil;&amp;ouml;z&amp;uuml;m olacaktır.&lt;/li&gt;
&lt;li&gt;&amp;Ccedil;oklu thread'ler tarafında bolca okuma ama nadir yazma işlemi s&amp;ouml;z konusuysa RwLock&amp;lt;Usize&amp;gt; ideal &amp;ccedil;&amp;ouml;z&amp;uuml;md&amp;uuml;r.&lt;/li&gt;
&lt;li&gt;&amp;Ccedil;oklu thread erişimi, sık yazma operasyonu ve performans kritik bir işleyiş gerekiyorsa AtomicUsize kullanılması daha iyi olacaktır.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Aslında bu s&amp;ouml;ylediklerimiz ışığında &lt;strong&gt;AtomicUsize&lt;/strong&gt; &amp;ccedil;ok daha iyi bir se&amp;ccedil;im gibi g&amp;ouml;r&amp;uuml;nebilir ama dezavantajları da vardır. Kilit kullanılmaması her zaman hız avantajı sağlamaz zira işlemci tarafında bellek bariyeri oluşması s&amp;ouml;z konusudur. Ayrıca &amp;ouml;rnekte &lt;strong&gt;Sequentially Consistent&lt;/strong&gt; kullandık, dolayısıyla işlemci sırf sayacı arttıracağım diye diğer işlemleri durdurabilir ki bu da beklenmedik performans kaybına neden olabilir&lt;em&gt;(Tabii bu sık kullanılmayla da ilgilidir)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Diğer yandan &lt;strong&gt;AtomicUsize&lt;/strong&gt; basit bir veri t&amp;uuml;r&amp;uuml;d&amp;uuml;r&lt;em&gt;(ki Atomic Atomic kelimesi ile başlayan Bool, I16, I32, I64, I8, Isize, Ptr, U16, U32, U64, U8 gibi farklı t&amp;uuml;rler var)&lt;/em&gt; ve hatta tek bir değişken &amp;uuml;zerinde garanti sonu&amp;ccedil;lar verebilir. Birden fazla &lt;strong&gt;AtomicUsize&lt;/strong&gt; kullanımı &lt;strong&gt;Race Condition&lt;/strong&gt; problemini doğurabilir. &amp;Ouml;rnekte birde &lt;strong&gt;Ordering&lt;/strong&gt; kullandık ki bunu belirtmemiz gerekiyordu. Hatta &lt;strong&gt;Drop trait&lt;/strong&gt; i&amp;ccedil;indeki ile aynı değeri de vermiştik. &lt;strong&gt;Relaxed, Acquire, AccRel&lt;/strong&gt; gibi farklı değerler de verilebilir ve bunların kombinasyonu &amp;ouml;nemlidir. Detaylar i&amp;ccedil;in &lt;a href="https://doc.rust-lang.org/std/sync/atomic/struct.AtomicUsize.html#method.compare_and_swap" target="_blank"&gt;şurada bir tablo var&lt;/a&gt;.&lt;/p&gt;
&lt;h2&gt;Struct/Enum T&amp;uuml;rlerinde Padding ve Allignment&lt;/h2&gt;
&lt;p&gt;Bir &lt;strong&gt;struct&lt;/strong&gt; t&amp;uuml;r&amp;uuml; belleğe a&amp;ccedil;ıldığında alanları&lt;em&gt;(fields)&lt;/em&gt; nasıl yerleştiriliyor hi&amp;ccedil; d&amp;uuml;ş&amp;uuml;nd&amp;uuml;n&amp;uuml;z m&amp;uuml;? Ya da bir &lt;strong&gt;enum&lt;/strong&gt; sabitinin alanları. Normal şartlarda alanların d&amp;uuml;zenli bir sırada hizalanması&lt;em&gt;(alignment)&lt;/em&gt; ve alanlar arasında sadece gerektiği kadar boşluk bırakılması&lt;em&gt;(padding minimizasyonu deniyor)&lt;/em&gt; bu veri yapısına ulaşan program par&amp;ccedil;aları i&amp;ccedil;in kolay ve hızlı erişilebilirlik anlamına gelir. Rust genellikle bu tip ayarlamaları bizim yerimize zaten yapar ancak bazı hallerde, &amp;ouml;rneğin &lt;strong&gt;FFI&lt;em&gt;(Foreign Function Interface)&lt;/em&gt; &lt;/strong&gt;hattı &amp;uuml;zerinde harici C k&amp;uuml;t&amp;uuml;phaneleri ile &amp;ccedil;alışıldığında belki bu ayarlamaları elle yapmak gerekebilir.&lt;/p&gt;
&lt;p&gt;Bu bilgiye ek olarak rust derleyicisinin &lt;strong&gt;niche optimization&lt;/strong&gt;&lt;em&gt;(Friedrich Nietzsche' in nişi değil :P)&lt;/em&gt; adı verilen bir tekniği kullanarak bazı enum t&amp;uuml;rlerini bellek a&amp;ccedil;ısından verimli hale getirdiği de belirtilir. &lt;strong&gt;Option&amp;lt;u32&amp;gt;&lt;/strong&gt; t&amp;uuml;r&amp;uuml;n&amp;uuml; ele alalım. Pozitif sayılardan oluşan bu 32 bitlik değişken bellekte 8 byte yer kaplar&lt;em&gt;(4 byte i&amp;ccedil;erdiği değer i&amp;ccedil;in + 4 byte None olma hali i&amp;ccedil;in)&lt;/em&gt; Zira &lt;strong&gt;u32&lt;/strong&gt; i&amp;ccedil;in &lt;strong&gt;None&lt;/strong&gt; durumunu ifade etmek ek bir flag gerektirmektedir. Lakin &lt;strong&gt;NonZeroU32&lt;/strong&gt; t&amp;uuml;r&amp;uuml;n&amp;uuml; de kullanabiliriz. &lt;strong&gt;NonZeroU32&lt;/strong&gt;, 0 hari&amp;ccedil; t&amp;uuml;m 32-bit değerleri taşıyabilir ve 0 değeri &lt;strong&gt;None&lt;/strong&gt; durumunu ifade etmek i&amp;ccedil;in kullanılır. Bu durumda &lt;strong&gt;Option&amp;lt;NonZeroU32&amp;gt;&lt;/strong&gt; sadece 4 byte yer kaplar; &lt;strong&gt;None&lt;/strong&gt; değeri altta yatan 0 değeriyle temsil edilir, &lt;strong&gt;Some(value)&lt;/strong&gt; ise value&amp;rsquo;nun kendi değerleriyle temsil edilir​. Daha fazla etay i&amp;ccedil;in &lt;a href="https://www.0xatticus.com/posts/understanding_rust_niche/" target="_blank"&gt;buradaki blog yazısını&lt;/a&gt; ziyaret edebilirsiniz. Konuyu pekiştirmek i&amp;ccedil;in aşağıdaki &amp;ouml;rnekle devam edelim.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;use std::num::NonZero;
use std::num::NonZeroU32;

pub fn run() {
    println!("Baştan s&amp;ouml;yleyelim...");
    println!("u32 {} byte yer tutar", size_of::&amp;lt;u32&amp;gt;());
    println!(
        "Option&amp;lt;u32&amp;gt; ise {} byte yer tutar. Diğer 4 byte None i&amp;ccedil;indir.",
        size_of::&amp;lt;Option&amp;lt;u32&amp;gt;&amp;gt;()
    );
    println!("NonZero32 {} byte yer tutar", size_of::&amp;lt;NonZeroU32&amp;gt;());
    println!(
        "Option&amp;lt;NonZero32&amp;gt; ise yine {} byte yer tutar. Zira 0, None olarak ifade edilir.",
        size_of::&amp;lt;Option&amp;lt;NonZeroU32&amp;gt;&amp;gt;()
    );

    let nan = give_me_a_none();
    match nan {
        None =&amp;gt; println!("There is no spoon!"),
        Some(v) =&amp;gt; println!("{}", v),
    }

    let transmuted: u32 = unsafe { std::mem::transmute(nan) };
    println!("NonZeroU32 i&amp;ccedil;in None : {transmuted:b}");

    let nan = give_me_another_none();
    match nan {
        None =&amp;gt; println!("There is no spoon!"),
        Some(v) =&amp;gt; println!("{}", v),
    }

    let transmuted: u64 = unsafe { std::mem::transmute(nan) };
    println!("U32 i&amp;ccedil;in None : {transmuted:b}");

    let number = give_me_a_number();
    match number {
        None =&amp;gt; println!("There is no spoon!"),
        Some(v) =&amp;gt; println!("{}", v),
    }

    let transmuted: u32 = unsafe { std::mem::transmute(number) };
    println!("NonZero i&amp;ccedil;in Number 23 : {transmuted:b}");

    let number = give_me_another_number();
    match number {
        None =&amp;gt; println!("There is no spoon!"),
        Some(v) =&amp;gt; println!("{}", v),
    }

    let transmuted: u64 = unsafe { std::mem::transmute(number) };
    println!("U32 i&amp;ccedil;in Number 23 : {transmuted:b}");
}

fn give_me_a_none() -&amp;gt; Option&amp;lt;NonZeroU32&amp;gt; {
    NonZero::new(0)
    // None
}

fn give_me_another_none() -&amp;gt; Option&amp;lt;u32&amp;gt; {
    None
}

fn give_me_a_number() -&amp;gt; Option&amp;lt;NonZeroU32&amp;gt; {
    NonZero::new(23)
}

fn give_me_another_number() -&amp;gt; Option&amp;lt;u32&amp;gt; {
    Some(23)
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;NonZeroU32&lt;/strong&gt; kullandığımız durumlarda None ve ger&amp;ccedil;ek bir sayının bellekteki binary formatlı saklanma şekilleri &amp;ccedil;ok farklı. &amp;Ouml;rneğin None bilgisi &lt;strong&gt;NonZerou32&lt;/strong&gt; i&amp;ccedil;in sadece &lt;strong&gt;0&lt;/strong&gt; ile ifade edilirken &lt;strong&gt;U32&lt;/strong&gt; kullanıldığında &amp;ccedil;ok daha uzun bir i&amp;ccedil;erik s&amp;ouml;z konusu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2025/Nisan/niche_opt.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Doğal olarak hangisini hangi durumlarda kullanabiliriz sorusu ortaya &amp;ccedil;ıkıyor? Belki g&amp;ouml;zden ka&amp;ccedil;ırmış olabiliriz ama ş&amp;ouml;yle bir durum var. &lt;strong&gt;NonZeroU32&lt;/strong&gt; adı &amp;uuml;st&amp;uuml;nde 0 değerini taşıyamaz. Sıfır değerini None olarak kabul eder. Bu nedenle yaygın g&amp;ouml;r&amp;uuml;ş &lt;strong&gt;U32&lt;/strong&gt;'nin kullanıldığı bir senaryoda hi&amp;ccedil;bir şekilde 0 değerinin kullanılmayacağı garanti ise &lt;strong&gt;NonZerou32&lt;/strong&gt; tercih edilebilir zira her bir sayısal değer i&amp;ccedil;in &lt;strong&gt;8 byte yerine 4 byte&lt;/strong&gt; ayırabiliriz.&lt;/p&gt;
&lt;p&gt;Niche&lt;em&gt;(niş)&lt;/em&gt; optimizasyonu denmesinin bir nedeni de &lt;strong&gt;None&lt;/strong&gt; yerine ge&amp;ccedil;ebilecek ayrıcalıklı yani niş bir değerin bulunmasıdır. U32 senaryosunda 0 değerinden feragat edilmesi garanti ise 0 bir niş değer olarak ifade edilir ve None yerine kullanılır ve bu da bize b&amp;uuml;y&amp;uuml;k bir bellek tasarrufu olarak d&amp;ouml;ner.&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;rnek daha verelim. Referans kullanılan senaryolarda da niş optimizasyon ele alınabilir. None durumu i&amp;ccedil;in null pointer (0x0) kullanıldığından tahsis edilen bellek miktarı aynıdır.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;println!("&amp;amp;u32 t&amp;uuml;r&amp;uuml; i&amp;ccedil;in de {} byte yer ayrılır.", size_of::&amp;lt;&amp;amp;u32&amp;gt;());
println!(
    "ve Option&amp;lt;&amp;amp;u32&amp;gt; i&amp;ccedil;inde {} byte s&amp;ouml;z konusudur.",
    size_of::&amp;lt;Option&amp;lt;&amp;amp;u32&amp;gt;&amp;gt;()
);&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2025/Nisan/niche_opt_2.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Memory/Object Pooling&lt;/h2&gt;
&lt;p&gt;Geliştirmekte olduğumuz uygulamaların &lt;strong&gt;heap&lt;/strong&gt; &amp;uuml;zerindeki yerleşimleri hem performans hem de verimlilik a&amp;ccedil;ısından &amp;ouml;nemlidir. Geniş arazilere sahip heap &amp;uuml;st&amp;uuml;nde rastgele nesne yerleşimleri zamanla fragmantasyonu bozabilir, uygulamanın bellekte kapladığı alan şişebilir, tepki s&amp;uuml;releri yavaşlayabilir. Esasında Rust, &lt;strong&gt;RAII&lt;/strong&gt;&lt;em&gt;(Resource Acquisition is Initialization)&lt;/em&gt; ilkesine bağlı kalarak nesne &amp;ouml;m&amp;uuml;rlerini optimal seviyede y&amp;ouml;netir&lt;em&gt;(Her ne kadar lifetimes mevzusu zaman zaman zorlayıcı olsa da)&lt;/em&gt; Ancak yine de tekrar tekrar &amp;uuml;retilen pahalı nesneler s&amp;ouml;z konusu olduğunda pekala bunların heap organizasyonu end&amp;uuml;striyel diyebileceğimiz kimi standart metodolojilerle ele alınabilir. &lt;strong&gt;Object Pooling&lt;/strong&gt;' de bunlardan birisidir. &amp;Ouml;rneğin veri tabanı bağlantıları, oyun motorlarındaki asset y&amp;ouml;neticileri s&amp;uuml;rekli ve tekrar tekrar kullanılan nesneler olarak karşımıza &amp;ccedil;ıkarlar. Bunları belli limitlere sahip bir havuzdan y&amp;ouml;netmek pekala ideal olabilir.&lt;/p&gt;
&lt;p&gt;Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asında &amp;ccedil;ok basit bir uygulaması g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;use std::sync::Arc;
use std::sync::Mutex;

trait Identifiable {
    fn get_id(&amp;amp;self) -&amp;gt; i16;
}

struct AssetServer {
    id: i16,
}

impl AssetServer {
    fn new(value: i16) -&amp;gt; Self {
        AssetServer { id: value }
    }
}

impl Identifiable for AssetServer {
    fn get_id(&amp;amp;self) -&amp;gt; i16 {
        self.id
    }
}

// Havuzdaki nesneleri tutan veri yapısı
// Generic T t&amp;uuml;r&amp;uuml; ile &amp;ccedil;alışır (T'yi Identifiable olma koşulan zorlayacak generic constraint eklenebilir)
struct ObjectPool&amp;lt;T&amp;gt; {
    objects: Arc&amp;lt;Mutex&amp;lt;Vec&amp;lt;T&amp;gt;&amp;gt;&amp;gt;, // T anında sadece bir thread'in erişimini garanti etmek i&amp;ccedil;in Atomic Reference Counted ve Mutex kullanılmıştır.
}

impl&amp;lt;T&amp;gt; ObjectPool&amp;lt;T&amp;gt; {
    pub fn new() -&amp;gt; Self {
        ObjectPool {
            objects: Arc::new(Mutex::new(Vec::new())),
        }
    }

    // Ekleme, &amp;ccedil;ekme ve serbest bırakma operasyonlarının tamamında Mutex lock kullanılır
    pub fn add(&amp;amp;mut self, value: T) {
        self.objects.lock().unwrap().push(value);
    }

    pub fn get(&amp;amp;mut self) -&amp;gt; Option&amp;lt;T&amp;gt; {
        let mut objects = self.objects.lock().unwrap(); // Havuzdaki nesneler kilit konularak &amp;ccedil;ekilir
        if objects.len() &amp;gt; 0 {
            // Eğer havuzda nesne varsa
            return objects.pop(); // sonraki nesne verilir
        }
        None
    }

    // Bir nesne ile işimiz bittiğinde onu havuza tekrardan yerleştirmek i&amp;ccedil;in kullanılan fonksiyondur
    // Bu arada releae metodu yerine drop trait implementasyonu da tercih edilebilir
    pub fn release(&amp;amp;mut self, value: T) {
        self.objects.lock().unwrap().push(value);
    }
}

pub fn run() {
    let mut asset_pool: ObjectPool&amp;lt;Box&amp;lt;dyn Identifiable&amp;gt;&amp;gt; =
        ObjectPool::&amp;lt;Box&amp;lt;dyn Identifiable&amp;gt;&amp;gt;::new();

    for i in 0..5 {
        asset_pool.add(Box::new(AssetServer::new(i)));
    }

    let server_1 = asset_pool.get().unwrap();
    println!("Server 1 id {}", server_1.get_id());
    let server_2 = asset_pool.get().unwrap();
    println!("Server 2 id {}", server_2.get_id());
    asset_pool.release(server_2);

    for object in asset_pool.objects.lock().unwrap().iter() {
        println!("Asset server id: {}", object.get_id());
    }
}&lt;/pre&gt;
&lt;p&gt;Yukarıdaki kodda ilkel bir &lt;strong&gt;object pool&lt;/strong&gt; mekanizması uygulanmaya &amp;ccedil;alışılıyor. Teorik olarak heap maliyeti y&amp;uuml;ksek nesnelerin bir havuzdan karşılanması değerlendirilmekte. &lt;strong&gt;AssetServer&lt;/strong&gt; yapısını y&amp;uuml;ksek maliyetli bir nesne gibi d&amp;uuml;ş&amp;uuml;nebiliriz. &lt;strong&gt;ObjectPool&lt;/strong&gt; isimli veri yapısı &lt;strong&gt;Arc&lt;em&gt;(Atomic reference counted)&lt;/em&gt;&lt;/strong&gt; isimli &lt;strong&gt;smart pointer&lt;/strong&gt;'ı ve &lt;strong&gt;Mutex&lt;/strong&gt; mekanizmasını kullanarak bu havuzu y&amp;ouml;netiyor. Havuza nesneler eklenbiliyor ve release fonkisyonu &amp;ccedil;ağırıldığında tekrardan havuza d&amp;ouml;nmelerini sağlanıyor. &amp;Ouml;rnek daha da geliştirilebilir. S&amp;ouml;z gelimi release yerine drop trait implementasyonu kullanılabilir ve nesne scope dışında kaldığında tekrardan havuza iade edilmesi sağlanabilir. Havuzda hi&amp;ccedil; nesne yoksa ilk oluşturulma aşamasında en az bir tane eklenebilir. Bir &amp;uuml;st yapı ile havuz y&amp;ouml;netimi daha sağlıklı da ele alınabilir. &amp;Ouml;rneğin nesnelerin belli sayıda ve belli s&amp;uuml;re boyunca scope' da kalmaları sağlanabilir.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak kendi implementasyonumuz dışında kullanabileceğimiz hazır k&amp;uuml;feler de&lt;em&gt;(crate)&lt;/em&gt; bulunuyor. En bilinenleri &lt;a href="https://crates.io/crates/lockfree-object-pool" target="_blank"&gt;lockfree-object-pool&lt;/a&gt; ve &lt;a href="https://crates.io/crates/typed-arena" target="_blank"&gt;typed_arena&lt;/a&gt;. Aşağıdaki &amp;ouml;rnekte &lt;strong&gt;typed_arena&lt;/strong&gt; kullanımına ait bir &amp;ouml;rnek yer almakta.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;use typed_arena::Arena;

#[derive(Debug)]
struct AssetServer {
    assets: Vec&amp;lt;String&amp;gt;,
    id: u32,
}

pub fn run() {
    let arena = Arena::new();

    let server_1 = arena.alloc(AssetServer {
        assets: vec![
            "player.png".to_string(),
            "tileSet.png".to_string(),
            "colors.png".to_string(),
        ],
        id: 1234,
    });

    let server_2 = arena.alloc(AssetServer {
        assets: vec![
            "human.png".to_string(),
            "brick.png".to_string(),
            "block.png".to_string(),
            "juice.jpg".to_string(),
            "intro.wav".to_string(),
        ],
        id: 1255,
    });

    println!(
        "Server {} has {} assets",
        server_1.id,
        server_1.assets.len()
    );
    println!(
        "Server {} has {} assets",
        server_2.id,
        server_2.assets.len(),
    );
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Object pooling&lt;/strong&gt;, arena allocator başlığı altında incelediğimiz tek bir tampon yaklaşımını da kullanabilir. &amp;Ouml;rneğin &lt;strong&gt;typed_arena&lt;/strong&gt; k&amp;uuml;fesi tekil deallocation işlevleri yerine kapsam dışına &amp;ccedil;ıkıldığında t&amp;uuml;m bloğu d&amp;uuml;ş&amp;uuml;ren ve stack based yerine &lt;strong&gt;heap based&lt;/strong&gt; &amp;ccedil;alışan bir k&amp;uuml;t&amp;uuml;phanedir. Tipik bir &lt;strong&gt;Arena Allocator&lt;/strong&gt; taktiği uyguluyor diyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Object Pooling&lt;/strong&gt; mevzusunda dikkat &amp;ccedil;eken noktalardan birisi de havuza nesneler eklendik&amp;ccedil;e &lt;strong&gt;heap&lt;/strong&gt;' in şişmesidir. Bunu y&amp;ouml;netmek de bir tasarım gerektirir. &lt;strong&gt;typed_arena&lt;/strong&gt; gibi &lt;strong&gt;Arena Allocator&lt;/strong&gt; stratejisini benimseyen k&amp;uuml;t&amp;uuml;phaneler genellikle tek bir bellek b&amp;ouml;lgesi ayırmayı tercih eder, tek seferde bellekten d&amp;uuml;ş&amp;uuml;r&amp;uuml;r, kapasite dolarsa var olandan bağımsız yeni bir bellek b&amp;ouml;lgesi daha tahsis eder. Dolayısıyla kendi yazdığımız senaryolarda bu kapasiteyi y&amp;ouml;netmemiz de gerekebilir. İlk yazdığımız kodu bu anlamda değerlendirip aşağıdaki gibi yeniden d&amp;uuml;zenleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;struct ObjectPool&amp;lt;T&amp;gt; {
    objects: Arc&amp;lt;Mutex&amp;lt;Vec&amp;lt;T&amp;gt;&amp;gt;&amp;gt;,
    capacity: usize,
}

impl&amp;lt;T&amp;gt; ObjectPool&amp;lt;T&amp;gt; {
    pub fn new(capacity: usize) -&amp;gt; Self {
        ObjectPool {
            objects: Arc::new(Mutex::new(Vec::new())),
            capacity,
        }
    }

    pub fn add(&amp;amp;mut self, value: T) {
        if self.objects.lock().unwrap().len() &amp;lt; self.capacity {
            self.objects.lock().unwrap().push(value);
        }
    }

    pub fn get(&amp;amp;mut self) -&amp;gt; Option&amp;lt;T&amp;gt; {
        let mut objects = self.objects.lock().unwrap();
        if objects.len() &amp;gt; 0 {
            return objects.pop();
        }
        None
    }

    pub fn release(&amp;amp;mut self, value: T) {
        if self.objects.lock().unwrap().len() &amp;lt; self.capacity {
            self.objects.lock().unwrap().push(value);
        } else {
            println!("Pool is full");
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;ObjectPool&lt;/strong&gt; yapısına usize t&amp;uuml;r&amp;uuml;nden capacity alanı eklenmiştir. &lt;strong&gt;add&lt;/strong&gt; ve &lt;strong&gt;release&lt;/strong&gt; fonksiyonlarında kapasite kontrol&amp;uuml; yapılır. Bu y&amp;ouml;ntem havuzdaki nesne sayısını sabitler ve heap b&amp;ouml;lgesinin gereksiz yere şişmesini engeller ancak dezavantajları da vardır. &amp;Ouml;rneğin havuzda boş yer yokken bir nesne istersek yeni nesne &amp;uuml;retilemeyebilir. Bu da bizi &lt;strong&gt;Eviction&lt;/strong&gt; stratejilerine g&amp;ouml;t&amp;uuml;r&amp;uuml;r. &lt;strong&gt;Least Recently Used&lt;em&gt;(LRU)&lt;/em&gt;&lt;/strong&gt;, &lt;strong&gt;Time-Aware Least Recently Used&lt;em&gt;(TLRU)&lt;/em&gt;&lt;/strong&gt;, &lt;strong&gt;Least Frequently Used&lt;em&gt;(LFU)&lt;/em&gt;&lt;/strong&gt;, &lt;strong&gt;Most Recently Used&lt;em&gt;(MRU)&lt;/em&gt;&lt;/strong&gt; gibi daha bir&amp;ccedil;ok yaklaşım da mevcuttur. Bu teknikler sadece object pooling değil cache mekanizmaları i&amp;ccedil;in de ele alınan stratejilerdir.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;LRU' da ama&amp;ccedil; kullanılmayan nesneleri belli bir sıraya g&amp;ouml;re havuzdan &amp;ccedil;ıkarmaktır ve genellikle web cache, session cahce, oyunlarda asset y&amp;ouml;netimi gibi senaryolarda ele alınır. Burada en az kullanılan nesneye erişmek Big O &amp;ouml;l&amp;ccedil;&amp;uuml;mlemesine g&amp;ouml;re nispeten yavaş olabilir ve O(1) durumuna getirilmesi gerekebilir.&lt;/li&gt;
&lt;li&gt;TLRU' da bir zaman damgası kullanılır ve buna g&amp;ouml;re belli s&amp;uuml;re kullanılmayan nesnelerin havuzdan &amp;ccedil;ıkartılması sağlanır. Tahmin edileceği &amp;uuml;zere ama&amp;ccedil; belli s&amp;uuml;re kullanılmayan nesneleri temizlemek bunu da bir zamanlayıcıya g&amp;ouml;re ayarlamaktır. &amp;Ouml;rneğin &amp;ouml;mr&amp;uuml; 60 saniyeden eski olanların temizlenmesi gibi. Ge&amp;ccedil;ici dosya y&amp;ouml;netiminde, IoT sistemlerde ele alınabilir.&lt;/li&gt;
&lt;li&gt;LFU' da ama&amp;ccedil; en az kullanılan ya da daha iyi bir tarifle en az başvurulan nesneyi havuzdan &amp;ccedil;ıkarmaktır. B&amp;ouml;ylece sık kullanılan nesneler havuzda kalırken az kullanılanlar &amp;ccedil;ıkarılır. Makine &amp;ouml;ğrenme modellerinde cache kullanılacağı zaman veya DB indeksleme işlemlerinde ele alınır. Sık kullanılan nesnelerin havuzda kalması &amp;ouml;nemli bir avantajdır ancak bu nesnelerin aranması, bulunması tam bir O(N) maliyetine eş olabilir.&lt;/li&gt;
&lt;li&gt;MRU ise en son kullanılan nesnenin bellekten &amp;ccedil;ıkartılmasını hedefler. Veri sıkıştırma algoritmaları ve b&amp;uuml;y&amp;uuml;k dosya sistemlerinde kullanılan bir y&amp;ouml;ntem olduğu belirtilmektedir. LRU'nun tam tersi olarak da değerlendirilebilir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Tabii &lt;strong&gt;Object Pooling&lt;/strong&gt; dedik, sonra havuz kapasitesini nasıl y&amp;ouml;neteceğiz dedik ve kendimizi &lt;strong&gt;cache&lt;/strong&gt; stratejilerinin uygulanmasında bulduk. Bu nedenle eğer sıfırdan bir object pool mekanizması tasarlamayacaksak bunu soyutlayan crate'lerden yararlanmak daha iyi olabilir.&lt;/p&gt;
&lt;h2&gt;Cache Friendly Programming&lt;/h2&gt;
&lt;p&gt;Y&amp;uuml;ksek performanslı kod işletiminde programın &amp;ccedil;alıştığı sistemin donanımsal avantajlarından yararlanmak da gerekir. Bazı hallerde tampon bellek hassasiyeti olan programlama teknikleri kullanılabilir. Bu pratiklerde genellikle işlemcinin &lt;strong&gt;L1, L2, L3&lt;/strong&gt; gibi farklı seviyelerdeki tampon bellek noktaları &amp;ouml;nemli rol oynar. &lt;a href="https://en.wikipedia.org/wiki/Alder_Lake" target="_blank"&gt;Alder Lake&lt;/a&gt; kod adlı 12nci nesil &lt;strong&gt;Intel i7&lt;/strong&gt; işlemcilerini d&amp;uuml;ş&amp;uuml;nelim. &lt;strong&gt;L1&lt;/strong&gt; cache' de &amp;ccedil;ekirdek başına 80 ila 96Kb, &lt;strong&gt;L2&lt;/strong&gt; cache'de 1.25 ila 2 Mb, &lt;strong&gt;L3&lt;/strong&gt; cache'de ise 30 Mb'a kadar alan s&amp;ouml;z konusudur. Dizilim olarak kabaca ş&amp;ouml;yle d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;p&gt;+------------------+&lt;br /&gt;+&amp;nbsp; &amp;nbsp;L1 - 96 Kb&amp;nbsp; +&lt;br /&gt;+------------------+&lt;br /&gt;&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; |&lt;br /&gt;+------------------+&lt;br /&gt;+&amp;nbsp; L2 - 2 Mb&amp;nbsp; &amp;nbsp; +&lt;br /&gt;+------------------+&lt;br /&gt;&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;|&lt;br /&gt;+------------------+&lt;br /&gt;+&amp;nbsp; L3 - 30 Mb&amp;nbsp; +&lt;br /&gt;+------------------+ &lt;br /&gt;&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;|&lt;br /&gt;+-------------------+&lt;br /&gt;+&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;+&lt;br /&gt;+&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;+&lt;br /&gt;+&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;+&lt;br /&gt;+ Main Ram&amp;nbsp; &amp;nbsp; +&lt;br /&gt;+&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;+&lt;br /&gt;+&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;+&lt;br /&gt;+&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;+&lt;br /&gt;+&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;+&lt;br /&gt;+-------------------+&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;L seviye cache&lt;/strong&gt;'ler &amp;ccedil;ekirdeğin en hızlı erişim yaptığı alanları i&amp;ccedil;erir. &lt;strong&gt;L1&lt;/strong&gt;'den ana belleğe gelirken bandwidth daralır ve gecikmeler&lt;em&gt;(Latency)&lt;/em&gt; artar. Ancak g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere kullanılabilecek kapasite ana bellekten &lt;strong&gt;L1&lt;/strong&gt;'e gelirken epeyce azalır. Yani hızlanmak i&amp;ccedil;in her şeyi L seviye tampon b&amp;ouml;lgelerinde konumlandırmamız pek m&amp;uuml;mk&amp;uuml;n olmayabilir. &amp;Ccedil;oğu programlama dili bu y&amp;ouml;netim i&amp;ccedil;in belli metodolojileri benimser. Bu alanda en sık verilen &amp;ouml;rnek iki boyutlu bir diziyle de ifade edilebilen matrislerdir. Rust bir &amp;ccedil;ok dilde olduğu gibi bir matrisi ele alırken &lt;strong&gt;satır &amp;ouml;ncelikli&lt;em&gt;(row-major order)&lt;/em&gt;&lt;/strong&gt; bir yaklaşımı baz alır. Tahmin edileceği &amp;uuml;zere birde &lt;strong&gt;s&amp;uuml;tun &amp;ouml;ncelikli&lt;em&gt;(column-major order)&lt;/em&gt; &lt;/strong&gt;s&amp;ouml;z konusudur. Her iki yaklaşım dizi elemanlarının bellekte farklı bi&amp;ccedil;imlerde yerleştirilmesi ile alakalıdır. Biraz daha detay i&amp;ccedil;in &lt;a href="https://en.wikipedia.org/wiki/Row-_and_column-major_order" target="_blank"&gt;Wikipedia&lt;/a&gt; yazısına bakılabilir.&lt;/p&gt;
&lt;p&gt;Eğer iki boyutlu bir dizinin&lt;em&gt;(veya buna uygun vekt&amp;ouml;r yapısının)&lt;/em&gt; elemanlarını dolaşırken row-major order yaklaşımına uygun kod yazarsak elemanlar belleğe ardışıl dizileceğinden&lt;em&gt;(Kuvvetle muhtemel L1, L2 seviyesinde)&lt;/em&gt; erişiminde hızlı olacağını s&amp;ouml;yleyebiliriz. Konuyu biraz daha net anlamak i&amp;ccedil;in aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;ası ile devam edelim. Bu &amp;ouml;rnekte criterion k&amp;uuml;fesini de kullanarak benchmark sonu&amp;ccedil;larını değerlendireceğiz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;pub fn row_major_call(matrix: &amp;amp;Vec&amp;lt;Vec&amp;lt;u8&amp;gt;&amp;gt;) -&amp;gt; usize {
    let mut sum = 0;
    for row in matrix {
        for &amp;amp;val in row {
            sum += val as usize;
        }
    }
    sum
}

pub fn column_major_call(matrix: &amp;amp;Vec&amp;lt;Vec&amp;lt;u8&amp;gt;&amp;gt;) -&amp;gt; usize {
    let size = matrix.len();
    let mut sum = 0;
    for col in 0..size {
        for row in 0..size {
            sum += matrix[row][col] as usize;
        }
    }
    sum
}&lt;/pre&gt;
&lt;p&gt;Buradaki fonksiyonlar iki boyutlu bir matris &amp;uuml;zerinden toplama işlemini icra etmektedir. İlk etapta kodlar aynı g&amp;ouml;r&amp;uuml;nebilir, nitekim i&amp;ccedil;i&amp;ccedil;e iki for d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml;n işletilmesi s&amp;ouml;z konusudur. Ancak &lt;strong&gt;row_major_calc&lt;/strong&gt; fonksiyonu diğerinin aksine en dış d&amp;ouml;ng&amp;uuml;de satırları sayarak ilerlemektedir. Bu iterasyon sırasında her bir satır i&amp;ccedil;in kolonlara ge&amp;ccedil;ilir. Rust'ın derleyicisi satır &amp;ouml;ncelikli bir dizilimi benimsediğinden bellek yerleşimi de buna g&amp;ouml;re ardışıl yapılır. Durumu daha iyi analiz etmek i&amp;ccedil;in criterion k&amp;uuml;t&amp;uuml;phanesini kullanarak benchmark &amp;ouml;l&amp;ccedil;&amp;uuml;mlemelerini değerlendirebiliriz. Tabii &amp;ouml;ncesinde projeye criterion k&amp;uuml;fesinin eklenmesi gerekir.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;cargo add criterion&lt;/pre&gt;
&lt;p&gt;Buna bağlı olarak toml i&amp;ccedil;eriğini de aşağıdaki gibi değiştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;[package]
name = "cache-friendly"
version = "0.1.0"
edition = "2021"

[dev-dependencies]
criterion = { version = "0.5.1", features = ["html_reports"] }

[[bench]]
name = "matrix-calc"
harness = false
&lt;/pre&gt;
&lt;p&gt;Projenin &lt;strong&gt;root&lt;/strong&gt; klas&amp;ouml;r&amp;uuml;nde &lt;strong&gt;benches&lt;/strong&gt; isimli başka bir klas&amp;ouml;r a&amp;ccedil;ıp aşağıdaki i&amp;ccedil;eriğe sahip &lt;strong&gt;matrix-calc.rs&lt;/strong&gt; isimli dosyayı ekleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;use cache_friendly::*;
use criterion::{black_box, criterion_group, criterion_main, Criterion};

fn benchmark_access_patterns(c: &amp;amp;mut Criterion) {
    for &amp;amp;size in &amp;amp;[128, 1024, 4096, 8192] {
        let matrix = vec![vec![1u8; size]; size];

        c.bench_function(&amp;amp;format!("Row Major Access {}x{}", size, size), |b| {
            b.iter(|| row_major_call(black_box(&amp;amp;matrix)))
        });

        c.bench_function(&amp;amp;format!("Column Major Access {}x{}", size, size), |b| {
            b.iter(|| column_major_call(black_box(&amp;amp;matrix)))
        });
    }
}

criterion_group!(benches, benchmark_access_patterns);
criterion_main!(benches);&lt;/pre&gt;
&lt;p&gt;Benchmark testlerini &amp;ccedil;alıştırmak i&amp;ccedil;inse aşağıdaki komutla ilerlemek yeterli.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;cargo bench&lt;/pre&gt;
&lt;p&gt;Buradaki testler 12nci nesil Intel i7 işlemcisi i&amp;ccedil;in hazırlandı. Aşağıdaki tabloda yer alan durumlara g&amp;ouml;re bir benchmark oluşturuldu.&lt;/p&gt;
&lt;table style="border: 1px solid black;"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;Level&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;Hedef Boyut&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;Matris Boyutu&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;Veri Boyutu&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;L1&lt;/td&gt;
&lt;td&gt;~96 Kb&lt;/td&gt;
&lt;td&gt;128 x 128&lt;/td&gt;
&lt;td&gt;16 Kb&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;L2&lt;/td&gt;
&lt;td&gt;~2 Mb&lt;/td&gt;
&lt;td&gt;1024 x 1024&lt;/td&gt;
&lt;td&gt;1 Mb&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;L3&lt;/td&gt;
&lt;td&gt;~30 Mb&lt;/td&gt;
&lt;td&gt;4096 x 4096&lt;/td&gt;
&lt;td&gt;16 Mb&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;Ram&lt;/td&gt;
&lt;td&gt;&amp;nbsp;&lt;/td&gt;
&lt;td&gt;8192 x 8192&lt;/td&gt;
&lt;td&gt;64 Mb&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Benchmark &amp;ouml;l&amp;ccedil;&amp;uuml;mleri target/criterion/report/index.html dosyasından da grafiksel olarak takip edilebilir. &amp;Ouml;rneğin 128 x 128 test i&amp;ccedil;in s&amp;uuml;tun &amp;ouml;ncelikli ve satır &amp;ouml;ncelikli ilk &amp;ouml;l&amp;ccedil;&amp;uuml;mler aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2025/Nisan/ColumnMajor.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2025/Nisan/RowMajor.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Zero Cost Abstraction&lt;/h2&gt;
&lt;p&gt;Sıfır maliyetli soyutlamalar olarak &amp;ccedil;evirebileceğimiz bu kavram Rust'ın g&amp;uuml;&amp;ccedil;l&amp;uuml; olan &amp;ouml;zelliklerinden birisidir. Bunu kısaca ifade etmek gerekirse, iterator metotları, generic t&amp;uuml;r kullanımları, trait implementasyonları gibi yaklaşımların &amp;ccedil;alışma zamanı maliyetlerinin sıfır olmasıdır/sıfıra yakın olmasıdır diye a&amp;ccedil;abiliriz&lt;em&gt;(&amp;ccedil;ok kesinlik katamadım ama iddialar bu y&amp;ouml;nde)&lt;/em&gt; Hatta idiomatic yazılmış bir rust kodunun sanki &lt;strong&gt;C/C++&lt;/strong&gt; dilleri ile yazılmış kadar efektif olduğu belirtilir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle koleksiyonlar arkasından gelen &lt;strong&gt;iterator&lt;/strong&gt; fonksiyonları i&amp;ccedil;in derleme zamanında &amp;uuml;retilen kodun &amp;ccedil;alışma zamanında ek bir maliyet gerektirmeden y&amp;uuml;ksek performanslı &amp;ccedil;alıştığını belirten bir kavram olarak da tanıtılır. &lt;strong&gt;Generic&lt;/strong&gt; t&amp;uuml;rler a&amp;ccedil;ısından d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde Rust'ın &lt;strong&gt;monomorfizasyon&lt;/strong&gt; tekniğiyle somut tiplere &amp;ouml;zel kodlar &amp;uuml;rettiğini ifade edelim. Bu yaklaşım &lt;strong&gt;C++&lt;/strong&gt; dilinde &lt;strong&gt;template&lt;/strong&gt; enstr&amp;uuml;manına benzer bi&amp;ccedil;imde her tip kullanımı i&amp;ccedil;in ayrıca optimize edilmiş kod &amp;uuml;retilmesi ile aynıdır. Bu durumda generic bir metot &amp;ccedil;ağrımı ile normal metot &amp;ccedil;ağrımı arasında pek bir performans farkı kalmaz. Iterator fonksiyonlar demişken aşağıdaki basit kod &amp;ouml;rneği ile bu durumu tarifleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;pub fn run() {
    let numbers: Vec&amp;lt;u32&amp;gt; = (0..=10).collect();

    let total_sum_1: u32 = numbers.iter().map(|x| x + 1).sum();

    let mut total_sum_2: u32 = 0;
    for x in &amp;amp;numbers {
        total_sum_2 += x + 1;
    }

    println!("Iterator fonksiyonları &amp;uuml;zerinden toplam : {}", total_sum_1);
    println!("Klasik for d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile toplam : {}", total_sum_2);
}&lt;/pre&gt;
&lt;p&gt;Birden ona kadar olan sayıların toplanması iki farklı şekilde yapılmaktadır. Birisinde &lt;strong&gt;iter()&lt;/strong&gt; metodu &amp;uuml;zerinden ulaşılıp &lt;strong&gt;map&lt;/strong&gt; ve &lt;strong&gt;sum&lt;/strong&gt; fonksiyonları ile hesaplama yapılmaktadır. Diğerinde ise bildiğimiz klasik bir for d&amp;ouml;ng&amp;uuml;s&amp;uuml; kullanılmıştır. Kod okunurluğu a&amp;ccedil;ısından iterator kullanımı &amp;ccedil;ok daha idealdir ve aslında bir&amp;ccedil;ok fonksiyonel dilde bu tip y&amp;uuml;ksek seviyeli işlevlere rastlanır ancak bu tip bir soyutlamanın &amp;ccedil;alışma zamanı maliyetleri dile g&amp;ouml;re tartışılır. &lt;strong&gt;Zero-Cost Abstraction&lt;/strong&gt;, klasik for d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile yazılan ve optimize edilmiş kod &amp;ccedil;ıktısının iterator fonksiyonlar i&amp;ccedil;in de s&amp;ouml;z konusu olduğunu s&amp;ouml;yler.&lt;/p&gt;
&lt;p&gt;Peki bu nasıl ispat edilebilir? Sanıyorum doğru optimizasyon seviyesinde &amp;uuml;retilen kodun &lt;strong&gt;assembly&lt;/strong&gt; &amp;ccedil;ıktılarına bakarak bir kıyaslama yapmak m&amp;uuml;mk&amp;uuml;n. Bu hen&amp;uuml;z tam olarak ger&amp;ccedil;ekeştiremediğim bir şey ancak yol boyunca &amp;ouml;ğrendiğim bazı şeyler de oldu. &amp;Ouml;rneğin src klas&amp;ouml;r&amp;uuml;nde &lt;strong&gt;zca.rs&lt;/strong&gt; isimli yalnız başına takılan bir rust dosyası var. Bunu rustc ile deledikten sonra assembly koduna bakabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# Bu komut zca.s isimli Assembly kodlarından oluşan zca.s dosyasını &amp;uuml;retecektir
rustc --emit=asm -C llvm-args="--x86-asm-syntax=intel" zca.rs

# Sadece main fonksiyonunun karşılığını g&amp;ouml;rmek i&amp;ccedil;inse aşağıdaki komutu kullanabiliriz
grep -A 20 "main:" zca.s&lt;/pre&gt;
&lt;p&gt;Aşağıdakine benzer bir &amp;ccedil;ıktı &amp;uuml;retmesi muhtemeldir. En azından bende b&amp;ouml;yle &amp;uuml;retti.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;main:
.cfi_startproc
push rax
.cfi_def_cfa_offset 16
mov rdx, rsi
movsxd rsi, edi
lea rdi, [rip + _ZN3zca4main17h95f2e46fab2a6266E]
xor ecx, ecx
call _ZN3std2rt10lang_start17h9d55bcc39d9e49f1E
pop rcx
.cfi_def_cfa_offset 8
ret
.Lfunc_end63:
.size main, .Lfunc_end63-main
.cfi_endproc

.type .L__unnamed_20,@object
.section .rodata..L__unnamed_20,"a",@progbits
.L__unnamed_20:
.ascii "capacity overflow"
.size .L__unnamed_20, 17&lt;/pre&gt;
&lt;p&gt;Ancak sahip olduğum kıt &lt;strong&gt;assembly&lt;/strong&gt; bilgim ile bir sonuca varamadım diyebilirim&lt;em&gt;(Hen&amp;uuml;z)&lt;/em&gt; Diğer yandan &lt;strong&gt;cargo&lt;/strong&gt; ile &amp;uuml;retilmiş projelerde &lt;a href="https://crates.io/crates/cargo-show-asm" target="_blank"&gt;ş&amp;ouml;yle bir crate&lt;/a&gt; kullanabileceğimiz de belirtiliyor. Bu aracı kullanarak kodun assembly &amp;ccedil;ıktılarına bakmak ve okumak daha kolay diyebilirim.&lt;/p&gt;
&lt;p&gt;Bellek y&amp;ouml;netimi programlama dili fark etmeksizin &amp;ouml;nemli bir mesele. &amp;Ccedil;ok y&amp;uuml;ksek kapasite &lt;strong&gt;RAM&lt;/strong&gt; 'lerimiz var diye bol keseden savurmamak, kaynakları optimize ederek kullanmak s&amp;uuml;rd&amp;uuml;r&amp;uuml;lebilirlik a&amp;ccedil;ısından da &amp;ouml;nemli. Tabii bu konuda daha iyi bilgi seviyesine sahip olmak i&amp;ccedil;in &lt;strong&gt;C, C++&lt;/strong&gt; taraflarında biraz dolaşmış olmak gerektiğini a&amp;ccedil;ık&amp;ccedil;a g&amp;ouml;zlemleyebiliyorum. Daha nice farklı optimizasyon tekniği var zira. Ancak şimdilik bu araştırmada edindiğim bilgileri dahi benim i&amp;ccedil;in kıymetli. Umarım sizler i&amp;ccedil;in de faydalı olur. B&amp;ouml;ylece geldik bir&amp;nbsp;yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2025-04-03 21:30:00</pubDate>
  <slug>bellek-yonetiminde-verimlilik-icin-ipuclari-rust-odakli</slug>
  <tags>
    <tag>rust</tag>
    <tag>memory-management</tag>
    <tag>copy-on-write</tag>
    <tag>dirt-cow</tag>
    <tag>arena-allocators</tag>
    <tag>atomicusize</tag>
    <tag>object-pooling</tag>
    <tag>zero-cost-abstraction</tag>
    <tag>cache-friendly-programming</tag>
    <tag>padding</tag>
    <tag>allignment</tag>
    <tag>interning</tag>
    <tag>niche-optimization</tag>
  </tags>
  <categories>
    <category>Rust</category>
  </categories>
</post>