<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Hexagonal Architecture 101</title>
  <description>Kurumsal uygulamaları göz önüne aldığımızda zaman içerisinde birçok yazılım mimarisinin ortaya çıktığını görüyoruz. Programlama dillerinin gelişim, framework'lerin ortaya çıkması ve değişen müşteri ihtiyaçları sonucunda bu kavram çok daha büyük önem kazandı. Belki de her şey üç katmanlı(3-tier) yaklaşımla başlamıştı. Geldiğimiz zaman diliminde ise monolit sistemlerin modüler hale getirildiğiği Modulith'lerden mikro servislere, soğan halkaları benzetmesi ile popülerleşen Onion mimariden, servis odaklı yaklaşıma kadar birçok stil var. Bazı kaynaklarda yazılım mimarileri katmanlı(Layered) ve dağıtık(Distributed) olmak üzere iki ana kategoriye de ayrılıyor. Üzerinde uzun uzun konuşulacak olan bu kavramları elbette deneyimleyerek görmek en güzeli. Bende bir süredir bakmak istediğim Hexagonal mimari yaklaşımını öğrenmeye karar verdim ve işte karşınızdayım. Gelin .net üzerinde bu mimariyi çok temel seviyede de olsa uygulamalı olarak anlamaya çalışalım.</description>
  <content>&lt;p&gt;Kurumsal uygulamaları g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda zaman i&amp;ccedil;erisinde bir&amp;ccedil;ok yazılım mimarisinin ortaya &amp;ccedil;ıktığını g&amp;ouml;r&amp;uuml;yoruz. Programlama dillerinin gelişimi, framework'lerin ortaya &amp;ccedil;ıkması ve değişen m&amp;uuml;şteri ihtiya&amp;ccedil;ları sonucunda bu kavram &amp;ccedil;ok daha b&amp;uuml;y&amp;uuml;k &amp;ouml;nem kazandı. Belki de her şey &lt;strong&gt;&amp;uuml;&amp;ccedil; katmanlı&lt;em&gt;(3-tier)&lt;/em&gt;&lt;/strong&gt; yaklaşımla başlamıştı. Geldiğimiz zaman diliminde ise &lt;strong&gt;monolit&lt;/strong&gt; sistemlerin &lt;strong&gt;mod&amp;uuml;ler&lt;/strong&gt; hale getirildiğiği &lt;strong&gt;Modulith&lt;/strong&gt;'lerden mikro servislere, soğan halkaları benzetmesi ile pop&amp;uuml;lerleşen &lt;strong&gt;Onion&lt;/strong&gt; mimariden &lt;strong&gt;servis odaklı&lt;em&gt;(Service-Oriented)&lt;/em&gt;&lt;/strong&gt; yaklaşıma kadar bir&amp;ccedil;ok stil var. Bazı kaynaklarda yazılım mimarileri &lt;strong&gt;katmanlı&lt;em&gt;(Layered)&lt;/em&gt; &lt;/strong&gt;ve&lt;strong&gt; dağıtık sistemler&lt;em&gt;(Distributed)&lt;/em&gt; &lt;/strong&gt;olmak &amp;uuml;zere iki ana kategoriye ayrılmakta. &amp;Uuml;zerinde uzun uzun konuşulacak olan bu kavramları elbette deneyimleyerek g&amp;ouml;rmek en g&amp;uuml;zeli. Bende bir s&amp;uuml;redir bakmak istediğim &lt;strong&gt;Hexagonal&lt;/strong&gt; mimari yaklaşımını &amp;ouml;ğrenmeye karar verdim ve işte karşınızdayım. Gelin .net platformunda bu mimariyi &amp;ccedil;ok temel seviyede de olsa uygulamalı olarak anlamaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;a href="https://github.com/buraksenyurt/HexagonalArchitecture_101" target="_blank"&gt;Yazıdaki uygulama kodlarına github reposu &amp;uuml;zerinden de erişebilirsiniz.&lt;/a&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu mimari bazı kaynaklarda &lt;strong&gt;"Ports and Adapters"&lt;/strong&gt; olarak da ge&amp;ccedil;iyor. Orijini &lt;strong&gt;Alistair Cockburn&lt;/strong&gt;'ın &lt;a href="https://alistair.cockburn.us/hexagonal-architecture" target="_blank"&gt;şuradaki yazısına&lt;/a&gt; dayanıyor. Kaynaklara g&amp;ouml;re &lt;strong&gt;2005&lt;/strong&gt; yılından beri hayatımızda olan bir tasarım. Tabii işin &amp;ouml;z&amp;uuml;nde &amp;ccedil;ok temel yazılım kavramları ve ilkeleri var. Her şey uygulama domain'i i&amp;ccedil;erisindeki iş kurallarının dış d&amp;uuml;nyadan tamamen izole edilmesi fikrine dayanıyor. Bu zaten bir &amp;ccedil;ok modern mimari yaklaşımın ana noktalarından birisi ancak uygulama bi&amp;ccedil;imleri farklılık g&amp;ouml;sterebiliyor.&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil;ta &lt;strong&gt;gevşek bağlılık&lt;em&gt;(Loose Coupling)&lt;/em&gt;&lt;/strong&gt;, sorumlulukların doğru ayrılması&lt;strong&gt;&lt;em&gt;(Separation of Concerns)&lt;/em&gt;&lt;/strong&gt;, bağımlılıkların tersine &amp;ccedil;evrilmesi&lt;strong&gt;&lt;em&gt;(Inversion of Control)&lt;/em&gt;&lt;/strong&gt;, bağımlılıkların dışarıdan sağlanması&lt;strong&gt;&lt;em&gt;(Dependency Injection)&lt;/em&gt;&lt;/strong&gt;, zengin nesneler&lt;em&gt;(Rich Entity - yazılım prensibi diyemesek de DDD'nin izlerinden birisi olarak mimaride yer bulabilir)&lt;/em&gt; kullanılması gibi temel kavramlar &amp;uuml;zerine kurulu bir mimari yaklaşım. Bu prensipler sayesinde uygulama domain'i i&amp;ccedil;erisindeki iş kuralları&lt;strong&gt;&lt;em&gt;(Business Specific Domain Rules)&lt;/em&gt;&lt;/strong&gt;, dış d&amp;uuml;nyadan gelen veri kaynaklarından, kullanıcı aray&amp;uuml;z&amp;uuml;nden, diğer sistemlerle entegrasyonlardan tamamen izole edilebilmekte. B&amp;ouml;ylece uygulama domain'i i&amp;ccedil;erisindeki kodun test edilebilirliği, s&amp;uuml;rd&amp;uuml;r&amp;uuml;lebilirliği ve esnekliği daha da artmakta.&lt;/p&gt;
&lt;p&gt;Bu mimari internette genellikle aşağıdakine benzer bir g&amp;ouml;rsel ile 50bin feet y&amp;uuml;kseklikten anlatılmaya &amp;ccedil;alışılır. &lt;em&gt;(&amp;Ccedil;izim Excalidraw.io &amp;uuml;zerinde tamamen insan eliyle oluşturulmuştur :P)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;img src="/image.axd?picture=/2026/Mart/HighLevelDesign.png" alt="" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Grafiği ş&amp;ouml;yle &amp;ouml;zetlemeye &amp;ccedil;alışalım. İş kuralları ve domain yapısı tamamen &lt;strong&gt;Application&lt;/strong&gt; katmanında yer alır. Bunu adapt&amp;ouml;rlerin oluşturduğu bir başka katman sarar. Adapt&amp;ouml;rler, uygulama domain'ini dış d&amp;uuml;nyaya bağlayan bir k&amp;ouml;pr&amp;uuml; g&amp;ouml;revi g&amp;ouml;r&amp;uuml;rler. Dış d&amp;uuml;nya ise kullanıcı aray&amp;uuml;z&amp;uuml;, veri tabanı ve diğer sistemlerle entegrasyonlar gibi unsurları i&amp;ccedil;erir. Adapt&amp;ouml;rler portlara bağlanarak uygulama domain'ine erişim sağlarlar. Portlar ise uygulama domain'inin dış d&amp;uuml;nyaya a&amp;ccedil;ılan kapılarıdır. Bu sayede uygulama domain'i tamamen izole edilmiş olur ve dış d&amp;uuml;nyadan gelen değişikliklerden etkilenmez. B&amp;ouml;yle anlatınca ne g&amp;uuml;zel değil mi? Soyut soyut :D Pek tabii uygulamayı yazıp, avantaj ve dezavantajlarını g&amp;ouml;rmeden mimariyi anlamamız pek m&amp;uuml;mk&amp;uuml;n değil.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Mimarinin ana sloganı şudur:&lt;/strong&gt; Seperating Business Logic from Infrastructure with Ports and Adapters. Yani iş kurallarını altyapıdan portlar ve adapt&amp;ouml;rler ile ayırmak.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Burada kafa karıştıcı bazı meseleler olabiliyor. &amp;Ouml;rneğin adapt&amp;ouml;rlerin &lt;strong&gt;Inbound&lt;/strong&gt; ve &lt;strong&gt;Outbound&lt;/strong&gt; olarak ikiye ayrılması, portların ne olduğu, adapt&amp;ouml;rlerin portlara nasıl bağlandığı vb. Ben bu konuları m&amp;uuml;mk&amp;uuml;n olduğunca basit senaryolar &amp;uuml;zerinden uygulamalı olarak incelemek istiyorum. Bu &amp;ccedil;alışmadaki temel amacım bu...&lt;/p&gt;
&lt;h2&gt;Senaryo&lt;/h2&gt;
&lt;p&gt;Kısır bir senaryo ile başlayalım. Stok takibi yapmak istediğimiz &amp;uuml;r&amp;uuml;nler var. Buradaki basit iş kurallarını hexagonal mimarisine g&amp;ouml;re ele almaya &amp;ccedil;alışacağız. Uygulama kodlarını .Net platformunda C# ile yazacağım. Elbette bu mimariyi uygulamaya uygun farklı bir platform veya programlama dili de se&amp;ccedil;ilebilir. Sonu&amp;ccedil;ta mimarinin prensipleri değişmeyecektir.&lt;/p&gt;
&lt;h2&gt;Geliştirme Aşamaları&lt;/h2&gt;
&lt;h3&gt;1. Solution ve Proje Yapısının inşa Edilmesi&lt;/h3&gt;
&lt;p&gt;Solution yapısını başlangı&amp;ccedil;ta aşağıdaki gibi oluşturabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2026/Mart/SolutionStructure.png" alt="" /&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;HexagonalAdventure.Domain&lt;/strong&gt; bir &lt;strong&gt;class library&lt;/strong&gt; ve domain nesneleri ile iş kurallarını i&amp;ccedil;eriyor.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;HexagonalAdventure.Application&lt;/strong&gt; yine bir &lt;strong&gt;class library&lt;/strong&gt; ve&lt;strong&gt; In/Out port&lt;/strong&gt; nesnelerini i&amp;ccedil;eriyor. &lt;strong&gt;Inbound&lt;/strong&gt; &lt;strong&gt;Port&lt;/strong&gt;'lar dış d&amp;uuml;nyanın &amp;ccedil;ekirdeğe ulaşmak i&amp;ccedil;in kullanacağı s&amp;ouml;zleşmeler olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. &lt;strong&gt;Outbound&lt;/strong&gt; &lt;strong&gt;Port&lt;/strong&gt; nesneleri ise &amp;ccedil;ekirdeğin dış d&amp;uuml;nyadan yaptırmak istediği işler i&amp;ccedil;in kullanılan s&amp;ouml;zleşmedir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;HexagonalAdventure.Adapters&lt;/strong&gt; ise şu anda iki proje i&amp;ccedil;eriyor. Bunlardan birisi &lt;strong&gt;Class Library&lt;/strong&gt; ve &lt;strong&gt;Outbound&lt;/strong&gt; &lt;strong&gt;Adapter&lt;/strong&gt; olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. &amp;Ouml;rneğin &lt;strong&gt;Entity Framework&lt;/strong&gt; tabanlı bir &lt;strong&gt;Repository&lt;/strong&gt;&amp;nbsp;uyarlaması burada yer alır. &lt;strong&gt;Outbound&lt;/strong&gt; &lt;strong&gt;Port&lt;/strong&gt;'ta tanımlanan s&amp;ouml;zleşmenin somut olarak uygulandığı yerdir. Diğer proje ise bir &lt;strong&gt;Web Api&lt;/strong&gt;'dir ve &lt;strong&gt;Inbound&lt;/strong&gt; &lt;strong&gt;Adapter&lt;/strong&gt; olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Dış d&amp;uuml;nyandan gelen isteği alır ve &lt;strong&gt;Inbound&lt;/strong&gt; &lt;strong&gt;Port&lt;/strong&gt; &amp;uuml;st&amp;uuml;nden sistemi tetikler. Hatta web api projesindeki program sınıfı &lt;strong&gt;Composition Root&lt;/strong&gt; g&amp;ouml;revini &amp;uuml;stlenir. Yani uygulama başlarken port ve adapt&amp;ouml;rlerin eşleştirilip birbirine bağlandığı yerdir. Bu sayede uygulama domain'i i&amp;ccedil;erisindeki kodun dış d&amp;uuml;nyaya olan bağımlılığı tamamen ortadan kalkar.&lt;/li&gt;
&lt;/ul&gt;
&lt;h3&gt;2. Domain Modelinin Oluşturulması&lt;/h3&gt;
&lt;p&gt;Şimdi &lt;strong&gt;domain&lt;/strong&gt; katmanına gelip &lt;strong&gt;rich entity&lt;/strong&gt; modunda bir &lt;strong&gt;Product&lt;/strong&gt; sınıfı oluşturalım. Bu sınıf &amp;uuml;r&amp;uuml;n&amp;uuml;n temel &amp;ouml;zelliklerini ve iş kurallarını i&amp;ccedil;erecek şekilde aşağıdaki gibi tasarlanabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace HexagonalAdventure.Domain;

public class Product
{
    public Guid Id { get; private set; }
    public string Title { get; private set; }
    public decimal ListPrice { get; private set; }
    public string Category { get; private set; } // Category ayrı bir entity olabilir, şimdilik string olarak bıraktım
    public int StockQuantity { get; private set; } // Sonrasında Value Object olarak refactor edilebilir

    public Product(Guid id, string title, decimal listPrice, string category, int initialStock)
    {
        Id = id;
        Title = string.IsNullOrWhiteSpace(title) ? throw new ArgumentException("Title cannot be empty") : title;
        ListPrice = listPrice &amp;gt; 0.0M ? listPrice : throw new ArgumentException("List price must be greater than 0.0");
        Category = string.IsNullOrWhiteSpace(category) ? throw new ArgumentException("Category cannot be empty") : category;
        StockQuantity = initialStock &amp;gt;= 0 ? initialStock : throw new ArgumentException("Initial stock cannot be negative");
    }

    public void IncreaseStock(int quantity)
    {
        if (quantity &amp;lt;= 0) throw new ArgumentException("Quantity to increase must be greater than 0");

        StockQuantity += quantity;
    }

    public void DecreaseStock(int quantity)
    {
        if (quantity &amp;lt;= 0) throw new ArgumentException("Quantity to decrease must be greater than 0");
        if (StockQuantity - quantity &amp;lt; 0) throw new InvalidOperationException("Insufficient stock to decrease by the specified quantity");

        StockQuantity -= quantity;
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdilik bir&amp;ccedil;ok detayı atladık. Sadece &amp;uuml;r&amp;uuml;n stok bilgisinin temel iş kurallarını ele alacağımız bir senaryo ile ilerleyeceğiz.&lt;/p&gt;
&lt;h3&gt;3. Portların Tanımlanması&lt;/h3&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak ve b&amp;uuml;y&amp;uuml;k bir ihtimalle &amp;uuml;r&amp;uuml;nler veritabanında tutulacaktır. &lt;strong&gt;Core&lt;/strong&gt;'da yer alan domain katmanının veritabanı teknolojilerinden bihaber olması gerekir. İletişimi sadece bir s&amp;ouml;zleşme &amp;uuml;zerinden yapmalıdır, yani bir Interface&lt;em&gt;(veya mimarideki adıyla port)&lt;/em&gt; Bu amaca hizmet eden enstr&amp;uuml;man &lt;strong&gt;Outbound Port&lt;/strong&gt; olarak isimlendiriliyor. &lt;strong&gt;Solution&lt;/strong&gt; yapımızı d&amp;uuml;ş&amp;uuml;necek olursak bizim i&amp;ccedil;in gerekli s&amp;ouml;zleşme tipini &lt;strong&gt;HexagonalAdventure.Application&lt;/strong&gt; projesinde &lt;strong&gt;Ports/Outbond&lt;/strong&gt; klas&amp;ouml;r&amp;uuml;nde aşağıdaki gibi tanımlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using HexagonalAdventure.Domain;

namespace HexagonalAdventure.Application.Ports.Outbound;

public interface IProductRepository
{
    void AddProduct(Product product);
    Product GetById(Guid id);
}&lt;/pre&gt;
&lt;p&gt;Senaryomuz gereği sadece iki fonksiyonellik tanımladık. Birisi &amp;uuml;r&amp;uuml;n eklemek, diğeri ise &amp;uuml;r&amp;uuml;n&amp;uuml; Id bilgisine g&amp;ouml;re &amp;ccedil;ekmek i&amp;ccedil;in. Burada bir &lt;strong&gt;interface&lt;/strong&gt; tanımı s&amp;ouml;z konusu ve dikkat edileceği &amp;uuml;zere ne t&amp;uuml;r bir k&amp;uuml;t&amp;uuml;phane ile, hangi veritabanına nasıl erişileceğine dair hi&amp;ccedil;bir detay da yer almıyor. &lt;strong&gt;Domain&lt;/strong&gt; katmanı bu s&amp;ouml;zleşmeyi aslında aşağıdaki gibi kullanıyor;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;L&amp;uuml;tfen bana şu Id'ye sahip &amp;uuml;r&amp;uuml;n&amp;uuml; getir.&lt;/li&gt;
&lt;li&gt;L&amp;uuml;tfen bilgilerini verdiğim &amp;uuml;r&amp;uuml;n&amp;uuml; ekle.&lt;/li&gt;
&lt;/ul&gt;
&lt;h3&gt;4. Uygulama Servisi ve Use Case'in Tanımlanması&lt;/h3&gt;
&lt;p&gt;Merkez domain nesnesinde temel iş kurallarımız ve dışarıya a&amp;ccedil;ılan bir s&amp;ouml;zleşmemiz hazır. Şimdi bu iki enstr&amp;uuml;manı kullanarak asıl iş akışını y&amp;ouml;netecek olan uygulama servisini&lt;em&gt;(Application Service)&lt;/em&gt; yazmamız gerekiyor. Bu servis sınıfı dışarıdan gelen isteği alacak ve ilgili domain nesnesini oluşturup g&amp;uuml;ncelleyecek. Burada bir &lt;strong&gt;port&lt;/strong&gt;'da kullanması gerekecek. Tipik olarak bir orkestrasyon yapacak diyebiliriz. Bu servis sınıfını &lt;strong&gt;HexagonalAdventure.Application&lt;/strong&gt; projesindeki &lt;strong&gt;Services&lt;/strong&gt; klas&amp;ouml;r&amp;uuml;nde aşağıdaki gibi yazabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using HexagonalAdventure.Application.Ports.Outbound;
using HexagonalAdventure.Domain;

namespace HexagonalAdventure.Application.Services;

public class ProductService(IProductRepository productRepository)
{
    private readonly IProductRepository _productRepository = productRepository;

    public Guid CreateProduct(string title, decimal price, string category, int stock)
    {
        // Domain nesnesi oluşturulur ve orada tanımlı iş kuralları da y&amp;uuml;r&amp;uuml;t&amp;uuml;l&amp;uuml;r.
        var product = new Product(Guid.NewGuid(), title, price, category, stock);
        // Outbound port olarak tanımladığımız aray&amp;uuml;z &amp;uuml;zerinden &amp;uuml;r&amp;uuml;n ekleme işlevi &amp;ccedil;ağırılır
        _productRepository.AddProduct(product);
        return product.Id;
    }
}&lt;/pre&gt;
&lt;p&gt;B&amp;ouml;ylece uygulamanın dışarıya veri g&amp;ouml;nderen kısmını da yazmış olduk. Şimdilik stok artırma ve azaltma işlemlerini eklemedik. &amp;Ouml;nce genel hatları ile inşa etmeye &amp;ccedil;alışalım. Daha yapılacak &amp;ccedil;ok iş var.&lt;/p&gt;
&lt;h3&gt;5. Inbound Adapt&amp;ouml;r&amp;uuml;n Yazılması ve Entegrasyonu&lt;/h3&gt;
&lt;p&gt;Az &amp;ouml;nce bir uygulama servisi yazdık. Dış sistemler tarafından nasıl kullanılacağına bir bakalım. Bunun i&amp;ccedil;in &lt;strong&gt;Web Api&lt;/strong&gt; projesini kobay olarak ele alacağız. Dikkat etmemiz gereken şey API projesindeki &lt;strong&gt;Controller&lt;/strong&gt; nesnesinin&lt;em&gt;(ki adapt&amp;ouml;r g&amp;ouml;revini &amp;uuml;stlenecek)&lt;/em&gt; &lt;strong&gt;ProductService&lt;/strong&gt;'e doğrudan bağımlı &lt;strong&gt;olMAmasını&lt;/strong&gt; sağlamak. Veritabanı tarafında nasıl bir &lt;strong&gt;outbound port&lt;/strong&gt; tanımladıysak burada da dış d&amp;uuml;nyanın &amp;ccedil;ekirdek ile konuşması i&amp;ccedil;in bu sefer ters y&amp;ouml;nl&amp;uuml; bir &lt;strong&gt;inbound port&lt;/strong&gt; enstr&amp;uuml;manı hazırlayacağız. Tabii eksik olan birka&amp;ccedil; şey daha var. &amp;Ouml;rneğin somut repository sınıfını yazmalıyız ve pek tabii program sınıfında gerekli &lt;strong&gt;dependency injection&lt;/strong&gt; tanımlamalarını da yapmalıyız. Ancak &amp;ouml;ncelikle &lt;strong&gt;inbound port&lt;/strong&gt; tanımını yaparak işe başlayalım.&lt;/p&gt;
&lt;p&gt;Bu y&amp;uuml;zden &amp;ouml;ncelikle &lt;strong&gt;HexagonalAdventure.Application&lt;/strong&gt; projesindeki &lt;strong&gt;Ports/Inbound&lt;/strong&gt; klas&amp;ouml;r&amp;uuml;ne aşağıdaki kod i&amp;ccedil;eriğine sahip s&amp;ouml;zleşme tipini eklememiz gerekiyor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace HexagonalAdventure.Application.Ports.Inbound;

public interface IProductService
{
    Guid CreateProduct(string title, decimal price, string category, int stock);
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Controller&lt;/strong&gt;'ın, &lt;strong&gt;ProductService&lt;/strong&gt;'e doğrudan bağımlı &lt;strong&gt;olMamasını&lt;/strong&gt; bu s&amp;ouml;zleşmeyi &lt;strong&gt;ProductService&lt;/strong&gt; sınıfına implemente ederek sağlayabiliriz. Dolayısıyla bir &amp;ouml;nceki adımda tanımladığımız &lt;strong&gt;ProductService&lt;/strong&gt; sınıfını aşağıdaki gibi g&amp;uuml;ncelleyerek ilereyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class ProductService(IProductRepository productRepository)
    : IProductService
{
    // DİĞER KODLAR
}&lt;/pre&gt;
&lt;p&gt;Şimdi de asıl adapt&amp;ouml;r g&amp;ouml;revini &amp;uuml;stlenen &lt;strong&gt;controller&lt;/strong&gt; sınıfını ekleyelim. Bu sınıfı da aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using HexagonalAdventure.Application.Ports.Inbound;
using Microsoft.AspNetCore.Mvc;

namespace HexagonalAdventure.Adapters.In.WebApi.Controllers;

[ApiController]
[Route("api/[controller]")]
public class ProductsController(IProductService productService)
    : Controller
{
    private readonly IProductService _productService = productService;

    [HttpPost]
    public IActionResult Create([FromBody] CreateProductRequest request)
    {
        var productId = _productService.CreateProduct(request.Title, request.Price, request.Category, request.Stock);
        return Ok(new { Id = productId });
    }
}

public record CreateProductRequest(string Title, decimal Price, string Category, int Stock);&lt;/pre&gt;
&lt;p&gt;Burada dikkat etmemiz gereken nokta adapt&amp;ouml;r g&amp;ouml;revini &amp;uuml;stlenen controller sınıfının &lt;strong&gt;ProductService&lt;/strong&gt;'i bir aray&amp;uuml;z &amp;uuml;zerinden kullanmasıdır. B&amp;ouml;ylece &lt;strong&gt;controller&lt;/strong&gt; sınıfı &lt;strong&gt;ProductService&lt;/strong&gt;'in somut implementasyonundan bağımsız hale gelmiş olur. Tabii bir şeye daha ihtiyacımız olacak. O da somut repository sınıfı. İlk senaryoda verileri bellekte bir &lt;strong&gt;dictionary&lt;/strong&gt; koleksiyonu olarak tutabiliriz. Bu ama&amp;ccedil;la &lt;strong&gt;HexagonalAdventure.Adapters.Out.InMemory&lt;/strong&gt; isimli sınıf k&amp;uuml;t&amp;uuml;phanesini kullanabiliriz. Burada &lt;strong&gt;outbound adapter&lt;/strong&gt; g&amp;ouml;revini &amp;uuml;stlenecek olan &lt;strong&gt;InMemoryProductRepository&lt;/strong&gt; isimli bir sınıf pekala işimiz g&amp;ouml;r&amp;uuml;r.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using HexagonalAdventure.Application.Ports.Outbound;
using HexagonalAdventure.Domain;

namespace HexagonalAdventure.Adapters.Out.InMemory;

public class InMemoryProdutRepository
    : IProductRepository
{
    private readonly Dictionary&amp;lt;Guid, Product&amp;gt; _products = [];
    public void AddProduct(Product product)
    {
        _products.Add(product.Id, product);
    }

    public Product GetById(Guid id)
    {
        _products.TryGetValue(id, out var product);
        return product;
    }
}&lt;/pre&gt;
&lt;p&gt;Artık Web Api tarafındaki son aşamayı tamamlayabiliriz. Program.cs sınıfını aşağıdaki gibi kodlayarak ilerleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using HexagonalAdventure.Adapters.Out.InMemory;
using HexagonalAdventure.Application.Ports.Inbound;
using HexagonalAdventure.Application.Ports.Outbound;
using HexagonalAdventure.Application.Services;

var builder = WebApplication.CreateBuilder(args);
builder.Services.AddControllers();

// Dependency Injection tanımlamaları
builder.Services.AddSingleton&amp;lt;IProductRepository, InMemoryProdutRepository&amp;gt;(); // T&amp;uuml;m uygulama boyunca tek bir instance kullanılır
builder.Services.AddScoped&amp;lt;IProductService, ProductService&amp;gt;();

builder.Services.AddOpenApi();

var app = builder.Build();

if (app.Environment.IsDevelopment())
{
    app.MapOpenApi();
}

app.UseHttpsRedirection();
app.UseAuthorization();
app.MapControllers();

await app.RunAsync();&lt;/pre&gt;
&lt;p&gt;Şu haliyle Web api projesini ayağa kaldırıp aşağıdaki &amp;ouml;rnek http talebi ile deneyebiliriz.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;@HexagonalAdventure.Adapters.In.WebApi_HostAddress = http://localhost:5144

POST {{HexagonalAdventure.Adapters.In.WebApi_HostAddress}}/api/products
Content-Type: application/json
Accept: application/json

{  
  "title": "Learning OCAML",
  "category": "Book",
  "price": 19.99,
  "stock": 10
}&lt;/pre&gt;
&lt;p&gt;En azından aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi bir yanıt almamız gerekiyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2026/Mart/HttpTest_00.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Yeni Deneyimler&lt;/h2&gt;
&lt;p&gt;Kaba taslak mimariyi uyguladık gibi g&amp;ouml;r&amp;uuml;n&amp;uuml;yor. Şimdi farklı senaryolar ile devam edelim.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;Ouml;rneğin veritabanı tarafında &lt;strong&gt;Postgresql&lt;/strong&gt; kullanan bir &lt;strong&gt;Outbound Adapter&lt;/strong&gt; eklemeye &amp;ccedil;alışalım. &lt;strong&gt;Entity Framework&lt;/strong&gt; olur ya da &lt;strong&gt;Dapper&lt;/strong&gt; olur. &lt;em&gt;(Yeni adapt&amp;ouml;r ekleme senaryosu)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Farklı bir dış sistemi dahil edelim. S&amp;ouml;z gelimi bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması.&lt;em&gt; (Console uygulaması Web Api'yi kullanmayacak elbette)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Biraz da test ekleyelim ve test edilebilirliği g&amp;ouml;rmeye &amp;ccedil;alışalım. &lt;em&gt;(Test ekleme senaryosu)&lt;/em&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;h3&gt;6. Entity Framework Tabanlı Yeni Adapter Eklenmesi&lt;/h3&gt;
&lt;p&gt;Adettendir her repomda olduğu gibi veritabanı s&amp;ouml;z konusu ise genellikle bir &lt;strong&gt;docker-compose&lt;/strong&gt; dosyasında &lt;strong&gt;postgresql&lt;/strong&gt; ve &lt;strong&gt;pg-admin&lt;/strong&gt; servislerini konuşlandırarak işe başlarım. Kendi sistemimdeki &lt;strong&gt;docker-compose&lt;/strong&gt; i&amp;ccedil;eriği aşağıdaki gibi.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;services:

  postgres:
    image: postgres:latest
    container_name: hex-postgres
    environment:
      POSTGRES_USER: johndoe
      POSTGRES_PASSWORD: somew0rds
      POSTGRES_DB: postgres
    ports:
      - "5432:5432"
    volumes:
      - postgres_data:/var/lib/postgres/data
    networks:
      - hex-network

  pgadmin:
    image: dpage/pgadmin4:latest
    container_name: hex-pgadmin
    environment:
      PGADMIN_DEFAULT_EMAIL: scoth@tiger.com
      PGADMIN_DEFAULT_PASSWORD: 123456
    ports:
      - "5050:80"
    depends_on:
      - postgres
    networks:
      - hex-network

volumes:
  postgres_data:

networks:
  hex-network:
    driver: bridge&lt;/pre&gt;
&lt;p&gt;Container'ları ayağa kaldırmak i&amp;ccedil;in;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;docker-compose up -d&lt;/pre&gt;
&lt;p&gt;Şimdi de &lt;strong&gt;HexagonalAdventure.Adapters.Out.EF&lt;/strong&gt; isimli yeni bir &lt;strong&gt;class library&lt;/strong&gt; oluşturarak devam edebiliriz. Bu projeyi de &lt;strong&gt;Adapters&lt;/strong&gt; isimli solution folder altında oluşturursak, iskelete baktığımızda g&amp;ouml;rsel olarak daha anlaşılır olacaktır.&amp;nbsp;&lt;strong&gt;Entity Framework&lt;/strong&gt; kullanacağımız i&amp;ccedil;in bir &lt;strong&gt;DbContext&lt;/strong&gt; t&amp;uuml;revine de ihtiyacımız olacak. Tabii gerekli &lt;strong&gt;nuget&lt;/strong&gt; paketlerini de eklemeyi unutmayalım. &lt;strong&gt;Microsoft.EntityFrameworkCore&lt;/strong&gt; ve &lt;strong&gt;Microsoft.EntityFrameworkCore.Design&lt;/strong&gt;. Şimdi isminden şu an i&amp;ccedil;in ş&amp;uuml;phe ettiğim &lt;strong&gt;DeppoDbContext&lt;/strong&gt; sınıfını yazarak devam edelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using HexagonalAdventure.Domain;
using Microsoft.EntityFrameworkCore;

namespace HexagonalAdventure.Adapters.Out.EF;

public class DeppoDbContext(DbContextOptions&amp;lt;DeppoDbContext&amp;gt; options)
    : DbContext(options)
{
    public DbSet&amp;lt;Product&amp;gt; Products { get; set; }
}&lt;/pre&gt;
&lt;p&gt;Olduk&amp;ccedil;a klasik bir &lt;strong&gt;DbContext&lt;/strong&gt; sınıfı yazdık. İ&amp;ccedil;inde sadece &amp;uuml;r&amp;uuml;nler i&amp;ccedil;in bir &lt;strong&gt;DbSet&lt;/strong&gt; &amp;ouml;zelliği yer alıyor. Şimdi de &lt;strong&gt;IProductRepository&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; implemente eden &lt;strong&gt;EfProductRepository&lt;/strong&gt; sınıfını yazalım. Hatırlayacağınız &amp;uuml;zere &lt;strong&gt;IProductRepository&lt;/strong&gt;, uygulama katmanında bir &lt;strong&gt;outbound&lt;/strong&gt; &lt;strong&gt;port&lt;/strong&gt; olarak tanımlanmıştı. Şimdi bu portu somut olarak uygulayan bir adapter yazacağız. &amp;Ouml;rneğin ş&amp;ouml;yle bir sınıf olabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using HexagonalAdventure.Application.Ports.Outbound;
using HexagonalAdventure.Domain;

namespace HexagonalAdventure.Adapters.Out.EF;

public class EfProductRepository(DeppoDbContext deppoDbContext)
    : IProductRepository
{
    public void AddProduct(Product product)
    {
        deppoDbContext.Products.Add(product);
        deppoDbContext.SaveChanges();
    }

    public Product GetById(Guid id)
    {
        return deppoDbContext.Products.FirstOrDefault(p =&amp;gt; p.Id == id);
    }
}&lt;/pre&gt;
&lt;p&gt;Artık Web api a&amp;ccedil;ısından olaya bakabiliriz. Hatırlarsanız program.cs sınıfında &lt;strong&gt;IProductRepository&lt;/strong&gt;'nin hangi somut sınıf tarafından implemente edileceğini tanımlamamız gerekiyordu ve ilk &amp;ouml;rneğimizde &lt;strong&gt;in-memory&lt;/strong&gt; &amp;ccedil;alışan bir repository sınıfını kullanmıştık. Web api'nin yeni adapt&amp;ouml;r ile &amp;ccedil;alışması i&amp;ccedil;in tek yapmamız gereken &lt;strong&gt;Dependency&lt;/strong&gt; &lt;strong&gt;Injection&lt;/strong&gt; &lt;strong&gt;Container&lt;/strong&gt;'daki bağımlılık tanımını değiştirmekten ibaret. Aynen aşağıda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi&lt;em&gt;.&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using HexagonalAdventure.Adapters.Out.EF;
// using HexagonalAdventure.Adapters.Out.InMemory;
using HexagonalAdventure.Application.Ports.Inbound;
using HexagonalAdventure.Application.Ports.Outbound;
using HexagonalAdventure.Application.Services;
using Microsoft.EntityFrameworkCore;

var builder = WebApplication.CreateBuilder(args);
builder.Services.AddControllers();

// EF Postgresql kullanımı i&amp;ccedil;in de middleware'e bir şeyler eklememiz lazım
builder.Services.AddDbContext&amp;lt;DeppoDbContext&amp;gt;(options =&amp;gt;
    options.UseNpgsql(builder.Configuration.GetConnectionString("DeppoConnectionString")));

// Dependency Injection tanımlamaları
// builder.Services.AddSingleton&amp;lt;IProductRepository, InMemoryProdutRepository&amp;gt;(); // T&amp;uuml;m uygulama boyunca tek bir instance kullanılır

// EF Core kullanan yeni outbound port implementasyonu
builder.Services.AddScoped&amp;lt;IProductRepository, EfProductRepository&amp;gt;();
builder.Services.AddScoped&amp;lt;IProductService, ProductService&amp;gt;();

builder.Services.AddOpenApi();

var app = builder.Build();

if (app.Environment.IsDevelopment())
{
    app.MapOpenApi();
}

app.UseHttpsRedirection();
app.UseAuthorization();
app.MapControllers();

await app.RunAsync();&lt;/pre&gt;
&lt;p&gt;Tabii burada bazı konfig&amp;uuml;rasyonları da yapmamız gerekiyor. &amp;Ouml;rneğin &lt;strong&gt;appsettings.json&lt;/strong&gt; dosyasına &lt;strong&gt;Postgresql&lt;/strong&gt; bağlantı bilgisini de eklememiz gerekiyor. Aşağıdaki gibi bir i&amp;ccedil;erik olabilir.&lt;/p&gt;
&lt;pre class="brush:java;auto-links:false;toolbar:false" contenteditable="false"&gt;{
  "ConnectionStrings": {
    "DeppoConnectionString": "Host=localhost;Port=5432;Database=deppo;Username=johndoe;Password=somew0rds"
  }
}&lt;/pre&gt;
&lt;p&gt;Ayrıca yine gelenek olduğu &amp;uuml;zere bir &lt;strong&gt;migration&lt;/strong&gt; planı hazırlayıp &amp;ccedil;alıştıralım. Bunun i&amp;ccedil;in &lt;strong&gt;dotnet&lt;/strong&gt; komut satırı aracını aşağıdaki gibi kullanabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# Sistemde ef tool'unun y&amp;uuml;kl&amp;uuml; olması gerekiyor. Eğer y&amp;uuml;kl&amp;uuml; değilse aşağıdaki komutla y&amp;uuml;kleyebiliriz.
dotnet tool install --global dotnet-ef

# Varsa da g&amp;uuml;ncellemek gerekebilir. O zaman da şu komut işe yarar
dotnet tool update --global dotnet-ef

# Migration planının hazırlanması
dotnet ef migrations add InitialCreate --project HexagonalAdventure.Adapters.Out.EF --startup-project HexagonalAdventure.Adapters.In.WebApi

# Migration planının işletilmesi
dotnet ef database update --project HexagonalAdventure.Adapters.Out.EF --startup-project HexagonalAdventure.Adapters.In.WebApi&lt;/pre&gt;
&lt;p&gt;Eğer her şey yolunda gittiyse aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu bu sefer &amp;uuml;r&amp;uuml;n bilgisinin veritabanına kaydedildiğini g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2026/Mart/HttpTest_01.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere sisteme yeni bir adapter ekledik fakat uygulama domain'ine hi&amp;ccedil; dokunmadık. Dış sistem entegrasyonunda sadece yeni eklediğimiz adapter'ı var olan port'a bağladık. B&amp;ouml;ylece uygulama domain'inin dış d&amp;uuml;nyaya olan bağımlılığını tamamen ortadan kaldırmış olduk.&lt;/p&gt;
&lt;h3&gt;7. Farklı Bir Dış Sistem Entegrasyonu: Console Uygulaması&lt;/h3&gt;
&lt;p&gt;Senaryomuzu şimdi biraz daha genişletelim ve farklı bir dış sistem entegrasyonu yapalım. Web Api'ye ek olarak bir de &lt;strong&gt;Console&lt;/strong&gt; uygulaması geliştirelim. Console uygulaması Web Api'yi kullanmayacak elbette. Doğrudan uygulama servislerini kullanarak &amp;ccedil;alışacak. B&amp;ouml;ylece farklı bir adapt&amp;ouml;r&amp;uuml;n var olan port'a nasıl bağlandığını g&amp;ouml;receğiz. Bir başka deyişle console uygulaması farklı bir &lt;strong&gt;Inbound Adapter&lt;/strong&gt; olacak. Console uygulamasında da dikkate almamız gereken şeyler var. &amp;Ouml;rneğin burada da bir&lt;strong&gt; Composition Root&lt;/strong&gt; kullanmamız mimariye uygunluk a&amp;ccedil;ısından &amp;ouml;nemli. Yani bir &lt;strong&gt;Depdendency Injection Container&lt;/strong&gt; hazırlayıp &lt;strong&gt;port&lt;/strong&gt; ve &lt;strong&gt;adapt&amp;ouml;rleri&lt;/strong&gt; birbirine bağlayacağız.&lt;/p&gt;
&lt;p&gt;Solution'daki &lt;strong&gt;Adapters&lt;/strong&gt; klas&amp;ouml;r&amp;uuml;ne &lt;strong&gt;HexagonalAdventure.Adapters.In.ConsoleHexagonalAdventure.Adapters.In.Console&lt;/strong&gt; isimli yeni bir &lt;strong&gt;Console&lt;/strong&gt; projesi oluşturup gerekli k&amp;uuml;t&amp;uuml;phaneleri ekledikten sonra aşağıdaki program kodları ile devam edelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using HexagonalAdventure.Adapters.Out.InMemory;
using HexagonalAdventure.Application.Ports.Inbound;
using HexagonalAdventure.Application.Ports.Outbound;
using HexagonalAdventure.Application.Services;
using Microsoft.Extensions.DependencyInjection;

var serviceProvider = new ServiceCollection()
    .AddSingleton&amp;lt;IProductRepository, InMemoryProdutRepository&amp;gt;()
    .AddScoped&amp;lt;IProductService, ProductService&amp;gt;()
    .BuildServiceProvider();

Console.WriteLine("Add a new product");

Console.Write("Title: ");
string title = Console.ReadLine();

Console.Write("Price: ");
decimal price = decimal.Parse(Console.ReadLine());

Console.Write("Category: ");
string category = Console.ReadLine();

Console.Write("Stock: ");
int stock = int.Parse(Console.ReadLine());

var productService = serviceProvider.GetRequiredService&amp;lt;IProductService&amp;gt;();
var newProductId = productService.CreateProduct(title, price, category, stock);

Console.WriteLine("Product created with ID: " + newProductId);
Console.ReadLine();&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Console&lt;/strong&gt; projesi sadece &lt;strong&gt;Application&lt;/strong&gt; ve &lt;strong&gt;InMemory&lt;/strong&gt; &lt;strong&gt;Adapter&lt;/strong&gt; projelerini referans eder. API projesini veya doğrudan &lt;strong&gt;Domain&lt;/strong&gt; projesini kullanmaz. &amp;Ouml;rneğin m&amp;uuml;mk&amp;uuml;n mertebe basit olması a&amp;ccedil;ısından console projesi&lt;strong&gt; in-memory&lt;/strong&gt; veritabanı kullanacak şekilde tasarlanmıştır. Diğer yandan web api bağımlılığı olmadığı i&amp;ccedil;in bir network servis bağımlılığı da yoktur. Doğrudan uygulama katmanındaki port'ları ve gerekli dış adapt&amp;ouml;r&amp;uuml; bir kompozisyon altında birleştirerek kullanır. Senaryonun bir &amp;ouml;zeti de şudur; &lt;strong&gt;Uygulamanın domain katmanına dokunmadan hem verinin yazıldığı yeri hemde geldiği yeri değiştirebildik.&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Tam şu anda solution i&amp;ccedil;eriğine bakarsak aşağıdaki gibi bir iskelet oluştuğunu g&amp;ouml;zlemleyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2026/Mart/ConsoleRuntime.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Testler&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;Onion Architecture&lt;/strong&gt;, &lt;strong&gt;Clean Architecture&lt;/strong&gt; gibi diğer mimari yaklaşımlarda olduğu gibi hexagonal mimaride de test edilebilirlik &amp;ouml;nemli bir avantaj olarak &amp;ouml;ne &amp;ccedil;ıkar. Uygulama domain'i dış d&amp;uuml;nyadan tamamen izole edildiği i&amp;ccedil;in bu katmandaki kodun test edilmesi son derece kolaydır. Diğer yandan port ve adapt&amp;ouml;rler &amp;uuml;zerinden yapılan entegrasyonları da kolayca test edebiliriz. Bu noktada da devreye genellikle &lt;strong&gt;mock&lt;/strong&gt; nesneler girer. Bu sayede ger&amp;ccedil;ek veritabanı veya diğer dış sistemlere ihtiya&amp;ccedil; duymadan uygulama iş kurallarını doğrulayabiliriz.&lt;/p&gt;
&lt;p&gt;Yine basit adımlarla ilerleyelim. İlk olarak &lt;strong&gt;Domain&lt;/strong&gt; katmanı i&amp;ccedil;in birka&amp;ccedil; birim test&lt;em&gt;(unit test)&lt;/em&gt; yazalım. Şu anda kobay olarak kullandığımız &lt;strong&gt;Product&lt;/strong&gt; sınıfının &amp;ccedil;ok fonksiyonelliği olmasa da temel iş kurallarını i&amp;ccedil;eren bir sınıf olduğu i&amp;ccedil;in yine de testlerini yazmak gerekir.&lt;/p&gt;
&lt;p&gt;Test yazmayı sadece kodun doğruluğunu kontrol etmek i&amp;ccedil;in değil, aynı zamanda kodun nasıl kullanılacağını g&amp;ouml;stermek ve kodun kendisiyle ilgili bazı &amp;ouml;nemli bilgileri belgelemek i&amp;ccedil;in de kullanabiliriz. Bu y&amp;uuml;zden testler sadece doğruluk kontrol&amp;uuml; değil, aynı zamanda bir t&amp;uuml;r dok&amp;uuml;mantasyon g&amp;ouml;revi de g&amp;ouml;r&amp;uuml;rler. Ayrıca kodun kalitesini artırmak ve gelecekteki değişikliklere karşı korumak i&amp;ccedil;in de &amp;ouml;nemli bir ara&amp;ccedil;tırlar. Bir&amp;ccedil;ok statik kod analiz aracı &amp;ouml;zellikle &lt;strong&gt;Code&lt;/strong&gt; &lt;strong&gt;Coverage&lt;/strong&gt; oranını baz alarak bir skor hesaplaması yapar. &lt;strong&gt;Code Coverage&lt;/strong&gt; oranı, yazdığımız testlerin kodun ne kadarını kapsadığını g&amp;ouml;steren bir metriktir. Y&amp;uuml;ksek bir&lt;strong&gt; Code Coverage&lt;/strong&gt; oranı genellikle daha iyi test kapsamına işaret eder fakat bu sizi yanıltmasın kodun kalitesi i&amp;ccedil;in tek başına yeterli &amp;ouml;l&amp;ccedil;&amp;uuml; değildir. Testlerin kalitesi ve doğruluğu da &amp;ouml;nemlidir. Bu y&amp;uuml;zden sadece y&amp;uuml;ksek bir &lt;strong&gt;Code Coverage&lt;/strong&gt; oranına odaklanmak yerine, testlerin ger&amp;ccedil;ekten kodun doğru &amp;ccedil;alıştığını ve beklenen sonu&amp;ccedil;ları verdiğini doğrulamak &amp;ouml;nemlidir.&lt;/p&gt;
&lt;h3&gt;8. Domain Katmanı i&amp;ccedil;in Birim Testler&lt;/h3&gt;
&lt;p&gt;Bu kadar laf kalabalığını bir kenara bırakalım ve dilerseniz ilk birim testlerimizi yazalım. &lt;strong&gt;HexagonalAdventure.Domain.UnitTests&lt;/strong&gt; isimli yeni bir test projesi&lt;em&gt;(xUnit şablonundan)&lt;/em&gt; oluşturarak işe başlayabiliriz. İ&amp;ccedil;erisine &lt;strong&gt;ProductTests&lt;/strong&gt; isimli bir test sınıfı metotlarını aşağıdaki gibi d&amp;uuml;zenleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace HexagonalAdventure.Domain.UnitTests;

public class ProductTests
{
    [Fact]
    public void DecreaseStock_When_StockIsEnough()
    {
        // Arrange (Hazırlık safhası)
        var product = new Product(Guid.NewGuid(), "Optical Mouse", 29.99m, "Electronics", 10);

        // Act (Eylem safhası)
        product.DecreaseStock(5);

        // Assert (Doğrulama safhası)
        var expectedStock = 5;
        Assert.Equal(expectedStock, product.StockQuantity);
    }

    [Fact]
    public void DecreaseStock_When_StockIsNotEnough_ShouldThrowException()
    {
        // Arrange
        var product = new Product(Guid.NewGuid(), "Mechanical Keyboard", 79.99m, "Electronics", 3);

        // Act &amp;amp; Assert
        Assert.Throws&amp;lt;InvalidOperationException&amp;gt;(() =&amp;gt; product.DecreaseStock(5));
    }

    [Fact]
    public void IncreaseStock_ShouldIncreaseStockQuantity()
    {
        // Arrange
        var product = new Product(Guid.NewGuid(), "Gaming Headset", 49.99m, "Electronics", 5);

        // Act
        product.IncreaseStock(10);

        // Assert
        var expectedStock = 15;
        Assert.Equal(expectedStock, product.StockQuantity);
    }

    [Fact]
    public void IncreaseStock_When_AmountIsNegative_ShouldThrowException()
    {
        // Arrange
        var product = new Product(Guid.NewGuid(), "USB-C Hub", 39.99m, "Electronics", 8);

        // Act &amp;amp; Assert
        Assert.Throws&amp;lt;ArgumentException&amp;gt;(() =&amp;gt; product.IncreaseStock(-5));
    }
}&lt;/pre&gt;
&lt;p&gt;Şu an i&amp;ccedil;in sadece stok miktarını artıran ve azaltan metotları test ettik. Bu test projesi &lt;strong&gt;Domain&lt;/strong&gt; katmanı dışındaki hi&amp;ccedil;bir projeyi referans etmez, hi&amp;ccedil;bir dış bağımlılık da i&amp;ccedil;ermez. Sadece bir &lt;strong&gt;Test Framework&lt;/strong&gt; kullanır. Yazdığımız testleri kod edit&amp;ouml;rleri &amp;uuml;zerinden test edebileceğimiz gibi komut satırından da koşturabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# Solution i&amp;ccedil;indeki t&amp;uuml;m test projelerini &amp;ccedil;alıştırmak i&amp;ccedil;in
dotnet test

# Belli bir test projesini &amp;ccedil;alıştırmak i&amp;ccedil;inse
dotnet test HexagonalAdventure.Domain.Tests&lt;/pre&gt;
&lt;p&gt;Sonu&amp;ccedil; olarak yazdığımız testlerin başarılı olduğunu g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2026/Mart/DomainTests.png" alt="" /&gt;&lt;/p&gt;
&lt;h3&gt;9. Uygulama Katmanı i&amp;ccedil;in Birim Testler (Mock Nesnelerle)&lt;/h3&gt;
&lt;p&gt;Şimdi de uygulama katmanını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. &amp;Ouml;rneğin buradaki &lt;strong&gt;ProductService&lt;/strong&gt; sınıfı i&amp;ccedil;in birim testler ekleyelim. Tabii burada dikkat edilmesi gereken bir başla konu var. Bu sefer &lt;strong&gt;ProductService&lt;/strong&gt; sınıfının kullanmak i&amp;ccedil;in i&amp;ccedil;erisine enjekte edilen &lt;strong&gt;IProductRepository&lt;/strong&gt; s&amp;ouml;zleşmesine dayalı bir bağımlılık&lt;em&gt;(Dependency)&lt;/em&gt;&amp;nbsp;bulunuyor. Birim testlerde bu tip bağımlılıklarda somut implementasyonları kullanmak yerine genellikle mock nesneler tercih edilir. &lt;strong&gt;Mock&lt;/strong&gt; nesneler, ger&amp;ccedil;ek nesnelerin davranışlarını taklit eden sahte yapılar olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Bu sayede ger&amp;ccedil;ek veritabanı veya diğer dış sistemlere ihtiya&amp;ccedil; duymadan uygulama iş kurallarını doğrulayabiliriz.&lt;/p&gt;
&lt;p&gt;Bu ama&amp;ccedil;la Solution i&amp;ccedil;inde &lt;strong&gt;HexagonalAdventure.Application.UnitTests&lt;/strong&gt; isimli yeni bir test projesi oluşturarak devam edelim. Tabii bu projede &lt;a href="https://www.nuget.org/packages/moq/" target="_blank"&gt;Moq &lt;/a&gt;gibi bir mocking framework kullanarak bağımlılıkları taklit etmemiz gerekiyor. Gerekli nuget paketlerini ekledikten sonra &lt;strong&gt;ProductServiceTests&lt;/strong&gt; isimli test sınıfını aşağıdaki gibi yazarak ilerleyelim.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Pratik bilgi:&lt;/strong&gt; Mock nesneleri gibi dış bağımlılıkları taklit eden enstr&amp;uuml;manlarda testlerin ger&amp;ccedil;ekten bir veritabanına veya bir servise daha doğrusu ağ &amp;uuml;zerinde bir yerlere gitmediğinden emin olmak i&amp;ccedil;in kullanılabilecek ilkel yollardan birisi test projesindeki &lt;strong&gt;appsettings.json&lt;/strong&gt; dosyasına ge&amp;ccedil;ersiz bağlantı bilgileri eklemek olabilir. B&amp;ouml;ylece yanlışlıkla ger&amp;ccedil;ek bir veritabanına bağlanmaya &amp;ccedil;alıştığımızda testlerimiz başarısız olur ve bu durum bize bir şeylerin yanlış gittiğine dair bir sinyal verir ya da bağlantılar uzak sunucularda ise interneti testler sırasında kapatmak da benzer bir etki yaratır. Tabii bunlar ilgili testleri kendi makinemizde koşturmak istediğimiz durumlar i&amp;ccedil;in ge&amp;ccedil;erlidir. Nihayetinde ger&amp;ccedil;ekten de veritabanına gidiliyorsa bunu CI/CD s&amp;uuml;re&amp;ccedil;lerinde acı bir şekilde &amp;ouml;ğrenmek yerine local ortamda &amp;ouml;ğrenmek daha iyi olabilir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace HexagonalAdventure.Application.UnitTests;

using Moq;
using HexagonalAdventure.Application.Ports.Outbound;
using HexagonalAdventure.Application.Services;
using HexagonalAdventure.Domain;

public class ProductServiceTests
{
    [Fact]
    public void CreateProduct_ShouldReturnValidGuid()
    {
        // Arange
        var mockRepo = new Mock&amp;lt;IProductRepository&amp;gt;();
        mockRepo.Setup(r =&amp;gt; r.AddProduct(It.IsAny&amp;lt;Domain.Product&amp;gt;()));

        // Act
        var service = new ProductService(mockRepo.Object);
        var actualGuid = service.CreateProduct("AyBiEm Laptop i7", 1500m, "Electronics", 10);

        // Assert
        Assert.NotEqual(Guid.Empty, actualGuid);

        // Verify (Ger&amp;ccedil;ekten de dış bağımlılıktaki AddProduct metodunun &amp;ccedil;ağrıldığını doğrulamak i&amp;ccedil;in)
        mockRepo.Verify(r =&amp;gt; r.AddProduct(It.IsAny&amp;lt;Domain.Product&amp;gt;()), Times.Once);
    }

    [Fact]
    public void CreateProduct_ShouldPassCorrectDataToRepository()
    {
        // Arange
        var mockRepo = new Mock&amp;lt;IProductRepository&amp;gt;();
        Product capturedProduct = null;
        mockRepo.Setup(r =&amp;gt; r.AddProduct(It.IsAny&amp;lt;Product&amp;gt;()))
                .Callback&amp;lt;Product&amp;gt;(p =&amp;gt; capturedProduct = p);

        // Act
        var service = new ProductService(mockRepo.Object);
        var actualGuid = service.CreateProduct("AyBiEm Laptop i7", 1500m, "Electronics", 10);

        // Assert
        Assert.NotNull(capturedProduct);
        Assert.Equal("AyBiEm Laptop i7", capturedProduct.Title);
        Assert.Equal(1500m, capturedProduct.ListPrice);
        Assert.Equal("Electronics", capturedProduct.Category);
        Assert.Equal(10, capturedProduct.StockQuantity);
    }

    [Fact]
    public void CreateProduct_WhenTitleIsEmpty_ShouldThrowException()
    {
        // Arange
        var mockRepo = new Mock&amp;lt;IProductRepository&amp;gt;();

        // Act
        var service = new ProductService(mockRepo.Object);

        // Assert
        Assert.Throws&amp;lt;ArgumentException&amp;gt;(() =&amp;gt; service.CreateProduct("", 1500m, "Electronics", 10));
    }

    [Fact]
    public void CreateProduct_WithNegativeStockQuantity_ShouldThrowException()
    {
        //Arange
        var mockRepo = new Mock&amp;lt;IProductRepository&amp;gt;();
        var service = new ProductService(mockRepo.Object);

        //Act &amp;amp; Assert
        var exception = Assert.Throws&amp;lt;ArgumentException&amp;gt;(() =&amp;gt; service.CreateProduct("AyBiEm Laptop i7", 1500m, "Electronics", -5));

        //Verify
        mockRepo.Verify(r =&amp;gt; r.AddProduct(It.IsAny&amp;lt;Product&amp;gt;()), Times.Never);
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi buradaki test metodları hakkında biraz konuşalım. &lt;strong&gt;CreateProduct_ShouldReturnValidGuid&lt;/strong&gt; testinde &lt;strong&gt;CreateProduct&lt;/strong&gt; fonksiyonunun ge&amp;ccedil;erli bir &lt;strong&gt;Guid&lt;/strong&gt; d&amp;ouml;nd&amp;uuml;r&amp;uuml;p d&amp;ouml;nd&amp;uuml;rmediğini doğruluyoruz. &lt;strong&gt;CreateProduct_ShouldPassCorrectDataToRepository&lt;/strong&gt; test metodunda ise &lt;strong&gt;CreateProduct&lt;/strong&gt; fonksiyonunun &lt;strong&gt;IProductRepository&lt;/strong&gt;'nin &lt;strong&gt;AddProduct&lt;/strong&gt; metodunu doğru verilerle &amp;ccedil;ağırıp &amp;ccedil;ağırmadığını. Zira &lt;strong&gt;CreateProduct&lt;/strong&gt; metodunun doğru &amp;ccedil;alışması sadece geriye ge&amp;ccedil;erli bir &lt;strong&gt;Guid&lt;/strong&gt; değer d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml; ile &amp;ouml;l&amp;ccedil;&amp;uuml;lemez. Ger&amp;ccedil;ekten g&amp;ouml;nderdiğimiz &amp;uuml;r&amp;uuml;n bilgilerinin &lt;strong&gt;AddProduct&lt;/strong&gt; metoduna gittiğinden de emin olmalıyız. Bunun i&amp;ccedil;in &lt;strong&gt;setup&lt;/strong&gt; metodunu kullanırken &lt;strong&gt;callback&lt;/strong&gt; fonksiyonunda bir &lt;strong&gt;Product&lt;/strong&gt; nesnesi kullandık. Sonu&amp;ccedil;ta &lt;strong&gt;CreateProduct&lt;/strong&gt; metodu i&amp;ccedil;indeki &lt;strong&gt;AddProduct&lt;/strong&gt; &amp;ccedil;ağrılmadan &amp;ouml;nce bir &lt;strong&gt;Product&lt;/strong&gt; nesnesi &amp;ouml;rnekleniyor. Dolayısıyla &lt;strong&gt;CreateProduct&lt;/strong&gt; parametreleri ile oluşan &lt;strong&gt;Product&lt;/strong&gt; nesne &amp;ouml;rneği değerlerinin, &lt;strong&gt;Callback&lt;/strong&gt; ile d&amp;ouml;nen &lt;strong&gt;Product&lt;/strong&gt; nesne &amp;ouml;rneği değerlerine eşit olması gerekir.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;CreateProduct_WhenTitleIsEmpty_ShouldThrowException&lt;/strong&gt; ve &lt;strong&gt;CreateProduct_WithNegativeStockQuantity_ShouldThrowException&lt;/strong&gt; isimli testlerde ise ge&amp;ccedil;ersiz girdilerle &lt;strong&gt;CreateProduct&lt;/strong&gt; fonksiyonunun beklenen şekilde istisna&lt;em&gt;(Exception)&lt;/em&gt; fırlatıp fırlatmadığını doğruluyoruz. &lt;strong&gt;CreateProduct&lt;/strong&gt; metodu i&amp;ccedil;inde doğrudan bir &lt;strong&gt;exception&lt;/strong&gt; fırlatımı s&amp;ouml;z konusu olmasa da, &lt;strong&gt;Product&lt;/strong&gt; sınıfı i&amp;ccedil;inde tanımlı domain kurallarımız var ve bunlar &lt;strong&gt;exception&lt;/strong&gt; d&amp;ouml;nd&amp;uuml;r&amp;uuml;yor. Buna ek olarak &lt;strong&gt;CreateProduct_WithNegativeStockQuantity_ShouldThrowException&lt;/strong&gt; testinde, ge&amp;ccedil;ersiz bir stok miktarıyla &amp;uuml;r&amp;uuml;n oluşturulmaya &amp;ccedil;alışıldığında, &lt;strong&gt;AddProduct&lt;/strong&gt; metodunun hi&amp;ccedil; &amp;ccedil;ağrılmadığını da doğruluyoruz. B&amp;ouml;ylece hem iş kurallarının hem de dış bağımlılıklara yapılan &amp;ccedil;ağrıların doğruluğunu test etmiş olduk.&lt;br /&gt;&lt;br /&gt;Eklediğimiz son testleri de &amp;ccedil;alıştıralım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2026/Mart/ApplicationTests.png" alt="" /&gt;&lt;/p&gt;
&lt;h3&gt;10. Entegrasyon Testleri (Adapter Katmanı Testleri)&lt;/h3&gt;
&lt;p&gt;&amp;Ouml;zellikle veritabanı veya harici servis gibi dış bağımlılıkların yer aldığı adapt&amp;ouml;r katmanı tipik olarak entegrasyon testleri ile denetlenebilir. Burada ama&amp;ccedil; kodun dış d&amp;uuml;nya ile uyumlu bir şekilde &amp;ccedil;alışıp &amp;ccedil;alışmadığını kontrol etmektir. Mesela &lt;strong&gt;outbound adapter&lt;/strong&gt; olarak &lt;strong&gt;entity framework&lt;/strong&gt; yardımıyla &lt;strong&gt;postgresql&lt;/strong&gt; veritabanına ger&amp;ccedil;ekten kayıt atabiliyor muyuz ya da&lt;strong&gt; inbound adapter&lt;/strong&gt; olarak kullandığımız &lt;strong&gt;ProductController&lt;/strong&gt; ger&amp;ccedil;ekten &lt;strong&gt;http&lt;/strong&gt; isteğine &lt;strong&gt;200 OK&lt;/strong&gt; d&amp;ouml;nebiliyor mu gibi durumları test edebiliriz. Entegrasyon testlerinde mock nesnelerden ziyade ortamları taklit eden yapılara ihtiya&amp;ccedil; duyarız. Mesela &lt;strong&gt;docker&lt;/strong&gt; tarafı i&amp;ccedil;in &lt;strong&gt;Testcontainers&lt;/strong&gt; ya da &lt;strong&gt;entity framework&lt;/strong&gt; tarafı i&amp;ccedil;in bir&lt;strong&gt; in-memory&lt;/strong&gt; veri sağlaycısı d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Şimdi &lt;strong&gt;HexagonalAdventure.Adapters.IntegrationTests&lt;/strong&gt; şeklinde yine &lt;strong&gt;xUnit&lt;/strong&gt; t&amp;uuml;r&amp;uuml;nden yeni bir proje ekleyerek devam edelim.&lt;/p&gt;
&lt;p&gt;İlk olarak entity framework aracılığıyla kayıt atıp atamadığımız bakalım. Burada mock nesne yerine iki yaklaşımı tercih ederek ilerleyebiliriz. Bunlardan birisi &lt;strong&gt;Test Container&lt;/strong&gt; diğeri ise &lt;strong&gt;In-Memory Provider&lt;/strong&gt; kullanmaktır. &lt;strong&gt;Microsoft.EntityFrameworkCore.InMemory&lt;/strong&gt; paketini kullanarak devam edelim. Buna g&amp;ouml;re veri yazma s&amp;uuml;recini bellek &amp;uuml;zerinden kontrol edeceğimizi ifade edebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using HexagonalAdventure.Domain;
using HexagonalAdventure.Adapters.Out.EF;
using Microsoft.EntityFrameworkCore;

namespace HexagonalAdventure.Apdaters.IntegrationTests;

public class EFProductRepositoryTests
{
    [Fact]
    public void Add_ShouldSaveProductToDatabase_And_GetById_ShouldReturnIt()
    {
        // Arrange
        var options = new DbContextOptionsBuilder&amp;lt;DeppoDbContext&amp;gt;()
            .UseInMemoryDatabase(databaseName: Guid.NewGuid().ToString())
            .Options;

        using var context = new DeppoDbContext(options);
        var repository = new EfProductRepository(context);
        var productId = Guid.NewGuid();
        var productToSave = new Product(productId, "Learning the Hexagonal Architecture", 29.99m, "Books", 2);

        // Act
        repository.AddProduct(productToSave);

        // Assert
        var retrievedProduct = repository.GetById(productId);
        Assert.NotNull(retrievedProduct);
        Assert.Equal(productId, retrievedProduct.Id);
        Assert.Equal("Learning the Hexagonal Architecture", retrievedProduct.Title);
        Assert.Equal(29.99m, retrievedProduct.ListPrice);
        Assert.Equal("Books", retrievedProduct.Category);
        Assert.Equal(2, retrievedProduct.StockQuantity);
    }
}&lt;/pre&gt;
&lt;p&gt;Test metodumuz, &lt;strong&gt;EfProductRepository&lt;/strong&gt; nesnemizin ihtyia&amp;ccedil; duyduğu &lt;strong&gt;DbContext&lt;/strong&gt; &amp;ouml;rneği i&amp;ccedil;in &lt;strong&gt;In-Memory&lt;/strong&gt; bir veritabanı sağlayacak şekilde yapılandırılıyor. B&amp;ouml;ylece ger&amp;ccedil;ek bir veritabanına ihtiya&amp;ccedil; duymadan repository'nin işlevselliğini test edebiliriz. Testte &amp;ouml;nce bir &amp;uuml;r&amp;uuml;n oluşturup kaydediyoruz, ardından aynı &amp;uuml;r&amp;uuml;n&amp;uuml; &lt;strong&gt;GetById&lt;/strong&gt; metodu ile &amp;ccedil;ekip kaydettiğimiz &amp;uuml;r&amp;uuml;nle eşit olup olmadığını doğruluyoruz.&lt;/p&gt;
&lt;p&gt;Diyelim ki &lt;strong&gt;DbContext&lt;/strong&gt; t&amp;uuml;revini uygularken &lt;strong&gt;SaveChanges&lt;/strong&gt; metodunu yazmayı atlamışız. Bu durumda &lt;strong&gt;GetById&lt;/strong&gt; metodunu &amp;ccedil;ağırdığımızda null değer d&amp;ouml;necektir. Dolayısıyla testimiz başarısız olur. Kısaca sadece kodun &amp;ccedil;alışıp &amp;ccedil;alışmadığını değil entity framework ayarlarını da kontrol etmiş oluruz. Bu test tam olarak &lt;strong&gt;Domain -&amp;gt; Service -&amp;gt; Interface -&amp;gt; Adapter&lt;/strong&gt; akışını takip etmekte. B&amp;ouml;ylece uygulamayı ger&amp;ccedil;ek &amp;ccedil;alışma ortamına olduk&amp;ccedil;a yakın bir seviyede test etmiş olduk diyebiliriz.&lt;/p&gt;
&lt;p&gt;Elbette yeterli değil. Diğer adapt&amp;ouml;rler i&amp;ccedil;in de benzer testler ekleyebiliriz. &amp;Ouml;rneğin &lt;strong&gt;ProductController&lt;/strong&gt; i&amp;ccedil;in de bir entegrasyon testi yazabiliriz. Bu sefer &lt;strong&gt;HTTP Post&lt;/strong&gt; isteği g&amp;ouml;nderdiğimizde her şeyin u&amp;ccedil;tan uca doğru &amp;ccedil;alıştığını g&amp;ouml;rmeyi ama&amp;ccedil;layabiliriz. Burada da &lt;strong&gt;WebApplicationFactory&lt;/strong&gt; gibi bir nesne kullanarak ger&amp;ccedil;ek bir &lt;strong&gt;HTTP&lt;/strong&gt; istemcisi &amp;uuml;zerinden API'ye istek g&amp;ouml;nderip yanıt almayı deneme şansımız var. Yine aynı test projesinde bu sefer &lt;strong&gt;ProductControllerTests&lt;/strong&gt; isimli yeni bir test sınıfı oluşturarak &amp;ccedil;alışmamıza devam edelim.&lt;em&gt;(&lt;strong&gt;WebApplicationFactory&lt;/strong&gt; nesnesini kullanabilmek i&amp;ccedil;inse test projemize &lt;strong&gt;Microsoft.AspNetCore.Mvc.Testing nuget&lt;/strong&gt; paketini eklememiz gerekiyor)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using HexagonalAdventure.Adapters.In.WebApi.Controllers;
using Microsoft.AspNetCore.Mvc.Testing;
using System.Net;
using System.Net.Http.Json;

namespace HexagonalAdventure.Apdaters.IntegrationTests;

public class ProductControllerTests(WebApplicationFactory&amp;lt;Program&amp;gt; factory)
    : IClassFixture&amp;lt;WebApplicationFactory&amp;lt;Program&amp;gt;&amp;gt;
{
    // Program sınıfı Web API projesindeki sınıfımızdır.
    // WebApplicationFactory, bu sınıfı kullanarak testler i&amp;ccedil;in bir test sunucusu oluşturur.
    private record CreateProductResponse(Guid Id);

    [Fact]
    public async Task CreateProduct_ShouldReturn200OkWithProductId()
    {
        // Arrange
        var client = factory.CreateClient(); // Test sunucusuna istek g&amp;ouml;ndermek i&amp;ccedil;in fabrikadan bir HttpClient oluşturulur.
        var request = new CreateProductRequest("Pragmatic Programmer", 42.99m, "Books", 4);

        // Act
        var response = await client.PostAsJsonAsync("/api/products", request); // POST isteği g&amp;ouml;nderilir ve yanıt alınır.

        // Assert
        Assert.Equal(HttpStatusCode.OK, response.StatusCode);
        var responseData = await response.Content.ReadFromJsonAsync&amp;lt;CreateProductResponse&amp;gt;();
        Assert.NotNull(responseData);
        Assert.NotEqual(Guid.Empty, responseData.Id);
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncelike bu test sınıfında neler yaptığımıza bir bakalım. Sınıfımız, &lt;strong&gt;IClassFixture&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; implemente ediyor ve &lt;strong&gt;primary constructor&lt;/strong&gt; &amp;uuml;zerinden de generic &lt;strong&gt;WebApplicationFactory&lt;/strong&gt; t&amp;uuml;r&amp;uuml;nden bir nesne alıyor. Buradaki amacımız birim test metotları &amp;ccedil;ağırılmadan &amp;ouml;nce Web API uygulamasının ger&amp;ccedil;ek bir &amp;ouml;rneğinin bir seferliğine ayağa kaldırılmasını sağlamak. Buna g&amp;ouml;re &lt;strong&gt;CreateProduct_ShouldReturn200OkWithProductId&lt;/strong&gt; isimli test metodumuzda &amp;ouml;nce bir &lt;strong&gt;HTTP&lt;/strong&gt; istemcisi oluşturuyoruz, ardından &lt;strong&gt;CreateProductRequest&lt;/strong&gt; t&amp;uuml;r&amp;uuml;nden bir nesne &amp;ouml;rneği hazırlayıp API'ye g&amp;ouml;nderiyoruz. Son olarak da d&amp;ouml;nen yanıtın durum kodunun &lt;strong&gt;200 OK&lt;/strong&gt; olduğunu ve gelen cevapta ge&amp;ccedil;erli bir Guid&lt;em&gt;(ki product ID olarak ele alınıyor)&lt;/em&gt; olup olmadığını doğruluyoruz.&lt;/p&gt;
&lt;p&gt;Bu testi koştururken dikkat etmemiz gereken noktalardan birisi ger&amp;ccedil;ek bir web sunucusunu ger&amp;ccedil;ekten ayağa kaldırmayışımız olması. Ayrıca bu test ile dış d&amp;uuml;nyadan gelen bir isteğin&lt;em&gt;(ki burada HTTP isteği)&lt;/em&gt;,&lt;strong&gt; inbound adapter&lt;/strong&gt; vasıtasıyla sisteme girişini, iş kurallarından ge&amp;ccedil;işini ve sonunda &lt;strong&gt;outbound adapter&lt;/strong&gt; &amp;uuml;zerinden kaydedilişini doğrulamaya &amp;ccedil;alışıyoruz. Yalnız burada dikkat etmemiz gereken bir nokta daha var. Web Api tarafında program sınıfımız ger&amp;ccedil;ekten de &lt;strong&gt;Postgesql&lt;/strong&gt;'e kayıt atacak şekilde bir &lt;strong&gt;repository&lt;/strong&gt; bileşeni kullanıyor. Yani testi bu şekilde &amp;ccedil;alışıtırırsak test verisi veritabanına da yazılır. Dolayısıyla bir &amp;ouml;nceki entegrasyon testinde olduğu gibi bir &lt;strong&gt;in-memory&lt;/strong&gt; veritabanı ile &amp;ccedil;alışmak daha mantıklıdır. &lt;strong&gt;WebApplicationFactory&lt;/strong&gt; bu noktada bize &amp;ouml;nemli esneklikler sağlar. Program sınıfındaki kurguyu ezebiliriz. Buna g&amp;ouml;re az &amp;ouml;nce yazdığımız test metodunu aşağıdaki hale getirerek devam edelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using HexagonalAdventure.Adapters.In.WebApi.Controllers;
using HexagonalAdventure.Adapters.Out.EF;
using Microsoft.AspNetCore.Mvc.Testing;
using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Infrastructure;
using Microsoft.Extensions.DependencyInjection;
using Microsoft.Extensions.DependencyInjection.Extensions;
using System.Data.Common;
using System.Net;
using System.Net.Http.Json;

namespace HexagonalAdventure.Apdaters.IntegrationTests;

public class ProductControllerTests(WebApplicationFactory&amp;lt;Program&amp;gt; factory)
    : IClassFixture&amp;lt;WebApplicationFactory&amp;lt;Program&amp;gt;&amp;gt;
{
    private record CreateProductResponse(Guid Id);

    [Fact]
    public async Task CreateProduct_ShouldReturn200OkWithProductId()
    {
        // Arrange
        // Program sınıfımızdaki DI servisi, DbContext t&amp;uuml;revini Postgresql ile &amp;ccedil;alışacak şekilde yapılandırıyor.
        // Tabbi EF kullandığımız i&amp;ccedil;in beraberinde de bir&amp;ccedil;ok servis enjekte ediliyor. Bu y&amp;uuml;zden DbContext ile ilgili
        // ne kadar kayıtlı bileşen varsa kaldırıyoruz.
        var client = factory.WithWebHostBuilder(builder =&amp;gt;
        {
            builder.ConfigureServices(services =&amp;gt;
            {
                services.RemoveAll(typeof(IDbContextOptionsConfiguration&amp;lt;DeppoDbContext&amp;gt;)); // Program sınıfında AddDbContext'in kaydettiği Npgsql yapılandırma kaynağını kaldırır.
                services.RemoveAll(typeof(DbContextOptions&amp;lt;DeppoDbContext&amp;gt;)); // DbContext ile ilgili t&amp;uuml;m servisleri kaldırır.
                services.RemoveAll(typeof(DbConnection)); // Varsa DbConnection ile ilgili t&amp;uuml;m servisleri kaldırır. &amp;Ouml;rneğin veritabanı kayıtları silinir.

                services.AddDbContext&amp;lt;DeppoDbContext&amp;gt;(options =&amp;gt;
                {
                    options.UseInMemoryDatabase("DbTest_" + Guid.NewGuid().ToString());
                });
            });
        }).CreateClient();
        var request = new CreateProductRequest("Pragmatic Programmer", 42.99m, "Books", 4);

        // Act
        var response = await client.PostAsJsonAsync("/api/products", request); // POST isteği g&amp;ouml;nderilir ve yanıt alınır.

        // Assert
        Assert.Equal(HttpStatusCode.OK, response.StatusCode);
        var responseData = await response.Content.ReadFromJsonAsync&amp;lt;CreateProductResponse&amp;gt;();
        Assert.NotNull(responseData);
        Assert.NotEqual(Guid.Empty, responseData.Id);
    }
}&lt;/pre&gt;
&lt;p&gt;Testlerimizdeki nihai durumu aşağıdaki g&amp;ouml;rselle &amp;ouml;zetleyebiliriz.&lt;em&gt;&lt;br /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2026/Mart/IntegrationTests.png" alt="" /&gt;&lt;/p&gt;
&lt;h3&gt;11. TestContainer ile Entegrasyon Testleri&lt;/h3&gt;
&lt;p&gt;Son entegrasyon testlerinde &lt;strong&gt;in-memory&lt;/strong&gt; veritabanı kullanarak ilerledik ancak kurumsal &amp;ccedil;aptaki &amp;ccedil;&amp;ouml;z&amp;uuml;mlerde genellikle &lt;strong&gt;Test Container&lt;/strong&gt;' lar tercih ediliyor. Bunun en b&amp;uuml;y&amp;uuml;k sebebi&lt;strong&gt; in-memory&lt;/strong&gt; veritabanı rol&amp;uuml;n&amp;uuml; &amp;uuml;stlenen enstr&amp;uuml;manın aslında ger&amp;ccedil;ekten bir veritabanı olmaması. Zira &lt;strong&gt;SQL&lt;/strong&gt;'e veye &lt;strong&gt;PostgreSQL&lt;/strong&gt;'e &amp;ouml;zg&amp;uuml; bir&amp;ccedil;ok &amp;ouml;zellik desteklenmez. Misal &lt;strong&gt;JSONB&lt;/strong&gt; veri kolonları veya stored procedure'ler. Hoş iş s&amp;uuml;re&amp;ccedil;lerindeki kuralların stored procedure'lere yazılması pek de iyi bir fikir değildir ama yine de bazı durumlarda b&amp;ouml;yle bir şeyle karşılaşmak m&amp;uuml;mk&amp;uuml;n olabilir. Bu y&amp;uuml;zden ger&amp;ccedil;ek bir veritabanı kullanmak daha sağlıklı sonu&amp;ccedil;lar verecektir.&lt;/p&gt;
&lt;p&gt;Bir &lt;strong&gt;Test Container&lt;/strong&gt; kullanarak testler sırasında ge&amp;ccedil;ici olarak ayağa kaldırılan ger&amp;ccedil;ek bir veritabanı ile entegrasyon sağlayabiliriz. &lt;strong&gt;Test Container&lt;/strong&gt; teorik olarak arka planda bir &lt;strong&gt;docker container&lt;/strong&gt; ayağa kaldırır. Dolayısıyla sisteminizde &lt;strong&gt;docker&lt;/strong&gt; kurulu olduğunu varsayıyorum. Bizim senaryomuzda ben &lt;strong&gt;Postgresql&lt;/strong&gt; kullandığım i&amp;ccedil;in &lt;strong&gt;Testcontainers.PostgreSql&lt;/strong&gt; isimli &lt;a href="https://www.nuget.org/packages/Testcontainers.PostgreSql" target="_blank"&gt;nuget paketini&lt;/a&gt; kullanarak devam edeceğim. Şimdi test projesine aşağıdaki kod i&amp;ccedil;eriğine sahip olan yeni&amp;nbsp;&lt;strong&gt;WebApplicationFactory&lt;/strong&gt; t&amp;uuml;revini ekleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using HexagonalAdventure.Adapters.Out.EF;
using Microsoft.AspNetCore.Hosting;
using Microsoft.AspNetCore.Mvc.Testing;
using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Infrastructure;
using Microsoft.Extensions.DependencyInjection;
using Microsoft.Extensions.DependencyInjection.Extensions;
using System.Data.Common;
using Testcontainers.PostgreSql;

namespace HexagonalAdventure.Apdaters.IntegrationTests;

public class PostgresWebApplicationFactory
    : WebApplicationFactory&amp;lt;Program&amp;gt;, IAsyncLifetime
{
    // Testler başlamadan &amp;ouml;nce ve bittikten sonra yapmamız gereken kaynak y&amp;ouml;netim işlemleri olacağından
    // bu sınıfa IAsyncLifetime aray&amp;uuml;z&amp;uuml;n&amp;uuml; de uyguladık.

    private readonly PostgreSqlContainer _container = new PostgreSqlBuilder()
        .WithDatabase("DeppoTestDb")
        .WithUsername("postgres")
        .WithPassword("P@ssw0rd1234")
        .Build();
    public async Task InitializeAsync()
    {
        // Docker &amp;uuml;zerinden postgresql konteynırını başlatır. Testler bu veritabanını kullanacak.
        await _container.StartAsync();
    }

    async Task IAsyncLifetime.DisposeAsync()
    {
        await _container.DisposeAsync(); // Testler tamamlandıktan sonra konteynırı durdurur ve kaynakları temizler.
    }

    // Burada da WebApplicationFactory'den gelen ConfigureWebHost metodunu eziyoruz(override)
    // Burada klasik olarak program sınıfındaki servislerin temizlenmesi ve container db'nin context'e eklenmesi gibi işlemler yapılıyor.
    protected override void ConfigureWebHost(IWebHostBuilder builder)
    {
        builder.ConfigureServices(services =&amp;gt;
        {
            services.RemoveAll(typeof(IDbContextOptionsConfiguration&amp;lt;DeppoDbContext&amp;gt;)); // Program sınıfında AddDbContext'in kaydettiği Npgsql yapılandırma kaynağını kaldırır.
            services.RemoveAll(typeof(DbContextOptions&amp;lt;DeppoDbContext&amp;gt;)); // DbContext ile ilgili t&amp;uuml;m servisleri kaldırır.
            services.RemoveAll(typeof(DbConnection)); // Varsa DbConnection ile ilgili t&amp;uuml;m servisleri kaldırır. &amp;Ouml;rneğin veritabanı kayıtları silinir.

            services.AddDbContext&amp;lt;DeppoDbContext&amp;gt;(options =&amp;gt;
            {
                options.UseNpgsql(_container.GetConnectionString()); // Artık Npgsql, container'ın sağladığı db'ye bağlanacak
            });

            // Tabii şimdi bir konteynır kullanıyor olsa da ger&amp;ccedil;ek veritabanına ihtiyacımız var.
            // Dolayısıyla migration prosed&amp;uuml;r&amp;uuml;n&amp;uuml; y&amp;uuml;r&amp;uuml;tmemiz lazım ki gerekli tablolar da oluşsun.
            var serviceProvider = services.BuildServiceProvider();
            using var scope = serviceProvider.CreateScope();
            var dbContext = scope.ServiceProvider.GetRequiredService&amp;lt;DeppoDbContext&amp;gt;();
            dbContext.Database.EnsureCreated();
        });
    }
}&lt;/pre&gt;
&lt;p&gt;Buna g&amp;ouml;re tek yapmamız gereken test sınıfına &lt;strong&gt;WebApplicationFactory&lt;/strong&gt; yerine &lt;strong&gt;PostgresWebApplicationFactory&lt;/strong&gt; t&amp;uuml;r&amp;uuml;nden bir nesne &amp;ouml;rneğini enjekte etmek olacak. Bu &amp;ccedil;alışmadaki diğer test metodu ile karışmaması adına yeni bir test sınıfı ve metod ile devam etmeye karar verdim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using HexagonalAdventure.Adapters.In.WebApi.Controllers;
using System.Net;
using System.Net.Http.Json;

namespace HexagonalAdventure.Apdaters.IntegrationTests;

public class ProductControllerTests(PostgresWebApplicationFactory factory)
    : IClassFixture&amp;lt;PostgresWebApplicationFactory&amp;gt;
{
    private record CreateProductResponse(Guid Id);

    [Fact]
    public async Task CreateProduct_WhenUsingContainer_ShouldReturn200OkWithProductId()
    {
        // Arrange
        var client = factory.CreateClient();
        var request = new CreateProductRequest("Pragmatic Programmer", 42.99m, "Books", 4);

        // Act
        var response = await client.PostAsJsonAsync("/api/products", request);

        // Assert
        Assert.Equal(HttpStatusCode.OK, response.StatusCode);
        var responseData = await response.Content.ReadFromJsonAsync&amp;lt;CreateProductResponse&amp;gt;();
        Assert.NotNull(responseData);
        Assert.NotEqual(Guid.Empty, responseData.Id);
    }
}&lt;/pre&gt;
&lt;p&gt;Sadece bu testi &amp;ccedil;alıştırarıp ger&amp;ccedil;ekten de &lt;strong&gt;docker&lt;/strong&gt; tarafında bir &lt;strong&gt;container&lt;/strong&gt; ayağa kalkıyor mu ve testler bu container'daki veritabanına bağlanarak &amp;ccedil;alışıyor mu diye kontrol edebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2026/Mart/ContainerTest.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Burada dikkat edilmesi gereken nokta s&amp;ouml;z konusu container'ın test tamamlanmadan &amp;ouml;nce başlatılması ve test bittikten sonra da kaldırılmasıdır. İlk ısınma sırasında&lt;em&gt;(warm-up diyelim)&lt;/em&gt; testin s&amp;uuml;resi biraz uzayabilir zira container'ın ayağa kalkması ve veritabanının hazır hale gelmesi zaman alabilir. Ancak kullanmak istediğimiz veritabanı &amp;ouml;zellikleri d&amp;uuml;ş&amp;uuml;n&amp;uuml;l&amp;uuml;rse bu maliyete değebilir.&lt;/p&gt;
&lt;h3&gt;12. Mimari Uygunluk Testleri&lt;/h3&gt;
&lt;p&gt;Pek &amp;ccedil;ok mimari yaklaşım bileşener arası bağımlılıkların ve izolasyonların doğru y&amp;ouml;netilmesi konusunda hassastır. &amp;Ouml;rneğin bu &amp;ccedil;alışmada ele aldığımız &lt;strong&gt;hexagonal&lt;/strong&gt; mimaride uygulama domain'inin dış d&amp;uuml;nyaya olan bağımlılığını tamamen ortadan kaldırmak &amp;ouml;nemli bir prensiptir. &amp;Ouml;rneğin &lt;strong&gt;domain&lt;/strong&gt; katmanında bir şekilde &lt;strong&gt;entity framework&lt;/strong&gt; ile konuşmaya başladığımız an mimarinin temel prensiplerinden biri olan bağımsızlık ilkesini ihlal etmiş oluruz.&lt;/p&gt;
&lt;p&gt;Bu t&amp;uuml;r durumları tespit etmek i&amp;ccedil;in mimari uygunluk testleri yazılabilir. &lt;strong&gt;Microsoft .Net&lt;/strong&gt; tarafından bakacak olursak bu kontrol&amp;uuml; kolayca icra etmemizi sağlayan &lt;strong&gt;NetArchTest.Rules&lt;/strong&gt; isimli bir &lt;a href="https://github.com/BenMorris/NetArchTest" target="_blank"&gt;nuget paketi&lt;/a&gt; vardır. Mimari testleri ayrı bir projede ele alalım ve bu ama&amp;ccedil;la &lt;strong&gt;HexagonalAdventure.Architecture.Tests&lt;/strong&gt; isimli yeni bir test projesi oluşturarak konunuza devam edelim. Projeye &lt;strong&gt;NetArchTest.Rules&lt;/strong&gt; paketini ekledikten sonra da aşağıdaki gibi bir test sınıfı yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using HexagonalAdventure.Application.Services;
using HexagonalAdventure.Domain;
using NetArchTest.Rules;

namespace HexagonalAdventures.Architecture.Tests;

public class DomainLayerTests
{
    [Fact]
    public void DomainLayer_ShouldNotHaveDependencyOnOtherLayers()
    {
        // Arrange
        var domainAssembly = typeof(Product).Assembly;

        // Act
        var result = Types.InAssembly(domainAssembly)
            .ShouldNot()
            .HaveDependencyOnAny(
            "HexagonalAdventure.Application",
            "HexagonalAdventure.Adapters",
            "Microsoft.EntityFrameworkCore"
            )
            .GetResult();

        // Assert
        Assert.True(result.IsSuccessful, "Domain layer should not have dependencies on Application, Adapters, or EF Core.");
    }

    [Fact]
    public void ApplicationLayer_ShouldNotHaveDependencyOnAdapters()
    {
        // Arrange
        var appAssembly = typeof(ProductService).Assembly;
        
        // Act
        var result = Types.InAssembly(appAssembly)
            .ShouldNot()
            .HaveDependencyOn("HexagonalAdventure.Adapters")
            .GetResult();

        // Assert
        Assert.True(result.IsSuccessful, "Application layer should not have dependencies on Adapters.");
    }
}&lt;/pre&gt;
&lt;p&gt;Bu testlere g&amp;ouml;re &amp;ouml;rneğin &lt;strong&gt;HexagonalAdventure.Application&lt;/strong&gt; &amp;ouml;neki i&amp;ccedil;eren namespace'lerin olduğu projelerin &lt;strong&gt;Domain&lt;/strong&gt; katmanına sızmasını engellemiş oluyoruz&lt;em&gt;(Entity Framework ile birlikte tabii)&lt;/em&gt;. Ben burada sadece birka&amp;ccedil; temel kontrol ekledim ancak mimari uygunluk testlerini &amp;ccedil;ok daha detaylı hale getirmek m&amp;uuml;mk&amp;uuml;n olabilir. &amp;Ouml;rneğin domain katmanında sadece domain entity'lerin bulunması gerektiği gibi bir kural veya application katmanında sadece servislerin bulunması gerektiği gibi bir kural da ekleyebiliriz.&amp;nbsp;G&amp;uuml;ncel olarak geldiğimiz noktada projemizdeki t&amp;uuml;m testlerin başarılı bir şekilde &amp;ccedil;alıştığını g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2026/Mart/LastTestResults.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Genel G&amp;ouml;r&amp;uuml;n&amp;uuml;m&lt;/h2&gt;
&lt;p&gt;Solution i&amp;ccedil;eriğinde bir&amp;ccedil;ok proje ve harici nuget bağımlılıkları var. Gelinen noktada neler olduğunu kabaca aşağıdaki diagramda olduğu gibi &amp;ouml;zetleyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2026/Mart/GeneralOverview.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Yazının bu kısmına kadar geldiyseniz size canı g&amp;ouml;n&amp;uuml;lden teşekk&amp;uuml;r ederim. Umarım bilgilendirici ve denediğinize değer bir makale olmuştur. Burada ele aldığımız &lt;a href="https://github.com/buraksenyurt/HexagonalArchitecture_101" target="_blank"&gt;uygulama kodlarına elbette github reposu &amp;uuml;zerinden erişebilirsiniz&lt;/a&gt;. Hatta &lt;strong&gt;DDD&lt;/strong&gt;'ye &amp;ouml;zg&amp;uuml; bir takım yenilikler de eklemeye &amp;ccedil;alışacağım. &lt;strong&gt;Event&lt;/strong&gt;'ler gibi. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2026-03-13 19:31:00</pubDate>
  <slug>hexagonal-architecture-101</slug>
  <tags>
    <tag>software-architecture</tag>
    <tag>onion-architecture</tag>
    <tag>dotnet</tag>
    <tag>c-sharp</tag>
    <tag>yazılım-mimarileri</tag>
    <tag>hexagonal-architecture</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>