<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF 4.0 Yenilikleri - Routing Service Geliştirmek - Giriş [Beta 1]</title>
  <description>Servis Yönelimli Mimari(Service Oriented Architecture) çözümlerinde zaman zaman yönlendirme amaçlı servislerin yazılması gerekmektedir(Router Service). Bu servislerin genel kullanım amacı çoğunlukla, istemcilerden gelecek olan talepleri değerlendirip asıl işi yapacak olan servislere devretmek ile ilişkilidir. Ancak, gelen taleplere ait içeriğinin(Message Content, Header vb...) filtrelenerek ele alınması gibi ileri seviye teknikleride içerebilir. Yönlendirme işlemleri için kullanılan pek çok donanımsal cihaz ve hatta yazılım zaten mevcuttur. Bu nedenle öncelikli olarak yönlendirme servislerine neden ihtiyaç duyulabileceğini kavramakta yarar vardır.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f8%2fblg71_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Servis Y&amp;ouml;nelimli&amp;nbsp;Mimari(Service Oriented&amp;nbsp;Architecture)&lt;/strong&gt;&amp;nbsp;&amp;ccedil;&amp;ouml;z&amp;uuml;mlerinde&amp;nbsp;zaman zaman y&amp;ouml;nlendirme ama&amp;ccedil;lı servislerin yazılması gerekmektedir&lt;strong&gt;(Router Service). &lt;/strong&gt;Bu servislerin genel kullanım amacı &amp;ccedil;oğunlukla, istemcilerden gelecek olan talepleri değerlendirip asıl işi yapacak olan servislere devretmek ile ilişkilidir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Ancak, gelen taleplere ait&amp;nbsp;i&amp;ccedil;eriğinin(Message Content, Header vb...)&amp;nbsp;filtrelenerek ele alınması gibi ileri seviye teknikleride i&amp;ccedil;erebilir. Y&amp;ouml;nlendirme işlemleri i&amp;ccedil;in kullanılan pek &amp;ccedil;ok donanımsal cihaz ve hatta yazılım zaten mevcuttur. Bu nedenle &amp;ouml;ncelikli olarak y&amp;ouml;nlendirme servislerine neden ihtiya&amp;ccedil; duyulabileceğini kavramakta yarar vardır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF tarafında Routing Service geliştirilmesi hangi durumlarda tercih edilir?&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;Ouml;zel bir &lt;strong&gt;Load Balancing &lt;/strong&gt;yapısı i&amp;ccedil;in&lt;em&gt;(genellikle donanımsal veya yazılımsal y&amp;uuml;k dengeleyici sistemlerin yetersiz kaldığı yada &amp;ouml;zelleştirilmek istendiğin durumlarda)&lt;/em&gt;.&lt;/li&gt;
&lt;li&gt;İstemciden gelen mesajın i&amp;ccedil;eriğine g&amp;ouml;re servis y&amp;ouml;nlendirilmesi yapılmak istendiğinde&lt;strong&gt;(Content Based).&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&amp;Ouml;nceliğe g&amp;ouml;re servis y&amp;ouml;nlendirmesi yapılmak istendiğinde&lt;strong&gt;(Priority Based)&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;Versiyonlama senaryolarında.&lt;/li&gt;
&lt;li&gt;İstemciler ve y&amp;ouml;nlendirilen servisler arasında bir g&amp;uuml;venlik ge&amp;ccedil;idi kurulmak istendiğinde&lt;em&gt;(ki bu ge&amp;ccedil;it genellikle &lt;strong&gt;DMZ-demilitarized&lt;/strong&gt; zone arkasında asıl servislere olan akışı g&amp;uuml;venlik kontrol&amp;uuml;ne alır)&lt;/em&gt;.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;strong&gt;WCF 3.X&lt;/strong&gt; tarafında y&amp;ouml;nlendirme servisi geliştirebilmek i&amp;ccedil;in belirli kodlama eforu sarfetmek gerekirken&lt;em&gt;(ki bu konuda daha &amp;ouml;nceden yayınladığım bir &lt;a title="Front End Service Gelistirmek" href="/post/WCF-Front-End-Service-Gelistirmek.aspx" target="_blank"&gt;yazımı &lt;/a&gt;incleyebilirsiniz)&lt;/em&gt;, &lt;strong&gt;WCF 4.0&lt;/strong&gt; tarafında bu işlemler belirli tipler ve konfigurasyon &amp;ouml;zellikleri ile &lt;strong&gt;one-way,two-way&lt;/strong&gt; ve &lt;strong&gt;duplex&lt;/strong&gt; iletişim seviyesinde oldu&amp;ccedil;ka&amp;nbsp;kolaylaştırılmıştır. &lt;strong&gt;WCF 4.0&lt;/strong&gt; tarafında &lt;strong&gt;System.ServiceModel.Routing&amp;nbsp;assembly' &lt;/strong&gt;ı i&amp;ccedil;erisinde yine aynı&amp;nbsp;adlı isim alanında yer alan&amp;nbsp;&lt;strong&gt;RoutingService &lt;/strong&gt;isimli sınıf, s&amp;ouml;z konusu y&amp;ouml;nlendirme servisi i&amp;ccedil;in gerekli &amp;ccedil;alışma zamanı ortamının hazırlanmasını sağlamakta ve ayrıca istemci taleplerinin filtrelenerek uygun alt servislere aktarılmasında &amp;ouml;nemli bir rol oynamaktadır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Not : .Net Framework Beta 1 s&amp;uuml;r&amp;uuml;m&amp;uuml;nde RoutingService olarak ge&amp;ccedil;en y&amp;ouml;nlendirme sınıfı &amp;ccedil;eşitli internet kaynaklarında(&amp;ouml;rneğin &lt;a title="WCF 4.0 - Route Service" href="http://www.aspnetpro.com/articles/2009/05/asp200905mb_f/asp200905mb_f.asp" target="_blank"&gt;Michele Leroux Bustamante' &lt;/a&gt;nin bloğunda) RouterService olarak ge&amp;ccedil;mektedir. Dolayısıyla final s&amp;uuml;r&amp;uuml;mde servisin adında farklılıklar olabilir. &amp;Ouml;rneklerimizi .Net Framework Beta 1 &amp;uuml;zerinde geliştirdiğimizi hatırlatmak isterim.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg71_RoutingService.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Object Browser&lt;/strong&gt; yardımıyla elde edilen yukarıdaki g&amp;ouml;r&amp;uuml;nt&amp;uuml;nden farkedeceğiniz gibi, &lt;strong&gt;RoutingService&lt;/strong&gt; sınıfı&amp;nbsp;4 farklı &lt;strong&gt;servis s&amp;ouml;zleşmesini(Service Contract)&lt;/strong&gt;&amp;nbsp;uygulamaktadır. Bu anlamda&amp;nbsp;&lt;strong&gt;IDuplexSessionRouter&lt;/strong&gt;, &lt;strong&gt;IRequestReplyRouter&lt;/strong&gt;, &lt;strong&gt;ISimplexDatagramRouter &lt;/strong&gt;ve &lt;strong&gt;ISimplexSessionRouter &lt;/strong&gt;gibi &amp;ouml;nemli &lt;strong&gt;aray&amp;uuml;zleri(Interfaces) &lt;/strong&gt;implemente etmektedir. Dolayısıyla gerekli &lt;strong&gt;MEP(Message Exchange Patterns)&lt;/strong&gt; modellerinin t&amp;uuml;m&amp;uuml; desteklenmektedir. Buna g&amp;ouml;re servisin &lt;strong&gt;one-way, two-way&lt;/strong&gt; veya &lt;strong&gt;duplex&lt;/strong&gt; temelli isteklere g&amp;ouml;re &amp;ccedil;alışabilmesi sağlanmaktadır. &lt;strong&gt;RoutingService&lt;/strong&gt;, &lt;strong&gt;ServiceHost&lt;/strong&gt; nesne &amp;ouml;rneklemesi sırasında parametre olarak kullanıldığından, normal &lt;strong&gt;WCF&lt;/strong&gt; host kurallarına tabidir. Yani &lt;strong&gt;IIS&lt;/strong&gt; veya &lt;strong&gt;Self&lt;/strong&gt; modellerde host edilebilir. Genellikle bir &lt;strong&gt;Windows Service, IIS&lt;/strong&gt; yada duruma g&amp;ouml;re &lt;strong&gt;WAS&lt;/strong&gt; &amp;uuml;zerinden host edilmesi tercih edilmektedir. Genel olarak y&amp;ouml;nlendirme modelini aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &amp;ouml;zetleyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg71_ArchitectureV2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;İstemciden(Client)&lt;/strong&gt; gelen talepler &lt;strong&gt;y&amp;ouml;nlendirme servisine(Router&amp;nbsp;Service)&lt;/strong&gt;&amp;nbsp;ulaştığında belirli filtrelerden ge&amp;ccedil;mekte ve bu filtrelere g&amp;ouml;re belirlenmiş alt servis noktalarına aktarılmaktadırlar. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &amp;ouml;nemli olan noktalardan biriside filtrelemedir. &lt;strong&gt;Filtreleme tablosu(Filter Table)&lt;/strong&gt;&amp;nbsp;ve i&amp;ccedil;erdiği &lt;strong&gt;filtreler(Filters)&lt;/strong&gt; &lt;strong&gt;config &lt;/strong&gt;dosyası i&amp;ccedil;erisinde depolanır. Bu filtrelerde;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;XPath&lt;/strong&gt; gibi sorgular kullanılabilir. Sonu&amp;ccedil; itibariyle mesaj i&amp;ccedil;eriğinin &lt;strong&gt;XML&lt;/strong&gt;&amp;nbsp;tabanlı olduğu d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde bu son derece doğaldır.&amp;nbsp;&lt;/li&gt;
&lt;li&gt;Sadece mesajın &lt;strong&gt;Header&lt;/strong&gt; veya &lt;strong&gt;Soap Action &lt;/strong&gt;kısımlarına bakılabilir.&lt;/li&gt;
&lt;li&gt;Birden fazla filtrenin mantıksal ve(And) işlemine tabi tutulması sağlanabilir. Nitekim, daha &amp;ouml;nceden tanımlanmış iki farklı filtreye olan uygunluğun bir arada sağlanması istenebilir.&lt;/li&gt;
&lt;li&gt;İstenirse programlanmış bileşeneler ile &amp;ouml;zel filtrelemeler yapılabilir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Filtrelemeler konfigurasyon i&amp;ccedil;erikli olarak tutulduğundan, geliştiricilerin(Developers) s&amp;ouml;z konusu filtreleme davranışlarını koda bulaşmadan değiştirebilmesi, g&amp;uuml;ncellemesi veya yenilerini eklemesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;Y&amp;ouml;nlendirme servisi &amp;ccedil;ok doğal olarak istemciden gelen talepleri belirli kurallara g&amp;ouml;re işletmektedir. Y&amp;ouml;nlendirme hizmetinin&amp;nbsp;istemcilere sunacağı bir &lt;strong&gt;Endpoint&lt;/strong&gt; olması ka&amp;ccedil;ınılmazdır. Tabi istenirse birden fazla endpoint sunabilir&lt;em&gt;(&amp;Ouml;rneğin built-in gelen &lt;strong&gt;ISimplexDatagramRouter&lt;/strong&gt;, &lt;strong&gt;IRequestReplyRouter&lt;/strong&gt; gibi servis s&amp;ouml;zleşmelerinden yararlanarak...) &lt;/em&gt;Diğer yandan istemcilerden gelen mesaj filtrelerde yer alan koşullardan birisine uyduğunda, ilişkili olan&amp;nbsp;alt servise y&amp;ouml;nlendirilmelidir.&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re&amp;nbsp;y&amp;ouml;nlendirme servisi, istemciden gelen ve filtreden ge&amp;ccedil;en mesajları uygun alt servislere iletmesi gerektiğinden aynı zamanda bir istemci olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmelidir. Dolayısıyla şekildende g&amp;ouml;r&amp;uuml;leceği gibi &amp;uuml;zerinde her alt servis i&amp;ccedil;in en az bir &lt;strong&gt;Endpoint&lt;/strong&gt; bulunmaktadır. Alt servisler istemcinin asıl işini yapmakla y&amp;uuml;k&amp;uuml;ml&amp;uuml; olmakla birlikte, aynı sunucuda veya farklı sunucular &amp;uuml;zerinde konuşlandırılmış olabilirler. Bu nedenle, y&amp;ouml;nlendirme servisi arkasında &lt;strong&gt;Web Farm&lt;/strong&gt; gibi yapılara sıklıkla rastlandığını s&amp;ouml;yleyebiliriz.&lt;/p&gt;
&lt;p&gt;Peki y&amp;ouml;nlendirme servisinin i&amp;ccedil;erisinde yer aldığı basit bir sistemi nasıl tasarlayabiliriz? Burada belkide en kritik konu filtrelemelerdir. &amp;Ouml;zellikle filtrelerde gelen mesaj i&amp;ccedil;eriği &amp;uuml;zerinde&lt;strong&gt; XPath&lt;/strong&gt; ile sorgular atılması &amp;ouml;nemli olan ve zor noktalardandır. Bu gibi konuları bir sonraki yazımızda ele almaya &amp;ccedil;alışıyor olacağız. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2009-08-24 06:15:00</pubDate>
  <slug>WCF-40-Yenilikleri-Routing-Service</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-40</tag>
    <tag>router</tag>
    <tag>soa</tag>
    <tag>service-oriented-architecture</tag>
  </tags>
  <categories>
    <category>WCF 4.0 Beta 1</category>
  </categories>
</post>