<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>OleDbDataAdapter Sınıfı Olayları</title>
  <description>Bu makalemizde, OleDbDataAdapter sınıfının olaylarını incelemeye çalışacağız. OleDbDataAdapter sınıfı aşağıdaki tabloda belirtilen üç önemli olayı içermektedir. Şimdi dilerseniz bu olayları kısaca incelemeye çalışalım. RowUpdating olayından başlayalım. Bu olay, OleDbRowUpdatingEventArgs sınıfı türünden bir parametre almaktadır. Bu paramterenin sahip olduğu özellikleri kullanarak, bağlantısız katmandaki veriler, veritabanına yazılmadan önce değişik işlevleri yerine getirme imkanına sahip olmuş oluruz. OleDbRowUpdatingEventArgs sınıfının özellikleri aşağıdaki tabloda yer almaktadır.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, OleDbDataAdapter sınıfının olaylarını incelemeye &amp;ccedil;alışacağız. OleDbDataAdapter sınıfı aşağıdaki tabloda belirtilen &amp;uuml;&amp;ccedil; &amp;ouml;nemli olayı i&amp;ccedil;ermektedir.&lt;/p&gt;
&lt;table id="table1" style="border-collapse: collapse; width: 640px;" border="1" cellpadding="5" bgcolor="#cccccc"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="86" height="39"&gt;&lt;strong&gt;Olay&lt;/strong&gt;&lt;/td&gt;
&lt;td width="408" height="39"&gt;&lt;strong&gt;Prototipi&lt;/strong&gt;&lt;/td&gt;
&lt;td width="237" height="39"&gt;&lt;strong&gt;A&amp;ccedil;ıklama&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="86"&gt;FillError&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="408"&gt;&lt;strong&gt; public event &lt;/strong&gt; FillErrorEventHandler&lt;strong&gt; FillError;&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="237"&gt;OleDbDataAdapter'ın fill metodu kullanıldığında oluşabilecek bir hata durumunda bu olay &amp;ccedil;alışır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="86"&gt;RowUpdating&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="408"&gt;&lt;strong&gt; public event &lt;/strong&gt; OleDbRowUpdatingEventHandler&lt;strong&gt; RowUpdating;&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="237"&gt;Update metodu &amp;ccedil;alıştırılarak, veritabanındaki tabloya yapılan değişiklikler (satır ekleme, satır silme, satır g&amp;uuml;ncelleme gibi) ger&amp;ccedil;ekleştirilemden &amp;ouml;nce bu olay &amp;ccedil;alışır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="86"&gt;RowUpdated&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="408"&gt;&lt;strong&gt; public event &lt;/strong&gt; OleDbRowUpdatedEventHandler&lt;strong&gt; RowUpdated;&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="237"&gt;Veritabanında yapılacak olan değişiklikler, Update metodu ile ger&amp;ccedil;ekleştirildikten sonra bu olay &amp;ccedil;alışır.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Tablo 1. OleDbDataAdapter olayları.&lt;/p&gt;
&lt;p&gt;Şimdi dilerseniz bu olayları kısaca incelemeye &amp;ccedil;alışalım. RowUpdating olayından başlayalım. Bu olay, OleDbRowUpdatingEventArgs sınıfı t&amp;uuml;r&amp;uuml;nden bir parametre almaktadır. Bu paramterenin sahip olduğu &amp;ouml;zellikleri kullanarak, bağlantısız katmandaki veriler, veritabanına yazılmadan &amp;ouml;nce değişik işlevleri yerine getirme imkanına sahip olmuş oluruz. OleDbRowUpdatingEventArgs sınıfının &amp;ouml;zellikleri aşağıdaki tabloda yer almaktadır.&lt;/p&gt;
&lt;table id="table2" style="border-collapse: collapse; width: 100%;" border="1" cellpadding="5" bgcolor="#cccccc"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td colspan="3" height="35"&gt;&lt;strong&gt; OleDbRowUpdatingEventArgs Sınıfı &amp;Ouml;zellikleri&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="117"&gt;&lt;strong&gt; &amp;Ouml;zellik&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="58%"&gt;&lt;strong&gt; G&amp;ouml;revi&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="24%"&gt;&lt;strong&gt; Prototipi&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="117"&gt;Command&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="58%"&gt;Update metodu &amp;ccedil;alıştırılıdığında &amp;ccedil;alışacak olan OleDbCommand tipindeki komutu işaret eder. Bu nedenle &amp;ouml;zelliğin değerinin tipi OleDbCommand'dır.&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="24%"&gt;&lt;strong&gt; public new &lt;/strong&gt;OleDbCommand&lt;strong&gt; Command {get; set;}&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="117"&gt;Row&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="58%"&gt;Update metodu &amp;ccedil;ağırıldığında, veritabanına g&amp;ouml;nderilecek olan satırı işaret eder. Bu satır DataRow tipindedir ve bu nedenle &amp;ouml;zelliğin veri tipi DataRow'dur.&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="24%"&gt;&lt;strong&gt; public &lt;/strong&gt;DataRow&lt;strong&gt; Row {get;}&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="117"&gt;Status&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="58%"&gt;Bu &amp;ouml;zellik ile &amp;ccedil;alışacak olan komut nesnesinin durumu elde edilir veya değiştirilir. &amp;Ouml;zellik UpdateStatus numaralandırıcısı t&amp;uuml;r&amp;uuml;nden bir değeri belirtir. Bu numaralandırıcı Continue, ErrorsOccurred, SkipAllRemainingRows, SkipCurrentRow değerlerinden birisini alır.&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="24%"&gt;&lt;strong&gt; public &lt;/strong&gt;UpdateStatus&lt;strong&gt; Status {get; set;}&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="117"&gt;StatementType&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="58%"&gt;Bu &amp;ouml;zellik Update metodu ile &amp;ccedil;alıştırılacak olan sql ifadesini işaret etmektedir. StatementType numaralandırıcısı tipinden bir değeri belirtir. Bu numaralandırıcı sql ifadesinin tipini belirten select, insert, delete ve update değerlerinden birisini alır.&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="24%"&gt;&lt;strong&gt; public &lt;/strong&gt;StatementType&lt;strong&gt; StatementType {get;}&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="117"&gt;TableMapping&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="58%"&gt;Bu &amp;ouml;zellik, update metodu &amp;ccedil;alıştırıldığında, bağlantısız katman nesnesindeki tablo haritası ile, veritabanındaki tablo arasındaki eşleştirme ilişkisini DataTableMapping sınıfı &amp;ouml;rneği olan bir nesne ile ifade eder.&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="24%"&gt;&lt;strong&gt; public &lt;/strong&gt;DataTableMapping&lt;strong&gt; TableMapping {get;}&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="117"&gt;Errors&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="58%"&gt;Update metodu &amp;ccedil;alıştırılıdığında işletilen sql komutunun &amp;ccedil;alışmasında bir hata oluşması durumunda, oluşan hatayı temsil eden bir &amp;ouml;zelliktir. Bu sebepler &amp;ouml;zelliğin tipi Exception'dır.&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="24%"&gt;&lt;strong&gt; public &lt;/strong&gt;Exception&lt;strong&gt; Errors {get; set;}&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Tablo 2. OleDbRowUpdatingEventArgs Sınıfı &amp;Ouml;zellikleri&lt;/p&gt;
&lt;p&gt;Bu &amp;ouml;zelliklerin, RowUpdating metodu i&amp;ccedil;inde nasıl işlendiğini &amp;ouml;rnekler ile incelemeden &amp;ouml;nce, RowUpdating olayının işleme ge&amp;ccedil;me s&amp;uuml;recini ve yerini incelemekte fayda olduğu kanısındayım. RowUpdating olayının, Update metodu i&amp;ccedil;indeki sql komutları &amp;ccedil;alıştırılıp, gerekli değişiklikler veritabanına yansıtılmadan &amp;ouml;nce ger&amp;ccedil;ekleştiğini s&amp;ouml;yleyebiliriz. Aşağıdaki şekil bu konuda bizlere daha iyi bir fikir verecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk60_1.gif" alt="" width="355" height="509" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 1. RowUpdating ve RowUpdated olaylarının devreye girdiği noktalar.&lt;/p&gt;
&lt;p&gt;Şimdi RowUpdating olayını incelemeye başlayalım. &amp;Ouml;ncelikle basit bir windows uygulaması oluşturalım. Bu uygulamada, Friends isimli veritabanındaki, Kisişer isimli tablomuzun verilerini kullanacağız. Şimdi uygulamamızın başlangı&amp;ccedil; kodlarını oluşturalım. OleDbDataAdapter nesnemiz i&amp;ccedil;in, RowUpdating olayının nasıl eklendiğine dikkatinizi &amp;ccedil;ekmek isterim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;/* Sql veritabanındaki Friends isimli veritabanındaki Kisiler isimli tabloya bağlanabilmek i&amp;ccedil;in bize gerekli olan nesneleri tanımlıyoruz. Bir OleDbConnection nesnesi, sql veritabanına bağlantı hattı &amp;ccedil;ekmek i&amp;ccedil;in; bir OleDbDataAdapter nesnesi, Kisiler tablosundaki verileri, bağlantısız katman nesnemiz olan DataTable'ın veritabanında g&amp;ouml;sterdiği alana y&amp;uuml;klemek ve verilerdeki değişiklikleri veritabanına yazmak i&amp;ccedil;in.*/
OleDbConnection con;
OleDbDataAdapter da;
DataTable dt; 

private void Form1_Load(object sender, System.EventArgs e)
{
    con=new OleDbConnection("provider=SQLOLEDB;data source=localhost;integrated security=sspi;database=Friends"); /* Bağlantı hattımız oluşturuluyor.*/
    da=new OleDbDataAdapter("Select * From Kisiler",con); /* OleDbDataAdapter nesnemiz oluşturuluyor. */
    da.RowUpdating+=new OleDbRowUpdatingEventHandler(RowUpdatingOlayi); /*OleDbDataAdapter nesnemiz i&amp;ccedil;in, RowUpdating olayını tanımlıyor ve oluşturuyoruz.*/
    dt=new DataTable("Kisiler"); /* DataTable nesnemizin oluşturuluyor. */
}

private void btnDoldur_Click(object sender, System.EventArgs e)
{
    da.Fill(dt); /* DataTable nesnemizin bellekte işaret ettiği b&amp;ouml;lge, Kisiler tablosundaki veriler ile dolduruluyor.*/
    dataGrid1.DataSource=dt; /* DataGrid nesnemize veri kaynağı olarak DataTable nesnemiz atanıyor.*/
}
private void btnGuncelle_Click(object sender, System.EventArgs e)
{         OleDbCommandBuilder cb=new OleDbCommandBuilder(da); /* OleDbDataAdapter nesnemiz i&amp;ccedil;in gerekli insert,delete ve update sql komutlarını otomatik olarak OleDbCommandBuilder yardımıyla oluştuyuroz.*/
    da.Update(dt); /* DataTable'daki değişiklikler veritabanına g&amp;ouml;nderiliyor.*/
}

/* RowUpdating olayımız tetiklendiğinde bu yordamımız &amp;ccedil;alıştırılacak. */
private void RowUpdatingOlayi(object Sender,OleDbRowUpdatingEventArgs arg)
{

}&lt;/pre&gt;
&lt;p&gt;Şimdi RowUpdating olayımızı incelemeye başlayalım. &amp;Ouml;rneğin, Row ve Status &amp;ouml;zelliklerini bir arada inceleyelim. Farzedelimki, KisiID numarası 1000 olan satırının hi&amp;ccedil; bir şekilde g&amp;uuml;ncellenmesini istemiyoruz. Bu durumu değerlendirebileceğimiz en g&amp;uuml;zel yer, Update işlemi başarı ile ger&amp;ccedil;ekleşmeden &amp;ouml;nceki yerdir. Yani RowUpdating metodu.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void RowUpdatingOlayi(object sender,OleDbRowUpdatingEventArgs arg)
{
    if(arg.StatementType==StatementType.Update) /* Eğer şu an yapılan işlem OleDbDataAdapter nesnesinin UpdateCommand metodunun i&amp;ccedil;erdiği OleDbCommand'ı &amp;ccedil;alıştıracaksa bu kod bloğu devreye giriyor.*/
    {
        if(arg.Row["KisiID"].ToString()=="1000") /* Şu an işlemde olan satırın KisiID alanının değerine bakıyoruz.*/
        {
            listBox1.Items.Add("1000 nolu kaydı g&amp;uuml;ncelleyemessiniz.");
            arg.Status=UpdateStatus.SkipCurrentRow; /* SkipCurrentRow ile bu satırın g&amp;uuml;ncellenmesini engelliyoruz.*/
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rnek kodlar ile uygulamamızı &amp;ccedil;alıştırdığımızda, KisiID alanının değerinin 1000 olduğu satırın DataTable &amp;uuml;zerinde değiştirilsede, veritabanı &amp;uuml;zerinde değiştirilmediğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Ancak diğer satırlardaki değişiklikler veritabanına yansıtılır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk60_2.gif" alt="" width="376" height="400" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 2. Uygulamanın &amp;Ccedil;alışması.&lt;/p&gt;
&lt;p&gt;Burada Ad alanındaki Burak Selim değerini Burak S. olarak değiştirdik. Bu değişiklik DataTable &amp;uuml;zerinde ger&amp;ccedil;ekleşmiştir. Ancak bunu veritabanınada yansıtmak istediğimizde, RowUpdating olayındaki karşılaştırma ifadeleri devreye girecek ve değişiklik veritabanına yansıtılmayacaktır. Visual Studio.NET ortamından tablo i&amp;ccedil;eriğinde baktığımızda bu değişikliğin ger&amp;ccedil;ekleşmediğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk60_3.gif" alt="" width="501" height="108" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 3. Değişiklik veritabanındaki tabloya yansıtılmadı.&lt;/p&gt;
&lt;p&gt;RowUpdating olayı ile ilgili verilebilecek bir diğer g&amp;uuml;zel &amp;ouml;rnek ise, hen&amp;uuml;z g&amp;uuml;ncellenmiş olan bir satırın başka bir kullanıcı tarafından g&amp;uuml;ncellenmek istenmesi gibi bir durumu kontrol altına almaktır. Bu olayda, o anki satıra ait Orjinal değerlere bakarak, g&amp;uuml;ncellenmek istenen değerler ile aynı olup olmadığı araştırılır. B&amp;ouml;yle bir sonu&amp;ccedil; &amp;ccedil;ıkarsa kullanıcıya bu satırın zaten g&amp;uuml;ncellendiği tekrar g&amp;uuml;ncellemek isteyip istemeyeceği sorulabilir. Bu işlevi yerine getirmek i&amp;ccedil;in RowUpdating olayımızı aşağıdaki gibi şekillendirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void RowUpdatingOlayi(object sender,OleDbRowUpdatingEventArgs arg)
{
    if(arg.StatementType==StatementType.Update)
    {
        string sqlKomutu="SELECT * FROM Kisiler WHERE KisiID='"+arg.Row["KisiID",DataRowVersion.Original]+"' AND Ad='"+arg.Row["Ad",DataRowVersion.Original]+"' AND Soyad='"+arg.Row["Soyad",DataRowVersion.Original]+"' AND DogumTarihi='"+arg.Row["DogumTarihi",DataRowVersion.Original]+"' AND Meslek='"+arg.Row["Meslek",DataRowVersion.Original]+"'"; 
        OleDbCommand cmd=new OleDbCommand(sqlKomutu,con);
        con.Open();
        if(cmd.ExecuteNonQuery()==0)
        {
            listBox1.Items.Add("Bu satır zaten g&amp;uuml;ncellenmiş.");
            arg.Status=UpdateStatus.SkipCurrentRow;
        }
    } 
}&lt;/pre&gt;
&lt;p&gt;Burada &amp;ouml;ncelikle bir select sorgusu oluşturuyoruz. Bu sorgu, Update komutu &amp;ccedil;ağırıldığında, OleDbDataAdapter nesnesinin ilgili komutlarına g&amp;ouml;nderilen satıra ait alanların, en son Fill metodunun &amp;ccedil;ağırılışından sonraki hallerine bakıyor. Eğer aynı g&amp;uuml;ncellemeler başka bir kullanıcı tarafından yapılmış ise, bu g&amp;uuml;ncel satırın o anki değeri ile veritabanındaki aynı olmayacaktır. Dolayısıyla, orjinal değerler değişmiş olacağından select sorgusunun &amp;ccedil;alışması sonucu geriye 0 değeri d&amp;ouml;necektir. Bu başka bir kullanıcının bu satırı g&amp;uuml;ncellediğini g&amp;ouml;stermektedir. Bu halde iken kullanıcı uyarılır. İstersek buraya, bir soru kutucuğu a&amp;ccedil;arak kullanıcının bu satırı tekrardan g&amp;uuml;ncellemek isteyip istemediği sorulabilir. Ben bunun geliştirilmesini siz değerli okurlarıma bırakıyorum. If d&amp;ouml;ng&amp;uuml;m&amp;uuml;z i&amp;ccedil;indede bu satır eğer daha &amp;ouml;nceden g&amp;uuml;ncellenmiş ise, SkipCurrentRow değerini, OleDbRowUpdatingEventArgs sınıfının Status &amp;ouml;zelliğine atayarak bu satırın g&amp;uuml;ncellenmemesini sağlıyoruz. Şimdi uygulamamızı &amp;ccedil;alıştırıp deneyelim. Bunun i&amp;ccedil;in aynı programı kendi bilgisayarınızda iki kez a&amp;ccedil;manız yeterli olucaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk60_5.gif" alt="" width="512" height="544" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 4. İlk hali.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;nce, soldaki pencerede g&amp;ouml;r&amp;uuml;len uygulamada Nihat Ali Demir'in soyadını D. olarak değiştiriyoruz ve Guncelle başlıklı butona basarak bu satırı veri tabanında da g&amp;uuml;ncelliyoruz. Şimdi ekranın sağındaki kullanıcınında aynı soyadını aynı şekilde değiştirmek istediğini d&amp;uuml;ş&amp;uuml;nelim. Bu ama&amp;ccedil;la sağdaki programda yine Nihat Ali Demir'in soyadını D. yapıyoruz ve Guncelle başlıklı butona tıklıyoruz. Bu andan itibaren bizim RowUpdating olayına yazdığımız kodlar devreye giriyor. Satırın, Soyad alanının, Fill metodunun &amp;ccedil;ağırılması ile birlikte orjinal değeri halen Demir dir. Şimdi bunu D. nokta yapmak istediğimizde, &amp;ouml;ncelikle orjinal alan değeri olan Demir select sorgumuza girer. Bu sorgu &amp;ccedil;alıştığında b&amp;ouml;yle bir satır bulunamayacaktır. &amp;Ccedil;&amp;uuml;nk&amp;uuml; Demir, D. ile değiştirilmiştir. Ancak ikinci program fill metodunu bu son g&amp;uuml;ncellemeden sonra &amp;ccedil;ağırmadığı i&amp;ccedil;in durumdan habersizdir. Bu nedenle ikinci programın yapmak istediği değişiklik zaten yapılmış olduğundan geri alınacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk60_6.gif" alt="" width="373" height="400" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 5. İkinci programın aynı g&amp;uuml;ncellemeyi yapması engellenir.&lt;/p&gt;
&lt;p&gt;Bununla birlikte ikinci kullanıcının bu noktadan sonra, D. ismini Demirci olarak değiştirmek istediğini yani farklı bir veri girdiğini farzedelim. Bu değişiklik ger&amp;ccedil;ekleşecektir. Bu durumu ş&amp;ouml;yle a&amp;ccedil;ıklayabiliriz. İkinci program, Demir alanını D. nokta yapmaya &amp;ccedil;alıştığında, bu g&amp;uuml;ncelleme diğer program tarafından yapılmış olduğundan, satırın g&amp;uuml;ncellenmesi geri alınır. Ancak bu noktada Soyad alanının orjinal değeride değişir ve D. olur. İşte bu nedenle bu noktadan sonra ikinci program bu alanın değerini başka bir değer ile değiştirebilecektir.&lt;/p&gt;
&lt;p&gt;Gelelim RowUpdated olayına. Bu olay ise, Şekil 1'de g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, veritabanına olan g&amp;uuml;ncelleme işlemleri tamamıyla ger&amp;ccedil;ekleştirildikten sonra oluşur ve eklenen, silinen, yada g&amp;uuml;ncellenen her satır i&amp;ccedil;in tetiklenir. Bu olayın OleDbDataRowUpdatedEventArgs sınıfı t&amp;uuml;r&amp;uuml;nden bir parametresi vardır. Bu sınıfın &amp;ouml;zellikleri&amp;nbsp; OleDbDataRowUpdatingEventArgs sınıfının &amp;ouml;zellikleri ile aynıdır. Bununla birlikte kullanabileceğimiz ekstradan bir &amp;ouml;zelliği daha vardır. Bu &amp;ouml;zellik, RecordsAffected &amp;ouml;zelliğidir. Bu &amp;ouml;zellik ile, yapılan g&amp;uuml;ncelleştirmeler sonucu etkilenen satır sayısını elde edebiliriz. Dilerseniz, bu olayı kodumuza uygulayalım. &amp;Ouml;rneğin yaptığımız g&amp;uuml;ncelleştirmeler sonucu, bu g&amp;uuml;ncelleştirmelerden etkilenen satır sayısını elde etmeye &amp;ccedil;alışalım. &amp;Ouml;ncelikle OleDbDataAdapter nesnemize, bu olayımızı ekliyoruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;da.RowUpdated+=new OleDbRowUpdatedEventHandler(RowUpdatedOlayi);&lt;/pre&gt;
&lt;p&gt;Şimdide program kodlarımızı aşağıdaki gibi g&amp;uuml;ncelleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnGuncelle_Click(object sender, System.EventArgs e)
{
    listBox1.Items.Clear();
    OleDbCommandBuilder cb=new OleDbCommandBuilder(da); 
    da.Update(dt); 
    dt.AcceptChanges();

    listBox1.Items.Add("Girilen :"+girilen.ToString());
    listBox1.Items.Add("Silinen :"+silinen.ToString());
    listBox1.Items.Add("Guncellenen :"+guncellenen.ToString());
}

public int girilen=0,silinen=0,guncellenen=0;

private void RowUpdatedOlayi(object sender,OleDbRowUpdatedEventArgs arg)
{
    if(arg.StatementType==StatementType.Insert)
    {
        girilen+=arg.RecordsAffected;
    }
    else if (arg.StatementType==StatementType.Delete)
    {
        silinen+=arg.RecordsAffected;
    }
    else if (arg.StatementType==StatementType.Update)
    {
        guncellenen+=arg.RecordsAffected;
    } 
}&lt;/pre&gt;
&lt;p&gt;Burada yaptığımız son derece basit. RowUpdated olayı, veritabanına girilecek, g&amp;uuml;ncellenecek veya veritabanından silinecek her bir satır i&amp;ccedil;in tetiklendiğinden, bu olay yordamı i&amp;ccedil;inde, o anki satır i&amp;ccedil;in &amp;ccedil;alıştırılacak sql ifadesinin ne olduğunu temin ediyoruz. Bunun i&amp;ccedil;inde, OleDbRowUpdatedEventArgs parametresinin StatementType &amp;ouml;zelliğinin değerine bakıyoruz. Uygun değerlere g&amp;ouml;rede, public integer saya&amp;ccedil;larımızın değerlerini arttıyoruz. B&amp;ouml;ylece insert,update ve delete işlemlerinin ka&amp;ccedil; satıra uygulandığını tespit etmiş oluyoruz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk60_4.gif" alt="" width="471" height="400" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 6. G&amp;uuml;ncelleme sayılarının elde edilmesinin sonucu.&lt;/p&gt;
&lt;p&gt;Makalemizde son olarak FillError olayını ele almaya &amp;ccedil;alışacağım. Bu olay bahsettiğimiz gibi Fill metodu uygulandığında oluşabilecek hatalarda devreye girmektedir.FillError olayı FillErrorEventArgs sınıfı t&amp;uuml;r&amp;uuml;nden bir parametre alır. FillErrorEventArgs sınıfının, FillError olayı i&amp;ccedil;in kullanabileceğimiz &amp;ouml;zellikleri aşağıdaki tabloda yer almaktadır.&lt;/p&gt;
&lt;table id="table7" style="border-collapse: collapse; width: 100%;" border="1" cellpadding="5" bgcolor="#cccccc"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="190"&gt;&lt;strong&gt;FillErrorEventArgs &amp;Ouml;zelliği&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;A&amp;ccedil;ıklama&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="190"&gt;Continue&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;Fill metodu ile karşılaşıldığında bir hata oluşduğu takdirde Continue &amp;ouml;zelliği kullanılırsa, bu hatalar g&amp;ouml;rmezden gelinerek işleme devam edilir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="190"&gt;Values&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;Bir hata oluştuğunda bu hata ile ilgili alanların değerlerini belirtir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="190"&gt;DataTable&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;Hatanın oluştuğu DataTable nesnesine işaret eder.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="190"&gt;Errors&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;Meydana gelen hatayı exception t&amp;uuml;r&amp;uuml;nden belirtir.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Tablo 3. FillErrorEventArgs Sınıfının &amp;Ouml;zellikleri&lt;/p&gt;
&lt;p&gt;FillError olayının devreye girmesine &amp;ouml;rnek olarak, veri kaynağındaki veri tiplerinin, .net framework'tekiler ile aynı olmaması durumunu g&amp;ouml;sterebiliriz.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. İlerleyen makalelerimizde Ado.net'in temel kavramlarını incelemeye devam edeceğiz. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-03-18 12:00:00</pubDate>
  <slug>OleDbDataAdapter-Sc4b1nc4b1fc4b1-Olaylarc4b1-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>oledb</tag>
    <tag>oledbdataadapter</tag>
    <tag>dataadapter</tag>
    <tag>c#</tag>
    <tag>sql</tag>
    <tag>query</tag>
    <tag>aggregation</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>