<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Azure Üzerinde Redis Cache Kullanımı</title>
  <description>Bu yazımızda Azure üzerindeki minik maceralarımıza devam ediyoruz. Amacımız bir Redis Cache hizmetini devreye almak ve basit bir .Net Core istemcisinden yararlanarak kendisiyle konuşmak. Önce portaldan yararlanarak bir Redis Cache hizmetini devreye alacağız. Ardından StackExchange.Redis paketini kullanıp istemci tarafını geliştireceğiz. Redis'e ECHO komutu ile mesaj gönderecek ve kullanıcı tanımlı nesne örneklerini de nasıl kullanacağımız irdeleyeceğiz. Haydi gelin başlayalım.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/06/aredisc_02.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir s&amp;uuml;redir kişisel becerilerimizle alakalı olarak karşımıza &amp;ccedil;ıkan T-Shaped Person isimli bir konu var&lt;em&gt;(Aslında yıllardır var)&lt;/em&gt; Daha yakın zamanda katıldığım Scrum eğitiminde tekrardan karşıma &amp;ccedil;ıkan ve &lt;a href="https://medium.com/@jchyip/why-t-shaped-people-e8706198e437" target="_blank"&gt;hatta şuradaki yazıyla&lt;/a&gt;&amp;nbsp;kısaca bilgilenebileceğiniz, &amp;ouml;zetle bir alanda ger&amp;ccedil;ekten uzman ama bu alanla alakalı yan dallarda da bir şeyler yapabilen insan modelinden bahsediyorum.&lt;/p&gt;
&lt;p&gt;Tek kişi i&amp;ccedil;in d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde bile&amp;nbsp;&amp;ccedil;ok y&amp;ouml;nl&amp;uuml; bir birey&amp;nbsp;geliyor aklımıza ama &amp;ouml;zellikle&amp;nbsp;bir takımı bu tip insanlardan oluşturduğumuzda birbirlerinin a&amp;ccedil;ıklarını kapatabilen başarılı ekiplerin ortaya &amp;ccedil;ıktığını g&amp;ouml;r&amp;uuml;yoruz.&amp;nbsp;I-Shaped yerine T-Shaped olmak daha m&amp;uuml;him&amp;nbsp;bu nedenle. &amp;Ouml;zellike &amp;ccedil;evik ekiplerin başarısında &amp;ouml;nemli bir yere sahip.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;İşin aslı bir &amp;ccedil;ok şekil var hayatımıza girmiş olan. I, T-shaped dışında M-Shaped, Comb-Shaped, Pi-Shaped, E-Shaped diye gidiyorlar araştırabildiğim kadarıyla. &amp;Uuml;şenmeyin siz de araştırın. Bakın &lt;a href="https://peoplecentre.wordpress.com/2017/06/19/the-m-shaped-employee/" target="_blank"&gt;burada da eneteresan bir yazı&lt;/a&gt; var konu ile ilgili.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Ben T-Shaped birisi olmaya &amp;ccedil;alışıyorum ama olduk&amp;ccedil;a yavaş kaldığımı s&amp;ouml;yleyebilirim. Aslında kendi mesleğimle ilgilli pek &amp;ccedil;ok konuda epey geriden geliyorum. Belki de sadece &amp;ouml;ğrensem ve yazmak i&amp;ccedil;in uğraşmasam şimdilerde daha ileri bir noktada olabilir T-Shaped forma biraz daha uyabilirdim. Ancak işin doğrusu &amp;ouml;ğrendiklerimi paylaşmayı seviyorum. En azından deneyimlerimi, konu ile ilgili başıma gelenleri aktarma fırsatı bulduğumu d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum.&lt;/p&gt;
&lt;p&gt;Belki de bilmem ka&amp;ccedil; y&amp;uuml;z&amp;uuml;nce kez karşılaştığınız bir konu ile karşınızdayım bu sebeple :) &amp;Ouml;zellikle NoSQL d&amp;uuml;nyasını tanıyanların yakından bildiği Redis ve Microsoft Azure platformuna konuk olacağız bu yazımıda. Amacımız bir &lt;a href="https://redis.io/topics/introduction" target="_blank"&gt;Redis&lt;/a&gt; Cache hizmetini devreye almak ve basit bir .Net Core istemcisinden yararlanarak kendisiyle konuşmak. Redis, bellek tabanlı &amp;ccedil;alışan en pop&amp;uuml;ler veri deoplama sistemlerinden birisi. In-Memory Data Structure Store olarak ifade ediliyor hatta. String, Hash, List, Set, Sorted Set, Bitmap, HyporLogLog gibi &amp;ccedil;eşitli veri t&amp;uuml;rlerinin tutulmasına olanak sağlıyor. Ağrılıklı olarak uygulamaların performans kazanımı gerektiren vakalarında değerlendiriliyor. Bu, &amp;ouml;zellikle back-end tarafı i&amp;ccedil;in &amp;ouml;nemli. Veriyi bellek &amp;uuml;zerinden yapısal olarak anlamlı şekilde tutmak ve hatta dağıtılabilir olarak sunmak b&amp;uuml;y&amp;uuml;k &amp;ouml;l&amp;ccedil;ekte istenen bir kabiliyet.&lt;/p&gt;
&lt;p&gt;Bu a&amp;ccedil;ılardan d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde bulut bilişim hizmetlerinin de olmazsa olmaz kalemlerinden birisi olarak karşımıza &amp;ccedil;ıkıyor. &amp;Ouml;yle ki, bulut &amp;uuml;zerine aldığımız uygulamaların veriye hızlı erişmesi gerektiği durumlarda ciddi anlamda kullanılıyor. Sık sık ihtiya&amp;ccedil; duyulan, s&amp;uuml;rekli olarak değişime uğramayan verilerin fiziki diskten &amp;ccedil;ekilmesi yerine bellekten alınması elbette performans a&amp;ccedil;ısından daha iyi. Lakin bunu dağıtık sistemler, &amp;ouml;l&amp;ccedil;eklenebilirlik, veri &amp;ccedil;eşitliliği gibi noktalardan d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde Redis gibi &amp;ccedil;&amp;ouml;zl&amp;uuml;mlere y&amp;ouml;nelmemiz gerekiyor.&lt;/p&gt;
&lt;p&gt;Artık kurulumundan, duruma g&amp;ouml;re &amp;ouml;l&amp;ccedil;eklendirme planlarının oluşturulmasına kadar pek &amp;ccedil;ok y&amp;ouml;netsel işlevin bulut sistemleri tarafından sağlanıyor olduğunu da g&amp;ouml;r&amp;uuml;yoruz. Microsoft Azure platformu bu anlamda bizlere &amp;ouml;nemli bir imkan sunuyor. Azure &amp;uuml;zerindeki Redis Cache hizmetini kullanarak bu tip bir tesisatı oluşturmak son derece kolay. Nasıl mı? Haydi gelin bir "Nasıl Yapılır?" macerasına daha başlayalım.&lt;/p&gt;
&lt;h1&gt;Redis Cache Kaynağını Oluşturmak&lt;/h1&gt;
&lt;p&gt;İşe azure portal &amp;uuml;zerinden redis cache araması yaparak başlayabiliriz(&lt;em&gt;Bu aşamada Microsoft Azure aboneliğinizin olduğunu varsayıyorum)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/06/aredisc_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Redis Cache &amp;ouml;ğesini bulduktan sonra tek yapmamız gereken yeni bir tane oluşturmak. Diğer pek &amp;ccedil;ok hizmette olduğu gibi isim, kaynak grubu, lokasyon ve benzeri bilgileri girmemiz gerekiyor. Ben&amp;nbsp;DNS adı olarak Gondor'u kullandım ve "Kullandık&amp;ccedil;a &amp;Ouml;de" tipindeki aboneliği se&amp;ccedil;tim. Bu vakaya &amp;ouml;zel olmasını istediğim i&amp;ccedil;in gondor-redis-rg isimli yeni bir Resource Group belirttim. Lokasyon olarak da West Europe tarafındaki sunucu merkezini işaret ettim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/06/aredisc_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Burada da bir fiyatlandırma s&amp;ouml;z konusu elbette :) &amp;Uuml;cretsiz bir kullanımını bulamadım ancak geliştirme amacıyla C0 Basic isimli modeli değerlendirmemiz m&amp;uuml;mk&amp;uuml;n. Tabii başka modellerde var. "View Full Pricing Details" bağlantısına basarsak diğer se&amp;ccedil;enekleri g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/06/aredisc_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İhtiyaca y&amp;ouml;nelik olarak doğru modeli se&amp;ccedil;erek ilerlemek &amp;ouml;nemli. Gerekli bilgiler sonrası oluşturma işlemi başlatılabilir. Redis Cache bir ka&amp;ccedil; dakika i&amp;ccedil;inde kullanıma hazır hale gelecektir. Başlangı&amp;ccedil; i&amp;ccedil;in tek Node'dan oluşan 250 MB kapasiteli, SSL desteği veren ve 256 bağlantıya kadar &amp;ccedil;ıkabileceğimiz bir Redis Cache hizmeti s&amp;ouml;z konusu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/06/aredisc_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Burası bir veri kaynağı olduğu i&amp;ccedil;in doğal olarak Connection String bilgisine de ihtiyacımız var. Show Access Keys kısmından bu bilgilere ulaşabiliriz.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/06/aredisc_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Primary Connection string i&amp;ccedil;erisindeki bilgi .Net Core tarafnda StackExchange.Redis paketi i&amp;ccedil;in ele alınabilir formattadır.&lt;/p&gt;
&lt;h1&gt;İstemci Uygulamanın Geliştirilmesi&lt;/h1&gt;
&lt;p&gt;Aslında portal tarafındaki hazırlıklarımız tamamlanmış durumda. Şimdi basit bir istemci geliştirerek Redis Cache ile konuşmaya &amp;ccedil;alışalım. Her zaman ki gibi bir Console uygulaması &amp;uuml;zerinden ilerleyeceğiz. &amp;Ouml;ncesinde terminal &amp;uuml;zerinden yapmamız gereken bir ka&amp;ccedil; hazırlık var. Console projesinin oluşturulması, Redis ile konuşmamızı sağlayacak StackExchange.Redis ve JSON serileştirme işlemlerini kolaylaştıracak Newtonsoft.json paketlerinin eklenmesi. Bunun i&amp;ccedil;in terminalden aşağıdaki komutları işletebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new -o console TalkWithGondor
dotnet add package StackExchange.Redis
dotnet add package Newtonsoft.json
dotnet restore&lt;/pre&gt;
&lt;p&gt;TalkWithGondor isimli bir Console uygulaması oluşturduk. Kodlara gelince,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using Newtonsoft.Json;
using StackExchange.Redis;

namespace TalkWithGondor
{
    class Program
    {
        static void Main(string[] args)
        {
            string conStr = "gondor.redis.cache.windows.net,password=YWG04toTMb45VUTv7hcIcjbIQymuL7IaRp2Z7/5cNNU=,ssl=True,abortConnect=False";
            var connection = ConnectionMultiplexer.Connect(conStr);
            var db = connection.GetDatabase();
            var pingResponse = db.Execute("ECHO","Nabersin?");
            Console.WriteLine(pingResponse);

            db.StringSet("Motto", "Yağmurlu bir Nisan akşamıydı...");
            var mottoValue = db.StringGet("Motto");
            Console.WriteLine(mottoValue);

            Product box = new Product
            {
                Id = 10001,
                Title = "Lego head box",
                UnitPrice = 50
            };
            db.StringSet("LegoBox", JsonConvert.SerializeObject(box));
            Product productFromCache = JsonConvert.DeserializeObject&amp;lt;Product&amp;gt;(db.StringGet("LegoBox"));
            Console.WriteLine($"\t{productFromCache.Id}\t{productFromCache.Title}\t{productFromCache.UnitPrice}");
        }
    }

    class Product
    {
        public int Id { get; set; }
        public string Title { get; set; }
        public double UnitPrice { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Neler yaptık kısaca inceleyelim. Redis ile kolayca haberleşebilmek i&amp;ccedil;in StackExchange.Redis isim alanındaki tiplerden yararlanıyoruz. ConnectionMultiplexer sınıfını kullanarak bir bağlantı a&amp;ccedil;ıyoruz. Connect metoduna parametre olarak Azure portalından aldığımız bağlantı bilgisini koyduğumuza dikkat edelim. Sonrasında GetDatabase metodu ile db isimli bir değişken &amp;ouml;rneklenmekte. Bu değişken &amp;uuml;zerinden &amp;ccedil;eşitli Execute denemeleri icra etmekteyiz. Redis'in klasik PING ve ECHO gibi selamlaşma fonksiyonları var. İlk Execute işleminde ECHO komutunu kullanarak bir mesaj g&amp;ouml;nderiyoruz. Redis g&amp;ouml;nderdiğimiz mesajı bize aynen geri yollamalı. Bir nevi bağlantımızı test ettiğimizi ifade edebiliriz.&lt;/p&gt;
&lt;p&gt;İzleyen satırda StringSet ve StringGet kullanımlarına ait &amp;ouml;rnekler var. StringSet ile tahmin edeceğiniz &amp;uuml;zere Redis &amp;uuml;zerinde bir key:value &amp;ccedil;ifti oluşturulmasını sağlıyoruz. Veri tipi metinsel i&amp;ccedil;erikten oluşmakta. StringGet ile de Motto anahtar adıyla yolladığımız i&amp;ccedil;eriğin değerini getiriyoruz. Kodun son kısmında ise işimize daha &amp;ccedil;ok yarayacak bir &amp;ouml;rnek yer alıyor.&amp;nbsp;Bir sınıfa ait nesne &amp;ouml;rneğini Redis &amp;uuml;zerinde nasıl tutabileceğimizi g&amp;ouml;r&amp;uuml;yoruz.&lt;/p&gt;
&lt;p&gt;Aslında anahtar nokta i&amp;ccedil;eriği JSON formatında saklamaktan ibaret. Sonu&amp;ccedil;ta hangi platform olursa olsun JSON genel bir veri formatı standardı sunuyor. &amp;Ouml;rnekte yer alan Product nesne &amp;ouml;rneğinin verisini de bu şekilde tutmamız m&amp;uuml;mk&amp;uuml;n. Tabii serileştirme ve ters serileştirme noktasında JsonConvert sınıfının SerializeObject ve DeserializeObject metodlarından yararlanmaktayız. Kodlarımız g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere son derece basit. Zaten basit olması da gerekiyor. Neden işleri karmaşıklaştıralım ki?&lt;em&gt;(Yazar burada OverEngineering'cilere atıfta bulunuyor :P )&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Uygulamayı &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer sonu&amp;ccedil;lar almamız lazım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/06/aredisc_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ECHO ile g&amp;ouml;nderdiğimiz mesaj bize aynen geri g&amp;ouml;nderildi. Ayrıca Motto mesajının da başarılı bir şekilde aktarıldığını g&amp;ouml;rmekteyiz. Benzer durum LegoBox anahtar değeri ile tutulan Product nesne &amp;ouml;rneği i&amp;ccedil;in de ge&amp;ccedil;erli. Neredeyse her t&amp;uuml;rden veriyi Redis Cache &amp;uuml;zerine almamız m&amp;uuml;mk&amp;uuml;n.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alışmalar devam ettik&amp;ccedil;e Redis Cache &amp;uuml;zerindeki harketlilikler de artacaktır. Portal &amp;uuml;zerindeki Monitoring sekmesini kullanarak &amp;ccedil;eşitli metrikleri inceleyebiliriz&lt;em&gt;(Tahminimce Amazon Web Services'ler de olduğu gibi belli eşik değerlerine ulaşıldığında devreye girecek alarm mekanizmaları da kurulabiliyordur. Araştırmam lazım)&lt;/em&gt; Ben yaptığımız ilk bir ka&amp;ccedil; deneme sonrası aşağıdaki sonu&amp;ccedil;larla karşılaştım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/06/aredisc_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bağlantı sayıları, get ve set operasyon &amp;ccedil;ağrıları, cache nesnelerinin durumları vs. Diğer kaynaklarda olduğu gibi olduk&amp;ccedil;a geniş bir &amp;ouml;l&amp;ccedil;&amp;uuml;mleme seti var. Biraz kurcalamak lazım. Bu adımları başarılı bir şekilde tamamladıysanız ve Redis Cache ile ilgili başka bir şey yapmayacaksanız size tavsiyem ilgili kaynak grubunu silmeniz olacaktır. Neme lazım arka planda unutulup da ilerleyen zamanlarda fiyatlandırma konusunda bize problem &amp;ccedil;ıkartmasın değil mi?&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/06/aredisc_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu yazımızda Azure tarafından sunulan Redis Cache hizmetini nasıl kullanabileceğimize dair basit bir &amp;ouml;rnek yapmaya &amp;ccedil;alıştık. İstemci tarafında sadece .Net Core değil, Python, Node.Js, Java gibi diğer platformları da kullanabiliriz. Detaylı bilgi ve diğer &amp;ouml;ğretiler i&amp;ccedil;in &lt;a href="https://docs.microsoft.com/en-us/azure/redis-cache/cache-overview" target="_blank"&gt;Microsoft'un resmi dok&amp;uuml;manlarına&lt;/a&gt; bir bakmanızı &amp;ouml;neririm. İşi daha da ileri g&amp;ouml;t&amp;uuml;rmek i&amp;ccedil;in istemci uygulamanızı da Azure &amp;uuml;zerinde host etmeyi deneyibilirsiniz. Pekala bu bir Web uygulaması ya da Web API hizmeti olabilir. Bu uygulamayı App Service olarak host edip Redis Cache'den yararlanmaya &amp;ccedil;alışabilirsiniz. Hatta dağıtık bir &amp;ouml;nbellekleme stratejisinin mimari seviyede nasıl ele alınması gerektiğine dair &lt;a href="https://docs.microsoft.com/en-us/azure/architecture/best-practices/caching?toc=%2Fazure%2Fredis-cache%2Ftoc.json" target="_blank"&gt;şu adresteki pratiğe&lt;/a&gt; de bakabilirsiniz. Daha ger&amp;ccedil;ek&amp;ccedil;i bir vaka &amp;ccedil;alışması olacağı kesin. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2018-09-01 07:02:00</pubDate>
  <slug>Azure-Uzerinde-Redis-Cache-Kullanımı</slug>
  <tags>
    <tag>azure</tag>
    <tag>redis</tag>
    <tag>redis-cache</tag>
    <tag>net-core</tag>
    <tag>cloud-computing</tag>
    <tag>nosql</tag>
    <tag>json</tag>
    <tag>memory-based-databases</tag>
    <tag>database</tag>
    <tag>connection-string-convention</tag>
    <tag>stack-exchange-redis</tag>
    <tag>newtonsoft</tag>
    <tag>monitoring-cancellation</tag>
    <tag>resource-group</tag>
    <tag>azure-portal</tag>
    <tag>dotnet</tag>
    <tag>console-application</tag>
    <tag>hello-world</tag>
  </tags>
  <categories>
    <category>Azure</category>
  </categories>
</post>