<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Screencast - WCF Data Services - Projections</title>
  <description />
  <content>&lt;p&gt;&lt;img style="float: left;" src="http://www.buraksenyurt.com/pics/2010%2f3%2fblg161_Giris.gif" alt="" width="250" height="187" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Yazılımcı bile olsak bu arada sırada spor yapmadığımız anlamına gelmemeli. Bende &amp;ccedil;alışma arkadaşlarım ile sık sık spor aktivitelerinde bulunuyorum. Zaman zaman parke zeminde o muhteşem NBA yıldızları gibi giyinerek basketbol oynuyor, zaman zaman Ping Pong...Ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde ise bir halı saha ma&amp;ccedil;ı organizasyonundaydım. Bu organizasyonun bitmesinden hemen sonra duşumu aldım, g&amp;uuml;nl&amp;uuml;k kıyafetlerimi giydim ve akşamın sekizinde bilin bakalım nereye gittim...Şirkete &lt;img title="Laughing" src="http://www.buraksenyurt.com/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" border="0" alt="Laughing" /&gt; Deli mi bu adam...Eve gitse ya...Amacı ne? Nitekim ma&amp;ccedil; sırasında s&amp;uuml;rekli aklımda olan ve beni d&amp;uuml;rten bir mesele vardı. Uzun zamandır &amp;ccedil;ekmek istediğim bir g&amp;ouml;rsel ders i&amp;ccedil;in şu saatlerde sessiz olan şirket en ideal mekandı.&lt;/p&gt;
&lt;p&gt;&lt;a title="NedirTv?" href="http://www.nedirtv.com/" target="_blank"&gt;NedirTv?&lt;/a&gt; aracılığıyla hazırladığımız bu g&amp;ouml;rsel dersimizde,&lt;strong&gt; WCF Eco System&lt;/strong&gt;' in bir par&amp;ccedil;ası olan &lt;strong&gt;WCF Data Service&lt;/strong&gt;' lerinde &lt;strong&gt;Projections &lt;/strong&gt;sorgularının nasıl kullanılabileceğini incelemeye &amp;ccedil;alışıyoruz. Aslında kod adı &lt;strong&gt;Astoria &lt;/strong&gt;olan &lt;strong&gt;Ado.Net Data Service&lt;/strong&gt;' lerin &lt;strong&gt;1.5 CTP2 &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml;nde de duyurulan bu yetenek, zaten &lt;strong&gt;.Net Framework 4.0 &lt;/strong&gt;i&amp;ccedil;erisine g&amp;ouml;m&amp;uuml;l&amp;uuml; olarak gelen&lt;strong&gt; WCF Data Service&lt;/strong&gt;' ler i&amp;ccedil;in standartlaştırılmış bir &amp;ouml;zellik. Bu ama&amp;ccedil;la hazırladığımız ve &lt;strong&gt;7,5 &lt;/strong&gt;dakikayı aşmayan g&amp;ouml;rsel dersimizin faydalı olacağını &amp;uuml;mit ediyorum. İyi seyirler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Dosya Boyutu :&lt;/strong&gt; 14.3 Mb&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;S&amp;uuml;re :&lt;/strong&gt; 7:35&lt;/p&gt;
&lt;p&gt;&lt;a title="WCF Data Services - Projections" href="http://www.nedirtv.com/video/WCF-Data-Services---Projections.aspx" target="_blank"&gt;İzlemek veya Download Etmek i&amp;ccedil;in&lt;/a&gt;&amp;nbsp;&lt;/p&gt;</content>
  <pubDate>2010-03-08 02:10:00</pubDate>
  <slug>Screencast-WCF-Data-Services-Projections</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-data-services</tag>
    <tag>adonet-data-services</tag>
    <tag>screencast</tag>
  </tags>
  <categories>
    <category>WCF Eco System</category>
    <category>WCF Data Services</category>
  </categories>
</post>