<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Merhaba Bing API 2.0</title>
  <description>Bir süredir WCF 4.0 ile birlikte gelen yenilikleri sizlere aktarmaya çalışıyorum. Son olarak Routing Service ile ilişkili bir giriş yazımız olmuştu. Bu konu ile ilişkili örnek en kısa sürede sizlerle olacak. Ne varki konu biraz zorlu. Undecided Bu yüzden bende yüksek lisans eğitimi aldığım yıllarda çok sevgili hocam Halil Seyidoğlu' nun bir açıklamasını uygulamaya karar verdim. Kendisi bize "Bilimsel Araştırma ve Yazma" dersinde şöyle seslenmişt; "Bir tez konusunu araştırırken çok zorlu yollardan geçersiniz. Tezin bir noktasında tıkandınız mı? O zaman ara verin...Tatile çıkın...Bir süreliğine uzaklaşın..."</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f8%2fblg72_Giris.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir s&amp;uuml;redir &lt;strong&gt;WCF 4.0&lt;/strong&gt; ile birlikte gelen yenilikleri sizlere aktarmaya &amp;ccedil;alışıyorum. Son olarak &lt;strong&gt;Routing Service&lt;/strong&gt; ile ilişkili bir giriş yazımız olmuştu. Bu konu ile ilişkili &amp;ouml;rnek en kısa s&amp;uuml;rede sizlerle olacak. Ne varki konu biraz zorlu. &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;Bu y&amp;uuml;zden bende y&amp;uuml;ksek lisans eğitimi aldığım yıllarda &amp;ccedil;ok sevgili hocam &lt;strong&gt;Halil Seyidoğlu'&lt;/strong&gt; nun bir a&amp;ccedil;ıklamasını uygulamaya karar verdim.&lt;/p&gt;
&lt;p&gt;Kendisi bize &lt;strong&gt;"Bilimsel Araştırma ve Yazma"&lt;/strong&gt; dersinde ş&amp;ouml;yle seslenmişt; &lt;strong&gt;"Bir tez konusunu araştırırken &amp;ccedil;ok zorlu yollardan ge&amp;ccedil;ersiniz. Tezin bir noktasında tıkandınız mı? O zaman ara verin...Tatile &amp;ccedil;ıkın...Bir s&amp;uuml;reliğine uzaklaşın..."&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Her ne kadar &lt;strong&gt;WCF 4.0&lt;/strong&gt; ile gelen yenilikleri araştırmak bir tez hazırlamak kadar zorlu ve &amp;ccedil;etin olmasada sıkıldığım noktada hemen bir ka&amp;ccedil;ış aradım ve bakım ne buldum.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Bing API 2.0&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Microsoft'&lt;/strong&gt; un arama motoru &lt;strong&gt;Bing'&lt;/strong&gt; i duymayan olmamıştır sanırım. Peki &lt;strong&gt;Bing'&lt;/strong&gt; in kendi uygulamalarımızda kullanılabilmesi i&amp;ccedil;in dışarıya bir &lt;strong&gt;API&lt;/strong&gt; sunduğunu biliyor muydunuz? Ta ta ta taaaa...&lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&amp;nbsp;İşin i&amp;ccedil;erisinde bir developer API'si, helede servis bazlı bir sunum olunca, değmeyin keyfime dedim ve yola koyuldum. Dolayısıyla bu yazımda sizlere Bing API' si ile ilişkili ilk izlenimlerimi ve &amp;ccedil;ıkarımlarımı aktarmaya &amp;ccedil;alışacağım.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Bing API'&lt;/strong&gt; si, kendi web sitesinden sunduğu arama &amp;ouml;zelliklerinin tamamını, farklı iletişim protokollerine g&amp;ouml;re istemci tarafına servis bazlı olarak sunmaktadır. Buna g&amp;ouml;re dilersek &lt;strong&gt;Bing&lt;/strong&gt; &amp;uuml;zerinden ger&amp;ccedil;ekleştirilen arama kabiliyetlerini ve sonu&amp;ccedil;larını, kendi uygulamalarımıza entegre ederek kullanabiliriz. &lt;strong&gt;Bing&lt;/strong&gt; hizmetinden yararlanabilmek i&amp;ccedil;in &amp;ouml;ncelikli olarak &lt;a href="http://www.bing.com/developers/"&gt;http://www.bing.com/developers/&lt;/a&gt;&amp;nbsp;adresindeki formu doldurmamız ve yeni bir &lt;strong&gt;App Id&lt;/strong&gt; almamız gerekmektedir. Nitekim Live servisi ile olan haberleşmede &lt;strong&gt;App Id&lt;/strong&gt; değerinden yararlanılmaktadır. Teori olduk&amp;ccedil;a basittir. Arama kutucuğundan yapılan kabliyetleri, kendi uygulamamızdan bir şekilde request olarak g&amp;ouml;ndermemiz gerekmektedir. Bu noktada aslında, &lt;strong&gt;Bing API&lt;/strong&gt; ile neler yapabileceğimiz kararının nasıl verildiğine bakmamızda yarar vardır. S&amp;ouml;z konusu karar verilirken aslında aramanın tipini/modelinide belirlemiş oluruz. Yada var olan aramayı genişletmiş oluruz. İşte burada a bahsedilen arama&amp;nbsp;modelleri belirlenirken&amp;nbsp;&lt;strong&gt;SourceTypes&lt;/strong&gt; isimli tip değerlerinden yararlanılmaktadır. &lt;strong&gt;SourceTypes'&lt;/strong&gt; ın değerleri &lt;strong&gt;managed code&lt;/strong&gt; tarafında verilebileceği gibi, &amp;ouml;rneğin&amp;nbsp;&lt;strong&gt;HTTP Get&lt;/strong&gt; metoduna bağlı olarak &lt;strong&gt;URL&lt;/strong&gt; formatında da yazılabilir. Genel &lt;strong&gt;SourceTypes&lt;/strong&gt; değerleri ve uygulayabileceğimiz arama modelleri aşağıdaki gibidir;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Web sayfaları,&lt;/li&gt;
&lt;li&gt;Resimler(Image),&lt;/li&gt;
&lt;li&gt;Videolar(Video),&lt;/li&gt;
&lt;li&gt;Dil &amp;ccedil;evirileri,&lt;/li&gt;
&lt;li&gt;Lokasyonlar,&lt;/li&gt;
&lt;li&gt;Uygulamanız ile alakalı reklamlar. G&amp;uuml;ncel SDK d&amp;ouml;k&amp;uuml;manına g&amp;ouml;re sadece US sınırlarında ge&amp;ccedil;erli.(Ads),&lt;/li&gt;
&lt;li&gt;MSN Encarta Online Encyclopedia' den anlık cevaplar. &amp;Ouml;rneğin What is 100*37? sonucunun bulunması(Instant Answer),&lt;/li&gt;
&lt;li&gt;XHTML veya WML formatında Mobile cihazlar i&amp;ccedil;in daha az yer harcayan sonu&amp;ccedil;lar(MobileWeb),&lt;/li&gt;
&lt;li&gt;G&amp;uuml;ncel arama ile ilişkili olan aramalar(Related Search),&lt;/li&gt;
&lt;li&gt;Haber i&amp;ccedil;eriklerinin aranabilmesi(News),&lt;/li&gt;
&lt;li&gt;Hava durumu ile ilişkili aramalar(Weather)&lt;/li&gt;
&lt;li&gt;vb...&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;G&amp;uuml;zel. Şimdi kafamızda bir şeyler şekillenmeye başladı. En azından arama modelini nasıl se&amp;ccedil;ebileceğimizi anladık. Peki talepler nasıl iletilecekler? &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;İstemciler taleplerini &lt;strong&gt;Bing API&lt;/strong&gt; servisine 3 farklı formatta iletebilirler.&lt;/p&gt;
&lt;table style="width: 100%;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="width: 10%;" valign="top"&gt;&lt;strong&gt;Format&lt;/strong&gt;&lt;/td&gt;
&lt;td style="width: 40%;" valign="top"&gt;&lt;strong&gt;&amp;Ouml;zet&lt;/strong&gt;&lt;/td&gt;
&lt;td style="width: 50%;" valign="top"&gt;&lt;strong&gt;URL&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;strong&gt;JavaScript Object Notation(JSON)&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top"&gt;&lt;strong&gt;Ajax&lt;/strong&gt; tabanlı uygulamalarda kullanılması tercih edilen bu tipe g&amp;ouml;re istemciye&lt;strong&gt; Raw, Callback&lt;/strong&gt; ve &lt;strong&gt;Function&lt;/strong&gt; formatlarında cevap d&amp;ouml;ner.&lt;/td&gt;
&lt;td valign="top"&gt;&lt;strong&gt;http://api.search.live.net/json.aspx?AppId=&lt;/strong&gt;&lt;em&gt;YOUR_APPID&lt;/em&gt;&lt;strong&gt;&amp;amp;Market=en-US&amp;amp;Query=testing&amp;amp;Sources=web+spell&amp;amp;Web.Count=&lt;/strong&gt;&lt;strong&gt;1&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;strong&gt;eXtended Markup Language(XML) &lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top"&gt;&lt;strong&gt;SOAP&lt;/strong&gt; formatını &lt;span style="text-decoration: underline;"&gt;desteklemeyen&lt;/span&gt; veya &lt;strong&gt;Siverlight&lt;/strong&gt; gibi uygulamalarda tercih edilir. İstemcinin talepleri&lt;strong&gt; HTTP Get&lt;/strong&gt; metoduna g&amp;ouml;re gideceğinden URL sınırı en b&amp;uuml;y&amp;uuml;k handikapı olarak g&amp;ouml;r&amp;uuml;lebilir.&lt;/td&gt;
&lt;td valign="top"&gt;&lt;strong&gt;http://api.search.live.net/xml.aspx?AppId=&lt;/strong&gt;&lt;em&gt;YOUR_APPID&lt;/em&gt;&lt;strong&gt;&amp;amp;Market=en-US&amp;amp;Query=testing&amp;amp;Sources=web+spell&amp;amp;Web.Count=&lt;/strong&gt;&lt;strong&gt;1&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;strong&gt;Simple Object Access Protocol(SOAP)&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top"&gt;&lt;strong&gt;XML&lt;/strong&gt; modelindeki gibi URL sınır kısıtı yoktur. Ayrıca &lt;strong&gt;karmaşık tiplerin(Complex Type)&lt;/strong&gt;&amp;nbsp;ifade edilebilmesi, &lt;strong&gt;request/response&lt;/strong&gt; nesne modelinin sağlanması gibi avantajları vardır. &amp;Ouml;zellikle masa&amp;uuml;st&amp;uuml; uygulamalar(Desktop Applications) veya servis bazlı uygulamalar i&amp;ccedil;in idealdir. C# gibi y&amp;uuml;ksek seviyeli dillerle kullanımı son derece kolaydır.&lt;/td&gt;
&lt;td valign="top"&gt;&lt;strong&gt;http://api.search.live.net/search.wsdl?AppID=&lt;/strong&gt;&lt;em&gt;YourAppId (Web Service Referansını ekleme adresidir)&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, Bing API' si i&amp;ccedil;in değerlendirilecek istemci talepleri, &lt;strong&gt;Json formatında,&lt;/strong&gt; &lt;strong&gt;HTTP Get metodunda&lt;/strong&gt; g&amp;ouml;nderilebilmektedir. Ama burada altı &amp;ccedil;izilmesi gereken ve benimde en &amp;ccedil;ok ilgimi &amp;ccedil;eken &lt;strong&gt;SOAP&lt;/strong&gt; modelidir. &amp;Ouml;yleki, bu modelin uygulanması i&amp;ccedil;in istemci tarafının bir&lt;strong&gt; XML Web Service&lt;/strong&gt; referansını kullanması yeterlidir. Bu, istemci tarafında managed bir kodun uygulanabilmesi anlamına gelmektedir. Asenkron &amp;ccedil;ağrılar ger&amp;ccedil;ekleştirebilir, strong tipler kullanabilir, hatta sonu&amp;ccedil; k&amp;uuml;meleri &amp;uuml;zerinde LINQ sorguları dahi yapılabilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bir zamanlar .Net &amp;uuml;zerine eğitmenlik yapardım. İlk yıllarımda .Net 1.0 vardı ve Xml Web Service konusunda ger&amp;ccedil;ek hayat &amp;ouml;rnekleri bulmakta zorlanırdık. Genellikle kendi servislerimizi yazar, &amp;ccedil;ağırır ve ele alırdık. Yada pop&amp;uuml;ler hava durumu servisi &amp;ouml;rneği.&amp;nbsp;Ama ger&amp;ccedil;ek hayat senaryolarında, &amp;ccedil;ok basit olan ve bizim tarafımızdan yazılmamış bir Web Servisi nasıl değer kazanabilir,artık pek &amp;ccedil;ok &amp;ouml;rneği ile g&amp;ouml;rebilmekteyiz. İşte k&amp;uuml;&amp;ccedil;&amp;uuml;k bir &amp;ouml;rnek, Bing API tarafından kullanılan Live servisi...&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;Ouml;yleyse hi&amp;ccedil; vakit kaybetmeden &lt;strong&gt;acele acele&lt;/strong&gt; bir &amp;ouml;rnek yapalım. &lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt;&amp;nbsp;Bu acele &amp;ouml;rneğimizde basit bir &lt;strong&gt;Windows&lt;/strong&gt; uygulamasına, aradığımız kritere uyan &lt;strong&gt;20&lt;/strong&gt; resmi &amp;ccedil;ekmeye &amp;ccedil;alışacağız. Bir başka deyişle &lt;strong&gt;SourceTypes.Image&lt;/strong&gt; tipinden bir arama ger&amp;ccedil;ekleştireceğiz.&amp;nbsp;Yapmamız gereken ilk şey, &lt;strong&gt;Live Search&lt;/strong&gt; servisine ait &lt;strong&gt;Xml Web Service&lt;/strong&gt; referansını uygulamamıza eklemek olmalıdır. Aşağıdaki g&amp;ouml;r&amp;uuml;nt&amp;uuml;de olduğu gibi. Dilerseniz benim yaptığım gibi &lt;strong&gt;Web reference name&lt;/strong&gt; alanının değerini aynen bırakabilirsiniz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg72_AddWebReference.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;Kişisel Not :&lt;/strong&gt; Referans eklemesinden sonra &lt;strong&gt;Class Diagram&lt;/strong&gt; g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne bakmanızı &amp;ouml;neririm &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Uygulamamızın Form tasarımını aşağıdaki gibi d&amp;uuml;zenleyebiliriz. Ben arama kutucuğunun sonucu olarak gelecek resim bilgilerini, alt tarafta yer alan &lt;strong&gt;FlowLayoutPanel&lt;/strong&gt; bileşeni i&amp;ccedil;erisinde &lt;strong&gt;PictureBox&lt;/strong&gt; kontrolleri ile ifade etmeyi tercih ettim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg72_FormDesign.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;PictureBox&lt;/strong&gt; kontrol&amp;uuml;m&amp;uuml;zde, resmin arama sonu&amp;ccedil;larından gelen t&amp;uuml;m bilgilerinide saklamak istediğimden, aşağıdaki kod par&amp;ccedil;asında g&amp;ouml;r&amp;uuml;len &lt;strong&gt;ThumbImage&lt;/strong&gt; isimli bir bileşen kullanmayı uygun g&amp;ouml;rd&amp;uuml;m.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Windows.Forms;
using WinClient.net.live.search.api;

namespace WinClient
{
    class ThumbImage
        :PictureBox
    {
        public ImageResult Result { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;ImageResult&lt;/strong&gt; tipinden bir &amp;ouml;zellik yer almaktadır. Bu &lt;strong&gt;&amp;ouml;zellik(Property)&lt;/strong&gt;, arama sonucu servisden gelen sonu&amp;ccedil; k&amp;uuml;mesinde yer alan resim bilgilerini taşıyan tiptir. Kendi i&amp;ccedil;erisinde, resmin &lt;strong&gt;Thumbnail Url, Media Url, Title, Width, Height&lt;/strong&gt; vb... bilgilerini taşımaktadır. Biz bu bilgilerden faydalanıyor olacağız. Peki ama nasıl? İşte Form sınıfımızın t&amp;uuml;m kod i&amp;ccedil;eriği;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Windows.Forms;
// Varsayılan olarak SOAP tabanlı Live servisinin eklenmesi ile gelen namespace
using WinClient.net.live.search.api;

namespace WinClient
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }

        private void btnSearch_Click(object sender, EventArgs e)
        {
            pnlImages.Controls.Clear();

            if (!String.IsNullOrEmpty(txtSearch.Text))
            {
                using (LiveSearchService searchService = new LiveSearchService())
                {
                    #region Arama talebi oluşturulur

                    SearchRequest request = new SearchRequest
                    {
                        AppId = "{Size verilen AppId değeri}",
                        Query = txtSearch.Text,
                        Sources = new SourceType[] { SourceType.Image },
                        Adult = AdultOption.Strict,
                        AdultSpecified = true,
                        Image = new ImageRequest { Count = 20, CountSpecified = true, Offset = 0, OffsetSpecified = true }
                    };

                    #endregion

                    #region Arama sonucunun değerlendirilmesi

                    SearchResponse response = searchService.Search(request);

                    if (response.Image!=null &amp;amp;&amp;amp;
                        response.Image.Results.Length &amp;gt; 0)
                    {
                        foreach (ImageResult imgResult in response.Image.Results)
                        {
                            ThumbImage img = new ThumbImage
                            {
                                Result = imgResult,
                                ImageLocation = imgResult.Thumbnail.Url
                            };

                            img.Click += delegate(object obj, EventArgs args)
                            {
                                Form frm = new Form()
                                {
                                    ControlBox=true
                                    , MaximizeBox=false
                                    ,MinimizeBox=false
                                    , Text=String.Format("{0} X {1} / {2} / {3} bytes",img.Result.Width,img.Result.Height,img.Result.Title,img.Result.FileSize)
                                };
                                PictureBox pb = new PictureBox { 
                                    ImageLocation =img.Result.MediaUrl
                                    ,Dock= DockStyle.Fill
                                };
                                
                                frm.Controls.Add(pb);
                                frm.Show();
                            };

                            pnlImages.Controls.Add(img);
                        }
                    }
                    else
                    {
                        MessageBox.Show("Herhangibir sonu&amp;ccedil; bulunamadı", "Sonu&amp;ccedil;", MessageBoxButtons.OK, MessageBoxIcon.Information);
                    }
                    #endregion
                }
            }
            else
            {
                MessageBox.Show("L&amp;uuml;tfen aradığınız resim ile ilişkili bir bilgi giriniz","Sonu&amp;ccedil;", MessageBoxButtons.OK, MessageBoxIcon.Information);
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;LiveSearchService&lt;/strong&gt; nesnesi &amp;ouml;rneklenir. Bu &amp;ouml;rnek tahmin edileceği &amp;uuml;zere &lt;strong&gt;Search&lt;/strong&gt; operasyonunu yerine getirecek olan &lt;strong&gt;proxy&lt;/strong&gt; tipimizdir. Diğer yandan arama işlemi i&amp;ccedil;in başlangı&amp;ccedil; kriterlerinin belirtilmesi gerekir. Bu ama&amp;ccedil;la &lt;strong&gt;SearchRequest&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneği oluşturulmaktadır. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Image&lt;/strong&gt; tipinden bir arama istendiği belirtilmiş ve buna g&amp;ouml;re &lt;strong&gt;Image&lt;/strong&gt; &amp;ouml;zelliğine yeni bir &lt;strong&gt;ImageRequest&lt;/strong&gt; nesnesi atanmıştır. &lt;strong&gt;ImageRequest&lt;/strong&gt; nesnesinde &lt;strong&gt;20&lt;/strong&gt; resimlik bir sonu&amp;ccedil; k&amp;uuml;mesinin talep edildiği belirtilmektedir. &lt;strong&gt;SearchRequest&lt;/strong&gt; sınıfı &amp;ouml;rneklenirken &lt;strong&gt;App Id&lt;/strong&gt; değeri verilmektedir.&lt;/p&gt;
&lt;p&gt;Hatırlayınız, bu değeri siz formu doldurduktan sonra alıyorsunuz. &amp;Ouml;nemli atamalardan biriside &lt;strong&gt;Query&lt;/strong&gt; &amp;ouml;zelliği i&amp;ccedil;in yapılandır. Bu &amp;ouml;zelliğin değeri aranacak i&amp;ccedil;eriği taşımaktadır. Bundan sonrası son derece kolaydır. &lt;strong&gt;LiveSearchService&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt;Search&lt;/strong&gt; metoduna parametre olarak &lt;strong&gt;SearchRequest&lt;/strong&gt; referansı atanır. Sonu&amp;ccedil;lar &lt;strong&gt;SearchResponse&lt;/strong&gt; nesne &amp;ouml;rneğine gelir. Ardından &lt;strong&gt;SearchResponse&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt;Image&lt;/strong&gt; &amp;ouml;zelliğinin &lt;strong&gt;Results&lt;/strong&gt; koleksiyonundaki her bir &lt;strong&gt;ImageResult&lt;/strong&gt; değerlendirilerek resim bilgilerinin alınması sağlanır. Elde edilen sonu&amp;ccedil;ların her biri i&amp;ccedil;in bir &lt;strong&gt;ThumbImage&lt;/strong&gt; bileşeni oluşturulur ve &lt;strong&gt;FlowLayoutPanel&lt;/strong&gt; bileşeninin &lt;strong&gt;Controls&lt;/strong&gt; koleksiyonuna eklenir. Uygulamanın &amp;ccedil;alışma zamanındaki &amp;ouml;rnek &amp;ccedil;ıktısı aşağıda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir. Ben &lt;strong&gt;Ferrari&lt;/strong&gt; kelimesi ile ilişkili resim dosyalarını arattım &lt;img title="Cool" src="/editors/tiny_mce3/plugins/emotions/img/smiley-cool.gif" alt="Cool" border="0" /&gt;.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg72_SampleRuntime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi minik resimlerden herhangirine tıklandığında orjinal halide yeni bir &lt;strong&gt;Form&lt;/strong&gt; i&amp;ccedil;erisinde g&amp;ouml;sterilebilmektedir. Buna ek olarak resim ile ilişkili bir ka&amp;ccedil; basit bilgide Form' un başlığında g&amp;ouml;sterilmektedir. Resmin boyutları, başlığı ve b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;.&amp;nbsp;Ne kadar basit &amp;ouml;ğle değil mi? &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Bu arada &lt;strong&gt;Bing API&lt;/strong&gt; ile ilişkili d&amp;ouml;k&amp;uuml;manı indirdiğinizde i&amp;ccedil;erisinde &lt;strong&gt;JSON, XML ve SOAP&lt;/strong&gt; modellerinin her biri i&amp;ccedil;in ayrı ayrı yapılmış detaylı &amp;ouml;rnek anlatımları ve projeler olduğunu g&amp;ouml;receksiniz. Bunları incelemenizi şiddetle tavsiye ederim. Peki bu acele &amp;ouml;rnekte yapmadıklarımız?&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Exception kontrol&amp;uuml;&lt;/strong&gt;&lt;em&gt;(&amp;Ouml;rneğin bağlantı problemelerinde yada resmin elde edilememesinde yaşanabilecek sıkıntıları handle etmek gerekir)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Asenkron arama metodu uygulanabilir ama&amp;nbsp;bu durumda &lt;strong&gt;Illegal Cross Thread Exception&lt;/strong&gt; hatasından ka&amp;ccedil;ınmak gerekir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bunlarda size g&amp;ouml;rev olsun. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2009-08-25 11:15:00</pubDate>
  <slug>Merhaba-Bing-API-20</slug>
  <tags>
    <tag>xml-web-services</tag>
    <tag>c#</tag>
  </tags>
  <categories>
    <category>bing</category>
  </categories>
</post>