<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>DataColumn.Expression Özelliği İle Hesaplanmış Alanların Oluşturulması</title>
  <description>Bugünkü makalemizde bir tabloda sonradan hesaplanan alanların nasıl oluşturulacağını incelemeye çalışacağız. Her zaman olduğu gibi konuyu iyi anlayabilmek için bir örnek üzerinden gideceğiz. Bir hesaplanan alan aslında bir hesaplama ifadesidir. Örneğin var olan bir tablodaki bir alana ait her değere ortak bir işlem yaptırmak istediğimizi ve bu her veri için oluşan sonuçlarında tabloda ayrı bir alan adı altında gözükmesini istediğimizi varsayalım.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde bir tabloda sonradan hesaplanan alanların nasıl oluşturulacağını incelemeye &amp;ccedil;alışacağız. Her zaman olduğu gibi konuyu iyi anlayabilmek i&amp;ccedil;in bir &amp;ouml;rnek &amp;uuml;zerinden gideceğiz. Bir hesaplanan alan aslında bir hesaplama ifadesidir. &amp;Ouml;rneğin var olan bir tablodaki bir alana ait her değere ortak bir işlem yaptırmak istediğimizi ve bu her veri i&amp;ccedil;in oluşan sonu&amp;ccedil;larında tabloda ayrı bir alan adı altında g&amp;ouml;z&amp;uuml;kmesini istediğimizi varsayalım. Buna en g&amp;uuml;zel &amp;ouml;rneklerden birisi;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Diyelimki personelinizin maaş bilgilerinin tutulduğu tablomuz var. Bu tablomuzda yer alan maaş verilerinde değişik oranlarda artışlar uygulamak istediğinizi varsayalım. Y&amp;uuml;zde 10, y&amp;uuml;zde 15 vb...Bu artışlarıda sadece ekranda izlemek istediğinizi tablo &amp;uuml;zerinde kalıcı olarak yer almasını istemediğinizi d&amp;uuml;ş&amp;uuml;n&amp;uuml;n. Bu minik problemin &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; DataColumn sınıfına ait Expression &amp;ouml;zelliğidir. Bu &amp;ouml;zelliği yapmak istediğimiz işlemin sonucunu oluşturacak ifadelerden oluştururuz.&lt;/p&gt;
&lt;p&gt;Konuyu daha net anlayabilmek i&amp;ccedil;in hi&amp;ccedil; vakit kaybetmeden &amp;ouml;rneğimizde ge&amp;ccedil;elim. Bu &amp;ouml;rnekte Maas isimli bir tablodaki Maas alanlarına ait değerlere kullanıcının se&amp;ccedil;tiği oranlarda artış uygulayacağız. Form tasarımımız aşağıdakine benzer olucak. Burada comboBox kontrol&amp;uuml;m&amp;uuml;zde %5 ten %55 &amp;lsquo;e kadar değerler girili. Hesapla başlıklı butona basıldığında, hesaplanan alana ilişkin işlemlerimizi ger&amp;ccedil;ekleştirilecek.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;strong style="mso-bidi-font-weight: normal;"&gt; &lt;img src="/makale/images/mk15_1.gif" alt="" width="428" height="337" /&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 1. Form Tasarımı&amp;nbsp;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Hi&amp;ccedil; vakit kaybetmeden kodlarımıza ge&amp;ccedil;elim.&lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection conFriends;
SqlDataAdapter da;
DataTable dtMaas;
/* Aşağıdaki procedure ile, Sql sunucumuzda yer alan Friends isimli veritabanına bağlanıyor, buradan Maas isimli tablodaki verileri DataTable nesnemize y&amp;uuml;kl&amp;uuml;yoruz. Daha sonrada dataGrid kontrol&amp;uuml;m&amp;uuml;ze veri kaynağı olarak bur DataTable nesnesimizi g&amp;ouml;sterek tablonun i&amp;ccedil;eriğinin g&amp;ouml;r&amp;uuml;nmesini sağlıyoruz.*/

public void doldur()
{
     conFriends=new SqlConnection("data source=localhost;initial catalog=Friends;integrated security=sspi");
     da=new SqlDataAdapter("Select * From Maas",conFriends);
     dtMaas=new DataTable("Maaslar");
     da.Fill(dtMaas);
     dgMaas.DataSource=dtMaas;
}
private void Form1_Load(object sender, System.EventArgs e)
{
     doldur(); /* Tablodan verilerimizi alan procedure'u &amp;ccedil;ağırıyoruz*/
}

private void btnHesapla_Click(object sender, System.EventArgs e)
{
     /* Hesaplanan Alanımız i&amp;ccedil;in bir DataColumn nesnesi tanımlıyoruz. */
     DataColumn dcArtisAlani=new DataColumn();
     /* Expression &amp;ouml;zelliğine yapmak istediğimiz hesaplamayı giriyoruz. Buradaki hesaplamada, kullanıcının cmbAris isimli comboBox kontrol&amp;uuml;nden se&amp;ccedil;tiği oran kadar maaşlara artış uygulanıyor.*/
     dcArtisAlani.Expression="Maas + (Maas *"+cmbArtis.Text+"/100)";
     /* Yeni alanımız i&amp;ccedil;in anlamlı bir isim veriyoruz. Bu isimde artış oranıda yazmakta.*/
     dcArtisAlani.ColumnName="Yuzde"+cmbArtis.Text+"Artis";
     /* Daha sonra oluşturduğumuz bu hesaplanmış alanı DataTable nesnemize ekliyoruz. B&amp;ouml;ylece bellekteki Maas tablomuzda, maaslara belirli bir artış oranı uygulanmış verileri i&amp;ccedil;eren DataColumn nesnemiz hazırlanmış oluyor.*/
     dtMaas.Columns.Add(dcArtisAlani);
     /* Son olarak dataGrid nesnemizi Refresh() metodu ile tazeleyerek hesaplanmış alanımızında g&amp;ouml;r&amp;uuml;nmesini sağlıyoruz.*/
     dgMaas.Refresh();
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşırız. Ben &amp;ouml;rnek olarak %10 luk artış uyguladım.&lt;strong style="mso-bidi-font-weight: normal;"&gt;&amp;nbsp;&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;strong style="mso-bidi-font-weight: normal;"&gt; &lt;img src="/makale/images/mk15_2.gif" alt="" width="416" height="328" /&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 2. Program İlk &amp;Ccedil;alıştığında.&amp;nbsp;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;İşte işlemimizin sonu&amp;ccedil;ları.&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;strong style="mso-bidi-font-weight: normal;"&gt; &amp;nbsp;&lt;img src="/makale/images/mk15_3.gif" alt="" width="416" height="328" /&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 3. Hesaplanmış Alan&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi %10 luk artışın uygulandığı yeni alanımız dataGrid&amp;rsquo;imiz i&amp;ccedil;inde g&amp;ouml;r&amp;uuml;lmektedir. Unutmayalımki bu oluşturduğumuz DataColumn nesnesi sadece bellekteki tablomuza eklenmiş bir g&amp;ouml;r&amp;uuml;nt&amp;uuml;d&amp;uuml;r. Veritabanımızdaki tablomuza doğrudan bir etisi yoktur. Tabiki performans a&amp;ccedil;ısından &amp;ccedil;ok y&amp;uuml;ksek kapasiteli tablolarda &amp;ccedil;alışırken b&amp;ouml;yle bir işlemin yapılması &amp;ouml;zellikle ağ ortamlarında performans kaybınada yol a&amp;ccedil;abilir. Bunun &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek i&amp;ccedil;in kullanabileceğimiz y&amp;ouml;ntemlerden birisi, sql sunucusunda bu hesaplamaların yaptırılması ve sonu&amp;ccedil;ların view nesneleri olarak alınmasıdır. Ancak k&amp;uuml;&amp;ccedil;&amp;uuml;k boyutlu veya s&amp;uuml;z&amp;uuml;lm&amp;uuml;ş veriler &amp;uuml;zerinde, Expression &amp;ouml;zelliğinin kullanımı sizinde g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi son derece kolay ve faydalıdır.&amp;nbsp;Geldik bir makalemizin sonuna daha, tekrar g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye kadar hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2003-12-06 12:00:00</pubDate>
  <slug>DataColumn-Expression-Ozelligi-Ile-Hesaplanmc4b1s-Alanlarc4b1n-Olusturulmasc4b1c2a0-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>data-column</tag>
    <tag>expression</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>