<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>MongoDb,Express,Vue ve Node Birlikteliği</title>
  <description>Amacım bu 4 enstrümanı kullanarak Web API tabanlı çalışan basit bir web uygulaması geliştirmek. Veriyi tutmak için MongoDB'yi, sunucu tarafı için Node.js'i, Web Framework amacıyla Express'i ve önyüz geliştirmesinde de Vue.js'i kullanmak istedim. Kobay olarakta 90lardan aklıma gelen ve Cobol öğretirlerken gösterdikleri Fihrist örneğini seçtim. Ayrıca WebPack'i de işin içerisine katıp paketleme operasyonunu da deneyimlemeye çalıştım.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2019/06/13/cobolll.png" alt="" /&gt;Aranızdan ka&amp;ccedil; kişi&amp;nbsp;akıllı telefonundaki herhangi bir arkadaşının numarasını ezbere s&amp;ouml;yleyebilir? Eminim bazılarımız bizi dokuz ay karnında taşıyan annesinin telefonunu dahi hatırlamıyordur. Peki ya birlikte sıklıkla vakit ge&amp;ccedil;irdiğiniz ama &amp;ccedil;ok da yakın &amp;ccedil;evrenizden olmayan kankanızın doğum g&amp;uuml;n&amp;uuml; ne zaman? Teknolojik cihazlarınızdaki hatırlatıcılar olmadığında ka&amp;ccedil; arkadaşınızın doğum g&amp;uuml;n&amp;uuml;n&amp;uuml; unutacaksınız&amp;nbsp;hi&amp;ccedil; d&amp;uuml;ş&amp;uuml;nd&amp;uuml;n&amp;uuml;z m&amp;uuml;?&lt;/p&gt;
&lt;p&gt;İletişim bilgisi ve doğum g&amp;uuml;nleri bizi yakın &amp;ccedil;evremize bağlayan veya uzağı yakın eden unsurlar arasında yer alıyor. Hatırlanmak g&amp;uuml;zel olduğu kadar hatırlamak da gerekiyor. Ortaokul sıralarında&amp;nbsp;kullandığım bir fihrist defterim vardı. İ&amp;ccedil;inde yakın arkadaşlarımın ev telefonları ve doğum g&amp;uuml;n&amp;uuml; bilgileri yazardı. Pek tabii &amp;ccedil;ok sık iletişimde olduğum sıra arkadaşım sevgili Burak G&amp;uuml;rkan gibi dostlarımı aramak i&amp;ccedil;in o deftere ihtiyacım yoktu.&amp;nbsp;Neredeyse her g&amp;uuml;n telefonla konuştuğumuz i&amp;ccedil;in numarayı ezberlemiştim.&lt;/p&gt;
&lt;p&gt;Aradan yıllar ge&amp;ccedil;ti ve Yıldız Teknik &amp;Uuml;niversitesi Matematik M&amp;uuml;hendisliği b&amp;ouml;l&amp;uuml;m&amp;uuml;n&amp;uuml; kazandım. Okulun ikinci yılındaki bilgisayar programlama dersinde Cobol g&amp;ouml;r&amp;uuml;yorduk ve d&amp;ouml;nem sonuna doğru hocamızla birlikte yaptığımız&amp;nbsp;o uzun metrajlı &amp;ccedil;alışmanın konusu fihrist defteriydi&lt;em&gt;(O yıl Cobol ile ilk ve son karşılaşmam olur diye d&amp;uuml;ş&amp;uuml;nsem de hayatımın ilerleyen yıllarında iki kez karşıma &amp;ccedil;ıkarak bende hoş anıların oluşmasına neden olacaktı)&lt;/em&gt; Bu kez arkadaşlarımızın&amp;nbsp;iletişim bilgilerini ve doğum g&amp;uuml;nlerini tutmak i&amp;ccedil;in 3.5 in&amp;ccedil;lik floppy diskten, 1ler ve 0lardan yararlanacaktık. Her ne kadar o zamanlar i&amp;ccedil;in heyecan verici bug&amp;uuml;n i&amp;ccedil;inse &amp;ccedil;ok sıradan bir &amp;ouml;rnek olsa da benim i&amp;ccedil;in&amp;nbsp;ge&amp;ccedil;mişe yapılan manevi bir yolculuk. Dolayısıyla zaman zaman bu &amp;ouml;rnek konsepti bir şeyleri &amp;ouml;ğrenmeye &amp;ccedil;alışırken kullanıyorum. İşte sıradaki &lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;saturday-night-works birinci faz&lt;/a&gt;&amp;nbsp;derlememizin konusu da bir fihrist. Gelin hi&amp;ccedil; vakit kaybetmeden notlarımızı toparlamaya başlayalım.&lt;/p&gt;
&lt;p&gt;Amacım&amp;nbsp;başlıkta ge&amp;ccedil;en enstr&amp;uuml;manları kullanarak Web API tabanlı basit bir web uygulaması geliştirmekti. Veriyi tutmak i&amp;ccedil;in MongoDB'yi, sunucu tarafı i&amp;ccedil;in Node.js'i, Web Framework amacıyla express'i ve &amp;ouml;ny&amp;uuml;z geliştirmesinde de Vue'yu kullanmak istemiştim. Kobay olarakta doksanlı yıllardan aklıma gelen ve Cobol &amp;ouml;ğretirlerken g&amp;ouml;sterdikleri Fihrist &amp;ouml;rneğini se&amp;ccedil;tim&lt;em&gt;(O vakitler sanırım hepimiz &amp;ouml;ğrendiğimiz dillerle arkadaşlarımızın telefon numaralarına yer verdiğimiz bir fihrist uygulaması yazmışızdır)&lt;/em&gt; &amp;Ouml;zellikle Vue tarafında bileşen&lt;em&gt;(component)&lt;/em&gt; geliştirmenin nasıl yapılabileceğini, bunlar arasındaki haberleşmenin nasıl tesis edileceğini merak ediyordum. İşin i&amp;ccedil;erisine WebPack de girince g&amp;uuml;zel bir &amp;ccedil;alışma alanı oluştu diyebilirim.&lt;/p&gt;
&lt;h2&gt;Projenin İskeleti&lt;/h2&gt;
&lt;p&gt;Projenin genel iskelet yapısı ve kullanacağımız dosyaları aşağıda g&amp;ouml;r&amp;uuml;len hiyerarşide oluşturabiliriz.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;Fihrist/
|----- app/
|----- config.js (Mongo bağlantısı gibi ortam parametrelerini tuttuğumuz konfigurasyon mod&amp;uuml;l&amp;uuml;)
|----- Routers.js (HTTP Get,Post,Put,Delete operasyonlarını &amp;uuml;stlenen WebAPI tarafı)
|----- Contact.js (mongodb tarafı i&amp;ccedil;in kullanılan entity modeli)
|----- public/
|----- src/
|------------ bus.js (vue component'leri arasındaki iletişimi sağlayan event bus dosyası)
|------------ main.js (vue tarafının giriş noktası)
|------------ vue.js (vue npm paketi y&amp;uuml;klendikten sonra dist klas&amp;ouml;r&amp;uuml;nden alınıp buraya kopyalanmıştır)
|------------ components/ (vue componentlerini tuttuğumuz yer)
|----------------- createContact.vue (yeni bir bağlantı eklemek i&amp;ccedil;in kullanılan bileşen)
|----------------- contacts.vue (t&amp;uuml;m kontak listesini g&amp;ouml;steren bileşen)
|----------------- app.vue (ana vue bileşeni)
|----- index.html (kullanıcının etkileşimde olacağı ana sayfa)
|----- server.js (sunucu tarafı)
|----- webpack.config.js (webpack build işleminin kullandığı konfigurasyon dosyası)&lt;/pre&gt;
&lt;p&gt;app klas&amp;ouml;r&amp;uuml;nde model sınıf, y&amp;ouml;nlendirme paketi ve bir konfigurasyon dosyası yer alıyor. public klas&amp;ouml;r&amp;uuml;nde HTML ve gerekirse CSS, image gibi&amp;nbsp;&amp;ouml;ğlere ve vue uygulamasının kendisine yer veriliyor. server.js tahmin edileceği &amp;uuml;zere node server rol&amp;uuml;n&amp;uuml; &amp;uuml;stleniyor.&amp;nbsp;&lt;/p&gt;
&lt;h2&gt;Gerekli Kurulumlar&lt;/h2&gt;
&lt;p&gt;Sistemde node, npm ve mongodb'nin y&amp;uuml;kl&amp;uuml; olduğunu varsayıyoruz. Buna g&amp;ouml;re k&amp;ouml;k klas&amp;ouml;rde,&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm init&lt;/pre&gt;
&lt;p&gt;ile başlangıcı yapıp gerekli paket kurulumlarını tamamlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm install body-parser express mongoose morgan&lt;/pre&gt;
&lt;p&gt;JSON bazlı servise ait mesaj g&amp;ouml;vdelerini kolayca parse etmek i&amp;ccedil;in body-parser, HTTP sunucusu ve servis taleplerinin karşılanması i&amp;ccedil;in express, mongodb veri tabanı ile konuşmak i&amp;ccedil;in mongoose, mongo loglarını console tarafından izleyebilmek i&amp;ccedil;in morgan paketlerini kullanıyoruz. Buna g&amp;ouml;re server.js dosyasının i&amp;ccedil;eriğini aşağıdaki gibi kodlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;var express = require('express')
var morgan = require('morgan')
var path = require('path')
var app = express()
var mongoose = require('mongoose')
var bodyParser = require('body-parser')
var config = require('./app/config')
var router = require('./app/router')

mongoose.connect(config.conn, { useNewUrlParser: true }) // konfigurasyon dosyasındaki bilgi kullanılarak mongoDb bağlantısı tesis edilir

// static dosyaların public klas&amp;ouml;r&amp;uuml;nden karşılanacağı belirtilir
app.use(express.static(path.join(__dirname, '/public')))

// Middleware katmanına morgan'ı enjekte ederek loglamayı etkinleştirdik
app.use(morgan('dev'))

// İstemci taleplerinden gelecek Body i&amp;ccedil;eriklerini JSON formatından kolayca ele almak i&amp;ccedil;in 
// Middleware katmanına body-parser mod&amp;uuml;l&amp;uuml;n&amp;uuml; ekledik
app.use(bodyParser.json())
app.use(bodyParser.urlencoded({ extended: true }))

var port = config.default_port || 8080 // port bilgisi belirlenir. config'de varsa 5003 yoksa 8080

app.listen(port)
app.use('/api', router) // /api adresine gelecek taleplerin router mod&amp;uuml;l&amp;uuml; tarafından karşılanacağı belirtilir.

app.get('/', function (req, res, next) {
    res.sendFile('./public/index.html') // eğer / adresine talep gelirse (yani http://localhost:5003/ şeklinde) index.html sayfasına y&amp;ouml;nlendiriyoruz
})

console.log('Sunucu hazır ve dinlemede')&lt;/pre&gt;
&lt;p&gt;Sunucu tarafında kullandığımız yardımcı mod&amp;uuml;llerimiz olacak. Web API tarafı i&amp;ccedil;in router.js'i ve MongoDb veri tabanı bağlantısını konfigurasyon dosyasından beslememizi sağlayan config.js ki i&amp;ccedil;eriğini aşağıdaki gibi oluşturabiliriz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;// genel konfigurasyon ayarlarımız
// veritabanı bağlantısı, sunucu i&amp;ccedil;in varsayılan port bilgisi vs
module.exports={
    conn:'mongodb://localhost:27017/fihristim', 
    default_port:5003 
}&lt;/pre&gt;
&lt;p&gt;Web API g&amp;ouml;revini &amp;uuml;stlenen router.js'in temel g&amp;ouml;revi CRUD operasyonları i&amp;ccedil;in HTTP desteği sunmak&lt;em&gt;(Read i&amp;ccedil;in Get, Create i&amp;ccedil;in Post vb)&lt;/em&gt;&amp;nbsp;Her ne kadar ilişkisel bir veri tabanı kullanmıyor olsak da, Mongo tarafındaki koleksiyon i&amp;ccedil;in bir şema bilgisi tanımlamamız gerekiyor. Yani bir model oluşturmalıyız. Bunun i&amp;ccedil;in contact isimli mod&amp;uuml;l&amp;uuml; oluşturabiliriz. Arkadaşımızın tam adını, telefon numarasını, yaşadığı yeri ve doğum tarihi bilgilerini tutan bu modelde sadece String ve Date veri t&amp;uuml;rlerine yer vermiş olsak da siz veri farklı tiplerle yapıyı pekala zenginleştirebilirsiniz.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;// MongoDb'de koleksiyonunun karşılığı olan model tanımı
var mongoose = require('mongoose')

// contact isimli bir şemamız var
// &amp;ouml;rnek olması a&amp;ccedil;ısından bir ka&amp;ccedil; &amp;ouml;zellik i&amp;ccedil;eriyor
var contact = new mongoose.Schema({
    fullname: { type: String },
    phoneNumber: { type: String },
    location: { type: String },
    birtdate: { type: Date }
},
    {
        collection: 'contacts' // kontaklarımızı tuttuğumuz koleksiyon
    }
)

module.exports = mongoose.model('Contact', contact)&lt;/pre&gt;
&lt;p&gt;Bu şemayı kullanan ve esas itibariyle CRUD operasyonlarının karşılığı olan servis taleplerini ele alan router dosyasının i&amp;ccedil;eriğini de aşağıdaki gibi geliştirerek devam edebiliriz.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;// Web API Router sınıfımız
// gerekli mod&amp;uuml;lleri tanımlıyoruz
var express = require('express')
var operator = express.Router()
var contact = require('./contact')

// HTTP Post ile yeni bir contact eklenmesini sağlıyoruz
operator.route('/').post(function (req, res) {
    // request body'den gelen değerlere g&amp;ouml;re contact oluşturuluyor
    contact.create({
        fullname: req.body.fullname,
        phoneNumber: req.body.phoneNumber,
        location: req.body.location,
        birtdate: req.body.birtdate
    }, function (e, c) { //callback fonksiyonu
        if (e) { //hata oluşmuşsa HTTP 400 d&amp;ouml;nd&amp;uuml;k
            res.status(400).send('kayıt işlemi başarısız')
        }
        res.status(200).json(c) // Hata yoksa HTTP 200 Ok d&amp;ouml;n&amp;uuml;yor ve cevabın i&amp;ccedil;ine oluşturulan contact nesnesini g&amp;ouml;m&amp;uuml;yoruz
    }
    )
})

// HTTP Get talebi i&amp;ccedil;in t&amp;uuml;m kontakların listesini d&amp;ouml;n&amp;uuml;yoruz
operator.route('/').get(function (req, res, next) {
    contact.find(function (e, contacts) {
        if (e) { //hata varsa sonraki fonksiyona bunu yollar
            return next(new Error(e))
        }
        res.json(contacts) // hata yoksa t&amp;uuml;m kontaları json serileştirip d&amp;ouml;ner
    })
})

// Belli bir ID'ye ait kontak bilgisini d&amp;ouml;nd&amp;uuml;r&amp;uuml;r
// HTTP Get ile &amp;ccedil;alışır
// Querystring'teki id kullanılır
operator.route('/:id').get(function (req, res, next) {
    var id = req.params.id //id parametresinin değeri alınır
    contact.findById(id, function (e, c) {
        if (e) //hata varsa kayıt bulunanamış diyebiliriz
        {
            return next(new Error('Bu ID i&amp;ccedil;in bir kontak bilgisi mevcut değil'))
        }
        res.json(c)
    })
})

// ID bazlı kontak silmek i&amp;ccedil;in &amp;ccedil;alışan fonksiyon
// HTTP Delete kullanılır
operator.route('/:id').delete(function (req, res, next) {
    var id = req.params.id
    contact.findByIdAndRemove(id, function (e, c) {
        if (e) {
            return next(new Error('Bu ID i&amp;ccedil;in bir kontak bulunamadığından silme işlemi yapılamadı'))
        }
        res.json('Başarılı bir şekilde silindi')
    })
})

// G&amp;uuml;ncelleme işlemi
// HTTP Put kullanılır
operator.route('/').put(function (req, res, next) {
    var id = req.body.id
    // &amp;ouml;nce id'den contact bulunur
    contact.findById(id, function (e, c) {
        if (e) {
            return next(new Error('G&amp;uuml;ncellenme i&amp;ccedil;in bir kayıt bulunamadı'))
        } else { //bulunduysa &amp;ouml;zellikler body'den gelenler ile değiştirilir

            c.fullname = req.body.fullname ? req.body.fullname : c.fullname
            c.phoneNumber = req.body.phoneNumber ? req.body.phoneNumber : c.phoneNumber
            c.location = req.body.location ? req.body.location : c.location
            c.birtdate = req.body.birtdate ? req.body.birtdate : c.birtdate

            // contact yeni haliyle kayıt edilir
            c.save()
            res.status(200).json(c)
        }
    })
})

module.exports = operator&lt;/pre&gt;
&lt;p&gt;server.js ve App klas&amp;ouml;r&amp;uuml; i&amp;ccedil;indeki dosyalarımız hazır. An itibariyle sunucu tarafını &amp;ccedil;alıştırabilir ve &amp;ccedil;eşitli servis &amp;ccedil;ağrıları gere&amp;ccedil;ekleştirerek Mongo &amp;uuml;zerinde CRUD operasyonlarını deneyimleyebiliriz. Sunucu tarafını başlatmak i&amp;ccedil;in terminalden&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm start&lt;/pre&gt;
&lt;p&gt;komutunu vermek yeterli. Tabii bu aşamada MongoDb'nin de &amp;ccedil;alışır olduğundan emin olmak lazım. mongod ile mongodb servisini başlatabiliriz. Sonrasında veri tabanı &amp;uuml;zerindeki operasyonlar i&amp;ccedil;in mongo komutunu kullanarak arabirim haberleşmesini de a&amp;ccedil;abiliriz. Eğer mongod ile servis başarılı bir şekilde &amp;ccedil;alışırsa 27017 port veri tabanı haberleşmesi i&amp;ccedil;in aktif hale gelecektir. Sonrasında &amp;ouml;rneğin db komutunu kullanılabilir ve &amp;ouml;rneğin veri tabanlarını listeyebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;mongod
mongo
db&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/06/13/credit_1.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Servis Testleri&lt;/h2&gt;
&lt;p&gt;Servis tarafının işlerliğini kontrol etmek i&amp;ccedil;in curl aracıyla&amp;nbsp;aşağıdaki denemeler yapılabilir. Ben denemeler sırasında&amp;nbsp;en yakın arkadaşlarımdan d&amp;ouml;rd&amp;uuml;n&amp;uuml; ekledim. Sonrasında listeleme, belli bir id'ye bağlı kişi &amp;ccedil;ekme, bilgi g&amp;uuml;ncelleme ve silme operasyonlarını icra ettim.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;curl -H "Content-Type: application/json" -X POST -d '{"fullname":"M.J.","phoneNumber":"555 55 23","location":"chicago","birtdate":"1963-05-18T16:00:00Z"}' http://localhost:5003/api

curl -H "Content-Type: application/json" -X POST -d '{"fullname":"&amp;Ccedil;arls Barkli","phoneNumber":"555 55 34","location":"phoneix","birtdate":"1963-05-18T16:00:00Z"}' http://localhost:5003/api

curl -H "Content-Type: application/json" -X POST -d '{"fullname":"meycik cansın","phoneNumber":"555 55 32","location":"los angles","birtdate":"1959-05-18T16:00:00Z"}' http://localhost:5003/api

curl -H "Content-Type: application/json" -X POST -d '{"fullname":"leri b&amp;ouml;rd","phoneNumber":"555 55 33","location":"boston","birtdate":"1956-05-18T16:00:00Z"}' http://localhost:5003/api

curl http://localhost:5003/api

curl http://localhost:5003/api/5c29222522433f0234e71e1b

curl -H "Content-Type: application/json" -X PUT -d '{"id":"5c29222522433f0234e71e1b","fullname":"maykıl cordın"}' http://localhost:5003/api

curl -X DELETE http://localhost:5003/api/5c29222522433f0234e71e1b&lt;/pre&gt;
&lt;p&gt;Belli dok&amp;uuml;manlar i&amp;ccedil;in kullanılan ve MongoDb tarafından otomatik olarak &amp;uuml;retilen ID değerleri elbette siz kendi denemelerinizi yaparken farklılıklar g&amp;ouml;sterecektir.&lt;/p&gt;
&lt;h2&gt;Front-End Tarafı&lt;/h2&gt;
&lt;p&gt;Servis tarafı hazır. Elimizde veri kaynağı ile haberleşen ve temel işlemleri ger&amp;ccedil;ekleştiren bir sunucu mevcut. Şimdi bu servisle konuşan aray&amp;uuml;z uygulamasını tasarlamaya başlayalım. T&amp;uuml;m front-end enstr&amp;uuml;manları public klas&amp;ouml;r&amp;uuml; altında konuşlanmış durumdadır. Javascript ve css&amp;nbsp;&amp;ouml;ğelerini tek bir paket haline getirmek i&amp;ccedil;in WebPack'ten faydalanacağız. Vue tarafındaki HTTP &amp;ccedil;ağrıları i&amp;ccedil;in istemci olarak axios paketini kullanacağız. Gereken paket kurulumları i&amp;ccedil;in terminalden ş&amp;ouml;yle ilerleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm install babel-core babel-loader@7 babel-preset-env babel-preset-stage-3 css-loader vue-loader vue-template-compiler webpack webpack-dev-server bootstrap&lt;/pre&gt;
&lt;p&gt;Vue tarafındaki ana bileşenimiz app.vue dosyasında bulunuyor. Kendi i&amp;ccedil;inde iki alt bileşene sahip. Bir kontak eklemek i&amp;ccedil;in kullanacağımız newContact.vue ve listeleme i&amp;ccedil;in ele alacağımız contacts.vue. Bu bileşenleri aşağıdaki gibi kodlayabiliriz.&lt;/p&gt;
&lt;p&gt;newContact.vue&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;template&amp;gt;
  &amp;lt;div&amp;gt;
    &amp;lt;h1&amp;gt;Yeni Bağlantı&amp;lt;/h1&amp;gt;
    &amp;lt;form&amp;gt;
      &amp;lt;div class="form-group"&amp;gt;
        &amp;lt;label&amp;gt;Fullname&amp;lt;/label&amp;gt;
        &amp;lt;input
          type="text"
          class="form-control"
          aria-describedby="inputGroup-sizing-default"
          placeholder="nasıl isimlendirirsin?"
          v-model="contact.fullname"
        &amp;gt;
      &amp;lt;/div&amp;gt;
      &amp;lt;div class="form-group"&amp;gt;
        &amp;lt;label&amp;gt;Phone&amp;lt;/label&amp;gt;
        &amp;lt;input
          type="text"
          class="form-control"
          aria-describedby="inputGroup-sizing-default"
          placeholder="nereden ulaşırsın?"
          v-model="contact.phoneNumber"
        &amp;gt;
      &amp;lt;/div&amp;gt;
      &amp;lt;div class="form-group"&amp;gt;
        &amp;lt;label&amp;gt;Location&amp;lt;/label&amp;gt;
        &amp;lt;input
          type="text"
          class="form-control"
          aria-describedby="inputGroup-sizing-default"
          placeholder="nerede yaşıyor?"
          v-model="contact.location"
        &amp;gt;
      &amp;lt;/div&amp;gt;
      &amp;lt;div class="form-group"&amp;gt;
        &amp;lt;label&amp;gt;Birthdate&amp;lt;/label&amp;gt;
        &amp;lt;input
          type="text"
          class="form-control"
          aria-describedby="inputGroup-sizing-default"
          placeholder="1976-04-12T11:35:00Z"
          v-model="contact.birtDate"
        &amp;gt;
      &amp;lt;/div&amp;gt;
      &amp;lt;div class="form-group"&amp;gt;
        &amp;lt;button type="button" class="btn btn-primary" @click="createContact($event)"&amp;gt;Kaydet&amp;lt;/button&amp;gt;
      &amp;lt;/div&amp;gt;
    &amp;lt;/form&amp;gt;
  &amp;lt;/div&amp;gt;
&amp;lt;/template&amp;gt;

&amp;lt;script&amp;gt;
import axios from "axios"; // API servis haberleşmesi i&amp;ccedil;in
import bus from "./../bus.js"; // bileşenler arası haberleşme i&amp;ccedil;in
// HTML elementlerindeki input kontrollerinde dikkat edileceği &amp;uuml;zere v-model attribute'ları kullanıldı. Bunlar modelimizin &amp;ouml;zellikleri.

export default {
  data() {
    return {
      contact: {
        fullname: "",
        phoneNumber: "",
        location: "",
        birtDate: ""
      }
    };
  },
  methods: {
    createContact(event) {
      //Button'un @click niteliğinde y&amp;uuml;klenen olay metodu
      if (event) event.preventDefault();
      let url = "http://localhost:5003/api";
      let param = {
        //parametre değerleri input kontrollerinden geliyor
        fullname: this.contact.fullname,
        phoneNumber: this.contact.phoneNumber,
        location: this.contact.location,
        birtDate: this.contact.birtDate
      };
      axios
        .post(url, param) //HTTP Post &amp;ccedil;ağrısını g&amp;ouml;nderdik
        .then(response =&amp;gt; {
          console.log(response); // tarayıcının developer tool kısmından log takibi i&amp;ccedil;in. Canlı ortamda kullanmaya gerek yok.
          this.clear();
          this.refresh(); // yeni bir bağlantı oluşturlduğunda refresh metodu &amp;ccedil;ağırılır
        })
        .catch(error =&amp;gt; {
          console.log(error);
        });
    },
    clear() {
      this.contact.fullname = "";
      this.contact.phoneNumber = "";
      this.contact.location = "";
      this.contact.birtDate = "";
    },
    refresh() {
      bus.$emit("refresh"); // metod evenbus'a bir olay fırlatır. refresh isminde. bunu diğer bileşende yakalayarak bağlantılar listesini anında g&amp;uuml;nelleyebiliriz
    }
  }
};
&amp;lt;/script&amp;gt;&lt;/pre&gt;
&lt;p&gt;contacts.vue bileşenimiz&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;template&amp;gt;
  &amp;lt;div&amp;gt;
    &amp;lt;div class="col-md-12" v-show="contactList.length&amp;gt;0"&amp;gt;
      &amp;lt;h3&amp;gt;T&amp;uuml;m bağlantılarım&amp;lt;/h3&amp;gt;
      &amp;lt;div class="row mrb-10" v-for="contact in contactList" :key="contact.id"&amp;gt;
        &amp;lt;div class="card bg-light border-dark mb-3" style="width: 18rem;"&amp;gt;
          &amp;lt;div class="card-body"&amp;gt;
            &amp;lt;h5 class="card-title"&amp;gt;{{ contact.fullname }}&amp;lt;/h5&amp;gt;
            &amp;lt;p class="card-text"&amp;gt;{{ contact.phoneNumber }}&amp;lt;/p&amp;gt;
            &amp;lt;p class="card-text"&amp;gt;{{ contact.location }}&amp;lt;/p&amp;gt;
            &amp;lt;p class="cart-text"&amp;gt;{{ contact.birtdate }}&amp;lt;/p&amp;gt;
            &amp;lt;span v-on:click="deleteContact(contact._id)" class="btn btn-primary"&amp;gt;Sil&amp;lt;/span&amp;gt;
          &amp;lt;/div&amp;gt;
        &amp;lt;/div&amp;gt;
      &amp;lt;/div&amp;gt;
    &amp;lt;/div&amp;gt;
  &amp;lt;/div&amp;gt;
&amp;lt;/template&amp;gt;

&amp;lt;script&amp;gt;
import axios from "axios";
import bus from "./../bus.js";

export default {
  data() {
    return {
      contactList: [] //modelimizin verisini i&amp;ccedil;erecek array elemanı
    };
  },
  created: function() {
    // başlangı&amp;ccedil;ta &amp;ccedil;alışacak fonksiyonumuzda iki işlem yapılıyor
    this.getAllContacts(); // t&amp;uuml;m bağlantıları al
    this.listenToBus(); // ve diğer bileşenden yeni eklenecek bağlantıları alabilmek i&amp;ccedil;in eventBus'ı dinlemeye başla
  },
  methods: {
    getAllContacts() {
      let uri = "http://localhost:5003/api"; // klasik axios ile web api'mize HTTP Get talebi g&amp;ouml;nderdik
      axios.get(uri).then(response =&amp;gt; {
        this.contactList = response.data; //d&amp;ouml;nen veriyi contactList dizisine aldık
        console.log(this.contactList);
      });
    },
    deleteContact(id) {
      // bir arkadaşımızı silmek istediğimizde
      let uri = "http://localhost:5003/api/" + id;
      axios.delete(uri); // HTTP Delete talebini g&amp;ouml;nderiyoruz. id parametresi Mongo'nun &amp;uuml;rettiği Guid
      this.getAllContacts(); // listemizi tazeleyelim
    },
    listenToBus() {
      bus.$on("refresh", $event =&amp;gt; {
        this.getAllContacts(); // Diğer bileşen tarafından yeni bir bağlantı eklenirse dinlediğimiz refresh isimli hattan bunu yakalayabileceğiz. Bu uyarı sonrası bağlantı listesini tekrar &amp;ccedil;ekiyoruz
      });
    }
  }
};
&amp;lt;/script&amp;gt;&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;Ouml;zellikle yukarıdaki iki bileşenin kullandığı bus isimli mod&amp;uuml;le dikkat etmek lazım. Vue tarafında bileşenler arasında olay bazlı &amp;ccedil;alışan bir eventbus modeli ile iletişim sağlanabilir. Bu sayede&amp;nbsp;bir bileşende yapılan değişiklikleri başka birisine g&amp;ouml;ndermek m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. &amp;Ouml;rneğimizdeki newContact bileşeninde refresh isimli bir olay tetiklenir &lt;em&gt;(Yeni bir kontak eklendiğinde &amp;ccedil;alıştırıyoruz)&lt;/em&gt;&amp;nbsp;Contacts bileşeni de refresh isimli olayı dinlemektedir. Dolayısıyla yeni bir kontak bilgisi eklediğimizde diğer bileşen otomatik olarak g&amp;uuml;ncel kontak listesini &amp;ccedil;ekecektir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;ve son olarak app.vue isimli ana bileşenimiz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;template&amp;gt;
  &amp;lt;div id="app"&amp;gt;
    &amp;lt;div class="container"&amp;gt;
      &amp;lt;div class="row col-md-6 offset-md-3"&amp;gt;
        &amp;lt;create-contact&amp;gt;&amp;lt;/create-contact&amp;gt;
        &amp;lt;!-- createContact bileşeni buraya yerleşecek diğeri de aşağıya --&amp;gt;
        &amp;lt;contacts&amp;gt;&amp;lt;/contacts&amp;gt;
      &amp;lt;/div&amp;gt;
    &amp;lt;/div&amp;gt;
  &amp;lt;/div&amp;gt;
&amp;lt;/template&amp;gt;


&amp;lt;script&amp;gt;
import createContact from "./newContact.vue"; // yeni bağlantı eklediğimiz bileşeni aldık
import contacts from "./contacts.vue"; // contact bileşenini aldık
export default {
  name: "app",
  data() {
    return {};
  },
  components: { createContact, contacts } // bileşenlerimizi tanıttık
};
&amp;lt;/script&amp;gt;&lt;/pre&gt;
&lt;p&gt;Frontend tarafı geliştmeleri bittikten sonra bir build işlemi ile mypackage.js dosyasını oluşturacağız. Bu i&amp;ccedil;erik Vue bileşenlerinin de sunulacağı index.html dosyasında referanslanacak. &amp;Ccedil;ok sade bir HTML i&amp;ccedil;eriği elde edeceğimizi ifade edebilirim :) Tabii burada build s&amp;uuml;reci i&amp;ccedil;in gerekli bir webpack.config.js dosyasına&amp;nbsp;ihtiya&amp;ccedil; var.&amp;nbsp;İlgili dosyayı aşağıdaki gibi kodlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;const VueLoaderPlugin = require('vue-loader/lib/plugin');

module.exports = {

    entry: './public/src/main.js',
    output: {
        filename: './public/build/mypackage.js'
    },
    resolve: {

        alias: {
            vue: './vue.js'
        }
    },
    module: {
        rules: [
            {
                test: /\.css$/,
                use: [
                    'vue-style-loader',
                    'css-loader'
                ]
            }, {
                test: /\.vue$/,
                loader: 'vue-loader',
                exclude: /node_modules/,
                options: {
                    loaders: {
                    }
                }
            },
            {
                test: /\.js$/,
                loader: 'babel-loader',
                exclude: /node_modules/
            }
        ]
    },
    plugins: [
        new VueLoaderPlugin()
    ],
    devServer: {
        port: 3000
    }
}&lt;/pre&gt;
&lt;p&gt;Build sonrası oluşan paket i&amp;ccedil;in bir takım bildirimlere yer verilmektedir. Giriş noktası olarak src klas&amp;ouml;r&amp;uuml;ndeki main.js tanımlanmıştır. Build sonrası &amp;ccedil;ıktı output sekmesinde belirtilen ortama yapılacaktır. Devam eden kısımlarda css, vue vs js formatlı dosyalar i&amp;ccedil;in hen&amp;uuml;z ne anlama geldiklerini &amp;ouml;ğrenemediğim kural setleri vardır. Dosya tamamlandıktan sonra build işlemine ge&amp;ccedil;ilebilir. Aşağıdaki terminal komutunu bu ama&amp;ccedil;la kullanabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm run build&lt;/pre&gt;
&lt;p&gt;Eğer sorunsuz bir şekilde&lt;em&gt;(sorunsuz diyorum &amp;ccedil;&amp;uuml;nk&amp;uuml; webpack.config.js dosyasını ayarlarken epey problem yaşadım) &lt;/em&gt;build işlemi ger&amp;ccedil;ekleşirse dist/public/build/mypackage.js şeklinde bir dosya oluşur. Bu boh&amp;ccedil;ayı index.html public klas&amp;ouml;r&amp;uuml;ne alıp aşağıdaki gibi kullanıma a&amp;ccedil;abiliriz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;!DOCTYPE html&amp;gt;
&amp;lt;html&amp;gt;

&amp;lt;head&amp;gt;
    &amp;lt;meta charset="utf-8"&amp;gt;
    &amp;lt;title&amp;gt;Benim en iyi arkadaşlarım&amp;lt;/title&amp;gt;
&amp;lt;/head&amp;gt;

&amp;lt;body&amp;gt;
    &amp;lt;app&amp;gt;&amp;lt;/app&amp;gt;
    &amp;lt;script src="./build/mypackage.js"&amp;gt;&amp;lt;/script&amp;gt;
&amp;lt;/body&amp;gt;

&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Hepsi bu kadar ;) Yazdığımız uygulamayı test etmek i&amp;ccedil;in node ve mongodb sunucularını &amp;ccedil;alıştırmamız ve http://localhost:5003/ adresine gitmemiz yeterli. Malum burası varsayılan olarak index sayfasına y&amp;ouml;nlendirilmekte&lt;em&gt;(Nereden yapıldığını hatırlıyor musunuz?)&lt;/em&gt;&amp;nbsp;index.html i&amp;ccedil;inde Vue kodlarımızı paketlediğimiz mypackage.js dosyası referans edildiğinden ilgili bileşenler de buraya render edilecek.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Build sonrası bileşenlerde bir değişiklik yapılırsa tekrardan build işleminin &amp;ccedil;alıştırılması ve bundle paketinin kullanıma alınması gerekir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Ekleme işlemi ile ilgili ilk test sonucu aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/06/13/credit_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Listeleme ve listenen bağlantıları silme işini contacts.vue isimli bileşen &amp;uuml;stlenmekte. Buda app.vue i&amp;ccedil;erisinde tanımlanıp sayfaya yerleştiriliyor. contacts.vue i&amp;ccedil;erisinde bootstrap card stillerini kullanmayı tercih ettim. &amp;Ccedil;ok berbat bir tasarım olmadı ama &amp;ccedil;ok iyi de olmadı. Fonksiyonel olarak bağlantıları listeletebiliyor, silme ve yenilerini ekleme işlemlerini ger&amp;ccedil;ekleştirebiliyoruz.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Update işlemi i&amp;ccedil;inde buraya bir şeyler eklemek lazım. Mesela bir link'le farklı bir adrese y&amp;ouml;nlendirilme ve onun &amp;uuml;st&amp;uuml;nden g&amp;uuml;ncelleme işlemlerinin yapılması sağlanabilir. Bu kutsal g&amp;ouml;revi...... :D&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;İşte &amp;ouml;rnek bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; daha...&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/06/13/credit_3.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Ben Neler &amp;Ouml;ğrendim?&lt;/h2&gt;
&lt;p&gt;Olayın başlangı&amp;ccedil; noktası olan index.html son derece sadedir. İ&amp;ccedil;inde bootstrap ve&amp;nbsp;vue bileşenleri&amp;nbsp;gibi gerekli diğer k&amp;uuml;t&amp;uuml;phaneleri barındırmaktadır. Bu sadeliği webpack sağlıyor ama bu ifadem mutlaka webpack'i kullanın anlamına gelmemeli. Farklı alternatif bundler ara&amp;ccedil;ları da mevcut.&amp;nbsp;Benim bu &amp;ccedil;alışma sonrası &amp;ouml;ğrendiklerim ise ş&amp;ouml;yle;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Vue'da component nasıl geliştirilir&lt;/li&gt;
&lt;li&gt;template &amp;uuml;zerinde model kullanımı nasıldır&lt;/li&gt;
&lt;li&gt;axios ile HTTP Post,Get,Put gibi metodlar nasıl &amp;ccedil;ağrılır&lt;/li&gt;
&lt;li&gt;webpack.config dosyası nasıl hazırlanır&lt;/li&gt;
&lt;li&gt;bir bileşenden eventbus'a bildirim nasıl yapılır ve diğer bileşenlerden bu değişiklik nasıl yakalanır&lt;/li&gt;
&lt;li&gt;Bootstrap Card'ları nasıl kullanılır&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir &lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;cumartesi gecesi &amp;ccedil;alışması&lt;/a&gt;na ait derlemenin daha sonuna. &lt;a href="https://github.com/buraksenyurt/saturday-night-works/tree/master/No%2013%20-%20MEVN%20Sample" target="_blank"&gt;13 numaralı&amp;nbsp;&amp;ouml;rnek&lt;/a&gt;le ge&amp;ccedil;mişe bir yolculuk daha yaptım.&amp;nbsp;Tekrardan okuyunca unuttuğum bir &amp;ccedil;ok noktayı yeniden hatırladığım bir yazı olduğu i&amp;ccedil;in kendi adıma kardayım. Umarım sizler i&amp;ccedil;in de faydalı olmuştur. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2019-07-19 05:47:00</pubDate>
  <slug>mongodb-express-vue-ve-node-birlikteligi</slug>
  <tags>
    <tag>vuejs</tag>
    <tag>mongodb</tag>
    <tag>express</tag>
    <tag>node</tag>
    <tag>nodejs</tag>
    <tag>javascript</tag>
    <tag>npm</tag>
    <tag>curl</tag>
    <tag>webpack</tag>
    <tag>rest</tag>
    <tag>http</tag>
    <tag>crud</tag>
    <tag>mongoose</tag>
    <tag>nosql</tag>
    <tag>html</tag>
    <tag>bootstrap</tag>
    <tag>eventbus</tag>
    <tag>vue</tag>
  </tags>
  <categories>
    <category>Vue.js</category>
  </categories>
</post>