<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Diamond Problem, C# ve Multiple Inheritance</title>
  <description>Olaya C++ tarafından baktığımızda, Diamond Problem adı verilen bir sorunsalın, böyle bir yasağa neden olduğunu da ifade edebiliriz. Peki Diamond Problemi nedir? Dilerseniz öncelikle bu vakayı ele almaya çalışarak işe başlayalım.</description>
  <content>&lt;p&gt;&lt;a href="/pics/blg226_Giris.jpg"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border: 0px;" title="blg226_Giris" src="/pics/blg226_Giris_thumb.jpg" alt="blg226_Giris" width="304" height="205" align="right" border="0" /&gt;&lt;/a&gt; Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Yandaki resimde m&amp;uuml;kemmel &amp;ouml;l&amp;ccedil;&amp;uuml;lerde bir elmas taşını g&amp;ouml;rmektesiniz. Sanıyorum ki i&amp;ccedil;erisinde altın orana rastlamak bile m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Elmas karatına g&amp;ouml;re derece değerli bir taş olduğu kadar, elde edilmesi de zahmetli ve zordur. Hatta &amp;ouml;zellikle &lt;strong&gt;Afrika&lt;/strong&gt;&amp;rsquo; nın elmas y&amp;ouml;n&amp;uuml;nden zengin olan bazı &amp;uuml;lkelerinde bu taş y&amp;uuml;z&amp;uuml;nden pek &amp;ccedil;ok kişi hayatını kaybetmiştir/kaybetmektedir. Ki bu konu g&amp;uuml;n&amp;uuml;m&amp;uuml;z sinemasına da malzeme olmayı başarmıştır.&lt;/p&gt;
&lt;p&gt;Elbette bizim bu g&amp;uuml;nk&amp;uuml; konumuzun elmaslar ve &amp;uuml;zerinde d&amp;ouml;nen dolaplar ile pek bir alakası bulunmamaktadır. Aslında bu g&amp;uuml;nk&amp;uuml; yazımızda &lt;strong&gt;C#&lt;/strong&gt; programlama dilinde yasaklanmış olan ama &amp;ouml;rneğin &lt;strong&gt;C++&lt;/strong&gt; ile ele alabileceğiniz &lt;strong&gt;&amp;ccedil;oklu kalıtım(Multiple Inheritance)&lt;/strong&gt; konusuna farklı bir a&amp;ccedil;ıdan bakmaya &amp;ccedil;alışıyor olacağız.&lt;/p&gt;
&lt;p&gt;Esasında &lt;strong&gt;C# &lt;/strong&gt;programlama dili ile ilişkili kaynaklara baktığımızda, kalıtım ile ilişkili temel kurallardan birisi n sayıda sınıf kullanılarak &amp;ccedil;oklu kalıtımın yasaklanmış olduğudur. Ancak bunun sebebi veya nedenleri hakkında elle tutulur &amp;ccedil;ok fazla bilgi bulunmaz. Bulunue ama pek anlaşılmaz &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt; Bu nedenle durumu buna izin veren bir dil ile değerlendirmekte yarar vardır. Olaya &lt;strong&gt;C++ &lt;/strong&gt;tarafından baktığımızda, &lt;strong&gt;Diamond Problem &lt;/strong&gt;adı verilen bir sorunsalın, b&amp;ouml;yle bir yasağa neden olduğunu da ifade edebiliriz. Peki &lt;strong&gt;Diamond&lt;/strong&gt; &lt;strong&gt;Problemi&lt;/strong&gt; nedir? Dilerseniz &amp;ouml;ncelikle bu vakayı ele almaya &amp;ccedil;alışarak işe başlayalım. Bu ama&amp;ccedil;la basit bir &lt;strong&gt;Win32 Console Application&lt;/strong&gt; projesi geliştiriyor olacağız. S&amp;ouml;z konusu proje&lt;strong&gt; C++&lt;/strong&gt; ile geliştirilmiş olup aşağıdaki kod i&amp;ccedil;eriğine sahiptir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg226_CPlusPlusDiagram.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg226_CPlusPlusDiagram" src="/pics/blg226_CPlusPlusDiagram_thumb.gif" alt="blg226_CPlusPlusDiagram" width="467" height="521" border="0" /&gt;&lt;/a&gt;&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;#include "stdafx.h" 
#include &amp;lt;string&amp;gt; 
#include &amp;lt;stdio.h&amp;gt;

class BaseObject 
{ 
public: 
    BaseObject(void) 
    { 
        printf("BaseObject Default Constructor\n"); 
    } 
public: 
    virtual void WriteInfo() 
    {        
        printf("\tBaseObject WriteInfo Method\n"); 
    } 
    virtual void CheckValidation() 
    { 
        printf("\tBaseObject CheckValidation Method\n"); 
    } 
};

class Drawable 
    :public BaseObject 
    //: virtual public BaseObject 
{ 
public: 
    Drawable(void) 
    { 
        printf("\t\tDrawable Default Constructor\n"); 
    } 
    void WriteInfo() 
    { 
        printf("\t\tDrawable WriteInfo Method\n"); 
    } 
};

class Rectangle 
    :public BaseObject  
    //:virtual public BaseObject 
{ 
public: 
    Rectangle(void) 
    { 
        printf("\t\tRectangle Default Constructor\n"); 
    } 
    void CheckValidation() 
    { 
        printf("\t\tRectangle CheckValidation Method\n"); 
    } 
};

class Label 
    :public Rectangle, 
    public Drawable 
{ 
public: 
    Label(void) 
    { 
        printf("Label Default Constructor\n"); 
    } 
    void CheckValidation() 
    { 
        printf("\t\t\tLabel CheckValidation Method\n"); 
    } 
};

int main() 
{ 
    Label lblHello; 
    lblHello.CheckValidation(); 
    // lblHello.WriteInfo(); //Diamond Problem

    return 0; 
}&lt;/pre&gt;
&lt;p&gt;Şekilden de g&amp;ouml;r&amp;uuml;leceği &amp;uuml;zere &lt;strong&gt;Label&lt;/strong&gt; isimli sınıf iki sınıftan birden t&amp;uuml;retilmektedir. Bunlar &lt;strong&gt;Rectangle&lt;/strong&gt; ve &lt;strong&gt;Drawable&lt;/strong&gt; isimli sınıflardır. S&amp;ouml;z konusu iki sınıfta tekil bir kalıtım ile &lt;strong&gt;BaseObject&lt;/strong&gt; sınıfından t&amp;uuml;remektedir. &lt;strong&gt;BaseObject&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde &lt;strong&gt;virtual&lt;/strong&gt; olarak tanımlanmış iki fonksiyon yer almaktadır. Bunlardan &lt;strong&gt;CheckValidation&lt;/strong&gt; metodu, &lt;strong&gt;Rectangle&lt;/strong&gt; tipi i&amp;ccedil;erisinde &lt;strong&gt;ezilmiştir(override)&lt;/strong&gt;. Diğer &lt;strong&gt;WriteInfo&lt;/strong&gt; metodu da &lt;strong&gt;Drawable&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde ezilmiştir. Benzer şekilde &lt;strong&gt;Label&lt;/strong&gt; isimli sınıfta &lt;strong&gt;CheckValidation&lt;/strong&gt; metodunu ezmektedir. Kodu bu şekilde &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;ları alırız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg226_Runtim1.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg226_Runtim1" src="/pics/blg226_Runtim1_thumb.gif" alt="blg226_Runtim1" width="436" height="122" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil;lar gayet normaldir. &lt;strong&gt;Label&lt;/strong&gt; tipine ait bir nesnenin kullanılması, t&amp;uuml;retildiği &lt;strong&gt;Drawable&lt;/strong&gt; ve &lt;strong&gt;Rectangle&lt;/strong&gt; sınıfılarının &amp;ouml;rneklenmesine neden olmaktadır. Bu sınıflarda hiyerarşiye g&amp;ouml;re &lt;strong&gt;BaseObject&lt;/strong&gt; tipinden t&amp;uuml;redikleri i&amp;ccedil;in her birisi adına birer &lt;strong&gt;BaseObject&lt;/strong&gt; &amp;ouml;rneği &amp;uuml;retilmektedir. &lt;strong&gt;Label&lt;/strong&gt; &amp;ouml;rneği &amp;uuml;zerinden &amp;ccedil;ağırılan &lt;strong&gt;CheckValidation&lt;/strong&gt; metodu, &lt;strong&gt;override&lt;/strong&gt; edilmiş olması nedeniyle &amp;uuml;st tip yerine &lt;strong&gt;Label&lt;/strong&gt; i&amp;ccedil;erisinden y&amp;uuml;r&amp;uuml;t&amp;uuml;lm&amp;uuml;şt&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;Sıkıntı ise &lt;strong&gt;main&lt;/strong&gt; metodu i&amp;ccedil;erisinde &lt;strong&gt;bold&lt;/strong&gt; olarak işaretlemiş olduğumuz satırı etkinleştirdiğimizde meydana gelmektedir. Burada &lt;strong&gt;Label&lt;/strong&gt; tipinden &lt;strong&gt;lblHello&lt;/strong&gt; değişkeni kullanılarak &lt;strong&gt;WriteInfo&lt;/strong&gt; metodunun &amp;ccedil;ağırıldığı g&amp;ouml;r&amp;uuml;lmektedir. Ne varki &lt;strong&gt;Label&lt;/strong&gt; sınıfı s&amp;ouml;z konusu metodu &lt;span style="text-decoration: underline;"&gt;ezmemiştir&lt;/span&gt;. &lt;strong&gt;WriteInfo&lt;/strong&gt; metodu &lt;span style="text-decoration: underline;"&gt;ezilmemekle&lt;/span&gt; birlikte t&amp;uuml;rediği iki &amp;uuml;st sınıf i&amp;ccedil;erisinde de ezilmiştir. Bu durumda kod hangi &amp;uuml;st &lt;strong&gt;WriteInfo&lt;/strong&gt; metodunu &amp;ccedil;ağıracağına karar verememektedir. Dolayısıyla derleme zamanının kafası karışmıştır &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt; Buna g&amp;ouml;re yorum satırı a&amp;ccedil;ıldığında aşağıdaki hata mesajının alındığı g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg226_BuildError.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg226_BuildError" src="/pics/blg226_BuildError_thumb.gif" alt="blg226_BuildError" width="457" height="280" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Tabi bu durumun &lt;strong&gt;C++&lt;/strong&gt; tarafında &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; vardır. &lt;strong&gt;Virtual Inheritance&lt;/strong&gt; kullanılarak bu sorun &amp;ccedil;&amp;ouml;z&amp;uuml;lebilir. Yani kodda &lt;strong&gt;virtual public&lt;/strong&gt; ile başlayan yorum satırlarını t&amp;uuml;retme i&amp;ccedil;in kullandığımızda &lt;strong&gt;Label&lt;/strong&gt; nesne &amp;ouml;rneği &amp;uuml;zerinde &amp;ccedil;ağırılan &lt;strong&gt;WriteInfo&lt;/strong&gt; metodunun, &lt;strong&gt;Drawable&lt;/strong&gt; tipi i&amp;ccedil;erisinde ezilmiş olan versiyonuna gittiği g&amp;ouml;r&amp;uuml;lecektir ki buna g&amp;ouml;re &amp;ccedil;ıktı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg226_Runtime2.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg226_Runtime2" src="/pics/blg226_Runtime2_thumb.gif" alt="blg226_Runtime2" width="435" height="120" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Yasağın bir nedenini &amp;ouml;ğrenmiş olduk. Tabi bu &amp;ouml;rnekteki gibi 4 sınıfın işin i&amp;ccedil;erisine girdiği senaryolarda bu pek bir sorun olarak g&amp;ouml;r&amp;uuml;lmeyebilir. Ancak sınıf ve t&amp;uuml;retme dallarının arttığı, &amp;uuml;ye sayısının fazlalaştığı hallerde &lt;strong&gt;Diamond Problem &lt;/strong&gt;&amp;ouml;nemli bir sıkıntı haline gelecektir. Şimdi tekrar &lt;strong&gt;Managed&lt;/strong&gt; ortama d&amp;ouml;nelim ve &lt;strong&gt;C#&lt;/strong&gt; tarafında aşağıdaki gibi geliştirme yapmış olduğumuzu varsayalım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg226_CSharpDiagram1.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg226_CSharpDiagram1" src="/pics/blg226_CSharpDiagram1_thumb.gif" alt="blg226_CSharpDiagram1" width="592" height="407" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace MultipleInheritanceTrick 
{ 
    class WebControl 
    { 
        public int ControlId { get; set; }

        public void Render(string objectName) 
        { 
            Console.WriteLine("WriteInfo {0}", objectName); 
        } 
    } 
    class EventControl 
    { 
        public string EventName { get; set; }

        public void FireEvent(string objectInformation) 
        { 
            Console.WriteLine("ReadInfo {0}", objectInformation); 
        } 
    }

    class Button 
       :WebControl        
    { 
        public void Validate() 
        { 
            Console.WriteLine("Derived.Validate"); 
        } 
    }

    class Program 
    { 
        static void Main(string[] args) 
        { 
            Button helloBtn=new Button(); 
            //helloBtn.FireEvent("Common Informations"); 
            helloBtn.Render("Person"); 
            helloBtn.Validate(); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Burada &lt;strong&gt;WebControl&lt;/strong&gt; tipinden t&amp;uuml;reyen &lt;strong&gt;Button&lt;/strong&gt; isimli bir sınıf olduğunu g&amp;ouml;rmekteyiz. Aslında bu sınıfın &lt;strong&gt;EventControl&lt;/strong&gt; sınıfından da t&amp;uuml;remesi iyi olabilirdi. Nitekim bu durumda &lt;strong&gt;Button&lt;/strong&gt; sınıfı &amp;uuml;zerinden veya i&amp;ccedil;erisinden &lt;strong&gt;WebControl&lt;/strong&gt; sınıfındaki &lt;strong&gt;Render&lt;/strong&gt; ve &lt;strong&gt;EventControl&lt;/strong&gt; sınıfındaki &lt;strong&gt;FireEvent&lt;/strong&gt; metodlarına &amp;ccedil;ağrıda bulunabilirdik. Ancak bildiğimiz &amp;uuml;zere &lt;strong&gt;Button&lt;/strong&gt; sınıfını hem &lt;strong&gt;WebControl&lt;/strong&gt; hem de &lt;strong&gt;EventControl&lt;/strong&gt; tipinden t&amp;uuml;retmeye &amp;ccedil;alışmamız aşağıdaki gibi sonu&amp;ccedil;lanacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg226_BuildError2.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg226_BuildError2" src="/pics/blg226_BuildError2_thumb.gif" alt="blg226_BuildError2" width="399" height="168" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Peki kurallar biraz olsun esnetilebilir mi? &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Yani bir şekilde &lt;strong&gt;EventControl&lt;/strong&gt; ve &lt;strong&gt;WebControl&lt;/strong&gt; tipi &amp;uuml;zerinden izin verilen fonksiyonların &lt;strong&gt;Button&lt;/strong&gt; tipine ait bir nesne &amp;ouml;rneği &amp;uuml;zerinden &amp;ccedil;ağırılması sağlanabilir mi? Bu konuda Internet &amp;uuml;zerinden araştırma yaptığınız takdirde genellikle &lt;strong&gt;LINQ&lt;/strong&gt; tarafında &amp;ccedil;ok &amp;ouml;nemli bir yere de sahip olan &lt;strong&gt;Extension Method&lt;/strong&gt;&amp;rsquo; ların g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığını fark edebilirsiniz. &amp;Ouml;rneğin &lt;strong&gt;Miguel A. Castro&lt;/strong&gt; bir blog yazısında bu durumu ele almıştır.&lt;/p&gt;
&lt;p&gt;Bilindiği &amp;uuml;zere &lt;strong&gt;Extension Method&lt;/strong&gt;&amp;rsquo; lar sayesinde tiplerin fonksiyonel olarak genişletilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Hatta burada &lt;strong&gt;sealed&lt;/strong&gt; gibi işaretlenmiş veya kendi kontrol&amp;uuml;m&amp;uuml;zde olmayan tiplerin ya da t&amp;uuml;retilemeyen tiplerin genişletilebilirliği de s&amp;ouml;z konusudur. Diğer yandan &lt;strong&gt;C#&lt;/strong&gt; tarafında her ne kadar sınıf seviyesinde &amp;ccedil;oklu kalıtıma izin verilmese de, bu bir sınıfı birden fazla &lt;strong&gt;Interface&lt;/strong&gt; tipinden t&amp;uuml;retemeyeceğimiz anlamına da gelmemelidir.&lt;/p&gt;
&lt;p&gt;Zaten&lt;strong&gt; C#&lt;/strong&gt; tarafında &amp;ccedil;oklu kalıtım i&amp;ccedil;in &lt;strong&gt;interface&lt;/strong&gt; mantığının kullanılması &amp;ouml;nerilmektedir. Aslında senaryomuzda yer alan sınıfları kendi geliştirdiğimiz tipler olarak d&amp;uuml;ş&amp;uuml;nerek hareket ettiğimizde, i&amp;ccedil;lerindeki bazı metodları &lt;strong&gt;extension&lt;/strong&gt; &lt;strong&gt;method &lt;/strong&gt;olarak dışarıya alıp belirli &lt;strong&gt;interface&lt;/strong&gt; tiplerine uygulatmamız sorunun anahtar &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; olmaktadır. Durumu daha iyi anlayabilmek i&amp;ccedil;in gelin uygulama kodumuzu aşağıdaki hale getirelim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg226_CSharpDiagram2.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg226_CSharpDiagram2" src="/pics/blg226_CSharpDiagram2_thumb.gif" alt="blg226_CSharpDiagram2" width="450" height="318" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace MultipleInheritanceTrick 
{ 
    interface IWebControl 
    { 
    } 
    interface IEventControl 
    { 
    } 
    class WebControl 
    { 
        public int ControlId { get; set; } 
    } 
    class EventControl 
    { 
        public string EventName { get; set; } 
    } 
    static class WebControlExtensions 
    { 
        public static void Render(this IWebControl wCtrl, string objectName) 
        { 
            Console.WriteLine("WriteInfo {0}", objectName); 
        } 
    } 
    static class EventControlExtensions 
    { 
        public static void FireEvent(this IEventControl eCtrl, string objectInformation) 
        { 
            Console.WriteLine("ReadInfo {0}", objectInformation); 
        } 
    }

    class Button 
        :IWebControl,IEventControl 
    { 
        public void Validate() 
        { 
            Console.WriteLine("Derived.Validate"); 
        } 
    }

    class Program 
    { 
        static void Main(string[] args) 
        { 
            Button helloBtn=new Button(); 
            helloBtn.FireEvent("Common Informations"); 
            helloBtn.Render("Person"); 
            helloBtn.Validate(); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Render&lt;/strong&gt; ve &lt;strong&gt;FireEvent&lt;/strong&gt; isimli metodlar bulundukları sınıflardan &amp;ccedil;ıkartılarak &lt;strong&gt;Extension Method&lt;/strong&gt; haline getirilmiştir. &lt;strong&gt;Render&lt;/strong&gt; metodu &lt;strong&gt;IWebControl&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;ne uygulanırken, &lt;strong&gt;FireEvent&lt;/strong&gt; metodu da &lt;strong&gt;IEventControl&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;ne uygulanmaktadır. Tesad&amp;uuml;fe bakın ki, &lt;strong&gt;Button&lt;/strong&gt; tipimizde hem &lt;strong&gt;IWebControl&lt;/strong&gt; hem de &lt;strong&gt;IEventControl&lt;/strong&gt; aray&amp;uuml;zlerinden t&amp;uuml;remektedir &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt; Bu sebepten dolayı her iki aray&amp;uuml;z i&amp;ccedil;in de ge&amp;ccedil;erli olan genişletme metodlarını &amp;ccedil;ağırabilecek şekilde tasarlanmış hale geldiğini s&amp;ouml;yleyebiliriz. İşte size &amp;ccedil;akma &amp;ccedil;oklu kalıtım &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Bu durumda uygulama kodunun &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı da aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg226_Runtime3.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg226_Runtime3" src="/pics/blg226_Runtime3_thumb.gif" alt="blg226_Runtime3" width="295" height="88" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Tabi bu tekniğin de bazı eksik y&amp;ouml;nleri ve handikapları vardır. Herşeyden &amp;ouml;nce &lt;strong&gt;extension method&lt;/strong&gt; yazılması gerekmiştir ve s&amp;ouml;z konusu teknik bu sebepten sadece metodlara uygulanabilmektedir. Yani&lt;strong&gt; &amp;ouml;zellikler(Properties)&lt;/strong&gt; i&amp;ccedil;in ge&amp;ccedil;erli değildir. Tabi ilerleyen&lt;strong&gt; C#&lt;/strong&gt; s&amp;uuml;r&amp;uuml;mlerinde belki de&lt;strong&gt; Extension Property&lt;/strong&gt; kavramı ile karışaşabiliriz, bilemiyorum &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Okuyan arkadaşlarımız kadar benim i&amp;ccedil;inde enteresan bir yazı olduğunu ifade etmek isterim. Ancak bu yazımızda en azından &lt;strong&gt;C++&lt;/strong&gt; tarafında bilinen &lt;strong&gt;Diamond&lt;/strong&gt; sorunsalına bakarak&lt;strong&gt; C#&lt;/strong&gt; tarafına getirilen &amp;ccedil;oklu kalıtım yasağı i&amp;ccedil;in bir sebep bulduğumuzu d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Diğer yandan &lt;strong&gt;Extension Method&lt;/strong&gt; ve &lt;strong&gt;Interface&lt;/strong&gt;&amp;rsquo; leri kullanarak &amp;ccedil;oklu kalıtımın farklı bir şekilde nasıl ger&amp;ccedil;ekleştirilebileceğini de g&amp;ouml;rm&amp;uuml;ş olduk. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f9%2fDiamondProblem.rar"&gt;DiamondProblem.rar (2,00 mb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2010-09-15 06:28:00</pubDate>
  <slug>Diamond-Problem-C-ve-Multiple-Inheritance</slug>
  <tags>
    <tag>c#</tag>
    <tag>c++</tag>
    <tag>inheritance</tag>
    <tag>multiple-inheritance</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>