<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Windows Workflow Foundation 4.0 - İlk İzlenimler</title>
  <description>Bundan sadece bir kaç sene önce .Net Framework 3.0 versiyonu ile birlikte iş akışlarının(Workflows) kod içerisinde modellenerek farklı uygulamalarda kullanılabilmesini sağlamak amacıyla Windows Workflow Foundation(WWF) alt yapısı duyurulmuştu. Paralelinde ise, Servis Odaklı Mimarilere(Service Oriented Architecture) yeni bir yaklaşım, Windows Communication Foundation(WCF) ile birlikte getirilmişti. Workflow Foundation her ne kadar iş akışlarının(çoğu zaman kod akışlarının) kendi içinde modellenmesini sağlasa da, zaman içerisinde dış ortamlar ile olan haberleşmesinde WCF ile birlikte hareket etmeye başlamıştır.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bundan sadece bir ka&amp;ccedil; sene &amp;ouml;nce &lt;strong&gt;.Net Framework 3.0&lt;/strong&gt; versiyonu ile birlikte iş akışlarının(Workflows) kod i&amp;ccedil;erisinde modellenerek farklı uygulamalarda kullanılabilmesini sağlamak amacıyla &lt;strong&gt;Windows Workflow Foundation(WWF)&lt;/strong&gt; alt yapısı duyurulmuştu. Paralelinde ise, &lt;strong&gt;Servis Odaklı Mimarilere(Service Oriented Architecture)&lt;/strong&gt; yeni bir yaklaşım, &lt;strong&gt;Windows Communication Foundation(WCF)&lt;/strong&gt; ile birlikte getirilmişti. &lt;strong&gt;Workflow Foundation &lt;/strong&gt;her ne kadar iş akışlarının&lt;em&gt;(&amp;ccedil;oğu zaman kod akışlarının)&lt;/em&gt; kendi i&amp;ccedil;inde modellenmesini sağlasa da, zaman i&amp;ccedil;erisinde dış ortamlar ile olan haberleşmesinde &lt;strong&gt;WCF&lt;/strong&gt; ile birlikte hareket etmeye başlamıştır. Bu nedenle &lt;strong&gt;.Net Framework 3.5 &lt;/strong&gt;ile birlikte her iki alt yapınında birbirleriyle daha kolay haberleşebilmesi i&amp;ccedil;in bazı eklentiler yapılmıştır.&lt;/p&gt;
&lt;p&gt;Bu genişletmelerden en &amp;ouml;nemlileri &lt;strong&gt;Workflow Activity Library&lt;/strong&gt; i&amp;ccedil;erisine eklenen &lt;strong&gt;SendActivity&lt;/strong&gt; ve &lt;strong&gt;ReceiveActivity&lt;/strong&gt; aktivite tipleridir. B&amp;ouml;ylece bir &lt;strong&gt;Workflow&lt;/strong&gt; uygulamasının servisler yardımıyla dış d&amp;uuml;nya ile &lt;strong&gt;tek y&amp;ouml;nl&amp;uuml;(One-Way)&lt;/strong&gt; mesajlaşabilmesi yada kendi i&amp;ccedil;erisinden dış d&amp;uuml;nyaya servis bazlı operasyonlar sunabilmesi m&amp;uuml;mk&amp;uuml;n hale gelmiştir. Ama belkide en &amp;ouml;nemli genişletme &lt;strong&gt;WorkflowServiceHost&lt;/strong&gt; sınıfıdır. Bu sınıf sayesinde, WF uygulamalarının servis olarak host edilebilmesi, bir başka deyişle &lt;strong&gt;IIS/WAS(Internet Information Services/Windows Process Activation Service)&lt;/strong&gt; i&amp;ccedil;erisinde sunulması m&amp;uuml;mk&amp;uuml;n kılınmaktadır. Sonu&amp;ccedil; olarak artık g&amp;uuml;n&amp;uuml;m&amp;uuml;zde, &lt;strong&gt;Workflow Tabanlı Servisler(Workflow Based Services) &lt;/strong&gt;kavramı hayatımızın bir par&amp;ccedil;ası haline gelmeye başlamıştır. Yinede &amp;ouml;zellikle geliştirici a&amp;ccedil;ısından bakıldığında halen daha eksiklikler bulunmaktadır. &amp;Ouml;zellikle &lt;strong&gt;WF&lt;/strong&gt; ile &lt;strong&gt;WCF&lt;/strong&gt; entegrasyonunda karşılaşılan bu zorlukların &amp;uuml;stesinden gelebilmek i&amp;ccedil;in &lt;strong&gt;.Net Framework 4.0&lt;/strong&gt; i&amp;ccedil;erisinde &amp;ouml;nemli yenilikler bulunmaktadır. İşte bu yazımızda halen son s&amp;uuml;r&amp;uuml;m&amp;uuml; ile yayınlanmamış olsada &lt;strong&gt;WF&lt;/strong&gt; &lt;strong&gt;4.0 &lt;/strong&gt;ile gelmesi muhtemel yeniliklere değinilmeye &amp;ccedil;alışılacaktır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Yazımızda yer alan &amp;ouml;rnekler ve teknik terimlerin &amp;ccedil;oğu PDC 2008' de yayımlanan Virtual PC imajı &amp;uuml;zerinde ger&amp;ccedil;ekleştirilmektedir. Mayıs ayında beta s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml;n yayımlanması planlanan Visual Studio 2010' un ilk g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ele alınmaktadır. Bu nedenle son s&amp;uuml;r&amp;uuml;mler yayımlandıktan sonra makalede yer alan kavramların bir kısmının değiştiği g&amp;ouml;r&amp;uuml;lebilir ve muhtemeldir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;WF&lt;/strong&gt; uygulamaları &lt;strong&gt;3.5&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nde &lt;strong&gt;XAML(eXtensible Application Markup Language)&lt;/strong&gt; yardımıyla yapılabilsede yinede geliştirici a&amp;ccedil;ısından tam anlamıyla oturmuş bir yapı değildi. &amp;Ouml;rneğin debug edilmelerinde sorundu. Ancak &lt;strong&gt;4.0&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nde sadece &lt;strong&gt;XAML&lt;/strong&gt; bazlı &lt;strong&gt;Workflow&lt;/strong&gt; &amp;ouml;rneklerinin geliştirilmesi &amp;ccedil;ok daha kolay bir hale getirilmektedir. Aslında buradaki en b&amp;uuml;y&amp;uuml;k ama&amp;ccedil;lardan biriside, &lt;strong&gt;Workflow tabanlı WCF servislerinin&lt;/strong&gt;, &lt;strong&gt;XAML&lt;/strong&gt; bazlı olaraktan &lt;strong&gt;dekleratif(Declerative) &lt;/strong&gt;tanımlanabilmesinin sağlanmasıdır. Dekleratif şekilde yapılan tanımlamalar, kodlamaya girmeden &amp;ccedil;alışma zamanında bazı değişikliklerin kolayca yapılabilmesini sağlamaktadır. Dolayısıyla &lt;strong&gt;4.0&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nde &lt;strong&gt;WF&lt;/strong&gt; tarafında ve &lt;strong&gt;WCF&lt;/strong&gt; tarafında &lt;strong&gt;XAML&lt;/strong&gt; yapısını &amp;ccedil;ok daha yaygın bir şekilde g&amp;ouml;r&amp;uuml;yor ve kullanıyor olacağız.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;XAML&lt;/strong&gt; tabanlı bu i&amp;ccedil;erikler herhangibir depolama alanında&lt;em&gt;(Muhtemelen &lt;strong&gt;Oslo&lt;/strong&gt; kod adlı yapının değerlendireceği &lt;strong&gt;saklama-Repository&lt;/strong&gt; alanlarında)&lt;/em&gt; saklanabileceği gibi, &amp;ccedil;alışma zamanına devredilerek y&amp;uuml;r&amp;uuml;t&amp;uuml;lebileceklerde. Yani bir WF uygulamasının&lt;em&gt;(hatta bir WCF servisinin ve &amp;ccedil;ok doğal olarak bir Workflow servisinin)&lt;/em&gt; bulunduğu ortamdan &lt;strong&gt;Export&lt;/strong&gt; edilerek başka bir platforma taşınması ve orada &lt;strong&gt;Import&lt;/strong&gt; edilerek y&amp;uuml;r&amp;uuml;t&amp;uuml;lmeye başlanması m&amp;uuml;mk&amp;uuml;n olabilecek. Diğer taraftan depolanarak saklanan bu &lt;strong&gt;Workflow Servislerinin&lt;/strong&gt; veya diğer &lt;strong&gt;WCF&lt;/strong&gt; servislerinin kolayca &lt;strong&gt;y&amp;ouml;netilebilmesi(Management)&lt;/strong&gt; i&amp;ccedil;inde &lt;strong&gt;Dublin(Windows Application Server)&lt;/strong&gt; kod adlı bir &amp;ccedil;alışma y&amp;uuml;r&amp;uuml;t&amp;uuml;lmektedir. Bu sunucu ve &lt;strong&gt;IIS&lt;/strong&gt;' e gelen eklentiler sayesinde, servislerin kolay bir şekilde &lt;strong&gt;Import/ Export&lt;/strong&gt; edilmesi, izlenebilmesi&lt;strong&gt;(Tracking)&lt;/strong&gt;, durumlarının denetlenmesi&lt;strong&gt;(Monitoring)&lt;/strong&gt; gibi Admin seviyesindeki işlemler kolaylıkla ger&amp;ccedil;ekleştirilebilecektir. Tabiki bu konular ile ilişkili detayları &amp;ouml;n&amp;uuml;m&amp;uuml;zdeki zamanlarda işlemeye &amp;ccedil;alışıyor olacağız. &lt;strong&gt;XAML&lt;/strong&gt; tabanlı &lt;strong&gt;WF&lt;/strong&gt; &amp;ouml;rnekleri, &lt;strong&gt;4.0 &lt;/strong&gt;ile gelen yeniliklerden sadece bir tanesi. Bunun dışında aşağıdaki şekildende g&amp;ouml;rebileceğiniz gibi pek &amp;ccedil;ok yeni aktivite tipi ile karşı karşıyayız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk271_1.gif" alt="" width="256" height="439" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere pek &amp;ccedil;ok farklı aktivite tipi yer almakta. Bu şekilde altı mavi &amp;ccedil;izgi ile işaretlenmiş olan aktiviteler&lt;em&gt;(veya Workflow elementleri)&lt;/em&gt; &lt;strong&gt;WCF&lt;/strong&gt; odaklı bileşenlerdir. &amp;Ouml;rneğin &lt;strong&gt;ClientOperation&lt;/strong&gt; bileşeni ile, bir &lt;strong&gt;WCF&lt;/strong&gt; operasyonunu &lt;strong&gt;SendMessage/ReceiveMessage&lt;/strong&gt; yapısına uygun olacak şekilde &amp;ccedil;ağırmak m&amp;uuml;mk&amp;uuml;n olmaktadır. &lt;strong&gt;ServiceOperation&lt;/strong&gt; bileşeni ile &lt;strong&gt;WF&lt;/strong&gt; i&amp;ccedil;erisinden dışaryı bir &lt;strong&gt;WCF&lt;/strong&gt; operasyonu(Operation) yine &lt;strong&gt;SendMessage/ReceiveMessage&lt;/strong&gt; yapısına uygun olaraktan sunulabilmektedir. &lt;strong&gt;SendMessage&lt;/strong&gt; aynen &lt;strong&gt;3.5&lt;/strong&gt;' teki &lt;strong&gt;SendActivity&lt;/strong&gt; aktivitesine benzer olacak şekilde &lt;strong&gt;tek y&amp;ouml;nl&amp;uuml; mesaj(One Way Message) &lt;/strong&gt;g&amp;ouml;nderilmesinde kullanılır. Tahmin edileceği &amp;uuml;zere &lt;strong&gt;ReceiveMessage&lt;/strong&gt; bileşenide tek y&amp;ouml;nl&amp;uuml; olaraktan &lt;strong&gt;WCF&lt;/strong&gt; mesajlarının alınmasında kullanılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF&lt;/strong&gt; tabanlı &amp;ouml;rnek bu bileşenler dışında dikkat &amp;ccedil;ekici noktalardan biriside &lt;strong&gt;FlowChart&lt;/strong&gt; aktivite tipidir. Bu bileşen yardımıyla akış diagramı mantığında basit karar yapıları ve anahtar adımlar ile s&amp;uuml;re&amp;ccedil;lerin kolayca tasarlanması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Geliştiriciler a&amp;ccedil;ısından &amp;ccedil;ok yaygın olarak kullanılabilecek bir akış tipidir. Bu akış tipi &lt;strong&gt;Sequential&lt;/strong&gt; ve &lt;strong&gt;State&lt;/strong&gt; &lt;strong&gt;Machine&lt;/strong&gt; aktivite tiplerinin bazı yanlarını kendi i&amp;ccedil;erisinde barındırmaktadır. Buna ek olarak &amp;ouml;rneğin &lt;strong&gt;Assign&lt;/strong&gt; bileşeni ile &lt;strong&gt;workflow&lt;/strong&gt; seviyesindeki bir değişkene değer atanması sağlanabilir. İlgi &amp;ccedil;ekici diğer aktiviteler ise &lt;strong&gt;DbQuery'1&lt;/strong&gt;, &lt;strong&gt;DbUpdate&lt;/strong&gt; ve &lt;strong&gt;Persist&lt;/strong&gt; bileşenleridir.&lt;/p&gt;
&lt;p&gt;Aslında &lt;strong&gt;DbQuery'1&lt;/strong&gt; bileşeni yardımıyla &lt;strong&gt;SQL&lt;/strong&gt; sorgularının &amp;ccedil;alıştırılması ve &lt;strong&gt;DbUpdate&lt;/strong&gt; ile veri kaynağına doğru g&amp;uuml;ncelleştirmelerin yapılması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bu belki &amp;ccedil;ok ekstra bir &amp;ouml;zellikmiş gibi gelmeyebilir ama &amp;ouml;nemli olan nokta s&amp;ouml;z konusu aktivitelere ait ayarlamaların dekleratif olarak&lt;em&gt;(yani XAML bazlı)&lt;/em&gt; yapılabilmesidir. &lt;strong&gt;Persist&lt;/strong&gt; bileşeni ise, &lt;strong&gt;Workflow&lt;/strong&gt;' un herhangibir noktasında &lt;strong&gt;persistence&lt;/strong&gt; hizmetinin devreye alınarak akışın uzun s&amp;uuml;reliğine korunabilmesini sağlamaktadır ki &lt;strong&gt;Long Running Workflow Service&lt;/strong&gt; tipleri i&amp;ccedil;in &amp;ouml;nemli bir &amp;ouml;zelliktir. Bunu 3.5 versiyonunda kod yardımıyla yaptığımız d&amp;uuml;ş&amp;uuml;n&amp;uuml;l&amp;uuml;rse bir aktivite bileşeninin olması geliştirime safhasını kolaylaştırmakta ve y&amp;ouml;netimi dahada g&amp;uuml;&amp;ccedil;lendirmektedir. &lt;em&gt;(Bu aktivite tiplerini ve nasıl kullanıldıklarını ilerleyen g&amp;ouml;rsel derslerimizde ele almaya &amp;ccedil;alışıyor olacağım)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Gelelim aktivite k&amp;uuml;t&amp;uuml;phanesine. Artık aktivitelerimiz &lt;strong&gt;WorkflowElement&lt;/strong&gt; isimli yeni bir tipten t&amp;uuml;retilmektedir. Bir başka deyişle &lt;strong&gt;Base Activity Library&lt;/strong&gt;' de yer &lt;strong&gt;WF&lt;/strong&gt; elementlerin ata sınıfı &lt;strong&gt;WorkflowElement&lt;/strong&gt; tipi olmaktadır. Yine &lt;strong&gt;Visual&lt;/strong&gt; &lt;strong&gt;Studio&lt;/strong&gt; &lt;strong&gt;2010&lt;/strong&gt; &lt;strong&gt;Object&lt;/strong&gt; &lt;strong&gt;Browser&lt;/strong&gt;' dan alınan ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde bu durum aşağıdaki şekildende g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi tespit edilebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk271_2.gif" alt="" width="612" height="520" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;DbQuery&lt;/strong&gt; aktivitesi, &lt;strong&gt;Activity&lt;/strong&gt; tipinden t&amp;uuml;remiş olmasına rağmen, &lt;strong&gt;Activity&lt;/strong&gt; tipinin kendisi &lt;strong&gt;WorkflowElement&lt;/strong&gt; tipinden t&amp;uuml;rediği i&amp;ccedil;in dolaylı olarak bir &lt;strong&gt;WorkflowElement&lt;/strong&gt;' tir. &lt;strong&gt;Assign&lt;/strong&gt; bileşeni ise doğrudan &lt;strong&gt;WorkflowElement&lt;/strong&gt; tipinden t&amp;uuml;remektedir. Burada aslında &amp;ouml;nemli bir noktayı daha vurgulamak gerekiyor. Eğer var olan bir aktivite t&amp;uuml;r&amp;uuml;nden genişletme yapılarak yeni bir bileşen &amp;uuml;retilecekse, &lt;strong&gt;Activity&lt;/strong&gt; tipinden t&amp;uuml;retilme yapılması ve bu yeni sınıf i&amp;ccedil;erisinde, geriye &lt;strong&gt;WorkflowElement&lt;/strong&gt; referansı d&amp;ouml;nd&amp;uuml;ren &lt;strong&gt;CreateBody&lt;/strong&gt; metodunun ezilmesi(override) &amp;ouml;nerilmektedir. Aynen aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk271_3.gif" alt="" width="529" height="484" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Diğer taraftan eğer sıfırdan bir aktivite tipi tasarlanacaksa &lt;strong&gt;WorkflowElement&lt;/strong&gt; tipinden t&amp;uuml;retip &lt;strong&gt;Execute&lt;/strong&gt; metodunun &lt;strong&gt;override&lt;/strong&gt; edilmesi gerekmektedir. &lt;strong&gt;WorkflowElement&lt;/strong&gt; aslında &lt;strong&gt;abstract&lt;/strong&gt; bir sınıf ve &lt;strong&gt;Execute&lt;/strong&gt; metodu &lt;strong&gt;abstract&lt;/strong&gt; olarak tanımlanmıştır. Bu nedenle &lt;strong&gt;implemente&lt;/strong&gt; eden tip i&amp;ccedil;erisinde &lt;strong&gt;Execute&lt;/strong&gt; metodunun mutlaka ezilmesi şarttır.&lt;em&gt;(&lt;strong&gt;C# Object Oriented&lt;/strong&gt; kurallarını hatırlayalım)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk271_4.gif" alt="" width="624" height="392" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Execute&lt;/strong&gt; metodu parametre olarak &lt;strong&gt;ActivityExecutionContext&lt;/strong&gt; tipinden bir referans değeri almaktadır. Bu sayede s&amp;ouml;z konusu aktivitenin &amp;ccedil;alışma zamanında i&amp;ccedil;inde bulunduğu &lt;strong&gt;Activite&lt;/strong&gt; ile konuşabilmesi m&amp;uuml;mk&amp;uuml;n olmaktadır. Aktivite tasarlanması ile ilişkili &amp;ouml;nemli noktalardan biriside dış ortama değişken aktarımı veya tam tersidir. Bu noktada &lt;strong&gt;InArgument&amp;lt;T&amp;gt;&lt;/strong&gt; ve &lt;strong&gt;OutArgument&amp;lt;T&amp;gt;&lt;/strong&gt; tiplerinden yararlanılarak, aktivite i&amp;ccedil;erisine veri girişi veya aktiviteden dış ortama veri &amp;ccedil;ıkışı sağlanabilmektedir. Biraz sonra geliştireceğimiz &amp;ouml;rneğimizde iki &amp;ouml;zel aktivite tipi yazarken bu &lt;strong&gt;generic&lt;/strong&gt; sınıflardan yararlanılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WF 4.0&lt;/strong&gt; akışlarının kolay bir şekilde tasarlanabilmesi i&amp;ccedil;in &lt;strong&gt;Visual Studio 2010&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt;WPF(Windows Presentation Foundation) &lt;/strong&gt;tabanlı bir aray&amp;uuml;z sunulmaktadır. Bu aray&amp;uuml;z sayesinde akışların daha zengin bir g&amp;ouml;rsellikle hazırlanması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. S&amp;ouml;z gelimi &lt;strong&gt;zoom&lt;/strong&gt; &amp;ouml;zelliği ile b&amp;uuml;y&amp;uuml;k akışların ekran i&amp;ccedil;erisinde daha verimli şekilde g&amp;ouml;r&amp;uuml;lebilmesi sağlanmaktadır. Zannediyorum aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde bu durumun kafamızda biraz daha netleşmesi i&amp;ccedil;in yeterlidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk271_5.gif" alt="" width="568" height="520" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat &amp;ccedil;ekici noktalardan bir diğeride &amp;ouml;rnekte yer alan ProductActivity bileşeni yanında bir &lt;strong&gt;Breakpoint&lt;/strong&gt; yer almasıdır. Dolayısıyla &lt;strong&gt;debug&lt;/strong&gt; işlemleri i&amp;ccedil;in &lt;strong&gt;Workflow&lt;/strong&gt; elementlerinin kendisinin &lt;strong&gt;designer&lt;/strong&gt; i&amp;ccedil;erisinde doğrudan işaretlenebildiğini s&amp;ouml;yleyebiliriz. Diğer dikkat &amp;ccedil;ekici kısımda sol alt tarafta yer alan &lt;strong&gt;Arguments&lt;/strong&gt; ve &lt;strong&gt;Variables&lt;/strong&gt; b&amp;ouml;l&amp;uuml;mleridir. Bug&amp;uuml;n yazımızda &lt;strong&gt;Variables&lt;/strong&gt; kısmını kullanarak Sequence aktivitesinin tamamını ilgilendiren değişkenlerin nasıl tanımlanabileceğini ve kullanılabileceğinide g&amp;ouml;rm&amp;uuml;ş olacağız. &amp;Ouml;nemli noktalarda biriside Arguments veya Variables gibi b&amp;ouml;l&amp;uuml;mler ile Workflow i&amp;ccedil;erisinde &amp;ccedil;eşitli tanımlamaların koda girmeye gerek duymadan kolay bir şekilde g&amp;ouml;rsel olarak yapılabilmesidir. &lt;em&gt;(Designer tarafının kullanımını daha kolay kavramak i&amp;ccedil;in yayınlanacak g&amp;ouml;rsel derslerimizi takip etmenizi &amp;ouml;neririm.)&lt;/em&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Variables ve Arguments;&lt;/p&gt;
&lt;p&gt;WF 4.0' da Variables kavramı verinin depolanmasını ifade eder. Değişkenler(Variables) Workflow' un(yada Activity bileşeninin) &amp;ccedil;alışma zamanı &amp;ouml;rneği boyunca veri depolamak amacıyla kullanılırlar. Tanımlanırken adları ve tipleri belirtilir. Yaşamları, Workflow veya Activity &amp;ouml;rneğinin bellekte kaldığı s&amp;uuml;re boyunca ge&amp;ccedil;erlidir. Yani Workflow sonlandığında veya Activity bileşeni &amp;ccedil;alışmasını tamamladığında referansları bellekten kaldırılmaktadır.&lt;br /&gt;&lt;br /&gt;Arguments kavramı ise verinin aktivite i&amp;ccedil;erisine veya aktivite i&amp;ccedil;erisinden dışarıya aktarılması anlamında kullanılmaktadır. Her arg&amp;uuml;manın bir y&amp;ouml;n&amp;uuml;(Direction) vardır.(Input, Output, Input/Output) Arg&amp;uuml;manlar aktivite i&amp;ccedil;erisinde tanımlanırken InArgument&amp;lt;T&amp;gt;, OutArgument&amp;lt;T&amp;gt; veya InOutArgument&amp;lt;T&amp;gt; tipinden tanımlanırlar. T ile kullanılacak verinin tipi belirtlir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Dilerseniz basit bir &amp;ouml;rnek geliştirerek yenilikleri daha yakından tanımaya &amp;ccedil;alışalım. &amp;Ouml;ncelikle &lt;strong&gt;Visual Studio 2010&lt;/strong&gt; ortamında &lt;strong&gt;.Net Framework 4.0&lt;/strong&gt; şablonunda bir &lt;strong&gt;Activity&lt;/strong&gt; &lt;strong&gt;Library&lt;/strong&gt; geliştirerel işe başlayacağız. Bu k&amp;uuml;t&amp;uuml;phane &amp;ouml;rneğimizde kullanacağımız &amp;ouml;zel aktivite tiplerini barındırıyor olacak.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk271_6.gif" alt="" width="630" height="292" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından projemize bir adet sınıf ekleyerek devam edebiliriz. Sınıfımız i&amp;ccedil;eriği ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.WorkflowModel;

namespace SampleActiviyLibrary
{
    public class ProductActivity
        :WorkflowElement
    {
        public OutArgument&amp;lt;int&amp;gt; ProductId { get; set; }
        public OutArgument&amp;lt;int&amp;gt; Count { get; set; }

        protected override void Execute(ActivityExecutionContext context)
        {
            Console.WriteLine("ProductId ?");
            ProductId.Set(context, Convert.ToInt32(Console.ReadLine()));
            Console.WriteLine("Requested count ?");
            Count.Set(context, Convert.ToInt32(Console.ReadLine()));
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Burada dikkat edeceğiniz &amp;uuml;zere kod yardımıyla &amp;ouml;zel bir &lt;strong&gt;aktivite tipi(Custom Activity) &lt;/strong&gt; geliştirilmektedir. &lt;strong&gt;ProductActivity&lt;/strong&gt; sınıfı &lt;strong&gt;WorkflowElement&lt;/strong&gt; tipinden t&amp;uuml;remektedir ve i&amp;ccedil;erisinde &lt;strong&gt;OutArgument&amp;lt;int&amp;gt;&lt;/strong&gt; tipinden &lt;strong&gt; ProductId&lt;/strong&gt; ve &lt;strong&gt;Count&lt;/strong&gt; isimli &lt;strong&gt;&amp;ouml;zellikler(Properties)&lt;/strong&gt; yer almaktadır. &lt;strong&gt;Override&lt;/strong&gt; edilen &lt;strong&gt;Execute&lt;/strong&gt; metodu i&amp;ccedil;erisinde, &lt;strong&gt; OutArgument&amp;lt;T&amp;gt;&lt;/strong&gt; tipinin &lt;strong&gt;Set&lt;/strong&gt; metodundan yararlanılarak, &lt;strong&gt; Console&lt;/strong&gt; penceresinden okunan değerlerin &lt;strong&gt;ProductId&lt;/strong&gt; ve &lt;strong&gt;Count&lt;/strong&gt; &amp;ouml;zelliklerine aktarılması sağlanır. &lt;strong&gt;OutArgument&amp;lt;T&amp;gt;&lt;/strong&gt; kullanılması nedeniyle, &amp;ouml;zelliklerin değerleri &lt;strong&gt;ProductActivity&lt;/strong&gt; aktivitesinin kullanıldığın &lt;strong&gt;Workflow&lt;/strong&gt; ortamına aktarılabilmektedir. Yani bu aktivite i&amp;ccedil;erisinde &lt;strong&gt;Console&lt;/strong&gt; penceresinden alınan bir takım değerler&lt;em&gt;(ki bu sadece &amp;ouml;rnek olarak verilmiştir, ger&amp;ccedil;ek hayat senaryolarında bu değerlerin farklı kaynaklardan gelmesi muhtemeldir.)&lt;/em&gt;, aktivitenin kullanıldığı &lt;strong&gt;Workflow&lt;/strong&gt; i&amp;ccedil;eriğine &lt;strong&gt;ProductId&lt;/strong&gt; ve &lt;strong&gt;Count&lt;/strong&gt; isimleriyle taşınabilir. Gelelim ikinci &amp;ouml;zel aktivitemize.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.WorkflowModel;

namespace SampleActiviyLibrary
{
    public class OrderInformationActivity
        :WorkflowElement
    {
        public InArgument&amp;lt;int&amp;gt; OrderedProductId { get; set; }
        public InArgument&amp;lt;int&amp;gt; OrderedProductCount { get; set; }

        protected override void Execute(ActivityExecutionContext context)
        {
            int orderedId=OrderedProductId.Get&amp;lt;int&amp;gt;(context);
            int orderedCount = OrderedProductCount.Get&amp;lt;int&amp;gt;(context);

            // TODO: Mail g&amp;ouml;nderme işlemleri.
            Console.WriteLine("{0} numaralı &amp;uuml;r&amp;uuml;nden {1} adet siparis edilmistir",orderedId,orderedCount);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;OrderInformationActivity&lt;/strong&gt; bileşenide &lt;strong&gt;ProductActivity&lt;/strong&gt; sınıfı gibi &lt;strong&gt;WorkflowElement&lt;/strong&gt; tipinden t&amp;uuml;remektedir. Ancak bu kez &lt;strong&gt;InArgument&amp;lt;int&amp;gt;&lt;/strong&gt; tipinden &lt;strong&gt; OrderedProductId&lt;/strong&gt; ve &lt;strong&gt;OrderedProductCount&lt;/strong&gt; isimli &amp;ouml;zellikler kullanılmaktadır. Yani, &lt;strong&gt;Workflow&lt;/strong&gt; i&amp;ccedil;erisinden bu aktiviteye, InArgument&amp;lt;T&amp;gt; tipinden tanımlanan &amp;ouml;zellikler &amp;uuml;zerinden veri taşınabilir. Girilen değerlerin &lt;strong&gt;Execute&lt;/strong&gt; metodu i&amp;ccedil;erisinde elde edilişi sırasında &lt;strong&gt; InArgument&amp;lt;T&amp;gt;&lt;/strong&gt; tipinin generic &lt;strong&gt;Get&amp;lt;T&amp;gt;&lt;/strong&gt; metodu kullanılır. Dikkat edileceği &amp;uuml;zere metodlar parametre olarak &lt;strong&gt; ActivityExecutionContext&lt;/strong&gt; tipinden referans almaktadır. Yani, aktivitenin kullanıldığı &lt;strong&gt;Workflow&lt;/strong&gt; ortamına ait bir takım bilgiler&lt;em&gt;(&amp;ouml;rneğin &lt;strong&gt;InstanceId&lt;/strong&gt; gibi)&lt;/em&gt; &lt;em&gt;&lt;strong&gt;Execute&lt;/strong&gt;&lt;/em&gt; metodu i&amp;ccedil;erisinde taşınabilmektedir. Bu aktivite ilede, sembolik olarak &lt;strong&gt;Console&lt;/strong&gt; penceresine sipariş edilen &amp;uuml;r&amp;uuml;n numarası ve miktarı bilgileri yazdırılmakta ve belkide mail g&amp;ouml;nderme işlemleri ger&amp;ccedil;ekleştirilmektedir. &lt;strong&gt;Workflow&lt;/strong&gt; &amp;ouml;rneğimizi tasarlamadan &amp;ouml;nce arada &lt;strong&gt;XAML&lt;/strong&gt; bazlı bir aktivite tipinin nasıl geliştirileceğine de değinmek isterim. Bu ama&amp;ccedil;la &lt;strong&gt;Visual Studio 2010 &lt;/strong&gt;ortamında, projeye &lt;strong&gt;Add New Item&lt;/strong&gt; ile bir &lt;strong&gt;Activity&lt;/strong&gt; &amp;ouml;ğesi aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi eklenir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk271_7.gif" alt="" width="630" height="400" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere aktivitenin uzantısı &lt;strong&gt;XAML&lt;/strong&gt;' dır. Bununla birlikte a&amp;ccedil;ılan pencereden g&amp;ouml;r&amp;uuml;leceği gibi &lt;strong&gt;Activity&lt;/strong&gt; tipi g&amp;ouml;rsel olarak tasarlanabilir. Buradaki aktivitede aslında birde &amp;ouml;zellik tanımlanmaktadır. &lt;strong&gt;DiscountRate&lt;/strong&gt; isimli bu &amp;ouml;zellik &lt;strong&gt;Argument&lt;/strong&gt; penceresi kullanılaraktan aşağıdaki gibi oluşturulmuştur! S&amp;uuml;per.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk271_8.gif" alt="" width="546" height="490" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi herhangibir şekilde kod yazılmamıştır. Ardından tasarım ortamında basit bir &lt;strong&gt;Assign&lt;/strong&gt; bileşeni s&amp;uuml;r&amp;uuml;klenerek, &lt;strong&gt;Discount&lt;/strong&gt; aktivitemizde aşağıda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi kullanılması sağlanmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk271_9.gif" alt="" width="216" height="216" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Assign&lt;/strong&gt; aktivitesinin yaptığı tek şey &lt;strong&gt;DiscountRate&lt;/strong&gt; isimli &amp;ouml;zelliğe sabit bir değerin atanmasının sağlanmasıdır. Ancak burada &amp;ouml;nemli olan noktalar &lt;strong&gt;Discount&lt;/strong&gt; bileşeninin tamamen g&amp;ouml;rsel olarak tasarlanması ve sonucun &lt;strong&gt;XAML&lt;/strong&gt; olarak aşağıdaki gibi &amp;uuml;retilmesidir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;p1:Activity x:Class="SampleActiviyLibrary.Discount" xmlns:p="http://schemas.microsoft.com/netfx/2008/xaml/schema" xmlns:p1="http://schemas.microsoft.com/netfx/2009/xaml/workflowmodel" xmlns:s="clr-namespace:System;assembly=mscorlib" xmlns:swdx="clr-namespace:System.WorkflowModel.Design.Xaml;assembly=System.WorkflowModel.Design" xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml"&amp;gt;
    &amp;lt;p:SchemaType.Members&amp;gt;
        &amp;lt;p:SchemaProperty Name="DiscountRate" Type="s:Decimal" /&amp;gt;
    &amp;lt;/p:SchemaType.Members&amp;gt;
    &amp;lt;p1:Assign&amp;gt;
        &amp;lt;p1:Assign.To&amp;gt;
            &amp;lt;p1:OutArgument x:TypeArguments="s:Decimal"&amp;gt;[DiscountRate]&amp;lt;/p1:OutArgument&amp;gt;
        &amp;lt;/p1:Assign.To&amp;gt;
        &amp;lt;p1:Assign.Value&amp;gt;
            &amp;lt;p1:InArgument x:TypeArguments="p:Double"&amp;gt;[1.12R]&amp;lt;/p1:InArgument&amp;gt;
        &amp;lt;/p1:Assign.Value&amp;gt;
    &amp;lt;/p1:Assign&amp;gt;
&amp;lt;/p1:Activity&amp;gt;&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, tasarım zamanında geliştirdiğimiz bu aktivite tipi &lt;strong&gt;sadece&lt;/strong&gt; &lt;strong&gt;XAML(Only XAML)&lt;/strong&gt; i&amp;ccedil;erikli olacak şekilde &amp;uuml;retilmiştir. İşte &lt;strong&gt;dekleratif&lt;/strong&gt; tanımla dediğimizde tam olarak budur. &amp;Uuml;retilen bu &lt;strong&gt;XAML&lt;/strong&gt; i&amp;ccedil;eriği herhangibir ortamda depolanabilir ve dahada &amp;ouml;nemlisi &lt;strong&gt;WF&lt;/strong&gt; &lt;strong&gt; &amp;ccedil;alışma&lt;/strong&gt; &lt;strong&gt;zamanı&lt;/strong&gt; tarafından y&amp;uuml;r&amp;uuml;t&amp;uuml;lerek başka &lt;strong&gt;Workflow&lt;/strong&gt;' lar tarafından ele alınıp kullanılabilir.&lt;/p&gt;
&lt;p&gt;Bu kısa bilgilerden sonra tekrar &amp;ouml;rneğimize d&amp;ouml;nebiliriz. Artık geliştirdiğimiz &lt;strong&gt;Workflow&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesini basit bir &lt;strong&gt;Sequential&lt;/strong&gt; &lt;strong&gt;Workflow&lt;/strong&gt; &lt;strong&gt;Console&lt;/strong&gt; &lt;strong&gt;Application&lt;/strong&gt; projesinde referans ederek kullanacağız. &lt;strong&gt;Console&lt;/strong&gt; uygulamasına ekleyeceğimiz &lt;strong&gt;ProductOrderFlow.xaml&lt;/strong&gt; isimli aktivite i&amp;ccedil;erisinde bir &lt;strong&gt;Sequence&lt;/strong&gt; bileşeni bulunmaktadır. Bu bileşen i&amp;ccedil;inde ise &amp;uuml;r&amp;uuml;n numarası ve sipariş adedi bilgileri i&amp;ccedil;in iki değişken tanımlanmaktadır. Bu sefer &lt;strong&gt;Variables&lt;/strong&gt; kısmını kullanaraktan aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi gerekli değişkenleri kolayca belirleyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk271_10.gif" alt="" width="566" height="494" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;UrunNo&lt;/strong&gt; ve &lt;strong&gt;SiparisAdedi&lt;/strong&gt; isimli &lt;strong&gt;Int32&lt;/strong&gt; tipinden olan değişkenler &lt;strong&gt;Sequence&lt;/strong&gt; aktivitesi i&amp;ccedil;erisinde tanımlandıklarından, alt aktiviteler tarafındanda erişilip kullanılabilmektedirler. Şimdi Sequence aktivitesi i&amp;ccedil;erisine &amp;ouml;nce &lt;strong&gt; ProductActivity&lt;/strong&gt; sonrada &lt;strong&gt;OrderInformationActivity&lt;/strong&gt; bileşenlerini ekleyeceğiz. &lt;strong&gt;ProductActivity&lt;/strong&gt; bileşeni hatırlayacağınız gibi &lt;strong&gt;Console&lt;/strong&gt; penceresinden okuduğu değerleri &lt;strong&gt; ProductId&lt;/strong&gt; ve &lt;strong&gt;Count&lt;/strong&gt; isimli &lt;strong&gt;output&lt;/strong&gt; &amp;ouml;zelliklerine aktarmaktaydı. Dolayısıyla bu değerleri &lt;strong&gt;Sequence&lt;/strong&gt; i&amp;ccedil;erisinde tanımlanan &lt;strong&gt;UrunNo&lt;/strong&gt; ve &lt;strong&gt;SiparisAdedi&lt;/strong&gt; isimli değişkenler ile eşleştirmemiz m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bunun i&amp;ccedil;in tek yapılması gereken, &lt;strong&gt; ProductActivity&lt;/strong&gt; bileşeninin &amp;ouml;zelliklerinden ilgili atamaların aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi yapılmasıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk271_12.gif" alt="" width="526" height="259" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ProductActivity&lt;/strong&gt; bileşeninin hemen arkasına &lt;strong&gt;OrderInformationActivity&lt;/strong&gt; bileşenini ekleyerek devam edebiliriz. Bu bileşende hatırlayacağınız gibi kullanıldığı ortamdan &lt;strong&gt;girdi(Input) &lt;/strong&gt;değerleri almak &amp;uuml;zere iki &amp;ouml;zelliğe sahiptir. Bu nedenle s&amp;ouml;z konusu aktivitenin &amp;ouml;zelliklerinde aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan ayarları yapmamız yeterlidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk271_11.gif" alt="" width="618" height="410" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece bir &amp;ouml;nceki aktivite ile, &lt;strong&gt; Sequence&lt;/strong&gt; aktivitesindeki &lt;strong&gt;SiparisAdedi&lt;/strong&gt; ve &lt;strong&gt;UrunNo&lt;/strong&gt; isimli değişkenlere taşınan değerler, &lt;strong&gt;OrderInformationActivity&lt;/strong&gt; i&amp;ccedil;erisinden elde edilebilirler. İşte bu kadar. Tabi şimdilik :) T&amp;uuml;m bu işlemlerin arından&lt;strong&gt; ProductOrderFlow.xaml&lt;/strong&gt; aktivitesine ait &lt;strong&gt;XAML&lt;/strong&gt; i&amp;ccedil;eriğine bakıldığında, aşağıdaki kod par&amp;ccedil;asında yer alan &amp;ccedil;ıktının elde edildiği g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;p:Activity x:Class="HostWFApplication.ProductOrderFlow" xmlns:p="http://schemas.microsoft.com/netfx/2009/xaml/workflowmodel" xmlns:p1="http://schemas.microsoft.com/netfx/2008/xaml/schema" xmlns:s="clr-namespace:SampleActiviyLibrary;assembly= SampleActiviyLibrary" xmlns:swd="clr-namespace:System.WorkflowModel.Debugger;assembly= System.WorkflowModel" xmlns:swdx="clr-namespace:System.WorkflowModel.Design.Xaml;assembly= System.WorkflowModel.Design" xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml"&amp;gt;
    &amp;lt;p:Sequence swd:XamlDebuggerXmlReader.FileName="C:\Orneklerim\SampleActiviyLibrary \HostWFApplication\ProductOrderFlow.xaml"&amp;gt;
        &amp;lt;p:Sequence.Variables&amp;gt;
            &amp;lt;p:Variable x:TypeArguments="p1:Int32" Name="UrunNo" /&amp;gt;
            &amp;lt;p:Variable x:TypeArguments="p1:Int32" Name="SiparisAdedi" /&amp;gt;
        &amp;lt;/p:Sequence.Variables&amp;gt;
        &amp;lt;s:ProductActivity Count="[SiparisAdedi]" ProductId="[UrunNo]" /&amp;gt;
        &amp;lt;s:OrderInformationActivity OrderedProductCount="[SiparisAdedi]" OrderedProductId="[UrunNo]" /&amp;gt;
    &amp;lt;/p:Sequence&amp;gt;
&amp;lt;/p:Activity&amp;gt;&lt;/pre&gt;
&lt;p&gt;Harika değil mi? T&amp;uuml;m akış i&amp;ccedil;eriği &lt;strong&gt; XAML&lt;/strong&gt; bazlı olacak şekilde tanımlanmış durumda. Burada durup bu &lt;strong&gt; XAML&lt;/strong&gt; i&amp;ccedil;eriğini yorumlayacak programları d&amp;uuml;ş&amp;uuml;nmek gerekiyor. Daha karmaşık akışlara ait bu i&amp;ccedil;erikler &amp;ccedil;eşitli ara&amp;ccedil;lar yardımıyla y&amp;ouml;netilebilir ve akışların değiştirilerek yeni halleriyle devreye alınması sağlanabilir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Peki akışı devreye sokacak olan &amp;ccedil;alışma zamanı ortamının hazırlayacısı nerededir? Sonu&amp;ccedil; itibariyle yazılan &lt;strong&gt; Workflow&lt;/strong&gt; &amp;ouml;rneklerinin mutlaka bir &lt;strong&gt;Host&lt;/strong&gt; uygulama i&amp;ccedil;erisinde ele alınıyor olması şarttır. &amp;Ouml;rneğimiz &lt;strong&gt;Visual Studio 2010&lt;/strong&gt; i&amp;ccedil;erisine g&amp;ouml;m&amp;uuml;lm&amp;uuml;ş hazır bir &lt;strong&gt;Console&lt;/strong&gt; şablonu olduğundan, .&lt;strong&gt;Net 3.0 ve .Net 3.5&lt;/strong&gt;' teki &lt;strong&gt;WF&lt;/strong&gt; projelerinde olduğu gibi t&amp;uuml;m gerekli kodlar otomatik olarak &amp;uuml;retilmektedir. Geliştirdiğimiz &amp;ouml;rnekte bu kodlar Program.cs dosyasının bir par&amp;ccedil;ası olarak aşağıdaki gibi &amp;uuml;retilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace HostWFApplication
{
    using System;
    using System.Linq;
    using System.Threading;
    using System.WorkflowModel;
    using System.WorkflowModel.Activities;

    class Program
    {
        static void Main(string[] args)
        {
            Sequence s;
            AutoResetEvent syncEvent = new AutoResetEvent(false);

            WorkflowInstance myInstance = WorkflowInstance.Create(new ProductOrderFlow());
            myInstance.Completed += delegate(object sender, WorkflowCompletedEventArgs e) 
                { 
                    syncEvent.Set(); 
                };
            myInstance.Resume();

            syncEvent.WaitOne();
    
        }
    }
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ilk olarak &lt;strong&gt; ProductOrderFlow&lt;/strong&gt; tipinden bir &lt;strong&gt;WorkflowInstance&lt;/strong&gt; referansı &amp;uuml;retilmektedir. &lt;strong&gt;Workflow&lt;/strong&gt; tamamlandığında &lt;strong&gt;Completed&lt;/strong&gt; olay metodu devreye girer. Her zamanki gibi &lt;strong&gt;WorkflowCompletedEventArgs&lt;/strong&gt; parametresinden yararlanarak &amp;ouml;rneğin &lt;strong&gt;WF&lt;/strong&gt; tarafından &amp;uuml;retilen &lt;strong&gt; Output&lt;/strong&gt; değerleri ele alınabilir. &lt;em&gt;(Bu arada s isimli Sequence tipinden bir değişken yer aldığı g&amp;ouml;r&amp;uuml;lmektedir. Hi&amp;ccedil; kullanılmayan bu değişkenin final s&amp;uuml;r&amp;uuml;m&amp;uuml;nde zaten ortadan kaldırılacağı s&amp;ouml;yleniyor. Burada kazayla kaldığını sanıyorız ;) )&lt;/em&gt; Uygulamamızı bu son haliyle &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk271_13.gif" alt="" width="432" height="121" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere kullanıcıdan &amp;uuml;r&amp;uuml;n numarası ve sipariş adedi istenmiş sonrasında ise buna uygun bir işlem y&amp;uuml;r&amp;uuml;t&amp;uuml;lm&amp;uuml;ş ve tasarlanmış olan akış başarılı bir şekilde tamamlanmıştır.&lt;/p&gt;
&lt;p&gt;Buraya kadar anlattıklarımız ile aslında &lt;strong&gt;Workflow Foundation 4.0 &lt;/strong&gt;ile gelen yeniliklerin sadece bir kısmını inceleme şansını bulduk. Durumu değerlendirdiğimizde aşağıdaki maddeler ile kısa bir &amp;ouml;zet ge&amp;ccedil;ebiliriz;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;WF 4.0&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt;XAML&lt;/strong&gt; kullanımı daha etkili ve yaygın hale getirilmiş, bu sayede &lt;strong&gt; Workflow Based Service&lt;/strong&gt;' lerin dekleratif olarak geliştirilmesinin yolu tam olarak a&amp;ccedil;ılmıştır. Bu konuyu bir sonraki makalemizde&lt;em&gt;(veya g&amp;ouml;rsel dersimizde)&lt;/em&gt; incelemeye &amp;ccedil;alışıyor olacağım.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;WF 4.0&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt;WCF 4.0 &lt;/strong&gt;ile daha iyi anlaşılmasını sağlayacak yeni aktiviteler eklenmiştir.&lt;/li&gt;
&lt;li&gt;Sayısız pek &amp;ccedil;ok yeni aktivite dışında &lt;strong&gt;FlowChart&lt;/strong&gt; tipide g&amp;ouml;z ardı edilmemelidir. Bu tip &amp;ouml;zellikle geliştiricilerin bildiği akış şemaları mantığına uygun olacak şekilde s&amp;uuml;re&amp;ccedil; tasarlanmasını olanaklı kılmaktadır.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Activity Base Library&lt;/strong&gt; i&amp;ccedil;erisinde yer alan ata aktivite tipi artık &lt;strong&gt;WorkflowElement&lt;/strong&gt; olarak tasarlanmıştır. Buna g&amp;ouml;re sıfırdan tasarlanacak aktivitelerin &lt;strong&gt;WorkflowElement&lt;/strong&gt; &lt;strong&gt;abstract&lt;/strong&gt; sınıfından t&amp;uuml;remesi, var olanları genişletecek olanların ise &lt;strong&gt;Activity&lt;/strong&gt; sınıfından t&amp;uuml;reyerek &lt;strong&gt;CreatBody&lt;/strong&gt; metodunu ezmesi &amp;ouml;nerilir.&lt;/li&gt;
&lt;li&gt;Geliştirici tanımlı bir aktivite, istenirse kod yerine tasarım aracı yardımıyla da &amp;uuml;retilebilir. Bu durumda bir &lt;strong&gt;XAML&lt;/strong&gt; i&amp;ccedil;eriği oluşturulmaktadır.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Visual Studio 2010&lt;/strong&gt; tarafında &lt;strong&gt;WPF&lt;/strong&gt; tabanlı yeni tasarım aracı sayesinde, &lt;strong&gt;WF&lt;/strong&gt; geliştirilmesi son derece kolay ve zevkli bir hal almaktadır. &amp;Ouml;zellikle aktivitelerin &lt;strong&gt;arguman(Argument)&lt;/strong&gt; veya &lt;strong&gt; değişkenlerinin(Variables)&lt;/strong&gt; g&amp;ouml;rsel olarak belirlenebilmesi &amp;ouml;nemli noktalardan birisidir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;XAML&lt;/strong&gt; tabanlı &lt;strong&gt;WF&lt;/strong&gt; yapıları, &lt;strong&gt;Oslo&lt;/strong&gt; gibi modellerin sağladığı &lt;strong&gt;depolama alanlarında(Repositories)&lt;/strong&gt; saklanabilir, başka uygulamalar tarafından&lt;em&gt;(&lt;strong&gt;Quadrant&lt;/strong&gt; gibi)&lt;/em&gt; y&amp;ouml;netilip değiştirilebilir, diğer &lt;strong&gt;WF &amp;ccedil;alışma zamanı motorlarına&lt;/strong&gt; aktarılabilmeleri&lt;strong&gt;(Import) &lt;/strong&gt;i&amp;ccedil;in bulundukları ortamlardan &lt;strong&gt;&amp;ccedil;ıktı(Export)&lt;/strong&gt; olarak verilebilirler.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Elbette bahsettiğimiz konuların tamamında değişiklikler olabilir, olması muhtemeldir. Kesinlik ancak son s&amp;uuml;r&amp;uuml;mler ile ortaya &amp;ccedil;ıkacaktır. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalemizde ilk bakışta &lt;strong&gt;WF 4.0&lt;/strong&gt; ile gelen yeniliklerin bir kısmına değinmeye &amp;ccedil;alıştık ve konuyu pekiştirmek amacıyla bir &amp;ouml;rnek geliştirdik. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2009-03-26 12:00:00</pubDate>
  <slug>Windows-Workflow-Foundation-4-0-Ilk-Izlenimler-bsenyurt-com-dan</slug>
  <tags>
    <tag>workflow-foundation</tag>
    <tag>workflow-foundation-40</tag>
    <tag>wf</tag>
    <tag>wf-40</tag>
  </tags>
  <categories>
    <category>WF 4.0</category>
  </categories>
</post>