<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>GoLang - Web Programlamaya Giriş</title>
  <description>Bir web uygulamasının temel malzemeleri nelerdir? Sunucu tarafında çalışan bir çatı, içeriklerin gösterildiği dinamik web sayfaları, tasarım, görsel zenginlik katan materyaller(resimler,css'ler vb), veri depolama enstrümanları ve diğerleri. Aslında internet programcılığının ilk yılları düşünüldüğünde basit HTML sayfalarının neredeyse her tür ihtiyacı karşılayacağı düşünülüyordu. Zaman geçtikçe programlama dillerinin dinamik web sayfaları ile olan etkileşimi, istemci taraflı çalışan betiklerin sunucu taraflı kullanılabilmesi de gündeme geldi. Modern programlama dillerinin neredeyse tamamı web uygulamaları geliştirebilmek için gerekli temel donanıma sahip. Backend tarafında eş zamanlı işlemlerde yüksek performans sunan GO diliyle de web tabanlı uygulamalar geliştirebilmemiz mümkün.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/05/goweb_3.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir web uygulamasının temel malzemeleri nelerdir? Sunucu tarafında &amp;ccedil;alışan g&amp;uuml;&amp;ccedil;l&amp;uuml; bir &amp;ccedil;atı&lt;em&gt;(Framework)&lt;/em&gt;, i&amp;ccedil;eriklerin g&amp;ouml;sterildiği statik veya dinamik web sayfaları, iyi tasarım, g&amp;ouml;rsel zenginlik katan materyaller&lt;em&gt;(resimler,css'ler vb)&lt;/em&gt;, veri depolama enstr&amp;uuml;manları ve diğerleri. Aslında internet programcılığının ilk yılları d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde basit HTML sayfalarının neredeyse her t&amp;uuml;r ihtiyacı karşılayacağı d&amp;uuml;ş&amp;uuml;n&amp;uuml;l&amp;uuml;yordu belkide. Zaman ge&amp;ccedil;tik&amp;ccedil;e programlama dillerinin dinamik web sayfaları ile olan etkileşimi, istemci taraflı &amp;ccedil;alışan betiklerin sunucu taraflı kullanılabilmesi de g&amp;uuml;ndeme geldi. Modern programlama dillerinin neredeyse tamamı web uygulamaları geliştirebilmek i&amp;ccedil;in gerekli temel donanıma sahip. Asıl amacı back-end tarafındaki b&amp;uuml;y&amp;uuml;k &amp;ouml;l&amp;ccedil;ekli sistemlerde y&amp;uuml;ksek performans sunmak olan, eş zamanlı programlamada &amp;ouml;ne &amp;ccedil;ıkan GO ile de web tabanlı uygulamalar geliştirebilmemiz m&amp;uuml;mk&amp;uuml;n. Go dilinin network haberleşme &amp;uuml;zerine sunduğu basitlik ve y&amp;uuml;ksek performans da g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında web programlama olduk&amp;ccedil;a ilgi &amp;ccedil;ekici bir konu haline geliyor.&lt;/p&gt;
&lt;p&gt;Ruby tarafında Ruby on Rails, Python tarafında Django gibi &amp;ccedil;atılar profesyonel anlamda web uygulamalarının geliştirilmesini kolaylaştırıyor. Go tarafında da bu tip &amp;ccedil;atılar mevcut hatta Beego bunlar arasında en pop&amp;uuml;lerlerinden birisi. Ne var ki basit d&amp;uuml;zeyde de dahili paketlerden yararlanarak web uygulamaları geliştirebiliriz. &amp;Ccedil;&amp;uuml;nk&amp;uuml; teori her zaman basittir. tcp/ip &amp;uuml;zerinden belli bir porta gelen &amp;ccedil;eşitli talepler ve bu taleplere karşılık istemcilerin yorumlayabileceği HTML i&amp;ccedil;erikler. Bu d&amp;uuml;ş&amp;uuml;nce yapısından yola &amp;ccedil;ıkarak net/http ve html/template k&amp;uuml;t&amp;uuml;phanelerini kullanarak iki sayfadan oluşan basit bir web sitesi yazacağız. İşe ilk olarak aşağıdaki klas&amp;ouml;r ve dosya yapısını tasarlayarak başlayabiliriz.&lt;/p&gt;
&lt;p&gt;- server.go &lt;em&gt;(main fonksiyonunu i&amp;ccedil;eren go kod dosyamız)&lt;/em&gt;&lt;br /&gt;- \Pages&lt;br /&gt;- \Pages\index.html &lt;em&gt;(ana sayfamız olarak d&amp;uuml;ş&amp;uuml;nebiliriz)&lt;/em&gt;&lt;br /&gt;- \Pages\players.html &lt;em&gt;(Oyuncu listesini g&amp;ouml;sterecek olan sayfamız)&lt;/em&gt;&lt;br /&gt;- \Pages\common.css &lt;em&gt;(biraz g&amp;ouml;rsellik katmak i&amp;ccedil;in kullanacağız)&lt;/em&gt;&lt;br /&gt;- \Pages\stronger.gif &lt;em&gt;(siz istediğiniz bir resmi kullanabilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bu arada &amp;ccedil;eşitli kitaplardan ve kaynaklardan &amp;ccedil;alışırken bilgisayarımın başında yazdığım &amp;ouml;rnekleri &lt;a href="https://github.com/buraksenyurt/golangsamples" target="_blank"&gt;github &amp;uuml;zerinde&lt;/a&gt; toplamaya &amp;ccedil;alışıyorum. Ders01,02,03... mantığında ilerleyen bir i&amp;ccedil;erik s&amp;ouml;z konusu. İlk dersle başlayarak Go kod pratiklerinizi geliştirebilir dili orta seviyeye kadar &amp;ouml;ğrenebilirsiniz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;K&amp;ouml;k dizinimizde main fonksiyonunu i&amp;ccedil;eren go kod dosyamız bulunuyor. Bu tahmin edileceği &amp;uuml;zere uygulamanın giriş noktasını i&amp;ccedil;eren dosya. Pages alt klas&amp;ouml;r&amp;uuml;ndeyse html sayfalarımızı ve css, gif gibi kaynaklarımızı barındırıyoruz. common.css tahmin edeceğiniz &amp;uuml;zere sayfalarımızdaki g&amp;ouml;rselliği daha keyifli hale getirmek i&amp;ccedil;in kullanacağımız bir stil&lt;em&gt;(cascading style sheets)&lt;/em&gt; dosyası. Ben i&amp;ccedil;eriğini aşağıdaki gibi yazarak body,table,table-th(başlık),table-td(h&amp;uuml;cre) d&amp;uuml;zenini renklendirmeye &amp;ccedil;alıştım.&lt;/p&gt;
&lt;h1&gt;Amat&amp;ouml;rce Bir CSS Dosyası&lt;/h1&gt;
&lt;pre class="brush:css;auto-links:false;toolbar:false" contenteditable="false"&gt;body{
	border:3px solid cyan;
	border-radius: 24px;
	border-width: 20px;
	text-align: center;
	width: 400px;
	height: 400px;
	margin: auto;
	font-family:Tahoma, sans-serif;
	font-size:16px;
	color:541460;
}
table.gridtable {
	font-family: verdana,arial,sans-serif;
	font-size:16px;
	color:#581845;
	border-width: 1px;
	border-color: #666666;
	border-collapse: collapse;
}
table.gridtable th {
	border-width: 3px;
	padding: 8px;
	border-style: solid;
	border-color: #666666;
	background-color: #FF80E8;
}
table.gridtable td {
	border-width: 3px;
	padding: 8px;
	border-style: solid;
	border-color: #666666;
	background-color: #98A1FC;
}&lt;/pre&gt;
&lt;p&gt;index.html web uygulamasının giriş sayfası. Aslında kod i&amp;ccedil;erisinde belirleyeceğimiz k&amp;ouml;k adrese gelen taleplerin doğrudan karşılanacağı sayfa olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. CSS uygulamak dışında bir ka&amp;ccedil; bilgi ve /players şeklinde bir adrese bağlantı i&amp;ccedil;ermekte.&lt;/p&gt;
&lt;h1&gt;Karşılama Sayfası index.html&lt;/h1&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;
&amp;lt;head&amp;gt;
	&amp;lt;title&amp;gt;Blizert World Game Entertienment&amp;lt;/title&amp;gt;
	&amp;lt;link rel="stylesheet" href="/common.css"&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body&amp;gt;
	&amp;lt;h1&amp;gt;Wellcome to BliZerT&amp;lt;/h1&amp;gt;
	&amp;lt;p&amp;gt;The World's best card players are here. &amp;lt;br/&amp;gt;
	Want to learn some more details? &amp;lt;br/&amp;gt; 
	What are you waiting for. Go Go Go...&amp;lt;/p&amp;gt;
	&amp;lt;img src="/stronger.gif"/&amp;gt;
	&amp;lt;p&amp;gt;&amp;lt;a href="/players"&amp;gt;Famous Hearthstone Players&amp;lt;/a&amp;gt;&amp;lt;/p&amp;gt;
&amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Kullanıcılar &amp;ouml;rneğin http://localhost:8085&amp;nbsp;gibi bir adrese geldiklerinde bu sayfanın sunulmasını arzu ediyoruz. Eğer /players y&amp;ouml;nlendirmesini yapan linke basılırsa da players.html isimli sayfaya y&amp;ouml;nlendirme yapacağız. Bu sayfanın i&amp;ccedil;eriği ise aşağıdaki gibidir.&lt;/p&gt;
&lt;h1&gt;Oyuncuları g&amp;ouml;steren Players.html sayfası&lt;/h1&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;
&amp;lt;head&amp;gt;
	&amp;lt;title&amp;gt;Gold Players&amp;lt;/title&amp;gt;
	&amp;lt;link rel="stylesheet" href="/common.css"&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body&amp;gt;
	&amp;lt;h1&amp;gt;Gold Players&amp;lt;/h1&amp;gt;
	&amp;lt;table class="gridtable" align="center"&amp;gt;
		&amp;lt;tr&amp;gt;
			&amp;lt;th&amp;gt;Id&amp;lt;/th&amp;gt;
			&amp;lt;th&amp;gt;Player No&amp;lt;/th&amp;gt;
			&amp;lt;th&amp;gt;Nickname&amp;lt;/th&amp;gt;
			&amp;lt;th&amp;gt;Level&amp;lt;/th&amp;gt;
		&amp;lt;/tr&amp;gt;
		{{ range $index,$player := . }}
			&amp;lt;tr&amp;gt;
				&amp;lt;td&amp;gt;{{$index}}&amp;lt;/td&amp;gt;
				&amp;lt;td&amp;gt;{{$player.Id}}&amp;lt;/td&amp;gt;
				&amp;lt;td&amp;gt;{{$player.Nickname}}&amp;lt;/td&amp;gt;
				&amp;lt;td&amp;gt;{{$player.Level}}&amp;lt;/td&amp;gt;
			&amp;lt;/tr&amp;gt;
		{{end}}
	&amp;lt;/table&amp;gt;
	&amp;lt;br/&amp;gt;
	&amp;lt;a href="/"&amp;gt;Go Back&amp;lt;/a&amp;gt;
&amp;lt;/body&amp;gt;&lt;/pre&gt;
&lt;p&gt;Hımmmm...Bir dakika...Burada olduk&amp;ccedil;a enteresan ifadeler var. Bir back-end geliştiricisi de olsak az bu&amp;ccedil;uk HTML'den &amp;ccedil;akmadığımızı kim s&amp;ouml;yleyebilir. Peki bu ikişer k&amp;uuml;me parantezleri de neyin nesi oluyor? range anahtar kelimesi bir yerlerden tanıdık geliyor aslında. S&amp;ouml;z&amp;uuml; fazla uzatmayalım. {{ ile }} arasında yazdığımız ifadeler Go diline ait kod satırlarını i&amp;ccedil;eren kısımlar. Yani HTML sayfası i&amp;ccedil;erisine GO kodlarını g&amp;ouml;md&amp;uuml;ğ&amp;uuml;m&amp;uuml;z&amp;uuml; ifade edebiliriz. &amp;Ouml;nemli olan kısımsa&amp;nbsp;range ile başlayan satırlar. Burada nokta ile sayfaya gelen veri kaynağı &amp;uuml;zerinde index ve nesne &amp;ccedil;iftleri olarak hareket ediyoruz&lt;em&gt;({{ }} arasında GO kodundan gelen bir değişkene ulaşmak istediğimizde adının başına nokta koymamız gerekiyor)&lt;/em&gt; Bir d&amp;ouml;ng&amp;uuml; s&amp;ouml;z konusu ama key:value &amp;ccedil;iftlerini d&amp;ouml;n&amp;uuml;yor. Peki bu key:value &amp;ccedil;iftlerinin kaynağı kim? D&amp;ouml;ng&amp;uuml; tarafından işlenecek olan veriyi server.go i&amp;ccedil;erisinden g&amp;ouml;ndereceğiz. G&amp;ouml;ndereceğimiz nesne topluluğundaki &amp;ouml;ğelerin de Id, Nickname ve Level isimli alanları olacak. Alanları HTML i&amp;ccedil;erisine yedirmek i&amp;ccedil;in $index ve $player gibi ifadeler kullanıldığına dikkat edelim. &amp;Ouml;rneğin d&amp;ouml;ng&amp;uuml;n&amp;uuml;n o anki nesnesine gelen Player i&amp;ccedil;erisindeki Nickname alanına ulaşmak i&amp;ccedil;in $player.Nickname ifadesini, bu ifadenin sonucunu td takıları arasına yazmak i&amp;ccedil;in de {{ }} bloğunu kullanıyoruz. E &amp;ouml;yleyse gelelim server.go i&amp;ccedil;eriğine.&lt;/p&gt;
&lt;h1&gt;Başrol Oyuncusu Server.go&lt;/h1&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"html/template"
	"log"
	"net/http"
)

func main() {
	http.Handle("/", http.FileServer(http.Dir("pages")))
	http.HandleFunc("/players", getPlayers)
	log.Println("Web server is active at port 8045")
	http.ListenAndServe(":8045", nil)
}

func getPlayers(response http.ResponseWriter, request *http.Request) {
	log.Println("Get Request for Players")
	players := loadPlayers()
	log.Println("Players loaded")
	t, err := template.ParseFiles("pages/players.html")
	if err == nil {
		t.Execute(response, players)
	} else {
		log.Println(err.Error())
	}
}

type Player struct {
	Id       int
	Nickname string
	Level    int
}

func loadPlayers() []Player {
	return []Player{
		Player{1001, "Molfiryin", 2},
		Player{1002, "Gul'dan", 21},
		Player{1003, "Anduin", 12},
		Player{1004, "Lexar", 5},
		Player{1005, "Turol", 34},
	}
}&lt;/pre&gt;
&lt;p&gt;Dosyanın genel yapısına baktığımızda Player tipinden bir struct i&amp;ccedil;erdiğini, main dışında loadPlayers ve getPlayers isimli iki fonksiyona daha sahip olduğunu g&amp;ouml;r&amp;uuml;yoruz. Bunun dışında&amp;nbsp;html/template, log ve net/http paketlerinin kullanıldığını g&amp;ouml;r&amp;uuml;yoruz. localhost &amp;uuml;zerinden 8045 nolu adrese gelecek varsayılan talepler doğrudan pages klas&amp;ouml;r&amp;uuml;ne y&amp;ouml;nlendirilmekte. Bu y&amp;ouml;nlendirmeyi main fonksiyonunun ilk satırındaki HandlFunc ile belirtiyoruz. Genelde t&amp;uuml;m web sunucuları varsayılan sayfaları bilirler. Index.html aranan ilk sayfalardan birisidir. Haliyle index.html g&amp;ouml;reve hazır olacağından bu k&amp;ouml;k adres &amp;ccedil;ağrısının sonucu aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki gibi bir olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/05/goweb_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Famous Hearthstone Players başlıklı linke tıklandığında ise main fonksiyonundaki http.HandleFunc bildirimlerinden ikincisi devreye girer. Nitekim bağlantı /players şeklinde bir &amp;ccedil;ağrı yapmaktadır. Bu adrese gelecek olan talepler getPlayers isimli fonksiyona y&amp;ouml;nlendirilmektedir. Bu fonksiyon iki kritik parametre alır. İstemciye g&amp;ouml;nderilecek cevabın yazılmasında kullanılacak olan ResponseWriter ve gelen talebe ait bilgiler i&amp;ccedil;eren Request&lt;em&gt;(&amp;Ouml;rnekte Request nesnesi kullanılmamıştır ancak &lt;a href="/post/go-ile-basit-http-web-server-yapimi"&gt;şu adresteki yazıdan&lt;/a&gt; kendisi hakkında ek bilgi edinebilirsiniz)&lt;/em&gt; getPlayers fonksiyonunda &amp;ouml;nce terminale log basılarak işlemlere başlanır. Arından Player isimli struct tipinden nesne &amp;ouml;rnekleri barındıran slice i&amp;ccedil;eriğini elde edeceğimiz loadPlayers fonksiyonu tetiklenir. İşte bu slice i&amp;ccedil;erisindeki Player nesne &amp;ouml;rnekleri, players.html sayfasındaki ilgili konumlara&amp;nbsp;basılacaktır. Ama nasıl?&lt;/p&gt;
&lt;p&gt;&amp;Ouml;nce template tipinin ParseFiles fonksiyonu ile pages klas&amp;ouml;r&amp;uuml;ndeki players.html şablonu yakalanır. ParseFiles pek &amp;ccedil;ok Go fonksiyonu gibi iki değer d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. İlki kullanacağımız Template, ikincisi de Error tipidir. Eğer bir hata yoksa t isimli Template tipi &amp;uuml;zerinden Execute fonksiyonu &amp;ccedil;alıştırılır. Exceute fonksiyonu ResponseWriter &amp;ouml;rneğini ve players i&amp;ccedil;eriğini alıp players.html &amp;uuml;zerinde gerekli işlemleri ger&amp;ccedil;ekleştirir. Aslında players.html sayfası belleğe alınıp, {{ }} konumları players dizisi i&amp;ccedil;eriği ile beslenip gerekli HTML &amp;ccedil;ıktısının &amp;uuml;retilmesi ve bu i&amp;ccedil;eriğin ilgili ResponseWriter'ın sahiplendiği stream &amp;uuml;zerinden ağa yazdırılması s&amp;ouml;z konusudur diyebiliriz. Sonu&amp;ccedil; aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/05/goweb_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ta ta ta taaa...Pek &amp;ccedil;ok deneyimli ya da amat&amp;ouml;r web tasarımcısı i&amp;ccedil;in berbat dizaynlar olsa da benim i&amp;ccedil;in &amp;ouml;nemli bir adım diyebilirim. Bu basit &amp;ouml;rnekte hem statik hem de dinamik web sayfalarını nasıl kullanabileceğimizi incelemeye &amp;ccedil;alıştık. Statik HTML i&amp;ccedil;eriklerinde iyi bir CSS bilgisi basit bir tasarım &amp;ccedil;ok &amp;ccedil;ok işe yarayabilir. Bunun dışında dinamik olarak bir şeyler sunacak web sayfalarında Template kullanarak sunucu tarafında &amp;uuml;retilen verilerin HTML i&amp;ccedil;erisine basılması da m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Yani aray&amp;uuml;z tarafı ile Go kodları etkileşime ge&amp;ccedil;ebilir. Go ile Web Programlama olduk&amp;ccedil;a sade ve basit gibi g&amp;ouml;r&amp;uuml;n&amp;uuml;yor. Sevgili Murat &amp;Ouml;zalp'ın Go Programlama kitabı bu konuda bana b&amp;uuml;y&amp;uuml;k vizyon katıyor diyebilirim. &amp;Ouml;ğrendik&amp;ccedil;e bilgilerimin pekişmesi i&amp;ccedil;in de yazmaya devam edeceğim. Siz de &amp;ouml;rneği biraz daha geliştirmeye &amp;ccedil;alışabilirsiniz. &amp;Ouml;rneğin kullanıcıdan girdi alabileceğiniz bir web sayfası s&amp;ouml;z konusu olsa girilen i&amp;ccedil;erikleri sunucuya post ettiğinizde bunları Go kodunda yakalayıp nasıl işleyebilirsiniz? Araştırın. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-05-27 19:03:00</pubDate>
  <slug>golang-web-programlamaya-giris</slug>
  <tags>
    <tag>golang</tag>
    <tag>go-programming-language</tag>
    <tag>web-programming-model</tag>
    <tag>net/http</tag>
    <tag>html/template</tag>
    <tag>html</tag>
    <tag>css</tag>
  </tags>
  <categories>
    <category>GoLang</category>
  </categories>
</post>