<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WWF : Çalışma Zamanı Motoru, Singleton ve Factory Desenleri</title>
  <description>Bir önceki makalemizde iş akışı(Workflow) kavramını anlamaya çalışmış, Windows Workflow Foundation(WWF) mimarisini yüzeysel olarak incelemiş ve basit bir kaç Sequential Workflow örneği geliştirmiştik. Bu makalemizde ise WWF mimarisinin sunduğu çalışma zamanı ortamını derinlemesine kavramaya çalışacağız. Ağırlıklı olarak üzerinde durmaya çalışacağımız konu ise WorkflowRuntime sınıfı olacak.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki makalemizde &lt;strong&gt;iş akışı(Workflow) &lt;/strong&gt;kavramını anlamaya &amp;ccedil;alışmış, &lt;strong&gt;Windows Workflow Foundation(WWF)&lt;/strong&gt; mimarisini y&amp;uuml;zeysel olarak incelemiş ve basit bir ka&amp;ccedil; &lt;strong&gt;Sequential Workflow &lt;/strong&gt;&amp;ouml;rneği geliştirmiştik. Bu makalemizde ise WWF mimarisinin sunduğu &amp;ccedil;alışma zamanı ortamını derinlemesine kavramaya &amp;ccedil;alışacağız. Ağırlıklı olarak &amp;uuml;zerinde durmaya &amp;ccedil;alışacağımız konu ise &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; sınıfı olacak.&lt;/p&gt;
&lt;p&gt;İş akışları herhangibir .&lt;strong&gt;Net&lt;/strong&gt; uygulaması tarafından host edilebilmektedir. Burada ama&amp;ccedil; ana uygulamanın belirli iş kurallarını ve mantığını barındıran s&amp;uuml;re&amp;ccedil; veya s&amp;uuml;re&amp;ccedil;leri tutarlı bir şekilde ele alabilmesi ve kullanabilmesidir. &amp;Ccedil;ok doğal olarak iş akışları, &lt;strong&gt;host&lt;/strong&gt; uygulama g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınırken ortaya bir&lt;strong&gt; iş akışı &amp;ccedil;alışma zamanı(Workflow Runtime)&lt;/strong&gt; &amp;ccedil;ıkmaktadır. Buda &lt;strong&gt;Windows Workflow Foundation&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &amp;ouml;nemli bileşenlerden birisi anlamına gelmektedir. WWF mimarisi i&amp;ccedil;erisinde pek &amp;ccedil;ok &lt;strong&gt;bileşen(Components)&lt;/strong&gt; yer almaktadır. B&amp;uuml;y&amp;uuml;k resme bakıldığında başrol oynayan bileşenler aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk238_1.gif" alt="" width="424" height="240" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Sınıf k&amp;uuml;t&amp;uuml;phanaleri(Class Libraries) iş akışı(workflow)&lt;/strong&gt; uygulamaları &lt;strong&gt;geliştirebilmek(Develop)&lt;/strong&gt;, &lt;strong&gt;y&amp;ouml;netebilmek(Manage), &amp;ccedil;alışma zamanı hareketliliklerini izleyebilmek(Trace)&lt;/strong&gt; i&amp;ccedil;in gerekli t&amp;uuml;m tip tipleri i&amp;ccedil;ermektedir. Bunların dışında ana bileşenler i&amp;ccedil;in gerekli tiplerde burada yer almaktadır. S&amp;ouml;z gelimi &amp;ouml;nceden tanımlanmış &lt;strong&gt;&amp;ccedil;alışma zamanı servisleri(Runtime Services) &lt;/strong&gt;gibi. WF tasarım zamanı ara&amp;ccedil;ları sayesinde, iş akışlarının &lt;strong&gt;Visual Studio &lt;/strong&gt;ortamında kolay bir şekilde geliştirilebilmesi sağlanmaktadır. &lt;strong&gt;WF &amp;Ccedil;alışma zamanı servisleri(WF Runtime Services)&lt;/strong&gt; iş akışları i&amp;ccedil;in hayati &amp;ouml;nemi olan yada opsiyonel olarak ek avantajlar kazandıran bazı hizmetleri i&amp;ccedil;ermektedir. Bu yapıya yazımızın ilerleyen kısımlarında yeniden bakıyor olacağız.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WWF&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &lt;strong&gt;&amp;ccedil;ekirdek &amp;ccedil;alışma zamanı motoru(Core Runtime) WorkflowRuntime &lt;/strong&gt;sınıfı tarafından temsil edilmektedir. Ne varki WorkflowRuntime sınıfı tek başına anlamlı olabilecek bir yapıda değildir. Bu nedenle &lt;strong&gt;iş akışlarının(Workflows)&lt;/strong&gt; &amp;ccedil;alışma zamanını y&amp;ouml;netebilmesi i&amp;ccedil;in, bir host uygulama tarafından ele alınması gerekmektedir. Bu host uygulama tahmin edileceği gibi herhangibir .&lt;strong&gt;Net&lt;/strong&gt; uygulaması olabilir.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;WPF(Windows Presentation Foundation) Uygulamaları&lt;/li&gt;
&lt;li&gt;Windows Uygulamaları&lt;/li&gt;
&lt;li&gt;Windows Servisleri&lt;/li&gt;
&lt;li&gt;Asp.Net Web Uygulamaları&lt;/li&gt;
&lt;li&gt;Console Uygulamaları&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Buna g&amp;ouml;re &lt;strong&gt;host&lt;/strong&gt; uygulama &lt;strong&gt;iş akışı &amp;ccedil;alışma zamanını(Workflow Runtime)&lt;/strong&gt; barındırırken, iş akışı &amp;ccedil;alışma zamanıda &lt;strong&gt;iş akışı &amp;ouml;rneklerini(Workflow Instances) &lt;/strong&gt;barındırmaktadır. S&amp;ouml;z konusu durumu aşağıdaki şekil ile daha net bir bi&amp;ccedil;imde g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk238_2.gif" alt="" width="281" height="330" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bir &lt;strong&gt;WWF&lt;/strong&gt; ortamı oluşturulduğunda &lt;strong&gt;host&lt;/strong&gt; uygulama i&amp;ccedil;erisinde ele alınan pek &amp;ccedil;ok &amp;ccedil;alışma zamanı kavramıda s&amp;ouml;z konusudur. İş akışı &amp;ouml;rnekleri, bu &amp;ouml;rneklerin i&amp;ccedil;erisinde yer alan &lt;strong&gt;aktiviteler(Activities), kurallar(Rules),&lt;/strong&gt; iş akışı &amp;ccedil;alışma zamanı i&amp;ccedil;erisinde yer alan bazı unsurlar, servisler vb...Aşağıdaki şekilde host uygulama a&amp;ccedil;ısından bakıldığında, &amp;ccedil;alışma zamanı ortamı i&amp;ccedil;erisinde s&amp;ouml;z konusu olan unsurlar temsil edilmeye &amp;ccedil;alışılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk238_3.gif" alt="" width="477" height="429" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edilmesi gereken noktalardan bir taneside host uygulamanın birden fazla WF &amp;ccedil;alışma zamanı ortamına sahip olabilmesidir. Buna g&amp;ouml;re &lt;strong&gt;tek bir uygulama alanı(Single Application Domain) &lt;/strong&gt;kendi i&amp;ccedil;erisinde birden fazla WF &amp;ccedil;alışma zamanı ortamı barındırabilir. Bu WF &amp;ccedil;alışma zamanı ortamlarının her biride, kendi iş akışlarını bağımsız olacak şekilde y&amp;ouml;netebilir. Nitekim &lt;strong&gt;WF &amp;ccedil;alışma zamanı motoru(WF Runtime Engine)&lt;/strong&gt; birden fazla&lt;strong&gt; iş akışı &amp;ouml;rneğini(Workflow Instance)&lt;/strong&gt; y&amp;ouml;netecek şekilde tasarlanmıştır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Burada vurgulanması gereken bir husus vardır. Windows Workflow Foundation ile ilgili yazılmış bazı kitaptlarda tek bir uygulama alanı(Single Application Domain) i&amp;ccedil;erisinde sadece tek bir WF &amp;ccedil;alışma zamanı (WF Runtime) olabileceği belirtilmektedir. Ancak bu durum WWF' in relase edilmiş s&amp;uuml;r&amp;uuml;m&amp;uuml;nde ortadan kaldırılmıştır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;Host&lt;/strong&gt; uygulama bir &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesne &amp;ouml;rneğini oluşturduktan sonra temel olarak aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len olaylar meydana gelmektektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk238_4.gif" alt="" width="505" height="380" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ilk olarak &lt;strong&gt;Host&lt;/strong&gt; uygulama &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; &amp;ouml;rneğini oluşturmaktadır. Aynı zamanda &amp;ccedil;alışma zamanı i&amp;ccedil;in gerekli olan servislerde oluşturulmakta ve WF Runtime ortamına kayıt edilmektedir(Register). Buradaki servislerin bazıları mecburidir. Bazıları ise opsiyonel olarak ele alınmaktadır. Host uygulama ayrıca, &lt;strong&gt;WF Runtime&lt;/strong&gt; tarafından tetiklenen olayları ele alabilmekte ve bu şekilde WF &amp;ccedil;alışma zamanını daha kolay izleyebilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Workflow&lt;/strong&gt; &amp;ccedil;alışma motorunun en &amp;ouml;nemli g&amp;ouml;revlerinden birisi elbetteki iş akışlarını başlatmaktır. Zaten iş akışların kendiliğinden başlatılmasında m&amp;uuml;mk&amp;uuml;n değildir. Bu noktada devreye WorkflowRuntime girmektedir. Başlatılan iş akışları &lt;strong&gt;WF &amp;ccedil;alışma zamanı motoru(Runtime Engine)&lt;/strong&gt; tarafından ayrı bir thread i&amp;ccedil;erisinde &lt;strong&gt;asenkron(Asynchronous) &lt;/strong&gt;olarak y&amp;uuml;r&amp;uuml;t&amp;uuml;l&amp;uuml;rler. Birden fazla iş akışı WF &amp;ccedil;alışma zamanı motoru tarafından başlatılıp y&amp;ouml;netilebilmektedir. Ka&amp;ccedil; iş akışı olursa olsun, host uygulamadaki ana thread' e paralel olacak şekilde &lt;strong&gt;asenkron(asynchronous)&lt;/strong&gt; olarak y&amp;uuml;r&amp;uuml;t&amp;uuml;lebilmektedir. Başlatılan her iş akışı &lt;strong&gt;WF &amp;ccedil;alışma zamanı motoru (WF Runtime Engine)&lt;/strong&gt; tarafından izlenmektedir. Buna bağlı olarak &amp;ccedil;alışma zamanında bir iş akışının durumlarının ele alınabileceği bir takım olaylar s&amp;ouml;z konusudur. Aşağıdaki tabloda yer alan olaylar &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; sınıfına aittir.&lt;/p&gt;
&lt;table style="border-collapse: collapse; width: 100%;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;strong&gt;Olay(Event)&lt;/strong&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;strong&gt;A&amp;ccedil;ıklama&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;strong&gt; WorkflowCreated&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top"&gt;Bir Workflow nesne &amp;ouml;rneği oluşturulduğunda tetiklenen olaydır. Bu olay, iş akışına ait aktiviteler &amp;ccedil;alışmaya başlamadan &amp;ouml;nce, &lt;strong&gt;yapıcı metod(Constructor) &lt;/strong&gt;&amp;ccedil;alıştıktan sonra tetiklenmektedir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;strong&gt; WorkflowStarted&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top"&gt;Bir iş akışı &amp;ccedil;alışmaya başladığında tetiklenen olaydır. Bir başka deyişle iş akışı i&amp;ccedil;erisindeki &lt;strong&gt;root&lt;/strong&gt; &lt;strong&gt;aktivite(Activity)&lt;/strong&gt; icrasına başladığında tetiklenir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;strong&gt;WorkflowLoaded&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top"&gt;WF &amp;Ccedil;alışma zamanı motoru tarafından bir iş akışı belleğe y&amp;uuml;klendiğinde, iş akışına ait aktiviteler &amp;ccedil;alışmaya başlamadan &amp;ouml;nce tetiklenen olaydır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;strong&gt; WorkflowUnloaded&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top"&gt;İş akışı &amp;ouml;rneği WF &amp;ccedil;alışma zamanı motoru tarafından bellekten kaldırıldığında tetiklenen olaydır. &amp;Ccedil;oğunlukla bir iş akışı &lt;strong&gt;uzun s&amp;uuml;re bir şey yapmadan kaldığında(Idle)&lt;/strong&gt; ve &lt;strong&gt;WorkflowPersistenceService&lt;/strong&gt; hizmeti eklenip &lt;strong&gt;UnloadOnIdle&lt;/strong&gt; metodu geriye &lt;strong&gt;true&lt;/strong&gt; d&amp;ouml;nd&amp;uuml;r&amp;uuml;yorsa otomatik olarak tetiklenmektedir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;strong&gt; WorkflowCompleted&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top"&gt;İş akışı &amp;ouml;rneği tamamlandığında devreye giren olaydır. Bu olay geliştirici tarafından mutlaka ele alınmalıdır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;strong&gt; WorkflowAborted&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top"&gt;İş akışı iptal edildiğinde tetiklenir. Bir iş akışı &lt;strong&gt;WorkflowInstance&lt;/strong&gt; sınıfının &lt;strong&gt;Abort&lt;/strong&gt; metodu yardımıyla manuel olaraktanda iptal edilebilir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;strong&gt; WorkflowTerminated&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top"&gt;Bir iş akışı ele alınmayan(alınamayan) bir &lt;strong&gt;istisna(Exception)&lt;/strong&gt;, &lt;strong&gt;Terminate&lt;/strong&gt; metoduna yapılan bir &amp;ccedil;ağrı yada &lt;strong&gt;TerminateActivity&lt;/strong&gt; aktivitesi nedeniyle sonlandığında tetiklenir. Bu olayda geliştirici tarafından mutlaka ele alınmalıdır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;strong&gt; WorkflowSuspended&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top"&gt;Bir iş akışı &lt;strong&gt;Suspend&lt;/strong&gt; metoduna yapılan &amp;ccedil;ağrı ile, &lt;strong&gt;SuspendActivity&lt;/strong&gt; aktivitesine gelinmesi nedeniyle duraksayabilir. Ama gereken durumlarda WF &amp;ccedil;alışma zamanı motoru dinamik iş akışları arasında ge&amp;ccedil;işleri yaparken ge&amp;ccedil;ici olarak duraksatmalara başvurabilir. Bu durumlarda &lt;strong&gt;WorkflowSuspended&lt;/strong&gt; olayı tetiklenir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;strong&gt;WorkflowIdled&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top"&gt;İş akışları &amp;ccedil;alışma zamanı motoru tarafından iş yapmadan bırakıldığında tetiklenir. S&amp;ouml;z gelimi &lt;strong&gt;DelayActivity&lt;/strong&gt; aktivitesi ile karşılaşıldığında iş akışı idle durumuna ge&amp;ccedil;ecektir. Bu noktada &lt;strong&gt;WorkflowIdled&lt;/strong&gt; isimli olay tetiklenmektedir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;strong&gt; WorkflowResumed&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top"&gt;&lt;strong&gt;Suspend&lt;/strong&gt; modda olan bir iş akışı tekrar &amp;ccedil;alışmaya başladığında tetiklenen olaydır. Resume metoduna yapılan &amp;ccedil;ağrı sonucu yada WF &amp;ccedil;alışma zamanı motoru tarafından ge&amp;ccedil;ici olarak Suspend moda alınan bir iş akışı tekrar kaldığı yerden devam etmeye başladığında bu olay tetiklenir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;strong&gt; WorkflowPersisted&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top"&gt;Eğer WF &amp;ccedil;alışma zamanına eklenmiş bir &lt;strong&gt;kalıcı bırakma hizmeti(Persistence Service) &lt;/strong&gt;y&amp;uuml;kl&amp;uuml;yse, iş akışının g&amp;uuml;ncel durumu belleğe kaydedildikten sonra bu olay tetiklenebilir. Ancak bu s&amp;ouml;z konusu olayın tetiklenme nedenlerinden sadece birisidir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;strong&gt;Started&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top"&gt;WF &amp;ccedil;alışma zamanı motoru nesnesi başlatıldığında tetiklenen olaydır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;strong&gt;Stopped&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top"&gt;WF &amp;ccedil;alışma zamanı motoru nesnesi durdurulduğunda tetiklenen olaydır.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;WF &amp;ccedil;alışma zamanı motoru, iş akışları &amp;uuml;zerindeki y&amp;ouml;netimini daha moduler bir şekilde ger&amp;ccedil;ekleştirmek i&amp;ccedil;in bazı servislerden yararlanmaktadır. WF ortamında &lt;strong&gt;&amp;ccedil;alışma zamanı servisleri(WF Runtime Services)&lt;/strong&gt; olarak tanımlanan s&amp;ouml;z konusu hizmetler &lt;strong&gt;&amp;ccedil;ekirdek(Core) ve yerel(Local) &lt;/strong&gt;olmak &amp;uuml;zere iki ana kategoride ele alınırlar. &lt;strong&gt;&amp;Ccedil;ekirdek servisler(Core Services)&lt;/strong&gt; 4 ana hizmetten oluşmaktadır ve &lt;strong&gt;WF sınıf k&amp;uuml;t&amp;uuml;phanelerinde(Class Libraries)&lt;/strong&gt; i&amp;ccedil;erisinde tanımlanmış olan sınıflar ile ifade edilmektedir. Bu hizmetler aşağıdaki grafikte g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk238_5.gif" alt="" width="504" height="435" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;WF &amp;ccedil;alışma zamanı motoru tarafından ele alınan bu &amp;ccedil;ekirdek servislerden &lt;strong&gt;Commit Work Batch&lt;/strong&gt; ve &lt;strong&gt;Scheduling&lt;/strong&gt; hizmetleri mutlaka olmak zorundadır. Ancak &lt;strong&gt;Tracking&lt;/strong&gt; ve &lt;strong&gt;Persistence&lt;/strong&gt; hizmetlerinin kullanımı tamamen opsiyoneldir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Opsiyonel olan servisleri WF &amp;ccedil;alışma ortamına y&amp;uuml;klemek i&amp;ccedil;in şu adımlar izlenir;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Servise ait nesne &amp;ouml;rneği oluşturulur.&lt;/li&gt;
&lt;li&gt;WorkflowRuntime sınıfına ait nesne &amp;ouml;rneğinin AddService metodu kullanılarak, ilgili servisin &amp;ccedil;alışma ortamına eklenmesi sağlanır.&lt;/li&gt;
&lt;/ul&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;Scheduling&lt;/strong&gt; hizmeti temel olarak &amp;ccedil;alışma zamanında iş akışlarının icra edileceği &lt;strong&gt;thread&lt;/strong&gt;' lerin oluşturulması ve y&amp;ouml;netilmesi ile ilgilidir. Bu hizmetler &lt;strong&gt;WorkflowSchedulerService&lt;/strong&gt; isimli &lt;strong&gt;taban sınıftan(base class)&lt;/strong&gt; t&amp;uuml;remektedir. WorkflowSchedulerService &lt;strong&gt;abstract&lt;/strong&gt; bir sınıtfır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bilindiği gibi abstract sınıflar normal sınıflar gibi metodlar i&amp;ccedil;erebilen, &amp;ouml;rneklenemeyen, t&amp;uuml;retme amacıyla kullanılan ve t&amp;uuml;reyen sınıfların mutlaka ezmesi gereken &amp;uuml;yeleri barındırabilen, polimorfik(polymorphic) &amp;ouml;zellik g&amp;ouml;sterebilen .Net tiplerindendir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Eğer aksi s&amp;ouml;ylenmesse &lt;strong&gt;WF &amp;ccedil;alışma zamanı motoru(WF Workflow Runtime Engine)&lt;/strong&gt; varsayılan olarak &lt;strong&gt;DefaultWorkflowSchedulerService&lt;/strong&gt; sınıfına ait bir &amp;ouml;rneği kullanılır. Bu &amp;ouml;rnek sayesinde birden fazla iş akışının &lt;strong&gt;thread havuzu(Pool)&lt;/strong&gt; i&amp;ccedil;erisinde kuyruk temelli olarak y&amp;ouml;netilmesi otomatik olarak sağlanmaktadır. Elbette burada ikinci bir se&amp;ccedil;enek daha vardır ki buda &lt;strong&gt;ManualWorkflowSchedulerService&lt;/strong&gt; sınıfıdır. Bu servis kullanıldığında iş akışlarının y&amp;uuml;r&amp;uuml;yeceği thread' in oluşturulması host uygulamaya aittir. Ayrıca burada tek bir thread s&amp;ouml;z konusu olduğundan işlemler &lt;strong&gt;senkron(Synchronous)&lt;/strong&gt; olarak y&amp;uuml;r&amp;uuml;mektedir. Bu nedenle &lt;strong&gt;ManualWorkflowSchedulerService&lt;/strong&gt; &amp;ccedil;oğunlukla host uygulama &lt;strong&gt;Asp.Net&lt;/strong&gt; ile geliştirilmişse tercih edilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Commit Work Batch &lt;/strong&gt;hizmeti dahili iş akışları ile harici veri saklama ortamları arasındaki &lt;strong&gt;tutarlılığı(Consistency)&lt;/strong&gt; sağlamak adına WF &amp;ccedil;alışma zamanı motorunun &lt;strong&gt;transaction&lt;/strong&gt;' ları y&amp;ouml;netmesini sağlayan bir servistir. Temel olarak &lt;strong&gt;WorkflowCommitWorkBatchService&lt;/strong&gt; isimli &lt;strong&gt;abstract&lt;/strong&gt; sınıftan t&amp;uuml;reyen tiplerce karşılanırlar. &amp;Ccedil;ekirdek olarak yazılmış iki tip vardır. &lt;strong&gt;DefaultWorkflowCommitWorkBatchService&lt;/strong&gt; ve &lt;strong&gt;SharedConnectionWorkflowCommitWorkBatchService&lt;/strong&gt;. Tahmin edileceği &amp;uuml;zere varsayılan olarak kullanılan hizmet &lt;strong&gt;DefaultWorkflowCommitWorkBatchService&lt;/strong&gt; sınıfına ait &amp;ouml;rnek ile sağlanmaktadır. &lt;strong&gt;SharedConnectionWorkflowCommitBatchService&lt;/strong&gt; sınıfı kullanıldığında, &lt;strong&gt;Persistence&lt;/strong&gt; ve &lt;strong&gt;Tracking&lt;/strong&gt; servisleri i&amp;ccedil;in aynı &lt;strong&gt;SQL&lt;/strong&gt; bağlantısının kullanılabilmesi sağlanmaktadır. B&amp;ouml;ylece farklı &lt;strong&gt;nesneler(objects)&lt;/strong&gt; arasında aynı &lt;strong&gt;SQL&lt;/strong&gt; bağlantısını kullanan &lt;strong&gt;transaction&lt;/strong&gt;' ların y&amp;ouml;netilmesi sağlanabilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Tracking&lt;/strong&gt; servisi yardımıyla iş akışlarının başından ge&amp;ccedil;enlerin izlenmesi sağlanabilmektedir. &lt;strong&gt;Taban sınıf(Base Class)&lt;/strong&gt; &lt;strong&gt;TrackingService&lt;/strong&gt;' dir. &lt;strong&gt;Abstract&lt;/strong&gt; olan bu sınıfın &lt;strong&gt;WF&lt;/strong&gt; &amp;ccedil;alışma ortamı i&amp;ccedil;in yazılmış herhangibir varsayılan implemantasyonu yoktur. Nitekim bilin&amp;ccedil;li olarak &lt;strong&gt;SqlTrackingService&lt;/strong&gt; sınıfı kullanılabilir. &lt;strong&gt;SqlTrackingService&lt;/strong&gt; &lt;strong&gt;sealed&lt;/strong&gt; bir sınıftır. Bu nedenle kendisinden t&amp;uuml;retme yapılamamaktadır. Dolayısıyla geliştirici tarafından genişletilmesi m&amp;uuml;mk&amp;uuml;n değildir. Bu tip bir ama&amp;ccedil; varsa doğrudan TrackingService sınıfından t&amp;uuml;retme yapılmasında yarar vardır. &lt;strong&gt;SqlTrackingService&lt;/strong&gt; hizmeti ile iş akışlarına ait &amp;ccedil;alışma zamanı izlenimleri &lt;strong&gt;SQL&lt;/strong&gt; veritabanında saklanabilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Persistence&lt;/strong&gt; servisi ile &amp;ccedil;alışma zamanındaki iş akışlarının herhangibir noktada kalıcı olarak saklanabilmeleri hedeflenmektedir. Burada taban sınıf rol&amp;uuml;n&amp;uuml; &lt;strong&gt;abstract&lt;/strong&gt; &lt;strong&gt;WorkflowPersistenceService&lt;/strong&gt; &amp;uuml;stlenmektedir. &lt;strong&gt;Tracking&lt;/strong&gt; hizmetinde olduğu gibi bu servisinde varsayılan bir implementasyonu yoktur. Hizmetin kullanılabilmesi i&amp;ccedil;in &lt;strong&gt;SqlWorkflowPersistenceService&lt;/strong&gt; sınıfının &amp;ccedil;alışma zamanında WF ortamına eklenmesi gerekmektedir. Bu hizmet yardımıyla bir iş akışının &amp;ccedil;alışma zamanındaki durumu &lt;strong&gt;SQL&lt;/strong&gt; veritabanlarına kaydedilebilir ve istenildiği zaman ilgili tablolardan &amp;ccedil;alışma ortamına y&amp;uuml;klenebilir.&lt;em&gt; (&amp;Ccedil;ekirdek servislerinin detaylarını ve kullanımını ilerleyen makalalerimizde incelemeye &amp;ccedil;alışacağız.)&lt;/em&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Geliştiriciler &amp;ccedil;ekirdek servislere ait taban sınıfları(Base Class) kullanarak &amp;ouml;zelleştirilmiş hizmetlerde yazabilirler. Bunun i&amp;ccedil;in abstract olan &amp;ccedil;ekirdek hizmet(Core Service) sınıflarından t&amp;uuml;retme(Inherit) yapmak yeterlidir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Gelelim &lt;strong&gt;yerel hizmetlere(Local Services)&lt;/strong&gt;. &amp;Ccedil;oğunluka veri &lt;strong&gt;değiş tokuş hizmetleri(Data Exchange Services)&lt;/strong&gt; olarak adlandırılan bu servislerde ama&amp;ccedil;, &lt;strong&gt;host&lt;/strong&gt; uygulama ile iş akışı &amp;ouml;rnekleri arasında bir iletişim kanalı oluşturmaktır. Bu anlamda bazı yardımcı aktivite tipleri kullanılır. S&amp;ouml;z gelimi &lt;strong&gt;CallExternalMethodActivity&lt;/strong&gt; bileşeni yardımıyla bir iş akışı i&amp;ccedil;erisinden yerel bir servise ait metod &amp;ccedil;ağrılabilir. Yada &lt;strong&gt;HandleExternalEventActivity&lt;/strong&gt; bileşeni yardımıyla iş akışının yerel servis i&amp;ccedil;erisindeki bir olayın tetiklenmesini beklemesi sağlanabilir.&lt;/p&gt;
&lt;p&gt;Yazılmış olan bir yerel servisin &amp;ccedil;alışma ortamına eklenmesi i&amp;ccedil;in &lt;strong&gt;ExternalDataExchangeService&lt;/strong&gt; sınıfından yararlanılır. &amp;Ouml;nce bu sınıfa ait bir &amp;ouml;rnek oluşturlur ve &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesnesine eklenir. Kullanılmak istenen yerel servis &amp;ouml;rnekleri &lt;strong&gt;ExternalDataExchangeService&lt;/strong&gt; &amp;ouml;rneğine ilave edilirler. &lt;em&gt;(Kendi yerel servislerimizi nasıl geliştirebileceğimizi ilerleyen makalelerde incelemeye &amp;ccedil;alışacağız.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Buraya kadar WF &amp;ccedil;alışma zamanının başrol oyuncularını &amp;ccedil;ok kısada olsa tanımaya &amp;ccedil;alıştık. Artık ağırlıklı olarak WF &amp;ccedil;alışma zamanı motoru g&amp;ouml;revini &amp;uuml;stlenen &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; sınıfını &amp;ouml;rnek &amp;uuml;zerinde irdelemeye &amp;ccedil;alışacağız. WorkflowRuntime sınıfının, &amp;ccedil;alışma zamanı ortamını y&amp;ouml;netmek i&amp;ccedil;in kullanılan pek &amp;ccedil;ok &lt;strong&gt;&amp;uuml;yesi(Member) &lt;/strong&gt;bulunmaktadır. &lt;strong&gt;Olaylarından(Events) &lt;/strong&gt;daha &amp;ouml;nceden bahsettiğimiz WorkflowRuntime sınıfının t&amp;uuml;m &amp;uuml;yeleri aşağıdaki &lt;strong&gt;sınıf diagramında(Class Diagram)&lt;/strong&gt; g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk238_6.gif" alt="" width="259" height="695" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;AddService&lt;/strong&gt; metodu yardımıyla WF &amp;ccedil;alışma zamanı ortamına &lt;strong&gt;&amp;ccedil;ekirdek(Core)&lt;/strong&gt; veya &lt;strong&gt;yerel(Local) &lt;/strong&gt;servislerin eklenmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. &lt;strong&gt;AddService&lt;/strong&gt; metodu ile WF &amp;ccedil;alışma zamanı ortamına y&amp;uuml;klenen servisler &lt;strong&gt;RemoveService&lt;/strong&gt; fonksiyonu kullanılaraktan kaldırılabilirler. &amp;Ccedil;alışma ortamında, &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesnesi tarafından kullanılan servislerin tamamı istenirse &lt;strong&gt;GetAllServices&lt;/strong&gt; metodunun aşırı y&amp;uuml;klenmiş versiyonları yardımıyla elde edilebilir.&lt;/p&gt;
&lt;p&gt;En &amp;ccedil;ok kullanılan &amp;uuml;yelerden olan &lt;strong&gt;CreateWorkflow&lt;/strong&gt; metodu ile bir iş akışının o andaki WF &amp;ccedil;alışma ortamı i&amp;ccedil;erisinde oluşturulması sağlanır. Bu metod &amp;ccedil;ağrısının &amp;ouml;nemli bir &amp;ouml;zelliği daha vardır. İş akışı &amp;ouml;rneği oluşturulurken eğer WF &amp;ccedil;alışma zamanı &amp;ccedil;alışmıyorsa, başlatılmasını sağlamaktadır. Başlatma işlemi aslında &lt;strong&gt;StartRuntime&lt;/strong&gt; metodu ile ger&amp;ccedil;ekleştirilmektedir. Dolayısıyla &lt;strong&gt;CreateWorkflow&lt;/strong&gt; metodunun &amp;ccedil;alışmayan bir WF ortamına rastladığında yaptığı &amp;ccedil;ağrıda &lt;strong&gt;StartRuntime&lt;/strong&gt; fonksiyonu i&amp;ccedil;indir. &lt;strong&gt;StartRuntime&lt;/strong&gt; bilin&amp;ccedil;li olarak dışarıdan da &amp;ccedil;ağırılabilir.&lt;/p&gt;
&lt;p&gt;StartRuntime nasılki bir WF &amp;ccedil;alışma ortamının başlatılmasını sağlıyorsa &lt;strong&gt;StopRuntime&lt;/strong&gt; metoduda durdurulmasında rol oynamaktadır. &lt;strong&gt;StartRuntime&lt;/strong&gt; metoduna yapılan &amp;ccedil;ağrılar WF &amp;ccedil;alışma ortamı i&amp;ccedil;in kullanılan servislerin başlatılmasını sağlarken, &lt;strong&gt;StopRuntime&lt;/strong&gt; metoduna yapılan &amp;ccedil;ağrılarda s&amp;ouml;z konusu servislerin durdurulmasında rol oynar. WF &amp;ccedil;alışma zamanı ortamında istenirse &lt;strong&gt;y&amp;uuml;r&amp;uuml;mekte(Executing)&lt;/strong&gt;, &lt;strong&gt;saklanmakta(Persisted)&lt;/strong&gt; veya &lt;strong&gt;asılı halde(Idled)&lt;/strong&gt; olan bir&lt;strong&gt; iş akışının(Workflow) &lt;/strong&gt;referansının elde edilmesi sağlanabilir. Metodları dışında &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; sınıfının sadece iki &amp;ouml;zelliği bulunmaktadır. Bunlardan &lt;strong&gt;IsStarted&lt;/strong&gt; &amp;ouml;zelliği yardımıyla, WF &amp;ccedil;alışma zamanı ortamının başlatılıp başlatılmadığı bilgisi &lt;strong&gt;true&lt;/strong&gt; veya &lt;strong&gt;false&lt;/strong&gt; olarak &amp;ouml;ğrenilebilmektedir.&lt;/p&gt;
&lt;p&gt;Şimdi &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesnesini kod &amp;uuml;zerinden incelemeye başlayabiliriz. İlk olarak yazımızın başında bahsettiğimiz gibi &lt;strong&gt;tek bir uygulama alanı(Single Application Domain)&lt;/strong&gt; i&amp;ccedil;erisinde birden fazla &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesnesi olabileceğini ispat etmeye &amp;ccedil;alışarak başlayacağız. &amp;Ouml;rneklerimizde herhangibir &lt;strong&gt;iş akışı(Workflow) &lt;/strong&gt;&amp;ouml;rneği kullanılmayacaktır. Bu nedenle basit bir Console uygulaması &amp;uuml;zerinden hareket edebiliriz. Sonu&amp;ccedil; itibaryle &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesnesi bilindiği gibi bir host uygulamada kullanıldığı takdirde anlamlı olmaktadır. Bu ama&amp;ccedil;la &lt;strong&gt;Visual&lt;/strong&gt; &lt;strong&gt;Studio&lt;/strong&gt; &lt;strong&gt;2008&lt;/strong&gt; ortamında bir Console uygulaması a&amp;ccedil;alım ve &lt;strong&gt;.Net Framework 3.0 assembly'&lt;/strong&gt; larından &lt;strong&gt;System.Runtime.Workflow.dll'&lt;/strong&gt; ini projeye referans edelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk238_9.gif" alt="" width="293" height="224" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sonrasında ise ana uygulama kodlarını aşağıdaki gibi geliştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Workflow.Runtime;

namespace WorkflowRuntimeInceleme
{
    class Program
    {
        static void Main(string[] args)
        {
            // WorkflowRuntime nesne &amp;ouml;rneklerinden ilki oluşturulur.
            WorkflowRuntime rt1 = new WorkflowRuntime();
            rt1.Name = "WF1"; // WorkflowRuntime i&amp;ccedil;in bir isim belirlenir
    
            // Started ve Stopped olayları y&amp;uuml;klenir
            rt1.Started += new EventHandler&amp;lt;WorkflowRuntimeEventArgs&amp;gt;(WfStarted);
            rt1.Stopped += new EventHandler&amp;lt;WorkflowRuntimeEventArgs&amp;gt;(WFStopped);

            // WorkflowRuntime nesne &amp;ouml;rneklerinden ikincisi oluşturulur.
            WorkflowRuntime rt2 = new WorkflowRuntime();
            // WF Runtime i&amp;ccedil;in isim belirlenir.
            rt2.Name = "WF2";
            // Started ve Stopped olayları y&amp;uuml;klenir
            rt2.Started+=new EventHandler&amp;lt;WorkflowRuntimeEventArgs&amp;gt;(WfStarted);
            rt2.Stopped+=new EventHandler&amp;lt;WorkflowRuntimeEventArgs&amp;gt;(WFStopped);

            // WorkflowRuntime &amp;ouml;rnekleri StartRuntime metodu ile başlatılır
            rt1.StartRuntime(); 
            rt2.StartRuntime();

            // WorkflowRuntime &amp;ouml;rnekleri StopRuntime metodu ile durdurulur
            rt1.StopRuntime();
            rt2.StopRuntime();
        }
    
        // WorkflowRuntime başlatıldığında devreye giren olay metodu
        static void WfStarted(object sender, WorkflowRuntimeEventArgs e)
        {
            // İki WorkflowRuntime nesne &amp;ouml;rneğide aynı Started olayına bağlandığından hangisi olduğunun tespiti i&amp;ccedil;in sender' dan yararlanılır
            WorkflowRuntime guncelWF = sender as WorkflowRuntime;
            // IsStarted &amp;ouml;zelliği ile WF &amp;Ccedil;alışma zamanının başlatılıp başlatılmadığı &amp;ouml;ğrenilir.
            Console.WriteLine(guncelWF.Name + " " + e.IsStarted);
        }

        // WorkflowRuntime durdurulduğunda devreye giren olay metodu
        static void WFStopped(object sender, WorkflowRuntimeEventArgs e)
        {
            // İki WorkflowRuntime nesne &amp;ouml;rneğide aynı Started olayına bağlandığından hangisi olduğunun tespiti i&amp;ccedil;in sender' dan yararlanılır
            WorkflowRuntime guncelWF = sender as WorkflowRuntime;
            Console.WriteLine(guncelWF.Name+" "+e.IsStarted);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnekte iki adet &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesnesi oluşturulmakta ve &amp;ouml;nce &lt;strong&gt;StartRuntime&lt;/strong&gt; metod &amp;ccedil;ağrıları ile başlatılmaktadır. Sonrasında ise &lt;strong&gt;StopRuntime&lt;/strong&gt; metod &amp;ccedil;ağrıları ile ilgili WF &amp;ccedil;alışma zamanı ortamları durdurulmaktadır. Bu durum ge&amp;ccedil;işlerini kolay takip edebilmek i&amp;ccedil;in her iki &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesne &amp;ouml;rneği aynı &lt;strong&gt;Started&lt;/strong&gt; ve &lt;strong&gt;Stopped&lt;/strong&gt; olaylarına bağlanmıştır. Uygulama &amp;ccedil;alıştırıldığında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; elde edilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk238_7.gif" alt="" width="285" height="102" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi aynı uygulama i&amp;ccedil;erisinde birden fazla &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesne &amp;ouml;rneğinin &amp;ccedil;alıştırılabileceği ortadadır. Her ne kadar birden fazla &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; oluşturulması avantajlı g&amp;ouml;r&amp;uuml;nsede bazı durumlarda &amp;ccedil;alışma zamanında tek bir &amp;ouml;rneğin olması istenebilir. Bu &amp;ccedil;oğunlukla performans kazanımları sağlayacak bir durumdur. Nitekim s&amp;ouml;z konusu ihtiya&amp;ccedil; hazırlanma maliyeti y&amp;uuml;ksek olan nesnelerin bir tane olmasını sağlamakta kendini g&amp;ouml;stermektedir.&lt;/p&gt;
&lt;p&gt;Bu noktada &lt;strong&gt;WWF&lt;/strong&gt;' i bir kenara bırakıp "Bir nesnenin &amp;ccedil;alışma zamanında &lt;strong&gt;tek(Single) &lt;/strong&gt;olmasını sağlamak i&amp;ccedil;in ne yapılır?" sorusuna cevap aramak gerekmektedir. Neyseki &lt;strong&gt;Gang-Of-Four(GOF)&lt;/strong&gt; sayesinde yıllar &amp;ouml;nce bu tip bir ihtiya&amp;ccedil; i&amp;ccedil;in &lt;strong&gt;Singleton&lt;/strong&gt; &lt;strong&gt;Tasarım Deseni(Singleton Design Pattern)&lt;/strong&gt; ortaya &amp;ccedil;ıkmıştır. Şimdi tekrar &lt;strong&gt;WWF&lt;/strong&gt; tarafında d&amp;ouml;nersek &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesnelerinin tek olmasını sağlamak i&amp;ccedil;in Singleton desenini kullanabileceğimizi d&amp;uuml;ş&amp;uuml;nebiliriz. Lakin bu sadece nesnenin tek olmasını sağlayan bir desendir. Oysaki &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesnesinin &amp;uuml;retiminide d&amp;uuml;ş&amp;uuml;nmemiz gerekmektedir. Bu sebepten Factory tasarım deseninide işin i&amp;ccedil;erisine katmak anlamlı olacaktır. Bir başka deyişle &lt;strong&gt;Singleton&lt;/strong&gt; ve &lt;strong&gt;Factory&lt;/strong&gt; tasarım desenlerinin bir karışımı burada g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Singleton ve Factory tasarım desenlerinin bir arada kullanılması &amp;ccedil;alışma zamanında sadece tek bir Singleton nesnesinin &amp;uuml;retilmesini sağlamaktadır. Esasında Abstract Factroy, Builder ve Prototype gibi desenler kendi i&amp;ccedil;lerinde Singleton desenini barındıran &amp;ccedil;&amp;ouml;z&amp;uuml;mler sunmaktadır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bu ama&amp;ccedil;la uygulamaya aşağıdaki gibi bir sınıf eklediğimizi d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk238_8.gif" alt="" width="314" height="213" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Workflow.Runtime;

namespace WorkflowRuntimeInceleme
{
    public static class WorkflowRuntimeFabrikasi
    {
        // Singleton WorkflowRuntime &amp;ouml;rneği hazırlanır.
        private static WorkflowRuntime _wfRt = null;
        // Lock işleminde kullanılmak &amp;uuml;zere static bir object oluşturulur.
        private static object _kilit = new object();

        public static WorkflowRuntime WorkflowRuntimeUret()
        {
            // Multi-Thread uygulamalar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınarak senkron &amp;ccedil;alıştırma i&amp;ccedil;in lock kullanılır.
            lock (_kilit)
            {
                // Eğer daha &amp;ouml;nceden bir WorkflowRuntime nesnesi oluşturulmamışsa
                if (_wfRt == null)
                {
                    _wfRt = new WorkflowRuntime(); // WorkflowRuntime nesnesini &amp;uuml;ret 
                    // Process' den &amp;ccedil;ıkıldığında
                    AppDomain.CurrentDomain.ProcessExit+=delegate(object obj,EventArgs e)
                                                                {
                                                                    WorkflowKapat(_wfRt); // Workflow ortamını kapatma metodunu &amp;ccedil;alıştır
                                                                };
                    // Application Domain Unload edildiğinde
                    AppDomain.CurrentDomain.DomainUnload += delegate(object obj, EventArgs e)
                                                                {
                                                                    WorkflowKapat(_wfRt); // Workflow ortamını kapatma metodunu &amp;ccedil;alıştır
                                                                };
                    _wfRt.StartRuntime(); // WorkflowRuntime başlatılır
                }
                return _wfRt;
            }
        }
        private static void WorkflowKapat(WorkflowRuntime rt)
        {
            // Eğer WorkflowRuntime nesnesi null değilse ve başlatılmışsa
            if (rt != null
                &amp;amp;&amp;amp; rt.IsStarted)
            {
                try
                {
                    rt.StopRuntime();// WorkflowRuntime' ı durdurmayı dene
                }
                catch // istisna(Exception) oluşursa g&amp;ouml;rmezden gel
                {
                }
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;WorkflowRuntimeFabrikası&lt;/strong&gt; isimli sınıf &lt;strong&gt;static&lt;/strong&gt; olarak tasarlanmıştır. Bu nedenle &amp;ccedil;alışma zamanında kendisine ait bir &amp;ouml;rnek oluşturulması m&amp;uuml;mk&amp;uuml;n değildir. Buda standart &lt;strong&gt;Singleton&lt;/strong&gt; deseninde yer alan &lt;strong&gt;private yapıcı metodun(Constructor)&lt;/strong&gt; yazılma zorunluluğunu ortadan kaldırmaktadır. Bununla birlikte &lt;strong&gt;static&lt;/strong&gt; &lt;strong&gt;sınıfların(static classes)&lt;/strong&gt; bir &amp;ouml;zelliği olarak sadece static &amp;uuml;yeler i&amp;ccedil;erebilir. Sınıf i&amp;ccedil;erisinde dikkat edileceği &amp;uuml;zere &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesnesi static bir &lt;strong&gt;alan(Field)&lt;/strong&gt; olarak tanımlanmaktadır. &lt;strong&gt;Host&lt;/strong&gt; uygulamanın ihtiyacı olan &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesne &amp;ouml;rneğinin &amp;uuml;retim işlemini static olarak tanımlanmış olan &lt;strong&gt;WorkflowRuntimeUret&lt;/strong&gt; metodu &amp;uuml;stlenmektedir.&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere s&amp;ouml;z konusu metod i&amp;ccedil;erisinde &lt;strong&gt;_wfRt&lt;/strong&gt; isimli &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesnesinin &lt;strong&gt;null&lt;/strong&gt; olup olmadığı kontrol edilemektedir. Eğer &lt;strong&gt;null&lt;/strong&gt; ise &amp;uuml;retim yapılmakta ve metoddan geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmektedir. Buda zaten aynı metodun ikinci veya diğer &amp;ccedil;ağrılarında &lt;strong&gt;_wfRt&lt;/strong&gt;' nin tek olmasını garanti etmektedir. &lt;strong&gt;Singleton&lt;/strong&gt; deseninin kullanımında &lt;strong&gt;multi-thread&lt;/strong&gt; uygulamalar s&amp;ouml;z konusu ise &amp;uuml;retim yapan metod i&amp;ccedil;erisinde senkronize etme işlemleri yapılması &amp;ouml;nerilmektedir. Bu sebepten dolayı &amp;ccedil;ok basit olarak &lt;strong&gt;lock&lt;/strong&gt; kullanımı ile &lt;strong&gt;thread&lt;/strong&gt;' in senkronize edilerek &amp;ccedil;alıştırılması sağlanmaktadır. Herhangibir host uygulama i&amp;ccedil;erisinde bu sınıf kullanılmak istendiği takdirde, &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesnelerini &amp;uuml;retmek i&amp;ccedil;in aşağıdaki gibi bir kod par&amp;ccedil;asını yazmak yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;WorkflowRuntime wfRt1 = WorkflowRuntimeFabrikasi.WorkflowRuntimeUret();&lt;/pre&gt;
&lt;p&gt;Elbette ikinci bir &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesneside &amp;uuml;retilmek istenebilir. Bu yapıldığı takdirde aşağıdaki flash animasyonunda olduğu gibi ilk oluşturulan &amp;ouml;rneğin kullanılmasına devam edilmesi sağlanmış olunur.&lt;em&gt;(Flash versiyon 7.0 olup boyut 650 Kb' tır)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;object id="obj1" width="524" height="504" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/mk238_Video.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="524" height="504" src="http://www.buraksenyurt.com/makale/images/mk238_Video.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj1" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalemizde Workflow &amp;ccedil;alışma zamanı ortamını tanımaya &amp;ccedil;alışırken, &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; sınıfına ait nesne &amp;ouml;rnekleri i&amp;ccedil;in &lt;strong&gt;Singleton&lt;/strong&gt; ve &lt;strong&gt;Factroy&lt;/strong&gt; desenlerini karma olarak nasıl kullanabileceğimizi inceledik. Ağırlıklı olarak &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; sınıfı, &amp;uuml;yeleri ve kullanım şekli &amp;uuml;zerinde durmaya &amp;ccedil;alıştık. &amp;Ouml;ğrendiklerimizi aşağıdaki maddeler ilede g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Workflow &amp;ccedil;alışma zamanı motoru(WF Runtime Engine)&lt;/strong&gt;, iş akışlarının başlatılması, y&amp;ouml;netilmesi, bunlarla ilişkili servislerin y&amp;uuml;klenmesi ve daha pek &amp;ccedil;ok fonksiyonellikten sorumlu ana &lt;strong&gt;WWF&lt;/strong&gt; bileşenlerinden birisidir.&lt;/li&gt;
&lt;li&gt;WF &amp;Ccedil;alışma zamanı motorunun kullanımı ancak bir &lt;strong&gt;Host&lt;/strong&gt; uygulama s&amp;ouml;z konusu olduğunda anlamlıdır.&lt;/li&gt;
&lt;li&gt;WF Runtime Engine' in sınıf karşılığı olan &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; tipine ait birden fazla nesne &amp;ouml;rneği &lt;strong&gt;aynı uygulama alanı(Application Domain)&lt;/strong&gt; i&amp;ccedil;erisinde kullanılabilir.&lt;/li&gt;
&lt;li&gt;Bir &lt;strong&gt;Application Domain &lt;/strong&gt;i&amp;ccedil;erisinde tek bir &lt;strong&gt;Singleton&lt;/strong&gt; &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesnesinin kullanımı garanti edilebilir. Bunun i&amp;ccedil;in &lt;strong&gt;Singleton&lt;/strong&gt; ve &lt;strong&gt;Factory&lt;/strong&gt; desenelerinden yararlanılır.&lt;/li&gt;
&lt;li&gt;WF &amp;Ccedil;alışma zamanı ortamını i&amp;ccedil;erisinde ger&amp;ccedil;ekleşen durumları daha iyi ele alabilmek i&amp;ccedil;in &lt;strong&gt; WorkflowRuntime&lt;/strong&gt; sınıfına pek &amp;ccedil;ok &lt;strong&gt;olay(Event)&lt;/strong&gt; ilave edilmiştir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;WorkflowRuntime&lt;/strong&gt; sınıfına ait metodlar ile, servis başlatmak, servisleri elde etmek, iş akışı başlatmak, servis kaldırmak gibi pek &amp;ccedil;ok WF &amp;ccedil;alışma zamanı işlevselliği ger&amp;ccedil;ekleştirilebilir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;İlerleyen makalalerimizde &lt;strong&gt;Windows Workflow Foundation&lt;/strong&gt; ile ilgili farklı konulara değinmeye devam ediyor olacağız. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/WorkflowRuntimeInceleme.rar"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2008-01-04 12:00:00</pubDate>
  <slug>WWF-Calc4b1sma-Zamanc4b1-Motoru-Singleton-ve-Factory-Desenleri-bsenyurt-com-dan</slug>
  <tags>
    <tag>wf</tag>
    <tag>workflow-foundation</tag>
    <tag>singleton</tag>
    <tag>factory</tag>
  </tags>
  <categories>
    <category>WF</category>
  </categories>
</post>