<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>C# 2.0 İçin İterasyon Yenilikleri</title>
  <description>Bazen kendi yazmış olduğumuz tiplerin dizi bazlı elemanları olur. Uygulamalarımızda, bu elemanlar arasında, elamanların sahipi olan nesne örneği üzerinden ileri yönlü iterasyonlar kurmak isteyebiliriz. Foreach döngüleri belirtilen tip için bu iterasyonu sağlayan bir mekanizmaya sahiptir. Lakin kendi geliştirdiğimiz tiplerin sahip oldukları elemanlar üzerinde, bu tarz bir iterasyonu uygulayabilmek için bir numaratöre ve uygulayıcıya ihtiyacımız vardır. Kısacası, tipimizin elemanları arasında nasıl öteleme yapılabileceğini sisteme öğretmemiz gerekmektedir. Bu işlevselliği kazandırmak için IEnumerable ve IEnumerator arayüzlerini birlikte kullanırız.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bazen kendi yazmış olduğumuz tiplerin dizi bazlı elemanları olur. Uygulamalarımızda, bu elemanlar arasında, elamanların sahipi olan nesne &amp;ouml;rneği &amp;uuml;zerinden ileri y&amp;ouml;nl&amp;uuml; iterasyonlar kurmak isteyebiliriz. Foreach d&amp;ouml;ng&amp;uuml;leri belirtilen tip i&amp;ccedil;in bu iterasyonu sağlayan bir mekanizmaya sahiptir. Lakin kendi geliştirdiğimiz tiplerin sahip oldukları elemanlar &amp;uuml;zerinde, bu tarz bir iterasyonu uygulayabilmek i&amp;ccedil;in bir numarat&amp;ouml;re ve uygulayıcıya ihtiyacımız vardır. Kısacası, tipimizin elemanları arasında nasıl &amp;ouml;teleme yapılabileceğini sisteme &amp;ouml;ğretmemiz gerekmektedir. Bu işlevselliği kazandırmak i&amp;ccedil;in IEnumerable ve IEnumerator aray&amp;uuml;zlerini birlikte kullanırız.&lt;/p&gt;
&lt;p&gt;Uygulamalarımızda klasik olarak kullandığımız bir iterasyon tekniği vardır. Bu tekniğe g&amp;ouml;re iterasyon i&amp;ccedil;erisinde kullanılacak olan elemanlar i&amp;ccedil;in bir numarat&amp;ouml;r sağlanır. IEnumerable aray&amp;uuml;z&amp;uuml;n&amp;uuml;n sağladığı GetEnumerator metodu geriye IEnumerator aray&amp;uuml;z&amp;uuml; tipinden bir nesne &amp;ouml;rneği d&amp;ouml;nd&amp;uuml;rmektedir ve bizim i&amp;ccedil;in gerekli olan numarat&amp;ouml;r&amp;uuml;n kendisidir. IEnumerator ise &amp;ccedil;oğunlukla dahili bir sınıfa (inner class) uygulanır ve iterasyon i&amp;ccedil;in gerekli asıl metodları sağlar. Bu metodlardan MoveNext bir sonraki elemanın olup olmadığını bool tipinden d&amp;ouml;nd&amp;uuml;ren bir işleve sahip iken, Current metodu o anki elemanı iterasyona devreder. Bu iki aray&amp;uuml;z&amp;uuml; kullanarak bir sınıf i&amp;ccedil;indeki elemanlar &amp;uuml;zerinde iterasyona izin verecek yapıyı kurmak biraz karmaşıktır. Aslında teknik son derece kolaydır sadece uygulanabilirliği ilk zamanlarda biraz kafa karıştırıcıdır. İlk olarak C# 1.1 i&amp;ccedil;in bahsetmiş olduğumuz iterasyon tekniğinin nasıl ger&amp;ccedil;ekleştirildiğini inceleyeceğimiz bir &amp;ouml;rnek geliştirelim.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizde her hangi bir işi simgeleyen bir sınıfımız olacak. Bu sınıfımızın modeli basit olarak aşağıdaki kod par&amp;ccedil;asında olduğu gibidir. IsBilgisi isimli sınıfımız basit olarak bir işin adını ve sorumlusuna ait bilgileri tutacak şekilde tasarlanmıştır. İşe ait bilgileri tutan iki &amp;ouml;zelliği ve aşırı y&amp;uuml;klenmiş(overload) bir yapıcı metodu(constructor) mevcuttur.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class IsBilgisi 
{
    private string m_IsAdi;
    private string m_IsSorumlu;
    public string IsAdi
    {
        get
        {
            return m_IsAdi;
        }
        set
        {
            m_IsAdi=value;
        }
    }
    public string IsSorumlu
    {
        get
        {
            return m_IsSorumlu;
        }
        set
        {
            m_IsSorumlu=value;
        }
    }

    public IsBilgisi(string isAdi,string isSorumlu)
    {
        m_IsAdi=isAdi;
        m_IsSorumlu=isSorumlu;
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi IsBilgisi sınıfı tipinden 3 elemanı b&amp;uuml;nyesinde barındıracak bir listeleme sınıfı tasarlayacağız. Amacımız IsBilgisi tipinden dizinin elemanlarına foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml; kullanarak IsListesi nesnesi &amp;uuml;zerinden erişebilmek. Yani aşağıdaki kodun &amp;ccedil;alıştırılmasını sağlamak istiyoruz. Burada dikkat ederseniz foreach d&amp;ouml;ng&amp;uuml;m&amp;uuml;z, &lt;em&gt;"liste isimli IsListesi &amp;ouml;rneğindeki her bir IsBilgisi tipinden nesne &amp;ouml;rneği i&amp;ccedil;in ilerle"&lt;/em&gt; gibisinden bir iterasyon ger&amp;ccedil;ekleştirmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;IsListesi liste=new IsListesi();
foreach(IsBilgisi i in liste)
{
      Console.WriteLine(i.IsAdi+" "+i.IsSorumlu);
}&lt;/pre&gt;
&lt;p&gt;Normal şartlarda eğer IsListesi isimli sınıfımıza IEnumerable ve IEnumerator aray&amp;uuml;zlerini kullandığımız iterasyon tekniğini uygulamazsak bu kod derleme zamanında foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml;n uygulanamıyacağına dair hata mesajı verecektir. Yani IsListesi sınıfımızın kodunun başlangı&amp;ccedil;ta aşağıdaki gibi olduğunu d&amp;uuml;ş&amp;uuml;n&amp;uuml;rsek; &amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class IsListesi
{
    static IsBilgisi[] Isler=new IsBilgisi[3]; 
    private void ListeOlustur()
    {
        IsBilgisi is1=new IsBilgisi("Birinci iş","Burak");
        IsBilgisi is2=new IsBilgisi("İkinci iş","Jordan");
        IsBilgisi is3=new IsBilgisi("&amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; iş","Vader");
        Isler[0]=is1;
        Isler[1]=is2;
        Isler[2]=is3;
    }

    public IsListesi()
    { 
        ListeOlustur();
    }
}&lt;/pre&gt;
&lt;p&gt;derleme zamanında aşağıdaki hata mesajını alırız. &amp;nbsp;&lt;/p&gt;
&lt;table id="table6" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;foreach statement cannot operate on variables of type 'Using_Iterators_CSharp_1.IsListesi' because 'Using_Iterators_CSharp_1.IsListesi' &lt;strong&gt;does not contain a definition for 'GetEnumerator',&lt;/strong&gt; or it is inaccessible&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;&amp;Ccedil;&amp;uuml;nk&amp;uuml; foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml;n IsListesi sınıfı i&amp;ccedil;indeki IsBilgisi nesnelerine nasıl erişeceği ve onlar &amp;uuml;zerinde ileri y&amp;ouml;nl&amp;uuml; nasıl hareket edeceği bilinmemektedir. Bu nedenle IsListesi sınıfımız aşağıdaki gibi oluşturulmalıdır. Buradaki amacımız C# 1.1 i&amp;ccedil;in iterasyon tekniğini incelemek olduğundan ana fikirde IsBilgisi sınıfı tipinden 3 elemanlı bir dizi kullanılmaktadır.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;// Iterasyonu sağlayabilmek i&amp;ccedil;in IEnumerable aray&amp;uuml;z&amp;uuml;n&amp;uuml; uyguluyoruz.
public class IsListesi:IEnumerable
{
    // IsBilgisi tipinden nesne &amp;ouml;rneklerini taşıyacak dizimiz tanımlanıyor.
    static IsBilgisi[] Isler=new IsBilgisi[3]; 
    // Isler isimli diziyi dolduracak basit bir metod.
    private void ListeOlustur()
    {
        IsBilgisi is1=new IsBilgisi("Birinci iş","Burak");
        IsBilgisi is2=new IsBilgisi("İkinci iş","Jordan");
        IsBilgisi is3=new IsBilgisi("&amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; iş","Vader");
        Isler[0]=is1;
        Isler[1]=is2;
        Isler[2]=is3;
    }

    public IsListesi()
    { 
        // IsListesi nesne &amp;ouml;rneğimiz oluşturulurken Isler isimli dizimizde IsBilgisi tipinden elemanlar ile dolduruluyor.
        ListeOlustur();
    }

    #region IEnumerable Members

    // GetEnumerator metodu IsListesi sınıfımızdaki Isler dizisinin elemanlarında hareket edebilmemiz i&amp;ccedil;in gerekli numarat&amp;ouml;r nesne &amp;ouml;rneğini geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;yor
    public IEnumerator GetEnumerator()
    {
        return new Numarator();
    }

    #endregion

    // Isler dizisindeki elemanlarda foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml; kullanarak IsListesi sınıfı &amp;uuml;zerinden ileri y&amp;ouml;nl&amp;uuml; ve yanlız okunabilir iterasyon yapmamızı sağlayacak inner class' ımızı olusturuyor ve bu sınıfa IEnumerator aray&amp;uuml;z&amp;uuml;n&amp;uuml; uyguluyoruz.
    private class Numarator:IEnumerator
    {
        // Dizideki elemanı temsil edecek bir indeks değeri tanımlıyoruz.
        int indeks=-1;
    
        #region IEnumerator Members
    
        public void Reset()
        {
            indeks=-1;
        }
    
        // G&amp;uuml;ncel IsBilgisi elemanını indeks değerini kullanarak Isler dizisi &amp;uuml;zerinden object tipinde geriye d&amp;ouml;nd&amp;uuml;ren bir &amp;ouml;zellik. Dikkat ederseniz yanlızca get bloğu var. Bu nedenle foreach d&amp;ouml;ng&amp;uuml;lerinin sağladığı iterasyon i&amp;ccedil;inde elemanlar &amp;uuml;zerinde değişiklik yapamıyoruz.
        public object Current
        {
            get
            {
                return Isler[indeks];
            }
        }

        // İterasyonun devam edip etmemesine karar verebilmek i&amp;ccedil;in, şu anki elemandan sonra gelen bir elemanının varlığı tespit edilmelidir. Bunu MoveNext metodu bool tipinden bir değer d&amp;ouml;nd&amp;uuml;rerek foreach mekanizmasına anlatır. Bizim kontrol etmemiz gereken g&amp;uuml;ncel indeks değerinin Isler isimli dizinin uzunluğundan fazla olup olmadığıdır.
        public bool MoveNext()
        {
            if(++indeks&amp;gt;=Isler.Length)
                return false;
            else
                return true;
        }
    
        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi bu elemanları kullanan basit bir console uygulmasını &amp;ccedil;alıştırdığımızda aşağıdakine benzer bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk128_1.gif" alt="" width="404" height="131" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Her ne kadar uygulamamız istediğimiz bi&amp;ccedil;imde &amp;ccedil;alışsada bizim i&amp;ccedil;in bir takım zorluklar vardır. İlki kod yazımının bir desen dahilinde de olsa uzun oluşudur. İkinci zorluk foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml; i&amp;ccedil;inde kullanılan elemanlar i&amp;ccedil;in tip g&amp;uuml;venliğinin (type-safety) olmayışıdır. Dikkat ederseniz IEnumerator aray&amp;uuml;z&amp;uuml;n&amp;uuml;n sağladığı Current isimli metodumuz object tipinden elemanları geriye d&amp;ouml;nd&amp;uuml;rmektedir. Oysaki biz sadece IsBilgisi nesnesi tipinden elemanları geriye d&amp;ouml;nd&amp;uuml;recek bir Current metodunu pekala isteyebiliriz. Hatta bu bize tip g&amp;uuml;venliğinide sağlayacaktır.&lt;/p&gt;
&lt;p&gt;İşte C# 2.0 hem uzun kod satırlarının &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;en hem de tip g&amp;uuml;venliğini sağlayan yeni bir yapı getirmiştir. Yapının temelinde yine IEnumerable aray&amp;uuml;z&amp;uuml; yer almaktadır. Yeni generic tipleri sayesinde, iterasyonun bizim belirttiğimiz tiplere y&amp;ouml;nelik olarak ger&amp;ccedil;ekleştirilebilecek olmasıda garanti altına alınmaktadır. Bu da aradığımız tip g&amp;uuml;venliğini bize sağlar. Yukarıda geliştirmiş olduğumu yapıyı C# 2.0' da aşağıdaki şekilde d&amp;uuml;zenleriz.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Text;

namespace UsingIterators
{
    public class IsListesi:IEnumerable&amp;lt;IsBilgisi&amp;gt; 
    {
        static IsBilgisi[] Isler = new IsBilgisi[3];
        private void ListeOlustur()
        {
            IsBilgisi is1 = new IsBilgisi("Birinci iş", "Burak");
            IsBilgisi is2 = new IsBilgisi("İkinci iş", "Jordan");
            IsBilgisi is3 = new IsBilgisi("&amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; iş", "Vader");
            Isler[0] = is1;
            Isler[1] = is2;
            Isler[2] = is3;
        }

        public IsListesi()
        { 
            ListeOlustur();
        }

        #region IEnumerable&amp;lt;IsBilgisi&amp;gt; Members

        IEnumerator&amp;lt;IsBilgisi&amp;gt; IEnumerable&amp;lt;IsBilgisi&amp;gt;.GetEnumerator()
        {
            yield return Isler[0];
            yield return Isler[1];
            yield return Isler[2];
        }

        #endregion

        #region IEnumerable Members

        System.Collections.IEnumerator System.Collections.IEnumerable.GetEnumerator()
        {
            throw new Exception("The method or operation is not implemented.");
        }

        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulama kodumuza kısaca bir g&amp;ouml;z gezdirirsek en b&amp;uuml;y&amp;uuml;k yeniliklerden birisinin IEnumerable aray&amp;uuml;z&amp;uuml;n&amp;uuml;n uygulanışı sırasında ki generic tip tanımlaması olduğunu farkedebiliriz.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class IsListesi:IEnumerable&amp;lt;IsBilgisi&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu tanımlama ile basit&amp;ccedil;e, IsListesi nesnesinin uygulayacağı IEnumerable aray&amp;uuml;z&amp;uuml;n&amp;uuml;n, IsBilgisi tipinden nesne &amp;ouml;rnekleri i&amp;ccedil;in ge&amp;ccedil;erli olacağı belirtilmektedir. Bu tahmin edebileceğiniz gibi, tip g&amp;uuml;venliği dediğimiz ihtiyacı karşılamaktadır (type safety).&lt;/p&gt;
&lt;p&gt;Diğer &amp;ouml;nemli bir değişiklik IEnumerator aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamış olduğumuz her hangi bir dahili sınıfın (inner class) burada yer almayışıdır. Son olarak yield anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml;n kullanımıda en b&amp;uuml;y&amp;uuml;k yeniliktir. yield anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; C# 2.0 ile gelen yeni anahtar s&amp;ouml;zc&amp;uuml;klerden birisidir. IEnumerator&amp;lt;T&amp;gt; tipinden nesne &amp;ouml;rneğini geri d&amp;ouml;nd&amp;uuml;ren metodumuz i&amp;ccedil;erisinde kullanılmaktadır.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;IEnumerator&amp;lt;IsBilgisi&amp;gt; IEnumerable&amp;lt;IsBilgisi&amp;gt;.GetEnumerator()
{
       yield return Isler[0];
       yield return Isler[1];
       yield return Isler[2];
}&lt;/pre&gt;
&lt;p&gt;Dikkat ederseniz Isler isimli dizimizde yer alan her eleman i&amp;ccedil;in yield return s&amp;ouml;z dizimi kullanılmıştır. Aslında aynı işlevi aşağıdaki kod ilede karşılıyabiliriz. &amp;Uuml;stelik bu &amp;ccedil;ok daha profesyonel bir yaklaşımdır. Temel olarak anlamamız gereken yield return' &amp;uuml;n ilgili dizi i&amp;ccedil;indeki her bir eleman i&amp;ccedil;in kullanılıyor olmasıdır. &amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;IEnumerator&amp;lt;IsBilgisi&amp;gt; IEnumerable&amp;lt;IsBilgisi&amp;gt;.GetEnumerator()
{
    for (int i = 0; i &amp;lt; Isler.Length; i++)
    {
        yield return Isler[i];
    }
}&lt;/pre&gt;
&lt;p&gt;Kısacası artık yeni iterasyon modelimizde tek yapmamız gereken, foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml;ne dahil olacak elemanların ilgili numarator metodu i&amp;ccedil;inde yield anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; kullanılarak geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesini sağlamaktır. &amp;Ouml;rneğin aşağıdaki kod par&amp;ccedil;asının ekran &amp;ccedil;ıktısını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;IEnumerator&amp;lt;IsBilgisi&amp;gt; IEnumerable&amp;lt;IsBilgisi&amp;gt;.GetEnumerator()
{
    yield return Isler[2];
    yield return Isler[1];
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk128_5.gif" alt="" width="364" height="119" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat ederseniz foreach iterasyonumuz yield ile hangi elemanları hangi sırada d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ysek ona g&amp;ouml;re &amp;ccedil;alışmıştır.&lt;/p&gt;
&lt;p&gt;Uygulamadaki gelişimi bir de IL kodu a&amp;ccedil;ısından d&amp;uuml;ş&amp;uuml;nmek lazım. Aslında temelde numaralandırıcının kullanılması i&amp;ccedil;in gerekli olan IEnumerator bazlı bir inner class yine kullanılmaktadır. Bu sadece kod yazımında yapılmamaktadır. &amp;Ouml;yleki, C# 1.1 i&amp;ccedil;in geliştirdiğimiz &amp;ouml;rneğin IL koduna ilDasm aracı ile bakarsak aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; yakalarız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk128_4.gif" alt="" width="422" height="600" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat ederseniz burada Numarator isimli dahili sınıfımız (inner class) ve ona IEnumerator aray&amp;uuml;z&amp;uuml; vasıtasıyla uyguladığımız &amp;uuml;yeler g&amp;ouml;r&amp;uuml;lmektedir. Birde C# 2.0 i&amp;ccedil;in geliştirdiğimiz &amp;ouml;rneğin IL koduna bir bakalım.&amp;nbsp;&lt;/p&gt;
&lt;table id="table8" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Şu anki beta versiyonuna g&amp;ouml;re IlDasm aracının fiziki adresi &lt;strong&gt;\Program Files\Microsoft Visual Studio 8\SDK\v2.0\Bin\ildasm.exe&lt;/strong&gt; dır.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Dikkat ederseniz biz IEnumerator aray&amp;uuml;z&amp;uuml;n&amp;uuml; kullanarak bir dahili sınıfı yazmamış olsakta, IL kodunun detaylarında b&amp;ouml;yle bir yapının kullanıldığı g&amp;ouml;r&amp;uuml;lmektedir. Tabi burada bir &amp;ouml;nceki versiyondan farklı olarak, generic tip uyarlamasıda mevcuttur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk128_3.gif" alt="" width="516" height="674" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Artık uygulamamız i&amp;ccedil;in aşağıdaki kod par&amp;ccedil;asını başarılı bir şekilde &amp;ccedil;alıştırabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;IsListesi isListesi = new IsListesi();
foreach (IsBilgisi i in isListesi)
{
    Console.WriteLine(i.IsAdi + " " + i.IsSorumlu);
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk128_2.gif" alt="" width="364" height="119" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi C# 2.0 ile iteratif işlemlerin alt yapısının oluşuturlması C# 1.1 ' e g&amp;ouml;re daha az kod yazarak kolayca ger&amp;ccedil;ekleştirilebiliyor. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2005-07-05 12:00:00</pubDate>
  <slug>C#-2-0-İçin-İterasyon-Yenilikleri-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#-2</tag>
    <tag>yield</tag>
    <tag>iterations</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>