<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Screencast - Ajax Enabled WCF Service’ lerin Silverlight ile Kullanılması</title>
  <description>Daha önceki görsel derslerimizde WCF RIA Service ve Proxy bazlı WCF Service örneklerinin, Silverlight tarafında nasıl kullanılabildiklerini yeri geldikçe irdelemeye çalışmıştık. Silverlight uygulamalarının ASP.NET gibi Web ortamlarında sunulduğu göz önüne alındığında, kullanabileceği servis tiplerinden birisi de AJAX Enabled WCF Service' leridir ki özellikle Web Form' lar üzerinde bu tip servisler sıklıkla kullanılmaktadır. Söz gelimi otomatik metin tamamlama işlemlerinde...(Aslında AJAX tabanlı WCF Service' leri dışında ASMX tipindeki AJAX Service' leri de söz konusudur ama bu görsel dersimizde ele alınmamaktadır)</description>
  <content>&lt;p&gt;&lt;img style="float: left;" src="http://www.buraksenyurt.com/pics/2010%2f3%2fblg169_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Daha &amp;ouml;nceki g&amp;ouml;rsel derslerimizde &lt;strong&gt;WCF RIA Service &lt;/strong&gt;ve &lt;strong&gt;Proxy &lt;/strong&gt;bazlı &lt;strong&gt;WCF Service &lt;/strong&gt;&amp;ouml;rneklerinin, &lt;strong&gt;Silverlight &lt;/strong&gt;tarafında nasıl kullanılabildiklerini yeri geldik&amp;ccedil;e irdelemeye &amp;ccedil;alışmıştık. &lt;strong&gt;Silverlight &lt;/strong&gt;uygulamalarının &lt;strong&gt;ASP.NET&lt;/strong&gt; gibi Web ortamlarında sunulduğu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında, kullanabileceği servis tiplerinden birisi de &lt;a href="/admin/app/editor/post/Screencast-Ajax-Enabled-WCF-Servicelerin-Silverlight-ile-Kullanilmasi" target="_blank"&gt;AJAX enabled WCF servisleridir&lt;/a&gt; ki&amp;nbsp;&amp;ouml;zellikle Web Form' lar &amp;uuml;zerinde bu tip servisler sıklıkla kullanılmaktadır. S&amp;ouml;z gelimi otomatik metin tamamlama işlemlerinde...&lt;em&gt;(Aslında &lt;strong&gt;AJAX &lt;/strong&gt;tabanlı &lt;strong&gt;WCF Service&lt;/strong&gt;' leri dışında &lt;strong&gt;ASMX &lt;/strong&gt;tipindeki &lt;strong&gt;AJAX Service&lt;/strong&gt;' leri de s&amp;ouml;z konusudur ama bu g&amp;ouml;rsel dersimizde ele alınmamaktadır)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;İşte bu g&amp;ouml;rsel dersimizde &amp;ouml;ncelikli olarak bir &lt;strong&gt;AJAX Enabled WCF Service&lt;/strong&gt; geliştirip, bunu &amp;ouml;rnek bir &lt;strong&gt;Silverlight &lt;/strong&gt;uygulamasında nasıl kullanabileceğimizi g&amp;ouml;rmeye &amp;ccedil;alışıyor olacağız. Geliştireceğimiz &amp;ouml;rnekte servis ve &lt;strong&gt;Silverlight &lt;/strong&gt;uygulamasının aynı domain i&amp;ccedil;erisinde yer aldıklarını farz ediyor olacağız ki ilerleyen g&amp;ouml;rsel derslerimizde ayrı domain' lerdeki servisleri nasıl değerlendirebileceğimizi de incelemeye &amp;ccedil;alışacağız. E haydi o zaman, ne duruyorsunuz? &lt;strong&gt;&lt;a title="NedirTv?" href="http://www.nedirtv.com" target="_blank"&gt;NedirTv?&lt;/a&gt;&lt;/strong&gt; sponsorluğunda hazırladığımız g&amp;ouml;rsel dersimizi izleyin.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;Not :&lt;/strong&gt; Dersin ilerleyen kısımlarında, arka planda bizim ufaklığın ve onu memnun etmeye &amp;ccedil;alışan ev ahalisinin derinden gelen seslerini duyabilirsiniz. Ama dikkati dağıtacak derecede olmayacaktır.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;iframe src="https://www.youtube.com/embed/2cgM8ScN9No" width="560" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;S&amp;uuml;re :&lt;/strong&gt; 14:27&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Dosya Boyutu : &lt;/strong&gt;24 Mb&lt;/p&gt;
&lt;p&gt;&lt;a title="Ajax Enabled WCF Service' lerin Silverlight İstemcilerinde Kullanılması" href="http://www.nedirtv.com/video/Ajax-Enabled-WCF-Service8217-lerin-Silverlight-ile-Kullanilmasi.aspx" target="_blank"&gt;&lt;strong&gt;Download Etmek veya İndirmek İ&amp;ccedil;in&lt;/strong&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://www.buraksenyurt.com/pics/2010%2f3%2fSilverlightApplication6.rar"&gt;SilverlightApplication6.rar (100,34 kb)&lt;/a&gt;&lt;strong&gt; [&amp;Ouml;rnek Visual Studio 2010 RC S&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde geliştirimiş ve test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-03-31 05:35:00</pubDate>
  <slug>Screencast-Ajax-Enabled-WCF-Servicelerin-Silverlight-ile-Kullanilmasi</slug>
  <tags>
    <tag>screencast</tag>
    <tag>ajax</tag>
    <tag>ajax-enabled-wcf-services</tag>
    <tag>wcf</tag>
    <tag>silverlight</tag>
  </tags>
  <categories>
    <category>Silverlight 4.0</category>
    <category>WCF</category>
  </categories>
</post>