<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tek Fotoluk İpucu 158 - GoLang'de Constructor var mı?</title>
  <description>GO tam anlamıyla nesne yönelimli bir dil değildir. Object yerine aslında Type kavramının öne çıktığı bir ortam söz konusudur. Geliştirici tanımlı tipler için struct'lardan yararlanılır ve onların varsayılan olarak doğal yapıcı metodları(constructor) vardır. Ancak istersek kendi yapıcı metodlarımızı da işin içerisine dahil edebiliriz.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;GO tam anlamıyla nesne y&amp;ouml;nelimli&lt;em&gt;(Object Oriented)&lt;/em&gt; bir dil değildir. Hatta object terimi yerine Type kavramının daha &amp;ccedil;ok &amp;ouml;ne &amp;ccedil;ıktığı bir programlama dilidir. Geliştirici tanımlı tipler i&amp;ccedil;in struct'lardan yararlanılır ve onların &amp;ouml;rneklenmesinde kullanılabilecekk doğal yapıcı metodlar&lt;em&gt;(built-in constructor)&lt;/em&gt; vardır. Yine de istersek kendi yapıcı metodlarımızı yazabiliriz. Nasıl mı? Aynen aşağıdaki fotoğrafta olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/05/tfi158.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Az da olsa birazcık&amp;nbsp;hile var gibi değil mi? Product isimli struct tipinin built-in constructor ile nasıl &amp;uuml;retildiğini 10ncu satırda g&amp;ouml;rebiliriz. car isimli değişken dinamik olarak t&amp;uuml;rlendirilmiş ve := operat&amp;ouml;r&amp;uuml; sonrasında gelen ifade i&amp;ccedil;erisinde tip niteliklerine ilk değerleri verilmiştir. Bu zaten GO'nun sunduğu varsayılan yapıcıdır. Biz hafiften abstract factory design pattern benzeri bir &amp;ccedil;&amp;ouml;z&amp;uuml;m uyguladık. NewProduct metodu parametre olarak aldığı bilgilere g&amp;ouml;re GO'nun built-in yapıcı metod &amp;ouml;zelliğini kullanarak yeni bir &amp;uuml;r&amp;uuml;n tipini geriye d&amp;ouml;nd&amp;uuml;rmektedir. Bir nevi kendi yapıcı metodumuzu yazmış olduğumuzu ifade edebiliriz. Basit ama bir Object Oriented programcısı i&amp;ccedil;in tuhaf. Bir başka ipucunda g&amp;ouml;r&amp;uuml;şmek &amp;uuml;zere hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-05-16 18:17:00</pubDate>
  <slug>tek-fotoluk-ipucu-158-golang-de-constructor-var-mi</slug>
  <tags>
    <tag>go-programming-language</tag>
    <tag>golang</tag>
    <tag>tek-fotoluk-ipucu</tag>
    <tag>struct</tag>
    <tag>type</tag>
    <tag>factory-design-pattern</tag>
  </tags>
  <categories>
    <category>GoLang</category>
  </categories>
</post>