<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Node.js ile Basit Cluster Kurguları</title>
  <description>NodeJS ile yazdığımız uygulamaları genel olarak node [application_name.js] şeklinde çalıştırıyoruz/çalıştırıyordum. Aslında bu durumda söz konusu uygulama tekil bir iş parçası olarak(Single Thread) çalışmakta. Dolayısıyla birden fazla iş parçacığını çalıştırıp tüm işlemci/çekirdek gücünü almaktan yoksun kalıyoruz. Aslında özellikle web sunucuları/servisleri geliştirebileceğimiz etkili bir ortam söz konusu iken bu tip bir avantajdan faydalanamamak yazık olurdu. NodeJS ile birlikte gelen cluster isimli modül bu konuda önemli fonksiyonellikler sunuyor.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/04/clustering_5.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Programcılıkla uğraşan bizim gibi organizmalar s&amp;uuml;kunetle kod&amp;nbsp;yazmaya bayılır. Hatta her şeyin sorunsuz işlediği, test'lerin pr&amp;uuml;zs&amp;uuml;z ilerlediği, taşımaların tereyağından kıl &amp;ccedil;eker gibi&amp;nbsp;kolay olduğu bir yaşam alanı d&amp;uuml;şler.&amp;nbsp;Ne yazık ki&amp;nbsp;ger&amp;ccedil;ek hayat &amp;ccedil;oğu zaman b&amp;ouml;yle değildir. Bilirsiniz işte...Sıkışık proje s&amp;uuml;releri,&amp;nbsp;anlamakta g&amp;uuml;&amp;ccedil;l&amp;uuml;k &amp;ccedil;ektiğimiz&amp;nbsp;iş s&amp;uuml;re&amp;ccedil;leri, değişen ve &amp;ouml;ğrenmemiz gereken yeni nesil teknolojiler, aniden ortaya &amp;ccedil;ıkan Murphy kanunları vs derken bir bakmışız ki barut fı&amp;ccedil;ısına d&amp;ouml;nm&amp;uuml;ş&amp;uuml;z.&amp;nbsp;Kim bilir ka&amp;ccedil; kere i&amp;ccedil;imizden&amp;nbsp;bir Hulk fırlamak &amp;uuml;zere d&amp;uuml;şe gelmiştir. Bazen benim de bu tip gıcık olduğum anlar olmuyor değil. Zaten &amp;ccedil;alışılması zor, huysuz ve aksi bir insanken bunlara birde ters giden işler eklenince, iyice &amp;ccedil;ekilmez oluyorum.&lt;/p&gt;
&lt;p&gt;Ancak&amp;nbsp;son yıllarda kendime g&amp;uuml;zel bir tedavi y&amp;ouml;ntemi bulduğumu s&amp;ouml;yleyebilirim. &amp;Ouml;yle ki&amp;nbsp;&amp;uuml;zerimdeki t&amp;uuml;m negatif enerjiyi&amp;nbsp;alıp g&amp;ouml;t&amp;uuml;rmeye yetiyor&lt;em&gt;(En azından 2003ten beri işe yaradığını s&amp;ouml;yleyebilirim)&lt;/em&gt; Ge&amp;ccedil;tiğimiz hafta i&amp;ccedil;ersinde de b&amp;ouml;yle hafiften gerginleşen sinirlerimi yatıştırmak i&amp;ccedil;in atladım Red Enterprise'ın akşamki ilk trenine, d&amp;uuml;şt&amp;uuml;m West-World yollarına. G&amp;uuml;n&amp;nbsp;batarken&amp;nbsp;Node oteldeki odama &amp;ccedil;oktan yerleşmiş taze&amp;nbsp;demlenmiş &amp;ccedil;ayımı yudumluyordum bile. Kulaklarımda Freddie Hultana'dan Le Practicante'si tınlarken&amp;nbsp;a&amp;ccedil;tım &amp;ouml;zet notlarımı ve başladım yazmaya.&lt;/p&gt;
&lt;h1&gt;&amp;Ouml;l&amp;ccedil;eklenebilirlik(Scalability) ve Node.js&lt;/h1&gt;
&lt;p&gt;Node.js ile yazdığımız uygulamaları genel olarak node [application_name.js] şeklinde &amp;ccedil;alıştırıyoruz/&amp;ccedil;alıştırıyordum. Aslında bu durumda s&amp;ouml;z konusu uygulama tekil bir iş par&amp;ccedil;acığı olarak&lt;em&gt;(Single Thread)&lt;/em&gt; &amp;ccedil;alışmakta. Dolayısıyla birden fazla iş par&amp;ccedil;acığını &amp;ccedil;alıştırıp t&amp;uuml;m işlemci/&amp;ccedil;ekirdek g&amp;uuml;c&amp;uuml;n&amp;uuml; almaktan yoksun kalıyoruz. Aslında &amp;ouml;zellikle web sunucuları/servisleri geliştirebileceğimiz etkili bir ortam s&amp;ouml;z konusu iken bu tip bir avantajdan faydalanamamak yazık olurdu. NodeJS ile birlikte gelen cluster isimli mod&amp;uuml;l bu konuda bize &amp;ouml;nemli fonksiyonellikler sunuyor.&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re bir iş par&amp;ccedil;acığını &amp;ccedil;atallayarak(fork) alt iş par&amp;ccedil;acıkları oluşturmamız m&amp;uuml;mk&amp;uuml;n. Bu iş par&amp;ccedil;acıklarını işlemci veya &amp;ccedil;ekirdek sayısına g&amp;ouml;re&amp;nbsp;oluşturarak aynı uygulamanın kendi bellek alanlarında &amp;ccedil;alışacak farklı &amp;ouml;rneklerini işletmemiz m&amp;uuml;mk&amp;uuml;n oluyor. Bunu daha &amp;ccedil;ok bir web sunucusunu birinci seviyede &amp;ouml;l&amp;ccedil;eklemek i&amp;ccedil;in kullanabiliriz. Yani web suncusuna gelen talepler i&amp;ccedil;in aynı adres:port'un farklı &amp;ccedil;alışma zamanı &amp;ouml;rneklerine y&amp;ouml;nlendirme yapılacak şekilde basit bir &amp;ouml;l&amp;ccedil;ekleme mekanizması kurgulayabiliriz&lt;em&gt;(Sonlara doğru buna bir &amp;ouml;rnek vereceğiz)&lt;/em&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Node.js'in tasarımı gereği&amp;nbsp;dağıtık uygulamaların&lt;em&gt;(Distributed Applications)&lt;/em&gt; farklı boğumlarda &amp;ccedil;alıştırılabilmesi &amp;uuml;zerine kurulmuştur. Nitekim &amp;ccedil;oklu iş par&amp;ccedil;acıklarını kullanmak bir Node.js uygulamasını &amp;ouml;l&amp;ccedil;eklemenin en etkili yoludur.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;cluster mod&amp;uuml;l&amp;uuml;n&amp;uuml; kullanarak yazacağımız mekanizma olduk&amp;ccedil;a basit. Tek bir uygulamaya gelen talepleri master veya child olma hallerine g&amp;ouml;re değerlendireceğiz. Uygulama ilk &amp;ccedil;alıştığında cluster modeline g&amp;ouml;re master process konumunda olacaktır. Bu koşula bakarak istediğimiz sayıda alt iş par&amp;ccedil;acığını(child process)&amp;nbsp;oluşturabiliriz. Tabii istediğimiz sayıda derken bunu abartmamak, belli bir standarda g&amp;ouml;re yapmak&lt;em&gt;(&amp;ouml;rneğin işlemci/&amp;ccedil;ekirdek sayısı kadar)&lt;/em&gt; daha doğru bir yaklaşım olacaktır. Bu noktada aklıma Microsoft'un Task Parallel Library ile ilgili oluşturduğu dok&amp;uuml;man geldi. Tekrar konumuza d&amp;ouml;nelim. Uygulama başlatıldı, master iş par&amp;ccedil;acığında&amp;nbsp;olduğumuz fark edildi ve ana iş, alt par&amp;ccedil;acıklara&amp;nbsp;&amp;ccedil;atallanmaya başlandı. Her &amp;ccedil;atal aslında aynı uygulamanın yeni bir &amp;ouml;rneğinin de başlatılması anlamına gelir. Buna g&amp;ouml;re aynı uygulamaya bu kez bir alt iş par&amp;ccedil;acığı&amp;nbsp;olarak gelinecektir. Bunu da cluster'ın master olmama halinde ele alabiliriz ki bu sayede aynı uygulama kodu i&amp;ccedil;erisinde alt iş par&amp;ccedil;acıklarını&amp;nbsp;da kontrol edebiliriz.&lt;/p&gt;
&lt;p&gt;Pek tabii oluşan bu alt iş par&amp;ccedil;acıkları&amp;nbsp;ve ana iş par&amp;ccedil;acığının&amp;nbsp;aralarında haberleşmesi gerekebilir. Bu noktada her iş par&amp;ccedil;acığının kendi &amp;ouml;rneğine sahip olduğunu&lt;em&gt;(hatta kendi V8 tabanlı &amp;ouml;rneğini &amp;ccedil;alıştırdığını)&lt;/em&gt; ve belleği ortaklaşa &lt;span style="text-decoration: underline;"&gt;paylaşmadıklarını&lt;/span&gt; belirtmemiz gerekiyor. Ancak birbirlerine mesaj g&amp;ouml;nderebilirler.&amp;nbsp;Bu mesajlaşma trafiği de &lt;a href="https://www.geeksforgeeks.org/inter-process-communication/" target="_blank"&gt;şu adreste&lt;/a&gt; detaylarını bulabileceğiniz Inter Process Communication standardı ile sağlanmakta. Kısaca ana iş par&amp;ccedil;acığı&amp;nbsp;alt iş par&amp;ccedil;acıklarına veya alt iş par&amp;ccedil;acıkları da ana iş par&amp;ccedil;acığına&amp;nbsp;mesaj g&amp;ouml;nderebilir. &amp;Ouml;rneğe ge&amp;ccedil;meden &amp;ouml;nce son olarak ana iş&amp;nbsp;par&amp;ccedil;acığının &amp;ccedil;eşitli olaylar ile alt iş par&amp;ccedil;acıklarını takip edebildiğini de belirtelim&lt;em&gt;(fork, online, listening, exit)&lt;/em&gt;&lt;/p&gt;
&lt;h1&gt;Hello Clustering&lt;/h1&gt;
&lt;p&gt;Dilerseniz &amp;ccedil;ok basit bir &amp;ouml;rnek ile konuyu anlamaya &amp;ccedil;alışalım. Alışılageldiği &amp;uuml;zere kodları Ubuntu sisteminde Visual Studio Code ile geliştiriyorum.&lt;/p&gt;
&lt;p&gt;cluster_sample_1.js&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;var cluster = require('cluster');

if (cluster.isMaster) {
    console.log('Master process ' + process.pid);
    for (var i = 0; i &amp;lt; 4; i++) {
        console.log('Worker #' + i + ' is starting.');
        cluster.fork();
    }

    cluster.on('fork', function (worker) {
        console.log('\tfork event (worker ' + worker.process.pid + ')');
    });

    cluster.on('online', function (worker) {
        console.log('\tonline event (worker ' + worker.process.pid + ')');
    })

    cluster.on('exit', function (worker) {
        console.log('\texit event (worker ' + worker.process.pid + ')');
    });

} else {
    console.log('Aloha. My name is worker #' + process.pid);
    cluster.worker.destroy();
}&lt;/pre&gt;
&lt;p&gt;&amp;Ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/clustering_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Neler oldu bir bakalım? Kodu ilk &amp;ccedil;alıştırdığımızda isMaster kontrol&amp;uuml;ne girdik ve o anda ana iş par&amp;ccedil;acığı&amp;nbsp;s&amp;ouml;z konusuydu. D&amp;ouml;rt tane alt iş par&amp;ccedil;acığı&amp;nbsp;oluşturduk. Bunun i&amp;ccedil;in fork metodundan yararlanıyoruz. Sonrasında bazı olayları ele almak i&amp;ccedil;in fonksiyonellikler dahil ettik. Bir alt iş par&amp;ccedil;acığı oluştuğunda fork, yaşamaya başladığında online ve yok edildiğinde exit olayları &amp;ccedil;alışır. Başka olaylar da var. İlerleyen kodlarda g&amp;ouml;receğiz. fork fonksiyonunun etkisi aynı kodun tekrar &amp;ccedil;alıştırılmasıdır. Bu durumda else bloğuna gireceğiz &amp;ccedil;&amp;uuml;nk&amp;uuml; ilk alt iş par&amp;ccedil;acığı oluştuğu andan tamamı sonlanıncaya kadar isMaster false d&amp;ouml;necektir. else bloğunda bu koda &amp;ouml;zel sadece destroy işlemini uyguluyoruz. Kısacası alt iş par&amp;ccedil;acıkları oluşuyor ve yok ediliyorlar. Ana ve alt iş par&amp;ccedil;acıklarını iyi izeyebilmek i&amp;ccedil;in Process ID değerlerini kullandık. T&amp;uuml;m olaylar dikkat edileceği &amp;uuml;zere bir callback fonksiyonu i&amp;ccedil;ermekte.&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;İş Par&amp;ccedil;acıkları Arası Mesajlaşma&lt;/h1&gt;
&lt;p&gt;Şimdi bir de master ve child iş par&amp;ccedil;acıklarının nasıl haberleşebileceğine bakalım. Aslında birbirlerine JSON formatında mesajlar g&amp;ouml;nderecekler. &amp;Ouml;rnek kod par&amp;ccedil;acığını aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;p&gt;cluster_sample_2.js&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;var cluster = require('cluster');
var workers = [];
var names = ['con do', 'vuki', 'lora', 'deymin', 'mayk', 'cordi', 'klaus', 'commander', 'jenkins', 'semuel', 'fire starter'];
var colors = ['red', 'green', 'blue', 'gold', 'white', 'black', 'brown', 'yellow', 'gray', 'silver'];
if (cluster.isMaster) {
    console.log('I am the process #' + process.pid);
    for (var i = 0; i &amp;lt; 3; i++) {
        var worker = cluster.fork();
        workers.push(worker);
        worker.on('message', function (message) {
            console.log('\t\tChild says that:' + JSON.stringify(message));
        });
        workers.forEach(function (worker) {
            var index = Math.floor(Math.random() * names.length) + 1;
            worker.send({ name: names[index - 1] });
        }, this);
    }

} else {
    console.log('Aloha. I am the worker process #' + process.pid);
    process.on('message', function (message) {
        console.log('\The boss says that: ' + JSON.stringify(message));
    });
    var index = Math.floor(Math.random() * colors.length) + 1;
    process.send({ color: colors[index - 1] });
    cluster.worker.destroy();
}&lt;/pre&gt;
&lt;p&gt;Bu sefer ana ve alt iş par&amp;ccedil;acıkları arasında mesajlaşma yapmaya &amp;ccedil;alışıyoruz. Olayımızın adı message. Her zaman ki gibi s&amp;ouml;z konusu olayı ilgili nesnenin on fonksiyonunu kullanarak yakalıyoruz. Alt iş par&amp;ccedil;acığından &amp;uuml;ste veya tam tersi istikamete mesaj g&amp;ouml;ndermek i&amp;ccedil;in mesaj g&amp;ouml;ndermek istediğimiz nesne &amp;ouml;rneğinin send fonksiyonundan yararlanmaktayız. &amp;Ouml;rneği daha anlaşılır kılmak i&amp;ccedil;in names ve colors isimli dizilerden &amp;ccedil;ektiğimiz rastgele değerleri kullanıyoruz. Ana iş par&amp;ccedil;acığı her alt iş par&amp;ccedil;acığına mesaj g&amp;ouml;ndersin diye worker nesnelerini tuttuğumuz bir dizimiz de var. İşte &amp;ccedil;alışma zamanı &amp;ccedil;ıktıları.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/clustering_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Web Server &amp;Ouml;rneği&lt;/h1&gt;
&lt;p&gt;Yazımızın başında da belirttiğimiz &amp;uuml;zere bir web sunucusunun birinci seviyede &amp;ouml;l&amp;ccedil;eklendirilmesi m&amp;uuml;mk&amp;uuml;n. Aslında aynı adres:port'a doğru gelen taleplerin birden fazla iş par&amp;ccedil;acığı tarafından ele alınmaya &amp;ccedil;alışıldığını ve bunun i&amp;ccedil;in arka planda&amp;nbsp;&amp;ccedil;alışan basit bir load balancing mekanizması olduğunu ifade edebiliriz. &amp;Ouml;rnek kod par&amp;ccedil;amıza bakıp konuyu daha iyi anlamaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;p&gt;cluster_sample_3.js&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;var cluster = require('cluster');
var http = require('http');
var cpuCount = 2;
var names = ['con do', 'vuki', 'lora', 'deymin', 'meyk', 'cordi', 'klaus', 'commander', 'jenkins', 'semuel', 'fire starter'];

if (cluster.isMaster) {
    console.log('Master PID: ' + process.pid);
    for (var i = 0; i &amp;lt; cpuCount; i++) {
        cluster.fork();
    }

    cluster.on('fork', function (worker) {
        console.log('\tfork (worker ' + worker.process.pid + ')');
    });

    cluster.on('online', function (worker) {
        console.log('\tonline (worker ' + worker.process.pid + ')');
    })

    cluster.on('listening', function (worker, address) {
        console.log('\tlistening (worker ' + worker.id + ') pid ' + worker.process.pid + ', ' + address.address + ':' + address.port + ')');
    });

    cluster.on('exit', function (worker) {
        console.log('\texit (worker ' + worker.process.pid + ')');
    });

} else {
    console.log('Worker # has been' + process.pid + ' started.');
    http.createServer(function (req, res) {
        res.writeHead(200);
        var index = Math.floor(Math.random() * names.length) + 1;
        res.end('My name is "' + names[index - 1] + '" (pid ' + cluster.worker.process.pid + ')\n');
    }).listen(65001, "127.0.0.1");
}&lt;/pre&gt;
&lt;p&gt;Diğer &amp;ouml;rneklerde olduğu gibi program ilk &amp;ccedil;alıştığında iş par&amp;ccedil;acığının master olup olmamasına g&amp;ouml;re hareket ediyoruz. Master olmama hali daha dikkat &amp;ccedil;ekici. Yani else bloğu. Burada &amp;ccedil;atallanan her iş par&amp;ccedil;acığı i&amp;ccedil;erisinde yeni bir sunucu oluşturduğumuzu g&amp;ouml;rebilirsiniz. Dikkat &amp;ccedil;ekici nokta ise her birinin aynı ip:port bilgisini kullanıyor olması. Normal şartlarda &amp;ccedil;alışma zamanının buna kızması gerekir biliyorsunuz ki. Ne var ki o gizemli Load Balancer mekanizması bizim i&amp;ccedil;in gerekli y&amp;ouml;nlendirmeleri yapıyor.&lt;/p&gt;
&lt;p&gt;Uygulamayı en az iki farklı tarayıcı ile denememizde yarar var. Nitekim &lt;a href="https://github.com/nodejs/node/issues/8540" target="_blank"&gt;şu adreste&lt;/a&gt; belirtildiği &amp;uuml;zere Keep Alive sorunsalı sebebiyle aynı tarayıcıya her zaman i&amp;ccedil;in aynı iş par&amp;ccedil;acığının bakması s&amp;ouml;z konusu olabilir. Daha tutarlı bir &amp;ccedil;&amp;ouml;z&amp;uuml;m olarak Load Balancer mekanizmasını y&amp;ouml;netebiliyor olmak &amp;ouml;nemli sanırım. Ger&amp;ccedil;i burada ş&amp;ouml;yle bir d&amp;uuml;zenekte kurulabilir: Talepleri belli bir eşik değerine kadar &amp;ccedil;atallayıp du değere ulaşıldığında t&amp;uuml;m alt iş par&amp;ccedil;alarını yok edebiliriz&lt;em&gt;(Lakin state'leri nasıl saklarız orası da bir soru işareti. Daha derin d&amp;uuml;ş&amp;uuml;n Burak)&lt;/em&gt; Bunu cluster nesnesinin exit olayında kontrol altına alıp yeni alt iş par&amp;ccedil;acıklarının tekrardan &amp;ccedil;atallanmasını sağlayabiliriz. Yine de daha etkili &amp;ccedil;&amp;ouml;z&amp;uuml;mler var tabii ki. Bu işin duayenlerinden olan NGinX' in &lt;a href="https://docs.nginx.com/nginx/deployment-guides/node-js-load-balancing-nginx-plus/" target="_blank"&gt;şu adresteki yazısına&lt;/a&gt; bir bakın derim ;)&lt;/p&gt;
&lt;p&gt;Şimdilik kendi sistemimde aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;ları elde ettim. Dikkat edileceği &amp;uuml;zere Chrome ve Firefox tarayıcıları farklı iş par&amp;ccedil;acıkları tarafından ele alınmakta&lt;em&gt;(pid değerine bakın)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/clustering_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu yazımızda cluster mod&amp;uuml;l&amp;uuml;n&amp;uuml; kullanarak ana iş par&amp;ccedil;acığından farklı iş par&amp;ccedil;acıklarının nasıl dallandırılabileceğini incelemeye &amp;ccedil;alıştık. Aslında konunun &amp;ouml;zelinde Node.js'in child-Process adı verilen bir konsepti bulunuyor. Child Process kavramı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında spawn, execFile, exec, fork gibi &amp;ccedil;eşitli operasyonlar var. cluster, fork işlemini basitleştiriyor diyebiliriz. Bu yapıları &amp;ouml;z&amp;uuml;msemek i&amp;ccedil;inde Node.js'in stream ve event-driven konularını da iyi bilmek gerekiyor. Ben halen bu konulara bakmaktayım. Bir şeyler pekişince yazmak istiyorum. Şimdilik benden bu kadar. G&amp;uuml;n hafif hafif ağırmaya başladı. Yola d&amp;uuml;şsem iyi olacak. Enterprise hava yollarının ilk seferi ile tekrardan eve d&amp;ouml;nme vakti gelmiş bile.&amp;nbsp;Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneklere &lt;a href="https://github.com/buraksenyurt/nodejs-tutorials" target="_blank"&gt;github'dan&lt;/a&gt; erişebilirsiniz.&lt;/p&gt;</content>
  <pubDate>2018-07-03 21:04:00</pubDate>
  <slug>clustered-node-js</slug>
  <tags>
    <tag>nodejs</tag>
    <tag>cluster</tag>
    <tag>load-balancing</tag>
    <tag>child-process</tag>
    <tag>single-thread</tag>
    <tag>multi-core-processing</tag>
    <tag>inter-channel-communication</tag>
    <tag>http</tag>
    <tag>http-server</tag>
    <tag>web-server-control</tag>
  </tags>
  <categories>
    <category>Node.js</category>
  </categories>
</post>