<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Command Nesnelerine Dikkat!</title>
  <description>Bu makalemizde, Command nesnelerini kullanırken performans arttırıcı, kod okunurluğunu kolaylaştırıcı, güvenlik riskini azaltıcı etkenler üzerinde duracağız ve bu kazanımlar için gerekli teknikleri göreceğiz. Örneklerimizi SqlCommand sınıfına ait nesneler üzerinden geliştireceğiz. Bildiğiniz gibi Command nesneleri yardımıyla veritabanına doğru yürütmek istediğimiz sorguları çalıştırmaktayız. Bu sorgular basit Select, Insert, Update, Delete sorguları olabileceği gibi saklı yordamlar (Stored Procedures) veya tablolarda olabilir.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, Command nesnelerini kullanırken performans arttırıcı, kod okunurluğunu kolaylaştırıcı, g&amp;uuml;venlik riskini azaltıcı etkenler &amp;uuml;zerinde duracağız ve bu kazanımlar i&amp;ccedil;in gerekli teknikleri g&amp;ouml;receğiz. &amp;Ouml;rneklerimizi SqlCommand sınıfına ait nesneler &amp;uuml;zerinden geliştireceğiz. Bildiğiniz gibi Command nesneleri yardımıyla veritabanına doğru y&amp;uuml;r&amp;uuml;tmek istediğimiz sorguları &amp;ccedil;alıştırmaktayız. Bu sorgular basit Select, Insert, Update, Delete sorguları olabileceği gibi saklı yordamlar (Stored Procedures) veya tablolarda olabilir.&lt;/p&gt;
&lt;p&gt;Command nesneleri ayrıca diğer Ado.Net nesnelerinin işletilmelerinde de etkin rol oynamaktadır. &amp;Ouml;rneğin bağlantısız katman (disconnected layer) nesnelerinin doldurulması veya g&amp;uuml;ncellenmesi i&amp;ccedil;in kullanılan DataAdapter nesneleri veya&amp;nbsp; bağlantılı katman (connected layer) &amp;uuml;zerinde &amp;ccedil;alışan DataReader nesneleri gibi. Dolayısıyla Command nesnelerine bağımlı olarak &amp;ccedil;alışan programların performans, g&amp;uuml;venlik ve kod okunurluğu y&amp;ouml;n&amp;uuml;nden uygulaması tavsiye edilen bazı teknikler vardır. Command nesnelerinin hazırlanışı ve kullanılması sırasında dikkat etmemiz gereken noktalar aşağıdaki d&amp;ouml;rt madde ile &amp;ouml;zetlenmiştir.&lt;/p&gt;
&lt;table id="table1" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td bgcolor="#cccccc"&gt;&lt;strong&gt;SqlCommand Nesneleri İ&amp;ccedil;in Pozitif Yaklaşımlar&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;Parametrik sorguların kullanımı.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;Sorguların yeniden kullanım i&amp;ccedil;in hazırlanması (Prepare Tekniği)&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;En etkin constructor ile nesne &amp;ouml;rneğinin oluşturulması.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;Tek değerlik d&amp;ouml;n&amp;uuml;şler i&amp;ccedil;in ExecuteScalar metodunun tercih edilmesi.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Şimdi bu maddelerimizi tek tek incelemeye başlayalım.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;Parametrik Sorguların Kullanımı.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Parametrik sorgular diğer t&amp;uuml;rlerine g&amp;ouml;re daha hızlı &amp;ccedil;alışır. Ayrıca Sql Injection' a karşı daha y&amp;uuml;ksek g&amp;uuml;venlik sağlar. Son olarak, parametrik sorgularda &amp;ouml;rneğin string değerler i&amp;ccedil;in tek tırnak kullanma zorunluluğunda kalmazsınız ki bu kodunuzun okunulabilirliğini arttırır. &amp;Ouml;rneğin aşağıdaki kod par&amp;ccedil;asını inceleyelim. Bu &amp;ouml;rneğimizde tabloya veri girişi i&amp;ccedil;in INSERT sorgusu kullanılıyor. Sorgumuza ait Sql c&amp;uuml;mleciğine dikkat edecek olursanız TextBox kontrollerinden değerler almakta. İfade okunurluk a&amp;ccedil;ısından olduk&amp;ccedil;a zorlayıcı. Ayrıca tek tırnak kullanılması gerektiğinden yazımında b&amp;uuml;y&amp;uuml;k dikkat gerektiriyor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection con=new SqlConnection("data source=BURKI;database=Work;integrated security=SSPI");
string insertText="INSERT INTO Maaslar (ADSOYAD,DOGUMTARIHI,MAAS) VALUES ('"+txtADSOYAD.Text.ToString()+"','"+txtDOGUMTARIHI.Text.ToString()+"',"+txtMAAS.Text.ToString()+")";
SqlCommand cmd=new SqlCommand(insertText,con);
con.Open();
cmd.ExecuteNonQuery();
con.Close();&lt;/pre&gt;
&lt;p&gt;Oysaki bu tip bir kullanım yerine sorguya giren dış değerleri parametrik olarak tanımlamak &amp;ccedil;ok daha avantajlıdır. S&amp;uuml;rat, kolay okunurluk, tek tırnak' dan bağımsız olmak. Aynı kod par&amp;ccedil;asını şimdi aşağıdaki gibi değiştirelim. Bu sefer sorgumuza alacağımız değerleri SqlCommand nesnesine birer parametre olarak ekledik. ADSOYAD alanımız nvarchar, DOGUMTARIHI alanımız DateTime, MAAS alanımız ise Money tipindedir. Bu nedenle parametrelerde uygun SqlDbType değerlerini se&amp;ccedil;tik. Daha sonra parametrelerimiz i&amp;ccedil;in gerekli değerlerimizi Form &amp;uuml;zerindeki kontrollerimizden alıyor. Dikkat ederseniz textBox kontrollerinden veri alırken herhangi bir t&amp;uuml;r d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml; işlemi uygulamadık.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;/* Connection oluşturulur. */
SqlConnection con=new SqlConnection("data source=BURKI;database=Work;integrated security=SSPI");
/* Sorgu c&amp;uuml;mleciği oluşturulur.*/
string insertText="INSERT INTO Maaslar (ADSOYAD,DOGUMTARIHI,MAAS) VALUES (@ADSOYAD,@DOGUMTARIHI,@MAAS)";
/* Command nesnesi oluşturulur */
SqlCommand cmd=new SqlCommand(insertText,con);
/* Komut i&amp;ccedil;in gerekli parametreler tanımlanır. */
cmd.Parameters.Add("@ADSOYAD",SqlDbType.NVarChar,50);
cmd.Parameters.Add("@DOGUMTARIHI",SqlDbType.DateTime);
cmd.Parameters.Add("@MAAS",SqlDbType.Money);
/* Parametre değerleri verilir. */
cmd.Parameters["@ADSOYAD"].Value=txtADSOYAD.Text;
cmd.Parameters["@DOGUMTARIHI"].Value=txtDOGUMTARIHI.Text;
cmd.Parameters["@MAAS"].Value=txtMAAS.Text;
/* Bağlantı a&amp;ccedil;ılır komut &amp;ccedil;alıştırılır ve bağlantı kapatılır. */
con.Open();
cmd.ExecuteNonQuery();
con.Close();&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;Sorguların Yeniden Kullanım i&amp;ccedil;in Hazırlanması (Prepare Tekniği)&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Stored Procedure' lerin hızlı olmalarının en b&amp;uuml;y&amp;uuml;k nedeni sql sorgularına ait planlarının ara bellekte tutulmasıdır. Aynı işlevselliği uygulamalarımızda sık kullanılan sorgu c&amp;uuml;mleleri i&amp;ccedil;inde ger&amp;ccedil;ekleyebiliriz. Bunun i&amp;ccedil;in SqlCommand nesnesinin Prepare metodu kullanılır. Bu metod yardımıyla ilgili sql sorgusuna ait planın Sql sunucusu i&amp;ccedil;in ara bellekte tutulması sağlanmış olur. B&amp;ouml;ylece sorgunun ilk &amp;ccedil;alıştırılışından sonraki y&amp;uuml;r&amp;uuml;tmelerin daha hızlı olması sağlanmış olur. Aşağıdaki kod par&amp;ccedil;asını ele alalım. Bu sefer arka arkaya 3 satır girişi işlemini ger&amp;ccedil;ekleştiriyoruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection con=new SqlConnection("data source=BURKI;database=Work;integrated security=SSPI");
string insertText="INSERT INTO Maaslar (ADSOYAD,DOGUMTARIHI,MAAS) VALUES (@ADSOYAD,@DOGUMTARIHI,@MAAS)"; con.Open();
SqlCommand cmd=new SqlCommand(insertText,con);
cmd.Parameters.Add("@ADSOYAD",SqlDbType.NVarChar,50);
cmd.Parameters.Add("@DOGUMTARIHI",SqlDbType.DateTime);
cmd.Parameters.Add("@MAAS",SqlDbType.Money);
// İlk veri girişi
cmd.Parameters["@ADSOYAD"].Value="Burak";
cmd.Parameters["@DOGUMTARIHI"].Value="12.04.1976";
cmd.Parameters["@MAAS"].Value=1000;
cmd.ExecuteNonQuery();

// İkinci veri girişi
cmd.Parameters["@ADSOYAD"].Value="Bili";
cmd.Parameters["@DOGUMTARIHI"].Value="10.04.1965";
cmd.ExecuteNonQuery();

// &amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; veri girişi
cmd.Parameters["@ADSOYAD"].Value="Ali";
cmd.Parameters["@DOGUMTARIHI"].Value="09.04.1980";
cmd.ExecuteNonQuery();
con.Close();&lt;/pre&gt;
&lt;p&gt;Bu tarz bir kullanım yerine, aşağıdaki kullanım &amp;ouml;zellikle ağ ortamında işletilecek olan sorgulamalarda daha y&amp;uuml;ksek performans sağlayacaktır. Tek yapmamız gereken SqlCommand nesnesini ilk kez Execute edilmeden &amp;ouml;nce Prepare metodu ile Sql Sunucusu i&amp;ccedil;in ara belleğe aldırmaktır. Yani;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection con=new SqlConnection("data source=BURKI;database=Work;integrated security=SSPI");
string insertText="INSERT INTO Maaslar (ADSOYAD,DOGUMTARIHI,MAAS) VALUES (@ADSOYAD,@DOGUMTARIHI,@MAAS)"; con.Open();
SqlCommand cmd=new SqlCommand(insertText,con);
cmd.Parameters.Add("@ADSOYAD",SqlDbType.NVarChar,50);
cmd.Parameters.Add("@DOGUMTARIHI",SqlDbType.DateTime);
cmd.Parameters.Add("@MAAS",SqlDbType.Money);
// İlk veri girişi
cmd.Parameters["@ADSOYAD"].Value="Burak";
cmd.Parameters["@DOGUMTARIHI"].Value="12.04.1976";
cmd.Parameters["@MAAS"].Value=1000;
cmd.Prepare();
cmd.ExecuteNonQuery();

// İkinci veri girişi
cmd.Parameters["@ADSOYAD"].Value="Bili";
cmd.Parameters["@DOGUMTARIHI"].Value="10.04.1965";
cmd.ExecuteNonQuery();

// &amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; veri girişi
cmd.Parameters["@ADSOYAD"].Value="Ali";
cmd.Parameters["@DOGUMTARIHI"].Value="09.04.1980";
cmd.ExecuteNonQuery();
con.Close();&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;En Etkin Constructor ile Nesne &amp;Ouml;rneğinin Oluşturulması.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bir SqlCommand nesnesinin oluşturulması sırasında kullanılacak Constructor metodun se&amp;ccedil;imi &amp;ouml;zellikle kod okunurluğu a&amp;ccedil;ısından &amp;ouml;nemlidir. &amp;Ouml;rneğin aşağıdaki kod kullanımını ele alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;// ConnectionString tanımlanır.
string conStr="data source=BURKI;database=Work;integrated security=SSPI";
// Select sorgu c&amp;uuml;mlesi tanımlanır.
string selectText="SELECT * FROM Ogrenciler";
// SqlConnection nesnesi oluşturulur.
SqlConnection con=new SqlConnection();
// SqlConnection nesnesi i&amp;ccedil;in Connection String atanır.
con.ConnectionString=conStr;
// Connection a&amp;ccedil;ılır.
con.Open();
// Yeni bir SqlTransaction nesnesi başlatılır.
SqlTransaction trans=con.BeginTransaction();
// SqlCommand nesnesi tanımlanır.
SqlCommand cmd=new SqlCommand();
// SqlCommand nesnesinin kullanacağı SqlConnection belirlenir.
cmd.Connection=con;
// SqlCommand nesnesinin kullanacağı SqlTransaction belirlenir.
cmd.Transaction=trans;
// SqlCommand nesnesinin y&amp;uuml;r&amp;uuml;teceği sorgu c&amp;uuml;mlesi belirlenir.
cmd.CommandText=selectText;&lt;/pre&gt;
&lt;p&gt;Bu kod aşağıdaki gibi daha etkin bir bi&amp;ccedil;imde yazılabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;// ConnectionString tanımlanır.
string conStr="data source=BURKI;database=Work;integrated security=SSPI";
// Select sorgu c&amp;uuml;mlesi tanımlanır.
string selectText="SELECT * FROM Ogrenciler";
// SqlConnection nesnesi oluşturulur ve a&amp;ccedil;ılır.
SqlConnection con=new SqlConnection(conStr);
con.Open();
// Yeni bir SqlTransaction nesnesi başlatılır.
SqlTransaction trans=con.BeginTransaction();
// SqlCommand nesnesi tanımlanır.
SqlCommand cmd=new SqlCommand(selectText,con,trans);&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;Tek Değerlik D&amp;ouml;n&amp;uuml;şler i&amp;ccedil;in ExecuteScalar Metodunun Tercih Edilmesi.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bazen sorgularımızda Aggregate fonksiyonlarını kullanırız. &amp;Ouml;rneğin bir tablodaki satır sayısının &amp;ouml;ğrenilmesi i&amp;ccedil;in Count fonksiyonunun kullanılması veya belli bir alandaki değerlerin ortalamasının hesaplanması i&amp;ccedil;in AVG (ortalama) fonksiyonu vb. Aggregate fonksiyonlarının kullanıldığı durumlarda iki alternatifimiz vardır. Bu alternatiflerden birisi aşağıdaki gibi SqlDataReader nesnesinin ilgili SqlCommand nesnesi ile birlikte kullanılmasıdır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;// ConnectionString tanımlanır.
string conStr="data source=BURKI;database=Work;integrated security=SSPI";
// Select sorgu c&amp;uuml;mlesi tanımlanır.
string selectText="SELECT COUNT(*) FROM Ogrenciler";
// SqlConnection nesnesi oluşturulur ve a&amp;ccedil;ılır.
SqlConnection con=new SqlConnection(conStr);
con.Open();
// SqlCommand nesnesi tanımlanır.
SqlCommand cmd=new SqlCommand(selectText,con);
// SqlDataReader nesnesi satır sayısını almak amacıyla oluşturulur.
SqlDataReader dr=cmd.ExecuteReader(CommandBehavior.SingleResult);
// Elde edilen sonu&amp;ccedil; okunur.
dr.Read();
// H&amp;uuml;cre değeri ekrana yazdırılır.
Console.WriteLine("&amp;Ouml;ğrenci sayısı "+dr[0].ToString());
// SqlDataReader ve SqlConnection kaynakları kapatılır.
dr.Close();
con.Close();&lt;/pre&gt;
&lt;p&gt;Bu teknikte aggregate fonksiyonun &amp;ccedil;alıştırılmasından d&amp;ouml;nen değeri elde edebilmek i&amp;ccedil;in SqlDataReader nesnesi kullanılmıştır. Ancak SqlCommand nesnesinin bu iş i&amp;ccedil;in tasarlanmış olan ExecuteScalar metodu yukarıdaki tekniğe g&amp;ouml;re daha y&amp;uuml;ksek bir performans sağlamaktadır. &amp;Ccedil;&amp;uuml;nk&amp;uuml; &amp;ccedil;alıştırılması sırasında bir SqlDataReader nesnesine ihtiya&amp;ccedil; duymaz. Bu da SqlDataReader nesnesinin kullanmak i&amp;ccedil;in harcadığı sistem kaynaklarının var olmaması anlamına gelmektedir. Dolayısıyla yukarıdaki &amp;ouml;rnekteki kodları aşağıdaki gibi kullanmak daha etkilidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;// ConnectionString tanımlanır.
string conStr="data source=BURKI;database=Work;integrated security=SSPI";
// Select sorgu c&amp;uuml;mlesi tanımlanır.
string selectText="SELECT COUNT(*) FROM Ogrenciler";
// SqlConnection nesnesi oluşturulur ve a&amp;ccedil;ılır.
SqlConnection con=new SqlConnection(conStr);
con.Open();
// SqlCommand nesnesi tanımlanır ve ExecuteScalar ile sonu&amp;ccedil; anında elde edilir.
SqlCommand cmd=new SqlCommand(selectText,con);
Console.WriteLine("Satır sayısı "+cmd.ExecuteScalar().ToString());&lt;/pre&gt;
&lt;p&gt;Bu makalemizde, Command nesnelerini kullanırken bize performans, hız, g&amp;uuml;venlik kod okunurluğu a&amp;ccedil;ısından avantajlar sağlayacak teknikleri incelemeye &amp;ccedil;alıştık. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2005-03-27 09:00:00</pubDate>
  <slug>Command-Nesnelerine-Dikkat!-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>sqlcommand</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>