<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF-Windows ve Windows Service Hosting</title>
  <description>Windows Communication Foundation ile ilişikili önceki makalelerimizde mimarinin temellerinden ve bir WCF sevisinin Internet Information Services (IIS) üzerinden nasıl yayımlanabileceğini incelemiştik. Bu makalemizde ise Host uygulama olarak windows uygulamalarını ve windows servislerini ele almaya çalışacağız.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Windows Communication Foundation ile ilişikili &amp;ouml;nceki makalelerimizde mimarinin temellerinden ve bir WCF sevisinin &lt;strong&gt;Internet Information Services (IIS)&lt;/strong&gt; &amp;uuml;zerinden nasıl yayımlanabileceğini incelemiştik. Bu makalemizde ise Host uygulama olarak windows uygulamalarını ve windows servislerini ele almaya &amp;ccedil;alışacağız. Geliştireceğimiz uygulamalarda &amp;ouml;ncekilerden farklı olarak konfigurasyon dosyalarını kullanmayıp, programatik kod par&amp;ccedil;alarından yararlanacağız. Ayrıca, HTTP yerine &lt;strong&gt;TCP&lt;/strong&gt; protokol&amp;uuml; &amp;uuml;zerinden haberleşmeyi kullanıyor olacağız.&lt;/p&gt;
&lt;p&gt;Bildiğiniz gibi WCF mimarisinde s&amp;ouml;zleşmeleri(&lt;strong&gt;Contracts&lt;/strong&gt;) sunan uygulamalar, sadece IIS &amp;uuml;zerinden yayınlanmak zorunda değildir. Bu şablon dışında windows uygulamalarını (Hatta &lt;strong&gt;WPF&lt;/strong&gt; uygulamalarını) ve windows servislerinide kullanabiliriz. &amp;Ouml;zellikle windows servisleri (&lt;strong&gt;Windows Service&lt;/strong&gt;), bulundukları makine &amp;uuml;zerinde otomatik olarak başlatılabildiklerinden, y&amp;ouml;netilebilirlikleri daha kolaydır ve &amp;ouml;zellikle windows tabanlı intranet sistemlerinde tercih edilirler. &amp;Ouml;zellikle .Net Remoting &amp;uuml;zerine yazılan sistemlerde windows servisleri yaygın olarak kullanılmaktadır.&lt;/p&gt;
&lt;p&gt;WCF servislerinin ABC' sinden (&lt;strong&gt;AddressBindingContract&lt;/strong&gt;) hatırlayacağınız &amp;uuml;zere bağlayıcılar (Binding) bizim i&amp;ccedil;in pek &amp;ccedil;ok zorluğun &amp;uuml;stesinden gelmektedir. Daha &amp;ouml;nceki makalelerimizde geliştirdiğimiz WCF &amp;ouml;rnek uygulamalarında sadece &lt;strong&gt;BasicHttpBinding&lt;/strong&gt; tipinden faydalandık. Oysaki projenin ihtiyacına ve şartlara g&amp;ouml;re diğer bağlayıcı tipleride g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabilir ve kullanabiliriz. Bu noktada bağlayıcı tipleri &lt;strong&gt;(Binding Types)&lt;/strong&gt; biraz daha tanımakta fayda olacağı kanısındayım. Bağlayıcı tipler temel olarak istemcilerin, bir servis ile iletişime nasıl ge&amp;ccedil;ebileceği konusunda bazı esasları otomatik olarak belirlemekte rol alan varlıklar olarak tanımlanabilir.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z gelimi, istemcilerden kabul edilebilecek mesajların neler olacağını bağlayıcı tipler yardımıyla belirleyebiliriz. İstemciler, servislere erişirken &amp;ccedil;eşitli iletişim protokollerini kullanacaktır. &amp;Ouml;rneğin HTTP veya TCP. HTTP intranet dışında internet &amp;uuml;zerindende kullanılabilecek bir ortam sağlarken, TCP &amp;ouml;zellikle intranet ortamında maksimum performansı sağlayacak nitelikte bir alt yapı sağlamaktadır. Bağlayıcı tipler bu protokol&amp;uuml;n ne olacağının belirlenmesinde etkin rol oynar. S&amp;ouml;z gelimi &lt;strong&gt;BasicHttpBinding&lt;/strong&gt; tipi HTTP protokol&amp;uuml; &amp;uuml;zerinden iletişime ge&amp;ccedil;ilmesi i&amp;ccedil;in gerekli olan alt yapıyı sağlamaktadır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bazı WCF servis uygulamalarında, birden fazla &lt;strong&gt;endPoint&lt;/strong&gt; tanımlaması sıklıkla uygulanan bir tekniktir. S&amp;ouml;z gelimi intranet tabanlı sistemler i&amp;ccedil;in TCP tabanlı bir bağlayıcı tipi(Binding) i&amp;ccedil;erecek bir endPoint ile birlikte, internet &amp;uuml;zerinden gelen isteklere y&amp;ouml;nelik olarak , HTTP tabanlı ve &lt;strong&gt;XML&lt;/strong&gt; formatında &amp;ccedil;&amp;ouml;z&amp;uuml;mleme yapabilecek bir bağlayıcı tipi kullanacak &lt;strong&gt;endPoint&lt;/strong&gt; tanımlamaları bir arada ele alınıp kullanılabilir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Diğer taraftan istemciler ve servis arasında taşınacak olan verinin nasıl formatlanacağınada bağlayıcı tipler karar vermektedir. Burada s&amp;ouml;z konusu olan formatlama, verinin &lt;strong&gt;XML&lt;/strong&gt; olarak mı yoksa &lt;strong&gt;binary&lt;/strong&gt; olarak mı serileştirileceğidir. Yine binary formatta serileştirme, &amp;ouml;zellikle intranet gibi sistemlerde hız ve performans sağlayacaktır.&amp;nbsp; &amp;Ouml;zellikle image gibi b&amp;uuml;y&amp;uuml;k boyutlu veri yapılarının binary formatta transfer edilmesi performans a&amp;ccedil;ısından &amp;ouml;nemli bir kriterdir.&lt;/p&gt;
&lt;p&gt;Bağlayıcıların etkin olarak rol aldıkları diğer noktalar servisin g&amp;uuml;venilirliğinin nasıl sağlanacağı &lt;strong&gt;(reliability)&lt;/strong&gt; ve servisin &lt;strong&gt;transaction&lt;/strong&gt; i&amp;ccedil;eren bir operasyonda g&amp;ouml;rev alıp almayacağıdır. Bu ve benzeri kriterler g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında,&lt;strong&gt; System.ServiceModel&lt;/strong&gt; isim alanı altında yer alan &amp;ouml;nceden tanımlı bağlayıcı tipler hazır &amp;ccedil;&amp;ouml;z&amp;uuml;mler sunmaktadır. Bu elbetteki kendi bağlayıcı tiplerimizi yazamayacağımız anlamına gelmemelidir. Dilersek bunuda yapabiliriz. &amp;Ouml;rneklerimizde TCP prokol&amp;uuml;n&amp;uuml; ve binary serileştirmeyi tercih edeceğimizden, bununla ilgili olan bağlayıcı tipi kullanabiliriz.&lt;/p&gt;
&lt;p&gt;Bu kısa bilgilerden sonra dilerseniz &amp;ouml;rneklerimizi adım adım geliştirmeye başlayalım. İlk olarak servis s&amp;ouml;zleşmemizi &lt;strong&gt;(Service Contract)&lt;/strong&gt; ve bu s&amp;ouml;zleşmeyi uygulayacak tipimizi yazmamız gerekiyor. Amacımız kod tarafında servisi tesis etmek ve kullanmak olduğundan m&amp;uuml;mk&amp;uuml;n olduğu kadar basit bir s&amp;ouml;zleşme ve tip tanımlaması yapacağız. Bu ama&amp;ccedil;la aşağıdaki tipleri i&amp;ccedil;erecek AritmetikLib isimli bir sınıf k&amp;uuml;t&amp;uuml;phanesi &lt;strong&gt;(class library)&lt;/strong&gt; geliştirerek işe başlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk202_1.gif" alt="" width="258" height="258" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Servis S&amp;ouml;zleşmemiz;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace AritmetikLib
{
    [ServiceContract(Name="CebirciServisi",
          Namespace="http://www.bsenyurt.com/CebirciServisi")]
    public interface IAritmetikContract
    {
        [OperationContract]
        double Toplam(double x, double y);
    }
}&lt;/pre&gt;
&lt;p&gt;Servis s&amp;ouml;zleşmemiz herzamanki gibi bir aray&amp;uuml;zd&amp;uuml;r(&lt;strong&gt;Interface&lt;/strong&gt;). Diğer tarafan istemcilere sunulabilecek olan operasyonumuz basit olarak bir Toplama işlemi yapmaktadır. &amp;Ouml;zel olarak &lt;strong&gt;ServiceContract&lt;/strong&gt; isimli niteliğimizin &lt;strong&gt;Name&lt;/strong&gt; ve &lt;strong&gt;Namespace&lt;/strong&gt; &amp;ouml;zelliklerine bazı değerler atadık. Name ve Namespace &amp;ouml;zellikleri, s&amp;ouml;zleşmeye ait &lt;strong&gt;WSDL&lt;/strong&gt; (Web Service Description Language) elementi i&amp;ccedil;erisindeki ilgili değerleri belirlemekte kullanılmaktadır ve daha sonradan bu s&amp;ouml;zleşmenin istemciler i&amp;ccedil;in gerekli olan proxy sınıfını &amp;uuml;retilirken ele alınacaktır.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;zleşmeyi uyarlayan tipimiz;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace AritmetikLib
{
    public class Cebirci:IAritmetikContract
    {
        #region IAritmetikContract Members
        public double Toplam(double x, double y)
        {
            return x + y;
        }
        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;Cebirci isimli sınıfımız basit olarak servis s&amp;ouml;zleşmesi olan &lt;strong&gt;IAritmetikContract&lt;/strong&gt; isimli aray&amp;uuml;z&amp;uuml; (interface) implemente etmektedir. Servis s&amp;ouml;zleşmemizi ve tipimizi tanımladıktan sonra artık Windows tabanlı Host uygulamamızı geliştirmeye başalayabiliriz. S&amp;ouml;z konusu uygulamamızın &amp;ouml;n y&amp;uuml;z&amp;uuml;n&amp;uuml; aşağıdaki gibi tasarlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk202_2.gif" alt="" width="406" height="198" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Başlat başlıklı d&amp;uuml;ğmeye basıldığında, windows uygulamamız &lt;strong&gt;ServiceHost&lt;/strong&gt; sınıfına ait bir nesneyi &amp;ouml;rnekleyerek istemcilerden(&lt;strong&gt;Clients&lt;/strong&gt;) gelecek olan talepleri dinlemeye başlayacaktır. Tam tersine Durdur başlıklı d&amp;uuml;pmeye bastığımızda ServiceHost nesne &amp;ouml;rneği ile a&amp;ccedil;ılan kanallar kapatılacak ve Host uygulama artık istemcilere cevap vermeyecektir. Bu işlemler sırasında servisin durumuda label kontrol&amp;uuml; i&amp;ccedil;erisinde g&amp;ouml;sterilecektir. Başlamadan &amp;ouml;nce WCF tiplerini uygulamamız i&amp;ccedil;erisinde ele alabilmek ve az &amp;ouml;nce geliştirdiğimiz servis s&amp;ouml;zleşmesi ve tipimizi kullanabilmek i&amp;ccedil;in sırasıyla &lt;strong&gt;System.ServiceModel.dll&lt;/strong&gt; ve AritmetikLib.dll isimli assemblylerımızı uygulamamıza referans etmemiz gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk202_3.gif" alt="" width="212" height="214" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Artık uygulamamızın kodlarını aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using System.Windows.Forms;
using AritmetikLib;

namespace HostApp
{
    public partial class Form1 : Form
    {
        private ServiceHost srvHost;

        public Form1()
        {
            InitializeComponent();
        }

        private void btnBaslat_Click(object sender, EventArgs e)
        {
            srvHost = new ServiceHost(typeof(Cebirci));
            srvHost.AddServiceEndpoint(typeof(IAritmetikContract), new NetTcpBinding(), "net.tcp://localhost:4501/CebirciServisi");
            srvHost.Open();
            lblServisDurumu.Text = srvHost.State.ToString();
            btnBaslat.Enabled = false;
            btnDurdur.Enabled = true;
        }

        private void btnDurdur_Click(object sender, EventArgs e)
        {
            srvHost.Close();
            lblServisDurumu.Text = srvHost.State.ToString();
            btnDurdur.Enabled = false;
            btnBaslat.Enabled = true;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;btnBaslat d&amp;uuml;ğmesine ait Click olay metodu i&amp;ccedil;erisinde ilk olarak &lt;strong&gt;ServiceHost&lt;/strong&gt; nesnemiz &amp;ouml;rneklenmektedir. Yapıcı metoda(Constructor), Cebirci sınıfın tipi verilmiştir. Bir başka deyişle servis s&amp;ouml;zleşmesini uyarlayan tip bildirilmektedir. Servislerin, istemcilerden gelen talepleri &lt;strong&gt;endPoint&lt;/strong&gt;' ler yardımıyla aldığını biliyoruz. Bir endPoint i&amp;ccedil;erisinde &lt;strong&gt;adres&lt;/strong&gt; , &lt;strong&gt;bağlayıcı tip&lt;/strong&gt; ve &lt;strong&gt;s&amp;ouml;zleşme&lt;/strong&gt; bilgilerininde yer alması gerekiyor. Bu nedenle, ServiceHost sınıfımıza ait nesne &amp;ouml;rneğimize &lt;strong&gt;AddServiceEndPoint&lt;/strong&gt; metodu yardımıyla bir endPoint eklemekteyiz.&lt;/p&gt;
&lt;p&gt;Bu metodun ilk parametresi servis s&amp;ouml;zleşmemize ait tipi temsil etmektedir. İkinci parametrede dikkat ederseniz &lt;strong&gt;NetTcpBinding&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneği verilmektedir. Birbaşka deyişle TCP protokol&amp;uuml; &amp;uuml;zerinden, binary formatta &amp;ccedil;&amp;ouml;z&amp;uuml;mleme kullanılarak iletişime ge&amp;ccedil;ileceğini bildirmiş oluyoruz. Son parametre ise servisimizdeki bu endPoint' e nasıl ulaşılabileceği bilgisini i&amp;ccedil;ermektedir. Bu parametrede makine adı, iletişim protokol&amp;uuml;, port numarası ve nesne takma adı gibi bilgiler yer almaktadır.&lt;/p&gt;
&lt;p&gt;Bu adımlardan sonra tek yapılması gereken servisin dinlemeye başlamasını sağlamaktır. Bu ama&amp;ccedil;la ServiceHost tipinden nesne &amp;ouml;rneğimizin &lt;strong&gt;Open&lt;/strong&gt; metodunu kullanıyoruz. btnDurdur isimli d&amp;uuml;ğmemize ait Click olay metodunda ise &lt;strong&gt;Close&lt;/strong&gt; metodu &amp;ccedil;ağırılarak servisin kapatılması sağlanmaktadır. İstemciyi yazmadan &amp;ouml;nce windows uygulamasını başlatarak test edebilirsiniz. Eğer sistemde y&amp;uuml;kl&amp;uuml; bir Firewall var ise, 4501 numaralı portun a&amp;ccedil;ılmasına karşın bir uyarı mesajı verecektir. Bunu kabul ederek devam etmek gerekmektedir. Aksi takdirde portun kullanılması engelleneceğinden, istemcilere cevap verilemez ve servis &amp;ccedil;alışmaz.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bir Host uygulama herhangibir iletişim portunu kullanarak hizmet vermeye başladığında, başka bir Host uygulama aynı makine &amp;uuml;zerindeki aynı iletişim portunu kullanamaz. B&amp;ouml;yle bir durumuda &amp;ccedil;alışma zamanı istisnası (Runtime Exception) alınacaktır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Artık istemci tarafını programlayabiliriz. Bildiğiniz gibi WCF sisteminde yer alan istemcilerimiz, servislere ait endPoint' ler ile haberleşirken &lt;strong&gt;proxy&lt;/strong&gt; sınıflarını kullanmaktadırlar. Şuanki senaryomuzda servisimizi IIS &amp;uuml;zerinden host etmediğimiz i&amp;ccedil;in HTTP tabanlı olacak şekilde metadata publishing yapamamaktayız. Ancak &lt;strong&gt;svcutil.exe &lt;/strong&gt;aracı ile AritmetikLib isimli dll' imizden yararlanarak istemci i&amp;ccedil;in gereken proxy sınıfı ve konfigurasyon dosyalarını &amp;uuml;rettirebiliriz. Bu ama&amp;ccedil;la ArtimetikLib.dll ' ini herhangibir yerden svcutil aracı ile aşağıdaki gibi ele almalıyız.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;svcUtil AritmetikLib.dll&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk202_4.gif" alt="" width="640" height="230" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;SvcUtil aracını bu şekilde kullandığımızda library i&amp;ccedil;erisinde yer alan servis s&amp;ouml;zleşmesi ve tiplerden yararlanılaraktan bir takım metadata ve şema dosyaları &amp;uuml;retilecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk202_5.gif" alt="" width="460" height="113" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok basit olarak d&amp;uuml;ş&amp;uuml;necek olursak, bu dosyaların istemciler i&amp;ccedil;in gereken proxy sınıflarını &amp;uuml;retmek amacıyla kullanılabileceğini d&amp;uuml;ş&amp;uuml;nebiliriz. Sonu&amp;ccedil; itibariyle IIS &amp;uuml;zerinden yapılan Host işlemlerindede bir &lt;strong&gt;WSDL&lt;/strong&gt; d&amp;ouml;k&amp;uuml;manı gerekmektedir ki burada bu işi &lt;strong&gt;www.bsenyurt.com.CebirciServisi.wsdl&lt;/strong&gt; isimli dosya &amp;uuml;stlenmektedir. Bu işlemin ardından yine svcutil aracını aşağıdaki gibi kullanarak istemciler i&amp;ccedil;in gerekli proxy sınıfı ve konfigurasyon dosyasını &amp;uuml;retebiliriz. &lt;em&gt;(Buradaki dosya isimlerinin tesad&amp;uuml;f olmadığını s&amp;ouml;yleyelim. Hatırlarsanız &lt;strong&gt;ServiceContract&lt;/strong&gt; niteliğimizin Namespace &amp;ouml;zelliğine http://www.bsenyurt.com/CebirciServisi değerini vermiştik.)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;svcutil www.bsenyurt.com.CebirciServisi.wsdl *.xsd /out:AritmetikClient.cs&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk202_6.gif" alt="" width="639" height="203" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Komut başarılı bir şekilde &amp;ccedil;alıştığı takdirde istemciler i&amp;ccedil;in AritmetikClient.cs ve output.config isimli fiziki dosyalar &amp;uuml;retilecektir. Oluşturulan proxy dosyası i&amp;ccedil;erisinde CebirciServisi, CebirciServisiChannel isimli iki aray&amp;uuml;z yer almaktadır. İstemci tarafından &amp;ouml;rneklenerek kullanılabilecek olan CebirciServisiClient isimli sınıf CebirciServisi isimli aray&amp;uuml;z&amp;uuml; uygulamakatadır. Servis ile iletişimde &amp;ouml;nemli bir rol &amp;uuml;stelenen kanalı temsil eden CebirciServisiChannel isimli tipimiz ise hem CebirciServisini hemde &lt;strong&gt;IClientChannel&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamaktadır. IClientChannel aray&amp;uuml;z&amp;uuml; temel olarak istemciler i&amp;ccedil;in taban aray&amp;uuml;zd&amp;uuml;r(base interface) ve WCF iletişimi i&amp;ccedil;in gerekli &amp;ccedil;alışma zamanı fonkisyonellikleri sağlamaktadır. &amp;Ouml;rneğin kanalın &amp;ccedil;alışma zamanında a&amp;ccedil;ılması veya dispose edilmesi gibi işlemlerin yapılmasını sağlayan fonksiyonellikler i&amp;ccedil;erir. &lt;em&gt;(Bunun gibi mimari detayları ilerleyen makalelerimizde ele almaya &amp;ccedil;alışacağız.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk202_8.gif" alt="" width="516" height="490" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Artık istemci uygulamamızı geliştirmeye başlayabilir ve az &amp;ouml;nce &amp;uuml;retilen proxy tipimizi burada kullanarak sunucu ile iletişime ge&amp;ccedil;ebiliriz. İşlemlerimizi basit bir şekilde ele almak amacıyla istemcimizi sıradan bir Console uygulaması olarak tasarlayacağız. Uygulamamızın yine &lt;strong&gt;System.ServiceModel&lt;/strong&gt; assembly' ını referans etmesi ve komut satırından &lt;strong&gt;SvcUtil&lt;/strong&gt; aracı yardımıyla &amp;uuml;rettiğimiz proxy sınıfını i&amp;ccedil;ermesi gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk202_7.gif" alt="" width="199" height="165" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Output.config dosyasını istemci uygulamaya eklemek zorunda değiliz. Şu aşamada istemci tarafından servisi &amp;ccedil;ağırmak i&amp;ccedil;in gerekli ayarları programatik olarak yapıyor olacağız. İlgili referans ve proxy tipini ekledikten sonra kodlarımızı aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace ClientApp
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Devam etmek i&amp;ccedil;in tuşa basın");
            Console.ReadLine();
            CebirciServisiClient client;
            client = new CebirciServisiClient(new NetTcpBinding(), new EndpointAddress("net.tcp://localhost:4500/CebirciServisi"));
            Console.WriteLine(client.Toplam(4, 5).ToString());
            Console.ReadLine();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İlk olarak CebirciServisiClient isimli sınıfımıza ait bir nesne &amp;ouml;rneği oluşturuyoruz. Bunu ger&amp;ccedil;ekleştirirken yapıcı metodumuza ilk parametre olarak &lt;strong&gt;NetTcpBinding&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneği atanmaktadır. Sunucu tarafında NetTcpBinding tipini kullandığımız i&amp;ccedil;in istemci tarafındada uygun bir bağlayıcı tipin kullanılması gerekmektedir. İkinci parametre olarak bir &lt;strong&gt;EndpointAddress&lt;/strong&gt; nesne &amp;ouml;rneği oluşturulmaktadır. Bu sınıfın yapıcı metodunda verdiğimiz adres ise, servis tarafında belirttiğimiz erişim adresidir. Son olarak uzak nesne metodumuzu &amp;ccedil;alıştırmaktayız. Artık istemcimizi test edebiliriz. Elbetteki &amp;ouml;nce sunucu uygulamanın &amp;ccedil;alıştırılması ve servisin a&amp;ccedil;ılması gerekmektedir. Eğer sunucu uygulama &amp;uuml;zerinden servis a&amp;ccedil;ılmadan istemci &amp;ccedil;alıştırılırsa aşağıdaki gibi &amp;ccedil;alışma zamanı hatası(Runtime Exception) alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk202_9.gif" alt="" width="457" height="145" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Exception mesajı &amp;ouml;zellikle .Net Remoting uygulamaları geliştirenler i&amp;ccedil;in tanıdık bir c&amp;uuml;mle i&amp;ccedil;ermektedir. &lt;strong&gt;No Connection could be made because the target machine actively refused it.&lt;/strong&gt; :) Bu aynı zamanda istemcimizin ger&amp;ccedil;ekten belirtilen adreste kendisini dinleyecek bir WCF servis uygulaması aradığınında bir g&amp;ouml;stergesidir. Aşağıdaki flash animasyonunda basit olarak sistemimizin nasıl &amp;ccedil;alıştığı g&amp;ouml;sterilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;object id="obj1" width="401" height="317" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/mk202_video1.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="401" height="317" src="http://www.buraksenyurt.com/makale/images/mk202_video1.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj1" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;Gelelim Windows uygulamasından sunmuş olduğumuz hizmeti bir windows servisi &amp;uuml;zerinden nasıl sunacağımıza. Aslında WCF tarafından baktığımızda sadece windows servisi ortamına ayak uydurmamız yeterli olacaktır. Gelin &amp;ouml;rneğimiz &amp;uuml;zerinden devam edelim. İlk olarak solution' ımıza bir &lt;strong&gt;Windows Service&lt;/strong&gt; projesi eklememiz gerekiyor. Projemizi oluşturduktan sonra, her zaman olduğu gibi &lt;strong&gt; System.ServiceModel.dll&lt;/strong&gt; isimli assembly' ın ve servis s&amp;ouml;zleşemesi ile uzak nesne sınıfını barındıran sınıf k&amp;uuml;t&amp;uuml;phanemizin (&lt;strong&gt;AritmetikLib.dll&lt;/strong&gt;) referans edilmesi gerekmektedir.&lt;/p&gt;
&lt;p&gt;Windows servisleri, web servislerine benzer olarak herhangibir g&amp;ouml;rsel arabirime sahip değildir. İş yapan metodları, olay tabanlı &amp;ccedil;alışmaktadır. Dolayısıyla ilgili servis, windows işletim sisteminin servislerine eklendikten sonra, başlatılması, durudurulması yada hata oluşması gibi durumlarda yapılması gereken kodlar ilgili olay metodlarına yazılmaktadır. Bizim windows servisimiz başlatıldığında uzak nesneleri istemci uygulamaların hizmetine sunacak şekilde dinlemede olmalıdır. Diğer taraftan servis kapatıldığında ise, Host uygulamanın kullandığı serviceHost nesne &amp;ouml;rneği artık istemcilere cevap vermeyecek şekilde kapatılmalıdır. Bu duruma g&amp;ouml;re servis sınıfımızın kodları aşağıdaki gibi olmalıdır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.ServiceProcess;
using System.ServiceModel;
using AritmetikLib;

namespace AritmetikWinServis
{
    public partial class Service1 : ServiceBase
    {
        private ServiceHost srvHost;

        public Service1()
        {
            InitializeComponent();
        }

        protected override void OnStart(string[] args)
        {
            srvHost = new ServiceHost(typeof(Cebirci));
            srvHost.AddServiceEndpoint(typeof(IAritmetikContract), new NetTcpBinding(), "net.tcp://localhost:65001/CebirciServisi");
            srvHost.Open();
        }

        protected override void OnStop()
        {
            srvHost.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat ederseniz makalemizin başında geliştirdiğimiz Windows uygulmasındaki kodlarımızdan &amp;ccedil;okda farklı bir işlem ger&amp;ccedil;ekleştirmiyoruz. Servis &lt;strong&gt;OnStart&lt;/strong&gt; olay metodu i&amp;ccedil;erisinde oluşturulurken, endPoint' in eklenmesi ve a&amp;ccedil;ılmasıda burada yapılmaktadır. Benzer şekilde &lt;strong&gt;OnStop&lt;/strong&gt; olay metodu i&amp;ccedil;erisinde servisimiz kapatılmaktadır. Bundan sonraki adımlarımızda servisimizi windows sistemine &lt;strong&gt;install&lt;/strong&gt; etmek i&amp;ccedil;in gerekli işlemleri yapmamız gerekmektedir. S&amp;ouml;z konusu adımlar makalemizin konusu dışında olduğundan y&amp;uuml;zeysel olarak ele alınacaktır. &amp;Ouml;ncelikli olarak servisimize &lt;strong&gt;Add Installer&lt;/strong&gt; se&amp;ccedil;eneği ile gereken y&amp;uuml;kleyici tipleri ekliyoruz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk202_10.gif" alt="" width="198" height="239" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin sonucunda servise &lt;strong&gt; ServiceProcessInstaller&lt;/strong&gt; ve &lt;strong&gt;ServiceInstaller&lt;/strong&gt; tiplerinden iki adet bileşen eklenecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk202_11.gif" alt="" width="293" height="66" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;ServiceProcessInstaller bileşeninin &amp;uuml;yelerinden &lt;strong&gt;Account&lt;/strong&gt; &amp;ouml;zelliğinin değerini &lt;strong&gt;Local System &lt;/strong&gt; olarak ayarlayalım. ServiceInstaller bileşenimizin, &lt;strong&gt;Display Name&lt;/strong&gt; &amp;ouml;zelliğine Aritmetik Servis değerini atayalım. Bu sistem servislerine baktığımızda, geliştirdiğimiz windows servisini bulmamızı kolaylaştıracaktır. Uygulamamız derlendikten sonra işletim sistemine y&amp;uuml;klenmeye hazır hale gelecektir. Y&amp;uuml;kleme işlemi i&amp;ccedil;in Visual Studio 2005 Command Prompt &amp;uuml;zerindeyken &lt;strong&gt;installUtil&lt;/strong&gt; aracını aşağıdaki gibi -i parametresi ile kullanmamız gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk202_12.gif" alt="" width="639" height="602" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;InstallUtil&lt;/strong&gt; aracı işlemleri başarılı bir şekilde tamamladıktan sonra servislerde, eklemiş olduğumuz windows servisi g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Sisteme y&amp;uuml;klediğimiz servisi kaldımak i&amp;ccedil;in &lt;strong&gt;installUtil&lt;/strong&gt; aracının &lt;strong&gt;-u &lt;/strong&gt;parametresini kullanmak gerekmektedir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src="/makale/images/mk202_13.gif" alt="" width="626" height="126" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Servisimizi buradan &amp;ccedil;alıştırdığımızda artık istemciler tarafından kullanılabilir hale gelecektir. İstemci tarafında tek yapmamız gereken &lt;strong&gt;port&lt;/strong&gt; bilgisini değiştirmek olacaktır. &amp;Ouml;rneğin bu makalede geliştirdiğimiz Console uygulamasının kodlarını aşağıdaki gibi değiştirmek yeterlidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;CebirciServisiClient client;
client = new CebirciServisiClient(new NetTcpBinding(), new EndpointAddress("net.tcp://localhost:65001/CebirciServisi"));
Console.WriteLine(client.Toplam(4, 5).ToString());&lt;/pre&gt;
&lt;p&gt;Mimarinin yine doğru bir şekilde tesis edildiğini kontrol etmek adına, geliştirilen servis kapalı iken istemci uygulama &amp;ccedil;alıştırılabilir. Eğer &lt;strong&gt;"No Connection could be made because the target machine actively refused it"&lt;/strong&gt; hatası alınabiliyorsa, istemcinin ger&amp;ccedil;ektende sunucu servisi aradığını anlayabiliriz. Elbette servis &amp;ccedil;alıştırıldıktan sonrada istemciyi test edip herşeyin yolunda gittiğinden emin olmakta fayda vardır. Aşağıdaki Flash animasyonunda bu durum g&amp;ouml;sterilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;object id="obj2" width="397" height="189" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/mk202_video2.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="397" height="189" src="http://www.buraksenyurt.com/makale/images/mk202_video2.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj2" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;Bu makalemizde WCF mimarisinde yer alan Host uygulama modellerinden &lt;strong&gt;Windows&lt;/strong&gt; ve &lt;strong&gt;Windows Servislerini&lt;/strong&gt; kısaca incelemeye &amp;ccedil;alıştık. Aynı zamanda, konfigurasyon dosyası kullanımı yerine kod tarafında neler yapabileceğimize değindik. &amp;Ouml;zellikle TCP tabanlı bir binding tipi kullandığımızda&lt;strong&gt;(NetTcpBinding)&lt;/strong&gt;, bir başka deyişle HTTP &amp;uuml;zerinden &lt;strong&gt;Metadata&lt;/strong&gt; yayınlanması s&amp;ouml;z konusu &lt;span style="text-decoration: underline;"&gt;olmadığında, istemciler i&amp;ccedil;in gerekli olan proxy sınıflarının &lt;strong&gt; svcutil&lt;/strong&gt; aracı yardımıyla nasıl kolay bir şekilde &amp;uuml;retilebileceğine bakmaya &amp;ccedil;alıştık ve b&amp;ouml;ylece bir makalemizin daha sonuna geldik. İlerleyen makalelerimizde WCF mimarisinin detaylarını incelemeye devam ediyor olacağız. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/UsingTcpBinding.rar"&gt;&amp;Ouml;rnek Uygulama İ&amp;ccedil;in Tıklayınız.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2007-05-04 09:00:00</pubDate>
  <slug>WCF-Windows-ve-Windows-Service-Hosting-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>