<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Bir Form ve Kontrollerinin Elle Programlanması</title>
  <description>Bugünkü makalemizde, bir Formu kodla nasıl oluşturacağımızı, bu form üstüne nasıl kontroller ekleyeciğimizi, bu kontoller için nasıl olaylar yazacağımızı vb. konuları işlemeye çalışacağız.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde, bir Formu kodla nasıl oluşturacağımızı, bu form &amp;uuml;st&amp;uuml;ne nasıl kontroller ekleyeciğimizi, bu kontoller i&amp;ccedil;in nasıl olaylar yazacağımızı vb. konuları işlemeye &amp;ccedil;alışacağız. Bildiğiniz gibi Visual Studio.NET gibi grafiksel ortamlar ile Form ve Form nesnelerini g&amp;ouml;rsel olarak, kolay ve hızlı bir şekilde oluşturabilmekteyiz. Bu bizim programlama i&amp;ccedil;in ayıracağımız s&amp;uuml;rede , ekran tasarımlarının daha hızlı yapılabilmesine olanak sağlamaktadır.&lt;/p&gt;
&lt;p&gt;Ancak bazen elimizde sadece csc gibi bir C# derleyicisi ve .Net Framework vardır. İşte b&amp;ouml;yle bir durumda, Windows Form&amp;rsquo;larını tasarlamak i&amp;ccedil;in manuel olarak kodlama yapmamız gerekmektedir. Ayrıca, iyi ve uzman bir programcı olabilmek i&amp;ccedil;in &amp;ouml;zellikle Visual ortamlarda Windows Form, Button, TextBox gibi kontrollerin nasıl oluşturulduğunu, nasıl kodlandığını olaylara nasıl ve ne şekilde bağlandığını bilmek, olduk&amp;ccedil;a faydalıdır. Bu aynı zamanda kontrol&amp;uuml;n bizde olmasını da sağlayan bir unsur olarak karşııza &amp;ccedil;ıkmar ve kendimize olan g&amp;uuml;venimizi dahada arttırır.&lt;/p&gt;
&lt;p&gt;Dilerseniz konuyu anlamak i&amp;ccedil;in basit ama etkili bir &amp;ouml;rnekle başlayalım. Bu &amp;ouml;rneğimizde basit olarak boş bir Form oluşturacağız ve bunu csc.exe (C# Compiler) ile derleyeceğiz. Bir Windows Formu aslında System.Windows.Forms sınıfından t&amp;uuml;reyen bir nesnedir. Bu nedenle oluşturacağımız C# sınıfı i&amp;ccedil;ersinde bu bildirimi ger&amp;ccedil;ekleştirmeliyiz. Ayrıca sınıfımızın Form nesnesine ait elemanlarıda kullanabilmesi i&amp;ccedil;in, Form sınıfından t&amp;uuml;retmeliyiz(Inherting). Bunlara ek olarak Formumuzu ekranda g&amp;ouml;sterebilmek i&amp;ccedil;in Application nesnesini ve buna bağlı Run metodunu kullanacağız. Hemen bir text editor a&amp;ccedil;alım ve burada aşağıdaki kodları girelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Windows.Forms; 

public class BirForm:Form // Form sınıfının elemanlarını kalıtısal olarak devralıyoruz.
{ 
     public static void Main() // Programın başladığı nokta.
     {
          BirForm yeni1=new BirForm(); // BirForm sınıfından bir nesne tanımlıyoruz. 
          Application.Run(yeni1);  
          /* yeni1 isimli Form nesnemiz Application nesnesi tarafından g&amp;ouml;r&amp;uuml;nt&amp;uuml;lenir. Bu noktadan itibaren programın işleyişi bir d&amp;ouml;ng&amp;uuml;ye girer. Bu d&amp;ouml;ng&amp;uuml;de Application nesnesi s&amp;uuml;rekli olarak programın işleyişini sonlandıracak bir olayın tetiklenip tetiklenmediğini de kontrol eder. Bu arada tabi yazılan diğer olaylar ve metodlar &amp;ccedil;alışır. Ancak program sonlandırma ile ilgili ( &amp;ouml;rneğin Close metodu ) bir kod ile karşılaşıldığında veya kullanıcı Form&amp;rsquo;un varsa kapatma simgesine tıkladığında (veya ALT+F4 yaptığında) Application nesnesi artık programın işleyişini durdurur. */
     }
}&lt;/pre&gt;
&lt;p&gt;Yazdığımız bu dosyayı cs uzantısı ile kaydetmeyi unutmayalım. Şimdi bu dosyayı csc.exe ile derleyelim. Programı derlerken dikkat etmemiz gereken bir nokta var. System.Windows.Forms &amp;lsquo; un programa referans edilmesi gerekir. Bunu sağlamak i&amp;ccedil;in derleme komutumuzun nasıl yazıldığına dikkat edelim. /reference: burada devreye girmektedir.&amp;nbsp;&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk6_1.gif" alt="" width="638" height="333" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt;Şekil 1. İlk Derleme&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, csc dosyamızı derlemiş ve CreateForm.exe dosyasını olşturmuştur. Burada /t:winexe programı Windows işletim sistemine, " Ben bir WinForm&amp;rsquo;um " olarak tanıtmaktadır. Şimdi bu dosyayı komut satırından &amp;ccedil;alıştıracak olursak aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len sonucu elde ederiz. &amp;nbsp;&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt;&lt;img src="/makale/images/mk6_2.gif" alt="" width="300" height="300" border="0" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt;Şekil 2. Oluşturulan Form Nesnemiz.&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 2.'de oluşturulumuş olduğumuz Form nesnesini g&amp;ouml;rebilirsiniz. Yazmış olduğumuz kodlarda bu Form nesnesine ait &amp;ouml;zellikleri değiştirerek farklı Form g&amp;ouml;r&amp;uuml;n&amp;uuml;mleride elde edebiliriz. Bu noktada size Form oluşturma olaylarının kodlama tekniğinin aslen nasıl yapılması gerektiğini g&amp;ouml;stermek isterim. Bu bir tarzdır yada uygulanan bir formattır ancak en uygun şekildir. Nitekim Visual Studio.NET ortamında bir Windows Application geliştirdiğinizde, uygulama kodlarına bakıcak olursanız bahsetmiş olduğumuz formasyonun uygulanmış olduğunu g&amp;ouml;receksiniz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Windows.Forms; 
public class BirForm:Form
{ 
     public BirForm() // Constructor(Yapıcı) metodumuz.
     {
          InitializeComponent(); /* BirForm sınıfından bir Form nesnesi &amp;uuml;retildiğinde new yapılandırıcısı bu constructora bakar ve InitializeComponent metodunu &amp;ccedil;ağırır. */
     } 
     private void InitializeComponent()
     {
          /* Burada Form'a ait &amp;ouml;zellikler ve Form &amp;uuml;zerinde yer alacak nesneler tanılanır. Tanılanan nesneler aynı zamanda Form'a burada eklenir ve &amp;ouml;zellikleri belirlenir. */
     }
     public static void Main()
     {
          Application.Run(new BirForm()); 
     }
}&lt;/pre&gt;
&lt;p align="left"&gt;Bu yazım tekniği daha anlamlı değil mi ? Kodumuzu bu şekilde değiştirip &amp;ccedil;alıştırdığımızda yine aynı sonucu elde ederiz. Ancak dilersek bu kodu şu şekilde de yazabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Windows.Forms; 

public class BirForm:Form
{ 
     public BirForm()
     {
          NesneleriAyarla();
     } 
     private void NesneleriAyarla()
     {
     }
     public static void Main()
     {
          Application.Run(new BirForm());  
     }
} &lt;/pre&gt;
&lt;p align="left"&gt;Yine aynı sonucu alırız.Şimdi Formumuza biraz renk katalım ve &amp;uuml;st&amp;uuml;nede bir ka&amp;ccedil; nesne ekleyelim. &amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Windows.Forms;
using System.Drawing; 

public class BirForm:Form
{
     /* Kullanacağımız nesneler tanımlanıyor. Iki adet Label nesnesi, iki adet TextBox nesnesi ve birde Button kontrol&amp;uuml;. */
     private Label lbl1;
     private Label lbl2;
     private TextBox txtUsername;
     private TextBox txtPassword;
     private Button btnOK; 
     public BirForm()
     {
          NesneleriAyarla();
     } 

     private void NesneleriAyarla()
     {
          this.Text="Yeni Bir Form Sayfası"; /* this anahtar kelimesi oluşturulan Form nesnesini temsil eder.*/
          this.BackColor=Color.Silver; /* Formun arka plan rengini belirliyoruz. Color Enumaration'ınını kullanabilmek i&amp;ccedil;in Drawing sınıfının eklenmiş olması gereklidir. */
          this.StartPosition=FormStartPosition.CenterScreen; /* Form oluşturulduğunda ekranın ortasında g&amp;ouml;r&amp;uuml;nmesi sağlanıyor. */
          this.FormBorderStyle=FormBorderStyle.Fixed3D; /* Formun border &amp;ccedil;izgileri 3 boyutlu ve sabit olarak belirleniyor. */ 
          /* Label nesnelerini oluşturuyor ve &amp;ouml;zelliklerini ayarlıyoruz. */ 
          lbl1=new Label();
          lbl2=new Label(); 
          lbl1.Text="Username";
          lbl1.Location=new Point(50,50); /* lbl1 nesnesini 50 birim sağa 50 birim aşağıya konumlandırıyoruz */
          lbl1.AutoSize=true; /* Label'ın boyutunun text uzunluğuna g&amp;ouml;re otomatik olarak ayarlanmasını sağlıyoruz. */
          lbl2.Text="Password";
          lbl2.Location=new Point(50,100); /* Bu kez 50 birim sağa, 100 birim aşağıya yerleştiriyoruz. */
          lbl2.AutoSize=true; 
          /* TextBox nesnelerini oluşturuyor ve &amp;ouml;zelliklerini ayarlıyoruz. */ 
          txtUsername=new TextBox();
          txtPassword=new TextBox(); 
          txtUsername.Text="";
          txtUsername.Location=new Point(lbl1.PreferredWidth+50,50); /* Textbox nesnemizi lbl1 in uzunluğundan 50 birim fazla olucak şekilde sağa ve 50 birim aşağıya konumlandırıyoruz. */ 
          txtPassword.Text="";
          txtPassword.Location=new Point(lbl2.PreferredWidth+50,100); 
          /* Button nesnemizi oluşturuyor ve &amp;ouml;zelliklerini belirliyoruz */
          btnOK=new Button();
          btnOK.Text="TAMAM";
          btnOK.Location=new Point(0,0); 
          /* Buraya btnOK nesnesi i&amp;ccedil;in olay procedure tanımı eklenecek. */ 
          /* Şimdi kontrollerimizi Formumuza ekleyelim . Bunun i&amp;ccedil;in Form sınıfına ait Controls koleksiyonunu ve Add metodunu kullanıyoruz. */ 
          this.Controls.Add(lbl1);
          this.Controls.Add(lbl2);
          this.Controls.Add(txtUsername);
          this.Controls.Add(txtPassword);
          this.Controls.Add(btnOK); 
          this.Width=lbl1.PreferredWidth+txtUsername.Width+200; /* Son olarak formun genişliğini ve y&amp;uuml;ksekliğini ayarlıyoruz. */
          this.Height=lbl1.PreferredWidth+lbl2.PreferredWidth+200;
     }

     /* Buraya btnOK i&amp;ccedil;in Click olay procedure kodları eklenecek. */ 
     public static void Main()
     {
          Application.Run(new BirForm());  
     }
} &lt;/pre&gt;
&lt;p align="left"&gt;Evet bu kodu derleyip &amp;ccedil;alıştırdığımızda aşağıdaki Form g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde etmiş oluruz.&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt;&lt;img src="/makale/images/mk6_3.gif" alt="" width="356" height="310" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;span style="font-style: italic; font-family: Verdana;"&gt;Şekil 3. Form tasarıını geliştiriyoruz. &lt;/span&gt;&lt;/p&gt;
&lt;p&gt;Şimdi işin en &amp;ouml;nemli kısılarından birine geldi sıra. Oda olay g&amp;uuml;d&amp;uuml;ml&amp;uuml; kodları yazmak. Yani kullanıcı etkilerine tepki vericek kodları yazmak. Kısaca Event-Handler. Kullanıcı bir eylem ger&amp;ccedil;ekleştirdiğinde programın hangi tepkileri vereceğini belirtmek durumundayız. Bunun i&amp;ccedil;in şu syntax&amp;rsquo;ı kullanırız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void metodunAdi(object sender,System.EventArgs e)  &lt;/pre&gt;
&lt;p&gt;Burada metodumuzun hangi nesne i&amp;ccedil;in &amp;ccedil;alıştırılacağını sender anahtar kelimesi belirtir. Metod protected tanımlanır. Yani bulunduğu sınıf ve bulunduğu sınıftan t&amp;uuml;retilen sınıflarda kullanılabilir. Geri d&amp;ouml;n&amp;uuml;ş değeri yoktur. Bu genel formasyonla tanımlanan bir olay procedure&amp;rsquo;&amp;uuml;n&amp;uuml; nesne ile ilişkilendirmek i&amp;ccedil;in System.EventHandler delegesi kullanılır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;nesneAdi.OlayinTanılayiciBilgisi+= new System.EventHandler(this.metodunAdi)&lt;/pre&gt;
&lt;p&gt;Yukarıdaki &amp;ouml;rneğimizde klasik &amp;ouml;rnek olarak, Button nesnemize tıklandığında &amp;ccedil;alıştırılması i&amp;ccedil;in bir Click olay procedure&amp;rsquo;&amp;uuml; ekleyelim.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="mso-layout-grid-align: none; text-autospace: none;" align="justify"&gt;&lt;span style="color: black;"&gt;Şimdi&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-family: Tahoma;"&gt;&lt;span style="font-family: Tahoma; color: black;"&gt;&lt;span style="font-family: Verdana; color: green;"&gt; /* Buraya btnOK nesnesi i&amp;ccedil;in olay procedure tanımı eklenecek */ yazan yere , aşağıdaki kod satırını ekliyoruz&lt;span style="font-family: Verdana; color: green;"&gt;. &amp;nbsp;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;btnOK.Click+=new System.EventHandler(this.btnOK_Tiklandi);&lt;/pre&gt;
&lt;p&gt;Bu satır ile btnOK nesnesine tıklandığında btnOK_Tiklandi isimli procedure&amp;rsquo;&amp;uuml;n &amp;ccedil;alıştırılacağını belirtiyoruz. &lt;span style="color: #008000;"&gt;/* Buraya btnOK i&amp;ccedil;in Click olay procedure kodları eklenecek */ yazan yere ise olay procedure&amp;rsquo;&amp;uuml;m&amp;uuml;z&amp;uuml;n ve kodlarını ekliyoruz.&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void btnOK_Tiklandi(object sender,System.EventArgs e)
{
     MessageBox.Show(txtUsername.Text+" "+txtPassword.Text);
}  &lt;/pre&gt;
&lt;p&gt;Şimdi programı tekrar derleyip &amp;ccedil;alıştırdığımızda aşağıdaki sonucu elde ederiz.&lt;/p&gt;
&lt;p align="left"&gt;&amp;nbsp;&lt;img src="/makale/images/mk6_4.gif" alt="" width="356" height="310" /&gt; &lt;img src="/makale/images/mk6_5.gif" alt="" width="118" height="108" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt;Şekil 4. Event-Handler sonucu. &lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Evet geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu ve huzurlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2003-11-21 12:00:00</pubDate>
  <slug>Bir-Form-ve-Kontrollerinin-Elle-Programlanmasc4b1c2a0-bsenyurt-com-dan</slug>
  <tags>
    <tag>windows-forms</tag>
  </tags>
  <categories>
    <category>Windows Forms</category>
  </categories>
</post>