<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Kendi İstina Nesnelerimizi Kullanmak (ApplicationException)</title>
  <description>İstisna yakalama mekanizması (Exception Handling) dotNet mimarisinde oldukça önemli bir yere sahiptir. Bu mekanizma sayesinde uygulamalarımızın kilitlenmesi ve istem dışı bir şekilde sonlandırılmaya zorlanmasının önüne geçmiş oluruz. Framework içerisinde önceden tanımlanmış pek çok istisna sınıfı mevcuttur. Bu sınıflar yardımıyla, çalışma zamanında oluşabilecek istisnai durumlar kolayca tespit edilebilmektedir.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;İstisna yakalama mekanizması (Exception Handling) dotNet mimarisinde olduk&amp;ccedil;a &amp;ouml;nemli bir yere sahiptir. Bu mekanizma sayesinde uygulamalarımızın kilitlenmesi ve istem dışı bir şekilde sonlandırılmaya zorlanmasının &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;miş oluruz. Framework i&amp;ccedil;erisinde &amp;ouml;nceden tanımlanmış pek &amp;ccedil;ok istisna sınıfı mevcuttur. Bu sınıflar yardımıyla, &amp;ccedil;alışma zamanında oluşabilecek istisnai durumlar kolayca tespit edilebilmektedir.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece uygulamaların, CLR tarafından denetlendiği sırada ortama fırlatılan istisnalar nedeniyle y&amp;ouml;n değiştirebilmesi ve yaşamını s&amp;uuml;rd&amp;uuml;rebilmesi sağlanmış olmaktadır. Ancak bazı durumlarda kendi istisna sınıflarımızı yazma ihtiyacı duyabiliriz. Bunun pek &amp;ccedil;ok nedeni olabilir. İlk ve en temel nedeni, sistemde var olan istisna sınıfları dışındaki bir istisnayı &amp;ccedil;alışma zamanında ele almak isteyişimizdir. İşte bu makalemizde bu işlevselliği nasıl ger&amp;ccedil;ekleştirebileceğimizi basit bir &amp;ouml;rnek &amp;uuml;zerinde incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;.Net Framework' te var olan istisna sınıflarının tamamı System.Exception sınıfından dolaylı bir şekilde t&amp;uuml;reyerek oluşturulmuşlardır. Kendi istisna nesnelerimizi oluşturabilmek ve yakalayabilmek i&amp;ccedil;in kullanacağımız sınıfları System isim alanında yer alan ApplicationException sınıfından t&amp;uuml;retiriz. (Aslında ApplicationException sınıfıda Exception sınıfından t&amp;uuml;remiştir.) Bu sayede throw anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; vasıtasıyla oluşturduğumuz istisna nesnelerinin ortama fırlatılabilmesini sağlamış oluruz. Ortama fırlatılan istisna nesnelerini uygun try...catch bloklarında yakalayarak hem uygulamanın &amp;ccedil;&amp;ouml;kmesini engellemiş hem de kullanıcıların anlamlı mesajlar ile uyarılmasını sağlamış oluruz. ApplicatinException, kullanıcı tanımlı istisna sınıflarının tipik Exception sınıflarının sahip olduğu &amp;uuml;yelerini kullanabilmesini sağlar. Bu tabiki kalıtımın bir sonucudur. Diğer yandan ApplicationException sınıfı, kendisinden t&amp;uuml;retilen sınıfın bir istisna nesnesi olduğunu ve throw anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; ile fırlatılabileceğini de belirtir.&lt;/p&gt;
&lt;p&gt;Konuyu daha iyi anlayabilmek amacıyla bir &amp;ouml;rnek &amp;uuml;zerinden gideceğiz. Senaryomuzda aşağıda kodları bulunan Kitap isimli sınıfı kullanan bir uygulama yer alacak. Amacımız bu sınıfı kullanırken istisnaya neden olabilecek noktaları tespit etmek ve bu istisnaları y&amp;ouml;netecek sınıfı yazarak uygulama i&amp;ccedil;erisinden y&amp;ouml;n verebilmektir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace KitapDukkani
{
    public class Kitap
    {
        private string m_Kitap_Yazar;
        private string m_Kitap_Baslik;
        private double m_Kitap_Fiyat;
        private DateTime m_Kitap_Basim;
        private string m_Kitap_Kategori;

        public string Yazar
        {
            get
            {
                return m_Kitap_Yazar;
            }
            set
            {
                m_Kitap_Yazar=value;
            }
        }
        public string Baslik
        {
            get
            {
                return m_Kitap_Baslik;
            }
            set
            {
                m_Kitap_Baslik=value;
            }
        }
        public double Fiyat
       {
            get
            {
                return m_Kitap_Fiyat;
            }
            set
            {
                m_Kitap_Fiyat=value;
            }
        }
        public DateTime Basim
        {
            get
            {
                return m_Kitap_Basim;
            }
            set
            {
                m_Kitap_Basim=value;
            }
        }
        public string Kategori
        {
            get
            {
                return m_Kitap_Kategori;
            }
            set
            {
                m_Kitap_Kategori=value;
            }
        }

        public Kitap(string yazar,string baslik,double fiyat,DateTime basim,string kategori)
        {
            Yazar=yazar;
            Baslik=baslik;
            Fiyat=fiyat;
            Basim=basim;
            Kategori=kategori;
        }

        public Kitap()
        {        
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Kitap sınıfımız tipik olarak bir kitabın temel &amp;ouml;zelliklerini sunan bir yapıya sahiptir. Bu sınıfı kullanacak olan bir yazılım geliştiricinin dikkat edeceği bir takım noktalar olacaktır. &amp;Ouml;rneğin, kitabın fiyatının negatif değer almaması , harf yada karakterlerden oluşmaması, basım tarihinin mutlaka tarihsel formatta olması gerekliliği vb. Bunlar uygulamanın &amp;ccedil;alışması esnasında hataya neden olabilecek durumlardır. Var olan istisna sınıfları yardımıyla bu tip hataları &amp;ccedil;alışma zamanında bertaraf ederek uygulamanın yaşamına devam etmesini sağlayabiliriz. Bunun yanında bu sınıfı kullanacak olan yazılım geliştirici kullanıcının hataya neden olacak girişlerini engelleyecek tedbirleri elbette g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alacaktır ve uygulayacaktır. &amp;Ouml;rneğin aşağıdaki windows uygulamasında kullanıcı girişlerinde oluşabilecek veri girişi hataları ele alınmaya &amp;ccedil;alışılmıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk122_1.gif" alt="" width="293" height="235" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak alanlara girilecek olan karakter sayısı sınırlandırılarak &amp;ccedil;ok uzun verilerin girilmeye &amp;ccedil;alışılması engellenebilir. Tarih girişlerinde oluşabilecek hataların &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek bir windows uygulaması i&amp;ccedil;in son derece kolaydır. DateTimePicker bileşeni bu kontrol&amp;uuml; bizim i&amp;ccedil;in fazlasıyla sağlamaktadır. Kategori se&amp;ccedil;iminde ise ComboBox bileşeni kullanılabilir. Kategori veriside aslında belirli bir listeden alınmak zorundadır. Bu liste bir veritabanından alınabileceği gibi, bir XML dosyasından da alınabililir vb...Bizim i&amp;ccedil;in hataya neden olabilecek bir diğer durumda Fiyat alanına girilecek sayısal değerin karakter olarak girilmeye &amp;ccedil;alışılmasıdır. Bunu engelleyebilmek i&amp;ccedil;in sadece sayısal karakter girişine izin verecek bir metod kullanamız gerekir. Bunu ger&amp;ccedil;ekleştirebileceğimiz en g&amp;uuml;zel yer ilgili TextBox kontrol&amp;uuml;n&amp;uuml;n KeyPress olay metodudur.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void txtFiyat_KeyPress(object sender, System.Windows.Forms.KeyPressEventArgs e)
{
    if (((int)e.KeyChar &amp;lt; 48 || (int)e.KeyChar &amp;gt; 57) &amp;amp;&amp;amp; ((int)e.KeyChar!=8)) 
    {
        e.Handled=true;
    }
}&lt;/pre&gt;
&lt;p&gt;Ama halen daha yazılım geliştiricinin bilmediği ve bu gibi durumlarda kullanıcının uyarılmasını istediğimiz istisnai durumlar olabilir. &amp;Ouml;rneğin fiyat alanına her ne kadar negatif değer girilemiyecek olsada, fiyat alanındaki g&amp;uuml;ncel değer belli bir oranda azaltılmaya &amp;ccedil;alışıldığında negatif değerin oluşabileceği g&amp;ouml;r&amp;uuml;lebilir. &amp;Ouml;rneğin fiyat azaltımı i&amp;ccedil;in aşağıdaki metodu uyguladığımız varsayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnIndirim_Click(object sender, System.EventArgs e)
{
    if(kitap!=null)
    {
        kitap.Fiyat-=10;
        txtFiyat.Text=kitap.Fiyat.ToString();
    }
}&lt;/pre&gt;
&lt;p&gt;Bu durumda ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk122_2.gif" alt="" width="296" height="240" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi normal şartlar altında TextBox i&amp;ccedil;erisine - karakterini basamasakta Kitap nesnemizi oluşturduktan sonra Fiyat &amp;ouml;zelliğinin değerinde yapacağımız 10 birimlik azaltmalar sonucu - değer g&amp;ouml;r&amp;uuml;nebilmektedir. Bu bir bug olarak değerlendirilebilse de &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;memiz gereken bir durumdur. Dahası Kitap sınıfını kullanan yazılım geliştirici bu tip bir kontrol&amp;uuml; hi&amp;ccedil; yapmayadabilir. İşte b&amp;ouml;yle bir durumda en azından girilen değerin negatif olması durumunda ortama bir istisnanın fırlatılmasını sağlayabiliriz. Diğer yandan girilen Fiyat değerinin belli bir değerin &amp;uuml;st&amp;uuml;nde olmamasını da isteyebiliriz. İşte bu iki basit nedeni ele alarak kendi istisna sınıfımızı yazabiliriz. İlk başta uygulamamızın Kitap nesnesi oluşturan kodunu standart try...catch yapsısı i&amp;ccedil;inde kullanamayı deneyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnOlustur_Click(object sender, System.EventArgs e)
{
    try
    {
        kitap=new Kitap();
        kitap.Baslik=txtBaslik.Text;
        kitap.Yazar=txtYazar.Text;
        kitap.Basim=dtpBasim.Value;
        kitap.Fiyat=Convert.ToDouble(txtFiyat.Text);
        kitap.Kategori=cmbKategori.SelectedText; 
    }
    catch(System.Exception err)
    {
        MessageBox.Show(err.Message,"Hata",MessageBoxButtons.OK,MessageBoxIcon.Error);
    }
}&lt;/pre&gt;
&lt;p&gt;Bu haliyle uygulamayı &amp;ccedil;alıştırdığımızda ve fiyat alanı i&amp;ccedil;in eksi değere ge&amp;ccedil;tiğimizde ortama herhangi bir istisna nesnesinin fırlatılmadığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. &amp;Ccedil;&amp;uuml;nk&amp;uuml; oluşacak istisnai durum hen&amp;uuml;z tarafımızdan yaratılmamıştır. Dolayısıyla ApplicationException sınıfından t&amp;uuml;reteceğimiz bir exception sınıfı yazmamız gerekmektedir. İşte bu amacımızı sağlayan FiyatException isimli istisna sınıfımızın kodları;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace KitapDukkani
{
    /// &amp;lt;summary&amp;gt;
    /// Bir kitabın fiyatı ile ilgili istisna sınıfıdır.
    /// &amp;lt;/summary&amp;gt;
    public class FiyatException:ApplicationException
    {
        /// &amp;lt;summary&amp;gt;
        /// İstisnaya neden olan fiyat değerini tutan &amp;ouml;zel field.
        /// &amp;lt;/summary&amp;gt;
        private double m_Fiyat;
        /// &amp;lt;summary&amp;gt;
        /// İstisna ile ilgili kısa a&amp;ccedil;ıklama
        /// &amp;lt;/summary&amp;gt;
        private string m_Mesaj;

        /// &amp;lt;summary&amp;gt;
        /// İstisna nesnesi oluşturulurken hataya neden olan fiyat değeri alınıp m_Fiyat &amp;ouml;zel alanına eşitlenir.
        /// &amp;lt;/summary&amp;gt;
        /// &amp;lt;param name="fiyat"&amp;gt;İstisnaya neden olan fiyat alanının değeridir.&amp;lt;/param&amp;gt;
        public FiyatException(double fiyat,string mesaj)
        {
            m_Fiyat=fiyat;
            m_Mesaj=mesaj;
        }

        /// &amp;lt;summary&amp;gt;
        /// ApplicationException sınıfından gelen Message &amp;ouml;zelliği override edilmiştir. Geriye &amp;ouml;zel bir hata mesajı d&amp;ouml;nd&amp;uuml;rmektedir.
        /// &amp;lt;/summary&amp;gt;
        public override string Message
        {
            get
            {
                return "Kitaba ait fiyat değeri "+m_Fiyat+"belirtilen kriterlere uygun değildir."+" '"+m_Mesaj+"'";
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi kendi yazdığımız istisna sınıflarının normal bir sınıfı yazmaktan hi&amp;ccedil; bir farkı yoktur. Kendi &amp;uuml;yelerimizi ekleyebilir ve Exception sınıfından devralınan Message, TargetSite, InnerException gibi virtual &amp;ouml;zellikleri override edebiliriz. Sınıf tasarımını yaparken bu sınıfa ait nesne &amp;ouml;rneklerinin ne ama&amp;ccedil;la kullanılacağını belirlemeliyiz. FiyatException sınıfına ait bir nesne &amp;ouml;rneği, herhangi bir Kitap nesnesinin fiyatının bazı kriterlere uymaması durumunda fırlatılacaktır.&lt;/p&gt;
&lt;table id="table6" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;.Net i&amp;ccedil;inde &amp;ouml;nceden tanımlanmış olan istisna sınıfları Exception kelimesi ile biterler. Kendi istisna sınıflarımızın isimlerinin de aynı şekilde yazılması kod standardizasyonu a&amp;ccedil;ısından &amp;ouml;nemlidir. &amp;Ouml;rneğin FiyatException gibi...&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Dolayısıyla kritere uymayacak Fiyat değerini taşıması &amp;ouml;nemlidir. Ayrıca kriterin &amp;ccedil;eşitliliğine g&amp;ouml;re kullanıcıya verilmesi istenen mesaj i&amp;ccedil;eriğide bir field olarak saklanmalıdır. Bu iki field' ın alacağı değerleri ise constructor metodumuz i&amp;ccedil;erisinde sağlayabiliriz. Oluşturduğumuz istisna nesnesinin tipik bir Exception nesnesi gibi davranabilmesini sağlamak amacıyla &amp;ouml;rnek olarak Message &amp;ouml;zelliği override edilmiştir. FiyatException sınıfı artık uygulama i&amp;ccedil;erisinde yakalanabilecek tipik bir istisna halini almıştır. Ancak hen&amp;uuml;z uygulanmamıştır. Herşeyden &amp;ouml;nce istisnanın fırlatılmasını istediğimiz yerlerde bunları kodlamamız gerekecektir. Kitap nesnemizi g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda Fiyat &amp;ouml;zelliğinin değerinin verildiği set bloğu bu iş i&amp;ccedil;in bi&amp;ccedil;ilmiş kaftandır. Buradaki kodları aşağıdaki gibi d&amp;uuml;zenleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public double Fiyat
{
    get
    {
        return m_Kitap_Fiyat;
    }
    set
    {
        if(value&amp;gt;150)
            throw new FiyatException(value,"Fiyat 150 YTL' den y&amp;uuml;ksek olamaz");
        if(value&amp;lt;0)
            throw new FiyatException(value,"Fiyat negatif değer olamaz");
        m_Kitap_Fiyat=value;
    }
}&lt;/pre&gt;
&lt;p&gt;Fiyat &amp;ouml;zelliğine değer atanırken eğer girilen değer 0' dan k&amp;uuml;&amp;ccedil;&amp;uuml;k ise buna uygun mesaja sahip bir istisna nesnesi, Fiyat 150 YTL' den b&amp;uuml;y&amp;uuml;k ise buna uygun mesaja sahip bir istisna nesnesi ortama fırlatılmaktadır. B&amp;ouml;ylece catch bloğunda FiyatException nesne &amp;ouml;rneklerini yakalayabiliriz. Kitap sınıfının yapıcı metodunda parametre &amp;uuml;zerinden, sınıf i&amp;ccedil;indeki alanlara değer ataması yapılmaktadır. Ancak burada da parametre değerlerini direkt olarak &amp;ouml;zelliklere atadığımızda set blokları devreye girmektedir. Bu, Fiyat &amp;ouml;zelliğinin değeri i&amp;ccedil;in gerekli istisna kontrol&amp;uuml;n&amp;uuml; yapıcı metod i&amp;ccedil;erisinde de ger&amp;ccedil;ekleştirebilmemizi sağlar. Kısacası bir taşla iki kuş vurmuş oluruz. Artık windows uygulamamızdaki kodları aşağıdaki gibi d&amp;uuml;zenleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnOlustur_Click(object sender, System.EventArgs e)
{
    try
    {
        kitap=new Kitap();
        kitap.Baslik=txtBaslik.Text;
        kitap.Yazar=txtYazar.Text;
        kitap.Basim=dtpBasim.Value;
        kitap.Fiyat=Convert.ToDouble(txtFiyat.Text);
        kitap.Kategori=cmbKategori.SelectedText; 
    }
    catch(FiyatException err)
    {
        MessageBox.Show(err.Message,"Hata",MessageBoxButtons.OK,MessageBoxIcon.Error);
    }
    catch(System.Exception err)
    {
        MessageBox.Show(err.Message,"Hata",MessageBoxButtons.OK,MessageBoxIcon.Error);
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rneğin Kitap sınıfına ait nesne &amp;ouml;rneğini oluştururken Fiyat alanının değerini 175 olarak girelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk122_3.gif" alt="" width="527" height="365" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi oluşturduğumuz istisna sınıfına ait nesne &amp;ouml;rneği, Kitap nesnesi oluşturulmaya &amp;ccedil;alışıldığında ortama fırlatılmıştır. Bir de Fiyat değerini 10' ar birim azalttığımızda eksi değere ge&amp;ccedil;tiğimiz bir metodumuz vardı. Kitap nesnesinin istisnasız oluşturup fiyatını negatif değere &amp;ccedil;ektiğimizde uygulamanın FiyatException istisnası nedeni ile kesilerek sonlandırıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk122_4.gif" alt="" width="562" height="349" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulamanın istisnayı yakalayamamasının sebebi fiyat azaltımı yapan metodumuzun ilgili istisnayı yakalayacak bir try...catch yapısını kullanmayışıdır. İster kendi istisna nesnelerimiz olsun ister sistemde var olan istisna nesneleri olsun, bunların yakalanarak uygulamanın sonlandırılmadan yaşamaya devam edebilmesi i&amp;ccedil;in uygun catch blokları ile yakalanmaları şarttır. Dolayısıyla fiyat arttırma ve azaltma metodlarımızı aşağıdaki gibi yenilememiz gerekmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnIndirim_Click(object sender, System.EventArgs e)
{
    try
    {
        if(kitap!=null)
        {
            kitap.Fiyat-=10;
            txtFiyat.Text=kitap.Fiyat.ToString();
        }
    }
    catch(FiyatException err)
    {
        MessageBox.Show(err.Message,"Hata",MessageBoxButtons.OK,MessageBoxIcon.Error);
    }
}

private void btnArttir_Click(object sender, System.EventArgs e)
{
    try
    {
        if(kitap!=null)
        {
            kitap.Fiyat+=10;
            txtFiyat.Text=kitap.Fiyat.ToString();
        }
    }
    catch(FiyatException err)
    {
        MessageBox.Show(err.Message,"Hata",MessageBoxButtons.OK,MessageBoxIcon.Error);
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk122_5.gif" alt="" width="508" height="397" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Artık Fiyat alanı i&amp;ccedil;in eksi değer oluşmamaktadır. Burada dikkat etmemiz gereken bir diğer noktada catch bloklarında kendi tanımladığımız istisna sınıflarını yakalayabilmek i&amp;ccedil;in ilede o istisna sınıfına ait nesne &amp;ouml;rneğini belirtme zorunluluğumuzun olmayışıdır. Yani&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;catch(FiyatException err)
{
    MessageBox.Show(err.Message,"Hata",MessageBoxButtons.OK,MessageBoxIcon.Error);
}&lt;/pre&gt;
&lt;p&gt;yerine,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;catch(Exception err)
{    MessageBox.Show(err.Message,"Hata",MessageBoxButtons.OK,MessageBoxIcon.Error);
}&lt;/pre&gt;
&lt;p&gt;formunuda kullanabiliriz. Yine aynı istisna mesajlarını yakalayacağızdır.&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, uygulamalarımızda d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z istisnai durumları yakalayabilmemizi sağlayacak sınıfları tasarlamak son derece kolaydır. &amp;Ouml;nemli olan nokta, istisna nesnemizin ger&amp;ccedil;ekten gerekli olup olmadığıdır. Eğer b&amp;ouml;yle bir gereklilik var ise ve kendi istisna sınıflarımızı oluşturduysak bunlara ait nesne &amp;ouml;rneklerini uygun yerlerde ortama fırlatmalıyız. Son olarak fırlattığımız istisna nesnelerimizi catch blokları ile yakalayarak uygulamaya y&amp;ouml;n vermeliyiz. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/Kitap.rar"&gt;&amp;Ouml;rnek uygulama i&amp;ccedil;in tıklayın.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2005-05-23 12:00:00</pubDate>
  <slug>Kendi-İstina-Nesnelerimizi-Kullanmak-(ApplicationException)-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>exception-handling</tag>
    <tag>exception</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>