<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ado.Net Data Services Ders Notları - 6 (Optimistic Concurrency)</title>
  <description>İstemci-Sunucu(Client-Server) bazlı uygulamalar göz önüne alındığında, istemcilerin aynı veriler üzerinde birbirlerinden habersiz şekilde değişiklikler yapabilme ihtimali oldukça meşhur bir vaka olarak bilinmektedir.</description>
  <content>&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Değerli Okurlarım Merhabalar,&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;İstemci-Sunucu(Client-Server)&lt;/strong&gt; bazlı uygulamalar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında, istemcilerin aynı veriler &amp;uuml;zerinde birbirlerinden habersiz şekilde değişiklikler yapabilme ihtimali olduk&amp;ccedil;a meşhur bir vaka olarak bilinmektedir. &amp;Ouml;zellikle .Net tarafında &lt;strong&gt; bağlantısız katman(Disconnected Layer) &lt;/strong&gt;uygulamalarında bu tip vakalar son derece &amp;ouml;nemlidir. Zaman zaman bu tip vakalar ile m&amp;uuml;cadele etmek ve tedbirler almak gerekir. Vaka aslında şu şekilde ifade edilebilir; "sunucu &amp;uuml;zerinden aynı veri i&amp;ccedil;eriklerini &amp;ccedil;eken istemci programlar, sunucu ile bağlantılarını kestikten sonra kendi uygulama alanları &amp;uuml;zerine aldıkları verilerde değişiklik yapabilirler. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Ancak bu noktada sunucu ile s&amp;uuml;rekli bir bağlantıları olmadığından, başka istemcilerin aynı veriler &amp;uuml;zerinde değişiklikler yapıp yapmadıklarını tam olarak bilemezler. Bu sebepten aynı veriler &amp;uuml;zerinde birbirlerinden habersiz olacak şekilde yaptıkları değişiklikleri sunucuya g&amp;ouml;nderebilirler." İşte bu noktada sunucu tarafında durumun nasıl ele alınacağı &amp;ouml;nem kazanır. Bu ama&amp;ccedil;la &amp;ccedil;eşitli denetleme mekanizmaları kullanılabilir. Bu yazımızda hepinizin kulağında bol bol &lt;strong&gt;Optimistic Concurrency&lt;/strong&gt; kelimelerinin &amp;ccedil;ınlayacağını şimdiden s&amp;ouml;yleyebilirim.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bahsetmiş olduğumuz bu vaka bazen g&amp;ouml;rmezden gelinebilecek olmasına karşın &amp;ccedil;oğu durumda kontrol altına alınması gereken bir sorun olarak değerlendirilir. İşin i&amp;ccedil;erisine birde değişikliklerin sunucu &amp;uuml;zerindeki veritabanına g&amp;ouml;nderilmesi sırasında devreye alınan &lt;strong&gt;Transaction&lt;/strong&gt;' lar girerse, vaka kendi i&amp;ccedil;erisinde dahada karmaşıklaşır. Ancak bizim şu anda &lt;span style="text-decoration: underline;"&gt;istemediğimiz&lt;/span&gt; tek şey bu vakayı dahada karıştırmaktır. Bunlara karşın s&amp;ouml;z konusu vakada &amp;ccedil;&amp;ouml;z&amp;uuml;msel olarak &lt;strong&gt;optimistic(iyimser)&lt;/strong&gt; yada &lt;strong&gt;pesimistic(k&amp;ouml;t&amp;uuml;mser)&lt;/strong&gt; yaklaşımların uygulanabilir olduklarınıda bilmek gerekir. Peki bu durumun Ado.Net Data Service' ler ile olan bağlantısı nedir? Herşeyden &amp;ouml;nce Ado.Net Data Service hangi modeli baz alır? Baz aldığı model nasıl uygulanır?&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bildiğiniz gibi bu ana kadarki ders notlarımızda ve g&amp;ouml;rsel derslerimizde &lt;strong&gt;Ado.Net Data Service&lt;/strong&gt;' lerin, web programlama modeline uygun olarak &amp;ccedil;alıştığını ve &lt;strong&gt;EDM(Entity Data Model)&lt;/strong&gt; yada &lt;strong&gt;Custom LINQ Provider&lt;/strong&gt; gibi katmanlar &amp;uuml;zerinde veri sunumu ger&amp;ccedil;ekleştirdiğine değindik. Ayrıca, &lt;strong&gt;Ado.Net Data Service&lt;/strong&gt;' ler bir sunucu uygulama &amp;uuml;zerinden &lt;strong&gt;host&lt;/strong&gt; edilmek zorunda olmakla birlikte, bunları t&amp;uuml;keten farklı istemci uygulamalar yazılabilmektedir. Bir başka deyişle tipik bir &lt;strong&gt;istemci-sunucu &lt;/strong&gt;modeli s&amp;ouml;z konusudur. Bunlara ilaveten işin i&amp;ccedil;erisinde, istemci tarafına &amp;ccedil;ekilebilen veriler ve tabiki &lt;strong&gt;CRUD(CreateRetriveUpdateDelete) &lt;/strong&gt;operasyonları s&amp;ouml;z konusudur. Bu operasyonlar i&amp;ccedil;erisinde yer alan &lt;strong&gt;CUD&lt;/strong&gt; fonksiyonellikleri ve istemcilerin veriyi kendi uygulama alanlarına &amp;ccedil;ektikten sonra sunucu ile herhangibir bağlantılarının kalmayışı, istemcilerin aynı veriler &amp;uuml;zerinde birbirlerinden habersiz değişikliker yapabilecekleri sonucunu doğurmaktadır. Peki bu tarz bir sorun ile nasıl m&amp;uuml;cadele edilebilir? &lt;strong&gt;Ado.Net Data Service&lt;/strong&gt; &amp;ccedil;&amp;ouml;z&amp;uuml;m olarak, &lt;strong&gt; Optimistic&lt;/strong&gt; &lt;strong&gt;Concurrency&lt;/strong&gt; yaklaşımının ele alınmasına izin vermektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Optimistic&lt;/strong&gt; &lt;strong&gt;Concurrency&lt;/strong&gt; yaklaşımına g&amp;ouml;re, istemci tarafına &amp;ccedil;ekilen veriler g&amp;uuml;ncelleştirilmek &amp;uuml;zere sunucu tarafına g&amp;ouml;nderildiklerinde ilk hali ile karşılaştırılırlar. B&amp;ouml;ylece ilk okumadan sonra başka bir istemcinin aynı veriyi değiştirip değiştirmediği kontrol altına alınabilir. Eğer bir değişiklik var ise istemcinin bu konuda uyarılması gerekir. Bu uyarıl &amp;uuml;zerinde &amp;ccedil;alışılmakta olan modele g&amp;ouml;re &amp;ccedil;oğunlukla bir &lt;strong&gt;istisna(Exception)&lt;/strong&gt; olarak ele alınır. S&amp;ouml;z gelimi &lt;strong&gt;Ado.Net&lt;/strong&gt; tarafından bildiğimiz &lt;strong&gt;DBConcurrencyViolation&lt;/strong&gt; bu tip bir istisnadır. Tabi işin i&amp;ccedil;erisine servis y&amp;ouml;nelimli bir &amp;ccedil;&amp;ouml;z&amp;uuml;m girdiğinde bu, &amp;ccedil;oğunlukla bir &lt;strong&gt;Fault&lt;/strong&gt; &lt;strong&gt;Message&lt;/strong&gt; formatına uygun olacak şekilde hata bilgisi i&amp;ccedil;eren bir &lt;strong&gt;XML&lt;/strong&gt; verisidir. Eğer veriler başkası tarafından değiştirilmemişse tabiki g&amp;uuml;ncelleme işlemi sunucu tarafındada onaylanacaktır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Peki &lt;strong&gt;Ado.Net Data Service&lt;/strong&gt; tarafında bu yaklaşım nasıl ele alınmaktadır? Artık bu noktadan sonra adım adım basit bir &amp;ouml;rnek &amp;uuml;zerinde ilerlenilmesinde yarar olacağı kanısındayım. &amp;Ouml;rneğimizi geliştirirken en b&amp;uuml;y&amp;uuml;k yardımcılarımızdan biriside &lt;strong&gt;Fiddler&lt;/strong&gt; isimli &lt;strong&gt;HTTP&lt;/strong&gt; &lt;strong&gt;Debugging&lt;/strong&gt; &lt;strong&gt;Proxy&lt;/strong&gt; aracı olacaktır. Nitekim &amp;ccedil;akışma olması halinde istemciler ve sunucu arasında gidip gelen &lt;strong&gt;HTTP&lt;/strong&gt; paketlerinin incelenmesi gerekmektedir. Test senaryomuz son derece basittir. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Aynı veri satırı &amp;uuml;zerinde değişiklik yapacak en az iki istemci uygulamanın &amp;ccedil;alıştırılması ve bu esnada oluşacak &lt;strong&gt; istisnaların(Exceptions) &lt;/strong&gt;ve &lt;strong&gt;HTTP&lt;/strong&gt; paketlerinin izlenmesi hedeflenmektedir. Bunların yanında SQL tarafında neler olduğunu g&amp;ouml;zlemlemek adınada &lt;strong&gt;SQL Server Profiler&lt;/strong&gt; aracından yararlanmamız gerekecektir. Tabi &amp;ouml;ncelikli olarak basit bir &lt;strong&gt;WCF&lt;/strong&gt; &lt;strong&gt;Service&lt;/strong&gt; uygulaması geliştirerek başlamalıyız. S&amp;ouml;z konusu servisimiz daha &amp;ouml;nceden geliştirdiğimiz &lt;strong&gt;Azon&lt;/strong&gt; isimli veritabanını ve i&amp;ccedil;erisinde bir ka&amp;ccedil; satır veri i&amp;ccedil;eren &lt;strong&gt;Kitap&lt;/strong&gt; isimli tabloyu istemci tarafına sunacak şekilde geliştirilecektir. Bu nedenle &lt;strong&gt;WCF&lt;/strong&gt; &lt;strong&gt;Service&lt;/strong&gt; uygulamımız i&amp;ccedil;in gerekli olan &amp;ouml;n hazırlıklar aşağıdaki gibidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;EDM(Entity Data Model) i&amp;ccedil;eriğimiz;&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk263_2.gif" alt="" width="209" height="253" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Burada hemen bir &amp;ouml;zelliği vurgulamak gerekiyor. &lt;strong&gt;EDM&lt;/strong&gt; diagramında yer alan &lt;strong&gt;Kitap&lt;/strong&gt; &lt;strong&gt;Entity&lt;/strong&gt; tipi i&amp;ccedil;erisinde yer alan &amp;ouml;zelliklerin her birisi i&amp;ccedil;in &lt;strong&gt;Concurrency&lt;/strong&gt; &lt;strong&gt;Mode&lt;/strong&gt; isimli bir &amp;ouml;zellik yer almaktadır. &lt;strong&gt;Properties&lt;/strong&gt; penceresinden ulaşılabilen bu &amp;ouml;zelliğin değeri varsayılan olarak &lt;strong&gt;None&lt;/strong&gt; şeklindedir. Buna &lt;strong&gt;Mixed&lt;/strong&gt; değerini vermemiz halinde &lt;strong&gt;Optimistic&lt;/strong&gt; &lt;strong&gt;Concurrency&lt;/strong&gt; i&amp;ccedil;in s&amp;ouml;z konusu &amp;ouml;zellik değerlerinin hesaba katılacağı belirtilmiş olunur. &amp;Ouml;rneğimizde bu ama&amp;ccedil;la &lt;strong&gt;Ad&lt;/strong&gt; ve &lt;strong&gt; Fiyat&lt;/strong&gt; &amp;ouml;zelliklerinin &lt;strong&gt;Concurrency&lt;/strong&gt; &lt;strong&gt;Mode&lt;/strong&gt; değerleri &lt;strong&gt; Mixed&lt;/strong&gt; olarak belirlenmiştir. Ki senaryomuzda sadece bu alanların değerleri i&amp;ccedil;in &lt;strong&gt;Optimistic&lt;/strong&gt; &lt;strong&gt;Concurreny&lt;/strong&gt; kontrol&amp;uuml; yapılacaktır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk263_1.gif" alt="" width="472" height="253" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Kitap tablosuna ait bir ka&amp;ccedil; satırlık veri i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk263_3.gif" alt="" width="618" height="239" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;AzonServices.svc.cs i&amp;ccedil;eriğimiz;&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data.Services;
using System.Collections.Generic;
using System.Linq;
using System.ServiceModel.Web;
using AzonModel;

public class AzonServices 
    : DataService&amp;lt;AzonEntities&amp;gt;
{ 
    public static void InitializeService(IDataServiceConfiguration config)
    {
        config.SetEntitySetAccessRule("*", EntitySetRights.All); 
    }
}&lt;/pre&gt;
&lt;p&gt;Tahmin edeceğiniz gibi istemci tarafında &lt;strong&gt;CRUD&lt;/strong&gt; operasyonları yapılabileceğinden &lt;strong&gt;EntitySetRights.All&lt;/strong&gt; &lt;strong&gt;enum&lt;/strong&gt; sabiti değeri kullanılmıştır. Buraya kadar geldikten sonra &lt;strong&gt;AzonServices.svc&lt;/strong&gt; isimli &lt;strong&gt;Ado.Net Data Service&lt;/strong&gt; &amp;ouml;rneğinin &amp;ccedil;alıştığından emin olmakta yarar vardır. Bunun i&amp;ccedil;in servisi basit bir tarayıcı uygulama i&amp;ccedil;erisinde a&amp;ccedil;mamız yeterli olacaktır. Aşağıdakine benzer bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk263_4.gif" alt="" width="577" height="280" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Yanlız burada &lt;strong&gt;Kitap&lt;/strong&gt; &lt;strong&gt;entity&lt;/strong&gt; i&amp;ccedil;eriği talep edildiğinde, &lt;strong&gt;atom&lt;/strong&gt; formatında &amp;uuml;retilen &lt;strong&gt;XML&lt;/strong&gt; verisinde yeni bir &lt;strong&gt;attribute&lt;/strong&gt; tanımlaması karşımıza gelecektir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk263_5.gif" alt="" width="639" height="710" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Her bir &lt;strong&gt;entity&lt;/strong&gt; elementi i&amp;ccedil;erisinde &lt;strong&gt;m:etag&lt;/strong&gt; isimli bir &lt;strong&gt;attribute(nitelik)&lt;/strong&gt; tanımlanmıştır. &lt;strong&gt;m&lt;/strong&gt; takma adlı isim alanına sahip bu nitelikler i&amp;ccedil;erisinde her bir kitabın &lt;strong&gt;Ad&lt;/strong&gt; ve &lt;strong&gt;Fiyat&lt;/strong&gt; bilgilerinin yer aldığına dikkat edin. Hatırlayacağınız gibi, &lt;strong&gt;EDM&lt;/strong&gt; diagramında bu &amp;ouml;zelliklerin &lt;strong&gt; Concurrency&lt;/strong&gt; &lt;strong&gt;Mode&lt;/strong&gt; değerlerini &lt;strong&gt;Mixed&lt;/strong&gt; olarak belirlemiştik. Bu nedenle &amp;ccedil;akışma kontrol&amp;uuml; i&amp;ccedil;in ilgili &amp;ouml;zelliklerin değerleri &lt;strong&gt;XML&lt;/strong&gt; &amp;ccedil;ıktısına dahil edilmiştir. Bundan dolayı &lt;strong&gt;etag&lt;/strong&gt; yada &lt;strong&gt;entitytag&lt;/strong&gt; adı verilen nitelikler i&amp;ccedil;erisinde taşınan &amp;ouml;zellik değerleri, &amp;ccedil;akışma kontrol&amp;uuml; i&amp;ccedil;in istemci ile sunucu arasında gidip gelen paketlerde &amp;ouml;nem kazanmaktadır. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Gelelim istemci uygulamamıza. Amacımız &lt;strong&gt; Optimistic Concurrency&lt;/strong&gt; modelini Ado.Net Data Service' ler &amp;uuml;zerinde incelemek olduğundan şimdilik işimizi g&amp;ouml;recek basit bir program yazmamız yeterli olacaktır. Sanıyorumki ne demek istediğimi anladınız :) Basit bir &lt;strong&gt;Console&lt;/strong&gt; &lt;strong&gt;Application&lt;/strong&gt; geliştiriyoruz. Uygulamamıza aynı &lt;strong&gt;solution&lt;/strong&gt; i&amp;ccedil;erisinde yer alan servisimizide ekledikten sonra istemci uygulama kodlarımızı aşağıdaki gibi geliştirebiliriz.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using ClientApp.AzonServiceReference;

namespace ClientApp
{
    class Program
    {
        static void Main(string[] args)
        {
            // Proxy nesne &amp;ouml;rneği oluşturulur.
            AzonEntities proxy = new AzonEntities(new Uri("http://buraksenyurt:1000/AdventureHost/AzonServices.svc"));

            // Concurrency testi i&amp;ccedil;in ID si 81 olan Kitap verisi &amp;ccedil;ekilir
            Kitap kitap81 = (from k in proxy.Kitap
                                        where k.KitapId==81
                                            select k).First&amp;lt;Kitap&amp;gt;();
    
            // 81 nolu ID' ye ait kitap bilgileri g&amp;ouml;sterilir
            Console.WriteLine("{0} : {1} : {2} : {3}",kitap81.KitapId,kitap81.Ad,kitap81.Fiyat,kitap81.StokMiktari);

            // Test amacıyla rastgele bir artış değeri &amp;uuml;retilir ve 81 nolu Kitap nesne &amp;ouml;rneğinin Fiyat değeri değiştirilir
            Random rnd = new Random();
            int yeniFiyatArtisi = rnd.Next(1, 10);
            kitap81.Fiyat = kitap81.Fiyat + yeniFiyatArtisi;

            // Burası test noktası
            Console.WriteLine("{0} in fiyatı {1} olarak değiştirilecek. Onaylamak i&amp;ccedil;in tuşa basın.", kitap81.Ad, kitap81.Fiyat);
            Console.ReadLine();

            // Nesne g&amp;uuml;ncellenir
            proxy.UpdateObject(kitap81);
    
            // Bir istisna bloğu i&amp;ccedil;erisinde SaveChanges metodu &amp;ccedil;ağırılır.
            try
            {
                proxy.SaveChanges();
                Console.WriteLine("İşlem tamam");
            }
            catch (Exception excp)
            {
                // Burada beklenen hata mesajı InnerException i&amp;ccedil;erisinde gelir
                Console.WriteLine(excp.InnerException.Message);
            }

            Console.ReadLine();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Kısaca istemci uygulamada neler yaptığımızdan bahsedelim. &amp;Ouml;ncelikli olarak &lt;strong&gt;proxy&lt;/strong&gt; nesnesi &amp;ouml;rnekleniyor. &lt;strong&gt;Fiddler&lt;/strong&gt; aracını &lt;strong&gt;Web&lt;/strong&gt; &lt;strong&gt;Development&lt;/strong&gt; &lt;strong&gt; Server&lt;/strong&gt; &amp;uuml;zerinden &amp;ccedil;alıştıracağımız i&amp;ccedil;in daha &amp;ouml;nceki makalemizde bahsettiğimiz gibi &lt;strong&gt;1000&lt;/strong&gt; numaralı portu ve makine adını kullanıyoruz. İlerleyen kısımlarda test amacıyla &lt;strong&gt;KitapID&lt;/strong&gt; değeri &lt;strong&gt;81&lt;/strong&gt; olan kitap bilgilerini istemci tarafına &lt;strong&gt;LINQ&lt;/strong&gt; sorgusu &amp;uuml;zerinden &amp;ccedil;ekiyoruz. Elde edilen &lt;strong&gt;Kitap&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt;Fiyat&lt;/strong&gt; &amp;ouml;zelliğini &lt;strong&gt;Random&lt;/strong&gt; sınıfı ile &amp;uuml;retilen rastgele bir değer kadar arttırıyoruz. Sonrasında ise bir &lt;strong&gt;Console.ReadLine&lt;/strong&gt; &amp;ccedil;ağrısı g&amp;ouml;rmekteyiz. Bu &amp;ccedil;ağrının olduğu yer aynı uygulamadan aynı makinede birden fazla &amp;ccedil;alıştırdığımızda test yapmamızı kolaylaştıracaktır.&lt;/p&gt;
&lt;p&gt;Bu &amp;ccedil;ağrının ardından &lt;strong&gt;UpdateObject&lt;/strong&gt; metodu işletiliyor. Sonrasında ise &lt;strong&gt;try...catch&lt;/strong&gt; blokları i&amp;ccedil;erisinde alınmış olan bir &lt;strong&gt;SaveChanges&lt;/strong&gt; metodu &amp;ccedil;ağrısı g&amp;ouml;r&amp;uuml;yoruz. Bu &amp;ccedil;ağrı istemci tarafındaki g&amp;uuml;ncelleştirmenin sunucuya iletilmesine neden oluyor. İşte bu noktada eğer bir &amp;ccedil;akışma s&amp;ouml;z konusu ise istemci tarafına bir &lt;strong&gt;exception&lt;/strong&gt; d&amp;ouml;nd&amp;uuml;r&amp;uuml;lecektir. Gelin hemen bir test yaparak işe başlayalım. Testimizde aynı uygulamadan iki adet &amp;ccedil;alıştırıyor ve birinde değişiklikleri sunucuya g&amp;ouml;nderdikten sonra , ikincisi i&amp;ccedil;inde aynı işlemi yapmayı deniyoruz. Sonu&amp;ccedil; olarak bu test sonrasında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;leri oluşacaktır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Her iki uygulama a&amp;ccedil;ılıp ilk uygulamadaki g&amp;uuml;ncellemeler servis tarafında g&amp;ouml;nderildiğinde;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk263_6.gif" alt="" width="500" height="198" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;İkinci uygulamada devam edilip yeni değerler ile aynı veri g&amp;uuml;ncellenmek &amp;uuml;zere servise g&amp;ouml;nderildiğinde;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk263_7.gif" alt="" width="505" height="256" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ikinci uygulamaya bir adet &lt;strong&gt;Fault Exception &lt;/strong&gt;g&amp;ouml;nderilmiş ve &lt;strong&gt;etag&lt;/strong&gt; değerinin &lt;strong&gt;Request&lt;/strong&gt; &lt;strong&gt;Header&lt;/strong&gt;' daki g&amp;uuml;ncel &lt;strong&gt;etag&lt;/strong&gt; değeri ile uyuşmadığı belirtilmiştir. Bir başka deyişle ikinci uygulamanın g&amp;uuml;ncelleştirmek istediği satır başkası tarafından g&amp;uuml;ncellenmiştir. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Hemen &lt;strong&gt;Fiddler&lt;/strong&gt; aracı ile arka planda olanları inceleyelim. Birinci uygulama &amp;ccedil;alıştırıldığında ilk olarak &lt;strong&gt; 81&lt;/strong&gt; numaralı &lt;strong&gt;KitapID&lt;/strong&gt; değerine sahip veri &amp;ccedil;ekilmektedir. Bu tipik olarak &lt;strong&gt;HTTP&lt;/strong&gt; &lt;strong&gt;Get&lt;/strong&gt; &amp;ccedil;ağrısıdır ve &lt;strong&gt;Request(İstek)&lt;/strong&gt; ile &lt;strong&gt;Response(Cevap)&lt;/strong&gt; paketlerine ait &lt;strong&gt;Header(Başlık)&lt;/strong&gt; i&amp;ccedil;erikleri aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk263_8.gif" alt="" width="639" height="573" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Standart bir iletişim olduğu g&amp;ouml;zlemlenmekle birlikte &lt;strong&gt;Respons&lt;/strong&gt; &lt;strong&gt;Header&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt;ETag&lt;/strong&gt; isimli bir bilgi daha yer almaktadır. Bu bilgiye g&amp;ouml;re ilk uygulamaya &amp;ccedil;ekilen kitap satırında &lt;strong&gt;Ad&lt;/strong&gt; değeri &lt;strong&gt;Ado.Net Data Services Pro&lt;/strong&gt;, &lt;strong&gt;Fiyat&lt;/strong&gt; değeri ise &lt;strong&gt;71.0000&lt;/strong&gt; dır. İkinci uygulamada aynı talepte bulunacaktır ve yine yukarıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan paket alışverişi s&amp;ouml;z konusudur. Bu durumda ikinci uygulama i&amp;ccedil;in s&amp;ouml;z konusu olan &lt;strong&gt;Response&lt;/strong&gt; &lt;strong&gt;Header&lt;/strong&gt; i&amp;ccedil;erisindeki &lt;strong&gt;ETag&lt;/strong&gt; değeride aynıdır. Gelelim 3nc&amp;uuml; paket alışverişine.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk263_9.gif" alt="" width="637" height="618" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Request&lt;/strong&gt; &lt;strong&gt;Header&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt; If-Match&lt;/strong&gt; isimli bir bilgi yer aldığı g&amp;ouml;r&amp;uuml;lmektedir. Bu bilgiye g&amp;ouml;re &lt;strong&gt;Ado.Net Data Services Pro&lt;/strong&gt; ve &lt;strong&gt;71.0000&lt;/strong&gt; değerlerinin doğrulanması istenmektedir. Şu durumda başka bir uygulama yada veritabanı &amp;uuml;zerinden doğrudan olacak şekilde, &lt;strong&gt;81&lt;/strong&gt; numaları kayıtta bir değişiklik olmadığından &lt;strong&gt;Response&lt;/strong&gt; &lt;strong&gt;Headers&lt;/strong&gt; i&amp;ccedil;erisinde s&amp;ouml;z konusu verinin g&amp;uuml;ncellenen değerlerine ait bilgiler istemci tarafına g&amp;ouml;nderilmektedir. Bir başka deyişle şimdi &lt;strong&gt;ETag&lt;/strong&gt; değerinin i&amp;ccedil;eriği &lt;strong&gt;Ado.Net Data Services Pro&lt;/strong&gt; ve &lt;strong&gt;76.0000&lt;/strong&gt; dır. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Fiyat&lt;/strong&gt; değişmiştir. Ancak arkada unutmamamız gereken ikinci uygulamamız vardır. Bu uygulmada tuşa basıp devam edildiğinde, &lt;strong&gt; Fiddler&lt;/strong&gt; &amp;uuml;zerinden 4nc&amp;uuml; paket alışverişi aşağıdaki gibi yakalanmaktadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk263_10.gif" alt="" width="639" height="638" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu kez &lt;strong&gt;Request&lt;/strong&gt; &lt;strong&gt;Header&lt;/strong&gt; i&amp;ccedil;erisindeki &lt;strong&gt;ETag&lt;/strong&gt; değeri &lt;strong&gt;71.0000&lt;/strong&gt; değeri i&amp;ccedil;in talepte bulunur. Ancak az &amp;ouml;nceki uygulamada &lt;strong&gt;ETag&lt;/strong&gt; değerinde yer alan &lt;strong&gt; Fiyat&lt;/strong&gt; &lt;strong&gt;76.0000&lt;/strong&gt; olarak değişmiştir. Dolayısıyla &lt;strong&gt;If-Match&lt;/strong&gt; karşılaştırması başarılı olmayacaktır. Bunun sonucu olarakta geriye &lt;strong&gt; HTTP/1.1 412&lt;/strong&gt; kodu &lt;strong&gt;(Precondition Failed)&lt;/strong&gt; d&amp;ouml;ner.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;HTTP 1.1 durum kodları(Status Codes) ve a&amp;ccedil;ıklamaları i&amp;ccedil;in WC3 &amp;uuml;zerinden yayınlanan&lt;a href="http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.4.13"&gt;adresinden&lt;/a&gt; bilgi alabilirsiniz.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ccedil;ok doğal olarak bu hata i&amp;ccedil;in istemci tarafına bir &lt;strong&gt;exception&lt;/strong&gt; bilgisi g&amp;ouml;nderilmiştir. Bu arada &lt;strong&gt;SQL&lt;/strong&gt; tarafında neler olduğunuda bilmekte yarar vardır. Aynı s&amp;uuml;re&amp;ccedil; &lt;strong&gt;SQL&lt;/strong&gt; &lt;strong&gt;Server&lt;/strong&gt; &lt;strong&gt;Profiler&lt;/strong&gt; &amp;uuml;zerinden incelendiğinde ilk uygulamanın g&amp;uuml;ncelleştirme işleminden hemen &amp;ouml;nce &lt;strong&gt;81&lt;/strong&gt; numaları &lt;strong&gt;KitapID&lt;/strong&gt; i&amp;ccedil;in bir &lt;strong&gt;Select&lt;/strong&gt; sorgusu &amp;ccedil;alıştırıldığı sonrasında ise aşağıdaki &lt;strong&gt;SQL&lt;/strong&gt; ifadesinin devreye girdiği g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;exec sp_executesql N'update [dbo].[Kitap]
set [Ad] = @0, [Fiyat] = @1, [StokMiktari] = @2, [KategoriId] = @3
where ((([KitapId] = @4) and ([Ad] = @5)) and ([Fiyat] = @6))
',N'@0 nvarchar(25),@1 decimal(19,4),@2 int,@3 int,@4 int,@5 nvarchar(25),@6 decimal(19,4)',@0=N'Ado.Net Data Services Pro',@1=76.0000,@2=35,@3=1,@4=81,@5=N'Ado.Net Data Services Pro',@6=71.0000&lt;/pre&gt;
&lt;p&gt;Dikkat edelim! &lt;strong&gt;Where&lt;/strong&gt; ifadesinden sonra &lt;strong&gt;KitapID&lt;/strong&gt;, &lt;strong&gt;Ad&lt;/strong&gt; ve &lt;strong&gt;Fiyat&lt;/strong&gt; alanları hesaba katılmıştır. Bunun en b&amp;uuml;y&amp;uuml;k nedeni &lt;strong&gt;EDM&lt;/strong&gt; diagramında &lt;strong&gt;Concurrency&lt;/strong&gt; &lt;strong&gt;Mode&lt;/strong&gt; değeri &lt;strong&gt;Fixed&lt;/strong&gt; olarak belirlenen &amp;ouml;zelliklerdir. Dolayısıyla bu &lt;strong&gt;Where&lt;/strong&gt; kriteri bozulmadığından g&amp;uuml;ncelleştirme işlemi yapılmıştır. Oysaki ikinci uygulama tuşa basılarak devam ettirildiğinde, &lt;strong&gt;Update&lt;/strong&gt; sorgusunun &amp;ccedil;alıştırılmadığı onun yerine &lt;strong&gt; 81&lt;/strong&gt; nolu &lt;strong&gt;KitapID&lt;/strong&gt; i&amp;ccedil;in bir &lt;strong&gt;Select&lt;/strong&gt; sorgusunun işlediği g&amp;ouml;r&amp;uuml;l&amp;uuml;r. Akabindede zaten &lt;strong&gt;ETag&lt;/strong&gt; verilerindeki uyuşmazlık nedeni ile istemciye bir hata mesajı g&amp;ouml;nderilmektedir. Buraya kadar anlattıklarımızın &amp;ouml;zetini aşağıdaki tablo ile &amp;ouml;zetleyebiliriz.&lt;/p&gt;
&lt;table style="border-collapse: collapse; width: 100%;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt; &lt;span style="font-family: Verdana;"&gt;İşlem&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt; &lt;span style="font-family: Verdana;"&gt;A&amp;ccedil;ıklama (HTTP Trafiği ve SQL tarafı)&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td colspan="2" align="right"&gt;
&lt;p align="left"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Birinci Uygulama &amp;Ccedil;alışır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Kitap kitap81 = (from k in proxy.Kitap&lt;br /&gt; &amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; where k.KitapId==81&lt;br /&gt; &amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; select k).First&amp;lt;Kitap&amp;gt;();&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;HTTP Get Paketi G&amp;ouml;nderilir. &lt;br /&gt; Select sorgusu 81 no i&amp;ccedil;in &amp;ccedil;alışır.&lt;br /&gt; Response bilgisi HTTP 200 Ok.&lt;br /&gt; ETag bilgisi &lt;em&gt;&lt;strong&gt;"Ado.Net Data Services Pro, 71.0000"&lt;/strong&gt;&lt;/em&gt;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td colspan="2"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;İkinci Uygulama &amp;Ccedil;alışır.&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Kitap kitap81 = (from k in proxy.Kitap&lt;br /&gt; &amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; where k.KitapId==81&lt;br /&gt; &amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; select k).First&amp;lt;Kitap&amp;gt;();&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;HTTP Get Paketi G&amp;ouml;nderilir. &lt;br /&gt; Select sorgusu 81 no i&amp;ccedil;in &amp;ccedil;alışır.&lt;br /&gt; Response bilgisi HTTP 200 Ok.&lt;br /&gt; ETag bilgisi &lt;em&gt;&lt;strong&gt;"Ado.Net Data Services Pro, 71.0000"&lt;/strong&gt;&lt;/em&gt;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td colspan="2" align="right"&gt;
&lt;p align="left"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Birinci Uygulamada Fiyat bilgisi g&amp;uuml;ncellenir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Birinci Uygulamada SaveChanges metodu &amp;ccedil;alışır.&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;HTTP Merge paketi gider.&lt;br /&gt; If-Match bilgisi &lt;em&gt;&lt;strong&gt;"Ado.Net Data Services Pro, 71.0000"&lt;/strong&gt;&lt;/em&gt; dir. Karşılaştırma doğrudur.&lt;br /&gt; SQL tarafında Update sorgusu &amp;ccedil;alışır g&amp;uuml;ncelleme yapılır.&lt;br /&gt; Response i&amp;ccedil;in ETag değeri&amp;nbsp; &lt;em&gt;&lt;strong&gt;"Ado.Net Data Services Pro, 76.0000"&lt;/strong&gt;&lt;/em&gt; olur.&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td colspan="2"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;İkinci Uygulamada Fiyat bilgisi g&amp;uuml;ncellenir.&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;İkinci Uygulamada SaveChanges metodu &amp;ccedil;alışır.&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;HTTP Merge paketi gider.&lt;br /&gt; If-Match bilgisi &lt;em&gt;&lt;strong&gt;"Ado.Net Data Services Pro, 71.0000"&lt;/strong&gt;&lt;/em&gt; dir. &lt;br /&gt; SQL tarafında 81 i&amp;ccedil;in veriler istenir.&lt;br /&gt; If-Match bilgisindeki Fiyat verisi i&amp;ccedil;in uyuşmazlık vardır.&lt;br /&gt; &lt;em&gt;&lt;strong&gt;HTTP/1.1 412 (Precondition Failed) &lt;/strong&gt;&lt;/em&gt;g&amp;ouml;nderilir.&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Tabi işin bir de diğer şeklini ele almak gerekir. Yani &lt;strong&gt;Fixed&lt;/strong&gt; değerlerini kullanmadığımız durum. Burada sadece &lt;strong&gt;servis&lt;/strong&gt; &lt;strong&gt;tarafındaki&lt;/strong&gt; &lt;strong&gt;EDM&lt;/strong&gt; diagramında değişiklik yapmak yeterli olacaktır. Bir başka deyişle istemci tarafında, &lt;strong&gt;Concurrency&lt;/strong&gt; modelinin değiştirildiğine dair bir servis g&amp;uuml;ncellemesi yapılmasına gerek yoktur. Tabi b&amp;ouml;yle bir durumda her iki uygulamanın g&amp;uuml;ncelleme işlemleride ge&amp;ccedil;erli olacaktır ve buna g&amp;ouml;rede en son yazanın verisi tabloya yansıtılacaktır. Aynı &amp;ouml;rneği buna g&amp;ouml;re test ettiğimizde &lt;strong&gt;SQL&lt;/strong&gt; tarafına giden &lt;strong&gt;Update&lt;/strong&gt; sorgularının aşağıdakine benzer olduğu g&amp;ouml;r&amp;uuml;lmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;exec sp_executesql N'update [dbo].[Kitap]
set [Ad] = @0, [Fiyat] = @1, [StokMiktari] = @2, [KategoriId] = @3
where ([KitapId] = @4)
',N'@0 nvarchar(25),@1 decimal(19,4),@2 int,@3 int,@4 int',@0=N'Ado.Net Data Services Pro',@1=88.0000,@2=35,@3=1,@4=81&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere sadece &lt;strong&gt;Primary&lt;/strong&gt; &lt;strong&gt;Key&lt;/strong&gt; alanı hesaba katılmıştır. Yine &lt;strong&gt;Fiddler&lt;/strong&gt; aracı ile istemci ve servis arasındaki &lt;strong&gt;HTTP&lt;/strong&gt; trafiği incelendiğinde &lt;strong&gt; If-Match &lt;/strong&gt;yada &lt;strong&gt;ETag&lt;/strong&gt; gibi bilgilerin &lt;strong&gt;Request&lt;/strong&gt; veya &lt;strong&gt; Response&lt;/strong&gt; &lt;strong&gt;Header&lt;/strong&gt;' ları i&amp;ccedil;erisinde yer almadığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere senaryonun gerektirdiklerine g&amp;ouml;re servis tarafında Optimistic Concurrency modeli tercih edilebilir veya edilmez. Eğer bu model tercih edilirse istemci tarafındaki uygulamalarda mutlaka Exception kontrol&amp;uuml;n&amp;uuml;n yapılması gerekmektedir. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Bir sonraki yazımızda g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;a href="/makale/images/Concurrency.rar"&gt;&amp;Ouml;rneği indirmek i&amp;ccedil;in tıklayın&lt;/a&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;</content>
  <pubDate>2008-10-30 10:00:00</pubDate>
  <slug>Ado-Net-Data-Services-Ders-Notlarc4b1-6-(Optimistic-Concurrency)-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet-data-services</tag>
    <tag>wcf-data-services</tag>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
  </tags>
  <categories>
    <category>Ado.Net Data Services</category>
  </categories>
</post>