<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>SortedList ve Hashtable İçin 2 Basit Öneri</title>
  <description>SortedList ve Hashtable koleksiyonları, anahtar-değer (key-value) çiftlerini esas alır. Hashtable koleksiyonu özellikle sahip olduğu elemanlar ile ilgili işlemlerde kullandığı hash algoritmalı teknik sayesinde en hızlı çalışan koleksiyon olma özelliğinide gösterir. Diğer yandan SortedList anahtar-değer çiftlerinin, anahtar değerine göre her zaman sıralandığı bir koleksiyon tipidir.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;SortedList ve Hashtable koleksiyonları, anahtar-değer (key-value) &amp;ccedil;iftlerini esas alır. Hashtable koleksiyonu &amp;ouml;zellikle sahip olduğu elemanlar ile ilgili işlemlerde kullandığı hash algoritmalı teknik sayesinde en hızlı &amp;ccedil;alışan koleksiyon olma &amp;ouml;zelliğinide g&amp;ouml;sterir. Diğer yandan SortedList anahtar-değer &amp;ccedil;iftlerinin, anahtar değerine g&amp;ouml;re her zaman sıralandığı bir koleksiyon tipidir.&lt;/p&gt;
&lt;p&gt;Yani SortedList koleksiyonuna eklediğimiz elemanların sırasına bakılmaksızın, yeniden yapılan bir sıralama s&amp;ouml;z konusudur. Bu avantajlı bir durum olsa bile, &amp;ouml;zellikle SortedList' in &amp;ccedil;ok daha yavaş &amp;ccedil;alışan bir koleksiyon olmasına neden olmaktadır. Her iki koleksiyon hakkında s&amp;ouml;ylenebilecek pek &amp;ccedil;ok konu vardır. Biz bu makalemizde &amp;ouml;zellikle dikkat etmemiz gereken 2 teori &amp;uuml;zerinde duracağız. İlk teorimiz ile işe başlayalım.&lt;/p&gt;
&lt;table id="table6" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Bir SortedList oluştururken &lt;strong&gt;doğrudan eleman eklemek yerine&lt;/strong&gt;, elemanları &amp;ouml;nce bir Hashtable koleksiyonuna ekleyip, &lt;strong&gt;SortedList' i &lt;/strong&gt;bu &lt;strong&gt; Hashtable &amp;uuml;zerinden oluşturmak&lt;/strong&gt; daha hızlıdır.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Kulağa biraz galip geliyor değil mi? Bir SortedList koleksiyonunu anahtar-değer &amp;ccedil;iftleri ile doldururken doğrudan SortedList' i kullanmak yerine bir Hashtable' ın kullanılması... Her ne kadar ilgin&amp;ccedil; gibi g&amp;ouml;r&amp;uuml;nsede aşağıdaki basit &amp;ouml;rnek ile bu durumu analiz edebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections;
using System.Collections.Generic;
using System.Text;
using System.Data;
using System.Data.SqlClient;

namespace UsingSortedList
{
    class Tester
    {
        private SortedList sl;
        private SqlConnection con;
        private SqlCommand cmd;
        private SqlDataReader dr;

        private void Hazirla()
        {
            con = new SqlConnection("data source=BURAKS;database=AdventureWorks;integrated security=SSPI");
            cmd = new SqlCommand("SELECT NationalIDNumber,Title From HumanResources.Employee", con);
        }

        public void Olustur()
        {
            sl = new SortedList();
            con.Open();
            dr = cmd.ExecuteReader(CommandBehavior.CloseConnection);
            while (dr.Read())
            {
                sl[dr["NationalIDNumber"]] = dr["Title"];
            }
            dr.Close();
        }

        public void OlusturHt()
        {
            Hashtable ht = new Hashtable();
            con.Open();
            dr = cmd.ExecuteReader(CommandBehavior.CloseConnection);
            while (dr.Read())
            {
                ht[dr["NationalIDNumber"]] = dr["Title"];
            }
            sl = new SortedList(ht);
            dr.Close();
        }

        public Tester()
        {
            Hazirla();
        }
    }
    
    class Program
    {
        static void Main(string[] args)
        {
            Tester tester = new Tester();
            DateTime dtBaslangic,dtBitis;
            TimeSpan ts;

            #region SortedList ile
                
            dtBaslangic = DateTime.Now;
            tester.Olustur();
            dtBitis = DateTime.Now;
            ts = dtBitis - dtBaslangic;
            Console.WriteLine(ts.TotalMilliseconds);

            #endregion

            #region Hashtable ile

            dtBaslangic = DateTime.Now;
            tester.OlusturHt();
            dtBitis = DateTime.Now;
            ts = dtBitis - dtBaslangic;
            Console.WriteLine(ts.TotalMilliseconds);
        
            #endregion
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rneğimizde test işlemlerimiz i&amp;ccedil;in Tester isimli bir sınıf kullanıyoruz. Diğer teorimiz i&amp;ccedil;in de bu sınıfı kullanacağız. Sınıfımızda Sql Server 2005 &amp;uuml;zerinde yer alan AdventureWorks isimli veritabanını kullanacağız. Burada Employee isimli tabloyu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alacağız. Amacımız bir Employee' un NationalIDNumber alanlarını anahtar olarak, Title alanlarını ise değer olarak SortedList koleksiyonumuza eklemek. Tablonun select edilen i&amp;ccedil;eriğine bakacak olursak NationalIDNumber alanlarının d&amp;uuml;zensiz(unsorted) sırada olduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk132_1.gif" alt="" width="639" height="440" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Elbetteki burada&lt;strong&gt; basit bir Order By ile&lt;/strong&gt; NationalIDNumber alanına g&amp;ouml;re sıralama yaptırabiliriz. Ancak SortedList ile ilgili teorimize bakmak i&amp;ccedil;in bize sırasız(unsorted) ve benzersiz(unique) anahtar(key) değerleri gerekiyor. Hazır elimizde var iken kullanmakta fayda var. İlk metodumuz ( Olustur() metodu) anahtar-değer &amp;ccedil;iftlerini SortedList' e doğrudan ekliyor. İkinci metodumuz (Olusturht() metodu) ise anahtar-değer &amp;ccedil;iftlerini &amp;ouml;nce bir Hashtable koleksiyonuna ekliyor ve daha sonra SortedList koleksiyonunu aşağıdaki yapıcı metod prototipi ile oluşturuyor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public SortedList(IDictionary d);&lt;/pre&gt;
&lt;p&gt;Hashtable koleksiyonu IDictionary aray&amp;uuml;z&amp;uuml;n&amp;uuml; implemente ettiği i&amp;ccedil;in, SortedList' imizi bu şekilde oluşturabilmemiz son derece doğaldır. Uygulamayı &amp;ccedil;alıştırdığımızda aşağıdakine benzer bir sonu&amp;ccedil; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk132_2.gif" alt="" width="364" height="95" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında sonu&amp;ccedil;lar milisaniye cinsinden olduğu i&amp;ccedil;in &amp;ccedil;ok &amp;ouml;nemsiz g&amp;ouml;r&amp;uuml;nebilir. Kaldı ki uygulamanın kısa s&amp;uuml;reli sonraki &amp;ccedil;alıştırılışlarında veritabanı kaynaklarının yeniden kullanımınında etkisiyle bu s&amp;uuml;re dahada aşağılara inecektir. Ancak ger&amp;ccedil;ek hayat problemlerinde &amp;ccedil;ok daha fazla satıra sahip (&amp;ccedil;oğunlukla buradaki gibi 290 satırlık bir veri seti değil) tablolarda benzer işlemleri kullanabiliriz. Sonu&amp;ccedil; itibariyle teorik olarak bir SortedList koleksiyonunu oluştururken bir Hashtable koleksiyonundan yararlanmak performansı olumlu y&amp;ouml;nde etkilemektedir. Gelelim ikinci dikkate değer teoriye. &lt;/p&gt;
&lt;table id="table9" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;İster SortedList ister Hashtable olsun, anahtar-değer &amp;ccedil;iftine sahip koleksiyonların elemanları arasında ileri y&amp;ouml;nl&amp;uuml; iterasyon kullanırken &lt;strong&gt; DictionaryEntry nesneleri &amp;uuml;zerinden hareket etmek&lt;/strong&gt;, anahtarlar &amp;uuml;zerinden hareket etmekten &lt;strong&gt;daha hızlıdır.&lt;/strong&gt;&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Dictionary bazlı bir koleksiyonda (&amp;ccedil;oğunlukla Hashtable ve SortedList) foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml; kullanarak yaptığımız iterasyonlarda genellike kullandığımız iki desen vardır. Bu desenlerden birisinde &lt;strong&gt;Keys&lt;/strong&gt; &amp;ouml;zelliği kullanılır. Keys &amp;ouml;zelliği ile koleksiyon i&amp;ccedil;erisindeki her bir anahtar &amp;uuml;zerinde ileri y&amp;ouml;nl&amp;uuml; hareket sağlanır. Bir anahtara karşılık gelen değeri koleksiyon i&amp;ccedil;erisinden almak i&amp;ccedil;in, g&amp;uuml;ncel anahtar koleksiyonun indeksleyicisine parametre olarak verilir.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;foreach (object anahtar in sl.Keys)
{    
}&lt;/pre&gt;
&lt;p&gt;Diğer y&amp;ouml;ntemde ise DictionaryEntry nesneleri kullanılmaktadır ve deseni aşağıdaki gibidir. DictionaryEntry nesneleri o anki anahtar-değer &amp;ccedil;iflerine erişebilmemizi sağlayan Key ve Value &amp;ouml;zelliklerine sahiptir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;foreach (DictionaryEntry dicEnt in sl)
{
}&lt;/pre&gt;
&lt;p&gt;Şimdi bu teoriyi &amp;ouml;rneğimizde uygulayarak oluşan s&amp;uuml;re farklarını değerlendirmeye &amp;ccedil;alışalım. Tester isimli sınıfımıza aşağıdaki iki metodu ekleyerek işe başlıyoruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void Dolas_1()
{
    OlusturHt();
    foreach (object anahtar in sl.Keys)
    {
        object deger = sl[anahtar];
    }
}

public void Dolas_2()
{
    OlusturHt();
    foreach (DictionaryEntry dicEnt in sl)
    {
        object deger = dicEnt.Value;
    }
}&lt;/pre&gt;
&lt;p&gt;Metodlarımızda SortedList koleksiyonunu kullandık. İlk metodumuzda değerlere erişmek i&amp;ccedil;in indeksleyici &amp;uuml;zerinden anahtarları kullanıyoruz. Yani foreach d&amp;ouml;ng&amp;uuml;m&amp;uuml;z koleksiyon i&amp;ccedil;indeki her bir anahtar i&amp;ccedil;in &amp;ouml;teleme yapıyor. İkinci d&amp;ouml;ng&amp;uuml;m&amp;uuml;z ise koleksiyon i&amp;ccedil;erisindeki her bir DictionaryEntry nesnesini ele alarak &amp;ouml;teleme yapıyor. Her iki tekniği kullanan kodlarımızı ise Main metodumuza aşağıdaki gibi ekleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;#region Key &amp;uuml;zerinden d&amp;ouml;ng&amp;uuml;

dtBaslangic = DateTime.Now;
tester.Dolas_1();
dtBitis = DateTime.Now;
ts = dtBitis - dtBaslangic;
Console.WriteLine(ts.TotalMilliseconds);

#endregion

#region DictionaryEntry &amp;uuml;zerinden d&amp;ouml;ng&amp;uuml;

dtBaslangic = DateTime.Now;
tester.Dolas_2();
dtBitis = DateTime.Now;
ts = dtBitis - dtBaslangic;
Console.WriteLine(ts.TotalMilliseconds);

#endregion&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdakine benzer bir sonu&amp;ccedil; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk132_3.gif" alt="" width="332" height="107" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu teori Hashtable koleksiyonları i&amp;ccedil;inde ge&amp;ccedil;erlidir. Her iki teoriyide incelediğimiz &amp;ouml;rneklerin doğurduğu sonu&amp;ccedil;lar kullandığınız sisteme nazaran g&amp;ouml;recelidir. Farklı sonu&amp;ccedil;ar oluşabilir. &amp;Ouml;zellikle milisaniye cinsinden değerler s&amp;ouml;z konusu olduğundan &amp;ccedil;alışma zamanında bu farklar &amp;ccedil;ok &amp;ouml;nemsizdir. Ancak yinede profesyonel stilde kod yazarken kullanabileceğimiz tekniklerdir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zetle SortedList koleksiyonunun kullanım amacı elemanlarının her zaman anahtarlarına g&amp;ouml;re sıralı tutuluyor oluşudur. Hashtable koleksiyonu ise elemanlarını i&amp;ccedil;eride hash algoritması ile oluşturduğu indekslere g&amp;ouml;re tutar ve bulur. Hash algoritmasının doğası gereği Hashtable koleksiyonları son derece hızlıdır. Her iki koleksiyonunda ortak noktası IDictionary aray&amp;uuml;zlerini uygulamış olmaları ve bu sebepten DictionaryEntry tipinden nesneleri taşımalarıdır. Bu y&amp;uuml;zden her iki koleksiyonda b&amp;uuml;nyesinde key-value &amp;ccedil;iftlerini barındırır. İşte bu ortak &amp;ouml;zelliklerden yola &amp;ccedil;ıkaraktan yukarıdaki iki teori ortaya atılmıştır. Biz de bu makalemizde bunları incelemeye &amp;ccedil;alıştık. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2005-08-06 12:00:00</pubDate>
  <slug>SortedList-ve-Hashtable-İçin-2-Basit-Öneri-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>sorted-list</tag>
    <tag>hashtable</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>