<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>TPL – Göz Göre Göre Başımızı Belaya Sokmak</title>
  <description>Ancak birden fazla iş parçasının da deadlock’ a düşmesi, bir başka deyişle birbirlerini beklemeleri nedeniyle, içinde çalıştıkları Thread’ i(çoğunlukla ana uygulama iş parçası-Main Thread) kitlemeleri söz konusudur. Durumu daha net anlayabilmek için aşağıdaki kod parçasını göz önüne alalım.</description>
  <content>&lt;p&gt;&lt;a href="/pics/blg209_Giris.jpg"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border: 0px;" title="blg209_Giris" src="/pics/blg209_Giris_thumb.jpg" alt="blg209_Giris" width="304" height="228" align="right" border="0" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bazen g&amp;ouml;z g&amp;ouml;re g&amp;ouml;re başımıza bi ton dert a&amp;ccedil;arız. Kimi zaman başlayacağımız iş bize &amp;ccedil;ok eğlenceli gelebilir &lt;em&gt;(Yandaki resimde y&amp;uuml;z&amp;uuml; g&amp;ouml;r&amp;uuml;nmeyen şahsın da bu heyacanla Hamburgere bindiğinden eminiz)&lt;/em&gt; Ama işin sonu&amp;ccedil;larını biliyorsak eğer, bunu yapmamızın nedeni b&amp;uuml;y&amp;uuml;k olasılıkla adrenalindir.&lt;/p&gt;
&lt;p&gt;Tabi ki bir yazılımcı i&amp;ccedil;in adrenalin genellikle &amp;uuml;st y&amp;ouml;neticisi tarafından salgılanan bir hormondur. Nitekim yazılımcıların, ilerideki felaketleri kestirerek hareket etmesi ve geliştirmeleri buna g&amp;ouml;re yapması her zaman kolay olmayabilir. Bir başka deyişle bazı vakalara hazırlıklı olmak i&amp;ccedil;in &amp;ouml;nceden bunları &amp;ccedil;alışmak gerekmektedir.&lt;/p&gt;
&lt;p&gt;İşte bu yazımızda biz de&lt;strong&gt; Task Parallel Library&lt;/strong&gt; i&amp;ccedil;in s&amp;ouml;z konusu olan ve geliştiricilerin başını derde sokacak 2 vaka &amp;uuml;zerinde duruyor olacağız. Haydi o zaman parmakları sıvayalım ve işe koyulalım.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Deadlock Durumu&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Bu kelime her zaman korkutucu olmuştur. Yazılım Geliştirme ser&amp;uuml;venime ilk başladığım yıllarda &amp;ccedil;oğunlukla veritabanı tarafındaki kilitlenmelerden s&amp;ouml;z edildiğini &amp;ccedil;ok net hatırlıyorum. Ancak birden fazla iş par&amp;ccedil;asının da &lt;strong&gt;deadlock&amp;rsquo;&lt;/strong&gt; a d&amp;uuml;şmesi, bir başka deyişle birbirlerini beklemeleri nedeniyle, i&amp;ccedil;inde &amp;ccedil;alıştıkları &lt;strong&gt;Thread&lt;/strong&gt;&amp;rsquo; i&lt;em&gt;(&amp;ccedil;oğunlukla ana uygulama iş par&amp;ccedil;ası-&lt;strong&gt;Main Thread&lt;/strong&gt;) &lt;/em&gt;kitlemeleri s&amp;ouml;z konusudur. Durumu daha net anlayabilmek i&amp;ccedil;in aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Threading.Tasks;

namespace Disasters 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            Task&amp;lt;double&amp;gt; task1 = null; 
            Task&amp;lt;int[]&amp;gt; task2 = null;

            task2 = Task.Factory.StartNew&amp;lt;int[]&amp;gt;(() =&amp;gt; 
            { 
               double task1Result=task1.Result; 
                Random rnd = new Random(); 
                int[] numbers = new int[5]; 
                for (int i = 0; i &amp;lt; 5; i++) 
                { 
                    numbers[i] = rnd.Next(1, 250); 
                } 
                return numbers; 
            } 
            );

            task1 = Task.Factory.StartNew&amp;lt;double&amp;gt;(()=&amp;gt; 
            { 
                double totalValue = 0; 
                foreach (int number in task2.Result) 
                { 
                    totalValue += number; 
                } 
                return totalValue; 
            } 
            );

            Task.WaitAll(task1, task2);

            Console.WriteLine("İşlemlerin sonu.Programdan &amp;ccedil;ıkmak i&amp;ccedil;in bir tuşa basınız"); 
            Console.ReadLine();   
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Aslında kod &amp;ccedil;ok fazla değerlendirilebilir veya anlamlı değildir. Ancak &lt;strong&gt;Deadlock&lt;/strong&gt; oluşumunu g&amp;ouml;rmemiz a&amp;ccedil;ısından yeterlidir. &amp;Ouml;rnekte &lt;strong&gt;task1&lt;/strong&gt; ve &lt;strong&gt;task2&lt;/strong&gt; isimli &lt;strong&gt;Task&lt;/strong&gt; nesne &amp;ouml;rneklerinin, birbirlerinin d&amp;ouml;n&amp;uuml;ş değerlerini kullanmaya &amp;ccedil;alıştığı ifade edilmektedir. İşte &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneklerinin &amp;ccedil;alışma zamanında birbirlerini beklemeleri, kendi durumlarının &lt;strong&gt;Deadlock&lt;/strong&gt; olarak set edilmesine neden olacaktır. Bu durum &lt;strong&gt;Debug&lt;/strong&gt; modda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg209_Debug1.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg209_Debug1" src="/pics/blg209_Debug1_thumb.gif" alt="blg209_Debug1" width="644" height="105" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere her iki &lt;strong&gt;Task&lt;/strong&gt; birbirini bekler şekilde kalmıştır. &amp;Ccedil;ok doğal olarak &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı kapkara bir ekran olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg209_FirstRuntime.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg209_FirstRuntime" src="/pics/blg209_FirstRuntime_thumb.gif" alt="blg209_FirstRuntime" width="533" height="170" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Gelelim diğer bir senaryoya.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;D&amp;ouml;ng&amp;uuml; Değişkenlerine Dikkat&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Bu aslında olduk&amp;ccedil;a eğlenceli ve bir o kadarda beklenmedik sonu&amp;ccedil;ları &amp;uuml;reten vakalardandır. Olayı hızlı bir şekilde değerlendirmek adına aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Threading.Tasks;

namespace Disasters 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            for (int i = 0; i &amp;lt; 10; i++) 
            { 
                Task.Factory.StartNew(() =&amp;gt; 
                    { 
                        for (int j = 0; j &amp;lt; 125000000; j++) 
                        { 
                            j++; 
                            j--; 
                            j*=j; 
                        } 
                        Console.WriteLine("G&amp;uuml;ncel Task Id : {0}\tG&amp;uuml;ncel i : {1}",Task.CurrentId,i.ToString()); 
                    } 
                ); 
            }

            Console.WriteLine("Kapatmak i&amp;ccedil;in bir tuşa basınız"); 
            Console.ReadLine(); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnek kod ile &amp;ccedil;alışma zamanında &lt;strong&gt;10&lt;/strong&gt; &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneği başlatılmakta ve bunların &lt;strong&gt;lambda&lt;/strong&gt; &lt;strong&gt;ifadeleri(=&amp;gt; Expressions)&lt;/strong&gt; i&amp;ccedil;erisinden o anki&lt;strong&gt; i&lt;/strong&gt; değerleri ekrana yazdırılmaktadır. Normal şartlarda&lt;strong&gt; i&lt;/strong&gt; değerlerinin her bir &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneği i&amp;ccedil;in farklı olması beklenir. Ancak &amp;ccedil;alışma zamanına baktığımızda aşağıdaki enteresan sonu&amp;ccedil;lar ile karşılaştığımızı g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg209_Runtime2.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg209_Runtime2" src="/pics/blg209_Runtime2_thumb.gif" alt="blg209_Runtime2" width="286" height="147" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere b&amp;uuml;t&amp;uuml;n &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rnekleri &lt;strong&gt;for&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; sayacının son değerini ekrana yazdırmaktadır. &amp;Ccedil;ok kolay bir şekilde g&amp;ouml;zden ka&amp;ccedil;abilecek bu vaka nedeniyle uzun s&amp;uuml;re ekrana baka kalabilir ve arkadaşlarımızın bize &amp;ldquo;Kal Gelmiş&amp;rdquo; demelerine neden olabiliriz. Oysa ki &amp;ccedil;&amp;ouml;z&amp;uuml;m son derece basittir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Threading.Tasks;

namespace Disasters 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            for (int i = 0; i &amp;lt; 10; i++) 
            { 
                Task.Factory.StartNew((s) =&amp;gt; 
                { 
                    for (int j = 0; j &amp;lt; 125000000; j++) 
                    { 
                        j++; 
                        j--; 
                        j *= j; 
                    } 
                    int currentI = (int)s;

                    Console.WriteLine("G&amp;uuml;ncel Task Id : {0}\tG&amp;uuml;ncel i : {1}", Task.CurrentId, currentI.ToString()); 
                },i 
                ); 
            }

            Console.WriteLine("Kapatmak i&amp;ccedil;in bir tuşa basınız"); 
            Console.ReadLine(); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Bu sefer &lt;strong&gt;StartNew&lt;/strong&gt; metodunun farklı bir versiyonu kullanılmıştır. Dikkat edileceği &amp;uuml;zere metodun ikinci parametresi olarak&lt;strong&gt; i&lt;/strong&gt; değişkeni kullanılmıştır. Bu aslında &lt;strong&gt;State Object &lt;/strong&gt;olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Dolayısıyla başlatılan her &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneğine parametre olarak o anki d&amp;ouml;ng&amp;uuml; değeri&lt;em&gt;(i değişkeninin değeri)&lt;/em&gt; ge&amp;ccedil;irilmektedir. &lt;strong&gt;s&lt;/strong&gt; isimli değişken, &lt;strong&gt;for&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml;nden gelen&lt;strong&gt; i&lt;/strong&gt; değişkenini &lt;strong&gt;object&lt;/strong&gt; tipinden temsil ettiği i&amp;ccedil;in de, basit bir &lt;strong&gt;Cast&lt;/strong&gt; işlemi yapılması yeterlidir. İşte &amp;ccedil;alışma zamanı sonu&amp;ccedil;ları.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg209_Runtime3.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg209_Runtime3" src="/pics/blg209_Runtime3_thumb.gif" alt="blg209_Runtime3" width="283" height="152" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Task &amp;ouml;rnekleri kendilerine atanan i değerlerini ekrana basmıştır.&lt;/p&gt;
&lt;p&gt;Elbette farklı vakalar ve felaket senaryoları da s&amp;ouml;z konusudur. Bu gibi durumları ilerleyen yazılarımızda ele almaya &amp;ccedil;alışıyor olacağız. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f6%2fDisasters.rar"&gt;Disasters.rar (22,06 kb)&lt;/a&gt;&lt;strong&gt;&amp;nbsp;[&amp;Ouml;rnek Visual Studio 2010 Ultimate S&amp;uuml;r&amp;uuml;m&amp;uuml;nde Geliştirilmiş ve Test Edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-06-21 06:08:00</pubDate>
  <slug>TPL-Deadlock-Local-For-Variable-Evaluations</slug>
  <tags>
    <tag>task-parallel-library</tag>
    <tag>parallel-programming</tag>
    <tag>c#-40</tag>
    <tag>net-framework-40</tag>
    <tag>visual-studio-2010-ultimate</tag>
    <tag>deadlock</tag>
    <tag>local-variable-evaluation</tag>
    <tag>excessive-spinning</tag>
  </tags>
  <categories>
    <category>Parallel Programming</category>
    <category>TPL</category>
  </categories>
</post>