<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Web Server Control Yazmak - 3</title>
  <description>Bir önceki makalemizde kendi web kontrollerimizi geliştirirken durum yönetimi(state management) için ViewState' lerden nasıl faydalanabileceğimizi incelemiştik. Bununla birlikte assembly, sınıf ve metod seviyesinde, çalışma zamanı için gerekli davranışları çeşitli nitelikler (attribute) yardımıyla nasıl etkileyebileceğimizi görmüştük. Bugünkü makalemizde ise, kendi web kontrollerimiz için olay güdümlü (event based) programlamayı nasıl sağlayabileceğimizi incelemeye çalışacağız.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki makalemizde kendi web kontrollerimizi geliştirirken durum y&amp;ouml;netimi(state management) i&amp;ccedil;in ViewState' lerden nasıl faydalanabileceğimizi incelemiştik. Bununla birlikte assembly, sınıf ve metod seviyesinde, &amp;ccedil;alışma zamanı i&amp;ccedil;in gerekli davranışları &amp;ccedil;eşitli nitelikler (attribute) yardımıyla nasıl etkileyebileceğimizi g&amp;ouml;rm&amp;uuml;şt&amp;uuml;k. Bug&amp;uuml;nk&amp;uuml; makalemizde ise, kendi web kontrollerimiz i&amp;ccedil;in olay g&amp;uuml;d&amp;uuml;ml&amp;uuml; (event based) programlamayı nasıl sağlayabileceğimizi incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;Var olan web kontrollerinin pek &amp;ccedil;ok olayı vardır. İstersek kendi geliştirdiğimiz web sunucu kontrolleri i&amp;ccedil;inde olay tanımlayabilir ve kullanabiliriz. Ne varki web kontrolleri seviyesinde dikkate alınması gereken bazı noktalar vardır. Bu noktaları yazımızın ilerleyen kısımlarında keşfedeceğiz. &amp;Ouml;ncelikli olarak olay tabanlı programlama i&amp;ccedil;in gereken unsurları biraz hatırlamaya &amp;ccedil;alışalım. Herşeyden &amp;ouml;nce olayların(events), temsilciler(delegates) ile yakın ilişkisi vardır. Olay g&amp;uuml;d&amp;uuml;ml&amp;uuml; programlama tarafında temsilcilerin g&amp;ouml;revi, meydana gelen olay sonrasında &amp;ccedil;alıştırılacak olan olay metodunu işaret etmektir. Var olan Windows ve Web kontrollerinin sahip oldukları olaylar, yine Framework i&amp;ccedil;erisinde yer alan değişik temsilciler ile ilişkilendirilmiştir. &amp;Ouml;rneğin bir Button bileşenine ait click olayı, EventHandler temsilcisi ile ilişkilendirilmiştir. Temsilciler &amp;ccedil;alışma zamanında işaret edecekleri metodların yapılarınıda s&amp;ouml;ylemektedirler. Bir başka deyişle işaret edilecek metodun parametrik yapısı ve geri d&amp;ouml;n&amp;uuml;ş tipinide belirtirler. &amp;Ouml;zellikle g&amp;ouml;rsel bileşenlere bakıldığında, olay metodlarının &amp;ccedil;oğunlukla iki parametre aldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bu parametrelerden ilki, olayı meydana getiren nesne referansını taşıyabilecek object tipindendir. İkinci parametre ise, olay meydana geldiğinde, olay metodu i&amp;ccedil;erisine bilgi taşımak amacıyla kullanılabilecek t&amp;uuml;rden bir tip olabilir.&lt;/p&gt;
&lt;p&gt;Bu kriterler g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında, kendi web kontrollerimizi geliştirirken Framework i&amp;ccedil;erisinde var olan temsilcilerden faydalanabiliriz. Ancak &amp;ouml;zellikle olay metodunun ikinci parametresinin, olay metodu i&amp;ccedil;erisine bizim istediğimiz tarzda bilgiler taşımasını istiyorsak, kendi temsilcilerimizi yazmayı tercih edebiliriz. Biz makalemizde kendi temsilci tipimizi kullanacağız. &amp;Ouml;rneğin TarihKontrolum isimli bileşenimiz i&amp;ccedil;in TarihDogrula isimli bir olay d&amp;uuml;ş&amp;uuml;nebiliriz. Bu olay meydana geldiği zaman &amp;ccedil;alışacak olan olay metodu ikinci parametre olarak, kontrol i&amp;ccedil;erisindeki verilerin değerlerini alabilir ve i&amp;ccedil;eride işleyebilir. Bu senaryo g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında, &amp;ouml;ncellikli olarak olay metoduna gelecek bilgileri taşıyacak bir parametre sınıfı yazmamız muhakkaktır. Bu sınıfı aşağıdaki gibi geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk190_1.gif" alt="" width="354" height="243" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class TarihKontrolumEventDatas
{
    #region Fields

    private string seciliGun;
    private string seciliAy;
    private string seciliYil;

    #endregion

    #region Properties

    public string SeciliYil
    {
        get { return seciliYil; }
    }

    public string SeciliAy
    {
        get { return seciliAy; }
    }

    public string SeciliGun
    {
        get { return seciliGun; }
    }

    #endregion

    #region Constructors

    public TarihKontrolumEventDatas(string sg, string sa, string sy)
    {
        seciliGun = sg;
        seciliAy = sa;
        seciliYil = sy;
    }

    #endregion
}&lt;/pre&gt;
&lt;p&gt;TarihKontrolumEventDatas isimli sınıfın temel g&amp;ouml;revi, olay metodu i&amp;ccedil;erisine, kontrol&amp;uuml;n i&amp;ccedil;erisindeki g&amp;uuml;n, ay ve yıl değerlerini taşımaktır. Buna g&amp;ouml;re temsilcimizide (delegate) aşağıdaki gibi tanımlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk190_2.gif" alt="" width="231" height="103" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public delegate void TarihDogrulaEventHandler(object sender,TarihKontrolumEventDatas eData);&lt;/pre&gt;
&lt;p&gt;Temsilcimiz object ve TarihKontroumEventDatas tipinden parametreler alan ve geriye değer d&amp;ouml;nd&amp;uuml;rmeyen metodları işaret edebilecek şekilde tasarlanmıştır. Bu tipik olarak varsayılan olay temsilcisi desenidir. Artık kontrol&amp;uuml;m&amp;uuml;z i&amp;ccedil;in gerekli olan olayı (event) tanımlayabilir ve bu olayı tetikletecek &amp;uuml;ye metodu ekleyebiliriz. Bu ama&amp;ccedil;la TarihKontrolumWithEvent isimli yeni kontrol&amp;uuml;m&amp;uuml;ze aşağıdaki eklemeleri yapmamız gerekmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[Description("Tarih bilgisi değiştirildiğinde doğrulamak i&amp;ccedil;in tetiklenen sunucu taraflı olaydır")]
public event TarihDogrulaEventHandler TarihDogrula;

public void OnTarihDogrula(TarihKontrolumEventDatas eData)
{
    if (TarihDogrula != null)
        TarihDogrula(this, eData);
}&lt;/pre&gt;
&lt;p&gt;OnTarihDogrula isimli metodun tek g&amp;ouml;revi, kontrole y&amp;uuml;klenmiş TarihDogrula isimli bir olay var ise bu olayı &amp;ccedil;ağırmaktır. Bu &amp;ccedil;ağrıda &amp;ccedil;ok doğal olarak, olay ile ilişkilendirilmiş metodun &amp;ccedil;ağırılması anlamına gelmektedir. Bu değişikliklerden sonra kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; herhangibir Asp.Net sayfasına s&amp;uuml;r&amp;uuml;kleyip bıraktığımızda, events kısmında yeni eklediğimiz olayı g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk190_3.gif" alt="" width="258" height="191" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Her ne kadar kontrol&amp;uuml;m&amp;uuml;ze bir olay eklemiş olsakta, bu olayın ger&amp;ccedil;ekleştirilmesi i&amp;ccedil;in sayfanın istemciden sunucuya tekrardan g&amp;ouml;nderilmesi gerekecektir. Bu işi kontrol&amp;uuml;m&amp;uuml;z &amp;uuml;zerinde ger&amp;ccedil;ekleştirmek istediğimizi d&amp;uuml;ş&amp;uuml;necek olursak bize submit eyleminde bulunacak bir input Html kontrol&amp;uuml; gerekmektedir. Bu sebepten yeni kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n Render metodu i&amp;ccedil;erisine aşağıdaki Html i&amp;ccedil;eriğini dahil etmemiz uygun olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected override void Render(HtmlTextWriter writer)
{ 
    // Diğer kod satırları
    writer.Write("&amp;lt;input type='submit' value='...' name='sbmButton'/&amp;gt;");
    base.Render(writer);
}&lt;/pre&gt;
&lt;p&gt;Artık web sayfamızda yer alan kontrol&amp;uuml;m&amp;uuml;z i&amp;ccedil;in TarihKontrol olayını aşağıdaki gibi y&amp;uuml;kleyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk190_4.gif" alt="" width="535" height="140" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void TarihKontrolumWithEvent1_TarihDogrula(object sender, BenimWebKontrollerim.TarihKontrolumEventDatas eData)
{
    Response.Write(eData.SeciliGun + " " + eData.SeciliAy + " " + eData.SeciliYil);
}&lt;/pre&gt;
&lt;p&gt;Şimdi bu olay metodu i&amp;ccedil;erisine bir breakpoint koyalım ve web uygulamamızı debug mode &amp;uuml;zerinden &amp;ccedil;alıştıralım. Kontrol&amp;uuml;m&amp;uuml;z i&amp;ccedil;erisinde yer alan submit d&amp;uuml;ğmesine bassakta, olay metodumuz i&amp;ccedil;erisine giremediğimizi g&amp;ouml;receğiz. Dolayısıyla yazdığımız olay metodu hi&amp;ccedil; bir şekilde işlememiştir. Bunun iki &amp;ouml;nemli nedeni vardır. Bunlardan birincisi, kontrol&amp;uuml;m&amp;uuml;z i&amp;ccedil;erisinde postback işlemini ger&amp;ccedil;ekleştiren d&amp;uuml;ğmenin adının kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n benzersiz adı (unique Id) ile aynı olmamasıdır.&lt;/p&gt;
&lt;p&gt;İkinci sebep ise, istemciden postback ile gelecek olan form verileri i&amp;ccedil;erisinden ay, g&amp;uuml;n ve yil alanlarının istemci tarafından değiştirilen değerlerini elde etmek ve eğer bir değişiklik varsa ilgili olay metodunu fırlatmak i&amp;ccedil;in gerekli hamleyi yapmayışımızdır. Bahsetmiş olduğumuz ikinci hamle i&amp;ccedil;in, kontrol&amp;uuml;m&amp;uuml;ze &lt;strong&gt;IPostBackDataHandler&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n uyarlanması (implementation) d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Kendi yazdığımız web kontrollerinde event, bu event ile ilişkili bir delegate, event metodu i&amp;ccedil;erisine bilgi taşıyacak bir tip tanımlamak event based bir kontrol i&amp;ccedil;in yeterli değildir. Kontroldeki bir aksiyon sonucu, istemcideki sayfayı sunucuya g&amp;ouml;nderecek olan bileşenin adının kontrol&amp;uuml;n adı ile aynı olması (&lt;strong&gt;UniqueId&lt;/strong&gt; değeri), kontrol&amp;uuml;n post edilen verilerinin (postBack Datas) alıp işlenmesi ve ilgili olay metodunun fırlatabilmesi i&amp;ccedil;in&lt;strong&gt;IPostBackDataHandler&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n uygulanmış olması gerekmektedir. Eğer sadece postback olaylarını fırlatmayı d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorsak, yani form verilerini işlemeyi d&amp;uuml;ş&amp;uuml;nmeden olay fırlatmak ile ilgileniyorsak &lt;strong&gt;IPostBackEventHandler&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamamız yeterli olacaktır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;İlk yapmamız gereken değişiklik, Render metodu i&amp;ccedil;erisinde aşağıdaki gibi olmalıdır. Bu ama&amp;ccedil;la kontrol&amp;uuml;m&amp;uuml;z i&amp;ccedil;erisine birde &amp;ouml;zellik(property) katabiliriz. Bu &amp;ouml;zellik yanlız okunabilir (ReadOnly) olarak tasarlanabilir ve g&amp;ouml;rev olarak, o an &amp;uuml;retilen bileşenin UniqueId değerini taşıyabilir. Aynen aşağıdaki gibi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public string SubmitName
{
    get { return this.UniqueID; }
}

protected override void Render(HtmlTextWriter writer)
{ 
    // Diğer Kodlar
    writer.Write("&amp;lt;input type='submit' value='...' name='" + SubmitName + "'/&amp;gt;");
    base.Render(writer);
}&lt;/pre&gt;
&lt;p&gt;Şimdide kontrol&amp;uuml;m&amp;uuml;ze &lt;strong&gt;IPostBackDataHandler&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamalıyız. Bu aray&amp;uuml;z i&amp;ccedil;erisinde iki &amp;ouml;nemli metod vardır. &lt;strong&gt;LoadPostData&lt;/strong&gt; ve &lt;strong&gt;RaisePostDataChangedEvent&lt;/strong&gt;. &amp;Ouml;zellikle LoadPostData metodu sayesinde, istemciden sunucuya g&amp;ouml;nderilen sayfa i&amp;ccedil;erisindeki form verisini &amp;ccedil;ekebilir ve kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n i&amp;ccedil;erisindeki bazı alanların değerlerini yakalayabiliriz ki buda istediğimiz bir durumdur. &lt;em&gt; (Hatırlayınız, postback nedeni ile kontrol &amp;uuml;zerinde yapılan değişiklikleri kaybediyorduk.)&lt;/em&gt; LoadPostData metodunun &amp;ccedil;alışması sonrasında eğer true değeri &amp;uuml;retilirse, RaisePostDataChanged metodu devreye girecektir.&lt;/p&gt;
&lt;p&gt;Aksi takdirde RaisePostDataChangedEvent metodu &amp;ccedil;alıştırılmayacaktır. Buda ilgili olay metodun, kontrol &amp;uuml;zerindeki form verilerinde değişiklik olduğu zaman tetiklenmesine neden olacaktır ki bu bir avantaj olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Ayrıca RaisePostDataChangedEvent metodu, postback sonrası kontrole y&amp;uuml;klenmiş olan olayı &amp;ccedil;ağırmamızda da işe yarayacaktır. Buna g&amp;ouml;re, kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n bu aray&amp;uuml;z&amp;uuml; uygulamış olan son hali aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk190_5.gif" alt="" width="470" height="355" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class TarihKontrolumWithEvent : Control,IPostBackDataHandler
{
    [Description("Tarih bilgisi değiştirildiğinde doğrulamak i&amp;ccedil;in tetiklenen sunucu taraflı olaydır")]
    public event TarihDogrulaEventHandler TarihDogrula;

    public void OnTarihDogrula(TarihKontrolumEventDatas eData)
    {
        if (TarihDogrula != null)
            TarihDogrula(this, eData);
    }

    // GunMetin, AyMetin, YilMetin,SeciliGun,SeciliAy,SeciliYil &amp;ouml;zellikeri kodun kolay okunması amacıyla buradan kaldırılmıştır. &amp;Ouml;rnek uygulamayı indirip bu kodları da tedarik edebilirsiniz.

    public string SubmitName
    {
        get { return this.UniqueID; }
    }
    #endregion

    protected override void Render(HtmlTextWriter writer)
    { 
        writer.Write("&amp;lt;span id='lblGun'&amp;gt;" + GunMetin + "&amp;lt;/span&amp;gt;");
        writer.Write("&amp;nbsp;&amp;nbsp;");
        writer.Write("&amp;lt;select name='"+this.UniqueID+"Gun' id='Gun'&amp;gt;");
        for (int i = 1; i &amp;lt;= 31; i++)
        {
            if (SeciliGun == i.ToString())
                writer.Write("&amp;lt;option selected='selected' value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
            else
                writer.Write("&amp;lt;option value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
        }
        writer.Write("&amp;lt;/select&amp;gt;");
        writer.Write("&amp;nbsp;&amp;nbsp;");
        writer.Write("&amp;lt;span id='lblAy'&amp;gt;" + AyMetin + "&amp;lt;/span&amp;gt;");
        writer.Write("&amp;nbsp;&amp;nbsp;");
        writer.Write("&amp;lt;select name='"+this.UniqueID+"Ay' id='Ay'&amp;gt;");
        for (int i = 1; i &amp;lt;= 12; i++)
        {
            if (SeciliAy == i.ToString())
                writer.Write("&amp;lt;option selected='selected' value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
            else
                writer.Write("&amp;lt;option value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
        }
        writer.Write("&amp;lt;/select&amp;gt;");
        writer.Write("&amp;nbsp;&amp;nbsp;");
        writer.Write("&amp;lt;span id='lblYil'&amp;gt;" + YilMetin + "&amp;lt;/span&amp;gt;");
        writer.Write("&amp;nbsp;&amp;nbsp;");
        writer.Write("&amp;lt;select name='"+this.UniqueID+"Yil' id='Yil'&amp;gt;");
        for (int i = 1950; i &amp;lt;= 2050; i++)
        {
            if (SeciliYil == i.ToString())
                writer.Write("&amp;lt;option selected='selected' value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
            else
                writer.Write("&amp;lt;option value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
        }
        writer.Write("&amp;lt;/select&amp;gt;");
        writer.Write("&amp;lt;input type='submit' value='...' name='" + SubmitName + "'/&amp;gt;");
        base.Render(writer);
    }

    #region IPostBackDataHandler Members

    public bool LoadPostData(string postDataKey, System.Collections.Specialized.NameValueCollection postCollection)
    {
        bool gunDegisti=false, ayDegisti=false, yilDegisti=false;

        string seciliGun = postCollection[this.UniqueID+"Gun"];
        if (SeciliGun != seciliGun)
        {
            SeciliGun = seciliGun;
            gunDegisti = true;
        }
        string seciliAy = postCollection[this.UniqueID + "Ay"];
        if (SeciliAy != seciliAy)
        {
            SeciliAy = seciliAy;
            ayDegisti = true;
        }
    
        string seciliYil = postCollection[this.UniqueID + "Yil"];
        if (SeciliYil != seciliYil)
        {
            SeciliYil = seciliYil;
            yilDegisti = true;
        }
        return gunDegisti||ayDegisti||yilDegisti;
    }

    public void RaisePostDataChangedEvent()
    {
        TarihKontrolumEventDatas tded = new TarihKontrolumEventDatas(SeciliGun, SeciliAy, SeciliYil);
        OnTarihDogrula(tded);
    }

    #endregion
}&lt;/pre&gt;
&lt;p&gt;Kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; bu şekilde bir web sayfasında tekrardan test edelim. Bu kez LoadPostData, RaisePostDataChangedEvent, OnTarihDogrula ve web sayfamızdaki TarihKontrolumWithEvent1_TarihDogrula metodlarına birer breakpoint koyarak debug mode &amp;uuml;zerinden kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; izlemeye &amp;ccedil;alışalım. Kontrol &amp;uuml;zerindeki submit d&amp;uuml;ğmemize bastığımızda sayfa sunucuya geldikten sonra, kontrol ile ilişkili olarak ilk LoadPostData metoduna girilecektir. Burada &lt;strong&gt;NameValueCollection&lt;/strong&gt; tipinden olan &lt;strong&gt;postCollection&lt;/strong&gt; değişkeninin i&amp;ccedil;eriğine baktığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer bir sonu&amp;ccedil; ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk190_6.gif" alt="" width="639" height="51" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat ederseniz debug modda postCollection isimli değişkenin i&amp;ccedil;eriğinden, istemci tarafında değiştirilen Gun, Ay ve Yil değerleri elde edilebilmektedir. Yani istemciden gelen bu kontole ait form verilerini &amp;ccedil;ekebiliriz.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Dikkat ederseniz Render metodu i&amp;ccedil;erisinde, Select elementlerinin name attribute' larına değer verirken &lt;strong&gt;this.UniqueId &lt;/strong&gt;&amp;ouml;zelliğinden faydalanmıştır. Bunun sonucu olarak istemci tarafına giden select elementlerinin adları i&amp;ccedil;erisinde dahil oldukları kontrol&amp;uuml;n unique id değeride yer alacaktır. Eğer bunu yapmassak, aynı web sayfası i&amp;ccedil;erisinde bu kontrollerden birden fazlasını kullandığımızda, LoadPostData metoduna gelen koleksiyon bilgisinden, hangi kontrol i&amp;ccedil;in hangi değerlerin geldiğini ayrıştıramayız.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;LoadPostData metodu i&amp;ccedil;erisinde bir dizi kontrol işlemi yapılmaktadır. Sonu&amp;ccedil; itibariyle form ile gelen verilerin sayfanın ViewState' i i&amp;ccedil;erisinde tutulan verilerden farklı olmaması halinde boşu boşuna olay metodunu &amp;ccedil;alıştırmayı istemediğimiz i&amp;ccedil;in bu kontroller yapılmaktadır. Ancak Gun, Ay yada Yil değerlerini taşıyan select elementlerinden birisinde olacak bir değişiklik, &lt;strong&gt;RaisePostDataChanged&lt;/strong&gt; metodunun &amp;ccedil;ağırılmasını da sağlayacaktır.&lt;/p&gt;
&lt;p&gt;Debug modda ilerlediğimiz takdirde,(eğer kontrol i&amp;ccedil;erisindeki değerlerde değişiklik varsa), RaisePostDataChanged olay metoduna girilecektir. Sonrasında ise bu metod i&amp;ccedil;erisinde yaptığımız &amp;ccedil;ağrı sayesinde OnTarihDogrula metoduna ge&amp;ccedil;ilecektir. OnTarihDogrula metodu dikkat ederseniz, kontrol i&amp;ccedil;in bir TarihDogrula olayının y&amp;uuml;klenip y&amp;uuml;klenmediğini kontrol etmektedir. Eğer y&amp;uuml;kl&amp;uuml; ise, &lt;em&gt;(yani sayfa geliştirici tarafından kontrole ait bu olay metodu yazılmışsa)&lt;/em&gt; TarihKontrolumWithEvent1_TarihDogrula isimli olay metodundaki kodlar &amp;ccedil;alıştırılacaktır. Bu kodlarda basit olarak yapılan, olay verilerini alıp ekrana bastırmaktır. Bunu test kodu olarak yazmış bulunuyoruz. &amp;Ouml;zetle kontrol&amp;uuml;m&amp;uuml;z aşağıdaki gibi &amp;ccedil;alışabilecektir.&lt;/p&gt;
&lt;p&gt;&lt;object id="obj1" width="413" height="193" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/mk190_video.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="413" height="193" src="http://www.buraksenyurt.com/makale/images/mk190_video.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj1" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi artık kontrol&amp;uuml;m&amp;uuml;zde değişiklikeri algılayabiliyor, bunları herhangibir olay i&amp;ccedil;erisinde kullanabiliyoruz. UniqueId &amp;ouml;zelliğinden yararlanmamızın doğal sonucu olarak, sayfa &amp;uuml;zerinde birden fazla kontrol kullandığımız takdirde de sistemin sorunsuz bir şekilde &amp;ccedil;alışabileceğini g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;object id="obj2" width="269" height="169" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/mk190_video2.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="269" height="169" src="http://www.buraksenyurt.com/makale/images/mk190_video2.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj2" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;Bazı durumlarda PostBack verilerini ele almak istemiyor olabiliriz. Yani ama&amp;ccedil; sadece istemciden sunucuya doğru olay tetikletmek olabilir. Bu gibi durumlarda ilgili olayları tetikleyebilmek i&amp;ccedil;in &lt;strong&gt;IPostBackEventHandler&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;nden&amp;nbsp; faydalanabiliriz. Bu aray&amp;uuml;z, uygulandığı kontrol i&amp;ccedil;erisinde &lt;strong&gt;RaisePostBackEvent&lt;/strong&gt; metodunun yazılmasını zorlayacaktır. Bu makalemizde işlediklerimizden yanımıza kar kalan unsurlar aşağıdaki tabloda yer almaktadır.&lt;/p&gt;
&lt;table id="table12" style="border-collapse: collapse; width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#336699"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;"&gt;&lt;strong&gt;Yanımıza Kar Kalanlar&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff"&gt;Web kontrollerimize kendi olaylarımızı (event) &amp;ouml;ğretmek i&amp;ccedil;in kendi temsilcilerimizden faydalanabilir yada .Net Framework i&amp;ccedil;erisinde var olan olay temsilcilerinden yararlanabiliriz.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff"&gt;Bir web kontrol&amp;uuml;nde, istemciden sunucuya postback işlemini ger&amp;ccedil;ekleştirilmesi i&amp;ccedil;in Submit işlemini &amp;uuml;stlenen elementin adının, kontrol&amp;uuml;n UniqueId değeri ile aynı olması gerekir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff"&gt;Form &amp;uuml;zerinden gelen verilerin (form-datas) ele alınabilmesi i&amp;ccedil;in, submit elementinin adının, kontrol&amp;uuml;n adı ile aynı olması yeterli değildir. Bu verileri okuyabilmek ve sonrasında ilgili olayları tetikleyebilmek i&amp;ccedil;in &lt;strong&gt;IPostBackDataHandler&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n , web kontrol&amp;uuml;ne uygulanması gerekmektedir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff"&gt;Sadece olay tetikletmek amacıyla, &lt;strong&gt;IPostBackEventHandler&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n ilgili kontrole uygulanmasıda d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Elbetteki hem IPostBackDataHandler hemde IPostBackEventHandler aray&amp;uuml;zlerinin bir arada uygulanması daha g&amp;uuml;&amp;ccedil;l&amp;uuml; bir web kontrol&amp;uuml; oluşturulmasına neden olacaktır.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2007-02-05 12:00:00</pubDate>
  <slug>Web-Server-Control-Yazmak-3-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet-20</tag>
    <tag>web-server-control</tag>
    <tag>aspnet</tag>
  </tags>
  <categories>
    <category>Asp.Net 2.0</category>
  </categories>
</post>