<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF Known Types Analizi</title>
  <description>Bilindiği üzere WCF aslında SOA(Service Oriented Architecture) mimarisinin uygulama modellerinden birisidir. İşin içerisinde servisler söz konusu olduğunda ağlar ve sistemler arası mesajlaşlamalar söz konusudur.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f9%2fblg84_Thinking.jpg" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bilindiği &amp;uuml;zere &lt;strong&gt;WCF&lt;/strong&gt; aslında &lt;strong&gt;SOA(Service Oriented Architecture) &lt;/strong&gt;mimarisinin uygulama modellerinden birisidir. İşin i&amp;ccedil;erisinde servisler s&amp;ouml;z konusu olduğunda ağlar ve sistemler arası mesajlaşlamalar s&amp;ouml;z konusudur. Mesajlaşmalar s&amp;ouml;z konusu olduğundaysa, servis ve istemci arasında hareket eden verinin serileşebilir olması &amp;ouml;nem arz eden konuların başında gelmektedir.&lt;/p&gt;
&lt;p&gt;Ne varki serileşen veri i&amp;ccedil;eriklerinin, platform bağımsızlık adına her iki tarafında kullanabileceği &lt;strong&gt;tiplerden(Types)&lt;/strong&gt; oluşmasının sağlanması bir avantajdır. İşte bu noktada biz &lt;strong&gt;WCF &lt;/strong&gt;geliştiricileri i&amp;ccedil;in anlaşılması zor olan ve dikkatle &amp;uuml;zerinde durumlası gereken kıyıda k&amp;ouml;şede kalmış konulardan biriside &lt;strong&gt;Known Types &lt;/strong&gt;kavramıdır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF &lt;/strong&gt;ile birlikte gelen ve serileştirmede kullanılan tipler esas itibariyle &lt;strong&gt;Shared Contracts&lt;/strong&gt; kategorisindendir. Nitekim serileşen tipin ve kullandığı i&amp;ccedil;eriğin &lt;strong&gt;Interoperabilitiy&lt;/strong&gt; kuralları &amp;ccedil;evresinde değerlendirilebiliyor olması gerekir. &lt;strong&gt;DataContractSerializer&lt;/strong&gt;, &lt;strong&gt;JsonDataContractSerializer &lt;/strong&gt;ve &lt;strong&gt;XmlSerializer &lt;/strong&gt;gibi serileştirici tipler bu kategoride yer almaktadır. Diğer yandan &lt;strong&gt;BinaryFormatter&lt;/strong&gt;, &lt;strong&gt;SoapFormatter &lt;/strong&gt;veya &lt;strong&gt;NetDataContractSerializer &lt;/strong&gt;gibi tipler, &lt;strong&gt;Shared Types&lt;/strong&gt; kategorisinde yer alan serileştiricilerdir. Genellikle serileşen tiplerin i&amp;ccedil;erdiği tip bilgilerinin tanımlandığı &lt;strong&gt;Assembly'&lt;/strong&gt; lar, uygulama ile aynı makinede yer alır.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin serileştirilebilir tipin i&amp;ccedil;eriğinin &lt;strong&gt;.Net CLR&lt;/strong&gt; tiplerinden oluştuğunu d&amp;uuml;ş&amp;uuml;nelim. Bu durumda ters serileştirme işlemini &amp;uuml;stelenen uygulamanında bu &lt;strong&gt;CLR(Common Language Runtime)&lt;/strong&gt;&amp;nbsp;tiplerini biliyor olması, bir başka deyişle uygun &lt;strong&gt;Framework Assembly'&lt;/strong&gt; larına sahip olması yeterlidir. Ancak &lt;strong&gt;SOA&lt;/strong&gt; tabanlı bir sistemde &lt;strong&gt;serileştirme(Serialize)&lt;/strong&gt; ve &lt;strong&gt;ters-serileştirme(Deserialize)&lt;/strong&gt; yapan tarafların aralarında taşıdıkları tiplerle ilişkili olarak ortak bir noktada buluşmaları gerekmektedir. Nitekim hem sağlayıcı hemde t&amp;uuml;ketici taraflar kendi platformlarında&amp;nbsp;kendi &amp;ouml;zel veri tiplerine sahiptir ve sadece bu tipleri kullanabilir.&amp;nbsp;Bu noktada tipin &lt;strong&gt;XSD(XmlSchemaDefinition)&lt;/strong&gt;&amp;nbsp;şemaları i&amp;ccedil;erisinde tanımlandığını&lt;em&gt;(dolayısıyla serileşen paketler i&amp;ccedil;erisinde taşındığını)&lt;/em&gt; ve &amp;ouml;rneğin &lt;strong&gt;Proxy'&lt;/strong&gt; yi &amp;uuml;reten tarafta bile&amp;nbsp;kullanılabilecek bir tipe karşılık gelmesi gerektiğini s&amp;ouml;yleyebiliriz. Tabiki buradaki veri&amp;nbsp;tipi bilgileri arada transfer edilen &lt;strong&gt;XML&lt;/strong&gt; i&amp;ccedil;eriklerinde ortaktır.&lt;/p&gt;
&lt;p&gt;Aslında bu teorik bilgiler, yazarken bile insanın kafasını allak bullak etmeye neden olabilir.&amp;nbsp;Bu y&amp;uuml;zden kafamızda sorunsal haline gelebilecek bu konuyu&amp;nbsp;&amp;ouml;rnekler &amp;uuml;zerinden a&amp;ccedil;ıklamakta yarar olacağı kanısındayım. İşe ilk olarak &lt;strong&gt;Visual&amp;nbsp;Studio 2008&lt;/strong&gt; ortamında oluşturulumuş bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması ve&amp;nbsp;aşağıdaki kod par&amp;ccedil;ası ile başlayalım.&lt;em&gt;(System.Runtime.Serialization referansının eklenmiş olması gerektiğini unutmayın)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.IO;
using System.Runtime.Serialization;

namespace KnownTypes
{
    class Program
    {
        static void Main(string[] args)
        {
            // DataContractSerializer nesnesi &amp;ouml;rneklenirken parametre olarak serileştirilecek tip bilgisi verilir.
            XmlObjectSerializer serializer = new DataContractSerializer(typeof(Product));
            // Serileştirme işlemi yapılır. İlk parametre ile &amp;ccedil;ıktının Product.xml isimli dosyaya yaplacağı belirtilir. 
            // İkinci parametrede Product nesnesi &amp;ouml;rneklenir. Dikkat edilecek nokta Information &amp;ouml;zelliğine object tipinden bir nesne &amp;ouml;rneğinin aktarılmış olmasıdır.            
            serializer.WriteObject(
                new FileStream("Product.xml", FileMode.Create, FileAccess.Write)
                , new Product { Information = new object() }
                );

            // Object tipine string atama
            serializer.WriteObject(
                new FileStream("ProductV2.xml", FileMode.Create, FileAccess.Write)
                , new Product { Information = "&amp;Uuml;r&amp;uuml;n hakkında &amp;ccedil;eşitli bilgiler" }
                );

            // Exception durumu
            //serializer.WriteObject(
            //    new FileStream("ProductV3.xml", FileMode.Create, FileAccess.Write)
            //    , new Product { Information = new ProductInformation { Id=1, Summary="&amp;Uuml;r&amp;uuml;n i&amp;ccedil;in &amp;ccedil;eşitli bilgiler" } }
            //    );  
        }
    }

    [DataContract]
    class Product
    {
        [DataMember]
        public object Information { get; set; }
    }

    // [DataContract]
    // class ProductInformation
    // {
    //     [DataMember]
    //     public string Summary { get; set; }
    //     [DataMember]
    //     public int Id { get; set; }
    // }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rneğimizde &lt;strong&gt;Product&lt;/strong&gt; isimli serileştirilebilir bir tip tanımlandığı g&amp;ouml;r&amp;uuml;lmektedir. &lt;strong&gt;DataContract&lt;/strong&gt; niteliği ile işaretlenmiş olan &lt;strong&gt;Product&lt;/strong&gt; tipinin &lt;strong&gt;object&lt;/strong&gt; tipinden &lt;strong&gt;Information&lt;/strong&gt; isimli bir &amp;ouml;zelliği de bulunmaktadır ki işleri karıştıracak olan nokta burasıdır. Program kodu i&amp;ccedil;erisindeki ama&amp;ccedil;, &lt;strong&gt;Product &lt;/strong&gt;tipinden nesne &amp;ouml;rneklerinin nasıl serileştirildiğine bakmaktır. &lt;strong&gt;serializer&lt;/strong&gt; isimli &lt;strong&gt;XmlObjectSerializer&lt;/strong&gt; nesne &amp;ouml;rneği &amp;uuml;zerinden yapılan ilk &lt;strong&gt;WriteObject&lt;/strong&gt; &amp;ccedil;ağrısındai &lt;strong&gt;Information &lt;/strong&gt;&amp;ouml;zelliğine &lt;strong&gt;object&lt;/strong&gt; tipinden bir değer atandığı g&amp;ouml;r&amp;uuml;lmektedir. İkinci &lt;strong&gt;WriteObject&lt;/strong&gt; &amp;ccedil;ağrısında ise bir &lt;strong&gt;string&lt;/strong&gt; değer atanmıştır ki bu son derece doğaldır. &lt;em&gt;(Hatırlayalım .Net tipleri en &amp;uuml;stte Object tipinden t&amp;uuml;remektedir. Bu nedenle her nesnenin Object tipi ile ifade edilebilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.) &lt;/em&gt;Bu kod par&amp;ccedil;asını &amp;ccedil;alıştırdığımızda &lt;strong&gt;Product.xml&lt;/strong&gt; ve &lt;strong&gt;ProductV2.xml &lt;/strong&gt;isimli iki dosya &amp;uuml;retildiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z. &amp;Ouml;nce &lt;strong&gt;Product.xml &lt;/strong&gt;i&amp;ccedil;eriğine ve şemasına bir bakalım.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Product.xml i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Product xmlns="http://schemas.datacontract.org/2004/07/KnownTypes" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&amp;gt;&amp;lt;Information/&amp;gt;&amp;lt;/Product&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Product.xsd i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="windows-1254"?&amp;gt;
&amp;lt;xs:schema xmlns:i="http://www.w3.org/2001/XMLSchema-instance" attributeFormDefault="unqualified" elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/KnownTypes" xmlns:xs="http://www.w3.org/2001/XMLSchema"&amp;gt;
  &amp;lt;xs:element name="Product"&amp;gt;
    &amp;lt;xs:complexType&amp;gt;
      &amp;lt;xs:sequence&amp;gt;
        &amp;lt;xs:element name="Information" /&amp;gt;
      &amp;lt;/xs:sequence&amp;gt;
    &amp;lt;/xs:complexType&amp;gt;
  &amp;lt;/xs:element&amp;gt;
&amp;lt;/xs:schema&amp;gt;&lt;/pre&gt;
&lt;p&gt;Tahmin ettiğimiz ve beklediğimiz gibi bir &amp;ccedil;ıktı &amp;uuml;retilmiştir. Ancak &lt;strong&gt;Information&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;string &lt;/strong&gt;bir değer atanmasının sonucu oluşan &amp;ccedil;ıktı biraz farklıdır. Bu noktada&amp;nbsp;dikkatle duralım &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ProductV2.xml i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Product xmlns="http://schemas.datacontract.org/2004/07/KnownTypes" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&amp;gt;
  &amp;lt;Information i:type="a:string" xmlns:a="http://www.w3.org/2001/XMLSchema"&amp;gt;&amp;Uuml;r&amp;uuml;n hakkında &amp;ccedil;eşitli bilgiler&amp;lt;/Information&amp;gt;
&amp;lt;/Product&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;ProductV2.xsd i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8"?&amp;gt;
&amp;lt;a:schema xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:a="http://www.w3.org/2001/XMLSchema" attributeFormDefault="unqualified" elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/KnownTypes"&amp;gt;
  &amp;lt;xs:element name="Product"&amp;gt;
    &amp;lt;xs:complexType&amp;gt;
      &amp;lt;xs:sequence&amp;gt;
        &amp;lt;xs:element name="Information" type="xs:string" /&amp;gt;
      &amp;lt;/xs:sequence&amp;gt;
    &amp;lt;/xs:complexType&amp;gt;
  &amp;lt;/xs:element&amp;gt;
&amp;lt;/a:schema&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;XSD&lt;/strong&gt; şemasında, &lt;strong&gt;Information &lt;/strong&gt;elementi i&amp;ccedil;in &lt;strong&gt;type &lt;/strong&gt;niteliğinde &lt;strong&gt;xs:string &lt;/strong&gt;kullanıldığı g&amp;ouml;r&amp;uuml;lmektedir. &amp;Uuml;stelik &amp;uuml;retilen veri i&amp;ccedil;eriğinde de &lt;strong&gt;i:type &lt;/strong&gt;niteliğinde &lt;strong&gt;Information &lt;/strong&gt;elementinin i&amp;ccedil;eriğinin &lt;strong&gt;string &lt;/strong&gt;veri tipinden olduğu işaret edilmektedir. Yani &lt;strong&gt;Information &lt;/strong&gt;&amp;ouml;zelliğine atadığımız &lt;strong&gt;string&lt;/strong&gt; değişken,&amp;nbsp;&lt;strong&gt;primitive&lt;/strong&gt; bir tip tanımana g&amp;ouml;re XML i&amp;ccedil;erisinde bildirilmiştir. Zaten &lt;strong&gt;primitive&lt;/strong&gt; tiplere d&amp;ouml;n&amp;uuml;ş&amp;uuml;m yapıldığı takdirde pek bir sıkıntı yoktur. S&amp;ouml;z gelimi &lt;strong&gt;Information&lt;/strong&gt; &amp;ouml;zelliğine &amp;ouml;rneğin &lt;strong&gt;12&lt;/strong&gt; değerini atadığımızda buna uygun olarak &lt;strong&gt;XML&lt;/strong&gt; i&amp;ccedil;eriğinde de &lt;strong&gt;int&lt;/strong&gt; tipinin kullanıldığı g&amp;ouml;r&amp;uuml;lebilir. Sorun yorum satırı kodlarını &amp;ccedil;alışır hale getirdiğimizde ortaya &amp;ccedil;ıkmaktadır. Yeni &lt;strong&gt;ProductInformation&lt;/strong&gt; tipini etkinleştirip aşağıdaki kodları &amp;ccedil;alıştırdığımızda... &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;// Exception durumu
            serializer.WriteObject(
                new FileStream("ProductV3.xml", FileMode.Create, FileAccess.Write)
                , new Product { Information = new ProductInformation { Id=1, Summary="&amp;Uuml;r&amp;uuml;n i&amp;ccedil;in &amp;ccedil;eşitli bilgiler" } }
                ); &lt;/pre&gt;
&lt;p&gt;Bu sefer &lt;strong&gt;Information&lt;/strong&gt; &amp;ouml;zelliğine serileştirilebilir&lt;em&gt;(ki &lt;strong&gt;DataContract &lt;/strong&gt;ve &lt;strong&gt;DataMember&lt;/strong&gt; nitelikleri nedeni ile) &lt;/em&gt;&lt;strong&gt;ProductInformation&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneği atanmaktadır. Bu durumda &amp;ccedil;alışma zamanında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan &lt;strong&gt;SerializationException&lt;/strong&gt; istisnasının alındığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f9%2fblg84_Exception.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu istisna mesajından anlamamız gereken &amp;ouml;zl&amp;uuml; s&amp;ouml;z şudur;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;"Serileştirici tiplerin, serileştirecekleri nesne &amp;ouml;rneklerinin &amp;ouml;zelliklerinin&amp;nbsp;tiplerinin neler olabileceğini a&amp;ccedil;ık bir şekilde bilmeye ihtiya&amp;ccedil;ları vardır. " &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Her ne kadar &lt;strong&gt;primitive&lt;/strong&gt; bir tip kullanıldığında sorun olmasa da, yukarıdaki &amp;ouml;rnekte g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi bilinmeyen bir tipin atanmasında sorunlar yaşanabilir. &amp;Uuml;stelik belkide atanan verinin tipinin, serileştirici tarafından varsayılan olarak atanan bir tip &lt;span style="text-decoration: underline;"&gt;olmaması da&lt;/span&gt; gerekebilir. S&amp;ouml;z gelimi &lt;strong&gt;Information&lt;/strong&gt; &amp;ouml;zelliğine noktasız sayısal bir değer atandığında b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;ne g&amp;ouml;re varsayılan olarak &lt;strong&gt;int&lt;/strong&gt; tipi g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınacak ve &lt;strong&gt;XML &lt;/strong&gt;i&amp;ccedil;eriğinde bu y&amp;ouml;nde bir tanımlama olacaktır. Ki karşı tarafta&amp;nbsp;belkide bu sayısal değerin &lt;strong&gt;string&lt;/strong&gt; olarak değerlendirilmesi isteniyor olabilir! Upsss...&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Peki serileştiricinin serileştirdiği tipin i&amp;ccedil;eriğinde kullanılabilecek tipleri kesin olarak bilmesi nasıl sağlanabilir?&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Y&amp;ouml;ntemlerden birisi ve belkide en basiti, aşağıdaki kod par&amp;ccedil;asında olduğu gibi serileştirilecek tip i&amp;ccedil;in &lt;strong&gt;KnownType&lt;/strong&gt; niteliğini kullanmaktır&lt;em&gt;.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;Kişisel Not: &lt;/strong&gt;Başka&amp;nbsp;y&amp;ouml;ntemlerde&amp;nbsp;bulunmaktadır. &amp;Ouml;rneğin tip i&amp;ccedil;erisinde Type[] dizisi d&amp;ouml;nd&amp;uuml;ren bir metodun adı KnownType&amp;nbsp;niteliğinde kullanılarak birden fazla tipin bildirimi yapılabilir. Ya da servis&amp;nbsp;s&amp;ouml;zleşmesinde ServiceKnownType niteliğinde&amp;nbsp;bu bildirim yapılabilir.&amp;nbsp;İşte size g&amp;uuml;zel bir araştırma konusu.&amp;nbsp;Bu tekniklerin nasıl uygulanabileceğini araştırabilirsiniz. &amp;Ouml;zellikle ilk teknik dikkate değerdir. Yani bir metod aracılığıyla, KnowType niteliğine birden fazla tipin Type[] dizisi olarak bildirilmesi. Dikkat edilmesi gereken tek nokta Type[] dizisi d&amp;ouml;nd&amp;uuml;ren metodun static olmasını sağlamaktır. Hatta buradan bir adım &amp;ouml;teye gidip generic bir modelin KnownType niteliğine s&amp;ouml;z konusu metod yardımıyla aktarılması dahi sağlanabilir. Bu kadar ipucu yeter. Haydi klavye başına&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[DataContract]
[KnownType(typeof(ProductInformation))]
class Product
{
   [DataMember]
   public object Information { get; set; }
}&lt;/pre&gt;
&lt;p&gt;Bu şekildeki kullanım sonrasında artık &lt;strong&gt;SerializationException&lt;/strong&gt; istisnası &amp;uuml;retilmeyecek ve aşağıdaki &amp;ccedil;ıktılar oluşacaktır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ProductV3.xml i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Product xmlns="http://schemas.datacontract.org/2004/07/KnownTypes" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&amp;gt;
  &amp;lt;Information i:type="ProductInformation"&amp;gt;
    &amp;lt;Id&amp;gt;1&amp;lt;/Id&amp;gt;
    &amp;lt;Summary&amp;gt;&amp;Uuml;r&amp;uuml;n i&amp;ccedil;in &amp;ccedil;eşitli bilgiler&amp;lt;/Summary&amp;gt;
  &amp;lt;/Information&amp;gt;
&amp;lt;/Product&amp;gt;&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;ProductInformation&lt;/strong&gt; nesne &amp;ouml;rneği i&amp;ccedil;eriği ile birlikte &lt;strong&gt;Product&lt;/strong&gt; elementi i&amp;ccedil;erisine alınmıştır. Bu durumda şema i&amp;ccedil;eriğinde gerekli bilgilendirmelerin aşağıdaki gibi yapıldığı g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ProductV3.xsd i&amp;ccedil;eriği&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8"?&amp;gt;
&amp;lt;xs:schema xmlns:i="http://www.w3.org/2001/XMLSchema-instance" attributeFormDefault="unqualified" elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/KnownTypes" xmlns:xs="http://www.w3.org/2001/XMLSchema"&amp;gt;
  &amp;lt;xs:element name="Product"&amp;gt;
    &amp;lt;xs:complexType&amp;gt;
      &amp;lt;xs:sequence&amp;gt;
        &amp;lt;xs:element name="Information"&amp;gt;
          &amp;lt;xs:complexType&amp;gt;
            &amp;lt;xs:sequence&amp;gt;
              &amp;lt;xs:element name="Id" type="xs:unsignedByte" /&amp;gt;
              &amp;lt;xs:element name="Summary" type="xs:string" /&amp;gt;
            &amp;lt;/xs:sequence&amp;gt;
          &amp;lt;/xs:complexType&amp;gt;
        &amp;lt;/xs:element&amp;gt;
      &amp;lt;/xs:sequence&amp;gt;
    &amp;lt;/xs:complexType&amp;gt;
  &amp;lt;/xs:element&amp;gt;
&amp;lt;/xs:schema&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Known Type&lt;/strong&gt; sorunsalının bir sorunsal olarak değerlendirilmesinin ise iki sebebi vardır.&lt;/p&gt;
&lt;p&gt;Birincisi, &lt;strong&gt;SOA&lt;/strong&gt; d&amp;uuml;ş&amp;uuml;nce tarzına aykırı olduğu g&amp;ouml;r&amp;uuml;ş&amp;uuml;n&amp;uuml;n&amp;uuml;n yaygın olmasıdır. Nitekim &lt;strong&gt;Shared Contract'&lt;/strong&gt; ların s&amp;ouml;z konusu olduğu senaryolarda &lt;strong&gt;Interoperability&lt;/strong&gt; sağlanırken, &lt;strong&gt;XML &lt;/strong&gt;i&amp;ccedil;erisindeki tipin karşı taraf&amp;ccedil;a anlaşılabilir olması gerekmektedir. İkinci olarak serileştirme ve ters serileştirme işlemleri sırasında &lt;strong&gt;Known Type'&lt;/strong&gt; a g&amp;ouml;re &lt;strong&gt;Reflection&lt;/strong&gt; mekanizmasının devreye girmesi, &lt;strong&gt;XML&lt;/strong&gt; &amp;uuml;zerinde tip ile ilişkili bilgi edinme ve yazma gibi operasyonların s&amp;ouml;z konusu olmasından kaynaklanan performans kayıpları değerlendirilmektedir. Bu iki sebep nedeniyle zorunlu kalınmadık&amp;ccedil;a &lt;strong&gt;Known Type&lt;/strong&gt; kullanımından ka&amp;ccedil;ınılması &amp;ouml;nerilmektedir. Peki neden b&amp;ouml;yle bir konuya değindik?&amp;nbsp;Aslında bir sonraki yazımıza zemin hazırlamaya &amp;ccedil;alışıyoruz. Nitekim&lt;strong&gt; WCF 4.0&lt;/strong&gt; tarafında bu konu ile ilişkili bir yenilik gelmesi muhtemeldir. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f9%2fKnownTypes.rar"&gt;KnownTypes.rar (22,64 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-10-20 13:36:00</pubDate>
  <slug>WCF-Known-Types-Analizi</slug>
  <tags>
    <tag>wcf</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>