<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>NoSQL Maceraları - db4o ile Hello World</title>
  <description>Apache Cassandra, RavendDb, Dex, StsDb derken sıra geldi nesne veritabanlarından(Object Database) birisi olan db4o’ ya(Database for Objects şeklinde çevirebiliriz sanırım) Object tipinden bir NoSQL(Not-Only SQL) veritabanı olan db4o ürününün, Java ve .Net platformları için sürümleri bulunmaktadır(Hatta Mono desteği de mevcuttur). Aslında %100 Java ile geliştirilmiştir ve açık kaynak Sharpen ile C# diline de çevrilmiştir. Bu da onun popüler olmasını sağlayan unsurlardan bir tanesidir(Yazının hazırlandığı tarih itibariyle .Net Framework 3.5/4.0 ve platformlarını hedef alan versiyonları vardı)</description>
  <content>&lt;p&gt;&lt;a href="/pics/GoldenGateBridge-001.jpg"&gt;&lt;img style="float: right; margin: 4px 0px; display: inline;" title="GoldenGateBridge-001" src="/pics/GoldenGateBridge-001_thumb.jpg" alt="GoldenGateBridge-001" width="300" height="225" align="right" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Eğer bir &amp;uuml;lke olsaydı, d&amp;uuml;nyanın 6ncı b&amp;uuml;y&amp;uuml;k ekonomisne sahip olurdu.&lt;/p&gt;
&lt;p&gt;Bu ifade Amerika&amp;rsquo; nın en kalabalık n&amp;uuml;fusuna sahip olan &lt;strong&gt;Kaliforniya&lt;/strong&gt; eyaleti i&amp;ccedil;in &lt;a href="http://tr.wikipedia.org/wiki/Kaliforniya" target="_blank"&gt;wikipedia&lt;/a&gt;&amp;rsquo; da yazılmış. Birleşik Devletlerin batı kıyısının bir eyaleti olan Kaliforniya eyaletinde aslında pek &amp;ccedil;oğumuzun gıpta ederek baktığı şehirler var.&lt;/p&gt;
&lt;p&gt;NBA&amp;rsquo; in en &amp;uuml;nl&amp;uuml; takımlarından olan&lt;strong&gt; Lakers&lt;/strong&gt;&amp;rsquo; ın vatanı &lt;strong&gt;Los Angeles&lt;/strong&gt;, uzun bir d&amp;ouml;nem &lt;strong&gt;Kings&lt;/strong&gt; forması giyen &lt;strong&gt;Hido&lt;/strong&gt;&amp;rsquo; nun şehri &lt;strong&gt;Sacremento&lt;/strong&gt;&lt;em&gt;(ki aynı zamanda eyalet başkenti olarak ge&amp;ccedil;iyor)&lt;/em&gt;, k&amp;uuml;&amp;ccedil;&amp;uuml;kl&amp;uuml;ğ&amp;uuml;mde sokakları ile bir dedektiflik dizisinin&lt;em&gt;(&lt;/em&gt;&lt;a href="http://www.imdb.com/title/tt0068135/" target="_blank"&gt;&lt;em&gt;The Street of San Franciso&lt;/em&gt;&lt;/a&gt;&lt;em&gt;)&lt;/em&gt; adeta başrol&amp;uuml; haline gelen&lt;strong&gt; San Francisco&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;Yazılan bilgilere g&amp;ouml;re değiştirilemeyen bir anayasa kanunu bulunmaktadır. Buna g&amp;ouml;re &lt;strong&gt;ekonominin %40&amp;rsquo;ı eğitime ayrılmak zorunda&lt;/strong&gt;. Bu benim ger&amp;ccedil;ekten &amp;ccedil;ok hoşuma gitti. Tabi şehrin &amp;ouml;nemli sembolleri de var. Bunlardan birisi de &lt;strong&gt;Golden Gate&lt;/strong&gt; k&amp;ouml;pr&amp;uuml;s&amp;uuml;. Bu g&amp;uuml;n işleyeceğimiz konunun hikayesinin baş kahramanı ise, Kaliforniya k&amp;ouml;kenli bir yazılım firmasına olan &lt;strong&gt;Versant&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;&lt;a href="/category/NoSQL" target="_blank"&gt;Apache Cassandra, RavendDb, Dex, StsDb&lt;/a&gt; derken sıra geldi nesne veritabanlarından&lt;em&gt;(Object Database)&lt;/em&gt; birisi olan &lt;strong&gt;db4o&lt;/strong&gt;&amp;rsquo; ya&lt;em&gt;(Database for Objects şeklinde &amp;ccedil;evirebiliriz sanırım) &lt;/em&gt;&lt;strong&gt;Object&lt;/strong&gt; tipinden bir &lt;strong&gt;NoSQL&lt;/strong&gt;&lt;em&gt;(Not-Only SQL)&lt;/em&gt; veritabanı olan &lt;strong&gt;db4o&lt;/strong&gt; &amp;uuml;r&amp;uuml;n&amp;uuml;n&amp;uuml;n, &lt;strong&gt;Java &lt;/strong&gt;ve &lt;strong&gt;.Net &lt;/strong&gt;platformları i&amp;ccedil;in s&amp;uuml;r&amp;uuml;mleri bulunmaktadır&lt;em&gt;(Hatta &lt;strong&gt;Mono&lt;/strong&gt; desteği de mevcuttur)&lt;/em&gt;. Aslında &lt;strong&gt;%100 Java&lt;/strong&gt; ile geliştirilmiştir ve a&amp;ccedil;ık kaynak &lt;strong&gt;Sharpen&lt;/strong&gt; ile &lt;strong&gt;C#&lt;/strong&gt; diline de &amp;ccedil;evrilmiştir. Bu da onun pop&amp;uuml;ler olmasını sağlayan unsurlardan bir tanesidir&lt;em&gt;(Yazının hazırlandığı tarih itibariyle &lt;strong&gt;.Net Framework 3.5/4.0 ve &lt;/strong&gt;platformlarını hedef alan versiyonları vardı)&lt;/em&gt;&lt;/p&gt;
&lt;h1&gt;Genel &amp;Ouml;zellikleri&lt;/h1&gt;
&lt;p&gt;Kaliforniya ikametli &lt;strong&gt;Versant&lt;/strong&gt; isimli şirketin a&amp;ccedil;ık kaynak olarak sunduğu &amp;uuml;r&amp;uuml;n, &lt;strong&gt;GPL&lt;em&gt;(Generic Public License)&lt;/em&gt;&amp;nbsp;&lt;/strong&gt;haricinde &lt;strong&gt;Commercial &lt;/strong&gt;olan bir versiyona daha sahiptir. &lt;strong&gt;Db4o&lt;/strong&gt; &amp;uuml;r&amp;uuml;n&amp;uuml;n&amp;uuml;n genel &amp;ouml;zelliklerini ise aşağıdaki maddeler ile &amp;ouml;zetleyebiliriz;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Nesne sorgulamaları i&amp;ccedil;in &lt;strong&gt;Query By Example&lt;/strong&gt;&lt;em&gt;(yani nesne &amp;ouml;rneğinden yararlanmak suretiyle)&lt;/em&gt;, &lt;strong&gt;Native Queries, Soda &lt;/strong&gt;ve &lt;strong&gt;LINQ &lt;/strong&gt;se&amp;ccedil;enekleri mevcuttur.&lt;/li&gt;
&lt;li&gt;Native Query desteği sayesinde kullanılan dile &amp;ouml;zg&amp;uuml; sorgulamalar yapılabilir. Ayrıca &lt;strong&gt;Native Query&lt;/strong&gt;&amp;rsquo; ler &lt;strong&gt;Type Safety &lt;/strong&gt;ve &lt;strong&gt;Code Injection &lt;/strong&gt;noktalarında avantaj sağlamaktadır.&lt;/li&gt;
&lt;li&gt;TCP/IP protokol&amp;uuml; &amp;uuml;zerinden mesajlaşma yoluyla &amp;ccedil;alışan Client/Server moduna da sahiptir. &lt;em&gt;(Performans ağdaki bandwith hızlarına bağımlıdır ancak sorgular Lazy Query&amp;rsquo; ler ile daha performanslı &amp;ccedil;alışacak hale getirilebilir)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Java&lt;/strong&gt;' da yazılmış olmasına karşın &lt;strong&gt;.Net&lt;/strong&gt; i&amp;ccedil;in de bir &lt;strong&gt;API &lt;/strong&gt;sunmaktadır.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Embeded&lt;/strong&gt; bir veritabanı sistemidir ve bu nedenle uygulamaya ait alan&lt;em&gt;(Application Process)&lt;/em&gt; i&amp;ccedil;erisinde &amp;ccedil;alışır.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;dRS&lt;/strong&gt;&lt;em&gt;(db4o Replication System) &lt;/em&gt;olarak adlandırılan &amp;uuml;r&amp;uuml;n sayesinde &lt;strong&gt;RDBMS&lt;/strong&gt; ile aralarında data transfer,migration gibi operasyonlar ger&amp;ccedil;ekleştirilebilir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;ACID(Atomicity Consistency Isolation Durability)&lt;/strong&gt; ilkelerine izin vermektedir. Bu &lt;strong&gt;Concurrency &lt;/strong&gt;vakasında &amp;ouml;nemli bir &amp;ouml;zelliktir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Visual Studio(2008,2010)&lt;/strong&gt; ve &lt;strong&gt;Eclipse &lt;/strong&gt;i&amp;ccedil;in entegre olabilen &lt;strong&gt;ObjectManager Enterprise &lt;/strong&gt;arabirimine sahiptir.&lt;/li&gt;
&lt;li&gt;Diğer yandan a&amp;ccedil;ık kaynak olan proje kodu &lt;strong&gt;OpenSource Compatibility License&lt;/strong&gt; altındadır.&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;ObjectManager Enterprise i&amp;ccedil;in VS 2008 ve VS 2010 versiyonları i&amp;ccedil;in bir destek mevcuttur. Install işlemi sonrası dilerseniz bu eklentiyi ayrıca kurabilirsiniz.&lt;/p&gt;
&lt;p&gt;Visual Studio 2012 tarafında ise ObjectManager Enterprise i&amp;ccedil;in bir geliştirme yapılmadığı g&amp;ouml;r&amp;uuml;lmektedir &lt;em&gt;(G&amp;uuml;ncel durumu kontrol ediniz)&lt;/em&gt;&lt;a href="/pics/db4o_2.png"&gt; &lt;br /&gt; &lt;br /&gt;&lt;img style="margin: 4px 0px; display: inline;" title="db4o_2" src="/pics/db4o_2_thumb.png" alt="db4o_2" width="251" height="112" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;Merhaba D&amp;uuml;nya Uygulaması&lt;/h1&gt;
&lt;p&gt;Şimdi dilerseniz bu nesne modelli NoSQL sistemine basit&amp;ccedil;e merhaba demeye &amp;ccedil;alışalım. Bunun i&amp;ccedil;in ilk olarak &amp;uuml;r&amp;uuml;n&amp;uuml; download etmeliyiz.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Kurulum sonrası olduk&amp;ccedil;a detaylı bir Tutorial d&amp;ouml;k&amp;uuml;manı da gelmektedir. Bu, &amp;ouml;zellikle geliştiriciler a&amp;ccedil;ısından son derece &amp;ouml;nemlidir. Offline olarak da y&amp;uuml;klenen dok&amp;uuml;mantasyon zengin &amp;ouml;rnek i&amp;ccedil;eriklerine sahiptir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/db4o_5.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="db4o_5" src="/pics/db4o_5_thumb.png" alt="db4o_5" width="400" height="312" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Aslında bir &amp;uuml;r&amp;uuml;n&amp;uuml;n teknik dok&amp;uuml;mantasyonunun doyurucu olmasının ne kadar &amp;ouml;nemli olduğunu ifade etmemize gerek yok. Fakat daha &amp;ouml;nceden araştırdığımız STSdb gibi &amp;uuml;r&amp;uuml;nlerdeki dok&amp;uuml;mantasyon eksikliğini g&amp;ouml;r&amp;uuml;nce ister istemez bu konuya takılıyoruz.&lt;em&gt;(G&amp;uuml;ncel durumlarını kontrol ediniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Tabi &amp;uuml;r&amp;uuml;n&amp;uuml;n teknik dok&amp;uuml;mantasyonunun bu denli zengin ve doyurucu olmasının başlıca sebeplerinden birisi Commercial lisans ile kullanan referans firmalardır. Biraz zorlayıcı bir neden oluşturduklarını ifade edebiliriz sanırım.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Download işlemi ardından kurulum ger&amp;ccedil;ekleştirildiğinde, geliştirici bilgisayarında aşağıdaki klas&amp;ouml;r yapısının oluştuğu g&amp;ouml;zlemlenebilir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/db4o_1.png"&gt;&lt;img style="display: inline;" title="db4o_1" src="/pics/db4o_1_thumb.png" alt="db4o_1" width="272" height="233" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak projelerimizde &lt;strong&gt;db4o&lt;/strong&gt; veritabanı sistemini kullanmak i&amp;ccedil;in ilgili &lt;strong&gt;dll&lt;/strong&gt; dosyalarının referans edilmesi yeterlidir. Kurulum sonrası oluşan &lt;strong&gt;bin&lt;/strong&gt; klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisinde &lt;strong&gt;.Net Framework 3.5&lt;/strong&gt;, &lt;strong&gt;4.0&lt;/strong&gt;, &lt;strong&gt;Compact Framework 3.5&lt;/strong&gt;, &lt;strong&gt;silverlight 3.0 &lt;/strong&gt;ve &lt;strong&gt;4.0 &lt;/strong&gt;s&amp;uuml;r&amp;uuml;mleri i&amp;ccedil;in, ayrı dizinler i&amp;ccedil;erisinde konuşlandırılmış &lt;strong&gt;Assembly&lt;/strong&gt; dosyaları olduğu g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizi &lt;strong&gt;.Net 4.5&lt;/strong&gt; tabanlı olacak şekilde &lt;strong&gt;Visual Studio 2012&lt;/strong&gt; &amp;uuml;zerinde basit bir &lt;strong&gt;Console &lt;/strong&gt;uygulaması şeklinde geliştireceğiz. Yazacağımız &amp;ouml;rnekler g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında projemize &lt;strong&gt;Db4objects.Db4o &lt;/strong&gt;ve &lt;strong&gt;Db4Objects.Db4o.Linq &lt;/strong&gt;assembly&amp;rsquo; larının referans edilmesi yeterlidir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Nesne veritabanlarının &amp;ouml;z&amp;uuml;nde nesnelerin(Object Instance) yer aldığını vurgulamalıyız &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_81.png" alt="Smile" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;&amp;Ouml;rnek POCO Tiplerinin Oluşturulması&lt;/h1&gt;
&lt;p&gt;Yani bize bir ka&amp;ccedil; &amp;ouml;rnek &lt;strong&gt;POCO&lt;em&gt;(Plain Old CLR Objects)&lt;/em&gt; &lt;/strong&gt;tipi gerekiyor. Bu ama&amp;ccedil;la &lt;strong&gt;Product &lt;/strong&gt;ve &lt;strong&gt;Category &lt;/strong&gt;isimli aşağıdaki sınıfları ele alabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/db4o_3.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="db4o_3" src="/pics/db4o_3_thumb.png" alt="db4o_3" width="241" height="411" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class Product 
{ 
    public int ProductId { get; set; } 
    public string Title { get; set; } 
    public decimal ListPrice { get; set; } 
    public int CategoryId { get; set; } 
    public int StockSize { get; set; }

    public override string ToString() 
    { 
        return string.Format("[{0}]-{1} {2} {3} {4}", ProductId, Title, ListPrice, StockSize, CategoryId); 
    } 
}

class Category 
{ 
    public int CategoryId { get; set; } 
    public string Title { get; set; }

    public override string ToString() 
    { 
        return string.Format("[{0}]-{1}", CategoryId, Title); 
    } 
}&lt;/pre&gt;
&lt;h1&gt;Nesne Eklemek&lt;/h1&gt;
&lt;p&gt;İlk olarak nesne ekleme işlemlerinin nasıl yapılabileceğine bir bakalım. Bu ama&amp;ccedil;la aşağıdaki kod par&amp;ccedil;asından yararlanabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private static void AddSomeObjects() 
{ 
    // Pek &amp;ccedil;ok NoSQL sisteminde olduğu gibi, bir context nesnesine ihtiya&amp;ccedil; vardır. 
    // OpenFile metodu eğer dosya yoksa &amp;uuml;retecek var ise sadece a&amp;ccedil;acaktır 
    // container nesne &amp;ouml;rneğinin i&amp;ccedil;eriği IObjectContainer aray&amp;uuml;z&amp;uuml;(interface) tarafından taşınabilmektedir 
   using (IObjectContainer container = Db4oEmbedded.OpenFile(fileName)) 
    { 
        // bir ka&amp;ccedil; nesne &amp;ouml;rneği ilave edelim. 
        Product mouse = new Product 
        { 
            ProductId = 100, 
            Title = "Optik fare", 
            CategoryId = 1, 
            ListPrice = 40, 
            StockSize = 12 
        }; 
        container.Store(mouse); // Store metodu object tipi ile &amp;ccedil;alışmaktadır. Dolayısıyla herhangibir nesneyi ilave edebiliriz.

        container.Store(new Product 
        { 
            ProductId = 101, 
            Title = "Optik Klavye", 
            CategoryId = 1, 
            ListPrice = 34, 
            StockSize = 16 
        } 
        );

        container.Store(new Product 
        { 
            ProductId = 102, 
            Title = "LCD Monitor 22inch", 
            CategoryId = 2, 
            ListPrice = 155, 
            StockSize = 24 
        } 
        );

        container.Store(new Category 
        { 
             CategoryId=1, 
             Title="&amp;Ccedil;evre &amp;uuml;niteleri" 
        } 
        );

        container.Store(new Category 
        { 
            CategoryId = 2, 
            Title = "Monitorler" 
        } 
        ); 
    } 
}&lt;/pre&gt;
&lt;p&gt;Aslında &amp;ouml;rneğin can alıcı noktaları, &lt;strong&gt;IObjectContainer &lt;/strong&gt;aray&amp;uuml;z&amp;uuml;&lt;em&gt;(Interface)&lt;/em&gt; ve &lt;strong&gt;Store&lt;/strong&gt; metodudur. &lt;strong&gt;Store&lt;/strong&gt; metoduna &lt;strong&gt;object&lt;/strong&gt; tipinden herhangibir nesne &amp;ouml;rneği parametre olarak ge&amp;ccedil;ilebilir. Bu nesneler veri depolama alanına doğrudan yazılacaktır. &lt;strong&gt;OpenFile&lt;/strong&gt; metodu, fiziki dosya yok ise &amp;uuml;retecek, var ise sadece a&amp;ccedil;arak hizmete sunacaktır. Gelelim veri &amp;ccedil;ekme/sorgulama kısmına.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Ekleme işlemleri sonrasında disk &amp;uuml;zerinde bir dosya oluşacaktır. Dosya uzantısının &amp;ouml;zellikle ObjectManager Enterprise aracı a&amp;ccedil;ısından &amp;ouml;nemi vardır. Yab veya db4o şeklinde bir uzantı &amp;ouml;nerilmektedir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;Veri &amp;Ccedil;ekme&lt;/h1&gt;
&lt;p&gt;Bu ama&amp;ccedil;la da aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private static void ReadSomeObjects() 
{ 
    using (IObjectContainer container = Db4oEmbedded.OpenFile(fileName)) 
    { 
        #region Bir nesne &amp;ouml;rneği yardımıyla sorgulamak

        // &amp;Ouml;zellikleri varsayılan değerlere atanmış bir nesne &amp;ouml;rneği QBE tekniğine g&amp;ouml;re sorgulama i&amp;ccedil;in kullanılabilir 
        Product refProd = new Product(); 
        // QueryByExample metodu IObjectSet tarafından taşınabilir bir i&amp;ccedil;erik d&amp;ouml;nd&amp;uuml;rmektedir. 
        // Ancak i&amp;ccedil;erik object tipinden d&amp;ouml;nd&amp;uuml;ğ&amp;uuml;nden, iterasyon sırasında ilerlenirken nesne &amp;ouml;rneğinin belirgin &amp;ouml;zelliklerine erişilemez. 
        IObjectSet resultSet = container.QueryByExample(refProd); 
        foreach (var r in resultSet) 
            Console.WriteLine(r.ToString());

        #endregion

        #region Bir nesnenin tipinden yararlanarak sorgulamak

        Console.WriteLine("\nT&amp;uuml;m kategoriler\n");

        // Query&amp;lt;T&amp;gt; metoduna parametre olarak bir nesne tipi verilerek, Storage i&amp;ccedil;erisinde o tipe ait nesne &amp;ouml;rneklerinin sorgulanması sağlanabilir 
        // &amp;Uuml;stelik Query metodu geriye IList&amp;lt;T&amp;gt; d&amp;ouml;neceğinden, sonu&amp;ccedil; k&amp;uuml;mesinde gezinirken T tipinin &amp;ouml;zelliklerine erişebilmek te m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. 
        IList&amp;lt;Category&amp;gt; categories = container.Query&amp;lt;Category&amp;gt;(typeof(Category)); 
        foreach (var r in categories) 
            Console.WriteLine(r.Title);

        #endregion Bir nesnenin tipinden yararlanarak sorgulamak

        #region Nesnenin bir &amp;ouml;zelliğinin belirgin bir değerine g&amp;ouml;re sorgulamak 
        Console.WriteLine("\nKategorisi 2 olan &amp;uuml;r&amp;uuml;nler\n");

        // B&amp;ouml;yle bir durumda QBE tekniği kullanılacaksa bir nesne &amp;ouml;rneği oluşturulmalı ve ilgili kritere konu olan &amp;ouml;zelliğin/&amp;ouml;zelliklerin değerleri atanmalıdır 
        resultSet = container.QueryByExample(new Product { CategoryId = 2 }); 
        foreach (var r in resultSet) 
            Console.WriteLine(r.ToString());

        #endregion Nesnenin bir &amp;ouml;zelliğinin belirgin bir değerine g&amp;ouml;re sorgulamak

        #region LINQ sorgusu kullanmak

        Console.WriteLine("\nStok değeri 12 birim ve altında olan &amp;uuml;r&amp;uuml;nler\n"); 
        // Dikkat edilmesi gereken noktalardan birisi de Db4Objects.Db4o.Linq assembly' ının referans edilmesi gerekliliğidir. 
        // Diğer yandan using kımsında System.Linq satırının da kaldırılmaması gerekir. 
        var products = from Product p in container.AsQueryable&amp;lt;Product&amp;gt;()    
                       where p.StockSize&amp;lt;=12 
                       select p; 
        foreach (var product in products) 
            Console.WriteLine(product.ToString());

        #endregion LINQ sorgusu kullanmak 
    } 
}&lt;/pre&gt;
&lt;p&gt;Veri sorgulama işleminde kullanılabilen bir ka&amp;ccedil; y&amp;ouml;ntem vardır. Bunlardan birisi &lt;strong&gt;QBE&lt;/strong&gt; olarak kısaltılan &lt;strong&gt;Query By Example&lt;/strong&gt;&amp;rsquo; dır. Bu tekniğe g&amp;ouml;re &lt;strong&gt;IObjectContainer&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; &amp;uuml;zerinden &amp;ccedil;ağırılan &lt;strong&gt;QueryByExample&lt;/strong&gt; metoduna bir nesne &amp;ouml;rneğinin g&amp;ouml;nderilmesi gerekmektedir. Aranan kriterleri taşıyan bir sınıf &amp;ouml;rneğini kullanılabilir. D&amp;ouml;n&amp;uuml;ş tipi &lt;strong&gt;IObjectSet&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; tarafında taşınabilmektedir. Tek dezavantaj, &lt;strong&gt;object&lt;/strong&gt; tipinin d&amp;ouml;n&amp;uuml;ş&amp;uuml; s&amp;ouml;z konusu olduğundan belirli nesne &amp;ouml;zelliklerinin bilinmiyor oluşudur ki bu durum intelli-sense noktasında da kendisini g&amp;ouml;sterir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Burada dikkat edilmesi gereken hususlardan birisi de, Product nesne &amp;ouml;rneğinin varsayılan yapıcı metod ile oluşturulması halinde, QueryByExample metodunun, veri k&amp;uuml;mesi i&amp;ccedil;erisindeki t&amp;uuml;m Product nesne &amp;ouml;rneklerini d&amp;ouml;nd&amp;uuml;recek olmaslıdır.&lt;/p&gt;
&lt;p&gt;Nitekim QueryByExample &amp;ccedil;ağrısının bir diğer kullanımında yer alan Product nesne &amp;ouml;rneğinde, CategoryId &amp;ouml;zelliğine 2 değeri verilmiş ve bu nedenle de 2 numaralı kategoride bulunan Product nesne &amp;ouml;rneklerinin listesi elde edilmiştir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;Query&amp;lt;T&amp;gt;&lt;/strong&gt; metodu ise &lt;strong&gt;T &lt;/strong&gt;tipinden &lt;strong&gt;IList &lt;/strong&gt;i&amp;ccedil;eriğinin d&amp;ouml;nmesine neden olmaktadır. Bu sebepten tip g&amp;uuml;venlidir&lt;em&gt;(Type Safe)&lt;/em&gt;. Parametre olarak, arama kriterine dahil olacak tipi alır. &amp;Ouml;rnekte &lt;strong&gt;Category&lt;/strong&gt; sınıfının tipi &lt;strong&gt;typeof &lt;/strong&gt;operat&amp;ouml;r&amp;uuml; yardımıyla belirtilmiştir.&lt;/p&gt;
&lt;p&gt;Arama işlemlerinde &lt;strong&gt;.Net&lt;/strong&gt; geliştiricilerine daha yakın gelen teknik ise elbette &lt;strong&gt;LINQ&lt;/strong&gt; ifadelerinin kullanıldığı senaryodur. &lt;strong&gt;LINQ&lt;/strong&gt; sorgularında dikkat edilmesi gereken nokta, &lt;strong&gt;Db4objects.Db4o.Linq.dll&lt;/strong&gt; assembly&amp;rsquo; ının projeye referans edilmesi gerekliliğidir. Ayrıca, &lt;strong&gt;IObjectContainer&lt;/strong&gt; varsayılan olarak sorgulanabilir bir referans &lt;span style="text-decoration: underline;"&gt;sunmamaktadır&lt;/span&gt;. Bu nedenle &lt;strong&gt;AsQueryable&amp;lt;T&amp;gt;&lt;/strong&gt; metoduna başvurulur. &lt;strong&gt;LINQ &lt;/strong&gt;ifadelerinin yazılabilmesi ve derlenmesi i&amp;ccedil;inse mutlaka &lt;strong&gt;System.Linq&lt;/strong&gt; isim alanının &lt;strong&gt;using &lt;/strong&gt;kısmında yer alması gerekir.&lt;/p&gt;
&lt;p&gt;Uygulamanın bu kod par&amp;ccedil;ası kullanıldığında aşağıdakine benzer bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşılır.&lt;em&gt;(Nesne ekleme işlemlerinin yapıldığını varsayıyoruz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/db4o_4.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="db4o_4" src="/pics/db4o_4_thumb.png" alt="db4o_4" width="588" height="259" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;h1&gt;Nesne G&amp;uuml;ncellemek&lt;/h1&gt;
&lt;p&gt;Yazımıza bir nesnenin/nesne topluluğunun g&amp;uuml;ncelleme işlemini ele alarak devam edelim. Aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private static void UpdateSomeObject() 
{ 
    using (IObjectContainer container = Db4oEmbedded.OpenFile(fileName)) 
    { 
        #region t&amp;uuml;m &amp;uuml;r&amp;uuml;nlerin fiyatlarını %10 arttıralım

        // G&amp;uuml;ncelleme işlemi i&amp;ccedil;in &amp;ouml;ncelikle g&amp;uuml;ncellenecek nesne &amp;ouml;rneği/ &amp;ouml;rnekleri bulunmalıdır 
        var products = from Product p in container.AsQueryable&amp;lt;Product&amp;gt;() 
                       select p; 
        foreach (var product in products) 
        { 
            product.ListPrice *= 1.10M; 
            // Değişiklik sonrası g&amp;uuml;ncellemenin depolama alanına da yansıması i&amp;ccedil;in yine Store metodundan yararlanılabilir 
            container.Store(product); 
        }

        #endregion t&amp;uuml;m &amp;uuml;r&amp;uuml;nlerin fiyatlarını %10 arttıralım 
    } 
}&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;Store metodu ile hem ekleme hem de g&amp;uuml;ncelleme işlemlerinin tek bir satırda yapılabildiği rahatlıkla g&amp;ouml;zlemlenebilir. Aynı durum silme ve veri &amp;ccedil;ekme operasyonları i&amp;ccedil;in de s&amp;ouml;z konusudur. Bu sebepten db4o, one-line-of-code database olarak da bilinir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;Ouml;rnekte t&amp;uuml;m &amp;uuml;r&amp;uuml;nlerin liste fiyatlarının %10 arttırılması senaryosu ele alınmıştır. Aslında olay gayet basittir. G&amp;uuml;ncellenmek istenen nesne veya nesne topluluğu bir şekilde filtrelenir. Bunun i&amp;ccedil;in bir &amp;ouml;nceki kod par&amp;ccedil;asında yer alan &lt;strong&gt;QBE&lt;/strong&gt; ya da &lt;strong&gt;LINQ&lt;/strong&gt; tekniklerinden yararlanılabilir. Nesnelerin elde edilmesinin ardından ilgili &amp;ouml;zelliklerin&lt;em&gt;(Properties)&lt;/em&gt; değerleri değiştirilir. Sonrasında ise &lt;strong&gt;Store&lt;/strong&gt; metodu kullanılır. &lt;strong&gt;Store&lt;/strong&gt; metodu burada akıllıca davranarak, gelen nesnenin yeni eklenen bir i&amp;ccedil;erik olup olmadığını ve sadece g&amp;uuml;ncellenmesi gerektiğini tespit eder.&lt;/p&gt;
&lt;h1&gt;Peki ya Nesne Silmek&lt;/h1&gt;
&lt;p&gt;Pek tabi silme işlemi de son derece kolaydır. Yine bir filtreleme yapılarak silinmek istenen nesne veya nesne k&amp;uuml;mesinin tespit edilmesi, sonrasında ise &lt;strong&gt;IObjectContainer&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; &amp;uuml;zerinden &lt;strong&gt;Delete&lt;/strong&gt; metodunun &amp;ccedil;ağırılması kafidir. Aynen aşağıdaki kod par&amp;ccedil;asında g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private static void DeleteSomeObjects() 
{ 
    using (IObjectContainer container = Db4oEmbedded.OpenFile(fileName)) 
    { 
        Product product = (from Product p in container.AsQueryable&amp;lt;Product&amp;gt;() 
                           where p.ProductId == 100 
                           select p).FirstOrDefault(); 
        if (product != null) 
            container.Delete(product); 
    } 
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;db4o&lt;/strong&gt; ile &amp;ccedil;alışmak son derece kolaydır. &amp;Uuml;stelik &lt;strong&gt;Visual Studio 2010&lt;/strong&gt; ve &lt;strong&gt;2008&lt;/strong&gt;&amp;rsquo; e entegre olabilen &lt;strong&gt;ObjectManager Enterprise &lt;/strong&gt;arabirimini kullanarak, veri i&amp;ccedil;eriklerini g&amp;ouml;rsel anlamda da y&amp;ouml;netebiliriz. Bu arabirim yardımıyla veritabanının incelenmesi ve daha da &amp;ouml;nemlisi g&amp;ouml;rsel olarak sorgulanması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r&lt;em&gt;(Arabirimde Veritabanına bağlantı kurabilmek i&amp;ccedil;in şartlardan birisi dosya uzantısının yab ya da db4o olması gerekliliğidir)&lt;/em&gt;&lt;/p&gt;
&lt;h1&gt;Visual Studio 2010 Tarafında ObjectManager Enterprise Kullanımı&lt;/h1&gt;
&lt;p&gt;Eğer &lt;strong&gt;ObjectManager&lt;/strong&gt; &lt;strong&gt;Enterprise&lt;/strong&gt; başarılı bir şekilde kurulursa, &lt;strong&gt;Visual&lt;/strong&gt; &lt;strong&gt;Studio&lt;/strong&gt; arabiriminin &lt;strong&gt;Tools&lt;/strong&gt; men&amp;uuml;s&amp;uuml;nde yerini alacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/db4o_x1.png"&gt;&lt;img style="display: inline;" title="db4o_x1" src="/pics/db4o_x1_thumb.png" alt="db4o_x1" width="627" height="275" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bir &lt;strong&gt;db4o&lt;/strong&gt; veri tabanına bağlantı kurmak i&amp;ccedil;in &lt;strong&gt;Connect &lt;/strong&gt;se&amp;ccedil;eneği ile a&amp;ccedil;ılan &lt;strong&gt;Connection Info &lt;/strong&gt;iletişim kutusu kullanılır. İstenirse &lt;strong&gt;Remote&lt;/strong&gt; bağlantı da yapılabilir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/db4o_x2.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="db4o_x2" src="/pics/db4o_x2_thumb.png" alt="db4o_x2" width="433" height="237" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;A&amp;ccedil;ılan pencerelerden &lt;strong&gt;db4o Browser&lt;/strong&gt;&amp;rsquo; a gelindiğinde, dosyaya atılmış olan nesnelerin şemasına ulaşılır. Burada, tiplerin &amp;ouml;zelliklerine ait bilgilere yer verilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/db4o_x3.png"&gt;&lt;img style="display: inline;" title="db4o_x3" src="/pics/db4o_x3_thumb.png" alt="db4o_x3" width="349" height="314" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Diğer yandan her hangibir tipin &amp;uuml;st&amp;uuml;nde sağ tıklanıp &lt;strong&gt;Show All Objects&lt;/strong&gt; se&amp;ccedil;eneği işaretlenirse, ilgili tipe ait t&amp;uuml;m nesne &amp;ouml;rneklerinin listesine ulaşılır. Hatta bu kısımda &amp;ouml;zellik değerlerinin değiştirilmesi ve anında g&amp;uuml;ncellenmesi de m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/db4o_x4.png"&gt;&lt;img style="display: inline;" title="db4o_x4" src="/pics/db4o_x4_thumb.png" alt="db4o_x4" width="630" height="292" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;İstenirse kendi sorgularımızı da &amp;ccedil;alıştırabiliriz. Bunun i&amp;ccedil;in &lt;strong&gt;db4o browser&lt;/strong&gt; penceresinden bir veya daha fazla &amp;ouml;zelliğin se&amp;ccedil;ilerek &lt;strong&gt;Query Builder&lt;/strong&gt; penceresine &lt;strong&gt;s&amp;uuml;r&amp;uuml;klenmesi &lt;/strong&gt;yeterlidir&lt;em&gt;(Bunu keşfetmem&amp;nbsp; biraz zamanımı aldı)&lt;/em&gt; &amp;Ouml;rneğin aşağıdaki ekran &amp;ccedil;ıktısına g&amp;ouml;re, &lt;strong&gt;CategoryId&lt;/strong&gt; &lt;strong&gt;değeri 1 olup StokSize değeri 20den k&amp;uuml;&amp;ccedil;&amp;uuml;k olan Product nesnelerinin&lt;/strong&gt; sorgulanması işlemi ger&amp;ccedil;ekleştirilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/db4o_x5.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="db4o_x5" src="/pics/db4o_x5_thumb.png" alt="db4o_x5" width="637" height="513" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;Visual Studio&lt;/strong&gt; veya &lt;strong&gt;Eclipse&lt;/strong&gt; ile entegre &amp;ccedil;alışan &lt;strong&gt;ObjectManager Enterprise&lt;/strong&gt; yardımıyla veri y&amp;ouml;netimi g&amp;ouml;rsel olarak da sağlanabilmektedir.&lt;/p&gt;
&lt;p&gt;Bu makalemizde &lt;strong&gt;Java&lt;/strong&gt; ve &lt;strong&gt;.Net&lt;/strong&gt; desteği bulanan nesne veritabanlarından &lt;strong&gt;db4o&lt;/strong&gt; &amp;uuml;r&amp;uuml;n&amp;uuml;n&amp;uuml; incelemeye &amp;ccedil;alıştık. &amp;Uuml;r&amp;uuml;n&amp;uuml;n daha pek &amp;ccedil;ok &amp;ouml;nemli yeteneği bulunmakta. Bunun i&amp;ccedil;in doyurucu teknik dok&amp;uuml;mantasyonuna bakmanızı &amp;ouml;neririm. &lt;strong&gt;NoSQL &lt;/strong&gt;&amp;uuml;r&amp;uuml;nlerini ilerleyen yazılarımızda da incelemeye devam ediyor olacağız. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;span style="color: #ff0000;"&gt;[&amp;Ouml;rnek kodlar Visual Studio 2012&amp;rsquo; de geliştirilmiş ancak ObjectManager Enterprise i&amp;ccedil;in Visual Studio 2010 s&amp;uuml;r&amp;uuml;m&amp;uuml;nden yararlanılmıştır. &amp;Uuml;r&amp;uuml;ndeki g&amp;uuml;ncelleştirmeleri takip etmenizi &amp;ouml;neririm.]&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2013%2f1%2fHelloDb4o.zip"&gt;HelloDb4o.zip (459,81 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2013-11-12 21:01:00</pubDate>
  <slug>db4o-Hello-World</slug>
  <tags>
    <tag>db4o</tag>
    <tag>object-database</tag>
    <tag>nosql</tag>
    <tag>not-only-sql</tag>
    <tag>net</tag>
    <tag>c#</tag>
    <tag>java</tag>
    <tag>linq</tag>
    <tag>acid</tag>
    <tag>objectmanager-enterprise</tag>
    <tag>eclipse</tag>
    <tag>store</tag>
    <tag>iobjectcontainer</tag>
    <tag>poco</tag>
  </tags>
  <categories>
    <category>NoSQL</category>
  </categories>
</post>