<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF RIA Services - Alan Bazlı(Field Based) Rol Kontrolü [Beta 2]</title>
  <description>Hani bazen insanın aklına son derece zekice fikirler gelir ya... Wink Sene 1992. Lise öğrencisiyim. Bazı akşamlar yazlığımızdaki odamda üniversiteye hazırlanmaya çalışırdım. Güzel yaz gecelerinde, tertemiz ada ikliminde, mis gibi kokan iyotlu deniz suyunun çok yakınlarında konsantre olmak her ne kadar çok zor olsa da, buna mecburdum. Sealed Odamdaki flöresan ışığını çalışma ortamı için hiç uygun bulmazdım. Bunun yerine sarı ışığı tercih ederdim ve aynen yandaki şekilde görülene benzer bir gece lambam vardı.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f12%2fblg119_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Hani bazen insanın aklına son derece zekice fikirler gelir ya... &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Sene &lt;strong&gt;1992&lt;/strong&gt;. Lise &amp;ouml;ğrencisiyim. Bazı akşamlar yazlığımızdaki odamda &amp;uuml;niversiteye hazırlanmaya &amp;ccedil;alışırdım. G&amp;uuml;zel yaz gecelerinde, tertemiz ada ikliminde, mis gibi kokan iyotlu deniz suyunun &amp;ccedil;ok yakınlarında konsantre olmak her ne kadar &amp;ccedil;ok zor olsa da, buna mecburdum. &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt;&amp;nbsp;Odamdaki fl&amp;ouml;resan ışığını &amp;ccedil;alışma ortamı i&amp;ccedil;in hi&amp;ccedil; uygun bulmazdım. Bunun yerine sarı ışığı tercih ederdim ve aynen yandaki şekilde g&amp;ouml;r&amp;uuml;lene benzer bir gece lambam vardı.&lt;/p&gt;
&lt;p&gt;Aslında lambanın etrafında şık bir k&amp;uuml;re bulunmaktaydı fakat sakarlığıyla bilinen bendeniz onu bir ara kırmıştım. Tabi hal b&amp;ouml;yle olunca ş&amp;ouml;yle bir sorunla karşılaştım. Işık direkt olarak g&amp;ouml;z&amp;uuml;me geliyor ve &amp;ccedil;ok rahatsız ediyordu. &amp;Ccedil;&amp;ouml;z&amp;uuml;m olarak nemi yaptım. Dahiyane bir fikirle &lt;strong&gt;Amerika'&lt;/strong&gt; daki bir arkadaşımın hediye ettiği&amp;nbsp;&lt;strong&gt;Newyork Nicks&lt;/strong&gt;&amp;nbsp;takımının logosunu taşıyan şapkayı, lambanın &amp;uuml;st&amp;uuml;ne g&amp;uuml;zelce yerleştirdim. &amp;Ouml;zellikle ışığın g&amp;ouml;z&amp;uuml;me direkt olarak girmesini engelleyen ama etrafı ve okuduklarımı g&amp;ouml;rmemi sağlayan bir a&amp;ccedil;ıyı d&amp;uuml;ş&amp;uuml;n&amp;uuml;p, &amp;ouml;l&amp;ccedil;&amp;uuml;p bi&amp;ccedil;erek, dikkatlice yerleştirdim. Kendimle gurur duyuyordum. Bu zeka ile &lt;strong&gt;NASA&lt;/strong&gt;'ya bile gidebilirim diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yordum &lt;img title="Tongue out" src="/editors/tiny_mce3/plugins/emotions/img/smiley-tongue-out.gif" alt="Tongue out" border="0" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Ancak gecenin ilerleyen saatlerinde değil &lt;strong&gt;NASA&lt;/strong&gt;, sıradan bir b&amp;ouml;l&amp;uuml;m&amp;uuml; bile kazanmamın zor olduğuna kanaat getirdim. Nitekim amp&amp;uuml;l&amp;uuml;n zaman i&amp;ccedil;erisinde &amp;ccedil;evreye yaydığı aşırı ısıyı tahmin edememiştim. Ancak odanın i&amp;ccedil;erisine bir yanık kokusu yayıldığında bir şeylerin ters gittiğinin farkına varabilmiştim. En nihayetinde g&amp;uuml;zelim şapkanın ortasında kocaman bir yanık izi ve erimiş kumaş par&amp;ccedil;aları ile kala kaldım. Neredeyse koca bir delik a&amp;ccedil;ılmıştı. &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;İşte ge&amp;ccedil;en g&amp;uuml;n yine b&amp;ouml;yle dahiyane bir fikir gelir mi aklıma diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;rken, &lt;strong&gt;WCF RIA Servis&lt;/strong&gt; operasyonlarından d&amp;ouml;nen &lt;strong&gt;Entity&lt;/strong&gt; nesnelerinin alanlarını&amp;nbsp;rol bazlı olarak ele alabilir miyiz diye sorgulamaya başladım. Peki neden b&amp;ouml;yle bir ihtiyacımız&amp;nbsp; olsun? &amp;Ccedil;ok basit bir sebep &amp;ouml;ne s&amp;uuml;rebiliriz. Sunucu tarafındaki&amp;nbsp;servisten d&amp;ouml;nen Entity &amp;ouml;rnekleri i&amp;ccedil;erisindeki alanlarının bazılarının, Login olan kullanıcı tarafından &lt;span style="text-decoration: underline;"&gt;g&amp;ouml;r&amp;uuml;lmemesi&lt;/span&gt; veya &lt;span style="text-decoration: underline;"&gt;kullanılamaması&lt;/span&gt; istenebilir. Malum &lt;strong&gt;DomainService&lt;/strong&gt; tipi i&amp;ccedil;erisinde yer alan operasyonlarda &lt;strong&gt;Login&lt;/strong&gt; olan kullanıcının i&amp;ccedil;erisinde bulunduğu rol elde edilebilmektedir. Buna g&amp;ouml;re sorgunun &amp;uuml;reteceği &amp;ccedil;ıktı i&amp;ccedil;erisine dahil edilecek alanların yetkiye g&amp;ouml;re oluşturulması sağlanabilir...mi acaba?&amp;nbsp;Durumu &amp;ouml;rnek bir senaryo &amp;uuml;zerinden incelersek &amp;ccedil;ok daha anlaşılır olacaktır. &amp;Ouml;ncelikli olarak &lt;strong&gt;AdventureWorks&lt;/strong&gt; veritabanı i&amp;ccedil;erisinde yer alan &lt;strong&gt;SalesOrderDetail&lt;/strong&gt; isimli tabloyu kullanmak istediğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg119_EntityModelLast.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek senaryomuzda &amp;ccedil;ok doğal olarak &lt;strong&gt;Authentication&lt;/strong&gt; alt yapısınında tesis edilmiş olması gerekmektedir. &lt;strong&gt;WCF RIA Service'&lt;/strong&gt; lerinde &lt;strong&gt;Authentication Domain Service &lt;/strong&gt;kullanımından daha &amp;ouml;nceki yazılarımızda bol bol bahsettiğimizden bu detayları atlıyoruz. Ancak &lt;strong&gt;ASP.NET Membership&lt;/strong&gt; tabanlı olarak kurulan &lt;strong&gt;Authentication&lt;/strong&gt; alt yapısı i&amp;ccedil;erisinde testler i&amp;ccedil;in&amp;nbsp;iki rol olduğunu s&amp;ouml;yleyebiliriz. &lt;strong&gt;AuthorizedSalesPerson&lt;/strong&gt; ve &lt;strong&gt;JuniorSalesPerson&lt;/strong&gt;. Senaryomuza g&amp;ouml;re g&amp;uuml;ya &lt;strong&gt;AuthorizedSalesPerson &lt;/strong&gt;rol&amp;uuml;nden gelen kullanıcılar &lt;strong&gt;UnitPriceDiscount&lt;/strong&gt; alanının değerini g&amp;ouml;rebilirken, &lt;strong&gt;JuniorSalesPerson&lt;/strong&gt; rol&amp;uuml;ndeki kullanıcılar g&amp;ouml;remeyecektir. Başlangı&amp;ccedil;ta &lt;strong&gt;AdventureDomainService&lt;/strong&gt; isimli &lt;strong&gt;Domain Service&lt;/strong&gt; sınıfını aşağıdaki gibi d&amp;uuml;zenlediğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace RoleBasedFields.Web
{
    using System.Linq;
    using System.Web.DomainServices;
    using System.Web.DomainServices.Providers;
    using System.Web.Ria;

    [RequiresAuthentication]
    [EnableClientAccess()]
    public class AdventureDomainService 
        : LinqToEntitiesDomainService&amp;lt;AdventureWorksEntities&amp;gt;
    {
        public IQueryable&amp;lt;SalesOrderDetail&amp;gt; GetSalesOrderDetails()
        {
            return (from sod in ObjectContext.SalesOrderDetails
                    select sod).Take(50);
        }
    }
}&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;121317(Y&amp;uuml;z yirmi bir bin &amp;uuml;&amp;ccedil;y&amp;uuml;z on yedi)...SalesOrderDetail tablosunda bu kadar satır bulunmaktadır. Bu satırların tamamını istemci tarafına g&amp;ouml;ndermek performans a&amp;ccedil;ısında tercih &lt;span style="text-decoration: underline;"&gt;edilmemelidir&lt;/span&gt;. Zaten WCF RIA Service' lerin kullanımı ile ilişkili best practices tiyolarında, &amp;uuml;retilen standart sorguların filtreler ile d&amp;uuml;zenlenmesi &amp;ouml;nerilmektedir. En azından d&amp;ouml;nen veri i&amp;ccedil;eriğinin bir g&amp;ouml;zden ge&amp;ccedil;irilerek gerektiğinde performans i&amp;ccedil;in filtrelenmesi d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmelidir. Bu sebepten &amp;ouml;rneğimizde Take genişletme metodundan(Extension Method)&amp;nbsp;yararlanılarak ilk 50 satırın alınması sağlanmıştır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;İlk etapta sunucu tarafındaki operasyonda herhangibir rol kontrol&amp;uuml; yapılmamaktadır. Buna g&amp;ouml;re Login olan bir kullanıcı i&amp;ccedil;in ekran &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg119_Runtime1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ancak &amp;ouml;rnek senaryomuza g&amp;ouml;re &lt;strong&gt;JuniorSalesPerson &lt;/strong&gt;rol&amp;uuml;nde olan &lt;strong&gt;bill&lt;/strong&gt; isimli kullanıcının &lt;strong&gt;UnitPriceDiscount&lt;/strong&gt; alanını g&amp;ouml;rmemesi veya anlamlandıramaması gerekmektedir.&lt;em&gt;(Anlamlandıramamasının ne kadar zor olduğunu biraz sonra anlayacağız)&lt;/em&gt;&amp;nbsp;Buna g&amp;ouml;re&amp;nbsp;sunucu tarafında yer alan operasyonun &amp;ouml;zelleştirilmesi gerekmektedir. Aslında yazımızın ulaşmak istediği tek nokta budur.&amp;nbsp;Peki ama nasıl? &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil;ta istemci ve sunucu tarafında eş olan &lt;strong&gt;SalesOrderDetail&lt;/strong&gt; &lt;strong&gt;Entity &lt;/strong&gt;sınıf bilgisini &amp;ccedil;alışma zamanında değiştirmemiz şu etapta pek m&amp;uuml;mk&amp;uuml;n değildir. Akla ilk gelen y&amp;ouml;ntem result set &amp;ccedil;ekilirken role g&amp;ouml;re g&amp;ouml;sterilmesi istenmeyen alana &amp;ouml;rneğin null değer atanmasını sağlamak olabilir. &lt;em&gt;(Bu konu ile ilişkili olaraktan yaptığım araştırmalarda, blog girdisini hazırladığım tarih itibariyle &lt;a title="Field Level Access with RIA Services" href="http://blogs.msdn.com/brada/archive/2009/12/08/field-level-access-with-ria-services.aspx" target="_blank"&gt;Brad Abrams' ın ilgili yazısında &lt;/a&gt;bu tip bir teknik uygulandığını g&amp;ouml;rd&amp;uuml;m)&lt;/em&gt;&amp;nbsp;Tabi &amp;ouml;rneğimizdeki alan &lt;strong&gt;null&lt;/strong&gt; değer almamaktadır. Buna g&amp;ouml;re belki &lt;strong&gt;-1&lt;/strong&gt; değer atanması sağlanabilir. Ama bu durumdada alan yine g&amp;ouml;r&amp;uuml;lebilir olacaktır. &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;Aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public IQueryable&amp;lt;SalesOrderDetail&amp;gt; GetSalesOrderDetails()
{
	var resultSet = (from sod in ObjectContext.SalesOrderDetails
					 select sod).Take(50);

	foreach (var result in resultSet)
	{
		if (ServiceContext.User.IsInRole("JuniorSalesPerson"))
			result.UnitPriceDiscount = -1;
	}

	return resultSet;
}&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;resultSet&lt;/strong&gt; g&amp;ouml;nderilmeden &amp;ouml;nce her bir satırı taranmakta ve &lt;strong&gt;ServiceContext&lt;/strong&gt; &amp;uuml;zerinden elde edilen g&amp;uuml;ncel kullanıcının rol&amp;uuml;ne bakılarak &lt;strong&gt;UnitPriceDiscount&lt;/strong&gt; alanına &lt;strong&gt;-1 &lt;/strong&gt;değer atanması sağlanmaktadır. Buna g&amp;ouml;re &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı bill isimli kullanıcı i&amp;ccedil;in aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg119_Runtime2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Peki istediğimiz bu muydu?&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Kesinlikle&amp;nbsp;değil. Bizim hayalimiz ilgili alanın istemci tarafından &lt;span style="text-decoration: underline;"&gt;g&amp;ouml;r&amp;uuml;lmemesini&lt;/span&gt; &lt;strong&gt;sunucudaki operasyon &amp;uuml;zerinden&lt;/strong&gt; sağlamaktı. Oysaki &amp;ouml;ğrenebildiğimiz sadece şu oldu; servis tarafındaki operasyondon d&amp;ouml;nen &lt;strong&gt;resultSet&lt;/strong&gt; i&amp;ccedil;eriğindeki veriyi istersek &lt;strong&gt;Login&lt;/strong&gt; olan kullanıcının rol&amp;uuml;ne g&amp;ouml;re değiştirebiliriz. İşte şu anda lambaya koyduğumuz şapkanın delindiğini g&amp;ouml;rmekteyiz. Benim NASA hayalleri yine yalan oldu anlayacağınız.&amp;nbsp;&lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Peki ya &amp;ccedil;&amp;ouml;z&amp;uuml;m?&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;En ideal &amp;ccedil;&amp;ouml;z&amp;uuml;m istemci tarafında kullanıcının rol&amp;uuml;ne g&amp;ouml;re ilgili alanının gizlenmesi olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Ancak buda optimal bir &amp;ccedil;&amp;ouml;z&amp;uuml;m olmayacaktır. Nitekim sunucu tarafında ele alınması gereken g&amp;uuml;venlik konulu bir iş mantığını istemeden istemci tarafına taşımak zorunda kalmış oluruz. Tabi en b&amp;uuml;y&amp;uuml;k sıkıntılardan birisi şudur. Sunucu tarafında bu rol kontrol&amp;uuml;n&amp;uuml; başarabilsek dahi, istemci tarafında g&amp;ouml;nderilecek entity &amp;ouml;rneklerinin dinamik olarak değişebiliyor olması gerekecektir. Olduk&amp;ccedil;a zor bir işlem aslında...&lt;/p&gt;
&lt;p&gt;Anlaşılan bu konuda &lt;strong&gt;WCF RIA Services&lt;/strong&gt; tarafında bir eksiklik var. Bende en ideal &amp;ccedil;&amp;ouml;z&amp;uuml;m i&amp;ccedil;in araştırmalarıma devam ediyorum. Bakalım lambanın &amp;uuml;zerine koyduğumuz şapkadaki deliği kapatabilecek miyiz? Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2010-01-27 02:33:00</pubDate>
  <slug>WCF-RIA-Services-Alan-Bazli(Field-Based)-Rol-Kontrolu</slug>
  <tags>
    <tag>wcf-ria-services</tag>
    <tag>net-ria-services</tag>
    <tag>wcf</tag>
    <tag>wcf-eco-system</tag>
  </tags>
  <categories>
    <category>WCF Eco System</category>
    <category>WCF RIA Services</category>
  </categories>
</post>