<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>DataGrid Denetimi Üzerinde Sayfalama(Paging) İşlemi</title>
  <description>Bugünkü makalemizde, bir ASP.NET sayfasında yer alan DataGrid kontrolümüzde nasıl sayfalama işlemlerini gerçekleştireceğimizi göreceğiz. Uygulamamız, sql sunucusundaki veritabanımızdan bir tablo ile ile ilgili bilgileri ekranda gösterecek. Ancak çok sayıda kayıt olduğu için biz bunları, dataGrid kontrolümüzde 10’ar 10’ar göstereceğiz.</description>
  <content>&lt;p align="left"&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p align="left"&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde, bir ASP.NET sayfasında yer alan DataGrid kontrol&amp;uuml;m&amp;uuml;zde nasıl sayfalama işlemlerini ger&amp;ccedil;ekleştireceğimizi g&amp;ouml;receğiz. Uygulamamız, sql sunucusundaki veritabanımızdan bir tablo ile ile ilgili bilgileri ekranda g&amp;ouml;sterecek. Ancak &amp;ccedil;ok sayıda kayıt olduğu i&amp;ccedil;in biz bunları, dataGrid kontrol&amp;uuml;m&amp;uuml;zde 10&amp;rsquo;ar 10&amp;rsquo;ar g&amp;ouml;stereceğiz. Olayı&amp;nbsp;anlayabilmek i&amp;ccedil;in doğrudan kodlama ile işe başlayalım diyorum. &amp;Ouml;ncelikle VS.NET ile bir ASP.NET Web Application oluşturalım ve WebForm1.aspx sayfamızın adını default.aspx olarak değiştirelim. Şimdi &amp;ouml;ncelikle bir DataGrid nesnesini sayfamıza yerleştirelim ve hi&amp;ccedil; bir &amp;ouml;zelliğini ayarlamayalım. Bunları default.aspx sayfasının html g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml;nde elle kodlayacağız. Şu an i&amp;ccedil;in DataGrid kontrol&amp;uuml;m&amp;uuml;ze ait aspx dataGrid tag'ımızın hali ş&amp;ouml;yledir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:DataGrid id="dgKitap" style="Z-INDEX: 101; LEFT: 56px; POSITION: absolute; TOP: 56px" runat="server"&amp;gt;&amp;lt;/asp:DataGrid&amp;gt;&lt;/pre&gt;
&lt;p align="left"&gt;Şimdi, code-behind kısmında yer alıcak kodları yazalım. Sql sunucumuza bir bağlantı oluşturacağız, Friends veritabanımızda yer alan Kitaplar tablosundaki satırları bir DataTable nesnesine y&amp;uuml;kleyip daha sonra dataGrid kontrol&amp;uuml;m&amp;uuml;ze bağlayacağız. Bunu sağlayacak olan code-behind kodlarımız ise şu şekilde olucaktır;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection conFriends;
SqlDataAdapter da;
DataTable dtKitaplar;

public void Baglan()
{
     conFriends=new SqlConnection("data source=localhost;initial catalog=Friends;integrated security=sspi");
     da=new SqlDataAdapter("select ID,Kategori,Adi,Yazar,BasimEvi,BasimTarihi,Fiyat from kitaplar order by Adi",conFriends);
     dtKitaplar=new DataTable("Tum Kitaplar");
     da.Fill(dtKitaplar);
}
private void Page_Load(object sender, System.EventArgs e)
{
     Baglan();
     dgKitap.AutoGenerateColumns=false; /* DataGrid kontrol&amp;uuml;m&amp;uuml;zde yer alıcak kolonları kendimiz ayarlayacığımız i&amp;ccedil;in bu &amp;ouml;zelliğe false değerini aktardık.*/
     dgKitap.DataSource=dtKitaplar; /*DataGrid kontrol&amp;uuml;m&amp;uuml;ze veri kaynağı olarak dtKitaplar isimli DataTable nesnemizin bellekte işaret ettiği veri k&amp;uuml;mesini g&amp;ouml;steriyoruz.*/
     dgKitap.DataBind(); /* DataGrid kontrol&amp;uuml;ndeki kolonları (bizim yazdığımız ve ayarladığımız kolonları) veri kaynağındaki ilgili alanlara bağlıyoruz.*/
} &lt;/pre&gt;
&lt;p align="left"&gt;Şimdi sayfamızda yer alan DataGrid tag'ındaki d&amp;uuml;zenlemelerimizi yapalım. Burada Columns isimli taglar arasında, dataGrid kontrol&amp;uuml;m&amp;uuml;zde g&amp;ouml;r&amp;uuml;nmesini istediğimiz BoundColumn tipindeki s&amp;uuml;tunları belirleyeceğimiz tagları yazacağız. Bu sayede DataGrid kontrol&amp;uuml;ne ait DataBind metodu &amp;ccedil;ağırıldığında, bizim bu taglarda belirttiğimiz alanlar DataGrid kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n kolonları olacak şekilde ilgili veri alanlarına bağlanacak. Gelin şimdi buradaki d&amp;uuml;zenlemeleri ger&amp;ccedil;ekleştirelim. Unutmadan, kendi DataGrid kolonlarınızı ayarlayabilmeniz i&amp;ccedil;in AutoGenerateColumns &amp;ouml;zelliğine false değerini aktarmanız gerekmektedir. Aksi takdirde ayarladğınız kolonların hemen arkasından, otomatik olarak DataTable'da yer alan t&amp;uuml;m kolonlar tekrardan gelir. Yaptığımız son g&amp;uuml;ncellemeleri ile DataGrid tag'ımızın yeni hali şu şekildedir.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk20_3.gif" alt="" width="639" height="288" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Burada g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, DataGird kontrol&amp;uuml;m&amp;uuml;zde g&amp;ouml;rn&amp;uuml;mesini istediğim tablo alanlarını birer BoundColumn olarak, DataGrid tagları arasına ekledik. Kısaca bahsetmek gerekirse hepsi i&amp;ccedil;in, DataField &amp;ouml;zelliği ile tablodaki hangi alana ait verileri g&amp;ouml;stereceklerini, HeaderText &amp;ouml;zelliği ile s&amp;uuml;tun başlıklarında ne yazacağını, ReadOnly &amp;ouml;zelliği ile sadece okunabilir alanlar olduklarını belirliyoruz.Bu haliyle uygulamamızı &amp;ccedil;alıştırırsak aşağıdakine benzer bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşırız.&lt;img src="/makale/images/mk20_1.gif" alt="" width="565" height="299" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt; Şekil 1.Programın İlk Hali. &lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi kitap listesi uzayıp gitmektedir. Bizim amacımız bu listeyi 10&amp;rsquo;arlı gruplar halinde g&amp;ouml;stermek. Bunun i&amp;ccedil;in yapılacak hareket gayet basit g&amp;ouml;z&amp;uuml;ksede ince bir teknik kullanmamızı gerektiriyor. &amp;Ouml;ncelikle dataGrid kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n, bir takım &amp;ouml;zelliklerini belirlemeliyiz. Bu ama&amp;ccedil;la code-behind kısmında yer alan Page_Load procedure&amp;rsquo;unde bir takım değişiklikler yaptık.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void Page_Load(object sender, System.EventArgs e)
{ 
     if(!Page.IsPostBack) /* Sayfa ilk kez y&amp;uuml;kleniyorsa dataGrid'e ait &amp;ouml;zellikler belirlensin. Diğer y&amp;uuml;klemelerde tekrardan bu işlemler yapılmasın istediğimiz i&amp;ccedil;in...*/
     {
          dgKitap.AllowPaging=true; /* DataGrid kontrol&amp;uuml;m&amp;uuml;zde sayfalama yapılabilmesini sağlıyoruz.*/

          dgKitap.PagerStyle.Mode=PagerMode.NumericPages; /* Sayfalama sistemi sayısal olucak. Yani 1 den başlayıp ka&amp;ccedil; kayıtlık sayfa oluştuysa o kadar sayıda bir buton dizesi dataGrid kontrol&amp;uuml;n&amp;uuml;n en altında yer alıcak.*/

          dgKitap.AutoGenerateColumns=false; /* DataGrid kontrol&amp;uuml;m&amp;uuml;zde yer alıcak kolonları kendimiz ayarlayacığımız i&amp;ccedil;in bu &amp;ouml;zelliğe false değerini aktadık.*/

     }
     Baglan();
     dgKitap.DataSource=dtKitaplar; /*DataGrid kontrol&amp;uuml;m&amp;uuml;ze veri kaynağı olarak dtKitaplar isimli DataTable nesnemizin bellekte işaret ettiği veri k&amp;uuml;mesini g&amp;ouml;steriyoruz.*/
     dgKitap.DataBind(); /* DataGrid kontrol&amp;uuml;ndeki kolonları (bizim yazdığımız ve ayarladığımız kolonları) veri kaynağındaki ilgili alanlara bağlıyoruz.*/
}&lt;/pre&gt;
&lt;p align="left"&gt;Şimdi kodumuzu yeniden &amp;ccedil;alıştırırsak bu kez DataGrid kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;m alt kısmında sayfa linklerinin oluştuğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt; &lt;img src="/makale/images/mk20_2.gif" alt="" width="134" height="23" /&gt; &lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt;Şekil 2. Sayfa Linkleri&amp;nbsp; &lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;Ancak bu linklerden herhangibirine bastığımızda ilgili sayfaya gidemediğimizi aynı sayfanın gerisin geriye geldiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z. İşte pek &amp;ccedil;oğumuzun zorlandığı ve g&amp;ouml;zden ka&amp;ccedil;ırdığı teknik burada kendini g&amp;ouml;sterir. Aslında her şey yolunda g&amp;ouml;z&amp;uuml;kmektedir ve sistem &amp;ccedil;alışmalıdır. Ama &amp;ccedil;alışmamaktadır. Yapacağımız bu sayfalama işlemini ger&amp;ccedil;ekleştirecek bir metod yazmak ve son olarakta bu metodu DataGrid tag'ına yazacağımız OnPageIndexChanges olay procedure'&amp;uuml; ile ilişkilendirmektir. OnPageIndexChanges olayı DataGrid kontol&amp;uuml;nde yer alan sayfalama linklerinden birine basıldığında &amp;ccedil;alışacak kodları i&amp;ccedil;erir. Bu durumda DataGrid tag'ımızın son hali aşağıdaki gibi olur.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk20_4.gif" alt="" width="639" height="294" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şimdide code_behind kısmında Sayfa_Guncelle metodumuzu ekleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Public void Sayfa_Guncelle(object sender , DataGridPageChangedEventArgs e)
{
     dgKitap.CurrentPageIndex=e.NewPageIndex; /* İşte olayı bitiren hamle. CurrentPageIndex &amp;ouml;zelliğine basılan linkin temsil ettiği sayfanın index nosu aktarılıyor. B&amp;ouml;ylece belirtilen sayfaya ge&amp;ccedil;ilmiş oluyor. Ancak iş bununla bitmiyor. Veritabanından verilerin tekrardan y&amp;uuml;klenmesi ve dataGrid kontrol&amp;uuml;m&amp;uuml;ze bağlanması gerekli.*/

     Baglan();
     dgKitap.DataSource=dtKitaplar;
     dgKitap.DataBind();
} &lt;/pre&gt;
&lt;p align="left"&gt;Şimdi uygulamamızı &amp;ccedil;alıştırısak eğer, sayfalar arasında rahat&amp;ccedil;a gezebildiğimizi g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Geldik bir makalemizin daha sonuna, bir sonraki makalemizde, yine DataGrid kontrol&amp;uuml;n&amp;uuml; inceleyeğiz. Bu defa, kolonlar &amp;uuml;zerinden sıralama işlemlerinin nasıl yapıldığını incelemeye &amp;ccedil;alışacağız. Umuyorumki hepiniz i&amp;ccedil;in faydalı bir makale olmuştur. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2003-12-16 12:00:00</pubDate>
  <slug>DataGrid-Denetimi-Uzerinde-Sayfalama(Paging)-Islemi-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>datagrid</tag>
    <tag>paging</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>