<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Windows Servislerine Giriş</title>
  <description>Bu makalemizde windows servislerine kısa bir giriş yapıcak ve en basit haliye bir windows servisinin, .net ortamında nasıl oluşturulacağını incelemeye çalışacağız. Öncelikle Windows Service nedir, ne amaçlarla kullanılır bunu irdelemeye çalışak daha sonra windows servislerinin mimarisini kısaca inceleyeceğiz. Windows servisleri, işletim sisteminde arka planda çalışan, kullanıcı ile etkilişimde bulunduğu herhangibir arayüze sahip olmayan, kaynakların izlenmesi, system olaylarının log olarak tutulması, network erişimlerinin izlenmesi, veritabanları üzerindeki transaction'ların izlenmesi, sistem performansına ati bilgilerin toplanması, sistem hatalarının (system exceptions) , başarısız program denemelerin (failure) vb. gibi geri plan işlemlerinin takip edilmesinde kullanılan, sisteme kayıt edilmiş (register), çalıştırılabilir nesnelerdir.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde windows servislerine kısa bir giriş yapıcak ve en basit haliye bir windows servisinin, .net ortamında nasıl oluşturulacağını incelemeye &amp;ccedil;alışacağız. &amp;Ouml;ncelikle Windows Service nedir, ne ama&amp;ccedil;larla kullanılır bunu irdelemeye &amp;ccedil;alışak daha sonra windows servislerinin mimarisini kısaca inceleyeceğiz.&lt;/p&gt;
&lt;p&gt;Windows servisleri, işletim sisteminde arka planda &amp;ccedil;alışan, kullanıcı ile etkilişimde bulunduğu herhangibir aray&amp;uuml;ze sahip olmayan, kaynakların izlenmesi, system olaylarının log olarak tutulması, network erişimlerinin izlenmesi, veritabanları &amp;uuml;zerindeki transaction'ların izlenmesi, sistem performansına ati bilgilerin toplanması, sistem hatalarının (system exceptions) , başarısız program denemelerin (failure) vb. gibi geri plan işlemlerinin takip edilmesinde kullanılan, sisteme kayıt edilmiş (register), &amp;ccedil;alıştırılabilir nesnelerdir.&lt;/p&gt;
&lt;p&gt;Aslında, windows NT,2000,XP yada 2003 kullanıcısı iseniz, windows servisleri ile mutlaka ilgilenmişsinizdir. Sistemlerimizde &amp;ccedil;alışan pek &amp;ccedil;ok servis vardır. Bu servislerin neler olduğuna, Administrative Tool b&amp;ouml;l&amp;uuml;m&amp;uuml;nde Services kısmından bakabiliriz. &amp;Ouml;rneğin aşağıda XP Professional sisteminde y&amp;uuml;kl&amp;uuml; olan &amp;ouml;rnek servisler yer almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk67_1.gif" alt="" width="591" height="391" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 1. Win XP i&amp;ccedil;in &amp;Ouml;rnek Windows Servisleri&lt;/p&gt;
&lt;p&gt;İşte biz, .net sınıflarını kullanarak, burada yer alacak windows servisleri yazma imkanına sahibiz. Windows Servislerinin mimari yapısı aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk67_2.gif" alt="" width="576" height="165" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 2. Windows Servis Mimarisi&lt;/p&gt;
&lt;p&gt;Mimariden kısaca bahsetmek gerekirse; Service Application (Servis Uygulaması) , istenilen fonksiyonelliklere sahip bir veya daha fazla windows servisini i&amp;ccedil;eren bir uygulamadır. Servis Kontrol Uygulaması (Service Controller Application) ise, servislerin davranışlarını kontrol eden bir uygulamadır. Son olarak, SCM, sistemde y&amp;uuml;kl&amp;uuml; olan servislerin kontrol edilmesini sağlayan bir windows aracıdır. Dolayısıyla biz, bir windows servis uygulaması yazarken, bunun i&amp;ccedil;erisine birden fazla servis koyabiliriz. Bu servis uygulaması ve başka servis uygulamalarının davranışlarını servis kontrol uygulamaları yardımı ile kontrol edebiliriz. Diğer yandan, yazmış olduğumuz t&amp;uuml;m servis uygulamaları ile birlikte sistemdeki servisleri, SCM aracılığıyla y&amp;ouml;netebiliriz.&lt;/p&gt;
&lt;p&gt;.Net Framework, windows servislerini oluşturabilmemiz i&amp;ccedil;in gerekli sınıfları i&amp;ccedil;eren System.ServiceProcess isim alanına (namespace) sahiptir. Bu isim alanındaki sınıfları kullanarak, bir servisi oluşturabilir, sisteme y&amp;uuml;kleyebilir, y&amp;uuml;r&amp;uuml;tebilir ve kontrol edebiliriz. Aşağıdaki şekil, basit olarak, ServiceProcess isim alanındaki sınıflar ile yapabileceklerimizi temsil etmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk67_3.gif" alt="" width="547" height="237" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 3. System.ServiceProcess isim alanındaki sınıflar ile yapabileceklerimiz.&lt;/p&gt;
&lt;p&gt;Buradaki sınıflar yardımı ile bir windows servisi oluşturmak istediğimizde izlememiz gereken bir yol vardır. &amp;Ouml;ncelikle, servisi oluşturmamız gerekir (Create) . Bunun i&amp;ccedil;in ServiceBase sınıfını kullanırız. ServiceBase sınıfında yer alan metodlar yardımıyla, bir windows servisini oluşturabiliriz. Oluşturulan bu servisin daha sonra, kullanılabilmesi i&amp;ccedil;in sisteme install edilmesi ve register olması gerekmektedir. Bu noktada devreye ServiceInstaller ve ServiceProcessInstaller sınıfları girer. Bir windows servis uygulamasını install etmeden &amp;ouml;nce, bu servis i&amp;ccedil;in bir iş par&amp;ccedil;acığı(process) oluşturulmalı ve y&amp;uuml;klenmelidir. İşte bu noktada devreye ServiceProcessInstaller girer. ServiceInstaller ve ServiceProcessInstaller sınıfları aslında bir servisin sisteme y&amp;uuml;klenebilmesi i&amp;ccedil;in gerekli metodları otomatik olarak sağlarlar. Ancak bu sınıfların uygulandığı bir windows servis uygulamasının tam olarak sisteme y&amp;uuml;klenmesi ve Services kısmında g&amp;ouml;r&amp;uuml;lebilmesi i&amp;ccedil;in, InstallUtil isimli .net aracı kullanılır ve oluşturulan windows servis uygulaması sisteme y&amp;uuml;klenir.&lt;/p&gt;
&lt;p&gt;Sisteme y&amp;uuml;klenmiş olan servislerin kontrol edilebilmesi amacıyla, ServiceController sınıfındaki metodları kullanabiliriz. Yani, bir servisin Start, Stop, Pause, Continue gibi dabranışlarını kontrol edebiliriz. Bu ama&amp;ccedil;la SCM aracını kullanabileceğimiz gibi, ServiceController sınıfındaki metodlarıda kullanabilir ve b&amp;ouml;ylece herhangibir uygulamdan bir servisi başlatabilir, durdurabilir vb. işlemlerini ger&amp;ccedil;ekleştirebiliriz.&lt;/p&gt;
&lt;p&gt;Bir windows servisinin oluşturulması, sisteme y&amp;uuml;klenmesi , y&amp;uuml;r&amp;uuml;t&amp;uuml;lmesi ve kontrol edilmesi her nekadar karışık g&amp;ouml;r&amp;uuml;nsede, vs.net burada gereksinimin duyduğumuz işlemlerin &amp;ccedil;oğunu bizim i&amp;ccedil;in otomatik olarak yapmaktadır. Windows servislerinin oluşturulmasında kullanılan System.ServiceProcess isim alanının yanında, servislerin durumunun izlenebilmesi, &amp;ccedil;eşitli performans kriterlerinin servis i&amp;ccedil;erisinden kontrol edilebilmesi, sisteme ait logların servis i&amp;ccedil;erisinde kullanılabilmesi gibi işlemleri ger&amp;ccedil;ekleştirebileceğimiz sınıfları i&amp;ccedil;eren System.Diagnostics isim alanıda vardır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk67_4.gif" alt="" width="217" height="237" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 4. System.Diagnostics isim alanı sınıfları.&lt;/p&gt;
&lt;p&gt;Bir windows servis uygulaması ile normal bir vs.net uygulaması arasında belirgin farklılıklar vardır. Herşeyden &amp;ouml;nce bir windows servis uygulamasının kullanılabilmesi i&amp;ccedil;in, sisteme install edilmesi ve register olması gereklidir. Diğer &amp;ouml;nemli bir farkta, bir windows servis uygulaması arka planda &amp;ccedil;alışırken, bu servisin &amp;ccedil;alışması ile ilgili oluşabilecek hatalardır. Normal bir windows uygulamasında hatalar sistem tarafından kullanıcıya bir mesaj kutusu ile g&amp;ouml;sterilebilir yada program i&amp;ccedil;erisindeki hata kontrol mekanizmaları sayesinde g&amp;ouml;rsel olarak izlenebilir. Oysa bir windows servis uygulaması &amp;ccedil;alışırken meydana gelen hatalar, event log olarak sistemde tutulurlar.&lt;/p&gt;
&lt;p&gt;Windows servisleri ile ilgili bu kısa bilgilerin ardından, dilerseniz birlikte basit bir windows servis uygulaması geliştirelim. Bunun i&amp;ccedil;in ilk yapmamız gereken vs.net ortamında, bir windows service applicaiton projesi a&amp;ccedil;maktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk67_5.gif" alt="" width="531" height="371" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 5. Windows Servis Uygulaması A&amp;ccedil;mak.&lt;/p&gt;
&lt;p&gt;Bu işlemi ger&amp;ccedil;ekleştirdiğimizde, vs.net herhangibir kullanıcı aray&amp;uuml;z&amp;uuml; olmayan bir proje oluşturacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk67_6.gif" alt="" width="608" height="274" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 6 . Windows Servis Uygulaması ilk oluşturulduğunda ekranın g&amp;ouml;rn&amp;uuml;m&amp;uuml;.&lt;/p&gt;
&lt;p&gt;Servis uygulamasını geliştirmek i&amp;ccedil;in yazacağımız kodlara ge&amp;ccedil;mek i&amp;ccedil;in, to switch to code windows linkine tıklamamız gerekiyor. Bu durumda vs.net tarafından otomatik olarak oluşturulmuş kodları g&amp;ouml;r&amp;uuml;r&amp;uuml;z. İlk dikkat &amp;ccedil;ekici nokta, Service1 isimli sınıfın ServiceBase sınıfından t&amp;uuml;retilmiş olmasıdır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Service1 : System.ServiceProcess.ServiceBase&lt;/pre&gt;
&lt;p&gt;ServiceBase sınıfı OnStart, OnStop, OnPause, OnContinue gibi bir takım metodlar i&amp;ccedil;eren bir sınıftır. Bir windows servisi oluşturulurken bu servis sınıfının, ServiceBase sınıfından t&amp;uuml;retilmesinin sebebi, bahsetmiş olduğumuz metodların, servis sınıfı i&amp;ccedil;erisinde override edilmeleridir. Bir servis SCM tarafından yada windows i&amp;ccedil;inden başlatıldığında, servisin başlatıldığında dair start mesajı gelir. İşte bu noktada servisin OnStart metodundaki kodlar devreye girer. Aynı durum benzer şekilde, OnStop olayı i&amp;ccedil;inde ge&amp;ccedil;erlidir. T&amp;uuml;m bu metodlar ve başka &amp;uuml;yeler temel sınıf olan ServiceBase sınıfı i&amp;ccedil;erisinde toplanmıştır. Bunun sonucu olarak, bir sınıfı servis olarak tanımlamışsak, ServiceBase sınıfından t&amp;uuml;retir b&amp;ouml;ylece servis başlatıldığında, durdurulduğunda vb. olaylarda yapılmasını istediğimiz işlemleri, t&amp;uuml;reyen sınıfta bu davranışların tetiklediği, OnStart, OnStop gibi metodları override ederek ger&amp;ccedil;ekleştirebiliriz.&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil; itibariyle vs.net, bir servis uygulaması oluşturduğumuzda, buradaki varsayılan servisi, ServiceBase sınıfından t&amp;uuml;retir ve otomatik olarak OnStart ve OnStop metodlarını aşağıdaki şekilde ekler.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected override void OnStart(string[] args)
{
}

protected override void OnStop()
{
}&lt;/pre&gt;
&lt;p&gt;Peki bu metodlar ne zaman ve ne şekilde &amp;ccedil;alışır. Bir windows servisinin, normal windows uygulamalarında olduğu gibi desteklediği olaylar vardır. Windows servisleri 4 olayı destekler. Bir windows servisinde meydana gelen olayların &amp;ccedil;alışma şekli aşağıdaki şekildeki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk67_7.gif" alt="" width="331" height="462" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 7. Servis Olaylarının Ele Alınış Mekanizması.&lt;/p&gt;
&lt;p&gt;Buradan g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, sistemde, yazmış olduğumuz windows servisi ile ilgili olarak 4 olay meydana gelebilir. Bunlar Start, Stop, Pause ve Continue olaylarıdır. Bir servis SCM tarafından başlatıldığında bu servis i&amp;ccedil;in Start olayı meydana gelir. Daha sonra SCM, servisin i&amp;ccedil;inde bulunduğu Servis Uygulamasına Start komutunu g&amp;ouml;nderir. Buna karşılık servis uygulaması i&amp;ccedil;indeki ilgili servis bu Start komutunu alır ve karşılığında, OnStart metodunda yazan kodları &amp;ccedil;alıştırır.&lt;/p&gt;
&lt;p&gt;Diğer yandan bir servis durdurulduğunda, Stop olayı meydana gelir. Ancak bu noktada SCM Start tekniğinden farklı olarak hareket eder. SCM &amp;ouml;nce oluşan olayın sonucunda ilgili servis uygulaması i&amp;ccedil;indeki servisin, CanStop &amp;ouml;zelliğine bakar. CanStop &amp;ouml;zelliği true veya false değer alabilen bir &amp;ouml;zelliktir ve servisin durdurulup durdurulamıyacağını dolayısıyla, bir Stop olayı meydana geldiğinde, servise ati OnStop metodunun &amp;ccedil;alıştırılıp &amp;ccedil;alıştırılamıyacağını belirtir. SCM bu nedenle Stop olayı meydana geldiğinde ilk olarak bu &amp;ouml;zelliği kontrol eder. Eğer &amp;ouml;zellik değeri true ise, servise Stop komutunu g&amp;ouml;nderir ve sonu&amp;ccedil; olarak OnStop metodundaki kodlar &amp;ccedil;alıştırılır.&lt;/p&gt;
&lt;p&gt;Stop tekniğinde ger&amp;ccedil;ekleşen &amp;ouml;zellik kontrol işlemi, Pause ve Continue olayları i&amp;ccedil;inde ge&amp;ccedil;erlidir. Bu kez SCM, servisin CanPauseAndContinue &amp;ouml;zelliğinin boolean değerine bakar. Eğer bu değer true ise, servise Pause komutunu veya Continue komutunu g&amp;ouml;nderir ve bunlara bağlı olan OnPause ve OnContinue metodlarındaki kodların &amp;ccedil;alıştırılmasını sağlar. Pause olayı bir servis duraklatıldığında oluşur. Continue olayı ise, pause konumunda olan bir servis tekrar &amp;ccedil;alışmasına devam etmeye başladığında oluşur.&lt;/p&gt;
&lt;p&gt;Bir diğer &amp;ouml;nemli nokta oluşturulan service1 isimli sınıfın main metodundaki kodlardır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main()
{
    System.ServiceProcess.ServiceBase[] ServicesToRun;
    ServicesToRun = new System.ServiceProcess.ServiceBase[] { new Service1() };
    System.ServiceProcess.ServiceBase.Run(ServicesToRun);
}&lt;/pre&gt;
&lt;p&gt;Burada g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ServiceBase sınıfı tipinden bir nesne dizisi tanımlanmış ve varsayılan olarak bu nesne dizisinin ilk elemanı Service1 ismi ile oluşturulmuştur. Bu aslında bir servis uygulamasının birden fazla windows servisini i&amp;ccedil;erebileceğinide g&amp;ouml;stermektedir. Burada ServiceBase sınıfı tipinden bir nesne dizisinin tanımlanmasının nedenide budur. Zaten oluşturduğumuz Service1 sınıfı, ServiceBase sınıfından t&amp;uuml;retildiği i&amp;ccedil;in ve sahip olduğu temel sınıf metodlarıda bu t&amp;uuml;reyen sınıf i&amp;ccedil;erisinde override edildiği i&amp;ccedil;in, polimorfizmin bir gereği olarak, servis nesnelerini bir ServiceBase tipinden dizide tutmak son derece mantıklı ve kullanışlıdır.&lt;/p&gt;
&lt;p&gt;Son satıra gelince. ServiceBase sınıfının Run metodu, parametre olarak aldığı serviseleri, SCM tarafından başlatılmış iseler, belleğe y&amp;uuml;klemekle g&amp;ouml;revli bir metoddur. Elbette servislerin belleğe Run metodu ile y&amp;uuml;klenebilmesi i&amp;ccedil;in, &amp;ouml;ncelikle Start komutu ile başlatılmaları gerekmektedir. ServiceBase.Run metodu aslında normal bir windows uygulamasındaki Application.Run metodu ile aynı işlevselliği g&amp;ouml;sterir.&lt;/p&gt;
&lt;p&gt;Şu ana kadar oluşturduklarımız ile bir servisin omurgasını meydana &amp;ccedil;ıkardık. Ancak halen servisimiz herhangibir işlem yapmamakta. Oysaki bir servis ile, &amp;ouml;rneğin, sistemdeki aygıt s&amp;uuml;r&amp;uuml;c&amp;uuml;lerine ait olay log'larını, d&amp;uuml;ş&amp;uuml;k bellek kullanımı sonucu yazılım veya donanım ekipmanlarında meydana gelebilecek hata (error), istisna(exception), warning(uyarı) gibi bilgilere ait log'ları izleyebiliriz.&lt;/p&gt;
&lt;p&gt;Şimdi dilerseniz ilk yazdığımız servis ile Uygulama Log'larının (Application Log) nasıl tutulduğunu incelemeye &amp;ccedil;alışalım. Aslında bizim izleyebileceğimiz &amp;uuml;&amp;ccedil; tip log vardır. Bunlar, System Log'ları, Application Log'ları ve Security Log'larıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk67_8.gif" alt="" width="410" height="225" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 8. Olay Log'larının T&amp;uuml;rleri.&lt;/p&gt;
&lt;p&gt;Normal şartlar altında, vs.net ortamında bir windows servis ilk kez oluşturulduğunda, servise ait AutoLog &amp;ouml;zelliği değeri true olarak gelir. Bu durumda Start,Stop,Pause ve Continue olayları meydana geldiğinde, servis sisteme kurulduğunda veya sistemden kaldırıldığında, servis uygulamasına ait loglar, Application Log'a otomatik olarak yazılırlar. Biz bu uygulamamızda kendi &amp;ouml;zel loglarımızı tutmak istediğimizden bu &amp;ouml;zelliğin değerini false olarak belirliyoruz.&lt;/p&gt;
&lt;p&gt;Kendi olay loglarımızı yazabilmemiz i&amp;ccedil;in, EventLog nesnelerine ihtiyacımız vardır. EventLog nesneleri System.Diagnostics isim alanında yer alan EventLog sınıfı ile temsil edilirler. Bu nedenle uygulamızda &amp;ouml;ncelikle bir EventLog nesne &amp;ouml;rneği oluşturmalıyız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private System.Diagnostics.EventLog OlayLog;&lt;/pre&gt;
&lt;p&gt;Bir EventLog nesnesi oluşturduktan sonra, bu nesne &amp;uuml;zerinden CreateEventSource metodunu kullanarak servisimiz i&amp;ccedil;in bir event log oluşturabiliriz. Buna ilişkin kodları OnStart metodu i&amp;ccedil;ine yazarsak, servis başlatıldığında oluşturduğumuz log bilgilerininde otomatik olarak yazılmasını sağlamış oluruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected override void OnStart(string[] args)
{
    OlayLog=new EventLog(); /* EventLog nesnemizi olusturuyoruz.*/

    if(!System.Diagnostics.EventLog.SourceExists("Kaynak")) 
    {
        System.Diagnostics.EventLog.CreateEventSource("Kaynak","Log Deneme"); /* Ilk parametre ile, Log Deneme ismi altinda tutulacak Log bilgilerinin kaynak ismi belirleniyor. Daha sonra bu kaynak ismi OlayLog isimli nesnemizin Source &amp;ouml;zelligine ataniyor.*/
    }
    OlayLog.Source="Kaynak";
    OlayLog.WriteEntry("Servisimiz baslatildi...",EventLogEntryType.Information); /* Log olarak ilk parametrede belirtilen mesaj yazilir. Log'un tipi ise ikinci parametrede g&amp;ouml;r&amp;uuml;ld&amp;uuml;g&amp;uuml; gibi Information'dir.*/
}&lt;/pre&gt;
&lt;p&gt;Bu işlemlerin ardından servisimiz i&amp;ccedil;in basit bir g&amp;ouml;revide eklemiş olduk. Şimdi sırada bu servisin sisteme y&amp;uuml;klenmesi var. Bunun i&amp;ccedil;in, daha &amp;ouml;nceden bahsettiğimiz gibi, ServiceProcess.ServiceInstaller ve ServiceProcess.ServiceProcessInstaller sınıflarını kullanmamız gerekiyor. Servis uygulamamız i&amp;ccedil;in bir tane ServiceProcessInstaller sınıfı nesne &amp;ouml;rneğine ve servis&amp;nbsp; uygulaması i&amp;ccedil;indeki her bir servis i&amp;ccedil;inde ayrı ayrı olamak &amp;uuml;zere birer ServiceInstaller nesne &amp;ouml;rneğine ihtiyacımız var. Bu nesne &amp;ouml;rneklerini yazmış olduğumuz servis uygulamasına kolayca ekleyebiliriz. Bunun i&amp;ccedil;in, servisimizin tasarım penceresinde sağ tuşa basıyor ve Add Installer se&amp;ccedil;eneğini tıklıyoruz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk67_9.gif" alt="" width="261" height="273" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 9. Add Installer.&lt;/p&gt;
&lt;p&gt;Bunun sonucu olarak vs.net, uygulamamıza gerekli installer sınıflarını y&amp;uuml;kler.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk67_10.gif" alt="" width="578" height="71" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 10. Installer nesne &amp;ouml;rneklerinin y&amp;uuml;klenmesi.&lt;/p&gt;
&lt;p&gt;Bunun sonucu olarak aşağıda g&amp;ouml;r&amp;uuml;len sınıf uygulamamıza otomatik olarak eklenir. Bu aşamada buradaki kodlar ile fazla ilgilenmiyeceğiz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections;
using System.ComponentModel;
using System.Configuration.Install;

namespace OrnekServis
{
    [RunInstaller(true)]
    public class ProjectInstaller : System.Configuration.Install.Installer
    {
        private System.ServiceProcess.ServiceProcessInstaller serviceProcessInstaller1;
        private System.ServiceProcess.ServiceInstaller serviceInstaller1;
        private System.ComponentModel.Container components = null;

        public ProjectInstaller()
        {
            InitializeComponent();
        }
        protected override void Dispose( bool disposing )
        {
            if( disposing )
            {
                if(components != null)
                {
                    components.Dispose();
                }
            }
            base.Dispose( disposing );
        }
        private void InitializeComponent()
        {
            this.serviceProcessInstaller1 = new System.ServiceProcess.ServiceProcessInstaller();
            this.serviceInstaller1 = new System.ServiceProcess.ServiceInstaller();
            this.serviceProcessInstaller1.Password = null;
            this.serviceProcessInstaller1.Username = null;
            this.serviceInstaller1.ServiceName = "Service1";
            this.Installers.AddRange(new System.Configuration.Install.Installer[] {this.serviceProcessInstaller1,this.serviceInstaller1});

        }
    }
}&lt;/pre&gt;
&lt;p&gt;Ancak servisimizin, Sistemdeki service listesinde nasıl g&amp;ouml;r&amp;uuml;neceğini belirlemek i&amp;ccedil;in, ServiceInstaller nesne &amp;ouml;rneğinin, Display Name &amp;ouml;zelliğini değiştirebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk67_12.gif" alt="" width="404" height="290" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 11. Servisimizin g&amp;ouml;r&amp;uuml;nen adını değiştiriyoruz.&lt;/p&gt;
&lt;p&gt;Diğer taraftan yapmamız gereken bir işlem daha var. ServiceProcessInstaller nesne &amp;ouml;rneğinin Account &amp;ouml;zelliğinin değerini belirlemeliyiz. Bu &amp;ouml;zellik aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len değerlerden birisini alır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk67_13.gif" alt="" width="399" height="289" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 12. Account &amp;Ouml;zelliğinin Alabileceği Değerler.&lt;/p&gt;
&lt;p&gt;Biz bu uygulama i&amp;ccedil;in LocalSystem değerini veriyoruz. Bu, Servis Uygulamamızın sisteme y&amp;uuml;klenirken, sistemdeki kullanıcıların &amp;ouml;zel haklara sahip olmasını gerektirmez. Dolayısıyla sisteme giren her kullanıcının servisi y&amp;uuml;kleme hakkı vardır. Eğer User se&amp;ccedil;eneğini kullanırsak, servisin sisteme y&amp;uuml;klenebilmesi i&amp;ccedil;in ge&amp;ccedil;erli bir kullanıcı adı ve parolanın girilmesi gerekmektedir.&lt;/p&gt;
&lt;p&gt;Artık yazmış olduğumuz servis uygulamsı i&amp;ccedil;in installer'larıda oluşturduğumuza g&amp;ouml;re uygulamamız derleyip, sisteme InstallUtil aracı ile y&amp;uuml;kleyebilir ve register edebiliriz. Bunun i&amp;ccedil;in, servis uygulamamızın exe dosyası ile, InstallUtil aracını aşağıdaki gibi kullanırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk67_11.gif" alt="" width="639" height="470" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 13. InstallUtil aracı yardımıyla bir servisin sisteme y&amp;uuml;klenmesi.&lt;/p&gt;
&lt;p&gt;İşte InstallUtil aracı servisimizi sisteme y&amp;uuml;klerken, servis uygulamamıza eklediğimiz ServiceProcessInstaller ve ServiceInstaller sınıflarını kullanır. Bu işlemin ardından vs.net ortamında, Server Explorer'dan servislere baktığımızda, AServis isimli servisimizin y&amp;uuml;klendiğini ancak hen&amp;uuml;z &amp;ccedil;alıştırılmadığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk67_14.gif" alt="" width="347" height="148" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 14. Servis sisteme y&amp;uuml;klendi.&lt;/p&gt;
&lt;p&gt;Eğer servisin otomatik olarak başlatılmasını istiyorsak, ServiceInstaller nesnesinin StartType &amp;ouml;zelliğini Automatic olarak ayarlamamız yeterli olucaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk67_15.gif" alt="" width="397" height="339" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 15. Servisin Başlatılma Şeklinin Belirlenmesi.&lt;/p&gt;
&lt;p&gt;İstersek servisimizi, yine Server Explorer'dan servis adına sağ tıklayıp a&amp;ccedil;ılan men&amp;uuml;den start komutuna basarak &amp;ccedil;alıştırabiliriz. Servisimizi &amp;ccedil;alıştırdıktan sonra, yine Server Explorer pencersinden Event Logs sekmesine bakarsak, bahsetmiş olduğumuz olay logları haricinde kendi yapmış olduğumuz olay logununda eklendiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk67_16.gif" alt="" width="382" height="128" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 16. Servisin &amp;ccedil;alışmasının sonucu.&lt;/p&gt;
&lt;p&gt;Burada g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Log Deneme ismi ile belirttiğimiz Event Log oluşturulmuş, Source olarak belirttiğimiz Kaynak nesnesi oluşturulmuş ve OnStart metoduna yazdığımız kodlar yardımıyla, mesaj bilgimiz information(bilgi) olarak yazılmıştır. Buraya kadar anlattıklarımız ile bir windows servisinin nasıl yazıldığını ve sisteme y&amp;uuml;klendiğini en temek hatları ile g&amp;ouml;rm&amp;uuml;ş olduk. İlerleyen makalelerimizde, windows servisleri ile ilgili daha farklı uygulamlar geliştirmeye &amp;ccedil;alışacağız. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-04-28 15:00:00</pubDate>
  <slug>Windows-Servislerine-Giris-bsenyurt-com-dan</slug>
  <tags>
    <tag>windows-services</tag>
    <tag>hello-world</tag>
    <tag>c#</tag>
    <tag>windows</tag>
  </tags>
  <categories>
    <category>Windows Services</category>
  </categories>
</post>