<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>GO Ortamında Minik Bir CRUD Servisini Gin-Gonic ile Geliştirmek</title>
  <description>Gin-Gonic hafif siklet sayılan ama yüksek performansı ile öne çıkan(muadili olan martini'den çok daha hızlı olduğu ifade ediliyor) bir HTTP-Web framework. Elbette açık kaynak bir çatı. Middleware tarafında(Yani Request ve Response'lar arasında) Recover ve Log desteği sunuyor. Tabii kendi middleware bileşenimizi yazıp ekleyebiliriz de. Recovery modülü en başından beri ekli olduğundan paniklemeyen bir framework diyebiliriz :) Yani Go çalışma zamanında HTTP talepleri ile ilgili olarak bir panic oluştuğunda uygun bir 500 cevabı verebiliyor.</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/25/gingonic.png" alt="" align="right" /&gt;Gin-Gonic hafif siklet sayılan ama y&amp;uuml;ksek performansı ile &amp;ouml;ne &amp;ccedil;ıkan&lt;em&gt;(Muadili olan martini'den &amp;ccedil;ok daha hızlı olduğu ifade ediliyor. Bu arada farklı Http Web Framework'ler i&amp;ccedil;in &lt;a href="https://deepsource.io/blog/go-web-frameworks/" target="_blank"&gt;şu yazıyı&lt;/a&gt; inceleyebilirsiniz)&lt;/em&gt; bir HTTP-Web framework. Elbette a&amp;ccedil;ık kaynak bir &amp;ccedil;atı. Middleware tarafında&lt;em&gt;(Yani Request ve Response'lar arasında)&lt;/em&gt; Recover ve Log desteği sunuyor. Tabii kendi middleware bileşenimizi yazıp ekleyebiliriz de. Recovery mod&amp;uuml;l&amp;uuml; en başından beri ekli olduğundan paniklemeyen bir framework diyebiliriz :) Yani Go &amp;ccedil;alışma zamanında HTTP talepleri ile ilgili olarak bir panic oluştuğunda uygun bir 500 cevabı verebiliyor.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;ylentilere g&amp;ouml;re bu &amp;ouml;zelliği sayesinde s&amp;ouml;z konusu servis her an ayakta ve &amp;ccedil;alışır durumda kalıyor&lt;em&gt;(muş)&lt;/em&gt;. Bahseliden bu yeteneklere ilaveten y&amp;ouml;nlendirmeleri&lt;em&gt;(routes)&lt;/em&gt; gruplandırabiliyoruz ki bu da &amp;ouml;rneğin versiyonlamayı kolaylaştırıyor. Bu kısa notlar şimdilik yeterli. Sahada deneyimlemek lazım. İşte bu &lt;a href="https://github.com/buraksenyurt/skynet" target="_blank"&gt;SkyNet&lt;/a&gt; derlemesindeki amacımız MongoDb &amp;uuml;zerinde basit CRUD&lt;em&gt;(Create Read Update Delete)&lt;/em&gt; işlemlerini yaparken gin-gonic &amp;uuml;st&amp;uuml;ne kurulmuş golang tabanlı bir servis geliştirmek. Tahmin edeceğiniz &amp;uuml;zere ben &amp;ouml;rneği Heimdall&lt;em&gt;(Ubuntu-20.04)&lt;/em&gt; &amp;uuml;st&amp;uuml;nde geliştiriyorum. MongoDb tarafı i&amp;ccedil;inde bir Docker imajını kullanmayı tercih edeceğim.&lt;em&gt;&amp;nbsp;&lt;/em&gt;Dilerseniz vakit kaybetmeden idmanımıza başlayalım. İşte ilk terminal adımlarımız.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# Ana klas&amp;ouml;r&amp;uuml;m&amp;uuml;z ve gerekli go dosyaları oluşturulur
mkdir book-worm-api
cd book-worm-api
touch main.go

# gin-gonic ve diğer mod&amp;uuml;llerin y&amp;ouml;netimi i&amp;ccedil;in
# mod uzantılı bir dosya oluşacaktır. Burada y&amp;uuml;klediğimiz paket bilgilerini g&amp;ouml;rebiliriz. 
# Genel isimlendirme standardı olarak github.com/buraksenyurt/book-worm-api kullanımı da tercih edilebilir
go mod init book-worm-api

# gin-gonic ve mongodb i&amp;ccedil;in gerekli go paketlerinin y&amp;uuml;klenmesi
go get -u github.com/gin-gonic/gin go.mongodb.org/mongo-driver

# MongoDB tarafıyla eşlecek entity i&amp;ccedil;in
touch quote.go

# CRUD Operasyonları i&amp;ccedil;in
touch quotedata.go

# Servis metotlarındaki annotation bildirimlerinin Swagger 2.0 destekli olarak dok&amp;uuml;mante edilmesi i&amp;ccedil;in gerekli mod&amp;uuml;l&amp;uuml;n eklenmesi
go get -u github.com/swaggo/swag/cmd/swag

# Bu arada kod tarafındaki annotation b&amp;ouml;l&amp;uuml;mleri tamamlandıktan sonra Swagger dok&amp;uuml;manının &amp;uuml;retilmesi i&amp;ccedil;in aşağıdaki komutu &amp;ccedil;alıştırmalıyız
swag init _ "book-worm-api/docs"

# DOCKER TARAFI

# mongodb docker container'ının &amp;ccedil;alıştırılması ve veritabanının oluşturulması
# bookworms isimli bir veritabanı oluşturuyoruz ve root user ile password bilgisi de veriyoruz (Bunu production'da yapmayın tabii)
sudo docker run --name mongodb -e MONGO_INITDB_ROOT_USERNAME=scoth -e MONGO_INITDB_ROOT_PASSWORD=tiger -e MONGO_INITDB_DATABASE=bookworms -p 27017:27017 -d mongo:latest&lt;/pre&gt;
&lt;p&gt;Gelelim kod tarafında yaptıklarımıza. Entity tipimiz olan quote yapısını&lt;em&gt;(struct)&lt;/em&gt; aşağıdaki şekilde geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import "go.mongodb.org/mongo-driver/bson/primitive"

/*
	quotation yapısı mongodb'deki dok&amp;uuml;manın GO tarafındaki izd&amp;uuml;ş&amp;uuml;m&amp;uuml;.
	ID, mongodb tarafı i&amp;ccedil;in bson'un primitive tiplerinden birisi ile ifade edilebilir
*/
type quote struct {
	ID          primitive.ObjectID
	Description string
	Writer      string
	Book        string
}&lt;/pre&gt;
&lt;p&gt;CRUD operasyonlarını ihtiva eden ve MongoDB tarafı ile haberleşen fonksiyonları i&amp;ccedil;eren quoteData.go dosyasının i&amp;ccedil;eriğini de aşağıdaki şekilde hazırlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

/*
	Burada MongoDB ile ilgili CRUD Operasyonları yer alıyor.
*/

import (
	"context"
	"log"

	"go.mongodb.org/mongo-driver/bson/primitive"

	"go.mongodb.org/mongo-driver/bson"
	"go.mongodb.org/mongo-driver/mongo"
	"go.mongodb.org/mongo-driver/mongo/options"
)

// getConn fonksiyonu ile mongodb bağlantı nesnesini ve context'i d&amp;ouml;nd&amp;uuml;r&amp;uuml;yoruz
func getConn() (*mongo.Client, context.Context) {

	/*
		NewClient nesnesini docker ile ayağa kalkan mongodb adresine g&amp;ouml;re oluşturuyoruz
		bir error olması durumu da aşağıya doğru s&amp;uuml;rekli kontrol edilmekte
	*/
	client, err := mongo.NewClient(options.Client().ApplyURI("mongodb://scoth:tiger@localhost:27017")) // ilgili bağlantı bilgisini kullanarak yeni bir client nesnesi oluşturuldu
	ctx := context.Background()

	err = client.Connect(ctx)
	if err != nil {
		log.Printf("Bağlanırken hata alındı: %v", err)
	}

	// Bağlantıyı kullanarak mongodb'yi ping'liyoruz
	err = client.Ping(ctx, nil)
	if err != nil {
		log.Printf("Ping yapılamadı: %v", err)
	}

	return client, ctx // geriye Context nesnesini de d&amp;ouml;n&amp;uuml;yoruz. İzleyen metotlardaki defer kullanımlarına dikkat!
}

// AddQuote tahmin edileceği &amp;uuml;zere bookworm veritabanındaki quotes koleksiyonuna yeni bir quote eklemek i&amp;ccedil;in kullanılıyor
func AddQuote(q *quote) (primitive.ObjectID, error) {
	log.Println("Add Quote")
	log.Println(q)

	client, ctx := getConn()
	defer client.Disconnect(ctx)   // AddQuote işleyişinin sonunda mongodb bağlantısının kapatılmasını garanti ediyoruz
	q.ID = primitive.NewObjectID() // eklenecej dok&amp;uuml;man i&amp;ccedil;in yeni bir Object ID &amp;uuml;retiliyor ve parametre olarak gelen quote değişkenine yapıştırılıyor.

	// InsertOne ile q ile gelen quote değişkenini yolluyoruz. Eğer bir sorun olursa err parametresi hata bilgisini taşıyacaktır
	result, err := client.Database("bookworms").Collection("quotes").InsertOne(ctx, q)
	if err != nil { // Eğer hata olmuşsa bunu metottan geriye nil object ID ile birlikte d&amp;ouml;n&amp;uuml;yoruz. Hatayı gin-gonic metotları değerlendirip uygun HTTP mesajını d&amp;ouml;nd&amp;uuml;recektir.
		log.Printf("Alıntı eklenmeye &amp;ccedil;alışırken hata oluştu %v", err)
		return primitive.NilObjectID, err
	}
	id := result.InsertedID.(primitive.ObjectID)
	return id, nil // Eğer sorun yoksa eklenen Object ID bilgisini d&amp;ouml;n&amp;uuml;yor. Bu noktada hata olmadığı i&amp;ccedil;in ikinci output değişkeni nil olarak atanıyor
}

// GetQuotes metodu ile bookworm veritabanındaki quotes koleksiyonunda yer alan t&amp;uuml;m dok&amp;uuml;manları &amp;ccedil;ekiyoruz
// Basit bir veri &amp;ccedil;ekme metodu da olsa her ihtimale karşı hata kontrol&amp;uuml;m&amp;uuml;z de var
func GetQuotes() ([]*quote, error) {
	var quotes []*quote // D&amp;ouml;nd&amp;uuml;receğimiz array

	client, ctx := getConn()     // MongoDb bağlantı bilgilerini aldık
	defer client.Disconnect(ctx) // Panik olsa da olmasa da metot tamalanırken Disconnect olalım

	db := client.Database("bookworms")            //veritabanı nesnesi
	collection := db.Collection("quotes")         // koleksiyon nesnesi
	cursor, err := collection.Find(ctx, bson.D{}) // quotes koleksiyonundaki t&amp;uuml;m dok&amp;uuml;manları &amp;ccedil;ekmek i&amp;ccedil;in kullanılan fonksiyon
	if err != nil {                               // Find metodunun da error d&amp;ouml;n&amp;uuml;ş&amp;uuml; var o y&amp;uuml;zden kontrol etmekte fayda var
		return nil, err
	}
	defer cursor.Close(ctx)        // Eğer hata almadan geldiysek sonraki hata durumuna karşın Find ile a&amp;ccedil;ılan cursor'u kapattırır
	err = cursor.All(ctx, "es) // Koleksiyonu quotes'a alıyoruz
	if err != nil {                // All metodunun da error d&amp;ouml;n&amp;uuml;ş&amp;uuml; var. Kontrol etmek iyi fikir
		log.Println(err)
		return nil, err
	}
	return quotes, nil // Her şey yolunda gittiyse ;)
}&lt;/pre&gt;
&lt;p&gt;Gelelim t&amp;uuml;m bunları kullanacağımız ana y&amp;uuml;klenici main mod&amp;uuml;l&amp;uuml;n&amp;uuml;n i&amp;ccedil;eriğine. Swagger i&amp;ccedil;in annotation'lar kullandığımız dikkatinizden ka&amp;ccedil;masın.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

// gin-gonic mod&amp;uuml;l&amp;uuml;n&amp;uuml; ekledik
// Ayrıca Swagger desteği i&amp;ccedil;in gin-swagger mod&amp;uuml;l&amp;uuml; de eklendi
import (
	"log"
	"net/http"

	ginSwagger "github.com/swaggo/gin-swagger"
	"github.com/swaggo/gin-swagger/swaggerFiles"

	_ "book-worm-api/docs" //swag init ile eklenen dok&amp;uuml;manın bildirimi
	// Bunu eklememin sebebi &amp;ccedil;alışma zamanında swagger UI'a gidince aldığım Failed to load spec. hatası

	"github.com/gin-gonic/gin"
)

// @title BookWorm Swagger API
// @version 1.0
// @description Servis kullanım rehberidir
// @termsOfService http://swagger.io/terms/

// @contact.name Burak Selim Şenyurt
// @contact.email selim@buraksenyurt.com
// @contact.url https://www.buraksenyurt.com

// @BasePath /api/v1

// @host localhost:5003
func main() {
	router := gin.Default()      // gin nesnesini &amp;ouml;rnekledik
	api := router.Group("/api")  //ve api'nin
	v1 := api.Group("/v1")       // v1 s&amp;uuml;r&amp;uuml;m&amp;uuml; i&amp;ccedil;in
	quotes := v1.Group("/quote") //quotes isimli bir route tanımladık

	// Bu route i&amp;ccedil;in k&amp;ouml;k adrese HTTP Get talebi gelirse t&amp;uuml;m alıntıları listeyecek operasyonu &amp;ccedil;alıştırıyoruz
	quotes.GET("/", GetAll)

	// K&amp;ouml;k adrese bir Post talebi gelirse bu sefer yeni bir alıntının eklenmesini sağlıyoruz
	quotes.POST("/", Create)

	/*
		Swagger API dok&amp;uuml;mantasyon desteği i&amp;ccedil;in ekledik.
		metot başlarında yer alan yorum satırları da Swagger UI tarafında değerlenecek
	*/
	router.GET("/swagger/*any", ginSwagger.WrapHandler(swaggerFiles.Handler))

	_ = router.Run(":5003") // sunucuyu 5003 numaralı porttan hizmete a&amp;ccedil;tık
}

/*
	@Summary operasyon i&amp;ccedil;in a&amp;ccedil;ıklama kısmıdır.
	@Produce ve @Accept ile HTTP operasyonun hangi t&amp;uuml;r i&amp;ccedil;erikle &amp;ccedil;alıştığını s&amp;ouml;yl&amp;uuml;yoruz ki &amp;ouml;rnekte json.
	@Param kısmında Body i&amp;ccedil;inden quote tipinden bir değişken beklediğimizi ve zorunlu olduğunu ifade ederiz
	@Sucess ile operasyon başarılı ise HTTP 200 d&amp;ouml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;n&amp;uuml; ifade ederiz
	@Failure kısımlarında metottan hangi t&amp;uuml;r HTTP hatalarının d&amp;ouml;nebileceğini ifade ediyoruz
	@Router kısmında operasyon adresini HTTP POST metodu ile tetiklendiğini ifade ediyoruz
*/

// Create godoc
// @Summary Yeni bir kitap alıntısı ekler
// @Produce json
// @Accept json
// @Param quote body quote true "Alıntı Bilgileri"
// @Success 200
// @Failure 400
// @Failure 500
// @Router /quote/ [post]
func Create(c *gin.Context) {
	var q quote
	// Gelen JSON i&amp;ccedil;eriğinin quote yapısına eşlenip eşlenemediği kontrol ediliyor
	if err := c.ShouldBindJSON(&amp;amp;q); err != nil {
		log.Print(err)
		c.JSON(http.StatusBadRequest, gin.H{"msg": err}) // Eğer JSON i&amp;ccedil;eriğinde sıkıntı varsa hata mesajı ile birlikte geriye HTTP 400 Bad Request d&amp;ouml;n&amp;uuml;yoruz
		return
	}
	id, err := AddQuote(&amp;amp;q) // Add metodu ile eklemeyi ger&amp;ccedil;ekleştiriyoruz
	if err != nil {         // eğer hata varsa bunu da değerlendirip geriye uygun bir HTTP durum kodu ile d&amp;ouml;nd&amp;uuml;r&amp;uuml;yoruz
		c.JSON(http.StatusInternalServerError, gin.H{"msg": err})
		return
	}
	q.ID = id
	c.JSON(http.StatusOK, gin.H{"added": q}) // Her şey yolundaysa HTTP 200 Ok
}

/*
	{array} ile bir quote listesinin d&amp;ouml;neceğini belirtiyoruz
*/

// GetAll godoc
// @Summary T&amp;uuml;m kitap alıntılarını d&amp;ouml;nd&amp;uuml;r&amp;uuml;r
// @Produce json
// @Success 200 {array} quote
// @Failure 500
// @Router /quote/ [get]
func GetAll(c *gin.Context) {
	// mongodb ile iletişim kuran quotedata i&amp;ccedil;erisindeki ilgili metodu &amp;ccedil;ağırdık
	var quoteList, err = GetQuotes()
	// Her ihtimale karşı listeyi &amp;ccedil;eken metot bir hata d&amp;ouml;nd&amp;uuml;rm&amp;uuml;ş m&amp;uuml; bakalım
	if err != nil {
		c.JSON(http.StatusInternalServerError, gin.H{"msg": err})
		return
	}
	c.JSON(http.StatusOK, gin.H{"quotes": quoteList}) // HTTP 200 OK ile birlikte &amp;ccedil;ekilen listeyi geri yolluyoruz.
}&lt;/pre&gt;
&lt;p&gt;Bu bir servis uygulaması olduğu i&amp;ccedil;in &amp;ccedil;alıştırdıktan sonra bir şekilde t&amp;uuml;ketmemiz de gerekiyor ki sonu&amp;ccedil;ları g&amp;ouml;rebilelim. curl, postman gibi ara&amp;ccedil;lar bu ama&amp;ccedil;la kullanılabilir veya bir client uygulama yazılabilir&lt;em&gt;(yazabilirsiniz) &lt;/em&gt;Şimdi aşağıdaki terminal komutları ile &amp;ouml;nce uygulamamızı build edelim ve ardından servisimizi &amp;ccedil;alıştıralım. Tabii bu işler sırasında MongoDb docker container'ının &amp;ccedil;alıştığından emin olalım.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# &amp;ouml;nce bir build etmek lazım
go build

# sonrasında &amp;ccedil;alıştırabiliriz
./book-worm-api&lt;/pre&gt;
&lt;p&gt;İlk testler i&amp;ccedil;in aşağıdaki curl komutlarını kullanabiliriz.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;# &amp;Ouml;rnek birka&amp;ccedil; alıntı girelim

curl --location --request POST 'http://localhost:5003/api/v1/quote/' \
--header 'Content-Type: application/json' \
--data-raw '{
"Description": "Bizler bug&amp;uuml;ne kadar inşa edilmiş en iyi zaman makineleriyiz.",
"Writer": "Dean Buonomono",
"Book": "Beyniniz: Bir Zaman Makinesi"
}'

curl --location --request POST 'http://localhost:5003/api/v1/quote/' \
--header 'Content-Type: application/json' \
--data-raw '{
"Description": "B&amp;ouml;ylece, g&amp;uuml;nler ge&amp;ccedil;iyor.",
"Writer": "Albert Camus",
"Book": "Tersi ve Y&amp;uuml;z&amp;uuml;"
}'

curl --location --request POST 'http://localhost:5003/api/v1/quote/' \
--header 'Content-Type: application/json' \
--data-raw '{
"Description": "Herkes hayatının bir devresinde şu veya bu şekilde talihinin şuuruna erer.",
"Writer": "Ahmet Hamdi Tanpınar",
"Book": "Saatleri Ayarlama Enstit&amp;uuml;s&amp;uuml;"
}'

# Şimdi de listeleme yapalım
curl http://localhost:5003/api/v1/quote/&lt;/pre&gt;
&lt;p&gt;İşte &amp;ccedil;alışma zamanından birka&amp;ccedil; g&amp;ouml;r&amp;uuml;nt&amp;uuml;.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/25/Screenshot_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/25/Screenshot_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulamamıza swagger entegrasyonu yaptığımızdan detaylı bir dok&amp;uuml;mantasyona da sahibiz. Bu servis ne yapıyor, hangi operasyonları nasıl test ederim, test i&amp;ccedil;in bana vereceği curl &amp;ccedil;ıktıları neler vb şeklindeki soruların karşılığı olan dok&amp;uuml;mantasyonu hatırlayacağınız &amp;uuml;zere aşağıdaki terminal komutu ile &amp;uuml;retmiştik. Tekrardan hatırlatmakta yarar var.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# İlgili annotation b&amp;ouml;l&amp;uuml;mleri tamamlandıktan sonra dok&amp;uuml;manın &amp;uuml;retilmesi i&amp;ccedil;in aşağıdaki komutu &amp;ccedil;alıştırmalıyız.
swag init _ "book-worm-api/docs"&lt;/pre&gt;
&lt;p&gt;Bu&amp;nbsp;işlem docs klas&amp;ouml;r&amp;uuml;n&amp;uuml;n oluşmasını sağlar. Klas&amp;ouml;rdeki swagger.json ve yaml i&amp;ccedil;eriklerini bir inceleyin derim ;) Swagger implementasyonu sonrası &amp;ccedil;alışma zamanına ait birka&amp;ccedil; ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; de aşağıda bulabilirsiniz. İşte localhost:5003/swagger/index.html den erişebileceğimi ana sayfadan bir g&amp;ouml;r&amp;uuml;nt&amp;uuml;. Gayet şık değil mi? :)&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/25/Screenshot_3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Yeni bir kitap alıntısı eklerken ki g&amp;ouml;r&amp;uuml;nt&amp;uuml;.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/25/Screenshot_4.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Post işleminin sonucuna ait bir g&amp;ouml;r&amp;uuml;nt&amp;uuml;.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/25/Screenshot_5.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve son olarak t&amp;uuml;m kitap alıntılarını &amp;ccedil;ektiğimiz HTTP Get talebine ait g&amp;ouml;r&amp;uuml;nt&amp;uuml;.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/25/Screenshot_6.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek servisimiz MongoDb'yi gin-gonic &amp;ccedil;atısı &amp;uuml;st&amp;uuml;nden kullanan bir Go uyglaması. Swagger desteği de bulunmakta. Eğer Update ve Delete operasyonlarını da işin i&amp;ccedil;erisine katarsak, &amp;ccedil;alıştığımız kurumlar i&amp;ccedil;in hafif/orta siklet sayılabilecek REST Api'leri kolaylıkla geliştirebiliriz. B&amp;ouml;ylece geldik bir SkyNet derlemesinin daha sonuna. &amp;Ouml;rnek uygulama kodlarına &lt;a href="https://github.com/buraksenyurt/skynet/tree/master/No%2025%20-%20Hello%20Gin-Gonic" target="_blank"&gt;github reposu &amp;uuml;zerinden&lt;/a&gt; erişebilirsiniz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2020-09-03 13:00:00</pubDate>
  <slug>go-ortaminda-minik-bir-crud-servisini-gin-gonic-ile-gelistirmek</slug>
  <tags>
    <tag>go-programming-language</tag>
    <tag>golang</tag>
    <tag>go</tag>
    <tag>gingonic</tag>
    <tag>gin-gonic</tag>
    <tag>rest</tag>
    <tag>rest-api</tag>
    <tag>rest-based-services</tag>
    <tag>swagger</tag>
    <tag>http</tag>
    <tag>http-web-framework</tag>
  </tags>
  <categories>
    <category>GoLang</category>
  </categories>
</post>