<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ruby Kod Parçacıkları 32 - Singleton</title>
  <description>Ruby'nin oldukça geniş bir program kütüphanesi bulunuyor. Fırsat buldukça bazılarını incelemeye çalışıyorum. Geçtiğimiz günlerde Singleton isimli bir modüle rastladım. Kısaca tasarım kalıplarından(Design Patterns) olan Singleton deseninin kolayca uygulanmasını sağlıyor.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/01/rfun.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Ruby'nin&amp;nbsp;olduk&amp;ccedil;a geniş bir program k&amp;uuml;t&amp;uuml;phanesi bulunuyor.&amp;nbsp;Fırsat bulduk&amp;ccedil;a bazılarını incelemeye &amp;ccedil;alışıyorum. Ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde Singleton isimli bir mod&amp;uuml;le rastladım. Kısaca tasarım kalıplarından&lt;em&gt;(Design Patterns)&lt;/em&gt; olan Singleton deseninin kolayca uygulanmasını sağlıyor.&lt;/p&gt;
&lt;p&gt;Ancak dikkat &amp;ccedil;ekici başka bir &amp;ouml;zelliği daha var. Nesne durumunun saklanması ve&amp;nbsp;istenen anda saklanan duruma d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi vakasında da Marshal mod&amp;uuml;l&amp;uuml; ile birlikte g&amp;uuml;zel bir işbirliği i&amp;ccedil;erisinde.&amp;nbsp;Marshalling ile Singleton olan bir nesne &amp;ouml;rneğinin anlık durumunu(State) sonradan geri y&amp;uuml;kleme imkanıyla saklayabiliyoruz.&lt;/p&gt;
&lt;h2&gt;Singleton Tasarım Kalıbının Uygulanması&lt;/h2&gt;
&lt;p&gt;&amp;Ouml;ncesinde Singleton tasarım kalıbının amacını hatırlamakta yarar var: Bir sınıfa ait nesne &amp;ouml;rneğinin &amp;ccedil;alışma zamanında tek olmasını garantilemek. &amp;Ouml;rneğin yazdığımız uygulama ayağa kalkarken &amp;ccedil;eşitli konfigurasyon ayarlarını&amp;nbsp;y&amp;uuml;kleyen farklı mod&amp;uuml;ldeki bir sınıfı kullanıyor olsun. Sınıfın &amp;ccedil;alışma zamanında tek bir &amp;ouml;rneğinin olmasını ve herhangi bir şekilde &amp;ccedil;oğaltılmamasını&lt;em&gt;(hatta klonlanmamasını)&lt;/em&gt; istersek, Singleton deseni bizim i&amp;ccedil;in ideal &amp;ccedil;&amp;ouml;z&amp;uuml;m olacaktır.&lt;/p&gt;
&lt;p&gt;Ruby tarafında bir sınıfın Singleton kalıbını uygular hale getirilmesi ise olduk&amp;ccedil;a kolay. Singleton mod&amp;uuml;l&amp;uuml;n&amp;uuml; sınıfa dahil etmemiz yeterli. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını ele alalım.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require "Singleton"

class ConfigurationManager
  include Singleton
  
  attr_accessor :default_host,:default_port,:entry_point
  
  def get_default_host
    "tcpip://#{@default_host}:#{@default_port}/#{@entry_point}"
  end
end

mngr1=ConfigurationManager.instance
mngr1.default_host="localhost"
mngr1.default_port="4500"
mngr1.entry_point="mainProcess"

puts "mngr1 object id =#{mngr1.object_id}"
puts mngr1.get_default_host

mngr2=ConfigurationManager.instance
puts "mngr2 object id =#{mngr2.object_id}"
puts mngr2.get_default_host

puts mngr1==mngr2&lt;/pre&gt;
&lt;p&gt;reuqire bildirimi ile Singleton mod&amp;uuml;l&amp;uuml;n&amp;uuml; script'e dahil ediyoruz. ConfigurationManager sınıfı i&amp;ccedil;erisindeki include ifadesi ile de Singleton mod&amp;uuml;l&amp;uuml;n&amp;uuml; uygulayacağını belirtiyoruz. Sınıfın &amp;uuml;&amp;ccedil; niteliği bulunuyor. Bunların değerlerini d&amp;uuml;zg&amp;uuml;n bir formatta get_default_host metodunu kullanarak geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;yoruz.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Kodun ilerleyişinde ilk olarak&amp;nbsp;mngr1 isimli nesne &amp;ouml;rneğini oluşuyor. Burada dikkat edilmesi gereken nokta instance &amp;ouml;zelliğinin kullanılması. Normalde bir sınıf &amp;ouml;rneğini new metodundan yararlanarak &amp;uuml;retiriz. Ancak Singleton bir nesne s&amp;ouml;z konusu ise new metoduna yapılan &amp;ccedil;ağrı aşağıdaki hata mesajının &amp;uuml;retilmesine neden olur.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;in `&amp;lt;main&amp;gt;': private method `new' called for ConfigurationManager:Class (NoMethodError)&lt;/pre&gt;
&lt;p&gt;Kodda &amp;uuml;retilen her iki ConfigurationManager nesne &amp;ouml;rneği de aynı object_id değerlerine sahiptir. Hatta bu iki nesne aynıdır ki eşitlik sonrası kod true değeri d&amp;ouml;nd&amp;uuml;rm&amp;uuml;şt&amp;uuml;r. Bir başka dikkat &amp;ccedil;ekici nokta ise, mngr1 &amp;uuml;retimi sırasında atanan nitelik değerlerinin mngr2 i&amp;ccedil;in de ge&amp;ccedil;erli olmasıdır. Kodun &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/rsingleton_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak ConfigurationManager tipinden n sayıda nesne &amp;ouml;rneği &amp;uuml;retilebilir. Ancak ger&amp;ccedil;ek anlamda &amp;ccedil;alışma zamanında tek bir ConfigurationManager nesne &amp;ouml;rneği s&amp;ouml;z konusu olacaktır. Bu n sayıda nesne &amp;ouml;rneğinin herhangibirinde yapılan değişiklikler pek tabii diğer değişkenleri de etkiler. S&amp;ouml;z gelimi yukarıdaki koda aşağıdaki par&amp;ccedil;ayı eklediğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;mngr2.default_host="127.0.0.1"
puts mngr1.get_default_host
puts mngr2.get_default_host&lt;/pre&gt;
&lt;p&gt;Bu durumda mngr2 ile yapılan değişiklik mngr1 tarafından da g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/rsingleton_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Marshalling ile Nesne Durumunu Korumak&lt;/h2&gt;
&lt;p&gt;Gelelim Marshaling ile Singleton karakteristiğindeki bir nesne &amp;ouml;rneğinin anlık durumunun&lt;em&gt;(State)&lt;/em&gt; saklanmasına. Bunun i&amp;ccedil;in Singleton mod&amp;uuml;l&amp;uuml;nden gelen _load ve _dump metodlarının &amp;ccedil;alışma zamanında durumu korumak istenen&amp;nbsp;sınıf i&amp;ccedil;in ezilmesi&amp;nbsp;gerekiyor. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asında bu durum ele alınıyor.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require "Singleton"

class ConfigurationManager
  include Singleton
  
  attr_accessor :default_host,:default_port,:entry_point
  
  def get_default_host
    "tcpip://#{@default_host}:#{@default_port}/#{@entry_point}"
  end
  
  def _dump(obj)
    state="#{@default_host}|#{@default_port}|#{@entry_point}"
    Marshal.dump(state,obj)
  end
  
  def self._load(name)
    state=Marshal.load(name)
    values=state.split("|")
    instance.default_host=values[0]
    instance.default_port=values[1]
    instance.entry_point=values[2]
    instance
  end
end

mngr=ConfigurationManager.instance
mngr.default_host="azonfactory"
mngr.default_port="5555"
mngr.entry_point="prod"
puts "BeforeMarshalling"
puts mngr.get_default_host
last_state=Marshal.dump(mngr)
puts last_state
mngr.default_host="localhost"
mngr.default_port="8080"
mngr.entry_point="test"
puts "AfterChange"
puts mngr.get_default_host
mngr_backup=Marshal.load(last_state)
puts "AfterLoad"
puts mngr_backup.get_default_host&lt;/pre&gt;
&lt;p&gt;_dump metodu i&amp;ccedil;erisinde sınıf &amp;ouml;rneğinin o anki durumu ile ilişkili olarak tutmak istediğimiz ne kadar nitelik varsa ardışıl olarak aralarına pipe işareti koyarar dizdik. Bunu okuduğumuz yerde &amp;ccedil;&amp;ouml;z&amp;uuml;ml&amp;uuml;yor ve instance ile eriştiğimiz nesne &amp;ouml;rneğinin ilgili niteliklerine atıyoruz. Okuma işlemini kolaylaştırmak i&amp;ccedil;in | işaretinden faydalandık. Aslında ConfigurationManager i&amp;ccedil;erisindeki _dump ve _load metodları&amp;nbsp;işleyişlerini ger&amp;ccedil;ekleştirirken Marshal mod&amp;uuml;l&amp;uuml;n&amp;uuml;n ilgili fonskiyonları kullanılmaktalar. Marshal mod&amp;uuml;l&amp;uuml; nesne i&amp;ccedil;eriğinin byte stream olarak serileştirlmesi ve ters okunması noktasında g&amp;ouml;rev alıyor.&lt;/p&gt;
&lt;p&gt;Kodu denediğimiz akışta mngr isimli ConfigurationManager sınıf &amp;ouml;rneğinin anlık durumunu kayıt altına alıyoruz&lt;em&gt;(Bellekte)&lt;/em&gt;&amp;nbsp;Ardından niteliklerinde bir takım değişiklikler yapıyoruz. Bu sadece test ama&amp;ccedil;lı bir işlem. Sonrasında nesne &amp;ouml;rneğini ilk kayıt ettiğimiz durumuna d&amp;ouml;nd&amp;uuml;r&amp;uuml;yoruz. Farklı bir değişken ile d&amp;ouml;nm&amp;uuml;ş olsa da Singleton kalıbı gereği mngr ve mngr_backup aynı nesnelerdir. İşte &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/rsingleton_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir Ruby kod par&amp;ccedil;acığımızın daha sonuna. Bu yazıda Ruby dilinde Singleton tasarımın kalıbının ne kadar kolay uygulanabildiğini ve nesne durumlarının saklanması i&amp;ccedil;in Marshal mod&amp;uuml;l&amp;uuml;nden nasıl faydalanabileceğimizi g&amp;ouml;rd&amp;uuml;k. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-02-03 21:23:00</pubDate>
  <slug>ruby-kod-parcaciklari-32-singleton</slug>
  <tags>
    <tag>ruby</tag>
    <tag>ruby-kod-parçacıkları</tag>
    <tag>design-patterns</tag>
    <tag>tasarım-kalıpları</tag>
    <tag>singleton-design-pattern</tag>
    <tag>marshalling</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>