<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF - Hata Yönetimi (Fault Management)</title>
  <description>Hata yönetimi her programlama dili ve geliştirme ortamı içerisinde yer alan önemli konulardan birisidir. Özellikle kullanıcıların yapmış olduğu işlemler sonucunda oluşan veya sistem üzerinde beklenmeyen durumlardan doğan hataların önüne geçmek amacıyla çeşitli mekanizmalara başvurulmaktadır.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Hata y&amp;ouml;netimi her programlama dili ve geliştirme ortamı i&amp;ccedil;erisinde yer alan &amp;ouml;nemli konulardan birisidir. &amp;Ouml;zellikle kullanıcıların yapmış olduğu işlemler sonucunda oluşan veya sistem &amp;uuml;zerinde beklenmeyen durumlardan doğan hataların &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek amacıyla &amp;ccedil;eşitli mekanizmalara başvurulmaktadır. Bunlardan birisi ve aynı zamanda etkili olanıda istisna y&amp;ouml;netimidir &lt;strong&gt;(Exception Handling)&lt;/strong&gt;. Microsoft .Net ortamında istisna y&amp;ouml;netimi &lt;strong&gt;CLR&lt;/strong&gt; (Common Language Runtime - Ortak Dil &amp;Ccedil;alışmaZamanı) tarafından ger&amp;ccedil;ekleştirilen bir unsurdur.&lt;/p&gt;
&lt;p&gt;Ne varki, basit bir windows veya web uygulamasında etkili bir şekilde ele alınabilen istisnalar, dağıtık mimari uygulamaları &lt;strong&gt; (Distributed Applications) &lt;/strong&gt;g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında daha farklı yaklaşılmak durumundadır. Bu durumu daha iyi anlayabilmek i&amp;ccedil;in, dağıtık mimari uygulamalarının taraflarını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almakta yarar vardır. Biz her ne kadar sunucu tarafında .Net ortamını kullanıyor olsakta, istemci a&amp;ccedil;ısından durum aynen ge&amp;ccedil;erli değildir. &amp;Ouml;rneğin dağıtık mimari uyarlamalarından birisi olan Xml Web Servisleri d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde istemcinin farklı platformda yer alan bir uygulama olması muhtemeldir. &amp;Ouml;yleyse d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmesi gereken iki &amp;ouml;nemli nokta vardır.&lt;/p&gt;
&lt;p&gt;Bunlardan birincisi, istemcilerin farklı bir platformda olabileceğidir. Bu CLR tarafınan ele alınabilecek bir istisnanın istemci tarafında ele alınamaması i&amp;ccedil;in yeter bir sebeptir. &amp;Ccedil;&amp;uuml;nk&amp;uuml; istemci tarafında bir CLR ortamı bulunmayabilir. İkinci &amp;ouml;nemli nokta ise sunucu &amp;uuml;zerinde bir istisna oluşursa bunun istemci tarafına nasıl bildirileceğidir. Bir başka deyişle sunucu tarafında yakalanan hatanın, farklı bir makinedeki farklı bir bellek b&amp;ouml;lgesinde &amp;ccedil;alışan bir uygulamanın yakalayabileceği şekilde g&amp;ouml;nderilebilmesi gerekmektedir. Bu iki noktanın oluşturduğu sorunu &amp;ccedil;&amp;ouml;zmenin tek yolu herkesin kabul ettiği ortak bir standarda g&amp;ouml;re istisna bilgisi yayınlamaktır. İşte bu noktada devreye &lt;strong&gt;SOAP (Simple Object Access Protocol)&lt;/strong&gt; girer. Bu protokol &amp;ouml;rnek olarak web servislerinde oluşacak istisnaları istemci tarafına &lt;strong&gt;Soap Fault &lt;/strong&gt; mesajları olarak g&amp;ouml;nderir ki bu mesaj &amp;ccedil;eşidi t&amp;uuml;m platformlar tarafında kabul edilmiştir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Soap Fault hakkında daha fazla bilgi i&amp;ccedil;in &lt;strong&gt;&lt;a href="http://www.w3.org/TR/soap12-part1/#soapfault"&gt;http://www.w3.org/TR/soap12-part1/#soapfault&lt;/a&gt;&lt;/strong&gt; adresinden faydalanabilirsiniz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;SoapFault, sunucu tarafından fırlatılabilecek istisnaların nasıl bir formata sahip olması gerektiğine dair kuralları i&amp;ccedil;erir. &amp;Ouml;rneğin t&amp;uuml;m SoapFault mesajlarında &lt;strong&gt;Code&lt;/strong&gt; (Hata kodu bilgisi), &lt;strong&gt;Reason&lt;/strong&gt;(Hatanın sebebi) gibi hataya ait detaylı bilgi alınmasını sağlayan &amp;ouml;zellikler yer almaktadır. .Net Framework, J2EE gibi &amp;ouml;rnek plaftormlar bu kurallara uygun olacak şekilde tasarlanmış sınıflar sunarlar. B&amp;ouml;ylece, yazacağımız servisleri kullanacak istemcilerin tamamı i&amp;ccedil;in ele alınabilecek istisna mesajları oluşturma şansına sahip oluruz. Peki Windows Communication Foundation i&amp;ccedil;in durum nasıldır?&lt;/p&gt;
&lt;p&gt;WCF i&amp;ccedil;erisindede istemcilerin ele alabileceği şekilde hata mesajları tanımlayabilmek i&amp;ccedil;in &lt;strong&gt;FaultException&lt;/strong&gt; isimli sınıf geliştirilmiştir. Aslında bir WCF servisi i&amp;ccedil;erisinde istemci uygulamalara fırlatılabilecek istisna mesajları, karşı tarafa ge&amp;ccedil;tiklerinde her zaman bir &lt;strong&gt;FaultException&lt;/strong&gt; &amp;ouml;rneği olarak ele alınırlar. Ancak &amp;ouml;nemli olan bir nokta vardır ki buda, servis &amp;uuml;zerinde oluşan istisnanın mutlaka karşı tarafa (istemci uygulamaya) fırlatılması(throw) gerektiğidir.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;oğu zaman servis tarafında meydana gelen istisnalar i&amp;ccedil;in, istemciye daha fazla bilgi taşıyabilecek şekilde kendi istisna nesnelerimizi organize etmek isteyebiliriz. .Net tarafından yaklaştığımızda bunun yolu &lt;strong&gt;ApplicationException&lt;/strong&gt; sınıfından bir tip t&amp;uuml;retmektir. Lakin WCF i&amp;ccedil;in durum biraz daha farklıdır. Nitekim oluşturulan istisna nesne &amp;ouml;rneğinin Soap Fault standartlarına uygun olacak şekilde istemci tarafına bir mesaj olarak g&amp;ouml;nderilebilmesi ve orada referansının ele alınabilmesi (handle) gerekmektedir.&lt;/p&gt;
&lt;p&gt;WCF mimarisini tanımaya &amp;ccedil;alıştığımız ilk makalemizde d&amp;ouml;rt &amp;ccedil;eşit s&amp;ouml;zleşme (contract) olduğundan bahsetmiştik. Bunlardan biriside &lt;strong&gt; hata s&amp;ouml;zleşmesidir(Fault Contract)&lt;/strong&gt;. Hata s&amp;ouml;zleşmeleri basit olarak, servis tarafında &amp;uuml;retilen kullanıcı tanımlı hataların istemciye nasıl taşınması gerektiğini bildiren bir s&amp;ouml;zleşme &amp;ccedil;eşidir. Geliştirici olarak kendi hata bildirimlerimizi yapmak i&amp;ccedil;in &amp;ouml;ncelikli olarak hataya ait bilgileri taşıyacak bir veri s&amp;ouml;zleşmesininde (data contract) tanımlanması gerekmektedir. Makalemizin ilerleyen kısımlarında bu işlemlerin nasıl yapılacağını adım adım inceleyeceğiz.&lt;/p&gt;
&lt;p&gt;WCF i&amp;ccedil;in, hata y&amp;ouml;netimi ile ilişkili olarak dikkat edilmesi gereken bir diğer noktada, servisin a&amp;ccedil;ılması ve kapanması arasında meydana gelebilecek bazı beklenmedik tepkilere karşı nasıl tedbir alınması gerektiğidir. Her servis &amp;ccedil;alışmadan &amp;ouml;nce nesne olarak &amp;ouml;rneklenmektedir. Bunun programatik olarak &lt;strong&gt;ServiceHost&lt;/strong&gt; sınıfına ait bir nesne &amp;ouml;rneğinin oluşturulması olarak d&amp;uuml;ş&amp;uuml;nebiliriz. Sonrasında servis a&amp;ccedil;ılır ve istemcilerden gelecek olan talepler karşılanmaya başlar. Ne varki servis a&amp;ccedil;ılırken, a&amp;ccedil;ıldığında ve &amp;ccedil;alışırken servis tarafında bazı beklenmedik hatalar oluşabilir.&lt;/p&gt;
&lt;p&gt;Bu gibi durumlarda servise ait &lt;strong&gt;Faulted&lt;/strong&gt; olayı tetiklenmektedir. Dolayısıyla bu olay i&amp;ccedil;erisinde gereken hazırlıklar yapılarak servisin tekrar ayağa kaldırılması denenebilir. Burada servisin yaşam d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml;nde bilinmesinde fayda vardır. Bu konuyuda makalemizin sonunda ele almaya &amp;ccedil;alışacağız. Şimdi vakit kaybetmeden &amp;ouml;rnek bir senaryo &amp;uuml;zerinden gidelim. Basit olarak Tcp bağlayıcısını kullanan Console tabanlı sunucu ve istemci uygulamaların yer aldığı bir WCF senaryosu geliştireceğiz. &amp;Ouml;ncelikli olarak servis s&amp;ouml;zleşmesi ve uyarlamayı yapan tipi i&amp;ccedil;eriside barındıran RemoteLib isimli WCF Servis k&amp;uuml;t&amp;uuml;phanemizi&lt;strong&gt; (WCF Service Library)&lt;/strong&gt; aşağıdaki gibi tasarlayalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk203_1.gif" alt="" width="224" height="273" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;INorthwind&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;m&amp;uuml;z tahmin edeceğiniz gibi servis s&amp;ouml;zleşmemizi&lt;strong&gt;(Service Contract)&lt;/strong&gt; ifade etmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.ServiceModel;

namespace RemoteLib
{
    [ServiceContract(Name="NorthManagerService", Namespace="http://www.bsenyurt.com/NorthService")]
    public interface INorthwind
    {
        [OperationContract(Name="GetCustomers")]
        DataSet GetCustomers(); 
    }
}&lt;/pre&gt;
&lt;p&gt;Servis s&amp;ouml;zleşmemizi uygulayan NorthManager isimli sınıfımızın i&amp;ccedil;eriği ise şu an i&amp;ccedil;in aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.ServiceModel;
using System.Data.SqlClient;

namespace RemoteLib
{
    public class NorthManager:INorthwind
    {
        #region INorthwind Members

        public DataSet GetCustomers()
        {
            DataSet ds = null;
            SqlConnection conn=null;
            try
            {
                conn= new SqlConnection("data source=.;database=AdventureWorks;integrated security=SSPI");
                SqlDataAdapter da = new SqlDataAdapter("Select CustomerID,CompanyName,ContactName,ContactTitle From Customers", conn);
                ds = new DataSet("CustomersSet");
                da.Fill(ds);
            }
            catch (SqlException excp)
            {
                Console.WriteLine(excp.Message);
            }
            finally
            {
                conn.Close();
            }
            return ds;
        }

        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;NorthManager sınıfımız i&amp;ccedil;erisinde yer alan GetCustomers isimli metodumuz basit olarak Northwind veritabanında yer alan Customers isimli tablodan veri &amp;ccedil;ekip sonu&amp;ccedil; k&amp;uuml;mesini bir DataSet olarak geriye d&amp;ouml;nd&amp;uuml;rmektedir. Ancak SqlConnection nesne &amp;ouml;rneği oluşturulurken veritabanı adı olarak Northwind yerine AdventureWorks adı verilmiştir. Bu, &amp;ccedil;alışma zamanında &amp;ccedil;ok doğal olarak bir istisnaya neden olacaktır.&lt;/p&gt;
&lt;p&gt;İstisna servis tarafı a&amp;ccedil;ısından d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde GetCustomers metodu i&amp;ccedil;erisindeki catch bloğu tarafından yakalanacaktır. Peki ya sonrasında ne olacaktır? Ger&amp;ccedil;ekten istemci uygulama burada &lt;strong&gt; SqlException&lt;/strong&gt; istisna nesne &amp;ouml;rneğini yakalayabilecek midir? Bu sorulara net bir cevap verebilmek i&amp;ccedil;in &amp;ouml;nce sunucu uygulamamızı, ardından istemci uygulamamızı geliştirerek incelemelerimize devam edelim. Servis uygulamamız bir konsol programı olarak tasarlanabilir. WCF i&amp;ccedil;in gerekli ayarları konfigurasyon dosyasında tutacağız. Konfigurasyon dosyamızın i&amp;ccedil;eriği şu an i&amp;ccedil;in aşağıdaki gibi yazılabilir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service name="RemoteLib.NorthManager"&amp;gt;
                &amp;lt;endpoint address="net.tcp://localhost:65002/NorthService" binding="netTcpBinding" bindingConfiguration="" name="NorthServiceEndPoint" contract="RemoteLib.INorthwind" /&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;N&lt;/strong&gt;&lt;strong&gt;etTcpBinding&lt;/strong&gt; bağlayıcı tipini kullandığımız i&amp;ccedil;in TCP protokol&amp;uuml; &amp;uuml;zerinden binary formatlama ger&amp;ccedil;ekleşek şekilde iletişim kurabiliriz. Servisimize istemcilerin ulaşabilmesi i&amp;ccedil;inde net.tcp://localhost:65002/NorthService adresi kullanılmaktadır. Elbette siz &amp;ouml;rneği denerken istediğiniz port numarasını ele alabilirsiniz. Servis s&amp;ouml;zleşmemizde contract niteliği i&amp;ccedil;erisinde bildirilmiştir. Sunucu uygulamaya ait program kodlarımız ise aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace ServerApp
{
    class Program
    {
        static void Main(string[] args)
        {
            ServiceHost host = new ServiceHost(typeof(RemoteLib.NorthManager));
            host.Open(); 
            Console.WriteLine("Sunucu  dinlemede...");
            Console.ReadLine();
            host.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Servis uygulaması &amp;ouml;nce ServiceHost tipinden bir nesne &amp;ouml;rneği oluşturmakta ve sonrasında servisi kullanıma a&amp;ccedil;maktadır. Kullanıcı uygulamayı tuşa basarak kapattıktan sonra a&amp;ccedil;ılan servis i&amp;ccedil;inde kapatma emri Close metodu ile verilmektedir. Gelelim istemci tarafına. HTTP &amp;uuml;zerinden metadata yayınlaması yapmadığımız i&amp;ccedil;in bir &amp;ouml;nceki WCF makalesinde yaptığımız gibi &lt;strong&gt;svcutil.exe&lt;/strong&gt; aracını RemoteLib.dll assembly' ı &amp;uuml;zerinde kullanmamız ve istemci i&amp;ccedil;in gerekli proxy sınıfı ile konfigurasyon dosyasını &amp;uuml;retmemiz gerekmektedir. Bu ama&amp;ccedil;la komut satırından svcutil aracını aşağıdaki gibi kullanalım.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;nce;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;svcutil RemoteLib.dll&lt;/pre&gt;
&lt;p&gt;Sonrasında ise;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;svcutil /namespace:*,RemoteLib.NorthManager www.bsenyurt.com.NorthService.wsdl *.xsd&lt;/pre&gt;
&lt;p&gt;Tahmin edeceğiniz gibi komut satırından yaptığımız bu işlemlerin sonrasında istemci i&amp;ccedil;in gereken proxy sınıfı ve config dosyaları başarılı bir şekilde oluşturulacaktır. İstemci uygulamamızın konfigurasyon dosyasını isterseniz daha basit olması a&amp;ccedil;ısından aşağıdaki gibi oluşturabilirsiniz. Nitekim svcutil ile oluşturulan standart &lt;strong&gt;output.config&lt;/strong&gt; dosyası olduk&amp;ccedil;a fazla element bilgisi i&amp;ccedil;ermektedir. Tek dikkat edilmesi gereken nokta contract niteliğine doğru tip bilgisini girmektir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;client&amp;gt;
            &amp;lt;endpoint address="net.tcp://localhost:65002/NorthService" binding="netTcpBinding" bindingConfiguration="" contract="RemoteLib.NorthManager.NorthManagerService" name="NorthClientEndPoint" /&amp;gt;
        &amp;lt;/client&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bundan sonra istemci uygulamamızın kod satırlarınıda aşağıdaki gibi geliştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.ServiceModel;
using RemoteLib.NorthManager;

namespace ClientApp
{
    class Program
    {
        static void Main(string[] args)
        {
            try
            {
                NorthManagerServiceClient srvClient = new NorthManagerServiceClient("NorthClientEndPoint");
                DataSet customers = srvClient.GetCustomers();
                if(customers.Tables.Count!=0)
                    Console.WriteLine(customers.Tables[0].Rows.Count.ToString());
            }
            catch (FaultException excp)
            {
                Console.WriteLine(excp.Code.Name+ "\n" + excp.Reason.ToString());
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İstemci tarafındaki kod par&amp;ccedil;amızıda dikkat ederseniz try...catch blokları arasına aldık. Artık testimize başlayabiliriz.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;İstemcinin gereken taleplerde bulunabilmesi i&amp;ccedil;in sunucu uygulamanın &amp;ccedil;alışıyor ve a&amp;ccedil;ık olması gerekecektir. Visual Studio i&amp;ccedil;erisinde debug işlemleri yapmak isteyebileceğimizden &lt;strong&gt;Solution&lt;/strong&gt; &amp;ouml;zelliklerinden &lt;strong&gt;Multiple Startup Projects&lt;/strong&gt; se&amp;ccedil;eneğini aşağıdaki gibi set ederek F5 (Start) veya Ctrl+F5 (Start without debuging) sonrasında &amp;ouml;nce sunucunun sonrasında ise istemcinin sırayla &amp;ccedil;alıştırılmalarını sağlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk203_3.gif" alt="" width="517" height="233" border="0" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Sonu&amp;ccedil; olarak aşağıdaki ekran &amp;ccedil;ıktılarını alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk203_2.gif" alt="" width="478" height="180" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat ederseniz, sunucu tarafındaki catch bloğuna girilmiş ve oluşan istisnaya uygun bir bi&amp;ccedil;imde ekrana mesaj &amp;ccedil;ıktısı verilmiştir. Ne varki bu istisna mesajını istemci tarafına g&amp;ouml;nderebilmiş değiliz. Bunun i&amp;ccedil;in baştada belirttiğimiz gibi servis uygulamasında bilin&amp;ccedil;li bir şekilde &lt;strong&gt;FaultException&lt;/strong&gt; nesne &amp;ouml;rneğinin oluşturulması gerekmektedir. Bu ama&amp;ccedil;la NorthManager sınıfımızın GetCustomers metodundaki catch bloğunu aşağıdaki gibi d&amp;uuml;zenleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;catch (SqlException excp)
{
    Console.WriteLine(excp.Message);
    throw new FaultException(excp.Message, new FaultCode("Veritabani istisnası"));&lt;/pre&gt;
&lt;p&gt;FaultException sınıfının farklı şekilde y&amp;uuml;klenmiş yapıcı metodlar(constructors) vardır. Burada kullanılan versiyonda ilk parametre olarak hatanın sebebi (&lt;strong&gt;Reason&lt;/strong&gt;) ikinci parametre olarakta hata kodu (&lt;strong&gt;FaultCode&lt;/strong&gt;) verilmektedir. Oluşan istisna sonrasında &amp;uuml;retilecek ve istemciye gidecek olan &lt;strong&gt;SoapFault&lt;/strong&gt; mesajı i&amp;ccedil;erisinde, yapıcı metod i&amp;ccedil;erisinde kullandığımız parametre bilgileri yer alacaktır. Buna g&amp;ouml;re uygulamalarımızı tekrar &amp;ccedil;alıştırırsak aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;lerini elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk203_4.gif" alt="" width="364" height="137" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi artık istemci tarafında, sunucudan fırlatılan &lt;strong&gt;FaultException&lt;/strong&gt; nesnesinin i&amp;ccedil;eriğini yakalayabilmekteyiz. Servis tarafında yer alan NorthManager sınıfına ait GetCustomers metodunda istisna oluştuğunda, istemci uygulamalara FaultException tipinden bir nesne &amp;ouml;rneği fırlatmaktansa, normal bir &lt;strong&gt;Excpetion&lt;/strong&gt; nesnesi fırlatılmasıda denenebilir &lt;em&gt;(yada başka tipte bir istisna nesne &amp;ouml;rneği).&lt;/em&gt; Bu durumda istemci uygulama &amp;ccedil;ok farklı bir mesaj alacaktır. Durumu analiz etmek i&amp;ccedil;in GetCustomers metodu i&amp;ccedil;erisinde aşağıdaki değişiklikleri yapalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;throw new Exception("Veritabanı adı yanlış");&lt;/pre&gt;
&lt;p&gt;Testi tekrar yaptığımızda istemci uygulamamız i&amp;ccedil;in aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk203_5.gif" alt="" width="638" height="123" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat ederseniz istemci tarafına son derece enteresan bir &amp;ccedil;ıktı gelmiştir. Asıl hata mesajının i&amp;ccedil;eriğini alabilmek i&amp;ccedil;in servis tarafındaki konfigurasyon bilgilerinde biraz değişiklik yapmak gerekecektir. &amp;Ouml;ncelikle olarak bir servis davranışı &lt;strong&gt; (service behavior)&lt;/strong&gt; tanımlanmalıdır. Servis davranışının (Service Behavior) &lt;strong&gt;serviceDebug&lt;/strong&gt; &amp;ouml;zelliğinin &lt;strong&gt; includeExceptionDetailInFaults&lt;/strong&gt; isimli niteliğinede &lt;strong&gt;true&lt;/strong&gt; değeri atanmalı ve son olarak bu davranış servise bildirilmelidir. S&amp;ouml;z konusu değişiklikleri servis uygulamasının &lt;strong&gt;App.config&lt;/strong&gt; isimli konfigurasyon dosyasına aşağıdaki gibi ekleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;behaviors&amp;gt;
            &amp;lt;serviceBehaviors&amp;gt;
                &amp;lt;behavior name="NorthServiceBehavior"&amp;gt;
                    &amp;lt;serviceDebug includeExceptionDetailInFaults="true" /&amp;gt;
                &amp;lt;/behavior&amp;gt;
            &amp;lt;/serviceBehaviors&amp;gt;
        &amp;lt;/behaviors&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service behaviorConfiguration="NorthServiceBehavior" name="RemoteLib.NorthManager"&amp;gt;
                &amp;lt;endpoint address="net.tcp://localhost:65002/NorthService" binding="netTcpBinding" bindingConfiguration="" name="NorthServiceEndPoint" contract="RemoteLib.INorthwind" /&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;B&amp;ouml;ylece servis tarafında &amp;uuml;rettiğimiz FaultException dışındaki bir istisnanın istemci tarafına taşınması m&amp;uuml;mk&amp;uuml;n olabilir ki istemci uygulamayı tekrar test ettiğimizde aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde edebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk203_6.gif" alt="" width="280" height="133" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada dikkat edilmesi gereken &amp;ouml;nemli bir nokta daha vardır. Servis uygulaması tarafında her nekadar bir Exception sınıfına ait nesne &amp;ouml;rneği fırlatsakta, istemci tarafında bu yine &lt;strong&gt;FaultException&lt;/strong&gt; sınıfına ait bir &amp;ouml;rnek olarak ele alınacaktır. Bunu g&amp;ouml;rebilmek i&amp;ccedil;in istemci uygulamada FaultException yerine &lt;strong&gt;Exception&lt;/strong&gt; nesnesi yakalanmaya &amp;ccedil;alışabilir. Uygulamayı debug ettiğimizde aynen aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi istisna tipinin aslında FaultException olduğu g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk203_7.gif" alt="" width="565" height="368" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim daha g&amp;uuml;&amp;ccedil;l&amp;uuml; hata istisna nesnelerinin nasıl oluşturabileceğimize&lt;strong&gt;(Strongly Typed Faults)&lt;/strong&gt;. Yazımızın başındada belirttiğimiz gibi, &amp;ouml;ncelikle istemci tarafına g&amp;ouml;nderilecek olan mesajın bir veri s&amp;ouml;zleşme olarak tanımlanması gerekmektedir. Bu ama&amp;ccedil;la aşağıdaki gibi bir sınıfı RemoteLib i&amp;ccedil;erisinde tanımlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk203_8.gif" alt="" width="380" height="259" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;TabloAdiFault isimli sınıfımız tipik olarak bir veri s&amp;ouml;zleşmesi (data contract) tanımlamaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Runtime.Serialization;

namespace RemoteLib
{
    [DataContract]
    public class TabloAdiFault
    {
        private string _faultCode;
        private string _Message;
        private string _Reason;

        [DataMember]
        public string FaultCode
        {
            get { return _faultCode; }
            set { _faultCode = value; }
        }
        [DataMember]
        public string Message
        {
            get { return _Message; }
            set { _Message = value; }
        }
        [DataMember]
        public string Reason
        {
            get { return _Reason; }
            set { _Reason = value; }
        }
        public TabloAdiFault(string faultCode,string message,string reason)
        {
            Reason = reason;
            Message = message;
            FaultCode = faultCode;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Burada dikkat edilmesi gereken noktalardan biriside &lt;strong&gt;DataContract&lt;/strong&gt; ve &lt;strong&gt;DataMember&lt;/strong&gt; niteliklerinin kullanılabilmesi i&amp;ccedil;in &lt;strong&gt;System.Runtime.Serialization.dll&lt;/strong&gt; assembly' ının projeye dahil edilmiş olması gerekmektedir. &lt;em&gt;(Biz uygulamamızı WCF Service Library şablonundan tasarladığımız i&amp;ccedil;in bu assembly' lar otomatik olarak referans edilmiş olacaktır.)&lt;/em&gt; Artık tanımlamış olduğumuz bu sınıfın, istemcilere FaultException olarak g&amp;ouml;nderilmesi i&amp;ccedil;in gereken hazırlıkları yapabiliriz. &amp;Ouml;ncelikli olarak bu verinin hangi metodlardan d&amp;ouml;nd&amp;uuml;r&amp;uuml;lecekse &lt;strong&gt;FaultContract&lt;/strong&gt; niteliği yardımıyla bildirilmesi gerekmektedir. Bu nedenle servis s&amp;ouml;zleşmemizde gerekli tanımlamayı aşağıdaki gibi yapmamız yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[ServiceContract(Name="NorthManagerService",Namespace="http://www.bsenyurt.com/NorthService")]
public interface INorthwind
{
    [FaultContract(typeof(TabloAdiFault))]
    [OperationContract(Name="GetCustomers")]
    DataSet GetCustomers(); 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;FaultContract&lt;/strong&gt; niteliği parametre olarak metoddan d&amp;ouml;nd&amp;uuml;r&amp;uuml;lebilecek tipe ait bir bilgi i&amp;ccedil;ermektedir. Bu bilginin istemci tarafına serileştirilerek(Serializable) gitmesi gerektiği i&amp;ccedil;in, zaten veri s&amp;ouml;zleşmesi olarak tanımlanmıştır. Elbette istisnaları fırlatırkende yapmamız gereken bazı işlemler olacaktır. Bu ama&amp;ccedil;la GetCustomers metodumuzun i&amp;ccedil;eriğini aşağıdaki gibi değiştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public DataSet GetCustomers()
{
    DataSet ds = null;
    SqlConnection conn=null;
    try
    {
        conn= new SqlConnection("data source=.;database=AdventureWorks;integrated security=SSPI");
        SqlDataAdapter da = new SqlDataAdapter("Select CustomerID,CompanyName,ContactName,ContactTitle From Customers", conn);
        ds = new DataSet("CustomersSet");
        da.Fill(ds);
    }
    catch (SqlException excp)
    {
        Console.WriteLine(excp.Message);
        TabloAdiFault tblFault = new TabloAdiFault("TabloAdi", excp.Message, "Tablo adı yanlış");
        throw new FaultException&amp;lt;TabloAdiFault&amp;gt;(tblFault);
    }
    finally
    {
        conn.Close();
    }
    return ds;
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncelikle TabloAdiFault sınıfımızı &amp;ouml;rnekliyoruz. Bu bir exception sınıfı olmadığından istemci tarafına fırlatılabilmesi i&amp;ccedil;in &lt;strong&gt;FaultException&lt;/strong&gt; sınıfının ilgili yapıcı metoduna parametre olarak verilmesi gerekmektedir. Bu işlem i&amp;ccedil;in Framework i&amp;ccedil;erisinde FaultException sınıfının generic bir versiyonu kullanılmaktadır. Artık istemci tarafını aşağıdaki gibi kodlayabiliriz. Ancak bu işlemlerin ardından istemciler i&amp;ccedil;in gerekli &lt;strong&gt;proxy&lt;/strong&gt; sınıflarını yeniden oluşturmamız gerekecektir. Dolayısıyla &lt;strong&gt;svcutil&lt;/strong&gt; aracını tekrardan ele almalıyız. Svcutil aracını kullandığımız takdirde oluşan proxy sınıfı i&amp;ccedil;erisinede &lt;strong&gt;TabloAdiFault&lt;/strong&gt; sınıfının getirildiğini g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk203_9.gif" alt="" width="331" height="261" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak sadece public &amp;uuml;yeler ve bunlara ilişkin alanlar bu sınıf i&amp;ccedil;erisine dahil edilmiştir. Ama aynı zamanda &lt;strong&gt;ExtensionDataObject&lt;/strong&gt; tipinden değerler ile &amp;ccedil;alışan bir &amp;ouml;zellikte ilave edilmiştir ki bu &amp;ouml;zellik IExtensibleDataObject aray&amp;uuml;z&amp;uuml;nden uygulanmaktadır. Artık istemci tarafındaki catch bloğumuzu aşağıdaki gibi kodlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;catch (FaultException&amp;lt;TabloAdiFault&amp;gt; excp)
{
    Console.WriteLine("Hata Kodu : "+excp.Detail.FaultCode.ToString() + "\nHata Mesajı : " + excp.Detail.Message + "\nSebep : " + excp.Detail.Reason);
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Detail&lt;/strong&gt; &amp;ouml;zelliği aslında generic tipimize ait referansı bir başka deyişle &lt;strong&gt;TabloAdiFault&lt;/strong&gt; nesne &amp;ouml;rneğini ele almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk203_10.gif" alt="" width="429" height="112" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dolayısıyla Detail &amp;uuml;zerinden, TabloAdiFault sınıfı i&amp;ccedil;erisinde tanımlanmış &amp;ouml;zelliklere erişebiliriz. &amp;Ouml;yleki &amp;ccedil;alışma zamanında bu &amp;ouml;zelliklerin değerleri servis uygulaması tarafında &amp;uuml;retilip istemci tarafına taşınacaktır. O halde uygulamayı deneyip &amp;ccedil;alışmanın sonu&amp;ccedil;larını g&amp;ouml;rebiliriz. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde bu sonu&amp;ccedil;lar yer almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk203_11.gif" alt="" width="401" height="130" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;WCF uygulamalarında hata y&amp;ouml;netimi adına sunucu tarafındada yapılması gerekenler olabilir. &amp;Ouml;zellikle servisin a&amp;ccedil;ılması, a&amp;ccedil;ıldıktan sonra kapatılana kadar ge&amp;ccedil;en s&amp;uuml;re i&amp;ccedil;erisinde bazı beklenmeyen sistem hataları meydana gelebilir. Bu gibi durumlarda istenirse &lt;strong&gt;ServiceHost&lt;/strong&gt; sınıfına ait &lt;strong&gt;Faulted&lt;/strong&gt; olay metodu kullanılabilir ve hataların ele alınması sağlanabilir. Faulted olayını daha iyi kavrayabilmek i&amp;ccedil;in aslında bir servisin yaşam &amp;ccedil;emberini &lt;strong&gt; (life cycle)&lt;/strong&gt; incelemekte ve hangi durumlarda Faulted olayının tetikleneceğini bilmekte fayda vardır.&lt;/p&gt;
&lt;p&gt;Temel olarak bir servis uygulamasının oluşturulması (&lt;strong&gt;Create&lt;/strong&gt;), a&amp;ccedil;ılması (&lt;strong&gt;Open&lt;/strong&gt;), iptal edilmesi (&lt;strong&gt;Abort&lt;/strong&gt;) veya durdurulması (&lt;strong&gt;Stop&lt;/strong&gt;) gibi durumlar s&amp;ouml;z konusudur. Bu durumlar arasında ge&amp;ccedil;işler yapılabilmesi i&amp;ccedil;inde bazı metodların &amp;ccedil;ağırılması gerekmektedir. S&amp;ouml;z gelimi servis nesnesi oluşturulduktan sonra a&amp;ccedil;mak i&amp;ccedil;in &lt;strong&gt;Open&lt;/strong&gt; metodu &amp;ccedil;ağırılır. Bu gibi metod &amp;ccedil;ağrıları sonrasında servisin durumu (&lt;strong&gt;state&lt;/strong&gt;) s&amp;uuml;rekli değişecektir. İşte bu ge&amp;ccedil;işler (&lt;strong&gt;transitions&lt;/strong&gt;) sırasında oluşabilecek bazı beklenmedik hatalara karşılık Faulted olayı ele alınabilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;ServiceHost sınıfının bir servisin durumunu &amp;ouml;ğrenebilmek amacıyla &lt;strong&gt;CommunicationState&lt;/strong&gt; isimli enum sabitinden değerler d&amp;ouml;nd&amp;uuml;ren &lt;strong&gt;State&lt;/strong&gt; isimli sadece okunabilir (read-only) bir &amp;ouml;zelliği vardır. Bu enum sabitinin alabileceği değerler &lt;strong&gt;Created, Opening, Opened, Faulted, Closing, Closed &lt;/strong&gt;dır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Aşağıdaki &amp;ccedil;izelgede bir servisin alabileceği durumlar, bu durumlar arasında ge&amp;ccedil;iş yapılması i&amp;ccedil;in gereken metodlar ve Faulted olayının devreye girebileceği zamanlar ifade edilmeye &amp;ccedil;alışılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk203_12.gif" alt="" width="621" height="471" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekildende g&amp;ouml;receğiniz gibi, Faulted olayının tetiklenmesi sonrasında ele alınabilecek senaryolardan birisi servisin o ana kadar olan t&amp;uuml;m işlemlerini iptal etmek (Abort) ve servisi tekrardan oluşturup a&amp;ccedil;mayı denemek olacaktır. Abort metodu &amp;ccedil;ağırıldığında eğer askıda bekleyen talepler varsa bunlara cevap verilmesi beklenmez. Oysaki Close metodu &amp;ccedil;ağrıldığında askıda bekleyen talepler(request) var ise bunlar cevaplanır ama emir verildikten sonra istemciden yeni talepler alınmaz. Yukarıdaki senaryoyu uygulamak istediğimizde servis tarafındaki kodlarımızı aşağıda olduğu gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace ServerApp
{
    class Program
    {
        static ServiceHost host;

        static void Main(string[] args)
        {
            host = new ServiceHost(typeof(RemoteLib.NorthManager));
            host.Faulted += delegate(object sender, EventArgs e)
            {
                host.Abort();
                host = new ServiceHost(typeof(RemoteLib.NorthManager));
                host.Open();
            };
            host.Open(); 
            Console.WriteLine("Sunucu dinlemede...");
            Console.ReadLine();
            host.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat ederseniz Faulted olay metodu i&amp;ccedil;erisinde &amp;ouml;nce servis &lt;strong&gt;Abort&lt;/strong&gt; metodu ile iptal edilmekte, sonrasında servis nesne &amp;ouml;rneği oluşturulmakta ve servis tekrar a&amp;ccedil;ılmaya &amp;ccedil;alışılmaktadır. Bu olay metodu i&amp;ccedil;erisinde loglama işlemleride yapılarak hataların daha kolay izlenmesi sağlanabilir.&lt;/p&gt;
&lt;p&gt;Bu makalemizde WCF uygulamalarında hata y&amp;ouml;netimini farklı şekillerde ele almaya &amp;ccedil;alıştık. &amp;Ouml;zellikle hata y&amp;ouml;netiminin basit bir istisna y&amp;ouml;netiminden &amp;ccedil;ok daha farklı olmamakla birlikte farklı platformların s&amp;ouml;z konusu olduğu dağıtık bir ortamda daha titiz bir bi&amp;ccedil;imde ele alınması gerektiğini &amp;ouml;ğrendik. Bunların dışında istemci tarafında oluşacak hataların sunucuya g&amp;ouml;nderilmesi istenebilir. Ancak istemcilerinin Java gibi farklı platformlar olabileceği g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınırsa istemcinin sunucuya g&amp;ouml;ndereceği mesajların Soap Fault' a uygun olması gerekecektir. Bu konuyu inceleyip ilerleyen makalelerimizde ele almaya &amp;ccedil;alışacağız. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. İlerleyen makalelerimizde WCF mimarisinin detaylarını incelemeye devam ediyor olacağız. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/FaultControl.rar"&gt;&amp;Ouml;rnek Uygulama İ&amp;ccedil;in Tıklayınız.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2007-05-09 06:00:00</pubDate>
  <slug>WCF-Hata-Yonetimi-(Fault-Management)-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
    <tag>fault-management</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>