<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>GetOleDbSchemaTable Metodu İle Veritabanımızda Ne Var Ne Yok</title>
  <description>Bu makalemizde, OleDbConnection sınıfına ati olan GetOleDbSchemaTable metodu sayesinde, Sql Veritabanımızdaki varlıklara ait şema bilgilerini nasıl temin edebileceğimizi incelemeye çalışacağız. Çoğu zaman programlarımızda, bağlandığımız veritabanında yer alan tabloların (Tables), görünümlerin (Views), saklı yordamların (Stored Procedures) ve daha pek çok veritabanı nesnesinin bir listesine sahip olmak isteriz. ADO.NET'te yer alan OleDbConnection nesnesine ait GetOleDbSchemaTable metodunu kullanarak bu istediğimiz sonuca varabiliriz.GetOleDbSchema metodu aşağıdaki prototipe sahiptir.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, OleDbConnection sınıfına ati olan GetOleDbSchemaTable metodu sayesinde, Sql Veritabanımızdaki varlıklara ait şema bilgilerini nasıl temin edebileceğimizi incelemeye &amp;ccedil;alışacağız. &amp;Ccedil;oğu zaman programlarımızda, bağlandığımız veritabanında yer alan tabloların (Tables), g&amp;ouml;r&amp;uuml;n&amp;uuml;mlerin (Views), saklı yordamların (Stored Procedures) ve daha pek &amp;ccedil;ok veritabanı nesnesinin bir listesine sahip olmak isteriz. ADO.NET'te yer alan OleDbConnection nesnesine ait GetOleDbSchemaTable metodunu kullanarak bu istediğimiz sonuca varabiliriz.GetOleDbSchema metodu aşağıdaki prototipe sahiptir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public DataTable GetOleDbSchemaTable(Guid schema,object[] restrictions);&lt;/pre&gt;
&lt;p&gt;Dikkat edecek olursanız metodun geri d&amp;ouml;n&amp;uuml;ş değeri DataTable tipindedir. Metodun isminde Table kullanılmasının nedenide zaten budur. Yani d&amp;ouml;nen şema bilgileri bir DataTable nesnesine aktarılacaktır. Metod iki &amp;ouml;nemli parametreye sahiptir. İlk parametremiz, OleDbSchemaGuid sınıfı t&amp;uuml;r&amp;uuml;nden bir numaralandırıcı değeri almaktadır. Bu parametreye vereceğimiz değer ile, veritabanından elde etmek istediğimiz şema tipini belirleriz. &amp;Ouml;rneğin veritabanında yer alan tabloları elde etmek i&amp;ccedil;in, OleDbSchemaGuid.Tables değerini veririz. Bunun yanında bu parametreye verebileceğimiz başka &amp;ouml;nemli değerlerde şunlardır.&lt;/p&gt;
&lt;div&gt;
&lt;table id="AutoNumber2" style="width: 100%; height: 149px;" border="1" cellspacing="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#cccccc" width="194" height="28"&gt;OleDbSchemaGuid&amp;nbsp; &amp;Ouml;zelliği&lt;/td&gt;
&lt;td align="center" bgcolor="#cccccc" width="73%" height="28"&gt;A&amp;ccedil;ıklaması&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="left" width="194" height="14"&gt;OleDbSchemaGuid .Columns&lt;/td&gt;
&lt;td align="left" width="73%" height="14"&gt;Tablo veya tablolara ait s&amp;uuml;tun yapısını sağlar.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="left" width="194" height="28"&gt;OleDbSchemaGuid .Procedures&lt;/td&gt;
&lt;td align="left" width="73%" height="28"&gt;OleDbConnection nesnesinin bağlı olduğu veritabanında yer alan saklı yordamların listesini sağlar.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="left" width="194" height="28"&gt;OleDbSchemaGuid .Views&lt;/td&gt;
&lt;td align="left" width="73%" height="28"&gt;OleDbConnection nesnesinin bağlı olduğu veritabanında yer alan g&amp;ouml;r&amp;uuml;n&amp;uuml;mlerin listesini sağlar.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="left" width="194" height="14"&gt;OleDbSchemaGuid .Indexes&lt;/td&gt;
&lt;td align="left" width="73%" height="14"&gt;Belirtilen Catalog'da yer alan indexlerin listesini sağlar.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="left" width="194" height="14"&gt;OleDbSchemaGuid .Primary_Keys&lt;/td&gt;
&lt;td align="left" width="73%" height="14"&gt;Belirtilen tablo veya tablolardaki birincil anahtarların listesini verir.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p align="left"&gt;Tablo 1. OleDbSchemaGuid &amp;Uuml;yelerinin Bir Kısmı&lt;/p&gt;
&lt;p&gt;OleDbSchemaGuid sınıfı yukarıdaki &amp;ouml;rnek &amp;uuml;yelerinin yanısıra pek &amp;ccedil;ok &amp;uuml;yeye sahiptir. Bu &amp;uuml;yeler ile ilgili daha geniş bilgi i&amp;ccedil;in MSDN kaynaklarından faydalanmanızı tavsiye ederim. GetOleDbSchemaTable metodumuz ikinci bir parametre daha almaktadır. Bu parametre ile şema bilgisi &amp;uuml;zerindeki sınırlamaları belirleriz. Bu sayede, ilk parametrede istediğimiz schema bilgilerinin sadece belirli bir tablo i&amp;ccedil;inmi,&amp;nbsp; yada veritabanının tamamı i&amp;ccedil;inmi oluşturulacağına dair sonu&amp;ccedil;ları elde etmiş oluruz. &amp;Ouml;rneklerimizi incelediğimizde bu parametrelerin ne işe yaradıklarını daha iyi anlayacağınızı d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Şimdi ilk &amp;ouml;rneğimizi geliştirelim. Basit bir Console uygulaması olarak geliştireceğimiz bu &amp;ouml;rnekte, Sql sunucumuzda yer alan, Friends isimli veritabanındaki t&amp;uuml;m tabloların bir listesini elde edeceğiz. İşte program kodlarımız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

/* OleDb isim uzayını ve Data isim uzayını ekliyoruz. */

using System.Data;
using System.Data.OleDb;
namespace GetOleDbSchemaTables1
{
     class Class1
     {
          static void Main(string[] args)
          {
               /* OleDbConnection nesnemizi oluşturuyoruz. SQLOLEDB provider'ını kullanarak, Sql sunucumuzda yer alan Friends isimli veritabanına bir bağlantı nesnesi tanımlıyoruz. */
               OleDbConnection con=new OleDbConnection("provider=SQLOLEDB;data source=localhost;initial catalog=Friends;Integrated Security=sspi");
               con.Open(); /* Bağlantımızı a&amp;ccedil;ıyoruz. */
               DataTable tblTabloListesi; /* GetOleDbSchemaTable metodunun sonucunu tutacak DataTable nesnemizi tanımlıyoruz.*/

               tblTabloListesi=con.GetOleDbSchemaTable(OleDbSchemaGuid.Tables,null); /* OleDbConnection nesnemizin, GetOleDbSchemaTable metodunu &amp;ccedil;alıştırıyoruz ve elde edilen şema bilgisini (ki bu &amp;ouml;rnekte Friends isimli veritabanındaki t&amp;uuml;m tabloların listesini alıyor.) alıyoruz ve DataTable nesnemizin bellete referans ettiği alana aktarıyoruz.*/

               foreach(DataRow dr in tblTabloListesi.Rows) /* DataTable'ımız i&amp;ccedil;indeki satırlarda gezinebileceğimiz bir d&amp;ouml;ng&amp;uuml; oluşturuyoruz ve bu d&amp;ouml;ng&amp;uuml; i&amp;ccedil;inde her bir satırın TABLE_NAME alanının değerini, dolayısıyla Friends veritabanındaki tablo adlarını ekrana yazdırıyoruz. */
               {
                    Console.WriteLine(dr["TABLE_NAME"]);
               }
          }
     }
}&lt;/pre&gt;
&lt;p&gt;Şimdi uygulamamızı &amp;ccedil;alıştırdığımızda Friends isimli veritabanında yer alan t&amp;uuml;m tabloların ekrana yazıldığını g&amp;ouml;r&amp;uuml;rs&amp;uuml;n&amp;uuml;z.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk53_1.gif" alt="" width="293" height="439" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 1. Friends veritabanındaki tabloların listesi.&lt;/p&gt;
&lt;p&gt;Şimdi kodlarımızdaki blTabloListesi=con.GetOleDbSchemaTable(OleDbSchemaGuid.Tables,null); satırını daha yakından incelemeye &amp;ccedil;alışalım. İlk parametremiz OleDbSchemaGuid.Tables, con isimli OleDbConnection nesnemizin bağlandığı Sql sunucusundaki Friends veritabanından sadece tablo bilgilerini elde etmek istediğimizi g&amp;ouml;stermektedir. Sınırlandırıcı &amp;ouml;zelliğe sahip olan ikinci parametremize null değerini vererek t&amp;uuml;m tabloların şemaya dahil edilmesini ve DataTable nesnesine aktarılmasını sağlamış olduk. Bu noktada bu iki parametrenin birbirleri ile ilişkil olduklarını s&amp;ouml;yleyebiliriz. &amp;Ccedil;&amp;uuml;nk&amp;uuml;, OleDbSchemaGuid parametresinin vereceği tabloların şema yapısı, ikinci parametreye bağlıdır. Ş&amp;ouml;yleki;&lt;/p&gt;
&lt;div&gt;
&lt;table id="AutoNumber7" style="width: 100%; height: 103px;" border="1" cellspacing="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#cccccc" width="112" height="28"&gt;Sınırlama Alanı&lt;/td&gt;
&lt;td align="center" bgcolor="#cccccc" width="84%" height="28"&gt;A&amp;ccedil;ıklaması&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="112" height="14"&gt;TABLE_CATALOG&lt;/td&gt;
&lt;td width="84%" height="14"&gt;Katalog adı. Eğer provider'ımız katalogları desteklemiyorsa null değeri verilir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="112" height="14"&gt;TABLE_SCHEMA&lt;/td&gt;
&lt;td width="84%" height="14"&gt;Şema adı. Yine provider'ımız şemaları desteklemiyorsa null değeri verilir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="112" height="14"&gt;TABLE_NAME&lt;/td&gt;
&lt;td width="84%" height="14"&gt;Belirli bir tabloya ait şema bilgileri kullanılacaksa, &amp;ouml;rneğin bu tabloya ait s&amp;uuml;tun bilgileri alınıcaksa kullanılır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="112" height="14"&gt;TABLE_TYPE&lt;/td&gt;
&lt;td width="84%" height="14"&gt;Veritabanından hangi tipteki tabloları alacağımızı belirtmek i&amp;ccedil;in kullanılır.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p align="left"&gt;Tablo 2. OleDbSchemaGuid.Tables İ&amp;ccedil;in Sınırlama Parametresi Elemanları&lt;/p&gt;
&lt;p&gt;Ancak farzedelimki sadece kullanıcı tanımlı taboların listesine ihtiyacımız var. İşte bu durumda sınırlandırıcı parametremiz devreye girecek. Bunun i&amp;ccedil;in, sınırlandırıcı parametremizin son elemanının değerini belirlememiz yeterli olucak. O halde bu işlemi nasıl ger&amp;ccedil;ekleştirebiliriz? Bunun i&amp;ccedil;in uygulamamızın kodlarını aşağıdaki şekilde değiştirmemiz yeterlidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;object[] objSinirlama;
objSinirlama=new object[]{null,null,null,"TABLE"};
tblTabloListesi=con.GetOleDbSchemaTable(OleDbSchemaGuid.Tables, objSinirlama);&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk53_2.gif" alt="" width="325" height="175" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 2. Sadece Kullanıcı Tanımlı Tabloların Listesi&lt;/p&gt;
&lt;p&gt;Burada sınırlandırıcı nesnemizin nasıl tanımlandığına dikkat edin. Bu tanımlama biraz karışık gelebilir. Ancak OleDbSchemaGuid&amp;nbsp; &amp;ouml;zelliğinin aldığı değere g&amp;ouml;re şema bilgileri &amp;uuml;zerinde bir sınırlama koymak istiyorsak, bu &amp;uuml;yenin kullanabileceği değerleri bilmemiz gerekir. Burada object dizimizin son elemanın TABLE değeri atanmıştır. TABLE değeri şema bilgisine sadece kullanıcı tarafından tanımlanmış taboların alınacağını belirtir. Diğer yandan bu d&amp;ouml;rd&amp;uuml;nc&amp;uuml; elemana, ALIAS, SYSTEM TABLE, VIEW, SYSTEM VIEW, SYNONYM, TEMPORARY, LOCAL TEMPORARY değerlerinide verebiliriz. Hepsi, OleDbSchemaGuid.Tables parametresi sonucunda oluşturulacak tablo şema bilgilerinin yapısınıda değiştirecektir. &amp;Ouml;rneğin, SYSTEM TABLE değerini vermemiz halinde, Friends tablosundaki system tablolarının listesini elde etmiş oluruz. Yada VIEW değerini verdiğimizde kullanıcı tanımlı g&amp;ouml;r&amp;uuml;n&amp;uuml;m nesnelerinin listesini elde etmiş olurduk.&lt;/p&gt;
&lt;p&gt;Yukarıdaki &amp;ouml;rneğimizde, veritabanımızda yer alan tablolara ait schema bilgilerini aldık. Şimdi ise belirli bir tablonun s&amp;uuml;tun bilgilerini almak istediğimizi farzedelim. Burada s&amp;uuml;tun bilgileri i&amp;ccedil;in,&amp;nbsp; OleDbSchemaGuid.Columns parametresini kullanmamız gerekiyor. Bu durumda sınırlandırıcımızıda bu parametreye g&amp;ouml;re değiştirmek durumundayız. Eğer ilk &amp;ouml;rneğimizdeki gibi null değerini verirsek veritabanındaki t&amp;uuml;m tabloların kolonlarına ait şema bilgilerini elde etmiş oluruz. Oysaki belirli bir tabloya ait alanlar i&amp;ccedil;in şema bilgisi alıcaksak,OleDbSchemaGuid.Columns parametresinin sınırlandırıcı koşullarını değiştirmemiz gerekecektir. İşte bu noktada sınırlandırıcı değişkenimizin &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; elemanı olan TABLE_NAME elemanını kullanırız. Bu ama&amp;ccedil;la kodlarımızı aşağıdaki şekilde değiştirmemiz yeterli olucaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;object[] objSinirlama;

objSinirlama=new object[]{null,null,"Kitap",null};
tblTabloListesi=con.GetOleDbSchemaTable(OleDbSchemaGuid.Columns, objSinirlama); /* OleDbConnection nesnemizin, GetOleDbSchemaTable metodunu &amp;ccedil;alıştırıyoruz. Bu kez, Columns değeri sayesinde, sınırlama nesnemizin &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; elemanında belirttiğimiz tablo adına ait alanların listesini elde ediyoruz. */
foreach(DataRow dr in tblTabloListesi.Rows)
{
     Console.WriteLine(dr["COLUMN_NAME"]);
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk53_3.gif" alt="" width="269" height="187" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 3. Tablomuza ait alanların adları.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece Kitap isimli tablomuzun alanlarına ait schema bilgilerini elde etmiş olduk. Bu &amp;ouml;rnekte ve bir &amp;ouml;nceki &amp;ouml;rnekte dikkat ederseniz, DataTable nesnesindeki belirli bir alanın değerini ekrana yazdırdık. Bu &amp;ouml;rnekte, COLUMN_NAME, &amp;ouml;nceki &amp;ouml;rnekte ise, TABLE_NAME. Elbette elde ettiğimiz şema bilgilerinde sadece bu alanlar yer almıyor. &amp;Ouml;rneğin Friends veritabanındaki kullanıcı tanımlı tablolara ait başka ne t&amp;uuml;r bilgilerin şemaya alındığına bir bakalım. Bu ama&amp;ccedil;la, DataTable nesnemize aktarılan şema bilgilerine ait satırlardaki t&amp;uuml;m alanları bir d&amp;ouml;ng&amp;uuml; ile gezmemiz yeterli olucaktır. Bunu aşağıdaki kodlar ile ger&amp;ccedil;ekleştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;object[] objSinirlama;

objSinirlama=new object[]{null,null,null,"TABLE"};
tblTabloListesi=con.GetOleDbSchemaTable(OleDbSchemaGuid.Tables, objSinirlama);
foreach(DataRow dr in tblTabloListesi.Rows)
{
     for(int i=0;i&amp;lt;=tblTabloListesi.Rows.Count;++i)
     {
          Console.Write(dr[i]);
          Console.Write("---");
     }
     Console.WriteLine("");
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk53_4.gif" alt="" width="645" height="151" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 4. Şemadaki diğer bilgiler.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-02-12 12:00:00</pubDate>
  <slug>GetOleDbSchemaTable-Metodu-Ile-Veritabanc4b1mc4b1zda-Ne-Var-Ne-Yok-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>oledb</tag>
    <tag>get-ole-db-schema-table</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>