<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF Servis Yolunda Debelenirken</title>
  <description>Geçtiğimiz günlerde çalıştığım turuncu bankada bölümüm değişti. Yeni bölümümdeki ilk görevim ise ServiceStack yerini alabilecek bir çatının oluşturulması konusunda bir takım POC çalışmalarının yapılması. Önemli hedeflerden birisi Servislerin IIS bağımsız dinamik olarak ayağa kaldırılması ve servislere gidip gelen mesajların yakalanabildiğinin görülmesi. Epey zamandır WCF alt tarafında çalışmamıştım. Pas tuttuğumu itiraf edeyim. Tabii yazının konusu devam etmekte olan POC çalışmasının tamamını anlatmak değil ancak dinamik olarak host edilen servislere gelen ve servisten dönen mesajları nasıl yakalayabiliriz bunun bir yolunu göstermeye çalışacağım.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/07/wcf_message_8.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde &amp;ccedil;alıştığım turuncu bankadaki b&amp;ouml;l&amp;uuml;m&amp;uuml;m değişti. İsmini halen ezberleyemediğim Yazılım Geliştirme Sistemleri ve Platform Uygulamaları b&amp;ouml;l&amp;uuml;m&amp;uuml;nde yaşamımı s&amp;uuml;rd&amp;uuml;rmeye devam ediyorum. Yeni b&amp;ouml;l&amp;uuml;m&amp;uuml;mdeki ilk g&amp;ouml;revim ise ServiceStack yerini alabilecek bir &amp;ccedil;atının oluşturulması konusunda bir takım POC &amp;ccedil;alışmalarının yapılması. &amp;Ouml;nemli hedeflerden birisi WCF(Windows Communication Foundation) servislerinin IIS(Internet Information Services) bağımsız olarak dinamik bir şekilde ayağa kaldırılması ve istemci ile sunucu arasındaki&amp;nbsp;mesajların yakalanarak kayıt altına alınabildiğinin g&amp;ouml;r&amp;uuml;lmesi.&lt;/p&gt;
&lt;p&gt;Epey zamandır WCF ile &amp;ccedil;alışmadığımdan baya pas tuttuğumu itiraf etmek isterim. Yazının konusu, devam etmekte olan POC(Proof of Concept) &amp;ccedil;alışmasının tamamını anlatmak değil ancak dinamik olarak host edilen servislere gelen ve servisten d&amp;ouml;nen mesajları nasıl yakalayabiliriz bunun bir yolunu bulmaya&amp;nbsp;&amp;ccedil;alışmak. Hatta bu konuda &amp;ccedil;ok yakın bir zamanda sevdiğim bir dostumun da sorusu olmuştu. Entegre olunan bir servise gelip giden mesajları nasıl yakalayabiliriz. Normal şartlarda WCF'in Trace ve Logging mekanizmalarını kullanarak bu m&amp;uuml;mk&amp;uuml;n ve olduk&amp;ccedil;a kolay ama hedef buradaki takibi kontrol atlına almak. Yani mesajları yakaladığımız yerlerde araya girerek başlangı&amp;ccedil; i&amp;ccedil;in sadece loglamak(&amp;ouml;rneğin Console'a yazdırmak)&lt;/p&gt;
&lt;h1&gt;&amp;Ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;n Kısa Bir &amp;Ouml;zeti&lt;/h1&gt;
&lt;p&gt;Solution i&amp;ccedil;eriği genel hatları ile aşağıdaki gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/07/wcf_message_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;SDK klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisinde diğer servis geliştiriciler i&amp;ccedil;in temel bir s&amp;ouml;zleşme sunmayı planladım. Aşağıdaki gibi bir aray&amp;uuml;z(Interface) tipim var &amp;ouml;rneğin.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ServiceModel;

namespace ING.ServiceFabric.SDK
{
    [ServiceContract]
    public interface ITunnelContract
    {
        [OperationContract]
        TunnelResponse Execute(TunnelRequest request);
    }
}&lt;/pre&gt;
&lt;p&gt;Hatta ISV klas&amp;ouml;r&amp;uuml;ndeki projeler bu SDK'yı kullanarak geliştirilmiş &amp;ouml;rnek servis k&amp;uuml;t&amp;uuml;phaneleri de i&amp;ccedil;ermekte. Aşağıdaki kod par&amp;ccedil;asında &amp;ouml;rnek bir uygulamasını g&amp;ouml;rebilirsiniz. ITunnelContract aray&amp;uuml;z&amp;uuml; ServiceContract ve OperationContract nitelikleri sayesinde FraudCheckService tipine WCF Servis &amp;ouml;zelliğini kazandırmakta.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using ING.ServiceFabric.SDK;

namespace DAEXServiceLibrary
{
    public class FraudCheckService
        :ITunnelContract
    {
        public TunnelResponse Execute(TunnelRequest request)
        {
            return new TunnelResponse
            {
                 Output="Fraud check for customer"
            };
        }
    }
}&lt;/pre&gt;
&lt;p&gt;TEST klas&amp;ouml;r&amp;uuml;nde tahmin edileceği &amp;uuml;zere Unit Test ve benzeri Console uygulamaları yer almakta.&lt;/p&gt;
&lt;h1&gt;JSON Bazlı Konfigurasyon&lt;/h1&gt;
&lt;p&gt;HOST isimli klas&amp;ouml;rde yer alan ServiceFabric projesinde bir Assembly i&amp;ccedil;erisinde duran servislerin ayağa kaldırılması ile ilgili işlemler yer alıyor. Ama nasıl? Kısaca neler yapmaya &amp;ccedil;alıştığımı anlatayım.&lt;/p&gt;
&lt;p&gt;WCF'in standart konfigurasyon sistemi config uzantılı dosyaları kullanmakta. Bir Web uygulaması s&amp;ouml;z konusu ise web.config diğerleri i&amp;ccedil;inse app.config ağırlıklı olarak kullanılıyor. Bu davranışı değiştirmenin bir yolu var mı hen&amp;uuml;z bilmiyorum ama ServiceHost tipi ile servisleri dinamik olarak &amp;ccedil;alışma zamanında ayağa kaldırabildiğimizi ve bir takım ayarları kod tarafında yapabildiğimizin farkındayım. Bu nedenle servislere ait &amp;ccedil;alışma zamanı ayarlarını JSON formatında bir konfigurasyon dosyası olarak tutmaya &amp;ccedil;alıştım. Aşağıdaki gibi &amp;ouml;rnek bir JSON i&amp;ccedil;eriğini kullanıyorum.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/07/wcf_message_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İ&amp;ccedil;eriği &lt;a href="/admin/app/editor/jsoneditoronline.org" target="_blank"&gt;jsoneditoronline.org&lt;/a&gt; &amp;uuml;zerinden oluşturmaya &amp;ccedil;alıştım. Nesne yapısını kurgulamam şimdilik yeterliydi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/07/wcf_message_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabii projenin ilerleyen g&amp;uuml;nlerinde bu JSON i&amp;ccedil;eriğini oluşturacak ve okuyacak sınıfları sisteme dahil etmeyi de ihmal etmedim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using ING.ServiceFabric.ConfigurationTypes;
using Newtonsoft.Json;
using System.IO;

namespace ING.ServiceFabric
{
    public class HostPackManager
    {
        public static HostPack ReadPack(string packFile)
        {
            HostPack pack = JsonConvert.DeserializeObject&amp;lt;HostPack&amp;gt;(File.ReadAllText(packFile));
            Environment environment = JsonConvert.DeserializeObject&amp;lt;Environment&amp;gt;(File.ReadAllText(pack.EnvironmentConfig));
            pack.AssemblyName = Path.Combine(environment.DllRootPath, pack.AssemblyName);

            return pack;
        }

        public static string WritePack(HostPack pack, string packFilePath)
        {
            string jsonContent=JsonConvert.SerializeObject(pack);
            File.WriteAllText(packFilePath,jsonContent);
            return jsonContent;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Burada yine detaya girmeyeceğim ancak JSON i&amp;ccedil;eriğini y&amp;ouml;netimli kod tarafında daha kolay idare etmek i&amp;ccedil;in HostPack ve Environment gibi sınıflar da yer almakta. Aynen .Net'in XML odaklı konfigurasyon dosyalarına olan yaklaşımı gibi. Her section'a karşılık gelecek bir sınıf.&lt;/p&gt;
&lt;p&gt;Konfigurasyon dosyasının i&amp;ccedil;eriğinde tutulan bilgileri nasıl kullanmak istediğime gelince. Her şeyden &amp;ouml;nce &amp;ccedil;alışma zamanında y&amp;uuml;klenecek olan servisleri bir klas&amp;ouml;rdeki dll'lerden almak istiyorum. Yani Host uygulama kullanacağı servisleri projeye referans etmeye gerek duymadan ayağa kaldıracak. Bu nedenle i&amp;ccedil;erde kullanılacak dll bilgisini ve başka &amp;ccedil;evresel değişkenleri tutan bir dosya bilgisini tutmayı d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m. Kullanacağım ServiceHost tipinin bir BaseAddress ihtiyacı da olacak. Bunların dışında host'un sunacağı servisleri de bir şekilde tanımlamam gerekiyor. Servisin tip adı dışında Address Binding Contract &amp;uuml;&amp;ccedil;lemesini de burada tutuyorum. Her servis i&amp;ccedil;in Metadata paylaşımı olacak mı, &amp;ccedil;alışma zamanındaki Exception detayları basılacak mı gibi aşina olduğumuz bilgileri de ilgili alanlarda tutmaktayım. Bu i&amp;ccedil;eriğe g&amp;ouml;re FraudCheckService WSHttpBinding ile host edilecek. Diğer yandan hen&amp;uuml;z sertifika tanımlamamalarını entegre edecek kodları yazamadığımdan BasicHttpsBinding kullanan servisi test edememekteyim.&lt;/p&gt;
&lt;h1&gt;ServiceHost T&amp;uuml;revli TowerHost&lt;/h1&gt;
&lt;p&gt;Genel hatları ile konfigurasyon bilgisini tutmayı bu şekilde kurgulamaya &amp;ccedil;alıştım. ServiceHost t&amp;uuml;revli tipin i&amp;ccedil;eriği ise aşağıdaki şekilde.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace ING.ServiceFabric
{
    public class TowerHost
        :ServiceHost
    {
        public TowerHost(Type serviceType,params Uri[] baseAddresses)
            :base(serviceType,baseAddresses)
        {
        }
    }
}&lt;/pre&gt;
&lt;p&gt;TowerHost sınıfı tipik olarak ServiceHost tipinden t&amp;uuml;remekte ve base kullanımı ile yapıcı metoduna gelen parametreleri doğrudan ServiceHost tipinin uygun yapıcısına aktarılmakta. Burada sonradan override etmeyi d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m &amp;uuml;st sınıf &amp;uuml;yeleri olacak. Şimdilik bu sade haliyle kalması yeterli. Gelelim asıl&amp;nbsp;işi yapan TowerHostFactory sınıfına.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using ING.ServiceFabric.ConfigurationTypes;
using ING.ServiceFabric.EndpointBehaviors;
using ING.ServiceFabric.SDK;
using System;
using System.Collections.Generic;
using System.Reflection;
using System.ServiceModel;
using System.ServiceModel.Channels;
using System.ServiceModel.Description;

namespace ING.ServiceFabric
{
    public class TowerHostFactory
    {
        public List&amp;lt;TowerHost&amp;gt; CreateTowerHost(string packFile)
        {
            List&amp;lt;TowerHost&amp;gt; hostList = new List&amp;lt;TowerHost&amp;gt;();
            HostPack pack=HostPackManager.ReadPack(packFile);            
            var assembly = Assembly.LoadFile(pack.AssemblyName);
            foreach (var service in pack.Services)
            {
                ServiceInfo sInfo = GetServiceInfo(service);
                var host=CreateTowerHost(assembly, sInfo);
                hostList.Add(host);
            }

            return hostList;
        }

        private TowerHost CreateTowerHost(Assembly assembly,ServiceInfo serviceInfo)
        {
            object service = assembly.CreateInstance(serviceInfo.TypeName);
            
            var host = new TowerHost(service.GetType(),new Uri(serviceInfo.Address));
            var bindingTypeName = string.Format("System.ServiceModel.{0}", serviceInfo.BindingName);
            var serviceModelAssembly = Assembly.GetAssembly(typeof(BasicHttpBinding));
            Binding bindingInstance = (Binding)serviceModelAssembly.CreateInstance(bindingTypeName);             
            var endPoint=host.AddServiceEndpoint(typeof(ITunnelContract), bindingInstance,serviceInfo.Address);
            endPoint = SetMetadataBehavior(serviceInfo, host, bindingInstance, endPoint);
            //endPoint = SetServerCertificate(serviceInfo, host,endPoint);
            host.Description.Behaviors.Find&amp;lt;ServiceDebugBehavior&amp;gt;().IncludeExceptionDetailInFaults = serviceInfo.IncludeExceptionDetails;
            endPoint.EndpointBehaviors.Add(new EndpointMessageInspectorBehavior());

            return host;
        }

        private ServiceEndpoint SetServerCertificate(ServiceInfo serviceInfo,TowerHost host,ServiceEndpoint endpoint)
        {
            //host.Credentials.ServiceCertificate.SetCertificate()            
            throw new NotImplementedException();           
        }

        private static ServiceEndpoint SetMetadataBehavior(ServiceInfo serviceInfo, TowerHost host, Binding bindingInstance, ServiceEndpoint endPoint)
        {
            ServiceMetadataBehavior metadataBehavior = new ServiceMetadataBehavior();
            host.Description.Behaviors.Add(metadataBehavior);

            if (serviceInfo.BindingName != "System.ServiceModel.NetTcpBinding")
            {
                if (bindingInstance.Scheme == "https")
                {
                    metadataBehavior.HttpsGetEnabled = serviceInfo.MetadataEnabled;
                    metadataBehavior.HttpsGetUrl = new Uri(string.Format("{0}/mex", serviceInfo.Address));
                }
                else
                {
                    metadataBehavior.HttpGetEnabled = serviceInfo.MetadataEnabled;
                    metadataBehavior.HttpGetUrl = new Uri(string.Format("{0}/mex", serviceInfo.Address));
                }
            }
            else
            {
                endPoint = host.AddServiceEndpoint(typeof(IMetadataExchange), MetadataExchangeBindings.CreateMexTcpBinding(), serviceInfo.Address);
            }
            return endPoint;
        }

        private static ServiceInfo GetServiceInfo(ServiceInfo service)
        {
            ServiceInfo sInfo = new ServiceInfo();
            sInfo.Address = service.Address;
            sInfo.BindingName = service.BindingName;
            sInfo.IncludeExceptionDetails = service.IncludeExceptionDetails;
            sInfo.MetadataEnabled = service.MetadataEnabled;
            sInfo.TypeName = service.TypeName;
            return sInfo;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu sınıfta yapılan bazı kritik işler var ama kod epey dağınık halde diyebilirim. List&amp;lt;TowerHost&amp;gt; d&amp;ouml;nd&amp;uuml;ren CreateTowerHost metodunun g&amp;ouml;revi olduk&amp;ccedil;a basit. Parametre olarak gelen packFile bilgisini alıyor, JSON konfigurasyon i&amp;ccedil;eriğini okuyor, tanımlı olan&amp;nbsp;Assembly'ı y&amp;uuml;kl&amp;uuml;yor ve konfigurasyon da belirtilen her bir servis tipi i&amp;ccedil;in birer TowerHost nesne &amp;ouml;rneği &amp;uuml;retip listeye ekliyor. TowerHost tipini d&amp;ouml;nd&amp;uuml;ren ikinci fonksiyon biraz daha karmaşık. Az biraz reflection ile parametre olarak gelen servis tipini &amp;ouml;rnekleyip, JSON dosyasından okunup ServiceInfo sınıfına alınan değerlere bakarak ayarlamalar yapmakta. S&amp;ouml;z gelimi gerekli Binding tipini &amp;uuml;retiyor, EndPoint oluşturuyor, Metadata Publishing değerlerini ve IncludeExceptionDetailsInFault bilgisini set ediyor. Metadata davranışının eklenmesi &amp;uuml;zerine de halen &amp;ccedil;alışmaktayım. Nitekim NetTcpBinding s&amp;ouml;z konusu olduğunda IMetadataExchange aray&amp;uuml;z&amp;uuml;n&amp;uuml;n kullanılarak bir publishing yapmak gerekiyor. Başka Binding tiplerinde farklı davranışlar sergilenmesi de gerekebilir. Her ne kadar if kullanmayı sevmesemde, POC olmasının verdiği rahatlıkla b&amp;ouml;yle bir kod par&amp;ccedil;ası da eklemiş bulundum (:&lt;/p&gt;
&lt;h1&gt;Mesajların Yakalanması&lt;/h1&gt;
&lt;p&gt;Yazının ana konusu olan mesaj yakalama kısmı ise şu satırda ger&amp;ccedil;ekleştiriliyor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;endPoint.EndpointBehaviors.Add(new EndpointMessageInspectorBehavior());&lt;/pre&gt;
&lt;p&gt;O anki EndPoint bilgisine, EndpointMessageInspectorBehavior tipinden bir nesne &amp;ouml;rneği davranış olarak ekleniyor. Yani Endpoint'e &amp;ouml;zel bir davranış ekleyerek genişletiyoruz. İ&amp;ccedil;eriği basit&amp;ccedil;e aşağıdaki gibi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using ING.ServiceFabric.Dispatchers;
using System.ServiceModel.Description;

namespace ING.ServiceFabric.EndpointBehaviors
{
    public class EndpointMessageInspectorBehavior
        : IEndpointBehavior
    {

        public void AddBindingParameters(ServiceEndpoint endpoint, System.ServiceModel.Channels.BindingParameterCollection bindingParameters)
        {
        }

        public void ApplyClientBehavior(ServiceEndpoint endpoint, System.ServiceModel.Dispatcher.ClientRuntime clientRuntime)
        {
        }

        public void ApplyDispatchBehavior(ServiceEndpoint endpoint, System.ServiceModel.Dispatcher.EndpointDispatcher endpointDispatcher)
        {            
            endpointDispatcher.DispatchRuntime.MessageInspectors.Add(new MessageInspector());
        }

        public void Validate(ServiceEndpoint endpoint)
        {
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Hen&amp;uuml;z sadece ApplyDispatchBehavior metodu kullanılmakta. Bu metoda gelen endpointDispatcher nesnesi &amp;uuml;zerinden &amp;ccedil;alışma zamanında oluşan servis kanalına&amp;nbsp;gidip araya giriyoruz. Bunu yaparken de MessageInspectors koleksiyonuna yeni bir dinleyici ekliyoruz.&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel.Dispatcher;

namespace ING.ServiceFabric.Dispatchers
{
    public class MessageInspector
        :IDispatchMessageInspector
    {
        public object AfterReceiveRequest(ref System.ServiceModel.Channels.Message request, System.ServiceModel.IClientChannel channel, System.ServiceModel.InstanceContext instanceContext)
        {            
            Console.WriteLine("In AfterReceiveRequest");
            Console.WriteLine("\t{0}",request.ToString());

            return null;
        }

        public void BeforeSendReply(ref System.ServiceModel.Channels.Message reply, object correlationState)
        {
            Console.WriteLine("In BeforeSendReply");
            Console.WriteLine("\t{0}",reply.ToString());
        }
    }
}&lt;/pre&gt;
&lt;p&gt;IDispatchMessageInspector aray&amp;uuml;z&amp;uuml;nden t&amp;uuml;reyen MessageInspector sınıfının uyguladığı iki operasyon var. AfterReceiveRequest ve BeforeSendReply. AfterReceiveRequest ile servisin ilgili EndPoint'inden ge&amp;ccedil;en mesajı yakalıyoruz. BeforeSendReply ise istemciye d&amp;ouml;nen mesaj gitmeden &amp;ouml;nce devreye girmekte. Ben sonu&amp;ccedil;ları g&amp;ouml;rmek i&amp;ccedil;in ilgili bilgileri Console'a basıyorum. Hedef pek tabii etkili bir Log mekanizması ile ilgili mesajları kayıt altına almak. Burada mesaj i&amp;ccedil;eriğine bakılarak daha pek &amp;ccedil;ok aksiyon da alınabilir gibime geliyor.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Aslında WCF'in &amp;ccedil;alışma zamanındaki işleyişini g&amp;ouml;steren &lt;a href="https://opbuildstorageprod.blob.core.windows.net/output-pdf-files/en-us/VS.core-docs/live/articles/framework/wcf/extending.pdf"&gt;Microsoft dok&amp;uuml;manının&lt;/a&gt; 19ncu sayfasındaki grafiğe bakınca olay daha kolay anlaşılıyor. Burada EndpointDispatcher'ın yaşamı boyunca enjekte edilebilecek bir &amp;ccedil;ok enstr&amp;uuml;man g&amp;ouml;r&amp;uuml;lmekte.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/07/wcf_message_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;&amp;Ccedil;alışma Zamanı&lt;/h1&gt;
&lt;p&gt;Unit Test projesi i&amp;ccedil;erisinde pek &amp;ccedil;ok test metodu var tabii ama benim i&amp;ccedil;in en g&amp;uuml;zel test ortamı tabii ki sevimsiz Console penceresi. Bu Console projelerinden birisi JSON dosyasından okuduğu bilgileri kullanarak servisleri ayağa kaldırırken diğeri istemci rol&amp;uuml;n&amp;uuml; &amp;uuml;stlenmekte ve &amp;ouml;rnek bir servise mesaj atıp cevap almakta. Host uygulamayı şu şekilde geliştirdim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using ING.ServiceFabric;
using System;

namespace StandAloneHost
{
    class Program
    {
        static void Main(string[] args)
        {
            var packPath = "c:\\c\\ISV\\daexHost.json";
            var hostFactory = new TowerHostFactory();
            var hostList = hostFactory.CreateTowerHost(packPath);
            foreach (var host in hostList)
            {
                host.Open();
                Console.WriteLine("{0},{1}",host.Description.Name,host.State);
            }
            Console.WriteLine("{0} adet host dinlemede. Host'ları kapatmak i&amp;ccedil;in bir tuşa basınız",hostList.Count);
            Console.ReadLine();
            foreach (var host in hostList)
            {
                host.Close();
                Console.WriteLine("{0},{1}",host.Description.Name,host.State);
            }            
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Tabii &amp;ouml;nce bu uygulamayı &amp;ccedil;alıştırıp ayağa kalkan bir servise ait WSDL i&amp;ccedil;eriği geliyor mu bir bakmak ve bu i&amp;ccedil;eriği kullanarak istemciye Proxy &amp;uuml;retmek gerekiyordu. localhost:5000/daex/FraudCheckService adresinden yayın yapan WSHttpBinding bazlı servisi ayağa kaldırdığımda servise ulaşabildiğimi ve WSDL i&amp;ccedil;eriğini yakalayabildiğimi g&amp;ouml;zlemledim.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/07/wcf_message_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve wsdl i&amp;ccedil;eriği&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/07/wcf_message_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Nihayetinde bir klas&amp;ouml;rde tutulan dll i&amp;ccedil;erisindeki servisleri ayağa kaldırıp bunlara gelen istemci taleplerini ve d&amp;ouml;nen cevapları yakalayabilmeyi başardığımı ifade edebilirim.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/07/wcf_message_7l.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;POC &amp;ccedil;alışması &amp;uuml;zerinde halen devam etmekteyim. Yapmam gereken &amp;ccedil;ok şey var. WCF'in standart konfigurasyon yapısı d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde &amp;ccedil;ok daha hafif bir &amp;ccedil;atı kurmaya &amp;ccedil;alışıyorum. Sıradaki hedefler arasında Authentication ve Authorization gibi Cross Cutting'lerin &amp;ccedil;alışma zamanındaki servis yoluna nasıl enjekte edilebileceği konusu var. &amp;nbsp;&amp;Ouml;zetle yazılımcıların geliştireceği her bir servis k&amp;uuml;t&amp;uuml;phanesinin kendi HostPack.json i&amp;ccedil;eriğine sahip olacağı bir d&amp;uuml;nyanın peşinden koştuğumu ifade edebilirim. Sadece ihtiya&amp;ccedil; duyduğumuz &amp;ccedil;alışma zamanı davranışlarının var olan standart WCF &amp;ccedil;atısından farklılaştırılarak entegre edildiği hafif bir &amp;ccedil;atı. İşin aslı burada daha yeni d&amp;uuml;nyaları denemek isterdim. S&amp;ouml;z gelimi bu servis &amp;ccedil;atısını GO dilini kullanarak geliştirmek ve performansın ger&amp;ccedil;ekten de s&amp;ouml;ylendiği kadarı y&amp;uuml;ksek olup olmadığını g&amp;ouml;rmek isterdim. Bakalım nelerle karşılaşacağım. POC &amp;uuml;zerinde ilerledik&amp;ccedil;e pek &amp;ccedil;ok sorunla karşılaşıyor ve &amp;ccedil;&amp;ouml;zmeye &amp;ccedil;alışırken yeni yeni şeyler &amp;ouml;ğreniyorum. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-07-17 21:47:00</pubDate>
  <slug>wcf-servis-yolunda-debelenirken</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
    <tag>service-host</tag>
    <tag>i-dispatch-message-inspector</tag>
    <tag>runtime-dispatcher</tag>
    <tag>message-inspectors</tag>
    <tag>reflection</tag>
    <tag>dynamic-service-host</tag>
    <tag>json</tag>
    <tag>newtonsoft</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>