<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>TPL(Task Parallel Library) Nedir? [Beta 1]</title>
  <description>Özellikle işlemcilerin bu şekilde ilerlemesine paralel olarak, yazılım geliştirme ortamlarında da pekala pek çok değişiklik ve yenilikçi fikir ortaya çıktı. Son zamanların özellikle Microsoft .Net cephesindeki en popüler konularından biriside paralel genişletmeler(Parallel Extensions). Bir başka deyişle, sistemin sahip olduğu işlemci gücünün tümünü kullanarak(Arabanın hakkını ver hakkını Smile ), paralel işlemler veya eş zamanlı yürütmelerin gerçekleştirilmesi.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Uzun uzun zaman &amp;ouml;nceydi. İlk bilgisayarımı daha d&amp;uuml;n gibi hatırlıyorum. Efsane&amp;nbsp;&lt;strong&gt;Commodore 64&lt;/strong&gt;.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg26_8.jpg" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;A&amp;ccedil;ık&amp;ccedil;ası onunla yaptığım tek şey oyun oynamaktı itiraf ediyorum. En &amp;ccedil;ok sevdiğim oyunlar arasında &lt;strong&gt;Grean Beret, Barbarian, Karate Kid 2, 1942, Airwolf&lt;/strong&gt; vardı. Gel zaman git zaman, &amp;Uuml;niversite yıllarına girince, bilgisayar işini daha ciddi d&amp;uuml;ş&amp;uuml;nmeye başlamıştım. Yanlış hatırlamıyorsam yaklaşık olarak &lt;strong&gt;2400&lt;/strong&gt; dolar değerinde ( &lt;img title="Money mouth" src="/editors/tiny_mce3/plugins/emotions/img/smiley-money-mouth.gif" alt="Money mouth" border="0" /&gt;) &lt;strong&gt;486DX&lt;/strong&gt; işlemcili bir bilgisayarım daha olmuştu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg26_3.jpg" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sonrada olayların ardı arkası kesilmedi ve &lt;strong&gt;Pentium MMX, Celeron&lt;/strong&gt; derken, &lt;strong&gt;&amp;ccedil;ift &amp;ccedil;ekirdekli&lt;/strong&gt; ve hatta şu sıralarda moda olan &lt;strong&gt;4 &amp;ccedil;ekirdekli&lt;/strong&gt; işlemciler ile karşılaştık.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg26_5.jpg" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle işlemcilerin bu şekilde ilerlemesine paralel olarak, yazılım geliştirme ortamlarında da pekala pek &amp;ccedil;ok değişiklik ve yenilik&amp;ccedil;i fikir ortaya &amp;ccedil;ıktı. Son zamanların &amp;ouml;zellikle &lt;strong&gt;Microsoft .Net&lt;/strong&gt; cephesindeki en pop&amp;uuml;ler konularından biriside &lt;strong&gt;paralel genişletmeler(Parallel Extensions).&lt;/strong&gt; Bir başka deyişle, sistemin sahip olduğu işlemci g&amp;uuml;c&amp;uuml;n&amp;uuml;n t&amp;uuml;m&amp;uuml;n&amp;uuml; kullanarak(Arabanın hakkını ver hakkını&amp;nbsp;&lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt; ), paralel işlemler veya eş zamanlı y&amp;uuml;r&amp;uuml;tmelerin ger&amp;ccedil;ekleştirilmesi. Bildiğiniz gibi paralel genişletmelerin &amp;ouml;nemli kısımlarından birisi olan &lt;strong&gt;PLINQ(Parallel Language INtegrated Query)&lt;/strong&gt;&amp;nbsp;alt yapısı &amp;uuml;zerine yaptığım araştırmalarımı ve edindiğim bilgileri bir s&amp;uuml;redir sizlerle paylaşmaktayım. İşte bu yazımızda diğer &amp;ouml;nemli par&amp;ccedil;a olan (belkide ile etapta incelenmesi gereken) &lt;strong&gt;TPL(Task Parallel Library)&lt;/strong&gt; alt yapısını incelemeye başlıyor olacağız.&lt;/p&gt;
&lt;p&gt;TPL' in en b&amp;uuml;y&amp;uuml;k amacı, eş zamanlı veya paralel olarak y&amp;uuml;r&amp;uuml;t&amp;uuml;lmek istenen işlemlerin, daha kolay ve basit bir şekilde ele alınmasını sağlamaktır. Bu anlamda g&amp;uuml;n&amp;uuml;m&amp;uuml;z işlmecilerinin &amp;ccedil;ekirdek sayısı veya sistemlerdeki işlemci sayısının birden fazla olması durumunda, TPL verimli sonu&amp;ccedil;lar elde etmemizi sağlamaktadır. Bu a&amp;ccedil;ıdan bakıldığında TPL alt yapısına&amp;nbsp;t&amp;uuml;m sistem &amp;ccedil;ekirdek g&amp;uuml;c&amp;uuml;n&amp;uuml; verme imkanına sahip olduğumuzu belirtebiliriz. Ancak elbetteki bu g&amp;uuml;&amp;ccedil; yanlış anlaşılmamalı ve kullanılmamalıdır. Bildiğiniz gibi &lt;strong&gt;"kontrols&amp;uuml;z g&amp;uuml;&amp;ccedil;, g&amp;uuml;&amp;ccedil; değildir"&lt;/strong&gt; derler&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Elbetekki TPL kullanımı ile ilişkili olarak unutulmaması gereken bir noktada, işlemlerin &lt;strong&gt;Multi-Threading&lt;/strong&gt; mantığına g&amp;ouml;re yapılıyor olmasıdır. Dolayısıyla, programın &amp;ccedil;alışma zamanı y&amp;uuml;k&amp;uuml;n&amp;uuml; arttırıcı bir etkendir. Bir başka deyişle her işlemin, elimizde TPL var diye paralel olarak y&amp;uuml;r&amp;uuml;t&amp;uuml;lmeye &amp;ccedil;alışılması doğru değildir. Bazı s&amp;uuml;re&amp;ccedil;lerin ger&amp;ccedil;ekten ve bilin&amp;ccedil;li olaraktan &lt;strong&gt;ardışık(Sequential)&lt;/strong&gt; y&amp;uuml;r&amp;uuml;mesi gerekebilir.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;NOT :&lt;/strong&gt; Aslında, PLINQ(Parallel Language INtegrated Query) kendi alt yapısında TPL tipleri ve &amp;uuml;yelerinden&amp;nbsp;destek almaktadır. &lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Artık olaya biraz daha teknik a&amp;ccedil;ıdan bakabileceğimizi d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. TPL esas itibariyle &lt;strong&gt;.Net Framework 4.0 &lt;/strong&gt;ile birlikte gelen ve paralel işlem yapma yeteneklerini ele alan k&amp;uuml;t&amp;uuml;phanedir. &lt;strong&gt;System.Threading&lt;/strong&gt; ve &lt;strong&gt;System.Threading.Tasks&lt;/strong&gt; isim alanları bu k&amp;uuml;t&amp;uuml;phaneye ait &amp;ccedil;eşitli tipleri ve &amp;uuml;yelerini i&amp;ccedil;ermektedir. TPL, i&amp;ccedil;erisinde birde &lt;strong&gt;Task Scheduler &lt;/strong&gt;i&amp;ccedil;erir. Bu planlayıcı &lt;strong&gt;ThreadPool &lt;/strong&gt;ile &lt;strong&gt;TPL &lt;/strong&gt;tipleri arasındaki entegrasyonu sağlamaktadır. Ancak istenirse kendi &amp;ouml;zel g&amp;ouml;rev planlayıcılarımızı yazabilir ve kullanabiliriz. Ger&amp;ccedil;i benim buna niyetim yok &lt;img title="Embarassed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-embarassed.gif" alt="Embarassed" border="0" /&gt;&amp;nbsp;Aşağıdaki şekilde &amp;ouml;zellikle System.Threading.Tasks isim alanı altında yer alan tipler g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg26_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Geliştirme s&amp;uuml;recinde &amp;ouml;zellikle &lt;strong&gt;System.Threading.Tasks&lt;/strong&gt; isim alanı altında yer alan tipler kullanılmaktadır. TPL k&amp;uuml;t&amp;uuml;phanesinin belkide en &amp;ouml;nemli tipi &lt;strong&gt;Task&lt;/strong&gt; sınıfıdır. Task sınıfına ait &amp;uuml;yeler kullanılarak aşağıdaki işlemleri ger&amp;ccedil;ekleştirebiliriz;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Yeni g&amp;ouml;rev(ler) başlatılabilir, iptal edilebilir yada bekletilebilir.&lt;/li&gt;
&lt;li&gt;Bir g&amp;ouml;revin tamamlanması halinde, tamamlandığı yerden başka bir g&amp;ouml;rev veya g&amp;ouml;revlere &amp;ccedil;ağrıda bulunulabilir.&lt;/li&gt;
&lt;li&gt;Başlatılan g&amp;ouml;revlerden geriye değer d&amp;ouml;nd&amp;uuml;r&amp;uuml;lebilir.&lt;/li&gt;
&lt;li&gt;Bir g&amp;ouml;rev kendi i&amp;ccedil;inde alt g&amp;ouml;revler başlatabilir. Bu g&amp;ouml;revler aynı Thread i&amp;ccedil;erisinde veya farklı bir Thread &amp;uuml;zerinde &amp;ccedil;alışıyor olabilir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;T&amp;uuml;m teorik bilgiler bir yana, konuyu ilk etapta kavramının en kolay yolu basit bir &amp;ouml;rnek &amp;uuml;zerinden ilerlemektir. Bu anlamda, TPL' e &lt;strong&gt;Hello World&lt;/strong&gt; demenin belkide en kolay yolu,&lt;strong&gt; System.Threading&lt;/strong&gt; isim alanı altında yer alan &lt;strong&gt;Parallel&lt;/strong&gt; &lt;strong&gt;static&lt;/strong&gt; sınıfı ve &amp;uuml;yelerini kullanmaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg26_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;For&lt;/strong&gt;, &lt;strong&gt;ForEach&lt;/strong&gt; ve &lt;strong&gt;Invoke&lt;/strong&gt; isimli bizlere &amp;ccedil;ok tanıdık gelen metodlar yer almaktadır. Bu fonskiyonellikleri kullanarak işlemlerin paralel olarak y&amp;uuml;r&amp;uuml;t&amp;uuml;lmesi sağlanabilmektedir. &lt;strong&gt;For&lt;/strong&gt; ve &lt;strong&gt;ForEach&lt;/strong&gt; metodları adlarındanda anlaşılacağı &amp;uuml;zere, koleksiyon veya dizi yapıları &amp;uuml;zerinde d&amp;ouml;ng&amp;uuml;sel işlemlerin paralel olarak&amp;nbsp;y&amp;uuml;r&amp;uuml;t&amp;uuml;lmesini sağlamaktadır. &lt;strong&gt;Invoke&lt;/strong&gt; metodu ise sunduğu &lt;strong&gt;Action&lt;/strong&gt; &lt;strong&gt;temsilcisi(delegate)&lt;/strong&gt; yardımıyla, birden fazla metodun aynı anda paralel olarak &amp;ccedil;alıştırılabilmesine olanak sağlamaktadır.&amp;nbsp;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;For veya ForEach gibi Parallel sınıfına ait &amp;uuml;yeleri kullandığımız hallerdede, arka planda Task sınıfı ve &amp;uuml;yeleri gizlice devreye girerler.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Aşağıdaki &lt;strong&gt;Console&lt;/strong&gt; uygulamasında bu metodalara ait &amp;ouml;rnek kullanımlar yer almaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Linq;
using System.Threading;

namespace HelloTPL
{
    class Program
    {
        static void Main(string[] args)
        {
            int[] numbers = Enumerable.Range(1, 100000).ToArray();

            #region Parallel.For &amp;Ouml;rneği

            // Action temsilcisinin s&amp;ouml;ylediği kurallara uygun olaraktan, lambda operat&amp;ouml;r&amp;uuml;nden yararlanılır.
            Console.WriteLine("For\n");
            Parallel.For(1, numbers.Length, 
                i =&amp;gt;
                {
                    if(i%1500==0)
                        Console.Write("{0} ",i.ToString());
                }
            );
            
            Console.WriteLine("\n\nFor(İ&amp;ccedil;eriden başka metod &amp;ccedil;ağırarak)\n");            
            Parallel.For(1,numbers.Length,
                (i)=&amp;gt;{
                    if (i % 1500 == 0)
                        Task1(i);
                }
            );

            #endregion

            #region Parallel.ForEach &amp;Ouml;rneği

            /* ForEach metodunun 19 aşırı y&amp;uuml;klenmiş versiyonu vardır. İlk dikkati &amp;ccedil;eken nokta, IEnumerable&amp;lt;T&amp;gt; generic aray&amp;uuml;z&amp;uuml;n&amp;uuml;(interface) implemente eden referanslarıda parametre olarak almasıdır. Dolayısıyla, her koleksiyon veya diziye uygulanabilir. */
            Console.WriteLine("\n\nForEach &amp;Ouml;rneği\n");
            Parallel.ForEach(numbers, number =&amp;gt;
            {
                if (number % 1500 == 0)
                    Console.Write("{0} ", number.ToString());
            }
            );

            #endregion

            #region Parallel.Invoke &amp;Ouml;rneği

            Console.WriteLine("\n\n");

            // Parallel.Invoke metodu Action temsilcisi tipinden referanslar alan bir diziyi parametre olarak kullanır.
            // Bu şekilde istenildiği kadar metodun paralel olarak başlatılması sağlanabilir            
            Parallel.Invoke(
                () =&amp;gt;
                {
                    Console.WriteLine("Toplam Tek sayı hesabı başladı\n");
                    Console.WriteLine("Managed Thread ID {0} ",Thread.CurrentThread.ManagedThreadId.ToString());
                    OddCount(numbers);
                    Console.WriteLine("Toplam Tek sayı bulma işi tamamlandı\n");
                },
                () =&amp;gt;
                {
                    Console.WriteLine("Toplam &amp;Ccedil;ift sayı hesabı başladı\n");
                    EvenCount(numbers);
                    Console.WriteLine("Managed Thread ID {0} ", Thread.CurrentThread.ManagedThreadId.ToString());
                    Console.WriteLine("Toplam &amp;Ccedil;ift sayı bulma işi tamamlandı\n");
                }
                ,
                () =&amp;gt;
                {
                    Console.WriteLine("9 ile b&amp;ouml;l&amp;uuml;nenlerin toplamını bulma işi başladı\n");
                    NineCount(numbers);
                    Console.WriteLine("Managed Thread ID {0} ", Thread.CurrentThread.ManagedThreadId.ToString());
                    Console.WriteLine("9 ile b&amp;ouml;l&amp;uuml;nenlerin toplamını bulma işi tamamlandı\n");
                }
        );

            #endregion
        }
        
        static void Task1(int number)
        {
            // Değişiklik işlemler
            Console.Write("{0} ", number.ToString());                
        }

        static void EvenCount(int[] numbers)
        {
            int result = (from number in numbers
                          where number % 2 == 0
                          select number).Count();
            Console.WriteLine("\tDizi i&amp;ccedil;erisinde {0} adet &amp;Ccedil;İFT sayı vardır\n",result.ToString());
        }
        static void OddCount(int[] numbers)
        {
            int result = (from number in numbers
                          where number % 2 != 0
                          select number).Count();
            Console.WriteLine("\tDizi i&amp;ccedil;erisinde {0} adet TEK sayı vardır\n", result.ToString());
        }

        static void NineCount(int[] numbers)
        {
            int result = (from number in numbers
                          where number % 9 == 0
                          select number).Count();
            Console.WriteLine("\tDizi i&amp;ccedil;erisinde {0} adet 9 ile b&amp;ouml;l&amp;uuml;nebilen sayı vardır\n", result.ToString());
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Aslında kod son derece a&amp;ccedil;ıktır ancak dikkat edilmesi gereken noktalarda vardır. For, ForEach ve Invoke metodları, Action temsilcisini sıklıkla kullanmaktadır. Bunun en b&amp;uuml;y&amp;uuml;k nedeni, paralel işleme tabi tutulacak kod par&amp;ccedil;alarını taşıyan herhangibir metod veya bloğun kullanılabilmesini sağlamaktır. Bildiğiniz gibi &lt;strong&gt;Action&lt;/strong&gt; temsilcisi, parametre almayan ve geriye d&amp;ouml;nd&amp;uuml;rmeyen metodları işaret etmektedir. Diğer taraftan &lt;strong&gt;Func&lt;/strong&gt; temsilcisinin kullanıldığı versiyonlarda bulunmaktadır. Yani geriye değer d&amp;ouml;nd&amp;uuml;ren ve parametre alan metodlarında işin i&amp;ccedil;erisinde katılması sağlanabilir. Elbette kullanımı kolaylaştırmak adına, &lt;strong&gt;lambda operat&amp;ouml;r&amp;uuml;de(=&amp;gt;)&lt;/strong&gt; ciddi şekilde ele alınmaktadır. Uygulamayı &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;lara benzer bir &amp;ccedil;ıktı elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg26_9.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabiki kodu test ettiğimiz sistemin &amp;ccedil;ekirdek veya işlemci sayısına g&amp;ouml;re, yada o anda &amp;ccedil;alışmakta olan programlara g&amp;ouml;re farklı sıralarda sonu&amp;ccedil;lar elde edilebilir. Ancak &amp;ccedil;alışan kod par&amp;ccedil;asında işlemlerin paralel yapıldığına dair pek &amp;ccedil;ok iz vardır. Dikkatlice bakıldığında For, ForEach d&amp;ouml;ng&amp;uuml;lerinin dizileri ger&amp;ccedil;ekten paralel bir sırada değerlendirdiği ve işlemeri yaptığı ortadadır. Invoke metoduda benzer şekilde, &amp;ccedil;ağırdığı 3 metodu m&amp;uuml;mk&amp;uuml;n mertebede paralel olarak başlatmıştır.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;NOT : &lt;/strong&gt;TPL tarafında geliştiricinin &lt;strong&gt;alt-seviye(Low-Level)&lt;/strong&gt; işlemlerle uğraşmasına gerek yoktur. Ancak bu durum g&amp;ouml;rsel programlama tarafında, &lt;strong&gt;Illegal Cross Thread Exception&lt;/strong&gt; gibi istisnaların olmayacağı anlamına gelmemelidir &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Bu yazımızda TPL alt yapısını en basit ve yalın haliyle tanımaya &amp;ccedil;alıştık. Elbetteki işimiz bitmedi. Bi d&amp;uuml;nya işimi var aslında &lt;img title="Cool" src="/editors/tiny_mce3/plugins/emotions/img/smiley-cool.gif" alt="Cool" border="0" /&gt;&amp;nbsp;Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f6%2fHelloTPL.rar"&gt;HelloTPL.rar (25,96 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-06-03 02:50:00</pubDate>
  <slug>TPL(Task-Parallel-Library)-Nedir</slug>
  <tags>
    <tag>task-parallel-library</tag>
  </tags>
  <categories>
    <category>TPL</category>
  </categories>
</post>