<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Rust Pratikleri - Dokümantasyon</title>
  <description>Bir programlama dilini iyi yapan ve onu öne çıkaran bazı önemli unsurlar vardır. İdeal bir söz dizimi oluşturulması için önerilerde bulunmak, kullanılan fonksiyon veya türlerle ilgili yardım dokümantasyonları sunmak, merkezi ve başarılı bir paket yönetim sistemine sahip olmak bunlar arasında sayılabilir. Rust dilindeki pek çok kural sayesinde bellek sahasının güvende kaldığı(memory safe), dangle pointer, data race, memory leak gibi sorunların oluşmadığı, performansı yüksek ve üstelik bütün bunlar için garbage collector benzeri mekanizmalara ihtiyaç duymayacak şekilde geliştirme yapmamız mümkün. Yine de idiomatic olarak ifade edilen ve dilin en ideal şekilde kullanılmasını tarifleyen ihtiyaç için yardım almamız gerekiyor. Bu anlamda cargo clippy en büyük destekçimiz. Ancak kaliteli kodlamanın olmazsa olmaz önemli özelliklerinden birisi de elbette verimli içerik sunan dokümantasyon. Özellikle yazdığımız kütüphaneleri herkesin kullanımına açmak istediğimiz senaryolarda bu konuya azami özeni göstermek lazım.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2022/Subat/horten.jpg" alt="" /&gt;Bir programlama dilini iyi yapan ve onu &amp;ouml;ne &amp;ccedil;ıkaran bazı &amp;ouml;nemli unsurlar vardır. İdeal bir s&amp;ouml;z dizimi oluşturulması i&amp;ccedil;in &amp;ouml;nerilerde bulunmak, kullanılan fonksiyon veya t&amp;uuml;rlerle ilgili yardım dok&amp;uuml;mantasyonları sunmak, merkezi ve başarılı bir paket y&amp;ouml;netim sistemine sahip olmak bunlar arasında sayılabilir. Rust dilindeki pek &amp;ccedil;ok kural sayesinde bellek sahasının g&amp;uuml;vende kaldığı&lt;em&gt;(memory safe)&lt;/em&gt;, dangle pointer, data race, memory leak gibi sorunların oluşmadığı, performansı y&amp;uuml;ksek ve &amp;uuml;stelik b&amp;uuml;t&amp;uuml;n bunlar i&amp;ccedil;in garbage collector benzeri mekanizmalara ihtiya&amp;ccedil; duymayacak şekilde&amp;nbsp;geliştirme yapmamız m&amp;uuml;mk&amp;uuml;n. Yine de idiomatic olarak ifade edilen ve dilin en ideal şekilde kullanılmasını tarifleyen ihtiya&amp;ccedil; i&amp;ccedil;in yardım almamız gerekiyor. Bu anlamda &lt;em&gt;&lt;strong&gt;cargo clippy&lt;/strong&gt;&lt;/em&gt; en b&amp;uuml;y&amp;uuml;k destek&amp;ccedil;imiz. Ancak kaliteli kodlamanın&amp;nbsp;olmazsa olmaz &amp;ouml;nemli &amp;ouml;zelliklerinden birisi de elbette verimli i&amp;ccedil;erik sunan&amp;nbsp;dok&amp;uuml;mantasyon. &amp;Ouml;zellikle yazdığımız k&amp;uuml;t&amp;uuml;phaneleri herkesin kullanımına a&amp;ccedil;mak istediğimiz senaryolarda bu konuya azami &amp;ouml;zeni g&amp;ouml;stermek lazım.&lt;/p&gt;
&lt;p&gt;Rust'ın kendi built-in i&amp;ccedil;eriğinin sağladığı dok&amp;uuml;mantasyon son derece etkilidir. Neredeyse kitaplara taş &amp;ccedil;ıkartacak kadar iyi bilgi verir ve aynı zamanda ilgili enstr&amp;uuml;manın kullanımına dair &amp;ouml;rnekler sunar. &lt;a title="Rust Crates" href="https://crates.io/" target="_blank"&gt;crates.io&lt;/a&gt;, Rust kodlamacıların kullandığı en &amp;ouml;nemli k&amp;uuml;t&amp;uuml;phane deposudur. Buraya &amp;ccedil;ıkan ve silinemeyen k&amp;uuml;t&amp;uuml;phanelerimiz i&amp;ccedil;in iyi bir dok&amp;uuml;mantasyon sunmak programcı olarak vazifemizdir.&lt;/p&gt;
&lt;p&gt;Peki Rust tarafında dok&amp;uuml;mantasyon nasıl sağlanır? Aslında bir .Net geliştiricinin olduk&amp;ccedil;a aşina olduğu şekilde &lt;strong&gt;XML Comment&lt;/strong&gt; benzeri yorum satırları ile kodun dok&amp;uuml;mantasyonu &amp;ccedil;ıkarılabilmekte. İşin g&amp;uuml;zel yanı Rust'ın bu dok&amp;uuml;manlarda &lt;strong&gt;Markdown&lt;/strong&gt; formatını kullanıyor olması. Yani dok&amp;uuml;manda link verebilir, resim g&amp;ouml;sterebilir, bullet list, heading vs kullanabiliriz. Bu sayede farklı ortamlara kolayca entegre olabilen ve hatta HTML olarak da servis edilebilen bir i&amp;ccedil;erikle karşılaşıyoruz. Gelin bu laf salatalığını bırakalım ve &amp;ouml;rnek bir kod par&amp;ccedil;asını dok&amp;uuml;mante edelim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;cargo new doc_sample
cd doc_sample
touch src/lib.rs&lt;/pre&gt;
&lt;p&gt;Birka&amp;ccedil; dil enstr&amp;uuml;manını kullandığımız hafifsiklet bir mod&amp;uuml;l&amp;uuml;m&amp;uuml;z var. Mod&amp;uuml;l i&amp;ccedil;eriğini aşağıdaki gibi geliştirebiliriz. Yorum satırlarına dikkat!&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;//! Maket u&amp;ccedil;ak yapımı sevenler i&amp;ccedil;in koleksiyonlarını y&amp;ouml;netecekleri basit k&amp;uuml;t&amp;uuml;phane.
//!
//! # Bazı Yardımcı Bilgiler
//!
//! Model u&amp;ccedil;ak yapımı &amp;ccedil;ok sevilen bir hobidir. Meşakkatli bir iştir ama sonu&amp;ccedil;ları olduk&amp;ccedil;a harikadır.
//! Yeni başlayanlar genelde 1:72 &amp;ouml;l&amp;ccedil;ekle &amp;ccedil;alışır. Az par&amp;ccedil;adan oluşan maketlerin bazıları i&amp;ccedil;in boya,
//! fır&amp;ccedil;a, yapıştırıcı gibi unsurlar paketle birlikte g&amp;ouml;nderilir. İlk &amp;ouml;nce par&amp;ccedil;aların uygun şekilde
//! boyanması gerekir. Sonrasında plana uygun olarak yapıştırma işlemleri icra edilir. En son olarak
//! da logoların yapıştırılması işlemi uygulanır.
//!
//! # İ&amp;ccedil;erik
//!
//! K&amp;uuml;t&amp;uuml;phanede yer alan temel enstr&amp;uuml;manlar.
///
/// Bir maket modelinin temel bilgilerini taşır.
pub struct Model {
    /// Modelin başlığı. &amp;Ouml;rneğin Messerschmitt 109
    pub title: String,
    /// Model yapımının zorluk derecesi [Level]
    pub level: Level,
    /// Modelin par&amp;ccedil;a sayısı
    pub part_count: u8,
    /// G&amp;uuml;ncel liste fiyatı
    pub list_price: f32,
}

#[derive(Debug)]
pub enum Level {
    /// Nispeten yapımı kolay olan seviye
    Easy,
    /// Artık g&amp;uuml;zel bir şeyler g&amp;ouml;rmek isteyenlerin seviyesi
    Hard,
    /// Sınırları zorlayanların seviyesi
    Pro,
}

use std::fmt::{Display, Formatter};

impl Display for Model {
    /// Modelin bilgilerini String formatta geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;r.
    fn fmt(&amp;amp;self, f: &amp;amp;mut Formatter&amp;lt;'_&amp;gt;) -&amp;gt; std::fmt::Result {
        write!(
            f,
            "{}. Zorlu {:?}.{} par&amp;ccedil;a. Liste fiyatı {}",
            self.title, self.level, self.part_count, self.list_price
        )
    }
}

/// Uygulanabilecek en y&amp;uuml;sek indirim oranı
pub const MAX_DISCOUNT_LEVEL: f32 = 10.99;

impl Model {
    /// Yeni bir model nesnesi oluşturmak i&amp;ccedil;in kullanılır.
    pub fn new(title: String, level: Level, part_count: u8, list_price: f32) -&amp;gt; Self {
        Model {
            title,
            level,
            part_count,
            list_price,
        }
    }

    /// Modelin fiyatına belirtilen miktarda indirim uygular
    pub fn apply_discount(&amp;amp;mut self, amount: f32) {
        if amount &amp;lt;= MAX_DISCOUNT_LEVEL {
            self.list_price -= amount
        } else {
            self.list_price -= MAX_DISCOUNT_LEVEL
        }
    }

    // cargo clippy sonrası aşağıdaki kullanım yerine Display trait'inin uyarlanması &amp;ouml;nerildi
    /*pub fn to_string(&amp;amp;self) -&amp;gt; String {
        format!(
            "{}. Zorluk {:?}.{} par&amp;ccedil;a. Liste fiyatı {}",
            self.title, self.level, self.part_count, self.list_price
        )
    }*/
}&lt;/pre&gt;
&lt;p&gt;Kodda benim gibi maket u&amp;ccedil;ak yapmayı sevenler i&amp;ccedil;in bir veri yapısı ve bağlı birka&amp;ccedil; fonksiyon yer alıyor. Maketin modeli, zorluk derecesi, par&amp;ccedil;a sayısı ve fiyatı gibi az sayıda &amp;ouml;zellik barındıran Model isimli struct var. Yeni bir nesneyi kolayca oluşturmak i&amp;ccedil;in new fonksiyonunu uyarlıyor ve hatta fiyat indirimi i&amp;ccedil;in de bir metot sunuyoruz. İlk etapta makete ait bilgileri String t&amp;uuml;rde d&amp;ouml;nd&amp;uuml;ren to_string isimli bir metot kullandık. Ancak yazının başında kısaca bahsettiğimiz cargo clippy komutunu kullandığımızda idiomatic bir &amp;ouml;neride bulunduğunu g&amp;ouml;receğiz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;cargo clippy&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Subat/doc_sample_3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere to_string yerine Display trait'ini implemente etmemiz &amp;ouml;neriliyor. Bizde kod i&amp;ccedil;eriğini buna g&amp;ouml;re d&amp;uuml;zenledik. Dok&amp;uuml;mantasyonumuz olduk&amp;ccedil;a sadece. Aslında eklenebilecek bazı kısımlar var. &amp;Ouml;rneğin bir Model nesnesi nasıl &amp;ouml;rneklenir ve kod i&amp;ccedil;inde kullanılır yine dok&amp;uuml;mante edebiliriz. Bu pratikte ihtiya&amp;ccedil; duymadım ancak markdown'lar da olduğu gibi bir yol izleyebilirsiniz.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;/// # Examples
/// ```
/// // Burada kod kullanım &amp;ouml;rneği yer alıyor
/// 
/// ```
///
&lt;/pre&gt;
&lt;p&gt;Dikkat etmemiz gereken tek şey yardım dok&amp;uuml;mantasyonuna ekleyeceğimiz kod par&amp;ccedil;alarının da &amp;ccedil;alışır olması. Rust test aracı buradaki kodları denetler ve &amp;ccedil;alıştırılabilir olmasını bekler ;) Mesela apply_discount fonksiyonumuz i&amp;ccedil;in aşağıdaki gibi bir i&amp;ccedil;erik hazırladığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;/// Modelin fiyatına belirtilen miktarda indirim uygular
///
/// # Examples
///
/// ```
/// let m109 = Model::new(String::from("Meserrschmitt 109"), Level::Easy, 42, 270);
/// m109.apply_discount(32.0);
/// assert_eq!(m109.list_price,228.0);
/// ```
///
pub fn apply_discount(&amp;amp;mut self, amount: f32) {
   if amount &amp;lt;= MAX_DISCOUNT_LEVEL {
      self.list_price -= amount
   } else {
      self.list_price -= MAX_DISCOUNT_LEVEL
   }
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere examples kısmında bir Model nesnesi &amp;uuml;retiyor ve apply_discount fonksiyonunu &amp;ccedil;ağırıyoruz. İlk bakışta bir problem yok gibi g&amp;ouml;r&amp;uuml;lebilir. Birde aşağıdaki komutla deneyelim.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;cargo test --doc&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Subat/doc_sample_6.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Upsss!!! G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere Model ve Level t&amp;uuml;rleri bulunamıyor. Bunları ekleyerek ilerlesek bile dok&amp;uuml;manı tekrardan test ettiğimizde bu kez immutable değişken kullanımı ve hatta 270 değerini float kullanmamak sebebiyle farklı hatalara da rastlarız. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Subat/doc_sample_9.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z&amp;uuml;n &amp;ouml;z&amp;uuml; dok&amp;uuml;mantasyonda ger&amp;ccedil;ekten &amp;ccedil;alıştırılabilir bir kod par&amp;ccedil;asının kondması bekleniyor. Dolayısıyla i&amp;ccedil;eriği aşağıdaki şekilde değiştirmeliyiz.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;/// Modelin fiyatına belirtilen miktarda indirim uygular
///
/// # Examples
///
/// ```
/// use doc_sample::{Model,Level};
/// let mut m109 = Model::new(String::from("Meserrschmitt 109"), Level::Easy, 42, 270.0);
/// m109.apply_discount(32.0);
/// assert_eq!(m109.list_price,259.01);
/// ```
///&lt;/pre&gt;
&lt;p&gt;Artık dok&amp;uuml;man i&amp;ccedil;erisindeki kod par&amp;ccedil;ası da &amp;ccedil;alıştırılabilir durumda, &amp;uuml;stelik testi de başarılı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Subat/doc_sample_7.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi eklediğimiz yorum satırlarına istinaden nasıl bir dok&amp;uuml;man &amp;ccedil;ıktısı alabiliriz bir bakalım.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;# Normalde dok&amp;uuml;man &amp;uuml;retimi i&amp;ccedil;in aşağıdaki komut kullanılır
cargo doc

# Ancak bağımlı k&amp;uuml;t&amp;uuml;phanelerin dok&amp;uuml;mantasyonunu işin i&amp;ccedil;erisine dahil etmek istemezsek ş&amp;ouml;yle kullanabiliriz.
cargo doc --no-deps 

# Hatta geliştirme sırasında şu kullanımı daha şık olur. 
cargo doc --no-deps --open

# dok&amp;uuml;man i&amp;ccedil;ine eklenmiş ger&amp;ccedil;ek kod par&amp;ccedil;aları varsa test edebiliriz
cargo test --doc&lt;/pre&gt;
&lt;p&gt;Bu arada lib i&amp;ccedil;erisindeki kodların ilk kısmında&amp;nbsp;//! ile başlayan yorum satırları olduğunu g&amp;ouml;rebilirsiniz. Bunlar inner doc olarak ifade edilirler ve HTML dok&amp;uuml;mantasyonunda aşağıdaki şekilde g&amp;ouml;sterilirler.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Subat/doc_sample_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;/// olarak kullandıklarımızda ise aşağıdaki sonu&amp;ccedil;ları elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Subat/doc_sample_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İşin g&amp;uuml;zel yanı k&amp;uuml;t&amp;uuml;phane i&amp;ccedil;eriğini kullandığımız yerde de IDE'lerin bize yardımcı olmasıdır. main.rs i&amp;ccedil;eriğini aşağıdaki gibi tasarladığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;use doc_sample::{Level, Model};

fn main() {
    let mut m109 = Model::new(String::from("Meserrschmitt 109"), Level::Easy, 42, 270.50);
    println!("{}", m109.to_string());
    m109.apply_discount(32.0);
    println!("{}", m109.to_string());
}&lt;/pre&gt;
&lt;p&gt;Kullandığım IntelliJ IDEA'da apply_discount &amp;uuml;st&amp;uuml;ne gelince aşağıdaki gibi &amp;ccedil;ıktı elde ettim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Subat/doc_sample_8.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere Rust kod dok&amp;uuml;mantasyonu konusunda pek &amp;ccedil;ok dil veya &amp;ccedil;atıda olduğu gibi bir standart sunmaktadır. Avantajlı noktalardan birisi bu dok&amp;uuml;mantasyonun markdown formatını kullanmasıdır. Diğer yandan yorumlara serpiştirilen &amp;ouml;rnek kod par&amp;ccedil;aları varsa bunların &amp;ccedil;alışır hatta testten ge&amp;ccedil;miş olmasını da garanti edebilir. Elbette dok&amp;uuml;mantasyonun i&amp;ccedil;eriği, en &amp;ouml;nemli kısımdır. Enstr&amp;uuml;manları kafaları fazla karaştırmadan basit ve kaliteli bir şekilde anlatmak m&amp;uuml;himdir. Pek tabii dok&amp;uuml;mantasyon oluşturmada nasıl bir yol izleneceğine dair en g&amp;uuml;zel kaynak Rust'ın var olan yardım dok&amp;uuml;manlarıdır. B&amp;ouml;ylece geldik Rust Pratikleri serisinden bir b&amp;ouml;l&amp;uuml;m&amp;uuml;n daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğe ait kodlara &lt;a title="rust-farm github reposu" href="https://github.com/buraksenyurt/rust-farm/tree/main/Practices/doc_sample" target="_blank"&gt;rust-farm github reposundan&lt;/a&gt; erişebilirsiniz.&lt;/p&gt;</content>
  <pubDate>2022-02-13 09:00:00</pubDate>
  <slug>rust-pratikleri-dokumantasyon</slug>
  <tags>
    <tag>rust</tag>
    <tag>rust-pratikleri</tag>
    <tag>rust-programming-language</tag>
    <tag>documentation</tag>
    <tag>idiomatic-code</tag>
    <tag>cargo</tag>
    <tag>clippy</tag>
  </tags>
  <categories>
    <category>Rust</category>
  </categories>
</post>