<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Rust Pratikleri - Aynı Anda Sadece Tek Bir Değiştirilebilir Referans Olabilir</title>
  <description>Thread'ler ve eş zamanlı iş parçacıkları işin içerisine girdiğinde karşımıza çıkan önemli konulardan biriside mutable türden referansları nasıl kullanacağımızdır. Malum bu thread'ler aynı veri üzerinde değişiklik yapmak isteyebilirler. Data Races oluşmaması Rust'ın temel ilkelerinden birisidir ve bunun en büyük sebebi bellek ortamını güvenli halde koruyabilmektir. Dolayısıyla belleğin referans edilen bölgelerinin bu thread'ler içerisinde yazma amaçlı ele alınması durumlarında kod biraz karmaşıklaşabilir. Öncesinde kuralın ne olduğunu dile getirelim; Rust bir t anında birden fazla mutable referans oluşturulmasına izin vermez, buna müsaade edecek şekilde kodlama yapmamızı engeller. Elbette konuyu anlamanın en güzel yolu basit bir örnek üzerinden ilerlemekle mümkün. Öyleyse başlayalım.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2022/Nisan/MacLeod.jpg" alt="" /&gt;Thread'ler ve eş zamanlı iş par&amp;ccedil;acıkları işin i&amp;ccedil;erisine girdiğinde karşımıza &amp;ccedil;ıkan &amp;ouml;nemli konulardan biriside değiştirilemez&lt;em&gt;(mutable)&lt;/em&gt; t&amp;uuml;rden referansları nasıl kullanacağımızdır. Malum aynı anda &amp;ccedil;alışan bu iş par&amp;ccedil;aları aynı veri &amp;uuml;zerinde değişiklik yapmak isteyebilirler. Fakat bu, Data Races durumunun oluşmasına sebebiyet verebilir. Esasında aynı veri alanını kullanan thread'lerin bu i&amp;ccedil;eriği okumasında bir sıkıntı yoktur. Ne var ki yazma aşamasına gelindiğinde birbirlerinin değişikliğini ezme durumu da s&amp;ouml;z konusu olabilir.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;oklu thread koşan yapılarda Data Races oluşmaması Rust'ın temel ilkelerinden birisidir ve bunun elbetteki tek sebebi ortak verinin hatalı değiştirilmesi değil bellek sahasının g&amp;uuml;venli halde tutulmasıdır. Dolayısıyla belleğin referans edilen b&amp;ouml;lgelerinin bu thread'ler i&amp;ccedil;erisinde yazma ama&amp;ccedil;lı ele alınması durumlarında kodlama biraz karmaşıklaşabilir.&lt;/p&gt;
&lt;p&gt;Konuyu bir &amp;ouml;rnekle inceleyeceğiz elbette ama senaryomuza başlamadan &amp;ouml;nce temel kuralın ne olduğunu belirtelim; &lt;strong&gt;Rust, aynı t anında birden fazla değiştirilebilir(mutable) referans oluşturulmasına izin vermez.&lt;/strong&gt; Dahası buna m&amp;uuml;saade edecek şekilde kodlama yapmamızı engeller. Dilerseniz hi&amp;ccedil; vakit kaybetmeden only_you isimli bir Rust projesi a&amp;ccedil;arak devam edelim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# Projemizi aşağıdaki gibi oluşturabiliriz.
cargo new only_you
cd only_you

# Kodun kalitesine bakmak i&amp;ccedil;in
cargo clippy

# ve &amp;ccedil;alıştırmak i&amp;ccedil;in 
cargo run&lt;/pre&gt;
&lt;p&gt;Başlangı&amp;ccedil;ta program kodlarımızı aşağıdaki gibi yazabiliriz. Satır aralarına işlerinizi kolaylaştıracak yorum satırları serpiştirilmiştir ;)&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;use std::thread;

fn main() {
    // Birka&amp;ccedil; thread'in ortaklaşa kullanmak istediği bir sayı belirleyelim.
    let mut popular_number = 23_u32;

    // JoinHandle nesneleri i&amp;ccedil;in bir vector. Main'i bekletmek i&amp;ccedil;in kullanırız.
    let mut handlers = Vec::new();

    // 10 tane thread a&amp;ccedil;alım
    for _ in 0..10 {
        handlers.push(thread::spawn(|| {
            // Her bir thread pop&amp;uuml;ler olan sayımızı 1 birim artırsın
            popular_number += 1;
        }));
    }

    for h in handlers {
        let _ = h.join();
    }
}&lt;/pre&gt;
&lt;p&gt;Birden fazla thread'in ortaklaşa artıracağı bir sayımız var. 10 thread a&amp;ccedil;ıp değerini 1 birim artırmak istiyoruz. Ne yazık ki uygulamamızı bu haliyle &amp;ccedil;alıştırmak istediğimizde aşağıdaki hatalar ile karşılaşacağız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Nisan/only_you_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hata mesajı a&amp;ccedil;ık bir şekilde popular_number'ın birden &amp;ccedil;ok kez mutate edilmeye &amp;ccedil;alışıldığını belirtmekte. Esasında bunu &amp;ccedil;&amp;ouml;zmenin basit bir yolu var. Spawn fonksiyonunda move &amp;ouml;zelliğini kullanarak her bir thread'in popular_number'ın birer kopyasını almasını sağlayabiliriz. Ancak değişkenin birer kopyasını kullanmak tahmin edeceğiniz &amp;uuml;zere istediğimiz sonucu vermeyebilir ki bunu şimdi g&amp;ouml;receğiz. Dolayısıyla main i&amp;ccedil;eriğini aşağıdaki gibi değiştirerek devam edelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;use std::thread;

fn main() {
    // Birka&amp;ccedil; thread'in ortaklaşa kullanmak istediği bir sayı belirleyelim.
    let mut popular_number = 23_u32;

    // JoinHandle nesneleri i&amp;ccedil;in bir vector. Main'i bekletmek i&amp;ccedil;in kullanırız.
    let mut handlers = Vec::new();

    // 10 tane thread a&amp;ccedil;alım
    for _ in 0..10 {
        handlers.push(thread::spawn(move || {

            println!(
                "{:?} Parametre : {}",
                thread::current().id(),
                popular_number
            );

            // Her bir thread pop&amp;uuml;ler olan sayımızı 1 birim artırsın
            popular_number += 1;

            println!(
                "\t{:?} Yeni Değer : {}",
                thread::current().id(),
                popular_number
            );
        }));
    }

    for h in handlers {
        let _ = h.join();
    }

    println!("Sayının değeri {}", popular_number);
}&lt;/pre&gt;
&lt;p&gt;Hata mesajından kurtulduğumuzu s&amp;ouml;yleyebiliriz ancak program pekte istediğimiz gibi &amp;ccedil;alışmayacaktır. Normalde her thread'in bu ortak sayı değerini birer artırmasını bekliyoruz. Lakin thread'lere ilgili değişkeni move sebebiyle kopyalayarak verdiğimizden her thread kendi 23 değerini kullanıyor. Sonu&amp;ccedil;ta aşağıdaki gibi bir &amp;ccedil;ıktı elde edeceğiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Nisan/only_you_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi ne yapacağız? Ortak veriyi bir Mutex nesnesi olarak ele almak esasında işimizi &amp;ccedil;&amp;ouml;zecektir. Nitekim Mutex kullandığımızda değeri okuyabilir ve eğer onun i&amp;ccedil;in bir kilit a&amp;ccedil;mışsak &amp;uuml;zerine yazma işlemi ger&amp;ccedil;ekleştirebiliriz. Gelin kodumuzu aşağıdaki halde yeniden tasarlayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;use std::sync::{Arc, Mutex};
use std::thread;

fn main() {
    // Birka&amp;ccedil; thread'in ortaklaşa kullanmak istediği bir sayı var.
    // Thread Safe Reference Counter ile birlikte Mutex nesnesi olarak oluşturuyoruz
    let popular_number = Arc::new(Mutex::new(23_u32));

    // JoinHandle nesneleri i&amp;ccedil;in bir vector. Main'i bekletmek i&amp;ccedil;in kullanırız.
    let mut handlers = Vec::new();

    // 10 tane thread a&amp;ccedil;alım
    for _ in 0..10 {
        // Atomically Reference Counted nesnesinin bir klonunu oluşturuyoruz
        // Thread'ler bunu kullanacak
        let number_clone = Arc::clone(&amp;amp;popular_number);

        handlers.push(thread::spawn(move || {
            // klonlanan referans bilgisine bağlı Mutex i&amp;ccedil;eriğini kitliyoruz
            let mut p = number_clone.lock().unwrap();

            println!("{:?} Parametre : {:?}", thread::current().id(), p);

            // p değerini dereference ettikten sonra 1 artırıyoruz
            *p += 1;

            println!("\t{:?} Yeni Değer : {:?}", thread::current().id(), p);
        }));
    }

    for h in handlers {
        let _ = h.join();
    }

    // Thread'lerin ortaklaşa kullandığı sayısal değer aslında Atomically Reference Counted tarafından
    // tutulan bir Mutext değişkeni. Bir şekilde sonucu almak gerekiyor.
    // Şimdilik aşağıdaki gibi bir yol bulabildim.
    println!(
        "Sayının değeri {}",
        Arc::try_unwrap(popular_number)
            .unwrap()
            .into_inner()
            .unwrap()
    );
}&lt;/pre&gt;
&lt;p&gt;Yeni kurguda işin i&amp;ccedil;erisine Mutext nesnesini tutan bir de Atomically Reference Counted tipi girdi. Yapılan şeyi anlamaya &amp;ccedil;alışalım. &amp;Ouml;ncelikle ortak sayı değerinin thread'ler tarafından aynı anda değiştirilmeyeceğini garanti etmemiz gerekiyor. Bunun i&amp;ccedil;in Mutex nesnesini kullanıyoruz. Lakin n sayıda thread'in bu değişkene erişip değiştirmesini de istiyoruz. Bir thread bu değişkeni kilit altına aldıysa başka bir thread'in onu değiştirmesini engelliyoruz ve b&amp;ouml;ylece değişken boşa d&amp;uuml;şt&amp;uuml;ğ&amp;uuml; zaman başka bir thread tarafından değiştirilebiliyor. Lakin n thread'in i&amp;ccedil;erisine değişkenin birer kopayasını aldığımızda hepsinin kendi başına takılması s&amp;ouml;z konusu ve sonu&amp;ccedil;ta sayı ortaklaşa artmıyor.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;İşte Atomically Reference Counter dediğimiz t&amp;uuml;r burada devreye girmekte. Arc ile heap'te yer alan ve bir Mutex tarafından tutulan bellek b&amp;ouml;lgesi i&amp;ccedil;in n adet referans oluşturulması m&amp;uuml;mk&amp;uuml;n. Thread'ler Arc değerlerini klonladık&amp;ccedil;a aslında Mutex ile sahiplenilmiş aynı bellek b&amp;ouml;lgesini referans eden pointer'lar oluşuyor. number_clone değişkeni bu ama&amp;ccedil;la oluşturuldu. Derken a&amp;ccedil;ılan herbir thread kendisine klon olarak gelen ama aynı bellek b&amp;ouml;lgesini işaret eden bu referansları ele almaya başlıyor. Bu referansın bellekte işaret ettiği alanı değiştirmek i&amp;ccedil;inse &amp;ouml;ncelikle bir kilit koyuyor. p değişkenini oluşturduğumuz yer. Dolayısıya thread i&amp;ccedil;inde tamamen g&amp;uuml;venli bir şekilde ilgili referansın işaret ettiği b&amp;ouml;lgedeki veriyi değiştirme şansımız doğuyor. Tabii bunun i&amp;ccedil;in dereference işlemini uygulamamız gerekiyor ki bu da * operat&amp;ouml;r&amp;uuml; ile sağlanmakta. Thread scope'u sonlandığında hem kilit kalkıyor hem de referans eden pointer'lardan birisi eksiliyor. En nihayetinde t&amp;uuml;m thread'ler ilgili sayıyı ortaklaşa değiştirmiş oluyorlar. İşte &amp;ccedil;alışma zamanı g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Nisan/only_you_3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Rust'ın standart Arc, Mutex ve thread yapılarını kullanınca kod biraz karmaşıklaşabiliyor. Esasında concurrent işlemler i&amp;ccedil;in &amp;ccedil;ok g&amp;uuml;zel iki paket mevcut. Benim de bazı &amp;ouml;rneklerde tercih ettiğim &lt;a title="Crossbeam" href="https://docs.rs/crossbeam/latest/crossbeam/" target="_blank"&gt;Crossbeam&lt;/a&gt; ve &lt;a title="Parking Lot" href="https://docs.rs/parking_lot/latest/parking_lot/" target="_blank"&gt;parking_lot&lt;/a&gt; paketlerinden yararlanarak kodu daha okunur ve anlaşılır hale getirebiliriz. Şimdi bu mod&amp;uuml;lleri kullanarak aynı &amp;ouml;rneği tekrar yazmayı deneyelim. İlk olarak toml dosyasında gerekli bildirimleri eklemeliyiz.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;[dependencies]
crossbeam="0.8.1"
parking_lot = "0.12.0"&lt;/pre&gt;
&lt;p&gt;Sonrasında main i&amp;ccedil;eriğini aşağıdaki şekilde değiştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;//use std::sync::{Arc, Mutex};
//use std::thread;

use parking_lot::Mutex;

fn main() {
    // Yine bir Mutex oluşturduk ancak Arc gibi bir referans counter kullanmadık
    let popular_number = Mutex::new(23_u32);

    // Bir scope oluşturuyoruz ve bu scope 10 adet thread yumurtluyor.
    crossbeam::scope(|s| {
        for _ in 0..10 {
            s.spawn(|_| {
                // Dereference ve lock işlemini m&amp;uuml;taakip sayı değerini bir artırıyoruz
                *popular_number.lock() += 1;
            });
        }
    })
    .unwrap();

    let popular_number = popular_number.into_inner();
    println!("Sayının değeri {}", popular_number);
}&lt;/pre&gt;
&lt;p&gt;Program kodumuzu tekrar &amp;ccedil;alıştırdığımızda istediğimiz sonuca ulaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Nisan/only_you_4.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hem birden fazla thread'in aynı veri &amp;uuml;zerinde iş yapmasını sağladık hem de bunu thread safe olarak data races sorununa neden olmayacak şekilde ger&amp;ccedil;ekleştirdik. B&amp;ouml;ylece geldik bir rust pratiğimizin daha sonuna. &amp;Ouml;rneğe her zaman olduğu gibi &lt;a href="https://github.com/buraksenyurt/rust-farm/tree/main/Practices/only_you" target="_blank"&gt;github reposundan&lt;/a&gt; ulaşabilirsiniz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2022-04-03 09:00:00</pubDate>
  <slug>ayni-anda-sadece-tek-bir-degistirilebilir-referans-olabilir</slug>
  <tags>
    <tag>rust</tag>
    <tag>rust-pratikleri</tag>
    <tag>rust-programming-language</tag>
    <tag>mutable-references</tag>
    <tag>thread</tag>
    <tag>multi-thread</tag>
  </tags>
  <categories>
    <category>Rust</category>
  </categories>
</post>