<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF Öğreniyorum Ders 2–Veri Sözleşmeleri II</title>
  <description>3ncü dersimizde WCF Servisimizi IIS üzerinde host edebilecek şekilde bir WCF Service Application şablonunu kullandık. Bu sayede HTTP bazlı olarak yayınlama yapan bir WCF Servisinin Web üzerinden erişilebilirliğini değerlendirdik. Ayrıca Entity bazlı bir kütüphanenin veri içeriğini istemci tarafına sunarken Surrogate tipindeki veri sözleşmelerini nasıl değerlendirebileceğimize baktık. Söz konusu servise ait operasyonları ele alan istemci tarafında da, bu veri sözleşmelerini nasıl kullanabileceğimizi gördük. Her zaman ki gibi, örnek uygulama kodlarını, Powerpoint sunum dosyasını ve Nedirtv?com üzerine eklenmiş olan ekran kayıtlarını aşağıda linkerden tedarik edebilirsiniz. Tekrardan görüşünceye dek hepinize mutlu günler dilerim.</description>
  <content>&lt;p&gt;&lt;a href="/pics/wcfogreniyorumDers2.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; float: right; padding-top: 0px; border: 0px;" title="wcfogreniyorumDers2" src="/pics/wcfogreniyorumDers2_thumb.gif" alt="wcfogreniyorumDers2" width="240" height="167" align="right" border="0" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;a title="NedirTv?com" href="http://www.nedirtv.com" target="_blank"&gt;Nedirtv?com&lt;/a&gt; liderdliğinde s&amp;uuml;rd&amp;uuml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z &lt;strong&gt;WCF &amp;Ouml;ğreniyorum Webiner(Webcast)&lt;/strong&gt; serisinin 3nc&amp;uuml; dersini de(biliyorsunuz ders numaralarımız 0dan başlıyor) tamamlamış bulunuyoruz. &amp;Ouml;ncelikli olarak katılan t&amp;uuml;m arkadaşlarımıza &amp;ccedil;ok teşekk&amp;uuml;r ederim.&lt;/p&gt;
&lt;p&gt;3nc&amp;uuml; dersimizde WCF Servisimizi IIS &amp;uuml;zerinde host edebilecek şekilde bir &lt;strong&gt;WCF Service Application&lt;/strong&gt; şablonunu kullandık. Bu sayede &lt;strong&gt;HTTP&lt;/strong&gt; bazlı olarak yayınlama yapan bir &lt;strong&gt;WCF Servisinin Web&lt;/strong&gt; &amp;uuml;zerinden erişilebilirliğini değerlendirdik. Ayrıca Entity bazlı bir k&amp;uuml;t&amp;uuml;phanenin veri i&amp;ccedil;eriğini istemci tarafına sunarken &lt;strong&gt;Surrogate&lt;/strong&gt; tipindeki veri s&amp;ouml;zleşmelerini nasıl değerlendirebileceğimize baktık. S&amp;ouml;z konusu servise ait operasyonları ele alan istemci tarafında da, bu veri s&amp;ouml;zleşmelerini nasıl kullanabileceğimizi g&amp;ouml;rd&amp;uuml;k. Her zaman ki gibi, &lt;strong&gt;&amp;ouml;rnek uygulama kodlarını, Powerpoint sunum dosyasını&lt;/strong&gt; ve &lt;strong&gt;Nedirtv?com&lt;/strong&gt; &amp;uuml;zerine eklenmiş olan ekran kayıtlarını aşağıda linkerden tedarik edebilirsiniz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;iframe src="https://www.youtube.com/embed/S8oiWgIcZUM" width="420" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Sunum Dosyası : &lt;/strong&gt;&lt;a href="/pics/2010%2f12%2fWCF40Ders2Veri SozlesmeleriII.pptx"&gt;WCF 4.0 - Ders 2 - Veri Sozlesmeleri II.pptx (314,90 kb)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Solution Son Hali : &lt;/strong&gt;&lt;a href="/pics/2010%2f12%2fWCF Ogreniyorum.rar"&gt;WCF Ogreniyorum.rar (336,05 kb)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a title="WCF Ogreniyorum - Ders 2 - Veri S&amp;ouml;zleşmeleri II" href="http://nedirtv.com/video/wcf-ogreniyorum-02-service-contract-ve-data-contract-kavramlari" target="_blank"&gt;NedirTv?com bağlantısı&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2010-12-05 19:40:00</pubDate>
  <slug>WCF-Ogreniyorum-Ders-2-Veri-Sozlesmeleri-II</slug>
  <tags>
    <tag>windows-communication-foundation</tag>
    <tag>wcf-ogreniyorum</tag>
    <tag>wcf</tag>
    <tag>data-contracts</tag>
    <tag>surrogate-types</tag>
    <tag>wcf-service-application</tag>
  </tags>
  <categories>
    <category>WCF Öğreniyorum</category>
  </categories>
</post>