<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ado.Net 2.0' da Transaction Kavramı</title>
  <description>Transaction kavramı ve kullanımı veritabanı programcılığının olmazsa olmaz temellerinden birisidir. Veritabanına doğru gerçekleştirilen işlemlerin tamamının onaylanması veya içlerinden birisinde meydana gelecek bir istisna sonrası o ana kadar yapılan tüm işlerin geri alınması veri bütünlüğünü korumak açısından son derece önemlidir. Ado.Net 1.0/1.1 için transactionların kullanımı, seçilen veri sağlayıcısına göre farklı sınıfların kullanılmasını gerektirir.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Transaction kavramı ve kullanımı veritabanı programcılığının olmazsa olmaz temellerinden birisidir. Veritabanına doğru ger&amp;ccedil;ekleştirilen işlemlerin tamamının onaylanması veya i&amp;ccedil;lerinden birisinde meydana gelecek bir istisna sonrası o ana kadar yapılan t&amp;uuml;m işlerin geri alınması veri b&amp;uuml;t&amp;uuml;nl&amp;uuml;ğ&amp;uuml;n&amp;uuml; korumak a&amp;ccedil;ısından son derece &amp;ouml;nemlidir. Ado.Net 1.0/1.1 i&amp;ccedil;in transactionların kullanımı, se&amp;ccedil;ilen veri sağlayıcısına g&amp;ouml;re farklı sınıfların kullanılmasını gerektirir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin SqlClient isim alanındaki sınıfları kullandığınız bir veritabanı uygulamanız var ise, SqlTransaction sınıfını kullanırsınız. Oysa Ado.Net 2.0' da transaction mimarisi Ado.Net' ten ayrıştırılmış, bir başka deyişle provider' lardan bağımsız hale getirilmiştir. Aslında en b&amp;uuml;y&amp;uuml;k değişiklik transaction işlemlerinin artık System.Transactions isim alanı altında yer alan sınıflar ile ger&amp;ccedil;ekleştirilecek olmasıdır. Bir diğer b&amp;uuml;y&amp;uuml;k değişiklik transaction' ların yazım tekniği ile ilgilidir. Ado.Net 2.0 da transaction oluşturacak ve kullanacak kodları &amp;ccedil;ok daha basit bi&amp;ccedil;imde yazabilirsiniz. Bunu ilerleyen paragraflarda sizde g&amp;ouml;receksiniz.&lt;/p&gt;
&lt;p&gt;Ado.Net 2.0' da transaction' ların kullanımı ile ilgili belkide en &amp;ouml;nemli &amp;ouml;zellik dağıtık (distributed) transaction' ların uygulanış bi&amp;ccedil;imidir. Normal şartlarda Ado.Net 1.0/1.1 i&amp;ccedil;in dağıtık transaction' ları kullanırken System.EnterpriseServices isim alanını kullanan COM+ nesnelerini oluşturur ve ContextUtil sınıfına ait metodlar yardımıyla dağıtık transaction' ları kontrol altına alırız.&amp;nbsp;Bu yapı &amp;ouml;zellikle yazımı ve oluşturulması itibariyle karmaşık olup kullanımı da zor olan bir yapıdır. Oysa ki Ado.Net 2.0 olayı &amp;ccedil;ok daha akıllı bir şekilde ele alır. Ado.Net 2.0' a g&amp;ouml;re, iki tip transaction olabilir. Tek veri kaynağı &amp;uuml;zerinde &amp;ccedil;alışan &lt;strong&gt;LightWeight Transaction&lt;/strong&gt;' lar ve dağıtık transactionlar gibi davranan &lt;strong&gt;OleTx Transaction&lt;/strong&gt;' lar.&lt;/p&gt;
&lt;p&gt;LightWeight Transaction' lar tek bir uygulama alanında (application-domain) &amp;ccedil;alışan iş par&amp;ccedil;alarıdır. OleTx tipi Transaction' lar ise birden fazla uygulama alanında (application-domain) veya aynı uygulama alanında iseler de farklı veri kaynaklarını kullanan transaction' lar dır. Dolayısıyla OleTx tipi transaction' ları Distributed Transaction' lara benzetebiliriz. Ancak arada &amp;ouml;nemli farklarda vardır. İlk olarak Ado.Net 1.0/1.1' de tek veri kaynağı &amp;uuml;zerinde &amp;ccedil;alışan bir transaction' ın nasıl uygulandığını hatırlayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection con = new SqlConnection(connectionString);
con.Open();
SqlCommand cmd = new SqlCommand(sqlSorgusu,con);
SqlTransaction trans;

trans = con.BeginTransaction();
cmd.Transaction = trans;
try
{
    cmd.ExecuteNonQuery();
    trans.Commit();
}
catch(Exception e)
{
    trans.Rollback();
}
finally 
{
    con.Close();
}&lt;/pre&gt;
&lt;p&gt;Yukarıdaki &amp;ouml;rnekte yerel (local) makine &amp;uuml;zerinde tekil olarak &amp;ccedil;alışan bir transaction i&amp;ccedil;in gerekli kodlar yer almaktadır. Eğer komutun &amp;ccedil;alıştırılması sırasında herhangi bir aksilik olursa, catch bloğu devreye girer ve transaction geri &amp;ccedil;ekilerek (RollBack) o ana kadar yapılmış olan t&amp;uuml;m işlemler iptal edilir. Tam tersine bir aksilik olmaz ise transaction nesnesinin Commit metodu kullanılarak işlemler onaylanır ve veritabanına yazılır. Gelelim bu tarz bir &amp;ouml;rneğin Ado.Net 2.0' da nasıl ger&amp;ccedil;ekleştirileceğine. Her şeyden &amp;ouml;nce bu sefer &lt;strong&gt;System.Transactions&lt;/strong&gt; isim alanını kullanmamız gerekiyor. Şu anki versiyonda bu isim alanını uygulamamıza harici olarak referans etmemiz gerekmekte.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk120_1.gif" alt="" width="467" height="375" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Daha sonra ise aşağıdaki kodlara sahip olan Console uygulamasını oluşturalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;#region Using directives

using System;
using System.Collections.Generic;
using System.Text;
using System.Data;
using System.Data.SqlClient;
using System.Transactions;

#endregion

namespace Transactions
{
    class Program
    {
        static void Main(string[] args)
        {
            using (TransactionScope tsScope = new TransactionScope())
            {
                using (SqlConnection con = new SqlConnection("data source=localhost;database=AdventureWorks;integrated security=SSPI"))
                {
                    SqlCommand cmd = new SqlCommand("INSERT INTO Personel (AD,SOYAD,MAIL) VALUES ('Burak Selim','ŞENYURT','selim(at)buraksenyurt.com')", con);
                    con.Open();
                    cmd.ExecuteNonQuery();
                    tsScope.Complete();
                }
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Ado.Net 1.0/1.1' e g&amp;ouml;re olduk&amp;ccedil;a farklı bir yapı kullanılmıştır. &lt;strong&gt;TransactionScope&lt;/strong&gt; sınıfına ait nesne &amp;ouml;rnekleri kendisinden sonra a&amp;ccedil;ılan bağlantıları otomatik olarak bir transaction scope(faaliyet alanı) i&amp;ccedil;erisine alır. Buradaki temel mantık bir veya daha fazla transaction' ı kullanacak olan bir scope (faaliyet alanı) oluşturmak ve hepsi i&amp;ccedil;in gereki bir takım &amp;ouml;zelliklerin ortak olarak belirlenmesini sağlamaktır. TransactionScope sınıfına ait nesne &amp;ouml;rneklerini oluşturabileceğimiz pek &amp;ccedil;ok aşırı y&amp;uuml;klenmiş (overload) yapıcı (constructor) metod mevcuttur.&lt;/p&gt;
&lt;p&gt;Bu yapıcı metotlar yardımıyla, scope (faaliyet alanı) i&amp;ccedil;in pek &amp;ccedil;ok &amp;ouml;zellik tanımlayabilirisiniz. TransactionScope, &lt;strong&gt;IDisposable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; (interface) uygulayan bir sınıftır. Bir TransactionScope nesnesi oluşturululduğunda ve bu nesnenin oluşturduğu faaliyet alanına ilk transaction eklendiğinde devam eden komutlara ilişkin transaction' larda otomatik olarak var olan bu scope (faaliyet alanı) i&amp;ccedil;erisinde ger&amp;ccedil;ekleşmektedir. Bu elbetteki varsayılan durumdur. Ancak dilerseniz &lt;strong&gt;TransactionScopeOption&lt;/strong&gt; numaralandırıcısı (enumerator) yardımıyla, yeni a&amp;ccedil;ılan transaction' ların var olan scope' a (faaliyet alanına) dahil edilip edilmeyeceğini belirleyebilirsiniz.&lt;/p&gt;
&lt;p&gt;Eğer veritabanına doğru &amp;ccedil;alışan komutlarda herhangi bir aksaklık olursa uygulama otomatik olarak using bloğunu terk edecektir. Bu durumda son satırdaki Complete metodu &amp;ccedil;ağırılabilir hale gelecektir. Bu da transaction i&amp;ccedil;erisindeki işlemlerin commit edilebileceği anlamına gelir. Bu yeni teknik, eskisine g&amp;ouml;re &amp;ouml;zellikle kod yazımını hem kolaylaştırmış hem de profesyonelleştirmiştir. Bununla birlikte var olan alışkanlıklarımızdan birisi meydana gelecek aksaklık nedeni ile kullanıcının bir istisna mekanizması ile uyarılabilmesini sağlamak veya başka işlemleri yaptırmaktır. Dolayısıyla aynı &amp;ouml;rneği aşağıdaki haliyle de yazabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using (TransactionScope tsScope = new TransactionScope())
{
    SqlConnection con = new SqlConnection("data source=localhost;database=AdventureWorks;integrated security=SSPI");
    SqlCommand cmd = new SqlCommand("INSERT INTO Personel (AD,SOYAD,MAIL) VALUES ('Burak Selim','ŞENYURT','selim(at)buraksenyurt.com')", con);
    try
    {
        con.Open();
        cmd.ExecuteNonQuery();
        tsScope.Complete();
    }
    catch (TransactionException hata)
    {
        Console.WriteLine(hata.Message.ToString());
    }
    finally
    {
        con.Close();
    }
}&lt;/pre&gt;
&lt;p&gt;Burada oluşabilecek istisnayı yakalamak istediğimiz i&amp;ccedil;in bir try-catch-finally bloğunu kullandık. Ancak dikkat ederseniz TransactionScope nesnemiz yine using bloğu i&amp;ccedil;erisinde kullanılmıştır ve transaction' ı commit etmek i&amp;ccedil;in Complete metodu &amp;ccedil;ağırılmıştır. Her iki &amp;ouml;rnekte LightWeight Transaction tipindedir. &amp;Ccedil;&amp;uuml;nk&amp;uuml; tek bir connection ve yine tek bir application domain mevcuttur. Elbette birden fazla komutun yer aldığı transaction' larda aynı teknik kullanılarak oluşturulabilir. Ancak farklı veritabanlarına bağlanan aksiyonlar s&amp;ouml;z konusu ise Transaction' ların oluşturulması ve arka planda ger&amp;ccedil;ekleşen olaylar biraz farklıdır. Şimdi bu durumu &amp;ouml;rneklemek i&amp;ccedil;in aşağıdaki Console uygulamasını oluşturalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using (TransactionScope tsScope = new TransactionScope())
{
    using (SqlConnection conAdventureWorks = new SqlConnection("data source=localhost;database=AdventureWorks;integrated security=SSPI"))
    {
        SqlCommand cmdAdvPersonel = new SqlCommand("INSERT INTO Personel (AD,SOYAD,MAIL) VALUES ('Burak Selim','ŞENYURT','selim(at)buraksenyurt.com')", conAdventureWorks);
        conAdventureWorks.Open();
        cmdAdvPersonel.ExecuteNonQuery();
        using (SqlConnection conNorthwind = new SqlConnection("data source=localhost;database=Northwind;integrated security=SSPI"))
        {
            conNorthwind.Open();
            SqlCommand cmdNrtPersonel = new SqlCommand("UPDATE Personel SET AD='Gustavo' WHERE ID=1", conNorthwind);
            cmdNrtPersonel.ExecuteNonQuery();
        }
    }
    tsScope.Complete();
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ilk yazdığımız &amp;ouml;rnekten pek farkı yok. Sadece i&amp;ccedil; i&amp;ccedil;e ge&amp;ccedil;miş (nested) bir yapı var. Aynı application domain' e ait iki farklı database bağlantısı ihtiyacı olduğu i&amp;ccedil;in burada bir distributed transaction kullanılması gerekiyor. Normalde &lt;strong&gt;DTC (Distributed Transaction Coordinator)&lt;/strong&gt; kontrol&amp;uuml;nde ele alınacak bu transaction' ları oluşturmak i&amp;ccedil;in Ado.Net 1.0/1.1' de bayağı uğraşmamız gerekecekti. Oysa ki Ado.Net 2.0' da herhangi bir şey yapmamıza gerek yok. &amp;Ccedil;&amp;uuml;nk&amp;uuml; Ado.Net 2.0 otomatik olarak OleTx tipinde bir transaction oluşturacaktır. Nasıl mı? Bunu g&amp;ouml;zlemlemenin en iyi yolu, uygulama koduna &lt;strong&gt;breakpoint&lt;/strong&gt; koymak ve &lt;strong&gt;Administrative Tool-&amp;gt;Component Services&lt;/strong&gt;' dan a&amp;ccedil;ılacak olan transaction' ları izlemekle olacaktır. İlk olarak kodumuza bir breakpoint koyalım ve adım adım uygulamamızda ilerleyelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk120_3.gif" alt="" width="566" height="357" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sarı noktaya gelinceye kadar ve conNorthwind isimli bağlantı Open metodu ile a&amp;ccedil;ılıncaya kadar aktif olan tek bir Connection nesnesi vardır. Buraya kadar transaction' ımız LightWeight tipindedir. Ancak ikinci bağlantıda a&amp;ccedil;ıldıktan sonra bu bağlantı TransactionScope nesnemize otomatik olarak eklenecektir. İşte sarı noktada iken Administrative Tool-&amp;gt;Component Services' a bakarsak, &lt;strong&gt;TransactionList&lt;/strong&gt; i&amp;ccedil;erisinde, DTC kontrol&amp;uuml; altında kullanıcı tanımlı bir transaction' ın otomatik olarak a&amp;ccedil;ıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk120_2.gif" alt="" width="576" height="259" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Artık her iki connection &amp;uuml;zerinde &amp;ccedil;alışan komutlar DTC altında oluşturulan bu Connection' ın kontrol&amp;uuml; altındadır. İşlemler başarılı bir şekilde tamamlanırsa TransactionScope nesnesine ait using bloğunun sonundaki kod satırı &amp;ccedil;alışacaktır. Yani Complete metodu y&amp;uuml;r&amp;uuml;t&amp;uuml;lecektir. Bu sayede işlemler Commit edilir ve b&amp;ouml;ylece t&amp;uuml;m işlemler onaylanarak veritabanlarına yazılır. Using bloğundan &amp;ccedil;ıkıldıktan sonra ise, DTC kontrol&amp;uuml; altındaki bu transaction otomatik olarak kaldırılır. DTC kontrol&amp;uuml; altında oluşturulan transaction' lar her zaman unique bir ID değerine sahip olur. B&amp;ouml;ylece sunucu &amp;uuml;zerinde aynı anda &amp;ccedil;alışan birden fazla distributed transaction var ise, bunların birbirlerinden ayırt edilmeleri ve uygun olan application domain' ler tarafından ele alınmaları sağlanmış olur.&lt;/p&gt;
&lt;p&gt;TransactionScope nesnesinin belirlediği scope (faaliyet alanı) altında a&amp;ccedil;ılan transaction' lar bir takım &amp;ouml;zelliklere sahiptir. &amp;Ouml;rneğin eskiden olduğu gibi IsolationLevel değerleri veya TimeOut s&amp;uuml;releri vardır. Dilersek oluşturulacak bir TransactionScope nesnesinin ilgili değerlerini &amp;ouml;nceden manuel olarak ayarlayabilir b&amp;ouml;ylece bu scope (faaliyet alanı) i&amp;ccedil;indeki transaction' ların ortak &amp;ouml;zelliklerini belirleyebiliriz. Bunun i&amp;ccedil;in &lt;strong&gt;TransactionOptions&lt;/strong&gt; sınıfına ait nesne &amp;ouml;rnekleri kullanılır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;TransactionOptions trOptions = new TransactionOptions();
trOptions.IsolationLevel = System.Transactions.IsolationLevel.ReadCommitted;
trOptions.Timeout = new TimeSpan(0, 0, 30);
using (TransactionScope tsScope = new TransactionScope(TransactionScopeOption.RequiresNew,trOptions))
{
    using (SqlConnection con = new SqlConnection("data source=localhost;database=AdventureWorks;integrated security=SSPI"))
    {
        SqlCommand cmd = new SqlCommand("INSERT INTO Personel (AD,SOYAD,MAIL) VALUES ('Burak Selim','ŞENYURT','selim(at)buraksenyurt.com')", con);
        con.Open();
        cmd.ExecuteNonQuery();
        tsScope.Complete();
    }
}&lt;/pre&gt;
&lt;p&gt;Yukarıdaki &amp;ouml;rnekte, oluşturulacak olan transaction' ın izolasyon seviyesi ve zaman aşımı s&amp;uuml;releri belirlenmiş ve TransactionScope nesnemiz bu opsiyonlar &amp;ccedil;er&amp;ccedil;evesinde aşağıdaki overload metot versiyonu ile oluşturulmuştur.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;TransactionScope tsScope = new TransactionScope(TransactionScopeOption.RequiresNew,trOptions)&lt;/pre&gt;
&lt;p&gt;Burada ilk parametre birden fazla TransactionScope nesnesinin yer aldığı i&amp;ccedil; i&amp;ccedil;e ge&amp;ccedil;miş yapılarda b&amp;uuml;y&amp;uuml;k &amp;ouml;nem arzetmektedir. Bu se&amp;ccedil;enek ile yeni a&amp;ccedil;ılan transaction scope' un (faaliyet alanının) var olan &amp;ouml;nceki bir transaction faaliyet alanına katılıp katılmayacağı gibi se&amp;ccedil;enekler belirlenir. &amp;Ouml;rneğin aşağıdaki basit yapıyı ele alalım. Burada ilk using bloğu ile bir Transaction Scope oluşturulur. İkinci using ifadesine gelindiğinde yeni transaction scope' un &amp;ouml;nceki transaction scope' a ilave edileceği TransactionScopeOption parametresi ile belirlenir. Nitekim &lt;strong&gt;Required&lt;/strong&gt; değeri, yeni scope' u var olan &amp;ouml;nceki scope' a ekler. Eğer var olan bir scope yok ise yeni bir tane oluşturur. Elbetteki burada akla gelen soru scope i&amp;ccedil;indeki transaction' ların kimin tarafından onaylanacağıdır. Burada root scope kim ise ona ait Complete metodu devreye girecektir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using(TransactionScope faaliyetAlani1 = new TransactionScope())
{
    ...
    using(TransactionScope faaliyetAlani2 = new TransactionScope(TransactionScopeOption.Required))
    {
        ...
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk120_4.gif" alt="" width="391" height="366" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi yukarıdaki nested scope yapısı i&amp;ccedil;ine &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; bir scope daha ilave edelim. Ancak yeni TransactionScope i&amp;ccedil;in TransactionScopeOption değerini &lt;strong&gt;RequiresNew&lt;/strong&gt; olarak belirleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using(TransactionScope faaliyetAlani1 = new TransactionScope())
{
    ...
    using(TransactionScope faaliyetAlani2 = new TransactionScope(TransactionScopeOption.Required))
    {
        ...
    }
    using(TransactionScope faaliyetAlani3 = new TransactionScope(TransactionScopeOption.RequiresNew))
    {
        ...
    }
}&lt;/pre&gt;
&lt;p&gt;Bu durumda yapımız aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk120_5.gif" alt="" width="391" height="436" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dilersek transaction' ları a&amp;ccedil;ık&amp;ccedil;a(explicit) kendimizde man&amp;uuml;el olarak oluşturabiliriz. Şu ana kadar yaptığımız &amp;ouml;rneklerde implicit bir yaklaşım izledik. Yani ilgili transaction ve bunlara ait kaynakların otomatik olarak oluşturulmasını sağladık. &amp;Ouml;rneğin aşağıdaki kodlarda transaction' lar manuel olarak oluşturulmuştur. &lt;em&gt;(&amp;Ouml;rnek .Net 2.0 Beta s&amp;uuml;r&amp;uuml;m&amp;uuml;nde denenmiştir.)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;ICommittableTransaction trans = Transaction.Create();
try
{
    using (SqlConnection conNorthwind = new SqlConnection("data source=localhost;database=Northwind;integrated security=SSPI"))
    {
        SqlCommand cmdInsert = new SqlCommand("INSERT INTO Personel (AD,SOYAD) VALUES ('Burak Selim','Şenyurt')", conNorthwind);
        conNorthwind.Open();
        conNorthwind.EnlistTransaction(trans);
        cmdInsert.ExecuteNonQuery();
    }
    using (SqlConnection conAdv = new SqlConnection("data source=localhost;database=AdventureWorks;integrated security=SSPI"))
    {
        SqlCommand cmdInsert = new SqlCommand("INSERT INTO Personel (AD,SOYAD,MAIL) VALUES ('Cimi','Keri','cimi@keri.com')", conAdv);
        conAdv.Open();
        conAdv.EnlistTransaction(trans);
        cmdInsert.ExecuteNonQuery();
    }
    trans.Commit();
}
catch
{
    trans.Rollback();
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;ICommittableTransaction &lt;/strong&gt;aray&amp;uuml;z&amp;uuml; bir Transaction Scope' un oluşturulmasını sağlar. Bunun i&amp;ccedil;in Transaction sınıfına ait Create metodu kullanılır. Create metodu varsayılan ayarları ile birlikte bir Scope oluşturacaktır. Eğer bu Scope' a transaction' lar eklemek istersek, ilgili bağlantıları temsil eden Connection nesnelerinin &lt;strong&gt;EnlistTransaction&lt;/strong&gt; metodunu kullanırız. EnlistTransaction metodu parametre olarak transaction Scope' u temsil eden &lt;strong&gt;ICommittableTransaction &lt;/strong&gt;aray&amp;uuml;z&amp;uuml; tipinden nesne &amp;ouml;rneğini alır. Elbette aray&amp;uuml;ze eklenen transaction' lara ait işlemlerin onaylanmasını sağlamak i&amp;ccedil;in aray&amp;uuml;ze ait &lt;strong&gt;Commit&lt;/strong&gt; metodu kullanılır. Tam tersine bir sorun &amp;ccedil;ıkar ve veritabanına doğru yapılan işlemlerden birisi ger&amp;ccedil;ekleştirilemez ise o ana kadar yapılan işlemlerin geri alınması &lt;strong&gt; ICommittableTransaction&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;ne ait &lt;strong&gt;RollBack&lt;/strong&gt; metodu ile sağlanmış olur.&lt;/p&gt;
&lt;p&gt;Bu makalemizde Transaction mimarisinin Ado.Net 2.0' daki y&amp;uuml;z&amp;uuml;n&amp;uuml; incelemeye &amp;ccedil;alıştık. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi kod yazımının basitleştirilmesinin yanında, &amp;ouml;zellikle EnterpriceServices bağımlılığından kurtularak Distributed Transaction' ların otomatik hale getirilmesi ve Transaction Scope kavramının getirilmesi g&amp;ouml;ze &amp;ccedil;arpan &amp;ouml;nemli &amp;ouml;zellikler. Burada bahsedilen &amp;ouml;zellikler teorik olarak fazla bir değişikliğe uğramayacaktır. &lt;em&gt;Ancak bazı &amp;uuml;yelerin isimlerin değişiklik beklenmektedir.&lt;/em&gt; &amp;Ouml;rneğin ICommittableTransaction aray&amp;uuml;z&amp;uuml; yerine CommittableTransaction sınıfının geleceği d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmektedir. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2005-04-17 12:00:00</pubDate>
  <slug>Ado-Net-2-0-da-Transaction-Kavramc4b1-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet-20</tag>
    <tag>transaction</tag>
    <tag>oletx-transaction</tag>
    <tag>lightweight-transaction</tag>
  </tags>
  <categories>
    <category>Ado.net 2.0</category>
  </categories>
</post>