<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Core Web API  için Planlanmış Görevler</title>
  <description>Bu makalemizde Hosted Service olarak adlandırılan ve arka plan işleri(background jobs) ya da planlanmış görevler ile ilişkilendirilmiş servislerin Web API gibi WebHost türevli uygulamalarda nasıl ve ne amaçla kullanılabileceklerini inceleme çalışıyoruz.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/12/hostedsrv_1.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;a href="https://chucknorris.com/" target="_blank"&gt;Chuck Norris&lt;/a&gt;. Sanıyorum hayatımın bir b&amp;ouml;l&amp;uuml;m&amp;uuml; onun televizyonda arka arkaya yayınlanan filmleri ile ge&amp;ccedil;miştir. Asıl adı Carlo Ray Norris'tir ve Chuck ismi 1958de O, hava kuvvetlerindeyken takma ad olarak ortaya &amp;ccedil;ıkmıştır. D&amp;ouml;v&amp;uuml;ş sanatları ustası olan Chuck'ın harika bir web sitesi var. Hayran kitlesi olduk&amp;ccedil;a geniş. 1940 doğumlu olan film yıldızını Google aramalarında daha &amp;ccedil;ok "Chuck Norris Facts" ile biliyoruz.&lt;/p&gt;
&lt;p&gt;Hatta onun&amp;nbsp;hayatına dair&amp;nbsp;şakalar, olaylar, s&amp;ouml;zler&amp;nbsp;o kadar pop&amp;uuml;ler hale gelmiş ki,&amp;nbsp;&lt;a href="http://www.icndb.com/" target="_blank"&gt;International Chuck Norris Database&lt;/a&gt; isimli g&amp;ouml;n&amp;uuml;ll&amp;uuml;l&amp;uuml;k esasına g&amp;ouml;re geliştirilmiş bir hizmet bile var. &amp;Uuml;stelik&amp;nbsp;&lt;a href="http://api.icndb.com/jokes/random" target="_blank"&gt;http://api.icndb.com/jokes/random&lt;/a&gt; adresine&amp;nbsp;gittiğinizde rastgele bir fıkrasını veya şakasını&amp;nbsp;&amp;ccedil;ekebileceğiniz JSON&amp;nbsp;formatlı&amp;nbsp;bir REST servisi de bulunuyor. İşin aslı .Net Core tarafında Hosted Service kavramını araştırırken &amp;ouml;rnek olarak kullanılan ve g&amp;uuml;n&amp;uuml;n &amp;ouml;zl&amp;uuml; s&amp;ouml;z&amp;uuml;n&amp;uuml; sunan &amp;ouml;rnek bir REST servisten Chuck Norris REST API hizmetine kadar geldiğimi belirtmek isterim. &amp;Uuml;stelik onu basit bir &amp;ouml;rnekte kullanmayı da başardım.&amp;nbsp;West-World'&amp;uuml;n yeni konusu Hosted Service.&lt;/p&gt;
&lt;p&gt;Ağırlıklı olarak masa&amp;uuml;st&amp;uuml; uygulamalarından aşina olduğumuz arka plan işleri&lt;em&gt;(Background Worker Process diyelim)&lt;/em&gt;&amp;nbsp;pek &amp;ccedil;ok alanda karşımıza &amp;ccedil;ıkıyor. Bu arka plan işlerini o an &amp;ccedil;alışmakta olan uygulamanın ana Thread'inden bağımsız işleyen iş birimleri olarak d&amp;uuml;ş&amp;uuml;nebiliriz. .Net d&amp;uuml;nyasında uzun zamandır paralel zamanlı &amp;ccedil;alışmalar i&amp;ccedil;in kullanılan Task odaklı bir &amp;ccedil;atı da mevcut. Bu tanımlamalar bir araya getirildiğinde belirli periyotlarda &amp;ccedil;alışan, &amp;ccedil;eşitli iş kurallarını işleten g&amp;ouml;rev odaklı fonksiyonlar ortaya &amp;ccedil;ıkıyor. .Net Core d&amp;uuml;nyasına baktığımızda ise, &amp;ouml;zellikle WebHost veya Host tarafı i&amp;ccedil;in kullanılan Hosted Service isimli bir kavram mevcut ve bahsettiğimiz planlı işler&lt;em&gt;(Scheduled Jobs)&lt;/em&gt;&amp;nbsp;ile yakından ilişkili.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;Ouml;zellikle MicroService odaklı &amp;ccedil;&amp;ouml;z&amp;uuml;mlerde, servislerin yaşamı boyunca belli bir plana/takvime g&amp;ouml;re &amp;ccedil;alışan arka plan işleri i&amp;ccedil;in Hosted Service enstr&amp;uuml;manının kullanılabileceği ifade ediliyor.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Kimi senaryolarda bir Web uygulamasının veya Web API hizmetinin &amp;ccedil;alıştığı s&amp;uuml;re boyunca arka planda işletilmesini istediğimiz planlanmış g&amp;ouml;revlere ihtiyacımız olabilir. &amp;Ouml;rneğin i&amp;ccedil;eride biriken log'ların belirli periyotlarda Apache Kafka gibi bir kuyruk sistemine aktarılması, servis &amp;uuml;zerinde işletilecek istemci talepleri sonrası veritabanında oluşan değişikliklerin aralıklarla dinlenip&amp;nbsp;&amp;ccedil;eşitli g&amp;ouml;revlerin işletilmesi, &amp;ouml;n belleğin zaman planlamasına g&amp;ouml;re temizlenmesi ve başka bir &amp;ccedil;ok senaryo burada g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Kısacası WebHost&lt;em&gt;(bu makale &amp;ouml;zelinde)&lt;/em&gt;&amp;nbsp;ayağa kalktıktan sonra yaşamı sonlanıncaya kadar ge&amp;ccedil;en s&amp;uuml;rede belirli bir&amp;nbsp;takvimlendirmeye g&amp;ouml;re &amp;ccedil;alıştırılmasını istediğimiz arka plan g&amp;ouml;revleri s&amp;ouml;z konusu&amp;nbsp;ise Hosted Service'leri kullanabiliriz.&lt;/p&gt;
&lt;p&gt;.Net Core 2.0 ile birlikte Hosted Service'lerin kolay bir şekilde uygulanabilmesini sağlamak amacıyla &lt;a href="https://docs.microsoft.com/en-us/dotnet/api/microsoft.extensions.hosting.ihostedservice?view=aspnetcore-2.0" target="_blank"&gt;IHostedService&lt;/a&gt;&lt;em&gt;(Microsoft.Extensions.Hosting isim alanında yer alıyor)&lt;/em&gt; isimli bir aray&amp;uuml;z gelmiş. Hatta .Net Core 2.1 ile birlikte bu aray&amp;uuml;zden t&amp;uuml;retilmiş ve implementasyonu da i&amp;ccedil;eren&amp;nbsp;BackgroundService&amp;nbsp;isimli abstract bir sınıfta s&amp;ouml;z konusu. Bu sınıfın temel amacı CancellationToken mekanizmasının y&amp;ouml;netiminin kolaylaştırılması&lt;em&gt;(Kontrol edin. Adı değişmiş olabilir.&amp;nbsp;West-World &amp;uuml;zerinde&amp;nbsp;halen .Net Core 2.0&amp;nbsp;var olduğundan okuduğum bloglardaki gibi a&amp;ccedil;ık kaynak olarak sunulan&amp;nbsp;bir IHostedService implementasyonunu&amp;nbsp;kullanmacağım) &lt;/em&gt;&lt;/p&gt;
&lt;p&gt;IHostedService aray&amp;uuml;z&amp;uuml; iki operasyon tanımlamakta. StartAsync ve StopAsync isimli fonksiyonlar CancellationToken t&amp;uuml;r&amp;uuml;nden parametre alıyorlar. StartAsync operasyonu&amp;nbsp;ana uygulama&lt;em&gt;(WebHost veya Host t&amp;uuml;revli olabilir)&lt;/em&gt; başlatıldığında devreye girerken tam tersine StopAsync uygulama kapanırken işletilmekte. IHostedService uyarlaması tipler Middleware tarafında Dependency Injection mekanizması kullanılarak &amp;ccedil;alışma zamanına monte edilebiliyorlar. Singleton tipinde n sayıda Hosted Service'in &amp;ccedil;alışma zamanına eklenmesi m&amp;uuml;mk&amp;uuml;n. Bir başka deyişle uygulamanın yaşam d&amp;ouml;ng&amp;uuml;s&amp;uuml;ne istediğimiz kadar planlanmış işi birer servis olarak ekleyebiliriz. Dilerseniz hi&amp;ccedil; vakit kaybetmeden &amp;ouml;rnek bir uygulama ile konuyu anlamaya &amp;ccedil;alışalım. Boş bir Web API projesi şu an i&amp;ccedil;in işimizi g&amp;ouml;recek.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new webapi -o HowToHostedService&lt;/pre&gt;
&lt;p&gt;Sonrasında projemize HostedService isimli aşağıdaki sınıfı ekleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Threading;
using System.Threading.Tasks;
using Microsoft.Extensions.Hosting;

public abstract class HostedService : IHostedService, IDisposable
{
    private Task currentTask;
    private readonly CancellationTokenSource cancellationTokenSource = new CancellationTokenSource();

    protected abstract Task ExecuteAsync(CancellationToken cToken);

    public virtual Task StartAsync(CancellationToken cancellationToken)
    {
        currentTask = ExecuteAsync(cancellationTokenSource.Token);

        if (currentTask.IsCompleted)
            return currentTask;

        return Task.CompletedTask;
    }

    public virtual async Task StopAsync(CancellationToken cancellationToken)
    {
        if (currentTask == null)
            return;

        try
        {
            cancellationTokenSource.Cancel();
        }
        finally
        {
            await Task.WhenAny(currentTask, Task.Delay(Timeout.Infinite,cancellationToken));
        }
    }
    public virtual void Dispose()
    {
        cancellationTokenSource.Cancel();
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere HostedService sınıf IHostedService ve IDisposable aray&amp;uuml;zlerini&lt;em&gt;(Interface)&lt;/em&gt; uygulamakta. Temel g&amp;ouml;revi Hosted Service'ler ile ilişkilendirilecek olan Task'ların iptal edilme mekanizmalarının kolayca y&amp;ouml;netilebilmesi. Dispose edilebilir bir nesne olarak tanımlandığına da dikkat edelim. Ayrıca, HostedService abstract bir sınıf. Dolayısıyla kendisini &amp;ouml;rnekleyemeyiz. Bununla birlikte kendisini uygulayan sınıfların mutlaka ezmesi gereken ExecuteAsync isimli bir metod tanımı da sunuyor. Bu metodu alt tiplerde ezerken planlanmış g&amp;ouml;revin yapacağı &amp;ccedil;alışma i&amp;ccedil;in kodlamamız yeterli. Parametre olarak gelen CancellationTokenSource &amp;ouml;rneği ise StartAsync &amp;uuml;zerinden devrediliyor. StartAsync metodu alt tipin uyguladığı ExecuteAsync operasyonunu &amp;ccedil;ağırıp tamamlanıp tamamlanmadığına bakıyor. StopAsync operasynonu ise iptal işleminin y&amp;ouml;netimini ger&amp;ccedil;ekleştirmekte.&amp;nbsp;Yukarıda da bahsettiğim gibi bu sınıf .Net Core 2.1 ile birlikte&amp;nbsp;hazır olarak&amp;nbsp;gelmesi beklenen bir tip&lt;em&gt;(İ&amp;ccedil;inde kocaman g&amp;uuml;l&amp;uuml;mseme olan &lt;a href="http://www.iaspnetcore.com/Blog/BlogPost/5a6d18725430ff15206d1b52/asp-net-core-background-tasks-implementing-background-taskswith-ihostedservice" target="_blank"&gt;şu makaleye&lt;/a&gt; g&amp;ouml;z gezdirebilirsiniz)&amp;nbsp;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Artık planlanmış g&amp;ouml;revleri i&amp;ccedil;erecek &amp;ouml;rnek sınıfların yazılmasına başlanabilir. Ben sadece iki sınıfı sisteme dahil edeceğim. Her ikisi de belirli aralıklarla Console ekranına bir şeyler yazacaklar. Amacımız sadece Hosted Service mekanizmasının Web API tarafındaki tesisatının nasıl kurulması gerektiğini &amp;ouml;ğrenmek olduğundan bu basit yaklaşım yeterli olacaktır&lt;em&gt;(Nitekim s&amp;ouml;z konusu arka plan servisleri ger&amp;ccedil;ek hayat &amp;ouml;rneklerinde ger&amp;ccedil;ek iş modellerini baz alarak kurgulanmalılar)&lt;/em&gt; RequestCollectorService ve ChuckFactService isimli arka plan servis sınıflarımızı aşağıdaki gibi geliştirebiliriz.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Net.Http;
using System.Threading;
using System.Threading.Tasks;

public class ChuckFactService
: HostedService
{
    HttpClient restClient;
    string icndbUrl="http://api.icndb.com/jokes/random";
    public ChuckFactService()
    {
        restClient=new HttpClient();
    }
    protected override async Task ExecuteAsync(CancellationToken cToken)
    {
        while (!cToken.IsCancellationRequested)
        {   
            var response = await restClient.GetAsync(icndbUrl, cToken);
            if (response.IsSuccessStatusCode)
            {
                var fact = await response.Content.ReadAsStringAsync();
                Console.WriteLine($"{DateTime.Now.ToString()}\n{fact}");
            }

            await Task.Delay(TimeSpan.FromSeconds(10), cToken);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Ezilen ExecuteAsync metodunda icndb adresine bir talepte bulunup, talep sonucu HTTP 200 ise elde edilen sonucu ekrana bastırıyoruz. REST talebini g&amp;ouml;ndermek i&amp;ccedil;in HttpClient tipinden yararlanmaktayız. Bu sınıfın awaitable GetAsync fonkisyonunu kullanıyoruz. Fonkisyonda dikkat edileceği &amp;uuml;zere ilgili Task i&amp;ccedil;in iptal talebi olup olmadığının s&amp;uuml;rekli olarak kontrol edildiği bir while d&amp;ouml;ng&amp;uuml;s&amp;uuml; bulunuyor. Ayrıca s&amp;ouml;z konusu g&amp;ouml;revin 10 saniyede bir&amp;nbsp;işletilmesini&amp;nbsp;Task tipinin Delay metodu ile sağlamaktayız. Bir başka deyişle&amp;nbsp;tekrarlı g&amp;ouml;revlerin zamanlamalarını bu teknikle ayarlayabiliriz.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Threading;
using System.Threading.Tasks;

public class RequestCollectorService
: HostedService
{
    protected override async Task ExecuteAsync(CancellationToken cToken)
    {
        while (!cToken.IsCancellationRequested)
        {
            Console.WriteLine($"{DateTime.Now.ToString()} &amp;Ccedil;alışma zamanı taleplerini topluyorum.");
            await Task.Delay(TimeSpan.FromSeconds(30), cToken);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;RequestCollectorService sınıfında ise sadece ekrana bir mesaj bastırıyoruz. &amp;Ccedil;alışmasını 30 saniyede bir ger&amp;ccedil;ekleştiren bir g&amp;ouml;revlendirme s&amp;ouml;z konusu. Tanımladığımız bu g&amp;ouml;rev servislerini Host uygulamaya enjekte etmek i&amp;ccedil;in, Startup sınıfındaki ConfigureServices metodunu aşağıdaki gibi g&amp;uuml;ncellememiz yeterli.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void ConfigureServices(IServiceCollection services)
{
    services.AddMvc();

    services.AddSingleton&amp;lt;IHostedService,ChuckFactService&amp;gt;();
    services.AddSingleton&amp;lt;IHostedService,RequestCollectorService&amp;gt;();
}&lt;/pre&gt;
&lt;p&gt;Bu değişiklikle, AddSingleton metodunun generic versiyonunu kullanarak IHostedService uyarlamasını ger&amp;ccedil;ekleştiren ChuckFactService ve RequestCollectorService sınıflarının arka plan hizmetlerine eklenmesini sağladık. Artık Web uygulaması &amp;ccedil;alışmaya başladığında bu sınıflar otomatik olarak devreye alınacak ve &amp;uuml;zerlerindeki g&amp;ouml;revler belirlenen s&amp;uuml;relerinde işletilecekler. Uygulamamızı &amp;ccedil;alıştırdıktan sonrasına ait &amp;ouml;rnek bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/12/hostedsrv_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;10 saniyede bir Chuck Norris'e ait servise bir &amp;ccedil;ağrı ve 30 saniyede bir ortam verilerini toplama işlemi ger&amp;ccedil;ekleşmektedir. Bu sırada Web API servisinin normal hizmetini s&amp;uuml;rd&amp;uuml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml; de ifade edelim. Yani gelen talepleri karşılar haldedir. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere arkaplan g&amp;ouml;revlerinin Web tabanlı uygulamalarda konuşlandırılması olduk&amp;ccedil;a kolay. .Net Core tarafının Dependency Injection mekanizması da bu işi basitleştirmekte. Microservice odaklı &amp;ccedil;&amp;ouml;z&amp;uuml;mlerde bu teknikten yararlanılarak arka plan g&amp;ouml;revlerinin tesis edilmesi kolaylıkla sağlanabilir. Hosted Service tipleri Task'ların y&amp;uuml;r&amp;uuml;t&amp;uuml;ld&amp;uuml;ğ&amp;uuml; noktalarda asenkron &amp;ccedil;alışan dış sistemlerle entegre olabilirler&lt;em&gt;(RabbitMQ, Kafka, MSMQ. Azure Service Bus, WSO2 vb)&lt;/em&gt; Benim i&amp;ccedil;in yine keşfedilmesi, &amp;ccedil;alışılması, uygulanması ve &amp;ouml;ğrenilmesi keyifli bir konuydu. Bir başka makalede g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2018-02-09 04:27:00</pubDate>
  <slug>core-web-api-icin-planlanmis-gorevler</slug>
  <tags>
    <tag>aspnet-core</tag>
    <tag>aspnet-core-web-api</tag>
    <tag>task</tag>
    <tag>i-hosted-service</tag>
    <tag>scheduling</tag>
    <tag>backgroundworker</tag>
    <tag>task-based-programming</tag>
    <tag>parallel-computing</tag>
    <tag>parallel-programming</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
  </categories>
</post>