<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Sıfır Sabit Değeri ve Enum Sorunu</title>
  <description>C# konulu yeni bir bilmece ile karşı karşıyayız. Bu sefer kolay kolay fark edemeyebileceğimiz, basit ama irdelenmesi gereken bir vakayı göz önüne alacağız.</description>
  <content>&lt;p&gt;&lt;a href="/pics/1186819_puzzle_time_1.jpg"&gt;&lt;img style="background-image: none; padding-top: 0px; padding-left: 0px; margin: 4px 0px; display: inline; padding-right: 0px; border-width: 0px;" title="1186819_puzzle_time_1" src="/pics/1186819_puzzle_time_1_thumb.jpg" alt="1186819_puzzle_time_1" width="230" height="240" align="right" border="0" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;C# konulu yeni bir bilmece ile karşı karşıyayız. Bu sefer kolay kolay fark edemeyebileceğimiz, basit ama irdelenmesi gereken bir vakayı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alacağız.&lt;/p&gt;
&lt;p&gt;Bir uygulamayı geliştirirken, Developer olarak son derece dikkatli olmalı ve testlerimizi ger&amp;ccedil;ekleştirirken de t&amp;uuml;m senaryoları g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almalıyız. Bu anlamda gerek dilin gerek &lt;strong&gt;.Net Framework&lt;/strong&gt; alt yapısının t&amp;uuml;m unsurlarına hakim olmak da son derece &amp;ouml;nemli.&lt;/p&gt;
&lt;p&gt;Nitekim bazı noktalarda profesyonel bir geliştiricinin dahi kestiremeyeceği sorunsallar yaşanabiliyor. Yazımızın ilerleyen kısımlarında bu perspektiften bakarak sorun olarak da g&amp;ouml;r&amp;uuml;lebilecek bir konuyu masaya yatıracağız.&lt;/p&gt;
&lt;h2&gt;Senaryo&lt;/h2&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;C#&lt;/strong&gt; dili ile geliştireceğimiz aşağıdaki basit kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/ze_0.png"&gt;&lt;img style="display: inline;" title="ze_0" src="/pics/ze_0_thumb.png" alt="ze_0" width="315" height="294" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Collections.Generic;

namespace EnumAndZeroConstant 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            List&amp;lt;Information&amp;gt; infos = new List&amp;lt;Information&amp;gt;() 
                                          { 
                                              new Information("Hata mesajı"), 
                                              new Information(InformationType.Application), 
                                                              new Information(InformationType.Member), 
                                                              new Information(InformationType.System), 
                                                              new Information(0), 
                                                              new Information(1), 
                                                              new Information(2), 
                                                              new Information(3) 
                                          };

            foreach (Information info in infos) 
            { 
                Console.WriteLine(info.SummaryMessage); 
            }

        } 
    }

    enum InformationType 
    { 
        System, 
        Application, 
        Member 
    }

    class Information 
    { 
        public string SummaryMessage { get; private set; }

        public Information(object commonInformation) 
        { 
            SummaryMessage = commonInformation.ToString(); 
        }

        public Information(InformationType informationType) 
        { 
            switch (informationType) 
            { 
                case InformationType.Application: 
                    SummaryMessage = "Uygulama bilgisi"; 
                    break; 
                case InformationType.System: 
                    SummaryMessage = "Sistem bilgisi"; 
                    break; 
                case InformationType.Member: 
                    SummaryMessage = "&amp;Uuml;yeden"; 
                    break; 
                default: 
                    SummaryMessage = "Bilinmeyen kaynak"; 
                    break; 
            } 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızda &lt;strong&gt;InformationType&lt;/strong&gt; isimli bir &lt;strong&gt;Enum&lt;/strong&gt; sabiti ve bu tipi kullanan &lt;strong&gt;Information&lt;/strong&gt; isimli bir sınıf(Class) tanımlanmıştır. &lt;strong&gt;Information&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde yer alan &lt;strong&gt;SummaryMessage&lt;/strong&gt; isimli &lt;strong&gt;&amp;ouml;zelliğimiz(Property)&lt;/strong&gt; dikkat edileceği &amp;uuml;zere &lt;strong&gt;Read Only&lt;/strong&gt; belirtilmiştir(&lt;em&gt;set keyword&amp;rsquo; &amp;uuml; başındaki private kullanımına dikkat)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Information&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde kullanılan &lt;strong&gt;SummaryMessage&lt;/strong&gt; &amp;ouml;zelliğinin değerini set etmek i&amp;ccedil;in, &lt;strong&gt;yapıcı metod(Constructor)&lt;/strong&gt; parametrelerinden yararlanılmaktadır. İki adet &lt;strong&gt;aşırı y&amp;uuml;klenmiş yapıcı metod(Overload Contstructor)&lt;/strong&gt; mevcuttur. Bunlardan birisi &lt;strong&gt;InfortmationType&lt;/strong&gt; &lt;strong&gt;enum&lt;/strong&gt; sabiti tipinden bir değişken almakta ve bunun değerine g&amp;ouml;re &lt;strong&gt;SummaryMessage&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;string&lt;/strong&gt; bir değer atamaktadır. Bu anlamda diğer aşırı y&amp;uuml;klenmiş versiyon ise, &lt;strong&gt;object&lt;/strong&gt; tipinden gelen referans değişkenin, &lt;strong&gt;ToString&lt;/strong&gt; metodunun sonucunu kullanmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisinde test ama&amp;ccedil;lı olaraktan, &lt;strong&gt;Information&lt;/strong&gt; tipinden &lt;strong&gt;generic&lt;/strong&gt; bir &lt;strong&gt;List&lt;/strong&gt; koleksiyonu değerlendirilmektedir. Dikkat edileceği &amp;uuml;zere, koleksiyonun &lt;strong&gt;Information&lt;/strong&gt; tipinden olan her bir nesne &amp;ouml;rneği &amp;uuml;retilirken, parametre olarak farklı referanslar g&amp;ouml;nderilmektedir. Test amacıyla &lt;strong&gt;String, int, InfortmationType&lt;/strong&gt; t&amp;uuml;r&amp;uuml;nden değişken değerleri ele alınmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;ldquo;Peki bu kod par&amp;ccedil;asında nasıl bir tuzak olabilir? Ya da başka bir deyişle bir tuzak var mıdır? G&amp;ouml;z&amp;uuml;m&amp;uuml;zden ka&amp;ccedil;ırdığımız bir nokta s&amp;ouml;z konusu ise nedir? &amp;ldquo;&lt;/strong&gt;&lt;/p&gt;
&lt;h2&gt;D&amp;uuml;ş&amp;uuml;nsel ve Ger&amp;ccedil;ek &amp;Ccedil;alışma Sonu&amp;ccedil;ları&lt;/h2&gt;
&lt;p&gt;Bu sorulara cevap bulabilmek i&amp;ccedil;in &amp;ouml;ncelikli olarak kodun nasıl bir sonu&amp;ccedil; &amp;uuml;reteceğini d&amp;uuml;ş&amp;uuml;nmeye &amp;ccedil;alışalım. Aslında beklentimiz, uygulamanın &amp;ccedil;ıktısının aşağıdaki temsilde olduğu gibi &amp;uuml;retilmesidir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Hata mesajı &lt;br /&gt;Uygulama bilgisi &lt;br /&gt;&amp;Uuml;yeden &lt;br /&gt;Sistem bilgisi &lt;br /&gt;0 &lt;br /&gt;1 &lt;br /&gt;2 &lt;br /&gt;3&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Ancak, yapıcı metoda g&amp;ouml;nderilen &lt;strong&gt;0&lt;/strong&gt; değerinden pis kokular gelmektedir. Ne demek istediğimi daha net bir şekilde ifade edebilmek i&amp;ccedil;in uygulamanın &lt;strong&gt;&amp;ccedil;alışma zamanı&lt;em&gt;(Runtime)&lt;/em&gt;&lt;/strong&gt; ekran &amp;ccedil;ıktısına bir bakalım dilerseniz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/ze_1.png"&gt;&lt;img style="display: inline;" title="ze_1" src="/pics/ze_1_thumb.png" alt="ze_1" width="588" height="175" /&gt;&lt;/a&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Uppsss! Bir fark g&amp;ouml;rebildiniz mi? Biz yapıcı metodumuza &lt;strong&gt;0&lt;/strong&gt; değişkenini g&amp;ouml;ndermemize rağmen, ekrana &lt;strong&gt;InformationSystem&lt;/strong&gt; &lt;strong&gt;enum&lt;/strong&gt; sabitindeki ilk değere karşılık gelen &lt;strong&gt;string&lt;/strong&gt; mesajı d&amp;ouml;nd&amp;uuml;r&amp;uuml;lm&amp;uuml;şt&amp;uuml;r. Ger&amp;ccedil;ekten de uygulamayı &lt;strong&gt;debug&lt;/strong&gt; ettiğimizde, &lt;strong&gt;0&lt;/strong&gt; değerini yapıcı metoda g&amp;ouml;nderdikten sonra &lt;strong&gt;Enum&lt;/strong&gt; sabitini parametre olarak kullanan versiyonuna gittiğimizi g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Kodu biraz değiştirip &lt;strong&gt;Debug&lt;/strong&gt; işlemimizi icra edelim ve bu durumu &amp;ccedil;alışma zamanında g&amp;ouml;relim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/ze_2.png"&gt;&lt;img style="display: inline;" title="ze_2" src="/pics/ze_2_thumb.png" alt="ze_2" width="571" height="665" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;infoZero&lt;/strong&gt; isimli &lt;strong&gt;Information&lt;/strong&gt; tipinden olan değişken &amp;ouml;rneklenirken, yapıcı metoda&lt;strong&gt; 0 integer&lt;/strong&gt; değeri g&amp;ouml;nderilmiştir. Ancak kod bu satırdan sonra &lt;strong&gt;object&lt;/strong&gt; tipinden parametre alan versiyon yerine &lt;strong&gt;InformationType&lt;/strong&gt; tipinden referans kullanan &lt;strong&gt;yapıcı metoda&lt;/strong&gt; sı&amp;ccedil;ramıştır. &amp;Uuml;stelik &lt;strong&gt;0 integer&lt;/strong&gt; değer, &lt;strong&gt;bilin&amp;ccedil;siz bir şekilde(Implicitly) InfortmationType.System&lt;/strong&gt; sabit değerine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lm&amp;uuml;şt&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;Tabi bizim buradaki asıl beklentimiz &lt;strong&gt;0&lt;/strong&gt; gibi bir sayısalın &lt;strong&gt;object&lt;/strong&gt; gibi algılanması ve uygun olan yapıcı metoda gitmesi y&amp;ouml;n&amp;uuml;ndedir. Ne varki bu ger&amp;ccedil;ekleşmemiştir. Bu aslında &lt;strong&gt;0&lt;/strong&gt; sayısal değerinin bilin&amp;ccedil;siz olarak bir &lt;strong&gt;Enum&lt;/strong&gt; sabiti formunda algılanıyor olmasıdır. Yani sıfır tabanlı sabit olarak algınanan yapıcı metod parametresi, bilin&amp;ccedil;siz olarak &lt;strong&gt;Enum&lt;/strong&gt; karşılığına d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lm&amp;uuml;şt&amp;uuml;r.&lt;/p&gt;
&lt;h2&gt;IL Tarafındaki G&amp;ouml;r&amp;uuml;nt&amp;uuml;&lt;/h2&gt;
&lt;p&gt;Zaten uygulamamızın &lt;strong&gt;IL&lt;em&gt;(Intermediate Language)&lt;/em&gt;&lt;/strong&gt; tarafındaki &amp;ccedil;ıktısına baktığımızda, &lt;strong&gt;0&lt;/strong&gt; atamasının yapıldığı yerde &lt;strong&gt;InformationType&lt;/strong&gt; &lt;strong&gt;enum&lt;/strong&gt; sabitinin kullanıldığı versiyonun &amp;ccedil;ağırılacağı da &amp;ouml;nceden belirtilmiştir.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;.method private hidebysig static void  Main(string[] args) cil managed 
{ 
  .entrypoint 
  // Code size       191 (0xbf) 
  .maxstack  3 
  .locals init ([0] class EnumAndZeroConstant.Information infoZero, 
           [1] class [mscorlib]System.Collections.Generic.List`1&amp;lt;class EnumAndZeroConstant.Information&amp;gt; infos, 
           [2] class EnumAndZeroConstant.Information info, 
           [3] class [mscorlib]System.Collections.Generic.List`1&amp;lt;class EnumAndZeroConstant.Information&amp;gt; '&amp;lt;&amp;gt;g__initLocal0', 
           [4] valuetype [mscorlib]System.Collections.Generic.List`1/Enumerator&amp;lt;class EnumAndZeroConstant.Information&amp;gt; CS$5$0000, 
           [5] bool CS$4$0001) 
  IL_0000:  nop 
  IL_0001:  ldc.i4.0 
  IL_0002:  newobj     instance void EnumAndZeroConstant.Information::.ctor(valuetype EnumAndZeroConstant.InformationType)&lt;/pre&gt;
&lt;h2&gt;Sorunun &amp;Ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;&lt;/h2&gt;
&lt;p&gt;Bu g&amp;ouml;zden kolayca ka&amp;ccedil;abilecek bir noktadır. Hani test s&amp;uuml;re&amp;ccedil;lerinde&lt;strong&gt; Zero-Data&lt;/strong&gt; diye bir senaryo vardır ger&amp;ccedil;i ama bu vaka zaten onunla bir değildir. Sadece bir isim benzerliği olduğunu ifade edebiliriz. Bizim burada sorunu nasıl &amp;ccedil;&amp;ouml;zebileceğimize bir bakmamız gerekiyor. Mademki ortada &lt;strong&gt;bilin&amp;ccedil;siz bir t&amp;uuml;r d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml; var(Implicitly Type Conversion)&lt;/strong&gt; bu durumda d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml; bilin&amp;ccedil;li hale getirmeyi deneyebiliriz&lt;strong&gt;(Explicitly Type Conversion)&lt;/strong&gt;. Aşağıdaki kod par&amp;ccedil;asındaki denemeleri yaptığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Information infoZero1 = new Information((int)0); 
var zeroVar = 0; 
Information infoZero2=new Information(zeroVar); 
object zeroObj = 0; 
Information infoZero3 = new Information(zeroObj); 
int zeroInt = Convert.ToInt32("0"); 
Information infoZero4 = new Information(zeroInt); 
double zeroDbl = 0.0; 
Information infoZero5 = new Information(zeroDbl); 
Information infoZero6 = new Information(0.0); 
var infoZero7 = new Information(0);

List&amp;lt;Information&amp;gt; infos = new List&amp;lt;Information&amp;gt;() 
                              { 
                                                  infoZero1, 
                                                  infoZero2, 
                                                  infoZero3, 
                                                  infoZero4, 
                                                  infoZero5, 
                                                  infoZero6, 
                                                  infoZero7 
                              };&lt;/pre&gt;
&lt;p&gt;Burada farklı şekillerde &lt;strong&gt;0&lt;/strong&gt; değerinin g&amp;ouml;nderilmesi s&amp;ouml;z konusu olmuştur. İlk olarak &lt;strong&gt;cast&lt;/strong&gt; operat&amp;ouml;r&amp;uuml; g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınarak&lt;strong&gt; 0&lt;/strong&gt; değerinin &lt;strong&gt;int&lt;/strong&gt; tipinden ele alınması denenmiştir. İkinci olarak &lt;strong&gt;0&lt;/strong&gt; değişkenini taşıyan bir &lt;strong&gt;var&lt;/strong&gt; tanımlaması yapılmaktadır. Devam eden kısımda sırasıyla &lt;strong&gt;Object&lt;/strong&gt; tipine atanarak yapıcı metoda g&amp;ouml;nderilme, &lt;strong&gt;Convert&lt;/strong&gt; tipinin &lt;strong&gt;static Int32&lt;/strong&gt; metodundan yararlanma, &lt;strong&gt;double&lt;/strong&gt; bir değişken atama, yapıcı metoda parametre olarak &lt;strong&gt;0&lt;/strong&gt; g&amp;ouml;nderirken &lt;strong&gt;var&lt;/strong&gt; kullanarak ilerleme se&amp;ccedil;enekleri de denenmiştir. Bu durumda uygulamanın ekran &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/ze_3.png"&gt;&lt;img style="display: inline;" title="ze_3" src="/pics/ze_3_thumb.png" alt="ze_3" width="588" height="139" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere yapıcı metoda &lt;strong&gt;0 &lt;/strong&gt;değeri atama işlemini, dışarıda tanımlanan bir değişken &amp;uuml;zerinden ger&amp;ccedil;ekleştirdiğimizde &lt;strong&gt;object&lt;/strong&gt; tipini kullanan yapıcı metoda gidilmiştir. Tabi bu durumda &lt;strong&gt;Information&lt;/strong&gt; tipini kullanan geliştiricinin bu durumu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alması ve &amp;ouml;ncesinde gerekli d&amp;ouml;n&amp;uuml;ş&amp;uuml;m işlemlerini yapması gibi bir sorumluluk ortaya &amp;ccedil;ıkmaktadır. Oysaki geliştirici veya &lt;strong&gt;Object User&lt;/strong&gt; &amp;ccedil;ok kolayca durumu g&amp;ouml;zden ka&amp;ccedil;ırabilir. Daha kalıcı bir &amp;ccedil;&amp;ouml;z&amp;uuml;m ile ilerlemek gerekmektedir. Bunun i&amp;ccedil;in &lt;strong&gt;Information&lt;/strong&gt; tipinin yapıcı metodlarının sayısını arttırıp tipe g&amp;ouml;re bir aksiyon alınması sağlanabilir. Aşağıdaki kod par&amp;ccedil;asın g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class Information 
{ 
    public string SummaryMessage { get; private set; }

    public Information(int info) 
    { 
        SummaryMessage = info.ToString(); 
    } 
    public Information(double info) 
    { 
        SummaryMessage = info.ToString(); 
    } 
    public Information(object commonInformation) 
    { 
        SummaryMessage = commonInformation.ToString(); 
    }

    public Information(InformationType informationType) 
    { 
        switch (informationType) 
        { 
            case InformationType.Application: 
                SummaryMessage = "Uygulama bilgisi"; 
                break; 
            case InformationType.System: 
                SummaryMessage = "Sistem bilgisi"; 
                break; 
            case InformationType.Member: 
                SummaryMessage = "&amp;Uuml;yeden"; 
                break; 
            default: 
                SummaryMessage = "Bilinmeyen kaynak"; 
                break; 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;int&lt;/strong&gt; ve &lt;strong&gt;double&lt;/strong&gt; tiplerini parametre olarak alan iki ek yapıcı metod daha ilave edilmiştir. Bu durumda &lt;strong&gt;0&lt;/strong&gt; ve &lt;strong&gt;0.0&lt;/strong&gt; değerleri i&amp;ccedil;in uygun olan yapıcı metodlar devreye girecek, bir başka deyişle &lt;strong&gt;InformationType&lt;/strong&gt; &lt;strong&gt;enum&lt;/strong&gt; sabitin kullanan yapıcı metod g&amp;ouml;z ardı edilecektir. Tabi yine de &amp;ccedil;ok şık bir &amp;ccedil;&amp;ouml;z&amp;uuml;m olmadığını ifade etmemiz gerekiyor. Nitekim&lt;strong&gt; 0&lt;/strong&gt; değerini taşıyabilecek pek &amp;ccedil;ok sayısal tip mevcuttur. &lt;strong&gt;Byte, short, float&lt;/strong&gt; vb&amp;hellip;Dolayısıyla bunların her biri i&amp;ccedil;in bir aşırı y&amp;uuml;klenmiş yapıcı metod yazmak &amp;ccedil;ok da yerinde olmayabilir. Yine de &lt;strong&gt;Information&lt;/strong&gt; tipini kullanacak olan geliştirici i&amp;ccedil;in hata riski bu şekilde azaltılabilir. Uygulamayı bu haliyle &amp;ccedil;alıştırdığımızda aşağıdaki ekran &amp;ccedil;ıktısını elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/ze_4.png"&gt;&lt;img style="display: inline;" title="ze_4" src="/pics/ze_4_thumb.png" alt="ze_4" width="588" height="151" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;İstediğimiz sonuca ulaştık. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;Enum&lt;/strong&gt; sabitlerini yapıcı metodlara parametre olarak ge&amp;ccedil;irdiğimizde, g&amp;ouml;ndereceğimiz &lt;strong&gt;0&lt;/strong&gt; sabit değeri otomatik olarak bir &lt;strong&gt;enum&lt;/strong&gt; sabiti tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmektedir. Dolayısıyla s&amp;ouml;z konusu sınıf i&amp;ccedil;erisinde &lt;strong&gt;object&lt;/strong&gt; tipini kullanan başka bir yapıcı metod varsa, tedbir almadığımız durumda fark etmeyeceğimiz bir &amp;ccedil;alışma zamanı sonucu &amp;uuml;retilebilir. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2012%2f1%2fEnumAndZeroConstant.zip"&gt;EnumAndZeroConstant.zip (1,97 mb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2013-09-19 10:48:00</pubDate>
  <slug>Sifir-Sabit-Degeri-ve-Enum-Sorunsali</slug>
  <tags>
    <tag>c#</tag>
    <tag>c#-temelleri</tag>
    <tag>enum-type</tag>
    <tag>constant</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>