<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tablo Değişikliklerini GetChanges ile İzlemek</title>
  <description>Bugünkü makalemizde, bağlantısız olarak veri tabloları ile çalışırken, bu tablolar üzerinde meydana gelen değişiklikleri nasıl izleyebileceğimizi ve davranışlarımızı bu değişikliklere göre nasıl yönledirebileceğimizi incelemeye çalışacağız.

Hepimizin bildiği gibi, bağlantısız veriler ile çalışırken, bir veri kaynağında, makinemizin belleğine tablo veya tabloları alırız. Bu tablolar üzerinde, yeni satırlar oluşturur, var olan satırlar üzerinde değişiklikler yapar, her hangibir satırı siler ve bunlar gibi bir takım işlemler gerçekleştiririz. Tüm bu işlemler, bellek bölgesine aldığımız veriler üzerinde bir DataTable nesnesinde yada bir DataSet kümesinde gerçekleşir. Bununla birlikte, bahsettiğimiz bu değişiklikleri, asıl veri kaynağınada yansıtarak, güncellenmelerinide sağlarız.</description>
  <content>&lt;p align="left"&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde, bağlantısız olarak veri tabloları ile &amp;ccedil;alışırken, bu tablolar &amp;uuml;zerinde meydana gelen değişiklikleri nasıl izleyebileceğimizi ve davranışlarımızı bu değişikliklere g&amp;ouml;re nasıl y&amp;ouml;nledirebileceğimizi incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;Hepimizin bildiği gibi, bağlantısız veriler ile &amp;ccedil;alışırken, bir veri kaynağında, makinemizin belleğine tablo veya tabloları alırız. Bu tablolar &amp;uuml;zerinde, yeni satırlar oluşturur, var olan satırlar &amp;uuml;zerinde değişiklikler yapar, her hangibir satırı siler ve bunlar gibi bir takım işlemler ger&amp;ccedil;ekleştiririz. T&amp;uuml;m bu işlemler, bellek b&amp;ouml;lgesine aldığımız veriler &amp;uuml;zerinde bir DataTable nesnesinde yada bir DataSet k&amp;uuml;mesinde ger&amp;ccedil;ekleşir. Bununla birlikte, bahsettiğimiz bu değişiklikleri, asıl veri kaynağınada yansıtarak, g&amp;uuml;ncellenmelerinide sağlarız.&lt;/p&gt;
&lt;p&gt;Ancak, network trafiğinin &amp;ouml;nemli ve yoğun olduğu uygulamalarda, veri kaynağından aldığımız bir veri k&amp;uuml;mesinin &amp;uuml;zerindeki değişiklikleri, asıl veri kaynağına g&amp;uuml;ncellerken karşımıza iki durum &amp;ccedil;ıkar. İlk olarak, makinemizin belleğinde bulunan t&amp;uuml;m veriler asıl veri kaynağına g&amp;ouml;nderilir ki bu veriler i&amp;ccedil;inde hi&amp;ccedil; bir değişikliğe uğramamış olanlarda vardır. Diğer yandan istersek, sadece yeni eklenen satırları veya d&amp;uuml;zenlenen satırları vb., veri kaynağına g&amp;ouml;nderek daha akılcı bir iş yapmış oluruz. İşte makalemizin ana konusunu teşkil eden bu ikinci durumu ger&amp;ccedil;ekleştirebilmek i&amp;ccedil;in GetChanges metodunu kullanırız. GetChanges metodu, DataSet ve DataTable sınıfları i&amp;ccedil;inde kullanılabilmektedir. DataTable ve DataSet sınıfları i&amp;ccedil;in, GetChanges metodunun ikişer aşırı y&amp;uuml;klenmiş şekli vardır.&lt;/p&gt;
&lt;div&gt;
&lt;table id="AutoNumber1" style="width: 640px; height: 79px;" border="1" cellspacing="1" cellpadding="2"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#cccccc" width="381" height="39"&gt;&lt;span style="font-weight: bold; font-family: Verdana;"&gt;DataTable İ&amp;ccedil;in&lt;/span&gt;&lt;/td&gt;
&lt;td align="center" bgcolor="#cccccc" width="48%" height="39"&gt;&lt;span style="font-weight: bold; font-family: Verdana;"&gt;DataSet İ&amp;ccedil;in&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="381" height="32"&gt;
&lt;blockquote&gt;
&lt;p align="left"&gt;public DataTable GetChanges();&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="48%" height="32"&gt;
&lt;blockquote&gt;
&lt;p&gt;public DataSet GetChanges();&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="381" height="6"&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt; public &lt;/strong&gt; DataTable&lt;strong&gt; GetChanges( &lt;/strong&gt;DataRowState &lt;em&gt;rowStates&lt;/em&gt;&lt;strong&gt;);&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="48%" height="6"&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt; public &lt;/strong&gt; DataSet&lt;strong&gt; GetChanges(&lt;/strong&gt;DataRowState &lt;em&gt;rowStates&lt;/em&gt;&lt;strong&gt;);&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi her iki sınıf i&amp;ccedil;inde metodlar aynı şekilde işlemektedir. Sadece metodların geri d&amp;ouml;n&amp;uuml;ş tipleri farklıdır. DataSet i&amp;ccedil;in, GetChanges metodu başka bir DataSet geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;rken, DataTable'ın GetChanges metodu ise geriye DataTable t&amp;uuml;r&amp;uuml;nden bir nesne referansını d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Peki GetChanges metodunun g&amp;ouml;revi nedir? GetChanges metodunun parametresiz kullanılan hali, DataTable veya DataSet i&amp;ccedil;in, AcceptChanges metodu &amp;ccedil;ağırılana kadar meydana gelen t&amp;uuml;m değişiklikleri alır. &amp;Ouml;rneğin bir DataTable nesnesinin referans ettiği bellek b&amp;ouml;lgesinde yer alan bir veri k&amp;uuml;mesi &amp;uuml;zerinde, satır ekleme, satır silme ve satır d&amp;uuml;zenleme işlemlerini yaptığımızı farzedelim. Bu durumda, bu DataTable nesnesi i&amp;ccedil;in AcceptChanges metodunu &amp;ccedil;ağırıp t&amp;uuml;m değişiklikleri onaylamadan &amp;ouml;nce, GetChanges metodunu kullanırsak, tablo &amp;uuml;zerindeki t&amp;uuml;m değişiklikleri izleyebiliriz. Bunu daha iyi g&amp;ouml;rmek i&amp;ccedil;in aşağıdaki &amp;ouml;rneği inceleyelim. Bu &amp;ouml;rnekte Sql sunucumuz &amp;uuml;zerinde yer alan bir tablo verilerini DataTable nesnemizin bellekte referans ettiği b&amp;ouml;lgeye y&amp;uuml;kl&amp;uuml;yor ve verilerin g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; DataGrid kontrol&amp;uuml;m&amp;uuml;ze bağlıyoruz. Programdaki &amp;ouml;nemli nokta, GetChanges metodu ile meydana gelen değişiklikleri başka bir DataTable nesnemize almamızdır. Bu DataTable nesnesinin verileride ikinci DataGrid kontrol&amp;uuml;m&amp;uuml;zde g&amp;ouml;r&amp;uuml;nt&amp;uuml;lenecektir. Ancak kullanıcı, DataTable'da meydana gelen bu değişiklikleri DataTable nesnesinin AcceptChanges metodunu kullanarak onayladığında, GetChanges geriye boş bir DataTable nesne referansı d&amp;ouml;nd&amp;uuml;recektir. Yani değişiklikleri, AcceptChanges metodu &amp;ccedil;ağırılıncaya kadar elde edebiliriz. &amp;Ouml;ncelikle aşağıdaki Formu tasarlayalım.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk48_1.gif" alt="" width="633" height="350" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;span style="font-style: italic; font-family: Verdana;"&gt;Şekil 1. Form Tasarımımız.&lt;/span&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şimdide program kodlarımızı oluşturalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection conNorthwind; /*Sql sunucumuza yapıcağımız bağlantıyı sağlıyacak SqlConnection nesnemizi tanımlıyoruz.*/

SqlDataAdapter daPersonel; /* Personel tablosundaki verileri, dtPersonel tablosuna y&amp;uuml;klemek i&amp;ccedil;in SqlDataAdapter nesnemizi tanımlıyoruz.*/

DataTable dtPersonel; /* Personel tablosundaki verilerin bellek g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; referans edicek DataTable nesnemizi tanımlıyoruz.*/

DataTable dtDegisiklikler; /* dtPersonel, DataTable nesnesi i&amp;ccedil;in AcceptChanges metodu uygulanana kadar meydana gelen değişikliklerin k&amp;uuml;mesini referans edicek DataTable nesnemizi tanımlıyoruz.*/

/* Kullanıcı bu butona bastığında, Sql sunucumuzdaki Personel tablosunun t&amp;uuml;m satıları, dtPersonel DataTable nesnesinin bellekte işaret ettiği alana y&amp;uuml;klenecek ve bu veriler DataGrid kontrol&amp;uuml;ne bağlanacak.*/

private void btnYukle_Click(object sender, System.EventArgs e)
{
     conNorthwind=new SqlConnection("data source=localhost;initial catalog=Northwind;integrated security=sspi");

     daPersonel=new SqlDataAdapter("Select * From Personel",conNorthwind);

     dtPersonel=new DataTable();
     daPersonel.Fill(dtPersonel);
     dgVeriler.DataSource=dtPersonel;
}

private void btnOnayla_Click(object sender, System.EventArgs e)
{
     dtPersonel.AcceptChanges(); /* dtPersonel tablosunda meydana gelen değişiklikleri onaylıyoruz.*/
}

private void btnDegisiklikler_Click(object sender, System.EventArgs e)
{
     dtDegisiklikler=new DataTable();
     dtDegisiklikler=dtPersonel.GetChanges(); /* GetChanges metodu ile dtPersonel DataTable nesnesinin işaret ettiği bellek b&amp;ouml;lgesinde yer alan veri k&amp;uuml;mesinde meydana gelen değişiklileri, dtDegisiklikler DataTable nesnesinin bellekte referans ettiği b&amp;ouml;lgeye alıyoruz. */
     dgDegisiklikler.DataSource=dtDegisiklikler; 
     /* Bu değişiklikleri DataGrid kontrol&amp;uuml;nde g&amp;ouml;steriyoruz. */
}&lt;/pre&gt;
&lt;p align="left"&gt;Şimdi programımızı &amp;ccedil;alıştıralım ve tablomuzdaki veriler &amp;uuml;zerinde değişiklik yapalım. &amp;Ouml;rneğin yeni bir satır girelim ve bir satır &amp;uuml;zerinde de değişiklik yapalım.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk48_2.gif" alt="" width="620" height="332" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;span style="font-style: italic; font-family: Verdana;"&gt;Şekil 2. Yeni bir satır ekleyip bir satır &amp;uuml;zerinde değişiklik yaptık.&lt;/span&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şimdi Değişiklikleri Al başlıklı butona tıkladığımızda, GetChanges metodu devreye girecek ve yaptığımız bu değişikliklerin meydana geldiği satırlar aşağıdaki gibi , dtDegisiklikler DataTable nesnesini bağladığımız DataGrid kontrol&amp;uuml;nde g&amp;ouml;r&amp;uuml;necek.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk48_3.gif" alt="" width="632" height="350" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;span style="font-style: italic; font-family: Verdana;"&gt;Şekil 3. Yapılan Değişikliklerin G&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;Şimdi bu noktadan sonra, dtDegisiklikler isimli DataTable nesnesi &amp;uuml;zerinden, SqlDataAdapter nesnesini Update metodunu kullanmak daha akıllıca bir yaklaşım olucaktır. Diğer yandan, GetChanges metodunun bu kullanımı, DataTable(DataSet) de meydana gelen her t&amp;uuml;r değişikliği almaktadır. Ancak dilersek, sadece yeni eklenen kayıtları ya da sadece değişiklik yapılan kayıtlarıda elde edebiliriz. Bunu ger&amp;ccedil;ekleştirmek i&amp;ccedil;in, GetChanges metodunun DataRowState numaralandırıcısı t&amp;uuml;r&amp;uuml;nden parametre aldığı versiyonunu kullanırız. Bu parametre her bir satırın yani DataRow nesnesinin durumunu belirtmektedir ve alabileceği değerler aşağıdaki tabloda verilmiştir.&lt;/p&gt;
&lt;div&gt;
&lt;table class="dtTABLE" style="width: 640px; height: 191px;" border="1" cellspacing="0" cellpadding="2"&gt;
&lt;tbody&gt;
&lt;tr valign="top"&gt;
&lt;th style="border-style: solid; border-width: 1;" width="179" height="36"&gt;DataRowState Değeri&lt;/th&gt;
&lt;th style="border-style: solid; border-width: 1;" width="525" height="36"&gt;A&amp;ccedil;ıklama&lt;/th&gt;
&lt;/tr&gt;
&lt;tr valign="top"&gt;
&lt;td style="border-style: solid; border-width: 1;" width="179" height="40"&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Added&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;td style="border-style: solid; border-width: 1;" width="525" height="40"&gt;
&lt;blockquote&gt;
&lt;p&gt;DataRowCollection koleksiyonuna yeni bir satır yani DataRow eklenmiş ve AcceptChanges metodu hen&amp;uuml;z &amp;ccedil;ağırılmamıştır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr valign="top"&gt;
&lt;td style="border-style: solid; border-width: 1;" width="179" height="21"&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Deleted&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;td style="border-style: solid; border-width: 1;" width="525" height="21"&gt;
&lt;blockquote&gt;
&lt;p&gt;Delete metodu ile bir satır silinmiştir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr valign="top"&gt;
&lt;td style="border-style: solid; border-width: 1;" width="179" height="40"&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Detached&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;td style="border-style: solid; border-width: 1;" width="525" height="40"&gt;
&lt;blockquote&gt;
&lt;p&gt;Yeni bir satır, DataRowCollection i&amp;ccedil;in oluşturulmuş ancak hen&amp;uuml;z Add metodu ile bu koleksiyona dolayısıyla DataTable'a eklenmemiştir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr valign="top"&gt;
&lt;td style="border-style: solid; border-width: 1;" width="179" height="21"&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Modified&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;td style="border-style: solid; border-width: 1;" width="525" height="21"&gt;
&lt;blockquote&gt;
&lt;p&gt;Satırda değişiklikler yapılmış ve hen&amp;uuml;z AcceptChanges metodu &amp;ccedil;ağırılmamıştır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr valign="top"&gt;
&lt;td style="border-style: solid; border-width: 1;" width="179" height="21"&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Unchanged&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;td style="border-style: solid; border-width: 1;" width="525" height="21"&gt;
&lt;blockquote&gt;
&lt;p&gt;Son AcceptChanges &amp;ccedil;ağrısından bu yana, satırda herhangibir değişiklik olmamıştır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p align="left"&gt;&lt;span style="font-style: italic;"&gt;Tablo 1. DataRowState Numaralandırıcısının Değerleri&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;Şimdi GetChanges metodunun, DataRowState numaralandırıcısı kullanılarak nasıl &amp;ccedil;alıştığını incelemeye &amp;ccedil;alışalım. Bunun i&amp;ccedil;in aşağıdaki &amp;ouml;rnek formu tasarlayalım. Bu kez programımızda, değişiklik olan satırları alıcak ve bunların durumlarınıda g&amp;ouml;sterecek bir uygulama oluşturacağız.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk48_4.gif" alt="" width="629" height="388" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;span style="font-style: italic; font-family: Verdana;"&gt;Şekil 4. Yeni Formumuz.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;Formumuza bir ComboBox ekledik. Kullanıcı bu ComboBox'tan DataRowState değerini se&amp;ccedil;icek ve GetChanges metodumuz buna g&amp;ouml;re &amp;ccedil;alışacak. ComboBox'ımızın &amp;ouml;ğeleri ise şunlar olucak;&lt;/p&gt;
&lt;p align="left"&gt;&lt;span style="font-style: italic; font-family: Verdana;"&gt; &lt;img src="/makale/images/mk48_5.gif" alt="" width="223" height="93" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;span style="font-style: italic; font-family: Verdana;"&gt;Şekil 5. ComboBox &amp;ouml;ğelerimiz.&lt;/span&gt;&lt;/p&gt;
&lt;p align="left"&gt;Uygulamamıza sadece, Duruma G&amp;ouml;re Değişiklikleri Al başlıklı butonumuzun kodlarını ekleyeceğiz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btDurumaGoreDegisiklikler_Click(object sender, System.EventArgs e)
{
     dtDegisiklikler=new DataTable();
     if(cmbRowState.SelectedIndex==0)
     {          dtDegisiklikler=dtPersonel.GetChanges(DataRowState.Detached); /* Yeni a&amp;ccedil;ılan ancak hen&amp;uuml;z DataRowCollection'a eklenmeyen satırlar.*/

          dgDegisiklikler.DataSource=dtDegisiklikler;
     }
     else if(cmbRowState.SelectedIndex==1)
     {          dtDegisiklikler=dtPersonel.GetChanges(DataRowState.Added); /* DataRowCollection'a yeni eklenen satırlar.*/
          dgDegisiklikler.DataSource=dtDegisiklikler;
     }
     else if(cmbRowState.SelectedIndex==2)
     {          dtDegisiklikler=dtPersonel.GetChanges(DataRowState.Deleted); /* DataTable'dan silinen satırlar.*/
          dgDegisiklikler.DataSource=dtDegisiklikler;
     }
     else if(cmbRowState.SelectedIndex==3)
     {          dtDegisiklikler=dtPersonel.GetChanges(DataRowState.Modified); /* Değişikliğe uğrayan satırlar. */
          dgDegisiklikler.DataSource=dtDegisiklikler;
     }
     else if(cmbRowState.SelectedIndex==4)
     {          dtDegisiklikler=dtPersonel.GetChanges(DataRowState.Unchanged); /* Son AcceptChanges'den sonra değişikliğe uğramamış satırlar.*/
          dgDegisiklikler.DataSource=dtDegisiklikler;
}&lt;/pre&gt;
&lt;p align="left"&gt;Şimdi uygulamamızı &amp;ccedil;alıştıralım ve deneyelim. Tablomuzda yine birtakım değişiklikler yapalım. &amp;Ouml;rneğin satırlar ekleyelim, satırları g&amp;uuml;ncelleyelim (Satır eklemek ve satır g&amp;uuml;ncellemek en &amp;ccedil;ok yaptığımız işlemlerdir dikkat ederseniz). Sonrada ComboBox kontrol&amp;uuml;m&amp;uuml;zden istediğimiz durumu se&amp;ccedil;ip elde ettiğimiz sonucu g&amp;ouml;relim. &amp;Ouml;rneğin ben yeni bir satır ekledim ve bir satır &amp;uuml;zerinde değişiklik yaptım. Daha sonra sadece yeni eklenen satırları g&amp;ouml;rmek i&amp;ccedil;in ComboBox kontrol&amp;uuml;nde Yeni Ekelenen Satılar(Added) se&amp;ccedil;eneğini se&amp;ccedil;ip d&amp;uuml;ğmeye bastım. Bu durumda if koşumuz durumu değerlendirir ve GetChanges metodunu DataRowState.Added parametresi ile uygular. Sonu&amp;ccedil; olarak, değişiklik yaptığım satır g&amp;ouml;r&amp;uuml;nmez sadece yeni eklenen satır dtDegisiklikler tablosuna alınır.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk48_6.gif" alt="" width="634" height="386" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;span style="font-style: italic; font-family: Verdana;"&gt;Şekil 6. DataRowState.Added Sonrası.&lt;/span&gt;&lt;/p&gt;
&lt;p align="left"&gt;Bu noktadan sonra artık bir veri tablosunu g&amp;uuml;ncellerken, GetChanges yaklaşımını kullanarak, &amp;ouml;rneğin sadece yeni eklenen satırların veri kaynağına g&amp;ouml;nderilmesini sağlamış oluruz. Buda bize daha hızlı ve rahat bir ağ trafiği sağlayacaktır. Bu durum &amp;ouml;zellikle web servisleri i&amp;ccedil;in &amp;ccedil;ok idealdir. Uzak sunuculardan ilgili verileri bilgisayarına bağlantısız olarak işlemek i&amp;ccedil;in alan bir istemci uygulama, veri k&amp;uuml;mesinin tamamını geri g&amp;ouml;ndermek yerine, sadece yeni eklenen veya g&amp;uuml;ncellenen satırları temsil eden bir veri k&amp;uuml;mesini(dataTable veya DataSet) geri g&amp;ouml;ndererek sınırlı internet kapasitesi i&amp;ccedil;in en uygun başarımı elde edebilir.&amp;nbsp;Geldik bir makalemizin daha sonuna. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-01-29 12:00:00</pubDate>
  <slug>Tablo-Degisikliklerini-GetChanges-ile-Izlemek-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>datatable</tag>
    <tag>get-changes</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>