<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>NoSQL Maceraları - Graph Database DEX</title>
  <description>Sparsity firmasının bir ürünü olan DEX, Community kullanımında 1milyon nesneye(Objects) kadar ücretsiz olarak yararlanılabilen bir veritabanı sunmaktadır. Veritabanının en önemli özelliği ise içeriği nesnel olarak Graph teorisine göre tutuyor olmasıdır. (Graph teorisi hakkında Wikipedia bağlantısından özet bir bilgi alabilirsiniz)</description>
  <content>&lt;p&gt;&lt;a href="/pics/dex_7.png"&gt;&lt;img style="margin: 4px 0px; display: inline; float: right;" title="dex_7" src="/pics/dex_7_thumb.png" alt="dex_7" width="225" height="240" align="right" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Eminim pek &amp;ccedil;oğunuzun hastası/fanatiği olduğu yerli veya yabancı diziler vardır. K&amp;uuml;&amp;ccedil;&amp;uuml;k bir &amp;ccedil;ocukken &amp;ccedil;izgi filmlere olan d&amp;uuml;şk&amp;uuml;nl&amp;uuml;ğ&amp;uuml;m&amp;uuml;z kadar olmasa da, hemen her b&amp;ouml;l&amp;uuml;m&amp;uuml;n&amp;uuml; heyecanla beklediklerimiz mutlaka vardır&lt;em&gt;(Hatta &amp;uuml;lkemizde ge&amp;ccedil; yayınlanıyor diye ilgili dizileri internetten indirenlerimizde vardır)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bilişim alanında g&amp;ouml;rev alanların ağırlıkla &lt;strong&gt;CNBC-E&lt;/strong&gt; gibi kanallarda yer alan dizilere olan bağımlılığı da aslında su g&amp;ouml;t&amp;uuml;rmez bir ger&amp;ccedil;ektir. &amp;Ouml;rneğin benim fanatiği olduğum dizilerden birisi &lt;strong&gt;Dexter&lt;/strong&gt; ve ne tesad&amp;uuml;ft&amp;uuml;r ki bu g&amp;uuml;n yazımızda ele alacağımız &amp;uuml;r&amp;uuml;n&amp;uuml;n adı da onun lakabı ile eş: &lt;strong&gt;DEX &lt;img class="wlEmoticon wlEmoticon-laughingoutloud" style="border-style: none;" src="/pics/wlEmoticon-laughingoutloud_4.png" alt="Laughing out loud" /&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Daha &amp;ouml;nceden hatırlayacağınız &amp;uuml;zere şuradaki makalede &lt;a href="/post/Apache-Cassandra-ve-Net" target="_blank"&gt;Apache Cassandra&lt;/a&gt;&amp;rsquo; yı, oradaki makalede ise &lt;a href="/post/RavenDB-ile-Hello-World" target="_blank"&gt;RavedDB&lt;/a&gt;&amp;rsquo; yi incelemeye &amp;ccedil;alışmıştık. Bu yazımızda ise yine &lt;strong&gt;NoSQL&lt;/strong&gt; veritabanı &amp;ccedil;eşitlerinden birisi olup &lt;strong&gt;Graph&lt;/strong&gt; teorisini baz alan &lt;strong&gt;DEX&lt;/strong&gt; isimli &amp;uuml;r&amp;uuml;n&amp;uuml; incelemeye &amp;ccedil;alışıyor olacağız.&lt;/p&gt;
&lt;p&gt;&lt;a href="http://www.sparsity-technologies.com/dex" target="_blank"&gt;Sparsity firmasının bir &amp;uuml;r&amp;uuml;n&amp;uuml; olan DEX&lt;/a&gt;, &lt;strong&gt;Community&lt;/strong&gt; kullanımında 1milyon nesneye&lt;em&gt;(Objects)&lt;/em&gt; kadar &amp;uuml;cretsiz olarak yararlanılabilen bir veritabanı sunmaktadır. Veritabanının en &amp;ouml;nemli &amp;ouml;zelliği ise i&amp;ccedil;eriği nesnel olarak &lt;strong&gt;Graph&lt;/strong&gt; teorisine g&amp;ouml;re tutuyor olmasıdır. &lt;em&gt;(&lt;/em&gt;&lt;a href="http://en.wikipedia.org/wiki/Graph_theory" target="_blank"&gt;&lt;em&gt;Graph teorisi hakkında Wikipedia&lt;/em&gt;&lt;/a&gt;&lt;em&gt; bağlantısından &amp;ouml;zet bir bilgi alabilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Kısaca &amp;ouml;zetlemek gerekirse &lt;strong&gt;Graph&lt;/strong&gt; veritabanlarında &lt;strong&gt;Node, Attribute&lt;/strong&gt; ve &lt;strong&gt;Edge&lt;/strong&gt; adı verilen nesneler s&amp;ouml;z konusudur. Her bir &lt;strong&gt;Node&lt;/strong&gt; ve &lt;strong&gt;Edge &lt;/strong&gt;nesnesinin &lt;strong&gt;attribute&lt;/strong&gt;&amp;rsquo; lar ile tanımlanabilen &amp;ouml;zellikleri mevcuttur. &lt;strong&gt;Graph&lt;/strong&gt; veritabanlarında, &lt;strong&gt;node&amp;rsquo;&lt;/strong&gt; lar arası ilişkiler &lt;strong&gt;Edge&lt;/strong&gt; &amp;ouml;rnekleri ile tanımlanmaktadır.&lt;strong&gt; Facebook, Twitter, Linkedin&lt;/strong&gt; gibi pop&amp;uuml;ler sosyal ağların veri ambarlarının tasarlanması noktasında son derece isabetli bir se&amp;ccedil;imdir. Nitekim &lt;strong&gt;node&lt;/strong&gt;&amp;rsquo; lar arası en kısa yolu bulmak veya ilişkileri ortaya &amp;ccedil;ıkarmak, &lt;strong&gt;Graph&lt;/strong&gt; teorisi nedeniyle olduk&amp;ccedil;a kolay, tutarlı ve hızlıdır. Bu sebepten sadece sosyal ağlar da değil &lt;strong&gt;IMDB, Wikipedia &lt;/strong&gt;tarzı oluşumlarda, &lt;strong&gt;Lojistik, Telekom ağları &lt;/strong&gt;gibi daha end&amp;uuml;st&amp;uuml;riyel &amp;ccedil;&amp;ouml;z&amp;uuml;mlerde de değerlendirilebilmektedir. &lt;em&gt;(Aslına bakarsanız Graph teorisini uygulayabileceğiniz ne kadar veri bazlı &amp;ccedil;&amp;ouml;z&amp;uuml;m var ise DEX gibi sistemleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabilrsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;DEX&lt;/strong&gt; veritabanı &lt;strong&gt;C++&lt;/strong&gt; ile yazılmıştır. &lt;strong&gt;Java, .Net, C++, Blueprints Interface API&lt;/strong&gt; desteği bulunmaktadır. Dolayısıyla pek &amp;ccedil;ok farklı platform tarafından da kullanılabilir bir &amp;uuml;r&amp;uuml;nd&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;Şimdi dilerseniz fazla vakit kaybetmeden basit bir &lt;strong&gt;Hello World&lt;/strong&gt; uygulaması geliştirmeye &amp;ccedil;alışalım. Tabi ilk olarak bir senaryoyu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almamız gerekiyor. Senaryomuza ait basit &lt;strong&gt;Graph&lt;/strong&gt; &amp;ccedil;izimimiz aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/dex_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="dex_1" src="/pics/dex_1_thumb.png" alt="dex_1" width="635" height="609" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bu şekli biraz inceleyelim &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_170.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;p&gt;Basketbol oyuncuları, takım ko&amp;ccedil;ları ve takımların yer aldığı bir şema g&amp;ouml;rmekteyiz. Ayrıca bu karakterlerin bazı &amp;ouml;zellikleri de bulunmaktadır. &amp;Ouml;rneğin &lt;strong&gt;isimler&lt;/strong&gt;, &lt;strong&gt;&amp;uuml;lkeler&lt;/strong&gt; ve benzersiz olmalarını sağlayan sayısal numaralar gibi. Ayrıca bu karakterler arasında belirli bir y&amp;ouml;ne doğru &amp;ccedil;izilmiş ilişkiler olduğu g&amp;ouml;r&amp;uuml;lmektedir. T&amp;uuml;m bunları birleştirdiğimizde şekle bakarak aşağıdaki c&amp;uuml;mleleri ve benzerlerini sarf edebilmekteyiz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Simone Pianigiani ko&amp;ccedil; olarak Fenerbah&amp;ccedil;e &amp;Uuml;lker&amp;rsquo; i y&amp;ouml;netmekte olup Montepaschi Siena&amp;rsquo; yı da &amp;ouml;nceki bir d&amp;ouml;nemde &amp;ccedil;alıştırmıştır.&lt;/li&gt;
&lt;li&gt;Gasper Vidmar şu anda Beşiktaş takımında oynamakta olup daha &amp;ouml;nceden Fenerbah&amp;ccedil;e &amp;Uuml;lker&amp;rsquo; de de oynamıştır.&lt;/li&gt;
&lt;li&gt;Semih Erden şu anda Beşiktaş takımında oynamakta olup, daha &amp;ouml;nceden de Fenerbah&amp;ccedil;e &amp;Uuml;lker formasını giymiştir.&lt;/li&gt;
&lt;li&gt;Amerikalı Power Forward Marcus Goree, daha &amp;ouml;nceden Erman Kunter&amp;rsquo; in &amp;ccedil;alıştırdığı Fransız Cholet basketbol takımının formasını giymektedir.&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;Ouml;rnekler &amp;ccedil;oğaltılabilir. Aslında Facebook&amp;rsquo; de yer alan arkadaşlarınızı, dahil olduğunuz grupları, bu teori ışığında kağıda d&amp;ouml;kmeyi deneyerek kendi &amp;ouml;rneğiniz &amp;uuml;zerinden de ilerleyebilirsiniz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Peki bu c&amp;uuml;mleleri, bir başka deyişle şekilde g&amp;ouml;r&amp;uuml;len &lt;strong&gt;Graph&lt;/strong&gt; unsurlarını bilgisayar ortamında nasıl saklayabiliriz? &lt;img class="wlEmoticon wlEmoticon-idontknowsmile" style="border-style: none;" src="/pics/wlEmoticon-idontknowsmile_1.png" alt="I don't know smile" /&gt; Bu ama&amp;ccedil;la indirdiğimiz &lt;strong&gt;DEX&lt;/strong&gt; &amp;uuml;r&amp;uuml;n&amp;uuml;n&amp;uuml; kullanıyor olacağız. Ağız alışkanlığı nedeniyle bir veritabanı olarak tanımladığımız &lt;strong&gt;DEX&lt;/strong&gt; aslında aşağıda şekilde g&amp;ouml;r&amp;uuml;len bir &lt;strong&gt;ka&amp;ccedil;&lt;/strong&gt; &lt;strong&gt;DLL&lt;/strong&gt; ile birlikte gelmektedir. Yani daha &amp;ouml;nceden incelediğimiz &lt;strong&gt;RavenDb&lt;/strong&gt; gibi bir &lt;strong&gt;Server&lt;/strong&gt; uygulamasına veya aray&amp;uuml;ze sahip değildir. Yine de kavramsal olarak tuttuğu i&amp;ccedil;erik bir veri k&amp;uuml;mesini ifade etmektedir. Daha &amp;ccedil;ok bir &lt;strong&gt;API&lt;/strong&gt; olduğunu ifade edebiliriz. Veriyi disk &amp;uuml;zerinde bir dosya şeklinde tutmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/dex_2.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="dex_2" src="/pics/dex_2_thumb.png" alt="dex_2" width="264" height="234" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Dexnet.dll&lt;/strong&gt; bizim kullanacağımız &lt;strong&gt;Wrapper&amp;rsquo;&lt;/strong&gt; dır. Yani projeye referans etmemiz gereken &lt;strong&gt;Assembly&lt;/strong&gt;&amp;rsquo; dır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/dex_3.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="dex_3" src="/pics/dex_3_thumb.png" alt="dex_3" width="265" height="327" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Ancak bu yeterli değildir. Diğer &lt;strong&gt;dll&lt;/strong&gt; dosyalarının, &lt;strong&gt;Dexnet.dll&lt;/strong&gt; ve uygulamaya ait &lt;strong&gt;exe&lt;/strong&gt; dosyası ile aynı klas&amp;ouml;r altında bulundurulmaları gerekmektedir. Yani &lt;strong&gt;dex.dll, dexnetwrap.dll&lt;/strong&gt; ve&lt;strong&gt; stlport.dll&lt;/strong&gt; dosyalarının da &lt;strong&gt;exe&lt;/strong&gt; &amp;ccedil;ıktısının olduğu klas&amp;ouml;re kopyalanması gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/dex_4.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="dex_4" src="/pics/dex_4_thumb.png" alt="dex_4" width="267" height="251" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bu işlem yapılmadığı takdirde &amp;ccedil;alışma zamanında&lt;strong&gt; Platform Invoke&lt;/strong&gt; ile ilişkili bir &lt;strong&gt;istisna&lt;em&gt;(Exception)&lt;/em&gt;&lt;/strong&gt; alınacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/dex_5.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="dex_5" src="/pics/dex_5_thumb.png" alt="dex_5" width="561" height="144" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bu hazırlıkların ardından &amp;ouml;rnek kodlarımızı yazmaya başlayabiliriz. Ben uygulamayı bir &lt;strong&gt;Console&lt;/strong&gt; projesi olarak geliştireceğim ve sadece ilk kullanımlarını g&amp;ouml;stermeye &amp;ccedil;alışacağım. Bir ger&amp;ccedil;ek hayat senaryosunda &lt;strong&gt;şema&lt;em&gt;(Schema)&lt;/em&gt;&lt;/strong&gt; oluşturulması gibi adımların tek seferde yapılmasını garanti etmeye &amp;ccedil;alışmalısınız. Hatta şemaların kolayca yapılmasını sağlamak amacıyla ayrı bir arabirim dahi geliştirilebilir&lt;em&gt;(SQL Server Management Studio tarzı bir şey olmasa da işe yarar bir aray&amp;uuml;z pekala &amp;ccedil;ok isabetli bir tercih olabilir)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak veritabanını ve &lt;strong&gt;Graph&lt;/strong&gt; nesnelerine ait şemaları tanımlayacağımız kodları yazarak işe başlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Database database = null; 
DexConfig cfg = new DexConfig(); 
cfg.SetLogFile("Azon.log"); 
cfg.SetCacheMaxSize(1024); 
//cfg.SetLicense("lisans numarası"); 
Dex dexter = new Dex(cfg); 
database = dexter.Create("AzonGraphDb.dex", "Azon");&lt;/pre&gt;
&lt;p&gt;Yukarıdaki kod par&amp;ccedil;asında bir veritabanının oluşturulma adımları &amp;ouml;rneklenmektedir. &amp;Ouml;nemli olan noktalardan birisi &lt;strong&gt;Dex&lt;/strong&gt; tipini &amp;ouml;rneklerken bazı konfigurasyon ayarları i&amp;ccedil;in &lt;strong&gt;DexConfig&lt;/strong&gt; sınıfından yararlanılmasıdır. &amp;Ouml;rneğin &amp;uuml;r&amp;uuml;n&amp;uuml;n lisanslı olan bir s&amp;uuml;r&amp;uuml;m&amp;uuml; alınırsa bunun &lt;strong&gt;SetLicence&lt;/strong&gt; metodu ile bildirilmesi gerekecektir. Veritabanı nesne &amp;ouml;rneği oluşturulduktan sonra &lt;strong&gt;Node, Attribute&lt;/strong&gt; ve &lt;strong&gt;Edge&lt;/strong&gt; tanımlalarını yaparak şemayı da oluşturabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Session session= database.NewSession(); 
Graph g = session.GetGraph();

#endregion

#region Schema' nın Oluşturulması

int teamType = g.NewNodeType("Takim"); 
int teamIdType = g.NewAttribute(teamType, "TakimId", DataType.Long, AttributeKind.Unique); 
int teamNameType = g.NewAttribute(teamType, "Ad", DataType.String, AttributeKind.Indexed); 
int teamCountryType = g.NewAttribute(teamType, "Ulke", DataType.String, AttributeKind.Indexed);

int staffType = g.NewNodeType("Eleman"); 
int staffIdType = g.NewAttribute(staffType, "ElemanId", DataType.Long, AttributeKind.Unique); 
int staffNameType = g.NewAttribute(staffType, "Ad", DataType.String, AttributeKind.Indexed); 
int staffTitleType = g.NewAttribute(staffType, "Unvan", DataType.String, AttributeKind.Indexed); 
int staffCountryType = g.NewAttribute(staffType, "Ulke", DataType.String, AttributeKind.Indexed);

#endregion Schema' nın Oluşturulması

#region Edge Tanımlamaları

// Bu senaryoda sadece Directed Edge kullanılmıştır. Normalde hem Tail hem de Head rol&amp;uuml; &amp;uuml;stlenen bir node s&amp;ouml;z konusu ise UnDirected Edge kullanılması gerekir. 
// Directed Edge' ler de bir Tail' den Head' e doğru giden bir ilişki ifade edilir

int roleType = g.NewEdgeType("Rol", false, false); 
int roleTitleType = g.NewAttribute(roleType, "Title", DataType.String, AttributeKind.Basic);

#endregion Edge Tanımlamaları&lt;/pre&gt;
&lt;p&gt;Şema oluşturma işlemlerinde olayın kahramanı &lt;strong&gt;Graph&lt;/strong&gt; tipinden olan nesne &amp;ouml;rneğidir. Bir &lt;strong&gt;Graph&lt;/strong&gt; nesnesini &amp;ouml;rneklemek i&amp;ccedil;in veritabanına ait oturumdan yararlanılmalıdır. Bu sebepten bir &lt;strong&gt;Session&lt;/strong&gt; &amp;ouml;rneği oluşturulmuştur. &lt;strong&gt;Session&lt;/strong&gt; a&amp;ccedil;ık olduğu s&amp;uuml;re zarfında &lt;strong&gt;Graph&lt;/strong&gt; &amp;ouml;rneği &amp;uuml;zerinden yapılan t&amp;uuml;m işlemler&lt;em&gt;(şema oluşturma, veri ekleme, g&amp;uuml;ncelleme vb)&lt;/em&gt; bu oturuma ait olacak şekilde ger&amp;ccedil;ekleşecektir.&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere takımlar ve oyuncular ile antren&amp;ouml;rleri ifade eden elemanlar i&amp;ccedil;in birer &lt;strong&gt;Node&lt;/strong&gt; &amp;uuml;retilmiştir. Her &lt;strong&gt;Node&amp;rsquo;&lt;/strong&gt; un kendine has bir takım nitelikleri vardır. &amp;Ouml;rneğin her elemanın bir adı, uyruğu ve &amp;uuml;nvanı gibi. Bir &lt;strong&gt;Node&lt;/strong&gt; &amp;uuml;retilirken bir veri tipinin belirtildiğine ve &lt;strong&gt;AttributeKind&lt;/strong&gt; ile şekillendirildiğine de dikkat edelim. &lt;strong&gt;Indexed&lt;/strong&gt; olarak işaretlenenler sorgulanabilir olduklarını g&amp;ouml;stermektedir. &lt;strong&gt;Unique&lt;/strong&gt;, tahmin edileceği &amp;uuml;zere ilgili niteliğin değerinin benzersiz olmasını sağlamaktadır. Hatta &lt;strong&gt;ElemanId&lt;/strong&gt; ve &lt;strong&gt;TakimId&lt;/strong&gt; bu anlamda &lt;strong&gt;Primary&lt;/strong&gt; &lt;strong&gt;Key&lt;/strong&gt; olmuşlardır. &lt;strong&gt;AttributeKind&lt;/strong&gt; ile belirtilebilecek bir diğer değer de &lt;strong&gt;Basic&lt;/strong&gt;&amp;rsquo; tir. &lt;strong&gt;Basic&lt;/strong&gt; tipindeki nitelikler sorgulamalarda&lt;em&gt;(Query)&lt;/em&gt; &lt;span style="text-decoration: underline;"&gt;kullanılamazlar&lt;/span&gt;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Node&lt;/strong&gt; tanımlalarının ardından dikkat edileceği &amp;uuml;zere bir &lt;strong&gt;Edge&lt;/strong&gt; &amp;ouml;rneği de &amp;uuml;retilmiş ve bu kendisine bir nitelik de eklenmiştir. Bir tane &lt;strong&gt;Edge&lt;/strong&gt; şu andaki senaryomuz i&amp;ccedil;in yeterlidir. Bu &lt;strong&gt;Edge&amp;rsquo;&lt;/strong&gt; in ilgili niteliğinden yararlanarak&lt;strong&gt; Oynuyor, Oynadı, Y&amp;ouml;netti, Y&amp;ouml;netiyor&lt;/strong&gt; şeklindeki ilişkileri tesis edebiliriz. Pek tabiki bir ger&amp;ccedil;ek hayat senaryosunda bu tip sabit değerleri bir &lt;strong&gt;Enum&lt;/strong&gt; tipi i&amp;ccedil;erisinde toplamak daha doğru bir yaklaşım olabilir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;DEX&lt;/strong&gt;, &lt;strong&gt;Edge&lt;/strong&gt; tanımlamalarını iki şekilde değerlendirmektedir. &lt;strong&gt;Directed&lt;/strong&gt; ve &lt;strong&gt;Undirected&lt;/strong&gt;. &lt;strong&gt;Directed&lt;/strong&gt; ilişkisinde bir kaynak &lt;strong&gt;Node&lt;/strong&gt;&lt;em&gt;(Tail olarak adlandırılmakta) &lt;/em&gt;ve bir de hedef &lt;strong&gt;Node&lt;/strong&gt; vardır&lt;em&gt;(Head olarak adlandırılmaktadır)&lt;/em&gt;. &lt;strong&gt;Undirected&lt;/strong&gt; ilişkilerde de ise &lt;strong&gt;Node&lt;/strong&gt;' lar hem &lt;strong&gt;Tail&lt;/strong&gt; hem de &lt;strong&gt;Head&lt;/strong&gt; rol&amp;uuml;ndedir. &amp;Ouml;rneğimizde &lt;strong&gt;Undirected&lt;/strong&gt; ilişki senaryosu ele alınmamıştır. Ancak &lt;strong&gt;DEX&lt;/strong&gt;&amp;rsquo; e ait teknik d&amp;ouml;k&amp;uuml;mantasyonda &amp;ouml;rnek bir kullanımı mevcuttur.&lt;/p&gt;
&lt;p&gt;Artık şema tanımlamalarımızı yaptığımıza g&amp;ouml;re &amp;ouml;rnek verilerin eklenmesi işlemini ger&amp;ccedil;ekleştirebiliriz. Yapacağımız veri eklemeleri ile temel hedefimiz &lt;strong&gt;Graph&lt;/strong&gt; g&amp;ouml;rselindeki ilişkileri ve değerleri &amp;uuml;retmektir. İşte kodlarımız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;#region &amp;Ouml;rnek Veri Eklenmesi

Value value = new Value();

long marcusGoree = g.NewNode(staffType); 
g.SetAttribute(marcusGoree, staffIdType, value.SetLong(1)); 
g.SetAttribute(marcusGoree, staffNameType, value.SetString("Marcus Goree")); 
g.SetAttribute(marcusGoree, staffTitleType, value.SetString("Power Forward")); 
g.SetAttribute(marcusGoree, staffCountryType, value.SetString("USA"));

long rudyGobert = g.NewNode(staffType); 
g.SetAttribute(rudyGobert, staffIdType, value.SetLong(2)); 
g.SetAttribute(rudyGobert, staffNameType, value.SetString("Rudy Gobert")); 
g.SetAttribute(rudyGobert, staffTitleType, value.SetString("Power Forward")); 
g.SetAttribute(rudyGobert, staffCountryType, value.SetString("FR"));

long gasperVidmar = g.NewNode(staffType); 
g.SetAttribute(gasperVidmar, staffIdType, value.SetLong(3)); 
g.SetAttribute(gasperVidmar, staffNameType, value.SetString("Gasper Vidmar")); 
g.SetAttribute(gasperVidmar, staffTitleType, value.SetString("Center")); 
g.SetAttribute(gasperVidmar, staffCountryType, value.SetString("SL"));

long semihErden = g.NewNode(staffType); 
g.SetAttribute(semihErden, staffIdType, value.SetLong(4)); 
g.SetAttribute(semihErden, staffNameType, value.SetString("Semih Erden")); 
g.SetAttribute(semihErden, staffTitleType, value.SetString("Center")); 
g.SetAttribute(semihErden, staffCountryType, value.SetString("TR"));

long oguzSavas = g.NewNode(staffType); 
g.SetAttribute(oguzSavas, staffIdType, value.SetLong(5)); 
g.SetAttribute(oguzSavas, staffNameType, value.SetString("Oğuz Savaş")); 
g.SetAttribute(oguzSavas, staffTitleType, value.SetString("Center")); 
g.SetAttribute(oguzSavas, staffCountryType, value.SetString("TR"));

long simonePianigiani = g.NewNode(staffType); 
g.SetAttribute(simonePianigiani, staffIdType, value.SetLong(6)); 
g.SetAttribute(simonePianigiani, staffNameType, value.SetString("Simone Pianigiani")); 
g.SetAttribute(simonePianigiani, staffTitleType, value.SetString("Coach")); 
g.SetAttribute(simonePianigiani, staffCountryType, value.SetString("IT"));

long ermanKunter = g.NewNode(staffType); 
g.SetAttribute(simonePianigiani, staffIdType, value.SetLong(7)); 
g.SetAttribute(simonePianigiani, staffNameType, value.SetString("Erman Kunter")); 
g.SetAttribute(simonePianigiani, staffTitleType, value.SetString("Coach")); 
g.SetAttribute(simonePianigiani, staffCountryType, value.SetString("IT"));

long besiktas = g.NewNode(teamType); 
g.SetAttribute(besiktas, teamIdType, value.SetLong(8)); 
g.SetAttribute(besiktas, teamNameType, value.SetString("Beşiktaş")); 
g.SetAttribute(besiktas, teamCountryType, value.SetString("TR"));

long cholet = g.NewNode(teamType); 
g.SetAttribute(cholet, teamIdType, value.SetLong(9)); 
g.SetAttribute(cholet, teamNameType, value.SetString("Cholet")); 
g.SetAttribute(cholet, teamCountryType, value.SetString("FR"));

long fenerbahceUlker = g.NewNode(teamType); 
g.SetAttribute(fenerbahceUlker, teamIdType, value.SetLong(10)); 
g.SetAttribute(fenerbahceUlker, teamNameType, value.SetString("Fenerbah&amp;ccedil;e &amp;Uuml;lker")); 
g.SetAttribute(fenerbahceUlker, teamCountryType, value.SetString("TR"));

long montepaschiSiena = g.NewNode(teamType); 
g.SetAttribute(montepaschiSiena, teamIdType, value.SetLong(11)); 
g.SetAttribute(montepaschiSiena, teamNameType, value.SetString("Montepaschi Siena")); 
g.SetAttribute(montepaschiSiena, teamCountryType, value.SetString("IT"));

long edge; 
edge = g.NewEdge(roleType,marcusGoree,cholet); 
g.SetAttribute(edge, roleTitleType, value.SetString("Oynuyor"));

edge = g.NewEdge(roleType, rudyGobert, cholet); 
g.SetAttribute(edge, roleTitleType, value.SetString("Oynuyor"));

edge = g.NewEdge(roleType, ermanKunter, cholet); 
g.SetAttribute(edge, roleTitleType, value.SetString("Y&amp;ouml;netti"));

edge = g.NewEdge(roleType, ermanKunter, besiktas); 
g.SetAttribute(edge, roleTitleType, value.SetString("Y&amp;ouml;netiyor"));

edge = g.NewEdge(roleType, gasperVidmar, besiktas); 
g.SetAttribute(edge, roleTitleType, value.SetString("Oynuyor"));

edge = g.NewEdge(roleType, gasperVidmar, fenerbahceUlker); 
g.SetAttribute(edge, roleTitleType, value.SetString("Oynadı"));

edge = g.NewEdge(roleType, semihErden, besiktas); 
g.SetAttribute(edge, roleTitleType, value.SetString("Oynuyor"));

edge = g.NewEdge(roleType, semihErden, fenerbahceUlker); 
g.SetAttribute(edge, roleTitleType, value.SetString("Oynadı"));

edge = g.NewEdge(roleType, oguzSavas, fenerbahceUlker); 
g.SetAttribute(edge, roleTitleType, value.SetString("Oynuyor"));

edge = g.NewEdge(roleType, simonePianigiani, fenerbahceUlker); 
g.SetAttribute(edge, roleTitleType, value.SetString("Y&amp;ouml;netiyor"));

edge = g.NewEdge(roleType, simonePianigiani, montepaschiSiena); 
g.SetAttribute(edge, roleTitleType, value.SetString("Y&amp;ouml;netti"));

#endregion &amp;Ouml;rnek Veri Eklenmesi&lt;/pre&gt;
&lt;p&gt;Kod satırlarının uzun g&amp;ouml;r&amp;uuml;nmesine aldırış etmeyin. Temel olarak icar ettirdiğimiz iki fonksiyonel akış s&amp;ouml;z konusudur. &lt;strong&gt;Node&lt;/strong&gt; ve &lt;strong&gt;Edge&lt;/strong&gt; oluşturmak. Bir &lt;strong&gt;Node&lt;/strong&gt; &amp;uuml;retilirken hangi tipten olduğu belirtilir. Ardından elde edilen nesne &amp;ouml;rneği i&amp;ccedil;in s&amp;ouml;z konusu tipin i&amp;ccedil;erisinde tanımlanan &lt;strong&gt;niteliklere&lt;/strong&gt;&lt;em&gt;(Attribute)&lt;/em&gt; değer atamaları ger&amp;ccedil;ekleştirilir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Edge&lt;/strong&gt; &amp;ouml;rnekleri oluşturulurken de ilk olarak &lt;strong&gt;Edge&lt;/strong&gt; tipi belirtilmektedir. Tip belirtildikten sonra ise yine &lt;strong&gt;Node&lt;/strong&gt; oluşturulmasına benzer olacak şekilde nitelik değerlerinin verilmesi s&amp;ouml;z konusudur. Her iki kullanımda da değerlerin atanması i&amp;ccedil;in &lt;strong&gt;Value&lt;/strong&gt; tipinden ve ilgili &lt;strong&gt;Set&lt;/strong&gt; fonksiyonundan yararlanılmaktadır. &amp;Ouml;rneğin &lt;strong&gt;long&lt;/strong&gt; tipinden olan &lt;strong&gt;ElemanId&lt;/strong&gt; i&amp;ccedil;in &lt;strong&gt;value&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt;SetLong&lt;/strong&gt; metodundan yararlanılırken, &lt;strong&gt;string&lt;/strong&gt; tipte olan takım adları i&amp;ccedil;in &lt;strong&gt;SetString&lt;/strong&gt; fonksiyonu kullanılmaktadır. Tanımlanan her &lt;strong&gt;Edge&lt;/strong&gt; ile &lt;strong&gt;Graph&lt;/strong&gt; g&amp;ouml;rselinde yer alan ilişkilerin tanımlandığına dikkat edilmelidir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Siz tabiki makaleyi okuyup kullanım tekniklerini &amp;ouml;ğrendikten sonra ş&amp;ouml;yle g&amp;uuml;zel janjanlı &lt;strong&gt;WPF/Asp.Net&lt;/strong&gt; ekranları hazırlayarak bu işi daha zevkli hale getirebilirsiniz &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_170.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Veri ekleme işlemlerini tamamladığımıza g&amp;ouml;re basit bir arama işlemi ile devam edebiliriz. &amp;Ouml;rneğin &lt;strong&gt;Semih Erden&lt;/strong&gt;&amp;rsquo; in bağlı olduğu boğumları bulalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Objects trace = g.Neighbors(semihErden, roleType, EdgesDirection.Outgoing);

ObjectsIterator iterator = trace.Iterator();

Value nameValue = new Value(); 
Value countryValue = new Value(); 
Console.WriteLine("Semih Erden bağlantıları\n");

while (iterator.HasNext()) 
{ 
    long objectId = iterator.Next(); 
   g.GetAttribute(objectId, teamNameType, nameValue); 
    g.GetAttribute(objectId, teamCountryType, countryValue);

    Console.WriteLine("Takım {0}, &amp;Uuml;lke {1}", 
        nameValue.GetString(), 
        countryValue.GetString()); 
}&lt;/pre&gt;
&lt;p&gt;Yine &lt;strong&gt;Graph&lt;/strong&gt; nesne &amp;ouml;rneğinden yararlanılmaktadır. İlk olarak &lt;strong&gt;Neighbors&lt;/strong&gt; metodu ile &lt;strong&gt;semihErden&lt;/strong&gt; &amp;ouml;rneğinin &lt;strong&gt;roleType&lt;/strong&gt;&amp;rsquo; a g&amp;ouml;re dışarıya doğru olan komşularına gidilmektedir. &lt;strong&gt;roleType&lt;/strong&gt; bildiğiniz &amp;uuml;zere bir &lt;strong&gt;Edge&lt;/strong&gt; &amp;ouml;rneğidir. Tabi &lt;strong&gt;n sayıda sonu&amp;ccedil; d&amp;ouml;nebileceğinden&lt;/strong&gt; ileri y&amp;ouml;nl&amp;uuml; bir iterasyona ihtiya&amp;ccedil; vardır. Bu sebepten &lt;strong&gt;ObjectsIterator&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneklenmiş ve &lt;strong&gt;while&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml;ne başvurulmuştur. &lt;strong&gt;HasNext&amp;rsquo;&lt;/strong&gt; in &lt;strong&gt;true&lt;/strong&gt; d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml; s&amp;uuml;rece devam eden d&amp;ouml;ng&amp;uuml; i&amp;ccedil;erisinde ise &lt;strong&gt;GetAttribute&lt;/strong&gt; metodundan yararlanılarak elde edilen &lt;strong&gt;Node&lt;/strong&gt;&amp;rsquo; un bazı değerleri okunmaktadır. Takım adı ve bulunduğu &amp;uuml;lke.&lt;/p&gt;
&lt;p&gt;Peki iki &lt;strong&gt;Node&lt;/strong&gt; arasındaki &lt;strong&gt;Edge&lt;/strong&gt; &amp;ouml;rneğini nasıl yakalayabiliriz? &lt;img class="wlEmoticon wlEmoticon-whome" style="border-style: none;" src="/pics/wlEmoticon-whome_4.png" alt="Who me?" /&gt; Bunun i&amp;ccedil;in &amp;ouml;rnek bir kullanım aşağıdaki kod par&amp;ccedil;asında g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;#region Edge değeri okumak

Value roleTitleValue = new Value();

Console.WriteLine("\n&amp;Ccedil;eşitli Edge değerleri\n");

long edgeId=g.FindEdge(roleType, semihErden, besiktas);            
g.GetAttribute(edgeId, roleTitleType, roleTitleValue); 
Console.WriteLine("Semih Erden - ({0}) -&amp;gt; Beşiktaş",roleTitleValue );

edgeId = g.FindEdge(roleType, simonePianigiani, montepaschiSiena); 
g.GetAttribute(edgeId, roleTitleType, roleTitleValue); 
Console.WriteLine("Simone Pianigiani - ({0}) -&amp;gt; Montepaschi Siena", roleTitleValue);

edgeId = g.FindEdge(roleType, oguzSavas, fenerbahceUlker); 
g.GetAttribute(edgeId, roleTitleType, roleTitleValue); 
Console.WriteLine("Oguz Savas - ({0}) -&amp;gt; Fenerbah&amp;ccedil;e &amp;Uuml;lker", roleTitleValue);

#endregion Edge değeri okumak&lt;/pre&gt;
&lt;p&gt;İlk sorguda, &lt;strong&gt;FindEdge&lt;/strong&gt; metodu ile &lt;strong&gt;semihErden&lt;/strong&gt; ve &lt;strong&gt;besiktas&lt;/strong&gt; isimli &lt;strong&gt;Node&lt;/strong&gt; &amp;ouml;rnekleri arasında yer alan &lt;strong&gt;roleType&lt;/strong&gt; tipinden olan &lt;strong&gt;Edge&lt;/strong&gt; &amp;ouml;rneğinin nesne numarası alınmaktadır. Bu nesne numarası &lt;strong&gt;GetAttribute&lt;/strong&gt; metodunda kullanılır ve &lt;strong&gt;roleTitleType&lt;/strong&gt; tipinden olan niteliğin taşıdığı değer yakalanır. Bu senaryo takip eden sorgulamalarda &lt;strong&gt;simonePianigiani&lt;/strong&gt; ve &lt;strong&gt;montepaschiSiena&lt;/strong&gt; ile &lt;strong&gt;oguzSavas&lt;/strong&gt; ve &lt;strong&gt;fenerbahceUlker&lt;/strong&gt; i&amp;ccedil;in de yapılmıştır.&lt;/p&gt;
&lt;p&gt;Yapılan t&amp;uuml;m bu işlemler sonrasında ise &lt;strong&gt;Database, Graph, Objects&lt;/strong&gt; ve &lt;strong&gt;ObjectsIterator&lt;/strong&gt; gibi nesne &amp;ouml;rneklerinin kapatılması gerekmektedir. Yani bu nesne &amp;ouml;rneklerine ait &lt;strong&gt;Close&lt;/strong&gt; metodlarına &amp;ccedil;ağrıda bulunulmalıdır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;iterator.Close(); 
trace.Close(); 
session.Close();            
database.Close();&lt;/pre&gt;
&lt;p&gt;Uygulamanın &amp;ccedil;alışma zamanı &amp;ccedil;ıktısına baktığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;lar ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/dex_6.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="dex_6" src="/pics/dex_6_thumb.png" alt="dex_6" width="588" height="187" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;Graph&lt;/strong&gt; teorisine bağlı kalaraktan, &lt;strong&gt;DEX API&lt;/strong&gt;&amp;rsquo; sinden de yararlanarak t&amp;uuml;m &lt;strong&gt;Euroelague&lt;/strong&gt; takımları ve oyuncuları i&amp;ccedil;in&lt;em&gt;(hatta bunların i&amp;ccedil;erisine başka nesneleri de katabiliriz) &lt;/em&gt;kocaman bir veri i&amp;ccedil;eriğini oluşturmamız m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Tabi b&amp;ouml;yle bir i&amp;ccedil;erik kuvvetle muhtemel &lt;strong&gt;1milyon&lt;/strong&gt; nesneyi aşabilir ve dolayısıyla lisans satın alınması gerekebilir. DEX gibi başka pek &amp;ccedil;ok &lt;strong&gt;Graph&lt;/strong&gt; veritabanı mevcuttur. &amp;Ouml;rneğin &lt;strong&gt;Trinity, BigData&lt;/strong&gt; vb&amp;hellip;Bunları da fırsatım olursa incelemeye &amp;ccedil;alışıyor olacağım. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_170.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2012%2f12%2fHowTo_DEX.zip"&gt;HowTo_DEX.zip (785,18 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2013-02-20 04:00:00</pubDate>
  <slug>Graph-Database-DEX</slug>
  <tags>
    <tag>graph-database</tag>
    <tag>nosql</tag>
    <tag>dex</tag>
    <tag>graph</tag>
    <tag>edge</tag>
    <tag>node</tag>
    <tag>attribute</tag>
    <tag>data</tag>
    <tag>social-networking</tag>
    <tag>dexter</tag>
    <tag>sparsity</tag>
  </tags>
  <categories>
    <category>NoSQL</category>
  </categories>
</post>