<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Front-End Service Geliştirmek</title>
  <description>Windows Communication Foundation(WCF) mimarisinde belkide en kritik unsurlardan birisi EndPoint kavramıdır. EndPoint, Servis Yönelimli Mimari(Service Oriented Architecture - SOA) uygulamaları geliştirmek için kullanılan WCF modelinde, istemciler(Clients) ile servis(Service) arasındaki haberleşmede yer alan kritik bir parçadır. WCF' in temellerini incelediğimiz daha önceki yazılarımızda, EndPoint kavramının aslında WCF mimarisinin ABC' si olduğundan bahsetmiştik. ABC bilindiği üzere adres(Address), bağlayıcı(Binding) ve sözleşme(Contract) bilgilerinden oluşmaktadır. Buna göre bir EndPoint yardımıyla, servisin istemcilere hangi adresten, hangi protokolle, hangi kurallara göre neyi sunacağı bilgisi aktarılabilir. Bununla birlikte, EndPoint' ler istemci tarafından gelecek olan taleplerin karşılanmasında da büyük öneme sahiptir.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Windows Communication Foundation(WCF)&lt;/strong&gt; mimarisinde belkide en kritik unsurlardan birisi &lt;strong&gt; EndPoint&lt;/strong&gt; kavramıdır. EndPoint, &lt;strong&gt;Servis Y&amp;ouml;nelimli Mimari(Service Oriented Architecture - SOA)&lt;/strong&gt; uygulamaları geliştirmek i&amp;ccedil;in kullanılan WCF modelinde, istemciler(Clients) ile servis(Service) arasındaki haberleşmede yer alan kritik bir par&amp;ccedil;adır. WCF' in temellerini incelediğimiz daha &amp;ouml;nceki yazılarımızda, EndPoint kavramının aslında WCF mimarisinin &lt;strong&gt;ABC&lt;/strong&gt;' si olduğundan bahsetmiştik. ABC bilindiği &amp;uuml;zere &lt;strong&gt;adres(Address), bağlayıcı(Binding)&lt;/strong&gt; ve &lt;strong&gt; s&amp;ouml;zleşme(Contract)&lt;/strong&gt; bilgilerinden oluşmaktadır. Buna g&amp;ouml;re bir EndPoint yardımıyla, servisin istemcilere hangi adresten, hangi protokolle, hangi kurallara g&amp;ouml;re neyi sunacağı bilgisi aktarılabilir. Bununla birlikte, EndPoint' ler istemci tarafından gelecek olan taleplerin karşılanmasında da b&amp;uuml;y&amp;uuml;k &amp;ouml;neme sahiptir.&lt;/p&gt;
&lt;p&gt;Bir WCF servisi, kendi &amp;uuml;zerinde birden fazla &lt;strong&gt;EndPoint&lt;/strong&gt; bilgisi taşıyabilir. &amp;Uuml;stelik bu EndPoint' ler aynı &lt;strong&gt;s&amp;ouml;zleşme(Contract)&lt;/strong&gt; veya farklı s&amp;ouml;zleşmeler(Contract) i&amp;ccedil;inde tanımlanmış olabilirler. Bu noktada WCF servisi aldığı mesajı hangi EndPoint bileşenine ileteceğinede karar vermektedir. &amp;Ccedil;ok doğal olarak geliştiriciler bu karar aşamasına m&amp;uuml;dahale edebilir ve EndPoint y&amp;ouml;nlendirmelerini programlayabilirler. İşte bu da &lt;strong&gt;Front-End Service&lt;/strong&gt; adı verilen WCF servislerinin geliştirilebilmesine neden olmaktadır ki makalemizin konusuda budur. Bazı durumlarda bir WCF servisi, istemcilerden(Clients) gelecek olan mesajları asıl servislere y&amp;ouml;nlendirmek i&amp;ccedil;in kullanılabilir. Aşağıdaki şekilde bu durum analiz edilmeye &amp;ccedil;alışılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk240_1.gif" alt="" width="477" height="288" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu grafiğe g&amp;ouml;re istemcilerin &lt;strong&gt; talepleri(Requests) Front-End Service&lt;/strong&gt; tarafından karşılanmakta, sonrasında ise bu talepler(Request) ilgili olan asıl WCF servislerine y&amp;ouml;nlendirilmektedir. Hatta y&amp;ouml;nlendirme işlemi Front-End Service' in arkasında duran asıl WCF servisi i&amp;ccedil;erisindeki farklı EndPoint noktalarına doğruda olabilir. Bu tarz bir y&amp;ouml;nlendirme i&amp;ccedil;in pek &amp;ccedil;ok sebep vardır. &amp;Ouml;zellikle istemcilerin kullanmak istedikleri servislere doğrudan erişemediği durumlar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. &amp;Ouml;rneğin arka tarafta duran WCF servisleri ile i&lt;strong&gt;stemciler(Clients) &lt;/strong&gt;farklı ve birbirlerini g&amp;ouml;remeye &lt;strong&gt;ağlarda(Network)&lt;/strong&gt; bulunabilirler. Diğer yandan, &lt;strong&gt; Front-End Service&lt;/strong&gt;' lerin bazı avantajlarıda vardır. &amp;Ouml;rneğin &lt;strong&gt;y&amp;uuml;k dengelemesini (Load Balancing) &lt;/strong&gt;daha iyi yapabilirler. Bu performans ve dengeli y&amp;ouml;netim a&amp;ccedil;ısından &amp;ouml;nemli bir unsurdur.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Load Balancing modelinde, Front-End Service genellikle istemcilere(Clients) tek bir adres &amp;uuml;zerinden hizmet vermektedir. İstemcilerden gelen talepler arka servislere eşit şekilde dağıtılmaktadır. Bir başka deyişle istemciler hep aynı adrese talepte bulunurlarken, Front-End Service arka tarafta duran farklı port numaralarına sahip EndPoint noktalarına y&amp;uuml;k&amp;uuml; eşit şekilde yaymaktadır. Bu sayede arka tarafta daha dengeli &amp;ccedil;alışan bir servis topluluğu tasarlanması m&amp;uuml;mk&amp;uuml;n olmaktadır.Tabi bunun i&amp;ccedil;in yazılan Front-End Service i&amp;ccedil;erisinde &amp;ouml;zel kodlama yapılması gerekmektedir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Ayrıca, k&amp;ouml;t&amp;uuml; niyetli mesajların sızmasının engellemesi i&amp;ccedil;inde tek bir merkez olarak kullanılabilirler. Elbetteki arka tarafta y&amp;ouml;nlendirilme yapılacak servis ve EndPoint sayısı &amp;ccedil;ok fazla olabileceğinden Front-End Service y&amp;ouml;netimi biraz daha zordur.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Front-End WCF Service' ler istemciden gelen talepleri(Request) değerlendirerek uygun olan ger&amp;ccedil;ek arka WCF Service' lerine y&amp;ouml;nlendirirler.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Front-End Service' ler &amp;ccedil;oğunlukla iki ana kategoride ele alınmaktadır. &lt;strong&gt;Adres tabanlı y&amp;ouml;nlendirme(Address-Based Routing)&lt;/strong&gt; yapanlar ve &lt;strong&gt;i&amp;ccedil;erik tabanlı y&amp;ouml;nlendirme(Content-Based Routing)&lt;/strong&gt; yapanlar. Adres tabanlı y&amp;ouml;nlendirme sisteminde, istemcilerin hangi EndPoint noktalarına talep (Request) g&amp;ouml;nderdikleri &amp;ouml;nemlidir. Ancak i&amp;ccedil;erik tabanlı y&amp;ouml;nlendirme sisteminde istemcilerin talep olarak g&amp;ouml;nderikleri mesaj i&amp;ccedil;eriklerine bakılır. Mesaj i&amp;ccedil;eriklerinden &amp;ouml;rneğin kullanıcıya ait &lt;strong&gt;kimlik bilgileri(Identity Informations)&lt;/strong&gt;, &lt;strong&gt;transaction id &lt;/strong&gt;değerleri vs... elde edilebilir. Bunların durumuna g&amp;ouml;re uygun olan WCF servislerine y&amp;ouml;nlendirme işlevini &lt;strong&gt;Front-End Service&lt;/strong&gt; &amp;uuml;stlenir. &amp;Ouml;rneğin bir servise talepte bulunan kullanıcıların iki farklı profilde olduklarını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. Aşağıdaki şekilde bu durum g&amp;ouml;sterilmeye &amp;ccedil;alışılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk240_2.gif" alt="" width="509" height="286" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada &amp;ouml;zel kullanıcılar taleplerine hizmet alırlarken, Front-End Service tarafından daha hızlı bir sistem &amp;uuml;zerinde konuşlandırılmış bir WCF servisine y&amp;ouml;nlendirilmektedirler. Diğer taraftan normal kullanıcılar i&amp;ccedil;in bu tip bir y&amp;ouml;nlendirme daha farklı yapılmaktadır. İşte bu tam anlamıyla Front-End Service' e gelen kullanıcıların &lt;strong&gt;kimlikleri(Identity)&lt;/strong&gt; ile alakalıdır ve &lt;strong&gt;i&amp;ccedil;erik tabanlı y&amp;ouml;nlendirme(Content Based Routing)&lt;/strong&gt; sisteminin bir &amp;ouml;rneğidir. Nitekim kimlik bilgileri &amp;ccedil;oğunlukla mesaj i&amp;ccedil;eriklerinden elde edilebilmektedir.&lt;/p&gt;
&lt;p&gt;WCF mimarisi i&amp;ccedil;erisinde &lt;strong&gt;Front-End Service&lt;/strong&gt;' lerin nasıl yazılacağını incelemeden &amp;ouml;nce, bir WCF servisinin gelen mesajları kabaca nasıl ele aldığını anlamakta yarar vardır. &amp;Ouml;zellikle kod tarafında gelen taleplerin ele alınmasında &amp;ouml;nemli rol oynayan &lt;strong&gt;CLR Tipleri(Common Language Runtime Types) &lt;/strong&gt; bulunmaktadır. Herşeyden &amp;ouml;nce &lt;strong&gt;WCF &amp;ccedil;alışma zamanı motoru(WCF Runtime Engine)&lt;/strong&gt; gelen talepleri değerlendirmek i&amp;ccedil;in &lt;strong&gt;kanal yığınlarını(Channel Stacks) &lt;/strong&gt;kullanmaktadır. Bu kanal yığınları &lt;strong&gt; ChannelDispatcher&lt;/strong&gt; ve &lt;strong&gt;EndPointDispatcher&lt;/strong&gt; adı verilen tiplere ait nesne &amp;ouml;rnekleri ile sıkı bir ilişkidedir. En basit anlamda &lt;strong&gt; ChannelDispatcher&lt;/strong&gt; nesne &amp;ouml;rnekleri, gelen taleplerin doğru &lt;strong&gt; EndPointDispatcher&lt;/strong&gt; bileşenlerine aktarılmasından sorumludur. Bu anlamda bir ChannelDispatcher nesnesi, birden fazla EndPointDispatcher bileşenini ele alabilmektedir. &lt;strong&gt;EndPointDispatcher&lt;/strong&gt; nesnesleri, gelen mesajları &amp;ccedil;&amp;ouml;z&amp;uuml;mlemek ve servis i&amp;ccedil;erisindeki uygun yerlere iletmekten sorumludur. EndPointDispatcher nesneleri &amp;ccedil;oğunlukla servis i&amp;ccedil;erisinden talepte bulunulan fonksiyonelliğe ait metod &amp;ccedil;ağrılarını ger&amp;ccedil;ekleştirmektedir. Bu son derece basit ve y&amp;uuml;zeysel bir bakış a&amp;ccedil;ısıdır. Nitekim bu işlemler sırasında &amp;ccedil;ok sayıda ek yardımcı &lt;strong&gt; CLR(Common Language Runtime)&lt;/strong&gt; nesneside devreye girmektedir. Aslında &amp;ccedil;alışma zamanındaki durum az &amp;ccedil;ok aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk240_3.gif" alt="" width="402" height="459" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi istemcilerden EndPoint noktalarına doğru gelen mesajlar &lt;strong&gt;kanal yığınları(Channel Stack)&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;ChannelDispatcher&lt;/strong&gt; nesne &amp;ouml;rneklerine ulaşmaktadır. Sonrasında ise talepler(Requests) uygun olan EndPointDispatcher bileşenleri tarafından ele alınmaktadır. Bu noktada dikkat edilmesi gereken bir husus vardır. Gelen mesaj herhangibir EndPointDispatcher tarafından karşılanmassa &lt;strong&gt;ServiceHost&lt;/strong&gt; nesnesinin &lt;strong&gt; UnknownMessageReceived&lt;/strong&gt; olayı tetiklenir. &amp;Ccedil;ok doğal olarak bu olayın kontrol&amp;uuml; geliştirici(Developer) tarafından yapılabilir.&lt;/p&gt;
&lt;p&gt;Front-End Service' ler i&amp;ccedil;erisinde, &lt;strong&gt; istemciden(Clients)&lt;/strong&gt; gelen talepler ger&amp;ccedil;ek WCF servislerine y&amp;ouml;nlendirilmeden &amp;ouml;nce pek &amp;ccedil;ok işlemde ger&amp;ccedil;ekleştirilebilmektedir. &amp;Ouml;rneğin kimlik doğrulama yada arka servislere parametre aktarma gibi işlemler s&amp;ouml;z konusu olabilir. Diğer yandan &lt;strong&gt;Front-End Service&lt;/strong&gt;' lerin tasarlanması sırasında dikkat edilmesi gereken bazı noktalar vardır. Y&amp;ouml;nlendirici servisin, hedef servis s&amp;ouml;zleşmelerini uyguluyor olma zorunluluğu nedeni ile y&amp;ouml;netilebilirlik zorlaşmaktadır. Buna bağlı olarak &lt;strong&gt;serileştirilebilir(Serializable) &lt;/strong&gt;verilere ait s&amp;ouml;zleşmelerinde y&amp;ouml;nlendirici servis tarafından bilinme zorunluluğu s&amp;ouml;z konusudurki bu da y&amp;ouml;netilebilirliği(Management) zorlaştırmaktadır.&lt;/p&gt;
&lt;p&gt;Bu kısa bilgilerden sonra adım adım bir &lt;strong&gt;Front-End WCF&lt;/strong&gt; Servisinin nasıl oluşturulacağı incelenmeye başlanabilir. &amp;Ouml;ncelikli olarak iki adet servis geliştirilecek ve bu servisler birer &lt;strong&gt;EndPoint&lt;/strong&gt; noktası barındıracak şekilde tasarlanacaktır. Bu noktada Front-End Service, gelen &lt;strong&gt; talepleri(Request)&lt;/strong&gt; doğrudan arka taraftaki uygun servis ve EndPoint noktalarına y&amp;ouml;nlendirmekle g&amp;ouml;revli olacaktır. Senaryo kabaca aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk240_4.gif" alt="" width="563" height="459" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Y&amp;ouml;nlendirme işlemlerini kolay bir şekilde anlayabilmek i&amp;ccedil;in basit olarak &lt;strong&gt;BasicHttpBinding&lt;/strong&gt; &lt;strong&gt; bağlayıcı tipinden(Binding Type)&lt;/strong&gt; yararlanılmaktadır. &lt;strong&gt;Back-End&lt;/strong&gt; servisler iki adettir ve her biri farklı &lt;strong&gt;port&lt;/strong&gt; numaraları &amp;uuml;zerinden &lt;strong&gt;HTTP&lt;/strong&gt; bazlı olacak şekilde yayınlama yapmaktadır. Her iki &lt;strong&gt;Back-End Service&lt;/strong&gt; uygulamasıda &lt;strong&gt;Console&lt;/strong&gt; olacak şekilde tasarlanmaktadır. Elbetteki ger&amp;ccedil;ek hayat senaryolarında bu servisler &lt;strong&gt; IIS(Internet Information Service)&lt;/strong&gt; &amp;uuml;zerinden yada bir &lt;strong&gt;Windows&lt;/strong&gt; &lt;strong&gt;Servisi&lt;/strong&gt; i&amp;ccedil;erisinde g&amp;ouml;m&amp;uuml;l&amp;uuml; olacak şekildede &amp;ccedil;alışabilirler. Şu durumda her iki istemcide bu farklı &lt;strong&gt;HTTP&lt;/strong&gt; servislerine talepte bulunmaktadır. Bizim amacımız bir &lt;strong&gt;Front-End Service &lt;/strong&gt;yazmak ve &amp;uuml;zerinden&lt;strong&gt; Load-Balancing &lt;/strong&gt;yaparak istemcilerden gelecek olan talep y&amp;uuml;k&amp;uuml;n&amp;uuml; servislere eşit şekilde dağıtmaya &amp;ccedil;alışmaktır. Front-End Service geliştirilmeye başlamadan &amp;ouml;nce ilk olarak &lt;strong&gt;servis s&amp;ouml;zleşmesinin(Service Contract)&lt;/strong&gt; yer aldığı &lt;strong&gt;WCF sınıf k&amp;uuml;t&amp;uuml;phanesini(WCF Service Library)&lt;/strong&gt; tasarlayarak işe başlanmalıdır. Bu k&amp;uuml;t&amp;uuml;phanenin i&amp;ccedil;eriği konunun anlaşılır olması a&amp;ccedil;ısından m&amp;uuml;mk&amp;uuml;n olduğu kadar basit tutulmuştur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk240_5.gif" alt="" width="194" height="290" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;ICebir &lt;strong&gt;aray&amp;uuml;z&amp;uuml;ne(Interface)&lt;/strong&gt; ait kod i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[ServiceContract]
public interface ICebir
{
    [OperationContract]
    int Topla(int x, int y);
}&lt;/pre&gt;
&lt;p&gt;Cebir &lt;strong&gt;sınıfına(Class)&lt;/strong&gt; ait kod i&amp;ccedil;eriği ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[ServiceBehavior(InstanceContextMode= InstanceContextMode.PerCall)]
public class Cebir : ICebir
{
    #region ICebir Members

    public int Topla(int x, int y)
    {
        return x + y;
    }

    #endregion
}&lt;/pre&gt;
&lt;p&gt;Bu işlemin ardından &lt;strong&gt;Back-End&lt;/strong&gt; &lt;strong&gt; Service&lt;/strong&gt;' lerin tasarlanmasına başlanabilir. Her iki serviste &lt;strong&gt; Console&lt;/strong&gt; uygulaması &amp;uuml;zerinden &lt;strong&gt;host&lt;/strong&gt; edilmektedir. Aralarındaki tek fark yayınlama adreslerindeki &lt;strong&gt;port&lt;/strong&gt; numaralarının farklı olmasıdır. Sembolik olarak bu port numaraları 50001 ve 50002 olarak set edilmektedir. S&amp;ouml;z konusu Console uygulamaları &amp;ccedil;ok doğal olarak MatematikLib isimli &lt;strong&gt;WCF servis k&amp;uuml;t&amp;uuml;phanesini(WCF Service Library) &lt;/strong&gt; ve &lt;strong&gt;System&lt;/strong&gt;.&lt;strong&gt;ServiceModel&lt;/strong&gt;.&lt;strong&gt;dll&lt;/strong&gt; &lt;strong&gt;assembly&lt;/strong&gt;' ını referans etmelidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk240_9.gif" alt="" width="237" height="495" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bununla birlikte konfigurasyon dosyasının&lt;strong&gt;(App.config)&lt;/strong&gt; i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;behaviors&amp;gt;
            &amp;lt;serviceBehaviors&amp;gt;
                &amp;lt;behavior name="CebirServiceBehavior"&amp;gt;
                    &amp;lt;serviceDebug includeExceptionDetailInFaults="true" /&amp;gt;
                &amp;lt;/behavior&amp;gt;
            &amp;lt;/serviceBehaviors&amp;gt;
        &amp;lt;/behaviors&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service behaviorConfiguration="CebirServiceBehavior" name="MatematikLib.Cebir"&amp;gt;
                &amp;lt;endpoint address="http://localhost:50001/Matematik/Cebir.svc" binding="basicHttpBinding" bindingConfiguration="" name="HttpEndPoint" contract="MatematikLib.ICebir" /&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;EndPoint&lt;/strong&gt; tanımlamaları &lt;strong&gt; BasicHttpBinding&lt;/strong&gt; bağlayıcı tipini kullanmaktadır. Bununla birlikte her iki serviste aynı &lt;strong&gt;WCF&lt;/strong&gt; s&amp;ouml;zleşmesini(ICebir) sunmaktadır. Yukarıdaki konfigurasyon dosyasının sahibi olan sunucu uygulama &lt;strong&gt;HTTP&lt;/strong&gt; protokol&amp;uuml;ne g&amp;ouml;re &lt;strong&gt;50001&lt;/strong&gt; numaralı port &amp;uuml;zerinden yayınlama yaparken diğer &lt;strong&gt;Console&lt;/strong&gt; uygulamasıda &lt;strong&gt;50002&lt;/strong&gt; numaralı port &amp;uuml;zerinden hizmet vermek &amp;uuml;zere ayarlanmıştır. &amp;Ouml;zellikle ger&amp;ccedil;ek hayat vakalarında, aynı servis i&amp;ccedil;erisinde yer alan birden fazla farklı &lt;strong&gt;EndPoint&lt;/strong&gt; tanımlaması da s&amp;ouml;z konusu olabilir. Yada bu farklı tipteki &lt;strong&gt;EndPoint&lt;/strong&gt; bileşenleri farklı servisler &amp;uuml;zerine yayılmış olabilir. Servis uygulamalarına ait kod i&amp;ccedil;erikleri aşağıdaki gibi tasarlanabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using MatematikLib;

namespace BackEndService1
{
    class Program
    {
        static void Main(string[] args)
        {
            ServiceHost host = new ServiceHost(typeof(Cebir));
            host.Open();
            Console.WriteLine("Host dinlemede\nKapatmak i&amp;ccedil;in bir tuşa basınız");
            Console.ReadLine();
            host.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Standart olarak servis uygulaması, &lt;strong&gt; Cebir&lt;/strong&gt; tipi &amp;uuml;zerinden bir &lt;strong&gt;ServiceHost&lt;/strong&gt; nesnesi &amp;ouml;rneklemekte ve &lt;strong&gt;Open&lt;/strong&gt; metodu ile hizmete başlamaktadır. Uygulama kapatılırkende &lt;strong&gt; Close&lt;/strong&gt; metodu yardımıyla hizmet sonlandırılmaktadır. Bu basit servisleri kullanacak olan istemcilerde birer &lt;strong&gt;Console&lt;/strong&gt; uygulaması olarak tasarlanabilirler. S&amp;ouml;z konusu istemci uygulamalar i&amp;ccedil;in gerekli &lt;strong&gt; proxy&lt;/strong&gt; sınıflarının elbette &amp;uuml;retilmesi şarttır. Bu ama&amp;ccedil;la &lt;strong&gt;svcutil&lt;/strong&gt; aracı kullanılarak aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi istemciler i&amp;ccedil;in gerekli proxy sınıfları &amp;uuml;retilebilir. &lt;em&gt;(HTTP &amp;uuml;zerinden yayınlama yapılmasına rağmen servis uygulamaları IIS &amp;uuml;zerinden host edilmediklerinden Visual Studio IDE' si i&amp;ccedil;erisinde Add Service Reference se&amp;ccedil;eneği kullanılamamaktadır. Bu nedenle svcutil aracından yardım alınmaktadır.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk240_10.gif" alt="" width="638" height="544" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemlerin ardından ilgili &lt;strong&gt;proxy&lt;/strong&gt; sınıfı ve konfigurasyon dosyası istemci uygulamalara eklenmelidir. İstemci uygulamalar i&amp;ccedil;in oluşturuluan&lt;strong&gt; output.config&lt;/strong&gt; dosyasının i&amp;ccedil;eriği biraz daha sadeleştirilerek aşağıdaki hale getirilebilir. Bu &amp;ouml;rnekte &lt;strong&gt;IIS&lt;/strong&gt; &amp;uuml;zerinden bir hosting yapılmadığından konfigurasyon dosyasında yer alan &lt;strong&gt;EndPoint&lt;/strong&gt; elementi i&amp;ccedil;erisine &lt;strong&gt;address&lt;/strong&gt; &lt;strong&gt; niteliği(Attribute)&lt;/strong&gt; atılmayacaktır. Bu nedenle adres bilgisininde a&amp;ccedil;ık bir şekilde girilmesi şarttır. &lt;em&gt;(Bununla birlikte Output.config adının App.config olarak değiştirilmesi &amp;ouml;nerilir)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8"?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;client&amp;gt;
            &amp;lt;endpoint binding="basicHttpBinding" address="http://localhost:50001/Matematik/Cebir.svc" contract="ICebir" name="CebirClientEndPoint" /&amp;gt;
        &amp;lt;/client&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;İstemci uygulamanın kod i&amp;ccedil;eriği aşağıdaki gibi tasarlanabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace HttpClient1
{
    class Program
    {
        static void Main(string[] args)
        {
            CebirClient client = new CebirClient();
            double toplam=client.Topla(4, 5);
            Console.WriteLine(toplam.ToString());
            Console.WriteLine("&amp;Ccedil;ıkmak i&amp;ccedil;in bir tuşa basınız.");
            Console.ReadLine();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İkinci istemci uygulamada aynı t&amp;uuml;rden olmakla birlikte sadece &lt;strong&gt;50002&lt;/strong&gt; numaralı &lt;strong&gt;port&lt;/strong&gt; adresi &amp;uuml;zerinden talepte bulunacak şekilde ayarlanmalıdır. B&amp;ouml;ylece elimizde hazır bir sistem mevcuttur. Artık &lt;strong&gt;Front-End Service&lt;/strong&gt;' in yazılmasına başlanabilir. &lt;strong&gt;Front-End Service&lt;/strong&gt; uygulamasıda aslında bir servis uygulaması olduğundan kendi i&amp;ccedil;erisinden istemcilere bir&lt;strong&gt; s&amp;ouml;zleşme(Contract)&lt;/strong&gt; sunmak durumundadır. Ne varki burada istemcilerden gelen taleplerin, dengeli bir şekilde arka servislere(Back-End Services) y&amp;ouml;nlendirilmesi s&amp;ouml;z konusudur. Ayrıca gelen &lt;strong&gt;SOAP&lt;/strong&gt; paketlerinin ayrıştırılarak uygun olan arka servislere aktarılmasıda gereklidir. Dolayısıyla &lt;strong&gt;Front-End Service&lt;/strong&gt; kendi i&amp;ccedil;erisinde &amp;ouml;zel bir servis s&amp;ouml;zleşmesi sunmalıdır. Bu nedenle ilk olarak i&amp;ccedil;eriği aşağıdaki gibi olan bir &lt;strong&gt;WCF&lt;/strong&gt; &lt;strong&gt;Servis&lt;/strong&gt; &lt;strong&gt; k&amp;uuml;t&amp;uuml;phanesinin(WCF Service Library)&lt;/strong&gt; geliştirilmesi gereklidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk240_11.gif" alt="" width="335" height="417" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;IRouterContract&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;ne(interface) ait kod i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using System.ServiceModel.Channels;

namespace RouterLib
{
    [ServiceContract]
    public interface IRouterContract
    {
        [OperationContract(Action="*",ReplyAction="*")]
        Message MesajIsle(Message msg);
    }
}&lt;/pre&gt;
&lt;p&gt;Aray&amp;uuml;z i&amp;ccedil;erisinde dikkat &amp;ccedil;ekici noktalardan birisi &lt;strong&gt;OperationContract&lt;/strong&gt; &lt;strong&gt;niteliği(Attribute)&lt;/strong&gt; i&amp;ccedil;erisinde uygulanan &lt;strong&gt;Action&lt;/strong&gt; ve &lt;strong&gt;ReplyAction&lt;/strong&gt; &amp;ouml;zellikleridir. Her iki &amp;ouml;zelliğe &lt;strong&gt;*&lt;/strong&gt; değerinin verilmesi ile, talep edilen operasyon istekleri ne olursa olsun işlem yapılacağı belirtilmetkedir. Buradaki operasyon isimleri bilindiği &amp;uuml;zere &lt;strong&gt;WSDL(Web Service Description Language)&lt;/strong&gt; d&amp;ouml;k&amp;uuml;manınca belirtilen adlardır. Servis tarafında her ne kadar tek bir fonksiyonellik s&amp;ouml;z konusu olsada birden fazla işlevin olduğu senaryolarda kabul edilen ve cevaplanan operasyon adlarının belirtilmesi yerine &lt;strong&gt;* &lt;/strong&gt;se&amp;ccedil;eneği sıklıkla kullanılmaktadır.&lt;/p&gt;
&lt;p&gt;Bunun yanında aray&amp;uuml;z(Interface) i&amp;ccedil;erisindeki metod &lt;strong&gt; System.ServiceModel.Channels&lt;/strong&gt; isim alanında yer alan &lt;strong&gt;Message&lt;/strong&gt; tipinden bir parametre almakta ve aynı tipten bir &amp;ouml;rnek d&amp;ouml;nd&amp;uuml;rmektedir. Bu metodun amacı, istemciden gelen mesajların arka servislere y&amp;ouml;nlendirilmesini sağlamaktır. Ayrıca arka servislerden gelen mesajlarında istemcilere ulaştırılmasında &amp;ouml;nemli bir role sahiptir. Ger&amp;ccedil;ektende &lt;strong&gt;Message&lt;/strong&gt; sınıfının asli g&amp;ouml;revi &lt;strong&gt;EndPoint&lt;/strong&gt; noktaları arasındaki iletişimi sağlamaktır. Geliştirilen bu aray&amp;uuml;z&amp;uuml; uygulayan &lt;strong&gt;RouterContract&lt;/strong&gt; isimli sınıfa ait kod i&amp;ccedil;eriği ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using System.ServiceModel.Channels;

namespace RouterLib
{
    [ServiceBehavior(ValidateMustUnderstand=false,InstanceContextMode= InstanceContextMode.PerCall)]
    public class RouterContract : IRouterContract
    {
        private static IChannelFactory&amp;lt;IRequestChannel&amp;gt; fabrika = null;
        private EndpointAddress adres1 = new EndpointAddress("http://localhost:50001/Matematik/Cebir.svc");
        private EndpointAddress adres2 = new EndpointAddress("http://localhost:50002/Matematik/Cebir.svc");
        private static int dengeSayaci = 1;

        static RouterContract()
        {
            BasicHttpBinding binding = new BasicHttpBinding();
            fabrika = binding.BuildChannelFactory&amp;lt;IRequestChannel&amp;gt;();
            fabrika.Open();
        }

        #region IRouterContract Members
    
        public Message MesajIsle(Message msg)
        {
           IRequestChannel kanal = null;
            Message cevap = null;
            try
            {
                if (dengeSayaci % 2 == 0)
                    kanal = fabrika.CreateChannel(adres1);
                else
                    kanal = fabrika.CreateChannel(adres2);

                dengeSayaci++;
                kanal.Open();
                cevap = kanal.Request(msg);
                kanal.Close();
            }
            catch (Exception exp)
            {
            }
            return cevap;
        }
        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncelikli olarak sınıf i&amp;ccedil;erisinde iki adet &lt;strong&gt;EndPointAddress&lt;/strong&gt; değişkeni tanımlandığına dikkat edelim. Bu değişkenler tahmin edileceği &amp;uuml;zere &lt;strong&gt;Back-End Service&lt;/strong&gt;' lere erişim adreslerini taşımaktadırlar. Diğer taraftan y&amp;ouml;nlendirici serviste &lt;strong&gt; PerCall&lt;/strong&gt; modelinde tasarlanmıştır. Buda istemcilerden gelecek her &amp;ccedil;ağrıda bir &lt;strong&gt;servis &amp;ouml;rneği(Service Instance)&lt;/strong&gt; oluşturulacağı anlamına gelmektedir. Burada sadece tek bir servis referansı olmasını sağlamak i&amp;ccedil;in &lt;strong&gt;static yapıcı metod(Static Constructor)&lt;/strong&gt; i&amp;ccedil;erisinde bazı kodlamalar yapılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;MesajIsle&lt;/strong&gt; metodu i&amp;ccedil;erisinde &amp;ouml;ncelikli olarak &lt;strong&gt;IRequestChannel&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;ne ait bir değişken tanımlanmaktadır. Bu değişkenin &amp;uuml;retilmesi i&amp;ccedil;in generic &lt;strong&gt; IChannelFactory&amp;lt;T&amp;gt;&lt;/strong&gt; tipinden olan fabrika isimli değişkenin &lt;strong&gt; CreateChannel&lt;/strong&gt; metodu kullanılmaktadır. Bir başka deyişle istemciden gelen talepler sonrasında &lt;strong&gt;dengeSayaci&lt;/strong&gt; değişkeninin i&amp;ccedil;eriğine g&amp;ouml;re uygun olan &lt;strong&gt;kanal nesnesi(Channel Object)&lt;/strong&gt; oluşturulmakta ve bu kanal a&amp;ccedil;ılarak &lt;strong&gt;talebin(Request)&lt;/strong&gt; aktarılması ve sonucunun alınarak geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi sağlanmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Request&lt;/strong&gt; metodu, MesajIsle metoduna gelen Message tipinden parametre değerini kullanarak, oluşturulan kanal nesnesine bir talepte bulunmaktadır. Bu talep &lt;strong&gt; Front-End Service&lt;/strong&gt;' inarkasında yer alan &lt;strong&gt;Back-End&lt;/strong&gt; servislerden birisine doğru ger&amp;ccedil;ekleştirilir. &lt;strong&gt;Request&lt;/strong&gt; metodu arka servisten gelen cevabı yine bir &lt;strong&gt;Message&lt;/strong&gt; değişkeni tipinden alarak sonucun elde edilmesini sağlamaktadır. &lt;em&gt;(Servis tarafı ile manuel olarak konuşma tekniklerini ilerleyen makalelerimizde incelemeye &amp;ccedil;alışacağız).&lt;/em&gt; Artık y&amp;ouml;nlendirici servis tasarlanabilir. Bunun i&amp;ccedil;in yine bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Console uygulaması bu kez &lt;strong&gt;RouterLib&lt;/strong&gt; &lt;strong&gt;WCF servis k&amp;uuml;t&amp;uuml;phanesini(WCF Service Library) &lt;/strong&gt;referans etmelidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk240_12.gif" alt="" width="240" height="353" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z konusu &lt;strong&gt;Front-End Service&lt;/strong&gt; uygulamasının konfigurasyon i&amp;ccedil;eriği aşağıdaki gibi tasarlanabilir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;behaviors&amp;gt;
            &amp;lt;serviceBehaviors&amp;gt;
                &amp;lt;behavior name="RouterServiceBehavior"&amp;gt;
                    &amp;lt;serviceDebug includeExceptionDetailInFaults="true" /&amp;gt;
                &amp;lt;/behavior&amp;gt;
            &amp;lt;/serviceBehaviors&amp;gt;
        &amp;lt;/behaviors&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service behaviorConfiguration="RouterServiceBehavior" name="RouterLib.RouterContract"&amp;gt;
                &amp;lt;endpoint address="http://localhost:50003/Matematik/Cebir.svc" binding="basicHttpBinding" bindingConfiguration="" name="RouterEndPoint" contract="RouterLib.IRouterContract" /&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu konfigurasyon dosyası i&amp;ccedil;erisinde dikkat edilmesi gereken en &amp;ouml;nemli nokta adres bilgisidir. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;50003&lt;/strong&gt; numaralı porttan hizmet verecek bir &lt;strong&gt; EndPoint&lt;/strong&gt; tanımlaması yapılmaktadır. Buna g&amp;ouml;re istemciler &lt;strong&gt;50001&lt;/strong&gt; veya &lt;strong&gt;50002&lt;/strong&gt; i&amp;ccedil;in ayrı ayrı talepte bulunmaktansa, sadece &lt;strong&gt;50003&lt;/strong&gt;' e istekte bulunacaklardır. Onları karşılayan &lt;strong&gt;Front&lt;/strong&gt;-&lt;strong&gt;End&lt;/strong&gt; &lt;strong&gt; Service&lt;/strong&gt;' te &lt;strong&gt;Load&lt;/strong&gt; &lt;strong&gt;Balancing&lt;/strong&gt; algoritmasına g&amp;ouml;re arka servisler arasında talepleri dengeli bir şekilde paylaştıracaktır. &lt;strong&gt; RouterService&lt;/strong&gt; isimli &lt;strong&gt;Front-End Service&lt;/strong&gt; uygulamasının kod i&amp;ccedil;eriği ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using RouterLib;

namespace RouterService
{
    class Program
    {
        static void Main(string[] args)
        {
            ServiceHost host = new ServiceHost(typeof(RouterContract));
            host.Open();
            Console.WriteLine("Y&amp;ouml;nlendirici servis dinlemede\n&amp;Ccedil;ıkmak i&amp;ccedil;in bir tuşa basınız");
            Console.ReadLine();
            host.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu işlemin arkasından tek yapılması gereken istemci uygulamalardaki konfigurasyon dosyalarında yer alan adres bilgisini &lt;strong&gt;http://localhost:50003/Matematik/Cebir.svc&lt;/strong&gt; olacak şekilde değiştirmektir. Test aşamasında &amp;ouml;nce &lt;strong&gt;Back-End Service'&lt;/strong&gt; lerin &amp;ccedil;alıştırılması, sonrasında &lt;strong&gt;Front-End Service&lt;/strong&gt;' in y&amp;uuml;r&amp;uuml;t&amp;uuml;lmesi gerekmektedir. Bu servislerin tamamı &amp;ccedil;alıştığı s&amp;uuml;rece istemciler hizmet alabilirler. Uygulama eğer &lt;strong&gt;debug&lt;/strong&gt; edilerek &amp;ccedil;alıştırılırsa MesajIsle metodu i&amp;ccedil;erisinde aşağıdaki Flash g&amp;ouml;rselinde yer alan durumun oluştuğu g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;object id="obj1" width="480" height="572" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/mk240.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="480" height="572" src="http://www.buraksenyurt.com/makale/images/mk240.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj1" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;Burada dikkat edileceği &amp;uuml;zere istemcilerden gelen iki talep sonrasında, if d&amp;ouml;ng&amp;uuml;s&amp;uuml; farklı arka servis erişimleri ger&amp;ccedil;ekleştirmektedir. Buda zaten kurulan &lt;strong&gt;Load-Balancing &lt;/strong&gt;algoritmasının bir sonucudur. Sonu&amp;ccedil; olarak &lt;strong&gt;Front-End Service&lt;/strong&gt;' in eklenmesi ile birlikte sistem aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len hale gelmiştir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk240_13.gif" alt="" width="566" height="448" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Ger&amp;ccedil;ek hayat senaryolarında&lt;strong&gt; Back-End Service &lt;/strong&gt;i&amp;ccedil;erisinde yer alan &lt;strong&gt;EndPoint&lt;/strong&gt; noktaları farklı &lt;strong&gt; bağlayıcı tipleri(Binding Type) &lt;/strong&gt;kullanıyor olabilirler. Bu durumda y&amp;ouml;nlendirici servislerin tasarlanması biraz daha zorlaşmaktadır. &amp;Ouml;rneğin &lt;strong&gt;WS&lt;/strong&gt; standartlarına uygun bağlayıcı tiplerin(&amp;ouml;rneğin WsHttpBinding gibi) kullanıldığı durumlarda g&amp;uuml;venlik(Security) ile ilişkili ayarlamaların mutlaka yapılması gerekmektedir. Buda &lt;strong&gt;mesaj(Message)&lt;/strong&gt; yada &lt;strong&gt;iletişim(Transport) &lt;/strong&gt;g&amp;uuml;venliği i&amp;ccedil;in ek ayarlamaların hem istemciler hemde servisler &amp;uuml;zerinde ger&amp;ccedil;ekleştirilmesi anlamına gelmektedir. Bu makalemizde bu tip konular g&amp;ouml;z ardı edilerek basit anlamda&lt;strong&gt; Load-Balancing &lt;/strong&gt;yapan bir y&amp;ouml;nlendirici servisin nasıl tasarlanabileceği incelenmeye &amp;ccedil;alışılmıştır. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/Yonlendirme.rar"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2008-01-30 12:00:00</pubDate>
  <slug>Front-End-Service-Gelistirmek-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
    <tag>front-end-services</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>