<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>.Net Remoting ve Factory Design Pattern</title>
  <description>Factory Design Pattern (Fabrika Tasarım Deseni), istemcilerin ihtiyaç duyduğu nesneleri oluşturmak için özel bir nesnenin kullanıldığı mimariyi ele alır. Öyleki bu tasarım deseninde istemcinin, kullanacağı asıl nesnenin nasıl üretileceği hakkında herhangibir bilgiye sahibi olması gerekmez. Bu örnekleme işini üstlenen fabrikanın (Factory) kendisidir. Biz bu makalemizde, Factory Design Pattern' in .Net Remoting içerisinde kullanılışını incelemeye çalışacağız. Makaleyi kolay takip edebilmeniz açısından Remoting ile ilgili temel bilgilere aşina olmanız önemlidir. Factory tasarım deseninin 3 önemli parçası vardır. Client, Factory ve Product.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Factory Design Pattern (Fabrika Tasarım Deseni), istemcilerin ihtiya&amp;ccedil; duyduğu nesneleri oluşturmak i&amp;ccedil;in &amp;ouml;zel bir nesnenin kullanıldığı mimariyi ele alır. &amp;Ouml;yleki bu tasarım deseninde istemcinin, kullanacağı asıl nesnenin nasıl &amp;uuml;retileceği hakkında herhangibir bilgiye sahibi olması gerekmez. Bu &amp;ouml;rnekleme işini &amp;uuml;stlenen fabrikanın (Factory) kendisidir. Biz bu makalemizde, Factory Design Pattern' in .Net Remoting i&amp;ccedil;erisinde kullanılışını incelemeye &amp;ccedil;alışacağız. Makaleyi kolay takip edebilmeniz a&amp;ccedil;ısından Remoting ile ilgili temel bilgilere aşina olmanız &amp;ouml;nemlidir. Factory tasarım deseninin 3 &amp;ouml;nemli par&amp;ccedil;ası vardır. Client, Factory ve Product.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk152_1.gif" alt="" width="375" height="419" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İstemcilerin (Clients) amacı Product tipinden nesne &amp;ouml;rneklerini kullanmaktır. Bunun i&amp;ccedil;in mutlaka ve mutlaka Product tipinden nesne &amp;ouml;rneklerinin oluşturumasına ihtiya&amp;ccedil; vardır. İstemci bu &amp;uuml;retim işlemini doğrudan değil, Factory nesne &amp;ouml;rnekleri &amp;uuml;zerinden yapar. Dolayısıyla her hangibir Product tipinin &amp;uuml;retilmesi aşamasında oluşabilecek değişikliklerden sorumlu olan tip Factory nesnesi olacaktır. Bu bir anlamda istemcilerin, ilgilendikleri Product nesnesinin nasıl &amp;ouml;rneklendirildiklerini bilmemesi anlamına gelir. Bunu soyutlama (abstraction) olarakta tanımlayabiliriz. Bu sebepten dolayı Factory tasarım deseni &amp;ouml;zellikle remoting uygulamalarında sık&amp;ccedil;a kullanılmaktadır. &amp;Ccedil;&amp;uuml;nk&amp;uuml; uzak nesnelerin (ki burada product nesnelerimiz olacak) oluşturulması (Creation) kısmında zaman i&amp;ccedil;erisinde g&amp;uuml;ncellemeler ve değişiklikler olabilir. İşte bu değişiklikleri ele alacak ve bu sorumluluğu taşıyacak olan kısım istemci değil Factory ' nin kendisi olacaktır.&lt;/p&gt;
&lt;table id="table40" style="width: 100%;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Factory tasarım deseni, nesnelerin oluşturulması ile ilgilendiğinden constructor metodları aktif şekilde kullanır. Bu nedenlerden dolayı Creational Pattern' ler kategorisinde yer almaktadır.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Şimdi dilerseniz konuyu daha fazla karmaşıklaştırmadan teoriden uzaklaşalım ve factory tasarım desenini ele alabileceğimiz bir &amp;ouml;rnek geliştirelim. Bu &amp;ouml;rneğimizde istemciler, &amp;uuml;r&amp;uuml;n olarak kullanacakları nesne &amp;ouml;rnekleri &amp;uuml;zerinden uzak sunucuda yer alan bir veritabanına bağlanacaklar ve kendileri i&amp;ccedil;in gerekli bilgileri tedarik edecekler. Elbetteki, &amp;uuml;r&amp;uuml;nlerin oluşturulması işlevini tamamen Factory nesnemize devredeceğiz. İlk olarak izleyeceğimiz yoldan bahsedelim.&lt;/p&gt;
&lt;table id="table35" style="border-collapse: collapse; width: 100%;" border="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td colspan="2" align="center"&gt;&lt;strong&gt; Geliştirme Adımlarımız&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="19"&gt;1 -&lt;/td&gt;
&lt;td width="95%"&gt;Factory ve Product nesneleri i&amp;ccedil;in gerekli abstract sınıflarımızı public bir class library i&amp;ccedil;erisinde oluştururuz.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="19"&gt;2 -&lt;/td&gt;
&lt;td width="95%"&gt;Server tarafı i&amp;ccedil;in gerekli abstract sınıflarımızdan t&amp;uuml;retilen Factory ve Product sınıflarımızı yazarız.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="19"&gt;3 -&lt;/td&gt;
&lt;td width="95%"&gt;Server tarafında gerekli remoting kodlarını yazarız.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="19"&gt;4 -&lt;/td&gt;
&lt;td width="95%"&gt;İstemci tarafında gerekli remoting kodlarını yazarız.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;İlk olarak abstract sınıflarımızı yazmamız gerekiyor. Bunları bir class library i&amp;ccedil;erisinde tutmamızın en &amp;ouml;nemli nedeni, hem server tarafında hemde istemci tarafında ihtiyacımızın olması ve referans olarak eklememiz gerektiği. Bu nedenle &amp;ouml;nce bir class library projesi a&amp;ccedil;alım ve aşağıdaki abstract sınıflarımızı oluşturalım.&lt;/p&gt;
&lt;table id="table41" style="width: 100%;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Abstract sınıflar, normal sınıflar gibi &amp;uuml;yeler i&amp;ccedil;erebilen, &amp;ouml;rneklendirilemeyen (instance create edilemez) ve kendisinden t&amp;uuml;reyen tiplerin mutlaka override etmesi gereken metod, &amp;ouml;zellik gibi &amp;uuml;yelerin tanımlamalarını i&amp;ccedil;eren (kod bloksuz halleri) tiplerdir.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;img src="/makale/images/mk152_2.gif" alt="" width="328" height="294" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace FactoryProductBase
{
    public abstract class ProductBase : MarshalByRefObject
    {
        public abstract string GetContactInfo();
    }

    public abstract class FactoryBase : MarshalByRefObject
    {
        public abstract ProductBase CreateProduct(int ContactID);
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi burada yaptıklarımızdan kısaca bahsedelim. &amp;Ouml;ncelikli olarak ProductBase abstract sınıfımız yazdık. Bu sınıfımız herhangibir istemcinin asıl olarak &amp;ccedil;alışmak isteyeceği nesnelerin uygulayacağı bir metod bildirimi i&amp;ccedil;ermekte. Amacımız bu abstract sınıfı uygulayan bir Product tipi ile AdventureWorks veritabanında yer alan Contact tablsoundan belirli bir ContactID' ye ait bilgileri string formatta alabilmek.&lt;/p&gt;
&lt;p&gt;&amp;Uuml;retimden sorumlu olan FactoryBase isimli abstract sınıfımız ise, kendisini uygulayacak olan herhangibir Factory tipinin, Product &amp;uuml;retme işini nasıl yapması gerektiğini bildiren bir abstract metod i&amp;ccedil;eriyor. Dikkat ederseniz bu abstract metodumuzun d&amp;ouml;n&amp;uuml;ş tipi ProductBase' dir. Buda FactoryBase' den t&amp;uuml;remiş bir sınıfın override edilecek olan CreateProduct isimli metodunun, ProductBase tipinden t&amp;uuml;retilmiş olan bir sınıfa ait nesne &amp;ouml;rneğini d&amp;ouml;nd&amp;uuml;rebileceği anlamına gelmektedir. Bu ilişkiyi sunucu tarafımızda &amp;ccedil;alışacak olan asıl sınıflarımızı yazarken kullanacağız.&lt;/p&gt;
&lt;table id="table38" style="width: 100%;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Her iki abstract sınıfında, remoting i&amp;ccedil;erisinde kullanılabilmesini sağlamak i&amp;ccedil;in MarshalByRefObject' dan t&amp;uuml;retildiğine dikkat edin. MarshalByRefObject bildiğiniz gibi, istemcinin remote nesnenin referansı ile &amp;ccedil;alışabilmesini sağlar.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Abstract sınıflarımızı hazırladıktan sonra sıra geldi sunucu tarafını programlamaya. Sunucu tarafında, FactoryBase ve ProductBase sınıflarından t&amp;uuml;reyen tiplerimizi yazarak işe başlayacağız. Ama &amp;ouml;ncesinde, sunucu uygulamamızı bir console application olarak a&amp;ccedil;alım. Daha sonra ise, System.Runtime.Remoting ve abstract sınıflarımızı barındırdan Class Library' imizi bu uygulamaya referans olarak ekleyelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk152_3.gif" alt="" width="231" height="194" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi Factory ve Product sınıflarımızı yazmamız gerekiyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk152_4.gif" alt="" width="446" height="502" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Product : ProductBase
{
    string _ContactInfo;

    public Product(int ContactID)
    {
        _ContactInfo = "";
        using (SqlConnection con = new SqlConnection("data source=MANCHESTER;database=AdventureWorks;integrated security=SSPI"))
        {
            using(SqlCommand cmd=new SqlCommand("Select ContactID,FirstName,MiddleName,LastName From Person.Contact Where     ContactID=@ContactID",con))
            {
                cmd.Parameters.Add("@ContactID", SqlDbType.Int);
                cmd.Parameters["@ContactID"].Value = ContactID;
                con.Open();
                SqlDataReader dr = cmd.ExecuteReader(CommandBehavior.CloseConnection);
                dr.Read();
                StringBuilder sb = new StringBuilder(_ContactInfo);
                sb.Append(dr["ContactID"] + " ");
                sb.Append(dr["FirstName"] + " ");
                sb.Append(dr["MiddleName"] + " ");
                sb.Append(dr["LastName"] + " ");
                dr.Close();
                _ContactInfo = sb.ToString();
            }
        }
    }

    public override string GetContactInfo()
    {
        return _ContactInfo;
    }
}

public class Factory : FactoryBase
{
    public override ProductBase CreateProduct(int ContactID)
    {
        return new Product(ContactID);
    }
}&lt;/pre&gt;
&lt;p&gt;Kısaca sınıflarımızın &amp;ccedil;alışma şekline bakalım. Factory sınıfımız FactoryBase abstract sınıfından t&amp;uuml;remiştir. Bu nedenle CreateProduct isimli metodu override etmek zorundadır. CreateProduct metodumuz dikkat ederseniz, ProductBase sınıfından t&amp;uuml;rettiğimiz Product tipinden bir nesne &amp;ouml;rneğini geriye d&amp;ouml;nd&amp;uuml;rmektedir. Burada elbeteki devreye Product sınıfı i&amp;ccedil;erisinde yazdığımız yapıcı metod (constructor) girer.&lt;/p&gt;
&lt;p&gt;Bu metod i&amp;ccedil;erisinde kısaca veritabanı bağlantı işlemlerimizi yapıp, Contact tablosundan ContactID, FirstName, MiddleName ve LastName alanlarının değerlerini okuyup stringBuilder yardımıyla sınıf i&amp;ccedil;erisinde yer alan _ContactInfo isimli string' e aktarmaktayız. Son olarak Factory tipimizin override ettiği GetContactInfo isimli metodumuzda _ContactInfo değişkenimizin i&amp;ccedil;eriğini geriye d&amp;ouml;nd&amp;uuml;rmekte. Sıra geldi, server tarafında remoting i&amp;ccedil;in yapmamız gereken işlemlere. Bunun i&amp;ccedil;in server tarafımızdaki console uygulamamızın main metodunun kodlarını aşağıdaki gibi değiştirmemiz gerekiyor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
&amp;nbsp;&amp;nbsp;&amp;nbsp; TcpServerChannel srvChannel = new TcpServerChannel(8000);
&amp;nbsp;&amp;nbsp;&amp;nbsp; ChannelServices.RegisterChannel(srvChannel,true);
&amp;nbsp;&amp;nbsp;&amp;nbsp; RemotingConfiguration.RegisterWellKnownServiceType(typeof(Factory), "Server/Factory", WellKnownObjectMode.SingleCall);
&amp;nbsp;&amp;nbsp;&amp;nbsp; Console.WriteLine("Sunucu dinlemede...");
&amp;nbsp;&amp;nbsp;&amp;nbsp; Console.ReadLine();
}&lt;/pre&gt;
&lt;p&gt;İlk olarak, Tcp protokol&amp;uuml; &amp;uuml;zerinden haberleşmeyi tercih ettiğimizden, istemciden gelecek talepleri dinleyecek bir portu (&amp;ouml;rneğimizde 8000 numaralı port) kullanıma a&amp;ccedil;mamız gerekiyor. Bu ama&amp;ccedil;la bir TcpServerChannel nesnesi oluşturduk ve bunu siteme register ettik. Sonrasında ise SingelCall tekniğine g&amp;ouml;re (yani her istemci i&amp;ccedil;in server tarafında ayrı birer remote object referansı oluşturulması), istemcilerin server ile iletişim kurabileceği URI bilgisini hazırlıyoruz. Bunun i&amp;ccedil;in bir WellKnowServiceTypeEntry nesnesini, RemotingConfiguration.RegisterWellKnowServiceType metodu i&amp;ccedil;erisinde oluşturduk. Dolayısıyla sunucu tarafında artık şunu s&amp;ouml;ylemiş oluyuroz. tcp://MANCHESTER:8000/Server/Factory adresini, istemcilerin kullanımına a&amp;ccedil;ıyoruz. Bu URI bilgisine g&amp;ouml;re istemciler MANCHESTER isimli sunucuya 8000 numaralı porttan bağlanacak ve Server isim alanındaki Factory isimli sınıfa ait nesne &amp;ouml;rneklerinin referansları ile konuşacak. Sunucu tarafımızıda hazırladıktan sonra sıra geldi istemci tarafındaki kodları yazmaya. Yine server tarafına benzer olarak istemci tarafındada bizim i&amp;ccedil;in gerekli olan class library ve System.Runtime.Remoting isim alanlarını a&amp;ccedil;ık&amp;ccedil;a eklememiz gerekiyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk152_5.gif" alt="" width="235" height="197" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi istemci tarafımızdaki kodları yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
    TcpClientChannel clientChannel = new TcpClientChannel();
    ChannelServices.RegisterChannel(clientChannel, true);

    FactoryBase fb = (FactoryBase)Activator.GetObject(typeof(FactoryBase), "tcp://MANCHESTER:8000/Server/Factory");
    ProductBase pb = fb.CreateProduct(1);
    Console.WriteLine(pb.GetContactInfo());
}&lt;/pre&gt;
&lt;p&gt;İstemci tarafında, sunucu tarafı ile haberleşebilmemiz i&amp;ccedil;in bu kez bir TcpClientChannel nesnesine ihtiyacımız var. Bizim i&amp;ccedil;in burada &amp;ouml;nemli olan, server tarafından bir FactoryBase tipinden nesne &amp;ouml;rneğine ait referansı almak i&amp;ccedil;in Activator sınıfının GetObject static metodunu kullanıyor oluşumuz. Bu metod sayesinde, server tarafından FactoryBase tipinden bir referansı kullanacağımızı s&amp;ouml;ylemiş oluyoruz. Ancak dikkat edin sadece s&amp;ouml;yl&amp;uuml;yoruz. Hen&amp;uuml;z bu referansı sunucudan istemciye almış değiliz. Nitekim sunucu &amp;uuml;zerindeki referanslar, istemcide bir metod &amp;ccedil;ağırımı yapıldığı zaman oluşturulmaktadır.&lt;/p&gt;
&lt;p&gt;Sonrasında ise, Product tipinden nesne &amp;ouml;rneğimizin ilgili metodunu &amp;ccedil;alıştırabilmek i&amp;ccedil;in, elde ettiğimiz FactoryBase referansının CretaeProduct isimli metodunu kullandık. B&amp;ouml;ylece sunucu tarafındaki Product tipine erişip, 1 numaralı Contact bilgisini istemci tarafına taşıyabiliyoruz. Burada &amp;ouml;nemli olan nokta, Product tipine ait bir referansı istemcinin doğrudan create etmeyişi. Bu işlemi FactoryBase' in CreateProduct isimli metodu bizzat yapmakta. Dolayısıyla Product tipine ait bir referansın nasıl oluşturulduğu, istemci tarafından tamamen soyutlaştırılmış olmaktadır.&lt;/p&gt;
&lt;table id="table42" style="width: 100%;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;İstemci tarafında FactoryBase ve ProductBase abstract sınıflarını kullanmamıza rağmen, sunucu tarafındaki Factory ve Product tiplerinin bazı &amp;uuml;yelerini ele alabilmekteyiz. İşte bu polimorfizm' in bir etkisidir. &amp;Ccedil;&amp;uuml;nk&amp;uuml; abstract tipler, kendilerinden t&amp;uuml;reyen tiplere ait referansları taşıdıklarında, t&amp;uuml;remiş tiplerin override edilmiş &amp;uuml;yelerine erişebilirler.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Uygulamamızı test etmek i&amp;ccedil;in &amp;ouml;ncelikle server tarafını &amp;ccedil;alıştırmalı ve sunucuyu dinlemeye hazır hale getirmeliyiz. Eğer sisteminizde y&amp;uuml;k&amp;uuml; bir firewall var ise bu isteğinizi onaylayıp onaylamadığınızı sorabilir. &lt;em&gt;(&amp;Ouml;rneğin Xp işletim sisteminin Firewall programı devreye gittiğinde Unblock se&amp;ccedil;eneğini işaretlemeniz lazım.) &lt;/em&gt;Burada işlemi onaylayıp portumuzu remote iletişim i&amp;ccedil;in a&amp;ccedil;mamız gerekiyor. Sonrasında ise istemci uygulamamızı &amp;ccedil;alıştırıp sonu&amp;ccedil;ları g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk152_6.gif" alt="" width="532" height="275" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Remoting' in uygulandığı bu &amp;ouml;rneğin başarılı bir şekilde &amp;ccedil;alışıp &amp;ccedil;alışmadığını kontrol etmek i&amp;ccedil;in, istemci uygulamanızı sunucuyu &amp;ccedil;alıştırmadan y&amp;uuml;r&amp;uuml;tmeyi deneyin. CreateProduct isimli metodun &amp;ccedil;ağırıldığı yerde SocketException tipinden bir istisna alırız. Bunun sebebi, sunucu tarafının &amp;ccedil;alışmıyor oluşu ve bu sebeple bağlantı sağlanamasıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk152_7.gif" alt="" width="496" height="184" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu makalemizde, Factory Design Pattern' in , ger&amp;ccedil;ek hayat uyarlamalarından birisi olan .Net Remoting' deki yerini incelemeye &amp;ccedil;alıştık. Kısaca tekrar etmek gerekirse Factory deseni bir istemcinin, kullanacağı &amp;uuml;r&amp;uuml;n&amp;uuml;n oluşturulması sorumluluğunu fabrikaya (Factory) devreden bir mimari sunmaktadır. Bu da istemcinin, kullanacağı &amp;uuml;r&amp;uuml;n&amp;uuml;n nasıl oluşturulacağını bilmek zorunda olmaması anlamına gelir. Dahası, &amp;uuml;r&amp;uuml;n tarafındaki nesnelerin oluşturulması sırasındaki değişiklikler istemciyi etkilemeyecektir. Bu sadece fabrika nesnelerinin bilmesi gereken bir durumdur. B&amp;ouml;ylece uygulamaların daha kolay genişletilebilmesi sağlanabilir. Tahmin edeceğiniz gibi bir &amp;uuml;r&amp;uuml;n&amp;uuml;n (Product) ın oluşturulması sırasındaki değişikliklerin sadece sunucu tarafında yapılması yeterli olacaktır. &amp;Ccedil;&amp;uuml;nk&amp;uuml; istemci tarafında bu tiplere ait referanslar yerine bu tiplerin t&amp;uuml;rediği referansları yer almaktadır. Buda mimariyi en azından &amp;uuml;r&amp;uuml;nlerin &amp;uuml;retiliş şeklini tek bir merkezden g&amp;uuml;d&amp;uuml;mleyebileceğimiz anlamına gelir. B&amp;ouml;ylece geldik bir makalemizin daha sonuna bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/FactoryPattern.rar"&gt;&amp;Ouml;rnek uygulamalı indirmek i&amp;ccedil;in tıklayın.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2006-03-18 12:00:00</pubDate>
  <slug>-Net-Remoting-ve-Factory-Design-Pattern-bsenyurt-com-dan</slug>
  <tags>
    <tag>net-remoting</tag>
    <tag>factory</tag>
    <tag>design-pattern</tag>
  </tags>
  <categories>
    <category>.Net Remoting</category>
  </categories>
</post>