<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Workflow Foundation Öğreniyorum - Ders 14 - Hani Nerde Asenkron Çalışma Zamanı</title>
  <description>NedirTv?com sponsorluğunda hazırladığımız "Workflow Foundation 4.0 Öğreniyorum" görsel eğitim serimizin 14+1=15nci dersi ile birlikteyiz. Şu ana kadar ki derslerimizde Workflow örneklerini çalıştırmak için sadece WorkflowInvoker tipinin static Invoke metodunu kullandık. Bu senkron çalışma modeli olarak düşünülebilir. Nitekim Invoke metodu yardımıyla başlatılan Workflow örneği işleyişini tamamlayana kadar, çağırıcı uygulama bir sonraki kod satırına geçiş yapmayacaktır. Ancak Workflow örneklerini çalıştıracak olan ve özellikle kullanıcı etkileşimi olan uygulamalarda bu bir sorun teşkil etmektedir. Öyleki Workflow örneklerinden özellikle uzun süreli olanlar arka planda çalışırken, ana uygulamanın da işleyişine devam etmesi istenebilir. İşte WorkflowApplication sınıfı bu ihtiyaçı karşılamak için kullanılmaktadır. Bakalım nasıl?</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f5%2fwfOgreniyorum_Ders14.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;a title="NedirTv?com" href="http://www.nedirtv.com" target="_blank"&gt;&lt;strong&gt;NedirTv?com&lt;/strong&gt;&lt;/a&gt; sponsorluğunda hazırladığımız &lt;a title="Workflow Foundation &amp;Ouml;ğreniyorum" href="http://www.nedirtv.com/kategori/Workflow-Foundation-Ogreniyorum.aspx" target="_blank"&gt;&lt;strong&gt;"Workflow Foundation 4.0 &amp;Ouml;ğreniyorum"&lt;/strong&gt;&lt;/a&gt; g&amp;ouml;rsel eğitim serimizin &lt;strong&gt;14+1=15nci&lt;/strong&gt; dersi ile birlikteyiz. Şu ana kadar ki derslerimizde &lt;strong&gt;Workflow&lt;/strong&gt; &amp;ouml;rneklerini &amp;ccedil;alıştırmak i&amp;ccedil;in sadece &lt;strong&gt;WorkflowInvoker&lt;/strong&gt; tipinin &lt;strong&gt;static&lt;/strong&gt; &lt;strong&gt;Invoke&lt;/strong&gt; metodunu kullandık. Bu senkron &amp;ccedil;alışma modeli olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Nitekim &lt;strong&gt;Invoke&lt;/strong&gt; metodu yardımıyla başlatılan &lt;strong&gt;Workflow&lt;/strong&gt; &amp;ouml;rneği işleyişini tamamlayana kadar, &amp;ccedil;ağırıcı uygulama bir sonraki kod satırına ge&amp;ccedil;iş yapmayacaktır. Ancak &lt;strong&gt;Workflow&lt;/strong&gt; &amp;ouml;rneklerini &amp;ccedil;alıştıracak olan ve &amp;ouml;zellikle kullanıcı etkileşimi olan uygulamalarda bu bir sorun teşkil etmektedir. &amp;Ouml;yleki &lt;strong&gt;Workflow&lt;/strong&gt; &amp;ouml;rneklerinden &amp;ouml;zellikle uzun s&amp;uuml;reli olanlar arka planda &amp;ccedil;alışırken, ana uygulamanın da işleyişine devam etmesi istenebilir. İşte &lt;strong&gt;WorkflowApplication&lt;/strong&gt; sınıfı bu ihtiya&amp;ccedil;ı karşılamak i&amp;ccedil;in kullanılmaktadır. Bakalım nasıl?&lt;/p&gt;
&lt;p&gt;&lt;iframe src="https://www.youtube.com/embed/kbWpD1NFO0I" width="420" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;&lt;a title="Ders 14 - Hani Nerede Asenkron &amp;Ccedil;alışma Zamanı" href="http://nedirtv.com/video/ders-14---hani-nerde-asenkron-calisma-zamani" target="_blank"&gt;Ders 14 - Hani Nerde Asenkron &amp;Ccedil;alışma Zamanı&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;S&amp;uuml;re : 23:22&lt;/p&gt;
&lt;p&gt;Dosya Boyutu : 31.5 Mb&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek : &lt;a href="/admin/app/..http:/www.buraksenyurt.com/pics/2010%2f5%2fLesson14.rar"&gt;Lesson14.rar&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2010-08-07 22:05:00</pubDate>
  <slug>Workflow-Foundation-Ogreniyorum-Ders-14-Hani-Nerde-Asenkron-Calc4b1sma-Zamanc4b1</slug>
  <tags>
    <tag>workflow-foundation-40</tag>
    <tag>workflowapplication</tag>
    <tag>autoresetevent</tag>
    <tag>asynchronous-runtime</tag>
  </tags>
  <categories>
    <category>Workflow Foundation Öğreniyorum</category>
  </categories>
</post>