<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>C# 2.0 ve Static Sınıflar</title>
  <description>Çoğu zaman uygulamalarımızda, nesne örneğinin oluşturulmasına gerek duymayacağımız üyeleri kullanmak isteriz. Bu amaçla static üyeleri kullanırız. Şimdi bir de sadece static üyelerden oluşacak bir sınıf tasarlamak istediğimizi düşünelim. C# programlama dilinin ilk versiyonunda bu tip bir sınıfı yazmak için dikkat etmemiz gereken bir takım noktalar vardır. Static üyeler kullanılabilmeleri için tanımlı oldukları sınıfın nesne örneğine ihtiyaç duymazlar. Bu sebepten sadece static üyeler içerecek olan bir sınıfın örneklendirilememesi tercih edilecektir. Örneğin aşağıdaki kod parçasını dikkate alalım. TemelAritmetik isimli sınıfımız Toplam isimli static bir metod içermektedir.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;oğu zaman uygulamalarımızda, nesne &amp;ouml;rneğinin oluşturulmasına gerek duymayacağımız &amp;uuml;yeleri kullanmak isteriz. Bu ama&amp;ccedil;la static &amp;uuml;yeleri kullanırız. Şimdi bir de sadece static &amp;uuml;yelerden oluşacak bir sınıf tasarlamak istediğimizi d&amp;uuml;ş&amp;uuml;nelim. C# programlama dilinin ilk versiyonunda bu tip bir sınıfı yazmak i&amp;ccedil;in dikkat etmemiz gereken bir takım noktalar vardır. Static &amp;uuml;yeler kullanılabilmeleri i&amp;ccedil;in tanımlı oldukları sınıfın nesne &amp;ouml;rneğine ihtiya&amp;ccedil; duymazlar. Bu sebepten sadece static &amp;uuml;yeler i&amp;ccedil;erecek olan bir sınıfın &amp;ouml;rneklendirilememesi tercih edilecektir. &amp;Ouml;rneğin aşağıdaki kod par&amp;ccedil;asını dikkate alalım. TemelAritmetik isimli sınıfımız Toplam isimli static bir metod i&amp;ccedil;ermektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace UsingStaticClasses
{
    public class TemelAritmetik
    { 
        public static double Toplam(double deger1,double deger2)
        {    
            return deger1+deger2;
        }
}

class Class1
{
        static void Main(string[] args)
        {
            double toplamSonuc=TemelAritmetik.Toplam(10,15);
            Console.WriteLine(toplamSonuc);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında aşağıda olduğu gibi TemelAritmetik sınıfına ait bir nesne &amp;ouml;rneği tanımlayıp Toplam metodunu bu nesne &amp;ouml;rneği &amp;uuml;zerinden &amp;ccedil;ağırmaya &amp;ccedil;alışmak derleme zamanında hataya neden olacaktır. Az &amp;ouml;ncede belirttiğimiz gibi, static &amp;uuml;yelere tanımlandıkları sınıfa ait nesne &amp;ouml;rnekleri &amp;uuml;zerinden erişilemezler.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;TemelAritmetik temelAritmetik=new TemelAritmetik();
double toplamSonuc=temelAritmetik.Toplam(4,5);&lt;/pre&gt;
&lt;p&gt;Ancak yinede dikkat ederseniz TemelAritmetik sınıfına ait nesne &amp;ouml;rneğini oluşturabilmekteyiz. Bu durumda ,ilk olarak static &amp;uuml;yelerle dolu bir sınıfın kesin olarak &amp;ouml;rneklendirilmesini &amp;ouml;nlemek isteyeceğizdir. Bu nedenle varsayılan yapıcı metodu (default constructor) private olarak tanımlayarak bu durumun &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class TemelAritmetik
{ 
    // Varsayılan yapıcı private olduğundan sınıfa ait nesne &amp;ouml;rneği oluşturulamayacaktır.
    private TemelAritmetik()
    {
    }

    public static double Toplam(double deger1,double deger2)
    {
        return deger1+deger2;
    }
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi artık TemelAritmetik sınıfına ait nesne &amp;ouml;rneklerinin &amp;uuml;retilmesinin &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;tik. Aynı şekilde varsayılan yapıcı metodun private olarak tanımlanması bu sınıfta t&amp;uuml;retilme yapılmasınıda engellemektedir. Ancak bazen static &amp;uuml;yeler i&amp;ccedil;eren sınıfımızın yapıcı metodu public veya protected olarak tanımlanmış olabilir. Bu durumda t&amp;uuml;retme işlemi ger&amp;ccedil;ekleşebilecektir. &amp;Ouml;rneğin aşağıdaki kod par&amp;ccedil;asını ele alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace UsingStaticClasses
{
    public class TemelAritmetik
    { 
        public TemelAritmetik()
        {
        }

        public static double Toplam(double deger1,double deger2)
        {
            return deger1+deger2;
        }
    }

    public class AltAritmetik:TemelAritmetik
    {
        public void AltIslemler()
        {
        }
    }

    class Class1
    {
        [STAThread]
        static void Main(string[] args)
        {
            AltAritmetik altAritmetik=new AltAritmetik();
            altAritmetik.AltIslemler();
            double sonuc=AltAritmetik.Toplam(1,2);
        }
    }
}  &lt;/pre&gt;
&lt;p&gt;Dolayısıyla sadece static &amp;uuml;yeler i&amp;ccedil;erecek bir sınıfın t&amp;uuml;retme işlemi i&amp;ccedil;in kullanılmasınıda bir şekilde &amp;ouml;nlemek isteyebiliriz. Bu durumda sealed anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; yardımıyla, ilgili sınıfın t&amp;uuml;retme amacıyla kullanılamayacağını belirtiriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public sealed class TemelAritmetik&lt;/pre&gt;
&lt;p&gt;Bu sadece static &amp;uuml;yeler i&amp;ccedil;eren, t&amp;uuml;retilmeye izin vermeyen ve nesne &amp;ouml;rneğini kesin olarak oluşturtmak istemediğimiz bir sınıf i&amp;ccedil;in acaba yeterli midir? sealed olarak tanımlanmış sınıflar her ne kadar t&amp;uuml;retme amacıyla kullanılamasada, public erişim belirleyicisine sahip yapıcı metodları nedeni ile &amp;ouml;rneklendirilebilirler. Bize biraz daha zorlayıcı, kesin kurallar sunacak yeni bir yapı C# 2.0 ile birlikte gelmektedir. C# 2.0 sınıfların static olarak tanımlanabilmesine izin vermektedir. Static sınıflar beraberinde bir takım kurallarıda getirir. Aşağıdaki kod par&amp;ccedil;ası C# 2.0 i&amp;ccedil;in &amp;ouml;rnek bir static sınıf tanımlamasını i&amp;ccedil;ermektedir. &amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Text;

namespace UsingStaticClasses
{
    public static class TemelAritmetik
    {
        public static double Toplam(double deger1,double deger2)
        {
            return deger1+deger2;
        }
        public static double pi = 3.14;
        public static double PI
        {
            get
            {
                return pi;
            }
            set
            {
                pi = value;
            }
        }
    }

    class Program
    {
        static void Main(string[] args)
        {
            double sonuc=TemelAritmetik.Toplam(3, 5);
            Console.WriteLine(sonuc);
            Console.WriteLine(TemelAritmetik.pi);
            TemelAritmetik.PI = 3;
            Console.WriteLine(TemelAritmetik.PI);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rneğimizde i&amp;ccedil;eriğinide static olarak tanımlanmış metod, field ve &amp;ouml;zellik bulunan bir sınıf g&amp;ouml;rmektesiniz. Bu sınıfın bir &amp;ouml;nceki versiyona g&amp;ouml;re en &amp;ouml;nemli &amp;ouml;zelliği static olarak tanımlanabiliyor oluşudur. Peki bu sınıfın static olarak tanımlanmasını getirdiği kısıtlamalar nelerdir? İlk olarak bu sınıfa ait bir nesne &amp;ouml;rneği oluşturmaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;TemelAritmetik ta;
TemelAritmetik tAritmetik = new TemelAritmetik();&lt;/pre&gt;
&lt;p&gt;Bu tip bir kod yazımına Visual Studio.2005 zaten intellisense &amp;ouml;zelliği yardımıyla izin vermeyecektir. Lakin tAritmetik isimli nesne &amp;ouml;rneğini new operat&amp;ouml;r&amp;uuml; ile oluşturmaya &amp;ccedil;alıştığımızda TemelAritmetik sınıfının adının listeye gelmediğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk124_1.gif" alt="" width="452" height="192" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Diğer yandan kodu derlediğimizde aşağıdaki hataları alırız. Toplam 3 hatamız vardır. İlk satır i&amp;ccedil;in verilen hatadan static olarak tanımlanmış bir sınıfa ait nesne tanımlaması yapamadığımızı anlayabiliriz. Diğer yandan, ikinci satırda static sınıfa ait nesne &amp;ouml;rneğinin oluşturulamayacağı ve aynı zamanda tanımlanamayacağına dair hata mesajlarını alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk124_2.gif" alt="" width="486" height="299" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Buradan şu sonu&amp;ccedil;lara varabiliriz;&lt;/p&gt;
&lt;table id="table8" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;em&gt;Static olarak tanımlanmış sınıflara ait nesne &amp;ouml;rneklerini &amp;uuml;retemeyiz. Ayrıca static sınıflara ait nesne tanımlamalarını da yapamayız.&lt;/em&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Static sınıfların sınırlamaları sadece bunlarla sınırlı değildir. Şimdi yukarıdaki static sınıfımıza aşağıda olduğu gibi static olmayan bir ka&amp;ccedil; yeni &amp;uuml;ye daha ekleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public static class TemelAritmetik
{
    public TemelAritmetik()
    {
    }
    private int e;
    protected void BilgiVer()
    {
        // Bir takım kodlar.
    }

    public static double Toplam(double deger1,double deger2)
    {
        return deger1+deger2;
    }
    public static double pi = 3.14;
    public static double PI
    {
        get
        {
            return pi;
        }
        set
        {
            pi = value;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Kaynak kodumuzu derlediğimizde 4 adet derleme zamanı hatası alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk124_3.gif" alt="" width="609" height="503" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İlk hatamız static sınıf i&amp;ccedil;erisinde varsayılan yapıcı(default construcor) metod tanımlamaya &amp;ccedil;alışmaktır. Dilerseniz varsayılan yapıcı metodu aşırı y&amp;uuml;kleyerek başka versiyonları ile de aynı uygulamayı derlemeyi deneyebilirsiniz. Sonu&amp;ccedil; hep aynı olacaktır. Elbette doğal olarak yapıcı metodları static olarak tanımlamaya &amp;ccedil;alışabiliriz ki bu zaten izin verilmeyen bir durumdur.&amp;nbsp;&lt;/p&gt;
&lt;table id="table10" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;em&gt;Static olarak tanımlanmış sınıflar yapıcı metodları (varsayılan yapıcı ve aşırı y&amp;uuml;klenmiş versiyonları) i&amp;ccedil;eremez.&lt;/em&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Diğer hatalarımız ise, static sınıf i&amp;ccedil;erisinde static olmayan &amp;uuml;yeler tanımlamaya &amp;ccedil;alışmamızdır. Buradan da şu sonuca varabiliriz.&amp;nbsp;&lt;/p&gt;
&lt;table id="table11" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;em&gt;Static olarak tanımlanmış sınıflar sadece static &amp;uuml;yeler i&amp;ccedil;erebilir.&lt;/em&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;İncelememiz gereken bir diğer durum static sınıfların t&amp;uuml;retilip t&amp;uuml;retilemiyeceğidir. Aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public static class TemelAritmetik
{
    // Static sınıf kodlarımız
}

public class AltAritmetik : TemelAritmetik
{
}&lt;/pre&gt;
&lt;p&gt;Visual Studio.2005 her zamanki gibi bu tarz bir yazıma zaten izin vermeyecektir. Ancak elimizin altında visual studio gibi bir geliştirme ortamı olmadığını ve notepad gibi bir editor yardımıyla bu kodu yazdığımızı d&amp;uuml;ş&amp;uuml;necek olursak aşağıdaki hata mesajını alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk124_4.gif" alt="" width="640" height="436" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Buradan varacağımız sonu&amp;ccedil; ise,&amp;nbsp;&lt;/p&gt;
&lt;table id="table13" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;em&gt;Static olarak tanımlanmış sınıflardan &lt;u&gt;başka sınıflar&lt;/u&gt; t&amp;uuml;retilemez.&lt;/em&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Burada dikkate değer başka bir durum daha vardır. Static bir sınıftan başka bir sınıfı t&amp;uuml;retemeyiz. Peki static sınıfı başka bir sınıftan t&amp;uuml;retebilir miyiz? Cevap basit;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk124_5.gif" alt="" width="625" height="444" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Ancak bu durum static sınıflarında mutlaka object sınıfından t&amp;uuml;rediği ger&amp;ccedil;eğini değiştirmez. Her ne kadar static bir sınıfı başka bir sınıftan t&amp;uuml;retemessekte onun object sınıfından t&amp;uuml;rediği kesindir. Hata mesajımızda zaten bu durumu bize ispatlamaktadır. Bu noktada aklımıza kurnazca bir teknik gelebilir. Static bir sınıfı başka bir static sınıftan t&amp;uuml;retmeyi deneyebiliriz. Bu tarz bir kodu denediğimizde aşağıdaki hata mesajlarını alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk124_6.gif" alt="" width="590" height="464" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re şu sonuca varabiliriz;&amp;nbsp;&lt;/p&gt;
&lt;table id="table14" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;em&gt;Static olarak tanımlanmış sınıflardan &lt;u&gt;başka static sınıflar da&lt;/u&gt; t&amp;uuml;retilemez.&lt;/em&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Static olarak tanımlanmış sınıfların sadece static &amp;uuml;yeler i&amp;ccedil;ereceği kesin olmasına rağmen, &amp;uuml;yelerinin static anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; ile tanımlanıyor olması biraz tuhaf bir durum olarak g&amp;ouml;r&amp;uuml;lebilir. &amp;Ouml;yleki izlediğim bir iki blog sitesinde bu durum biraz alaycı ifadeler ile komik olarak ele alınmış. Tabi şu anda test ettiğimiz static class' ların beta 2 s&amp;uuml;r&amp;uuml;m&amp;uuml;ne ait olduğu d&amp;uuml;ş&amp;uuml;n&amp;uuml;lecek olursa piyasaya &amp;ccedil;ıkacak olan s&amp;uuml;r&amp;uuml;mde bu durum &amp;uuml;zerinde iyileştirmeler yapılabilir.&lt;/p&gt;
&lt;p&gt;Durumu &amp;ouml;zetleyecek olursak, &lt;em&gt;&lt;strong&gt;sadece static &amp;uuml;yeler i&amp;ccedil;ermesini d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z, &amp;ouml;rneklenmesini ve t&amp;uuml;retilmesini kesinlikle istemediğimiz sınıfların&lt;/strong&gt;&lt;/em&gt; tanımlanabilmesi i&amp;ccedil;in static anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml; sınıflar i&amp;ccedil;in kullanabiliriz. Bu d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z tasarım modelinin uygulamamız i&amp;ccedil;in yeterli olacaktır. Geldik bir makalemizin daha sonuna. Bu makalemizde C# 2.0' a gelen yeni &amp;ouml;zelliklerden brisi olan static sınıfları incelemeye &amp;ccedil;alıştık. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2005-06-20 12:00:00</pubDate>
  <slug>C#-2-0-ve-Static-Sınıflar-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#-2</tag>
    <tag>static</tag>
    <tag>static-class</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>