<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>DataTable Sınıfını Kullanarak Programatik Olarak Tablolar Oluşturmak-1</title>
  <description>Bugünkü makalemizde bağlantısız katmanın önemli bir sınıfı olan DataTable nesnesini bir açıdan incelemeye çalışacağız. Bilindiği gibi DataTable sınıfından türetilen bir nesne, bir tabloyu ve elemanlarını bellekte temsil etmek için kullanılmaktadır. DataTable sınıfı bellekte temsil ettiği tablolara ait olan satırları Rows koleksiyonuna ait DataRow nesneleri ile temsil ederken, tabloun alanlarını ise, Columns koleksiyonuna ait DataColumn nesneleri ile temsil etmektedir.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde bağlantısız katmanın &amp;ouml;nemli bir sınıfı olan DataTable nesnesini bir a&amp;ccedil;ıdan incelemeye &amp;ccedil;alışacağız. Bilindiği gibi DataTable sınıfından t&amp;uuml;retilen bir nesne, bir tabloyu ve elemanlarını bellekte temsil etmek i&amp;ccedil;in kullanılmaktadır. DataTable sınıfı bellekte temsil ettiği tablolara ait olan satırları Rows koleksiyonuna ait DataRow nesneleri ile temsil ederken, tabloun alanlarını ise, Columns koleksiyonuna ait DataColumn nesneleri ile temsil etmektedir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek uygulamamızda bu sınıf nesnelerini detaylı olarak kullanacağız. Diğer yandan DataTable sınıfı bir tabloya ilişkin kıstasların yer aldığı Constraints koleksiyonuna ait Constraint nesnelerinedee sahiptir. DataTable sınıfının ve &amp;uuml;ye elemanlarını aşağıdaki şekilde daha kolayca canlandırabiliriz. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk13_1.gif" alt="" width="270" height="359" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1 DataTable mimarisi&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Geliştireceğimiz uygulamada, bizim belirlediğimiz alanlardan oluşan bir tabloyu bellekte oluşturmaya &amp;ccedil;alışacağız. &amp;Ouml;ncelikle DataTable nesnesi ile bir tablo oluşturmak i&amp;ccedil;in aşağıdaki adımları takip etmeliyiz. &amp;nbsp;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Bir DataTable nesnesi oluşturup DataTable&amp;rsquo;ın bellekte temsil edeceği tablo i&amp;ccedil;in bir isim belirlenir.&lt;/li&gt;
&lt;li&gt;Tablomuzun i&amp;ccedil;ereceği alanların isimleri, veri t&amp;uuml;rleri belirlenerek birer DataRow nesnesi şeklinde, DataTable nesnesinin Columns koleksiyonuna eklenir.&lt;/li&gt;
&lt;li&gt;Tablomuz i&amp;ccedil;in bir primary key alanı belirlenir.&amp;nbsp;&amp;nbsp;&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;Bu adımların ardından tablomuz bellekte oluşturulmuş olucaktır. Bu noktadan sonra bu tablo &amp;uuml;zerinde dilediğimiz işlemleri yapabiliriz. Kayıt ekleyebilir, silebilir, sorgulayabiliriz. Ama tabiki programı kapattığımızda bellekteki tablonun yerinde yeller esiyor olucaktır. Ama &amp;uuml;z&amp;uuml;lmeyin ilerliyen makalelerimizde SQL-DMO komutları yardımıyla programımız i&amp;ccedil;inden bir sql sunucusu &amp;uuml;zerinde veritabanı oluşturacak ve tablomuzu buraya ekleyeceğiz.Şimdi dilerseniz birinci adımdan itibaren bu işlerin nasıl yapıldığını minik &amp;ouml;rnekler ile inceleyelim ve daha sonrada asıl uygulamamaızı yazalım. &amp;Ouml;ncelikle işe tablomuzu bellekte temsil edicek datatable nesnesi oluşturarak başlayalım. Aşağıdaki k&amp;uuml;&amp;ccedil;&amp;uuml;k uygulamayı oluşturalım.&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&amp;nbsp;&lt;img src="/makale/images/mk13_2.gif" alt="" width="360" height="168" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&amp;nbsp;Şekil 2. Formun ilk hali&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Ve kodlar,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnTabloOlustur_Click(object sender, System.EventArgs e)
{
            /* Bir tabloyu bellekte temsil edicek bir datatable nesnesi oluşturarak işe başlıyoruz. Tablomuza txtTabloAdi isimli TextBox'a giriline değeri isim olarak veriyoruz */
            DataTable dt=new DataTable(txtTabloAdi.Text);
            MessageBox.Show(dt.TableName.ToString()+" TABLOSU BELLEKTE OLUŞTURULDU");
} &lt;/pre&gt;
&lt;p&gt;Şimdi programımızı &amp;ccedil;alıştıralım ve tablo ismi olarak DENEME diyelim. İşte sonu&amp;ccedil;,&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;img src="/makale/images/mk13_3.gif" alt="" width="360" height="208" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. DataTable nesnesi oluşturuldu.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdi ise tablomuza nasıl field(alan) ekleyeceğimize bakalım. &amp;Ouml;nceden bahsettiğimiz gibi tablonun alanları aslında DataTable sınıfının Columns koleksiyonuna ait birer DataColumn nesnesidir. Dolayısıyla &amp;ouml;ncelikle bir DataRow nesnesi oluşturup bu nesneyi ilgili DataTable&amp;rsquo;ın Columns koleksiyonuna eklememiz gerekmektedir. Alanın ismi dışında tabiki veri t&amp;uuml;r&amp;uuml;n&amp;uuml;de belirtmeliyiz. Bu veri t&amp;uuml;rlerini belirtirken Type.GetType syntaxı kullanılır. Formumuzu biraz değiştirelim. Kullanıcı belirlediği isimde ve t&amp;uuml;rdeki alanı, tabloya ekleyebilecek olsun. S&amp;ouml;ylemek isterimki bu uygulamada hi&amp;ccedil; bir kontrol mekanizması uygulanmamış ve hataların &amp;ouml;n&amp;uuml;nce ge&amp;ccedil;ilmeye &amp;ccedil;alışılmamıştır. Nitekim amacımız DataTable ile bir tablonun nasıl oluşturulacağına dair basit bir &amp;ouml;rnek vermektir. Formumuzu aşağıdaki gibi değiştirelim. Kullanıcı bir tablo adı girip oluşturduktan sonra istediği alanları ekleyecek ve bu bilgiler listbox nesnemizde kullanıcıya ayrıca g&amp;ouml;sterilecek. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;img src="/makale/images/mk13_4.gif" alt="" width="464" height="328" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&amp;nbsp;Şekil 4. Formumuzun yeni hali.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdide kodlarımızı g&amp;ouml;relim. &amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;DataTable dt; /* DataTable nesnemizi uygulama boyunca kullanabilmek i&amp;ccedil;in t&amp;uuml;m metodların dışında tanımladık. */&amp;nbsp;

private void btnTabloOlustur_Click(object sender, System.EventArgs e)
{
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; dt=new DataTable(txtTabloAdi.Text);
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; MessageBox.Show(dt.TableName.ToString()+" TABLOSU BELLEKTE OLUŞTURULDU");
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; lblTabloAdi.Text=dt.TableName.ToString(); /* TableName &amp;ouml;zelliği DataTable nesnesinin bellekte temsil ettiği tablonun adını vermektedir.*/
}

private void btnAlanEkle_Click(object sender, System.EventArgs e)
{
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; /*&amp;Ouml;nce yeni alanımız i&amp;ccedil;in bir DataColumn nesnesi oluşturulur*/
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; DataColumn dc=new DataColumn();
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; /*Şimdi ise DataTable nesnemizin Columns koleksiyonuna oluşturulan alanımızı ekliyoruz. İlk parametre, alanın adını temsil ederken, ikinci parametre ise alanın veri t&amp;uuml;r&amp;uuml;n&amp;uuml; belirtmektedir. Add metodu bu &amp;ouml;zellikleri ile oluşturulan DataColumn nesnesini dataTable'a ekler. Bu sayede tabloda alanımız oluşturulmuş olur.*/
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; dt.Columns.Add(txtAlanAdi.Text,Type.GetType("System."+cmbAlanTuru.Text));
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; lstAlanlar.Items.Add("Alan Adı: "+dt.Columns[txtAlanAdi.Text].ColumnName.ToString()+" Veri Tipi: "+dt.Columns[txtAlanAdi.Text].DataType.ToString());&amp;nbsp;

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; /* ColumnName &amp;ouml;zelliği ile eklenen alanın adını, DataType &amp;ouml;zelliği ilede bu alanın veri t&amp;uuml;r&amp;uuml;n&amp;uuml; &amp;ouml;ğreniyoruz.*/
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı deneyelim. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk13_5.gif" alt="" width="464" height="328" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 5. Alanlarımızıda tabloya ekleyelim.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Alanlara veri t&amp;uuml;rlerini aktarırken kullanabileceğimiz diğer &amp;ouml;rnek değerler aşağıdaki gibidir; bunlar listbox kontrol&amp;uuml;ne desing time(tasarım zamanında) eklenmiştir. &amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;System.Int32
System.Int16
System.Int64
System.Byte
System.Char
System.Single
System.Decimal
System.Double&lt;/pre&gt;
&lt;p&gt;Gibi... &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdi de se&amp;ccedil;tiğimiz bir alanı primary key olarak belirleyelim. Unique (benzersiz) integer değerler alıcak bir alan olsun bu ve 1000 den başlayarak 1&amp;rsquo;er 1&amp;rsquo;er otomatik olarak artsın. Bildiğini ID alanlarından bahsediyorum. Bunu kullanıcıya sormadan otomatik olarak biz yaratalım ve konudan fazlaca uzaklaşmayalım. Sadece btnTabloOlustur&amp;rsquo;un kodlarına ekleme yapıyoruz. &amp;nbsp;&amp;nbsp;&lt;/p&gt;
&lt;div&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnTabloOlustur_Click(object sender, System.EventArgs e)
{
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; dt=new DataTable(txtTabloAdi.Text);
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; MessageBox.Show(dt.TableName.ToString()+" TABLOSU BELLEKTE OLUŞTURULDU");
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; lblTabloAdi.Text=dt.TableName.ToString(); /* TableName &amp;ouml;zelliği DataTable nesnesinin bellekte temsil ettiği tablonun adını vermektedir.*/&amp;nbsp;
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; /* Tablo oluşturulduğunda otomatik olarak bir ID alanı ekleyelim. Bu alan benzersiz bir alan olucak yani i&amp;ccedil;erdiği veriler tekrar etmiyecek. 1 den başlayarak birer birer otomatik olarak artıcak. Aynı zamanda primary key olucak. Primary key olduğu zaman arama gibi işlemleri yaparken bu alanı kullanacağız.*/&amp;nbsp;
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; DataColumn dcID=new
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; DataColumn(); /* DataColumn nesnesi oluşturulur.*/
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; dcID.ColumnName="ID"; /* Alanın adı veriliyor*./
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; cID.DataType=Type.GetType("System.Int32"); /* Alanın veritipi belirleniyor*/
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; dcID.Unique=true;/* Alanın i&amp;ccedil;erdiği verilerin tekrar etmeyeceği s&amp;ouml;yleniyor.*/
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; dcID.AutoIncrement=true;/* Alanın değerlerinin otomatik olarak artacağı s&amp;ouml;yleniyor.*/
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; dcID.AutoIncrementSeed=1;/* İlk değeri 1 olucak.*/
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; dcID.AutoIncrementStep=1;/* Alanın değerleri 1'er artıcak.*/
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; dt.Columns.Add(dcID);/* Yukarıda &amp;ouml;zellikleri belirtilen ID alanı tablomuza ekleniyor. */&amp;nbsp;
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; /* Aşağıdaki kod satırları ile ID isimli alanı Primary Key olarak belirliyoruz. */
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; DataColumn[] anahtarlar=new&amp;nbsp; DataColumn[1];
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; anahtarlar[0]=dt.Columns["ID"];
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; dt.PrimaryKey=anahtarlar;&amp;nbsp;
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; lstAlanlar.Items.Add(dt.Columns["ID"].ColumnName.ToString()+" Primary Key");&amp;nbsp;
} &amp;nbsp;&lt;/pre&gt;
&lt;p&gt;Geldik bir makalemizin daha sonuna. Bir sonraki makalemizde oluşturduğumuz bu tabloya nasıl veri ekleneceğini g&amp;ouml;receğimiz &amp;ccedil;ok kısa bir uygulama yazacağız. Hepinizi mutlu g&amp;uuml;nler dilerim. &amp;nbsp;&lt;/p&gt;
&lt;/div&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;</content>
  <pubDate>2003-12-04 12:00:00</pubDate>
  <slug>DataTable-Sc4b1nc4b1fc4b1nc4b1-Kullanarak-Programatik-Olarak-Tablolar-Olusturmak-1-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>datatable</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>