<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>LINQ Maceralarım</title>
  <description>Language INtegrated Query(LINQ) mimarisi sayesinde CLR nesneleri(Common Language Runtime Objects) üzerinden SQL tarzı sorgu ifadeleri yazılabilmektedir. Hatta LINQ mimarisi, SQL veritabanı(LINQ to SQL) ve XML (LINQ to XML) kaynakları üzerindede kullanılabilmektedir. Özellikle IEnumerable&lt;T&gt; arayüzünü uyarlayan tiplere ait nesne örnekleri için, Select, Where, GroupBy, Sum, Avg, Distinct ve daha pek çok bilinen sorgulama metodu uygulanabilmektedir.</description>
  <content>&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Değerli Okurlarım Merhabalar,&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Language INtegrated Query(LINQ)&lt;/strong&gt; mimarisi sayesinde &lt;strong&gt;CLR&lt;/strong&gt; &lt;strong&gt;nesneleri(Common Language Runtime Objects)&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;SQL&lt;/strong&gt; tarzı sorgu ifadeleri yazılabilmektedir. Hatta &lt;strong&gt;LINQ&lt;/strong&gt; mimarisi, &lt;strong&gt;SQL&lt;/strong&gt; veritabanı(LINQ to SQL) ve &lt;strong&gt;XML&lt;/strong&gt; (LINQ to XML) kaynakları &amp;uuml;zerindede kullanılabilmektedir. &amp;Ouml;zellikle &lt;strong&gt;IEnumerable&amp;lt;T&amp;gt; &lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; uyarlayan tiplere ait nesne &amp;ouml;rnekleri i&amp;ccedil;in, &lt;strong&gt;Select&lt;/strong&gt;, &lt;strong&gt; Where&lt;/strong&gt;, &lt;strong&gt;GroupBy&lt;/strong&gt;, &lt;strong&gt;Sum&lt;/strong&gt;, &lt;strong&gt;Avg, Distinct&lt;/strong&gt; ve daha pek &amp;ccedil;ok bilinen sorgulama metodu uygulanabilmektedir. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;LINQ&lt;/strong&gt; i&amp;ccedil;erisinde yer alan imkanlar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında, &lt;strong&gt;.Net Framework 1.1&lt;/strong&gt;, &lt;strong&gt; 2.0 ve 3.0&lt;/strong&gt; ile geliştirilmiş pek &amp;ccedil;ok projenin &lt;strong&gt;.Net 3.5&lt;/strong&gt;' e aktarılarak bu olanaklardan yararlanabilmeleri i&amp;ccedil;in gerekli ge&amp;ccedil;iş hazırlıklarının ciddi anlamda d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;de ortadadır. &amp;Uuml;stelik &lt;strong&gt;Visual&lt;/strong&gt; &lt;strong&gt;Studio&lt;/strong&gt; &lt;strong&gt;2008&lt;/strong&gt;, getirdiği &amp;ccedil;oklu framework desteği sayesinde &lt;strong&gt;.Net Framework 2.0, 3.0&lt;/strong&gt; ve &lt;strong&gt;3.5&lt;/strong&gt; arasındaki ge&amp;ccedil;işlerin kolayca yapılabilmesini sağlamaktadır. Bu gibi konular g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında bir geliştirici olarak &lt;strong&gt;LINQ&lt;/strong&gt;' in daha &amp;ouml;nceki kod par&amp;ccedil;alarında kullanılabileceği yeni yerlerde merak konusu haline gelmektedir. İşte bu makalemizde, &lt;strong&gt;LINQ&lt;/strong&gt; sorgularını farklı kod par&amp;ccedil;alarında kullanmaya &amp;ccedil;alışıyor olacağız. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;LINQ&lt;/strong&gt; mimarisinin kullanılabileceği alanlar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında, &lt;strong&gt;Reflection(Yansıma), IO(Dosya giriş/&amp;ccedil;ıkış), Bağlantısız Katman(Disconnected Layer)&lt;/strong&gt; sadece bir ka&amp;ccedil; basit alan olarak &amp;ouml;n plana &amp;ccedil;ıkmaktadır. Ancak bu alanlar pek &amp;ccedil;ok uygulamada &amp;ouml;nemli g&amp;ouml;revler &amp;uuml;stlenmektedir. S&amp;ouml;z gelimi yansıma teknikleri ile &lt;strong&gt;IDE &lt;/strong&gt;geliştirilmesi(Visual Studio benzeri), &lt;strong&gt;Plug-In&lt;/strong&gt; tabanlı uygulamalar yazılması, &lt;strong&gt;nitelik(Attribute)&lt;/strong&gt; bazlı olacak şekilde &amp;ccedil;alışma ortamının organize edilmesi(&amp;ouml;zellikle deklerafit programlama tekniklerinde) gibi işlevsellikler &amp;ouml;n plana &amp;ccedil;ıkmaktadır. Dosyalama işlemleri en basit anlamda&lt;strong&gt; resim işleme programlarından&lt;/strong&gt;, &lt;strong&gt;XML&lt;/strong&gt; ayrıştırma uygulamalarına kadar pek &amp;ccedil;ok alanda kullanılmaktadır. &amp;Ccedil;ok doğal olarak &lt;strong&gt;Ado.Net&lt;/strong&gt; mimarisine g&amp;ouml;re geliştirilen pek &amp;ccedil;ok uygulamada &lt;strong&gt;bağlantısız katman&lt;/strong&gt; nesneleri g&amp;ouml;r&amp;uuml;lebilmektedir. Sadece bu konular bile g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında bazı kod ihtiya&amp;ccedil;ları i&amp;ccedil;in diziler, d&amp;ouml;ng&amp;uuml;ler ve koşullu ifadelerin &amp;ccedil;ok sık kullanıldığıda g&amp;ouml;ze &amp;ccedil;arpmaktadır. Ancak &lt;strong&gt;LINQ&lt;/strong&gt; sorguları sayesinde bu işlemler &amp;ccedil;ok daha basit bir şekilde ger&amp;ccedil;ekleştirilebilir. Elbetteki genişletme metodlarının &amp;uuml;stlendiği y&amp;uuml;k &amp;ccedil;er&amp;ccedil;evesinde s&amp;ouml;z konusu d&amp;ouml;ng&amp;uuml;lerin, koşullu ifadelerin ortadan kalkması gibi bir durum m&amp;uuml;mk&amp;uuml;n değildir. Ancak kodun &amp;ccedil;ok daha etkin bir şekilde ve bir sorgulama diline yatkın olaraktan geliştirilmesi &amp;ouml;nemli bir avantajdır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bilindiği gibi LINQ sorgularında yer alan anahtar kelimeler(keywords) aslında arka planda birer genişletme metoduna(Extension Methods) karşılık gelmektedir. Bu metodlar s&amp;ouml;z gelimi basit bir arama işlemi i&amp;ccedil;in gereken d&amp;ouml;ng&amp;uuml;sel veya koşullu ifadeleri kaps&amp;uuml;lleyerek geliştiricinin &amp;uuml;zerinden almaktadır. Bu sayede geliştirici SQL diline yatkın bir şekilde sorgular yazabilmekte ve kodun daha etkili, &amp;ouml;l&amp;ccedil;eklenebilir, anlaşılır bir şekilde geliştirilmesine odaklanabilmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Dilerseniz hi&amp;ccedil; vakit kaybetmeden &amp;ouml;rneklerimize başlayalım.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;İlk olarak dosyalama işlemlerini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alarak ilerleyebiliriz. S&amp;ouml;z gelimi, herhangibir klas&amp;ouml;r i&amp;ccedil;erisinde yer alan &lt;strong&gt;Jpg&lt;/strong&gt; uzantılı dosyalardan boyutu &lt;strong&gt;1000&lt;/strong&gt; &lt;strong&gt;kb&lt;/strong&gt; &amp;uuml;zerinde olanların tespit edilmesini istediğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu işlemi &lt;strong&gt;VS 2008&lt;/strong&gt; tabanlı bir &lt;strong&gt;Console&lt;/strong&gt; Uygulamasında aşağıdaki kod par&amp;ccedil;ası ile ger&amp;ccedil;ekleştirebiliriz.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;string klasorAdresi= @"C:\Documents and Settings\BurakSenyurt\My Documents\My Pictures\Google Pictures\";
DirectoryInfo dInfo = new DirectoryInfo(klasorAdresi);
var resimDosyalari = from fInfo in dInfo.GetFiles()
                                    where fInfo.Extension == ".jpg" &amp;amp;&amp;amp; fInfo.Length &amp;gt;= 1000 * 1024
                                        select new
                                                    {
                                                        fInfo.Name
                                                        ,fInfo.Length
                                                        ,fInfo.CreationTime
                                                    };
foreach (var dosya in resimDosyalari)
    Console.WriteLine(dosya);&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;DirectoryInfo&lt;/strong&gt; sınıfının &lt;strong&gt; GetFiles&lt;/strong&gt; metodu &lt;strong&gt;FileInfo&lt;/strong&gt; tipinden bir dizi d&amp;ouml;nd&amp;uuml;rmektedir. Bu dizi bir &lt;strong&gt;Array&lt;/strong&gt; tipi olduğu i&amp;ccedil;in &lt;strong&gt;LINQ&lt;/strong&gt; ile birlikte gelen &lt;strong&gt; genişletme metodlarını(Extension Methods)&lt;/strong&gt; kullanabilmektedir. Dolayısıyla &lt;strong&gt;LINQ&lt;/strong&gt; ifadesi i&amp;ccedil;erisinde &lt;strong&gt;from&lt;/strong&gt;, &lt;strong&gt;select&lt;/strong&gt;, &lt;strong&gt;where&lt;/strong&gt; gibi anahtar kelimeler kolay bir şekilde ele alınabilmektedir. &lt;strong&gt;FileInfo&lt;/strong&gt; dizisi &amp;uuml;zerinden &lt;strong&gt;dosya uzantısı(Extension) .jpg &lt;/strong&gt;ve &lt;strong&gt;uzunluğu(Length) 1000 Kb&lt;/strong&gt; &lt;strong&gt; &amp;uuml;zerinde&lt;/strong&gt; &lt;strong&gt;olanlar&lt;/strong&gt; tespit edilirken aynı zamanda &lt;strong&gt;isimsiz bir tip(Anonymous Type)&lt;/strong&gt; &amp;uuml;retimide ger&amp;ccedil;ekleştirilmekte ve ilgili dosya i&amp;ccedil;in &lt;strong&gt;ad(Name), uzunluk(Length) &lt;/strong&gt;ve &lt;strong&gt;oluşturulma zamanı(CreationTime) &lt;/strong&gt;bilgilerinin yer aldığı yeni bir nesne &amp;ouml;rneği oluşturulmaktadır. Program kodunun &amp;ccedil;ıktısı &amp;ouml;rnek klas&amp;ouml;r i&amp;ccedil;in aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk248_1.gif" alt="" width="588" height="331" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Eğlenceli değil mi? &amp;Ouml;yleyse devam edelim. Diyelimki dosyalama işlemleri ile ilgili olaraktan ş&amp;ouml;yle bir ihtiyacımız oldu;Bir klas&amp;ouml;r i&amp;ccedil;erisindeki dosyaları &lt;strong&gt;tiplerine g&amp;ouml;re gruplayıp,&lt;/strong&gt; &lt;strong&gt;her grup i&amp;ccedil;erisinde ka&amp;ccedil;ar adet dosya&lt;/strong&gt; bulunduğunu &amp;ouml;ğrenmek istiyoruz. Bu kodun &lt;strong&gt;LINQ&lt;/strong&gt; ifadesini yazmadan &amp;ouml;nce, &lt;strong&gt; LINQ olmada&lt;/strong&gt;n nasıl geliştirilebileceğini d&amp;uuml;ş&amp;uuml;nmenizi &amp;ouml;neririm. LINQ ile bu sorgu aşağıdaki kod par&amp;ccedil;asında olduğu gibi ger&amp;ccedil;ekleştirilebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;string adres = @"C:\Windows\";
DirectoryInfo dInfo = new DirectoryInfo(adres);
var dosyaGruplari = from fInfo in dInfo.GetFiles()
                                    group fInfo by fInfo.Extension into grp
                                        select new
                                                    {
                                                        Uzanti = grp.Key,
                                                        Toplam = grp.Count()
                                                    };

foreach (var dosyaGrubu in dosyaGruplari)
    Console.WriteLine(dosyaGrubu.ToString());&lt;/pre&gt;
&lt;p&gt;Bu seferki &lt;strong&gt;LINQ&lt;/strong&gt; ifadesinde &lt;strong&gt; group&lt;/strong&gt; &lt;strong&gt;by&lt;/strong&gt; kullanımı s&amp;ouml;z konusudur. Group By sayesinde aynen &lt;strong&gt; SQL&lt;/strong&gt;' de olduğu gibi gruplama işlemi nesneler &amp;uuml;zerinde yapılabilmektedir. &amp;Ouml;rnekte &lt;strong&gt;Windows&lt;/strong&gt; klas&amp;ouml;r&amp;uuml; altındaki dosyalar &lt;strong&gt; FileInfo&lt;/strong&gt; tipinin &lt;strong&gt;Extension&lt;/strong&gt; &amp;ouml;zelliğine g&amp;ouml;re gruplanmaktadır. Sonrasında ise gruplanan koleksiyon &amp;uuml;zerinden &lt;strong&gt;Count&lt;/strong&gt; genişletme metodu kullanılmakta ve her bir tip grubu i&amp;ccedil;in ka&amp;ccedil;ar dosya olduğu hesaplanmaktadır. İlk &amp;ouml;rnekte olduğu gibi yine&lt;strong&gt; isimsiz tip(Anonymous Type)&lt;/strong&gt; kullanılarak dosya grubuna ait uzantı ve toplam dosya sayısı bilgileri elde edilmektedir. Sonu&amp;ccedil; olarak uygulamanın ekran &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk248_2.gif" alt="" width="255" height="282" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Şimdide herhangibir klas&amp;ouml;rdeki &lt;strong&gt;jpg&lt;/strong&gt; uzantılı dosyalardan &lt;strong&gt;L&lt;/strong&gt; &lt;strong&gt;harfi&lt;/strong&gt; &lt;strong&gt;ile&lt;/strong&gt; &lt;strong&gt;başlayanları&lt;/strong&gt; &lt;strong&gt;boyutlarına&lt;/strong&gt; g&amp;ouml;re &lt;strong&gt;tersten&lt;/strong&gt; &lt;strong&gt;sıralayarak&lt;/strong&gt; elde etmek istediğimizi d&amp;uuml;ş&amp;uuml;nelim. &lt;strong&gt;LINQ&lt;/strong&gt; kullanmadığımız takdirde bize en &amp;ccedil;ok sorun &amp;ccedil;ıkartacak noktalardan biriside &lt;strong&gt;tersten&lt;/strong&gt; &lt;strong&gt;sıralama&lt;/strong&gt; işlemi olacaktır. Bunu sağlamak i&amp;ccedil;in doğal olarak &lt;strong&gt;FileInfo&lt;/strong&gt; dizisi &amp;uuml;zerinden ters sıralama algoritması uygulanması gerekir. Oysaki LINQ ifadeleri ile bu işlem i&amp;ccedil;in gerekli kod par&amp;ccedil;ası aşağıdaki gibi kolayca geliştirilebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;string klasorAdresi = @"C:\Documents and Settings\BurakSenyurt\My Documents\My Pictures\Google Pictures\";
DirectoryInfo dInfo = new DirectoryInfo(klasorAdresi);

var dosyalar=from fInfo in dInfo.GetFiles()
                        where fInfo.Extension==".jpg" &amp;amp;&amp;amp; fInfo.Name[0]=='L'
                            orderby fInfo.Length descending
                                select new 
                                                {
                                                    fInfo.Name,
                                                    fInfo.Length
                                                };

foreach (var dosya in dosyalar)
    Console.WriteLine("{0} \t{1}",dosya.Length,dosya.Name);&lt;/pre&gt;
&lt;p&gt;Bu kez &lt;strong&gt;orderby&lt;/strong&gt; anahtar kelimesi(ki bu arka planda &lt;strong&gt;OrderBy&lt;/strong&gt; genişletme metoduna d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmektedir) kullanılarak dosyaların boyutlarına g&amp;ouml;re tersten sıralanması sağlanmıştır. Sonu&amp;ccedil; olarak kodun ekran &amp;ccedil;ıktısı aşağıdakine benzer olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk248_3.gif" alt="" width="440" height="274" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;LINQ&lt;/strong&gt; sorguları dosyalama işlemleri dışında &amp;ouml;zellikle &lt;strong&gt;reflection(yansıma)&lt;/strong&gt; tarafındada etkili bir şekilde kullanılabilir. Yazımızın bundan sonraki kısmındada yansıma teknikleri i&amp;ccedil;erisinde &lt;strong&gt;LINQ&lt;/strong&gt; ifadelerini &amp;ouml;rnekler &amp;uuml;zerinde ele almaya &amp;ccedil;alışacağız. &amp;Ouml;ncelikli olarak &lt;strong&gt;Process&lt;/strong&gt;' lerden başlamak taraftarıyım. Bilindiği &amp;uuml;zere &lt;strong&gt;.Net&lt;/strong&gt; uygulamaları sistem &amp;uuml;zerinde a&amp;ccedil;ılan &lt;strong&gt;Process&lt;/strong&gt;' ler i&amp;ccedil;erisinde ayrı &lt;strong&gt;uygulama alanları(Application Domains)&lt;/strong&gt; altına dahil edilirler. Hatta bu uygulama alanları kendi i&amp;ccedil;lerinde, birden fazla&lt;em&gt;(en az bir tane olmak &amp;uuml;zere)&lt;/em&gt; &lt;strong&gt;Thread&lt;/strong&gt;' ede sahip olabilirler. Sistem &amp;uuml;zerinde &lt;strong&gt; &amp;ccedil;alışan&lt;/strong&gt; &lt;strong&gt;Process&lt;/strong&gt;' lerin yada o anda &amp;ccedil;alışmakta olan &lt;strong&gt;g&amp;uuml;ncel&lt;/strong&gt; &lt;strong&gt;Process&lt;/strong&gt;' in bilgilerini almak i&amp;ccedil;in &lt;strong&gt;Process&lt;/strong&gt; sınıfının farklı metodları bulunmaktadır. Bizimde aklımıza gelen soru şudur; acaba &lt;strong&gt;sistem &amp;uuml;zerinde &amp;ccedil;alışmakta olan Process' ler&lt;/strong&gt; &lt;strong&gt;i&amp;ccedil;erisinde&lt;/strong&gt; sadece &lt;strong&gt;tek bir Thread' e sahip olanlar&lt;/strong&gt; hangileridir. Nitekim bilindiği &amp;uuml;zere bazı Process' ler kendi i&amp;ccedil;lerinde birden fazla Thread i&amp;ccedil;ermektedir. Bu ama&amp;ccedil;la aşağıdaki gibi bir kod par&amp;ccedil;ası geliştirilebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var processes = from prc in Process.GetProcesses()
                            where prc.Threads.Count == 1
                                orderby prc.ProcessName descending
                                    select new
                                                {
                                                    prc.ProcessName
                                                    , prc.PagedMemorySize64
                                                };
foreach (var process in processes)
    Console.WriteLine(process.ToString());&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Process&lt;/strong&gt; sınıfının &lt;strong&gt;static&lt;/strong&gt; &lt;strong&gt;GetProcesses&lt;/strong&gt; metodu ile o anda sistemde &amp;ccedil;alışmakta olan &lt;strong&gt; Process&lt;/strong&gt;' ler elde edilmektedir. Sonrasında &lt;strong&gt;where&lt;/strong&gt; anahtar kelimesi ile &lt;strong&gt;Threads&lt;/strong&gt; &amp;ouml;zelliği &amp;uuml;zerinden &lt;strong&gt;Count&lt;/strong&gt; değeri kontrol edilir. &lt;strong&gt;1 olanlar adlarına(ProcessName) g&amp;ouml;re orderby &lt;/strong&gt; anahtar kelimesinden yararlanılarak &lt;strong&gt;tersten&lt;/strong&gt; &lt;strong&gt;sıralanacak&lt;/strong&gt; şekilde yeni bir isimsiz tip i&amp;ccedil;erisinde toplanırlar. Bu &lt;strong&gt;isimsiz tip(Anonymous Type)&lt;/strong&gt; &amp;ouml;rnek olarak&lt;strong&gt; Process&lt;/strong&gt;' in &lt;strong&gt; adı(ProcessName)&lt;/strong&gt; ve &lt;strong&gt;sayfalanmış&lt;/strong&gt; &lt;strong&gt;bellek boyutu(PagedMemorySize64)&lt;/strong&gt; değerlerini i&amp;ccedil;ermektedir. Sonu&amp;ccedil; olarak kodun &amp;ccedil;ıktısı, &amp;ccedil;alışılan sistem &amp;uuml;zerinde aşağıdaki gibi olmuştur.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk248_4.gif" alt="" width="429" height="133" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Reflection&lt;/strong&gt; ile başlamışken hızımızı kesmeyelim ve yeni bir sorgu ile devam edelim. Bu kez ş&amp;ouml;yle bir ihtiyacımız var; bir assembly' ın &lt;strong&gt;referans ettiği assmebly' lar&lt;/strong&gt; i&amp;ccedil;erisinden &lt;strong&gt;versiyonu .Net Framework 2.0&lt;/strong&gt; &lt;strong&gt;olmayanları&lt;/strong&gt; bulmak istiyoruz. Bu tip bir durumda var olan &lt;strong&gt;Assembly&lt;/strong&gt;' ın y&amp;uuml;klenmesi ve referans ettiği &lt;strong&gt;Assembly&lt;/strong&gt;' ların &lt;strong&gt; GetReferencedAssemblies&lt;/strong&gt; metodu ile &amp;ccedil;ekilmesi gerekir. Ne tesad&amp;uuml;ft&amp;uuml;rki &lt;strong&gt;GetReferencedAssemblies&lt;/strong&gt; metodu&lt;strong&gt; AssemblyName&lt;/strong&gt; tipinden bir dizi d&amp;ouml;nd&amp;uuml;rmektedir. Dolayısıyla bu dizi &amp;uuml;zerinden &lt;strong&gt;LINQ&lt;/strong&gt; ifadeleri kullanılabilmesi olasıdır. S&amp;ouml;z konusu ihtiya&amp;ccedil; i&amp;ccedil;in aşağıdaki gibi bir kod par&amp;ccedil;ası d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;AssemblyName[] result1 = Assembly.LoadFrom(@"C:\WINDOWS\Microsoft.NET\Framework\v2.0.50727\System.EnterpriseServices.dll")
.GetReferencedAssemblies();
var framework2Olmayanlar = from asmb in result1
                                                where asmb.Version != new Version(2, 0, 0, 0)
                                                    select new
                                                                {
                                                                    AssemblyAdi = asmb.FullName
                                                                    ,IslemciMimarisi = asmb.ProcessorArchitecture
                                                                    ,HashAlgoritması = asmb.HashAlgorithm
                                                                };

foreach (var a in framework2Olmayanlar)
    Console.WriteLine(a.ToString());&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnek olarak &lt;strong&gt; System.EnterpriseServices.dll&lt;/strong&gt; assembly' ı kullanılmaktadır. Sorgu i&amp;ccedil;erisinde dikkat edilecek olursa &lt;strong&gt;GetReferencedAssemblies&lt;/strong&gt; metodu ile elde edilen sonu&amp;ccedil; k&amp;uuml;mesi &amp;uuml;zerinden &amp;ccedil;ekilen her bir &lt;strong&gt;AssemblyName&lt;/strong&gt; nesnesinin &lt;strong&gt;Version&lt;/strong&gt; &amp;ouml;zelliğine bakılmaktadır. Sonrasında ise yine bir &lt;strong&gt;isimsiz tip&lt;/strong&gt; kullanılarak sadece Assembly' ın &lt;strong&gt;adı(FullName)&lt;/strong&gt;, &lt;strong&gt;işlemci&lt;/strong&gt; &lt;strong&gt;mimarisi(ProcessorArchitecture)&lt;/strong&gt; ve &lt;strong&gt;hash&lt;/strong&gt; &lt;strong&gt; algoritması(HashAlgorithm)&lt;/strong&gt; değerleri toplanmaktadır. &amp;Ouml;rneğin ekran &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk248_5.gif" alt="" width="588" height="79" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;LINQ&lt;/strong&gt; sorguları i&amp;ccedil;erisinde bazı yerlerde &lt;strong&gt;harici&lt;/strong&gt; &lt;strong&gt;metodlarında&lt;/strong&gt; &amp;ccedil;ağırılması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. S&amp;ouml;z gelimi bir koşul kontrol&amp;uuml; i&amp;ccedil;in iterasyonun o andaki nesnesinin denetlenmesi gerektiği durumlarda harici metod &amp;ccedil;ağrıları gerekebilir. &amp;Ouml;rneğin &lt;strong&gt;dll&lt;/strong&gt; uzantılı dosyalar ile dolu bir klas&amp;ouml;r i&amp;ccedil;erisinde &lt;strong&gt; .Net Assembly&lt;/strong&gt;' ı olarak &lt;strong&gt;y&amp;uuml;klenebilenlerin&lt;/strong&gt; tespit edilmesini istediğimiz d&amp;uuml;ş&amp;uuml;nelim. B&amp;ouml;yle bir senaryoda &lt;strong&gt;Assembly&lt;/strong&gt; sınıfının &lt;strong&gt; static&lt;/strong&gt; &lt;strong&gt;LoadFrom&lt;/strong&gt; metodu olduk&amp;ccedil;a işe yarayacaktır. Nitekim s&amp;ouml;z konusu &lt;strong&gt;dll&lt;/strong&gt; herhangibir nedenle y&amp;uuml;klenebilen bir &lt;strong&gt;Assembly&lt;/strong&gt; değilse &lt;strong&gt;&amp;ccedil;alışma zamanı istisnası(Runtime Exception)&lt;/strong&gt; oluşacaktır. Aşağıdaki kod par&amp;ccedil;ası bu durumu analiz etmek i&amp;ccedil;in geliştirilmiştir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class Program
{
    static void Main(string[] args)
    { 
        string path = @"C:\WINDOWS\Microsoft.NET\Framework\v2.0.50727";
        DirectoryInfo klasor = new DirectoryInfo(path);
        var assemblyOlanlar = from dosya in klasor.GetFiles("*.dll")
                                            where Yuklenebildinmi(dosya.FullName)
                                                select dosya;

        foreach (var asmb in assemblyOlanlar)
            Console.WriteLine(asmb.FullName);
    }

    static bool Yuklenebildinmi(string assemblyAdresi)
    { 
        try
        {
            Assembly asmbly = Assembly.LoadFrom(assemblyAdresi);
            return true;
        }
        catch
        {
            return false;
        }
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;GetFiles&lt;/strong&gt; metodu ile &lt;strong&gt;dll&lt;/strong&gt; uzantılı &lt;strong&gt;FileInfo&lt;/strong&gt; dizisi elde edildikten sonra her bir eleman i&amp;ccedil;in &lt;strong&gt;Yuklenebildimi&lt;/strong&gt; isimli bir metod ile denetleme işlemi ger&amp;ccedil;ekleştirilmektedir. Yuklenebildimi isimli fonksiyon, &lt;strong&gt; Assembly.LoadFrom &lt;/strong&gt;metodu işe yarıyorsa &lt;strong&gt;true&lt;/strong&gt; değerini, yaramıyorsa &lt;strong&gt;false&lt;/strong&gt; değerini d&amp;ouml;nd&amp;uuml;rmektedir. Buna g&amp;ouml;re &lt;strong&gt;true&lt;/strong&gt; değeri d&amp;ouml;nen dosyaların y&amp;uuml;klenebilen assembly' lar olduğu sonucuna varılmaktadır. Uygulamanın &amp;ccedil;alışma zamanındaki g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdakine benzer olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk248_6.gif" alt="" width="587" height="172" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Yine assembly' lar &amp;uuml;zerinden &lt;strong&gt;LINQ&lt;/strong&gt; sorguları yazmaya devam edelim. &amp;Ouml;rneğin bir &lt;strong&gt;assembly&lt;/strong&gt; i&amp;ccedil;erisinden &lt;strong&gt;dışarıya sunulan&lt;/strong&gt; &lt;strong&gt;harici&lt;/strong&gt; &lt;strong&gt;tipler&lt;/strong&gt; g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınsın. Burada işin i&amp;ccedil;erisine gruplama fonksiyonelliğinide katarak, hangi &lt;strong&gt; isim alanı(namespace)&lt;/strong&gt; i&amp;ccedil;erisinden ka&amp;ccedil; adet tipin dışarıya sunulduğu bilgiside elde edilebilir. Bu işi ger&amp;ccedil;ekleştirmek i&amp;ccedil;in &amp;ouml;rnek olarak aşağıdaki gibi bir kod par&amp;ccedil;ası g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Assembly systemAsmb = Assembly.LoadFrom(@"C:\WINDOWS\Microsoft.NET\Framework\v2.0.50727\System.Web.dll"); 
var hariciTipler = from t in systemAsmb.GetExportedTypes()
                            group t by t.Namespace into ng
                                orderby ng.Key descending
                                    select new
                                                {
                                                    IsimAlaniAdi = ng.Key,
                                                    TipSayisi = ng.Count()
                                                };
foreach (var hariciTip in hariciTipler)
    Console.WriteLine("{0} isim alanından {1} tip vardır", hariciTip.IsimAlaniAdi, hariciTip.TipSayisi.ToString());&lt;/pre&gt;
&lt;p&gt;Bu &lt;strong&gt;LINQ&lt;/strong&gt; sorgusunda &lt;strong&gt; GetExportedTypes&lt;/strong&gt; metodu yardımıyla &amp;ouml;rnek olarak &lt;strong&gt;System.Web.dll assembly'&lt;/strong&gt; ı i&amp;ccedil;erisinden dışarıya sunulmakta olan harici tiplerin listesi &lt;strong&gt;Type&lt;/strong&gt; t&amp;uuml;r&amp;uuml;nden bir dizi olarak elde edilmektedir. Sonrasında ise her tip, &lt;strong&gt;Namespace&lt;/strong&gt; &amp;ouml;zelliğinin değerine g&amp;ouml;re group anahtar kelimesi yardımıyla ng isimli değişken altında gruplanmaktadır. Gruplanan veriler sonucu elde edilen liste &lt;strong&gt;Namespace&lt;/strong&gt; adlarına g&amp;ouml;re &lt;strong&gt;tersten(descending)&lt;/strong&gt; sıralanmaktadır. Bu noktada devreye &lt;strong&gt; orderby&lt;/strong&gt; anahtar kelimesi girmektedir. Elde edilen listeden isim alanı adları &lt;strong&gt;Key&lt;/strong&gt; &amp;ouml;zelliği ile ve tip sayılarıda &lt;strong&gt;Count&lt;/strong&gt; genişletme metodu ile &amp;ccedil;ekilerek yeni bir &lt;strong&gt;isimsiz tip&lt;/strong&gt; altında toplanmaktadır. Kod par&amp;ccedil;asının &amp;ccedil;alışmasının sonucu oluşan &amp;ouml;rnek ekran &amp;ccedil;ıktısı ise aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk248_7.gif" alt="" width="473" height="270" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Peki herhangibir &lt;strong&gt;assembly&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt;ka&amp;ccedil; farklı isim alanı&lt;/strong&gt; olduğunu bulmak istersek. Normal şartlarda bu işlem i&amp;ccedil;in isim alanı adlarını &amp;ccedil;ektikten sonra bir fonksiyonellik geliştirilmesi gerekmektedir. Oysaki &lt;strong&gt;LINQ&lt;/strong&gt; ile birlikte genen &lt;strong&gt;Distinct&lt;/strong&gt; &lt;strong&gt;genişletme metodu&lt;/strong&gt; sayesinde s&amp;ouml;z konusu işlem aşağıdaki kod par&amp;ccedil;asında olduğu gibi kolayca ger&amp;ccedil;ekleştirilebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Assembly systemAsmb = Assembly.LoadFrom(@"C:\WINDOWS\Microsoft.NET\Framework\v2.0.50727\System.Xml.dll"); 
var isimAlanlari = (from t in systemAsmb.GetTypes() 
                                select t.Namespace).Distinct();
Console.WriteLine("\n{0} assembly' ı i&amp;ccedil;erisinde {1} farklı isim alanı adı vardır", systemAsmb.FullName,isimAlanlari.Count()-1);
foreach (var isimAlani in isimAlanlari)
    Console.WriteLine(isimAlani);&lt;/pre&gt;
&lt;p&gt;Burada dikkat edilmesi gereken noktalardan biriside &lt;strong&gt;Distinct&lt;/strong&gt; &lt;strong&gt;işlevselliğinin&lt;/strong&gt; bir metod olarak &lt;strong&gt;select&lt;/strong&gt; &lt;strong&gt;sorgusunun&lt;/strong&gt; &lt;strong&gt;arkasından&lt;/strong&gt; kullanılmasıdır. Buna ek olarak &lt;strong&gt;Count&lt;/strong&gt; &lt;strong&gt;genişletme metodu&lt;/strong&gt; ilede &lt;strong&gt;farklı isim alanlarının sayısı&lt;/strong&gt; &amp;ccedil;ekilmektedir. &amp;Ouml;rnekte yer alan &lt;strong&gt;System.Xml.dll assembly' ı &lt;/strong&gt;i&amp;ccedil;in ilgili sonu&amp;ccedil;lar aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk248_8.gif" alt="" width="588" height="225" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Reflection&lt;/strong&gt; ile ilişkili olarak &lt;strong&gt;LINQ&lt;/strong&gt; sorgularını kullanacağımız son bir &amp;ouml;rnek ile devam edelim. Bu sefer bir &lt;strong&gt;assembly&lt;/strong&gt; i&amp;ccedil;erisinde yer alan&lt;strong&gt; tiplerin toplam sayılarını&lt;/strong&gt; &lt;strong&gt;t&amp;uuml;redikleri base type' lara g&amp;ouml;re gruplayarak&lt;/strong&gt; elde etmeye &amp;ccedil;alışıyor olacağız. Bu ama&amp;ccedil;la, &lt;strong&gt;Type&lt;/strong&gt; sınıfının &lt;strong&gt;BaseType&lt;/strong&gt; &amp;ouml;zelliği gruplama işleminde kullanılabilir. S&amp;ouml;z gelimi &lt;strong&gt;System.dll assembly&lt;/strong&gt;' ı i&amp;ccedil;erisindeki tipleri &lt;strong&gt;BaseType&lt;/strong&gt; &amp;ouml;zelliklerinin değerlerine g&amp;ouml;re gruplamak istersek aşağıdaki kod par&amp;ccedil;ası yeterli olacaktır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Assembly systemAsmb = Assembly.LoadFrom(@"C:\WINDOWS\Microsoft.NET\Framework\v2.0.50727\System.dll");
var tipler = from m in systemAsmb.GetTypes()
                    group m by m.BaseType into grp
                        select new
                                    {
                                        grp.Key
                                        ,Toplam = grp.Count()
                                    };
foreach (var tip in tipler)
    Console.WriteLine("{0} \t{1}", tip.Key, tip.Toplam.ToString());&lt;/pre&gt;
&lt;p&gt;Bir &amp;ouml;nceki &amp;ouml;rnektekine benzer olacak şekilde yine &lt;strong&gt;group by&lt;/strong&gt; fonksiyonu kullanılmaktadır. Sonu&amp;ccedil; olarak &amp;uuml;retilen isimsiz tip i&amp;ccedil;erisinde BaseType adı ve toplam tip sayısı değerleri yer almaktadır. &amp;Ouml;rnek kodun &amp;ccedil;alışma zamanındaki ekran &amp;ccedil;ıktısı aşağıdakine benzer olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk248_9.gif" alt="" width="411" height="260" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;LINQ(Language INtegrated Query)&lt;/strong&gt; ifadeleri pek &amp;ccedil;ok dizi tipi ve koleksiyon &amp;uuml;zerinde etkin bir şekilde kullanılabildiğinden, akla gelen konulardan biriside g&amp;ouml;rsel uygulamalarda yer alan &lt;strong&gt;Controls&lt;/strong&gt; koleksiyonlarıdır. Bir &lt;strong&gt;windows&lt;/strong&gt; uygulamasında yada &lt;strong&gt;web&lt;/strong&gt; uygulamasında &lt;strong&gt;Container&lt;/strong&gt; g&amp;ouml;revi &amp;uuml;stlenen ve bu sebepten &lt;strong&gt;Controls&lt;/strong&gt; koleksiyonuna sahip olan nesnel topluluklar &amp;uuml;zerinde de &lt;strong&gt;LINQ&lt;/strong&gt; sorguları &amp;ccedil;alıştırılabilir. Bunu basit bir &amp;ouml;rnek &amp;uuml;zerinden inceleyebiliriz. S&amp;ouml;z gelimi aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;de yer alan bir Windows Formumuz olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk248_10.gif" alt="" width="374" height="306" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Amacımız şimdilik bu form &amp;uuml;zerinde &lt;strong&gt; hangi tipte kontroller &lt;/strong&gt;bulunduğunu g&amp;ouml;stermek. Bu ama&amp;ccedil;la basit olarak aşağıdaki gibi bir kod par&amp;ccedil;ası yeterli olacaktır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void button2_Click(object sender, EventArgs e)
{
    lstSonuclar.Items.Clear();

    IEnumerable&amp;lt;Control&amp;gt; kontroller=Controls.Cast&amp;lt;Control&amp;gt;();

    var farkliTipler = (from kontrol in kontroller
                                select kontrol.GetType()).Distinct().OrderBy(k =&amp;gt; k.Name);

    foreach (Type farkliTip in farkliTipler)
        lstSonuclar.Items.Add(farkliTip.Name);
}&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asıda belkide en &amp;ouml;nemli noktalardan biriside &lt;strong&gt;Controls&lt;/strong&gt; &amp;ouml;zelliği &amp;uuml;zerinden kullanılan &lt;strong&gt; Cast&amp;lt;T&amp;gt;&lt;/strong&gt; &lt;strong&gt;genişletme metodudur&lt;/strong&gt;. Cast&amp;lt;T&amp;gt; metodu kullanılmadığı takdirde &lt;strong&gt;Controls&lt;/strong&gt; &amp;ouml;zelliği &amp;uuml;zerinden &lt;strong&gt;Select&lt;/strong&gt;, &lt;strong&gt;Where&lt;/strong&gt;, &lt;strong&gt;GroupBy&lt;/strong&gt; gibi &lt;strong&gt;LINQ&lt;/strong&gt; sorgularında &amp;ouml;nem arz eden fonksiyonelliklere &lt;strong&gt;erişilemediği&lt;/strong&gt; g&amp;ouml;r&amp;uuml;l&amp;uuml;r. &lt;strong&gt;Cast&amp;lt;T&amp;gt;&lt;/strong&gt; metodunun buradaki g&amp;ouml;revi &lt;strong&gt;Controls&lt;/strong&gt; koleksiyonu i&amp;ccedil;erisindeki bileşenleri, parametre olarak verilen generic tipe d&amp;ouml;n&amp;uuml;şt&amp;uuml;rerek &lt;strong&gt; IEnumerable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n taşıyabileceği bir nesne topluluğu referansı halinde &amp;uuml;retmektir. B&amp;ouml;ylece LINQ sorguları i&amp;ccedil;in gerekli fonksiyonellikler elde edilebilmektedir.&lt;/p&gt;
&lt;p&gt;Windows formu &amp;uuml;zerindeki g&amp;ouml;rsel bileşenler &lt;strong&gt;Control&lt;/strong&gt; sınıfından t&amp;uuml;remektedir. Bu sebepten Cast&amp;lt;T&amp;gt; metodunun generic parametresi &lt;strong&gt;Control&lt;/strong&gt; tipindendir. Bu d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işleminin ardından &lt;strong&gt;Distinct&lt;/strong&gt; ve &lt;strong&gt;OrderBy&lt;/strong&gt; genişletme metodlarınında yer aldığı bir LINQ sorgusu &amp;ccedil;alıştırılması m&amp;uuml;mk&amp;uuml;n olmaktadır. &lt;strong&gt;Select&lt;/strong&gt; sorgusunda, &lt;strong&gt;GetType&lt;/strong&gt; metodunun kullanılmasının sebebi tiplerin benzersiz şekilde ele alınmak istemesidir. Sonu&amp;ccedil; olarak uygulamanın &amp;ccedil;alışma zamanındaki ekran &amp;ccedil;ıktısı aşağıdakine benzer olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk248_11.gif" alt="" width="372" height="300" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi form &amp;uuml;zerinde hangi tipten kontrollerin var olduğu listelenmektedir. Yeni bir sorgu ile devam edelim. Bu sefer form &amp;uuml;zerindeki kontrolleri &lt;strong&gt;tiplerine g&amp;ouml;re&lt;/strong&gt; gruplayıp &lt;strong&gt;her bir tipten ka&amp;ccedil; adet&lt;/strong&gt; olduğunu bulmak istediğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu basit gruplama işleminin kodu aşağıdaki gibi geliştirilebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void button2_Click(object sender, EventArgs e)
{
    lstSonuclar.Items.Clear();

    IEnumerable&amp;lt;Control&amp;gt; kontroller=Controls.Cast&amp;lt;Control&amp;gt;();

    var farkliTipler = from kontrol in kontroller
                                group kontrol by kontrol.GetType() into grp
                                    select new
                                                {
                                                    KontrolAdi=grp.Key
                                                    ,Toplam=grp.Count()
                                                };

    foreach (var farkliTip in farkliTipler)
        lstSonuclar.Items.Add(String.Format("{0} : {1}",farkliTip.KontrolAdi,farkliTip.Toplam.ToString()));
}&lt;/pre&gt;
&lt;p&gt;Bu sefer gruplama işlemi &lt;strong&gt;Control&lt;/strong&gt; tipinin &lt;strong&gt;GetType&lt;/strong&gt; metoduna g&amp;ouml;re yapılmaktadır. Uygulama kodunun ekran &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk248_12.gif" alt="" width="449" height="300" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Cast&amp;lt;T&amp;gt;&lt;/strong&gt; metodu doğrudan &lt;strong&gt;LINQ&lt;/strong&gt; &lt;strong&gt;genişletme&lt;/strong&gt; &lt;strong&gt;metodlarının&lt;/strong&gt; kullanılamadığı pek &amp;ccedil;ok senaryoda ele alınabilir. S&amp;ouml;z gelimi aşağıdaki kod par&amp;ccedil;ası &amp;ccedil;ok basit olarak &lt;strong&gt; Application Log&lt;/strong&gt; altındaki girişlerden &lt;strong&gt;programın &amp;ccedil;alıştırıldığı g&amp;uuml;n i&amp;ccedil;erisinde&lt;/strong&gt; &amp;uuml;retilenlerin &amp;ccedil;ekilmesini sağlamaktadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;EventLog logs = new EventLog("Application", ".", "");
IEnumerable&amp;lt;EventLogEntry&amp;gt; entries = logs.Entries.Cast&amp;lt;EventLogEntry&amp;gt;();

var girisler = from entry in entries
                    where entry.TimeGenerated.Day == DateTime.Now.Day
                        select new
                                    {
                                        entry.Category,
                                        entry.CategoryNumber,
                                        entry.EntryType,
                                        entry.TimeGenerated
                                    };

foreach (var giris in girisler)
    Console.WriteLine(giris.ToString());&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında kullanılan &lt;strong&gt;Cast&amp;lt;T&amp;gt;&lt;/strong&gt; genişletme metodu geriye, &lt;strong&gt;IEnumerable&amp;lt;EventLogEntry&amp;gt;&lt;/strong&gt; &lt;strong&gt; aray&amp;uuml;z&amp;uuml;(interface)&lt;/strong&gt; tarafından taşınacak bir nesne topluluğu referansı d&amp;ouml;nd&amp;uuml;rmektedir. &lt;strong&gt;IEnumerable&amp;lt;T&amp;gt; &lt;/strong&gt;aray&amp;uuml;z&amp;uuml;ne ulaşıldığı i&amp;ccedil;inde LINQ sorgusu kolay bir şekilde ele alınmış ve aşağıdaki ekran &amp;ccedil;ıktısının &amp;uuml;retilmesi sağlanmıştır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk248_13.gif" alt="" width="588" height="152" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Cast&amp;lt;T&amp;gt;&lt;/strong&gt; metodu ile benzer &amp;ouml;zelliğe sahip bir diğer &amp;ouml;nemli metodda &lt;strong&gt;OfType&amp;lt;T&amp;gt; genişletme metodudur&lt;/strong&gt;. Bu metod bir nesne topluluğu &amp;uuml;zerinde, &lt;strong&gt;generic parametre tipine g&amp;ouml;re filtreleme&lt;/strong&gt; yapılabilmesini ve geriye LINQ sorgularının uygulanabileceği &lt;strong&gt;bir IEnumerable&amp;lt;T&amp;gt;&lt;/strong&gt; referansı d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesini sağlamaktadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Cast&amp;lt;T&amp;gt; metodu ile OfType&amp;lt;T&amp;gt; metodu benzer işlevselliğe sahip g&amp;ouml;r&amp;uuml;nmekle birlikte arada &amp;ouml;nemli farklar vardır. OfType&amp;lt;T&amp;gt; metodu temel olarak generic parametre tipine g&amp;ouml;re bir filtreleme yapmakta iken, Cast&amp;lt;T&amp;gt; metodu generic parametre tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme yapmaktadır. Bu sebepten d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme yapılamayacağı durumlarda Cast&amp;lt;T&amp;gt; metodu, &amp;ccedil;alışma zamanında InvalidCastException istisnası &amp;uuml;retilmesine neden olur. Oysaki OfType&amp;lt;T&amp;gt; metodu bu durumu tamamen g&amp;ouml;rmezden gelir ve diğer nesneden devam eder. OfType&amp;lt;T&amp;gt; kendi i&amp;ccedil;erisinde is anahtar kelimesini kullanarak tip kontrol&amp;uuml; yapmaktayken, Cast&amp;lt;T&amp;gt; doğrudan d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme adımını uygular.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Şimdi &lt;strong&gt;OfType&amp;lt;T&amp;gt; &lt;/strong&gt;metodunu &amp;ouml;rnek bir senaryo &amp;uuml;zerinden ele almaya &amp;ccedil;alışalım. &amp;Ouml;rneğin uygulamamızda kullandığımız .Net Framework 2.0 ile geliştirilmiş bir k&amp;uuml;t&amp;uuml;phane olsun. Bu k&amp;uuml;t&amp;uuml;phane i&amp;ccedil;erisinde yer alan metodlardan bazılarınında &lt;strong&gt;ArrayList&lt;/strong&gt; gibi t&amp;uuml;r g&amp;uuml;venli olmayan koleksiyonlar d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml; d&amp;uuml;ş&amp;uuml;nelim. Referansta bulunan uygulamanın .Net 3.5 tabanlı olduğu d&amp;uuml;ş&amp;uuml;n&amp;uuml;lecek olursa, gelen koleksiyon nesneleri &amp;uuml;zerinden &lt;strong&gt;LINQ&lt;/strong&gt; sorguları &amp;ccedil;alıştırılması istenebilir. Bu noktada &lt;strong&gt;OfType&amp;lt;T&amp;gt;&lt;/strong&gt; metodu olduk&amp;ccedil;a işe yarayacaktır. S&amp;ouml;z konusu senaryoyo ele almak i&amp;ccedil;in aşağıdaki tipi i&amp;ccedil;eren bir &lt;strong&gt;sınıf k&amp;uuml;t&amp;uuml;phanesi(Class Library)&lt;/strong&gt; olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Yardimci
{
    public ArrayList ListeyiAl()
    {
        ArrayList liste = new ArrayList();
        liste.Add("Burak");
        liste.Add("Bili");
        liste.Add("Beh&amp;ccedil;et");
        liste.Add("Necdet");
        liste.Add("Kerim");
        liste.Add("Mayk");
        liste.Add(19.90);
        liste.Add(10);
        liste.Add(true);
        liste.Add(false);
        liste.Add('C');
        return liste;
    }
}&lt;/pre&gt;
&lt;p&gt;Kod par&amp;ccedil;asında kasıtlı olarak &lt;strong&gt; ArrayList&lt;/strong&gt; i&amp;ccedil;erisine farklı tipte veriler atılmıştır. Eğerki &lt;strong&gt;LINQ&lt;/strong&gt; sorgusunda bu metoddan d&amp;ouml;nen değerler i&amp;ccedil;erisinden sadece &lt;strong&gt;string&lt;/strong&gt; tabanlı olanları ele almak istiyorsak, &lt;strong&gt;OfType&amp;lt;T&amp;gt;&lt;/strong&gt; metodunu aşağıdaki kod par&amp;ccedil;asında olduğu gibi kullanabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;GenelIslemler.Yardimci yrdm = new GenelIslemler.Yardimci();

var besHarfliler = from nesne in yrdm.ListeyiAl().OfType&amp;lt;string&amp;gt;()
                            where nesne.Length == 5
                                select nesne;

foreach (string nesne in besHarfliler)
    Console.WriteLine(nesne);&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;OfType&amp;lt;string&amp;gt;&lt;/strong&gt; metodu buradaki kullanıma g&amp;ouml;re &lt;strong&gt;ListeyiAl&lt;/strong&gt; fonksiyonundan gelen &lt;strong&gt;ArrayList&lt;/strong&gt; i&amp;ccedil;erisindeki t&amp;uuml;m nesnelerde, &lt;strong&gt;is&lt;/strong&gt; kontrol&amp;uuml;n&amp;uuml; yaparak sadece &lt;strong&gt; String&lt;/strong&gt; olanları geriye d&amp;ouml;nd&amp;uuml;rmektedir. Sonrasında nesnelerin karakter uzunluğu kıyaslanarak 5 ise &amp;ccedil;ekilmektedir. Program kodunun &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk248_14.gif" alt="" width="265" height="83" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Yazımızda son olarak &lt;strong&gt;.Net Framework 2.0 &lt;/strong&gt;ile yazılmış ve &lt;strong&gt;DataTable&lt;/strong&gt; nesnelerini kullanan bir uygulamayı &lt;strong&gt;.Net 3.5&lt;/strong&gt;' e taşıyarak basit &lt;strong&gt;LINQ&lt;/strong&gt; sorgularını nasıl ele alabileceğimizi incelemeye &amp;ccedil;alışacağız. &lt;em&gt;(LINQ sorgularının işlevselliğinin &amp;ouml;n plana &amp;ccedil;ıktığı vakalarda, var olan .Net uygulamaları &lt;strong&gt;.Net 3.5&lt;/strong&gt; versiyonuna terfi edilmek durumdan kalabilir.)&lt;/em&gt; Bu ama&amp;ccedil;la ilk olarak &lt;strong&gt;.Net Framework 2.0&lt;/strong&gt; ile geliştirilmiş ve test amacıyla aşağıdaki kodlara sahip bir &lt;strong&gt;Console&lt;/strong&gt; uygulamamız olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.Data.SqlClient;

namespace Net20DataTable
{
    class Program
    {
        static void Main(string[] args)
        {
            DataTable tbl = null;
    
            using (SqlConnection conn = new SqlConnection("data source=.;database=AdventureWorks;integrated security=SSPI"))
            {
                SqlDataAdapter adapter = new SqlDataAdapter("Select ProductId,Name,ListPrice,Class,SellStartDate,ProductSubCategoryId From Production.Product", conn);
                tbl = new DataTable("Products");
                adapter.Fill(tbl);
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Kod, &lt;strong&gt;AdventureWorks&lt;/strong&gt; isimli &lt;strong&gt; SQL Server 2005&lt;/strong&gt; veritabanına bağlanmakta ve &lt;strong&gt;Production&lt;/strong&gt; şemasındaki &lt;strong&gt;Product&lt;/strong&gt; tablosundan bir ka&amp;ccedil; alanı &amp;ccedil;ekmektedir. &amp;Ccedil;ekilen veri k&amp;uuml;mesi işlenilmek &amp;uuml;zere bir &lt;strong&gt;DataTable&lt;/strong&gt; nesnesi i&amp;ccedil;erisinde toplanmaktadır. &amp;Ccedil;ok doğal olarak uygulama &lt;strong&gt;.Net Framework 2.0 &lt;/strong&gt;tabanlı olduğundan, &lt;strong&gt;LINQ&lt;/strong&gt; ifadelerinin &lt;strong&gt;DataTable&lt;/strong&gt; &amp;uuml;zerinden uygulanması&lt;em&gt;(veya başka bağlantısız katman nesneleri &amp;uuml;zerinden) &lt;/em&gt;m&amp;uuml;mk&amp;uuml;n değildir. Eğer elimizde &lt;strong&gt;Visual&lt;/strong&gt; &lt;strong&gt;Studio&lt;/strong&gt; &lt;strong&gt;2008&lt;/strong&gt; var ise yapılması gerekenler &amp;ccedil;ok basittir. &amp;Ouml;ncelikli olarak proje &amp;ouml;zelliklerinden(Properties) &lt;strong&gt;Application&lt;/strong&gt; sekmesine ge&amp;ccedil;ilmeli ve &lt;strong&gt;Target&lt;/strong&gt; &lt;strong&gt;Framework&lt;/strong&gt; se&amp;ccedil;eneği &lt;strong&gt;.Net Framework 3.5 &lt;/strong&gt; olarak değiştirilmelidir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk248_15.gif" alt="" width="597" height="265" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu işlemin ardından uygulamanın bir kere daha derlenmesinde yarar vardır. &lt;em&gt;(S&amp;ouml;z konusu adımların ardından &lt;/em&gt;&lt;strong&gt;&lt;em&gt;System.Core.dll assembly&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;' ının projeye hemen referans edildiğide g&amp;ouml;r&amp;uuml;lebilir.)&lt;/em&gt; Artık &lt;strong&gt;LINQ&lt;/strong&gt; sorgularının yazılmasına başlanabilir. &lt;strong&gt;DataTable&lt;/strong&gt; i&amp;ccedil;in bu sorguların uygulanabilmesi i&amp;ccedil;in &lt;strong&gt;AsEnumerable&lt;/strong&gt; metodunun erişilebilir olması gerekmektedir. Ancak bu genişletme metoduna şu anda erişilemediği g&amp;ouml;r&amp;uuml;lmektedir. Bunun sebebi &lt;strong&gt;System.Data.DataSetExtensions.dll assembly&lt;/strong&gt;' ının projeye referans edilmemiş olmasıdır. Dolayısıyla &amp;ouml;ncelikle bu assembly' ın referans edilmesi gerekmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk248_16.gif" alt="" width="253" height="157" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Artık uygulamada yer alan DataTable &amp;uuml;zerinde LINQ sorguları &amp;ccedil;alıştırılabilir. İşte bir &amp;ouml;rnek;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var altKategorisi4OlanUrunler = from row in tbl.AsEnumerable()
                                                    where row["ProductSubCategoryId"].ToString() == "4"
                                                        select new
                                                                    {
                                                                        Id = Convert.ToInt16(row["ProductId"]),
                                                                        Ad = row["Name"].ToString(),
                                                                        Fiyat = Convert.ToDouble(row["ListPrice"])
                                                                    };

foreach (var urun in altKategorisi4OlanUrunler)
    Console.WriteLine(urun.ToString());&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında g&amp;ouml;r&amp;uuml;len &lt;strong&gt;LINQ&lt;/strong&gt; sorgusuna g&amp;ouml;re &lt;strong&gt;DataTable&lt;/strong&gt; i&amp;ccedil;erisinden &lt;strong&gt;ProductSubCategoryId&lt;/strong&gt; alanının değeri &lt;strong&gt;4&lt;/strong&gt; olanların &lt;strong&gt;ProductId,Name,ListPrice&lt;/strong&gt; kolonlarının verilerinden oluşan yeni bir &lt;strong&gt;isimsiz tip(Anonymous Type)&lt;/strong&gt; topluluğu elde edilmektedir. Kodun ekran &amp;ccedil;ıktısı aşağıdakine benzer olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk248_17.gif" alt="" width="419" height="142" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;LINQ&lt;/strong&gt; sorguları &lt;strong&gt; .Net Framework&lt;/strong&gt; i&amp;ccedil;erisinde pek &amp;ccedil;ok farklı alanda uygulanabilmektedir. &lt;strong&gt;Reflection, IO, Windows Forms Controls, Application Log, DataTable, &lt;/strong&gt;eski bir uygulamadan gelen&lt;strong&gt; ArrayList&lt;/strong&gt; bu yazıda ele alınan basit bir ka&amp;ccedil; alandır. LINQ sorguları &lt;strong&gt;Office&lt;/strong&gt; &amp;uuml;r&amp;uuml;nlerinde dahi kullanılabilmektedir. S&amp;ouml;z gelimi &lt;strong&gt;Outlook&lt;/strong&gt; i&amp;ccedil;erisindeki kontaklar &lt;strong&gt;LINQ&lt;/strong&gt; sorguları ile filtrelenebilir. &amp;Ouml;rnekleri arttırmak ve yaymak m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Ancak unutulmaması gereken noktalardan biriside bu işlemlerin yapılması i&amp;ccedil;in &lt;strong&gt;LINQ&lt;/strong&gt; sorgularının olmasının &lt;strong&gt;zorunlu olmadığıdır&lt;/strong&gt;. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ouml;yleki LINQ sorgularıda &amp;ouml;z&amp;uuml;nde, &lt;strong&gt;.Net Framework 3.5 &lt;/strong&gt;ile gelen &lt;strong&gt; genişletme&lt;/strong&gt; &lt;strong&gt;metodlarını(Extension Methods)&lt;/strong&gt; yoğun bir şekilde ele almaktadır. Bir başka deyişle LINQ olmadanda metodlar yardımıyla bu istekler karşılanabilir. Diğer taraftan LINQ sorgularının getirdiği dil esnekliği, kullanım kolaylığı, anlaşılabilirlik g&amp;ouml;z ardı edilmemelidir. Her geliştirici kullandığı&lt;strong&gt; programlama dili yardımıyla nesneler &amp;uuml;zerinden SQL benzeri sorgu ifadeleri yazabilmek&lt;/strong&gt; ister. LINQ bu imkanı sağlayarak &amp;ouml;nemli bir a&amp;ccedil;ığı kapatmaktadır. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;a href="/makale/images/LINQveReflectionArastirma.rar"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;</content>
  <pubDate>2008-04-10 06:00:00</pubDate>
  <slug>LINQ-Maceralarc4b1m-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#-30</tag>
    <tag>linq</tag>
  </tags>
  <categories>
    <category>C# 3.0</category>
    <category>LINQ</category>
  </categories>
</post>