<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WPF - Grafik İşlemlerinde Şekillerin(Shapes) Kullanımı</title>
  <description>Windows Presentation Foundation(WPF) ile ilgili bir önceki makalemizde, iki boyutlu(2D) grafiklerin çizilmesi amacıyla kullanılan fırçaları(Brushes) incelemeye çalışmıştık. Bu makalemizde ise iki boyutlu şekilleri(Shapes) araştırıyor olacağız. Vektörel grafiklerde şekillerin(Shapes) büyük önemi vardır. Nitekim temel şekiller kullanılarak asıl resimler ve görüntüler kolaylıkla elde edilebilir...</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Windows Presentation Foundation(WPF) ile ilgili bir &amp;ouml;nceki makalemizde, &lt;strong&gt;iki boyutlu(2D)&lt;/strong&gt; grafiklerin &amp;ccedil;izilmesi amacıyla kullanılan fır&amp;ccedil;aları&lt;strong&gt;(Brushes) &lt;/strong&gt;incelemeye &amp;ccedil;alışmıştık. Bu makalemizde ise iki boyutlu şekilleri&lt;strong&gt;(Shapes)&lt;/strong&gt; araştırıyor olacağız. Vekt&amp;ouml;rel grafiklerde şekillerin(Shapes) b&amp;uuml;y&amp;uuml;k &amp;ouml;nemi vardır. Nitekim temel şekiller kullanılarak asıl resimler ve g&amp;ouml;r&amp;uuml;nt&amp;uuml;ler kolaylıkla elde edilebilir. Bir &lt;strong&gt;CAD&lt;/strong&gt; uygulamasının karmaşık &amp;ccedil;izelgelerinden, eğlenceli &amp;ccedil;ocuk programlarında kullanılan vekt&amp;ouml;rel grafiklere kadar pek &amp;ccedil;ok alanda temel şekiller yeterli olmaktadır. S&amp;ouml;z gelimi bir şehrin imar planlamasında kullanılacak bir programda iki boyutlu olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde d&amp;ouml;rtgenler, daireler, elipsler, poligonlar ve d&amp;uuml;z &amp;ccedil;izgiler evlerin, yolların, arsaların, parkların ifade edilmesi i&amp;ccedil;in yeterlidir. Senaryolar arttırılabilir ve daha geniş alanlarda d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Ancak temel olarak gereken şekiller bellidir. WPF kendi b&amp;uuml;nyesinde iki boyutlu &amp;ccedil;izimlerin ger&amp;ccedil;ekleştirilebilmesi amacıyla aşağıda belirtilen şekilleri(Shapes) sunmaktadır.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Ellips&lt;/strong&gt; : Bu tip yardımıyla i&amp;ccedil;i dolu veya boş tam daire yada elipslerin &amp;ccedil;izilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Line&lt;/strong&gt; : D&amp;uuml;z &amp;ccedil;izgilerin &amp;ccedil;izilmesini sağlayan tiptir. Başlangı&amp;ccedil; ve bitiş koordinatları d&amp;uuml;z &amp;ccedil;izginin &amp;ccedil;izilmesi i&amp;ccedil;in yeterlidir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Rectangle&lt;/strong&gt; : D&amp;ouml;rt k&amp;ouml;şeli şekillerin &amp;ccedil;izilmesinde kullanılan tiptir. İ&amp;ccedil;i boş veya dolu dikd&amp;ouml;rtgen yada kare gibi şekillerin &amp;ccedil;izilebilmesini sağlar.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Polygon&lt;/strong&gt; : N sayıda k&amp;ouml;şeden oluşan poligonların &amp;ccedil;izilmesinde kullanılır. Bir &amp;uuml;&amp;ccedil;gen olabileceği gibi bir &amp;ccedil;okgen de olabilir. Diğer taraftan d&amp;uuml;zg&amp;uuml;n k&amp;ouml;şeli olmayan bir poligonda oluşturulabilir. Ayrıca poligonların i&amp;ccedil;i boş veya dolu olacak şekilde oluşturulabilmesi de m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Polyline&lt;/strong&gt; : Birbirlerine bitiş noktalarından bağlı bir başka deyişle u&amp;ccedil; uca eklenmiş d&amp;uuml;z &amp;ccedil;izgilerin(Line) &amp;ccedil;izilmesini sağlayan tiptir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Path&lt;/strong&gt; : Birbirlerine son noktalarından bağlı olan d&amp;uuml;z &amp;ccedil;izgi veya eğri (Curve) gibi toplu şekillerin &amp;ccedil;izidirilmesini sağlayan tiptir. Farklı şekillerin bir arada kullanılabilmesini sağlamak i&amp;ccedil;in geometri&lt;strong&gt;(Geometry)&lt;/strong&gt; tiplerinden yararlanır.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;WPF, &lt;strong&gt;XAML(eXtensible Application Markup Language)&lt;/strong&gt; tabanlı bir ortam sunduğundan, grafiksel şekillerin tasarım zamanında element bazlı olarak geliştirilmeleri ve sonu&amp;ccedil;larının g&amp;ouml;r&amp;uuml;lmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. &lt;strong&gt;GDI+ &lt;/strong&gt;mimarisinde aynı durum d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde sonu&amp;ccedil;ların ancak &amp;ccedil;alışma zamanında&lt;strong&gt;(run-time)&lt;/strong&gt; elde edilebildiği unutulmamalıdır. Bu nedenle WPF bize b&amp;uuml;y&amp;uuml;k avantaj sağlamaktadır.&lt;/p&gt;
&lt;p&gt;Bu kısa bilgilerden sonra &amp;ouml;rneklerimizi geliştirerek şekilleri daha yakından tanımaya &amp;ccedil;alışalabiliriz. Her zamanki gibi &amp;ouml;rneklerimizi geliştirirken &lt;strong&gt;Visual Studio 2008 Beta 2 &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml;nden yararlanıyor olacağız. Bu nedenle, final s&amp;uuml;r&amp;uuml;m&amp;uuml;nde &amp;ouml;zellikle IDE bazlı bazı değişiklikler olma ihtimali olduğunu baştan belirtelim. İlk &amp;ouml;rneğimizde &lt;strong&gt;Ellips&lt;/strong&gt; tipinden yararlanıyor olacağız. Bu ama&amp;ccedil;la Window nesnemizin XAML i&amp;ccedil;eriğini aşağıdaki gibi tasarladığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Window x:Class="GrafiklerleCalismak.Elipsler" xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation" xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml" Background="White" Title="Elipslerin Kullanımı" Height="300" Width="300"&amp;gt;
    &amp;lt;Grid&amp;gt;
        &amp;lt;Ellipse Fill="DarkRed" Width="40" Height="150" Stroke="Coral" StrokeThickness="3"/&amp;gt;
        &amp;lt;Ellipse Fill="Red" Width="150" Height="40" Stroke="Black" StrokeThickness="3" Opacity="0.75"/&amp;gt;
        &amp;lt;Ellipse Width="40" Height="40" Fill="Gold" Stroke="Black" StrokeThickness="3"/&amp;gt;
        &amp;lt;Ellipse Width="10" Height="10" Stroke="DarkBlue" StrokeThickness="2" HorizontalAlignment="Left" Margin="64,56,0,0" VerticalAlignment="Top" /&amp;gt;
        &amp;lt;Ellipse Height="25" HorizontalAlignment="Right" Margin="0,56,64,0" Stroke="DarkBlue" StrokeThickness="2" VerticalAlignment="Top" Width="25" /&amp;gt;
        &amp;lt;Ellipse Height="50" HorizontalAlignment="Right" Margin="0,0,64,56" Stroke="DarkBlue" StrokeThickness="2" VerticalAlignment="Bottom" Width="50" /&amp;gt;
    &amp;lt;/Grid&amp;gt;
&amp;lt;/Window&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rnekte altı adet elips &amp;ccedil;izdirilmektedir. Ellips tipinin &lt;strong&gt;Fill&lt;/strong&gt; niteliği&lt;strong&gt;(attribute) &lt;/strong&gt; yardımıyla dolgu deseni belirtilebilir. Bunun dışında width ve height nitelikleri eşit oldukları takdirde tam bir dairenin &amp;ccedil;izilmesi s&amp;ouml;z konusudur. Diğer hallerde ise, yatay doğrultuda veya dikey doğrultuda uzayan bir elips oluşumu s&amp;ouml;z konusu olmaktadır. Kenar &amp;ccedil;izgilerini renk ve kalınlık olarak belirlemek amacıyla &lt;strong&gt;Stroke&lt;/strong&gt; ve &lt;strong&gt; StrokeTickness&lt;/strong&gt; niteliklerine değer atamaları yapılmaktadır. Stroke niteliği tahmin edileceği &amp;uuml;zere ge&amp;ccedil;erli bir fır&amp;ccedil;a&lt;strong&gt;(Brush)&lt;/strong&gt; ile eşleştirilebilir. Buda &amp;ccedil;izginin dolu bir renk dışında desenli olabileceği hatta i&amp;ccedil;inde resim barındırabileceği anlamına gelmektedir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Stroke ve StrokeTickness nitelikleri diğer şekillerde de ye almaktadır. Bu nedenle t&amp;uuml;m şekillerin &amp;ccedil;izgilerinin olabileceğini s&amp;ouml;yleyebiliriz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Yukarıdaki XAML i&amp;ccedil;eriğini Visual Studio 2008 Beta 2 ortamındaki &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk223_2.gif" alt="" width="321" height="317" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekillerin bu bi&amp;ccedil;imde yatay veya dikey d&amp;uuml;zlemlerde oluşturulması haricinde, a&amp;ccedil;ısal olaraktanda yerleştirilmesi istenebilir. Bunu bir elips &amp;uuml;zerinde GDI+ ile ger&amp;ccedil;ekleştirmek olduk&amp;ccedil;a zor ve zahmetlidir. Oysaki WPF i&amp;ccedil;erisinde yer alan Transform tipleri kullanılarak bu işlemler son derece kolay bir şekilde ger&amp;ccedil;ekleştirilebilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Transoform&lt;/strong&gt;' dan kasıt, şeklin a&amp;ccedil;ısal olarak konumunun değiştirilebilmesi, b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;n&amp;uuml;n ayarlanabilmesi, kendi ekseni &amp;uuml;zerinde veya farklı bir orjine g&amp;ouml;re d&amp;ouml;nd&amp;uuml;r&amp;uuml;lebilmesi, şeklin x veya y d&amp;uuml;zlemleri &amp;uuml;zerinde yer değiştirmesi yada eğilip b&amp;uuml;k&amp;uuml;lmesi gibi aksiyonlardır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;İkinci &amp;ouml;rneğimizde bu durum incelenmektedir. Yeni penceremizin &lt;strong&gt;XAML&lt;/strong&gt; i&amp;ccedil;eriğinin aşağıdaki gibi olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Window x:Class="GrafiklerleCalismak.ElipsTransform" xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation" xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml" Background="White" Title="ElipsTransform" Height="300" Width="300" Loaded="Window_Loaded"&amp;gt;
    &amp;lt;Grid&amp;gt;
        &amp;lt;Ellipse Width="125" Height="40" Stroke="Red" StrokeThickness="2"/&amp;gt; 
        &amp;lt;Ellipse Width="40" Height="125" Stroke="Black" StrokeThickness="2"/&amp;gt;
        &amp;lt;Ellipse Width="40" Height="125" Stroke="Red" StrokeThickness="2"&amp;gt;
            &amp;lt;Ellipse.LayoutTransform&amp;gt;
                &amp;lt;RotateTransform Angle="45"/&amp;gt;
            &amp;lt;/Ellipse.LayoutTransform&amp;gt;
        &amp;lt;/Ellipse&amp;gt;
        &amp;lt;Ellipse Width="40" Height="125" Stroke="Black" StrokeThickness="2"&amp;gt;
            &amp;lt;Ellipse.LayoutTransform&amp;gt;
                &amp;lt;RotateTransform Angle="135"/&amp;gt;
            &amp;lt;/Ellipse.LayoutTransform&amp;gt;
        &amp;lt;/Ellipse&amp;gt;
    &amp;lt;/Grid&amp;gt;
&amp;lt;/Window&amp;gt;&lt;/pre&gt;
&lt;p&gt;Burada dikkat edilmesi gereken en &amp;ouml;nemli nokta, &lt;strong&gt;Ellips.LayoutTransform&lt;/strong&gt; elementinin i&amp;ccedil;eriğidir. Bu elementin altında yer alan &lt;strong&gt;RotateTransform&lt;/strong&gt; elementi i&amp;ccedil;erisinde &lt;strong&gt; Angle&lt;/strong&gt; niteliği ile bir a&amp;ccedil;ı değeri belirtilmektedir. Bu a&amp;ccedil;ı değeri, şeklin x,y eksenine g&amp;ouml;re farklı bir derecede d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesini sağlamaktadır. &amp;Ouml;rnek XAML i&amp;ccedil;eriğinde 45 derece ve 135 derecelik a&amp;ccedil;ılar ile d&amp;ouml;nd&amp;uuml;r&amp;uuml;lm&amp;uuml;ş iki elips yer almaktadır. Bu i&amp;ccedil;eriğin tasarım zamanındaki &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk223_3.gif" alt="" width="320" height="316" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Atomu WPF ile daha kolay &amp;ccedil;izebildiğimizi s&amp;ouml;yleyebiliriz. Bu tip d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme(&lt;strong&gt;Transform&lt;/strong&gt;) işlemleri sadece &lt;strong&gt;RotateTransform&lt;/strong&gt; ile sınırlı değildir. Yazımızın ilerleyen kısımlarında diğer Transform modellerinede kısaca değinmeye &amp;ccedil;alışacağız. &amp;Ccedil;ok doğal olarak rotasyonların programatik olarak ger&amp;ccedil;ekleştirilmesi gereken vakkalar olacaktır. Yukarıdaki atom &amp;ccedil;izelgesininin benzerini kod tarafında oluşturmak istersek, element ve niteliklerin karşılığı olan uygun sınıf&lt;strong&gt;(class)&lt;/strong&gt; ve &amp;ouml;zellikleri&lt;strong&gt;(property)&lt;/strong&gt; kullanmak yeterli olacaktır. &amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; &amp;ouml;rneğimizde bu durum incelenmektedir. Bu ama&amp;ccedil;la yeni penceremizin XAML ve kod i&amp;ccedil;eriğini aşağıdaki gibi tasarladığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;XAML i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Window x:Class="GrafiklerleCalismak.KodlaElipsTransform" xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation" xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml" Background="White" Title="Kod Yardımıyla Elips Transform" Height="300" Width="300"&amp;gt;
    &amp;lt;Grid Name="grdEllips"&amp;gt; 
    &amp;lt;/Grid&amp;gt;
&amp;lt;/Window&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Kod i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Shapes;

namespace GrafiklerleCalismak
{
    public partial class KodlaElipsTransform : Window
    {
        private void ElipsCiz(Ellipse elps, int width, int height, int angle,Color color)
        {
            elps.Width = width;
            elps.Height = height;
            elps.Stroke = new SolidColorBrush(color);
            elps.StrokeThickness = 2;
            elps.LayoutTransform = new RotateTransform(angle);
            grdEllips.Children.Add(elps);
        }
        private void Cizdir()
        {
            ElipsCiz(new Ellipse(), 125, 40, 270,Colors.Red);
            ElipsCiz(new Ellipse(), 40, 125, 90,Colors.Gold);
            ElipsCiz(new Ellipse(), 125, 40, 45, Colors.DarkBlue);
            ElipsCiz(new Ellipse(), 125, 40, 135,Colors.Lavender); 
        }

        public KodlaElipsTransform()
        {
            InitializeComponent();
            Cizdir();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bir ka&amp;ccedil;tane elipsi farklı renk, &amp;ccedil;izgi, &amp;ccedil;izgi kalınlığı ve a&amp;ccedil;ıda &amp;ccedil;izdirmek istediğimizden yardımcı olacak &lt;strong&gt; ElipsCiz&lt;/strong&gt; isimli bir metod tasarlanmıştır. Bu metod, parametre olarak gelen &lt;strong&gt;Ellips&lt;/strong&gt; nesne &amp;ouml;rneğini alıp, genişlik(&lt;strong&gt;Width&lt;/strong&gt;), y&amp;uuml;kseklik(&lt;strong&gt;Height&lt;/strong&gt;), &amp;Ccedil;izgi rengi(&lt;strong&gt;Stroke&lt;/strong&gt;), &amp;Ccedil;izgi kalınlığı(&lt;strong&gt;StrokTickness&lt;/strong&gt;) ve rotasyon i&amp;ccedil;in gerekli a&amp;ccedil;ı(&lt;strong&gt;Angle&lt;/strong&gt;) değerlerini set etmektedir. Dikkat edilecek olursa, rotasyon işlemi i&amp;ccedil;in &lt;strong&gt;RotateTransform&lt;/strong&gt; tipine ait bir nesne &amp;ouml;rneklenmekte ve yapıcı metoda(&lt;strong&gt;Constructor&lt;/strong&gt;) a&amp;ccedil;ı değeri verilmektedir. Sonrasında ise bu nesne &amp;ouml;rneği, Ellips nesne &amp;ouml;rneğinin &lt;strong&gt;LayoutTransform&lt;/strong&gt; &amp;ouml;zelliğine atanmaktadır. S&amp;ouml;z konusu kod par&amp;ccedil;ası y&amp;uuml;r&amp;uuml;t&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde &amp;ccedil;alışma zamanında(run-time) aşağıdakine benzer bir ekran g&amp;ouml;rt&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşılır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk223_4.gif" alt="" width="300" height="300" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Yine kod yardımıyla elips &amp;ccedil;izdirmeye &amp;ouml;rnek olması a&amp;ccedil;ısından aşağıdaki pencerede(&lt;strong&gt;Window&lt;/strong&gt;) g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;XAML i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Window x:Class="GrafiklerleCalismak.KodYardimiylaElips" xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation" xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml" Background="White" Title="KodYardimiylaElips" Height="300" Width="300"&amp;gt;
    &amp;lt;Grid&amp;gt;
        &amp;lt;Grid Name="grdTahta" Margin="0,74,0,8" Background="Gold" /&amp;gt;
        &amp;lt;Button Height="23" HorizontalAlignment="Left" Margin="10,20,0,0" Name="btnCiz" VerticalAlignment="Top" Width="75" Click="btnCiz_Click"&amp;gt;&amp;Ccedil;izdir&amp;lt;/Button&amp;gt;
    &amp;lt;/Grid&amp;gt;
&amp;lt;/Window&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Kod i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Shapes;

namespace GrafiklerleCalismak
{
    public partial class KodYardimiylaElips : Window
    {
        private void ElipsCiz()
        {
            grdTahta.Children.Clear();
            Random rnd=new Random();
            for (int i = 0; i &amp;lt; 3; i++)
            {
                Ellipse elps = new Ellipse();
                elps.Width = rnd.Next(50, 100);
                elps.Height = rnd.Next(50, 100);
                elps.Stroke = new SolidColorBrush(Colors.Black);
                elps.StrokeThickness = rnd.Next(1, 5);
                grdTahta.Children.Add(elps);
            }
        }
    
        public KodYardimiylaElips()
        {
            InitializeComponent();
        }
    
        private void btnCiz_Click(object sender, RoutedEventArgs e)
        {
            ElipsCiz();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu kez bir d&amp;uuml;ğmeye basılması ile rastgele &amp;uuml;retilen değerlere g&amp;ouml;re elipslerin &amp;ccedil;izdirilmesi sağlanmaktadır. Bu ama&amp;ccedil;la 50 ile 100 arasında rastgele genişlik ve y&amp;uuml;kselik değerleri elde edebilmek i&amp;ccedil;in meşhur &lt;strong&gt;Random&lt;/strong&gt; sınıfına ait nesne &amp;ouml;rneğinden ve &lt;strong&gt;Next&lt;/strong&gt; metodundan yararlanılmaktadır. &amp;Ccedil;oğu zaman oygun programlamada şekilsel olarak bazı oyun karakterlerinin saha &amp;uuml;zerinde rastgele konumlarda &amp;ccedil;ıkması istenebilir. İşte bu noktada Random sınıfına ait metodlar ve WPF ile gelen yeni şekil &amp;ccedil;izme teknikleri işimizi olduk&amp;ccedil;a kolaylaştırmaktadır.&lt;/p&gt;
&lt;p&gt;Kod yardımıyla ger&amp;ccedil;ekleştirilen &amp;ouml;rneklerde dikkat edilmesi gereken noktalardan birisi, oluşturulan şekillerin mutlaka bir taşıyıcıya eklenmiş olmalarıdır. S&amp;ouml;z gelimi yukarıdaki &amp;ouml;rneklerde Ellips nesne &amp;ouml;rnekleri Grid bileşenine alt element olarak, &lt;strong&gt;Children&lt;/strong&gt; &amp;ouml;zelliğinin &lt;strong&gt;Add&lt;/strong&gt; metodundan yararlanılarak eklenmektedir. Son pencereye(&lt;strong&gt;Window&lt;/strong&gt;) ilişkin olarak aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde &amp;ccedil;alışma zamanında&lt;strong&gt;(run-time)&lt;/strong&gt; oluşabilecek bir &amp;ouml;rnek &amp;ccedil;ıktı yer almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk223_1.gif" alt="" width="300" height="249" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sıradaki &amp;ouml;rneğimizde poligonların nasıl &amp;ccedil;izilebileceğini incelemeye &amp;ccedil;alışacağız. Poligonlar, &amp;ccedil;ok sayıda k&amp;ouml;şeden oluşabilen ve kapalı olarak tasarlanabilen şekillerdir. Poligonlar sayesinde basit bir &amp;uuml;&amp;ccedil;gen &amp;ccedil;izilebileceği gibi bir onaltıgen' de &amp;ccedil;izilebilir. Yada d&amp;uuml;zensiz bir kapalı şekil oluşturulabilir. Burada &amp;ouml;nemli olan k&amp;ouml;şe noktalarının belirlenmesidir. K&amp;ouml;şe noktalarının belirlenmesinde &lt;strong&gt;Point&lt;/strong&gt; tipinden yararlanılır. Point tipi x ve y koordinatlarını b&amp;uuml;nyesinde taşımaktadır. &lt;strong&gt;Polygon&lt;/strong&gt; tipi, k&amp;ouml;şe noktalarını &lt;strong&gt;Points&lt;/strong&gt; isimli bir koleksiyonda taşımaktadır. Şimdi aşağıdaki &lt;strong&gt;XAML&lt;/strong&gt; i&amp;ccedil;eriğini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Window x:Class="GrafiklerleCalismak.PolygonKullanimi" xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation" xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml" Background="White" Title="Polygon Kullanımı" Height="300" Width="403"&amp;gt;
    &amp;lt;Grid&amp;gt;
        &amp;lt;Polygon Fill="Gold" FillRule="Nonzero" Stroke="Black" StrokeThickness="2"&amp;gt;
            &amp;lt;Polygon.Points&amp;gt;
                &amp;lt;Point X="20" Y="20" /&amp;gt;
                &amp;lt;Point X="120" Y="20" /&amp;gt;
                &amp;lt;Point X="120" Y="120" /&amp;gt;
                &amp;lt;Point X="220" Y="120" /&amp;gt;
                &amp;lt;Point X="220" Y="220" /&amp;gt;
            &amp;lt;/Polygon.Points&amp;gt;
        &amp;lt;/Polygon&amp;gt;
        &amp;lt;Polygon Fill="LightSkyBlue" FillRule="Nonzero" Stroke="Black" StrokeThickness="2"&amp;gt;
            &amp;lt;Polygon.Points&amp;gt;
                &amp;lt;Point X="20" Y="20"/&amp;gt;
                &amp;lt;Point X="120" Y="20"/&amp;gt;
                &amp;lt;Point X="120" Y="120"/&amp;gt;
                &amp;lt;Point X="220" Y="120"/&amp;gt;
                &amp;lt;Point X="220" Y="220"/&amp;gt;
            &amp;lt;/Polygon.Points&amp;gt;
            &amp;lt;Polygon.LayoutTransform&amp;gt;
                &amp;lt;RotateTransform Angle="-45"/&amp;gt;
            &amp;lt;/Polygon.LayoutTransform&amp;gt;
        &amp;lt;/Polygon&amp;gt;
    &amp;lt;/Grid&amp;gt;
&amp;lt;/Window&amp;gt;&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnekte iki adet &lt;strong&gt;Polygon&lt;/strong&gt; elementi tanımlanmıştır. Bunlardan ikincisine -45 derecelik bir a&amp;ccedil;ısal d&amp;ouml;nd&amp;uuml;rme işlemi uygulanmıştır. Her iki Polygon nesne &amp;ouml;rneğinin k&amp;ouml;şe noktaları &lt;strong&gt;Polygon.Points&lt;/strong&gt; alt elementi&lt;strong&gt;(child element) &lt;/strong&gt; i&amp;ccedil;erisinde yer alan &lt;strong&gt;Point&lt;/strong&gt; alt elementleri ile belirtilmektedir. Polygon nesnelerinin kenar &amp;ccedil;izgileri &lt;strong&gt;Stroke&lt;/strong&gt; ve &lt;strong&gt;StrokTickness&lt;/strong&gt; niteliklerine atanan değerler yardımıyla set edilmiştir. Diğer taraftan Polygon' ların dolgu rengi &lt;strong&gt;Fill&lt;/strong&gt; &amp;ouml;zelliklerine atanan standart fır&amp;ccedil;a&lt;strong&gt;(Brush)&lt;/strong&gt; renkleri ile ayarlanmaktadır. S&amp;ouml;z konusu XAML i&amp;ccedil;eriğinin Visual Studio 2008 Beta 2 ortamındaki tasarım zamanı&lt;strong&gt;(design-time)&lt;/strong&gt; &amp;ccedil;ıktısı ise aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk223_5.gif" alt="" width="401" height="302" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bir poligon kod yardımıylada oluşturulabilir. Sıradaki &amp;ouml;rneğimizde bir &amp;uuml;&amp;ccedil;genin kod yardımıyla oluşturulması ve d&amp;uuml;ğmeye basılaraktan onbeşer derecelik artan a&amp;ccedil;ılar ile d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi &amp;ouml;rneklenmektedir. Bu ama&amp;ccedil;la yeni penceremize(Window) ait XAML ve kod i&amp;ccedil;eriklerini aşağıdaki gibi tasarladığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;XAML i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Window x:Class="GrafiklerleCalismak.KodYardimiylaPolygonKullanimi" xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation" xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml" Background="White" Title="Kod Yardımıyla Polygon" Height="300" Width="300"&amp;gt;
    &amp;lt;Grid Name="grdTahta"&amp;gt;
        &amp;lt;Button Height="23" HorizontalAlignment="Left" Margin="8,19,0,0" Name="button1" VerticalAlignment="Top" Width="75" Click="button1_Click"&amp;gt;&amp;Ccedil;evir&amp;lt;/Button&amp;gt;
    &amp;lt;/Grid&amp;gt;
&amp;lt;/Window&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Kod i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Shapes;
using System.Timers;

namespace GrafiklerleCalismak
{
    public partial class KodYardimiylaPolygonKullanimi : Window
    {
        Polygon plgy;
        int sayac = 1;

        private void Cizdir()
        {
            plgy = new Polygon();
            plgy.Points.Add(new Point(50, 50));
            plgy.Points.Add(new Point(150, 50));
            plgy.Points.Add(new Point(150, 150));
            plgy.Stroke = new SolidColorBrush(Colors.LightSalmon);
            plgy.StrokeThickness = 2;
            grdTahta.Children.Add(plgy);
        }

        public KodYardimiylaPolygonKullanimi()
        {
            InitializeComponent();
            Cizdir();
        }
    
        private void button1_Click(object sender, RoutedEventArgs e)
        {
            plgy.LayoutTransform = new RotateTransform(sayac*15);
            sayac++;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Penceremizin yapıcı metodu(&lt;strong&gt;constructor&lt;/strong&gt;) i&amp;ccedil;erisinde Cizdir metodu ile bir &lt;strong&gt;Polygon&lt;/strong&gt; nesne &amp;ouml;rneği oluşturulmakta ve &lt;strong&gt;Grid&lt;/strong&gt; kontrol&amp;uuml;n&amp;uuml;n alt elementi olarak eklenmektedir. Polygon nesne &amp;ouml;rneği bir &amp;uuml;&amp;ccedil;geni temsil edeceğinden &lt;strong&gt; Points&lt;/strong&gt; koleksiyonunda sadece &amp;uuml;&amp;ccedil; nokta(&lt;strong&gt;Point&lt;/strong&gt;) eklemesi yapılmıştır. D&amp;ouml;nd&amp;uuml;rme işleminin ger&amp;ccedil;ekleştirildiği yer d&amp;uuml;ğmenin &lt;strong&gt;Click&lt;/strong&gt; olay&lt;strong&gt;(event)&lt;/strong&gt; metodudur. Burada dikkat edilecek olursa yine &lt;strong&gt; LayoutTransform&lt;/strong&gt; &amp;ouml;zelliğine bir değer ataması yapılmaktadır. Bu atama sırasında yeni bir &lt;strong&gt;RotateTransform&lt;/strong&gt; nesnesi &amp;ouml;rneklenmekte ve parametre olarak artan bir a&amp;ccedil;ı değer verilmektedir. Uygulama test edildiğinde &amp;ccedil;alışma zamanında aşağıdaki Flash animasyonunda yer alan &amp;ccedil;ıktı elde edilecektir. &lt;em&gt;(Flash dosyasını g&amp;ouml;rebilmek i&amp;ccedil;in Flasy Player' ın sisteminizde y&amp;uuml;kl&amp;uuml; olması gerekmektedir.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;object id="obj3" width="300" height="300" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/mk223_Video3.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="300" height="300" src="http://www.buraksenyurt.com/makale/images/mk223_Video3.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj3" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;Şimdiki &amp;ouml;rneğimizde d&amp;uuml;z &amp;ccedil;izgileri nasıl &amp;ccedil;izdirebileceğimizi incelemeye &amp;ccedil;alışacağız. D&amp;uuml;z &amp;ccedil;izgi i&amp;ccedil;in &lt;strong&gt;Line&lt;/strong&gt; tipi kullanılmaktadır. Bir &amp;ccedil;izgi i&amp;ccedil;in belkide en &amp;ouml;nemli &amp;ouml;zellikler &lt;strong&gt; Stroke&lt;/strong&gt;, &lt;strong&gt;StrokeTickness&lt;/strong&gt;, &lt;strong&gt;X1, X2, Y1&lt;/strong&gt; ve &lt;strong&gt;Y2&lt;/strong&gt;' dir. X ve Y &amp;ouml;zellikleri yardımıyla &amp;ccedil;izginin başlangı&amp;ccedil; ve bitiş noktaları belirlenir. &amp;Ouml;rneğin aşağıdaki XAML i&amp;ccedil;eriğini ele alalım.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Window x:Class="GrafiklerleCalismak.LineKullanimi" xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation" xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml" Background="White" Title="Line Kullanimi" Height="211" Width="237"&amp;gt;
    &amp;lt;Grid&amp;gt;
        &amp;lt;Line Stroke="RosyBrown" StrokeThickness="2" X1="10" Y1="10" X2="50" Y2="50"/&amp;gt;
        &amp;lt;Line Stroke="Brown" StrokeThickness="3" X1="50" Y1="50" X2="100" Y2="50"/&amp;gt;
        &amp;lt;Line Stroke="BurlyWood" StrokeThickness="4" X1="100" Y1="50" X2="50" Y2="140"/&amp;gt;
        &amp;lt;Line Stroke="CadetBlue" StrokeThickness="5" X1="50" Y1="140" X2="180" Y2="50"/&amp;gt;
    &amp;lt;/Grid&amp;gt;
&amp;lt;/Window&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu i&amp;ccedil;eriğin tasarım zamanındaki(design-time) &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk223_10.gif" alt="" width="257" height="229" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere farklı kalınlık, renk ve lokasyonlarda yer alan &amp;ccedil;izgiler elde edilmektedir. &amp;Ccedil;izgiler &amp;ouml;zellikle kod tarafındada zaman zaman ele alınırlar. S&amp;ouml;z gelimi bir harita &amp;uuml;zerinden bir şehirden bir şehire doğru olabilecek hava yolu rotalarının belirlenmesi amacıyla &amp;ccedil;izgilerden yararlanılabilir. Bunu &amp;ccedil;ok basit olarak sembolize etmek amacıyla aşağıdaki XAML ve kod i&amp;ccedil;eriğini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;XAML i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Window x:Class="GrafiklerleCalismak.KodYardimiylaLineKullanimi" xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation" xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml" Background="White" Title="Kod Yardımıyla Line Kullanımı" Height="249" Width="422" WindowStyle="SingleBorderWindow"&amp;gt;
    &amp;lt;Grid Name="grdTahta"&amp;gt;
        &amp;lt;Image Name="imgHarita" MouseDown="imgHarita_MouseDown" MouseUp="imgHarita_MouseUp" Source="map_world_destination.gif" /&amp;gt;
    &amp;lt;/Grid&amp;gt;
&amp;lt;/Window&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Kod i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Shapes;

namespace GrafiklerleCalismak
{
    public partial class KodYardimiylaLineKullanimi : Window
    {
        Point basilanNokta;

        public KodYardimiylaLineKullanimi()
        {
            InitializeComponent();
        }

        private void imgHarita_MouseDown(object sender, MouseButtonEventArgs e)
        {
            basilanNokta=e.GetPosition(grdTahta); 
        }

        private void imgHarita_MouseUp(object sender, MouseButtonEventArgs e)
        { 
            Line yol = new Line();
            yol.Stroke = new SolidColorBrush(Colors.Red);
            yol.StrokeThickness = 2;
            yol.X1 = basilanNokta.X;
            yol.Y1 = basilanNokta.Y;
            Point bitisNoktasi = e.GetPosition(grdTahta);
            yol.X2 = bitisNoktasi.X;
            yol.Y2 = bitisNoktasi.Y;
            grdTahta.Children.Add(yol);
        }        
    }
}&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rnekte haritayı g&amp;ouml;stermesi i&amp;ccedil;in bir &lt;strong&gt;Image&lt;/strong&gt; kontrol&amp;uuml; kullanılmaktadır. Image kontrol&amp;uuml;n&amp;uuml;n &lt;strong&gt;source&lt;/strong&gt; &amp;ouml;zelliğine atanan değer ile arka plan d&amp;uuml;nya haritası olarak g&amp;ouml;sterilmektedir. Kullanıcılar &amp;ccedil;alışma zamanında mouse' un tuşuna basıp bir noktadan başka bir noktaya gittiklerinde ve mouse' un tuşunu bıraktıklarında &lt;strong&gt;Line&lt;/strong&gt; nesne &amp;ouml;rneği oluşturulmaktadır. Bunun i&amp;ccedil;in Image kontrol&amp;uuml; &amp;uuml;zerinde mouse tuşuna basılma ve bırakılma anlarının yakalanması gerekir.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z konusu anlar aşina olduğumuz &lt;strong&gt;MouseDown&lt;/strong&gt; ve &lt;strong&gt;MouseUp&lt;/strong&gt; olay metodlarında yakalanırlar. GDI+ ile aynı işlemleri nasıl yaptığımızı hatırlarsak eğer, kontrol&amp;uuml;n MouseDown olayına gelen parametre ile X ve Y değerlerini ayır ayrı aldığımızı g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Burada durum biraz daha farklıdır. Nitekim MouseUp ve MouseDown olay metodlarında yer alan &lt;strong&gt;MouseButtonEventArgs&lt;/strong&gt; parametresi, mouse tuşuna basıldığında o noktadaki X ve Y koordinatlarını yeni bir &lt;strong&gt; Point&lt;/strong&gt; tipi olarak geriye d&amp;ouml;nd&amp;uuml;rmektedir. &lt;strong&gt;GetPosition&lt;/strong&gt; metodu X ve Y koordinatları, &amp;uuml;zerinden alınmak istenen kontrol&amp;uuml;de parametre olarak alır. &amp;Ouml;rnekte bu parametreye &lt;strong&gt;Grid&lt;/strong&gt; kontrol&amp;uuml;n&amp;uuml;n referansı verilmiştir. Dolayısıyla Grid kontrol&amp;uuml;ndeki X ve Y değerleri elde edilebilmektedir.&lt;/p&gt;
&lt;p&gt;Mouse &amp;uuml;zerinde basılan tuş bırakıldığında ise &amp;ccedil;izginin &amp;ccedil;izilme işlemi ger&amp;ccedil;ekleştirilmektedir. &lt;strong&gt; Line&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt;X1&lt;/strong&gt; ve &lt;strong&gt;Y1&lt;/strong&gt; değerleri tahmin edileceği gibi, &lt;strong&gt;MouseDown&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &lt;strong&gt;GetPosition&lt;/strong&gt; ile elde edilen basilanNokta değişkeninden gelmektedir. &amp;Ccedil;izginin son noktası ise bu kez &lt;strong&gt;MouseUp&lt;/strong&gt; olay metodu i&amp;ccedil;erisindeki &lt;strong&gt; GetPosition&lt;/strong&gt; &amp;ccedil;ağrısı ile alınmakta ve &lt;strong&gt;Line&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt; X2&lt;/strong&gt; ve &lt;strong&gt;Y2&lt;/strong&gt; değerlerine aktarılmaktadır. Son olarak oluşturulan &amp;ccedil;izgi, &lt;strong&gt;Grid&lt;/strong&gt; bileşenine alt element olarak eklenmektedir. Bu ekleme işleminin bize getirdiği &amp;ouml;nemli bir avantaj vardır. Yine GDI+ ile Windows programlama yaptığımızı d&amp;uuml;ş&amp;uuml;necek olursak, aynı senaryoda ekrana &amp;ccedil;izgiler &amp;ccedil;izdirmek i&amp;ccedil;in &lt;strong&gt;Graphics&lt;/strong&gt; nesnesninin &lt;strong&gt;DrawLine&lt;/strong&gt; metodundan yararlanıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;Ne varki bu metod hep son &amp;ccedil;izginin &amp;ccedil;izilmesine &amp;ouml;ncekilerin ise kaybolmasına neden olmaktadır. Oysaki WPF mimarisinde şekiller bir taşıyıcının alt elementi olarak eklendiklerinden son &amp;ccedil;izilen şekilden &amp;ouml;ncekiler ekrandan kaybolmamaktadır. Bu durumu &lt;strong&gt;GDI&lt;/strong&gt;+ ile Windows programlamada ger&amp;ccedil;eklemek i&amp;ccedil;in WPF'tekine benzer bir mantık ile hareket edilmekte ve ekranda duran &amp;ccedil;izgilerin s&amp;uuml;rekli hatırlanması i&amp;ccedil;in koleksiyonalardan yararlanılması gerekmektedir. Yukarıdaki kodun &amp;ccedil;alışma zamanındaki ekran &amp;ccedil;ıktısı aşağıdaki Flash animasyonunda olduğu gibidir.&lt;em&gt;(Flash dosyasını g&amp;ouml;rebilmek i&amp;ccedil;in Flasy Player' ın sisteminizde y&amp;uuml;kl&amp;uuml; olması gerekmektedir.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;object id="obj2" width="420" height="248" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/mk223_Video2.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="420" height="248" src="http://www.buraksenyurt.com/makale/images/mk223_Video2.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj2" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;Bu &amp;ouml;rneği daha da geliştirmeye &amp;ccedil;alışmanızı &amp;ouml;neririm. Olduk&amp;ccedil;a fazla eksiği var. S&amp;ouml;z gelimi, mouse tuşuna basıp s&amp;uuml;r&amp;uuml;klerken farklı renkte bir &amp;ccedil;izginin &amp;ccedil;ıkartılarak gidilen rotanın g&amp;ouml;sterilmesi sağlanabilir. Mouse bırakıldığında ise asıl rengini alan rota ortaya &amp;ccedil;ıkar. &amp;Uuml;stelik &amp;ouml;rnek kodda sağ tuşa veya sol tuş kontrol&amp;uuml; yapılmamıştır. Belkide klavyeden tuş kombinasyonları katarak sadece d&amp;uuml;z &amp;ccedil;izgi değil eğrilerin &amp;ccedil;izdirilmesinide sağlayabiliriz. Bu &amp;ouml;rneğin geliştirilmesini siz değerli okurlarıma bırakıyorum.&lt;/p&gt;
&lt;p&gt;Gelelim &lt;strong&gt;Path&lt;/strong&gt; bileşenine. Bu tip aslında kendi i&amp;ccedil;erisinde birden fazla d&amp;uuml;z &amp;ccedil;izgi veya eğriyi barındırabilecek şekilde tasarlanmıştır. Temelde şekiller birbirleriyle u&amp;ccedil; uca eklenecen şekilde yeni bir grafik oluşturmaktadırlar. Dilerseniz &amp;ouml;rnek &amp;uuml;zerinden ilerleyerek konuyu daha iyi anlamaya &amp;ccedil;alışalım. Bu ama&amp;ccedil;la aşağıdaki gibi bir XAML i&amp;ccedil;eriği oluşturduğumuzu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Window x:Class="GrafiklerleCalismak.PathKullanimi" xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation" xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml" Background="White"
Title="Path Kullanimi(Birbirlerine Bağlı Farklı Şekiller)" Height="261" Width="321"&amp;gt;
    &amp;lt;Grid&amp;gt;
        &amp;lt;Path Stroke="Black" StrokeThickness="2"&amp;gt;
            &amp;lt;Path.Data&amp;gt; 
                &amp;lt;PathGeometry&amp;gt;
                    &amp;lt;PathFigure&amp;gt;
                        &amp;lt;BezierSegment Point1="0,0" Point2="10,120" Point3="70,40"/&amp;gt;
                        &amp;lt;ArcSegment SweepDirection="Clockwise" Point="150,125" Size="50,50" IsLargeArc="True" RotationAngle="60"/&amp;gt;
                        &amp;lt;LineSegment Point="240,40"/&amp;gt;
                        &amp;lt;QuadraticBezierSegment Point1="35,135" Point2="75,75"/&amp;gt;
                        &amp;lt;PolyLineSegment&amp;gt;
                            &amp;lt;PolyLineSegment.Points&amp;gt;
                                &amp;lt;Point X="10" Y="10"/&amp;gt;
                                &amp;lt;Point X="50" Y="75"/&amp;gt;
                            &amp;lt;/PolyLineSegment.Points&amp;gt;
                        &amp;lt;/PolyLineSegment&amp;gt;
                        &amp;lt;PolyBezierSegment&amp;gt;
                            &amp;lt;PolyBezierSegment.Points&amp;gt;
                                &amp;lt;Point X="100" Y="100"/&amp;gt;
                                &amp;lt;Point X="150" Y="150"/&amp;gt;
                                &amp;lt;Point X="75" Y="180"/&amp;gt;
                            &amp;lt;/PolyBezierSegment.Points&amp;gt;
                        &amp;lt;/PolyBezierSegment&amp;gt;
                    &amp;lt;/PathFigure&amp;gt;
                &amp;lt;/PathGeometry&amp;gt;
            &amp;lt;/Path.Data&amp;gt;
        &amp;lt;/Path&amp;gt;
    &amp;lt;/Grid&amp;gt;
&amp;lt;/Window&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Path&lt;/strong&gt; elementi i&amp;ccedil;erisinde farklı şekillerin u&amp;ccedil; uca eklenmesi işini geometri tipleri &amp;uuml;stlenmektedir. Bu geometri tipleride kendi i&amp;ccedil;lerinde segmentler halinde şekilleri barındırmaktadır. Kullanılabilecek olan geometri tipleri aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk223_12.gif" alt="" width="132" height="126" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekte s&amp;ouml;z konusu geometri tiplerinden &lt;strong&gt;PathGeometry&lt;/strong&gt; kullanılmaktadır. PathGeometry elementinin altında yer alan t&amp;uuml;m şekiller &lt;strong&gt;Segment&lt;/strong&gt; anahtar kelimesi ile bitmektedir. Buna g&amp;ouml;re, &lt;strong&gt;BezierSegment&lt;/strong&gt; ile başlayan şekiller dizisi sırasıyla, &lt;strong&gt;ArcSegment&lt;/strong&gt;, &lt;strong&gt;LineSegment&lt;/strong&gt;, &lt;strong&gt;QuadraticBezierSegment&lt;/strong&gt;, &lt;strong&gt; PolyLineSegment&lt;/strong&gt; ve &lt;strong&gt;PolyBezierSegment&lt;/strong&gt; ile devam eder. T&amp;uuml;m bu alt elementleri farklı nitelikleri ile değişik &amp;ccedil;izgilerin oluşturulması sağlanmaktadır. &lt;strong&gt;BezierSegment&lt;/strong&gt; elementinin nitekikleri sayesinde &amp;uuml;&amp;ccedil; noktadan b&amp;uuml;k&amp;uuml;lm&amp;uuml;ş bir eğri &amp;ccedil;izimi yapılabilmektedir. &lt;strong&gt;ArcSegment&lt;/strong&gt; elementinin nitelikleri ile, başlangı&amp;ccedil; koordiantları, genişlik y&amp;uuml;kseklik değerleri, eğilme a&amp;ccedil;ısı ve saat y&amp;ouml;n&amp;uuml; yada saatin ters y&amp;ouml;n&amp;uuml;nde &amp;ccedil;izilecek yaylar oluşturulabilmektedir. Burada &lt;strong&gt;PolyLineSegment&lt;/strong&gt;' i altında belirtilen noktalar u&amp;ccedil; uca bağlı d&amp;uuml;z &amp;ccedil;izgilerin oluşturulmasını sağlarken, &lt;strong&gt;PolyBezierSegment&lt;/strong&gt; elementi altındaki noktalarda, u&amp;ccedil; uca eklenmiş eğrilerin oluşturulmasını sağlamaktadır. &amp;Ouml;rneğin tasarım zamanındaki &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk223_11.gif" alt="" width="337" height="278" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edilecek olursa, t&amp;uuml;m &amp;ccedil;izgiler ister eğri ister d&amp;uuml;z olsunlar, u&amp;ccedil; uca eklenerekten birleştirilmiştir. Bu nedenle Path tipini &amp;ouml;rneğin harita gibi arka planlarda yolların birleştirilmesi amacıyla kullanabiliriz.&lt;/p&gt;
&lt;p&gt;Bu yazımızda son olarak basit anlamda d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme&lt;strong&gt;(Transform)&lt;/strong&gt; işlemlerine bakıyor olacağız. Transform denilince aklımıza gelmesi gerekenler bir şeklin y&amp;ouml;n, b&amp;uuml;y&amp;uuml;kl&amp;uuml;k, d&amp;uuml;zlemsel koordinat gibi değerlerinin değiştirilmesidir. Bu sayede bir şekli herhangibir a&amp;ccedil;ıda d&amp;ouml;nd&amp;uuml;rebilir, ebatlarını ayarlayabilir yada herhangibir d&amp;uuml;zlem &amp;uuml;zerinde &amp;ouml;teleyebiliriz. Transform işlemlerinde beş farklı tip rol oynamaktadır. Bu tipler aşağıdaki gibidir.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;RotateTransform&lt;/strong&gt; : Şeklin belirtilen bir a&amp;ccedil;ıda, kendi ekseninde yada belirtilen orijine g&amp;ouml;re farklı bir eksende d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesini sağlamak i&amp;ccedil;in kullanılır. S&amp;ouml;z gelimi bir şeklin farklı a&amp;ccedil;ılardan g&amp;ouml;sterilmesinin sağlanmasında &amp;ouml;nemli rol oynamaktadır.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;ScaleTransform&lt;/strong&gt; : Şeklin ebatlarının eşit oranda yada farklı oranlarda arttırılması yada azaltılmasında kullanılır. &amp;Ouml;rneğin Zoom işlemlerinde bu tip &amp;ccedil;ok faydalı olacaktır.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;SkewTransform&lt;/strong&gt; : Şeklin b&amp;uuml;k&amp;uuml;lmesini yada eğilmesini sağlamak amacıyla kullanılan tiptir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;TranslateTransform&lt;/strong&gt; : Şeklin x veya y d&amp;uuml;zlemleri &amp;uuml;zerinde farklı noktalara &amp;ouml;telenmesi amacıyla kullanılan tiptir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;MatrixTransform&lt;/strong&gt; : Resim işlemede &amp;ouml;nemli bir yere sahip olan matris algoritmalarının iki boyutlu şekiller &amp;uuml;zerinde de uygulanabilmesini sağlayan tiptir. Diğer Transform tipleri ile ger&amp;ccedil;ekleştirilmesi zor olan d&amp;ouml;n&amp;uuml;şt&amp;uuml;rmelerde kullanılmaktadır. Bu tipi ilerleyen yazılarımızda ele almaya &amp;ccedil;alışacağız.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Şimdi basit bir &amp;ouml;rnek ile &lt;strong&gt; RotateTransform&lt;/strong&gt; ve &lt;strong&gt;ScaleTransform&lt;/strong&gt; tiplerinin nasıl kullanılabileceğini incelemeye &amp;ccedil;alışalım. Bu ama&amp;ccedil;la XAML ve kod i&amp;ccedil;eriklerini aşağıdaki gibi geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk223_13.gif" alt="" width="351" height="312" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;XAML i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Window x:Class="GrafiklerleCalismak.TransformKullanimi" xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation" xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml" Background="White" Title="Transform Kullanımı" Height="292" Width="330"&amp;gt;
    &amp;lt;Grid Name="grdTahta" Width="309" Height="253"&amp;gt;
        &amp;lt;Rectangle Fill="Gold" Stroke="Black" StrokeThickness="2" Name="dortgen" Width="100" Height="40" /&amp;gt;
        &amp;lt;Slider Minimum="1" Maximum="5" ValueChanged="sldScale_ValueChanged" Height="21" Margin="110,14,89,0" Name="sldScale" VerticalAlignment="Top" /&amp;gt;
        &amp;lt;Label Height="23" HorizontalAlignment="Left" Margin="0,12,0,0" Name="label1" VerticalAlignment="Top" Width="92"&amp;gt;Scale Transform&amp;lt;/Label&amp;gt;
        &amp;lt;Slider Height="21" Margin="110,49,89,0" Maximum="360" Minimum="0" Name="sldRotate" ValueChanged="sldRotate_ValueChanged" VerticalAlignment="Top" /&amp;gt;
        &amp;lt;Label Height="23" HorizontalAlignment="Left" Margin="0,47,0,0" Name="label2" VerticalAlignment="Top" Width="92"&amp;gt;Rotate Transform&amp;lt;/Label&amp;gt;
    &amp;lt;/Grid&amp;gt;
&amp;lt;/Window&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Kod i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Shapes;

namespace GrafiklerleCalismak
{
    public partial class TransformKullanimi : Window
    {
        public TransformKullanimi()
        {
            InitializeComponent(); 
        }

        private void sldScale_ValueChanged(object sender, RoutedPropertyChangedEventArgs&amp;lt;double&amp;gt; e)
        {
            TransformYap();
        }

        private void sldRotate_ValueChanged(object sender, RoutedPropertyChangedEventArgs&amp;lt;double&amp;gt; e)
        {
            TransformYap();
        }

        private void TransformYap()
        {
            if (sldRotate != null
                &amp;amp;&amp;amp; sldScale != null)
            {
                TransformGroup grp = new TransformGroup();
                grp.Children.Add(new ScaleTransform(sldScale.Value, sldScale.Value));
                grp.Children.Add(new RotateTransform(sldRotate.Value));
                dortgen.LayoutTransform = grp;
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Kullanıcı Slider kontrollerindeki &amp;ccedil;ubuğu hareket ettirdik&amp;ccedil;e ekran &amp;uuml;zerindeki d&amp;ouml;rtgenin kendi ekseni &amp;uuml;zerinde d&amp;ouml;nmesi veya b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;n&amp;uuml;n değişmesi ama&amp;ccedil;lanmaktadır. Bu, aynı şekle birden fazla d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işleminin uygulanmasını gerektirmektedir. Bir başka deyişle &lt;strong&gt;Rectangle&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt;LayoutTransform&lt;/strong&gt; &amp;ouml;zelliğine hem &lt;strong&gt;ScaleTransform&lt;/strong&gt; hemde &lt;strong&gt;RotateTransform&lt;/strong&gt; nesne &amp;ouml;rneklerinin atanması gerekmektedir. Bunun i&amp;ccedil;in &lt;strong&gt;TransformGroup&lt;/strong&gt; adı verilen nesne &amp;ouml;rneklerinden yararlanılır. TransformGroup tipi, sahip olduğu &lt;strong&gt;Children&lt;/strong&gt; &amp;ouml;zelliği ile sunduğu koleksiyon i&amp;ccedil;erisinde farklı &lt;strong&gt;Transform&lt;/strong&gt; tiplerini taşıyabilmektedir. Dolayısıyla TransformYap metodu i&amp;ccedil;erisinde bu şekilde bir kodlama yapılmaktadır. Uygulamanın &amp;ccedil;alışma zamanındaki g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdaki Flash animasyonunda olduğu gibidir.&lt;em&gt;(Flash dosyasını g&amp;ouml;rebilmek i&amp;ccedil;in Flasy Player' ın sisteminizde y&amp;uuml;kl&amp;uuml; olması gerekmektedir. Dosya boyutu 220 Kb olduğundan y&amp;uuml;klenmesi zaman alabilir.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;object id="obj1" width="328" height="292" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/mk223_Video1.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="328" height="292" src="http://www.buraksenyurt.com/makale/images/mk223_Video1.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj1" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalemizde WPF(Windows Presentation Foundation) uygulamalarında iki boyutlu grafik&lt;strong&gt;(2D Graphics)&lt;/strong&gt; işlemlerinde kullanılabilecek şekilleri ele almaya &amp;ccedil;alıştık. Son olarak basit bir transform işleminin &amp;ouml;rnek bir d&amp;ouml;rtgen &amp;uuml;zerinde nasıl ger&amp;ccedil;ekleştirileceğine değindik. Buradaki bilgilerden yola &amp;ccedil;ıkarak &amp;ccedil;ok daha kolay grafik işlemleri ger&amp;ccedil;ekleştirebileceğimizi ve eski Windows programlamadaki &lt;strong&gt;GDI+&lt;/strong&gt; ile zorlandığımız vakkaları daha etkin bir bi&amp;ccedil;imde yapabileceğimizi g&amp;ouml;rm&amp;uuml;ş bulunuyoruz. İlerleyen makalelerimizde WPF ile ilişkili başka konularada değiniyor olacağız.Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/GrafiklerleCalismak.rar"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2007-09-18 09:00:00</pubDate>
  <slug>WPF-Grafik-Islemlerinde-Sekillerin(Shapes)-Kullanc4b1mc4b1-bsenyurt-com-dan</slug>
  <tags>
    <tag>wpf</tag>
    <tag>shapes</tag>
  </tags>
  <categories>
    <category>WPF</category>
  </categories>
</post>