<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net Temelleri : Tablo Bazlı Resimleri Ele Almak</title>
  <description>Bir Windows uygulaması göz önüne alındığında, resimleri gösterebilecek bir PictureBox kontrolünün çeşitli özellikleriden yararlanarak herhangibir tabloda tutulan binary içeriği kullanmak ve bu içeriğin işaret ettiği resmi göstermek son derece kolaydır...</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Yazın bu sıcak g&amp;uuml;nlerinde daha hafif konularla web maceralarımıza devam ediyoruz. Ge&amp;ccedil;tiğimiz makalemizde Asp.Net uygulamalarında ektin hata y&amp;ouml;netiminin nasıl yapılabileceğini incelemeye &amp;ccedil;alışmıştık. Bu kez veritabanı tablolarında &amp;ccedil;oğunlukla binary alanlarda saklanan resimlerin, Asp.Net uygulamalarında nasıl ele alınabileceğini &amp;ouml;rnek projeler &amp;uuml;zerinden incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;Bir Windows uygulaması g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında, resimleri g&amp;ouml;sterebilecek bir &lt;strong&gt;PictureBox&lt;/strong&gt; kontrol&amp;uuml;n&amp;uuml;n &amp;ccedil;eşitli &amp;ouml;zellikleriden yararlanarak herhangibir tabloda tutulan binary i&amp;ccedil;eriği kullanmak ve bu i&amp;ccedil;eriğin işaret ettiği resmi g&amp;ouml;stermek son derece kolaydır. Ne varki Asp.Net uygulamalarında her zaman i&amp;ccedil;in, &lt;strong&gt;render&lt;/strong&gt; edilerek istemciye g&amp;ouml;nderilen bir sayfa i&amp;ccedil;eriği mevcuttur. Bu i&amp;ccedil;eriğin tipi&lt;strong&gt;(Content Type)&lt;/strong&gt; daha farklıdır. Dolayısıyla binary formatta tutulan resimleri ele almak i&amp;ccedil;in farklı bir yaklaşım gerekmektedir.&lt;/p&gt;
&lt;p&gt;Tabloda binary formatta tutulabilen resimleri Asp.Net uygulamalarında ele almak amacıyla, g&amp;ouml;sterilmek istenen resmi tek başına yorumlayan bir Asp.Net sayfası mevcuttur. Bu sayfanın tek bir g&amp;ouml;revi vardır o da ilgili resmi &lt;strong&gt;image&lt;/strong&gt; formatlarından uygun olana g&amp;ouml;re sayfaya &lt;strong&gt;Render&lt;/strong&gt; etmektir. Bunu incemelek i&amp;ccedil;in &amp;ouml;rnek bir senaryo g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almakta fayda olacağı kanısındayım. Bu ama&amp;ccedil;la &lt;strong&gt;SQL Server 2005&lt;/strong&gt; ile birlikte gelen ve Production şemasında&lt;strong&gt;(Schema)&lt;/strong&gt; bulunan &lt;strong&gt;Product, ProductPhoto&lt;/strong&gt; ve &lt;strong&gt;ProductProductPhoto&lt;/strong&gt; tabloları g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Bu tablolar arasındaki ilişki kısaca aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk215_1.gif" alt="" width="459" height="405" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;ProductPhoto isimli tabloda yer alan &lt;strong&gt; ThumbNailPhoto&lt;/strong&gt; ve &lt;strong&gt;LargePhoto&lt;/strong&gt; isimli alanlarda &lt;strong&gt;binary&lt;/strong&gt; olarak &amp;uuml;r&amp;uuml;n resimleri saklanmaktadır&lt;em&gt;(tam olarak varbinary tipinde)&lt;/em&gt;. Buna g&amp;ouml;re ilk &amp;ouml;rnek senaryomuzda kullanıcılar &amp;uuml;r&amp;uuml;nlerin listelendiği bir sayfadan detay bilgilerini almak i&amp;ccedil;in başka bir sayfaya ge&amp;ccedil;iş yapacaklardır. Detayların verildiği sayfada &amp;uuml;r&amp;uuml;ne ait &lt;strong&gt;ThumbNailPhoto&lt;/strong&gt; i&amp;ccedil;eriğide bir resim olarak sayfa g&amp;ouml;sterilecektir. Başlamadan &amp;ouml;nce ProductPhoto tablosundaki herhangibir ThumbNailPhoto alanının i&amp;ccedil;eriğini resim olarak nasıl g&amp;ouml;sterebileceğimize bakalım. Bu ama&amp;ccedil;la ResimGoster.aspx isimli aşağıdaki gibi bir sayfa tasarlanarak işe başlanabilir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" AutoEventWireup="true" CodeFile="ResimGoster.aspx.cs" Inherits="ResimGoster" %&amp;gt;&lt;/pre&gt;
&lt;p&gt;Eminimki ResimGoster isimli web sayfasının i&amp;ccedil;eriği son derece ilgin&amp;ccedil; gelmiştir. Nitekim herhangibir HTML elementi yer almamaktadır. Aslında bu sayfanın tek amacı y&amp;uuml;klenirken&lt;em&gt;(bir başka deyişle &lt;strong&gt;Page_Load&lt;/strong&gt; olay metodu &amp;ccedil;alışırken)&lt;/em&gt;, &amp;uuml;r&amp;uuml;n resmini ekrana &lt;strong&gt;binary&lt;/strong&gt; olarak yazdırmaktır. Burada elbetteki hangi resmin g&amp;ouml;sterileceğide &amp;ouml;nemlidir. Bunun i&amp;ccedil;in sayfaya bir şekilde ProductPhotoID alanının değerinin gelmesi gerekmektedir. Bunun i&amp;ccedil;in en g&amp;uuml;zel yol &lt;strong&gt; QueryString&lt;/strong&gt; kullanımıdır. &amp;Ouml;yleyse bu sayfanın kodlarını yazarak işe devam edelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void Page_Load(object sender, EventArgs e)
{ 
    string resimId = Request.QueryString["ResimId"];
    if (!String.IsNullOrEmpty(resimId))
    {
        byte[] resimBytes=null;
        using (SqlConnection conn = new SqlConnection("data source=localhost;database=AdventureWorks;integrated security=SSPI"))
        {
            SqlCommand cmd = new SqlCommand("Select ThumbNailPhoto From Production.ProductPhoto  Where ProductPhotoId=@PhotoId", conn);
            cmd.Parameters.AddWithValue("@PhotoId", resimId);
            conn.Open();
            SqlDataReader reader = cmd.ExecuteReader(CommandBehavior.SequentialAccess);
            if(reader.Read())
                resimBytes = reader.GetSqlBytes(0).Value;
            reader.Close();
            if (resimBytes != null)
            {
                Response.ContentType = "image/gif";
                Response.BinaryWrite(resimBytes);
            }
            else
                Response.Write("Resim g&amp;ouml;sterilemiyor.");
        } 
    }
    else
        Response.Write("ResimId parametresi eksik yada hatalı.");
}&lt;/pre&gt;
&lt;p&gt;Page_Load olay metodu i&amp;ccedil;erisinde ilk olarak &lt;strong&gt;HttpRequest&lt;/strong&gt; sınıfının static &lt;strong&gt;QueryString&lt;/strong&gt; &amp;ouml;zelliği yardımıyla sayfaya gelen ResimId değeri alınmaktadır. Kullanıcıların bu sayfayı doğrudan talep etme ihtimaline g&amp;ouml;re ResimId değerinin boş gelme olasılığı bulunmaktadır. Bu nedenle &lt;strong&gt;String&lt;/strong&gt; sınıfının &lt;strong&gt; IsNullOrEmpty&lt;/strong&gt; metodu ile bir kontrol ger&amp;ccedil;ekleştirilir. Sonrasında ise Production şemasındaki ProductPhoto tablosunda gelen değere g&amp;ouml;re ilgili ThumbNailPhoto alanı &amp;ccedil;ekilir.&lt;/p&gt;
&lt;p&gt;Eğer gelen ResimId ile eşleşen bir ProductPhotoId alanı var ise bu satırın ThumbNailPhoto alanının değeri &lt;strong&gt;SqlDataReader&lt;/strong&gt; nesne &amp;ouml;rneğine ait &lt;strong&gt;Read&lt;/strong&gt; metodu yardımıyla okunur. Okuma işlemi sırasında &lt;strong&gt;GetSqlBytes&lt;/strong&gt; metodu kullanılmakta ve &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliği ile elde edilen &lt;strong&gt;byte&lt;/strong&gt; dizisi resimBytes isimli alana aktarılmaktadır. Diğer taraftan &lt;strong&gt;HttpResponse&lt;/strong&gt; sınıfının &lt;strong&gt;ContentType&lt;/strong&gt; &amp;ouml;zelliği ile render edilecek sayfanın i&amp;ccedil;eriği belirlenmektedir. Burada &lt;strong&gt;image/gif&lt;/strong&gt; değeri ile basılacak i&amp;ccedil;eriğin gif formatında bir resim olacağı belirtilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ContentType&lt;/strong&gt; &amp;ouml;zelliğinin varsayılan değeri &lt;strong&gt;text/HTML&lt;/strong&gt; dir. Bu değer, tahmin edileceği &amp;uuml;zere sayfanın &amp;ccedil;ıktısının HTML olarak &amp;uuml;retileceğini işaret etmektedir. Yaygın olarak kullanılan diğer versiyonlar aşağıdaki gibidir.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;image/gif&lt;/li&gt;
&lt;li&gt;image/jpeg&lt;/li&gt;
&lt;li&gt;text/plain&lt;/li&gt;
&lt;li&gt;application/vnd.ms-excel (&amp;ccedil;ıktının excel d&amp;ouml;k&amp;uuml;manı olmasını sağlar)&lt;/li&gt;
&lt;li&gt;application/vnd.ms-word (&amp;ccedil;ıktının word d&amp;ouml;k&amp;uuml;manı olmasını sağlar)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Son olarak, elde edilen byte dizisinin &amp;ccedil;ıktıya aktarılmasını sağlamak i&amp;ccedil;in yine &lt;strong&gt;HttpResponse&lt;/strong&gt; sınıfının &lt;strong&gt;static&lt;/strong&gt; metodlarından &lt;strong&gt;BinaryWrite&lt;/strong&gt; &amp;ccedil;ağırılmaktadır.&lt;/p&gt;
&lt;p&gt;Artık sayfayı test ederek işlemlerimize devam edebiliriz. Elbette doğru sonu&amp;ccedil;ları g&amp;ouml;rebilmek i&amp;ccedil;in ResimId parametresini Url satırından g&amp;ouml;ndermekte fayda vardır. Aşağıda &amp;ouml;rnek olarak &lt;strong&gt;120&lt;/strong&gt; numaralı ProductPhotoId değerine sahip satır i&amp;ccedil;in elde edilen &amp;ccedil;ıktı g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk215_2.gif" alt="" width="473" height="157" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada, &amp;uuml;retilen HTML sayfasının kaynak kodlarına bakılmak istenirse tarayıcı buna izin vermeyebilir&lt;em&gt;(&amp;Ouml;rneğin Microsoft Internet Explorer 7.0 View Source buna izin vermemiştir)&lt;/em&gt;. Bu sebepten &amp;ccedil;ıktıyı &lt;strong&gt;Save As&lt;/strong&gt; ile kaydetmek gerekebilir. Kaydedilen &amp;ccedil;ıktının i&amp;ccedil;eriği aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer aldığı gibi olacaktır. Dikkat edilecek olursa sayfanın &amp;ccedil;ıktısı sonucu oluşturulan i&amp;ccedil;erikte &lt;strong&gt; img&lt;/strong&gt; elementi ve &lt;strong&gt;src&lt;/strong&gt; niteliği yer almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk215_5.gif" alt="" width="592" height="146" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Elbette satır olarak karşılığı olmayan bir ResimId değeri girilirse sayfa &amp;ccedil;ıktısı tarayıcı penceresinde aşağıdaki gibi olacaktır. &amp;Ouml;rneğin ProductPhotoId değeri 17 olan bir satır bulunmamaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk215_4.gif" alt="" width="458" height="129" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bununla birlikte kullanıcı bu sayfayı doğrudan talep eder ve ResimId parametresini kullanmassa aşağıdaki ekran &amp;ccedil;ıktısını elde eder.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk215_3.gif" alt="" width="401" height="138" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada olası bazı hataların &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ilmek amacıyla basit tedbirler alınmış ve ekrana bilgi mesajları verilmiştir. Ger&amp;ccedil;ek hayat uygulamalarında son kullanıcıların daha doğru ve etkin bir şekilde uyarılması bir başka deyişle oluşan hatalar konusunda bilgilendirilmesi gerekmektedir.&lt;/p&gt;
&lt;p&gt;Artık tek yapılması gereken senaryoyu biraz daha kullanışlı hale getirmektir. Bu ama&amp;ccedil;la &amp;uuml;r&amp;uuml;nlerin g&amp;ouml;sterildiği Urunler.aspx isimli basit bir web sayfası tasarlanarak devam edilbilir. Bu sayfada &amp;uuml;r&amp;uuml;nlere ait bir ka&amp;ccedil; temel bilgi bulunacak ama detayları i&amp;ccedil;in başka bir sayfaya y&amp;ouml;nlendirmede bulunulacaktır. Y&amp;ouml;nlendirilme yapılan sayfa tahmin edileceği &amp;uuml;zere &amp;uuml;r&amp;uuml;ne ait resmide i&amp;ccedil;eren bir detay sayfasıdır. Urunler.aspx sayfasında basit olarak bir &lt;strong&gt;SqlDataSource&lt;/strong&gt; kontrol&amp;uuml; ve bu kontrol&amp;uuml; ele alan bir &lt;strong&gt;GridView&lt;/strong&gt; bileşeni d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Buna g&amp;ouml;re Urunler.aspx sayfasının kaynak kod tarafı aşağıdaki gibi tasarlanabilir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" AutoEventWireup="true" CodeFile="Urunler.aspx.cs" Inherits="_Default" %&amp;gt;

&amp;lt;!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"&amp;gt;

&amp;lt;html xmlns="http://www.w3.org/1999/xhtml" &amp;gt;
&amp;lt;head runat="server"&amp;gt;
    &amp;lt;title&amp;gt;Urunler&amp;lt;/title&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body&amp;gt;
    &amp;lt;form id="form1" runat="server"&amp;gt;
        &amp;lt;div&amp;gt;
            &amp;lt;asp:GridView ID="GridView1" runat="server" AutoGenerateColumns="False" DataKeyNames="ProductID" DataSourceID="dsProducts"&amp;gt;
                &amp;lt;Columns&amp;gt;
                    &amp;lt;asp:HyperLinkField DataNavigateUrlFields="ProductId" DataNavigateUrlFormatString="UrunDetay.aspx?PrdId={0}" DataTextField="Name" HeaderText="Urun Adı" /&amp;gt;
                    &amp;lt;asp:BoundField DataField="ListPrice" DataFormatString="{0:C}" HeaderText="Liste Fiyatı" HtmlEncode="False" SortExpression="ListPrice" /&amp;gt;
                &amp;lt;/Columns&amp;gt;
            &amp;lt;/asp:GridView&amp;gt;
            &amp;lt;asp:SqlDataSource ID="dsProducts" runat="server" ConnectionString="&amp;lt;%$ ConnectionStrings:AdvConStr %&amp;gt;" SelectCommand="SELECT Top 20 ProductID, Name, ListPrice FROM Production.Product Where ListPrice&amp;gt;=1000"&amp;gt;
            &amp;lt;/asp:SqlDataSource&amp;gt;
        &amp;lt;/div&amp;gt;
    &amp;lt;/form&amp;gt;
&amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Urunler.aspx sayfasında yer alan GridView kontrol&amp;uuml;nde &lt;strong&gt;HyperLinkField&lt;/strong&gt; kontrol&amp;uuml; kullanılmaktadır. Bu alan, &amp;uuml;r&amp;uuml;n&amp;uuml;n adını(Name) g&amp;ouml;stermekte olup &amp;uuml;zerine tıklandığında kullanıcıyı UrunDetay.aspx sayfasına g&amp;ouml;ndermektedir. Bu işlem sırasında da PrdId isimli bir &lt;strong&gt;QueryString&lt;/strong&gt; parametresi ProductId alanının değerini detay sayfasına taşımaktadır. Urunler.aspx isimli sayfanın &amp;ccedil;alışma zamanındaki &amp;ccedil;ıktısı aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer aldığı gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk215_6.gif" alt="" width="363" height="611" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim UrunDetay.aspx sayfasına. Bu sayfada basit olarak Urunler.aspx sayfasında se&amp;ccedil;ilen &amp;uuml;r&amp;uuml;nlere ait detay bilgileri g&amp;ouml;sterilecektir. Ancak &amp;ouml;nemli olan, se&amp;ccedil;ilen &amp;uuml;r&amp;uuml;n&amp;uuml;n resmininde ProductPhoto tablosundan binary olarak &amp;ccedil;ekilerek ekrana bastırılacak olmasıdır. Bu ama&amp;ccedil;la tasarlanan Urunler.aspx sayfasında yine bir &lt;strong&gt; SqlDataSource&lt;/strong&gt; kontrol&amp;uuml; ve detaylar i&amp;ccedil;in &lt;strong&gt;DetailsView&lt;/strong&gt; bileşeni aşağıdaki gibi kullanılabilir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" AutoEventWireup="true" CodeFile="UrunDetay.aspx.cs" Inherits="UrunDetay" %&amp;gt;

&amp;lt;!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"&amp;gt;

&amp;lt;html xmlns="http://www.w3.org/1999/xhtml" &amp;gt;
&amp;lt;head runat="server"&amp;gt;
    &amp;lt;title&amp;gt;Urun Detaylari&amp;lt;/title&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body&amp;gt;
    &amp;lt;form id="form1" runat="server"&amp;gt;
        &amp;lt;div&amp;gt;&amp;Uuml;r&amp;uuml;n Detayları :&amp;lt;br /&amp;gt;
            &amp;lt;asp:DetailsView ID="DetailsView1" runat="server" AutoGenerateRows="False" DataSourceID="dsProductDetails" Height="50px" Width="294px"&amp;gt;
                &amp;lt;Fields&amp;gt;
                    &amp;lt;asp:BoundField DataField="Name" HeaderText="&amp;Uuml;r&amp;uuml;n Adı" SortExpression="Name" /&amp;gt;
                    &amp;lt;asp:BoundField DataField="ProductNumber" HeaderText="&amp;Uuml;r&amp;uuml;n Numarası" SortExpression="ProductNumber" /&amp;gt;
                    &amp;lt;asp:BoundField DataField="SafetyStockLevel" HeaderText="Stok Seviyesi" SortExpression="SafetyStockLevel" /&amp;gt;
                    &amp;lt;asp:BoundField DataField="ReorderPoint" HeaderText="Sipariş Noktası" SortExpression="ReorderPoint" /&amp;gt;
                    &amp;lt;asp:BoundField DataField="ListPrice" HeaderText="Liste Fiyatı" SortExpression="ListPrice" DataFormatString="{0:C}" HtmlEncode="False" /&amp;gt;
                    &amp;lt;asp:BoundField DataField="StandardCost" HeaderText="Standart Maliyet" SortExpression="StandardCost" DataFormatString="{0:C}" /&amp;gt;
                    &amp;lt;asp:TemplateField HeaderText="Urun Resmi"&amp;gt;
                        &amp;lt;ItemTemplate&amp;gt;
                            &amp;lt;img alt="&amp;Uuml;r&amp;uuml;n Resmi" runat="server" src='&amp;lt;%#"ResimGoster.aspx?ResimID="+DataBinder.Eval(Container.DataItem, "ProductPhotoID") %&amp;gt;' id="urunResmi" /&amp;gt;
                        &amp;lt;/ItemTemplate&amp;gt;
                    &amp;lt;/asp:TemplateField&amp;gt;
                &amp;lt;/Fields&amp;gt;
            &amp;lt;/asp:DetailsView&amp;gt;
            &amp;lt;asp:SqlDataSource ID="dsProductDetails" runat="server" ConnectionString="&amp;lt;%$ ConnectionStrings:AdvConStr %&amp;gt;" SelectCommand="SELECT Production.Product.ProductID, Production.Product.Name, Production.Product.ProductNumber, Production.Product.SafetyStockLevel, Production.Product.ReorderPoint, Production.Product.ListPrice, Production.Product.StandardCost, Production.ProductProductPhoto.ProductPhotoID FROM Production.Product INNER JOIN Production.ProductProductPhoto ON Production.Product.ProductID =Production.ProductProductPhoto.ProductID WHERE (Production.Product.ProductID = @PrdId)"&amp;gt;
                &amp;lt;SelectParameters&amp;gt;
                    &amp;lt;asp:QueryStringParameter DefaultValue="1" Name="PrdId" QueryStringField="PrdId" /&amp;gt;
                &amp;lt;/SelectParameters&amp;gt;
            &amp;lt;/asp:SqlDataSource&amp;gt; 
        &amp;lt;/div&amp;gt;
    &amp;lt;/form&amp;gt;
&amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;UrunDetay.aspx isimli web sayfasında dikkat edilmesi ve &amp;uuml;zerinde durulması gereken bazı noktalar vardır. &amp;Ouml;ncelikli olarak &lt;strong&gt;SqlDataSource&lt;/strong&gt; kontrol&amp;uuml;nde kullanılan sorgu basit olarak aşağıdaki şekilde yer aldığı&lt;em&gt;(Query Builder ile elde edilmiştir)&lt;/em&gt; gibi Product ve ProductProductPhoto tablolarının &lt;strong&gt;join&lt;/strong&gt; ile birleştirilmiş bir halidir ve ProductId değerinin &lt;strong&gt;where&lt;/strong&gt; ifadesinde ele almaktadır. Nitekim &amp;uuml;r&amp;uuml;n resminin ProductPhoto tablosundan tedariki i&amp;ccedil;in ProductPhotoID değerinin bilinmesi gerekmektedir. Bu nedenle Product ve ProductProductPhoto tabloarı Join ile birleştirilmiştir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk215_7.gif" alt="" width="553" height="301" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Diğer taraftan &lt;strong&gt;DetailsView&lt;/strong&gt; kontrol&amp;uuml; i&amp;ccedil;erisindede resmin g&amp;ouml;sterilebilmesi i&amp;ccedil;in bir &lt;strong&gt;TemplateField&lt;/strong&gt; kullanılmış ve &lt;strong&gt;ItemTemplate&lt;/strong&gt; şablonu i&amp;ccedil;erisinde &lt;strong&gt;img&lt;/strong&gt; elementi aşağıdaki gibi kullanılmıştır.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:TemplateField HeaderText="Urun Resmi"&amp;gt;
                        &amp;lt;ItemTemplate&amp;gt;
                            &amp;lt;img alt="&amp;Uuml;r&amp;uuml;n Resmi" runat="server" src='&amp;lt;%#"ResimGoster.aspx?ResimID="+DataBinder.Eval(Container.DataItem, "ProductPhotoID") %&amp;gt;' id="urunResmi" /&amp;gt;
                        &amp;lt;/ItemTemplate&amp;gt;
                    &amp;lt;/asp:TemplateField&amp;gt;&lt;/pre&gt;
&lt;p&gt;Burada dikkat edilmesi gereken en &amp;ouml;nemli nokta &lt;strong&gt;src&lt;/strong&gt; &lt;strong&gt;niteliğine(attribute)&lt;/strong&gt; değer atamasının nasıl yapıldığıdır. &lt;strong&gt;DataBinder&lt;/strong&gt; sınıfının &lt;strong&gt;Eval&lt;/strong&gt; metodunu kullanarak o anki satırın i&amp;ccedil;erisinde yer alan ProdcutPhotoId değeri ResimGoster.aspx sayfasına ResimID adlı parametre ile g&amp;ouml;nderilmektedir. Buda yazımızın başında tasarladığımız ResimGoster sayfasının &amp;ccedil;ağırılması ve bir resim i&amp;ccedil;eriğinin elde edilerek buradaki img kontrol&amp;uuml; i&amp;ccedil;erisinde g&amp;ouml;sterilmesi anlamına gelmektedir. Sonu&amp;ccedil; itibariyle UrunDetay.aspx sayfası test edildiğinde aşağıdakine benzer bir ekran &amp;ccedil;ıktısı ile karşılaşılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk215_8.gif" alt="" width="431" height="316" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Buraya kadar yaptıklarımızı &amp;ouml;zetleyecek olursak eğer, binary olarak tutulan resimlerin g&amp;ouml;sterilmesi i&amp;ccedil;in izlenebilecek yollardan birisinin adımları aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;İlk olarak resim i&amp;ccedil;eriğini &lt;strong&gt; binary&lt;/strong&gt; olarak tarayıcıya basabilecek bir aspx sayfası tasarlanır.&lt;/li&gt;
&lt;li&gt;Sayfanın amacı gereği aspx kaynağında(Source) sadece &lt;strong&gt;Page&lt;/strong&gt; direktifi bırakılır ve diğer i&amp;ccedil;erik silinir. Bu zorunlu değildir. Ancak tavsiye edilen yoldur.&lt;/li&gt;
&lt;li&gt;Sayfanın &lt;strong&gt;Page_Load&lt;/strong&gt; olay metodu kodlanır.&lt;/li&gt;
&lt;li&gt;Page_Load olay metodunda g&amp;ouml;sterilmek istenen resme ait satırın bulunabilmesi i&amp;ccedil;in &lt;strong&gt; QueryString&lt;/strong&gt;' den yararlanılabilir.&lt;/li&gt;
&lt;li&gt;Resme ait binary i&amp;ccedil;eriğin kod tarafında &lt;strong&gt;byte&lt;/strong&gt; &lt;strong&gt;dizisi(byte[])&lt;/strong&gt; şeklinde ele alınması sağlanır.&lt;/li&gt;
&lt;li&gt;Elde edilen byte dizisinin sayfaya resim olarak basılmasını sağlamak i&amp;ccedil;in &amp;ouml;nce &lt;strong&gt;ContentType&lt;/strong&gt; &amp;ouml;zelliğinin değeri &lt;strong&gt;image/gif&lt;/strong&gt; veya &lt;strong&gt;image/jpeg&lt;/strong&gt; olarak belirlenir.&lt;/li&gt;
&lt;li&gt;Resmi yazdırmak i&amp;ccedil;inse &lt;strong&gt; BinaryWrite&lt;/strong&gt; metodu &amp;ccedil;ağırılır.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Buradaki &amp;ouml;rnek g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında istemci sayısının fazla olacağı d&amp;uuml;ş&amp;uuml;nelecek olursa performansı arttırmak adına parametre bazlı olacak şekilde &lt;strong&gt;&amp;ouml;n bellekleme(Caching) &lt;/strong&gt; yapılması sağlanabilir. B&amp;ouml;ylece ResimGoster.aspx sayfasının s&amp;uuml;rekli olarak &lt;strong&gt;Page_Load&lt;/strong&gt; kodlarını &amp;ccedil;alıştırmasının &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ilmiş olunur.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Resimlerin &amp;ccedil;ok sık değişmediği d&amp;uuml;ş&amp;uuml;n&amp;uuml;l&amp;uuml;yorsa ve SQL Server kullanılıyorsa tablo bağımlı bir &amp;ouml;n belleklemede yapılabilir&lt;strong&gt;(Sql Cache Dependency)&lt;/strong&gt;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;S&amp;ouml;z gelimi ResimGoster.aspx dosyasının i&amp;ccedil;eriği aşağıdaki gibi değiştirilerek sayfanın &amp;ccedil;ıktısının belirli bir s&amp;uuml;reliğine&lt;em&gt;(&amp;ouml;rneğin 60 saniye boyunca)&lt;/em&gt; &amp;ouml;n bellekte tutulması sağlanabilir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" AutoEventWireup="true" CodeFile="ResimGoster.aspx.cs" Inherits="ResimGoster" %&amp;gt;
&amp;lt;%@ OutputCache Duration="60" VaryByParam="ResimID" %&amp;gt;&lt;/pre&gt;
&lt;p&gt;Gelelim resimlerin işlenmesi ile ilgili diğer bir yaklaşıma. &amp;Ouml;rnekte resmi g&amp;ouml;steren &lt;strong&gt;img&lt;/strong&gt; elementinin &lt;strong&gt; src&lt;/strong&gt; niteliğinde bir url adresinden yararlanılmaktadır. Elbetteki bu işlem programatik olarak kod &amp;uuml;zerindende geliştirilebilir. &amp;Ouml;rneğin &amp;uuml;r&amp;uuml;n bilgilerini bir DataList kontrol&amp;uuml; &amp;uuml;zerinde g&amp;ouml;stermek istediğimizi varsayalım. Bu kez resim alanlarının &lt;strong&gt;DataList&lt;/strong&gt; kontrol&amp;uuml; i&amp;ccedil;erisindeki &lt;strong&gt;img&lt;/strong&gt; elementinin &lt;strong&gt;src&lt;/strong&gt; niteliğine bağlanmasını kod tarafından ger&amp;ccedil;ekleştirmeye &amp;ccedil;alışacağız. Bu ama&amp;ccedil;la aşağıdaki gibi UrunListesi.aspx isimli bir web sayfası hazırlanarak işlemlere devam edilebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk215_9.gif" alt="" width="323" height="326" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;form id="form1" runat="server"&amp;gt;
    &amp;lt;div&amp;gt;
        &amp;lt;asp:DataList ID="DataList1" runat="server" DataSourceID="dsProducts" Width="600px"&amp;gt;
            &amp;lt;ItemTemplate&amp;gt;
                &amp;lt;table&amp;gt;
                    &amp;lt;tr&amp;gt;
                       &amp;lt;td colspan="2"&amp;gt;
                            &amp;lt;asp:Label ID="NameLabel" runat="server" Font-Italic="True" ForeColor="#000040" Text='&amp;lt;%# Eval("Name") %&amp;gt;'&amp;gt;&amp;lt;/asp:Label&amp;gt;
                        &amp;lt;/td&amp;gt;
                        &amp;lt;td style="width: 100px; text-align: right"&amp;gt;
                            &amp;lt;asp:Label ID="ProductIDLabel" runat="server" Font-Bold="True" ForeColor="#C00000" Text='&amp;lt;%# Eval("ProductID") %&amp;gt;'&amp;gt;&amp;lt;/asp:Label&amp;gt;
                        &amp;lt;/td&amp;gt;
                    &amp;lt;/tr&amp;gt;
                    &amp;lt;tr&amp;gt;
                        &amp;lt;td rowspan="3" style="width: 100px"&amp;gt;
                            &amp;lt;img runat="server" id="urunResmi" alt="Urun Resmi" src="" /&amp;gt;
                        &amp;lt;/td&amp;gt;
                        &amp;lt;td style="width: 100px"&amp;gt;Standart Maliyet&amp;lt;/td&amp;gt;
                        &amp;lt;td style="width: 100px"&amp;gt;
                            &amp;lt;asp:Label ID="StandardCostLabel" runat="server" Text='&amp;lt;%# Eval("StandardCost", "{0:C}") %&amp;gt;'&amp;gt;&amp;lt;/asp:Label&amp;gt;
                        &amp;lt;/td&amp;gt;
                    &amp;lt;/tr&amp;gt;
                    &amp;lt;tr&amp;gt;
                        &amp;lt;td style="width: 100px"&amp;gt;Liste Fiyatı&amp;lt;/td&amp;gt;
                        &amp;lt;td style="width: 100px"&amp;gt;
                            &amp;lt;asp:Label ID="ListPriceLabel" runat="server" Text='&amp;lt;%# Eval("ListPrice", "{0:C}") %&amp;gt;'&amp;gt;&amp;lt;/asp:Label&amp;gt;
                        &amp;lt;/td&amp;gt;
                    &amp;lt;/tr&amp;gt;
                    &amp;lt;tr&amp;gt;
                        &amp;lt;td style="width: 100px"&amp;gt;Sınıf&amp;lt;/td&amp;gt;
                        &amp;lt;td style="width: 100px"&amp;gt;
                            &amp;lt;asp:Label ID="ClassLabel" runat="server" Text='&amp;lt;%# Eval("Class") %&amp;gt;'&amp;gt;&amp;lt;/asp:Label&amp;gt;
                        &amp;lt;/td&amp;gt;
                    &amp;lt;/tr&amp;gt;
                    &amp;lt;tr&amp;gt;
                        &amp;lt;td colspan="3"&amp;gt;&amp;lt;hr /&amp;gt;&amp;lt;/td&amp;gt;
                    &amp;lt;/tr&amp;gt;
                &amp;lt;/table&amp;gt;
            &amp;lt;/ItemTemplate&amp;gt;
        &amp;lt;/asp:DataList&amp;gt;
        &amp;lt;asp:SqlDataSource ID="dsProducts" runat="server" ConnectionString="&amp;lt;%$ ConnectionStrings:AdvConStr %&amp;gt;" SelectCommand="SELECT Top 20 P.ProductID, P.Name, P.StandardCost, P.ListPrice, PP.ProductPhotoID, P.Class FROM Production.Product P INNER JOIN Production.ProductProductPhoto PP ON P.ProductID = PP.ProductID WHERE P.ListPrice&amp;gt;1400"&amp;gt;
        &amp;lt;/asp:SqlDataSource&amp;gt;
    &amp;lt;/div&amp;gt;
&amp;lt;/form&amp;gt;&lt;/pre&gt;
&lt;p&gt;UrunListesi.aspx sayfasında yer alan &lt;strong&gt; DataList&lt;/strong&gt; kontrol&amp;uuml; Production şemasındaki Product ve ProductProductPhoto tablolarının birleşiminden oluşan sonu&amp;ccedil; k&amp;uuml;mesinden ilk 20 satırı g&amp;ouml;stermek &amp;uuml;zere tasarlanmıştır ve hatta ListePrice alanına g&amp;ouml;re filtreleme eklenmiştir. Burada &amp;ouml;zellikle &amp;uuml;zerinde durmamız gereken nokta, img elementidir. &lt;strong&gt;ItemTemplate&lt;/strong&gt; &amp;uuml;zerindeki tablo i&amp;ccedil;erisine yerleştirilen &lt;strong&gt;img&lt;/strong&gt; elementinin &lt;strong&gt;src&lt;/strong&gt; niteliğini kod tarafında ele alabilmek i&amp;ccedil;in DataList kontrol&amp;uuml;n&amp;uuml;n &lt;strong&gt;ItemDataBound&lt;/strong&gt; olayından yararlanılabilir. Bu olay metodu i&amp;ccedil;erisinde s&amp;ouml;z konusu img elementi bulunmalı ve src niteliğine o anki satırın ProductPhotoId değeri &lt;strong&gt; QueryString&lt;/strong&gt; parametresi olarak aktarılmalıdır. O halde bu ama&amp;ccedil;la aşağıdaki kod par&amp;ccedil;asını yazmamız yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void DataList1_ItemDataBound(object sender, DataListItemEventArgs e)
{
    if (e.Item.ItemType == ListItemType.Item
        || e.Item.ItemType == ListItemType.AlternatingItem)
    {
        // &amp;Ouml;nce ProductPhotoId değeri bulunmalı
        string resimId = DataBinder.Eval(e.Item.DataItem, "ProductPhotoId").ToString();
        // img elementi bulunmalı ve src niteliğinin değeri değiştirilmeli.
        HtmlImage resimElementi = (HtmlImage)e.Item.FindControl("urunResmi");
        resimElementi.Src = "~/ResimGoster.aspx?ResimId=" + resimId;
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;ItemDataBound&lt;/strong&gt; olayı &lt;strong&gt;DataList&lt;/strong&gt; i&amp;ccedil;erisindeki her bir satır i&amp;ccedil;in &amp;ccedil;alışacağından, işlemleri sadece &lt;strong&gt;Item&lt;/strong&gt; ve &lt;strong&gt;AlternatingItem&lt;/strong&gt; tipindeki satırlarda yapmakta fayda vardır. Bu ama&amp;ccedil;la &lt;strong&gt;DataListItemEventArgs&lt;/strong&gt; tipinden olan e isimli parametrenin &amp;ouml;zelliklerinden faydalanılmaktadır. Sonrasında ise o anki satır ile gelen ProductPhotoId değerinin elde edilmesi gerekmektedir. Bu ama&amp;ccedil;lada &lt;strong&gt;DataBinder&lt;/strong&gt; sınıfının &lt;strong&gt;Eval&lt;/strong&gt; metodu ele alınmaktadır. İlk parametre ile o anki veri satırı yakalanmakta, ikinci parametre ilede s&amp;ouml;z konusu veri satırındaki &lt;strong&gt;ProductPhotoId&lt;/strong&gt; değeri istenmektedir. Eval metodu geriye Object tipinden bir değer d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml; i&amp;ccedil;in bilin&amp;ccedil;li olarak string tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lm&amp;uuml;şt&amp;uuml;r. Nitekim url katarında kullanılacak bilgi string' dir.&lt;/p&gt;
&lt;p&gt;Bu işlemlerin ardından img kontrol&amp;uuml;n&amp;uuml;n elde edilmesi sağlanır. Bunun i&amp;ccedil;inde &lt;strong&gt;e.Item&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt; FindControl&lt;/strong&gt; metodu &amp;ccedil;ağırılmıştır. &lt;strong&gt;FindControl&lt;/strong&gt; metodunun parametresi kontrol&amp;uuml;n id değerinin işaret etmektedir. Hatırlanacağı &amp;uuml;zere img kontrol&amp;uuml;n&amp;uuml;n id niteliğine kaynak tarafında urunResmi adı verilmiştir. &lt;strong&gt;img&lt;/strong&gt; kontrol&amp;uuml; &lt;strong&gt;HtmlImage&lt;/strong&gt; tipinden bir kontrold&amp;uuml;r ve FindControl metodu geriye &lt;strong&gt;Control&lt;/strong&gt; tipinden bir referans d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml;nden sonu&amp;ccedil; referansı bilin&amp;ccedil;li olarak HtmlImage tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lm&amp;uuml;şt&amp;uuml;r. Son olarak elde edilen HtmlImage kontrol&amp;uuml;ne ait referans &amp;uuml;zerinden Src niteliğinin değeri değiştirilir. Burada yapılan işlem t&amp;uuml;m yazı boyunca &amp;uuml;zerinde durduğumuz konudur. Uygulamayı bu haliyle &amp;ccedil;alıştırdığımızda aşağıdakine benzer bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk215_10.gif" alt="" width="363" height="518" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu makalemizde tablolarda &lt;strong&gt;binary&lt;/strong&gt; olarak tutulan resim alanlarını web sayfalarında k&amp;uuml;&amp;ccedil;&amp;uuml;k bir hile ile nasıl işleyebileceğimizi incelemeye &amp;ccedil;alıştık. G&amp;ouml;rsellik hemen hemen t&amp;uuml;m uygulamalarda &amp;ouml;nemli bir fakt&amp;ouml;r olduğundan resim alanlarının bu şekilde ele alınıyor olmasını bilmek &amp;ouml;nemli bir avantaj sağlamaktadır. Kullanılan teknikte &amp;ouml;nemli olan nokta binary alanın i&amp;ccedil;eriğini tek başına ele alıp resim formatında &amp;ccedil;ıktı veren bir sayfanın var olmasıdır. Ayrıca resmi g&amp;ouml;steren kontrol&amp;uuml;n basit bir &lt;strong&gt;img&lt;/strong&gt; bileşeni olduğuna ve &lt;strong&gt; src&lt;/strong&gt; niteliğinin &amp;ouml;nemine dikkat edilmelidir. Bu sayfanın &amp;ccedil;ıktısı &amp;ouml;rneklerden de g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi pek &amp;ccedil;ok farklı bi&amp;ccedil;imde kullanılabilir ve son kullanıcıya g&amp;ouml;rsel olarak daha doyurucu bir i&amp;ccedil;erik sağlanabilir. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/admin/app/editor/makale/http:/www.buraksenyurt.com/makale/images/ImageKullanimi.zip"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2007-07-26 12:00:00</pubDate>
  <slug>Asp-Net-Temelleri-Tablo-Bazlc4b1-Resimleri-Ele-Almak-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet</tag>
    <tag>c#</tag>
    <tag>b-l-o-b</tag>
    <tag>large-objects</tag>
  </tags>
  <categories>
    <category>Asp.Net</category>
  </categories>
</post>