<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WF - ExternalDataExchange, Local Services ve CallExternalMethodActivity</title>
  <description>Birden fazla aktivitenin aynı fonksiyonları ortaklaşa kullanabilmeleri nasıl sağlanır? Yani bir fonksiyonun birden fazla aktivite içerisinde kullanılması gerektiği durumlarda nasıl bir yol izleyebiliriz?</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f9%2fblg81_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Artık yazın bittiği, okulların a&amp;ccedil;ıldığı, şehrin kalabalığının arttığı bu g&amp;uuml;nlerde birde sağnak yağışlar işin i&amp;ccedil;erisine girince, insan ister istemez tatilde &amp;uuml;zerinden denize atladığı bir iskelede olmak istiyor. Artık o iskelenin etrafında fazla insan yok ve yağmur y&amp;uuml;z&amp;uuml;nden tahtaların &amp;uuml;zerinde gizemli bir şekilde akan su birikintileri var; diyerek yaptığımız duygusal girişimizin aslında yazımızın ilerleyen kısmı ile bir alakası yok. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Ama yine b&amp;ouml;yle yağmurlu bir g&amp;uuml;nde cama vuran damlacıkları izlerken &lt;strong&gt;Workflow Foundation&lt;/strong&gt; ile ilişkili d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m ve aklıma gelen bir konunun &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;n&amp;uuml; sizlerle paylaşmak niyetindeyim.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;İhtiya&amp;ccedil; : &lt;/strong&gt;Birden fazla aktivitenin aynı fonksiyonları ortaklaşa kullanabilmeleri nasıl sağlanır? Yani bir fonksiyonun birden fazla aktivite i&amp;ccedil;erisinde kullanılması gerektiği durumlarda nasıl bir yol izleyebiliriz?&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;Ccedil;&amp;ouml;z&amp;uuml;m :&lt;/strong&gt; B&amp;ouml;yle bir ihtiya&amp;ccedil;ta metodların kod i&amp;ccedil;eriklerini t&amp;uuml;m aktivitelerde &amp;ouml;rneğin &lt;strong&gt;CodeActivity&lt;/strong&gt; bileşenleri i&amp;ccedil;erisinde değerlendirebiliriz. Ama bu durumda merkezileştirilmemiş ve g&amp;uuml;ncelleştirmeler sırasında kullanıldığı t&amp;uuml;m aktivitelerde d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmesi gereken bir &amp;ccedil;&amp;ouml;z&amp;uuml;m &amp;uuml;retmiş oluruz. Aslında bir yol olarak s&amp;ouml;z konusu fonksiyonellikleri ortak bir k&amp;uuml;t&amp;uuml;phane i&amp;ccedil;erisinde toplayabilir ve yine CodeActivity' ler i&amp;ccedil;erisinden &amp;ccedil;ağırabiliriz. Lakin bu noktada değerlendirebileceğimiz başka bir &amp;ccedil;&amp;ouml;z&amp;uuml;m daha vardır ve ger&amp;ccedil;ekten araştırılmaya değerdir. Buna g&amp;ouml;re,&lt;strong&gt; Local Service&lt;/strong&gt; olarak &amp;ccedil;alışma zamanına eklenmiş bir aray&amp;uuml;zden yararlanılabilir ve ortak fonksiyonelliklerin bu aray&amp;uuml;z &amp;uuml;zerinden aktiviteler ile mesajlaşması sağlanabilir.&lt;/p&gt;
&lt;p&gt;Burada kritik olan nokta &lt;strong&gt;ExternalDataExchange&lt;/strong&gt; &lt;strong&gt;niteliği(attribute)&lt;/strong&gt;&amp;nbsp;ile&amp;nbsp;işaretleniş&amp;nbsp;bir &lt;strong&gt;aray&amp;uuml;z&amp;uuml;(Interface)&lt;/strong&gt; implemente eden bir tipin fonksiyonelliklerinin, herhangibir aktivite tarafından kullanılabilir hale gelmesidir. Tabi bu kullanımı sağlamak i&amp;ccedil;in&amp;nbsp;&lt;strong&gt;CallExternalMethodActivity &lt;/strong&gt;aktivite tipinden yararlanılması gerekir. Geliştirici olarak &amp;ccedil;alışma şeklini iyice kavramak yakalayacağımız kavramlar a&amp;ccedil;ısından &amp;ouml;nemlidir. &amp;Ouml;ncelikle &lt;strong&gt;CallExternalMethodActivity &lt;/strong&gt;bileşeninin bir aktivite tipi olarak harici bir metodu işaret edebileceğini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almalıyız. Bu durumda &lt;strong&gt;tasarım zamanında(Design Time),&lt;/strong&gt; &lt;strong&gt;CallExternalMethodActivity &lt;/strong&gt;bileşeninin&amp;nbsp;&amp;ccedil;ağıracağı harici metodun imzasını ve nerede olduğunu bilmesi gerekmektedir ki &amp;ccedil;alışma zamanında bu bilgilerden yararlanarak, i&amp;ccedil;inde bulunduğu aktivite ile harici metod arasında bir mesajlaşma sağlayabilsin.&lt;/p&gt;
&lt;p&gt;Diğer yandan, tasarım zamanında &lt;strong&gt;IDE&lt;/strong&gt;' nin &lt;strong&gt;CallExternalMethodActivity &lt;/strong&gt;bileşenine kullanabileceği tipleri g&amp;ouml;stermesi, basit bir plug-in d&amp;uuml;zeneğine benzetilebilir. S&amp;ouml;z konusu bileşen kullanabileceği tipleri bulmak konusunda, &lt;strong&gt;ExternalDataExchange&lt;/strong&gt; niteliğini uygulamış interface tiplerini baz almaktadır. Buna g&amp;ouml;re aray&amp;uuml;z tipinin &amp;ccedil;alışma zamanında ger&amp;ccedil;ek işlevleri i&amp;ccedil;eren bir uygulayıcısı da olmalıdır. Yani s&amp;ouml;z konusu aray&amp;uuml;z&amp;uuml; implemente eden bir tipten bahsediyoruz. Aktiviteler birden fazla &lt;strong&gt;CallExternalMethodActivity&lt;/strong&gt; bileşeni i&amp;ccedil;erebileceği gibi, birden fazla &lt;strong&gt;ExternalDataExchange&lt;/strong&gt; nitelikli aray&amp;uuml;z implementasyonunu da değerlendirebilir.&lt;/p&gt;
&lt;p&gt;Artık konuyu &amp;ouml;rnekleyerek devam etmekte yarar olacağı kanısındayım. &amp;Ouml;rneğimizi &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; ortamında ve &lt;strong&gt;.Net Framework 3.5 &lt;/strong&gt;odaklı olarak geliştiriyor olacağız. İlk olarak &lt;strong&gt;System.Workflow.Activities&lt;/strong&gt; assembly' ını referans eden bir &lt;strong&gt;Class Library &lt;/strong&gt;projesi oluşturarak işe başlayalım. Bir sınıf k&amp;uuml;t&amp;uuml;phanesi tasarladığımızdan, herhangibir &lt;strong&gt;Workflow &lt;/strong&gt;projesinde kullanılabilir ve tek&amp;nbsp; merkezden g&amp;uuml;ncellenebilir bir &amp;uuml;r&amp;uuml;n&amp;uuml;m&amp;uuml;z s&amp;ouml;z konusudur. Bu k&amp;uuml;t&amp;uuml;phane, &lt;strong&gt;ExternalDataExchange&lt;/strong&gt; nitelikli aray&amp;uuml;z ve implementasyonlarını yapan tipleri barındırabilir ki &amp;ouml;rneğimizde bu ama&amp;ccedil;la aşağıdaki sınıf diagramında g&amp;ouml;r&amp;uuml;len tipler değerlendirilecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f9%2fblg81_ClassDiagram.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Kod i&amp;ccedil;eriğimiz;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Workflow.Activities;

namespace CommonOperations
{
    // ICommonAccounting aray&amp;uuml;z tipinin yerel servislerden(Local Service) birisi olduğu belirtilir
 [ExternalDataExchange]
 public interface ICommonAccounting
 {
        void IncreaseRate(double rate, int categoryId);
        void DecreaseRate(double rate, int categoryId);
 }

    // Yerel servis metodlarının uygulandığı yer
    public class CommonAccounting
        :ICommonAccounting
    {
        // Host uygulamanın değerlendirebileceği basit bir olay
        public event EventHandler&amp;lt;AccountingResultsEventArgs&amp;gt; OnCompleted;

        #region ICommonAccounting Members

        public void IncreaseRate(double rate, int categoryId)
        {
            Console.WriteLine("{0} kategorisindeki maaşlar % {1} oranında arttırılacak",categoryId.ToString(),rate.ToString());
            if (OnCompleted != null)
                OnCompleted(this, new AccountingResultsEventArgs { StepType = "Increase", Rate = rate,StepOk=true });
        }

        public void DecreaseRate(double rate, int categoryId)
        {
            Console.WriteLine("{0} kategorisindeki maaşlar % {1} oranında azaltılacak", categoryId.ToString(), rate.ToString());
            if (OnCompleted != null)
                OnCompleted(this, new AccountingResultsEventArgs { StepType = "Decrease", Rate = rate,StepOk=true });
        }

        #endregion
    }

    // OnCompleted olayı i&amp;ccedil;erisinde kullanılan ve olay metoduna bilgi taşıyan sınıf
    public class AccountingResultsEventArgs
        : EventArgs
    {
        public string StepType { get; set; }
        public double Rate { get; set; }
        public bool StepOk { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;ICommonAccounting&lt;/strong&gt; isimli aray&amp;uuml;ze &lt;strong&gt;ExternalDataExchange &lt;/strong&gt;niteliği uygulanmıştır. Aray&amp;uuml;z&amp;uuml;m&amp;uuml;zde, işlevleri bizim i&amp;ccedil;in şu aşamada &amp;ccedil;ok &amp;ouml;nemli olmayan iki basit operasyon tanımlaması yer almaktadır. Diğer taraftan bu aray&amp;uuml;z&amp;uuml; implemente eden &lt;strong&gt;CommonAccounting&lt;/strong&gt; tipi i&amp;ccedil;erisinde operasyonların uygulaması yer almaktadır. &lt;strong&gt;CommonAccounting&lt;/strong&gt; sınıf ayrıca, kendisini kullanan aktivitelere bilgi taşıyabilmekte kullanılabilecek bir olay bildirimi de&lt;strong&gt;&lt;em&gt;(OnCompleted)&lt;/em&gt;&lt;/strong&gt; i&amp;ccedil;ermektedir.&lt;/p&gt;
&lt;p&gt;Bu olay i&amp;ccedil;erisinde kullanılan &lt;strong&gt;AccountingResultEventArgs&lt;/strong&gt; isimli &lt;strong&gt;EventArgs &lt;/strong&gt;t&amp;uuml;revli tip, &amp;ccedil;alışma zamanındaki &lt;strong&gt;CommonAccounting &lt;/strong&gt;nesne &amp;ouml;rneğinden, &lt;strong&gt;OnCompleted &lt;/strong&gt;olayına abone olan aktiviteye &lt;strong&gt;StepType, Rate &lt;/strong&gt;ve &lt;strong&gt;StepOk &lt;/strong&gt;gibi bazı yardımcı bilgiler d&amp;ouml;nd&amp;uuml;rmektedir. &lt;strong&gt;IncreaseReate &lt;/strong&gt;ve &lt;strong&gt;DecreaseRate &lt;/strong&gt;metodları i&amp;ccedil;erisinde, &lt;strong&gt;OnCompleted &lt;/strong&gt;olayının y&amp;uuml;kl&amp;uuml; olması halinde &amp;ccedil;alıştırılması işlemi ger&amp;ccedil;ekleştirilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;Kişisel Not : &lt;/strong&gt;Olayları daha net kavrayabilmek i&amp;ccedil;in&amp;nbsp;&lt;/em&gt;&lt;a title="C# Temelleri - Olayları Kavramak" href="http://www.csharpnedir.com/articles/read/?filter=popular&amp;amp;author=&amp;amp;cat=&amp;amp;id=747&amp;amp;title=C" target="_blank"&gt;&lt;em&gt;eski bir&amp;nbsp;makalemden&lt;/em&gt;&lt;/a&gt;&lt;em&gt; faydalanabilirsiniz.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Artık bu sınıf k&amp;uuml;t&amp;uuml;phanesini kullanacak basit bir &lt;strong&gt;Workflow&lt;/strong&gt; projesi geliştirebiliriz. Bu ama&amp;ccedil;la bir&lt;strong&gt; Sequential Workflow Console Application&lt;/strong&gt; projesi oluşturduğumuzu ve geliştirdiğimiz &lt;strong&gt;CommonOperations&lt;/strong&gt; isimli sınıf k&amp;uuml;t&amp;uuml;phanesini buraya referans ettiğimizi d&amp;uuml;ş&amp;uuml;nelim. Boş bir &lt;strong&gt;Activity&lt;/strong&gt; &amp;ouml;ğesini projeye ekledikten sonra i&amp;ccedil;eriğini aşağıdaki gibi kodlayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Workflow.Activities;

namespace HostApp
{
    public partial class Activity1
        : SequenceActivity
    {
        public double IncreaseRate { get; set; }
        public double DecreaseRate { get; set; }
        public int CategoryId { get; set; }

        public Activity1()
        {
            InitializeComponent();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Burada tanımlanan &lt;strong&gt;IncreaseRate, DecreaseRate&lt;/strong&gt; ve &lt;strong&gt;CategoryId &lt;/strong&gt;&amp;ouml;zellikleri, &lt;strong&gt;CallExternalMethodActivity &lt;/strong&gt;bileşenlerinin kullanacağı harici metodlara aktarılacak aktivite seviyesindeki değerleri taşımak &amp;uuml;zere kullanılmaktadır. Şimdi tasarım zamanında, &lt;strong&gt;Activity1&lt;/strong&gt; i&amp;ccedil;erisine &amp;ouml;rnek bir &lt;strong&gt;CallExternalMethodActivity &lt;/strong&gt;bileşenini s&amp;uuml;r&amp;uuml;kleyerek devam edebiliriz. Bu işlemin ardından bileşenin &lt;strong&gt;InterfaceType &lt;/strong&gt;&amp;ouml;zelliğinden yararlanarak hangi aray&amp;uuml;z&amp;uuml; kullanacağını aşağıdaki şekilden g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi se&amp;ccedil;ebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f9%2fblg81_InterfaceProp.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;ICommonAccounting&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; otomatik olarak gelmiştir. B&amp;ouml;ylece hangi operasyonların kullanılabileceği, bu operasyonlara hangi parametrelerin verilmesi gerektiği bilinmektedir. Bizde akışımıza &amp;ouml;rnek olarak iki &lt;strong&gt;CallExternalMethodActivity&lt;/strong&gt; bileşeni ekleyip &amp;ouml;zelliklerini aşağıdaki gibi ayarlayarak devam edebiliriz.&lt;/p&gt;
&lt;p&gt;callExternalMethodActivity1 bileşeninin &amp;ouml;zellikleri;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f9%2fblg81_Prop1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;callExternalMethodActivity2 bileşeninin &amp;ouml;zellikleri;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f9%2fblg81_Prop2New.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi her iki bileşen i&amp;ccedil;in &lt;strong&gt;ICommonAccounting&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; se&amp;ccedil;ilmiş, buna g&amp;ouml;re sırasıyla &lt;strong&gt;IncreaseRate&lt;/strong&gt; ve &lt;strong&gt;DecreaseRate &lt;/strong&gt;operasyonlarının kullanılacağı belirtilmiştir. Ayrıca s&amp;ouml;z konuzu operasyonların parametreleri, otomatik olarak &amp;ouml;zellikler penceresine gelmiştir&lt;strong&gt;(rate ve categoryId).&lt;/strong&gt; Bu &amp;ouml;zelliklerde aslında, &lt;strong&gt;Activity1&lt;/strong&gt; tipi i&amp;ccedil;erisinde tanımlanmış olan &lt;strong&gt;IncreaseRate,DecreaseRate&lt;/strong&gt; ve &lt;strong&gt;CategoryId&lt;/strong&gt; &amp;ouml;zelliklerini işaret edecek şekilde bizim tarafımızdan ayarlanmaktadır.&lt;/p&gt;
&lt;p&gt;Dolayısıyla &lt;strong&gt;WF &amp;ccedil;alışma zamanında&lt;/strong&gt;, &lt;strong&gt;Activity1&lt;/strong&gt; i&amp;ccedil;erisindeki ilgili &amp;ouml;zelliklere atanabilecek olan değerler, &lt;strong&gt;CallExternalMethodActivity&lt;/strong&gt; bileşenleri ile &lt;strong&gt;CommonAccounting&lt;/strong&gt; nesnesinin ilgili metodlarına g&amp;ouml;nderilerek işlenebilecektir. Eğer WF &amp;Ccedil;alışma zamanını host eden sınıf, &lt;strong&gt;CommonAccounting&lt;/strong&gt; tarafından tanımlanmış &lt;strong&gt;OnCompleted&lt;/strong&gt; olayınıda y&amp;uuml;klerse, &lt;strong&gt;CallExternalMethodActivity&lt;/strong&gt; bileşenlerinin &amp;ccedil;alıştırdığı harici metodlardan bazı bilgileri kendi ortamına alarak değerlendirebilecektir&lt;strong&gt;(AccountingResultEventArgs yardımıyla)&lt;/strong&gt;. Bu yapı i&amp;ccedil;in WF &amp;ccedil;alışma zamanına &amp;ouml;zel bazı kodlamaların yapılmasıda gerekmektedir. İşte uygulama kodlarımız;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Threading;
using System.Workflow.Activities;
using System.Workflow.Runtime;
using CommonOperations;

namespace HostApp
{
    class Program
    {
        static void Main(string[] args)
        {
            using(WorkflowRuntime workflowRuntime = new WorkflowRuntime())
            {
                #region Yerel Servisi Bildirme İşlemi

                // Yerel servisler i&amp;ccedil;in eklenmesi gereken servistir
                ExternalDataExchangeService service = new ExternalDataExchangeService();
                // ExternalDataExchangeService &amp;ouml;rneği Workflow &amp;ccedil;alışma zamanına eklenir
                workflowRuntime.AddService(service);

                // ExternalMetadaExchange nitelikli interface tipini implemente eden asıl nesne &amp;ouml;rneklenir
                CommonAccounting accounter = new CommonAccounting();
                // HostApp uygulamasının ele alacağı OnCompleted olayı y&amp;uuml;klenir ve anonymous method yardımıyla değerlendirilir.
                accounter.OnCompleted += delegate(object sender, AccountingResultsEventArgs e)
                {
                    // &amp;Ouml;rnek metodlardan gelen sonu&amp;ccedil;lar listelenir.
                    Console.WriteLine("\n\tİşlem tipi {0}\n\tRate {1}\n\tİşlem sonucu {2}", e.StepType, e.Rate.ToString(),e.StepOk.ToString());
                };

                //accounter isimli ExternalMetadaExchange nitelikli interface tipini implemente eden asıl nesne &amp;ouml;rneği, ExternalDataExchangeService &amp;ouml;rneğine eklenir.
                service.AddService(accounter);

                #endregion

                AutoResetEvent waitHandle = new AutoResetEvent(false);
                // Workflow tamamlandığında devreye giren olay metodu
                workflowRuntime.WorkflowCompleted += delegate(object sender, WorkflowCompletedEventArgs e) {
                    waitHandle.Set();
                };
                // Exception gibi nedenlerle Workflow sonlandığında devreye giren olay metodu
                workflowRuntime.WorkflowTerminated += delegate(object sender, WorkflowTerminatedEventArgs e)
                {
                    Console.WriteLine(e.Exception.Message);
                    waitHandle.Set();
                };

                // Yerel servis i&amp;ccedil;erisindeki metodların kullanacağı parametrelere işaret eden &amp;ouml;zellikler y&amp;uuml;klenir.
                Dictionary&amp;lt;string, object&amp;gt; parameters = new Dictionary&amp;lt;string, object&amp;gt;
                {
                    {"IncreaseRate",1.12},
                    {"DecreaseRate",2.25},
                    {"CategoryId",1}
                };

                // Aktivite nesnesi &amp;ouml;rneklenir, &amp;ouml;zellikleri i&amp;ccedil;in ilk değerleri y&amp;uuml;klenir.
                WorkflowInstance mathActivity = workflowRuntime.CreateWorkflow(typeof(HostApp.Activity1),parameters);
                // Aktivite başlatılır
                mathActivity.Start();
                // Asenkron işleyişi ispat etmek i&amp;ccedil;in
                Console.WriteLine("İşlemler başladı");
                // İşlemler tamamlanmadıysa bekle
                waitHandle.WaitOne();
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere&lt;strong&gt; Local Service'&lt;/strong&gt; in tanımlanmasını takiben, &lt;strong&gt;ExternalDataExchange &lt;/strong&gt;nitelikli tipe ait nesne &amp;ouml;rneklenmiş ve yerel servise bildirilmiştir. Ayrıca &lt;strong&gt;CommonAccounting&lt;/strong&gt; nesnesinin &lt;strong&gt;OnCompleted&lt;/strong&gt; olayı y&amp;uuml;klenmiş ve &lt;strong&gt;Program'&lt;/strong&gt; ın bu olaya abone olması sağlanmıştır. &lt;strong&gt;Activity1&lt;/strong&gt; nesnesine ait &amp;ouml;zellikleri set etmek i&amp;ccedil;in &lt;strong&gt;Dictionary&amp;lt;string,object&amp;gt;&lt;/strong&gt; koleksiyonundan yararlanılmış ve son olarak aktivitemiz başlatılmıştır. İşte &amp;ccedil;alışma zamanı sonu&amp;ccedil;ları.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f9%2fblg81_Runtime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Evet...&amp;Ouml;nce belirli oranda arttırım yapıp sonra azaltım yapmak son derece sa&amp;ccedil;ma g&amp;ouml;z&amp;uuml;kmektedir &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt; Ancak yakalamamız gereken nokta elbetteki bu değildir. &amp;Ouml;nemli olan, bir aktivite' nin kendi sınırları dışındaki fonksiyonellikleri kullanabilmek i&amp;ccedil;in yerel servislerden nasıl yararlanıldığı ve bunun i&amp;ccedil;in &lt;strong&gt;ExternalDataExchange&lt;/strong&gt; niteliğinin nasıl değerlendirildiğidir. &amp;Uuml;stelik bu değerlendirme, WF tasarım zamanı i&amp;ccedil;inde &amp;ouml;nem arz eder.&amp;nbsp;Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu&amp;nbsp; g&amp;uuml;nler dilerim.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f9%2fUsingExternalCode.rar"&gt;UsingExternalCode.rar (50,98 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-09-25 07:23:00</pubDate>
  <slug>WF-ExternalDataExchange-Local-Services-ve-CallExternalMethodActivity</slug>
  <tags>
    <tag>wf</tag>
  </tags>
  <categories>
    <category>WF</category>
  </categories>
</post>