<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Web Server Control Yazmak - 2</title>
  <description>Bir önceki makalemizde web sunucu kontrollerini nasıl geliştireceğimizi incelemeye başlamıştık. Bu günkü makalemizde, ViewState' lerin web sunucu kontrollerinde nasıl ele alınabileceğinden ve kontrollerin tasarım zamanındaki (design time) yeteneklerinin nitelikler (attributes) yardımıyla nasıl arttırılabileceğinden bahsetmeye çalışacağız.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki makalemizde web sunucu kontrollerini nasıl geliştireceğimizi incelemeye başlamıştık. Bu g&amp;uuml;nk&amp;uuml; makalemizde, ViewState' lerin web sunucu kontrollerinde nasıl ele alınabileceğinden ve kontrollerin tasarım zamanındaki (design time) yeteneklerinin nitelikler (attributes) yardımıyla nasıl arttırılabileceğinden bahsetmeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;Herhangibir web sunucu kontrol&amp;uuml;n&amp;uuml;n (web server control) bazı &amp;ouml;zellikleri (properties) sayfa &amp;uuml;retilirken belirlenmek (set) istenebilir. Bu işlem i&amp;ccedil;in sayfanın &lt;strong&gt;Page_Load&lt;/strong&gt; olay (event) metodu ideal bir noktadır. Hatta burada sayfanın &lt;strong&gt;Postback&lt;/strong&gt; edilip edilmediği kontrol edilerek, &amp;ouml;zelliklerin sadece sayfanın ilk y&amp;uuml;klenişinde belirlenmesi sağlanabilir. Ancak burada &lt;strong&gt;ViewState&lt;/strong&gt; kullanılmadığı takdirde karşılaşılabilecek &amp;ouml;nemli bir problem vardır. Bu problemi analiz edebilmek i&amp;ccedil;in, bir &amp;ouml;nceki makalemizde geliştirdiğimiz TarihKontrolum isimli bileşenimize &amp;uuml;&amp;ccedil; yeni &amp;ouml;zellik daha ekleyerek analizimize başlayalım. Bu &amp;ouml;zellikler ile liste kutularındaki g&amp;uuml;n, ay, yıl bilgilerinin değerlerini değiştirmeyi ve elde etmeyi hedeflemekteyiz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private string _seciliGun;
private string _seciliAy;
private string _seciliYil;

public string SeciliGun
{
    get{return _seciliGun;}
    set { _seciliGun = value; }
}

public string SeciliAy
{
    get{return _seciliAy;}
    set { _seciliAy= value; }
}

public string SeciliYil
{
    get{ return _seciliYil; }
    set { _seciliYil= value; }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak web sunucu kontrol&amp;uuml;m&amp;uuml;ze ilişkin &lt;strong&gt;Render&lt;/strong&gt; metodu i&amp;ccedil;erisinde de bazı değişiklikler yapmalıyız. Nitekim sayfa y&amp;uuml;klenirken belirlenen g&amp;uuml;n, ay ve yıl değerlerinin, render edilen HTML i&amp;ccedil;eriğine &lt;strong&gt;selected&lt;/strong&gt; niteliği olarak aktarılması gerekmektedir. Bu nedenle Render metodu i&amp;ccedil;erisinde, &amp;ouml;zelliğin o anki değeri ile for d&amp;ouml;ng&amp;uuml;s&amp;uuml; i&amp;ccedil;erisindeki değerler karşılaştırılmış ve eşleşme olması halinde, ekrana basılacak olan &lt;strong&gt; option&lt;/strong&gt; elementinin yapısı değiştirilmiştir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected override void Render(HtmlTextWriter writer)
{
    writer.Write("&amp;lt;span id='lblGun'&amp;gt;" + GunMetin + "&amp;lt;/span&amp;gt;");
    writer.Write("&amp;nbsp;&amp;nbsp;");
    writer.Write("&amp;lt;select name='Gun' id='Gun'&amp;gt;");
    for (int i = 1; i &amp;lt;= 31; i++)
    {
        if (SeciliGun == i.ToString())
            writer.Write("&amp;lt;option selected='selected' value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
        else
            writer.Write("&amp;lt;option value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
    }
    writer.Write("&amp;lt;/select&amp;gt;");
    writer.Write("&amp;nbsp;&amp;nbsp;");
    writer.Write("&amp;lt;span id='lblAy'&amp;gt;" + AyMetin + "&amp;lt;/span&amp;gt;");
    writer.Write("&amp;nbsp;&amp;nbsp;");
    writer.Write("&amp;lt;select name='Ay' id='Ay'&amp;gt;");
    for (int i = 1; i &amp;lt;= 12; i++)
    {
        if (SeciliAy == i.ToString())
            writer.Write("&amp;lt;option selected='selected' value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
        else
            writer.Write("&amp;lt;option value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
    }
    writer.Write("&amp;lt;/select&amp;gt;");
    writer.Write("&amp;nbsp;&amp;nbsp;");
    writer.Write("&amp;lt;span id='lblYil'&amp;gt;" + YilMetin + "&amp;lt;/span&amp;gt;");
    writer.Write("&amp;nbsp;&amp;nbsp;");
    writer.Write("&amp;lt;select name='Yil' id='Yil'&amp;gt;");
    for (int i = 1950; i &amp;lt;= 2050; i++)
    {
        if (SeciliYil == i.ToString())
            writer.Write("&amp;lt;option selected='selected' value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
          else
            writer.Write("&amp;lt;option value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
    }
    writer.Write("&amp;lt;/select&amp;gt;");
    base.Render(writer);
}&lt;/pre&gt;
&lt;p&gt;Dikkat ederseniz, &amp;ouml;zelliklerimizin değerlerini, for d&amp;ouml;ng&amp;uuml;leri i&amp;ccedil;erisinde yakalıyoruz ve buna g&amp;ouml;re option elementine selected niteliğini (attribute) ekliyoruz. Peki, kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; bu son haliyele sayfamızda kullandığımızda ve sayfanın Load olay metodunda aşağıdaki kodları yazdığımızda neler olacaktır?&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void Page_Load(object sender, EventArgs e)
{
    if (!Page.IsPostBack)
    {
        TarihKontrolumOld1.SeciliGun = "3";
        TarihKontrolumOld1.SeciliAy = "4";
        TarihKontrolumOld1.SeciliYil = "2008";
    }
}&lt;/pre&gt;
&lt;p&gt;Load olay metodu i&amp;ccedil;erisind, eğer sayfa ilk kez y&amp;uuml;kleniyorsa (ki bu kontrol&amp;uuml; IsPostBack &amp;ouml;zelliğinin değerine bakarak yapıyoruz), web sunucu kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n ilgili &amp;ouml;zelliklerine bazı başlangı&amp;ccedil; değerleri set edilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk189_1.gif" alt="" width="438" height="173" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Ancak sayfayı tekrardan sunucuya g&amp;ouml;nderdiğimizde, IsPostBack kontrol&amp;uuml; nedeni ile if bloğu i&amp;ccedil;erisindeki kodlar bir kez daha &amp;ccedil;alıştırılmayacaktır. Bu nedenlede sayfanın bir sonraki talep (request) i&amp;ccedil;in &amp;ccedil;ıktısı aşağıdaki gibi olacaktır. Dikkat ederseniz, SeciliGun, SeciliAy ve SeciliYil &amp;ouml;zellikleri başlangı&amp;ccedil; değerlerine g&amp;ouml;re yeniden belirlenmiştir. &lt;em&gt;(Bu durum, kontrol&amp;uuml;n her sayfa istediğinde yeniden &amp;ouml;rneklenişinin ve ilk değerlerin atanışının doğal bir sonucu olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk189_2.gif" alt="" width="441" height="177" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında sorun, istemci (client) ile sunucu(server) arasında web sunucu kontrol&amp;uuml; i&amp;ccedil;erisindeki verilerin (data) taşınmıyor oluşudur. Bu ama&amp;ccedil;la bildiğiniz gibi Asp.Net uygulamalarında &lt;strong&gt;ViewState&lt;/strong&gt;' lerden faydalanabiliriz. ViewState' ler sunucu tarafından yeniden &amp;uuml;retilen, sayfalar i&amp;ccedil;erisindeki verileri saklamak amacıyla istemci tarafındaki &amp;ccedil;ıktıya ilave edilen gizli alanlardır (hidden field). Bu alanın i&amp;ccedil;eriği string bazlıdır. Dikkat edilmesi gereken noktalardan birisi, ViewState' in i&amp;ccedil;erisinde &amp;ccedil;ok y&amp;uuml;ksek boyutlu veri taşımasının, &amp;uuml;retilecek olan HTML i&amp;ccedil;eriğini fazlasıyla şişirecek olmasıdır.&lt;/p&gt;
&lt;p&gt;Bu nedenle ViewState i&amp;ccedil;erisine veri atarken &amp;ccedil;oğunlukla string tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lebilen ve &amp;ccedil;ok y&amp;uuml;ksek boyut i&amp;ccedil;ermeyen bilgileri ele almakta fayda vardır. TarihKontrolum isimli bileşenimiz i&amp;ccedil;erisinde GunMetin, AyMetin, YilMetin, SeciliGun, SeciliAy, SeciliYil &amp;ouml;zelliklerinin i&amp;ccedil;eriklerini ViewState i&amp;ccedil;erisinde saklayabiliriz. B&amp;ouml;ylece yukarıdaki modele g&amp;ouml;re sayfanın ilk &amp;uuml;retilişinde hazırlanan veri i&amp;ccedil;eriği istemci tarafındaki &amp;ccedil;ıktı i&amp;ccedil;erisinde yer alan gizli alana ilave edilecektir. Bu ihtiyacı cevaplandırabilmek amacıyla, TarihKontrolum bileşeninde aşağıdaki değişiklikleri yapmamız yeterli olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk189_3.gif" alt="" width="251" height="225" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class TarihKontrolum:Control
{
    public string GunMetin
    {
        get {
            if (ViewState["gunMetin"] != null)
                return ViewState["gunMetin"].ToString();
            else
                return "G&amp;uuml;n"; 
        }
        set { ViewState["gunMetin"] = value; }
    }

    public string AyMetin
    {
        get
        {
            if (ViewState["ayMetin"] != null)
                return ViewState["ayMetin"].ToString();
            else
                return "Ay";
        }
        set { ViewState["ayMetin"] = value; }
    }

    public string YilMetin
    {
        get
        {
            if (ViewState["yilMetin"] != null)
                return ViewState["yilMetin"].ToString();
            else
                return "Yıl";
        }
        set { ViewState["yilMetin"] = value; }
    }

    public string SeciliGun
    {
        get
        {
            if (ViewState["seciliGun"] != null)
                return ViewState["seciliGun"].ToString();
            else
                return "";
        }
        set { ViewState["seciliGun"] = value; }
    }

    public string SeciliAy
    {
        get
        {
            if (ViewState["seciliAy"] != null)
                return ViewState["seciliAy"].ToString();
            else
                return "";
        }
        set { ViewState["seciliAy"] = value; }
    }

    public string SeciliYil
    {
        get
        {
            if (ViewState["seciliYil"] != null)
                return ViewState["seciliYil"].ToString();
            else
                return "";
        }
        set { ViewState["seciliYil"] = value; }
    }

    protected override void Render(HtmlTextWriter writer)
    { 
        writer.Write("&amp;lt;span id='lblGun'&amp;gt;" + GunMetin + "&amp;lt;/span&amp;gt;");
        writer.Write("&amp;nbsp;&amp;nbsp;");
        writer.Write("&amp;lt;select name='Gun' id='Gun'&amp;gt;");
        for (int i = 1; i &amp;lt;= 31; i++)
        {
            if (SeciliGun==i.ToString())
                writer.Write("&amp;lt;option selected='selected' value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
            else
                writer.Write("&amp;lt;option value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
        }
        writer.Write("&amp;lt;/select&amp;gt;"); 
        writer.Write("&amp;nbsp;&amp;nbsp;");
        writer.Write("&amp;lt;span id='lblAy'&amp;gt;" + AyMetin + "&amp;lt;/span&amp;gt;");
        writer.Write("&amp;nbsp;&amp;nbsp;");
        writer.Write("&amp;lt;select name='Ay' id='Ay'&amp;gt;");
        for (int i = 1; i &amp;lt;= 12; i++)
        {
            if (SeciliAy == i.ToString()) 
                writer.Write("&amp;lt;option selected='selected' value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
            else
                writer.Write("&amp;lt;option value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
        }
        writer.Write("&amp;lt;/select&amp;gt;");
        writer.Write("&amp;nbsp;&amp;nbsp;");
        writer.Write("&amp;lt;span id='lblYil'&amp;gt;" + YilMetin + "&amp;lt;/span&amp;gt;");
        writer.Write("&amp;nbsp;&amp;nbsp;");
        writer.Write("&amp;lt;select name='Yil' id='Yil'&amp;gt;");
        for (int i = 1950; i &amp;lt;= 2050; i++)
        {
            if (SeciliYil==i.ToString())
                writer.Write("&amp;lt;option selected='selected' value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
            else
                writer.Write("&amp;lt;option value='" + i.ToString() + "'&amp;gt;" + i.ToString() + "&amp;lt;/option&amp;gt;");
        }
        writer.Write("&amp;lt;/select&amp;gt;");
        base.Render(writer);
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;zelliklerimiz hepsi aynı prensiple &amp;ccedil;alışmaktadır. Get bloklarında, eğer ViewState i&amp;ccedil;erisinde tutulan bir veri var ise bu veri string tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lerek elde edilir. Set bloğunda ise &amp;ouml;zelliğe atanan değerler, ViewState i&amp;ccedil;erisine bazı anahtar ifadeler (key) ile eklenmektedir. &amp;Ouml;rneğin SeciliGun &amp;ouml;zelliğinin işaret edeceği değer i&amp;ccedil;in ViewState i&amp;ccedil;erisinde seciliGun isimli bir anahtara (key), değer ataması yapılmıştır. Set blokları, dikkat ederseniz sayfanın Load olay metodu i&amp;ccedil;erisindeki kodlarda devreye girmektedir.&lt;/p&gt;
&lt;p&gt;Bu nedenle sayfa ilk &amp;uuml;retilişi sırasında bu &amp;ouml;zelliklere başlangı&amp;ccedil; değerleri atanmaktadır. Bu atama sonrasındaki değerler, istemciye g&amp;ouml;nderilecek olan i&amp;ccedil;erikte yer alan ViewState alanı i&amp;ccedil;erisine dahil edilecektir. Dolayısıyla istemci sayfayı tekrardan sunucuya g&amp;ouml;nderdiğinde, a&amp;ccedil;ılan (yada deserialization işlemine tabi tutulan) ViewState i&amp;ccedil;erisinden, &amp;ouml;zelliklerin değerleri alınacaktır. Bu değerleride Render metodu i&amp;ccedil;erisinde &amp;ouml;zelliklerin Get bloklarından aldığımızdan, kontrol&amp;uuml;n ilgili &amp;ouml;zellikleri başlangı&amp;ccedil; değerlerine d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmeyecektir. Aşağıdaki video g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n yeni ve eski halleri incelenmeye &amp;ccedil;alışılmıştır.&lt;/p&gt;
&lt;p&gt;&lt;object id="obj1" width="381" height="213" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/mk189_video.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="381" height="213" src="http://www.buraksenyurt.com/makale/images/mk189_video.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj1" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;&amp;Uuml;st taraftaki kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; ViewState kullanmayan TarihKontrolumOld isimli sınıfa ait bir &amp;ouml;rnektir. Alttaki kontrol&amp;uuml;m&amp;uuml;z ise TarihKontrolum sınıfına ait ViewState kullanan nesne &amp;ouml;rneğimizdir. Halen daha bazı problemlerimiz vardır. &amp;Ouml;rneğin kullanıcı tarayıcı penceresi i&amp;ccedil;erisindeyken, g&amp;uuml;n, ay veya yıl bilgilerinden birisini değiştirip sayfayı tekrardan sunucuya g&amp;ouml;nderirse, değiştirdiği i&amp;ccedil;eriği son hali ile elde edemeyecektir. Bu sayfanın i&amp;ccedil;erisindeki kontrollerin verisinin istemciden yapılan değişiklikler sonucu, sunucuya g&amp;ouml;nderilmeyişinden kaynaklanmaktadır. Sorunu &amp;ccedil;&amp;ouml;zmek i&amp;ccedil;in postback işlemi sonucu istemciden gelen veriyi işlememiz gerekmektedir. Bu sorunu nasıl &amp;ccedil;&amp;ouml;zeceğimizi yazı dizimizin ilerleyen makalelerinde incelemeye &amp;ccedil;alı&amp;ccedil;acağız.&lt;/p&gt;
&lt;p&gt;Makalemizin bundan sonraki b&amp;ouml;l&amp;uuml;m&amp;uuml;nde, sunucu kontrollerimizin tasarım zamanındaki (&lt;strong&gt;design time&lt;/strong&gt;) niteliklerini (attribute) nasıl değiştirebileceğimizi g&amp;ouml;rmeye &amp;ccedil;alışacağız. Nitelikleri (attribute) sınıf(class), &amp;ouml;zellik(property) veya assemblye bazında uygulayabiliriz. Bu nitelikler, geliştirdiğimiz web sunucu kontrollerini kullanan sayfa geliştiriciler i&amp;ccedil;in &amp;ouml;nemlidir. Nitekim, web sunucu kontrol&amp;uuml;n&amp;uuml;n Visual Studio.Net ortamı i&amp;ccedil;erisindeki davranışlarını belirlemektedir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Attribute' lar uygulandıkları tip veya &amp;uuml;yelerin &amp;ccedil;alışma zamanındaki davranışlarını belirlememize yarayan tiplerdir. Assembly' ların Metadata' sına eklendikleri i&amp;ccedil;in &amp;ccedil;alışma zamanıda reflection yardımıyla ele alınırlar ve &amp;ccedil;alışma ortamının gerekli davranış değişikliklerini yapabilmelerini sağlarlar. &amp;Ccedil;ok bilinen attribute' lara &amp;ouml;rnek olarak &lt;strong&gt;Serialization&lt;/strong&gt;, &lt;strong&gt;WebMethod&lt;/strong&gt;, &lt;strong&gt;WebService&lt;/strong&gt; vb' lerini verebiliriz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Geliştireceğimiz web sunucu kontrollerinde kullanabileceğimiz sınıf(class), &amp;ouml;zellik(property) ve assembly seviyesindeki bazı nitelikler(attributes) ve işlevleri aşağıdaki tabloda &amp;ouml;zetlenmeye &amp;ccedil;alışılmıştır.&lt;br /&gt; &amp;nbsp;&lt;/p&gt;
&lt;table id="table11" style="border-collapse: collapse; width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#336699"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" valign="top"&gt;&lt;strong&gt; Assembly Bazındaki Nitelikler (Attributes)&lt;/strong&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;" valign="top"&gt;&lt;strong&gt; A&amp;ccedil;ıklaması&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;TagPrefix&lt;/td&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;Kontrol sayfaya s&amp;uuml;r&amp;uuml;klenip bırakıldığında, arka taraftaki elemente ait &amp;ouml;n ekin &lt;strong&gt;(prefix)&lt;/strong&gt; ne olacacağını belirleyebilmemizi sağlar.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" valign="top"&gt;&lt;strong&gt; Sınıf Bazındaki Nitelikler (Attributes)&lt;/strong&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;" valign="top"&gt;&lt;strong&gt; A&amp;ccedil;ıklaması&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;ToolBoxData&lt;/td&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;Bu nitelik ile kontrol&amp;uuml;n, sayfanın arka tarafında nasıl yazılacağını belirtebiliriz.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;DefaultProperty&lt;/td&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;Kontrol sayfaya ilk s&amp;uuml;r&amp;uuml;klendiğinde ele alınacak olan varsayılan &amp;ouml;zelliğin &lt;strong&gt; (default property)&lt;/strong&gt; ne olacağını belirtir. &amp;Ouml;rneğin bir Button bileşeni i&amp;ccedil;in Text &amp;ouml;zelliği varsayılandır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;DefaultEvent&lt;/td&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;Kontrol sayfaya ilk s&amp;uuml;r&amp;uuml;klendiğinde ele alınacak olan varsayılan olayın &lt;strong&gt;(default event)&lt;/strong&gt; ne olacağını belirtir. &amp;Ouml;rneğin bir Button bileşeni i&amp;ccedil;in Click olayı varsayılandır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" valign="top" bgcolor="#336699"&gt;&lt;strong&gt; &amp;Ouml;zellik Bazındaki Nitelikler (Attributes)&lt;/strong&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;" valign="top" bgcolor="#336699"&gt;&lt;strong&gt; A&amp;ccedil;ıklaması&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;Browsable&lt;/td&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;Bu nitelik ile, &amp;ouml;zelliğin Vs.Net i&amp;ccedil;erisindeki Properties penceresinde g&amp;ouml;sterilip g&amp;ouml;sterilmeyeceği belirlenir. Varsayılan olarak &amp;ouml;zelliğin değeri true' dur. &amp;Uuml;stelik kontroller i&amp;ccedil;erisinde kullanılan her &amp;ouml;zellik bu niteliğe varsayılan olarak sahiptir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;Description&lt;/td&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;&amp;Ouml;zellik ile ilgili bir a&amp;ccedil;ıklama girilmesini sağlar. Bu, &amp;ouml;zellikle sayfa geliştiriciler &lt;strong&gt;(page developers)&lt;/strong&gt; i&amp;ccedil;in &amp;ouml;nemlidir. &amp;Ccedil;&amp;uuml;nk&amp;uuml; &amp;ouml;zelliğin ne ama&amp;ccedil;la kullanılacağı hakkında bilgilerin verilmesini sağlamaktadır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;Bindable&lt;/td&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;Eğer &amp;ouml;zellik, veriye bağlanacaksa &lt;strong&gt;(data binding)&lt;/strong&gt; bu niteliğin kullanılması gerekir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;Themeable&lt;/td&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;&amp;Ouml;zelliğe &lt;strong&gt;theme&lt;/strong&gt; ve dolayısıyla &lt;strong&gt;skin&lt;/strong&gt; uygulanabilmesini sağlamak istiyorsak bu &amp;ouml;zelliği kullanırız.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;Category&lt;/td&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;&amp;Ouml;zelliğin hangi kategori &lt;strong&gt; (Category)&lt;/strong&gt; başlığı altında sunacağımızı belirtir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;DefaultValue&lt;/td&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;&amp;Ouml;zelliğin varsayılan olarak hangi değeri &lt;strong&gt;(default value)&lt;/strong&gt; taşıyacağını belirtmektedir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;Localizable&lt;/td&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;Eğer bu nitelik false olarak belirtilirse, &amp;ouml;zelliğin i&amp;ccedil;eriği s&amp;ouml;z konusu aspx i&amp;ccedil;in &amp;uuml;retilen &lt;strong&gt;resource&lt;/strong&gt; sayfalarında g&amp;ouml;sterilmez. True olması halinde ise g&amp;ouml;sterilir. Buda ilgili &amp;ouml;zelliğin yerelleştirmede kullanılabilmesini sağlar.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;DesignOnly&lt;/td&gt;
&lt;td valign="top" bgcolor="#ffffff"&gt;&amp;Ouml;zelliğin sadece tasarım zamanında ele alınıp alınmayacağını belirtir.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Dilerseniz bu nitelikleri ve etkilerini incelemeye &amp;ccedil;alışalım. İlk olarak assembly seviyesindeki &lt;strong&gt;TagPrefix&lt;/strong&gt; niteliğini ele alacağız. Bu niteliği, kontrollerimizi barındıran k&amp;uuml;t&amp;uuml;phane i&amp;ccedil;erisindeki &lt;strong&gt;AssemblyInfo.cs&lt;/strong&gt; dosyası i&amp;ccedil;erisinde kullanmamız gerekmektedir. TagPrefix niteliği &lt;strong&gt;System.Web.UI&lt;/strong&gt; i&amp;ccedil;erisinde yer aldığından, gerekli isim alanınında (namespace) bu sınıf i&amp;ccedil;erisine dahil etmekte fayda vardır. Temel olarak TagPrefix niteliği, kontrol&amp;uuml;n web sayfası &amp;uuml;zerine s&amp;uuml;r&amp;uuml;klenmesi sonrasında arka planda oluşturulacak olan elementin &amp;ouml;n ekini belirlemek amacıyla kullanılır. Varsayılan olarak cc1 olan kontrol elementi &amp;ouml;n ekini değiştirmemizi sağlayacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk189_4.gif" alt="" width="444" height="275" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat ederseniz TagPrefix niteliğine ait yapıcı metod (constructor) iki parametre almaktadır. Bu parametrelerden ilki, kontrol&amp;uuml;n bulunduğu isim alanının adıdır. İkinci parametre ise &amp;ouml;n ekin adıdır. Bu değişiklilerden sonra kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; herhangibir sayfa &amp;uuml;zerine s&amp;uuml;r&amp;uuml;kleyip bıraktığımızda aşağıdaki sonucu elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk189_5.gif" alt="" width="627" height="150" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n &amp;ouml;n eki, assembly dosyasında belirttiğimiz şekilde değiştirilmiştir. Gelelim diğer niteliklere. Sınıf bazında (Class Level) uygulayabileceğimiz nitelikler i&amp;ccedil;in aşağıda bir &amp;ouml;rnek yer almaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[DefaultProperty("SeciliGun")]
[ToolboxData("&amp;lt;{0}:TarihKontrolum runat='Server'&amp;gt;&amp;lt;{0}:TarihKontrolum&amp;gt;")]
public class TarihKontrolum:Control
{&lt;/pre&gt;
&lt;p&gt;Burada &amp;ouml;rnek olarak &lt;strong&gt;ToolboxData&lt;/strong&gt; ve &lt;strong&gt;DefaultProperty&lt;/strong&gt; nitelikleri kullanılmıştır. ToolboxData, yazım bi&amp;ccedil;imindende g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, kontrol&amp;uuml;n aspx tarafında nasıl yazılacağını belirtmektedir. Tahmin edeceğiniz gibi &lt;strong&gt;{0}&lt;/strong&gt; yazan yere, AssemblyInfo.cs dosyasında tanımlanan TagPrefix niteliğindeki değer gelecektir. İstenirse runat='Server' yazıldığı yerde başka attribute' lar konularak, &amp;ouml;rneğin kontrol&amp;uuml;n &amp;ouml;zelliklerinin ilk değerlerinin g&amp;ouml;sterilmesi sağlanabilir. Aşağıdaki kod par&amp;ccedil;asında bu durum g&amp;ouml;sterilmiştir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[ToolboxData("&amp;lt;{0}:TarihKontrolum SeciliGun='10' SeciliAy='2' SeciliYil='2007' runat='Server'&amp;gt;&amp;lt;{0}:TarihKontrolum&amp;gt;")]&lt;/pre&gt;
&lt;p&gt;Burada tanımlanan SeciliGun, SeciliAy ve SeciliYil niteliklerinin aslında, TarihKontrolum sınıfı i&amp;ccedil;erisindeki &amp;ouml;zelliklere (properties) işaret ettiğine dikkat edelim. Yaptığımız değer atamaları sonucu kontrol&amp;uuml;n bu &amp;ouml;zelliklerinin ilk değerleride otomatik olarak set edilmiş olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk189_7.gif" alt="" width="241" height="241" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Kontrol&amp;uuml;n arka plandaki &amp;ccedil;ıktısı ise aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Kontrolum:TarihKontrolum ID="TarihKontrolum1" runat="server" SeciliAy="2" SeciliGun="10" SeciliYil="2007"&amp;gt;
&amp;lt;/Kontrolum:TarihKontrolum&amp;gt;&lt;/pre&gt;
&lt;p&gt;Sınıf bazında kullandığımız niteliklerden DefaultProperty, kontrol sayfaya s&amp;uuml;r&amp;uuml;klenip bırakıldığında, Vs.Net 2005 IDE' si i&amp;ccedil;erisindeki &amp;ouml;zellikler penceresinde, hangi &amp;ouml;zelliğin varsayılan olarak se&amp;ccedil;ili olacağını belirtmektedir. &amp;Ouml;rneğimizdeki TarihKontrolum bileşeni i&amp;ccedil;in varsayılan &amp;ouml;zellik SeciliGun' d&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk189_6.gif" alt="" width="278" height="241" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim &amp;ouml;zellik bazında kullandığımız niteliklere. Kontrol&amp;uuml;m&amp;uuml;zdeki &amp;ouml;zelliklerin hepsine yukarıda bahsettiğimiz nitelikleri uygulayabiliriz. &amp;Ouml;rneğin SeciliGun i&amp;ccedil;in aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asında tasarım penceresine etki edecek nitelikler eklenmiştir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[Browsable(true)]
[Description("Hangi G&amp;uuml;n?")]
[Bindable(true)]
[Themeable(true)]
[Category("Tarih Degerleri")]
[DefaultValue("1")]
[Localizable(true)]
public string SeciliGun
{
    get
    {
        if (ViewState["seciliGun"] != null)
            return ViewState["seciliGun"].ToString();
        else
            return "";
    }
    set { ViewState["seciliGun"] = value; }
}&lt;/pre&gt;
&lt;p&gt;Temel olarak &lt;strong&gt;Browsable&lt;/strong&gt; niteliğini yazmak şart değildir. Nitekim &amp;ouml;zelliklerin hepsi, tasarım zamanında &amp;ouml;zellik penceresinde g&amp;ouml;r&amp;uuml;n&amp;uuml;rler. Ancak bazı &amp;ouml;zelliklerin burada değiştirilmesini istemediğimiz vakkalar olursa, false olarak işaretlenebilir. &lt;strong&gt;DefaultValue&lt;/strong&gt; &amp;ouml;zelliğine her ne kadar başlangı&amp;ccedil; i&amp;ccedil;in 1 değerini atamış olsakta, &lt;strong&gt;ToolboxData&lt;/strong&gt; niteliği i&amp;ccedil;erisinde bu &amp;ouml;zellik i&amp;ccedil;in yeni bir değer verilmiştir.&lt;/p&gt;
&lt;p&gt;Bunun doğal sonucu olarak, DefaultValue &amp;ouml;zelliğindeki değer yerine ToolboxData i&amp;ccedil;erisindeki &amp;ouml;zellik değeri, &amp;ouml;zellikler penceresinde g&amp;ouml;r&amp;uuml;necektir. &lt;strong&gt;Themeable&lt;/strong&gt; niteliği, Asp.Net 2.0 ile birlikte gelmiş olan tema kavramına istinaden kullanılabilir. Eğer false değeri atanırsa &amp;ouml;zelliğimize tema veya skin uygulanamayacaktır. &lt;strong&gt;Localizable&lt;/strong&gt; &amp;ouml;zelliğine true değerinin atanması ile, SeciliGun değerinin &lt;strong&gt;resource&lt;/strong&gt; dosyalarında g&amp;ouml;r&amp;uuml;nmesi sağlanır. &amp;Ouml;rneğin t&amp;uuml;m &amp;ouml;zelliklerimizde bu niteliği true olarak kullandığımızda aşağıdaki gibi bir resource dosyası &amp;uuml;retilebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk189_8.gif" alt="" width="323" height="295" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Categroy niteliğini kullandığımız takdirde, &amp;ouml;zelliklerin properties b&amp;ouml;l&amp;uuml;m&amp;uuml;nde mantıksal isim başlıkları altında yer alması sağlanabilir. &amp;Ouml;rneğin SeciliGun,SeciliAy, SeciliYil &amp;ouml;zelliklerini Tarih Degerleri isimli bir grup altında toplayabiliriz. Benzer bir şekilde, AyMetin, GunMetin ve YilMetin &amp;ouml;zelliklerini Metinler adında bir grup başlığında toplayabiliriz. Sonu&amp;ccedil; aşağıdakine benzer olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk189_9.gif" alt="" width="277" height="343" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi, geliştireceğimiz kontrollerin tasarım zamanındaki davranışlarını niteliklerimiz yardımıyla belirleyebilmekteyiz. Bu makalemizde web kontrol&amp;uuml; geliştirmekle ilgili olarak, state y&amp;ouml;netimini ViewState' ler yardımıyla nasıl yapabileceğimizi, tasarım zamanındaki davranışları nasıl belirleyebileceğimizi incelemeye &amp;ccedil;alıştık. Şu ana kadar yaptıklarımız ile ilgili olarak aklımızda kalanları ise aşağıdaki maddeler ile &amp;ouml;zetleyebiliriz.&lt;/p&gt;
&lt;table id="table12" style="border-collapse: collapse; width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#336699"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;"&gt;&lt;strong&gt;Şu Ana Kadar Hatırda Kalanlar&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff"&gt;Bir web sunucu kontrol&amp;uuml;n&amp;uuml;n sayfanın y&amp;uuml;klenişi sırasında set edilen değerlerini korumak i&amp;ccedil;in &amp;ouml;zelliklerin i&amp;ccedil;erisindeki verileri ViewState' ler i&amp;ccedil;erisinde saklamak gerekir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff"&gt;ViewState kullanmak, kontrol&amp;uuml;n istemci tarafında değişikliğe uğrayacak değerlerini ele almak i&amp;ccedil;in yeterli değildir. Bu durumda işin i&amp;ccedil;erisinde postback sonucu sunucuya g&amp;ouml;nderilecek dataların ele alınması gibi şartlar girmektedir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff"&gt;Web sunucu kontrollerine tasarım zamanı desteği sağlanabilir. B&amp;ouml;ylece Vs.Net IDE' si i&amp;ccedil;erisindeki davranış modelleri ele alınabilir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff"&gt;Tasarım zamanı davranışlarını belirleyen nitelikleri Assembly, Class ve Property olmak &amp;uuml;zere toplam &amp;uuml;&amp;ccedil; seviyede belirleyebiliriz.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Sonraki makalemizde Render metodu ile ilişkili başka d&amp;uuml;zenlemer yapacak ve PostBack olaylarını nasıl ele alabileceğimizi araştırmaya &amp;ccedil;alışacağız. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2007-01-23 12:00:00</pubDate>
  <slug>Web-Server-Control-Yazmak-2-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet-20</tag>
    <tag>web-server-control</tag>
    <tag>aspnet</tag>
  </tags>
  <categories>
    <category>Asp.Net 2.0</category>
  </categories>
</post>