<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>.Net Core Web Api Tarafında SqlKata ile Sevimli SQL İşlemleri</title>
  <description>Veri odaklı uygulamalarda sorgu komutlarını çalıştırmak için kullandığımız birçok hazır altyapı var. Örneğin .Net dünyasına baktığımızda en temel seviyede Ado.Net ve Object Releational Mapping tarafında Entity Framework sıklıkla karşılaştıklarımız arasında. SqlKata'da bunlardan birisi olarak düşünülebilir. Bir süredir de sağda solda okuduğum makale ve github çalışmalarından dolayı merak edip kurcalamak istediğim bir kütüphaneydi. C# ile geliştirimiş paketin temel amacı SqlServer, PostgreSql, Firebird, MySql gibi veritabanları için kod tarafında ortak bir sorgu oluşturma/derleme arabirimi sunmak ama bunu LINQ sorgu metotları üzerinden SQL dilinin anlaşılır rahatlığında, injection yemeden(Parameter Binding tekniğini kullandığı için) ve cache gibi performans artırıcıları kullanarak sağlamak...</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/35/kata.png" alt="" align="right" /&gt;Veri odaklı uygulamalarda sorgu komutlarını &amp;ccedil;alıştırmak i&amp;ccedil;in&amp;nbsp;kullandığımız bir&amp;ccedil;ok hazır altyapı var. &amp;Ouml;rneğin .Net d&amp;uuml;nyasına baktığımızda en temel seviyede Ado.Net ve Object Relational Mapping tarafında Entity Framework&amp;nbsp;sıklıkla karşılaştıklarımız arasında. &lt;a href="https://sqlkata.com/" target="_blank"&gt;SqlKata&lt;/a&gt;'da bunlardan birisi olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Bir s&amp;uuml;redir de sağda solda okuduğum makale ve github &amp;ccedil;alışmalarından dolayı merak edip kurcalamak istediğim bir k&amp;uuml;t&amp;uuml;phane. &amp;Ouml;ncelikle ismi &amp;ccedil;ok hoş&lt;em&gt;(Code Kata'yı &amp;ccedil;ağrıştırıyor bana)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;C# ile geliştirimiş paketin temel amacı SqlServer, PostgreSql, Firebird, MySql gibi veritabanları i&amp;ccedil;in kod tarafında ortak bir sorgu oluşturma/derleme arabirimi sunmak ama bunu LINQ sorgu metotları &amp;uuml;zerinden SQL dilinin anlaşılır rahatlığında, injection yemeden&lt;em&gt;(Parameter Binding tekniğini kullandığı i&amp;ccedil;in) &lt;/em&gt;ve &amp;ouml;n bellekleme&lt;em&gt;(caching)&lt;/em&gt; gibi performans artırıcıları kullanarak sağlamak. Tabii konuşmayı bir kenara bırakıp kod yazarak onu tanımaya &amp;ccedil;alışmak en doğrusu. Ben &amp;ouml;rneği Heimdall&lt;em&gt;(Ubuntu-20.04)&lt;/em&gt; &amp;uuml;zerinde ve Visual Studio Code arabirimini kullanarak geliştirmekteyim&lt;em&gt;(Uygulama kodlarının tamamına &lt;a href="https://github.com/buraksenyurt/skynet/tree/master/No%2035%20-%20Hiyaaa%20This%20is%20SqlKata" target="_blank"&gt;SkyNet github reposu&lt;/a&gt; &amp;uuml;zerinden erişebilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizde SqlKata paketini bir PostgreSql veritabanı &amp;uuml;zerinden kullanacağız. Daha &amp;ouml;nceden de sıklıkla yaptığımız &amp;uuml;zere Docker imajından yararlanabiliriz. Ancak elimde i&amp;ccedil;eriği ile dolu dolu hazır bir veritabanı olsa g&amp;uuml;zel olabilir. Microsoft'un Adventure Works ve Northwind gibi, yazılım eğitimlerinde sıklıkla kullanılan efsane veritabanları olduğunu bilirsiniz. PostgreSql i&amp;ccedil;in hazırlanmış olan hatta Docker Container olarak &amp;ccedil;alıştırılabilecek bir versiyonunu da &lt;a href="https://github.com/pthom/northwind_psql" target="_blank"&gt;şu github adresinden&lt;/a&gt;&amp;nbsp;tedarik edebiliyoruz. &amp;Uuml;stelik g&amp;uuml;zel bir ilişkisel diagram da mevcut&lt;em&gt;(repodaki wind-of-change klas&amp;ouml;r&amp;uuml;nde kurulumu i&amp;ccedil;in gerekli SQL dosyasını bulabilirsiniz)&lt;/em&gt; Docker i&amp;ccedil;in kullanacağımız kompozisyonun i&amp;ccedil;eriği ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;version: '3'

services:
  db:
    image: postgres:12
    environment:
      POSTGRES_DB: northwind
      POSTGRES_USER: scoth
      POSTGRES_PASSWORD: tiger
    ports:
        - "5433:5433"
    volumes:
      - ./dbdata:/var/lib/postgresql/data
      - ./init.sql:/docker-entrypoint-initdb.d/init.sql
    command: -p 5433&lt;/pre&gt;
&lt;p&gt;İlgili terminal komutu ile docker container ayağa kaldırıldıktan sonra y&amp;uuml;klenen Northwind veritabanı i&amp;ccedil;erisine ş&amp;ouml;yle bir bakmakta da yarar var. En azından verilerin geldiğini g&amp;ouml;relim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# container'ı ayağa kaldırmak i&amp;ccedil;in wind-of-change klas&amp;ouml;r&amp;uuml;nde aşağıdaki terminal komutunu kullanabiliriz
docker-compose up

# ikinci bir terminalden veya pgAdmin gibi bir ara&amp;ccedil;la Northwind i&amp;ccedil;eriğine bakabiliriz
# Ben scoth kullanıcı adını tanımlamıştım.
docker-compose exec db psql -U scoth -d northwind

# Yukarıdaki komut sonrası a&amp;ccedil;ılan psql cli'de birka&amp;ccedil; SQL ifadesi deneyebiliriz
# &amp;Ouml;rneğin En pahalı 3 &amp;uuml;r&amp;uuml;n&amp;uuml; listeleylim
Select product_name,unit_price from products order by unit_price desc limit 3;
# veya kategorilerin adlarını
Select category_name from categories;&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/35/Screenshot_01.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Pek tabii amacımız&amp;nbsp;SqlKata ile bu PostgreSql veritabanına bağlanıp bir takım işlemler yapabilmek. Rapor &amp;ccedil;ekmek, satır ekleyip silmek ve benzer işlemleri icra edebiliriz. Deneme kodları i&amp;ccedil;in bir .Net Core Web Api projesi pekala uygun bir &amp;ccedil;&amp;ouml;z&amp;uuml;m. REST servis &amp;ccedil;ağrıları ile u&amp;ccedil;tan uca &amp;ccedil;alışan bir &amp;ouml;rneği denemiş de oluruz. &amp;Ouml;yleyse aşağıdaki terminal komutlarından yararlanarak projemizi oluşturalım ve gerekli Nuget paketlerini de ekleyerek yolumuza devam edelim.&lt;/p&gt;
&lt;p&gt;# &amp;Ouml;nce src klas&amp;ouml;r&amp;uuml;nde bir api projesi a&amp;ccedil;ayım&lt;br /&gt;dotnet new webapi -o northwind-api&lt;/p&gt;
&lt;p&gt;# Gerekli paketleri y&amp;uuml;kleyelim&lt;br /&gt;# Postgresql i&amp;ccedil;in npsql ve SqlKata i&amp;ccedil;in SqlKata :)&lt;br /&gt;dotnet add package Npgsql&lt;br /&gt;dotnet add package SqlKata&lt;br /&gt;dotnet add package SqlKata.Execution&lt;/p&gt;
&lt;p&gt;SQLKata ile ilgili &amp;ouml;rnek kullanımlar Controller sınıflarımızda yer alıyor. Basit olması a&amp;ccedil;ısından Category, Product ve Customer tabloları i&amp;ccedil;in birer Controller tipi mevcut. İlk olarak bu sınıfları yazarak işe başlayabiliriz. CustomerController i&amp;ccedil;erisinde hangi şehirde ka&amp;ccedil; m&amp;uuml;şteri olduğu bilgisini raporlayan basit bir operasyon bulunuyor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.AspNetCore.Mvc;
using Microsoft.Extensions.Logging;

/*
    SqlKata kullanımı i&amp;ccedil;in eklenen namespace bildirimleri
*/
using SqlKata;
using SqlKata.Execution;

namespace NorthwindApi.Controllers
{
    [ApiController]
    [Route("api/[controller]")]
    public class CustomerController : ControllerBase
    {
        private readonly ILogger&amp;lt;CustomerController&amp;gt; _logger;
        private readonly QueryFactory _queryFactory;

        public CustomerController(ILogger&amp;lt;CustomerController&amp;gt; logger, QueryFactory queryFactory)
        {
            _logger = logger;
            _queryFactory = queryFactory;
        }


        /*
            Hangi şehirde ka&amp;ccedil; m&amp;uuml;şterimiz olduğunu d&amp;ouml;nd&amp;uuml;ren action.
            customers tablosunda city bilgisine g&amp;ouml;re gruplama yapıp, count alıyoruz yani.
            &amp;Ouml;rnek sorgu -&amp;gt; https://localhost:5001/api/customer/cityreport
        */
        [HttpGet("cityreport")]
        public IActionResult GetCustomerCountsByCity()
        {
            var report = _queryFactory
                .Query("customers")
                .Select("city")
                .SelectRaw("count(customer_id) as count") // aggregation yaptığımız yer
                .GroupBy("city") // city alanına g&amp;ouml;re grupluyoruz
                .HavingRaw("count(customer_id)&amp;gt;1") // toplam m&amp;uuml;şteri sayısı 1in &amp;uuml;st&amp;uuml;nde olanlar i&amp;ccedil;in (having e bir bakayım demiştim)
                .Get();

            return Ok(report);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;ProductController ise iki operasyon sunmakta. Birisinde satışta olmayan/&amp;uuml;retilmeyen &amp;uuml;r&amp;uuml;nlerin listesini d&amp;ouml;nd&amp;uuml;r&amp;uuml;yoruz&lt;em&gt;(Siz var olanları &amp;ccedil;ekmeyi de deneyin)&lt;/em&gt;&amp;nbsp;Diğeri ise kategoriye g&amp;ouml;re &amp;uuml;r&amp;uuml;n listesini sayfa bazlı d&amp;ouml;nd&amp;uuml;r&amp;uuml;yor. REST tipindeki servislerde liste bazlı operasyonların b&amp;uuml;y&amp;uuml;k boyutta veri d&amp;ouml;nd&amp;uuml;rmesi &amp;ccedil;ok tercih edilen bir durum değil. Bunun yerine veriyi sayfalama tekniği ile d&amp;ouml;nd&amp;uuml;rmek hem performans hem de veri g&amp;uuml;venliği a&amp;ccedil;ısından daha doğru. Sayfalamanın SQLKatacasını aşağıdaki kod par&amp;ccedil;asında g&amp;ouml;rebilirsiniz :)&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.AspNetCore.Mvc;
using Microsoft.Extensions.Logging;

/*
    SqlKata kullanımı i&amp;ccedil;in eklenen namespace bildirimleri
*/
using SqlKata;
using SqlKata.Execution;

namespace NorthwindApi.Controllers
{
    [ApiController]
    [Route("api/[controller]")]
    public class ProductController : ControllerBase
    {
        private readonly ILogger&amp;lt;ProductController&amp;gt; _logger;
        /*
            Startup tarafında bildirimini yaptığımız QueryFactory nesnesini
            constructor ile buraya enjekte ettik. B&amp;ouml;ylece controller i&amp;ccedil;indeki
            t&amp;uuml;m action metotlarında SqlKata yı kullanabileceğiz.
        */
        private readonly QueryFactory _queryFactory;

        public ProductController(ILogger&amp;lt;ProductController&amp;gt; logger, QueryFactory queryFactory)
        {
            _logger = logger;
            _queryFactory = queryFactory;
        }

        /*
            İlk SqlKata denemem.
            products tablosunda discontinued olanların listesini &amp;ccedil;ekmeye &amp;ccedil;alışıyoruz
            Geriye JSON i&amp;ccedil;erik d&amp;ouml;necektir
        */
        [HttpGet("Discontinued/")]
        public IActionResult GetDiscontinuedProducts()
        {
            var products = _queryFactory
                .Query("products") // products tablosu i&amp;ccedil;in sorgu hazırlanacak
                .Select("product_id", "product_name", "unit_price") // sadece bu alanlar getirilecek
                .Where("discontinued", 1) // discontinued değeri 1 olanlar &amp;ccedil;ekilecek
                .Get();

            //_logger.LogInformation($"{DateTime.UtcNow.ToLongTimeString()} - ProductController - GET");

            return Ok(products);
        }

        /*
            Parametre olarak gelen kategori altındaki &amp;uuml;r&amp;uuml;nleri sayfalayarak getiren action.
            Sayfalama i&amp;ccedil;in Limit ve Offset fonksiyonlarını kullanıyoruz.
            Route &amp;uuml;st&amp;uuml;nden gelen page değerine g&amp;ouml;re bir konuma gidip o konumdan itibaren 5 kayıt g&amp;ouml;steriyoruz.
            &amp;Ouml;rnek sorgu -&amp;gt; https://localhost:5001/api/product/Beverages/3
        */
        [HttpGet("{categoryName}/{page}")]
        public IActionResult GetProductsByCategory(string categoryName, int page)
        {
            var products = _queryFactory
                .Query("products as p")
                .Join("categories as c", "p.category_id", "c.category_id")
                .Select(
                    "c.category_name",
                    "p.{product_id,product_name,unit_price,units_in_stock}")
                .Limit(5)
                .Offset((page - 1) * 5)
                .Get();

            return Ok(products);
        }

    }
}&lt;/pre&gt;
&lt;p&gt;CategoryController tarafında kullandığımız Category sınıfı;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace NorthwindApi.Model
{
    public class Category{
        public int CategoryId { get; set; }
        public string Name { get; set; }
        public string Description { get; set; }
        public byte[] Picture { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;CategoryController, yeni kategori eklenmesi, silinmesi ve kategori listesinin d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi ile ilgili metotlar barındırıyor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.AspNetCore.Mvc;
using Microsoft.Extensions.Logging;
using NorthwindApi.Model;

/*
    SqlKata kullanımı i&amp;ccedil;in eklenen namespace bildirimleri
*/
using SqlKata;
using SqlKata.Execution;

namespace NorthwindApi.Controllers
{
    [ApiController]
    [Route("api/[controller]")]
    public class CategoryController : ControllerBase
    {
        private readonly ILogger&amp;lt;CategoryController&amp;gt; _logger;
        private readonly QueryFactory _queryFactory;

        public CategoryController(ILogger&amp;lt;CategoryController&amp;gt; logger, QueryFactory queryFactory)
        {
            _logger = logger;
            _queryFactory = queryFactory;
        }


        /*
            Yeni bir kategori eklemek i&amp;ccedil;in kullanacağımız post action.
            Parametre olarak gelen JSON i&amp;ccedil;eriğindeki alanları kullanıyor.
            Insert işlemi sonucuna g&amp;ouml;re de Ok veya 500 d&amp;ouml;n&amp;uuml;yoruz.
            Adres : https://localhost:5001/api/category
            Metot : HTTP Post
            Body : 
            {
                "CategoryId":10,
                "Name": "Kitap",
                "Description": "Kitap konulu &amp;uuml;r&amp;uuml;nler"
            }
        */
        [HttpPost]
        public IActionResult AddCategory(Category category)
        {
            try
            {
                var inserted_id = _queryFactory
                                .Query("categories")
                                .Insert(new
                                {
                                    category_id = category.CategoryId,
                                    category_name = category.Name,
                                    description = category.Description
                                });
                return Ok(category);
            }
            catch (Exception exp)
            {
                _logger.LogError(exp.Message);
                return StatusCode(500, "Kategori ekleme işlemi başarısız!");
            }
        }

        /*
            Denemeler sırasında categories tablosunu kirletecek yeni satırlar ekledim tabii :)
            Silme operasyonu da lazım.
            &amp;Ouml;rnek sorgu https://localhost:5001/api/category/10
            Metot HTTP Delete
        */
        [HttpDelete("{id}")]
        public IActionResult Delete(int id)
        {
            int deleted = _queryFactory.Query("categories").Where("category_id", id).Delete();
            return Ok(deleted);
        }

        /*
            Kategorileri listeleyen action
            https://localhost:5001/api/category
        */
        [HttpGet]
        public IActionResult GetCategories()
        {
            var categories = _queryFactory
                .Query("categories")
                .OrderBy("category_name")
                .Get();

            return Ok(categories);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;ve tabii SQLKata i&amp;ccedil;in gerekli Middleware tanımlarını da i&amp;ccedil;eren startup dosyamız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.AspNetCore.Builder;
using Microsoft.AspNetCore.Hosting;
using Microsoft.AspNetCore.HttpsPolicy;
using Microsoft.AspNetCore.Mvc;
using Microsoft.Extensions.Configuration;
using Microsoft.Extensions.DependencyInjection;
using Microsoft.Extensions.Hosting;
using Microsoft.Extensions.Logging;
/*
    Postgresql ve SqlKata i&amp;ccedil;in gerekli namespace bildirimleri
*/
using SqlKata;
using SqlKata.Compilers;
using SqlKata.Execution;
using Npgsql; 

namespace NorthwindApi
{
    public class Startup
    {
        public Startup(IConfiguration configuration)
        {
            Configuration = configuration;
        }

        public IConfiguration Configuration { get; }

        // This method gets called by the runtime. Use this method to add services to the container.
        public void ConfigureServices(IServiceCollection services)
        {
            services.AddControllers();

            /*
                QueryFactory sınıfını burada kayıt edip controller'lara constructor &amp;uuml;zerinde enjekte ederek kullandırtabiliriz.
                Oluştururken Postgresql bağlantı bilgisini veriyoruz.
                Ayrıca sorgular i&amp;ccedil;in gerekli derleyici nesnesi de &amp;uuml;retiliyor
            */
            services.AddScoped(factory =&amp;gt;
            {
                return new QueryFactory
                {
                    Compiler = new PostgresCompiler(),
                    // Varsayılan olarak Postgresql 5432 portunu kullanıyor. 
                    // Ben docker-compose'da dışarıya 5433 portundan a&amp;ccedil;tığım i&amp;ccedil;in farklı. 
                    Connection = new NpgsqlConnection("Server=127.0.0.1;Port=5433;Username=scoth;Password=tiger;Database=northwind")
                };
            });
        }

        public void Configure(IApplicationBuilder app, IWebHostEnvironment env)
        {
            if (env.IsDevelopment())
            {
                app.UseDeveloperExceptionPage();
            }
            app.UseHttpsRedirection();
            app.UseRouting();
            app.UseAuthorization();
            app.UseEndpoints(endpoints =&amp;gt;
            {
                endpoints.MapControllers();
            });
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Artık uygulamamız test s&amp;uuml;r&amp;uuml;ş&amp;uuml;ne hazır ;)&amp;nbsp;Web API hizmeti &amp;ccedil;alışmaya başlamadan &amp;ouml;nce tahmin edeceğiniz gibi&amp;nbsp;docker-compose ile PostgreSql Container &amp;ouml;rneğinin ayağa kalkmış olması gerekiyor. Sonrasında aşağıdaki terminal komutu ile ilerleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet run watch&lt;/pre&gt;
&lt;p&gt;İlk olarak&amp;nbsp;artık satışta olmayan &amp;uuml;r&amp;uuml;nleri &amp;ccedil;ekmeye &amp;ccedil;alışalım. Bunun i&amp;ccedil;in servise&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;https://localhost:5001/api/product/discontinued&lt;/pre&gt;
&lt;p&gt;şeklinde bir talep g&amp;ouml;ndermemiz yeterli. Aşağıdakine benzer bir sonu&amp;ccedil; almamız gerekiyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/35/Screenshot_02.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bir kategoriye ait &amp;uuml;r&amp;uuml;nlerin birka&amp;ccedil; bilgisini getiren ama bunu yaparken sayfalama tekniğini kullanan operasyon i&amp;ccedil;inse aşağıdaki gibi bir talep yollanabilir.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;https://localhost:5001/api/product/Beverages/3&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/35/Screenshot_04.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere 3nc&amp;uuml; sayfadan itibaren ilk 5 kayıt getirilmiştir. En basit operasyonlardan birisi de t&amp;uuml;m kategorilerin&amp;nbsp;&amp;ccedil;ekilmesidir :)&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;https://localhost:5001/api/category&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/35/Screenshot_05.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;M&amp;uuml;şterilerin bulundukları şehre g&amp;ouml;re guruplandığı raporu ise aşağıdaki taleple &amp;ccedil;ekebiliriz.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;https://localhost:5001/api/customer/cityreport&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/35/Screenshot_06.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hemen yeni bir kategori eklemeyi deneyelim. Ekleme işlemini Postman ile denemek i&amp;ccedil;in aşağıdaki &amp;ouml;rnek bilgileri kullanabilirsiniz.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;Adres: https://localhost:5001/api/category
Metod: HTTP Post
Body: json
&amp;Ouml;rnek İ&amp;ccedil;erik:
{
	"CategoryId":10,
	"Name": "Kitap",
	"Description": "Kitap konulu &amp;uuml;r&amp;uuml;nler"
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/35/Screenshot_07.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabii aynı Id ile bir kategori eklemek istersek exception y&amp;ouml;netimimize g&amp;ouml;re aşağıdaki gibi bir &amp;ccedil;ıktı almamız gerekir&lt;em&gt;(Bu hata mesajını biraz daha anlamlı hale getirmek yerinde olabilir. Nitekim işlem başarısız ama neden başarısız olduğu istemci tarafında tam olarak anlaşılmıyor)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/35/Screenshot_08.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Eklediğimiz kategoriyi silmek i&amp;ccedil;inse bir HTTP Delete &amp;ccedil;ağrısı yapmalıyız.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;Adres: https://localhost:5001/api/category/10
Metot: HTTP Delete&lt;/pre&gt;
&lt;p&gt;Bu arada &amp;ouml;rneği &amp;ccedil;alışırken karşılaştığım enteresan bir durum vardı. Bu durumu a&amp;ccedil;ıklamak i&amp;ccedil;in localhost:5001/api/product/Beverages talebini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. Beverages kategorisindeki &amp;uuml;r&amp;uuml;nlerin listesini almayı bekliyoruz. Ancak kod tarafında yapacağımız minik bir değişiklik y&amp;uuml;z&amp;uuml;nden aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi connection string bilgisini g&amp;ouml;rme ihtimalimiz var. &amp;Ouml;ncelikle bu nasıl m&amp;uuml;mk&amp;uuml;n olabilir, ikinci olarak bunun &amp;ouml;n&amp;uuml;ne nasıl ge&amp;ccedil;eriz? L&amp;uuml;tfen yorumlarınızı esirgemeyin, t&amp;uuml;m okurlarımız faydalansın.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/35/Screenshot_03.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;SQL sorgulama komutlarına hakim olanlar i&amp;ccedil;in LINQ&lt;em&gt;(Language INtegrated Query)&lt;/em&gt; ile birleştirilen bu kullanım şekli olduk&amp;ccedil;a pratik g&amp;ouml;r&amp;uuml;n&amp;uuml;yor. &amp;Uuml;retim ortamında da değerlendirilebilir mi hen&amp;uuml;z emin değilim ancak pilot olarak denenebilir. Y&amp;uuml;ksek transaction i&amp;ccedil;eren servis operasyonlarında nasıl bir tepki vereceğine bakacak şekilde y&amp;uuml;k testlerine tabi tutmak karar verme noktasında yardımcı olabilir.&lt;/p&gt;
&lt;p&gt;SQLKata'yı tanımaya &amp;ccedil;alıştığımız bu &amp;ouml;rnek &amp;uuml;zerinde yapabileceğiniz daha bir&amp;ccedil;ok şey var. &amp;Ouml;rneğin OData altyapısını kullanmadan servisi OData standartlarına uyumlu hale getirmeyi deneyebilirsiniz ya da PostgreSql yerine MySql gibi bir veritabanını kullanabilirsiniz. SQL sorgularını daha yakından tanımak i&amp;ccedil;in farklı operasyonları devreye alabilirsiniz. Son bir haftada&lt;em&gt;(ya da belirtilen aylarda)&lt;/em&gt; verilen siparişlerin listesini &amp;ccedil;ekmek, talepte bulunan kullanıcının yaşadığı b&amp;ouml;lgeye g&amp;ouml;re o y&amp;ouml;rede en &amp;ccedil;ok satılan &amp;uuml;r&amp;uuml;nleri raporlamak vb. Temel CRUD operasyonlarını saymıyorum bile ;) B&amp;ouml;ylece geldik bir &lt;a href="https://github.com/buraksenyurt/skynet" target="_blank"&gt;SkyNet&lt;/a&gt; derlememizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2020-10-28 14:14:00</pubDate>
  <slug>net-core-web-api-tarafinda-sqlkata-ile-sevimli-sql-islemleri</slug>
  <tags>
    <tag>net-core</tag>
    <tag>sqlkata</tag>
    <tag>postgresql</tag>
    <tag>c#</tag>
    <tag>sql</tag>
    <tag>linq</tag>
    <tag>net</tag>
    <tag>northwind</tag>
    <tag>docker</tag>
    <tag>docker-compose</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
  </categories>
</post>