<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net 2.0 ile Veri Kümelerinde Sayfalama İşlemleri</title>
  <description>Bu makalemizde, Asp.Net 2.0 ile geliştirilen sayfalarda, veri kümeleri üzerinde sayfalama işlemlerinin nasıl yapıldığını incelemeye çalışacağız. Sayfalama işlemleri, özellikle internet(intranet) uygulamalarında yaygın şekilde kullanılan bir tekniktir. Burada, veri kümesine ati olan satırlar, DataGrid gibi bir kontrolde gösterilirken, sayfalara ayrılırlar. Böylece veri kümesine ait satırlar arasında toplu geçiş yapmamıza imkan sağlayan, navigasyon seçeneklerine sahip olmuş oluruz.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bu makalemizde, Asp.Net 2.0 ile geliştirilen sayfalarda, veri k&amp;uuml;meleri &amp;uuml;zerinde sayfalama işlemlerinin nasıl yapıldığını incelemeye &amp;ccedil;alışacağız. Sayfalama işlemleri, &amp;ouml;zellikle internet(intranet) uygulamalarında yaygın şekilde kullanılan bir tekniktir. Burada, veri k&amp;uuml;mesine ati olan satırlar, DataGrid gibi bir kontrolde g&amp;ouml;sterilirken, sayfalara ayrılırlar. B&amp;ouml;ylece veri k&amp;uuml;mesine ait satırlar arasında toplu ge&amp;ccedil;iş yapmamıza imkan sağlayan, navigasyon se&amp;ccedil;eneklerine sahip olmuş oluruz.&lt;/p&gt;
&lt;p&gt;Asp.Net 2.0 i&amp;ccedil;inde aynı imkanlar ve kabiliyetler s&amp;ouml;z konusudur. Ancak uygulanış şekli ve kullanılan bileşenler &amp;ccedil;ok daha farklıdır. Herşeyden &amp;ouml;nce, Asp.Net 1.0/1.1 de izlenen yollara nazaran, daha kısa ve etkili bir teknik geliştirilmiştir. Asp.Net' in ilk s&amp;uuml;r&amp;uuml;mleri ile geliştirilen uygulamalarda, sayfalama işlemlerinin ger&amp;ccedil;ekleştirilmesi i&amp;ccedil;in DataGrid kontrollerinde ekstradan olay prosed&amp;uuml;r&amp;uuml; kodlamamız gerekmektedir. Bu bizim i&amp;ccedil;in fazla maliyettir. Nitekim zaman kaybettirici bir işlemdir. Ne demek istediğimi ve Asp.Net 2.0' da hangi noktaya geldiğimizi g&amp;ouml;rmek i&amp;ccedil;in Visual Studio.Net 2003 ile geliştirilen aşağıdaki internet sayfasına bir g&amp;ouml;z atalım.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;
&amp;lt;head&amp;gt;
&amp;lt;meta http-equiv="Content-Type" content="text/html; charset=windows-1252"&amp;gt;
&amp;lt;title&amp;gt;New Page 1&amp;lt;/title&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body&amp;gt;
&amp;lt;%@ Page language="c#" Codebehind="WebForm1.aspx.cs" AutoEventWireup="false" Inherits="Sayfalama.WebForm1" %&amp;gt;
&amp;lt;!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" &amp;gt;
&amp;lt;title&amp;gt;WebForm1&amp;lt;/title&amp;gt;
&amp;lt;form id="Form1" method="post" runat="server"&amp;gt;
&amp;lt;asp:DataGrid id="DataGrid1" runat="server" AllowPaging="True"&amp;gt;
&amp;lt;PagerStyle Mode="NumericPages"&amp;gt;&amp;lt;/PagerStyle&amp;gt;
&amp;lt;/asp:DataGrid&amp;gt;
&amp;lt;/form&amp;gt;
&amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu aspx sayfasında, DataGrid kontrol&amp;uuml; &amp;uuml;zerinde sayfalama işlemini ger&amp;ccedil;ekleştirebilmek i&amp;ccedil;in AllowPaging &amp;ouml;zelliğine true değeri atanmıştır. Bununla birlikte sayfalamanın sayısal olarak ger&amp;ccedil;ekleştirilmesi i&amp;ccedil;in PagerStyle takısı eklenmiş ve bu takının Mode &amp;ouml;zelliğine NumericPages değeri atanmıştır. Code-Behind kodlarımıza bakacak olursak, benzer uygulamalarda da muhtemelen aşağıdaki kod satırlarında kullanılan tarzda bir veri elde ediliş y&amp;ouml;ntemi uygulandığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page language="c#" Codebehind="WebForm1.aspx.cs" AutoEventWireup="false" Inherits="Sayfalama.WebForm1" %&amp;gt; 
private void veriAl()
{ 
    SqlConnection con=new SqlConnection("data source=localhost;initial catalog=pubs;integrated security=SSPI");
    SqlCommand cmd=new SqlCommand("Select au_lname,au_fname,address From authors",con);
    SqlDataAdapter da=new SqlDataAdapter(cmd);
    DataTable dtYazarlar=new DataTable();
    da.Fill(dtYazarlar);
    DataGrid1.DataSource=dtYazarlar;
    DataGrid1.DataBind();
}
private void Page_Load(object sender, System.EventArgs e)
{
    if(!Page.IsPostBack)
    {
        veriAl();
    }
}

private void DataGrid1_PageIndexChanged(object source, System.Web.UI.WebControls.DataGridPageChangedEventArgs e)
{
    DataGrid1.CurrentPageIndex=e.NewPageIndex;
    veriAl();
}&lt;/pre&gt;
&lt;p&gt;Sayfamızı bu haliyle &amp;ccedil;alıştırdığımızda, veri k&amp;uuml;mesi i&amp;ccedil;erisinde sayfalama işlemlerinin ger&amp;ccedil;ekleştirilebildiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Elde ettiğimiz k&amp;uuml;me, sayfalara ayrılarak, DataGrid kontrol&amp;uuml;nde g&amp;ouml;sterilecektir. Yaptığımız işlem aslında basittir ancak uzundur. &amp;Ouml;ncelikle bir SqlConnection kontrol&amp;uuml; ile veri kaynağına bir bağlantı hattı &amp;ccedil;ekilir. Ardından, ilgili veri k&amp;uuml;mesini elde edebileceğimiz, Select sorgusunu taşıyan bir SqlCommand nesnesi oluşturulur.&lt;/p&gt;
&lt;p&gt;SqlCommand nesnesini kullanacak olan bir SqlDataAdapter ise, bağlantısız katmandaki DataTable nesnesini veri k&amp;uuml;mesi ile doldurmaktadır. Ardından elde edilen DataTable bileşeni DataGrid kontrol&amp;uuml;ne bağlanır ve DataGrid kontrol&amp;uuml; i&amp;ccedil;in DataBind metod &amp;ccedil;alıştırılır. T&amp;uuml;m bu işlemlerin yanında sayfanın PostBack olması durumunda kaybolacak paging &amp;ouml;zelliğinin &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek i&amp;ccedil;in, Load olayında, IsPostBack kontrol&amp;uuml; yapılır.&lt;/p&gt;
&lt;p&gt;Ayrıca, DataGrid kontrol&amp;uuml;nde, sayfalama işlemi sonrası oluşan sayfa numarası linklerine basıldığında, veri k&amp;uuml;mesinin ilgili parseline gidebilmek i&amp;ccedil;in, DataGrid1_PageIndexChanged olay metoduda kodlanmıştır. Bu yol her nekadar bir s&amp;uuml;re Asp.Net ilee uygulama geliştiren biris i&amp;ccedil;in anlaşılır ve kolay g&amp;ouml;z&amp;uuml;ksede, takdir edersinizki uzun ve aynı zamanda verimsiz bir yapıdadır. Herşeyden &amp;ouml;nce, &amp;ccedil;ok fazla kaynak t&amp;uuml;ketimi s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk84_1.gif" alt="" width="273" height="150" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 1. Asp.Net 1.1 Sayfalam işlemi.&lt;/p&gt;
&lt;p&gt;Burada takip ettiğimiz yolu d&amp;uuml;ş&amp;uuml;ncek olursak, aslında gereksiz yere bir ka&amp;ccedil; adım işlem yaptığımızı ve bir ka&amp;ccedil; nesne kaynağını gereksiz yere harcadığımızı d&amp;uuml;ş&amp;uuml;nebiliriz. Bu teknik dışında, SqlDataReader nesnesini kullanacağımız başka bir yol daha geliştirebilirdik. Ancak hangi yol se&amp;ccedil;ilirse se&amp;ccedil;ilsin, her ikiside uygulama geliştiricinin bir ka&amp;ccedil; satırda olsa fazladan kod yazmasını ve bazı p&amp;uuml;f noktalara (DataGrid1_PageIndexChanged olay metodu gibi) dikkat etmesini gerektirecektir. Bu elbetteki uygulama geliştiricinin artan tecr&amp;uuml;besi ile &amp;ouml;nemsiz hale gelebilir.&lt;/p&gt;
&lt;p&gt;Ancak işlerin dahada kısaltılarak yapılabileceğide ger&amp;ccedil;ektir. İşte Microsoft mimarları, bu eksikliğin farkına varmış olacaklarki, Asp.Net 2.0' da, sayfalama işlemine farklı bir yakaşım ve uygulama tekniği getirmişler. Herşeyden &amp;ouml;nce, DataSource kavramını kullanan Framework 2.0 i&amp;ccedil;in, sayfalama işlemlerini ger&amp;ccedil;ekleştirmek, Asp.Net 1.0/1.1 s&amp;uuml;r&amp;uuml;mlerine g&amp;ouml;re hem daha kolay hemde daha profesyonel bir anlayışa sahip. Bu yeni teknik sayesinde, uygulama geliştiricinin verimliliğinin daha da artacağı kanısındayım. Şimdi dilerseniz, Asp.Net 2.0' daki duruma bir g&amp;ouml;z atalım. Bu kez aspx sayfamızın kodlarını aşağıdaki gibi oluşturacağız.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" CompileWith="Sayfalama.aspx.cs" ClassName="Sayfalama_aspx" %&amp;gt;

&amp;lt;!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd"&amp;gt;

&amp;lt;html xmlns="http://www.w3.org/1999/xhtml" &amp;gt;
&amp;lt;head runat="server"&amp;gt;
&amp;lt;title&amp;gt;Untitled Page&amp;lt;/title&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body&amp;gt;
&amp;lt;form id="form1" runat="server"&amp;gt;
&amp;lt;div&amp;gt;

    &amp;lt;asp:GridView ID="GridView1" Runat="server" AllowPaging="True" DataSourceID="sqlKaynak"&amp;gt;
    &amp;lt;/asp:GridView&amp;gt;
    &amp;lt;asp:SqlDataSource runat="Server" ProviderName="System.Data.SqlClient" ConnectionString="data source=.;initial catalog=AdventureWorks;integrated security=true" SelectCommand="SELECT [EmployeeID],[Gender],[HireDate] FROM [AdventureWorks].[HumanResources].[Employee]" ID="sqlKaynak"&amp;gt;&amp;lt;/asp:SqlDataSource&amp;gt;

&amp;lt;/div&amp;gt;
&amp;lt;/form&amp;gt;
&amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu kodlara sahip Asp.Net 2.0 sayfamızı &amp;ccedil;alıştırdığımızda aşağıdaki gibi bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk84_2.gif" alt="" width="299" height="311" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 2. Asp.Net 2.0 i&amp;ccedil;in sayfalama işlemi.&lt;/p&gt;
&lt;p&gt;Burada dikkat edecek olursanız tek satır uygulama kodu yazılmamıştır. Bunun yerine t&amp;uuml;m işlemler, GridView ve SqlDataSource Asp.Net kontrolleri ile ger&amp;ccedil;ekleştirilmiştir. Bu kontroller, Asp.Net 2.0 ile gelen sayısız yeni bileşenden sadece ikisidir. GridView kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n en &amp;ouml;nemli &amp;ouml;zelliği, kendisine veri kaynağı olarak bir SqlDataSource nesnesini bildiren DataSourceID &amp;ouml;zelliğidir. Bu &amp;ouml;zellik ile, veri k&amp;uuml;mesini ala belirttiği veri kaynağından &amp;ccedil;ekecek olan SqlDataSource kontrol&amp;uuml;n&amp;uuml;n ID değeri belirtilir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:GridView ID="GridView1" Runat="server" AllowPaging="True" DataSourceID="sqlKaynak"&amp;gt;
    &amp;lt;/asp:GridView&amp;gt;&lt;/pre&gt;
&lt;p&gt;SqlDataSource bileşenimiz, uygulama geliştiricisinin verimliliğini arttıran yenilikler i&amp;ccedil;eririr. Asp.Net 1.1 ile yazdığımız bir &amp;ouml;nceki &amp;ouml;rneğin aksine, burada veri kaynağına bağlanma, veri k&amp;uuml;mesini &amp;ccedil;ekme ve bunları ilgili kontrol ile ilişkilendirme işlemleri tek bir bileşen i&amp;ccedil;erisindeki &amp;ouml;zellikle yardımıyla ger&amp;ccedil;ekleştirilebilmektedir. Bu noktada kontrol her nekadar DataAdapter' ı andırsada &amp;ccedil;ok daha farklı olduğunu ProviderName &amp;ouml;zelliğine bakarak bile anlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:SqlDataSource runat="Server" ProviderName="System.Data.SqlClient" ConnectionString="data source=.;initial catalog=AdventureWorks;integrated security=true" SelectCommand="SELECT [EmployeeID],[Gender],[HireDate] FROM [AdventureWorks].[HumanResources].[Employee]" ID="sqlKaynak"&amp;gt;&amp;lt;/asp:SqlDataSource&amp;gt;&lt;/pre&gt;
&lt;p&gt;SqlDataSource kontrol&amp;uuml; ile, burada &amp;ouml;rnek olarak, Yukon (Sql Server 2005) &amp;uuml;zerinde yer alan AdventureWorks veritabanındaki Employee tablosuna bağlanılmıştır. ProviderName &amp;ouml;zelliği, hangi veri sağlayıcının kullanılacağını belirtir. Biz burada doğal sql motorunu kullanmak istediğimizden, System.Data.SqlClient sınıfını kullandık. ConnectionString ile tahmin edeceğiniz gibi, veri kaynağına bir bağlantı hattı tahsis etmekteyiz. SelectCommand &amp;ouml;zelliği ilede, &amp;ccedil;alıştırmak istediğimiz Select sorgusunu tanımlıyoruz. SqlDataSource kontrol&amp;uuml; burada GridView kontrol&amp;uuml; ile beraber &amp;ccedil;alışmaktadır. Dolayısıyla, sayfalama işlemini ger&amp;ccedil;ekleştirmek i&amp;ccedil;in, GridView kontrol&amp;uuml;n&amp;uuml;n AllowPaging &amp;ouml;zelliğine true değerini atamamız ve kullanılcak DataSource bileşenini belirtmemiz yeterlidir.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalemizde kısaca Asp.Net 2.0 i&amp;ccedil;in sayfalama işlemlerinin nasıl ger&amp;ccedil;ekleştirilebildiğini incelemeye &amp;ccedil;alıştık. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-09-01 12:00:00</pubDate>
  <slug>Asp-Net-2-0-ile-Veri-Kumelerinde-Sayfalama-Islemleri-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet-20</tag>
    <tag>data-paging</tag>
  </tags>
  <categories>
    <category>Asp.Net 2.0</category>
  </categories>
</post>