<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF WebHttp Services - Client Bazlı Cache</title>
  <description>Bir önceki yazımızda(WCF WebHttp Services - Server Bazlı Cache) hatırlayacağınız üzere WCF WebHttp Service' lerinde sunucu taraflı ön belleklemeyi(Server-Based Caching) incelemeye çalışmış ve bu işin birde istemci taraflı olanından bahsetmiştik. Aslında sunucu ve istemci taraflı ön bellekleme işleyişleri birbirlerinden tamamen farklıdır. Sunucu taraflı ön bellekleme işleyişinde, tamponlanan veriyi üreten operasyonun duration süresi dolana kadar çalıştırılmaması söz konusudur. Yani istemciden gelen ilk talebin sonucunun ön belleğe alınmasını takiben gelen taleplerde, sunucu tarafındaki operasyon kodları icra edilmemektedir.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki yazımızda(&lt;a class="postheader taggedlink" href="/admin/post/WCF-WebHttp-Services-Server-Side-Caching"&gt;WCF WebHttp Services - Server Bazlı Cache)&lt;/a&gt; hatırlayacağınız &amp;uuml;zere &lt;strong&gt;WCF WebHttp Service' &lt;/strong&gt;lerinde &lt;strong&gt;sunucu taraflı &amp;ouml;n belleklemeyi(Server-Based Caching)&lt;/strong&gt; incelemeye &amp;ccedil;alışmış ve bu işin birde istemci taraflı olanından bahsetmiştik. Aslında sunucu ve istemci taraflı &amp;ouml;n bellekleme işleyişleri birbirlerinden tamamen farklıdır. Sunucu taraflı &amp;ouml;n bellekleme işleyişinde, tamponlanan veriyi &amp;uuml;reten operasyonun duration s&amp;uuml;resi dolana kadar &lt;span style="text-decoration: underline;"&gt;&amp;ccedil;alıştırılmaması&lt;/span&gt; s&amp;ouml;z konusudur. Yani istemciden gelen ilk talebin sonucunun &amp;ouml;n belleğe alınmasını takiben gelen taleplerde, sunucu tarafındaki operasyon kodları icra &lt;span style="text-decoration: underline;"&gt;edilmemektedir&lt;/span&gt;.&lt;/p&gt;
&lt;p&gt;Ne varki istemci taraflı &amp;ouml;n belleklemenin işleyişine g&amp;ouml;re sunucu tarafındaki&amp;nbsp;kodlar icra edilir ve &amp;ouml;n bellekleme yapılacağı, &lt;strong&gt;HTTP Cache-Control &lt;/strong&gt;bilgisinin istemciye g&amp;ouml;nderilen &lt;strong&gt;cevabın(Response)&lt;/strong&gt; &lt;strong&gt;Header &lt;/strong&gt;kısmına eklenmesi ile anlaşılır. Bir başka deyişle ilk talepten sonra gelecek taleplerde yine servis kodunun &amp;ccedil;alıştırılması g&amp;uuml;ndemdedir. Dolayısıyla ispatı ve analizi pekte kolay olmayan bir konu ile karşı karşıyayız. Bu y&amp;uuml;zden en azından nasıl hayata ge&amp;ccedil;irilebileceğini g&amp;ouml;rmeye &amp;ccedil;alışacağız. Elbette bir &amp;ouml;rnek geliştirerek. Gelin tembellik etmeyerek bir &amp;ouml;nceki uygulamamızdan devam etmek yerine yeni bir &amp;ouml;rnek &amp;uuml;zerinden istemci taraflı &amp;ouml;n belleklemenin nasıl yapılacağını araştıralım. &amp;Ouml;ncelikle aşağıdaki servis kodlarına sahip olan bir &lt;strong&gt;WCF REST Service Application&lt;/strong&gt;&amp;nbsp;projemiz olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.ServiceModel;
using System.ServiceModel.Activation;
using System.ServiceModel.Web;
using System.Web;

namespace Lesson7
{
    [ServiceContract]
    [AspNetCompatibilityRequirements(RequirementsMode = AspNetCompatibilityRequirementsMode.Allowed)]
    [ServiceBehavior(InstanceContextMode = InstanceContextMode.PerCall)]
    public class FunnyService
    {
        List&amp;lt;Wallpaper&amp;gt; wallpapers = new List&amp;lt;Wallpaper&amp;gt;
            {
                new Wallpaper{ Id=1000, Name="Ahhh!", Image=File.ReadAllBytes(HttpContext.Current.Server.MapPath("~/Images/Ahhh.jpg"))},
                new Wallpaper{ Id=1001, Name="Blue Light", Image=File.ReadAllBytes(HttpContext.Current.Server.MapPath("~/Images/BlueLight.jpg"))},
                new Wallpaper{ Id=1002, Name="My Dear Manager", Image=File.ReadAllBytes(HttpContext.Current.Server.MapPath("~/Images/Manager.jpg"))},
                new Wallpaper{ Id=1003, Name="No Sacrifice No Victory", Image=File.ReadAllBytes(HttpContext.Current.Server.MapPath("~/Images/Sacrifice.jpg"))}
            };
                
        [AspNetCacheProfile("WallpaperCache")] //web.config dosyasında WallpaperCache ismi ile output cache konfigurasyonu yapılmaktadır.
        [WebGet(UriTemplate = "Wallpapers/{Name}")]
        public List&amp;lt;Wallpaper&amp;gt; GetWallpapers(string Name)
        {
            var result = (from w in wallpapers
                         where w.Name.ToLower().Contains(Name.ToLower())
                         select w).ToList();
            return result;
        }
    }

    public class Wallpaper
    {
        public int Id { get; set; }
        public string Name { get; set; }
        public byte[] Image{ get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;GetWallpapers&lt;/strong&gt; isimli operasyonun &amp;ccedil;alıştırılması sonucunda istemci tarafına, &lt;strong&gt;Images&lt;/strong&gt; klas&amp;ouml;r&amp;uuml; altında yer alan &lt;strong&gt;jpg&lt;/strong&gt; uzantılı resim dosyalarına ait &lt;strong&gt;byte[]&lt;/strong&gt; i&amp;ccedil;eriklerini taşıyan ve&amp;nbsp;&lt;strong&gt;Wallpaper&lt;/strong&gt; tipinden nesne &amp;ouml;rneklerinden oluşan generic List&amp;lt;T&amp;gt; koleksiyonu d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmektedir&lt;em&gt;(Elbette varsayılan mesaj formatına g&amp;ouml;re &lt;strong&gt;XML&lt;/strong&gt; olarak)&lt;/em&gt;. &lt;strong&gt;AspNetCacheProfile &lt;/strong&gt;niteliği yardımıyla s&amp;ouml;z konusu operasyon i&amp;ccedil;in Caching işleminin icra edileceği bildirilir. Bu &amp;ouml;n belleklemenin hangi kriterlere g&amp;ouml;re yapılacağına ait tanımlamalar ise&lt;strong&gt; web.config&lt;/strong&gt; dosyası i&amp;ccedil;erisinde aşağıdaki gibi belirlenir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0"?&amp;gt;
&amp;lt;configuration&amp;gt;  
  &amp;lt;system.web&amp;gt;
    &amp;lt;compilation debug="true" targetFramework="4.0" /&amp;gt;
    &amp;lt;caching&amp;gt;
      &amp;lt;outputCache enableOutputCache="true"/&amp;gt;
      &amp;lt;outputCacheSettings&amp;gt;
        &amp;lt;outputCacheProfiles&amp;gt;
          &amp;lt;!-- İstemci taraflı &amp;ouml;n bellekleme query string parametresi veya Header kısımlarını dikkate almaz. Bu nedenle varyByParam niteliğine none değerini atanmış ve varyByHeader niteliği kullanılmamıştır. Dikkat edileceği &amp;uuml;zere &amp;ouml;n belleklemenin istemci taraflı olacağı location niteliği ile belirlenmiştir.--&amp;gt;
          &amp;lt;add name="WallpaperCache" duration="120" varyByParam="none" location="Client"/&amp;gt;
        &amp;lt;/outputCacheProfiles&amp;gt;
      &amp;lt;/outputCacheSettings&amp;gt;
    &amp;lt;/caching&amp;gt;
  &amp;lt;/system.web&amp;gt;
&amp;lt;!-- Konfigurasyon dosyasının devamı --&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;OutputCacheProfiles&lt;/strong&gt; i&amp;ccedil;erisine eklenen &lt;strong&gt;WallpaperCache&lt;/strong&gt; profiline g&amp;ouml;re &lt;strong&gt;Cache&lt;/strong&gt; s&amp;uuml;resi &lt;strong&gt;120&lt;/strong&gt; saniyedir. Diğer taraftan istemci taraflı &amp;ouml;n bellekleme işlemlerinde &lt;strong&gt;Querystring &lt;/strong&gt;kullanımı bir fakt&amp;ouml;r olmadığından &lt;strong&gt;varyByParam&lt;/strong&gt; niteliğine &lt;strong&gt;none&lt;/strong&gt; değeri atanmalıdır.&amp;nbsp;Bu profilde belkide en &amp;ouml;nemli nokta &lt;strong&gt;location&lt;/strong&gt; niteliğinin değerinin &lt;strong&gt;Client&lt;/strong&gt; olarak belirlenmesidir. B&amp;ouml;ylece &amp;ouml;n bellekleme işleyişinin istemci taraflı yapılacağı tayin edilimiş olur.&lt;/p&gt;
&lt;p&gt;Tabi bu durumu incelemek i&amp;ccedil;in istemci tarafının da geliştirilmesi gerekmektedir. Nitekim istemci tarafına g&amp;ouml;nderilen cevabın &lt;strong&gt;Header&lt;/strong&gt; kısmında, &lt;strong&gt;Caching&lt;/strong&gt; ile ilgili bilgilerin bulunması gerekmektedir. Bu ama&amp;ccedil;la &amp;ccedil;ok basit olarak aşağıdaki kodlara sahip bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması yazdığımızı d&amp;uuml;ş&amp;uuml;nebiliriz &lt;em&gt;(&lt;strong&gt;HttpClient&lt;/strong&gt; ve diğer yardımcı tiplerin kullanımı s&amp;ouml;z konusu olduğundan &lt;strong&gt;REST Starter Kit'&lt;/strong&gt; in par&amp;ccedil;ası olan &lt;strong&gt;Microsoft.Http&lt;/strong&gt; ve &lt;strong&gt;Microsoft.Http.Extension assmebly'&lt;/strong&gt; larının referans edilmesi gerektiğini unutmayalım)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using Microsoft.Http;

namespace ClientApp
{
    class Program
    {
        static void Main(string[] args)
        {
            // HttpClient nesnesi url adresine g&amp;ouml;re oluşturulur.
            HttpClient client = new HttpClient("http://localhost:1000/");

            Send(client);

            Console.WriteLine("Kapatmak i&amp;ccedil;in bir tuşa basınız");
            Console.ReadLine();

        }
        static void Send(HttpClient client)
        {
            Console.WriteLine("\nAradığınız kelimeyi girin\n");
            string word = Console.ReadLine();
            // Wallpapers i&amp;ccedil;in gerekli request string oluşturulur. word bilgisi kullanıcı tarafından girilmektedir.
            string requestString = String.Format("Wallpapers/{0}", word);

            // Get metodundan yararlanılarak sunucu tarafına ilgili talep g&amp;ouml;nderilir
            using(HttpResponseMessage responseMessage = client.Get(requestString))
               {
                 // Sunucudan gelen cevap i&amp;ccedil;erisinde yer alan Cache bilgisi ve ayrıca HTTP Stat&amp;uuml; koduna bakılır
                Console.WriteLine("{0}\n{1}\n",responseMessage.Headers.CacheControl.MaxAge,responseMessage.StatusCode);
            
                // İ&amp;ccedil;erik okunur
               Console.WriteLine(responseMessage.Content.ReadAsString());
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İstemci uygulamadan kullanıcının girdiği kelimeye g&amp;ouml;re &lt;strong&gt;HTTP Get&lt;/strong&gt; formatında bir talebinin g&amp;ouml;nderilmesi sağlanmaktadır. Sunucu tarafından &amp;ccedil;ağırılan operasyona ait &amp;ouml;n bellekleme işleminin istemci bazlı olduğu, istemci tarafına g&amp;ouml;nderilen &lt;strong&gt;cevap(Response)&lt;/strong&gt; i&amp;ccedil;erisinden &amp;ouml;ğrenilebilir. Bu ama&amp;ccedil;la &amp;ouml;rnek olarak&amp;nbsp;&lt;strong&gt;HttpResponseMessage &lt;/strong&gt;nesnesinin &lt;strong&gt;Header.CacheControl &lt;/strong&gt;&amp;ouml;zelliği &amp;uuml;zerinden yakalanan &lt;strong&gt;MaxAge&lt;/strong&gt; değerine bakılmıştır. Bu değer dikkat edileceği &amp;uuml;zere sunucu &amp;uuml;zerinde belirtilen &lt;strong&gt;duration&lt;/strong&gt; s&amp;uuml;resinin &lt;strong&gt;Timespan&lt;/strong&gt; karşılığıdır&lt;em&gt;(&amp;ouml;rneğimize g&amp;ouml;re 2 dakika)&lt;/em&gt;.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg144_Runtime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabiki Caching &amp;ouml;zelliğini sunucu tarafında kapatırsak ki bunun i&amp;ccedil;in&lt;strong&gt; web.config&lt;/strong&gt; dosyasında ilgili &lt;strong&gt;cache profile'&lt;/strong&gt; in &lt;strong&gt;enabled&lt;/strong&gt; niteliğine &lt;strong&gt;false&lt;/strong&gt; değeri atamamız yeterlidir,&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;add name="WallpaperCache" duration="120" varyByParam="none" location="Client" enabled="false"/&amp;gt;&lt;/pre&gt;
&lt;p&gt;ve aynı &amp;ouml;rneği yeniden test edersek aşağıdaki sonu&amp;ccedil;lar ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg144_Runtime2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;ccedil;ok doğal olarak bir &amp;ouml;n bellekleme s&amp;uuml;resi olmayacaktır. &amp;Ouml;rneği &lt;strong&gt;Fiddler&lt;/strong&gt; gibi bir ara&amp;ccedil; yardımıyla incelediğimizde ise istemci tarafına d&amp;ouml;nen cevaba ait &lt;strong&gt;Cache&lt;/strong&gt; bilgisini daha detaylı bir şekilde g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg144_FiddlerResult.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF WebHttp Service'&lt;/strong&gt; ler ile ilişkili serimizde yer alan bir yazımızın daha sonuna geldik. Bu yazımızda istemci bazlı &amp;ouml;n bellekleme işlemleri i&amp;ccedil;in ne gibi hazırlıklar yapılması gerektiğini g&amp;ouml;rd&amp;uuml;k. En &amp;ouml;nemli noktanın &lt;strong&gt;web.config&lt;/strong&gt; dosyası i&amp;ccedil;erisinde belirtilen &lt;strong&gt;location&lt;/strong&gt; niteliği olduğunu &amp;ouml;zetleyebiliriz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f2%2fLesson7_RC.rar"&gt;Lesson7_RC.rar (192,46 kb)&lt;/a&gt; &lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 &lt;/strong&gt;&lt;strong&gt;Ultimate &lt;/strong&gt;&lt;strong&gt;Beta 2 S&amp;uuml;r&amp;uuml;m&amp;uuml;nde geliştirilmiş ancak RC s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde de test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-03-30 07:30:00</pubDate>
  <slug>WCF-WebHttp-Services-Client-Based-Caching</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-40</tag>
    <tag>webhttp-services</tag>
    <tag>restful</tag>
    <tag>non-soap</tag>
    <tag>wcf-webhttp-services</tag>
  </tags>
  <categories>
    <category>WCF Eco System</category>
    <category>WCF WebHttp Services</category>
  </categories>
</post>