<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net Core'da Bir WebSocket Macerası</title>
  <description>Web Sockets web uygulamalarında aynı anda çift yönlü haberleşmeye olanak sağlayan bir standart olarak karşımıza çıkmakta. Bu yazıda Asp.Net Core 2.0 tarafında Web Sockets kullanımına bakacağız.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/10/websockets_5.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Meşhur ve &amp;ouml;zlenen telefon markası Nokia'nın o başarılı sloganını hatırlıyor musunuz?, "Nokia, connecting people" :) İşte bug&amp;uuml;nk&amp;uuml; konumuz da o jeneriği aratmayacak t&amp;uuml;rden. "WebSockets, connecting applications."&lt;em&gt;(Burayı o adamın ses tonu ile zihninizde canlandırın derim)&lt;/em&gt; Evet berbat bir giriş oldu ama olsun. Gelelim konumuza.&lt;/p&gt;
&lt;p&gt;Web Sockets aynı anda &amp;ccedil;ift y&amp;ouml;nl&amp;uuml; haberleşmeye olanak sağlayan bir protokol olarak karşımıza &amp;ccedil;ıkmakta. HTTP'nin klasik Request/Response modelinden farklı &amp;ccedil;alışan bu model ile masa&amp;uuml;st&amp;uuml; uygulamalarının eş zamanlı olarak karşılıklı haberleşebilme yetenekleri web ortamına da taşınmış oluyor. B&amp;ouml;ylece akıllı telefonlardan, tabletlerden, masa&amp;uuml;st&amp;uuml; uygulamalarından, tarayıcılardan bir sunucu ile Web Socket haberleşmesi ger&amp;ccedil;eklenebiliyor. Bu iletişim de istemci ve sunucu birbirlerini beklemeden eş zamanlı olarak karşılılklı paket alışverişinde bulunmakta. Chat arabirimleri, Bot programları, borsa &amp;uuml;r&amp;uuml;nleri, ger&amp;ccedil;ek zamanlı oyunlar ve benzeri &amp;ouml;rneklerde Web Socket modeli kullanılabiliyor. Aslında TCP haberleşmesini web i&amp;ccedil;in &amp;ccedil;ift y&amp;ouml;nl&amp;uuml; iletişime d&amp;ouml;n&amp;uuml;şt&amp;uuml;ren bir model olduğunu da belirtebiliriz. En temelinde ise handshaking adı verilen bir kavrama dayanıyor. Sunucu, kendisine bağlı olan istemcileri ile senkronize kalıyor. Web Socket'lerin en &amp;ouml;nemli yanları ise ger&amp;ccedil;ek anlamda eşzamanlılık ve optimize edilmiş bir mesaj trafiği sunması.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;WebSockets protokol&amp;uuml; Internet Engineering Task Force tarafından &amp;ouml;nerilmektedir. Standarda ait detaylı bilgiler i&amp;ccedil;in &lt;a href="https://tools.ietf.org/html/rfc6455" target="_blank"&gt;IETF'un ilgili sayfasına&lt;/a&gt; bakabilirsiniz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Epey zamandır varlığından haberdar olduğumuz bu modelin Asp.Net tarafında daha da geliştirilmiş bir versiyonu var; SignalR. Ancak Asp.Net Core tarafına baktığımızda SignalR desteğinin hen&amp;uuml;z tam olarak gelmediğini g&amp;ouml;r&amp;uuml;yoruz&lt;em&gt;(En azından araştırmayı yaptığım tarih itibariyle durum b&amp;ouml;yleydi. Ger&amp;ccedil;i yazıyı yayınladığım tarih itibariyle desteği gelmiş olsa da sorun değil. Ben Web Sockets kullanımını merak ettiğim i&amp;ccedil;in yazıda ısrar ettim)&lt;/em&gt; Şuradaki &lt;a href="https://github.com/aspnet/SignalR" target="_blank"&gt;github adresinden&lt;/a&gt; Asp.Net Core tarafındaki SignalR gelişmeleri takip edilebilirsiniz. Diğer yandan 17 Eyl&amp;uuml;l tarihindeki haber g&amp;ouml;re &lt;a href="https://blogs.msdn.microsoft.com/webdev/2017/09/14/announcing-signalr-for-asp-net-core-2-0/" target="_blank"&gt;Alpha s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; de test edebilirsiniz&lt;/a&gt; ki ben de bir ara deneyeceğim.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bu arada WebSockets ile geliştirme yapmak i&amp;ccedil;in temel HTML ve Javascript bilgisi yeterlidir. Hatta Tutorials Point'te g&amp;uuml;zel bir eğitim seti de bulunuyor. İsterseniz platform bağımsız olarak &lt;a href="https://www.tutorialspoint.com/websockets/index.htm" target="_blank"&gt;bu adresten&lt;/a&gt; de &amp;ccedil;alışabilirsiniz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Neyse ki Asp.Net Core tarafında WebSockets desteği mevcut. Tabii SignalR bu işin nirvanası gibi duruyor ama ben Web Socket kullanımını merak etmekteyim. O zaman kolları sıvayalım ve yeni bir Asp.Net Core projesi oluşturarak işe koyulalım. Bakalım olayın &amp;ouml;z&amp;uuml;n&amp;uuml; anlayabilecek miyim?&lt;/p&gt;
&lt;h1&gt;Projenin Oluşturulması&lt;/h1&gt;
&lt;p&gt;&amp;Ouml;rneği her zamanki gibi şirket bilgisayarında geliştirmekteyim. Dolayısıyla Windows 7 tabanlı bir işletim sisteminde .Net Core 2.0 ortamı olduğunu ifade edebilirim. &amp;Ouml;nceki yazıda kurdurttuğum ortam. Terminalden aşağıdaki komutu vererek HelloWebSockets isimli projeyi oluşturarak başlayalım.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new web -o HelloWebSockets&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/websockets_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sıradaki operasyon Microsoft.AspNetCore.WebSockets paketinin aşağıdaki terminal komutu ile projeye eklenmesi. Bu sayede System.Net.WebSockets isim alanı altında yer alan tipleri kullanabileceğiz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet add HelloWebSockets.csproj package Microsoft.AspNetCore.WebSockets&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/websockets_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Kodlar&lt;/h1&gt;
&lt;p&gt;Artık gerekli kodları yazarak ilerleyebiliriz. İlk olarak Startup sınıfındaki Configure metoduyla uğraşacağız. Burada &amp;ccedil;alışma zamanına WebSockets kullanacağımızı bildireceğiz ve istemci ile sunucu arasındaki iletişimi a&amp;ccedil;ıp hareket eden&amp;nbsp;mesajların kontrol&amp;uuml;n&amp;uuml; sağlayacağız. Amacımız istemciden gelen mesajı yakalamak ve ona bir şeyler s&amp;ouml;ylemek. &amp;Ouml;rneğin bug&amp;uuml;nk&amp;uuml; şanslı numarasının ne olduğunu...&lt;/p&gt;
&lt;p&gt;Startup.cs&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Threading;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.AspNetCore.Builder;
using Microsoft.AspNetCore.Hosting;
using Microsoft.AspNetCore.Http;
using Microsoft.Extensions.DependencyInjection;
using System.Net.WebSockets;

namespace HelloWebSockets
{
    public class Startup
    {
        public void ConfigureServices(IServiceCollection services)
        {
        }

        public void Configure(IApplicationBuilder app, IHostingEnvironment env)
        {
            if (env.IsDevelopment())
            {
                app.UseDeveloperExceptionPage();
            }

            app.UseWebSockets();
            app.Use(async (ctx, nextMsg) =&amp;gt;
            {
                Console.WriteLine("Web Socket is listening");
                if (ctx.Request.Path == "/nokya")
                {
                    if (ctx.WebSockets.IsWebSocketRequest)
                    {
                        var wSocket = await ctx.WebSockets.AcceptWebSocketAsync();
                        await Talk(ctx, wSocket);
                    }
                    else
                    {
                        ctx.Response.StatusCode = 400;
                    }
                }
                else
                {
                    await nextMsg();
                }
            });

            app.UseFileServer();
        }

        private async Task Talk(HttpContext hContext, WebSocket wSocket)
        {
            var bag = new byte[1024];
            var result = await wSocket.ReceiveAsync(new ArraySegment&amp;lt;byte&amp;gt;(bag), CancellationToken.None);
            while (!result.CloseStatus.HasValue)
            {
                var incomingMessage = System.Text.Encoding.UTF8.GetString(bag, 0, result.Count);
                Console.WriteLine("\nClient says that '{0}'\n", incomingMessage);
                var rnd = new Random();
                var number = rnd.Next(1, 100);
                string message = string.Format("Your lucky Number is '{0}'. Don't remember that :)", number.ToString());
                byte[] outgoingMessage = System.Text.Encoding.UTF8.GetBytes(message);
                await wSocket.SendAsync(new ArraySegment&amp;lt;byte&amp;gt;(outgoingMessage, 0, outgoingMessage.Length), result.MessageType, result.EndOfMessage, CancellationToken.None);
                result = await wSocket.ReceiveAsync(new ArraySegment&amp;lt;byte&amp;gt;(bag), CancellationToken.None);
            }
            await wSocket.CloseAsync(result.CloseStatus.Value, result.CloseStatusDescription, CancellationToken.None);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Kodlar biraz korkutucu g&amp;ouml;r&amp;uuml;nebilir. Bir s&amp;uuml;r&amp;uuml; async, await g&amp;ouml;rmekteyiz. Asenkron bir şeyler oluyor. Kısaca &amp;uuml;zerinden ge&amp;ccedil;elim. İlk odaklanacağımız nokta Configure metodu. Web Sockets kullanacağımızı UseWebSockets fonksiyonu ile ortama bildiriyoruz. Takip eden satırda ise&amp;nbsp;istemcileri dinlemeye başlıyoruz.&amp;nbsp;Burası asenkron &amp;ccedil;alışan bir kod bloğu. İ&amp;ccedil;inde /nokya adresine gelen bir talep olup olmadığına bakılıyor. Eğer bu adrese gelen bir talep varsa ve gelen bu talep bir Web Sockets isteğiyse&lt;em&gt;(ki bunun ws:// protokol&amp;uuml; ile başlayan bir talep olması gerekiyor)&lt;/em&gt; bir socket nesnesi yakalıyor ve Talk isimli fonksiyonu &amp;ccedil;ağırıyoruz&lt;em&gt;(Yine asenkron olarak tabii)&lt;/em&gt; Eğer gelen istek /nokya adresine yapılmamışsa bir sonraki mesajı bekleyecek şekilde dinleme işlemine devam ediliyor.&amp;nbsp;&amp;Ouml;zetle o anki context'i ve mesajı yakalayıp bunun bir Web Sockets iletişimi olup olmadığının anlaşılması ve buna g&amp;ouml;re Talk operasyonunun &amp;ccedil;ağırılması s&amp;ouml;z konusu.&lt;/p&gt;
&lt;p&gt;Talk operasyonu i&amp;ccedil;erisinde istemciden gelen mesajın terminale basılması ve rastgele &amp;uuml;retilen bir sayı değerinin geri g&amp;ouml;nderilmesi i&amp;ccedil;in gerekli kodlar yer alıyor. İstemcinin g&amp;ouml;nderdiği mesajın yakalanması i&amp;ccedil;in ReceiveAsync isimli metoddan yararlanılmakta. Metodun ilk parametresi gelen i&amp;ccedil;eriği bir Byte dizisine alıyor. Eğer aradaki iletişim a&amp;ccedil;ıksa&lt;em&gt;(CloseStatus.HasValue ile bu kontrol edilmekte)&lt;/em&gt; bu byte i&amp;ccedil;eriğini string'e d&amp;ouml;n&amp;uuml;şt&amp;uuml;rmek yeterli. Bağlı olan istemciye soket &amp;uuml;zerinden mesaj g&amp;ouml;ndermek i&amp;ccedil;inse SendAsync metodundan yararlanılmakta. Trafik byte array'ler ile &amp;ccedil;alışıyor bu nedenle string operasyonları i&amp;ccedil;in UTF8 tabanlı Encoding mekanizmalarından yararlanılmakta.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Program.cs&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.AspNetCore;
using Microsoft.AspNetCore.Hosting;
using Microsoft.Extensions.Configuration;
using Microsoft.Extensions.Logging;

namespace HelloWebSockets
{
    public class Program
    {
        public static void Main(string[] args)
        {
            BuildWebHost(args).Run();
        }

        public static IWebHost BuildWebHost(string[] args) =&amp;gt;
            WebHost.CreateDefaultBuilder(args)
                .UseUrls("http://localhost:5556/") 
                .UseStartup&amp;lt;Startup&amp;gt;()
                .Build();
    }
}&lt;/pre&gt;
&lt;p&gt;Program.cs i&amp;ccedil;eriğinde &amp;ccedil;ok fazla m&amp;uuml;dahalemiz yok. Sadece kullanılacak&amp;nbsp;port bilgisini ayarlıyoruz. Buna g&amp;ouml;re http://localhost:5556&amp;nbsp;adresinden yayın yapacağız ve istemciler ws://localhost:5556/nokya adresini kullanarak Web Sockets temelli iletişimi ger&amp;ccedil;ekleştirebilecekler. &amp;Ouml;rnekte istemci olarak index.html sayfasını ele alacağız. wwwroot klas&amp;ouml;r&amp;uuml;nde konuşlandıracağımız sayfanın i&amp;ccedil;eriğini aşağıdaki gibi yazabiliriz.&lt;/p&gt;
&lt;p&gt;index.html&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;
&amp;lt;head&amp;gt;
    &amp;lt;title&amp;gt;Asp.Net Core ile Web Sockets Kullanımı&amp;lt;/title&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body&amp;gt;
&amp;lt;button id="btnConnect" type="submit"&amp;gt;Connect&amp;lt;/button&amp;gt;&amp;lt;br/&amp;gt;
Message : &amp;lt;input id="lblMessage" style="width:300;" /&amp;gt;&amp;lt;br/&amp;gt;
&amp;lt;button id="btnSendMessage" type="submit"&amp;gt;Send Message&amp;lt;/button&amp;gt;&amp;lt;br/&amp;gt;
&amp;lt;button id="btnDisconnect" type="submit"&amp;gt;Disconnect&amp;lt;/button&amp;gt;&amp;lt;br/&amp;gt;
&amp;lt;script&amp;gt;
    var btnConnect = document.getElementById("btnConnect");
    var btnSendMessage=document.getElementById("btnSendMessage");
	var lblMessage=document.getElementById("lblMessage");
	var btnDisconnect=document.getElementById("btnDisconnect");
	var socket;
	
	btnConnect.onclick = function() {
            socket = new WebSocket("ws://localhost:5556/nokya");
            socket.onopen = function (e) {				
                console.log("Connected",e);
            };
            socket.onclose = function (e) {
                console.log("Disconnected",e);
            };
            socket.onerror = function(e){
				console.error(e.data);
			};
            socket.onmessage = function (e) {
                console.log(e.data);
            };
		}
	
	btnSendMessage.onclick = function () {
            if (!socket || socket.readyState != WebSocket.OPEN) {
                console.error("Houston we have a problem! Socket not connected.");
            }
            var data = lblMessage.value;
            socket.send(data);
            console.log(data);
        }
		
	btnDisconnect.onclick = function () {
			if (!socket || socket.readyState != WebSocket.OPEN) {
				console.error("Houston we have a problem! Socket not connected.");
			}
			socket.close(1000, "Closing from Apollo 13");			
        }
	
&amp;lt;/script&amp;gt;
&amp;lt;/body&amp;gt;&lt;/pre&gt;
&lt;p&gt;Temel olarak bağlantıyı&amp;nbsp;a&amp;ccedil;mayı, text kutusuna yazılan i&amp;ccedil;eriği karşı tarafa g&amp;ouml;ndermeyi, aradaki iletişimi debug penceresinden izlemeyi ve son olarak da iletişimi başarılı şekilde sonlandırmayı hedefliyoruz. İ&amp;ccedil;erikteki en değerli kodlarımız&amp;nbsp;btnConnect butonuna basıldığında &amp;ccedil;alışıyor. Dikkat edileceği &amp;uuml;zere bir WebSocket nesnesi &amp;uuml;retilmekte. Adres olarak da ws://localhost:5556/nokya adresi kullanılıyor.&amp;nbsp;Adresin ws ile başladığına dikkat edelim. Oluşturulan WebSockets nesnesi i&amp;ccedil;in bazı olaylar tanımlanıyor. Bağlantı a&amp;ccedil;ıldığında, kapatıldığında, sunucudan mesaj alındığında veya bir hata oluştuğunda. Sunucuya mesaj g&amp;ouml;ndermek i&amp;ccedil;in WebSocket nesnesinin send fonksiyonundan yararlanılmakta.&lt;/p&gt;
&lt;h1&gt;Sonu&amp;ccedil;lar&lt;/h1&gt;
&lt;p&gt;&amp;Ouml;ncelikli olarak&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet run&lt;/pre&gt;
&lt;p&gt;komutuyla web sunucusunun &amp;ccedil;alıştırılması gerekiyor. Sonrasında herhangibir tarayıcıdan&lt;em&gt;(&amp;Ouml;rnekte Google Chrome kullanılmıştır)&lt;/em&gt;&amp;nbsp;http://localhost:5556/&amp;nbsp;adresine gidilmesi yeterli. &amp;Ouml;nce bağlanıp ardından mesaj g&amp;ouml;nderebiliriz. Sonrasında da iletişimi kapatmamız yeterli.&amp;nbsp;İşte benim elde ettiğim sonu&amp;ccedil;lar.&lt;/p&gt;
&lt;p&gt;Tarayıcı tarafı;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/websockets_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere aradaki haberleşme console ekranına d&amp;uuml;şmektedir&lt;em&gt;(Chrome'da debug penceresini a&amp;ccedil;mak i&amp;ccedil;in F12 tuşunu kullanabilirsiniz) &lt;/em&gt;Ayrıca "Don't remember" nedir yahu...&lt;/p&gt;
&lt;p&gt;Sunucu tarafı&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/websockets_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sunucu tarafında da istemciden gelen mesajların başarılı bir şekilde yakalandığı g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;Dilerseniz n sayıda istemciyi bağlayabilir ve herbirinin ayrı bir konuşma i&amp;ccedil;erisinde değerlendirildiğini de test edebilirsiniz. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/10/websockets_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Asp.Net Core&amp;nbsp;ile Web Sockets haberleşmesi yapmak olduk&amp;ccedil;a kolay. Bu &amp;ouml;rneği tabii diğer platformalarda da denemek lazım. İstemciyi &amp;ccedil;eşitlendirebiliriz. Bir mobil uygulama, desktop uygulaması veya farklı bir servis dahi olabilir. Hatta &amp;ouml;rnek daha da zenginleştirilebilir ve biraz oyunlaştırılabilir. Bir sayı tahmin oyununu bu şekilde yapmaya &amp;ccedil;alıştığınızı d&amp;uuml;ş&amp;uuml;n&amp;uuml;n. Hatta istemcinin ekranına soru seti g&amp;ouml;nderip, cevaplarına g&amp;ouml;re hikayeleştirdiğiniz bir senaryoyu işletebilirsiniz. Şu sıralar tabletten oynadığım My Cafe isimli oyunda restorana gelen m&amp;uuml;şterilerim ile aramda b&amp;ouml;yle hikayeleştirilmiş soru-cevap olayları s&amp;ouml;z konusu. Acaba Web Sockets mi kullanılmış merak etmekteyim. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&amp;nbsp;&lt;/p&gt;</content>
  <pubDate>2017-10-18 14:29:00</pubDate>
  <slug>asp-net-core-da-bir-websocket-macerasi</slug>
  <tags>
    <tag>aspnet-core</tag>
    <tag>websockets</tag>
    <tag>web-socket</tag>
    <tag>http</tag>
    <tag>tcp</tag>
    <tag>duplex-communication</tag>
    <tag>signalr</tag>
    <tag>ws</tag>
    <tag>async</tag>
    <tag>await</tag>
  </tags>
  <categories>
    <category>Asp.Net Core</category>
  </categories>
</post>