<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Kendi WebPart Kontrolümüzü Geliştirmek - 1</title>
  <description>Web uygulamalarında var olan bileşenlerin yetersiz kaldığı durumlarda kendi kontrollerimizi geliştirme yoluna gidebiliyoruz. Kendi kontrollerimizi geliştirirken seçebileceğimiz yollar bellidir. Var olan bir web bileşeninden türetme yolunu seçebiliriz (Inherited Controls).</description>
  <content>&lt;p&gt;Web uygulamalarında var olan bileşenlerin yetersiz kaldığı durumlarda kendi kontrollerimizi geliştirme yoluna gidebiliyoruz. Kendi kontrollerimizi geliştirirken se&amp;ccedil;ebileceğimiz yollar bellidir. Var olan bir web bileşeninden t&amp;uuml;retme yolunu se&amp;ccedil;ebiliriz &lt;strong&gt;(Inherited Controls)&lt;/strong&gt;. Bu durumda kontrol&amp;uuml;n Html &amp;ccedil;ıktısının ne olacağını bir başka deyişle Render işlemlerini &amp;ccedil;ok fazla d&amp;uuml;ş&amp;uuml;nmemize gerek kalmaz. Tek yapmamız gereken var olan &amp;uuml;yeleri ezmek (override) veya yeni &amp;uuml;yeler katmaktır.&lt;/p&gt;
&lt;p&gt;Bir diğer yol birden fazla kontrol&amp;uuml; i&amp;ccedil;eren komposit bir bileşen geliştirmektir&lt;strong&gt;(Composite Controls).&lt;/strong&gt; Bu tekniğe verilebilecek en g&amp;uuml;zel &amp;ouml;rnek kullanıcı web kontrolleridir &lt;strong&gt;(web user controls)&lt;/strong&gt;. &amp;Ouml;zel bileşen geliştirmenin belkide en zor se&amp;ccedil;eneği, kontrol&amp;uuml; sıfırdan yazmaktır. Bu durumda, ilgili bileşenin istemci tarayıcılarındaki Html &amp;ccedil;ıktısını d&amp;uuml;ş&amp;uuml;nmekle kalmayıp, &lt;strong&gt;ViewState&lt;/strong&gt;, &lt;strong&gt;Postback, Event Handling&lt;/strong&gt; gibi temel konularında g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınması ve d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmesi gerekir.&lt;/p&gt;
&lt;p&gt;Asp.Net 2.0 ile birlikte &lt;strong&gt;WebPart&lt;/strong&gt; adı verilen bir Framework gelmiştir. Bu Framework istersek kolay bir şekilde kişiselleştirilebilir &lt;strong&gt;(Personalizable)&lt;/strong&gt; web kontrolleri yazabilmemizede olanak sağlamaktadır. Aslında bahsettiğimiz &amp;ouml;zelleştirilmiş kontrollerin birer &lt;strong&gt;WebPart&lt;/strong&gt; tipi olduğunu s&amp;ouml;ylemek gerekir. Dolayısıyla, kendi WebPart bileşenlerimizi t&amp;uuml;retme yardımıyla kolay bir şekilde geliştirebilir ve kullanabiliriz. WebPart' lar sıfırdan yazılan bileşen kontrolleri ve web kullanıcı kontrollerine nazaran, WebPart Framework i&amp;ccedil;in tam destek sağlarlar. Bu da, kişiselleştirmenin kullanıldığı sayfalarda olduk&amp;ccedil;a &amp;ouml;nemli bir meziyettir. İşte biz bu makalemizde basit olarak kendi Web Part bileşenlerimizi nasıl geliştirebileceğimizi incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;Normal şartlar altında sayfada yer alan herhangiri &lt;strong&gt;Web Part Zone&lt;/strong&gt; i&amp;ccedil;erisine alınan her bileşen otomatik olarak Web Part muamalesi g&amp;ouml;r&amp;uuml;r. Lakin kendi Web Part bileşenlerimizi geliştirdiğimizde, daha &amp;ouml;ncedende belirttiğimiz gibi Web Part Framework' &amp;uuml; i&amp;ccedil;erisindeki &amp;ouml;zelliklerin ve fonksiyonelliklerin tamamını kullanabilme şansına sahip oluruz. &amp;Ouml;yleyse işe &lt;strong&gt;WebPart&lt;/strong&gt; tipinden t&amp;uuml;reyen bir sınıf yazmak ile başlamak lazım.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;NOT: &lt;/strong&gt;WebPart tipi &lt;strong&gt;abstract&lt;/strong&gt; bir sınıf olup, bir Web Part bileşeni i&amp;ccedil;in gerekli t&amp;uuml;m temel alt yapıyı sunmaktadır. &lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bildiğiniz gibi, Visual Studio 2005 i&amp;ccedil;erisindeki proje şablonlarından biriside, &lt;strong&gt;Web Control Library&lt;/strong&gt; se&amp;ccedil;eneğidir. Web Control Library, standart olarak &amp;ouml;rnek bir &amp;ouml;zel kontrol (Custom Control) sınıfı i&amp;ccedil;erir. Aynı zamanda Web ortamı i&amp;ccedil;in gerekli temel referanslarıda hazır olarak barındırır. &lt;em&gt;(&amp;Ouml;rneğin System.Web)&lt;/em&gt; Biz Web Part bileşenimizi b&amp;ouml;yle bir kontrol k&amp;uuml;t&amp;uuml;phanesi i&amp;ccedil;erisine dahil edersek, herhangibir web uygulamasında kolayca kullanabiliriz. Dahası, geliştirdiğimiz Web Part bileşenlerini &lt;strong&gt;Visual Studio ToolBox&lt;/strong&gt; i&amp;ccedil;erisinde ele alabiliriz. Bu da Web Part bileşenimizi bir kontrol olarak ToolBox i&amp;ccedil;erisinde tutabileceğimiz anlamına gelmektedir.&lt;/p&gt;
&lt;p&gt;Gelelim makalemizin &amp;ouml;rnek senaryosuna. Kendi Web Part kontrollerimizi geliştirmeyi &amp;ouml;ğrenirken, standart olarak ele alınan senaryo, &lt;strong&gt;RSS&lt;/strong&gt; bilgilerini tutan bir bileşenin yazılmasıdır. Bizde geleneği bozmayıp bu tip bir Web Part bileşenini nasıl yazabileceğimizi incelemeye &amp;ccedil;alışacağız. Ancak başlamadan &amp;ouml;nce RSS ile ilişkili olarak biraz bilgi vermekte fayda olacağı kanısındayım. G&amp;uuml;n&amp;uuml;m&amp;uuml;zde pek &amp;ccedil;ok web sitesi, g&amp;uuml;ncel olarak yayınlamak istedikleri bilgilerin, başkaları tarafından kolay bir şekilde ele alınabilmesi amacıyla, Xml tabanlı i&amp;ccedil;erikler sunarlar. RSS bu anlamda Xml verisini standardize etmektedir. B&amp;ouml;ylece, her RSS i&amp;ccedil;eriğinin aynı şemaya sahip olması sağlanmış olur. Bizde bu yaklaşımı kullanacağız. &amp;Ouml;zellikle .Net Framework, Xml &amp;uuml;zerinde son derece etkili y&amp;ouml;netimli tipler&lt;strong&gt; (managed types)&lt;/strong&gt; sunmaktadır. Bu tiplerden faydalanarak her hangibir RSS i&amp;ccedil;eriğini kolay bir şekilde ayrıştırabiliriz &lt;strong&gt;(parsing).&lt;/strong&gt; Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde C#Nedir? sitesinin &lt;a href="http://www.csharpnedir.com/Rss.xml"&gt; http://www.csharpnedir.com/Rss.xml&lt;/a&gt; adresinden yayınlanan RSS d&amp;ouml;k&amp;uuml;manının bir par&amp;ccedil;asını g&amp;ouml;rmektesiniz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk197_1.gif" alt="" width="588" height="389" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat ederseniz, rss isimli root element i&amp;ccedil;erisinde &lt;strong&gt;channel&lt;/strong&gt; isimli tek bir alt boğum &lt;strong&gt;(childe node)&lt;/strong&gt; vardır. Bu node i&amp;ccedil;erisinde RSS d&amp;ouml;k&amp;uuml;manın sahibi ile ilişkili &amp;ccedil;eşitli bilgiler yer alır. &amp;Ouml;rneğin, RSS konusunu anlatan başlık(title) ve a&amp;ccedil;ıklama(description) bilgisi, RSS sahibinin web adresi(link) gibi. Diğer taraftan &lt;strong&gt;item&lt;/strong&gt; elementleri i&amp;ccedil;erisindede RSS ile yayınlanmak istenen asıl i&amp;ccedil;erik yer alır. &amp;Ouml;zetle bu RSS d&amp;ouml;k&amp;uuml;manı ile &amp;ccedil;alışma zamanında C#Nedir? sitesinde yayınlanan son makalelerin listesini elde edebilir, bağlantıları kullanarak buralara ge&amp;ccedil;iş yapabiliriz. Eğer bu RSS d&amp;ouml;k&amp;uuml;manını internet &amp;uuml;zerinden talep edersek aşağıdakine benzer bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk197_3.gif" alt="" width="423" height="435" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İşte Web Part kontrol&amp;uuml;m&amp;uuml;z, kişi bazında herhangibir RSS bilgisini sunacak şekilde tasarlanacaktır. Burada RSS' in Url bilgisini ve hatta RSS' in sahibi ile ilgili kısa bir bilgiyi, kişi bazında ayrı ayrı saklayabiliriz. Gelin Web Part kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; yazarak kişiselleştirilebilir bir RSS okuyucunun nasıl yapılabileceğini g&amp;ouml;rmeye &amp;ccedil;alışalım. İlk olarak &lt;strong&gt;Web Control Library&lt;/strong&gt; projemize bir sınıf ekleyeceğiz. Sınıfımızın WebPart sınıfından t&amp;uuml;remiş olması gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;NOT : &lt;/strong&gt;Bir sınıfı WebPart abstract sınıfından t&amp;uuml;rettiğimizde, s&amp;ouml;z konusu yeni tip, Web Part Framework' &amp;uuml;n&amp;uuml; kullanabileceğimiz &amp;uuml;yelerede sahip olur. Bu &amp;uuml;yeler WebPart sınfınında t&amp;uuml;rediği &amp;ccedil;eşitli tipler i&amp;ccedil;erisinde toplanmaktadır. Aşağıdaki şekilde, geliştirdiğimiz &amp;ouml;rnek web part bileşeninin nesne hiyerarşisini g&amp;ouml;rebilirsiniz.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk197_2.gif" alt="" width="556" height="431" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak RssPart isimli bir sınıfı WebPart tipinden t&amp;uuml;reyecek şekilde aşağıdaki gibi tanımlayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[ToolboxData("&amp;lt;{0}:RssPart runat=server&amp;gt;&amp;lt;/{0}:RssPart&amp;gt;")]
public class RssPart : WebPart
{
}&lt;/pre&gt;
&lt;p&gt;Geliştirdiğimiz sınıf her ne kadar bir Web Part bileşeni olsada, sunucu taraflı &lt;strong&gt;(server side)&lt;/strong&gt; bir kontrold&amp;uuml;r. Bu nedenle, aspx dosyalarının kaynak kısmında birer takı&lt;strong&gt;(tag)&lt;/strong&gt; i&amp;ccedil;erisinde ele alınacaktır. &lt;strong&gt;ToolboxData&lt;/strong&gt; isimli niteliğin eklenmesinin sebebi de budur. Buna g&amp;ouml;re Web Part bileşenimizi herhangibir aspx sayfasına eklediğimizde aşağıdakine benzer bir element i&amp;ccedil;eriği ile karşılaşırız.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;cc1:RssPart ID="RssPart1" runat="server"/&amp;gt;&lt;/pre&gt;
&lt;p&gt;Burada cc1 &amp;ouml;n ekinin (prefix) nereden geldiğini merak ediyor olabilirsiniz. Aslında ToolBox' tan bir WebPart kontrol&amp;uuml;n&amp;uuml; sayfaya s&amp;uuml;r&amp;uuml;kleyip bıraktığımızda otomatik olarak sayfanın başına &lt;strong&gt;Register&lt;/strong&gt; direktifi eklenecektir. &lt;em&gt;(Bu ilk kontrol s&amp;uuml;r&amp;uuml;klenip bırakıldığında otomatik olarak oluşur) &lt;/em&gt;Bu direktif temel olarak, Asp.Net uygulamasında kullanılacak olan Web Part bileşenini i&amp;ccedil;eren &lt;strong&gt;sınıf k&amp;uuml;t&amp;uuml;phanesinin (Contol Library&lt;/strong&gt;) referans bilgisinide i&amp;ccedil;erecektir. Kısaca Register direktifimizinde aşağıdaki gibi olacağını s&amp;ouml;yleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Register Assembly="MyWebParts" Namespace="MyWebParts" TagPrefix="cc1" %&amp;gt;&lt;/pre&gt;
&lt;p&gt;Gelelim Web Part kontrol&amp;uuml;m&amp;uuml;z i&amp;ccedil;erisindeki &amp;uuml;yelere. Kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n RSS belgesine ait Url bilgisini ve kısa bir başlık bilgisini tutacağını varsayabiliriz. Bu bilgiler i&amp;ccedil;in yapacağımız normal şartlar altında birer &amp;ouml;zellik yazmak olacaktır. Lakin bu sefer &amp;ouml;zelliklerimizin, kişi bazında &amp;ouml;zelleştirilebilmesini istiyoruz. Bu nedenle &lt;strong&gt;Personalizable&lt;/strong&gt; niteliğini kullanmamız gerekiyor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private string _Url;
private string _RssOwner;

[WebBrowsable(true)] // PropertyGridEditorPart i&amp;ccedil;erisinde bu &amp;ouml;zelliğin g&amp;ouml;sterilip g&amp;ouml;sterilmeyeceğini belirtir.
[WebDescription("Verilen Url adresine g&amp;ouml;re Rss bilgisini okur")]
[Personalizable(PersonalizationScope.User)] // &amp;Ouml;zelliğin değerinin Membership tablolarında kullanıcı bazında tutulacağını belirtir.
[WebDisplayName("Rss Bilgisi Alınacak Url")] // PropertyGridEditorPart i&amp;ccedil;erisinde Url &amp;ouml;zelliği i&amp;ccedil;in g&amp;ouml;sterilecek bilgi
public string Url
{
&amp;nbsp;&amp;nbsp;&amp;nbsp; get { return _Url; }
&amp;nbsp;&amp;nbsp;&amp;nbsp; set { _Url = value; }
}

[WebBrowsable(true)]
[WebDescription("Rss sahibine ait bilgiyi i&amp;ccedil;erir")]
[Personalizable( PersonalizationScope.User)]
[WebDisplayName("Rss Yayımcısı")]
public string RssOwner
{
&amp;nbsp;&amp;nbsp;&amp;nbsp; set { _RssOwner = value; }
&amp;nbsp;&amp;nbsp;&amp;nbsp; get{return _RssOwner;}
}&lt;/pre&gt;
&lt;p&gt;Url ve RssOwner isimli &amp;ouml;zelliklerimiz, kişiselleştirilebilir &amp;uuml;yelerdir. &lt;strong&gt;Personalizable&lt;/strong&gt; niteliğine atanan &lt;strong&gt;PersonalizableScop.User&lt;/strong&gt; değeri sayesinde Url ve RssOwner &amp;ouml;zelliklerinin işaret ettikleri değerlerin, kişi bazında Membership API' si &amp;uuml;zerinden ilgili tablolarda tutulabileceği belirtilmektedir. &lt;strong&gt; WebBrowsable&lt;/strong&gt; niteliği ile, &amp;ouml;zelliğin bir &lt;strong&gt;PropertyGridEditorPart&lt;/strong&gt; bileşeni i&amp;ccedil;erisinde g&amp;ouml;sterilip g&amp;ouml;sterilmeyeceğine karar verilebilir. Buna g&amp;ouml;re Url ve RssOwner isimli &amp;ouml;zelliklerimizi, sayfayı ziyaret eden kullanıcılar isterlerse &lt;strong&gt;PropertyGridEditorPart&lt;/strong&gt; i&amp;ccedil;erisinden değiştirebilirler. &lt;strong&gt;WebDescription&lt;/strong&gt; niteliği(attribute), PropertyGridEditorPart i&amp;ccedil;erisinde g&amp;ouml;sterilecek olan &amp;ouml;zelliklerin &amp;uuml;zerlerine gelindiğinde kısa a&amp;ccedil;ıklama kutucukları g&amp;ouml;sterilmesini sağlar. Son olarak &lt;strong&gt;WebDisplayName&lt;/strong&gt; niteliği sayesinde, &amp;ouml;zelliklerin ProperyGridEditorPart i&amp;ccedil;erisinde hangi adlar ile sunulacağı belirtilmektedir.&lt;/p&gt;
&lt;p&gt;Kişi bazında tutulacak &amp;ouml;zelliklerimizide belirttikten sonra, Web Part kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n ekrana nasıl &amp;ccedil;izileceğini ayarlayabiliriz. Bildiğiniz gibi, her sunucu web bileşeni istemci tarafında Html &amp;ccedil;ıktıları haline getirilirler (Render işlemi). Burada da, belirtilen Url adresindeki RSS d&amp;ouml;k&amp;uuml;manını ayrıştırdıktan(parsing) sonra &amp;ouml;rnek olarak linkler halinde g&amp;ouml;stermek isteyebiliriz. Bu &amp;ccedil;ıktının d&amp;uuml;zenli bir formatta olmasını sağlamak i&amp;ccedil;inde Html tablolarına başvurabiliriz. Bir sunucu kontrol&amp;uuml;nde, Html &amp;ccedil;ıktısını oluşturmak i&amp;ccedil;in Render metodu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Diğer taratfan &lt;strong&gt; CreateChildControls&lt;/strong&gt; metoduna başvurup daha kolay bir bi&amp;ccedil;imde &amp;ccedil;ıktı &amp;uuml;retebiliriz. CreateChildControls metodunu ilerleyen makalelerimizde ele almaya &amp;ccedil;alışacağız. Şimdi dilerseniz, Web Part bileşenimiz i&amp;ccedil;in &lt;strong&gt; Render&lt;/strong&gt; metodunu ezelim&lt;strong&gt; (override)&lt;/strong&gt; ve Html &amp;ccedil;ıktısını, RSS i&amp;ccedil;eriğine g&amp;ouml;re hazırlayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected override void Render(HtmlTextWriter output)
{
&amp;nbsp;&amp;nbsp;&amp;nbsp; if (!String.IsNullOrEmpty(Url))
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; try
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; XmlReader reader = XmlReader.Create(Url);

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; DataSet ds = new DataSet();
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; ds.ReadXml(reader);

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; DataTable items = ds.Tables["item"];

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; #region Render Table

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Table elementi render edilmeden &amp;ouml;nce gerekli style attribute' ları ekleniyor
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.AddStyleAttribute(HtmlTextWriterStyle.BackgroundColor, "WhiteSmoke"); // Arka plan rengi
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.AddStyleAttribute(HtmlTextWriterStyle.Width, "100%"); // genişlik belirleniyor
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.RenderBeginTag(HtmlTextWriterTag.Table); // Table i&amp;ccedil;in a&amp;ccedil;ılış takısı

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.AddStyleAttribute(HtmlTextWriterStyle.BackgroundColor, "Gold");
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.RenderBeginTag(HtmlTextWriterTag.Tr); // Tr a&amp;ccedil;ılış takısı (satır)
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.RenderBeginTag(HtmlTextWriterTag.Td); // Td a&amp;ccedil;ılış takısı (h&amp;uuml;cre)
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.Write(ds.Tables["channel"].Rows[0]["title"].ToString()); // Td i&amp;ccedil;erisine Rss d&amp;ouml;k&amp;uuml;manından title bilgisi alınıyor
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.RenderEndTag(); // Td i&amp;ccedil;in kapanış takısı
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.RenderEndTag(); // Tr i&amp;ccedil;in kapanış takısı

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Rss d&amp;ouml;k&amp;uuml;manındaki her bir item i&amp;ccedil;in bir Tr (Table Row) ve i&amp;ccedil;erisinde bir Td (h&amp;uuml;cre) oluşturuluyor
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; for (int i = 0; i &amp;lt; items.Rows.Count; i++)
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.RenderBeginTag(HtmlTextWriterTag.Tr); // Tr a&amp;ccedil;ılış takısı
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.RenderBeginTag(HtmlTextWriterTag.Td); // Td a&amp;ccedil;lış takısı
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.AddAttribute(HtmlTextWriterAttribute.Href, items.Rows[i]["link"].ToString()); // href isimli attribute sonraki satırda a&amp;ccedil;ılacak olan A takısına ilave edilecek. Değeri ise link alanının i&amp;ccedil;eriği olacak
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.RenderBeginTag(HtmlTextWriterTag.A);// A takısı a&amp;ccedil;ılıyor
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.Write(items.Rows[i]["title"].ToString()); // A takısı i&amp;ccedil;ine title alanının değeri yazılıyor
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.RenderEndTag(); // A takısı kapatılıyor
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.RenderEndTag(); // Td takısı kapatılıyor
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.RenderEndTag(); // Tr takısı kapatılıyor
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.RenderEndTag();// Table' ın bitiş takısı &amp;lt;/table&amp;gt;
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; catch
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; output.Write("Adres &amp;ccedil;&amp;ouml;z&amp;uuml;mlenemedi");
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp; 
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; #endregion 
&amp;nbsp;&amp;nbsp;&amp;nbsp; }
}&lt;/pre&gt;
&lt;p&gt;Render metodunda, daha &amp;ouml;nceden Web sunucu kontrol&amp;uuml; yazmak ile ilişkili makalelerimizde kullandığımızdan biraz daha farklı bir yol tercih ettik. Html i&amp;ccedil;eriğini oluştururken, .Net i&amp;ccedil;erisinde yer alan kuvvetli tiplerden faydalanırsak hatalı Html takısı yazma olasılığımız daha da azalacak ve &amp;ouml;zellikle tarayıcı farklılıklarını bertaraf edeceğizdir. Bu nedenle Render metodu i&amp;ccedil;erisinde, &lt;strong&gt;HtmlTextWriter&lt;/strong&gt; sınıfına ait &lt;strong&gt;RenderBeginTag&lt;/strong&gt;, &lt;strong&gt; RenderEndTag&lt;/strong&gt;, &lt;strong&gt;AddAttribute&lt;/strong&gt;, &lt;strong&gt;AddStyleAttribute&lt;/strong&gt; gibi metodlardan yararlanılmıştır. &amp;Ouml;rneğimize g&amp;ouml;re i&amp;ccedil;eriğimiz bir Table elementi i&amp;ccedil;erisinde tek s&amp;uuml;tundan oluşan bir yapıda olacaktır. Bu ama&amp;ccedil;la bir table takısı a&amp;ccedil;mak i&amp;ccedil;in&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;output.RenderBeginTag(HtmlTextWriterTag.Table);&lt;/pre&gt;
&lt;p&gt;kod satırından faydalanılmıştır. Burada RenderBeginTag, bir takının oluşturulmasını sağlarken ne &amp;ccedil;eşit bir element olacağını parametre olarak g&amp;ouml;nderdiğimiz &lt;strong&gt;HtmlTextWriterTag&lt;/strong&gt; sabiti belirtmektedir. Html i&amp;ccedil;erisinde a&amp;ccedil;ılan her takının kapatılması gerektiğini biliyoruz. Bunu kod tarafında ifade ederkende yine HtmlTextWriter sınıfının &lt;strong&gt;RenderEndTag&lt;/strong&gt; metodundan faydalanmaktayız. Dikkat edilmesi gereken noktalardan biriside, Html elementlerine niteliklerin nasıl eklendiğidir. Dikkat ederseniz, bu ama&amp;ccedil;la &lt;strong&gt;AddStyleAttribute&lt;/strong&gt; ve &lt;strong&gt;AddAttribute&lt;/strong&gt; metodlarından yararlanılmıştır. &amp;Ouml;rneğin tablomuza arka plan rengi ve genişlik vermek i&amp;ccedil;in&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;output.AddStyleAttribute(HtmlTextWriterStyle.BackgroundColor, "WhiteSmoke");
output.AddStyleAttribute(HtmlTextWriterStyle.Width, "100%");&lt;/pre&gt;
&lt;p&gt;kod satırlarından faydalanılmaktadır. Hangi niteliğin ekleneceğini belirlemek i&amp;ccedil;in ise, &lt;strong&gt;HtmlTextWriterStyle&lt;/strong&gt; sabitinden yararlanılır. AddAttribute metoduda benzer işlevselliğe sahip olmakla birlikte desteklediği nitelik tipleri daha farklıdır.&lt;/p&gt;
&lt;p&gt;Gelelim metodun temel olarak yaptığı işe. İlk olarak kişiselleştirilebilen Url &amp;ouml;zelliğinden değer alınmakta ve &lt;strong&gt;XmlTextReader&lt;/strong&gt; nesnesi elde edilmektedir. Hataların &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek amacıyla ilk olarak Url &amp;ouml;zelliğinin değerinin boş olup olmadığına bakılır. Bunun haricinde internet bağlantısının kesik olması gibi hallerde, istenen Url' den RSS bilgileri &amp;ccedil;ekilemeyeceği i&amp;ccedil;in bir &amp;ccedil;alışma zamanı istisnası(runtime exception) alınacaktır. Bununda &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek i&amp;ccedil;in genel bir try-catch bloğu kullanılmıştır. Bu nedenle y&amp;uuml;kleme ve Render işlemlerini try bloğu i&amp;ccedil;erisinde ger&amp;ccedil;ekleştirmekteyiz.&lt;/p&gt;
&lt;p&gt;Burada Url adresinden elde edilen Xml i&amp;ccedil;eriğini okumak i&amp;ccedil;in farklı yollarda tercih edilebilir. &amp;Ouml;rneğin doğrudan XmlReader &amp;uuml;zerinden hareket edilebilir veya &lt;strong&gt;XPathNavigotor&lt;/strong&gt; tipinden faydalanılabilir ki bunlar performans a&amp;ccedil;ısından daha etkili yollardır. Biz kodu &amp;ccedil;ok fazla karmaşıklaştırmamak adına doğrudan &lt;strong&gt;DataSet&lt;/strong&gt; kontrol&amp;uuml;ne alıyor ve pahalı bir maliyetinde altına giriyoruz :) DataSet i&amp;ccedil;erisinde yer alan channel ve item tablolarından faydalanarak, RSS i&amp;ccedil;eriğindeki bilgilere erişebiliriz. &amp;Ouml;rneğin RSS sahibinin belirttiği başlığı (title), Html tablomuzun ilk satırındaki ilk h&amp;uuml;creye alıyoruz. Her bir item elementinin belirttiği, başlık ve adres bilgilerini ise sırasıyla title ve link elementlerinden alıp bir &lt;strong&gt;a href &lt;/strong&gt;elementi i&amp;ccedil;erisinde g&amp;ouml;steriyoruz. Bildiğiniz gibi a href elementi bir link oluşturulmasını sağlamaktadır.&lt;/p&gt;
&lt;p&gt;Web Part kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n, &lt;strong&gt;WebPart&lt;/strong&gt; sınıfından gelen pek &amp;ccedil;ok &amp;ouml;zelliğinide istersek ezebiliriz (override). &amp;Ouml;rneğin, Web Part bileşenimizin başlık bilgisi(title), imge bilgisi (title icon image) gibi değerlerini değiştirmek isteyebiliriz. Lakin bu tip &amp;uuml;yelerin değerlerinin kontrol&amp;uuml;n Html &amp;ccedil;ıktısının &amp;uuml;retilmesinden &amp;ouml;nce atanması gerekir. Bu ama&amp;ccedil;la yapıcı metoddan, &amp;ouml;zelliğin set bloğundan yada kontrole ait PreInit olay metodundan faydalanabiliriz. Geliştirdiğimiz &amp;ouml;rnekte biz yapıcı metod ve &amp;ouml;zellik(property) kullanmayı tercih edeceğiz. Bu ama&amp;ccedil;la sınıfımıza aşağıdaki &amp;uuml;yeleri eklememiz yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public override string Title
{
&amp;nbsp;&amp;nbsp;&amp;nbsp; get
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; return _RssOwner;
&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp; set
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; _RssOwner= value;
&amp;nbsp;&amp;nbsp;&amp;nbsp; }
}

public RssPart()
{
&amp;nbsp;&amp;nbsp;&amp;nbsp; TitleIconImageUrl = "Bilgi.gif"; 
}&lt;/pre&gt;
&lt;p&gt;Yukarıdaki kod par&amp;ccedil;asında dikkat ederseniz, WebPart sınıfında yer alan Title &amp;ouml;zelliği ezilmektedir ve kullanıcı tarafından kişiselleştirilebilen RssOwner &amp;ouml;zelliğinin kullandığı _RssOwner alanının değerini işaret etmektedir. Diğer taraftan, Web Part bileşenimizde hemen başlık kısmının yanında sembolik bir imge g&amp;ouml;stermek amacıyla yapıcı metod(constructor) i&amp;ccedil;erisinde &lt;strong&gt; TitleIconImageUrl&lt;/strong&gt; &amp;ouml;zelliğine bir değer ataması yapılmıştır. &amp;Ouml;rnek bir Asp.Net sayfasında Web Part bileşenimizi kullandığımızda tasarım zamanında iken, aşağıdakine benzer bir g&amp;ouml;r&amp;uuml;nt&amp;uuml; ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk197_5.gif" alt="" width="164" height="128" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada yer alan Bilgi.gif isimli resim, Web Control Library i&amp;ccedil;erisinde yer almaktadır ve herhangibir Asp.Net projesinde ilgili Web Part bileşeni kullandığında otomatik olarak root klas&amp;ouml;r i&amp;ccedil;erisine taşınacaktır. Bir başka deyişle eklenen ilk kontrol ile birlikte gelen web kontrol k&amp;uuml;t&amp;uuml;phanesi referansı, beraberinde kaynak olarak bu resim dosyasınıda hedef web uygulaması i&amp;ccedil;erisine taşıyacaktır. Yapılan bu son ekelemeler ile birlikte Web Part bileşenimizin yeni hali aşağıdaki sınıf diagramında g&amp;ouml;sterildiği gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk197_4.gif" alt="" width="276" height="346" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Artık Web Part bileşenimizi bu haliyle test edebiliriz. Kişiselleştirmenin tam olarak etkilerini g&amp;ouml;rebilmek i&amp;ccedil;in, bileşenimizi &lt;strong&gt;Membership&lt;/strong&gt; ayarları yapılmış &amp;ouml;rnek bir Asp.Net Web uygulaması &amp;uuml;zerinden test etmekte fayda olacaktır. Testleri ger&amp;ccedil;ekleştirmek i&amp;ccedil;in ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdaki gibi olan bir web sayfasından yararlanabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk197_6.gif" alt="" width="261" height="495" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Unutulmamalıdır ki, geliştirdiğimiz Web Part bileşeninin, Web Part Framework &amp;ouml;zelliklerini etkin bir şekilde kullanabilmesi i&amp;ccedil;in bir &lt;strong&gt;Web Part Zone&lt;/strong&gt; i&amp;ccedil;erisinde yer alması gerekir. Bu nedenle, RssPart isimli Web Part bileşenimizi zoneRss isimli bir WebPartZone kontrol&amp;uuml; i&amp;ccedil;erisinde ele alıyoruz. Diğer taraftan, Web Part kontrol&amp;uuml;m&amp;uuml;z i&amp;ccedil;erisinde yer alan Url ve RssOwner gibi &amp;ccedil;alışma zamanında kişiselleştirilebilir &amp;ouml;zelliklerini ele alabilmek i&amp;ccedil;in bir&lt;strong&gt; Editor Zone&lt;/strong&gt; kontrol&amp;uuml;m&amp;uuml;zde yer almaktadır. &amp;Ouml;rneğimizde sadece edit&amp;ouml;r kısmını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alacağımızdan, sayfanın Page_Load olay metodu i&amp;ccedil;erisinde &lt;strong&gt;WebPartManager&lt;/strong&gt; bileşenimizin &lt;strong&gt;DisplayMode&lt;/strong&gt; &amp;ouml;zelliği aşağıdaki gibi &lt;strong&gt;EditDisplayMode&lt;/strong&gt; olarak ayarlanmıştır. Ger&amp;ccedil;ek bir projede elbetteki kullanıcının diğer modlarıda se&amp;ccedil;ebileceği şekilde kod yazmak gerekir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;wpmYonetici.DisplayMode = WebPartManager.EditDisplayMode;&lt;/pre&gt;
&lt;p&gt;Sonu&amp;ccedil; olarak uygulamamızı &amp;ccedil;alıştırdığımızda, aşağıdaki Flash animasyonunda yer alana benzer bir sonu&amp;ccedil; ile karşılaşırız.&lt;em&gt;(Flash dosyasının boyutu 380 Kb tır. Bu nedenle y&amp;uuml;klenmesi zaman alabilir.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;object id="obj1" width="601" height="581" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
			&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/mk197_Video.swf" /&gt;
			&lt;param name="quality" value="High" /&gt;
			&lt;embed src="http://www.buraksenyurt.com/makale/images/mk197_Video.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" type="application/x-shockwave-flash" name="obj1" width="601" height="581" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;Dikkat ederseniz, iki ayrı kullanıcı i&amp;ccedil;in iki ayrı RSS bilgisi ele alınabilmektedir. Burak isimli kullanıcı kendisi i&amp;ccedil;in Msdn' e ait RSS i&amp;ccedil;eriğini tutarken, Melike isimli kullanıcıda C#Nedir? sitesine ait RSS bilgisini ele alabilmektedir. Bu bilgilerin arka tarafta nereye yazıldığını kontrol etmek istersek, &lt;strong&gt; Membership&lt;/strong&gt; bilgilerinin tutulduğu veritabanında &lt;em&gt;(ki &amp;ouml;rneğimizde local AspNetDb.mdf dosyası kullanılmaktadır. Bir başka deyişle &amp;uuml;yelik bilgileri web uygulamasın ait App_Data klas&amp;ouml;r&amp;uuml;nde yer alan AspNetDb.mdf veritabanı i&amp;ccedil;erisinde saklanmaktadır.)&lt;/em&gt; yer alan &lt;strong&gt; AspNet_PersonalizationPerUser&lt;/strong&gt; tablosuna bakmamız yeterli olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk197_7.gif" alt="" width="564" height="103" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Kendi Web Part bileşenlerimizi geliştirirken başka &amp;uuml;st sınıf &amp;ouml;zelliklerini ezebilir ve istediğimiz şekilde &amp;ccedil;alışmalarını sağlayabiliriz. Aynı zamanda, bir Web Part bileşenine &amp;ccedil;alışma zamanında ele alacağı yeni fiili aksiyonlar &lt;strong&gt;(verb)&lt;/strong&gt; ekleyebiliriz. Bu ve benzeri diğer konuları ilerleyen makalelerimizde ele almaya &amp;ccedil;alışacacağız. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalemizde basit olarak kendi Web Part bileşenlerimizi nasıl yazabileceğimizi incelemeye &amp;ccedil;alıştık. Bunun i&amp;ccedil;in,&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; tanımlayacak olan sınıfı WebPart isimli abstract sınıftan t&amp;uuml;retmemiz gerektiğini,&lt;/li&gt;
&lt;li&gt;i&amp;ccedil;eride kullanıcı bazında kişiselleştirme yapacağımız &amp;ouml;zellikler i&amp;ccedil;in Personalizable niteliğini (attribute) kullanmamız gerektiğini,&lt;/li&gt;
&lt;li&gt;kontrol&amp;uuml;n kişiselleştirilebilir &amp;ouml;zelliklerinin &amp;ccedil;alışma zamanında ele alınması i&amp;ccedil;in PropertyGridEditorPart kullanmamız gerektiğini,&lt;/li&gt;
&lt;li&gt;&amp;ouml;zelliklerin PropertyGridEditorPart i&amp;ccedil;erisinde g&amp;ouml;z&amp;uuml;kmesi i&amp;ccedil;in WebBrowsable niteliğinin kullanılması gerektiğini,&lt;/li&gt;
&lt;li&gt;istersek var olan Web Part &amp;ouml;zelliklerini ezerek değiştirebileceğimizi,&lt;/li&gt;
&lt;li&gt;her zaman olduğu gibi kontrol&amp;uuml;n Html &amp;ccedil;ıktısını manuel olarak d&amp;uuml;ş&amp;uuml;nememiz ve yazmamız gerektiğini,&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;ouml;ğrendik. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/CustomWebParts.rar"&gt;&amp;Ouml;rnek Uygulama İ&amp;ccedil;in Tıklayınız.&lt;/a&gt; &lt;em&gt;(Dosya boyutunun k&amp;uuml;&amp;ccedil;&amp;uuml;lmesi i&amp;ccedil;in, App_Data klas&amp;ouml;r&amp;uuml;ne atılan Aspnetdb.mdf dosyası silinmiştir. Test ederken burada bir AspNetdb.mdf dosyası oluşturmanı gerekecektir. Bunun i&amp;ccedil;in Asp.Net Web Site Administration Tool' dan faydalanabilirsiniz.)&lt;/em&gt;&lt;/p&gt;</content>
  <pubDate>2007-03-28 11:47:00</pubDate>
  <slug>Kendi-WebPart-Kontrolumuzu-Gelistirmek-1</slug>
  <tags>
    <tag>aspnet-20</tag>
  </tags>
  <categories>
    <category>Asp.Net 2.0</category>
  </categories>
</post>