<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>GoLang - Interface Kavramı</title>
  <description>GO dilinde metod şablonlarının koleksiyonunu tutmak için kullanılan tiptir. Burada iki ayrı nokta vardır. Birincisi gövdesi olmayan metod tanımlamalarını içermesi, ikincisi ise kendisinin bir tip olmasıdır.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/02/margaret_hamilton.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;enlerde bilgisayarımın başında oturmuş sıkılmakla meşguld&amp;uuml;m. Her ne kadar bloğumu zinde tutmaya &amp;ccedil;alışsam da arada sırada b&amp;ouml;yle durağan d&amp;ouml;nemlere de denk geliyorum. K&amp;uuml;&amp;ccedil;&amp;uuml;k tatiller diyelim. Derken enteresan bir Tweet yakaladım. Apollo 11'in Command ve Lunar mod&amp;uuml;llerine ait Assembler kodları github &amp;uuml;zerinden yayına a&amp;ccedil;ılmış. &lt;a href="https://github.com/chrislgarry/Apollo-11" target="_blank"&gt;Şu adresten bakabilirsiniz&lt;/a&gt;.&lt;/p&gt;
&lt;p&gt;Yandaki fotoğrafta yer alan kadınsa Apollo 11 programının yazılım m&amp;uuml;hendisliği direkt&amp;ouml;r&amp;uuml; Margaret Hamilton. Yanında durduğu print &amp;ccedil;ıktısınsa s&amp;ouml;z&amp;uuml; ge&amp;ccedil;en Assembler kodlarına ait olduğu ifade ediliyor. MIT talebeleri bu print &amp;ccedil;ıktılarını &amp;uuml;şenmeyip github'da bakılabilir hale getirmişler. Konu hakkında detaylı bir makaleye de &lt;a href="https://qz.com/726338/the-code-that-took-america-to-the-moon-was-just-published-to-github-and-its-like-a-1960s-time-capsule/" target="_blank"&gt;şu adresten ulaşabilirsiniz&lt;/a&gt;.&lt;/p&gt;
&lt;p&gt;Yazıyı okuduktan ve &amp;Uuml;niversitede ders olarak g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m ve orada bıraktığım Assembler kodlarına baktıktan sonra g&amp;ouml;z&amp;uuml;n&amp;uuml; seveyim senin C#, Ruby, Go ve Python dedim. Sonrasında bu senenin planında yer alan Gopher olma &amp;ccedil;alışmalarıma devam edeyim dedim. Haydi başlayalım.&lt;/p&gt;
&lt;p&gt;Interface&amp;nbsp;metod şablonlarının koleksiyonunu tutmak i&amp;ccedil;in kullanılan bir veri t&amp;uuml;r&amp;uuml;d&amp;uuml;r. Burada iki &amp;ouml;nemli&amp;nbsp;nokta vardır. Birincisi g&amp;ouml;vdesi olmayan metod tanımlamalarını i&amp;ccedil;ermesi, ikincisi ise kendisinin bir veri t&amp;uuml;r&amp;uuml; olmasıdır. Normalde .Net tarafındaki interface kavramını d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde nesne y&amp;ouml;nelimli programlama dillerinin temel &amp;ouml;zelliklerinden olan &amp;ccedil;ok bi&amp;ccedil;imlilik&lt;em&gt;(Polymorphysm)&lt;/em&gt; ve kalıtımı&lt;em&gt;(Inheritance)&lt;/em&gt;&amp;nbsp;destekleyen bir tip olarak kullanıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bu a&amp;ccedil;ıdan bakıldığında&amp;nbsp;bir aray&amp;uuml;z i&amp;ccedil;erisinde onu uygulayan diğer tiplerin sahip olması gereken &amp;ouml;zelliklerin ve yapması&amp;nbsp;gereken aksiyonların tanımlanması s&amp;ouml;z konusudur. Ancak Go, nesne y&amp;ouml;nelimli bir dil değildir ve interface onun tip sisteminin &amp;ouml;nemli bir karakteristiğini yansıtmaktadır: Bir tipin hangi verilere sahip olması gerektiğinden ziyade hangi aksiyonları icra etmesi gerektiğinin soyutlanması. Bu yazımızda interface tipinin kullanımını basit&amp;ccedil;e ele almaya &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;h1&gt;Hello World&lt;/h1&gt;
&lt;p&gt;Aşağıdaki kod par&amp;ccedil;ası ile&amp;nbsp;işe başlayalım.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	)
	
func main(){
	actors:=[]Actor{Tank{"T-80",100},Player{"Gun Ball"}}
	for _,a:=range actors{
		a.SaySomething("hello")
		a.Move("left")
	}
}

type Actor interface{
	Move(direction string)
	SaySomething(speach string)
}

type Tank struct{
	model string
	power int
}
func(t Tank) SaySomething(s string){
	fmt.Printf("'%s' says : %s\n",t.model,s)
}
func(t Tank) Move(d string){
	fmt.Printf("'%s' move to %s\n",t.model,d)
}

type Player struct{
	name string
}
func(p Player) Move(d string){
	fmt.Printf("'%s' move to %s\n",p.name,d)
}
func(p Player) SaySomething(s string){
	fmt.Printf("'%s' says %s\n",p.name,s)
}&lt;/pre&gt;
&lt;p&gt;Kodun &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/interfaces_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekte bir oyun sahnesindeki &amp;ccedil;eşitli akt&amp;ouml;rleri tanımlayan iki struct ve bir interface tipi yer almaktadır. Actor tipinde iki fonksiyon tanımına yer veriyoruz. Tank ve Player struct'larında kendilerine &amp;ouml;zg&amp;uuml; bir ka&amp;ccedil; alan bulunuyor. Dikkat edilmesi gereken nokta bu iki struct i&amp;ccedil;in Actor interface'in de belirtilen metodların yazılmış olması. S&amp;ouml;zdizimi olarak metodların&amp;nbsp;ilk parametreleri uygulanacakları tipe ait. for d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile actors isimli slice elemanlarında dolaşıyor ve her biri i&amp;ccedil;in Move ile SaySomething metodlarını &amp;ccedil;ağırıyoruz.&amp;nbsp;Aslında kullanılan slice i&amp;ccedil;erisindeki elemanlarda dolaşırken Go&amp;nbsp;&amp;ccedil;alışma zamanı motoru interface{} değişkenine d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemini otomatik olarak ger&amp;ccedil;ekleştirmekte. Fakat bu durum biraz sonra g&amp;ouml;receğimiz vakka da biraz daha ilgin&amp;ccedil;leşecek.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Aslında interface kullanımında Duck Typing s&amp;ouml;z konusudur. Nasıl bir şey olduğunu &amp;ouml;ğrenmek isterseniz &lt;a href="/post/duck-typing-nedir" target="_blank"&gt;şu yazıya g&amp;ouml;z &lt;/a&gt;atabilirsiniz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;interface{} Tipi&lt;/h1&gt;
&lt;p&gt;Go dilinde hi&amp;ccedil; bir fonksiyon tanımı bulundurmayan interface isimli bir tip de mevcuttur. Bu tip fonksiyon parametresi olarak kullanılabilir. B&amp;ouml;yle bir durumda fonksiyona herhangibir tip atanabilir. Go &amp;ccedil;alışma zamanı burada bir d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi ger&amp;ccedil;ekleştirir. Gelen değişken interface tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;l&amp;uuml;r.&amp;nbsp;Şimdi aşağıdaki gibi bir kod yazdığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;func main(){
	actors:=[]Actor{Tank{"T-80",100},Player{"Gun Ball"}}
	DoIt(actors)
}

func DoIt(objects []interface{}){	
	for _,obj:=range objects{		
		obj.Move("Forward")
		obj.SaySomething("kuniciva")		
    }	
}&lt;/pre&gt;
&lt;p&gt;Burada actors isimli slice i&amp;ccedil;eriğini DoIt fonksiyonuna interface dizisi olarak ge&amp;ccedil;iyoruz. DoIt fonksiyonunda t&amp;uuml;m nesneleri dolaşıyor ve Move ile SaySomething metodlarını sırasıyla &amp;ccedil;ağırıyoruz. Bir &amp;ouml;nceki kodda yer alan for d&amp;ouml;ng&amp;uuml;s&amp;uuml; &amp;ccedil;alıştığına g&amp;ouml;re bu fonksiyonun da &amp;ccedil;alışması gerekiyor. Oysaki Go &amp;ccedil;alışma zamanı bizi d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işleminin yapılamadığı konusunda uyaracak.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/interfaces_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi kodun doğru halini yazalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;func main(){
	actors:=[]Actor{Tank{"T-80",100},Player{"Gun Ball"}}
	values:=[]interface{}{actors[0],actors[1]}
	DoIt(values)
}

func DoIt(objects []interface{}){	
	for _,obj:=range objects{
		if act, ok := obj.(Actor); ok {
			act.Move("Forward")
			act.SaySomething("kuniciva")
		}
    }	
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncelikle values isimli bir slice tanımı var ve interface{} tipinden oluşacağını belirtiyoruz. Elemanları ise actors'den geliyor. Bu sayede DoIt fonksiyonuna&amp;nbsp;actors i&amp;ccedil;eriğini interface{} tipi olarak atayabiliriz. for d&amp;ouml;ng&amp;uuml;s&amp;uuml; i&amp;ccedil;erisinde obj.(Actor) şeklinde bir &amp;ccedil;ağrım var. Bu &amp;ccedil;ağrım o anki interface{} tipinin bir Actor olup olmadığını kontrol etmekte. Eğer ok cevabını alırsak Move ve SaySomething metodlarını &amp;ccedil;ağırabiliriz. İşte &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/interfaces_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi &amp;ouml;rneğimizi biraz daha geliştirelim. Actor tiplerinin yanına &amp;ouml;rneğin int tipinden bir değişken daha koyalım ve onun i&amp;ccedil;in geliştireceğimiz bir metodu kullanmaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	)
	
func main(){
	actors:=[]Actor{Tank{"T-80",100},Player{"Gun Ball"}}
	no:=Number(100)
	utl:=Utility(no)	
	values:=[]interface{}{actors[0],actors[1],utl}
	DoIt(values)
}

func DoIt(objects []interface{}){	
	for _,obj:=range objects{		
		switch t := obj.(type) {
			case Actor:
				t.Move("Forward")
				t.SaySomething("kuniciva")
			case Number:
				fmt.Println(t.IsEven())
		}		
    }	
}
type Utility interface{
	IsEven() bool
}
type Number int32

func(n Number) IsEven() bool{
	if int(n)%2==0{
		return true
	}else{
		return false
	}
}&lt;/pre&gt;
&lt;p&gt;IsEven metodu geriye bool değer d&amp;ouml;nd&amp;uuml;ren bir metoddur ve Utility interface tipi i&amp;ccedil;erisinde şablon olarak tanımlanmıştır. Bu metodu int32'den inşa edilen Number isimli yeni bir tipe uygulamaktayız. Yaptığı tek şey sayının &amp;ccedil;ift olup olmadığını true veya false olarak d&amp;ouml;nd&amp;uuml;rmek.&amp;nbsp;DoIt fonksiyonunun kullanımı sırasında utl isimli bir değişkenin eklendiği g&amp;ouml;zden ka&amp;ccedil;mamalıdır. Aslında burada Number tipinin Utility interface{} tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmesi s&amp;ouml;z konusudur. Sonrasında DoIt fonksiyonuna parametre olarak ge&amp;ccedil;ilir. DoIt fonksiyonu i&amp;ccedil;erisinde bu kez bir switch bloğuna yer verilmiştir. switch bloğunda yaptığımız şey tipe bakıp akışı y&amp;ouml;nlendirmekten ibaret. Gelen tip bir Actor ise Move ve SaySomething metodları &amp;ccedil;ağırılır. Gelen tip Number ise de IsEven. Kodun &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/interfaces_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;interface veri tipi esasında iki par&amp;ccedil;adan oluşur. Par&amp;ccedil;alardan biri&amp;nbsp;veriyi tutan değişkeni işaret eden bir pointer barındırır. Diğer&amp;nbsp;par&amp;ccedil;aysa&amp;nbsp;interface'in bu ilişkili tip &amp;uuml;zerinden &amp;ccedil;ağırabileceği fonksiyon bilgisini barındıran veri tablosunu işaret eder.&lt;/p&gt;
&lt;h1&gt;Pointer Kullanımı&lt;/h1&gt;
&lt;p&gt;interface i&amp;ccedil;inde tanımlı metodları ilgili tipler i&amp;ccedil;in yazarken parametrelerinde Pointer da kullanabiliriz. İlk yazdığımız &amp;ouml;rneği g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alırsak metod parametrelerinde Tank ve Player tipleri i&amp;ccedil;in * operat&amp;ouml;r&amp;uuml; ile bu struct'lara ait nesne &amp;ouml;rneklerini interface tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z yerde &amp;amp; operat&amp;ouml;r&amp;uuml;n&amp;uuml; kullanmamız yeterlidir&lt;em&gt;(*'ın &amp;amp; kullanımı halinde zorunlu olmadığını da biraz sonra g&amp;ouml;receğiz)&lt;/em&gt;&amp;nbsp;İlk &amp;ouml;rnek kodumuzu aşağıdaki hale getirerek ilerleyelim.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	)
	
func main(){
	actors:=[]Actor{&amp;amp;Tank{"T-80",100},&amp;amp;Player{"Gun Ball"}}
	for _,a:=range actors{
		a.SaySomething("hello")
		a.Move("left")
	}
}

type Actor interface{
	Move(direction string)
	SaySomething(speach string)
}

type Tank struct{
	model string
	power int
}
func(t *Tank) SaySomething(s string){
	fmt.Printf("'%s' says : %s\n",t.model,s)
}
func(t *Tank) Move(d string){
	fmt.Printf("'%s' move to %s\n",t.model,d)
}

type Player struct{
	name string
}
func(p *Player) Move(d string){
	fmt.Printf("'%s' move to %s\n",p.name,d)
}
func(p *Player) SaySomething(s string){
	fmt.Printf("'%s' says %s\n",p.name,s)
}&lt;/pre&gt;
&lt;p&gt;Move ve SaySomething metodlarında *Tank ve * Player şeklinde Pointer kabul eden parametreler kullanıyoruz. Ayrıca actors isimli slice i&amp;ccedil;erisindeki atamalarda&amp;nbsp;&amp;amp; operat&amp;ouml;r&amp;uuml;nde yararlandık. Bu sayede adres bilgisini metodlara g&amp;ouml;ndermiş oluyoruz. &amp;Ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/gointerfaces_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Eğer &amp;amp; operat&amp;ouml;r&amp;uuml;n&amp;uuml; kullanmazsak &amp;ccedil;alışma zamanında hata mesajı alırız.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/interfaces_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu son derece doğaldır nitekim Move ve SaySomething metodları birer Pointer beklemektedir. Ancak biz değer g&amp;ouml;ndermeye &amp;ccedil;alışıyoruz. Şimdi de tam tersi durumu ele alalım. Yani metod şablonlarında Pointer kullanımından vazge&amp;ccedil;ip sadece slice i&amp;ccedil;erisinde &amp;amp; ile adres ataması ger&amp;ccedil;ekleştirelim. &amp;Ccedil;alışma zamanında hata oluşmayacak ve kod başarılı bir şekilde &amp;ccedil;alışacaktır. Bunun sebebi Pointer tipinin ilişkilendirildiği tipin &amp;uuml;yelerine&lt;em&gt;(bu &amp;ouml;rnekte Move ve SaySomething metodlar)&lt;/em&gt; erişebilmesidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/interfaces_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu son iki &amp;ouml;rnekteki farkları anlamak &amp;ouml;nemlidir. Go dilinde varsayılan olarak fonksiyon parametreleri veri kopyalama y&amp;ouml;ntemi ile kullanılırlar. Yani &amp;ccedil;ağrım yapılan yerden g&amp;ouml;nderilen parametre verisi, fonksiyon i&amp;ccedil;inde kullanılmak i&amp;ccedil;in kopyalanır. Bu nedenle Pointer parametre alan fonksiyona değer t&amp;uuml;r&amp;uuml; şeklinde atama yaptığımızda hata alırız. &amp;Ccedil;&amp;uuml;nk&amp;uuml; beklenen Tank veya Player tipinden bir değişken adresidir. Diğer yandan Pointer tipinden parametre almayan fonksiyona &amp;amp; operat&amp;ouml;r&amp;uuml; ile veri&amp;nbsp;g&amp;ouml;nderdiğimizde adres kopyalaması s&amp;ouml;z konusu olacağından, interface tipinin tanımlı &amp;uuml;yelerine&lt;em&gt;(Move ve SaySomething)&amp;nbsp;&lt;/em&gt;erişebiliriz.&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi interface kavramı basit g&amp;ouml;r&amp;uuml;nen ama detayına inildik&amp;ccedil;e dikkat edilmesi gereken &amp;ouml;zellikler taşıyan bir kavramdır. Go dili ile ilgili kavramları &amp;ccedil;alıştıkt&amp;ccedil;a paylaşmaya devam edeceğim. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-05-07 10:57:00</pubDate>
  <slug>GoLang-Interfaces</slug>
  <tags>
    <tag>go</tag>
    <tag>go-programming-language</tag>
    <tag>interface</tag>
    <tag>type</tag>
    <tag>interface{}</tag>
    <tag>pointer</tag>
    <tag>method</tag>
    <tag>function</tag>
  </tags>
  <categories>
    <category>GoLang</category>
  </categories>
</post>