<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>C# Temelleri : Static Olmak</title>
  <description>Static anahtar sözcüğü C# programlama dilinde üstü kapalı yada açık bir biçimde pek çok yerde kullanılır. C# programlama dilini yeni öğrenen birisi için static anahtar sözcüğünün kullanım alanlarını bilmek önemlidir.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Static anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; C# programlama dilinde &amp;uuml;st&amp;uuml; kapalı yada a&amp;ccedil;ık bir bi&amp;ccedil;imde pek &amp;ccedil;ok yerde kullanılır. C# programlama dilini yeni &amp;ouml;ğrenen birisi i&amp;ccedil;in static anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml;n kullanım alanlarını bilmek &amp;ouml;nemlidir. İşte bu ama&amp;ccedil;la yola &amp;ccedil;ıktığımız bu makalemizde, static kavramının C# programlama dilindeki yerini incelemeye &amp;ccedil;alışacağız. Static anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml;n aşağıdaki listede olduğu gibi &amp;ccedil;eşitli durumlarda kullanabiliriz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Bir sınıf(class) i&amp;ccedil;erisinde bulunan metodlar(methods) static olarak tanımlanabilir.&lt;/li&gt;
&lt;li&gt;Bir sınıf(class) i&amp;ccedil;erisinde bulunan alanlar (fields) static olarak tanımlanabilir.&lt;/li&gt;
&lt;li&gt;Bir sınıfa ait static bir yapıcı metod (constructors) tanımlanabilir.&lt;/li&gt;
&lt;li&gt;Değişmezler (constants) bilin&amp;ccedil;siz olarak (implicit) static tanımlanmışlardır.&lt;/li&gt;
&lt;li&gt;Readonly referanslar a&amp;ccedil;ık&amp;ccedil;a belirtilmedik&amp;ccedil;e static değildirler.&lt;/li&gt;
&lt;li&gt;C# 2.0 static sınıflara izin verir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Şimdi t&amp;uuml;m bu maddeleri genişleterek incelemeye &amp;ccedil;alışalım.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;1 . Bir sınıf(class) i&amp;ccedil;erisinde bulunan metodlar(methods) static olarak tanımlanabilir.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Static olarak tanımlanan bir metodun kullanılabilmesi i&amp;ccedil;in tanımlanmış olduğu tipin nesne &amp;ouml;rneğini oluşturmaya gerek yoktur. Bu durum &amp;ccedil;oğunlukla bir tipin asıl iş yapan fonksiyonelliklerin kullanılabilmesi i&amp;ccedil;in, t&amp;uuml;m nesneyi &amp;ouml;rneklemenin gereksiz olduğu durumlarda ele alınır. &amp;Ouml;rneğin aşağıdaki kod par&amp;ccedil;asını ele alalım. Bu kod par&amp;ccedil;asında basit olarak Matematik isimli sınıf i&amp;ccedil;erisinde tanımlanmış Toplam isimli static bir metod yer almaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace StaticKavrami
{
    class Matematik
    {
        public static double Toplam(double x, double y)
        {
            return x + y;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Burada tanımlı olan Toplam isimli static metodu kullanmak i&amp;ccedil;in tek yapılması gereken &lt;strong&gt; SınıfAdı.StaticMetodAdı&lt;/strong&gt; notasyonunu kullanmak olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk174_2.gif" alt="" width="523" height="285" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace StaticKavrami
{
    class Program
    {
        static void Main(string[] args)
        {
            double result = Matematik.Toplam(4, 5);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi intelli-sense &amp;ouml;zelliği Matematik isimli tip yazıldıktan sonra kullanılabilecek static metodumuzu doğrudan g&amp;ouml;stermektedir. .Net Framework i&amp;ccedil;erisinde yukarıdaki &amp;ouml;rnekte bizim tarafımızdan tanımlanmış olan (user-defined) metod gibi y&amp;uuml;zlerce static metod mevcuttur. Bu metodların kullanım amacı &amp;ccedil;oğunlukla tanımlanmış oldukları tipin nesne &amp;ouml;rneğine ihtiya&amp;ccedil; duyulmayışından ileri gelmektedir. &amp;Ouml;rneğin Console uygulamalarını geliştirirken &amp;ccedil;ok sık kullandığımız Console sınıfına ait WriteLine, ReadLine vb metodlar static olarak tanımlanmışlardır. Hatta bir console uygulaması geliştirdiğimizde, programın giriş noktası olan Main metodunun static olarak tanımlandığını farketmişizdir.&lt;/p&gt;
&lt;p&gt;Static metodların kullanılması sırasında dikkat edilmesi yada bilinmesi gerekin bazı durumlar vardır. &amp;Ouml;ncelikli olarak, static olarak tanımlanmış sınıf metodlarına static olmayan sınıf &amp;uuml;yeleride erişebilir. &amp;Ouml;rneğin aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class Matematik
{
    public static double Toplam(double x, double y)
    {
        return x + y;
    }

    public double Toplamlar(int ustSinir,double x,double y)
    {
        double sonuc=0;
        for (int i = 0; i &amp;lt; ustSinir; i++)
            sonuc+=Toplam(x,y);
        return sonuc;
    }
}&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında static olmayan Toplamlar isimli Matematik sınıfına ait &amp;uuml;ye metod, static olan Toplam metodunu kullanabilmektedir. Birde bunun tam tersi durumu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almaya &amp;ccedil;alışalım. Yani static bir metod i&amp;ccedil;erisinden static olmayan bir metoda erişmeye &amp;ccedil;alışalım. Aşağıdaki AltToplamlar isimli metod bu ama&amp;ccedil;la geliştirilmiştir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public static void AltToplamlar(int ustSinir, double x, double y)
{
    Toplamlar(10, 4, 5);
}&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında AltToplamlar isimli static metodumuz i&amp;ccedil;erisinde, static olmayan Toplamlar isimli metod &amp;ccedil;ağırılmaktadır. Ancak bu metodu i&amp;ccedil;eren uygulama kodu derleme zamanında &lt;strong&gt;&lt;em&gt;An object reference is required for the nonstatic field, method, or property 'StaticKavrami.Matematik.Toplamlar(int, double, double) &lt;/em&gt; &lt;/strong&gt;hata mesajını verecektir. Eğer Visual Studio.Net kullanarak kodu yazıyorsanız zaten AltToplamlar isimli metod i&amp;ccedil;erisinden, Toplamlar isimli metoda intelli-sense yardımıyla bile erişemiyeceğimizi g&amp;ouml;rebilirsiniz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk174_3.gif" alt="" width="475" height="230" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Elbette burada ilgin&amp;ccedil; bir durum daha vardır ki buda this anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; kullanıldığı takdirde Toplamlar isimli static olmayan metodun erişilebilir g&amp;ouml;z&amp;uuml;kmesidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk174_4.gif" alt="" width="381" height="91" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu tip bir erişim m&amp;uuml;mk&amp;uuml;n olmasına rağmen uygulama kodu derleme zamanında &lt;strong&gt;&lt;em&gt;'this' is not valid in a static property, static method, or static field initializer&lt;/em&gt;&lt;/strong&gt; hatasını verecektir. Dolayısıyla static bir &amp;uuml;ye metodu i&amp;ccedil;erisinde sadece static &amp;uuml;ye metodlar &amp;ccedil;ağırılabilir. Yada başka bir deyişle static bir metod i&amp;ccedil;erisinden static olmayan bir metodun &amp;ccedil;ağırılamayacağını s&amp;ouml;yleyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;2. Bir sınıf i&amp;ccedil;erisinde bulunan alanlar (fields) static olarak tanımlanabilir.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Static metodlar gibi, bir sınıf i&amp;ccedil;erisinde kullanılabilecek static alanlarda tanımlayabiliriz. Bir alanın static olarak tanımlanması halinde bellek &amp;uuml;zerindeki yerleşim şeklide bilinmesi gereken noktalardan bir tanesidir. Bunu daha iyi ifade edebilmek i&amp;ccedil;in aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace StaticKavrami
{
    class Matematik
    {
        public static double Pi = 3.14;
    }
    class Program
    {
        static void Main(string[] args)
        {
            Matematik mt1 = new Matematik();
            Matematik mt2 = new Matematik();
            Matematik mt3 = new Matematik();

            Console.WriteLine(Matematik.Pi.ToString());
            Console.WriteLine(Matematik.Pi.ToString());
            Console.WriteLine(Matematik.Pi.ToString());
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Matematik isimli sınıfımızda static olarak yer alan Pi isimli double tipinden bir değişken yer almaktadır. Bu değişkene dikkat ederseniz static metodlardakine benzer bir şekilde &lt;strong&gt;SınıfAdı.DeğişkenAdı&lt;/strong&gt; notasyonu ile erişebilmekteyiz. Ancak burada asıl &amp;ouml;nemli olan nokta Matematik sınıfına ait 3 nesne &amp;ouml;rneğinin oluşturulmasına ve kullanılmasına rağmen Pi değerinin hi&amp;ccedil; bir şekilde değişmediğidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk174_5.gif" alt="" width="436" height="127" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İşte bu etkinin nedeni Pi değerinin static olarak tanımlanmış oluşudur. Dolayısıyla Matematik nesnelerinden ka&amp;ccedil; tane oluşturulursa oluşturulsun hepsi aynı Pi değerine işaret etmektedir. Aşağıdaki grafikte bu durum sembolize edilmeye &amp;ccedil;alışılmıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk174_1.gif" alt="" width="353" height="212" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Static alanlar ile ilgili enteresan bir durum vardır. Bir static alanın değeri &amp;ccedil;alışma zamanında değiştirilebilir ancak yapıcı metodlar işin i&amp;ccedil;erisine girdiğinde kodun tepkisi &amp;ccedil;ok daha farklı olur. Konuyu daha iyi anlamak i&amp;ccedil;in Matematik sınıfımıza static Pi değerini nesne &amp;ouml;rneği &amp;uuml;zerinden değiştirmemize yarayacak aşağıdaki gibi bir metod ekleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void PiDegistir(double pi)
{
    Pi = pi;
}&lt;/pre&gt;
&lt;p&gt;Sonrasında ise program kodlarımızı aşağıdaki gibi değiştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{ 
    Matematik mt1 = new Matematik();
    Matematik mt2 = new Matematik();
    Console.WriteLine(Matematik.Pi.ToString());
    Console.WriteLine(Matematik.Pi.ToString());
    mt2.PiDegistir(3);
    Matematik mt3 = new Matematik();
    Matematik mt4 = new Matematik();
    Console.WriteLine(Matematik.Pi.ToString());
    Console.WriteLine(Matematik.Pi.ToString());
}&lt;/pre&gt;
&lt;p&gt;Tahmin edeceğiniz gibi PiDegistir isimli metod mt2 isimli Matematik sınıfına ait nesne &amp;ouml;rneği &amp;uuml;zerinden &amp;ccedil;ağırıldıktan sonra, oluşturulan mt3 ve mt4 isimli nesne &amp;ouml;rnekleri static Pi değişkeninin yeni değeri olan 3' e erişeceklerdir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk174_6.gif" alt="" width="412" height="143" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Lakin işin i&amp;ccedil;erisine bir yapıcı metodu katarsak durum biraz daha farklı bir hal alacaktır. Bu değişikliğe g&amp;ouml;re yukarıdaki kod par&amp;ccedil;asını yeniden &amp;ccedil;alıştırdığımızda ilgin&amp;ccedil; ama beklenen bir sonu&amp;ccedil;la karşılaşırız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public Matematik()
{
    Pi = 3.1415;
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk174_7.gif" alt="" width="400" height="143" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu durumda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi t&amp;uuml;m &amp;ouml;rnekler i&amp;ccedil;in Pi static değişkeninin değeri 3.1415 olarak set edilmektedir. Bunun sebebi son derece doğaldır, nitekim yapıcı metod (constructor) her Matematik nesne &amp;ouml;rneği oluşturulurken &amp;ccedil;alıştırıldığından static değişkenimizin değeride s&amp;uuml;rekli olarak set edilmektedir. İşte bu duruma &amp;ccedil;&amp;ouml;z&amp;uuml;m olacak bir metod &amp;ccedil;eşidi daha vardır ; static yapıcı metod. (static constructor method)&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;3 . Bir sınıfa ait static yapıcılar (constructors) tanımlanabilir.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Static yapıcı metod 2nci maddedeki son &amp;ouml;rnekte meydana gelen durum i&amp;ccedil;in tam bir &amp;ccedil;&amp;ouml;z&amp;uuml;m olmaktadır. Static yapıcı metodu &amp;ccedil;oğunlukla bir sınıfın static değişkenlerine ilk nesne &amp;ouml;rneği oluşturulduğunda bir kereliğine değer atmak i&amp;ccedil;in kullanabiliriz. Bu bilgiler ışığında Matematik sınıfımızı aşağıdaki gibi değiştirelim ve static yapıcı metodumuz i&amp;ccedil;erisinde static Pi değişkeninin değerini belirleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class Matematik
{
    public static double Pi=3.14;

    public void PiDegistir(double pi)
    {
        Pi = pi;
    }
    static Matematik()
    {
        Pi = 3.1415;
    }
}&lt;/pre&gt;
&lt;p&gt;Burada dikkate değer bir nokta, Pi isimli static değişken tanımlanırken 3.14 değerini almasına rağmen, Matematik sınıfına ait ilk nesne &amp;ouml;rneğinin oluşturulması ile birlikte Pi değerinin 3.1415 olarak ele alınmaya başlanmasıdır. Bunun sebebi static yapıcı metodun yaptığı değer atamasının ge&amp;ccedil;erli oluşudur. Şimdi 2nci maddedeki Main metodundaki kodlarımızı Matematik sınıfının bu yeni haline g&amp;ouml;re &amp;ccedil;alıştırırsak, sistemin doğru &amp;ccedil;alıştığını ve yapıcı metodların olumsuz etkisinin ger&amp;ccedil;ekleşmediğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Buradan &amp;ccedil;ıkaracağımız en iyi sonu&amp;ccedil; şudur ki bir sınıfın static &amp;uuml;yelerinin initialize edileceği en uygun yer static yapıcı metodudur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk174_8.gif" alt="" width="412" height="143" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Static yapıcı metoda ilişkin dikkat edilmesi gereken bir takım kurallar da vardır. Bu kurallara g&amp;ouml;re;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Static yapıcı metod erişim belirleyicisi (access modifiers) kullanamaz.&lt;/li&gt;
&lt;li&gt;Static yapıcı metod parametre alamazlar.&lt;/li&gt;
&lt;li&gt;Static yapıcı metod sınıfa ait t&amp;uuml;m yapıcılardan &amp;ouml;nce &amp;ccedil;alışır.&lt;/li&gt;
&lt;li&gt;Static yapıcı metod ka&amp;ccedil; nesne &amp;ouml;rneği oluşturulursa oluşturulsun bir kere &amp;ccedil;alışır.&lt;/li&gt;
&lt;li&gt;Bir sınıf sadece bir static yapıcı metod i&amp;ccedil;erebilir.&lt;/li&gt;
&lt;li&gt;Static yapıcı metod ya ilk nesne &amp;ouml;rneği oluşturulduğunda ya da ilk static sınıf &amp;uuml;yesi &amp;ccedil;ağırılmadan hemen &amp;ouml;nce y&amp;uuml;r&amp;uuml;t&amp;uuml;l&amp;uuml;r.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;4. Değişmezler (constants) bilin&amp;ccedil;siz olarak static tanımlanırlar.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Constant' lar uygulamanın &amp;ccedil;alışması boyunca değişmeyecek değerleri saklamak i&amp;ccedil;in kullandığımız bir değişken &amp;ccedil;eşididir. Basit olarak değer t&amp;uuml;r&amp;uuml;nden (value types) sabit bir değişkeni aşağıdaki gibi tanımlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public const double E = 2.7;&lt;/pre&gt;
&lt;p&gt;Her ne kadar &amp;ccedil;aktırmasalarda const anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; ile tanımlanan sabitler aynı zamanda static davranış g&amp;ouml;sterirler. Bunu hem Visual Studio.Net &amp;uuml;zerinde kod yazarken hemde ildasm ile geliştirdiğimiz tipin assembly' ına ait metadata bilgisine bakarken g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;Visual Studio.Net Ortamında;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk174_9.gif" alt="" width="399" height="60" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Ildasm (Intermediate Language DisAssembly) framework aracı yardımıyla assembly i&amp;ccedil;erisine baktığımızda hem Matematik tipi &amp;uuml;zerinden hemde metaData kısmından (Ctrl+M ile), E isimli sabit değişkenin static olarak tanımlandığını g&amp;ouml;rebiliriz. Bu da constant' ların aslında i&amp;ccedil;sel olarak bilin&amp;ccedil;siz bir şekilde (implicitly) static tanımlandığının kanıtıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk174_10.gif" alt="" width="635" height="506" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Elbetteki sabitler bilin&amp;ccedil;siz (implicit) olarak static tanımlandıklarından, static anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; kullanıldığında derleme zamanında hata mesajı alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk174_11.gif" alt="" width="482" height="42" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;5. Readonly referanslar a&amp;ccedil;ık&amp;ccedil;a belirtilmedik&amp;ccedil;e static değildirler.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Constant' lar derleme zamanında (compile time) tanımlanan değişkenler i&amp;ccedil;in ge&amp;ccedil;erlidir. Bu nedenlede sadece değer t&amp;uuml;rlerine (value types) uygulanabilirler. Oysaki bazı durumlarda sabit olarak tanımladığımız değişkenlerin değerleri &amp;ccedil;alışma zamanında belirlenebilir. Bu nedenle referans tiplerini sabit olarak kullanılabilmek i&amp;ccedil;in readonly tanımlarız. &amp;Ouml;rneğin Matematik sınıfımızın readonly versiyonunu kullanan aşağıdaki Islemler isimli sınıfı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class Islemler
{
    public readonly Matematik mtIslemler;

    public Islemler()
    {
        mtIslemler = new Matematik();
    }
}&lt;/pre&gt;
&lt;p&gt;Readonly olarak tanımlanıp sabit hale getirilen referans değişkenlerinin constant' larda olduğu gibi &amp;ccedil;alışma zamanında static bir &amp;uuml;ye davranışı sergileyeceği d&amp;uuml;ş&amp;uuml;nelebilir. Ancak aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndende farkedeceğiniz gibi bu m&amp;uuml;mk&amp;uuml;n değildir. Dikkat ederseniz intelli-sense &amp;ouml;zelliği readonly olarak tanımlanmış mtIslemler isimli &amp;uuml;yeye, &lt;strong&gt;SınıfAdı.DeğişkenAdı&lt;/strong&gt; notasyonu ile erişilmesine izin vermemektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk174_12.gif" alt="" width="252" height="306" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dolayısıyla readonly olarak tanımlanan referans t&amp;uuml;rleri a&amp;ccedil;ık&amp;ccedil;a belirtilmedik&amp;ccedil;e static değildirler. Dolayısıyla mtIslemler isimli sabitimizi static olarak tanımladığımızda &lt;strong&gt; SınıfAdı.DeğişkenAdı&lt;/strong&gt; notasyonu ile erişme imkanına sahip oluruz. Elbette yukarıdaki kodu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda, b&amp;ouml;yle bir değişiklik bir static yapıcı metodunda kullanılmasını gerektirecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk174_13.gif" alt="" width="346" height="393" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;6. C# 2.0 static sınıflara izin verir. &lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;C# 1.1 versiyonunda olmayan &amp;ouml;zelliklerden birisi bir sınıfın static olarak tanımlanamayışıydı. Oysaki C# 2.0 ile static sınıflar tanımlayabilmekteyiz. Static sınıfların belkide en &amp;ouml;nemli &amp;ouml;zelliği sadece static &amp;uuml;yeler i&amp;ccedil;erebiliyor olmalarıdır. Static sınıflar ile ilgili daha detaylı bilgiyi &lt;a href="http://www.csharpnedir.com/makalegoster.asp?MId=521"&gt;C# 2.0 ve Static Sınıflar&lt;/a&gt; isimli makalemde bulabilirsiniz. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalemizde static kavramının C# dilindeki yerini incelemeye &amp;ccedil;alıştık. Temel olarak static &amp;uuml;yelerin metod ve alan bazında kullanılışını, static yapıcı metodu, sabit olarak tanımlanan değer veya referans t&amp;uuml;rlerindeki yerini incelemeye &amp;ccedil;alıştık. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2006-09-13 18:00:00</pubDate>
  <slug>C#-Temelleri-:-Static-Olmak-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#-20</tag>
    <tag>static-type</tag>
    <tag>static-class</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>