<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tasarım Prensipleri - Open Closed</title>
  <description>Bir önceki yazımda, yazılm tasrımında benimsenen ilkelerinden birisi olan Loose Coupling prensibine değinmiştik. Bu yazımızda ise, Open Closed(Açık Kapalı) prensibine değiniyor olacağız.(Bu prensibini pek çok yazılım disiplininde görebilirsiniz. Örneğin eXtreme Programming veya Aspect Oriented Programming-AOP içerisinde.)</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki yazımda, yazılm tasrımında benimsenen ilkelerinden birisi olan&amp;nbsp;&lt;strong&gt;Loose&lt;/strong&gt; &lt;strong&gt;Coupling&lt;/strong&gt; prensibine değinmiştik. Bu yazımızda ise, &lt;strong&gt;Open Closed(A&amp;ccedil;ık Kapalı) &lt;/strong&gt;prensibine değiniyor olacağız.&lt;em&gt;(Bu prensibini pek &amp;ccedil;ok&amp;nbsp;yazılım disiplininde g&amp;ouml;rebilirsiniz. &amp;Ouml;rneğin &lt;strong&gt;eXtreme Programming &lt;/strong&gt;veya&amp;nbsp;&lt;strong&gt;Aspect Oriented Programming-AOP&lt;/strong&gt; i&amp;ccedil;erisinde.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;A&amp;ccedil;ık kapalı prensibi aslında son derece basit bir ilkedir. Bu ilke bir sistemin s&amp;uuml;rekli olarak değişimlere maruz kalabileceğini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alaraktan&lt;em&gt;(ki &amp;ouml;rneğin &amp;ccedil;evik s&amp;uuml;re&amp;ccedil;lerde hızlı değişimler asıl odaklanılan noktadır)&lt;/em&gt;, genişletilmeye a&amp;ccedil;ık ama modifiye edilmeye kapalı varlıkların&lt;em&gt;(Sınıf, Method vb...)&lt;/em&gt; kullanılmasını &amp;ouml;nerir. Ger&amp;ccedil;ekten de g&amp;uuml;n&amp;uuml;m&amp;uuml;z &lt;strong&gt;Enterprise&lt;/strong&gt; &amp;ccedil;&amp;ouml;z&amp;uuml;mlerin &amp;ccedil;oğunda,m&amp;uuml;şteri ihtiya&amp;ccedil;larına g&amp;ouml;re yazılımın s&amp;uuml;rekli g&amp;uuml;ncelleniyor olması gerekmektedir. Bu noktada g&amp;uuml;ncelleştirme işlemleri sırasında koda dokunmadan ilerlemeye &amp;ccedil;alışmak neredeyse imkansızdır. Ancak bu risk en aza indirgenmeye &amp;ccedil;alışılabilir. &lt;strong&gt;OCP(Open Closed Principle) &lt;/strong&gt;bu noktada devreye giren prensiplerden sadece birisidir. Tabikide bu teorik anlatım bir &amp;ouml;rnekle s&amp;uuml;slenmediği takdirde &amp;ccedil;ok anlaşılır değildir &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Gelin &amp;ouml;nce problemli bir tasarım ile yola &amp;ccedil;ıkalım ve sonrasında ise &lt;strong&gt;OCP'&lt;/strong&gt; i nasıl uygulayabileceğimize bakalım&lt;em&gt;(ki bu noktada bir &amp;ouml;nceki blog yazısına g&amp;ouml;re bir dejavu yaşayabilirsiniz benden s&amp;ouml;ylemesi &lt;img title="Surprised" src="/editors/tiny_mce3/plugins/emotions/img/smiley-surprised.gif" alt="Surprised" border="0" /&gt;&amp;nbsp;)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg36_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Yukarıdaki basit &lt;strong&gt;UML&lt;/strong&gt; şemasında farklı formatlarda resimler &amp;uuml;retmek i&amp;ccedil;in kullanılan bir yaratıcı sınıf&lt;strong&gt;(ImageCreator)&lt;/strong&gt; g&amp;ouml;r&amp;uuml;lmektedir. İlişkidende anlaşılacağı &amp;uuml;zere &lt;strong&gt;ImageCreator&lt;/strong&gt; sınıfı ile diğer resim sınıfları arasında kuvvetli bir bağ vardır. Bu acemi tasarımı biraz toparlamaya &amp;ccedil;alışmak istediğimizi d&amp;uuml;ş&amp;uuml;nelim. Belkide aşağıdaki &lt;strong&gt;UML&lt;/strong&gt; şemasında g&amp;ouml;r&amp;uuml;len kurguyu tasarlamış olabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg36_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu kez ImageBase isimli bir ata sınıfı işin i&amp;ccedil;erisine katmışız gibi g&amp;ouml;r&amp;uuml;n&amp;uuml;yor. Hatta koduda aşağıda şekilde tasarladığımızı d&amp;uuml;ş&amp;uuml;nelim&lt;em&gt;(Tabi bu şekilde kod yazmamızın amacı tamam şakacıktan. Ama&amp;ccedil; bizi Open Close prensibine g&amp;ouml;t&amp;uuml;ren sebepleri ortaya koyabilmek. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg36_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace Problem
{
    class ImageCreator
    {
        ImageBase _image = null;
        public ImageCreator(ImageBase obj)
        {
            _image = obj;
        }
        public void Randomize()
        {
            if (_image is Bmp)
                ((Bmp)_image).Randomize();
            else if (_image is Jpg)
                ((Jpg)_image).Randomize();
            else if (_image is Tif)
                ((Tif)_image).Randomize();
            else
                Console.WriteLine("Ge&amp;ccedil;ersiz format");
        }
        public void Draw()
        {
            if (_image is Bmp)
                ((Bmp)_image).Draw();
            else if (_image is Jpg)
                ((Jpg)_image).Draw();
            else if (_image is Tif)
                ((Tif)_image).Draw();
            else
                Console.WriteLine("Ge&amp;ccedil;ersiz format");
        }    
    }

    class ImageBase
    {
    }

    class Bmp
        :ImageBase
    {
        public void Randomize()
        {
            Console.WriteLine("Random bitmap");
        }
        public void Draw()
        {
            Console.WriteLine("Draw bitmap");
        }
    }

    class Jpg
        :ImageBase
    {
        public void Randomize()
        {
            Console.WriteLine("Random Jpg");
        }
        public void Draw()
        {
            Console.WriteLine("Draw Jpg");
        }
    }

    class Tif
        :ImageBase
    {
        public void Randomize()
        {
            Console.WriteLine("Random Tif");
        }
        public void Draw()
        {
            Console.WriteLine("Draw Tif");
        }
    }

    class Program
    {
        static void Main(string[] args)
        {
            ImageCreator creator = new ImageCreator(new Jpg());
            creator.Randomize();
            creator.Draw();

            creator = new ImageCreator(new Tif());
            creator.Randomize();
            creator.Draw();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Kodun amacına g&amp;ouml;re farklı formatta Image tiplerini oluşturan bir sınıf s&amp;ouml;z konusudur. Bu sınıf i&amp;ccedil;erisinde yer alan &lt;strong&gt;Randomize&lt;/strong&gt; ve &lt;strong&gt;Draw&lt;/strong&gt; isimli metodlar parametre olarak &lt;strong&gt;ImageBase&lt;/strong&gt; tipinden referanslar almaktadır. Her iki metodda kendi i&amp;ccedil;erisinde, gelen tipin &lt;strong&gt;Jpg, Bmp &lt;/strong&gt;veya &lt;strong&gt;Tif &lt;/strong&gt;olup olmadığına bakarak işlemler yapmaktadır&lt;em&gt;(Kapalılık ilkesi zaten if kısmında bozulmaktadır&amp;nbsp;&lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt; ) &lt;/em&gt;Hatta tip tespitinden sonra doğru &lt;strong&gt;Randomize&lt;/strong&gt; yada &lt;strong&gt;Draw&lt;/strong&gt; metodunu &amp;ccedil;ağırabilmek i&amp;ccedil;in bir &lt;strong&gt;Cast&lt;/strong&gt; işlemininde uygulandığını g&amp;ouml;rebiliriz. Tabiki normal şartlarda bu tip bir tasarımı tercih etmeyiz, etmemeliyiz. Nitekim s&amp;ouml;z konusu tasarımın şu sorunları doğuracağı ortadadır.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Yeni bir resim formatı sisteme eklenmek istendiğinde &lt;strong&gt;ImageCreator&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde yer alan &lt;strong&gt;Randomize&lt;/strong&gt; ve &lt;strong&gt;Draw&lt;/strong&gt; metodlarında yer alan &lt;strong&gt;if&lt;/strong&gt; koşullarına ilaveler yapılması gerekmektedir. Buda &amp;uuml;retici sınıf koduna m&amp;uuml;dahele edilmesi anlamına gelmektedir.&lt;/li&gt;
&lt;li&gt;Her yeni imaj eklenişinde&amp;nbsp;unit testlerininde(eğer hazırlanmışlarda)&amp;nbsp;tekrardan tasarlanması veya oluşturulması gerekir. &amp;Ouml;zellikle &lt;strong&gt;UnitTest'&lt;/strong&gt; i yapılmış olan bir kod par&amp;ccedil;asında tekrardan değişikliğe gidilmek zorunda kalınması, testin yeniden kurgulanmasınıda gerektirecektir. En azından eski teste olan g&amp;uuml;veni sorgulatacaktır.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bu sonu&amp;ccedil;lara g&amp;ouml;re &lt;strong&gt;ImageCreator&lt;/strong&gt; sınıfı i&amp;ccedil;in &lt;strong&gt;Closed&lt;/strong&gt; bir yapı sağlanamadığını ifade edebiliriz. Bir başka deyişle modifiyeye a&amp;ccedil;ık(ama olmaması gereken) bir tip s&amp;ouml;z konusudur. Peki &amp;ouml;yleyse &lt;strong&gt;Open&lt;/strong&gt; &lt;strong&gt;Closed &lt;/strong&gt;prensibine uygun olarak kod nasıl tasarlanabilir. &amp;Ouml;nce &lt;strong&gt;UML&lt;/strong&gt; şemasındaki d&amp;uuml;zenlememizi yapalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg36_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ImageCreator ile Jpg, Bmp, Gif ve benzeri resim sınıflar arasındaki kuvvetli bağ ortadan kaldırılmış, kurallar interface tipine yıkılmıştır. Peki ya bu şemayı C# tarafında nasıl uygulayabiliriz. İşte &amp;ouml;rnek Console uygulaması kodlarımız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg36_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace Solution
{
    public class ImageCreator&amp;lt;T&amp;gt;
        where T:IImage
    {
        private T _image;

        public ImageCreator(T img)
        {
            _image = img;
        }

        public void RandomizeImage()
        {
            _image.Randomize();
        }
        public void DrawImage()
        {
            _image.Draw();
        }
    }

    public interface IImage
    {
        void Randomize();
        void Draw();
    }

    class Bmp
        :IImage
    {
        public void Randomize()
        {
            Console.WriteLine("Random bitmap");
        }
        public void Draw()
        {
            Console.WriteLine("Draw bitmap");
        }
    }

    class Jpg
        :IImage
    {
        public void Randomize()
        {
            Console.WriteLine("Random Jpg");
        }
        public void Draw()
        {
            Console.WriteLine("Draw Jpg");
        }
    }

    class Tif
        :IImage
    {
        public void Randomize()
        {
            Console.WriteLine("Random Tif");
        }
        public void Draw()
        {
            Console.WriteLine("Draw Tif");
        }
    }

    class Program
    {
        static void Main(string[] args)
        {
            ImageCreator&amp;lt;Bmp&amp;gt; creator = new ImageCreator&amp;lt;Bmp&amp;gt;(new Bmp());
            creator.RandomizeImage();
            creator.DrawImage();

            ImageCreator&amp;lt;Tif&amp;gt; creator2 = new ImageCreator&amp;lt;Tif&amp;gt;(new Tif());
            creator2.RandomizeImage();
            creator2.DrawImage();            
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceğiz &amp;uuml;zere Jpg, Gif ve Bmp isimli sınıflar &lt;strong&gt;IImage&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamaktadır. Diğer taraftan &lt;strong&gt;ImageCreator&lt;/strong&gt; sınıfı kendi i&amp;ccedil;erisinde &lt;strong&gt;IImage&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; ele alarak &lt;strong&gt;Randomize&lt;/strong&gt; ve &lt;strong&gt;Draw&lt;/strong&gt; operasyonlarını icra etmektedir&lt;em&gt;(Neden dejavu yaşayacağınızı anladınız sanırım&amp;nbsp;&lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt; ) &lt;/em&gt;Buna g&amp;ouml;re &lt;strong&gt;ImageCreator&lt;/strong&gt; tipinin yapısını bozmadan sisteme yeni resim formatları eklenmesi sağlanabilir. Dolayısıyla ImageCreator sınıfı &lt;strong&gt;OCP&lt;/strong&gt; uyumlu hale getirilmiştir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Ve bu blog girişinin &amp;Ouml;zl&amp;uuml; C&amp;uuml;mlesi:&lt;/strong&gt; OCP ilkesi, sınıf, metod gibi &lt;strong&gt;OOP&lt;/strong&gt; varlıklarının &lt;strong&gt;genişletilmeye a&amp;ccedil;ık(Open)&lt;/strong&gt; ancak &lt;strong&gt;d&amp;uuml;zenlenmeye kapalı(Closed)&lt;/strong&gt; olması gerektiğini savunur. &amp;Ouml;zellikle m&amp;uuml;şteriden gelen istekler nedeniyle sık sık genişletilmesi gereken varlıklarda, genişletmenin kod i&amp;ccedil;erisinde m&amp;uuml;mk&amp;uuml;n olduğunca az meydana gelmesine &amp;ccedil;alışmak gerekir. İlkenin amacını, yeni fonksiyonelliklerin kazandırılması i&amp;ccedil;in minimum kod değişikliğinin yapılması olarak d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;p&gt;Bu arada kod ve resimlerin bazı yerlerinde Tif bazı yerlerinde Gif formatlarını ele aldığımı farkettim. Ama son yaptıpımız OCP tasarımına g&amp;ouml;re hi&amp;ccedil; sorun değil &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f6%2fOCP.rar"&gt;OCP.rar (42,53 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-06-25 04:22:00</pubDate>
  <slug>Tasarim-Prensipleri-Open-Closed</slug>
  <tags>
    <tag>design-principles</tag>
  </tags>
  <categories>
    <category>Tasarım Prensipleri(Design Principles)</category>
  </categories>
</post>