<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ado.Net Entity Framework 4.0 - Lazy Loading [Beta 2]</title>
  <description>Zaman içerisinde Deferred Loading veya Explicity Lazy Loading gibi isimler ile Ado.Net Entity Framework içerisine bir takım özellikler eklenerek bu eksiklik ortadan kaldırılmaya çalışılsada gerçek manada 4.0 versiyonunun Beta 2 sürümünde, beklenildiği gibi bir iyileştirme olduğunu görmekteyiz...</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Ado.Net Entity Framework'&lt;/strong&gt; &amp;uuml;n en &amp;ccedil;ok eleştirilen y&amp;ouml;nlerinden birisi, &lt;strong&gt;ORM(Object Relational Mapping)&lt;/strong&gt; ihtiyacını karşılayacak bir alt yapı olarak tasarlanmasına rağmen &lt;strong&gt;ORM'&lt;/strong&gt; in karakteristik &amp;ouml;zelliklerinden birisi olan &lt;strong&gt;Lazy Loading'&lt;/strong&gt; in&lt;em&gt;(Bir nesnenin ihtiya&amp;ccedil; duyulduğu noktada&amp;nbsp;veri kaynağından y&amp;uuml;klenmesini-Load hedefleyen bir tasarım kalıbı olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir)&lt;/em&gt;&amp;nbsp;tam manada desteklemiyor olmasıdır. Zaman i&amp;ccedil;erisinde &lt;strong&gt;Deferred Loading&lt;/strong&gt; veya &lt;strong&gt;Explicity Lazy Loading &lt;/strong&gt;gibi isimler ile &lt;strong&gt;Ado.Net Entity Framework&lt;/strong&gt; i&amp;ccedil;erisine bir takım &amp;ouml;zellikler eklenerek bu eksiklik ortadan kaldırılmaya &amp;ccedil;alışılsada ger&amp;ccedil;ek manada&lt;strong&gt; 4.0&lt;/strong&gt; versiyonunun &lt;strong&gt;Beta 2 &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml;nde, beklenildiği gibi bir iyileştirme olduğunu g&amp;ouml;rmekteyiz.&lt;/p&gt;
&lt;p&gt;Bu yazımızdaki temel amacımız ise, &lt;strong&gt;Ado.Net Entity Framework'&lt;/strong&gt; &amp;uuml;n bir &amp;ouml;nceki s&amp;uuml;r&amp;uuml;m&amp;uuml;nde durumun ne olduğunu anlamaya &amp;ccedil;alışıp, &lt;strong&gt;4.0 Beta 2 &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml;nde &lt;strong&gt;Lazy Loading &lt;/strong&gt;adına hangi &amp;ouml;zelliğin getirildiğini(belkide getirilmediğini)&amp;nbsp;ve nasıl kullanıldığını g&amp;ouml;rebilmektir. &amp;Ouml;rneklerimizde &lt;strong&gt;Codeplex &lt;/strong&gt;&amp;uuml;zerinden a&amp;ccedil;ık kaynak olarak yayınlanan &lt;strong&gt;Chinook&lt;/strong&gt; veritabanını kullanıyor olacağız. Haydi parmakları sıvayalım &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;&amp;Ouml;rneklerimizden ilkini &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; diğerini ise &lt;strong&gt;Visual Studio 2010 Ultimate Beta 2 &lt;/strong&gt;ortamında geliştiriyor olacağız. Ancak her iki &amp;ouml;rnekte aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len tabloları kullanıyor olacak.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg112_Model.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Visual Studio 2008 ve Ado.Net Entity Framework V1.0&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;Console&lt;/strong&gt; uygulamamızda aşağıdaki gibi bir kod par&amp;ccedil;ası geliştirdiğimizi d&amp;uuml;ş&amp;uuml;elim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Linq;

namespace Before
{
    class Program
    {
        static void Main(string[] args)
        {
            using (ChinookEntities context = new ChinookEntities())
            {
                var albums = from a in context.Album
                             select a;

                foreach (Album albm in albums)
                    Console.WriteLine("{0} [{1}]",albm.Title,albm.Track.Count.ToString());

            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında Album listesi elde edildikten sonra Title bilgileri ile birlikte, o anki alb&amp;uuml;me ait Track sayıları ekrana yazdırılmaktadır. Yani alb&amp;uuml;mler ve bu alb&amp;uuml;mler altında ka&amp;ccedil; şarkı olduğu bilgisine ulaşmak istediğimizi d&amp;uuml;ş&amp;uuml;nebilir. Buna g&amp;ouml;re &amp;ccedil;alışma zamanı g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg112_Runtime1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hatta &lt;strong&gt;SQL Server Profiler&lt;/strong&gt; aracına bakıldığında s&amp;ouml;z konusu kod par&amp;ccedil;ası i&amp;ccedil;in aşağıdaki sorgunun &amp;ccedil;alıştırıldığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;SELECT 
[Extent1].[AlbumId] AS [AlbumId], 
[Extent1].[Title] AS [Title], 
[Extent1].[ArtistId] AS [ArtistId]
FROM [dbo].[Album] AS [Extent1]&lt;/pre&gt;
&lt;p&gt;Bir sorun var mı? &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;Aslında var. Dikkat edileceği &amp;uuml;zere g&amp;uuml;ncel &lt;strong&gt;Album Entity &lt;/strong&gt;nesnesi ile ilişkili olan &lt;strong&gt;Track &lt;/strong&gt;nesneslerinin toplam sayıları(Count) her zaman 0 olarak elde edilmiştir. Bir başka deyişle X Entity nesnesi&amp;nbsp;ile ilişkili olan Y Entity nesnesine dair herhangibir sorgunun işletilmesi s&amp;ouml;z konusu olmamıştır. Oysaki &lt;strong&gt;Lazy Loading&lt;/strong&gt; kalıbına g&amp;ouml;re &amp;ccedil;alışma zamanındaki &lt;strong&gt;Album&lt;/strong&gt; nesne &amp;ouml;rneklerine ait&amp;nbsp;&lt;strong&gt;Track&lt;/strong&gt; &amp;ouml;zellikleri &amp;uuml;zerinden o anki &lt;strong&gt;Track&lt;/strong&gt; nesne &amp;ouml;rneğinin herhangibir &amp;uuml;yesine erişilmek istendiğinde&lt;em&gt;(&amp;Ouml;rnekteki Count gibi),&lt;/em&gt; SQL tarafındada gerekli sorguların &amp;ccedil;alıştırılacağı d&amp;uuml;ş&amp;uuml;n&amp;uuml;l&amp;uuml;r. Peki ilk versiyonda yaşanan bu durum &amp;uuml;zerine ne yapılmaktaydı? Temel olarak iki basit y&amp;ouml;ntem ile bu durumu &amp;ccedil;&amp;ouml;z&amp;uuml;me kavuşturabiliriz. Bunlardan birisi &lt;strong&gt;Include&lt;/strong&gt; metodunun &lt;strong&gt;LINQ&lt;/strong&gt; ifadesinde aşağıdaki gibi kullanılmasıdır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var albums = from a in context.Album.Include("Track")
                             select a;&lt;/pre&gt;
&lt;p&gt;Bu durumda &amp;ccedil;alışma zamanı g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg112_Runtime2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere alb&amp;uuml;mler i&amp;ccedil;erisinde yer alan par&amp;ccedil;aların toplam sayıları elde edilebilmiştir. Bunun i&amp;ccedil;in SQL tarafında da aşağıdaki sorgunun &amp;ccedil;alıştırıldığı g&amp;ouml;zlemlenmektedir.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;SELECT 
[Project1].[AlbumId] AS [AlbumId], 
[Project1].[Title] AS [Title], 
[Project1].[ArtistId] AS [ArtistId], 
[Project1].[C1] AS [C1], 
[Project1].[C3] AS [C2], 
[Project1].[C2] AS [C3], 
[Project1].[TrackId] AS [TrackId], 
[Project1].[Name] AS [Name], 
[Project1].[MediaTypeId] AS [MediaTypeId], 
[Project1].[GenreId] AS [GenreId], 
[Project1].[Composer] AS [Composer], 
[Project1].[Milliseconds] AS [Milliseconds], 
[Project1].[Bytes] AS [Bytes], 
[Project1].[UnitPrice] AS [UnitPrice], 
[Project1].[AlbumId1] AS [AlbumId1]
FROM ( SELECT 
 [Extent1].[AlbumId] AS [AlbumId], 
 [Extent1].[Title] AS [Title], 
 [Extent1].[ArtistId] AS [ArtistId], 
 1 AS [C1], 
 [Extent2].[TrackId] AS [TrackId], 
 [Extent2].[Name] AS [Name], 
 [Extent2].[AlbumId] AS [AlbumId1], 
 [Extent2].[MediaTypeId] AS [MediaTypeId], 
 [Extent2].[GenreId] AS [GenreId], 
 [Extent2].[Composer] AS [Composer], 
 [Extent2].[Milliseconds] AS [Milliseconds], 
 [Extent2].[Bytes] AS [Bytes], 
 [Extent2].[UnitPrice] AS [UnitPrice], 
 CASE WHEN ([Extent2].[TrackId] IS NULL) THEN CAST(NULL AS int) ELSE 1 END AS [C2], 
 CASE WHEN ([Extent2].[TrackId] IS NULL) THEN CAST(NULL AS int) ELSE 1 END AS [C3]
 FROM  [dbo].[Album] AS [Extent1]
 LEFT OUTER JOIN [dbo].[Track] AS [Extent2] ON [Extent1].[AlbumId] = [Extent2].[AlbumId]
)  AS [Project1]
ORDER BY [Project1].[AlbumId] ASC, [Project1].[C3] ASC&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Album&lt;/strong&gt; ve &lt;strong&gt;Track &lt;/strong&gt;tablolarının &lt;strong&gt;Left Outer Join &lt;/strong&gt;ile birleştirilmesi s&amp;ouml;z konusudur. Dahası, sonucun elde edilmesi i&amp;ccedil;in tek bir SQL ifadesinin &amp;ccedil;alıştırılması yeterli olmuştur. Ancak dikkat &amp;ccedil;eken noktalardan biriside sadece &lt;strong&gt;Count&lt;/strong&gt; değeri ile ilgilenmemize rağmen &lt;strong&gt;Track&lt;/strong&gt; tablosundaki t&amp;uuml;m alanların ifadeye dahil edilmesidir.&amp;nbsp;Zaten &lt;strong&gt;Count&lt;/strong&gt; hesabı i&amp;ccedil;in SQL tarafında &amp;ccedil;alıştırılmış bir ifade de &lt;span style="text-decoration: underline;"&gt;bulunmamaktadır&lt;/span&gt;. Bunun yerine kod tarafına&amp;nbsp;&amp;ccedil;ekilen &lt;strong&gt;Track&lt;/strong&gt; listesinin toplam değerinin hesaplanması s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;Diğer bir teknik ise &lt;strong&gt;Load&lt;/strong&gt; metodunun kullanılmasıdır. Bu ama&amp;ccedil;la foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml;nde aşağıdaki d&amp;uuml;zenlemeyi yaptığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;foreach (Album albm in albums)
{
   albm.Track.Load();
   Console.WriteLine("{0} [{1}]", albm.Title, albm.Track.Count.ToString());
}&lt;/pre&gt;
&lt;p&gt;Bu durumda &amp;ccedil;alışma zamanı g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; &lt;strong&gt;Include&lt;/strong&gt; kullanımındaki ile aynı olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg112_Runtime3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;SQL Server Profiler &lt;/strong&gt;aracına bakıldığında ise aşağıdakine benzer bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg112_Profiler1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;foreach&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; i&amp;ccedil;erisinde &lt;strong&gt;Load&lt;/strong&gt; metodunun &amp;ccedil;ağırıldığı her an&amp;nbsp;arka planda bir &lt;strong&gt;SQL&lt;/strong&gt; sorgusunun &amp;ccedil;alıştırıldığı, yine sadece &lt;strong&gt;Count &lt;/strong&gt;ile ilgilenmemize rağmen t&amp;uuml;m &lt;strong&gt;Track &lt;/strong&gt;alanlarının işe katıldığı g&amp;ouml;zlemlenebilir. Hatta &lt;strong&gt;Count&lt;/strong&gt; ile ilişkili olarak &lt;strong&gt;SQL&lt;/strong&gt; tarafında&amp;nbsp;&amp;ccedil;alıştırılan bir ifade bulunmamaktadır. Bu değer, kod tarafındaki &lt;strong&gt;Track&lt;/strong&gt;&amp;nbsp;listesinin&amp;nbsp;ilgili &lt;strong&gt;Album&lt;/strong&gt; i&amp;ccedil;in elde edilmesinden sonra&amp;nbsp;hesaplanmaktadır.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Aslında tam bu noktada, ele alınan senaryo i&amp;ccedil;in &lt;strong&gt;Include&lt;/strong&gt; metodunun kullanımının, &lt;strong&gt;Load &lt;/strong&gt;metoduna g&amp;ouml;re&amp;nbsp;daha efektif olduğunu d&amp;uuml;ş&amp;uuml;nebiliriz. Nitekim istemci ve SQL sunucusu arasında sadece tek bir sorgusunun &amp;ccedil;alıştırılması s&amp;ouml;z konusudur. Diğer yandan &lt;strong&gt;foreach&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; i&amp;ccedil;erisinde senaryoya g&amp;ouml;re bazı koşullar sağlandığı takdirde&amp;nbsp;&lt;strong&gt;Count&lt;/strong&gt; &amp;ouml;zelliğinin kullanılması istendiği durumlarda,&amp;nbsp;&lt;strong&gt;Load&lt;/strong&gt; metodunun tercih edilmesi yoluna gidilebilir. Her neyse...Bakalım &lt;strong&gt;Ado.Net Entity Framework 4.0 Beta 2&lt;/strong&gt; i&amp;ccedil;erisinde ger&amp;ccedil;ek anlamda &lt;strong&gt;Lazy Loading&lt;/strong&gt; i&amp;ccedil;in ne yapılmıştır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Visual Studio 2010 Beta 2 ve Ado.Net Entity Framework 4.0 Beta 2&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Yeni s&amp;uuml;r&amp;uuml;mde &lt;strong&gt;ObjectContext&lt;/strong&gt; t&amp;uuml;revli tip &amp;uuml;zerinden uygulanabilen &lt;strong&gt;LazyLoadingEnabled&lt;/strong&gt; isimli bir &lt;strong&gt;&amp;ouml;zellik(Property)&lt;/strong&gt; bulunmaktadır. Aslında varsayılan olarak &lt;strong&gt;Lazy Laoding&lt;/strong&gt; &amp;ouml;zelliğinin a&amp;ccedil;ık olduğunu s&amp;ouml;yleyebiliriz. Aynı &amp;ouml;rneği &lt;strong&gt;Visual Studio 2010 Beta 2&lt;/strong&gt;&amp;nbsp;&amp;uuml;zerinde denediğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;em&gt;(Entity adlarının oluşturulması sırasında &amp;ccedil;oğullaştırma &amp;ouml;zelliği etkinleştirilmiştir. Bu nedenle Albums ve Tracks isimlendirmeleri s&amp;ouml;z konusudur)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Linq;

namespace ReallyLazy
{
    class Program
    {
        static void Main(string[] args)
        {
            using (ChinookEntities context = new ChinookEntities())
            {
                var albumsWithTracks = from a in context.Albums
                                       select a;

                foreach (Album albm in albumsWithTracks)
                {
                    Console.WriteLine("{0} ({1})",albm.Title,albm.Tracks.Count.ToString());
                }
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ccedil;alışma zamanında aşağıdaki sonu&amp;ccedil;ları elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg112_Runtime4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere kod i&amp;ccedil;erisinde herhangibir şey belirtmememize rağmen &lt;strong&gt;Album&lt;/strong&gt; nesneleri ile ilişkili olan &lt;strong&gt;Track &lt;/strong&gt;nesnelerinin &lt;strong&gt;Count &lt;/strong&gt;&amp;ouml;zelliklerinin değerleri elde edilebilmiştir. Peki arka planda &amp;ccedil;alışan SQL sorgusu(sorguları)? &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;İşte &lt;strong&gt;SQL Server Profiler &lt;/strong&gt;aracından elde edilen sonu&amp;ccedil;lar;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg112_Profiler2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;foreach&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; i&amp;ccedil;erisinde &lt;strong&gt;Track.Count&lt;/strong&gt; &amp;ouml;zelliğine gidildiği her noktada bir SQL sorgusu &amp;ccedil;alıştırılmış ve&amp;nbsp;o anki alb&amp;uuml;me bağlı olan par&amp;ccedil;a bilgileri &amp;ccedil;ekilmiştir. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Count&lt;/strong&gt; i&amp;ccedil;in SQL tarafında yapılmış &amp;ouml;zel bir sorgulama yoktur. Bu değer kod tarafında elde edilmektedir. Aslında bu &amp;ccedil;alışma şeklinin Load metodunun kullanımındaki ile benzer olduğunu s&amp;ouml;yleyebiliriz. Benzer diyorum &amp;ccedil;&amp;uuml;nk&amp;uuml; Load kullanımında &amp;ccedil;alıştırılan SQL sorgusu ile buradaki arasında fark vardır.&lt;em&gt; (Bakalım iki şekil arasındaki 9 farkı bulabilecek misiniz?&amp;nbsp;&lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt; )&lt;/em&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Kişisel Not : Aslında bazı blog yazılarında LazyLoadingEnabled &amp;ouml;zelliğinin true olması halinde bu şekilde &amp;ccedil;alıştığı g&amp;ouml;sterilmiştir. İşte s&amp;uuml;r&amp;uuml;m farklılıklarının bir sonucu daha. Bu nedenle Beta 2 &amp;uuml;zerinde yazdığımız bu konunun gelecek s&amp;uuml;r&amp;uuml;mlerde değişikliğe uğraması s&amp;ouml;z konusu olabilir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Şimdi kodumuzda aşağıdaki değişikliği yaptığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using (ChinookEntities context = new ChinookEntities())
{
   context.ContextOptions.LazyLoadingEnabled = false;&lt;/pre&gt;
&lt;p&gt;Burada &lt;strong&gt;LazyLoadingEnabled&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;false&lt;/strong&gt; değer atanması sonucu aşağıdaki sonu&amp;ccedil;lar ile karşılaşılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f12%2fblg112_Runtime5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Beklediğimiz gibi &lt;strong&gt;Lazy Loading&lt;/strong&gt; &amp;ouml;zelliğini kapattık. Peki ya SQL tarafı? İşte &lt;strong&gt;SQL Server Profiler' &lt;/strong&gt;dan yakalanan SQL sorgusu.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;SELECT 
[Extent1].[AlbumId] AS [AlbumId], 
[Extent1].[Title] AS [Title], 
[Extent1].[ArtistId] AS [ArtistId]
FROM [dbo].[Album] AS [Extent1]&lt;/pre&gt;
&lt;p&gt;Sanırım yazımızın başladığı noktadaki sonu&amp;ccedil;lara d&amp;ouml;nd&amp;uuml;k ne dersiniz? &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;&amp;Ouml;zetle&lt;strong&gt; Ado.Net Entity Framework 4.0 Beta 2&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nde&lt;strong&gt; Lazy Loading &lt;/strong&gt;kabiliyetinin varsayılan olarak a&amp;ccedil;ık geldiğini ve istendiğinde &lt;strong&gt;Context&lt;/strong&gt; nesnesinin &lt;strong&gt;LazyLoadingEnabled&lt;/strong&gt; &amp;ouml;zelliğine atanacak &lt;strong&gt;false&lt;/strong&gt; değeri ile kapatılabileceğini g&amp;ouml;rm&amp;uuml;ş olduk. Bakalım s&amp;uuml;r&amp;uuml;m&amp;uuml;n ileriki versiyonlarında ne gibi yenilikler olacak. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f12%2fBefore.rar"&gt;Before.rar (41,07 kb)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f12%2fReallyLazy.rar"&gt;ReallyLazy.rar (98,20 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-12-07 02:27:00</pubDate>
  <slug>AdoNet-Entity-Framework-40-Lazy-Loading</slug>
  <tags>
    <tag>adonet-entity-framework</tag>
  </tags>
  <categories>
    <category>Entity Framework</category>
  </categories>
</post>