<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Caching Application Block Merakı</title>
  <description>Az önce 1966 yılında çevrilmiş olan ve küçüklüğümde bol bol izlediğim nefis bir filmi belkide 179ncu kez tekrardan seyrettim. Eskiler aşağıdaki resimden hangi film olabileceğini tahmin edebilirler. Yeni nesilden seyretmeyen varsa eğer The Good, The Bad and The Ugly filmini mutlaka tedarik edip izlesinler. Peki bunun anlatacağım konu ile bir ilgisi var mı? Hayır yok. Cool Sadece off-topic bir giriş yapmak istedim.</description>
  <content>&lt;p style="text-align: left;"&gt;&lt;img style="float: right;" src="/pics/2009%2f6%2fblg34_1.jpg" alt="" /&gt;Merhaba Arkadaşlar,&amp;nbsp;&lt;/p&gt;
&lt;p style="text-align: left;"&gt;Az &amp;ouml;nce 1966 yılında &amp;ccedil;evrilmiş olan ve k&amp;uuml;&amp;ccedil;&amp;uuml;kl&amp;uuml;ğ&amp;uuml;mde bol bol izlediğim nefis bir filmi belkide 179ncu kez tekrardan seyrettim. Eskiler aşağıdaki resimden hangi film olabileceğini tahmin edebilirler.&amp;nbsp;Yeni nesilden seyretmeyen varsa eğer &lt;strong&gt;&lt;a title="The Good, The Bad and The Ugly" href="http://en.wikipedia.org/wiki/The_Good,_the_Bad_and_the_Ugly" target="_blank"&gt;The Good, The Bad and The Ugly&lt;/a&gt;&lt;/strong&gt; filmini mutlaka tedarik edip izlesinler. Peki bunun anlatacağım konu ile bir ilgisi var mı? Hayır yok. &lt;img title="Cool" src="/editors/tiny_mce3/plugins/emotions/img/smiley-cool.gif" alt="Cool" border="0" /&gt;&amp;nbsp;Sadece off-topic bir giriş yapmak istedim.&lt;/p&gt;
&lt;p&gt;Bu yazımda sizlere bahsetmek istediğim konu bir s&amp;uuml;redir boş vakitlerimde araştırıp incelediğim &lt;strong&gt;Caching Application Block&lt;/strong&gt; yapısıdır. A&amp;ccedil;ık kaynak olarak sunulan &lt;strong&gt;&lt;a title="Enterprise Library 4.1" href="http://www.microsoft.com/Downloads/details.aspx?familyid=1643758B-2986-47F7-B529-3E41584B6CE5&amp;amp;displaylang=en" target="_blank"&gt;Enterprise Library &lt;/a&gt;&lt;/strong&gt;&amp;uuml;r&amp;uuml;n ailesinin bir par&amp;ccedil;ası olan bu bloğu, uygulamalarımızda performansı arttırmak adına ele alabiliriz. Bilindiği &amp;uuml;zere g&amp;uuml;n&amp;uuml;m&amp;uuml;z uygulamalarında sıklıkla tekrar eden pek &amp;ccedil;ok &lt;strong&gt;kıstas(Concern)&lt;/strong&gt; bulunmaktadır. &amp;Ouml;rneğin &lt;strong&gt;hata y&amp;ouml;netimi(Error Handling), loglama(Logging), şifreleme işlemleri(Cryptography), g&amp;uuml;venlik(Security), doğrulama(Validation)&lt;/strong&gt;&amp;nbsp;veya &lt;strong&gt;veri erişim işlemleri(Data Access)&lt;/strong&gt; bu kıstaslara &amp;ouml;rnek olarak g&amp;ouml;sterilebilir. Haliyle bu kavramlar &amp;ccedil;oğunlukla uygulamadan bağımsız olmaktadır. Nitekim uygulama &amp;ccedil;eşidi değişse bile, bu kıstasların bir kısmını veya tamamını kullanmak zorunda kalabiliriz.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;yleyse uygulamalara bu kıstasların enjekte edilmesi sırasında gerekli hazırlıkları tekrar tekrar yapmamıza gerek bırakmayacak modellere ihtiyacımız vardır. &lt;em&gt;(&lt;strong&gt;Aspect Oriented Programming&lt;/strong&gt; modelininde &amp;ccedil;&amp;ouml;z&amp;uuml;m getirdiği sorunlardan birisidir bu aslında.)&lt;/em&gt; Diğer taraftan, &lt;strong&gt;Enterprise Library&lt;/strong&gt; gibi k&amp;uuml;t&amp;uuml;phaneleri ele alaraktanda, bu kıstasların tamamını veya bir kısmını istediğimiz uygulamalarda değerlendirebiliriz. Bu sayede s&amp;uuml;rekli tekrar eden temel işlemlerle uğraşmak zorunda kalmayarak tamamen iş mantığına odaklanmamız m&amp;uuml;mk&amp;uuml;n olabilir. &amp;Uuml;stelik Enterprise Library a&amp;ccedil;ık kaynak kodlu olduğundan, dilersek genişletebilir veya &amp;ouml;zelleştirebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Caching Application Block'&lt;/strong&gt; un nasıl kullanıldığını anlatmak i&amp;ccedil;in olduk&amp;ccedil;a hevesliyim&lt;em&gt;.(Dilerseniz benden &amp;ccedil;ok daha iyi&amp;nbsp;bir &amp;ouml;ğretici olan &lt;a title="Enterprise Library 4.1 Hands-On-Lab" href="http://www.microsoft.com/Downloads/details.aspx?familyid=AB3F2168-FEA1-4FC2-B40C-7867D99D4B6A&amp;amp;displaylang=en" target="_blank"&gt;Hands-On-Lab' &lt;/a&gt;leride kullanabilirsiniz&amp;nbsp;ki şiddetle tavsiye ederim)&lt;/em&gt;&amp;nbsp;İlk etapta bize &amp;ouml;rnek bir senaryo gerekiyor. Ben elimde bir WCF servisi olduğunu, bu servisin XML tabanlı bir veri kaynağını kullanarak istemcilere &amp;uuml;r&amp;uuml;n bilgilerini verdiğini d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m. Bununla birlikte, &amp;uuml;r&amp;uuml;nlerin resim bilgileride fiziki dosyalarda ve sunucu tarafında yer almaktadır. İstemciler, listeleri &amp;ccedil;ektikten sonra dilerlerse istedikleri bir &amp;uuml;r&amp;uuml;n&amp;uuml;n resmini servisten talep edebilmektedir. Tabiki bu senaryoda performansı etkiliyen farklı fakt&amp;ouml;rler vardır.&lt;/p&gt;
&lt;p&gt;Herşeyden &amp;ouml;nce, servis y&amp;ouml;nelimli bir uygulama s&amp;ouml;z konusu olduğundan, istemci ve sunucu arasında taşınacak resim ve boyutu iletişim hızını ve performansını doğrudan etkileyecektir. &lt;em&gt;(Burada performans i&amp;ccedil;in resmin MIME protokol&amp;uuml;ne g&amp;ouml;re taşınması&amp;nbsp;veya par&amp;ccedil;alara b&amp;ouml;l&amp;uuml;nerek aktarılması d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.)&lt;/em&gt;&amp;nbsp;Diğer taraftan, istemcinin bir &amp;uuml;r&amp;uuml;n resmini talep etmesi durumunda, sunucu tarafında resmin fiziki dosyadan tedarik edilerek istemci tarafına g&amp;ouml;nderilecek şekilde hazırlanması durumunda da performans kaybı s&amp;ouml;z konusu olacaktır. İşte biz &lt;strong&gt;Caching Application Block&lt;/strong&gt; yapısını, servis tarafında resmin hazırlanması aşamasında ele alabiliriz. Yinede şunu vurgulamakta yarar vardır. WCF servisi web tabanlı olarak yayınlandığında pekala Asp.Net motorunun var olan &amp;ouml;nbellekleme mod&amp;uuml;llerinide kullanılabilir. Dolayısıyla senaryomuzu sadece &lt;strong&gt;Caching Application Block'&lt;/strong&gt; un kullanımını &amp;ouml;ğrenmek amacıyla geliştirdiğimizi g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almamızda yarar vardır. Hatta istemcinin asenkron olarak erişmesi veya servis tarafında paralel hesaplamalar yapılması gibi senaryoları hi&amp;ccedil; işin i&amp;ccedil;erisine katmıyoruz bile.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;nce servis tarafını ele alalım. Servis tarafında veri kaynağı olarak Products.xml isimli bir dosya kullanılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg34_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;XML&lt;/strong&gt; i&amp;ccedil;eriğinde basit olarak &amp;uuml;r&amp;uuml;n&amp;uuml;n Id değeri, adı, liste fiyatı ve resim dosyası adı bilgileri tutulmaktadır. Resimler ise WCF Service uygulamasında &lt;strong&gt;ProductImages&lt;/strong&gt; isimli bir fiziki klas&amp;ouml;rde yer almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg34_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;XML i&amp;ccedil;eriğini istemci tarafında sunarken Product isimli serileştirilebilir bir tipten yararlanıyor olacağız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Runtime.Serialization;

namespace ProductServices
{
    [DataContract]
    public class Product
    {
        [DataMember]
        public int ProductId { get; set; }
        [DataMember]
        public string Name { get; set; }
        [DataMember]
        public decimal ListPrice { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Servis s&amp;ouml;zleşmesi ise aşağıdaki kod par&amp;ccedil;asında olduğu gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic;
using System.Drawing;
using System.ServiceModel;

namespace ProductServices
{
    [ServiceContract]
    public interface IPhotoService
    {
        [OperationContract]
        List&amp;lt;Product&amp;gt; GetProducts();

        [OperationContract]
        byte[] GetPhoto(int productId);
    }
}&lt;/pre&gt;
&lt;p&gt;S&amp;ouml;zleşmeyi uygulayan tipimizin kodları ise şu şekildedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Configuration;
using System.IO;
using System.Linq;
using System.Xml.Linq;

namespace ProductServices
{
    public class PhotoService 
        : IPhotoService
    {
        public List&amp;lt;Product&amp;gt; GetProducts()
        {            
            XDocument doc = XDocument.Load(ConfigurationManager.AppSettings["XmlSourcePath"]);

            List&amp;lt;Product&amp;gt; products = (from p in doc.Element("Products").Elements("Product")
                          select new Product
                          {
                              ProductId=Convert.ToInt32(p.Element("Id").Value),
                              Name=p.Element("Name").Value,
                              ListPrice=Convert.ToDecimal(p.Element("ListPrice").Value)
                          }).ToList&amp;lt;Product&amp;gt;();

            return products;
        }

        #region IPhotoService Members


        public byte[] GetPhoto(int productId)
        {
            XDocument doc=XDocument.Load(ConfigurationManager.AppSettings["XmlSourcePath"]);

            string imageFileName = (from p in doc.Element("Products").Elements("Product")
                                   where p.Element("Id").Value == productId.ToString()
                                   select p.Element("ImageFileName").Value).Single();

            string imagePath = Path.Combine(ConfigurationManager.AppSettings["ImagesPath"], imageFileName);

            return File.ReadAllBytes(imagePath);
        }

        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere, &lt;strong&gt;XML&lt;/strong&gt; i&amp;ccedil;eriğini sorgulama kısımlarında &lt;strong&gt;XLINQ&lt;/strong&gt; ifadelerinden yararlanılmaktadır. &lt;strong&gt;GetProducts&lt;/strong&gt; metodu, &lt;strong&gt;List&amp;lt;Product&amp;gt;&lt;/strong&gt; koleksiyonu tipinden bir referans d&amp;ouml;nd&amp;uuml;rmektedir. Bununla birlikte herhangibir &amp;uuml;r&amp;uuml;n&amp;uuml;n resmi, &lt;strong&gt;GetPhoto&lt;/strong&gt; metodu yardımıyla &lt;strong&gt;byte[]&lt;/strong&gt; dizisi olacak şekilde &amp;uuml;retilmektedir. &lt;strong&gt;Products.xml&lt;/strong&gt; dosyası ve resimlerin k&amp;ouml;k adres bilgileri &lt;strong&gt;web.config&lt;/strong&gt; dosyasında &lt;strong&gt;appSettings&lt;/strong&gt; kısmında tutulmaktadır. Bu nedenle s&amp;ouml;z konusu konfigurasyon bilgilerin alınabilmesi i&amp;ccedil;in,&amp;nbsp;&lt;strong&gt;ConfigurationManager&lt;/strong&gt; tipinden yararlanıldığı g&amp;ouml;r&amp;uuml;lmektedir. Servisimiz basicHttpBinding bağlayıcı tipi &amp;uuml;zerinden sunulmaktadır. Dolayısıyla web.config dosyasındaki servis ayarları aşağıda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg34_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Peki ya istemci tarafı? Bu uygulamayı aşağıdaki tasarıma sahip basit bir WinForms programı olarak d&amp;uuml;ş&amp;uuml;nebiliriz aslında.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg34_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İstemci uygulamaya servis referansının eklenmesinin ardından kodlarıda aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Drawing;
using System.IO;
using System.Windows.Forms;
using ClientApp.ProductServicesRef;

namespace ClientApp
{
    public partial class Form1 : Form
    {
        PhotoServiceClient proxy = null;

        public Form1()
        {
            InitializeComponent();
            proxy = new PhotoServiceClient();
        }

        private void btnGetProductList_Click(object sender, EventArgs e)
        {
            grdProducts.DataSource=proxy.GetProducts();
        }

        private void grdProducts_CellClick(object sender, DataGridViewCellEventArgs e)
        {
            int productId = Convert.ToInt32(grdProducts[2, e.RowIndex].Value);

            byte[] byteArray= proxy.GetPhoto(productId);
            using (MemoryStream stream = new MemoryStream(byteArray))
            {
                pcbImage.Image = Image.FromStream(stream);
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Kullanıcılar &lt;strong&gt;GetProductList&lt;/strong&gt; d&amp;uuml;ğmesini kullanarak servisten &amp;uuml;r&amp;uuml;n listeni &amp;ccedil;ekmektedir. &amp;Ccedil;ekilen &amp;uuml;r&amp;uuml;nler &lt;strong&gt;DataGridView&lt;/strong&gt; kontrol&amp;uuml;ne aktarılmaktadır. Grid &amp;uuml;zerinden herhangibir satıra tıklanıldığında ise se&amp;ccedil;ilen &amp;uuml;r&amp;uuml;n&amp;uuml;n ProductId değerine g&amp;ouml;re servisten resim bilgisi talep edilmektedir. Aşağıda &amp;ccedil;alışma zamanındaki &amp;ouml;rnek sonu&amp;ccedil;lardan birisi yer almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg34_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Burada hemen şu noktayı vurgulamak isterim. İstemci tarafına g&amp;ouml;nderilen &lt;strong&gt;byte&lt;/strong&gt; dizisinin boyutu, yine istemci tarafındaki&lt;strong&gt; app.config&lt;/strong&gt; dosyasında, &lt;strong&gt;readerQuotas&lt;/strong&gt; elementi i&amp;ccedil;erisindeki &lt;strong&gt;maxArrayLength&lt;/strong&gt; &amp;ouml;zelliği ile sınırlandırılmıştır. Resimlerin boyutlarına g&amp;ouml;re bu değerin arttırılması gerekebilir ki benim &amp;ouml;rneğimde bu arttırım yapılmak zorunda kalınmıştır.&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Nihayetinde &amp;ouml;n hazırlıklarımız tamamlanmıştır. Artık servis tarafında kullanmak istediğimiz &lt;strong&gt;Caching Application Block&lt;/strong&gt; ile ilişkili hazırlıklara başlayabiliriz. &amp;Ouml;ncelikle servis uygulamasına kullanılmak istenen Enterprise Library bloğu ile ilgili &lt;strong&gt;assembly&lt;/strong&gt; referansının eklenmesi gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg34_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece kod i&amp;ccedil;erisinde, &lt;strong&gt;Caching Application Block&lt;/strong&gt; ile ilişkili y&amp;ouml;netimli kodlar ele alabileceğiz.&lt;strong&gt; Caching Application Block&lt;/strong&gt;, &amp;ouml;n belleğe alma işlemlerinde varsayılan olarak kullanıldığı host uygulamanın &amp;ccedil;alıştığı sistem belleğini ele almaktadır. Ancak istenirse saklama işlemleri i&amp;ccedil;in farklı bir kaynağın&lt;em&gt;(&amp;ouml;rneğin fiziki disk)&lt;/em&gt; kullanılması sağlanabilir. Bunula birlikte, &amp;ouml;n bellekte tutulacak maksimum eleman sayısınıda belirleyebiliriz. İyi ama bu ayarları nerede yapacağız? &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;Tahmin edeceğiniz &amp;uuml;zere host uygulamanın konfigurasyon dosyası i&amp;ccedil;erisinde. Neyseki &lt;strong&gt;Enterprise Library&lt;/strong&gt; kurulumlarından sonra, &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; i&amp;ccedil;in g&amp;ouml;rsel bir arabirim gelmektedir. B&amp;ouml;ylece gerekli ayarları kolayca yapabiliriz.&lt;/p&gt;
&lt;p&gt;İlk etapta servis uygulamasındaki&amp;nbsp;&lt;strong&gt;web.config &lt;/strong&gt;dosyasını&lt;strong&gt; Edit Enterprise Library Configuration&lt;/strong&gt; ile a&amp;ccedil;alım. &lt;em&gt;(İstenirse t&amp;uuml;m ayarlamalar konfigurasyon dosyası i&amp;ccedil;erisinden ellede yapılabilir.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg34_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sonrasında ise &lt;strong&gt;Caching Application Block&lt;/strong&gt; i&amp;ccedil;in gerekli &lt;strong&gt;XML&lt;/strong&gt; sekmesini aşağıdaki şekildende g&amp;ouml;r&amp;uuml;lebileceği gibi kolayca&amp;nbsp;ilave edebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg34_9.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemlerin ardından varsayılan olarak web.config dosyasının i&amp;ccedil;eriği aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;cachingConfiguration defaultCacheManager="Cache Manager"&amp;gt;
    &amp;lt;cacheManagers&amp;gt;
      &amp;lt;add expirationPollFrequencyInSeconds="60" maximumElementsInCacheBeforeScavenging="1000"
        numberToRemoveWhenScavenging="10" backingStoreName="Null Storage"
        type="Microsoft.Practices.EnterpriseLibrary.Caching.CacheManager, Microsoft.Practices.EnterpriseLibrary.Caching, Version=4.1.0.0, Culture=neutral, PublicKeyToken=31bf3856ad364e35"
        name="Cache Manager" /&amp;gt;
    &amp;lt;/cacheManagers&amp;gt;
    &amp;lt;backingStores&amp;gt;
      &amp;lt;add encryptionProviderName="" type="Microsoft.Practices.EnterpriseLibrary.Caching.BackingStoreImplementations.NullBackingStore, Microsoft.Practices.EnterpriseLibrary.Caching, Version=4.1.0.0, Culture=neutral, PublicKeyToken=31bf3856ad364e35"
        name="Null Storage" /&amp;gt;
    &amp;lt;/backingStores&amp;gt;
  &amp;lt;/cachingConfiguration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Tabiki &amp;ouml;zellikler penceresindende pek &amp;ccedil;ok ayarlama yapılabilir. S&amp;ouml;z gelimi &lt;strong&gt;Protection Provider&lt;/strong&gt; ile &amp;ouml;n bellekte tutulacak nesnelerin şifrelenmesi i&amp;ccedil;in hangi sağlayıcının kullanılacağı belirlenebilir&lt;em&gt;(şu andaki &amp;ouml;rneğimizde herhangibir şifreleme sağlayıcısı kullanılmamaktadır)&lt;/em&gt;. Peki bunlar yeterli midir? Elbetteki değildir. &amp;Ouml;n bellekte kimi tutacağız? &amp;Ouml;n bellekte tutmak istediğimiz nesne referansını nasıl ekleyecek veya nasıl &amp;ccedil;ekeceğiz? Bu durumda &lt;strong&gt;GetPhoto&lt;/strong&gt; metodunun i&amp;ccedil;eriğini aşağıdaki gibi d&amp;uuml;zenlememiz yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public byte[] GetPhoto(int productId)
{
	XDocument doc=XDocument.Load(ConfigurationManager.AppSettings["XmlSourcePath"]);

	string imageFileName = (from p in doc.Element("Products").Elements("Product")
						   where p.Element("Id").Value == productId.ToString()
						   select p.Element("ImageFileName").Value).Single();

	string imagePath = Path.Combine(ConfigurationManager.AppSettings["ImagesPath"], imageFileName);

	byte[] imageBytes = null;

	// İlk olarak &amp;ccedil;alışma zamanında, CacheManager referansı &amp;ccedil;ekilir. Bu noktada fabrika tipinden yararlanılmaktadır.
	ICacheManager cacheManager = CacheFactory.GetCacheManager();

	// Eğer Cache koleksiyonunda, productId ile belirtilen bir referans tutulmuyorsa
	if (cacheManager[productId.ToString()] == null)
	{
		imageBytes = File.ReadAllBytes(imagePath);
		cacheManager.Add(productId.ToString(), imageBytes);
	}
	else // Eğer Cache koleksiyonunda productId anahtarına sahip bir referans var ise getir
		imageBytes = (byte[])cacheManager[productId.ToString()];

	return imageBytes;
}&lt;/pre&gt;
&lt;p&gt;Peki sistem nasıl &amp;ccedil;alışmaktadır? &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İstemci bir &amp;uuml;r&amp;uuml;n resmi talep ettiğinde, kod par&amp;ccedil;asına g&amp;ouml;re &amp;ouml;ncelikle &amp;ouml;n bellekte olup olmadığına bakılır. Eğer &amp;ouml;n bellekte &lt;span style="text-decoration: underline;"&gt;değilse&lt;/span&gt; &lt;strong&gt;Add&lt;/strong&gt; metodu yardımıyla &amp;ouml;n belleğe ekleme işlemi yapılır. Eğer nesne &amp;ouml;n bellekte ise, &lt;strong&gt;indeksleyiciden&lt;/strong&gt; yararlanılarak resmin &lt;strong&gt;byte[]&lt;/strong&gt; dizisine &lt;strong&gt;cast&lt;/strong&gt; edilerek elde edilmesi sağlanır. Burada &amp;ouml;nemli olan noktalardan biriside şudur; servise ait host uygulama a&amp;ccedil;ık olduğu s&amp;uuml;rece &lt;strong&gt;productId&lt;/strong&gt; bazlı resimler &amp;ouml;n bellekte saklanmaya ve korunmaya devam edecektir. Ancak host uygulamanın kapatılması durumunda, &amp;ouml;n bellek koleksiyonuda otomatik olarak temizlenmektedir.&amp;nbsp;Diğer yandan&amp;nbsp;&amp;ouml;n bellekte tutulan nesnelerin tamamını bilin&amp;ccedil;li bir şekilde temizlemek istersek, &lt;strong&gt;ICacheManager&lt;/strong&gt; referansı &amp;uuml;zerinden &lt;strong&gt;Flush&lt;/strong&gt; metodunun &amp;ccedil;ağırılması yeterli olacaktır. Yazımı sonlandırmadan &amp;ouml;nce son olarak şu noktayada değinmek isterim; senaryomuzda &lt;strong&gt;Caching&lt;/strong&gt; bloğunu sunucu tarafındaki servis uygulaması i&amp;ccedil;in ele almış bulunmaktayız.&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re istemci aynı resimleri talep ettiği ve servis uygulamasıda ayakta olduğu s&amp;uuml;rece, resimler &amp;ouml;n bellekten tedarik edilecektir. Bu işlem resmin istemciye hızlı bir şekilde iletilmesini sağlamak &amp;uuml;zere yapılmamıştır. Buna l&amp;uuml;tfen dikkat edelim. Aksine servis tarafındaki gereksiz resim okuma işlemini ekarte etmek amacıyla kullanılmıştır(Bu bloğun başka ne tip senaryolarda kullanılabileceğini d&amp;uuml;ş&amp;uuml;nmenizi&amp;nbsp;tavsiye ederim)&amp;nbsp;Senaryomuzda elbetteki eksik kısımlar mevcuttur. &amp;Ouml;rneğin istisna y&amp;ouml;netimi(Exception Handling)&amp;nbsp;sıfırdır. &lt;img title="Embarassed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-embarassed.gif" alt="Embarassed" border="0" /&gt;&amp;nbsp;Asenkron erişim ile ilişkili istemci tarafında hi&amp;ccedil; bir şey yapılmamıştır. &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt;&amp;nbsp;Diğer yandan &lt;span style="text-decoration: underline;"&gt;resmin değişmesi&lt;/span&gt; halinde cache i&amp;ccedil;eriğinin g&amp;uuml;ncellenmesi ile ilgili bir &amp;ccedil;alışmada yapılmamıştır ki yapmaya &amp;ccedil;alışmanızı &amp;ouml;neririm. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdilik benden bu kadar. Yeni bir western filmi sonrasında tekrardan &lt;strong&gt;Enterprise Library&lt;/strong&gt; konulu bir &amp;ouml;rnek ile g&amp;ouml;r&amp;uuml;şmek &amp;uuml;zere...&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f6%2fHelloCachingBlock.rar"&gt;HelloCachingBlock.rar (5,35 mb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-06-20 17:52:00</pubDate>
  <slug>Caching-Application-Block-Merakc4b1</slug>
  <tags>
    <tag>enterprise-library</tag>
    <tag>wcf</tag>
  </tags>
  <categories>
    <category>Enterprise Library</category>
  </categories>
</post>