<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tek Fotolu İpucu 153 - Config Sekmesini Harici Dosyadan Okumak</title>
  <description>Uygulamalarımıza ait pek çok parametrik bilgiyi zaman zaman config uzantılı dosyalar içerisinde tuttuğumuz çok olmuştur. Web tabanlı uygulamalarda web.config veya exe tipi uygulamalarda app.config gibi. Bu dosyalarda standart olarak kullanılan içerikler mevcuttur. appSettings, connectionStrings sanıyorum en popüler olanlarından. Peki bu tip konfigurasyon segmentlerinin harici dosyalara refere edilebileceğini biliyor muydunuz? Örneğin uygulamanın appSettings içeriğinin farklı bir dosyadan gelmesini sağlayabiliriz. Nasıl mı?</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Uygulamalarımıza ait pek &amp;ccedil;ok parametrik bilgiyi zaman zaman config uzantılı dosyalar i&amp;ccedil;erisinde tuttuğumuz &amp;ccedil;ok olmuştur. Web tabanlı uygulamalar ve servislerde web.config, exe&amp;nbsp;tipi uygulamalarda ise app.config dosyaları s&amp;ouml;z konusudur.&amp;nbsp;Bu dosyalarda standard olarak kullanılan i&amp;ccedil;erikler mevcuttur. appSettings, connectionStrings sanıyorum ki en pop&amp;uuml;ler olanlarındandır. Peki bu tip konfigurasyon segmentlerinin harici dosyalardan da alınabileceğini biliyor muydunuz? &amp;Ouml;rneğin uygulamanın appSettings i&amp;ccedil;eriğinin farklı bir dosyadan gelmesini sağlayabiliriz &lt;em&gt;(appSettings i&amp;ccedil;erisine alınacak olan key:value &amp;ccedil;iftlerinin &amp;ccedil;ok kalabalık olduğu senaryolarda bu teknik olduk&amp;ccedil;a işe yarayabilir)&lt;/em&gt; Nasıl mı? Aynen aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/03/tfi153.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Burada &amp;ouml;nemli olan app.config dosyası i&amp;ccedil;erisindeki appSettings elementinde kullanılan configSource niteliğidir. Bu nitelikte ilgili segmentin hangi dosyadan okunacağı belirtilir. &amp;Ouml;rnekte kullanılan ApplicationParameters.config i&amp;ccedil;in dikkat edilmesi gereken bir ka&amp;ccedil; nokta vardır. Bunlardan birisi sadece yerine ge&amp;ccedil;ecek segment i&amp;ccedil;eriğini taşımasıdır. Yani sadece &amp;lt;appSettings&amp;gt; elementini&amp;nbsp;bulundurmalıdır&lt;em&gt;(Console.WriteLine'daki {0} yerine bir i&amp;ccedil;erik geldiğini hayal edelim)&lt;/em&gt;&amp;nbsp;Diğer yandan dosyanın mutlaka asıl&amp;nbsp;konfigurasyon dosyası&amp;nbsp;ile aynı yerde olması beklenir&lt;em&gt;(Bu &amp;ouml;rnekte app.config ile)&lt;/em&gt; Dolayısıyla "Copy to Output Directory" &amp;ouml;zelliğinin "Copy if Newer" veya "Copy Always" olması gerekmektedir.&amp;nbsp;Bir başka ipucunda g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-02-27 02:00:00</pubDate>
  <slug>tek-fotolu-ipucu-153-config-sekmesini-harici-dosyadan-okumak</slug>
  <tags>
    <tag>net</tag>
    <tag>c#</tag>
    <tag>configuration-management</tag>
    <tag>configuration-manager</tag>
    <tag>config-source</tag>
  </tags>
  <categories>
    <category>.Net Temelleri</category>
  </categories>
</post>