<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Teknik Borçları(Technical Debt) Azaltmak</title>
  <description>Teknik borçlar pek çoğumuzun bilmeden de olsa gelecek programcılara bıraktığı sorunlar. Bu sorunlar sebebiyle zamanla kalitesi bozulan ürünler ortaya çıkıyor. Teknik borçların temizlenmesi mi, müşterinin yeni isteklerinin karşılanması mı derken ürün üzerinde çalışan programcıları eskitmeye devam edebiliyor. Sonunda legacy olarak tanımlanan, kimsenin ellemek istemediği ama yaşamını devam ettirmek zorunda olan devasa projeler oluşuyor. Bunun önüne geçmek sanıldığı kadar zor değil aslında. En başından test odaklı yaklaşımlarla ilerlemek sadece bir başlangıç.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/09/sonar_7.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p class="graf graf--p"&gt;Bir yazılım &amp;uuml;r&amp;uuml;n&amp;uuml; geliştirilirken dikkat edilmesi gereken konuların başında kod kalitesi geliyor. Kaliteli kod, bilinen kodlama standartlarına uyan, okunabilirliği y&amp;uuml;ksek, karmaşıklığı az, dok&amp;uuml;mante edilmiş ve bakımı yapılabilir &amp;ouml;zellikleri barındırmak durumunda. Bu kurallara uymaya &amp;ccedil;alışmak geliştirme s&amp;uuml;relerini uzatsa da uzun vadede kalitenin korunması i&amp;ccedil;in gerekli. &amp;Uuml;stelik end&amp;uuml;st&amp;uuml;riyel normlara uygun, derecelendirilebilir uygulamalar geliştirmek istiyorsak kuvvetle &amp;uuml;zerinde durulması gereken bir konu. Eğer kaliteyi bozacak ihlaller yaparsak uygulama arkasında &amp;ouml;denmesi zor b&amp;uuml;y&amp;uuml;k bor&amp;ccedil;lar bırakabiliriz. Nam-ı diğer Teknik Bor&amp;ccedil;&lt;em class="markup--em markup--p-em"&gt;(Technical Debt)&lt;/em&gt;&lt;/p&gt;
&lt;p class="graf graf--p"&gt;Teknik bor&amp;ccedil; yeni bir kavram değil. İlk olarak Wiki&amp;rsquo;nin kurucusu, Extreme Programming ve Design Patterns kavramlarının &amp;ouml;nc&amp;uuml;lerinden olan Ward Cunningham tarafından ortaya konulmuştur. Oluşmasına etken olan sebepler vardır. Bazen geliştirilen &amp;uuml;r&amp;uuml;n&amp;uuml;n proje bitiş s&amp;uuml;resi sebebiyle mecburen stratejik olarak kabul edilir ya da ekip kendi insiyatifinde bunu taktiksel olarak kabul edebilir. Bazı durumlarda ekibin yetkinliğinin az olması sebebiyle ortaya &amp;ccedil;ıkar. Ancak belki de en k&amp;ouml;t&amp;uuml;s&amp;uuml; teknik bor&amp;ccedil; &amp;uuml;st&amp;uuml;ne yeni yapılan geliştirmelerin getirdiği ek bor&amp;ccedil;lardır.&lt;/p&gt;
&lt;blockquote class="graf graf--pullquote"&gt;Bazen artık vazge&amp;ccedil;ilmesi gereken teknikler &amp;uuml;zerine oturmuş &amp;ccedil;&amp;ouml;z&amp;uuml;mlerin, Tool g&amp;uuml;ncelemeleri ile revize edilerek yaşatılması yoluna gidilir. Bu, stratejik bir karar olmakla birlikte k&amp;ouml;k nedeni gidermekten uzak bir yaklaşımdır.&lt;/blockquote&gt;
&lt;p class="graf graf--p"&gt;Teknik bor&amp;ccedil;ların bir kısmı pek &amp;ccedil;oğumuzun bilmeden de olsa gelecek programcılara bıraktığı ve hatta istemeden de olsa &amp;uuml;zerine aldığı sorunlardır aslında. Bu sorunlar sebebiyle zamanla kalitesi bozulan, problemleri &amp;ccedil;oğalan, g&amp;uuml;venilirliği ve daha da k&amp;ouml;t&amp;uuml;s&amp;uuml; itibarı azalan &amp;uuml;r&amp;uuml;nler ortaya &amp;ccedil;ıkar. Teknik bor&amp;ccedil;ların temizlenmesi mi, m&amp;uuml;şterinin yeni isteklerinin karşılanması mı derken &amp;uuml;r&amp;uuml;n, &amp;uuml;zerinde &amp;ccedil;alışan programcıları eskitmeye de devam eder.&amp;nbsp;&lt;span class="markup--quote markup--p-quote is-other" data-creator-ids="163eb811a0ab"&gt;Sonunda legacy olarak tanımlanan, işini yapan ama kimsenin de ellemek istemediği yaşamını devam ettiren korkutucu projeler oluşur.&lt;/span&gt;&lt;/p&gt;
&lt;blockquote class="graf graf--pullquote"&gt;Uygulama &amp;ccedil;alışır halde olduğu ve m&amp;uuml;şteri istekleri karşılandığı s&amp;uuml;rece &amp;uuml;r&amp;uuml;n&amp;uuml;n başarılı olduğu d&amp;uuml;ş&amp;uuml;n&amp;uuml;l&amp;uuml;r. Ancak teknik bor&amp;ccedil;lanma arttık&amp;ccedil;a oluşan bakım maliyetleri ve ek olarak gelen başka sorunlar bir noktadan sonra can sıkıcı hal almaya&amp;nbsp;başlar.&lt;br /&gt;&lt;br /&gt;Yeni istekler i&amp;ccedil;in hesapta olmayan başka bulguları da ortadan kaldırmaya &amp;ccedil;alışırken uygulanan hızlı &amp;ccedil;&amp;ouml;z&amp;uuml;mler bor&amp;ccedil; &amp;uuml;st&amp;uuml;ne bor&amp;ccedil; ekler. Nihayetinde m&amp;uuml;şteri(herkes diyebiliriz) bence mutsuz&amp;nbsp;olur.&lt;br /&gt;&lt;br /&gt;Unutulmamalıdır ki motivasyon kaybı, &amp;ccedil;&amp;ouml;z&amp;uuml;m &amp;uuml;retmenin &amp;ouml;n&amp;uuml;ndeki en b&amp;uuml;y&amp;uuml;k engellerdendir.&lt;/blockquote&gt;
&lt;p id="4a07" class="graf graf--p graf-after--pullquote"&gt;Teknik bor&amp;ccedil;lanmanın &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek i&amp;ccedil;in alınabilecek belli başlı tedbirler var. Her şeyden &amp;ouml;nce yazılım geliştirme şeklimizi değiştirmemiz gerekiyor.&amp;nbsp;&lt;span class="markup--quote markup--p-quote is-other" data-creator-ids="163eb811a0ab"&gt;DevOps gibi k&amp;uuml;lt&amp;uuml;rlerde yaşamalı, şeffaf olmalı, &amp;ccedil;evik teknikleri işin i&amp;ccedil;erisine katmalı, pair programming uygulamaktan korkmamalıyız.&lt;/span&gt;&lt;/p&gt;
&lt;p id="9797" class="graf graf--p graf-after--p"&gt;Test odaklı geliştirme de kalitenin artması i&amp;ccedil;in &amp;ouml;nemli. Hatta DevOps&amp;rsquo;un olmazsa olmazlarından birisi. TDD&lt;em class="markup--em markup--p-em"&gt;(Test Driven Development)&lt;/em&gt;&amp;nbsp;en azından Red, Green, Blue ilkesine g&amp;ouml;re kod geliştirmemizi &amp;ouml;neriyor. Blue&lt;em class="markup--em markup--p-em"&gt;(Refactoring)&lt;/em&gt;olarak nitelendirilen ve kodun yeniden g&amp;ouml;zden ge&amp;ccedil;irildiği kısım bile sonradan oluşacak bor&amp;ccedil;ların &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek i&amp;ccedil;in &amp;ouml;nemli. Hatta Code Review s&amp;uuml;re&amp;ccedil;lerinin işletilmesi de gerekiyor. Pull Request kavramı da buna hizmet eder nitelikte&lt;em class="markup--em markup--p-em"&gt;(Farkındaysanız bunların tamamı DevOps k&amp;uuml;lt&amp;uuml;r&amp;uuml;nde bahsi ge&amp;ccedil;en konulardan)&lt;/em&gt;&lt;/p&gt;
&lt;p id="92e9" class="graf graf--p graf-after--p"&gt;Aşağıdaki tabloda kodu yeniden g&amp;ouml;zden ge&amp;ccedil;irmenin ve iyileştirmenin teknik bor&amp;ccedil;lanma ile olan ilişkisi ifade ediliyor. Zaman ilerledik&amp;ccedil;e refactor edilmeyen kodlar teknik borcun artmasına ve değişim maliyetlerinin y&amp;uuml;kselmesine neden olmakta. Hayatlarımızın belli d&amp;ouml;nemlerinde rastladığımız&lt;em class="markup--em markup--p-em"&gt;(rastlayacağımız)&lt;/em&gt;&amp;nbsp;o b&amp;uuml;y&amp;uuml;k projeleri d&amp;uuml;ş&amp;uuml;n&amp;uuml;n. Hani bakım maliyetleri y&amp;uuml;ksek olan. Temel sebep, zaman i&amp;ccedil;erisinde &amp;ccedil;oğalarak artan teknik bor&amp;ccedil; miktarıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/09/sonar_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p class="graf graf--p"&gt;Yazılımcıya d&amp;uuml;şen bir &amp;ccedil;ok g&amp;ouml;rev var. Test g&amp;uuml;d&amp;uuml;ml&amp;uuml; yazılım geliştirmeye yatkın olması, kod kalite standartlarından haberdar olması, kokan koddan rahatasızlık duyması, kodlama standartlarının farkında olması, temiz kodun ne anlama geldiğini bilmesi &amp;ccedil;ok &amp;ouml;nemli. Ancak birey olarak bilin&amp;ccedil;lenmek de yeterli değil. Kullandığımız programlama dillerinden ortamlara kadar hemen her şey zamanla yarışırcasına yenileniyor, değişiyor. Dolayısıyla temel bilgileri bilsek bile yardımcı ara&amp;ccedil;lardan faydalanmak gerekiyor.&lt;/p&gt;
&lt;blockquote class="graf graf--pullquote"&gt;&amp;Ccedil;eşitli &amp;ouml;l&amp;ccedil;&amp;uuml;mleme ara&amp;ccedil;ları ile elde edeceğimiz metrik değerler bulunuğumuz durumu g&amp;ouml;rmek, iyiye mi gidiyoruz bilmek, &amp;ccedil;eşitli riskleri erkenden hissedip gerekli tedbirleri &amp;ouml;nceden alabilmek i&amp;ccedil;in her alanda olduğu gibi yazılım kalite &amp;ouml;rg&amp;uuml;s&amp;uuml;nde de&amp;nbsp;kritik.&lt;/blockquote&gt;
&lt;p class="graf graf--p"&gt;&amp;Ouml;rneğin kodun statik ve dinamik olarak analiz edilmesi, raporlar &amp;ccedil;ıkartılması ve buna g&amp;ouml;re gerekli d&amp;uuml;zeltmelerin yapılması i&amp;ccedil;in belli başlı ara&amp;ccedil;lardan yararlanılabilir. SonarQube da bu ara&amp;ccedil;lardan birisi ve beni teknik bor&amp;ccedil;lanma ile ilgili olarak bildiklerimi &amp;ouml;zetlememin sebepleri arasında.&lt;/p&gt;
&lt;blockquote class="graf graf--pullquote"&gt;SonarQube bir statik kod analiz aracıdır. Continuous Inspection&lt;em class="markup--em markup--pullquote-em"&gt;(S&amp;uuml;rekli denetim)&lt;/em&gt;&amp;nbsp;olarak tanımlanan k&amp;uuml;lt&amp;uuml;r&amp;uuml;n bir par&amp;ccedil;ası olarak kod kalitesini arttırmak i&amp;ccedil;in CI/CD hattında kullanılır.&lt;br /&gt;&lt;br /&gt;Kodun boyutu, test edilirliliği, karmaşıklığı, tekrarları, g&amp;uuml;venlik a&amp;ccedil;ıkları gibi kısımlarına odaklanır. Temel ama&amp;ccedil; teknik bor&amp;ccedil;ların azaltılması i&amp;ccedil;in gerekli &amp;ccedil;ıktıları sunmak ve &amp;ouml;nerilerde bulunmaktır.&lt;/blockquote&gt;
&lt;p id="f9e7" class="graf graf--p graf-after--pullquote"&gt;Biz de DevOps odaklı k&amp;uuml;lt&amp;uuml;r değişimimiz s&amp;uuml;resince kod kalitesini arttırmak ve teknik bor&amp;ccedil;ları azaltmak i&amp;ccedil;in bazı ara&amp;ccedil;lardan yararlanıyor ve hatta danışmanlık alıyoruz&lt;em class="markup--em markup--p-em"&gt;(Burada&amp;nbsp;&lt;/em&gt;&lt;a class="markup--anchor markup--p-anchor" href="https://sahabt.com/" target="_blank" rel="nofollow noopener" data-href="https://sahabt.com/"&gt;&lt;em class="markup--em markup--p-em"&gt;Saha Bilgi Teknolojileri&lt;/em&gt;&lt;/a&gt;&lt;em class="markup--em markup--p-em"&gt;&amp;nbsp;ve&amp;nbsp;&lt;/em&gt;&lt;a class="markup--user markup--p-user" href="https://medium.com/@emredundar" target="_blank" data-href="https://medium.com/@emredundar" data-anchor-type="2" data-user-id="cf1aed6d40d9" data-action-value="cf1aed6d40d9" data-action="show-user-card" data-action-type="hover"&gt;&lt;em class="markup--em markup--p-em"&gt;Emre Dundar&lt;/em&gt;&lt;/a&gt;&lt;em class="markup--em markup--p-em"&gt;&amp;nbsp;i&amp;ccedil;in ayrı bir parantez a&amp;ccedil;mam lazım. &amp;Ouml;zellikle kod kalitesinin arttırılmasına y&amp;ouml;nelik farkındalığın oluşturulmasında &amp;ccedil;ok değerli katkıları var)&lt;/em&gt;&lt;/p&gt;
&lt;p id="4b7c" class="graf graf--p graf-after--p"&gt;Tabii test odaklı geliştirilmeyen, &amp;uuml;zerinden &amp;ccedil;ok&amp;ccedil;a yazılımcının ge&amp;ccedil;tiği yaşlı projelerde bu ara&amp;ccedil;ların sonu&amp;ccedil;ları pek de beklediğimiz&lt;em class="markup--em markup--p-em"&gt;(aslında beklediğimiz)&lt;/em&gt;gibi değil. Yeni nesil &amp;uuml;r&amp;uuml;nlerde ise inanılmaz derecede yardımcı oluyor ve işin başında tedbirler almamızı sağıyor. Nitekim belirli ihlaller &amp;uuml;r&amp;uuml;n&amp;uuml;n &amp;ccedil;ıkmaması i&amp;ccedil;in yeterli.&lt;/p&gt;
&lt;p id="4369" class="graf graf--p graf-after--p"&gt;Bu ama&amp;ccedil;la SonarQube ve SonarLint ara&amp;ccedil;larından yararlanıyoruz. SonarQube, VSTS Continuous Integration hattı &amp;uuml;zerinde devreye girmekte. Konulan kurallara bağlı olaraktan check-in&amp;rsquo;lenmiş kodun Continuous Delivery noktasına ge&amp;ccedil;irilmesine veya ge&amp;ccedil;irilmemesine karar verebiliyor. Eğer sorunlar varsa bunlar i&amp;ccedil;in geri bildirimlerde bulunuyor&lt;em class="markup--em markup--p-em"&gt;(Bug&amp;rsquo;ın sahibine mail ile bildirilmesi gibi)&lt;/em&gt;&amp;nbsp;Aşağıdaki &amp;ouml;rnek ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde aracın var olan &amp;uuml;r&amp;uuml;nlerimizden birisi i&amp;ccedil;in olan rapor ekranını g&amp;ouml;rebilirsiniz&lt;em class="markup--em markup--p-em"&gt;(Şeffaf olmaktan zarar gelmez)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/09/sonar_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p class="graf graf--p"&gt;Burada &amp;ccedil;ok &amp;ouml;nemli bilgiler yer alıyor. &amp;Ouml;rneğin projede toplam 48 bug varmış ve son yapılan geliştirmeler sonrası 13 bug daha dahil olmuş. A, E, D gibi ifadelerle sınav notumuzu g&amp;ouml;rebiliyoruz. Vulnerabilities kısmı kritik. Hatta ilk ele alınan kısım olduğunu ifade edebilirim. Burada &amp;ouml;zellikle kod bazlı injection&amp;rsquo;a sebep olabilecek g&amp;uuml;venlik a&amp;ccedil;ıkları gibi bilgiler yer alıyor.&amp;nbsp;&lt;a class="markup--anchor markup--p-anchor" href="https://www.owasp.org/index.php/Main_Page" target="_blank" rel="nofollow noopener" data-href="https://www.owasp.org/index.php/Main_Page"&gt;OWASP&lt;/a&gt;&amp;nbsp;benzeri standartlar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınarak &amp;ccedil;alıştırılan kurallar da s&amp;ouml;z konusu.&lt;/p&gt;
&lt;blockquote class="graf graf--pullquote"&gt;SonarQube benzeri kod analiz ara&amp;ccedil;larından birisi de Cast&amp;rsquo;tir. Ancak Cast dinamik kod analizi yapar. Yani kodu &amp;ccedil;alışma zamanında denetler ve buna g&amp;ouml;re rapor&amp;nbsp;&amp;uuml;retir.&amp;nbsp;ING Bank b&amp;uuml;nyesinde &amp;ccedil;alıştığım d&amp;ouml;nemlerde Cast aracından yararlanılmaktaydı. Aylık olarak gelen raporlarda temizlenmesi beklenen &amp;ouml;nceliklendirilmiş bulgu listesi yer&amp;nbsp;alırdı.&lt;/blockquote&gt;
&lt;p id="0e96" class="graf graf--p graf-after--pullquote"&gt;Bir de tabii&amp;nbsp;&lt;a class="markup--anchor markup--p-anchor" href="http://wiki.c2.com/?CodeSmellMetrics" target="_blank" rel="nofollow noopener" data-href="http://wiki.c2.com/?CodeSmellMetrics"&gt;kokan kod&lt;em class="markup--em markup--p-em"&gt;(Code Smells)&lt;/em&gt;&lt;/a&gt;&amp;nbsp;durumu vardır. Kod standartlarına pek uyulmadığı durumlarda bir s&amp;uuml;re sonra kodda unutulan iyileştirmelerin sayısı artar. Bu da teknik bor&amp;ccedil; oluşmasına sebebiyet veren etkenlerdendir. Nitekim kodun okunurluğunu zorlaştıran, boat anchor gibi anti-pattern&amp;rsquo;lerin oluşmasına neden olan durumlar vardır&lt;em class="markup--em markup--p-em"&gt;(Daha fazlası i&amp;ccedil;in&amp;nbsp;&lt;/em&gt;&lt;a class="markup--anchor markup--p-anchor" href="https://medium.com/@burakselyum/y%C4%B1llar-ge%C3%A7sede-de%C4%9Fi%C5%9Fmeyen-%C5%9Feyler-var-121ddf9c0476" target="_blank" data-href="https://medium.com/@burakselyum/y%C4%B1llar-ge%C3%A7sede-de%C4%9Fi%C5%9Fmeyen-%C5%9Feyler-var-121ddf9c0476"&gt;&lt;em class="markup--em markup--p-em"&gt;sizi ş&amp;ouml;yle alalım&lt;/em&gt;&lt;/a&gt;&lt;em class="markup--em markup--p-em"&gt;)&amp;nbsp;&lt;/em&gt;Koddan koku geldiğini anlamanın belli semptomları vardır. Bunları kabaca aşağıdaki gibi sıralayabiliriz.&lt;/p&gt;
&lt;ul class="postList"&gt;
&lt;li id="f10a" class="graf graf--li graf-after--p"&gt;Tekrar eden kod par&amp;ccedil;aları&lt;em class="markup--em markup--li-em"&gt;(Duplicated Code)&lt;/em&gt;&lt;/li&gt;
&lt;li id="e0a1" class="graf graf--li graf-after--li"&gt;Anlaşılması g&amp;uuml;&amp;ccedil; uzun metod g&amp;ouml;vdeleri&lt;/li&gt;
&lt;li id="dd30" class="graf graf--li graf-after--li"&gt;Birden &amp;ccedil;ok şeyi yapmaya &amp;ccedil;alışan b&amp;uuml;y&amp;uuml;k sınıflar&lt;em class="markup--em markup--li-em"&gt;(God Object)&lt;/em&gt;&lt;/li&gt;
&lt;li id="97d9" class="graf graf--li graf-after--li"&gt;&amp;Ccedil;ok sayıda parametre&lt;/li&gt;
&lt;li id="8d62" class="graf graf--li graf-after--li"&gt;Birden fazla yerde tekrar eden Switch ifadeleri&lt;/li&gt;
&lt;li id="c09b" class="graf graf--li graf-after--li"&gt;Attığı taş kurbayı &amp;uuml;rk&amp;uuml;tmez felsefesindeki tembel sınıflar&amp;nbsp;&lt;em class="markup--em markup--li-em"&gt;(Lazy Class)&lt;/em&gt;&lt;/li&gt;
&lt;li id="c0c5" class="graf graf--li graf-after--li"&gt;Kodun ne yaptığını anlatan yorum satırları&lt;em class="markup--em markup--li-em"&gt;(Bu kısım her zaman tartışmaya a&amp;ccedil;ık sanırım)&lt;/em&gt;&lt;/li&gt;
&lt;li id="5b9a" class="graf graf--li graf-after--li"&gt;&amp;hellip;&lt;/li&gt;
&lt;/ul&gt;
&lt;p id="9ec1" class="graf graf--p graf-after--li"&gt;Tekrar grafiğe d&amp;ouml;necek olursak kokan kodların temizlenmesi i&amp;ccedil;in &amp;ouml;ng&amp;ouml;r&amp;uuml;len s&amp;uuml;relerin de yer aldığını g&amp;ouml;rebiliriz. Toplamda 13 g&amp;uuml;nl&amp;uuml;k&lt;em class="markup--em markup--p-em"&gt;(tahmini bir s&amp;uuml;re ve aracın bunu hangi tip developer&amp;rsquo;a g&amp;ouml;re verdiğini hen&amp;uuml;z anlayamadım)&lt;/em&gt;&amp;nbsp;bir &amp;ccedil;alışma yapılması gerektiği ifade edilmekte. Diğer yandan bu yaşlı uygulama i&amp;ccedil;in Code Coverage değeri y&amp;uuml;zde sıfır. Yani kodun hi&amp;ccedil; bir kısmı i&amp;ccedil;in test yazılmamış durumda. Bu pek de iyi bir durum değil. Kodun test edilebilir olması &amp;ccedil;ok &amp;ouml;nemli. Raporun bir kısmında da tekrar eden kod bloklarına yer veriliyor. Bu proje &amp;ouml;zelinde kodun %1.8lik kısmı kod tekrarı i&amp;ccedil;ermekte. 188 kod bloğunun tekrar edildiği ifade ediliyor. Issues kısmına geldiğimizde durumla ilgili olarak daha fazla detay g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/09/Sonar_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p class="graf graf--p"&gt;Severity b&amp;ouml;l&amp;uuml;m&amp;uuml;nde yer alan kısımda derecelerine g&amp;ouml;re seviyelendirilmiş bulgular yer alıyor. Tahmin edileceği &amp;uuml;zere Blocker, Critical ve Major kategorisine giren maddeler &amp;ouml;ncelikli olarak değerlendirilmeliler. Aşağıda bu kısımlara ait &amp;ouml;rnekler yer alıyor.&lt;/p&gt;
&lt;p&gt;Blocker &amp;ouml;rneği&lt;em&gt;(1o dakikalık bir efor &amp;ouml;ng&amp;ouml;r&amp;uuml;l&amp;uuml;yor ve kokan kod kategorisinde olup bizi bloklayacak bir problemden bahsediliyor)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/09/sonar_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Critical &amp;ouml;rneği.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/09/sonar_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Major &amp;ouml;rneği.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/09/sonar_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p class="graf graf--p"&gt;Bu bulgulara bakıldığında SonarQube&amp;rsquo;&amp;uuml;n detaylı &amp;ccedil;&amp;ouml;z&amp;uuml;m yollarını ve sorunun olduğu kod dosyalarını g&amp;ouml;rebiliyoruz. T&amp;uuml;m bu kriterlere g&amp;ouml;re bir Quality Gate puanı hesaplanıyor. Şu anki tabloya g&amp;ouml;re kodun g&amp;uuml;venilirliğinin zayıf olduğunu ve bu sebepten Failed stat&amp;uuml;s&amp;uuml;nde kaldığını s&amp;ouml;yleyebiliriz. Yani CI Server bu paketi hi&amp;ccedil; bir şekilde taşıma kapısına g&amp;ouml;ndermeyecek.&lt;/p&gt;
&lt;p class="graf graf--p"&gt;&lt;img src="/image.axd?picture=/2018/11/gandalf_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;SonarQube CI server &amp;uuml;zerinde kurgulanan bir &amp;uuml;r&amp;uuml;n ancak&amp;nbsp;&lt;a class="markup--anchor markup--pullquote-anchor" href="https://sonarcloud.io/about" target="_blank" rel="nofollow noopener" data-href="https://sonarcloud.io/about"&gt;bulut tabanlı bir s&amp;uuml;r&amp;uuml;m&amp;uuml;&lt;/a&gt;&amp;nbsp;de bulunuyor. Hatta&amp;nbsp;&lt;a class="markup--anchor markup--pullquote-anchor" href="https://hub.docker.com/_/sonarqube/" target="_blank" rel="nofollow noopener" data-href="https://hub.docker.com/_/sonarqube/"&gt;Docker imajını&lt;/a&gt;&amp;nbsp;kullanmak da&amp;nbsp;m&amp;uuml;mk&amp;uuml;n.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p class="graf graf--p"&gt;Geliştirici olarak SonarQube sunucusuna gelmeden &amp;ouml;nce de bir takım tedbirler alabiliriz. Bu noktada SonarLint aracından yararlanabileceğimizi ifade edebilirim. SonarQube sunucusu ile de entegre olabildiği i&amp;ccedil;in şirket b&amp;uuml;nyesinde konulan kural setlerine bağlı kalarak geliştirme yapma şansımız var. Ama yoksa bile local geliştirmeler i&amp;ccedil;in varsayılan kural setlerinden yararlanmak m&amp;uuml;mk&amp;uuml;n. Hem Visual Studio hem de Code ile eklenti olarak kullanılabilen bir &amp;uuml;r&amp;uuml;n SonarLint.&lt;/p&gt;
&lt;blockquote class="graf graf--pullquote"&gt;Kendi github(veya benzeri) repository&amp;rsquo;inizdeki deneysel projelerinizde &amp;ccedil;alışırken bile kod kalite standartlarını uygulatmanızı &amp;ouml;neririm. Bu, kaliteli kod &amp;uuml;retme alışkanlığını kazanmak i&amp;ccedil;in &amp;ouml;nemli bir pratiktir.&lt;/blockquote&gt;
&lt;p id="1b2c" class="graf graf--p graf-after--pullquote"&gt;Pek tabii static kod analizi i&amp;ccedil;in geliştirme ortamı ile birlikte gelen &amp;uuml;r&amp;uuml;nler de kullanılabilir. SonarQube, CI hattı ile entegre olabilen merkezi bir statik kod analiz aracı olduğu i&amp;ccedil;in local ara&amp;ccedil;lara g&amp;ouml;re daha fazla tercih edilmekte. Aslında muadil olan &amp;uuml;r&amp;uuml;nler de mutlaka var. &amp;Ccedil;ok fazla ara&amp;ccedil; bağımlısı olmamak da gerekiyor belki ama kod kalitesini arttırmak ve teknik bor&amp;ccedil; y&amp;uuml;k&amp;uuml;n&amp;uuml; azaltmak i&amp;ccedil;in farkındalık yaratacak ara&amp;ccedil;lar bulunduğunu s&amp;ouml;yleyebiliriz. Biz yazılım geliştiricilerin de bu &amp;ccedil;er&amp;ccedil;evede d&amp;uuml;ş&amp;uuml;nmesi gerekiyor. Eğer yeni bir &amp;uuml;r&amp;uuml;n geliştirmeye başlıyorsanız boyutuna g&amp;ouml;re mutlaka statik kod analizine tabii olun derim.&lt;/p&gt;
&lt;p id="9a27" class="graf graf--p graf-after--p graf--trailing"&gt;Farkında olalım, farkında kalalım.&lt;/p&gt;</content>
  <pubDate>2019-01-04 05:03:00</pubDate>
  <slug>teknik-borclari-azaltmak</slug>
  <tags>
    <tag>test-driven-development</tag>
    <tag>code-coverage</tag>
    <tag>quality-assurance</tag>
    <tag>teknik-borç</tag>
    <tag>tecnichal-dept</tag>
    <tag>bugs</tag>
    <tag>vulerabilities</tag>
    <tag>debt</tag>
    <tag>code-smells</tag>
    <tag>dry</tag>
    <tag>yagni</tag>
    <tag>kiss</tag>
    <tag>clean-code</tag>
    <tag>code-metrics</tag>
    <tag>continuos-inspection</tag>
    <tag>continuous-integration</tag>
  </tags>
  <categories>
    <category>DevOps</category>
  </categories>
</post>