<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Stack ve Queue Koleksiyon Sınıfı</title>
  <description>Bugünkü  makalemizde Stack ve Queue koleksiyon sınıflarını incelemeye çalışacağız.  Bir önceki makalemizde bildiğiniz gibi, HashTable koleksiyon sınıfını incelemeştik. Stack ve Queue koleksiyonlarıda, System.Collections isim alanında yer alan ve ortak koleksiyon özelliklerine sahip sınıflardır.</description>
  <content>&lt;p&gt;Değerli&amp;nbsp; Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml;&amp;nbsp; makalemizde Stack ve Queue koleksiyon sınıflarını incelemeye &amp;ccedil;alışacağız.&amp;nbsp; Bir &amp;ouml;nceki makalemizde bildiğiniz gibi, HashTable koleksiyon sınıfını incelemeştik. Stack ve Queue koleksiyonlarıda, System.Collections isim alanında yer alan ve ortak koleksiyon &amp;ouml;zelliklerine sahip sınıflardır. Stack ve Queue koleksiyonları, her koleksiyın sınıfında olduğu gibi, elemanlarını nesne (object) tipinde tutmaktadırlar. Bu koleksiyonların &amp;ouml;zelliği giren-&amp;ccedil;ıkan eleman prensibleri &amp;uuml;zerine &amp;ccedil;alışmalarıdır. Stack koleksiyon sınıfı, LIFO adı verilen, Last In First Out( Son giren ilk &amp;ccedil;ıkar) prensibine gore &amp;ccedil;alışırken, Queue koleksiyon sınıfı ise FIFO yani First In First Out(ilk giren ilk &amp;ccedil;ıkar) prensibine gore &amp;ccedil;alışır.Konuyu daha iyi anlayabilmek i&amp;ccedil;in aşağıdaki şekilleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;img src="/makale/images/mk23_1.gif" alt="" width="367" height="285" border="1" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt;Şekil 1.&amp;nbsp; Stack Koleksiyon Sınıfının &amp;Ccedil;alışma Yapısı&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml;&amp;nbsp; gibi, Stack koleksiyonunda yer alan elemanlardan son girene ulaşmak olduk&amp;ccedil;a kolaydır. Oysaki ilk girdiğimiz elemana ulaşmak i&amp;ccedil;in, bu elemanın &amp;uuml;st&amp;uuml;nde yer alan diğer t&amp;uuml;m elemanları silmemiz gerekmektedir. Queue koleksyion sınıfına gelince; &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;&lt;img src="/makale/images/mk23_2.gif" alt="" width="367" height="285" border="1" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt;Şekil 2.&amp;nbsp; Queue Koleksiyon Sınıfının &amp;Ccedil;alışma Yapısı&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml;&amp;nbsp; gibi Queue koleksiyon sınıfında elemanlar koleksiyona arkadan katılırlar ve ilk giren eleman kuyruktan ilk &amp;ccedil;ıkan eleman olur. &amp;nbsp;Stack ve Queue farklı yapılarda tasarlandıkları i&amp;ccedil;in elemanlarına farklı metodlar ile ulaşılmaktadır. Stack koleksiyon sınıfında, en son giren elemanı elde etmek i&amp;ccedil;in Pop metodu kullanılır. Koleksiyona bir eleman eklerken Push metodu kullanılır. Elbette eklenen eleman en son elemandır ve Pop metodu &amp;ccedil;ağırıldığında elde edilecek olan ilk eleman halini alır. Ancak Pop metodu son giren elemanı verirken bu elemanı koleksiyondan siler. İşte bunun &amp;ouml;n&amp;uuml;ce ge&amp;ccedil;en metod Peek metodudur. Şimdi diyebilirsinizki maden son giren elemanı siliyor Pop metodu o zaman niye kullanıyoruz. Hatırlarsanız, Stack koleksiyonunda, ilk giren elemanı elde etmek i&amp;ccedil;in bu elemanın &amp;uuml;st&amp;uuml;nde yer alan t&amp;uuml;m elemanları silmemiz gerektiğini s&amp;ouml;ylemiştik. İşte bir d&amp;ouml;ng&amp;uuml; yapısında Pop metodu kullanıldığında, ilk giren elemana kadar inebiliriz. Tabi diğer elemanları kaybettikten sonra bunun &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k &amp;ouml;nem taşıyan bir eleman olmasını isteyebiliriz. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Gelelim&amp;nbsp; Queue koleksiyon sınıfının metodlarına.&amp;nbsp; Dequeue metodu ile koleksiyona ilk giren elemanı elde ederiz. Ve bunu yaptığımız anda eleman silinir. Nitekim dequeue metodu pop metodu gibi &amp;ccedil;alışır. Koleksiyona eleman eklemek i&amp;ccedil;in ise, enqueue metodu kullanılır. İlk giren elemanı elde etmek ve silinmemesini sağlamak istiyorsak yine stack koleksiyon sınıfında olduğu gibi, Peek metodunu kullanırız.&amp;nbsp; Bu koleksiyonların en g&amp;uuml;zel yanlarından birisi size leman sayısını belirtmediğiniz takdirde koleksiyonun boyutunu otomatik olarak kendilerinin ayarlamalarıdır.&amp;nbsp; Stack koleksiyon sınıfı, varsayılan olarak 10 elemanlı bir koleksiyon dizisi oluşturur .( Eğer&amp;nbsp; biz eleman sayısını yapıcı metodumuzda belirtmez isek). Eğer eleman sayısı 10&amp;rsquo;u ge&amp;ccedil;erse, koleksiyon dizisinin boyutu otomatik olarak iki katına &amp;ccedil;ıkar. Aynı prensib queue koleksiyon sınıfı i&amp;ccedil;inde ge&amp;ccedil;erli olmakla birlikte, queue koleksiyonu i&amp;ccedil;in varsayılan dizi boyutu 32 elemanlı bir dizidir.&amp;nbsp; Şimdi&amp;nbsp; dilerseniz, basit bir console uygulaması ile bu konuyu anlamaya &amp;ccedil;alışalım. &amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections; /* Uygulamalarımızda koleksiyon sınıflarını kullanabilmek i&amp;ccedil;in Collections isim uzayını kullanmamız gerekir.*/

namespace StackSample1
{
    class Class1
    {
        static void Main(string[] args)
        {
            Stack stc =new Stack(4); /* 4 elemanlı bir Stack koleksiyonu oluşturduk.*/
            stc.Push("Burak");
            /*Eleman eklemek i&amp;ccedil;in Push metodu kullanılıyor.*/
            stc.Push("Selim");
            stc.Push("ŞENYURT");
            stc.Push(27);
            stc.Push(true);
            Console.WriteLine("&amp;Ccedil;ıkan eleman {0}", stc.Pop().ToString());
            /* Pop metodu son giren(kalan) elemanı verirken, aynı zamanda bu elemanı koleksiyon dizisinden siler.*/
            Console.WriteLine("&amp;Ccedil;ıkan eleman {0}", stc.Pop().ToString());
            Console.WriteLine("&amp;Ccedil;ıkan eleman {0}", stc.Pop().ToString());
            Console.WriteLine("------------------");
            IEnumerator dizi = stc.GetEnumerator();
            /* Koleksiyonın elemanlarını IEnumerator aray&amp;uuml;z&amp;uuml;nden bir nesneye aktarıyoruz.*/
            while (dizi.MoveNext()) /* dizi nesnesinde okunacak bir sonraki eleman var olduğu s&amp;uuml;rece işleyecek bir d&amp;ouml;ng&amp;uuml;.*/
            {
                Console.WriteLine("G&amp;uuml;ncel eleman {0}", dizi.Current.ToString());
                /* Current metodu ile dizi nesnesinde yer alan g&amp;uuml;ncel elemanı elde ediyoruz&amp;ccedil;. Bu d&amp;ouml;ng&amp;uuml;y&amp;uuml; &amp;ccedil;alıştırdığımızda sadece iki elemanın dizide olduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Pop metodu sağolsun.*/
            }
            Console.WriteLine("------------------");
            Console.WriteLine("En &amp;uuml;stteki eleman {0}", stc.Peek());
            /* Peek metodu son giren elemanı veya en &amp;uuml;ste kalan elemanı verirken bu elemanı koleksiyondan silmez.*/
            dizi = stc.GetEnumerator();
            while (dizi.MoveNext())
            {
                Console.WriteLine("G&amp;uuml;ncel eleman {0}", dizi.Current.ToString());
                /* Bu durumda yine iki eleman verildiğini Peek metodu ile elde edilen elemanın koleksiyondan silinmediğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.*/
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;em style="mso-bidi-font-style: normal;"&gt;&lt;img src="/makale/images/mk23_3.gif" alt="" width="226" height="173" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;Şekil 3.&amp;nbsp; Stack ile ilgili programın &amp;ccedil;alışmasının sonucu.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Queue &amp;ouml;rneğimiz ise aynı kodlardan oluşuyor sadece metod isimleri farklı.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections;

namespace QueueSample1
{
    class Class1
    {
        static void Main(string[] args)
        {
            Queue qu =new Queue(4);
            qu.Enqueue("Burak");
            /*Eleman eklemek i&amp;ccedil;in Enqueue metodu kullanılıyor.*/
            qu.Enqueue("Selim");
            qu.Enqueue("ŞENYURT");
            qu.Enqueue(27);
            qu.Enqueue(true);
            Console.WriteLine("&amp;Ccedil;ıkan eleman {0}", qu.Dequeue().ToString());
            /* Dequeue metodu ilk giren(en alttaki) elemanı verirken, aynı zamanda bu elemanı koleksiyon dizisinden siler.*/
            Console.WriteLine("&amp;Ccedil;ıkan eleman {0}", qu.Dequeue().ToString());
            Console.WriteLine("&amp;Ccedil;ıkan eleman {0}", qu.Dequeue().ToString());
            Console.WriteLine("------------------");
            IEnumerator dizi = qu.GetEnumerator();
            /* Koleksiyonın elemanlarını IEnumerator aray&amp;uuml;z&amp;uuml;nden bir nesneye aktarıyoruz.*/
            while (dizi.MoveNext()) /* dizi nesnesinde okunacak bir sonraki eleman var olduğu s&amp;uuml;rece işleyecek bir d&amp;ouml;ng&amp;uuml;.*/
            {
                Console.WriteLine("G&amp;uuml;ncel eleman {0}", dizi.Current.ToString());
                /* Current metodu ile dizi nesnesinde yer alan g&amp;uuml;ncel elemanı elde ediyoruz&amp;ccedil;. Bu d&amp;ouml;ng&amp;uuml;y&amp;uuml; &amp;ccedil;alıştırdığımızda sadece iki elemanın dizide olduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Dequeue metodu sağolsun.*/
            }
            Console.WriteLine("------------------");
            Console.WriteLine("En altta kalan eleman {0}", qu.Peek());

            /* Peek metodu son giren elemanı veya en &amp;uuml;ste kalan elemanı verirken bu elemanı koleksiyondan silmez.*/
            dizi = qu.GetEnumerator();
            while (dizi.MoveNext())
            {
                Console.WriteLine("G&amp;uuml;ncel eleman {0}", dizi.Current.ToString());
                /* Bu durumda yine iki eleman verildiğini Peek metodu ile elde edilen elemanın koleksiyondan silinmediğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.*/
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;em style="mso-bidi-font-style: normal;"&gt;&lt;img src="/makale/images/mk23_4.gif" alt="" width="235" height="186" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 4.&amp;nbsp; Queue ile ilgili programın &amp;ccedil;alışmasının sonucu.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Geldik&amp;nbsp; bir makalemizin daha sonuna.&amp;nbsp; Umuyorumki sizlere faydalı olabilecek bilgiler sunabilmişimdir. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2003-12-19 10:00:00</pubDate>
  <slug>Stack-ve-Queue-Koleksiyon-Sınıfı-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>collections</tag>
    <tag>net</tag>
    <tag>stack</tag>
    <tag>queue</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>