<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF - Performans</title>
  <description>Uzun bir aradan sonra tekrar birlikteyiz. Windows Communication Foundation mimarisinin geliştirilmesininin tek amacı, var olan dağıtık mimari modellerini bir çatı altında birleştirmek değildir. Buna paralel olaraktan WCF mimarisi, .Net Remoting, Xml Web Servisleri, WSE(Web Service Enhancements), MSMQ(Microsoft Message Queue), COM+ gibi pek çok dağıtık uygulama geliştirme modelinin çalışma zamanı alt yapısının kolayca oluşturulabilmesinide hedeflemektedir.</description>
  <content>&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Değerli Okurlarım Merhabalar,&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Uzun bir aradan sonra tekrar birlikteyiz. &lt;strong&gt;Windows Communication Foundation&lt;/strong&gt; mimarisinin geliştirilmesininin tek amacı, var olan dağıtık mimari modellerini bir &amp;ccedil;atı altında birleştirmek değildir. Buna paralel olaraktan WCF mimarisi, &lt;strong&gt;.Net Remoting, Xml Web Servisleri,&lt;/strong&gt; &lt;strong&gt;WSE(Web Service Enhancements), MSMQ(Microsoft Message Queue), COM+&lt;/strong&gt; gibi pek &amp;ccedil;ok dağıtık uygulama geliştirme modelinin &amp;ccedil;alışma zamanı alt yapısının kolayca oluşturulabilmesinide hedeflemektedir. Burada dekleratif programlama modelinin benimsenmesinin &amp;ouml;nemli katkısı vardır. Sonu&amp;ccedil;ta geliştiricinin sıklıkla yapmak zorunda kaldığı alt yapı hazırlıklarının &lt;strong&gt; attribute(nitelik)&lt;/strong&gt; veya konfigurasyon bazlı olacak şekilde ayarlanabilmesi son derece avantajlıdır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; Bu a&amp;ccedil;ıdan bakıldığında olayın kilit noktası WCF' in &lt;strong&gt;ABC(AddressBindingContract)&lt;/strong&gt;' sinde yer alan &lt;strong&gt;bağlayıcı tiplerdir(Binding Types)&lt;/strong&gt;. Bilindiği &amp;uuml;zere WCF mimarisi &lt;strong&gt;.Net Framework 3.0&lt;/strong&gt; ile birlikte gelmiştir. Bununla birlikte şu an itibariyle &lt;strong&gt;.Net Framework 3.5&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nde ek yeniliklerde i&amp;ccedil;ermektedir&lt;em&gt;(&amp;Ouml;rneğin &lt;strong&gt;Web Programlama Modeli, WorkFlow Foundation ile Tam Entegrasyon, JSON, AJAX &lt;/strong&gt;desteği gibi)&lt;/em&gt;. Bağlayıcı tiplerin sayısının &amp;ccedil;ok olmasının, geliştiricilerin karar verme noktasındaki işlerini zorlaştırdığıda bir ger&amp;ccedil;ektir. Bu nedenle &amp;ccedil;oğunlukla yardımcı tablolardan veya diagramlardan yararlanılmaktadır. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Yazın geldiği bu sıcak g&amp;uuml;nlerde yazdığımız bu makalemizde, biraz hafiften ilerleyecek ve bu bağlayıcı tiplerden &amp;ccedil;ok sık kullanılanlar arasındaki performans farklarını incelemek i&amp;ccedil;in nasıl bir yol izleyebileceğimizi incelemeye &amp;ccedil;alışacağız. Nitekim senaryoya g&amp;ouml;re se&amp;ccedil;ilebilecek bağlayıcı tiplerin birden fazla olması halinde performans kriterleri &amp;ouml;n plana &amp;ccedil;ıkmaktadır. &amp;Ouml;ncelikli olarak şu anda kullanılan bağlayıcı tipler ve aralarındaki belirgin farklıları g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almakta yarar vardır. İşte aşağıdaki tablo bu farklılıkları dile getirmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk251_2.gif" alt="" width="620" height="509" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi bağlayıcı tiplerin birbirlerine g&amp;ouml;re farklı kullanım sahaları ve senaryoları bulunmaktadır. Buradaki bağlayıcı tiplerde yeterli gelmiyorsa bu durumda &lt;strong&gt;&amp;ouml;zel bağlayıcı tiplerin(Custom Binding Type) &lt;/strong&gt;yazılmasıda tercih edilebilir ki bazı senaryolarda&lt;em&gt;(&amp;ouml;rneğin &lt;strong&gt;Front-End Service &lt;/strong&gt; yazılması gereken durumlar veya&lt;strong&gt; Reply Attack &lt;/strong&gt;gibi vakalarda)&lt;/em&gt; bu gereklidir. Yukarıdaki tablo karar vermek i&amp;ccedil;in tam olarak yeterli değildir. Karar verirken ele alınması gereken sorular arasında &lt;strong&gt;platform bağımsızlık(Interoperability), g&amp;uuml;venilirlik(Relaibiliyu), performans, WS-* şartnameleri(Specifications), g&amp;uuml;venlik(Security)&lt;/strong&gt; gibi pek &amp;ccedil;ok kriter bulunmaktadır. İşte bu noktada da devreye aşağıdaki gibi bir tablo girmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk251_3.gif" alt="" width="584" height="484" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi bu tabloda yer alan kriterlerden yararlanarak hangi bağlayıcı tipin kullanılacağı kolay bir şekilde kararlaştırılabilir. S&amp;ouml;z gelimi &lt;strong&gt;&amp;ccedil;ift y&amp;ouml;nl&amp;uuml;(Duplex)&lt;/strong&gt; iletişimin s&amp;ouml;z konusu olduğu bir vaka varsa, kriterler sınırlıdır. Bir başka deyişle b&amp;ouml;yle bir senaryoda &lt;strong&gt;WsDualHttpBinding&lt;/strong&gt;, &lt;strong&gt;NetTcpBinding&lt;/strong&gt;, &lt;strong&gt; NetNamedPipeBinding&lt;/strong&gt; ve &lt;strong&gt;NetPeerTcpBinding&lt;/strong&gt; tiplerinden birisi kullanılabilir. Ancak karar vermek halen daha zor olabilmektedir. Belkide bir başlangı&amp;ccedil; noktası olsa bu iş daha da kolaylaşabilir. O halde bir akış şeması son derece yerinde olur. Mesela;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk251_1.gif" alt="" width="555" height="312" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ouml;ncelikli olarak başka servisler ile uyumlu bir şekilde konuşulup konuşulmayacağına karar verilerek başlayan bu iş akışının farklı versiyonlarıda bulunmaktadır. Ancak &lt;strong&gt;Juval L&amp;ouml;wy ve Steve Resnic&lt;/strong&gt;' in &amp;ouml;nerdiği &amp;ouml;rnek karar verme adımlarından biriside bu &amp;ccedil;izelgedir. Karar vermede &amp;ouml;nemli olan kriterlerden biriside elbetteki &lt;strong&gt;Performans&lt;/strong&gt;' tır. &amp;Ccedil;oğunlukla ger&amp;ccedil;ek hayat ortamlarında, yazılan uygulamaların ger&amp;ccedil;ek değeri performansları ile &amp;ouml;l&amp;ccedil;&amp;uuml;lmektedir. Bu durumda akla gelen sorulardan ilki vakaya g&amp;ouml;re hangi bağlayıcı tipin en iyi performansı verdiğidir. İşte yazımızın bu b&amp;ouml;l&amp;uuml;m&amp;uuml;nden itibaren 4 temel ve sık kullanılan bağlayıcı tip arasındaki &lt;strong&gt;saniye başına d&amp;uuml;şen &amp;ccedil;ağrı(Calls Per Seconds)&lt;/strong&gt; sayılarını test edeceğimiz &amp;ouml;rnek bir senaryo &amp;uuml;zerinde durmaya &amp;ccedil;alışacağız. Vakamızda &lt;strong&gt;NetTcpBinding&lt;/strong&gt;, &lt;strong&gt;WsHttpBinding&lt;/strong&gt;, &lt;strong&gt;BasicHttpBinding&lt;/strong&gt; ve &lt;strong&gt;NetNamedPipeBinding&lt;/strong&gt; bağlayıcı tipleri ele alınmaktadır. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bilindiği &amp;uuml;zere &lt;strong&gt;NetTcpBinding&lt;/strong&gt; bağlayıcı tipi &amp;ccedil;oğunlukla &lt;strong&gt;intranet&lt;/strong&gt; tabanlı sistemlerde y&amp;uuml;ksek performansı ile g&amp;ouml;z &amp;ouml;n&amp;uuml;ne &amp;ccedil;ıkmaktadır. Ne varki &lt;strong&gt;WS&lt;/strong&gt; destekli servisler ile konuşulması gereken vakalarda &lt;strong&gt;WsHttpBinding&lt;/strong&gt; bağlayıcı tipi sıkılıkla değerlendirilmektedir. T&amp;uuml;m bunların yanında &amp;ouml;zellikle &lt;strong&gt;WS Basic Profile 1.1 &lt;/strong&gt;ve &amp;ouml;ncesi yazılmış &lt;strong&gt;Web Servisleri &lt;/strong&gt;ile olan haberleşmede &lt;strong&gt;BasicHttpBinding&lt;/strong&gt; bi&amp;ccedil;ilmiş kaftandır. Elbette &amp;ouml;yle vakalar vardırki aynı makine &amp;uuml;zerinde koşmakta olan servislerin bir birleriyle haberleşmesi s&amp;ouml;z konusudur. &amp;Ccedil;ok doğal olarak b&amp;ouml;yle bir durumda &lt;strong&gt;NetNamedPipeBinding&lt;/strong&gt; tipi &amp;ouml;n tarafa &amp;ccedil;ıkmaktadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;.Net Framework 3.0 ile birlikte, WCF tarafında geliştirilen servislerinin performans değerlerinin &amp;ouml;l&amp;ccedil;&amp;uuml;lebilmesi amacıyla, ServiceModelEndPoint, ServiceModelOperation, ServiceModelService isimli performans nesneleri(Performance Objects) gelmektedir. Bu değerler Performance Monitor aracı yardımıyla ele alınabilir yada kod tarafından değerlendirilebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Dilerseniz &amp;ouml;rnek &amp;uuml;zerinden devam edelim. &amp;Ouml;ncelikli olarak kendimize bir adet &lt;strong&gt;WCF Servis Library&lt;/strong&gt; geliştiriyor olacağız. &lt;em&gt;(S&amp;ouml;z konusu servis k&amp;uuml;t&amp;uuml;phanesi &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; kullanılarak &lt;strong&gt;.Net Framework 3.5 &lt;/strong&gt;şablonunda geliştirilmiştir.) &lt;/em&gt;Servis tarafına sunulacak olan &lt;strong&gt;s&amp;ouml;zleşme(Contract) &lt;/strong&gt;ve uygulayıcı tipin i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk251_4.gif" alt="" width="185" height="266" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;ITester aray&amp;uuml;z&amp;uuml;(Interface);&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace ProcessLib
{
    [ServiceContract]
    public interface ITester
    {
        [OperationContract]
        string GetString();
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;S&amp;ouml;zleşmeyi uygulayan Tester sınıf(Class);&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace ProcessLib
{
    public class Tester
        :ITester
    {
        #region ITester Members
    
        public string GetString()
        {
            return "".PadRight(1000, 'Q');
        }

        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;Servis s&amp;ouml;zleşmesinin sunduğu operasyon sadece &lt;strong&gt;string&lt;/strong&gt; d&amp;ouml;nd&amp;uuml;ren bir metoda sahiptir. Test sırasında bu metod kullanılaraktan istemci tarafından yapılan y&amp;uuml;kl&amp;uuml; operasyon &amp;ccedil;ağrılarının sonu&amp;ccedil;ları irdelenmeye &amp;ccedil;alışılacaktır. Artık &lt;strong&gt;Host&lt;/strong&gt; uygulamanın yazılmasına başlanabilir. Olayların basit şekilde analiz edilebilmesi i&amp;ccedil;in &lt;strong&gt;Host&lt;/strong&gt; uygulama &lt;strong&gt;Console&lt;/strong&gt; olarak tasarlanmaktadır. Bu uygulama kendi i&amp;ccedil;erisinden 4 farklı &lt;strong&gt;EndPoint&lt;/strong&gt; sunmaktadır. Bunlar vakada yer alan bağlayıcı tiplerin her biri i&amp;ccedil;in ele alınmaktadır. Bu ama&amp;ccedil;la konfigurasyon dosyasının i&amp;ccedil;eriği aşağıdaki gibi geliştirilebilir. &lt;em&gt;(Bu aşamaya gelmeden &amp;ouml;nce Host uygulamaya &lt;strong&gt; System.ServiceModel.dll &lt;/strong&gt;ve WCF Sınıf K&amp;uuml;t&amp;uuml;phanesine ait assembly nesnelerinin eklenmesi gerektiğinide hatırlayalım.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;Host uygulama tarafındaki konfigurasyon (App.Config) i&amp;ccedil;eriği;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;diagnostics performanceCounters="All" /&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service name="ProcessLib.Tester"&amp;gt;
                &amp;lt;endpoint address="net.tcp://localhost:9000/TesterService" binding="netTcpBinding" bindingConfiguration="" name="TesterServiceTcpEndPoint" contract="ProcessLib.ITester" /&amp;gt;
                &amp;lt;endpoint address="http://localhost:9001/TesterService" binding="basicHttpBinding" name="TesterServiceHttpEndPoint" contract="ProcessLib.ITester" /&amp;gt;
                &amp;lt;endpoint address="http://localhost:9002/TesterService" binding="wsHttpBinding" bindingConfiguration="" name="TesterServiceWsHttpEndPoint" contract="ProcessLib.ITester" /&amp;gt;
                &amp;lt;endpoint address="net.pipe://localhost/TesterService" binding="netNamedPipeBinding" bindingConfiguration="" name="TesterServicePipeEndPoint" contract="ProcessLib.ITester" /&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Konfigurasyon dosyasında en &amp;ccedil;ok dikkat &amp;ccedil;eken noktalardan biriside &lt;strong&gt;diagnostics&lt;/strong&gt; isimli elementtir. Bu elementin i&amp;ccedil;erisinde yer alan &lt;strong&gt;performanceCounters&lt;/strong&gt; niteliğine atanan &lt;strong&gt;All&lt;/strong&gt; değeri sayesinde &lt;strong&gt;Performance Monitor &lt;/strong&gt;&amp;uuml;zerinden &amp;ouml;l&amp;ccedil;&amp;uuml;mler yapılabilmektedir. Bu sebepten servis tarafındaki konfigurasyon dosyasında mutlaka bildirilmelidir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;Host Uygulama Kodları;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using ProcessLib;

namespace ServerApp
{
    class Program
    {
        static void Main(string[] args)
        {
            ServiceHost host = new ServiceHost(typeof(Tester));
            host.Open();
            Console.WriteLine("Servis dinlemede\nKapatmak i&amp;ccedil;in bir tuşa basın");
            Console.ReadLine();
            host.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Host&lt;/strong&gt; uygulama 4 farklı &lt;strong&gt; EndPoint&lt;/strong&gt; &amp;uuml;zerinden hizmet vermektedir. T&amp;uuml;m &lt;strong&gt;EndPoint&lt;/strong&gt;' ler &lt;strong&gt; Tester&lt;/strong&gt; isimli servis tipini kullanmaktadır. Buna g&amp;ouml;re 4 farklı tipte istemcinin bu servis &amp;uuml;zerinden hizmet alması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. İstemci tarafını geliştirmeden &amp;ouml;nce gerekli &lt;strong&gt;proxy&lt;/strong&gt; tipinin &amp;uuml;retimi i&amp;ccedil;in &lt;strong&gt;svcutil&lt;/strong&gt; aracından aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer aldığı gibi yararlanılabilir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk251_5.gif" alt="" width="588" height="331" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Artık istemci uygulamanın geliştirilmesine başlanabilir. Buradada &amp;ouml;rneği basit bir şekilde ele alabilmek i&amp;ccedil;in bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınmaktadır. Yine &amp;ouml;nemli olan nokta konfigurasyon dosyasının i&amp;ccedil;eriğidir. D&amp;ouml;rt &lt;strong&gt; EndPoint&lt;/strong&gt; i&amp;ccedil;in testler aynı istemci &amp;uuml;zerinden yapılacağından konfigurasyon i&amp;ccedil;eriği aşağıdaki gibi tasarlanmıştır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;İstemci uygulama konfigurasyon(App.config) i&amp;ccedil;eriği;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8"?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;client&amp;gt;
            &amp;lt;endpoint address="http://localhost:9001/TesterService" binding="basicHttpBinding" contract="ITester" name="ClientHttpEndPoint" /&amp;gt;
            &amp;lt;endpoint address="net.tcp://localhost:9000/TesterService" binding="netTcpBinding" bindingConfiguration="" contract="ITester" name="ClientTcpEndPoint" /&amp;gt;
            &amp;lt;endpoint address="http://localhost:9002/TesterService" binding="wsHttpBinding" bindingConfiguration="" contract="ITester" name="ClientWsHttpEndPoint" /&amp;gt;
            &amp;lt;endpoint address="net.pipe://localhost/TesterService" binding="netNamedPipeBinding" bindingConfiguration="" contract="ITester" name="ClientPipeEndPoint" /&amp;gt;
        &amp;lt;/client&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;İstemci uygulamanın kodları;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace ClientApp
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Bağlayıcı tipi se&amp;ccedil;iniz...");
            Console.WriteLine("NetTcpBinding i&amp;ccedil;in 1");
            Console.WriteLine("BasicHttpBinding i&amp;ccedil;in 2");
            Console.WriteLine("WsHttpBinding i&amp;ccedil;in 3");
            Console.WriteLine("NetNamedPipeBinding i&amp;ccedil;in 4");

            string secim=Console.ReadLine();
            Console.WriteLine("Saya&amp;ccedil; Değerini Giriniz");
            int sayac;
            if (!Int32.TryParse(Console.ReadLine(), out sayac))
                sayac = 100000; 

            switch (secim){
                case "1":
                    TestiBaslat("ClientTcpEndPoint",sayac);
                    break;
                case "2":
                    TestiBaslat("ClientHttpEndPoint", sayac);
                    break;
                case "3":
                    TestiBaslat("ClientWsHttpEndPoint", sayac);
                    break;
                case "4":
                    TestiBaslat("ClientPipeEndPoint", sayac);
                    break;
                default:
                    TestiBaslat("ClientTcpEndPoint", sayac);
                    break;
            }
        }
    
        private static void TestiBaslat(string baglayici,int testSayisi)
        {
            Console.WriteLine("Test Başladı\nDeneme Sayisi {0}\nSe&amp;ccedil;ilen EndPoint {1}",testSayisi,baglayici);
            TesterClient client = new TesterClient(baglayici);
            for (int i = 0; i &amp;lt; testSayisi; i++)
            {
                string result = client.GetString();
            }
            Console.WriteLine("Test tamamlandı...");
            client.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İstemci uygulama &lt;strong&gt;GetString&lt;/strong&gt; isimli metodu sembolik olarak girilen değer kadar &lt;em&gt;(varsayılan olarak &lt;strong&gt;100000(Y&amp;uuml;zbin)&lt;/strong&gt; kere)&lt;/em&gt; &amp;ccedil;ağırmaktadır. Bu bize test i&amp;ccedil;in yeterli s&amp;uuml;reyide vermektedir. Diğer taraftan elbetteki bu test değerleri makinenin &amp;ouml;zelliklerine g&amp;ouml;re farklılık g&amp;ouml;sterecektir. Diğer taraftan bağlayıcı tipler arasındada belirgin farklılıklar olduğu g&amp;ouml;zlenecektir. Bunun en b&amp;uuml;y&amp;uuml;k nedenlerinden birisi ilgili bağlayıcı tipin arka tarafta kullandığı &lt;strong&gt;kodlama(Encoding) &lt;/strong&gt;ve &lt;strong&gt;iletişim protokol&amp;uuml;d&amp;uuml;r(Transport Protocol)&lt;/strong&gt;. &lt;em&gt;(Makalede yer alan &amp;ouml;rneğin testlerinin yapıldığı makine 1 Gb RAM kapasiteli olup, Intel Centrino işlemcilidir. Ayrıca Windows XP Service Pack 2 işletim sistemine sahiptir. Testlerde yer alan istemci ve sunucu uygulama aynı makine &amp;uuml;zerinde koşmaktadır.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Artık testlere başlanabilir. &lt;strong&gt; Performance Counter&lt;/strong&gt; &amp;uuml;zerinden &amp;ccedil;alışma zamanı &amp;ouml;l&amp;ccedil;&amp;uuml;mlerinin yapılabilmesi i&amp;ccedil;in servis uygulamasının &amp;ccedil;alışıyor olması gerekmektedir. Sonrasında ise &lt;strong&gt; Performance&lt;/strong&gt; &lt;strong&gt;Monitor&lt;/strong&gt; kullanılarak &amp;ouml;l&amp;ccedil;&amp;uuml;mler yapılabilir. &lt;strong&gt; Performance&lt;/strong&gt; &lt;strong&gt;Monitor&lt;/strong&gt; uygulamasına komut satırından &lt;strong&gt;perfmon&lt;/strong&gt; yazılarak ulaşılabilir. Servis uygulaması başlatıldığında &lt;strong&gt;Counter&lt;/strong&gt; olarak eklenebilecek se&amp;ccedil;eneklerde ilgili servis uygulamasına ait &amp;ouml;rnek g&amp;ouml;r&amp;uuml;lebilecektir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk251_6.gif" alt="" width="473" height="447" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Biz testlerimizde &lt;strong&gt;ServiceModeService 3.0.0.0&lt;/strong&gt; Performans nesnesinin &lt;strong&gt;Calls Per Second&lt;/strong&gt; isimli sayacını kullanıyor olacağız. Bu saya&amp;ccedil; servise gelen saniye başına operasyon &amp;ccedil;ağrılarını g&amp;ouml;stermekte olup bağlayıcı tiplerin alt yapı hazırlıkları nedeni ile ne kadar yavaş veya ne kadar hızlı olduklarını g&amp;ouml;stermektedir. &lt;strong&gt;Performance Monitor &lt;/strong&gt;sonu&amp;ccedil;ları test programında kullanılan her bağlayıcı tip i&amp;ccedil;in aşağıdaki ekran &amp;ccedil;ıktılarında olduğu gibidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;NetTcpBinding i&amp;ccedil;in Calls Per Second sonu&amp;ccedil;ları;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk251_7.gif" alt="" width="328" height="261" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;BasicHttpBinding i&amp;ccedil;in Calls Per Second sonu&amp;ccedil;ları;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk251_8.gif" alt="" width="329" height="257" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;WsHttpBinding i&amp;ccedil;in Calls Per Second sonu&amp;ccedil;ları;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk251_9.gif" alt="" width="620" height="263" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;NetNamedPipeBinding i&amp;ccedil;in Calls Per Second sonu&amp;ccedil;ları;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk251_10.gif" alt="" width="318" height="267" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;T&amp;uuml;m bunları bir arada değerlendirildiğinde, &lt;strong&gt;saniye başına d&amp;uuml;şen operasyon &amp;ccedil;ağrıları&lt;/strong&gt; i&amp;ccedil;in aşağıdaki grafikte g&amp;ouml;r&amp;uuml;len sonu&amp;ccedil;lar ortaya &amp;ccedil;ıkmaktadır. Bu grafikte tepe noktalarının yaklaşık maksimum ve ortalama değerleri ele alınmaktadır. Bu en azından tahmini olarak, bu d&amp;ouml;rt bağlayıcı tip arasındaki performans farklılıkları hakkında fikir vermektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk251_11.gif" alt="" width="494" height="345" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ccedil;ok doğal olarak aynı makine &amp;uuml;zerinde &amp;ccedil;alışan servisler arası haberleşmede tercih edilen &lt;strong&gt; NetNamedPipeBinding&lt;/strong&gt; i&amp;ccedil;in en y&amp;uuml;ksek değerler ortaya &amp;ccedil;ıkmaktadır. Diğer taraftan &amp;ouml;zellikle &lt;strong&gt;TCP&lt;/strong&gt; ve &lt;strong&gt;Binary&lt;/strong&gt; serileştirme kullanan &lt;strong&gt; NetTcpBinding&lt;/strong&gt; değerleride olduk&amp;ccedil;a y&amp;uuml;ksektir. Bunların yanında &lt;strong&gt; WsHttpBinding&lt;/strong&gt; ger&amp;ccedil;ekten &amp;ccedil;ok d&amp;uuml;ş&amp;uuml;k değerler ile g&amp;ouml;ze &amp;ccedil;arpmaktadır. Bunun en b&amp;uuml;y&amp;uuml;k nedeni &lt;strong&gt;WS&lt;/strong&gt; standartlarına g&amp;ouml;re mesajların hazırlanması sırasında ge&amp;ccedil;en s&amp;uuml;re kayıplarıdır. Tabiki bu kriter tek başına yeterli değildir. S&amp;ouml;z gelimi servisin &lt;strong&gt;Host&lt;/strong&gt; edildiği sunucunun &lt;strong&gt;operasyon başına maliyet(Cost Per Operation)&lt;/strong&gt; gibi performans değerleride g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir&lt;/span&gt;. &lt;span style="font-family: Verdana;"&gt;Bu ve daha pek &amp;ccedil;ok performans testi yapılabilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Buraya kadar anlatılanlar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında sadece bağlayıcı tipler arasındaki farklılıkları analiz etmek i&amp;ccedil;in basit olarak nasıl bir yol izlenebileceği ele alınmıştır. Bunun dışında WCF ile geliştirilen servislerin Xml Web Serviceleri, .Net Remoting veya COM+ ile geliştirilen modellere g&amp;ouml;re belirgin performans farklılıkları olduğu bilinmektedir. Bu konu ile ilişkili daha detaylı bilgiye &lt;a href="http://msdn.microsoft.com/en-us/library/bb310550.aspx"&gt; http://msdn.microsoft.com/en-us/library/bb310550.aspx&lt;/a&gt; ulaşabilirsiniz. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;a href="/makale/images/Performance.rar"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;</content>
  <pubDate>2008-05-20 12:00:00</pubDate>
  <slug>WCF-Performans-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>