<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Entity Framework, Data Services, C# 4.0, Excel ve Komple Bir Uygulama</title>
  <description>Bildiğiniz üzere bir süre önce Visual Studio 2010 ve .Net Framework ürünlerinin RTM sürümleri yayınlandı. Her iki ürünüde sizlerle birlikte , Microsoft PDC 2008 konferanslarından bu yana gerek yazılarımızla, gerek görsel derslerimizle incelemeye çalışıyoruz. Özellikle .Net Framework 4.0 açısından baktığımızda alet, edevat çantamızın dop dolu olduğunun eminimki hepimiz farkındayız.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f4%2fblg181_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bildiğiniz &amp;uuml;zere bir s&amp;uuml;re &amp;ouml;nce &lt;strong&gt;Visual Studio 2010&lt;/strong&gt; ve &lt;strong&gt;.Net Framework &lt;/strong&gt;&amp;uuml;r&amp;uuml;nlerinin &lt;strong&gt;RTM &lt;/strong&gt;s&amp;uuml;r&amp;uuml;mleri yayınlandı. Her iki &amp;uuml;r&amp;uuml;n&amp;uuml;de sizlerle birlikte , &lt;strong&gt;Microsoft PDC 2008 &lt;/strong&gt;konferanslarından bu yana gerek yazılarımızla, gerek g&amp;ouml;rsel derslerimizle incelemeye &amp;ccedil;alışıyoruz. &amp;Ouml;zellikle &lt;strong&gt;.Net Framework 4.0 &lt;/strong&gt;a&amp;ccedil;ısından baktığımızda alet, edevat &amp;ccedil;antamızın dop dolu olduğunun eminimki hepimiz farkındayız.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Paralel programlamadan &lt;/strong&gt;tutun, &lt;strong&gt;WCF Eco System&lt;/strong&gt;'e, &lt;strong&gt;C# 4.0 &lt;/strong&gt;ile birlikte gelen yeniliklerden, &lt;strong&gt;WF 4.0 &lt;/strong&gt;tarafına kadar pek &amp;ccedil;ok noktada ek kabiliyetler, iyileştirmeler ve daha fazlası s&amp;ouml;z konusu. Aslında sizde benim gibi zaman zaman bu alet kutusu i&amp;ccedil;erisindeki par&amp;ccedil;alardan bir kısmını alıp, &amp;ouml;rnek bir uygulamada kullanmaya &amp;ccedil;alışarak vaktinizi değerlendirmeye ve dolayısıyla offlama sorununa &amp;ccedil;are bulmaya &amp;ccedil;alışıyor olabilirsiniz. İşte bende bu d&amp;uuml;ş&amp;uuml;nceler eşliğinde, havanın &amp;ccedil;ok g&amp;uuml;zel olduğu şu bahar aylarında dışarıya &amp;ccedil;ıkıp dolaşma şansını bulmama rağmen, evde kalıp &amp;ouml;rnek bir uygulama geliştirmeye karar verdim. İşte bu yazımız i&amp;ccedil;in alet &amp;ccedil;antası i&amp;ccedil;inden se&amp;ccedil;tiklerimiz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Codeplex &lt;/strong&gt;&amp;uuml;zerinden yayınlanan bir adet &lt;a title="Chinook" href="http://chinookdatabase.codeplex.com/" target="_blank"&gt;Chinook &lt;/a&gt;veritabanı (&lt;a href="https://github.com/lerocha/chinook-database" target="_blank"&gt;github'a taşındı&lt;/a&gt;)&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;,&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Ado.Net Entity Framework 4.0&lt;/strong&gt;,&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;WCF Data Services&lt;/strong&gt;,&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;C# 4.0 Optional, Named Parameters,&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Microsoft.Office.Interop.Excel&lt;/strong&gt;,&lt;/li&gt;
&lt;li&gt;ve tabiki &lt;strong&gt;Visual Studio 2010&lt;/strong&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Gelelim alet &amp;ccedil;antasından &amp;ccedil;ıkarttığımız ara&amp;ccedil;lar ile yapmak istediğimize...&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f4%2fblg181_Dream.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikli olarak &lt;strong&gt;Chinook &lt;/strong&gt;veritabanının i&amp;ccedil;eriğini &lt;strong&gt;Ado.Net Entity Framework &lt;/strong&gt;&amp;uuml;zerinden dış d&amp;uuml;nyaya sunan bir &lt;strong&gt;WCF Data Service &lt;/strong&gt;&amp;ouml;rneğimiz olduğunu d&amp;uuml;ş&amp;uuml;nebiliriz. Bu servisin sunduğu verinin istemcisi olan uygulama ise, talep ettiği i&amp;ccedil;eriği alarak bir &lt;strong&gt;Excel &lt;/strong&gt;uygulamas i&amp;ccedil;ersinde yayınlıyor olacak. Dolayısıyla &lt;strong&gt;Client &lt;/strong&gt;uygulama tarafında &lt;strong&gt;Microsoft.Office.Interop.Excel.dll Assembly&lt;/strong&gt;' ının referans edilmesi gerektiğini şimdiden s&amp;ouml;yleyebiliriz. Bu sayede&lt;strong&gt; Excel API&lt;/strong&gt;' si y&amp;ouml;netimli kod tarafından rahatlıkla konuşabiliyor olacağız. Diğer taraftan istemci uygulamada&lt;strong&gt; C# 4.0&lt;/strong&gt; ile birlikte gelen ve &lt;strong&gt;Office &lt;/strong&gt;uygulamaları ile olan etkileşimde b&amp;uuml;y&amp;uuml;k avantajlar sağlayan &lt;strong&gt;Named ve Optional Parameters &lt;/strong&gt;kavramlarının ele alınacağını da ifade edebiliriz. İlk etapta hedefimiz &amp;ouml;rnek olarak &lt;strong&gt;Track&lt;/strong&gt; tablosundan, istemcinin belirttiği &lt;strong&gt;AlbumId &lt;/strong&gt;değerine sahip olan satırları almak ve bunları &amp;ouml;rnek &lt;strong&gt;Excel &lt;/strong&gt;uygulamasında a&amp;ccedil;ılacak &lt;strong&gt;Workbook &lt;/strong&gt;&amp;uuml;zerindeki bir &lt;strong&gt;Sheet &lt;/strong&gt;i&amp;ccedil;erisinde g&amp;ouml;stermek olacak. Projeye ait &lt;strong&gt;Solution &lt;/strong&gt;i&amp;ccedil;eriği herşey tamamlandığında aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f4%2fblg181_Solution.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;ChinookEntityLayer &lt;/strong&gt;isimli &lt;strong&gt;Class Library&lt;/strong&gt; projesinin geliştirilmesi s&amp;ouml;z konusudur. Bu &lt;strong&gt;Library &lt;/strong&gt;i&amp;ccedil;erisine eklenen &lt;strong&gt;Ado.Net Entity Data Model&lt;/strong&gt; i&amp;ccedil;erisine, &lt;strong&gt;Chinook &lt;/strong&gt;veritabanında yer alan t&amp;uuml;m tabloları ekleyebiliriz. &amp;Ouml;rneğimizde &amp;ccedil;ok basit bir operasyonu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alıyor olsakta, sizlerin bu &amp;ouml;rnekten ilham alarak farklı sorguları da işin i&amp;ccedil;erisine katacağınıza eminim&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; &lt;strong&gt;ChinookServices&lt;/strong&gt; isimli &lt;strong&gt;WCF Service Application &lt;/strong&gt;tipinden olan uygulama, i&amp;ccedil;erdiği &lt;strong&gt;WCF Data Service &lt;/strong&gt;sayesinde &lt;strong&gt;Chinook &lt;/strong&gt;veritabanına ait &lt;strong&gt;Entity &lt;/strong&gt;koleksiyonlarını dış ortama sunmaktadır.&lt;/p&gt;
&lt;p&gt;Dolayısıyla bu uygulama, &lt;strong&gt;ChinookEntityLayer &lt;/strong&gt;isimli sınıf k&amp;uuml;t&amp;uuml;phanesini de referans etmelidir. Diğer yandan &amp;ouml;nemli olan noktalardan birisi de, &lt;strong&gt;Entity Context &lt;/strong&gt;nesnesi tarafından kullanılan &lt;strong&gt;Connection String &lt;/strong&gt;bilgisidir. &lt;strong&gt;ChinookEntityLayer &lt;/strong&gt;i&amp;ccedil;erisindeki&lt;strong&gt; app.config &lt;/strong&gt;dosyasına eklenen&lt;strong&gt; Connection String&lt;/strong&gt; i&amp;ccedil;eriğinin aslında &lt;strong&gt;ChinookServices &lt;/strong&gt;isimli &lt;strong&gt;WCF Service&lt;/strong&gt; uygulamasının &lt;strong&gt;web.config&lt;/strong&gt; dosyası i&amp;ccedil;erisinde olması gerekmektedir. &amp;Ccedil;&amp;uuml;nk&amp;uuml; &amp;ccedil;alışma zamanında oluşturulan &lt;strong&gt;Context &lt;/strong&gt;nesne &amp;ouml;rneğinin yer aldığı proje burasıdır ve bu sebepten &amp;ccedil;alışma zamanı &lt;strong&gt;Connection String &lt;/strong&gt;bilgisini&lt;strong&gt; Web.config&lt;/strong&gt; i&amp;ccedil;erisinde arayacaktyır.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0"?&amp;gt;
&amp;lt;configuration&amp;gt;
  &amp;lt;connectionStrings&amp;gt;
    &amp;lt;add name="ChinookEntities" connectionString="metadata=res://*/ChinookModel.csdl| res://*/ChinookModel.ssdl|res://*/ChinookModel.msl; provider=System.Data.SqlClient;provider connection string="Data Source=.; Initial Catalog=Chinook;Integrated Security=True; MultipleActiveResultSets=True"" providerName="System.Data.EntityClient" /&amp;gt;
  &amp;lt;/connectionStrings&amp;gt;
  &amp;lt;system.web&amp;gt;
    &amp;lt;compilation debug="true" targetFramework="4.0" /&amp;gt;
  &amp;lt;/system.web&amp;gt;
  &amp;lt;system.serviceModel&amp;gt;
    &amp;lt;serviceHostingEnvironment aspNetCompatibilityEnabled="true" /&amp;gt;
  &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;WCF Service uygulaması i&amp;ccedil;erisinde yer alan ChinookDataService isimli WCF Data Service tipinden olan &amp;ouml;rneğin kod i&amp;ccedil;eriği ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Data.Services;
using System.Data.Services.Common;
using ChinookEntityLayer;

namespace ChinookServices
{
    public class ChinookDataService 
        : DataService&amp;lt;ChinookEntities&amp;gt;
    {
        public static void InitializeService(DataServiceConfiguration config)
        {
            config.SetEntitySetAccessRule("*", EntitySetRights.AllRead);
            config.DataServiceBehavior.MaxProtocolVersion = DataServiceProtocolVersion.V2;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Buna g&amp;ouml;re &lt;strong&gt;Chinook &lt;/strong&gt;veritabanı i&amp;ccedil;erisindeki &lt;strong&gt;Entity &lt;/strong&gt;koleksiyonlarının tamamı sadece okunabilir olacak şekilde dış d&amp;uuml;nyaya sunulmaktadır.&lt;/p&gt;
&lt;p&gt;Artık istemci tarafının geliştirilmesine başlanabilir. &lt;strong&gt;Console &lt;/strong&gt;uygulaması tipinden olan istemci tarafına&lt;em&gt;(Neden Console şeklinde tasarladığımı l&amp;uuml;tfen sormayın&amp;nbsp;&lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt;)&lt;/em&gt; &amp;ouml;ncelikle &lt;strong&gt;ChinookDataService &lt;/strong&gt;isimli &lt;strong&gt;WCF Data Service&lt;/strong&gt; &amp;ouml;rneğinin referans edilmesi gerekmektedir. S&amp;ouml;z konusu servis ile istemci uygulama aynı &lt;strong&gt;Solution &lt;/strong&gt;i&amp;ccedil;erisinde yer aldığında &lt;strong&gt;Add Service Reference&lt;/strong&gt; se&amp;ccedil;eneğini aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi kullanmak yeterlidir.&lt;em&gt;(Hatırlanacağı &amp;uuml;zere &lt;strong&gt;Astoria &lt;/strong&gt;kod adlı&lt;strong&gt; Ado.Net Data Service&lt;/strong&gt;' lerin&lt;strong&gt; Visual Studio 2008&lt;/strong&gt; &amp;uuml;zerinden kullanılan s&amp;uuml;r&amp;uuml;mlerinde, &lt;strong&gt;Add Service Reference &lt;/strong&gt;se&amp;ccedil;eneği kullanılamamktaydı. Bunun i&amp;ccedil;in &lt;strong&gt;datasvcutil &lt;/strong&gt;aracından yararlanmamız gerekiyordu. Tabiki, Data Service i&amp;ccedil;in Add Service Reference desteği &lt;strong&gt;Visual Studio 2010&lt;/strong&gt; i&amp;ccedil;erisinde mevcut)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f4%2fblg181_ServiceReference.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Artık istemci uygulama geliştirilmeye başlanabilir ki belki de işin en heyacanlı kısmı burasıdır &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; İşte Console uygulamamız ait kod i&amp;ccedil;eriğimiz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Linq;
using ClientApp.ChinookDataServiceReference;
using Excel = Microsoft.Office.Interop.Excel;

namespace ClientApp
{
    class Program
    {
        static void Main(string[] args)
        {
            // WCF Data Service &amp;ouml;rneğini kullanabileceğimi şekilde ChinookEntities nesne &amp;ouml;rneği oluşturulur.
            // URI Satırı s&amp;ouml;z konusu WCF Data Service &amp;ouml;rneğini işaret etmektedir.
            ChinookEntities entities = new ChinookEntities(new Uri("http://localhost:4071/ChinookDataService.svc/"));
            
            // Kullanıcıdan AlbumId bilgisi istenir
            Console.WriteLine("Album Id?");
            int albumID;
            if(!Int32.TryParse(Console.ReadLine(), out albumID)) //Eğer d&amp;ouml;n&amp;uuml;ş&amp;uuml;m başarılı değilse 1 numaralı AlbumId değeri baz alınır
                albumID=1;

            // Sorgu c&amp;uuml;mlesi
            // AlbumId değerine g&amp;ouml;re Track &amp;ouml;rnekleri &amp;ccedil;ekilir. Bu işlem sırasında Genre Entity &amp;ouml;rneklerine de ihtiyacımız olduğundan Expand metodu ile gerekli &amp;ccedil;ağrı yapılır
            var result = from t in entities.Tracks.Expand("Genre")
                         where t.AlbumId == albumID
                         orderby t.Name
                         select t;

            // Bir Excel Application nesnesi &amp;ouml;rneklenir.
            Excel.Application excApp = new Excel.Application();
            excApp.Visible = true; // Excel uygulamasının g&amp;ouml;r&amp;uuml;nebilir olacağı belirtilir
            excApp.Workbooks.Add(); // Yeni bir Workbook eklenir

            // S&amp;uuml;tun başlıkları set edilmeye başlanır
            excApp.get_Range("A1").Value = "Track Name";
            excApp.get_Range("B1").Value = "Genre";
            excApp.get_Range("C1").Value = "Composer";
            excApp.get_Range("D1").Value = "Milliseconds";
            // Etkin olan Sheet adı belirlenir
            excApp.ActiveSheet.Name = "Track List for Album Id 1";

            // Elde edilen veri k&amp;uuml;mesindeki sonu&amp;ccedil;lar Sheet i&amp;ccedil;erisindeki ilgili h&amp;uuml;crelere yazdırlır
            int rowNumber = 2;
            foreach (var t in result)
            {
                excApp.get_Range(String.Format("A{0}", rowNumber.ToString())).Value = t.Name;
                excApp.get_Range(String.Format("B{0}", rowNumber.ToString())).Value = t.Genre.Name;
                excApp.get_Range(String.Format("C{0}", rowNumber.ToString())).Value = t.Composer;
                excApp.get_Range(String.Format("D{0}", rowNumber.ToString())).Value = t.Milliseconds;
                rowNumber++;
            }

            // T&amp;uuml;m s&amp;uuml;tunların uzunlukları i&amp;ccedil;eriklerine g&amp;ouml;re otomatik olarak genişletilir
            for (int i = 1; i &amp;lt; 5; i++)
            {
                excApp.Columns[i].AutoFit();
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Console &lt;/strong&gt;uygulaması kullanıcıdan bir &lt;strong&gt;AlbumId &lt;/strong&gt;değeri istemektedir. S&amp;ouml;z konusu &lt;strong&gt;AlbumId &lt;/strong&gt;değerine g&amp;ouml;re &lt;strong&gt;WCF Data Service &lt;/strong&gt;&amp;ouml;rneğine bir talep g&amp;ouml;nderilir ve bu talebin karşılığında d&amp;ouml;nen sonu&amp;ccedil; k&amp;uuml;mesi değerlendirilerek &lt;strong&gt;Excel &lt;/strong&gt;i&amp;ccedil;erisine alınması sağlanır. Uygulamanın &amp;ccedil;alışma zamanına ait &amp;ouml;rnek ekran &amp;ccedil;ıktılarından birisi aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f4%2fblg181_Runtime1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ta taaaaaa!!! &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt; Bence g&amp;uuml;zel bir &amp;ouml;rnek oldu. Ancak daha da geliştirilmesi lazım. Her şeyden &amp;ouml;nce &lt;strong&gt;Console &lt;/strong&gt;tipinde olan istemci uygulamadan kurtulmak ve g&amp;ouml;rsel aray&amp;uuml;ze sahip bir &amp;ouml;rnek &amp;uuml;zerinden ilermelek daha yararlı olacaktır. Bu size bir &amp;ouml;dev olabilir mesela. Yazımızı sonlandırmadan &amp;ouml;nce benim sizlere bir ka&amp;ccedil; sorum olacak;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;Ouml;rnekte &lt;strong&gt;C# 4.0&lt;/strong&gt; ile birlikte gelen hangi yeni &amp;ouml;zellikler kullanılmıştır? &lt;em&gt;(Daha &amp;ouml;nceki yazılarımızda değindik)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;WCF Data Service&lt;/strong&gt; &amp;ouml;rneğine doğru g&amp;ouml;nderilen sorgu sonucunda elde edilen i&amp;ccedil;eriğe g&amp;ouml;re, &lt;strong&gt;Excel &lt;/strong&gt;&amp;uuml;zerinde oluşturulacak s&amp;uuml;tun adları dinamik olarak belirlenebilir mi?&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;WCF Data Service &lt;/strong&gt;i&amp;ccedil;erisinde kullanılan &lt;strong&gt;DataServiceProtocolVersion.V2&lt;/strong&gt; değeri ne anlama gelmektedir? &lt;em&gt;(Daha &amp;ouml;nceki yazılarımızda değindik)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Aynı &amp;ouml;rnek i&amp;ccedil;in şu tip bir sorguyu deneyip &lt;strong&gt;Excel &lt;/strong&gt;&amp;ccedil;ıktısını almaya &amp;ccedil;alışabilir misiniz? &lt;strong&gt;"Composer bazlı Track sayıları?"&lt;br /&gt;&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;Uygulamanın sonunda &lt;strong&gt;Excel &lt;/strong&gt;tablosunun otomatik olarak kayıt edilmesini sağlayabilir misiniz?&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;WCF Eco System&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &lt;strong&gt;Data Service&lt;/strong&gt; dışındaki t&amp;uuml;rler nelerdir? Bu servis t&amp;uuml;rleri hangi ama&amp;ccedil;larla kullanılmaktadır? &lt;em&gt;(Daha &amp;ouml;nceki yazılarımızda değindik)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;İstemci uygulamaya ait exe dosyasının &amp;ccedil;ıkartıldığı yerde &lt;strong&gt;Excel &lt;/strong&gt;ile ilişkili bir &lt;strong&gt;Assembly &lt;/strong&gt;bulunmamaktadır. Neden olduğunu bulup a&amp;ccedil;ıklayınız?&lt;em&gt; (Daha &amp;ouml;nceki yazılarımızda değindik)&lt;/em&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f4%2fServiceBasedExcel_RTM.rar"&gt;ServiceBasedExcel_RTM.rar (213,11 kb)&lt;/a&gt; &lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 Ultimate RTM s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde geliştirilmiş ve test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-08-26 04:50:00</pubDate>
  <slug>Entity-Framework-Data-Services-C-40-Excel-ve-Komple-Bir-Uygulama</slug>
  <tags>
    <tag>wcf-data-services</tag>
    <tag>adonet-entity-framework-40</tag>
    <tag>chinook</tag>
    <tag>c#-40</tag>
    <tag>optional-and-named-parameters</tag>
    <tag>dynamic</tag>
    <tag>excel</tag>
    <tag>office-interop</tag>
    <tag>visual-studio-2010</tag>
  </tags>
  <categories>
    <category>C# 4.0</category>
    <category>Entity Framework</category>
    <category>WCF Data Services</category>
  </categories>
</post>