<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Büyük Nesneler(Large Objects) ile Çalışmak</title>
  <description>Veritabanı programcılığında zaman zaman büyük nesneler (large objects) ile çalışmak zorunda kalabiliriz. Görüntü, ses, resim, text dökümanı, çalıştırılabilir uygulamalar gibi dosyalar bir veritabanı için büyük nesne (large objects) olabilecek kaynaklardır. Bu gibi dosyaların veritabanı üzerinde alanlar (fields) içerisinde saklanabilmesi bazı özel veritabanı türleri ile mümkün olabilmektedir. Sql Server temel olarak büyük nesneleri iki kategoriye ayırmaktadır.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Veritabanı programcılığında zaman zaman b&amp;uuml;y&amp;uuml;k nesneler (large objects) ile &amp;ccedil;alışmak zorunda kalabiliriz. G&amp;ouml;r&amp;uuml;nt&amp;uuml;, ses, resim, text d&amp;ouml;k&amp;uuml;manı, &amp;ccedil;alıştırılabilir uygulamalar gibi dosyalar bir veritabanı i&amp;ccedil;in b&amp;uuml;y&amp;uuml;k nesne (large objects) olabilecek kaynaklardır. Bu gibi dosyaların veritabanı &amp;uuml;zerinde alanlar (fields) i&amp;ccedil;erisinde saklanabilmesi bazı &amp;ouml;zel veritabanı t&amp;uuml;rleri ile m&amp;uuml;mk&amp;uuml;n olabilmektedir. Sql Server temel olarak b&amp;uuml;y&amp;uuml;k nesneleri iki kategoriye ayırmaktadır.&lt;/p&gt;
&lt;p&gt;BLOBs adı verilen ikili formatta b&amp;uuml;y&amp;uuml;k nesneler &lt;strong&gt;(Binary Large Objects - BLOBs)&lt;/strong&gt; ve karakter tabanlı b&amp;uuml;y&amp;uuml;k nesneler &lt;strong&gt;(Character Large Objects - CLOBs)&lt;/strong&gt;. Bununla birlikte Sql Server 2005 ile b&amp;uuml;y&amp;uuml;k nesneleri saklamak i&amp;ccedil;in gelen yeni veri t&amp;uuml;rleride vardır. Bunlarıda genel olarak değer t&amp;uuml;r&amp;uuml;nden b&amp;uuml;y&amp;uuml;k nesneler &lt;strong&gt;(Value Types Large Objects - VTLOs)&lt;/strong&gt; olarak adlandırılmaktadır. Aşağıdaki tabloda Sql Server 2000 ve 2005 s&amp;uuml;r&amp;uuml;mlerinde ge&amp;ccedil;erli olan b&amp;uuml;y&amp;uuml;k nesne t&amp;uuml;rleri (Large Objects Types) listelenmektedir.&lt;/p&gt;
&lt;table id="table87" style="border-collapse: collapse;" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td align="center"&gt;&lt;strong&gt; Nesne &amp;Ccedil;eşidi&lt;/strong&gt;&lt;/td&gt;
&lt;td align="center"&gt;&lt;strong&gt; Sql Server 2000 Veri T&amp;uuml;r&amp;uuml;&lt;/strong&gt;&lt;/td&gt;
&lt;td align="center"&gt;&lt;strong&gt; Sql Server 2005 Veri T&amp;uuml;r&amp;uuml;&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;BLOBs (Binary Large Objects)&lt;/td&gt;
&lt;td&gt;image ( maksimum 2 Gb)&lt;/td&gt;
&lt;td&gt;image ( maksimum 2 Gb)&lt;br /&gt; &lt;strong&gt;varbinary(max)&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;CLOBs (Character Large Objects)&lt;/td&gt;
&lt;td&gt;text (maksimum 2 Gb, non-unicode)&lt;br /&gt; ntext (maksimum 1 Gb, unicode)&lt;/td&gt;
&lt;td&gt;text (maksimum 2 Gb, non-unicode)&lt;br /&gt; &lt;strong&gt;varchar(max)&lt;/strong&gt;&lt;br /&gt; ntext (maksimum 1 Gb, unicode)&lt;br /&gt; &lt;strong&gt;nvarchar(max)&lt;/strong&gt;&lt;br /&gt; &lt;strong&gt;xml&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Tablodan g&amp;ouml;rebileceğiniz gibi Sql Server 2005 ile birlikte gelen &amp;uuml;&amp;ccedil; yeni b&amp;uuml;y&amp;uuml;k nesne (large object) t&amp;uuml;r&amp;uuml; vardır. &lt;strong&gt;Varbinary(max)&lt;/strong&gt; t&amp;uuml;r&amp;uuml; Sql Server 2000' deki image t&amp;uuml;r&amp;uuml;n&amp;uuml;n benzeridir. Benzer şekilde &lt;strong&gt;varchar(max)&lt;/strong&gt; ve &lt;strong&gt;nvarchar(max) &lt;/strong&gt;t&amp;uuml;rleride sırasıyla text ve ntext veri t&amp;uuml;rlerinin yeni karşılıklarıdır. Sql Server 2005' in image, text, ntext gibi veri t&amp;uuml;rlerini desteklemeye devam edeceği ancak yeni Sql s&amp;uuml;r&amp;uuml;mlerinde artık bunları kaldıracağına dair bir takım bilgiler mevcuttur. Bu nedenle Sql Server 2005 &amp;uuml;zerinde yer verilen image, text ve ntext veri t&amp;uuml;rlerinin geriye doğru uyumluluğu sağlamak amacıyla tutulduğunu d&amp;uuml;ş&amp;uuml;nebiliriz. Yeni eklenen VTLOs' ların en b&amp;uuml;y&amp;uuml;k &amp;ouml;zelliklerinden birisi, b&amp;uuml;y&amp;uuml;k nesne i&amp;ccedil;in belirli bir boyut bildirilebilmesidir. Dolayısıyla varbinary(3000) gibi bir tanımlama yapabiliriz. S&amp;ouml;z konusu yeni t&amp;uuml;rleri birleştirebilir (concatenate), sorgulayabilir, hatta sp' lere parametre olarak ge&amp;ccedil;irebiliriz. Bu imkanlar d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde, VLTOs eski b&amp;uuml;y&amp;uuml;k nesne t&amp;uuml;rlerine nazaran &amp;ouml;nemli avantajlar i&amp;ccedil;ermektedir.&lt;/p&gt;
&lt;p&gt;Dikkat edersek, b&amp;uuml;y&amp;uuml;k nesnelerin (large objects) kapladığı alanlar 2 Gb seviyesine kadar &amp;ccedil;ıkmaktadır. Acaba bir veritabanı sistemi i&amp;ccedil;erisinde bu denli b&amp;uuml;y&amp;uuml;k alanlar i&amp;ccedil;in yer ayrılabilmesinin avantajları ve dezavantajları neler olabilir? &amp;Ouml;rneğin bir elektronik ticaret sitesini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. Kullanıcının etkileşimde bulunduğu &amp;uuml;r&amp;uuml;nlere ait resim bilgileri &amp;ccedil;oğunlukla web sunucusu &amp;uuml;zerindeki fiziki bir adreste tutulur. Sayfada resmin g&amp;ouml;r&amp;uuml;nebilmesi ve en &amp;ouml;nemlisi bulunduğu tablo satırı ile ilişkilendirilmesi i&amp;ccedil;in &amp;ccedil;oğunlukla resmin sanal yolu (virtual path) bir field i&amp;ccedil;erisinde saklanır. Bu son derece mantıklıdır. Nitekim bu tip sitelerde yer alan resimlerin boyutları genellikle &amp;ccedil;ok yer tutmayacak ve tarayıcı pencerelerine hızla y&amp;uuml;klenebilecek seviyede olurlar. Bu a&amp;ccedil;ıdan bakıldığında resimleri bu şekilde yol bilgileri ile tutmak son derece mantıklıdır.&lt;/p&gt;
&lt;p&gt;Lakin bazı sistemlerde tutulan resim bilgileri &amp;ccedil;ok y&amp;uuml;ksek boyutlu olabilir ve aynı zamanda tutulan i&amp;ccedil;eriğin g&amp;uuml;venliği &amp;ouml;nem arz edebilir. &amp;Ouml;rneğin, y&amp;uuml;ksek boyutlu ve sık&amp;ccedil;a değişebilen CAD &amp;ccedil;izimlerinin tutulduğu bir sistem olduğunu d&amp;uuml;ş&amp;uuml;nelim. Bu &amp;ccedil;izimler sıklıkla g&amp;uuml;ncelenebileceği gibi belirli kişisel dışında g&amp;ouml;r&amp;uuml;lmemesi istenebilir. Ayrıca veritabanın yedeğinin alındığı durumlarda CAD &amp;ccedil;izimlerininde veritabanı ile birlikte taşınması zor olacağından, bu &amp;ccedil;izimlerin satır dahilinde tutulması ve s&amp;ouml;z konusu tablo satırları i&amp;ccedil;erisinde taşınabilir olması &amp;ouml;nemli bir avantaj sağlayacaktır. Her iki &amp;ouml;rnek senaryo g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında dikkat edilmesi gereken bir takım ortak noktalar oluştuğu a&amp;ccedil;ık&amp;ccedil;a g&amp;ouml;zlemlenebilir. &amp;Ouml;nemli olan hususlar verinin &lt;strong&gt;taşınma kolaylığı&lt;/strong&gt;, &lt;strong&gt;g&amp;uuml;venliği&lt;/strong&gt; ve &lt;strong&gt; nesnel olarak kapladığı alanı &lt;/strong&gt;dır.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin belirli kullanıcıların asla g&amp;ouml;rmemesi gereken b&amp;uuml;y&amp;uuml;k nesneler olduğunu d&amp;uuml;ş&amp;uuml;necek olursak, bunları veritabanı sisteminin g&amp;uuml;venliğine emanet etmek son derece mantıklı bir se&amp;ccedil;im olacaktır. Diğer yandan b&amp;uuml;y&amp;uuml;k nesneler veritabanının boyutunu arttıracak ve erişim hızlarını eğer kodlamada &amp;ccedil;eşitli taktikler uygulamassak yavaşlatacaktır. Genellike 8000 byte' ın &amp;uuml;zerine &amp;ccedil;ıkılması halinde b&amp;uuml;y&amp;uuml;k nesneleri okurken veya veritabanına doğru yazarken par&amp;ccedil;a par&amp;ccedil;a işlemek uygulama performansını doğrudan olumlu y&amp;ouml;nde etkileyecek bir &amp;ccedil;&amp;ouml;z&amp;uuml;md&amp;uuml;r. &amp;Ouml;yleki &amp;ccedil;oğu istemci, &amp;ccedil;ok y&amp;uuml;ksek kapasiteli nesneleri belleğe almakta sorunlar ile karşılaşabilir.&lt;/p&gt;
&lt;table id="table88" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td valign="top" width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;&amp;Ouml;zellikle boyutu 8000 byte' ın &amp;uuml;zerinde olan b&amp;uuml;y&amp;uuml;k nesneleri okurken veya yazarken par&amp;ccedil;alı olarak ele almak uygulama performansını arttırıcı bir etkendir. Nitekim uygulamanın &amp;ccedil;alıştığı sistem her zaman &amp;ccedil;ok y&amp;uuml;ksek boyuta sahip nesneleri taşıyabilecek kapasitede donanıma sahip olamayabilir. Bu konu ile ilgili olarak resim dosyalarının sql server 2000 sisteminde &lt;strong&gt; &lt;a href="http://www.bsenyurt.com/MakaleGoster.aspx?ID=45"&gt;nasıl okunacağı&lt;/a&gt; &lt;/strong&gt;ve &lt;strong&gt;&lt;span style="color: #ff0000;"&gt; &lt;a href="http://www.bsenyurt.com/MakaleGoster.aspx?ID=44"&gt;nasıl yazılacağına&lt;/a&gt;&lt;/span&gt;&lt;/strong&gt; dair bilgi veren makaleleri takip etmenizi &amp;ouml;neririm.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Microsoft.Net 2.0, Sql Server tabloları &amp;uuml;zerindeki b&amp;uuml;y&amp;uuml;k nesneleri (large objects) ele alabilmek i&amp;ccedil;in &lt;strong&gt;SqlDataReader&lt;/strong&gt; tipine iki yeni metod daha ilave etmiştir. &lt;strong&gt;GetSqlBytes&lt;/strong&gt; ve &lt;strong&gt;GetSqlChars&lt;/strong&gt; isimli metodlar, bir tablo satırındaki herhangibir b&amp;uuml;y&amp;uuml;k nesne (large object) alanını okumak i&amp;ccedil;in gerekli &lt;strong&gt;stream&lt;/strong&gt;' leri kolayca elde etmemizi sağlarlar. Biz bu makalemizde bir &amp;ouml;rnek &amp;uuml;zerinden giderek Sql Server 2005 &amp;uuml;zerinde yeni veri t&amp;uuml;rleri ile b&amp;uuml;y&amp;uuml;k nesnelerin nasıl saklanabileceğini ve okunabileceğini kısaca incemeleye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;Okuma işlemlerini ger&amp;ccedil;ekleştirirken SqlDataReader nesnesi bize etkin bir performans ve verim sunmaktadır. SqlDataReader nesnesinin okuma işlemlerinde hızlı olduğunu zaten biliyoruz. Bununla birlikte &lt;strong&gt;SqlCommand&lt;/strong&gt; sınıfının &lt;strong&gt; CommandBehaviour&lt;/strong&gt; numaralandırıcısının (enum) değerinin &lt;strong&gt; SequentialAccess&lt;/strong&gt; olması halinde, okunan satır i&amp;ccedil;erisindeki b&amp;uuml;y&amp;uuml;k nesnelerin (large objects) bir akım (stream) &amp;uuml;zerinden ister par&amp;ccedil;a par&amp;ccedil;a ister tamamen okunabilmesi sağlanmaktadır ki buda b&amp;uuml;y&amp;uuml;k nesnelerin okunabilmesinin en hızlı yoludur. Normal şartlarda bir satırdan veri okurken SequentialAccess davranışının verilmesi, b&amp;uuml;y&amp;uuml;k nesne alanları s&amp;ouml;z konusu olduğunda &amp;ccedil;ok &amp;ouml;nemlidir. &amp;Ccedil;&amp;uuml;nk&amp;uuml; bir SqlDataReader nesne &amp;ouml;rneği &amp;ccedil;alışma zamanında genellikle select sorgusundan d&amp;ouml;nen satırları uygulamanın &amp;ccedil;alıştığı sistemdeki belleğe anlık olarak okur ve sonraki satırdan devam eder. Dolayısıyla b&amp;uuml;y&amp;uuml;k nesne(large object) i&amp;ccedil;eren bir satırın tamamını belleğe almak performans kaybına neden olabilir. SequentialAccess davranışı sayesinde, satırın tamamının belleğe alınmasının &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ilebilir. &amp;Ccedil;&amp;uuml;nk&amp;uuml; alanların i&amp;ccedil;eriğinin ardışıl olarak (sequential) okunabilmesine imkan sağlanır.&lt;/p&gt;
&lt;p&gt;Gelelim Framework 2.0 ile gelen yeni metodları nasıl kullanacağımıza. Aşağıdaki akış şeması tipik olarak b&amp;uuml;y&amp;uuml;k nesne (large object) i&amp;ccedil;eren bir alanın nasıl okunabileceğini &amp;ouml;zetlemektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk167_1.gif" alt="" width="573" height="461" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak yukarıdaki akış şemasında belirtilen b&amp;uuml;y&amp;uuml;k nesne (large object) okuma işlemini basit bir &amp;ouml;rnek kod &amp;uuml;zerinden incelemeye &amp;ccedil;alışalım. Senaryo olarak Sql Server 2005 ile birlikte gelen Production isim alanında yer alan Product ve ProductPhoto tablolarını ele alacağız. Product tablosunda &amp;uuml;r&amp;uuml;n bilgileri yer almaktadır. ProductPhoto tablosunda ise bu &amp;uuml;r&amp;uuml;nlere ilişkin resim bilgileri &lt;strong&gt;varbinary(Max) &lt;/strong&gt;tipinden alanlarda saklanmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk167_4.gif" alt="" width="341" height="160" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Geliştireceğimiz &amp;ouml;rnek bir windows uygulaması olacak. Uygulamamızın kodlarını aşağıda bulabilirsiniz.&lt;/p&gt;
&lt;p&gt;Form1.cs i&amp;ccedil;in &amp;ouml;nemli kod satırları;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private LobsWorker wrk;

private void Form1_Load(object sender, EventArgs e)
{
    wrk = new LobsWorker();
    wrk.LoadProductInfos(grdProducts);
}

private void btnShowPicture_Click(object sender, EventArgs e)
{
    if (grdProducts.SelectedRows.Count &amp;gt; 0)
    {
        int photoId = Convert.ToInt32(grdProducts["ProductPhotoID", grdProducts.CurrentCell.RowIndex].Value);
        wrk.ShowPicture(pcbProductPhoto, photoId);
    }
}&lt;/pre&gt;
&lt;p&gt;İşleri y&amp;uuml;klenen LobsWorker sınıfımız;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.Configuration;
using System.Data.SqlClient;
using System.Windows.Forms;
using System.IO;

namespace LOBs
{
    class LobsWorker
    {
        SqlConnection _con;
        SqlCommand _cmd;
        SqlDataReader _dr;
        SqlDataAdapter _da;

        public void LoadProductInfos(DataGridView grid)
        {
            using (_con = new SqlConnection(ConfigurationManager.ConnectionStrings["AdvConStr"].ConnectionString))
            {
                _cmd=new SqlCommand("SELECT Production.Product.ProductID, Production.Product.Name,     Production.Product.ListPrice, Production.Product.StandardCost,Production.ProductProductPhoto.ProductPhotoID FROM Production.Product INNER JOIN Production.ProductProductPhoto ON Production.Product.ProductID = Production.ProductProductPhoto.ProductID Where Production.Product.Size is not Null",_con);
                _da = new SqlDataAdapter(_cmd);
                DataTable dt = new DataTable();
                _da.Fill(dt);
                grid.DataSource = dt;
            }
        }
        public void ShowPicture(PictureBox pb, int photoId)
        {
            using (_con = new SqlConnection(ConfigurationManager.ConnectionStrings["AdvConStr"].ConnectionString))
            {
                using (_cmd = new SqlCommand("Select ProductPhotoID,LargePhotoFileName,LargePhoto From         Production.ProductPhoto Where ProductPhotoID=@PhotoID", _con))
                {
                    _cmd.Parameters.AddWithValue("@PhotoID", photoId);
                    _con.Open();
                    _dr = _cmd.ExecuteReader(CommandBehavior.CloseConnection | CommandBehavior.SequentialAccess);
                    if (_dr.Read())
                    {
                        pb.Image = System.Drawing.Image.FromStream(_dr.GetSqlBytes(2).Stream);
                    }
                    _dr.Close();
                }
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Kullanıcı DataGridView kontrol&amp;uuml;den bir satır se&amp;ccedil;ip Resim G&amp;ouml;ster isimli d&amp;uuml;ğmeye tıkladığında, se&amp;ccedil;ilen satırdaki ProductPhotoID alanının değeri ele alınaraktan &amp;uuml;r&amp;uuml;n resmi bir PictureBox kontrol&amp;uuml;nde g&amp;ouml;sterilmektedir. Yardımcı sınıfımız olan LobsWorker i&amp;ccedil;erisindeki en &amp;ouml;nemli &amp;uuml;ye ShowPicture isimli metoddur. Bu metod parametre olarak resmin g&amp;ouml;sterileceği PictureBox bileşeninin referansını ve DataGridView kontrol&amp;uuml;nde se&amp;ccedil;ilen satırdaki ProductPhotoID alanının değerini almaktadır.&lt;/p&gt;
&lt;p&gt;Metod i&amp;ccedil;erisinde SqlDataReader sınıfına ait nesne &amp;ouml;rneğinin &lt;strong&gt;ExecuteReader&lt;/strong&gt; metodu &amp;ccedil;alıştırıldıktan sonra elde edilen satırdaki LargePhoto isimli alanın değeri &lt;strong&gt;GetSqlBytes&lt;/strong&gt; metodu ile alınmaktadır. GetSqlBytes isimli metodun d&amp;ouml;nd&amp;uuml;r&amp;uuml;ğ&amp;uuml; referans tipinin &lt;strong&gt;Stream&lt;/strong&gt; isimli bir &amp;ouml;zelliği vardır. Dolayısıyla &amp;uuml;r&amp;uuml;n resmini g&amp;ouml;stermek i&amp;ccedil;in tek yapmamız gereken elde edilen Stream' i PictureBox kontrol&amp;uuml;n&amp;uuml;n &lt;strong&gt;Image&lt;/strong&gt; isimli &amp;ouml;zelliğine atamak olacaktır. Uygulamanın bu haliyle &amp;ouml;rnek &amp;ccedil;ıktısını aşağıda g&amp;ouml;rebilirsiniz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk167_3.gif" alt="" width="561" height="418" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Benzer s&amp;uuml;re&amp;ccedil; d&amp;ouml;k&amp;uuml;man tipindeki kaynaklar i&amp;ccedil;inde ge&amp;ccedil;erlidir. Tek fark &lt;strong&gt;GetSqlBytes&lt;/strong&gt; metodu yerine &lt;strong&gt;GetSqlChars&lt;/strong&gt; metodunu kullanmak olacaktır. Ancak GetSqlChars' ın Stream isimli bir &amp;ouml;zelliği yoktur. Bunun yerine doğrudan &lt;strong&gt;string&lt;/strong&gt; olarak i&amp;ccedil;eriği elde edebiliriz. Bununla birlikte GetSqlChars metodu ile elde edilen i&amp;ccedil;eriği karakter dizisi şeklinde ele almakta m&amp;uuml;mk&amp;uuml;n olabilir. B&amp;ouml;ylece okuma işlemlerinin &amp;ouml;rnek olarak bir resim formatı i&amp;ccedil;in nasıl yapılabileceğini kısaca incelemiş olduk. Benzer işlemleri ikili formatta kaydedilebilecek pek &amp;ccedil;ok dosya i&amp;ccedil;in yapabilirsiniz.&lt;/p&gt;
&lt;p&gt;Gelelim yazma işlemlerine. Tipik olarak g&amp;ouml;r&amp;uuml;nt&amp;uuml;, resim, ses veya d&amp;ouml;k&amp;uuml;man formatındaki kaynakları tablolar &amp;uuml;zerindeki ilgili alanlara yazmak i&amp;ccedil;in aşağıdaki akış şemasındakine benzer bir yol izleyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk167_2.gif" alt="" width="563" height="450" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Yazma işleminide inceleyeceğimiz basit bir &amp;ouml;rnek ile makalemize devam ediyoruz. İ&amp;ccedil;erisinde bir şehire ait resim ve tarih&amp;ccedil;e bilgilerini i&amp;ccedil;eren bir tablomuz olduğunu d&amp;uuml;ş&amp;uuml;nelim. Tablomuzun yapısı aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi olacaktır. Dikkat ederseniz Resim, Tarihce alanlarının veri tipleri sırasıyla &lt;strong&gt; varbinary(Max)&lt;/strong&gt; ve &lt;strong&gt;nvarchar(Max) &lt;/strong&gt;olarak se&amp;ccedil;ilmiştir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk167_5.gif" alt="" width="331" height="125" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek uygulamamızda LobsWorker sınıfı i&amp;ccedil;erisinde yer alan aşağıdaki InsertCity isimli metodumuz, se&amp;ccedil;ilen resim dosyası ve d&amp;ouml;k&amp;uuml;man bilgilerini (&amp;ouml;rnek olarak text formatı baz alınmıştır) ele alarak Sehirlerimiz isimli tabloya satır ekleme işlemini ger&amp;ccedil;ekleştirmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void InsertSehir(string sehir,string imagePath, string docPath)
{
    using (_con = new SqlConnection(ConfigurationManager.ConnectionStrings["AdvConStr"].ConnectionString))
    {
        using(_cmd=new SqlCommand("Insert into Sehirlerimiz (Sehir,Resim,Tarihce) Values (@Sehir,@Resim,@Tarihce)",_con))
        {
            _cmd.Parameters.AddWithValue("@Sehir", sehir);
            _cmd.Parameters.Add("@Resim", SqlDbType.VarBinary);
            _cmd.Parameters.Add("@Tarihce", SqlDbType.NVarChar);
            
            FileStream fsPic = new FileStream(imagePath,FileMode.Open,FileAccess.Read);
            BinaryReader br = new BinaryReader(fsPic);
            _cmd.Parameters["@Resim"].Value=br.ReadBytes((int)fsPic.Length);
            
            FileStream fsDoc = new FileStream(docPath, FileMode.Open, FileAccess.Read);
            StreamReader sr = new StreamReader(fsDoc);
            _cmd.Parameters["@Tarihce"].Value = sr.ReadToEnd();
            
            _con.Open();
            _cmd.ExecuteNonQuery();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk167_6.gif" alt="" width="639" height="433" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;InsertCity metodunu inceleyecek olursak jpg uzantılı resim dosyalarını &lt;strong&gt;varbinary(max)&lt;/strong&gt; tipinden olan @Resim isimli parametreye aktarırken bir &lt;strong&gt;BinaryReader&lt;/strong&gt; sınıfı nesne &amp;ouml;rneğinden yararlanıyoruz. Nitekim &lt;strong&gt;varbinary(max)&lt;/strong&gt; tipinin beklediği verinin byte dizisi şeklinde olması gerekmektedir. Diğer taraftan &lt;strong&gt;txt&lt;/strong&gt; uzantılı d&amp;ouml;k&amp;uuml;man dosyamızı &lt;strong&gt;nvarchar(max)&lt;/strong&gt; tipinden alana eklemek i&amp;ccedil;inse bu kez bir &lt;strong&gt;StreamReader&lt;/strong&gt; sınıfı nesne &amp;ouml;rneğinden yararlanıyoruz. Bu kez aktarmamız gereken verinin string tipinden olması yeterlidir. &amp;Ouml;rneğimizi denediğimizde se&amp;ccedil;ilen verilerin tabloya başarılı bir şekilde eklenmiş olduklarını g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk167_7.gif" alt="" width="444" height="60" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi yeni gelen metodlar, b&amp;uuml;y&amp;uuml;k nesneler ile &amp;ccedil;alışırken olduk&amp;ccedil;a b&amp;uuml;y&amp;uuml;k kolaylıklar getirmiştir. Buna rağmen 8000 byte sınırını bizim i&amp;ccedil;in &amp;ouml;nemli bir &amp;ccedil;izgidir. Genellikle bu değeri aşan kaynakları saklarken par&amp;ccedil;a par&amp;ccedil;a okuma ve yazma y&amp;ouml;ntemleri tercih edilmelidir. Bu y&amp;ouml;ntemlerden biriside Sql Server &amp;uuml;zerinde UpdateText ve TextPtr anahtar s&amp;ouml;zc&amp;uuml;klerinin kullanıldığı tekniktir. Bu tekniği ilerleyen yazılarımızda (yada bir g&amp;ouml;rsel dersimizde) incelemeye &amp;ccedil;alışacağız. Son olarak, b&amp;uuml;y&amp;uuml;k nesnelerin veritabanında saklanmasının &lt;strong&gt;g&amp;uuml;venlik, kontrol edilebilirlik ve taşınabilirlik&lt;/strong&gt; a&amp;ccedil;ısından b&amp;uuml;y&amp;uuml;k avantajlar sağladığını ancak &lt;strong&gt; optimum performans&lt;/strong&gt; i&amp;ccedil;in ekstra &amp;ccedil;aba gerektirdiğinide g&amp;ouml;z ardı etmemekte fayda olacağını s&amp;ouml;yleyelim. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/LOBs.rar"&gt;&amp;Ouml;rnek Uygulama İ&amp;ccedil;in Tıklayın.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2006-07-11 12:00:00</pubDate>
  <slug>Büyük-Nesneler(Large-Objects)-ile-Çalışmak-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet-2</tag>
    <tag>b-l-o-b</tag>
    <tag>sql</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>