<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Windows Servislerinin Kontrolü - 2 ( Sistemdeki Servislerin Kontrol Edilmesi )</title>
  <description>Bu makalemizde, sistemde yer alan windows servislerini bir windows uygulamasından nasıl elde edebileceğimizi ve nasıl kontrol edebileceğimizi incelemeye çalışacağız. Önceki makalelerimizden hatırlayacağınız gibi, sistemde yer alan servislerimiz, System.ServiceProcess isim alanında yer alan ServiceController sınıf nesneleri ile temsil edilmektedir.</description>
  <content>&lt;p&gt;Değerli&amp;nbsp; Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, sistemde yer alan windows servislerini bir windows uygulamasından nasıl elde edebileceğimizi ve nasıl kontrol edebileceğimizi incelemeye &amp;ccedil;alışacağız. &amp;Ouml;nceki makalelerimizden hatırlayacağınız gibi, sistemde yer alan servislerimiz, System.ServiceProcess isim alanında yer alan ServiceController sınıf nesneleri ile temsil edilmektedir. Eğer sistemde yer alan servisleri elde etmek istersek, aşağıda aşırı y&amp;uuml;klenmiş iki prototipi olan, GetServices metodunu kullanabiliriz.&lt;/p&gt;
&lt;table id="table1" style="border-collapse: collapse; width: 100%;" border="1" cellpadding="5" bgcolor="#cccccc"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td bgcolor="#cccccc" width="350"&gt;&lt;strong&gt;GetServices Metodu Prototipleri&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#cccccc"&gt;&lt;strong&gt;A&amp;ccedil;ıklaması&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="350"&gt;public static ServiceController[] GetServices();&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;Bu prototip ile, local makinede yer alan servisler elde edilir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="350"&gt;public static ServiceController[] GetServices(string);&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;Bu prototipte, parametre olarak verilen makine bilgisine ait servisler elde edilir.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Burada g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, GetServices metodu ServiceController sınıfı t&amp;uuml;r&amp;uuml;nden bir diziyi geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Ayrıca bu metod static bir metod oluduğundan, doğrudan ServiceController sınıfı &amp;uuml;zerinden herhangibir nesne &amp;ouml;rneğine gerek duymadan &amp;ccedil;ağırılabilir. Aşağıda &amp;ouml;rnek olarak sistemdeki servislerin elde ediliş tekniği g&amp;ouml;sterilmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;ServiceController[] svc;
svc=ServiceController.GetServices();&lt;/pre&gt;
&lt;p&gt;Elde edilen servislerin herbiri birer ServiceController nesnesi olarak, ele alınır. Elde ettiğimiz servislerin &amp;uuml;zerinde bildiğiniz gibi, bir servisin temel davranışları olan Start,Stop,Pause,Contiune,ExecuteCommand vb.larını aşağıda prototipi verilen metodlar yardımıyla ger&amp;ccedil;ekleştirebilmekteyiz.&lt;/p&gt;
&lt;table id="table3" style="border-collapse: collapse; width: 100%;" border="1" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td bgcolor="#cccccc" width="146"&gt;&lt;strong&gt;Metod&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#cccccc" width="384"&gt;&lt;strong&gt; Prototip&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#cccccc"&gt;&lt;strong&gt;A&amp;ccedil;ıklama&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="146"&gt;&lt;strong&gt;Start&lt;/strong&gt;&lt;/td&gt;
&lt;td width="384"&gt;public void Start();&lt;br /&gt; public void Start(string[]);&lt;/td&gt;
&lt;td&gt;Servisi &amp;ccedil;alıştırır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="146"&gt;&lt;strong&gt;Stop&lt;/strong&gt;&lt;/td&gt;
&lt;td width="384"&gt;&lt;strong&gt;public &lt;/strong&gt;void&lt;strong&gt; Stop();&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Servisi durdurur.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="146"&gt;&lt;strong&gt;Pause&lt;/strong&gt;&lt;/td&gt;
&lt;td width="384"&gt;&lt;strong&gt;public &lt;/strong&gt;void&lt;strong&gt; Pause();&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&amp;Ccedil;alışan servisi duraklatır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="146"&gt;&lt;strong&gt;Contiune&lt;/strong&gt;&lt;/td&gt;
&lt;td width="384"&gt;&lt;strong&gt;public &lt;/strong&gt;void&lt;strong&gt; Continue();&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Duraklatılmış servisin &amp;ccedil;alışmasına devam etmesini sağlar.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="146"&gt;&lt;strong&gt;ExecuteCommand&lt;/strong&gt;&lt;/td&gt;
&lt;td width="384"&gt;&lt;strong&gt;public &lt;/strong&gt;void&lt;strong&gt; ExecuteCommand(&lt;/strong&gt;int &lt;em&gt; &lt;a class="synParam"&gt;command&lt;/a&gt;&lt;/em&gt;&lt;strong&gt;);&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Servisin OnCustomCommand metodunu &amp;ccedil;alıştırır.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Birazdan geliştireceğimiz &amp;ouml;rnek uygulamada, sistedemki servisler &amp;uuml;zerinde yukarıda bahsettiğimiz metodları kullanarak, servislerin kontrol&amp;uuml;n&amp;uuml; ger&amp;ccedil;ekleştirmeye &amp;ccedil;alışacağız. Burada dikkat edilmesi gereken bir ka&amp;ccedil; nokta vardır. &amp;Ouml;ncelikle bir servis başlatılacaksa, bu servisin o an &amp;ccedil;alışmıyor olması başka bir deyişle Stopped konumunda olması gerekmektedir. Aynı durum bir servisi durdururkende ge&amp;ccedil;erlidir. B&amp;ouml;yle bir durumdada, Stop edilecek servisin, Running konumunda olması gerekmektedir. İşte bu nedenlerden dolayı, sistemdeki servislerin &amp;ccedil;alışmaya başlaması veya &amp;ccedil;alışanların durdurulması gibi hallerde, servisin o anki durumunu kontrol etmemiz gerekmektedir. Bu ama&amp;ccedil;la ServiceController sınıfının aşağıda prototipi verilen Status &amp;ouml;zelliğini kullanırız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public ServiceControllerStatus Status {get;}&lt;/pre&gt;
&lt;p&gt;Burada g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Status &amp;ouml;zelliği ServiceControllerStatus numaralandırıcısı t&amp;uuml;r&amp;uuml;nden değerler alabilmektedir. Bu numaralandırıcının alacağı değerler servisin o anki durumu hakkında bilgi vermektedir. Status &amp;ouml;zelliği sadece get bloğuna sahip olduğundan, yanlızca servisin o anki durumu hakkında bilgi vermektedir. ServiceControllerStatus numaralandırıcısının alabileceği değerler aşağıdaki tabloda belirtilmektedir.&lt;/p&gt;
&lt;table id="table5" class="dtTABLE" style="border-collapse: collapse; width: 571px;" border="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr valign="top"&gt;
&lt;th width="38%"&gt;ServiceControllerStatus Değeri&lt;/th&gt;
&lt;th width="51%"&gt;A&amp;ccedil;ıklama&lt;/th&gt;
&lt;/tr&gt;
&lt;tr valign="top"&gt;
&lt;td width="38%"&gt;&lt;strong&gt;ContinuePending&lt;/strong&gt;&lt;/td&gt;
&lt;td width="51%"&gt;Duraksatılan servis devam ettirilmeyi beklerken.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr valign="top"&gt;
&lt;td width="38%"&gt;&lt;strong&gt;Paused&lt;/strong&gt;&lt;/td&gt;
&lt;td width="51%"&gt;Servis duraksatıldığında.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr valign="top"&gt;
&lt;td width="38%"&gt;&lt;strong&gt;PausePending&lt;/strong&gt;&lt;/td&gt;
&lt;td width="51%"&gt;Servis duraksatılmayı beklerken.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr valign="top"&gt;
&lt;td width="38%"&gt;&lt;strong&gt;Running&lt;/strong&gt;&lt;/td&gt;
&lt;td width="51%"&gt;Servis &amp;ccedil;alışırken.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr valign="top"&gt;
&lt;td width="38%"&gt;&lt;strong&gt;StartPending&lt;/strong&gt;&lt;/td&gt;
&lt;td width="51%"&gt;Servis &amp;ccedil;alıştırılmayı beklerken.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr valign="top"&gt;
&lt;td width="38%"&gt;&lt;strong&gt;Stopped&lt;/strong&gt;&lt;/td&gt;
&lt;td width="51%"&gt;Servis durdurulduğunda.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr valign="top"&gt;
&lt;td width="38%"&gt;&lt;strong&gt;StopPending&lt;/strong&gt;&lt;/td&gt;
&lt;td width="51%"&gt;Servis durdurulmayı beklerken.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Burada en &amp;ccedil;ok kafa karıştırıcı haller Pending halleridir. Bunu daha iyi anlamak i&amp;ccedil;in &amp;ouml;rnek olarak StopPending durumunu aşağıdaki şekil &amp;uuml;zerinden incelemeye &amp;ccedil;alışalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk69_1.gif" alt="" width="629" height="198" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. Pending Durumları.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Burada g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &amp;ccedil;alışan bir servise, Stop emri verildiğinde, bu servisin durumu Stopped oluncaya kadar ge&amp;ccedil;en s&amp;uuml;rede, servis StopPending durumundadır. Aynı mantık, StartPending, PausePending ve ContinuePending durumları i&amp;ccedil;inde ge&amp;ccedil;erlidir. Pending durumlarını daha &amp;ccedil;ok, bu zaman s&amp;uuml;relerinin tamamlanıp verilen emrin başarılı bir şekilde uygulandığının izlenmesinde kullanbiliriz. Bu ama&amp;ccedil;la, ServiceController sınıfı bize, aşağıda prototipleri verilen WaitForStatus metodunu sunmaktadır. Bu metod, parametre olarak aldığı ServiceControllerStatus değeri sağlanıncaya kadar uygulamayı duraksatmaktadır.&lt;/p&gt;
&lt;table id="table6" style="border-collapse: collapse; width: 100%;" border="1" cellpadding="5" bgcolor="#cccccc"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="337"&gt;&lt;strong&gt;Prototipler&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;A&amp;ccedil;ıklama&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="337"&gt;&lt;strong&gt; public &lt;/strong&gt;void&lt;strong&gt; WaitForStatus(&lt;/strong&gt;ServiceControllerStatus &lt;em&gt; &lt;a class="synParam"&gt;desiredStatus&lt;/a&gt;&lt;/em&gt;&lt;strong&gt;);&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;Servisin ServiceControllerStatus numaralandırıcısı ile belirtilen duruma ge&amp;ccedil;mesi i&amp;ccedil;in, uygulamayı bekletir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="337"&gt;&lt;strong&gt; public &lt;/strong&gt;void&lt;strong&gt; WaitForStatus(&lt;/strong&gt;&lt;br /&gt; &lt;strong&gt;&amp;nbsp;&amp;nbsp; &lt;/strong&gt;ServiceControllerStatus &lt;em&gt; &lt;a class="synParam"&gt;desiredStatus&lt;/a&gt;&lt;/em&gt;&lt;strong&gt;,&lt;/strong&gt;&lt;br /&gt; &lt;strong&gt;&amp;nbsp;&amp;nbsp; &lt;/strong&gt;TimeSpan &lt;em&gt; &lt;a class="synParam"&gt;timeout&lt;/a&gt;&lt;/em&gt;&lt;br /&gt; &lt;strong&gt;);&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#ffffff"&gt;Servisin ServiceControllerStatus numaralandırıcısı ile belirtilen duruma ge&amp;ccedil;mesi i&amp;ccedil;in, TimeSpan ile belirtilen s&amp;uuml;re kadar uygulamanın beklemesini sağlar.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Biz uygulamamızda WaitForStatus metodunu, bir servise Start,Stop,Pause ve Continue emirlerini verdiğimizde, pending işlemlerinin sona ermesi ile birlikte servisin başarılı bir şekilde istenen konuma ge&amp;ccedil;tiğini anlamak amacıyla kullancağız. Bu aslında SCM yardımıyla bir servisin durdurulması veya başlatılmasında oluşan bekleme işlemi ile alakalı bir durumdur. &amp;Ouml;rneğin,&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk69_2.gif" alt="" width="584" height="216" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. Servisin &amp;ccedil;alıştırılması sırasındaki bekleme işlemi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;SCM yardımıyla bir servisi &amp;ccedil;alıştırdığımızda (Start) yukarıdaki gibi bir pencere ile karşılaşırız. Burada servis, StartPending konumundadır. Servis &amp;ccedil;alışmaya başladığında yani Running konumuna geldiğinde, artık StartPending konumundan &amp;ccedil;ıkar. Lakin bu s&amp;uuml;re zarfında SCM uygulamasının bir s&amp;uuml;re duraksadığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bu duraksama servis Running halini alıncaya kadar s&amp;uuml;rer. İşte bunu sağlayan aslında WaitForStatus mekanizmasından başka bir şey değildir. Bu sayede servis Running moduna ge&amp;ccedil;tiğinde, g&amp;uuml;ncelenen listede servisin durumu Running olarak yazacaktır. Eğer WaitForStatus tekniği kullanılmamış olsaydı, bu durumda servis Start edildiğinde ve liste g&amp;uuml;ncellendiğinde ilk aşamada Servisin durumu StartPending olucak ve ancak sonraki liste g&amp;uuml;ncellemesinde Running yazacaktı. Bizde uygulamamızda WaitForStatus metodunu bu ama&amp;ccedil;la kullanacağız. Yani servis kesin olarak istediğimiz duruma ulaştığında, listemizi g&amp;uuml;ncelliyeceğiz.&lt;/p&gt;
&lt;p&gt;ServiceController sınıfı i&amp;ccedil;in kullanılacak diğer &amp;ouml;nemli bir &amp;ouml;zellikte CanPauseAndContinue &amp;ouml;zelliğidir. Bazı servislerin bu &amp;ouml;zellik değeri false olduğu i&amp;ccedil;in, bu servislerin Pause ve Continue emirlerine cevap vermesi olanaksızdır. İşte uygulamamızda bizde bir servisin bu durumunu kontrol edicek ve ona g&amp;ouml;re Pause ve Continue emirlerine izin vereceğiz. CanPauseAndContinue &amp;ouml;zelliğinin prototipi aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public bool CanPauseAndContinue {get;}&lt;/pre&gt;
&lt;p&gt;ServiceController sınıfı i&amp;ccedil;in kullanabilceğimiz diğer &amp;ouml;nemli bir &amp;ouml;zellik ise, bir servisin bağlı olduğu diğer servislerin listesini elde etmemizi sağlıyan, ServicesDependOn &amp;ouml;zelliğidir. Prototipi aşağıdaki gibi olan bu &amp;ouml;zellik ile, bir servisin &amp;ccedil;alışması i&amp;ccedil;in gerekli olan diğer servislerin listesini elde edebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public ServiceController[] ServicesDependedOn {get;}&lt;/pre&gt;
&lt;p&gt;Prototipten de g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi bu &amp;ouml;zellik, ServiceController sınıfı t&amp;uuml;r&amp;uuml;nden bir dizi geriye d&amp;ouml;nd&amp;uuml;rmektedir. Dolayısıyla bu &amp;ouml;zellik yardımıyla sistemdeki servislerin bağlı oldukları servisleride elde etme imkanına sahibiz.&lt;/p&gt;
&lt;p&gt;Şimdi dilerseniz buraya kadar işlediğimiz yanları ile, ServiceController sınıfını kullandığımız bir &amp;ouml;rnek geliştirmeye &amp;ccedil;alışalım. Bu &amp;ouml;rneğimizde, sistemimizdeki servislerin listesini elde edeceğiz. Se&amp;ccedil;tiğimiz bir servis &amp;uuml;zerinde Start, Stop, Pause, Continue gibi emirleri yerine getireceğiz ve bir servise bağlı olan servislerin listesine bakabileceğiz. Bu ama&amp;ccedil;la &amp;ouml;ncelikle aşağıdakine benzer bir windows uygulama formu oluşturarak işe başlayalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk69_3.gif" alt="" width="616" height="352" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. Uygulamamızın Form G&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdide program kodlarımızı oluşturalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Drawing;
using System.Collections;
using System.ComponentModel;
using System.Windows.Forms;
using System.Data;
using System.ServiceProcess; /* ServiceController sınıfını kullanabilmek i&amp;ccedil;in bu isim alanını ekliyoruz.*/

namespace ServisBakim
{
    public class Form1 : System.Windows.Forms.Form
    {
    .
    .

    .
         /* Sistemde y&amp;uuml;kl&amp;uuml; olan servislerin listesini elde edeceğimiz bir metod geliştiriyoruz. Bu metodu hem servis listesini alırken hemde bir servis ile ilgili Start,Stop,Pause,Continue emirleri verildikten sonra, ListView kontrol&amp;uuml;ndeki listeyi g&amp;uuml;ncel tutmak amacıyla kullanacağız.*/
        private void ServisListeGuncelle()
        {
            ServiceController[] svc; /*ServiceController sınıfından bir dizi tanımlıyoruz.*/
            svc=ServiceController.GetServices(); /* Bu diziye ServiceController sınıfının static GetServices metodu yardımıyla sistemde y&amp;uuml;kl&amp;uuml; olan servisleri birer ServiceController nesnesi olarak aktarıyoruz.*/

            lvServisler.Items.Clear(); /* ListView kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n i&amp;ccedil;eriğini temizliyoruz.*/
            /* Elde ettiğimiz servisler arasında gezinmek i&amp;ccedil;in, Servis sayısı kadar &amp;ouml;telenecek bir for d&amp;ouml;ng&amp;uuml;s&amp;uuml; oluşturuyoruz. Servis sayısını ise, svc isimli ServiceController tipinden dizimizin Length &amp;ouml;zelliği ile elde ediyoruz.*/
            for(int i=0;i&amp;lt;svc.Length;i++) 
            {
                lvServisler.Items.Add(svc[i].ServiceName.ToString()); /* ListView kontrol&amp;uuml;ndeki ilk &amp;ouml;ğeye yani ServisAdı kısmına i indisli ServiceController tipinden svc nesnesinin ismini ekliyoruz. Bunun i&amp;ccedil;in ServiceName &amp;ouml;zelliğini kullanıyoruz.*/
                lvServisler.Items[i].SubItems.Add(svc[i].Status.ToString()); /*ListView kontrol&amp;uuml;ndeki alt &amp;ouml;ğeye, servisimizin durumunu Status &amp;ouml;zelliği yardımıyla ekliyoruz.*/
            }
        }

        private void btnServisAl_Click(object sender, System.EventArgs e)
        {
            ServisListeGuncelle();
        }

        private void btnStart_Click(object sender, System.EventArgs e)
        { 
            /* &amp;Ouml;ncelikle başlatmak istediğimiz servis bilgisini ListView kontrol&amp;uuml;nden almalıyız. Bunun i&amp;ccedil;in ListView kontrol&amp;uuml;n&amp;uuml;n FocusedItem &amp;ouml;zelliğini kullanıyoruz. B&amp;ouml;ylece kullanıcının ListView'da se&amp;ccedil;tiği servisin adını elde edebiliriz.*/
            string servis;
            servis=lvServisler.FocusedItem.Text;
            /*Se&amp;ccedil;ilen servis adını ele alarak bir ServiceController nesnesi oluşturuyoruz.*/
            ServiceController curSer=new ServiceController(servis);
            /* Servis başlatma işlemini eğer se&amp;ccedil;ilen servisin durumu Stopped ise ger&amp;ccedil;ekleştirebilmeliyiz. Bu ama&amp;ccedil;la, &amp;ouml;nce se&amp;ccedil;ilen servise ait ServiceController nesnesinin Status &amp;ouml;zelliğine bakıyoruz. Değerin Stopped olup olmadığını denetlerken ServiceControllerStatus numaralandırıcısını kullanıyoruz.*/
            if(curSer.Status==ServiceControllerStatus.Stopped)
            {
                curSer.Start(); /* Servisi &amp;ccedil;alıştırıyoruz.*/
                curSer.WaitForStatus(ServiceControllerStatus.Running); /* Servisimiz Running konumunu alıncaya dek bir s&amp;uuml;re uygulamayı bekletiyoruz ve bu işlemin ardından servislerin listesini g&amp;uuml;ncelliyoruz. Eğer WaitForStatus metodunu kullanmassak, servis listesini g&amp;uuml;ncellediğimizde, ilgili servis i&amp;ccedil;in StartPending konumu yazılıcaktır.*/
                ServisListeGuncelle();
            }
            else /* Servis zaten &amp;ccedil;alışıyorsa yani durumu(Status) Running ise bunu kullanıcıya belirtiyoruz.*/
            {
                MessageBox.Show(curSer.ServiceName.ToString()+" ZATEN CALISIYOR");
            }
        }

        private void btnStop_Click(object sender, System.EventArgs e)
        {
            /* Bir servisi durdurmak i&amp;ccedil;in yapacağımız işlemler, başlatmak i&amp;ccedil;in yapacaklarımız ile aynı. Sadece bu kez, servisin Running konumunda olup olmadığını denetliyor ve &amp;ouml;yleyse, Stop komutunu veriyoruz.*/
            string servis;
            servis=lvServisler.FocusedItem.Text;
            ServiceController curSer=new ServiceController(servis);
            if(curSer.Status==ServiceControllerStatus.Running)
            {
                curSer.Stop(); /* Servis durduruluyor. */
                curSer.WaitForStatus(ServiceControllerStatus.Stopped);
                ServisListeGuncelle();
            }
            else
            {
                MessageBox.Show(curSer.ServiceName.ToString()+" ZATEN CALISMIYOR");
            }
        }

        private void btnPause_Click(object sender, System.EventArgs e)
        {
            /* Bir servisi duraksatacağımız zaman, bu servisin, CanPauseAndContinue &amp;ouml;zelliğinin değeri &amp;ouml;nem kazanır. Eğer bu değer false ise, servis &amp;uuml;zerinde Pause veya Continue emirlerini uygulayamayız. Bu nedenle burada ilgili servise ati CanPauseAndContinue &amp;ouml;zelliğinin değeri kontrol edilir ve ona g&amp;ouml;re Pause emri verilir.*/
            string servis;
            servis=lvServisler.FocusedItem.Text;
            ServiceController curSer=new ServiceController(servis);
            if(curSer.CanPauseAndContinue==true) /* CanPauseAndContinue true ise, Pause işlemini uygulama hakkına sahibiz.*/
            {
                if(curSer.Status!=ServiceControllerStatus.Paused) /* Servis eğer Paused konumunda değilse Pause emri uygulanır. Bir başka deyişle servis &amp;ccedil;alışır durumdaysa.*/
                {
                    curSer.Pause(); /* Servis duraksatılıyor.*/
                    curSer.WaitForStatus(ServiceControllerStatus.Paused); /* Servisin Paused konumuna ge&amp;ccedil;mesi i&amp;ccedil;in bekleniyor. */
                    ServisListeGuncelle();
                }
            } 
            else
            {
                MessageBox.Show("SERVISIN PAUSE&amp;amp;CONTINUE YETKISI YOK");
            } 
        }

        private void btnContinue_Click(object sender, System.EventArgs e)
        {
            string servis;
            servis=lvServisler.FocusedItem.Text;
            ServiceController curSer=new ServiceController(servis);
            if(curSer.CanPauseAndContinue==true) /* CanPauseAndContinue true ise, Continue işlemini uygulama hakkına sahibiz.*/
            {
                if(curSer.Status==ServiceControllerStatus.Paused) /* ServiceControllerStatus eğer Paused konumunda ise Continue işlemi uygulanır.*/
                {
                    curSer.Continue(); /* Duraksatılan servis &amp;ccedil;alışmasına devam ediyor. */
                    curSer.WaitForStatus(ServiceControllerStatus.Running); /* Servisin Running konumuna ge&amp;ccedil;mesi i&amp;ccedil;in bekleniyor. */
                    ServisListeGuncelle();
                }
            } 
            else
            {
                MessageBox.Show("SERVISIN PAUSE&amp;amp;CONTINUE YETKISI YOK");
            } 
        }

        private void btnBagliServisler_Click(object sender, System.EventArgs e)
        { 
            string servis;
            servis=lvServisler.FocusedItem.Text;
            ServiceController curSer=new ServiceController(servis);
            ServiceController[] bagliServisler=curSer.ServicesDependedOn; /* Bir servise bağlı servislerin listesini elde etmek i&amp;ccedil;in, g&amp;uuml;ncel ServiceController nesnesinin, ServiceDependedOn &amp;ouml;zelliği kullanılır. */

            lbBagliServisler.Items.Clear();
            /* Bağlı servisler arasında gezinmek i&amp;ccedil;in foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml; kullanıyoruz.*/
            foreach(ServiceController sc in bagliServisler)
            {
                lbBagliServisler.Items.Add(sc.ServiceName.ToString());
            }
        }
   }
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştıralım , sistemdeki servisleri elde edelim ve &amp;ouml;rneğin Stopped konumunda olan servislerden Alerter servisini &amp;ccedil;alıştırıp, bu servise bağlı servis(ler) varsa bunların listesini tedarik edelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk69_4.gif" alt="" width="616" height="352" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. Alerter Servisi Stopped konumunda.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk69_5.gif" alt="" width="616" height="352" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 5. Alerter servisi &amp;ccedil;alıştırıldı ve bağlı olan servis elde edildi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Geliştirmiş olduğumuz uygulamada olaşabilecek pek &amp;ccedil;ok hata var. &amp;Ouml;rneğin listede hi&amp;ccedil; bir servis se&amp;ccedil;ili değilken oluşabilecek istisnalar gibi. Bu tarz istisnaların ele alınmasını siz değerli okurlarıma bırakıyorum. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. İlerleyen makalelerimizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-05-12 06:00:00</pubDate>
  <slug>Windows-Servislerinin-Kontrolu-2-(-Sistemdeki-Servislerin-Kontrol-Edilmesi-)-bsenyurt-com-dan</slug>
  <tags>
    <tag>windows-services</tag>
  </tags>
  <categories>
    <category>Windows Services</category>
  </categories>
</post>