<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Hamming Distance Algoritmasının Basit Kullanımı</title>
  <description>Hamming Distance, Amerikalı Matematikçi Richard Hamming tarafından bulunmuş olan ve kodlama teorisinde geçen vektör bazlı bir karşılaştırma algoritmasıdır(Bu adresten teori hakkında biraz bilgi alabiliriz) Programlama tarafından baktığımızda çoğunlukla eşit uzunluktaki içeriklerin benzerliklerine ilişkin bir mesafe ölçüsünün bulunmasında kullanılır. Bu sayede bir metnin diğerine dönüştürülebilmesi için kaç adımlık değişime ihitiyaç duyulduğu da hesaplanabilir. Ya da benzerliğin ne kadarlık bir değere denk geldiği anlaşılabilir. Hata tespiti ve düzeltilmesi, grafik dosyaları üzerinden şekil eşleştirmelerinin(Shape Recognation) yapılması gibi hesaplamalarda kullanılmaktadır. Aslında örnekler ile konuyu daha iyi anlayabiliriz. Basit düşünmeye çalışalım ve aşağıdaki gibi bir kaç kelime çiftini ele alalım.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2016/01/hamming_0.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde uzun s&amp;uuml;redir g&amp;ouml;r&amp;uuml;şmediğim bir arkadaşımdan mesaj aldım. Bir projesinde &lt;strong&gt;Levenshtein&lt;/strong&gt; &lt;strong&gt;Distance&lt;/strong&gt; algoritmasını kullanmaya karar verdiğini ve internette arama yaparken daha &amp;ouml;nceden yazdığım &lt;a title="Levensthein Distance makalem" href="/post/Levenshtein-Distance-Algoritmasi" target="_blank"&gt;şu&lt;/a&gt; makaleye rastladığını dile getirdi.&amp;nbsp;&lt;span style="line-height: 1.8;"&gt;Hem kafasına takılan bir konuyu dile getirmek hem de bir hal hatır sormak istediğini belirtti. &lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;Yazıyı yazalı epey zaman olduğundan konuyu tamamen unutmuştum. Ş&amp;ouml;yle arkama yaslandım ve bir g&amp;uuml;zel yazdıklarımı okudum. Tabii dolu&amp;nbsp;imla hatası buldum ama neyseki algoritmanın kullanım amacını yeniden hatırlamayı başardım. Derken &lt;strong&gt;Levenshetin Distance&lt;/strong&gt; gibi benzer fark bulma algoritmaları olup olmadığına bakmaya karar verdim. Bu iş i&amp;ccedil;in geliştirilmiş bir &amp;ccedil;ok algoritma vardı. Derken kendimi &lt;strong&gt;Hamming&lt;/strong&gt; &lt;strong&gt;Distance&lt;/strong&gt; algoritmasını incelerken buldum.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Hamming Distance&lt;/strong&gt;, Amerikalı&amp;nbsp;Matematik&amp;ccedil;i &lt;a title="Richard Hamming" href="https://tr.wikipedia.org/wiki/Richard_Hamming" target="_blank"&gt;Richard Hamming&lt;/a&gt;&amp;nbsp;tarafından bulunmuş olan ve kodlama teorisinde ge&amp;ccedil;en vekt&amp;ouml;r bazlı bir karşılaştırma algoritmasıdır(&lt;a title="Hamming Distance Algorithym" href="http://www.maths.manchester.ac.uk/~pas/code/notes/part2.pdf" target="_blank"&gt;Bu adresten teori hakkında biraz bilgi alabiliriz&lt;/a&gt;) Programlama tarafından baktığımızda &amp;ccedil;oğunlukla eşit uzunluktaki i&amp;ccedil;eriklerin benzerliklerine ilişkin bir mesafe &amp;ouml;l&amp;ccedil;&amp;uuml;s&amp;uuml;n&amp;uuml;n bulunmasında kullanılır. Bu sayede bir metnin diğerine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lebilmesi i&amp;ccedil;in ka&amp;ccedil; adımlık değişime ihitiya&amp;ccedil; duyulduğu da hesaplanabilir. Ya da benzerliğin ne kadarlık bir değere denk geldiği anlaşılabilir. Hata tespiti ve d&amp;uuml;zeltilmesi, grafik dosyaları &amp;uuml;zerinden şekil eşleştirmelerinin&lt;em&gt;&lt;strong&gt;(Shape Recognation)&lt;/strong&gt;&lt;/em&gt;&amp;nbsp;yapılması gibi hesaplamalarda kullanılmaktadır. Aslında &amp;ouml;rnekler ile konuyu daha iyi anlayabiliriz. Basit d&amp;uuml;ş&amp;uuml;nmeye &amp;ccedil;alışalım ve aşağıdaki gibi bir ka&amp;ccedil;&amp;nbsp;kelime &amp;ccedil;iftini ele alalım.&lt;/p&gt;
&lt;p&gt;kuru - duru&lt;br /&gt;clone - drone&lt;br /&gt;patates - domates&lt;br /&gt;dolu - kedi&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikle karşılaştırılan&amp;nbsp;t&amp;uuml;m kelimelerin birbirleri ile eşit uzunlukta olduklarını s&amp;ouml;ylememiz lazım. Bu zaten algoritmanın şartlarından da birisi. &lt;strong&gt;kuru&lt;/strong&gt; ve &lt;strong&gt;duru&lt;/strong&gt; arasında sadece bir harflik fark var. Buna g&amp;ouml;re &lt;strong&gt;Hamming&lt;/strong&gt; &lt;strong&gt;Distance&lt;/strong&gt; değeri &lt;strong&gt;1&lt;/strong&gt;. Nitekim &lt;strong&gt;k&lt;/strong&gt; ve &lt;strong&gt;d&lt;/strong&gt;&amp;nbsp;dışındaki harfler aynılar. &lt;strong&gt;clone&lt;/strong&gt; ve &lt;strong&gt;drone&lt;/strong&gt; karşılaştırmasına g&amp;ouml;re aradaki fark değeri ise &lt;strong&gt;2dir&lt;/strong&gt;. Yani iki harflik bir farklılık vardır. &lt;strong&gt;c,l&lt;/strong&gt; ve &lt;strong&gt;d,r&lt;/strong&gt; harfleri. &lt;strong&gt;patates&lt;/strong&gt; ve &lt;strong&gt;domates&lt;/strong&gt;' e gelince. Buradaki &lt;strong&gt;Hamming&lt;/strong&gt; değeri &lt;strong&gt;3&lt;/strong&gt;t&amp;uuml;r. &lt;strong&gt;p,a,t&lt;/strong&gt; ve &lt;strong&gt;d,o,m&lt;/strong&gt; harfleri farklıdır. Son eşleşmeye baktığımızda ise b&amp;uuml;t&amp;uuml;n harflerin tamamen farklı olduğunu g&amp;ouml;rebiliriz. Buna g&amp;ouml;re &lt;strong&gt;Hamming&lt;/strong&gt; &lt;strong&gt;Distance&lt;/strong&gt; değeri &lt;strong&gt;4&lt;/strong&gt;t&amp;uuml;r. Hatta bu değer kelimedeki harf sayısı kadar olduğundan her iki eşin birbirlerinden tamamen farklı olduğu sonucuna da varabiliriz. Aşağıdaki grafik ile olayı &amp;ouml;zetleyelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/01/HammingMini.gif" alt="" /&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Tabii &lt;strong&gt;binary&lt;/strong&gt; i&amp;ccedil;erikler i&amp;ccedil;in algoritmanın &amp;ccedil;alıştırılması biraz daha farklıdır. &lt;strong&gt;İkili(Binary)&lt;/strong&gt; sayı sistemi s&amp;ouml;z konusu olduğunda &lt;strong&gt;Hamming&lt;/strong&gt; &lt;strong&gt;Distance&lt;/strong&gt; değerini bulmak i&amp;ccedil;in &lt;strong&gt;XOR&lt;/strong&gt; operat&amp;ouml;r&amp;uuml;nden yararlanılır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Kod tarafında &lt;strong&gt;Hamming&lt;/strong&gt; &lt;strong&gt;Distance&lt;/strong&gt; algoritmasını uygulamak son derece kolay. &lt;strong&gt;.Net&lt;/strong&gt; tarafında &lt;strong&gt;LINQ&lt;/strong&gt; kabiliyetlerini kullanabiliyoruz. Hatta &lt;strong&gt;Ruby&lt;/strong&gt;' de bile olduk&amp;ccedil;a basit. Gelin her iki dil i&amp;ccedil;in &lt;strong&gt;Hamming&lt;/strong&gt; &lt;strong&gt;Distance&lt;/strong&gt; hesaplaması yapan birer &amp;ouml;rnek geliştirelim. &lt;em&gt;(Malumunuz ben bir Rubyist olmaya gayret ediyorum. Ona yer vermezsem olmazdı)&lt;/em&gt;&lt;/p&gt;
&lt;h2&gt;C# &amp;Ouml;rneğimiz&lt;/h2&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;

namespace HammingDistance
{
    class Program
    {
        static void Main(string[] args)
        {
            Dictionary&amp;lt;string, string&amp;gt; words = new Dictionary&amp;lt;string, string&amp;gt;
            {
                { "kuru","duru" }
                , {"clone","drone" }
                , {"patates" ,"domates"}
                , {"silindir","bilindik" }
                , {"tabela","tabela" }
                , {"sempatik","sentetik" }
                , {"eksik","balık" }
                , {"dolu","kedi" }
            };
            int distanceValue;
            foreach (var pair in words)
            {
                distanceValue=pair.Key.CalculateHammingDistance(pair.Value);
                Console.WriteLine("{0} vs {1}\ti&amp;ccedil;in : {2} ",pair.Key,pair.Value,distanceValue);
            }
        }
    }

    public static class StringExtensions
    {
        public static int CalculateHammingDistance(this string source, string target)
        {
            if (source.Length != target.Length)
                throw new Exception("Metinler eşit uzunlukta olmalı");

            int distance =
                source.ToCharArray()
                .Zip(target.ToCharArray(), (char1, char2) =&amp;gt; new { char1, char2 })
                .Count(m =&amp;gt; m.char1 != m.char2);

            return distance;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rneğin &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/01/Hamming_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Kodda basit&amp;ccedil;e neler yaptığımıza bir bakalım. &lt;strong&gt;String&lt;/strong&gt; tipi i&amp;ccedil;in yazılmış bir &lt;strong&gt;genişletme metodu&lt;em&gt;(Extension Methods)&lt;/em&gt;&lt;/strong&gt; olduğunu g&amp;ouml;rm&amp;uuml;şs&amp;uuml;n&amp;uuml;zd&amp;uuml;r. &lt;strong&gt;CalculateHammingDistance&lt;/strong&gt; metodu bir &lt;strong&gt;string&lt;/strong&gt; değişkene uygulanabilir. &lt;strong&gt;target&lt;/strong&gt; isimli değişken ile gelen i&amp;ccedil;erik &lt;strong&gt;source&lt;/strong&gt; ile karşılaştırılmaktadır. &lt;strong&gt;LINQ&lt;/strong&gt; ifadesindeki dikkat &amp;ccedil;ekici nokta ise&amp;nbsp;&lt;strong&gt;Zip&lt;/strong&gt; metodudur. Sanırım pek &amp;ccedil;oğumuz bu fonksiyon ile ilk kez karşılaşıyor.&amp;nbsp;&lt;strong style="line-height: 1.8;"&gt;Zip&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; fonksiyonu iki diziyi istenen bir ifade &amp;ccedil;er&amp;ccedil;evesinde&lt;/span&gt;&lt;em style="line-height: 1.8;"&gt;(Predication diyelim)&lt;/em&gt;&lt;span style="line-height: 1.8;"&gt; birleştirmek amacıyla kullanılmaktadır. &amp;Ouml;ncesinde dikkat edileceği gibi &lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;source&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; i&amp;ccedil;eriği bir karakter dizisine &amp;ccedil;evrilir. &lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;Zip &lt;/strong&gt;fonksiyonu&lt;span style="line-height: 1.8;"&gt;&amp;nbsp;&lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;target&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; değişkeninin taşıdığı karakter dizisi ile &lt;strong&gt;source&lt;/strong&gt; i&amp;ccedil;eriğine ait karakter dizisini yeni bir &lt;strong&gt;isimsiz tip&lt;em&gt;(Anonymous Type)&lt;/em&gt;&lt;/strong&gt;&amp;nbsp;altında&amp;nbsp;birleştirir. Son olarak da bu dizi elemanlarının birbirleri ile aynı olup olmadığı kontrol&amp;uuml; yapılır. &lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;Count&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; metodunda yer alan &lt;strong&gt;m&lt;/strong&gt; değişkeni &lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;new {char1, char2}&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; ifadesi ile &amp;uuml;retilen nesne &amp;ouml;rneklerini ifade eder.&lt;/span&gt;&lt;/p&gt;
&lt;h2&gt;Ruby &amp;Ouml;rneğimiz&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;Ruby&lt;/strong&gt; tarafında da olduk&amp;ccedil;a benzer bir yaklaşım s&amp;ouml;z konusudur. Hatta metod adları neredeyse aynıdır diyebiliriz. İşte &lt;strong&gt;Ruby&lt;/strong&gt; kod par&amp;ccedil;acığımız.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;#Ruby icin Hamming Distance

class StringOperations

def calculateHammingDistance(source, target)
raise "ERROR: Hamming: kaynak ve hedef icerikler esit uzunlukta degiller!" if source.length != target.length
(source.chars.zip(target.chars)).count {|left, rigth| left != rigth}
end

end

words=Hash.new("Words")
words["kuru"]="duru"
words["clone"]="drone"
words["patates"]="domates"
words["silindir"]="bilindik"
words["tabela"]="tabela"
words["sempatik"]="sentetik"
words["dolu"]="kedi"


sOp=StringOperations.new
words.each{
|key,value| 
puts "#{key} vs #{value} = #{sOp.calculateHammingDistance(key,value)}"
}&lt;/pre&gt;
&lt;p&gt;ve &amp;ccedil;alışma zamanı &amp;ccedil;ıktımız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/01/Hamming_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Ruby&lt;/strong&gt; kod &amp;ouml;rneğimizde &lt;strong&gt;StringOperations&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde yazdığımız &lt;strong&gt;calculateHammingDistance&lt;/strong&gt; isimli fonksiyonu kullanıyoruz. İki parametre alan fonksiyon &lt;strong&gt;source&lt;/strong&gt; ve &lt;strong&gt;target&lt;/strong&gt; i&amp;ccedil;eriklerin kıyaslayarak ilgili &lt;strong&gt;Hamming&lt;/strong&gt;&amp;nbsp;&lt;strong&gt;Distance&lt;/strong&gt; değerini d&amp;ouml;nd&amp;uuml;r&amp;uuml;yor. Metodun ilk satırında kaynak ve hedef metinlerin uzunluklarının aynı &lt;span style="text-decoration: underline;"&gt;olmaması&lt;/span&gt; halinde bir &lt;strong&gt;Exception&lt;/strong&gt; fırlatılmasını sağlıyoruz&lt;em&gt;(Benzer durum &lt;strong&gt;C#&lt;/strong&gt; ile yazdığımız kod &amp;ouml;rneği i&amp;ccedil;in de ge&amp;ccedil;erli)&lt;/em&gt;&amp;nbsp;İkinci satırda ise &lt;strong&gt;chars&lt;/strong&gt;, &lt;strong&gt;zip&lt;/strong&gt; ve &lt;strong&gt;count&lt;/strong&gt;&amp;nbsp;metod kullanımları s&amp;ouml;z konusu. &lt;strong&gt;LINQ&lt;/strong&gt; ile yazdığımız ifadeye ne kadar da benzer değil mi? :) İzleyen kod satırlarında ise &lt;strong&gt;key:value&lt;/strong&gt; &amp;ccedil;iflerini tutan bir &lt;strong&gt;Hash&lt;/strong&gt; dizisini ele alarak&amp;nbsp;&lt;strong&gt;Hamming&lt;/strong&gt; değerlerini ekrana yazdırıyoruz.&lt;/p&gt;
&lt;p&gt;Bu yazımızda eşit uzunluklu i&amp;ccedil;eriklerin karşılaştırılarak birbirlerinden olan farklarının hesaplanmasında kullanılan &lt;strong&gt;Hamming Distance&lt;/strong&gt; algoritmasını incelemeye &amp;ccedil;alıştık. Kullanım alanlarını keşfederek kendiniz i&amp;ccedil;in farklı &amp;ouml;rnekler yapmaya &amp;ccedil;alışmanızı &amp;ouml;neririm. Hatta yatkın olduğunuz dilde bu algoritmayı kullanmayı denemeniz iyi bir pratik olacaktır. Diğer yandan algoritma geliştirmeye yeni başlayan arkadaşlarımızın &lt;strong&gt;LINQ&lt;/strong&gt; ifadelerinden &lt;span style="text-decoration: underline;"&gt;yararlanmadan&lt;/span&gt; bu hesaplamayı nasıl yaptırabileceklerine odaklanmalarını şiddetle tavsiye ederim. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-01-13 17:09:00</pubDate>
  <slug>hamming-distance-algoritmasinin-basit-kullanimi</slug>
  <tags>
    <tag>c#</tag>
    <tag>ruby</tag>
    <tag>algorithms</tag>
    <tag>levenshtein-distance</tag>
    <tag>hamming-distance</tag>
    <tag>extension-methods</tag>
    <tag>linq</tag>
    <tag>language-integrated-query</tag>
    <tag>richard-hamming</tag>
  </tags>
  <categories>
    <category>C#</category>
    <category>Ruby</category>
  </categories>
</post>