<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Bir Sınıf Yazalım</title>
  <description>Bugünkü makalemizde ADO.NET  kavramı içerisinde sınıfları nasıl kullanabileceğimizi incelemeye çalışacak ve sınıf kavramına kısa bir giriş yapıcağız. Nitekim C# dili tam anlamıyla nesne yönelimli bir dildir. Bu dil içerisinde sınıf kavramının önemli bir yeri vardır. Bu kavramı iyi anlamak, her türlü teknikte, sınıfların avantajlarından yararlanmanızı ve kendinize özgü nesnelere sahip olabilmenizi sağlar. Zaten .net teknolojisinde yer alan her nesne, mutlaka sınıflardan türetilmektedir.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde ADO.NET&amp;nbsp; kavramı i&amp;ccedil;erisinde sınıfları nasıl kullanabileceğimizi incelemeye &amp;ccedil;alışacak ve sınıf kavramına kısa bir giriş yapıcağız. Nitekim C# dili tam anlamıyla nesne y&amp;ouml;nelimli bir dildir. Bu dil i&amp;ccedil;erisinde sınıf kavramının &amp;ouml;nemli bir yeri vardır. Bu kavramı iyi anlamak, her t&amp;uuml;rl&amp;uuml; teknikte, sınıfların avantajlarından yararlanmanızı ve kendinize &amp;ouml;zg&amp;uuml; nesnelere sahip olabilmenizi sağlar. Zaten .net teknolojisinde yer alan her nesne, mutlaka sınıflardan t&amp;uuml;retilmektedir.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;evremize baktığımız zaman, &amp;ccedil;ok &amp;ccedil;eşitli canlılar g&amp;ouml;r&amp;uuml;r&amp;uuml;z. &amp;Ouml;rneğin &amp;ccedil;i&amp;ccedil;ekler. D&amp;uuml;nya &amp;uuml;zerinde ka&amp;ccedil; t&amp;uuml;r(cins) &amp;ccedil;i&amp;ccedil;ek olduğunu bileniniz var mı ? Ama biz bir &amp;ccedil;i&amp;ccedil;ek g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde ona &amp;ccedil;oğunlukla&amp;nbsp; &amp;ldquo;&amp;Ccedil;i&amp;ccedil;ek&amp;rdquo; diye hitap ederiz &amp;ouml;zellikle adını bilmiyorsak. Sonra ise bu &amp;ccedil;i&amp;ccedil;eğin renginden, yapraklarının şeklinden, ait olduğu t&amp;uuml;rden, adından bahsederiz. &amp;Ccedil;i&amp;ccedil;ek t&amp;uuml;m bu &amp;ccedil;i&amp;ccedil;ekler i&amp;ccedil;in temel bir sınıf olarak kabul edilebilir. D&amp;uuml;nya &amp;uuml;zerindeki t&amp;uuml;m &amp;ccedil;i&amp;ccedil;ekler i&amp;ccedil;in ortak nitelikleri vardır.&lt;/p&gt;
&lt;p&gt;Her &amp;ccedil;i&amp;ccedil;eğin bir renginin(renklerinin) olması gibi. İşte nesne y&amp;ouml;nelimli programlama kavramında bahsedilen ve her şeyin temelini oluşturan sınıf kavramı bu benzetme ile tamamen aynıdır. &amp;Ccedil;i&amp;ccedil;ek bir sınıf olarak algılanırken, sokakta g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z her &amp;ccedil;i&amp;ccedil;ek bu sınıfın ortak &amp;ouml;zelliklerine sahip birer nesne olarak nitelendirilebilir. Ancak tabiki &amp;ccedil;i&amp;ccedil;ekler arasında da t&amp;uuml;rler mevcuttur. Bu t&amp;uuml;rler ise, &amp;Ccedil;i&amp;ccedil;ek temel sınıfından t&amp;uuml;reyen kendi belirli &amp;ouml;zellikleri dışında &amp;Ccedil;i&amp;ccedil;ek sınıfının &amp;ouml;zelliklerinide kalıtsal olarak alan başka sınıflardır. Bu yaklaşım inheritance (kalıtım) kavramı olarak ele alınır ve nesne y&amp;ouml;nelimli programlamanın temel &amp;uuml;&amp;ccedil; &amp;ouml;ğesinden biridir. Kalıtım konusuna ve diğerlerine ilerliyen makalelerimizde değinmeye &amp;ccedil;alışacağız.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;n yapacağımız bir sınıfın temel yapı taşlarına kısaca değinmek ve kendimize ait işimize yarayabiliecek bir sınıf tasarlamak. &amp;Ccedil;i&amp;ccedil;ek sınıfından ger&amp;ccedil;ek C# ortamına ge&amp;ccedil;tiğimizde, her şeyin bir nesne olduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Ancak her nesne temel olarak Object sınıfından t&amp;uuml;remektedir. Yani herşeyin &amp;uuml;st&amp;uuml;nde bir sınıf kavramı vardır. Sınıflar, bir takım &amp;uuml;yelere sahiptir. Bu &amp;uuml;yeler, bu sınıftan &amp;ouml;rneklendirilen nesneler i&amp;ccedil;in farklı değerlere sahip olurlar. Yani bir sınıf varken, bu sınıftan &amp;ouml;rneklendirilmiş n sayıda nesne oluşturabiliriz. Kaldıki bu nesnelerin her biri, tanımlandığı sınıf i&amp;ccedil;in&amp;nbsp; ayrı ayrı &amp;ouml;zelliklere sahip olabilirler. &amp;nbsp;&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk25_1.gif" alt="" width="336" height="181" border="1" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 1. Sınıf (Class) ve Nesne (Object) Kavramı&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bir sınıf kendisinden oluşturulacak nesneler i&amp;ccedil;in bir takım &amp;uuml;yeler i&amp;ccedil;ermelidir. Bu &amp;uuml;yeler, alanlar (fields), metodlar (methods), yapıcılar (constructor), &amp;ouml;zellikler (properties), olaylar(events), delegeler (delegates) vb&amp;hellip; dır. Alanlar verileri sınıf i&amp;ccedil;erisinde tutmak amacıyla kullanılırlar. Bir takım işlevleri veya fonksiyonellikleri ger&amp;ccedil;ekleştirmek i&amp;ccedil;in metodları kullanırız. &amp;Ccedil;oğunlukla sınıf i&amp;ccedil;inde yer alan alanların veya &amp;ouml;zelliklerin ilk değerlerin atanması gibi hazırlık işlemlerinde ise yapıcıları kullanırız. &amp;Ouml;zellikler kaps&amp;uuml;lleme dediğimiz Encapsulating kavramının bir par&amp;ccedil;asıdır. &amp;Ccedil;oğunlukla, sınıf i&amp;ccedil;ersinden tanımladığımız alanlara, dışarıdan doğrudan erişilmesini istemeyiz. Bunun yerine bu alanlara erişen &amp;ouml;zellikleri kullanırız. İşte bu sınıf i&amp;ccedil;indeki verileri dış d&amp;uuml;nyadan soyutlamaktır yani kaps&amp;uuml;llemektir. Bir sınıfın genel hatları ile i&amp;ccedil;ereceği &amp;uuml;yeleri aşağıdaki şekilde de g&amp;ouml;rebilirsiniz.&amp;nbsp;&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk25_2.gif" alt="" width="329" height="240" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 2 . Bir sınıfın &amp;uuml;yeleri.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Sınıflar ile ilgili bu kısa bilgilerden sonra dilerseniz sınıf kavramını daha iyi anlamamızı sağlıyacak basit bir &amp;ouml;rnek geliştirelim. Sınıflar ve &amp;uuml;yeleri ile ilgili diğer kavramları kodlar i&amp;ccedil;erisinde yer alan yorum satırlarında a&amp;ccedil;ıklamaya devam edeceğiz. Bu &amp;ouml;rnek &amp;ccedil;alışmamızda, Sql Suncusuna bağlanırken, bağlantı işlemlerini kolaylaştıracak birtakım &amp;uuml;yeler sağlıyan bir sınıf geliştirmeye &amp;ccedil;alışacağız. Kodları yazdık&amp;ccedil;a bunu &amp;ccedil;ok daha iyi anlayacaksınız. İşte bu uygulama i&amp;ccedil;in geliştirdiğimiz, veri isimli sınıfımızın kodları.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data.SqlClient;

namespace Veriler /* Sınıfımız Veriler isimli isim uzayında yer alıyor. &amp;Ccedil;oğu zaman aynı isme sahip sınıflara sahip olabiliriz. İşte bu gibi durumlarda isim uzayları bu sınıfların birbirinden farklı olduğunu anlamamıza yardımcı olurlar.*/
{
    public class Veri /* Sınıfımızın adı Veri */
    {
        /* İzleyen satırlarda alan tanımlamalarının yapıldığını g&amp;ouml;rmekteyiz. Bu alanlar private olarak tanımlanmıştır. Yani sadece bu sınıf i&amp;ccedil;erisinden erişilebilir ve değerleri değiştirilebilir. Bu alanları tanımladığımız &amp;ouml;zelliklerin değerlerini tutmak amacıyla tanımlıyoruz. Amacımız bu değerlere sınıf dışından doğrudan erişilmesini engellemek.*/
        
        private string SunucuAdi;
        private string VeritabaniAdi;
        private string Kullanici;
        private string Parola;
        private SqlConnection Kon; /* Burada SqlConnection tipinden bir değişken tanımladık. */
        private bool BaglantiDurumu; /* Sql sunucumuza olan bağlantının a&amp;ccedil;ık olup olmadığına bakıcağız.*/
        private string HataDurumu; /* Sql sunucusuna bağlanırken hata olup olmadığına bakacağız.*/
        /* Aşağıda sunucu adında bir &amp;ouml;zellik tanımladık. Herbir &amp;ouml;zellik, get veya set bloklarından en az birini i&amp;ccedil;ermek zorundadır. */

        public string sunucu /* public tipteki &amp;uuml;yelere sınıf i&amp;ccedil;inden, sınıf dışından veya t&amp;uuml;retilmiş sınıflardan yani kısaca heryerden erişilebilmektedir.*/
        {
            get
            {
                return SunucuAdi; /* Get ile, sunucu isimli &amp;ouml;zelliğe bu sınıfın bir &amp;ouml;rneğinden erişildiğinde okunacak değerin alınabilmesi sağlanır . Bu değer bizim private olarak tanımladığımız SunucuAdi değişkeninin değeridir. */
            }
            set
            {
                SunucuAdi = value; /* Set bloğunda ise, bu &amp;ouml;zelliğe, bu sınıfın bir &amp;ouml;rneğinden değer atamak istediğimizde yani &amp;ouml;zelliğin g&amp;ouml;sterdiği private SunucuAdi alanının değerini değiştirmek i&amp;ccedil;in kullanırız. &amp;Ouml;zelliğe sınıf &amp;ouml;rneğinden atanan değer, value olarak taşınmakta ve SunucuAdi alanına aktarılmaktadır.*/
            }
        }

        public string veritabani
        {
            get
            {
                return VeritabaniAdi;
            }
            set
            {
                VeritabaniAdi =value;
            }
        }

        public string kullanici /* Bu &amp;ouml;zellik sadece set bloğuna sahip olduğu i&amp;ccedil;in sadece değer atanabilir ama i&amp;ccedil;eriği g&amp;ouml;r&amp;uuml;nt&amp;uuml;lenemez. Yani kullanici &amp;ouml;zelliğini bir sınıf &amp;ouml;rneğinde, Kullanici private alanının değerini &amp;ouml;ğrenmek i&amp;ccedil;in kullanamayız.*/
        {
            set
            {
                Kullanici =value;
            }
        }

        public string parola
        {
            set
            {
                Parola =value;
            }
        }

        public SqlConnection con /* Buradaki &amp;ouml;zellik SqlConnection nesne t&amp;uuml;r&amp;uuml;ndendir ve sadece okunabilir bir &amp;ouml;zelliktir. Nitekim sadece get bloğuna sahiptir. */
        {
            get
            {
                return Kon;
            }
        }

        public bool baglantiDurumu
        {
            get
            {
                return BaglantiDurumu;
            }
            set /* Burada set bloğunda başka kodlar da ekledik. Kullanıcımız bu sınıf &amp;ouml;rneği ile bir Sql bağlantısı yarattıktan sonra eğer bu bağlantıyı a&amp;ccedil;mak isterse baglantiDurumu &amp;ouml;zelliğine true değerini g&amp;ouml;ndermesi yeterli olucaktır. Eğer false değeri g&amp;ouml;nderirse bağlantı kapatılır. Bu işlemleri ger&amp;ccedil;ekleştirmek i&amp;ccedil;in ise BaglantiAc ve BaglantiKapat isimli sadece bu sınıfa &amp;ouml;zel olan private metodlarımızı kullanıyoruz.*/
            {
                BaglantiDurumu =value;
                if (value == true)
                {
                    BaglantiAc();
                }
                else
                {
                    BaglantiKapat();
                }
            }
        }

        public string hataDurumu
        {
            get
            {
                return HataDurumu;
            }
        }

        public Veri() /* Her sınıf mutlaka hi&amp;ccedil; bir parametresi olmayan ve yandaki satırda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, sınıf adı ile aynı isme sahip bir metod i&amp;ccedil;erir. Bu metod sınıfın yapıcı metodudur. Yani Constructor metodudur. Bir yapıcı metod i&amp;ccedil;ersinde &amp;ccedil;oğunlukla, sınıf i&amp;ccedil;inde kullanılan alanlara başlangı&amp;ccedil; değerleri atanır veya ilk atamalar yapılır. Eğer siz bir yapıcı metod tanımlamaz iseniz, derleyici aynen bu metod gibi boş bir yapıcı oluşturacak ve sayısal alanlara 0, mantıksal alanlara false ve string alanlara null başlangı&amp;ccedil; değerlerini atayacaktır.*/
        {
        }

        /* Burada biz bu sınıfın yapıcı metodunu aşırı y&amp;uuml;kl&amp;uuml;yoruz. Bu sınıftan bir nesneyi izleyen yapılandırıcı ile oluşturabiliriz. Bu durumda yapıcı metod i&amp;ccedil;erdiği d&amp;ouml;rt parametreyi alıcaktır. Metodun amacı ise belirtilen değerlere g&amp;ouml;re bir Sql bağlantısı yaratmaktır.*/
        public Veri(string sunucuAdi, string veritabaniAdi, string kullaniciAdi, string sifre)
        {
            SunucuAdi = sunucuAdi;
            VeritabaniAdi = veritabaniAdi;
            Kullanici = kullaniciAdi;
            Parola = sifre;
            Baglan();
        }

        /* Burada bir metod tanımladık. Bu metod ile bir Sql bağlantısı oluşturuyoruz. Eğer bir metod geriye herhangibir değer g&amp;ouml;ndermiyecek ise yani vb.net teki fonksiyonlar gibi &amp;ccedil;alışmayacak ise void olarak tanımlanır. Ayrıca metodumuzun sadece bu sınıf i&amp;ccedil;erisinde kullanılmasını istediğimiz i&amp;ccedil;in private olarak tanımladık. Bu sayede bu sınıf dışından &amp;ouml;rneğin formumuzdan ulaşamamalarını sağlamış oluyoruz.*/

        private void Baglan()
        {
            SqlConnection con =new SqlConnection("data source=" + SunucuAdi + ";initial catalog=" + VeritabaniAdi + ";user id=" + Kullanici + ";password=" + Parola);
            Kon = con;
        }

        /* Bu metod ile Sql sunucumuza olan bağlantıyı a&amp;ccedil;ıyoruz ve BaglantiDurumu alanına true değerini aktarıyoruz.*/
        private void BaglantiAc()  /* Bu metod private tanımlanmıştır. &amp;Ccedil;&amp;uuml;nk&amp;uuml; sadece bu sınıf i&amp;ccedil;erisinden &amp;ccedil;ağırılabilsin istiyoruz. */
        {
            Kon.Open();
            try
            {
                BaglantiDurumu =true;
                HataDurumu = "Baglanti sağlandi";
            }
            catch (Exception h)
            {
                HataDurumu = "Baglanti Sağlanamdı. " + h.Message.ToString();
            }
        }
        /* Bu metod ilede Sql bağlantımızı kapatıyor ve BaglantiDurumu isimli alanımıza false değerini akatarıyoruz.*/
        private void BaglantiKapat()
        {
            Kon.Close();
            BaglantiDurumu =false;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi ise sınıfımızı kullandığımız &amp;ouml;rnek uygulama formunu tasarlayalım . Bu uygulamamız aşağıdaki form ve kontrollerinden oluşuyor.&amp;nbsp;&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk25_3.gif" alt="" width="320" height="264" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 3. Form Tasarımımız.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Formumuza ait kodlar ise ş&amp;ouml;yle.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Veriler.Veri v;
private void btnBaglan_Click(object sender, System.EventArgs e)
{
     /* Bir sınıf &amp;ouml;rneği yaratmak i&amp;ccedil;in new anahtar kelimesini kullanırız. New anahtar kelimesi bize kullanabileceğimiz t&amp;uuml;m yapıcı metodları g&amp;ouml;sterecektir. (IntelliSense &amp;ouml;zelliği). */
     v=new Veri(txtSunucu.Text,txtVeritabani.Text,txtKullanici.Text,txtParola.Text);&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk25_4.gif" alt="" width="609" height="53" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;}

private void btnAc_Click(object sender, System.EventArgs e)
{

     v.baglantiDurumu= true;
     stbDurum.Text="Sunucu Bağlantısı A&amp;ccedil;ık? "+v.baglantiDurumu.ToString();

}

private void btnKapat_Click(object sender, System.EventArgs e)
{
     v.baglantiDurumu=false;
     stbDurum.Text="Sunucu Bağlantısı A&amp;ccedil;ık? "+v.baglantiDurumu.ToString();
} &lt;/pre&gt;
&lt;p&gt;Şimdi uygulamamızı bir &amp;ccedil;alıştıralım.&amp;nbsp;&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk25_5.gif" alt="" width="320" height="264" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 5. Bağlantıyı a&amp;ccedil;mamız halinde.&amp;nbsp;&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk25_6.gif" alt="" width="320" height="264" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 6. Bağlantıyı kapatmamız halinde.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Değerli okurlarım, ben bu sınıfın geliştirilmesini size bırakıyorum. Umarım sınıf kavramı ile ilgili bilgilerimizi hatırlamış ve yeni ufuklara yelken a&amp;ccedil;maya hazır hale gelmişsinizdir. Bir sonraki makalemizde sınıflar arasında kalıtım kavramına bakıcak ve b&amp;ouml;ylece nesneye dayalı programlama terminolojisinin en &amp;ouml;nemli kavramlarından birini incelemeye &amp;ccedil;alışsacağız.&amp;nbsp;Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2003-12-23 12:00:00</pubDate>
  <slug>Bir-Sınıf-Yazalım-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>oop</tag>
    <tag>class</tag>
    <tag>net</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>