<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Net Data Providers(Veri Sağlayıcıları)</title>
  <description>Bugünkü makalemiz ile, ADO.NET ' te yer alan veri sağlayıcılarını inceleyeceğiz. Bildiğiniz gibi hepimiz uygulamalarımızda yoğun bir şekilde veri kaynaklarını kullanmaktayız. Normalde sistemimizde, bu veri kaynaklarına erişmek için kullanılan sistem sürücüleri vardır. Bu sürücüler, sistemimize dll kütüphaneleri olarak yüklenirler ve kendilerini sisteme kayıt ederler(register). Bu noktadan itibaren bu veri sürücülerinin içerdiği fonksiyonları kullanarak veritabanları üzerinde istediğimiz işlemleri gerçekleştirebiliriz. Kısaca, bu veri sürücüleri uygulamalarımız ile, veritabanı arasındaki iletişimi sağlarlar. Sistemizide yüklü olan programlara göre pek çok veri sürücüsüne sahip olabiliriz. Örneğin ODBC sürücüleri, SQL sürücüleri, Ole Db Jet sürücüleri ve bazıları.</description>
  <content>&lt;p align="left"&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p align="left"&gt;Bug&amp;uuml;nk&amp;uuml; makalemiz ile, ADO.NET ' te yer alan veri sağlayıcılarını inceleyeceğiz. Bildiğiniz gibi hepimiz uygulamalarımızda yoğun bir şekilde veri kaynaklarını kullanmaktayız. Normalde sistemimizde, bu veri kaynaklarına erişmek i&amp;ccedil;in kullanılan sistem s&amp;uuml;r&amp;uuml;c&amp;uuml;leri vardır. Bu s&amp;uuml;r&amp;uuml;c&amp;uuml;ler, sistemimize dll k&amp;uuml;t&amp;uuml;phaneleri olarak y&amp;uuml;klenirler ve kendilerini sisteme kayıt ederler(register). Bu noktadan itibaren bu veri s&amp;uuml;r&amp;uuml;c&amp;uuml;lerinin i&amp;ccedil;erdiği fonksiyonları kullanarak veritabanları &amp;uuml;zerinde istediğimiz işlemleri ger&amp;ccedil;ekleştirebiliriz. Kısaca, bu veri s&amp;uuml;r&amp;uuml;c&amp;uuml;leri uygulamalarımız ile, veritabanı arasındaki iletişimi sağlarlar. Sistemizide y&amp;uuml;kl&amp;uuml; olan programlara g&amp;ouml;re pek &amp;ccedil;ok veri s&amp;uuml;r&amp;uuml;c&amp;uuml;s&amp;uuml;ne sahip olabiliriz. &amp;Ouml;rneğin ODBC s&amp;uuml;r&amp;uuml;c&amp;uuml;leri, SQL s&amp;uuml;r&amp;uuml;c&amp;uuml;leri, Ole Db Jet s&amp;uuml;r&amp;uuml;c&amp;uuml;leri ve bazıları.&lt;/p&gt;
&lt;p align="left"&gt;ADO.NET ile veritabanı uygulamaları geliştirirken, bu s&amp;uuml;r&amp;uuml;c&amp;uuml;ler &amp;uuml;zerinden veritabanlarına erişim sağlarız. Bu sebeple .Net Framework 'te her bir veri s&amp;uuml;r&amp;uuml;c&amp;uuml;s&amp;uuml; i&amp;ccedil;in geliştirilmiş veri sağlayıcıları (data providers) vardır. Bu veri sağlayıcılarının g&amp;ouml;revi, uygulamalarımız ile veri s&amp;uuml;r&amp;uuml;c&amp;uuml;lerini bağlamak ve veri s&amp;uuml;r&amp;uuml;c&amp;uuml;lerindeki ilgili k&amp;uuml;t&amp;uuml;phane fonksiyonlarını &amp;ccedil;alıştırarak veriler &amp;uuml;zerinde işlem yapabilmemizi sağlamaktır. .Net Framework' &amp;uuml;n 1.1 s&amp;uuml;r&amp;uuml;m&amp;uuml; aşağıdaki listede yer alan veri sağlayıcıları ile birlikte gelmektedir. .Net Framework'&amp;uuml;n ilk s&amp;uuml;r&amp;uuml;mlerinde sadece Sql ve Ole Db veri sağlayıcıları varsayılan olarak yer almaktadır. Ancak 1.1 s&amp;uuml;r&amp;uuml;m&amp;uuml; ile birlikte bu veri sağlayıcılarına, Oracle ve ODBC veri sağlayıcılarıda eklenmiştir.&lt;/p&gt;
&lt;div&gt;
&lt;table id="AutoNumber1" style="width: 37%; height: 143px;" border="1" cellspacing="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td bgcolor="#cccccc" width="50%" height="28"&gt;
&lt;p align="center"&gt;&lt;span style="font-weight: bold; font-family: Verdana;"&gt;.Net Framework Veri Sağlayıcıları&lt;/span&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="50%" height="30"&gt;&amp;nbsp;&amp;nbsp; Data Provider For SQL Server&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="50%" height="26"&gt;&amp;nbsp;&amp;nbsp; Data Provider For OLE DB&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="50%" height="27"&gt;&amp;nbsp;&amp;nbsp; Data Provider For ODBC&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="50%" height="28"&gt;&amp;nbsp;&amp;nbsp; Data Provider For Oracle&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p align="left"&gt;&lt;em&gt;Tablo 1: .NET Veri Sağlayıcıları&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şimdi dilerseniz, bu veri sağlayıcıları kısaca incelemeye &amp;ccedil;alışalım.&lt;/p&gt;
&lt;p align="left"&gt;SQL veri sağlayıcısına ait t&amp;uuml;m &amp;uuml;yeler, System.Data.SQLClient isim uzayında yer almaktadır. SQL veri sağlayıcısının en &amp;ouml;nemli &amp;ouml;zelliği, sql motoruna direkt sql api'si &amp;uuml;zerinden erişim sağlayabilmesidir. Bu &amp;ouml;zellik ona diğer veri sağlayıcılarına g&amp;ouml;re daha y&amp;uuml;ksek performans kazandırır. Nitekim sql veri sağlayıcısı, sql server'a doğrudan ulaşmak i&amp;ccedil;in kendi iletişim protokol&amp;uuml; olan TDS(Tabular Data Stream)'yi kullanmaktadır. Elbette bu &amp;ouml;zelliği ile, &amp;ouml;rneğin SqlDataReader nesnesinin kullanıldığı veri okuma y&amp;ouml;ntemlerinde, ole db veri kaynağına g&amp;ouml;re &amp;ccedil;ok daha hızlı ve verimlidir. Nitekim aynı sql veri kaynaklarına ole db veri sağlayıcısı ilede erişmemiz m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Ama belirttiğimiz gibi performans ve verimlilik bu iki veri kaynağı i&amp;ccedil;in olduk&amp;ccedil;a farklıdır.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk44_1.gif" alt="" width="537" height="139" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt;Şekil 1. Sql Veri Sağlayıcımız.&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;Sql veri sağlayıcısı, Sql Server'ın 7 ve daha &amp;uuml;st&amp;uuml; versiyonlarını desteklemektedir. Bu nedenle 6.5 versiyonu ve daha &amp;ouml;ncesi i&amp;ccedil;in, Ole Db veri sağlayıcısını kullanmak zorundayız. Diğer yandan Sql veri sağlayıcısı MDAC(Microsoft Data Access Component)'ın 2.6 veya &amp;uuml;st&amp;uuml; s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml;n sistemimizde kurulu olmasını gerektirmektedir. Sql veri sağlayıcısı, sql server'ın 7.0 ve sonraki s&amp;uuml;r&amp;uuml;mlerinde &amp;ouml;zellikle &amp;ccedil;ok katlı uygulamalarda y&amp;uuml;ksek verim ve performans sağlar.&lt;/p&gt;
&lt;p align="left"&gt;Ole Db veri sağlayıcısı, Ole Db desteği veren t&amp;uuml;m veri s&amp;uuml;r&amp;uuml;c&amp;uuml;leri ile ilişki kurabilmektedir. Bunu yaparken, Ole Db Com nesnelerini kullanır. Aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, uygulamamızda ole db veri sağlayıcısı kullanarak, bir oledb veri kaynağına erişmek olduk&amp;ccedil;a maliyetlidir. Bunun yanında ole db'yi destekleyen &amp;ccedil;ok &amp;ccedil;eşitli veri kaynağı s&amp;uuml;r&amp;uuml;c&amp;uuml;lerinin olması ole db nin &amp;uuml;r&amp;uuml;n yelpazesini genişliğini g&amp;ouml;sterir.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk44_2.gif" alt="" width="403" height="459" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt;Şekil 2 . Ole Db Veri Sağlayıcısı&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;Ole Db veri sağlayıcısı Ole Db desteği veren her t&amp;uuml;rl&amp;uuml; veri s&amp;uuml;r&amp;uuml;c&amp;uuml;s&amp;uuml; ile &amp;ccedil;alışabilir. Aşağıda ole db veri sağlayıcısı ile kullanılabilen &amp;ouml;rnek Ole Db veri s&amp;uuml;r&amp;uuml;c&amp;uuml;leri listelenmiştir.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk44_3.gif" alt="" width="278" height="153" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Ole Db veri sağlayıcısının .net framework &amp;uuml;yeleri, System.Data.OleDb isim uzayında yer alır. &amp;Ccedil;oğunlulkla bu veri sağlayıcısını Access tablolarına erişmek i&amp;ccedil;in uygulamalarımızda kullanmaktayız. Bununla bilrikte Paradox, dBASE, Excel, FoxPro,Oracle 7.3,Oracle8 gibi veri tablolarınada erişebiliriz. Diğer yandan Oracle s&amp;uuml;r&amp;uuml;c&amp;uuml;lerine ve ODBC s&amp;uuml;r&amp;uuml;c&amp;uuml;lerinede erişebiliriz. Ancak elbetteki, &amp;ccedil;ok katlı uygulamalarda, sql veri sağlayıcısını veya oracle veri sağlayıcısını tercih etmemiz daha doğru olucaktır. Diğer yandan ole db veri sağlayıcısı, com servsileri ile veri s&amp;uuml;r&amp;uuml;c&amp;uuml;lerine eriştiği i&amp;ccedil;in, &amp;ouml;zellikle sql veri sağlayıcısına g&amp;ouml;re &amp;ccedil;ok daha d&amp;uuml;ş&amp;uuml;k bir performans sergiler. Ole Db veri kaynakları ile &amp;ccedil;alışan ole db veri sağlayıcısının , &amp;ouml;zellikle sql server'ın 6.5 ve &amp;ouml;nceki s&amp;uuml;r&amp;uuml;mlerinin kullanıldığı tek katlı ve &amp;ccedil;ok katlı uygulamalarda kullanılması tercih edilir. Bununla birlikte, access tabloları ile &amp;ccedil;alışırken, &amp;ccedil;ok katlı mimarilerin, bu veri tabloları &amp;uuml;zerinden ole db sağlayıcıları ile oluşturulması microsoft otoriterlerince tavsiye edilmemektedir.&lt;/p&gt;
&lt;p align="left"&gt;ODBC veri sağlayıcısı, Ole Db veri sağlayıcısı gibi, ODBC desteği veren s&amp;uuml;r&amp;uuml;c&amp;uuml;ler ile, ODBC Servis Component'lerini kullanarak iletişim kurar.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk44_4.gif" alt="" width="632" height="111" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt;Şekil 3 . ODBC Veri Sağlayıcısı&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;ODBC veri sağlayıcısı ile ilgili &amp;uuml;yeler, .net framework i&amp;ccedil;inde, System.Data.Odbc isim uzayında yer almaktadır. Aslında bu veri sağlayıcı, .net framework'&amp;uuml;n 1.0 versiyounda yer almamaktaydı. Ancak 1.1 verisyonu ile birlikte ADO.NET ' teki yerini almıştır. ODBC s&amp;uuml;r&amp;uuml;c&amp;uuml;s&amp;uuml; yardımıyla,sql server'a, access tablolarına ve odbc'yi destekleyen veri sr&amp;uuml;c&amp;uuml;lerine erişebiliriz. ODBC veri sağlayıcısı, odbc veri kaynakları &amp;uuml;zerinden yapılan tek katlı (single-tier) ve orta katlı(middle-tier) mimarilerinde kullanılabilir.&lt;/p&gt;
&lt;p align="left"&gt;Oracle servis sağlayıcısı, .net framework'&amp;uuml;n System.Data.OracleClient isim uzayında yer alan &amp;uuml;yelerden oluşur. Oracle servis sağlayıcısı, oracle veri kaynaklarına erişebilmek i&amp;ccedil;in, sql veri sağlayıcısı gibi kendi iletişim protok&amp;uuml;n&amp;uuml; i&amp;ccedil;eren Oracle Client Connectivity'yi kullanır. Oracle veri sağlayıcısının .net'e yerleştirilmesindeki temel ama&amp;ccedil;, oracle veri tabanlarına ole db veri sağlayıcısı ile ole db &amp;uuml;zerinden değil, doğrudan erişilebilmesini sağlamaktır. Bu sayede oracle veri kaynağı ile oluşturulan etkileşimde en iyi performansın elde edilmesi sağlanmıştır. Zaten bu y&amp;ouml;n&amp;uuml; ilede oracle veri sağlayıcısı, sql veri sağlayıcısına benzer bir yapıdadır. Doğal olarak, oracle veri kaynakları &amp;uuml;zerinde ger&amp;ccedil;ekleştirilen, &amp;ccedil;ok katlı ve tek katlı mimarilerde y&amp;uuml;ksek performans sergilemektedir.&lt;/p&gt;
&lt;p align="left"&gt;Bu makalemizde .net veri sağlayıcılarına kısaca değinmeye &amp;ccedil;alıştık. İlerliyen makalelerimiz ile birlikte ado.net'in t&amp;uuml;m kavramlarını inclemeye &amp;ccedil;alışacağım. Bir sonraki makalemde ole db veri sağlayıcısı &amp;uuml;yelerinden olan, OleDbConnection nesnesini incelemeye &amp;ccedil;alışacağım. Hepinize mutlu g&amp;uuml;nler ve iyi &amp;ccedil;alışmalar dilerim.&lt;/p&gt;</content>
  <pubDate>2004-01-22 08:00:00</pubDate>
  <slug>Net-Data-Providers(Veri-Saglayc4b1cc4b1larc4b1)-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>data-providers</tag>
    <tag>sql</tag>
    <tag>sql-server</tag>
    <tag>database</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>