<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Kimdir Bu Travis?</title>
  <description>Continuous Integration kaliteli ve sorunsuz kod çıkartmanın önemli safhalarından birisi. DevOps kültürü için değerli olan, Continuous Deployment/Delivery ile bir anılan CI'ın uygulanmasında en temel noktalar kodun sürekli test edilebilir olması ve ne kadarının kontrol altına alındığının bilinmesi. Başarılı bir Build için bu kriterlerin metrik olarak gerekli değerlerin üzerine çıkması şart. Ancak bu metriklere uyan bir Build, dağıtıma gönderilebilir bir aday sürüm haline gelebilir.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2019/04/39/Travis.jpg" alt="" /&gt;Ge&amp;ccedil;en g&amp;uuml;n &amp;ccedil;alışma odamın artık ardiye haline gelmiş bir dolabını temizlemek &amp;uuml;zere kolları sıvadım. Sayısız network kablosu, yazılabilir DVDler, m&amp;uuml;svette notlar, bir ka&amp;ccedil; m&amp;uuml;zik CDsi, y&amp;uuml;ksek lisanstan kalma ders kitapları, kulaklıkları kayıp walkman, bataryası şişmiş Playstation Portable ve daha bir &amp;ccedil;ok ıvır zıvır eşyayla doluydu. Hangileri gerekli hangileri gereksiz diye ayıklarken d&amp;ouml;nem d&amp;ouml;nem sebebsiz yere aldığım MP3 &amp;ccedil;alarlara denk geldim. Kocaman bir discman bile vardı. Ancak g&amp;ouml;z&amp;uuml;m arkalarda k&amp;ouml;şeye sıkışmış 1 TBlık Harddisk'e takıldı. Zamanında E-book'lar, filmler ve m&amp;uuml;zikler i&amp;ccedil;in kullandığım bir disk olduğunu hayal mayal hatırlıyordum.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Eşyaları ayıklamayı bırakıp diskin i&amp;ccedil;inde ne var ne yok bakmak istedim. Daha yeni aldığım Mac Mini &lt;em&gt;(ona ahch-to adını verdim)&lt;/em&gt; ile a&amp;ccedil;maya &amp;ccedil;alıştım. Sierra onu pek sevmedi diyebilirim. Bunun &amp;uuml;zerine Westworld'e ge&amp;ccedil;meye karar verdim. Ubuntu'nun a&amp;ccedil;amayacağı disk yoktu. Diskin i&amp;ccedil;inde beklediğimden de geniş bir arşiv vardı. .Net 2.0/3.5 ile yazılmış projeler, makaleler i&amp;ccedil;in toplanmış belgeler, cv'min seksensekiz &amp;ccedil;eşidi, bloğun d&amp;ouml;nemsel yedekleri, fotoğraf&amp;ccedil;ılık ile uğraştığım zamanlardan kalma klas&amp;ouml;rler ve diğer şeyler&lt;/p&gt;
&lt;p&gt;G&amp;uuml;n&amp;uuml;n bir b&amp;ouml;l&amp;uuml;m&amp;uuml;n&amp;uuml; o arşivleri tarayarak ge&amp;ccedil;irdim. Sonra ID Taglerine kadar d&amp;uuml;zenlediğim MP3leri karışık sırada &amp;ccedil;alayım dedim. MP3 &amp;ccedil;almayalı yıllar olmuştur. Hayatımız bulutlar &amp;uuml;zerinde seyretmeye başladığından beri onu da Spotify gibi ortamlardan dinler olduk. Pek azımızın MP3 satın aldığını veya indirdiğini d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Hele ki mobil cihazlarda 1 kb yer bile tutmayan&amp;nbsp;milyonlarca par&amp;ccedil;ayı dinleme fırsatı varken. Şarkılar &amp;ccedil;alarken bende yeni araştırma konum olan Travis'le ilgili saturday-night-works &amp;ccedil;alışmalarından birisini yapıyordum. Hoş bir tesad&amp;uuml;f olmalı ki &amp;ccedil;alışırken &amp;ccedil;alan par&amp;ccedil;alardan birisi de Travis'in 2001 yılında &amp;ccedil;ıkarttığı The Invisible Band alb&amp;uuml;m&amp;uuml;ndeki Sing isimli şarkılarıydı. Konuyla ne alakası vardı bilemiyorum. Sadece isim benzerliği :) Aradan bir s&amp;uuml;re ge&amp;ccedil;tikten sonra Travis-CI &amp;ccedil;alışmasını bloğuma not olarak d&amp;uuml;şmeye karar verdim.&lt;/p&gt;
&lt;p&gt;Continuous Integration kaliteli ve sorunsuz kod &amp;ccedil;ıkartmanın &amp;ouml;nemli safhalarından birisi. DevOps k&amp;uuml;lt&amp;uuml;r&amp;uuml; i&amp;ccedil;in değerli olan, Continuous Deployment/Delivery ile bir anılan CI'ın uygulanmasında en temel noktalar kodun s&amp;uuml;rekli test edilebilir olması ve ne kadarının kontrol altına alındığının bilinmesi. Başarılı bir Build i&amp;ccedil;in bu kriterlerin metrik olarak gerekli değerlerin &amp;uuml;zerine &amp;ccedil;ıkması şart. Ancak bu metriklere uyan bir Build, dağıtıma g&amp;ouml;nderilebilir bir aday s&amp;uuml;r&amp;uuml;m haline gelebilir.&lt;/p&gt;
&lt;p&gt;CI/CD hattını tesis ederken kullanılabilecek bir &amp;ccedil;ok yardımcı &amp;uuml;r&amp;uuml;n bulunuyor. G&amp;uuml;ncel olarak &amp;ccedil;alışmakta olduğum şirkette Microsoft'un VSTS'i kullanılmakta. Bunun muadili olabilecek Jenkins'de diğer bir alternatif olarak karşımıza &amp;ccedil;ıkıyor. Benim &amp;ouml;ğrenmek istediğim ise Travis. Travis, Jenkins gibi kurulum ve bilgi maliyeti fazla olmayan, github ile kolayca entegre edilebilen, geliştirici dostu, &amp;uuml;cretsiz bir CI &amp;uuml;r&amp;uuml;n&amp;uuml; olarak karşımıza &amp;ccedil;ıkıyor. Amacım onu &amp;ccedil;ok basit bir uygulama ile deneyimlemek.&lt;/p&gt;
&lt;h2&gt;İhtiya&amp;ccedil;lar &lt;em&gt;(Yapılacaklar)&lt;/em&gt;&lt;/h2&gt;
&lt;p&gt;İlk başta ihtiya&amp;ccedil;ları ve yapılacakları belirlemek lazım.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;Ouml;ncelikle test edilebilir &amp;ouml;rnek bir uygulamaya ihtiyacımız var. Travis'in desteklediği dil ve platform yelpazesi olduk&amp;ccedil;a geniş.&lt;em&gt; (Ben .Net Core tabanlı bir k&amp;uuml;t&amp;uuml;phaneyi ele almayı tercih ettim)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Uygulamayı github &amp;uuml;zerindeki bir proje ile ilişkilendirmek gerekiyor. Nitekim Travis, code base olarak GitHub tarafını kullanmakta.&lt;/li&gt;
&lt;li&gt;Travis'in Github entegrasyonu sayesinde code base &amp;uuml;zerinde yapılan her Push sonrası otomatik olarak CI s&amp;uuml;reci başlayacak. Bu s&amp;uuml;re&amp;ccedil;te uygulamanın ihtiya&amp;ccedil; duyduğu ortam paketleri y&amp;uuml;klenip, build işlemi ger&amp;ccedil;ekleştirilirken, aynı zamanda testler de koşulacak&amp;nbsp;&lt;em&gt;(CI s&amp;uuml;reci tamamen bulutta işleyecek)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Uygulama i&amp;ccedil;in belki de en kritik ihtiya&amp;ccedil; .travis.yml&lt;em&gt;&amp;nbsp;&lt;/em&gt;dosyası ve i&amp;ccedil;eriği. Docker &amp;ccedil;alışma dinamiklerine benzer şekilde Travis ortamı i&amp;ccedil;in gerekli bilgileri i&amp;ccedil;eren bir dosya olarak d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/li&gt;
&lt;/ul&gt;
&lt;h2&gt;Travis Tarafının Hazırlanması&lt;/h2&gt;
&lt;p&gt;&amp;Ouml;ncelikle &lt;a href="https://travis-ci.com" target="_blank"&gt;Travis'in ilgili sayfasına gidip&lt;/a&gt; Github hesabımız ile kayıt olmamız gerekiyor. Sonrasında Acivate d&amp;uuml;ğmesine basarak ilerliyoruz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/04/39/credit_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İzleyen adımda CI s&amp;uuml;recine dahil etmek istediğimiz Github projesini se&amp;ccedil;iyoruz. Ben &amp;ouml;rnek i&amp;ccedil;in hello-travis isimli bir repo oluşturdum &lt;em&gt;(Bu arada Travis'in yer yer &amp;ccedil;ıkan logo'ları ger&amp;ccedil;ekten &amp;ccedil;ok tatlı)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/04/39/credit_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Artık Travis ile Github projemiz birbirlerine bağlanmış durumdalar. Bunu Travis tarafındaki Repositories sekmesinden g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/04/39/credit_3.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Projenin Geliştirilmesi&lt;/h2&gt;
&lt;p&gt;&amp;Ouml;rnek olarak .Net Core tabanlı bir sınıf k&amp;uuml;t&amp;uuml;phanesi geliştirmeye karar verdim. İlk olarak Github projesini Westworld'e &lt;em&gt;(Ubuntu 18.04, 64bit)&lt;/em&gt; klonladım.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;git clone https://github.com/buraksenyurt/hello-travis.git&lt;/pre&gt;
&lt;p&gt;Ardından aşağıdaki adımları izleyerek bir .Net Core klas&amp;ouml;r ağacı oluşturdum.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new sln
mkdir MathService
cd MathService
dotnet new classlib
mv Class1.cs Common.cs
cd ..
dotnet sln add ./MathService/MathService.csproj
mkdir MathService.Tests
cd MathService.Tests
dotnet new xunit
dotnet add reference ../MathService/MathService.csproj
mv UnitTest1.cs CommonTest.cs
cd ..
dotnet sln add ./MathService.Tests/MathService.Tests.csproj
touch .travis.yml&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncelikle klonlanan klas&amp;ouml;rde bir Solution oluşturuyoruz. İsim vermediğimiz i&amp;ccedil;in hello-travis isimli bir solution dosyası &amp;uuml;retilecektir. Ardından MathService isimli bir sınıf k&amp;uuml;t&amp;uuml;phanesi &amp;uuml;retiyor ve Class1.cs dosyasının adını Common.cs olarak değiştiriyoruz. Projeyi, solution i&amp;ccedil;eriğine de ekledikten sonra bu kez MathService.Tests isimli xUnit tipinden bir test projesi oluşturuyoruz. Bu projeye MathService k&amp;uuml;t&amp;uuml;phanesini referans edip son olarak test projesini solution'a bildiriyoruz. En son adımda dikkat edeceğiniz &amp;uuml;zere .travis.yml isimli yaml dosyasını oluşturmaktayız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/04/39/credit_4.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Kodları aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;p&gt;Common.cs&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace MathService
{
    public class Common
    {
        public bool IsNegative(int number)
        {
            return false;
        }

        public bool IsEven(int number)
        {
            return number % 2 == 0;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;CommonTest.cs i&amp;ccedil;eriği&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using Xunit;
using MathService;

namespace MathService.Tests
{
    public class CommonTest
    {
        private Common _common;

        public CommonTest()
        {
            _common = new Common();
        }

        [Fact]
        public void Negative_Four_Is_Negative()
        {
            var result=_common.IsNegative(-4);

            Assert.True(result,"-4 is negative number");
        }


        [Fact]
        public void Four_Is_Even()
        {
            var result=_common.IsEven(4);

            Assert.True(result,"4 is an even number");
        }
    }
}
&lt;/pre&gt;
&lt;h2&gt;.travis.yml&lt;/h2&gt;
&lt;p&gt;Pek tabii Travis entegrasyonu i&amp;ccedil;in en kritik nokta bu dosya ve i&amp;ccedil;eriği.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;language: csharp
solution: hello-travis.sln
mono: none
dotnet: 2.1.502

script:
- dotnet build
- dotnet test MathService.Tests/MathService.Tests.csproj&lt;/pre&gt;
&lt;p&gt;Dosya i&amp;ccedil;erisinde Travis'in &amp;ccedil;alışma zamanı ortamı i&amp;ccedil;in bir takım bilgiler yer alıyor. Bu bilgilere g&amp;ouml;re .Net Core 2.1.502 versiyonlu runtime &amp;uuml;zerinde C# dilinin kullanıldığı bir uygulama s&amp;ouml;z konusu. Buna uygun bir makineyi Travis kendisi hazırlayacak&amp;nbsp;&lt;em&gt;(Travis'in log detaylarını incelemekte yarar var)&lt;/em&gt; script bloğunda yer alan ifadeler ise her push sonrası Travis tarafından icra edilecek olan işleri i&amp;ccedil;eriyor. &amp;Ouml;nce build işlemi, sonrasında da test'in &amp;ccedil;alıştırılması. &amp;Ouml;rnekte kullanılan .Net &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;n&amp;uuml;n &lt;a href="https://github.com/buraksenyurt/hello-travis" target="_blank"&gt;orjinal github adresi&lt;/a&gt; burasıdır.&lt;/p&gt;
&lt;h2&gt;&amp;Ccedil;alışma Zamanı&lt;/h2&gt;
&lt;p&gt;İlk olarak hatalı &amp;ccedil;alışan testi bulunduran bir geliştirme yapmayı tercih ettim. Local'de test sonu&amp;ccedil;ları aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibiydi.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet test&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/04/39/credit_5.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hal b&amp;ouml;yleyken kodları commit edip github sunucusuna push ile g&amp;ouml;nderdim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;git add .
git commit -m "fonksiyonal eklendir ve test kodları yazıldı"
git status
git push&lt;/pre&gt;
&lt;p&gt;Travis'e gittiğimde otomatik bir Build işleminin başladığını fark ettim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/04/39/credit_6.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bir s&amp;uuml;re sonra Fail eden test nedeniyle Build işlemi de hatalı olarak sonlandı &lt;em&gt;(Bu zaten istediğimiz ve beklediğimiz durum)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/04/39/credit_7.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Log raporu sonu&amp;ccedil;ları da aşağıdaki gibi oluştu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/04/39/credit_8.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sonrasında hata alan test kodunu d&amp;uuml;zelterek ilerledim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace MathService
{
    public class Common
    {
        public bool IsNegative(int number)
        {
            return number&amp;lt;0;
        }

        public bool IsEven(int number)
        {
            return number % 2 == 0;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Westworld &amp;uuml;zerinde &lt;em&gt;dotnet test&lt;/em&gt; terminal komutu ile testlerin tamamının &lt;em&gt;(sadece iki test var :P)&lt;/em&gt; başarılı olup olmadığını kontrol ettim. Ardından kodu commit edip tekrardan github'a push'ladım. Travis kısa s&amp;uuml;re i&amp;ccedil;inde otomatik olarak yeni bir build işlemi başlattı. Bu sefer beklediğim gibi testler başarılı olduğundan build sonucu Passed olarak işaretlendi. İşte &amp;ccedil;alışma zamanına ait ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;leri.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/04/39/credit_9.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/04/39/credit_10.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/04/39/credit_11.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere t&amp;uuml;m build işlemlerinin tarih&amp;ccedil;esini de g&amp;ouml;rebiliyoruz. Bu tip loglar bizim i&amp;ccedil;in olduk&amp;ccedil;a &amp;ouml;nemli.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/04/39/credit_12.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Ben Neler &amp;Ouml;ğrendim&lt;/h2&gt;
&lt;p&gt;Pek tabii bu &amp;ccedil;alışma sırasında da &amp;ouml;ğrendiğim bir &amp;ccedil;ok şey oldu.&amp;nbsp;Kabaca &amp;ouml;ğrendiklerimi ş&amp;ouml;yle sıralayabilirim.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Travis'in CI s&amp;uuml;recindeki yerini&lt;/li&gt;
&lt;li&gt;Travis ile bir Github reposunun nasıl&amp;nbsp;bağlanabileceğini&lt;/li&gt;
&lt;li&gt;.travis.yml dosyasının i&amp;ccedil;eriğinin nasıl olması gerektiğini ve i&amp;ccedil;eriğindeki ifadelerin ne anlama geldiğini&lt;/li&gt;
&lt;li&gt;.Net Core tarafında xUnit test ortamının nasıl oluşturulabileceğini&lt;/li&gt;
&lt;li&gt;git push sonrası işletilen Build s&amp;uuml;recinin izlenmesini&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir maceranın daha sonuna. Sanırım Startup tadında bir projeye başlayacak olsak, takımın geliştirme s&amp;uuml;recinde CI aracı olarak Travis'i alternatif olarak d&amp;uuml;ş&amp;uuml;nebiliriz. Kullanımının kolay olması, github ile entegre &amp;ccedil;alışabilmesi ve bu nedenle push işlemleri sonrası build işlemlerinin otomatik olarak başlaması cezbedici &amp;ouml;zelliklerden. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2019-04-29 07:24:00</pubDate>
  <slug>Kimdir-Bu-Travis</slug>
  <tags>
    <tag>travis</tag>
    <tag>ci/cd</tag>
    <tag>continuous-integration</tag>
    <tag>continuous-deployment</tag>
    <tag>continuous-delivery</tag>
    <tag>net-core</tag>
    <tag>yaml</tag>
    <tag>testing</tag>
    <tag>x-unit</tag>
    <tag>unit-test</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
  </categories>
</post>