<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Team Foundation Server 2012 ile Düzenli Proje Geliştirme</title>
  <description>Bu görsel dersimizde Team Foundation Server 2012 ürününe kısaca göz atmaya çalışıyoruz. TFS' in tek başına değerlendirilmemesi gerektiğini, bir Application Lifecycle Management aracı olduğunu, Agile odaklı süreçleri(Scrum, MSF) hedeflediğini, SQL Server, Reporting Services, Analysis Services, Sharepoint, System Center gibi pek çok ürünü de bünyesinde barındırdığını, bu nedenle dev bir eko sistem olduğunu, bir servis olarak Cloud üzerinden sunulabildiğini ifade etmeye çalışıyoruz. Anlatımlarımız sırasında Scrum' ın örnek işleyişine değiniyor, Gartner Magic Quadrant raporlarına kadar gidiyor ve hatta Product Life Cycle eğrisine bile bakıyoruz.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bu g&amp;ouml;rsel dersimizde &lt;strong&gt;Team Foundation Server 2012&lt;/strong&gt; &amp;uuml;r&amp;uuml;n&amp;uuml;ne kısaca g&amp;ouml;z atmaya &amp;ccedil;alışıyoruz. &lt;strong&gt;TFS&lt;/strong&gt;' in tek başına değerlendirilmemesi gerektiğini, bir &lt;strong&gt;Application Lifecycle Management&lt;/strong&gt; aracı olduğunu, &lt;strong&gt;Agile&lt;/strong&gt; odaklı s&amp;uuml;re&amp;ccedil;leri&lt;em&gt;&lt;strong&gt;(Scrum, MSF)&lt;/strong&gt;&lt;/em&gt; hedeflediğini, &lt;strong&gt;SQL Server, Reporting Services, Analysis Services, Sharepoint, System Center&amp;nbsp;&lt;/strong&gt;gibi pek &amp;ccedil;ok &amp;uuml;r&amp;uuml;n&amp;uuml; de b&amp;uuml;nyesinde barındırdığını, bu nedenle dev bir eko sistem olduğunu, bir servis olarak &lt;strong&gt;Cloud &lt;/strong&gt;&amp;uuml;zerinden sunulabildiğini ifade etmeye &amp;ccedil;alışıyoruz. Anlatımlarımız sırasında &lt;strong&gt;Scrum&lt;/strong&gt;' ın &amp;ouml;rnek işleyişine değiniyor,&lt;strong&gt; Gartner Magic Quadrant&lt;/strong&gt; raporlarına kadar gidiyor ve hatta &lt;strong&gt;Product Life Cycle&lt;/strong&gt; eğrisine bile bakıyoruz.&lt;/p&gt;
&lt;p&gt;&lt;iframe src="https://www.youtube.com/embed/OSY_TkUrgPk" width="560" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;İkinci b&amp;ouml;l&amp;uuml;mde ise Team Foundation Server' a bir Hello World demeye &amp;ccedil;alışıyor olacağız. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2013-03-20 23:00:00</pubDate>
  <slug>Team-Foundation-Server-2012-ile-Duzenli-Proje-Gelistirme</slug>
  <tags>
    <tag>team-foundation-server</tag>
    <tag>client-object-model</tag>
    <tag>tfs-client-object-model</tag>
    <tag>tfs-integration</tag>
    <tag>tfs-entegrasyon</tag>
    <tag>work-item</tag>
    <tag>task</tag>
    <tag>product-backlog-item</tag>
    <tag>scrum</tag>
    <tag>cmmi</tag>
    <tag>msf</tag>
    <tag>application-lifecycle-management</tag>
    <tag>alm</tag>
    <tag>product-lifecycle-management</tag>
  </tags>
  <categories>
    <category>Team Foundation Server</category>
  </categories>
</post>