<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Stream ve Pipe Mevzusu</title>
  <description>Node.js tarafında anlaşılması en zor konulardan birisinin stream'ler olduğu söyleniyor. Özellikle event ve multi-process gibi konularlar yakın temas içerisinde. Ancak benim dikkatimi çeken nokta okuduğum bir yazı üzerine önüme gelen performans. Özellikle büyük veri ile çalışan bir web sunucusu söz konusu ise stream nesnelerinin pipe mekanizması ile birlikte kullanılıyor olması önem arz eden bir konu. Gelin ne demek istediğimi benden daha iyi özetleyecek basit bir örnek ile konuya giriş yapalım.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/04/piping_g_1.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;West-World bu hafta neredeyse savaş alanı gibiydi. Node.js tarafında &amp;ouml;ğrenmeye &amp;ccedil;alştığım yeni konu sebebiyle makineyi bir &amp;ccedil;ok kez restart etmek zorunda kaldım. &amp;Uuml;stelik d&amp;uuml;ğmeden :|&lt;/p&gt;
&lt;p&gt;Sebep &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k boyutlu bir dosya i&amp;ccedil;eriğini basit bir web sunucusu &amp;uuml;zerinden sunmaya &amp;ccedil;alışmaktı. Aslında kimse bu tip bir şey yapmaz. Hadi yapsa da koca dosyayı tek seferde istemciye g&amp;ouml;ndermez. Kaldı ki istemci de bu web hizmetine herhangi bir tarayıcıdan talep g&amp;ouml;ndermez.&lt;/p&gt;
&lt;p&gt;Neyse ki sonunda doğru yolu buldum ve bu tip bir araştırma senaryosunda terminalden curl komutunu kullanarak ilerlemenin daha mantıklı olduğunu &amp;ouml;ğrendim. Tabii t&amp;uuml;m bunlar i&amp;ccedil;in ge&amp;ccedil;erli bir sebebim vardı. Akımların sıklıkla bahsedilen pipe fonksiyonunu denemek ve bunun performansa olan olumlu etkilerini g&amp;ouml;rebilmek.&lt;/p&gt;
&lt;p&gt;Node.js tarafında anlaşılması en zor konulardan birisinin&amp;nbsp;akımlar&lt;em&gt;(stream olarak telaf&amp;uuml;z edelim)&lt;/em&gt; olduğu s&amp;ouml;yleniyor. &amp;Ouml;zellikle event ve multi-process gibi&amp;nbsp;kavramlarla&amp;nbsp;yakın temas i&amp;ccedil;erisinde. Okuduğum kaynaklar ve izlediğim Pluralsight eğitimlerine g&amp;ouml;re performans konusunda dikkat edilmesi gereken ve &amp;ouml;nemli &amp;ouml;zellikler barındıran bir mevzu. &amp;Ouml;zellikle b&amp;uuml;y&amp;uuml;k veri ile &amp;ccedil;alışan bir web sunucusu s&amp;ouml;z konusu ise stream nesnelerinin pipe mekanizması ile birlikte kullanılması tercih edilmeli. Gelin ne demek istediğimi benden daha iyi &amp;ouml;zetleyecek basit bir &amp;ouml;rnek ile konuya giriş yapalım.&lt;/p&gt;
&lt;h1&gt;&amp;Ouml;rnek Dosyanın Oluşturulması&lt;/h1&gt;
&lt;p&gt;Yapmak istediğim aynen kaynaklarda tariflendiği &amp;uuml;zere&amp;nbsp;dosya hizmeti veren bir web sunucusu oluşturmaktı. Performans farklılıklarını canlı g&amp;ouml;rebilmek i&amp;ccedil;in en az bir dosyaya ve bunun farklı boyutlardaki hallerini ele alan senaryolara ihtiyacım vardı. B&amp;uuml;y&amp;uuml;k boyutlu bir dosya bulmakla neden uğraşayım ki? Pekala i&amp;ccedil;i anlamsız verilerle dolu bir dosyayı kendim oluşturabildim. İşe aşağıdaki kodlarla başladım.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;var fs = require('fs');

console.log("Big file is creating...");
var bigEF = fs.createWriteStream('bigEF.data');
for (var i = 0; i &amp;lt; 3e6; i++) {
    bigEF.write('{"fname": "Devon","lname": "Karma"},{"fname": "Lorenz","lname": "Douglas"},{"fname": "Ora","lname": "Wade"},{"fname": "Kelly","lname": "Ragusa"},{"fname": "Teresa","lname": "Gergely"},{"fname": "Wendy","lname": "Kerkemeyer"},{"fname": "Georgia","lname": "Malo"},{"fname": "Tonja","lname": "Lichtenwalner"},{"fname": "Dorota","lname": "Breiter"},{"fname": "Priscilla","lname": "Bartovics"}');
}
bigEF.end();&lt;/pre&gt;
&lt;p&gt;fs&lt;em&gt;(Temel IO işlemleri i&amp;ccedil;in kullanıyoruz diyebilirim)&lt;/em&gt; mod&amp;uuml;l&amp;uuml;n&amp;uuml;n kullanıldığı ve i&amp;ccedil;erisinde JSON cemiyetinden rastgele insanların olduğu b&amp;uuml;y&amp;uuml;k boyutlu bir dosya &amp;uuml;retiliyor. createWriteStream ile bigEF.data isimli &amp;ouml;rnek dosya i&amp;ccedil;in yazılabilir bir Stream nesnesi &amp;ouml;rnekliyoruz. Buraya uygulayacağımız write &amp;ccedil;ağrısı tahmin edeceğiniz &amp;uuml;zere dosya i&amp;ccedil;erisine ilgili metinsel i&amp;ccedil;eriklerin yazılmasını sağlamakta. T&amp;uuml;m işlerin onaycısı sondaki end &amp;ccedil;ağrısı. Kodu &amp;ccedil;alıştırdığımda&amp;nbsp;West-World &amp;uuml;zerinde 1.2 Gb'lık alan işgal edecek tamamen atmasyon verilerden oluşan bir dosya &amp;uuml;retilmiş oldu. İlk senaryo i&amp;ccedil;in yeterli b&amp;uuml;y&amp;uuml;kl&amp;uuml;kte.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/piping_0.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Problem &amp;Ccedil;ıkartalım&lt;/h1&gt;
&lt;p&gt;İlk hedef bu dosyayı bir web sunucusu &amp;uuml;zerinden sunmak. Yani istemcilerin g&amp;ouml;ndereceği bir HTTP talebine g&amp;ouml;re kendilerine bu dosya i&amp;ccedil;eriğini g&amp;ouml;ndereceğimiz anlamısız bir senaryomuz var. Aslında kodun yapacağı iş olduk&amp;ccedil;a basit. Sunucuya gelen talep sonrası ilgili dosyayı okumak ve istemciye paslamak. Aşağıdaki kod par&amp;ccedil;ası bu işi g&amp;ouml;rebilir.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;var fs = require('fs');
var http = require('http');

var server = http.createServer().on('request', function (req, res) {
    fs.readFile('bigEF.data', function (err, data) {
        if (err)
            throw err;
        res.end(data);
    });
});
server.listen(65002);
console.log('Server is online');&lt;/pre&gt;
&lt;p&gt;Daha &amp;ouml;nceden aşina olduğumuz &amp;uuml;zere http mod&amp;uuml;l&amp;uuml;ne ihtiyacımız var. Sunucu nesnesi &amp;ouml;rneklendikten sonra request olayını dinleyecek şekilde bir metod zinciri bulunuyor. Callback fonksiyonu istemciden gelen talep sonrası &amp;ccedil;alışacaktır. İ&amp;ccedil;erisinde &amp;ouml;ncelikle dosyanın okunmasını sağlıyoruz. readFile'ın Callback fonkisyonunda ise okunan dosya i&amp;ccedil;eriğini response değişkenine yazıyoruz. Daha doğrusu response değişkeninin a&amp;ccedil;tığı stream'e aktarıyoruz. Sunucu West-World'&amp;uuml;n 65002 nolu Kuzey Batı kapısından hizmet verecek şekilde tasarlanmış durumda.&lt;/p&gt;
&lt;p&gt;Uygulamayı &amp;ccedil;alıştırıp&amp;nbsp;curl ile&lt;em&gt;(&amp;ouml;zellikle curl ile denedim &amp;ccedil;&amp;uuml;nk&amp;uuml; tarayıcı ile ger&amp;ccedil;ekleştirdiğim acı deneyimler sonrası makineyi bir ka&amp;ccedil; kez d&amp;uuml;ğmesinden kapatıp a&amp;ccedil;mak zorunda kaldım)&lt;/em&gt; 65002 nolu porta talep g&amp;ouml;nderdiğimde aşağıdaki sonu&amp;ccedil;larla karşılaştım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/piping_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aynen kaynaklarda bahsedildiği gibi olmuştu. Sunucu a&amp;ccedil;ık ve istemci curl komutu ile adrese bir talep g&amp;ouml;nderiyor. Kısa bir s&amp;uuml;re i&amp;ccedil;in sorun yok. Derken bir anda bellek t&amp;uuml;ketimi artıp &amp;ccedil;ıktığı noktada seyretmeye devam ediyor. Hatta West-World'&amp;uuml;n klima sistemi de aynı anda coşmuştu diyebilirim. Uygulama &amp;ccedil;alışmasını tamamlandığında ise her şey normale d&amp;ouml;nd&amp;uuml;. Bellek t&amp;uuml;ketimi kısa s&amp;uuml;re i&amp;ccedil;inde baştaki seviyelere indi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/piping_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Burada g&amp;ouml;zle g&amp;ouml;r&amp;uuml;l&amp;uuml;r bir performans sıkıntısı olduğu ortada. Sadece tek bir dosya i&amp;ccedil;in g&amp;ouml;nderilmiş bir talep var ancak n sayıda talebin gelmesi ve k&amp;uuml;&amp;ccedil;&amp;uuml;k boyutlarda olsalar bile onlarca, y&amp;uuml;zlerce dosyanın sunulacağı bir sistem i&amp;ccedil;in &amp;ccedil;ok daha b&amp;uuml;y&amp;uuml;k sorunlar oluşması pekala m&amp;uuml;mk&amp;uuml;n.&lt;/p&gt;
&lt;h1&gt;Pipe Kullanımı&lt;/h1&gt;
&lt;p&gt;İşte bu noktada pipe fonksiyonu ile karşılaşılıyor. &amp;Ccedil;ok temel olarak kaynak ve hedef arasında tek veya &amp;ccedil;ift y&amp;ouml;nl&amp;uuml; bir boru hattının oluşturulmasına yarayan ama enteresan avantajlar sunan bir fonksiyondan bahsediyoruz aslında. Bu fonksiyon, a&amp;ccedil;ılan kanal &amp;uuml;zerinden verilerin akışını sağlıyor ancak bi farkla; kendisi stream nesne &amp;ouml;rneklerine uygulanabiliyor ve verinin tamamının belleğe alınması yerine belli boyutlarda par&amp;ccedil;alanarak kullanılmasına olanak sağlıyor. &amp;Ouml;rneğin 1.2 Gb'lık devasa bir dosyanın tamamen belleğe&amp;nbsp;alınıp&amp;nbsp;işlenmesi yerine k&amp;uuml;&amp;ccedil;&amp;uuml;k par&amp;ccedil;alar haline&lt;em&gt;(chunk)&lt;/em&gt;&amp;nbsp;b&amp;ouml;l&amp;uuml;nerek ele alınmasını sağlıyor &lt;em&gt;(Bunu nasıl yapabileceğini bir d&amp;uuml;ş&amp;uuml;n&amp;uuml;n derim. Yani siz b&amp;ouml;yle bir fonksiyon yazmaya &amp;ccedil;alışsanız nasıl yazardınız?)&lt;/em&gt; pipe i&amp;ccedil;in ş&amp;ouml;yle bir ifade doğru olacaktır.&lt;/p&gt;
&lt;p&gt;[kaynak].pipe([hedef])&lt;/p&gt;
&lt;p&gt;West-World'de ikinci deneyi ger&amp;ccedil;ekleştirmenin zamanı gelmişti. &amp;Ouml;ğrendiklerimi uygulayarak aşağıdaki kod par&amp;ccedil;asını hazırladım.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;var fs = require('fs');
var http = require('http');

var server = http.createServer().on('request', function (req, res) {
    var source = fs.createReadStream('bigEF.data');
    source.pipe(res);
});
server.listen(65002);
console.log('Server is online');&lt;/pre&gt;
&lt;p&gt;Bir &amp;ouml;nceki &amp;ouml;rnekten farklı olarak doğrudan readFile fonksiyonunu kullanmak yerine createReadStream i&amp;ccedil;in &amp;ccedil;ağrı yapılmakta. Bunun sonucu olarak veri okunabilir bir akım &amp;ouml;rneklenecek&lt;em&gt;(ReadableStream)&lt;/em&gt;. source olarak isimlendirilen nesne &amp;ouml;rneği &amp;uuml;zerinden pipe metodunun nasıl kullanıldığına dikkat edelim. Parametre olarak response değişkenini alıyor. response, bu senaryo gereği &amp;uuml;zerine veri yazılabilir bir akım&lt;em&gt;(WritableStream)&amp;nbsp;&lt;/em&gt;Buna g&amp;ouml;re dosyadan okuduk&amp;ccedil;a, &amp;ccedil;ıktı olarak ağ &amp;uuml;zerindeki kanala veri yazılıyor diye d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;p&gt;Testi tekrar yaptığımda West-World'te ortam gayet sakin g&amp;ouml;r&amp;uuml;nmekteydi. &amp;Ouml;nce sunucu uygulamasını &amp;ccedil;alıştırdım, ardından curl ile talebi g&amp;ouml;nderdim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/piping_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Veriler yine okunuyordu ancak sunucunun bellek t&amp;uuml;ketiminde g&amp;ouml;zle g&amp;ouml;r&amp;uuml;l&amp;uuml;r &amp;ouml;nemli bir artış olmamıştı. Hatta neredeyse hi&amp;ccedil; olmamıştı.&lt;/p&gt;
&lt;h1&gt;Pipe Yerine Event Kullanımı&lt;/h1&gt;
&lt;p&gt;Bir &amp;ouml;nceki &amp;ouml;rnekte yer alan pipe fonksiyonu yerine olay bazlı kurgulama ile de aynı senaryo &amp;ccedil;alıştırılabilir. Hatta bu durumda olay fonksiyonlarındaki parametrelerin g&amp;uuml;c&amp;uuml;nden de yararlanılabilir. Kodları aşağıdaki gibi d&amp;uuml;zenleyerek testlere devam ettim. Ancak &amp;ouml;ncesinde &amp;uuml;zerinde &amp;ccedil;alışacağım dosya boyutunu epeyce k&amp;uuml;&amp;ccedil;&amp;uuml;ltt&amp;uuml;m. Nitekim buffer kullanacağım i&amp;ccedil;in bu veri k&amp;uuml;melerini&lt;em&gt;(chunk)&lt;/em&gt; izleyebilmek istiyordum&amp;nbsp;&lt;em&gt;(Burada b&amp;ouml;yle yazıyorum &amp;ccedil;&amp;uuml;nk&amp;uuml; &amp;ouml;nce bir ka&amp;ccedil; deneme yaptım. Baktım terminalden par&amp;ccedil;aları g&amp;ouml;remiyorum, &amp;uuml;zerinde &amp;ccedil;alışacağım dosya boyutunu k&amp;uuml;&amp;ccedil;&amp;uuml;ltt&amp;uuml;m)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;var fs = require('fs');
var http = require('http');

// pipe yerine stream eventlerini kullanmak
// daha k&amp;uuml;&amp;ccedil;&amp;uuml;k boyutlu bir dosya se&amp;ccedil;elim ki takibimiz kolay olsun

var server = http.createServer().on('request', function (req, res) {
    var source = fs.createReadStream('bigEF.data');
    // aşağıdaki data ve end olayları da bir nevi pipe'ın karşılığıdır.
    source.on('data', function (chunk) {
        res.write(chunk);
        var date = new Date().toISOString();
        console.log('\n' + date + '\n');
        console.log('\t' + chunk);
    });
    source.on('end', function () {
        res.end();
        console.log('end');
    });
});

server.listen(65002);
console.log('Server is online');&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere source nesnesi yine okunabilir stream &amp;ouml;rneği olarak başrolde. Bu sefer ilgili nesne i&amp;ccedil;in data ve en isimli olayları bildiriyoruz. Her iki olay i&amp;ccedil;in de callback fonksiyonları i&amp;ccedil;inde gerekli işlerin yapıldığını belirtebiliriz. data olayı ger&amp;ccedil;ekleştiğinde istemci talebine cevaben verinin k&amp;uuml;&amp;ccedil;&amp;uuml;k bir par&amp;ccedil;asını g&amp;ouml;nderiyoruz. Dosyaya ait b&amp;uuml;t&amp;uuml;n par&amp;ccedil;aların g&amp;ouml;nderimi tamamlandığında end olayı tetiklenmekte. Burada da istemciye g&amp;ouml;ndereceğimiz verilerin tamamlandığını belirtiyoruz.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alışma zamanı &amp;ccedil;ıktılarına baktığımda aşağıdaki gibi tampon b&amp;ouml;lgeye alınan veri k&amp;uuml;melerinin değerlendirildiğini g&amp;ouml;rd&amp;uuml;m. Hatta &amp;uuml;stteki bilginin kesildiği yerden alttakinin devam ettiğini de fark etmiş olmalısınız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/piping_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere bellek kullanımında yine &amp;ouml;nemli bir sıkıntı g&amp;ouml;r&amp;uuml;lm&amp;uuml;yor.&lt;/p&gt;
&lt;h1&gt;Limitleri Zorlayalım&lt;/h1&gt;
&lt;p&gt;Peki ya dosya boyutu baya baya b&amp;uuml;y&amp;uuml;k olsaydı. Kaynaklarda bahsedilen 2Gb sınırını merak ediyordum aslında. &amp;Ouml;zellikle bu değer i&amp;ccedil;in readFile'ın cevap vermediği ifade ediliyordu. Bu nedenle sa&amp;ccedil;ma veriler i&amp;ccedil;eren dosya boyutunu 2Gb'ın &amp;uuml;st&amp;uuml;ne &amp;ccedil;ıkarttım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/piping_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;West-World bu kez 2.3Gb'lık bir saha işgali ile karşı karşıyaydı. pipe mekanizmasını kullandığım kodu bir kenara bıraktım ve ilk olarak standart okuma y&amp;ouml;ntemini kullanmaya karar verdim. Sonu&amp;ccedil;ları almam hi&amp;ccedil; uzun s&amp;uuml;rmedi.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/piping_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere dosya boyutu olası Buffer boyutunun &amp;uuml;zerindeydi. Bu sebepten işlemler zaten yapılamadı. Ancak pipe fonksiyonelliğinin kullanıldığı kod par&amp;ccedil;ası s&amp;ouml;z konusu dosyayı sorunsuz bir şekilde işlemeyi başarmıştı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/piping_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Diğer Kullanışlı Bilgiler&lt;/h1&gt;
&lt;p&gt;Bitirmeden &amp;ouml;nce bir ka&amp;ccedil; teknik bilgi daha vermeye &amp;ccedil;alışayım&lt;em&gt;(Anladığım kadarıya tabii)&lt;/em&gt; Node.js ile birlikte gelen bir &amp;ccedil;ok standart stream enstr&amp;uuml;manı s&amp;ouml;z konusu. Bunları iki ana kategoriye ayırmak m&amp;uuml;mk&amp;uuml;n. Okuma ama&amp;ccedil;lı kullanılanlar&lt;em&gt;(readable streams)&lt;/em&gt; ve yazma ama&amp;ccedil;lı&lt;em&gt;(writable streams)&lt;/em&gt; kullanılanlar. Sonu&amp;ccedil; itibariyle bir kaynaktan veri okuma veya bir hedefe veri yazma işleri bu kapsamlara giriyor. Bazı node.js&amp;nbsp;t&amp;uuml;rleri ise&amp;nbsp;her iki rol&amp;uuml; birden &amp;uuml;stlenebiliyor. TCP soketleri, sıkıştırma k&amp;uuml;t&amp;uuml;phanesi(zlib) ve şifreleme nesneleri her iki rol&amp;uuml; &amp;uuml;stlenen akt&amp;ouml;rlerden.&lt;/p&gt;
&lt;p&gt;Bunlara ek olarak tek y&amp;ouml;nl&amp;uuml; olan stream nesneleri de bulunuyor. &amp;Ouml;rneğin bir istemcinin sunucuya g&amp;ouml;nderdiği&amp;nbsp;HTTP&amp;nbsp;talebi&amp;nbsp;sunucu a&amp;ccedil;ısından readable stream olarak değerlendirilirken, istemci a&amp;ccedil;ısından writable stream&amp;nbsp;şeklinde anlam kazanıyor. Tam tersi durumda s&amp;ouml;z konusu elbette. Okunabilir veya yazılabilir&amp;nbsp;akımlar yalnız değiller. Bunlara ilaveten &amp;ccedil;ift y&amp;ouml;nl&amp;uuml;&lt;em&gt;(duplex)&lt;/em&gt; ve d&amp;ouml;n&amp;uuml;şebilir&lt;em&gt;(transform)&lt;/em&gt;&amp;nbsp;akım t&amp;uuml;rleri de var.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle duplex&amp;nbsp;formatta olanlar &amp;ccedil;ok ilgin&amp;ccedil;. &amp;Ouml;yle ki bunları ele aldığımız senaryolarda arka arkaya birden fazla pipe &amp;ccedil;ağrısının yer aldığı metod zincirleri oluşturulması m&amp;uuml;mk&amp;uuml;n. Nitekim pipe &amp;ccedil;ağrısının sonucu yine okunabilir ve dolayısıyla başka bir kaynağa girdi olarak aktarılabilir bir stream olabiliyor. Mesela Veli okunabilir, Ayşe ve Hakan hem okunabilir hem yazılabilir, son olarak da Levent sadece yazılabilir ise şu şekilde bir&amp;nbsp;ietişim&amp;nbsp;hattı oluşturmak m&amp;uuml;mk&amp;uuml;n(m&amp;uuml;ş).&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;veli.pipe(ayşe).pipe(hakan).pipe(levent)&amp;nbsp;&lt;/pre&gt;
&lt;p&gt;İnanın bu noktada benim de kafam epey karışmış durumda. Şimdilik yapacağım şey biraz dinlenmek ve konunun diğer detaylarına bir şekilde inmeye &amp;ccedil;alışmak. L&amp;uuml;tfen siz de araştırın ve Node.js d&amp;uuml;nyasındaki stream konusunu en ince detayına kadar &amp;ouml;ğrenmeye bakın. S&amp;ouml;z gelimi dosya harici b&amp;uuml;y&amp;uuml;k veri k&amp;uuml;meleri &amp;uuml;zerinde işlem yapmak istediğiniz soket haberleşmesi odaklı senaryolar da bu vakaları ele almayı deneyebilirsiniz. Benden şimdilik bu kadar. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;h2&gt;Kaynaklar&lt;/h2&gt;
&lt;p&gt;&lt;a href="https://www.sitepoint.com/basics-node-js-streams/" target="_blank"&gt;Basic of Node.js Streams&lt;/a&gt;&lt;br /&gt;&lt;a href="https://nodejs.org/api/stream.html" target="_blank"&gt;Node.js Offical Documentation&lt;br /&gt;&lt;/a&gt;&lt;a href="https://community.risingstack.com/the-definitive-guide-to-object-streams-in-node-js/" target="_blank"&gt;The Definitive Guide of Object Streams in Node.js&lt;/a&gt;&lt;br /&gt;&lt;a href="https://medium.freecodecamp.org/node-js-streams-everything-you-need-to-know-c9141306be93" target="_blank"&gt;Free Code Camp&lt;/a&gt;&lt;br /&gt;&lt;a href="https://www.w3schools.com/nodejs/ref_stream.asp" target="_blank"&gt;W3School&lt;/a&gt;&lt;br /&gt;&lt;a href="https://codeburst.io/basics-of-events-streams-and-pipe-in-node-js-b84578c2f1be" target="_blank"&gt;Events and Streams in Node.js&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2018-07-12 21:30:00</pubDate>
  <slug>Stream-ve-Pipe-Mevzusu</slug>
  <tags>
    <tag>nodejs</tag>
    <tag>stream</tag>
    <tag>pipeline</tag>
    <tag>pipe</tag>
    <tag>events</tag>
    <tag>javascript</tag>
    <tag>performance</tag>
    <tag>event-emit</tag>
    <tag>event</tag>
    <tag>writable-stream</tag>
    <tag>readable-stream</tag>
  </tags>
  <categories>
    <category>Node.js</category>
  </categories>
</post>