<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF - Client Callback (İstemci Taraflı Geri Bildirim)</title>
  <description>Servis yönelimi mimari (Service Oriented Architecture) üzerine geliştirilen sistemler istemci/sunucu(client/server) tabanlı bir iletişimi olanaklı kılarlar. Bu sistemlerde süreçler çoğunlukla istemciden sunucuya doğru yapılan operasyon talepleri(Request) ve servis tarafından istemciye geri dönen cevaplardan(Response) ibarettir....</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Servis y&amp;ouml;nelimi mimari (Service Oriented Architecture) &amp;uuml;zerine geliştirilen sistemler istemci/sunucu &lt;strong&gt;(client/server) &lt;/strong&gt;tabanlı bir iletişimi olanaklı kılarlar. Bu sistemlerde s&amp;uuml;re&amp;ccedil;ler &amp;ccedil;oğunlukla istemciden sunucuya doğru yapılan operasyon talepleri&lt;strong&gt;(Request)&lt;/strong&gt; ve servis tarafından istemciye geri d&amp;ouml;nen cevaplardan&lt;strong&gt;(Response) &lt;/strong&gt; ibarettir. Oysaki bazı &lt;strong&gt;SOA&lt;/strong&gt; vakkalarında rollerin tam tersine &amp;ccedil;evrilmesi gerekebilir. Bir başka deyişle servislerin yeri geldiğinde bir istemci gibi hareket etmesi istenebilir. S&amp;ouml;z gelimi bir stok sisteminde yer alan bir servis par&amp;ccedil;asında, istemcilerin stok &amp;uuml;zerinde servis yardımıyla yapacağı hareketleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;p&gt;Bu stok hareketleri istemciden gelecek olan operasyon &amp;ccedil;ağrıları sonucu servis tarafında ele alınıyor olsunlar. Buna g&amp;ouml;re, servise bağlı diğer istemcilerinde durumdan haberdar olması istenebilir. Bu bir uyarı sistemi olarakda g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. B&amp;ouml;yle bir sistemde &amp;ouml;ncelikli olarak servis tarafındaki uygulamanın istemci tarafında yer alan belirli operasyonları &amp;ccedil;ağırabiliyor olması gerekmektedir. Diğer taraftan, servis uygulaması kendisine bağlı istemcilerin hepsinde bir yayınlama yapmak istiyorsa, &lt;strong&gt;olay(event) &lt;/strong&gt;y&amp;ouml;nelimli bir model geliştirilmesi s&amp;ouml;z konusu olmalıdır. Bu makalemizde &lt;strong&gt;Windows Communication Foundation&lt;/strong&gt; sisteminde istemci taraflı geri bildirimlerin &lt;strong&gt;(Client Callback)&lt;/strong&gt; nasıl yapılabileceğini &amp;ccedil;ok basit olarak incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;WCF (Windows Communication Foundation)&lt;/strong&gt;, standart istemci sunucu modeli dışında rollerin tersine d&amp;ouml;nebileceği iki modeli daha destekler. Bunlar &lt;strong&gt;peer-to-peer&lt;/strong&gt; modeli ve &lt;strong&gt;client callback&lt;/strong&gt; modelidir. Peer-to-peer modeline g&amp;ouml;re t&amp;uuml;m istemciler aktif ve bağımsız olarak birer servistir ve birbirleriyle mesajlaşabilir. Client Callback modelinde ise servisler, istemci tarafında metod &amp;ccedil;ağrıları ger&amp;ccedil;ekleştirebilecek durumdadır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;İlk hedef, servis uygulamasının istemci tarafındaki bir metodu &amp;ccedil;ağırabilmesini sağlamak olmalıdır. WCF tarafından bakıldığında, bağlayıcı tiplerin&lt;strong&gt;(binding types)&lt;/strong&gt; tamamının geri bildirim işlemlerini desteklemediği g&amp;ouml;r&amp;uuml;l&amp;uuml;r. Bunun sebebi kullanılan protokold&amp;uuml;r. &lt;strong&gt;TCP&lt;/strong&gt; ve &lt;strong&gt;IPC&lt;/strong&gt; gibi protokoller istemci geri bildirim işlemlerinde doğaları gereği doğrudan destek vermektedir. Bu sebepten &lt;strong&gt;NetTcpBinding&lt;/strong&gt; yada &lt;strong&gt;NetNamedPipeBinding&lt;/strong&gt; gibi bağlayıcı tipler istemci geri bildirim işlemlerini doğal olarak desteklemektedirler. Ancak &lt;strong&gt;HTTP&lt;/strong&gt; protokol&amp;uuml; bağlantısız&lt;strong&gt;(connectless)&lt;/strong&gt; olarak &amp;ccedil;alışan bir model olduğundan geri bildirimi(Callback) doğrudan desteklemez.&lt;/p&gt;
&lt;p&gt;Bu nedenle &lt;strong&gt;BasicHttpBinding&lt;/strong&gt; veya &lt;strong&gt;WsHttpBinding&lt;/strong&gt; gibi bağlayıcı tipleri ile Client Callback modeli geliştirilemez. Ancak HTTP protokol&amp;uuml;n&amp;uuml;nde bu sistemi &amp;ccedil;ift y&amp;ouml;nl&amp;uuml; kanallar a&amp;ccedil;arak ger&amp;ccedil;ekleştirmek m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Tahmin edileceği gibi bu kanallardan birisi servisden istemciye doğru, diğeri ise ters y&amp;ouml;nde istemciden servise doğru olmalıdır. Bunu, tek y&amp;ouml;nl&amp;uuml; iki HTTP kanalı olarakta d&amp;uuml;ş&amp;uuml;nebiliriz. WCF i&amp;ccedil;erisinde yer alan bağlayıcı tiplerinde WsDualHttpBinding tam olarak bu ama&amp;ccedil;la tasarlanmıştır. Bu nedenle &lt;strong&gt; WsDualHttpBinding&lt;/strong&gt; bağlayıcı tipini kullanarak, HTTP protokol&amp;uuml;n&amp;uuml; baz alacak şekilde Client Callback destekli uygulamalar geliştirilebilir.&lt;/p&gt;
&lt;p&gt;İlk olarak bir servisin istemci tarafındaki bir operasyonu nasıl &amp;ccedil;ağırabileceğini &amp;ouml;rnek bir uygulama &amp;uuml;zerinden incelemeye &amp;ccedil;alışalım. Başlamadan &amp;ouml;nce servis tarafında ve istemci tarafında yapmamız gerekenlerin neler olduğunu vurgulamakta yarar var. Servis tarafında geri bildirim i&amp;ccedil;in bir aray&amp;uuml;z&lt;strong&gt;(Interface)&lt;/strong&gt; tanımlanmalıdır. Bu aray&amp;uuml;z istemci tarafında, herhangibir sınıfa&lt;strong&gt;(Class)&lt;/strong&gt; uygulanmalıdır. İstemciler, kullanmak istedikleri servise ait bir &amp;ouml;rnek oluşturduklarında, servis tarafına bir referans verilmelidir. Bu referansı kullanarak servisler, istemciler &amp;uuml;zerindeki metodları tetikleyebilirler. Dolayısıyla istemci tarafında geri bildirim tipinin uyguladığı bir aray&amp;uuml;z&amp;uuml;n var olması ve bunun servis tarafında tanımlanmış olması gerekir.&lt;/p&gt;
&lt;p&gt;Bu c&amp;uuml;mleler biraz kafa karıştırıcı olabilir. Bu durum daha kısa bir şekilde; istemcideki bir nesne referansının servis tarafından elde edilebilmesi ve onun sayesinde istemci &amp;uuml;zerinde, s&amp;ouml;z konusu aray&amp;uuml;z&amp;uuml; uygulayan bir sınıfın metodunun servis tarafından &amp;ccedil;ağırılabilmesi şeklinde de ifade edilebilir. &amp;Ouml;ncelikle servis s&amp;ouml;zleşmesini&lt;strong&gt;(Service Contract)&lt;/strong&gt;, geri bildirim s&amp;ouml;zleşmesini&lt;strong&gt;(Callback Contract)&lt;/strong&gt; ve iş yapan servis tipini barındıracak &lt;strong&gt;WCF Class Library&lt;/strong&gt; projesini geliştirerek &amp;ouml;rneğimize başlayalım. WCF sınıf k&amp;uuml;t&amp;uuml;phanemizdeki tiplerin sınıf &amp;ccedil;izelgesindeki durumu ve kodları aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk219_2.gif" alt="" width="364" height="390" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;IGeriBildirimSozlesmesi isimli aray&amp;uuml;z&lt;strong&gt;(interface)&lt;/strong&gt; geri bildirim s&amp;ouml;zleşmesinin&lt;strong&gt;(Callback Contract)&lt;/strong&gt; tanımını yapmaktadır. Bu tanıma g&amp;ouml;re, servisin istemciler &amp;uuml;zerinden tetikleyebileceği metod, int tipinden parametre alan ve geriye değer d&amp;ouml;nd&amp;uuml;rmeyen bir şekilde tanımlanmıştır. Geri bildirim s&amp;ouml;zleşmesinin i&amp;ccedil;eriği ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace UrunServisi
{
    // Callback Contract tanımlanırken, ServiceContract niteliği kullanılmaz. 
    public interface IGeriBildirimSozlesmesi
    {
        // Servisin istemciden &amp;ccedil;ağıracağı geri bildirim metodundan geriye cevap beklenmesine gerek olmadığından IsOneWay &amp;ouml;zelliğine true değeri atanmıştır.
        [OperationContract(IsOneWay = true)]
        void OnStokMiktariDegisti(int degistirilenUrunId);
    }
}&lt;/pre&gt;
&lt;p&gt;Tanımlanan bu s&amp;ouml;zleşmede dikkat edilmesi gereken en &amp;ouml;nemli noktalardan biriside &lt;strong&gt;ServiceContract&lt;/strong&gt; niteliğinin uygulanmamış olmasıdır. Bir geri bildirim s&amp;ouml;zleşmesinde, &lt;strong&gt; OperationContract&lt;/strong&gt; niteliği ile, servisin istemciler &amp;uuml;zerinden &amp;ccedil;ağırabileceği operasyonların bildirilmesi yeterlidir.&lt;/p&gt;
&lt;p&gt;Servis s&amp;ouml;zleşmesi &lt;strong&gt; IUrunYoneticiSozlesmesi&lt;/strong&gt; isimli aray&amp;uuml;z(interface) ile tanımlanmaktadır. Bu aray&amp;uuml;z&amp;uuml;n kodları ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace UrunServisi
{
    // Servis s&amp;ouml;zleşmesinde, Callback s&amp;ouml;zleşmesini bildirmek i&amp;ccedil;in CallbackContract &amp;ouml;zelliği kullanılır.
    [ServiceContract(CallbackContract=typeof(IGeriBildirimSozlesmesi))]
    public interface IUrunYoneticiSozlesmesi
    {
        [OperationContract()]
        void StokMiktariniArttir(int gelenMiktar, int urunNo);
    }
}&lt;/pre&gt;
&lt;p&gt;Burada dikkat edilmesi gereken nokta, &lt;strong&gt;ServiceContract&lt;/strong&gt; niteliğinde &lt;strong&gt;CallbackContract&lt;/strong&gt; tanımlamasının yapılmış olmasıdır. Bu sayede, s&amp;ouml;z konusu aray&amp;uuml;z&amp;uuml; uygulayan servis sınıfının, geri bildirim işlemleri sırasında hangi aray&amp;uuml;z ile taşınan referansları ele alacağı a&amp;ccedil;ık bir şekilde bildirilmiş olunur. &lt;strong&gt; CallbackContract&lt;/strong&gt; &amp;ouml;zelliği, &lt;strong&gt;type&lt;/strong&gt; tipinden bir değer aldığı i&amp;ccedil;in &lt;strong&gt;typeof&lt;/strong&gt; operat&amp;ouml;r&amp;uuml;ne başvurulmuştur ve geri bildirim s&amp;ouml;zleşmesi olan IGeriBildirimSozlesmesi parametre olarak verilmiştir. Servis s&amp;ouml;zleşmesini uygulayan sınıfa ait kodlar ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.ServiceModel;
using System.Data.SqlClient;

namespace UrunServisi
{
    public class UrunYonetici:IUrunYoneticiSozlesmesi
    {
        #region IUrunYoneticiSozlesmesi Members

        public void StokMiktariniArttir(int gelenMiktar,int urunNo)
        {
            string sorgu = "Update Products Set UnitsInStock=UnitsInStock+@GelenMiktar Where ProductID=@PrdId";
            using (SqlConnection conn = new SqlConnection("data source=.;database=Northwind;integrated security=SSPI"))
            {
                SqlCommand cmd = new SqlCommand(sorgu, conn);
                cmd.Parameters.AddWithValue("@GelenMiktar", gelenMiktar);
                cmd.Parameters.AddWithValue("@PrdId", urunNo);
                conn.Open();
                int guncellenen=Convert.ToInt32(cmd.ExecuteNonQuery());
                if (guncellenen &amp;gt; 0)
                {
                         IGeriBildirimSozlesmesi geriBildirim = OperationContext.Current.GetCallbackChannel&amp;lt;IGeriBildirimSozlesmesi&amp;gt;();
                    if (((ICommunicationObject)geriBildirim).State == CommunicationState.Opened)
                    {
                        geriBildirim.OnStokMiktariDegisti(urunNo);
                    }
                }
            }
        }
    
        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;UrunYonetici isimli sınıf i&amp;ccedil;erisinde StokMiktariniArttir isimli bir metod yer almaktadır. Bu metod sembolik olarak, gelen &amp;uuml;r&amp;uuml;n numarasına g&amp;ouml;re &lt;strong&gt;Northwind&lt;/strong&gt; veritabanındaki &lt;strong&gt;Products&lt;/strong&gt; tablosunda yer alan &lt;strong&gt;UnitsInStock&lt;/strong&gt; alanının değerini gelenMiktar parametresinin değeri kadar arttırmaktadır. İşte burada servisin, istemci tarafında stok miktarının arttırıldığına dair bir geri bildirimde bulunması sağlanmaktadır. Bunun i&amp;ccedil;in, istemcinin servis tarafında g&amp;ouml;nderdiği i&amp;ccedil;erik &amp;ouml;rneğinin &lt;strong&gt;(InstanceContext)&lt;/strong&gt; ele alınması gerekmektedir. İstemciler, servise talepte bulunduklarında WCF &amp;ccedil;alışma ortamı&lt;strong&gt;(WCF Runtime)&lt;/strong&gt;, o anki kapsama ait i&amp;ccedil;erik &amp;ouml;rneğinin referansınıda mesaj ile birlikte g&amp;ouml;nderecektir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;OperationContext&lt;/strong&gt; sınıfının &lt;strong&gt;Current&lt;/strong&gt; &amp;ouml;zelliği &amp;uuml;zerinden &amp;ccedil;ağırılan &lt;strong&gt;GetCallbackChannel&lt;/strong&gt; generic metodu ile, IGeriBildirimSozlesmesi tarafından taşınabilecek bir istemci referansı elde edilir. İşte bu referans, istemci tarafında geri bildirim s&amp;ouml;zleşmesini uyarlayan sınıfa aittir. Aray&amp;uuml;zlerin polimorfik&lt;strong&gt;(Polymorphic) &lt;/strong&gt;yapısı nedeni ile, OnStokMiktariDegisti metoduna yapılacak olan &amp;ccedil;ağrı, aslında istemci tarafındaki metoda yapılmaktadır. &amp;Ouml;zetle servis, istemci tarafındaki bir geri bildirim metodunu tetiklemektedir. İstemci uygulama, servis ile olan bağlantısını herhangibir anda kesebilir. &amp;Ouml;zellikle &lt;strong&gt;OneWay&lt;/strong&gt; olarak işaretlenmiş bir callback operasyonunda bu sorun oluşturur.&lt;/p&gt;
&lt;p&gt;Bu nedenle, geri bildirim kanalının a&amp;ccedil;ık olduğundan emin olup geri bildirim metodunu &amp;ccedil;ağırmak amacıyla, &lt;strong&gt; ICommunicationObject&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;ne d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme&lt;strong&gt;(cast)&lt;/strong&gt; işlemi yapılarak State &amp;ouml;zelliğinin değerine bakılmaktadır. &lt;strong&gt;State&lt;/strong&gt; &amp;ouml;zelliği, &lt;strong&gt;CommunicationState&lt;/strong&gt; enum sabiti tipinden bir değer almaktadır ve &amp;ouml;rnekte &lt;strong&gt;Opened&lt;/strong&gt; olması halinde geri bildirim &amp;ccedil;ağrısının yapılması sağlanmaktadır. Artık servis s&amp;ouml;zleşmesini yayınlayacak &lt;strong&gt;Host&lt;/strong&gt; uygulamanın yazılmasına ge&amp;ccedil;ilebilir. Host uygulama, basit bir Windows uygulaması olarak tasarlanabilir. Bu uygulamanın ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; basit olarak aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk219_3.gif" alt="" width="411" height="183" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekildende tahmin edileceği &amp;uuml;zere, program kullanıcısı servisi a&amp;ccedil;ma ve kapatma işlemlerini manuel olarak yapmaktadır. Sunucu uygulamanın kodları aşağıdaki gibi geliştirilebilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Text;
using System.Windows.Forms;
using System.ServiceModel;
using UrunServisi;

namespace Sunucu
{
    public partial class Form1 : Form
    {
        ServiceHost host; 

        public Form1()
        {
            InitializeComponent();
            btnServisiKapat.Enabled = false; 
        }

        private void ServisiHazirla()
        {
            host = new ServiceHost(typeof(UrunYonetici));
            host.Opening += delegate(object sender, EventArgs e)
                                {
                                    lblServisDurumu.Text = "Servis A&amp;ccedil;ılıyor...";
                                };
    
            host.Opened += delegate(object sender, EventArgs e)
                                {
                                    lblServisDurumu.Text = "Servis A&amp;ccedil;ıldı";
                                    btnServisiAc.Enabled = false;
                                    btnServisiKapat.Enabled = true;
                                };
            host.Closing += delegate(object sender, EventArgs e)
                                {
                                    lblServisDurumu.Text = "Servis Kapatılıyor...";
                                };
            host.Closed += delegate(object sender, EventArgs e)
                                {
                                    lblServisDurumu.Text = "Servis Kapatıldı.";
                                    btnServisiAc.Enabled = true;
                                    btnServisiKapat.Enabled = false;
                                };
        } 

        private void btnServisiAc_Click(object sender, EventArgs e)
        {
            ServisiHazirla();
            host.Open(); 
        }

        private void btnServisiKapat_Click(object sender, EventArgs e)
        {
            host.Close(); 
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Servis uygulamasında, &lt;strong&gt;ServisHost&lt;/strong&gt; &amp;ouml;rneklemesi yapılmakta ve servisin durumunu daha kolay izleyebilmek a&amp;ccedil;ısından gerekli olaylar generic metodlar yardımıyla y&amp;uuml;klenmektedir. B&amp;ouml;ylece program kullanıcıları, servisin a&amp;ccedil;ılması ve kapanması durumunu kolay bir şekilde izleyebilecektir. Her zamanki gibi sunucu uygulama, WCF altyapısı i&amp;ccedil;in gerekli &lt;strong&gt; System.ServiceModel.dll&lt;/strong&gt; ile servis s&amp;ouml;zleşmesini i&amp;ccedil;eren UrunServisi.dll isimli sınıf k&amp;uuml;t&amp;uuml;phanesini&lt;strong&gt;(WCF Class Library)&lt;/strong&gt; referans etmektedir. Bunlara ek olarak sunucu uygulamanın WCF i&amp;ccedil;in gerekli konfigurasyon bilgileri ise aşağıdaki gibi &lt;strong&gt;app.config&lt;/strong&gt; dosyasında yer almaktadır.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service name="UrunServisi.UrunYonetici"&amp;gt;
                &amp;lt;endpoint address="net.tcp://localhost:9001/UrunServisi.svc" binding="netTcpBinding" name="UrunServisiEndPoint" contract="UrunServisi.IUrunYoneticiSozlesmesi" /&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rnekte &lt;strong&gt; NetTcpBinding&lt;/strong&gt; bağlayıcı tipi kullanılmaktadır. İstemci tarafını yazmadan &amp;ouml;nce, gerekli proxy sınıfının &amp;uuml;retilmesi gerekmektedir. Bu noktada &lt;strong&gt;svcutil.exe&lt;/strong&gt; aracından aşağıdaki gibi yararlanılabilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk219_1.gif" alt="" width="638" height="324" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Servis tarafında geri bildirim s&amp;ouml;zleşmesi var olduğundan, &amp;uuml;retilen proxy sınıfı diğer &amp;uuml;retimlere g&amp;ouml;re biraz daha farklıdır. Bu farkı g&amp;ouml;rmek i&amp;ccedil;in proxy sınıfı ve beraberinde &amp;uuml;retilen tiplerin sınıf diagramına&lt;strong&gt;(class diagram)&lt;/strong&gt; bakmak yeterlidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk219_4.gif" alt="" width="617" height="305" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Herşeyden &amp;ouml;nce, istemci uygulamada, servis tarafından &amp;ccedil;ağırılabilecek bir geri bildirim opreasyonun s&amp;ouml;z konusu olabilmesi i&amp;ccedil;in, proxy sınıfının generic &lt;strong&gt;DuplexClientBase&lt;/strong&gt; &amp;ouml;zet sınıfından&lt;strong&gt;(abstract class)&lt;/strong&gt; t&amp;uuml;remiş olması gerekmektedir. Diğer taraftan svcutil.exe bu işlemi otomatik olarak yapmaktadır. &amp;Ouml;rnekte dikkat edilirse, geri bildirim s&amp;ouml;zleşmesi tipi, DuplexClientBase sınıfının generic parametresi olarak kullanılmaktadır. Bunun dışında, proxy sınıfının aşırı y&amp;uuml;klemiş&lt;strong&gt;(overload)&lt;/strong&gt; yapıcı metodlarının&lt;strong&gt;(constructor)&lt;/strong&gt; tamamında ilk parametreler &lt;strong&gt;InstanceContext&lt;/strong&gt; sınıfı tipindendir. Bu son derece doğaldır. Nitekim, servisin istemci &amp;uuml;zerindeki bir operasyonu &amp;ccedil;ağırabilmesi i&amp;ccedil;in, istemcinin kendisine verdiği i&amp;ccedil;erik referansını kullanması gerekmektedir. Bu nedenle yapıcı metodun ilk parametresi bu referansı istemciden servis tarafına g&amp;ouml;ndermek i&amp;ccedil;in kullanılır.&lt;/p&gt;
&lt;p&gt;Şimdi gelelim istemci geri bildirim s&amp;ouml;zleşmesini uyarlayan sınıfa. Bu sınıf geliştirici tarafından yazılmalıdır. &amp;Ouml;rnekte bu ama&amp;ccedil;la Uygulayici isimli bir sınıf kullanılmıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk219_5.gif" alt="" width="261" height="229" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulayici isimli sınıfın en b&amp;uuml;y&amp;uuml;k &amp;ouml;zelliği IUrunYoneticiSozlesmesiCallback isimli aray&amp;uuml;z&amp;uuml;&lt;strong&gt;(interface)&lt;/strong&gt; uyguluyor olmasıdır. Burada, aray&amp;uuml;z adının sonundaki &lt;strong&gt;Callback&lt;/strong&gt; kelimesi dikkat &amp;ccedil;ekicidir. Svcutil.exe aracı bunu otomatik olarak eklemektedir. Bunun dışında Uygulayici sınıfı, &lt;strong&gt;IDisposable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;de uygulamaktadır ki burada ama&amp;ccedil; proxy &amp;ouml;rneğinin yok edilmesi sırasında servis ile olan bağlantıyı kapatmaya zorlamaktır. Uygulamaci sınıfına ait kodlar aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace Istemci
{
    /* Servisin, istemci tarafında bir geri bildirim operasyonu &amp;ccedil;ağrısı yapabilmesi i&amp;ccedil;in geri bildirim s&amp;ouml;zleşmesini uygulayan bir sınıfın yazılması gerekir. */
    public class Uygulayici:IUrunYoneticiSozlesmesiCallback,IDisposable
    {
        private UrunYoneticiSozlesmesiClient proxy=null;

        public Uygulayici()
        {           
            proxy = new UrunYoneticiSozlesmesiClient(new InstanceContext(this), "DefaultBinding_IUrunYoneticiSozlesmesi_IUrunYoneticiSozlesmesi"); 
        }

        public void StokMiktariniArttiralim(int artisMiktari,int urunNumarasi)
        {
            proxy.StokMiktariniArttir(artisMiktari, urunNumarasi);
            Console.WriteLine("{0} numaralı &amp;uuml;r&amp;uuml;n&amp;uuml;n stok miktarında {1} adet artış yapıldı",urunNumarasi,artisMiktari); 
        }
        #region IUrunYoneticiSozlesmesiCallback Members

        public void OnStokMiktariDegisti(int degisenUrunId)
        {
            Console.WriteLine("{0} numaralı &amp;uuml;r&amp;uuml;n&amp;uuml;n stok miktarında değişiklik oldu.",degisenUrunId.ToString());
        }

        public void Cikart()
        {
             proxy.AboneligiKaldir(); /* Abonelik &amp;ccedil;ıkartma işlemi yapılmadığ takdirde istemci uygulama istisna mesajları alabilir. Bunun i&amp;ccedil;in istemcide a&amp;ccedil;ılan bir abonelik var ise bunun bilin&amp;ccedil;li olarak kapatılmasındada yarar vardır. Cikart metodu buna destek vermesi amacıyla geliştirilmiştir. */
        }

        #endregion

        #region IDisposable Members
    
        public void Dispose()
        {
            proxy.Close();
        }

        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;Sınıfın yapıcı metodu i&amp;ccedil;erisinde proxy sınıfına ait bir nesne &amp;ouml;rneklenmektedir. Servisin kendisine bağlı istemci &amp;uuml;zerinde bir geri bildirim fonksiyonu &amp;ccedil;ağırabilmesi i&amp;ccedil;in geri bildirim aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulayan tipe ait referansın, proxy oluşturulurken servise bildirilmesi gerekir. Bunun i&amp;ccedil;in proxy sınıfına ait yapıcıların ilk parametreleri daima &lt;strong&gt;InstanceContext&lt;/strong&gt; tipinden bir referans alır. Servis tarafında bu i&amp;ccedil;erik &amp;ouml;rneğinden(InstanceContext) yararlanılarak metod &amp;ccedil;ağrısı yapıldığında, WCF &amp;ccedil;alışma zamanı bu sınıf i&amp;ccedil;erisindeki ilgili metodu &amp;ccedil;ağıracaktır ki bu &amp;ouml;rnekte s&amp;ouml;z konusu metod &lt;strong&gt; OnStokMiktariDegisti&lt;/strong&gt; dır.&lt;/p&gt;
&lt;p&gt;Sınıf aynı zamanda Dispose metodu i&amp;ccedil;erisinde proxy sınıfının Close metodunuda &amp;ccedil;ağırmaktadır. Bunun sebebi şudur; İstemci servis tarafının callback &amp;ccedil;ağrısını beklemeden proxy' yi kapatırsa servis tarafında hatalar oluşabilir. Bu nedenle &lt;strong&gt;Dispose&lt;/strong&gt; metodu i&amp;ccedil;erisinden &lt;strong&gt;Close&lt;/strong&gt; metodu &amp;ccedil;ağırılır. Artık istemci tarafında Console uygulamasına ait &lt;strong&gt;Main&lt;/strong&gt; metodunun i&amp;ccedil;eriğini aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace Istemci
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("İşlemlere başlamak i&amp;ccedil;in tıklayın");
            Console.ReadLine();

            Uygulayici uyg = new Uygulayici();
            uyg.StokMiktariniArttiralim(10, 1);

            Console.ReadLine();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Artık testlere başlanabilir. &amp;Ouml;nce sunucu uygulamanın &amp;ccedil;alıştırılması ve servisin a&amp;ccedil;ılması gerekmektedir. Ardından istemci uygulama &amp;ccedil;alıştırılarak devam edilirse aşağıdakine benzer ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;leri ile karşılaşılır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk219_6.gif" alt="" width="596" height="299" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, istemci tarafında servis &amp;uuml;zerindeki StokMiktariniArttir metodu &amp;ccedil;ağırldıktan sonra, serviste istemci tarafındaki OnStokMiktariDegisti metodunu &amp;ccedil;alıştırmıştır.&lt;/p&gt;
&lt;p&gt;Buraya kadar geliştirilen &amp;ouml;rnek sadece servis tarafından istemcideki bir metodun client callback modeli ile nasıl &amp;ccedil;alıştırabileceğidir. Oysaki ger&amp;ccedil;ek hayat senaryolarında, bir istemcinin aksiyonu sonrası diğer t&amp;uuml;m istemcilerinde servis tarafından haberdar edilmesi istenebilir. Bu durumda servisin kendisine bağlı olan istemcileri bilmesi, bunların referanslarını tutması gerekmektedir. Ayrıca istemciler diğer istemcilerin aksiyonlarından servis yoluyla haberdar edilip edilmeyeceklerinide belirleyebilmelidirler. Kısacası, istemcinin kendisini servis tarafına istediği zaman abone edebilmesi&lt;strong&gt;(Subscribe)&lt;/strong&gt; ve istediği zamanda abonelikten &amp;ccedil;ıkartabilmesi&lt;strong&gt;(Unsubscribe)&lt;/strong&gt; gerekmektedir. Aşağıdaki şekiller ile durum daha net anlaşılabilir.&lt;/p&gt;
&lt;p&gt;İlk olarak istemcilere ait &amp;ouml;rneklerin servis tarafına bildirilmesi bir başka deyişle abone edilmesi s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk219_7.gif" alt="" width="461" height="286" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İstemciler servis &amp;uuml;zerinde operayon &amp;ccedil;ağrıları ger&amp;ccedil;ekleştirirler. Bu &amp;ccedil;ağrılardan haberdar olmak isteyenler servise abone olurken istemeyenler abonelikten &amp;ccedil;ıkarlar veya hi&amp;ccedil; abone olmazlar. Servis ise kendisine abone olanlar &amp;uuml;zerinden geri bildirim metodlarını &amp;ccedil;ağırabilir ve b&amp;ouml;ylece bilgilendirme yapabilir. &amp;Ouml;rneğin aşağıdaki senaryoya g&amp;ouml;re, daha &amp;ouml;nce abone olmuş olan İstemci A abonelikten &amp;ccedil;ıktıktan sonra, istemci D' nin yapacağı Stok Miktarı Değiştirme işleminden, İstemci B, İstemci C ve İstemci D' nin kendisi haberdar olabilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk219_8.gif" alt="" width="467" height="318" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi bu işlemi adım adım yapmaya &amp;ccedil;alışalım. İlk olarak servis s&amp;ouml;zleşmesine, istemcilerin abone olabilmek ve abonelikten &amp;ccedil;ıkabilmek i&amp;ccedil;in &amp;ccedil;ağırabilecekleri iki metod tanımı eklenmesi gerekmektedir. Bunun i&amp;ccedil;in IUrunYoneticiSozlesmesi aray&amp;uuml;z&amp;uuml;ne&lt;strong&gt;(interface)&lt;/strong&gt; aşağıdaki eklemelerin yapılması yeterlidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace UrunServisi
{
    [ServiceContract(CallbackContract=typeof(IGeriBildirimSozlesmesi))]
    public interface IUrunYoneticiSozlesmesi
    {
        [OperationContract()]
        void StokMiktariniArttir(int gelenMiktar, int urunNo);

        [OperationContract()]
        void AboneOl();
    
        [OperationContract()]
        void AboneligiKaldir();
    }
}&lt;/pre&gt;
&lt;p&gt;Bu değişiklikler nedeniyle, servis s&amp;ouml;zleşmesini uygulayan UrunYonetici sınıfı i&amp;ccedil;erisindede AboneOl ve AboneligiKaldir metodlarının yazılması gerekmektedir. İstemcilerin geri bildirim referanslarının servis tarafında saklanabilmesi i&amp;ccedil;in generic bir liste koleksiyonu&lt;strong&gt;(List&amp;lt;T&amp;gt;) &lt;/strong&gt;kullanılabilir. AboneOl metodu ile bu koleksiyona istemcinin geri bildirim referansı eklenirken, AboneligiKaldir metodu ilede istemciden gelen geri bildirim referansının ilgili koleksiyondan kaldırılması sağlanır. İstemcilere yayınlama yapacak olan ayrı bir metod ise, istenildiğinde servis tarafından koleksiyonda tutulan t&amp;uuml;m istemci geri bildirim referanslarına ait metodların &amp;ccedil;ağırılması g&amp;ouml;revini &amp;uuml;stlenir. Bu bilgiler ışığında UrunYonetici sınıfının aşağıdaki gibi dizayn edilmesi yeterlidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.ServiceModel;
using System.Data.SqlClient;
using System.Collections.Generic;

namespace UrunServisi
{
    public class UrunYonetici:IUrunYoneticiSozlesmesi
    {
        // İstemcilerin geri bildirim referanslarını tutacak olan List&amp;lt;T&amp;gt; koleksiyonu.
        private static List&amp;lt;IGeriBildirimSozlesmesi&amp;gt; geriBildirimAboneleri = new List&amp;lt;IGeriBildirimSozlesmesi&amp;gt;();

        #region IUrunYoneticiSozlesmesi Members

        // İstemcilerin servis tarafındaki geri bildirim listesine abone olmasını sağlayan metod.
        public void AboneOl()
        {
            // Servise o anda bağlı olan istemcideki IGeriBildirimSozlesmesi aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamış sınıf referansı alınır.
            IGeriBildirimSozlesmesi geriBildirim = OperationContext.Current.GetCallbackChannel&amp;lt;IGeriBildirimSozlesmesi&amp;gt;();
            // Eğer List&amp;lt;&amp;gt; kolekisyonunda gelen istemci geri bildirim referansı yoksa eklenir.
            if (!geriBildirimAboneleri.Contains(geriBildirim))
                 geriBildirimAboneleri.Add(geriBildirim);
        }

        // İstemcilerin, servis tarafındaki geri bildirim abonleri listesinden &amp;ccedil;ıkartılmasını sağlayan metod.
        public void AboneligiKaldir()
        {
            IGeriBildirimSozlesmesi geriBildirim = OperationContext.Current.GetCallbackChannel&amp;lt;IGeriBildirimSozlesmesi&amp;gt;();
            // İstemci geri bildirim referansı, List&amp;lt;&amp;gt; koleksiyonundan &amp;ccedil;ıkartılır.
            geriBildirimAboneleri.Remove(geriBildirim);
        }

        private void AboneleriBilgilendir(int urunNumarasi)
        {
            /* List&amp;lt;&amp;gt; koleksiyonundaki t&amp;uuml;m geri bildirim referansları dolaşılır ve sahibi olan istemci uygulama halen daha &amp;ccedil;alışıyorsa (ki bu durum State ile tespit edilmektedir), istemci &amp;uuml;zerindeki geri bildirim operasyonu &amp;ccedil;ağırılır. */
            foreach (IGeriBildirimSozlesmesi geriBildirim in geriBildirimAboneleri)
            {
                if (((ICommunicationObject)geriBildirim).State == CommunicationState.Opened)
                    geriBildirim.OnStokMiktariDegisti(urunNumarasi);
                else // Eğer istemci canlı değilse, servis tarafındaki List&amp;lt;&amp;gt; koleksiyonundan da &amp;ccedil;ıkartılır.
                    geriBildirimAboneleri.Remove(geriBildirim);
            }
        }

        public void StokMiktariniArttir(int gelenMiktar,int urunNo)
        {
            string sorgu = "Update Products Set UnitsInStock=UnitsInStock+@GelenMiktar Where ProductID=@PrdId";
            using (SqlConnection conn = new SqlConnection("data source=.;database=Northwind;integrated security=SSPI"))
            {
                SqlCommand cmd = new SqlCommand(sorgu, conn);
                cmd.Parameters.AddWithValue("@GelenMiktar", gelenMiktar);
                cmd.Parameters.AddWithValue("@PrdId", urunNo);
                conn.Open();
                int guncellenen=Convert.ToInt32(cmd.ExecuteNonQuery());
                if (guncellenen &amp;gt; 0)
                {
                    AboneleriBilgilendir(urunNo);                  
                }
            }
        }
            
        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;Servis tarafındaki bu değişikliklerin ardından, istemci i&amp;ccedil;in gerekli proxy sınıfının &lt;strong&gt;svcutil.exe&lt;/strong&gt; aracı yardımıyla yeniden &amp;uuml;retilmesi gerekmektedir. Bu &amp;uuml;retim işlemi sonrasında istemci tarafına atanan tiplerin son hali aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk219_9.gif" alt="" width="616" height="339" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İstemci tarafında geri bildirim s&amp;ouml;zleşmesini uygulayan Uygulayici isimli sınıfın yapıcı metodu i&amp;ccedil;erisinde AboneOl metodu &amp;ccedil;alıştırılmaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace Istemci
{
    public class Uygulayici:IUrunYoneticiSozlesmesiCallback,IDisposable
    {
        private UrunYoneticiSozlesmesiClient proxy=null;

        public Uygulayici()
        {
            proxy = new UrunYoneticiSozlesmesiClient(new InstanceContext(this), "DefaultBinding_IUrunYoneticiSozlesmesi_IUrunYoneticiSozlesmesi");
            proxy.AboneOl();
        }
        // Diğer kod satırlar
    }
}&lt;/pre&gt;
&lt;p&gt;Main metodu i&amp;ccedil;erisinde ise aşağıdaki test kodları yazılabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
    try
    {
        Console.WriteLine("İşlemlere başlamak i&amp;ccedil;in tıklayın");
        Console.ReadLine();

        Uygulayici uyg = new Uygulayici();
        Console.WriteLine("Abonelik başlatıldı.Devam etmek i&amp;ccedil;in bir tuşa basın");
        Console.ReadLine();
        uyg.StokMiktariniArttiralim(10, 1);
          uyg.Cikart();
    }
    catch (Exception exp)
    {
        Console.WriteLine(exp.Message);
    }
    Console.ReadLine();
}&lt;/pre&gt;
&lt;p&gt;Uygulamayı bu haliyle test etmeye başlayabiliriz. Servis uygulaması &amp;ccedil;alıştırıldıktan sonra, bir ka&amp;ccedil;tane istemcinin &amp;ccedil;alıştırılması ve bunlardan herhangibirinde &amp;uuml;r&amp;uuml;n stok miktarının değiştirilmesi işleminin yapılması yeterlidir. Yapılan testlerde, bir istemcinin urun stok miktarında yaptığı değişiklik sonrası, diğer istemcilerinde ilgili değişiklikten haberdar edildiği g&amp;ouml;r&amp;uuml;lmektedir. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde bu testin sonu&amp;ccedil;ları yer almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk219_10.gif" alt="" width="490" height="682" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Geliştirilen &amp;ouml;rnek &lt;strong&gt;TCP&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml; kullanan &lt;strong&gt;netTcpBinding&lt;/strong&gt; bağlayıcı tipine ele almaktadır. Oysaki HTTP protokol&amp;uuml;nde varsayılan olaran client callbak desteği olmadığından yazımızın başında bahsetmiştik. Client Callback desteği i&amp;ccedil;in &amp;ccedil;ift y&amp;ouml;nl&amp;uuml; &lt;strong&gt;HTTP&lt;/strong&gt; kanallarına ihtiya&amp;ccedil; vardır. Bir başka deyişle tek y&amp;ouml;nl&amp;uuml; iki adet kanal HTTP protokol&amp;uuml; &amp;uuml;zerinden kullanılarak istenen sistem kurulabilir. WCF i&amp;ccedil;erisinde bu desteği &lt;strong&gt;WsDualHttpBinding&lt;/strong&gt; tipi karşılamaktadır. Yazılan &amp;ouml;rneği, HTTP destekli hale getirmek i&amp;ccedil;in servis ve istemci tarafında yapılması gerekenler vardır. Servis tarafından &amp;ccedil;ift kanallı HTTP desteğini vermesi i&amp;ccedil;in WsDualHttpBinding tipini kullanan yeni bir &lt;strong&gt;endPoint&lt;/strong&gt; bildirimi yapılmalıdır. Bu ama&amp;ccedil;la servis uygulamasındaki App.Config dosyasına aşağıdaki bildirim ile yeni endPoint ilave edilir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;endpoint address="http://localhost:4500/UrunServisi/UrunServisi.svc" binding="wsDualHttpBinding" name="UrunServisWsEndPoint" contract="UrunServisi.IUrunYoneticiSozlesmesi" /&amp;gt;&lt;/pre&gt;
&lt;p&gt;İstemci tarafındaki konfigurasyon dosyasında da WsDualHttpBinding tipini kullanan bir endPoint bildirimi yapılmalıdır.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;endpoint address="http://localhost:4500/UrunServisi/UrunServisi.svc" binding="wsDualHttpBinding" contract="IUrunYoneticiSozlesmesi" name="WsDualHttpBinding_IUrunYoneticiSozlesmesi" /&amp;gt;&lt;/pre&gt;
&lt;p&gt;Son olarak istemci tarafında yer alan Uygulayici isimli sınıftada bazı &amp;ouml;nemli değişikliklerin yapılması gerekmektedir. &amp;Ouml;zellikle proxy sınıfına ait nesneyi &amp;ouml;rneklediğimiz yerde yapılması gereken değişiklikler aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public Uygulayici()
{
    //proxy = new UrunYoneticiSozlesmesiClient(new InstanceContext(this), "DefaultBinding_IUrunYoneticiSozlesmesi_IUrunYoneticiSozlesmesi");
    proxy = new UrunYoneticiSozlesmesiClient(new InstanceContext(this), "WsDualHttpBinding_IUrunYoneticiSozlesmesi");
    WSDualHttpBinding baglayici = (WSDualHttpBinding)proxy.Endpoint.Binding;
    baglayici.ClientBaseAddress = new Uri("http://localhost:4500/UrunServisi/" + Guid.NewGuid().ToString());
    proxy.AboneOl();
}&lt;/pre&gt;
&lt;p&gt;İstemciler WsDualHttpBinding bağlayıcı tipini kullandıklarında, iki adet tek y&amp;ouml;nl&amp;uuml; &lt;strong&gt;HTTP&lt;/strong&gt; kanalı a&amp;ccedil;arlar. WCF &amp;ccedil;alışma zamanı, servis tarafından gelen talepleri varsayılan olarak &lt;strong&gt;80&lt;/strong&gt; numaralı port &amp;uuml;zerinden dinleyecektir. Oysaki &lt;strong&gt;80&lt;/strong&gt; numaralı portu &lt;strong&gt;IIS(Internet Information Services)&lt;/strong&gt; kullanıyor olabilir. Bu durumda istemci uygulama &amp;ccedil;alışma zamanında hata mesajı verecektir. Nitekim 80 numaralı port başka bir uygulama tarafından kullanılmaktadır. Bunun &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek i&amp;ccedil;in, bağlayıcı tipin &amp;uuml;zerinden &lt;strong&gt;ClientBaseAddress&lt;/strong&gt; &amp;ouml;zelliğine ge&amp;ccedil;ici bir adres değeri ataması yapılır. Aynı makine &amp;uuml;zerinde birden fazla istemci uygulaması &amp;ccedil;alıştırılabileceğinden, adreslerin benzersizliğinide garanti altına almak adına &amp;ouml;rnekte &lt;strong&gt;Guid&lt;/strong&gt; tipinden yararlanılmıştır. &amp;Ouml;rnek bu son haliyle test edilirse, yine servisin abonelere geri bildirimde bulunabildiği g&amp;ouml;r&amp;uuml;lecektir. &amp;Uuml;stelik bu kez durum HTTP &amp;uuml;zerinden ger&amp;ccedil;ekleştirilmektedir. Dolayısıyla sistem internet &amp;uuml;zerinden kullanılabilir halede gelmiştir.&lt;/p&gt;
&lt;p&gt;Elbette bu senaryoda dikkat edilmesi gereken durumlar vardır. S&amp;ouml;z gelimi, istemcilerin aboneliklerini kaldırmadıkları durumlar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. &amp;Ouml;rneğin 3 farklı istemci servise abone olsun. Bunlardan birisi aboneliğini kaldırmadan uygulamayı kapatmış olabilir. Oysaki servis tarafında yer alan abone koleksiyonunda 3 adet istemci kayıtlıdır. Dolayısıyla diğer istemcilerden birisinin yaptığı &amp;ccedil;ağrı sonrasında, servis tarafındaki aboneleri bilgilendirici metod halen daha var olmayan istemci abone koleksiyonundan &amp;ccedil;ıkartılmadığı i&amp;ccedil;in istemci tarafında istisna alınmasına neden olabilir. Bunun &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek i&amp;ccedil;in &lt;strong&gt;State&lt;/strong&gt; kontrol&amp;uuml; yapılsada, yapılan testlerde bazı durumlarda istemcideki proxy ile servis arasındaki bağlantının tam olarak kapanmaması halinde bu tarz bir durum olduğu ortaya &amp;ccedil;ıkmıştır. O halde istemci tarafında yer alan aboneliği kaldırma işleminin rol&amp;uuml; son derece &amp;ouml;nemlidir.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, WCF uygulamalarında servislerin istemciler &amp;uuml;zerinde nasıl metod &amp;ccedil;ağırabileceğini &lt;strong&gt;Client Callback&lt;/strong&gt; tekniği ile incelemeye &amp;ccedil;alıştık. Bu &amp;ccedil;ağırım işlemini abone bazlı hale getirerek, herhangibir istemcinin bir olay ger&amp;ccedil;ekleştirmesi sonrası servisin diğer istemcileride uyarabilmesini sağladık. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/ClientCallback.zip"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2007-08-23 12:00:00</pubDate>
  <slug>WCF-Client-Callback-(Istemci-Taraflc4b1-Geri-Bildirim)-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
    <tag>client-callback</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>