<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Python - Flask ile Basit Bir Web Uygulaması Geliştirmek</title>
  <description>Python tarafında Flask paketini kullanarak web uygulamaları geliştirmek oldukça basit. Bu yazımızda şablon(template) kullanarak bir Web sayfasından Post işlemi gerçekleştirmeyi deneyeceğiz.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/07/sicak.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Yazıyı yazdığım şu yaz g&amp;uuml;n&amp;uuml;nde hava epey sıcak. İstanbul'da &amp;ouml;ğle saatlerinde 39 dereceyi g&amp;ouml;rd&amp;uuml;k. G&amp;uuml;ney tarafında yaşayan bir ka&amp;ccedil; yakın arkadaşımdan 48 dereceli rakamları duyduktan sonra ise halimize ş&amp;uuml;kredelim dedim. A&amp;ccedil;tım Python kitabımı, &amp;ccedil;alışmaya devam ettim.&lt;/p&gt;
&lt;p&gt;Bir s&amp;uuml;re &amp;ouml;nce GoLang tarafında basit web uygulamalarının nasıl geliştirilebileceğini incelemeye &amp;ccedil;alışmıştım. Daha &amp;ouml;nceden de Python tarafında Flask paketinden yararlanarak &lt;a href="/post/python-ile-rest-tabanli-servis-gelistirmek" target="_blank"&gt;REST tabanlı bir servis&lt;/a&gt;&amp;nbsp;geliştirmeyi denemiştim. Tabii servis bir yanaaaa web uygulamaları bir yana. Son kullanıcı &amp;ccedil;oğunlukla g&amp;ouml;rsel bir şeyler bekliyor. Python camiasında Djiango Framework bu anlamda daha pop&amp;uuml;ler tabii ama hen&amp;uuml;z onu inceleme fırsatım olmadı. Flask olduk&amp;ccedil;a hafif bir framework olarak karşımıza &amp;ccedil;ıkmakta. Bende ondan faydalanarak basit bir web uygulaması nasıl yapılabilir inceleyeyim dedim.&lt;/p&gt;
&lt;p&gt;Yazımızın ilerleyen kısımlarında&amp;nbsp;Flask paketi ve template tipinden HTML şablonlarından yararlanarak olduk&amp;ccedil;a basit bir Web uygulaması geliştirmeye &amp;ccedil;alışacağız. Yazacağımız web uygulaması temel olarak iki sayının toplamını hesaplayan bir arabirim sunacak ancak &amp;ouml;ğreneceğimiz temel esaslar daha gelişmiş web uygulamalarının tasarlanmasında da kullanılmakta. &amp;Ouml;zellikle web sayfası i&amp;ccedil;eriği ve Python tarafında web sunucu g&amp;ouml;revini &amp;uuml;stlenecek kodlar ile arada kurmaya &amp;ccedil;alışacağımı bir iletişim s&amp;ouml;z konusu olacak. Dilerseniz vakit kaybetmeden uygulamamızı geliştirmeye başlayalım.&lt;/p&gt;
&lt;h1&gt;Klas&amp;ouml;r Yapısı&lt;/h1&gt;
&lt;p&gt;İşe ilk olarak klas&amp;ouml;r yapısını anlatarak başlamalıyım. Aşağıdaki kurguyu ele alabiliriz.&lt;/p&gt;
&lt;p&gt;/hello_flask.py&lt;br /&gt;/templates/&lt;br /&gt;&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;basepage.html&lt;br /&gt;&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;einstein.html&lt;br /&gt;&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;result.html&lt;br /&gt;/static/&lt;br /&gt;&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; main.css&lt;/p&gt;
&lt;p&gt;hello_flask isimli python sayfamızda http taleplerini y&amp;ouml;nledirme işlemlerini ger&amp;ccedil;ekleştireceğiz. templates klas&amp;ouml;r&amp;uuml;nde bazı basit HTML i&amp;ccedil;erikleri yer alıyor. Bunlar şablon sayfalarımız olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilirler. basepage diğerleri i&amp;ccedil;in ata şablon g&amp;ouml;revini &amp;uuml;stlenmekte. Einstein.html i&amp;ccedil;erisinde toplama işlemi i&amp;ccedil;in bir i&amp;ccedil;erik sunarken işlem sonu&amp;ccedil;larını result.html sayfasından sunmayı planlıyoruz. Tasarldığımız kurguda &amp;ouml;nemli olan noktalardan birisi HTML sayfaları ile Flask &amp;ccedil;atısının iletişimi. Şimdi şablon sayfalarını yakından tanımaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;h1&gt;Template Sayfaları&lt;/h1&gt;
&lt;p&gt;Web uygulamamızda &lt;a href="http://jinja.pocoo.org/docs/2.9/" target="_blank"&gt;Jinja2&lt;/a&gt; standartlarında i&amp;ccedil;erik sunacak HTML sayfaları bulunuyor. Bu HTML sayfaları Flask tarafı ile iletişim halinde olacak. Aslında olay {{ ve }} arasındaki kısımlarda ger&amp;ccedil;ekleşmekte. Burada kullanılan değişken adları python tarafında da değerlendirilebiliyor. Bir başka deyişe python kod tarafı ile statik HTML sayfaları arasındaki veri alışverişinde bu s&amp;ouml;z dizimi değer bulacak.&lt;/p&gt;
&lt;h2&gt;basepage.html&lt;/h2&gt;
&lt;p&gt;BasePage.html .Net tarafında Web uygulaması geliştiren arkadaşlarımızca Master Page olarak d&amp;uuml;ş&amp;uuml;nebilir. Kısaca diğer sayfalar i&amp;ccedil;in tepede yer alan bir ana şablon vazifesi g&amp;ouml;rmekte.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;!doctype html&amp;gt;
&amp;lt;html&amp;gt;
    &amp;lt;head&amp;gt;
        &amp;lt;title&amp;gt;{{ page_title }}&amp;lt;/title&amp;gt;
        &amp;lt;link rel="stylesheet" href="static/main.css"/&amp;gt;
    &amp;lt;/head&amp;gt;
    &amp;lt;body&amp;gt;
        {% block body %}
        {% endblock %}
    &amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere title elementinde page_title, body kısmında ise block body ve endblock isimli tanımlamalar mevcut. Bu tanımlamaların {{ ve }} arasında olduklarına dikkat edelim. Alt sayfaların block body ve endblock isimli kısımlar i&amp;ccedil;erisine yerleşeceğini de s&amp;ouml;yleyebiliriz.&lt;/p&gt;
&lt;h2&gt;einstein.html&lt;/h2&gt;
&lt;p&gt;Base Page'den t&amp;uuml;reyen Einstein.html temel bir toplama operasyonunu &amp;uuml;stlenmekte. İlk olarak extends isimli bir tanımlama ile başladığını g&amp;ouml;rebiliriz. Burada basepage.html'den t&amp;uuml;retildiğini belirtiyoruz. block body ve endblock kısımları arasında bir takım tanımlamalar mevcut. h2 boyutlarında bir başlık belirttikten sonra POST metodunu kullanan bir form yer alıyor.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;{% extends 'basepage.html' %}
{% block body %}

&amp;lt;h2&amp;gt;{{ page_title }}&amp;lt;/h2&amp;gt;

&amp;lt;form method='POST' action='/sum'&amp;gt;
&amp;lt;table&amp;gt;
&amp;lt;p&amp;gt;Sum of two values&amp;lt;/p&amp;gt;
&amp;lt;tr&amp;gt;&amp;lt;td&amp;gt;First Value:&amp;lt;/td&amp;gt;&amp;lt;td&amp;gt;&amp;lt;input name="firstValue" type="TEXT" width="10"&amp;lt;/td&amp;gt;&amp;lt;/tr&amp;gt;
&amp;lt;tr&amp;gt;&amp;lt;td&amp;gt;Second Value:&amp;lt;/td&amp;gt;&amp;lt;td&amp;gt;&amp;lt;input name="secondValue" type="TEXT" width="10"&amp;lt;/td&amp;gt;&amp;lt;/tr&amp;gt;
&amp;lt;/table&amp;gt;
&amp;lt;p&amp;gt;&amp;lt;input value="Calculate" type="SUBMIT"&amp;gt;&amp;lt;/p&amp;gt;
&amp;lt;/form&amp;gt;

{% endblock %}&lt;/pre&gt;
&lt;p&gt;Pek tabii form elementinin method ve action niteliklerine atanan değerler olduk&amp;ccedil;a kıymetli. Calculate isimli butona basıldığında ger&amp;ccedil;ekleşecek Submit işlemi sonrası &lt;a href="http://localhost:5000/sum"&gt;http://localhost:5000/sum&lt;/a&gt;&amp;nbsp;adresine gidilecek. Bu işlem HTTP protokol&amp;uuml;n&amp;uuml;n POST metoduna g&amp;ouml;re ger&amp;ccedil;ekleşecek. Form &amp;uuml;zerinde iki tane text kontrol&amp;uuml; var. Bunlar toplama işlemine dahil edilecek değişkenleri aldığımız kontroller.&lt;/p&gt;
&lt;h2&gt;result.html&lt;/h2&gt;
&lt;p&gt;Toplama işleminin sonucunu g&amp;ouml;stereceğimiz HTML şablonu ise aşağıdaki i&amp;ccedil;eriğe sahip.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;{% extends "basepage.html" %}
{% block body %}

&amp;lt;h2&amp;gt;{{ page_title }}&amp;lt;/h2&amp;gt;
&amp;lt;p&amp;gt;You submitted the following data:&amp;lt;/p&amp;gt;
&amp;lt;table&amp;gt;
    &amp;lt;tr&amp;gt;&amp;lt;td&amp;gt;First:&amp;lt;/td&amp;gt;&amp;lt;td&amp;gt;{{ first_value }}&amp;lt;/td&amp;gt;&amp;lt;/tr&amp;gt;
    &amp;lt;tr&amp;gt;&amp;lt;td&amp;gt;Second:&amp;lt;/td&amp;gt;&amp;lt;td&amp;gt;{{ second_value }}&amp;lt;/td&amp;gt;&amp;lt;/tr&amp;gt;
&amp;lt;/table&amp;gt;

&amp;lt;p&amp;gt;Result&amp;lt;/p&amp;gt;
&amp;lt;h3&amp;gt;{{ sum_result }}&amp;lt;/h3&amp;gt;

{% endblock %}&lt;/pre&gt;
&lt;p&gt;Yine basepage sayfasından yapılan bir genişletme olduğunu ifade edebiliriz. G&amp;ouml;vde bu kez sonu&amp;ccedil;ları g&amp;ouml;stereceğimiz HTML elementlerini barındırıyor. table elementi i&amp;ccedil;erisinde first_value, second_value ve sonrasında gelen sum_result isimli değişklenlerle toplama işlemine ait detayları ve sonucu g&amp;ouml;steriyoruz. T&amp;uuml;m değişkenlerin Jinja'nın istediği şekilde {{ ve }} arasında yazıldığına dikkat edelim. Benzer yaklaşım GoLang tarafında da mevcuttu.&lt;/p&gt;
&lt;h2&gt;hello_plask.py&lt;/h2&gt;
&lt;p&gt;Aslında en kilit nokta bu pyhton kod dosyası diyebiliriz. Flask ile entegre &amp;ccedil;alışan bu kod par&amp;ccedil;ası, &lt;a href="http://localhost:5000"&gt;http://localhost:5000&lt;/a&gt;&amp;nbsp;nolu porta gelecek talepleri değerlendirmek &amp;uuml;zere &amp;ccedil;alışmakta.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;from flask import Flask, render_template,request
app=Flask(__name__)

@app.route('/')
def entry_page()-&amp;gt;'html':
    return render_template('einstein.html',page_title='Wellcome to Little Einstein Project')


@app.route('/sum',methods=['POST'])
def sum()-&amp;gt;'html':
    x=int(request.form['firstValue'])
    y=int(request.form['secondValue'])
    return render_template('result.html',page_title='Calculation result',sum_result=(x+y),first_value=x,second_value=y,)

app.run(debug=True)&lt;/pre&gt;
&lt;p&gt;İlk olarak Flask, render_template ve request mod&amp;uuml;llerinin entegre edildiğini belirtelim. @app.route ile başlayan decorator tanımlamaları ile takip eden fonksiyonların &amp;ccedil;alışma zamanlarındaki davranışlarını değiştirmekteyiz. Buna g&amp;ouml;re / adresine gelecek talepler entry_page, /sum adresine gelecek olan talepler ise sum fonksiyonu tarafından değerlendirilecek.&lt;/p&gt;
&lt;p&gt;Kullanıcı einstein.html sayfasındaki butona bastığında POST metodu ile /sum adresine doğru bir y&amp;ouml;nlendirme yapılmakta. Bu kısım sum fonksiyonunca ele alınıyor. app.run(debuy=True) ifadesine g&amp;ouml;re &amp;ccedil;alışma zamanındaki t&amp;uuml;m işlemleri&lt;em&gt;(HTTP talepleri, olası &amp;ccedil;alışma zamanı hataları vb)&lt;/em&gt; konsolda g&amp;ouml;rmemiz m&amp;uuml;mk&amp;uuml;n.&lt;/p&gt;
&lt;p&gt;entry_page ve sum metodlarının &amp;ccedil;ıktıları html olacak şekilde belirtildi. İşte bu noktada tasarlanan HTML sayfalarının render edilmesi ve istemciye g&amp;ouml;nderilmesi s&amp;ouml;z konusu. render_template metodu bu noktada devreye girmekte. İlk parametre ile hangi HTML i&amp;ccedil;eriğini &amp;ccedil;ağıracağımızı belirtiyoruz. Bu i&amp;ccedil;erikler otomatik olarak templates klas&amp;ouml;r&amp;uuml;nde aranacaklar. Metod &amp;ccedil;ağrısında takip eden parametreler ise tahmin edeceğiniz &amp;uuml;zere render edilen HTML i&amp;ccedil;erisinde kullanılan değişken adları.&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;&amp;Ccedil;alışma Zamanı&lt;/h1&gt;
&lt;p&gt;Yazdığımız uygulamayı IDLE &amp;uuml;zerinden değil de komut satırından &amp;ccedil;alıştırmamız &amp;ccedil;ok daha doğru olacaktır. Web sayfalarına gelecek olan talepler debug=True ataması nedeniyle komut satırına yansıtılacak. Bu sayede anlık olarak gelişmeleri takip edebiliriz. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde bunun bir &amp;ouml;rneğini g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/07/flaskweb_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak root adrese talepte bulunalım. Aşağıdaki &amp;ccedil;ıktı ile karşılamamız gerekiyor. &lt;em&gt;(Burada kullanılan CSS'i &lt;a href="http://python.itcarlow.ie/ed2/ch05/static/hf.css" target="_blank"&gt;kitabın &amp;ouml;nerdiği adresten&lt;/a&gt; kullandım. Sadece ufak değişikliklerim oldu. Siz farklı stiller uygulayabilir ve web i&amp;ccedil;eriğini &amp;ccedil;ok daha şık hale getirebilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/07/flaskweb_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://localhost:5000"&gt;http://localhost:5000&lt;/a&gt;/&amp;nbsp;adresine yapacağımız talebin karşılığında hello_flask.py i&amp;ccedil;erisindeki entry_page metodu devreye girecek ve einstein.html isimli sayfanın istemciye sunulması sağlanacaktır. Gelen ekrandaki kontrollere iki sayısal değer girip Calculate butonuna basarsak Post işlemi sonrası Sum isimli operasyon &amp;ccedil;alıştırılacak ve aşağıdaki &amp;ccedil;ıktı elde edilecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/07/flaskweb_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere Flask paketini kullanarak Python tarafında bir web uygulaması geliştirmek ve şablon HTML sayfalarını kullanmak olduk&amp;ccedil;a basit. Pek tabii şablon kullanımında {{ ile }} arasına alınabilecek &amp;ccedil;ok farklı teknikler de s&amp;ouml;z konusudur. Bunları kitabın ilerleyen kısımlarında bulabileceğimi d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. &amp;Ouml;ğrendik&amp;ccedil;e sizlerle paylaşmaya &amp;ccedil;alışacağım. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-08-09 21:02:00</pubDate>
  <slug>Flask-ile-Basit-Bir-Web-Uygulaması-Gelistirmek</slug>
  <tags>
    <tag>python</tag>
    <tag>flask</tag>
    <tag>web-programlama</tag>
    <tag>http-post</tag>
    <tag>post</tag>
    <tag>jinja</tag>
    <tag>http</tag>
    <tag>html</tag>
    <tag>template</tag>
  </tags>
  <categories>
    <category>python</category>
  </categories>
</post>