<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ado.Net 2.0 ve SqlDependency Sınıfı Yardımıyla Query Notification</title>
  <description>Çoğu zaman istemci uygulamalarda, kullanıcıya sunduğumuz verilerin yer aldığı tablolarda başka kullanıcılar tarafından gerçekleştirilen değişikliklerin anında görünmesini isteriz. SqlDependency sınıfı sayesinde artık, bir veritabanında meydana gelen değişiklikleri (şu an için Sql Server ve Yukon) anında yakalayabilme şansına sahibiz. İşte bugünkü makalemizde aslında son derece derin ve geniş bir konu olan Sql Server Notification meselesini çok basit bir örnek ve Ado.Net 2.0 ile gelen yeni sınıflardan birisi olan SqlDependency yardımıyla incelemeye çalışacağız. İlk olarak şu soruyu düşünelim.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;oğu zaman istemci uygulamalarda, kullanıcıya sunduğumuz verilerin yer aldığı tablolarda başka kullanıcılar tarafından ger&amp;ccedil;ekleştirilen değişikliklerin anında g&amp;ouml;r&amp;uuml;nmesini isteriz. SqlDependency sınıfı sayesinde artık, bir veritabanında meydana gelen değişiklikleri (şu an i&amp;ccedil;in Sql Server ve Yukon) anında yakalayabilme şansına sahibiz. İşte bug&amp;uuml;nk&amp;uuml; makalemizde aslında son derece derin ve geniş bir konu olan Sql Server Notification meselesini &amp;ccedil;ok basit bir &amp;ouml;rnek ve Ado.Net 2.0 ile gelen yeni sınıflardan birisi olan SqlDependency yardımıyla incelemeye &amp;ccedil;alışacağız. İlk olarak şu soruyu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;table id="table1" style="width: 50%;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;Sunucu &amp;uuml;zerinde ne gibi gelişmeler olduğunda anında haberdar olmak isteyebiliriz? &lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;Verilerde meydana gelebilecek değişikler; bir başka deyişle yeni satırların eklenmesi, satırların silinmesi veya g&amp;uuml;ncellenmesi.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;Tablo &amp;uuml;zerinde Drop, Alter veya Delete işlemlerinin uygulanması.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;Sql sunucusunun yeniden başlatılması.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;Sql sunucusu &amp;uuml;zerinde hatalar oluşması nedeniyle sunucunun işleyişinin durması.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;İşte bu gibi durumlarda, istemci uygulamaların meydana gelecek olan değişikliklerden anında haberdar olmasını isteyebiliriz. Bu durum &amp;ouml;zellikle, bağlantısız katman nesnelerinin kullanıldığı uygulamalarda b&amp;uuml;y&amp;uuml;k &amp;ouml;nem kazanmaktadır. Peki bu anında haber bildirilmesini nasıl sağlayabiliriz? Bunun i&amp;ccedil;in kullanılan mimari kabaca aşağıdaki şekilde olduğu gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk105_1.gif" alt="" width="611" height="383" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. Mimari.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Dilerseniz kısaca mimarinin işleyişinden ve bileşenlerinden bahsedelim. SqlDependency sınıfı, bir SqlCommand ile ilişkilendirilerek kullanılır ve i&amp;ccedil;sel olarak bir SqlNotificationRequest nesnesinide barındırır. (Bu sınıfi ilerleyen makalelerimizde incelemeye &amp;ccedil;alışacağız.) SqlCommand sınıfının Notification işlemine uyan bir Select sorgusu i&amp;ccedil;ermesi gerekir. &amp;Ouml;yleki bu Select sorgusu şu anki versiyonlar itibariyle aşağıdaki gibi olamaz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Select * From Tablo&lt;/pre&gt;
&lt;p&gt;Select sorgusunda talep edilen alan isimleri a&amp;ccedil;ık&amp;ccedil;a belirtilmelidir. Bununla birlikte, Tablo' nun sahibide yani yaratıcısıda a&amp;ccedil;ık&amp;ccedil;a belirtilmelidir. Yani ancak aşağıdaki gibi bir sql ifadesi Notification desteğini sağlayabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Select Ad,Soyad From dbo.Tablo&lt;/pre&gt;
&lt;p&gt;Belirtilen Sql ifadesi &amp;ccedil;alıştırıldığında, SqlDependency nesnesi ilgili SqlCommand nesnesi i&amp;ccedil;in sunucuda bir Notification a&amp;ccedil;ılacağını sql sunucusuna bildirir. Sql sunucusu bu mesaj &amp;uuml;zerine ilgili sql komutunu &amp;ccedil;alıştırır ve Notification nesnesini sunucuya register eder. Bu bize, &amp;ccedil;alıştırılan sql sorgusunun sunucaya ekstradan bir takım bilgiler daha g&amp;ouml;nderdiğini g&amp;ouml;stermektedir. Bu bilgiler &amp;ccedil;oğunlukla, kaydı tutulacak Notification ile ilgilidir ve SqlDependency sınıfının ilgili yapıcı metodları yardımıyla ayarlanabilir.&lt;/p&gt;
&lt;p&gt;Notification nesnesi, sunucuya kayıt edildikten sonra, komutun &amp;ccedil;alışması ile elde edilen sonu&amp;ccedil;lar &amp;ouml;n belleğe alınır ve ilgili Notification nesneside Server Service Broker Queue tarafından kuyruğa atılır. Buradaki &amp;ouml;n bellekleme işlemi aslında bir temp tablosunun oluşturulmasından başka bir şey değildir. Bu noktadan itibaren Sql sunucusu, ilgili satır k&amp;uuml;mesini izlemeye başlar. Eğer satır k&amp;uuml;mesi &amp;uuml;zerinde yukarıda bahsettiğimiz durumlardan birisi nedeni ile değişiklikler olursa, sp_DispatcherProc sistem prosed&amp;uuml;r&amp;uuml; yardımıyla istemci uygulamanın SqlDependency sınıfına ait olan OnChange olayına bilgi mesajı gider.&lt;/p&gt;
&lt;p&gt;Mimari her ne kadar karışık gibi g&amp;ouml;r&amp;uuml;nsede, uygulanabilirliği son derece kolay ve basittir. Bu ama&amp;ccedil;la olayı daha iyi irdeleyebilmek i&amp;ccedil;in aşağıdaki Windows uygulamasını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk105_2.gif" alt="" width="561" height="291" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. Windows Uygulamamız&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;#region Using directives

using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Windows.Forms;
using System.Data.SqlClient;

#endregion

namespace NotifySample
{
    partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }
        SqlConnection con;
        SqlCommand cmd;
        SqlDependency dep;
        SqlDataAdapter da;
        DataTable dt;

        private void btnVeriCek_Click(object sender, EventArgs e)
        {
            con = new SqlConnection("data source=localhost;initial catalog=Dukkan;integrated security=SSPI");
            con.Open();
            cmd = new SqlCommand("Select DetayID,PersonelID,Ad,Soyad,Mail From dbo.PersonelDetay", con);
            dep = new SqlDependency(cmd);
               SqlDependency.Start("data source=localhost;initial catalog=Dukkan;integrated security=SSPI");
            dep.OnChange+=new OnChangeEventHandler(dep_OnChange);
            da = new SqlDataAdapter(cmd);
            dt = new DataTable();
            da.Fill(dt);
            dgVeriler.DataSource = dt;
        }

        void dep_OnChange(object sender, SqlNotificationEventArgs e)
        {
            MessageBox.Show("YENI VERILER EKLENDI...TAZELEME YAPIN");
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamamız, Yukon &amp;uuml;zerinde Dukkan isimle veritabanında yer alan PersonelDetay isimli tabloya ait verileri kullanmaktadır. Kullanıcı Veri &amp;Ccedil;ek başlıklı butona bastığında ilgili tabloya ait t&amp;uuml;m satırlar DataGridView kontrol&amp;uuml;ne y&amp;uuml;klenmektedir. Şimdi gelelim, burada &amp;ouml;nemli olan kod satırlarına. Dikkat ederseniz, SqlDependency sınıfına ait nesne &amp;ouml;rneğimizi aşağıdaki kod satırı ile oluşturuyoruz. B&amp;ouml;ylece ilgili komut i&amp;ccedil;in Notification servisinin kullanılacağını belirtmiş oluyoruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;dep = new SqlDependency(cmd);&lt;/pre&gt;
&lt;p&gt;Bu arada Select sorgumuzun kurallara uygun bir yapıda olduğuna dikkat edelim. Yani, alan adlarını ve tablonun sahibini a&amp;ccedil;ık&amp;ccedil;a belirtiyoruz. Daha sonra ise, SqlDependency sınıfımıza OnChange olayını aşağıdaki kod satırı ile ekliyoruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;dep.OnChange+=new OnChangeEventHandler(dep_OnChange);&lt;/pre&gt;
&lt;p&gt;Bu olayın bizim i&amp;ccedil;in b&amp;uuml;y&amp;uuml;k bir &amp;ouml;nemi var. Nitekim, sunucu &amp;uuml;zerinde &amp;ouml;n belleklenen veri k&amp;uuml;mesinde değişiklikler olduğunda, sql sunucusu tarafından uygulmaya bir Notification mesajı g&amp;ouml;nderilecektir. İşte bu mesajın ele alınacağı olay SqlDependency sınıfına ait OnChange' dır. Bu olayın prototipi aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public event OnChangeEventHandler OnChange;&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi bu olay OnChangeEventHandler temsilcisinin tanımladığı metodları &amp;ccedil;alıştırabilir. OnChangeEventHandler temsilcisinin prototipi ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public sealed delegate void OnChangeEventHandler( object sender, SqlNotificationEventArgs e );&lt;/pre&gt;
&lt;p&gt;Bu temsilcinin işaret edeceği metodlara ait ikinci parametre SqlNotificationEventArgs sınıfı tipinden olup olduk&amp;ccedil;a &amp;ouml;nemlidir. Nitekim bu parametre yardımıyla, gelen bildirinin hangi olaya istinaden oluştuğunu ayırt edebilir ve işlemlerimize y&amp;ouml;n verebiliriz. Bu sınıfıda detaylı bir şekilde ilerleyen makalelerimizde inceleyeceğiz. Olay metodumuzda ise basit olarak herhangibir Notification mesajı alındığında bir MessageBox' ın &amp;ccedil;ıkmasını sağlıyoruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;void dep_OnChange(object sender, SqlNotificationEventArgs e)
{
     MessageBox.Show("YENI VERILER EKLENDI...TAZELEME YAPIN");
} &lt;/pre&gt;
&lt;p&gt;Şimdi uygulamamızı &amp;ccedil;alıştıralım ve verileri &amp;ccedil;ekelim. Yazdığımız kodlar gereği, Sql suncusu &amp;uuml;zerinde Select sorgumuza istinaden bir Notification nesnesi register edilecektir. Şimdi biz bu noktada doğrudan Yukon &amp;uuml;zerinden yeni bir satır gireceğiz. (Aslında aynı uygulamanın başka bir &amp;ouml;rneğinden veya başka bir uygulamadanda bu tablo &amp;uuml;zerinde değişiklikler yapabiliriz) Bunu uygulamamız &amp;ccedil;alışıyorken yapacağız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk105_3.gif" alt="" width="453" height="206" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. Yukon &amp;uuml;zerinden tablomuza yeni bir satır ekliyoruz.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemi ger&amp;ccedil;ekleştirdiğimiz anda, uygulamamıza bir bildiri mesajı iletilir ve tabloda değişiklik olduğu s&amp;ouml;ylenir. Bunun sonucu olarakta, SqlDependency nesnemiz ile ilişkilendirdiğimiz OnChange olayı aktif hale gelecektir. Sonu&amp;ccedil; aşağıdaki gibi olacaktır. Yeni satır eklenir eklenmez uygulama OnChange olayını &amp;ccedil;alıştıracaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk105_4.gif" alt="" width="549" height="397" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. Notification mesajı uygulamaya g&amp;ouml;nderildi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Dolayısıyla biz, veri &amp;ccedil;ekme işlemimizi bu olay i&amp;ccedil;erisine alarak istemci uygulamanın daima g&amp;uuml;ncel veriler ile konuşmasını sağlayabiliriz. SqlDependency sınıfının pek &amp;ccedil;ok &amp;uuml;yesi ve &amp;ouml;nemli &amp;ouml;zelliği vardır. Bir sonraki makalemizde, bu sınıfı daha detaylı bir şekilde incelemeye &amp;ccedil;alışırken, ger&amp;ccedil;ekleşen değişikliğin tipine g&amp;ouml;re nasıl hareket edebileceğimizide g&amp;ouml;receğiz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek sağlıcakla kalın.&lt;/p&gt;</content>
  <pubDate>2004-10-25 21:00:00</pubDate>
  <slug>Ado-Net-2-0-ve-SqlDependency-Sc4b1nc4b1fc4b1-Yardc4b1mc4b1yla-Query-Notification-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet-20</tag>
    <tag>sql-cache-dependency</tag>
  </tags>
  <categories>
    <category>Ado.net 2.0</category>
  </categories>
</post>