<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Daha iyi Kodlama için Basit Öneriler</title>
  <description>Aslında daha okunaklı, daha efektif ve zaman zaman daha verimli kod üretmek için bir kaç küçük noktaya dikkat etmekte yarar olabilir. Bu sayede sanıyorum ki kodlarımız en azından daha şık duracaktır Wink Gelin bu bir kaç küçük püf noktadan bir kaçına hep birlikte bakalım.</description>
  <content>&lt;p&gt;&lt;a href="/pics/blg225_Giris.jpg"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border-width: 0px;" title="blg225_Giris" src="/pics/blg225_Giris_thumb.jpg" alt="blg225_Giris" width="302" height="220" align="right" border="0" /&gt;&lt;/a&gt; Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bilenler bilir, uzun s&amp;uuml;redir &lt;strong&gt;.Net Framework 2.0 &lt;/strong&gt;&amp;uuml;zerinde yazılmış ve &lt;strong&gt;Visual Studio 2005 &lt;/strong&gt;ortamında geliştirilmeye devam edilen bir bankacılık uygulamasında g&amp;ouml;revliyim. Buradaki işim m&amp;uuml;şterinin yeni isteklerini sisteme katmak/katmaya &amp;ccedil;alışmak olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında bu yeni g&amp;ouml;revime atanırken &lt;strong&gt;Visual Studio 2010 &lt;/strong&gt;ile uğraştığımı hatırlıyorum da&amp;hellip;Kendimi&lt;strong&gt; Ice Age&lt;/strong&gt; filmindeki buz &amp;ccedil;ağı devrine d&amp;ouml;nm&amp;uuml;ş canlı bir yaşam formu gibi zannetmiştim &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Geliştirilmiş olan &amp;uuml;r&amp;uuml;ne ait proje kodları biraz eski tarihli olduğundan ilk zamanalarda i&amp;ccedil;inde kaybolduğumu belirtebilirim. G&amp;uuml;nlerce &lt;strong&gt;Debug&lt;/strong&gt; yapıp s&amp;uuml;re&amp;ccedil;lerin nasıl işlediğini anlamaya &amp;ccedil;alıştım. (E haliyle koda &lt;strong&gt;d&amp;ouml;k&amp;uuml;mantasyon&lt;/strong&gt; yazmassanız, &lt;strong&gt;XML Comment&amp;rsquo;&lt;/strong&gt; ler koymassanız, proje geliştirilmekteyken &lt;strong&gt;s&amp;uuml;rekli eleman sirk&amp;uuml;lasyonuna &lt;/strong&gt;izin verir ve herkesin g&amp;uuml;n&amp;uuml; kurtarmak adına kodlama yapmasına davetiye &amp;ccedil;ıkartırsanız, &lt;strong&gt;analiz d&amp;ouml;k&amp;uuml;manlarını &lt;/strong&gt;saklamaz veya g&amp;uuml;ncellemesseniz olacağı da budur &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt; )&lt;/p&gt;
&lt;p&gt;Aslında daha okunaklı, daha efektif ve zaman zaman daha verimli kod &amp;uuml;retmek i&amp;ccedil;in bir ka&amp;ccedil; k&amp;uuml;&amp;ccedil;&amp;uuml;k noktaya dikkat etmekte yarar olabilir. Bu sayede sanıyorum ki kodlarımız en azından daha şık duracaktır &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Gelin bu bir ka&amp;ccedil; k&amp;uuml;&amp;ccedil;&amp;uuml;k p&amp;uuml;f noktadan bir ka&amp;ccedil;ına hep birlikte bakalım.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;1 &amp;ndash; Auto Property&amp;rsquo; ler ve Private Block&amp;rsquo; lar&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;İlk olarak &amp;ouml;zellikle &lt;strong&gt;POCO(Plain Old CLR Objects) &lt;/strong&gt;gibi tip tanımlamalarında yaygın olarak kullandığımız ve &amp;ouml;zellikle &lt;strong&gt;LINQ(Language Integrated Query) &lt;/strong&gt;tarafında da &amp;ccedil;ok işimize yarayan &lt;strong&gt;Auto Property &lt;/strong&gt;kavramına bir bakalım. Bazı durumlarda &amp;ouml;zelliklerin &lt;strong&gt;sadece okunabilir(Read Only)&lt;/strong&gt; ya da &lt;strong&gt;yazılabilir (Write Only) &lt;/strong&gt;olmalarını isteyebiliriz. &lt;strong&gt;Auto Property&lt;/strong&gt; kullanmadığımız durumlarda &lt;strong&gt;get&lt;/strong&gt; veya &lt;strong&gt;set&lt;/strong&gt; bloklarını yazmayarak bu kolayca sağlanabilir. Ancak &lt;strong&gt;Auto Property&lt;/strong&gt;&amp;rsquo; lerde &lt;strong&gt;get &lt;/strong&gt;veya &lt;strong&gt;set &lt;/strong&gt;bloklarının her ikisinin de yazılması zorunludur. Buna rağmen normal &lt;strong&gt;Property&lt;/strong&gt; yazımındaki felsefe ile hareket ettiğimizde derleme zamanında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan hata mesajı ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg225_AutoPropertyError.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg225_AutoPropertyError" src="/pics/blg225_AutoPropertyError_thumb.gif" alt="blg225_AutoPropertyError" width="324" height="430" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere sadece &lt;strong&gt;get&lt;/strong&gt; veya sadece &lt;strong&gt;set&lt;/strong&gt; bloğu yazarak &lt;strong&gt;readonly&lt;/strong&gt; veya &lt;strong&gt;writeonly&lt;/strong&gt; &amp;ouml;zellik &lt;span style="text-decoration: underline;"&gt;tanımlanamaz&lt;/span&gt;. Ancak &lt;strong&gt;private&lt;/strong&gt; gibi bir&lt;strong&gt; erişim belirleyicisini(Access Modifier)&lt;/strong&gt; devreye alırsak amacımıza ulaşabiliriz. İşte &amp;ouml;rnek bir kod par&amp;ccedil;ası.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace OldTimes 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        {

            #region Auto Property ve Private get,set

            Person prd = new Person 
            { 
                 PersonId=10, 
                  Name="Burak", 
                   Birth=new DateTime(1976,12,4) 
            }; 
            Console.WriteLine(prd.Birth);

            #endregion

        }

    }

    #region Auto Property

    class Person 
    { 
        public int PersonId { get; private set; } 
        public string Name { get; set; } 
        public DateTime Birth { private get; set; } 
    }

    #endregion    
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;PersonId&lt;/strong&gt; ve &lt;strong&gt;Birth&lt;/strong&gt; &amp;ouml;zelliklerinde &lt;strong&gt;get&lt;/strong&gt; ve &lt;strong&gt;set&lt;/strong&gt; bloklarının başında &lt;strong&gt;private&lt;/strong&gt; bildirimi yapılmıştır. Bu durumda &lt;strong&gt;PersonId&lt;/strong&gt; sadece okunabilir, &lt;strong&gt;Birth&lt;/strong&gt; ise sadece yazılabilir &amp;ouml;zellikler olarak değerlendirilmektedir. Hatta kodun bu halini derlediğimizde aşağıdaki hata mesajlarını aldığımızı g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg225_AutoProperty.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg225_AutoProperty" src="/pics/blg225_AutoProperty_thumb.gif" alt="blg225_AutoProperty" width="319" height="381" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Peki &amp;uuml;retilen &lt;strong&gt;IL(Intermediate Language)&lt;/strong&gt; &amp;ccedil;ıktısına baktığımızda &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Bu durumda aşağıdaki sonu&amp;ccedil;lar ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg225_AutoPropertyIL.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg225_AutoPropertyIL" src="/pics/blg225_AutoPropertyIL_thumb.gif" alt="blg225_AutoPropertyIL" width="475" height="709" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edilmesi gereken nokta &lt;strong&gt;private&lt;/strong&gt; olarak işaretlenmiş &lt;strong&gt;get&lt;/strong&gt; ve &lt;strong&gt;set&lt;/strong&gt; metodlarının varlığıdır. &amp;Uuml;stelik bu metodların i&amp;ccedil;erisinde iş yapan kod par&amp;ccedil;aları da mevcuttur. Ancak bu ip ucunda dikkat edilmesi gereken bir husus daha vardır. Bu farkı g&amp;ouml;rmek i&amp;ccedil;in eski stilde &lt;strong&gt;ReadOnly&lt;/strong&gt; bir &amp;ouml;zelliğin nasıl tanımlandığına bakalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace OldTimes 
{ 
    class Product 
    { 
        private int _productId=0;

        public int ProductId 
        { 
            get { return _productId; } 
        } 
    } 
...&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Product&lt;/strong&gt; tipi i&amp;ccedil;erisinde yer alan &lt;strong&gt;ProductId&lt;/strong&gt; &amp;ouml;zelliği &lt;strong&gt;Readonly&lt;/strong&gt; olarak tanımlanmıştır. Nitekim bir &lt;strong&gt;set&lt;/strong&gt; bloğu yoktur. Bunun doğal olarak &lt;strong&gt;IL&lt;/strong&gt; &amp;ccedil;ıktısı ise aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg225_Readonly.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg225_Readonly" src="/pics/blg225_Readonly_thumb.gif" alt="blg225_Readonly" width="243" height="101" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Farkı g&amp;ouml;rebildiniz mi? &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Dikkat edileceği &amp;uuml;zere &lt;strong&gt;set_ProductId&lt;/strong&gt; isimli bir metod &lt;strong&gt;IL&lt;/strong&gt; &amp;uuml;retimi i&amp;ccedil;erisine dahil &lt;span style="text-decoration: underline;"&gt;edilmemiştir&lt;/span&gt;. Belki de &lt;strong&gt;auto property&amp;rsquo;&lt;/strong&gt; lerin en sevmediğim yanı budur. Keşke sadece &lt;strong&gt;get&lt;/strong&gt; veya sadece &lt;strong&gt;set&lt;/strong&gt; tanımlamasına izin verilseymiş.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;2 - ?? Operat&amp;ouml;r&amp;uuml;&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Zannedersem,&lt;strong&gt; C#&lt;/strong&gt; dili i&amp;ccedil;erisinde atalarından gelen &lt;strong&gt;ternary&lt;/strong&gt; &lt;strong&gt;operat&amp;ouml;r&amp;uuml;n&amp;uuml;( ?: ) &lt;/strong&gt;bilmeyen, hatta kullanmayan yoktur. Tamam tamam kabul ediyorum. &amp;Ccedil;oğu durumda &lt;strong&gt;if&amp;hellip;else&amp;hellip; &lt;/strong&gt;bloklarını kullanmayı tercih etmekteyiz. Ancak &lt;strong&gt;?: operat&amp;ouml;r&amp;uuml; &lt;/strong&gt;kadar ilgin&amp;ccedil; olan ve genellikle pek kullanmadığımız bir operat&amp;ouml;r&amp;uuml;m&amp;uuml;z daha vardır. &lt;strong&gt;Null kontrol operat&amp;ouml;r&amp;uuml;( ?? )&lt;/strong&gt;. İlk olarak aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alarak işe başlayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace OldTimes 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            #region ?? Operator

            IPv4 incomingIp=null; 
            SendPacket(incomingIp); 
            #endregion 
        }

        #region ?? Operator

        static void SendPacket(IPv4 targetAddress) 
        { 
            IPv4 ip=null; 
            if (targetAddress == null) 
            { 
                ip = new IPv4 { Block1 = 127, Block2 = 0, Block3 = 0, Block4 = 1 }; 
            } 
            Console.WriteLine("{0} adresine g&amp;ouml;nderim yapılıyor",ip.ToString()); 
        }

        #endregion 
    }

    #region ?? Operator 
    class IPv4 
    { 
        public byte Block1 { get; set; } 
        public byte Block2 { get; set; } 
        public byte Block3 { get; set; } 
        public byte Block4 { get; set; }

        public override string ToString() 
        { 
            return String.Format("{0}.{1}.{2}.{3}", Block1, Block2, Block3, Block4); 
        } 
    } 
    #endregion 
}&lt;/pre&gt;
&lt;p&gt;&amp;Ccedil;oğu zaman bazı referans &amp;ouml;rneklerinin &lt;strong&gt;null&lt;/strong&gt; değere sahip olup olmadıklarını denetlememiz gerekir. Yukarıdaki &amp;ouml;rnek kod par&amp;ccedil;asında bu durum analiz edilmeye &amp;ccedil;alışılmaktadır. &lt;strong&gt;SendPacket &lt;/strong&gt;isimli &lt;strong&gt;static &lt;/strong&gt;metod &lt;strong&gt;IPv4 &lt;/strong&gt;isimli sınıfa ait bir nesne &amp;ouml;rneğini parametre olarak alır. Metod i&amp;ccedil;erisinde &amp;ouml;ncelikli olarak bir &lt;strong&gt;null &lt;/strong&gt;kontrol&amp;uuml; yapılır. Bunun i&amp;ccedil;in de standart ve yaygın yol &lt;strong&gt;if&amp;hellip;else &lt;/strong&gt;blokları kullanılmıştır. Aslında metod i&amp;ccedil;erisinde &lt;strong&gt;ternary&lt;/strong&gt; operat&amp;ouml;r&amp;uuml; kullanılaraktan da aynı işlem yapılabilir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ip = targetAddress == null ? new IP { Line1 = 127, Line2 = 0, Line3 = 0, Line4 = 1 } : targetAddress;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;?&lt;/strong&gt; işaretinden &amp;ouml;nce &lt;strong&gt;targetAddress &lt;/strong&gt;değişkeninin &lt;strong&gt;null &lt;/strong&gt;olup olmadığına bakılmaktadır. &lt;strong&gt;? &lt;/strong&gt;ile &lt;strong&gt;: &lt;/strong&gt;işaretleri arasındaki kısım koşulun &lt;strong&gt;true &lt;/strong&gt;olması halini ele alırken, &lt;strong&gt;: &lt;/strong&gt;işaretinden sonraki kısım &lt;strong&gt;false &lt;/strong&gt;olma durumunu değerlendirmektedir. Aslında burada &lt;strong&gt;null &lt;/strong&gt;kontrol&amp;uuml; yapıldığından &lt;strong&gt;?? &lt;/strong&gt;operat&amp;ouml;r&amp;uuml; de ele alınabilir. Aşağıdaki gibi &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ip = targetAddress ?? new IP { Line1 = 127, Line2 = 0, Line3 = 0, Line4 = 1 };&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Daha yalın daha okunaklı olduğunu ifade edebilir miyiz? Bu sorunun cevabı duruma g&amp;ouml;re değişir. Ancak en azından şirketinizin bir kod standardı var ise, bu tip &lt;strong&gt;null&lt;/strong&gt; kontrollerinde nasıl bir yol izlenilmesi gerektiği ve hangi operat&amp;ouml;rlerin kullanılması gerektiği a&amp;ccedil;ıktır. S&amp;ouml;z gelimi daha &amp;ouml;nceden &amp;ccedil;alıştığım şirketlerin birisinde&lt;strong&gt; ?:&lt;/strong&gt; operat&amp;ouml;r&amp;uuml;n&amp;uuml;n kullanımı yasaklanmıştır. (Sebebini hi&amp;ccedil; sormayın ama sonu&amp;ccedil; itibariyle bir standart vardı en azından &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; )&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;3 &amp;ndash; As operat&amp;ouml;r&amp;uuml;&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Hazır &lt;strong&gt;??&lt;/strong&gt; operat&amp;ouml;r&amp;uuml;ne değinmişken &lt;strong&gt;as &lt;/strong&gt;operat&amp;ouml;r&amp;uuml;n&amp;uuml; de es ge&amp;ccedil;memek taraftarıyım. Yine projelerimizde pek &amp;ccedil;ok nokta da bir referans &amp;ouml;rneğinin &lt;strong&gt;null &lt;/strong&gt;&lt;span style="text-decoration: underline;"&gt;olmaması&lt;/span&gt; halinde d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi yapılarak ilerlenilmesi s&amp;ouml;z konusudur. Aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alarak 3nc&amp;uuml; maddemizi kavramaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace OldTimes 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            #region AS Operator

            DrawShape(new Rectangle(), 10, 5); 
            DrawShape(new Circle(), 3, 6);

            #endregion 
        }

        #region AS Operator 

        static void DrawShape(Shape shape,int x,int y) 
        { 
            Rectangle rect = null; 
            Circle crcl = null;

            if (shape is Rectangle) 
            { 
                rect = (Rectangle)shape; 
                rect.Draw(x, y); 
            } 
            else if (shape is Circle) 
            { 
                crcl = (Circle)shape; 
                crcl.Draw(x, y); 
            }  
        } 

        #endregion        
    }

    #region AS Operator

    public class Shape 
    { 
    }

    public class Circle 
        : Shape 
    { 
        public void Draw(int x, int y) 
        { 
            Console.WriteLine("{0}:{1} koordinatına Daire",x,y); 
        } 
    }

    public class Rectangle 
        : Shape 
    { 
        public void Draw(int x, int y) 
        { 
            Console.WriteLine("{0}:{1} koordinatına d&amp;ouml;rtgen", x, y); 
        } 
    }

    #endregion  
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnek kod i&amp;ccedil;erisinde yer alan &lt;strong&gt;DrawShape&lt;/strong&gt; metodu parametre olarak &lt;strong&gt;Shape &lt;/strong&gt;sınıfında bir &amp;ouml;rnek almakadır. İ&amp;ccedil;eride ise gelen &amp;ouml;rneğin &lt;strong&gt;Rectangle&lt;/strong&gt; veya &lt;strong&gt;Circle &lt;/strong&gt;olup olmadığına bakılarak bir d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi ger&amp;ccedil;ekleştirilmekte ve sembolik bir &amp;ccedil;izim işlemi y&amp;uuml;r&amp;uuml;t&amp;uuml;lmektedir. Ancak dikkat edilmesi gereken nokta &amp;ouml;nce &lt;strong&gt;is &lt;/strong&gt;operat&amp;ouml;r&amp;uuml; ile bir tip kontrol&amp;uuml; yapılması sonrasında ise eğer tip beklenen tip ise bilin&amp;ccedil;li bir tip d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi yapılmasıdır. Bir başka deyişle &lt;strong&gt;is &lt;/strong&gt;operat&amp;ouml;r&amp;uuml; de kontrol i&amp;ccedil;in bir d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi ele almakta ve bu da gereksiz yere iki tip d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml;ne neden olmaktadır. Aslında bu kod yerine aşağıdaki teknikte uygulanabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Rectangle rect = shape as Rectangle; 
Circle crcl = shape as Circle;

if (rect != null) 
    rect.Draw(x,y); 
else if (crcl != null) 
    crcl.Draw(x,y);&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;as&lt;/strong&gt; operat&amp;ouml;r&amp;uuml; sağ tarafındaki değişkeni sol tarafındaki tipe d&amp;ouml;n&amp;uuml;şt&amp;uuml;rmeye &amp;ccedil;alışır ve bunda başarılı olamassa geriye &lt;strong&gt;null &lt;/strong&gt;değer d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Dolayısıyla tek bir kontrol ve koşul doğru ise d&amp;ouml;n&amp;uuml;şt&amp;uuml;rerek atama işlemi ger&amp;ccedil;ekleştirilmektedir. Sonrasında ise tek yapılması gereken &lt;strong&gt;null&lt;/strong&gt; kontrol&amp;uuml;n&amp;uuml; ger&amp;ccedil;ekleştirmek ve buna g&amp;ouml;re ilgili operasyonu devreye almaktır.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;4 &amp;ndash; Timespan Yardımcı Metodları&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Aslında &lt;strong&gt;.Net Framework &lt;/strong&gt;i&amp;ccedil;erisinde yer alan tipleri iyi bir şekilde &amp;ouml;ğrenmek ve bilmekte her zaman i&amp;ccedil;in yarar vardır. Hi&amp;ccedil; ummadığımız yerlerde işimize yarayacak fonksiyonellikler bulabiliriz. &amp;Ouml;rneğin bunlardan birisi zaman farkı belirtilmesi gereken yerlerde kullanılması &amp;ouml;nerilen &lt;strong&gt;TimeSpan &lt;/strong&gt;tipidir. Ne demek istediğimi biraz daha net anlayabilmek i&amp;ccedil;in gelin aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Threading;

namespace OldTimes 
{ 
    class Program 
    {        
        static void Main(string[] args) 
        { 
            #region Timespan

            double r1=Calculate(1, 100, 10); 
            Console.WriteLine(r1);

            #endregion 
        }

        #region

        static double Calculate(int x,int y,int duration) 
        { 
            double result=0;

            for (int i = x; i &amp;lt; y; i++) 
            { 
                result+=i; 
                Thread.Sleep(duration); 
            } 
            return result; 
        }

        #endregion 
    }  
}&lt;/pre&gt;
&lt;p&gt;Calculate metodu sembolik olarak belirli aralıkta sayıların toplamını hesap etmek &amp;uuml;zere &amp;ccedil;alışmakta olan bir metoddur. Metodun &lt;strong&gt;for&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; i&amp;ccedil;erisinde ise belirli s&amp;uuml;reliğine &amp;ccedil;alışmakta olan &lt;strong&gt;Thread&lt;/strong&gt;&amp;rsquo; in &lt;strong&gt;Sleep &lt;/strong&gt;metodu yardımıyla uyutulması sağlanmaktadır. Aslında bu s&amp;uuml;renin &lt;strong&gt;milisaniye&lt;/strong&gt; cinsinden olduğunu hepimiz biliyoruz. Yine de zaman zaman unuttuğumuz anlar olabiliyor ve milisaniye miydi yoksa saniye miydi diyebiliyoruz? Dolayısıyla geliştiricinin var ise ve eğer yazılmışsa &lt;strong&gt;XML Comment&lt;/strong&gt;&amp;rsquo; ine bakmasın gerekiyor. Gelin bu işi &lt;strong&gt;Developer&lt;/strong&gt;&amp;rsquo; ın insiyatifinden &amp;ccedil;ıkartalım. İşte &lt;strong&gt;TimeSpan&lt;/strong&gt; kullanımı&amp;hellip;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Threading;

namespace OldTimes 
{ 
    class Program 
    {        
        static void Main(string[] args) 
        { 
            #region Timespan

            double r1=Calculate(1, 5, TimeSpan.FromSeconds(1)); // o andan itibaren 1er saniye aralıklarla 
            Console.WriteLine(r1); 
            double r2=Calculate(1, 5, new TimeSpan(0, 0, 2)); // 0 saat 0 dakika 2 saniye aralıkla 
            Console.WriteLine(r2); 
            double r3 = Calculate(1, 5, TimeSpan.FromMilliseconds(50)); // o andan itibaren 50şer milisaniye aralıklarla 
            Console.WriteLine(r3); 
            double r4 = Calculate(1, 5, new TimeSpan(0, 0, 0, 0, 250)); // 0 g&amp;uuml;n 0 saat 0 dakika 0 saniye 250 milisaniye aralıkla

            #endregion 
        }

        #region

        static double Calculate(int x,int y,TimeSpan duration) 
        { 
            double result=0;

            for (int i = x; i &amp;lt; y; i++) 
            { 
                result+=i; 
                Thread.Sleep(duration); 
            } 
            return result; 
        }

        #endregion 
    }  
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Calculate&lt;/strong&gt; metodunun son parametresi &lt;strong&gt;TimeSpan&lt;/strong&gt; tipi ile değiştirilmiştir. Buna g&amp;ouml;re &lt;strong&gt;Thread.Sleep &lt;/strong&gt;metoduna parametre olarak nekadarlık bir s&amp;uuml;re ge&amp;ccedil;irileceğini belirlemek &amp;ccedil;ok daha kolaydır. &amp;Ouml;rnek kullanımlarda bu ama&amp;ccedil;la &lt;strong&gt;TimeSpan &lt;/strong&gt;tipinin&lt;strong&gt; static &lt;/strong&gt;ve &lt;strong&gt;aşırı y&amp;uuml;klenmiş yapıcı metodlarından(Overloaded Constructors) &lt;/strong&gt;yararlanılmaktadır. Buna g&amp;ouml;re&lt;strong&gt; 1 saniye, 2 saniye, 50 milisaniye&lt;/strong&gt; ve &lt;strong&gt;250 milisaniye &lt;/strong&gt;aralıklarla işlemler yaptırılmaktadır. Hatta dilerseniz aralığı g&amp;uuml;n bazında bile belirtebilirsiniz &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;5 &amp;ndash; Stopwatch Sınıfı&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Hazır yukarıdaki kod par&amp;ccedil;asına değinmişken&amp;hellip;Ger&amp;ccedil;ektende belirtilen s&amp;uuml;relere g&amp;ouml;re işlemlerin yapıldığını nasıl &amp;ouml;l&amp;ccedil;ebiliriz hi&amp;ccedil; d&amp;uuml;ş&amp;uuml;nd&amp;uuml;n&amp;uuml;z m&amp;uuml;? &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Yani 1&amp;rsquo; den 5&amp;rsquo; e kadar olan sayıların toplamında her bir iterasyonda 2 saniye duraksama olursa tahminlerimize g&amp;ouml;re 8 saniye kadar bir toplam s&amp;uuml;re s&amp;ouml;z konusu olmalıdır &amp;ouml;yle değil mi? Hatta bu 8 saniye de 8000 milisaniye olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Bunu &amp;ouml;l&amp;ccedil;mek i&amp;ccedil;in &lt;strong&gt;Calculate &lt;/strong&gt;metodunun i&amp;ccedil;erisinde aşağıdaki d&amp;uuml;zenlemeleri yaptığımızı d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static double Calculate(int x,int y,TimeSpan duration) 
{ 
    DateTime startTime = DateTime.Now; 
    double result=0;

    for (int i = x; i &amp;lt; y; i++) 
    { 
        result+=i; 
        Thread.Sleep(duration); 
    } 
    DateTime endTime = DateTime.Now; 
    TimeSpan distance = endTime - startTime; 
    Console.WriteLine("İşlem s&amp;uuml;resi {0} milisaniyedir",distance.TotalMilliseconds); 
    return result; 
}&lt;/pre&gt;
&lt;p&gt;İşte sonu&amp;ccedil;lar;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg225_Runtime1.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg225_Runtime1" src="/pics/blg225_Runtime1_thumb.gif" alt="blg225_Runtime1" width="308" height="135" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;DateTime&lt;/strong&gt; tipine ait iki nesne &amp;ouml;rneğinden yararlanılmış ve aradaki farka bakılarak işlemin ne kadar zaman aldığı hesap edilmiştir. Peki daha şık bir kodlama s&amp;ouml;z konusu olabilir mi? Evet olur &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static double Calculate(int x,int y,TimeSpan duration) 
{ 
    Stopwatch watcher = Stopwatch.StartNew(); 
    double result=0;

    for (int i = x; i &amp;lt; y; i++) 
    { 
        result+=i; 
        Thread.Sleep(duration); 
    } 
    watcher.Stop(); 
    Console.WriteLine("İşlem s&amp;uuml;resi {0} milisaniyedir",watcher.ElapsedMilliseconds); 
    return result; 
}&lt;/pre&gt;
&lt;p&gt;Bu kez başlangı&amp;ccedil; noktasında &lt;strong&gt;static StartNew&lt;/strong&gt; metodu ile bir &lt;strong&gt;StopWatch &lt;/strong&gt;nesnesi &amp;ouml;rneklenmiştir. Bu nesne &amp;ouml;rneği devam eden kod satırları boyunca bir kronometre g&amp;ouml;revini &amp;uuml;stlenmektedir. İşlemler tamamlandığında ortaya &amp;ccedil;ıkan s&amp;uuml;re farkını hesap etmek i&amp;ccedil;in &lt;strong&gt;Stop &lt;/strong&gt;metodu kullanılmaktadır. &lt;strong&gt;Stop &lt;/strong&gt;metoduna yapılan &amp;ccedil;ağrı sonrasında ise &lt;strong&gt;watcher &lt;/strong&gt;nesne &amp;ouml;rneğinin &lt;strong&gt;Elapsed &lt;/strong&gt;&amp;ouml;n ekli &amp;ouml;zelliklerinden yararlanılarak ilgili s&amp;uuml;re farklarına ulaşılmaktadır.&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere başlangı&amp;ccedil; ve bitiş zamanlarını tespit etmek i&amp;ccedil;in iki farklı &lt;strong&gt;DateTime&lt;/strong&gt; değişkeni tanımlamak yerine, zaten bu tip kronometre işlemleri i&amp;ccedil;in tasarlanmış &lt;strong&gt;StopWatch &lt;/strong&gt;tipini kullanmak kodun anlamsal b&amp;uuml;t&amp;uuml;nl&amp;uuml;ğ&amp;uuml; a&amp;ccedil;ısından daha verimli g&amp;ouml;r&amp;uuml;lmektedir. Hatta &amp;ccedil;alışma zamanı sonu&amp;ccedil;larına baktığımızda &lt;strong&gt;StopWatch&lt;/strong&gt; tipinin aslında daha tutarlı değerler d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml; de g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg225_Runtime2.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg225_Runtime2" src="/pics/blg225_Runtime2_thumb.gif" alt="blg225_Runtime2" width="285" height="144" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Anlattıklarımızdan yola &amp;ccedil;ıkacak olursak eğer şu tip sonu&amp;ccedil;lara da varabiliriz;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Kodlama yaparken şirketimizin belirlediği standartlar var ise bunlara harfiyen uymakta,&lt;/li&gt;
&lt;li&gt;Kodlama yaparken ilerleyen yılllarda başka bir geliştiricinin bakabileceğini d&amp;uuml;ş&amp;uuml;nerek yazmakta,&lt;/li&gt;
&lt;li&gt;Bir &amp;ouml;nceki maddede belirttiğimiz ve ilerleyen yıllarda proje başına gelecek geliştiricinin, Dummy User olduğunu varsayarak, olayı iyi anlayabilmesi i&amp;ccedil;in ne kadar yorum satırı, XML Comment gerekiyorsa(tabi abartmadan) yazmakta,&lt;/li&gt;
&lt;li&gt;&amp;Ouml;zellikle .Net Framework i&amp;ccedil;erisinde ki tipleri boş vakitlerimizde araştırıp, var olan bir projenin hangi noktasında avantaj sağlayabileceğini incelemekte&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;yarar vardır &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Peki başka ip u&amp;ccedil;ları olabilir mi? Elbette olabilir. Bunları da ilerleyen yazılarımızda incelemeye devam edeceğiz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f9%2fOldTimes.rar"&gt;OldTimes.rar (25,69 kb)&lt;/a&gt;&amp;nbsp;&lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 Ultimate ile geliştirilmiş ve test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2011-03-17 07:01:00</pubDate>
  <slug>Daha-iyi-Kodlama-icin-Basit-Oneriler</slug>
  <tags>
    <tag>c#</tag>
    <tag>c#-temelleri</tag>
    <tag>net-framework</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>