<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Xml Web Servisleri - 5 (Mimarinin Temelleri - DISCO)</title>
  <description>Disco, Microsoft tarafından geliştirilmiş bir keşif mekanizmasıdır. Web servislerinin kullanılması ile ilgili en önemli sorun, istemci uygulamaları geliştiren yazılımcıların, ne tip web servisleri olduğundan ve bunları nasıl kullanacağından haberdar olamamasıdır. Bu amaçla, web servislerini yayınlayanlar, bu servislere ait erişim bilgilerini e-mail veya başka iletişim yolları ile, istemcileri geliştiren yazılım tarafına gönderebilirler. Ancak Microsoft bu işin daha kolay yapılabilmesini sağlamak amacıyla, web servislerinin keşfedilmelerine kolaylık getiren teknikler geliştirmiştir. Bu tekniklerden birisi, disco tekniğidir. Disco tekniğinin kilit noktası, disco uzantılı XML tabanlı dosyalardır. Daha önceki makalelerimizde, Visual Studio.Net ile geliştirdiğimiz istemci uygulamayı göz önüne aldığımızda, GeoMat.disco isimli bir dosyanında yer aldığını görürüz.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Disco, Microsoft tarafından geliştirilmiş bir keşif mekanizmasıdır. Web servislerinin kullanılması ile ilgili en &amp;ouml;nemli sorun, istemci uygulamaları geliştiren yazılımcıların, ne tip web servisleri olduğundan ve bunları nasıl kullanacağından haberdar olamamasıdır. Bu ama&amp;ccedil;la, web servislerini yayınlayanlar, bu servislere ait erişim bilgilerini e-mail veya başka iletişim yolları ile, istemcileri geliştiren yazılım tarafına g&amp;ouml;nderebilirler. Ancak Microsoft bu işin daha kolay yapılabilmesini sağlamak amacıyla, web servislerinin keşfedilmelerine kolaylık getiren teknikler geliştirmiştir. Bu tekniklerden birisi, disco tekniğidir. Disco tekniğinin kilit noktası, disco uzantılı XML tabanlı dosyalardır. Daha &amp;ouml;nceki makalelerimizde, Visual Studio.Net ile geliştirdiğimiz istemci uygulamayı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda, GeoMat.disco isimli bir dosyanında yer aldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk102_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. Disco Dosyamız.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu dosyanın i&amp;ccedil;eriği XML tabanlı olup aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8"?&amp;gt;
&amp;lt;discovery xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://schemas.xmlsoap.org/disco/"&amp;gt;
  &amp;lt;contractRef ref="http://localhost/GeoWebServis/GeoMat.asmx?wsdl" docRef="http://localhost/GeoWebServis/GeoMat.asmx" xmlns="http://schemas.xmlsoap.org/disco/scl/" /&amp;gt;
  &amp;lt;soap address="http://localhost/GeoWebServis/GeoMat.asmx" xmlns:q1="http://ilk/servis/" binding="q1:Geometrik_x0020_HesaplamalarSoap" xmlns="http://schemas.xmlsoap.org/disco/soap/" /&amp;gt;&amp;lt;/discovery&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu d&amp;ouml;k&amp;uuml;man, kullanılan web servisine nasıl erişileceğine ve &amp;ouml;zellikle wsdl d&amp;ouml;k&amp;uuml;manının nasıl isteneceğine dair &amp;ouml;nemli bilgileri barındırır. &amp;lt;contactRef boğumunda yer alan ref niteliği ile wsdl d&amp;ouml;k&amp;uuml;manına erişim şekli belirtilir. Aynı boğumda, docRef niteliği ile web servisine ait asmx uzantılı dosyanın bulunduğu url bilgisine yer verilmektedir. Bununla birlikte, &amp;lt;soap boğumunda, soap mesajlaşması i&amp;ccedil;in kullanılan isim alanlarının tanımlamaları yer almaktadır.&lt;/p&gt;
&lt;p&gt;Bu bilgilere sahip olan bir disco d&amp;ouml;k&amp;uuml;manı sayesinde, kullanılmak istenen web servisine nasıl erişileceği bilinebilir. Disco uzantılı bu XML dosyalarının, web servislerinin keşfine asıl katkısı, .net framework ile gelen disco aracının kullanımında olmaktadır. Bu durumu daha iyi anlayabilmek i&amp;ccedil;in şu senaryoyu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almakta yarar var; bir &amp;ccedil;ok web servisi barındırdan bir web sitemiz olduğunu d&amp;uuml;ş&amp;uuml;nelim. Web servisleri, IIS gibi sunucularda geliştirildiklerinden, yazılmış olan web servislerinin sayfamızı kullanan istemcilere yayınlamak isteriz. Başka bir deyişle web servislerimizden haberdar olunmasını isteriz. Disco tekniğini bu yayınlama işlemi i&amp;ccedil;in kullanabiliriz. İlk olarak, geliştirdiğimiz t&amp;uuml;m web servisleri i&amp;ccedil;in birer disco d&amp;ouml;k&amp;uuml;manı oluşturmalıyız. Daha sonra sitemizin a&amp;ccedil;ılış sayfasında ufak bir değişiklik ile bu disco d&amp;ouml;k&amp;uuml;manlarına disco aracı yardımıyla erişilmesini sağlamalıyız. Bu noktadan sonra, istemci uygulamaları geliştirecek olan yazılımcıların tek yapması gereken, başlangı&amp;ccedil; sayfamızın bulunduğu url bilgisini parametre olarak disco aracına bildirmek olacaktır. Şimdi bu senaryoyu ger&amp;ccedil;eğe &amp;ccedil;evirecek bir &amp;ccedil;alışma yapalım.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin yerel sunucumuzda (localhost) iki web servisimiz olduğunu d&amp;uuml;ş&amp;uuml;nelim. Şu aşamada bu servislerin nasıl yazıldığının fazla bir &amp;ouml;nemi yoktur. Şimdi bu servislere ait disco d&amp;ouml;k&amp;uuml;manlarını oluşturmamız gerekiyor. Bir disco d&amp;ouml;k&amp;uuml;manını herhangibir metin edit&amp;ouml;r&amp;uuml;nde yazabiliriz. Ancak XML i&amp;ccedil;eriğini oluşturmak zor gelebilir. Bunun i&amp;ccedil;in, Asp.Net&amp;rsquo; in imkanlarından faydalanabiliriz. Asp.Net bir web servisine ait disco dosyasını talep ettiğimizde bu dosyayı browser&amp;rsquo; da otomatik olarak &amp;uuml;retecektir. Bu bir web servisi i&amp;ccedil;in wsdl d&amp;ouml;k&amp;uuml;manının istenme şekli ile aynı prensiplere dayanır ve aşağıdaki gibi ger&amp;ccedil;ekleştirilir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;http://localhost/GeoWebServis/GeoMat.asmx?disco&lt;/pre&gt;
&lt;p&gt;Browser&amp;rsquo; da yazdığımız bu url&amp;rsquo; den sonra web servisimize ait disco d&amp;ouml;k&amp;uuml;manı bilgilerini aşağıdaki gibi elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk102_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. Disco bilgilerinin tarayıcı penceresinden elde edilmesi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdi tek yapmamız gereken bu XML i&amp;ccedil;eriğini disco uzantılı bir dosya halinde, localhost&amp;rsquo; a yani inetpub\wwwroot\ klas&amp;ouml;r&amp;uuml; altına kopyalamak olacaktır. Burada dikkat etmemiz gereken bir nokta vardır. Browser&amp;rsquo; dan elde ettiğimiz xml i&amp;ccedil;eriğini bir disco dosyasına kopylarken &amp;ndash; işaretlerini kaldırmayı unutmamalıyız. Aksi takdirde disco aracını kullanırken hata mesajları ile karşılaşırız. &amp;Ouml;rneğimizde bu ilk disco d&amp;ouml;k&amp;uuml;manını localhost&amp;rsquo; a GeoMat.disco ismi ile kaydedelim. Aynı işlemi sunucumuzda yer alan t&amp;uuml;m web servisleri i&amp;ccedil;in ger&amp;ccedil;ekleştirebiliriz. Bu işlemlerin ardından, localhost&amp;rsquo; un a&amp;ccedil;ılış sayfası olan localstart.asp dosyasını herhangibir editor&amp;rsquo; de a&amp;ccedil;alım. Burada Head tagları arasına aşağıdaki ekelemeleri yapmamız gerekiyor.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;head&amp;gt;
&amp;lt;link type='text/xml' rel='alternate' href='GeoMat.disco'/&amp;gt;&lt;/pre&gt;
&lt;p&gt;Şimdi burada ufak bir işlem daha yapmamız gerekiyor. Head tagında yer alan bu satırdan sadece bir tane tanımlayabiliriz. Normalde aşağıdaki gibi bir tanımlama yapıldığında, belirtilen iki disco dosyasınında ele alınacağı ve istemcide &amp;ccedil;alıştırılan disco aracı sayesinde indirilebileceğini d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;link type='text/xml' rel='alternate' href='GeoMat.disco'/&amp;gt;
&amp;lt;link type='text/xml' rel='alternate' href='PerSor.disco'/&amp;gt;&lt;/pre&gt;
&lt;p&gt;Ancak sanılanın aksine, disco aracı belirtilen sayfadaki link taglarından sadece ilkini &amp;ccedil;alıştırır ve bu link ile belirtilen disco d&amp;ouml;k&amp;uuml;manını ve buna bağlı wsdl d&amp;ouml;k&amp;uuml;manını indirir. Bu sorunu halletmek i&amp;ccedil;in, ilk olarak belirttiğimiz GeoMat.disco dosyasında &amp;lt;discoveryRef boğumunu ref niteliği ile birlikte eklememiz yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8"?&amp;gt;
&amp;lt;discovery xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://schemas.xmlsoap.org/disco/"&amp;gt;
&amp;lt;discoveryRef ref="PerSor.disco"/&amp;gt;  
&amp;lt;contractRef ref="http://localhost/GeoWebServis/GeoMat.asmx?wsdl" docRef="http://localhost/GeoWebServis/GeoMat.asmx" xmlns="http://schemas.xmlsoap.org/disco/scl/" /&amp;gt;
  &amp;lt;soap address="http://localhost/GeoWebServis/GeoMat.asmx" xmlns:q1="http://ilk/servis/" binding="q1:Geometrik_x0020_HesaplamalarSoap" xmlns="http://schemas.xmlsoap.org/disco/soap/" /&amp;gt;
&amp;lt;/discovery&amp;gt;&lt;/pre&gt;
&lt;p&gt;DiscoveryRef boğumu ile, GeoMat. disco dosyasının referans edebileceği başka disco dosyalarını belirtmiş oluruz. Dolayısıyla, başlangı&amp;ccedil; sayfasının bulunduğu adres, disco aracı i&amp;ccedil;in parametre olduğunda, bu adresteki link tagında yer alan disco dosyasının yanında bu dosyanın referans ettiği diğer disco d&amp;ouml;k&amp;uuml;manlarıda ele alınabilecektir. A&amp;ccedil;ık&amp;ccedil;ası k&amp;uuml;&amp;ccedil;&amp;uuml;k bir hile yapmış oluyoruz. Şimdi tek yapmamız gereken istemci bilgisayarın komut satırında aşağıdaki ifadeyi &amp;ccedil;alıştırmak olacaktır.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;D:\disco /out:deneme http://localhost/&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk102_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. Yerel sunucudaki disco ve wsdl d&amp;ouml;k&amp;uuml;manlarının elde edilmesi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından, deneme isimli klas&amp;ouml;re bakıldığında, GeoMat ve PerSor web servislerini kullanabilmemiz i&amp;ccedil;in gerekli proxy sınıflarını oluşturmakta kullanacağımız wsdl d&amp;ouml;k&amp;uuml;manlarının disco d&amp;ouml;k&amp;uuml;manları ile birlikte indirildiğini ve kayıt edildiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk102_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. İndirilen disco ve wsdl d&amp;ouml;k&amp;uuml;manları.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Artık bu noktadan sonra yapmamız gerekenler sadece wsdl d&amp;ouml;k&amp;uuml;manları yardımıyla proxy sınıfımızı oluşturmak ve kullanmak olacaktır. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-10-07 12:00:00</pubDate>
  <slug>Xml-Web-Servisleri-5-(Mimarinin-Temelleri-DISCO)-bsenyurt-com-dan</slug>
  <tags>
    <tag>xml-web-services</tag>
    <tag>disco</tag>
    <tag>discovery</tag>
  </tags>
  <categories>
    <category>XML Web Services</category>
  </categories>
</post>