<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Raspberry PI Derken Oluşan Python Çalışma Notlarım</title>
  <description>Bloğumu takip edenler bu yaz için Raspberry PI ve Python programlama diline merak saldığımı biliyordur. Bu merakımı boşa çıkarmamak için de vakit buldukça her iki konuya da çalışıyorum. İş yoğunluğu ve araya giren bayram tatili beni az da olsa geriye atmış durumda. Ama neyseki defterime aldığım renkli renkli notlarım var. Bu yüzden notlarımın üstünden geçmem öğrendiklerimi hatırlamamda epey yardımcı oldu. Notları renklendirmiş olmam da onları okurken sıkılmamamı ve hatta yer yer kendi kendime tebessüm etmemi sağladı. Yazdıklarımın üzerinden geçerken bunları bloğuma da koyayım ve benim gibi temel seviyede bu işe başlayan, elektronik'ten, Linux' den ve Python' dan bihaber olanlarla bir şeyler paylaşayım istedim.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2016/07/RaspiCover.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bloğumu takip edenler bu yaz i&amp;ccedil;in &lt;strong&gt;Raspberry PI&lt;/strong&gt; ve &lt;strong&gt;Python&lt;/strong&gt; programlama diline merak saldığımı biliyordur. Bu merakımı boşa &amp;ccedil;ıkarmamak i&amp;ccedil;in de vakit bulduk&amp;ccedil;a her iki konuya da &amp;ccedil;alışıyorum. İş yoğunluğu ve araya giren bayram tatili beni az da olsa geriye atmış durumda. Ama neyseki defterime aldığım renkli renkli notlarım var&lt;em&gt;.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu y&amp;uuml;zden notlarımın &amp;uuml;st&amp;uuml;nden ge&amp;ccedil;mem &amp;ouml;ğrendiklerimi hatırlamamda epey yardımcı oldu. Notları renklendirmiş olmam da onları okurken sıkılmamamı ve hatta yer yer kendi kendime tebess&amp;uuml;m etmemi sağladı. Yazdıklarımın&amp;nbsp;&amp;uuml;zerinden ge&amp;ccedil;erken bunları bloğuma da koyayım ve benim gibi temel seviyede bu işe başlayan, elektronik'ten, &lt;strong&gt;Linux&lt;/strong&gt;' den ve &lt;strong&gt;Python&lt;/strong&gt;' dan bihaber olanlarla bir şeyler paylaşayım istedim.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Raspberry PI&lt;/strong&gt; ve &lt;strong&gt;Python&lt;/strong&gt; maceramda sevgili &lt;a href="http://www.recepduman.net/" target="_blank"&gt;Recep Duman&lt;/a&gt; hocamın da yardımları var. Onun yol g&amp;ouml;stericiliğinde ilerlemeye &amp;ccedil;alışıyorum. &amp;Ouml;rneğin birlikte Karak&amp;ouml;y' deki elektronik&amp;ccedil;ilere gidip gerekli malzemeleri aldık. Ayrıca takip ettiğim iki kitap var.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://www.idefix.com/Kitap/Raspberry-Pi/Guray-Yildirim/Egitim-Basvuru/Bilgisayar/urunno=0000000681261" target="_blank"&gt;&lt;img src="/image.axd?picture=/2016/07/book1a.gif" alt="" /&gt;&lt;/a&gt;&amp;nbsp;&lt;a href="http://www.idefix.com/Kitap/Yeni-Baslayanlar-Icin-Python/Ahmet-Aksoy/Egitim-Basvuru/Ders-Kitaplari/Teknik-Ders-Kitaplari/urunno=0000000694609" target="_blank"&gt;&lt;img src="/image.axd?picture=/2016/07/book2a.gif" alt="" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bu kitapları da şiddetle tavsiye ederim. Orta&amp;nbsp;seviyeye kadar&amp;nbsp;&lt;strong&gt;Raspberry PI&lt;/strong&gt; ve &lt;strong&gt;Python&lt;/strong&gt; ile donanmamızı sağlayacak değerli kaynaklar. &amp;Ouml;yleyse vakit kaybetmeden notlarımızın &amp;uuml;zerinden bir ge&amp;ccedil;elim.&lt;/p&gt;
&lt;h2&gt;Temel Terminal Komutları [8 Haziran 2016]&lt;/h2&gt;
&lt;p&gt;İlk olarak kullanmakta olduğum Raspberry PI kartı &amp;uuml;zerinde &lt;strong&gt;Raspbian&lt;/strong&gt; işletim sisteminin y&amp;uuml;kl&amp;uuml; olduğunu belirteyim. Kurulum sonrası varsayılan kullanıcı adının &lt;strong&gt;pi&lt;/strong&gt; ve şifrenin de &lt;strong&gt;raspberry&lt;/strong&gt; olduğunu &amp;ouml;ğrendim. İlk yaptığım işlerden birisi&amp;nbsp;kullanıcı şifresini değiştirmek oldu.&amp;nbsp;&lt;span style="line-height: 1.8;"&gt;Bug&amp;uuml;n&amp;uuml; aşağıda kısa a&amp;ccedil;ıklamaları yer alan temel terminal komutlarını inceleyerek ge&amp;ccedil;irmişim.&lt;/span&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;ls - Dizin ve dosyaları listelemek i&amp;ccedil;indir&lt;/li&gt;
&lt;li&gt;cd .. - Bir &amp;uuml;st klas&amp;ouml;re &amp;ccedil;ıkarız&lt;/li&gt;
&lt;li&gt;mkdir - Klas&amp;ouml;r oluşturmak i&amp;ccedil;in kullanılır&lt;/li&gt;
&lt;li&gt;pwd - Print Working Directory'nin kısaltmasıdır. Bulunduğumuz konum&amp;nbsp;bilgisini verir.&lt;/li&gt;
&lt;li&gt;clear - Kalabalıklaştıktan sonra terminal ekranının temizlemek i&amp;ccedil;in kullanabiliriz. Hayatımızda yeni bir sayfa a&amp;ccedil;ar gibi.&lt;/li&gt;
&lt;li&gt;whoami - O an sistemde &amp;ccedil;alışmakta olan kullanıcının adını &amp;ouml;ğrenmemizi sağlar.&lt;/li&gt;
&lt;li&gt;rmdir - Klas&amp;ouml;r veya dosya silmek i&amp;ccedil;indir.&lt;/li&gt;
&lt;li&gt;touch - İ&amp;ccedil;eriği boş bir dosya oluşturmamızı sağlar.&lt;/li&gt;
&lt;li&gt;rm - Sadece dosya silmek i&amp;ccedil;in kullanılır.&lt;/li&gt;
&lt;li&gt;nano - Terminal &amp;uuml;zerinden kullanılan bir metin edit&amp;ouml;r&amp;uuml;d&amp;uuml;r. Beni MS-DOS zamanlarına g&amp;ouml;t&amp;uuml;rm&amp;uuml;şt&amp;uuml;r. Merak edip &amp;ouml;rnek kullanımını da not almışım. -sudo nano HelloWorld.rb ile Ruby kod dosyası a&amp;ccedil;mışım.&lt;/li&gt;
&lt;li&gt;cat, more, less - Dosya i&amp;ccedil;eriklerini g&amp;ouml;rmek i&amp;ccedil;in kullanılan komutlardır.&lt;/li&gt;
&lt;li&gt;df - Sistemdeki diskleri ve boş alan boyutlarını g&amp;ouml;sterir. Alan boyutlarının daha rahat okunabilmesi i&amp;ccedil;in genellikle -h parametresi ile kullanılır.&lt;/li&gt;
&lt;li&gt;file - Dosya veya dizinlerin t&amp;uuml;rleri hakkında bilgi edinmemizi sağlar.&lt;/li&gt;
&lt;li&gt;history - Terminalde son kullandığımız komutların neler olduğuna bakmak istersek kullanabiliriz.&lt;/li&gt;
&lt;li&gt;--help - Bir komutun kullanımı hakkında bilgi verir.&lt;/li&gt;
&lt;li&gt;man [Komut Adı] - Bu ise ilgili komut hakkındaki yardım dok&amp;uuml;manına ulaşmamızı sağlar.&lt;/li&gt;
&lt;li&gt;apt-get - Bu komutu sistemi g&amp;uuml;ncellemek ve uygulama y&amp;uuml;klemek i&amp;ccedil;in kullanabiliriz. &amp;Ouml;rnek olarak VLC isimli bir media player y&amp;uuml;klemişim ama bunu yapmadan &amp;ouml;nce sistemi de g&amp;uuml;ncellemişim&lt;em&gt;(sudo komutunu var olan kullanıcı bir takım operasyonları yerine getirirken Permision Denied hatası almasın diye kullanmaktayız)&lt;/em&gt;&lt;br /&gt;&lt;img src="/image.axd?picture=/2016/07/firstDay.gif" alt="" /&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bu komutları terminal ekranında biraz denemişim. Hatta Raspberry PI'ye uzaktan bağlanmak i&amp;ccedil;in de bir şeyler yapmışım. Siz de bunu yapmak isterseniz &amp;ouml;ncelikle Raspberry PI'yi Internete bağlayıp yerel ağ i&amp;ccedil;in verilen &lt;strong&gt;IP&lt;/strong&gt; adresini &amp;ouml;ğrenmeniz gerekir.&amp;nbsp;Bunun i&amp;ccedil;in terminalden&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;hostname -I&lt;/pre&gt;
&lt;p&gt;komutunu &amp;ccedil;alıştırmanız&amp;nbsp;yeterli&lt;em&gt;(Bana &lt;strong&gt;192.168.1.107&lt;/strong&gt; gibi bir adres d&amp;ouml;nm&amp;uuml;ş o g&amp;uuml;n)&lt;/em&gt;Sonrasında uzak bir bilgisayardan &lt;strong&gt;Secure Shell&lt;/strong&gt; bağlantısı kurabiliriz. Bu bağlantı i&amp;ccedil;in&amp;nbsp;yardımcı programlar kullanabileceğimiz gibi uzak bilgisayar terminalinden ssh komutu vererek de bağlanmayı deneyebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;ssh pi@192.168.1.107&amp;nbsp;&lt;/pre&gt;
&lt;p&gt;gibi. &amp;nbsp;Burada &lt;strong&gt;pi&lt;/strong&gt;&amp;nbsp;raspberry pi bilgisayarına hangi kullanıcı ile bağlanmak istediğimizi berlitmektedir.&lt;/p&gt;
&lt;p&gt;Rasbian'ın konfigurasyon ayarlarını değiştirmek i&amp;ccedil;in terminal ekranından &lt;strong&gt;sudo raspi-config&lt;/strong&gt; komutunu kullanabiliriz.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Raspberry PI &amp;uuml;zerinde Ruby ile geliştirme yapan&amp;nbsp;&lt;a href="http://rayhightower.com/" target="_blank"&gt;Ray Hightower&lt;/a&gt;&amp;nbsp;,&amp;nbsp;2012 yılında Raspberry PI'sini 37 Ekran bir TV'ye bağlamış. Hatta halen bu analog TV'yi kullandığını ifade etmekte. Bu bana Commodore 64 oyun bilgisayarımı ve onu bağladığım 37 ekran televizyonumu hatırlattı. İlk g&amp;uuml;n aldığım ilgin&amp;ccedil; notlardan birisi.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2&gt;Temel Python ile Ge&amp;ccedil;en Bir Perşembe [9 Haziran 2016]&lt;/h2&gt;
&lt;p&gt;Bir sonraki g&amp;uuml;n temel Python &amp;ccedil;alışmaları ile ge&amp;ccedil;miş(&lt;em&gt;Sanırım elektronikden dil kısmına doğru kaymaya karar vermişim)&lt;/em&gt; İşe&amp;nbsp;terminalden &lt;strong&gt;python&lt;/strong&gt; komutunu vererek başlayabiliriz. Bu durumda python kodlarını yazabileceğimiz ortama girmiş oluruz. Ortamdan &amp;ccedil;ıkmak i&amp;ccedil;in yine komut satırından &lt;strong&gt;exit()&lt;/strong&gt; ifadesini girebilir veya &lt;strong&gt;Ctrl+D&lt;/strong&gt; kısa yol kombinasyonunu kullanabiliriz. Gelelim ilk g&amp;uuml;n yaptığım basit &amp;ouml;rneklere&lt;em&gt;(Bunları makaleye ge&amp;ccedil;irirken yine &lt;a href="https://repl.it/languages/python3" target="_blank"&gt;Repl.it&lt;/a&gt; &amp;uuml;zerinden denedim ve doğru &amp;ccedil;alıştıklarından emin oldum)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Tabii giriş kısmında bir Merhaba demek gerekiyordu.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;print("Hello Python and Raspbbery PI")

myAge=39
myName="Burak"

print("My name is {} and I'am {} years old.\nAnd Pi*(R^2)={}".format(myName,myAge,3.14*10*10))&lt;/pre&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;print&lt;/strong&gt; komutu ile ekrana bir metin i&amp;ccedil;eriği yazdırıyoruz. Devam eden satırlarda ise myAge ve myName isimli iki değişken tanımı s&amp;ouml;z konusu. Son &lt;strong&gt;print&lt;/strong&gt; ifadesinde s&amp;uuml;sl&amp;uuml; parantezler i&amp;ccedil;erisinde bu değişkenleri yazdırıyor, &lt;strong&gt;\n&lt;/strong&gt; ile bir alt satıra ge&amp;ccedil;iş işlemini ger&amp;ccedil;ekleştiriyoruz&lt;em&gt;(\ ile escape karakter kullanımının s&amp;ouml;z konusu olduğunu ifade edebiliriz)&lt;/em&gt; S&amp;uuml;sl&amp;uuml; parantezler i&amp;ccedil;erisine gelecek ifadeler i&amp;ccedil;in format metodundan faydalanmaktayız. İlk s&amp;uuml;sl&amp;uuml; paranteze myName, ikinci s&amp;uuml;sl&amp;uuml; paranteze myAge son s&amp;uuml;sl&amp;uuml; paranteze ise matematiksel bir işlemin sonucu gelmekte.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu girişten sonra Python dilinin temel veri t&amp;uuml;rlerinden&amp;nbsp;olan listelere g&amp;ouml;z atmışım.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;players=["burki","tubi","sharpi","reco","tusubasa"]

print(players)
print(players[2])

players.append("anduin")
print(players)

players.remove("burki")
print(players)

motto="Today is a good day to die"
print("good" in motto)

points=[30,21.50,90,15,18.5,45,3,3.14,0,-4,-2,(90*-3)]
print(points)

points.sort()
print(points)

points.sort(reverse=True)
print(points)

someObjects=[1,-1,"burk",True,90.345,900000055555555555000000000000000015]
print(someObjects)&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Belli tipte veya farklı t&amp;uuml;rlerede elemanları tutmak i&amp;ccedil;in listelerden yararlanabiliriz. Listenin elemanlarına ulaşmak i&amp;ccedil;in &lt;strong&gt;[]&lt;/strong&gt; operat&amp;ouml;r&amp;uuml; kullanılır. &lt;strong&gt;Pop&lt;/strong&gt; metodu ile son eklenen eleman listeden &amp;ccedil;ekilir ve ayrıca silinir&lt;em&gt;(ki burada denemeyi unutmuşum ama siz deneyebilirsiniz)&lt;/em&gt; Listeden eleman &amp;ccedil;ıkartmak i&amp;ccedil;inse &lt;strong&gt;remove&lt;/strong&gt; fonksiyonu kullanılır. Faydalı fonksiyonlardan birisi de &lt;strong&gt;sort&lt;/strong&gt;. Karışık bir listenin &lt;strong&gt;ascending&lt;/strong&gt; veya &lt;strong&gt;descending&lt;/strong&gt; sıralanmasını sağlar. Descending sırlama i&amp;ccedil;in &lt;strong&gt;reverse&lt;/strong&gt; parametresine &lt;strong&gt;True&lt;/strong&gt; değeri verilmesi yeterlidir. O g&amp;uuml;n hoşuma giden kullanımlardan birisi de, bir &amp;ouml;ğenin listede olup olmadığının bulunması olmuş.&lt;strong&gt; "good" in motto&lt;/strong&gt; ifadesine g&amp;ouml;re good kelimesi motto değişkeni ile işaret edilen metinde ge&amp;ccedil;iyorsa &lt;strong&gt;True&lt;/strong&gt; ge&amp;ccedil;miyorsa &lt;strong&gt;False&lt;/strong&gt; sonucu elde edilir.&amp;nbsp;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Defterde reverse=true şeklinde&amp;nbsp;yazdıktan sonra Python'un case-sensitive bir&amp;nbsp;dil olduğunu not almışım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Notlarım d&amp;ouml;ng&amp;uuml;ler ve range kullanımı ile devam etmiş. Epey verimli bir haziran g&amp;uuml;n&amp;uuml; ge&amp;ccedil;irmişim.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;players=["burki","tubi","sharpi","reco","tusubasa"]

for player in players:
	print(player,"is online now")
	
numbers1=range(11) #0dan 10a kadar bir sayı aralığıdır
total=0
for number in numbers1:
	total+=number
	
print(total)

numbers2=range(-25,0,5)
for number in numbers2:
	print(number)&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;range&lt;/strong&gt; veri t&amp;uuml;r&amp;uuml; ile belirli aralıklardaki sayı dizilerini kolayca tanımlayabiliriz. Hatta bu tanımlamalarda adım değeri de verebiliriz. &amp;Ouml;rneğin &lt;strong&gt;-25'den -5e kadar olan sayıları 5er adım aralıkla elde edebiliriz&lt;/strong&gt;. &lt;strong&gt;for&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;leri ile &lt;strong&gt;range&lt;/strong&gt; ve &lt;strong&gt;list&lt;/strong&gt; veri t&amp;uuml;rleri &amp;uuml;zerinde dolaşarak belli işlemler ger&amp;ccedil;ekleştirmemiz de m&amp;uuml;mk&amp;uuml;n.&amp;nbsp;Belli bir değer aralığındaki sayıların toplamını bulmak, oyuncu listesini ekrana yazdırmak &amp;ouml;rnek kod par&amp;ccedil;asında yer verilen işlemlerdir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Python girinti(indent) kuralları barındıran bir dildir. Bir d&amp;ouml;ng&amp;uuml;n&amp;uuml;n&lt;em&gt;(bir metodun, if ifadesinin vb)&lt;/em&gt; alt satırlarına inildiğinde girinti verilmesi zorunludur diye de not almışım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bu arada o g&amp;uuml;nk&amp;uuml; kod &amp;ouml;rneklerini dosyalarda bulundurmaya başlamışım. &lt;strong&gt;Python&lt;/strong&gt; kod dosyaları i&amp;ccedil;in &lt;strong&gt;py&lt;/strong&gt; uzantısı kullanılmakta. Eğer bir &lt;strong&gt;python&lt;/strong&gt; dosyasını terminalden &amp;ccedil;alıştırmak istersek aynen &lt;strong&gt;Ruby&lt;/strong&gt; dilinden olduğu gibi bir komut kullanmamız yeterli. &amp;Ouml;rneğin&amp;nbsp;&lt;/p&gt;
&lt;p&gt;python HelloWorld.py&lt;/p&gt;
&lt;p&gt;gibi.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bug&amp;uuml;ne ait &amp;ouml;nemli notlardan birisi de sistemde y&amp;uuml;kl&amp;uuml; iki farklı Python s&amp;uuml;r&amp;uuml;m&amp;uuml; olması. Python 2.7.9 ve Python 3.4.2. Bunlar arasında belirgin farklılıklar var.&amp;nbsp;Bu farklılıkları araştırırken &lt;a href="http://sebastianraschka.com/Articles/2014_python_2_3_key_diff.html" target="_blank"&gt;şu blog adresinden&lt;/a&gt;&amp;nbsp;yararlanmışım.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Kod &amp;ccedil;alışmasına metod tanımlamaları ile devam etmişim. E onlar olmadan olmaz tabii.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;players=["burki","tubi","sharpi","reco","tusubasa"]

def writeAllPlayers():
	for player in players:
		print(player,"is online now")
		

def rangeSum(x,y):
	numbers=range(x,y)
	total=0
	for n in numbers:
		total+=n
	return total

writeAllPlayers()
result=rangeSum(0,11)
print(result)&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek kod par&amp;ccedil;asında iki metod yer alıyor. &lt;strong&gt;writeAllPlayers&lt;/strong&gt; isimli fonksiyonumuz &lt;strong&gt;players&lt;/strong&gt; listesindeki elemanları ekrana yazdırmakta. &lt;strong&gt;rangeSum&lt;/strong&gt; metodu ise &lt;strong&gt;x,y&lt;/strong&gt; parametrelerini kullanarak bir &lt;strong&gt;range&lt;/strong&gt; oluşturmakta ve bu değer aralığındaki sayıların toplamını hesap ederek geri d&amp;ouml;nd&amp;uuml;rmekte. Bu basit metod kullanımlarını inceledikten sonra o haziran g&amp;uuml;n&amp;uuml; yaptığım &amp;ccedil;alışmaları tamamlamışım.&lt;/p&gt;
&lt;h2&gt;Modules ve pip [10 Haziran 2016]&lt;/h2&gt;
&lt;p&gt;O Cuma g&amp;uuml;n&amp;uuml; module kavramını incelmeye &amp;ccedil;alışmışım. Aslında aldığım notlara g&amp;ouml;re sadece &lt;strong&gt;random&lt;/strong&gt; mod&amp;uuml;l&amp;uuml;n&amp;uuml; kod i&amp;ccedil;erisinde kullanmışım. &lt;strong&gt;Module&lt;/strong&gt;' leri kod par&amp;ccedil;aları i&amp;ccedil;eren ayrık dosyalar olarak d&amp;uuml;ş&amp;uuml;nebiliriz. &lt;strong&gt;Module&lt;/strong&gt;' ler genellikle aynı domain'e&amp;nbsp;&amp;ouml;zg&amp;uuml;&amp;nbsp;fonksiyonellikleri barındırır. S&amp;ouml;z gelimi rastgele sayı &amp;uuml;retimi ile ilişkili t&amp;uuml;m operasyonlar &lt;strong&gt;random&lt;/strong&gt; mod&amp;uuml;l&amp;uuml;nde toplanmıştır. Mod&amp;uuml;ller i&amp;ccedil;erisinde&amp;nbsp;&amp;ccedil;eşitli&amp;nbsp;veri t&amp;uuml;rleri ve fonksiyonellikler&amp;nbsp;bulunur. Bir mod&amp;uuml;l i&amp;ccedil;erisinde&amp;nbsp;hangi &amp;uuml;yelerin olduğunu g&amp;ouml;rmek i&amp;ccedil;in &lt;strong&gt;dir&lt;/strong&gt; metodundan yararlanabiliriz.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;import random
print("random i&amp;ccedil;eriği",dir(random),"\n")
print("shuffle i&amp;ccedil;eriği",dir(random.shuffle),"\n")&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek kod par&amp;ccedil;asında &lt;strong&gt;random&lt;/strong&gt; mod&amp;uuml;l&amp;uuml;n&amp;uuml;n ve bu mod&amp;uuml;ldeki &lt;strong&gt;shuffle&lt;/strong&gt; operasyonunun &amp;uuml;yeleri listlenmektedir. Eğer istersek bu &amp;uuml;yelerin yardım dok&amp;uuml;manlarına da ulaşabiliriz. Bunun i&amp;ccedil;in &lt;strong&gt;help(random)&lt;/strong&gt; gibi bir ifade kullanmamız yeterlidir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Kodda dikkat edilmesi gereken noktalardan birisi de import kullanımıdır.&amp;nbsp;&lt;span style="line-height: 1.8;"&gt;import ile kodun ilerleyen kısımlarında random mod&amp;uuml;l&amp;uuml;ndeki operasyonlar kullanılabilir hale gelir.&amp;nbsp;Eğer bunu yapmazsak&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;Traceback (most recent call last):&lt;br /&gt; File "python", line 2, in &amp;lt;module&amp;gt;&lt;br /&gt;NameError: name 'random' is not defined&lt;/p&gt;
&lt;p&gt;şeklinde bir hata alırız.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;İşte random mod&amp;uuml;l&amp;uuml;ne ait bazı&amp;nbsp;kullanımlar.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;import random

def createTenRandoms(x=0,y=11,isInt=False):
	numbers=[]
	for i in range(11):
		rnd=random.random() if isInt else random.randint(x,y)
		numbers.append(rnd)
	return numbers

numbers1=createTenRandoms(False)
print(numbers1,"\n")

numbers2=createTenRandoms(0,11,True)
print(numbers2,"\n")

print("a random number is",random.choice(numbers1),"\n")
print("and next random number is",random.choice(numbers1))&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;createTenRandoms&lt;/strong&gt; isimli fonkisyon &amp;uuml;&amp;ccedil; parametre almaktadır ve bu parametrelerin varsayılan ilk değerleri de verilmektedir. Yani metod &amp;ccedil;ağrısı sırasında&lt;strong&gt; x,y&lt;/strong&gt; ve &lt;strong&gt;isInt&lt;/strong&gt; değişkenlerine bir değer atanması zorunlu değildir. Fonksiyon i&amp;ccedil;erisine gelen &lt;strong&gt;isInt&lt;/strong&gt; değerine g&amp;ouml;re &lt;strong&gt;ternary&lt;/strong&gt; operat&amp;ouml;r&amp;uuml;ne benzer bir kullanım s&amp;ouml;z konusudur. Eğer &lt;strong&gt;isInt&lt;/strong&gt; değeri &lt;strong&gt;True&lt;/strong&gt; gelmişse &lt;strong&gt;random()&lt;/strong&gt; fonksiyonu, &lt;strong&gt;False&lt;/strong&gt; gelmişse &lt;strong&gt;randint(x,y)&lt;/strong&gt; &amp;ccedil;ağrısı s&amp;ouml;z konusudur. &lt;strong&gt;random()&lt;/strong&gt; rastgele kayan noktalı sayılar &amp;uuml;retirken &lt;strong&gt;random(x,y)&lt;/strong&gt; &lt;strong&gt;x ve y aralığında yer alacak rastgele tamsayılar &amp;uuml;retir&lt;/strong&gt;. &amp;Uuml;retilen rastgele sayılar &lt;strong&gt;numbers&lt;/strong&gt; isimli listeye eklenir ve bu liste fonksiyondan geri d&amp;ouml;ner.&lt;/p&gt;
&lt;p&gt;O g&amp;uuml;n izlediğim kitaptan yararlanarak &lt;strong&gt;python&lt;/strong&gt; &amp;ccedil;alışma zamanından&amp;nbsp;&lt;strong&gt;Raspberry Pi&lt;/strong&gt; &amp;uuml;zerindeki uygulamaların nasıl &amp;ccedil;ağırılabileceğine de bakmışım. Bu işlem i&amp;ccedil;in subprocess isimli bir mod&amp;uuml;lden yararlanılmakta.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;import subprocess

print(subprocess.check_output("pwd"))
print(subprocess.check_output(["ls", "l"]))
subprocess.run(["ping", "8.8.8.8"])&lt;/pre&gt;
&lt;p&gt;Mod&amp;uuml;llerin kullanımlarını bu şekilde inceledikten sonra Raspberry PI'ye internetten bir ka&amp;ccedil; paket y&amp;uuml;klemeyi denemişim. Ruby'de ki &lt;strong&gt;gem&lt;/strong&gt; veya .Net'teki &lt;strong&gt;Nuget&lt;/strong&gt; paketleri gibi indirilip &lt;strong&gt;python&lt;/strong&gt; tarafında kullanılabilen hazır k&amp;uuml;t&amp;uuml;phaneler s&amp;ouml;z konusu. Epey faydalı k&amp;uuml;t&amp;uuml;phane olduğunu ifade edebilirim. &amp;Ouml;rneğin web uygulamaları geliştirmek i&amp;ccedil;in kullanılabilecek &lt;strong&gt;flask&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesini terminalden aşağıdaki gibi y&amp;uuml;klememiz m&amp;uuml;mk&amp;uuml;n.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo pip install flask&lt;/pre&gt;
&lt;p&gt;veya belli bir s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; y&amp;uuml;klemek i&amp;ccedil;in&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo pip install flask==0.10.2&lt;/pre&gt;
&lt;p&gt;K&amp;uuml;t&amp;uuml;phanenin başarılı bir şekilde y&amp;uuml;klenip y&amp;uuml;klenmediğini anlamak da olduk&amp;ccedil;a kolay aslında. Bunun i&amp;ccedil;in &lt;strong&gt;python&lt;/strong&gt; komut satırından&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;import flask&lt;/pre&gt;
&lt;p&gt;şeklinde komut &amp;ccedil;alıştırılması&amp;nbsp;yeterli. Bir hata mesajı almıyorsak paket başarılı bir şekilde y&amp;uuml;klenmiştir.&lt;/p&gt;
&lt;p&gt;Paketleri kaldırmak i&amp;ccedil;in &lt;strong&gt;uninstall&lt;/strong&gt; parametresinden&amp;nbsp;yararlanılıyor.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo pip uninstall flask&lt;/pre&gt;
&lt;p&gt;Eğer sistemde y&amp;uuml;kl&amp;uuml; olan paketleri g&amp;ouml;rmek ve hatta bunları bir metin dosyasına yazdırmak&amp;nbsp;istersek terminalden aşağıdaki komutu girmemiz yeterli.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo pip freeze&amp;gt;modules.txt&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;Bu arada uzun mod&amp;uuml;l adları s&amp;ouml;z konusu olursa import ve as ile bu mod&amp;uuml;le takma ad&lt;em&gt;(alias)&lt;/em&gt; vererek kod i&amp;ccedil;erisinde daha kolay kullanılmalarını sağlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_9.gif" alt="" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Aslında kendi mod&amp;uuml;llerimizi geliştirmemiz olduk&amp;ccedil;a kolay. Tek yapılması gereken aynı alana ait operasyonları i&amp;ccedil;eren py uzantılı bir kod dosyası oluşturmak. Bu kod dosyasının adı aynı zamanda mod&amp;uuml;l&amp;uuml;n adı olacaktır.&lt;/p&gt;
&lt;h3&gt;Paketler&lt;/h3&gt;
&lt;p&gt;Bir de Paket kavramı var tabii. Notlarıma baktığımda ilerleyen g&amp;uuml;nlerde paketler&lt;em&gt;(Packages)&lt;/em&gt; ile ilişkili bir şeyler karaladığımı g&amp;ouml;rd&amp;uuml;m.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_18.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında aynı amaca hizmet eden n sayıda mod&amp;uuml;l&amp;uuml; hiyerarşik bir klas&amp;ouml;r yapısı ile ifade edip paket haline getirebiliriz. Kritik nokta her paket i&amp;ccedil;inde &lt;strong&gt;__init__.py&lt;/strong&gt; isimli bir dosyanın olmasıdır. Bu dosyayı i&amp;ccedil;eren klas&amp;ouml;r aslında otomatik olarak bir paket haline gelir. &amp;Ouml;rneğin aşağıdaki gibi bir klas&amp;ouml;r yapımız olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;serialization/&lt;br /&gt;&amp;nbsp; &amp;nbsp; __init__.py&lt;br /&gt;&amp;nbsp; &amp;nbsp; schema.py&lt;br /&gt;&amp;nbsp; &amp;nbsp; serializers.py&lt;br /&gt;&amp;nbsp; &amp;nbsp; common.py&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;__init__.py&lt;/strong&gt; nin bırda&lt;em&gt;(yanlışlıkla bırda yazmışım ve burada diye d&amp;uuml;zeltmek i&amp;ccedil;imden gelmemiş)&lt;/em&gt; bir i&amp;ccedil;eriğie sahip olması zorunlu değildir. Ancak kod par&amp;ccedil;aları da i&amp;ccedil;erebilir. Varlığı &lt;strong&gt;serialization&lt;/strong&gt; klas&amp;ouml;r&amp;uuml;n&amp;uuml;n bir paket haline gelmesi i&amp;ccedil;in yeterlidir. Eğer bu paketten &amp;ouml;rneğin &lt;strong&gt;schema&lt;/strong&gt; mod&amp;uuml;l&amp;uuml;n&amp;uuml; kullanmak istersek&lt;/p&gt;
&lt;p&gt;from serialization import common&lt;/p&gt;
&lt;p&gt;gibi bir ifadeyi ele almamız gerekir. O g&amp;uuml;n konu ile ilişkili olarak internetten araştırma yaptığımı not almışım. &lt;a href="http://stackoverflow.com/questions/448271/what-is-init-py-for" target="_blank"&gt;Stackoverflow' da konu ile ilgili g&amp;uuml;zel bir i&amp;ccedil;erik de bulmuşum.&lt;/a&gt;&lt;/p&gt;
&lt;h2&gt;Web Sitesi Yayımlamışım [12 Haziran 2012]&lt;/h2&gt;
&lt;p&gt;O g&amp;uuml;n kitap &amp;uuml;zerinden &amp;ccedil;alışmaya devam etmişim ve Raspberry Pi'yi bir web sunucusu haline getirmeye &amp;ccedil;alışmışım. &lt;strong&gt;Raspberry Pi&lt;/strong&gt; olduk&amp;ccedil;a ucuz bir kart ama aynı zamanda bir bilgisayar. Bu nedenle onu bir web sunucusu haline getirebilir, &amp;uuml;zerinde web uygulamaları barındırabiliriz. Hatta micro-service' ler konuşlandırarak etkileşime ge&amp;ccedil;tiği cihazlardan&lt;em&gt;(&amp;ouml;rneğin ortam sıcaklığı,mesafe, odadaki&amp;nbsp;ışık şiddeti gibi &amp;ouml;l&amp;ccedil;&amp;uuml;mler yapabilen&amp;nbsp;&amp;ccedil;eşitli tipteki sens&amp;ouml;rlerden)&lt;/em&gt; dış d&amp;uuml;nyaya servis bazlı veri sağlayabiliriz&lt;em&gt;(REST tabanlı servisler ile sens&amp;ouml;r verilerini JSON formatında yayımlamak gibi)&amp;nbsp;&lt;/em&gt;Tabii ilk adım Raspi'yi bir web sunucusu haline getirebilmek. İşte bunun i&amp;ccedil;in aşağıdaki adımları izlemişim.&lt;/p&gt;
&lt;h3&gt;Apache Kurulumu&lt;/h3&gt;
&lt;p&gt;İlk olarak bir web sunucusuna ihtiyacımız var. En uygun se&amp;ccedil;im &lt;strong&gt;Apache&lt;/strong&gt;. Apache kurulumu i&amp;ccedil;in terminalden aşağıdaki komutu &amp;ccedil;alıştırmamız yeterli.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo apt-get install apache2&lt;/pre&gt;
&lt;p&gt;Kurulum &amp;ouml;ncesi sistemi update etmekte yarar olabilir. Kurulum tamamlandığında tarayıcıdan makine IP adresine bağlanılarak apache web sunucusunun kurulup kurulmadığı kontrol edilmelidir. Hatırlanacağı &amp;uuml;zere Raspi'nin o anki IP adresini &amp;ouml;ğrenmek i&amp;ccedil;in terminalden &lt;strong&gt;hostname -I&lt;/strong&gt; komutunu vermek yeterliydi. O g&amp;uuml;n benim &lt;strong&gt;Raspim&lt;/strong&gt; bana &lt;strong&gt;192.168.1.105&lt;/strong&gt; nolu IP adresini vermiş.&lt;/p&gt;
&lt;h3&gt;Index.html İ&amp;ccedil;eriğinin Değiştirilmesi&lt;/h3&gt;
&lt;p&gt;&lt;strong&gt;Apache&lt;/strong&gt; kurulduktan sonra&lt;strong&gt; /var/www/html&lt;/strong&gt; i&amp;ccedil;erisine varsayılan bir &lt;strong&gt;index&lt;/strong&gt; sayfası koyar. Bu &lt;strong&gt;HTML&lt;/strong&gt; i&amp;ccedil;eriği istenildiği gibi değiştirilebilir ve kendi karşılama sayfamız sunucuya y&amp;uuml;klenebilir. Ben index.html i&amp;ccedil;eriğini aşağıdaki gibi değiştirmişim.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;
	&amp;lt;head&amp;gt;
		&amp;lt;title&amp;gt;Burkinin Ahududu Bahcesi&amp;lt;/title&amp;gt;
	&amp;lt;/head&amp;gt;
	&amp;lt;body&amp;gt;
		&amp;lt;h1&amp;gt;Burkinin ahududu bahcesine hosgeldiniz!&amp;lt;/h1&amp;gt;
		&amp;lt;p&amp;gt;&amp;lt;a href="http://www.buraksenyurt.com"&amp;gt;Blog&amp;lt;/a&amp;gt;&amp;lt;/p&amp;gt;
	&amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Sonrasında kendi bilgisayarımdan bu adrese giderek Raspim &amp;uuml;zerinde değiştirdiğim index.html i&amp;ccedil;eriğine ulaşabilmişim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_10.gif" alt="" /&gt;&lt;/p&gt;
&lt;h3&gt;Php Kullanımı&lt;/h3&gt;
&lt;p&gt;Derken işi ilerletip web sunucusunda php ile nasıl kod yazılacağına dair notlar almışım. Tabii ilk &amp;ouml;nce &lt;strong&gt;php&lt;/strong&gt; alt yapısının&amp;nbsp;y&amp;uuml;klenmesi gerekiyor. Bunun i&amp;ccedil;in yine terminalden ilerlememiz lazım.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo apt-get install php5 libapache2 -mod -php5&lt;/pre&gt;
&lt;p&gt;install'dan sonra gelen ikinci parametre dizisi php'nin apache i&amp;ccedil;in gerekli eklentisinin y&amp;uuml;klenmesini sağlamakta.&lt;/p&gt;
&lt;h3&gt;Bir php dosyasının oluşturulması&lt;/h3&gt;
&lt;p&gt;Tabii sisteme php y&amp;uuml;kledikten sonra bir de Hello World demek gereki değil mi?&lt;em&gt;(Ama php tarafına bulaşacağımı hi&amp;ccedil; sanmıyorum. Şimdiden not edeyim)&lt;/em&gt;&amp;nbsp;Bunun i&amp;ccedil;in kitapta &amp;ouml;ng&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;bilgi.php&lt;/strong&gt; uzantılı bir dosyayı oluşturmuş ve i&amp;ccedil;erisine aşağıdaki kod par&amp;ccedil;asını yazmışım.&lt;/p&gt;
&lt;pre class="brush:php;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?php
    phpinfo();
?&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;phpinfo()&lt;/strong&gt; metodu ile sistemde y&amp;uuml;kl&amp;uuml; php versiyonunu ve i&amp;ccedil;erisinde yer alan mod&amp;uuml;l listesini elde etmemiz m&amp;uuml;mk&amp;uuml;n. &amp;Ccedil;ekinmeyin deneyin.&lt;/p&gt;
&lt;h2&gt;S&amp;ouml;yleşi &amp;Ouml;ncesi Hazırlık [15 Haziran 2016]&lt;/h2&gt;
&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2016/07/notes_12.gif" alt="" /&gt;Bug&amp;uuml;n Recep Duman hocamla yapacağım s&amp;ouml;yleşi &amp;ouml;ncesi bazı notlar almışım. &amp;Ouml;zellikle &lt;strong&gt;python&lt;/strong&gt; diline ait genel&amp;nbsp;&amp;ouml;zelliklere &amp;ccedil;alışmışım.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Yorumlamalı&lt;em&gt;(Interpreted)&lt;/em&gt; dillerdendir. Yani kaynak kodun tamamının derlenip makine diline &amp;ccedil;evrilmesi yerine sırası gelen satırın derlenip&amp;nbsp;o anda &amp;ccedil;alışması s&amp;ouml;z konusudur.&lt;/li&gt;
&lt;li&gt;Dinamik tip sistemine sahiptir.&lt;/li&gt;
&lt;li&gt;Platform bağımsızdır. linux, macos, windows, amiga, symbian gibi ortamlarda &amp;ccedil;alışabilir.&lt;/li&gt;
&lt;li&gt;Mod&amp;uuml;ler bir yapısı vardır.&lt;/li&gt;
&lt;li&gt;Nesne y&amp;ouml;nelimli&lt;em&gt;(Object Oriented)&lt;/em&gt; bir dildir.&lt;/li&gt;
&lt;li&gt;Girintilere&lt;em&gt;(Indent)&lt;/em&gt; dayalı, katı kuralları olan, b&amp;uuml;y&amp;uuml;k k&amp;uuml;&amp;ccedil;&amp;uuml;k harf duyarlı bir s&amp;ouml;z dizimine sahiptir.&lt;/li&gt;
&lt;li&gt;Python yazılım vakfınca desteklenmektedir.&lt;/li&gt;
&lt;li&gt;Tasarımcısı &lt;a href="https://en.wikipedia.org/wiki/Guido_van_Rossum" target="_blank"&gt;Guido Van Rossum&lt;/a&gt;'dur ve ilk s&amp;uuml;r&amp;uuml;m&amp;uuml;&amp;nbsp;1991 yılında &amp;ccedil;ıkmıştır. Kendisine python topluluğu tarafından "Yaşam Boyu Hayırsever Diktat&amp;ouml;r&lt;em&gt;(Benevolent Dictator For Life)&lt;/em&gt;" &amp;uuml;nvanı verilmiştir.&lt;/li&gt;
&lt;li&gt;B&amp;uuml;y&amp;uuml;k &amp;ccedil;aplı yazılımların hızlı geliştirilmesi ve prototip &amp;uuml;retilmesinde C,C++ gibi dillere tercih edilir. Hatta Java diline g&amp;ouml;re 3 ila 5, C++ diline g&amp;ouml;re ise 5 ila 10 kez daha kısa kod blokları ile aynı işlerin yapılabilmesine olanak vardır.&lt;/li&gt;
&lt;li&gt;Groovy, ruby ve javascript gibi dilleri etkilemiştir. Kendisi ise C, Haskell, Java, Lisp ve Perl'den etkilenmiştir.&lt;/li&gt;
&lt;li&gt;Adını yılandan değil Monty Python grubunun Monty Python's Flying Circus isimli g&amp;ouml;sterisinden almıştır.&lt;/li&gt;
&lt;li&gt;Betik(script) dili olarak openoffice.org, GIMP, Inkspace, Blender, Scribus, Paintshop Pro vb &amp;uuml;r&amp;uuml;nlerde kullanılmıştır.&lt;/li&gt;
&lt;li&gt;Django&lt;em&gt;(Python ile yazılan programların internet &amp;uuml;zerinden &amp;ccedil;alışmasına olanak sağlar ki bu bağlamda The New York Times, The Guardian, Bit Bucket ve Instagram gibi siteler doğmuştur)&lt;/em&gt;, Youtube, BitTorrent, Pardus, Google, NASA ve CERN python kullanan firma ve &amp;uuml;r&amp;uuml;nlerden sadece bir ka&amp;ccedil;ıdır.&lt;/li&gt;
&lt;/ul&gt;
&lt;h2&gt;REST Servis Kullanımı [18-Haziran-2016]&lt;/h2&gt;
&lt;p&gt;O g&amp;uuml;n &lt;a href="https://home.openweathermap.org/" target="_blank"&gt;Weather Data Service&lt;/a&gt; isimli bir &lt;strong&gt;Web API&lt;/strong&gt;'yi Raspi &amp;uuml;zerinden python ile nasıl kullanabileceğime &amp;ccedil;alışmışım. Pek &amp;ccedil;ok Web API hizmetinde olduğu gibi bu servisten yararlanabilmek i&amp;ccedil;in bir &lt;strong&gt;uygulama anahtarına&lt;em&gt;(Application Key)&lt;/em&gt;&lt;/strong&gt; ihtiyacımız var. Bunun i&amp;ccedil;in &amp;ouml;ncelikle hizmete &amp;uuml;ye olmalı ve bir &lt;strong&gt;API Key&lt;/strong&gt; &amp;uuml;rettirmeliyiz. &amp;Uuml;zerinde &amp;ccedil;alıştığım &amp;ouml;rnek temel olarak ilgili API'ye bir &lt;strong&gt;REST&lt;/strong&gt; talebi g&amp;ouml;nderip sonu&amp;ccedil;larını almakta. &amp;Ouml;rneğin bir şehrin 3 g&amp;uuml;nl&amp;uuml;k hava durumu bilgisine ulaşmanız m&amp;uuml;mk&amp;uuml;n. O g&amp;uuml;nk&amp;uuml; &amp;ccedil;alışmada benim i&amp;ccedil;in kritik olan nokta, bu tip hizmetler i&amp;ccedil;in &lt;strong&gt;HTTP&lt;/strong&gt; &amp;ccedil;ağrılarının &lt;strong&gt;python&lt;/strong&gt; &amp;uuml;zerinden nasıl ger&amp;ccedil;ekleştirildiğini g&amp;ouml;rmekti. &lt;strong&gt;Python&lt;/strong&gt; tarafındaki kodda bu talepleri zahmetsizce g&amp;ouml;nderebilmek i&amp;ccedil;in &lt;strong&gt;requests&lt;/strong&gt; mod&amp;uuml;l&amp;uuml;nden yararlanabiliriz. Ancak bu mod&amp;uuml;l&amp;uuml; aldığım notlara g&amp;ouml;re sisteme y&amp;uuml;klenmesi&amp;nbsp;gerekiyor.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo pip install requests&lt;/pre&gt;
&lt;p&gt;Bu işlemin ardından &amp;ccedil;ok basit bir şekilde aşağıdaki kod par&amp;ccedil;asında olduğu gibi talep g&amp;ouml;nderilmesi&amp;nbsp;ve &lt;strong&gt;JSON&lt;/strong&gt; formatında i&amp;ccedil;erik alınması&amp;nbsp;m&amp;uuml;mk&amp;uuml;n hale gelmekte.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;import requests
import json

def getWeatherData(city_id,ApiKey):
	data=get("http://api.openweathermap.org/data/2.5/forecast?id={}&amp;amp;APPID={}".format(city_id,KEY))
	return data.json()
	
print(getWeatherData("buraya sehir idsi gelmeli","buraya api key gelmeli"))&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;get&lt;/strong&gt; metodu dikkat edileceği &amp;uuml;zere basit bir &lt;strong&gt;HTTP&lt;/strong&gt; &lt;strong&gt;Get&lt;/strong&gt; talebi g&amp;ouml;ndermekte. Bunu yaparken de &lt;strong&gt;Open Weather Map&lt;/strong&gt;'in g&amp;ouml;sterdiği kriterlere g&amp;ouml;re parametre alıyor. &lt;strong&gt;id&lt;/strong&gt; ile şehir numarasını &lt;strong&gt;appid&lt;/strong&gt; ile de servis kullanıcısına a&amp;ccedil;ılan uygulama anahtarını kullanıyor. D&amp;ouml;nen i&amp;ccedil;eriği &lt;strong&gt;JSON&lt;/strong&gt; formatında ele almak i&amp;ccedil;in &lt;strong&gt;json()&lt;/strong&gt; metodunun &amp;ccedil;ağırılması yeterli. Sanıyorum o g&amp;uuml;n olduk&amp;ccedil;a yorgun olmalıyım ki sadece &amp;ouml;rneği yapıp bilgisayarda kullanmışım. Deftere de fazla not almamışım. &lt;em&gt;(Dolayısıyla python ile bir REST servis yazıp bunu kullandıracağım bir makaleyi yazılacaklar listesine almam lazım)&lt;/em&gt;&lt;/p&gt;
&lt;h2&gt;Kriptografi ve One-Time Pad Algoritması [19-Haziran-2016]&lt;/h2&gt;
&lt;p&gt;Eğlenceli bir gece ge&amp;ccedil;irmişim. One-Time Pad algoritmasını &amp;ouml;ğrenmiş bunun python dili ile yazımını g&amp;ouml;steren tutorial'ı adım adım izlemişim. Aslında &lt;strong&gt;One-Time Pad&lt;/strong&gt; algoritmasını anlamakta epey zorlandığımı hatırlıyorum. Kağıt kalem ile ders &amp;ccedil;alışır gibi yazıp &amp;ccedil;izerek işi kurtarmıştım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_11.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin burak kelimesini şifrelemek istediğimizi d&amp;uuml;ş&amp;uuml;nelim. b alfadeki 1nci indise denk gelir. Diğer yandan &amp;ouml;rnek otp dosyasının birinci değeri 10dur. Buna g&amp;ouml;re 1+10 toplamının mod 26 değerine&amp;nbsp;bakılır ki bu değer 11dir. 11 ise alfabede yer alan l harfine karşılık gelmektedir. Bu şekilde ilerlendiğinde &lt;strong&gt;burak&lt;/strong&gt; kelimesi i&amp;ccedil;in &lt;strong&gt;lzaee&lt;/strong&gt; şeklinde şifrelenmiş bir i&amp;ccedil;erik &amp;uuml;retilecektir. Şifrelenen i&amp;ccedil;eriğin &amp;ccedil;&amp;ouml;z&amp;uuml;mlenmesi sırasında ise tam tersi durum s&amp;ouml;z konusudur. l harfinin alfabedeki indisi 11dir.&amp;nbsp;Şifreleme sırasında b harfi i&amp;ccedil;in 10 ekleme&amp;nbsp;yapıldığından tam tersi olacak şekilde 11-10 işleminin mod 26 değerine&amp;nbsp;bakılır. Bu değer de 1dir ve sıfır indisli alfabedeki b harfine denk gelmektedir. Bu şekilde şifreleme ve ters şifrleme işlemleri one-time pad algoritmasına g&amp;ouml;re yapılabilir.&lt;/p&gt;
&lt;p&gt;Kodlara gelirsek. &amp;Ouml;ncelikle one-time pad i&amp;ccedil;in gerekli sayı dizilerini i&amp;ccedil;eren rastgele dosyalara ihtiyacımız var.&amp;nbsp;Bu dosya &amp;uuml;retimi ve &amp;uuml;retilen dosya i&amp;ccedil;eriklerinin g&amp;ouml;r&amp;uuml;lmesi i&amp;ccedil;in aşağıdaki kod par&amp;ccedil;asından yararlanılabilir.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;import random

alfa="abcdefghijklmnopqrstuvwxyz"

def generateOtpFiles(fileCount,length):
	for sheet in range(fileCount):
		with open("otpFile"+str(sheet)+".txt","w") as f:
			for i in range(length):
				f.write(str(random.randint(0,26))+"\n")

def loadOtpFile(filename):
	with open(filename,"r") as f:
		content=f.read().splitlines()
		
	return content

generateOtpFiles(3,100)
print(loadOtpFile("otpFile1.txt"))&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_13.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;generateOtpFiles&lt;/strong&gt; metodu iki parametre alır. İlk parametre one-time pad i&amp;ccedil;in &amp;uuml;retilecek dosya adedini, ikinci parametre ise bu dosyalar i&amp;ccedil;erisine atılacak karışık sayı miktarını ifade eder. A&amp;ccedil;ılan ilk &lt;strong&gt;for&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; dosya sayısı kadar, ikinci for d&amp;ouml;ng&amp;uuml;s&amp;uuml; ise her bir dosyanın i&amp;ccedil;ereceği eleman sayısı kadar d&amp;ouml;ner. &lt;strong&gt;with open&lt;/strong&gt; ile başlayan kısımda verilen &lt;strong&gt;w&lt;/strong&gt; değeri, dosyanın yazma ama&amp;ccedil;lı olarak a&amp;ccedil;ılacağını belirtir. Dosya i&amp;ccedil;erisine 0 ile 26 arasında rastgele tamsayılar atamak i&amp;ccedil;in &lt;strong&gt;randint(0,26)&lt;/strong&gt; metodundan yararlanılır. Elde edilen sayısal değer &lt;strong&gt;f&lt;/strong&gt; ile ifade edilen dosyaya &lt;strong&gt;write&lt;/strong&gt; metodu ile yazılır.&lt;/p&gt;
&lt;p&gt;&amp;Uuml;retilen bir otp dosya i&amp;ccedil;eriğini g&amp;ouml;rmek i&amp;ccedil;inse &lt;strong&gt;loadOtpFile&lt;/strong&gt; metodundan yararlanılır(&lt;em&gt;Bu bir nevi test metodu olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir aslında)&lt;/em&gt; Yine &lt;strong&gt;with open&lt;/strong&gt; ile başlayan satırda dosyanın bu kez okuma ama&amp;ccedil;lı olarak a&amp;ccedil;ıldığı &lt;strong&gt;r&lt;/strong&gt;&amp;nbsp;anahtarı ile belirtilmektedir. Dosya i&amp;ccedil;eriğini okumak i&amp;ccedil;in başvurulan &lt;strong&gt;read&lt;/strong&gt; metodunu takiben &lt;strong&gt;splitlines&lt;/strong&gt; fonkisyonuna da &amp;ccedil;ağrı yapılır. Bu sayede ilgili dosya i&amp;ccedil;eriğinin satır bazında elde edilmesi ve bir listeye alınması sağlanmış olur.&amp;nbsp;Sıra geldi şifreleme ve &amp;ccedil;&amp;ouml;z&amp;uuml;mleme metodlarını yazmaya. Program kodunun son hali&amp;nbsp;aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;import random

letters="abcdefghijklmnopqrstuvwxyz"

def generateOtpFiles(fileCount,length):
	for sheet in range(fileCount):
		with open("otpFile"+str(sheet)+".txt","w") as f:
			for i in range(length):
				f.write(str(random.randint(0,26))+"\n")

def loadOtpContent(filename):
	with open(filename,"r") as f:
		content=f.read().splitlines()
		
	return content

def encryptMessage(message,otp):
	text=""
	for position,character in enumerate(message):
		if character not in letters:
			text+=character
		else:
			idx=(letters.index(character)+int(otp[position])) % 26
			text+=letters[idx]
	
	return text
			

def decryptMessage(message,otp):
	text=""
	for position,character in enumerate(message):
		if character not in letters:
			text+=character
		else:
			idx=(letters.index(character)-int(otp[position])) % 26
			text+=letters[idx]
	
	return text

generateOtpFiles(3,100)
otpContent=loadOtpContent("otpFile1.txt")

yourMessage=input("Please type your secret message").lower()
print("Your message is '{0}'".format(yourMessage))
em=encryptMessage(yourMessage,otpContent)
print("Encrypted message is '{0}'".format(em))
dc=decryptMessage(em,otpContent)
print("Decrypted message is '{0}'".format(dc))&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_14.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi kullanıcının girdiği mesaj &amp;ouml;nce şifrelenmiş ve sonra şifrelenen i&amp;ccedil;erikten tekrar elde edilmiştir. Kodda o g&amp;uuml;n i&amp;ccedil;in &amp;ouml;ğrenilecek pek &amp;ccedil;ok yeni kavram da &amp;ccedil;ıkmış bana. &amp;Ouml;rneğin ekrandan bilgi almak i&amp;ccedil;in &lt;strong&gt;input&lt;/strong&gt; fonksiyonundan yaralanıyoruz. Fonksiyon arkasından yapılan &lt;strong&gt;lower&lt;/strong&gt; &amp;ccedil;ağrısı ise girilen i&amp;ccedil;eriğin k&amp;uuml;&amp;ccedil;&amp;uuml;k harfe d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmesini sağlıyor. Nitekim alfabemiz k&amp;uuml;&amp;ccedil;&amp;uuml;k harflerden oluşmakta.&amp;nbsp;&lt;strong&gt;encryptMessage&lt;/strong&gt; ve &lt;strong&gt;decryptMessage&lt;/strong&gt; metodları şifrlenecek ve &amp;ccedil;&amp;ouml;z&amp;uuml;mlenecek i&amp;ccedil;erik ile kullanılacak one-time pad dosya i&amp;ccedil;eriğini parametre olarak alan fonksiyonlar. Her iki metod i&amp;ccedil;erisinde algoritmanın gereklilikleri yerine getiriliyor.&lt;/p&gt;
&lt;p&gt;&amp;Uuml;zerinde &amp;ccedil;alışılacak mesajın i&amp;ccedil;eridiği karakterlerin kendisi ve yerlerini dolaşabilmek i&amp;ccedil;in &lt;strong&gt;for&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;lerinin nasıl kullanıldığına dikkat edin. &lt;strong&gt;enumerate&lt;/strong&gt; metodu ile mesajlardaki karakterleri ve indis değerlerini &lt;strong&gt;key-value&lt;/strong&gt; &amp;ccedil;iftleri şeklinde ele alabiliyoruz. &lt;strong&gt;letters&lt;/strong&gt; isimli metin katarında yer alan bir lokasyona gitmek i&amp;ccedil;in &lt;strong&gt;index([indis değeri])&lt;/strong&gt; notasyonundan yaralanmaktayız. Benzer şekilde y&amp;uuml;klenen otp i&amp;ccedil;eriğindeki bir sayıya gitmek i&amp;ccedil;in de &lt;strong&gt;otp[position]&lt;/strong&gt; notasyonunu kullanmaktayız. O g&amp;uuml;n izlediğim bu tutorial sayesinde iyi bir pratik yapmış olduğumu g&amp;ouml;r&amp;uuml;yorum.&lt;/p&gt;
&lt;h2&gt;İkinci Kitap ile Python' a Doğru Kaymış G&amp;ouml;nl&amp;uuml;m [21 Haziran 2016]&lt;/h2&gt;
&lt;p&gt;Her ne kadar Raspberry Pi i&amp;ccedil;in bir &amp;ccedil;ok sens&amp;ouml;r ve malzeme almış olsam da sanıyorum ki python dili epeyce hoşuma gitmiş. Bu nedenle o g&amp;uuml;n python dilini anlatan ikinci kitaba başlamışım&lt;em&gt;(Ger&amp;ccedil;i diğer kitapta kaldığım kameranın Raspberry Pi'den kontrol&amp;uuml; ile ilişkili kısmı kamerayı alamadığım i&amp;ccedil;in beklemeye almak zorunda kalmamın da bunda etkisi olmuş olabilir)&lt;/em&gt; İlk b&amp;ouml;l&amp;uuml;mlerde aşina olduğum kısımları hızlıca ge&amp;ccedil;tikten sonra &lt;strong&gt;python&lt;/strong&gt; i&amp;ccedil;erisindeki temel veri t&amp;uuml;rlerini kaleme almışım. Ne yazık ki gece yaptığım &amp;ccedil;alışmam S(h)arp Efe tarafında sabote edilmiş ve o da kendi bakış a&amp;ccedil;ısından &amp;ccedil;alışma notlarına ekler ilave etmiş.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_15.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sadede gelecek olursak temel veri t&amp;uuml;rlerini şu şekilde &amp;ouml;zetleyebiliriz.&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_16.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabii en &amp;ccedil;ok dikkatimi &amp;ccedil;eken nokta kompleks sayıları doğrudan ifade eden bir t&amp;uuml;r&amp;uuml;n olması ki şu şekilde sanal ve ger&amp;ccedil;el k&amp;ouml;klerini ele alıp kullanabiliriz.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;kompleksX=3.14+4j
print(kompleksX.real)
print(kompleksX.imag)
kompleksY=-3-8.125j
kompleksZ=kompleksX+kompleksY
print(kompleksZ)&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_17.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim&amp;nbsp;temel veri t&amp;uuml;rleri ile ilgili diğer notlara.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Metinsel ifadeler i&amp;ccedil;in kullanılan &lt;strong&gt;String&lt;/strong&gt; veri t&amp;uuml;r&amp;uuml; &lt;strong&gt;immutable&lt;/strong&gt; bir tiptir. Bir başka deyişle string olarak ifade edilen bir karakter dizisinin elemanlarını değiştiremeyiz.&lt;/li&gt;
&lt;li&gt;Benzer şekilde &lt;strong&gt;Tuple&lt;/strong&gt; veri t&amp;uuml;r&amp;uuml; de &lt;strong&gt;Immutable&lt;/strong&gt;' dır. Yani oluşturulduktan sonra doğrudan elemanlarını değiştiremeyiz. Ancak istisnai durumlar da vardır. S&amp;ouml;z gelimi &lt;strong&gt;Tuple&lt;/strong&gt;' ın bir elemanı &lt;strong&gt;List&lt;/strong&gt; tipinden olabilir. Listeler &lt;strong&gt;Mutable&lt;/strong&gt;&amp;nbsp;dır. Yani elemanları değiştirilebilir. Dolayısıyla bir &lt;strong&gt;Tuple&lt;/strong&gt; i&amp;ccedil;erisinde tanımlı listenin elemanlarında değişiklik yapabiliriz.&lt;/li&gt;
&lt;li&gt;Listeler &amp;ccedil;oğunlukla farklı tipteki elemanları ardışıl olarak saklamak i&amp;ccedil;in kullanılan veri t&amp;uuml;r&amp;uuml;d&amp;uuml;r. &lt;strong&gt;Mutable&lt;/strong&gt;' dır. Yani elemanlarını değiştirebiliriz. Elamanları diğer &lt;strong&gt;python&lt;/strong&gt; veri t&amp;uuml;rlerinden her hangibirisi olabilir.&amp;nbsp;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Sets&lt;/strong&gt; olarak ifade edilen k&amp;uuml;meler tekrarlı elemanlar i&amp;ccedil;ermeyen dizilerdir. Her ne kadar dizi gibi olduklarını not almış olsam da elemanlarına &lt;strong&gt;indis&lt;/strong&gt; operat&amp;ouml;r&amp;uuml; ile erişmek m&amp;uuml;mk&amp;uuml;n değildir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Dictionaries&lt;/strong&gt; &lt;strong&gt;Mutable&lt;/strong&gt; tiplerden bir diğeridir. Elemanlar &lt;strong&gt;key-value&lt;/strong&gt; &amp;ccedil;iftleri şeklinde saklanmaktadır. Anahtar değerleri &lt;strong&gt;benzersiz&lt;em&gt;(Unique)&lt;/em&gt;&lt;/strong&gt; olmak zorundadır.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;O g&amp;uuml;n &amp;ouml;rnek kod par&amp;ccedil;alarını deneyerek &amp;ccedil;alışmalarıma devam etmişim.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;#En basit haliyle bir liste tanımı. Sondan bir &amp;ouml;nceki eleman k&amp;uuml;me son eleman bir Tuple'dır.
someList=[100,-90,"burk",True,False,3.1415,
			{"one","two","five","six"},
			("burki",1195,"Math.Eng")]
print(someList)

#En basit haliyle bir Tuple tanımı
person=(90001,"burak selim","şenyurt",1.78,"White")
print(person)

#En basit haliyle k&amp;uuml;me tanımlaması. &amp;Ccedil;ıktıya dikkat edilecek olursa tekrar eden elemanların teke indirildiği g&amp;ouml;r&amp;uuml;lebilir.
someSet={3,4,5,1,2,18,16,3,3,2,1,-1,91}
print(someSet)
print("3 k&amp;uuml;me i&amp;ccedil;inde mi? {}".format("Evet" if 3 in someSet else "Hayır"))
#Bir eleman listesinin tekilleştirilmesi istenirse en basit haliyle k&amp;uuml;melerden yararlanılabilir. &amp;Ouml;rneğin aşağıdaki metinsel ifade i&amp;ccedil;erisinde ge&amp;ccedil;en harfleri tekil olarak elde etmek istersek
motto="This is my last world"
mottoSet=set(motto)
print(mottoSet)
#K&amp;uuml;melerle aynı matematikteki gibi k&amp;uuml;me işlemleri yapılabilir
set1={1,2,3,4,6,8,10,12}
set2={4,5,6,7,8,9,10}
print("&amp;Ccedil;ıkartma-&amp;gt; set1-set2 = ",set1-set2)
print("Birleşim-&amp;gt; set1|set2 = ",set1|set2)
print("Kesişim-&amp;gt; set1&amp;amp;set2 = ",set1&amp;amp;set2)
print("Kesişim Dışında Kalanlar-&amp;gt; set1^set2 = ",set1^set2)

#En basit haliyle dictionary tanımlaması
studentNotes={"klara":90,"norman":100,"burk":38,"tubi":85}
print("Klara'nın notu",studentNotes["klara"])&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_24.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Metodlara Bir Bakıp &amp;Ccedil;ıkmışım [23 Haziran 2016]&lt;/h2&gt;
&lt;p&gt;O g&amp;uuml;n metodlar ile ilgili bir şeyler yapmışım.&amp;nbsp;Aslında 17 Hazirandaki &lt;a href="/post/bu-yaz-macerasinin-adi-python.aspx" target="_blank"&gt;"Bu Yaz Macerasının Adı Python"&lt;/a&gt; isimli yazımda metodlara biraz da olsa değinmişim. Ancak kitabı takip etmeye devam ettiğim i&amp;ccedil;in tekrar mahiyetinde de olsa bazı notlar da almışım. Hatta yeni bilgiler de edinmişim. &amp;Ouml;rneğin değişken uzunluk parametre alan bir metod &amp;uuml;zerinde &amp;ccedil;alışmışım&lt;em&gt;(Yani C# tarafındaki params kullanımını işlemişim)&amp;nbsp;&lt;/em&gt;pass kullanımı ile NotImplementedException deneyimi yaşamış, Default Method Arguments ile metod parametrelerinde varsayılan değer kullanımına bakmışım. Kısaca aşağıdaki kodları &amp;ccedil;alışmışım.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;'''
Aşağıdaki kod satırlarında metodlara ait şu kavramlara yer verilmektedir.
pass
varsayılan parametre değerleri
değişken uzunluklu metod parametreleri
lambda kullanımı
'''

#bir metodun i&amp;ccedil;eriği sonradan tamamlanacaksa kullanılabilir. Biraz NotImplementedException vari bir kullanım
def getPlayerStatistic(playerName):
	pass

#metod arg&amp;uuml;manları isim verilerek kullanılabilir
def doConnect(port,serverName):
	#do something
	print("Connection for {}:{} is ok".format(serverName,port))
	return False
	
#metod parametrelerine varsayılan ilk değerler verebiliriz.
def findLocation(playerName,city="Paris"):
	#do something
	print(city,"is scanning for",playerName)

# C# taki params kullanımı burada da var ki
def createPlayer(name,city,*properties):
	print("{} from {}\n".format(name,city))
	prop=[]
	for p in properties:
		prop.append(p)
		
	print(prop)
	print("*"*10)

# lambda kullanımı. Bunlar tek satırlık metodlar olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilirler. C# taki =&amp;gt; ve anonymous metodları hemen aklınıza gelmiştir.
sum=lambda x,y:x+y
print(sum(4,5))

getPlayerStatistic("burk")
result=doConnect(port="8080",serverName="192.168.1.107")
print("Connection is {} success".format("" if result else "not"))
findLocation("burk")
findLocation("tubi","new york")
createPlayer("burki","istanbul","black","master",True,1685)&lt;/pre&gt;
&lt;p&gt;ve &amp;ccedil;alışma zamanı sonu&amp;ccedil;ları.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_21.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;String Veri Yapısı ile Eğlenceli Dakikalar [25 Haziran Cumartesi]&lt;/h2&gt;
&lt;p&gt;Bug&amp;uuml;n &lt;strong&gt;string&lt;/strong&gt; veri yapısını kullanarak eğlenceli kod par&amp;ccedil;alarını ele almışım. Hatta &lt;strong&gt;string&lt;/strong&gt; tipinin pek &amp;ccedil;ok metodunu sonradan denemem i&amp;ccedil;in de not d&amp;uuml;şm&amp;uuml;ş&amp;uuml;m&lt;em&gt;(Niye g&amp;ouml;bekli bir karakter &amp;ccedil;izdiğimi ben de bilemiyorum sayın seyirciler)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/notes_19.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Peki ya kodlar?&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;motto="this is gonna be the BesT Day of my liFe"

#B&amp;uuml;y&amp;uuml;k harfe &amp;ccedil;evirme ve metin uzunluğunu bulma
print("{} (length={})".format(motto.upper(),len(motto)))

#İlk d&amp;ouml;rt karakteri yazdırma
print(motto[:4])

#Metni tersten yazdırma
print(motto[::-1])

#Son 4 karakter hari&amp;ccedil; t&amp;uuml;m metin
print(motto[:-4])

#this ile başlayıp başlamadığını bulma
print(motto.startswith("this"))

#C&amp;uuml;mlenin ilk harfini b&amp;uuml;y&amp;uuml;k harfe &amp;ccedil;evirme
print(motto.capitalize())

#Boşluk karakterine g&amp;ouml;re metni kelimelere ayırma
words=motto.split(" ")
for w in words:
	print(w)

#4&amp;uuml;nc&amp;uuml;den 7nciye kadar
print(motto[4:7])

#B&amp;uuml;y&amp;uuml;k harfleri k&amp;uuml;&amp;ccedil;&amp;uuml;k, k&amp;uuml;&amp;ccedil;&amp;uuml;k harfleri b&amp;uuml;y&amp;uuml;k harfe &amp;ccedil;evirme
print(motto.swapcase())

#İ&amp;ccedil;erik sayısal mı?
print(motto.isalnum())
print("450048".isalnum())

#Metin i&amp;ccedil;inden karakter değiştirme
newMotto=motto.replace(" ","_")
print(newMotto)

# in operat&amp;ouml;r&amp;uuml; ile bir kelimeyi metin i&amp;ccedil;inde arama
print("is there a 'gonna'? {}".format("Yes" if "gonna" in motto else "No"))&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_23.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu arada string t&amp;uuml;r&amp;uuml; ile ilişkili olarak &lt;a href="http://www.tutorialspoint.com/python/python_strings.htm" target="_blank"&gt;şu adresten de&lt;/a&gt; yararlanmaya ve bilgi almaya &amp;ccedil;alışmışım.&lt;/p&gt;
&lt;h2&gt;B&amp;uuml;y&amp;uuml;l&amp;uuml; Kodlar [27 Haziran 2016]&lt;/h2&gt;
&lt;p&gt;O g&amp;uuml;n okuduğum kitapta &amp;ccedil;ok enteresan kod par&amp;ccedil;alarına rastlamışım ve bunları teker teker denemişim. Kod par&amp;ccedil;aları bana sihirli gelmiş olacak ki bir de sihirbaz şapkası &amp;ccedil;izmeye &amp;ccedil;alışmışım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_20.gif" alt="" /&gt;&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;import random

#rastgele sayı &amp;uuml;retmenin uzun bir yolu
numbers=[]
for i in range(10):
	numbers.append(random.randint(10,100))
print(numbers)

#ve rastgele sayı &amp;uuml;retmenin tek satırlık kısa yolu
numbers=[random.randint(10,100) for i in range(10)]
print(numbers)

#0 ile 100 arasında 7 ile b&amp;ouml;l&amp;uuml;nebilen sayıları listeye almanın uzun yolu
points=[]
for i in range(101):
	if  i%7==0:
		points.append(i)
print(points)

#0 ile 100 arasındaki sayıları listeye almanın kısa yolu
points=[i for i in range(101) if i%7==0]
print(points)

#iki listenin i&amp;ccedil; i&amp;ccedil;e iki d&amp;ouml;ng&amp;uuml; ile ele alınmasının uzun yolu
colorList=["green","gray","red","blue"]
players=["burki","tubi","tom"]
combination=[]
for c in colorList:
	for p in players:
		combination.append(c+" "+p)
print(combination)

#iki listenin i&amp;ccedil; i&amp;ccedil;e iki d&amp;ouml;ng&amp;uuml; ile ele alınmasının kısa yolu
combination=[c+" "+p for c in colorList for p in players]
print(combination)&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnekte 3 farklı operasyon&amp;nbsp;s&amp;ouml;z konusu. İlk olarak 10 ile 100 arasında rastgele tamsayılar &amp;uuml;retip bunları bir listeye alıyoruz. İkinci &amp;ouml;rnekte 0 ile 100 arasındaki sayılardan 7 ile b&amp;ouml;l&amp;uuml;nebilenlerini &amp;ccedil;ekiyoruz. &amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; ve son &amp;ouml;rnekte ise iki farklı listenin t&amp;uuml;m ikili kombinasyonlarını &amp;ccedil;ıkartmaktayız. &amp;Ouml;rneklerin&amp;nbsp;uzun ve kısa versiyonlar var. Kısa versiyonlarda k&amp;ouml;şeli parantezler i&amp;ccedil;erisinde yazılan ifadeler beni olduk&amp;ccedil;a etkiledi. K&amp;ouml;şeli parantezler i&amp;ccedil;erisindeki ifadeleri 3 ana par&amp;ccedil;a halinde d&amp;uuml;ş&amp;uuml;nebiliriz.&amp;nbsp;İlk par&amp;ccedil;ada eşitliğin sol tarafına atanacak değer ifade edilir.&amp;nbsp;Sonrasında ise bir for d&amp;ouml;ng&amp;uuml;s&amp;uuml; ve bunu takiben de eğer gerekliyse koşullu bir ifadeye yer alır. Bu sayede tek satırda bir sayı dizisini dolaşıp belirli kriterlere uyanlar i&amp;ccedil;in işlemleri kısaca&amp;nbsp;yaptırabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/07/notes_22.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alışmalarım bu tarih itibariyle sonlanmış. Nitekim izin d&amp;ouml;nemi gelmiş. Şimdi kaldığımız yerden devam edebilirim. Bu uzun yazıda Python notlarımı elektronik ortama almaya &amp;ccedil;alıştım. Umarım python severler i&amp;ccedil;in yararlı bir yazı olmuştur. Bir başka makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-07-18 21:30:00</pubDate>
  <slug>raspberry-pi-ve-python-calisma-notlarim</slug>
  <tags>
    <tag>raspberry-pi</tag>
    <tag>python</tag>
    <tag>temel-kavramlar</tag>
    <tag>internet-of-things</tag>
    <tag>io-t</tag>
  </tags>
  <categories>
    <category>python</category>
    <category>Raspberry Pi</category>
  </categories>
</post>