<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tasarım Prensipleri - Interface Segregation</title>
  <description>Bir süredir pek çok nesne yönelimli yazılım disiplininde önem arz eden ve kullanılan Tasarım Prensiplerini(Design Principles) incelemeye ve öğrendiklerimi sizlere aktarmaya çalışıyorum. Şu ana kadar pek çok prensibi inceledik ve kısaltmalarına tanık olduk.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir s&amp;uuml;redir pek &amp;ccedil;ok nesne y&amp;ouml;nelimli yazılım disiplininde &amp;ouml;nem arz eden ve kullanılan &lt;strong&gt;Tasarım Prensiplerini(Design Principles) &lt;/strong&gt;incelemeye ve &amp;ouml;ğrendiklerimi sizlere aktarmaya &amp;ccedil;alışıyorum. Şu ana kadar pek &amp;ccedil;ok prensibi inceledik ve kısaltmalarına tanık olduk.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;LCP (Loose Coupling Principle)&lt;/li&gt;
&lt;li&gt;OCP (Open Closed Principle)&lt;/li&gt;
&lt;li&gt;SRP (Single Responsibility Principle)&lt;/li&gt;
&lt;li&gt;LSP (Liskov Substituation Principle)&lt;/li&gt;
&lt;li&gt;DIP (Dependency Inversion Principle)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Elbetteki &amp;ouml;nemli olan, kısaltmalarının karşılıklarını bilmek değil&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; , s&amp;ouml;z konusu prensiplerin farkına vararak yazılım geliştirmek yada geliştirilen yazılım i&amp;ccedil;erisinde bu prensiplerin uygulanabileceği, uygulanması gereken yerleri tespit edebilmektir. Bu hususları dikkate alarak ara sıra tasarım prensiplerini tekrar etmeye &amp;ouml;zen g&amp;ouml;stererekten, yeni tasarım prensibini incelemeye başlayabiliriz. &lt;strong&gt;Interface Segregation Principle(ISP) &lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok hızlı bir giriş olacak ama konuya aşağıdaki sınıf diagramında g&amp;ouml;r&amp;uuml;len tipleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alarak başlayalım&lt;em&gt;.(Her zamanki gibi ilkenin &amp;ouml;zl&amp;uuml; s&amp;ouml;z&amp;uuml;n&amp;uuml; kavrayabilmek i&amp;ccedil;in &amp;ouml;rnekle başlamakta yarar olduğu kanısındayım)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f7%2fblg40_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Kod tarafından baktığımızda ise;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt; interface IComponent
    {
        Guid ComponentId { get; }

        void Initialize();
        void Draw();
        void Render();
    }

    public class WinButton
    : IComponent
    {
        #region IComponent Members

        public Guid ComponentId
        {
            get { return Guid.NewGuid(); }
        }

        public void Initialize()
        {
            Console.WriteLine("Windows Button başlangı&amp;ccedil; işlemleri");
        }

        public void Draw()
        {
            Console.WriteLine("Ekrana &amp;ccedil;izdirme işlemleri");
        }

        public void Render()
        {
            throw new NotImplementedException();
        }

        #endregion
    }

    class WebButton
        :IComponent
    {
        #region IComponent Members

        public Guid ComponentId
        {
            get { return Guid.NewGuid(); }
        }

        public void Initialize()
        {
            Console.WriteLine("Web Button başlangı&amp;ccedil; işlemleri");
        }

        public void Draw()
        {
            throw new NotImplementedException();
        }

        public void Render()
        {
            Console.WriteLine("HTML Render işlemleri");
        }

        #endregion
    }&lt;/pre&gt;
&lt;p&gt;Aslında b&amp;ouml;ylesine k&amp;ouml;t&amp;uuml; bir tasarım ile konuya başlamak istemezdim ancak &lt;strong&gt;ISP&lt;/strong&gt; ilkesinin neyi &amp;ouml;ğ&amp;uuml;tlediğini bilmek adına bu yeterli bir yaklaşımdır. Hedefte bir sistemin par&amp;ccedil;ası olan g&amp;ouml;rsel bileşenlerin uygulaması gereken kuralları bildiren &lt;strong&gt;IComponent&lt;/strong&gt; isimli aray&amp;uuml;z tipi bulunmaktadır. G&amp;ouml;rsel bileşenler olarak &amp;ouml;rneğimizde, &lt;strong&gt;Windows&lt;/strong&gt; ve &lt;strong&gt;Web&lt;/strong&gt; tabanlı uygulamalardaki Button kontrolleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınmaktadır. Ancak bir &lt;strong&gt;windows&lt;/strong&gt; kontrol&amp;uuml;n&amp;uuml;n temel olarak ekrana &amp;ccedil;izdirilmesi ile, bir Web kontrol&amp;uuml;n&amp;uuml;n istemci tarafına &lt;strong&gt;HTML&lt;/strong&gt; i&amp;ccedil;eriği olarak &lt;strong&gt;Render&lt;/strong&gt; edilmesi iki farklı ve ap ayrı fonksiyonelliktir.&lt;/p&gt;
&lt;p&gt;Dolayısıyla ISP&amp;nbsp;ilkesine bu tespitten itibaren ters d&amp;uuml;ş&amp;uuml;lmeye başlanmaktadır. Nitekim, &lt;strong&gt;IComponent&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulayan &lt;strong&gt;WinButton&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde yer alan&amp;nbsp;&lt;strong&gt;Render&lt;/strong&gt; metodunun kesin olarak implemente &lt;span style="text-decoration: underline;"&gt;edilmemesi&lt;/span&gt; gerekir. Hatta implemente edilmesi &lt;span style="text-decoration: underline;"&gt;anlamsızdır&lt;/span&gt;. Bu nedenle &amp;ccedil;&amp;ouml;z&amp;uuml;m olarak i&amp;ccedil;erisinden &lt;strong&gt;NotImplementedException&lt;/strong&gt; istisnasının fırlatıldığını g&amp;ouml;rmekteyiz. Diğer taraftan benzer durum &lt;strong&gt;WebButton&lt;/strong&gt; bileşeni i&amp;ccedil;inde ge&amp;ccedil;erlidir. &amp;Ouml;yleki &lt;strong&gt;Web&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; i&amp;ccedil;in &lt;strong&gt;Render&lt;/strong&gt; işlemi &amp;ouml;nemli iken, &lt;strong&gt;Draw&lt;/strong&gt; isimli fonksiyonelliğin &lt;span style="text-decoration: underline;"&gt;ger&amp;ccedil;ekleştirilmemesi&lt;/span&gt; gerekir. Ayrıca &lt;strong&gt;IComponent&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;ne yeni eklentiler yapılmak istendiğinde, &lt;strong&gt;Liskov Substitution&lt;/strong&gt; ilkesine ters d&amp;uuml;şebilecek durumlarında oluşması s&amp;ouml;z konusudur. (Bknz : &lt;a title="Tasarım Prensipleri : Liskov Substitution" href="/post/Tasarim-Prensipleri-Liskov-Substitution.aspx"&gt;Tasarım Prensipleri : Liskov Substitution&lt;/a&gt;&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; ) Peki bu sorunlar bize neyi g&amp;ouml;stermektedir?&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;IComponent&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulayan tipler, aslında kendi i&amp;ccedil;lerinde kullanmayacakları fonksiyonellikleri uyarlamak zorunda kalmışlardır. &lt;strong&gt;NotImplementedException&lt;/strong&gt; ile istisna fırlatılmış olsa bile... İşte &lt;strong&gt;Interface Segregation&lt;/strong&gt; ilkesi, &lt;strong&gt;bir istemcinin kullanmayacağı aray&amp;uuml;z fonksiyonelliklerini hi&amp;ccedil; bir şekilde uygulamaması gerektiğini &lt;/strong&gt;belirtmektedir. Buda tahmin edileceği &amp;uuml;zere s&amp;ouml;z konusu fonksiyonellikleri farklı aray&amp;uuml;zlere b&amp;ouml;lerek m&amp;uuml;mk&amp;uuml;n olabilir. Yani, yukarıda tasarlamış olduğumuz sistemi aşağıdaki hale getirerek ISP ilkesine sadık kalmayı başarabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f7%2fblg40_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Kod i&amp;ccedil;eriğimizi ise şu şekilde g&amp;uuml;ncellemeliyiz;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;interface IComponent
    {
        Guid ComponentId { get; }

        void Initialize();
    }
    interface IWebComponent
    {
        void Render();
    }
    interface IWinComponent
    {
        void Draw();
    }

    public class WinButton
    : IComponent,IWinComponent
    {
        #region IComponent Members

        public Guid ComponentId
        {
            get { return Guid.NewGuid(); }
        }

        public void Initialize()
        {
            Console.WriteLine("Windows Button başlangı&amp;ccedil; işlemleri");
        }

        #endregion

        #region IWinComponent Members

        public void Draw()
        {
            Console.WriteLine("Ekrana &amp;ccedil;izdirme işlemleri");
        }

        #endregion
    }

    class WebButton
        : IComponent,IWebComponent
    {
        #region IComponent Members

        public Guid ComponentId
        {
            get { return Guid.NewGuid(); }
        }

        public void Initialize()
        {
            Console.WriteLine("Web Button başlangı&amp;ccedil; işlemleri");
        }

        #endregion

        #region IWebComponent Members

        public void Render()
        {
            Console.WriteLine("HTML Render işlemleri");
        }

        #endregion
    }&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;Web&lt;/strong&gt; tarafını ilgilendiren &lt;strong&gt;Render&lt;/strong&gt; fonksiyonu &lt;strong&gt;IWebComponent&lt;/strong&gt; isimli aray&amp;uuml;zde, Windows tarafını ilgilendiren &lt;strong&gt;Draw&lt;/strong&gt; metodu ise &lt;strong&gt;IWinComponent&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; i&amp;ccedil;erisinde ele alınmıştır. Artık, ortak olan &amp;uuml;yelerin IComponent, Web tarafını ilgilendirenlerin IWebComponent ve Windows tarafını ilgilendirenlerinde IWinComponent i&amp;ccedil;erisinde toplanması sağlanarak ISP ilkesinin korunması sağlanabilir.&amp;nbsp;Hatta s&amp;ouml;z konusu senaryoda &lt;strong&gt;IWebComponent &lt;/strong&gt;ve &lt;strong&gt;IWinComponent &lt;/strong&gt;aray&amp;uuml;zlerinin &lt;strong&gt;IComponent&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;nden t&amp;uuml;remesi dahi&amp;nbsp;d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f7%2fblg40_3.jpg" alt="" width="70" height="111" /&gt;Bu ilke ile ilişkili olaraktan internet ve basılı kaynaklarda &amp;ccedil;ok &amp;ccedil;ok g&amp;uuml;zel &amp;ouml;rnekler yer almaktadır. &amp;Ouml;rneğin &lt;strong&gt;Object Oriented Design&lt;/strong&gt; isimli sitede bir şirketin &amp;ccedil;alışanları g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınmıştır. &amp;Ccedil;alışanlar yemek yiyen insanlar ve yemek yemeyip s&amp;uuml;rekli &amp;ccedil;alışan Robotlardan oluşmaktadır. &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Ancak ilk etapta tasarlanan herşeyi i&amp;ccedil;inde barındıran &lt;strong&gt;şişman aray&amp;uuml;z(Fat Interface),&lt;/strong&gt; yemek yeme fonksiyonunu barındırdığı i&amp;ccedil;in, Robot' larında gerekmediği halde s&amp;ouml;z konusu işlevselliği uygulaması zorunlu olmuştur ki bu andan itibaren &lt;strong&gt;ISP&lt;/strong&gt; ilkesine ters bir durum oluşmaktadır. Bu yazıyıda fikir vermesi a&amp;ccedil;ısından incelemenizi tavsiye ederim.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir ilkenin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f7%2fISP.rar"&gt;ISP.rar (31,41 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-07-02 01:16:00</pubDate>
  <slug>Tasarc4b1m-Prensipleri-Interface-Segregation</slug>
  <tags>
    <tag>design-principles</tag>
  </tags>
  <categories>
    <category>Tasarım Prensipleri(Design Principles)</category>
  </categories>
</post>