<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Workflow Services - Custom Authorization</title>
  <description>Bu yazımızda .Net Framework 4.0 tarafında geliştireceğimiz Workflow Service' lerde yetkilendirme işlemini nasıl sağlayabileceğimizi görmeye çalışacağız.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f2%2fblg145_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Aş&amp;ccedil;ılık zevkli ama bir o kadarda zor bir zanaattır. Hatta bazen o kadar zor bir zanaat olur ki, aşcının aldığı maaşı pek &amp;ccedil;ok yazılımcı iki yılda kazanamaz. Tabi bu tip aş&amp;ccedil;ılar işin ehli olan kişilerdir. Heleki tek bir mutfak değilde d&amp;uuml;nya mutfağının se&amp;ccedil;kin olanlarına ait becerileri bulunanlara paha bi&amp;ccedil;ilemez. T&amp;uuml;rk Mutfağından Japon mutfağına, Meksika yemeklerinden İtalyan spesiyallerine, Fransız tatlılarından Okyanus deniz &amp;uuml;r&amp;uuml;nlerine&amp;nbsp;ve daha nicelerine...&lt;/p&gt;
&lt;p&gt;Tabi bir aş&amp;ccedil;ı i&amp;ccedil;in olmassa olmazlardan birisi de yemeği i&amp;ccedil;in gerekli olan malzemelerin kalitesidir. Kaliteli zeytinyağı, hamur ve baharat&amp;nbsp;ile yapılan spagettinin, kalitesiz olanlar ile yapılanı arasında dağlar kadar fark olabilir. Spagetti demişken bu g&amp;uuml;nk&amp;uuml; yazımızda neler yapacağımıza da bir bakalım dilerseniz. Aş&amp;ccedil;ı olarak bu g&amp;uuml;n elimizde zor bir tarif var. Malzemelerimiz belli ama pişecek olan yemeğin yapımı biraz zahmetli. Haydi gelin hi&amp;ccedil; vakit kaybetmeden &amp;ouml;nl&amp;uuml;ğ&amp;uuml;m&amp;uuml;z&amp;uuml; takıp klavyenin başına ge&amp;ccedil;elim.&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu yazımızda &lt;strong&gt;.Net Framework 4.0&lt;/strong&gt; tarafında geliştireceğimiz &lt;strong&gt;Workflow Service'&lt;/strong&gt; lerde yetkilendirme işlemini nasıl sağlayabileceğimizi g&amp;ouml;rmeye &amp;ccedil;alışacağız. Ne yazık ki &lt;strong&gt;Authorization&lt;/strong&gt; işlemini kolaylaştırmak adına hazır bir yapı mevcut değil. Bu nedenle biraz kodlama yapmamız&amp;nbsp;ve &amp;ccedil;alışma zamanının işleyişine bu şekilde m&amp;uuml;dahale etmemiz gerekiyor. Hatta yapacağımız &amp;ouml;zelleştirme &amp;ouml;ylesine etkili olacak ki, aradan &lt;strong&gt;Doğrulamayı(Authentication)&lt;/strong&gt; bile &amp;ccedil;ıkaracağız farkına varmadan. &lt;img title="Surprised" src="/editors/tiny_mce3/plugins/emotions/img/smiley-surprised.gif" alt="Surprised" border="0" /&gt;&amp;nbsp;Ama &amp;ouml;nce yemek i&amp;ccedil;in gerekli malzemelerimizin neler olduğuna bir bakalım.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Bir adet &lt;strong&gt;Workflow Service.&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;Bir adet konfigurasyon dosyası&lt;strong&gt;(Web.config).&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;System.IdentityModel.dll&lt;/strong&gt; referansı.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;ServiceAuthorizationManager&lt;/strong&gt; t&amp;uuml;revli bir sınıf.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Windows&lt;/strong&gt; &amp;uuml;zerinde tanımlanmış roller ve bu roller i&amp;ccedil;erisinde yer alan kullanıcılar.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Tabiki malzemeleri tedarik etmek yeterli değil. Birde tarifi bilmek lazım &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;&amp;Ouml;ncelikli olarak yetkilendirme işlemini &amp;uuml;stelenen bir sınıf yazmamız gerekiyor. &amp;Ccedil;ok doğal olarak bu sınıfın &lt;strong&gt;Workflow Service&lt;/strong&gt; &amp;ccedil;alışma zamanı tarafından değerlendirilebilmesi i&amp;ccedil;in konfigurasyon dosyası &amp;uuml;zerinde de gerekli d&amp;uuml;zenlemeleri yapmalıyız. Sonrasında ise işi istemci tarafından gelen taleplere bırakıyor olacağız. İşe ilk olarak aşağıdaki gibi bir &lt;strong&gt;Workflow Service&lt;/strong&gt; projemiz olduğunu varsayarak başlayalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg145_Wf.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Calculus.xamlx&lt;/strong&gt; i&amp;ccedil;eriğimiz ise aşağıdaki gibidir;(&lt;em&gt;Sadece Sequence elementi i&amp;ccedil;eriği verilmiştir)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;p:Sequence DisplayName="Sequential Service" sad:XamlDebuggerXmlReader.FileName="D:\Projects\Workflow Foundation 4.0\UsingCustomAuthorization\UsingCustomAuthorization\CalculusService.xamlx" sap:VirtualizedContainerService.HintSize="277,336"&amp;gt;
    &amp;lt;p:Sequence.Variables&amp;gt;
      &amp;lt;p:Variable x:TypeArguments="CorrelationHandle" Name="handle" /&amp;gt;
      &amp;lt;p:Variable x:TypeArguments="x:Int32" Name="X" /&amp;gt;
      &amp;lt;p:Variable x:TypeArguments="x:Int32" Name="Y" /&amp;gt;
      &amp;lt;p:Variable x:TypeArguments="x:Int32" Name="Sum" /&amp;gt;
    &amp;lt;/p:Sequence.Variables&amp;gt;
    &amp;lt;sap:WorkflowViewStateService.ViewState&amp;gt;
      &amp;lt;scg3:Dictionary x:TypeArguments="x:String, x:Object"&amp;gt;
        &amp;lt;x:Boolean x:Key="IsExpanded"&amp;gt;True&amp;lt;/x:Boolean&amp;gt;
      &amp;lt;/scg3:Dictionary&amp;gt;
    &amp;lt;/sap:WorkflowViewStateService.ViewState&amp;gt;
    &amp;lt;Receive x:Name="__ReferenceID0" CanCreateInstance="True" DisplayName="ReceiveRequest" sap:VirtualizedContainerService.HintSize="255,86" OperationName="SumOp" ServiceContractName="p1:IService"&amp;gt;
      &amp;lt;Receive.CorrelatesOn&amp;gt;
        &amp;lt;MessageQuerySet /&amp;gt;
      &amp;lt;/Receive.CorrelatesOn&amp;gt;
      &amp;lt;Receive.CorrelationInitializers&amp;gt;
        &amp;lt;RequestReplyCorrelationInitializer CorrelationHandle="[handle]" /&amp;gt;
      &amp;lt;/Receive.CorrelationInitializers&amp;gt;
      &amp;lt;ReceiveParametersContent&amp;gt;
        &amp;lt;p:OutArgument x:TypeArguments="x:Int32" x:Key="XValue"&amp;gt;[X]&amp;lt;/p:OutArgument&amp;gt;
        &amp;lt;p:OutArgument x:TypeArguments="x:Int32" x:Key="YValue"&amp;gt;[Y]&amp;lt;/p:OutArgument&amp;gt;
      &amp;lt;/ReceiveParametersContent&amp;gt;
    &amp;lt;/Receive&amp;gt;
    &amp;lt;SendReply Request="{x:Reference __ReferenceID0}" DisplayName="SendResponse" sap:VirtualizedContainerService.HintSize="255,86"&amp;gt;
      &amp;lt;SendParametersContent&amp;gt;
        &amp;lt;p:InArgument x:TypeArguments="x:Int32" x:Key="SumResult"&amp;gt;[X + Y]&amp;lt;/p:InArgument&amp;gt;
      &amp;lt;/SendParametersContent&amp;gt;
    &amp;lt;/SendReply&amp;gt;
  &amp;lt;/p:Sequence&amp;gt;&lt;/pre&gt;
&lt;p&gt;Aslında &lt;strong&gt;Calculus&lt;/strong&gt; isimli &lt;strong&gt;Workflow Service&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &lt;strong&gt;SumOp&lt;/strong&gt; isimli operasyonun g&amp;ouml;revi &amp;ccedil;ok basit ve bellidir. &lt;strong&gt;Int32&lt;/strong&gt; tipinden iki sayısal değerin toplanması ve sonucunun istemci tarafına geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi. Bizim hedefimiz&amp;nbsp;sadece yetkisi olan kişilerin bu operasyonu &amp;ccedil;alıştırmasıdır. Bu durumda g&amp;uuml;venlik ile ilişkili olarak yetki kontrol&amp;uuml;n&amp;uuml;n &amp;ouml;zel bir sınıf tarafından yapılması gerekmektedir. S&amp;ouml;z konusu sınıf &lt;strong&gt;System.ServiceModel&lt;/strong&gt; &lt;strong&gt;isim alanı(Namespace)&lt;/strong&gt; altında yer alan &lt;strong&gt;ServiceAuthorizationManager&lt;/strong&gt; tipinden t&amp;uuml;retilmelidir. İ&amp;ccedil;eriğini ise &amp;ccedil;ok sade olarak aşağıdaki gibi tasarlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic;
using System.Security.Principal;
using System.ServiceModel;

namespace UsingCustomAuthorization
{
    public class Authorizer
        : ServiceAuthorizationManager 
    {
        protected override bool CheckAccessCore(OperationContext operationContext)
        {
            var authCtx = operationContext.ServiceSecurityContext.AuthorizationContext;
            var identities=(List&amp;lt;IIdentity&amp;gt;)authCtx.Properties["Identities"];

            foreach (var identity in identities)
            {
                var winIdentity = identity as WindowsIdentity;
                if (winIdentity != null)
                {
                    var winPrincipal = new WindowsPrincipal(winIdentity);
                    return winPrincipal.IsInRole("Administrators");
                }
            }

            return false;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Authorizer&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde &lt;strong&gt;CheckAccessCore&lt;/strong&gt; metodu ezilmiş ve parametre olarak gelen &lt;strong&gt;operationContext&lt;/strong&gt; değişkeninden yararlanarak gerekli yetki kontrol&amp;uuml; yapılmıştır. Buna g&amp;ouml;re &lt;strong&gt;Workflow&lt;/strong&gt; &lt;strong&gt;Service' &lt;/strong&gt;ten talepte bulunan bir &lt;strong&gt;Windows&lt;/strong&gt; kullanıcısı, servisin host edildiği makinede tanımlı ise, &lt;strong&gt;Administrators&lt;/strong&gt; rol&amp;uuml;nde olup olmadığı kontrol edilmekte ve buna g&amp;ouml;re geriye &lt;strong&gt;true&lt;/strong&gt; veya &lt;strong&gt;false&lt;/strong&gt; değeri d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmektedir. Tahmin edileceği &amp;uuml;zere &lt;strong&gt;CheckAccessCore&lt;/strong&gt; metodunun geriye &lt;strong&gt;false&lt;/strong&gt; değer d&amp;ouml;nd&amp;uuml;rmesi g&amp;uuml;venlik hatasına yol a&amp;ccedil;acaktır. Burada unutulmaması gereken bir noktayı da hatırlatmak yarar var. &amp;Ouml;rneğimizde konuyu son derece basit bir şekilde ele almak istediğimizden, doğrudan &lt;strong&gt;Administrator&lt;/strong&gt; rol&amp;uuml;n&amp;uuml;n kontrol&amp;uuml;n&amp;uuml; yapıp işin i&amp;ccedil;inden sıyrılmaktayız. Oysaki yetki kontrol&amp;uuml; i&amp;ccedil;in harici bir listeden yararlanılabilir. Bu liste &lt;strong&gt;web.config&lt;/strong&gt; dosyasında &lt;strong&gt;appSettings &lt;/strong&gt;kısmında tutulabileceği gibi bir &lt;strong&gt;Text&lt;/strong&gt; dosya i&amp;ccedil;erisinde veya &lt;strong&gt;veritabanı&lt;/strong&gt; &amp;uuml;zerindeki bir &lt;strong&gt;tabloda&lt;/strong&gt; konuşlandırılabilir. Yinede varmak istediğimiz noktayı anladığınızı d&amp;uuml;ş&amp;uuml;nerek devam ediyorum.&lt;/p&gt;
&lt;p&gt;Sırada &amp;ccedil;alışma zamanı i&amp;ccedil;in &lt;strong&gt;Authorizer&lt;/strong&gt; sınıfının yetki kontrol&amp;uuml; amacıyla kullanılacağını bildirmemiz gerekiyor. Bunun i&amp;ccedil;in &lt;strong&gt;web.config&lt;/strong&gt; dosyasını aşağıdaki şekilde d&amp;uuml;zenlememiz yeterli olacaktır.&lt;em&gt;(Bu arada projemize &lt;strong&gt;System.IdentityModel.dll assembly'&lt;/strong&gt; ını referans etmeyi unutmamalıyız. Aksi takdirde &lt;strong&gt;authCtx&lt;/strong&gt; &amp;uuml;zerinden hi&amp;ccedil; bir &amp;ouml;zelliğe erişemeyiz)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
  &amp;lt;system.web&amp;gt;
    &amp;lt;compilation debug="true" targetFramework="4.0" /&amp;gt;
  &amp;lt;/system.web&amp;gt;
  &amp;lt;system.serviceModel&amp;gt;
    &amp;lt;behaviors&amp;gt;
      &amp;lt;serviceBehaviors&amp;gt;
        &amp;lt;behavior&amp;gt;
          &amp;lt;serviceAuthorization serviceAuthorizationManagerType="UsingCustomAuthorization.Authorizer, UsingCustomAuthorization"/&amp;gt;
          &amp;lt;serviceMetadata httpGetEnabled="true"/&amp;gt;
          &amp;lt;serviceDebug includeExceptionDetailInFaults="false"/&amp;gt;
        &amp;lt;/behavior&amp;gt;
      &amp;lt;/serviceBehaviors&amp;gt;
    &amp;lt;/behaviors&amp;gt;
    &amp;lt;protocolMapping&amp;gt;
      &amp;lt;add scheme="http" binding="wsHttpBinding"/&amp;gt;
    &amp;lt;/protocolMapping&amp;gt;
  &amp;lt;/system.serviceModel&amp;gt;
  &amp;lt;system.webServer&amp;gt;
    &amp;lt;modules runAllManagedModulesForAllRequests="true"/&amp;gt;
  &amp;lt;/system.webServer&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;serviceAuthorization&lt;/strong&gt; elementi ile yetkilendirme davranışını ele alacak &lt;strong&gt;Authorizer&lt;/strong&gt; tipi belirlenmiştir. Ayrıca iletişimin g&amp;uuml;venli olmasını sağlamak adına &lt;strong&gt;protocolMapping&lt;/strong&gt; sekmesinde &lt;strong&gt;wsHttpBinding&lt;/strong&gt; bağlayıcı tipinin kullanılacağı bildirilmiştir. İşte bu kadar. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Artık yemeğimizi orta ateşte 40 dakika kadar pişirip servis edebiliriz. Tabi servis etmeden &amp;ouml;nce tadına bakmak gerekmektedir. Nasıl mı?&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikli olarak &lt;strong&gt;Administrator&lt;/strong&gt; rol&amp;uuml;nde olan ve olmayan iki test kullanıcımız olduğunu d&amp;uuml;ş&amp;uuml;nelim. Ben, &amp;ouml;rneği geliştirmekte olduğum makinede bu ama&amp;ccedil;la &lt;strong&gt;bsenyurt&lt;/strong&gt; ve &lt;strong&gt;runi&lt;/strong&gt; isimli iki kullanıcı oluşturdum. Bu kullanıcılardan &lt;strong&gt;bsenyurt&lt;/strong&gt; &lt;strong&gt;Administrator &lt;/strong&gt;rol&amp;uuml;nde iken &lt;strong&gt;runi User&lt;/strong&gt; rol&amp;uuml; i&amp;ccedil;erisinde yer almakta. Dolayısıyla test sonu&amp;ccedil;larımıza g&amp;ouml;re &lt;strong&gt;runi&lt;/strong&gt; isimli kullanıcı talebi karşılığında &lt;strong&gt;Access Denied&lt;/strong&gt; hata mesajını almalı. Bakalım ger&amp;ccedil;ektende b&amp;ouml;ylemi oldu?&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WcfTestClient &lt;/strong&gt;uygulamamızı &lt;strong&gt;Run As..&lt;/strong&gt; komutu yardımıyla &amp;ouml;nce &lt;strong&gt;bsenyurt&lt;/strong&gt; kullanıcısı ile &amp;ccedil;alıştıralım. Eğer &lt;strong&gt;Asp.Net Developement Server'&lt;/strong&gt; ı &lt;strong&gt;Visual Studio &lt;/strong&gt;ortamına &lt;strong&gt;Attach' &lt;/strong&gt;larsak &lt;strong&gt;CheckAccessCore &lt;/strong&gt;metodu i&amp;ccedil;eriğini de &lt;strong&gt;debug&lt;/strong&gt; edebiliriz. Buna g&amp;ouml;re &lt;strong&gt;debug&lt;/strong&gt; modunda aşağıdaki sonu&amp;ccedil;lar ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg145_Debug1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;bsenyurt&lt;/strong&gt; kullanıcısı doğrulanmıştır. &lt;strong&gt;IsAuthenticated&lt;/strong&gt; değerinin &lt;strong&gt;true&lt;/strong&gt; olduğuna dikkat edelim. Şimdi &lt;strong&gt;WcfTestClient&lt;/strong&gt; uygulamasının sonu&amp;ccedil; ekranına bakarsak toplama işleminin başarılı bir şekilde ger&amp;ccedil;ekleştirildiğini g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg145_AccessGaranted.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi de &lt;strong&gt;WcfTestClient&lt;/strong&gt; aracını &lt;strong&gt;Runi&lt;/strong&gt; isimli kullanıcı ile &amp;ccedil;alıştıralım. &lt;strong&gt;Debug&lt;/strong&gt; modda aşağıdaki sonu&amp;ccedil;lar ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg145_Debug2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tahmin edileceği &amp;uuml;zere &lt;strong&gt;Runi&lt;/strong&gt; isimli kullanıcı da doğrulanmıştır. Nitekim servisin &amp;ccedil;alıştırıldığı makine de tanımlı bir &lt;strong&gt;Windows&lt;/strong&gt; kullanıcısıdır. Ancak &lt;strong&gt;WcfTestClient&lt;/strong&gt; uygulaması &amp;uuml;zerinden bir toplama işlemi talebinde bulunulduğunda hata mesajı ile karşılaşılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg145_AccessDenied.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Volaaaaa!!! Bu &amp;ccedil;ok doğaldır. Nitekim &lt;strong&gt;Runi&lt;/strong&gt; isimli kullanıcı &lt;strong&gt;Administrators &lt;/strong&gt;grubuna dahil değildir ve bu y&amp;uuml;zden yetki kontrol&amp;uuml;nden ge&amp;ccedil;ememiştir.&lt;/p&gt;
&lt;p&gt;Yapmış olduğumuz bu &amp;ccedil;alışmaya g&amp;ouml;re bir &lt;strong&gt;Workflow Service'&lt;/strong&gt; ini host ettiğimiz sunucu &amp;uuml;zerindeki &lt;strong&gt;Windows&lt;/strong&gt; kullanıcılarından ve dahil oldukları grup bilgilerinden yararlanarak az bir kodlama ile doğrulama ve yetkilendirme işlemlerini ger&amp;ccedil;ekleştirebiliriz. Afiyet olsun &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f2%2fUsingCustomAuthorization_RC.rar"&gt;UsingCustomAuthorization_RC.rar (17,67 kb)&lt;/a&gt; &lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 Ultimate RC s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde geliştirilmiş ve test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-03-22 04:30:00</pubDate>
  <slug>Workflow-Services-Custom-Authorization</slug>
  <tags>
    <tag>workflow-services</tag>
    <tag>wf-40</tag>
    <tag>wcf-40</tag>
  </tags>
  <categories>
    <category>WCF 4.0</category>
    <category>WCF 4.0 RC</category>
    <category>WF 4.0 RC</category>
  </categories>
</post>