<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Kalıtım (Inheritance) Kavramına Kısa Bir Bakış</title>
  <description>Bir  önceki makalemizde C# dilinde sınıf kavramına bir giriş yapmış ve OOP(Objcet Oriented Programming-Nesneye Dayalı Programlama) tekniğinin en önemli kavramlarından biri olan kalıtımdan bahsedeceğimizi söylemiştik. Bugünkü makalemizde bu kavramı incelemeye çalışacağız.</description>
  <content>&lt;p&gt;Değerli&amp;nbsp; Okurlarım, Merhabalar. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bir&amp;nbsp; &amp;ouml;nceki makalemizde C# dilinde sınıf kavramına bir giriş yapmış ve OOP(Objcet Oriented Programming-Nesneye Dayalı Programlama) tekniğinin en &amp;ouml;nemli kavramlarından biri olan kalıtımdan bahsedeceğimizi s&amp;ouml;ylemiştik. Bug&amp;uuml;nk&amp;uuml; makalemizde bu kavramı incelemeye &amp;ccedil;alışacağız.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Kalıtım&amp;nbsp;kavramı i&amp;ccedil;in verilebilecek en g&amp;uuml;zel &amp;ouml;rnekler doğamızda yer almaktadır.&amp;nbsp; &amp;Ouml;rneğin Bitkiler, t&amp;uuml;rlerine gore sınıflandırılırlar. Ancak hepsinin birer bitki olması ortak bir takım &amp;ouml;zelliklere sahip oldukları anlamınada gelmektedir. Bitki isimli bir sınıfı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alıp Ağa&amp;ccedil;lar,&amp;Ccedil;i&amp;ccedil;ekler,Deniz Bitkileri vb&amp;hellip; gibi alt sınıflara ayırabiliriz. T&amp;uuml;m&amp;nbsp; bu alt sınıflar Bitki sınıfından gelmekte, yani t&amp;uuml;remektedirler. Aynı şekilde Bitki t&amp;uuml;r&amp;uuml; olan bir sınıf kendi i&amp;ccedil;inde başka alt sınıflara ayrılabilir. &amp;Ouml;rneğin, &amp;Ccedil;i&amp;ccedil;ek sınıfı G&amp;uuml;ller, Orkideler, Papatyalar vb&amp;hellip; T&amp;uuml;m bu nesneler hiyerarşik bir yapıda ele alındıklarında temel bir sınıftan t&amp;uuml;redikleri g&amp;ouml;r&amp;uuml;lebilmektedir. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Temel&amp;nbsp; bir nesne ve bu nesneden bir takım &amp;ouml;zellikleri almış ve başka ek &amp;ouml;zelliklere sahip olan nesneler bir araya getirildiklerinde aralarındaki ilişkinin kalıtımsal olduğundan s&amp;ouml;z ederiz. İşte&amp;nbsp; nesneye dayalı programlama dillerininde en &amp;ouml;nemli kavramlarından birisi kalıtımdır. Ortak &amp;ouml;zelliklere sahip olan t&amp;uuml;m nesneleriniz i&amp;ccedil;in bir sınıf yazarsınız. Ancak elinizde bu ortak &amp;ouml;zelliklerin yanında başka ek &amp;ouml;zelliklere sahip olacak veya ortak &amp;ouml;zelliklerden bir ka&amp;ccedil;ını farklı şekillerde değerlendirecek nesnelerinizde olabilir. Bunlar i&amp;ccedil;in yazacağınız sınıf , ilk sınıfı temel sınıf olarak baz alıcak ve bu temel sınıftan t&amp;uuml;retilecek ve kendi &amp;ouml;zellikleri ile işlevselliklerine sahip olucaktır. Konuyu&amp;nbsp; daha iyi pekiştirmek amacı ile aşağıdaki şekili g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alarak durumu zihnimizde canlandırmaya &amp;ccedil;alışalım. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;&lt;img src="/makale/images/mk26_1.gif" alt="" width="502" height="265" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;em style="mso-bidi-font-style: normal;"&gt;Şekil&amp;nbsp; 1.&amp;nbsp; Inheritance Kavramı&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;C# ile Temel bir sınıftan birden fazla sınıf t&amp;uuml;retebilirsiniz.&amp;nbsp; Ancak bir sınıfı birden fazla sınıftan t&amp;uuml;retmeniz m&amp;uuml;mk&amp;uuml;n değildir. Bunu&amp;nbsp; yapmak i&amp;ccedil;in aray&amp;uuml;zler (interface) kullanılır. T&amp;uuml;reyen bir sınıf t&amp;uuml;rediği sınıfın t&amp;uuml;m &amp;ouml;zelliklerine ve işlevlerine sahiptir ve t&amp;uuml;rediği sınıftaki bu elemanların yeniden tanımlanmasına gerek yoktur. Ayrıca&amp;nbsp; siz yeni &amp;ouml;zellikler ve işlevsellikler katabilirsiniz. Bu makalemizdeki &amp;ouml;rnek uygulamamızda kalıtımda &amp;ouml;nemli role sahip base ve new anahtar kelimelerinin kullanımında g&amp;ouml;receksiniz. Base ile temel sınıfa nasıl paramtere g&amp;ouml;nderebileceğimizi, temel sınıftaki metodları nasıl &amp;ccedil;ağırabileceğimizi ve new anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; sayesinde t&amp;uuml;reyen sınıf i&amp;ccedil;inde, temel sınıftaki ile aynı isme sahip metodların nasıl işlevsellik kazanacağını da inceleme fırsatı bulacaksınız. Dilerseniz bu kısa a&amp;ccedil;ıklamalardan sonra hemen &amp;ouml;rnek uygulamamızın kodlarına ge&amp;ccedil;elim.&amp;nbsp;Konu ile ilgili detaylı a&amp;ccedil;ıklamaları &amp;ouml;rnek i&amp;ccedil;erisindeki yorum satırlarında bulabilirisiniz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
namespace Inheritance1
{
    class TemelSinif /* &amp;Ouml;ncelikle temel sınıfımızı yani Base Class'ımızı yazalım. */
    {
        private string SekilTipi; /* Sadece bu class i&amp;ccedil;inde tanımlı bir alan tanımladık. Bu alana T&amp;uuml;reyen sınıfımız (derived class) i&amp;ccedil;erisinden de erişemeyiz. Eğer temel sınıfta yer alan bir alana sadece t&amp;uuml;reyen sınıftan erişebilmek ve başka sınıflardan erişilmesini engellemek istiyorsak, bu durumda bu alanı protected olarak tanımlarız.*/
        /* Bir &amp;ouml;zellik tanımlıyoruz. Sadece get bloğu olduğu i&amp;ccedil;in yanlızca okunabilir bir &amp;ouml;zellik. */
        public string sekilTipi
        {
            get
            {
                return SekilTipi;
            }
        }

        public TemelSinif() /* Temel sınıfımızn varsayılan yapıcı metodu. */
        {
            SekilTipi = "Kare";
        }

        public TemelSinif(string tip) /* Overload ettiğimiz yapıcı metodumuz. */
        {
            SekilTipi = tip;
        }

        public string SekilTipiYaz() /* String sonu&amp;ccedil; d&amp;ouml;nd&amp;uuml;ren bir metod.*/
        {
            return "Bu Nesnemiz, " + SekilTipi.ToString() + " tipindedir";
        }
    }

    /* İşte t&amp;uuml;reyen sınıfımız. :TemelSinif yazımı ile, bu sınıfın TemelSinif'tan t&amp;uuml;retildiğini belirtiyoruz. B&amp;ouml;ylece, TureyenSinif class'ımız TemelSınıf class'ının &amp;ouml;zelliklerinide b&amp;uuml;nyesinde barındırmış oluyor.*/
    class TureyenSinif : TemelSinif
    {
        private bool Alan;
        private bool Cevre;
        private int Taban;
        private int Yukseklik;
        private int UcuncuKenar;
        private bool Kare;
        private bool Dikdortgen;
        private bool Ucgen;
        public bool alan
        {
            get
            {
                return Alan;
            }
        }

        public bool cevre
        {
            get
            {
                return Cevre;
            }
        }

        public int taban
        {
            get
            {
                return Taban;
            }
        }

        public int yukseklik
        {
            get
            {
                return Yukseklik;
            }
        }

        public int ucuncuKenar
        {
            get
            {
                return UcuncuKenar;
            }
        }

        public bool kare
        {
            get
            {
                return Kare;
            }
            set
            {
                Kare = value;
            }
        }
        public bool dikdortgen
        {
            get
            {
                return Dikdortgen;
            }
            set
            {
                Dikdortgen = value;
            }
        }

        public bool ucgen
        {
            get
            {
                return Ucgen;
            }
            set
            {
                Ucgen = value;
            }
        }

        public TureyenSinif()
            : base() /* Burada base anahtar kelimesine dikkatinizi &amp;ccedil;ekerim. Eğer bir TureyenSinif nesnesini bu yapıcı metod ile t&amp;uuml;retirsek, TemelSinif'taki yapıcı metod &amp;ccedil;alıştırılacaktır. */
        {
        }

        public TureyenSinif(string tip, bool alan, bool cevre, int taban, int yukseklik, int ucuncuKenar)
            : base(tip) /* Buradada base anahtar kelimesi kullanılmıştır. Ancak sadece tip isimli string değişkenimiz, TemelSinif'taki ilgili yapıcı metoda g&amp;ouml;nderilmiştir. Yani bu yapıcı metod kullanılarak bir TureyenSinif nesnesi oluşturduğumuzda, TemelSinif'taki bir tek string parametre alan yapıcı metod &amp;ccedil;ağırılır ve daha sonra buraya d&amp;ouml;n&amp;uuml;lerek aşağıdaki kodlar &amp;ccedil;alıştırılır.*/
        {
            Alan = alan;
            Cevre = cevre;
            Taban = taban;
            Yukseklik = yukseklik;
            UcuncuKenar = ucuncuKenar;
        }

        public double AlanBul() /* Tureyen sınıfımızda bir metod tanımlıyoruz. */
        {
            if (Kare == true)
            {
                return Taban * Taban;
            }
            if (Dikdortgen == true)
            {
                return Taban * Yukseklik;
            }
            if (Ucgen == true)
            {
                return (Taban * Yukseklik) / 2;
            }
            return 0;
        }
        public double CevreBul() /* Başka bir metod. */
        {
            if (Kare == true)
            {
                return 4 * Taban;
            }
            if (Dikdortgen == true)
            {
                return (2 * Taban) + (2 * Yukseklik);
            }
            if (Ucgen == true)
            {
                return Taban + Yukseklik + UcuncuKenar;
            }
            return 0;
        }
        public new string SekilTipiYaz() /* Buradaki new anahtar kelimesine dikkat edelim. SekilTipiYaz metodunun aynısı TemelSinif class'ımızda yer almaktadır. Ancak bir new anahtar kelimesi ile aynı isimde bir metodu TureyenSinif class'ımız i&amp;ccedil;inde tanımlamış oluyoruz. Bu durumda, TureyenSinif class'ından oluşturulan bir nesneye ait SekilTipiYaz metodu &amp;ccedil;ağırılırsa, buradaki kodlar &amp;ccedil;alıştırılır. Oysaki new anahtar kelimesini kullanmasaydık, TemelSinif i&amp;ccedil;indeki SekilTipiYaz metodunun &amp;ccedil;alıştırılacağını g&amp;ouml;recektik. */
        {
            if (Kare == true)
            {
                return "kare";
            }
            if (Dikdortgen == true)
            {
                return "dikdortgen";
            }
            if (Ucgen == true)
            {
                return "&amp;uuml;&amp;ccedil;gen";
            }
            return "Belirsiz";
        }
    }
    class Class1
    {
        static void Main(string[] args)
        {
            /* &amp;Ouml;nce TemelSinif tipinde bir nesne oluşturup SekilTipiYaz metodunu &amp;ccedil;ağırıyoruz.*/
            TemelSinif ts1 = new TemelSinif();
            Console.WriteLine(ts1.SekilTipiYaz());
            TemelSinif ts2 = new TemelSinif("Dikd&amp;ouml;rtgen"); /* Bu kes TemelSinif tipinden bir nesneyi diğer yapıcı metodu ile &amp;ccedil;ağırıyor ve SekilTipiYaz metodunu      &amp;ccedil;alıştırıyoruz. */
            Console.WriteLine(ts2.SekilTipiYaz());

            /* Şimdi ise TureyenSinif'tan bir nesne oluşturduk ve sekilTipi isimli &amp;ouml;zelliğin değerini aldık. Kodlara bakıcak olursanız sekilTipi &amp;ouml;zelliğinin TemelSinif i&amp;ccedil;inde tanımlandığını g&amp;ouml;r&amp;uuml;rs&amp;uuml;n&amp;uuml;z. Yani TureyenSinif nesnemizden, TemelSinif class'ındaki izin verilen alanlara,metodlara vb.. ulaşabilmekteyiz.*/
            TureyenSinif tur1 = new TureyenSinif();
            Console.WriteLine(tur1.sekilTipi);

            /* Şimdi ise başka bir TureyenSinif nesnesi tanımladık. Yapıcı metodumuz'un ilk parametresinin değeri olan "Benim Şeklim" ifadesi base anahtar kelimesi nedeni ile, TemelSinif class'ındaki ilgili yapıcı metoda g&amp;ouml;nderilir. Diğer parametreler ise TureyenSinif class'ı i&amp;ccedil;inde işlenirler. Bu durumda tur2 isimli TureyenSinif nesnemizden TemelSinifa ait sekilTipi &amp;ouml;zelliğini &amp;ccedil;ağırdığımızda, ekrana Benim Şeklim yazdığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. &amp;Ccedil;&amp;uuml;nk&amp;uuml; bu değer TemelSinif class'ımızda işlenmiş ve bu class'taki &amp;ouml;zelliğe atanmıştır. Bunu sağlayan base anahtar kelimesidir.*/
            TureyenSinif tur2 = new TureyenSinif("Benim Şeklim", true, true, 2, 4, 0);
            Console.WriteLine(tur2.sekilTipi);

            tur2.dikdortgen = true;
            Console.WriteLine(tur2.SekilTipiYaz());

            /* Tureyen sinif i&amp;ccedil;inde tanımladığımız SekilTipiYaz metodu &amp;ccedil;alıştırılır. Eğer, TureyenSinif i&amp;ccedil;inde bu metodu new ile tanımlamasaydık TemelSinif class'i i&amp;ccedil;inde yer alan aynı isimdeki metod &amp;ccedil;alışıtırılırdır.*/
            if (tur2.alan == true)
            {
                Console.WriteLine(tur2.sekilTipi + " Alanı:" + tur2.AlanBul());
            }
            if (tur2.cevre == true)
            {
                Console.WriteLine(tur2.sekilTipi + " &amp;Ccedil;evresi:" + tur2.CevreBul());
            }
            TureyenSinif tur3 = new TureyenSinif("Benim &amp;uuml;&amp;ccedil;genim", true, false, 10, 10, 10);
            Console.WriteLine(tur3.sekilTipi);

            tur3.ucgen = true;
            Console.WriteLine(tur3.SekilTipiYaz());

            Console.WriteLine(tur3.sekilTipi + " Alanı:" + tur3.AlanBul());
            if (tur2.cevre == true)
            {
                Console.WriteLine(tur3.sekilTipi + " &amp;Ccedil;evresi:" + tur3.CevreBul());
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;m&amp;uuml;z aşağıdaki gibi olucaktır. Umuyorum&amp;nbsp; ki kalıtım ile ilgili olarak yazmış olduğumuz bu &amp;ouml;rnek sizlere yeni fikirler verebilecektir. &amp;Ouml;rneğin &amp;ccedil;ok işlevsel olması şu an i&amp;ccedil;in &amp;ouml;nemli değil. Ancak bir sınıfın başka bir sınıftan nasıl t&amp;uuml;retildiğine, &amp;ouml;zellikle base ve new anahtar kelimelerinin bize sağladığı avantajlara dikkat etmenizi isterim. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;em style="mso-bidi-font-style: normal;"&gt;&lt;img src="/makale/images/mk26_2.gif" alt="" width="298" height="199" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;em style="mso-bidi-font-style: normal;"&gt;Şekil&amp;nbsp; 2.&amp;nbsp; Uygulamanın &amp;ccedil;alışmasının sonucu.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Geldik&amp;nbsp;bir makalemizin daha sonuna. Bir&amp;nbsp; sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2003-12-25 12:00:00</pubDate>
  <slug>Kalıtım-(Inheritance)-Kavramına-Kısa-Bir-Bakış-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>oop</tag>
    <tag>net</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>