<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Programcıdan Programcıya Rust</title>
  <description>İki yıl kadar önce bir merakla başladığım ama sonrasında takıntı haline gelen bir uğraş edindim; Rust programlama dili. Profesyonel iş yaşantımın neredeyse tamamında .Net platformu üstünde geliştirme yaptım ve halen daha maaşımı ondan kazanıyorum. Bazı zamanlar Python, Go, Ruby gibi dillere de baktım ama hep hobi olarak kaldılar. Rust içinse aynı şeyi söylemem zor. Onunla ilgili resmi dokümantasyonu takip edip birkaç satır kod yazmaya başladım ve derken sayısız derleme zamanı hatası ile karşılaştım. Bunların neredeyse büyük çoğunluğu borrowing, ownership, lifetimes gibi konularla ilintiliydi ve her biri Rust’ın temelde bilinmesi gereken demirbaşları.</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/cover.png" alt="" align="right" /&gt;İki yıl kadar &amp;ouml;nce bir merakla başladığım ama sonrasında takıntı haline gelen bir uğraş edindim; Rust programlama dili. Profesyonel iş yaşantımın neredeyse tamamında .Net platformu &amp;uuml;st&amp;uuml;nde geliştirme yaptım ve halen daha maaşımı ondan kazanıyorum. Bazı zamanlar Python, Go, Ruby gibi dillere de baktım ama hep hobi olarak kaldılar.&amp;nbsp;Rust i&amp;ccedil;inse aynı şeyi s&amp;ouml;ylemem zor. Onunla ilgili resmi dok&amp;uuml;mantasyonu takip edip birka&amp;ccedil; satır kod yazmaya başladım ve derken sayısız derleme zamanı hatası ile karşılaştım. Bunların neredeyse b&amp;uuml;y&amp;uuml;k &amp;ccedil;oğunluğu borrowing, ownership, lifetimes gibi konularla ilintiliydi ve her biri Rust&amp;rsquo;ın temelde bilinmesi gereken demirbaşları.&lt;/p&gt;
&lt;p&gt;Bu zorlanma bende daha fazla merak uyandırdı. Derken her zaman olduğu gibi en doğru kaynağın kitaplar olduğuna karar verip g&amp;uuml;zelim paracıklarımı Amazon&amp;rsquo;daki kitaplara yatırmaya başladım. No Starch Press&amp;rsquo;ten &lt;a href="https://www.amazon.com.tr/dp/1718500440/ref=cm_sw_em_r_mt_dp_5D4B09DFF32M6D1X8P98" target="_blank"&gt;The Rust Programming Language&lt;/a&gt;, Packt&amp;rsquo;tan &lt;a href="https://www.amazon.com.tr/dp/1789530660/ref=cm_sw_em_r_mt_dp_YGFG0G92KY1D0EM5N39Y" target="_blank"&gt;Rust Programming Cookbook&lt;/a&gt;, &lt;a href="https://www.amazon.com.tr/dp/178899552X/ref=cm_sw_em_r_mt_dp_AWQTXM5ZCAGPCBVRR3KV?_encoding=UTF8&amp;amp;psc=1" target="_blank"&gt;Hands-On Data Structures and Algorithms with Rust&lt;/a&gt;, &lt;a href="https://www.amazon.com.tr/dp/1789346223/ref=cm_sw_em_r_mt_dp_2QBF516ZBVN45G933JD8" target="_blank"&gt;Creative Projects for Rust Programmers&lt;/a&gt; ve son olarak da &lt;a href="https://www.amazon.com.tr/dp/1800560818/ref=cm_sw_em_r_mt_dp_FQBZVKFFB11WZ06WM3RY" target="_blank"&gt;Rust Web Programming&lt;/a&gt;. Hepsine zaman zaman bakıp bir şeyler &amp;ccedil;alıştım ama tabii işten g&amp;uuml;&amp;ccedil;ten &amp;ccedil;ok da fazla değil. Ger&amp;ccedil;i acelem yok. Hayatımın bundan sonraki d&amp;ouml;nemi i&amp;ccedil;in hedefe aldığım bir programlama dili olduğundan ona yıllarca vakit ayırabilirim.&lt;/p&gt;
&lt;p&gt;İzleyen yazıda Rust Web Programming kitabının birinci b&amp;ouml;l&amp;uuml;m&amp;uuml; ile ilgili notlarımı bulabilirsiniz. Birebir &amp;ccedil;eviri değil ama akıştaki &amp;ouml;rnekleri yer yer değiştirip anlamaya &amp;ccedil;alışarak yorumladığım bir i&amp;ccedil;erik. Nitekim yazmadan &amp;ouml;ğrenemiyorum. Faydalı olması dileğiyle.&lt;/p&gt;
&lt;p&gt;Doğada element halinde bir&amp;ccedil;ok programlama dili var. Bir problemin &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; veya bir işin bilgisayarlar tarafından yapılması maksadıyla kullanılan sayısız dil. Programcılar i&amp;ccedil;in hangi dili se&amp;ccedil;eceğine karar vermek ezelden beri &amp;ccedil;ok kolay değil. &amp;Ouml;zellikle sistemlerin geliştirilmesinde &amp;ouml;d&amp;uuml;n verilen şu ikililer d&amp;uuml;ş&amp;uuml;n&amp;uuml;l&amp;uuml;rse; Hız ve kaynaklar&lt;em&gt;(speed/resource)&lt;/em&gt; ile geliştirme hızı ve g&amp;uuml;venli bellek sahaları&lt;em&gt;(development speed/safety)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;C ve C++ gibi işletim sistemine diğerlerinden daha &amp;ccedil;ok yaklaşabilen d&amp;uuml;ş&amp;uuml;k seviyeli dillerde y&amp;uuml;ksek hızlı &amp;ccedil;alışma zamanlarına ve minimum seviyede kaynak t&amp;uuml;ketime erişmek pekala m&amp;uuml;mk&amp;uuml;n. Bunlar her ne kadar &amp;ouml;nemli avantajlar gibi g&amp;ouml;r&amp;uuml;nse de birka&amp;ccedil; sebepten &amp;ouml;t&amp;uuml;r&amp;uuml; handikaba da d&amp;ouml;n&amp;uuml;şebiliyor.&lt;/p&gt;
&lt;p&gt;Her şeyden &amp;ouml;nce g&amp;uuml;n&amp;uuml;m&amp;uuml;z&amp;uuml;n dinamiklerine g&amp;ouml;re iş ihtiya&amp;ccedil;ları a&amp;ccedil;ısından &amp;ccedil;ok hızlı yenilenmesi gereken &amp;uuml;r&amp;uuml;nlerde&lt;em&gt;(web uygulamaları gibi)&lt;/em&gt; uzun geliştirme s&amp;uuml;releri kimsenin işine gelmiyor. Diğer yandan dil dışında işletim sistemlerinin dinamiklerine de &amp;ccedil;ok iyi h&amp;acirc;kim olmak gerekiyor. Nitekim belleğin programcı tarafından y&amp;ouml;netimi &amp;ccedil;eşitli g&amp;uuml;venlik a&amp;ccedil;ıklarına ve bug&amp;rsquo;lara sebebiyet verebiliyor. Bu y&amp;uuml;zden web geliştirme d&amp;uuml;nyasında C++ ile yazılmış hazır Framework&amp;rsquo;lere pek rastlanmıyor. Doğal olarak Javascript, C#, Java, Python, PHP gibi y&amp;uuml;ksek seviyeli diller bu alanda daha &amp;ccedil;ok tercih ediliyorlar. &amp;Ccedil;&amp;uuml;nk&amp;uuml; zengin framework detayları ile otomatik bellek y&amp;ouml;netim mekanizmaları yazılımcının geliştirme hızını artırıp g&amp;uuml;venli bir ortam tesis edilmesine imk&amp;acirc;n sağlıyor. Ancak belleğin daha g&amp;uuml;venli bir hale gelmesi i&amp;ccedil;in kullanılan Garbage Collector gibi mekanizmaların da bazı sıkıntıları var; Fazladan kaynak t&amp;uuml;ketimi ve zaman maliyeti. Bu mekanizmalar uygulama ortamında değişkenleri s&amp;uuml;rekli izleyip &amp;ccedil;eşitli kontrollere g&amp;ouml;re kaynakların belleğe geri iadesi &amp;uuml;zerine &amp;ccedil;alışmakta.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Rust&amp;rsquo;ın &amp;ouml;ne &amp;ccedil;ıktığı noktalardan birisi de g&amp;uuml;venli bellek sahası i&amp;ccedil;in kullandığı y&amp;ouml;ntemler. Rust, Garbage Collector gibi bir mekanizma yerine bir&amp;ccedil;ok şeyi hen&amp;uuml;z derleme aşamasındayken &amp;ccedil;&amp;ouml;zmeyi yeliyor. Derleyici, değişkenlerin belli kurallara g&amp;ouml;re kullanılması i&amp;ccedil;in programcıyı zorluyor. Burada borrow checker, ownership, lifetime gibi konulardan bahsediyoruz. A&amp;ccedil;ık&amp;ccedil;ası benim ger&amp;ccedil;ekten de ilk kez duyduğum bu kavramlar Rust&amp;rsquo;ın hız ve efektif kaynak t&amp;uuml;ketimi yanında g&amp;uuml;venli bellek sahasının maliyetsiz olarak tesis edilmesi i&amp;ccedil;in &amp;ouml;nemli kolaylıklar sağlıyorlar. Yani derleme aşamasındayken bu kurallar devreye giriyor ve aşağıda listelenen olası hataların oluşmasının &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;iliyor.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Program tarafından kullanılan bir bellek b&amp;ouml;lgesi serbest kaldığında korsanların kod y&amp;uuml;r&amp;uuml;tebileceği alanlar haline gelebilir veya bu alanlar durmaya devam ettiği i&amp;ccedil;in program &amp;ccedil;akılabilir =&amp;gt; Use After Frees&lt;/li&gt;
&lt;li&gt;Bir işaret&amp;ccedil;inin(pointer) referans ettiği bellek adresi ve i&amp;ccedil;eriği artık kullanılmıyordur ancak işaret&amp;ccedil;i, program i&amp;ccedil;inde aktif kalmaya devam etmektedir. Bu durumda işaret&amp;ccedil;i rastgele bir veri i&amp;ccedil;eriğini tutabilir =&amp;gt; Dangling Pointers&lt;/li&gt;
&lt;li&gt;Ayrılan bir bellek b&amp;ouml;lgesi serbest bırakıldıktan sonra ikinci kez tekrar serbest bırakılmaya &amp;ccedil;alışılır. Bu, verilerin a&amp;ccedil;ığa &amp;ccedil;ıkmasına veya korsanların ilgili alanı kullanarak kod işletmesine sebebiyet verebilir =&amp;gt; Double frees&lt;/li&gt;
&lt;li&gt;Program, izninin olmadığı bir bellek b&amp;ouml;lgesine erişir =&amp;gt; Segmentation Faults&lt;/li&gt;
&lt;li&gt;Bir dizinin sonu okunmaya &amp;ccedil;alışılır ki bu da programın &amp;ccedil;&amp;ouml;kmesine neden olur =&amp;gt; Buffer Overrun&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Zaten bu sorunların &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek i&amp;ccedil;in pek &amp;ccedil;ok programlama dili managed bir ortamda&lt;em&gt;(hatta sanal &amp;ccedil;alışma zamanında)&lt;/em&gt; y&amp;uuml;r&amp;uuml;r. İlerleyen kısımlarda bu hataların &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek i&amp;ccedil;in kullanılan değişken sahiplenme kurallarına&lt;em&gt;(Ownership Rules)&lt;/em&gt; kısaca değineceğiz.&lt;/p&gt;
&lt;p&gt;Bahsettiğimiz avantajlara ek olarak Rust&amp;rsquo;ın Web Framwork&amp;rsquo;ler a&amp;ccedil;ısından zengin bir k&amp;uuml;t&amp;uuml;phane&lt;em&gt;(crate, sandık olarak ge&amp;ccedil;er)&lt;/em&gt; desteğine sahip olduğu d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde sadece sistem programlama değil, web programlama alanında da &amp;ouml;nemli bir ara&amp;ccedil; haline geldiğini s&amp;ouml;yleyebiliriz(Oyun programlama&amp;nbsp;&lt;em class="markup--em markup--p-em"&gt;ki bu konuda &lt;/em&gt;&lt;a class="markup--anchor markup--p-anchor" href="https://medium.com/pragmatic-programmers/game-development-with-rust-31147f7b6096" target="_blank" data-href="https://medium.com/pragmatic-programmers/game-development-with-rust-31147f7b6096"&gt;&lt;em class="markup--em markup--p-em"&gt;şu yazıya&lt;/em&gt;&lt;/a&gt;&lt;em class="markup--em markup--p-em"&gt; bakabilirsiniz&lt;/em&gt;, g&amp;ouml;m&amp;uuml;l&amp;uuml; sistem programlama vb)&amp;nbsp;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bazı kaynaklarda Rust i&amp;ccedil;in kullanıcı ile etkileşime odaklı bir dil olmadığı daha ziyade performans gerektiren arka plan işleri i&amp;ccedil;in tasarlandığı ve bellek y&amp;ouml;netimini merkeze koyduğu belirtilir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Ancak ortada halen daha bir problem var. &amp;Ouml;zellikle benim gibi 45&amp;rsquo;ini devirmiş bir yazılımcı iseniz ve iş yaşantınızın neredeyse tamamında .Net gibi belleği sizin i&amp;ccedil;in y&amp;ouml;neten, dil enstr&amp;uuml;manları ve k&amp;uuml;t&amp;uuml;phaneler a&amp;ccedil;ısından zengin, bir şeyi yapmak i&amp;ccedil;in on farklı fonksiyon sunan &amp;ccedil;atılarla &amp;ccedil;alışmışsanız, Rust&amp;rsquo;ın &amp;ouml;ğrenme eğrisinin olduk&amp;ccedil;a zorlu olduğunu ifade etmek mecburiyetindeyim.&lt;/p&gt;
&lt;p&gt;Rust dilinin belli başlı kurallarını baştan &amp;ouml;ğrenmek dile h&amp;acirc;kim olmak a&amp;ccedil;ısından son derece &amp;ouml;nemli. Aksi halde derleme zamanı hataları ile saatler ge&amp;ccedil;irebilirsiniz&lt;em&gt;(Her ne kadar derleme hataları pek &amp;ccedil;ok ipucu veriyor olsa da)&lt;/em&gt; Sisteminizde Rust i&amp;ccedil;in gerekli geliştirme ortamının y&amp;uuml;kl&amp;uuml; olduğunu varsayarak aşağıdaki terminal komutu ile devam edelim. T&amp;uuml;m kod par&amp;ccedil;alarını bu projenin main.rs dosyası &amp;uuml;zerinde icra edeceğiz. Hemen bir ipucu vereyim, &lt;a title="Rustup" href="https://rustup.rs/" target="_blank"&gt;sisteminize Rust ortamının kurulumu i&amp;ccedil;in şu adresten yararlanabilirsiniz&lt;/a&gt;.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;cargo new hello-world&lt;/pre&gt;
&lt;p&gt;cargo, Rust&amp;rsquo;ın paket y&amp;ouml;neticisi, derleyicisi, test&amp;ccedil;isi, s&amp;uuml;r&amp;uuml;m hazırlayıcısıdır. Belki de her şeyidir desek yeridir. Onu kullanarak &amp;ccedil;alıştırılabilir programlar ve yeniden kullanılabilir k&amp;uuml;t&amp;uuml;phaneler&lt;em&gt;(ki Crate olarak isimlendirilirler-k&amp;uuml;fe veya sandık olarak &amp;ccedil;evirebiliriz)&lt;/em&gt; yazabilir, test koşturabilir, release i&amp;ccedil;in platforma g&amp;ouml;re binary &amp;ccedil;ıktılar &amp;uuml;retebiliriz. Şu aşamada giriş noktası main fonksiyonu olan hello-world isimli bir program oluştuğunu s&amp;ouml;ylesek yeterli. İlk kodlarımızı aşağıdaki gibi yazalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let introduction =
        String::from("Merhaba Rustician. Bug&amp;uuml;n hava 23 derece ve g&amp;uuml;neşli. Nasılsın?");
    print_sysmsg(introduction);
}

fn print_sysmsg(message: String) {
    println!("Sistem mesajı,\n{}", message);
}&lt;/pre&gt;
&lt;p&gt;Program main fonksiyonundan &amp;ccedil;alışmaya başlar. let anahtar kelimesi ile introduction isimli bir değişken tanımlanır ve ona String t&amp;uuml;r&amp;uuml;nden bir nesne atanır. Nesnenin &amp;uuml;retiminde String mod&amp;uuml;l&amp;uuml;n&amp;uuml;n from fonksiyonundan yararlanılır. Sonrasında yine String t&amp;uuml;r&amp;uuml;nde parametre alan print_sysmsg isimli fonksiyon &amp;ccedil;ağırılır. Bu fonksiyon i&amp;ccedil;erisinde println! İsimli bir başka enstr&amp;uuml;manın kullanıldığını g&amp;ouml;r&amp;uuml;yoruz. Sonunda ! işareti olan fonksiyonlar macro olarak isimlendirilir. Macro&amp;rsquo;lar n sayıda parametre alabilirler ama daha da &amp;ouml;nemlisi meta programming i&amp;ccedil;in kullanılırlar. B&amp;ouml;ylece rust ile rust kodları yazabilir, derleme aşamasında işletilebilir kod bloklarını programa ekleyebiliriz&lt;em&gt;(&amp;Ouml;n işlemci direktifleri gibi)&amp;nbsp;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdi println! makrosunu main metodu ile doğrudan kullansaydık ne olurdu diyebilirsiniz. Biraz sabredin, ne demek istediğimizi anlayacaksınız. &amp;Ouml;ncelikle bu &amp;ouml;rneği &amp;ccedil;alıştırıp ekran &amp;ccedil;ıktısına bir bakalım. Bunun i&amp;ccedil;in programın olduğu klas&amp;ouml;re ge&amp;ccedil;ip aşağıdaki komutu vermek yeterli.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;cargo run&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi aynı &amp;ouml;rnek kodu aşağıdaki gibi değiştirelim.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let introduction = "Merhaba Rustician. Bug&amp;uuml;n hava 23 derece ve g&amp;uuml;neşli. Nasılsın?";
    print_sysmsg(introduction);
}

fn print_sysmsg(message: str) {
    println!("Sistem mesajı,\n{}", message);
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere fonksiyonun parametre tipini değiştirdik. Metinsel veriyi işaret edebileceğimiz bir literal kullandık. Aynen Javascript, Python gibi dinamik programlama yaklaşımı i&amp;ccedil;eren dillerde olduğu gibi. Yılların programcısı olarak bu kullanımda hi&amp;ccedil; bir sorun olmadığını rahatlıkla s&amp;ouml;yleyebilirsiniz. Şimdi &amp;ccedil;alışma zamanı &amp;ccedil;ıktısına bakalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Birka&amp;ccedil; satırlık kod par&amp;ccedil;ası i&amp;ccedil;in geniş bir hata mesajları silsilesi :| Odaklanmamız gereken hata mesajı &lt;strong&gt;&amp;ldquo;error[E0277]: the size for values of type `str` cannot be known at compilation time&amp;rdquo;&lt;/strong&gt;. Rust derleyicisi parametre olarak gelen str literal&amp;rsquo;inin &amp;ccedil;alışma zamanında ne kadarlık bir yer kaplayacağını bilmediği i&amp;ccedil;in derlemeyi kabul etmemiştir. Bunun belleğin g&amp;uuml;venli bir saha olarak kalması i&amp;ccedil;in konulmuş bir kural olduğunu ifade edebiliriz. Ancak sebebin ge&amp;ccedil;erliliğini anlamak i&amp;ccedil;in belleğin stack ve heap b&amp;ouml;lgelerinin &amp;ccedil;alışmasını da bilmemiz gerekir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_22.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Program başlangıcında boyutları bilinen veriler stack bellek b&amp;ouml;lgesinde tutulurlar ve bu alan hızlı erişilebildiği i&amp;ccedil;in performans a&amp;ccedil;ısından olduk&amp;ccedil;a verimlidir. Lakin heap b&amp;ouml;lgesine g&amp;ouml;re daha k&amp;uuml;&amp;ccedil;&amp;uuml;k bir alandır. &amp;Ouml;zellikle b&amp;uuml;y&amp;uuml;k boyutlu olan, &amp;ccedil;alışma zamanında i&amp;ccedil;eriği dinamik olarak değişebilen t&amp;uuml;rler g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında veriyi heap &amp;uuml;st&amp;uuml;nden tutmak, stack&amp;rsquo;ten ise bu verinin olduğu başlangı&amp;ccedil; konumlarına işaret eden referansları tutmak tercih edilir.&lt;/p&gt;
&lt;p&gt;Stack&amp;rsquo;de duracak değişkenlerin taşıyacakları veriler başlangı&amp;ccedil;ta bellidir ama heap dinamik olarak &amp;ccedil;alışma zamanında anlaşılabilir. Rust, str t&amp;uuml;r&amp;uuml;n&amp;uuml;n literal olarak heap bellek b&amp;ouml;lgesinde tutulacağını biliyor fakat i&amp;ccedil;erisine ne kadar b&amp;uuml;y&amp;uuml;k bir veri konacağına dair fikir sahibi değil ki bu en sevmediği şey. Dolayısıyla programı derlemiyor. Bunu &amp;ccedil;&amp;ouml;zmek i&amp;ccedil;in verinin heap &amp;uuml;zerinde durduğu konumu referans eden bir kullanıma gitmemizi bekliyor. Ya da boyutu sabitlenecek şekilde kullanmamızı. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asına ile devam edelim.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let introduction = "Merhaba Rustician. Bug&amp;uuml;n hava 23 derece ve g&amp;uuml;neşli. Nasılsın?";
    print_sysmsg(introduction.to_string());

    let motto = "Rust &amp;ccedil;ok efektif bir dil";
    print_sysmsg2(&amp;amp;motto);
}

fn print_sysmsg(message: String) {
    println!("Sistem mesajı,\n{}", message);
}

fn print_sysmsg2(message: &amp;amp;str) {
    println!("Sistem mesajı,\n{}", message);
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncelikle uygulama &amp;ccedil;ıktısına bir g&amp;ouml;z atalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sorun yok. Peki ya neler oldu? İki farklı kullanım g&amp;ouml;rmekteyiz. İlk versiyonda introduction değişkeninin taşıdığı değer metoda g&amp;ouml;nderilmeden &amp;ouml;nce to_string() ile String nesnesine d&amp;ouml;n&amp;uuml;ş&amp;uuml;r. String nesnesi verinin tutulduğu heap adresinin referansını, kapasitesini ve uzunluğunu tutar&lt;em&gt;(Hatta hen&amp;uuml;z değinmedik ama String nesnesinin işaret ettiği veri aslında byte t&amp;uuml;r&amp;uuml;nden bir vector serisidir)&lt;/em&gt; Diğer kullanımda ise motto isimli metin bazlı verinin başına &amp;amp; işareti konularak fonksiyona aktarıldığını g&amp;ouml;rmekteyiz. Benzer şekilde print_sysmsg2 isimli fonksiyonun parametre tanımında da &amp;amp; ile başlayan bir literal değişken bildirimi s&amp;ouml;z konusudur. Aslında yapılan şey motto değişkeninin referansının print_sysmsg2 fonksiyonuna taşınması ya da o fonksiyon tarafından &amp;ouml;d&amp;uuml;n&amp;ccedil; alınmasıdır&lt;em&gt;(borrowing)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Rust dilinde String dışında tamsayılar&lt;em&gt;(integers)&lt;/em&gt;, kayan noktalı sayılar&lt;em&gt;(floats)&lt;/em&gt;, diziler&lt;em&gt;(arrays)&lt;/em&gt;, vekt&amp;ouml;rler&lt;em&gt;(vectors)&lt;/em&gt;, true false&lt;em&gt;(bool)&lt;/em&gt; gibi başka veri t&amp;uuml;rleri de vardır. Genelde değişken tanımlamalarında veri tipini belirtmek mecburi değildir ancak t&amp;uuml;r belirtildiğinde &amp;ouml;zellikle tamsayılar i&amp;ccedil;in dikkat edilmesi gereken bir durum s&amp;ouml;z konusu olabilir. Tamsayı t&amp;uuml;rleri işaretli&lt;em&gt;(signed)&lt;/em&gt; veya işaretsiz&lt;em&gt;(unsigned)&lt;/em&gt; tanımlanabilirler. İşaretli versiyonlarda sınırlara dikkat etmek gerekir. Aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let mut n1: i8 = 127;
    println!("n1 sayısının değeri {}", n1);
    let n2: u8 = 256;
    println!("n2 sayısının değeri {}", n2);
    n1 += 1;
}&lt;/pre&gt;
&lt;p&gt;Şimdilik &amp;ccedil;ok &amp;ouml;nemli olmasa da n1 değişkeni i&amp;ccedil;in mut anahtar kelimesini kullanmamız dikkatinizi &amp;ccedil;ekmiştir. Varsayılan olarak t&amp;uuml;m değişkenler immutable olarak doğarlar. Yani mut operat&amp;ouml;r&amp;uuml; ile aksi belirtilmedik&amp;ccedil;e sahip oldukları veriler değiştirilemez. Diğer yandan bu kod par&amp;ccedil;ası derlenecek ama &amp;ccedil;alışma zamanında hata oluşmasına sebep olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_4.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Rust tarafında &amp;ccedil;alışma zamanı hataları aslında birer panik halidir&lt;em&gt;(panic)&lt;/em&gt; Şimdi kodu dikkatlice inceleyelim. İlk değişkenimiz n1 işaretsiz 8 bit tamsayıdır. Dolayısıyla 2 &amp;uuml;zeri 8 yani 256 adet sayı değerinden birini taşıyabilir. &amp;Ouml;nemli olan hangi aralıktakileri? Benzer şekilde n2 isimli değişken u8 olarak ifade edilmiştir ve o da pozitif olmak kaydıyla 0 ile 255 dahil değerler alabilir. Dikkat edileceği &amp;uuml;zere 0 ile 255 dahil aradaki değerler olarak ifade ettik. Bu son derece doğal &amp;ccedil;&amp;uuml;nk&amp;uuml; 0&amp;rsquo;dan itibaren gelen pozitif sayıları vurguluyoruz. Lakin n1 değerini 1 arttırdığımızda 128 rakamına geliriz ve esas itibariyle alınabilecek değerler hata mesajının da belirttiği &amp;uuml;zere -127 ile 128 arasındadır. Yani işaretli tamsayılar da 0&amp;rsquo;ın sağ ve soluna doğru ilerlendiğini dolayısıyla 2 &amp;uuml;zeri ifadesinde bulunan değerin yarısı kadarlık bir sayı alanının işaret edildiğini s&amp;ouml;ylesek yeridir. Diğer yandan aşağıdaki gibi değişken tanımlamaları yapmak da m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;let corner1 = 1.234; // varsayılan olarak f32
let corner: f32 = 1.23456; // 32 bitlik floating number
let corner = 1_u8; // son ek vererek de değişkenin hangi t&amp;uuml;rden olacağını s&amp;ouml;yleyebiliriz. u16,&lt;/pre&gt;
&lt;p&gt;Biraz araştırma yaparak diğer veri t&amp;uuml;rleri ile ilgili kısa bilgiler bulabilirsiniz. Devam etmeden &amp;ouml;nce mutable olma durumu ile ilgili birka&amp;ccedil; şey s&amp;ouml;yleyelim. Değerinin değişmeyeceği bilinen değişkenler s&amp;ouml;z konusu olduğunda uygulamanın bellek sahası g&amp;uuml;venliğinin daha kolay sağlanacağı aşikardır. Bu, Rust tarafında değişkenlerin varsayılan olarak immutable olmasını da a&amp;ccedil;ıklar. &amp;Ccedil;&amp;uuml;nk&amp;uuml; g&amp;uuml;venli bellek sahaları &amp;ouml;n plandadır. Ayrıca immutable kullanımının performans &amp;uuml;zerinde de olumlu etkileri vardır.&lt;/p&gt;
&lt;p&gt;Mutable demişken &amp;ccedil;alışma zamanında i&amp;ccedil;eriği değiştirilebilir sıralı veri k&amp;uuml;melerine de ihtiyacımız mutlaka olacaktır. Sıralı veri k&amp;uuml;meleri i&amp;ccedil;in Rust tarafında en temelde array, vector gibi tiplerinden yararlanılır. Tahmin edileceği &amp;uuml;zere her ikisi de varsayılan olarak immutable niteliklidir. Dizi&lt;em&gt;(array)&lt;/em&gt; zaten programlama dillerinin olmazsa olmaz temel yapıtaşlarından birisidir. Rust tarafında diziler tek tip veri taşıyabilirler ve boyutları sabittir. Vector t&amp;uuml;r&amp;uuml; de benzer şekilde tek tiple &amp;ccedil;alışır. Elbette struct enstr&amp;uuml;manını kullanarak kendi veri yapılarımızı tasarlayabilir ve hem array hem de vector t&amp;uuml;r&amp;uuml; i&amp;ccedil;in kullanabiliriz. Bu iki t&amp;uuml;r&amp;uuml;n kullanımına ilişkin &amp;ccedil;ok basit bir kod par&amp;ccedil;asını aşağıdaki gibi ele alalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let points: [i8; 5] = [3, 4, 1, 8, 9];
    for p in points.iter() {
        print!("{},", p);
    }

    print!("\n");

    let colors: Vec&amp;lt;&amp;amp;str&amp;gt; = vec!["mavi", "kırmızı", "beyaz", "gri", "sarı"];

    for c in colors.iter() {
        print!("{}\t", c);
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_5.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Points isimli i8 t&amp;uuml;r&amp;uuml;nden 5 elemanlı bir dizi ve string literal t&amp;uuml;r&amp;uuml;nden herhangi bir sayıda eleman i&amp;ccedil;erebilecek colors isimli bir vector tanımlandığını g&amp;ouml;r&amp;uuml;yoruz. Diziyi tanımlarken eleman sayısını belirttiğimize dikkat edelim. Gerek dizi gerek vector elemanlarında ileri y&amp;ouml;nl&amp;uuml; d&amp;ouml;ng&amp;uuml;ler oluşturmak i&amp;ccedil;in iter fonksiyonundan yararlanıldığını g&amp;ouml;r&amp;uuml;yoruz. Bu şimdilik daha ileride ele alacağımız bir konu. Peki dizinin elemanlarından birisinin değerini değiştirmek ve hatta colors isimli vector&amp;rsquo;e pink isimli yeni bir değer eklemek istesek... Muhtemelen aşağıdaki gibi bir kod par&amp;ccedil;ası &amp;uuml;zerinden ilerleriz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let points: [i8; 5] = [3, 4, 1, 8, 9];
    for p in points.iter() {
        print!("{},", p);
    }
    points[0] += 1;

    print!("\n");

    let colors: Vec&amp;lt;&amp;amp;str&amp;gt; = vec!["mavi", "kırmızı", "beyaz", "gri", "sarı"];
    colors.push("pink");
    for c in colors.iter() {
        print!("{}\t", c);
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_6.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında buraya kadar yazılanları dikkatli bir şekilde okuduysanız programı daha &amp;ccedil;alıştırmadan sorunu s&amp;ouml;yleyebilirsiniz. Kurala g&amp;ouml;re t&amp;uuml;m değişkenler aksi belirtilmedik&amp;ccedil;e değiştirilemez&lt;em&gt;(immutable)&lt;/em&gt; olarak tanımlanırlar.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let mut points: [i8; 5] = [3, 4, 1, 8, 9];
    for p in points.iter() {
        print!("{},", p);
    }
    points[0] += 1;

    print!("\n");

    let mut colors: Vec&amp;lt;&amp;amp;str&amp;gt; = vec!["mavi", "kırmızı", "beyaz", "gri", "sarı"];
    colors.push("pink");
    for c in colors.iter() {
        print!("{}\t", c);
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_7.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi farklı bir şey deneyelim. Dizi elemanlarını bir d&amp;ouml;ng&amp;uuml; ile birer sayı artırmak istediğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu pek &amp;ccedil;ok dilde hi&amp;ccedil;bir sorun ile karşılaşmadan rahatlıkla yapabileceğimiz bir şey &amp;ouml;yle değil mi? &amp;Ouml;yleyse bir bakalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let mut points: [i8; 5] = [3, 4, 1, 8, 9];
    for p in points.iter() {
        p += 1;
        print!("{},", p);
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_8.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Upss!!! Hata mesajına g&amp;ouml;re &amp;amp;i8 t&amp;uuml;r&amp;uuml;ne += operat&amp;ouml;r&amp;uuml;n&amp;uuml; uygulayamayacağımız s&amp;ouml;yleniyor. Hemen alt tarafta da bir &amp;ouml;neri yer alıyor&lt;em&gt;(İşte Rust derleyicisinin g&amp;uuml;zel yanlarından birisi daha)&lt;/em&gt; Konuyu daha net anlamak i&amp;ccedil;in iter fonksiyonunun kaynak kodlarına da bakabiliriz ancak şimdilik buna gerek yok. Referans edilen değişkeni * operat&amp;ouml;r&amp;uuml; ile dereference ederek devam edelim.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let mut points: [i8; 5] = [3, 4, 1, 8, 9];
    for p in points.iter() {
        *p += 1;
        print!("{},", p);
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_9.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hımmm&amp;hellip; İstediğimiz tam olarak bu değildi aslında. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere bir dizinin elemanlarını, onu dolaştığımız d&amp;ouml;ng&amp;uuml; i&amp;ccedil;erisinde değiştirmek istediğimizde iter_mut isimli farklı bir fonksiyon kullanmamız tavsiye ediliyor. Aslında bu metotlar iterator deseninin uygulandığı fonksiyonlardır. Bu desen, dizi ve vector gibi veri t&amp;uuml;rleri i&amp;ccedil;in built-in olarak zaten yazılmıştır. iter ve iter_mut fonksiyonları aşağıdaki veri yapılarını&lt;em&gt;(struct)&lt;/em&gt; d&amp;ouml;nd&amp;uuml;recek şekilde tasarlanmışlardır.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;pub struct IterMut&amp;lt;'a, T: 'a&amp;gt; {
    ptr: NonNull&amp;lt;T&amp;gt;,
    end: *mut T,
    _marker: PhantomData&amp;lt;&amp;amp;'a mut T&amp;gt;,
}

pub struct Iter&amp;lt;'a, T: 'a&amp;gt; {
    ptr: NonNull&amp;lt;T&amp;gt;,
    end: *const T,
    _marker: PhantomData&amp;lt;&amp;amp;'a T&amp;gt;,
}&lt;/pre&gt;
&lt;p&gt;struct veri t&amp;uuml;r&amp;uuml;ne daha sonra geleceğiz ve hatta bu kodlarda 'a, T gibi bir takım bilmediğimiz ifadeler de var. Şimdilik bu iki veri yapısında kullanılan _marker alanları arasındaki farkı bilsek yeterli. Dikkat edileceği &amp;uuml;zere IterMut yapısında T t&amp;uuml;r&amp;uuml;n&amp;uuml;n mutable bir referans olarak ele alınması s&amp;ouml;z konusu. Diğerinde ise varsayılan kullanım olan immutable s&amp;ouml;z konusu. Şimdi kodlarımızı aşağıdaki gibi değiştirirsek sorun &amp;ccedil;&amp;ouml;z&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_10.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Rust g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere değişkenlerin kullanımlarında, değiştirilebilir olup olmamalarında olduk&amp;ccedil;a titiz davranmakta.&lt;/p&gt;
&lt;p&gt;Dizi ve vector gibi kullanabileceğimiz başka ardışık veri t&amp;uuml;rleri de var. Standart k&amp;uuml;t&amp;uuml;phanede yer alan HashMap bunlardan birisi. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını ele alalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;use std::collections::HashMap;

fn main() {
    let mut color_codes: HashMap&amp;lt;&amp;amp;str, u8&amp;gt; = HashMap::new();
    color_codes.insert("Red", 10);
    color_codes.insert("Blue", 20);
    color_codes.insert("Green", 30);

    let blue_code: u8 = color_codes.get("Blue");
    println!("Mavi renk kodu {}", blue_code);
}&lt;/pre&gt;
&lt;p&gt;Program kodunda HashMap kullanılacağını baştaki crate bildirimi ile yapmaktayız. color_codes bir HashMap ve ilk new fonksiyonu ile &amp;ouml;rnekleniyor. Ardından bu k&amp;uuml;meye string literal ve işaretsiz 8 bit tamsayı &amp;ccedil;iftlerinden oluşan bazı &amp;ouml;rnekler ekleniyor. color_codes &amp;uuml;st&amp;uuml;nden get fonksiyonunu kullanaraktan da mavi renk kodunu almak istiyoruz. Aslında farklı bir programlama dilinden gelen birisi g&amp;ouml;z&amp;uuml;yle baktığımızda ortada bir sorun g&amp;ouml;r&amp;uuml;nm&amp;uuml;yor ama&amp;hellip;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_11.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Haydi bakalım&amp;hellip; get fonksiyonu i&amp;ccedil;in key karşılığı olan value değerinin yerine Option t&amp;uuml;r&amp;uuml;n&amp;uuml;n d&amp;ouml;nd&amp;uuml;ğ&amp;uuml; belirtilmekte. Aslında get fonksiyonunun Option enum sabiti ile &amp;ccedil;alışmasının g&amp;uuml;zel bir nedeni var. Girilen parametre ilgili koleksiyonda olmayan bir key ise normal şartlarda hata oluşması lazım. Bu nedenle get fonksiyonu Rust i&amp;ccedil;inde aşağıdaki gibi tanımlanmış&amp;nbsp; bir enum sabiti d&amp;ouml;ner.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;pub enum Option&amp;lt;T&amp;gt; {
    None,
    Some(T),
}&lt;/pre&gt;
&lt;p&gt;Bu generic bir t&amp;uuml;r. T parametresi t&amp;uuml;r&amp;uuml;nde Some isimli bir alan ve None i&amp;ccedil;eriyor. None tahmin edileceği &amp;uuml;zere yok, olmayan, bulunamadı anlamında. Bir başka deyişle HashMap&amp;rsquo;in get fonksiyonu eğer parametre olarak gelen değer veri k&amp;uuml;mesinde varsa Some(T), aksi durumda None şeklinde d&amp;ouml;n&amp;uuml;ş yapacak. &amp;Ccedil;ok doğal olarak bunun gibi Option d&amp;ouml;nen fonksiyonlarda Some, None olma hallerini kontrol etmemiz gerekecek. Bu gibi durumlarda Rust&amp;rsquo;ın fonksiyonel dillerin g&amp;uuml;zide &amp;ouml;zelliklerinden sayabileceğimiz pattern matching imkanlarından yararlanabiliriz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;use std::collections::HashMap;

fn main() {
    let mut color_codes: HashMap&amp;lt;&amp;amp;str, u8&amp;gt; = HashMap::new();
    color_codes.insert("Red", 10);
    color_codes.insert("Blue", 20);
    color_codes.insert("Green", 30);

    match color_codes.get("Blue") {
        Some(code) =&amp;gt; {
            println!("Mavi i&amp;ccedil;in renk kodu {}", code);
            println!("Burası kod bloğu. Başka şeyler de yapılabilir.")
        }
        None =&amp;gt; println!("Renk kodunu kontrol edelim. Veri k&amp;uuml;mesinde bulunamadı"),
    }
}&lt;/pre&gt;
&lt;p&gt;match ifadesinde get &amp;ccedil;ağrısından d&amp;ouml;nen Option nesnesinin olası t&amp;uuml;m durumları ele alınmaktadır. Some, yani bir değer bulunmuşsa kısmında s&amp;uuml;sl&amp;uuml; parantezler a&amp;ccedil;ılmıştır. Sadece bir match dalının kod bloğu i&amp;ccedil;erdiğini g&amp;ouml;stermek i&amp;ccedil;in. None dalında olduğu gibi tek satırlık bir ifade de kullanılabilir&lt;em&gt;( =&amp;gt; operat&amp;ouml;r&amp;uuml;n&amp;uuml; matematikteki &amp;ldquo;ise&amp;rdquo; olarak d&amp;uuml;ş&amp;uuml;nebilirsiniz)&lt;/em&gt; Option enum sabiti ve pattern matching i&amp;ccedil;erisindeki kullanımını d&amp;uuml;ş&amp;uuml;n&amp;uuml;nce şunu da s&amp;ouml;yleyebiliriz; kendi enum sabitlerimizde farklı t&amp;uuml;rden alanlar s&amp;ouml;z konusu olduğunda pattern matching ile olası t&amp;uuml;m sonu&amp;ccedil;ları kontrol etme şansımız vardır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_12.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İlgin&amp;ccedil; olan durumlardan birisi aslında unwrap ile veya doğrudan [] operat&amp;ouml;r&amp;uuml; ile ilgili değerlere ulaşabilmemizdir. Yani aşağıdaki gibi.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;use std::collections::HashMap;

fn main() {
    let mut color_codes: HashMap&amp;lt;&amp;amp;str, u8&amp;gt; = HashMap::new();
    color_codes.insert("Red", 10);
    color_codes.insert("Blue", 20);
    color_codes.insert("Green", 30);

    let blue_code: u8 = color_codes["Blue"];
    println!("Mavi renk kodu {}", blue_code);
    let red_code = color_codes.get("Red").unwrap();
    println!("Kırmızı renk kodu {}", red_code);
}&lt;/pre&gt;
&lt;p&gt;Ne var ki bu kullanımlar tehlikelidir nitekim yine hatalı renk kodu istenmesi halinde program panikleyerek sonlanır. Kodda Red yerine Redd kullandığımızda &lt;strong&gt;thread 'main' panicked at 'called `Option::unwrap()` on a `None` value'&lt;/strong&gt; şeklinde bir hata mesajı ile karşılaşırız. Ger&amp;ccedil;ekten de Redd&amp;rsquo;in veri setinde bir karşılığı yoktur ve bu nedenle None değeri &amp;uuml;st&amp;uuml;nden Unwrap ile bir okuma yapılmaya &amp;ccedil;alışılmaktadır. Indeks operat&amp;ouml;r&amp;uuml;n&amp;uuml;n olduğu yerde benzer bir senaryo s&amp;ouml;z konusu olabilir. Blue yerine Bluue değerini kullandığımızda uygulama thread 'main' panicked at 'no entry found for key' şeklinde bir hata mesajı ile panikleyecek ve sonlanacaktır.&lt;/p&gt;
&lt;p&gt;Option t&amp;uuml;r&amp;uuml;n&amp;uuml;n hata y&amp;ouml;netimi konusunda da &amp;ouml;nemli bir yeri vardır. Rust, hata y&amp;ouml;netimini Option ve Result t&amp;uuml;rleri ile sağlar. Kendi tasarladığımız fonksiyonlar dahil hataya sebebiyet verebilecek durumlarda d&amp;ouml;n&amp;uuml;ş tiplerini Result&amp;lt;T,Err&amp;gt; şeklinde belirtebiliriz. Buna g&amp;ouml;re, &amp;ouml;ng&amp;ouml;rebildiğimiz durumlarda None alanına sahip Option ile tahmin edemediğimiz veya bilhassa &amp;ccedil;alışmayı durdurmak, hata yaymak istediğimiz hallerde ise Result&amp;lt;T,Err&amp;gt; ile ilerlemek gerektiğini ifade edebiliriz. Bu arada &amp;ccedil;alışma zamanında bir hata oluşması uygulamanın panikleyerek kırılması anlamına da gelir. Dolayısıyla her t&amp;uuml;r olasılığı hesaba katmamızı sağlayan Option ve Result t&amp;uuml;rleri ile &amp;ccedil;alışmak &amp;ouml;nemlidir. Result t&amp;uuml;r&amp;uuml;n&amp;uuml;n Rust k&amp;uuml;t&amp;uuml;phanesindeki tanımı aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;pub enum Result&amp;lt;T, E&amp;gt; {
    Ok(T),
    Err(E),
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere generic bir t&amp;uuml;rd&amp;uuml;r. Problem olmayan durumları i&amp;ccedil;eren Ok, hata halleri i&amp;ccedil;inse Err alanları kullanılır. Buna g&amp;ouml;re bir fonksiyonda her şey istediğimiz gibiyse Ok alanı &amp;uuml;st&amp;uuml;nden d&amp;ouml;nd&amp;uuml;rmek istediğimiz değeri verebiliriz. Bir problem s&amp;ouml;z konusu ise built-in gelen ya da kendi yazdığımız hata tiplerinden yararlanabiliriz. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını ele alalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let rng = Range { x: 35, y: 18 };
    let check = check_range(rng);
    launch_missile(check);

    let rng = Range { x: 101, y: 90 };
    launch_missile(check_range(rng));
}

struct Range {
    x: u8,
    y: u8,
}

fn check_range(r: Range) -&amp;gt; Result&amp;lt;Range, &amp;amp;'static str&amp;gt; {
    if r.x &amp;gt; 100 || r.y &amp;gt; 100 {
        return Err("Sistem dışı koordinatlar. Yeniden g&amp;uuml;d&amp;uuml;mleyin.");
    } else {
        return Ok(r);
    }
}

fn launch_missile(result: Result&amp;lt;Range, &amp;amp;'static str&amp;gt;) {
    match result {
        Ok(r) =&amp;gt; println!("F&amp;uuml;ze {}:{} konumuna y&amp;ouml;nlendirildi", r.x, r.y),
        Err(e) =&amp;gt; println!("Hata:{}", e),
    }
}&lt;/pre&gt;
&lt;p&gt;İlk kez kendi veri yapımızı tanımladık. Range bir struct ve Rust i&amp;ccedil;inde kendi veri modellerimizi tanımlamak istediğimizde kullanabileceğimiz &amp;ouml;nemli bir enstr&amp;uuml;man. check_range isimli fonksiyon parametre olarak gelen Range tipinin değerlerine bakıp bir karar veriyor. Dikkat edilmesi gereken nokta Range dışında olunması halinde bir Err nesnesi kullanılması. Diğer durumlarda Ok ile sorun olmadığını belirtiyoruz. launch_missile fonksiyonu ise parametre olarak gelen Result t&amp;uuml;r&amp;uuml;n&amp;uuml;n olası sonu&amp;ccedil;larını pattern matching tekniği ile değerlendiriyor. Aptalca bir kod par&amp;ccedil;ası ancak hata y&amp;ouml;netimi noktasında Result tipi ile &amp;ccedil;alışmanın basit bir &amp;ouml;rneği olarak d&amp;uuml;ş&amp;uuml;nebiliriz. Rust i&amp;ccedil;erisinde built-in gelen fonksiyonlarda Option veya Result d&amp;ouml;n&amp;uuml;şlerine sıklıkla rastlanıyor. Şunu da unutmayalım ki Rust, y&amp;ouml;netimli kod&lt;em&gt;(managed code)&lt;/em&gt; denilen bir ortama sahip değil ve bu nedenle exception handling gibi bir mekanizması ve doğal olarak try&amp;hellip;catch blokları yok. Bu nedenle hata y&amp;ouml;netiminin nasıl yapıldığını iyi anlamak &amp;ouml;nemli. Yani programcının olası her durumu ele alması kritik.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_13.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu arada fonksiyonlarda dikkatinizi &amp;ccedil;eken yabancı bir kullanım şekli olmalı. check_range ve launch_missile fonksiyon tanımlarında yer alan &amp;amp;&amp;rsquo;static str kullanımı. Burada lifetime adı verilen &amp;ouml;nemli bir kavram s&amp;ouml;z konusu. Hatta statik olanı. &amp;Ouml;rnekte kullanmak zorundayız nitekim hata mesajının &amp;ccedil;alışma zamanı &amp;ouml;mr&amp;uuml; boyunca yaşaması gerekiyor. Anlayacağınız değişkenlerin yaşam s&amp;uuml;relerini kontrol etmemiz gereken durumlar da var. Nitekim bir değişken &amp;ouml;mr&amp;uuml;n&amp;uuml; tamamladığında sahiplendiği veri de otomatikman kullanılmaz hale geliyor.&lt;/p&gt;
&lt;p&gt;Devam etmeden &amp;ouml;nce Linkerd isimli service mesh&amp;rsquo;in yaratıcısı &lt;a href="https://www.youtube.com/watch?v=8zuvqDYWUTw" target="_blank"&gt;Oliver Gould&amp;rsquo;un Why the Future of the Cloud will be Built on Rust isimli videosundan &lt;/a&gt;&amp;ouml;ğrendiğim g&amp;uuml;zel bir &amp;ouml;rneği de burada paylaşmak istiyorum. Rust dilinde null/nil bulunmuyor. O y&amp;uuml;zden Option ve Result t&amp;uuml;rlerinin &amp;ouml;nemi daha da artıyor. Rust bellekte belirsiz olan değerleri sevmez. Şimdi aşağıdaki Go kodlarına bir bakalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import "fmt"

type Product struct {
    category *Category
}

type Category struct {
    name string
}

func main() {
    tavla := new(Product)
    fmt.Printf("Hello %s", tavla.category.name)
}&lt;/pre&gt;
&lt;p&gt;Category t&amp;uuml;r&amp;uuml;nden bir alanı bulunan Product isimli struct&amp;rsquo;ın kullanımı &amp;ouml;rnekleniyor. Tavla nesnesini oluşturduktan sonra category alanına inip name değerini ekrana bastırıyoruz. Deneyimli bir geliştirici buradaki sıkıntıyı kolayca g&amp;ouml;rebilir. İşte &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_33.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere Category nesnesini &amp;ouml;rneklemediğimizden nil bir pointer referansını kullanmaya &amp;ccedil;alışıyoruz. Bu da doğal olarak &amp;ccedil;alışma zamanı hatası anlamına geliyor. Aynı &amp;ouml;rneği Rust ile yazalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let tavla = Product::default();
    println!("Kategorisi: {}", tavla.category.name);
}

#[derive(Default)]
struct Product {
    category: Category,
}

#[derive(Default)]
struct Category {
    name: String,
}&lt;/pre&gt;
&lt;p&gt;Bu kod &amp;ccedil;alışır ama ekrana bir kategori bilgisi yazmaz. Nitekim Default trait&amp;rsquo;leri ile bezenmiş struct&amp;rsquo;lar String alanlar i&amp;ccedil;in boş değer koyar. Esasında Product i&amp;ccedil;indeki Category t&amp;uuml;r&amp;uuml; i&amp;ccedil;in Option kullanarak kodu iyileştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let tavla = Product::default();
    println!("{}", tavla.category.name);
}

#[derive(Default)]
struct Product {
    category: Option&amp;lt;Category&amp;gt;,
}

struct Category {
    name: String,
}&lt;/pre&gt;
&lt;p&gt;Neden? &amp;Ccedil;&amp;uuml;nk&amp;uuml; derleyici, ataması yapılmamış bir category alanına erişmeye &amp;ccedil;alıştığımızı anlayacak ve bizi aşağıdaki derleme zamanı hatası ile pişman edecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_34.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Go ise &amp;ccedil;alışma zamanında bir hata mesajı verir ki null/nil kullanılan dillerde test edilmeden &amp;ccedil;ıkılan kodlar i&amp;ccedil;in bu &amp;ouml;nemli bir sorundur. Rust derleyicisi bunu &amp;ouml;nceden bildirir. Tabii yine de bir &amp;ouml;nceki kod par&amp;ccedil;asındaki gibi ka&amp;ccedil;amak yapılabilir. Dolayısıyla her durumda hangi dil olursa olsun test yazmak m&amp;uuml;thiş &amp;ouml;nemlidir. Gelelim yukarıdaki kodun nasıl kullanılması gerektiğine. İşte beyle&amp;hellip;&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let tavla = Product::default();

    let result = match tavla.category {
        Some(c) =&amp;gt; c,
        None =&amp;gt; Category {
            name: String::from("Belirsiz"),
        },
    };
    println!("{}", result.name);
}

#[derive(Default)]
struct Product {
    category: Option&amp;lt;Category&amp;gt;,
}

struct Category {
    name: String,
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_35.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere Product verisindeki category alanı Option&amp;lt;Category&amp;gt; olarak tanımlanmıştır. Pattern Matching kullanarak ger&amp;ccedil;ekten bir değer taşıyıp taşımadığını anlayabiliriz. Some hali bir kategori değeri olduğunda &amp;ccedil;alışırken, None dalı kategori nesnesi oluşturulmadığında işler. Dolayısıyla olası iki durumu da ele aldığımız bir kod ortaya &amp;ccedil;ıkar.&lt;/p&gt;
&lt;p&gt;Evet kafalar biraz karışıyor değil mi? Bir .Net geliştiricisi olarak pek &amp;ccedil;ok şeyin kontrol&amp;uuml;n&amp;uuml;n platform tarafından sağlandığı hallere alışmış olmanın bu kafa karışıklığının sebebi olduğunu d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Şimdi gelin bu karışıklığın &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek i&amp;ccedil;in değişken sahiplik kontrol&amp;uuml; &lt;em&gt;(Variable Ownership Control)&lt;/em&gt; konusuna bir bakalım.&lt;/p&gt;
&lt;p&gt;Yazının giriş b&amp;ouml;l&amp;uuml;m&amp;uuml;nde belleğin g&amp;uuml;venli saha olarak kalmasının &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ecek bazı durumlarından bahsetmiştik. Rust tarafında uygulanan sahiplenme kuralları ile bu hataların &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ilir. En &amp;ouml;nemli kuralı şudur ki; let ile bir değişken oluşturulduğunda, bu değişkenin taşıdığı kaynak değerin sahibi sadece o değişkendir. Eğer kaynak taşınır veya başka bir değişkene yeniden atanırsa, ilk değişken kaynağın sahipliğini kaybeder. Bu ana fikri aklımızda tutarak sahiplenme kurallarına bir bakalım.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Bir değerin&lt;em&gt;(value)&lt;/em&gt; sahibi kendisine atanan değişkendir&lt;em&gt;(variable)&lt;/em&gt; ve bir değişken kapsam dışına &amp;ccedil;ıktığı zaman işgal ettiği bellek alanından atılır.&lt;/li&gt;
&lt;li&gt;İlk kurala g&amp;ouml;re bir değişkenin sahiplendiği değerin atamalar sonrası diğer bir değişken tarafından nasıl kullanılabileceği sorusu ortaya &amp;ccedil;ıkar ki program yazarken bu tip ihtiya&amp;ccedil;lar son derece doğaldır. Rust&amp;rsquo;ın sunduğu teknikler şunlardır; Copy, Move, Immutable Borrow, Mutable Borrow.
&lt;ul&gt;
&lt;li&gt;Copy tekniğine g&amp;ouml;re değer kullanılacağı diğer değişken i&amp;ccedil;in kopyalanır. Kopyalamadan sonra her iki değişken de kendi değerleri ile &amp;ccedil;alışmaya devam eder.&lt;/li&gt;
&lt;li&gt;Move y&amp;ouml;nteminde değer yeni değişkene taşınır ancak klonlamadan farklı olarak orijinal değişken artık bu değere sahip değildir!&lt;/li&gt;
&lt;li&gt;Immutable Borrow durumuna g&amp;ouml;re bir değişken başka bir değişkenin değerini referans edebilir. Lakin değeri &amp;ouml;d&amp;uuml;n&amp;ccedil; alan değişken kapsam dışına &amp;ccedil;ıkarsa, referans ettiği değerde bir m&amp;uuml;lkiyet hakkı olmadığı i&amp;ccedil;in değer bellekten d&amp;uuml;ş&amp;uuml;r&amp;uuml;lmez.&lt;/li&gt;
&lt;li&gt;Son olarak mutable borrow durumuna g&amp;ouml;re başka bir değişkenin değeri referans alındıktan sonra i&amp;ccedil;eriği değiştirilebilir. Diğer değişkenin değerini &amp;ouml;d&amp;uuml;n&amp;ccedil; alan değişken kapsam dışına &amp;ccedil;ıkarsa, aynen Immutable Borrow senaryosunda olduğu gibi değeri &amp;ouml;d&amp;uuml;n&amp;ccedil; alan değişkenin referans &amp;uuml;st&amp;uuml;nde m&amp;uuml;lkiyeti olmadığından değer bellekten d&amp;uuml;ş&amp;uuml;r&amp;uuml;lmez.&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Son iki durumda ortaya &amp;ccedil;ıkabilecek bir sorun da vardır. Bunu lifetime ile ilgili kısımda g&amp;ouml;receğiz. Kurallara alışmak &amp;ccedil;ok kolay olmamakla birlikte derleyicinin akıllı ipu&amp;ccedil;ları epeyce yol g&amp;ouml;stericidir. Kuralları daha iyi g&amp;ouml;rmek i&amp;ccedil;in scope&lt;em&gt;(kodda s&amp;uuml;sl&amp;uuml; parantezler arasını tarif ettiğimiz alanlar)&lt;/em&gt; konusuna da kısaca değinmemiz gerekir. Nitekim değişkenler sıklıkla farklı scope&amp;rsquo;lara girip &amp;ccedil;ıkar. &amp;Ouml;rneğin metotlara parametre olarak gidip işlenirken. Şimdi aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let intro: String = String::from("Wellcome to the jungle!");
    {
        println!("{}", intro);
        let status: String = String::from("All is well ;)");
    }
    println!("{}", intro);
    println!("{}", status);
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_14.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında sonu&amp;ccedil;ta şaşılacak pek bir şey yok. intro isimli değişken i&amp;ccedil; blok dışında tanımlanmış olduğundan hem blok i&amp;ccedil;inde hem de dışında kullanılırken, status i&amp;ccedil;in aynı şeyi s&amp;ouml;ylememiz m&amp;uuml;mk&amp;uuml;n değildir. Nitekim sadece i&amp;ccedil; blok i&amp;ccedil;erisinde tanımlı olan bir değişkendir. String veri t&amp;uuml;r&amp;uuml;n&amp;uuml;n bilhassa se&amp;ccedil;ildiği bir &amp;ouml;rnek aslında bu. Olayı daha ilgin&amp;ccedil; hale getirmek i&amp;ccedil;in bu kez değişkenin bir fonksiyona aktarıldığı aşağıdaki senaryoyu ele alalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let intro: String = String::from("Wellcome to the jungle!");
    get_count(intro);
}

fn get_count(text: String) -&amp;gt; usize {
    let count = text.len();
    println!("'{}' c&amp;uuml;mlesindeki karakter sayısı {}", text, count);
    count
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_15.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Pek anlamı olmayan bir kod par&amp;ccedil;ası ama &amp;ccedil;alışıyor. Şimdi bir satır daha ekleyip yeniden &amp;ccedil;alıştıralım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let intro:String=String::from("Wellcome to the jungle!");
    get_count(intro);
    println!("{}",intro);
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_16.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Upss! Hata mesajına g&amp;ouml;re String t&amp;uuml;r&amp;uuml;n&amp;uuml;n Copy isimli bir trait&amp;rsquo;i kendisine uyarlamadığı s&amp;ouml;yleniyor. Bunun sebebi String nesnesinin get_count metoduna taşıma suretiyle aktarılması ve ilk değişkenin ge&amp;ccedil;ersiz hale gelmesi. Hatırlanacağı &amp;uuml;zere bir değerin sahibi tek bir değişken olabilirdi. Trait&amp;rsquo;ler ile aslında t&amp;uuml;rlere kazandırabileceğimiz davranışları tanımlarız. Eğer String t&amp;uuml;r&amp;uuml; Copy trait&amp;rsquo;ini uyarlamış olsaydı fonksiyona kopyalanarak aktarılabilir ve dolayısıyla bu ihlal ger&amp;ccedil;ekleşmezdi.&lt;/p&gt;
&lt;p&gt;Peki built-in olarak gelen bu t&amp;uuml;re Copy trait&amp;rsquo;i neden adapte edilmemiş? Yazının başlarında bir yerlerde String t&amp;uuml;r&amp;uuml;n&amp;uuml;n aslında heap alanındaki asıl veriyi tutan byte cinsinden bir vector serisini işaret ettiğini s&amp;ouml;ylemiştik. Rust kurallarına g&amp;ouml;re bir değere birden fazla referans olması kural ihlali sayılır. &amp;Ouml;rnekte intro isimli değişken fonksiyona taşındığında&lt;em&gt;(move)&lt;/em&gt; yeni bir scope i&amp;ccedil;erisine dahil olur ve dolayısıyla yok edilir ki yine kurallara g&amp;ouml;re scope dışına &amp;ccedil;ıkan değişkenler hemen bellekten d&amp;uuml;ş&amp;uuml;r&amp;uuml;l&amp;uuml;rler. Eğer değişkeni metoda taşıdıktan sonra ilk referansını korunmaya devam edersek de, sonraki anlarda bu &amp;ccedil;oklu referansların boşaltılmış olması ve başka şeyler i&amp;ccedil;eren bellek b&amp;ouml;lgelerini işaret etmemesi garanti edilemez&lt;em&gt;(unsafe olma hali)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Diğer yandan kodda hatanın vuku bulduğu yere de dikkat etmek gerekir. println! fonksiyonunun ilgili değişkeni &amp;ouml;d&amp;uuml;n&amp;ccedil;&amp;nbsp;almak&lt;em&gt;(borrowing)&lt;/em&gt; istediği belirtilir. Halbuki &amp;ouml;d&amp;uuml;n&amp;ccedil; almak istediği değişken move ile başka bir scope i&amp;ccedil;erisine taşınmış ve doğal olarak kullanılamaz haldedir. Şimdi &amp;ouml;d&amp;uuml;n&amp;ccedil; alma kavramı daha anlamlı hale gelecek. Bazı durumlarda değişken değerlerini &amp;ouml;d&amp;uuml;n&amp;ccedil; verebiliriz. Bunun i&amp;ccedil;in &amp;amp;&amp;nbsp;operat&amp;ouml;r&amp;uuml; kullanılabilir. Aynı &amp;ouml;rneği borrow &amp;ouml;zelliği ile donatalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let intro: String = String::from("Wellcome to the jungle!");
    get_count(&amp;amp;intro);
    println!("{}", intro);
}

fn get_count(text: &amp;amp;String) -&amp;gt; usize {
    let count = text.len();
    println!("'{}' c&amp;uuml;mlesindeki karakter sayısı {}", text, count);
    count
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_17.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Herhangi bir sorun olmadığı g&amp;ouml;r&amp;uuml;lebilir. Nitekim intro değişkeni get_count fonksiyonuna referans suretiyle &amp;ouml;d&amp;uuml;n&amp;ccedil; verilir. get_count fonksiyonu değer &amp;uuml;st&amp;uuml;nde bir değişiklik yapmaz. Yapmak istese de yapamaz. Gelin aşağıdaki kod par&amp;ccedil;ası ile bu duruma da bakalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let intro: String = String::from("Wellcome to the jungle!");
    get_count(&amp;amp;intro);
    println!("{}", intro);
}

fn get_count(text: &amp;amp;String) -&amp;gt; usize {
    let count = text.len();
    text.push("?".chars().next().unwrap());
    println!("'{}' c&amp;uuml;mlesindeki karakter sayısı {}", text, count);
    count
}&lt;/pre&gt;
&lt;p&gt;Uygulamayı &amp;ccedil;alıştırınca &amp;ccedil;ıktı aşağıdaki gibi olur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_18.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;d&amp;uuml;n&amp;ccedil; alınan değer &amp;uuml;st&amp;uuml;nde değişiklik yapmaya &amp;ccedil;alışıyoruz. Ancak borrow işlemi varsayılan olarak immutable&amp;rsquo;dır. Değeri alabilir, okuyabilir ama değiştiremezsiniz. Sahiplenme kurallarında da belirttiğimiz &amp;uuml;zere Mutable Borrowing burada &amp;ccedil;&amp;ouml;z&amp;uuml;m olarak kullanılabilir.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let mut intro: String = String::from("Wellcome to the jungle!");
    get_count(&amp;amp;mut intro);
    println!("{}", intro);
}

fn get_count(text: &amp;amp;mut String) -&amp;gt; usize {
    let count = text.len();
    text.push("?".chars().next().unwrap());
    println!("'{}' c&amp;uuml;mlesindeki karakter sayısı {}", text, count);
    count
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_19.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere main i&amp;ccedil;erisindeki intro değişkeni mutable olarak değiştirilmiştir. Nitekim değişken get_count fonkisyonu i&amp;ccedil;erisinde değiştirilmek istenmektedir. Ayrıca değer bu fonksiyonun kullanması i&amp;ccedil;in &amp;ouml;d&amp;uuml;n&amp;ccedil; verilirken değiştirilebilir olarak işaretlenmiştir&lt;em&gt;(&amp;amp;mut bildirimi ile)&amp;nbsp;&lt;/em&gt;Bir de integer, float gibi stack bellek b&amp;ouml;lgesinde duran verileri ele alacağımız aşağıdaki aptal kod par&amp;ccedil;asına bakalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let score = 5_i8;
    print_number(score);
    println!("{}", score);
}

fn print_number(point: i8) {
    println!("{}", point);
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_20.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere score değişkeni print_number fonksiyonuna aktarılmış ve d&amp;ouml;n&amp;uuml;şte yine main i&amp;ccedil;erisinde kullanılabilmiştir. String t&amp;uuml;r&amp;uuml;n&amp;uuml; kullandığımız &amp;ouml;rnekte meydana gelen ihlal burada yaşanmamıştır. Bu son derece doğaldır nitekim integer gibi t&amp;uuml;rler Copy trait&amp;rsquo;ini uyarlarlar. Dolayısıyla fonksiyonlara kopyalanarak alınırlar. Bu t&amp;uuml;rler stack bellek b&amp;ouml;lgesinde olup ne kadar yer kapladıkları bilindiğinden kopyalanarak alınmalarında sıkıntı yoktur. Referans t&amp;uuml;r&amp;uuml; olduğunda ise sahipliğin &amp;ouml;d&amp;uuml;n&amp;ccedil; verilmesi ve bu sayede pahalı heap maliyetinin d&amp;uuml;ş&amp;uuml;r&amp;uuml;lmesi ve g&amp;uuml;venli sahanın korunması esastır. Pek tabii integer bile olsa değerleri referans usul&amp;uuml;yle fonksiyonlara taşıyabiliriz. Eğer değerleri bu fonksiyonlar i&amp;ccedil;erisinde değiştirmek istiyorsak, mutable borrowing kuralına uymamız gerekir. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asında bu durum g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let mut score = 5_i8;
    print_number(score);
    increase_one(&amp;amp;mut score);
    print_number(score);
    increase_one(&amp;amp;mut score);
    println!("{}", score);
}

fn increase_one(point: &amp;amp;mut i8) {
    *point += 1;
}

fn print_number(point: i8) {
    println!("{}", point);
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_21.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;String kullanılan &amp;ouml;rnekteki gibi &amp;amp;mut operat&amp;ouml;r&amp;uuml; ile referansın mutable olarak alınması ve aktarılması s&amp;ouml;z konusudur. Doğal olarak increase_one fonksiyonun i&amp;ccedil;inde score değeri değiştirildik&amp;ccedil;e, main i&amp;ccedil;erisindeki asıl değer de değişir. increase_one fonksiyonunda birde * operat&amp;ouml;r&amp;uuml; kullanıldığı g&amp;ouml;z&amp;uuml;n&amp;uuml;zde ka&amp;ccedil;mamış olsa gerek. Bu operat&amp;ouml;r dereference anlamına gelir.&amp;nbsp;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Scope Rust i&amp;ccedil;in No Memory Leak garantisi anlamına da gelir. Aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alın.&lt;/p&gt;
&lt;p&gt;static mut number: u8 = 7; // global variable&lt;br /&gt;fn main() {&lt;br /&gt;&amp;nbsp; &amp;nbsp;println!("Number is {}",number); // use of mutable static is unsafe and requires unsafe function or block&lt;br /&gt;}&lt;/p&gt;
&lt;p&gt;Tanımlanan global değişkenin bir scope i&amp;ccedil;erisinde kullanılması Rust derleyicisini rahatsız eder. Ger&amp;ccedil;ekten bunu istiyorsanız unsafe bir blok a&amp;ccedil;manız istenir.&lt;/p&gt;
&lt;p&gt;unsafe {&lt;br /&gt;&amp;nbsp; &amp;nbsp;println!("The number is {}", number);&lt;br /&gt;&amp;nbsp; &amp;nbsp;number += 1;&lt;br /&gt;&amp;nbsp; &amp;nbsp;println!("The new number is {}", number);&lt;br /&gt;}&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Değişken sahipliğinin &amp;ouml;d&amp;uuml;n&amp;ccedil; verilmesi ile ilgili dikkat edilmesi gereken bir husus da &amp;ouml;l&amp;uuml; bir değişkene referans verilme riski taşımasıdır. Burada yine kafaları karıştırabilecek bir senaryo var. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını ele alalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let outer;
    {
        let inner = 1.2345;
        outer = &amp;amp;inner;
    }
    println!("{}", outer);
}&lt;/pre&gt;
&lt;p&gt;İlk değeri olmayan outer isimli bir değişkenimiz var ve takip eden scope i&amp;ccedil;erisinde inner isimli başka bir değişken tanımlanıyor. Sonrasında inner&amp;rsquo;dan outer&amp;rsquo;a doğru bir atama g&amp;ouml;r&amp;uuml;l&amp;uuml;yor. Burada sahiplik referans usul&amp;uuml; ile &amp;ouml;d&amp;uuml;n&amp;ccedil; veriliyor. main fonksiyonundan &amp;ccedil;ıkmadan &amp;ouml;nce ise outer değeri ekrana basılıyor. Basacağını &amp;uuml;mit ediyoruz. main i&amp;ccedil;inde bir scope a&amp;ccedil;tığımız i&amp;ccedil;in kodun &amp;ccedil;alışmasına dair zihninizde birtakım ş&amp;uuml;pheler oluşmuştur eminim ki. &amp;Ccedil;alışma zamanı &amp;ccedil;ıktısı da bu ş&amp;uuml;phelerinizi doğrulayacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_23.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sorun şu ki inner isimli değişken i&amp;ccedil; kapsam sona erdiğinde &amp;ouml;l&amp;uuml;r ve hemen bellekten d&amp;uuml;ş&amp;uuml;r&amp;uuml;l&amp;uuml;r. Lakin main fonksiyonu kapsamında yaşayan outer onun değerini &amp;ouml;d&amp;uuml;n&amp;ccedil; almıştır ve pek tabii println! makrosuna gelindiğinde bu referans artık yoktur. Derleyici haklı olarak inner değişkeninin yeteri kadar uzun yaşamadığını s&amp;ouml;yleyerek yakınır&lt;em&gt;(Hey programcı ne yaptığına dikkat et!)&lt;/em&gt; G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere son derece basit bir kod par&amp;ccedil;ası ama Rust&amp;rsquo;ın bir kural ihlaline takılmış durumda. Yani değişkenlerin yaşam &amp;ouml;m&amp;uuml;rleri scope&amp;rsquo;lara bağlı olarak program &amp;ccedil;alıştığı m&amp;uuml;ddet&amp;ccedil;e ge&amp;ccedil;erli olmayabilir. Şimdi aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let mine = 6;
    let yours = 7;
    let result = find_greatest(&amp;amp;mine, &amp;amp;yours);
    println!("{}", result);
}

fn find_greatest(x: &amp;amp;i8, y: &amp;amp;i8) -&amp;gt; &amp;amp;i8 {
    if x &amp;gt; y {
        return x;
    } else {
        return y;
    }
}&lt;/pre&gt;
&lt;p&gt;Normal şartlarda find_greatest fonksiyonuna değerleri referans olarak değil de &amp;amp; kullanmadan normal olarak taşıyabilirdik. Teorik olarak bir sorun olmamasını bekleyebilirsiniz. Hatta bir &amp;ouml;nceki paragraftan hi&amp;ccedil; bahsetmeseydik kodun &amp;ccedil;alışacağından y&amp;uuml;zde y&amp;uuml;z emin olabilirdiniz. Ne var ki derleme zamanında aşağıdaki hatayı alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_24.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bir lifetime parametresi bekleniyor. &amp;Uuml;stelik nasıl uygulanması gerektiğine dair bir &amp;ouml;neri de help kısmında yer alıyor. Rust&amp;rsquo;ın derleyici hatalarına istinaden bulunduğu &amp;ouml;neriler yazılımcıya epeyce yardımcı oluyor. Gelelim koddaki soruna. mine ve yours değişkenlerini fonksiyona referans olarak verdiğimizde doğal olarak o scope i&amp;ccedil;erisine &amp;ouml;d&amp;uuml;n&amp;ccedil; veriliyor ve fonksiyon tamamlandığında &amp;ouml;l&amp;uuml;yorlar. Sorun şu ki fonksiyon geriye bir referans d&amp;ouml;n&amp;uuml;yor ve aslında if koşulu sebebiyle parametrelerden hangisinin d&amp;ouml;neceği ve dolayısıyla scope dışına &amp;ccedil;ıkıldığında hangisinin yaşamaya devam etmesi gerektiği belirsiz. Bu kullanıma g&amp;ouml;re bizim a&amp;ccedil;ık bir şekilde değişkenlerin yaşam s&amp;uuml;relerini belirtmemiz gerekiyor. Hatta bunu yaparken hepsini aynı lifetime değerine bağlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let mine = 6;
    let yours = 7;
    let result = find_greatest(&amp;amp;mine, &amp;amp;yours);
    println!("{}", result);
}

fn find_greatest&amp;lt;'a&amp;gt;(x: &amp;amp;'a i8, y: &amp;amp;'a i8) -&amp;gt; &amp;amp;'a i8 {
    if x &amp;gt; y {
        return x;
    } else {
        return y;
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_25.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;'a ile lifetime parametresi belirliyoruz. Buna g&amp;ouml;re x,y ve find_greatest fonksiyonunun d&amp;ouml;n&amp;uuml;ş referansı aynı yaşam s&amp;uuml;relerine sahip olacak. Lifetime parametrelerinde genellikle a,b,c gibi harfler kullanılmakta ve aslında birden fazla farklı yaşam &amp;ouml;mr&amp;uuml;ne sahip kullanımlar da m&amp;uuml;mk&amp;uuml;n. Aynı &amp;ouml;rnek &amp;uuml;zerinden aşağıdaki gibi bir kullanımı ele alalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;fn main() {
    let mine = 8;
    let yours = 7;
    let result = find_greatest(&amp;amp;mine, &amp;amp;yours);
    println!("{}", result);
}

fn find_greatest&amp;lt;'a, 'b&amp;gt;(x: &amp;amp;'a i8, y: &amp;amp;'b i8) -&amp;gt; &amp;amp;'a i8 {
    if x &amp;gt; y {
        return x;
    } else {
        return y;
    }
}&lt;/pre&gt;
&lt;p&gt;Bir cinlik yapıp, bilerek ve isteyerek mine değerini yours değerinden b&amp;uuml;y&amp;uuml;k verdik. Eh ne de olsa find_greatest metodu x ile gelen yaşam &amp;ouml;mr&amp;uuml; kadar &amp;ouml;mr&amp;uuml; olan bir sonu&amp;ccedil; d&amp;ouml;necek. Yemezler :P&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_26.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Yaşam s&amp;uuml;releri ile ilgili olarak Rust derleyicisi &amp;ouml;mr&amp;uuml; en kısa olana g&amp;ouml;re hareket etmek ister. &amp;Ccedil;&amp;uuml;nk&amp;uuml; derleyici, &amp;ccedil;alışma zamanının m&amp;uuml;mk&amp;uuml;n olduğunca az değişkenle uğraşmasını ve referansların gereksiz yere yaşamamasını tercih eder. Bu, kaynakların etkin kullanımı a&amp;ccedil;ısından da &amp;ouml;nemlidir. Lifetime parametrelerini yazmak değil ama hangi durumda nerede kullanılması gerektiğine karar vermek ilk başlarda hi&amp;ccedil; kolay değil. Ancak Rust&amp;rsquo;ın standart k&amp;uuml;t&amp;uuml;phane kodlarına bakaraktan da bu konuda &amp;ccedil;ok şey &amp;ouml;ğrenilebilir. Mesela vector t&amp;uuml;r&amp;uuml;n&amp;uuml;n iteratsyon desenini uyguladığı noktada lifetime parametreleri vardır. &lt;a href="https://doc.rust-lang.org/src/alloc/vec/mod.rs.html#400-403" target="_blank"&gt;Şuradan kaynak kodlarını inceleyin derim.&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Nesne y&amp;ouml;nelimli dillerde yaşayan birisi olarak insanın g&amp;ouml;zleri &amp;ccedil;oğu zaman sınıfları arıyor. Aslında veri yapısı&lt;em&gt;(data structure)&lt;/em&gt; olarak d&amp;uuml;ş&amp;uuml;nmeyi &amp;ccedil;oktan unuttuk gibi. Bir veri yapısı &amp;ccedil;oğunlukla modellemeler i&amp;ccedil;in gerekli t&amp;uuml;m ihtiyacı karşılar. Adı &amp;uuml;st&amp;uuml;nde verinin yapısını tanımlar. İsterseniz onu fonksiyonlarla donatıp aksiyonlar y&amp;uuml;kleyebilirsiniz. Normal de C# ile bir sınıf yazıp i&amp;ccedil;erisine o sınıf i&amp;ccedil;in gerekli metotları koyarak ilerleriz. Nadiren struct tasarlarız. Rust tarafında sınıf yoktur ve tek kullanacağınız şey struct&amp;rsquo;tır. Bir struct tanımlarken ger&amp;ccedil;ekten veri yapısı olarak inşa edersiniz. Sonrasında fonksiyonlar ekleyebilirsiniz. Vector kullandığımız kısımda aslında &amp;ccedil;ok basit bir struct kullanmıştık. Yine de line of business insanlarını kırmayalım ve struct konusuna da kısaca bakalım. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;ası ile başlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;struct Product {
    title: String,
    price: f32,
    unit_count: i32,
}

fn main() {
    let keyboard = Product {
        title: String::from("ElCi 103 tuş klavye"),
        price: 99.99,
        unit_count: 6,
    };
    println!("{} ({})", keyboard.title, keyboard.price);
    set_price(keyboard, 95.55);
    println!("{} ({})", keyboard.title, keyboard.price);
}

fn set_price(mut p: Product, price: f32) -&amp;gt; Product {
    p.price = price;
    p
}&lt;/pre&gt;
&lt;p&gt;Product isimli veri yapısı sembolik olarak bir &amp;uuml;r&amp;uuml;n&amp;uuml; temsil etmekte. İ&amp;ccedil;inde &amp;ccedil;ok az alan var. String t&amp;uuml;r&amp;uuml;nden title, 32 bit float t&amp;uuml;r&amp;uuml;nden price ve 32 bit integer t&amp;uuml;r&amp;uuml;nden unit_count. set_price isimli metot bir Product değişkenini alıp fiyatını gelen parametreye g&amp;ouml;re değiştiriyor ve g&amp;uuml;ya kendisini geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;yor. main fonksiyonu i&amp;ccedil;erisinde keyboard isimli Product t&amp;uuml;r&amp;uuml;nden bir değişken tanımlıyoruz. Ardından set_price fonksiyonunu kullanarak &amp;uuml;r&amp;uuml;n fiyatını değiştiriyoruz. Değişimden &amp;ouml;nce ve sonra ise &amp;uuml;r&amp;uuml;n&amp;uuml;n birtakım bilgilerini ekrana yazdırıyoruz. Aslında sade bir senaryo ve doğal koşullar altında bir problem olmadan &amp;ccedil;alışmasını bekliyoruz. Şimdi derleme zamanı sonu&amp;ccedil;larına bir bakalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_27.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İlk &amp;ouml;rneklerimizde literal str kullandığımızda da benzer bir hata mesajı almıştık. Tasarladığımız struct Copy trait&amp;rsquo;ini uygulayarak bu işin &amp;uuml;stesinden gelebilir ancak biz temel sorunun ne olduğuna bakalım. Keyboard değişkeni, set_price fonksiyonuna alındıktan sonra scope değiştirmiş olur ve fonksiyon sonlandığında da doğrudan silinir. Bu nedenle set_price &amp;ccedil;ağrısı sonrası artık ortada kullanılabilir bir keyboard değeri kalmayacaktır. Kullanabileceğimiz yolları d&amp;uuml;ş&amp;uuml;n&amp;uuml;rsek değeri mutable referans olarak taşıyarak ilerleyebileceğimi anlarız. Yani aşağıdaki kod par&amp;ccedil;asın olduğu gibi.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;struct Product {
    title: String,
    price: f32,
    unit_count: i32,
}

fn main() {
    let mut keyboard = Product {
        title: String::from("ElCi 103 tuş klavye"),
        price: 99.99,
        unit_count: 6,
    };
    println!("{} ({})", keyboard.title, keyboard.price);
    set_price(&amp;amp;mut keyboard, 95.55);
    println!("{} ({})", keyboard.title, keyboard.price);
}

fn set_price(p: &amp;amp;mut Product, price: f32) -&amp;gt; &amp;amp;Product {
    p.price = price;
    p
}&lt;/pre&gt;
&lt;p&gt;D&amp;ouml;rt yerde değişiklik yaptık. set_price fonksiyonunun parametre ve d&amp;ouml;n&amp;uuml;ş t&amp;uuml;r&amp;uuml;nde, keyboard değişkeninin tanımlanmasında ve set_price fonksiyonunun &amp;ccedil;ağırılmasında. &amp;Ccedil;alışma zamanı &amp;ccedil;ıktısına bir bakalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_28.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu arada kullanmadığımız unit_count alanı i&amp;ccedil;in bir de uyarı verdiğini g&amp;ouml;rebilirsiniz. Ayrıca bu tip kullanımlarınız var ve uyarılar &amp;ccedil;ıkmasın istiyorsanız&lt;em&gt;(ki dili &amp;ouml;ğrenirken bazen &amp;ccedil;ıktıyı sadeleştirmek i&amp;ccedil;in gerekiyor)&lt;/em&gt; dead_code kullanımına izin vererek ilerleyebilirsiniz. Nasıl yapılacağına dair bir ipucunu derleyici note alanında belirtiyor.&amp;nbsp;Aslında struct t&amp;uuml;r&amp;uuml;n&amp;uuml; kullanırken onu ger&amp;ccedil;ekten bir veri yapısı olarak tasarlarız. Onunla ilişkilendirmek istediğimiz fonksiyonları ise yukarıdaki gibi değil aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asında olduğu gibi yazarız.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;enum Status {
    High(i32),
    Normal(i32),
    Low(i32),
    Note(String),
}

struct Product {
    title: String,
    price: f32,
    unit_count: i32,
    status: Status,
}

impl Product {
    fn new(t: String, prc: f32, c: i32, s: Status) -&amp;gt; Product {
        Product {
            title: t,
            price: prc,
            unit_count: c,
            status: s,
        }
    }
    fn discount(&amp;amp;mut self, rate: f32) {
        self.price -= self.price * rate;
    }
    fn to_string(&amp;amp;self) -&amp;gt; String {
        format!(
            "{}. Fiyat: {}. Stok miktarı: {}",
            self.title, self.price, self.unit_count
        )
    }
}

fn main() {
    let mut keyboard = Product::new(
        String::from("ElCi 103 tuş klavye"),
        59.99,
        9,
        Status::Low(9),
    );
    println!("{}", keyboard.to_string());
    keyboard.discount(0.10);
    println!("{}", keyboard.to_string());
}&lt;/pre&gt;
&lt;p&gt;Biraz uzun bir kod par&amp;ccedil;ası gibi g&amp;ouml;r&amp;uuml;nebilir ama kısaca neler yaptığımızı a&amp;ccedil;ıklamaya &amp;ccedil;alışalım. Product veri yapısını bir enum tipi ile genişlettik. Enum tanımı i&amp;ccedil;erisinde farklı t&amp;uuml;rden sabitler barındırabiliriz. S&amp;ouml;z gelimi Status enum sabitindeki High, Low ve Normal alanları i32 tipinden değerlerde almaktadır. Stok seviyesini miktarı ile tutabileceğimiz bir sabit değer olarak d&amp;uuml;ş&amp;uuml;nebiliriz. Diğer yandan hepsinden farklı bir durum i&amp;ccedil;in Note isimli String t&amp;uuml;r&amp;uuml;nden bir alan kullanılabilir. main fonksiyonunda keyboard değişkenini oluştururken Status alanını nasıl atadığımıza dikkat edin.&lt;/p&gt;
&lt;p&gt;Genellikle nesne y&amp;ouml;nelimli d&amp;uuml;nya insanı i&amp;ccedil;in ger&amp;ccedil;ek hayattaki bir şeyin kod tarafındaki soyut tasarımı sınıflar ile yapılır. Sınıflar, yapıcı metotlar ve farklı t&amp;uuml;rde işlevler barındırır. Rust dilinde struct t&amp;uuml;r&amp;uuml;nden bir nesneyi constructor ile oluşturmak aslında bir fonksiyon &amp;ccedil;ağrısından başka bir şey değildir. Genel olarak new isimli bir fonksiyon kullanılır ve ilgili struct&amp;rsquo;ı geriye d&amp;ouml;ner&lt;em&gt;(İsmi new olmak zorunda değil, &amp;ldquo;init&amp;rdquo; diye de verebilirsiniz &amp;ldquo;yeni&amp;rdquo; de ancak genel jargona uymakta yarar var)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bir Struct ile ilişkilendirilecek metotlar impl ile başlayan bloklarda tanımlanır. &amp;Ouml;rnekteki fonksiyonlarda dikkat &amp;ccedil;ekici unsurlardan birisi de &amp;amp;mut self ve &amp;amp;self kullanımlarıdır. self ile tahmin edeceğiniz gibi struct&amp;rsquo;ın &amp;ccedil;alışma zamanındaki &amp;ouml;rneğine ait referansı işaret ediyoruz. discount fonksiyonunda fiyat bilgisini değiştirmeye &amp;ccedil;alıştığımız i&amp;ccedil;in mutable bir kullanım s&amp;ouml;z konusu&lt;em&gt;(Varsayılan olarak her şey immutable unutmayalım)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Peki ya discount ve to_string fonksiyonlarında neden &amp;amp; operat&amp;ouml;r&amp;uuml;n&amp;uuml; kullandık? Onları kaldırıp kodu denemeden sebebini d&amp;uuml;ş&amp;uuml;nmeye &amp;ccedil;alışın. Tahmin edeceğiniz &amp;uuml;zere konu d&amp;ouml;n&amp;uuml;p dolaşıp sahipliklere gelecek. to_string ve discount fonksiyonlarındaki &amp;amp; operat&amp;ouml;rlerini kaldırınca aşağıdaki derleme zamanı hataları ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_30.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dolayısıyla discount ve to_string metotlarında değişkenleri alırken sahipliklerini ge&amp;ccedil;ici olarak vermeliyiz ki kodun akışında kullanmaya devam edelim. Aksi durumda fonksiyon kapsamına giren değerler &amp;ccedil;ıkışta &amp;ouml;leceğinden main fonksiyonunun devamlılığında kullanılamaz hale geleceklerdir.&lt;/p&gt;
&lt;p&gt;Yazı boyunca birka&amp;ccedil; kez Copy trait&amp;rsquo;ini uygulamadın diye derleyicinin hışmına uğradığımız yerler oldu. Trait&amp;rsquo;ler ile ilgili olarak t&amp;uuml;rlere yeni davranışların kazandırılması noktasında kullanılabilirler demiştik. Ayrıca kod tekrarının &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ilmesi, y&amp;uuml;r&amp;uuml;t&amp;uuml;c&amp;uuml; par&amp;ccedil;aların beklediği davranışların entegre edilmesinde de kullanılırlar. S&amp;ouml;z gelimi Product nesnesine Copy trait&amp;rsquo;ini uyarladığımızda Rust derleyicisi otomatik olarak fonksiyon atamalarında kopyalama y&amp;ouml;ntemi ile aktarımı kullanacaktı.&lt;/p&gt;
&lt;p&gt;Diğer yandan sıklıkla farklı veri yapılarının aynı fonksiyonellikleri kullandığı senaryolarla karşılaşırız. Bu gibi durumlarda kod tekrarının &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek i&amp;ccedil;in Trait&amp;rsquo;ler kullanılabilir. Varsayılan bir davranış sergilerler ve bu davranışlar veri modelini donatabilir ya da veri modeli i&amp;ccedil;in bu davranışı yeniden g&amp;uuml;d&amp;uuml;mleyebiliriz&lt;em&gt;(Olaya C# tarafından bakınca bunu virtual metot kullanmaya ve override etmeye benzetiyorum. T&amp;uuml;m nesnelerin ToString metodu vardır ama istersen onu ezip kendi t&amp;uuml;r&amp;uuml;n i&amp;ccedil;in farklılaştırabilirsin)&lt;/em&gt; Trait&amp;rsquo;lerle ilgili olarak aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını ele alalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;trait AllowDelete {
    fn delete(&amp;amp;self) {
        println!("Silme ile ilgili işlemler.");
    }
}

trait AllowEdit {
    fn edit(&amp;amp;self) {
        println!("D&amp;uuml;zenleme ile ilgili işlemler.");
    }
}

struct Action {
    id: u8,
    name: String,
}

impl AllowDelete for Action {}
impl AllowEdit for Action {}

fn main() {
    let parallelizer = Action {
        name: String::from("Paralel Evren İş&amp;ccedil;isi"),
        id: 1,
    };
    println!("{}-{}", parallelizer.id, parallelizer.name);
    worker(&amp;para;llelizer);
    parallelizer.edit();
}

fn worker&amp;lt;T: AllowDelete&amp;gt;(object: &amp;amp;T) {
    object.delete();
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncelikle &amp;ccedil;alışma zamanı &amp;ccedil;ıktısına bir bakalım sonra da kodu yorumlayalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_31.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;AllowDelete ve AllowEdit isimli iki trait tanımı var. Bunların i&amp;ccedil;erisinde de varsayılan metotlar s&amp;ouml;z konusu. Action isimli struct i&amp;ccedil;in bu trait&amp;rsquo;lerin kullanılacağı belirtiliyor. Şimdi main fonksiyonu i&amp;ccedil;erisine bir bakalım. parallelizer isimli Action değişkeni worker fonksiyonuna g&amp;ouml;nderiliyor. worker fonksiyonunun tanımına dikkat edersek C# tarafındaki generic T tipi gibi bir kullanım s&amp;ouml;z konusu. &amp;Uuml;stelik koşulu da var. Koşula g&amp;ouml;re T t&amp;uuml;r&amp;uuml; AllowDelete davranışını uyarlamış olmalı. Dolayısıyla worker fonksiyonu AllowDelete davranışını taşıyan herhangi bir t&amp;uuml;r i&amp;ccedil;in kullanılabilir. T&amp;uuml;re eklenen bir trait&amp;rsquo;i doğrudan &amp;ccedil;ağırmak da m&amp;uuml;mk&amp;uuml;n. Bu y&amp;uuml;zden parallelizer değişkeni &amp;uuml;st&amp;uuml;nden edit fonksiyonunu doğrudan kullanabiliriz. İstersek bu varsayılan davranışları değiştirmek de m&amp;uuml;mk&amp;uuml;n. &amp;Ouml;rneğin,&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;impl AllowDelete for Action {
    fn delete(&amp;amp;self){
        println!("Ben biraz daha farklı &amp;ccedil;alışmak istiyorum.")
    }
}
impl AllowEdit for Action {}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Aralik/rust45_32.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Pek tabii buraya kadar &amp;ouml;ğrendiklerimiz olduk&amp;ccedil;a az. Girizg&amp;acirc;h olarak yeterli gibi ama her birinin &amp;ccedil;ok daha fazla detayı var. &amp;Ouml;zellikle Rust&amp;rsquo;ın built-in tasarım kodlarına bakınca &amp;ouml;ğrenilmesi gereken &amp;ccedil;ok şey olduğunu daha net g&amp;ouml;rebiliyorsunuz. Benim acelem yok o y&amp;uuml;zden mevzuya geniş zamana ayırıp &amp;ouml;ğrenmeye devam edeceğim. Pek tabii bol bol kod pratiği yapmakta yarar var. Aldığım notları burada sonlandırmadan &amp;ouml;nce işinize yarayacak birka&amp;ccedil; kaynağı da paylaşmak isterim.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;a href="https://tourofrust.com/00_tr.html" target="_blank"&gt;Rust Turu&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="https://cheats.rs/" target="_blank"&gt;Rust Language Cheat Sheet&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="https://blog.rust-lang.org/" target="_blank"&gt;Rust Blog&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;&lt;a href="https://doc.rust-lang.org/book/" target="_blank"&gt;The Rust Programming Language Book&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir maceramızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2021-12-24 10:00:00</pubDate>
  <slug>programcidan-programciya-rust</slug>
  <tags>
    <tag>rust-programming-language</tag>
    <tag>ownership</tag>
    <tag>borrowing</tag>
    <tag>borrow-checker</tag>
    <tag>mutable</tag>
    <tag>immutable</tag>
    <tag>cargo</tag>
    <tag>crate</tag>
    <tag>trait</tag>
    <tag>macro</tag>
    <tag>rust</tag>
    <tag>stack</tag>
    <tag>heap</tag>
    <tag>struct</tag>
    <tag>data-structures</tag>
  </tags>
  <categories>
    <category>Rust</category>
  </categories>
</post>