<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Entity Framework - Many To Many Relations</title>
  <description>Bundan yıllar önce üniversiteden arkadaşım Orkun Şentürk ile birlikte Altunizade Capitol alışveriş merkezinde Dreamcatcher isimli bir bilim kurgu gerilim filmine gittiğimizi hatırlıyorum. (Aslında bilim kurgu filmlerin tam bir hayranıyımdır. Ancak seyrettiklerimin hiç biri Starwars veya Terminator gibilerinin yerini tutmamakta) Film Stephen King' in bir romanından uyarlanmıştı. Sevgili arkadaşım Orkun kitabını okuyarak geldiğinden, film üzerinde daha iyi yorumlar yapmıştı ancak ortak kanımız çok başarılı olmadığı yönündeydi. Açıkçası fazla etkilenmemiştik.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f1%2fblg131_GirisNew.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bundan yıllar &amp;ouml;nce &amp;uuml;niversiteden arkadaşım &lt;strong&gt;Orkun Şent&amp;uuml;rk&lt;/strong&gt; ile birlikte &lt;strong&gt;Altunizade Capitol &lt;/strong&gt;alışveriş merkezinde &lt;strong&gt;Dreamcatcher &lt;/strong&gt;isimli bir bilim kurgu gerilim filmine gittiğimizi hatırlıyorum. &lt;em&gt;(Aslında bilim kurgu filmlerin tam bir hayranıyımdır. Ancak seyrettiklerimin hi&amp;ccedil; biri &lt;strong&gt;Starwars&lt;/strong&gt; veya &lt;strong&gt;Terminator &lt;/strong&gt;gibilerinin yerini tutmamakta)&lt;/em&gt; Film &lt;strong&gt;Stephen King'&lt;/strong&gt; in bir romanından uyarlanmıştı. Sevgili arkadaşım Orkun kitabını okuyarak geldiğinden, film &amp;uuml;zerinde daha iyi yorumlar yapmıştı ancak ortak kanımız &amp;ccedil;ok başarılı olmadığı y&amp;ouml;n&amp;uuml;ndeydi. A&amp;ccedil;ık&amp;ccedil;ası fazla etkilenmemiştik.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle filmden &amp;ccedil;ıktıktan sonra yaptığımız muhabbet bunu doğrular nitelikteydi. &lt;strong&gt;.Net Framework 1.1 &lt;/strong&gt;ile yazmakta olduğumuz programda kullandığımız &lt;strong&gt;SQL 2000&lt;/strong&gt; veritabanındaki &lt;strong&gt;many-to-many&lt;/strong&gt; ilişkileri anlamaya &amp;ccedil;alışıyorduk. O zamanlar bizim i&amp;ccedil;in &lt;strong&gt;SQL&lt;/strong&gt; veritabanına bağlanabilmek bile bir l&amp;uuml;ks iken bu tip alengirli konular korkutucu geliyordu. Filmden daha &amp;ccedil;ok gerildiğimiz&amp;nbsp;bir konuydu.&lt;img title="Tongue out" src="/editors/tiny_mce3/plugins/emotions/img/smiley-tongue-out.gif" alt="Tongue out" border="0" /&gt;&amp;nbsp;Sonu&amp;ccedil;ta bende sevgili &lt;strong&gt;Orkun'&lt;/strong&gt; da evlerimizin yolunu tuttuğumuzda, odamızda bizi bekleyen masa &amp;uuml;st&amp;uuml; bilgisayarlar ile&amp;nbsp;ne yapacağımızı gayet iyi biliyorduk. &lt;strong&gt;Many-To-Many&lt;/strong&gt; olayını kavramak.&lt;/p&gt;
&lt;p&gt;Ger&amp;ccedil;ektende yazılımın ilk yıllarında hepimiz benzer durumları tecr&amp;uuml;be etmekteyiz. Pek &amp;ccedil;ok konuyu anlamakta, &amp;ouml;ğrenmekte g&amp;uuml;&amp;ccedil;l&amp;uuml;k &amp;ccedil;ekiyoruz. Tabi i&amp;ccedil;imizdeki &amp;ouml;ğrenme arzusunun g&amp;uuml;c&amp;uuml;ne bağlı olaraktan, ya &amp;ccedil;ok &amp;ccedil;alışarak ya da &amp;ouml;nemli ve dikkat edilmesi gereken noktaları anında yakalayarak ilerleyişimizi s&amp;uuml;rd&amp;uuml;r&amp;uuml;yoruz. Bir yazılımcı, yıllar sonra geldiği noktadan geriye doğru d&amp;ouml;n&amp;uuml;p baktığındaysa, ilerleyişinin ne kadar hızlı olduğunu net bir şekilde g&amp;ouml;rebilir aslında. Ancak bu yeterli değildir. Dilerseniz s&amp;ouml;z&amp;uuml; fazla uzatmadan bu g&amp;uuml;nk&amp;uuml; konumuza ge&amp;ccedil;elim. Bu g&amp;uuml;n yine &lt;strong&gt;Many-To-Many&lt;/strong&gt; ilişkileri inceliyor olacağız. Ancak bu kez olayı&lt;strong&gt; Entity Framework&lt;/strong&gt; &amp;uuml;zerinden değerlendireceğiz. Başlamadan &amp;ouml;nce veritabanı &amp;uuml;zerindeki tablolar arası &lt;strong&gt;ilişkilerden(Relations)&lt;/strong&gt; kısaca bahsetmekte yarar olduğu kanısındayım.&lt;/p&gt;
&lt;p&gt;Genel olarak tablolar arasında &lt;strong&gt;bire bir(one-to-one), bire &amp;ccedil;ok(one-to-many), &amp;ccedil;oğa &amp;ccedil;ok (many-to-many)&lt;/strong&gt; ve &lt;strong&gt;self referencing &lt;/strong&gt;ilişkilerden bahsedilmektedir. Bire-bir ilişkilerde tabloda yer alan bir satırın diğer tabloda yine tek bir satır ile ilişkilendirilmesi s&amp;ouml;z konusudur. Yaygın olarak kullanılan bire-&amp;ccedil;ok ilişkilerde ise, bir tablodaki satıra diğer bir tablodan n adet satırın bağlanabilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. S&amp;ouml;z gelimi &amp;uuml;r&amp;uuml;n kategorilerinin tutulduğu tablodaki bir satırın, &amp;uuml;r&amp;uuml;nlerin tutulduğu tablodaki n satırı referans etmesi gibi. Self-Referencing ilişkilerde ise bir tablonun herhangibir satırının/satırlarının, kendi i&amp;ccedil;erisindeki bir satırı referans etmesi durumu s&amp;ouml;z konusudur. &amp;Ouml;rneğin bir şirketin organizasyon ağacında yer alan bir personelin/personel topluluğunun&amp;nbsp;kime bağlı olduğunun tutulduğu tablolarda, bu tip ilişkiler kullanılabilir.&lt;/p&gt;
&lt;p&gt;Gelelim &amp;ccedil;oğa-&amp;ccedil;ok ilişkilere. &amp;Ouml;rneğin filmler ve oyunculara ait tablolar olduğunu d&amp;uuml;ş&amp;uuml;nelim. Burada bir oyuncunun birden fazla filmde rol alması veya bir film i&amp;ccedil;erisinde birden fazla oyuncunun bulunması &amp;ccedil;ok normal ve olasıdır. Bu sebepten her iki tablo birbirleri &amp;uuml;zerinde n sayıda satırı referans edebilmektedir. Bu tip bir durumda tablolar arasındaki ilişkiyi ifade etmek i&amp;ccedil;in ek bir tablonun kullanılması s&amp;ouml;z konusudur. Bu tablo &amp;uuml;zerinden sağlanan ilişkiler sayesinde &amp;ccedil;oğa-&amp;ccedil;ok ilişkinin ger&amp;ccedil;eklenmesi m&amp;uuml;mk&amp;uuml;n olabilir.&amp;nbsp;Peki &lt;strong&gt;SQL&lt;/strong&gt; tarafında ek bir tablo yardımıyla ele alınan bu ilişkilerin &lt;strong&gt;Entity Framework&lt;/strong&gt; tarafındaki yansıması nasıldır? Gelin bu durumu basit bir &amp;ouml;rnek yardımıyla incelemeye &amp;ccedil;alışalım.&lt;/p&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;Chinook&lt;/strong&gt; veritabanında yer alan ve &lt;strong&gt;SQL&lt;/strong&gt; tarafındaki diagramda aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len ilişkilere sahip olan tabloları kullanacağımızı belirtelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg131_SqlDiagram.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Buradaki senaryoda &lt;strong&gt;Playlist&lt;/strong&gt; ve &lt;strong&gt;Track &lt;/strong&gt;tabloları arasında &amp;ccedil;oğa-&amp;ccedil;ok ilişki olduğu g&amp;ouml;r&amp;uuml;lmektedir. Bir başka deyişle bir &lt;strong&gt;Playlist&lt;/strong&gt; birden fazla &lt;strong&gt;Track&lt;/strong&gt; satırına referans edebileceği gibi, bir &lt;strong&gt;Track&lt;/strong&gt; satırı da birden fazla &lt;strong&gt;Playlist&lt;/strong&gt;&amp;nbsp;satırına referans edebilir. Şimdi bu ilişkilerin&lt;strong&gt; Entity Framework&lt;/strong&gt; tarafındaki oluşumuna bir bakalım. &lt;em&gt;(Bu ama&amp;ccedil;la &lt;strong&gt;Visual Studio 2010 Ultimate&amp;nbsp;RC&lt;/strong&gt; ve &lt;strong&gt;Ado.Net Entity Framework 4.0 &lt;/strong&gt;s&amp;uuml;r&amp;uuml;mlerini kullanıyor olacağız. Ancak bu konunun &lt;strong&gt;Entity Framework'&lt;/strong&gt; &amp;uuml;n &amp;ouml;nceki s&amp;uuml;r&amp;uuml;m&amp;uuml;nde de aynen ge&amp;ccedil;erli olduğunu hatırlatalım.) &lt;/em&gt;&amp;Ouml;zellikle 3 tabloyu da se&amp;ccedil;tiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg131_Selection.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Playlist, Track&lt;/strong&gt; ve &lt;strong&gt;PlaylistTrack &lt;/strong&gt;tablolarının tamamı se&amp;ccedil;ilmiştir. Sihirbaz adımlarını tamamladığımızda ise, aşağıdaki Model diagramının oluştuğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg131_EntityDiagram.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hımmm...&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Dikkat edileceği &amp;uuml;zere &lt;strong&gt;PlaylistTrack&lt;/strong&gt; tablosu model diagramına dahil edilmemiştir. Neden?&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;SQL&lt;/strong&gt; tarafına bakıldığında &lt;strong&gt;PlaylistTrack&lt;/strong&gt; tablosu &amp;uuml;zerinde sadece &lt;strong&gt;Playlist&lt;/strong&gt; ve &lt;strong&gt;Track &lt;/strong&gt;tablolarına ait &lt;strong&gt;Primary Key&lt;/strong&gt; alanları bulunmaktadır. Bunlar dışında ek bir alan yoktur. Bir başka deyişle veritabanı tarafında &lt;strong&gt;Playlist&lt;/strong&gt; ve &lt;strong&gt;Track &lt;/strong&gt;tablolarının &lt;strong&gt;many-to-many &lt;/strong&gt;ilişkilerinin sağlandığı tablodur. Ancak &lt;strong&gt;Entity Framework&lt;/strong&gt; tarafında tabloların sınıflar&amp;nbsp;yardımıyla ve bu sınıfların referans ettikleri diğer sınıfların ise &amp;ouml;zellikler yardımıyla belirtildiği bilinmektedir. Dolayısıyla &lt;strong&gt;Entity Framework&lt;/strong&gt; tarafında &lt;strong&gt;PlaylistTrack&lt;/strong&gt; isimli bir sınıfın oluşturulmasının bir anlamı yoktur. Dahası olmamasının bir kaybı da yoktur. Bu y&amp;uuml;zden &lt;strong&gt;Playlist&lt;/strong&gt; ve &lt;strong&gt;Track &lt;/strong&gt;sınıfları birbirlerine &lt;strong&gt;EntityCollection&amp;lt;T&amp;gt;&lt;/strong&gt; tipinden olan navigasyon &amp;ouml;zellikleri yardımıyla&lt;em&gt;(Tracks ve Playlists) &lt;/em&gt;doğrudan bağlanmışlardır. Bu durum ilişkiyi sağlayan bileşenin&lt;em&gt;(&lt;strong&gt;Association&lt;/strong&gt; nesnesi)&lt;/em&gt;&amp;nbsp;&amp;ouml;zelliklerine bakıldığında da net bir şekilde g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg131_Relations.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi kod tarafında&lt;strong&gt; Many-To-Many&lt;/strong&gt; ilişkileri nasıl ele alacağımıza bakmaya &amp;ccedil;alışalım. &amp;Ouml;rneğin &lt;strong&gt;TV-Show&lt;/strong&gt; listesine ait &lt;strong&gt;Track &lt;/strong&gt;bilgilerini getirmek istediğimizi d&amp;uuml;ş&amp;uuml;nelim. Bunun i&amp;ccedil;in aşağıdaki gibi bir kodlama yapabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Linq;

namespace ManyToMany
{
    class Program
    {
        static void Main(string[] args)
        {
            using (ChinookEntities entities = new ChinookEntities())
            {
                Playlist result = (from pList in entities.Playlists
                                   where pList.PlaylistId == 10
                                   select pList).First();


                Console.WriteLine("{0}-{1}", result.PlaylistId, result.Name);
                foreach (var t in result.Tracks)
                {
                    Console.WriteLine("\t {0}[{1}]", t.Name, t.Milliseconds.ToString());
                }
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Buna g&amp;ouml;re aşağıdaki sonu&amp;ccedil;ları elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg131_Runtime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asının &amp;ccedil;alışması sonucunda &lt;strong&gt;SQL&lt;/strong&gt; tarafında, aşağıdaki sorgunun oluşturulduğu g&amp;ouml;zlemlenecektir.&lt;/p&gt;
&lt;p&gt;İlk &amp;ouml;nce Playlist bilgisinin &amp;ccedil;ekilmesi,&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;SELECT TOP (1) 
[Extent1].[PlaylistId] AS [PlaylistId], 
[Extent1].[Name] AS [Name]
FROM [dbo].[Playlist] AS [Extent1]
WHERE 10 = [Extent1].[PlaylistId]&lt;/pre&gt;
&lt;p&gt;sonrasında ise ilgili &lt;strong&gt;Playlist'&lt;/strong&gt; e bağlı &lt;strong&gt;Track'&lt;/strong&gt; lerin &lt;strong&gt;Inner Join&lt;/strong&gt; sorgusu ile elde edilmesi ger&amp;ccedil;ekleşecektir.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;exec sp_executesql N'SELECT 
[Extent2].[TrackId] AS [TrackId], 
[Extent2].[Name] AS [Name], 
[Extent2].[AlbumId] AS [AlbumId], 
[Extent2].[MediaTypeId] AS [MediaTypeId], 
[Extent2].[GenreId] AS [GenreId], 
[Extent2].[Composer] AS [Composer], 
[Extent2].[Milliseconds] AS [Milliseconds], 
[Extent2].[Bytes] AS [Bytes], 
[Extent2].[UnitPrice] AS [UnitPrice]
FROM  [dbo].[PlaylistTrack] AS [Extent1]
INNER JOIN [dbo].[Track] AS [Extent2] ON [Extent1].[TrackId] = [Extent2].[TrackId]
WHERE [Extent1].[PlaylistId] = @EntityKeyValue1',N'@EntityKeyValue1 int',@EntityKeyValue1=10&lt;/pre&gt;
&lt;p&gt;Birde ters tarafan gitmeye &amp;ccedil;alışalım. &amp;Ouml;rneğin bir &lt;strong&gt;Track'&lt;/strong&gt; ın ge&amp;ccedil;tiği &lt;strong&gt;Playlist' &lt;/strong&gt;leri bulmak istediğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu durumda aşağıdaki gibi bir kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Linq;

namespace ManyToMany
{
    class Program
    {
        static void Main(string[] args)
        {
            using (ChinookEntities entities = new ChinookEntities())
            {
                Track track = (from t in entities.Tracks
                               where t.TrackId == 1
                               select t).First();

                Console.WriteLine("{0}-{1}-[{2}]",track.TrackId.ToString(),track.Name,track.Milliseconds.ToString());

                foreach (var p in track.Playlists)
                {
                    Console.WriteLine("\t{0}-{1}",p.PlaylistId.ToString(),p.Name);
                }
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu kod parasına g&amp;ouml;re, &amp;ccedil;alışma zamanında &lt;strong&gt;TrackId&lt;/strong&gt; değeri &lt;strong&gt;1&lt;/strong&gt; olan par&amp;ccedil;anın ge&amp;ccedil;tiği &lt;strong&gt;Playlist'&lt;/strong&gt; lerin listesini elde edebildiğimizi g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg131_Runtime2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu kod par&amp;ccedil;ası ise bir &amp;ouml;ncekine benzer olaraktan aşağıdaki &lt;strong&gt;SQL&lt;/strong&gt; sorgularının &amp;ccedil;alıştırılmalarına neden olacaktır.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;nce Track bilgileri &amp;ccedil;ekilecek,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SELECT TOP (1) 
[Extent1].[TrackId] AS [TrackId], 
[Extent1].[Name] AS [Name], 
[Extent1].[AlbumId] AS [AlbumId], 
[Extent1].[MediaTypeId] AS [MediaTypeId], 
[Extent1].[GenreId] AS [GenreId], 
[Extent1].[Composer] AS [Composer], 
[Extent1].[Milliseconds] AS [Milliseconds], 
[Extent1].[Bytes] AS [Bytes], 
[Extent1].[UnitPrice] AS [UnitPrice]
FROM [dbo].[Track] AS [Extent1]
WHERE 1 = [Extent1].[TrackId]&lt;/pre&gt;
&lt;p&gt;sonrasında ise ilgili &lt;strong&gt;Track&lt;/strong&gt; satırının ge&amp;ccedil;tiği &lt;strong&gt;Playlist&lt;/strong&gt; satırlarının bulunması i&amp;ccedil;in gerekli&lt;strong&gt; Inner Join&lt;/strong&gt; sorgusu &amp;ccedil;alıştırılacaktır.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;exec sp_executesql N'SELECT 
[Extent2].[PlaylistId] AS [PlaylistId], 
[Extent2].[Name] AS [Name]
FROM  [dbo].[PlaylistTrack] AS [Extent1]
INNER JOIN [dbo].[Playlist] AS [Extent2] ON [Extent1].[PlaylistId] = [Extent2].[PlaylistId]
WHERE [Extent1].[TrackId] = @EntityKeyValue1',N'@EntityKeyValue1 int',@EntityKeyValue1=1&lt;/pre&gt;
&lt;p&gt;Pek tabi olarak &lt;strong&gt;Many-to-Many&lt;/strong&gt; ilişki s&amp;ouml;z konusu olan tablolar &amp;uuml;zerinden &lt;strong&gt;Update, Delete&lt;/strong&gt; veya &lt;strong&gt;Insert &lt;/strong&gt;işlemleri de yapılabilir. Burada, &amp;ouml;zellikle &lt;strong&gt;Delete&lt;/strong&gt; operasyonlarında tarafların nasıl tepki g&amp;ouml;stereceği &amp;ouml;nemlidir. Normal şartlarda &lt;strong&gt;Association&lt;/strong&gt; nesnesi &amp;uuml;zerinde yer alan&lt;strong&gt; End1 OnDelete&lt;/strong&gt; ve &lt;strong&gt;End2 OnDelete &lt;/strong&gt;isimli &amp;ouml;zelliklerin değerleri &lt;strong&gt;none &lt;/strong&gt;olarak belirlenmiştir. Ancak istenirse bunlar &lt;strong&gt;Cascade &lt;/strong&gt;değerine&amp;nbsp;&amp;ccedil;ekilebilir. Pek tabi ilişkinin nasıl bir tepki vereceğine bağlı olaraktan &lt;strong&gt;SQL&lt;/strong&gt; tarafından &lt;strong&gt;Foreign Key' &lt;/strong&gt;ler ile alakalı istisnaların alınması da muhtemeldir. Şimdi bu durumu incelemeye &amp;ccedil;alışalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Linq;

namespace ManyToMany
{
    class Program
    {
        static void Main(string[] args)
        {
            using (ChinookEntities entities = new ChinookEntities())
            {
                #region Delete and Foreign Key Violation

                var trackOnDelete = (from t in entities.Tracks
                                     where t.TrackId == 3502
                                     select t).First();

                entities.DeleteObject(trackOnDelete);

                entities.SaveChanges();

                #endregion
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asına g&amp;ouml;re &lt;strong&gt;TrackId&lt;/strong&gt; değeri &lt;strong&gt;3502 &lt;/strong&gt;olan &lt;strong&gt;Track &lt;/strong&gt;satırı silinmeye &amp;ccedil;alışılmaktadır. Ancak &lt;strong&gt;Track'&lt;/strong&gt; lar &amp;ccedil;ok doğal olarak &lt;strong&gt;Playlist' &lt;/strong&gt;lere bağlıdır. Bu nedenle silme işlemi sırasında aşağıdaki &lt;strong&gt;&amp;ccedil;alışma zamanı istisnası(Runtime Exception)&lt;/strong&gt;&amp;nbsp;alınacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg131_Exception.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Burada sebep, s&amp;ouml;z konusu alan i&amp;ccedil;in bir &lt;strong&gt;Relation'&lt;/strong&gt; ın var olmasıdır. Dolayısıyla &amp;ouml;ncelikle silinmek istenen &lt;strong&gt;Track&lt;/strong&gt; satırı ile bağlı olduğu &lt;strong&gt;Playlist&lt;/strong&gt; satırları arasındaki ilişkileri kaldırmak gerekmektedir.&amp;nbsp;Silme operasyonunun ger&amp;ccedil;eklenmesi i&amp;ccedil;in, silinmek istenen &lt;strong&gt;Track'&lt;/strong&gt; ın dahil olduğu &lt;strong&gt;Playlist&lt;/strong&gt; nesnelerini bulup, herbirinin &lt;strong&gt;Tracks&lt;/strong&gt; &amp;ouml;zelliği &amp;uuml;zerinden &lt;strong&gt;Remove&lt;/strong&gt; metodunun &amp;ccedil;alıştırılması yeterlidir. Mi acaba? &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bu tip bir kod yazılmak istendiğinde elde edilen&lt;strong&gt; Playlist.Tracks&lt;/strong&gt; &amp;ouml;zellikleri&amp;nbsp;&amp;uuml;zerinden yapılan silme hareketleri, koleksiyonunun değişmesine neden olacağından, &amp;ccedil;alışma zamanında&amp;nbsp;&lt;strong&gt;Concurrency&lt;/strong&gt; hatası alınacaktır. &amp;Ccedil;ok ş&amp;uuml;k&amp;uuml;r ki artık elimizin altında &lt;strong&gt;.Net Framework 4.0 &lt;/strong&gt;i&amp;ccedil;erisine g&amp;ouml;m&amp;uuml;l&amp;uuml; olarak gelen &lt;strong&gt;Concurrent &lt;/strong&gt;koleksiyonlar bulunmaktadır.(&lt;a href="/post/Concurrent-Collections-(Es-Zamanli-Koleksiyonlar).aspx"&gt;&lt;strong&gt;&lt;span style="color: #004488;"&gt;Concurrent Collections (Eş Zamanlı Koleksiyonlar) [Beta 1]&lt;/span&gt;&lt;/strong&gt;&lt;/a&gt;&amp;nbsp;, &lt;a href="/post/Concurrent-Collections-(Es-Zamanlc4b1-Koleksiyonlar)-Macera-Devam-Ediyor.aspx"&gt;&lt;strong&gt;&lt;span style="color: #004488;"&gt;Concurrent Collections : Macera BlockingCollection ile Devam Ediyor [Beta 1]&lt;/span&gt;&lt;/strong&gt;&lt;/a&gt;&amp;nbsp;)&amp;nbsp;Buna g&amp;ouml;re kodu aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Linq;
using System.Collections.Concurrent;

namespace ManyToMany
{
    class Program
    {
        static void Main(string[] args)
        {
            using (ChinookEntities entities = new ChinookEntities())
            {
                #region Delete and Foreign Key Violation

                var trackOnDelete = (from t in entities.Tracks
                                     where t.TrackId == 3503
                                     select t).First();

                ConcurrentBag&amp;lt;Playlist&amp;gt; playList = new ConcurrentBag&amp;lt;Playlist&amp;gt;(trackOnDelete.Playlists);
                foreach (var pl in playList)
                {
                    pl.Tracks.Remove(trackOnDelete);
                }

                entities.DeleteObject(trackOnDelete);

                entities.SaveChanges();

                #endregion
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Biraz performans kaybı s&amp;ouml;z konusu olabilir ancak silme işlemi başarılı bir şekilde ger&amp;ccedil;ekleştirilebilecektir. &amp;Ouml;zellikle &lt;strong&gt;SQL&lt;/strong&gt; tarafında &amp;ccedil;alıştırılan sorgulara bakıldığında, aşağıdaki ifadelerin icra edildiği g&amp;ouml;zlemlenir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;nce &lt;strong&gt;Track&lt;/strong&gt; ve &lt;strong&gt;Playlist &lt;/strong&gt;tabloları arasındaki &lt;strong&gt;&amp;ccedil;oğa-&amp;ccedil;ok &lt;/strong&gt;ilişkiyi sağlayan &lt;strong&gt;PlaylistTrack &lt;/strong&gt;tablosundaki ilgili satırlar silinir.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;exec sp_executesql N'delete [dbo].[PlaylistTrack]
where (([PlaylistId] = @0) and ([TrackId] = @1))',N'@0 int,@1 int',@0=1,@1=3503

exec sp_executesql N'delete [dbo].[PlaylistTrack]
where (([PlaylistId] = @0) and ([TrackId] = @1))',N'@0 int,@1 int',@0=5,@1=3503

exec sp_executesql N'delete [dbo].[PlaylistTrack]
where (([PlaylistId] = @0) and ([TrackId] = @1))',N'@0 int,@1 int',@0=8,@1=3503

exec sp_executesql N'delete [dbo].[PlaylistTrack]
where (([PlaylistId] = @0) and ([TrackId] = @1))',N'@0 int,@1 int',@0=12,@1=3503

exec sp_executesql N'delete [dbo].[PlaylistTrack]
where (([PlaylistId] = @0) and ([TrackId] = @1))',N'@0 int,@1 int',@0=13,@1=3503&lt;/pre&gt;
&lt;p&gt;Artık sorun yoktur, nitekim &lt;strong&gt;Track&lt;/strong&gt; tablosu ile &lt;strong&gt;Playlist &lt;/strong&gt;arasındaki ilişkiler ortadan kalkmıştır. Buna g&amp;ouml;re son olarak, &lt;strong&gt;Track&lt;/strong&gt; tablosundan ilgili satırın silinmesi işlemi ger&amp;ccedil;ekleştirilir.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;exec sp_executesql N'delete [dbo].[Track]
where ([TrackId] = @0)',N'@0 int',@0=3503&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Insert&lt;/strong&gt; ve &lt;strong&gt;Update &lt;/strong&gt;işlemlerinin incelenmesini de siz değerli okurlarıma bırakıyorum. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f2%2fManyToMany_RC.rar"&gt;ManyToMany_RC.rar (47,16 kb)&lt;/a&gt;&amp;nbsp;&lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 Ultimate RC s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde geliştirilmiş ve test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-02-12 01:05:00</pubDate>
  <slug>EF-Many-To-Many-Relations</slug>
  <tags>
    <tag>adonet-entity-framework</tag>
  </tags>
  <categories>
    <category>Entity Framework</category>
  </categories>
</post>