<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>.Net Core Konfigurasyon Yönetimi Üzerine</title>
  <description>Çalışma zamanına bilgi taşımanın ve bazı ayarlamalar için gerekli değerleri okumanın en popüler yollarından birisi de bildiğiniz üzere konfigurasyon dosyalarından yararlanmak. Zaman içerisinde app.config, web.config gibi XML tabanlı konfigurasyon dosyalarına aşina olan bizler, .Net Core ile birlikte JSON formatlı içeriklerle çalışmaya başladık. .Net Core tarafında bu JSON içeriklerini yönetmek oldukça kolay. Farklı yöntemlerimiz var. Dahası Dependency Injection yeteneklerinden yararlanılabildiği için özel sekmelerin(section) sınıflara bağlanması da münkün...</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/01/customconfig_0n.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;West-World &amp;uuml;zerinde bir şeyler araştırmak i&amp;ccedil;in vaktim olan bir haftayı geride bırakmak &amp;uuml;zereyim. Internet &amp;uuml;zerinde derya deniz&amp;nbsp;i&amp;ccedil;erik olsa da bazen ne araştıracağımı şaşırmıyor değilim. İşte bu anlarda &lt;a href="https://docs.microsoft.com/en-us/" target="_blank"&gt;MSDN dok&amp;uuml;manları&lt;/a&gt; imdadıma yetişiyor. İlk zamanlarından beri olduk&amp;ccedil;a verimli olduğunu d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m i&amp;ccedil;erik son yıllarda &amp;ccedil;ok daha profesyonelleşti&lt;em&gt;(Tabii MSDN dok&amp;uuml;manlarını CD veya DVD olarak edindiğimiz zamanları da hatırlıyorum)&lt;/em&gt; İşin aslı sadece MSDN değil, yazılım &amp;uuml;r&amp;uuml;n&amp;uuml; sahibi pek &amp;ccedil;ok &amp;ouml;nc&amp;uuml;n&amp;uuml;n teknik destek dok&amp;uuml;manları inanılmaz derecede doyurucu ve birbirleriyle yarışır durumdalar. Son zamanlarda uğradıklarım arasında &lt;a href="https://cloud.google.com/docs/" target="_blank"&gt;Google Cloud Platform&lt;/a&gt; ve &lt;a href="https://aws.amazon.com/documentation/" target="_blank"&gt;Amazon Web Services&lt;/a&gt;&amp;nbsp;var.&amp;nbsp;Bu rehberler ilk kaynak niteliğinde olduğu i&amp;ccedil;in bir şeyleri &amp;ouml;ğrenebilmemiz adına doğru adresler. Hatta yazılım geliştirici olarak ortalama bir seviyenin &amp;uuml;st&amp;uuml;ne &amp;ccedil;ıktıktan sonra bunlar gibi dok&amp;uuml;mantasyonlara&amp;nbsp;uğramak,&amp;nbsp;rastgele bir &amp;uuml;r&amp;uuml;n se&amp;ccedil;ip teknik dok&amp;uuml;mantasyonunu okumak, Get Started &amp;ouml;rneklerini yapıp bir şeylerin farkına varabilmek gerekiyor. S&amp;ouml;z&amp;uuml; fazla uzatmadan gerekli mesajları da verdiğimi d&amp;uuml;ş&amp;uuml;nerek yazımıza başlayalım diyorum.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alışma zamanına bilgi taşımanın ve bazı ayarlamalar i&amp;ccedil;in gerekli değerleri okumanın en pop&amp;uuml;ler yollarından birisi de bildiğiniz &amp;uuml;zere konfigurasyon dosyalarından yararlanmak. Zaman i&amp;ccedil;erisinde app.config, web.config gibi XML tabanlı konfigurasyon dosyalarına aşina olan bizler, .Net Core ile birlikte JSON formatlı i&amp;ccedil;eriklerle &amp;ccedil;alışmaya başladık. .Net Core tarafında bu JSON i&amp;ccedil;eriklerini y&amp;ouml;netmek olduk&amp;ccedil;a kolay. Farklı y&amp;ouml;ntemlerimiz var. Dahası Dependency Injection yeteneklerinden yararlanılabildiği i&amp;ccedil;in &amp;ouml;zel sekmelerin(section) sınıflara bağlanması da m&amp;uuml;nk&amp;uuml;n&lt;em&gt;(Hatta Interface Segregation Principle ve Seperation of Concerns ilkelerini kullanan Options deseni var ki ilk fırstatta inceleyip &amp;ouml;ğrenmek istiyorum. Farkında olmadan kullanıyoruz ama altındaki &amp;ccedil;alışma dinamiklerini &amp;ouml;ğrenmek &amp;ccedil;ok yerinde olacaktır)&amp;nbsp;&lt;/em&gt;Gelin bir ka&amp;ccedil; basit &amp;ouml;rnek ile konfigurasyon y&amp;ouml;netimini nasıl yapabileceğimizi incelemeye &amp;ccedil;alışalım. Ağırlıklı olarak varsayılan konfigurasyon dosyaları haricinde kendi &amp;ouml;zel i&amp;ccedil;eriklerimizle &amp;ccedil;alışacağız. Kodlarımızı&amp;nbsp;Console tabanlı bir uygulamada&amp;nbsp;deneyimleyeceğiz&amp;nbsp;ama aynı teknikleri Web, Web API gibi diğer proje t&amp;uuml;rlerinde de kullanabilirsiniz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new console -o CustomConfig&lt;/pre&gt;
&lt;h1&gt;Kendi JSON İ&amp;ccedil;eriğimiz İle &amp;Ccedil;alışmak&lt;/h1&gt;
&lt;p&gt;İlk &amp;ouml;rnek i&amp;ccedil;in aşağıdaki i&amp;ccedil;eriğe sahip olan aws.json isimli bir dosyadan yararlanacağız.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;{
  "default_region": "east-2",
  "provider": "amazon",
  "region": {
    "name": "east-2",
    "address": "amazonda.bir.yer.east-2"
  },
  "services": [
    {
      "address": "products/get",
      "response_type": "json",
      "isPublic": "true"
    },
    {
      "address": "products/get/{categoryName}",
      "response_type": "json",
      "isPublic": "true"
    }
  ]
}&lt;/pre&gt;
&lt;p&gt;Tamamen hayal &amp;uuml;r&amp;uuml;n&amp;uuml; olan i&amp;ccedil;erikte i&amp;ccedil; i&amp;ccedil;e ge&amp;ccedil;en alanlar da yer alıyor. default_region, provider, region ve services aynı seviyede&amp;nbsp;olmakla birlikte, services i&amp;ccedil;erisinde n sayıda eleman bulunabiliyor.&amp;nbsp;Amacımız bu i&amp;ccedil;eriği &amp;ccedil;alışma zamanında okuyabilmek.&amp;nbsp;&amp;Ouml;zellikle JSON tabanlı &amp;ccedil;alışacağımız i&amp;ccedil;in bize gerekli fonksiyonellikleri sağlayacak iki pakete de ihtiyacımız bulunuyor.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet add package Microsoft.Extensions.Configuration.Json
dotnet add package Microsoft.Extensions.Configuration.Binder
dotnet add package Microsoft.Extensions.Configuration.CommandLine&lt;/pre&gt;
&lt;p&gt;Bu paketleri ekledikten sonra ilk &amp;ouml;rnek kodlarımızı aşağıdaki gibi yazabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.IO;
using Microsoft.Extensions.Configuration;

namespace CustomConfig
{
    class Program
    {
        static void Main(string[] args)
        {
            ConfigSupervisor rubio = new ConfigSupervisor();
            rubio.ExecuteJsonSample();
        }
    }

    public class ConfigSupervisor
    {
        public IConfigurationRoot ConfigurationManager { get; set; }

        public void ExecuteJsonSample()
        {
            var builder = new ConfigurationBuilder()
            .SetBasePath(Directory.GetCurrentDirectory())
            .AddJsonFile("aws.json");

            ConfigurationManager = builder.Build();

            Console.WriteLine($"default_region: \t{ConfigurationManager["default_region"]}");
            Console.WriteLine($"provider: \t{ConfigurationManager["provider"]}");
            Console.WriteLine($"region name: \t{ConfigurationManager["region:name"]}");
            Console.WriteLine($"region address: \t{ConfigurationManager["region:address"]}");
            Console.WriteLine($"service[1] address : \t{ConfigurationManager["services:1:address"]}");
            Console.WriteLine($"service[1] type: \t{ConfigurationManager["services:1:response_type"]}");
            Console.WriteLine($"service[1] isPublic: \t{ConfigurationManager["services:1:isPublic"]}");

            var services = ConfigurationManager.GetSection("services").AsEnumerable();
            foreach (var service in services)
            {
                Console.WriteLine($"{service.Key}-{service.Value}");
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;ConfigSupervisor sınıfı &amp;ouml;rneklere ait fonksiyonellikleri i&amp;ccedil;eriyor. ExecuteJsonSample metodumuzun başında aws.json dosyasını ele alması i&amp;ccedil;in bir ConfigurationBuilder &amp;ouml;rneği oluşturuyoruz. Build &amp;ccedil;ağrısı sonucu IConfigurationRoot aray&amp;uuml;z&amp;uuml; &amp;uuml;zerinden taşınabilecek bir nesne &amp;ouml;rneği elde ediyoruz. Sonu&amp;ccedil; olarak indeksleyici operat&amp;ouml;r&amp;uuml;n&amp;uuml; kullanarak konfigurasyon &amp;ouml;ğelerine erişim sağlıyoruz. root altında yer alan default_region ve provider alanlarının değerlerine erişmek olduk&amp;ccedil;a kolay. region i&amp;ccedil;erisindeki name niteliğine erişmek i&amp;ccedil;inse : operat&amp;ouml;r&amp;uuml;n&amp;uuml; kullanıyoruz&lt;em&gt;(region:name şeklinde) &lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu notasyona g&amp;ouml;re services olarak isimlendirilmiş array i&amp;ccedil;erisindeki bir elemana erişirken index değerini kullanarak ilerleyebiliyoruz. S&amp;ouml;z gelimi services:1:isPublic ile 1 indisli elemanın isPublic niteliğinin değerine ulaşmış oluyoruz. Elbette services isimli dizinin elemanlarını&amp;nbsp;bir d&amp;ouml;ng&amp;uuml; yardımıyla okuyabiliriz de. GetSection fonksiyonu ile konfigurasyon y&amp;ouml;neticisinin okuduğu dosyadan ilgili sekmeyi almamız yeterli. AsEnumerable metodu ile &amp;uuml;zerinde ileri y&amp;ouml;nl&amp;uuml; hareket edilebilir hale getirdikten sonra Key ve Value değerlerine erişmemiz olduk&amp;ccedil;a basit.&amp;nbsp;Uygulamanın &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibi olacaktır&lt;em&gt;(services&amp;nbsp;sekmesini daha iyi okumanın bir yolunu bul Burak! O ne &amp;ouml;yle -, 1-,0- :D )&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/customconfig_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;JSON İ&amp;ccedil;eriğini Sınıflar ile İlişkilendirmek&lt;/h1&gt;
&lt;p&gt;Peki JSON dosyasının i&amp;ccedil;eriğinde yer alan sekmeleri birer tiple ilişkilendirmek istersek? Ki zaten ezelden beridir konfigurasyon i&amp;ccedil;erikleri .Net d&amp;uuml;nyasında sınıflarla ilişkilendirilip y&amp;ouml;netimli kod tarafında kullanılabiliyorlar. Bunu .Net Core ortamında JSON i&amp;ccedil;eriklerimiz i&amp;ccedil;in ger&amp;ccedil;ekleştirmemiz de m&amp;uuml;mk&amp;uuml;n. İlk olarak aşağıdaki json i&amp;ccedil;eriğini barındıracak gamesettings.json dosyasını projemize ekleyelim.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;{
    "Game": {
        "Requirement": {
            "OS": "Ubuntu",
            "RAM": "8",
            "Region": "west-world",
            "Online": "true"
        },
        "Contacts": [
            {
                "Name": "tech support",
                "Email": "techsupport@west-world.bla.bla"
            },
            {
                "Name": "game master",
                "Email": "gamemaster@west-world.bla.bla"
            },
            {
                "Name": "help desk",
                "Email": "helpdesk@west-world.bla.bla"
            }
        ]
    }
}&lt;/pre&gt;
&lt;p&gt;Bu i&amp;ccedil;eriğin kod tarafındaki karşılığı olacak&amp;nbsp;sınıflarımızı ise aşağıdaki gibi yazalım.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;T&amp;uuml;m JSON i&amp;ccedil;eriğini işaret edecek GameSetting sınıfı&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic;

public class GameSetting
{
    public Requirement Requirement { get; set; }
    public IEnumerable&amp;lt;Contact&amp;gt; Contacts{get;set;}
}&lt;/pre&gt;
&lt;p&gt;GameSettings sekmesinde yer alan Contacts bir dizi olduğu i&amp;ccedil;in, IEnumerable&amp;lt;Contact&amp;gt; tipinden Contacts isimli bir &amp;ouml;zellik s&amp;ouml;z konusu.&lt;/p&gt;
&lt;p&gt;Requirement kısmını işaret eden Requirement sınıfı;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic;

public class Requirement
{
    public string OS { get; set; }
    public int RAM { get; set; }
    public string Region { get; set; }
    public bool Online { get; set; }
}&lt;/pre&gt;
&lt;p&gt;ve son olarak Contacts sekmesi altındaki bağlantıların her birisini işaret edecek Contact sınıfı.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Contact
{
    public string Name { get; set; }
    public string Email { get; set; }
}&lt;/pre&gt;
&lt;p&gt;Sınıfımıza ekleyeceğimiz fonksiyonumuz ise şu şekilde yazılabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void ExecuteObjectGraphSample()
{
    var builder = new ConfigurationBuilder()
    .SetBasePath(Directory.GetCurrentDirectory())
    .AddJsonFile("gamesettings.json");

    ConfigurationManager = builder.Build();

    var gameConfig = new GameSetting();
    ConfigurationManager.GetSection("Game").Bind(gameConfig);
    var requirement=gameConfig.Requirement;
    Console.WriteLine($"OS {requirement.OS} ({requirement.RAM} Ram)");            
    foreach(var contact in gameConfig.Contacts)
    {
        Console.WriteLine($"{contact.Name}({contact.Email})");
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncelikle gamesettings.json dosyasını ele alacak ConfigurationBuilder &amp;ouml;rneği oluşturulup Build operasyonu ile konfigurasyon y&amp;ouml;neticisi &amp;uuml;retiliyor. Sonraki kısım ise epey keyifli. GetSection ile yakalanacak olan Game i&amp;ccedil;eriğini Bind metodundan yararlanarak GameSetting nesne &amp;ouml;rneği olan gameConfig'e bağlıyoruz. JSON konfigurasyonundaki isimlendirmelere g&amp;ouml;re Bind metodu doğru eşleştirmeleri bizim i&amp;ccedil;in otomatik olarak yapacak. Sonrasında &amp;ouml;rnek olması a&amp;ccedil;ısından OS ve RAM bilgileri ile&amp;nbsp;firma kontaklarına ait Name ve Email değerlerini ekrana yazdırıyoruz. Dikkat edilmesi gereken nokta bir &amp;ouml;nceki &amp;ouml;rnekten&amp;nbsp;farklı olarak t&amp;uuml;m bu değerlerin Bind işlemi sonrası JSON İ&amp;ccedil;eriğine bağlanan gameConfig nesnesi &amp;uuml;zerinden yakalanabilmesi. &amp;Ccedil;alışma zamanı sonu&amp;ccedil;ları aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/customconfig_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Bellekte Konuşlandırılmış Konfigurasyon İ&amp;ccedil;eriği ile &amp;Ccedil;alışmak&lt;/h1&gt;
&lt;p&gt;MSDN dok&amp;uuml;manlarından &amp;ouml;ğrendiğim ilgin&amp;ccedil; &amp;ouml;rneklerden birisi de konfigurasyon bilgilerinin in-memory olarak tutulup y&amp;ouml;netilebilmesi. Yeni fonksiyonumuz ExecuteInMemorySample'ı aşağıdaki gibi yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void ExecuteInMemorySample()
{
    var builder = new ConfigurationBuilder();

    var parameters = new Dictionary&amp;lt;string, string&amp;gt;{
        {"Region:Name","east-us-2"},
        {"Region:BaseAddress","amazon.da.bir.yer/west-world/api"},
        {"Artifact:Service:Name","products"},
        {"Artifact:Service:MaxConcurrentCall","3500"},
        {"Artifact:Service:Type","json"},
        {"Artifact:Service:IsPublic","true"}
    };

    builder.AddInMemoryCollection(parameters);
    ConfigurationManager = builder.Build();
    Console.WriteLine($"{ConfigurationManager["Artifact:Service:Name"]}");
    Console.WriteLine($"{ConfigurationManager["Artifact:Service:Type"]}");
    Console.WriteLine($"{ConfigurationManager["Artifact:Service:MaxConcurrentCall"]}");
    Console.WriteLine($"{ConfigurationManager["Artifact:Service:IsPublic"]}");

    var service = new Service();
    ConfigurationManager.GetSection("Artifact:Service").Bind(service);
    Console.WriteLine($"{service.Name},{service.MaxConcurrentCall},{service.Type},{service.IsPublic}");
}&lt;/pre&gt;
&lt;p&gt;Kodun kilit noktası builder &amp;ouml;rneği &amp;uuml;zerinden &amp;ccedil;ağırılan AddInMemoryCollection metodu. Bu metoda parametre olarak parameters isimli Dictionary&amp;lt;string,string&amp;gt; tipinden bir koleksiyon verilmekte.&amp;nbsp;Dictionary,&amp;nbsp;key:value şeklindeki konfigurasyon mantığına uygun olduğu i&amp;ccedil;in bi&amp;ccedil;ilmiş kaftandır. Tabii alt elemanlar i&amp;ccedil;in yine : ayracına başvurulur. &amp;Ouml;rnek koleksiyonda Region ve Artifact aynı seviyede yer alan elemanlardır. Artifact altında Service ve onun altında da Name, MaxConcurrentCall, Type ve IsPublic isimli nitelikler yer almaktadır.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Build &amp;ccedil;ağrısı sonrası bu bilgilere ConfigurationManager isimli IConfigurationRoot aray&amp;uuml;z&amp;uuml; &amp;uuml;zerinden erişilebilir. Dahası bellekte konuşlandırılan bu konfigurasyon i&amp;ccedil;eriği herhangibir seviyesi i&amp;ccedil;in bir nesneye de bağlanabilir. Service isimli aşağıdaki sınıfı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Service
{
    public string Name { get; set; }
    public int MaxConcurrentCall { get; set; }
    public string Type { get; set; }
    public bool IsPublic { get; set; }
}&lt;/pre&gt;
&lt;p&gt;GetSection("Artifact:Service").Bind(service) &amp;ccedil;ağrımı ile Artifact altındaki Service i&amp;ccedil;eriğinin ilgili nesne &amp;ouml;rneğine bağlanması sağlanmış olur. Bu noktadan sonra MaxConcurrentCall, Name gibi &amp;ouml;zelliklere y&amp;ouml;netimli kod &amp;uuml;zerinden erişilebilinir. Fonksiyonun &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/customconfig_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Konfigurasyon Parametrelerini Komut Satırından G&amp;ouml;ndermek&lt;/h1&gt;
&lt;p&gt;Bir &amp;ouml;nceki &amp;ouml;rnekte kullandığımız In-memory &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;nde, parametre değerlerinin komut satırından g&amp;ouml;nderilmesi de m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bu g&amp;uuml;zel ve ilgin&amp;ccedil; bir kullanım şekli olsa de pek &amp;ccedil;ok durumda işimize yarayabilir. Peki nasıl yapabiliriz? Aşağıdaki metodu ConfigSupervisor sınıfımıza ekleyerek devam edelim&lt;em&gt;(Başta eklediğimiz Microsoft.Extensions.Configuration.CommandLine paketi bu &amp;ouml;rnek i&amp;ccedil;in gerekli)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void ExecuteCommandLineSample(string[] args=null)
{
    var builder=new ConfigurationBuilder();
    var connection=new Dictionary&amp;lt;string,string&amp;gt;{
        {"Connection:Value","data source=aws;provider:amazon;"},
        {"Connection:Name","aws"}
    };
    builder
    .AddInMemoryCollection(connection)
    .AddCommandLine(args);

    ConfigurationManager=builder.Build();
    Console.WriteLine($"Connection : {ConfigurationManager["Connection:Value"]}");
    Console.WriteLine($"Connection : {ConfigurationManager["Connection:Timeout"]}");
}&lt;/pre&gt;
&lt;p&gt;Yine bellekte tutulan bir konfigurasyon i&amp;ccedil;eriği s&amp;ouml;z konusu. Bunun i&amp;ccedil;in generic Dictionary koleksiyonunu kullandık. builder &amp;uuml;zerinden &amp;ccedil;ağırdığımız AddCommandLine fonksiyonuna parametre olarak gelen args dizisinin i&amp;ccedil;eriği tahmin edeceğiniz &amp;uuml;zere komut satırından gelecek. Kodun ilerleyen satırlarında Connection:Value ve Connection:Name değerlerini&amp;nbsp;ekrana bastrırıyoruz. Main kodunun i&amp;ccedil;eriğini de aşağıdaki hale getirelim. Tek yaptığımız Main fonksiyonuna gelen args değişkenini ExecuteCommandLineSample &amp;ccedil;ağrısına parametre olarak ge&amp;ccedil;mek.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
    ConfigSupervisor rubio = new ConfigSupervisor();
    rubio.ExecuteCommandLineSample(args);
}&lt;/pre&gt;
&lt;p&gt;Eğer programımızı aşağıdaki gibi &amp;ccedil;alıştırırsak konfigurasyon i&amp;ccedil;eriğinin bizim istediğimiz gibi değiştiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet run Connection:Value="Azure;timeout=1000;region=EU-1" Connection:Name="azure"&lt;/pre&gt;
&lt;p&gt;Tabii bu parametreyi vermeden uygulamayı &amp;ccedil;alıştırırsak varsayılan Connection:Value ve Connection:Name değerlerine ulaşırız.&amp;nbsp;Bu arada t&amp;uuml;m parametreleri detaylı olarak girmek zorunda değiliz. İsimle ulaştığımız i&amp;ccedil;in sadece değiştirmek istediklerimizi girebilir veya farklı sıralarda atamalar yapabiliriz. Aşağıdaki &amp;ccedil;alışma zamanı sonu&amp;ccedil;larına bu anlamda bakabilirsiniz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/customconfig_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Konfigurasyon y&amp;ouml;netimi ile ilgili daha pek &amp;ccedil;ok şey var&lt;em&gt;(Ben MSDN'in &lt;a href="https://docs.microsoft.com/en-us/aspnet/core/fundamentals/configuration/?tabs=basicconfiguration" target="_blank"&gt;şu adresteki&lt;/a&gt; olduk&amp;ccedil;a doyurucu dok&amp;uuml;manını izleyerek &amp;ouml;ğrenmeye &amp;ccedil;alışıyorum)&lt;/em&gt; &amp;Ouml;rneğin &amp;ouml;zel bir Entity Framework&amp;nbsp;provider'ının oluşturulması, komut satırı arg&amp;uuml;manlarında switch mapping tekniğinin kullanılması gibi konulara bu adresten bakılabilir. Şimdilik benden bu kadar. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;a href="https://github.com/buraksenyurt/dotnetcore/tree/master/CustomConfig" target="_blank"&gt;&amp;Ouml;rnek kodlara Git &amp;uuml;zerinden de erişebilirsiniz.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2018-03-01 07:33:00</pubDate>
  <slug>net-core-configuration-management-uzerine</slug>
  <tags>
    <tag>json</tag>
    <tag>configuration-management</tag>
    <tag>net-core</tag>
    <tag>dependency-injection</tag>
    <tag>i-configuration-root</tag>
    <tag>configuration-builder</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
  </categories>
</post>