<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Gopher Olma Çalışmaları</title>
  <description>Geçtiğimiz sene Ruby diliye uğraşmaya başlamıştım. Ruby dilini sevenler ve ona gönül verenlere Rubyist deniyor. Benzer bir yaklaşım meğer Go tarafında da varmış. Onlarda kendilerine logolarına esin kaynağı olan Gopher diyorlarmış. Aslında Go dilinin logosu gerçekten bir canlıdan esinlenilerek tasarlanmış. Yaklaşık 15 ila 20 cm boylarında olan gopher'lar oldukça sevimliler(Bana göre) Elbette logo çok daha sevimli. Bu arada Gopher aynı zamanda TCP/IP tabanlı HTTP öncesi bir internet protokolu olarak da geçiyor. Detaylara Wikipedia adresinden bakabilirsiniz.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/01/gopher.gif" alt="" width="200" height="249" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;tiğimiz sene &lt;a href="/category/Ruby.aspx" target="_blank"&gt;Ruby&lt;/a&gt; diliye uğraşmaya başlamıştım. Ruby dilini sevenler ve ona g&amp;ouml;n&amp;uuml;l verenlere Rubyist deniyor. Benzer bir yaklaşım meğer Go tarafında da varmış. Onlarda kendilerine&amp;nbsp;logolarına esin kaynağı olan Gopher diyorlarmış. Aslında Go dilinin&amp;nbsp;logosu ger&amp;ccedil;ekten bir canlıdan esinlenilerek tasarlanmış. Yaklaşık 15 ila 20 cm boylarında olan gopher'lar olduk&amp;ccedil;a sevimliler&lt;em&gt;(Bana g&amp;ouml;re)&lt;/em&gt; Elbette&amp;nbsp;logo &amp;ccedil;ok daha sevimli. Bu arada Gopher aynı zamanda TCP/IP tabanlı HTTP &amp;ouml;ncesi bir internet protokolu olarak da ge&amp;ccedil;iyor. Detaylara &lt;a href="https://en.wikipedia.org/wiki/Gopher_(protocol)" target="_blank"&gt;Wikipedia adresinden&lt;/a&gt;&amp;nbsp;bakabilirsiniz.&lt;/p&gt;
&lt;p&gt;&lt;img style="float: left;" src="/image.axd?picture=/2017/01/20170109_224829.gif" alt="" width="220" height="201" /&gt;Benim 2017 hedeflerim arasında Go dilini en azından orta seviyeye kadar&amp;nbsp;&amp;ouml;ğrenmek var. Olduk&amp;ccedil;a uzun bir sprint olacak ancak ge&amp;ccedil;tiğimiz hafta kendimle yaptığım Sprint planlama toplantısında onu To Do listesine aldım. Bu hafta itibariyle de durumunu In Progress'e &amp;ccedil;ektim.&lt;/p&gt;
&lt;p&gt;Gopher olabilir miyim bilemiyorum ama bir dili &amp;ccedil;ok iyi seviyede &amp;ouml;ğrenmeden o dil hakkında ahkam kesmemek gerektiğine inanıyorum. Ge&amp;ccedil;tiğimiz zaman i&amp;ccedil;erisinde Go ile ilgili dil &amp;ouml;zelliklerini &amp;ouml;ğrenmeye devam ettim.&amp;nbsp;&amp;Ouml;ğrendiklerimi not almaya başladım. Kısa bir Hello World uygulamasından sonra başka temel kavramları da incelemeye koyuldum. İşte en son baktığım konular&lt;/p&gt;
&lt;h2&gt;Arrays&lt;/h2&gt;
&lt;p&gt;Belli tipteki elemanaları&lt;em&gt;(herhangibir Go veri tipi olabilir)&lt;/em&gt; bir arada tutan&lt;em&gt;(sunan)&lt;/em&gt; koleksiyonlara dizi&amp;nbsp;diyebiliriz. Pek &amp;ccedil;ok programlama dilinde olduğu gibi Go'da da kullanılan &amp;ccedil;ekirdek veri yapılarından&lt;em&gt;(data structures)&lt;/em&gt; birisidir. Diziler sabit uzunlukta tanımlanırlar. Yani&amp;nbsp;i&amp;ccedil;ereceği&amp;nbsp;eleman sayısı baştan bildirilir&lt;em&gt;(Ya da dizinin tanımlandığı satırda atama işlemi yapıldığında uzunluğu belirlenir)&lt;/em&gt;. Tabii Go s&amp;ouml;z konusu olunca ileride de g&amp;ouml;receğimiz gibi bellek adresleri de &amp;ouml;nem kazanacak. Diziler i&amp;ccedil;in de birbirini takip eden bellek adresleri s&amp;ouml;z konusu. İlk eleman&lt;em&gt;(bu arada diziler 0ncı indisten başlamakta)&amp;nbsp;&lt;/em&gt;dizinin başladığı son eleman da bittiği bellek adresinde konumlanmakta. Go &amp;ccedil;ok boyutlu&lt;em&gt;(Multi Dimensional)&lt;/em&gt; dizi yapısına da sahip ve fonksiyonlara dizileri parametre olarak ge&amp;ccedil;irebiliyoruz. Aşağıdaki basit kod par&amp;ccedil;asında hem diziler ile ilgili temel işlemeler yer alıyor hem de basit for d&amp;ouml;ng&amp;uuml;lerine yer veriliyor.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	"time"
	)

func main(){
	// Arrays
	fmt.Printf("Today : %s\n\n",time.Now())
	
	var points=[]float32{10.45,-30.345,55.90,60.0123}
	var names=[4]string{"sarlok","sumi","varlord","khan"}
	var numbers [7]int
	var matrix=[3][3]int{{1,2,3},{4,5,6},{7,8,9}}
	
	for i:=0;i&amp;lt;len(points);i++{
		fmt.Printf("%d is %f\n",i,points[i])
	}
	
	for i:=0;i&amp;lt;len(names);i++{
		fmt.Printf("%s\n",names[i])
	}
	
	var j int
	for j=0;j&amp;lt;len(numbers);j++{
		numbers[j]=j*j
		fmt.Printf("%d\t",numbers[j])
	}
	
	fmt.Printf("\nSum = %f\n",sum(points))
	
	for i:=0;i&amp;lt;3;i++{
		for j:=0;j&amp;lt;3;j++{
			fmt.Printf("%d\t",matrix[i][j])
		}
		fmt.Println("")
	}
}

func sum(nmbrs []float32) float32{
	var toplam float32=0
	for i:=0;i&amp;lt;len(nmbrs);i++{
		toplam+=nmbrs[i]
	}
	return toplam
}&lt;/pre&gt;
&lt;p&gt;&amp;Ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gofnd_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Kodda neler olduğuna kısaca bakalım.&lt;/p&gt;
&lt;p&gt;Sırf meraktan g&amp;uuml;n&amp;uuml;n tarihini ve zamanı ekrana nasıl yazdırırım diye Google'a sordum ve bunu main fonksiyonunun ilk satırındaki ifadede denedim. Tabii kullanabilmek i&amp;ccedil;in time paketini import etmemiz gerektiği g&amp;ouml;z&amp;uuml;n&amp;uuml;zden ka&amp;ccedil;mamış olsa gerek. Array veri yapısı ile &amp;ccedil;ok alakası olmasa da kodu renklendirdiğini d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. En azından biraz daha yeşillendirdi.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekte points, numbers, names ve matrix isimli d&amp;ouml;rt dizi kullanılmakta. points dizisi tanımlanırken eleman sayısını belirtmedik ancak s&amp;uuml;sl&amp;uuml; parantezler arasına 4 adet float32 tipinden değişken koyduk. Yani eleman sayısı belli. names dizisinde eleman sayısını da veriyoruz. string tipinden elemanlar i&amp;ccedil;eren bir dizi. 7 eleman i&amp;ccedil;eren numbers dizisi sadece tanımlanmış durumda. Elemanlarını bir d&amp;ouml;ng&amp;uuml; yardımıyla doldururken her bir kutuya o anki indisin karesini yerleştiriyoruz. matrix isimli dizimiz aslında &amp;ccedil;ok boyutlu kullanıma basit bir &amp;ouml;rnek. İki boyutlu dizinin elemanları int tipinden. matrix i&amp;ccedil;eriğini Console ekranımıza olabildiğince jan janlı yazdırmaya gayret ettik.&lt;/p&gt;
&lt;p&gt;D&amp;ouml;ng&amp;uuml; kullanımları olduk&amp;ccedil;a basit. matrix dizisini işlerken i&amp;ccedil;i&amp;ccedil;e d&amp;ouml;ng&amp;uuml; kullanıyoruz. D&amp;ouml;ng&amp;uuml;lere konu olan dizilerin eleman sayısını len fonksiyonu yardımıyla anlayabiliriz. Dizi indisleri 0 tabanlı başladığından d&amp;ouml;ng&amp;uuml; saya&amp;ccedil;ları da 0dan başlatılmakta. fmt paketindeki Printf fonksiyonu Console penceresine &amp;ccedil;eşitli formatları uygulamak i&amp;ccedil;in kullanılıyor. %d'yi tam sayılar, %f'i kayan noktalı sayılar, %s'i de string tipindeki elemanlar i&amp;ccedil;in yer tutucu olarak kullanmaktayız. Pek tabii C#taki gibi {0} {1} gibi bir kullanım burada s&amp;ouml;z konusu değil. Printf'te ki parametre sırası konumlandırma a&amp;ccedil;ısından &amp;ouml;nemli. \n ve \t bildiğiniz &amp;uuml;zere escape karakterlerimiz. Yeni satıra ge&amp;ccedil;mek ve tab bırakmak i&amp;ccedil;in kullanılıyorlar. Başka escape karakterleri de var elbette.&lt;/p&gt;
&lt;table&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;Karakter&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;Kullanım Amacı&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;\a&lt;/td&gt;
&lt;td&gt;alert&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;\b&lt;/td&gt;
&lt;td&gt;backspace&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;\f&lt;/td&gt;
&lt;td&gt;Form feed&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;\r&lt;/td&gt;
&lt;td&gt;Carriage return&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;\v&lt;/td&gt;
&lt;td&gt;Vertical tab&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;\xhh&lt;/td&gt;
&lt;td&gt;Hexadecimal numbers&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;\ooo&lt;/td&gt;
&lt;td&gt;Octal numbers&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;\\&lt;/td&gt;
&lt;td&gt;\&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;\'&lt;/td&gt;
&lt;td&gt;'&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;\"&lt;/td&gt;
&lt;td&gt;"&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;\?&lt;/td&gt;
&lt;td&gt;?&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Kod par&amp;ccedil;asında dikkat &amp;ccedil;ekici noktalardan birisi de sum isimli fonksiyon. Parametre olarak float32 tipinden elemanlar i&amp;ccedil;eren bir dizi almakta. Dizinin eleman sayısı belli değil&lt;em&gt;(ki eleman sayısı belli olacak şekilde verebilirsiniz de)&lt;/em&gt;&amp;nbsp;Fonksiyon gelen dizinin boyutuna bakarak elemanların toplamını bulmakta.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Kodu kurcalamak farklı farklı şeyler yapmaya &amp;ccedil;alışmak tamamen sizin elinizde. &amp;Ouml;rneğin matrisler i&amp;ccedil;in aritmetik işlemler yapan fonksiyonları tanımlayarak işe başlayabilirsiniz. Hatta eleman sayısı belli olmayan boyutlu dizileri de işin i&amp;ccedil;erisine katabilirsiniz. Diğer yandan fonskiyona parametre olarak g&amp;ouml;nderdiğiniz bir dizinin elemanlarında yapacağınız değişikliğin orjinal konumdaki dizi elemanlarını etkileyip etkilemediğini de inceleyebilirsiniz. Etkilemiyorsa ve etkilemesini isterseniz ne yapmanız gerektiğinizi de bir araştırın derim.&lt;/p&gt;
&lt;h2&gt;Fonksiyonlar&lt;/h2&gt;
&lt;p&gt;Aslında &amp;ouml;nceki yazımızda olsun bu yazımızda olsun main haricinde kendi yazdığımız bir ka&amp;ccedil; fonksiyona&amp;nbsp;yer verdik. Tabii fonksiyonlar ile ilişkili başka şeyler de var. Go, fonksiyon &amp;ccedil;eşitliliği a&amp;ccedil;ısından zengin bir dil. Bu anlamda fonksiyonel programlama paradigmasını da desteklediğini ifade edebiliriz. Gopher olmak i&amp;ccedil;in bu kullanım şekillerini bilmek &amp;ccedil;ok &amp;ouml;nemli diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. &amp;Ouml;ğrenebildiğim bir ka&amp;ccedil; tanesini paylaşayım.&lt;/p&gt;
&lt;h3&gt;Birden Fazla Değer D&amp;ouml;nd&amp;uuml;rmek&lt;/h3&gt;
&lt;p&gt;Bir fonksiyondan n sayıda değer d&amp;ouml;nd&amp;uuml;rmemiz m&amp;uuml;mk&amp;uuml;n. Aşağıdaki kod par&amp;ccedil;asında bu durumu inceliyoruz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	)

func main(){
	var a,b,c,d int
	var x,y int
	x=8
	y=2
	
	a,b,c,d=calc(x,y)
	
	fmt.Printf("%d+%d=%d\n",x,y,a)
	fmt.Printf("%d*%d=%d\n",x,y,b)
	fmt.Printf("%d/%d=%d\n",x,y,c)
	fmt.Printf("%d-%d=%d\n",x,y,d)
}

func calc(x,y int) (int,int,int,int){
	return x+y,x*y,x/y,x-y
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rneğin &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gofnd_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;calc isimli fonksiyon 4 değer d&amp;ouml;nd&amp;uuml;recek şekilde tanımlanmıştır.&amp;nbsp;return ile dikkat edileceği &amp;uuml;zere fonksiyona parametre olarak gelen x ve y değerleri i&amp;ccedil;in yapılan d&amp;ouml;rt işlem sonu&amp;ccedil;ları d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmektedir. main fonksiyonunda calc &amp;ccedil;ağrısının yapıldığı satırda sonu&amp;ccedil;lar d&amp;ouml;rt farklı değişkene &amp;nbsp;tek ifade ile atanmaktadır. Aslında bu kullanım şekli Rubyist'lere olduk&amp;ccedil;a tanıdık gelecektir. Bilindiği gibi Ruby'de de n sayıda değer d&amp;ouml;nd&amp;uuml;rmek ve tek satırda atama yapmak aynıdır&lt;em&gt;(Fonksiyonlardan d&amp;ouml;necek olan değerleri blok i&amp;ccedil;erisinde adlanrırarak kullanmamız da m&amp;uuml;mk&amp;uuml;n)&lt;/em&gt;&lt;/p&gt;
&lt;h3&gt;params'ın Bir T&amp;uuml;revi Variadic Fonksiyonlar&lt;/h3&gt;
&lt;p&gt;C#&amp;ccedil;ılar bir metoda değişken sayıda parametre g&amp;ouml;ndermenin yollarından birisinin params kullanımı olduğunu bilirler. Go dilinde de bu işlevsellik var. Hatta bu tip fonksiyonlar Variadic olarak ifade ediliyor. fmt paketindeki Println bu tip fonksiyonlara verilebilecek ilk &amp;ouml;rneklerden birisi. Aşağıdaki kod par&amp;ccedil;asında da geliştirici tanımlı bir Variadic fonksiyon &amp;ouml;rneği yer alıyor.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import "fmt"

func main(){
	fmt.Println(sum(1,2,3,4))
	fmt.Println(sum(4,6,77,-2,90,2))
	fmt.Println(sum(0))
}

func sum(numbers ...int)int{
	total:=0
	for _,n:=range numbers{
		total+=n
	}
	return total
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gofnd_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;sum isimli fonksiyon herhangibir sayıda int eleman alacak şekilde tanımlanmıştır. Buradaki ... kullanımının anlamı budur diyebiliriz. Fonksiyon i&amp;ccedil;erisindeki for d&amp;ouml;ng&amp;uuml;s&amp;uuml; mutlaka dikkatinizi &amp;ccedil;ekmiştir. range ile numbers elemanlarında&amp;nbsp;hareket etme kabiliyeti kazanılır. numbers'a ait her eleman d&amp;ouml;ng&amp;uuml; i&amp;ccedil;erisinde n adıyla kullanılır. Fonksiyonun kullanımında farklı sayıda int tipinden değişken g&amp;ouml;nderilmiştir&lt;em&gt;(bir nevi foreach yazdığımızı d&amp;uuml;ş&amp;uuml;nebiliriz sanırım)&lt;/em&gt;&lt;/p&gt;
&lt;h3&gt;Metod Kavramı&lt;/h3&gt;
&lt;p&gt;Gopher olmaya &amp;ccedil;alışırken metod ile fonksiyon'un Go dilinde aynı anlamda kullanılmadığını fark ettim. Yılların C# programıcısı olarak parametre alıp geriye değer d&amp;ouml;nd&amp;uuml;ren fonksiyonları metod olarak isimlendirdiğim &amp;ccedil;ok oldu. Hatta Visual Basic'te metod ve procedure ayrımlarına da şahit oldum. Ancak fonksiyon ve metod arasında bir ayrım olabileceği pek aklıma gelmemişti. Peki o zaman Go dilinde metod neye denir bir bakalım.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import "fmt"

type Vehicle struct{
	id int
	name string
	x,y,z int
}

func(v Vehicle) findLocation() string{
	if v.x&amp;gt;10 &amp;amp;&amp;amp; v.x&amp;lt;20 {
		return "Germany"
		}
	return "France"
}

func main(){
	tank:=Vehicle{id:1,name:"Leopard",x:12,y:1,z:-100}
	fmt.Printf("%s\n",tank.findLocation())
	tank.x=5
	fmt.Printf("%s\n",tank.findLocation())
}&lt;/pre&gt;
&lt;h3&gt;&lt;img src="/image.axd?picture=/2017/01/gofnd_5.gif" alt="" /&gt;&lt;/h3&gt;
&lt;p&gt;&amp;Ouml;rnekte Vehicle isimli bir struct tanımlı. Bu veri tipine yazının ilerleyen kısımlarında değineceğiz. Vehicle i&amp;ccedil;erisinde id,name,x,y,z gibi alanlar mevcut. findLocation ise bir metod&lt;em&gt;(fonkisyon olarak isimlendirmiyoruz)&amp;nbsp;&lt;/em&gt;Tanımlanma şekli normal bir fonksiyondan biraz farklı. func'dan sonra Vehicle isimli bir parametre geliyor. Sonrasında ise&amp;nbsp;metodumuzun adı. Metod i&amp;ccedil;erisnde v isimli değişkeni kullanarak Vehicle &amp;ouml;rneklerinin niteliklerine ulaşabiliyoruz. Aslında metod ile fonksiyon arasındaki fark kim tarafından sahiplenildiği ile anlaşılabiliyor. Metodu &amp;ouml;rnekte olduğu gibi bir veri tipine bağladık. Bu y&amp;uuml;zden &amp;ccedil;ağırılırken Vehicle tipinden bir değişken &amp;uuml;zerinden gidebiliyoruz. Eğer findLocation metodunu main i&amp;ccedil;erisinde herhangibir noktada &amp;ccedil;ağırmaya kalkarsak b&amp;ouml;yle bir metodun olmadığına dair hata mesajı alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gofnd_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;h3&gt;&amp;nbsp;&lt;/h3&gt;
&lt;h3&gt;Değişken Olarak Fonksiyon Kullanımı ve İsimsiz Fonksiyonlar&lt;/h3&gt;
&lt;p&gt;Go dilinde bir fonksiyonu değişkene atayabilir ve hatta bu değişkeni bir başka fonksiyona parametre olarak g&amp;ouml;nderebiliriz. Daha &amp;ccedil;ok fonksiyon alan fonksiyonlarda işimize yarayabilecek bir durum olduğunu ifade edebiliriz. Go'nun hazır paketlerinde bu şekilde &amp;ccedil;alışan pek &amp;ccedil;ok fonksiyon bulunur. Aşağıdaki kod par&amp;ccedil;ası durumu daha iyi anlamamızı sağlayacaktır.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	"strings"
)

func main(){	
	f1 := func(r rune) rune {
		switch {
			case r == ' ':
				return '_'
			case r == 'b':
				return 'B'
			}
		return r
	}
	
	fmt.Println(strings.Map(f1, "bugun guzel bir gun"))
	fmt.Println(strings.Map(func(r rune) rune{
		if r&amp;gt;=65 &amp;amp;&amp;amp; r &amp;lt;= 90{
			return r + 32
			}
		return r
	},"buGUN de Guzel gAlIba"))
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gofnd_10.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Kodda efso şeyler var aslında. strings paketinde yer alan Map fonksiyonunun tanımı ile işe başlamak lazım.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;func Map(mapping func(rune) rune, s string) string&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;nemli olan nokta mapping isimli ilk parametre. Aslında burada rune&lt;em&gt;(Unicode değeri g&amp;ouml;steren bir int32 tipi olarak ifade ediliyor)&lt;/em&gt; tipinden parametre alıp yine rune tipinden değer d&amp;ouml;nd&amp;uuml;ren bir fonksiyon bildirimi var. &amp;Uuml;stelik bu bildirim Map fonksiyonunun ilk parametresi. Dolayısıyla Map fonksiyonuna belirtilen kurala uygun bir fonksiyonu parametre olarak g&amp;ouml;nderebiliriz.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;f1 isimli değişken bu tanıma uyuyor. Dikkat edileceği &amp;uuml;zere rune tipinden parametre alıp yine aynı tipten değer d&amp;ouml;nd&amp;uuml;rmekte. İ&amp;ccedil;erisinde ise r değişkeninin değeri kontrol edilip bir sonu&amp;ccedil; &amp;uuml;retiliyor. Basit&amp;ccedil;e boşluk karakterini _ işaretine ve&amp;nbsp;b harflerini de B'ye d&amp;ouml;n&amp;uuml;şt&amp;uuml;rmekte. Anlamlı bir iş yaptığı s&amp;ouml;ylenemez. f1 değişkeni kodun ilerleyen kısımlarında strings paketi &amp;uuml;zerinden kullanılıyor.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;İkinci strings.Map kullanımı ise biraz daha enteresan. Bu kez Map fonksiyonunun ihtiya&amp;ccedil; duyduğu ilk parametredeki fonksiyonu oradaki ifade i&amp;ccedil;erisinde tanımlamaktayız. Bu arada Map benzeri bir fonksiyon yazmak istersek fonksiyonları tip olarak tanımlayıp ele alabileceğimizi de bilmemiz gerekiyor. &amp;Ouml;rneğimizde kullanıdığımız fonksiyonları aynı zamanda isimsiz fonksiyonlar olarak da d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;GO dili daha &amp;ouml;nce belirttiğimiz &amp;uuml;zere fonksiyonel dil &amp;ouml;zelliklerine de sahip.&amp;nbsp;İsimsiz fonksiyonlar, fonksiyonların değişkenlere atanabilmesi, tip olarak fonksiyon&amp;nbsp;tanımlanabilmesi, fonksiyonlardan fonksiyon d&amp;ouml;nd&amp;uuml;r&amp;uuml;lebilmesi bu kabiliyetler arasında yer alıyor. Bunları da ilerleyen zamanlarda makale veya tek fotoluk ipu&amp;ccedil;larında ele almaya &amp;ccedil;alışacağım.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Aslında yeri gelmişken bir fonksiyondan başka bir fonksiyon nasıl d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;r ve hatta bu fonksiyon i&amp;ccedil;eride isimsiz olarak tanımlandığında Closure adı verilen kapama işlevselliği nasıl vuku bulur, dilerseniz inceleyelim. Aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import ( 
	"fmt"
	)

func add() func(int) int {
    total:=0
	return func(x int) int{
		total+=x
        return total
    }
}

func main(){
    var f1 = add()
    fmt.Println(f1(5))
	fmt.Println(f1(5))
	fmt.Println(f1(5))
	
    var f2 = add()
    fmt.Println(f2(4))
	fmt.Println(f2(4))
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gofnd_11.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Kodun yaptığı şeyin hi&amp;ccedil; bir anlamı yok biliyorsunuz değil mi? Ama Go'nun fonksiyonel kabiliyetleri ile ilgili &amp;ouml;nemli bilgiler barındırıyor. Her şeyden &amp;ouml;nce add isimli fonksiyona odaklanalım. add geriye isimsiz bir fonksiyon d&amp;ouml;nd&amp;uuml;rmekte. Bu fonksiyon int tipinden tek bir parametre alıyor ve yine int tipinden değer d&amp;ouml;nd&amp;uuml;r&amp;uuml;yor. İsimsiz fonksiyon i&amp;ccedil;erisindeyse add fonksiyonunun yerel değişkenine gelen parametre değeri ekleniyor.&lt;/p&gt;
&lt;p&gt;main fonksiyonu i&amp;ccedil;erisinde f1 ve f2 isimli iki değişken tanımı var. Bu değişkenler add fonksiyonunu taşıyorlar. Dolayısıyla onları kodun ilerleyen kısımlarında kullanırken aslında birer fonksiyon &amp;ccedil;ağrısı ger&amp;ccedil;ekleştiriyoruz. f1 ve f2'ye verilen parametre değerleri add fonksiyonundan d&amp;ouml;nen isimsiz fonksiyona gidiyorlar. f1 ve f2 kendi alanları i&amp;ccedil;erisinde bu fonksiyonelliği sunuyorlar. Yani total değişkeni her add fonksiyonu atamasında, atanan değişken i&amp;ccedil;in 0 olarak yeniden belirleniyor.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Kafalar yandı mı? Şahsen benim epey yanmış durumda. Ha bir de fonksiyonları tip gibi tanımlama mevzusu vardı. Az &amp;ouml;nce dile getirmiştim ama arada devreler yandığı i&amp;ccedil;in bu c&amp;uuml;mleyi yazarken dile getirdiğimi de unuttum. Neyse. Bunu ilerleyen zamanlarda incelersek fena olmaz.&lt;/p&gt;
&lt;h2&gt;Structure&lt;/h2&gt;
&lt;p&gt;Metod kavramını incelerken basit bir struct tipi kullandık. Orada &amp;ccedil;ok fazla değinmedik ama Go dilinin &amp;ouml;nemli veri t&amp;uuml;rlerinden birisi olarak karşımıza &amp;ccedil;ıkıyor. Structure, kullanıcı tanımlı veri tiplerinden&lt;em&gt;(user defined data type)&lt;/em&gt; birisi olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Hani nesne y&amp;ouml;nelimi bir dil değil belki ama en azından kendi sınıflarımızı struct gibi tanımlayabiliriz d&amp;uuml;ş&amp;uuml;ncesi g&amp;uuml;zel. Aslında &amp;ccedil;eşitli tipte elemanları barındıracak bir veri modelini tasarlayıp değişken olarak kullanıma sunuyoruz. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asında basit bir struct tanımı ve kullanımı s&amp;ouml;z konusu.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import "fmt"

func main(){

	phone:=Product{productId:1001,title:"Samsung J5",listPrice:245.50}
	var cpu Product
	cpu.productId=2005
	cpu.title="intel core i5 CPU"
	cpu.listPrice=120.50
	
	var products=[]Product{phone,cpu}
	
	writeToConsole(products)
}

func writeToConsole(prods []Product){
	for _,p:=range prods{
		fmt.Printf("(%d)-%s,%f\n",p.productId,p.title,p.listPrice)
	}
}

type Product struct{
	productId int
	title string
	listPrice float32
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gofnd_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekte Product isimli bir yapı kullanılmakta. Yapının productId, title, listPrice isimli &amp;uuml;yeleri mevcut. main fonksiyonu i&amp;ccedil;erisinde iki struct &amp;ouml;rneği yer alıyor. Birbirlerinden farklı şekilde oluşturulduklarına dikkat etmişsinizdir. Her iki yapıyı yine Product tipinden olan bir dizide topladık. Bu diziyi writeToConsole fonksiyonuna parametre olarak da g&amp;ouml;nderiyoruz. Fonksiyon, gelen Product yapılarına ait değerleri ekrana basmakla g&amp;ouml;revli.&lt;/p&gt;
&lt;h3&gt;Pointer Demişken&lt;/h3&gt;
&lt;p&gt;Yukarıda geliştirdiğimiz &amp;ouml;rneği baz alarak&amp;nbsp;konuyu biraz değiştirelim. &amp;Ouml;nce aşağıdaki kod par&amp;ccedil;ası ve sonucunu irdelememiz gerekiyor.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import "fmt"

func main(){

	phone:=Product{productId:1001,title:"Samsung J5",listPrice:245.50}
	fmt.Println(phone.listPrice)
	discount(phone,10)
	fmt.Println(phone.listPrice)
}

func discount(p Product,value float32){
	p.listPrice-=value
}

type Product struct{
	productId int
	title string
	listPrice float32
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gofnd_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;discount fonksiyonu ile parametre olarak gelen &amp;uuml;r&amp;uuml;n&amp;uuml;n liste fiyatını belli bir değerde azaltıyoruz. Fonksiyona phone isimli struct &amp;ouml;rneğini g&amp;ouml;nderiyoruz ve i&amp;ccedil;erisinde listPrice değerini değiştiriyoruz. Ekran &amp;ccedil;ıktısına baktığımızda fonksiyon &amp;ccedil;ağrısından &amp;ouml;nceki liste fiyatı ile sonraki liste fiyatının aynı olduğunu g&amp;ouml;rmekteyiz. Bu zaten beklediğimiz bir sonu&amp;ccedil;. Nitekim phone değişkeni, discount fonksiyonuna ge&amp;ccedil;erken sahip olduğu değerleri ile birlikte kopyalanıyor ve blok i&amp;ccedil;inde p isimli yeni bir değişken olarak muamele g&amp;ouml;r&amp;uuml;yor. Dolayısıyla fonksiyon i&amp;ccedil;erisindeki değişikliker main i&amp;ccedil;erisindeki değişkeni etkilemiyor. Peki etkilemesini istersek!? Yani phone değişkeninin liste fiyatını fonksiyon i&amp;ccedil;erisinde değiştirebilmek istersek. İşte burada ilgili nesneyi fonksiyona referans olarak ge&amp;ccedil;irmenin bir yolunu bulmamız gerekmekte. Bunun i&amp;ccedil;in onun bellek adresini taşımayı d&amp;uuml;ş&amp;uuml;nebiliriz. Sadece iki karakter ile bu işi &amp;ccedil;&amp;ouml;z&amp;uuml;mleyebiliriz.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import "fmt"

func main(){

	phone:=Product{productId:1001,title:"Samsung J5",listPrice:245.50}
	fmt.Println(phone.listPrice)
	discount(&amp;amp;phone,10)
	fmt.Println(phone.listPrice)
}

func discount(p *Product,value float32){
	fmt.Println("Address is ",&amp;amp;p)
	p.listPrice-=value
}

type Product struct{
	productId int
	title string
	listPrice float32
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gofnd_9.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere phone değişkeninin fonksiyon &amp;ccedil;ağrısı &amp;ouml;ncesindeki fiyatı, fonksiyon &amp;ccedil;ağrısı sonrası değişmiştir. Bunun sebebi fonksiyonda bir Pointer tanımlamış olmamızdır. *Product ile tanımladığımız değişkene, &amp;amp;phone ile phone isimli değişkenin bellek adresini taşımız oluruz. Dolayısıyla fonksiyon i&amp;ccedil;erisindeki p değişkeni &amp;uuml;zerinde yapacağımız değişiklikler aslında phone isimli değişken i&amp;ccedil;in ge&amp;ccedil;erli olur. Kodda &amp;amp;p kullanımı ile gelen bellek adresini de yazdığımızı fark etmişsinizdir. Pointer kavramı olduk&amp;ccedil;a derin bir konu. En sooooooonnnn 1995de &amp;uuml;niversite ikinci sınıftayken C++ sınavına hazırlanırken bakmıştım. Dolayısıyla yeniden &amp;ouml;ğrendiğimi ifade edebilirim.&lt;/p&gt;
&lt;p&gt;Yazdığımız kod aynı zamanda bir fonksiyona parametreleri referansları ile aktırmanın da &amp;ouml;rneğidir&lt;em&gt;(Call by Reference konusu)&amp;nbsp;&lt;/em&gt;Normalde fonksiyonlara iki t&amp;uuml;r parametre ge&amp;ccedil;işi s&amp;ouml;z konusu. Call by Value ve Call by Reference şeklinde anılıyorlar.&amp;nbsp;Go dilinde fonksiyonlar varsayılan olarak Call by Value yaklaşımını kullanıyor. Referans taşımaları i&amp;ccedil;in az &amp;ouml;nceki &amp;ouml;rnekte olduğu gibi Pointer'lardan yararlanabiliyoruz. Bir dizi s&amp;ouml;z konusu olduğunda ise Slice &amp;ouml;neriliyor&lt;em&gt;(Bu da benim i&amp;ccedil;in yeni bir kavram. İlerleyen zamanlarda &amp;ouml;ğreneceğim)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdilik Gopher olma &amp;ccedil;alışmalarım ile ilgili aktaracaklarım bu kadar sevgili arkadaşlar. Bu yazıda dizilere, d&amp;ouml;ng&amp;uuml;lere, yapılara, fonksiyonlara ve metodlara değinme fırsatımız oldu. Ucundan bir kuple de olsa Pointer dedik. Epeyce yorulduk. Şimdi kısa bir ara verme zamanı. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-01-13 12:10:00</pubDate>
  <slug>gopher-olma-calismalari</slug>
  <tags>
    <tag>golang</tag>
    <tag>gopher</tag>
    <tag>programming</tag>
    <tag>arrays</tag>
    <tag>loops</tag>
    <tag>function</tag>
    <tag>method-info</tag>
    <tag>anonymous-function</tag>
    <tag>range</tag>
    <tag>pointer</tag>
  </tags>
  <categories>
    <category>GoLang</category>
  </categories>
</post>