<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Object vs Dynamic</title>
  <description>Ayrıntılar detaylarda saklıdır. Bu cümleyi çok severim. Sevdiğim özlü sözler arasındadır. Gerçel bir nesnenin ne kadar kaliteli olduğunu anlamak için detaylarına bakmak gerekir. İşçiliğine, kullanılan malzemeye, malzemelerin uyumuna vs...Hatta benzer diğerleri ile olan kalite farkını anlamak için bile. Çok doğal olarak yazılım dünyasında da bir takım konuların anlaşılabilmesi, kavranabilmesi, benzerleri ile olan farklarının irdelenebilmesi için mutlaka detaylara bakmak, ama sıkılmadan bakmak gerekir. Aynen bu günkü yazımızda yapacağımız gibi.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f1%2fblg139_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Ayrıntılar detaylarda saklıdır&lt;/strong&gt;. Bu c&amp;uuml;mleyi &amp;ccedil;ok severim. Sevdiğim &amp;ouml;zl&amp;uuml; s&amp;ouml;zler arasındadır.&amp;nbsp;Ger&amp;ccedil;el bir nesnenin ne kadar kaliteli olduğunu anlamak i&amp;ccedil;in detaylarına bakmak gerekir. İş&amp;ccedil;iliğine, kullanılan malzemeye, malzemelerin uyumuna vs...Hatta benzer diğerleri ile olan kalite farkını anlamak&amp;nbsp;i&amp;ccedil;in bile. &amp;Ccedil;ok doğal olarak yazılım d&amp;uuml;nyasında da bir takım konuların anlaşılabilmesi, kavranabilmesi, benzerleri ile olan farklarının irdelenebilmesi i&amp;ccedil;in mutlaka detaylara bakmak, ama&amp;nbsp;sıkılmadan bakmak gerekir. Aynen bu g&amp;uuml;nk&amp;uuml; yazımızda yapacağımız gibi.&lt;/p&gt;
&lt;p&gt;Bu yazımızda &lt;strong&gt;Dynamic Language Runtime &lt;/strong&gt;kullanımında b&amp;uuml;y&amp;uuml;k &amp;ouml;neme sahip olan &lt;strong&gt;dynamic&lt;/strong&gt; ile &lt;strong&gt;.Net Framework' &lt;/strong&gt;&amp;uuml;n ilk &amp;ccedil;ıktığı zamandan&amp;nbsp;beri var olan &lt;strong&gt;Object&lt;/strong&gt; tipi arasındaki farklılıkları g&amp;ouml;rmeye &amp;ccedil;alışacağız. Bunun i&amp;ccedil;in kod tarafında biraz daha detaya girmemiz gerekecek. &amp;Ccedil;ok derin değil belki de ama aradaki farklılıkları &amp;ccedil;ıkartabilmek adına &amp;ouml;nemli detaylar. Başlamadan &amp;ouml;nce &amp;ouml;rneklerimizi &lt;strong&gt;Visual Studio 2010&amp;nbsp;Ultimate RC&lt;/strong&gt;&amp;nbsp;s&amp;uuml;r&amp;uuml;m&amp;uuml;nde geliştirdiğimizi ve ilerleyen s&amp;uuml;r&amp;uuml;mlerde farklılıklar olabileceğini hatırlatmak isterim.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikli olarak işe aşağıdaki basit kod par&amp;ccedil;ası ve &lt;strong&gt;Object&lt;/strong&gt; tipini ele alarak başlayalım.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Case 1;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;object pi = Math.PI;
Console.WriteLine(pi.GetType().ToString());&lt;/pre&gt;
&lt;p&gt;İlk satırda &lt;strong&gt;Math.PI&lt;/strong&gt; sabit değerinin &lt;strong&gt;object&lt;/strong&gt; tipine atandığını g&amp;ouml;r&amp;uuml;yoruz.&amp;nbsp;Aslında bilin&amp;ccedil;siz olarak bir t&amp;uuml;r d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml; s&amp;ouml;z konusu&lt;strong&gt;(Implicitly Type Casting)&lt;/strong&gt;.&amp;nbsp;Burada herhangibir sıkıntı yok. &lt;strong&gt;pi.GetType&lt;/strong&gt; satırının &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı ise&amp;nbsp;&lt;strong&gt;System.Double &lt;/strong&gt;olmalıdır. Nitekim eşitliğin sağ tarafından gelen &lt;strong&gt;Math.PI, double&lt;/strong&gt; tipinden olduğu i&amp;ccedil;in &lt;strong&gt;pi&lt;/strong&gt; isimli &lt;strong&gt;object&lt;/strong&gt; tipi &amp;uuml;zerinden ele alınsa da kendi tipini taşımış olmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg139_Case1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi kodumuzu aşağıdaki gibi değiştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Case 2;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;object pi = Math.PI;
object square = pi * 10 * 10;&lt;/pre&gt;
&lt;p&gt;Bu kez &lt;strong&gt;object&lt;/strong&gt; tipinden olan &lt;strong&gt;pi&lt;/strong&gt; ile iki sayısal değeri(ki bunlarda int tipindendir) matematiksel bir işleme tabi tutup sonucu yine bir &lt;strong&gt;object&lt;/strong&gt; tipine atamaya &amp;ccedil;alışıyoruz. Ancak kodu derlediğimizde &lt;strong&gt;Compiler'&lt;/strong&gt; ın bir derleme zamanı hata mesajı &amp;uuml;rettiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg139_Case2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hımmm...Aslında bu son derece doğal bir sonu&amp;ccedil;. Nitekim derleme zamanında &lt;strong&gt;pi &lt;/strong&gt;değişkeninin tipi &lt;strong&gt;object &lt;/strong&gt;ve biz &lt;strong&gt;object &lt;/strong&gt;tipi ile &lt;strong&gt;int &lt;/strong&gt;tiplerini işleme sokmaya &amp;ccedil;alışıyoruz. Burada &amp;ccedil;&amp;ouml;z&amp;uuml;m, d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemini bilin&amp;ccedil;li olarak yapmaktan ibaret&lt;strong&gt;(Explicitly Type Casting)&lt;/strong&gt;. Yani kodu aşağıdaki gibi d&amp;uuml;zenlemekten;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Case 3;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;object pi = Math.PI;
object square = (double)pi * 10 * 10;&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;pi&lt;/strong&gt; değişkeni bilin&amp;ccedil;li olarak &lt;strong&gt;double&lt;/strong&gt; tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lm&amp;uuml;ş durumdadır. Aslında az &amp;ouml;nceki senaryomuzda &lt;strong&gt;pi' &lt;/strong&gt;nin taşıdığı tipin &lt;strong&gt;double&lt;/strong&gt; olduğunu g&amp;ouml;rm&amp;uuml;şt&amp;uuml;k. Yine de başka tipler ile işleme tabi tuttuğumuzda derleme zamanı hatası ile karşılaşmaktan kurtulamadık. &amp;Ccedil;&amp;uuml;nk&amp;uuml; &lt;strong&gt;pi&lt;/strong&gt; değişkeni &lt;strong&gt;double&lt;/strong&gt; tipten değer taşıyan bir &lt;strong&gt;object&lt;/strong&gt; idi aslında.&lt;/p&gt;
&lt;p&gt;Şimdi durumu biraz daha entersan bir hale getireceğiz. Aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alın ve kodu kafanızda derleyip hata olup olmadığını s&amp;ouml;yleyin. Sonrasında ise &amp;ccedil;alışma zamanında bir hata oluşup oluşmayacağını d&amp;uuml;ş&amp;uuml;n&amp;uuml;n ve bir karar daha verin. En sonunda ise bunu, konu ile ilgili yakın arkadaşlarınızla tartışın &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;object pi = Math.PI;
object square = (int)pi * 10 * 10;&lt;/pre&gt;
&lt;p&gt;Derleme zamanında herhangibir hata mesajı alınmayacaktır. Ancak &lt;strong&gt;&amp;ccedil;alışma zamanına(Runtime)&lt;/strong&gt; ge&amp;ccedil;tiğimizde aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan &lt;strong&gt;istisna(Exception)&lt;/strong&gt; ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg139_Case3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Upsss!!!&lt;/p&gt;
&lt;p&gt;Sorun şudur; &lt;strong&gt;pi&lt;/strong&gt; değişkeni &lt;strong&gt;object&lt;/strong&gt; tipinden tanımlanmıştır ve eşitliğin sağ tarafına g&amp;ouml;re double tipinden bir değer taşımaktadır. Ancak bu tip &lt;strong&gt;cast&lt;/strong&gt; operat&amp;ouml;r&amp;uuml;ne g&amp;ouml;re &lt;strong&gt;int&lt;/strong&gt; tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmeye &amp;ccedil;alışılmaktadır. Oysaki &amp;ccedil;alışma zamanının burada beklediği tam olarak &lt;strong&gt;double&lt;/strong&gt; tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemidir.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Dolayısıyla &lt;strong&gt;object&lt;/strong&gt; tipini kullandığımız bu senaryoda matematiksel işlemlerin yapılabilmesi i&amp;ccedil;in, mutlaka doğru tipe d&amp;ouml;n&amp;uuml;ş&amp;uuml;m ger&amp;ccedil;ekleştirilmelidir. Eğer bir d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi yapmassak, derleme zamanında hata mesajı alırız. Ancak tip d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml; yaparkende koltuğumuzda rahat edemeyiz, &amp;ccedil;&amp;uuml;nk&amp;uuml; yanlış tipe d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemleri &amp;ccedil;alışma zamanı istisnaları ile cezalandırılır. Buna g&amp;ouml;re ger&amp;ccedil;ekten beklenen tipe d&amp;ouml;n&amp;uuml;ş&amp;uuml;m işlemi sağlanmalıdır.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Gelelim yeni g&amp;ouml;zdemiz olan &lt;strong&gt;Dynamic &lt;/strong&gt;tipe. Yukarıdaki senaryoları bire bir, ama bu kez &lt;strong&gt;dynamic&lt;/strong&gt; tipini kullanarak değerlendireceğiz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;dynamic pi = Math.PI;
Console.WriteLine(pi.GetType().ToString());&lt;/pre&gt;
&lt;p&gt;Bu kez eşitliğin sol tarafında &lt;strong&gt;dynamic&lt;/strong&gt; tipi vardır. &lt;strong&gt;object&lt;/strong&gt; tipinin kullanıldığı &amp;ouml;rnektekine&lt;strong&gt;(Case 1)&lt;/strong&gt; benzer olaraktan &lt;strong&gt;pi&lt;/strong&gt; değişkeni yine &lt;strong&gt;double&lt;/strong&gt; tipinden bir değer taşımaktadır. &amp;Ccedil;alışma zamanının &amp;uuml;reteceği sonu&amp;ccedil;ta aynı olacaktır. Ancak aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;dynamic pi = Math.PI;
dynamic square = pi * 10 * 10;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;object&lt;/strong&gt; tipinin kullandığımız &amp;ouml;rneğe&lt;strong&gt;(Case 2)&lt;/strong&gt; baktığımızda derleme zamanında bir hata aldığımızı hatırlıyoruzdur sanırım. Oysaki &lt;strong&gt;dynamic&lt;/strong&gt; tipi derleme zamanı ile ilgilenmemektedir. &amp;Ccedil;alışma zamanında ise &lt;strong&gt;pi'&lt;/strong&gt; yi gereken tipte ele almaktadır. Zaten &lt;strong&gt;object&lt;/strong&gt; tipini kullandığımız &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; senaryomuzu ele almamıza da gerek kalmamıştır. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Buna g&amp;ouml;re ş&amp;ouml;yle bir sonuca varabiliriz. &lt;strong&gt;Dynamic&lt;/strong&gt; tipin kullanıldığı hallerde &lt;strong&gt;derleyicinin(Compiler)&lt;/strong&gt; derleme zamanında tip tahmini yapmasına gerek yoktur. Bu &amp;ccedil;&amp;ouml;z&amp;uuml;mleme işi &amp;ccedil;alışma zamanında yapılmaktadır.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Tabi bu sonu&amp;ccedil;lara g&amp;ouml;re "her yerde &lt;strong&gt;dynamic&lt;/strong&gt; tip kullanalım mı?" sorusu da g&amp;uuml;ndeme gelir. Ancak "metodlara parametre aktarımlarında &lt;strong&gt;dynamic&lt;/strong&gt; kullanımının kodun kırılmasına neden olması s&amp;ouml;z konusu olabilir mi?" sorusu daha da &amp;ouml;nemlidir. Şimdi bu durumu ele almaya &amp;ccedil;alışalım. İşte kodlarımız;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;dynamic R = "on iki";
	Calculate(R);
	#endregion
	#endregion
}
static double Calculate(double r)
{
	return Math.PI * r * r;
}&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında kodu kırmaya y&amp;ouml;nelik olarak bir hamle yapıldığı d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. &lt;strong&gt;Calculate&lt;/strong&gt; metodu &lt;strong&gt;double&lt;/strong&gt; tipinden bir değer beklemektedir. Biz ise &lt;strong&gt;dynamic&lt;/strong&gt; olarak tanımladığımız &lt;strong&gt;R&lt;/strong&gt; değişkenine &lt;strong&gt;string&lt;/strong&gt; bir değer atayarak parametre g&amp;ouml;nderme işlemini ger&amp;ccedil;ekleştirmekteyiz. &lt;strong&gt;Dynamic&lt;/strong&gt; kullanımına g&amp;ouml;re derleme zamanında bir hata mesajı &lt;span style="text-decoration: underline;"&gt;alınmaması&lt;/span&gt; normaldir. Benzer şekilde &amp;ccedil;alışma zamanında gelen &lt;strong&gt;string&lt;/strong&gt; tipinin, &lt;strong&gt;double&lt;/strong&gt; tipe otomatik olarak d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;leceğini de d&amp;uuml;ş&amp;uuml;nebiliriz. Eğer b&amp;ouml;yle olsaydı, kodun &lt;strong&gt;dynamic&lt;/strong&gt; tipi yardımıyla kolayca kırılabileceği sonu&amp;ccedil;larına varabilirdik. Ş&amp;uuml;k&amp;uuml;r ki &amp;ccedil;alışma zamanında aşağıdaki hata mesajı ile cezalandırılırız. &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg139_Case6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ancak,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;dynamic R=12;&lt;/pre&gt;
&lt;p&gt;atamasını yaparsak herhangibir sorun ile karşılaşmayız. &amp;Ccedil;&amp;uuml;nk&amp;uuml; &lt;strong&gt;Calculate&lt;/strong&gt; metodunun beklediği(veya taşıyabildiği)&amp;nbsp;tipte bir değişkenin g&amp;ouml;nderilmesi sağlanmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Sonu&amp;ccedil; olarak bir metoda &lt;strong&gt;dynamic&lt;/strong&gt; tipte veri atayabiliyor olsakta bu, metoda her tipten değeri aktarabileceğimiz anlamına gelmemektedir. Ger&amp;ccedil;ekten metodun beklediği veya kabul edebileceği t&amp;uuml;rden bir değişkenin atanması şarttır.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Son senaryomuzu &lt;strong&gt;object&lt;/strong&gt; tipi ile d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zdeyse yine başta a&amp;ccedil;ıklanan 3 vakanın ger&amp;ccedil;ekleşeceği g&amp;ouml;r&amp;uuml;lecektir. Gelin bu durumları bir kere daha inceleyelim. Kodu ilk etapta aşağıdaki gibi d&amp;uuml;zenleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;object R = 12.1;
Calculate(R);&lt;/pre&gt;
&lt;p&gt;Bu durumda daha derleme zamanında hata mesajı alırız. Aşağıdaki şekilde olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg139_Case7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dolayısıyla tip d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml; yapmamız şarttır. &amp;Ouml;yleyse yapalım. &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;object R = 12.1;
Calculate((int)R);&lt;/pre&gt;
&lt;p&gt;Derleme zamanında hata yok. S&amp;uuml;per...Ama oda ne? &amp;Ccedil;alışma zamanında yine hata aldık. &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg139_Case8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tahmin edileceği &amp;uuml;zere &lt;strong&gt;object&lt;/strong&gt; tipi kullanıldığından &amp;ccedil;alışma zamanında tam olarak &lt;strong&gt;double&lt;/strong&gt; tipinden bir değer taşınması beklenmektedir. &lt;strong&gt;12.1&lt;/strong&gt; &lt;strong&gt;double&lt;/strong&gt; olarak ifade edilmesine rağmen &lt;strong&gt;int&lt;/strong&gt; tipine yapılan d&amp;ouml;n&amp;uuml;ş&amp;uuml;m ge&amp;ccedil;ersizdir&lt;em&gt;(&lt;strong&gt;Dynamic&lt;/strong&gt; tipin kullanımının tam aksine)&lt;/em&gt;. Dolayısıyla kodun aşağıdaki gibi d&amp;uuml;zenlenmesi gerekir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;object R = 12.1;
Calculate((double)R);&lt;/pre&gt;
&lt;p&gt;Bu durumda &amp;ccedil;alışma zamanında her hangibir hata mesajı alınmadan ilerlenebilecektir.&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere derinlerde, &lt;strong&gt;dynamic&lt;/strong&gt; ve &lt;strong&gt;object &lt;/strong&gt;kullanımları arasında belirgin farklılıklar bulunmaktadır. Bunların sebepleri&amp;nbsp;aşikardır. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek, hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f2%2fDynamicVsObject_RC.rar"&gt;DynamicVsObject_RC.rar (20,73 kb)&lt;/a&gt;&amp;nbsp;&lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 Ultimate RC s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde geliştirilmiş ve test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-03-31 15:10:00</pubDate>
  <slug>Object-vs-Dynamic</slug>
  <tags>
    <tag>dynamic-language-runtime</tag>
    <tag>c#-40</tag>
    <tag>c#-30</tag>
    <tag>c#</tag>
  </tags>
  <categories>
    <category>C#</category>
    <category>C# 3.0</category>
    <category>C# 4.0</category>
  </categories>
</post>