<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>OleDbDataAdapter Sınıfı ve Update Metodu.</title>
  <description>Bu makalemizde, OleDbDataAdapter sınıfının , veriler üzerindeki güncelleme işlemlerinin, veri kaynağına yansıtılması sırasında nasıl bir rol oynadığını ve kullanıldığını incelemeye çalışacağız. Önceki makalelerimizde belirttiğimiz gibi, OleDbDataAdapter nesnesi yardımıyla veri kaynağından, uygulamalarımızdaki bağlantısız katman nesnelerine veri kümelerini aktarmak amacıyla Fill metodunu kullanıyorduk. Diğer yandan, bağlantısız katman nesnelerimizin temsil ettiği veriler üzerinde yapılan değişiklikleri veritabanına göndermek istersek, Update metodunu kullanırız.</description>
  <content>&lt;p&gt;Değerli&amp;nbsp; Okurlarım, Merhabalar. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bu makalemizde, OleDbDataAdapter sınıfının , veriler &amp;uuml;zerindeki g&amp;uuml;ncelleme işlemlerinin, veri kaynağına yansıtılması sırasında nasıl bir rol oynadığını ve kullanıldığını incelemeye &amp;ccedil;alışacağız. &amp;Ouml;nceki makalelerimizde belirttiğimiz gibi, OleDbDataAdapter nesnesi yardımıyla veri kaynağından, uygulamalarımızdaki bağlantısız katman nesnelerine veri k&amp;uuml;melerini aktarmak amacıyla Fill metodunu kullanıyorduk. Diğer yandan, bağlantısız katman nesnelerimizin temsil ettiği veriler &amp;uuml;zerinde yapılan değişiklikleri veritabanına g&amp;ouml;ndermek istersek, Update metodunu kullanırız.&lt;/p&gt;
&lt;p&gt;Update metodu &amp;ccedil;alışma sistemi a&amp;ccedil;ısından olduk&amp;ccedil;a ilgi &amp;ccedil;ekici bir metoddur. Bildiğiniz gibi, DataAdapter nesnelerinin, verilerin g&amp;uuml;ncellenmesi i&amp;ccedil;in UpdateCommand, verileri eklemek i&amp;ccedil;in InsertCommand, veri silmek i&amp;ccedil;in DeleteCommand &amp;ouml;zellikleri vardır. Uygulamamız &amp;ccedil;alışırken, bağlantısız katman nesnelerimiz verilerin satırsal bazda durumlarını g&amp;ouml;steren bir değer i&amp;ccedil;eririr. RowState olarak bilinen bu &amp;ouml;zellik DataRow sınıfına ait bir &amp;ouml;zellik olup aşağıdaki tabloda yer alan DataRowState numaralandırıcısı t&amp;uuml;r&amp;uuml;nden değerlerden birisini almaktadır.&lt;/p&gt;
&lt;table id="table1" style="border-collapse: collapse; width: 493px;" border="1" cellpadding="5" bgcolor="#cccccc"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="border-style: solid; border-width: 1px;" width="155"&gt;&lt;strong&gt; DataRowState Değeri&lt;/strong&gt;&lt;/td&gt;
&lt;td style="border-style: solid; border-width: 1px;" width="315"&gt;&lt;strong&gt; A&amp;ccedil;ıklama&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="border-style: solid; border-width: 1px;" bgcolor="#ffffff" width="155"&gt;Added&lt;/td&gt;
&lt;td style="border-style: solid; border-width: 1px;" bgcolor="#ffffff" width="315"&gt;Yeni bir satır eklendiğini belirtir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="border-style: solid; border-width: 1px;" bgcolor="#ffffff" width="155"&gt;Deleted&lt;/td&gt;
&lt;td style="border-style: solid; border-width: 1px;" bgcolor="#ffffff" width="315"&gt;Bir satırın silindiğini belirtir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="border-style: solid; border-width: 1px;" bgcolor="#ffffff" width="155"&gt;Modified&lt;/td&gt;
&lt;td style="border-style: solid; border-width: 1px;" bgcolor="#ffffff" width="315"&gt;Bir satırın d&amp;uuml;zenlendiğini belirtir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="border-style: solid; border-width: 1px;" bgcolor="#ffffff" width="155"&gt;Detached&lt;/td&gt;
&lt;td style="border-style: solid; border-width: 1px;" bgcolor="#ffffff" width="315"&gt;Yeni bir satır oluşturulduğunu ama hen&amp;uuml;z ilgili bağlantısız katman nesnesinin DataRow koleksiyonuna eklenmediğini belirtir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="border-style: solid; border-width: 1px;" bgcolor="#ffffff" width="155"&gt;Unchanged&lt;/td&gt;
&lt;td style="border-style: solid; border-width: 1px;" bgcolor="#ffffff" width="315"&gt;Satırda herhangibir değişiklik olmadığını belirtir.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Tablo1. RowState &amp;ouml;zelliğinin DataRowState numaralandırıcısı tipinden alabileceği değerler.&lt;/p&gt;
&lt;p&gt;Buradan yola &amp;ccedil;ıkarasak, Update metodu uygulandığında, OleDbDataAdapter nesnesi, parametre olarak belirtilen DataTable nesnesinin t&amp;uuml;m satırlarına bakıcaktır. Bu satırlarda yukarıdaki değerleri arıyacaktır. Sonu&amp;ccedil; olarak, Added satırları i&amp;ccedil;in, InsertCommand &amp;ouml;zelliğindeki sql komutunu, Deleted satırlar i&amp;ccedil;in DeleteCommand &amp;ouml;zelliğindeki sql komutunu, Modified satırlar i&amp;ccedil;in ise, UpdateCommand &amp;ouml;zelliğindeki sql komutunu &amp;ccedil;alıştıracak, b&amp;ouml;ylece uygun g&amp;uuml;ncellemelerin veritabanına en doğru sql ifadeleri ile aktarılmalarını sağlayacaktır.&lt;/p&gt;
&lt;p&gt;Elbette Update komutunun başarıya ulaşması, Fill metodunun ge&amp;ccedil;erli bir SelectCommand sql komutunu &amp;ccedil;alıştırmasına bağlıdır. &amp;Ccedil;&amp;uuml;nk&amp;uuml;, diğer komutların parametreleri bu select sorgusu ile elde edilen tablo alanlarından oluşturulacaktır. Ayrıca, DeleteCommand ve UpdateCommand &amp;ouml;zelliklerinin sahip olduğu sql komutları Where koşuluna sahiptirler ve bu koşul i&amp;ccedil;in &amp;ccedil;oğunlukla tabloya ait Primary Key(Birincil Anahtar) alanını parametre olarak kullanırlar. Bu sebeple, tablonun birincil anahtara sahip olması &amp;ouml;nemlidir.&lt;/p&gt;
&lt;p&gt;Bahsetmiş olduğumuz g&amp;uuml;ncelleme komutlarını elle programlayabileceğimiz gibi, bu işlemi bizim i&amp;ccedil;in basitleştiren CommandBuilder sınıfınıda kullanabiliriz. Şimdi dilerseniz, OleDbCommandBuilder sınıfı yardımıyla bu işlemin nasıl ger&amp;ccedil;ekleştirileceğini bir &amp;ouml;rnek &amp;uuml;zerinde inceleyelim. &amp;Ouml;rneğimizde, basit bir sql tablosunu kullanacağız. &amp;Ouml;ncelikle programımızın kodlarını yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;/* global seviyede gerekli nesnelerimizi tanımlıyoruz. Sql sunucusuna bağlantımız i&amp;ccedil;in bir oleDbConnection nesnesi, verileri tablodan &amp;ccedil;ekmek ve DataTable nesnemize aktarmak, g&amp;uuml;ncellemeleride aynı dataTable nesnesi &amp;uuml;zerinden veri kaynağına g&amp;ouml;ndermek i&amp;ccedil;in bir DataAdapter nesnesi, bağlantısız katmanda verilerimizi tutmak i&amp;ccedil;in bir dataTable nesnesi ve OleDbDataAdapter nesnemiz i&amp;ccedil;in gerekli Update,Delete,Insert komutlarını oluşturacak bir OleDbCommandBuilder nesnesi. */
OleDbConnection con;
OleDbDataAdapter da;
DataTable dt;
OleDbCommandBuilder cb;

private void btnDoldur_Click(object sender, System.EventArgs e)
{
    con=new OleDbConnection("Provider=SQLOLEDB;data source=localhost;database=Friends;integrated security=sspi"); /* Bağlantımız oluşturuluyor. */
    da=new OleDbDataAdapter("Select * From Kisiler",con); /* DataAdapter nesnesmiz, select sorgusu ile birlikte oluşturuluyor. */
    dt=new DataTable("Kisiler"); /*DataTable nesnemiz oluşturuluyor. */
    da.Fill(dt); /* DataTable nesnemizin bellekte g&amp;ouml;sterdiği alan Kisiler tablosundaki veriler ile dolduruluyor. */
    dgKisiler.DataSource=dt; /* DataGrid kontrol&amp;uuml;m&amp;uuml;z, bağlantısız katmandaki verileri işaret eden DataTable nesnemize bağlanıyor. */
}

private void btnGuncelle_Click(object sender, System.EventArgs e)
{
    try
    {
        cb=new OleDbCommandBuilder(da); /* CommandBuilder nesnemiz , OleDbDataAdapter nesnemiz i&amp;ccedil;in oluşturuluyor. CommandBuilder'a ait new yapılandırıcısı parametre olarak aldığı OleDbDataAdapter nesnesinin SelectCommand &amp;ouml;zelliğindeki sql komutuna bakarak gerekli diğer UpdateCommand,DeleteCommand ve InsertCommand komutlarını oluşturuyor. */

        da.Update(dt); /* DataTable'daki değişiklikler Update metodu ile, veritabanına g&amp;ouml;nderiliyor. */
    }
    catch(Exception hata)
    {
        MessageBox.Show(hata.Message.ToString());
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda ve Doldur isimli butona tıkladığımızda, tablomuza ait verilerin dataGrid kontrol&amp;uuml;ne y&amp;uuml;klendiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk59_1.gif" alt="" width="504" height="240" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 1. Fill metodunun &amp;ccedil;alıştırılması sonucu.&lt;/p&gt;
&lt;p&gt;Şimdi yeni bir satır ekleyip bir ka&amp;ccedil; satır &amp;uuml;zerinde değişiklik yapalım ve başka bir satırıda silelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk59_2.gif" alt="" width="504" height="240" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 2. Update komutunu &amp;ccedil;alıştırmadan &amp;ouml;nceki hali.&lt;/p&gt;
&lt;p&gt;G&amp;uuml;ncelle başlıklı butona tıkladığımızda, OleDbCommandBuilder nesnemiz, OleDbDataAdapter nesnemiz i&amp;ccedil;in gerekli olan komutları oluşturur. Daha sonra Update metodu &amp;ccedil;alıştırılmaktadır. Update tablomuzda yapmış olduğumuz d&amp;uuml;zenleme, silme ve ekleme işlemlerini g&amp;ouml;rmek i&amp;ccedil;in, DataTable nesnemizin DataRow koleksiyonundaki her bir DataRow nesnesi i&amp;ccedil;in RowState &amp;ouml;zelliklerinin değerlerine bakar ve uygun olan sql komutlarına bu satırlardaki değerleri parametreler vasıtasıyla aktararak veritabanının g&amp;uuml;ncellenmesini sağlar. Bu noktadan sonra veritabanımızdaki tablomuza baktığımızda bağlantısız katman nesnesinin işaret ettiği bellek alanındaki t&amp;uuml;m değişikliklerin yansıtıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk59_3.gif" alt="" width="500" height="98" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 3. Tabloya yansıtılan değişiklikler.&lt;/p&gt;
&lt;p&gt;Dilerseniz CommandBuilder nesnemizin bizim i&amp;ccedil;in oluşturmuş olduğu komutların nasıl sql ifadeleri i&amp;ccedil;erdiğini inceleyelim. Bu ama&amp;ccedil;la, OleDbCommandBuilder sınıfına ait aşağıda prototipleri belirtilen metodları kullanacağız.&lt;/p&gt;
&lt;table id="table3" style="border-collapse: collapse; width: 481px;" border="1" cellpadding="5" bgcolor="#cccccc"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="134"&gt;&lt;strong&gt;Metod&lt;/strong&gt;&lt;/td&gt;
&lt;td width="324"&gt;&lt;strong&gt;Prototipi&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="134"&gt;GetInsertCommand&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="324"&gt;&lt;strong&gt;public &lt;/strong&gt; OleDbCommand&lt;strong&gt; GetInsertCommand();&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="134"&gt;GetDeleteCommand&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="324"&gt;&lt;strong&gt;public &lt;/strong&gt; OleDbCommand&lt;strong&gt; GetDeleteCommand();&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="134"&gt;GetUpdateCommand&lt;/td&gt;
&lt;td bgcolor="#ffffff" width="324"&gt;&lt;strong&gt;public &lt;/strong&gt; OleDbCommand&lt;strong&gt; GetUpdateCommand();&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Tablo 2. OleDbCommandBuilder i&amp;ccedil;in Get metodlar.&lt;/p&gt;
&lt;p&gt;Dikkat edecek olursanız t&amp;uuml;m bu metodlar geriye OleDbCommand sınıfı t&amp;uuml;r&amp;uuml;nden bir nesne değeri d&amp;ouml;nd&amp;uuml;rmektedir. Uygulamamızdaki btnGuncelle kodlarını aşağıdaki gibi d&amp;uuml;zenlediğimizde, OleDbCommandBuilder nesnesinin, OleDbDataAdapter nesnesi i&amp;ccedil;in oluşturmuş olduğu komutları g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;OleDbCommand cmdInsert=new OleDbCommand();
cmdInsert=cb.GetInsertCommand();
MessageBox.Show("Insert Sql Ifadesi :"+cmdInsert.CommandText.ToString());

OleDbCommand cmdDelete=new OleDbCommand();
cmdDelete=cb.GetDeleteCommand();
MessageBox.Show("Delete Sql Ifadesi :"+cmdDelete.CommandText.ToString());

OleDbCommand cmdUpdate=new OleDbCommand();
cmdUpdate=cb.GetUpdateCommand();
MessageBox.Show("Update Sql Ifadesi :"+cmdUpdate.CommandText.ToString());&lt;/pre&gt;
&lt;p&gt;Şimdi uygulamamızı &amp;ccedil;alıştıralım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk59_5.gif" alt="" width="620" height="133" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 4. CommandBuilder nesnemizin oluşturduğu Delete sql komutu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk59_4.gif" alt="" width="497" height="107" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 5. CommandBuilder nesnemizin oluşturduğu Insert sql komutu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk59_6.gif" alt="" width="629" height="133" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 6. CommandBuilder nesnemizin oluşturduğu Update sql komutu.&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi işlem bu kadar basittir. Ancak dilersek CommandBuilder nesnesini kullanmayıp, DataAdapter nesnemiz i&amp;ccedil;in gerekli sql komutlarını kendimizde yazabiliriz. Bu biraz daha uzun bir y&amp;ouml;ntem olmakla birlikte, daha &amp;ccedil;ok kontrole sahip olmamızı sağlar. Ayrıca her programlama dilinde olduğu gibi, işleri b&amp;ouml;ylesine kolaylaştırıcı nesneler performans kaybına neden olabilmektedir. Bu nedenlerden &amp;ouml;t&amp;uuml;r&amp;uuml;, OleDbDataAdapter nesnemizin ihtiya&amp;ccedil; duyduğu komutları kendimiz yazmak isteyebiliriz. Burada &amp;ouml;nemli olan nokta gerekli parametrelerin doğru bir şekilde oluşturulmasıdır. Şimdi yukarıda CommandBuilder sınıfı yardımıyla geliştirdiğimiz uygulamayı yineleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;OleDbConnection con;
OleDbDataAdapter da;
DataTable dt;

private void btnDoldur_Click(object sender, System.EventArgs e)
{
    con=new OleDbConnection("Provider=SQLOLEDB;data source=localhost;database=Friends;integrated security=sspi"); 
    da=new OleDbDataAdapter("Select * From Kisiler",con);
    dt=new DataTable("Kisiler"); 
    da.Fill(dt); 
    dgKisiler.DataSource=dt; 
}

private void btnGuncelle_Click(object sender, System.EventArgs e)
{
    try
    {
        da.InsertCommand=new OleDbCommand("INSERT INTO Kisiler (Ad,Soyad,DogumTarihi,Meslek) VALUES (?,?,?,?)",con);
        da.InsertCommand.Parameters.Add("prmAd",OleDbType.VarChar,50,"Ad");
        da.InsertCommand.Parameters.Add("prmSoyad",OleDbType.VarChar,50,"Soyad");
        da.InsertCommand.Parameters.Add("prmDogum",OleDbType.Date,8,"DogumTarihi");
        da.InsertCommand.Parameters.Add("prmMeslek",OleDbType.VarChar,50,"Meslek");

        da.UpdateCommand=new OleDbCommand("UPDATE Kisiler SET Ad=?,Soyad=?,DogumTarihi=?,Meslek=? WHERE KisiID=?",con);
        da.UpdateCommand.Parameters.Add("prmKID",OleDbType.Integer,4,"KisiID");
        da.UpdateCommand.Parameters.Add("prmSoyad",OleDbType.VarChar,50,"Soyad");
        da.UpdateCommand.Parameters.Add("prmDogum",OleDbType.Date,8,"DogumTarihi");
        da.UpdateCommand.Parameters.Add("prmMeslek",OleDbType.VarChar,50,"Meslek");
        da.UpdateCommand.Parameters.Add("prmKisiID",OleDbType.Integer,4,"KisiID");

        da.DeleteCommand=new OleDbCommand("DELETE FROM Kisiler WHERE KisiID=?",con);
        da.DeleteCommand.Parameters.Add("prmKisiID",OleDbType.Integer,4,"KisiID");

        da.Update(dt); 
    }
    catch(Exception hata)
    {
        MessageBox.Show(hata.Message.ToString());
    }
}&lt;/pre&gt;
&lt;p&gt;Burada tanımladığımız komutlar i&amp;ccedil;in gerekli parametreleri oluştururken Parameters koleksiyonunun Add metodunun aşağıdaki prototipini kullandık.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public OleDbParameter Add(string parameterName,OleDbType oleDbType,int size, string sourceColumn);&lt;/pre&gt;
&lt;p&gt;Buradaki parametreleri kısaca a&amp;ccedil;ıklayacak olursak; ilk parametremiz, komutumuz i&amp;ccedil;in kullanacağımız parametre adı. İkinci parametremizde ise tablodaki alanımızın veri tipini belirliyoruz. Buradaki veri tipleri OleDbType t&amp;uuml;r&amp;uuml;ndendir. &amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; parametremizde ise alanın b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;n&amp;uuml; belirtiyoruz. Son parametremiz ise, sql komutu i&amp;ccedil;indeki bu parametrenin hangi alan i&amp;ccedil;in kullanılacağını belirtmektedir ve bu anlamı nedeniylede olduk&amp;ccedil;a &amp;ouml;nemlidir. Dikkat ederseniz OleDb sınıfında OleDbParameter t&amp;uuml;r&amp;uuml;ndeki parametreleri sql komutları i&amp;ccedil;inde ? ile belirttik. Bu nedenle, parametrelerimizi, ilgili sql komutu nesnesinin OleDbParameter koleksiyonuna eklerken ? sırasına g&amp;ouml;re tanımlamalıyız. Şimdi uygulamamızı &amp;ccedil;alıştıralım ve veriler &amp;uuml;zerinde aşağıdaki g&amp;ouml;r&amp;uuml;nen değişiklikleri yapalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk59_7.gif" alt="" width="504" height="240" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 7. Değişikliklerimiz yapılıyor.&lt;/p&gt;
&lt;p&gt;Şimdi G&amp;uuml;ncelle başlıklı butonumuza tıklayalım. Değişikliklerin tanımladığımız sql komutları yardımıyla veritabanınada yansıtıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk59_8.gif" alt="" width="497" height="92" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 8. Değişikliklerimiz veritabanına yansıtıldı.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde, OleDbDataAdapter sınıfına ait olayları incelemeye &amp;ccedil;alışacağız. Şimdilik g&amp;ouml;r&amp;uuml;şmek dileğiyle, hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-03-14 12:00:00</pubDate>
  <slug>OleDbDataAdapter-Sc4b1nc4b1fc4b1-ve-Update-Metodu-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>oledb</tag>
    <tag>oledbdataadapter</tag>
    <tag>data-adapter</tag>
    <tag>sql</tag>
    <tag>query</tag>
    <tag>update</tag>
    <tag>crud</tag>
    <tag>c#</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>