<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Oracle View' ları için Otomatik DataTable' lar Üretmek</title>
  <description>Üzerinde çalıştığımız ve uzun süredir canlı ortamda yaşamakta olan eski bir ürünümüz geçtiğimiz günlerde kod kalite taramalarından birisine girdi. Vaktinde her zaman olduğu gibi alel acele yazılmak zorunda olan kodlar bir kaç ana kategori altında çeşitli tipte ihlallere yakalandı. Bunlardan birisi de Strongly Typed DataSet kullanımına ilişkindi.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&amp;Uuml;zerinde &amp;ccedil;alıştığımız ve uzun s&amp;uuml;redir canlı ortamda yaşamakta olan eski bir &amp;uuml;r&amp;uuml;n&amp;uuml;m&amp;uuml;z ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde kod kalite taramalarından birisine girdi. Vaktinde her zaman olduğu gibi alel acele yazılmak zorunda olan kodlar&amp;nbsp;bir ka&amp;ccedil; ana kategori altında &amp;ccedil;eşitli tipte ihlallere yakalandı.&lt;em&gt;&amp;nbsp;&lt;/em&gt;Bunlardan birisi de &lt;strong&gt;Strongly Typed DataSet&lt;/strong&gt; kullanımına ilişkindi.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;l&amp;ccedil;&amp;uuml;mleme yapan aracın metriklerinden birisi&lt;strong&gt; Untyped DataSet&lt;/strong&gt; kullanımı kabul etmemekte. Bu y&amp;uuml;zden uygulama i&amp;ccedil;erisinde &lt;strong&gt;View&lt;/strong&gt;' lar i&amp;ccedil;in kullandığımız ne kadar &lt;strong&gt;DataTable&lt;/strong&gt; varsa ihlale girdi. &lt;strong&gt;.Net&lt;/strong&gt; tarafında kodlamaya yeni başlayanların sıklıkla d&amp;uuml;şebileceği bir hata olduğunu ifade edebilir aslında. &lt;strong&gt;Typed DataSet/DataTable&lt;/strong&gt;' ler kod yazımı sırasında &lt;strong&gt;tip g&amp;uuml;venliğini&lt;em&gt;(Type Safety)&lt;/em&gt;&lt;/strong&gt; de beraberinde getirdiğinden tercih edilmesi gereken sınıflar.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Typed DataSet/DataTable&lt;/strong&gt; &amp;uuml;retimi &lt;strong&gt;Visual Studio&lt;/strong&gt; ortamında &amp;ccedil;ok da zor değil. &lt;em&gt;(Hatta komut satırından da kolayca yapılabilir. &lt;a title="Generating Strongly Typed DataSet" href="https://msdn.microsoft.com/en-us/library/wha85tzb(v=vs.110).aspx" target="_blank"&gt;Şu adresten bilgi&lt;/a&gt; alabilirsiniz)&lt;/em&gt; Ancak yapılan &amp;uuml;retim sonrası bizim i&amp;ccedil;in &amp;ccedil;ok kalabalık kod par&amp;ccedil;aları oluştuğunu ifade etmek isterim. Oysaki tek ihtiyacımız olan &lt;strong&gt;View&lt;/strong&gt;' ların karşılığı olacak ve &lt;strong&gt;Lookup Table&lt;/strong&gt; gibi kullanılıp sadece veriyi g&amp;ouml;sterme ama&amp;ccedil;lı kullanılacak &lt;strong&gt;DataTable&lt;/strong&gt; tipleri idi. Araştırmalarımız sonucu aşağıdaki gibi bir yapının &lt;strong&gt;Typed DataTable&lt;/strong&gt; kullanımı i&amp;ccedil;in yeterli olduğunu g&amp;ouml;rd&amp;uuml;k.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;    public class ProductTable
        :DataTable
    {
        public DataColumn ID { get; set; }
        public DataColumn URUN_ADI { get; set; }
        public DataColumn URUN_FIYATI { get; set; }
    }&lt;/pre&gt;
&lt;p&gt;Dikkat edilmesi gereken ilk nokta &lt;strong&gt;ProductTable&lt;/strong&gt; tipinin &lt;strong&gt;DataTable&lt;/strong&gt; sınıfından t&amp;uuml;remiş olmasıdır. Diğer &amp;ouml;nemli bir nokta ise &amp;ouml;zelliklerin &lt;strong&gt;DataColumn&lt;/strong&gt; tipinden tanımlanmasıdır. &amp;Ouml;zellik adları aslında &lt;strong&gt;Oracle&lt;/strong&gt; tarafındaki nesnenin&lt;em&gt;(Table veya View olabilir)&lt;/em&gt; kolon adları ile birebir aynıdır.&lt;/p&gt;
&lt;p&gt;Tahmn edileceği &amp;uuml;zere bir sonraki adım &lt;strong&gt;Oracle View&lt;/strong&gt;' larının her biri i&amp;ccedil;in bu tip &lt;strong&gt;DataTable&lt;/strong&gt; t&amp;uuml;revli tipler &amp;uuml;retmekti. Ancak&lt;strong&gt; View&lt;/strong&gt;' ların sayısı olduk&amp;ccedil;a fazlaydı. Bu&amp;nbsp;sınıfları otomatik &amp;uuml;retecek bir kod par&amp;ccedil;ası geliştirmek &amp;ccedil;ok daha mantıklıydı. Dolayısıyla aşağıdaki gibi bir kod par&amp;ccedil;asını kullanamaya ve ilgili sınıfları otomatik olarak &amp;uuml;rettirmeye karar verdik. Unutmadan burada &lt;strong&gt;Oracle DataAccess Client&lt;/strong&gt;' ın - &lt;strong&gt;ODP.Net&lt;/strong&gt;' in &lt;strong&gt;4.0&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; kullandığımızı ifade edelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Oracle.DataAccess.Client;
using System.Configuration;
using System.IO;
using System.Text;

namespace GenerateDataTables
{
    class Program
    {
        static void Main(string[] args)
        {
            string conStr = ConfigurationManager.ConnectionStrings["ConStr"].ConnectionString;
            string rootPath = ConfigurationManager.AppSettings["RootPath"];
            string getUserViewsQuery = "select view_name from user_views";
            string getColumnNamesQuery = "SELECT column_name FROM user_tab_columns WHERE table_name = :table_name ORDER BY column_id";
            StringBuilder builder = new StringBuilder();

            OracleConnection conn = new OracleConnection(conStr);
            OracleCommand cmdGetViews = new OracleCommand(getUserViewsQuery, conn);
            OracleCommand cmdGetColumnNames = new OracleCommand(getColumnNamesQuery, conn);
            cmdGetColumnNames.Parameters.Add(":table_name", OracleDbType.Varchar2);

            conn.Open();
            OracleDataReader viewReader = cmdGetViews.ExecuteReader();
            while (viewReader.Read())
            {
                builder.AppendLine("using System.Data;\n");
                builder.AppendLine("namespace DBTables{\n");
                builder.AppendFormat("\tpublic partial class {0}DataTable \n\t: DataTable {{ \n", viewReader["view_name"].ToString());
                cmdGetColumnNames.Parameters[":table_name"].Value = viewReader["view_name"].ToString();
                OracleDataReader columnsReader = cmdGetColumnNames.ExecuteReader();
                while (columnsReader.Read())
                {
                    builder.AppendFormat("\t\tpublic DataColumn {0} {{get;set;}}\n", columnsReader["column_name"].ToString());
                }
                columnsReader.Close();
                builder.AppendFormat("\t}}\n");
                builder.AppendFormat("}}");
                File.WriteAllText(string.Format("{0}{1}.cs",rootPath,viewReader["view_name"].ToString()), builder.ToString());
                builder.Clear();
            }
            viewReader.Close();
            conn.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Kısaca kodda neler yaptığımıza bir bakalım dilerseniz. En &amp;ouml;nemli nokta kullandığımız iki &lt;strong&gt;select&lt;/strong&gt; sorgusu. İlk sorgumuz ile &lt;strong&gt;Connection String&lt;/strong&gt;' de&lt;em&gt;(app.config dosyasından alıyoruz)&lt;/em&gt; yer alan &lt;strong&gt;Oracle&lt;/strong&gt; şemasının erişim yetkisi dahilinde olan View' ları elde etmekteyiz. Bunun i&amp;ccedil;in &lt;strong&gt;user_views&lt;/strong&gt; nesnesi kullanılmakta. İkinci &lt;strong&gt;Select&lt;/strong&gt; sorgusu ise her bir &lt;strong&gt;View&lt;/strong&gt;' un kolon adlarını d&amp;ouml;nd&amp;uuml;rmekte. Bunun i&amp;ccedil;in de &lt;strong&gt;user_tab_columns&lt;/strong&gt; db nesnesine gidiyor ve parametre olarak view adını veriyoruz. B&amp;ouml;ylece &amp;uuml;retilecek &lt;strong&gt;DataTable&lt;/strong&gt; t&amp;uuml;revli sınıfların &amp;ouml;zelliklerini elde etmiş oluyoruz.&amp;nbsp;&lt;strong style="line-height: 1.8;"&gt;StringBuiler&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; sınıfından yararlanarak da&amp;nbsp;&lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;DataTable&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; t&amp;uuml;revli sınıfların i&amp;ccedil;eriğini yazdırmaktayız. Aynı, bir kod edit&amp;ouml;r&amp;uuml;nde C# sınıfı yazar gibi d&amp;uuml;ş&amp;uuml;nerek hareket etmemiz &amp;ouml;nemli. &amp;Ouml;rneğin kod dosyasının başında &lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;using System.Data&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; bildiriminin olması, &amp;ouml;zelliklerde &lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;System.Data.DataColumn&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; yerine &lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;DataColumn&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; kullanabilmemize olanak tanıyor.&amp;nbsp;&lt;/span&gt;Sonu&amp;ccedil; olarak &lt;strong&gt;Oracle&lt;/strong&gt; tarafındaki &lt;strong&gt;View&lt;/strong&gt;' lara karşılık gelecek basit &lt;strong&gt;DataTable&lt;/strong&gt; t&amp;uuml;revli tipleri oluşturmuş bulunuyoruz. Bu işlemlerin arından tek yaptığımız ilgili sınıfları ayrı bir sınıf k&amp;uuml;t&amp;uuml;phanesi altında toplamak oldu.&lt;/p&gt;
&lt;p&gt;Yine hatırlatmak gerekirse bu tipler veriyi Oracle tarafından &amp;ccedil;ektikten sonra tutmak ve aray&amp;uuml;zlerde g&amp;ouml;stermek amacıyla geliştirilmiş durumda. Normal şartlarda ara&amp;ccedil;lar ile &amp;uuml;retilen &lt;strong&gt;Typed DataSet/DataTable&lt;/strong&gt;' ler &amp;ccedil;ok daha fazla fonksiyonellik&lt;em&gt;(&amp;ouml;nreğin Insert, Update, Delete işlemleri i&amp;ccedil;in)&lt;/em&gt;&amp;nbsp;i&amp;ccedil;eriyor. Eğer bu fonksiyonellikere de ihtiya&amp;ccedil; varsa ilgili kod &amp;uuml;retim par&amp;ccedil;asını buna g&amp;ouml;re d&amp;uuml;zenlemekte yarar var. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-03-19 18:21:00</pubDate>
  <slug>oracle-view-lari-icin-otomatik-datatable-lar-uretmek</slug>
  <tags>
    <tag>oracle</tag>
    <tag>datatable</tag>
    <tag>c#</tag>
    <tag>net</tag>
    <tag>type-safety</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>