<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Temeller Kolay Unutulur (C# – Implicitly Name Hiding Sorunsalı)</title>
  <description>Özellikle C#, Java gibi nesne yönelimli(Object Oriented) programlama dillerinin temelleri son derece önemlidir ve bu temeller bir süre sonra profesyonel bir geliştirici için artık bisiklet sürmek gibi unutlmayacak unsurlara dönüşmelidir. İşte bu yazımızda kolayca unutulabilen bilinçsiz üye gizleme(Implicitly Name Hiding) ile alakalı bir vakayı ele almaya çalışıyor olacağız.</description>
  <content>&lt;p&gt;&lt;a href="/pics/blg214_Giris.jpg"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border-width: 0px;" title="blg214_Giris" src="/pics/blg214_Giris_thumb.jpg" alt="blg214_Giris" width="250" height="300" align="right" border="0" /&gt;&lt;/a&gt; Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Sizde benim gibi basketol tutkunu musunuz? Aslında &amp;uuml;lkemizde hemen herkesin birincil olarak futbol merakı olması beklenir. Oysaki bende diğer pek &amp;ccedil;ok arkadaşım gibi birincil olarak basketbol&amp;rsquo; a meraklıyımdır. Aslında lise yıllarında sevgili &lt;strong&gt;Michael Jordan&lt;/strong&gt; ve &lt;strong&gt;Chicago Bulls &lt;/strong&gt;ile başlayan bu merakım sonrasında &lt;strong&gt;Efes Pilsen, &amp;Uuml;lker, Tofaş &lt;/strong&gt;gibi takımlarla daha da artmıştır. &amp;Uuml;niversite yıllarından beri bu takımların pek &amp;ccedil;ok ma&amp;ccedil;ına gitmişimdir ve halen daha gitmeye &amp;ccedil;alışmaktayım&lt;em&gt;(Tabi bir d&amp;ouml;nem Tofaş profesyonel basketbol şubesini kapatmıştı&amp;hellip;)&lt;/em&gt; Tabi şu anda 11 aylık S(h)arp Efe buna pek m&amp;uuml;sade etmiyor. Ama yine de takım ayırt etmeksizin &amp;ouml;zellikle avrupa arenasındaki pek &amp;ccedil;ok ma&amp;ccedil;a gitmeye &amp;ccedil;alışıyorum.&lt;/p&gt;
&lt;p&gt;Basketbol denilince aklıma gelen en &amp;ouml;nemli şahsiyetler arasında ise değerli spiker &lt;strong&gt;Murat Murathanoğlu&lt;/strong&gt; ve değerli yorumcu &lt;strong&gt;İsmet Badem &lt;/strong&gt;ikilisi gelmektedir. Her ne kadar uzun bir s&amp;uuml;re &amp;ouml;nce yollarını ayırmış olsalar da, &amp;ouml;zellikle&lt;strong&gt; İsmet Badem&lt;/strong&gt;&amp;rsquo; in hemen her ma&amp;ccedil;ta gen&amp;ccedil;lere verdiği basketbol ip u&amp;ccedil;ları halen kullaklarımdadır. &amp;Ouml;zellikle basketbolun &lt;strong&gt;temellerinin(Fundamentals)&lt;/strong&gt; &amp;ccedil;ok &amp;ouml;nemli olduğunu gen&amp;ccedil; basketbolcu adaylara s&amp;uuml;rekli ifade etmiştir, etmektedir.&lt;/p&gt;
&lt;p&gt;Aslında bakarsanız temeller bir programlama dili i&amp;ccedil;in de son derece &amp;ouml;nemlidir. Profesyonel geliştiriciler, yazdıkları uygulamalarının &amp;ccedil;eşitliliği ve kullanılan ara&amp;ccedil;lar d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde zaman i&amp;ccedil;erisinde programlamanın temel kavramlarını kolayca unutabilir. Temellerin yer yer &lt;span style="text-decoration: underline;"&gt;tekrar edilmemesi&lt;/span&gt; veya zaman i&amp;ccedil;erisinde geriye d&amp;ouml;n&amp;uuml;p &lt;span style="text-decoration: underline;"&gt;bakılmaması&lt;/span&gt; bunun en b&amp;uuml;y&amp;uuml;k nedenlerindedir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle &lt;strong&gt;C#, Java&lt;/strong&gt; gibi &lt;strong&gt;nesne y&amp;ouml;nelimli(Object Oriented) &lt;/strong&gt;programlama dillerinin temelleri son derece &amp;ouml;nemlidir ve bu temeller bir s&amp;uuml;re sonra profesyonel bir geliştirici i&amp;ccedil;in artık bisiklet s&amp;uuml;rmek gibi unutlmayacak unsurlara d&amp;ouml;n&amp;uuml;şmelidir. İşte bu yazımızda kolayca unutulabilen &lt;strong&gt;bilin&amp;ccedil;siz &amp;uuml;ye gizleme(Implicitly Name Hiding)&lt;/strong&gt; ile alakalı bir vakayı ele almaya &amp;ccedil;alışıyor olacağız.&lt;/p&gt;
&lt;p&gt;Dilerseniz hi&amp;ccedil; vakit kaybetmeden sorunu &amp;ouml;rnek uygulama &amp;uuml;zerinden masaya yatırarak ilereleyelim. Bu ama&amp;ccedil;la aşağıdaki &lt;strong&gt;sınıf &amp;ccedil;izelgesindeki(Class Diagram)&lt;/strong&gt; tiplerin kullanıldığı bir Console uygulamasını geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg214_Case1ClassDiagram.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg214_Case1ClassDiagram" src="/pics/blg214_Case1ClassDiagram_thumb.gif" alt="blg214_Case1ClassDiagram" width="205" height="336" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace ImplicitHiding 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            #region Case 1

            // Bu vakaya g&amp;ouml;re her Dipose &amp;ccedil;ağrısı i&amp;ccedil;in FileManager tipine ait Dispose metodu i&amp;ccedil;eriğinin devreye gireceği d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmektedir.

            FileManager fm = new FileManager(); 
            StreamManager sm = fm; 
            IDisposable dm = fm;

            // FileManager &amp;ouml;rneğine ait Dispose metodunu &amp;ccedil;ağırmak i&amp;ccedil;in 3 yol olduğunu d&amp;uuml;ş&amp;uuml;nebiliriz. 
            // kendisi &amp;uuml;zerinden 
            fm.Dispose(); 
            // t&amp;uuml;rediği base class &amp;uuml;zerinden 
            sm.Dispose(); 
            // t&amp;uuml;rediği base class' ın implement ettiği Interface tipi &amp;uuml;zerinden 
            dm.Dispose();

            #endregion 
        } 
    }

    abstract class StreamManager 
        :IDisposable 
    { 
        #region IDisposable Members

        public void Dispose() 
        { 
            Console.WriteLine("Stream Manager i&amp;ccedil;in Dispose &amp;ccedil;ağrısı\n"); 
        }

        #endregion 
    }

    sealed class FileManager 
        : StreamManager 
    { 
        // Buradaki Warning mesajı geliştirici tarafından g&amp;ouml;z ardı edilmiş olabilir. Bazen sadece Build Succeeded mesajı yeterlidir. 
        public void Dispose() 
        { 
            Console.WriteLine("FileManager i&amp;ccedil;in Dispose &amp;ccedil;ağrısı"); 
            base.Dispose(); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Uygulamada &lt;strong&gt;StreamManager&lt;/strong&gt; isimli &lt;strong&gt;abstract&lt;/strong&gt; tipten olan &lt;strong&gt;sınıf(Class),&lt;/strong&gt; &lt;strong&gt;IDisposable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; implemente etmektedir. Biraz daha ilerlemeden &amp;ouml;nce buradaki bazı temelleri de hatırlamamızda yarar olacağı kanısındayım;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;abstract&lt;/strong&gt; tipler &amp;ouml;rneklenemezler ve &lt;strong&gt;&amp;ccedil;ok bi&amp;ccedil;imli(Polymorhic)&lt;/strong&gt; bir yapıya sahiptirler. Diğer yandan kendilerinden &lt;strong&gt;t&amp;uuml;reyen tipler(Derived Types)&lt;/strong&gt; i&amp;ccedil;in mutlaka uygulanması gereken &amp;uuml;yeleri i&amp;ccedil;erebilirler ki bunlarda &lt;strong&gt;abstract&lt;/strong&gt; olarak tanımlanırlar.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;IDisposable&lt;/strong&gt; bir &lt;strong&gt;aray&amp;uuml;z tipidir(Interface Type) &lt;/strong&gt;ve &lt;strong&gt;CLR&lt;/strong&gt; tarafında bellek y&amp;ouml;netimi ile ilişkili bildirim i&amp;ccedil;erir. &lt;strong&gt;Aray&amp;uuml;zler&lt;/strong&gt; sınıflar gibi işlevsel bloklara sahip &amp;uuml;yeler &lt;span style="text-decoration: underline;"&gt;i&amp;ccedil;eremezler&lt;/span&gt;. Sadece kendisini uygulayan tiplerin yapması zorunlu olan bildirimleri barındırırlar. &lt;strong&gt;Dispose&lt;/strong&gt; metodu &lt;strong&gt;IDisposable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n belirttiği zorunlu &amp;uuml;yelerden birisidir. Aray&amp;uuml;zlerde &amp;ccedil;ok bi&amp;ccedil;imli yapıya sahiptirler.&lt;/li&gt;
&lt;li&gt;&amp;Ccedil;ok bi&amp;ccedil;imlilik(Polymorphsym) aslında t&amp;uuml;reyen tiplere ait nesne &amp;ouml;rneklerinin, t&amp;uuml;redikleri tiplere ait değişkenler tarafından taşınmaları halinde ortaya &amp;ccedil;ıkan bir &amp;ouml;zelliktir. Burada &lt;strong&gt;&amp;uuml;st tipte(base type)&lt;/strong&gt; tanımlanıp, &lt;strong&gt;alt tipte(sub type)&lt;/strong&gt; ezilen &amp;uuml;yelerin b&amp;uuml;y&amp;uuml;k &amp;ouml;nemi vardır. Nitekim &amp;uuml;st tipe atanan bir alt tip nesne &amp;ouml;rneğinin ezilen &amp;uuml;yesi, &amp;uuml;st tip &amp;uuml;zerinden &amp;ccedil;ağırılabilmektedir. Bir başka deyişle &amp;uuml;st tipler yeri geldiklerinde alt tipler gibi davranış g&amp;ouml;sterebilmektedir. &amp;Ccedil;ok bi&amp;ccedil;imlilik adı da zaten buradan gelmektedir.&lt;/li&gt;
&lt;li&gt;Bir tipin &amp;ccedil;ok bi&amp;ccedil;imli yapıda olması &amp;ouml;zellikle&lt;strong&gt; Plug-In&lt;/strong&gt; tabanlı programlama da &amp;ouml;nemlidir. Nitekim &amp;uuml;st tipleri ve ezilebilen&lt;em&gt;(ezilmesi zorunlu olan)&lt;/em&gt; &amp;uuml;yeleri tanıyan bir sistemin genişletilmesinde, bu kurallara uyan tiplerin entegrasyonu s&amp;ouml;z konusudur.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;sealed&lt;/strong&gt; olarak tanımlanmış olan &lt;strong&gt;FileManager&lt;/strong&gt; tipi aslında kendisinden t&amp;uuml;retme &lt;span style="text-decoration: underline;"&gt;yapılamayan&lt;/span&gt; kısır bir sınıftır.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Dispose&lt;/strong&gt; metodları &amp;ccedil;oğunlukla tipe ait nesne &amp;ouml;rneklerinin &lt;strong&gt;Garbage Collector(GC)&lt;/strong&gt; tarafından toplandığı noktalarda devreye girmektedir. Dolayısıyla &lt;strong&gt;IDisposable&lt;/strong&gt; ile &lt;strong&gt;GC&amp;rsquo;&lt;/strong&gt; ye bir takım ek talimatlar yollanabilir ve &amp;ouml;zellikle &lt;strong&gt;unmanaged&lt;/strong&gt; tarafla ilişkili kaynak temizleme işlemleri bu metod &amp;uuml;zerinden icra edilir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bu temelleri hatırladıktan sonra vakamıza d&amp;ouml;nebiliriz. &lt;strong&gt;FileManager &lt;/strong&gt;sınıfı &lt;strong&gt;StreamManager&lt;/strong&gt; tipinden t&amp;uuml;retilmiştir. &lt;strong&gt;StreamManager&lt;/strong&gt; ise &lt;strong&gt;IDisposable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamaktadır. Dolayısıyla &lt;strong&gt;StreamManager&lt;/strong&gt; tipinin ezmesi gereken bir &lt;strong&gt;Dispose&lt;/strong&gt; metodu s&amp;ouml;z konusudur. Lakin kritik nokta &lt;strong&gt;FileManager&lt;/strong&gt; tipi i&amp;ccedil;erisinde de bir &lt;strong&gt;Dispose&lt;/strong&gt; metodunun yazılmış olmasıdır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisindeki kod bloğuna bakıldığında &lt;strong&gt;FileManager&lt;/strong&gt; tipinin &amp;ouml;rneklenip&lt;em&gt;(fm isimli değişken)&lt;/em&gt;&amp;nbsp;&lt;strong&gt;StreamManager&lt;/strong&gt; tipinden bir değişkene atandığı g&amp;ouml;r&amp;uuml;lmektedir. Diğer yandan &lt;strong&gt;IDisposable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;ne ait bir değişkene de aynı &amp;ouml;rnek atanmıştır. Her ne kadar &lt;strong&gt;StreamManager&lt;/strong&gt; ve &lt;strong&gt;IDisposable, &lt;/strong&gt;&amp;ouml;rneklenemeyen tipler olsalar da bu, değişken olarak tanımlanamayacakları anlamına gelmemelidir.&lt;/p&gt;
&lt;p&gt;Bunlara ek olarak &lt;strong&gt;IDisposable&lt;/strong&gt; ve &lt;strong&gt;StreamManager&amp;rsquo;&lt;/strong&gt; ın &amp;ccedil;ok bi&amp;ccedil;imli tipler oldukları da ortadadır. Dolayısıyla &lt;strong&gt;sm&lt;/strong&gt; ve &lt;strong&gt;dm &lt;/strong&gt;değişkenleri &amp;uuml;zerinden &amp;ccedil;ağırılan &lt;strong&gt;Dispose&lt;/strong&gt; metodlarının, &lt;strong&gt;polimorfizim(&amp;Ccedil;ok bi&amp;ccedil;imlilik)&lt;/strong&gt; nedeni ile aslında taşınmakta olan &lt;strong&gt;fm&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt;Dispose&lt;/strong&gt; fonksiyonuna doğru olması d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. &amp;Ouml;yleyse uygulamanın &amp;ccedil;alışma zamanındaki &amp;ccedil;ıktısına bir bakalım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg214_Case1Runtime.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg214_Case1Runtime" src="/pics/blg214_Case1Runtime_thumb.gif" alt="blg214_Case1Runtime" width="325" height="143" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;fm&lt;/strong&gt; nesne &amp;ouml;rneği &amp;uuml;zerinden yapılan &amp;ccedil;ağrıda &lt;strong&gt;FileManager&lt;/strong&gt; tipine ait &lt;strong&gt;Dispose&lt;/strong&gt; metodu y&amp;uuml;r&amp;uuml;t&amp;uuml;lm&amp;uuml;şt&amp;uuml;r. Ancak&lt;strong&gt; base class&lt;/strong&gt; ve uygulanan &lt;strong&gt;IDisposable&lt;/strong&gt; aray&amp;uuml;zleri &amp;uuml;zerinden yapılan &lt;strong&gt;Dispose&lt;/strong&gt; &amp;ccedil;ağrılarında bu b&amp;ouml;yle olmamıştır. Her iki &amp;ccedil;ağrıda da &lt;strong&gt;sub class&lt;/strong&gt; olan &lt;strong&gt;FileManager&lt;/strong&gt; tipine ait &lt;strong&gt;Dispose&lt;/strong&gt; metodu yerine &lt;strong&gt;StreamManager&lt;/strong&gt; tipinin &lt;strong&gt;Dispose&lt;/strong&gt; metodunun icra edildiği g&amp;ouml;r&amp;uuml;lmektedir. Acaba ger&amp;ccedil;ekten b&amp;ouml;yle midir? &lt;strong&gt;Debug&lt;/strong&gt; noktalarını koyarak ilerlediğimizde b&amp;ouml;yle olduğu ispat edilebilir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;StreamManager&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;Dispose&lt;/strong&gt; &amp;ccedil;ağrısı yapıldığında &lt;em&gt;(sm.Dispose(); satırı)&lt;/em&gt; kod, &lt;strong&gt;StreamManager sm=fm&lt;/strong&gt; atamasına rağmen &lt;strong&gt;FileManager&lt;/strong&gt; tipinin &lt;strong&gt;Dispose&lt;/strong&gt; metoduna &lt;span style="text-decoration: underline;"&gt;uğramamaktadır&lt;/span&gt;.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;IDisposable&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;Dispose&lt;/strong&gt; &amp;ccedil;ağrısında &lt;em&gt;(dm.Dispose(); )&lt;/em&gt; kod &lt;strong&gt;IDisposable dm=fm&lt;/strong&gt;; atamasına rağmen &lt;strong&gt;FileManager&lt;/strong&gt; tipinin &lt;strong&gt;Dispose&lt;/strong&gt; metoduna uğramamış ve yine &lt;strong&gt;StreamManager &lt;/strong&gt;tipinin &lt;strong&gt;Dispose &lt;/strong&gt;metodu &amp;ccedil;ağırılmıştır ki sanırım en ilgin&amp;ccedil; olanı da budur.&lt;/p&gt;
&lt;p&gt;Peki bu durumların oluşmasının sebebi nedir? Aslında sorun bilin&amp;ccedil;siz olarak yapılan &amp;uuml;ye gizleme&lt;strong&gt; (Implicitly Name Hiding) &lt;/strong&gt;operasyonundan kaynaklanmaktadır. Nitekim şu anda &lt;strong&gt;FileManager&lt;/strong&gt; i&amp;ccedil;erisinde, &amp;uuml;st tipteki ile aynı isimde olan bir metod tanımı s&amp;ouml;z konusudur ve &amp;ccedil;alışma zamanı bu kullanımı g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;nde varsayılan olarak &amp;uuml;st tipe ait &amp;uuml;yeleri &amp;ccedil;ağırmaktadır. Bir başka deyişle &amp;uuml;st tip &amp;uuml;yesi alt tipi gizlemektedir. Ger&amp;ccedil;i bilin&amp;ccedil;siz bir şekilde &amp;uuml;ye gizleme yapıldığı pek doğru değildir. Nitekim &lt;strong&gt;Visual Studio IDE&amp;rsquo;&lt;/strong&gt; si geliştiriciyi bu noktada aşağıdaki gibi uyarmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg214_IDE.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg214_IDE" src="/pics/blg214_IDE_thumb.gif" alt="blg214_IDE" width="443" height="217" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Ancak dikkatsiz bir geliştirici &amp;ccedil;ok kalabalık bir projede bu tip bir &lt;strong&gt;warning&lt;/strong&gt; mesajını kolayca g&amp;ouml;zden ka&amp;ccedil;ırabilir. Aslında &amp;ccedil;oğu zaman geliştirici i&amp;ccedil;in projenin başarılı bir şekilde derlenmesi yeterli olmaktadır. Tabi &lt;strong&gt;ReSharper&lt;/strong&gt; gibi ara&amp;ccedil;ları kullanmıyorsak ya da&lt;strong&gt; TFS(Team Foundation Server)&lt;/strong&gt; altında geliştirme yapıp &lt;strong&gt;Policy&amp;rsquo; &lt;/strong&gt;ler uygulayarak &lt;strong&gt;Warning&amp;rsquo;&lt;/strong&gt; ler aşılmadan kodun derlenmesini engellemiyorsak bu tip g&amp;ouml;zden ka&amp;ccedil;ırmaların sayısı artacaktır.&lt;/p&gt;
&lt;p&gt;Peki bu temeli bilen bir geliştirici sorun haline gelen vakaya d&amp;uuml;şmemek i&amp;ccedil;in ne yapmalıdır?&lt;/p&gt;
&lt;p&gt;İlk akla gelen y&amp;ouml;ntem &lt;strong&gt;&amp;uuml;st sınıf(base class)&lt;/strong&gt; i&amp;ccedil;erisinde tanımlı olan ve &lt;strong&gt;IDisposable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; &amp;uuml;zerinden gelen &lt;strong&gt;Dispose&lt;/strong&gt; metodunun virtual olarak tanımlanmasıdır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;abstract class StreamManager 
        :IDisposable 
{ 
	#region IDisposable Members

	public virtual void Dispose() 
	{ 
		Console.WriteLine("Stream Manager i&amp;ccedil;in Dispose &amp;ccedil;ağrısı\n"); 
	}

	#endregion 
}&lt;/pre&gt;
&lt;p&gt;Ancak virtual olarak yapılan tanımlama da yeterli değildir. Halen daha&lt;strong&gt; base class'&lt;/strong&gt; ta yer alan aynı isimli &lt;strong&gt;Dispose&lt;/strong&gt; metodunun alt tiptekini gizlemesi durumu devam etmektedir. Dolayısıyla &amp;ccedil;alışma zamanındaki durum değişmeyecek ve aşağıdaki &amp;ccedil;ıktı alınmaya devam edecektir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg214_VirtualRuntime.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg214_VirtualRuntime" src="/pics/blg214_VirtualRuntime_thumb.gif" alt="blg214_VirtualRuntime" width="306" height="140" border="0" /&gt;&lt;/a&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Abstract&lt;/strong&gt; bir &amp;uuml;ye olarak &lt;strong&gt;Dispose&lt;/strong&gt; metodunun tanımlanması da d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir ancak &amp;uuml;zerinde &amp;ccedil;alıştığımız senaryo da ge&amp;ccedil;erli bir kullanım değildir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/Exclamation_4.gif"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border-width: 0px;" title="Exclamation" src="/pics/Exclamation_thumb_4.gif" alt="Exclamation" width="48" height="48" align="left" border="0" /&gt;&lt;/a&gt;Bilindiği &amp;uuml;zere &lt;strong&gt;abstract&lt;/strong&gt; &amp;uuml;yeler herhangibir şekilde kod bloğu i&amp;ccedil;ermezler ve t&amp;uuml;reyen tipler i&amp;ccedil;erisinde mutlaka &lt;strong&gt;ezilmek(override)&lt;/strong&gt; zorundadırlar.&lt;/p&gt;
&lt;p&gt;Aslında &amp;uuml;st sınıfın &amp;uuml;ye gizleme işlemini yapması istenmiyorsa yapılması gereken yol alt tip i&amp;ccedil;erisindeki ezme(override) işleminin a&amp;ccedil;ık bir şekilde ger&amp;ccedil;ekleştirilmesidir. S&amp;ouml;z gelimi &lt;strong&gt;virtual&lt;/strong&gt; kullanımı s&amp;ouml;z konusu ise kodun aşağıdaki şekilde d&amp;uuml;zenlenmesi yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;abstract class StreamManager 
	:IDisposable 
{ 
	#region IDisposable Members

	public virtual void Dispose() 
	{ 
		Console.WriteLine("Stream Manager i&amp;ccedil;in Dispose &amp;ccedil;ağrısı\n"); 
	}

	#endregion 
}

sealed class FileManager 
	: StreamManager 
{ 
	public override void Dispose() 
	{ 
		Console.WriteLine("FileManager i&amp;ccedil;in Dispose &amp;ccedil;ağrısı"); 
		base.Dispose(); 
	} 
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;FileManager&lt;/strong&gt; tipi i&amp;ccedil;erisinde yer alan &lt;strong&gt;Dispose&lt;/strong&gt; metodu &lt;strong&gt;override&lt;/strong&gt; bildirimi ile tanımlanmıştır. Yani a&amp;ccedil;ık bir şekilde &amp;uuml;st tipten gelen &lt;strong&gt;Dispose&lt;/strong&gt; metodunun ezilmesi ve yerine bu fonksiyon g&amp;ouml;vdesinin &amp;ccedil;ağırılması gerektiği belirtilmiştir. Bu durumda &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı tam da istediğimiz gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg214_OverrideRuntime.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg214_OverrideRuntime" src="/pics/blg214_OverrideRuntime_thumb.gif" alt="blg214_OverrideRuntime" width="304" height="162" border="0" /&gt;&lt;/a&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Tabi şu durumda &lt;span style="text-decoration: underline;"&gt;unutulmamalıdır&lt;/span&gt;. Ger&amp;ccedil;ekten bilin&amp;ccedil;li bir şekilde&lt;strong&gt; &amp;uuml;ye gizleme(Name Hiding)&lt;/strong&gt; işleminin yapılması gerekiyorsa, &lt;strong&gt;new &lt;/strong&gt;operat&amp;ouml;r&amp;uuml;n&amp;uuml;n kullanılması gerekmektedir. Aşağıdaki kod par&amp;ccedil;asında olduğu gibi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;sealed class FileManager 
        : StreamManager 
{ 
	public new void Dispose() 
	{ 
		Console.WriteLine("FileManager i&amp;ccedil;in Dispose &amp;ccedil;ağrısı"); 
		base.Dispose(); 
	} 
}&lt;/pre&gt;
&lt;p&gt;Elbette bu durumda &amp;uuml;st tipte yer alan &lt;strong&gt;Dispose&lt;/strong&gt; metodunun &lt;strong&gt;virtual&lt;/strong&gt; olmasına da gerek yoktur. &lt;strong&gt;new&lt;/strong&gt; operat&amp;ouml;r&amp;uuml;n&amp;uuml;n kullanılması, bir anlamda geliştiricinin de ne yaptığının farkında olması demektir. Yazımızda değerlendirdiğimiz bu &amp;ouml;rnek vakanın aslında kulağımıza bir c&amp;uuml;mleyi k&amp;uuml;pe yaptığı da ger&amp;ccedil;ektir: &lt;strong&gt;&amp;ldquo;Siz siz olun Warning mesajlarını dikkate alın&amp;rdquo;&lt;/strong&gt; B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan &amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f7%2fImplicitHiding.rar"&gt;ImplicitHiding.rar (22,03 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2011-02-06 15:50:00</pubDate>
  <slug>Temeller-Kolay-Unutulur-(CSharp-Implicitly-Name-Hiding-Sorunsali)</slug>
  <tags>
    <tag>c#</tag>
    <tag>object-oriented-programming</tag>
    <tag>oop</tag>
    <tag>c#-temelleri</tag>
    <tag>polymorhysm</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>