<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Rust, WASM, Web Api ve Can-Ban Board !</title>
  <description>Bu videoda Rust programlama dilini kullanarak geliştirdiğim basit Kanban Board uygulamasının arka planını anlatıyorum. Uygulamanın önyüz tarafında biraz HTML, Javascript, Bootstrap ve Rust ile derlenmiş Wasm paketi kullanılırken, arka planda yine Rust ile yazılmış Rest tabanlı bir Web Api yer alıyor. Günümüzdeki birçok uygulama senaryosunda benzer yaklaşımlar söz konusu. Web tabanlı önyüzler, asıl iş fonksiyonellikleri için backend taraftaki servislere Rest tarzı stiller ile ulaşıyorlar. Hatta benzer senaryo .Net dünyasında Blazor ile de icra edilmekte. Uygulama aynı anda en fazla 5 görev ile çalışılmasına izin veriyor. Bu durumda yeni bir tane eklemek için ya tamamlananları arşive göndermek ya da diğerlerinden feragat etmek lazım...</description>
  <content>&lt;p&gt;Rust &amp;ccedil;oğunlukla bir sistem programlama dili olarak &amp;ouml;ne &amp;ccedil;ıkıyor. Ancak &lt;a href="https://crates.io" target="_blank"&gt;geniş k&amp;uuml;t&amp;uuml;phane&lt;/a&gt;&amp;nbsp;desteği sayesinde bildiğimiz iş modellerinin uygulanabildiği t&amp;uuml;rden bir&amp;ccedil;ok program da geliştirebiliyoruz. Bende hem rust kodlama pratiklerimi artırmak hem de basit ger&amp;ccedil;ek hayat senaryolarını u&amp;ccedil;tan uca ele alabilmek adına bu tip bir uygulama geliştirmeye &amp;ccedil;alıştım. Sonrasında kamera arkasına ge&amp;ccedil;tim.&lt;/p&gt;
&lt;p&gt;Bu &lt;a href="https://youtu.be/a6KVjYGon1c" target="_blank"&gt;youtube videosunda&lt;/a&gt; Rust programlama dilini kullanarak geliştirdiğim basit Kanban Board uygulamasının arka planında neler olup bittiğini anlatmaya &amp;ccedil;alışıyorum. Uygulamanın &amp;ouml;ny&amp;uuml;z tarafında biraz HTML, Javascript, Bootstrap ve Rust ile derlenmiş WASM paketi kullanılırken, arka planda yine Rust ile yazılmış REST tabanlı bir Web Api yer alıyor. G&amp;uuml;n&amp;uuml;m&amp;uuml;zdeki bir&amp;ccedil;ok uygulama senaryosunda benzer yaklaşımların s&amp;ouml;z konusu olduğunu ifade edebilirim. Web tabanlı &amp;ouml;ny&amp;uuml;zler, asıl iş fonksiyonellikleri i&amp;ccedil;in backend taraftaki servislere HTTP protokol&amp;uuml;n&amp;uuml;n Post, Get, Put, Delete, Patch gibi metotları ile ulaşarak kendi gereksinimlerini karşılıyorlar. Hatta benzer senaryo .Net cephesinde Blazor ile de icra edilmekte.&lt;/p&gt;
&lt;p&gt;&lt;iframe title="YouTube video player" src="https://www.youtube.com/embed/a6KVjYGon1c?si=I62XDd1SUpWnfWBM" width="560" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;Uygulama kullanıcısının aynı anda en fazla beş g&amp;ouml;rev ile &amp;ccedil;alışılmasına izin veriyor. Bu durumda yeni bir tane eklemek i&amp;ccedil;in ya tamamlananları arşive g&amp;ouml;ndermek ya da diğerlerinden feragat etmek lazım. Elbette bir&amp;ccedil;ok yeni &amp;ouml;zellik eklenebilir, kod tekrardan g&amp;ouml;zden ge&amp;ccedil;irilip iyileştirilebilir.&amp;nbsp; Anlatımda yer alan uygulamanın program kodlarına &lt;a href="https://github.com/buraksenyurt/can-ban-board" target="_blank"&gt;github reposundan&lt;/a&gt; bakabilirsiniz. Readme dosyasında WASM derleme işlemleri ile programın nasıl &amp;ccedil;alıştığına dair detaylı bilgiler de yer alıyor. Bir başka &amp;ccedil;alışmada g&amp;ouml;r&amp;uuml;şmek dileğiyle, hepinize mutlu g&amp;uuml;nler.&lt;/p&gt;</content>
  <pubDate>2024-05-24 08:49:00</pubDate>
  <slug>rust-wasm-web-api-ve-can-ban-board</slug>
  <tags>
    <tag>rust</tag>
    <tag>web-api</tag>
    <tag>rust-lang</tag>
    <tag>wasm</tag>
    <tag>web-assembly</tag>
    <tag>html</tag>
    <tag>bootstrap</tag>
    <tag>javascript</tag>
  </tags>
  <categories>
    <category>Rust</category>
  </categories>
</post>