<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>GoLang - Ticker ile Periyodik İş Çalıştırma</title>
  <description>GO dilinin en güçlü yanlarından birisi eş zamanlı programlama(Concurrent Programming) kabiliyetlerinde sunduğu performans ve kullanım kolaylıkları. Daha önceden şu yazıda Concurrency konusunu GoRoutine ve Channel kavramları üzerinden incelemeye çalışmıştım. Çalıştığım kaynaklarda ilerledikçe eş zamanlı programlama konusunda yeni şeyler de öğrendim. Bunlardan birisi time paketinden yer alan time tipi. Bu tipin NewTimer ve NewTicker isimli iki önemli fonksiyonu bulunuyor.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/05/gotimer_4.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;GO dilinin en g&amp;uuml;&amp;ccedil;l&amp;uuml; yanlarından birisi eş zamanlı programlama(Concurrent Programming) kabiliyetleri sayesinde sunduğu performans ve kullanım kolaylıkları. Daha &amp;ouml;nceden &lt;a href="/post/GoLang-Concurrency-goroutine-channel" target="_blank"&gt;şu yazıda&lt;/a&gt; Concurrency konusunu GoRoutine ve Channel kavramları &amp;uuml;zerinden incelemiştim. &amp;Ccedil;alıştığım kaynaklarda ilerledik&amp;ccedil;e eş zamanlı programlama konusunda yeni şeyler de &amp;ouml;ğrendim. Bunlardan birisi de time tipi. Bu tipin NewTimer ve NewTicker isimli iki &amp;ouml;nemli fonksiyonu bulunuyor. Doğruyu s&amp;ouml;ylemek gerekirse NewTimer ile yapacağımız işlemleri time.Sleep kullanımı ile de sağlamamız m&amp;uuml;mk&amp;uuml;n. Bu nedenle NewTimer'ı daha &amp;ccedil;ok bir GoRoutine'in beklenen s&amp;uuml;rede işini yapmasını beklediğimiz, aksi hallerde ise zaman aşımı halini ele alacağımız durumlarda kullanmanın&amp;nbsp;&amp;ccedil;ok daha mantıklı olduğunu &amp;ouml;ğrendim. Diğer yandan NewTicker fonksiyonu daha &amp;ccedil;ok dikkatimi &amp;ccedil;ekti. Bu fonksiyon ile belirli periyotlar boyunca tekrar etmesini istediğimiz eş zamanlı g&amp;ouml;revler planlayabiliriz. Konuyu anlamaya &amp;ccedil;alışırken &amp;ouml;nce teorik bir &amp;ouml;rnek ile ilerlemeye &amp;ccedil;alıştım. Ardından daha pratik bir &amp;ouml;rnek geliştirdim. İlk GO kodlarımızı aşağıdaki gibi geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	"time"
)

func main() {
	timer := time.NewTimer(time.Second * 4)

	fmt.Println("timer nesnesi tanımlandı. Kod akışına devam ediyor.")
	fmt.Println(time.Now())
	now := &amp;lt;-timer.C //C ile timer'ın NewTimer'a parametre olarak gelen s&amp;uuml;re sonrasındaki zaman elde edilir
	fmt.Println("Timer ile belirtilen s&amp;uuml;re doldu.")
	fmt.Println(now)

	// Bu seferki Timer, s&amp;uuml;resi dolduğu i&amp;ccedil;in Expire durumuna d&amp;uuml;şecek
	// Bir Timer'ı expire olmadan &amp;ouml;nce durdurmak istediğimiz senaryolarda ele alabiliriz
	timer = time.NewTimer(time.Second)
	go func() {
		&amp;lt;-timer.C
		fmt.Println("İkinci timer s&amp;uuml;resi ge&amp;ccedil;ti") // time.Second nedeniyle func i&amp;ccedil;erisinde timer.C yakalanamadan Stop metoduna d&amp;uuml;ş&amp;uuml;l&amp;uuml;r
	}()
	stop := timer.Stop()
	if stop {
		fmt.Println("Timer durduruldu")
	}

	// ticker ile zamanlanmış g&amp;ouml;revler hazırlayabiliriz.
	tickTime := time.NewTicker(time.Second * 2) // iki saniyede bir zaman d&amp;ouml;nd&amp;uuml;recek Ticker tanımlandı
	go func() {
		fmt.Println("İş yapıyorum...")
		for t := range tickTime.C { // C ile yukarıdaki tickTime'ın o anki s&amp;uuml;resi ele yakalandı
			fmt.Println(t)
		}
	}()
	//time.Sleep(time.Second * 12) // main thread 12 saniye duracak. Bu s&amp;uuml;re boyunca 2 saniyede bir for t:=range bloğu &amp;ccedil;alışacaktır
	//tickTime.Stop()              //Ticker durduruldu

	// Yukarıdaki kullanımdan farklı olarak şimdi kullanıcı Enter tuşuna basana kadar for t:=range bloğu &amp;ccedil;alışacaktır
	var enter string
	fmt.Println("&amp;Ccedil;ıkmak i&amp;ccedil;in Enter tuşuna basınız")
	fmt.Scanln(&amp;amp;enter)
	tickTime.Stop()
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncelikle kodun &amp;ccedil;alışma zamanı &amp;ccedil;ıktısına bir bakalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/05/gotimer_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek kod par&amp;ccedil;asında iki NewTimer ve bir NewTicker &amp;ouml;rneği yer alıyor. main, 4 saniye sonrası i&amp;ccedil;in kurulan bir timer tanımlaması ile başlıyor. Bu tanımlama sonrası kod akışına devam edecek ve now değişkenine C ile bir bilgi ge&amp;ccedil;ilecektir. Aslında burada bir kanal&lt;em&gt;(Channel)&lt;/em&gt; &amp;uuml;zerinden o anki zamanın d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi işlemi ger&amp;ccedil;ekleşmektedir. Tahmin edileceği &amp;uuml;zere kod bu satıra gelinceye kadar bekler. Yani 4 saniyelik bir bekleme oluşur&lt;em&gt;(Az &amp;ouml;ncede belirttiğim gibi bu noktada time.Sleep metodundan da yararlanılabildiği belirtiliyor)&lt;/em&gt; timer'ı tekrar oluşturduğumuz kod satırında ise bir saniye sonrası&amp;nbsp;i&amp;ccedil;in&amp;nbsp;planlama yapılmıştır. Hemen ardından bir GoRoutine başlatıldığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r. Bu fonksiyon i&amp;ccedil;erisinde &amp;lt;-timer.C satırı ile kanaldan gelecek bilgi beklenmektedir. Ancak GoRoutine hemen &amp;ccedil;alıştığından kod bir sonraki ifadeye ge&amp;ccedil;ecek ve timer i&amp;ccedil;in Stop metodu devreye girecektir. İşte bu noktada GoRoutine i&amp;ccedil;in bir zaman aşımı senaryosu işletilmiş olur. Lakin Stop &amp;ccedil;ağrısına gelinmeden &amp;ouml;nce NewTimer ile a&amp;ccedil;ılan s&amp;uuml;reden daha uzun s&amp;uuml;ren işlemler s&amp;ouml;z konusu olursa, GoRoutine işleyişini de tamamlayabilecektir.&lt;/p&gt;
&lt;p&gt;Kodun son par&amp;ccedil;asında bir ticker &amp;uuml;retilmektedir. NewTicker metodu ile oluşturulan tickTime, 2 saniyelik periyotları ifade eder. Hemen ardından gelen GoRoutine i&amp;ccedil;erisinde ise C &amp;uuml;zerinden yakalanan kanal i&amp;ccedil;eriğinin bir takibi yapılır. Takip i&amp;ccedil;in for d&amp;ouml;ng&amp;uuml;s&amp;uuml; ve range ifadesinden yararlanılır. Her iki saniyede bir kanala o anki zaman bilgisi d&amp;uuml;şeceğinden bu bir range &amp;uuml;zerinden for d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile yakalanabilir. Kullanıcı ekrandan enter tuşuna basana kadar 2 saniyelik zaman dilimlerinde for bloğunun i&amp;ccedil;erisindeki kod par&amp;ccedil;ası devreye girecektir. Tabii s&amp;ouml;z konusu işlemlerin bir s&amp;uuml;re sonra tamamlanmasını da sağlayabiliriz. Bunun i&amp;ccedil;in yorum satırı yapılmış olan kısma dikkat edelim. Yorum satırları a&amp;ccedil;ıldığı takdirde 12 saniye sonrasında periyodik olarak devam eden işlemler duraksatılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/05/gotimer_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sonra durdum ve daha akılda kalıcı bir periyodik kod par&amp;ccedil;ası yazabilir miyim diye d&amp;uuml;ş&amp;uuml;nmeye başladım. Aklıma belirli bir klas&amp;ouml;r&amp;uuml;n i&amp;ccedil;erisindeki dosya değişikliklerini belirli zaman aralıklarında izleyecek bir &amp;ouml;rnek geldi&lt;em&gt;(Bir nevi .Net d&amp;uuml;nyasından aşina olduğumuz FileSystemWatcher'ın ilkel bir halini geliştirmek istedim diyebiliriz)&lt;/em&gt; Amacım belirli zaman aralıklarında C:\Reports isimli klas&amp;ouml;rdeki dosya i&amp;ccedil;eriklerini terminale bastırmaktı. Bunun i&amp;ccedil;in komut satırından y&amp;uuml;r&amp;uuml;yecek bir go programı yazabilir, i&amp;ccedil;erisinde eş zamanlı olarak belirli periyotlarda tetiklenecek bir GoRoutine oluşturabilirdim. &amp;Ouml;ğrenmem gereken bir başka şey de bir klas&amp;ouml;r i&amp;ccedil;erisindeki dosyaları nasıl ele alabileceğimdi. Biraz araştırma sonrası aşağıdaki kod par&amp;ccedil;ası ortaya &amp;ccedil;ıktı.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	"os"
	"path/filepath"
	"time"
)

func main() {
	var pathName string = "C:\\Reports"
	ticker := time.NewTicker(time.Second * 10)
	go func() {
		for t := range ticker.C {
			fmt.Printf("Time : %s\n", t)
			getFileList(pathName)
		}
	}()

	var enter string
	fmt.Println("Press Enter for Exit")
	fmt.Scanln(&amp;amp;enter)
	ticker.Stop()
}

func getFileList(pathName string) {
	fmt.Println("___", pathName, "___")
	filepath.Walk(pathName,
		func(path string, fileInfo os.FileInfo, err error) error {
			if !fileInfo.IsDir() {
				fmt.Printf("\t%s\t%d bytes\n", fileInfo.Name(), fileInfo.Size())
			}
			return nil
		})
	fmt.Println("____________________________________")
}&lt;/pre&gt;
&lt;p&gt;Kod 10 saniyede bir &amp;ccedil;alışacak bir Ticker tanımlaması ile başlıyor. Sonrasında gelen GoRoutine i&amp;ccedil;erisinde ise for d&amp;ouml;ng&amp;uuml;m&amp;uuml;z&amp;uuml; kurguluyoruz. C kanalı &amp;uuml;zerinden gelen zaman bilgisini ekrana basıyor ve getFileList isimli fonksiyonu &amp;ccedil;ağırıyoruz. Bu d&amp;ouml;ng&amp;uuml; 10 saniyede bir &amp;ccedil;alışacak ve her seferinde getFileList fonksiyonu &amp;ccedil;ağırılacak. Fonksiyon parametre olarak gelen klas&amp;ouml;rdeki dosyaları alabilmek i&amp;ccedil;in filePath tipinin Walk metodunu kullanıyor. İlk parametre klas&amp;ouml;r adı ama ikinci parametre biraz daha değişik. Burada WalkFunc fonksiyon tipinden bir fonksiyon bildirimi yer alıyor. Aslında klas&amp;ouml;r i&amp;ccedil;erisinde y&amp;uuml;r&amp;uuml;rken her bir klas&amp;ouml;r veya dosya i&amp;ccedil;in ikinci parametre ile gelen fonksiyon bloğu &amp;ccedil;ağırılmakta. Bu fonksiyon &amp;uuml;&amp;ccedil; parametre almakta. &amp;Uuml;zerinde &amp;ccedil;alışılan klas&amp;ouml;r, o anki &amp;ouml;ğe&lt;em&gt;(dosya veya klas&amp;ouml;r gibi)&lt;/em&gt; ve varsa hata mesajı. Geriye ise bir error nesnesi d&amp;ouml;nd&amp;uuml;rmekte&lt;em&gt;(return nil satırının konulma sebebi de aslında bir hata olmayacağını d&amp;uuml;ş&amp;uuml;nmem)&lt;/em&gt; Walk t&amp;uuml;m klas&amp;ouml;r ve dosyaları dolaştığından ve senaryo gereği bana sadece dosyalar gerektiğinden IsDir &amp;ccedil;ağrısı ile o anki &amp;ouml;ğenin ne olduğuna bakıyorum. Eğer klas&amp;ouml;r değilse dosya olduğuna karar verip ekrana o dosya ile ilgili bilgiler bastırıyorum&lt;em&gt;(Dosya adı ve byte olarak boyutu şimdilik yeterli)&lt;/em&gt;&amp;nbsp;Program kullanıcı enter tuşuna basana kadar &amp;ccedil;alışıyor. Denemeler sırasında C:\Reports altına bir ka&amp;ccedil; dosya attım, silme işlemi ger&amp;ccedil;ekleştirdim. Sonu&amp;ccedil;lar aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer oldu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/05/gotimer_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu &amp;ouml;rnekle NewTicker ve time paketinin kullanımı kafamda biraz daha anlamlı bir yer edindi diyebilirim. Bazı konuları &amp;ouml;ğrenmeye &amp;ccedil;alışırken ger&amp;ccedil;ek hayat &amp;ouml;rneklerini kullanmak &amp;ccedil;ok ama &amp;ccedil;ok faydalı. Senaryo daha da zenginleştirilebilir. S&amp;ouml;z gelimi bir klas&amp;ouml;rdeki dosya değişimleri g&amp;ouml;zlemlenebilir ve loglama ama&amp;ccedil;lı bir işlevsellik sağlanabilir. Aynı stratejiyi kullanarak belirli zaman aralıklarında ger&amp;ccedil;ekleşmesini istediğimiz işlemler i&amp;ccedil;in planlamaları basit&amp;ccedil;e yapabiliriz. B&amp;ouml;ylece geldik bir GoLang maceramızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-06-18 06:11:00</pubDate>
  <slug>golang-ticker-ile-periyodik-is-calistirma</slug>
  <tags>
    <tag>golang</tag>
    <tag>go-programming-language</tag>
    <tag>time</tag>
    <tag>ticker</tag>
    <tag>scheduling</tag>
  </tags>
  <categories>
    <category>GoLang</category>
  </categories>
</post>