<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Params Anahtar Sözcüğünün Kullanımı</title>
  <description>Bugünkü makalemizde, C# metodlarında önemli bir yere sahip olduğunu düşündüğüm params anahtar kelimesinin nasıl kullanıldığını incelemeye çalışacağız. Bildiğiniz gibi metodlara verileri parametre olarak aktarabiliyor ve bunları metod içersinde işleyebiliyoruz.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar.&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde, C# metodlarında &amp;ouml;nemli bir yere sahip olduğunu d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m params anahtar kelimesinin nasıl kullanıldığını incelemeye &amp;ccedil;alışacağız. Bildiğiniz gibi metodlara verileri parametre olarak aktarabiliyor ve bunları metod i&amp;ccedil;ersinde işleyebiliyoruz. Ancak parametre olarak ge&amp;ccedil;irilen veriler belli sayıda oluyor. Diyelimki sayısını bilmediğimiz bir eleman k&amp;uuml;mesini parametre olarak ge&amp;ccedil;irmek istiyoruz. Bunu nasıl başarabiliriz? İşte params anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; bu noktada devreye girmektedir. Hemen &amp;ccedil;ok basit bir &amp;ouml;rnek ile konuya hızlı bir giriş yapalım.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
namespace ParamsSample1
{  
	class Class1
	{
		/* burada Carpim isimli metodumuza, integer tipinde değerler ge&amp;ccedil;irilmesini sağlıyoruz. params anahtarı bu metoda istediğimiz sayıda integer değer ge&amp;ccedil;irebileceğimizi ifade ediyor*/

		public int Carpim(params int[] deger)
		{
		int sonuc=1;  
			for(int i=0;i&amp;lt;deger.Length;++i) /*Metoda g&amp;ouml;nderilen elemanlar doğal olarak bir dizi oluştururlar. Bu dizideki elemanlara bir for d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile kolayca erişebiliriz. Dizinin eleman sayısını ise Length &amp;ouml;zelliği ile &amp;ouml;ğreniyoruz.*/
			{
				sonuc*=deger[i];
				/* Burada metoda ge&amp;ccedil;irilen integer değerlerin birbirleri ile &amp;ccedil;arpılmasını sağlıyoruz*/
			}
			return sonuc;
		}
		static void Main(string[] args)
		{
			Class1 cl=new Class1();
			Console.WriteLine("1*2*3*4={0}",cl.Carpim(1,2,3,4));
			/* Burada Carpim isimli metoda 4 integer değer g&amp;ouml;nderdik. Aşağıdaki kodda ise 2 adet integer değer g&amp;ouml;nderiyoruz.*/
			Console.WriteLine("8*5={0}",cl.Carpim(8,5));
			Console.ReadLine();
		}
	}
}&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rneği &amp;ccedil;alıştıracak olursak, aşağıdaki sonucu elde ederiz.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;img src="/makale/images/mk9_1.jpg" alt="" width="234" height="84" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 1. Ilk Params &amp;Ouml;rneğinin Sonucu&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" align="justify"&gt;Peki derleyici bu işlemi nasıl yapıyor birazda ondan bahsedelim. Carpim isimli metoda değişik sayılarda parametre g&amp;ouml;nderdiğimizde, derleyici g&amp;ouml;nderilen paramtetre sayısı kadar boyuta sahip bir integer dizi oluşturur ve du dizinin elemanlarına sırası ile (0 indexinden başlayacak şekilde) g&amp;ouml;nderilen elemanları atar. Daha sonra aynı metodu bu eleman sayısı belli olan diziyi aktararak &amp;ccedil;ağırır. cl.Carpim ( 8,5) satırını d&amp;uuml;ş&amp;uuml;nelim; derleyici, &amp;nbsp;&lt;/p&gt;
&lt;p&gt;İlk adımda,&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; int[] dizi=new int[2]&amp;nbsp; ile 2 elemanlı 1 dizi yaratır. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;İkinci adımda,&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; dizi[0]=8&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; dizi[1]=5 şeklinde bu dizinin elemanlarını belirler.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Son adımda ise metodu tekrar &amp;ccedil;ağırır.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; cl.Carpim(dizi);&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" align="justify"&gt;Bazı durumlarda parametre olarak ge&amp;ccedil;ireceğimiz değerler farklı veri tiplerine sahip olabilirler. Bu durumda params anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml;, object tipinde bir dizi ile kullanırız. Hemen bir &amp;ouml;rnek ile g&amp;ouml;relim. Aynı &amp;ouml;rneğimize Goster isimli değer d&amp;ouml;nd&amp;uuml;rmeyen bir metod ekliyoruz. Bu metod kendisine aktarılan değerleri console penceresine yazdırıyor.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void Goster(params object[] deger)
{   
	for(int i=0;i&amp;lt;deger.Length;++i)
    {
        Console.WriteLine("{0}. değerimiz={1}",i,deger[i].ToString());
    }
    Console.ReadLine();
}
static void Main(string[] args)
{
    cl.Goster(1,"Ahmet",12.3F,0.007D,
	true,599696969,"C");
}&lt;/pre&gt;
&lt;p class="MsoNormal" align="justify"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml;&amp;nbsp; gibi Goster isimli metodumuza değişik tiplerde ( int,Float,Decimal,bool, String) parametreler g&amp;ouml;nderiyoruz. İşte sonu&amp;ccedil;; &amp;nbsp;&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&amp;nbsp;&lt;img src="/makale/images/mk9_2.jpg" alt="" width="208" height="161" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 2. params object[] kullanımı.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" align="justify"&gt;Şimdi dilerseniz daha işe yarar bir &amp;ouml;rnek &amp;uuml;zerinde konuyu pekiştirmeye &amp;ccedil;alışalım. &amp;Ouml;rneğin değişik sayıda tabloyu bir dataset nesnesine y&amp;uuml;klemek istiyoruz. Bunu yapıcak bir metod yazalım ve kullanalım. Programımız, bir sql sunucusu &amp;uuml;zerinde yer alan her hangibir database&amp;rsquo;e bağlanıp istenilen sayıdaki tabloyu ekranda programatik olarak oluşturulan dataGrid nesnelerine y&amp;uuml;kleyecek. Kodları inceledik&amp;ccedil;e &amp;ouml;rneğimizi daha iyi anlıyacaksınız.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&amp;nbsp;&lt;img src="/makale/images/mk9_3.jpg" alt="" width="386" height="267" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 3. Form Tasarımımız&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" align="justify"&gt;Uygulamamız bir Windows Application. Bir adet tabControl ve bir adet Button nesnesi i&amp;ccedil;eriyor. Ayrıca params anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml; kullanan CreateDataSet isimli metodumuzu i&amp;ccedil;eren CdataSet isimli bir class&amp;rsquo;ımızda var. Bu class&amp;rsquo;a ait kodları yazarak işimize başlayalım.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.Data.SqlClient; 
namespace CreateDataSet
{    
	public class CDataSet
    {
/* CreateDataSet isimli metod g&amp;ouml;nderilen baglantiAdi stringinin değerine g&amp;ouml;re bir SqlConnection nesnesi oluşturur. tabloAdi ile dataset nesnesine eklemek istediğimi tablo adlarini bu metoda g&amp;ouml;ndermekteyiz. params anahtarı kullanıldığı i&amp;ccedil;in istediğimiz sayıda tablo adı g&amp;ouml;nderebiliriz. Elbette, ge&amp;ccedil;erli bir Database ve ge&amp;ccedil;erli tablo adları g&amp;ouml;ndermeliyiz.*/
		public DataSet CreateDataSet(string baglantiAdi,params string[] tabloAdi)
        {
			string sqlSelect,conString;
            conString="data source=localhost;initial catalog="+baglantiAdi+";integrated security=sspi";

			/* Burada SqlConnection nesnesinin kullanacağı connectionString'i belirliyoruz.*/
            DataSet ds=

			new DataSet();/* Tablolarimizi taşıyacak dataset nesnesini oluşturuyoruz*/
            SqlConnection con=new SqlConnection(conString); /*SqlConnection nesnemizi oluşturuyoruz*/
            SqlDataAdapter da;

			/* Bir SqlDataAdapter nesnesi belirtiyoruz ama hen&amp;uuml;z oluşturmuyoruz*/ 
			/*Bu d&amp;ouml;ng&amp;uuml; g&amp;ouml;nderdiğimiz tabloadlarını alarak bir Select sorgusu oluşturur ve SqlDataAdapter yardımıyla select sorgusu sonucu d&amp;ouml;nen tablo verilerini oluşturulan bir DataTable nesnesine y&amp;uuml;kler. Daha sonra ise bu DataTable nesnesi DataSet nesnemizin Tables kolleksiyonuna eklenir. Bu işlem metoda g&amp;ouml;nderilen her tablo i&amp;ccedil;in yapılacaktır. B&amp;ouml;ylece d&amp;ouml;ng&amp;uuml; sona erdiğinde, DataSet nesnemiz g&amp;ouml;ndermiş olduğumuz tablo adlarına sahip DataTable nesnelerini i&amp;ccedil;ermiş olucaktır. */
			for(int i=0;i&amp;lt;tabloAdi.Length;++i)
            {
                sqlSelect="SELECT * FROM "+tabloAdi[i];
                da=new SqlDataAdapter(sqlSelect,con);
                DataTable dt=new DataTable(tabloAdi[i]);
                da.Fill(dt);
				ds.Tables.Add(dt);
            } 
			return ds; /* Son olarak metod &amp;ccedil;ağırıldığı yere DataSet nesnesini g&amp;ouml;ndermektedir.*/
        } 
		public CDataSet()
        {
        }
    }    
} &lt;/pre&gt;
&lt;p class="MsoNormal" align="justify"&gt;Şimdi ise btnYukle isimli butonumuzun kodlarını yazalım.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnYukle_Click(object sender, System.EventArgs e)
{
    CDataSet c=new CDataSet();
    DataSet ds=new DataSet();
    ds=c.CreateDataSet("northwind","Products","Orders");
	for(int i=0;i&amp;lt;ds.Tables.Count;++i)
    {        
		/* tabControl'umuza yeni bir tab page ekliyoruz.*/
        tabControl1.TabPages.Add(new System.Windows.Forms.TabPage(ds.Tables[i].TableName.ToString()));
        /* Oluşturulan bu tab page'e eklenmek &amp;uuml;zere yeni bir datagrid oluşturuyoruz.*/
        DataGrid dg=new DataGrid();
        dg.Dock=DockStyle.Fill;

		/*datagrid tabpage'in tamamını kaplıyacak*/
        dg.DataSource=ds.Tables[i];

		/* DataSource &amp;ouml;zelliği ile DataSet te i indexli tabloyu bağlıyoruz.*/ 
        tabControl1.TabPages[i].Controls.Add(dg);

		/* Oluşturduğumuz dataGrid nesnesini TabPage &amp;uuml;st&amp;uuml;nde g&amp;ouml;stermek i&amp;ccedil;in Controls koleksiyonunun Add metodunu kullanıyoruz.*/
    }
}&lt;/pre&gt;
&lt;p class="MsoNormal" align="justify"&gt;Şimdi&amp;nbsp; programımızı &amp;ccedil;alıştıralım.&amp;nbsp; İşte sonu&amp;ccedil;;&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" align="justify"&gt;&lt;img src="/makale/images/mk9_4.jpg" alt="" width="496" height="320" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil&lt;/em&gt; &lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;4.&amp;nbsp; Tabloların y&amp;uuml;klenmesi.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml;&amp;nbsp; gibi iki tablomuzda y&amp;uuml;klenmiştir. Burada tablo sayısını arttırabilir veya azaltabiliriz. Bunu params anahtar kelimesi m&amp;uuml;mk&amp;uuml;n kılmaktadır. &amp;Ouml;rneğin metodomuzu bu kez 3 tablo ile &amp;ccedil;ağıralım;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;ds=c.CreateDataSet("northwind","Products","Orders","Suppliers");&lt;/pre&gt;
&lt;p&gt;Bu durumda ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;m&amp;uuml;z Şekil 5 teki gibi olur. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk9_5.jpg" alt="" width="496" height="320" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil&lt;/em&gt; &lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;5.&amp;nbsp; Bu kez 3 tablo g&amp;ouml;nderdik.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Umuyorumki&amp;nbsp; params anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; ile ilgili yeterince bilgi sahibi olmuşsunuzdur. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim. &amp;nbsp;&lt;/p&gt;</content>
  <pubDate>2003-11-30 12:00:00</pubDate>
  <slug>Params-Anahtar-Sözcüğünün-Kullanımı-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>params</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>