<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>ServiceStack ile REST Servis Geliştirmek</title>
  <description>ServiceStack, WCF ve Asp.Net Web API' ye alternatif olarak kullanılabilecek bir Web Service Framework'ü. Standart SOAP tabanlı servisler dışında REST tabanlı servislerin geliştirilmesine de izin veren bir çatı. Host uygulamalar IIS, Windows Service ya da Self-Hosted teknikleri ile yayınlanabiliyor. Hatta mono üzerinden de servisleri host etmek mümkün ki bu da farklı platformlar üzerinden servis yayınlanmasına imkan sağlıyor. Çok fazla konfigurasyon gerektirmeden kolayca geliştirme yapılması mümkün.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2016/02/cat.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;enlerde &amp;uuml;zerinde &amp;ccedil;alışmakta olduğum proje i&amp;ccedil;in kullandığım geliştirme ortamımı bir g&amp;uuml;zelce patlatıverdim. &lt;strong&gt;Oracle&lt;/strong&gt;'ın yeni s&amp;uuml;r&amp;uuml;m&amp;uuml;ne ait &lt;strong&gt;Data Provider&lt;/strong&gt;' ın,&lt;strong&gt; .Net Framework 4.5.2&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;ne y&amp;uuml;kseltmiş bir uygulamada neden &amp;ccedil;alışmadığını araştırıyordum. Sorun sunucu kaynaklı idi. Vakayı&amp;nbsp;geliştirme&amp;nbsp;ortamında da oluşturmaya &amp;ccedil;alıştım. Nitekim orada her şey yolunda g&amp;ouml;r&amp;uuml;n&amp;uuml;yordu. Lafı fazla uzatmayayım sonunda &lt;strong&gt;Production &lt;/strong&gt;ortamını&amp;nbsp;da kurcalamaya karar verdim...Eee...Şey...Orayı da patlattım :) Neyseki prod sunucusu sadece kurulumu yapılmış ve hen&amp;uuml;z yayına alınmamış bir makine idi. Zaten uygulamanın orada başarılı şekilde &amp;ccedil;alışması halinde kullanıma a&amp;ccedil;ılacak bir sunucuydu. Durumu ben, sistem ekibindeki bir ka&amp;ccedil; kişi&amp;nbsp;ve ekip arkadaşım biliyordu. Ah şu andan itibaren de siz. Dolayısıyla hafif stresli&amp;nbsp;g&amp;uuml;nler ge&amp;ccedil;irdiğimi ifade edebilirim.&amp;nbsp;Epeyce sinirlendim ve sakinleşmek i&amp;ccedil;in her zaman yaptığım şeyi yaptım. Makale yazdım.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bu kez g&amp;ouml;z&amp;uuml;me faydalı olduğunu d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m bir &lt;strong&gt;Nuget&lt;/strong&gt; paketini kestirdim. &lt;a href="http://www.servicedesignpatterns.com/requestandresponsemanagement/datatransferobject"&gt;DTO servis tasarım desenini&lt;/a&gt; baz alan &lt;strong&gt;ServiceStack&lt;/strong&gt;.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Arada sırada NuGet paketlerini indirip kullanmaya &amp;ccedil;alışmakta fayda var. Nitekim bu paketleri kullanırken uyguladıkları kalıpları veya mimari yaklaşımları da inceleme fırsatı buluyoruz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;ServiceStack&lt;/strong&gt;,&amp;nbsp;&lt;strong&gt;WCF&lt;/strong&gt; ve &lt;strong&gt;Asp.Net Web API&lt;/strong&gt;' ye alternatif olarak kullanılabilecek bir &lt;strong&gt;Web Service Framework&lt;/strong&gt;'&amp;uuml;. Standart &lt;strong&gt;SOAP&lt;/strong&gt; tabanlı servisler dışında&amp;nbsp;&lt;strong&gt;REST&lt;/strong&gt; tabanlı servislerin geliştirilmesine de izin veren bir &amp;ccedil;atı. Host uygulamalar&amp;nbsp;&lt;strong&gt;IIS&lt;/strong&gt;, &lt;strong&gt;Windows Service&lt;/strong&gt; ya da&amp;nbsp;&lt;strong&gt;Self-Hosted&lt;/strong&gt; teknikleri ile yayınlanabiliyor. Hatta &lt;strong&gt;mono&lt;/strong&gt; &amp;uuml;zerinden de servisleri host etmek m&amp;uuml;mk&amp;uuml;n ki bu da&amp;nbsp;farklı platformlar &amp;uuml;zerinden servis yayınlanmasına imkan sağlıyor.&amp;nbsp;&amp;Ccedil;ok fazla konfigurasyon gerektirmeden kolayca geliştirme yapılması m&amp;uuml;mk&amp;uuml;n.&lt;/p&gt;
&lt;p&gt;Aslında &lt;strong&gt;Data Transfer Object&lt;em&gt;(DTOs)&lt;/em&gt;&lt;/strong&gt; olarak adlandırılan servis tasarım kalıbını&amp;nbsp;benimsemekte. Bu modele g&amp;ouml;re servis u&amp;ccedil; noktalarına gelecek olan &lt;strong&gt;talepler&lt;em&gt;(Requests)&lt;/em&gt;&lt;/strong&gt; ve &lt;strong&gt;cevaplar&lt;em&gt;(Response)&lt;/em&gt;&lt;/strong&gt; birer nesne olarak tanımlanıyor. Bir servisin tanımlanması i&amp;ccedil;in zaten en az bir talep i&amp;ccedil;in &lt;strong&gt;DTO&lt;/strong&gt; sınıfının yazılması gerekmekte. Servisler birer &lt;strong&gt;Endpoint&lt;/strong&gt; olarak sunuluyor. &lt;strong&gt;Route&lt;/strong&gt; tanımlamaları ise&lt;em&gt;(yani hangi HTTP talebinin ele alınacağının &amp;ccedil;alışma ortamına bildirimesi ve uygun y&amp;ouml;nlendirmenin yapılması)&lt;/em&gt;&amp;nbsp;&lt;strong&gt;Asp.Net Web API&lt;/strong&gt;'den farklı olarak &lt;strong&gt;service controller&lt;/strong&gt; yerine &lt;strong&gt;DTO&lt;/strong&gt; seviyesinde uygulanıyor. T&amp;uuml;m bunlar biraz kafanızı karıştırmış olabilir. Gelin basit bir &amp;ouml;rnek &amp;uuml;zerinden konuyu anlamaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;h2&gt;Senaryo&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;Console&lt;/strong&gt; uygulaması &amp;uuml;zerinden &lt;strong&gt;host&lt;/strong&gt; edilen bir &lt;strong&gt;REST&lt;/strong&gt; servis geliştireceğiz. Bu servisin şimdilik &lt;strong&gt;HTTP&lt;/strong&gt; &lt;strong&gt;Get&lt;/strong&gt; ve &lt;strong&gt;Post&lt;/strong&gt; i&amp;ccedil;in birer operasyonu olacak. Ancak kendi &amp;ccedil;alışmanız sırasında &lt;strong&gt;Put&lt;/strong&gt; ve &lt;strong&gt;Delete&lt;/strong&gt; gibi operasyonları da senaryoya dahil edebilirsiniz. Servisimiz &lt;strong&gt;Product&lt;/strong&gt; tipinden bir nesne koleksiyonunu kullanacak. &lt;strong&gt;Get&lt;/strong&gt; operasyonları ile adı belirli bir metin ile başlayan &amp;uuml;r&amp;uuml;nlerin listesini veya t&amp;uuml;m&amp;uuml;n&amp;uuml; d&amp;ouml;nd&amp;uuml;receğiz. &lt;strong&gt;Post&lt;/strong&gt; operasyonu ile de yeni bir &amp;uuml;r&amp;uuml;n&amp;uuml; listeye ekleyeceğiz. &lt;strong&gt;Host&lt;/strong&gt; uygulamasını,&amp;nbsp;&lt;strong&gt;localhost&lt;/strong&gt; &amp;uuml;zerinde bizim belirleyeceğimiz uygun bir &lt;strong&gt;Port&lt;/strong&gt;'tan ayağa kaldıracağız. Kısacası&amp;nbsp;&lt;strong&gt;Self-Hosted&lt;/strong&gt; bir program s&amp;ouml;z konusu&amp;nbsp;olacak. İstemci tarafında ise basit bir tarayıcıdan veya &lt;strong&gt;SoapUI&amp;nbsp;&lt;/strong&gt;aracından yararlanabiliriz. Temel hedefimiz &lt;strong&gt;Http&lt;/strong&gt; &lt;strong&gt;Get&lt;/strong&gt; ve &lt;strong&gt;Post&lt;/strong&gt; taleplerini yaparak sonu&amp;ccedil;ları g&amp;ouml;rebilmek.&amp;nbsp;&lt;/p&gt;
&lt;h2&gt;Servis Tarafı&lt;/h2&gt;
&lt;p&gt;İlk olarak bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması a&amp;ccedil;arak işe başlayalım. Sonrasında &lt;strong&gt;ServiceStack&lt;/strong&gt; paketini uygulamamıza dahil etmemiz gerekiyor.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/02/sStack_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Paketi dahil ettikten sonra aşağıdaki sınıf diagramını baz alarak gerekli geliştirmeleri yapmaya başlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/02/sstack_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve kodlar&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using ServiceStack;
using System;
using System.Collections.Generic;
using System.Linq;

namespace HowToServiceStack
{
    class Program
    {
        static void Main(string[] args)
        {
            var hostAddress = "http://*:4568/";
            var appHost = new AppHost().Init().Start(hostAddress);

            Console.WriteLine("Host is running at {0}",hostAddress);
            Console.ReadLine();               
        }
    }

    #region POCOs

    public class Product
    {
        public int PartNumber { get; set; }
        public string Name { get; set; }
        public decimal ListPrice { get; set; }
    }

    #endregion

    #region DTOs

    [Route("/Products","GET")]
    [Route("/Products/{NameLike}","GET")]
    public class ProductSelectRequest
        :IReturn&amp;lt;ProductSelectResponse&amp;gt;
    {
        public string NameLike { get; set; }
    }
    public class ProductSelectResponse
    {
        public List&amp;lt;Product&amp;gt; Products { get; set; }
    }

    [Route("/products","POST")]
    public class CreateProduct
        :IReturn&amp;lt;ProductSelectResponse&amp;gt;
    {
        public int PartNumber { get; set; }
        public string Name { get; set; }
        public decimal ListPrice { get; set; }
    }

    #endregion

    #region Service Implementation

    public class ProductService
        : Service
    {
        public static List&amp;lt;Product&amp;gt; products = new List&amp;lt;Product&amp;gt;
        {
            new Product{ PartNumber=1001, Name="AC-210",ListPrice=1000},
            new Product{ PartNumber=1002, Name="AC-215",ListPrice=960},
            new Product{ PartNumber=1003, Name="KC-210",ListPrice=850.50M},
            new Product{ PartNumber=1004, Name="BC-210",ListPrice=750},
            new Product{ PartNumber=1005, Name="BD-123",ListPrice=450},
            new Product{ PartNumber=1006, Name="BD-400",ListPrice=900},
            new Product{ PartNumber=1007, Name="ZD-405",ListPrice=250},
            new Product{ PartNumber=1008, Name="CD-505",ListPrice=385}
        };

        public object Get(ProductSelectRequest request)
        {
            if(request.NameLike!=default(string))
            {
                return new ProductSelectResponse
                {
                    Products = (from p in products
                               where p.Name.StartsWith(request.NameLike)
                               select p).ToList()
                };
            }
            else
            {
                return new ProductSelectResponse
                {
                    Products = products
                };
            }
            
        }

        public object Post(CreateProduct request)
        {
            Product newProduct = new Product
            {
                PartNumber = request.PartNumber,
                Name = request.Name,
                ListPrice = request.ListPrice
            };
            products.Add(newProduct);
            return newProduct;
        }
    }    

    #endregion

    public class AppHost
        : AppSelfHostBase
    {
        public AppHost()
            :base("HttpListener Self-Host",typeof(ProductService).Assembly)
        {
        }
        public override void Configure(Funq.Container container)
        {
        }
    }
}&lt;/pre&gt;
&lt;h2&gt;Kodda Neler Yaptık?&lt;/h2&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;AppHost&lt;/strong&gt; sınıfına bir bakalım. &lt;strong&gt;AppSelfHostBase&lt;/strong&gt;' den t&amp;uuml;retilmiş olan bu sınıf temel olarak &lt;strong&gt;Host&lt;/strong&gt; uygulama g&amp;ouml;revini &amp;uuml;stleniyor. Ayrıca &lt;strong&gt;ProductService&lt;/strong&gt; isimli servisin hizmete alınması işlemlerini ger&amp;ccedil;ekleştiriyor. Uygulama&amp;nbsp;&lt;strong&gt;http://localhost:4568&lt;/strong&gt; adresi &amp;uuml;zerinden yayın yapacak. Buna g&amp;ouml;re &lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisinde &lt;strong&gt;Init().Start(hostAddress)&lt;/strong&gt; formasyonunu kullanıyoruz&lt;em&gt;(Burada Fluent stilde bir tasarım olduğu g&amp;ouml;zden ka&amp;ccedil;mamalıdır. Fleunt kod tasarımı i&amp;ccedil;in &lt;a href="/post/Fluent-Interface-Prensibi-ile-Daha-Okunabilir-Kod-Gelistirmek.aspx"&gt;bu yazıya&lt;/a&gt; bakabilirsiniz)&amp;nbsp;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Yukarıda da bahsettiğimiz &amp;uuml;zere &lt;strong&gt;ServiceStack&lt;/strong&gt; &lt;strong&gt;DTO &lt;/strong&gt;servis tasarım desenini&amp;nbsp;kullanmaktadır. &lt;strong&gt;/products/ ve /products/{NameLike}&lt;/strong&gt; şeklinde yapılacak &lt;strong&gt;HTTP&lt;/strong&gt; &lt;strong&gt;Get&lt;/strong&gt; talepleri i&amp;ccedil;in &lt;strong&gt;ProductSelectRequest&lt;/strong&gt; isimli bir &lt;strong&gt;DTO&lt;/strong&gt;&amp;nbsp;tipi tanımlanmıştır.&amp;nbsp;&lt;strong&gt;ProductSelectRequest&lt;/strong&gt; sınıfı &lt;strong&gt;IReturn&amp;lt;ProductSelectResponse&amp;gt;&lt;/strong&gt; &lt;strong&gt;aray&amp;uuml;z&amp;uuml;n&amp;uuml;&lt;em&gt;(Interface)&lt;/em&gt;&lt;/strong&gt; uygulamaktadır. Buna g&amp;ouml;re &amp;ccedil;alışma zamanı &lt;strong&gt;/Products&lt;/strong&gt; veya &lt;strong&gt;/Products/{NameLike}&lt;/strong&gt; talepleri karşısında nasıl bir tip d&amp;ouml;nd&amp;uuml;receğini de &amp;ouml;ğrenmektedir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ProductSelectRequest&amp;nbsp;&lt;/strong&gt;sadece &lt;strong&gt;NameLike&lt;/strong&gt; isimli bir &amp;ouml;zellik i&amp;ccedil;ermektedir. Hatta bu &amp;ouml;zellik &lt;strong&gt;Route&lt;/strong&gt; niteliğinde de birebir kullanılmaktadır. İstemci tarafından gelecek talebin &amp;ccedil;eşitliliğine g&amp;ouml;re &lt;strong&gt;DTO&lt;/strong&gt; sınıflarına n sayıda &amp;ouml;zellik de katılabilir. &lt;strong&gt;Get&lt;/strong&gt; taleplerine olan cevabımız temel olarak bir &amp;uuml;r&amp;uuml;n listesidir. Bu nedenle &lt;strong&gt;ProductSalesResponse&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde &lt;strong&gt;List&amp;lt;Product&amp;gt;&lt;/strong&gt; tipinden bir &amp;ouml;zellik bulunmaktadır.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;Bir diğer &lt;strong&gt;DTO&lt;/strong&gt; tipi&amp;nbsp;ise &lt;strong&gt;CreateProduct&lt;/strong&gt; sınıfıdır. Bu sınıf yeni bir &amp;uuml;r&amp;uuml;n&amp;uuml; listeye eklemek i&amp;ccedil;in gerekli &amp;ouml;zellikleri i&amp;ccedil;ermektedir. &lt;strong&gt;Route&lt;/strong&gt; niteliğinde bir &amp;ouml;nceki &lt;strong&gt;DTO&lt;/strong&gt; nesnesinden farklı olarak &lt;strong&gt;POST&lt;/strong&gt; bildirimi yapılmıştır. Her iki &lt;strong&gt;DTO&lt;/strong&gt; &amp;uuml;zerinde de &lt;strong&gt;Route nitelikleri&lt;em&gt;(Attributes)&lt;/em&gt;&lt;/strong&gt; kullanılmıştır. İlk parametreler &lt;strong&gt;resource&lt;/strong&gt; bilgisini, ikinci parametreler ise &lt;strong&gt;HTTP&lt;/strong&gt; metodunu ifade etmektedir.&amp;nbsp;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;Uygulamanın can alıcı noktası ise tahmin edileceği &amp;uuml;zere &lt;strong&gt;ProductService&lt;/strong&gt; isimli hizmettir. Servis,&amp;nbsp;&lt;strong&gt;Get&lt;/strong&gt; ve &lt;strong&gt;Post&lt;/strong&gt; isimli iki fonksiyon i&amp;ccedil;erir. Her iki metodda dikkat edileceği &amp;uuml;zere &lt;strong&gt;DTO&lt;/strong&gt; nesnelerini parametre olarak almaktadır. Get metodu ile &amp;uuml;r&amp;uuml;n koleksiyonu &amp;uuml;zerinde &lt;strong&gt;Name&lt;/strong&gt; alanının değerine g&amp;ouml;re arama yaptırılır. Eğer &lt;strong&gt;NameLike&lt;/strong&gt; değeri verilmemişse t&amp;uuml;m &amp;uuml;r&amp;uuml;n listesi d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;r. &lt;strong&gt;Post&lt;/strong&gt; metodu ise basit&amp;ccedil;e &lt;strong&gt;products&lt;/strong&gt; değişkenine yeni bir &lt;strong&gt;Product&lt;/strong&gt; nesne &amp;ouml;rneği ilave etmektedir.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ProductService&lt;/strong&gt;&amp;nbsp;sınıfnın bulunduğu &lt;strong&gt;Assembly&lt;/strong&gt; dikkat edileceği &amp;uuml;zere &lt;strong&gt;AppHost&lt;/strong&gt; sınıfının yapıcı metodunda kullanılmakta ve &lt;strong&gt;base&lt;/strong&gt; sınıfın yapıcı metoduna y&amp;ouml;nlendirilmektedir. &amp;Ccedil;alışma zamanının gelen &lt;strong&gt;Assembly&lt;/strong&gt; bildirimine g&amp;ouml;re hangi tipleri servis olarak devreye alacağı&amp;nbsp;&lt;strong&gt;Service&lt;/strong&gt; sınıfından yapılan &lt;strong&gt;t&amp;uuml;retme&lt;em&gt;(Inheritance)&lt;/em&gt;&lt;/strong&gt; sayesinde bilinmektedir. Bir başka deyişle&lt;strong&gt;&amp;nbsp;Application Host&lt;/strong&gt; &amp;ccedil;alışma zamanının Service t&amp;uuml;revli tipleri birer hizmet olarak yayına alacağını ifade edebiliriz.&lt;/p&gt;
&lt;p&gt;Aslında yaptıklarımızı aşağıdaki şekil ile kısaca &amp;ouml;zetleyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/02/sStack_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Testler&lt;/h2&gt;
&lt;p&gt;&amp;Ouml;ncelikli olarak servisi ayağa kaldırmamız gerekiyor. &lt;strong&gt;Console&lt;/strong&gt; uygulamasını başlattığımızda aşağıdakine benzer bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşmalıyız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/02/sStack_0.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sonrasında istemci testlerine başlayabiliriz. Ben, &lt;strong&gt;Get&lt;/strong&gt; ve &lt;strong&gt;Post&lt;/strong&gt; talepleri i&amp;ccedil;in &lt;strong&gt;SoapUI&lt;/strong&gt;&amp;nbsp;ve &lt;strong&gt;Google Chrome&lt;/strong&gt; tarayıcısından yararlandım. &lt;strong&gt;SoapUI&amp;nbsp;&lt;/strong&gt;&amp;uuml;zerinden elde ettiğim sonu&amp;ccedil;lar ise ş&amp;ouml;yle.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;http://localhost:4568/products/ HTTP Get&lt;/strong&gt; i&amp;ccedil;in&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/02/sStack_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ServiceStack&lt;/strong&gt; istemci tarafına &amp;ouml;zel bir &lt;strong&gt;HTML&lt;/strong&gt; i&amp;ccedil;eriği basar. İstenirse &amp;ccedil;ıktılar &lt;strong&gt;json&lt;/strong&gt;,&lt;strong&gt;xml&lt;/strong&gt;,&lt;strong&gt;csv&lt;/strong&gt; ve hatta &lt;strong&gt;jsv&lt;/strong&gt; formatında alınabilir. Tek yapılması gereken &lt;strong&gt;URL&lt;/strong&gt;&amp;nbsp;sonuna &lt;strong&gt;?format=json&lt;/strong&gt; benzeri bir ifade eklemektir. &amp;Ouml;rneğin &lt;span style="text-decoration: underline;"&gt;&amp;uuml;r&amp;uuml;n adı B harfi ile başlayanların listesini JSON formatında elde etmek istersek&lt;/span&gt; &lt;strong&gt;http://localhost:4568/Products/B?format=json&lt;/strong&gt;&amp;nbsp;şeklinde bir talep g&amp;ouml;nderilmesi yeterlidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/02/sstack_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve&amp;nbsp;&lt;strong&gt;http://localhost:4568/products/ HTTP Post&lt;/strong&gt;&amp;nbsp;i&amp;ccedil;inde aşağıdaki şekilde talepte bulunabiliriz. Eğer &lt;strong&gt;Post&lt;/strong&gt; paketi başarılı bir şekilde g&amp;ouml;nderilirse servisin yeni &amp;uuml;retilen &lt;strong&gt;Product&lt;/strong&gt; nesnesine ait değerleri geri g&amp;ouml;nderdiğini de g&amp;ouml;rebilmeliyiz. Aynen aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/02/sStack_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlem sonrasında &amp;uuml;r&amp;uuml;n listesi yeniden talep edilirse &lt;strong&gt;1000&lt;/strong&gt; numaralı par&amp;ccedil;anın da koleksiyona eklendiği g&amp;ouml;r&amp;uuml;lecektir. Tabii ki bir ger&amp;ccedil;ek hayat senaryosunda veriyi tutmak adına &lt;strong&gt;RDBMS&lt;/strong&gt; veya &lt;strong&gt;NoSQL&lt;/strong&gt; tabanlı bir kaynaktan yararlanmakta yarar vardır. Siz antrenmanlarınızı buna g&amp;ouml;re yapabilirsiniz.&lt;/p&gt;
&lt;p&gt;Bu makalemizde &lt;strong&gt;ServiceStack&lt;/strong&gt; paketini kullanarak &lt;strong&gt;Self-Hosted&amp;nbsp;REST&lt;/strong&gt; servislerini nasıl geliştirebileceğimizi basit bir &amp;ouml;rnek &amp;uuml;zerinden incelemeye &amp;ccedil;alıştık. Anlamamız gereken &amp;ouml;nemli noktalardan birisi de &lt;strong&gt;DTO&lt;/strong&gt; servis tasarım kalıbının&amp;nbsp;nasıl kullanıldığıdır. Ayrıca &lt;strong&gt;Service&lt;/strong&gt; t&amp;uuml;revli tiplerin &amp;ccedil;alışma zamanında servis şeklinde nasıl sunulabildiğinin, &lt;strong&gt;Route&lt;/strong&gt; niteliklerinin g&amp;ouml;revlerini nasıl ger&amp;ccedil;ekleştirdiğinin ve gelen talepler ile ilgili &lt;strong&gt;DTO&lt;/strong&gt; nesnelerinin nasıl ele alındığının d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmesinde yarar vardır. Siz bu tip bir &amp;ccedil;atıyı tasarlamaya &amp;ccedil;alışsanız nasıl bir yol izler ve kodlama yapardınız? Bunu bir d&amp;uuml;ş&amp;uuml;n&amp;uuml;n.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-02-13 07:00:00</pubDate>
  <slug>servicestack-ile-rest-servis-gelistirmek</slug>
  <tags>
    <tag>rest</tag>
    <tag>service</tag>
    <tag>service-oriented-architecture</tag>
    <tag>c#</tag>
    <tag>servicestack</tag>
    <tag>oop</tag>
    <tag>soapui</tag>
    <tag>dto</tag>
    <tag>data-transfer-object</tag>
    <tag>service-design-patterns</tag>
  </tags>
  <categories>
    <category>REST</category>
  </categories>
</post>