<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Basit Bir JsonConverter Uyarlaması</title>
  <description>Elimizde aynı anlamları taşıyan ama key adları farklı olan JSON içerikleri bulunmakta. Farklı paketleri kullanan servislerden dönen farklı cevaplar oluşuyor. İstemci tarafı aynı anlamdaki bu farklı çıktılar için farklı sınıflar tasarlamak istemiyor. Acaba ters serileştirme işlemi sırasında araya girip farklı key değerlerini aynı nesne örneğinin özelliklerine atamamız mümkün olabilir mi? JsonConverter sınıfını kullanarak konuya çözüm üretmeye çalışıyoruz.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/07/peter_1.jpg" alt="" /&gt;Merhaba Burak,&lt;/p&gt;
&lt;p&gt;Nasılsın? Umarım iyisindir ve her şey yolundadır. Beni sorarsan her zaman ki gibi olduk&amp;ccedil;a yoğun bir d&amp;ouml;nemden ge&amp;ccedil;mekteyim. &amp;Ouml;zellikle halen devam etmekte olan mimari d&amp;ouml;n&amp;uuml;ş&amp;uuml;m projesinden dolayı b&amp;ouml;yle bir yoğunluğumuz var. Ger&amp;ccedil;i&amp;nbsp;&amp;ccedil;evikleşmeye&amp;nbsp;başladığımızdan&amp;nbsp;beri fazla mesai yapmıyor ve ger&amp;ccedil;ekten değer i&amp;ccedil;eren s&amp;uuml;r&amp;uuml;mlenebilir &amp;ccedil;ıktılar &amp;uuml;retiyoruz. Şu an&amp;nbsp;altıncı sprint'i koşmaktayız ve takımın ivmesi rayına oturmuş durumda. Bu a&amp;ccedil;ılardan bakınca tatlı bir yoğunluktayım desem yeridir. Sana bunları anlatmama gerek yok nitekim duyduğuma g&amp;ouml;re siz de benzer bir s&amp;uuml;rece girmişssiniz.&lt;/p&gt;
&lt;p&gt;Ben izninle kafama takılan bir konuyu seninle paylaşmak istiyorum. Firmamız b&amp;uuml;nyesinde geliştirdiğimiz Web API servislerinde standart input ve output tipleri kullanmaktayız. Payload'ları bunların i&amp;ccedil;erisinde taşıyoruz. Bilirsin, POCO&lt;em&gt;(Plain Old CLR Objects)&lt;/em&gt; şeklinde tasarladığımız klasik servis girdi &amp;ccedil;ıktı mesajları işte. Lakin bu mesajların bazılarının farklı d&amp;ouml;nd&amp;uuml;ğ&amp;uuml;n&amp;uuml; g&amp;ouml;rd&amp;uuml;k. Aktif olarak Load Balancer'lar arkasında kalan servislerin&amp;nbsp;bir ka&amp;ccedil;ı&amp;nbsp;aşağıdaki gibi bir JSON i&amp;ccedil;eriği d&amp;ouml;nd&amp;uuml;rmekteyken&lt;em&gt;(basit anlatabilmek i&amp;ccedil;in i&amp;ccedil;erikleri kırptım)&lt;/em&gt;,&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;{
	'operation_name':'Dosya transfer işlemi',
	'state':'Tamamlandı',
	'additional_info':'her şey yolunda',
	'time':'20180404195865'
}&lt;/pre&gt;
&lt;p&gt;bazıları da aşağıdaki gibi bir i&amp;ccedil;erik d&amp;ouml;nd&amp;uuml;r&amp;uuml;yor.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;{
	'function_name':'Batch &amp;ccedil;alıştırma işlemi',
	'status':'hata aldı',
	'description':'batch yerinde bulunamamış',
	'time':'20180404190001'
}&lt;/pre&gt;
&lt;p&gt;Senin de g&amp;ouml;receğin gibi servislerin bazıları output tipinin farklı bir versiyonunu kullanmakta. Bu sorunu &amp;ccedil;&amp;ouml;zmek &amp;uuml;zere bir takım geliştirmelere başladık. Ancak bu sorun merak ettiğim başka bir konuyu daha doğurdu. Servisleri test ettiğim tarafta bu iki farklı &amp;ccedil;ıktı i&amp;ccedil;in iki farklı sınıf yazmak zorunda kaldım.&amp;nbsp;Bir şekilde mesajlar i&amp;ccedil;in araya girip JSON'ların key değerlerine g&amp;ouml;re tek bir nesne &amp;ouml;rneğine Deserialize işlemi uygulayabilir miyim? Uygulayabilirsek eğer bir &amp;ouml;rnek ile nasıl yapabileceğimizi bana anlatabilir misin? En kısa s&amp;uuml;rede g&amp;ouml;r&amp;uuml;şmek &amp;uuml;midiyle sevgili dostum. S(h)arp' a bol bol selamlar :)&lt;/p&gt;
&lt;h3&gt;Sevgili Nazım,&lt;/h3&gt;
&lt;p&gt;Sendeki tatlı yoğunluğun bir benzeri bizde de var. Hen&amp;uuml;z&amp;nbsp;ikinci&amp;nbsp;sprint'teyiz. Taşlar yeni yeni oturmaya başladı. Sanırım bir sonraki sprint'te kapasitemiz ve ne kadarlık iş &amp;ccedil;ıkartabildiğimize dair istatistiki değerler oturmaya başlayacak. Takım olarak hareket etmek olduk&amp;ccedil;a g&amp;uuml;zel(benim gibi insanları sevmeye birisi i&amp;ccedil;in bile). Buradaki &amp;ccedil;evik takımların isimleri, karakterleri, logoları, duvar kağıtları da var. Oyunlaştırılmış bir deneyimi yaşadığımızı ifade edebilirim. Benim eşleştiğim karakter Ghostbusters'dan Peter Venkman :) Gelelim senin merak ettiğin problemin &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;ne...&lt;/p&gt;
&lt;p&gt;Eğer istemci tarafında Newtonsoft'un g&amp;uuml;zide, meşhur, en m&amp;uuml;kemmel, en şık JSON paketini kullanıyorsan sanırım aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;aslar işini g&amp;ouml;recektir diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. &amp;Ouml;ncesinde tabii işin &amp;ouml;zetinden bahsedeyim. Deserialize işlemi sırasında araya girmek i&amp;ccedil;in JsonConverter sınıfından t&amp;uuml;retilmiş bir tipi ve i&amp;ccedil;erisinde ezeceğimiz&lt;em&gt;(override)&lt;/em&gt; ReadJson metodunu kullanabiliriz. Aslında &amp;ouml;zelleştirilmiş bir ters serileştirme işlemi s&amp;ouml;z konusu.&lt;/p&gt;
&lt;p&gt;Bu senaryoda aynı anlamı taşıyan ama farklı isimlendirilmiş JSON i&amp;ccedil;erikleri var. key:value &amp;ccedil;iftlerindeki key bilgileri i&amp;ccedil;in basit bir eşleşme tutmamız ve value değerlerine g&amp;ouml;re kendi tarafımızdaki .Net nesnesini JsonProperty nitelikleri ile desteklememiz yeterli g&amp;ouml;r&amp;uuml;n&amp;uuml;yor. Internet'ten yaptığım araştırmalar sonucunda &amp;ouml;rnek bazı kod par&amp;ccedil;alarını rastladım. Reflection ile az da olsa haşır neşir olmamız gerekiyor ki bu k&amp;ouml;t&amp;uuml; bir şey değil. D&amp;uuml;n gece de West-World'&amp;uuml;n başına ge&amp;ccedil;tim ve basit bir .Net Core Console projesi a&amp;ccedil;tım. İlk iş Newtonsoft.Json paketini projeye dahil ettim. Aşağıdaki gibi.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet add package Newtonsoft.Json --version 11.0.2&lt;/pre&gt;
&lt;p&gt;Sonrasında ServiceResponseConverter isimli şu sınıfı geliştirmeye başladım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class ServiceResponseConverter
	: JsonConverter
{
	private readonly Dictionary&amp;lt;string, string&amp;gt; mappings = new Dictionary&amp;lt;string, string&amp;gt;
	{
		{"operation_name", "function_name"},
		{"state", "status"},
		{"additional_info", "description"},
		{"time","time"}
	};

	public override object ReadJson(JsonReader reader, Type objectType, object existingValue, JsonSerializer serializer)
	{
		var instance = Activator.CreateInstance(objectType);
		var properties = objectType.GetTypeInfo().DeclaredProperties.ToList();

		var payload = JObject.Load(reader);
		foreach (var property in payload.Properties())
		{
			if (!mappings.TryGetValue(property.Name, out var name))
				name = property.Name;

			var instanceProperty = properties.FirstOrDefault(p =&amp;gt; p.CanWrite &amp;amp;&amp;amp; p.GetCustomAttribute&amp;lt;JsonPropertyAttribute&amp;gt;().PropertyName == name);
			instanceProperty?.SetValue(instance, property.Value.ToObject(instanceProperty.PropertyType, serializer));
		}

		return instance;
	}

	public override bool CanWrite =&amp;gt; false;

	public override void WriteJson(JsonWriter writer, object value, JsonSerializer serializer)
	{
		throw new NotImplementedException();
	}
	public override bool CanConvert(Type objectType)
	{
		return objectType.GetTypeInfo().IsClass;
	}
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n &amp;uuml;zere senin &amp;ouml;rnek JSON i&amp;ccedil;eriklerindeki key değerlerinin eşleştirildiği mappings isimli bir generic Dictionary koleksiyonumuz var. Serialization işlemi uygulamayacağımız i&amp;ccedil;in WriteJson fonksiyonunu ele almadım. Bunun yerine ReadJson fonksiyonuna odaklanmanda yarar var. &amp;Ouml;ncelikle ters serileşmede ki hedef nesne &amp;ouml;rneğini &amp;uuml;retmekteyiz.&amp;nbsp;Hangi tipten &amp;uuml;reteceğimiz bilgisi objectType değişkeninde geliyor. JSON i&amp;ccedil;eriğinden okuma yapıp &amp;ouml;zelliklere değer atayacağımızdan properties isimli bir liste de oluşturuyoruz. Ardından reader i&amp;ccedil;eriğini okuyup JObject t&amp;uuml;r&amp;uuml;nden olan payload nesnesine alıyoruz. Derken payload i&amp;ccedil;erisindeki t&amp;uuml;m &amp;ouml;zellikleri dolaşmaya başlıyoruz. mappings'deki eşletirmeleri ve hedef sınıfın nitelik tanımlarındaki&amp;nbsp;isimleri kullanarak bir atama ger&amp;ccedil;ekleştiriyoruz. Dibine kadar reflection kullandığımızı fark etmiş olmalısın. Eski C# bilgilerini hatırlamanın zamanı gelmişti zaten ;) Deserialize işlemine konu olacak hedef sınıf i&amp;ccedil;eriği ise aşağıdaki gibi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[JsonConverter(typeof(ServiceResponseConverter))]
public class ServiceResponse
{
	[JsonProperty("function_name")]
	public string Operation { get; set; }
	[JsonProperty("status")]
	public string State { get; set; }
	[JsonProperty("description")]
	public string Info { get; set; }
	[JsonProperty("time")]
	public string ProcessingTime { get; set; }

	public override string ToString()
	{
		return $"Operation : {Operation}\nState : {State}\nInfo : {Info}\nProcessing Time : {ProcessingTime}\n";
	}
}&lt;/pre&gt;
&lt;p&gt;Dikkat edersen JsonProperty niteliklerinde mappings listesindeki value adları kullanılmış durumda. Ayrıca ServiceResponse sınıfına uygulanan JsonConverter niteliğine parametre olarak ServiceResponseConverter tipini vermeliyiz ki Deserialize işleminde devreye girebilsin. &amp;Ouml;rnek main metodu kodlarımız da aşağıdaki gibi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
	string sample_1 = @"
					{
						'operation_name':'Dosya transfer işlemi',
						'state':'Tamamlandı',
						'additional_info':'her şey yolunda',
						'time':'20180404195865'
					}";
	string sample_2 = @"
					{
						'function_name':'Batch &amp;ccedil;alıştırma işlemi',
						'status':'hata aldı',
						'description':'batch yerinde bulunamamış',
						'time':'20180404190001'
					}";

	Convert(sample_1);
	Convert(sample_2);
}

static void Convert(string payload)
{
	var result = JsonConvert.DeserializeObject&amp;lt;ServiceResponse&amp;gt;(payload);
	Console.WriteLine(result.ToString());
}&lt;/pre&gt;
&lt;p&gt;JsonConvert sınıfının DeserializeObject fonksiyonuna generic ServiceResponse bildirimi yapılmış durumda. &amp;Ccedil;alışma zamanında bu sınıfa uygulanan nitelik sebebiyle &amp;ouml;zelleştirdiğimiz ters serileştirme akışı devreye girecektir. Senin verdiğin mesaj i&amp;ccedil;eriklerini&amp;nbsp;kullanarak yazdığım basit bir test kodu. Elde ettiğim sonu&amp;ccedil;lar aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki gibiydi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/07/jsonconverter_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sanıyorum ki senin istediğin de buna benzer bir şeylerdi. Elbette daha iyi şekilde geliştirilebilir bu kod par&amp;ccedil;ası. Hatta hem sayı hem de isimlendirme olarak birbirlerinden tamamen farklı mesajları tek bir tip i&amp;ccedil;erisinde toplamaya &amp;ccedil;alışmayı da deneyebilirsin. Umarım az da olsa fikir sahibi olmuşssundur. Ben epey şey &amp;ouml;ğrendim diyebilirim. En kısa s&amp;uuml;rede g&amp;ouml;r&amp;uuml;şmek dileğiyle. Ufaklığa bol bol selamlar :)&lt;/p&gt;</content>
  <pubDate>2018-09-22 11:28:00</pubDate>
  <slug>basit-bir-jsonconverter-uyarlamasi</slug>
  <tags>
    <tag>newtonsoft</tag>
    <tag>json</tag>
    <tag>java-script-object-notation</tag>
    <tag>c#</tag>
    <tag>interface</tag>
    <tag>implementation</tag>
    <tag>nuget</tag>
    <tag>package-management</tag>
    <tag>reflection</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
  </categories>
</post>