<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Operator Overloading (Operatörlerin Aşırı Yüklenmesi)</title>
  <description>Hepimiz uygulamalarımızda sıklıkla operatörleri kullanmaktayız. Matematiksel işlemlerde, koşullu ifadelerde,tip dönüştürme işlemlerinde vb...Ancak onların kendi yazdığımız sınıflar için özel anlamlar ifade edecek şekilde yüklenmesi ile pek az uğraşmaktayız. Basit bir toplama operatörünün bile, yeri geldiğinde kendi sınıflarımıza ait nesne örnekleri üzerinde daha farklı davranışlar gösterecek şekilde yeniden yapılandırılması son derece önemlidir. Bu aynı zamanda dilin sağladığı esnekliği ve genişletilebilirliğini de gözler önüne sergilemektedir. İşte bu makalemizde, basit olarak operatörlerin aşırı yüklenmelerinin nasıl gerçekleştirilebileceğini örnek bir uygulama üzerinden incelemeye çalışacağız.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Hepimiz uygulamalarımızda sıklıkla operat&amp;ouml;rleri kullanmaktayız. Matematiksel işlemlerde, koşullu ifadelerde,tip d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemlerinde vb...Ancak onların kendi yazdığımız sınıflar i&amp;ccedil;in &amp;ouml;zel anlamlar ifade edecek şekilde y&amp;uuml;klenmesi ile pek az uğraşmaktayız. Basit bir toplama operat&amp;ouml;r&amp;uuml;n&amp;uuml;n bile, yeri geldiğinde kendi sınıflarımıza ait nesne &amp;ouml;rnekleri &amp;uuml;zerinde daha farklı davranışlar g&amp;ouml;sterecek şekilde yeniden yapılandırılması son derece &amp;ouml;nemlidir. Bu aynı zamanda dilin sağladığı esnekliği ve genişletilebilirliğini de g&amp;ouml;zler &amp;ouml;n&amp;uuml;ne sergilemektedir. İşte bu makalemizde, basit olarak operat&amp;ouml;rlerin aşırı y&amp;uuml;klenmelerinin nasıl ger&amp;ccedil;ekleştirilebileceğini &amp;ouml;rnek bir uygulama &amp;uuml;zerinden incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;İlk olarak senaryomuzdan kısaca bahsedelim. Uygulamamızda System.Drawing isim alanını kullanarak d&amp;ouml;rtgen ve eliptik şekilleri &amp;ccedil;izmemizi sağlayacak iki adet sınıfımız olacak. Bu sınıfların &amp;ccedil;izim metodlarına baktığımızda ortak parametreler i&amp;ccedil;erdiklerini g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bu nedenle bu ortak parametreleri bir arada toplayacağımız bir &amp;uuml;st sınıfıda işin i&amp;ccedil;ine katarak ilgili şekil sınıflarını buradan t&amp;uuml;reteceğiz. Amacımız kalıtım kavramı &amp;uuml;zerinde durmak değil. Bunu sadece kod okunabilirliğini ve nesnelerinin kullanılabilirliğini kolaylaştırmak amacıyla ger&amp;ccedil;ekleştiriyoruz. Peki bu sınıfların yer aldığı bir uygulamada hangi operat&amp;ouml;rleri ne ama&amp;ccedil;la aşırı y&amp;uuml;kleyebiliriz?&lt;/p&gt;
&lt;p&gt;İlk başta akla gelen eliptik bir şeklin i&amp;ccedil;erdiği koordinat, boyut, renk gibi değerleri ile birlikte bir d&amp;ouml;rtgene &amp;ccedil;evrilmesi olabilir. Burada d&amp;ouml;rtgen tipinden bir nesne &amp;ouml;rneğinin, bilin&amp;ccedil;li (explicit) veya bilin&amp;ccedil;siz (implicit) olarak eliptik bir nesne &amp;ouml;rneğine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmesi s&amp;ouml;z konusudur. Bunun i&amp;ccedil;in cast operat&amp;ouml;r&amp;uuml;n&amp;uuml; aşırı y&amp;uuml;kleyebiliriz. Diğer taraftan, var olan d&amp;ouml;rtgen veya eliptik nesnelerinin kendi aralarında toplama operat&amp;ouml;rleri ile toplanması sonucu &amp;ccedil;eşitli kriterlere uyum sağlayacak yeni bir d&amp;ouml;rtgen veya elips nesnesini elde etmeyi d&amp;uuml;ş&amp;uuml;nebiliriz. &amp;Ouml;rneğin, iki kareyi toplayıp, yeni boyutları bu iki karenin toplamı kadar olan başka bir kare nesnesini &amp;ccedil;izdirebiliriz. Bu işlevsellikte ancak ve ancak toplama operat&amp;ouml;r&amp;uuml;n&amp;uuml;n burada s&amp;ouml;z konusu olan sınıflar i&amp;ccedil;in aşırı y&amp;uuml;klenmesi ile m&amp;uuml;mk&amp;uuml;n olabilir. Şimdi gelin uygulamamızı geliştirmeye başlayalım. Operat&amp;ouml;rlerin aşırı y&amp;uuml;klenmesini aşağıdaki g&amp;ouml;r&amp;uuml;n&amp;uuml;me sahip bir windows uygulamasında inceleyeceğiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk123_1.gif" alt="" width="562" height="457" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulamayı m&amp;uuml;mk&amp;uuml;n olduğu kadar basit tasarlamaya &amp;ccedil;alıştım. Amacımız operat&amp;ouml;rlerin aşırı y&amp;uuml;klenmesini incelemek. Bu nedenle Macromedia Fireworks gibi bir grafik tasarım programını icat etmeye &amp;ccedil;alışmıyoruz. Programımız temel olarak belirli renkte &amp;ccedil;izgilere sahip olan d&amp;ouml;rtgensel ve eliptik şekilleri &amp;ccedil;iziyor. Bir şekli &amp;ccedil;izmek i&amp;ccedil;in genişlik ve y&amp;uuml;ksekliğini ilgili textBox kontrollerine atadıktan sonra mouse ile ekranın herhangibir yerine tıklamanız yeterli olacaktır. Bununla birlikte işe biraz renk katmak amacı ile &amp;ccedil;izgi renklerini se&amp;ccedil;ebiliyorsunuz. Men&amp;uuml;de bizim asıl ilgilendiğimiz iki se&amp;ccedil;enek var. Bunlardan birisi bir Elips nesnesini, D&amp;ouml;rtgen tipinden bir nesneye d&amp;ouml;n&amp;uuml;şt&amp;uuml;rerek ekrana &amp;ccedil;iziyor. Diğer men&amp;uuml; se&amp;ccedil;eneği ilede iki D&amp;ouml;rtgen nesnesini toplayıp sonucunu ekrana &amp;ccedil;izdiriyoruz. Makalenin ilerleyen safhalarında iki şeklin boyutsal bazda birbirlerine eşit olup olmadığını bildirecek şekilde koşul operat&amp;ouml;rlerini de aşırı y&amp;uuml;kleyeceğiz. Nesneleri tutmak amacıyla iki ArrayList koleksiyonu kullanmayı tercih ettim. Elbetteki siz bu programı dahada geliştirmeli ve nesnelerin daha esnek olarak tutulabileceği bir yapıyı kurgulamalısınız.&lt;/p&gt;
&lt;p&gt;Gelelim uygulamamızdaki kritik sınıflara. Bu sınıflar, Dortgen, Elips ve TemelSekil sınıflarıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk123_5.gif" alt="" width="516" height="371" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dortgen ve Elips sınıfları TemelSekil sınıfından t&amp;uuml;retilmiştir. Sebebi, Dortgen ve Elips sınıflarının &amp;ccedil;izimi i&amp;ccedil;in kullanılan metodların aynı tipte ve sayıda parametre alıyor olmalarıdır. Dolayısıyla &amp;ccedil;izim i&amp;ccedil;in gerekli materyalleri bir &amp;uuml;st sınıfta tutmak ve bunlara tek bir yerden erişebilmek amacıya bu tarz bir yapı tercih edilmiştir. Sınıflarımıza ilişkin başlangı&amp;ccedil; kodları aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;D&amp;ouml;rtgen.cs&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Drawing;
using System.Windows.Forms;

namespace UsingGDIWithOperatorOverloading
{
    public class Dortgen:TemelSekil
    {
        public Dortgen(Panel aktifForm,Color color,int penSize,int x,int y,int width,int height)
        {
            base.m_X=x;
            base.m_Y=y;
            base.m_Width=width;
            base.m_Height=height;
            base.m_Color=color;
            base.m_PenSize=penSize;
            base.m_AktifForm=aktifForm; 
        }
    
        public Dortgen()
        { 
        }

        public void Ciz()
        {
            Graphics cizici=m_AktifForm.CreateGraphics();
            Pen kalem=new Pen(m_Color,m_PenSize);
            cizici.DrawRectangle(kalem,m_X,m_Y,m_Width,m_Height);
        }        
    }
}&lt;/pre&gt;
&lt;p&gt;Dortgen sınıfında şu an i&amp;ccedil;in sadece Ciz isimli bir metodumuz var. Constructor metodumuz aldığı parametreleri direkt olarak TemelSekil sınıfına g&amp;ouml;ndermekte. Ciz metodu, Dortgen sınıfına ait nesne &amp;ouml;rneğini parametre olarak gelen alan &amp;uuml;zerinde &amp;ccedil;izen işlevlere sahiptir. Dikkat ederseniz, d&amp;ouml;rtgenin &amp;ccedil;izileceği yer, &amp;ccedil;izgi kalınlığı, X ve Y koordinatları, &amp;ccedil;izgi rengi, şeklin genişliği ve y&amp;uuml;ksekliği gibi bilgiler parametrik olarak kullanılmaktadır. Elips sınıfıda Dortgen sınıfına &amp;ccedil;ok benzer bir yapıdadır.&lt;/p&gt;
&lt;p&gt;Elips.cs&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Drawing;
using System.Windows.Forms;

namespace UsingGDIWithOperatorOverloading
{
    public class Elips:TemelSekil
    { 
        public Elips(Panel aktifForm,Color color,int penSize,int x,int y,int width,int height)
        {
            base.m_X=x;
            base.m_Y=y;
            base.m_Width=width;
            base.m_Height=height;
            base.m_Color=color;
            base.m_PenSize=penSize;
            base.m_AktifForm=aktifForm; 
        }

        public Elips()
        {
    
        }

        public void Ciz()
        {
            Graphics cizici=m_AktifForm.CreateGraphics();
            Pen kalem=new Pen(m_Color,m_PenSize);
            cizici.DrawEllipse(kalem,m_X,m_Y,m_Width,m_Height);
        }
    
        public static Elips operator+(Elips k1,Elips k2)
        {
            int R=(k1.m_Color.R+k2.m_Color.R)%255;
            int G=(k1.m_Color.B+k2.m_Color.B)%255;
            int B=(k1.m_Color.G+k2.m_Color.G)%255;
            Color c=Color.FromArgb(R,G,B);
            Elips elips=new Elips(k1.m_AktifForm,c,k1.m_PenSize+k2.m_PenSize, k1.m_X+k2.m_X,k1.m_Y+k2.m_Y,k1.m_Width+k2.m_Width,k1.m_Height+k2.m_Height);
            return elips;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Son olarak TemelSekil.cs sınıfımız ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Drawing;
using System.Windows.Forms;

namespace UsingGDIWithOperatorOverloading
{
    public class TemelSekil
    {
        protected int m_X;
        protected int m_Y;
        protected int m_Width;
        protected int m_Height;
        protected Color m_Color;
        protected int m_PenSize;
        protected Panel m_AktifForm;

        public int X
        {
            get
            {
                return m_X;
            }
        }
        public int Y
        {
            get
            {
                return m_Y;
            }
        }
        public int Width
        {
            get
            {
                return m_Width;
            }
        }
        public int Height
        {
            get
            {
                return m_Height;
            }
        }
        public Color Renk
        {
            get
            {
                return m_Color;
            }
        }
        public Panel AktifForm
        {
            get
            {
                return m_AktifForm;
            }
        }

        public int KalemUcu
        {
            get
            {
                return m_PenSize;
           }
        }
        public TemelSekil()
        {
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi gelelim asıl sorunumuza; bir Dortgen nesne &amp;ouml;rneğini oluşturmak son derece basittir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Dortgen dortgen=new Dortgen(this.pnlKaraTahta,Renk,2,Baslangic_X,Baslangic_Y,Genislik,Yukseklik);&lt;/pre&gt;
&lt;p&gt;Hatta bu nesneyi ekrana &amp;ccedil;izdirmek artık &amp;ccedil;ok daha kolaydır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;dortgen.Ciz();&lt;/pre&gt;
&lt;p&gt;Gel gelelim aşağıdaki kod satırlarının işletilmesi sonrasında nasıl bir sonu&amp;ccedil; alacağımı me&amp;ccedil;huld&amp;uuml;r?&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Dortgen dortgen1=new Dortgen(this.pnlKaraTahta,Color.Black,2,5,20,100,50);
Dortgen dortgen2=new Dortgen(this.pnlKaraTahta,Color.Yellow,2,10,40,75,80);
Dortgen d=dortgen1+dortgen2;
d.Ciz();&lt;/pre&gt;
&lt;p&gt;Bu haliyle uygulamamızı derlediğimizde aşağıdaki hata mesajını alırız;&lt;/p&gt;
&lt;table id="table1" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;&lt;strong&gt;Operator '+' cannot be applied to operands of type 'UsingGDIWithOperatorOverloading.Dortgen' and 'UsingGDIWithOperatorOverloading.Dortgen'&lt;/strong&gt;&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Sebep gayet a&amp;ccedil;ıktır. Dortgen sınıfı toplam işleminin nasıl yapılacağını bilemez. Bunu geliştirici olarak bizim ona &amp;ouml;ğretmemiz gerekmektedir. O halde gelin toplama işlemini bu sınıfa nasıl &amp;ouml;ğreteceğimize bakalım. Herşeyden &amp;ouml;nce operat&amp;ouml;rlerin aşırı y&amp;uuml;klenmesi ile ilgili olaraktan bir takım kurallar vardır. Aslında bu kuralları bizde tahmin edebiliriz.&lt;/p&gt;
&lt;table id="table8" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td valign="top" width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;&lt;strong&gt;&lt;span style="color: #800000;"&gt; Kural 1; &lt;/span&gt;&lt;/strong&gt;operat&amp;ouml;rler, operat&amp;ouml;r metodları yardımıyla aşırı y&amp;uuml;klenirler. Bu sebepten bir metod g&amp;ouml;vdeleri, parametreleri ve d&amp;ouml;n&amp;uuml;ş değerleri vardır.&lt;/em&gt;
&lt;p&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;&lt;span style="color: #800000; font-size: small;"&gt;&lt;em&gt;Kural 2; &lt;/em&gt;&lt;/span&gt;&lt;/strong&gt;&lt;em&gt;&lt;span style="font-size: small;"&gt;operat&amp;ouml;r metodları static olmalıdır. Bunun sebebi operat&amp;ouml;r işlevselliği i&amp;ccedil;in nesne &amp;ouml;rneğine ihtiya&amp;ccedil; duyulmamasıdır.&lt;/span&gt;&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;&lt;span style="color: #800000;"&gt; Kural 3; &lt;/span&gt;&lt;/strong&gt;operat&amp;ouml;r metodları operator anahtar kelimesini i&amp;ccedil;ermelidir. &amp;Ouml;rneğin: operator + gibi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;&lt;span style="color: #800000;"&gt; Kural 4;&lt;/span&gt;&lt;/strong&gt; elbette heryerden erişilebilmeleri gerektiğinden public olmalıdır.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt; &lt;span style="color: #800000;"&gt;&lt;strong&gt;Kural 5;&lt;/strong&gt; operat&amp;ouml;rler doğaları gereği en az bir operand ile &amp;ccedil;alışır. Dolayısıyla aşırı y&amp;uuml;kleyeceğimiz operator metodların en az bir parametre alması şarttır.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Bu kuralları dikkate aldığımızda Dortgen sınıfı i&amp;ccedil;in toplama operat&amp;ouml;r&amp;uuml;n&amp;uuml; aşağıdaki haliyle aşırı y&amp;uuml;kleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public static Dortgen operator+(Dortgen k1,Dortgen k2)
{
    int R=(k1.m_Color.R+k2.m_Color.R)%255;
    int G=(k1.m_Color.B+k2.m_Color.B)%255;
    int B=(k1.m_Color.G+k2.m_Color.G)%255;
    Color c=Color.FromArgb(R,G,B);
    Dortgen Dortgen=new Dortgen(k1.m_AktifForm,c,k1.m_PenSize+k2.m_PenSize,k1.m_X+k2.m_X,k1.m_Y+k2.m_Y, k1.m_Width+k2.m_Width,k1.m_Height+k2.m_Height);
    return Dortgen;
}&lt;/pre&gt;
&lt;p&gt;Dikkat ederseniz + operat&amp;ouml;r&amp;uuml;m&amp;uuml;ze ilişkin metodumuz, Dortgen tipinde iki nesne &amp;ouml;rneğini alıp bunlar &amp;uuml;zerinde bir takım işlemler yaparak sonu&amp;ccedil; olarak &amp;uuml;rettiği Dortgen tipinden nesneyi geriye d&amp;ouml;nd&amp;uuml;rmektedir. Artık biraz &amp;ouml;nce hata veren kodlarımız şimdi &amp;ccedil;alışacaktır. Asıl uygulamamızı y&amp;uuml;r&amp;uuml;tt&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde aşağıdakine benzer bir sonu&amp;ccedil; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk123_2.gif" alt="" width="564" height="456" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Toplama operat&amp;ouml;r&amp;uuml;ne yaptığımız y&amp;uuml;klemeyi diğer operat&amp;ouml;rlere de yapabiliriz. Ancak aşırı y&amp;uuml;klenecek operat&amp;ouml;rler arasında &amp;ouml;zel &amp;ouml;neme sahip olanlar ve hatta aşırı y&amp;uuml;kleme yapılamıyacak olanlar da vardır. S&amp;ouml;zgelimi ekrandaki bir elips şeklini d&amp;ouml;rtgen tipine &amp;ccedil;evirmek istediğimizi varsayalım. Burada bilin&amp;ccedil;siz olarak aşağıdaki gibi bir atama yapmak isteyebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Dortgen d=elipsOrnegi;&lt;/pre&gt;
&lt;p&gt;Diğer yandan bilin&amp;ccedil;li olarakta aşağıdaki tarzda bir d&amp;ouml;n&amp;uuml;ş&amp;uuml;m de yapmak isteyebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Dortgen d=(Dortgen)elipsOrnegi;&lt;/pre&gt;
&lt;p&gt;Dikkat ederseniz ilk &amp;ouml;rnekte bilin&amp;ccedil;siz, ikinci &amp;ouml;rnekte ise bilin&amp;ccedil;li t&amp;uuml;r d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml; s&amp;ouml;z konusudur. Burada mevzu bahis olan d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemlerini ilgili sınıfa &amp;ouml;ğretebilmek i&amp;ccedil;in yine operat&amp;ouml;r aşırı y&amp;uuml;klemeden faydalanabiliriz. &amp;Ouml;rneğin aşağıdaki metod bilin&amp;ccedil;li olarak Dortgen tipine ait cast operat&amp;ouml;r&amp;uuml;n&amp;uuml; aşırı y&amp;uuml;klemektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public static explicit operator Dortgen(Elips elips)
{
    TemelSekil ts=elips;
    Dortgen Dortgen=new Dortgen(ts.AktifForm,ts.Renk,ts.KalemUcu,ts.X,ts.Y,ts.Width,ts.Height);
    return Dortgen;
}&lt;/pre&gt;
&lt;p&gt;Metodumuzda dikkat &amp;ccedil;eken en &amp;ouml;nemli nokta explicit anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;d&amp;uuml;r. Bu Dortgen anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml;n cast operat&amp;ouml;r&amp;uuml; olarak kullanıldığı durumlarda blok i&amp;ccedil;erisindeki kod satırlarının &amp;ccedil;alıştırılacağını ifade etmektedir. Aynı şekilde bilin&amp;ccedil;siz t&amp;uuml;r d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml;ne izin verecek operat&amp;ouml;r y&amp;uuml;klemelerini de yapabiliriz. Tek yapmamız gereken implicit anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml; kullanmaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public static implicit operator Dortgen(Elips elips)
{
    TemelSekil ts=elips;
    Dortgen Dortgen=new Dortgen(ts.AktifForm,ts.Renk,ts.KalemUcu,ts.X,ts.Y,ts.Width,ts.Height);
    return Dortgen;
}&lt;/pre&gt;
&lt;p&gt;Elbette d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme operat&amp;ouml;rlerinin aşırı y&amp;uuml;klenmesi ile ilgili olaraktan dikkat etmemiz gereken &amp;ouml;nemli bir ayrıntı vardır.&lt;/p&gt;
&lt;table id="table14" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;em&gt;Hem implicit hem de explicit operat&amp;ouml;rlerini aynı anda aşırı y&amp;uuml;kleyemeyiz.&lt;/em&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Ancak, sadece implicit operat&amp;ouml;r&amp;uuml;n&amp;uuml;n y&amp;uuml;klemesi ile, &amp;ccedil;alışma zamanında hem explicit hem de implicit d&amp;ouml;n&amp;uuml;ş&amp;uuml;mlere izin vermiş oluruz. Yani aşağıdaki iki kod satırıda başarılı bir şekilde &amp;ccedil;alışacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Dortgen dortgen=elipsNesnesi1;
Dortgen dortgen2=(Dortgen)elipsNesnesi2;&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi operat&amp;ouml;rlerin aşırı y&amp;uuml;klenmesi son derece kolay. Bunları kullandığımız windows uygulamasına ait kod satırları ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private Color Renk;
private int Baslangic_X;
private int Baslangic_Y;
private int Genislik;
private int Yukseklik;
private ArrayList alDortgenler;
private ArrayList alElipsler;

private void menuElipsToDortgen_Click(object sender, System.EventArgs e)
{
    if(alElipsler.Count&amp;gt;0)
    {
        Elips el=(Elips)alElipsler[0];
        Dortgen dortgen=el;
        dortgen.Ciz();
    }
}

private void BaslangicAyarlari()
{
    lblSecilenRenk.Text=Renk.Name;
    lblRenk.BackColor=Renk; 
}

private void btnRenkSec_Click(object sender, System.EventArgs e)
{
    colors.ShowDialog();
    Renk=colors.Color;
    BaslangicAyarlari();
}

private void Form1_Load(object sender, System.EventArgs e)
{
    Renk=Color.Black;
    alDortgenler=new ArrayList();
    alElipsler=new ArrayList();
    BaslangicAyarlari();
}

private void pnlKaraTahta_MouseDown(object sender, System.Windows.Forms.MouseEventArgs e)
{
    Baslangic_X=e.X;
    Baslangic_Y=e.Y;
}

private void Ciz()
{
    if(rdbDortgen.Checked==true)
    {
        Dortgen dortgen=new Dortgen(this.pnlKaraTahta,Renk,2,Baslangic_X,Baslangic_Y,Genislik,Yukseklik);
        dortgen.Ciz();
        alDortgenler.Add(dortgen);
    }
    if(rdbElips.Checked==true)
    {
        Elips elips=new Elips(this.pnlKaraTahta,Renk,2,Baslangic_X,Baslangic_Y,Genislik,Yukseklik);
        elips.Ciz();
        alElipsler.Add(elips);
    }
}

private void menuTopla_Click(object sender, System.EventArgs e)
{
    if(alDortgenler.Count&amp;gt;=2)
    {
        Dortgen d1=(Dortgen)alDortgenler[0];
        Dortgen d2=(Dortgen)alDortgenler[1];
        Dortgen d3=d1+d2;
        d3.Ciz();
    }
}
private void menuTemizle_Click(object sender, System.EventArgs e)
{
    this.Refresh();
    Baslangic_X=0;
    Baslangic_Y=0;
    alDortgenler.Clear();
    alElipsler.Clear();
}

private void pnlKaraTahta_DoubleClick(object sender, System.EventArgs e)
{
    Genislik=Convert.ToInt32(txtGenislik.Text);
    Yukseklik=Convert.ToInt32(txtYukseklik.Text);
    Ciz();
}

private void menuKapat_Click(object sender, System.EventArgs e)
{
    Close();
}&lt;/pre&gt;
&lt;p&gt;Dortgen sınıfı i&amp;ccedil;erisinde aritmetik operat&amp;ouml;rlerin ve d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme operat&amp;ouml;rlerinin nasıl y&amp;uuml;kleneceğini kısaca inceledik. Dilersek koşullu ifadelerde kullanılan operat&amp;ouml;rleride aşırı y&amp;uuml;kleyebiliriz. &amp;Ouml;rneğin == operat&amp;ouml;r&amp;uuml;n&amp;uuml; yeniden y&amp;uuml;kleyerek d&amp;ouml;rtgen sınıfımız i&amp;ccedil;in &amp;ouml;zel olarak kullanabiliriz.&lt;/p&gt;
&lt;table id="table17" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&lt;em&gt;== gibi karşılaştırma operat&amp;ouml;rlerinin aşırı y&amp;uuml;klenmesinde tek şart, zıt operat&amp;ouml;rlerinde y&amp;uuml;klenme zorunluluğunun olmasıdır. &amp;Ouml;rneğin, == i&amp;ccedil;in !=, &amp;lt; i&amp;ccedil;in &amp;gt; operat&amp;ouml;r&amp;uuml;n&amp;uuml;n aşırı y&amp;uuml;klenmesi gibi...&lt;/em&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;&amp;Ouml;rneğimiz &amp;ccedil;ok basit olduğundan genellikle koleksiyonlarda tuttuğumuz ilk iki nesne &amp;uuml;zerinde işlem yapıyoruz. Yine bu tarz bir işlem yaptığımızı d&amp;uuml;ş&amp;uuml;nelim ve iki Dortgen nesnesinin boyutlarının aynı olması halinde eşit olduklarını g&amp;ouml;sterelim. Bunun i&amp;ccedil;in Dortgen sınıfında == ve != operat&amp;ouml;rlerini aynı anda aşırı y&amp;uuml;klemeliyiz. Aşağıdaki kodlarda Dortgen sınıfına bu işlevselliği nasıl kazandırdığımızı g&amp;ouml;rebilirsiniz.&lt;/p&gt;
&lt;p&gt;Dortgen.cs sınıfına eklenen operator metodlarımız;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public static bool operator==(Dortgen d1,Dortgen d2)
{
    if((d1.Width==d2.Width)&amp;amp;&amp;amp;(d1.Height==d2.Height))
        return true;
    else
        return false;
}

public static bool operator !=(Dortgen d1,Dortgen d2)
{
    return !(d1==d2);
}&lt;/pre&gt;
&lt;p&gt;Operat&amp;ouml;rlerin uygulama i&amp;ccedil;erisinde kullanımı;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void menuEsitmi_Click(object sender, System.EventArgs e)
{
    Dortgen d1=(Dortgen)alDortgenler[0];
    Dortgen d2=(Dortgen)alDortgenler[1];
    if(d1==d2)
    {
        MessageBox.Show("Dortgenlerin boyutları eşit...");
    }
    if(d1!=d2)
    {
        MessageBox.Show("D&amp;ouml;rtgenlerin boyutları eşit değil...");
    }
}&lt;/pre&gt;
&lt;p&gt;Eşitlik kontrol&amp;uuml;n&amp;uuml;n sonucu;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk123_3.gif" alt="" width="559" height="453" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Eşit değildir kontrol&amp;uuml;n&amp;uuml;n sonucu;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk123_4.gif" alt="" width="558" height="325" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Elbetteki aşırı y&amp;uuml;kleme yapamayacağımız operat&amp;ouml;rlerde vardır.&lt;/p&gt;
&lt;table id="table19" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;&lt;strong&gt;&lt;span class="smallblack" style="font-family: Verdana; font-size: small;"&gt;=, . , ?:, -&amp;gt;, new, is, as, sizeof ,&amp;amp;&amp;amp;, ||, () operat&amp;ouml;rlerini aşırı y&amp;uuml;klememiz yasaklanmıştır.&lt;/span&gt;&lt;/strong&gt;&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi nesnelerimiz i&amp;ccedil;in, C# dilinde var olan operat&amp;ouml;rleri aşırı y&amp;uuml;klemek son derece kolaydır. Dikkat etmemiz gereken bir takım kurallar vardır ki bunlar zamanla &amp;ouml;ğrenilebilir. Operat&amp;ouml;rlerin &amp;ouml;zellikle aşırı y&amp;uuml;klenmesine ihtiya&amp;ccedil; duyulacağı durumları g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda, grafik ve matematik uygulamalarının &amp;uuml;st sıralarda yer aldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. &amp;Ouml;rneğin sevgili Sefer ALGAN, Her Y&amp;ouml;n&amp;uuml;yle C# Kitabında operat&amp;ouml;rlerin aşırı y&amp;uuml;klenmesi ile ilgili olaraktan Kompleks sayıları incelemiştir. &amp;Ouml;zetle operat&amp;ouml;rleri aşırı y&amp;uuml;klemek &amp;ouml;zellikle kendi oluşturduğumuz nesnelerin esnekliği a&amp;ccedil;ısından &amp;ouml;nemlidir. Bu makalemizde işlediğimiz &lt;a href="/makale/images/OperOver.rar"&gt;&amp;ouml;rnekte&lt;/a&gt; bahsedilen aşırı y&amp;uuml;kleme işlemleri sadece Dortgen sınıfı i&amp;ccedil;in yapılmıştır. Size tavsiyem Elips sınıfı i&amp;ccedil;inde benzer y&amp;uuml;klemeleri yapmaya &amp;ccedil;alışmanızdır.&lt;/p&gt;</content>
  <pubDate>2005-06-03 12:00:00</pubDate>
  <slug>Operator-Overloading-(Operatörlerin-Aşırı-Yüklenmesi)-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>operator-overloading</tag>
    <tag>method-overloading</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>