<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net 2.0 ve TreeView Kontrolü</title>
  <description>Bu makalemizde, Asp.Net 2.0 ile birlikte gelen yeni kontrollerden birisi olan TreeView kontrolü ile, özellikle Xml tabanlı veri kaynaklarına ait bilgilerin, internet ortamında hiyerarşik bir yapıda nasıl gösterilebileceğini incelemeye çalışacağız. Bir önceki makalemizden hatırlayacağınız gibi, site içinde son kullanıcıya akıllı navigasyon hizmeti sunabilmek için sitemap dosyalarından faydalanabileceğimizi ve bu dosyalara ait Xml içeriğinin, SiteMapPath kontrolü ile sayfalarımızda gösterilebileceğinden bahsetmiş ve basit bir örnek geliştirmiştik. Benzer işlevselliğe TreeView kontrolü yardımıyla daha kuvvetli bir biçimde sahip olabiliriz.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bu makalemizde, Asp.Net 2.0 ile birlikte gelen yeni kontrollerden birisi olan TreeView kontrol&amp;uuml; ile, &amp;ouml;zellikle Xml tabanlı veri kaynaklarına ait bilgilerin, internet ortamında hiyerarşik bir yapıda nasıl g&amp;ouml;sterilebileceğini incelemeye &amp;ccedil;alışacağız. Bir &amp;ouml;nceki makalemizden hatırlayacağınız gibi, site i&amp;ccedil;inde son kullanıcıya akıllı navigasyon hizmeti sunabilmek i&amp;ccedil;in sitemap dosyalarından faydalanabileceğimizi ve bu dosyalara ait Xml i&amp;ccedil;eriğinin, SiteMapPath kontrol&amp;uuml; ile sayfalarımızda g&amp;ouml;sterilebileceğinden bahsetmiş ve basit bir &amp;ouml;rnek geliştirmiştik. Benzer işlevselliğe TreeView kontrol&amp;uuml; yardımıyla daha kuvvetli bir bi&amp;ccedil;imde sahip olabiliriz.&lt;/p&gt;
&lt;p&gt;TreeView kontrol&amp;uuml;, Xml tabanlı veri kaynaklarını kullanır. Bu anlamda, hiyerarşik verilerin &amp;ouml;zellikle ağa&amp;ccedil; yapısı şeklinde ifade edilmesinde kullanılmaktadır. Şimdi bir &amp;ouml;nceki makalemizde geliştirdiğimiz &amp;ouml;rneğe TreeView kontrol&amp;uuml;n&amp;uuml; ekleyerek, sitemap işleminin nasıl yapılacağını incelemeye &amp;ccedil;alışalım. &amp;Ouml;ncelikle, formumuza bir TreeView kontrol&amp;uuml; ve birde SiteMapDataSource kontrol&amp;uuml; ekleyeceğiz. TreeView kontrol&amp;uuml;n&amp;uuml;n &amp;ouml;nemli bir &amp;ouml;zelliği mutlaka bir veri kaynağına bağlanması gerekliliğidir.&lt;/p&gt;
&lt;p&gt;Oysaki SiteMapPath kontrol&amp;uuml; doğal olarak, site i&amp;ccedil;in oluşturulan sitemap dosyasına doğrudan bağlanabilmektedir. Fakat TreeView kontrol&amp;uuml; Xml tabanlı verilere bağlanbilirliğinin g&amp;uuml;c&amp;uuml;n&amp;uuml; yansıtabilmek i&amp;ccedil;in, DataSource kontrollerinden birisini kullanmak zorundadır. Bizim burada kullanacağımız SiteMapDataSource basit bir şekilde, sitenin sitemap dosyasına bağlanır ve Xml tabanlı i&amp;ccedil;eriğin node seviyesinde, TreeView kontrol&amp;uuml; ile ilişkilendirilmesini sağlar. İlk olarak bu kontrolleri ge&amp;ccedil;en &amp;ouml;rneğimizdeki default.aspx sayfasına aşağıdaki tarzda yerleştirelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk88_1.gif" alt="" width="261" height="338" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. Form Tasarımımız.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Formumuzu yukarıdaki gibi tasarladıktan sonra tek yapmamız gereken, TreeView kontrol&amp;uuml;ne veri kaynağını bildirmek olacaktır. Burada veri kaynağımız SiteMapDataSource kontrol&amp;uuml; olduğu i&amp;ccedil;in, TreeView kontrol&amp;uuml;n&amp;uuml;n DataSourceID &amp;ouml;zelliğine, bu kontrol&amp;uuml;n ID değerini atamamız yeterlidir. Bu atamayıda yaptığımız takdirde aspx kodlarımız aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:TreeView ID="TreeView1" Runat="server" DataSourceID="SiteMapDataSource1"&amp;gt;&amp;lt;/asp:TreeView&amp;gt;
&amp;lt;asp:SiteMapDataSource ID="SiteMapDataSource1" Runat="server" /&amp;gt;&lt;/pre&gt;
&lt;p&gt;Ayrıca, tasarım ekranımızda aşağıdaki g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml; alacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk88_2.gif" alt="" width="254" height="304" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. TreeView, SiteMapDataSource kontrol&amp;uuml;ne bağlandıktan sonra.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, sitemap dosyasının Xml i&amp;ccedil;eriği, SiteMapDataSource kontrol&amp;uuml; yardımıyla, TreeView kontrol&amp;uuml;ne bağlanmıştır. B&amp;ouml;ylece hiyerarşik yapının ağa&amp;ccedil; g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml; elde edilmiştir. Bu noktada, ağa&amp;ccedil; g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml;n&amp;uuml;n temel yapıtaşı olan node kavramından bahsetmekte yarar olacağını d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. TreeView kontrol&amp;uuml;n&amp;uuml;n ifade ettiği ağa&amp;ccedil; yapısında, "Azon Kitap Cd Dvd" elemanı, root node olarak adlandırılır. Root Node, başka alt node' lar i&amp;ccedil;erebilen ve hiyerarşide en &amp;uuml;st sırada yer alan node olarak değerlendirilir. Bununla birlikte bir TreeView kontrol&amp;uuml; birden fazla Root Node i&amp;ccedil;erebilmektedir. Root Node altında yer alabilecek 3 tip node daha vardır. Bunlar Parent, Child ve Leaf Node' larıdır. Bir Parent Node, Child Node' lar i&amp;ccedil;erir ve root node altında yer alır. Diğer taraftan, herhangibir Child Node i&amp;ccedil;ermeyen node' lar Leaf Node olarak adlandırılır. Node' ların mantığını okuyarak anlamak her nekadar karışık g&amp;ouml;r&amp;uuml;nsede, aşağıdaki şekil bu konuyu daha net bir şekilde a&amp;ccedil;ıklamaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk88_3.gif" alt="" width="424" height="282" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. Node Kavramı.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Tabi burada dikkat edecek olursanız, &amp;ouml;rneğin "CD ler" node' u Parent Node olmakla birlikte, Root Node' un Child Node' u olarakta değerlendirilir. Benzer şekilde, "Film CD'leri" node'u "CD ler" node' unun Child Node' u olmakla birlikte, başka alt node' lar i&amp;ccedil;ermediği i&amp;ccedil;in aynı zamanda bir Leaf Node' dur. Node' lar ile ilgili bu kısa a&amp;ccedil;ıklamalardan sonra, uygulamamızı geliştirmeye devam edelim. TreeView kontrol&amp;uuml;, kullanıcıya g&amp;ouml;rsel a&amp;ccedil;ıdan &amp;ccedil;eşitli imkanlarıda beraberinde getirmektedir. &amp;Ouml;rneğin MSDN' de kullanılan ağa&amp;ccedil; yapısının formatını TreeView kontrol&amp;uuml;n&amp;uuml;ze uygulayabilirsiniz. Ya da, aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; veren, News formatınıda kullanabilirsiniz. Bunun i&amp;ccedil;in tek yapmanız gereken, TreeView kontrol&amp;uuml;n&amp;uuml;n Auto Format &amp;ouml;zelliklerini, &amp;ouml;nceden tanımlanmış formatlardan birini se&amp;ccedil;erek tamamlamaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk88_4.gif" alt="" width="523" height="307" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. &amp;Ouml;nceden tanımlanmış News formatının TreeView kontrol&amp;uuml;ne uygulanmasının sonucu.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Dilerseniz sayfamızı &amp;ccedil;alıştıralım ve TreeView kontrol&amp;uuml;n&amp;uuml;n bize nasıl bir imkan sağladığına bakalım. Sayfamızı &amp;ccedil;alıştırdığımızda tarayıcı penceresinde TreeView kontrol&amp;uuml;n&amp;uuml;n, sitemap dosyasının i&amp;ccedil;eriğini, ağa&amp;ccedil; yapısı şeklinde aşağıdaki şekilde olduğu gibi g&amp;ouml;sterdiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk88_5.gif" alt="" width="347" height="532" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 5. Sayfamız &amp;ccedil;alıştığında.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;İşin en g&amp;uuml;zel yanı, node' lardan birisine tıkladığımızda, sitemap dosyasında o node i&amp;ccedil;in belirtilen link' e başka bir deyişle sayfaya gidebilmemizdir. &amp;Ouml;rneğin, Muzik Cd' leri sayfasına tıkladığımızda, MuzikCd.aspx sayfasına gideriz. Dolayısıyla TreeView kontrol&amp;uuml;n&amp;uuml;, onu sitemap dosyasına bağlayan SiteMapDataSource kontrol&amp;uuml; ile birlikte bir kullanıcı tanımlı kontrol olarak geliştirmemiz halinde, sitemizin t&amp;uuml;m sayfalarında son derece etkin ve şık bir navigasyon sistemine sahip olabiliriz.&lt;/p&gt;
&lt;p&gt;TreeView kontrol&amp;uuml;n&amp;uuml;n bu kullanımı dışında daha pek &amp;ccedil;ok tarz uygulanışı vardır. &amp;Ouml;ncedende s&amp;ouml;ylediğimiz gibi, bir TreeView kontrol&amp;uuml; mutlaka suretle bir veri k&amp;uuml;mesine bağlanır. Az &amp;ouml;nceki &amp;ouml;rneğimizde, bu veri kaynağı, sitemap dosyamızdı ve buraya bağlanmak i&amp;ccedil;in SiteMapDataSource kontrol&amp;uuml;n&amp;uuml; kullanmıştık. Dilersek bir TreeView kontrol&amp;uuml;n&amp;uuml;,bir Xml dosyasınada bağlayabiliriz. &amp;Ouml;rneğin aşağıdaki Xml dosyasını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. (Bu dosyayı, Veriler.xml adıyla Solution' ımıza ekledik.)&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;Manav&amp;gt;
    &amp;lt;Meyve Kategori="Elma"&amp;gt;
        &amp;lt;Miktar Deger="1 Kilo"&amp;gt;&amp;lt;/Miktar&amp;gt;
        &amp;lt;Miktar Deger="2 Kilo"&amp;gt;&amp;lt;/Miktar&amp;gt;
        &amp;lt;Miktar Deger="3 Kilo"&amp;gt;&amp;lt;/Miktar&amp;gt;
    &amp;lt;/Meyve&amp;gt;
    &amp;lt;Meyve Kategori="Kiraz"&amp;gt;
        &amp;lt;Miktar Deger="1 Kilo"&amp;gt;&amp;lt;/Miktar&amp;gt;
        &amp;lt;Miktar Deger="2 Kilo"&amp;gt;&amp;lt;/Miktar&amp;gt;
    &amp;lt;/Meyve&amp;gt;
    &amp;lt;Meyve Kategori="Karpuz"&amp;gt;
        &amp;lt;Miktar Deger="5 Kilo"&amp;gt;&amp;lt;/Miktar&amp;gt;
        &amp;lt;Miktar Deger="5 - 10 Kilo"&amp;gt;&amp;lt;/Miktar&amp;gt;
        &amp;lt;Miktar Deger="2 - 5 Kilo"&amp;gt;&amp;lt;/Miktar&amp;gt;
    &amp;lt;/Meyve&amp;gt;
    &amp;lt;Meyve Kategori="Limon"&amp;gt;
        &amp;lt;Miktar Deger="3 Tane"&amp;gt;&amp;lt;/Miktar&amp;gt;
        &amp;lt;Miktar Deger="10 Tane"&amp;gt;&amp;lt;/Miktar&amp;gt;
        &amp;lt;Miktar Deger="10-&amp;gt; Tane"&amp;gt;&amp;lt;/Miktar&amp;gt;
    &amp;lt;/Meyve&amp;gt;
&amp;lt;/Manav&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu Xml dosyasını,TreeView kontrol&amp;uuml;m&amp;uuml;ze bağlayabilmemiz i&amp;ccedil;in, bir XmlDataSource kontrol&amp;uuml;n&amp;uuml; kullanmamız gerekiyor. XmlDataSource kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n, bu Xml dosyasına işaret edebilmesi i&amp;ccedil;in tek yapmamız gereken, DataFile &amp;ouml;zelliğine ilgili Xml dosyasının adresini belirtmek olacaktır. Bunun i&amp;ccedil;in aspx kodlarımızı aşağıdaki gibi geliştirmemiz yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:XmlDataSource ID="XmlDataSource1" Runat="server" DataFile="Veriler.xml"&amp;gt;
&amp;lt;/asp:XmlDataSource&amp;gt;&lt;/pre&gt;
&lt;p&gt;Şimdi, bu XmlDataSource nesnesini kullarak, veriler.xml dosyasına bağlanacak ve i&amp;ccedil;eriğini g&amp;ouml;sterecek bir TreeView kontrol&amp;uuml;n&amp;uuml; sayfamıza ekleyelim. Bu kez, SiteMapDataSource kontrol&amp;uuml;nde olduğu gibi, TreeView kontrol&amp;uuml;n&amp;uuml;n DataSourceID &amp;ouml;zelliğine, XmlDataSource kontrol&amp;uuml;n&amp;uuml;n ID değerini atamamız tek başına yeterli olmayacaktır. Nitekim, Xml dosyasındaki node' ları, TreeView kontrol&amp;uuml;ne bind etmemiz gerekmektedir. Bunun i&amp;ccedil;in, TreeView kontrol&amp;uuml;n&amp;uuml;n &amp;lt;DataBindings&amp;gt; takısı kullanılır. Bu takı altında, her bir node i&amp;ccedil;in gerekli olan TreeNodeBinding aspx nesneleri tanımlanmalıdır. Bu bilgileri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alırsak, TreeView kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; ve XmlDataSource kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; aşağıdaki aspx kodları ile oluşturmamız gerekmektedir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:TreeView ID="trvManav" Runat="server" DataSourceID="XmlDataSource1"&amp;gt;
    &amp;lt;DataBindings&amp;gt;
        &amp;lt;asp:TreeNodeBinding DataMember="Manav" Text="Manav" Value="Manav"&amp;gt;&amp;lt;/asp:TreeNodeBinding&amp;gt;
        &amp;lt;asp:TreeNodeBinding DataMember="Meyve" TextField="Kategori"&amp;gt;&amp;lt;/asp:TreeNodeBinding&amp;gt;
        &amp;lt;asp:TreeNodeBinding DataMember="Miktar" TextField="Deger"&amp;gt;&amp;lt;/asp:TreeNodeBinding&amp;gt;
    &amp;lt;/DataBindings&amp;gt;
&amp;lt;/asp:TreeView&amp;gt;

&amp;lt;asp:XmlDataSource ID="XmlDataSource1" Runat="server" DataFile="Veriler.xml"&amp;gt;
&amp;lt;/asp:XmlDataSource&amp;gt;&lt;/pre&gt;
&lt;p&gt;Burada bizim i&amp;ccedil;in &amp;ouml;nemli olan &amp;ouml;zellikler, TreeNodeBinding kontrol&amp;uuml;ne ait olan, DataMember ve TextField &amp;ouml;zellikleridir. Şimdi, TreeView kontrol&amp;uuml;m&amp;uuml;ze yine otomatik formatlardan birisini (&amp;ouml;rneğin MSDN) uygulayalım ve sayfamızı tarayıcıda a&amp;ccedil;alım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk88_6.gif" alt="" width="160" height="346" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 6. TreeView kontrol&amp;uuml;n&amp;uuml; Xml dosyasına, XmlDataSource kontrol&amp;uuml; ile bağladığımızda.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Elbette, bu TreeView yapısını daha etkin bir şekilde kullanıma sunabiliriz. &amp;Ouml;rneğin, kullanıcı burada yer alan Leaf Node'&amp;nbsp; lardan se&amp;ccedil;im yapabilir. Bunun i&amp;ccedil;in, TreeView kontrol&amp;uuml;n&amp;uuml;n, Leaf Node' larına CheckBox koymamızı sağlayacak bir &amp;ouml;zelliği vardır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk88_7.gif" alt="" width="202" height="103" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 7. ShowCheckBoxes &amp;ouml;zelliği.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;ShowCheckBoxes &amp;ouml;zelliği ile, TreeView kontrol&amp;uuml;n&amp;uuml;n hangi node' larında CheckBox g&amp;ouml;sterileceğini belirtebiliriz. Biz bu &amp;ouml;rneğimizde leaf se&amp;ccedil;eneğini işaretleyelim. B&amp;ouml;ylece, kullanıcının hangi meyveden ka&amp;ccedil; kilo (adet) almak isteyeceğini işaretleyebileceği kutucuklarımız olacaktır. Kullanıcının, işaretlediği kutucukları elde edebilmek ve bir label kontrol&amp;uuml;nde g&amp;ouml;sterebilmek amacıylada, &amp;ouml;rneğimizi aşağıdaki şekilde olduğu gibi geliştirelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk88_8.gif" alt="" width="223" height="458" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 8. Formun son hali.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Kullanıcı, sayfada "G&amp;ouml;zden Ge&amp;ccedil;ir" başlıklı button kontrol&amp;uuml;ne tıkladığında, TreeView kontrol&amp;uuml;ne işaretlemiş olduğu miktarlar ve bu miktarların yer aldığı Parent Node' lar lblSecilenler isimli Label kontrol&amp;uuml;ne yazdırılacak. Bu işlemi ger&amp;ccedil;ekleştirmek i&amp;ccedil;in, Button' umuzun Click olayına aşağıdaki kodları yazmamız yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;void btnGozdenGecir_Click(object sender, EventArgs e)
{
    string secilenler="";
    if (trvManav.CheckedNodes.Count &amp;gt; 0)
    {
        foreach (TreeNode tn in trvManav.CheckedNodes)
        {
            secilenler += tn.Parent.Text+" "+tn.Text+"|";
        }

        lblSecilenler.Text = secilenler;
    }
    else
    {
        lblSecilenler.Text = " Manavdan bir şey almadınız...";
    }
}&lt;/pre&gt;
&lt;p&gt;TreeView kontrol&amp;uuml;n&amp;uuml;n CheckedNodes &amp;ouml;zelliği TreeNodeCollections koleksiyonu tipinden değer d&amp;ouml;nd&amp;uuml;rmektedir ve işaretlenmiş olan node' lar k&amp;uuml;mesini temsil etmektedir. Dolayısıyla if kontrol&amp;uuml;nde, Count &amp;ouml;zelliği ile, kullanıcının herhangibir node' u işaretleyip işaretlemediği, başka bir deyişle CheckBox kutucuklarını se&amp;ccedil;ip se&amp;ccedil;mediğine bakılmaktadır. Eğer se&amp;ccedil;ilmiş node' lar var ise, bu node' lar arasında gezinmek i&amp;ccedil;in, foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml; kullanılarak CheckNodes koleksiyonundaki her bir TreeNode elemanı ele alınır. TreeNode elemanları bu d&amp;ouml;ng&amp;uuml;de, Leaf Node' larımızdan işaretlenmiş olanlarına işaret etmektedir. Dolayısıyla, o anki TreeNode nesnesinin Parent &amp;ouml;zelliği, Parent Node' u işaret eder. Uygulamamızı &amp;ccedil;alıştırıp aşağıdaki gibi bir ka&amp;ccedil; se&amp;ccedil;im yaptığımız takdirde, Label kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n se&amp;ccedil;ili olan Leaf Node' lar ve bu node'ların Parent Node' ları ile doldurulduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk88_9.gif" alt="" width="357" height="324" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 9. Sayfamız &amp;ccedil;alıştığında.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. İlerleyen makalelerimizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-09-06 12:00:00</pubDate>
  <slug>Asp-Net-2-0-ve-TreeView-Kontrolu-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet-20</tag>
    <tag>treeview</tag>
  </tags>
  <categories>
    <category>Asp.Net 2.0</category>
  </categories>
</post>