<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>İlişkili Tabloları DataSet İle Kullanmak - 2</title>
  <description>Bugünkü makalemizde ilişkili tablolar arasında kısıtlamaların ( constraints ) nasıl kullanıldığını işlemey çalışacağız. Hatırlayacağınız gibi bu yazı dizisinin ilk bölümünde DataRelation sınıfını kullanarak ilişkil tabloların bellekte nasıl ifade edilebileceğini görmüştük.Bir diğer önemli konu, bu ilişkili tablolar arasındaki parent-child ilişkisinin kayıt güncelleme, kayıt silme gibi durumlarda nasıl hareket edeceğini belirlemektir.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde ilişkili tablolar arasında kısıtlamaların ( constraints ) nasıl kullanıldığını işlemey &amp;ccedil;alışacağız. Hatırlayacağınız gibi bu yazı dizisinin ilk b&amp;ouml;l&amp;uuml;m&amp;uuml;nde DataRelation sınıfını kullanarak ilişkil tabloların bellekte nasıl ifade edilebileceğini g&amp;ouml;rm&amp;uuml;şt&amp;uuml;k.Bir diğer &amp;ouml;nemli konu, bu ilişkili tablolar arasındaki parent-child ilişkisinin kayıt g&amp;uuml;ncelleme, kayıt silme gibi durumlarda nasıl hareket edeceğini belirlemektir. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Buna verilecek en g&amp;uuml;zel &amp;ouml;rnek m&amp;uuml;şterilere ait sipariş detaylarının ve buna benzer ilişkilerin yer aldığı veritabanı tasarımlarıdır. S&amp;ouml;z gelimi parent tablodan bir kayıdın silinmesi ile bu kayda bağlı child tablodaki kayıtların da silinmesi gerekebilir yada silinmemesi istenebilir. İşte bu noktada DataSet ile belleğer y&amp;uuml;klenen tablolar arasındaki bu zorlamaları bir şekilde tanımlamamız gerekmektedir. Bu zorlamalar Constraints olarak tanımlanır. Bizim i&amp;ccedil;in en &amp;ouml;neli iki kısıtlama Foreign Key Constraints ve Unique Constraints dir.&lt;/p&gt;
&lt;p&gt;Foreign Key Constraints ( Yabancı anahtar kısıtlaması ), parent-child ilişkisine sahip tablolarda kayıtların g&amp;uuml;ncelleme ve silme olaylarında nasıl hareket edeceğini belirleriz. Unique Constraints tanımlası ilede bir alanın değerlerinin asla tekrar edilemiyeceği şartını bildirmiş oluruz.Bir yababcı anahtar kısıtlaması i&amp;ccedil;in ForeignKeyConstraint sınıfı kullanılır. Aynı şekilde bir tekillik kısıtlaması i&amp;ccedil;in de UniqueConstraints sınıfı kullanılmaktadır. Her iki sınıfa ait &amp;ouml;rnek nesnelerin kullanılabilmesi i&amp;ccedil;in, ilgili tablonun Constraints koleksiyonuna eklenmesi gerekmektedir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Ş&amp;ouml;yleki, diyelimki siparişlerin tutulduğu tablodaki veriler ile sipariş i&amp;ccedil;inde yer alan &amp;uuml;r&amp;uuml;nlerin tutulduğu tablolar arasında bire-&amp;ccedil;ok bir ilişki var. Bu durumda, siparişlerin tutulduğu tablodan bir kayıt silindiğinde buradaki siparişi belirleyici alan (&amp;ccedil;oğunlukla ID olarak kullanırız) ile child tabloda yer alan ve yabancı anahtar ile parent tabloya bağlı olan alanları silmek isteyebiliriz. Burada zorlama unsurumuz parent tabloyu ilgilendirmektedir. Dolayısıyla, oluşturulacak ForeignKeyConstraints nesnesini parent tablonun Constraints koleksiyonuna ekleriz. Elbette, kısıtlamanın silme ve g&amp;uuml;ncelleme gibi işlemlerde nasıl davranış g&amp;ouml;stermesi gerektiğini belirlemek i&amp;ccedil;in, ForeignKeyConstraints&amp;rsquo;e ati bir takım &amp;ouml;zelliklerinde ayarlanması gerekir. Bunlar,&amp;nbsp;&lt;/p&gt;
&lt;div&gt;
&lt;table id="AutoNumber1" style="width: 17%;" border="1" cellspacing="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="100%"&gt;DeleteRule&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="100%"&gt;UpdateRule&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="100%"&gt;AcceptRejectRule&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;&amp;nbsp;&amp;ouml;zellikleridir. Bu &amp;ouml;zelliklere atayabileceğimiz değerler ise,&amp;nbsp;&lt;/p&gt;
&lt;div&gt;
&lt;table id="AutoNumber2" style="width: 17%; height: 93px;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="100%" height="19"&gt;Rule.Cascade&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="100%" height="16"&gt;Rule.None&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="100%" height="19"&gt;Rule.SetDefault&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="100%" height="19"&gt;Rule.SetNull&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;Cascade değeri verildiğinde g&amp;uuml;ncelleme ve silme işlemlerinden, child tablodaki kayıtlarında etkilenmesi sağlanmış olunur. S&amp;ouml;zgelimi parent tabloda bir satırın silinmesi ile ilişkili tablodaki ilişkili satırlarında t&amp;uuml;m&amp;uuml; silinir. None değeri verildiğinde tahmin edeceğiniz gibi bu değişiklikler sonunda child tabloda hi&amp;ccedil; bir değişiklik olmaz. SetDefault değeri, silme veya g&amp;uuml;ncelleme işlemleri sonucunda child tablodaki ilişkili satırların alanlarının değerlerini varsayılan değerlerine ( &amp;ccedil;oğunlukla veritabanında belirlenen ) ayarlar. SetNull verildiğinde ise bu kez, child tablodaki ilişkili satırlardaki alanların değerleri, DbNull olarak ayarlanır.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Burada AcceptRejectRule isimli bir &amp;ouml;zellikde dikkatinizi &amp;ccedil;ekmiş olmalı. Bu &amp;ouml;zellik bir DataSet, DataTable veya DataRow nesnesine ait AcceptChanges ( değişiklikleri onayla ) veya RejectChanges ( değişiklikleri iptal et) durumunda nasıl bir kıstılama olacağını belirlemek i&amp;ccedil;in kullanılır. Bu &amp;ouml;zelik Cascade veya Null değerlerinden birini alır.Bir dataSet&amp;rsquo;in kısıtlamaları uygulaması i&amp;ccedil;in EnforceConstraints &amp;ouml;zelliğine true değeri atanması gerektiğinide s&amp;ouml;yleyelim. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdi &amp;ouml;nceki makalemizde yazdığımız &amp;ouml;rnek uygulama &amp;uuml;zerinden hareket ederek, ForeignKeyConstraint tekniğini inceleyelim. Konuyu uzatmamak amacıyla aynı &amp;ouml;rnek kodları &amp;uuml;zerinden devam edeceğim. Uygulamamızda kullanıcı silemk istediği Siparis&amp;rsquo;in SiparisID bilgisini elle girecek ve silme işlemini başlatıcak. İşte bu noktada, DataSet&amp;rsquo;e eklemiş olduğumuz kısıtlama devreye girerek, Sepet tablosunda yer alan ilişkili satırlarında silinmesi ger&amp;ccedil;ekleştirilecek. Haydi gelin kodlarımızı yazalım.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection conFriends;
SqlDataAdapter daSiparis;
SqlDataAdapter daSepet;
DataTable dtSiparis;
DataTable dtSepet;
ForeignKeyConstraint fkSiparisToSepet;
DataSet ds;

private void Form1_Load(object sender, System.EventArgs e)
{
     conFriends=new SqlConnection("data source=localhost;initial catalog=Friends;integrated security=sspi");
     daSiparis=new SqlDataAdapter("Select * From Siparis",conFriends);
     daSepet=new SqlDataAdapter("Select * From Sepet",conFriends);
     dtSiparis=new DataTable("Siparisler");
     dtSepet=new DataTable("SiparisDetaylari");
     daSiparis.Fill(dtSiparis);
     daSepet.Fill(dtSepet);
     dtSiparis.PrimaryKey=new DataColumn[] {dtSiparis.Columns["SiparisID"]}; 
     /* Sıra geldi foreignKeyConstraint tanımlamamıza. */
     fkSiparisToSepet=new ForeignKeyConstraint("fkS_S",dtSiparis.Columns["SiparisID"],dtSepet.Columns["SiparisID"]); /* &amp;Ouml;ncelikle yeni bir ForeignKeyConstraint nesnesi tanımlıyoruz.*/
     fkSiparisToSepet.DeleteRule=Rule.Cascade; /* Delete işleminde uygulanacak kuralı belirliyoruz.*/
     fkSiparisToSepet.UpdateRule=Rule.Cascade;/* G&amp;uuml;ncelleme işleminde uygulanacak kuralı belirliyoruz.*/
     fkSiparisToSepet.AcceptRejectRule=AcceptRejectRule.Cascade;/* AcceptChanges ve RejectChanges metodları &amp;ccedil;ağırılıdığında uygulanacak olan kuralları belirliyoruz.*/
     ds=new DataSet();
     ds.Tables.Add(dtSiparis);
     ds.Tables.Add(dtSepet);
     ds.Tables["SiparisDetaylari"].Constraints.Add(fkSiparisToSepet);/* Oluşturduğumuz kısıtlamayı ilgili tablonun Constraints koleksiyonuna ekliyoruz. */
     ds.EnforceConstraints=true; /* Dataset'in barındırdığı kısıtlamaları uygulatmasını bildiriyoruz. False değeri atarsak dataset nesnesinin i&amp;ccedil;erdiği tablo(lara) ait      kısıtlamalar g&amp;ouml;rmezden gelinir.*/
     dataGrid1.DataSource=ds;
}
private void btnSil_Click(object sender, System.EventArgs e)
{
     try
     {
          DataRow CurrentRow=dtSiparis.Rows.Find(txtSiparisID.Text);
          CurrentRow.Delete();
     }
     catch(Exception hata)
     {
          MessageBox.Show(hata.Source+":"+hata.Message);
     }     
}&lt;/pre&gt;
&lt;p&gt;Şimdi uygulamamızı &amp;ccedil;alıştıralım. Siparis tablosuna baktığımızda aşağıdaki g&amp;ouml;r&amp;uuml;n&amp;uuml;m yer almaktadır.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &lt;img src="/makale/images/mk17_1.gif" alt="" width="294" height="326" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 1. Sipariş Verileri&lt;/em&gt;&amp;nbsp; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Siparis Detaylarının tutulduğu Sepet tablosunda ise g&amp;ouml;r&amp;uuml;n&amp;uuml;m ş&amp;ouml;yledir.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;&lt;img src="/makale/images/mk17_2.gif" alt="" width="507" height="310" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 2. Sipariş Detayları&lt;/em&gt;&amp;nbsp; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdi 10002 nolu sipariş satırını silelim. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Sepet tablosundan 10002 ile ilgili t&amp;uuml;m ilişkil kayıtlarda silinecektir. Aynı zamanda Siparis tablosundan da bu siparis numarasına ait satır silinecektir. Elbette dataSet nesnemize ait Update metodunu kullanmadığımız i&amp;ccedil;in bu değişiklikler sql sunucumuzdaki orjinal tablolara yansımayacaktır. &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &lt;img src="/makale/images/mk17_3.gif" alt="" width="498" height="310" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 3. 10002 nolu siparise ait t&amp;uuml;m kayıtlar, Sepet tablosundan Silindi.&lt;/em&gt;&amp;nbsp; &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &lt;img src="/makale/images/mk17_4.gif" alt="" width="222" height="179" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 4. 10002 Siparis tablosundan silindi.&amp;nbsp;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: justify;" align="center"&gt;Şimdi oluşturmuş olduğumuz bu kısıtlamada Delete kuralını None yapalım ve bakalım bu kez neler olucak. Bu durumda aşağıdaki hata mesajını alacağız.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &lt;img src="/makale/images/mk17_5.gif" alt="" width="640" height="122" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 5. DeleteRule=Rule.None&lt;/em&gt;&amp;nbsp; &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: justify;" align="center"&gt;Doğal olaraktanda, ne Siparis tablosundan ne de Sepet tablosundan satır silinmeyecektir. Bu kısa bilgilerden sonra umuyorumki kısıtlamalar ile ilgili kavramlarkafanızda daha net bir şekilde canlanmaya başlamıştır.&amp;nbsp;Geldik bir makalemizin daha sonuna bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&amp;nbsp;&lt;/p&gt;</content>
  <pubDate>2003-12-10 12:00:00</pubDate>
  <slug>Iliskili-Tablolarc4b1-DataSet-Ile-Kullanmak-2c2a0-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>dataset</tag>
    <tag>relations</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>