<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net 2.0 ve Code Klasörü</title>
  <description>Bu makalemizde, Asp.Net 2.0 ile gelen tanımlanmış klasörlerden (defined folders), Code klasörünün nasıl kullanıldığını incelemeye çalışacağız. Asp.Net 1.0/1.1 ile uygulama geliştirirken, solution içindeki herşey bir dll içinde (assembly) toplanır. Asp.Net 2.0 ise, dosya tabanlı (file-based) yaklaşım adı verilen yeni bir teknik kullanır. Bu tekniğe göre, solution, dosyalar ve klasörler sisteminden oluşmaktadır. Bu sistemin faydası, otomatik derleme özelliğine sahip olmasıdır.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bu makalemizde, Asp.Net 2.0 ile gelen tanımlanmış klas&amp;ouml;rlerden (defined folders), Code klas&amp;ouml;r&amp;uuml;n&amp;uuml;n nasıl kullanıldığını incelemeye &amp;ccedil;alışacağız. Asp.Net 1.0/1.1 ile uygulama geliştirirken, solution i&amp;ccedil;indeki herşey bir dll i&amp;ccedil;inde (assembly) toplanır. Asp.Net 2.0 ise, dosya tabanlı (file-based) yaklaşım adı verilen yeni bir teknik kullanır. Bu tekniğe g&amp;ouml;re, solution, dosyalar ve klas&amp;ouml;rler sisteminden oluşmaktadır. Bu sistemin faydası, otomatik derleme &amp;ouml;zelliğine sahip olmasıdır.&lt;/p&gt;
&lt;p&gt;Yani, solution i&amp;ccedil;erisine herhangibir dosya eklenmesi halinde (&amp;ouml;rneğin bir sınıf), Visual Studio.Net 2005 bu dosyayı otomatik olarak derler ve solution' ın her zaman dinamik olarak g&amp;uuml;ncel kalmasını sağlar. Bir başka deyişle yeni eklenen dosya i&amp;ccedil;in, solution' ın baştan derlenmesi gerekmez. Bu y&amp;uuml;zden, Asp.Net 2.0 ile uygulama geliştirirken ilk dikkati &amp;ccedil;eken unsur, oluşturulan sanal klas&amp;ouml;r altında eskiden olduğu gibi bin klas&amp;ouml;r&amp;uuml;n&amp;uuml;n ve bir dll dosyasının olmayışıdır.&lt;/p&gt;
&lt;p&gt;Asp.Net 2.0 ile geliştirilen bu yeni teknikte, &amp;ccedil;eşitli &amp;ouml;nceden tanımlanmış (predefined folders) &amp;ouml;zel klas&amp;ouml;r se&amp;ccedil;enekleri mevcuttur. Bunlardan biriside Code klas&amp;ouml;r&amp;uuml;d&amp;uuml;r. Code klas&amp;ouml;r&amp;uuml;, sınıf dosyalarımız, web servisleri i&amp;ccedil;in kullanılan wsdl dosyalarımız, t&amp;uuml;rlendirilmiş dataset' ler (typed datasets) i&amp;ccedil;in kullanılan xml şemaları ve Data Component' ler tipindeki dosyaları barındırılabilir. Code klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisine konulan bu dosyalar, Visual Studio.Net 2005 ortamında otomatik olarak tanınır. Ayrıca, Visual Studio.Net 2005, bu dosyaları kullanarak, sınıflara derler, proxy sınıflarını veya t&amp;uuml;rlendirilmiş veri sınıflarını oluşturur. Bu yapıyı aşağıdaki şekil ile daha kolay anlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk85_10.gif" alt="" width="291" height="577" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 1. Genel yapı.&lt;/p&gt;
&lt;p&gt;Dilerseniz konuyu daha iyi anlayabilmek amacıyla basit bir &amp;ouml;rnek geliştirelim. Bunun i&amp;ccedil;in Visual Studio.Net 2005' de yeni bir Web Site a&amp;ccedil;ıyoruz. Daha sonra Solution Explorer' da solution' ımız &amp;uuml;zerine sağ tıklıyor ve New Folder se&amp;ccedil;eneğine basarak, yeni bir klas&amp;ouml;r oluşturuyoruz. Klas&amp;ouml;r&amp;uuml;m&amp;uuml;ze Code ismini verdiğimizde, şeklinin normal klas&amp;ouml;rlerden biraz daha farklı olduğunu hemen farkedebiliriz. Nitekim Code klas&amp;ouml;r&amp;uuml;n&amp;uuml;n Solution i&amp;ccedil;in &amp;ouml;zel bir anlamı vardır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk85_1.gif" alt="" width="244" height="156" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 2. Code klas&amp;ouml;r&amp;uuml;n&amp;uuml;n eklenmesi.&lt;/p&gt;
&lt;p&gt;Şimdi default.aspx form' unuda aşağıdaki gibi oluşturalım. Bu web sayfasında basit olarak, yarı&amp;ccedil;apı verilen bir dairenin alanı hesap edilecek. Bu hesaplama işlemini yapan metodumuzu barındıracak bir sınıfımız olacak ve bu sınıfımız, Code klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisinde yer alacak.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk85_2.gif" alt="" width="348" height="124" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 3. Form tasarımımız.&lt;/p&gt;
&lt;p&gt;Şimdi, Code klas&amp;ouml;r&amp;uuml;nde sağ tıklayalım ve Add New Item' i se&amp;ccedil;elim. Karşımıza aşağıdaki dialog penceresi &amp;ccedil;ıkacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk85_3.gif" alt="" width="626" height="449" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 4. Code klas&amp;ouml;r&amp;uuml; i&amp;ccedil;in yeni bir &amp;ouml;ğe eklemek.&lt;/p&gt;
&lt;p&gt;Bu dialog pencersinde, Code klas&amp;ouml;r&amp;uuml;ne ekleyebileceğimiz dosya tipleri yer almaktadır. Biz class tipini se&amp;ccedil;eceğiz. AlanHesap.cs dosyamızın kodları aşağıda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

public class AlanHesap
{
    public AlanHesap()
    {

    }
    public double DaireAlan(double yaricap)
    {
        return 3.14 * (yaricap * yaricap);
    }
}&lt;/pre&gt;
&lt;p&gt;Bu noktadan sonra, solution' ımızı hi&amp;ccedil; derlemeden, AlanHesap sınıfımızı kullanabilir, bu sınıftan nesne &amp;ouml;rnekleri yaratabilir daha da &amp;ouml;nemlisi intelli-sense &amp;ouml;zelliğinden derhal faydalanabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk85_4.gif" alt="" width="500" height="136" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 5. Intelli-Sense &amp;Ouml;zelliği.&lt;/p&gt;
&lt;p&gt;Bu noktadan sonra, uygulamamızı oluşturduğumuz klas&amp;ouml;re bakarsak aşağıdaki yapıda olduğunu farkederiz. Dikkat edecek olursanız Asp.Net 1.0/1.1' deki gibi kalabalık bir topluluk yoktur. En &amp;ouml;nemlisi Bin klas&amp;ouml;r&amp;uuml;n&amp;uuml; veya t&amp;uuml;m uygulamanın tiplerine ait manifesto bilgilerini ve kodları barındıran bir dll g&amp;ouml;rememekteyiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk85_5.gif" alt="" width="507" height="177" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 6. Klas&amp;ouml;r Azlığı.&lt;/p&gt;
&lt;p&gt;Code klas&amp;ouml;r&amp;uuml; i&amp;ccedil;in dikkat edilecek noktalardan birisi, buradaki dosyaların tamamının single assembly olarak ele alınmalarıdır. Yani, bu klas&amp;ouml;r altındaki t&amp;uuml;m dosyalar aynı dil ile yazılmış olmalıdır. Nitekim, klas&amp;ouml;r&amp;uuml;m&amp;uuml;ze vb.net ile yazılmış aşağıdaki class dosyasını eklediğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:vb;auto-links:false;toolbar:false" contenteditable="false"&gt;Imports Microsoft.VisualBasic

Public Class VbSinif

    Public Function Deneme(ByVal yaricap As String) As String
        Return (yaricap)
    End Function

End Class&lt;/pre&gt;
&lt;p&gt;Bu durumda solution' ı derlediğimizde aşağıdaki derleme zamanı hata mesajını alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk85_6.gif" alt="" width="598" height="78" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 7. Hata Mesajı.&lt;/p&gt;
&lt;p&gt;Peki &amp;ccedil;&amp;ouml;z&amp;uuml;m nedir? B&amp;uuml;y&amp;uuml;k &amp;ccedil;aplı projelerde, farklı .net dilleri kullanılarak geliştirilen sınıfların aynı solution i&amp;ccedil;erisinde kullanılması i&amp;ccedil;in ne yapabiliriz? Bunun i&amp;ccedil;in, &amp;ouml;ncelikle Code klas&amp;ouml;r&amp;uuml; i&amp;ccedil;inde her bir dile y&amp;ouml;nelik olarak ayrı klas&amp;ouml;rler a&amp;ccedil;mamız gerekir. Aşağıdaki şekilde olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk85_7.gif" alt="" width="250" height="232" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 8. Farklı diller i&amp;ccedil;in farklı klas&amp;ouml;rler.&lt;/p&gt;
&lt;p&gt;Buradaki alt klas&amp;ouml;rleri isimlendirmek i&amp;ccedil;in belirli bir kural yoktur. Ancak buradaki isimlendirmelerin aynısını Web.Config dosyasındaki &amp;lt;compilation&amp;gt; node' unda kullanmamız gerekmektedir. Nitekim, otomatik olarak yapılan &amp;ouml;nceden derleme işlemlerinde, hangi alt klas&amp;ouml;rlerin kullanılacağının sitenin konfigurasyon ayarlarına yansıtılması gereklidir. Bunun i&amp;ccedil;in Web.Config dosyasındaki,&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;compilation debug="true"&amp;gt;

&amp;lt;/compilation&amp;gt;&lt;/pre&gt;
&lt;p&gt;kısmını aşağıdaki ile değiştirmemiz yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;compilation debug="true"&amp;gt;
    &amp;lt;codeSubDirectories&amp;gt;
        &amp;lt;add directoryName ="CSharp"/&amp;gt;
        &amp;lt;add directoryName ="VbDotNet"/&amp;gt;
    &amp;lt;/codeSubDirectories&amp;gt;
&amp;lt;/compilation&amp;gt;&lt;/pre&gt;
&lt;p&gt;Şimdi bu işlemlerin ardından default.aspx sayfasına ge&amp;ccedil;tiğimizde, vb.net ile yazdığımız sınıfa erişebildiğimizi ve kullanabildiğimizi g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk85_8.gif" alt="" width="530" height="287" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 9. Farklı dil ile yazılmış sınıfa erişim.&lt;/p&gt;
&lt;p&gt;Şimdi kodumuzu aşağıdaki gibi geliştirelim ve sayfamızı &amp;ccedil;alıştıralım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;void btnHesapla_Click(object sender, EventArgs e)
{
    AlanHesap ah = new AlanHesap();
    lblSonuc.Text = ah.DaireAlan(Convert.ToDouble(txtYaricap.Text)).ToString();

    VbSinif s = new VbSinif();
    string deger = s.Deneme(txtYaricap.Text.ToString());
    lblDeger.Text = deger;
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk85_9.gif" alt="" width="414" height="314" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 10. Farklı dil ile yazılmış sınıflar bir arada &amp;ccedil;alışıyor.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-09-01 12:00:00</pubDate>
  <slug>Asp-Net-2-0-ve-Code-Klasoru-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet-20</tag>
    <tag>app_code</tag>
  </tags>
  <categories>
    <category>Asp.Net 2.0</category>
  </categories>
</post>