<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tek Fotoluk İpucu 149 - SecureString ile Caydırıcılık</title>
  <description>Elimizde veritabanı bağlantı bilgisi, kullanıcı şifresi, uygulamamıza özel port numaraları, finansal oranlar gibi hassas olabilecek içerikleri tutan bir sınıf olduğunu düşünelim. Bu sınıfı kullanmak için doğal olarak bir şekilde örneklenmesi gerekir. Nesnenin kullanılabilir olması içeriği ile birlikte belleğe açılması anlamına da gelir. Uygulama, .Net'in çalışma zamanı ortamında kendisi için oluşturulan Application Domain içerisinde yaşar.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Elimizde veritabanı bağlantı&amp;nbsp;bilgisi, kullanıcı şifresi, uygulamamıza &amp;ouml;zel port numaraları, finansal oranlar&amp;nbsp;gibi hassas olabilecek i&amp;ccedil;erikleri&amp;nbsp;tutan bir sınıf olduğunu d&amp;uuml;ş&amp;uuml;nelim. Bu sınıfı kullanmak i&amp;ccedil;in&amp;nbsp;doğal olarak bir şekilde&amp;nbsp;&amp;ouml;rneklenmesi gerekir.&amp;nbsp;Nesnenin kullanılabilir olması&amp;nbsp;i&amp;ccedil;eriği ile birlikte belleğe a&amp;ccedil;ılması&amp;nbsp;anlamına da gelir. Uygulama, .Net'in &amp;ccedil;alışma zamanı ortamında kendisi i&amp;ccedil;in oluşturulan Application Domain i&amp;ccedil;erisinde&amp;nbsp;yaşar.&lt;/p&gt;
&lt;p&gt;Peki bu metinsel i&amp;ccedil;eriklerin bellekte g&amp;uuml;venli bir şekilde durduklarını s&amp;ouml;yleyebilir&amp;nbsp;miyiz? Belleğe a&amp;ccedil;ılan uygulamaların izlerini takip etmek aslında m&amp;uuml;mk&amp;uuml;n.&amp;nbsp;RedGate ve benzeri ara&amp;ccedil;lar yada uygulamanın &amp;ccedil;alışma zamanındaki bellek hareketliliklerini indiren&amp;nbsp;Memory Dump programları ile bu m&amp;uuml;mk&amp;uuml;n olabilir. Dolayısıyla&amp;nbsp;belleğe alınmış bir değişken i&amp;ccedil;eriğinin g&amp;uuml;venli şekilde saklanmasını sağlamamız &amp;ouml;nemlidir. SecureString sınıfı bu ihtiyacı karşılamak i&amp;ccedil;in kullanılan .Net sınıflarındandır.&amp;nbsp;Nasıl mı? Aynen aşağıdaki fotoğrafta g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/12/tfi149_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;SecureString sınıfını &amp;ouml;rnekledikten sonra&amp;nbsp;string i&amp;ccedil;eriğin &amp;ouml;nce karakter katarına d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmesi sonra her bir karakterin&amp;nbsp;AppendChar sınıfı ile ilave edilmesi s&amp;ouml;z konusu. MakeReadOnly &amp;ccedil;ağrısı ile ilgili nesne &amp;ouml;rneğinin&amp;nbsp;Immutable olması&amp;nbsp;sağlanmakta.&amp;nbsp;Protect fonksiyonunu&amp;nbsp;extension metod olarak yazdığımıza dikkat edelim. Tabii buradaki beklenti myPassword değişkeninin şifrelenmiş olarak ekrana basılması değil. Konu, belleğe yerleşen değişken i&amp;ccedil;eriğinin okunma&amp;nbsp;ihtimaline karşı şifrelenerek korunması.&lt;/p&gt;
&lt;p&gt;Elbette SecureString ile koruma altına aldığımız i&amp;ccedil;erikleri &amp;ccedil;alışma zamanı i&amp;ccedil;erisinde elde etmemiz m&amp;uuml;mk&amp;uuml;n. Aşağıdaki kod par&amp;ccedil;ası bunun sağlaması gibi d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/12/tfi149_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hafiften StringExtensions sınıfımızı ve Protect metodumuzu bozduk. Marshal tipine ait fonksiyonellikleri kullanarak da Unmanaged Code tarafına ge&amp;ccedil;erek CLR dışı alanlara bulaştık. Sadece işin sağlaması i&amp;ccedil;in yaptığımızı tekrar belirtelim. B&amp;ouml;ylece geldik bir&amp;nbsp;ipucunun daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-01-04 21:23:00</pubDate>
  <slug>tek-fotoluk-ipucu-149-securestring-ile-caydiricilik</slug>
  <tags>
    <tag>security</tag>
    <tag>tek-fotoluk-ipucu</tag>
    <tag>net</tag>
    <tag>c#</tag>
    <tag>securestring</tag>
  </tags>
  <categories>
    <category>.Net Temelleri</category>
  </categories>
</post>