<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>PLINQ - Paralellik Altında Ardışık(Sequential) Çalışmak [Beta 1]</title>
  <description>Bir önceki blog yazımızda PLINQ ifadelerinde sıralama konusuna değinmeye çalışmıştık. Bu yazımızda ise, paralel olarak çalıştırılan LINQ sorguları içerisinde, ardışık(Sequential) olarak nasıl işlem yapılabileceğini incelemeye çalışacağız.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki blog yazımızda PLINQ ifadelerinde sıralama konusuna değinmeye &amp;ccedil;alışmıştık. Bu yazımızda ise, paralel olarak &amp;ccedil;alıştırılan LINQ sorguları i&amp;ccedil;erisinde, &lt;strong&gt;ardışık(Sequential)&lt;/strong&gt; olarak nasıl işlem yapılabileceğini incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;PLINQ ifadeleri, sorgu i&amp;ccedil;erisindeki işlemleri paralel &amp;ccedil;alışan g&amp;ouml;revlere ayırmakta son derece başarılıdır. Ancak &amp;ouml;yle senaryolar olabilirki, sorgunun belirli bir noktasından(noktalarından) sonra ardışık olarak işlemlerin devam etmesi istenebilir&lt;em&gt;.(Hatta sonra tekrardan paralel&amp;nbsp;olarak devam edilmeside sağlanabilir)&lt;/em&gt;&amp;nbsp;Tabi bu şekilde anlatmaya &amp;ccedil;alışınca inanın benim kafamda karışıyor. &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;Gelin olayı basit bir &amp;ouml;rnek ile ele almaya &amp;ccedil;alışalım. İşte &lt;strong&gt;Visual Studio 2010 Professional Beta 1 &lt;/strong&gt;&amp;uuml;zerinde geliştirdiğim Console uygulamasına ait kodlar.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Data;
using System.Data.SqlClient;
using System.Linq;

namespace SequentialPLINQ
{
    class Program
    {
        static void Main(string[] args)
        {
            List&amp;lt;Product&amp;gt; productList = GetProductList();

            int tid= 0;
            var result1 = from product in productList.AsParallel()
                          where product.Color.StartsWith("B")
                          orderby product.ProductId
                          select new
                          {
                              Id = tid++,
                              product.ProductId,
                              product.Name,
                              product.ListPrice,
                              product.Color
                          };
                         

            foreach (var r in result1)
            {
                Console.WriteLine(r.Id+" \t"+r.ProductId+" "+r.Name+" "+r.Color);
            }
        }

        static List&amp;lt;Product&amp;gt; GetProductList()
        {
            List&amp;lt;Product&amp;gt; productList = new List&amp;lt;Product&amp;gt;();

            SqlConnection conn = new SqlConnection("data source=Manchester;database=AdventureWorks2008;integrated security=true");
            SqlCommand cmd = new SqlCommand("Select ProductId,Name,ListPrice,ProductNumber,Color,SafetyStockLevel From Production.Product", conn);
            conn.Open();
            SqlDataReader reader = cmd.ExecuteReader(CommandBehavior.CloseConnection);
            while (reader.Read())
            {
                productList.Add(new Product
                {
                    ProductId=Convert.ToInt32(reader[0]),
                    Name=reader[1].ToString(),
                    ListPrice=Convert.ToDecimal(reader[2]),
                    ProductNumber=reader[3].ToString(),
                    Color=reader[4].ToString(),
                    SafetyStockLevel=Convert.ToInt32(reader[5])
                }
                );
            }
            reader.Close();
            return productList;
        }
    }

    class Product
    {
        public int ProductId { get; set; }
        public string Name { get; set; }
        public decimal ListPrice { get; set; }
        public string ProductNumber{ get; set; }
        public string Color { get; set; }
        public int SafetyStockLevel { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnekte SQL Server 2008 &amp;uuml;zerinde kurulu olan,&amp;nbsp;&lt;strong&gt;AdventureWorks2008&lt;/strong&gt; veritabanındaki &lt;strong&gt;Production&lt;/strong&gt; şemasında yer alan &lt;strong&gt;Product &lt;/strong&gt;tablosuna ait veriler kullanılmaktadır. Product tablosunun kod i&amp;ccedil;erisindeki temsili i&amp;ccedil;in, Product isimli bir sınıf tasarlanmıştır. Sınıfa ait nesne &amp;ouml;rneklerinden oluşan generic &lt;strong&gt;List&amp;lt;Product&amp;gt;&lt;/strong&gt; koleksiyonunun doldurulması i&amp;ccedil;in &lt;strong&gt;GetProductList &lt;/strong&gt;metodundan yararlanılmaktadır. S&amp;ouml;z konusu generic liste &lt;strong&gt;PLINQ&lt;/strong&gt; ifadesi yardımıylada sorgulanmaktadır. Buraya kadarki kısımda zaten ilgin&amp;ccedil; bir şey yok. Dikkat edeceğimiz nokta, &lt;strong&gt;isimsiz tip(Anonymous Type)&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt;tid&lt;/strong&gt; isimli sayacın arttırılmasıdır.&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;&amp;Ouml;yleki uygulamayı &amp;ccedil;alıştırdığımızda aşağıdaki sonu&amp;ccedil;ları elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f5%2fblg21_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Burada dikkat edilmesi gereken nokta &lt;strong&gt;tid&lt;/strong&gt; değerlerinin ardışık mantığa g&amp;ouml;re değil, paralel &amp;ccedil;alışmanın bir sonucu olarak farklı sıralarda &amp;uuml;retilmesidir. Bu nedenle 1, 3, 5, 8, 74... gibi bir dizi oluşmuştur. Bu dizi kodun her &amp;ccedil;alıştırılmasında farklı şekillerde &amp;uuml;retilebilir. &amp;Ouml;rneği ikinci kez &amp;ccedil;alıştırdığımda bu kez aşağıdaki sonu&amp;ccedil;ları aldım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f5%2fblg21_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;tid&lt;/strong&gt; değerlerinin arttırımının, &amp;ccedil;ıktıya yansıyışı farklı olmaktadır. Hatta &lt;strong&gt;MSDN&lt;/strong&gt; kaynaklarında, arttırımı yapılan değerlerin tekrar etmesininde m&amp;uuml;mk&amp;uuml;n olabileceği berlitilmektedir. İşte yazmış olduğum bu anlamsız &amp;ouml;rnekteki gibi &lt;em&gt;(&amp;ouml;rneğin arttırım işlemlerinin ardışık bir şekilde ger&amp;ccedil;ekleştirilmesinin gerektiği vb...), &lt;/em&gt;paralel olarak &amp;ccedil;alışan LINQ sorguları i&amp;ccedil;erisinde, ardışık &amp;ccedil;alışması gereken b&amp;ouml;l&amp;uuml;mler var ise, &lt;strong&gt;AsSequential&lt;/strong&gt; &lt;strong&gt;genişletme metodunun(Extension&amp;nbsp;Method)&lt;/strong&gt;&amp;nbsp;kullanılması gerekmektedir. Buna g&amp;ouml;re yukarıdaki &amp;ouml;rnekte yer alan LINQ sorgusunu,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var result1 = productList
                .AsParallel()
                .Where(p =&amp;gt; p.Color.StartsWith("B"))
                .OrderBy(p =&amp;gt; p.Name)
                .AsSequential()
                .Select(
                p =&amp;gt; new
            {
                Id = tid++,
                p.ProductId,
                p.Name,
                p.ListPrice,
                p.Color
            });&lt;/pre&gt;
&lt;p&gt;şeklinde değiştirir ve &amp;ouml;rneği tekrar &amp;ccedil;alıştırırsak aşağıdaki sonu&amp;ccedil;ları elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f5%2fblg21_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;tid&lt;/strong&gt; arttırımı d&amp;uuml;zenli bir şekilde &amp;ccedil;ıktıya yansıtılmıştır. (&lt;em&gt;Yinede dikkatlice baktığınızda Name &amp;ouml;zelliğine g&amp;ouml;re yapılan sıralamalarda, her iki LINQ sorgusu arasında k&amp;uuml;&amp;ccedil;&amp;uuml;k farklar olabileceğini g&amp;ouml;rebilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil; olarak paralel olarak &amp;ccedil;alıştırılan LINQ sorguları i&amp;ccedil;erisinde, ardışık y&amp;uuml;r&amp;uuml;t&amp;uuml;lmesi gereken operasyonlar var ise bu durumda &lt;strong&gt;AsSequential&lt;/strong&gt; genişletme metodnun kullanılması gerekmektedir. Diğer taraftan elbetteki bu kullanım, s&amp;ouml;z konusu paralel &amp;ccedil;alışmanın hızını d&amp;uuml;ş&amp;uuml;recek bir etkiye neden olacaktır. Bu da g&amp;ouml;zden ka&amp;ccedil;ırılmaması gereken diğer bir noktadır.&lt;/p&gt;
&lt;p&gt;Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f5%2fSequentialPLINQ.rar"&gt;SequentialPLINQ.rar (25,80 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-05-25 11:34:00</pubDate>
  <slug>PLINQ-Paralellik-Altc4b1nda-Ardc4b1sc4b1k(Sequential)-Calc4b1smak</slug>
  <tags>
    <tag>plinq</tag>
    <tag>linq</tag>
  </tags>
  <categories>
    <category>LINQ</category>
    <category>PLINQ</category>
  </categories>
</post>