<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Command Kavramı ve OleDbCommand Sınıfı</title>
  <description>Bu makalemizde, Ado.Net mimarisi içinde çok önemli bir yere sahip olan Command kavramını ve OleDbCommand sınıfına ait en temel üyeleri incelemeye çalışacağız. Veritabanı uygulamaları geliştiren her programcı mutlaka, veri kaynağına doğru bir takım sorgu komutlarına ihtiyaç duymaktadır. Örneğin, veri kaynağındaki bir tabloya yeni bir satır eklemek için, veri kaynağı üzerinde bir tablo yaratmak için veya veri kaynağından belli şartlara uyan veri kümelerini çekmek için vb... Tüm bu işlemler için Ado.Net mimarisi bize, sql sorgularını barındırabileceğimiz ve geçerli bir bağlantı hattı üzerinden çalıştırabileceğimiz Command sınıfını sunmaktadır. Şu an itibariyle, Ado.Net mimarisi 4 temel Command sınıfı içerir. Bunlar, OleDbCommand, SqlCommand, OracleCommand ve OdbcCommand sınıflarıdır.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, Ado.Net mimarisi i&amp;ccedil;inde &amp;ccedil;ok &amp;ouml;nemli bir yere sahip olan Command kavramını ve OleDbCommand sınıfına ait en temel &amp;uuml;yeleri incelemeye &amp;ccedil;alışacağız. Veritabanı uygulamaları geliştiren her programcı mutlaka, veri kaynağına doğru bir takım sorgu komutlarına ihtiya&amp;ccedil; duymaktadır. &amp;Ouml;rneğin, veri kaynağındaki bir tabloya yeni bir satır eklemek i&amp;ccedil;in, veri kaynağı &amp;uuml;zerinde bir tablo yaratmak i&amp;ccedil;in veya veri kaynağından belli şartlara uyan veri k&amp;uuml;melerini &amp;ccedil;ekmek i&amp;ccedil;in vb... T&amp;uuml;m bu işlemler i&amp;ccedil;in Ado.Net mimarisi bize, sql sorgularını barındırabileceğimiz ve ge&amp;ccedil;erli bir bağlantı hattı &amp;uuml;zerinden &amp;ccedil;alıştırabileceğimiz Command sınıfını sunmaktadır. Şu an itibariyle, Ado.Net mimarisi 4 temel Command sınıfı i&amp;ccedil;erir. Bunlar, OleDbCommand, SqlCommand, OracleCommand ve OdbcCommand sınıflarıdır.&lt;/p&gt;
&lt;p&gt;Bahsetmiş olduğumuz bu 4 Command sınıfıda temelde aynı g&amp;ouml;revler i&amp;ccedil;in tasarlanmışlardır. Farklılık sadece işaret ettikleri veri kaynkalarından ibarettir. Hepsinin g&amp;ouml;revleri ortaktır. Kullanıldıkları veri kaynakları &amp;uuml;zerinde sql ifadelerinden oluşturulan komutları &amp;ccedil;alıştırmak. Bunun i&amp;ccedil;in elbette ihtiyacımız olan en &amp;ouml;nemli kaynak ge&amp;ccedil;erli bir bağlantı hattının ve bu hattın eriştiği veri kaynağı i&amp;ccedil;in ge&amp;ccedil;erli bir sql ifadesinin olmasıdır. Command sınıfları, &amp;ccedil;alıştıracakları sql ifadelerini temsil eden nesneler oldukları i&amp;ccedil;in Command (Komut) terimini b&amp;uuml;nyelerinde barındırırlar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, Command sınıflarından OleDbCommand sınıfını incelemeye &amp;ccedil;alışacağız. OleDbCommand sınıfı, OleDb veri sağlayıcısı tarafından erişilebilen kaynaklar &amp;uuml;zerinde sql ifadelerini &amp;ccedil;alıştırmamıza izin verir. OleDbCommand sınıfına ait nesne &amp;ouml;rneğini oluşturmak i&amp;ccedil;in kullanabileceğimiz &amp;uuml;&amp;ccedil; farklı yol vardır. Bunlardan ilki OleDbCommand nesnesini new yapılandırıcısı ile her hangibir komut s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; i&amp;ccedil;ermeden oluşturmaktır. Bu teknik i&amp;ccedil;in kullanılan yapıcı metodun prototipi aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public OdbcCommand();&lt;/pre&gt;
&lt;p&gt;Bu teknik ile oluşturulan bir komut nesnesi i&amp;ccedil;in bir takım &amp;ouml;zellikleri sonradan belirleyebiliriz. &amp;Ouml;ncelikle ge&amp;ccedil;erli bir bağlantı nesnesine yani bir OleDbConnection nesnesine ihtiyacımız vardır. Diğer gereklilik ise, OleDbCommand sınıfı nesne &amp;ouml;rneğinin, &amp;ccedil;alıştıracağı sql ifadesidir. Bu ama&amp;ccedil;lar i&amp;ccedil;in OleDbCommand sınıfının Connection ve CommandText &amp;ouml;zelliklerini kullanırız. Yukarıdaki teknik ile oluşturduğumuz bir OleDbCommand nesnesi i&amp;ccedil;in Connection &amp;ouml;zelliği null, CommandText &amp;ouml;zelliği ise boş bir string'e işaret etmektedir. Bu tekniği daha iyi anlamak i&amp;ccedil;in basit bir &amp;ouml;rnek geliştirelim. &amp;Ouml;rneğin, Sql Sunucumuzda yer alan Friends isimli veri tabanındaki taboya bir satır veri gireceğimiz aşağıdaki sql ifadesini &amp;ccedil;alıştıracak bir komut tasarlamak istediğimizi varsayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Insert Into Siteler (Baslik,Adres,Resim,Icerik) Values('C#','www.csharpnedir.com','images/resim1.jpg','C# &amp;uuml;zerine her t&amp;uuml;rl&amp;uuml; makale.')&lt;/pre&gt;
&lt;p&gt;Bunun i&amp;ccedil;in yazacağımız kodlar aşağıdadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

using System.Data.OleDb; /* OleDbCommand sınıfı bu isim uzayında yer almaktadır. */

namespace OleDbCmd1
{
  class Class1
  {
    static void Main(string[] args)
    {
      /* &amp;Ouml;nce ge&amp;ccedil;erli bir bağlantı hattı oluşturmamız gerekiyor. */

      OleDbConnection con=new OleDbConnection("Provider=SQLOLEDB;data source=localhost;initial catalog=Friends;integrated security=sspi");

      OleDbCommand cmd=new OleDbCommand(); /* Komut nesnemiz oluşturuluyor. */

      cmd.Connection=con; /* Komut nesnesinin hangi bağlantı hattını kullanacağı belirleniyor. */

        cmd.CommandText="Insert Into Siteler (Baslik,Adres,Resim,Icerik) Values ('C#','www.csharpnedir.com','images/resim1.jpg','C# &amp;uuml;zerine her t&amp;uuml;rl&amp;uuml; makale.')"; /* Komutun &amp;ccedil;alıştıracağı sql ifadesi belirleniyor. */
.
.
.
    }
  }
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi OleDbCommand sınıfını oluşturduktan sonra Connection ve CommandText &amp;ouml;zellikleri belirleniyor. Diğer yandan, bir OleDbCommand nesnesini aşağıda prototipi olan diğer yapıcı metodu ilede oluşturabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public OleDbCommand(string cmdText, OleDbConnection connection);&lt;/pre&gt;
&lt;p&gt;Bu yapıcı metodumuz parametre olarak sql ifadesini string veri tipinde ve bağlantı nesnesinide OleDbConnection sınıfı tipinde almaktadır. Bu haliyle yukarıda yazdığımız kodları dahada kısaltabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

using System.Data.OleDb; /* OleDbCommand sınıfı bu isim uzayında yer almaktadır. */

namespace OleDbCmd1
{
  class Class1
  {
    static void Main(string[] args)
    {
      /* &amp;Ouml;nce ge&amp;ccedil;erli bir bağlantı hattı oluşturmamız gerekiyor. */

      OleDbConnection con=new OleDbConnection("Provider=SQLOLEDB;data source=localhost;initial catalog=Friends;integrated security=sspi");

      OleDbCommand cmd=new OleDbCommand("Insert Into Siteler (Baslik,Adres,Resim,Icerik) Values('C#','www.csharpnedir.com','images/resim1.jpg','C# &amp;uuml;zerine her t&amp;uuml;rl&amp;uuml; makale.')",con);

.
.
.
    }
  }
}&lt;/pre&gt;
&lt;p&gt;OleDbCommand nesnesinin oluşturmak i&amp;ccedil;in bahsettiğimiz bu iki yol dışında kullanabileceğimiz iki aşırı y&amp;uuml;klenmiş metod daha vardır. Bunların protoipleride aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public OleDbCommand(string cmdText);&lt;/pre&gt;
&lt;p&gt;Bu prototip sadece sql ifadesini almaktadır. Komut nesnesine ait diğer &amp;ouml;zellikler (Connection gibi) sonradan belirlenir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public OleDbCommand(string cmdText, OleDbConnection connection, OleDbTransaction transaction);&lt;/pre&gt;
&lt;p&gt;Bu prototip ise, komut ifadesi ve bağlantı nesnesi haricinde birde OleDbTransaction nesnesi tipinden bir parametre alır. Bu prototip &amp;ccedil;oğunlukla, bir iş par&amp;ccedil;acığı i&amp;ccedil;ine alınmak istenen komut nesneleri i&amp;ccedil;in idealdir. Bir OleDbCommand nesnesi oluşturabilmek i&amp;ccedil;in kullanabileceğimiz son yol ise OleDbConnection sınıfına ait CreateCommand metodunun aşağıdaki &amp;ouml;rnekte olduğu gibi kullanılmasıdır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

using System.Data.OleDb; /* OleDbCommand sınıfı bu isim uzayında yer almaktadır. */

namespace OleDbCmd1
{
  class Class1
  {
    static void Main(string[] args)
    {
      /* &amp;Ouml;nce ge&amp;ccedil;erli bir bağlantı hattı oluşturmamız gerekiyor. */

      OleDbConnection con=new OleDbConnection("Provider=SQLOLEDB;data source=localhost;initial catalog=Friends;integrated security=sspi");

      OleDbCommand cmd=con.CreateCommand();
      cmd.CommandText="Insert Into Siteler (Baslik,Adres,Resim,Icerik) Values('C#','www.csharpnedir.com','images/resim1.jpg','C# &amp;uuml;zerine her t&amp;uuml;rl&amp;uuml; makale.')";
.
.
.
    }
  }
}&lt;/pre&gt;
&lt;p&gt;Bu teknikte, ge&amp;ccedil;erli olan bağlantı nesnesinin tesis ettiği hat &amp;uuml;zerinde &amp;ccedil;alışacak OleDbCommand sınıfı nesne &amp;ouml;rneği, CreateCommand metodu ile oluşturulmuştur. Bu adımdan sonra tek yapılması gereken CommandText &amp;ouml;zelliğine sql c&amp;uuml;mleciğini atamak olucaktır.&lt;/p&gt;
&lt;p&gt;T&amp;uuml;m bu teknikler bir OleDbCommand sınıfı nesne &amp;ouml;rneğini oluşturmak i&amp;ccedil;indir. Ancak komutu &amp;ccedil;alıştırmak i&amp;ccedil;in hen&amp;uuml;z bir adım atmış değiliz. Bu haliye program kodlarımız derlense dahi hi&amp;ccedil; bir işe yaramıyacaktır. Nitekim, OleDbCommand nesnelerinin temsil ettiği sql c&amp;uuml;mleciklerini &amp;ccedil;alıştırmamız gerekmektedir. Bu ama&amp;ccedil;la kullanabileceğimiz &amp;uuml;&amp;ccedil; OleDbCommand metodu vardır. Bunlar; ExecuteNonQuery, ExecuteReader ve ExecuteScalar metodlarıdır. &amp;Uuml;&amp;ccedil; metodda farklı ama&amp;ccedil;lar ve performanslar i&amp;ccedil;in kullanılır. Bu ama&amp;ccedil;lar, &amp;ccedil;alıştırmak istediğimiz sql ifadesine g&amp;ouml;re değişiklik g&amp;ouml;stermektedir. S&amp;ouml;z gelimi, yukarıdaki kod par&amp;ccedil;alarında yer alan sql ifadesi DDL (Data Defination Language- Veri Tanımlama Dili) komutlarından birisidir. Benzer şekilde update, delete sorgularıda b&amp;ouml;yledir. Diğer taraftan DML (Data Manipulation Language- Veri İdare Dili) komutları dediğimiz Create Table, Alter Table gibi komutlarda mevcuttur. Bu iki kategoriye ait komutlar, etki komutları olarakta adlandırılırlar. Hepsinin ortak &amp;ouml;zelliği geriye sonu&amp;ccedil; d&amp;ouml;nd&amp;uuml;rmemeleridir. Tamamiyle veri kaynağı &amp;uuml;zerinde bir takım sonu&amp;ccedil;ların doğmasına yardımcı olurlar. İşte bu tip komut c&amp;uuml;mlecikleri i&amp;ccedil;in, ExecuteNonQuery metodu kullanılır. Bu metodun prototipi aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public virtual int ExecuteNonQuery();&lt;/pre&gt;
&lt;p&gt;Bu metod g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi int veri tipinden bir tamsayıyı geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Bu sayı komutun &amp;ccedil;alıştırılması sonucu etkilenen kayıt sayısını ifade etmektedir. Dolayısıyla bu metod, DDL ve DML komutları i&amp;ccedil;in geliştirilmiştir diyebiliriz. &amp;Ouml;rneğin, yukarıdaki kod par&amp;ccedil;alarını hayat ge&amp;ccedil;irelim. Bunun i&amp;ccedil;in aşağıdaki kodları yazacağız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

using System.Data.OleDb; /* OleDbCommand sınıfı bu isim uzayında yer almaktadır. */

namespace OleDbCmd1
{
  class Class1
  {
    static void Main(string[] args)
    {
      /* &amp;Ouml;nce ge&amp;ccedil;erli bir bağlantı hattı oluşturmamız gerekiyor. */

      OleDbConnection con=new OleDbConnection("Provider=SQLOLEDB;data source=localhost;initial catalog=Friends;integrated security=sspi");

      OleDbCommand cmd=new OleDbCommand("Insert Into Siteler (Baslik,Adres,Resim,Icerik) Values('C#','www.csharpnedir.com','images/resim1.jpg','C# &amp;uuml;zerine her t&amp;uuml;rl&amp;uuml; makale.')",con);

      try
      {
          con.Open(); /* Bağlantımızı a&amp;ccedil;ıyoruz.*/
          int sonuc=cmd.ExecuteNonQuery(); /* Komutumuzu &amp;ccedil;alıştırıyoruz.ExecuteNonQuery metodunun d&amp;ouml;nd&amp;uuml;receği değeri tam sayı tipindeki sonuc değişkenine atıyoruz.*/

          Console.WriteLine(sonuc.ToString()+" Kayıt Girildi...");
      }
      catch(Exception hata)
      {
          Console.WriteLine(hata.Message.ToString());
      }
      finally
      {
         con.Close();
      }
    }
  }
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdaki sonucu alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk56_1.gif" alt="" width="317" height="103" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. ExecuteNonQuery sonucu geri d&amp;ouml;nen değer.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdi birde aşağıdaki &amp;ouml;rneğe bakalım. Bu kez elimizde, tablomuzun t&amp;uuml;m satırlarındaki Resim alanlarının değerlerinin sonuna img ifadesini eklyecek sql ifadesini i&amp;ccedil;eren bir OleDbCommand nesnemiz olsun.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

using System.Data.OleDb; /* OleDbCommand sınıfı bu isim uzayında yer almaktadır. */

namespace OleDbCmd1
{
  class Class1
  {
    static void Main(string[] args)
    {
      OleDbConnection con=new OleDbConnection("Provider=SQLOLEDB;data source=localhost;initial catalog=Friends;integrated security=sspi");

      OleDbCommand cmdUpdate=new OleDbCommand("Update Siteler Set Resim=Resim+'img' ",con);

      try
      {
         con.Open();
         int Guncellenen=cmdUpdate.ExecuteNonQuery();
         Console.WriteLine(Guncellenen.ToString()+" Kayıt G&amp;uuml;ncellendi");
      }
      catch(Exception hata)
      {
         Console.WriteLine(hata.Message.ToString());
      }
      finally
      {
         con.Close(); 
      }
    }
  }
}&lt;/pre&gt;
&lt;p&gt;Bu durumda aşağıdaki sonucu alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk56_2.gif" alt="" width="522" height="235" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. Update komutu sonucu ExecuteNonQuery'nin d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml; değer.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi tablomuzdaki 5 kayıdın hepsi g&amp;uuml;ncellenmiş ve ExecuteNonQuery geriye 5 değerini d&amp;ouml;nd&amp;uuml;rm&amp;uuml;şt&amp;uuml;r. Bu &amp;ccedil;alıştırılan komut sonucu etkilenen kayıt sayısını &amp;ouml;ğrenmek i&amp;ccedil;in iyi ve etkili bir yoldur. ExecuteNonQuery metodu ile ilgili unutulmaması gereken nokta, bu metodun geriye her hangibir sonu&amp;ccedil; k&amp;uuml;mesi, her hangibir &amp;ccedil;ıkış parametresi veya &amp;ccedil;ıkış değeri d&amp;ouml;nd&amp;uuml;rmemesidir. Elbette uygulamalarımızda, veri kaynaklarından veri k&amp;uuml;meleri &amp;ccedil;ekme ihtiyacını hissederiz. B&amp;ouml;yle bir durumda ise, ExecuteReader metodunu kullanabiliriz. ExecuteReader metodu, &amp;ccedil;alıştırılan komut sonucu elde edilen sonu&amp;ccedil; k&amp;uuml;mesinden bir OleDbDataReader nesnesi i&amp;ccedil;in veri akışını sağlar. OleDbDataReader nesnesinin benzeri olan SqlDataReader nesnesi ve ExecuteReader metodunun kullanımını, SqlDataReader nesneleri ile ilgili makelelerimizde incelediğimiz i&amp;ccedil;in bu metodun nasıl kullanıldığına tekrar değinmiyorum.&lt;/p&gt;
&lt;p&gt;OleDbCommand sınıfına ait bir diğer veri elde etme metodu ExecuteScalar metodudur. Prototipi aşağıdaki gibi olan bu metod sadece tek alanlık veri d&amp;ouml;nd&amp;uuml;ren sql sorguları i&amp;ccedil;in kullanılır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public virtual object ExecuteScalar();&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rneğin tablomuzdaki kayıt sayısının &amp;ouml;ğrenmek istiyoruz veya tablomuzdaki ucretler adlı alanda yer alan iş&amp;ccedil;i &amp;uuml;cretlerinin ortalamasının ne olduğunu bilmek istiyoruz yada primary key alanı &amp;uuml;zerinden arama yaptığımız bir satıra ait tek bir s&amp;uuml;tunun değerini elde etmek istiyoruz. Bu tarz durumlarda, &amp;ccedil;alışıtırılacak olan komut i&amp;ccedil;in bilgileri ExecuteReader metodu ile almak veya bilgileri bir DataSet k&amp;uuml;mesi i&amp;ccedil;ine almak vb... sistem kaynaklarının gereksiz yer harcanmasına ve perfrormansın olumsuz şekilde etkilenerek azalmasına neden olur. &amp;Ccedil;are ExecuteScalar metodunu kullanmaktır. &amp;Ouml;rneğin;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

using System.Data.OleDb; /* OleDbCommand sınıfı bu isim uzayında yer almaktadır. */

namespace OleDbCmd1
{
  class Class1
  {
    static void Main(string[] args)
    {
      OleDbConnection con=new OleDbConnection("Provider=SQLOLEDB;data source=localhost;initial catalog=Friends;integrated security=sspi");

      OleDbCommand cmd=new OleDbCommand("Select Baslik From Siteler Where ID=8",con);

      OleDbCommand cmdToplamSite=new OleDbCommand("Select Count(*) From Siteler",con);

      try
      {
         con.Open();
         Console.WriteLine("ID=8 olan satırın Baslik alanının değeri: "+cmd.ExecuteScalar().ToString());

         Console.WriteLine("Site Sayısı: "+cmdToplamSite.ExecuteScalar().ToString());
      }
      catch(Exception hata)
      {
         Console.WriteLine(hata.Message.ToString());
      }
      finally
      {
         con.Close();
      }
    }
  }
}&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;&lt;img src="/makale/images/mk56_3.gif" alt="" width="389" height="115" border="0" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. ExecuteScalar Sonucu.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu &amp;ouml;rnekte, Siteler isimli tablomuza ID değeri 8 olan satırın sadece Baslik isimli alanının değerini veren bir komut nesnesi ve Siteler tablsundaki satır sayısını veren başka bir komut nesnesi kullanılmıştır. Her iki sql ifadeside tek bir h&amp;uuml;creyi sonu&amp;ccedil; olarak d&amp;ouml;nd&amp;uuml;rmektedir. Eğer sql ifadenizden birden fazla s&amp;uuml;tun alıyorsanız ve bu ifadeyi ExecuteScalar ile &amp;ccedil;alıştırıyorsanız, ilk satırın ilk s&amp;uuml;tunu haricindeki t&amp;uuml;m veriler g&amp;ouml;z ardı edilecektir. S&amp;ouml;z gelimi yukarıdaki &amp;ouml;rneğimizde, cmd OleDbCommand nesnesinin CommandText ifadesini aşağıdaki gibi değiştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;OleDbCommand cmd=new OleDbCommand("Select * From Siteler",con);&lt;/pre&gt;
&lt;p&gt;Bu durumda aşağıdaki sonucu elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk56_4.gif" alt="" width="421" height="103" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. ExecuteScalar sadece ilk h&amp;uuml;creyi d&amp;ouml;nd&amp;uuml;r&amp;uuml;r.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi sonu&amp;ccedil; olarak, ilk satırın ilk alanının değeri elde edilmiştir. (ID alanının değeri.) OleDbCommand sınıfı ile veri kaynağında yer alan bir saklı yordamıda (Stored Procedure) &amp;ccedil;alıştırabiliriz. Bu durumda CommandText olarak bu saklı yordamın adını girmemiz yeterli olucaktır. Ancak, &amp;ccedil;alıştırılacak olan komutun bir saklı yordamı &amp;ccedil;alıştıracağını belirtmemiz gerekmektedir. İşte bu noktada OleDbConnection sınıfı nesne &amp;ouml;rneğinin CommandType &amp;ouml;zelliğinin değerini belirtmemiz gerekir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public virtual CommandType CommandType {get; set;}&lt;/pre&gt;
&lt;p&gt;Prototipi yukarıdaki gibi olan bu &amp;ouml;zellik, CommandType numaralandırıcısı t&amp;uuml;r&amp;uuml;nden 3 değer alabilir. Bu değerler ve ne işe yaradıkları aşağıdaki tabloda belirtilmiştir.&lt;/p&gt;
&lt;table id="AutoNumber21" style="width: 640px; height: 215px;" border="1" cellspacing="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td bgcolor="#cccccc" width="193" height="35"&gt;&lt;strong&gt; CommandType Değeri&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#cccccc" width="495" height="35"&gt;&lt;strong&gt; A&amp;ccedil;ıklaması&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="193" height="32"&gt;Text&lt;/td&gt;
&lt;td width="495" height="32"&gt;Sql ifadelerini &amp;ccedil;alıştırmak i&amp;ccedil;in kullanılır. Bu aynı zamanda OleDbCommand sınıfına ait nesne &amp;ouml;rnekleri i&amp;ccedil;in varsayılan değerdir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="193" height="32"&gt;StoredProcedure&lt;/td&gt;
&lt;td width="495" height="32"&gt;Veri kaynağında yer alan bir Saklı Yordam &amp;ccedil;alıştırılmak istendiğinde, CommandType değerine StoredProcedure verilir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="193" height="64"&gt;TableDirect&lt;/td&gt;
&lt;td width="495" height="64"&gt;CommandType &amp;ouml;zelliğine bu değer atandığında, CommandText &amp;ouml;zelliği tablo adını alır. Komut &amp;ccedil;alıştırıldığında &amp;ccedil;alışan sql ifadesi "Select * From tabloadi" ifadesidir. B&amp;ouml;ylece belirtilen tablodaki t&amp;uuml;m kayıtlar d&amp;ouml;nd&amp;uuml;r&amp;uuml;lm&amp;uuml;ş olur.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;em&gt;Tablo 1. CommandType numaralandırıcısının değerleri.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdi bu &amp;ouml;zelliklerin nasıl kullanılacağını tek tek incelemeye &amp;ccedil;alışalım. &amp;Ouml;ncelikle TableDirect değerinden başlayalım. Tek yapmamız gereken t&amp;uuml;m satırlarını elde etmek istediğimiz tablo adını CommandText olarak belirtmek olucaktır. İşte &amp;ouml;rneğimiz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data.OleDb;
using System.Data;
namespace OleDbCmd1
{
  class Class1
  {
    static void Main(string[] args)
    {
      OleDbConnection con=new OleDbConnection("Provider=SQLOLEDB;data source=localhost;initial catalog=Friends;integrated security=sspi");

      OleDbCommand cmd=new OleDbCommand("Makale",con); /* Komut s&amp;ouml;z dizimi olarak t&amp;uuml;m satırlarını almak istediğimi veri tablosunun adını giriyoruz. */
      cmd.CommandType=CommandType.TableDirect; /* Komut tipimizi TableDirect olarak ayarlayıp, komut nesnemizin sql ifadesinin Select * From Makale olmasını sağlıyoruz. */

      try
      {
         con.Open();
      /* Bir OleDbDataReader nesnesi tanımlayıp, komutumuzu ExecuteReader metodu ile &amp;ccedil;alıştırarak, sonu&amp;ccedil; k&amp;uuml;mesine ait satırlardaki Konu alanının değerlerini ekrana yazdırıyoruz. */

         OleDbDataReader dr;
         dr=cmd.ExecuteReader();
         while(dr.Read())
         {
            Console.WriteLine(dr["Konu"].ToString());
         }
         dr.Close();
      }
      catch(Exception hata)
      {
         Console.WriteLine(hata.Message.ToString());
      }
      finally
      {
         con.Close();
      }
    }
  }
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda, Makale tablosundaki t&amp;uuml;m satırların alındığı sonu&amp;ccedil; k&amp;uuml;mesi i&amp;ccedil;inden,&amp;nbsp; Konu alanlarının değerlerinin ekrana yazdırıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk56_5.gif" alt="" width="461" height="235" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 5. TableDirect sonucu.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Ancak burada istisnai bir durum vardır. Bazı tablo isimleri i&amp;ccedil;inde boşluklar olabilir. &amp;Ouml;rneğin "Site Adlari" isminde bir tablomuz olduğunu d&amp;uuml;ş&amp;uuml;nelim. B&amp;ouml;yle bir durumda TableDirect değerinin sonucunda bir istisnanın fırlatıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Yukarıdaki &amp;ouml;rneğimizde tablo adı olarak Site Adlari verdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data.OleDb;
using System.Data;

namespace OleDbCmd1
{
  class Class1
  {
    static void Main(string[] args)
    {
      OleDbConnection con=new OleDbConnection("Provider=SQLOLEDB;data source=localhost;initial catalog=Friends;integrated security=sspi");

      OleDbCommand cmd=new OleDbCommand("Site Adlari",con);

      cmd.CommandType=CommandType.TableDirect;
      try
      {
         con.Open();
         OleDbDataReader dr;
         dr=cmd.ExecuteReader();

         while(dr.Read())
         {
            Console.WriteLine(dr["Baslik"].ToString());
         }
         dr.Close();
      }
      catch(Exception hata)
      {
         Console.WriteLine(hata.Message.ToString());
      }
      finally
      {
         con.Close();
      }
    }
  }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk56_6.gif" alt="" width="245" height="91" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 6. Tablonun olmadığı s&amp;ouml;yleniyor.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bunun sebebi OleDbCommand nesnesinin tablo isminde yer alan boşlukları anlamamış olmasıdır. Bu nedenle aynı ifadeyi aşağıdaki şekilde değiştirmemiz gerekmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;OleDbCommand cmd=new OleDbCommand("[Site Adlari]",con);&lt;/pre&gt;
&lt;p&gt;Bu durumda uygulamanın sorunsuz &amp;ccedil;alıştığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. OleDbCommand sınıfının CommandType &amp;ouml;zelliğinin diğer değeri ise StoredProcedure' d&amp;uuml;r. Bu veri kaynağındaki saklı yordamlarının &amp;ccedil;ağırılması i&amp;ccedil;in kullanılmaktadır. Bir saklı yordam kendisi i&amp;ccedil;in parametreler alabileceği gibi geriye değerlerde d&amp;ouml;nd&amp;uuml;rebilir. &amp;Ouml;rneğin, Primary Key alanları &amp;uuml;zerinden arama yapılan sorgularda Saklı Yordamların kullanılması son derece verimlidir. Nitekim kullanıcıların aramak i&amp;ccedil;in girdikleri her ID değeri i&amp;ccedil;in ayrı bir select sorgusu oluşturmak yerine, veri kaynağında bir nesne olarak yer alan ve ID değerini parametre olarak alan hazır, derlenmiş bir select ifadesini &amp;ccedil;alıştırmak daha verimli olucaktır. &amp;Ouml;rneğin Makale isimli tablomuzdan ID alanı 41 olan bir satırı elde etmek istiyoruz. Bu durumda, buradaki saklı yordamımıza bu ID değerini ge&amp;ccedil;irmemiz ve d&amp;ouml;nen sonu&amp;ccedil;ları almamız gerekiyor. &amp;Ouml;ncelikle saklı yordamımıza bir g&amp;ouml;z atalım.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;ALTER PROCEDURE dbo.MakaleBul
(
@MakaleID int
)
AS
SELECT * FROM Makale Where ID=@MakaleID
RETURN&lt;/pre&gt;
&lt;p&gt;Bu saklı yordam ID değerine @MakaleID isminde bir parametre alır. Bu parametre değeri ile tablodaki ilgili satır aranır.Bu satır bulunduğunda, geriye bu satırdaki t&amp;uuml;m alanlar aktarılır. Şimdi uygulamamızda bunun nasıl kullanacağımızı g&amp;ouml;relim. &amp;Ouml;ncelikle OleDbCommand sınıfı nesne &amp;ouml;rneğimizi bu saklı yordam ismini CommandText değeri olacak şekilde oluştururuz. Daha sonra, CommandType &amp;ouml;zelliğine StoredProcedure değerini veririz. B&amp;ouml;ylece, CommandText &amp;ouml;zelliğindeki s&amp;ouml;z diziminin bir saklı yordamı temsil ettiğini ifade etmiş oluruz. Geriye parametre kalır. OleDbCommand sınıfı, parametrelerini OleDbParameterCollection koleksiyonunda birer OleDbParameter nesnesi olarak tutmaktadır. Dikkat etmemiz gereken nokta parametre adının , saklı yordamdaki ile aynı olmasıdır.&amp;nbsp; Dilerseniz kodlarımızı yazalım ve bu işlemin nasıl yapıldığını g&amp;ouml;relim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data.OleDb;
using System.Data;

namespace OleDbCmd1
{
  class Class1
  {
    static void Main(string[] args)
    {
      OleDbConnection con=new OleDbConnection("Provider=SQLOLEDB;data source=localhost;initial catalog=Friends;integrated security=sspi");

      OleDbCommand cmd=new OleDbCommand("MakaleBul",con); /* &amp;Ccedil;alıştırılacak sql ifadesi olarak saklı yordamımızın ismini giriyoruz. */

      cmd.CommandType=CommandType.StoredProcedure; /* CommandText ifadesinin, ge&amp;ccedil;erli bağlantı nesnesinin temsil ettiği veri kaynağındaki bir saklı yordamı ifade ettiğini belirtiyor. */
      cmd.Parameters.Add("@MakaleID",OleDbType.Integer); /* Parametremiz oluşturuluyor. Adı @MakaleID, saklı yordamımızdaki ile aynı. Parametre tipi integer, nitekim Saklı Yordamımızdaki tipide int.*/
      cmd.Parameters["@MakaleID"].Value=41; /* Parametremizin değeri veriliyor. */

      try
      {
         con.Open();
         OleDbDataReader dr;
         dr=cmd.ExecuteReader();
         while(dr.Read())
         {
            Console.WriteLine(dr["ID"].ToString()+"-"+dr["Konu"].ToString()+"-"+dr["Tarih"].ToString());
         }
         dr.Close();
      }
      catch(Exception hata)
      {
         Console.WriteLine(hata.Message.ToString());
      }
      finally
      {
         con.Close();
      }
    }
  }
}&lt;/pre&gt;
&lt;p&gt;Bu uygulamayı &amp;ccedil;alıştırdığımızda, aşağıdaki sonucu elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk56_7.gif" alt="" width="549" height="103" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 7. Saklı Yordamın &amp;ccedil;alışmasının sonucu.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;CommandType &amp;ouml;zelliğinin Text değeri varsayılandır. Text değeri, CommandText i&amp;ccedil;in yazılan sql ifadelerinin &amp;ccedil;alıştırılmasında kullanılır. Aslında bir saklı yordamı bu şekildede &amp;ccedil;ağırabiliriz. Yani bir saklı yordamı, OleDbCommand sınıfının CommandType &amp;ouml;zelliğini Text olarak bırakarakta &amp;ccedil;ağırabiliriz. Bunun i&amp;ccedil;in "{CALL MakaleBul(?)}" s&amp;ouml;z dizimini aşağıdaki &amp;ouml;rnekte olduğu gibi kullanırız. Sonu&amp;ccedil; aynı olucaktır. Burada, CALL ifadesinde parametrenin ? işareti ile temsil edildiğine dikkat edin. SqlCommand sınıfında bu parametreler @ParametreAdı olarak kullanılır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;OleDbConnection con=new OleDbConnection("Provider=SQLOLEDB;data source=localhost;initial catalog=Friends;integrated security=sspi");

OleDbCommand cmd=new OleDbCommand("{CALL MakaleBul(?)}",con);

cmd.Parameters.Add("@MakaleID",OleDbType.Integer);
cmd.Parameters["@MakaleID"].Value=41;
try
{
  con.Open();
  OleDbDataReader dr;
  dr=cmd.ExecuteReader();
  while(dr.Read())
  {
    Console.WriteLine(dr["ID"].ToString()+"-"+dr["Konu"].ToString()+"-"+dr["Tarih"].ToString());
  }
  dr.Close();
}
catch(Exception hata)
{
  Console.WriteLine(hata.Message.ToString());
}
finally
{
  con.Close();
}&lt;/pre&gt;
&lt;p&gt;Gelelim, OleDbCommand sınıfının diğer &amp;ouml;nemli &amp;uuml;yelerine. Bu &amp;uuml;yelerden birisi CommandTimeOut &amp;ouml;zelliğidir. Bir sql ifadesi , OleDbCommand nesnesi tarafından &amp;ccedil;alıştırılıdığında, ilk sonu&amp;ccedil;lar d&amp;ouml;nd&amp;uuml;r&amp;uuml;lene kadar belli bir s&amp;uuml;re ge&amp;ccedil;er. İşte bu s&amp;uuml;renin uzunluğu CommandTimeOut &amp;ouml;zelliği tarafından belirlenir. Başlangı&amp;ccedil; değeri olarak 30 saniyeye ayarlanmıştır. Bu s&amp;uuml;re zarfında komut &amp;ccedil;alıştırılması ile birlikte herhangibir sonu&amp;ccedil; d&amp;ouml;nd&amp;uuml;r&amp;uuml;lemez ise, bir istisna fırlatılır. Bu &amp;ouml;zellik aslında, ilk sonu&amp;ccedil;ların d&amp;ouml;nmeye başlaması i&amp;ccedil;in ne kadar s&amp;uuml;re bekleneceğini belirtir. D&amp;uuml;ş&amp;uuml;n&amp;uuml;nk&amp;uuml;, bir OleDbAdapter nesnesinin &amp;ccedil;alıştırdığı bir OleDbCommand nesnemiz var. Bu komutun işaret ettiği sql ifadesi &amp;ccedil;alıştırıldıktan sonra, CommandTimeout'ta belirtilen s&amp;uuml;rede bir sonu&amp;ccedil; d&amp;ouml;nmez ise, s&amp;uuml;re aşımı nedeni ile bir istisna oluşur. Ancak burada &amp;ouml;zel bir durum vardır. Eğer, bu s&amp;uuml;re i&amp;ccedil;inde belli bir sayıda kayıt( en azından tek satırlık veri ) geri d&amp;ouml;nm&amp;uuml;ş ise, CommandTimeout s&amp;uuml;resi ge&amp;ccedil;ersiz hale gelir. B&amp;ouml;yle bir durumda OleDbDataAdapter tarafından d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmeye &amp;ccedil;alışılan kayıtların hepsi elde edilene kadar komut &amp;ccedil;alışmaya devam eder. Bu bazen bir &amp;ouml;m&amp;uuml;r boyu s&amp;uuml;rebilir. Buda tam anlamıyla bir ironidir.&lt;/p&gt;
&lt;p&gt;Daha &amp;ouml;nceki makalelerimizde hatırlayacağınız gibi, iş par&amp;ccedil;acıklarının &amp;ccedil;ok katlı mimaride &amp;ouml;nemli bir yeri vardır. Bir OleDbCommand sınıfı nesne &amp;ouml;rneğini bir iş par&amp;ccedil;acığı olarak &amp;ccedil;alıştırmak i&amp;ccedil;in, Transaction &amp;ouml;zelliğine, iş par&amp;ccedil;acığını &amp;uuml;stlenen OleDbTransaction nesnesini atamamız gerekir. Bununla ilgili basit bir &amp;ouml;rnek aşağıda verilmiştir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data.OleDb;
using System.Data;

namespace OleDbCmd1
{
  class Class1
  {
    static void Main(string[] args)
    {
      OleDbConnection con=new OleDbConnection("Provider=SQLOLEDB;data source=localhost;initial catalog=Friends;integrated security=sspi");

      OleDbCommand cmd=new OleDbCommand("Insert Into [Site Adlari] (Baslik,Adres,Resim,Icerik) Values('C#','www.csharpnedir.com','images/resim1.jpg','C# &amp;uuml;zerine her t&amp;uuml;rl&amp;uuml; makale.')",con);

      con.Open();
      OleDbTransaction trans=con.BeginTransaction(); /* Transaction'ımız, ge&amp;ccedil;erli bağlantımızı i&amp;ccedil;in yaratılıyor. */
      cmd.Transaction=trans; /* Komutumuzun tanımlanan bağlantı i&amp;ccedil;in a&amp;ccedil;ılmış transaction i&amp;ccedil;inde bir iş par&amp;ccedil;acığı olarak &amp;ccedil;alışacağı belirleniyor. */
      int sonuc=cmd.ExecuteNonQuery();
      if(sonuc==1)
      {
         trans.Commit(); /* Komut başarılı bir şekilde &amp;ccedil;alıştırılmışsa Commit ile t&amp;uuml;m işlemler onaylanıyor. */
         Console.WriteLine(sonuc.ToString()+" Kayıt Girildi...");
      }
      else
      {
         trans.Rollback(); /* Komut başarısız ise t&amp;uuml;m işlemler geri alınıyor. */
      }
    }
  }
}&lt;/pre&gt;
&lt;p&gt;OleDbCommand sınıfının kullanıldığı diğer &amp;ouml;nemli bir yerde OleDbDataAdapter sınıfıdır. Nitekim bu sınıfın i&amp;ccedil;erdiği SelectCommand, UpdateCommand, DeleteCommand, InsertCommand &amp;ouml;zellikleri, OleDbCommand sınıfı t&amp;uuml;r&amp;uuml;nden nesneleri değer olarak alırlar. Bu konuyu ilerliyen makalelerimizde OleDbDataAdapter sınıfını işlerken incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-02-23 12:00:00</pubDate>
  <slug>Command-Kavramc4b1-ve-OleDbCommand-Sc4b1nc4b1fc4b1-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>oledb</tag>
    <tag>sql</tag>
    <tag>sql-server</tag>
    <tag>oledbcommand</tag>
    <tag>database</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>