<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Python ve Flask ile REST Tabanlı Servis Geliştirmek</title>
  <description>Bir süredir Python ile ilgili çalışmalarıma aralıklarla da olsa devam etmeye çalışıyorum. Malum iş yoğunluğu ve sıkışık proje takvimi nedeniyle eskisi kadar vakit ayıramıyorum. Bu nedenle öğrenmek istediğim konuları önceliklendirme yoluna gittim(Kendi çalışma programımda bir backlog oluşturup öğeleri önceliklendirdiğimi ifade edebilirim) Genellikle backend tarafında programlama yaptığımdan olsan gerek listenin üst sıralarında servis tabanlı geliştirmeler yer alıyor. Onlardan birisi de REST tabanlı servis uyarlamaları.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2016/09/SeptemberFall-long-goodbye.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir s&amp;uuml;redir &lt;a href="/category/python" target="_blank"&gt;Python&lt;/a&gt; ile ilgili &amp;ccedil;alışmalarıma aralıklarla da olsa devam etmeye &amp;ccedil;alışıyorum. Malum iş yoğunluğu ve sıkışık proje takvimi nedeniyle eskisi kadar vakit ayıramıyorum. Bu nedenle &amp;ouml;ğrenmek istediğim konuları &amp;ouml;nceliklendirme yoluna gittim&lt;em&gt;(Kendi &amp;ccedil;alışma programımda bir backlog oluşturup &amp;ouml;ğeleri &amp;ouml;nceliklendirdiğimi ifade edebilirim)&lt;/em&gt; Genellikle backend tarafında programlama yaptığımdan olsan gerek listenin &amp;uuml;st sıralarında servis tabanlı geliştirmeler yer alıyor. Onlardan birisi de REST tabanlı servis uyarlamaları.&lt;/p&gt;
&lt;p&gt;İşte Eyl&amp;uuml;l&amp;nbsp;ayındaki&amp;nbsp;&amp;ouml;nceliğimi bu konuya verdim.&amp;nbsp;Tabii Eyl&amp;uuml;l denince akla sonbahar, şiir, hafif hafif serinleyen hava, ş&amp;ouml;yle g&amp;uuml;zelce sarındığımız yorgan, a&amp;ccedil;ılan okullar, okul malzemeleri ile dolup taşan kırtasiyeler, sararan yapraklar, eğer eğlenceli ge&amp;ccedil;tiyse sıcak yaz akşamlarının geride kalması nedeniyle oluşan h&amp;uuml;z&amp;uuml;n ve benzeri şeyler geliyor.&lt;/p&gt;
&lt;p&gt;Son yılların en pop&amp;uuml;ler uygulama tiplerinden birisi REST&lt;em&gt;(Representational State Transfer)&lt;/em&gt; tabanlı servisler. &amp;Ouml;zellikle MicroService d&amp;uuml;nyasını da ilgilendiren bu uygulama &amp;ccedil;eşidini .Net'ten Ruby'ye, Java'dan Python'a kadar pek &amp;ccedil;ok programlama dilinde ve platformda&amp;nbsp;ele almak&amp;nbsp;m&amp;uuml;mk&amp;uuml;n. Prensipler genel olarak aynı. HTTP protokol&amp;uuml;n&amp;uuml;n Get,Post,Put,Delete gibi metodları ile &amp;ccedil;alışan, istemci tarafında Proxy tipleri&amp;nbsp;gibi unsurlara&amp;nbsp;ihtiya&amp;ccedil; duymayan, basit bir tarayıcının &amp;ccedil;ağırabileceği operasyonlar b&amp;uuml;t&amp;uuml;n&amp;uuml;n&amp;uuml; i&amp;ccedil;eren mimari bir yaklaşım ve standart olması REST'i pop&amp;uuml;ler kılan etkenler olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&amp;nbsp;Aşağıdaki tabloda HTTP metodları ile ilişkili &amp;ouml;zet bilgiyi bulabilirsiniz.&lt;/p&gt;
&lt;table style="height: 425px;" width="640"&gt;
&lt;thead&gt;
&lt;tr style="background-color: lightgray;"&gt;
&lt;th&gt;HTTP Metod&lt;/th&gt;
&lt;th&gt;A&amp;ccedil;ıklama&lt;/th&gt;
&lt;th&gt;&amp;Ouml;rnek&lt;/th&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="background-color: lightgray;"&gt;&lt;strong&gt;GET&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Bir kaynak&lt;em&gt;(resource)&lt;/em&gt; ile ilgili bilgi almamızı sağlar. &amp;Ouml;rneğin t&amp;uuml;m &amp;uuml;r&amp;uuml;n listesinin &amp;ccedil;ekilmesi.&lt;/td&gt;
&lt;td&gt;http(s)://hostname/api/products&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: lightgray;"&gt;&lt;strong&gt;GET&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Bir kaynak ile ilgili bilgi alırken listenin belirli bir tekil elemanını da &amp;ccedil;ekebiliriz. &amp;Ouml;rneğin &amp;uuml;r&amp;uuml;n listesinden 100456 nolu olanın &amp;ccedil;ekilmesi gibi.&lt;/td&gt;
&lt;td&gt;http(s)://hostname/api/products/100456&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: lightgray;"&gt;&lt;strong&gt;POST&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Yeni bir kaynak oluşturmamızı sağlar. Kaynak i&amp;ccedil;eriği HTTP paketinde g&amp;ouml;nderilir.&lt;/td&gt;
&lt;td&gt;http(s)://hostname/api/products&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: lightgray;"&gt;&lt;strong&gt;PUT&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Bir kaynağı g&amp;uuml;ncellemek i&amp;ccedil;in kullanabiliriz. Talep&amp;nbsp;belirli bir Id i&amp;ccedil;in yapılırken g&amp;uuml;ncelleme i&amp;ccedil;eriği yine paket i&amp;ccedil;inde&amp;nbsp;g&amp;ouml;nderilir.&lt;/td&gt;
&lt;td&gt;http(s)://hostname/api/products/100456&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: lightgray;"&gt;&lt;strong&gt;DELETE&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Bir kaynağı silmek i&amp;ccedil;in kullanılır. Kaynak yine tanımlayıcı bir değer ile ayırt edilir. &amp;Uuml;r&amp;uuml;n&amp;uuml;n benzersiz IDsi gibi.&lt;/td&gt;
&lt;td&gt;http(s)://hostname/api/products/100456&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;blockquote&gt;
&lt;p&gt;Vakti zamanında banka i&amp;ccedil;inde kullanılan yaklaşık 15 yaşındaki klasik asp ile yazılmış bir uygulamanın ihtiya&amp;ccedil; duyduğu iş fonksiyonelliğini i&amp;ccedil;eren bir Endpoint&amp;nbsp;i&amp;ccedil;in, REST tabanlı servis geliştirmiştik. Bu konu ile ilişkili olarak &lt;a href="/post/klasik-asp-sayfasindan-rest-servis-cagirmak.aspx" target="_blank"&gt;"Klasik ASP sayfasından REST Servis &amp;Ccedil;ağırmak"&lt;/a&gt; isimli makaleyi incleyebilirsiniz. Zaten servis d&amp;uuml;nyasının en g&amp;uuml;zel &amp;ouml;zelliklerinden birisi de bu; platformlar arası sınırları ortadan kaldırması.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bu yazımızda ise Python programlama dilini kullanarak basit bir REST servisinin nasıl geliştirilebileceğini incelemeye &amp;ccedil;alışacağız. REST tipinden servisleri Python tarafında daha kolay ele almak i&amp;ccedil;in Flask isimli Web Framework'&amp;uuml;nden yararlanacağız. Uygulamamızı Linux Ubuntu işletim sistemi &amp;uuml;zerinde geliştireceğimizi baştan belirteyim&lt;em&gt;(.Net platformunda geliştirme yapıyoruz diye Linux'&amp;uuml; bir kenara bırakacak değiliz)&lt;/em&gt; &amp;Ouml;ncelikle sistemin g&amp;uuml;ncellenmesinde yarar var. Bunun i&amp;ccedil;in terminalden&lt;/p&gt;
&lt;p&gt;sudo apt-get update&lt;/p&gt;
&lt;p&gt;komutunun verilmesi yeterlidir. Sistem g&amp;uuml;ncellemesini takiben pip aracı kullanılarak&lt;em&gt;(ki pip ile Python mod&amp;uuml;llerini sistemimize y&amp;uuml;kleyip kaldırabiliyoruz)&lt;/em&gt; Flask k&amp;uuml;t&amp;uuml;phanesinin y&amp;uuml;klenmesi ger&amp;ccedil;ekleştirilebilir. Terminalden aşağıdaki komutu ile işlemlerimize devam edebiliriz.&lt;/p&gt;
&lt;p&gt;pip install flask&lt;/p&gt;
&lt;h2&gt;&amp;Ouml;rnek Kod&lt;/h2&gt;
&lt;p&gt;Bu işlemlerin ardından flask k&amp;uuml;t&amp;uuml;phanesini kullanacağımız &amp;ouml;rnek kodları geliştirmeye başlayabiliriz. Amacımız temel olarak bir REST servisini ayağa kaldırmak olduğundan &amp;ccedil;ok yalın bir &amp;ouml;rnek &amp;uuml;zerinden ilerleyeceğiz. Bellek &amp;uuml;zerinde &amp;ccedil;eşitli tipte &amp;uuml;r&amp;uuml;nlerimiz mevcut olacak&lt;em&gt;(ki bir ger&amp;ccedil;ek hayat senaryosunda kaynaklar &amp;ccedil;oğunlukla veritabanı &amp;uuml;zerinden beslenecektir)&lt;/em&gt; Bu &amp;uuml;r&amp;uuml;n listesi &amp;uuml;zerinde GET, POST ve DELETE metodlarını deneyeceğiz. Servis &amp;uuml;zerinde t&amp;uuml;m &amp;uuml;r&amp;uuml;n listesini &amp;ccedil;ekebileceğiz. Yine belli bir ID'ye ait &amp;uuml;r&amp;uuml;n&amp;uuml; de alabileceğiz. Bunlara ek olarak yeni bir &amp;uuml;r&amp;uuml;n&amp;uuml;n eklenmesi ve silinmesi operasyonlarını da deneyeceğiz. İşte &amp;ouml;rnek Python kod dosyamız.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;#!flask/bin/python
from flask import Flask, jsonify
from flask import make_response
from flask import request

products = [
    {
        'id': 1000,
        'title': 'Stabilo kalem seti',
        'description': '16li renk paketi', 
        'price': 50,
        'category':'Kirtasiye',
        'inStock':True
    },
    {
        'id': 1002,
        'title': 'Python Programming',
        'description': 'Python programlama ile ilgili giris seviye kitap', 
        'price': 60,
        'category':'Kitap',
        'inStcok':False
    },
    {
        'id': 1003,
        'title': 'Mini iPod',
        'description': '80 Gb Kapasiteli MP3 Calar', 
        'price': 200,
        'category':'Elektronik',
        'inStock':True
    }
]

app = Flask(__name__)

@app.route('/azon/api/products', methods=['GET'])
def get_products():
    return jsonify({'products': products})

@app.route('/azon/api/products/&amp;lt;int:product_id&amp;gt;', methods=['GET'])
def get_product(product_id):
    product = [product for product in products if product['id'] == product_id]
    if len(product) == 0:
        return jsonify({'product': 'Not found'}),404
    return jsonify({'product': product})

@app.route('/azon/api/products', methods=['POST'])
def create_product():
    newProduct = {
        'id': products[-1]['id'] + 1,
        'title': request.json['title'],
        'description': request.json['description'],
        'price':request.json.get('price', 1),
        'category':request.json['category'],
        'inStock': request.json.get('inStock', False)
    }
    products.append(newProduct)
    return jsonify({'product': newProduct}), 201

@app.route('/azon/api/products/&amp;lt;int:product_id&amp;gt;', methods=['DELETE'])
def delete_product(product_id):
    product = [product for product in products if product['id'] == product_id]
    if len(product) == 0:
        return jsonify({'product': 'Not found'}), 404
    products.remove(product[0])
    return jsonify({'result': True})

@app.errorhandler(404)
def not_found(error):
    return make_response(jsonify({'HTTP 404 Error': 'The content you looks for does not exist. Please check your request.'}), 404)

if __name__ == '__main__':
    app.run(debug=True)#!flask/bin/python
&lt;/pre&gt;
&lt;p&gt;Kodumuzda neler yaptığımıza kısaca değinelim dilerseniz. Uygulama, products isimli bir listeyi kullanıyor. GET, POST ve DELETE&amp;nbsp;taleplerini nasıl karşılayacağımızı @app.route nitelikleri ile metodlarımızın başında belirtiyoruz. &amp;Ouml;rneğin get_products metodu başında belirtilen nitelik i&amp;ccedil;eriğine g&amp;ouml;re http://localhost:5000/azon/api/products&amp;nbsp;adresine gelecek olan GET taleplerini ele alacak&lt;em&gt;(Yeri gelmişken Flask'in varsayılan olarak localhost &amp;uuml;zerinden 5000 numaralı portu kullanıma sunduğunu belirtelim)&lt;/em&gt; Bir diğer fonksiyon olan get_product metodu&amp;nbsp;ise product_id değerini alarak &amp;ccedil;alışıyor. HTTP y&amp;ouml;nlendirmesi yine @app.route bildirimi ile ger&amp;ccedil;ekleştirilmekte. Buna g&amp;ouml;re http://localhost:5000/azon/api/products/1002&amp;nbsp;gibi bir &amp;ccedil;ağrı ilgili get_product metodu tarafından ele alınacak.&lt;/p&gt;
&lt;p&gt;create_product metodu HTTP Post &amp;ccedil;ağrılarına cevap verecek şekilde &amp;ccedil;alışıyor. Metod i&amp;ccedil;erisinde POST paketi ile gelen JSON i&amp;ccedil;eriğindeki key:value değerleri kullanılarak, bellekte tutulan products listesine yeni&amp;nbsp;bir &amp;uuml;r&amp;uuml;n&amp;uuml;n eklenmesi sağlanmakta. Tahmin edileceği &amp;uuml;zere delete_product metodu, HTTP Delete &amp;ccedil;ağrısı ile gelen &amp;uuml;r&amp;uuml;n numarasına g&amp;ouml;re işlem yapmakta ve ilgili &amp;uuml;r&amp;uuml;n&amp;uuml; listeden &amp;ccedil;ıkartmakta&lt;em&gt;(Tabii bulursa)&lt;/em&gt; &amp;Ccedil;ok doğal olarak hatalı bir URL talebi de g&amp;ouml;nderilebilir.&amp;nbsp;Buna g&amp;ouml;re oluşacak HTTP 404 hatasını da &amp;ouml;zel olarak ele almaktayız. @app.errorhandler(404) niteliği ile işaretlenmiş olan not_found fonksiyonu bu işi ele almakta. Bir nevi sunucu &amp;uuml;zerinde oluşan hata mesajı istemci tarafına g&amp;ouml;nderilmeden &amp;ouml;nce araya girdiğimizi d&amp;uuml;ş&amp;uuml;nebiliriz.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;HTTP talepleri ve karşılığında &amp;ccedil;alışan komutları aşağıdaki &amp;ouml;zet tabloya bakarak daha kolay anlayabiliriz.&lt;/p&gt;
&lt;table style="height: 334px;" width="640"&gt;
&lt;tfoot&gt;
&lt;tr&gt;
&lt;td&gt;http://localhost:5000/azon/api/products&lt;/td&gt;
&lt;td&gt;HTTP Get&lt;/td&gt;
&lt;td&gt;@app.route( &lt;br /&gt;'/azon/api/products', methods=['GET'])&lt;/td&gt;
&lt;td&gt;get_products&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;http://localhost:5000/azon/api/products/1002&amp;nbsp;&lt;/td&gt;
&lt;td&gt;HTTP Get&lt;/td&gt;
&lt;td&gt;@app.route(&amp;nbsp;&lt;br /&gt;'/azon/api/products/&amp;lt;int:product_id&amp;gt;', methods=['GET'])&lt;/td&gt;
&lt;td&gt;get_product&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;http://localhost:5000/azon/api/products&lt;/td&gt;
&lt;td&gt;
&lt;p&gt;HTTP&lt;/p&gt;
&lt;p&gt;Post&lt;/p&gt;
&lt;/td&gt;
&lt;td&gt;@app.route( &lt;br /&gt;'/azon/api/products', methods=['POST'])&lt;/td&gt;
&lt;td&gt;create_product&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;http://localhost:5000/azon/api/products/1004&lt;/td&gt;
&lt;td&gt;
&lt;p&gt;HTTP Delete&lt;/p&gt;
&lt;/td&gt;
&lt;td&gt;@app.route( '/azon/api/products/&amp;lt;int:product_id&amp;gt;', methods=['DELETE'])&lt;/td&gt;
&lt;td&gt;delete_product&lt;/td&gt;
&lt;/tr&gt;
&lt;/tfoot&gt;
&lt;tbody&gt;
&lt;tr style="background-color: lightgray;"&gt;
&lt;td style="text-align: center;"&gt;&lt;strong&gt;Talep&lt;/strong&gt;&lt;/td&gt;
&lt;td style="text-align: center;"&gt;&lt;strong&gt;T&amp;uuml;r&amp;uuml;&lt;/strong&gt;&lt;/td&gt;
&lt;td style="text-align: center;"&gt;&lt;strong&gt;Nitelik&lt;/strong&gt;&lt;/td&gt;
&lt;td style="text-align: center;"&gt;&lt;strong&gt;Method&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;h2&gt;Testler&lt;/h2&gt;
&lt;p&gt;Şimdi testlerimize başlayabiliriz. İlk olarak t&amp;uuml;m &amp;uuml;sr&amp;uuml;n listesini ve tek bir &amp;uuml;r&amp;uuml;n&amp;uuml; elde etmeye &amp;ccedil;alışalım. AzonHost.py ismiyle kaydettiğimiz kod dosyamızı pyhton yorumlayıcısı ile &amp;ccedil;alıştırdıktan sonra basit bir tarayıcı &amp;uuml;zerinden bu talepleri aşağıdaki gibi ger&amp;ccedil;ekleştirebiliriz.&lt;/p&gt;
&lt;p&gt;http://localhost:5000/azon/api/products talebi sonrası durum aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/09/RestPython1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi t&amp;uuml;m &amp;uuml;r&amp;uuml;n listesi JSON formatında istemciye d&amp;ouml;nd&amp;uuml;r&amp;uuml;lm&amp;uuml;şt&amp;uuml;r. Dilersek tek bir &amp;uuml;r&amp;uuml;n&amp;uuml; talep etmeyi de deneyebiliriz. Tek yapmamız gereken aşağıdaki URL'de olduğu gibi doğru Id değerini kullanmaktır.&lt;/p&gt;
&lt;p&gt;http://localhost:5000/azon/api/products/1002&amp;nbsp;sonrası durum aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/09/RestPython3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Eğer hatalı bir URL talebi g&amp;ouml;nderip HTTP 404 hatası oluşmasına neden olursak karşımıza aşağıdaki gibi bir mesaj &amp;ccedil;ıkacaktır. Nitekim HTTP 404 vakasını not_found metodu ile yakalayıp&amp;nbsp;kendi istediğimiz şekilde ele almaktayız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/09/RestPython2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Yeni bir &amp;uuml;r&amp;uuml;n eklemek i&amp;ccedil;in tarayıcı yerine curl komut satırı aracını da kullanabiliriz&lt;em&gt;(aslında bu servisi host ettiğiniz makineye erişebilen herhangi bir istemci uygulamayı geliştirmeyi deneyebilirsiniz. .Net tarafında kuvvetli iseniz s&amp;ouml;z konusu HTTP taleplerini C# ile oluşturmaya &amp;ccedil;alışabilirsiniz. Ben s&amp;ouml;yledim siz deneyin)&lt;/em&gt; JSON i&amp;ccedil;eriğini oluştururken string bazlı t&amp;uuml;rler&amp;nbsp;i&amp;ccedil;in &amp;ccedil;ift tırnak kullanımına dikkat etmemiz gerekmekte. Ben yazarken epey hata yaptım ve 7nci denememde HTTP Post paketini ancak g&amp;ouml;nderebildim. &amp;Ouml;rnekteki price ve inStock değerleri sayısal ve boolean tipinden olduğuncan &amp;ccedil;ift tırnaklar arasında&amp;nbsp;yazılmamışlardır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/09/RestPython4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;curl komutunu &amp;ccedil;alıştırdıktan sonra ilgili &amp;uuml;r&amp;uuml;n&amp;uuml;n bellekteki listeye eklendiğini g&amp;ouml;rebiliriz. Delete komutu ile silme işlemini yine&amp;nbsp;curl aracını kullanarak denememiz m&amp;uuml;mk&amp;uuml;n. Aynen aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/09/RestPython5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;1004 numaralı &amp;uuml;r&amp;uuml;n&amp;uuml; HTTP Delete komutu ile listemizden &amp;ccedil;ıkarttık.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Pek tabii istemci olarak curl veya Firefox gibi bir tarayıcıyı kullanmak zorunda değiliz. Elimizde REST tabanlı &amp;ccedil;alışan bir servis var. Dolayısıyla istemci tarafı Java, .Net , Ruby vb bir dille yazılmış herhangi bir uygulama olabilir. Diğer yandan &amp;ouml;rneğimizde eksik bıraktığımız bir operasyon da mutlaka dikkatinizi &amp;ccedil;ekmiştir; HTTP Put. Yani Update işlemimiz hen&amp;uuml;z operasyonel olarak etkin&amp;nbsp;değil. Operasyon tahmin edeceğiniz &amp;uuml;zere paket i&amp;ccedil;erisinde gelecek olan bilgileri var olan bir &amp;uuml;r&amp;uuml;n&amp;uuml;nk&amp;uuml; ile değiştirmeli. Peki ama nasıl? Makaleme son verirken bu kutsal g&amp;ouml;revi de siz değerli okurlarıma bırakıyorum. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-09-22 22:00:00</pubDate>
  <slug>python-ile-rest-tabanli-servis-gelistirmek</slug>
  <tags>
    <tag>python</tag>
    <tag>rest</tag>
    <tag>rest-services</tag>
    <tag>http</tag>
    <tag>web-framework</tag>
    <tag>api</tag>
    <tag>linux</tag>
    <tag>terminal</tag>
    <tag>pip</tag>
    <tag>flask</tag>
    <tag>curl</tag>
    <tag>ubuntu</tag>
  </tags>
  <categories>
    <category>python</category>
  </categories>
</post>