<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Localization (Yerelleştirme) - 1</title>
  <description>Dünya çapında yada başka bir deyişle global çapta uygulamalar geliştirilirken karşılaşılabilecek zorluklardan birisi, uygulamanın farklı kültür ve dil seçeneklerine göre çalışabilecek şekilde tasarlanmasıdır. Eski programlama dilleri göz önüne alındığında, özellikle farklı dil desteği sağlayacak uygulamaların geliştirilmesi tam anlamıyla bir kabus olmuştur. Söz gelimi 2 dile destek verecek bir uygulama geliştirilmek istendiğinde, her iki dil içinde farklı uygulama kodları yazılması gerekirdi. Böyle bir durumda, uygulamanın piyasaya sürülmesinden sonra yapılacak güncelleme paketleri içinde aynı durum söz konusuydu. Dahası, 3ncü bir dilin desteğinin sağlanması için, aynı projenin bu kezde bu dil için geliştirilmesi gerekmekteydi. Dil çeşitliliğinin yanı sıra, aynı dili konuşan fakat farklı takvimler, farklı parasal formatlar, farklı sayısal formatlar hatta farklı sıralamalar kullanan kültürler işin içine sokulduğunda durum tam anlamıyla bir paradoks haline gelmektedir.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;D&amp;uuml;nya &amp;ccedil;apında yada başka bir deyişle global &amp;ccedil;apta uygulamalar geliştirilirken karşılaşılabilecek zorluklardan birisi, uygulamanın farklı k&amp;uuml;lt&amp;uuml;r ve dil se&amp;ccedil;eneklerine g&amp;ouml;re &amp;ccedil;alışabilecek şekilde tasarlanmasıdır. Eski programlama dilleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında, &amp;ouml;zellikle farklı dil desteği sağlayacak uygulamaların geliştirilmesi tam anlamıyla bir kabus olmuştur. S&amp;ouml;z gelimi 2 dile destek verecek bir uygulama geliştirilmek istendiğinde, her iki dil i&amp;ccedil;inde farklı uygulama kodları yazılması gerekirdi. B&amp;ouml;yle bir durumda, uygulamanın piyasaya s&amp;uuml;r&amp;uuml;lmesinden sonra yapılacak g&amp;uuml;ncelleme paketleri i&amp;ccedil;inde aynı durum s&amp;ouml;z konusuydu. Dahası, 3nc&amp;uuml; bir dilin desteğinin sağlanması i&amp;ccedil;in, aynı projenin bu kezde bu dil i&amp;ccedil;in geliştirilmesi gerekmekteydi. Dil &amp;ccedil;eşitliliğinin yanı sıra, aynı dili konuşan fakat farklı takvimler, farklı parasal formatlar, farklı sayısal formatlar hatta farklı sıralamalar kullanan k&amp;uuml;lt&amp;uuml;rler işin i&amp;ccedil;ine sokulduğunda durum tam anlamıyla bir paradoks haline gelmektedir.&lt;/p&gt;
&lt;p&gt;Peki Microsoft .Net ile bu soruna nasıl bir &amp;ccedil;&amp;ouml;z&amp;uuml;m getirmektedir? İşte bu g&amp;uuml;nk&amp;uuml; makalemizin konusu budur. Microsoft .Net platformu i&amp;ccedil;inde geliştirdiğimiz &amp;ccedil;&amp;ouml;z&amp;uuml;mlerin (solutions), &amp;ccedil;eşitli dillere veya k&amp;uuml;lt&amp;uuml;rlere destek verebilmesini sağlamak amacıyla, &amp;ouml;ncekilerine nazaran &amp;ccedil;ok daha mantıklı ve verimli bir teknik uygulanır. Bu teknikte, uygulama kodu bir kez yazılır. Bu uygulamanın dil desteği ve k&amp;uuml;lt&amp;uuml;r desteği vermesi i&amp;ccedil;in ise, framework i&amp;ccedil;inde yer alan System.Globalization isim alanındaki sınıflardan ve resource files dediğimiz kaynak dosyalarından yararlanılır. Bir başka deyişle, bir uygulamanın yerelleştirilmesi yani dil desteği ve k&amp;uuml;lt&amp;uuml;rel desteğin sağlaması i&amp;ccedil;in, uygulama kodları ile destek birimleri birbirinden ayrı tutulmuştur. B&amp;ouml;ylece, bir uygulamayı n sayıda k&amp;uuml;lt&amp;uuml;r i&amp;ccedil;in yerelleştirmek m&amp;uuml;mk&amp;uuml;n olmaktadır.&lt;/p&gt;
&lt;p&gt;Bu teorik bilgiler ilk okunduğunda akla karmaşık gelebilir. Olayı daha iyi anlayabilmek i&amp;ccedil;in, yery&amp;uuml;z&amp;uuml;nde yer alan toplumların birbirlerinden farklılaşmasına neden olan k&amp;uuml;lt&amp;uuml;rel &amp;ouml;zellikleri keşfetmek gerekmektedir. D&amp;uuml;nyamız konuşulan ana dillere g&amp;ouml;re &amp;ccedil;eşitli b&amp;ouml;lgelere ayrılmıştır. Bu diller, bir toplumun doğal k&amp;uuml;lt&amp;uuml;r&amp;uuml;n&amp;uuml; (Neutral Culture) temsil eder. Yada başka bir deyişle doğal k&amp;uuml;lt&amp;uuml;rler dillere g&amp;ouml;re kategorize edilir. &amp;Ouml;rneğin İngilizce, Almanca, Fransızca, İtalyanca dilleri doğal k&amp;uuml;lt&amp;uuml;rleri (Neutral Cultures) yansıtmaktadır. Bununla birlikte, &amp;ccedil;eşitli dillere destek verecek &amp;ccedil;evirisel uygulamalarda, doğal k&amp;uuml;lt&amp;uuml;rlerin bilinmesi yeterli iken, parasal işlemlerin, sayısal işlemlerin, tarihsel işlemlerin, sıralamaların vb... yer aldığı daha belirleyici yerelleştirme işlemlerinde, dile bağlı doğal k&amp;uuml;lt&amp;uuml;r bilgileri yeterli değildir. &amp;Ouml;rneğin, İngilizce konuşan pek &amp;ccedil;ok alt k&amp;uuml;lt&amp;uuml;r vardır. İngiltere, Amerika, Kanada, Avusturalya vb... Bu &amp;uuml;lkelerin her biri İngilizce konuşmakla birlikte, farklı k&amp;uuml;lt&amp;uuml;r &amp;ouml;zelliklerine sahip olabilirler. &amp;Ouml;rneğin kullandıkları para birimi farklılığı, zip kodların farklılığı, sayısal ifadelerdeki nokta ve virg&amp;uuml;l kullanımlarının farklılıkları vb... Dolayısıyla bir uygulamayı, belirli bir k&amp;uuml;lt&amp;uuml;r i&amp;ccedil;in &amp;ouml;zelleştirecek isek, Specific Culture denilen alt k&amp;uuml;lt&amp;uuml;r bilgilerinden yararlanmamız gerekmektedir.&lt;/p&gt;
&lt;p&gt;Tabiki k&amp;uuml;lt&amp;uuml;r bilgilerinin belirli bir standart &amp;ccedil;er&amp;ccedil;evesinde ifade edilmesi ve k&amp;uuml;resel &amp;ccedil;apta kabul g&amp;ouml;rmesi olduk&amp;ccedil;a &amp;ouml;nemlidir. Microsof bunun i&amp;ccedil;in, IETF tarafından belirlenmiş RFC 1766 standardını kullanır. Bu standarda g&amp;ouml;re, her doğal k&amp;uuml;lt&amp;uuml;r ve bu doğal k&amp;uuml;lt&amp;uuml;re bağlı alt k&amp;uuml;lt&amp;uuml;rler ikişer karakterden oluşan kısaltma kodlar ile ifade edilirler. Tabiki bir doğal k&amp;uuml;lt&amp;uuml;r birden fazla alt k&amp;uuml;lt&amp;uuml;re ve bu alt k&amp;uuml;lt&amp;uuml;rlerde başka alt k&amp;uuml;lt&amp;uuml;rlere sahip olabilirler. Konuyu aşağıdaki &amp;ouml;rnek şekil daha iyi ifade edecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk81_1.gif" alt="" width="489" height="557" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 1. Fransızca nın alt k&amp;uuml;lt&amp;uuml;rleri.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin Fransıca dili bir doğal k&amp;uuml;lt&amp;uuml;r olarak ele alındığında, d&amp;uuml;nya &amp;uuml;zerinde Fransızca' yı konuşan b&amp;ouml;lgelerde bu k&amp;uuml;lt&amp;uuml;r&amp;uuml;n alt k&amp;uuml;lt&amp;uuml;rlerini oluşturur. fr-FR Fransa'yı, fr-BE Bel&amp;ccedil;ikayı fr-LU L&amp;uuml;ksemburg' u temsil eden belirleyici k&amp;uuml;lt&amp;uuml;r kodlarıdır. Peki uygulamalarımızda bu k&amp;uuml;lt&amp;uuml;r kodlarını nasıl kullanabiliriz? Bunun i&amp;ccedil;in System.Globalization isim alanındaki CultureInfo ve RegionInfo sınıflarını kullanabiliriz. CultureInfo sınıfı yardımıyla belilri bir k&amp;uuml;lt&amp;uuml;re ait bilgilere sahip oluruz. RegionInfo sınıfı ilede, belirli bir b&amp;ouml;lgeye ait bilgilere ulaşırız. &amp;Ouml;rneğin para birimi ve metrik sistemin kullanılıp kullanılmadığı gibi bilgiler RegionInfo sınıfını ilgilendirirken, takvim bilgisi, doğal ad gibi bilgilerde CultureInfo sınıfını ilgilendirir. İşin &amp;ouml;zel yanı, bir uygulamanın kullanıcı aray&amp;uuml;z&amp;uuml;ndeki yerel kriterleri değiştirmek istediğimizde, uygulamanın &amp;ccedil;alıştığı thread nesnesine ait metodları kullanamamızın yeterli olacağıdır. Tabiki burada bahsi ge&amp;ccedil;en proses, belirtilen bir k&amp;uuml;lt&amp;uuml;r bilgisine yani CultureInfo nesnesine g&amp;ouml;re ayarlandığı takdirde, programın yerelleştirilmesi ger&amp;ccedil;ekleştirilmiş olacaktır.&lt;/p&gt;
&lt;p&gt;Şimdi bu bahsettiklerimizi daha iyi anlayabileceğimiz basit bir uygulama geliştirmeye &amp;ccedil;alışlım. Bu uygulamamızda, kabul g&amp;ouml;ren standartlar i&amp;ccedil;indeki t&amp;uuml;m k&amp;uuml;lt&amp;uuml;rlere ait kodları listeleyeceğimiz bir treeView kontrol&amp;uuml; kullacağız. Her hangibir k&amp;uuml;lt&amp;uuml;r se&amp;ccedil;ildiğinde bu k&amp;uuml;lt&amp;uuml;re ait bilgiler ekrandaki kontrollere dolacak. Ayrıca, tarih, saat ve parasal bilgi veren textBox' larımızda &amp;ouml;rnek değerler tutacak ve bu bilgilerin se&amp;ccedil;ilen k&amp;uuml;lt&amp;uuml;r&amp;uuml;n belirttiği &amp;ouml;zelliklere g&amp;ouml;re g&amp;ouml;sterilmesi sağlanacak. &amp;Ouml;ncelikle Vs.Net i&amp;ccedil;inde aşağıdaki forma g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne sahip olan bir windows uygulaması oluşturalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk81_2.gif" alt="" width="579" height="452" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 2. Form tasarımımız.&lt;/p&gt;
&lt;p&gt;Gelelim uygulama kodlarımıza. Her şeyden &amp;ouml;nce System.Globalization isim alanını uygulamamıza using anahtar kelimesi ile eklemeliyiz. Nitekim kullacanağımız CultureInfo ve RegionInfo sınıfları bu isim alanı i&amp;ccedil;inde yer almaktadır. Kulturler başlıklı butona bastığımızda, Microsoft' un kullandığı standart i&amp;ccedil;indeki t&amp;uuml;m k&amp;uuml;lt&amp;uuml;r kodlarının listesini almak ve bunları treeView kontrol&amp;uuml;nde ağa&amp;ccedil; yapısı şeklinde hiyerarşik bir d&amp;uuml;zende g&amp;ouml;stermek istiyoruz. İşte Kulturler başlıklı butona ait kodlarımız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnKulturler_Click(object sender, System.EventArgs e)
{
    CultureInfo[] kulturDizi=CultureInfo.GetCultures(CultureTypes.AllCultures);

    TreeNode[] nodes=new TreeNode[kulturDizi.Length];

    int i=0;
    TreeNode parent=null;

    foreach(CultureInfo kulturBilgi in kulturDizi)
    {
        nodes[i]=new TreeNode();
        nodes[i].Text=kulturBilgi.DisplayName;
        nodes[i].Tag=kulturBilgi;

        if(kulturBilgi.IsNeutralCulture)
        {
            parent=nodes[i];
            treeView1.Nodes.Add(nodes[i]);
        }
        else if(kulturBilgi.ThreeLetterISOLanguageName==CultureInfo.InvariantCulture. ThreeLetterISOLanguageName)
        {
            treeView1.Nodes.Add(nodes[i]);
        }
        else
        {
            parent.Nodes.Add(nodes[i]);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncelike, var olan k&amp;uuml;lt&amp;uuml;rleri elde etmek i&amp;ccedil;in CultureInfo sınıfına ait GetCultures metodunu kullandık. Bu metoda parametre olarak, CultureTypes.AllCultures değerini verdik. Metodumuz bu parametre değeri dışında aşağıdaki değerleride alabilmektedir.&lt;/p&gt;
&lt;table id="table2" class="dtTABLE" style="width: 560px;" border="1" cellspacing="0"&gt;
&lt;tbody&gt;
&lt;tr valign="top"&gt;
&lt;th width="38%"&gt;CultureTypes Numaralandırıcı Değeri&lt;/th&gt;
&lt;th width="60%"&gt;A&amp;ccedil;ıklama&lt;/th&gt;
&lt;/tr&gt;
&lt;tr valign="top"&gt;
&lt;td width="38%"&gt;&lt;strong&gt;AllCultures&lt;/strong&gt;&lt;/td&gt;
&lt;td width="60%"&gt;T&amp;uuml;m k&amp;uuml;lt&amp;uuml;rleri listeler.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr valign="top"&gt;
&lt;td width="38%"&gt;&lt;strong&gt; InstalledWin32Cultures&lt;/strong&gt;&lt;/td&gt;
&lt;td width="60%"&gt;Windows sistemlerinde kullanılan k&amp;uuml;lt&amp;uuml;rleri listeler.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr valign="top"&gt;
&lt;td width="38%"&gt;&lt;strong&gt;NeutralCultures&lt;/strong&gt;&lt;/td&gt;
&lt;td width="60%"&gt;Sadece dille ilişkilendirilmiş doğal k&amp;uuml;lt&amp;uuml;rleri listeler.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr valign="top"&gt;
&lt;td width="38%"&gt;&lt;strong&gt;SpecificCultures&lt;/strong&gt;&lt;/td&gt;
&lt;td width="60%"&gt;Belirleyici k&amp;uuml;lt&amp;uuml;rleri listeler.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Bundan sonraki kod satılarında treeView kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; doldurmak i&amp;ccedil;in gerekli işlemler yapılmıştır. Dikkat etmemiz gereken noktalar, foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml; i&amp;ccedil;indeki if koşullarıdır. Buradaki ilk koşulda CultureInfo nesnesinin doğal bir k&amp;uuml;lt&amp;uuml;r olup olmadığına bakılır. Diğer koşulda ise k&amp;uuml;lt&amp;uuml;r&amp;uuml;n invariant culture olup olmadığı koşulu değerlendirilir. Invariant kult&amp;uuml;rler, ger&amp;ccedil;ek k&amp;uuml;lt&amp;uuml;rlerden bağımsız olan yapılardır. Şimdi uygulamamızın diğer kodlarını oluşturalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void Temizle()
{
    for(int i=0;i&amp;lt;this.Controls.Count;i++)
    {
        if(this.Controls[i] is TextBox)
        {
            this.Controls[i].Text="";
        }
    }
}
private void treeView1_AfterSelect(object sender, System.Windows.Forms.TreeViewEventArgs e)
{

    Temizle();
    CultureInfo guncelKultur=(CultureInfo)treeView1.SelectedNode.Tag;
    txtName.Text=guncelKultur.Name;
    txtNativeName.Text=guncelKultur.NativeName;
    txtEnglishName.Text=guncelKultur.EnglishName;

    if(!guncelKultur.IsNeutralCulture)
    {
        RegionInfo bolgeBilgisi=new RegionInfo(guncelKultur.LCID);
        txtCurrency.Text=bolgeBilgisi.CurrencySymbol;
        txtRegion.Text=bolgeBilgisi.DisplayName;
        txtMetric.Text=bolgeBilgisi.IsMetric.ToString();

        Thread.CurrentThread.CurrentCulture=guncelKultur;
        double sayi=4587512.451;
        txtNumber.Text=sayi.ToString("N");

        txtDate.Text=DateTime.Today.ToString("D");

        txtTime.Text=DateTime.Now.ToString("T");
    } 
}&lt;/pre&gt;
&lt;p&gt;TreeView kontrol&amp;uuml;nde her hangibir &amp;ouml;ğe se&amp;ccedil;ildiğinde bu &amp;ouml;ğeye ait bilgiler, textBox kontrollerine doldurulur. Eğer se&amp;ccedil;ilen &amp;ouml;ğe doğal bir k&amp;uuml;lt&amp;uuml;r değilse, yani belirleyici k&amp;uuml;lt&amp;uuml;r ise, bu k&amp;uuml;lt&amp;uuml;r&amp;uuml;n bulunduğu &amp;uuml;lke veya b&amp;ouml;lgeye ait bilgilere ulaşmak i&amp;ccedil;in RegionInfo sınıfına ait bir nesne kullanılır. Bu nesnenin berlileyici bir k&amp;uuml;lt&amp;uuml;re ait olarak oluşturulması sırasında, belirleyici k&amp;uuml;lt&amp;uuml;r&amp;uuml; temsil eden bir değer kullanılır. Bu değer, CultureInfo sınıfının LCID &amp;ouml;zelliği ile elde edilen benzersiz bir belirleyicidir. RegionInfo nesnesi yardımıyla, belirleyici k&amp;uuml;lt&amp;uuml;r&amp;uuml;n bulunduğu b&amp;ouml;lgeye has para birimi, bu b&amp;ouml;lgede metrik sistemin kullanılıp kullanılmadığına dair belirleyici bilgiler elde edilir. Gelelim işin en &amp;ouml;nemli kısmına. Yani uygulamanın se&amp;ccedil;ilen k&amp;uuml;lt&amp;uuml;re g&amp;ouml;re yerelleştirildiği (Localization) kısma.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Thread.CurrentThread.CurrentCulture=guncelKultur;&lt;/pre&gt;
&lt;p&gt;Bu kod satırı ile, &amp;ccedil;alışan proses i&amp;ccedil;in k&amp;uuml;lt&amp;uuml;r değeri, se&amp;ccedil;ilen k&amp;uuml;lt&amp;uuml;re g&amp;ouml;re ayarlanmıştır. Dolayısıyla bu kod satırını izleyen satırlardaki sayısal değer, tarih ve zaman formatları, se&amp;ccedil;ilen k&amp;uuml;lt&amp;uuml;re g&amp;ouml;re ekrana gelecektir. İşte uygulamamız basit bir şekilde yerelleştirme işlemini ger&amp;ccedil;ekleştirmiştir. Şimdi uygulamamızı &amp;ccedil;alıştıralım ve sonu&amp;ccedil;ları g&amp;ouml;zlemleyelim. Programı ilk &amp;ccedil;alıştırdığımızda ve Kulturler başlıklı butona tıkladığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk81_3.gif" alt="" width="584" height="456" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 3. T&amp;uuml;m K&amp;uuml;lt&amp;uuml;rler.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin German doğal k&amp;uuml;lt&amp;uuml;r&amp;uuml;n&amp;uuml; se&amp;ccedil;elim. Bu durumda Almanca dilini konuşan alt k&amp;uuml;lt&amp;uuml;rler g&amp;ouml;r&amp;uuml;necek ve Almanca doğal k&amp;uuml;lt&amp;uuml;r&amp;uuml;ne ait k&amp;uuml;lt&amp;uuml;r kodu, doğal adı ve ingilizce ad bilgileri elde edilecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk81_4.gif" alt="" width="483" height="325" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 4. Almacan (German) Doğal K&amp;uuml;lt&amp;uuml;r&amp;uuml;.&lt;/p&gt;
&lt;p&gt;Şimdi belirleyici k&amp;uuml;lt&amp;uuml;rlerden birini se&amp;ccedil;elim. &amp;Ouml;rneğin Avusturya alt k&amp;uuml;lt&amp;uuml;r&amp;uuml;n&amp;uuml;. Bu durumda bu k&amp;uuml;lt&amp;uuml;re ait yerel bilgiler ekrana gelecek ve uygulama bu noktadan sonra, Avusturya' ya ait yerel bilgilere g&amp;ouml;re sayıları formatlayacak, tarihleri g&amp;ouml;sterecek vb... işlemleri ger&amp;ccedil;ekleştirecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk81_5.gif" alt="" width="560" height="399" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 5. Avusturya K&amp;uuml;lt&amp;uuml;r&amp;uuml;ne ait &amp;ouml;zellikler.&lt;/p&gt;
&lt;p&gt;Şimdi daha u&amp;ccedil; bir &amp;ouml;rnek g&amp;ouml;sterelim. &amp;Ouml;rneğin uygulamamızın Suudi Arabistan k&amp;uuml;lt&amp;uuml;r&amp;uuml;ne g&amp;ouml;re yerelleştirilmek istendiğini farzedelim. Bu durumda ilk akla gelen arap takviminin farklılığıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk81_6.gif" alt="" width="584" height="456" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 6. Arabistanda durum dahada karışık.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece bir uygulamanın, belirli bir k&amp;uuml;lt&amp;uuml;re g&amp;ouml;re yerelleştirilmesini g&amp;ouml;rm&amp;uuml;ş olduk. Diğer taraftan, uygulamamızın farklı dillere g&amp;ouml;re destek vermesinide isteyebiliriz. İşte bu noktada devreye Resource Files (Kaynak Dosyalar) girmektedir. Bu konuyu ise bir sonraki makalemizde incelemeye &amp;ccedil;alışacağız. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-08-05 09:00:00</pubDate>
  <slug>Localization-(Yerellestirme)-1-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>localization</tag>
    <tag>globalization</tag>
    <tag>multi-language</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>