<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Workflow Foundation Öğreniyorum - Ders 11 - WCF Servislerini Kullanmak</title>
  <description>NedirTv?com sponsorluğunda sürdürdüğümüz "Workflow Foundation 4.0 Öğreniyorum" serimizin on ikinci(11+1) dersi ile karşınızdayız. Servisler, yazılım geliştirme dünyasının olmazsa olmaz parçalarından birisidir. Özellikle son yıllarda servis geliştirme yaklaşımının parlayan yıldızı WCF Servisleri olarak düşünülebilir. Önceki dağıtık mimari geliştirme modellerini tek bir çatı altında birleştirmeyi başaran bu Microsoft yaklaşımı, Workflow Foundation ile de yakın ilişki içerisindedir. Bilindiği üzere servisleri kullanan istemciler çeşitli tipte olabilirler. Workflow örnekleri de bu anlamda birer istemci olarak görülebilirler. Bu durumda, bir Workflow örneği içerisinden WCF Servis Operasyonlarının çağırılması da söz konusudur. İşte bu görsel dersimizde söz konusu çağrı işlemlerini en basit haliyle ele almaya çalışıyoruz. Öyle ki; neredeyse Toolbox-&gt;Messaging sekmesinde yer alan ve servisler ile olan haberleşme işlemleri için kullanılan bileşenlerinden hiç birine dokunmadan. Nasıl mı? Haydi gelin öğrenelim.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f5%2fwfOgreniyorum_Ders11.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;a title="NedirTv?com" href="http://www.nedirtv.com/" target="_blank"&gt;&lt;strong&gt;NedirTv?com&lt;/strong&gt;&lt;/a&gt; sponsorluğunda s&amp;uuml;rd&amp;uuml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z &lt;a title="Workflow Foundation &amp;Ouml;ğreniyorum" href="http://www.nedirtv.com/kategori/Workflow-Foundation-Ogreniyorum.aspx" target="_blank"&gt;&lt;strong&gt;"Workflow Foundation 4.0 &amp;Ouml;ğreniyorum"&lt;/strong&gt;&lt;/a&gt; serimizin &lt;strong&gt;on ikinci(11+1) &lt;/strong&gt;dersi ile karşınızdayız. Servisler, yazılım geliştirme d&amp;uuml;nyasının olmazsa olmaz par&amp;ccedil;alarından birisidir. &amp;Ouml;zellikle son yıllarda servis geliştirme yaklaşımının parlayan yıldızı &lt;strong&gt;WCF &lt;/strong&gt;Servisleri olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. &amp;Ouml;nceki dağıtık mimari geliştirme modellerini tek bir &amp;ccedil;atı altında birleştirmeyi başaran bu Microsoft yaklaşımı, &lt;strong&gt;Workflow Foundation &lt;/strong&gt;ile de yakın ilişki i&amp;ccedil;erisindedir. Bilindiği &amp;uuml;zere servisleri kullanan istemciler &amp;ccedil;eşitli tipte olabilirler. Workflow &amp;ouml;rnekleri de bu anlamda birer istemci olarak g&amp;ouml;r&amp;uuml;lebilirler. Bu durumda, bir &lt;strong&gt;Workflow &lt;/strong&gt;&amp;ouml;rneği i&amp;ccedil;erisinden &lt;strong&gt;WCF Servis Operasyonlarının &lt;/strong&gt;&amp;ccedil;ağırılması da s&amp;ouml;z konusudur. İşte bu g&amp;ouml;rsel dersimizde s&amp;ouml;z konusu &amp;ccedil;ağrı işlemlerini en basit haliyle ele almaya &amp;ccedil;alışıyoruz. &amp;Ouml;yle ki; neredeyse &lt;strong&gt;Toolbox-&amp;gt;&lt;/strong&gt;&lt;strong&gt;Messaging &lt;/strong&gt;sekmesinde yer alan ve servisler ile olan haberleşme işlemleri i&amp;ccedil;in kullanılan bileşenlerinden hi&amp;ccedil; birine dokunmadan. Nasıl mı? Haydi gelin &amp;ouml;ğrenelim.&lt;/p&gt;
&lt;p&gt;&lt;iframe src="https://www.youtube.com/embed/46xv4Bm8oJ0" width="420" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;&lt;a title="Ders 11 - WCF Servislerini Kullanmak" href="http://nedirtv.com/video/ders-11---wcf-servislerini-kullanmak" target="_blank"&gt;Ders 11 - WCF Servislerini Kullanmak&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;S&amp;uuml;re : 24:34&lt;/p&gt;
&lt;p&gt;Dosya Boyutu : 34.7 Mb&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek : &lt;a href="/pics/2010%2f5%2fLesson11.rar"&gt;Lesson11.rar (110,13 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2010-07-12 12:41:00</pubDate>
  <slug>Workflow-Foundation-Ogreniyorum-Ders-11-WCF-Servislerini-Kullanmak</slug>
  <tags>
    <tag>workflow-foundation-40</tag>
    <tag>workflow-foundation</tag>
    <tag>visual-studio-2010</tag>
  </tags>
  <categories>
    <category>Workflow Foundation Öğreniyorum</category>
  </categories>
</post>