<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Rust Pratikleri - HTTP Sunucusu Yazmak/Yazmaya Çalışmak</title>
  <description>Bir HTTP sunucusu yazmaya ne gerek var diyebilirsiniz. Öyle düşünmeyin. Bir programlama dilini öğrenmenin en iyi yolu, var olan yapıları o dille yazmaya çalışmaktır. Hangi dil ya da platform olursa olsun ortada dolaşan yüzlerce HTTP server zaten var. Ancak nasıl çalıştıklarını anlamak için de yine yeniden yazmakta yarar var. Bugünkü pratiğimizde Rust dilini kullanarak bir HTTP server nasıl yazılabilir incelemeye çalışacağız. Esasında sadece minik bir başlanıç yapacağız. Nitekim bir HTTP sunucusunun görevleri çok geniş olabilir. Sonuçta IIS Server yazmayacağız ancak genel felsefeyi öğreneceğiz.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2022/Mart/crayz_server.png" alt="" /&gt;Bir HTTP sunucusu yazmaya ne gerek var diyebilirsiniz. &amp;Ouml;yle d&amp;uuml;ş&amp;uuml;nmeyin. Bir programlama dilini &amp;ouml;ğrenmenin en iyi yolu, var olan yapıları o dille yazmaya &amp;ccedil;alışmaktır. Hangi dil ya da platform olursa olsun ortada dolaşan y&amp;uuml;zlerce HTTP server zaten var. Ancak nasıl &amp;ccedil;alıştıklarını anlamak i&amp;ccedil;in de yine yeniden yazmakta yarar var. Bug&amp;uuml;nk&amp;uuml; pratiğimizde bir HTTP server Rust programlama dili ile nasıl yazılabilir incelemeye &amp;ccedil;alışacağız. Esasında minik bir başlanı&amp;ccedil; yapacağız. Nitekim bir HTTP sunucusunun g&amp;ouml;revleri &amp;ccedil;ok geniş olabilir.&lt;/p&gt;
&lt;p&gt;Tipik bir HTTP sunucusuna talep yollandığında bu belli bir protokol ve standarda g&amp;ouml;re ger&amp;ccedil;ekleşir. HTTP protokol&amp;uuml;n&amp;uuml;n gereği olarak ge&amp;ccedil;erli bir metot ile ilintili paketler s&amp;ouml;z konusudur. Sunucu bir IP adresi ve port &amp;uuml;st&amp;uuml;nden gelen mesajları dinler ve gerekli &amp;ccedil;ıktıları hazırlar. Sunucu tarafından &amp;uuml;retilen i&amp;ccedil;erik kimi zaman bir web sayfası kimi zaman da bir JSON &amp;ccedil;ıktısıdır. İşin aslı gelen veriyi yorumladıktan sonra nasıl bir şeyler d&amp;ouml;nd&amp;uuml;receğimiz bize bağlıdır. Lakin end&amp;uuml;striyel dinamikler g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında u&amp;ccedil; tarafların yorumlayacağı standartlar bellidir. HTML, JSON, XML, PDF vs gibi &amp;ccedil;eşitli t&amp;uuml;rden tipler&lt;em&gt;(Content Types)&lt;/em&gt; s&amp;ouml;z konusu olabilir. Bu pratikteki temel amacımız TCP paketi olarak gelen binary i&amp;ccedil;eriği HTTP mesajı olarak yorumlamaya &amp;ccedil;alışmak olacak.&amp;nbsp;Ele almaya &amp;ccedil;alışacağımız HTTP i&amp;ccedil;eriklerine bir bakalım.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;Ouml;rnek bir GET paketi

GET /query?word=red HTTP/1.1
Host: localhost:5555
User-Agent: curl/7.68.0
Accept: *//*

&amp;Ouml;rnek bir POST paketi

POST /movies/ HTTP/1.1
Host: localhost:5555
User-Agent: curl/7.68.0
Accept: *//*
Content-Type: application/json
Content-Length: 36

{"message":"only one ping Vaseley."}&lt;/pre&gt;
&lt;p&gt;Tabii PUT, DELETE, PATCH, HEAD ve daha bir &amp;ccedil;ok HTTP metodu mevcut bildiğiniz &amp;uuml;zere. Ancak en azından gelen GET ve POST paketlerini yakalasak girizgah i&amp;ccedil;in yeterli. HTTP Get paketlerinde işimiz nispeten kolay. İlk satırı okuyup ayrıştırdığımızda GET ifadesini, takip eden kısımda path ve varsa querystring b&amp;ouml;l&amp;uuml;mlerini,&amp;nbsp;son olarak da protokol versiyonunu &amp;ouml;ğrenmek m&amp;uuml;mk&amp;uuml;n. POST işlemi s&amp;ouml;z konusu olduğunda da mesajın g&amp;ouml;vde kısmına inip JSON i&amp;ccedil;eriğini yakalamak kafi.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek uygulamamızda gelen paketi bir veri yapısında&lt;em&gt;(struct)&lt;/em&gt; tutacağız. İ&amp;ccedil;erik&amp;nbsp;stream &amp;uuml;st&amp;uuml;nden binary olarak gelecektir. Rust a&amp;ccedil;ısından d&amp;uuml;ş&amp;uuml;necek olursak u8 tipinden oluşan bir veri dilimi olacağını s&amp;ouml;yleyebiliriz. Bu i&amp;ccedil;eriği built-in trait tiplerini de kullanarak uygun veri modeline d&amp;ouml;n&amp;uuml;şt&amp;uuml;rebiliriz. Trait'leri kullanmak adına iyi bir pratik olur. Şimdi hi&amp;ccedil; vakit kaybetmeden &amp;ouml;rneğimizi geliştirmeye başlayalım.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;cargo new crayz_server
cd crayz_server

# Genel tipleri ayrı bir mod&amp;uuml;l i&amp;ccedil;inde toplayalım
touch src/lib.rs&lt;/pre&gt;
&lt;p&gt;O kadar &amp;ccedil;ılgın bir sunucu yazacağız ki HTTP Get ve Post paketlerini yorumlayacak :P &lt;em&gt;(Bu arada &amp;ouml;rnek kodların tamamına &lt;a title="rust crayz server" href="https://github.com/buraksenyurt/rust-farm/tree/main/Practices/crayz_server" target="_blank"&gt;github reposundan&lt;/a&gt; erişebilirsiniz)&lt;/em&gt; K&amp;uuml;t&amp;uuml;phanemizdeki enstr&amp;uuml;manları farklı mod&amp;uuml;ller i&amp;ccedil;erisinde barındırabiliriz. Sunucu ile ilgili olanları server, http katmanı ile ilgili olanları da http mod&amp;uuml;l&amp;uuml;nde tutabiliriz.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Uygulamamızda hata tiplerimiz ve loglama i&amp;ccedil;in bazı yardımcı Rust k&amp;uuml;t&amp;uuml;phaneleri kullanmaktayız. log, env_logger ve thiserror. İlgili paketleri toml dosyasındaki dependencies kısmına eklemeyi unutmayın.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;[dependencies]&lt;/strong&gt;&lt;br /&gt;log="0.4.14"&lt;br /&gt;env_logger = "0.9.0"&lt;br /&gt;thiserror="1.0.30"&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;İlk olarak ihtiyacımız olan temel veri yapılarını yazarak kodlamaya başlayalım. Bir talebi Request isimli veri yapısı olarak tasarlayabiliriz. Sonu&amp;ccedil;ta binary olarak gelen i&amp;ccedil;eriğin kod tarafında anlamlı bir nesne olarak dolaşması idealdir. Gelen talebin d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmesi sırasında bir takım problemler de s&amp;ouml;z konusu olabilir. &amp;Ouml;rneğin encoding ge&amp;ccedil;ersiz olabilir, HTTP metodu yanlıştır ya da protokol ge&amp;ccedil;ersizdir vs. Bu tip sıkıntılar bir tarayıc &amp;uuml;st&amp;uuml;nden veya curl gibi bir komut satırı aracından geliniyorsa nispeten zor ortaya &amp;ccedil;ıkar ancak tedbir almakta yarar vardır. &amp;Uuml;stelik basit bir Error tipini de nasıl kullanacağımızı g&amp;ouml;rm&amp;uuml;ş oluruz. S&amp;ouml;z konusu hata tipi i&amp;ccedil;in aşağıdaki gibi bir Enum t&amp;uuml;r&amp;uuml; kullanabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;#[derive(Debug, Error)]
pub enum RequestError {
    #[error("Paket ge&amp;ccedil;ersiz")]
    Invalid,
    #[error("Ge&amp;ccedil;ersiz HTTP komutu")]
    Command,
    #[error("Protokol ge&amp;ccedil;ersiz")]
    Protocol,
    #[error("Sorunlu encoding")]
    Encoding,
    #[error("HTTP ile uyumlu değil")]
    NotCompatible,
}&lt;/pre&gt;
&lt;p&gt;HTTP metotlarını Command isimli bir enum ile temsil edebiliriz. Hatta bir String'i bu veri yapısına d&amp;ouml;n&amp;uuml;şt&amp;uuml;rmek i&amp;ccedil;in FromStr trait'ini s&amp;ouml;z konusu veri yapısı i&amp;ccedil;in yeniden yazabiliriz. Aynen aşağıda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;#[derive(Debug, PartialEq)]
pub enum Command {
    Get,
    Post,
    Put,
    Delete,
}

/// string'ten Command elde etme davranışını uygular
impl FromStr for Command {
    type Err = RequestError;

    /*
    from_str trait'ini Command veri yapısı i&amp;ccedil;in yeniden programladık.
    B&amp;ouml;ylece bir string'i ele alıp uygun Command nesnesini elde edebiliriz.
    Ge&amp;ccedil;erli bir command nesnesi değilse de RequestError d&amp;ouml;nd&amp;uuml;rmekteyiz.
    Bu fonksiyonu Request veri yapısında ele aldığımız TryFrom trait i&amp;ccedil;erisinde kullanacağız.
     */
    fn from_str(s: &amp;amp;str) -&amp;gt; Result&amp;lt;Self, Self::Err&amp;gt; {
        match s {
            "GET" =&amp;gt; Ok(Self::Get),
            "POST" =&amp;gt; Ok(Self::Post),
            "DELETE" =&amp;gt; Ok(Self::Delete),
            "PUT" =&amp;gt; Ok(Self::Put),
            _ =&amp;gt; {
                error!("Ge&amp;ccedil;ersiz bir metot geldi.");
                Err(RequestError::Command)
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Enum t&amp;uuml;r&amp;uuml; olarak tasarlanan Command d&amp;ouml;rt temel HTTP metodunu temsil etmekte. Debug dışında PartialEq tarit'ini de devralmakta. Kodun ilerleyen kısımlarında bir Command değişkeninin Post olup olmadığına bakacağız. Bu karşılaştırma i&amp;ccedil;in enum sabitinin PartialEq davranışını taşıması gerekiyor. Asıl &amp;ouml;ğretici kısım from_str fonksiyonu. Parametre olarak gelen string literal değerine g&amp;ouml;re uygun bir Command nesnesi veya RequestError ile hata bilgisi d&amp;ouml;n&amp;uuml;yor. Bu trait'i yeniden programladığımız i&amp;ccedil;in artık aşağıdaki gibi bir ifade yazmamız pekala m&amp;uuml;mk&amp;uuml;n.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;let c = Command::from_str("GET")?;&lt;/pre&gt;
&lt;p&gt;Taleplere ait method ve path bilgisini de Reuqest isimli veri yapısında tutabiliriz. Bu struct'ı ve ilgili fonksiyonlarını aşağıdaki gibi yazarak devam edelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;/// HTTP Request i&amp;ccedil;eriğini tutar.
pub struct Request&amp;lt;'a&amp;gt; {
    pub method: Command,
    pub path: &amp;amp;'a str,
    pub body: &amp;amp;'a str,
}

impl&amp;lt;'a&amp;gt; Request&amp;lt;'a&amp;gt; {
    /// Yeni bir HTTP Request oluşturmak i&amp;ccedil;in kullanılır.
    pub fn new(method: Command, path: &amp;amp;'a str, body: &amp;amp;'a str) -&amp;gt; Self {
        Request { method, path, body }
    }
}

impl&amp;lt;'a&amp;gt; Display for Request&amp;lt;'a&amp;gt; {
    fn fmt(&amp;amp;self, f: &amp;amp;mut Formatter&amp;lt;'_&amp;gt;) -&amp;gt; std::fmt::Result {
        write!(f, "{:?}, {}, {}", self.method, self.path, self.body)
    }
}&lt;/pre&gt;
&lt;p&gt;Elimizde Request, RequestError ve Command nesneleri var. Şunu da biliyoruz ki TCP dinleyicisi kendisine gelen byte array'leri yakalıyor. Byte array'den kastımız esasında 8 bitlik işaretsiz sayılardan oluşan bir dizi. Peki u8 t&amp;uuml;r&amp;uuml;nden bir veri dilimini Request t&amp;uuml;r&amp;uuml;ne nasıl d&amp;ouml;n&amp;uuml;şt&amp;uuml;rebiliriz? Bu her zaman doğru bir d&amp;ouml;n&amp;uuml;ş&amp;uuml;m olmayacaktır ama denettirebiliriz. Bunun i&amp;ccedil;in TryFrom trait'i bi&amp;ccedil;ilmiş kaftan. Request veri yapımız i&amp;ccedil;in onu aşağıdaki gibi uyguladığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;impl&amp;lt;'a&amp;gt; TryFrom&amp;lt;&amp;amp;'a [u8]&amp;gt; for Request&amp;lt;'a&amp;gt; {
    type Error = RequestError;

    fn try_from(value: &amp;amp;'a [u8]) -&amp;gt; Result&amp;lt;Request&amp;lt;'a&amp;gt;, Self::Error&amp;gt; {
        /*
            Pattern matching kullanımı yerine ? operat&amp;ouml;r&amp;uuml; ile işi kısaltabiliriz.

            from_utf8 fonksiyonu eğer gelen parametreyi &amp;ccedil;&amp;ouml;z&amp;uuml;mleyemezse ParseError verir.
            or fonksiyonunda, ParseError olması halinde kendi Encoding error nesnemizi
            d&amp;ouml;nd&amp;uuml;receğimizi belirtiyoruz.

            ? operat&amp;ouml;r&amp;uuml; encoding sorunu yoksa, &amp;ccedil;&amp;ouml;z&amp;uuml;mlenmiş i&amp;ccedil;eriğin package nesnesine
            alınmasını sağlar.
        */

        let package = str::from_utf8(value).or(Err(RequestError::Encoding))?;

        /*
           Gelen HTTP paketi satır satır akacaktır. &amp;Ouml;rneğin aşağıdaki gibi,

           POST /movies/ HTTP/1.1
           Host: localhost:5555
           User-Agent: curl/7.68.0
           Accept: *//*
           Content-Type: application/json
           Content-Length: 36

           {"message":"only one ping Vaseley."}

           ya da

           GET /query?word=red HTTP/1.1
           Host: localhost:5555
           User-Agent: curl/7.68.0
           Accept: *//*

           Satır bazında gelen isteği ayrıştırıp &amp;ouml;rneğin ilk satırdan HTTP metodu,
           path, query string son kısımdan JSON content vs almamız m&amp;uuml;mk&amp;uuml;n.
        */

        // Gelen i&amp;ccedil;eriği satır bazında bir vector i&amp;ccedil;inde topluyoruz.
        let parts: Vec&amp;lt;&amp;amp;str&amp;gt; = package.split('\n').collect();
        for p in &amp;amp;parts {
            info!("Part -&amp;gt; {}", p);
        }

        let first_row = parts[0];
        let cmd: Vec&amp;lt;&amp;amp;str&amp;gt; = first_row.split(' ').collect();

        /*
            Eğer sadece HTTP paketlerini ele alacaksak ilk satırda en azından

            GET /authors/ HTTP/1.1

            benzeri bir i&amp;ccedil;erik olmalı.
            Dolayısıyla ilk satırın split edilmiş hali 3 eleman olmalı.
        */
        if cmd.len() != 3 {
            return Err(RequestError::Invalid);
        }

        let protocol = cmd[2];
        if !protocol.contains("HTTP") {
            return Err(RequestError::Protocol);
        }

        // from_str trait'ini yukarıda Command veri yapısına uyarlamıştık
        let c = Command::from_str(cmd[0])?;
        // Http metodunun Post olması halinde JSON i&amp;ccedil;eriğini almayı da deneyebiliriz.
        let body = match c {
            Command::Post =&amp;gt; parts[parts.len() - 1].trim(),
            _ =&amp;gt; "",
        };
        Ok(Self::new(c, cmd[1], body))
    }
}&lt;/pre&gt;
&lt;p&gt;Buraya kadar yaptıklarımızla aslında&amp;nbsp;byte byte gelen bir paketi anlamlı bir HTTP talebine kolaylıkla d&amp;ouml;n&amp;uuml;şt&amp;uuml;rebiliriz. En azından HTTP Get ve POST paketleri i&amp;ccedil;in &amp;ccedil;alışır bir sistem s&amp;ouml;z konusu olduğunu ifade edebilirim. Neden bu tip bir d&amp;ouml;n&amp;uuml;ş&amp;uuml;me ihtiya&amp;ccedil; duyduğumuzu sorgulayabilirsiniz. Sonu&amp;ccedil;ta crayz_server bir HTTP sunucusu. Dolayısıyla kendisine gelen HTTP isteklerini dinlemekte. Bu istekler sisteme birer byte i&amp;ccedil;eriği olarak girmekte. Sistem i&amp;ccedil;erisindeki diğer enstr&amp;uuml;manların onu kullanabilmesi i&amp;ccedil;in Rust'ın anladığı şekle d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmesi lazım. Hatta bir framework geliştiriyorsak da bu b&amp;ouml;yle olmalı. Onu kullanan yazılımcı i&amp;ccedil;in anlamlı veri yapıları ve fonksiyonlar sunabilmeliyiz. Yazılımcı&amp;nbsp;anlayamayacağı byte serileri ile&amp;nbsp;uğraşmak yerine Command::Get, Request::GetContent gibi enstr&amp;uuml;manları kullanabilmeli.&lt;/p&gt;
&lt;p&gt;Bu felsefe aktarımından sonra &amp;ouml;rneğimize geri d&amp;ouml;nelim. Artık paketleri dinleyen sunucu tarafını inşa edebiliriz. Bunun i&amp;ccedil;in gerekli yapıları server isimli mod&amp;uuml;lde konuşlandırabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;/// HTTP Sunucu motoru ile ilgili &amp;ccedil;ekirdek fonksiyonellikleri barındırır.
pub mod server {
    use crate::http::request::Request;
    use log::{error, info};
    use std::fmt::{Display, Formatter};
    use std::io::Read;
    use std::net::TcpListener;

    /// Sunucu bilgilerini taşıyan veri yapısı.
    pub struct Server&amp;lt;'a&amp;gt; {
        root: &amp;amp;'a str,
        port: u16,
        alias: &amp;amp;'a str,
    }

    impl&amp;lt;'a&amp;gt; Display for Server&amp;lt;'a&amp;gt; {
        fn fmt(&amp;amp;self, f: &amp;amp;mut Formatter&amp;lt;'_&amp;gt;) -&amp;gt; std::fmt::Result {
            write!(f, "({})-&amp;gt;{}:{}", self.alias, self.root, self.port)
        }
    }

    impl&amp;lt;'a&amp;gt; Server&amp;lt;'a&amp;gt; {
        /// Yeni bir sunucu nesnesi &amp;ouml;rnekler.
        pub fn new(root: &amp;amp;'a str, port: u16, alias: &amp;amp;'a str) -&amp;gt; Self {
            Server { root, port, alias }
        }

        fn address(&amp;amp;self) -&amp;gt; String {
            format!("{}:{}", &amp;amp;self.root, &amp;amp;self.port)
        }

        /// Sunucuyu dinleme modunda başlatır
        pub fn run(self) {
            /*
               Tipik bir HTTP sunucusu başlatıldığında sonsuz bir d&amp;ouml;ng&amp;uuml;de talep dinler.
               Dolayısıyla run fonksiyonu sonlandığında self ile ifade edilen ve
               sahiliği(ownership)'i alınan Server nesnesinin deallocate edilmesinde yarar vardır.
               Bu sebepten &amp;amp;self yerine self kullandık.
            */
            info!("{} başlatılıyor...", self.address());
            /*
                Sunucuyu hazırlamak i&amp;ccedil;in TcpListener'ın bind fonksiyonu kullanılır.
            */
            let listener = TcpListener::bind(&amp;amp;self.address());
            match listener {
                Ok(l) =&amp;gt; {
                    info!("{} başlatıldı...", self.to_string());
                    // Gelen talepleri sonsuz bir d&amp;ouml;ng&amp;uuml;de dinleyebiliriz.
                    loop {
                        // Gelen yeni bağlantıları match ifadesi ile kontrol altına alıyoruz.
                        match l.accept() {
                            Ok((mut stream, addrees)) =&amp;gt; {
                                info!("İstemci -&amp;gt; {}", addrees.to_string());

                                /*
                                    İstemciden gelen talebi belli bir boyuttaki dizi i&amp;ccedil;erisine almalıyız
                                    read trait'inin TcpStream i&amp;ccedil;in implemente edilmiş versiyonu,
                                    gelen i&amp;ccedil;eriği mutable bir dizi i&amp;ccedil;erisine yazmak &amp;uuml;zere tasarlanmış.
                                    Başlangı&amp;ccedil; i&amp;ccedil;in 1024 elemanlı bir array g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.
                                */
                                let mut buffer = [0_u8; 1024];
                                match stream.read(&amp;amp;mut buffer) {
                                    Ok(l) =&amp;gt; {
                                        let msg = String::from_utf8(buffer[0..l].to_vec());
                                        info!("Gelen bilgi -&amp;gt; {:?}", msg.unwrap());
                                        // Request tipini try_from ile donatmıştık. Dolayısıyla gelen mesajı Request t&amp;uuml;r&amp;uuml;ne &amp;ccedil;evirmeyi deneyebiliriz.
                                        let converted_msg = Request::try_from(&amp;amp;buffer[..]);
                                        match converted_msg {
                                            Ok(r) =&amp;gt; {
                                                info!("Request d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml; başarılı.{}", r.to_string())
                                            }
                                            Err(e) =&amp;gt; {
                                                error!("{:?}", e)
                                            }
                                        }
                                    }
                                    Err(e) =&amp;gt; {
                                        error!("Stream okumada hata -&amp;gt; {}", e);
                                    }
                                }
                            }
                            Err(e) =&amp;gt; {
                                error!("Bağlantı sağlanırken bir hata oluştu. Hata detayı -&amp;gt; {}", e)
                            }
                        }
                    }
                }
                Err(e) =&amp;gt; {
                    error!("Sunucu başlatılamadı. Hata detayı -&amp;gt; {}", e);
                }
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Kodun en &amp;ouml;nemli kısmı run fonksiyonunun i&amp;ccedil;eriği. Burada bir TcpListener oluşturulmakta ve sonsuz bir d&amp;ouml;ng&amp;uuml; yardımıyla gelen talepleri dinlemesi sağlanmakta. Talepler bir stream &amp;uuml;zerine akmakta. Bu stream i&amp;ccedil;eriğini basit olması a&amp;ccedil;ısından 1024 byte ile sınırladık. Yani 1 kilobyte b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;ndeki i&amp;ccedil;eriği ele aldığımızı ifade edebiliriz. Yakalanan paketlere ne yaptığımıza dikkat edin... Request veri modeline &amp;ouml;ğrettiğimiz try_parse fonksiyonu ile Request değişkenine d&amp;ouml;n&amp;uuml;şt&amp;uuml;rmeye &amp;ccedil;alışıyoruz. Sonrasında yaptığımız tek şey başarılı bir d&amp;ouml;n&amp;uuml;ş&amp;uuml;m ger&amp;ccedil;ekleşmişse bunu log olarak basmak. Esasında istemciye HTTP metodunun tipine g&amp;ouml;re uygun d&amp;ouml;n&amp;uuml;ş kodu ile bir bilgi vermek gerekiyor &amp;ouml;yle değil mi? İşte size bir &amp;ouml;dev daha. Ben &lt;a title="rust crayz server" href="https://github.com/buraksenyurt/rust-farm/tree/main/Practices/crayz_server" target="_blank"&gt;github reposunda&lt;/a&gt; bu şekilde geliştirmeye devam edeceğim. Ne yazık ki bu yazıya yetişmedi.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak program &amp;ccedil;alışmaya başladığında sunucunun ayağa kalkması ve bir şeyler dinlemeye başlaması gerekiyor. Bu ama&amp;ccedil;la main fonksiyonunu aşağıdaki gibi yazarak devam edebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;use crayz_server::server::Server;

fn main() {
    // loglamayı a&amp;ccedil;tık
    env_logger::init();

    // Server veri yapımızı kullanarak bir &amp;ouml;rnek oluşturduk
    let alpha = Server::new("0.0.0.0".to_string(), 5555_u16, "localhost".to_string());
    // run fonksiyonunu &amp;ccedil;ağırıp sunucuyu başlatıyoruz. ya da başlatamıyoruz :)
    alpha.run();
}&lt;/pre&gt;
&lt;p&gt;Soyutlamanın g&amp;uuml;zelliğini main fonksiyonunda yakalıyoruz. Her şey run i&amp;ccedil;erisinde olup bitiyor :) &amp;Ouml;yleyse bir test s&amp;uuml;r&amp;uuml;ş&amp;uuml;ne &amp;ccedil;ıkalım mı?&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# TcpListener ile dinelemeye başladıktan sonra test etmek istersek
# &amp;Ouml;nce uygulamayı aşağıdaki gibi başlatıp,
RUST_LOG=info cargo run
# ardından ikinci bir terminal a&amp;ccedil;ıp aşağıdaki komutlar ile mesaj g&amp;ouml;ndermeyi deneyebiliriz.
echo "ping" | netcat localhost 5555
echo "ping pong" | netcat localhost 5555
curl localhost:5555
curl http://localhost:5555/query?word=red
curl -X POST http://localhost:5555/movies/ -H 'Content-Type: application/json' -d '{"message":"only one ping Vaseley."}'

# Hatta tarayıcı a&amp;ccedil;ıp http://localhost:5555/ping ile talep yapmayı da deneyebiliriz.&lt;/pre&gt;
&lt;p&gt;İ&amp;ccedil;eride bir takım tedbirler almıştık. HTTP Get, Post, Put, Delete harici olanlar ele alınamayacaktı. Dolayısıyla netcat ile localhost:5555 adresine basit bir ping g&amp;ouml;nderdiğimizde ilgili paketin işlenmemesi ve hatta bir RequestError yayınlanması gerekir. Hatta mızmızlık yapıp sunucuya ping pong oynamak istediğinizi&amp;nbsp;s&amp;ouml;ylesek&amp;nbsp;bile durum değişmez.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Mart/crayz_server_3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sorun netcat aracındadır diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;p curl ile denesek nasıl olur?&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Mart/crayz_server_5.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hımmm... Bir yerlere vardık gibi. &amp;Uuml;zerinde &amp;ccedil;alışmakta olduğum ubuntu sistemi i&amp;ccedil;in curl komutu HTTP komutlarını g&amp;ouml;ndermek i&amp;ccedil;in bi&amp;ccedil;ilmiş kaftandır. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere hem root hem de query gibi path'lere yapılan talepleri yakalayabiliyoruz. Bir &amp;ouml;dev olarak query string parametresini ve değerini yakalamayı deneyebilirsiniz. Hatta bu noktada programın bir bug'ı da olabilir. Mesela querystring parametre değerlerinde boşluk karakteri varsa...Sonu&amp;ccedil;ta sunucunun yorumlaması gereken bir bilgi.&lt;/p&gt;
&lt;p&gt;Yazdığımız &amp;ouml;rnek i&amp;ccedil;in son olarak birde HTTP Post talebi g&amp;ouml;ndermeyi deneyelim. Body kısmında birde JSON i&amp;ccedil;eriği olsun.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Mart/crayz_server_json.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil; hi&amp;ccedil; de fena değil. POST ile gelen mesajın komple i&amp;ccedil;eriğini yakalamış bulunuyoruz. Mesaj i&amp;ccedil;eriğinde doksanlı yılların efsane filmlerinden birisine g&amp;ouml;nderme de var...Bakalım hangi filmden olduğunu tahmin edebilecek misiniz? Bu arada curl &amp;ccedil;ağrılarına d&amp;ouml;nen "Empty reply from server" mesajları son derece doğal. Nitekim sunucumuz mesajları yakaladı, bir par&amp;ccedil;a yorumladı ama istemci tarafa hi&amp;ccedil;bir bilgi g&amp;ouml;ndermedi.&lt;/p&gt;
&lt;p&gt;İstemci tarafına g&amp;ouml;nderilecek HTTP mesajları i&amp;ccedil;in yine bir veri yapısı tasarlayabiliriz. Bir HTTP cevabında durum kodunu ve &amp;ouml;rnek bir veri par&amp;ccedil;asını yollasak yeterli olur. Header kısmını şimdilik atlayalım işleri karıştırmayalım derim :) Bu ama&amp;ccedil;la response isimli bir mod&amp;uuml;l a&amp;ccedil;ıp i&amp;ccedil;eriğini aşağıdaki gibi geliştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;pub mod response {
        use std::fmt::{Display, Formatter};
        use std::io::{Result, Write};
        use std::net::TcpStream;

        pub struct Response {
            status_code: StatusCode,
            body: Option&amp;lt;String&amp;gt;,
        }

        impl Response {
            pub fn new(status_code: StatusCode, body: Option&amp;lt;String&amp;gt;) -&amp;gt; Self {
                Response { status_code, body }
            }

            pub fn write(&amp;amp;self, stream: &amp;amp;mut TcpStream) -&amp;gt; Result&amp;lt;()&amp;gt; {
                let body = match &amp;amp;self.body {
                    Some(b) =&amp;gt; b,
                    None =&amp;gt; "",
                };
                write!(
                    stream,
                    "HTTP/1.1 {} \r\n\r\n{}",
                    self.status_code.to_string(),
                    body
                )
            }
        }

        /// Birka&amp;ccedil; HTTP stat&amp;uuml; kodunu tutan enum sabiti
        #[derive(Copy, Clone)]
        pub enum StatusCode {
            Ok = 200,
            BadRequest = 400,
            Unauthorized = 401,
            NotFound = 404,
            InternalServerError = 500,
        }

        impl Display for StatusCode {
            fn fmt(&amp;amp;self, f: &amp;amp;mut Formatter&amp;lt;'_&amp;gt;) -&amp;gt; std::fmt::Result {
                /*
                    enum sabitindeki sayısal değeri almak i&amp;ccedil;in dereference işlemi uyguladık.
                    Ancak bunu yaparken StatusCode'un Copy ve Clone trait'lerini uygulamış olması
                    gerekiyor. Nitekim buradaki move işlemi i&amp;ccedil;in kopyalama gerekiyor.
                */
                let code = *self as u16;
                match self {
                    Self::Ok =&amp;gt; write!(f, "{} Ok", code),
                    Self::BadRequest =&amp;gt; write!(f, "{} Bad request", code),
                    Self::Unauthorized =&amp;gt; write!(f, "{} Unauthorized", code),
                    Self::NotFound =&amp;gt; write!(f, "{} Not found", code),
                    Self::InternalServerError =&amp;gt; write!(f, "{} Internal server error", code),
                }
            }
        }
    }&lt;/pre&gt;
&lt;p&gt;Response veri yapısı i&amp;ccedil;erisinde durum kodu i&amp;ccedil;in StatusCode enum sabiti ve String eleman taşıyan Option t&amp;uuml;r&amp;uuml;nden iki alan yer alıyor. StatusCode enum sabiti sembolik olarak Ok, BadRequest, Unauthorized, NotFound, InternalServerError gibi değerler barındırmakta. Response veri yapısına ait değişkenler esasında TcpStream &amp;uuml;st&amp;uuml;nden istemciye g&amp;ouml;nderilecekleri i&amp;ccedil;in write isimli bir fonksiyon uyguladık. Bu fonksiyon dikkat edileceği &amp;uuml;zere bir TcpStream alıyor ve o stream'in &amp;uuml;st&amp;uuml;ne gerekli HTTP d&amp;ouml;n&amp;uuml;ş&amp;uuml;n&amp;uuml; yazıyor. B&amp;ouml;ylece Server nesnesinin run fonksiyonu i&amp;ccedil;erisinde istediğimiz noktalardan anlamlı HTTP cevapları d&amp;ouml;nebiliriz. run fonksiyonunu aşağıdaki gibi değiştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;pub fn run(self) {           
    info!("{} başlatılıyor...", self.address());
    let listener = TcpListener::bind(&amp;amp;self.address());
    match listener {
        Ok(l) =&amp;gt; {
            info!("{} başlatıldı...", self.to_string());
            loop {
                match l.accept() {
                    Ok((mut stream, addrees)) =&amp;gt; {
                        info!("İstemci -&amp;gt; {}", addrees.to_string());
                        let mut buffer = [0_u8; 1024];
                        match stream.read(&amp;amp;mut buffer) {
                            Ok(l) =&amp;gt; {
                                let msg = String::from_utf8(buffer[0..l].to_vec());
                                info!("Gelen bilgi -&amp;gt; {:?}", msg.unwrap());
                                let converted_msg = Request::try_from(&amp;amp;buffer[..]);
                                match converted_msg {
                                    Ok(r) =&amp;gt; {
                                        info!(
                                            "Request d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml; başarılı.{}",
                                            r.to_string()
                                        );
                                        Response::new(
                                                StatusCode::Ok,
                                                Some(String::from("&amp;lt;h1&amp;gt;Would you like to play ping pong?&amp;lt;/h1&amp;gt;")),
                                            ).write(&amp;amp;mut stream).expect("Problem var!");
                                    }
                                    Err(e) =&amp;gt; {
                                        error!("{:?}", e);
                                        Response::new(StatusCode::BadRequest, None)
                                            .write(&amp;amp;mut stream)
                                            .expect("Problem var!");
                                    }
                                }
                            }
                            Err(e) =&amp;gt; {
                                error!("Stream okumada hata -&amp;gt; {}", e);
                                Response::new(StatusCode::InternalServerError, None)
                                    .write(&amp;amp;mut stream)
                                    .expect("Problem var!");
                            }
                        }
                    }
                    Err(e) =&amp;gt; {
                        error!("Bağlantı sağlanırken bir hata oluştu. Hata detayı -&amp;gt; {}", e)
                    }
                }
            }
        }
        Err(e) =&amp;gt; {
            error!("Sunucu başlatılamadı. Hata detayı -&amp;gt; {}", e);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İlave kodlarımız response nesne &amp;ouml;rnekleri &amp;uuml;zerinden write fonksiyonunu &amp;ccedil;ağırdığımız yerler. Duruma g&amp;ouml;re geriye anlamlı bir mesaj g&amp;ouml;ndermekteyiz. &amp;Ouml;rneğin gelen mesaj i&amp;ccedil;eriği başarılı bir şekilde işlendiyse ya da anlaşıldıysa HTTP 200 Ok ile birlikte basit bir HTML &amp;ccedil;ıktısı yolluyoruz. Kim bilir belki istemci "haydi oynayalım" der :D İşte &amp;ouml;rneğin şimdiki halinin &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Mart/crayz_server_last.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;D&amp;ouml;n&amp;uuml;ş bilgisini iyileştirmek, Header bilgisi eklemek ve daha da &amp;ouml;nemlisi gelen talebe g&amp;ouml;re bir &amp;ccedil;ıktı &amp;uuml;retmek sizlere ev &amp;ouml;devi olsun ;) &amp;Ouml;rneğin GET ile gelen taleplerde yer alan path bilgisini kullanarak sunucunun olduğu fiziki diskte yer alan static HTML sayfalarını &amp;ccedil;ıktı olarak d&amp;ouml;nmeyi deneyebilirsiniz. HTTP talebinde gelen path bilgisi elimizde olduğundan bu tip bir y&amp;ouml;nlendirme(routing) nispeten kolay olacaktır. Ancak path bilgisine g&amp;ouml;re bir veri kaynağından JSON &amp;ccedil;ıktı alıp g&amp;ouml;ndermek farklı bir &amp;ccedil;&amp;ouml;z&amp;uuml;m gerektirebilir. Bende pil bittiği i&amp;ccedil;in buraya kadar getirebildim. Gerisi sizde :) B&amp;ouml;ylece geldik bir rust pratiğimizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2022-03-20 09:00:00</pubDate>
  <slug>rust-pratikleri-http-sunucusu-yazmak</slug>
  <tags>
    <tag>rust</tag>
    <tag>rust-pratikleri</tag>
    <tag>rust-programming-language</tag>
    <tag>tcp</tag>
    <tag>http</tag>
    <tag>tcplistener</tag>
    <tag>http-server</tag>
    <tag>server-object-model</tag>
  </tags>
  <categories>
    <category>Rust</category>
  </categories>
</post>