<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Web API'leri Swagger ile Zenginleştirelim</title>
  <description>Bu yazımızda Web API servislerimizi OpenAPI Specification'da belirtilen dokümanlaştırma standartlarına göre nasıl zenginleştirebileceğimizi incelemeye çalışıyoruz. Web api servisinin ne işe yaradığını gösteren ve sunduğu operasyonları hızlıca test edebilmemize olanak tanıyan Swagger arabirimini de deneyimliyoruz.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/08/swagger_8.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Dok&amp;uuml;mantasyon sekt&amp;ouml;r&amp;uuml;m&amp;uuml;z&amp;uuml;n olmazsa olmazları arasında yer alan bir konu. Ancak g&amp;uuml;ncelliğini korumak ve okunabilirliğini sağlamak da bir o kadar zor olabiliyor. Ayrıca dok&amp;uuml;mantasyon hazırlamak da &amp;ccedil;oğumuza bir işkence gibi geliyor. Yine de belirli alanlarda t&amp;uuml;keticilerin iyiliği i&amp;ccedil;in bu dok&amp;uuml;mantasyonları hazırlamak boynumuzun borcu diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Devasa k&amp;uuml;t&amp;uuml;phanalerden oluşan uygulamalarda ger&amp;ccedil;ekten dok&amp;uuml;mantasyon başlı başına bir işken daha k&amp;uuml;&amp;ccedil;&amp;uuml;k alanlarda etkili kullanabileceğimiz yerleri de var.&lt;/p&gt;
&lt;p&gt;Ağırlıklı olarak web servislerini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım&lt;em&gt;(Genel standartlara uyan her t&amp;uuml;r servis olabilir)&lt;/em&gt; Bir servis ne iş yapar, tanımı nedir, i&amp;ccedil;erisinde hangi operasyonları barındırır, bu operasyonların kullanım şekli nasıl olmalıdır, giriş &amp;ccedil;ıkış parametreleri ne t&amp;uuml;rdedir ve akla gelebilecek bir ka&amp;ccedil; soruyu d&amp;uuml;ş&amp;uuml;nelim. Bu sorular ilgili web servisini kullanacak taraf i&amp;ccedil;in kendi geliştirmeleri sırasında &amp;ouml;nem arz eder ve mutlaka hayatımızın bir noktasında entegre etmemiz gereken bir servis olmuştur.&lt;/p&gt;
&lt;p&gt;Eğer bu bir kurum servisi ise genelde elimize tutuşturulan uzun bir Word dok&amp;uuml;manı da olur. Servisin genel yapısı, işleyiş şekli ve diğer bilgilerine buradan bakarız. İşin i&amp;ccedil;inden &amp;ccedil;ıkılır &amp;ccedil;ıkılmasına ama bug&amp;uuml;ne gelindiğinde artık servislerin kendilerini anlattıkları arabirimleri de &amp;uuml;zerinde taşıdıklarını g&amp;ouml;r&amp;uuml;yoruz. Hazır ortalık mikro seviyede sayısız Web API hizmetinden ge&amp;ccedil;ilmiyorken hızlı ama etkili dok&amp;uuml;manlar oluşturmak bu a&amp;ccedil;ıdan &amp;ouml;nemli.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;XML tabanlı dok&amp;uuml;mantasyon konusu&amp;nbsp;aslında .Net'in ilk yıllarından beri hayatımızda yer alıyor. Temiz kod(Clean Code) &amp;ccedil;er&amp;ccedil;evesinde yapılan geliştirmeler bu tip yorum satırlarına gerek bırakmıyor gibi d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir, lakin ilgili XML girdileri otomatik dok&amp;uuml;mantasyon&amp;nbsp;hazırlayan&amp;nbsp;uygulamalar i&amp;ccedil;indir&lt;em&gt;(Basit bir Help dosyası olabileceği gibi, Swagger arabirimi de olabilir)&lt;/em&gt; İşin i&amp;ccedil;erisinde&amp;nbsp;yalın ve hafif Web API'ler s&amp;ouml;z konusu ise XML yorumlarından ka&amp;ccedil;ınmamakta yarar var.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Evrensel&amp;nbsp;anlamda bir standartlaşma da var.&amp;nbsp;&lt;a href="https://swagger.io/specification/" target="_blank"&gt;OpenAPI&lt;/a&gt; bildirimlerine uyan Swagger aray&amp;uuml;zleri Web API hizmetleri i&amp;ccedil;in genel kabul g&amp;ouml;rm&amp;uuml;ş durumda. Bu yazımızdaki amacımız ise bir Web API servisine Swagger modelinde bir yardım dok&amp;uuml;manı eklemek. İşimiz &amp;ccedil;ok kolay ve sonu&amp;ccedil;ları olduk&amp;ccedil;a tatmin edici. İlk olarak bir uygulama oluşturalım ve Swagger kullanımını kolaylaştıracak Swashbuckle paketini ekleyelim.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new webapi -o QuoteWallAPI
dotnet add package Swashbuckle.AspNetCore&lt;/pre&gt;
&lt;p&gt;XML Documentation File'ın etkinleştirilmesi i&amp;ccedil;in proje dosyasına da k&amp;uuml;&amp;ccedil;&amp;uuml;k bir ek yapmamız gerekiyor. PropertyGroup altına GenerateDocumentationFile elementini ekleyip true değerini vermeliyiz. Normalde Visual Studio aray&amp;uuml;z&amp;uuml;nde kolayca yapılabilir ama Visual Studio Code kullanıyorsanız dosya &amp;uuml;st&amp;uuml;nde eklemeniz gerekebilir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Project Sdk="Microsoft.NET.Sdk.Web"&amp;gt;

  &amp;lt;PropertyGroup&amp;gt;
    &amp;lt;TargetFramework&amp;gt;netcoreapp2.1&amp;lt;/TargetFramework&amp;gt;
    &amp;lt;GenerateDocumentationFile&amp;gt;true&amp;lt;/GenerateDocumentationFile&amp;gt;
  &amp;lt;/PropertyGroup&amp;gt;

  &amp;lt;ItemGroup&amp;gt;
    &amp;lt;Folder Include="wwwroot\" /&amp;gt;
  &amp;lt;/ItemGroup&amp;gt;

  &amp;lt;ItemGroup&amp;gt;
    &amp;lt;PackageReference Include="Microsoft.AspNetCore.App" /&amp;gt;
    &amp;lt;PackageReference Include="Swashbuckle.AspNetCore" Version="3.0.0" /&amp;gt;
  &amp;lt;/ItemGroup&amp;gt;

&amp;lt;/Project&amp;gt;&lt;/pre&gt;
&lt;p&gt;Ben standard olarak gelen ValuesController sınıfını QuotesController olarak isimlendirip i&amp;ccedil;eriğini aşağıdaki gibi değiştrdim. Bol miktarda XML Comment ve bir ka&amp;ccedil; tane de nitelik&lt;em&gt;(Attribute)&lt;/em&gt; kullanımı var.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic;
using Microsoft.AspNetCore.Mvc;
using QuoteWallAPI.Models;

namespace QuoteWallAPI.Controllers
{
    ///&amp;lt;summary&amp;gt;
    ///CRUD Controller for Daily Quote
    ///&amp;lt;/summary&amp;gt;
    [Route("api/[controller]")]
    [ApiController]
    public class QuotesController 
        : ControllerBase
    {
        ///&amp;lt;summary&amp;gt;
        ///List all public quotes sorted by most recently liked.
        ///&amp;lt;/summary&amp;gt;
        ///&amp;lt;remarks&amp;gt;with paging, this returns up to 100 quotes.&amp;lt;/remarks&amp;gt;
        ///&amp;lt;return&amp;gt;Quotes list&amp;lt;/return&amp;gt;
        ///&amp;lt;response code="200"&amp;gt;&amp;lt;/response&amp;gt;    
        [Produces("application/json")]  
        [HttpGet]
        public ActionResult&amp;lt;IEnumerable&amp;lt;Quote&amp;gt;&amp;gt; Get()
        {
            return new List&amp;lt;Quote&amp;gt;();
        }

        ///&amp;lt;summary&amp;gt;
        ///Return a specific Quote from ID
        ///&amp;lt;/summary&amp;gt;
        ///&amp;lt;param name="id"&amp;gt;ID of Quote&amp;lt;/param&amp;gt;
        ///&amp;lt;return&amp;gt;Quotes list&amp;lt;/return&amp;gt;
        ///&amp;lt;response code="200"&amp;gt;If found&amp;lt;/response&amp;gt;    
        ///&amp;lt;response code="404"&amp;gt;If not found&amp;lt;/response&amp;gt;
        [Produces("application/json")]
        [HttpGet("{id}")]
        public ActionResult&amp;lt;Quote&amp;gt; Get(int id)
        {
            return new Quote();
        }

        ///&amp;lt;summary&amp;gt;
        ///Add a new Quote to QDB
        ///&amp;lt;/summary&amp;gt;
        ///&amp;lt;param name="value"&amp;gt;JSON content of Quote&amp;lt;/param&amp;gt;
        ///&amp;lt;remarks&amp;gt;
        ///Sample body content
        ///{"id":1,"Text":"Some words..","Author":"you"}
        ///&amp;lt;/remarks&amp;gt;
        ///&amp;lt;response code="201"&amp;gt;Added&amp;lt;/response&amp;gt;    
        [Consumes("application/json")]
        [HttpPost]
        public void Post([FromBody] string value)
        {
        }

        ///&amp;lt;summary&amp;gt;
        ///Update any Quote belongs to a specific Author and ID
        ///&amp;lt;/summary&amp;gt;        
        ///&amp;lt;param name="id"&amp;gt;Identity value of Quote&amp;lt;/param&amp;gt;
        ///&amp;lt;param name="author"&amp;gt;Author of Quote&amp;lt;/param&amp;gt;
        ///&amp;lt;param name="value"&amp;gt;JSON content of updates&amp;lt;/param&amp;gt;
        ///&amp;lt;remarks&amp;gt;
        ///Sample body content
        ///{"Text":"Any update"}
        ///&amp;lt;/remarks&amp;gt;
        ///&amp;lt;response code="201"&amp;gt;Updated&amp;lt;/response&amp;gt;    
        ///&amp;lt;response code="404"&amp;gt;If not found from ID&amp;lt;/response&amp;gt; 
        [HttpPut("{id}")]
        [Consumes("application/json")]
        public void Put(int id,string author, [FromBody] string value)
        {
        }

        ///&amp;lt;summary&amp;gt;
        ///Delete any Quote from QDB
        ///&amp;lt;/summary&amp;gt;
        ///&amp;lt;param name="id"&amp;gt;ID of Quote&amp;lt;/param&amp;gt;
        ///&amp;lt;response code="204"&amp;gt;Deleted&amp;lt;/response&amp;gt;    
        ///&amp;lt;response code="404"&amp;gt;If not found from ID&amp;lt;/response&amp;gt; 
        [HttpDelete("{id}")]
        public void Delete(int id)
        {
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;zet bildirimleri i&amp;ccedil;in summary, &amp;ouml;rnek kod par&amp;ccedil;ası yerleştirmek veya daha fazla bilgi vermek i&amp;ccedil;in remarks, d&amp;ouml;n&amp;uuml;ş tipini bildirmek i&amp;ccedil;in return, HTTP durum kodu i&amp;ccedil;in response, fonksiyon parametreleri i&amp;ccedil;in param elementlerinden yararlanmaktayız. Ayrıca fonksiyonun Request veya Response i&amp;ccedil;erik tipleri i&amp;ccedil;in Consumes ve Produces niteliklerini de ele alıyoruz.&lt;/p&gt;
&lt;p&gt;QuotesController'ın sunduğu 5 standart fonksiyonellik bir şey yapmıyorlar ancak siz kendi &amp;ouml;rneğinizi geliştirirken &amp;ouml;zellikle "Try it out" butonuna basarak yapacağınız test sonu&amp;ccedil;larını g&amp;ouml;rmek i&amp;ccedil;in i&amp;ccedil;eriklerini doldurabilirsiniz. &amp;Ouml;rnekte kullanılan Quote isimli bir Model sınıfımız da var. Onu da dok&amp;uuml;mantasyon i&amp;ccedil;in XML Comment ve bir takım niteliklerle zenginleştirmeliyiz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ComponentModel;
using System.ComponentModel.DataAnnotations;

namespace QuoteWallAPI.Models
{
    ///&amp;lt;summary&amp;gt;
    ///Some quote from you
    ///&amp;lt;/summary&amp;gt;
    public class Quote
    {
        ///&amp;lt;summary&amp;gt;Id of the Quote&amp;lt;/summary&amp;gt;
        [Required]
        public int Id { get; set; }
        ///&amp;lt;summary&amp;gt;Text of the Quote&amp;lt;/summary&amp;gt;
        [Required]
        public string Text { get; set; }
        ///&amp;lt;summary&amp;gt;Author of this Quote&amp;lt;/summary&amp;gt;
        [DefaultValue("Anonymous")]
        public string Author { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Id ve Text elementleri Required olarak işaretlendiler. Bu y&amp;uuml;zden yardım dok&amp;uuml;mantasyonunda * sembol&amp;uuml; taşıyacaklar. Author değişkeni i&amp;ccedil;in varsayılan bir değer belirttik ki bu da Swagger tarafından ele alınacak. Bu nitelikler dışında &amp;ccedil;ok kısa &amp;ouml;zet bilgilere yer veriyoruz.&lt;/p&gt;
&lt;p&gt;Buraya kadar yaptıklarımızla hem Controller hem Model sınıfları hakkında bir ka&amp;ccedil; bilgi sağlamış olduk. Ancak Swagger aray&amp;uuml;z&amp;uuml;n&amp;uuml;n bu i&amp;ccedil;eriği kullanması ve otomatik olarak oluşturulması i&amp;ccedil;in ilgili Middleware par&amp;ccedil;asının eklenmesi lazım. Bunun i&amp;ccedil;in Startup sınıfında&amp;nbsp;bazı eklemeler yapacağız.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.AspNetCore.Builder;
using Microsoft.AspNetCore.Hosting;
using Microsoft.AspNetCore.HttpsPolicy;
using Microsoft.AspNetCore.Mvc;
using Microsoft.Extensions.Configuration;
using Microsoft.Extensions.DependencyInjection;
using Microsoft.Extensions.Logging;
using Microsoft.Extensions.Options;
using Swashbuckle.AspNetCore.Swagger;

namespace QuoteWallAPI
{
    public class Startup
    {
        public Startup(IConfiguration configuration)
        {
            Configuration = configuration;
        }

        public IConfiguration Configuration { get; }

        // This method gets called by the runtime. Use this method to add services to the container.
        public void ConfigureServices(IServiceCollection services)
        {
            services.AddMvc().SetCompatibilityVersion(CompatibilityVersion.Version_2_1);

            services.AddSwaggerGen(g=&amp;gt;{
                g.SwaggerDoc("v2",new Info
                {
                    Title="DailyQuote CRUD API",
                    Version="2.0",
                    Description="Get your friends daily quotes, add something beaty words and more...",
                    Contact=new Contact { Name = "burak", Email = "selim@buraksenyurt.com", Url = "http://www.buraksenyurt.com"}                    
                });

                g.IncludeXmlComments(Path.ChangeExtension(typeof(Startup).Assembly.Location, ".xml"));
            });
        }

        // This method gets called by the runtime. Use this method to configure the HTTP request pipeline.
        public void Configure(IApplicationBuilder app, IHostingEnvironment env)
        {
            if (env.IsDevelopment())
            {
                app.UseDeveloperExceptionPage();
            }
            else
            {
                app.UseHsts();
            }

            //app.UseHttpsRedirection();
            app.UseMvc();

            app.UseSwagger();
            app.UseSwaggerUI(s=&amp;gt;{
                s.SwaggerEndpoint("/swagger/v2/swagger.json","Daily Quote");
            });
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncellikle AddSwaggerGen metodu ile ilgili hizmeti &amp;ccedil;alışma zamanına eklemekteyiz. Burada kullanılan SwaggerDoc i&amp;ccedil;erisinde ana sayfa i&amp;ccedil;in gerekli başlık bilgilerini dolduruyoruz. Servisin adı, versiyon numarası, kısaca ne yaptığının a&amp;ccedil;ıklanması ve kontak kurulabilecek kişi bilgilerine burada yer vermekteyiz. &amp;Ouml;nemli olan kısımlardan birisi de XML dok&amp;uuml;mantasyon dosyasının bildirimi. Aksi belirtilmedik&amp;ccedil;e bu dosya &amp;uuml;retilen dll dosyası ile aynı yerde olacaktır.&lt;/p&gt;
&lt;p&gt;Servisi bu şekilde bildirdikten sonra kullanılması i&amp;ccedil;in de UseSwagger ve UseSwaggerUI fonksiyonlarından yararlanmaktayız. Bir endpoint veriyoruz ki kullanıcılar veya servis kaşifi olan botlar kolaylıkla yardım dok&amp;uuml;manına erişebilsinler.&lt;/p&gt;
&lt;p&gt;Bu &amp;ccedil;alışmalar sonrasında&amp;nbsp;XML comment'lerinin bir dosya olarak Bin klas&amp;ouml;r&amp;uuml; altında oluştuğunu da g&amp;ouml;rebiliriz. İstersek buradan da i&amp;ccedil;eriğe m&amp;uuml;dahale etmemiz m&amp;uuml;mk&amp;uuml;n.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/08/Swagger_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulamayı&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet run&lt;/pre&gt;
&lt;p&gt;komutuyla &amp;ccedil;alıştırdıktan sonra artık Swagger aray&amp;uuml;z&amp;uuml;ne ulaşabiliriz. Tek yapmamız gereken herhangibir tarayıcıyı kullanarak http://localhost:5554/swagger/&amp;nbsp;adresine gitmek&lt;em&gt;(5000 nolu Port Apache hegamonyasında olduğundan UseUrls ile değiştirdim)&lt;/em&gt;&amp;nbsp;Karşılama sayfası&amp;nbsp;aşağıdaki gibi a&amp;ccedil;ılır. Gayet şık ve g&amp;ouml;z alıcı g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z &amp;uuml;zere :)&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/08/swagger_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Uuml;st kısımdaki &amp;ouml;zet bilgileri SwaggerDoc metodu i&amp;ccedil;erisinde belirlemiştik. Sunmuş olduğumuz API operasyonlarına g&amp;ouml;re bir ka&amp;ccedil; b&amp;ouml;l&amp;uuml;m a&amp;ccedil;ıldığını g&amp;ouml;rebiliriz. Get, Post, Put ve Delete i&amp;ccedil;in. Ayrıca Controller tarafında kullanılan Quote sınıfı da Models b&amp;ouml;l&amp;uuml;m&amp;uuml;nde yer alır. Dolayısıyla XML Comment'ler ve Swagger nitelikleri aray&amp;uuml;z tarafına da yansımaktadır. Diğer kısımların nasıl g&amp;ouml;r&amp;uuml;nd&amp;uuml;ğ&amp;uuml;ne de kısaca bakalım dilerseniz.&lt;/p&gt;
&lt;p&gt;Sayfalama yapıldığı takdirde 100 quote getiren Get talebine ait par&amp;ccedil;a aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/08/swagger_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Response Content Type'ın JSON olduğunu, HTTP 200 kodu d&amp;ouml;nd&amp;uuml;receğini ve d&amp;ouml;n&amp;uuml;ş &amp;ccedil;ıktısının da Example Value kısmındaki gibi olacağını g&amp;ouml;rebiliyoruz. "Try It out" butonuna basarak hemen test de edebiliriz.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Yeni bir quote eklemek istediğimizde kullanacağımız POST işlemine ait aşağıdaki kısım oluşur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/08/swagger_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek body i&amp;ccedil;eriği, olası HTTP D&amp;ouml;n&amp;uuml;ş kodları, parametrenin JSON&amp;nbsp;tipinden olacağı, fonksiyonun kısaca ne yaptığı gibi bilgileri g&amp;ouml;rebiliyoruz. Diğer metodlar i&amp;ccedil;in de benzer yardım sayfaları ve anında test edebilmemizi sağlayacak "Try It Out" d&amp;uuml;ğmeleri olacakatır.&lt;/p&gt;
&lt;p&gt;Belli bir ID i&amp;ccedil;in Quote d&amp;ouml;nd&amp;uuml;ren Get operasyonu&lt;em&gt;(id alanının Reuired olduğuna dikkat edelim)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/08/swagger_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Update işlemi i&amp;ccedil;in kullanılan Put metodu&lt;em&gt;(Bu fonskiyon i&amp;ccedil;in de id alanı zorunludur)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/08/swagger_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve son olarak silme işlemleri i&amp;ccedil;in kullanılan Delete operasyonu&lt;em&gt;(Kırmızı renk dikkat edilmesi gereken bir işlem olduğuna işaret ediyor olmalı)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/08/swagger_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere APIyi kullanacak olan geliştirici ve hatta API hizmetini tarayan robot i&amp;ccedil;in gerekli t&amp;uuml;m bilgiler burada yer alıyor. Operasyon adları, a&amp;ccedil;ıklamaları, d&amp;ouml;n&amp;uuml;ş durum kodları, ne t&amp;uuml;r i&amp;ccedil;eriklerle &amp;ccedil;alıştıkları, &amp;ouml;rnek mesaj g&amp;ouml;vdeleri ve tabii test edilmelerini sağlayan "Try It Out" d&amp;uuml;ğmeleri. Bu standartlaştırılmış yardım sayfalarını basit bir ka&amp;ccedil; hareket ile uygulamak da olduk&amp;ccedil;a kolay. Bize d&amp;uuml;şen bu standart yardım dok&amp;uuml;manlarını hazırlamak i&amp;ccedil;in gerekli XML Comment ve nitelikleri doğru bir şekilde uygulamak. Bundan sonra yazacağımız her Web API i&amp;ccedil;in biraz vakit ayırıp bu dok&amp;uuml;manları hazırlamakta yarar var. Gelecek sadece insanların değil, belli standartları takip eden robotların kullanacağı servislerle dolu olacak. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2018-09-20 21:22:00</pubDate>
  <slug>web-api-leri-swagger-ile-zenginlestirelim</slug>
  <tags>
    <tag>net-core</tag>
    <tag>web-api</tag>
    <tag>swagger</tag>
    <tag>swagger-ui</tag>
    <tag>open-a-p-i</tag>
    <tag>api</tag>
    <tag>xml-documentation</tag>
    <tag>help-standards</tag>
  </tags>
  <categories>
    <category>Asp.Net Core</category>
  </categories>
</post>