<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF WebHttp Services - Tanışma</title>
  <description>Nihayet taşlar yerli yerine oturmaya başladı. 2008 yılında düzenlenen Microsoft PDC' de  tanıtılan sürüm ile başlayan macerada Beta 1, Beta 2 versiyonları derken yavaş yavaş RC, RTM sürümlerinin çıkacağı günlere gelmekteyiz. Elbette hepizimin beklentisi bir an önce stabil bir sürüme kavuşabilmek. Bu günlerde çok doğal olarak .Net Framework 4.0 ve Visual Studio 2010 ürünlerinin sınırlarının daha da netleştiğini görmeye başladık. Her ne kadar henüz yayınlanmış yeni bir sürüm olmasa da, pek çok güncel ve geçerli kaynaktan okuduğumuz kadarı ile bu böyle. Taşların yerli yerine oturmaya başladığı ve herşeyin biraz daha belirginleştiği alanlardan biriside Windows Communication Foundation 4.0.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f1%2fblg127_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Nihayet taşlar yerli yerine oturmaya başladı. &lt;strong&gt;2008&lt;/strong&gt; yılında d&amp;uuml;zenlenen&amp;nbsp;&lt;strong&gt;Microsoft PDC' &lt;/strong&gt;de &amp;nbsp;tanıtılan s&amp;uuml;r&amp;uuml;m ile başlayan macerada &lt;strong&gt;Beta 1, Beta 2&lt;/strong&gt; versiyonları derken yavaş yavaş &lt;strong&gt;RC, RTM &lt;/strong&gt;s&amp;uuml;r&amp;uuml;mlerinin &amp;ccedil;ıkacağı g&amp;uuml;nlere gelmekteyiz. Elbette hepizimin beklentisi bir an &amp;ouml;nce stabil bir s&amp;uuml;r&amp;uuml;me kavuşabilmek. Bu g&amp;uuml;nlerde &amp;ccedil;ok doğal olarak &lt;strong&gt;.Net Framework 4.0 &lt;/strong&gt;ve &lt;strong&gt;Visual Studio 2010 &lt;/strong&gt;&amp;uuml;r&amp;uuml;nlerinin&amp;nbsp;sınırlarının daha da netleştiğini g&amp;ouml;rmeye başladık. Her ne kadar hen&amp;uuml;z yayınlanmış yeni bir s&amp;uuml;r&amp;uuml;m olmasa da, pek &amp;ccedil;ok g&amp;uuml;ncel ve ge&amp;ccedil;erli kaynaktan okuduğumuz kadarı ile bu b&amp;ouml;yle. Taşların yerli yerine oturmaya başladığı ve herşeyin biraz daha belirginleştiği alanlardan biriside &lt;strong&gt;Windows Communication Foundation 4.0&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Hatırlayacağınız &amp;uuml;zere &lt;a title="WCF Eco System" href="/post/WCF-Eco-System" target="_blank"&gt;WCF Eco System' i anlattığımız yazımızda&lt;/a&gt;, &lt;strong&gt;WCF&lt;/strong&gt; alt yapısı &amp;uuml;zerine geliştirilen ve amaca y&amp;ouml;nelik olarak farklılaştırılan servis geliştirme modellerine değinmiştik. Bunlardan biriside &lt;strong&gt;WebHttp Services &lt;/strong&gt;idi. Bu yazımız ile birlikte &lt;strong&gt;WebHttp Service'&lt;/strong&gt; lerini tanımaya &amp;ccedil;alışacağız. Aslında &lt;strong&gt;WCF 3.5&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;ne kazandırılan &lt;strong&gt;Web programlama&lt;/strong&gt; teknikleri sayesinde zaten uzun bir s&amp;uuml;redir farkında olduğumuz &lt;strong&gt;non-SOAP&lt;/strong&gt; bazlı bir modelden bahsediyoruz. Bildiğiniz &amp;uuml;zere &lt;strong&gt;WebGet &lt;/strong&gt;ve &lt;strong&gt;WebInvoke &lt;/strong&gt;isimli &lt;strong&gt;nitelikler(attribute) &lt;/strong&gt;yardımıyla servis operasyonlarının &lt;strong&gt;HTTP Get,Post,Put &lt;/strong&gt;ve &lt;strong&gt;Delete &lt;/strong&gt;metodlarına cevap verebilecek şekilde tasarlanması m&amp;uuml;mk&amp;uuml;n. Ancak zaman ilerledik&amp;ccedil;e&lt;strong&gt; REST(REpresentational State Transfer)&lt;/strong&gt; modeline g&amp;ouml;re &lt;strong&gt;WCF&lt;/strong&gt; servislerinin daha kolay geliştirilmesini sağlayan ve &lt;strong&gt;WCF 4.0&lt;/strong&gt; i&amp;ccedil;erisinde g&amp;ouml;m&amp;uuml;lecek yeni &amp;ouml;zelliklerin bir &amp;ouml;n g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml;n&amp;uuml; bizlere sunan &lt;strong&gt;WCF REST Starter Kit &lt;/strong&gt;ile karşılaştık.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF Eco System'&lt;/strong&gt; in bir par&amp;ccedil;ası olan &lt;strong&gt;WebHttp Service'&lt;/strong&gt; ler,&amp;nbsp;&lt;strong&gt;.Net Framework 3.5 &lt;/strong&gt;ile gelen &lt;strong&gt;Web Programlama modeli&lt;/strong&gt;, &lt;strong&gt;REST Starter Kit &lt;/strong&gt;ile tanıtılan kabiliyetler ve bunlara ek yeni &amp;ouml;zelliklerin &lt;strong&gt;.Net Framework 4.0 &lt;/strong&gt;i&amp;ccedil;erisinde ele alınmasını sağlayan bir geliştirme alt yapısı olarakta d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Şimdi dilerseniz &lt;strong&gt;WebHttp Service'&lt;/strong&gt; lere bir merhaba demeye &amp;ccedil;alışalım. &amp;Ouml;rneğimizi &lt;strong&gt;Visual Studio 2010 Ultimate Beta 2 &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinden geliştirmeye &amp;ccedil;alışıyor olacağız. Ancak yazıyı hazırladığım tarihte araştırdığım &lt;strong&gt;MSDN, The .NET Endpint&lt;/strong&gt; vb blog sitelerinde yer alan bilgilere g&amp;ouml;re &lt;strong&gt;Visual Studio 2010'&lt;/strong&gt; un o anki s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde &lt;strong&gt;WebHttp Service'&lt;/strong&gt; leri i&amp;ccedil;in bir &lt;strong&gt;proje şablon(project template) &lt;/strong&gt;bulunmamaktaydı.&lt;/p&gt;
&lt;p&gt;Bu nedenle &amp;ouml;ncelikli olarak &lt;strong&gt;online template'&lt;/strong&gt; lerden &lt;strong&gt;WebHttp Service &lt;/strong&gt;i&amp;ccedil;in olanları indirmemiz gerekiyor. Bu ama&amp;ccedil;la &lt;strong&gt;Visual Studio 2010 &lt;/strong&gt;ortamında &lt;strong&gt;Tools-&amp;gt;Extensions Manager-&amp;gt;Online Gallery &lt;/strong&gt;kısmına ge&amp;ccedil;iş yapıp &lt;strong&gt;WCF &lt;/strong&gt;ile ilişkili olan şablonlardan &lt;strong&gt;WCF Rest Service Template' &lt;/strong&gt;i indirmemiz gerekiyor. Ben &lt;strong&gt;4.0 &lt;/strong&gt;versiyonunun &lt;strong&gt;C# &lt;/strong&gt;programlama dili destekli olanını indirdim. Son s&amp;uuml;r&amp;uuml;mde b&amp;uuml;y&amp;uuml;k ihtimalle şu anda online olarak indirdiğimiz bu şablonun ve başka diğer şablonların &lt;strong&gt;Visual Studio 2010&lt;/strong&gt; i&amp;ccedil;erisine g&amp;ouml;m&amp;uuml;l&amp;uuml; olarak geleceğini &amp;uuml;mit etmekteyim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg127_Template.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Download&lt;/strong&gt; ve &lt;strong&gt;Install&lt;/strong&gt; işlemlerinin ardından yolumuza devam edebiliriz. Bu ama&amp;ccedil;la,&amp;nbsp;&lt;strong&gt;Visual Studio 2010&lt;/strong&gt; ortamında yeni bir proje oluşturup, &lt;strong&gt;Web&lt;/strong&gt; sekmesinde yer alan &lt;strong&gt;WCF Rest Service Application&lt;/strong&gt; şablonunu se&amp;ccedil;memiz yeterli olacaktır. Bu şablonun kurulum işlemi sonrasında &lt;span style="text-decoration: underline;"&gt;&amp;ccedil;ıkmaması&lt;/span&gt; olasıdır. Bu durumda &lt;strong&gt;New Project&lt;/strong&gt; iletişim kutusunda yer alan &lt;strong&gt;Enable the loading per-user extensions&lt;/strong&gt; bağlantısını kullanarak etkinleştirme işlemini yapmamız yeterli olacaktır. &lt;strong&gt;Visual Studio 2010&lt;/strong&gt; ortamımızı tekrardan a&amp;ccedil;tığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi yeni proje şablonunun kullanabilir olduğunu g&amp;ouml;receğiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg127_NewProject.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;HelloWebHttp&lt;/strong&gt; isimli servis uygulamasına ait &lt;strong&gt;Solution&lt;/strong&gt; i&amp;ccedil;eriğinin ilk etapta otmatik olarak aşağıdaki gibi oluşturulduğunu g&amp;ouml;zlemleyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg127_Solution.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Service1.cs&lt;/strong&gt; isimli &amp;ouml;rnek dosya i&amp;ccedil;erisinde &lt;strong&gt;servis s&amp;ouml;zleşmesi(Service Contract)&lt;/strong&gt; yer almaktadır. Bu s&amp;ouml;zleşme i&amp;ccedil;erisinde yer alan metodlara &lt;strong&gt;WebGet&lt;/strong&gt; ve &lt;strong&gt;WebInvoke niteliklerinin(Attributes) &lt;/strong&gt;uygulandığı g&amp;ouml;r&amp;uuml;lmektedir. Bu nitelikler bildiğiniz &amp;uuml;zere servis operasyonlarına &lt;strong&gt;HTTP Post,Get,Put,Delete&lt;/strong&gt; &amp;ccedil;ağrılarının yapılabilmesi i&amp;ccedil;in gereklidir. Sınıf i&amp;ccedil;erisine &lt;strong&gt;Get, Post, Put&lt;/strong&gt; ve &lt;strong&gt;Delete &lt;/strong&gt;metodlarının her biri i&amp;ccedil;in &amp;ouml;rnek nitelik kullanımları serpiştirilmiştir. Ayrıca serileştirilebilir &amp;ouml;rnek bir tipte yer almaktadır&lt;em&gt;(SampleItem)&lt;/em&gt;. &lt;strong&gt;GetCollection&lt;/strong&gt; operasyonu &lt;strong&gt;SampleItem&lt;/strong&gt; tipinden generic bir listeyi &lt;strong&gt;HTTP&lt;/strong&gt; &lt;strong&gt;Get&lt;/strong&gt; metoduna g&amp;ouml;re d&amp;ouml;nd&amp;uuml;rmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Create&lt;/strong&gt; servis operasyonu ile yeni bir &lt;strong&gt;SampleItem&lt;/strong&gt; nesnesinin&lt;strong&gt; HTTP Post&lt;/strong&gt; metoduna g&amp;ouml;re &amp;ouml;rneklenmesi sağlanır. Tek bir &lt;strong&gt;SampleItem&lt;/strong&gt; nesne &amp;ouml;rneğinin elde edilmesi i&amp;ccedil;in &lt;strong&gt;Get&lt;/strong&gt; isimli servis operasyonunun aşırı y&amp;uuml;klenmiş diğer bir versiyonu kullanılmaktadır. &lt;strong&gt;Update&lt;/strong&gt; servis operasyonu ile &lt;strong&gt;HTTP Put&lt;/strong&gt; metoduna g&amp;ouml;re g&amp;uuml;ncelleme işlemi yapılmakta olup, &lt;strong&gt;Delete&lt;/strong&gt; servis operasyonuda bir &lt;strong&gt;SampleItem&lt;/strong&gt; nesnesinin &lt;strong&gt;HTTP Delete&lt;/strong&gt; metoduna g&amp;ouml;re silinmesini sağlamaktadır. &lt;strong&gt;Solution&lt;/strong&gt; i&amp;ccedil;erisinde dikkat &amp;ccedil;ekici bazı noktalar bulunmaktadır;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;Ouml;rneğin &lt;strong&gt;web.config &lt;/strong&gt;i&amp;ccedil;eriği. Burada &lt;strong&gt;WCF 4.0&lt;/strong&gt; ile birlikte gelen &lt;strong&gt;basitleştirilmiş konfigurasyon(Simplified Configuration)&lt;/strong&gt; &amp;ouml;zelliklerine yer verilmiştir. Bu sebepten daha sade, okunaklı ve fonksiyonel bir konfigurasyon i&amp;ccedil;eriği oluşmuştur.&lt;/li&gt;
&lt;li&gt;Dikkat &amp;ccedil;ekici bir diğer noktada &lt;strong&gt;global.asax&lt;/strong&gt; dosyasının var olmasıdır. Aslında bu bir web uygulaması olduğu i&amp;ccedil;in son derece normaldir. Lakin g&amp;ouml;zden ka&amp;ccedil;ırılmaması gereken bir ger&amp;ccedil;ek vardır; &lt;strong&gt;svc&lt;/strong&gt; uzantılı bir servis dosyası fiziki olarak&amp;nbsp;yoktur. &amp;Ccedil;&amp;uuml;nk&amp;uuml; &lt;strong&gt;Asp.Net 4.0 Routing&lt;/strong&gt; &amp;ouml;zelliği kullanılmaktadır. &amp;Ccedil;ok tabi olarak y&amp;ouml;nlendirme işlemleri i&amp;ccedil;in &lt;strong&gt;global.asax&lt;/strong&gt; dosyasında yapılması gereken bazı işlemler vardır. Bu nedenle hazır olarak &lt;strong&gt;global.asax&lt;/strong&gt; i&amp;ccedil;eriği aşağıdaki gibi &amp;uuml;retilmektedir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg127_GlobalAsax.gif" alt="" /&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Yine servis kodlarına baktığımızda &lt;strong&gt;OperationContract&lt;/strong&gt; niteliğinin kullanılmadığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Oysaki&lt;strong&gt; .Net 3.5&lt;/strong&gt; ve &lt;strong&gt;WCF Rest Starter Kit&lt;/strong&gt; s&amp;uuml;r&amp;uuml;mlerine baktığımızda &lt;strong&gt;WebGet&lt;/strong&gt; ve &lt;strong&gt;WebInvoke&lt;/strong&gt; nitelikleri dışında &lt;strong&gt;OperationContract&lt;/strong&gt; niteliğininde kullanılması gerektiğini bilmekteyiz. &lt;strong&gt;OperationContract&lt;/strong&gt; servis s&amp;ouml;zleşmelerinden sunulan operasyonların &lt;strong&gt;WCF &amp;ccedil;alışma zamanına&lt;/strong&gt; bildirilmesinde rol oynadığı i&amp;ccedil;in bu son derece doğaldır. Ne varki &lt;strong&gt;WCF WebHttp&lt;/strong&gt; servislerinde &lt;strong&gt;OperationContract&lt;/strong&gt; niteliği opsiyoneldir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Şimdi servis uygulamamız &amp;uuml;zerinde bir ka&amp;ccedil; k&amp;uuml;&amp;ccedil;&amp;uuml;k değişiklik yapalım. &amp;Ouml;ncelikli olarak hayatımızı kolaylaştırmak adına &lt;strong&gt;Entity Framework'&lt;/strong&gt; ten yararlanalım ve meşhur &lt;strong&gt;Chinook&lt;/strong&gt; veritabanını ve işlemleri basit bir bi&amp;ccedil;imde ele almak i&amp;ccedil;in sadece &lt;strong&gt;Artist&lt;/strong&gt; tablosunu kullanmak istediğimizi d&amp;uuml;ş&amp;uuml;nelim. Ger&amp;ccedil;i bu noktadan sonra biraz &lt;strong&gt;WCF Data Service'&lt;/strong&gt; lere doğru kaymaya başlamış oluyoruz ancak amacımız tabiki &lt;strong&gt;HTTP Get,Post,Put&lt;/strong&gt; ve &lt;strong&gt;Delete&lt;/strong&gt; işlemlerini kendi kontrol&amp;uuml;m&amp;uuml;z altında geliştirmek.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;Not : &lt;/strong&gt;Tam bu noktada geliştirilen uygulamanın &lt;strong&gt;Data Service'&lt;/strong&gt; ten veya &lt;strong&gt;RIA Service' &lt;/strong&gt;ten ne&amp;nbsp;farkı kaldığı sorusu akla gelebilir.&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;&lt;strong&gt;WCF WebHttp &lt;/strong&gt;servislerinde asıl nokta operasyonun&lt;strong&gt; non-SOAP&lt;/strong&gt; olacak şekilde sunulması(yani &lt;strong&gt;HTTP Get,Post,Put,Delete&lt;/strong&gt;)&amp;nbsp;ayrıca&amp;nbsp;&lt;strong&gt;URI, format, protocol&amp;nbsp;&lt;/strong&gt;gibi bilgilerin tamamen geliştirici kontrol&amp;uuml; altında olmasıdır. &lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdi&amp;nbsp;servis kodlarını aşağıdaki gibi geliştirdiğimizi varsayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic;
using System.Linq;
using System.ServiceModel;
using System.ServiceModel.Activation;
using System.ServiceModel.Web;

namespace HelloWebHttp
{
    [ServiceContract]
    [AspNetCompatibilityRequirements(RequirementsMode = AspNetCompatibilityRequirementsMode.Allowed)]
    [ServiceBehavior(InstanceContextMode = InstanceContextMode.PerCall)]
    public class HelloService
    {
        [WebGet(UriTemplate = "ArtistList")]
        public List&amp;lt;Artist&amp;gt; GetAllArtists()
        {
            ChinookEntities entites = new ChinookEntities();
            return entites.Artist.OrderByDescending(a =&amp;gt; a.Name).ToList();
        }

        [WebGet(UriTemplate = "Artist/{name}")]
        public List&amp;lt;Artist&amp;gt; FindArtists(string name)
        {
            ChinookEntities entities = new ChinookEntities();

            return (from artist in entities.Artist
                    where artist.Name.Contains(name)
                    select artist).ToList();
        }

        [WebGet(UriTemplate = "Artist/InRange?idFirst={firstId}&amp;amp;idSecond={secondId}")]
        public List&amp;lt;Artist&amp;gt; GetArtistsInRange(int firstId, int secondId)
        {
            ChinookEntities entities = new ChinookEntities();
            return (from a in entities.Artist
                   where a.ArtistId &amp;gt;= firstId &amp;amp;&amp;amp; a.ArtistId &amp;lt;= secondId
                   select a).ToList();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere sadece &lt;strong&gt;HTTP Get&lt;/strong&gt; metodlarının &amp;ccedil;alışmasına y&amp;ouml;nelik 3 &amp;ouml;rnek operasyon yer almaktadır. &lt;strong&gt;WebGet&lt;/strong&gt; niteliklerinde &lt;strong&gt;UriTemplate&lt;/strong&gt; &amp;ouml;zelliklerine atanan değerler yardımıyla &lt;strong&gt;HTTP Get&lt;/strong&gt; taleplerinin nasıl olması gerektiği belirlenmektedir. Servise gelen taleplerin&amp;nbsp;&lt;strong&gt;Routing &lt;/strong&gt;s&amp;uuml;recine dahil olması i&amp;ccedil;in &lt;strong&gt;global.asax.cs&lt;/strong&gt; kodlarında da aşağıdaki değişiklikleri yapmamız yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel.Activation;
using System.Web;
using System.Web.Routing;

namespace HelloWebHttp
{
    public class Global 
        : HttpApplication
    {
        void Application_Start(object sender, EventArgs e)
        {
            RegisterRoutes();
        }

        private void RegisterRoutes()
        {
            RouteTable.Routes.Add(new ServiceRoute("Chinook", new WebServiceHostFactory(), typeof(HelloService)));
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;http://makineadı:portnumarası/Chinook&lt;/strong&gt; &amp;uuml;zerine gelen talepler sonrasında, &lt;strong&gt;WebServiceHostFactory'&lt;/strong&gt; nin ayağa kaldırılması ve &lt;strong&gt;HelloService&lt;/strong&gt; sınıfının &amp;ouml;rneklenerek işleme alınmasının sağlanması ger&amp;ccedil;ekleştirilmektedir. Artık testlerimize başlayabiliriz.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Dilerseniz Web uygulamasını IIS &amp;uuml;zerinden host ederekte deneyebilirsiniz. Ancak ister Asp.Net Development Server ister IIS olsun, URL satırında RegisterRoutes metodunda yer alan Chinook bilgisini kullanmamız servise ulaşmamız i&amp;ccedil;in yeterli olacaktır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Tabi test derken ilk etapta servis operasyonlarını nasıl &amp;ccedil;ağırabileceğimizi bilemeyebiliriz. Yada bulmak i&amp;ccedil;in araştırmaya &amp;uuml;şenebiliriz. &lt;img title="Embarassed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-embarassed.gif" alt="Embarassed" border="0" /&gt;&amp;nbsp;İşte bu ama&amp;ccedil;la &lt;strong&gt;WCF &lt;/strong&gt;tarafına gelen &lt;strong&gt;Auto&lt;/strong&gt; &lt;strong&gt;Help &lt;/strong&gt;yetenekleri sayesinde &amp;ccedil;alışma zamanında yardım sayfasına gidebilir ve servis operasyonlarını nasıl &amp;ccedil;ağırabileceğimizi, i&amp;ccedil;eriklerinin ne olacağını g&amp;ouml;rebiliriz.. Aynen aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg127_Runtime1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak belirli bir kelimeyi i&amp;ccedil;eren &lt;strong&gt;Artist&lt;/strong&gt; listesini elde etmek istediğimizi d&amp;uuml;ş&amp;uuml;nelim. &amp;Ouml;rneğin adında &lt;strong&gt;Milton&lt;/strong&gt; kelimesi ge&amp;ccedil;enleri bulmak istiyoruz. Bu durumda &lt;strong&gt;URL&lt;/strong&gt; satırında &lt;strong&gt;Chinook/Artist/Milton&lt;/strong&gt; yazmamız yeterli olacaktır. Sonu&amp;ccedil;lar aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg127_Runtime2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Eğer &lt;strong&gt;t&amp;uuml;m Artist &lt;/strong&gt;listesini elde etmek istiyorsak bu durumda &lt;strong&gt;URL&lt;/strong&gt; satırından &lt;strong&gt;Chinook/ArtistList &lt;/strong&gt;bilgisini girmemiz yeterli olacaktır. Bu durumda elde edilen sonu&amp;ccedil;lar aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg127_Runtime3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Son olarak &lt;strong&gt;ArtistId&lt;/strong&gt; değer aralığına g&amp;ouml;re &lt;strong&gt;Artist&lt;/strong&gt; listesini elde etmek istediğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu durumda &lt;strong&gt;URL&lt;/strong&gt; satırından &lt;strong&gt;Chinook/Artist/InRange?idFirst=155&amp;amp;idSecond=158&lt;/strong&gt; gibi bir &lt;strong&gt;URL&lt;/strong&gt; satırı girmemiz yeterli olacaktır ki buna g&amp;ouml;re &amp;ouml;rneğin &lt;strong&gt;ArtistId &lt;/strong&gt;değerleri &lt;strong&gt;155 &lt;/strong&gt;ile &lt;strong&gt;158 &lt;/strong&gt;aralığında olanların listesini aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi elde edebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg127_Runtime4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Olduk&amp;ccedil;a basit ve etkili değil mi? &lt;strong&gt;WCF WebHttp Service'&lt;/strong&gt; ler ile ilişkili incelemelerimize devam ediyor olacağız. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f1%2fHelloWebHttp.rar"&gt;HelloWebHttp.rar (31,23 kb)&lt;/a&gt; &lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 &lt;/strong&gt;&lt;strong&gt;Ultimate &lt;/strong&gt;&lt;strong&gt;Beta 2 S&amp;uuml;r&amp;uuml;m&amp;uuml;nde geliştirilmiş ancak RC s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde de test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-02-01 05:50:00</pubDate>
  <slug>WCF-WebHttp-Services-Tanisma</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-40</tag>
    <tag>webhttp-services</tag>
    <tag>restful</tag>
    <tag>non-soap</tag>
    <tag>wcf-webhttp-services</tag>
  </tags>
  <categories>
    <category>WCF Eco System</category>
    <category>WCF WebHttp Services</category>
  </categories>
</post>