<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Task İptal İşlemlerinin İzlenmesi(Monitoring Cancellation)</title>
  <description>Bu yazımızda daha önceden .Net Framework Beta 1 ve Beta 2 sürümlerinde incelediğimiz Task iptal işlemlerini son sürümde ele alıp toparlamaya çalışıyor olacağız.</description>
  <content>&lt;p&gt;&lt;a href="/pics/blg204_Giris.jpg"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border-width: 0px;" title="blg204_Giris" src="/pics/blg204_Giris_thumb.jpg" alt="blg204_Giris" width="209" height="302" align="right" border="0" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bu yazımızda daha &amp;ouml;nceden&lt;strong&gt; .Net Framework Beta 1&lt;/strong&gt; ve &lt;strong&gt;Beta 2 &lt;/strong&gt;s&amp;uuml;r&amp;uuml;mlerinde incelediğimiz &lt;strong&gt;Task&lt;/strong&gt; iptal işlemlerini son s&amp;uuml;r&amp;uuml;mde ele alıp toparlamaya &amp;ccedil;alışıyor olacağız.&amp;nbsp;Task iptal işlemleri olduk&amp;ccedil;a &amp;ouml;nemli ve &amp;uuml;zerinde titizlikle durulması gereken bir konudur. Nitekim bazı hallerde &amp;ccedil;alıştırılmakta olan &lt;strong&gt;Task &lt;/strong&gt;işlevlerinin iptal edilmesi gerekebilir. Bu iptal işlemi, sistem tarafından her hangibir koşulun ger&amp;ccedil;eklenmesi sonucu talep edilebileceği gibi, kullanıcı tarafından da uygulatılmak istenebilir.&lt;/p&gt;
&lt;p&gt;Task &amp;ouml;rnekleri işaret ettikleri ve planladıkları fonksiyonellikleri &amp;ccedil;alıştırdıklarında ve herhangibir sebeple iptal işlemi ger&amp;ccedil;ekleştirilmek istendiğinde &lt;strong&gt;CancellationTokenSource &lt;/strong&gt;ve &lt;strong&gt;CancellationToken &lt;/strong&gt;tiplerinden yararlanılması gerekmektedir.&lt;/p&gt;
&lt;p&gt;Bu ama&amp;ccedil;la İptal işlemlerinde &lt;strong&gt;CancellationTokenSource&lt;/strong&gt; nesne &amp;ouml;rnekleri &amp;uuml;zerinden &lt;strong&gt;Cancel&lt;/strong&gt; metodunun &amp;ccedil;ağırılması yeterlidir. Ancak burada da dikkat edilmesi gereken bir husus vardır. &amp;Ccedil;alışma zamanı &lt;strong&gt;Cancel&lt;/strong&gt; &amp;ccedil;ağrısı sonucu ilgili &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneklerinin işleyişlerini otomatik olarak &lt;span style="text-decoration: underline;"&gt;sonlandırmaz&lt;/span&gt;. Bir başka deyişle &lt;strong&gt;Task&lt;/strong&gt; g&amp;ouml;vdeleri veya paralel y&amp;uuml;r&amp;uuml;t&amp;uuml;len metod blokları i&amp;ccedil;erisinde &lt;strong&gt;Cancel&lt;/strong&gt; işleminin talep edilip edilmediğinin takibi gerekmektedir(&lt;strong&gt;Monitoring Cancellation&lt;/strong&gt;). Peki bu takip işlemleri nasıl ger&amp;ccedil;ekleştirilebilir. Yazımızın ilerleyen kısımlarında bu takip işlemlerinde hangi konuların ele alındığını irdelemeye &amp;ccedil;alışıyor olacağız.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Polling Tekniğini ile İptal Taleplerinin İzlenmesi&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Bu teknik adından da anlaşılacağı &amp;uuml;zere bir iptal talebinin yapılıp yapılmadığını s&amp;uuml;rekli olarak denetlemeyi gerektirir. Bu durumu analiz etmek i&amp;ccedil;in &lt;strong&gt;Visual Studio 2010 Ultimate&lt;/strong&gt; ortamında geliştirilmiş aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Collections.Generic; 
using System.Linq; 
using System.Threading; 
using System.Threading.Tasks;

namespace CancellationScenarios 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            CancellationTokenSource tokenSource = new CancellationTokenSource(); 
            CancellationToken token = tokenSource.Token; 
            IEnumerable&amp;lt;int&amp;gt; numbers =Enumerable.Range(0, 100000000);

            Task startedTask=Task.Factory.StartNew(() =&amp;gt; 
                { 
                   for(int i=0;i&amp;lt;numbers.Count();i++) 
                    { 
                        if (token.IsCancellationRequested) 
                        { 
                            Console.WriteLine("İşlemler {0}. elemandan sonra iptal edildi",i.ToString()); 
                           throw new OperationCanceledException(token); 
                        } 
                        else 
                        { 
                            i++; 
                            i--; 
                            i *= 2; 
                            Console.Write("."); 
                        } 
                    } 
                } 
            , token);

            Console.WriteLine("İşlemler devam ediyor. İptal etmek i&amp;ccedil;in bir tuşa basınız"); 
            Console.ReadLine();          

            tokenSource.Cancel();

            Console.ReadLine(); 
            Console.WriteLine("Task Status = {0}",startedTask.Status); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;CancellationTokenSource&lt;/strong&gt; nesnesi &amp;ouml;rneklenmiş ve sonrasında bu &amp;ouml;rneğin &lt;strong&gt;Token&lt;/strong&gt; &amp;ouml;zelliğinden yararlanılarak bir &lt;strong&gt;CancellationToken&lt;/strong&gt; &amp;uuml;retilmiştir. &lt;strong&gt;CancellationToken&lt;/strong&gt; nesne &amp;ouml;rneği &lt;strong&gt;Task&lt;/strong&gt; tipinin &amp;ouml;rneklenmesi sırasında da parametre olarak aktarılmaktadır.&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;for&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; i&amp;ccedil;erisinde parametre olarak gelen &lt;strong&gt;token&lt;/strong&gt; değişkeni &amp;uuml;zerinden &lt;strong&gt;IsCancellationRequested&lt;/strong&gt; &amp;ouml;zelliği kontrol edilmektedir. Kontrol işlemi d&amp;ouml;ng&amp;uuml;n&amp;uuml;n her bir iterasyonunda s&amp;ouml;z konusudur. &lt;strong&gt;IsCancellationRequested&lt;/strong&gt; &amp;ouml;zelliğinin &lt;strong&gt;true&lt;/strong&gt; değerini alması i&amp;ccedil;in &lt;strong&gt;CancellationToken&lt;/strong&gt; ile ilişkilendirilmiş olan &lt;strong&gt;CancellationTokenSource&lt;/strong&gt; nesne &amp;ouml;rneği &amp;uuml;zerinden &lt;strong&gt;Cancel&lt;/strong&gt; metodunun &amp;ccedil;ağırılması gerekmektedir. &amp;Ouml;rneği bu haliyle &amp;ccedil;alıştırdığımızda ve işlemler devam ederken herhangibir noktada herhangibir tuşa bastığımızda ise aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne benzer sonu&amp;ccedil;lar ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg204_PollingTest.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg204_PollingTest" src="/pics/blg204_PollingTest_thumb.gif" alt="blg204_PollingTest" width="415" height="104" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;nemli olan noktalardan birisi de başlatılan &lt;strong&gt;Task&amp;rsquo;&lt;/strong&gt; in &lt;strong&gt;Status&lt;/strong&gt; değeridir. Dikkat edileceği &amp;uuml;zere bu değer &lt;strong&gt;Canceled&lt;/strong&gt; olarak set edilmiştir. Ancak bunun b&amp;ouml;yle olmasının sebebi iptal işleminin kontrol edildiği noktadan &lt;strong&gt;OperationCanceledException&lt;/strong&gt; tipinden istisna nesnesinin fırlatılmasıdır. Bu istisnanın &lt;span style="text-decoration: underline;"&gt;&amp;uuml;retilmemesi&lt;/span&gt; sonucu ise aşağıdaki gibi olacaktır ki bu da &lt;strong&gt;Task&lt;/strong&gt; durumunu değerlendiren kod par&amp;ccedil;aları i&amp;ccedil;in tam anlamıyla bir handikaptır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg204_PollingTest2.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg204_PollingTest2" src="/pics/blg204_PollingTest2_thumb.gif" alt="blg204_PollingTest2" width="407" height="109" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;Exception&lt;/strong&gt; fırlatılmadığı i&amp;ccedil;in &lt;strong&gt;Task&lt;/strong&gt; durumu &lt;strong&gt;Running&lt;/strong&gt; olarak kalmıştır. Oysaki &lt;strong&gt;Task&lt;/strong&gt; iptal edilmiştir.&lt;/p&gt;
&lt;p&gt;Polling modelinde uygulanan genel kod deseni yukarıdaki gibi olmasına rağmen ikinci bir teknik daha s&amp;ouml;z konusudur. Bu teknikte kontrol etme ve Exception fırlatma işlemleri zaten var olan bir metoda y&amp;uuml;klenmiştir. Buna g&amp;ouml;re for d&amp;ouml;ng&amp;uuml;s&amp;uuml; i&amp;ccedil;eriğini aşağıdaki gibi değiştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;for(int i=0;i&amp;lt;numbers.Count();i++) 
{ 
	token.ThrowIfCancellationRequested(); 
	i++; 
	i--; 
	i *= 2; 
	Console.Write("."); 
}&lt;/pre&gt;
&lt;p&gt;Bu durumda da &amp;ccedil;alışma zamanında aşağıdaki sonu&amp;ccedil;ları alırız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg204_PollingTest3.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg204_PollingTest3" src="/pics/blg204_PollingTest3_thumb.gif" alt="blg204_PollingTest3" width="408" height="92" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Polling&lt;/strong&gt; tekniği &amp;ouml;zellikle &lt;strong&gt;Task&lt;/strong&gt; g&amp;ouml;vdelerinin d&amp;ouml;ng&amp;uuml;sel işlemler yaptığı senaryolar i&amp;ccedil;in uygundur. Nitekim d&amp;ouml;ng&amp;uuml;n&amp;uuml;n her iterasyonu sırasında, bir iptal isteği olup olmadığı kontrol edilmekte ve eğer varsa, d&amp;ouml;ng&amp;uuml; dışına &amp;ccedil;ıkılması, ortama uygun &lt;strong&gt;İstisna(Exception)&lt;/strong&gt; nesnesi fırlatılması, gerekiyorsa ilgili&lt;strong&gt; kaynakların(Resources)&lt;/strong&gt; serbest bırakılması işlemleri ger&amp;ccedil;ekleştirilmektedir.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Delegate Kullanımı&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;Polling&lt;/strong&gt; modeli kullanışlı olmasına rağmen &amp;ouml;zellikle &lt;strong&gt;CancellationToken&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;ThrowIfCancellationRequested&lt;/strong&gt; metodu kullanıldığında, sanki eksik olan bir şey var hissi uyandırmaktadır. &lt;strong&gt;6ncı&lt;/strong&gt; hissimiz bize bu noktada şunu s&amp;ouml;ylemektedir; &lt;strong&gt;User Interface&amp;rsquo;&lt;/strong&gt; e sahip uygulamalarda kullanıcıların işlemin iptal edildiğine dair bilgilendirilmesi nasıl sağlanacaktır? Bu his biraz daha genişletilebilir ama sonu&amp;ccedil; itibariyle iptal işlemi sonrası ana uygulamanın bilgilendirilmesi &amp;ouml;nemlidir. &amp;Ouml;zellikle işlemlerin loglandığı, IO s&amp;uuml;re&amp;ccedil;lerinin s&amp;ouml;z konusu olduğu durumlarda. Bu tip bir vaka da delegasyon kullanımı ile iptal işleminin ele alınması tercih edilebilir. Aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asında bu durum irdelenmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Collections.Generic; 
using System.Linq; 
using System.Threading; 
using System.Threading.Tasks;

namespace CancellationScenarios 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            CancellationTokenSource tokenSource = new CancellationTokenSource(); 
            CancellationToken token = tokenSource.Token; 
            IEnumerable&amp;lt;int&amp;gt; numbers = Enumerable.Range(0, 100000000);

            Task startedTask = Task.Factory.StartNew(() =&amp;gt; 
                { 
                    for (int i = 0; i &amp;lt; numbers.Count(); i++) 
                    { 
                        token.ThrowIfCancellationRequested();                       
                        i++; 
                        i--; 
                        i *= 2; 
                        Console.Write("."); 
                    } 
                } 
            , token);

            token.Register(() =&amp;gt; 
            { 
                Console.WriteLine("İptal işlem ger&amp;ccedil;ekleştirildi. Tam bu sırada Task Status =  {0}",startedTask.Status); 
            } 
            ); 
            Console.WriteLine("İşlemler devam ediyor. İptal etmek i&amp;ccedil;in bir tuşa basınız"); 
            Console.ReadLine();

            tokenSource.Cancel();

            Console.ReadLine(); 
            Console.WriteLine("Task Status = {0}", startedTask.Status); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere token nesnesi &amp;uuml;zerinden &lt;strong&gt;Register&lt;/strong&gt; metodu kullanılarak bir delegasyon yapılmaktadır. Buna g&amp;ouml;re &lt;strong&gt;tokenSource.Cancel &lt;/strong&gt;&amp;ccedil;ağrısı ger&amp;ccedil;ekleştirildiğinde, &lt;strong&gt;Register&lt;/strong&gt; metodu ile işaret edilen blok otomatik olarak devreye girecektir. &amp;Ouml;rneğin &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg204_DelegationTest1.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg204_DelegationTest1" src="/pics/blg204_DelegationTest1_thumb.gif" alt="blg204_DelegationTest1" width="484" height="102" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edilmesi gereken notkalardan birisi de, delegasyon metodu i&amp;ccedil;erisine girildiğinde iptal edilen Task &amp;ouml;rneğinin durumunun halen Running olarak g&amp;ouml;r&amp;uuml;nmesidir. Ancak işlem tamamlandıktan sonra Status değeri Canceled olmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/Question.gif"&gt;&lt;strong&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border-width: 0px;" title="Question" src="/pics/Question_thumb.gif" alt="Question" width="48" height="48" align="left" border="0" /&gt;&lt;/strong&gt;&lt;/a&gt;&lt;em&gt;&lt;strong&gt;Bloğun sorusu; Register&lt;/strong&gt; ile işaret edilen delegasyon metodu i&amp;ccedil;erisinden, &lt;strong&gt;for&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml;n hangi iterasyonunda iptal işleminin ger&amp;ccedil;ekleştirildiği &amp;ccedil;alışma ortamına nasıl bildirilebilir?&lt;/em&gt;&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Wait Handle Kullanımı&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;Task&lt;/strong&gt; İptal işlemlerinde delegasyon kullanımına alternatif bir yol olarak &lt;strong&gt;Wait Handle&lt;/strong&gt; tekniğinden de yararlanılabilir. Bu kullanım şeklini daha net bir kavrayabilmek adına aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Collections.Generic; 
using System.Linq; 
using System.Threading; 
using System.Threading.Tasks;

namespace CancellationScenarios 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        {      
            CancellationTokenSource tokenSource = new CancellationTokenSource(); 
            CancellationToken token = tokenSource.Token;

            IEnumerable&amp;lt;int&amp;gt; numbers = Enumerable.Range(0, 100000000);

            Task startedTask = Task.Factory.StartNew(() =&amp;gt; 
            { 
                for (int i = 0; i &amp;lt; numbers.Count(); i++) 
                { 
                    token.ThrowIfCancellationRequested(); 
                    i++; 
                    i--; 
                    i *= 2; 
                    Console.Write("."); 
                } 
            } 
            , token); 
            Task handleTask = Task.Factory.StartNew(() =&amp;gt; 
                { 
                    token.WaitHandle.WaitOne(); 
                    Console.WriteLine("İşlem iptali."); 
                } 
            ); 
            Console.WriteLine("İşlemler devam ediyor. İptal etmek i&amp;ccedil;in bir tuşa basınız"); 
            Console.ReadLine();

            tokenSource.Cancel();

            Console.ReadLine(); 
            Console.WriteLine("Task Status = {0}", startedTask.Status); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;a href="/pics/blg204_WaitHandleTest.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg204_WaitHandleTest" src="/pics/blg204_WaitHandleTest_thumb.gif" alt="blg204_WaitHandleTest" width="416" height="109" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bu kullanım şeklinde ikinci bir &lt;strong&gt;Task &lt;/strong&gt;bloğunun rol alması g&amp;ouml;zden ka&amp;ccedil;mamalıdır ;) &lt;strong&gt;handleTask&lt;/strong&gt; isimli &lt;strong&gt;Task&lt;/strong&gt;&amp;rsquo; e ait kod bloğu i&amp;ccedil;erisinde, &lt;strong&gt;CancellationToken&lt;/strong&gt; nesnesi &amp;uuml;zerinden &lt;strong&gt;WaitHandle.WaitOne&lt;/strong&gt; &amp;ccedil;ağrısının ger&amp;ccedil;ekleştirildiği g&amp;ouml;r&amp;uuml;lmektedir. Aslında &amp;ccedil;alışma zamanında her hangibir anda &lt;strong&gt;Task&lt;/strong&gt; durumlarına bakıldığında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer sonu&amp;ccedil;larla karşılaşıldığı g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg204_Breakpoint2.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg204_Breakpoint2" src="/pics/blg204_Breakpoint2_thumb.gif" alt="blg204_Breakpoint2" width="644" height="220" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;handleTask&lt;/strong&gt; &amp;ouml;rneğinin durumu &lt;strong&gt;Waiting&lt;/strong&gt; olarak g&amp;ouml;r&amp;uuml;lmektedir. Bu son derece doğaldır nitekim &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneğinin başlatılması sonrasında devreye giren fonksiyon bloğunun daha ilk satırında &lt;strong&gt;WaitOne&lt;/strong&gt; ile &lt;strong&gt;Thread&lt;/strong&gt; &amp;lsquo; in bekletilmesi s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;CancellationTokenSource &lt;/strong&gt;nesne &amp;ouml;rneği &amp;uuml;zerinden &lt;strong&gt;Cancel&lt;/strong&gt; metodunun &amp;ccedil;ağırılması sonrasında ise &lt;strong&gt;WaitOne&lt;/strong&gt; metod &amp;ccedil;ağrısını takip eden kod satırına girildiği ve &lt;strong&gt;startedTask&lt;/strong&gt; &amp;ouml;rneğinin icra etmekte olduğu işlemlerinde iptal edildiği g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;Buraya kadar geliştirdiğimiz &amp;ouml;rnek kod par&amp;ccedil;aları ve iptal deseneleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında her zaman i&amp;ccedil;in &lt;strong&gt;CancellationTokenSource&lt;/strong&gt; &amp;uuml;zerinden &amp;uuml;retilen bir &lt;strong&gt;CancellationToken&lt;/strong&gt; nesneleri olduğu g&amp;ouml;r&amp;uuml;lmektedir. Ayrıca iptal işlemi de her zaman i&amp;ccedil;in &lt;strong&gt;CancellationTokenSource&lt;/strong&gt; &amp;ouml;rneği &amp;uuml;zerinden yapılmaktadır. &lt;strong&gt;CancellationToken&lt;/strong&gt; &amp;ouml;rnekleri ise &lt;strong&gt;Task&lt;/strong&gt; &amp;uuml;retimi sırasında ve i&amp;ccedil;eride kullanılmaktadır. Peki bu bizim ne işimize yarayabilir?&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Birden Fazla Task İşleminin Tek Noktadan İptal Edilmesi&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;İşte az &amp;ouml;nceki sorunun cevabı. Aynı &lt;strong&gt;CancellationToken&lt;/strong&gt; nesne &amp;ouml;rneğinin birden fazla &lt;strong&gt;Task&lt;/strong&gt; ile ilişkilendirilmesi, bu token &amp;ouml;rnekleri ile ilişkili olan &lt;strong&gt;CancellationTokenSource&lt;/strong&gt; &amp;ouml;rneği &amp;uuml;zerinden yapılan iptal talebinin, t&amp;uuml;m ilişkili &lt;strong&gt;Task&amp;rsquo;&lt;/strong&gt; lere iletilmesi anlamına gelmektedir. Gelin bu c&amp;uuml;mleyi aşağıdaki kod par&amp;ccedil;ası ile anlamaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Collections.Generic; 
using System.Linq; 
using System.Threading; 
using System.Threading.Tasks;

namespace CancellationScenarios 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            CancellationTokenSource tokenSource = new CancellationTokenSource(); 
            CancellationToken token = tokenSource.Token;

            IEnumerable&amp;lt;int&amp;gt; numbers = Enumerable.Range(0, 100000000); 
            IEnumerable&amp;lt;int&amp;gt; numbers2 = Enumerable.Range(0, 100000000);

            Task startedTask = Task.Factory.StartNew(() =&amp;gt; 
            { 
                for (int i = 0; i &amp;lt; numbers.Count(); i++) 
                { 
                    token.ThrowIfCancellationRequested(); 
                    i++; 
                    i--; 
                    i *= 2; 
                    Console.Write("."); 
                } 
            } 
            , token);

            Task startedTask2 = Task.Factory.StartNew(() =&amp;gt; 
            { 
                for (int i = 0; i &amp;lt; numbers2.Count(); i++) 
                { 
                    token.ThrowIfCancellationRequested(); 
                    i++; 
                    i--; 
                    i *= 2; 
                    Console.Write("/"); 
                } 
            } 
            , token);

            token.Register(() =&amp;gt; 
                { 
                    Console.WriteLine("İşlem iptali"); 
                } 
            );

            Console.WriteLine("İşlemler devam ediyor. İptal etmek i&amp;ccedil;in bir tuşa basınız"); 
            Console.ReadLine();

            tokenSource.Cancel();

            Console.ReadLine(); 
            Console.WriteLine("Task 1 Status = {0}\nTask 2 Status = {1}", startedTask.Status,startedTask2.Status); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Kod par&amp;ccedil;asında iki farklı &lt;strong&gt;Task&lt;/strong&gt; i&amp;ccedil;eriği s&amp;ouml;z konusudur. Ancak her iki &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneklenirken aynı &lt;strong&gt;CancellationToken&lt;/strong&gt; ile ilişkilendirilmiştir. Buna g&amp;ouml;re &lt;strong&gt;CancellationTokenSource&lt;/strong&gt; &amp;uuml;zerinden yapılacak olan iptal talebi, her iki task işlemi i&amp;ccedil;inde istenmiş olmaktadır. &amp;Ouml;rnek &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg204_MultipleCancel.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg204_MultipleCancel" src="/pics/blg204_MultipleCancel_thumb.gif" alt="blg204_MultipleCancel" width="414" height="112" border="0" /&gt;&lt;/a&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi her iki Task &amp;ouml;rneğinin durumu Canceled olarak set edilmiştir. Task iptal işlemleri ile ilişkili olarak ele almamız gereken farklı konular da mevcuttur. Bunları bir sonraki yazımızda ele almaya &amp;ccedil;alışıyor olacağız. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f6%2fCancellationScenarios.rar"&gt;CancellationScenarios.rar (23,87 kb)&lt;/a&gt;&lt;strong&gt; [&amp;Ouml;rnekler Visual Studio 2010 Ultimate s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde geliştirişmiş ve test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2011-04-23 12:10:00</pubDate>
  <slug>Task-Iptal-Islemlerinin-Izlenmesi(Monitoring-Cancellation)</slug>
  <tags>
    <tag>parallel-programming</tag>
    <tag>task-parallel-library</tag>
    <tag>cancellationtokensource</tag>
    <tag>task-cancellation</tag>
    <tag>cancellationtoken</tag>
    <tag>c#-40</tag>
    <tag>visual-studio-2010-ultimate</tag>
    <tag>monitoring-cancellation</tag>
  </tags>
  <categories>
    <category>Parallel Programming</category>
  </categories>
</post>