<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Çerezlik Algoritmalar ve Extension Methodlar</title>
  <description>Pek tabi yazılım dünyası söz konusu olduğunda var olan hemen her algoritmanın karşılığı olan kodlamaların geliştirilmesi de önemli bir mevzudur. Bilimsel uygulamalarda, finansal model çözümlerinde, endusturi alanındaki planlama tekniklerinde vb...Ben bu yazımda sizleri o karmaşık ve anlaşılması zor algoritmalar ile yormayacağım. Bunun yerine eğilenceli sayılabilecek ve özellikle oyun programlamada oyunculara keyifli dakikalar yaşatmanızı sağlayabilecek basit bir kaç algoritma üzerinde durmaya çalışacağım. Söz konusu algoritmaları birer Extension Method olarak geliştireceğiz(Extension Method kavramını hatırlayalım. C# 3.0 - Derinlemesine Extension Method Kavramı) Dilerseniz hiç vakit kaybetmeden ilk algoritmamız ile işe başlayalım.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2011%2f12%2fartcl_8_1.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Akademik yıllarımızda &amp;ccedil;oğumuz karmaşık matematik algoritmaları ile uğraşmak durumunda kalmışızdır&lt;em&gt;(Sınav stresini hatırlamak bile istemiyorum)&lt;/em&gt; &amp;Ouml;zellikle veri yapıları ve algoritmalar&lt;em&gt;(Data Structures and Alogirthms)&lt;/em&gt; veya Numeric Analiz gibi derslerde yoğun algoritma tasarımları &amp;uuml;zerinde &amp;ccedil;alışılmaktadır. Doğruyu s&amp;ouml;ylemek gerekirse &amp;uuml;lkemizde bu dersleri layıkıyla veren kurum sayısı olduk&amp;ccedil;a azdır. Konular genellikle sırlama algoritmalarının&lt;em&gt;(&amp;ouml;zellikle Quick Sort' un)&lt;/em&gt; &amp;ouml;tesine pek ge&amp;ccedil;memektedir. En fazla y&amp;uuml;ksek lisans &amp;ouml;ğreniminde farklı konulara girilmesi s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;Pek tabi yazılım d&amp;uuml;nyası s&amp;ouml;z konusu olduğunda var olan hemen her algoritmanın karşılığı olan kodlamaların geliştirilmesi de &amp;ouml;nemli bir mevzudur. Bilimsel uygulamalarda, finansal model &amp;ccedil;&amp;ouml;z&amp;uuml;mlerinde, endusturi alanındaki planlama tekniklerinde vb...Ben bu yazımda sizleri o karmaşık ve anlaşılması zor algoritmalar ile yormayacağım. Bunun yerine eğilenceli sayılabilecek ve &amp;ouml;zellikle oyun programlamada oyunculara keyifli dakikalar yaşatmanızı sağlayabilecek basit bir ka&amp;ccedil; algoritma &amp;uuml;zerinde durmaya &amp;ccedil;alışacağım. S&amp;ouml;z konusu algoritmaları birer &lt;strong&gt;Extension Method &lt;/strong&gt;olarak geliştireceğiz&lt;em&gt;.&lt;/em&gt;&amp;nbsp;Dilerseniz hi&amp;ccedil; vakit kaybetmeden ilk algoritmamız ile işe başlayalım.&lt;/p&gt;
&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/02/2011-12-artcl_8_5.jpg" alt="" width="189" height="239" /&gt;Biraz eskilere gidiyor olacağız. Hatta &lt;strong&gt;Roma &lt;/strong&gt;imparatoru &lt;strong&gt;Ceaser &lt;/strong&gt;zamanına &lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt; &lt;strong&gt;Ceaser&lt;/strong&gt;, &lt;strong&gt;Roma &lt;/strong&gt;imparatorluğunun şaşalı d&amp;ouml;nemlerinde generalleri ile haberleşirken basit bir şifreleme metodolojisini kullanmaktaymış. B&amp;uuml;y&amp;uuml;k bir ihtimalle sonradan &lt;strong&gt;Ceaser Cheaper &lt;/strong&gt;olarak adlandırılan bu algoritmanın &amp;ccedil;alışma şekli aslında son derece basitmiş. Algoritmaya g&amp;ouml;re bir c&amp;uuml;mleyi veya metni, alfabe &amp;uuml;zerinde belirlenen sayı kadar sağa(ileri) veya sola(geri) doğru &amp;ouml;telenmek suretiyle karşılık gelen harfler ile dizmek s&amp;ouml;z konusudur. Sonu&amp;ccedil;ta ortaya, okunabilirliği pek olmayan anlamsız bir veri &amp;ccedil;ıkmaktadır ama generaller tarafından bu, merkez sayı noktasına g&amp;ouml;re tekrardan geriye doğru &amp;ouml;telenerek anlamlı hale getirilebilir. Elbetteki bizim ger&amp;ccedil;ek hayat uygulamalarımızda kullanacağımız bir şifreleme algoritması değildir bu. Ancak basit bir zeka oyununda neden kullanılmasın ki. Eğlenceli olabilir &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; &lt;em&gt;(Algoritma hakkında detaylı bilgilere &lt;a title="Ceaser Chiper" href="http://en.wikipedia.org/wiki/Caesar_cipher" target="_blank"&gt;bu adresten&lt;/a&gt; ulaşabilirsiniz.)&lt;/em&gt; Haydi gelin bu algoritma i&amp;ccedil;in bir genişletme metodu yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public static class AlgorithmExtensions
{
	#region Ceaser Cheaper ile karıştırma

	public static string CaesarChiper(this string Word, int ShiftNumber)
	{
		char[] chars = Word.ToCharArray();

		for (int i = 0; i &amp;lt; chars.Length; i++)
		{
			char currentLetter = chars[i];
			currentLetter = (char)(currentLetter + ShiftNumber);
			
			if (currentLetter &amp;gt; 'z')
				currentLetter = (char)(currentLetter - 26);
			else if (currentLetter &amp;lt; 'a')
				currentLetter = (char)(currentLetter + 26);
		
			chars[i] = currentLetter;
		}
		return new string(chars);
	}

	#endregion
}&lt;/pre&gt;
&lt;p&gt;Aslında algoritma olduk&amp;ccedil;a basit g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi. Girilen &lt;strong&gt;Shift &lt;/strong&gt;değerine g&amp;ouml;re &lt;strong&gt;ASCII &lt;/strong&gt;tablosu &amp;uuml;zerinden sağa veya sola doğru hareket ediliyor. &lt;strong&gt;z&lt;/strong&gt; ve &lt;strong&gt;a &lt;/strong&gt;aralığında bir &amp;ouml;teleme hareketi yapıldığına dikkat edelim. &amp;Ouml;teleme noktalarında elde edilen karakterler ardışıl olarak dizilerekten metnin karıştırılmış hali geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;yor. Bir &lt;strong&gt;Extension Method&lt;/strong&gt; olarak yazdığımız i&amp;ccedil;in herhangibir &lt;strong&gt;String &lt;/strong&gt;değişken &amp;uuml;zerinden uygulanabilir. Peki nasıl kullanacağız? &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Gelin aşağıdaki kod par&amp;ccedil;ası ile ilerleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;

namespace TestApp
{
    class Program
    {
        static void Main(string[] args)
        {
            #region Ceaser Chipper Test

            string word = "sol kanattan saldırın";
            Console.WriteLine("C&amp;uuml;mle : {0}\n",word);
            Console.WriteLine("{0}\n",word.CaesarChiper(15));
            Console.WriteLine("{0}\n", word.CaesarChiper(-15));
            Console.WriteLine("{0}\n", word.CaesarChiper(6));
            Console.WriteLine("{0}\n", word.CaesarChiper(10));

            #endregion

        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnek uygulamamızda girilen c&amp;uuml;mlenin &lt;strong&gt;Shift &lt;/strong&gt;değerine g&amp;ouml;re farklı &amp;ccedil;ıktılarının &amp;uuml;retildiği g&amp;ouml;r&amp;uuml;lecektir. İlk seferde 15 karakter sağa gidilerek işe başlanırken ikinci denemede 15 karakter sola gidilmek suretiyle bir &amp;uuml;retim s&amp;ouml;z konusudur. Aşağıdaki ekran &amp;ccedil;ıktısında &amp;ccedil;alışma zamanındaki durum net bir şekilde g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2011%2f12%2fartcl_8_2.jpg" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere eğlenceli g&amp;ouml;r&amp;uuml;nen karmaşık veri i&amp;ccedil;erikleri &amp;uuml;retilmiş durumda. Tabi bunu &amp;ccedil;&amp;ouml;z&amp;uuml;mlemeye &amp;ccedil;alışmak oyuncunun işi olacak. Olduk&amp;ccedil;a fazla zorlanacağından emin olabilirsiniz. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img style="float: left;" src="/image.axd?picture=/2017/02/2011-12-artcl_8_7.jpg" alt="" /&gt;Ceaser' ın hakkına Ceaser' a verip ve &lt;strong&gt;Ceaser&lt;/strong&gt;' a elveda diyerek yolumuza devam edelim. Sırada yer&amp;nbsp; alan algoritmamız ise &lt;strong&gt;Fisher-Yates Shuffle &lt;/strong&gt;olarak literat&amp;uuml;rde yer almaktadır. Bu algoritma yardımıyla bir sayı veya kelime dizisinin ya da farklı bir veri k&amp;uuml;mesinin her defasında farklı olacak şekilde karıştırılarak elde edilmesi s&amp;ouml;z konusudur. Bir başka deyişle farklı &lt;strong&gt;perm&amp;uuml;tasyonların &lt;/strong&gt;hesap edilerek bir karma veri i&amp;ccedil;eriği &amp;uuml;retilmesi gibi bir durum mevcuttur. &lt;em&gt;(1938 yılında keşfedilmiş olan bu algoritma hakkında ki detaylı bilgileri yine &lt;a title="Fisher Shuffle Algorithm" href="http://en.wikipedia.org/wiki/Fisher%E2%80%93Yates_shuffle" target="_blank"&gt;wikipedia&lt;/a&gt; adresi &amp;uuml;zerinden elde edebilirsiniz.) &lt;/em&gt;Biz hi&amp;ccedil; vakit kaybetmeden bu algoritma i&amp;ccedil;in bir extension metod geliştirerek ilerleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;

public static class AlgorithmExtensions
{
    #region Fisher-Yates ile Shuffling

    public static void Shuffle&amp;lt;T&amp;gt;(this List&amp;lt;T&amp;gt; SourceArray) // Fisher-Yates Shuffle Algoritmasına g&amp;ouml;re karıştırır
    {
        Random randomizer = new Random();

        for (int i = SourceArray.Count; i &amp;gt; 1; i--)
        {
            int j = randomizer.Next(i); // 0 ile i-1 arasında rastgele bir değer &amp;uuml;retecektir
            T temp = SourceArray[j];
            SourceArray[j] = SourceArray[i - 1];
            SourceArray[i - 1] = temp;
        }
    }

    #endregion
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi algoritmamız kaynak olan dizi i&amp;ccedil;erisindeki elemanları sondan başa doğru gezmektedir. Bu işlem sırasında o anki iterasyon değerine kadarki aralıkta &amp;uuml;retilen bir rastgele sayı ve bunun dizideki karşılığı olan değer ge&amp;ccedil;ici bir değişkene atanır. Ardından o anki iterasyonun bir &amp;ouml;nceki değerine karşılık gelen dizi elemanı rastgele elde edilen değerin işaret ettiği indise taşınır. Son olarak da ge&amp;ccedil;ici değişkene alınan eleman o anki iterasyon değerinin bir &amp;ouml;ncesine karşılık gelen indise yerleştirilir. Genişletme metodunu generic olarak tasarladığımızı ve herhangibir &lt;strong&gt;List &lt;/strong&gt;tipine uygulayabildiğimizi fark etmişsinizdir. Temel olarak hedefimiz sayısal veya metin tabanlı koleksiyon listelerinin karıştırılmış &amp;ccedil;ıktılarını elde etmektir &lt;em&gt;(ki bir Puzzle uygulamasında bu teknik olduk&amp;ccedil;a işe yarayabilir&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; ) &lt;/em&gt;Metodun kalbinde &lt;strong&gt;Random &lt;/strong&gt;tipi yer almaktadır. Metodumuzu aşağıdaki kod par&amp;ccedil;asında olduğu gibi test s&amp;uuml;r&amp;uuml;ş&amp;uuml;ne &amp;ccedil;ıkartabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;

namespace TestApp
{
    class Program
    {
        static void Main(string[] args)
        {
            #region Fisher - Yates Shuttle Alogirtması

            List&amp;lt;int&amp;gt; numbers = Enumerable.Range(0, 50).ToList();
            List&amp;lt;string&amp;gt; names = new List&amp;lt;string&amp;gt; {
                "bill","steve","daniel","meg","julia"
                ,"sunny","Matheus","chris","lora"
                ,"maggi","jim","steve","Emilie"
                ,"Maria","eva","samantha" 
            };

            numbers.Shuffle();
            WriteToConsole(numbers);

            numbers.Shuffle();
            WriteToConsole(numbers);

            names.Shuffle();
            WriteToConsole(names);

            names.Shuffle();
            WriteToConsole(names);

            #endregion
        }

        private static void WriteToConsole&amp;lt;T&amp;gt;(List&amp;lt;T&amp;gt; SourceArray)
        {
            foreach (var element in SourceArray)
            {
                Console.Write("{0} ", element);
            }
            Console.WriteLine("\n\n");
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Test &lt;/strong&gt;kodunda &lt;strong&gt;string &lt;/strong&gt;tipte isimlerden oluşan bir &lt;strong&gt;List &lt;/strong&gt;koleksiyonu ve benzer şekilde sayılardan oluşan bir veri i&amp;ccedil;eriği s&amp;ouml;z konusudur. Uygulamanın &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı ise aşağıdakine benzer olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2011%2f12%2fartcl_8_3.jpg" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Size tavsiyem basit bir fotoğrafı n sayıda kareye b&amp;ouml;ld&amp;uuml;kten sonra, bu par&amp;ccedil;aları işaret eden sınıfa ait nesne &amp;ouml;rneklerinden oluşan bir &lt;strong&gt;List &lt;/strong&gt;koleksiyonunu, &lt;strong&gt;Fisher-Yates Shuffle &lt;/strong&gt;algoritmasını kullanarak, oyuncuyu her seferinde farklı bir karmaşa ile baş başa bırakmayı denemeniz olacaktır &lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img style="float: left;" src="/image.axd?picture=/2017/02/2011-12-artcl_8_6.jpg" alt="" width="197" height="179" /&gt;Geldik bu yazımızda size aktarmak istediğim son algoritmaya. Bu kez &lt;strong&gt;Palindromik &lt;/strong&gt;veri tespiti yapmak i&amp;ccedil;in kullanılan bir algoritma &amp;uuml;zerinde duracağız. &lt;strong&gt;Palindromic &lt;/strong&gt;sayılar &lt;strong&gt;181, 191, 55 &lt;/strong&gt;gibi tersten okunduklarında da aynı sayı değerini veren kavramlar olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilirler. Aslında &lt;strong&gt;Palindromic &lt;/strong&gt;sayılar olarak d&amp;uuml;ş&amp;uuml;nebileceğimiz bu modeli kelimeler i&amp;ccedil;in de ele alabiliriz. &lt;strong&gt;ANA, KA&amp;Ccedil;AK &lt;/strong&gt;gibi &amp;ouml;rnekler bu anlamda d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Senaryo olarak baktığımızda ise, s&amp;ouml;z gelimi metin i&amp;ccedil;erikli bir d&amp;ouml;k&amp;uuml;man i&amp;ccedil;erisinde yer alan &lt;strong&gt;Palindromic &lt;/strong&gt;kelimeleri veya c&amp;uuml;mleleri oyuncuya buldurabilir ve s&amp;uuml;re bazında başarısını &amp;ouml;l&amp;ccedil;&amp;uuml;mlemeye &amp;ccedil;alışabiliriz. &lt;em&gt;(Bu algoritma ile ilişkili detaylı bilgileri yine &lt;a title="Palindrom" href="http://tr.wikipedia.org/wiki/Palindrom" target="_blank"&gt;Wikipedia&lt;/a&gt; &amp;uuml;zerinden okuyabilirsiniz.) &lt;/em&gt;Ancak &amp;ouml;ncesinde algoritma i&amp;ccedil;in gerekli olan genişletme metodumuzu yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;

public static class AlgorithmExtensions
{
    #region Palindromic Kelimeleri/C&amp;uuml;mleleri Bulmak

    public static List&amp;lt;string&amp;gt; PalindromicCheck(this List&amp;lt;string&amp;gt; Words)
    {
        List&amp;lt;string&amp;gt; result = new List&amp;lt;string&amp;gt;();

        foreach (string word in Words)
        {
            if (IsPalindromicData(word))
                result.Add(word);
        }

        return result;
    }

    private static bool IsPalindromicData(string SourceValue)
    {
        int minValue = 0;
        int maxValue = SourceValue.Length - 1;
        while (true)
        {
            if (minValue &amp;gt; maxValue)
                return true;
            
            char a = SourceValue[minValue];
            char b = SourceValue[maxValue];
            
            if (char.ToLower(a) != char.ToLower(b))
                return false;
            
            minValue++;
            maxValue--;
        }
    }

    #endregion
}&lt;/pre&gt;
&lt;p&gt;Sonsuz while d&amp;ouml;ng&amp;uuml;s&amp;uuml; aslında kelimenin başından ve sonundan itibaren orta noktasına gelinceye kadar bir iterasyonu kullanmaktadır. İlk karakter ve son karakterin aynı olup olmadığı noktasında devreye giren algoritma orta noktadaki karaktere kadar devam edecektir. Genişletme metodumuz bu versiyonu ile &lt;strong&gt;string &lt;/strong&gt;tipinden &lt;strong&gt;List &lt;/strong&gt;koleksiyonuna uygulanabilecek şekilde tasarlanmıştır. Koleksiyon i&amp;ccedil;erisindeki veriler, &lt;strong&gt;IsPalindromicData&lt;/strong&gt; metodu yardımıyla kontrol edilmektedir. Metod sonu&amp;ccedil; olarak &lt;strong&gt;Palindromic &lt;/strong&gt;veri i&amp;ccedil;eriğini barındıran başka bir &lt;strong&gt;List &lt;/strong&gt;koleksiyonunu geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Haydi gelin &amp;ouml;rneğimizi test edelim. Bu ama&amp;ccedil;la aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;

namespace TestApp
{
    class Program
    {
        static void Main(string[] args)
        {
            #region Palindromik kelimelerin tespiti

            List&amp;lt;string&amp;gt; words = new List&amp;lt;string&amp;gt;{
                "ana","baba","ama&amp;ccedil;","abla","aha","ka&amp;ccedil;ak"
                ,"kayak","kırık","cam","uzak","yakın","meşale"
                ,"neden","sus","s&amp;uuml;s","'ey edip adanada pide ye'"
            };


            var result = words.PalindromicCheck();
            WriteToConsole(result);

            #endregion
        }

        private static void WriteToConsole&amp;lt;T&amp;gt;(List&amp;lt;T&amp;gt; SourceArray)
        {
            foreach (var element in SourceArray)
            {
                Console.Write("{0} ", element);
            }
            Console.WriteLine("\n\n");
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnekte kullanılan koleksiyon i&amp;ccedil;erisinde tertsten okunduklarında da aynı olan bazı kelimeler ve hatta bir c&amp;uuml;mle mevcuttur. İşte &amp;ccedil;alışma zamanı sonu&amp;ccedil;ları.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2011%2f12%2fartcl_8_4.jpg" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu algoritmayı oyuncudan ziyade oyun motoru kullanıyor olabilir. Ya da siz geniş bir kelime k&amp;uuml;mesini ekrana basıp bu k&amp;uuml;me i&amp;ccedil;erisindeki &lt;strong&gt;Palindromic &lt;/strong&gt;kelimeleri tespit etmesi i&amp;ccedil;in hen&amp;uuml;z ilk okul &amp;ccedil;ağında olan bir oyuncuyu tercih edebilir ve s&amp;uuml;re bazlı bir ortam sağlayarak, onun dikkat, kavrama, fark etme, g&amp;ouml;rsel hafıza gibi yeteneklerini arttırmaya &amp;ccedil;alışabilirsiniz &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında oyun programlama denilince &amp;ccedil;ok basit ve yararlı algoritmalar olduğunu g&amp;ouml;rebiliyoruz. Ben bu yazımızda sadece 3 tanesini sizlere aktarmaya &amp;ccedil;alıştım. Elbetteki &amp;ccedil;ok daha fazlası var. Araştırmak, denemek, &amp;ouml;ğrenmek, test etmek ve kullanmak sizin g&amp;ouml;reviniz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;</content>
  <pubDate>2012-06-07 23:30:00</pubDate>
  <slug>Cerezlik-Algoritmalar-ve-Extension-Methodlar</slug>
  <tags>
    <tag>extension-methods</tag>
    <tag>fisher-yates-shuffle</tag>
    <tag>ceaser-chipper</tag>
    <tag>palindromic-words</tag>
    <tag>palindromic-numbers</tag>
    <tag>c#</tag>
  </tags>
  <categories>
    <category>C#</category>
    <category>Data Structures, Algorithms</category>
  </categories>
</post>