<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net 2.0 ile Cross-Page Posting</title>
  <description>Bu makalemizde, Asp.Net 2.0 (Asp.Net Whidbey) ile, başka sayfalara veri postalama işlemlerinin nasıl ele alındığını ve uygulandığını incelemeye çalışacağız. Bildiğiniz gibi, Asp.Net 1.0 / 1.1 ile gelen yeniliklerden en önemlisi, sayfaların kendi kendilerine form verilerini postalayabilme kabiliyetleridir. Öyleki, Asp.Net ile geliştirilen web sayfaları aslında birer sınıf nesnesi olduklarından, sayfa üzerindeki form kontrollerine ve değerlerine kolayca erişilebilmektedir. Ancak bazı zamanlarda, sayfalarımızda yer alan form verilerini başka sayfalara göndermek isteyedebiliriz. İşte Cross-Page Posting olarak adlandırılan bu işlemlerin, Asp.Net 2.0 ile gerçekleştirilmesi hem daha kolay hemde daha etkili hale getirilmiştir.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bu makalemizde, Asp.Net 2.0 (Asp.Net Whidbey) ile, başka sayfalara veri postalama işlemlerinin nasıl ele alındığını ve uygulandığını incelemeye &amp;ccedil;alışacağız. Bildiğiniz gibi, Asp.Net 1.0 / 1.1 ile gelen yeniliklerden en &amp;ouml;nemlisi, sayfaların kendi kendilerine form verilerini postalayabilme kabiliyetleridir. &amp;Ouml;yleki, Asp.Net ile geliştirilen web sayfaları aslında birer sınıf nesnesi olduklarından, sayfa &amp;uuml;zerindeki form kontrollerine ve değerlerine kolayca erişilebilmektedir. Ancak bazı zamanlarda, sayfalarımızda yer alan form verilerini başka sayfalara g&amp;ouml;ndermek isteyedebiliriz. İşte Cross-Page Posting olarak adlandırılan bu işlemlerin, Asp.Net 2.0 ile ger&amp;ccedil;ekleştirilmesi hem daha kolay hemde daha etkili hale getirilmiştir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneklerimizi geliştirdiğimizde bu konuyu &amp;ccedil;ok daha iyi anlayabileceğinize inanıyorum. Hi&amp;ccedil; vakit kaybetmeden &amp;ouml;rneğimizi geliştirmeye başlayalım. Bu &amp;ouml;rnek uygulamamızı, Visual Studio.Net' in 2005 s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml;n Beta versiyonu ile geliştireceğiz. &amp;Ouml;rneğimizde, basit olarak iki web sayfası kullanacağız. &amp;Ouml;ncelikle yerel sunucumuzda bir web sitesi oluşturalım. Bunun i&amp;ccedil;in, File men&amp;uuml;s&amp;uuml;nden, New alt men&amp;uuml;s&amp;uuml;n&amp;uuml; ve buradan da Web Site kısmını se&amp;ccedil;iyoruz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk83_1.gif" alt="" width="405" height="139" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 1. Yeni bir Web Site a&amp;ccedil;ıyoruz.&lt;/p&gt;
&lt;p&gt;Ardından, karşımıza &amp;ccedil;ıkacak dialog penceresinden, Asp.Net Web Site' ı se&amp;ccedil;elim ve localhost altında CrossPosting isimli sanal klas&amp;ouml;r&amp;uuml;m&amp;uuml;z&amp;uuml;n adını girelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk83_2.gif" alt="" width="583" height="411" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 2. Web Site'ımızı oluşturuyoruz.&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından, Visual Studio.Net standart olarak default.aspx isimli sayfamızı oluşturur. Bu sayfamızı aşağıdaki şekilde olduğu gibi oluşturalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk83_3.gif" alt="" width="329" height="230" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 3. Form tasarmımız.&lt;/p&gt;
&lt;p&gt;Sayfamızın kodlanmasına ge&amp;ccedil;meden &amp;ouml;nce, aspx sayfamızın i&amp;ccedil;eriğine bir g&amp;ouml;z atalım. Nitekim burada &amp;ouml;nemli olan btnDiger ID değerine sahip button kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n takıları arasındaki i&amp;ccedil;eriktir. Biz burada ufak bir değişiklik yapacağız. &amp;Ouml;nce kodlarımızın başlangı&amp;ccedil; haline bakalım.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" CompileWith="Default.aspx.cs" ClassName="Default_aspx" %&amp;gt;

&amp;lt;!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd"&amp;gt;

&amp;lt;html xmlns="http://www.w3.org/1999/xhtml" &amp;gt;
&amp;lt;head runat="server"&amp;gt;
&amp;lt;title&amp;gt;Untitled Page&amp;lt;/title&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body&amp;gt;
    &amp;lt;form id="form1" runat="server"&amp;gt;
        &amp;lt;asp:Label ID="Label1" Runat="server" Text="Rumuzunuz" Width="86px" Height="19px"
Font-Bold="True"&amp;gt;&amp;lt;/asp:Label&amp;gt;&amp;lt;span style="font-size: 10pt; font-family: Verdana"&amp;gt; &amp;lt;/span&amp;gt;
        &amp;lt;asp:TextBox ID="TextBox1" Runat="server"&amp;gt;&amp;lt;/asp:TextBox&amp;gt;&amp;lt;br /&amp;gt;
        &amp;lt;span style="font-size: 10pt; font-family: Verdana"&amp;gt;&amp;lt;/span&amp;gt;
        &amp;lt;asp:Label ID="Label2" Runat="server" Text="Yaş Aralığınız" Font-Bold="True"&amp;gt;&amp;lt;/asp:Label&amp;gt;&amp;lt;span
style="font-size: 10pt; font-family: Verdana"&amp;gt; &amp;lt;/span&amp;gt;
        &amp;lt;asp:DropDownList ID="DropDownList1" Runat="server" Width="71px" Height="22px"&amp;gt;
            &amp;lt;asp:ListItem&amp;gt;20-25&amp;lt;/asp:ListItem&amp;gt;
            &amp;lt;asp:ListItem&amp;gt;25-30&amp;lt;/asp:ListItem&amp;gt;
            &amp;lt;asp:ListItem&amp;gt;30-35&amp;lt;/asp:ListItem&amp;gt;
        &amp;lt;/asp:DropDownList&amp;gt;&amp;lt;span style="font-size: 10pt; font-family: Verdana"&amp;gt;
&amp;lt;br /&amp;gt;
&amp;lt;br /&amp;gt;
&amp;lt;/span&amp;gt;
        &amp;lt;asp:Button ID="btnBurası" Runat="server" Text="Burası" /&amp;gt;&amp;lt;span style="font-size: 10pt;
font-family: Verdana"&amp;gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;
&amp;lt;/span&amp;gt;
        &amp;lt;asp:Button ID="btnDiger" Runat="server" Text="Diger" Width="58px" Height="24px" /&amp;gt;&amp;lt;span
style="font-size: 10pt; font-family: Verdana"&amp;gt;
&amp;lt;br /&amp;gt;
&amp;lt;br /&amp;gt;
&amp;lt;br /&amp;gt;
&amp;lt;/span&amp;gt;
        &amp;lt;asp:Label ID="lblKim" Runat="server" Width="270px" Height="19px" BorderColor="#FFC0C0"
BorderWidth="1px" Font-Bold="True"&amp;gt;&amp;lt;/asp:Label&amp;gt;&amp;lt;span style="font-size: 10pt; font-family: Verdana"&amp;gt;
&amp;lt;/span&amp;gt;
    &amp;lt;/form&amp;gt;
&amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Burada btnDiger, ID değerine sahip button kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n olduğu satırı aşağıdaki gibi değiştirelim.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:Button ID="btnDiger" PostBackUrl="Diger.aspx" Runat="server" Text="Diger" Width="58px" Height="24px" /&amp;gt;&lt;/pre&gt;
&lt;p&gt;İşte Asp.Net 2.0 ile gelen ilk yeniliklerden birisi. PostBackUrl &amp;ouml;zelliği. Bu Url, button kontrol&amp;uuml;ne basıldığında, Form &amp;uuml;zerindeki verilerin belirtilen url' deki sayfaya g&amp;ouml;nderilmesini sağlamaktadır. İşleyiş şekli son derece etkilidir. Şimdi Solution Explorer' dan Add New Item ile, Diger.aspx isimli sayfamızıda uygulamamıza ekleyelim. Ardından, default.aspx sayfamızın Code-Behind kodlarını da aşağıdaki gibi geliştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.Configuration;
using System.Web;
using System.Web.Security;
using System.Web.UI;
using System.Web.UI.WebControls;
using System.Web.UI.WebControls.WebParts;
using System.Web.UI.HtmlControls;

public partial class Default_aspx
{
    void btnBurası_Click(object sender, EventArgs e)
    {
        lblKim.Text = TextBox1.Text + DropDownList1.SelectedItem.Text;
    }
}&lt;/pre&gt;
&lt;p&gt;Burada yaptığımız değişik bir olay yok. Sadece, TextBox1 kontrol&amp;uuml;ne girilen ve DropDownList1 kontrol&amp;uuml;nde se&amp;ccedil;ilen değerleri, Label kontrol&amp;uuml;ne yazdırdık. İşte bu, Asp.Net 1.0/1.1 s&amp;uuml;r&amp;uuml;m&amp;uuml;nden bildiğimiz, sayfanın kendi kendine verileri postalaması işlemidir. Asp.Net 2.0 ile gelen yeni teknikleri ise, Diger.aspx sayfasında kullanacağız. Bunun i&amp;ccedil;in Diger.aspx sayfamıza bir Label kontrol&amp;uuml; yerleştirelim ve ardından, sayfamıza ait kodları aşağıdaki gibi d&amp;uuml;zenleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.Configuration;
using System.Web;
using System.Web.Security;
using System.Web.UI;
using System.Web.UI.WebControls;
using System.Web.UI.WebControls.WebParts;
using System.Web.UI.HtmlControls;

public partial class Diger_aspx
{
    void Page_Load(object sender, EventArgs e)
    {
        TextBox tbRumuz = (TextBox)PreviousPage.FindControl("TextBox1");
        DropDownList lstYas = (DropDownList)PreviousPage.FindControl("DropDownList1");

        lblDurum.Text = tbRumuz.Text + lstYas.SelectedItem.Text;
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat edecek olursanız burada son derece g&amp;uuml;&amp;ccedil;l&amp;uuml; bir teknik kullanılmaktadır. Bir adet TextBox ve bir adette DropDownList kontrol&amp;uuml; tanımlanmış ve oluşturulmuştur. TextBox kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; oluştururken, PreviousPage sınıfının FindControl metodu ile, bu sayfaya Post işlemi ile form verisi g&amp;ouml;nderen sayfadaki TextBox1 kontrol&amp;uuml; bulunmaktadır. Bu işlem, bulunan kontrol&amp;uuml;n TextBox kontrol&amp;uuml; olarak cast edilmesi ile tamamlanır. Dolayısıyla, Diger.aspx sayfamızın Page_Load olay metodunda, elimizde bir adet TextBox kontrol&amp;uuml; olacaktır. Bu TextBox kontrol&amp;uuml; aslında, default.aspx sayfasından gelen kontrold&amp;uuml;r. B&amp;ouml;ylece, default.aspx sayfasındaki TextBox1 kontrol&amp;uuml;n&amp;uuml;n değerine ve &amp;ouml;zelliklerine bu sınıf i&amp;ccedil;erisinden (Diger.aspx sayfasından) kolayca erişebiliriz. Aynı teknik, DropDownList kontrol&amp;uuml;m&amp;uuml;z i&amp;ccedil;inde ge&amp;ccedil;erlidir. İşte Asp.Net 2.0, başka sayfalara form verisi g&amp;ouml;nderme işlemlerinde b&amp;ouml;ylesine g&amp;uuml;&amp;ccedil;l&amp;uuml; bir teknik ile gelmektedir.&lt;/p&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda ve Burası başlıklı butona tıkladığımızda basit&amp;ccedil;e sayfa kendi kendisine postalama işlemini uygular. (Postback).&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk83_4.gif" alt="" width="358" height="235" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 4. Postback.&lt;/p&gt;
&lt;p&gt;Diger başlıklı button kontrol&amp;uuml;ne bastığımızda ise, Diger.aspx isimli sayfaya gidilir. Bu sayfanın Page_Load olay metodu &amp;ccedil;alışır ve burada ilgili TextBox ve DropDownList kontrolleri, default.aspx' ten gelen kontroller baz alınarak oluşturulur. Sonu&amp;ccedil; olarak, default.aspx sayfasındaki kontroller &amp;uuml;zerinde yer alan veriler kolayca elde edilir ve bu sayadaki Label kontrol&amp;uuml;ne i&amp;ccedil;erikleri yazdırılır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk83_5.gif" alt="" width="424" height="230" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 5. Cross-Page Posting&lt;/p&gt;
&lt;p&gt;Cross-Page Posting işleminde elbette sorun yaratabilecek durumlarda s&amp;ouml;z konusudur. Bunların en &amp;ouml;nemlisi, bir kullanıcının, default.aspx &amp;ccedil;alıştırılmadan &amp;ouml;nce diger.aspx sayfasına ulaşmaya &amp;ccedil;alışmasıdır. B&amp;ouml;yle bir durumda, default.aspx daha &amp;ouml;nceden &amp;ccedil;alıştırılmadığı i&amp;ccedil;in, buradaki kontroller oluşturulmamış olacaktır. Dolayısıyla, diger.aspx sayfasında, PreviousPage sınıfına ait metodlar, var olmayan kontrolleri bulmaya &amp;ccedil;alışacak ve referanslar oluşturulamayacaktır. Kullanıcıların b&amp;ouml;yle bir girişimde bulunması sonucunda aşağıdaki gibi bir hata mesajı ile karşılaşılır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk83_6.gif" alt="" width="586" height="412" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 6. Oluşan Hata.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;&amp;ouml;z&amp;uuml;m gayet basittir. Bu sayfa &amp;ccedil;alıştırıldığında, bu sayfaya başka bir sayfadan form bilgisinin g&amp;ouml;nderilip g&amp;ouml;nderilmediği &amp;ouml;ğrenilmelidir. Bunun i&amp;ccedil;in, Page sınıfının IsCrossPagePostBack isimli &amp;ouml;zelliğinden yararlanılır. Bu &amp;ouml;zellik, aslında IsPostBack &amp;ouml;zelliği gibi &amp;ccedil;alışır. Sadece, başka bir sayfanın mevcut sayfaya veri postalayıp postalamadığını kontrol eden ve boolean değer d&amp;ouml;nd&amp;uuml;ren bir yapıdadır. Prototipi aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public bool IsCrossPagePostBack {get;}&lt;/pre&gt;
&lt;p&gt;Dolayısıyla, diger.aspx sayfamızın arka kodlarını aşağıdaki gibi değiştirmemiz sorunun giderilmesini sağlayacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public partial class Diger_aspx
{
    void Page_Load(object sender, EventArgs e)
    {
        if (PreviousPage!=null &amp;amp;&amp;amp; PreviousPage.IsCrossPagePostBack)
        {
            TextBox tbRumuz = (TextBox)PreviousPage.FindControl("TextBox1");
            DropDownList lstYas = (DropDownList)PreviousPage.FindControl("DropDownList1");

            lblDurum.Text = tbRumuz.Text + lstYas.SelectedItem.Text;
        }
        else
        {
           Response.Redirect("default.aspx");
        }
    }
}&lt;/pre&gt;
&lt;p&gt;B&amp;ouml;ylece, eğer kullanıcılar direkt olarak diger.aspx sayfasını &amp;ccedil;alıştırırlarsa, &amp;ouml;nceden gelen bir Cross-Page Posting işlemi olmadığından, else bloğundaki kod satırı &amp;ccedil;alışacak ve default.aspx sayfasına gidilecektir.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, Asp.Net 2.0 ile gelen yeniliklerden birisine değinmeye &amp;ccedil;alıştık. Elbette şu an i&amp;ccedil;in, Asp.Net 2.0 hen&amp;uuml;z beta aşamasında. Yani yazılan kodlar ve kullanılan teknikler değişebilir hatta bazen kaynakların aksine &amp;ccedil;alışmayabilir. Bunlardan da haberdar olduk&amp;ccedil;a sizleri bilgilendirmeye &amp;ccedil;alışacağız. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. İlerleyen makalelerimizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-08-31 12:00:00</pubDate>
  <slug>Asp-Net-2-0-ile-Cross-Page-Posting-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet-20</tag>
    <tag>cross-page-posting</tag>
  </tags>
  <categories>
    <category>Asp.Net 2.0</category>
  </categories>
</post>