<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net 2.0 ve Temalar (Themes)</title>
  <description>Bir internet sitesini önemli kılan özellikler, sayfalarının font, renk, nesne yerleşimleri ile kontrollere ait görsel özellikleri açısından birbirleriyle olan uyumluluklarıdır. Bu anlamda, çoğu zaman sayfalara CSS stilleri uygulanır ve web uygulamasındaki tüm görsel öğelerin aynı font, renk vb özelliklere sahip olması sağlanır. Asp.Net 2.0, bu tarz stillerin çeşitli seviyelerde uygulanmasını sağlayacak yeni bir özellik sağlamaktadır. Themes (Temalar). İşte bu makalemizde, Asp.Net 2.0'da yer alan temaların, hangi seviyelere, nasıl ve ne şekilde uygulanabileceğini incelemeye çalışacağız.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bir internet sitesini &amp;ouml;nemli kılan &amp;ouml;zellikler, sayfalarının font, renk, nesne yerleşimleri ile kontrollere ait g&amp;ouml;rsel &amp;ouml;zellikleri a&amp;ccedil;ısından birbirleriyle olan uyumluluklarıdır. Bu anlamda, &amp;ccedil;oğu zaman sayfalara CSS stilleri uygulanır ve web uygulamasındaki t&amp;uuml;m g&amp;ouml;rsel &amp;ouml;ğelerin aynı font, renk vb &amp;ouml;zelliklere sahip olması sağlanır. Asp.Net 2.0, bu tarz stillerin &amp;ccedil;eşitli seviyelerde uygulanmasını sağlayacak yeni bir &amp;ouml;zellik sağlamaktadır. Themes (Temalar). İşte bu makalemizde, Asp.Net 2.0'da yer alan temaların, hangi seviyelere, nasıl ve ne şekilde uygulanabileceğini incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;Bir tema, aslında işletim sistemlerinde uygulanan temalardan &amp;ccedil;ok da farklı değildir. Pek &amp;ccedil;oğumuz kullandığı işletim sistemine temalar uygulamıştır. Uygulanan temalar, &amp;ccedil;oğunlukla sistemdeki font &amp;ouml;zelliklerini, pencerelere ait &amp;ccedil;eşitli renkleri, duvar kağıtlarını, sembolleri vb &amp;ouml;ğeleri g&amp;ouml;rsel a&amp;ccedil;ıdan belirli bir standarta g&amp;ouml;re değiştirirler. Ancak internet projelerinin tasarlanması s&amp;ouml;z konusu olduğunda, temaların uygulanacağı seviyeler kavramı &amp;ouml;ncelikli olarak devreye girmektedir. Asp.Net 2.0 ile, makine seviyesinde, web uygulaması seviyesinde, sayfa seviyesinde ve sunucu kontrol&amp;uuml; seviyesinde temalar uygulanabilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk86_1.gif" alt="" width="301" height="291" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1 Tema Seviyeleri.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Biz bu makalemizde, temaların bu seviyelere nasıl uygulandığını incelemek amacıyla, basit bir tema oluşturacak ve bu temayı &amp;ccedil;eşitli seviyelere uygulayarak sonu&amp;ccedil;larını incelemeye &amp;ccedil;alışacağız. Bu ama&amp;ccedil;la ilk olarak bir web uygulması a&amp;ccedil;alım. Bu web uygulamamızın default.aspx sayfasını aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne sahip olacak şekilde oluşturalım. Bu sayfada bir ka&amp;ccedil; sunucu kontrol&amp;uuml;n&amp;uuml; kullanacağız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk86_3.gif" alt="" width="238" height="281" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. Sayfamızın Varsayılan Hali.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Eğer sayfamızı bu haliyle tarayıcıda a&amp;ccedil;arsak aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk86_4.gif" alt="" width="268" height="360" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. Sayfamızın ilk halinin tarayıcadaki g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdi uygulamamıza bir tema ekleyeceğiz. Bunun i&amp;ccedil;in &amp;ouml;ncelikle solution' ımıza Theme isimli bir folder eklememiz gerekiyor. Bu klas&amp;ouml;r, bir &amp;ouml;nceki makalemizde bahsetmiş olduğumuz Code klas&amp;ouml;r&amp;uuml; gibi, solution i&amp;ccedil;in &amp;ouml;zel anlam ifade eden bir yapıya sahiptir. Nitekim bu klas&amp;ouml;r altına, uygulamaya ait font, renk gibi stillerin nasıl olacağını belirten css dosyaları ve sunucu kontrollerine ait g&amp;ouml;rsel ayarların yapıldığı skin dosyaları ile &amp;ccedil;eşitli resimler eklenebilir. Theme klas&amp;ouml;r&amp;uuml;n&amp;uuml; oluşturduktan sonra kullanacağımız tema i&amp;ccedil;in bir isim belirlemeli ve bu isimle yeni bir alt klas&amp;ouml;r a&amp;ccedil;malıyız. Artık skin ve css dosyalarımızı bu klas&amp;ouml;r altında oluşturabiliriz. B&amp;ouml;ylece, uygulamamızda oluşturduğumuz alt klas&amp;ouml;r ismindeki temayı uygulayabiliriz. Klas&amp;ouml;r yapımız aşağıdaki şekildeki gibi olmalıdır. Bu hiyerarşik d&amp;uuml;zen aynı zamanda, bir solution i&amp;ccedil;in birden fazla tema oluşturulabileceğinide g&amp;ouml;stermektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk86_5.gif" alt="" width="270" height="164" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. Temamız i&amp;ccedil;in uygulamamız gereken klas&amp;ouml;r hiyerarşisi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdi sunucu kontrollerimizin nasıl g&amp;ouml;r&amp;uuml;neceğini belirleyeceğimiz &amp;ouml;zellikleri taşıyacak bir skin dosyası oluşturacağız. Bu dosyamızı Temam klas&amp;ouml;r&amp;uuml; altında geliştireceğiz. Skinler &amp;ouml;zelikle temalar i&amp;ccedil;in tasarlanmış tipteki dosyalardır. Ancak, Asp.Net 2.0' ın Beta s&amp;uuml;r&amp;uuml;m&amp;uuml;nde bu dosya tipi tanımlanmamıştır. Dolayısıyla, klas&amp;ouml;r&amp;uuml;m&amp;uuml;z altında Add New Item se&amp;ccedil;eneği ile skin eklemek istiyorsak, Text File tipini se&amp;ccedil;memiz ve dosya ismimizin uzantısı skin olacak şekilde belirtmemiz gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk86_6.gif" alt="" width="204" height="293" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 5. Skin eklenmesi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bir skin dosyası, aslında sunucu kontrollerinin g&amp;ouml;rsel a&amp;ccedil;ıdan &amp;ouml;zelleştirilmiş halini i&amp;ccedil;erir. Dolayısıyla, bir web uygulamasına bir temanın uygulanması sonucu, bu uygulamdaki sunucu kontrolleri i&amp;ccedil;in skin dosyaları i&amp;ccedil;erisindeki sunucu kontrollerinin g&amp;ouml;rsel &amp;ouml;zellikleri uygulanır. Bunu aşağıdaki kod satırlarından daha iyi anlayabiliriz. Aşağıdaki kod satırları, Gorsel.skin dosyamıza ait olup &amp;ccedil;eşitli sunucu kontrollerine g&amp;ouml;rsel a&amp;ccedil;ıdan zenginlik katacak &amp;ouml;zelliklere sahiptir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:Label  Runat="server" Font-Bold="False" Font-Names="Forte" Font-Size="Large" ForeColor="Red"&amp;gt;&amp;lt;/asp:Label&amp;gt;
&amp;lt;asp:TextBox  Runat="server" Font-Names="Verdana" Font-Size="Small" ForeColor="#C000C0" BackColor="#FFC080" BorderColor="#C00000" BorderStyle="Solid" BorderWidth="2px" &amp;gt;&amp;lt;/asp:TextBox&amp;gt;
&amp;lt;asp:Button  Runat="server"  Font-Bold="True" ForeColor="White" BackColor="OrangeRed" BorderColor="#C04000" BorderStyle="Solid" BorderWidth="3px" /&amp;gt;
&amp;lt;asp:DropDownList  Runat="server" Font-Names="Bookman Old Style" Font-Size="Small" BackColor="#FFE0C0" Font-Italic="True"&amp;gt;&amp;lt;/asp:DropDownList&amp;gt;
&amp;lt;asp:ListBox  Runat="server" Width="100px" Height="70px" Font-Bold="True" ForeColor="Gold" BackColor="SteelBlue"&amp;gt;&amp;lt;/asp:ListBox&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu kodlara dikkatlice bakacak olursanız, Label, Button, TextBox, DropDownList, ListBox gibi kontrollerin &amp;ccedil;eşitli font, renk &amp;ouml;zellikleri ile tanımlanmış olduklarını g&amp;ouml;receksiniz. İşte bu noktadan sonra, her hangibir tema seviyesinde, Temam temasını uygularsak, sunucu kontrolleri burada belirtilen g&amp;ouml;rsel &amp;ouml;zelliklere sahip olacaktır. Bu dosyanın oluşturulması ile birlikte ilk temamızı hazırlamış oluyoruz. Şimdi bu temanın, bahsetmiş olduğumuz seviyeler i&amp;ccedil;in nasıl uygulanacağını inceleyelim.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikle sayfa seviyesinde bu temayı default.aspx i&amp;ccedil;in nasıl uygulayacağımıza bakalım. Bunun i&amp;ccedil;in, default.aspx sayfasının, page direktifine ait, Theme &amp;ouml;zelliğinden yararlanacağız. Tek yapmamız gereken, theme &amp;ouml;zelliğine, oluşturduğumuz temanın bulunduğu klas&amp;ouml;r&amp;uuml;n ismini atamak olacaktır. (Dolayısıyla temanın ismini.)&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" CompileWith="Default.aspx.cs" ClassName="Default_aspx" Theme="Temam" %&amp;gt;&lt;/pre&gt;
&lt;p&gt;Şimdi default.aspx sayfamızın tarayıcıdaki g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml;ne tekrar bakacak olursak, aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk86_7.gif" alt="" width="261" height="357" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 6. Temamızın sayfaya uygulanmış hali.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, default.aspx &amp;ccedil;alıştığında, page direktifindeki theme &amp;ouml;zelliğinin sahip olduğu değerin belirttiği klas&amp;ouml;r, web uygulamasının Themes klas&amp;ouml;r&amp;uuml; altında aranmış ve bulunduktan sonra, ilgili skin dosyasındaki kontrollere ait font ve renk &amp;ouml;zellikleri y&amp;uuml;klenmiştir. Bu &amp;ouml;rneğimizde temamız, web sayfası seviyesindedir. Yani, uygulamamıza aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne sahip ikinci bir form eklediğimizde, page direktifinin theme &amp;ouml;zelliğine temamızı atamadığımız s&amp;uuml;rece, sunucu kontrollerinin varsayılan g&amp;ouml;r&amp;uuml;n&amp;uuml;mlerine sahip olduğunu farkederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk86_8.gif" alt="" width="279" height="161" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 7. Theme &amp;ouml;zelliği ayarlanmamış sayfanın tasarım hali.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk86_9.gif" alt="" width="276" height="197" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 8. &lt;em&gt; Theme &amp;ouml;zelliği ayarlanmamış sayfanın &amp;ccedil;alışan hali.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu durumda karşımıza ş&amp;ouml;yle bir soru &amp;ccedil;ıkar. Temalarımızı, web uygulamasının i&amp;ccedil;erdiği t&amp;uuml;m sayfalara uygulamak istersek ne olacak? İşte bu sorunun cevabı her zaman olduğu gibi, uygulamanın tamamına ait ayarlamaları yapabileceğimiz web.config dosyası ile ilgilidir. Sorunun &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; i&amp;ccedil;in, web.config dosyasına pages takısını aşağıdaki syntax' ı ile eklememiz gerekir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;system.web&amp;gt;
&amp;lt;pages theme="Temam"&amp;gt;&amp;lt;/pages&amp;gt;
.
.
.
&amp;lt;/system.web&amp;gt;&lt;/pre&gt;
&lt;p&gt;B&amp;ouml;ylece, web uygulamasındaki t&amp;uuml;m sayfaların, Temam isimli temayı uygulamasını sağlamış oluruz. Başka bir deyişle web uygulaması seviyesinde tema uygulatmış oluruz. Bu noktadan sonra default2.aspx sayfamızın &amp;ccedil;alışmasına bakarsak, sunucu kontrollerinin temayı uyguladığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk86_10.gif" alt="" width="302" height="215" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 9. Uygulama seviyesinde tema kullanılmasının sonucu.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Diğer bir seviye olarakta, makine seviyesinin olduğundan bahsetmiştik. Makine seviyesinde yapılan tema uyarlamaları, sistemde geliştirilen t&amp;uuml;m web uygulamalarına, bu uygulamalardaki t&amp;uuml;m web sayfalarına ve bu sayfalardaki t&amp;uuml;m sunucu kontrollerine uygulanmaktadır. Makine seviyesinde tema uyarlamasını ger&amp;ccedil;ekleştirmek i&amp;ccedil;in, windows 2000 işletim sistemleri i&amp;ccedil;in C:\WINNT\Microsoft.NET\Framework\v2.0.40607\CONFIG adresinde yer alan machine.config dosyasında yine pages takısındaki theme &amp;ouml;zelliğini aşağıdaki syntax' ta olduğu gibi ayarlamamız gerekmektedir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;pages theme="Temam"&amp;gt;
.
.
.
&amp;lt;/pages&amp;gt;&lt;/pre&gt;
&lt;p&gt;Ancak burada dikkat etmemiz gereken &amp;ouml;zel bir nokta vardır. Machine.config doysasına ekelenen temanın(temaların) sistemdeki t&amp;uuml;m web uygulamalarına uyarlanabilmesi i&amp;ccedil;in C:\Inetpub\wwwroot\aspnet_client\system_web\2_0_40607 \Themes adresi altında oluşturulması veya var olan temaların buraya kopyalanması gerekmektedir. Temam isimli klas&amp;ouml;r&amp;uuml;m&amp;uuml;z&amp;uuml; i&amp;ccedil;eriği ile birlikte buraya kopyalarsak ve machine.config' de yukarıda bahsettiğimiz ayarlamayı yaparsak, sistemdeki t&amp;uuml;m web uygulamalarının bu temayı uyguladığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk86_11.gif" alt="" width="369" height="123" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 10. Temamızı global kullanıma a&amp;ccedil;tığımız klas&amp;ouml;r.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Temalar ile ilgili &amp;ouml;nemli bir diğer noktada, &amp;uuml;st seviyedeki temaların ge&amp;ccedil;ersiz kılınması işlemidir. Makine seviyesinde tema uyguladığımızı d&amp;uuml;ş&amp;uuml;n&amp;uuml;rsek, herhangibir web uygulamasında bu temayı uygulamak istemiyebiliriz. Bu durumda tek yapmamız gereken, web.config dosyasındaki page takısının theme &amp;ouml;zelliğine ya başka bir temayı atamak yada boş bırakmak olacaktır.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;pages theme=""&amp;gt;&amp;lt;/pages&amp;gt;&lt;/pre&gt;
&lt;p&gt;B&amp;ouml;ylece web uygulaması, makine seviyesinde belirtilen temayı ge&amp;ccedil;ersiz kılacaktır. Eğer sayfa seviyesinde, uygulama seviyesindeki yada makine seviyesindeki bir temayı ge&amp;ccedil;ersiz kılmak istersek, bu kez ilgili sayfanın page direktifindeki theme &amp;ouml;zelliğinde ya başka bir temayı belirtmemiz yada EnableTheming &amp;ouml;zelliğine false değerini vermemiz gerekecektir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" EnableTheming="false"%&amp;gt;&lt;/pre&gt;
&lt;p&gt;EnableTheming &amp;ouml;zelliği, sunucu kontrolleri i&amp;ccedil;inde ge&amp;ccedil;erlidir. Dolayısıyla, bir temayı uygulayan bir web sayfasındaki herhangibir kontrol i&amp;ccedil;in tema &amp;ouml;zelliklerini ge&amp;ccedil;ersiz kılabiliriz. Bunun i&amp;ccedil;in tek yapmamız gerken sunucu kontrol&amp;uuml;n&amp;uuml;n EnableTheming &amp;ouml;zelliğine false değerini atamaktır. &amp;Ouml;rneğin, geliştirdiğimiz web uygulmasındaki Temam temasını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. Eğer button kontrol&amp;uuml;n&amp;uuml;n EnableTheming &amp;ouml;zelliğini false yaparsak sayfamızı &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml;n oluştuğunu ve Button kontrol&amp;uuml;ne tema &amp;ouml;zelliklerinin uygulanmadığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:Button ID="Button1" Runat="server" Text="G&amp;ouml;ster" EnableTheming="false"/&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk86_12.gif" alt="" width="263" height="327" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 11. Bir kontrol i&amp;ccedil;in temanın ge&amp;ccedil;ersiz kılınması.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece Asp.Net 2.0 ile gelen tema tekniğinin nasıl kullanıldığını kısaca incelemiş olduk. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-09-03 12:00:00</pubDate>
  <slug>Asp-Net-2-0-ve-Temalar-(Themes)-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet-20</tag>
    <tag>themes</tag>
  </tags>
  <categories>
    <category>Asp.Net 2.0</category>
  </categories>
</post>