<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ruby Kod Parçacıkları 19 - SQLite ile Basit Veritabanı İşlemleri</title>
  <description>Sanıyorum bir programlama dilini öğrenirken en çok merak edilen konulardan birisi de veritabanı işlemleridir. "Hani bir uygulama yazabilsem de bilgileri veritabanına kayıt edebilsem ve oradan okuyabilsem süper olur" benzeri bir cümleyi eminim hepimiz kurmuşuzdur. Günümüzde geliştirilen uygulamalar mutlak suretle verileri kalıcı olarak saklamaya ihtiyaç duyar.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2016/02/Ultra-Lightweight-Carbon-Fiber-Blackbraid-Bicycle-0.jpg" alt="" width="240" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Sanıyorum bir programlama dilini &amp;ouml;ğrenirken en &amp;ccedil;ok merak edilen konulardan birisi de veritabanı işlemleridir. &lt;em&gt;"Hani bir uygulama yazabilsem de bilgileri veritabanına kayıt edebilsem ve oradan okuyabilsem s&amp;uuml;per olur"&lt;/em&gt; benzeri bir c&amp;uuml;mleyi eminim hepimiz kurmuşuzdur. G&amp;uuml;n&amp;uuml;m&amp;uuml;zde geliştirilen uygulamalar mutlak suretle verileri kalıcı olarak saklamaya ihtiya&amp;ccedil; duyar.&lt;/p&gt;
&lt;p&gt;İster ilişkisel veritabanı ister NoSQL tabanlı bir sistem&amp;nbsp;olsun verinin kalıcı olarak saklanması gerekir.&amp;nbsp;&lt;span style="line-height: 1.8;"&gt;Ruby tarafında da veritabanı işlemleri i&amp;ccedil;in farklı &amp;ccedil;&amp;ouml;z&amp;uuml;mler &lt;/span&gt;&lt;span style="line-height: 1.8;"&gt;kullanılabilir&lt;/span&gt;&lt;span style="line-height: 1.8;"&gt;. NoSQL &amp;ccedil;&amp;ouml;z&amp;uuml;mleri dışında &lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;RDMBS&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; tarafı i&amp;ccedil;in&amp;nbsp;&lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;Lightweight&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; olarak &lt;/span&gt;&lt;span style="line-height: 1.8;"&gt;d&amp;uuml;ş&amp;uuml;nebileceğimiz&amp;nbsp;&lt;/span&gt;&lt;strong style="line-height: 1.8;"&gt;SQLite&lt;/strong&gt;&lt;span style="line-height: 1.8;"&gt; bu veritabanı sistemlerinden birisidir&lt;/span&gt;&lt;span style="line-height: 1.8;"&gt;. &lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;Bu yazımızda &lt;strong&gt;SQLite &lt;/strong&gt;veritabanı ile nasıl &amp;ccedil;alışabileceğimizi &amp;ccedil;ok basit bir kod par&amp;ccedil;ası ile incelemeye&amp;nbsp;&lt;/span&gt;&lt;span style="line-height: 1.8;"&gt;&amp;ccedil;alışacağız. Sistemimizde &lt;strong&gt;Ruby&lt;/strong&gt; kurulu olduğunu d&amp;uuml;ş&amp;uuml;necek olursak tek yapmamız gereken &lt;strong&gt;SQLite&lt;/strong&gt;' a ait &lt;strong&gt;gem&lt;/strong&gt; paketini y&amp;uuml;klemek olacaktır. Bunun i&amp;ccedil;in komut satırından aşağıdaki ifadeyi y&amp;uuml;r&amp;uuml;tebiliriz.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;gem install SQLite3&lt;/strong&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;SQLite d&amp;uuml;nya &amp;uuml;zerinde olduk&amp;ccedil;a fazla dağıtımı olan &lt;strong&gt;C/C++&lt;/strong&gt; ile geliştirilmiş a&amp;ccedil;ık kaynak kodlu &lt;strong&gt;RDBMS-Relational Database Management System&lt;/strong&gt; modelinde bir veritabanıdır. &lt;strong&gt;Linux, Windows, MacOS&lt;/strong&gt; platformlarında kullanılabilir ve &lt;strong&gt;Basic&lt;/strong&gt;'ten &lt;strong&gt;Smaltalk&lt;/strong&gt;'a, &lt;strong&gt;C#&lt;/strong&gt;'dan &lt;strong&gt;Ruby&lt;/strong&gt;' ye pek &amp;ccedil;ok dil tarafından desteklenir. Daha geniş bilgi i&amp;ccedil;in &lt;a title="SQLite" href="http://sqlite.org/" target="_blank"&gt;bu adrese&lt;/a&gt; bakabilirsiniz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Eğer y&amp;uuml;kleme işlemi başarılı olduysa komut satırından &lt;strong&gt;SQLite3&lt;/strong&gt; yazarak veritabanı ortamına ge&amp;ccedil;ebilir ve aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi bazı temel işlemleri yapabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/02/sqlite1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikle komut satırında neler yaptığımıza kısaca bakalım.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;sqlite3&lt;/strong&gt; &lt;strong&gt;AdventureWorks.db&lt;/strong&gt; &lt;em&gt;(Microsoft'un kobay veritabanının adını da yaad etmiş olduk)&lt;/em&gt; satırı ile &lt;strong&gt;AdventureWorks&lt;/strong&gt; isimli bir veritabanı oluşturuluyor. Bu veritabanı komut satırını &amp;ccedil;alıştırdığımız klas&amp;ouml;rde yer alacak. Sonrasında &lt;strong&gt;.databases&lt;/strong&gt; komutu ile oluşturulan veritabanını listeliyoruz&lt;em&gt;(Tabii sistemde farklı veritabanları var ise onları da g&amp;ouml;rmemiz gerekir)&lt;/em&gt; Devam eden ifade ile &lt;strong&gt;Category&lt;/strong&gt; isimli bir tablo yaratıyoruz. Bu tabloda &lt;strong&gt;category_id&lt;/strong&gt; isimli otomatik olarak artan &lt;strong&gt;integer&lt;/strong&gt; tipinden ve&amp;nbsp;&lt;strong&gt;name&lt;/strong&gt; isimli &lt;strong&gt;text&lt;/strong&gt; tipinden birer&amp;nbsp;alan(column) yer alıyor. Her iki alan da null değer almayacak&amp;nbsp;şekilde belirlenmiş durumda. &lt;strong&gt;.tables&lt;/strong&gt; komutu ile oluşturulan tabloların listesini alabiliriz. Şu an i&amp;ccedil;in veritabanımızdaki tek tablo &lt;strong&gt;Category&lt;/strong&gt;. Tablo oluşturulduktan sonra aynen &lt;strong&gt;SQL&lt;/strong&gt;' de olduğu gibi bir ka&amp;ccedil; &lt;strong&gt;Insert&lt;/strong&gt; işlemi ger&amp;ccedil;ekleştiriyoruz. Bu işlmeler ile &lt;strong&gt;Books&lt;/strong&gt;, &lt;strong&gt;Computers&lt;/strong&gt; ve &lt;strong&gt;Toys&lt;/strong&gt; isimli kategorileri veritabanımıza eklemiş bulunuyoruz. &lt;strong&gt;Select&lt;/strong&gt; işlemleri ile de eklenen kategorileri&amp;nbsp;komut satırına basıyoruz. Eğer komut satırı ekranında daha d&amp;uuml;zenli bir g&amp;ouml;r&amp;uuml;n&amp;uuml;m elde etmek istiyorsak&lt;em&gt;(&amp;ouml;rneğin kolon adlarının &amp;ccedil;ıkması veya tab' lı aralıklar bırakılması gibi)&lt;/em&gt; &lt;strong&gt;headers&lt;/strong&gt; ve &lt;strong&gt;mode&lt;/strong&gt; ortam değerlerini değiştirmemiz yeterli.&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;SQL&lt;/strong&gt; tarafında &amp;ccedil;alışmış olanlar i&amp;ccedil;in &lt;strong&gt;SQLite&lt;/strong&gt;' ın kullanımını anlamak ve &amp;ouml;ğrenmek son derece basit. Peki &lt;strong&gt;Ruby&lt;/strong&gt; tarafında nasıl kullanabiliriz? İşte &amp;ouml;rnek bir &lt;strong&gt;Ruby&lt;/strong&gt; kod par&amp;ccedil;acığı.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require 'sqlite3'

begin
	db=SQLite3::Database.open "AdventureWorks.db"
	db.execute "create table if not exists Product(product_id integer primary key autoincrement,title text not null,list_price int not null)"

	db.execute "insert into Product (title,list_price) values ('Polo Lanc 1.2 TSI',65000)"
	db.execute "insert into Product (title,list_price) values ('Golf Sport 2.0 TDI',90000)"
	db.execute "insert into Product (title,list_price) values ('Subaru impreza 4x4',120000)"

	select=db.prepare "Select product_id,title,list_price from Product"
	resultSet=select.execute

	resultSet.each{ |row|
	puts row.join "\s"
	}
rescue SQLite3::Exception =&amp;gt; excp
	puts excp
ensure
	select.close if select
	db.close if db
end&lt;/pre&gt;
&lt;p&gt;Kod dosyamızı&lt;strong&gt; UsingSQLite.rb&lt;/strong&gt; ismiyle kayıt edebiliriz.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikle &amp;uuml;zerinde &amp;ccedil;alışacağımız veritabanını a&amp;ccedil;mak i&amp;ccedil;in &lt;strong&gt;SQLite3::Database.open&lt;/strong&gt; ifadesinden yararlanmaktayız. Bu satır ile veritabanı nesnesini elde ediyoruz. db değişkeni &amp;uuml;zerinden&amp;nbsp;&lt;strong&gt;execute&lt;/strong&gt; metodunu kullanarak bazı &lt;strong&gt;SQL&lt;/strong&gt; ifadeleri y&amp;uuml;r&amp;uuml;t&amp;uuml;yoruz. &lt;strong&gt;Product&lt;/strong&gt; isimli bir tabloyu oluşturmak i&amp;ccedil;in &lt;strong&gt;Create script&lt;/strong&gt;'inden yararlanıyoruz. Buna ek olarak bir ka&amp;ccedil; satır veri ekliyoruz. Bu işlemler i&amp;ccedil;in &lt;strong&gt;execute&lt;/strong&gt; metodunu kullanmamız ve parametre olarak insert ifadesini vermemiz yeterli. &lt;strong&gt;Select&lt;/strong&gt; sorgusunu ise &amp;ouml;ncelikle&amp;nbsp;&lt;strong&gt;prepare&lt;/strong&gt; metodu ile hazırlıyoruz. Elde edilen ifade &amp;uuml;zerindense yine &lt;strong&gt;execute&lt;/strong&gt; fonksiyonunu kullanmaktayız. Tahmin edileceği &amp;uuml;zere &lt;strong&gt;resultSet&lt;/strong&gt; değişkeni &amp;uuml;zerinden&amp;nbsp;&lt;strong&gt;each&lt;/strong&gt; metodu ile ilerleyebilir ve elde edilen t&amp;uuml;m satırları dolaşabiliriz. Bu işlemi yaparken her bir alan arasına birer boşluk bırakarak komut satırına yazdırma işlemini ger&amp;ccedil;ekleştiriyoruz. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Kod par&amp;ccedil;asında bir hata kontrol mekanizmamızda bulunuyor. ensure bloğu i&amp;ccedil;erisinde hata alsak da almasak da &amp;ccedil;alıştıracağımız kod par&amp;ccedil;aları mevcut. &amp;Ccedil;ok doğal olarak burada da veritabanı bağlantısını a&amp;ccedil;ık bırakmamak gerekiyor.&amp;nbsp;Hepsi bu kadar basit. İşte &amp;ccedil;alışma zamanı &amp;ccedil;ıktıları.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/02/sqlite2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Eklediğimiz t&amp;uuml;m &amp;uuml;r&amp;uuml;nler Product tablosuna yazılmıştır. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere Ruby tarafında SQLite kullanımı olduk&amp;ccedil;a basit. Elbette işleri daha da ileri g&amp;ouml;t&amp;uuml;rmelisiniz. S&amp;ouml;z gelimi &lt;strong&gt;Ruby&lt;/strong&gt; tarafında pop&amp;uuml;ler olan &lt;strong&gt;Sinatra&lt;/strong&gt; isimli &lt;strong&gt;Web Framework&lt;/strong&gt;' &amp;uuml; kullanarak &lt;strong&gt;AdventureWorks&lt;/strong&gt;&amp;nbsp;&amp;uuml;zerinde y&amp;uuml;r&amp;uuml;t&amp;uuml;lebilecek temel &lt;strong&gt;CRUD&lt;em&gt;(Create Read Update Delete)&lt;/em&gt;&lt;/strong&gt; operasyonlarını basit bir &lt;strong&gt;REST&lt;/strong&gt; servis &amp;uuml;zerinden sunmayı deneyebilirsiniz. Antrenman yapmaya devam. B&amp;ouml;ylece geldik bir yazımızın daha sonuna.&amp;nbsp;Bir başka kod par&amp;ccedil;asında g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-02-07 15:00:00</pubDate>
  <slug>ruby-kod-parcaciklari-19-sqlite-ile-basit-veritabani-islemleri</slug>
  <tags>
    <tag>ruby</tag>
    <tag>sqlite</tag>
    <tag>gem</tag>
    <tag>sql</tag>
    <tag>rdbms</tag>
    <tag>scripts</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>