<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Şu Docker-Compose Dedikleri</title>
  <description>Aslında birden fazla Container söz konusu olduğunda bunların yönetimi için kullanılan araçlardan birisi Docker-Compose. Senaryoda farklı dillerde yazılmış üç servisi kullanmak istiyorum. Birisi .Net Core ile yazılmış Web Api, diğeri Flask kullanan Python ve sonuncusu da Express bazlı NodeJs uygulaması. Servislerin ne iş yaptığı çok önemli değil. Odaklanmamız gereken nokta Dockerfile içerikleri ile docker-compose.yml üstünde Container kompozisyonunun nasıl tasarlandığı olacak. Buradaki servislere birde veritabanı bağımlılığı eklemeyi denemek gerçek hayat senaryolarını tatbik etmek adına iyi olabilir. Örneğin Nodejs uygulamasının Postgresql kullanacak şekilde dockerize edilmesi ve Postgresql için docker-compose'da bir imajın kullanılacağının ifade edilmesi iyi bir pratik olacaktır. Üstelik bu tip bir kurgu eğer eğitmenseniz de çok işinize yarayacaktır. Biz şimdi işimize geri dönelim.</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/13/docker-compose.png" alt="" align="right" /&gt;&amp;Ouml;nceki &amp;ccedil;alışmalardan &lt;a href="/post/yine-yeni-yeniden-elk-bu-sefer-e-ve-k-icin-docker-compose-isin-icinde" target="_blank"&gt;birisinde&lt;/a&gt; ELK kurgusunda ElasticSearch ve Kibana tarafı i&amp;ccedil;in docker compose'dan yararlanmıştım. Orada iş nispeten daha kolaydı. Var olan docker imajlarını bir kompozisyon &amp;ccedil;er&amp;ccedil;evesinde d&amp;uuml;ş&amp;uuml;nerek ele almıştım. Ama kendi servislerimizden oluşan bir kompozisyon gerekirse nasıl bir yol izlenebilir merak da ediyordum. İşte yılın o vakitleri bunu &amp;ouml;ğrenmeye &amp;ccedil;alışmışım.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Aslında birden fazla Container s&amp;ouml;z konusu olduğunda bunların y&amp;ouml;netimi i&amp;ccedil;in kullanılan ara&amp;ccedil;lardan birisi Docker-Compose. Senaryoda farklı dillerde yazılmış &amp;uuml;&amp;ccedil; servisi kullanmak istiyorum. Birisi&amp;nbsp;.Net&amp;nbsp;Core, diğeri Python ve sonuncusu da NodeJs ile yazılabilir. Python tarafında Flask, NodeJs tarafında da Express&amp;nbsp;paketlerini kullanabiliriz. Servislerin ne iş yaptığı &amp;ccedil;ok &amp;ouml;nemli değil. Odaklanmamız gereken nokta Dockerfile i&amp;ccedil;erikleri ile docker-compose.yml &amp;uuml;st&amp;uuml;nde Container kompozisyonunun nasıl tasarlanacağı.&lt;/p&gt;
&lt;p&gt;Buradaki servislere birde veritabanı bağımlılığı eklemeyi denemek ger&amp;ccedil;ek hayat senaryolarını tatbik etmek adına da iyi olabilir. &amp;Ouml;rneğin Nodejs uygulamasının Postgresql kullanacak şekilde dockerize edilmesi ve Postgresql i&amp;ccedil;in docker-compose'da bir imajın kullanılacağının ifade edilmesi iyi bir pratik olacaktır. &amp;Uuml;stelik bu tip bir kurgu eğer eğitmenseniz de &amp;ccedil;ok işinize yarayacaktır.&amp;nbsp;Lakin ben her zaman ki gibi kolaya ka&amp;ccedil;ıyorum ve sabit i&amp;ccedil;erikler d&amp;ouml;nd&amp;uuml;ren servisler inşa ederek ilerlemeyi planlıyorum. İşe klas&amp;ouml;r ağacı ve kodlar yazarak başlayalım.&lt;/p&gt;
&lt;h2&gt;Hazırlıklar, Kodlama ve Dockerfile...&lt;/h2&gt;
&lt;p&gt;Klas&amp;ouml;r ağacı ve gerekli dosyaları aşağıdaki gibi oluşturabiliriz. Bu arada ben Heimdall&lt;em&gt;(Ubuntu-20.04)&lt;/em&gt; &amp;uuml;zerinde &amp;ccedil;alışmaktayım. Siz farklı bir platformda olabilirsiniz ama ilkeler temel olarak aynı.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;src
---docker-compose.yml
---BookApi
------Dockerfile
---SportApi
------Dockerfile
---WordApi
------Dockerfile&lt;/pre&gt;
&lt;p&gt;Gerekli komutlarımız.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new webapi -o SportApi
touch SportApi/Dockerfile
touch docker-compose.yml

mkdir BookApi
touch BookApi/main.py
touch BookApi/Dockerfile
touch BookApi/requirements.txt

mkdir WordApi
cd WordApi
npm init
touch index.js
touch Dockerfile
npm install --save express cors body-parser
Kompozisyonun Hazırlanması ve &amp;Ccedil;alıştırılması
sudo docker-compose build
sudo docker-composse up&lt;/pre&gt;
&lt;h2&gt;Kod Tarafı&lt;/h2&gt;
&lt;p&gt;İlk olarak Nodejs tarafında yazdığımız WordApi'ye bakalım. index.js i&amp;ccedil;eriğini aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;const express = require('express');
const bodyParser = require('body-parser');
const cors = require('cors');

const config = {
    port: 3000,
    host: '0.0.0.0',
};

const app = express();

app.use(bodyParser.json());
app.use(cors());

app.get('/lucky', (req, res) =&amp;gt; {
    res.status(200).send('Sturdy: (of a person or their body) strongly and solidly built');
});

app.listen(config.port, config.host, (e)=&amp;gt; {
    if(e) {
        throw new Error('Internal Server Error');
    }
    console.log('Word Api is running and listening on 0.0.0.0:3000.')
});&lt;/pre&gt;
&lt;p&gt;Dockerfile i&amp;ccedil;eriği ise aşağıdaki gibi kurgulanabilir.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;FROM node:14-alpine
RUN mkdir -p /usr/src/app
WORKDIR /usr/src/app
COPY . .
RUN npm install
EXPOSE 3000
CMD ["npm", "run", "start"]&lt;/pre&gt;
&lt;p&gt;Flask kullandığımız BookApi'ye ait kodlarımız ve Dockerfile ise aşağıdaki gibi yazılabilir.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;from flask import Flask, jsonify
from flask_restful import Resource, Api 
  
app = Flask(__name__) 

@app.route('/book')
def todaysbook():
    return jsonify(
        {'title': 'Learning Docker Compose'
        ,'description':'A Simple learning book about docker-compose tool'
        ,'publishdate':'2020'
        })&lt;/pre&gt;
&lt;p&gt;ve Dockerfile.&lt;em&gt;(&amp;Ccedil;alışma zamanının ihtiya&amp;ccedil; duyacağı paketlerin Requirements.txt i&amp;ccedil;erisinden bildirildiğine dikkat edelim)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;FROM python:3.7-alpine
WORKDIR /code
ENV FLASK_APP main.py
ENV FLASK_RUN_HOST 0.0.0.0
RUN apk add --no-cache gcc musl-dev linux-headers
COPY requirements.txt requirements.txt
RUN pip install -r requirements.txt
COPY . .
CMD ["flask", "run"]&lt;/pre&gt;
&lt;p&gt;Son olarak .Net Core ile yazdığımız SportsApi tarafına bakalım.&lt;/p&gt;
&lt;p&gt;Event.cs isimli model sınıfımız,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace SportApi
{
    public class Event
    {
        public DateTime Date { get; set; }

        public string Title { get; set; }
        public string Description { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Controller i&amp;ccedil;eriği,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.AspNetCore.Mvc;
using Microsoft.Extensions.Logging;

namespace SportApi.Controllers
{
    [ApiController]
    [Route("[controller]")]
    public class EventController : ControllerBase
    {
        private readonly ILogger&amp;lt;EventController&amp;gt; _logger;

        public EventController(ILogger&amp;lt;EventController&amp;gt; logger)
        {
            _logger = logger;
        }

        [HttpGet]
        public Event GetTodaysEvent()
        {
            return new Event{
                Date=DateTime.Now,
                Title="G&amp;uuml;n&amp;uuml;n sportif başarısı...",
                Description="Bug&amp;uuml;n olan sportif olayın başarısına ait bilgiler"
            };
        }
    }
}&lt;/pre&gt;
&lt;p&gt;ve tabii en &amp;ouml;nemlisi de Dockerfile.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;FROM mcr.microsoft.com/dotnet/core/sdk:3.1 AS build-env
WORKDIR /app

COPY *.csproj ./
RUN dotnet restore

COPY /. ./
RUN dotnet publish -c Release -o out

FROM mcr.microsoft.com/dotnet/core/aspnet:3.1
WORKDIR /app
COPY --from=build-env /app/out .
ENTRYPOINT ["dotnet", "SportApi.dll"]&lt;/pre&gt;
&lt;p&gt;Her &amp;uuml;&amp;ccedil; uygulama kendine has &amp;ccedil;alışma zamanlarına sahip. Bu nedenle Dockerfile i&amp;ccedil;erikleri birbirlerinden farklı. &amp;Ouml;rneğin herbiri kendisi i&amp;ccedil;in gerekli olan docker imajlarını baz almakta.&lt;/p&gt;
&lt;h2&gt;Docker-Compose&lt;/h2&gt;
&lt;p&gt;&amp;Ccedil;alışmanın en kritik noktası tahmin edeceğiniz &amp;uuml;zere Docker-compose.yml i&amp;ccedil;eriği. Bu dosyayı aşağıdaki şekilde kurgulayabiliriz.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;version: "3"
services:
    sportapi:
        container_name: sport_container
        build: ./SportApi
        ports:
            - "5555:80"
    bookapi:
        container_name: book_container
        build: ./BookApi
        ports:
            - "5000:5000"
    wordapi:
        container_name: word_container
        build: ./WordApi
        ports:
            - "4000:3000"&lt;/pre&gt;
&lt;p&gt;Services kısmında &amp;uuml;&amp;ccedil; container tanımı yer alıyor. Herbirisi i&amp;ccedil;in container_name ile bir isim belirtilmekte. build bildirimi ile dockerfile'ların yolunu da belirtmiş oluyoruz. Container'lar ayağa kalktığında dışarıya a&amp;ccedil;ılacak olan port bilgisi ile bu portun nereye y&amp;ouml;nlendirileceği de ports kısmında tanımlanmakta. &amp;Ouml;rneğin 5555 portuna gelecek SportApi talepleri i&amp;ccedil;erideki 80 portuna y&amp;ouml;nlenecekler ki, Asp.Net Web API servisi Dockerfile bilgilerine g&amp;ouml;re bu porttan hizmet sunuyor. Artık tek yapmamız gereken aşağıdaki terminal komutunu kullanarak servislerin ayağa kalkmasını sağlamak ve onları deneme ama&amp;ccedil;lı olarak t&amp;uuml;ketmek.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo docker-compose up&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/13/Screenshot_1.png" alt="" /&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;curl http://localhost:5555/Event
curl http://localhost:4000/lucky
curl http://localhost:5000/book&amp;nbsp;&lt;/pre&gt;
&lt;p&gt;Ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nden de g&amp;ouml;r&amp;uuml;leceği &amp;uuml;zere up komutu ile servisler ayağa kalktıktan sonra curl aracı ile birka&amp;ccedil; talep g&amp;ouml;nderiyoruz. Sizin de benzer şekilde servis &amp;ccedil;ağrılarınızdan cevaplar alabilmeniz gerekiyor. Antrenman bitince kompozisyona dahil olan container'ları kaldırmak i&amp;ccedil;in &lt;em&gt;&lt;strong&gt;sudo docker-compose down&lt;/strong&gt;&lt;/em&gt; komutunu kullanabiliriz. Size tavsiyem &amp;ouml;rnekteki servisleri başta da belirttiğim &amp;uuml;zere kendi veritabanı sistemleri ile &amp;ccedil;alışır hale getirmeye &amp;ccedil;alışmanız. Hatta bu veritabanlarını da docker-compose i&amp;ccedil;erisinde planlayabilirsiniz diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. &amp;Ouml;rnek kodlara &lt;a href="https://github.com/buraksenyurt/skynet/tree/master/No%2013%20-%20What%20is%20Docker%20Compose" target="_blank"&gt;skynet github reposu&lt;/a&gt;ndan ulaşabilirsiniz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2020-02-28 20:23:00</pubDate>
  <slug>su-docker-compose-dedikleri</slug>
  <tags>
    <tag>docker</tag>
    <tag>docker-compose</tag>
    <tag>nodejs</tag>
    <tag>python</tag>
    <tag>flask</tag>
    <tag>net-core</tag>
    <tag>express</tag>
    <tag>dockerfile</tag>
    <tag>c#</tag>
    <tag>javascript</tag>
    <tag>yaml</tag>
    <tag>yml</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
  </categories>
</post>