<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Angular ile Basit Bir Tahmin Oyunu Yazmak</title>
  <description>Angular tarafını yavaş yavaş tanımaya başlıyorum. Ancak bilgilerimi pekiştirmek için farklı öğretileri uygulamaya devam etmem gerekiyor. Bu kez temelleri basit şekilde anlamak adına bir şehir tahmin oyunu yazmaya karar verdim. Uygulama havanın rastsal durumuna göre kullanıcısına bir soru soracak ve hangi şehirde olduğunu bulmasını isteyecek. Kabaca şu aşağıdaki cümleye benzer bir düşünce ile yola çıktım.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2019/04/30/com64k.jpg" alt="" /&gt;Commodore 64 sahibi olduğum g&amp;uuml;nlerde beni &amp;ccedil;ok etkileyen bir Futbol oyunu vardı. &amp;Uuml;stelik yerli malıydı. G&amp;ouml;rsel bir arabirimi yoktu. Komut satırından size sorulan sorulara verdiğiniz cevaplara g&amp;ouml;re T&amp;uuml;rkiye birinci futbol liginde ma&amp;ccedil;lar yapıyordunuz. A&amp;ccedil;ılışta takımınızı ve rakibinizi se&amp;ccedil;tikten sonra yazı tura sorusu ile başlıyordu her şey. Kazandıysanız da "top mu, kale mi" sorusuyla devam ediyordu. Ma&amp;ccedil;ın s&amp;uuml;resi ilerledik&amp;ccedil;e komut satırından sorular gelmeye devam ediyordu. "Rakip ceza sahasının gerisinde şut &amp;ccedil;ekti. Kaleciniz ne yapacak?" Ve se&amp;ccedil;enekler geliyordu. "Plonjon, out'a &amp;ccedil;elme vs" Yapılan se&amp;ccedil;ime g&amp;ouml;re gol yiyebilir, topu &amp;ccedil;elebilir veya tutabilirdiniz. İsmini bir t&amp;uuml;rl&amp;uuml; hatırlayamadığım ama komut satırından olsa bile beni saatlerce monit&amp;ouml;r başına kitleyen bir oyundu. Zaten o devrin Commodore 64 oyunlarındaki yaratıcılık, programlama kabiliyetleri bir başkaydı. Bu d&amp;uuml;ş&amp;uuml;nceler ışığında g&amp;uuml;nlerden bir g&amp;uuml;n Angular tarafı ile ilgili &lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;saturday-night-works &amp;ccedil;alışmalarımı&lt;/a&gt; yapmaktayken bende basit ama bana keyif verecek bir oyun yazayım istedim.&lt;/p&gt;
&lt;p&gt;Esasında Angular tarafında &amp;ccedil;ok deneyimli değildim. Eksiğim &amp;ccedil;oktu. Onu daha iyi tanımak i&amp;ccedil;in bol bol &amp;ouml;rnek yapmam gerekiyordu. Bilgilerimi pekiştirmek i&amp;ccedil;in farklı &amp;ouml;ğretileri uygulamaya devam ediyordum. Bu kez temelleri basit şekilde anlamak adına bir şehir tahmin oyunu yazmaya karar verdim. Uygulama havanın rastsal durumuna g&amp;ouml;re kullanıcısına bir soru soracak ve hangi şehirde olduğunun bulmasını isteyecek. Kabaca şu aşağıdaki c&amp;uuml;mleye benzer bir d&amp;uuml;ş&amp;uuml;nce ile yola &amp;ccedil;ıktığımı s&amp;ouml;yleyebilirim.&lt;/p&gt;
&lt;p&gt;"Merhaba Burak. Bug&amp;uuml;n hava olduk&amp;ccedil;a 'g&amp;uuml;neşli' ve ben kendimi bir yere ışınladım. Neresi olduğunu tahmin edebilir misin?"&lt;/p&gt;
&lt;p&gt;'g&amp;uuml;neşli' yazan kısım rastgele gelecek bir kelime. Yağmurlu olabilir, sisli olabilir vb...Buna g&amp;ouml;re uygun şehirlerden rastgele birisine gidecek bilgisayar. Biz de bunu tahmin etmeye &amp;ccedil;alışacağız. Tabii tahmini kolaylaştırmak i&amp;ccedil;in minik bir ipucu vereceğiz. Baş harfini s&amp;ouml;yleyeceğiz&lt;em&gt;(ki siz bunu daha da zenginleştirebilirsiniz. Tahmin sayısını tutup belli bir oranda hak tanıyabilir, tahmin edemedik&amp;ccedil;ce daha fazla harf &amp;ccedil;ıkarttırabilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;yleyse vakit kaybetmeden işe koyulalım değil mi? Ben &amp;ouml;rneği artık sonbaharını yaşamakta olan WestWorld&amp;nbsp;&lt;em&gt;(Ubuntu 18.04, 64bit)&lt;/em&gt; &amp;uuml;zerinde geliştirdim.&lt;/p&gt;
&lt;h2&gt;&amp;Ouml;n Gereksinimler ve Kurulumlar&lt;/h2&gt;
&lt;p&gt;Sisteminizde angular CLI y&amp;uuml;kl&amp;uuml; olursa iyi olur. Komut satırından angular projesi başlatmak i&amp;ccedil;in işimizi olduk&amp;ccedil;a kolaylaştıracaktır. Sonrasında boilerplate etkisi ile uygulamayı oluşturabiliriz. Aray&amp;uuml;z&amp;uuml;n şık g&amp;ouml;r&amp;uuml;nmesini sağlamak i&amp;ccedil;in &lt;em&gt;(ben ne kadar şıklaştırabilirsem artık :D )&lt;/em&gt; bootstrap'i tercih edebiliriz. Aşağıdaki terminal komutları gerekli y&amp;uuml;kleme işlemlerini yapacaktır. İlk komutla angular CLI aracını y&amp;uuml;klerken, ikinci komutla yeni bir angular projesi oluşturuyoruz. Son terminal komutuyla da bootstrap'i projemize dahil ediyoruz. Hepsi Node Package Manager yardımıyla ger&amp;ccedil;ekleştirilmekte.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo npm install -g @angular/cli
ng new where-am-i --inlineTemplate
cd where-am-i
npm install bootstrap --save&lt;/pre&gt;
&lt;h2&gt;Yapılan Değişiklikler&lt;/h2&gt;
&lt;p&gt;Uygulama kodlarında değişiklik yaptığım &amp;ccedil;ok az yer var. Malum boilerplate etkisi ile zaten hazır bir proje şablonu &amp;uuml;retilmiş durumda. Biz temel olarak bir bileşen oluşturup bunu ana sayfada kullanıyoruz.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bootstrap'i kullanabilmek i&amp;ccedil;in proje klas&amp;ouml;r&amp;uuml;ndeki angular.json dosyasındaki styles elementine ilave bir bildirim yaptık. Buna ek olarak src/app klas&amp;ouml;r&amp;uuml;ndeki app.component.html dosyasını aşağıdaki gibi değiştirdik &lt;em&gt;(Size yardımcı olacak bilgiler kodların yorum satırlarında yer alıyor. Direkt copy-paste yapmadan &amp;ouml;nce okuyun)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;!--
  bootstrap css stilleri ile donattığımız basit bir aray&amp;uuml;z&amp;uuml;m&amp;uuml;z var.

  app.component sınıfındaki property'lere erişmek i&amp;ccedil;in {{propertyName}} notasyonu kullanılıyor.
  Yine bileşen &amp;uuml;zerinde bir metod &amp;ccedil;ağrısı yapmak ve bunu bir kontrol olayı ile ilişkilendirmek i&amp;ccedil;in 
  (eventName)="method name" şeklinde bir notasyon kullanılıyor.
  
  Angular direktiflerinde *ngIf komutunu kullanarak tahmine g&amp;ouml;re bir HTML elementinin g&amp;ouml;sterilmesi sağlanıyor.
--&amp;gt;
&amp;lt;div class="container"&amp;gt;
  &amp;lt;h2&amp;gt;Bil bakalım hangi şehre gittim? :)&amp;lt;/h2&amp;gt;

  &amp;lt;div class="card bg-light mb-3"&amp;gt;
    &amp;lt;div class="card-body"&amp;gt;
      &amp;lt;p class="card-text"&amp;gt;Bug&amp;uuml;n hava &amp;lt;b&amp;gt;{{currentWeather}}&amp;lt;/b&amp;gt; ve ben ... şehrine gittim.&amp;lt;/p&amp;gt;
    &amp;lt;/div&amp;gt;
  &amp;lt;/div&amp;gt;
  &amp;lt;div&amp;gt;
    &amp;lt;p&amp;gt;
      &amp;lt;button class="btn btn-primary btn-sm" (click)="fullThrottle()"&amp;gt;Hey Scotty. Beni yeniden
        ışınla&amp;lt;/button&amp;gt;
    &amp;lt;/p&amp;gt;
  &amp;lt;/div&amp;gt;
  &amp;lt;div&amp;gt;
    &amp;lt;label&amp;gt;Tahminin nedir?&amp;lt;/label&amp;gt;
    &amp;lt;input (input)="playersGuess=$event.target.value" type="text" /&amp;gt;
    &amp;lt;button class="btn btn-primary btn-sm" (click)="checkMyGuess()"&amp;gt;Dene&amp;lt;/button&amp;gt;
  &amp;lt;/div&amp;gt;
  &amp;lt;div&amp;gt;
    &amp;lt;p *ngIf="guessIsCorrect" class="alert alert-success"&amp;gt;Bravo! Yakaladın beni&amp;lt;/p&amp;gt;
    &amp;lt;p *ngIf="!guessIsCorrect" class="alert alert-warning"&amp;gt;T&amp;uuml;h. Tekrar dener misin?&amp;lt;/p&amp;gt;
    &amp;lt;p class="text-info"&amp;gt;İşte sana bir ipucu. {{hint}}&amp;lt;/p&amp;gt;
  &amp;lt;/div&amp;gt;
&amp;lt;/div&amp;gt;&lt;/pre&gt;
&lt;p&gt;Son olarak src/app klas&amp;ouml;r&amp;uuml;ndeki app.component.ts typescript dosyasındaki bileşen sınıfının değiştirildiğini ifade edebilirim.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;import { Component } from '@angular/core';

@Component({
  selector: 'app-root',
  templateUrl: './app.component.html',
  styleUrls: ['./app.component.css']
})

export class AppComponent {
  title = 'Şimdi Hangi Şehirdeyim?';
  currentWeather: string; // G&amp;uuml;ncel hava durumu bilgisini tutan property
  computersLocation: string; //Bilgisayarın yerini tutacak property
  playersGuess: string; // Oyuncunun tahminini tutacak property
  guessIsCorrect: boolean; // Tahminin doğru olup olmadığını tuttuğumuz property
  hint:string; // Tahmini kolaylaştırmak i&amp;ccedil;in verdiğimiz ipucunu tutan property

  // &amp;Ouml;rnek veri dizileri. 
  // TODO: Daha uygun bir key-value dizisi bulunabilir mi?

  airConditions = ['g&amp;uuml;neşli', 'yağmurlu', 'karlı', 'sisli'];
  cities = [
    ['Barcelona', 'Madrid', 'Lima', 'Rio', 'Miami', 'Sydney', 'Antalya'],
    ['Prag', 'Paris', 'Tokyo', 'Dublin', 'Londra', 'Pekin'],
    ['Moskova', 'Montreal', 'Boston', 'Ağrı'],
    ['London', 'Glasgow', 'Mexico City', 'Frankfurt', 'İstanbul']
  ];

  /*
  Uygulama button bağımsız ilk başlatıldığında da hava tahmini yapılsın ve şehir tutulsun.
  */
  constructor() {
    this.hint = "";
    this.computersLocation="";
    this.currentWeather="";
    this.fullThrottle();
  }
  /*
  Bilgisayar i&amp;ccedil;in rastgele hava durumu &amp;uuml;reten fonksiyon
  Random fonksiyonundan yararlanıp uygun aralıklarda rastgele sayı &amp;uuml;retir
  ve buna g&amp;ouml;re rastgele bir şehir tutar.
  */
  fullThrottle() {
    // hava durumlarını tutan dizinin boyutuna g&amp;ouml;re rastgele sayı &amp;uuml;rettik
    var rnd1 = Math.floor((Math.random() * this.airConditions.length));
    // rastgele bir hava durumu bilgisi aldık
    this.currentWeather = this.airConditions[rnd1];

    // şehirlerin tutulduğu dizide, hava durumu bilgisine uyan (&amp;ouml;rnekte indeks sırası) dizinin uzunluğunu aldık
    var arrayLength = this.cities[rnd1].length;
    // uzunluğuna g&amp;ouml;re rastgele bir sayı &amp;uuml;rettik
    var rnd2 = Math.floor((Math.random() * arrayLength));
    // &amp;uuml;retilen rastgele sayıya g&amp;ouml;re diziden bir şehir adı aldık
    this.computersLocation = this.cities[rnd1][rnd2];

    this.hint="Baş harfi "+this.computersLocation[0];

    console.log(this.computersLocation); // Şşşşttt. Kimseye s&amp;ouml;ylemeyin. F12'ye basınca ışınlanan şehri g&amp;ouml;rebilirsiniz.
  }

  /*
  Oyuncunun tahminini kontrol eden fonksiyon
  */
  checkMyGuess() {

    if (this.playersGuess == this.computersLocation)
      this.guessIsCorrect = true;
    else
      this.guessIsCorrect = false;
  }
}&lt;/pre&gt;
&lt;h2&gt;&amp;Ccedil;alışma Zamanı&lt;/h2&gt;
&lt;p&gt;Uygulamayı &amp;ccedil;alıştırmak i&amp;ccedil;in terminalden aşağıdaki komutu vermek yeterlidir.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;ng serve&lt;/pre&gt;
&lt;p&gt;&amp;Ccedil;alışma zamanına ait &amp;ouml;rnek ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;lerimiz ise aşağıdakine benzer olacaktır. Mesela bir tahmin yaptık ve sonucu bulamadıysak şuna benzer bir sonu&amp;ccedil;la karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/04/30/credit_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ama sonucu bilirsek de ş&amp;ouml;yle bir ekranla karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/04/30/credit_2.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Ben Neler &amp;Ouml;ğrendim&lt;/h2&gt;
&lt;p&gt;Pek tabii bu antrenmanla da bir &amp;ccedil;ok şey &amp;ouml;ğrendim. Aklımda kaldığı kadarıyla onları ş&amp;ouml;yle &amp;ouml;zetleyebilirim.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Component bileşeni ile HTML aray&amp;uuml;z&amp;uuml;n&amp;uuml;, sınıf &amp;ouml;zellikleri &amp;uuml;zerinden nasıl konuşturabileceğimi&lt;/li&gt;
&lt;li&gt;Bootstrap temel elementlerini Angular bileşenlerinde nasıl kullanabileceğimi&lt;/li&gt;
&lt;li&gt;ng serve komutu ile uygulamayı &amp;ccedil;alıştırdıktan sonra, bileşen ve aray&amp;uuml;zde yapılan değişikliklerin, save sonrası uygulamayı tekrardan &amp;ccedil;alıştırmaya gerek kalmadan &amp;ccedil;alışma zamanına yansıtıldığını&lt;/li&gt;
&lt;li&gt;Component aray&amp;uuml;z&amp;uuml;nden, Typescript tarafındaki metodların bir olaya bağlı olarak nasıl tetiklenebileceklerini&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir maceramızın daha sonuna. &lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;Saturday-Night-Works'&amp;uuml;n 30 numaralı projesi&lt;/a&gt;ne ait blog notlarımı da tamamlamış oldum. Ben bu maceralar sırasında g&amp;uuml;zel şeyler araştırıyor ve &amp;ouml;ğreniyorum. Size de b&amp;ouml;yle bir macerayı tavsiye ederim. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2019-05-01 17:00:00</pubDate>
  <slug>Angular-ile-Basit-Bir-Tahmin-Oyunu-Yazmak</slug>
  <tags>
    <tag>angular</tag>
    <tag>typescript</tag>
    <tag>html</tag>
    <tag>javascript</tag>
    <tag>c#</tag>
    <tag>component</tag>
    <tag>vs-code</tag>
    <tag>ubuntu</tag>
    <tag>bootstrap</tag>
    <tag>angular-cli</tag>
    <tag>npm</tag>
    <tag>node-package-manager</tag>
  </tags>
  <categories>
    <category>Angular</category>
  </categories>
</post>