<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Blazor ile Hello World Uygulaması Geliştirmek</title>
  <description>Amacım Microsoft'un deneysel olarak geliştirdiği Blazor çatısı (Web Framework) ile C#/Razor (Razor HTML markup ve C#'ın bir arada kullanılabildiği syntax olara düşünülebilir. Bu sayede C# ve HTML kodlamasını aynı dosyada intellisense desteği ile ele alabiliriz) ,HTML ve WebAssembly tabanlı web uygulamalarının nasıl geliştirilebileceğini Hello World diyerek deneyimlemek.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2019/05/19/gulelim.png" alt="" /&gt;Oturduğunuz yerden g&amp;ouml;r&amp;uuml;nd&amp;uuml;ğ&amp;uuml; gibi &amp;ccedil;ok karikat&amp;uuml;r okuyan biri değilimdir. Ama bazen kendimi sevgili Yiğit &amp;Ouml;zg&amp;uuml;r'&amp;uuml;n kaleminden &amp;ccedil;ıkan&amp;nbsp;bir Huni Kafa karakteri gibi hissettiğim olur. Bir sebepten ne olduğunu&amp;nbsp;tam olarak&amp;nbsp;anlayamadığım konular &amp;uuml;zerinde debelenir dururum. O kaynaktan bu kaynağa ge&amp;ccedil;erken de kaybolurum. Lakin her zaman elle tutulur bir şeylere ulaşma şansı da bulurum.&lt;/p&gt;
&lt;p&gt;Blazor'da bu standart anlayamama s&amp;uuml;recime takılan konulardan birisiydi. Ona olan merakım&amp;nbsp;&amp;ccedil;evremde konuşulanlarla başlamıştı. &amp;Ccedil;ok yakın dostum &lt;a href="http://www.borakasmer.com/" target="_blank"&gt;Bora Kaşmer&lt;/a&gt;'in konu ile ilgili yazıları ve şirketteki deneyimli yazılımcıların tariflemelerine rağmen zihnimde onu tanımlayacak iyi bir c&amp;uuml;mleyi bir t&amp;uuml;rl&amp;uuml; kuramıyordum. Neden kullanacaktım ki onu? Hangi problemi &amp;ccedil;&amp;ouml;z&amp;uuml;yordu? Ne gibi kolaylıklar getiriyordu? Bunları tam olarak niteleyemediğimi g&amp;ouml;r&amp;uuml;nce 19ncu b&amp;ouml;l&amp;uuml;m ortaya &amp;ccedil;ıktı. &amp;Ouml;yleyse notlarımı derlemeye başlayalım.&lt;/p&gt;
&lt;p&gt;&lt;a href="https://github.com/buraksenyurt/saturday-night-works/tree/master/No%2019%20-%20Hello%20Blazor" target="_blank"&gt;Saturday-Night-Works'&amp;uuml;n 19ncu b&amp;ouml;l&amp;uuml;m&amp;uuml;&lt;/a&gt;ndeki amacım Microsoft'un deneysel olarak geliştirdiği &lt;a href="https://dotnet.microsoft.com/apps/aspnet/web-apps/client" target="_blank"&gt;Blazor&lt;/a&gt; &amp;ccedil;atısı&lt;em&gt;(Web Framework)&lt;/em&gt; ile C#/Razor&lt;em&gt;(Razor HTML markup ve C#'ın bir arada kullanılabildiği syntax olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Bu sayede C# ve HTML kodlamasını aynı dosyada intellisense desteği ile ele alabiliriz),&amp;nbsp;&lt;/em&gt;HTML ve WebAssembly tabanlı uygulamaların nasıl geliştirilebileceğini Hello World diyerek deneyimlemekti.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Aslında uzun s&amp;uuml;redir hayatımızda olan ve Windows, macOS, Linux gibi platformlarda C# tabanlı Client Web uyulamalarının geliştirilmesine odaklanan Blazor, bu idealini ger&amp;ccedil;ekleştirirken WebAssembly desteğinden yararlanıyor. &lt;a href="https://webassembly.org/" target="_blank"&gt;WebAssembly&lt;/a&gt;, y&amp;uuml;ksek performanslı web uygulamalarının geliştirilmesinde kullanılan &amp;ouml;nc&amp;uuml; akımlardan. Felsefe olarak C, C++, Rust gibi d&amp;uuml;ş&amp;uuml;k seviyeli dillerle yazılmış kodların derlenerek browser&lt;em&gt;(t&amp;uuml;m tarayıcılar destekliyor)&lt;/em&gt; &amp;uuml;zerinde &amp;ccedil;alıştırılabilmesi ilkesini benimsiyor. İşte bu noktada yorumlamalı dillerden olan ve web tarafında &amp;ccedil;ok kullanılan Javascript'in &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;iyor. Bunun en b&amp;uuml;y&amp;uuml;k sebebi derlemenin getirdiği performans ve hız kazanımı. Blazor işte bu avantajı C# tarafında kullanabilmemize olanak sağlayan bir &amp;ccedil;atı. Konu kafamda hala muallakta olmakla birlikte en azından .Net Core cephesinde bir Blazor uygulaması nasıl geliştirilir bilmem gerekiyor. İlk hedef basit bir uygulamayı inşa edip ayağa kaldırmak ve temel bileşenleri anlamaya &amp;ccedil;alışmak.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Blazor, .Net ile geliştirilmiş Single Page Application'ların WebAssembly desteği yardımıyla tarayıcı &amp;uuml;zerinde &amp;ccedil;alışmalarına olanak sağlayan bir Web Framework olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Blazor cephesinde&amp;nbsp;Client Side ve Server Side Hosting modelleri s&amp;ouml;z konusu. Client-Side modelinde C#/Razor ile geliştirilip derlenen .Net Assembly'ları, .Net Runtime ile birlikte tarayıcıya indiriliyor. Sunucu bazlı modele bakıldığındaysa, Razor&amp;nbsp;bileşenlerinin&amp;nbsp;sunucu tarafında konuşlandığını UI, Javascript ve olay&lt;em&gt;(event)&lt;/em&gt; &amp;ccedil;ağrıları i&amp;ccedil;inse SignalR odaklı iletişimin devreye girdiğini g&amp;ouml;r&amp;uuml;yoruz. Esasında uygulamalar Component bazlı geliştirilmekte. Bir component bir C# sınıfıdır ve Blazor a&amp;ccedil;ısından bakıldığında genellikle bir cshtml dosyasıdır&lt;em&gt;(Elbette bir C# dosyası da olabilir)&lt;/em&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;WebAssembly koduna derlenen uygulamalar herhangi bir tarayıcıda y&amp;uuml;ksek performansla &amp;ccedil;alışabilirler.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2&gt;Nelere İhtiyacımız Var?&lt;/h2&gt;
&lt;p&gt;Pek &amp;ccedil;ok kaynak konuyu Visual Studio &amp;uuml;zerinde incelemekte.&amp;nbsp;Bu profesyonel IDE &amp;uuml;zerinde bir Web projesi a&amp;ccedil;arken şablon kısmından Blazor'u se&amp;ccedil;mek yeterli. Ancak ben yabancı topraklardayım ve WestWorld'de Linux ile en yakın arkadaşı Visual Studio Code yaşamakta. Bu nedenle işe aşağıdaki terminal komutları ile başlamak gerekiyor.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new --install "Microsoft.AspNetCore.Blazor.Templates"
dotnet new blazor -o HelloWorld&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncelikle blazor i&amp;ccedil;in gerekli proje şablonunu indiriyoruz. Ardından blazor tipinden hazır bir proje iskeletini oluşturuyoruz. Hemen ilgili klas&amp;ouml;re girip dotnet run komutu ile programı &amp;ccedil;alıştırıp deneyebiliriz. Uyguluma, localhost:5000 numaralı porttan hizmet verecektir.&lt;/p&gt;
&lt;p&gt;Oluşturulan ilk &amp;ouml;rneği didiklemekte fayda var.&amp;nbsp;Index, Counter ve FetchData&lt;em&gt;(Dependency Injection kullanılan &amp;ouml;rnek)&lt;/em&gt; y&amp;ouml;nlendirmeleri sonrası &amp;ccedil;alışan aynı isimli cshtml i&amp;ccedil;eriklerine odaklanmak gerekiyor. S&amp;ouml;z gelimi Counter sayfasında d&amp;uuml;ğmeye bastık&amp;ccedil;a saya&amp;ccedil; değeri artmakta. Ancak bu ger&amp;ccedil;ekleşirken sayfa yeniden y&amp;uuml;klenmiyor ki bunun i&amp;ccedil;in normalde Client-Side Javascript kodunun yazılması gerekir. Olaya Blazor a&amp;ccedil;ısından baktığımızda, kodlamanın Javascript değil de C# ile yapıldığını fark etmemiz lazım. İlgili sayfada oynayarak farklı sonu&amp;ccedil;lar elde etmeye &amp;ccedil;alışabiliriz. Ben Counter sayfasını biraz kurcalayıp kod tarafını aşağıdaki gibi ele almaya &amp;ccedil;alışmıştım&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;@page "/counter"

&amp;lt;h1&amp;gt;Rastgele Toplamlar&amp;lt;/h1&amp;gt;
&amp;lt;p&amp;gt;Blazor'a ge&amp;ccedil;işten &amp;ouml;nce bu tarafı anlamaya &amp;ccedil;alışıyorum...&amp;lt;/p&amp;gt;
&amp;lt;p&amp;gt;G&amp;uuml;ncel rastgele toplam: @currentCount&amp;lt;/p&amp;gt;
&amp;lt;p&amp;gt;Arttırım miktarı: @incraseValue &amp;lt;/p&amp;gt;

&amp;lt;button class="btn btn-primary" onclick="@IncrementValue"&amp;gt;Arttırmak i&amp;ccedil;in bas!&amp;lt;/button&amp;gt;

@functions {
    // Değişken değerlerini HTML tarafında @ operat&amp;ouml;r&amp;uuml; ile kolayca kullanabiliriz
    int currentCount = 0;
    int incraseValue=0;
    Random random=new Random();

    void IncrementValue() // button'un onclick metodunda @ operat&amp;ouml;r&amp;uuml; ile erişiyoruz
    {        
        incraseValue=random.Next(1,100); //1 ile 100 arasında rastgele değer &amp;uuml;rettirdik
        currentCount+=incraseValue; 
    }
}&lt;/pre&gt;
&lt;p&gt;ki &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdakine benzerdi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/19/cover_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aray&amp;uuml;z mutlaka dikkatinizi &amp;ccedil;ekmiştir. Hoş bir tasarımı var. En azından benim i&amp;ccedil;in &amp;ouml;yle. Blazor proje şablonuna g&amp;ouml;re CSS tarafı i&amp;ccedil;in bootstrap hazır olarak geliyor. Sol taraftaki navigation menu'y&amp;uuml; kurcalamak istersek, Shared klas&amp;ouml;r&amp;uuml;ndeki NavMenu.cshtml ile oynamak yeterli ki &amp;ouml;rneğin son kısmında burayı değiştirmiş olacağız. Her şeyin giriş noktası olan index.html sayfasında&amp;nbsp;blazor.webassembly.js isimli javascript dosyası i&amp;ccedil;in bir referans bulunuyor.&lt;/p&gt;
&lt;h2&gt;Dependency Injection Kullanımı&lt;/h2&gt;
&lt;p&gt;Blazor dahili bir&amp;nbsp;DI mekanizmasını destekliyor ve built-in olanlar haricinde kendi servislerimizin de i&amp;ccedil;eriye bu mekanizma yardımıyla alınmasına olanak sağlıyor&lt;em&gt;(hatta buna zorluyor)&lt;/em&gt; S&amp;ouml;z gelimi HttpClient gibi bir built-in servisi client-side Razor tarafına enjekte edip kullanabiliriz. IJSRuntime, IUriHelper gibi bir &amp;ccedil;ok yararlı built-in servis bulunmakta. Kendi servislerimizi de&lt;em&gt;(s&amp;ouml;z gelimi bir data repository i&amp;ccedil;in kullanılabilecek tipleri)&lt;/em&gt; DI ile sisteme dahil etmemiz m&amp;uuml;mk&amp;uuml;n. Aynen .Net Core'da olduğu gibi ConfigureServices metoduna gelen IServicesCollection aray&amp;uuml;z&amp;uuml;nden yararlanarak bunu sağlayabiliriz &lt;em&gt;(WorldPopulation sayfasında built-in servis kullanımına dair bir &amp;ouml;rnek bulunuyor)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;services.AddSingleton&amp;lt;IMessenger, SMSMessenger&amp;gt;();&lt;/pre&gt;
&lt;h2&gt;Kod Tarafının Geliştirilmesi&lt;/h2&gt;
&lt;p&gt;Şimdi Blazor tarafındaki kodlamayı anlayabilmek i&amp;ccedil;in iki basit bileşen tasarımı yapalım.&amp;nbsp;Bunlardan ilkinde kobay olarak kitaplarımızı konu alacağız. Bir listeye kitap eklenmesi ve bu listenin g&amp;ouml;sterilmesi işlerini yapmaya &amp;ccedil;alışacağız. Bir kitabı kod tarafında temsil emtek i&amp;ccedil;in book isimli aşağıdaki sınıftan yararlanabiliriz. I know, I know... Bir kitabı birden fazla yazar yazmış olabilir ve bir yazarın birden fazla kitabı da olabilir. Hani nerede nesneler arası many-to-many ilişki? Motivasyonum Blazor tarafında Hello World demek olduğu i&amp;ccedil;in bu kısmı tamamen &amp;ouml;rtpas etmiş durumdayım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Book
{
    public string Title { get; set; }
    public string Summary { get; set; }
    public int PageCount { get; set; }
    public string Authors { get; set; }
}&lt;/pre&gt;
&lt;p&gt;Kitaplar ile ilgili işlemler i&amp;ccedil;in Pages klas&amp;ouml;r&amp;uuml;ne Book.cshtml isimli bir dosya ekleyip aşağıdaki şekilde kodlayabiliriz. &amp;Ccedil;ok basit olarak kitap listesinin g&amp;ouml;sterilmesi ve yeni bir kitabın eklenebilmesi i&amp;ccedil;in gerekli fonksiyonelliklerin sunulduğu bir aray&amp;uuml;z&amp;uuml;m&amp;uuml;z var. HTML tarafı ile kod bir arada kullanılmakta.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;@page "/bookList"

&amp;lt;h1&amp;gt;Okuduğum Kitaplar (Toplam @books.Count() kitabım var) &amp;lt;/h1&amp;gt; 
&amp;lt;!--Toplam kitap sayısını da başlığa ekledik --&amp;gt;

&amp;lt;blockquote class="blockquote"&amp;gt;
    Burada okumaktan keyif aldığım kitaplar yer alıyor.
&amp;lt;/blockquote&amp;gt;

&amp;lt;ul&amp;gt;
    &amp;lt;!-- T&amp;uuml;m kitapları dolaşıp &amp;ouml;rnek olarak başlıklarını listeliyor ve hemen alt kısmına &amp;ouml;zet bilgilerini yerleştiriyoruz--&amp;gt;
    @foreach(var book in books){
        &amp;lt;li aria-describedby="bookTitle"&amp;gt;@book.Title&amp;lt;/li&amp;gt;
         &amp;lt;small id="bookTitle" class="form-text text-muted"&amp;gt;@book.Summary&amp;lt;/small&amp;gt; 
    }
&amp;lt;/ul&amp;gt;
&amp;lt;!-- Yeni bir kitap bilgisinin girişi i&amp;ccedil;in Bootstrap ile zenginleştirilmiş basit bir formumuz var --&amp;gt;
&amp;lt;div class="form-group"&amp;gt;
    &amp;lt;input class="form-control" id="txtTitle" placeholder="Kitabın adı" bind="@newBook.Title"/&amp;gt;&amp;lt;br/&amp;gt; &amp;lt;!--bind attribute'una atanan değer ile Title &amp;ouml;zelliğine bağladık --&amp;gt;
    &amp;lt;input class="form-control" id="txtAuthors" placeholder="Yazarlar" bind="@newBook.Authors" /&amp;gt;&amp;lt;br/&amp;gt;
    &amp;lt;input class="form-control" id="txtPageCount" placeholder="Sayfa sayısı" bind="@newBook.PageCount" /&amp;gt;&amp;lt;br/&amp;gt;
    &amp;lt;input class="form-control" id="txtSummary" aria-describedby="summaryHelp" placeholder="&amp;Ouml;zet" bind="@newBook.Summary" /&amp;gt;
    &amp;lt;small id="summaryHelp" class="form-text text-muted"&amp;gt;L&amp;uuml;tfen bir c&amp;uuml;mleyle kitabın neyle ilgili olduğunu anlat&amp;lt;/small&amp;gt; &amp;lt;!-- yardımcı bilgi veren metin i&amp;ccedil;in koyduk --&amp;gt;
&amp;lt;/div&amp;gt;
&amp;lt;button onclick="@AddNewBook" class="btn btn-primary"&amp;gt;Listeye ekleyelim&amp;lt;/button&amp;gt; &amp;lt;!-- onclick attribute'unda AddNewBook metoduna bağladık --&amp;gt;

&amp;lt;!-- Fonksiyonlarımız --&amp;gt;
@functions{
    // T&amp;uuml;m kitap listemizi ifade eden koleksiyonumuz
    IList&amp;lt;Book&amp;gt; books=new List&amp;lt;Book&amp;gt;();
    Book newBook=new Book();
    // Yeni bir kitap eklemek i&amp;ccedil;in kullanıyoruz.
    void AddNewBook(){
        books.Add(newBook); // Kitabı listeye ekledik
        newBook=new Book(); // Eğer newBook nesnesini sıfırlamassak b&amp;uuml;y&amp;uuml;k ihtimalle koleksiyona hep aynı nesne &amp;ouml;rneği eklenecektir.
    }
}&lt;/pre&gt;
&lt;p&gt;Ekleyeceğimiz bir diğer &amp;ouml;rnek Dependency Injection kullanımı ile ilgili. Built-in olarak gelen HttpClient servisini cshtml tarafında nasıl kullanabileceğimizi g&amp;ouml;rebilmek i&amp;ccedil;in WorldPopulation.cshtml isimli bir dosya geliştiriyoruz. Yine Pages klas&amp;ouml;r&amp;uuml;ne konuşlandıracağımız dosya i&amp;ccedil;eriği aşağıdaki gibi yazılabilir. @page direktifine g&amp;ouml;re /population adresine gelen taleplere karşılık bu sayfa işletilecektir. @inject kısmında httpClient servisinin koda enjekte edilmesi s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;@page "/population"
@inject HttpClient httpClient
&amp;lt;!-- built-in servislerden olan HttpClient servisini buraya enjekte ettik. 
httpClient değişken adıyla kullanabiliriz --&amp;gt;

&amp;lt;h2&amp;gt;G&amp;uuml;ncel 3 G&amp;uuml;nl&amp;uuml;k D&amp;uuml;nya N&amp;uuml;fusu Bilgileri&amp;lt;/h2&amp;gt;

&amp;lt;blockquote class="blockquote"&amp;gt;
    Bilgiler api.population.io sitesinden alınmıştır.
&amp;lt;/blockquote&amp;gt;

@if (values == null) // Hen&amp;uuml;z veriler gelmemiş olabilir.
{
    &amp;lt;p&amp;gt;&amp;lt;em&amp;gt;Bilgiler alınıyor...&amp;lt;/em&amp;gt;&amp;lt;/p&amp;gt;
}
else
{
    &amp;lt;div class="card" style="width: 18rem;"&amp;gt;
        &amp;lt;ul class="list-group list-group-flush"&amp;gt;
            @foreach (var currentData in @values) // T&amp;uuml;m değerleri dolaşıp g&amp;uuml;ncel n&amp;uuml;fus verisini ekrana basıyoruz            
            {
                &amp;lt;li class="list-group-item"&amp;gt;@string.Format("{0:#,0}",@currentData.Value) - @currentData.Date.ToShortDateString() &amp;lt;/li&amp;gt;
            }
        &amp;lt;/ul&amp;gt;
    &amp;lt;/div&amp;gt;
}

@functions{
    Population[] values; // istatistik bilgilerin dizisi

    // Sayfamızın başlangı&amp;ccedil; aşamasında &amp;ccedil;alışan asenkron olay metodumuz
    protected override async Task OnInitAsync()
    {
        // GetJsonAsync metodunu kullanarak bir talep g&amp;ouml;nderiyoruz ve sunucu tarafından json dosyasını alıyoruz
        // Burada harici bir servis adresine de &amp;ccedil;ıkılabilir
        //TODO: world.json i&amp;ccedil;eriğini veren bir .net web api dahil edelim
        values = await httpClient.GetJsonAsync&amp;lt;Population[]&amp;gt;("db/world.json");
    }

    // N&amp;uuml;fus bilgilerini tutan sınıfımız
    class Population
    {
        public DateTime Date { get; set; }
        public Int64 Value { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu sayfa sembolik olarak &amp;uuml;&amp;ccedil; g&amp;uuml;nl&amp;uuml;k d&amp;uuml;nya n&amp;uuml;fusu bilgilerini paylaşıyor. Tamamen kafadan uydurma bir &amp;ouml;rnek. Normal şartlarda n&amp;uuml;fus bilgileri bir servis aracılığıyla &amp;ccedil;ekilmekte. Bu noktada HttpClient hizmetinden yararlanmalıyız. Biz veri kaynağı olarak ger&amp;ccedil;ek bir servisi kullanmak yerine sahte bir json i&amp;ccedil;eriğini ele alıyoruz. wwwroot&amp;nbsp;altında oluşturacağımız db klas&amp;ouml;r&amp;uuml;nde yer alan world.json dosyası bu noktada devreye giriyor. Ancak TODO kısmında belirttiğimiz &amp;uuml;zere siz &amp;ouml;rneği geliştirirken bir Web API servisini kullanmayı deneyebilirsiniz.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;[
    {
        "date": "2019-02-01",
        "value": 7644991666
    },
    {
        "date": "2019-02-02",
        "value": 7645213391
    },
    {
        "date": "2019-02-03",
        "value": 7645435108
    }
]&lt;/pre&gt;
&lt;p&gt;Pek tabii boilerplate etkisi ile &amp;uuml;retilen projenin men&amp;uuml;s&amp;uuml; hazır şablona g&amp;ouml;re tesis edilmiş durumda. Burayı yeni eklediğimiz kendi sayfalarımıza g&amp;ouml;re d&amp;uuml;zenleyebiliriz. Tek yapmamız gereken NavMenu.cshtml dosyasını kurcalayarak aşağıdaki kıvama getirmektir. NavLink elementlerinde yeni eklediğimiz bileşenlerdeki @page direktiflerinde belirtilen URL adresleri kullanılmaktadır.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;div class="top-row pl-4 navbar navbar-dark"&amp;gt;
    &amp;lt;a class="navbar-brand" href=""&amp;gt;HelloWorld&amp;lt;/a&amp;gt;
    &amp;lt;button class="navbar-toggler" onclick=@ToggleNavMenu&amp;gt;
        &amp;lt;span class="navbar-toggler-icon"&amp;gt;&amp;lt;/span&amp;gt;
    &amp;lt;/button&amp;gt;
&amp;lt;/div&amp;gt;

&amp;lt;div class=@(collapseNavMenu ? "collapse" : null) onclick=@ToggleNavMenu&amp;gt;
    &amp;lt;ul class="nav flex-column"&amp;gt;
        &amp;lt;li class="nav-item px-3"&amp;gt;
            &amp;lt;NavLink class="nav-link" href="" Match=NavLinkMatch.All&amp;gt;
                &amp;lt;span class="oi oi-home" aria-hidden="true"&amp;gt;&amp;lt;/span&amp;gt; Başlangı&amp;ccedil; :P
            &amp;lt;/NavLink&amp;gt;
        &amp;lt;/li&amp;gt;
        &amp;lt;li class="nav-item px-3"&amp;gt;
            &amp;lt;NavLink class="nav-link" href="population"&amp;gt;
                &amp;lt;span class="oi oi-home" aria-hidden="true"&amp;gt;&amp;lt;/span&amp;gt; D&amp;uuml;nya N&amp;uuml;fusu
            &amp;lt;/NavLink&amp;gt;
        &amp;lt;/li&amp;gt;
       &amp;lt;!-- 
        &amp;lt;li class="nav-item px-3"&amp;gt;
            &amp;lt;NavLink class="nav-link" href="counter"&amp;gt;
                &amp;lt;span class="oi oi-plus" aria-hidden="true"&amp;gt;&amp;lt;/span&amp;gt; Saya&amp;ccedil;
            &amp;lt;/NavLink&amp;gt;
        &amp;lt;/li&amp;gt;
        --&amp;gt;
        &amp;lt;!-- Yeni eklediğimiz book sayfası i&amp;ccedil;in link. href değerine g&amp;ouml;re bookList.cshtml sayfasına y&amp;ouml;nlendirileceğiz --&amp;gt;
        &amp;lt;li class="nav-item px-3"&amp;gt;
            &amp;lt;NavLink class="nav-link" href="bookList"&amp;gt;
                &amp;lt;span class="oi oi-list-rich" aria-hidden="true"&amp;gt;&amp;lt;/span&amp;gt; Kitaplar
            &amp;lt;/NavLink&amp;gt;
        &amp;lt;/li&amp;gt;
    &amp;lt;/ul&amp;gt;
&amp;lt;/div&amp;gt;

@functions {
    bool collapseNavMenu = true;

    void ToggleNavMenu()
    {
        collapseNavMenu = !collapseNavMenu;
    }
}&lt;/pre&gt;
&lt;h2&gt;&amp;Ccedil;alışma Zamanı&lt;/h2&gt;
&lt;p&gt;Artık bir deneme s&amp;uuml;r&amp;uuml;ş&amp;uuml;ne &amp;ccedil;ıkabiliriz. Uygulamayı terminalden aşağıdaki komutu vererek &amp;ccedil;alıştırmamız m&amp;uuml;mk&amp;uuml;n.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet run&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnek olarak bir iki kitap girip sonu&amp;ccedil;ları inceleyebiliriz. Ben aşağıdakine benzer bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; yakalamışım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/19/cover_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alışma zamanını incelerken F12 ile debug moda ge&amp;ccedil;mekte yarar var. S&amp;ouml;z gelimi booklist &amp;uuml;zerinde &amp;ccedil;alışırken kitap ekleme ve listeleme gibi operasyonların ger&amp;ccedil;ekleştirilmesine karşılık oluşan HTML kaynağı aşağıdaki gibidir. Standart &amp;uuml;retilen HTML &amp;ccedil;ıktılarından biraz farklı değil mi? MVC'de, eski nesil Server Side Web Forms'larda veya saf HTML ile yazdıklarımızda &amp;uuml;retilen i&amp;ccedil;erikleri d&amp;uuml;ş&amp;uuml;nelim. Bir takım elementleri source &amp;uuml;zerinde g&amp;ouml;remiyoruz gibi. Yine de sayfamız kanlı canlı bir şeyler y&amp;uuml;r&amp;uuml;t&amp;uuml;yor.&amp;nbsp;Derlenmiş bir uygulamanın tarayıcıda koştuğunu ifade edebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/19/cover_3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Built-In HttpClient servisini enjekte ettiğimiz d&amp;uuml;nya n&amp;uuml;fus verileri sayfası ise ş&amp;ouml;yle g&amp;ouml;r&amp;uuml;necektir &lt;em&gt;(Ekranı daraltmamıza rağmen UX deneyiminin bozulmadığını g&amp;ouml;rm&amp;uuml;şs&amp;uuml;n&amp;uuml;zd&amp;uuml;r)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/19/cover_4.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;&amp;Uuml;r&amp;uuml;n&amp;uuml;n Paketlenmesi&lt;/h2&gt;
&lt;p&gt;Bir Blazor uygulamasının dağıtımı i&amp;ccedil;in publish işlemine ihtiyacımız var. Visual Studio tarafında bu iş olduk&amp;ccedil;a kolay. Microsoft Azure platformuna servis olarak da alabiliriz. WestWorld gibi Ubuntu tabanlı ortamlardaysa dağıtım işlemini dotnet komut satırı aracını kullanarak aşağıdaki terminal komutuyla ger&amp;ccedil;ekleştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet publish -c Release&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;Oluşan dosya i&amp;ccedil;eriklerini incelemekte yarar var. publish operasyonu sırasında gereksiz k&amp;uuml;t&amp;uuml;phaneler &amp;ccedil;ıkartılıp paket boyutu m&amp;uuml;mk&amp;uuml;n mertebe k&amp;uuml;&amp;ccedil;&amp;uuml;lt&amp;uuml;l&amp;uuml;yor. Dikkat &amp;ccedil;ekici nokta C# kodunun &amp;ccedil;alışması i&amp;ccedil;in gerekli ne kadar runtime bileşeni&lt;em&gt;(mscorlib, mono runtime, c libraries vb)&lt;/em&gt; varsa mono.wasm i&amp;ccedil;ine konulması. WestWorld'teki &amp;ouml;rnek i&amp;ccedil;in bu 2.1 mb'lık dosya anlamına geldi.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bunun sonucu olarak bin/Release/netstandard2.0/publish/ klas&amp;ouml;r&amp;uuml; altına gerekli t&amp;uuml;m proje dosyaları atılır. Bu dosyaları web sunucusuna veya bir host service'e alarak&lt;em&gt;(manuel veya otomatik ara&amp;ccedil;lar yardımıyla)&lt;/em&gt; uygulamayı canlı&lt;em&gt;(production)&lt;/em&gt; ortama taşıyabiliriz.&lt;/p&gt;
&lt;h2&gt;Ben Neler &amp;Ouml;ğrendim?&lt;/h2&gt;
&lt;p&gt;Blazor benim yeni yeni keşfetmeye, &amp;ouml;ğrenmeye ve anlamaya &amp;ccedil;alıştığım konulardan birisi. Yer yer huni takmama sebep olan i&amp;ccedil; mimarisi sebebiyle &amp;uuml;st&amp;uuml;ne daha &amp;ccedil;ok kafa patlatmam gerektiğiyse aşikar.&amp;nbsp;Buna rağmen bu basit Hello World denemesi sırasında bile &amp;ouml;ğrendiğim bir ka&amp;ccedil; şey oldu. Bunları ş&amp;ouml;yle maddeleştirebilirim.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Bir Blazor proje şablonunun temel bileşenlerinin ne olduğunu&lt;/li&gt;
&lt;li&gt;Blazor tarafında Bootstrap kullanarak daha şık tasarımlar yapılmasını&lt;/li&gt;
&lt;li&gt;Razor'da sayfa bileşenleri ile fonksiyonların nasıl etkileşebileceğini&lt;/li&gt;
&lt;li&gt;Blazor'daki Dependency Injection mekanizmasının nasıl ele alınabileceğini&lt;/li&gt;
&lt;li&gt;Bileşen odaklı bir geliştirme ortamı olduğunu&lt;/li&gt;
&lt;li&gt;Kabaca WASM terimini&lt;/li&gt;
&lt;li&gt;Blazor uygulamasının canlı ortamlar i&amp;ccedil;in publish edilmesini&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Ve b&amp;ouml;ylece geldik&amp;nbsp;bir&amp;nbsp;&lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;Saturday-Night-Works&lt;/a&gt; derlemesinin daha sonuna. Bir başka macerada g&amp;ouml;r&amp;uuml;şmek &amp;uuml;zere hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2019-06-07 11:00:00</pubDate>
  <slug>blazor-ile-hello-world-uygulamasi-gelistirmek</slug>
  <tags>
    <tag>blazor</tag>
    <tag>razor</tag>
    <tag>net-core</tag>
    <tag>html</tag>
    <tag>c#</tag>
    <tag>wasm</tag>
    <tag>dotnet</tag>
    <tag>web-assembly</tag>
    <tag>cshtml</tag>
    <tag>s-p-a</tag>
    <tag>single-page-application</tag>
    <tag>framework</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
  </categories>
</post>