<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Correlation Nedir? Yenir mi? İçilir mi?</title>
  <description>Bazen bir kavramı yada konuyu anlamakta inanılmaz zorlandığınızı hatırlayın. Ne yaparsınız? Kimisi kendisini yemeğe verir. Kimisi hayat küsermişçesine bir köşeye çekilir. Kimisi kendiyle baş başa kalır ve çığlık çığlık haykırır. Kimisi de daha akıllı davranıp bir süre tatile çıkar veya anlayamadığı kavramla ilişkili herhangibir dökümanı bir süreliğine araştırmamaya, okumamaya karar verir.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f1%2fblg126_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bazen bir kavramı yada konuyu anlamakta inanılmaz zorlandığınızı hatırlayın. Ne yaparsınız? Kimisi kendisini yemeğe verir. Kimisi hayat k&amp;uuml;sermiş&amp;ccedil;esine bir k&amp;ouml;şeye &amp;ccedil;ekilir. Kimisi kendiyle baş başa kalır ve &amp;ccedil;ığlık &amp;ccedil;ığlık haykırır. Kimisi de daha akıllı davranıp bir s&amp;uuml;re tatile &amp;ccedil;ıkar veya anlayamadığı kavramla ilişkili herhangibir d&amp;ouml;k&amp;uuml;manı bir s&amp;uuml;reliğine araştırmamaya, okumamaya karar verir. Neredeyse unuturcasına bir zaman koyar araya. Sonrasında ise aynı konuyu tekrar araştırmaya karar verir. İnanın başarılı olma şansı bir &amp;ouml;nceki denemeye g&amp;ouml;re &amp;ccedil;ok daha y&amp;uuml;ksek olacaktır. &amp;Ouml;nemli olan noktalardan birisi, yılmadan bu iterasyona devam edebilmektir. Okudunuz, hala anlamadınız...Kısa bir ara daha...Sonra tekrar aynı konu ama m&amp;uuml;mk&amp;uuml;nse farklı kaynaklarla...&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bende bir s&amp;uuml;redir&lt;strong&gt; Workflow Service'&lt;/strong&gt; lerde olduk&amp;ccedil;a &amp;ouml;nemli olan konulardan birisi &amp;uuml;zerinde araştırmalarımı tamamen durdurmuştum. &lt;strong&gt;Correlation&lt;/strong&gt;. &amp;Ccedil;&amp;uuml;nk&amp;uuml;; &lt;strong&gt;Matematikte "bağlılaşım/korelasyon"&lt;/strong&gt;, &lt;strong&gt;ekonomide "bağlanım"&lt;/strong&gt;, &lt;strong&gt;n&amp;uuml;kleer bilimlerde "bağlantı/eş ilişki"&lt;/strong&gt;, &lt;strong&gt;denizbilimde "ka&amp;ccedil;ınım"&lt;/strong&gt;, &lt;strong&gt;tıpta "Aferent uyarıların gerekli cevabı oluşturmak &amp;uuml;zere beyinin ilgili merkezinde birleşmesi" &lt;/strong&gt;olarak &amp;ccedil;evirileri yer alan bu kavramın, &lt;strong&gt;Workflow Services&lt;/strong&gt; i&amp;ccedil;erisinde ne anlama geldiğini anlamak i&amp;ccedil;in epey bir s&amp;uuml;re tepinmem gerekmişti. Ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde aynı konu &amp;uuml;zerinde yeniden durmaya ve araştırmaya ve edindiğim bilgileri sizlere paylaşmaya karar verdim. İşte elde ettiğim sonu&amp;ccedil;lar;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Correlation &lt;/strong&gt;kavramını&amp;nbsp;mesajları bir arada gruplamanın bir yolu olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir ilk etapta. &amp;Ouml;rneğin bir&lt;strong&gt; talep(Request)&lt;/strong&gt; ve bu talebe karşılık g&amp;ouml;nderilen &lt;strong&gt;cevap(Reply) &lt;/strong&gt;arasındaki ilişki &lt;strong&gt;Correlation &lt;/strong&gt;olarak ifade edilmektedir. &amp;Ouml;zellikle &lt;strong&gt;WCF(Windows Communication Foundation)&lt;/strong&gt;&amp;nbsp;tarafında &lt;strong&gt;Session &lt;/strong&gt;bazlı haberleşmelerde mesajlar arasında bir &lt;strong&gt;Correlation &lt;/strong&gt;oluştuğu s&amp;ouml;ylenebilir. Ancak &lt;strong&gt;Correlation' &lt;/strong&gt;ın farklı bir y&amp;ouml;n&amp;uuml; daha vardır. Bir &lt;strong&gt;servis &amp;ouml;rneği(Instance) &lt;/strong&gt;ile bir &lt;strong&gt;oturum(Session)&lt;/strong&gt; arasında da bağıntı kurulabilir. Yani bir &lt;strong&gt;SessionId&lt;/strong&gt; değerine ait olaraktan hareket eden mesajların i&amp;ccedil;eriğinde yer alan bazı veri par&amp;ccedil;alarının, &lt;strong&gt;Session&lt;/strong&gt; ile alakalı&amp;nbsp;bir&amp;nbsp;servis &amp;ouml;rneği ile eşleştirilmesi m&amp;uuml;mk&amp;uuml;n olabilir. Bir başka deyişle aynı &lt;strong&gt;SessionId&lt;/strong&gt; değeri altındaki mesajların her zaman i&amp;ccedil;in aynı servis &amp;ouml;rneğine ait olduğunun anlaşılmasında, &lt;strong&gt;SessionID=Service Instance ID&lt;/strong&gt; eşitliğinin sağlanması da &lt;strong&gt;Correlation &lt;/strong&gt;olarak ifade edilebilir. Bu ilişki &amp;ccedil;oğunlukla &lt;strong&gt;bilin&amp;ccedil;siz(Implicit)&lt;/strong&gt; olarak sağlanır. Yani, geliştiricinin &amp;ccedil;oğu zaman bir aksiyonda bulunmasına gerek yoktur. Aslında bu durumu aşağıdaki şekilde olduğu gibi canlandırabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg126_Correlation.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ancak &lt;strong&gt;Workflow&lt;/strong&gt; &amp;ouml;rneklerinde uzun zaman s&amp;uuml;ren s&amp;uuml;re&amp;ccedil;lerin ele alınması da s&amp;ouml;z konusudur&lt;strong&gt;&lt;em&gt;(Long Running Process)&lt;/em&gt;&lt;/strong&gt;. İstemcilerin, &lt;strong&gt;Workflow Service'&lt;/strong&gt; ler ile olan haberleşmelerinde aradaki oturumu kapatıp ayrılmaları bu tip s&amp;uuml;re&amp;ccedil;lerde son derece yaygındır. Buna g&amp;ouml;re istemci ile servis arasındaki oturumun her an sonlanabilir olması &amp;ouml;nemli bir sorunu ortaya &amp;ccedil;ıkarmaktadır; &lt;strong&gt;Correlation nasıl sağlanacak&lt;/strong&gt;? &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu ama&amp;ccedil;la &lt;strong&gt;Workflow Service'&lt;/strong&gt; lerde &lt;strong&gt;Correlation' &lt;/strong&gt;ın sağlanması i&amp;ccedil;in kullanılan &amp;ccedil;eşitli teknikler mevcuttur. Aslında burada da tam bir kavram kargaşası vardır. En g&amp;uuml;venilir kaynaklardan birisi olarak ele alacağımız &lt;strong&gt;MSDN&lt;/strong&gt;, &lt;strong&gt;Correlation' &lt;/strong&gt;ı &lt;strong&gt;Content-Based &lt;/strong&gt;ve &lt;strong&gt;Protocol-Based &lt;/strong&gt;olmak &amp;uuml;zere iki &amp;ccedil;eşide ayırmıştır. &lt;strong&gt;Protocol-Based Correlation'&lt;/strong&gt; da kendi i&amp;ccedil;erisinde &lt;strong&gt;Context &lt;/strong&gt;ve &lt;strong&gt;Request-Reply &lt;/strong&gt;isimli iki farklı &lt;strong&gt;Correlation &lt;/strong&gt;tekniğini daha barındırmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Content-Based Correlation'&lt;/strong&gt; da &lt;strong&gt;service &amp;ouml;rneği(Instance) &lt;/strong&gt;ile ilişkili olan veri&lt;em&gt;(Map edilmiş veri olaraktan da d&amp;uuml;ş&amp;uuml;nebiliriz) &lt;/em&gt;mesajın i&amp;ccedil;eriğinde yer alır. &amp;Ouml;rneğin mesajın &lt;strong&gt;Header&lt;/strong&gt; veya &lt;strong&gt;Body &lt;/strong&gt;kısımlarında bulunabilir. Dolayısıyla &lt;strong&gt;Correlation' &lt;/strong&gt;ı sağlayan arabirimlerin &lt;strong&gt;XML &lt;/strong&gt;tabanlı olan bu veri i&amp;ccedil;eriğini kontrol edebilmesi gerekmektedir. İşte bu noktada &lt;strong&gt;XPath &lt;/strong&gt;gibi sorgu teknikleri devreye girmektedir. &lt;strong&gt;Protocol-Based Correlation &lt;/strong&gt;ise iletişim mekanizmasını baz alır ve buna g&amp;ouml;re mesajlar arasında yada mesajlar ile doğru servis &amp;ouml;rneği arasında gerekli eşleştirmeyi sağlar.&lt;/p&gt;
&lt;p&gt;Bu giriş yazımızda &amp;ouml;zellikle &lt;strong&gt;Content-Based Correlation&lt;/strong&gt; &amp;uuml;zerinde durabiliriz. En &amp;ccedil;ok &amp;ouml;rneklenen model genellikle budur. &lt;strong&gt;Workflow Service' &lt;/strong&gt;lerde servise gelen ve servisten giden mesajların i&amp;ccedil;erdiği veri par&amp;ccedil;aları ile &amp;ccedil;alışma zamanındaki servis &amp;ouml;rnekleri arasında eşleştirme yapmak&lt;em&gt;(yani Correlation' ı sağlamak) &lt;/em&gt;son derece kolaydır. T&amp;uuml;m mesajlaşma aktivitelerinin &lt;strong&gt;CorrelationInitializers &lt;/strong&gt;isimli bir koleksiyonu bulunur. Bu koleksiyon i&amp;ccedil;erisinde &lt;strong&gt;Key-&lt;/strong&gt;&lt;strong&gt;Query &lt;/strong&gt;&amp;ccedil;iftleri yer almaktadır. Tahmin edileceği &amp;uuml;zere &lt;strong&gt;Key &lt;/strong&gt;değerleri ile &lt;strong&gt;Query' &lt;/strong&gt;lerin birbirlerinden ayrıştırılması sağlanır. En &amp;ouml;nemli nokta ise &lt;strong&gt;Query' &lt;/strong&gt;dir. &lt;strong&gt;Query &lt;/strong&gt;i&amp;ccedil;erisinde yer alan &lt;strong&gt;XPath &lt;/strong&gt;sorgusu ile &lt;strong&gt;Content &lt;/strong&gt;i&amp;ccedil;erisindeki veri işaret edilir. Tabi bir mesajlaşma aktivitesi, diğer bir mesajlaşma aktivitesinin başlattığı &lt;strong&gt;Correlation' &lt;/strong&gt;u takip edebilmelidir. Bunun i&amp;ccedil;inde &lt;strong&gt;CorrelationWith &lt;/strong&gt;isimli &amp;ouml;zellikten yararlanılır. Bu bilgilere&amp;nbsp;g&amp;ouml;re &lt;strong&gt;Correlation' &lt;/strong&gt;ın bir şekilde &lt;strong&gt;başlatılması(Initialize) &lt;/strong&gt;ve &lt;strong&gt;takip edilmesi(Follow) &lt;/strong&gt;gerektiği anlaşılmaktadır. Başlatılan bir &lt;strong&gt;Correlation' &lt;/strong&gt;ın takip &lt;span style="text-decoration: underline;"&gt;edilmemesi &lt;/span&gt;halinde mesajlar ve servis &amp;ouml;rneği arasında bir eşleştirmenin yapılması s&amp;ouml;z konusu olmayacaktır. Elbette &lt;strong&gt;Workflow Foundation 4.0 &lt;/strong&gt;i&amp;ccedil;erisinde bir &lt;strong&gt;Correlation' &lt;/strong&gt;ın başlatılmasını kolaylaştıran bir aktivitede gelmektedir. &lt;strong&gt;InitializeCorrelation &lt;/strong&gt;bileşeni.&lt;/p&gt;
&lt;p&gt;Sanırım şu ana kadar anlattıklarımız ile kafamızda &lt;strong&gt;Correlation'&lt;/strong&gt; ın ne olduğuna dair bir fikir oluşmuştur. Tabi konuyu kavramak tek başına yeterli değildir. Pratiğe d&amp;ouml;kmemizde yarar vardır.&amp;nbsp;Ancak şu an i&amp;ccedil;in bu konudaki araştırmaya ara verip tatile &amp;ccedil;ıkmak niyetindeyim.&amp;nbsp;Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2010-02-01 00:25:00</pubDate>
  <slug>Correlation-Nedir-Beta-2</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-40</tag>
    <tag>wf</tag>
    <tag>wf-40</tag>
    <tag>workflow-services</tag>
  </tags>
  <categories>
    <category>WCF 4.0 Beta 2</category>
    <category>WF 4.0 Beta 2</category>
  </categories>
</post>