<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>NoSQL Maceraları - Apache Cassandra ve .Net</title>
  <description>Size bu günkü makale konumuzun yanda fotoğrafı görülen model(youtube modeli de diyebiliriz) Cassandra Bankson ile alakalı olduğunu söylemek isterdim ama yakınlarından bile geçmeyeceğiz. (Zaten araştırırsanız aslında makyaj bidonu ile bu hale geldiğini keşfedeceksiniz) Başlıktan da anlayacağınız üzere bu günkü yazımızın konusu .Net plaftormunda Apache Cassandra’ yı kullanmak.</description>
  <content>&lt;p&gt;&lt;a href="/pics/cassandra.jpg"&gt;&lt;img style="margin: 4px 0px; display: inline; float: right;" title="cassandra" src="/pics/cassandra_thumb.jpg" alt="cassandra" width="260" height="195" align="right" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Size bu g&amp;uuml;nk&amp;uuml; makale konumuzun yanda fotoğrafı g&amp;ouml;r&amp;uuml;len model&lt;em&gt;(youtube modeli de diyebiliriz)&lt;/em&gt; Cassandra Bankson ile alakalı olduğunu s&amp;ouml;ylemek isterdim ama yakınlarından bile ge&amp;ccedil;meyeceğiz. &lt;em&gt;(Zaten araştırırsanız aslında makyaj bidonu ile bu hale geldiğini keşfedeceksiniz) &lt;/em&gt;Başlıktan da anlayacağınız &amp;uuml;zere bu g&amp;uuml;nk&amp;uuml; yazımızın konusu&lt;strong&gt; .Net&lt;/strong&gt; plaftormunda &lt;strong&gt;Apache Cassandra&lt;/strong&gt;&amp;rsquo; yı kullanmak.&lt;/p&gt;
&lt;p&gt;Uzun zamandır g&amp;uuml;ndemimde olan konulardan birisi de &lt;strong&gt;NoSQL&lt;/strong&gt; veritabanı sistemleri. &lt;strong&gt;Internet&lt;/strong&gt; şirketlerinin pek &amp;ccedil;oğu&lt;em&gt;(Facebook, Twitter, Youtube, Netflix vb)&lt;/em&gt;&amp;nbsp; &lt;strong&gt;NotOnly SQL&lt;/strong&gt; veritabanlarını kullanmakta ve hatta bir kısmının kendi geliştirdikleri &lt;strong&gt;NoSQL&lt;/strong&gt; sistemleri bile var. &lt;strong&gt;Amazon, Google&lt;/strong&gt; bu noktada &amp;ouml;nc&amp;uuml;ler diyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;NoSQL&lt;/strong&gt; veritabanlarının pop&amp;uuml;ler olmalarının elbette bazı sebepleri var. &amp;Ouml;zellikle &lt;strong&gt;RDMS'&lt;/strong&gt; lerin tipik &amp;ouml;zelliklerine ters gelen kabiliyetleri nedeni ile b&amp;uuml;y&amp;uuml;k veriler ile &amp;ccedil;alışılmasında, &amp;ouml;l&amp;ccedil;eklemelerde, performans da &amp;ouml;ne &amp;ccedil;ıkabilmektedirler. Tabi bu avantajlar, &lt;strong&gt;NoSQL&lt;/strong&gt; yapısına uygun veri k&amp;uuml;meleri i&amp;ccedil;in s&amp;ouml;z konusudur. Her veri yapısı veya modeli i&amp;ccedil;in NoSQL sistemleri uygun olmayabilir. &lt;em&gt;(Yani RDMS' i terk eden bir d&amp;uuml;nyadan bahsedemeyiz &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_61.png" alt="Smile" /&gt;) &lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Ancak &lt;strong&gt;NoSQL&lt;/strong&gt; sistemler &amp;ccedil;eşitlilikleri a&amp;ccedil;ısından da &lt;strong&gt;RDMS&amp;rsquo;&lt;/strong&gt; lere g&amp;ouml;re farklılaşmakta ve bu y&amp;uuml;zden daha fazla tercih edilir olmaktadır. Bu &amp;ccedil;eşitler kısaca şunlardır;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Wide Column Store / Column Families &lt;em&gt;(Cassandra bu kategoride g&amp;ouml;sterilmiştir)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Document Store&lt;/li&gt;
&lt;li&gt;Key Value / Tuple Store&lt;/li&gt;
&lt;li&gt;Graph Databases&lt;/li&gt;
&lt;li&gt;Multimodel Databases&lt;/li&gt;
&lt;li&gt;Object Databases&lt;/li&gt;
&lt;li&gt;Grid &amp;amp; Cloud Databases&lt;/li&gt;
&lt;li&gt;XML Databases&lt;/li&gt;
&lt;li&gt;Multidimensional Databases&lt;/li&gt;
&lt;li&gt;Multivalue Database&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Aslında ortalıkta pek &amp;ccedil;ok &lt;strong&gt;NoSQL&lt;/strong&gt; sistemi var. Hatta &amp;ccedil;oooook uzun zaman &amp;ouml;nce &lt;strong&gt;Berkley&lt;/strong&gt; &amp;uuml;niversitesi tarafından &amp;uuml;retilen &lt;strong&gt;Berkley_DB&lt;/strong&gt; bu işin atasıdır diyebiliriz. G&amp;uuml;n&amp;uuml;m&amp;uuml;zde ise MongoDb, Neo4j, db4o, bigtable, hadoop, Redis, MemcachedDB vb &amp;uuml;r&amp;uuml;nler bulunmakta. &lt;em&gt;&lt;a href="http://nosql-database.org/" target="_blank"&gt;(Tam ve g&amp;uuml;ncel bir listeye bu adresten ulaşabilirsiniz)&lt;/a&gt;&lt;/em&gt;&amp;nbsp;&lt;strong&gt;NoSQL &lt;/strong&gt;sistemlerinin pop&amp;uuml;ler olanlarından biriside ismini Yunan Mitolojisinden aldığını d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m &lt;strong&gt;Apache&lt;/strong&gt;' nin &lt;strong&gt;Cassandra &lt;/strong&gt;isimli &amp;uuml;r&amp;uuml;n&amp;uuml;d&amp;uuml;r. Bu yazımızda &lt;strong&gt;Cassandra&lt;/strong&gt;&amp;rsquo; yı&lt;strong&gt; .Net&lt;/strong&gt; platformunda nasıl kullanabileceğimizi incelemeye &amp;ccedil;alışıyor olacağız.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Apache Cassandra' yı &lt;a href="http://cassandra.apache.org/download/"&gt;http://cassandra.apache.org/download/&lt;/a&gt; adresinden indirebilirsiniz. Cassandra yı indirdiğinizde b&amp;uuml;y&amp;uuml;k ihtimalle tar.gz uzantılı bir dosya gelecektir. Dolayısıyla Windows tabanlı bir sistemde bunu a&amp;ccedil;acak uygulamaya ihtiyacınız var. 7Zip bu konuda bana yardımcı oldu diyebilirim.&lt;/p&gt;
&lt;p&gt;Cassandra' yı bir klas&amp;ouml;re a&amp;ccedil;tıktan sonra sisteme bazı &amp;ccedil;evresel değişkenlerin de ilave edilmesi gerekmektedir(Environment Variables). Bunlardan birisi JAVA_HOME dur ve sistem de kurulmuş olan Java klas&amp;ouml;r&amp;uuml;n&amp;uuml; g&amp;ouml;stermektedir. Diğeri ise CASSANDRA_HOME olarak adlandırılmaktadır ve Cassandra' nın a&amp;ccedil;ıldığı klas&amp;ouml;r&amp;uuml; işaret etmektedir. Kendi sistemimde bu değerleri şu şekilde ayarladım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/uc_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="uc_1" src="/pics/uc_1_thumb.png" alt="uc_1" width="409" height="471" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/uc_2.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="uc_2" src="/pics/uc_2_thumb.png" alt="uc_2" width="414" height="459" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Kurulum işlemi i&amp;ccedil;in gerekli ayarları yaptıktan sonra &lt;strong&gt;bin&lt;/strong&gt; klas&amp;ouml;r&amp;uuml; altında yer alan &lt;strong&gt;cassandra.bat&lt;/strong&gt; dosyasını &amp;ccedil;alıştırabiliriz. Bu &lt;strong&gt;batch&lt;/strong&gt; dosyası sunucuyu etkinleştirecektir. &lt;strong&gt;Cassandra&lt;/strong&gt; verilerin loglarını tutmak i&amp;ccedil;in &lt;strong&gt;root&lt;/strong&gt; klas&amp;ouml;rdeki &lt;strong&gt;var&lt;/strong&gt; isimli alt klas&amp;ouml;r&amp;uuml; kullanır &lt;em&gt;(Bu kuruluma g&amp;ouml;re d:\var altındadır ama istendiği takdirde conf klas&amp;ouml;r&amp;uuml; i&amp;ccedil;indeki cassandra.yaml' den konum değiştirilebilir)&lt;/em&gt;&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Genel &amp;Ouml;zellikler&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Cassandra' nın genel &amp;ouml;zelliklerine baktığımızda aşağıdakileri ifade edebiliriz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Java ile geliştirilmiş bir veritabanı sistemidir ve bu nedenle kurulduğu makinede Java ortamının var olması gerekmektedir.&lt;/li&gt;
&lt;li&gt;Bir NoSQL(Not Only SQL) sistemidir. Dolayısıyla SQL, Oracle gibi ilişkisel bir veritabanı modeli değildir.&lt;/li&gt;
&lt;li&gt;A&amp;ccedil;ık kaynaktır(Open Source)&lt;/li&gt;
&lt;li&gt;Bir Oracle veya SQL Server olmasa da Youtube, Netflix gibi pek &amp;ccedil;ok d&amp;uuml;nya markası tarafından &amp;ccedil;eşitli &amp;uuml;r&amp;uuml;nlerde kullanılmaktadır.&lt;/li&gt;
&lt;li&gt;Kolayca &amp;ouml;l&amp;ccedil;eklenebilir(Scalable)&lt;/li&gt;
&lt;li&gt;Hata tolerans y&amp;ouml;netimi mevcuttur.&lt;/li&gt;
&lt;li&gt;S&amp;uuml;tun odaklı&lt;em&gt;(Wide Column Store/Column Families)&lt;/em&gt; &amp;ccedil;alışan bir NoSQL tipidir.&lt;/li&gt;
&lt;li&gt;Distribution tasarım modeli Amazon' un Dynamo &amp;uuml;r&amp;uuml;n&amp;uuml; esaslıdır.&lt;/li&gt;
&lt;li&gt;Dağıtık modele destek verdiğinden veriyi n sayıda makine &amp;uuml;zerinde genişletmek m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bu anlamda RDMS(Relational Database Managament Systems) lerin tam aksine Ring d&amp;uuml;zenine g&amp;ouml;re &amp;ccedil;alışır. Bir başka deyişle dikey(Vertical) değil yatay(Horizontal) olarak &amp;ouml;l&amp;ccedil;eklenir.&lt;/li&gt;
&lt;li&gt;Terabyte' larca veriyi tutabilir &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_138.png" alt="Winking smile" /&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Veri modeline &amp;uuml;stten bakıldığında yapısı &lt;strong&gt;RDMS&lt;/strong&gt; şemalarına benzetilebilir. S&amp;uuml;tunlar ve &lt;strong&gt;isimlendirilmiş değerler(Named Values)&lt;/strong&gt; s&amp;ouml;z konusudur. Ancak pratikte hi&amp;ccedil; de b&amp;ouml;yle değildir. &lt;strong&gt;Cassandra&lt;/strong&gt; bir şema yapısı kullanmamaktadır. Ya bizim aşina olduğumuz tipte bir şema kullanmamaktadır diyebiliriz. Veriyi s&amp;uuml;tunlar topluluğu halinde tutar. Aslında bu konuda &amp;ccedil;ok fazla detaya girmeyeceğiz.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;İlk &amp;Ccedil;alışma&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;Cassandra'&lt;/strong&gt; yı kurup &amp;ccedil;alıştırdıktan sonra&lt;em&gt;(cassandra.bat ile yapıyoruz)&lt;/em&gt; komut satırından hemen veri girişi işlemleri yaptırılabilir. Bunun i&amp;ccedil;in yine &lt;strong&gt;bin&lt;/strong&gt; dizinindeki &lt;strong&gt;cassandra_cli.bat&lt;/strong&gt; dosyasının &amp;ccedil;alıştırılması yeterlidir. Bu bir komut satırı istemcisidir ve cassandra sunucusuna bağlanacaktır. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde &amp;ouml;rnek bir kullanıma yer verilmiştir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/uc_3.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="uc_3" src="/pics/uc_3_thumb.png" alt="uc_3" width="588" height="535" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Buradaki komutlardan da anlaşılacağı &amp;uuml;zere veritabanı aslında bir &lt;strong&gt;keyspace'&lt;/strong&gt; dir. Bu &lt;strong&gt;keyspace&lt;/strong&gt; i&amp;ccedil;erisinde bir tablo oluşturmak aslında bir &lt;strong&gt;Column&lt;/strong&gt; &lt;strong&gt;Family&lt;/strong&gt; yaratmak anlamına gelmektedir. &lt;strong&gt;Column&lt;/strong&gt; &lt;strong&gt;Family&lt;/strong&gt; i&amp;ccedil;erisine &lt;strong&gt;set&lt;/strong&gt; edilen &lt;strong&gt;Row Key&amp;rsquo;&lt;/strong&gt; ler aslında bildiğimiz tablo satırlarına benzetilebilir. &lt;strong&gt;Row Key&amp;rsquo;&lt;/strong&gt; ler i&amp;ccedil;erisinde ise &lt;strong&gt;key-value&lt;/strong&gt; şeklinde kolonlar ve verileri bulunmaktadır. Her &lt;strong&gt;key-value&lt;/strong&gt; &lt;strong&gt;column&lt;/strong&gt; aslında bir &lt;strong&gt;Row Key&lt;/strong&gt; ile ilintilidir.&lt;/p&gt;
&lt;p&gt;Dikkat edileceği gibi kolonlarda &lt;strong&gt;key-value&lt;/strong&gt; şeklinde bir tutuluş s&amp;ouml;z konusudur. Ortam tamamen &lt;strong&gt;case sensitive'&lt;/strong&gt; dir ve ifadelerin &amp;ccedil;alışması i&amp;ccedil;in &lt;strong&gt;;&lt;/strong&gt; ile bitirilmesi gerekmektedir. &amp;Ouml;rnekte kullandığımız komutlar ise aşağıdaki gibidir.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;İlk Komutlar&lt;/strong&gt;&lt;/h2&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;create keyspace&lt;/strong&gt; ile BigFootMotorCompany isimli bir &lt;strong&gt;key space&lt;/strong&gt; &amp;uuml;retilmiştir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;create&lt;/strong&gt; &lt;strong&gt;column&lt;/strong&gt; &lt;strong&gt;family&lt;/strong&gt; ile Car isimli bir &lt;strong&gt;Row Key&lt;/strong&gt; &amp;uuml;retilmiştir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;set&lt;/strong&gt; ile Car i&amp;ccedil;erisinde s&amp;uuml;tun(Column) ve &lt;strong&gt;key-value&lt;/strong&gt; eklenmiştir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;get&lt;/strong&gt; ile bir ModelX isimli column verisi &amp;ccedil;ekilmiştir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Yapılan bu &amp;uuml;retim sonrasında klas&amp;ouml;r yapısıda aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi oluşacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/uc_4.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="uc_4" src="/pics/uc_4_thumb.png" alt="uc_4" width="557" height="328" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Veri binary formatta tutulmaktadır.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Gelelim .Net Framework tarafına&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;.Net&lt;/strong&gt; tarafında &lt;strong&gt;Cassandra&lt;/strong&gt; ile &amp;ccedil;alışabilmek i&amp;ccedil;in &lt;strong&gt;NuGet&lt;/strong&gt; paketlerinden birisi olan &lt;strong&gt;FluentCassandra&lt;/strong&gt; ile &amp;ccedil;alışabiliriz. İlk olarak basit bir Console uygulaması a&amp;ccedil;alım ve NuGet paket y&amp;ouml;neticisini kullanarak internetten Fluent Cassandra paketini indirelim(Dilerseniz komut satırından da install edebilirsiniz. Install-Package FluentCassandra ifadesini &amp;ccedil;alıştırmanız yeterli olacaktır)&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/uc_5.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="uc_5" src="/pics/uc_5_thumb.png" alt="uc_5" width="640" height="360" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;İlk Kodlar&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;İşte ilk deneme kodlarımız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using FluentCassandra; 
using FluentCassandra.Connections; 
using System;

namespace HowTo_HelloApacheCassandra 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            // Sunucu ile bağlant kuralım. Varsayılan olarak localhost ismiyle bağlanabiliriz. 
            Server cassandraServer = new Server("localhost");

            // Komut satırından &amp;uuml;rettiğimiz BigFootMotorCompany isimli key space ile &amp;ccedil;alışacağız 
           using (var database = new CassandraContext(keyspace: "BiGFootMotorCompany", server: cassandraServer)) 
            { 
                // sunucuya ve veritabanına bağlanıp bağlanamadığımız test etmek i&amp;ccedil;in bir ka&amp;ccedil; bilgi talep edelim. 
                Console.WriteLine("Server port : {0}, database verison : {1}" 
                    ,cassandraServer.Port 
                    , database.DescribeVersion() 
                    );

                #region Yeni bir Column Family oluşturmak

                CassandraColumnFamily newFamily = database.GetColumnFamily("ModelDesigner");

                // Cassandra Query Language kullanarak bir Column Family oluşturuyor ve i&amp;ccedil;erisine bir ka&amp;ccedil; column ilave ediyoruz 
                // Sonraki denemelerde bu satırda hata vermemesi i&amp;ccedil;in bir null kontrol&amp;uuml; yapmak da işe yarayabilir 
                if(newFamily==null) 
                    database.ExecuteQuery(@" 
                    create columnfamily 
                    ModelDesigner( 
                        ModelDesignerId ascii Primary Key 
                        ,Title text 
                       ,Nickname text 
                        ,Level int 
                        ,Outsource boolean);" 
                    );

                // Yeni bir satır oluşturalım 
                // dynamic tipin &amp;ccedil;alışma zamanında &amp;ccedil;&amp;ouml;z&amp;uuml;mlenmesine neden olacaktır. 
                dynamic burkinyus=newFamily.CreateRecord("burkinyus"); 
                // Key' lerin değerlerini atayalım 
                burkinyus.Title = "Mr."; 
                burkinyus.Nickname = "burkinyus"; 
                burkinyus.Level = 100; 
                burkinyus.Outsource = false;

                // Yeni oluşturlan satırları Context' e ekleyelim 
                database.Attach(burkinyus);

                // bir satır daha oluşturalım ve alanlarını set edelim 
                dynamic oktavyus = newFamily.CreateRecord("oktavyus"); 
                oktavyus.Title = "Mr."; 
                oktavyus.Nickname = "oktavyus"; 
                oktavyus.Level = 400; 
                oktavyus.Outsource = true; 
                
                database.Attach(oktavyus);

                // Değişiklikleri kayıt edelim 
                database.SaveChanges();

                // şimdi de verileri &amp;ccedil;ekip g&amp;ouml;sterelim 
                var designers = database.ExecuteQuery("select * from ModelDesigner");

                foreach (dynamic designer in designers) 
                { 
                    Console.WriteLine("{0} {1}({2}) {3}" 
                        ,designer.Title 
                        ,designer.Nickname 
                        ,designer.Level 
                        ,designer.Outsource==true?"Outsource":"_" 
                        ); 
                } 
                #endregion 
            }            
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;ve &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/uc_6.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="uc_6" src="/pics/uc_6_thumb.png" alt="uc_6" width="353" height="94" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Uygulamanın başarılı bir şekilde &amp;ccedil;alışabilmesi i&amp;ccedil;in tahmin edeceğiniz &amp;uuml;zere Cassandra sunucusunun da a&amp;ccedil;ık olması gerekir. Aksi durumda &amp;ccedil;alışma zamanında aşağıdakine benzer bir istisna(Exception) fırlatılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/uc_7.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="uc_7" src="/pics/uc_7_thumb.png" alt="uc_7" width="588" height="331" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bu ilk &amp;ouml;rnekte BiGFootCompany &lt;strong&gt;key space&lt;/strong&gt;&amp;rsquo; ine bağlanıp &lt;strong&gt;ModelDesigner&lt;/strong&gt; isimli yeni bir &lt;strong&gt;Column&lt;/strong&gt; &lt;strong&gt;Family&lt;/strong&gt; oluşturmaktayız. Bu &lt;strong&gt;Column&lt;/strong&gt; &lt;strong&gt;Family&lt;/strong&gt; i&amp;ccedil;erisinde de, &lt;strong&gt;Title, Nickname, Level&lt;/strong&gt; ve &lt;strong&gt;Outsource&lt;/strong&gt; gibi kolonlar bulunmakta. &amp;Ouml;rnek olarak iki adet satır oluşturulmakta ve veritabanına ilave edilerek bir sonu&amp;ccedil; listesinin ekrana bastırılması sağlanmaktadır. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;SQL&lt;/strong&gt; ifadelerine &amp;ccedil;ok benzeyen bazı sorgular da kullandık. Bunlar &lt;strong&gt;CQL(Cassandra Query Language)&lt;/strong&gt; olarak adlandırılmaktadır. Ayrıca işlerimizi biraz daha kolaylaştırmak adına &lt;strong&gt;dynamic&lt;/strong&gt; anahtar kelimesinden faydalanmaya &amp;ccedil;alıştık. Bu sayede &lt;strong&gt;Row Key&amp;rsquo;&lt;/strong&gt; lerin kolonlarına, birer &amp;ouml;zellikmiş gibi erişebilmemiz m&amp;uuml;mk&amp;uuml;n oldu. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki yazımızda g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_138.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2012%2f10%2fHowTo_HelloApacheCassandra.zip"&gt;HowTo_HelloApacheCassandra.zip (457,46 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2012-12-16 19:35:00</pubDate>
  <slug>Apache-Cassandra-ve-Net</slug>
  <tags>
    <tag>nosql</tag>
    <tag>apache-cassandra</tag>
    <tag>net</tag>
    <tag>nuget</tag>
    <tag>not-only-sql</tag>
  </tags>
  <categories>
    <category>NoSQL</category>
  </categories>
</post>