<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tek Fotoluk İpucu 138 - Bir Web Sayfa İçeriğini İndirmek</title>
  <description>Vakti zamanında(90lı yılların ortaları diyelim) internette dolanırken bir şeyler öğrenmeye çalıştığım geliştirici siteleri olurdu. Internet o zamanlar kıymetli olduğundan site içeriklerini offline olarak da dolaşabilmek için bazı yardımcı uygulamaları kullanırdık. O yıllarda Delphi konulu makaleler içeren bir sitenin tüm içeriğini indirdiğimi hatırlıyorum. Geçenlerde bu tip bir uygulamayı nasıl yazabilirim diye düşünerken işe web içeriklerini nasıl indirebileceğimi araştırarak başlayayım dedim. .Net tarafında bununla ilgili daha önceden uğraşmıştım ama bu sefer Ruby'yi seçtim. Aşağıdaki ekran görüntüsünde bu işi gerçekleştiren basit bir kod parçasını görebilirsiniz(Fotoğraftaki Zero Hour Maps tab'ına aldırmayın :D )</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Vakti zamanında&lt;em&gt;(90lı yılların ortaları diyelim)&lt;/em&gt; internette dolanırken bir şeyler &amp;ouml;ğrenmeye &amp;ccedil;alıştığım&amp;nbsp;geliştirici siteleri olurdu. Internet o zamanlar kıymetli olduğundan site i&amp;ccedil;eriklerini offline olarak da dolaşabilmek i&amp;ccedil;in bazı yardımcı uygulamaları kullanırdık. O yıllarda Delphi konulu makaleler i&amp;ccedil;eren bir sitenin t&amp;uuml;m&amp;nbsp;i&amp;ccedil;eriğini indirdiğimi hatırlıyorum. Ge&amp;ccedil;enlerde bu tip bir uygulamayı nasıl yazabilirim diye d&amp;uuml;ş&amp;uuml;nerken işe&amp;nbsp;web&amp;nbsp;i&amp;ccedil;eriklerini nasıl indirebileceğimi&amp;nbsp;araştırarak başlayayım dedim. .Net tarafında bununla ilgili daha &amp;ouml;nceden uğraşmıştım ama bu sefer Ruby'yi se&amp;ccedil;tim. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde bu işi ger&amp;ccedil;ekleştiren basit bir kod par&amp;ccedil;asını g&amp;ouml;rebilirsiniz&lt;em&gt;(Fotoğraftaki Zero Hour Maps tab'ına aldırmayın :D )&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/10/tfi138.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Kod olduk&amp;ccedil;a basit. NetHttp k&amp;uuml;t&amp;uuml;phanesini kullanarak bir web sayfası i&amp;ccedil;eriğini makineye indiriyoruz. İlk olarak bir URI değişkeni jhazırladık. Sonrasında bu&amp;nbsp;değişkeni get_response metoduna parametre olarak veriyoruz. Bu fonksiyon&amp;nbsp;ile elde edilen cevap &amp;uuml;zerinden HTTP Get &amp;ccedil;ağrısına&amp;nbsp;ait pek &amp;ccedil;ok bilgiye ulaşabiliriz. Bu bilgiler i&amp;ccedil;in her bir key değerini dolaşan d&amp;ouml;ng&amp;uuml;m&amp;uuml;z de mevcut. &amp;Ouml;rneğin Header bilgilerini okumamız m&amp;uuml;mk&amp;uuml;n. İ&amp;ccedil;eriğin tipini, uzunluğunu, sunucudaki işletim sistemi versiyonunu etag bilgisi ve benzerlerini elde edebiliriz. HTTP cevabının 200 OK olması halinde(HTTPOK) ilgili&amp;nbsp;değerleri ekrana basıyor ve sayfa&amp;nbsp;i&amp;ccedil;eriğini content.hmlt isimli dosyaya&amp;nbsp;yazdırıyoruz. &lt;em&gt;(body &amp;ouml;zelliğinde 0dan i&amp;ccedil;eriğin boyutu kadar karakter okuması yaptığımıza dikkat edin)&lt;/em&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Pek tabii HTTP &amp;uuml;zerinden i&amp;ccedil;erik okumanın farklı yolları da mevcut. nethttp k&amp;uuml;t&amp;uuml;phanesi olduk&amp;ccedil;a geniş imkanlara sahip ve sizin bu kod &amp;uuml;zerine yapabileceğiniz pek &amp;ccedil;ok şey var. B&amp;uuml;y&amp;uuml;k boyutlu i&amp;ccedil;erikleri par&amp;ccedil;a par&amp;ccedil;a indirmek, HTTP Post&amp;nbsp;talepleri g&amp;ouml;ndermek, proxy &amp;uuml;zerinden ge&amp;ccedil;iş yapıyorsanız proxy ayarları ile talep yollayabilmek, https i&amp;ccedil;in sertifika etkinleştirmek vb...Bu değerli araştırma konularını da size bırakıyorum.&amp;nbsp;Bir başka ipucunda g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-10-24 21:35:00</pubDate>
  <slug>tek-fotoluk-ipucu-138-bir-web-sayfa-icerigini-indirmek</slug>
  <tags>
    <tag>ruby</tag>
    <tag>http-request</tag>
    <tag>nethttp</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>