<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>GoLang - Yönlendiriciler (Routers)</title>
  <description>Yönlendirme(Routers) mekanizmaları özellikle anlamlı http taleplerinde önemli bir rol oynar. Bir tarayıcının URL satırından gelen ifadelerin sunucu tarafında ele alınması sırasında işleri kolaylaştırıcı kütüphaneler de bulunmaktadır. Sevgili Murat Özalp'ın kitabında ilerlerken GO'nun built-in yönlendirme mekanizmaları dışında github üzerinden sunulan pek çok basit ve kullanışlı çatının daha olduğunu öğrendim. Tabii burada bahsedilen kütüphaneler ağırlıklı olarak web taleplerinin bir eşleştirme koduna göre uygun fonksiyonlara yönlendirilmesi ve cevaplandırılması ile alakalıydı.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/05/gorouting_1.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Y&amp;ouml;nlendirme&lt;em&gt;(Routers)&lt;/em&gt; mekanizmaları &amp;ouml;zellikle anlamlı HTTP taleplerinde &amp;ouml;nemli bir rol oynar. Bir tarayıcının adres satırından gelen ifadelerin&amp;nbsp;sunucu tarafında ele alınması sırasında işleri kolaylaştırıcı k&amp;uuml;t&amp;uuml;phaneler de bulunmaktadır. Sevgili Murat &amp;Ouml;zalp'ın kitabında ilerlerken GO'nun built-in y&amp;ouml;nlendirme mekanizmaları dışında github &amp;uuml;zerinden sunulan pek &amp;ccedil;ok basit ve kullanışlı &amp;ccedil;atının olduğunu &amp;ouml;ğrendim. Tabii burada bahsedilen k&amp;uuml;t&amp;uuml;phaneler ağırlıklı olarak web taleplerinin bir eşleştirme koduna g&amp;ouml;re uygun fonksiyonlara y&amp;ouml;nlendirilmesi ve cevaplandırılması ile alakalıydı. Bazıları performans a&amp;ccedil;ısından &amp;ouml;ne &amp;ccedil;ıkarken bazıları komple bir web &amp;ccedil;atısını sunma kabiliyetine sahipti. G&amp;uuml;ncel listeye &lt;a href="https://github.com/naoina/go-http-routing-benchmark" target="_blank"&gt;şu adresten bakabilirsiniz.&lt;/a&gt; Yeni paketler geldik&amp;ccedil;e veya var olanlarda değişiklikler olduk&amp;ccedil;a benchmark sonu&amp;ccedil;ları da etkilenecektir. Bu nedenle ara ara uğramakta yarar olduğu kanısındayım.&lt;/p&gt;
&lt;p&gt;Bende kitabın sıkı bir takip&amp;ccedil;isi olarak &amp;ouml;rnek &amp;uuml;zerinden ilerlemeye başladım ve bahsedilen &lt;a href="https://github.com/julienschmidt/httprouter" target="_blank"&gt;httpRouter&lt;/a&gt; k&amp;uuml;t&amp;uuml;phanesini kullanmayı denedim. Pek tabii aynı &amp;ouml;rneği değil de konuyu kendim i&amp;ccedil;in eğlenceli hale getirecek bir versiyonunu yapmaya &amp;ccedil;alıştım. Aklıma en sevdiğim film serilerinden olan Star Wars'taki gezegenler geldi. Bir ka&amp;ccedil; gezegeni ve &amp;ouml;nemli şehirlerini şimdilik bellekte tutacağım bir yapı&lt;em&gt;(struct)&lt;/em&gt; ilişkisi oluşturup aşağıdaki HTTP taleplerini karşılayacak bir web sunucusu yazmak eğlenceli olabilirdi&lt;em&gt;(Yandaki fotoğrafta g&amp;ouml;r&amp;uuml;len galaksinin detaylarına ve &amp;ccedil;ok daha kapsamlı bir sunumuna&amp;nbsp;&lt;a href="http://starwars.wikia.com/wiki/Star_Wars:_Complete_Locations" target="_blank"&gt;şu adresten ulaşabilirsiniz&lt;/a&gt;. Adamlar &amp;uuml;şenmemişler koskoca bir evreni hayal edip kurgulamışlar. Bu kurgulamayı Star Trek serisinde de g&amp;ouml;rmekteyiz.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;/ ile bir karşılama sayfasına y&amp;ouml;nlendirilip&lt;br /&gt;/planets ile gezegenler listesini g&amp;ouml;sterip&lt;br /&gt;/planets/:name ile de bir gezegendeki şehirleri verebilirdim.&lt;/p&gt;
&lt;p&gt;3nc&amp;uuml; tanımlamada dikkat edileceği &amp;uuml;zere bir parametre de s&amp;ouml;z konusu. B&amp;ouml;ylece HTTP Get&amp;nbsp;talebinde gelen bir parametreyi alıp nasıl kullanabileceğimi de g&amp;ouml;rm&amp;uuml;ş olacaktım.&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;Kodlar&lt;/h1&gt;
&lt;p&gt;Kod i&amp;ccedil;eriğini genel hatları ile ş&amp;ouml;yle &amp;ouml;zetleyebiliriz. Planet ve City isimli iki yapı bulunuyor. Bu yapılara ait test i&amp;ccedil;eriklerinin y&amp;uuml;klendiği bir fonksiyonumuz da var. github adresinden referans edilen httpRouter paketinin nimetlerinden yararlanaraktan localhost:4568 adresinden bir sunucu ayağa kaldırıyoruz. Sunucu yukarıdaki 3 temel talebi alıp işleyecek şekilde &amp;ccedil;alışıyor. Nihayi sonu&amp;ccedil;ta kullanıcılara gezegenleri ve bu gezegenlerdeki &amp;ouml;nemli şehirleri g&amp;ouml;stermeyi planlıyoruz. T&amp;uuml;m kod i&amp;ccedil;eriğini aşağıda g&amp;ouml;rebilirsiniz.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	"net/http"
	"strings"

	"github.com/julienschmidt/httprouter"
)

func main() {
	router := httprouter.New()              
	router.GET("/", Index)                  
	router.GET("/planets", GetPlanets)      
	router.GET("/planets/:name", GetCities) 
	http.ListenAndServe(":4568", router)    
}

func GetCities(response http.ResponseWriter, request *http.Request, params httprouter.Params) {
	planetName := params.ByName("name") 
	planets := LoadSomeData()
	fmt.Fprintf(response, `&amp;lt;html&amp;gt;&amp;lt;head&amp;gt;&amp;lt;title&amp;gt;%s&amp;lt;/title&amp;gt;&amp;lt;/head&amp;gt;&amp;lt;body&amp;gt;&amp;lt;h1&amp;gt;%s&amp;lt;/h1&amp;gt;`, planetName, planetName)
	for _, planet := range planets {
		if strings.ToLower(planet.Name) == strings.ToLower(planetName) {
			for _, city := range planet.Cities {
				fmt.Fprintf(response, `&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;%s&amp;lt;/b&amp;gt;-%s&amp;lt;/p&amp;gt;`, city.Name, city.Affiliation)
			}
			break
		}
	}
	fmt.Fprintf(response, `&amp;lt;/body&amp;gt;&amp;lt;/html&amp;gt;`)
}

func GetPlanets(response http.ResponseWriter, request *http.Request, params httprouter.Params) {
	planets := LoadSomeData() 
	fmt.Fprintf(response, `&amp;lt;html&amp;gt;&amp;lt;head&amp;gt;&amp;lt;title&amp;gt;Planets&amp;lt;/title&amp;gt;&amp;lt;/head&amp;gt;&amp;lt;body&amp;gt;&amp;lt;h1&amp;gt;Planets&amp;lt;/h1&amp;gt;`)
	for _, planet := range planets {
		fmt.Fprintf(response, `&amp;lt;p&amp;gt;&amp;lt;a href='planets/%s'&amp;gt;%s-%s (%d)&amp;lt;/p&amp;gt;`, planet.Name, planet.Name, planet.Sector, planet.Population)
	}
	fmt.Fprintf(response, `&amp;lt;/body&amp;gt;&amp;lt;/html&amp;gt;`)
}

func Index(response http.ResponseWriter, request *http.Request, params httprouter.Params) {
	fmt.Fprintf(response, `&amp;lt;html&amp;gt;
		&amp;lt;body&amp;gt;
		&amp;lt;head&amp;gt;
			&amp;lt;title&amp;gt;Star Wars Planets&amp;lt;/title&amp;gt;
		&amp;lt;/head&amp;gt;
		&amp;lt;body&amp;gt;
			&amp;lt;h1&amp;gt;Star Wars Planets&amp;lt;/h1&amp;gt;
			&amp;lt;a href="/planets"&amp;gt;Planets&amp;lt;/a&amp;gt;&amp;lt;br/&amp;gt;
			&amp;lt;p&amp;gt;Planet list updates every morning with new planets&amp;lt;/p&amp;gt;
		&amp;lt;/body&amp;gt;
		&amp;lt;/html&amp;gt;`)
}

func LoadSomeData() []Planet {
	var planets []Planet

	planets = append(planets, Planet{Name: "Naboo", Sector: "Chommel", Population: 4500000,
		Cities: []City{
			City{Id: 1, Name: "Theed", Affiliation: "Galactic Empire"},
			City{Id: 2, Name: "Umberbool City", Affiliation: "Gungan Grand Army"},
			City{Id: 3, Name: "Spinnaker", Affiliation: "Galactic Empire"},
			City{Id: 4, Name: "Otoh Gunga", Affiliation: "Trade Federation"},
		}})

	planets = append(planets, Planet{Name: "Coruscant", Sector: "Corusca", Population: 1000000000,
		Cities: []City{
			City{Id: 1, Name: "Galactic City", Affiliation: "Rebellian"},
		}})

	planets = append(planets, Planet{Name: "Mustafar", Sector: "Atravis", Population: 20000,
		Cities: []City{
			City{Id: 1, Name: "Fralideja", Affiliation: "Rise of Empire"},
		}})

	return planets
}

type Planet struct {
	Name       string
	Sector     string
	Population int64
	Cities     []City
}

type City struct {
	Id          int
	Name        string
	Affiliation string
}&lt;/pre&gt;
&lt;h1&gt;Kodda Neler Oluyor?&lt;/h1&gt;
&lt;p&gt;&amp;Ouml;ncelikle bu go dosyasının github &amp;uuml;zerinden bir paketi import ettiğini belirtelim. LiteIDE kullananlar bu anlamda şanslılar. Nitekim paketin adını doğru şekilde yazdıysak, Build-Get men&amp;uuml; se&amp;ccedil;eneğini kullanarak referans edilen paketlerin sisteme otomatik olarak indirilmesini ve kurulmasını sağlayabiliyoruz&lt;em&gt;(Hatta LiteIDE'nin otomatik formatlama &amp;ouml;zelliğinin github paketinin &amp;ouml;n&amp;uuml;ne boş bir satır koyduğunu fark ettim. Ben &amp;uuml;ste &amp;ccedil;ıkartsam da o boşluk konuldu. Fark ettim ki bu şekilde bakınca built-in paketler ile harici paketleri g&amp;ouml;zle ayırt etmek &amp;ccedil;ok kolaylaşıyor. İnce ve g&amp;uuml;zel d&amp;uuml;ş&amp;uuml;n&amp;uuml;lm&amp;uuml;ş)&lt;/em&gt; main fonksiyonunda ilk olarak bir&amp;nbsp;Router nesnesi &amp;ouml;rnekleniyor. Bu nesnenin GET, POST, PUT, DELETE, PATCH gibi &amp;ccedil;eşitli HTTP taleplerine cevap verebilecek fonksiyonları bulunuyor. &amp;Ouml;rnekte sadece GET talepleri ele alınıyor ki bu sayede basit bir REST servisinin yolu da a&amp;ccedil;ılmış oluyor. Lakin biz &amp;ouml;rneğimizde istemcilere HTML &amp;ccedil;ıktısı vereceğiz.&lt;/p&gt;
&lt;p&gt;Yukarıda bahsettiğimiz t&amp;uuml;m adresleri GET fonksiyonunun ilk parametresi olarak kullanıyoruz. Eğer dinamik bir url parametresi s&amp;ouml;z konusu ise :ParametreAdı notasyonunu kullanıyoruz. Bu notasyon tahmin edileceği &amp;uuml;zere y&amp;ouml;nlendirmenin yapıldığı fonksiyonda ele alınacak. İkinci parametreler ile Index, GetPlanets ve GetCities fonksiyonlarına y&amp;ouml;nlendirmeler yapmaktayız. Pek tabii son olarak yerel makinedeki bir portu dinlemek &amp;uuml;zere sunucuyu ayağa kaldırıyoruz. Burada standart http.ListenAndServe fonksiyonunu kullanmaktayız. Dikkat edilmesi gereken nokta ikinci parametreye router değişkeninin yazılmış olması. Dolayısıyla ayağa kalkan sunucuya gelen taleplerin Router nesne &amp;ouml;rneği tarafından ele alınacağını bildirmiş oluyoruz&lt;em&gt;(Basit bir injection yapıldı sanki?)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Index, GetPlanets ve GetCities fonksiyonlarının parametre yapıları aynı. 3nc&amp;uuml; parametrelerde url &amp;uuml;zerinden gelecek :ParametreAdi formasyonundaki değişkenleri yakalayabiliyoruz ki GetCities fonksiyonunda bir gezegen adını alıp o gezegendeki şehirleri listelemek i&amp;ccedil;in kullanmaktayız. Index fonksiyonu &amp;ccedil;ok &amp;ccedil;ok basit bir HTML i&amp;ccedil;eriğini fmt paketinin Fprintf yordamı ile ResponseWriter &amp;uuml;zerinden istemciye basmakta. Burada esprilekt&amp;uuml;el bir şey yok diyebiliriz. GetPlanets fonksiyonunda ise, LoadSomeData ile y&amp;uuml;klediğimiz slice i&amp;ccedil;eriğini for d&amp;ouml;ng&amp;uuml;s&amp;uuml; yardımıyla hazırlayarak istemciye g&amp;ouml;ndermekteyiz. for d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml;n &amp;ouml;n&amp;uuml;nde&amp;nbsp;ve sonrasında tipik olarak HTML paketini hazırlıyoruz&lt;em&gt;(ki &amp;ccedil;ok daha şekilli hale getirilebilir. CSS giydirmeyi deneyin)&lt;/em&gt; D&amp;ouml;ng&amp;uuml; i&amp;ccedil;erisinde ise her bir gezegenin adını, hangi sekt&amp;ouml;rde bulunduğunu ve toplam n&amp;uuml;fusunu yazdırıyoruz. Bunu yaparken de bir hyperlink haline getiriyoruz. Link elementinin bağlantısı ise dikkate değer. planets/[gezegenAdı] şeklinde bir yazım s&amp;ouml;z konusu. Bu yazım ile GetCities fonksiyonu tarafından ele alınacak url bilgisini oluşturmaktayız. GetCities fonksiyonunda, gezegen adını url'den belirtildiği şekilde almak i&amp;ccedil;in params.GetName fonskiyonuna başvurmaktayız. Yine for d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile slice i&amp;ccedil;eriğini dolaşıp aranan gezegene geldikten sonra ilgili gezegene ait şehirler dizisinde dolaşıyor ve belirli HTML elementlerini &amp;uuml;retip ekrana bastırıyoruz.&lt;/p&gt;
&lt;h1&gt;&amp;Ccedil;alışma Zamanı&lt;/h1&gt;
&lt;p&gt;Geldik işin eğlenceli kısmına. &amp;Ouml;nce go uygulamasını build edip &amp;ccedil;alıştıralım. Sonrasında ilk talebi 4568 nolu porta g&amp;ouml;ndererek ilerleyelim. Aşağıdakine benzer bir sonu&amp;ccedil;la karşılaşmalıyız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/05/gorouting_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Index sayfasının i&amp;ccedil;eriğini başarılı bir şekilde yolladık. Planets bağlantısına basarsak bu kez GetPlanets fonksiyonunun devreye girip aşağıdaki &amp;ccedil;ıktıyı &amp;uuml;rettiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z. &amp;Ouml;rnek gezegenlerimizin tamamı geldi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/05/gorouting3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu gezegen linklerine bastığımızda da &amp;ouml;nemli şehirlerinin listesini getirecek GetCities fonksiyonunun &amp;ccedil;ıktıları ile karşılaşırız. &amp;Ouml;rnek iki tanesini aşağıda g&amp;ouml;rebilirsiniz.&lt;/p&gt;
&lt;p&gt;Naboo&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/05/gorouting4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve Mustafar&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/05/gorouting5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Elbette olmayan bir gezegen adını bilin&amp;ccedil;li olarak girersek aşağıdaki &amp;ccedil;ıktıyı&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/05/goroutine6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ya da /Planets yerine hatalı bir giriş yaparsak da &lt;strong&gt;"404 page not found"&lt;/strong&gt; cevabını alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/05/goroutine7.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Neler Eksik?&lt;/h1&gt;
&lt;p&gt;Aslında kurguladığımız d&amp;uuml;zenek modern&lt;em&gt;(querystring kullanmayan, okunaklı url i&amp;ccedil;erikleri olarak d&amp;uuml;ş&amp;uuml;nebiliriz)&lt;/em&gt; HTTP Get taleplerini alıp HTML i&amp;ccedil;erikleri &amp;uuml;reten basit bir web sunucusu. &amp;Ccedil;ok doğal olarak eş zamanlı gelecek milyonlarca talep s&amp;ouml;z konusu olduğunda bunu farklı bir şekilde ele almak gerekir. Kodda kullandığımız Planet-City ilişkili yapılar bellekte tutulan nesnel koleksiyonlar. Bu i&amp;ccedil;eriklerin bir veritabanı sisteminden&lt;em&gt;(SQLite olur, NoSQL tabanlı bir k&amp;uuml;me olur, Google'ın Cloud &amp;ccedil;&amp;ouml;z&amp;uuml;mlerinden Firebase olur vs)&lt;/em&gt; alınması daha &amp;ccedil;ok tercih edilir bir durumdur. SQLite ile ilgili &amp;ccedil;alışmaları da &amp;ouml;ğrenmeye başladım. Umarım burada paylaşabilirim. Kullanılan HTML i&amp;ccedil;eriklerinin dinamik &amp;uuml;retimleri i&amp;ccedil;in şablonlardan&lt;em&gt;(Templates)&lt;/em&gt; faydalanıp g&amp;ouml;rselliğin CSS'ler ile daha da keyifli hale getirilmesi sağlanabilir. Gezegen ve şehir fotoğraflarının koyulması bile acayip fark yaratabilir. Bu y&amp;ouml;nlendirme tekniklerinden yola &amp;ccedil;ıkarak tamamen veri-odaklı bir REST servisinin geliştirilmesi de m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Veriler pekala JSON formatında kolayca basılabilir. Bu g&amp;uuml;zel konuları siz değerli okurlarıma armağan ediyorum. Bir başka makalemizde g&amp;ouml;r&amp;uuml;şmek &amp;uuml;zere hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-06-26 10:30:00</pubDate>
  <slug>golang-yonlendiriciler-routers</slug>
  <tags>
    <tag>golang</tag>
    <tag>go-programming-language</tag>
    <tag>web-programming-model</tag>
    <tag>http</tag>
    <tag>router</tag>
    <tag>httprouter</tag>
    <tag>http-get</tag>
  </tags>
  <categories>
    <category>GoLang</category>
  </categories>
</post>