<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WF 4.0 - Bookmarks [RC]</title>
  <description>Çalışmakta olduğum yazılım şirketinin çok yakınında kocaman bir alışveriş merkezi bulunmakta. Bazen öğle yemekleri için alışveriş merkezinin tahsis ettiği servisler ile oraya gidiyoruz. Alışveriş merkezi olduğu için tehlikeli bir yer olduğunu da söyleyebiliriz.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f2%2fblg154_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alışmakta olduğum yazılım şirketinin &amp;ccedil;ok yakınında kocaman bir alışveriş merkezi bulunmakta. Bazen &amp;ouml;ğle yemekleri i&amp;ccedil;in alışveriş merkezinin tahsis ettiği servisler ile oraya gidiyoruz. Alışveriş merkezi olduğu i&amp;ccedil;in tehlikeli bir yer olduğunu da s&amp;ouml;yleyebiliriz. &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt; Nitekim &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k bir yer ve A' dan Z'ye herşey bulunabilmekte. Arkadaşlarım ile sık uğradığım mekanlardan birisi de D&amp;amp;R kitap evi. &amp;Ccedil;oğunlukla aylık dergilerimi almak i&amp;ccedil;in uğramaktayım &lt;em&gt;(Aslında T&amp;uuml;rkiye' de Amazon gibi bir kitap dağıtım evi olmadığı i&amp;ccedil;in &amp;ccedil;ok şanslı olduğumu d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Her halde &amp;ouml;yle bir yer a&amp;ccedil;ılsa kazancımın &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k bir kısmı meslek kitaplarına gider)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;en g&amp;uuml;n yine Bilim Teknik, NTV Bilim ve NG dergilerimi almak &amp;uuml;zere oradaydım. Sırada beklerken kasada &amp;uuml;cretsiz olarak verilen kitap ayra&amp;ccedil;larını farkettim. Hep g&amp;ouml;r&amp;uuml;rd&amp;uuml;m ama bu g&amp;uuml;n biraz daha anlamlı geliyorlardı. &amp;Uuml;zelerinde &amp;ccedil;eşitli reklamlar veya faydalı bilgiler bulunan bu ayra&amp;ccedil;lar yardımıyla&lt;em&gt;(ki &lt;strong&gt;Bookmark &lt;/strong&gt;diyebilir miyiz acaba? &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;)&lt;/em&gt;, okuduğumuz kitabın neresinde kaldığımızı kolayca hatırlayabildiğimizi d&amp;uuml;ş&amp;uuml;nmeye başladım. Derken evde uzun s&amp;uuml;redir el değdirip kaldığım yerden devam edemediğim kitaplarım aklıma geldi. H&amp;uuml;z&amp;uuml;nlendim...&lt;img title="Tongue out" src="/editors/tiny_mce3/plugins/emotions/img/smiley-tongue-out.gif" alt="Tongue out" border="0" /&gt; Tesad&amp;uuml;fe bakın ki bu kitapları okumak baya uzun s&amp;uuml;rm&amp;uuml;şt&amp;uuml;. Zamanın neresinde okumaya başladığımı pek hatırlamamakla birlikte, neresinde kaldığımı da hatırlamadığım bir ka&amp;ccedil; kitap...Tesad&amp;uuml;fe bakın ki bu uzun s&amp;uuml;recin benzeri Workflow Uygulamalarında da s&amp;ouml;z konusu olabilmekteydi. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında&lt;strong&gt; .Net Framework 3.5&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nde &lt;strong&gt;Uzun S&amp;uuml;reli İşemlerin(Long Running Process) &lt;/strong&gt;i&amp;ccedil;in &lt;strong&gt;ExternalDataExchangeService &lt;/strong&gt;veya &lt;strong&gt;WorkflowQueue&lt;/strong&gt; tiplerinden yararlanılmaktadır. Ne varki &lt;strong&gt;Workflow Foundation 4.0&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nde, geliştiricilerin kulağına daha hoş gelen &lt;strong&gt;Bookmark &lt;/strong&gt;kavramı ile karşılaşmaktayız. Peki &lt;strong&gt;Bookmark &lt;/strong&gt;nedir? Ne işe yaramaktadır? Nasıl kullanılmaktadır? Konuyu anlamanın belki de en kolay yolu her zaman ki gibi basit bir &amp;ouml;rnek &amp;uuml;zerinden ilerlemekle olacaktır. Bu nedenle Bookmark kavramının tanımlamasını yazımızın sonunda yapmaya &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Bookmark &lt;/strong&gt;kullanımında &amp;ouml;nemli olan noktalardan birisi, ge&amp;ccedil;ici olarak duraksatılabilecek(Pause) &lt;strong&gt;Activity &lt;/strong&gt;bileşeninin &lt;strong&gt;Workflow' &lt;/strong&gt;un &amp;ccedil;alışma zamanı i&amp;ccedil;eriğine ulaşabiliyor olmasıdır. Bu nedenle en uygun aktivite bileşenleri, &lt;strong&gt;NativeActivity(veya NativeActivity&amp;lt;T&amp;gt;) &lt;/strong&gt;t&amp;uuml;revli olanlardır. Bunu ilk gereksinimimiz olarak d&amp;uuml;ş&amp;uuml;nebiliriz. Aşağıdaki diagramda&lt;strong&gt; .Net Framework 4.0 RC &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml; i&amp;ccedil;erisinde yer alan &lt;strong&gt;NativeActivity &lt;/strong&gt;tipleri ve &amp;uuml;yeleri g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg154_ClassDiagram.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi bu t&amp;uuml;retmeyi kullanarak aşağıdaki kod par&amp;ccedil;asında g&amp;ouml;r&amp;uuml;len aktivite bileşenini geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim. İlgili &amp;ouml;rneğin bir &lt;strong&gt;Workflow Console Application &lt;/strong&gt;&amp;uuml;zerinden geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Activities;

namespace HelloBookmarks
{

    public sealed class ResizeImageActivity 
        : NativeActivity
    {
        protected override bool CanInduceIdle
        {
            get
            {
                return true;
            }
        }

        protected override void Execute(NativeActivityContext context)
        {
            Console.WriteLine("Resize Image bir takım işlemler yapıyor");
            // Bazı işlemler
            // İkinci parametre BookmarkCallback temsilcisi tarafından işaret edilen bir fonksiyondur.
            context.CreateBookmark("ResizeImageBookmark",                
                (nac, b, obj) =&amp;gt;
                {
                    Console.WriteLine("Resume edilen bookmark adı {0}",b.Name);                    
                }
            );
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Bookmark &lt;/strong&gt;işlemleri &lt;strong&gt;Idle &lt;/strong&gt;konuma d&amp;uuml;şebilen &lt;strong&gt;Workflow &lt;/strong&gt;aktivitelerinde işe yarayacak bir teknik olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmelidir. Nitekim bir aktivite i&amp;ccedil;erisinde herhangibir zamanda &lt;strong&gt;Pause &lt;/strong&gt;etme ve sonraki bir anda &lt;strong&gt;Resume &lt;/strong&gt;etme s&amp;ouml;z operasyonları konusudur. Bu sebepten &lt;strong&gt;CanIncludeIdle &lt;/strong&gt;&amp;ouml;zelliğinin &lt;strong&gt;override &lt;/strong&gt;edilmesi ve geriye &lt;strong&gt;true &lt;/strong&gt;değer d&amp;ouml;nd&amp;uuml;rmesi s&amp;ouml;z konusudur. Aksi durumda &amp;ccedil;alışma zamanında aşağıda g&amp;ouml;r&amp;uuml;len &lt;strong&gt;InvalidOperationException &lt;/strong&gt;hata mesajı alınacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg154_Exception.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;CreateBookmark &lt;/strong&gt;metodunun ikinci parametresi &lt;strong&gt;BookmarkCallback &lt;/strong&gt;tipinden bir&lt;strong&gt; temsilcidir(Delegate)&lt;/strong&gt;. Bu temsilcinin yapısı ise aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;public delegate void BookmarkCallback(System.Activities.NativeActivityContext context, System.Activities.Bookmark bookmark, object value)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re &amp;ouml;rneğimizde yer alan&lt;strong&gt; isimsiz metodun(Anonymous Method)&lt;/strong&gt; ilk parametresi ile &lt;strong&gt;Activity&lt;/strong&gt;' nin &amp;ccedil;alışma zamanındaki &amp;ccedil;evresel i&amp;ccedil;eriğine, ikinci parametre ilede &lt;strong&gt;Bookmark &lt;/strong&gt;&amp;ouml;rneğine erişilebilir. Bu temsilci aslında bir &lt;strong&gt;geri bildirim metodunu(Callback Method)&lt;/strong&gt; işaret etmektedir. Bir başka deyişle, &lt;strong&gt;Idle &lt;/strong&gt;konumda kalan &lt;strong&gt;Activity &lt;/strong&gt;&amp;ouml;rneğinin tekrar &lt;strong&gt;Resume &lt;/strong&gt;edilmesi halinde devreye girecek olan metod olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Dolayısıyla geri bildirim metodu i&amp;ccedil;erisinde &lt;strong&gt;CreateBookmark &lt;/strong&gt;tarafında saklanan bazı varlıkların tekrardan y&amp;uuml;klenmesi, hazırlanması gibi operasyonlar ele alınabilir. &lt;strong&gt;CreateBookmark&lt;/strong&gt; metodunun aslında 8 &lt;strong&gt;aşırı y&amp;uuml;klenmiş(Overload)&lt;/strong&gt; versiyonu bulunmaktadır.&lt;/p&gt;
&lt;p&gt;Diğer versiyonlar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında dikkat &amp;ccedil;eken parametrelerden birisi &lt;strong&gt;BookmarkOptions Enum &lt;/strong&gt;sabitidir. Bu enum sabiti &lt;strong&gt;MultipleResume, NonBlocking &lt;/strong&gt;ve&lt;strong&gt; None &lt;/strong&gt;değerlerinden birisini almaktadır. Varsayılan değer &lt;strong&gt;None' &lt;/strong&gt;dır. &lt;strong&gt;MultipleResume &lt;/strong&gt;olması halinde bir den fazla &lt;strong&gt;Resume &lt;/strong&gt;işlemi yapılabileceği belirtilir. &lt;strong&gt;NonBlocking &lt;/strong&gt;değerine g&amp;ouml;re ilgili aktivite bileşeni &lt;strong&gt;Resume &lt;/strong&gt;edilmemiş olsa dahi &lt;strong&gt;WF' &lt;/strong&gt;in &amp;ccedil;alışacağını belirtilir. Nitekim normal şartlar altında bir aktivite i&amp;ccedil;erisinde oluşturulan &lt;strong&gt;Bookmark'&lt;/strong&gt; ların tamamı &lt;strong&gt;Resume &lt;/strong&gt;edilmediği s&amp;uuml;rece &lt;strong&gt;WF&lt;/strong&gt;' in tamamlanması s&amp;ouml;z konusu değildir. Dilerseniz &lt;strong&gt;MultipleResume &lt;/strong&gt;ve &lt;strong&gt;NonBlocking &lt;/strong&gt;değerlerini bir arada kullanabilirsiniz. Gelelim aktivitenin nasıl kullanılacağına. &amp;Ouml;rneğimizdeki amacımız sadece &lt;strong&gt;Bookmark &lt;/strong&gt;kullanımını g&amp;ouml;rmek olduğundan aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len &lt;strong&gt;Workflow Activity&lt;/strong&gt; i&amp;ccedil;eriğini değerlendirebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg154_Workflow1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Bookmark &lt;/strong&gt;kullanımı yazımızın başında da belirttiğimiz &amp;uuml;zere &lt;strong&gt;uzun s&amp;uuml;reli işlemler(Long Running Process)&lt;/strong&gt; i&amp;ccedil;in anlamlıdır. Bu sebepten &lt;strong&gt;WorkflowApplication &lt;/strong&gt;tipinin kullanılması gerekmektedir. &lt;strong&gt;Workflow Console Application&lt;/strong&gt; tipinden olan uygulamamızda, &amp;ccedil;alışma zamanındaki &lt;strong&gt;Idle &lt;/strong&gt;durumları irdelememiz aslında son derece kolaydır.&lt;strong&gt; Console.ReadLine&lt;/strong&gt; metodu burada &amp;ccedil;ok işe yarayacaktır. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; İşte kod i&amp;ccedil;eriğimiz;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Activities;
using System.Threading;

namespace HelloBookmarks
{

    class Program
    {
        static void Main(string[] args)
        {
            AutoResetEvent rE = new AutoResetEvent(false);
            
            // Workflow &amp;ouml;rneği oluşturlur
            Workflow1 wf1 = new Workflow1();
            // Workflow Application &amp;ouml;rneği oluşturulur
            WorkflowApplication wfApp = new WorkflowApplication(wf1);
            // Workflow' un tamamlanması sonrası devreye girecek Completed olay metodu
            wfApp.Completed = (e) =&amp;gt; { rE.Set(); }; // işlemlerin bittiğine dair bilgilendirme i&amp;ccedil;in AutoResetEvent &amp;ouml;rneğinin Set metodu &amp;ccedil;ağırılır.
            // Workflow &amp;ccedil;alışma zamanı başlatılır dolayısıyla Workflow1 &amp;ouml;rneği y&amp;uuml;r&amp;uuml;t&amp;uuml;l&amp;uuml;r
            wfApp.Run();            
            Console.WriteLine("Bir s&amp;uuml;re bekleyin...");
            Console.ReadLine(); // Bu noktada Workflow1 &amp;ouml;rneğinin Idle konuma ge&amp;ccedil;mesi s&amp;ouml;z konusudur.
            
            /* Kullanıcı devam etmek istediğinde Bookmark' lanan Workflow1 &amp;ouml;rneğine tekrardan hayata ge&amp;ccedil;irilir. ResumeBookmark metodunun ilk parametresi dikkat edileceği &amp;uuml;zere ResizeImageActivity i&amp;ccedil;erisinde kullanılan Bookmark adıdır. Bu adın aslında aktivite bileşeni i&amp;ccedil;erisinden &amp;ccedil;alışma zamanı ortamına verilmesi(&amp;ouml;rneğin bir OutArgument) ile faydalı olabilir. İkinci parametre ise hangi Workflow &amp;ouml;rneğinin Resume edileceğidir. Buna g&amp;ouml;re Workflow1 i&amp;ccedil;erisinde ResizeImageBookmark isimli Bookmark' ın yer aldığı aktivite bileşeninin Resume edilmesi s&amp;ouml;z konusudur. */
            BookmarkResumptionResult result = wfApp.ResumeBookmark("ResizeImageBookmark", wf1);
            // ResumeBookmark metodunun sonucu olan Enum sabitinin değerine g&amp;ouml;re bir işlem yapılabilir
            switch (result)
            {
                case BookmarkResumptionResult.NotFound:
                    Console.WriteLine("Not Found");
                    break;
                case BookmarkResumptionResult.NotReady:
                    Console.WriteLine("Not Ready");
                    break;
                case BookmarkResumptionResult.Success:
                    Console.WriteLine("Success");
                    break;
                default:
                    break;
            }
            
            // Eğer Workflow Application' ın beklediği &amp;ccedil;alışan &amp;ouml;rnekler var ise bunların tamamlanması beklenir
            rE.WaitOne();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Aslında &amp;ouml;rnek kodumuz &lt;strong&gt;Workflow1 &lt;/strong&gt;tipinden bir nesne &amp;ouml;rneğini &amp;ccedil;alıştırmakta ve yaşamı i&amp;ccedil;erisinde kullanıcından belirli s&amp;uuml;reliğine tuşa basmasını beklemektedir. Tuşa basmayı beklediği sırada ise &lt;strong&gt;Idle &lt;/strong&gt;olabilen bileşenlerin bu konuma ge&amp;ccedil;mesi s&amp;ouml;z konusudur. &lt;strong&gt;ResumeBookmark &lt;/strong&gt;&amp;ccedil;ağrısından sonra ise &lt;strong&gt;Bookmark &lt;/strong&gt;ile Pause konumda duran aktivitenin ilgili geri bildirim metodunun &amp;ccedil;ağırılması ve dolayısıyla y&amp;uuml;r&amp;uuml;t&amp;uuml;lmeye devam edilmesi sağlanır. İşte &amp;ouml;rnek program kodumuzun &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg154_Runtime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu arada &amp;ccedil;alışma zamanında aktif olan &lt;strong&gt;Bookmark &lt;/strong&gt;listesini de &lt;strong&gt;WorkflowApplication &lt;/strong&gt;nesne &amp;ouml;rneğine ait &lt;strong&gt;GetBookmarks &lt;/strong&gt;metodu &amp;uuml;zerinden alabileceğinizi belirtmek isterim. Aşağıdaki kod par&amp;ccedil;asında bu durum &amp;ouml;rneklenmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Activities;
using System.Threading;
using System.Activities.Hosting;

namespace HelloBookmarks
{
    class Program
    {
        static void Main(string[] args)
        {
            AutoResetEvent rE = new AutoResetEvent(false);                        
            Workflow1 wf1 = new Workflow1();
            WorkflowApplication wfApp = new WorkflowApplication(wf1);
            wfApp.Completed = (e) =&amp;gt; { rE.Set(); }; // işlemlerin bittiğine dair bilgilendirme i&amp;ccedil;in AutoResetEvent &amp;ouml;rneğinin Set metodu &amp;ccedil;ağırılır.
            wfApp.Run();            
            Console.WriteLine("Bir s&amp;uuml;re bekleyin...");
            Console.ReadLine(); 
            foreach (BookmarkInfo bm in wfApp.GetBookmarks())
            {
                Console.WriteLine(bm.BookmarkName);
            }            
...&lt;/pre&gt;
&lt;p&gt;Şimdi &amp;ouml;rneğimizi biraz daha ilgin&amp;ccedil; bir hale getirelim. &amp;Ouml;ncelikli olarak aşağıdaki kod i&amp;ccedil;eriğine sahip&lt;strong&gt; Custom Activity&lt;/strong&gt; sınıfını oluşturarak projemize ilave edelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Activities;

namespace HelloBookmarks
{

    public sealed class SendImageActivity 
        : NativeActivity
    {        
        protected override bool CanInduceIdle
        {
            get
            {
                return true;
            }
        }

        protected override void Execute(NativeActivityContext context)
        {
            Console.WriteLine("Send Image bir takım işlemler yapıyor");
            context.CreateBookmark("SendImageBookmark",                
                (nac, b, obj) =&amp;gt;
                {
                    Console.WriteLine("Resume edilen bookmark adı {0}",b.Name);                    
                }
            );
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;ResizeImageActivity &lt;/strong&gt;tipinin tıpkısının aynısı olan bu bileşeni de ele alarak &lt;strong&gt;Workflow1 &lt;/strong&gt;i&amp;ccedil;eriğini aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi değiştirelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg154_Workflow1Last.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu sefer aynı anda birden fazla aktivitenin &amp;ccedil;alıştırılmasına izin veren &lt;strong&gt;Parallel &lt;/strong&gt;bileşeninden yararlanmaktayız. İncelemek istediğimiz nokta ise şu; her iki aktivite de &lt;strong&gt;Execute &lt;/strong&gt;metodları i&amp;ccedil;erisinde birer &lt;strong&gt;Bookmark&lt;/strong&gt; oluşturmaktadır. Buna g&amp;ouml;re program kodumuzda birden fazla &lt;strong&gt;Bookmark&lt;/strong&gt;' ın nasıl ele alınacağına bakmak istiyoruz. S&amp;ouml;z konusu vakayı analiz etmek i&amp;ccedil;in, &lt;strong&gt;Main &lt;/strong&gt;metoduna ait kod i&amp;ccedil;eriğini aşağıdaki gibi değiştirmemiz yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Activities;
using System.Threading;
using System.Activities.Hosting;

namespace HelloBookmarks
{
    class Program
    {
        static void Main(string[] args)
        {
            AutoResetEvent rE = new AutoResetEvent(false);            
            Workflow1 wf1 = new Workflow1();
            WorkflowApplication wfApp = new WorkflowApplication(wf1);
            wfApp.Completed = (e) =&amp;gt; { rE.Set(); };
            wfApp.Run();            
            Console.WriteLine("Bir s&amp;uuml;re bekleyin...");
            Console.ReadLine();
            Console.WriteLine("***Etkin Bookmark Listesi***");
            foreach (BookmarkInfo bm in wfApp.GetBookmarks())
            {
                Console.WriteLine("Bookmark Name:{0}, Owner:{1}",bm.BookmarkName,bm.OwnerDisplayName.ToString());
            }
            Console.WriteLine();
            
            BookmarkResumptionResult result1 = wfApp.ResumeBookmark("ResizeImageBookmark", wf1);
            BookmarkResumptionResult result2 = wfApp.ResumeBookmark("SendImageBookmark", wf1);

            Console.WriteLine("ResizeImageBookmark i&amp;ccedil;in Resume Result : {0}",result1.ToString());
            Console.WriteLine("SendImageBookmark i&amp;ccedil;in Resume Result : {0}", result2.ToString());

            rE.WaitOne();
            Console.ReadLine();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Ve işte &amp;ccedil;alışma zamanı sonu&amp;ccedil;ları;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg154_Runtime2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ıktımıza g&amp;ouml;re her iki akitivite bileşeni, eş zamanlı olarak &lt;strong&gt;Execute &lt;/strong&gt;metodlarını icra etmiş ve birer &lt;strong&gt;Bookmark &lt;/strong&gt;oluşturmuştur. Sonrasında kullanıcının tuşa basması ile devam eden s&amp;uuml;re&amp;ccedil;te ilk olarak y&amp;uuml;kl&amp;uuml; olan &lt;strong&gt;Bookmark&lt;/strong&gt;' lar listelenmiş ve ardından &lt;strong&gt;ResumeBookmark &lt;/strong&gt;&amp;ccedil;ağrıları nedeniyle &lt;strong&gt;Pause &lt;/strong&gt;edilmiş olan aktivitelerin geri bildirim operasyonları devreye girmiştir. Her iki &lt;strong&gt;Bookmark&lt;/strong&gt;' ında &lt;strong&gt;Resume &lt;/strong&gt;edilmesinin sonucu olarak &lt;strong&gt;Workflow1 &lt;/strong&gt;&amp;ouml;rneğinin işlemlerini tamamladığı anlaşılmaktadır. Program kodu da buna g&amp;ouml;re sonlanır.&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi bir aktivitenin &lt;strong&gt;Bookmark&lt;/strong&gt;' lanması aslında isimlendirilmiş duraksama noktalarına(Named Pause Points) sahip olması anlamına gelmektedir. &amp;Ouml;yleki, &lt;strong&gt;ResumeBookmark &lt;/strong&gt;metodu sayesinde &lt;strong&gt;Pause &lt;/strong&gt;edilen noktadan tekrar y&amp;uuml;r&amp;uuml;t&amp;uuml;lmeleri sağlanabilir. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f2%2fHelloBookmarks.rar"&gt;HelloBookmarks.rar (54,52 kb)&lt;/a&gt;&lt;strong&gt; [&amp;Ouml;rnek Visual Studio 2010 Ultimate RC s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde geliştirilmiş ve test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-02-19 05:04:00</pubDate>
  <slug>WF-40-Bookmarks</slug>
  <tags>
    <tag>workflow-foundation</tag>
    <tag>wf-40</tag>
    <tag>wf</tag>
  </tags>
  <categories>
    <category>WF 4.0 RC</category>
  </categories>
</post>