<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF WebHttp Services - Server Bazlı Cache</title>
  <description>Bir süredir WCF Eco System' in parçaları üzerinde yazmakta olduğum bir seri bulunmaktaydı. Bunu devam ettirmek ile Cuma gecesini güzelce tamamlayabileceğimi düşündüm. İşte bu günkü konumuz...WCF WebHttp Service' lerinde ön bellekleme(Output Caching)</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f1%2fblg143_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Şirketimi &amp;ccedil;ok seviyorum. Nazar değmesin ama araştırma yapmam, yeni bir şeyler &amp;ouml;ğrenmem ve bunları ekip arkadaşlarımla paylaşmam&amp;nbsp;i&amp;ccedil;in beni &amp;ouml;zellikle teşvik eden bir şirkette bulunmaktayım.&amp;nbsp;&amp;Ccedil;alıştığım&amp;nbsp;şirketin&amp;nbsp;en g&amp;uuml;zel &amp;ouml;zelliklerinden biriside, &lt;strong&gt;Cuma&lt;/strong&gt; g&amp;uuml;nleri yapılan minik ikramları. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Her cuma değişik bir yiyecek ile karşılaşıyoruz. Ge&amp;ccedil;tiğimiz Cuma' lardan birisinde ise yanda &amp;ccedil;ektiğim resimde g&amp;ouml;r&amp;uuml;len g&amp;uuml;len kurabiyelerimiz vardı. E b&amp;ouml;ylesine g&amp;uuml;ler y&amp;uuml;zl&amp;uuml; kurabiyeler ile gerekli glikozu aldıktan sonra i&amp;ccedil;imden hemen eve gitmek gelmedi. Bunun yerine mesai sonrasında &amp;ccedil;alışma masamda oturup, etrafın sakinleşmesi ve sessizliğin artması ile birlikte bloğuma bir şeyler yazmaya karar verdim. Bir s&amp;uuml;redir &lt;strong&gt;WCF Eco System&lt;/strong&gt;' in par&amp;ccedil;aları &amp;uuml;zerinde yazmakta olduğum bir seri bulunmaktaydı. Bunu devam ettirmek ile &lt;strong&gt;Cuma&lt;/strong&gt; gecesini g&amp;uuml;zelce tamamlayabileceğimi d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m. İşte bu g&amp;uuml;nk&amp;uuml; konumuz...&lt;strong&gt;WCF WebHttp Service&lt;/strong&gt;' lerinde &lt;strong&gt;&amp;ouml;n bellekleme(Output Caching)&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF WebHttp Service'&lt;/strong&gt; leri bildiğiniz &amp;uuml;zere &lt;strong&gt;Web&lt;/strong&gt; ortamı &amp;uuml;zerinden sunulan hizmetlerdir. Bu sebepten &lt;strong&gt;Web&lt;/strong&gt; tarafının sunucu ve istemci bazlı bazı yeteneklerini kullanabilirler. &amp;Ouml;rneğin&lt;strong&gt; Asp.Net Compatibility Mode&lt;/strong&gt; ile &amp;ccedil;alıştırıldıklarında &lt;strong&gt;Asp.Net&lt;/strong&gt; d&amp;uuml;nyasının&amp;nbsp;&lt;strong&gt;Output Cache&lt;/strong&gt; yeteneğine sahip olurlar. Bildiğiniz &amp;uuml;zere &lt;strong&gt;Output Cache&lt;/strong&gt; mekanizması sayesinde &lt;strong&gt;Web&lt;/strong&gt; i&amp;ccedil;eriklerine gelen taleplerin &amp;ouml;n bellekten karşılanması ve bu sayede arka planda ilgili &lt;strong&gt;HTML&lt;/strong&gt; &amp;ccedil;ıktılarının &amp;uuml;retilmesi i&amp;ccedil;in gerekli işlemlerin otomatikman atlanılması sağlanabilmektedir. Bu, &amp;ouml;zellikle &amp;uuml;retim maliyeti y&amp;uuml;ksek olan ama belirli bir s&amp;uuml;re zarfı i&amp;ccedil;erisinde değişmeyen sayfa i&amp;ccedil;eriklerinin &amp;uuml;retiminde olduk&amp;ccedil;a performans arttırıcı bir tekniktir. Madem &lt;strong&gt;Web&lt;/strong&gt; tarafında b&amp;ouml;yle bir yeteneğimiz bulunmaktadır, o halde neden bu kabiliyeti &lt;strong&gt;WCF&lt;/strong&gt; Servislerinde de kullanamayalım? İşte bu yazımızda &lt;strong&gt;Asp.Net&lt;/strong&gt; tarafında hazır olan bu alt yapının &lt;strong&gt;WebHttp Service'&lt;/strong&gt; lerinde nasıl kullanıldığını incelemeye &amp;ccedil;alışıyor olacağız. İlk olarak konuyu &lt;strong&gt;sunucu bazlı &amp;ouml;n bellekleme(Server Side Caching)&lt;/strong&gt;&amp;nbsp;olarak değerlendireceğiz. Serinin sonraki b&amp;ouml;l&amp;uuml;m&amp;uuml;nde ise istemci taraflı &amp;ouml;n belleklemeyi ele alacağız. Dilerseniz vakit kaybetmeden kodlamaya başlayalım. &amp;Ouml;ncelikli olarak aşağıdaki &lt;strong&gt;WebHttp Service&lt;/strong&gt; i&amp;ccedil;eriğine sahip bir&lt;strong&gt; WCF REST Service Application&lt;/strong&gt; geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.ServiceModel;
using System.ServiceModel.Activation;
using System.ServiceModel.Web;
using System.Web;

namespace Lesson6
{   
    [ServiceContract]
    [AspNetCompatibilityRequirements(RequirementsMode = AspNetCompatibilityRequirementsMode.Allowed)]
    [ServiceBehavior(InstanceContextMode = InstanceContextMode.PerCall)]
    public class EinsteinService
    {
        // GetCategories isimli metodun &amp;ccedil;ıktısının &amp;ouml;n bellekleneceği AspNetCacheProfile niteliği ile belirtilir. Nitelikte parametre olarak kullanılan string bilgi ile web.config dosyasında bu metod i&amp;ccedil;in nasıl bir &amp;ouml;n bellekleme yapılacağı set edilir. Ne kadar s&amp;uuml;re ile tutulacağı, parametre bazlı olup olmayacağı gibi...
        [AspNetCacheProfile("CategoriesCache")]
        [WebGet(UriTemplate = "Categories")]
        public List&amp;lt;string&amp;gt; GetCategories()
        {            
            string[] categories=File.ReadAllLines(HttpContext.Current.Server.MapPath("~/Kategoriler.txt"));
            return new List&amp;lt;string&amp;gt;(categories);
        }

        [AspNetCacheProfile("CategoriesByFirstLetterCache")]
        [WebGet(UriTemplate = "Categories/{firstLetter}")]
        public List&amp;lt;string&amp;gt; GetCategoriesByFirstLetter(string firstLetter)
        {
            string[] categories = File.ReadAllLines(HttpContext.Current.Server.MapPath("~/Kategoriler.txt"));
            return (from category in categories
                         where category.StartsWith(firstLetter,true,null)
                         select category).ToList();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rneğimizde yer alan servisimizde iki operasyon yer almaktadır. Her iki operasyonda aşağıda &amp;ouml;rnek &amp;ccedil;ıktısı olan &lt;strong&gt;Kategoriler.txt&lt;/strong&gt; isimli text tabanlı dosyayı kullanmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg143_TextContent.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;GetCategories&lt;/strong&gt; operasyonu &lt;strong&gt;text&lt;/strong&gt; dosyası i&amp;ccedil;erisindeki t&amp;uuml;m satırları &lt;strong&gt;string&lt;/strong&gt; tipinden &lt;strong&gt;generic&lt;/strong&gt;&amp;nbsp;&lt;strong&gt;List&lt;/strong&gt; koleksiyonu olarak geriye d&amp;ouml;nd&amp;uuml;rmektedir. &lt;strong&gt;GetCategoriesByFirstLetter&lt;/strong&gt; operasyonu ise aynı &amp;ccedil;ıktıyı baş harflere g&amp;ouml;re &amp;uuml;retmektedir. Bizim odaklanmamız gereken nokta ise her iki operasyon başında uygulanan &lt;strong&gt;AspNetCacheProfile&lt;/strong&gt; &lt;strong&gt;niteliğidir(Attribute)&lt;/strong&gt;. Bu niteliklerin uygulanması ile s&amp;ouml;z konusu operasyonların &amp;ccedil;ıktılarının &amp;ouml;n bellekleneceği, &amp;ccedil;alışma&amp;nbsp;zamanı ortamına&amp;nbsp;bildirilmektedir. Her iki nitelikte birbirlerinden benzersiz olan takma adlar(Alias) ile işaret edilmektedir.&lt;/p&gt;
&lt;p&gt;Peki bu isimleri nerede değerlendireceğiz?&amp;nbsp;Bu sorunun cevabı&amp;nbsp;&lt;strong&gt;Web.config&lt;/strong&gt; dosyasında yer alan &lt;strong&gt;Asp.Net Output Cache&lt;/strong&gt; ayarlarında gizlidir...&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Buradaki ayarlar ile hangi operasyon i&amp;ccedil;in nasıl bir &amp;ouml;n bellekleme işleminin uygulanacağını belirtebiliriz. &amp;Ouml;rneğin operasyonların sonu&amp;ccedil;larının ne kadar s&amp;uuml;reyle &amp;ouml;n bellekte tutulacaklarını farklılaştırabiliriz. Yada parametre bazlı olanları...&amp;Ouml;rneğin &lt;strong&gt;GetCategoriesByFirstLetter&lt;/strong&gt; operasyonunun&amp;nbsp;&amp;ccedil;alışma zamanı &lt;strong&gt;HTML &lt;/strong&gt;&amp;ccedil;ıktılarının&amp;nbsp;&lt;strong&gt;firstLetter&lt;/strong&gt; bilgisine g&amp;ouml;re &amp;ouml;n belleklenebileceğini belirtebiliriz. T&amp;uuml;m bu ayarlamalar i&amp;ccedil;in&lt;strong&gt; web.config&lt;/strong&gt; dosyasına aşağıdaki eklemeleri yapmamız yeterlidir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0"?&amp;gt;
&amp;lt;configuration&amp;gt;  
  &amp;lt;system.web&amp;gt;
    &amp;lt;compilation debug="true" targetFramework="4.0" /&amp;gt;
    &amp;lt;caching&amp;gt;
      &amp;lt;outputCache enableOutputCache="true"/&amp;gt;
      &amp;lt;outputCacheSettings&amp;gt;
        &amp;lt;outputCacheProfiles&amp;gt;
          &amp;lt;add name="CategoriesCache" duration="120" location="Server" varyByParam="none" varyByHeader="Accept"/&amp;gt;
          &amp;lt;add name="CategoriesByFirstLetterCache" duration="300" location="Server" varyByParam="firstLetter" varyByHeader="Accept"/&amp;gt;
        &amp;lt;/outputCacheProfiles&amp;gt;
      &amp;lt;/outputCacheSettings&amp;gt;
    &amp;lt;/caching&amp;gt;
  &amp;lt;/system.web&amp;gt;
  &amp;lt;system.webServer&amp;gt;
    &amp;lt;modules runAllManagedModulesForAllRequests="true"&amp;gt;
      &amp;lt;add name="UrlRoutingModule" type="System.Web.Routing.UrlRoutingModule, System.Web, Version=4.0.0.0, Culture=neutral, PublicKeyToken=b03f5f7f11d50a3a" /&amp;gt;
    &amp;lt;/modules&amp;gt;
  &amp;lt;/system.webServer&amp;gt;

  &amp;lt;system.serviceModel&amp;gt;
    &amp;lt;!--Asp.Net Output Caching alt yapısını ve yeteneklerini kullanmak istediğimiz i&amp;ccedil;in, AspNet Compatibility modun a&amp;ccedil;ık olması &amp;ouml;nemlidir.--&amp;gt;
    &amp;lt;serviceHostingEnvironment aspNetCompatibilityEnabled="true"/&amp;gt;
    &amp;lt;standardEndpoints&amp;gt;
      &amp;lt;webHttpEndpoint&amp;gt;
        &amp;lt;!-- 
            Configure the WCF REST service base address via the global.asax.cs file and the default endpoint 
            via the attributes on the &amp;lt;standardEndpoint&amp;gt; element below
        --&amp;gt;
        &amp;lt;standardEndpoint name="" helpEnabled="true" automaticFormatSelectionEnabled="true"/&amp;gt;
      &amp;lt;/webHttpEndpoint&amp;gt;
    &amp;lt;/standardEndpoints&amp;gt;
  &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Buradaki ayarlamalara g&amp;ouml;re &lt;strong&gt;CategoriesCache&lt;/strong&gt; adı ile belirlenen operasyonlar &lt;strong&gt;120&lt;/strong&gt; saniye s&amp;uuml;reyle &amp;ouml;n bellekten getirilecektir. &amp;Ouml;n bellekleme ortamının sunucu taraflı olduğu &lt;strong&gt;location&lt;/strong&gt; niteliği ile belirtilmektedir. Bu &amp;ouml;n bellek ayarında parametre kullanılmadığı&lt;em&gt;(varyByParam="none")&lt;/em&gt; ve &lt;strong&gt;talebin(request)&lt;/strong&gt; &lt;strong&gt;Header&lt;/strong&gt; kısmına g&amp;ouml;re &lt;strong&gt;Accept&lt;/strong&gt; tipinde olanların&amp;nbsp;g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığı&amp;nbsp;ifade edilmektedir. Diğer yandan &lt;strong&gt;CategoriesByFirstLetterCache&lt;/strong&gt; bildirimine bakıldığında s&amp;uuml;renin &lt;strong&gt;300&lt;/strong&gt; saniye olduğu ama bir &amp;ouml;ncekinden farklı olarak &lt;strong&gt;firstLetter&lt;/strong&gt;&amp;nbsp;parametresine g&amp;ouml;re &amp;ouml;n bellekte ayrı ayrı g&amp;ouml;r&amp;uuml;nt&amp;uuml;ler tutulacağı belirtilmektedir. Buna g&amp;ouml;re &lt;strong&gt;Categories/A&lt;/strong&gt; gibi bir talep ile&lt;strong&gt; Categories/s&lt;/strong&gt; gibi bir taleb i&amp;ccedil;in&amp;nbsp;&amp;uuml;retilen &lt;strong&gt;HTML&lt;/strong&gt; &amp;ccedil;ıktıları &amp;ouml;n bellekte ayrı ayrı tutulacaktır. Tabi birden fazla parametrenin değerlendirilmesi gerektiği durumlarda&lt;strong&gt; ;&lt;/strong&gt; işareti&amp;nbsp;kullanılarak bildirilmeleri gerekmektedir. &amp;Ouml;rneğin &lt;strong&gt;varyByParam="firstLetter;productCount"&lt;/strong&gt; vb.&lt;/p&gt;
&lt;p&gt;Tabi yapımış olduğumuz bu anlatımın sonu&amp;ccedil;larını test ederek g&amp;ouml;rmemiz gerekiyor. Burada &lt;strong&gt;debug&lt;/strong&gt; modu kullanarak talepler sırasında operasyon metodlarının i&amp;ccedil;erisine ne zaman girilip ne zaman girilmediğini tespit ederek gerekli kontrolleri yapabiliriz. İşte size &amp;ouml;rnek test senaryoları;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;1 - &lt;/strong&gt;&amp;Ouml;nce &lt;strong&gt;URL&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;Categories&lt;/strong&gt; talebini g&amp;ouml;nderin. Bu durumda t&amp;uuml;m kategorilerin aşağıdaki şekilde olduğu gibi geldiğini g&amp;ouml;receksiniz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg143_FirstRun.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi &lt;strong&gt;120&lt;/strong&gt; saniyelik s&amp;uuml;re dolmadan &lt;strong&gt;Kategoriler.txt&lt;/strong&gt; &amp;uuml;zerinde bir değişiklik yapın. &amp;Ouml;rneğin &lt;strong&gt;M&amp;uuml;cehver&lt;/strong&gt; isimli yeni bir kategori ekleyin veya bir ka&amp;ccedil; kategorinin ismini değiştirin yada silin. &lt;strong&gt;120&lt;/strong&gt; saniyelik zaman dilimi i&amp;ccedil;erisinde yeniden &lt;strong&gt;Categories&lt;/strong&gt; talebinden bulunursanız yapmış olduğunuz değişiklilerin tarayıcıya&amp;nbsp;getirilmediğini g&amp;ouml;rebilirsiniz. Ancak &lt;strong&gt;120&lt;/strong&gt; saniyelik &amp;ouml;n bellek s&amp;uuml;resi dolduktan sonra değişiklikleri g&amp;ouml;rebileceksiniz ve hatta &lt;strong&gt;Debug&lt;/strong&gt; moddaysanız ilgili operasyon kodu i&amp;ccedil;erisine tekrardan girildiğini fark edeceksiniz. Bu zaten &amp;ouml;n belleklemenin &amp;ccedil;alıştığının ispatıdır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;2 -&lt;/strong&gt; İkinci olarak parametre bazlı &amp;ouml;n bellekleme yapıldığını test edebilirsiniz. Bu ama&amp;ccedil;la tarayıcı &amp;uuml;zerinden &amp;ouml;rneğin &lt;strong&gt;Categories/A&lt;/strong&gt; ve &lt;strong&gt;Categories/M&lt;/strong&gt; taleplerinde bulunun. &lt;strong&gt;Debug&lt;/strong&gt; modda ilerlerseniz testinizi daha başarılı bir şekilde yapabilirsiniz. &amp;Ouml;zellikle &lt;strong&gt;300&lt;/strong&gt; saniyelik &amp;ouml;n bellekleme s&amp;uuml;releri dolmadan farklı harfler ile denemeler yaptığınızda, &amp;ouml;n belleklenenler i&amp;ccedil;in operasyon koduna girilmediğini ama daha &amp;ouml;nceden talep edilmeyenler veya &lt;strong&gt;300&lt;/strong&gt; saniyelik &amp;ouml;n bellekte kalma s&amp;uuml;resini &lt;span style="text-decoration: underline;"&gt;dolduranlar&lt;/span&gt; i&amp;ccedil;in kodun tekrar &amp;ccedil;alıştırıldığını g&amp;ouml;zlemleyebilirsiniz.&lt;/p&gt;
&lt;p&gt;Bu sayede geliştireceğimiz &lt;strong&gt;WebHttp Service'&lt;/strong&gt; lerin operasyonlarının hızlı sonu&amp;ccedil;lar &amp;uuml;reterek daha performanslı ve verimli olmasını sağlayabiliriz. Bu yazımızdaki &amp;ouml;rneğimizde sunucu tarafında &amp;ouml;n bellekleme işlemlerini ger&amp;ccedil;ekleştirdik. Ancak birde &lt;strong&gt;istemci taraflı &amp;ouml;n bellekleme(Client Based Caching)&lt;/strong&gt;&amp;nbsp;işlemlerinin s&amp;ouml;z konusu olduğunu belirtelim. Bunu serinin sonraki yazısında incelemeye &amp;ccedil;alışacağız. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f2%2fLesson6_RC.rar"&gt;Lesson6_RC.rar (20,41 kb)&lt;/a&gt;&amp;nbsp;&lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 &lt;/strong&gt;&lt;strong&gt;Ultimate &lt;/strong&gt;&lt;strong&gt;Beta 2 S&amp;uuml;r&amp;uuml;m&amp;uuml;nde geliştirilmiş ancak RC s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde de test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-03-29 15:05:00</pubDate>
  <slug>WCF-WebHttp-Services-Server-Side-Caching</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-40</tag>
    <tag>webhttp-services</tag>
    <tag>restful</tag>
    <tag>non-soap</tag>
    <tag>wcf-webhttp-services</tag>
  </tags>
  <categories>
    <category>WCF Eco System</category>
    <category>WCF WebHttp Services</category>
  </categories>
</post>