<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Bir Web Uygulamasında Gantt Chart Kullanımı</title>
  <description>Henry Gantt tarafından icat edilen Gantt tabloları, proje takvimlerinin şekilsel gösteriminde kullanılmaktadır. Temel olarak yatay çubuklardan oluşan bu tablolarda proje planlarını, task'ları, süreleri ve ilerleyişi görmek mümkündür. Excel üzerinde bile kullanılabilen Gantt Chart'lar sanıyorum proje yöneticilerinin de vazgeçilmez araçlarındandır. Benim amacım ise dhtmlxGantt isimli Javascript kütüphanesinden yararlanarak bir Asp.Net Core projesinde Gantt Chart kullanmak.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2019/07/23/windofchange2.png" alt="" /&gt;Beğenerek dinlediğim Scorpions grubunun en g&amp;uuml;zel şarkılarından birisidir Wind of Change. Değişim r&amp;uuml;zgarları uzun zamandır&amp;nbsp;hayatımın bir par&amp;ccedil;ası aslında. Sanıyorum ilk olarak 2012 yılında o zamanlar &amp;ccedil;alışmakta olduğum turuncu bankada başlamıştı esintiler. &amp;Ccedil;evik d&amp;ouml;n&amp;uuml;ş&amp;uuml;m s&amp;uuml;reci kapsamında uzun zamandır var olan şelale modelinin ağır ve hantal işleyişi yerine daha hızlı reaksiyon verme kabiliyeti kazanmak i&amp;ccedil;indi her şey. Benzer bir d&amp;ouml;n&amp;uuml;ş&amp;uuml;m s&amp;uuml;reci ge&amp;ccedil;tiğimiz sene i&amp;ccedil;erisinde&amp;nbsp;şu an &amp;ccedil;alışmakta olduğum mavi renkli teknoloji şirketinde de başlatıldı.&lt;/p&gt;
&lt;p&gt;Her iki şirketin bu d&amp;ouml;n&amp;uuml;ş&amp;uuml;m s&amp;uuml;recindeki en b&amp;uuml;y&amp;uuml;k problemi ise oturmuş k&amp;uuml;lt&amp;uuml;rel işleyiş yapısının değişime karşı geliyor olmasıydı. Hal b&amp;ouml;yle olunca her iki firmada dışarıdan yetkin danışmanlıklar&amp;nbsp;alarak d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml; daha az sancılı ge&amp;ccedil;irmeye &amp;ccedil;alıştı. Genelde &amp;ouml;l&amp;ccedil;ek olarak b&amp;uuml;y&amp;uuml;k bir firmaysanız bu tip dijital d&amp;ouml;n&amp;uuml;ş&amp;uuml;mler hem uzun hem de sancılı olabiliyor.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Lakin bu acıyı azaltmak i&amp;ccedil;in yapılanlar bazen bana &amp;ccedil;ok garip gelir. Servisten iner girişe doğru ilerlersiniz. Girdiğiniz andan itibaren masanıza varıncaya dek o dijital d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml;n bilin&amp;ccedil;altınıza yollanan mesajlarını g&amp;ouml;r&amp;uuml;rs&amp;uuml;n&amp;uuml;z. Koridorun&amp;nbsp;duvarında, bindiğiniz asans&amp;ouml;r&amp;uuml;n aynasında, tuvaletin kapısında, tavandan sarkan kartonlarda, takım panolarında, bir &amp;ouml;nceki g&amp;uuml;n dağıtılan mouse pad'lerin &amp;uuml;zerinde, bardağınızda, bilgisayarınızın duvar kağıdında...T&amp;uuml;m eşyalar &amp;ccedil;oktan dijitalleşmiş ve &amp;ccedil;evikleşmiştir esasında ama &amp;ouml;nemli olan bireyin değişimidir. Kurumsal kimliğin en temel yapı taşı olan &amp;ccedil;alışanların her birinin d&amp;ouml;n&amp;uuml;ş&amp;uuml;me ayak uydurması gerekir. Farkındalığı olan takımların bu tip d&amp;ouml;n&amp;uuml;ş&amp;uuml;mleri daha &amp;ccedil;abuk kabullendiği ve kolayca adapte olduğu g&amp;ouml;zden ka&amp;ccedil;ırılmamalıdır. Olay renkli temalarla binaları giydirmekten, ilkeleri oyunlaştırarak anlatmaktan &amp;ccedil;ok daha &amp;ouml;tedir. Bu esas itibariyle bir felsefe kab&amp;uuml;l&amp;uuml;, ciddi bir d&amp;ouml;n&amp;uuml;ş&amp;uuml;md&amp;uuml;r.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Diğer yandan dijital d&amp;ouml;n&amp;uuml;ş&amp;uuml;m başlar başlamaz bunu sorgulamadan kabul etmek de &amp;ccedil;ok doğru değildir. Değişime diren&amp;ccedil; g&amp;ouml;stermek değil ama neden &amp;ouml;yle olması gerektiğini sorgulamaktan bahsediyorum. Sorgusuz sualsiz kabullerin sonucu &amp;ccedil;oğunlukla &amp;ccedil;evik s&amp;uuml;re&amp;ccedil;lerin m&amp;uuml;kemmel olduğu g&amp;ouml;r&amp;uuml;ş&amp;uuml; ifade edilir ve fakat pekala buna ihtiya&amp;ccedil; duyuluncaya kadar şelale modeli ile de başarılar elde edilmiştir. Değişen d&amp;uuml;nya artık o model tarafından y&amp;ouml;netilememekte ve m&amp;uuml;şteri ihtiya&amp;ccedil;ları atik bir şekilde giderilememektedir. En basit terk ediş sebebi belki de bu şekilde &amp;ouml;zetlenebilir.&lt;/p&gt;
&lt;p&gt;Pekala ben neden bu kadar felsefik konuşmaya &amp;ccedil;alışıyorum? &amp;Ccedil;eviklikten yanayım ama şelale modeli ile de yıllarca &amp;ccedil;alışmış birisiyim ve o &lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;saturday-night-works seansı&lt;/a&gt;nda daha &amp;ccedil;ok şelale modelinde karşımıza &amp;ccedil;ıkan bir tablo ile haşır neşirdim. Konu Gantt şemasıydı. Başlayalım mı?&lt;/p&gt;
&lt;p&gt;Henry Gantt tarafından icat edilen &lt;a href="https://www.gantt.com/" target="_blank"&gt;Gantt tabloları&lt;/a&gt;&amp;nbsp;proje takvimlerinin şekilsel g&amp;ouml;steriminde kullanılmaktadır. Temel olarak yatay &amp;ccedil;ubuklardan oluşan bu tablolarda proje planlarını, atanmış g&amp;ouml;revleri, tahmini s&amp;uuml;relerini ve genel olarak gidişatı g&amp;ouml;rmek m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Excel &amp;uuml;zerinde bile kullanılabilen Gantt Chart'lar sanıyorum proje y&amp;ouml;neticilerinin de vazge&amp;ccedil;ilmez ara&amp;ccedil;larındandır. Benim &lt;a href="https://github.com/buraksenyurt/saturday-night-works/tree/master/No%2023%20-%20Gantt%20Chart%20on%20AspNet%20Core" target="_blank"&gt;23 numaralı saturday-night-works &amp;ccedil;alışması&lt;/a&gt;ndaki amacım ise dhtmlxGantt isimli Javascript k&amp;uuml;t&amp;uuml;phanesinden yararlanarak bir Asp.Net Core projesinde Gantt Chart kullanabilmekti.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Kısaca kurgudan da bahsedeyim.&amp;nbsp;G&amp;ouml;revlere ait bilgiler SQLite veri tabanıyla beslenecek.&amp;nbsp;&amp;Ouml;ny&amp;uuml;z bu veriyi kullanırken REST tipinden servis &amp;ccedil;ağrıları ger&amp;ccedil;ekleştirilecek. Malum veri sunucu tarafında, Gant Chart ise kullanıcı etkileşimiyle birlikte HTML sayfasında. Yani dhtmlxGantt k&amp;uuml;t&amp;uuml;phanesi listeleme, ekleme, silme ve g&amp;uuml;ncelleme gibi operasyonlar i&amp;ccedil;in Web API tarafına Post, Put, Delete ve Update &amp;ccedil;ağrıları g&amp;ouml;nderecek. Sunucu tarafında daha &amp;ccedil;ok servis odaklı bir uygulama olacağını ifade edebiliriz. K&amp;uuml;t&amp;uuml;phanenin kullandığı veri modelini C# tarafında konumlandırabilmek i&amp;ccedil;in DTO&lt;em&gt;(Data Transform Object)&lt;/em&gt; nesnelerinden yararlanırken, sunucu tarafı operasyonlarında Model ve Controller katmanlarına başvuracağız. Heyecanlandınız, motive oldunuz, hazırsınız değil mi? :) &amp;Ouml;yleyse notların derlenmesine başlayalım.&lt;/p&gt;
&lt;p&gt;Bu arada &amp;ouml;rneği her zaman olduğu gibi WestWorld&amp;nbsp;&lt;em&gt;(Ubuntu 18.04 64bit)&lt;/em&gt;&amp;nbsp;&amp;uuml;zerinde geliştirmişim. İlk olarak boş bir web uygulaması oluşturalım. Ardından wwwroot klas&amp;ouml;r&amp;uuml; ve i&amp;ccedil;erisine index.html dosyasını ekleyerek devam edelim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new web -o ProjectManagerOZ&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;Ouml;rnekteki gantt chart &amp;ccedil;izimi i&amp;ccedil;in kullanılan &lt;a href="https://cdn.dhtmlx.com/gantt/edge/dhtmlxgantt.css" target="_blank"&gt;CSS dosyasına şu adresten&lt;/a&gt;, &lt;a href="https://cdn.dhtmlx.com/gantt/edge/dhtmlxgantt.js" target="_blank"&gt;Javascript dosyasına da bu adresten&lt;/a&gt; ulaşabilirsiniz. Bu kaynakları offline &amp;ccedil;alışmak isterseniz bilgisayara indirdikten sonra wwwroot altındaki alt klas&amp;ouml;rlerde&lt;em&gt;(css, js gibi)&lt;/em&gt; konuşlandırabilirsiniz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;Index.html&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;!DOCTYPE html&amp;gt;
&amp;lt;html&amp;gt;
&amp;lt;head&amp;gt;
    &amp;lt;meta name="viewport" content="width=device-width" /&amp;gt;
    &amp;lt;title&amp;gt;Project - 19&amp;lt;/title&amp;gt;
    &amp;lt;link href="css/dhtmlxgantt.css"
          rel="stylesheet" type="text/css" /&amp;gt;
    &amp;lt;script src="js/dhtmlxgantt.js"&amp;gt;&amp;lt;/script&amp;gt;
    &amp;lt;script&amp;gt;
        // index.html dok&amp;uuml;kamanı y&amp;uuml;klendiğinde ilgili fonksiyon devreye girerek 
        // proje veri i&amp;ccedil;eriğini ekrana basacak
        document.addEventListener("DOMContentLoaded", function(event) {
            // standart zaman formatını belirtiyoruz
            gantt.config.xml_date = "%Y-%m-%d %H:%i";
            gantt.init("project_map");
 
            // veri y&amp;uuml;kleme işinin &amp;uuml;stlenildiği kısım
            // tahmin edileceği &amp;uuml;zere /api/backlog şeklinde bir REST API &amp;ccedil;ağrısı olacak
            // bu kod tarafındaki Controller ile karşılanacak
            gantt.load("/api/backlog");
            // veri işleyicisi (bir web api servis adresi gibi d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir)
            var dp = new gantt.dataProcessor("/api/");
            dp.init(gantt);
            // REST tipinden iletişim sağlanacak
            dp.setTransactionMode("REST");
        });
    &amp;lt;/script&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body&amp;gt;
    &amp;lt;h2&amp;gt;Apollo 19 Project Plan&amp;lt;/h2&amp;gt;
    &amp;lt;div id="project_map" style="width: 100%; height: 100vh;"&amp;gt;&amp;lt;/div&amp;gt;
&amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Uygulamamız grafik verilerini g&amp;ouml;stermek i&amp;ccedil;in SQLite veri tabanını kullanıyor. Bu enstr&amp;uuml;manı Entity Framework kapsamında ele alabilmek i&amp;ccedil;in projeye Microsoft.EntityFrameworkCore.SQLite paketini eklemeliyiz. Bunun i&amp;ccedil;in terminalden aşağıdaki komutu &amp;ccedil;alıştırabiliriz.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet add package Microsoft.EntityFrameworkCore.SQLite&lt;/pre&gt;
&lt;p&gt;Sonrasında appsettings.json i&amp;ccedil;eriğine bir bağlantı c&amp;uuml;mlesi ilave edebiliriz. Bunu ilerleyen kısımlarda startup dosyasında kullanacağız. Apollo.db fiziki veri tabanı dosyamızın adı ve root altındaki db klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisinde yer alacak.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;{
  "Logging": {
    "LogLevel": {
      "Default": "Warning"
    }
  },
  "ConnectionStrings": {
    "ApolloDataContext": "Data Source=db/Apollo.db"
  },
  "AllowedHosts": "*"
}&lt;/pre&gt;
&lt;p&gt;Pek tabii modellerimizi, API servis tarafı haberleşmesi i&amp;ccedil;in controller tiplerimizi ve hatta gantt chart k&amp;uuml;t&amp;uuml;phanesindeki tiplerle entity modelleri arasındaki d&amp;ouml;n&amp;uuml;ş&amp;uuml;mleri kolaylaştıracak DTO nesnelerimizi geliştirmemiz gerekiyor. Uzun bir maraton olabilir. İlk olarak model sınıflarını yazarak başlayalım. Bir&amp;nbsp;Models klas&amp;ouml;r&amp;uuml; oluşturup altına Context ile model sınıflarımızı&lt;em&gt;(ki gantt chart k&amp;uuml;t&amp;uuml;phanesine g&amp;ouml;re Link ve Task isimli sınıflarımız olmalı)&lt;/em&gt;&amp;nbsp;ekleyerek &amp;ccedil;alışmamıza devam edebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Link sınıfı&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

/*
Task'lar arasındaki ilişkinin tutulduğu Entity sınıfımız
Eğer iki Task birbiri ile bağlıysa bu sınıfa ait nesne &amp;ouml;rnekleri &amp;uuml;zerinden ilişkilendirebiliriz.
*/
namespace ProjectManagerOZ.Models
{
    public class Link
    {
        public int Id { get; set; }
        public string Type { get; set; }
        public int SourceTaskId { get; set; }
        public int TargetTaskId { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Task sınıfı&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
/* 
proje g&amp;ouml;revlerinin verisinin tutulduğu Entity sınıfımız
Tipik olarak g&amp;ouml;revle ilgili bilgiler yer alır. 
A&amp;ccedil;ıklaması, s&amp;uuml;resi, hangi durumda olduğu, bağlı olduğu başka bir task varsa O, başlangı&amp;ccedil; tarihi, tipi vs
*/
 
namespace ProjectManagerOZ.Models
{
    public class Task
    {
        public int Id { get; set; }
        public string Text { get; set; }
        public DateTime StartDate { get; set; }
        public int Duration { get; set; }
        public decimal Progress { get; set; }
        public int? ParentId { get; set; }
        public string Type { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;ve &lt;strong&gt;ApolloDataContext&lt;/strong&gt; sınıfı ki bu alışkın olduğumuz tipik DataContext tipimiz. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere i&amp;ccedil;erisinde g&amp;ouml;revleri ve aralarındaki ilişkileri temsil eden veri setleri sunmakta.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Microsoft.EntityFrameworkCore;

namespace ProjectManagerOZ.Models
{
    // Entity Framework DB Context sınıfımız
    public class ApolloDataContext
        : DbContext
    {
        public ApolloDataContext(DbContextOptions&amp;lt;ApolloDataContext&amp;gt; options)
            : base(options)
        {
        }

        // Proje g&amp;ouml;revleri ile bunlar arasındaki olası ilişkileri temsil eden &amp;ouml;zelliklere sahip
        public DbSet&amp;lt;Task&amp;gt; Tasks { get; set; }
        public DbSet&amp;lt;Link&amp;gt; Links { get; set; }
    }
}&lt;/pre&gt;
&lt;h2&gt;K&amp;uuml;&amp;ccedil;&amp;uuml;k Bir Middleware Ayarı&lt;/h2&gt;
&lt;p&gt;Uygulamamız ayağa kalktığında veri tabanının boş olma ihtimaline karşın onu doldurmak isteyebiliriz. Bunun i&amp;ccedil;in DataFiller isimli sınıfımız ve i&amp;ccedil;erisinde Prepare isimli static bir metoduz var. Ancak s&amp;ouml;z konusu metodu host &amp;ccedil;alışma zamanında ayağa kalkarken &amp;ccedil;ağırmak istiyoruz. Bunun i&amp;ccedil;in Program sınıfında kullanılan IWebHostBuilder &amp;uuml;zerinden işletilebilecek bir operasyon tesis etmek lazım. Bunun i&amp;ccedil;in IWebHost t&amp;uuml;revlerine uyarlanabilecek bir genişletme metodu&lt;em&gt;(extension method)&lt;/em&gt; işimizi g&amp;ouml;recektir. Bu metod &amp;ccedil;alışma zamanında entity servisinin yakalanması ve Prepare operasyonun enjekte edilmesi a&amp;ccedil;ısından dikkate değerdir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;DataFiller sınıfı&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using ProjectManagerOZ.Models;

namespace ProjectManagerOZ.Initializers
{
    /*
    Bu sınıfın amacı başlangı&amp;ccedil;ta boş olan veritabanı tablolarına
    &amp;ouml;rnekte kullanabilmemiz i&amp;ccedil;in ilk verileri eklemek.
    Bu ama&amp;ccedil;la &amp;ouml;rnek task ve link'ler oluşturuluyor.
    Mesela Epic bir Work Item ve ona bağlı User Story'ler gibi
     */
    public static class DataFiller
    {
        public static void Prepare(ApolloDataContext context)
        {
            if (context.Tasks.Any()) //Eğer veritabanında en az bir Task varsa zaten veri i&amp;ccedil;eriyor demektir. Bu durumda initalize işlemine gerek yok.
                return;

            // Parent task'ı oluşturuyoruz (ParentId=null)
            var epic = new Task
            {
                Text = "JWT Implementation for Category WebAPI",
                StartDate = DateTime.Today.AddDays(1),
                Duration = 5,
                Progress = 0.4m,
                ParentId = null,
                Type = "Epic"
            };
            context.Tasks.Add(epic); //Task &amp;ouml;rneğini context'e ekleyip
            context.SaveChanges(); //tabloyada yazıyoruz
            var story1 = new Task
            {
                Text = "I want to develop tokenizer service",
                StartDate = DateTime.Today.AddDays(1),
                Duration = 4,
                Progress = 0.5m,
                ParentId = epic.Id, //story'yi epic senaryoya ParentId &amp;uuml;zerinden bağlıyoruz. Aynı bağlantı Story2 i&amp;ccedil;inde ger&amp;ccedil;ekleştiriliyor
                Type = "User Story"
            };
            context.Tasks.Add(story1);
            context.SaveChanges();

            var story2 = new Task
            {
                Text = "I have to implement tokinizer service",
                StartDate = DateTime.Today.AddDays(3),
                Duration = 5,
                Progress = 0.8m,
                ParentId = epic.Id,
                Type = "User Story"
            };
            context.Tasks.Add(story2);
            context.SaveChanges();

            var epic2 = new Task
            {
                Text = "Create ELK stack",
                StartDate = DateTime.Today.AddDays(3),
                Duration = 3,
                Progress = 0.2m,
                ParentId = null,
                Type = "Epic"
            };
            context.Tasks.Add(epic2);
            context.SaveChanges();

            var story3 = new Task
            {
                Text = "We have to setup Elasticsearch",
                StartDate = DateTime.Today.AddDays(6),
                Duration = 6,
                Progress = 0.0m,
                ParentId = epic2.Id,
                Type = "User Story"
            };
            context.Tasks.Add(story3);
            context.SaveChanges();

            var story4 = new Task
            {
                Text = "We have to implement Logstash to Microservices",
                StartDate = DateTime.Today.AddDays(6),
                Duration = 2,
                Progress = 0.3m,
                ParentId = epic2.Id,
                Type = "User Story"
            };
            context.Tasks.Add(story4);
            context.SaveChanges();

            var story5 = new Task
            {
                Text = "We have to setup Kibana for Elasticsearch",
                StartDate = DateTime.Today.AddDays(6),
                Duration = 2,
                Progress = 0.0m,
                ParentId = epic2.Id,
                Type = "User Story"
            };
            context.Tasks.Add(story5);
            context.SaveChanges();

            // Oluşturduğumuz proje g&amp;ouml;revleri arasındaki ilişkileri oluşturuyoruz
            List&amp;lt;Link&amp;gt; taskLinks = new List&amp;lt;Link&amp;gt;{
                new Link{SourceTaskId=epic.Id,TargetTaskId=story1.Id,Type="1"},
                new Link{SourceTaskId=epic.Id,TargetTaskId=story2.Id,Type="1"},
                new Link{SourceTaskId=epic2.Id,TargetTaskId=story3.Id,Type="1"},
                new Link{SourceTaskId=story3.Id,TargetTaskId=story4.Id,Type="1"},
                new Link{SourceTaskId=story4.Id,TargetTaskId=story5.Id,Type="1"},
                new Link{SourceTaskId=epic.Id,TargetTaskId=epic2.Id,Type="2"}
            };
            taskLinks.ForEach(l =&amp;gt; context.Links.Add(l));
            context.SaveChanges();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;DataFillerExtension&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using Microsoft.AspNetCore.Hosting;
using Microsoft.Extensions.DependencyInjection;
using ProjectManagerOZ.Models;

/*
    DataFillerExtension sınıfı InitializeDb isimli bir extension method i&amp;ccedil;eriyor.
    Bu metodu IWebHost t&amp;uuml;revli nesne &amp;ouml;rneklerine uygulayabiliyoruz.
    Ama&amp;ccedil; &amp;ccedil;alışma zamanında host ortamı inşa edilirken Middleware katmanında araya girip
    veritabanı &amp;uuml;zerinde Prepare operasyonunu icra ettirmek.
    Bu genişletme fonksiyonunu Program.cs i&amp;ccedil;erisinde kullanmaktayız.
 */
namespace ProjectManagerOZ.Initializers
{
    public static class DataFillerExtensions
    {
        public static IWebHost InitializeDb(this IWebHost webHost)
        {
            // &amp;ccedil;alışma zamanını servislerinin &amp;uuml;reticisini &amp;ouml;rnekle
            var serviceFactory = (IServiceScopeFactory)webHost.Services.GetService(typeof(IServiceScopeFactory));

            // Bir Scope &amp;uuml;ret
            using (var currentScope = serviceFactory.CreateScope())
            {
                // G&amp;uuml;ncel ortamdan servis sağlayıcısını &amp;ccedil;ek
                var serviceProvider = currentScope.ServiceProvider;
                // Servis sağlaycısından sisteme enjekte edilmiş entity context'ini iste
                var dbContext = serviceProvider.GetRequiredService&amp;lt;ApolloDataContext&amp;gt;();
                // context'i kullanarak veritabanını dolduran fonksiyonu &amp;ccedil;ağır
                DataFiller.Prepare(dbContext);
            }
            // IWebHost &amp;ouml;rneğini yeni bezenmiş haliyle geri d&amp;ouml;nd&amp;uuml;r
            return webHost;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu yapılanmayı kullanbilmek i&amp;ccedil;in program sınıfını ş&amp;ouml;yle değiştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.AspNetCore;
using Microsoft.AspNetCore.Hosting;
using Microsoft.Extensions.Configuration;
using Microsoft.Extensions.Logging;
using ProjectManagerOZ.Initializers;

namespace ProjectManagerOZ
{
    public class Program
    {
        public static void Main(string[] args)
        {
            CreateWebHostBuilder(args)
            .Build()
            .InitializeDb() // IWebHost i&amp;ccedil;in yazdığımız genişletme metodu.
            .Run();
        }

        public static IWebHostBuilder CreateWebHostBuilder(string[] args) =&amp;gt;
            WebHost.CreateDefaultBuilder(args)
                .UseStartup&amp;lt;Startup&amp;gt;()
                .UseUrls("http://localhost:5402");
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere InitiateDb isimli metod CreateWebHosBuilder d&amp;ouml;n&amp;uuml;ş&amp;uuml;nden kullanılabiliyor.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alışmamıza startup sınıfına ge&amp;ccedil;erek devam edelim. Burada Entity Framework servisinin &amp;ccedil;alışma zamanına enjekte edilmesi, statik web sayfası hizmetinin a&amp;ccedil;ılması, Web API tarafı i&amp;ccedil;in MVC &amp;ouml;zelliğinin etkinleştirilmesi, SQLite veri tabanı i&amp;ccedil;in gerekli bağlantı bilgisinin konfigurasyon dosyasından alınması gibi işlemlere yer veriyoruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.AspNetCore.Builder;
using Microsoft.AspNetCore.Hosting;
using Microsoft.AspNetCore.Http;
using Microsoft.AspNetCore.HttpsPolicy;
using Microsoft.EntityFrameworkCore; //EF Core kullanacağımız i&amp;ccedil;in eklendi
using Microsoft.AspNetCore.Mvc;
using Microsoft.Extensions.Configuration;
using Microsoft.Extensions.DependencyInjection;
using ProjectManagerOZ.Models;

namespace ProjectManagerOZ
{
    public class Startup
    {
        /*
        Configuration &amp;ouml;zelliği ve Startup'ın overload edilmiş Constructor metodu varsayılan olarak gelmiyor.
        ApolloDbContext i&amp;ccedil;in gerekli connection string bilgisine ulaşacağımız Configuration nesnesine
        erişebilmek amacıyla eklendiler 
         */
        public IConfiguration Configuration { get; }

        public Startup(IConfiguration configuration)
        {
            Configuration = configuration;
        }

        public void ConfigureServices(IServiceCollection services)
        {
            // appsettings'den SQLite i&amp;ccedil;in gerekli connection string bilgisini aldık
            var conStr = Configuration.GetConnectionString("ApolloDataContext");
            // ardından SQLite i&amp;ccedil;in gerekli DB Context'i servislere ekledik
            // Artık modellerimiz SQLite veritabanı ile &amp;ccedil;alışacak
            // Bu işlemler runtime'de ger&amp;ccedil;ekleşecek
            services.AddDbContext&amp;lt;ApolloDataContext&amp;gt;(options =&amp;gt; options.UseSqlite(conStr));
            services.AddMvc(); // Web API Controller'ının &amp;ccedil;alışabilmesi i&amp;ccedil;in ekledik
        }

        public void Configure(IApplicationBuilder app, IHostingEnvironment env)
        {
            if (env.IsDevelopment())
            {
                app.UseDeveloperExceptionPage();
            }

            // wwwroot altındaki index.html benzeri sayfaları kullanabileceğimizi belirttik
            app.UseDefaultFiles();
            // ayrıca wwwroot altındaki css, image gibi asset'lerinde kullanılacağı ifade edildi
            app.UseStaticFiles();
            app.UseMvc(); // Web API Controller'ının &amp;ccedil;alışabilmesi i&amp;ccedil;in ekledik
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Veri modeli, verinin başlangı&amp;ccedil;ta oluşturulması i&amp;ccedil;in gerekli adımlar ile &amp;ccedil;alışma zamanına ait bir takım kodlamaları halletmiş durumdayız. Veri tabanı tarafı ile konuşurken işimizi kolaylaştıracak DTO&lt;em&gt;(Data Transform Object)&lt;/em&gt; nesneleri ile bu işin kontrolc&amp;uuml;lerini kodlayarak ilerleyelim. dto isimli bir klas&amp;ouml;r oluşturup i&amp;ccedil;erisine aşağıdaki kod par&amp;ccedil;alarına sahip TaskDTO ve LinkDTO sınıflarını ekleyelim.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;TaskDTO&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Text.Encodings.Web;
using ProjectManagerOZ.Models;
/*
    DTO sınıfımız WebAPI tarafında, Gantt k&amp;uuml;t&amp;uuml;phanesi ile olan haberleşmedeki mesajlaşmalarda kullanılan modeli tanımlıyor.
    Arka plandaki Task nesnemizden ziyade Gantt k&amp;uuml;t&amp;uuml;phanesinin istediği alan adlarına sahip. S&amp;ouml;zgelimi Task tipinde StartDate varken
    burada start_date kullanılmakta.

    Peki tabii API Controller metodlarındaki Task ve TaskDTO arasındaki d&amp;ouml;n&amp;uuml;ş&amp;uuml;mleri kolayaştırmak adına bilin&amp;ccedil;li olarak operat&amp;ouml;rlerin
    aşırı y&amp;uuml;klendiğini g&amp;ouml;r&amp;uuml;yoruz.
*/

namespace ProjectManagerOZ.DTO
{
    public class TaskDTO
    {
        public int id { get; set; }
        public string text { get; set; }
        public string start_date { get; set; }
        public int duration { get; set; }
        public decimal progress { get; set; }
        public int? parent { get; set; }
        public string type { get; set; }
        public string target { get; set; }
        public bool open
        {
            get { return true; }
            set { }
        }

        public static explicit operator TaskDTO(Task task)
        {
            return new TaskDTO
            {
                id = task.Id,
                text = HtmlEncoder.Default.Encode(task.Text),
                start_date = task.StartDate.ToString("yyyy-MM-dd HH:mm"),
                duration = task.Duration,
                parent = task.ParentId,
                type = task.Type,
                progress = task.Progress
            };
        }

        public static explicit operator Task(TaskDTO task)
        {

            return new Task
            {
                Id = task.id,
                Text = task.text,
                StartDate = DateTime.Parse(task.start_date, System.Globalization.CultureInfo.InvariantCulture),
                Duration = task.duration,
                ParentId = task.parent,
                Type = task.type,
                Progress = task.progress
            };
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;LinkDTO&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Text.Encodings.Web;
using ProjectManagerOZ.Models;
/*
    DTO sınıfımız WebAPI tarafında, Gantt k&amp;uuml;t&amp;uuml;phanesi ile olan haberleşmedeki mesajlaşmalarda kullanılan modeli tanımlıyor.
    Arka plandaki Link nesnemizden ziyade Gantt k&amp;uuml;t&amp;uuml;phanesinin istediği alan adlarına sahip. Peki tabii API Controller metodlarındaki 
    Link ve LinkDTO arasındaki d&amp;ouml;n&amp;uuml;ş&amp;uuml;mleri kolayaştırmak adına bilin&amp;ccedil;li olarak operat&amp;ouml;rlerin aşırı y&amp;uuml;klendiğini g&amp;ouml;r&amp;uuml;yoruz.
*/

namespace ProjectManagerOZ.DTO
{

    public class LinkDTO
    {
        public int id { get; set; }
        public string type { get; set; }
        public int source { get; set; }
        public int target { get; set; }

        public static explicit operator LinkDTO(Link link)
        {
            return new LinkDTO
            {
                id = link.Id,
                type = link.Type,
                source = link.SourceTaskId,
                target = link.TargetTaskId
            };
        }

        public static explicit operator Link(LinkDTO link)
        {
            return new Link
            {
                Id = link.id,
                Type = link.type,
                SourceTaskId = link.source,
                TargetTaskId = link.target
            };
        }
    }
}&lt;/pre&gt;
&lt;p&gt;WebAPI tarafının web sayfası &amp;uuml;zerinden gelecek HTTP &amp;ccedil;ağrılarına cevap vereceği yerler Controller sınıfları. Kullanılan gantt chart k&amp;uuml;t&amp;uuml;phanesinin işleyiş şekli gereği Link ve Task tipleri i&amp;ccedil;in ayrı ayrı controller sınıflarının yazılması gerekiyor.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;LinkController&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic;
using System.Linq;
using Microsoft.AspNetCore.Mvc;
using ProjectManagerOZ.Models;
using ProjectManagerOZ.DTO;
using Microsoft.EntityFrameworkCore;

/*
    Link nesneleri ile ilgili CRUD operasyonlarını &amp;uuml;stlenen Web API Controller sınıfımız
 */
namespace ProjectManagerOZ.Controllers
{
    [Produces("application/json")] // JSON formatında &amp;ccedil;ıktı &amp;uuml;reteceğimizi belirtiyoruz
    [Route("api/link")] // Gantt Chart k&amp;uuml;t&amp;uuml;phanesinin beklediği Link API adresi
    public class LinkController
        : Controller
    {
        // Controller i&amp;ccedil;erisine pek tabii ApolloDataContext'imizi ge&amp;ccedil;iyoruz.
        private readonly ApolloDataContext _context;
        public LinkController(ApolloDataContext context)
        {
            _context = context;
        }

        // Yeni bir Link eklerken devreye giren HTTP Post metodumuz
        [HttpPost]
        public IActionResult Create(LinkDTO payload)
        {
            var l = (Link)payload;

            _context.Links.Add(l);
            _context.SaveChanges();

            /*
                Task &amp;ouml;rneğinde olduğu gibi istemci tarafına oluşturulan Link
                &amp;ouml;rneğine ait Id değerini g&amp;ouml;ndermemiz lazım ki, takip eden Link bağlama,
                g&amp;uuml;ncelleme veya silme gibi işlemler &amp;ccedil;alışabilsin.
                tid, istemci tarafının beklediği değişken adıdır.
             */
            return Ok(new
            {
                tid = l.Id,
                action = "inserted"
            });
        }


        /*
        Bir Link'i g&amp;uuml;ncellemek istediğimizde devreye giren metodumuz
         */
        [HttpPut("{id}")]
        public IActionResult Update(int id, LinkDTO payload)
        {
            // Gelen payload i&amp;ccedil;eriğini backend tarafındaki model sınıfına d&amp;ouml;n&amp;uuml;şt&amp;uuml;r
            var l = (Link)payload;
            // id eşlemesi yap
            l.Id = id;
            // durumu g&amp;uuml;ncellendiye &amp;ccedil;ek
            _context.Entry(l).State = EntityState.Modified;
            // ve değişiklikleri kaydedip
            _context.SaveChanges();
            // HTTP 200 d&amp;ouml;nd&amp;uuml;r
            return Ok();
        }

        /*
        HTTP Delete operasyonuna karşılık gelen ve
        parametre olarak gelen id değerine g&amp;ouml;re silme işlemini icra eden metodumuz
         */
        [HttpDelete("{id}")]
        public IActionResult Delete(int id)
        {
            // Link &amp;ouml;rneğini bul
            var l = _context.Links.Find(id);
            if (l != null)
            {
                // Entity Context'inden ve
                _context.Links.Remove(l);
                // Kalıcı olarak veritabanından sil
                _context.SaveChanges();
            }

            return Ok();
        }

        // T&amp;uuml;m Link &amp;ouml;rneklerini d&amp;ouml;nd&amp;uuml;ren HTTP Get metodumuz
        [HttpGet]
        public IEnumerable&amp;lt;LinkDTO&amp;gt; Get()
        {
            return _context.Links
                .ToList()
                .Select(t =&amp;gt; (LinkDTO)t);
        }

        // Belli bir Id değerine g&amp;ouml;re ilgili Link nesnesinin DTO karşılığını d&amp;ouml;nd&amp;uuml;ren HTTP Get metodumuz
        [HttpGet("{id}")]
        public LinkDTO GetById(int id)
        {
            return (LinkDTO)_context
                .Links
                .Find(id);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;TaskController&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic;
using System.Linq;
using Microsoft.AspNetCore.Mvc;
using ProjectManagerOZ.Models;
using ProjectManagerOZ.DTO;

namespace ProjectManagerOZ.Controllers
{
    [Produces("application/json")]
    [Route("api/task")] // Gantt Chart k&amp;uuml;t&amp;uuml;phanesinin beklediği Task API adresi
    public class TaskController
        : Controller
    {
        // Controller i&amp;ccedil;erisine pek tabii ApolloDataContext'imizi ge&amp;ccedil;iyoruz.
        private readonly ApolloDataContext _context;
        public TaskController(ApolloDataContext context)
        {
            _context = context;
        }

        // HTTP Post metodumuz
        // Yeni bir Task eklemek i&amp;ccedil;in kullanılıyor
        [HttpPost]
        public IActionResult Create(TaskDTO task)
        {
            // Mesaj parametresi olarak gelen TaskDTO i&amp;ccedil;eriğini Task tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;rd&amp;uuml;k
            var payload = (Task)task;
            // Task'ı Context'e ekle
            _context.Tasks.Add(payload);
            // Kalıcı olarak kaydet
            _context.SaveChanges();

            /*HTTP 200 Ok d&amp;ouml;n&amp;uuml;yoruz
             D&amp;ouml;nerken de oluşan Task Id değerini de yolluyoruz
             Bu Child task'ları bağlarken veya bir Task'ı silerken
             gerekli olan bir bilgi nitekim. Aksi halde istemci
             tarafındaki Gantt k&amp;uuml;t&amp;uuml;phanesi kiminle işlem yapması gerektiğini bilemiyor.
             İnanmıyorsanız sadece HTTP 200 d&amp;ouml;nd&amp;uuml;r&amp;uuml;p durumu inceleyin :)
             */
            return Ok(new
            {
                tid = payload.Id,
                action = "inserted"
            });
        }

        // HTTP Put ile &amp;ccedil;alıştırılan g&amp;uuml;ncelleme metodumuz
        // Parametrede Task'ın id bilgisi gelecektir
        [HttpPut("{id}")]
        public IActionResult Update(int id, TaskDTO task)
        {
            // Mesaj ile gelen TaskDTO &amp;ouml;rneğini d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;p id değerini verdik
            var payload = (Task)task;
            payload.Id = id;

            // id'den ilgili Task &amp;ouml;rneğini bulduk
            var t = _context.Tasks.Find(id);

            // alan g&amp;uuml;ncellemelerini yaptık
            t.Text = payload.Text;
            t.StartDate = payload.StartDate;
            t.Duration = payload.Duration;
            t.ParentId = payload.ParentId;
            t.Progress = payload.Progress;
            t.Type = payload.Type;

            // değişiklikleri veritabanına kaydettik
            _context.SaveChanges();

            // HTTP 200 Ok d&amp;ouml;n&amp;uuml;yoruz
            return Ok();
        }

        // HTTP Delete yani silme işlemi i&amp;ccedil;in &amp;ccedil;alışacak metodumuz
        [HttpDelete("{id}")]
        public IActionResult Delete(int id)
        {
            // Task'ı bulalım ve eğer varsa
            var task = _context.Tasks.Find(id);
            if (task != null)
            {
                // &amp;ouml;nce Context'ten 
                _context.Tasks.Remove(task);
                // sonra veritabanından silelim
                _context.SaveChanges();
            }

            // HTTP 200 Ok d&amp;ouml;n&amp;uuml;yoruz
            return Ok();
        }

        // HTTP Get karşılığı &amp;ccedil;alışan metodumuz
        // T&amp;uuml;m Task'ları geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;r
        [HttpGet]
        public IEnumerable&amp;lt;TaskDTO&amp;gt; Get()
        {
            return _context.Tasks
                .ToList()
                .Select(t =&amp;gt; (TaskDTO)t);
        }

        // HTTP Get ile ID bazlı &amp;ccedil;alışan metodumuz
        // Belli bir ID'ye ait Task bilgisini verir
        [HttpGet("{id}")]
        public TaskDTO GetById(int id)
        {
            return (TaskDTO)_context
                .Tasks
                .Find(id);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Web sayfasına HTTP Get ile &amp;ccedil;ekilen g&amp;ouml;rev listesi ve ilişkilerin gant chart'ın istediği tiplere d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmesi gerekiyor. İşte DTO d&amp;ouml;n&amp;uuml;ş&amp;uuml;mlerinin devreye girdiği yer. Bunun i&amp;ccedil;in&lt;strong&gt;&amp;nbsp;MainController &lt;/strong&gt;isimli tipi kullanmaktayız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic;
using System.Linq;
using Microsoft.AspNetCore.Mvc;
using ProjectManagerOZ.Models;
using ProjectManagerOZ.DTO;

namespace ProjectManagerOZ.Controllers
{
    [Produces("application/json")]
    [Route("api/backlog")] // Bu adres bilgisi index.html i&amp;ccedil;erisinde de ge&amp;ccedil;iyor. Bulun ;)
    public class MainController : Controller
    {
        // Controller i&amp;ccedil;erisine pek tabii ApolloDataContext'imizi ge&amp;ccedil;iyoruz.
        private readonly ApolloDataContext _context;
        public MainController(ApolloDataContext context)
        {
            _context = context;
        }

        // HTTP Get ile verinin &amp;ccedil;ekildiği metodumuz. Talebi index.html sayfasından yapıyoruz
        [HttpGet]
        public object Get()
        {
            // Task ve Link veri setlerini TaskDTO ve LinkDTO tipinden nesnelere d&amp;ouml;n&amp;uuml;şt&amp;uuml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z dikkatinizden ka&amp;ccedil;mamıştır.
            // Bunun sebebi Gantt'ın beklediği veri tipini sunan DTO sınıfı ile backend tarafında kullandığımız sınıfların farklı olmasıdır.

            // D&amp;ouml;n&amp;uuml;ş olarak kullandığımız nesne data ve links isimli iki &amp;ouml;zellik tutuyor.
            // data &amp;ouml;zelliğinde Task bilgilerini
            // links &amp;ouml;zelliğinde de tasklar arasındaki bağlantı bilgilerini d&amp;ouml;n&amp;uuml;yoruz
            // bu format &amp;ouml;zelleştirilmediği s&amp;uuml;rece Gantt Chart'ın beklediği tiptedir
            
            return new
            {
                data = _context.Tasks
                    .OrderBy(t =&amp;gt; t.Id)
                    .ToList()
                    .Select(t =&amp;gt; (TaskDTO)t),
                links = _context.Links
                    .ToList()
                    .Select(l =&amp;gt; (LinkDTO)l)
            };
        }        
    }
}&lt;/pre&gt;
&lt;h2&gt;SQLite&amp;nbsp;Ayarlamaları&lt;/h2&gt;
&lt;p&gt;Kodlarımızı tamamladık lakin testlere başlamadan &amp;ouml;nce SQLite veri tabanının oluşturulması gerekiyor. Tipik bir migration s&amp;uuml;reci &amp;ccedil;alıştıracağız. Bunun i&amp;ccedil;in terminalden aşağıdaki komutları kullanabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet ef migrations add InitialCreate
dotnet ef database update&lt;/pre&gt;
&lt;p&gt;İlk satır işletildiğinde DataContext t&amp;uuml;revli sınıf baz alınarak migration planları &amp;ccedil;ıkartılır. Planlar hazırlandıktan sonra ikinci komut ile update işlemi y&amp;uuml;r&amp;uuml;t&amp;uuml;l&amp;uuml;r ve ilgili tablolar SQLite veri tabanı i&amp;ccedil;erisine ilave edilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/07/23/Cover_1.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;&amp;Ccedil;alışma Zamanı&lt;/h2&gt;
&lt;p&gt;Kod ilk &amp;ccedil;alıştırıldığında eğer Tasks tablosunda herhangibir kayıt yoksa aşağıdaki gibi bir ka&amp;ccedil; verinin eklendiği g&amp;ouml;r&amp;uuml;lecektir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/07/23/credit_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Benzer şekilde Links tablosuna gidilirse g&amp;ouml;revler arası ilişkilerin eklendiği de g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/07/23/credit_3.png" alt="" /&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Visual Studio Code tarafında SQLite veri tabanı ile ilgili işleri g&amp;ouml;rsel olarak yapabilmek i&amp;ccedil;in &lt;a href="https://marketplace.visualstudio.com/items?itemName=alexcvzz.vscode-sqlite" target="_blank"&gt;şu eklentiyi&lt;/a&gt; kullanabilirsiniz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Uygulamamızı terminalden&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet run&lt;/pre&gt;
&lt;p&gt;komutu ile &amp;ccedil;alıştırdıktan sonra&amp;nbsp;Index sayfasını talep edersek bizi bir proje y&amp;ouml;netim ekranının karşıladığını g&amp;ouml;rebiliriz ;)&amp;nbsp;Bu sayfanın verisi tahmin edeceğiniz &amp;uuml;zere MainController tipine gelen HTTP Get &amp;ccedil;ağrısı ile sağlanmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/07/23/credit_4.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Burada dikkat edilmesi gereken bir nokta var. Gantt Chart i&amp;ccedil;in yazılmış olan k&amp;uuml;t&amp;uuml;phane standart olarak Task ve Link tipleri ile &amp;ccedil;alışırken REST API &amp;ccedil;ağrılarını kullanmaktadır. Yeni bir &amp;ouml;ğe eklerken POST, bir &amp;ouml;ğeyi g&amp;uuml;ncellerken PUT ve son olarak silme işlemlerinde DELETE operasyonlarına başvurulur. Eğer &amp;ouml;rnek senaryomuzda TaskController ve LinkController tiplerinin POST, PUT, DELETE ve GET karşılıklarını yazmassak arabirimdeki değişiklikler sunucu tarafına aktarılamayacak ve aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer hatalar alınacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/07/23/credit_5.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;HTTP &amp;ccedil;ağrıları LinkController ve TaskController sınıflarınca ele alındıktan sonra ise grafik &amp;uuml;zerindeki CRUD&lt;em&gt;(CreateReadUpdateDelete)&lt;/em&gt; operasyonlarının SQLite tarafına da başarılı bir şekilde aktarıldığı g&amp;ouml;r&amp;uuml;lebilir. &amp;Ouml;rnekte &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; bir ana g&amp;ouml;rev ile&amp;nbsp;alt işi&amp;nbsp;girilmiş, bir takım g&amp;ouml;revler &amp;uuml;zerinde g&amp;uuml;ncellemeler yapılmış&amp;nbsp;ve g&amp;ouml;revler arası bağlantılar kurgulanmıştır.&amp;nbsp;WestWorld &amp;ccedil;alışma zamanına yansıyan &amp;ouml;rnek ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/07/23/credit_6.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu oluşumun sonu&amp;ccedil;ları SQLite veritabanına da yansır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/07/23/credit_7.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;T&amp;uuml;m CRUD operasyonları aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne benzer olacak şekilde HTTP &amp;ccedil;ağrıları &amp;uuml;zerinden ger&amp;ccedil;eklenir. Bunu F12 ile ge&amp;ccedil;eceğiniz b&amp;ouml;l&amp;uuml;mdeki Network kısmından izleyebilirsiniz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/07/23/credit_8.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alışma zamanı testlerini de tamamladığımıza g&amp;ouml;re yavaş yavaş derlememizi noktalayabiliriz.&lt;/p&gt;
&lt;h2&gt;Ben Neler &amp;Ouml;ğrendim?&lt;/h2&gt;
&lt;p&gt;Kopyala yapıştır yasağım nedeniyle yazılması uzun s&amp;uuml;ren bir &amp;ouml;rnekti ama &amp;ouml;ğrenmek i&amp;ccedil;in tatbik etmek en g&amp;uuml;zel y&amp;ouml;ntemdir. &amp;Uuml;stelik bu şekilde hatalar yaptırıp neyin ne i&amp;ccedil;in kullanıldığını ve nasıl olması gerektiğini de anlamış oluruz. S&amp;ouml;z gelimi POST metodlarından &amp;uuml;retilen task veya link id değerlerini d&amp;ouml;nd&amp;uuml;rmezseniz bazı şeylerin ters gittiğini g&amp;ouml;rebilirsiniz. Gelelim neler &amp;ouml;ğrendiğime...&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Gantt Chart'ları xdhtmlGantt asset'leri ile nasıl kolayca kullanabileceğimi&lt;/li&gt;
&lt;li&gt;IWebHost t&amp;uuml;revli bir tipe extension method yardımıyla yeni bir işlevselliği nasıl kazandırabileceğimi&lt;/li&gt;
&lt;li&gt;Bu işlevsellik i&amp;ccedil;erisinde servis sağlayıcısı &amp;uuml;zerinde Entity Context'ini nasıl yakalayabileceğimi&lt;/li&gt;
&lt;li&gt;Gantt Chart'ın &amp;ouml;n y&amp;uuml;zde kullandığı task ve link tipleri ile Model sınıfları arasındaki d&amp;ouml;n&amp;uuml;ş&amp;uuml;mlerde DTO tiplerinden yararlanmam gerektiğini&lt;/li&gt;
&lt;li&gt;DTO'lar i&amp;ccedil;erisinde d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme&lt;em&gt;(cast)&lt;/em&gt; operat&amp;ouml;rlerinin nasıl aşırı y&amp;uuml;klenebileceğini&lt;em&gt;(operator overloading)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Gantt Chart k&amp;uuml;t&amp;uuml;phanesinin backend tarafı ile REST tipinden Web API &amp;ccedil;ağırıları yaparak konuştuğunu&lt;/li&gt;
&lt;li&gt;Gantt Chart i&amp;ccedil;in kullanılan API Controller'larda HTTP Post i&amp;ccedil;in tid'nin &amp;ouml;nemini&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bu uzun ve komplike &amp;ouml;rnekte ele almaya &amp;ccedil;alıştığımız Gantt Chart k&amp;uuml;t&amp;uuml;phanesini eminim ki kullanmayacaksınız. Malum bir &amp;ccedil;oğumuz artık VSTS gibi ortamların bize sunduğu Scrum panolarında işlerimizi y&amp;uuml;r&amp;uuml;t&amp;uuml;yor ve iterasyon bazlı planlamalar yaptığımızdan bu tip Waterfall'a d&amp;ouml;n&amp;uuml;k tabloları &amp;ccedil;ok fazla ele almıyoruz. Yine de &amp;ouml;rneğe u&amp;ccedil;tan uca yazılan bir uygulama g&amp;ouml;z&amp;uuml;yle bakmanızı tavsiye edebilirim. B&amp;ouml;ylece geldik bir maceramızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2019-07-26 13:00:00</pubDate>
  <slug>bir-web-uygulamasinda-gantt-chart-kullanimi</slug>
  <tags>
    <tag>net-core</tag>
    <tag>aspnet-core</tag>
    <tag>gantt-chart</tag>
    <tag>chart</tag>
    <tag>javascript</tag>
    <tag>gantt</tag>
    <tag>css</tag>
    <tag>sqlite</tag>
    <tag>entity-framework</tag>
    <tag>entity-framework-core</tag>
    <tag>html</tag>
    <tag>mvc</tag>
    <tag>datacontext</tag>
    <tag>extension-methods</tag>
    <tag>dependency-injection</tag>
    <tag>dto</tag>
    <tag>data-transfer-object</tag>
    <tag>rest</tag>
    <tag>project-management</tag>
    <tag>waterfall</tag>
  </tags>
  <categories>
    <category>Asp.Net Core</category>
  </categories>
</post>