<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Screencast - AJAX Enabled WCF Services</title>
  <description>Görsel derslerimize kaldığımız yerden devam ediyoruz. Bu sefer elimizdeki materyaller bir WCF Service, Asp.Net Web Uygulaması ve AJAX. Bunları bir arada düşündüğümüzde ise karşımıza AJAX Enabled WCF Service kavramı çıkıyor. Bildiğiniz üzere Asp.Net uygulamalarında AJAX imkanları kullanılabilmekte ve bu sayede kısmi olarak post işlemleri gerçekleştirilebilmekte. Çok basit anlamda bir sayfanın tamamını sunucuya göndermeden sadece istenilen parçaların gönderilmesi ve sonuçlarının ele alınabilmesi mümkündür.</description>
  <content>&lt;p&gt;&lt;img style="float: left;" src="http://www.buraksenyurt.com/pics/2010%2f3%2fblg160_Giris.gif" alt="" width="250" height="185" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;G&amp;ouml;rsel derslerimize kaldığımız yerden devam ediyoruz. Bu sefer elimizdeki materyaller bir &lt;strong&gt;WCF Service&lt;/strong&gt;, &lt;strong&gt;Asp.Net Web Uygulaması &lt;/strong&gt;ve &lt;strong&gt;AJAX&lt;/strong&gt;. Bunları bir arada d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde ise karşımıza &lt;strong&gt;AJAX Enabled WCF Service &lt;/strong&gt;kavramı &amp;ccedil;ıkıyor. Bildiğiniz &amp;uuml;zere&lt;strong&gt; Asp.Net&lt;/strong&gt; uygulamalarında &lt;strong&gt;AJAX &lt;/strong&gt;imkanları kullanılabilmekte ve bu sayede kısmi olarak post işlemleri ger&amp;ccedil;ekleştirilebilmekte. &amp;Ccedil;ok basit anlamda bir sayfanın tamamını sunucuya g&amp;ouml;ndermeden sadece istenilen par&amp;ccedil;aların g&amp;ouml;nderilmesi ve sonu&amp;ccedil;larının ele alınabilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;Tabi sonu&amp;ccedil;ların istemci tarafında ele alınması gerekmekte&lt;em&gt;(&amp;Ouml;rneğin &lt;strong&gt;Javascript&lt;/strong&gt; ile)&lt;/em&gt;. &lt;strong&gt;AJAX Destekli WCF Servislerinde &lt;/strong&gt;ise herhangibir servis operasyonunun &amp;ccedil;ağrısı sırasında, servisi &amp;ccedil;ağıran web sayfasının tamamının sunucuya &lt;span style="text-decoration: underline;"&gt;g&amp;ouml;nderilmemesi&lt;/span&gt; imkanı kazanılmaktadır. &lt;strong&gt;AJAX Destekli WCF Servislerinin &lt;/strong&gt;kullanıldığı pek &amp;ccedil;ok senaryo s&amp;ouml;z konusudur. En basit haliyle otomatik metin tamamlama kabiliyetine sahip kontroller i&amp;ccedil;in bu teknikten yararlanılabilir. Bizde g&amp;ouml;rsel dersimizde konu olarak &lt;strong&gt;bebek adlarını(Baby Names) &lt;/strong&gt;ele almaya &amp;ccedil;alışacağız. Upss!!! Bebek Adları mı?&amp;nbsp;&lt;img title="Wink" src="http://www.buraksenyurt.com/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; İzleyelim ve g&amp;ouml;relim.&lt;/p&gt;
&lt;p&gt;&lt;iframe src="https://www.youtube.com/embed/2cgM8ScN9No" width="560" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Video Boyutu : &lt;/strong&gt;24 Mb&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;S&amp;uuml;re :&lt;/strong&gt; 14:06&lt;/p&gt;
&lt;p&gt;&lt;a title="AJAX Enabled WCF Services" href="http://www.nedirtv.com/video/AJAX-Enabled-WCF-Services" target="_blank"&gt;Download Etmek veya İzlemek i&amp;ccedil;in&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="http://www.buraksenyurt.com/pics/2010%2f3%2fWebApplication2.rar"&gt;WebApplication2.rar (22,09 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2010-03-04 01:45:00</pubDate>
  <slug>Screencast-AJAX-Enabled-WCF-Services</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-40</tag>
    <tag>aspnet</tag>
    <tag>aspnet-40</tag>
    <tag>screencast</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>