<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF 4.0 Yenilikleri - Discovery için Scope Kullanmak [Beta 1]</title>
  <description>Bir önceki yazımızda WCF 4.0 tabanlı servislerde WS-Discovery protokolünün, Ad Hoc modeline göre nasıl uygulanabileceğini görmüştük. Ad Hoc modelinde istemcinin, yerel ağ üzerine dahil olan bir servisi aramak için kullanabileceği kriterleri önceden belirlemesi ve bunları kullanması gerektiğinden bahsetmiştik. Bu amaçla kod tarafında FindCriteria tipinden yararlanılmaktadır. Bir önceki örneğimizde, arama kriterinde sadece servis sözleşmesini(Service Contract) kullanmıştık.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir &lt;a title="WCF 4.0 Yenilikleri - WS-Discovery Ad Hoc" href="/post/wcf40-Yenilikleri-Ad-Hoc-WS-Discovery" target="_blank"&gt;&amp;ouml;nceki &lt;/a&gt;yazımızda &lt;strong&gt;WCF 4.0&lt;/strong&gt; tabanlı servislerde &lt;strong&gt;WS-Discovery&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml;n, &lt;strong&gt;Ad Hoc&lt;/strong&gt; modeline g&amp;ouml;re nasıl uygulanabileceğini g&amp;ouml;rm&amp;uuml;şt&amp;uuml;k. &lt;strong&gt;Ad Hoc&lt;/strong&gt; modelinde istemcinin, yerel ağ &amp;uuml;zerine dahil olan bir servisi aramak i&amp;ccedil;in kullanabileceği kriterleri &amp;ouml;nceden belirlemesi ve bunları kullanması gerektiğinden bahsetmiştik. Bu ama&amp;ccedil;la kod tarafında &lt;strong&gt;FindCriteria&lt;/strong&gt; tipinden yararlanılmaktadır. Bir &amp;ouml;nceki &amp;ouml;rneğimizde, arama kriterinde sadece &lt;strong&gt;servis s&amp;ouml;zleşmesini(Service Contract)&lt;/strong&gt;&amp;nbsp;kullanmıştık.&lt;/p&gt;
&lt;p&gt;Ancak, arama alanını biraz daha dar tutmak amacıyla &lt;strong&gt;Scope&lt;/strong&gt; bildirimlerinde de bulunabiliriz. Bir başka deyişle, ağ &amp;uuml;zerinde birden fazla servisin arandığı durumlarda kapsama alanımızı, ekleyeceğimiz &lt;strong&gt;Scope&lt;/strong&gt; kriterlerine g&amp;ouml;re azaltma şansımız bulunmaktadır. Bir&amp;nbsp;şekilde&amp;nbsp;istemcinin ilgi alanınıda daha kesin&amp;nbsp;&amp;ccedil;izgilerle belirlemiş olmaktayız.&amp;nbsp;Peki bunu nasıl uygulayabiliriz?&lt;/p&gt;
&lt;p&gt;Konunun servis tarafında yine konfigurasyon seviyesinde değerlendirilmesi gerekmektedir. Bu ama&amp;ccedil;la &lt;strong&gt;endpointDiscovery&lt;/strong&gt; isimli bir &lt;strong&gt;endpoint&lt;/strong&gt; davranışının kullanılması ve i&amp;ccedil;erisinde gerekli &lt;strong&gt;scope&lt;/strong&gt; tanımlamasının yapılması gerekmektedir. Bu ama&amp;ccedil;la daha &amp;ouml;nceden geliştirmiş olduğumuz servis &amp;ouml;rneğinde yer alan &lt;strong&gt;app.config&lt;/strong&gt; dosyasına aşağıdaki davranış&amp;nbsp;eklemelerini yaptığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
  &amp;lt;system.serviceModel&amp;gt;
    &amp;lt;behaviors&amp;gt;
      &amp;lt;serviceBehaviors&amp;gt;
        &amp;lt;behavior&amp;gt;
          &amp;lt;serviceDiscovery /&amp;gt;
          &amp;lt;serviceMetadata/&amp;gt;
        &amp;lt;/behavior&amp;gt;
      &amp;lt;/serviceBehaviors&amp;gt;
      &amp;lt;endpointBehaviors&amp;gt;
        &amp;lt;behavior name="epBehavior"&amp;gt;
          &amp;lt;endpointDiscovery&amp;gt;
            &amp;lt;scopes&amp;gt;
              &amp;lt;add scope="http://www.adventure.com/Math/Calculus"/&amp;gt;
            &amp;lt;/scopes&amp;gt;
          &amp;lt;/endpointDiscovery&amp;gt;
        &amp;lt;/behavior&amp;gt;
      &amp;lt;/endpointBehaviors&amp;gt;
    &amp;lt;/behaviors&amp;gt;    
    &amp;lt;services&amp;gt;
      &amp;lt;service name="ServerApp.CalculusService"&amp;gt;
        &amp;lt;endpoint address="" binding="basicHttpBinding" contract="ServerApp.ICalculus" behaviorConfiguration="epBehavior" /&amp;gt;
        &amp;lt;endpoint address="Mex" kind="mexEndpoint" /&amp;gt;
        &amp;lt;endpoint name="udpDiscovery" kind="udpDiscoveryEndpoint" /&amp;gt;
      &amp;lt;/service&amp;gt;
    &amp;lt;/services&amp;gt;
  &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;endpoint&lt;/strong&gt; davranışlarının tanımlandığı alanda, &lt;strong&gt;endpointDiscovery&lt;/strong&gt; elementi i&amp;ccedil;erisinde basit bir &lt;strong&gt;scope&lt;/strong&gt; tanımlaması yapılmaktadır. &lt;strong&gt;scopes&lt;/strong&gt; elementi i&amp;ccedil;erisinde &lt;strong&gt;n&lt;/strong&gt; sayıda &lt;strong&gt;scope&lt;/strong&gt; tanımlaması olabilir. Tanımlamaların artması elbetteki kapsama alanının aranması i&amp;ccedil;in daha dar bir kriterin oluşturulmasına neden olacaktır. Bu daralma istemcinin arama operasyonu i&amp;ccedil;in aslında bir avantaj olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Tanımlanan bu &lt;strong&gt;discovery&lt;/strong&gt; davranışının hangi &lt;strong&gt;endpoint&lt;/strong&gt; i&amp;ccedil;in ele alınacağı ise yine &lt;strong&gt;endpoint&lt;/strong&gt; elementi i&amp;ccedil;erisindeki &lt;strong&gt;behaviorConfiguration niteliği(attribute)&lt;/strong&gt; yardımıyla sağlanmaktadır. Peki buna g&amp;ouml;re istemci tarafını nasıl kodlamalıyız? İşte istemci tarafındaki kod yapısının yeni hali...&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using System.ServiceModel.Discovery;
using ClientApp.CalculusSpace;

namespace ClientApp
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Başlamak i&amp;ccedil;in tuşa basın");
            Console.ReadLine();

            DiscoveryClient disClient = new DiscoveryClient("udpDiscovery");

            // Arama kriteri oluşturuluyor. Parametre olarak servis s&amp;ouml;zleşmesini i&amp;ccedil;eren Interface verilmekte
            FindCriteria findCriteria = new FindCriteria(typeof(ICalculus));
            findCriteria.Scopes.Add(new Uri("http://www.adventure.com/Math/Calculus"));

            #region Asenkron erişim

            // Standart olay bazlı asenkron erişim tekniği kullanılır.

            disClient.FindCompleted += delegate(object sender, FindCompletedEventArgs e)
            {
                // Hata varsa bildir
                if (e.Error != null)
                {
                    Console.WriteLine(e.Error.Message);
                }
                else if (e.Cancelled == true) // İşlem iptal edilmişse bildir
                {
                    Console.WriteLine("İşlem iptali");
                }
                else // Aksi durumda işlemleri y&amp;uuml;r&amp;uuml;t ve servis operasyonunu elde edilen adres &amp;uuml;zerinden &amp;ccedil;alıştır
                {
                    FindResponse findResponse = e.Result;
                    EndpointAddress epAddress = findResponse.Endpoints[0].Address;

                    // Bulunan endPoint adresi, proxy' nin &amp;uuml;retilmesinde kullanılıyor
                    CalculusClient client = new CalculusClient("CalculusEndpoint", epAddress);

                    Console.WriteLine("{0} adresi &amp;uuml;zerinden &amp;ccedil;ağrı yapılacaktır", epAddress.Uri.ToString());
                    double result = client.Sum(3, 5);
                    Console.WriteLine("{0} + {1} = {2}", 3, 5, result.ToString());
                }
            };

            disClient.FindAsync(findCriteria);
            Console.WriteLine("Arama işlemi başladı");
            Console.ReadLine();

            #endregion
        }
    }
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi tek yaptığımız &lt;strong&gt;Scopes&lt;/strong&gt; koleksiyonuna yeni bir &lt;strong&gt;Uri&lt;/strong&gt; bilgisini, FindCriteria nesne &amp;ouml;rneği &amp;uuml;zerinden&amp;nbsp;eklemektir. Aslında buradaki metod parametresinin &lt;strong&gt;Uri&lt;/strong&gt; tipinden olması, servis tarafındaki &lt;strong&gt;scope&lt;/strong&gt; niteliğine neden bir &lt;strong&gt;url&lt;/strong&gt; formatı yazdığımızı a&amp;ccedil;ıklamaktadır. Uygulamamızı bu haliyle &amp;ccedil;alıştırdığımızda yine bir &amp;ouml;nceki &amp;ouml;rnekte olduğu gibi, servisin keşfedilip bulunduğunu ve başarılı bir şekilde &amp;ccedil;alıştırıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg68_Runtime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zetle &lt;strong&gt;Scope&lt;/strong&gt; eklentileri sayesinde istemcinin, servis keşfi yapması i&amp;ccedil;in gerekli ayarları tabir yerinde ise akord etmesi ve ger&amp;ccedil;ekten ilgilendiği alanlara ait servisleri araması m&amp;uuml;mk&amp;uuml;n hale gelebilmektedir. Konu ile ilişkili olarak &amp;ouml;rneğin son halini link olarak vermiyorum. L&amp;uuml;tfen burada yazılanları oraya taşıyıp denemekten &amp;uuml;şenmeyiniz &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&amp;nbsp;Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&amp;nbsp;&lt;/p&gt;</content>
  <pubDate>2009-08-20 16:57:00</pubDate>
  <slug>wcf40-Yenilikleri-Discovery-Scope-Kullanmak</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-40</tag>
  </tags>
  <categories>
    <category>WCF 4.0 Beta 1</category>
  </categories>
</post>