<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Entity Framework - POCO ve Lazy Loading</title>
  <description>Hatırlayacağınız üzere bir önceki yazımızda Ado.Net Entity Framework içerisinde POCO(Plain Old CLR Object) nesnelerinin kullanımını incelemeye çalışmıştık. Örneğimizde kullanmış olduğumuz LINQ sorgusu basit bir Join işlemini gerçekleştirmekteydi. Tabi Join sorgusu kullandığımız için gözden kaçırdığımız ufak ama bir o kadar da önemli bir vaka oluşmaktadır. Bu vakayı ele almak için program kodunu biraz daha değiştirdiğimizi ve aşağıdaki hale getirdiğimizi düşünelim.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Hatırlayacağınız &amp;uuml;zere &lt;a title="POCO - Plain Old CLD Objects" href="/post/Entity-Framework-POCO%28Plain-Old-CLR-Objects%29" target="_blank"&gt;bir &amp;ouml;nceki yazımızda&lt;/a&gt; &lt;strong&gt;Ado.Net Entity Framework&lt;/strong&gt; i&amp;ccedil;erisinde&lt;strong&gt; POCO(Plain Old CLR Object) &lt;/strong&gt;nesnelerinin&amp;nbsp;kullanımını incelemeye &amp;ccedil;alışmıştık. &amp;Ouml;rneğimizde kullanmış olduğumuz &lt;strong&gt;LINQ&lt;/strong&gt; sorgusu basit bir &lt;strong&gt;Join &lt;/strong&gt;işlemini ger&amp;ccedil;ekleştirmekteydi. Tabi &lt;strong&gt;Join&lt;/strong&gt; sorgusu kullandığımız i&amp;ccedil;in g&amp;ouml;zden ka&amp;ccedil;ırdığımız ufak ama bir o kadar da &amp;ouml;nemli bir vaka oluşmaktadır. Bu vakayı ele almak i&amp;ccedil;in program kodunu biraz daha değiştirdiğimizi ve aşağıdaki hale getirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Linq;
using ChinookModel;

namespace POCODans
{
    class Program
    {
        static void Main(string[] args)
        {
            using (ChinookEntities entities = new ChinookEntities())
            {
                #region Sample 2

                // Şirket bilgisi null veya boş olmayan m&amp;uuml;şteriler
                var customers = from c in entities.Customers
                                where !String.IsNullOrEmpty(c.Company)
                                select c;

                foreach (var customer in customers)
                {
                    Console.WriteLine("Company : {0} City : {1}",customer.Company,customer.City);

                    // ve bu m&amp;uuml;şterilere ait fatura bilgileri
                    foreach (var invoice in customer.Invoices)
                    {
                        Console.WriteLine("\tInvoice Date : {0} ,Total : {1}",invoice.InvoiceDate,invoice.Total.ToString("C2"));
                    }
                }

                #endregion
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rneğimizin bu yeni haline g&amp;ouml;re &lt;strong&gt;Company&lt;/strong&gt; alanı dolu olan&lt;em&gt;(Null veya Empty olmayan)&lt;/em&gt;&amp;nbsp;m&amp;uuml;şterilerin şirket adları ile bulundukları şehir bilgileri, ayrıca bu firmaların faturalarına ait tarih ve tutarları ekrana yazdırılmaktadır. Bu kodun &amp;ccedil;alışması sırasındaki beklentimiz ise&amp;nbsp;&lt;strong&gt;Customer&lt;/strong&gt; ve bunlara bağlı olan &lt;strong&gt;Invoice&lt;/strong&gt; bilgilerinin getirilmesidir. Ancak uygulamayı &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;ları elde ettiğimizi g&amp;ouml;r&amp;uuml;r&amp;uuml;z. &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg153_Runtime1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere sadece &lt;strong&gt;Customer&lt;/strong&gt; bilgileri &amp;ccedil;ekilebilmiş ancak i&amp;ccedil; &lt;strong&gt;foreach&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; tarafından o anki &lt;strong&gt;Customer &lt;/strong&gt;nesnesine&amp;nbsp;ait &lt;strong&gt;Invoice&lt;/strong&gt; bilgileri yazdırılmamıştır. Aslında bunun sebebini anlamak i&amp;ccedil;in&lt;strong&gt; SQL Server Profiler&lt;/strong&gt; aracı yardımıyla arka planda &amp;ccedil;alıştırılan &lt;strong&gt;SQL&lt;/strong&gt; sorgularına bakmamız yeterli olacaktır. Nitekim aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;lar ile karşılaştığımızı g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg153_FirstProfiler.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere kodun &amp;ccedil;alışması sonrasında sadece &lt;strong&gt;Customer&lt;/strong&gt; bilgilerinin &amp;ccedil;ekildiği g&amp;ouml;r&amp;uuml;lmektedir. Tabi bu noktada &amp;ouml;rneğimizin &lt;strong&gt;POCO&lt;/strong&gt; nesnelerini kullandığını unutmayalım. Eğer &amp;ouml;rneğimize ait&lt;strong&gt; Entity Model'&lt;/strong&gt; in otomatik olarak &amp;uuml;retildiğini d&amp;uuml;ş&amp;uuml;n&amp;uuml;rsek aynı kodun &amp;ccedil;alışma zamanında aşağıdaki sonu&amp;ccedil;ları &amp;uuml;rettiğini g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg153_Runtime2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere fatura bilgileri ekrana yazdırılmaktadır. Tabi &lt;strong&gt;SQL Server Profiler&lt;/strong&gt; aracının &amp;uuml;zerinden &amp;ccedil;alıştırılan &lt;strong&gt;SQL&lt;/strong&gt; sorgularına baktığımızda aşağıdaki ifadelerin yer aldığını da g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg153_SecondProfiler.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere ka&amp;ccedil; tane &lt;strong&gt;Customer&lt;/strong&gt; bilgisi &amp;ccedil;ekilmişse her biri i&amp;ccedil;in &lt;strong&gt;Invoice&lt;/strong&gt; tablosundan bilgi &amp;ccedil;ekmek amacıyla birer &lt;strong&gt;SQL&lt;/strong&gt; sorgusu icra edilmiştir. &amp;Ccedil;ok doğal olarak burada &lt;strong&gt;Ado.Net Entity Framework&lt;/strong&gt;' &amp;uuml;n&lt;strong&gt; 4.0&lt;/strong&gt; versiyonu ile birlikte otomatik olarak kazandığı &lt;strong&gt;Lazy Loading &lt;/strong&gt;kabiliyetinin devreye girdiğini s&amp;ouml;yleyebiliriz. Peki &lt;strong&gt;POCO&lt;/strong&gt; nesneleri i&amp;ccedil;in&lt;strong&gt; Lazy Loading&lt;/strong&gt; işlevselliğini nasıl kazandırabiliriz? Burada biraz dikkali olunması gerekmektedir. Nitekim &lt;strong&gt;Lazy Loading&lt;/strong&gt; yeteneği i&amp;ccedil;in yapılacak eklentiler, &lt;strong&gt;POCO&lt;/strong&gt; nesnelerinden &lt;strong&gt;Framework&lt;/strong&gt;' e doğru bir bağımlılık &lt;span style="text-decoration: underline;"&gt;oluşturmamalıdır&lt;/span&gt;. Normal şartlarda &lt;strong&gt;Lazy Loading &lt;/strong&gt;işlemi i&amp;ccedil;in akla gelen ilk y&amp;ouml;ntem &lt;strong&gt;Customer&lt;/strong&gt; tipi i&amp;ccedil;erisinde yer alan &lt;strong&gt;Invoices&lt;/strong&gt; &amp;ouml;zelliğinin &lt;strong&gt;get&lt;/strong&gt; bloğunda gerekli kodlamaları yapmaktır. Oysaki bu hamle sonucunda&amp;nbsp;&lt;strong&gt;Framework&lt;/strong&gt;' e bir bağımlılık oluşturulması ka&amp;ccedil;ınılmazdır ki &lt;strong&gt;POCO&lt;/strong&gt; nesnelerinin ilkesine aykırı bir durumdur. Bu nedenle &lt;strong&gt;dinamik olarak &amp;uuml;retilen proxy tiplerinden(Dynamically Generated Proxies)&lt;/strong&gt;&amp;nbsp;yararlanılmaktadır. Bu proxy tipleri aslında &lt;strong&gt;POCO&lt;/strong&gt; nesnesinden t&amp;uuml;reyen ve ilgili &amp;ouml;zellikleri &lt;strong&gt;override&lt;/strong&gt; ederek &lt;strong&gt;Lazy Loading&lt;/strong&gt; gibi yetenekleri i&amp;ccedil;eriye enjekte eden sınıflar olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Aslında &lt;strong&gt;Ado.Net Team Blog&lt;/strong&gt;' da bu tip &lt;strong&gt;Proxy&lt;/strong&gt; sınıflarının nasıl geliştirildiği ve kullanıldığından bahsedilmektedir. Ancak biz &amp;ccedil;ok daha basit bir yol izliyor olacağız.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;POCO&lt;/strong&gt; nesnelerinde &lt;strong&gt;Lazy Loading &lt;/strong&gt;işlemini ger&amp;ccedil;ekleştirebilmemiz i&amp;ccedil;in&amp;nbsp;&amp;uuml;&amp;ccedil; basit kurala dikkat etmemiz yeterlidir. Buna g&amp;ouml;re &lt;strong&gt;Context &lt;/strong&gt;tipine ait &lt;strong&gt;yapıcı metod(Constructor) &lt;/strong&gt;i&amp;ccedil;erisinde gerekli bazı &amp;uuml;st &amp;ouml;zelliklerin etkinleştirilmesi, &lt;strong&gt;Navigation Property&lt;/strong&gt;' nin &lt;strong&gt;virtual &lt;/strong&gt;olarak tanımlanması ve &lt;strong&gt;POCO &lt;/strong&gt;tipinin &lt;strong&gt;public &lt;/strong&gt;ve &lt;strong&gt;sealed &lt;span style="text-decoration: underline;"&gt;olmaması&lt;/span&gt; &lt;/strong&gt;yeterlidir. &amp;Ouml;rneğimizin kod i&amp;ccedil;eriğinin yeni hali aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Data.Objects;

namespace ChinookModel
{
    public class ChinookEntities
        :ObjectContext
    {
        private ObjectSet&amp;lt;Customer&amp;gt; _customers;
        private ObjectSet&amp;lt;Invoice&amp;gt; _invoices;
        
        public ChinookEntities()
            :base("name=ChinookEntities")
        {
            // KURAL 1: 
            // Dinamik proxy &amp;uuml;retimi etkinleştirilir. Varsayılan değeri true dur
            this.ContextOptions.ProxyCreationEnabled = true;
            // &amp;Ccedil;alışma zamanında Navigation Property' lere erişildiğinde Lazy Loading işleminin otomatik olarak ger&amp;ccedil;ekleştirilmesi i&amp;ccedil;in true değeri atanır.
            this.ContextOptions.LazyLoadingEnabled = true;
        }

        public ObjectSet&amp;lt;Customer&amp;gt; Customers
        {
            get
            {
                if (_customers == null)
                {
                    _customers = base.CreateObjectSet&amp;lt;Customer&amp;gt;();
                }
                return _customers;
            }
        }

        public ObjectSet&amp;lt;Invoice&amp;gt; Invoices
        {
            get
            {
                if (_invoices == null)
                {
                    _invoices = base.CreateObjectSet&amp;lt;Invoice&amp;gt;();
                }
                return _invoices;
            }
        }
    }

    // KURAL 2 : POCO sınıfı public olmalı ve sealed olarak işaretlenmemelidir.
    public class Customer
    {
        public int CustomerId { get; set; }
        public string FirstName { get; set; }
        public string LastName { get; set; }
        public string Company { get; set; }
        public string City { get; set; }
        public string Country { get; set; }
        public string Email { get; set; }

        private List&amp;lt;Invoice&amp;gt; _invoices = new List&amp;lt;Invoice&amp;gt;();

        // KURAL 3 : Navigation Property &amp;ouml;zelliğinin virtual olması gerekir.
        public virtual List&amp;lt;Invoice&amp;gt; Invoices
        {
            get { return _invoices; }
            set { _invoices = value; }
        }
    }

    public class Invoice
    {
        public int InvoiceId { get; set; }
        public int CustomerId { get; set; }
        public DateTime InvoiceDate{ get; set; }
        public string BillingCity { get; set; }
        public string BillingCountry { get; set; }
        public decimal Total { get; set; }
        public Customer Customer { get; set; } 
    }
}&lt;/pre&gt;
&lt;p&gt;Ve &amp;ouml;rneğimizin &amp;ccedil;alışma zamanı hali;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg153_Runtime3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Volaaaa!!! &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&amp;nbsp;&amp;Uuml;stelik &lt;strong&gt;SQL Server Profiler&lt;/strong&gt; aracında da tam istediğimiz şekilde sorguların &amp;ccedil;alıştırıldığını g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg153_LastProfiler.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabi buradaki kuralların neden var olduğuna dikkat edilmelidir. S&amp;ouml;z gelimi &lt;strong&gt;LazyLoadingEnabled&lt;/strong&gt;, &lt;strong&gt;ProxyCreationEnabled&amp;nbsp;&lt;/strong&gt;değerlerinin &lt;strong&gt;true&lt;/strong&gt; olması &amp;ccedil;alışma zamanındaki &lt;strong&gt;Entity&lt;/strong&gt; motoru i&amp;ccedil;in gereklidir. Bu değerlerin &lt;strong&gt;false&lt;/strong&gt; olması halinde&amp;nbsp;bir hata mesajı alınmaz ancak istenen &amp;ccedil;alışma zamanı &amp;ccedil;ıktıları da elde edilmez.&amp;nbsp;Diğer taraftan &lt;strong&gt;POCO&lt;/strong&gt; tipinin &lt;strong&gt;sealed&lt;/strong&gt; olması halinde zaten &lt;strong&gt;virtual&lt;/strong&gt; eleman i&amp;ccedil;ermesi ile ilişkili olarak&amp;nbsp;derleme zamanı hatası alınacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg153_Error2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Buna ek olarak derleme zamanı &lt;strong&gt;POCO&lt;/strong&gt; nesnesinin &lt;strong&gt;public &lt;/strong&gt;olmasını beklemektedir. &lt;strong&gt;Public&lt;/strong&gt; olarak tanımlanmadığı takdirde yine bir hata mesajı &amp;uuml;retilecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f2%2fblg153_Error1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Navigation Property&lt;/strong&gt;' nin &lt;strong&gt;virtual&lt;/strong&gt; olarak tanımlanmaması derleme veya &amp;ccedil;alışma zamanında bir hata mesajı &amp;uuml;retmezken &lt;strong&gt;Lazy Loading&lt;/strong&gt; işleminin de &lt;span style="text-decoration: underline;"&gt;&amp;ccedil;alışmamasına&lt;/span&gt; neden olmaktadır. İşte bu kadar. Bu yazımızda &lt;strong&gt;POCO&lt;/strong&gt; nesnelerinin kullanıldığı vakalarda&lt;strong&gt; Lazy Loading&lt;/strong&gt; işlemlerinin nasıl ektinleştirilebileceğini incelemeye &amp;ccedil;alıştık. Unuttuğumuz bir şey var mı? Aslında olabilir. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Eğer &amp;ouml;yleyse de ilerleyen yazılarımızda ele almaya &amp;ccedil;alışacağız. Bir sonraki yazımızda g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f4%2fPOCOandLazyLoading_RTM.rar"&gt;POCOandLazyLoading_RTM.rar (90,73 kb)&lt;/a&gt; &lt;strong&gt;[&amp;Ouml;rnek uygulama Visual Studio 2010 Ultimate RTM s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde geliştirilmiş test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-05-09 21:55:00</pubDate>
  <slug>Entity-Framework-POCO-ve-Lazy-Loading</slug>
  <tags>
    <tag>adonet-entity-framework-40</tag>
    <tag>linq</tag>
    <tag>language-integrated-query</tag>
  </tags>
  <categories>
    <category>Entity Framework</category>
  </categories>
</post>