<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Interface (Arayüz) Kullanımına Giriş</title>
  <description>Bugünkü makalemizde, nesneye dayalı programlamanın önemli kavramlarından birisi olan arayüzleri incelemeye çalışacağız. Öncelikle, arayüz'ün tanımını yapalım. Bir arayüz, başka sınıflar için bir rehberdir. Bu kısa tanımın arkasında, deryalar gibi bir kavram denizi olduğunu söylemekte yarar buluyorum.. Arayüzün ne olduğunu tam olarak anlayabilmek için belkide asıl kullanım amacına bakmamız gerekmektedir.</description>
  <content>&lt;p align="left"&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p align="left"&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde, nesneye dayalı programlamanın &amp;ouml;nemli kavramlarından birisi olan aray&amp;uuml;zleri incelemeye &amp;ccedil;alışacağız. &amp;Ouml;ncelikle, aray&amp;uuml;z'&amp;uuml;n tanımını yapalım. Bir aray&amp;uuml;z, başka sınıflar i&amp;ccedil;in bir rehberdir. Bu kısa tanımın arkasında, deryalar gibi bir kavram denizi olduğunu s&amp;ouml;ylemekte yarar buluyorum.. Aray&amp;uuml;z&amp;uuml;n ne olduğunu tam olarak anlayabilmek i&amp;ccedil;in belkide asıl kullanım amacına bakmamız gerekmektedir.&lt;/p&gt;
&lt;p align="left"&gt;C++ programlama dilinde, sınıflar arasında &amp;ccedil;ok kalıtımlılık s&amp;ouml;z konusu idi. Yani bir sınıf, birden fazla sınıftan t&amp;uuml;retilebiliyordu kalıtımsal olarak. Ancak bu teknik bir s&amp;uuml;re sonra kodların dahada karmaşıklaşmasına ve anlaşılabilirliğin azalmasına neden oluyordu. Bu sebeten &amp;ouml;t&amp;uuml;r&amp;uuml; değerli Microsoft mimarları, C# dilinde, bir sınıfın sadece tek bir sınıfı kalıtımsal olarak alabileceği kısıtlmasını getirdiler. &amp;Ccedil;ok kalıtımlık g&amp;ouml;revini ise anlaşılması daha kolay aray&amp;uuml;zlere bıraktılar. İşte aray&amp;uuml;zleri kullanmamızın en b&amp;uuml;y&amp;uuml;k nedenlerinden birisi budur.&lt;/p&gt;
&lt;p align="left"&gt;Diğer yandan, uygulamalarımızın geleceği a&amp;ccedil;ısından da aray&amp;uuml;zlerin &amp;ccedil;ok kullanışlı olabileceğini s&amp;ouml;ylememiz gerekiyor. D&amp;uuml;ş&amp;uuml;n&amp;uuml;nk&amp;uuml;, bir ekip tarafından yazılan ve geliştirilen bir uygulamada g&amp;ouml;revlisiniz. Kullandığınız nesnelerin, t&amp;uuml;retildiği sınıflar zaman i&amp;ccedil;erisinde, gelişen yeniliklere adapte olabilmek amacıyla, sayısız yeni metoda, &amp;ouml;zelliğe vb.. sahip olduklarını farzedin. Bir s&amp;uuml;re sonra, nesnelerin t&amp;uuml;retildiği sınıflar i&amp;ccedil;erisinde yer alan kavram kargaşısını, "bu neyi yapıyordu?, kime yapıyordu? , ne i&amp;ccedil;in yapıyordu?" gibi soruların ne kadar &amp;ccedil;ok sorulduğunu d&amp;uuml;ş&amp;uuml;n&amp;uuml;n. Oysa uygulamanızdaki sınıfların izleyeceği yolu g&amp;ouml;steren rehber(ler) olsa fena mı olurdu? İşte size aray&amp;uuml;zler. Bir aray&amp;uuml;z oluşturun ve bu aray&amp;uuml;z&amp;uuml; uygulayan sınıfların hangi metodları, &amp;ouml;zellikleri vb kullanması gerektiğine karar verin. Programın gelişmesimi gerekiyor?. Yeni niteliklere mi ihtiyacın var? İster kullanılan aray&amp;uuml;zleri, birbirlerinden kalıtımsal olarak t&amp;uuml;retin, ister yeni aray&amp;uuml;zler tasarlayın. Tek yapacağınız sınıfların hangi aray&amp;uuml;zlerini kullanacağını belirtmek olucaktır.&lt;/p&gt;
&lt;p align="left"&gt;Bu a&amp;ccedil;ıklamalar ışığında bir aray&amp;uuml;z nasıl tanımlanır ve hangi &amp;uuml;yelere sahiptir bundan bahsedelim.Bir aray&amp;uuml;z tanımlanması aşağıdaki gibi yapılır. Yazılan kod bloğunun bir aray&amp;uuml;z olduğunu Interface anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; belirtmektedir. Aray&amp;uuml;z isminin başında I harfi kullanıldığına dikkat edin. Bu kullanılan sınıfın bir aray&amp;uuml;z olduğunu anlamamıza yarayan bir isim kullanma tekniğidir. Bu sayede, sınıfların kalıtımsal olarak aldığı elemanların aray&amp;uuml;z olup olamdığını daha kolayca anlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public interface IArayuz
{

}&lt;/pre&gt;
&lt;p align="left"&gt;Tanımlama g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi son derece basit. Şimdi aray&amp;uuml;zlerin &amp;uuml;yelerine bir g&amp;ouml;z atalım. Aray&amp;uuml;zler, sadece aşağıdaki &amp;uuml;yelere sahip olabilirler.&lt;/p&gt;
&lt;div align="left"&gt;
&lt;table id="AutoNumber1" border="1" width="30%" cellspacing="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#C0C0C0" width="100%" height="23"&gt;Aray&amp;uuml;z &amp;Uuml;yeleri&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#008000" width="100%" height="22"&gt;&amp;ouml;zellikler (properties)&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#008000" width="100%" height="24"&gt;metodlar (methods)&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#008000" width="100%" height="24"&gt;olaylar (events)&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#008000" width="100%" height="26"&gt;indeksleyiciler (indexers)&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p align="left"&gt;Tablo 1. Aray&amp;uuml;zlerin sahip olabileceği &amp;uuml;yeler&lt;/p&gt;
&lt;p align="left"&gt;Diğer yandan, aray&amp;uuml;zler i&amp;ccedil;erisinde aşağıdaki &amp;uuml;yeler kesinlikle kullanılamazlar.&lt;/p&gt;
&lt;div align="left"&gt;
&lt;table id="AutoNumber1" border="1" width="30%" cellspacing="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#C0C0C0" width="100%" height="26"&gt;Aray&amp;uuml;zlerde Kullanılamayan &amp;Uuml;yeler&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#FF0000" width="100%" height="27"&gt;yapıcılar (constructors)&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#FF0000" width="100%" height="27"&gt;yokediciler (destructors)&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#FF0000" width="100%" height="28"&gt;alanlar (fields)&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p align="left"&gt;Tablo 2. Aray&amp;uuml;zlerde kullanılamayan &amp;uuml;yeler.&lt;/p&gt;
&lt;p align="left"&gt;Aray&amp;uuml;zler Tablo1 deki &amp;uuml;yelere sahip olabilirler. Peki bu &amp;uuml;yeler nasıl tanımlanır. Herşeyden &amp;ouml;nce aray&amp;uuml;zler ile ilgili en &amp;ouml;nemli kural onun bir rehber olmasıdır. Yani aray&amp;uuml;zler sadece, kendisini rehber alan sınıfların kullanacağı &amp;uuml;yeleri tanımlarlar. Herhangibir kod satırı i&amp;ccedil;ermezler. Sadece &amp;ouml;zelliğin, metodun, olayın veya indeksleyicinin tanımı vardır. Onların kolay okunabilir olmalarını sağlayan ve &amp;ccedil;oklu kalıtım i&amp;ccedil;in tercih edilmelerine neden olan sebepte budur. &amp;Ouml;rneğin;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public interface IArayuz
{
    /* double tipte bir &amp;ouml;zellik tanımı. get ve set anahtar s&amp;ouml;zc&amp;uuml;klerinin herhangibir blok {} i&amp;ccedil;ermediğine dikkat edin. */
    double isim
    {
        get;
        set;
    }

    /* Yanlız okunabilir (ReadOnly) string tipte bir &amp;ouml;zellik tanımı. */

    string soyisim
    {
        get;
    }
    /* integer değer d&amp;ouml;nd&amp;uuml;ren ve ili integer parametre alan bir metod tanımı. Metod tanımlarındada metodun d&amp;ouml;n&amp;uuml;ş tipi, parametreleri, ismi dışında herhangibir kod satırı olmadığına dikkat edin. */

    int topla(int a, int b);
    /* D&amp;ouml;n&amp;uuml;ş değeri olmayan ve herhangibir parametre almayan bir metod tanımı. */

    void yaz();
    /* Bir indeksleyici tanımı */

    string this[int index]
    {
        get;
        set;
    }
}&lt;/pre&gt;
&lt;p align="left"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi sadece tanımlamalar mevcut. Herhangibir kod satırı mevcut değil. Bir aray&amp;uuml;z tasarlarken uymamız gereken bir takım &amp;ouml;nemli kurallar vardır. Bu kurallar aşağıdaki tabloda kısaca listelenmiştir.&lt;/p&gt;
&lt;div align="left"&gt;
&lt;table id="AutoNumber4" border="1" width="100%" cellspacing="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#C0C0C0" width="7%" height="60"&gt;1&lt;/td&gt;
&lt;td width="193%" height="60"&gt;Bir aray&amp;uuml;z'&amp;uuml;n t&amp;uuml;m &amp;uuml;yeleri public kabul edilir. Private, Protected gibi belirti&amp;ccedil;ler kullanamayız. Bunu yaptığımız takdirde &amp;ouml;rneğin bir elemanı private tanımladığımız takdirde, derleme zamanında aşağıdaki hatayı alırız.
&lt;p&gt;"The modifier 'private' is not valid for this item"&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#C0C0C0" width="7%" height="57"&gt;2&lt;/td&gt;
&lt;td width="193%" height="57"&gt;Diğer yandan bir metodu public olarakta tanımlayamayız. &amp;Ccedil;&amp;uuml;nk&amp;uuml; zaten varsayılan olarak b&amp;uuml;t&amp;uuml;n &amp;uuml;yeler public tanımlanmış kabul edilir. Bir metodu public tanımladığımızda yine derleme zamanında aşağıdaki hatayı alırız.
&lt;p&gt;"The modifier 'public' is not valid for this item"&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#C0C0C0" width="7%" height="62"&gt;3&lt;/td&gt;
&lt;td width="193%" height="62"&gt;Bir aray&amp;uuml;z, bir yapı(struct)'dan veya bir sınıf(class)'tan kalıtımla t&amp;uuml;retilemez. Ancak, bir aray&amp;uuml;z&amp;uuml; başka bir aray&amp;uuml;zden veya aray&amp;uuml;zlerden kalıtımsal olarak t&amp;uuml;retebiliriz.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#C0C0C0" width="7%" height="58"&gt;4&lt;/td&gt;
&lt;td width="193%" height="58"&gt;Aray&amp;uuml;z elemanlarını static olarak tanımlayamayız.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#C0C0C0" width="7%" height="58"&gt;5&lt;/td&gt;
&lt;td width="193%" height="58"&gt;Aray&amp;uuml;zlerin uygulandığı sınıflar, aray&amp;uuml;zde tanımlanan b&amp;uuml;t&amp;uuml;n &amp;uuml;yeleri kullanmak zorundadır.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p align="left"&gt;Tablo 3. Uyulması gereken kurallar.&lt;/p&gt;
&lt;p&gt;Şimdi bu kadar laftan sonra konuyu daha iyi anlayabilmek i&amp;ccedil;in basit ama a&amp;ccedil;ıklayıcı bir &amp;ouml;rnek geliştirelim. &amp;Ouml;nce aray&amp;uuml;z&amp;uuml;m&amp;uuml;z&amp;uuml; tasarlayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public interface IArayuz
{
     void EkranaYaz();
     int Yas
     {
          get;
          set;
     }
     string isim
     {
          get;
          set;
     }
}&lt;/pre&gt;
&lt;p&gt;Şimdide bu aray&amp;uuml;z&amp;uuml; kullanacak sınıfımızı tasarlayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Kisiler:IArayuz
{
}&lt;/pre&gt;
&lt;p align="left"&gt;Şimdi bu anda uygulamayı derlersek, IArayuz'&amp;uuml;ndeki elemanları sınıfımız i&amp;ccedil;inde kullanmadığımızdan dolayı aşağıdaki derleme zamanı hatalarını alırız.&lt;/p&gt;
&lt;p align="left"&gt;'Interfaces1.Kisiler' does not implement interface member 'Interfaces1.IArayuz.EkranaYaz()'&lt;/p&gt;
&lt;p align="left"&gt;'Interfaces1.Kisiler' does not implement interface member 'Interfaces1.IArayuz.isim'&lt;/p&gt;
&lt;p align="left"&gt;'Interfaces1.Kisiler' does not implement interface member 'Interfaces1.IArayuz.Yas'&lt;/p&gt;
&lt;p align="left"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi kullanmadığımız t&amp;uuml;m aray&amp;uuml;z &amp;uuml;yeleri i&amp;ccedil;in bir hata mesajı oluştu. Bu noktada şunu tekrar hatırlatmak istiyorum,&lt;/p&gt;
&lt;div align="left"&gt;
&lt;table id="AutoNumber7" border="1" width="64%" cellspacing="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#FF0000" width="100%" height="45"&gt;&lt;strong&gt; Aray&amp;uuml;zlerin uygulandığı sınıflar, aray&amp;uuml;zde(lerde) tanımlanan t&amp;uuml;m &amp;uuml;yeleri kullanmak yani kodlamak zorundadır.&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p&gt;Şimdi sınıfımızı d&amp;uuml;zg&amp;uuml;n bir şekilde geliştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Kisiler:IArayuz /* Sınıfın kullanacağı aray&amp;uuml;z burada belirtiliyor.*/
{
     private int y;
     private string i;

     /* Bir sınıfa bir aray&amp;uuml;z uygulamamız, bu sınıfa başka &amp;uuml;yeler eklememizi engellemez. Burada &amp;ouml;rneğin sınıfın yapıcı metodlarınıda d&amp;uuml;zenledik. */
 
     public Kisiler()
     {
          y=18;
          i="Yok";
     }

     /* Dikkat ederseniz &amp;ouml;zelliğin herşeyi, aray&amp;uuml;zdeki ile aynı olmalıdır. Veri tipi, ismi vb... Bu t&amp;uuml;m diğer aray&amp;uuml;z &amp;uuml;yelerinin, sınıf i&amp;ccedil;erisinde uygulanmasında da ge&amp;ccedil;erlidir. */
 

     public Kisiler(string ad,int yas)
     {
          y=yas;
          i=ad;
     }

     public int Yas
     {
          get
          {
               return y;
          }
          set
          {
               y=value;
          }
     }

     public string Isim
     {
          get
          {
               return i;
          }
          set
          {
               i=value;
          }
     }
     public void EkranaYaz()
     {
          Console.WriteLine("Adım:"+i);
          Console.WriteLine("Yaşım:"+y);
     }
}&lt;/pre&gt;
&lt;p&gt;Şimdi oluşturduğumuz bu sınıfı nasıl kullanacağımıza bakalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class Class1
{
     static void Main(string[] args)
     {
          Kisiler kisi=new Kisiler("Burak",27);
          Console.WriteLine("Yaşım "+kisi.Yas.ToString());
          Console.WriteLine("Adım "+kisi.Isim);
          Console.WriteLine("-----------");
          kisi.EkranaYaz();
     }
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdaki sonucu elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk38_1.gif" alt="" width="244" height="145" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. Uygulamanın &amp;Ccedil;alışması Sonucu.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Geldik bir makalemizin daha sonuna. Bu makalemizde aray&amp;uuml;zlere kısa bir giriş yaptık. Bir sonraki makalemizde, bir sınıfa birden fazla aray&amp;uuml;z&amp;uuml;n nasıl uygulanacağını incelemeye &amp;ccedil;alışacağız. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-01-08 10:00:00</pubDate>
  <slug>Interface-(Arayüz)-Kullanımına-Giriş-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>interface</tag>
    <tag>oop</tag>
    <tag>inheritance</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>