<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>HashTable Koleksiyon Sınıfı</title>
  <description>Bugünkü makalemizde HashTable koleksiyon sınıfını incelemeye çalışacağız.  Bildiğiniz gibi Koleksiyonlar System.Collections namespace'inde yer almakta olup, birbirlerinin aynı veya birbirlerinden farklı veri tiplerinin bir arada tutulmasını sağlayan diziler oluşturmamıza imkan sağlamaktadırlar. Pek çok koleksiyon sınıfı vardır.</description>
  <content>&lt;p&gt;Değerli&amp;nbsp; Okurlarım, Merhabalar. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde HashTable koleksiyon sınıfını incelemeye &amp;ccedil;alışacağız.&amp;nbsp; Bildiğiniz gibi Koleksiyonlar System.Collections namespace'inde yer almakta olup, birbirlerinin aynı veya birbirlerinden farklı veri tiplerinin bir arada tutulmasını sağlayan diziler oluşturmamıza imkan sağlamaktadırlar. Pek &amp;ccedil;ok koleksiyon sınıfı vardır. Bug&amp;uuml;n&amp;nbsp; bu koleksiyon sınıflarından birisi olan HashTable koleksiyon sınıfını inceleyeceğiz.&lt;/p&gt;
&lt;p&gt;HashTable&amp;nbsp;&amp;nbsp; koleksiyon sınıfında veriler key-value dediğimiz anahtar-değer &amp;ccedil;iftleri şeklinde tutulmaktadırlar.&amp;nbsp; T&amp;uuml;m koleksiyon sınıflarının ortak &amp;ouml;zelliği barındırdıkları verileri object tipinde olmalarıdır. Bu nedenle, HashTable'lardada key ve value değerleri herhangibir veri tipinde olabilirler. Temel olarak bunların her biri birer DictionaryEntry nesnesidir. Bahsetmiş olduğumuz key-value &amp;ccedil;iftleri hash tablosu adı verilen bir tabloda saklanırlar. Bu değer &amp;ccedil;iftlerine erişmek i&amp;ccedil;in kullanılan bir takım karmaşık kodlar vardır. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Key değerleri tektir ve değiştirilemezler. Yani bir key-value &amp;ccedil;iftini koleksiyonumuza eklediğimizde, bu değer &amp;ccedil;iftinin value değerini değiştirebilirken, key değerini değiştiremeyiz. Ayrıca key değerleri benzersiz olduklarında tam anlamıyla birer anahtar alan vazifesi g&amp;ouml;r&amp;uuml;rler. Diğer yandan value değerline null değerler atayabilirken, anahtar alan niteliğindeki Key değerlerine null değerler atayamayız. Şayet uygulamamızda varolan bir Key değerini eklemek istersek ArgumentException istisnası ile karşılaşırız.&amp;nbsp;&amp;nbsp; HashTable koleksiyonu verilere hızı bir bi&amp;ccedil;imde ulaşmamızı sağlayan bir kodlama yapısına sahiptir.&amp;nbsp; Bu nedenle &amp;ouml;zellikle arama maliyetlerini d&amp;uuml;ş&amp;uuml;rd&amp;uuml;ğ&amp;uuml; i&amp;ccedil;in tercih edilmektedir. Şimdi&amp;nbsp; konuyu daha iyi pekiştirebilmek amacıyla, hemen basit bir uygulama geliştirelim.&lt;/p&gt;
&lt;p&gt;Uygulamamızda, bir HastTable koleksiyonuna key-value &amp;ccedil;iftleri ekliyecek, belirtilen key'in sahip olduğu değere bakılacak, t&amp;uuml;m HashTable'ın i&amp;ccedil;erdiği key-value &amp;ccedil;iftleri listelenecek, eleman &amp;ccedil;iftlerini HashTable'dan &amp;ccedil;ıkartacak vb... işlemler ger&amp;ccedil;ekleştireceğiz. Form tasarımını ben aşağıdaki şekildeki gibi yaptım. Temel olarak teknik terimlerin t&amp;uuml;rk&amp;ccedil;e karşılığına dair minik bir s&amp;ouml;z&amp;uuml;ğ&amp;uuml; bir HashTable olarak tasarlayacağız. &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&amp;nbsp;&lt;img src="/makale/images/mk22_1.gif" alt="" width="488" height="328" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt;&amp;nbsp;1. Form Tasarımımız.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdi kodlarımıza bir g&amp;ouml;z atalım. &amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;System.Collections.Hashtable htTeknikSozluk;

/* HashTable koleksiyon nesnemizi tanımlıyoruz.*/ 
private void Form1_Load(object sender, System.EventArgs e)
{
    htTeknikSozluk=new System.Collections.Hashtable(); /* HashTable nesnemizi oluşturuyoruz.*/
    stbDurum.Text=htTeknikSozluk.Count.ToString();
/* HashTable'ımızdaki eleman sayısını Count &amp;ouml;zelliği ile &amp;ouml;ğreniyoruz.*/
} 

private void btnEkle_Click(object sender, System.EventArgs e)
{

    try
    {
        htTeknikSozluk.Add(txtKey.Text,txtValue.Text);
        /* HashTable'ımıza key-value &amp;ccedil;ifti ekleyebilmek i&amp;ccedil;in Add metodu kullanılıyor.*/
        lstAnahtar.Items.Add(txtKey.Text);
        stbDurum.Text=htTeknikSozluk.Count.ToString();  
    }
    catch(System.ArgumentException) /* Eğer var olan bir key'i tekrar eklemeye &amp;ccedil;alışırsak bu durumda ArgumentException istisnası fırlatılacaktır. Bu durumda, belirtilen key-value &amp;ccedil;ifti HashTable koleksiyonuna eklenmez. Bu durumu kullanıcıya bildiriyoruz.*/
    {
        stbDurum.Text=txtKey.Text+" Zaten HashTable Koleksiyonunda Mevcut!";
    }
} 

private void lstAnahtar_DoubleClick(object sender, System.EventArgs e)
{
    string deger;
    deger=htTeknikSozluk[lstAnahtar.SelectedItem.ToString()].ToString();

    /* HashTable'daki bir değere ulaşmak i&amp;ccedil;in, k&amp;ouml;şeli parantezler arasında aranacak key değerini giriyoruz. Sonucu bir string değişkenine aktarıyoruz.*/
    MessageBox.Show(deger,lstAnahtar.SelectedItem.ToString());
} 

private void btnSil_Click(object sender, System.EventArgs e)
{
    if(htTeknikSozluk.Count==0)
    {
        stbDurum.Text="&amp;Ccedil;ıkartılabilecek hi&amp;ccedil; bir eleman yok";
    }
    else if(lstAnahtar.SelectedIndex==-1)
    {
        stbDurum.Text="Listeden bir eleman se&amp;ccedil;melisiniz";
    }    
    else
    {
        htTeknikSozluk.Remove(lstAnahtar.SelectedItem.ToString());
        /* Bir HashTable'dan bir nesneyi &amp;ccedil;ıkartmak i&amp;ccedil;in, Remove metodu kullanılır. Bu metod parametre olarak &amp;ccedil;ıkartılmak istenen değer &amp;ccedil;iftinin key değerini alır.*/
        lstAnahtar.Items.Remove(lstAnahtar.SelectedItem);
        stbDurum.Text="&amp;Ccedil;ıkartıldı";
        stbDurum.Text=htTeknikSozluk.Count.ToString();
    }
} 

private void btnTumu_Click(object sender, System.EventArgs e)
{
    lstTumListe.Items.Clear(); 
    /* Aşağıdaki satırlarda, bir HashTable koleksiyonu i&amp;ccedil;inde yer alan t&amp;uuml;m elemanlara nasıl erişildiğini g&amp;ouml;rmekteyiz. Keys metodu ile HashTable koleksiyonumuzda yer alan t&amp;uuml;m anahtar değerlerini (key'leri), ICollection aray&amp;uuml;z&amp;uuml;(interface) t&amp;uuml;r&amp;uuml;nden bir nesneye atıyoruz. Foreach d&amp;ouml;ng&amp;uuml;m&amp;uuml;z ile bu nesne i&amp;ccedil;indeki her bir anahtarı, HashTable koleksiyonunda bulabiliyoruz.*/
    ICollection anahtar=htTeknikSozluk.Keys; 
    foreach(string a in anahtar)
    {
        lstTumListe.Items.Add(a+"="+htTeknikSozluk[a].ToString());
    } 
} &lt;/pre&gt;
&lt;p&gt;Şimdi&amp;nbsp; uygulamamızı &amp;ccedil;alıştırıp deneyelim.&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt;&lt;img src="/makale/images/mk22_2.gif" alt="" width="487" height="326" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt;&amp;nbsp;2.&amp;nbsp; Programın &amp;Ccedil;alışmasnının sonucu.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2003-12-18 12:00:00</pubDate>
  <slug>HashTable-Koleksiyon-Sınıfı-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>hashtable</tag>
    <tag>net</tag>
    <tag>collections</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>