<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>TPL ve Shared Data Isolation</title>
  <description>Task Parallel Library alt yapısını kullanarak geliştirdiğimiz paralel kodlarda önem arz eden konulardan birisi de, paylaşılan verilerin hesaplamalara katıldığı durumlardaki sonuç tutarlılıklarının nasıl sağlanacağıdır. Bunun bilinen bir kaç yolu vardır. Aslında bir tanesi ve en basiti kodu tamamen senkron olarak geliştirmektir. Yani paralel çalıştırmak gibi bir maceraya hiç girmemektir. Diğer bir yol ise Task örnekleri içerisinde ele alınan paylaşılmış verilerin izole edilerek kullanılmasıdır.</description>
  <content>&lt;p&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border-width: 0px;" title="blg210_Giris" src="/pics/blg210_Giris_thumb.jpg" alt="blg210_Giris" width="304" height="203" align="right" border="0" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Sanıyorum ki, &lt;strong&gt;&amp;ldquo;Bir elin nesi var, iki elin sesi var&amp;rdquo;&lt;/strong&gt; deyimini bilmeyen yoktur. Bir matematik&amp;ccedil;i olarak t&amp;uuml;me varım yaparsam, n tane elin &amp;ccedil;ok daha sesli olduğunu ispat etmek isteyebilirim. Ne varki d&amp;uuml;nya kupasındaki n tane elin tuttuğu Vuvuzela&amp;rsquo; ların &amp;ccedil;ıkarttığı sesi d&amp;uuml;ş&amp;uuml;n&amp;uuml;nce, bu teoremden hemen vazge&amp;ccedil;ebilirim de. Neyseki konumuz bu değil. Konumuz paralel k&amp;uuml;t&amp;uuml;phanede, paylaşımlı verileri nasıl ele alabileceğimiz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Task Parallel Library&lt;/strong&gt; alt yapısını kullanarak geliştirdiğimiz paralel kodlarda &amp;ouml;nem arz eden konulardan birisi de, paylaşılan verilerin hesaplamalara katıldığı durumlardaki sonu&amp;ccedil; tutarlılıklarının nasıl sağlanacağıdır. Bunun bilinen bir ka&amp;ccedil; yolu vardır. Aslında bir tanesi ve en basiti kodu tamamen senkron olarak geliştirmektir. Yani paralel &amp;ccedil;alıştırmak gibi bir maceraya hi&amp;ccedil; girmemektir. Diğer bir yol ise &lt;strong&gt;Task &lt;/strong&gt;&amp;ouml;rnekleri i&amp;ccedil;erisinde ele alınan paylaşılmış verilerin izole edilerek kullanılmasıdır. Aslında durumu daha kolay bir şekilde analiz edebilmek i&amp;ccedil;in &amp;ouml;nce sorunu masaya yatıralım. Bu ama&amp;ccedil;la aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alarak ilerleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Threading.Tasks;

namespace SharedDataScenarios 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            for (int i = 0; i &amp;lt; 10; i++) 
            { 
                TestMethod(); 
            }

            Console.WriteLine("İşlemler tamamlandı.\nProgramı kapatmak i&amp;ccedil;in bir tuşa basınız"); 
            Console.ReadLine(); 
        }

        private static void TestMethod() 
        { 
           Plane f16 = new Plane(); 
            Task[] tasks = new Task[5];

            for (int i = 0; i &amp;lt; 5; i++) 
            { 
                tasks[i] = new Task(() =&amp;gt; 
               { 
                    for (int j = 0; j &amp;lt; 1000; j++) 
                    { 
                        f16.Altitude += j - 5; 
                    } 
                } 
                ); 
                tasks[i].Start(); 
            }

            Task.WaitAll(tasks);

            Console.WriteLine("[ {0} ]", f16.Altitude); 
        } 
    }

    class Plane 
    { 
        public int Altitude { get; set; } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnek kod par&amp;ccedil;asında &lt;strong&gt;Altitude&lt;/strong&gt; isimli &lt;strong&gt;int&lt;/strong&gt; tipinden &lt;strong&gt;&amp;ouml;zelliği(Property)&lt;/strong&gt; olan &lt;strong&gt;Plane&lt;/strong&gt; isimli bir sınıf yer almaktadır. &lt;strong&gt;TestMethod&lt;/strong&gt; i&amp;ccedil;erisinde ise bu sınıfa ait &lt;strong&gt;f16&lt;/strong&gt; isimli bir nesne &amp;ouml;rneği kullanılmaktadır. &lt;strong&gt;TestMethod&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt;5 adet Task&lt;/strong&gt; nesnesi &amp;ouml;rneklenmektedir. Bu &amp;ouml;rneklere ait lambda ifadelerinde ise, &lt;strong&gt;f16&lt;/strong&gt; &amp;ouml;rneği &amp;uuml;zerinden ulaşılan &lt;strong&gt;Altitude&lt;/strong&gt; &amp;ouml;zelliğinin değeri &lt;strong&gt;1000&lt;/strong&gt; kere &lt;strong&gt;5&lt;/strong&gt; birim arttırılmaktadır. Bu işlemi&lt;strong&gt; 5&lt;/strong&gt; farklı Task &amp;ouml;rneğinin yaptığı unutulmamalıdır. &lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisinde ise &lt;strong&gt;TestMethod&lt;/strong&gt; isimli fonksiyonun arka arkaya &lt;strong&gt;10&lt;/strong&gt; defa &amp;ccedil;alıştırıldığı g&amp;ouml;r&amp;uuml;lmektedir. Buradaki ama&amp;ccedil;, &lt;strong&gt;10&lt;/strong&gt; farklı denemenin sonu&amp;ccedil;larını irdelemektir. Nitekim her &amp;ccedil;alıştırılışta farklı sonu&amp;ccedil;lar alma ihtimalimiz &amp;ccedil;ok y&amp;uuml;ksektir. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg210_Test1.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg210_Test1" src="/pics/blg210_Test1_thumb.gif" alt="blg210_Test1" width="339" height="191" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Aslında aynı s&amp;uuml;re&amp;ccedil; &lt;strong&gt;10&lt;/strong&gt; kere &amp;ccedil;alıştırılmış ve hemen her seferinde &lt;strong&gt;Plane&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt;Altitude&lt;/strong&gt; değeri farklı hesap edilmiştir. Oysaki başlangı&amp;ccedil;ta &lt;strong&gt;0 &lt;/strong&gt;olan bu değer bir &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneği i&amp;ccedil;erisinde &lt;strong&gt;1000&lt;/strong&gt; defa &lt;strong&gt;5&lt;/strong&gt; birim arttırılmaktadır. Bununda &lt;strong&gt;5&lt;/strong&gt; farklı &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneği ile yapıldığı d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde toplamda elde edilen sonu&amp;ccedil;ların aslında her deneme i&amp;ccedil;in aynı olması beklenmektedir. &amp;Ouml;rnek &amp;ccedil;ıktıda ise sadece &lt;strong&gt;2472500&lt;/strong&gt; i&amp;ccedil;in iki hesaplamanın aynı olduğu g&amp;ouml;r&amp;uuml;lmektedir. Sorun ne olabilir?&lt;/p&gt;
&lt;p&gt;Paralel olarak başlatılan &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneklerine ait kod blokları, işlemcinin durumuna g&amp;ouml;re farklı zamanlarda devreye girer ve y&amp;uuml;r&amp;uuml;t&amp;uuml;l&amp;uuml;rler. Buradaki zaman farkları &amp;ccedil;ok k&amp;uuml;&amp;ccedil;&amp;uuml;k birimlere denk gelse de, &amp;ouml;rnekteki gibi ortak olarak paylaşılan veriler s&amp;ouml;z konusu olduğunda beklenmeyen sonu&amp;ccedil;ların &amp;uuml;retilmesine neden olabilirler. Geliştirilen &amp;ouml;rnek d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde; &amp;ccedil;alışma zamanında herhangibir t anındaki j değerleri, her bir Task i&amp;ccedil;in farklı olabilir. Yani &lt;strong&gt;Task 1&lt;/strong&gt;, &lt;strong&gt;500&lt;/strong&gt; nolu &lt;strong&gt;j&lt;/strong&gt; değerini işlemekteyken, &lt;strong&gt;Task 2&lt;/strong&gt; halen &lt;strong&gt;345nci&lt;/strong&gt; değerinde olabilir. Dolayısıyla ortak olarak kullanılan &lt;strong&gt;Altitude&lt;/strong&gt; değeri, her denemede farklı artımlarla değiştirilebilmektedir. Peki nasıl bir &amp;ccedil;&amp;ouml;z&amp;uuml;m uygulanabilir?&lt;/p&gt;
&lt;p&gt;Aslında her bir &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneğinin kendi kapsamında ele alacağı bir değişken ile bu sorun &amp;ccedil;&amp;ouml;z&amp;uuml;lebilir. Ancak ek olarak, en sonda k&amp;uuml;m&amp;uuml;latif bir hesaplama yapılması ve işlerin birleştirilmesi de gerekmektedir. Bunu aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asında daha net bir şekilde g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Threading.Tasks;

namespace SharedDataScenarios 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            for (int i = 0; i &amp;lt; 10; i++) 
            { 
                TestMethod(); 
            }

            Console.WriteLine("İşlemler tamamlandı.\nProgramı kapatmak i&amp;ccedil;in bir tuşa basınız"); 
            Console.ReadLine(); 
        }

        private static void TestMethod() 
        { 
            Plane f16 = new Plane(); 
            Task&amp;lt;int&amp;gt;[] tasks = new Task&amp;lt;int&amp;gt;[5];

            for (int i = 0; i &amp;lt; 5; i++) 
            { 
                tasks[i] = new Task&amp;lt;int&amp;gt;((os) =&amp;gt; 
                { 
                    int currentAltitude = (int)os;

                    for (int j = 0; j &amp;lt; 1000; j++) 
                    { 
                        currentAltitude += j - 5; 
                    }

                    return currentAltitude; 
                },f16.Altitude 
                ); 
                tasks[i].Start(); 
            }

            Task.WaitAll(tasks);

            for (int i = 0; i &amp;lt; tasks.Length; i++) 
            { 
                f16.Altitude += tasks[i].Result; 
            }

            Console.WriteLine("[ {0} ]", f16.Altitude); 
        } 
    }

    class Plane 
    { 
        public int Altitude { get; set; } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Kodda, &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rnekleri oluşturulurken, her birinin kendi &lt;strong&gt;Altitude&lt;/strong&gt; değişkeni ile &amp;ccedil;alışması i&amp;ccedil;in gerekli d&amp;uuml;zenlemeler yapılmıştır. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Task&lt;/strong&gt; sınıfına ait &lt;strong&gt;yapıcı metod(Constructor)&lt;/strong&gt; ikinci bir parametre daha almaktadır. Bu parametre, lambda ifadesi i&amp;ccedil;erisine taşınacak olan bir &lt;strong&gt;Object&lt;/strong&gt; &lt;strong&gt;State&lt;/strong&gt; değişkenini ifade etmektedir. Dolayısıyla bir &lt;strong&gt;Task &lt;/strong&gt;&amp;ouml;rneklenirken, kendi kapsamında bir &lt;strong&gt;Altitude&lt;/strong&gt; değişkeni ile &amp;ccedil;alışacaktır.&lt;/p&gt;
&lt;p&gt;Tabiki yerel olarak ele alına bu değişkenlerin kodun dışarısında tekrardan b&amp;uuml;t&amp;uuml;nleştirilmesi gerekeceğinden &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneklerinden birer sonu&amp;ccedil; d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi gerekmiştir. S&amp;ouml;z konusu d&amp;ouml;n&amp;uuml;ş değerleri daha sonradan toplanmış ve aşağıdaki &amp;ccedil;alışma zamanı &amp;ccedil;ıktısının oluşması sağlanmıştır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg210_Test2.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg210_Test2" src="/pics/blg210_Test2_thumb.gif" alt="blg210_Test2" width="336" height="187" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere 10 denemenin her birisinde &lt;strong&gt;aynı&lt;/strong&gt; sonu&amp;ccedil; elde edilmiştir.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;TLS(Thread Local Storage)&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Aslında yukarıda geliştirilen kod par&amp;ccedil;asında &lt;strong&gt;.Net &amp;ccedil;alışma zamanının&lt;/strong&gt; herhangibir zorlayıcılığı olmadığını ifade edebiliriz. Bu zorlayıcılık i&amp;ccedil;inse, &lt;strong&gt;Thread Local Storage&lt;/strong&gt; isimli &amp;ouml;zel alanlardan yararlanabiliriz. Bu depoları birden fazla iş par&amp;ccedil;ası i&amp;ccedil;in ayrıştırılmış &amp;ouml;zel veri alanları olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebiliriz. &lt;strong&gt;TLS &lt;/strong&gt;vakasına g&amp;ouml;re, her bir &lt;strong&gt;Thread &lt;/strong&gt;kendisine ait yerel depolama alanına sahiptir. Bu durumda herhangibir iş par&amp;ccedil;ası, bir diğerinin &lt;strong&gt;TLS&lt;/strong&gt; b&amp;ouml;lgesine m&amp;uuml;dahalede bulunamaz. Bir başka deyişle diğer bir iş par&amp;ccedil;asının izole edilmiş veri b&amp;ouml;lgesini okuyamaz veya yazamaz. S&amp;ouml;z konusu alanlar, y&amp;ouml;netimli&lt;strong&gt; kod tarafında(Managed Code) ThreadLocal&lt;/strong&gt; sınıfı yardımıyla ele alınabilirler. Biraz &amp;ouml;nce geliştirdiğimiz &amp;ouml;rnek kod par&amp;ccedil;asında &lt;strong&gt;TLS&lt;/strong&gt; kullanımını aşağıdaki gibi ger&amp;ccedil;ekleştirebiliriz.&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Threading.Tasks; 
using System.Threading;

namespace SharedDataScenarios 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            for (int i = 0; i &amp;lt; 10; i++) 
            { 
                TestMethod(); 
            }

            Console.WriteLine("İşlemler tamamlandı.\nProgramı kapatmak i&amp;ccedil;in bir tuşa basınız"); 
            Console.ReadLine(); 
        }

        private static void TestMethod() 
        { 
            Plane f16 = new Plane(); 
            Task&amp;lt;int&amp;gt;[] tasks = new Task&amp;lt;int&amp;gt;[5]; 
            ThreadLocal&amp;lt;int&amp;gt; local = new ThreadLocal&amp;lt;int&amp;gt;();

            for (int i = 0; i &amp;lt; 5; i++) 
            { 
                tasks[i] = new Task&amp;lt;int&amp;gt;((os) =&amp;gt; 
                { 
                    local.Value = (int)os;

                    for (int j = 0; j &amp;lt; 1000; j++) 
                    { 
                        local.Value += j - 5; 
                    } 
                    return local.Value; 
                },f16.Altitude 
                ); 
                tasks[i].Start(); 
            }

            Task.WaitAll(tasks);

            for (int i = 0; i &amp;lt; tasks.Length; i++) 
            { 
                f16.Altitude += tasks[i].Result; 
            }

            Console.WriteLine("[ {0} ]", f16.Altitude); 
        } 
    }

    class Plane 
    { 
        public int Altitude { get; set; } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Bu kez&lt;strong&gt; System.Threading&lt;/strong&gt; &lt;strong&gt;isim alanı(Namespace)&lt;/strong&gt; altında yer alan &lt;strong&gt;ThreadLocal&amp;lt;T&amp;gt;&lt;/strong&gt; tipinden bir &amp;ouml;rnek oluşturulmuş ve lambda ifadesi i&amp;ccedil;erisindeki &lt;strong&gt;Object State&lt;/strong&gt; atamasında kullanılmıştır. İşlemlerin tamamı bu &amp;ouml;rneğe ait &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliği &amp;uuml;zerinden yapılmaktadır. Sonu&amp;ccedil;lar bir &amp;ouml;nceki ile aynı olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg210_Test3.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg210_Test3" src="/pics/blg210_Test3_thumb.gif" alt="blg210_Test3" width="332" height="196" border="0" /&gt;&lt;/a&gt;&amp;nbsp;&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;ThreadLocal&amp;lt;T&amp;gt; Lazy Initialization Kullanımı ve Tuzak&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;ThreadLocal&amp;lt;T&amp;gt;&lt;/strong&gt; tipinin kullanımında değerlendirilebilecek bir versiyon daha bulunmaktadır. Aşırı y&amp;uuml;klenmiş olan yapıcı metod, &lt;strong&gt;Func&amp;lt;int&amp;gt;&lt;/strong&gt; tipinden bir &lt;strong&gt;tesmilci(Delegate)&lt;/strong&gt; almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg210_OverloadVersion.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg210_OverloadVersion" src="/pics/blg210_OverloadVersion_thumb.gif" alt="blg210_OverloadVersion" width="420" height="95" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bu versiyonda &lt;strong&gt;Lazy Initialization&lt;/strong&gt; s&amp;ouml;z konusudur. Bu sebepten &amp;ccedil;ok dikkatli olunması gerekmektedir. &lt;strong&gt;Func&amp;lt;T&amp;gt;&lt;/strong&gt; temsilcisi, izole edilmiş veri değişkeninin oluşturulması aşamasında devreye girecek bloğu işaret etmektedir. Lakin bu blok, &lt;strong&gt;ThreadLocal&amp;lt;T&amp;gt;&lt;/strong&gt; &amp;ouml;rneğinin &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliği &amp;ccedil;ağırılıncaya kadar devreye girmeyecektir. İşte bu sebepten yazımızda ele aldığımız senaryo i&amp;ccedil;in yine farklı sonu&amp;ccedil;ların elde edilmesi s&amp;ouml;z konusu olabilir. Kodumuzu buna g&amp;ouml;re aşağıdaki gibi geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Threading.Tasks; 
using System.Threading;

namespace SharedDataScenarios 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            for (int i = 0; i &amp;lt; 10; i++) 
            { 
                TestMethod(); 
            }

            Console.WriteLine("İşlemler tamamlandı.\nProgramı kapatmak i&amp;ccedil;in bir tuşa basınız"); 
            Console.ReadLine(); 
        }

        private static void TestMethod() 
        { 
            Plane f16 = new Plane(); 
            Task&amp;lt;int&amp;gt;[] tasks = new Task&amp;lt;int&amp;gt;[5]; 
            ThreadLocal&amp;lt;int&amp;gt; local = new ThreadLocal&amp;lt;int&amp;gt;( 
                () =&amp;gt; 
                { 
                    Console.WriteLine("{0}",f16.Altitude); 
                    return f16.Altitude; 
                } 
            );

            for (int i = 0; i &amp;lt; 5; i++) 
            { 
                tasks[i] = new Task&amp;lt;int&amp;gt;(() =&amp;gt; 
                { 
                    for (int j = 0; j &amp;lt; 1000; j++) 
                    { 
                        local.Value += j - 5; 
                    } 
                    return local.Value; 
                } 
                ); 
                tasks[i].Start(); 
            }

            Task.WaitAll(tasks);

            for (int i = 0; i &amp;lt; tasks.Length; i++) 
            { 
                f16.Altitude += tasks[i].Result; 
            }

            Console.WriteLine("[ {0} ]", f16.Altitude); 
        } 
    }

    class Plane 
    { 
        public int Altitude { get; set; } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneklerinin kullanacağı &lt;strong&gt;Altitude&lt;/strong&gt; değerinin, izole edilmiş yerel değişkene set edilmesi işlemi, &lt;strong&gt;ThreadLocal&lt;/strong&gt; &amp;ouml;rneklemesi yapılırken &lt;strong&gt;Func&amp;lt;T&amp;gt;&lt;/strong&gt; temsilcisinin işaret ettiği blok i&amp;ccedil;erisinde yapılmaktadır. Bu nedenle Object State kullanımına gerek kalınmamıştır. Ne varki &amp;ccedil;alışma zamanı sonu&amp;ccedil;ları beklediğimiz gibi olmayacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg210_Test4.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg210_Test4" src="/pics/blg210_Test4_thumb.gif" alt="blg210_Test4" width="334" height="406" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Herşeyden &amp;ouml;nce 10 denemenin &amp;ccedil;oğu kendi aralarında farklı sonu&amp;ccedil;lar vermiş ve hatta bir &amp;ouml;nceki &amp;ouml;rnekteki ile alakası olmayan &amp;ccedil;ıktılar &amp;uuml;retilmiştir. Diğer yandan &lt;strong&gt;ThreadLocal&amp;lt;T&amp;gt;&lt;/strong&gt; &amp;ouml;rneklemelerinin hemen her bir deneme i&amp;ccedil;in&lt;em&gt;(nitekim sonlarda bire d&amp;uuml;şm&amp;uuml;şt&amp;uuml;r ve her &amp;ccedil;alışmada bu değişebilir)&lt;/em&gt;&amp;nbsp;&lt;strong&gt;2&lt;/strong&gt; kez &amp;ccedil;ağırıldığı g&amp;ouml;r&amp;uuml;lmektedir. Bunun sebebi ise, &amp;ouml;rneğin geliştirildiği makinenin&lt;strong&gt; &amp;ccedil;ift &amp;ccedil;ekirdekli&lt;/strong&gt; olmasıdır. &amp;Ouml;yleki &lt;strong&gt;TLS&lt;/strong&gt; tekniğinde &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rnekleri değil &lt;strong&gt;Thread&amp;rsquo;&lt;/strong&gt; ler s&amp;ouml;z konusudur ve makine &amp;ccedil;ift &amp;ccedil;ekirdekli olduğundan aslında &amp;ccedil;alışma zamanında iki &lt;strong&gt;Thread&lt;/strong&gt; y&amp;uuml;r&amp;uuml;mektedir ki bunlarda her &lt;strong&gt;5 Task&lt;/strong&gt; &amp;ouml;rneğini paylaşır. Piuvvvvvv!!!&lt;/p&gt;
&lt;p&gt;Bu yazımızda biraz karmaşık ve anlaşılması zor olan bir konuyu g&amp;uuml;ndeme getirmeye &amp;ccedil;alıştık. Aslında bu noktada ele alacağımız daha bir s&amp;uuml;r&amp;uuml; vaka var. Fakat paralel programlamanın, &lt;strong&gt;Y&amp;ouml;netimli Kodda(Managed Code)&lt;/strong&gt; bile olsa &amp;ccedil;ok dikkatli uygulanması gerektiğini bir kere daha g&amp;ouml;rd&amp;uuml;k. &amp;Ouml;zellikle son &amp;ouml;rneğimize g&amp;ouml;re &lt;strong&gt;ThreadLocal&lt;/strong&gt; kullanımı sırasında &amp;ccedil;ok dikkatli olunması ve testlerin mutlaka iyi bir şekilde yapılması gerektiğini ortaya koyduk. Her an biz tuzağa d&amp;uuml;şebiliriz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f6%2fSharedDataScenarios_.rar"&gt;SharedDataScenarios_.rar (25,91 kb)&lt;/a&gt;&lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 Ultimate S&amp;uuml;r&amp;uuml;m&amp;uuml;nde Geliştirilmiş ve Test Edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2011-01-20 13:35:00</pubDate>
  <slug>TPL-ve-Shared-Data-Isolation</slug>
  <tags>
    <tag>tpl</tag>
    <tag>task-parallel-library</tag>
    <tag>shared-data-isolation</tag>
    <tag>parallel-programming</tag>
    <tag>c#-40</tag>
    <tag>visual-studio-2010-ultimate</tag>
  </tags>
  <categories>
    <category>Parallel Programming</category>
  </categories>
</post>