<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Visual Studio 2012 için Entity Framework Yenilikleri</title>
  <description>Entity Framework bilindiği üzere son sürümlerinden itibaren çok daha fazla etkili olmaya başladı. Bu noktada Ado.Net geliştirici takımının müşteri ihtiyaçlarını da çeşitli anketler yardımıyla dinliyor olmasının önemi büyüktür. Örneğin uzun bir zaman anketin en üst sıralarında yer alan Enum desteğinin getirilmesi gibi. (Bu amaçla açılan Entity Framework Feature Suggestions forumunu takip etmenizi öneririm)</description>
  <content>&lt;p&gt;&lt;a href="/pics/Delphi5_RTM.jpg"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; float: right; padding-top: 0px; border: 0px;" title="Delphi5_RTM" src="/pics/Delphi5_RTM_thumb.jpg" alt="Delphi5_RTM" width="240" height="194" align="right" border="0" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok eskiden kullanılan programlama dilleri ve platformları d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde &amp;ccedil;ok ilkel&lt;strong&gt; IDE&amp;rsquo;&lt;/strong&gt; ler ile &amp;ccedil;alışmış olduğumuzu g&amp;ouml;rmekteyiz. Hatta bazı programlama dilleri ile yapılan geliştirmelerde değil &lt;strong&gt;IDE&lt;/strong&gt;, komut satırına mahkum olmuşuzdur(&lt;em&gt;Ger&amp;ccedil;i komut satırında script yazarak geliştirme yapmak &amp;ouml;zellikle fonksiyonel programlama dilleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınırsa olduk&amp;ccedil;a pop&amp;uuml;ler ve isabetlidir)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Gelişen sistemler, kullanıcı deneyimleri ve g&amp;ouml;rselliklerin artması ile de yazılımcıların daha profesyonel olan &lt;strong&gt;IDE&lt;/strong&gt;&amp;rsquo; ler &amp;uuml;zerinde &amp;ccedil;alışması şart olmuştur.&lt;/p&gt;
&lt;p&gt;Bu anlamda tarihin belki en başarılı geliştirme aray&amp;uuml;zlerinden birisi, herkesin bildiği &amp;uuml;zere &lt;strong&gt;Delphi&lt;/strong&gt; ortamıdır. Ne varki o zaman ki &lt;strong&gt;Borland&lt;/strong&gt; firmasının sahip olduğu bu &amp;ouml;zellik, &lt;strong&gt;Anders Heijslberg&lt;/strong&gt;&amp;rsquo; in &lt;strong&gt;Microsoft&lt;/strong&gt; takımına ge&amp;ccedil;mesi ile birlikte yerini&lt;strong&gt; Visual Studio&lt;/strong&gt; ailesine bırakmıştır. &lt;strong&gt;Anders&lt;/strong&gt; sadece &lt;strong&gt;.Net Framework&lt;/strong&gt; plaformu ve &lt;strong&gt;C#&lt;/strong&gt; diline babalık etmemiş &amp;ouml;nemli bir &lt;strong&gt;User&lt;/strong&gt; &lt;strong&gt;Experience&lt;/strong&gt; tecr&amp;uuml;besini de &lt;strong&gt;Microsoft &lt;/strong&gt;şirketine taşımıştır. &lt;strong&gt;Visual Studio&lt;/strong&gt; &amp;ouml;zellikle &lt;strong&gt;2008&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nden itibaren inanılmaz derecede gelişti ve gelişmeye de devam ediyor.&lt;/p&gt;
&lt;p&gt;Bu IDE ile &amp;ccedil;alışmak hem &amp;ccedil;ok keyifli, hem de tek bir ortam &amp;uuml;zerinden &amp;ccedil;ok geniş bir yelpazeye ulaşılabilmekte. A&amp;ccedil;ık&amp;ccedil;ası &lt;strong&gt;IDE&lt;/strong&gt; dışına &amp;ccedil;ıkmadan herşeyin elinizin altında olduğu bir geliştirme ortamında &amp;ccedil;alışmanın değeri paha bi&amp;ccedil;ilemez&amp;hellip;Gerisi i&amp;ccedil;in &lt;strong&gt;Master Card&lt;/strong&gt; &lt;img class="wlEmoticon wlEmoticon-smilewithtongueout" style="border-style: none;" src="/pics/wlEmoticon-smilewithtongueout_7.png" alt="Smile with tongue out" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Entity Framework&lt;/strong&gt; bilindiği &amp;uuml;zere son s&amp;uuml;r&amp;uuml;mlerinden itibaren &amp;ccedil;ok daha fazla etkili olmaya başladı. Bu noktada &lt;strong&gt;Ado.Net&lt;/strong&gt; geliştirici takımının m&amp;uuml;şteri ihtiya&amp;ccedil;larını da &amp;ccedil;eşitli anketler yardımıyla dinliyor olmasının &amp;ouml;nemi b&amp;uuml;y&amp;uuml;kt&amp;uuml;r. &amp;Ouml;rneğin uzun bir zaman anketin en &amp;uuml;st sıralarında yer alan Enum desteğinin getirilmesi gibi. &lt;em&gt;(Bu ama&amp;ccedil;la a&amp;ccedil;ılan &lt;/em&gt;&lt;a href="http://data.uservoice.com/forums/72025-entity-framework-feature-suggestions/filters/new" target="_blank"&gt;&lt;em&gt;Entity Framework Feature Suggestions&lt;/em&gt;&lt;/a&gt;&lt;em&gt; forumunu takip etmenizi &amp;ouml;neririm)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Biz bu yazımızda &lt;strong&gt;Entity Framework&lt;/strong&gt;&amp;rsquo; &amp;uuml;n &lt;strong&gt;Visual Studio 2012&lt;/strong&gt; tarafındaki &lt;span style="text-decoration: underline;"&gt;bazı &lt;/span&gt;yeniliklerine değinmeye &amp;ccedil;alışıyor olacağız&lt;em&gt;(Bazı diyorum &amp;ccedil;&amp;uuml;nk&amp;uuml; yazıyı yazdığım sırada yeni bir update &amp;ccedil;ıkmış da olabilir. L&amp;uuml;tfen kontrol ediniz ve takipte kalınız)&lt;/em&gt;Haydi gelin hi&amp;ccedil; vakit kaybetmeden işe başlayalım.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Enum Desteği&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;Enum&lt;/strong&gt; tipi i&amp;ccedil;in &lt;strong&gt;Entity Framework&lt;/strong&gt; tarafındaki desteği epeyce bekledik aslında. Bu desteğin gelmesi ile birlikte elbetteki&lt;strong&gt; Visual Studio 2012 IDE&amp;rsquo;&lt;/strong&gt; si de gerekli kolaylığı g&amp;ouml;stermekte. &lt;strong&gt;Model&lt;/strong&gt; i&amp;ccedil;erisine yeni bir &lt;strong&gt;Enum&lt;/strong&gt; tipi eklenmek istendiğinde tek yapılması gereken, diagram &amp;uuml;zerinden &lt;strong&gt;Add New &amp;ndash;&amp;gt; Enum Type&lt;/strong&gt; se&amp;ccedil;eneğini işaretlemek.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/vsef_6.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="vsef_6" src="/pics/vsef_6_thumb.png" alt="vsef_6" width="501" height="359" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından &amp;ccedil;ıkan iletişim penceresinden, &lt;strong&gt;Enum&lt;/strong&gt; tipine ait sabit değerleri girilir. &amp;Ouml;rneğin aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &amp;uuml;lkeleri kullanabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/vsef_7.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="vsef_7" src="/pics/vsef_7_thumb.png" alt="vsef_7" width="450" height="575" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;İstenirse harici bir &lt;strong&gt;assembly/isim alanı&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &lt;strong&gt;Enum&lt;/strong&gt; tiplerinin kullanılması da m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bunun i&amp;ccedil;in &lt;strong&gt;Reference&lt;/strong&gt; &lt;strong&gt;external&lt;/strong&gt; &lt;strong&gt;type&lt;/strong&gt; se&amp;ccedil;eneğinin etkinleştirilmesi ve &lt;strong&gt;[Namespace].[EnumTypeName]&lt;/strong&gt; formatında ilgili tip adının girilmesi yeterlidir. &lt;strong&gt;Enum&lt;/strong&gt; tipi oluşturulduktan sonra &lt;strong&gt;Model Browser&lt;/strong&gt; penceresinde yer alan &lt;strong&gt;Enum Types&lt;/strong&gt; kısmında g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/vsef_8.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="vsef_8" src="/pics/vsef_8_thumb.png" alt="vsef_8" width="250" height="318" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Enum&lt;/strong&gt; tipleri i&amp;ccedil;in &lt;strong&gt;Designer&lt;/strong&gt; tarafında bir destek yoktur&lt;em&gt;(Şimdilik)&lt;/em&gt; ama bu pek de gerekli olmayabilir. &lt;strong&gt;Enum&lt;/strong&gt; tipleri sonu&amp;ccedil; itibariyle sabitlerini sayısal olarak ifade etmektedir. Bu a&amp;ccedil;ıdan bakıldığında, bir &lt;strong&gt;Entity&lt;/strong&gt; tip &amp;ouml;zelliğinin sayısal değerinin karşılığı olarak ilgili &lt;strong&gt;Enum&lt;/strong&gt; sabitlerinin kullanılabilmesi de m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. &amp;Ouml;rneğin &lt;strong&gt;Employee&lt;/strong&gt; isimli bir &lt;strong&gt;Entity&lt;/strong&gt;&amp;rsquo; nin &lt;strong&gt;EmployeeCountry&lt;/strong&gt; isimli &lt;strong&gt;int&lt;/strong&gt; tipinden bir &amp;ouml;zelliğinin&lt;em&gt;(Veritabanı tablosunda da bunun karşılığı alanın olduğunu varsayıyoruz)&lt;/em&gt; bulunduğunu d&amp;uuml;ş&amp;uuml;nelim. Bu &amp;ouml;zelliği &lt;strong&gt;Country&lt;/strong&gt; isimli &lt;strong&gt;Enum&lt;/strong&gt; sabiti ile aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere eşleştirebilir ve artık kod i&amp;ccedil;erisinde yer &lt;strong&gt;LINQ&lt;/strong&gt; sorgularında sayısal değer yerine &lt;strong&gt;Enum&lt;/strong&gt; sabitlerini kullanabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/vsef_9.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="vsef_9" src="/pics/vsef_9_thumb.png" alt="vsef_9" width="469" height="575" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Kalabalık Diagramlardan Kurtulduk&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;Entity&lt;/strong&gt; sayısının model &amp;uuml;zerinde artması sonucu oluşan g&amp;ouml;rsel kullanım g&amp;uuml;&amp;ccedil;l&amp;uuml;ğ&amp;uuml;n&amp;uuml; engellemenin yollarından birisi de, diagramları b&amp;ouml;l&amp;uuml;mlemektir. Bunun şu an i&amp;ccedil;in kullanışlı olan iki farklı tekniği mevcuttur.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Model Diagramın b&amp;ouml;l&amp;uuml;mlenmesinin sebeplerininin başında, kalabalık ve takibi zor olan, &amp;ccedil;ok sayıda Entity i&amp;ccedil;eren modeller yer almaktadır. Ancak tek sebep bu değildir. N sayıda Entity i&amp;ccedil;eren bir model&amp;rsquo; de sadece bir ka&amp;ccedil; Entity ile &amp;ccedil;alışıldığı durumlarda, bu senaryoya konu olan objeleri kolayca takip edebilme ihtiyacı da nedenler arasında g&amp;ouml;sterilebilir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h3&gt;&lt;strong&gt;Diagram B&amp;ouml;l&amp;uuml;mleme (Move Metodu ile)&lt;/strong&gt;&lt;/h3&gt;
&lt;p&gt;Bu teknikte &lt;strong&gt;Model&lt;/strong&gt; &amp;uuml;zerinden başka bir diagrama alınmak istenen &lt;strong&gt;Entity&amp;rsquo;&lt;/strong&gt; ler se&amp;ccedil;ilir ve &lt;strong&gt;Move to new diagram&lt;/strong&gt; ile taşınması sağlanır. &amp;Ouml;rneğin &lt;strong&gt;Northwind&lt;/strong&gt; veritabanı i&amp;ccedil;in &amp;uuml;retilen model&amp;rsquo; de yer alan bir ka&amp;ccedil; &lt;strong&gt;Entity&lt;/strong&gt; objesini se&amp;ccedil;ip, sağ tıklama sonrası a&amp;ccedil;ılan men&amp;uuml;den &lt;strong&gt;Move to new diagram&lt;/strong&gt; se&amp;ccedil;eneğini işaretleyerek s&amp;ouml;z konusu b&amp;ouml;l&amp;uuml;mlemeyi ger&amp;ccedil;ekleştirebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/vsef_3.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="vsef_3" src="/pics/vsef_3_thumb.png" alt="vsef_3" width="545" height="517" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bu işlem sonucunda se&amp;ccedil;ilen &lt;strong&gt;Entity&lt;/strong&gt; objeleri yeni bir diagrama alınacak ve bu değişiklik &lt;strong&gt;Model&lt;/strong&gt; &lt;strong&gt;Browser&lt;/strong&gt; penceresinden de izlenebilecektir. Aşağıdaki &amp;ccedil;ıktıda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/vsef_4.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="vsef_4" src="/pics/vsef_4_thumb.png" alt="vsef_4" width="616" height="645" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bu teknikte dikkat edilmesi gereken en &amp;ouml;nemli nokta ger&amp;ccedil;ek anlamda bir &lt;strong&gt;Move&lt;/strong&gt; işlemi yapılmasıdır. Yani, taşınan &lt;strong&gt;Entity&lt;/strong&gt; objeleri aslında kaynak diagram &amp;uuml;zerinden silinirler. Eğer bu istenmiyorsa takip eden teknikten yararlanılabilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Farklı sayıda diagram kullanıldığı durumlarda bunları anlamlı şekilde isimlendirmekte &amp;ouml;nemlidir. &lt;strong&gt;AdventureWorks&lt;/strong&gt; gibi veritabanlarını d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde, tabloların &lt;strong&gt;şema(schema)&lt;/strong&gt; bazlı olarak tutulduklarını ve &lt;strong&gt;domain&lt;/strong&gt; olarak ayrıştırıldıklarını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re her &lt;strong&gt;domain&lt;/strong&gt; i&amp;ccedil;in ayrı bir diagram oluşturmak, g&amp;ouml;rsellik ve takip edilebilirlik a&amp;ccedil;ısından olduk&amp;ccedil;a yararlı olabilir. B&amp;ouml;yle bir vakada, par&amp;ccedil;alanan ana modele ait diagramları yine veritabanında olduğu gibi şema adları ile tutmak mantıklı olacaktır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h3&gt;&lt;strong&gt;Diagram B&amp;ouml;l&amp;uuml;mleme (Model Browser &amp;uuml;zerinden)&lt;/strong&gt;&lt;/h3&gt;
&lt;p&gt;&lt;strong&gt;Model Browser&lt;/strong&gt;, &lt;strong&gt;Entity&lt;/strong&gt; diagramlarının y&amp;ouml;netilebildiği etkili dialog pencerelerinden birisidir. İstenirse bir modelin b&amp;ouml;l&amp;uuml;mlenerek farklı diagramlara taşınması/kopyalanması işlemi buradan da ger&amp;ccedil;ekleştirilebilir. Bunun i&amp;ccedil;in &amp;ouml;ncelikli olarak &lt;strong&gt;Model Browser&amp;rsquo;&lt;/strong&gt; a yeni bir diagram ilave edilir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/vsef_5.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="vsef_5" src="/pics/vsef_5_thumb.png" alt="vsef_5" width="352" height="266" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Yeni bir diagram oluşturulduktan sonra yine &lt;strong&gt;Model Browser&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &lt;strong&gt;Entity&amp;rsquo;&lt;/strong&gt; leri boş alana s&amp;uuml;r&amp;uuml;kleyerek s&amp;ouml;z konusu işlemi ger&amp;ccedil;ekleştirebiliriz. Burada ne yazık ki bir diagramın i&amp;ccedil;indeki &amp;ouml;ğeyi se&amp;ccedil;ip başka bir diagrama s&amp;uuml;r&amp;uuml;kleme işlemi s&amp;ouml;z konusu değildir&lt;em&gt;(En azından kullandığım Visual Studio 2012 s&amp;uuml;r&amp;uuml;m&amp;uuml; i&amp;ccedil;in bu ge&amp;ccedil;erli değildi)&lt;/em&gt; Bunun yerine &amp;ouml;rneğin &lt;strong&gt;NorthwindModel&lt;/strong&gt; ismiyle duran &amp;ouml;ğe altından s&amp;uuml;r&amp;uuml;kleme işlemlerinin yapılması gerekmektedir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Diagram b&amp;ouml;l&amp;uuml;mleme aslında g&amp;ouml;rsel bir ayrıştırma anlamına gelmektedir. Bir başka deyişle diagram bazlı yapılan taşıma, kopyalama gibi işlemler modelin tip yapısını bozmaz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h3&gt;&lt;strong&gt;Daha Renkli Bir Diagram&lt;/strong&gt;&lt;/h3&gt;
&lt;p&gt;Malum pek &amp;ccedil;ok veritabanı sistemi&lt;em&gt;(&amp;ouml;zellikle Relational olanlar ve Enterprise &amp;ccedil;&amp;ouml;z&amp;uuml;mlerde kullanılanlar)&lt;/em&gt; olduk&amp;ccedil;a fazla sayıda &lt;strong&gt;tablo, view&lt;/strong&gt; ve &lt;strong&gt;Stored Procedure&lt;/strong&gt; i&amp;ccedil;ermekte. Hal b&amp;ouml;yle olunca Entity modellerini i&amp;ccedil;eren diagramların, &lt;strong&gt;Visual Studio IDE&lt;/strong&gt; ortamında takip edilmesi de &amp;ccedil;ok zor olabilmekte.&lt;/p&gt;
&lt;p&gt;Diagramların b&amp;ouml;l&amp;uuml;nebilmesi &amp;ouml;zelliği haricinde &lt;strong&gt;Visual Studio 2012 &lt;/strong&gt;ile gelen &amp;ouml;nemli &amp;ouml;zelliklerden birisi de, &lt;strong&gt;Entity &lt;/strong&gt;objelerinin renklendirilebiliyor olması. Bu &amp;ouml;zellik sayesinde &amp;ouml;rneğin aynı isim alanına ait&lt;em&gt;(veya aynı domain i&amp;ccedil;erisinde yer alması gereken)&lt;/em&gt; &lt;strong&gt;Entity&lt;/strong&gt;&amp;rsquo; leri farklı şekillerde renklendirerek, diagramın hem g&amp;ouml;ze daha hoş g&amp;ouml;r&amp;uuml;nmesi sağlanabilmekte hem de algının daha da g&amp;uuml;&amp;ccedil;lendirilmesi m&amp;uuml;mk&amp;uuml;n olmakta. Bunun i&amp;ccedil;in bir ka&amp;ccedil; &lt;strong&gt;Entity&lt;/strong&gt; objesini aynı anda se&amp;ccedil;ip, &amp;ouml;zellikler penceresinden &lt;strong&gt;Fill Color&lt;/strong&gt;&amp;rsquo; ı set etmemiz yeterli olacaktır. Aşağıdaki ekran &amp;ccedil;ıktısında bu kullanıma &amp;ouml;rnek bir g&amp;ouml;r&amp;uuml;nt&amp;uuml; yer almaktadır &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_147.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Renkli TV Versiyonu&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/vsef_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="vsef_1" src="/pics/vsef_1_thumb.png" alt="vsef_1" width="635" height="558" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Sıkıcı Olan Siyah Beyaz TV Versiyonu&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/vsef_2.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="vsef_2" src="/pics/vsef_2_thumb.png" alt="vsef_2" width="635" height="635" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Birden Fazla Stored Procedure Se&amp;ccedil;erek Eklemek (Batch Insert)&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Entity Framework bilindiği &amp;uuml;zere veritabanı tarafındaki Stored Procedure&amp;rsquo; leri birer fonksiyon olarak model tarafına almaktadır. Pek tabi Database First modelin kullanıldığı senaryolarda, Model &amp;uuml;retilirken Stored Procedure&amp;rsquo; lerden istenilenlerinin se&amp;ccedil;ilerek de ilave edilmesi istenebilir. Visual Studio 2012&amp;rsquo; de bunun i&amp;ccedil;in ek bir se&amp;ccedil;enek getirilmiştir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/vsef_10.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="vsef_10" src="/pics/vsef_10_thumb.png" alt="vsef_10" width="536" height="512" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Entity Data Model Wizard&lt;/strong&gt; &amp;uuml;zerinde ilerlerken &amp;ccedil;ıkan &lt;strong&gt;Import selected stored procedures and functions into the entity model&lt;/strong&gt; se&amp;ccedil;eneği işaretlendiği takdirde, &lt;strong&gt;Stored&lt;/strong&gt; &lt;strong&gt;Procedures&lt;/strong&gt; &lt;strong&gt;and&lt;/strong&gt; &lt;strong&gt;Functions&lt;/strong&gt; kısmında se&amp;ccedil;ilen yordamlar i&amp;ccedil;in gerekli fonksiyonların topluca &amp;uuml;retildiği ve modele dahil edildiği g&amp;ouml;r&amp;uuml;lecektir. Bu, &lt;strong&gt;Visual Studio 2010&lt;/strong&gt; da yapılan t anında tek bir &lt;strong&gt;Stored Procedure&amp;rsquo;&lt;/strong&gt; &amp;uuml; fonksiyonelleştirme aksiyonuna g&amp;ouml;re &amp;ccedil;ok daha iyidir&lt;em&gt;(Add-&amp;gt;Function Import)&lt;/em&gt;&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Varsayılan Olarak DbContext T&amp;uuml;revli Entity Model&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;Code First Development&lt;/strong&gt; yaklaşımının en &amp;ouml;nemli noktalarından birisi de &lt;strong&gt;POCO&lt;/strong&gt;&lt;em&gt;(Plain Old CLR Objects) &lt;/em&gt;dışından &lt;strong&gt;DbContext &lt;/strong&gt;t&amp;uuml;revli bir &lt;strong&gt;Context &lt;/strong&gt;tipinin kullanılmasıdır. &lt;strong&gt;Visual Studio 2012 &lt;/strong&gt;arabirimi &lt;strong&gt;Entity Model&lt;/strong&gt;&amp;rsquo; lerin &amp;uuml;retilmesinde artık varsayılan olarak &lt;strong&gt;Entity Framework 5 DbContext T4 Template&lt;/strong&gt;&amp;rsquo; ini kullanmakta ve buna g&amp;ouml;re de &amp;uuml;retilen &lt;strong&gt;entity&lt;/strong&gt; &lt;strong&gt;context&lt;/strong&gt; sınıfı&amp;nbsp; &lt;strong&gt;DbContext&lt;/strong&gt; t&amp;uuml;revli oluşturulmakta. Hatta, &lt;strong&gt;Entity&lt;/strong&gt; sınıflarının da birer &lt;strong&gt;POCO&lt;/strong&gt; tipi olarak &amp;uuml;retildiğini g&amp;ouml;rmekteyiz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/vsef_12.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="vsef_12" src="/pics/vsef_12_thumb.png" alt="vsef_12" width="572" height="641" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bilindiği &amp;uuml;zere &lt;strong&gt;Visual Studio 2010&lt;/strong&gt; bu konuda &lt;strong&gt;ObjectContext&lt;/strong&gt; t&amp;uuml;revli bir yaklaşımı benimsemektedir. Ancak &lt;strong&gt;Entity Framework&lt;/strong&gt; takımın uygulama geliştiricilere &amp;ouml;nerisi &lt;strong&gt;DbContext&lt;/strong&gt; t&amp;uuml;revli i&amp;ccedil;erik tipini kullanmaları ve &lt;strong&gt;POCO&lt;/strong&gt; sınıfları ile ilerlemeleri y&amp;ouml;n&amp;uuml;ndedir.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Property Sıralaması&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;Model&lt;/strong&gt; diagramda yer alan &lt;strong&gt;Entity&lt;/strong&gt; &amp;ouml;zellikleri varsayılan olarak veritabanındaki kolon sıralamasına g&amp;ouml;re gelmektedir. Ama istenirse bu &amp;ouml;zelliklerin sırası değiştirilebilir. Bunun i&amp;ccedil;in &lt;strong&gt;Alt+Y&amp;ouml;n Tuşu&lt;/strong&gt; kombinasyonu kullanılabilir&lt;em&gt;(&amp;Ouml;rneğin Alt+Up ile &amp;ouml;zellik bir &amp;uuml;ste, Alt+Home ile en başa, Alt+End ile en sona ge&amp;ccedil;er)&lt;/em&gt; veya &amp;ouml;zellikler penceresinden aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ilerlenebilir. &lt;em&gt;(Visual Studio 2010 IDE&amp;rsquo; sin de bu işlem i&amp;ccedil;in XML tarafına ge&amp;ccedil;mek gerekirdi)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/vsef_11.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="vsef_11" src="/pics/vsef_11_thumb.png" alt="vsef_11" width="638" height="511" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Bu yazımızda &amp;ouml;zellikle &lt;strong&gt;Visual Studio 2012&lt;/strong&gt; ile &lt;strong&gt;Entity Framework&lt;/strong&gt; tarafına gelen yenilikleri incelemeye &amp;ccedil;alıştık. &amp;Ccedil;ok doğal olarak &amp;ccedil;eşitli &lt;strong&gt;Extension&amp;rsquo;&lt;/strong&gt; lar yardımıyla &lt;strong&gt;Visual Studio 2012&lt;/strong&gt; ortamındaki &lt;strong&gt;Entity Framework&lt;/strong&gt; niteliklerini arttırmak m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bu yazımızda, varsayılan olarak gelen kabiliyetlere bakmaya &amp;ccedil;alıştık. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2013-02-13 01:18:00</pubDate>
  <slug>Visual-Studio-2012-icin-Entity-Framework-Yenilikleri</slug>
  <tags>
    <tag>entity-framework</tag>
    <tag>code-first-development</tag>
    <tag>entity-framework-45</tag>
    <tag>visual-studio-2012</tag>
  </tags>
  <categories>
    <category>.Net Framework 4.5</category>
  </categories>
</post>