<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>GoLang - defer, panic ve recover Kavramlarını Tanıyalım</title>
  <description>Geçtiğimiz günlerde panic anahtar kelimesini incelerken aslında rescue ve defer kavramları ile birlikte kullanımının daha anlamlı olduğunu gördüm. Pek tabii defer ve rescue nedir öğrenmem gerekiyordu. Bu makalemizde bahsetmiş olduğumuz kavramları basitçe anlamaya çalışacağız.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/02/minionpanic.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Gopher'ın Go diline kattığı sevimlilik&amp;nbsp;ortada. Sadece maskotu değil bazı kavramları da olduk&amp;ccedil;a motive edici bu dilin. Bir .Net&amp;ccedil;i olarak ortama hata fırlatmak istediğim de kullandığımız throw new Exception gibi bir terminoloji yerine panic şeklinde bir anahtar kelimenin kullanılması aslında kasttettiğim. Hatta go dilinin resmi dok&amp;uuml;manlarında &lt;em&gt;"Panic is a built-in function that stops the ordinary flow of control and begins panicking."&lt;/em&gt; şeklinde bir c&amp;uuml;mle ile bu terim&amp;nbsp;hoş bir şekilde&amp;nbsp;ifade edilmiş.&amp;nbsp;En azından beni tebess&amp;uuml;m ettirdi fotoğraftaki minion'u ise biraz &amp;uuml;rk&amp;uuml;tt&amp;uuml;.&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde panic fonksiyonunu&amp;nbsp;incelerken aslında recover&amp;nbsp;ve defer kavramları ile birlikte kullanımının daha anlamlı olduğunu &amp;ouml;ğrendim. Aslında amacım ortama bir istisnanın nasıl fırlatılabileceğini g&amp;ouml;rmek ve hata y&amp;ouml;netimini incelemekti. Derken kendimi defer ifadesi ile panic ve recover fonksiyonlarını&amp;nbsp;araştırırken&amp;nbsp;buldum. İlk etapta&amp;nbsp;bu &amp;uuml;&amp;ccedil; kavramın kod akışını kontrol etmek i&amp;ccedil;in kullanıldığını s&amp;ouml;yleyebiliriz.&amp;nbsp;Şimdi bu kavramları &amp;ouml;rneklendirerek kısaca incelemeye &amp;ccedil;alışalım.&lt;/p&gt;
&lt;h1&gt;defer&lt;/h1&gt;
&lt;p&gt;.Net k&amp;ouml;kenli yazılımcılar i&amp;ccedil;in finally operasyonları amacıyla kullanılır dersek sanırım yerinde olacaktır. defer ifadesi ile işaret edilen fonksiyon, program &amp;ccedil;alışması sırasında mutlak suretle devreye girmesi istenen operasyonlarda kullanılır. &amp;Uuml;zerinde işlem yapılmış bir dosyanın, a&amp;ccedil;ılan bir veritabanı bağlantısının,&amp;nbsp;haberleşilen bir soket ile olan iletişimin kapatılması veya belleğe alınan ama işleri biten nesnelerin serbest bırakılması gibi genelleyebileceğimiz işlemler bu operasyonlara &amp;ouml;rnek olarak verilebilir. Tabii burada dikkat &amp;ccedil;ekici nokta defer ifadesinde bildirilen&amp;nbsp;fonksiyonun kodun akışında bir hata olması halinde de devreye girmesidir. Bir başka deyişle&amp;nbsp;runtime panic olarak isimlendirilen &amp;ccedil;alışma zamanı hatalarının oluştuğu durumlarda defer edilen fonksiyonların &amp;ccedil;alışması s&amp;ouml;z konusudur. Kaynaklarda sıklıkla ge&amp;ccedil;en dosya işlemlerinden&amp;nbsp;basit bir tanesini bu bağlamda ele alalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main 

import (
	"fmt" 
	"os"
)

func main() { 
	saveToFile("sometext.txt","this is gonna be the best day of my life")
}

func saveToFile(name string,content string) {
	fmt.Println("creating...")
	file,error:=os.Create(name)
	if error==nil{
		defer closeFile(file) // dogrudan defer file.Close() da denenmeli
		fmt.Fprintln(file,content)
	}else{
		return
	}
}

func closeFile(file *os.File){
	fmt.Println("closing...")
	file.Close()
	fmt.Println("closed")
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/godefer_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;saveToFile fonksiyonu sistem &amp;uuml;zerinde bir dosya a&amp;ccedil;ıp bunun i&amp;ccedil;erisinde belirtilen i&amp;ccedil;eriğin yazılması ile ilgili bir işlem ger&amp;ccedil;ekleştirmekte. Dosyayı oluşturmak i&amp;ccedil;in create operasyonundan yararlanıyoruz. Create fonksiyonundan oluşan dosya ve bir hata değişkeni d&amp;ouml;nmekte&lt;em&gt;(fonksiyondan d&amp;ouml;nen değerler i&amp;ccedil;in &amp;ccedil;oklu atama yapıldığını&amp;nbsp;fark etmişsinizdir)&lt;/em&gt; Eğer hata yoksa fmt paketinin FPrintln fonksiyonu ile dosyanın i&amp;ccedil;erisine basit bir metin yazıyoruz. Fonksiyon ilk parametre ile dosyayı, ikinci parametre ile de i&amp;ccedil;eriği alıyor.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekte bakmamız gereken kısım defer ifadesinin olduğu yer aslında. closeFile isimli bir fonksiyonu işaret ediyor. Buna g&amp;ouml;re dosyanın oluşturulması ve yazılması sırasında bir hata oluşsa bile kapatma operasyonu otomatik olarak devreye girecek. Tanımlama dosya yazma işleminin &amp;ouml;ncesinde yapıldı. Bu o anda &amp;ccedil;ağırılacağı anlamına gelmiyor. Aslında standart bir fonkisyon &amp;ccedil;ağrısı değil burada kastedilen. Bir nevi kapatma operasyonunu garanti altına aldığımızı ifade edebiliriz.&amp;nbsp;&lt;/p&gt;
&lt;h2&gt;LIFO Durumu&lt;/h2&gt;
&lt;p&gt;defer ifadesi son giren ilk &amp;ccedil;ıkar mantığına g&amp;ouml;re &amp;ccedil;alışır(Last In First Out). Buna g&amp;ouml;re bir fonksiyon i&amp;ccedil;erisinde kullanılan ne kadar defer ifadesi varsa son girenden ilk eklenene g&amp;ouml;re teker teker &amp;ccedil;alıştırılır. Bu durumu anlamak i&amp;ccedil;in aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import(
    "fmt"
)

func main() {
    doSomething()
}

func doSomething(){
    defer subProc(100)
    defer subProc(200)
    defer subProc(300)
    
    numbers:=[]int{4,5,1,9,8}
    for _,n:=range numbers{
        fmt.Println(n)
    }
}

func subProc(i int){
    fmt.Println(i)
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/godefer_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;doSomething i&amp;ccedil;erisinde defer ifadeleri haricinde bir slice i&amp;ccedil;erisindeki elemanlarda dolaşılmaktadır. subProc i&amp;ccedil;inse 3 defer ifadesi tanımlanmıştır. doSomething normal işleyişini tamamladıktan sonra i&amp;ccedil;erisinde defer edilen fonksiyonlar ters sırada &amp;ccedil;alışmıştır.&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;panic ve&amp;nbsp;recover&lt;/h1&gt;
&lt;p&gt;Yazdığımız uygulama kodunda meydana gelebilecek bazı hatalar ortama panic olarak yansır. Bir dizinin olmayan elemanına erişilmeye &amp;ccedil;alışılması, a&amp;ccedil;ılmak istenen dosyanın ilgili klas&amp;ouml;rde olmaması, başaltılmadan&lt;em&gt;(initialize edilmeden)&lt;/em&gt; bir slice i&amp;ccedil;eriğinin&amp;nbsp;kullanılmaya &amp;ccedil;alışılması gibi durumlar bu hatalara&amp;nbsp;&amp;ouml;rnek olarak verilebilir. Geliştirici isterse &amp;ccedil;alışma zamanı i&amp;ccedil;in bilin&amp;ccedil;li olarak panik havası da estirebilir. Her iki&amp;nbsp;durumda da paniğin oluştuğu fonksiyonun &amp;ccedil;alışması durdurulur, varsa defer edilmiş fonksiyonlar &amp;ccedil;alıştırılır ve ardından fonksiyonun sahibi olan konuma&lt;em&gt;(function caller)&lt;/em&gt; d&amp;ouml;n&amp;uuml;l&amp;uuml;r ama devam eden kod satırları işletilmez. Oluşan panikten sakin bir şekilde &amp;ccedil;ıkılması i&amp;ccedil;in recover fonksiyonundan&amp;nbsp;yararlanılır. Ne var ki recover &amp;ccedil;ağrımlarının anlamlı olması i&amp;ccedil;in defer iile kullanımı gerekir.&lt;/p&gt;
&lt;p&gt;Şu ana kadar ki kodlarımızda zaman zaman da olsa panik havası esmedi değil aslında. S&amp;ouml;z gelimi aşağıdaki kod par&amp;ccedil;ası &amp;ccedil;alışma zamanında bir panik oluşmasına&lt;em&gt;(panic: runtime error: index out of range)&lt;/em&gt; neden olur.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

func main(){
	numbers:=make([]int,5)
	numbers[6]=10
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/gopanic_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Az &amp;ouml;nce recover ile bu tip &amp;ccedil;alışma zamanı paniklerini yatıştırabileceğimize değinmiştik. Ben tabii konuyu &amp;ouml;ğrenirken balıklama ş&amp;ouml;yle bir kod par&amp;ccedil;asını denedim.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;numbers:=make([]int,5)
numbers[6]=10
err:=recover()
fmt.Println(err)&lt;/pre&gt;
&lt;p&gt;ama sonu&amp;ccedil; değişmedi. O anda recover'ın neden defer ile birlikte kullanıldığını daha iyi anlamaya başladım. Aynı kod par&amp;ccedil;asını aşağıdaki gibi d&amp;uuml;zenleyerek ilerleyelim.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main  
import (
    "fmt" 
    )

func main() { 
    numbers:=make([]int,5)
    defer easy(numbers)
    numbers[6]=10
    fmt.Println("have fun")
}
func easy(n []int){    
    if err := recover(); err != nil {
        fmt.Printf("slice length is : %d\n",len(n))
        fmt.Printf("don't panic it's just an error\n%s",err)
	}
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/gopanic_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere defer ifadesi ile main fonksiyonunda olası bir panik durumunda gidilebilecek bir başka fonksiyonu işaret ediyoruz. easy i&amp;ccedil;erisinde recovery fonksiyonundan yararlanarak&amp;nbsp;oluşan hatayı yakalayıp&lt;em&gt;(eğer varsa)&lt;/em&gt; program akışının kontrol altına alınmasını sağlıyoruz. easy fonskiyonuna main i&amp;ccedil;erisinde defer tanımını yaparken parametre ge&amp;ccedil;işi de yapmaktayız&lt;em&gt;(Bunu sadece parametre ge&amp;ccedil;irebileceğimizi g&amp;ouml;stermek i&amp;ccedil;in yazdık)&amp;nbsp;&lt;/em&gt;Bu arada defer fonksiyonunu istersek closure&amp;nbsp;olarak&amp;nbsp;da yazabiliriz ki yaygın kullanım şekli budur. Aynen aşağıdaki kod par&amp;ccedil;asında g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main  
import (
    "fmt" 
    )

func main() { 
    numbers:=make([]int,5)
    defer func(){    
        if err := recover(); err != nil {
            fmt.Printf("slice length is : %d\n",len(numbers))
            fmt.Printf("don't panic it's just an error\n%s",err)
        }
    }()
    numbers[6]=10
    fmt.Println("have fun")
}&lt;/pre&gt;
&lt;p&gt;Ancak g&amp;ouml;zden ka&amp;ccedil;maması gereken bir nokta daha var. numbers[6]=10 ataması sonrası oluşan hata yakalanmış olsa da devam eden kod satırı işletilmedi! Yani program cidden &amp;ccedil;akıldı ve biz paniği sessiz sedasız defer ettiğimiz fonksiyon &amp;uuml;zerinden soğukkanlı bir şekilde yatıştırdık. Olay main'de ceyeran ettiği i&amp;ccedil;in programdan &amp;ccedil;ıkılmış olması normal. Bir .Net&amp;ccedil;i olarak bildiğimiz try...catch...finally yapısından olduk&amp;ccedil;a farklı bir &amp;ccedil;alışma şekli gibi duruyor. Sanki Go dili programıcının ciddi anlamda &amp;ccedil;alışma zamanı hatası yaptıracak kod yazmasını istemiyor gibi.&amp;nbsp;Aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alarak bu durumu biraz daha a&amp;ccedil;alım.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import(
    "fmt"
)

func main() {
    launch()
    fmt.Println("to be continued...")
}

func launch() {
    defer func() {
        if err := recover(); err != nil {
            fmt.Println("There's something wrong:", err)
        }
    }()
    fmt.Println("Start Engine ")
    startEngine()
    fmt.Println("After recovery ")
}

func startEngine() {
    panic("aaa Houston! We have a problem.")
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/gopanic_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;main i&amp;ccedil;erisinde launch isimli bir fonksiyon &amp;ccedil;ağırıyoruz. Bu fonksiyon roketimizin motorlarını &amp;ccedil;alıştıran bir operasyonu kullanıyor ama başında defer ettiğimiz bir panik kontrol odası da var. startEngine i&amp;ccedil;erisindeki panic fonksiyonu&amp;nbsp;bilin&amp;ccedil;li olarak &amp;ccedil;alışma ortamına hata yollamak i&amp;ccedil;in kullanılıyor. Bu hata, defer edilen fonksiyon i&amp;ccedil;erisinde yakalanıyor. İşte burası &amp;ouml;nemli. Ekrana "After recovery..." yazılmadı ama main'deki "to be continued..." basıldı. Yani hata &amp;uuml;reten fonksiyonun &amp;ccedil;ağırıcısındaki defer operasyonu devreye girdikten sonra launch işleyişinin tamamen sonlanması ve&amp;nbsp;program kontrol&amp;uuml;n&amp;uuml;n main'e d&amp;ouml;nmesi s&amp;ouml;z konusu. Buna g&amp;ouml;re defer edilen fonksiyonların bir zincire eklendiğini de d&amp;uuml;ş&amp;uuml;nebiliriz.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Bu yazımızda Go programlama&amp;nbsp;dilinde program kontrol akışını değiştirmek i&amp;ccedil;in kullanılan defer ifadesi ile built-in gelen panic ve recover fonksiyonlarını&amp;nbsp;incelemeye &amp;ccedil;alıştık. Bug&amp;uuml;ne kadar Go dile ile ilgili &amp;ccedil;alışmalardan&amp;nbsp;g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m kadarı ile programcının olduk&amp;ccedil;a titiz kodlama yapması ve kavramlara aşina olması i&amp;ccedil;in olduk&amp;ccedil;a fazla pratik yapması gerekiyor. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-03-09 21:32:00</pubDate>
  <slug>golang-defer-panic-ve-recover-kavramlarini-taniyalim</slug>
  <tags>
    <tag>go</tag>
    <tag>golang</tag>
    <tag>go-programming-language</tag>
    <tag>panic</tag>
    <tag>defer</tag>
    <tag>recover</tag>
    <tag>error-handling</tag>
  </tags>
  <categories>
    <category>GoLang</category>
  </categories>
</post>