<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Rust ile Oyun Programlama</title>
  <description>Uzun süredir Rust programlama dilini öğrenmeye çalışıyorum. Bu yolda yürürken çevrimiçi eğitim materyalleri, blog yazıları ve bültenler haricinde birincil kaynak olarak da kitapları kullanmayı tercih ediyorum. Diğer yandan bir programlama dilini iyi seviyede öğrenmenin bana göre iki yolu var; var olan ürünlerin benzerini yazmak ya da oyun geliştirmeye çalışmak. Bazı yayınlar programlama dilini oyun yazarak öğretmeye çalışıyorlar. Takip ettiğim Herbert Wolverson'un Hands-on Rust: Effective Learning through 2D Game Development and Play isimli kitap da bunlardan birisi. Çok efsane bir öğrenim deneyimi olduğunu ifade edebilirim.</description>
  <content>&lt;p&gt;Uzun s&amp;uuml;redir Rust programlama dilini &amp;ouml;ğrenmeye &amp;ccedil;alışıyorum. Bu yolda y&amp;uuml;r&amp;uuml;rken &amp;ccedil;evrimi&amp;ccedil;i eğitim materyalleri, blog yazıları ve b&amp;uuml;ltenler haricinde birincil kaynak olarak da kitapları kullanmayı tercih ediyorum. Diğer yandan bir programlama dilini iyi seviyede &amp;ouml;ğrenmenin bana g&amp;ouml;re iki yolu var; var olan &amp;uuml;r&amp;uuml;nlerin benzerini yazmak ya da oyun geliştirmeye &amp;ccedil;alışmak. Bazı yayınlar programlama dilini oyun yazarak &amp;ouml;ğretmeye &amp;ccedil;alışıyorlar. Takip ettiğim&amp;nbsp;Herbert Wolverson'un Hands-on Rust: Effective Learning through 2D Game Development and Play isimli kitap da bunlardan birisi.&amp;nbsp;&amp;Ccedil;ok efsane bir &amp;ouml;ğrenim deneyimi olduğunu ifade edebilirim.&lt;/p&gt;
&lt;p&gt;Wolverson &amp;ouml;ncelikle ağa&amp;ccedil; eve girişi oyunlaştırdığı terminal programı ile okuru ısındırmaya başlıyor. Temel seviyede Rust &amp;ouml;zelliklerini, ortamını tanıyorsunuz. Derken kendinizi Flappy Bird benzeri bir oyun yazarken buluyorsunuz. Nihayetinde &amp;ccedil;ıta y&amp;uuml;kseliyor ve kendi Dungeon Crawl maceranızın i&amp;ccedil;ine dalıyorsunuz. Ben şahsen sadece ilk d&amp;ouml;rt b&amp;ouml;l&amp;uuml;m&amp;uuml; tamamladıktan sonra bile bir&amp;ccedil;ok şey &amp;ouml;ğrendim. State machine kalıbının oyunlar i&amp;ccedil;in ne anlama geldiğini, builder tasarım kalıbının ne g&amp;uuml;zel bir şey olduğunu, 2D bir x,y koordinat sisteminin iz d&amp;uuml;ş&amp;uuml;m&amp;uuml; i&amp;ccedil;in kullanılan yaklaşımları, bileşenler arttık&amp;ccedil;a zorlaşan nesne y&amp;ouml;netimi i&amp;ccedil;in Entity Component System isimli mimari stilin ele alınması&amp;nbsp;vs &amp;ouml;ğrendim.&lt;/p&gt;
&lt;p&gt;Ger&amp;ccedil;ekten de teoride kalan bazı kavramların asıl saha uygulamalarında işleyişini&amp;nbsp;g&amp;ouml;rmek ve neden onlara ihtiya&amp;ccedil; duyulduğunu anlamak a&amp;ccedil;ısından oyun geliştirmeye &amp;ccedil;alışmak gelişim a&amp;ccedil;ısından son derece &amp;ouml;nemli. Hatta kişisel gelişim a&amp;ccedil;ısından &amp;ouml;ğrendiklerimizi anlatarak pekiştirmek de bana kalırsa &amp;ccedil;ok kıymetli. İşte bu ama&amp;ccedil;la bende Pack-Man benzeri bir şeyler yazmaya &amp;ccedil;alışırken neler &amp;ouml;ğrendiğimi minik bir videoda toplamak istedim.&lt;/p&gt;
&lt;p&gt;Buyrunuz efenim :)&lt;/p&gt;
&lt;p&gt;&lt;iframe title="YouTube video player" src="https://www.youtube.com/embed/SzRhwliRXIU" width="560" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;Bir başka Rust &amp;ccedil;alışmasında g&amp;ouml;r&amp;uuml;şmek dileğiyle, hepinize mutlu g&amp;uuml;nler dilerim.&amp;nbsp;&lt;/p&gt;</content>
  <pubDate>2022-05-08 09:00:00</pubDate>
  <slug>rust-ile-oyun-programlama</slug>
  <tags>
    <tag>rust</tag>
    <tag>rust-pratikleri</tag>
    <tag>rust-programming-language</tag>
    <tag>oyun-programlama</tag>
    <tag>state-machine</tag>
    <tag>builder-pattern</tag>
    <tag>2d-oyun-geliştirme</tag>
    <tag>entity-component-system</tag>
    <tag>ecs</tag>
  </tags>
  <categories>
    <category>Rust</category>
  </categories>
</post>