<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF Service' lerinde Routing ile Versiyonlama</title>
  <description>Geçen gün şöyle eskiden yazmış olduğum makalelere bir bakayım dedim. Derken gözüm WCF 4.0’ ın Beta zamanlarında yazdıklarıma takıldı. O zamanlar .Net Framework 4.0' ün Beta sürümü çıktığında, incelemeye çalıştığım önemli yeniliklerden birisi de yönlendirme servisleri(Routing Service) idi.</description>
  <content>&lt;p&gt;&lt;a href="/pics/oldbook.jpg"&gt;&lt;span style="color: #ff0000;"&gt;&lt;img style="margin: 4px 0px; display: inline; float: right;" title="oldbook" src="/pics/oldbook_thumb.jpg" alt="oldbook" width="259" height="194" align="right" /&gt;&lt;/span&gt;&lt;/a&gt;&lt;span style="color: #ff0000;"&gt;[Orjinal yazım tarihi 2012 Eyl&amp;uuml;l&amp;rsquo; d&amp;uuml;r]&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;en g&amp;uuml;n ş&amp;ouml;yle eskiden yazmış olduğum makalelere bir bakayım dedim. Derken g&amp;ouml;z&amp;uuml;m &lt;strong&gt;WCF 4.0&lt;/strong&gt;&amp;rsquo; ın &lt;strong&gt;Beta &lt;/strong&gt;zamanlarında yazdıklarıma takıldı. O zamanlar &lt;strong&gt;.Net Framework 4.0'&lt;/strong&gt; &amp;uuml;n &lt;strong&gt;Beta&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;ccedil;ıktığında, incelemeye &amp;ccedil;alıştığım &amp;ouml;nemli yeniliklerden birisi de y&amp;ouml;nlendirme servisleri&lt;strong&gt;(Routing Service)&lt;/strong&gt; idi.&lt;/p&gt;
&lt;p&gt;İstemciden gelen talepleri analiz ederek, arka planda yer alan asıl servislere mesajların taşınması noktasında g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilecek &amp;ouml;nemli bir kabiliyet sunulmaktaydı. Aslında &lt;strong&gt;RoutingService,&amp;nbsp;&lt;/strong&gt;buradaki işi g&amp;uuml;&amp;ccedil;l&amp;uuml; filtreleme &amp;ouml;zellikleri ile epeyce kolaylaştıran bir tip olarak karşımıza &amp;ccedil;ıkmaktaydı. Hatta bu konuyu bir ka&amp;ccedil; makale ile de ele almaya &amp;ccedil;alışmıştım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/post/WCF-40-Yenilikleri-Routing-Service" target="_blank"&gt;WCF 4.0 Yenilikleri - Routing Service Geliştirmek - Giriş [Beta 1]&lt;/a&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;a href="/post/WCF-40-Yenilikleri-Routing-Service-Gelistirmek-Hello-World" target="_blank"&gt;WCF 4.0 Yenilikleri - Routing Service Geliştirmek - Hello World [Beta 1]&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/post/WCF-40-Yenilikleri-Routing-Service-Hata-Yonetimi" target="_blank"&gt;WCF 4.0 Yenilikleri - Routing Service - Hata Y&amp;ouml;netimi [Beta 1]&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/post/WCF-40-Yenilikleri-Routing-Service-MatchAll-Filtresi" target="_blank"&gt;WCF 4.0 Yenilikleri - Routing Service - MatchAll Filtresi [Beta 1]&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/post/WCF-WebHttp-Services-Routing" target="_blank"&gt;WCF WebHttp Services - Routing&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Tabi bunların hepsi &lt;strong&gt;Beta&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;ne ait incelemelerdi. Zaman ilerledik&amp;ccedil;e y&amp;ouml;nlendirme servislerinin &amp;ouml;nemli senaryolarda g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabileceğini de g&amp;ouml;rd&amp;uuml;k. &amp;Ouml;rneğin &lt;strong&gt;Load&lt;/strong&gt; &lt;strong&gt;Balancing&lt;/strong&gt; gibi.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Service y&amp;ouml;nelimli mimarinin&lt;em&gt;(Service Oriented Architecture)&lt;/em&gt;&lt;/strong&gt; uygulandığı &lt;strong&gt;WCF(Windows Communication Foundation)&lt;/strong&gt; gibi alt yapılarda karşılaşılan &amp;ouml;nemli sorunlardan birisi de, aynı servisin birden fazla farklı versiyona sahip s&amp;uuml;r&amp;uuml;mlerinin bulunması ve b&amp;ouml;yle bir durumda istemcilerin istedikleri versiyonu nasıl &amp;ccedil;ağırabilecekleridir. Bu tip bir durum ile pek &amp;ccedil;ok sebepten &amp;ouml;t&amp;uuml;r&amp;uuml; karşılaşılabilir. Tabi bir versiyonlamanın s&amp;ouml;z konusu olması i&amp;ccedil;in servis &amp;uuml;zerinde bir takım değişikliklerin mevzu bahis olması da gerekmektedir &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_115.png" alt="Winking smile" /&gt;&amp;nbsp; Bu değişiklikler aşağıda g&amp;ouml;r&amp;uuml;len 4 farklı kategori &amp;uuml;zerinden ele alınabilirler.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Contract(S&amp;ouml;zleşme) değişimleri :&lt;/strong&gt; &amp;Ouml;rneğin servise bir operasyon ilave edilmiş veya operasyona gelip giden parametre yapısında değişiklikler(ekleme, &amp;ccedil;ıkartma vb) yapılmış olabilir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Address(Adres) değişimleri :&lt;/strong&gt; Servis farklı bir lokasyona taşındığı i&amp;ccedil;in yeni bir &lt;strong&gt;endpoint&lt;/strong&gt; adresine gereksinim duyulabilir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Binding(Bağlayıcı tip) değişimleri :&lt;/strong&gt; &amp;Ouml;rneğin servis endpoint' i i&amp;ccedil;in&lt;strong&gt; WS-I&lt;/strong&gt; ile belirtilen bir &lt;strong&gt;security&lt;/strong&gt; değişikliği s&amp;ouml;z konusu olabilir. Bu durumda yeni bir &lt;strong&gt;bağlayıcı tipin(Binding Type)&lt;/strong&gt; uygulanması g&amp;uuml;ndeme gelebilir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Implementation değişimleri :&lt;/strong&gt; Servis i&amp;ccedil;erisinde yer alan operasyonel bir metodun i&amp;ccedil;eriği değişmiş olabilir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;T&amp;uuml;m bu değişim &amp;ccedil;eşitleri m&amp;uuml;mk&amp;uuml;n olabilir ve bu son derece de olağandır. Ancak uzun vadede bakıldığında, yaşamakta olan bazı sistemlerin yenilenmesi sırasında veya kademeli olarak g&amp;uuml;ncellenmeleri noktalarında, istemcilerin s&amp;ouml;z konusu değişime uğraşmış servislerin hangi s&amp;uuml;r&amp;uuml;mlerini/versiyonlarını kullanması da bir sorun olarak karşımıza &amp;ccedil;ıkmaktadır.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin yenilenecek olan bir &amp;uuml;r&amp;uuml;n&amp;uuml;n mod&amp;uuml;llerinin bir kısmı A servisinin 1.0 versiyonu ile &amp;ccedil;alışmaya devam edecek iken, diğer bir kısmı da yine aynı A servisinin 2.0 versiyonu ile &amp;ccedil;alışmak durumunda kalabilir. İşte bu noktada versiyonlanan servislerden hangisinin, istemciler tarafından nasıl ele alınabileceğinin bir &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;n&amp;uuml;n olması gerekmektedir.&lt;/p&gt;
&lt;p&gt;Biz bu yazımızda s&amp;ouml;z konusu versiyonalama problemini &lt;strong&gt;WCF&lt;/strong&gt; tarafındaki &lt;strong&gt;Routing&lt;/strong&gt; servis aracılığı ile &amp;ccedil;&amp;ouml;z&amp;uuml;mlemeye &amp;ccedil;alışıyor olacağız. Bildiğiniz &amp;uuml;zere &lt;strong&gt;Routing&lt;/strong&gt; servisler sayesinde, istemciden gelen taleplerin karşılanarak arka planda duran asıl servislere y&amp;ouml;nlendirilmesi m&amp;uuml;mk&amp;uuml;n olabilir. Bu, &lt;strong&gt;Load&lt;/strong&gt; &lt;strong&gt;Balancing&lt;/strong&gt; gibi &amp;ccedil;&amp;ouml;z&amp;uuml;mlerde ele alınabilecek bir servis &amp;ccedil;eşidi olmakla birlikte, biraz sonra g&amp;ouml;receğimiz gibi versiyonlama probleminde de değerlendirilebilmektedir. Tabi biz &amp;ouml;rneğimizde aşağıdaki senaryoyu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alıyor olacağız.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;M&amp;uuml;şteri bilgisini &amp;ccedil;ekmek i&amp;ccedil;in kullanılan bir servisin standart olarak kullandığı operasyonların bazılarının&lt;em&gt;(ki &amp;ouml;rneğimizde basitlik a&amp;ccedil;ısından tek bir operasyon olacak)&lt;/em&gt; parametrik yapısında değişimler olmuştur. Var olan s&amp;uuml;r&amp;uuml;m m&amp;uuml;şterinin hesap numarasına g&amp;ouml;re &amp;ccedil;alışmaktayken, yeni s&amp;uuml;r&amp;uuml;mde s&amp;ouml;z konusu servis operasyonu TCKN ile &amp;ccedil;alışıyor olacaktır. Buna g&amp;ouml;re var olan uygulamalar eski versiyonu kullanmaya devam edecek iken, yeni geliştirilecek olan uygulamalar son s&amp;uuml;r&amp;uuml;m&amp;uuml; ele alacaktır.&lt;/p&gt;
&lt;p&gt;Ama ilerleyen zamanlarda eski s&amp;uuml;r&amp;uuml;mlerin i&amp;ccedil;erisine m&amp;uuml;dahalelerde bulunarak hangi versiyonu kullanacaklarına &amp;ccedil;alışma zamanında karar verilmesi yeteneğine sahip olmaları da g&amp;uuml;ndemdedir. İşte burada servis s&amp;uuml;r&amp;uuml;mlerinin uygun olan versiyonlarna &amp;ccedil;alışma zamanında karar verilmesi yeteneği, Routing Service&amp;rsquo; lerin &amp;ouml;nemini biraz daha arttıracaktır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere servis s&amp;ouml;zleşmesinde bir değişim s&amp;ouml;z konusudur. &lt;strong&gt;Routing&lt;/strong&gt; servisin buradaki g&amp;ouml;revi, istemciden gelecek olan versiyon talebine g&amp;ouml;re arka planda istenen servislere y&amp;ouml;nlendirme yapmaktır.&lt;/p&gt;
&lt;p&gt;İlk sıkıntılardan birisi şudur. Aslında servisin iki farklı versiyonu olmasına rağmen operasyon adları aynıdır. Bu y&amp;uuml;zden Routing servisi y&amp;ouml;nlendirmeye karar vermek i&amp;ccedil;in &lt;strong&gt;Action&lt;/strong&gt; adlarından yararlanamaz&lt;em&gt;(Bir başka deyişle &lt;strong&gt;Action&lt;/strong&gt; &lt;strong&gt;Filters&lt;/strong&gt; kullanılamaz bu senaryoda)&lt;/em&gt; Bunun yerine, istemciden gelen mesaj i&amp;ccedil;erisinde &amp;ouml;zel bir &lt;strong&gt;başlık bilgisi(Custom Header)&lt;/strong&gt; kullanılabilir ve bu bilgi &lt;strong&gt;Routing&lt;/strong&gt; servis tarafında filtrelenebilir. Kafalar karıştı değil mi? Benim de &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_47.png" alt="Smile" /&gt;&lt;/p&gt;
&lt;p&gt;Gelin basit adımlar ile ilerleyerek bir &lt;strong&gt;Solution&lt;/strong&gt; &amp;uuml;zerinden ilgili senaryoyu ele almaya &amp;ccedil;alışalım. Senaryomuzda aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len uygulamalar s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/rav_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="rav_1" src="/pics/rav_1_thumb.png" alt="rav_1" width="523" height="457" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Şekilden de g&amp;ouml;r&amp;uuml;leceği &amp;uuml;zere versiyonları farklı olan iki servisimiz ve bunlara istemciden gelen talep doğrultusunda y&amp;ouml;nlendirme yapan bir &lt;strong&gt;Router&lt;/strong&gt; &lt;strong&gt;Service&lt;/strong&gt; uygulamamız bulunmaktadır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Senaryomuzda işlemleri olabildiğince basite indirgedik ve t&amp;uuml;m servis noktalarında BasicHttpBinding bağlayıcı tipinden yararlandık. &amp;Ccedil;ok doğal olarak arka planda yer alan servislerin sayısı artabilir ve her biri farklı Binding tipleri ile de bezenmiş olabilir ki bu durumda Binding bazlı bir versiyonlama farkı da oluşacaktır.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z gelimi servislerden birisin In-Proc modda erişilebilecek şekilde tasarlanmışken, diğer biri WS Federation 2007 standartlarında kullanılabilecek şekilde geliştirilmiş olabilir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;CustomerServiceV1&lt;/strong&gt; ve &lt;strong&gt;CustomerServiceV2&lt;/strong&gt; temel olarak iki farklı &lt;strong&gt;WCF&lt;/strong&gt; servis uygulaması i&amp;ccedil;erisinde yer almaktadır&lt;em&gt;(Bu tabiki zorunlu değildir. Aynı WCF Service uygulaması i&amp;ccedil;erisinde de birden fazla svc bulunabilir ve bu şekilde bir versiyonlama yaptırılabilir)&lt;/em&gt; Senaryoda bu servisler farklı &lt;strong&gt;WCF&lt;/strong&gt; &lt;strong&gt;Service&lt;/strong&gt; &lt;strong&gt;Application&lt;/strong&gt; projeleri i&amp;ccedil;erisine serpiştirilmişlerdir. Her ikisi de aynı servis s&amp;ouml;zleşmesini&lt;em&gt;(ICustomerService)&lt;/em&gt; dışarıya sunmaktadır ve &lt;strong&gt;GetCustomer&lt;/strong&gt; isimli bir operasyon i&amp;ccedil;ermektedirler. Lakin ilk versiyon &lt;strong&gt;M&amp;uuml;şteri numarası&lt;/strong&gt; ile &amp;ccedil;alışacak şekilde tasarlanmışken, ikinci versiyon &lt;strong&gt;TC Kimlik Numarasını&lt;/strong&gt; kullanmaktadır. S&amp;ouml;z konusu uygulamaların kod ve konfigurasyon i&amp;ccedil;erikleri&lt;em&gt;(web.config)&lt;/em&gt; aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;CustomerServiceV1 i&amp;ccedil;in ;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ServiceModel;

namespace CustomerServiceV1 
{ 
    [ServiceContract] 
    public interface ICustomerService 
    { 
        [OperationContract] 
        string GetCustomer(string customerNumber); 
    } 
}

namespace CustomerServiceV1 
{ 
    public class CustomerService 
        : ICustomerService 
    { 
        public string GetCustomer(string customerNumber) 
        { 
            return "M&amp;uuml;şteri numarası ile m&amp;uuml;şteri bilgisi talep edildi"; 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Web.config i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt; 

&amp;lt;configuration&amp;gt; 
    &amp;lt;system.serviceModel&amp;gt; 
        &amp;lt;behaviors&amp;gt; 
            &amp;lt;serviceBehaviors&amp;gt; 
                &amp;lt;behavior name=""&amp;gt; 
                    &amp;lt;serviceMetadata httpGetEnabled="true" httpsGetEnabled="true" /&amp;gt; 
                    &amp;lt;serviceDebug includeExceptionDetailInFaults="false" /&amp;gt; 
                &amp;lt;/behavior&amp;gt; 
            &amp;lt;/serviceBehaviors&amp;gt; 
        &amp;lt;/behaviors&amp;gt; 
        &amp;lt;serviceHostingEnvironment aspNetCompatibilityEnabled="true" 
            multipleSiteBindingsEnabled="true" /&amp;gt; 
    &amp;lt;/system.serviceModel&amp;gt; 
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;CustomerServiceV2 i&amp;ccedil;in;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ServiceModel;

namespace CustomerServiceV2 
{ 
    [ServiceContract] 
   public interface ICustomerService 
    { 
        [OperationContract] 
        string GetCustomer(string tckn); 
    } 
}

namespace CustomerServiceV2 
{ 
    public class CustomerService 
        : ICustomerService 
    { 
        public string GetCustomer(string tckn) 
        { 
            return "TCKN ile m&amp;uuml;şteri bilgisi &amp;ccedil;ekilir"; 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;web.config i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt; 
&amp;lt;configuration&amp;gt; 
    &amp;lt;system.serviceModel&amp;gt; 
        &amp;lt;behaviors&amp;gt; 
            &amp;lt;serviceBehaviors&amp;gt; 
                &amp;lt;behavior name=""&amp;gt; 
                    &amp;lt;serviceMetadata httpGetEnabled="true" httpsGetEnabled="true" /&amp;gt; 
                    &amp;lt;serviceDebug includeExceptionDetailInFaults="false" /&amp;gt; 
                &amp;lt;/behavior&amp;gt; 
            &amp;lt;/serviceBehaviors&amp;gt; 
        &amp;lt;/behaviors&amp;gt; 
        &amp;lt;serviceHostingEnvironment aspNetCompatibilityEnabled="true" 
            multipleSiteBindingsEnabled="true" /&amp;gt; 
    &amp;lt;/system.serviceModel&amp;gt; 
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Buraya kadar ki kısımda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere standart &lt;strong&gt;WCF&lt;/strong&gt; servislerinin geliştirilmesi s&amp;ouml;z konusudur. Asıl m&amp;uuml;him olan nokta ise &lt;strong&gt;Routing&lt;/strong&gt; &lt;strong&gt;Service &lt;/strong&gt;uygulamasının i&amp;ccedil;eriğidir. Bu servis uygulamasını basit bir &lt;strong&gt;Console&lt;/strong&gt; &lt;strong&gt;Application&lt;/strong&gt; şeklinde tasarlıyor olacağız. Kendisi bir &lt;strong&gt;Service Host&lt;/strong&gt; olarak g&amp;ouml;rev yapıyor olacak. Dolayısıyla a&amp;ccedil;ık kaldığı s&amp;uuml;rece istemcilere hizmet verebilecek. En &amp;ouml;nemli nokta konfigurasyon i&amp;ccedil;eriğidir. &amp;Ouml;rnek senaryomuzda &lt;strong&gt;app.config&lt;/strong&gt; i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Console uygulamasına, System.ServiceModel.Routing ve System.ServiceModel assembly' larının referans edilmesi gerektiğini hatırlatmak isterim.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt; 
&amp;lt;configuration&amp;gt; 
  &amp;lt;system.serviceModel&amp;gt; 
    &amp;lt;services&amp;gt; 
      &amp;lt;service behaviorConfiguration="rtngCnfg" 
               name="System.ServiceModel.Routing.RoutingService"&amp;gt; 
        &amp;lt;host&amp;gt; 
          &amp;lt;baseAddresses&amp;gt; 
            &amp;lt;add baseAddress="http://localhost:62323/routingservice/router/" /&amp;gt; 
          &amp;lt;/baseAddresses&amp;gt; 
        &amp;lt;/host&amp;gt; 
        &amp;lt;endpoint address="customer" 
                  binding="basicHttpBinding" 
                  name="routerEndpoint" 
                  contract="System.ServiceModel.Routing.IRequestReplyRouter" /&amp;gt; 
      &amp;lt;/service&amp;gt; 
    &amp;lt;/services&amp;gt; 
    &amp;lt;behaviors&amp;gt; 
      &amp;lt;serviceBehaviors&amp;gt; 
        &amp;lt;behavior name="rtngCnfg"&amp;gt; 
          &amp;lt;routing filterTableName="versioningFilterTable" /&amp;gt; 
        &amp;lt;/behavior&amp;gt; 
      &amp;lt;/serviceBehaviors&amp;gt; 
    &amp;lt;/behaviors&amp;gt;
    &amp;lt;client&amp;gt; 
      &amp;lt;endpoint name="customerServiceV1" 
                address="http://localhost:62292/CustomerService.svc" 
                binding="basicHttpBinding" 
                contract="*" /&amp;gt;
      &amp;lt;endpoint name="customerServiceV2" 
                address="http://localhost:62291/CustomerService.svc" 
                binding="basicHttpBinding" 
                contract="*" /&amp;gt; 
    &amp;lt;/client&amp;gt; 
    &amp;lt;routing&amp;gt; 
      &amp;lt;namespaceTable&amp;gt; 
        &amp;lt;add prefix="customer" namespace="http://core.services.customer/"/&amp;gt; 
      &amp;lt;/namespaceTable&amp;gt; 
      &amp;lt;filters&amp;gt; 
        &amp;lt;filter name="XPathFilterForVersion1" filterType="XPath" 
                filterData="sm:header()/customer:SrvVersion = '1'"/&amp;gt; 
        &amp;lt;filter name="XPathFilterForVersion2" filterType="XPath" 
                filterData="sm:header()/customer:SrvVersion = '2'"/&amp;gt; 
      &amp;lt;/filters&amp;gt; 
      &amp;lt;filterTables&amp;gt; 
        &amp;lt;filterTable name="versioningFilterTable"&amp;gt; 
          &amp;lt;add filterName="XPathFilterForVersion1" endpointName="customerServiceV1"/&amp;gt; 
          &amp;lt;add filterName="XPathFilterForVersion2" endpointName="customerServiceV2"/&amp;gt; 
        &amp;lt;/filterTable&amp;gt; 
      &amp;lt;/filterTables&amp;gt; 
    &amp;lt;/routing&amp;gt; 
  &amp;lt;/system.serviceModel&amp;gt; 
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Pek tabi bu uygulama bir &lt;strong&gt;Routing&lt;/strong&gt; servis olduğundan, arka planda kullanacağı servisler i&amp;ccedil;in de bir &lt;strong&gt;Client&lt;/strong&gt; gibi d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmelidir. Bu sebepten &lt;strong&gt;client&lt;/strong&gt; elementi i&amp;ccedil;erisinde, &lt;strong&gt;CustomerServiceV1&lt;/strong&gt; ve &lt;strong&gt;CustomerServiceV2&lt;/strong&gt; i&amp;ccedil;in gerekli &lt;strong&gt;End Point&lt;/strong&gt; tanımlamaları bulunmaktadır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Router servis uygulaması herhangibir şekilde CustomerService' lerin servis referanslarını &lt;span style="text-decoration: underline;"&gt;i&amp;ccedil;ermemektedir&lt;/span&gt;.No Add Service Reference yani &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_47.png" alt="Smile" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Servisin kendisi &lt;strong&gt;System.ServiceModel.Routing.IRequestReplyRouter&lt;/strong&gt; s&amp;ouml;zleşme tipini kullanmaktadır. &lt;strong&gt;Config&lt;/strong&gt; dosyası i&amp;ccedil;erisindeki en &amp;ouml;nemli par&amp;ccedil;a ise &lt;strong&gt;routing&lt;/strong&gt; elementinin i&amp;ccedil;eriği ve tanımlanan filtreleme opsiyonlarıdır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;XPath&lt;/strong&gt; tekniğine g&amp;ouml;re, gelen mesajın &lt;strong&gt;Header&lt;/strong&gt; kısmı analiz edilmekte ve &lt;strong&gt;SrvVersion&lt;/strong&gt; kelimesinin karşılığı olan değere bakılmaktadır. Bu &lt;strong&gt;değerin 1 olması halinde&lt;/strong&gt; &lt;strong&gt;CustomerService'&lt;/strong&gt; &lt;strong&gt;in 1nci versiyonu, 2 olması halinde ise 2nci versiyonu&lt;/strong&gt; i&amp;ccedil;in bir y&amp;ouml;nlendirme yapılacağı planlanmıştır. Filtreleme değeri ile, arka plandaki servis u&amp;ccedil; noktasının eşleştirilmesi ise &lt;strong&gt;filterTables&lt;/strong&gt; elementi i&amp;ccedil;erisinde ger&amp;ccedil;ekleştirilmektedir. İstemci uygulamanın &lt;strong&gt;Main&lt;/strong&gt; metodunun i&amp;ccedil;eriği ise son derece basit ve sadedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.ServiceModel; 
using System.ServiceModel.Routing;

namespace RouterServer 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            using (ServiceHost serviceHost =new ServiceHost(typeof(RoutingService))) 
            { 
                serviceHost.Open(); 
                Console.WriteLine("Y&amp;ouml;nlendirme servisi etkin. Kapatmak i&amp;ccedil;in bir tuşa basınız."); 
                Console.ReadLine(); 
            } 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere, &lt;strong&gt;RoutingService&lt;/strong&gt; tipinden bir &lt;strong&gt;ServiceHost&lt;/strong&gt; &amp;ouml;rneği oluşturulmaktadır. Bu, &lt;strong&gt;.Net Framework&lt;/strong&gt;&amp;rsquo; &amp;uuml;n &lt;strong&gt;built-in routing&lt;/strong&gt; alt yapısının y&amp;uuml;klenmesi i&amp;ccedil;in yeterlidir.&amp;nbsp;Gelelim istemci tarafına &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_115.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;p&gt;İstemci, m&amp;uuml;şteri servislerinden hangi versiyonu kullanırsa kullansın, bir şekilde s&amp;ouml;zleşmeden haberdar olmalı ve &lt;strong&gt;GetCustomer&lt;/strong&gt; metoduna erişebilmelidir. Nitekim bu operasyonun &amp;ccedil;ağırılabilmesi i&amp;ccedil;in bir de &lt;strong&gt;Proxy&lt;/strong&gt; tipine ihtiyacı vardır. Burada &lt;strong&gt;CustomerServiceV1&lt;/strong&gt; veya &lt;strong&gt;CustomerServiceV2 &lt;/strong&gt;isimli servislerin herhangibigirisinden yararlanılıp bir servis referansının istemci uygulamaya eklenmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Şahsen ben bu şekilde bir yolu tercih ettim &lt;img class="wlEmoticon wlEmoticon-sarcasticsmile" style="border-style: none;" src="/pics/wlEmoticon-sarcasticsmile_6.png" alt="Sarcastic smile" /&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Unutmayın! İstemcinin bilmesi gereken s&amp;ouml;zleşme Router servise ait değildir. Zaten Router servis i&amp;ccedil;in Metadata Publishing opsiyonu da kapalıdır ve hatta ortada bir Contract' da yoktur.&lt;/p&gt;
&lt;p&gt;İstemci, GetCustomer operasyonunu kullanacağı CustomerService s&amp;ouml;zleşmesine gereksinim duymaktadır. Sadece uygun versiyonu &amp;ccedil;ağırmak i&amp;ccedil;in Router servisden yararlanacak ama aslında CustomerService' ine ait GetCustomer metodunu &amp;ccedil;ağırıyor olacaktır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;İstemci tarafına &lt;strong&gt;Add Service Reference&lt;/strong&gt; ile ilgili s&amp;ouml;zleşme eklendikten sonra&lt;em&gt;(ki &lt;strong&gt;svcutil&lt;/strong&gt; komut satırı aracılığı ile de ortak bir isim adı altında &amp;uuml;retim yaptırılıp eklenmesi tercih edilebilirdi)&lt;/em&gt; &lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisine aşağıdaki &amp;ouml;rnek kodları eklememiz yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using ClientApp.CustomerServiceReference; 
using System; 
using System.ServiceModel; 
using System.ServiceModel.Channels;

namespace ClientApp 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            Console.WriteLine("&amp;Ccedil;alıştırmak istediğiniz servise ait versiyon numarasını giriniz. 1, 2"); 
            string versionNumber=Console.ReadLine();

            try 
            { 
                //Routing servis i&amp;ccedil;in bir Endpoint bildirimi yapılır 
                EndpointAddress ea = new EndpointAddress("http://localhost:62323/routingservice/router/customer");

                // Proxy nesnesi &amp;ouml;rneklenir 
                CustomerServiceClient client = new CustomerServiceClient(new BasicHttpBinding(), ea);

                // Scope &amp;ouml;rneklenir 
                using (OperationContextScope context = new OperationContextScope((client.InnerChannel))) 
               { 
                    //Header bilgisi alınır 
                    MessageHeaders header = OperationContext.Current.OutgoingMessageHeaders; 
                    //Header bilgisine kullanılmak istenen versiyon numarası verilir 
                    header.Add(MessageHeader.CreateHeader("SrvVersion", "http://core.services.customer/", versionNumber)); 
                    // Operasyon &amp;ccedil;alıştırılır 
                    string result1 = client.GetCustomer("1122");

                    Console.WriteLine(result1); 
                    Console.ReadLine(); 
               } 
            } 
            catch (Exception excp) 
            { 
                Console.WriteLine(excp.Message); 
            } 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;İstemci uygulamada dikkat edileceği &amp;uuml;zere kod &amp;uuml;zerinden bir &lt;strong&gt;EndPoint&lt;/strong&gt; tanımlaması ile işe başlanmakta ve bu u&amp;ccedil; noktayı &lt;strong&gt;BasicHttpBinding&lt;/strong&gt; ile kullanan bir &lt;strong&gt;proxy&lt;/strong&gt; &amp;ouml;rneği&lt;strong&gt;(CustomerServiceClient)&lt;/strong&gt; &amp;uuml;retilmektedir.&lt;/p&gt;
&lt;p&gt;Kodun &amp;ouml;nemli olan kısmı &lt;strong&gt;MessageHeader&lt;/strong&gt; i&amp;ccedil;erisine istenen versiyon bilgisinin eklenmesidir. Bu, o andaki operasyonel &lt;strong&gt;Context'&lt;/strong&gt; in elde edilmesinin ardından &lt;strong&gt;MessageHeaders&lt;/strong&gt; tipi kullanılarak ger&amp;ccedil;ekleştirilmektedir.&lt;/p&gt;
&lt;p&gt;Artık senaryomuzu test edebiliriz. İşte benim uygulamaları test ederken aldığım sonu&amp;ccedil;lara ait ekran &amp;ccedil;ıktıları.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;İlk olarak 1 değerini girerek bir &amp;ccedil;ağrıda bulunuyoruz;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/rav_2.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="rav_2" src="/pics/rav_2_thumb.png" alt="rav_2" width="604" height="267" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Ardından 2 değerini girerek;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/rav_3.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="rav_3" src="/pics/rav_3_thumb.png" alt="rav_3" width="604" height="239" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Pek tabi ge&amp;ccedil;erli olmayan bir değerin girilmesi halinde istemci tarafında &lt;strong&gt;Exception&lt;/strong&gt; alınması da son derece doğaldır &lt;img class="wlEmoticon wlEmoticon-embarrassedsmile" style="border-style: none;" src="/pics/wlEmoticon-embarrassedsmile_3.png" alt="Embarrassed smile" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi bir servisin farklı versiyonlarını host ettiğimiz senaryolarda, istemcilerin istedikleri servislere gitmelerini sağlamak i&amp;ccedil;in araya konuşlandıracağımız bir &lt;strong&gt;Routing&lt;/strong&gt; servis uygulamasından kolayca yararlanabiliriz. Senaryoda teknik olarak istemcinin &lt;strong&gt;Message&lt;/strong&gt; &lt;strong&gt;Header&lt;/strong&gt; i&amp;ccedil;erisine koyduğu versiyon bilgisinin, y&amp;ouml;nlendirme servisi &amp;uuml;zerinde &lt;strong&gt;XPath&lt;/strong&gt; ile sorgulanması ile yakalanmaya &amp;ccedil;alışılması değerlendirilmiştir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek senaryo istenirse daha da zorlaştırılabilir. S&amp;ouml;z gelimi servislerin s&amp;ouml;zleşmelerinde yapılacak kritik değişiklikler sonucu istemcinin bilmesi gereken contract bilgisinin de g&amp;uuml;ncellenmesi şarttır. Bu konuyu bir d&amp;uuml;ş&amp;uuml;nmenizi ve b&amp;ouml;yle bir senaryo oluşması halinde istemcinin istediği versiyonlara nasıl gidebileceğini araştırmanızı ve bir &amp;ccedil;&amp;ouml;z&amp;uuml;m yolu bulmaya &amp;ccedil;alışmanızı &amp;ouml;neririm. Bu iyi bir ev &amp;ouml;devi gibi geldi bana &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_47.png" alt="Smile" /&gt; Versiyonlama her zaman i&amp;ccedil;in zor ve karmaşık bir konudur. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2012%2f9%2fRoutingAndVersioning.zip"&gt;RoutingAndVersioning.zip (117,79 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2013-03-04 00:50:00</pubDate>
  <slug>WCF-Service-lerinde-Routing-ile-Versiyonlama</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
    <tag>wcf-45</tag>
    <tag>router</tag>
    <tag>routing-service</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>