<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>İlk Bakışta Windows Workflow Foundation</title>
  <description>Gerçek dünyada pek çok iş probleminin çözümünde iş akışlarından(Workflow) yararlanılır. Temelde bir iş probleminin çözümünde veya amacının gerçekleştirilmesinde izlenen yol birdir. Önce problem yönetilebilir küçük parçalara bölünür. Bu parçalar, gerçekleştirilmesi gereken görevler(Tasks) olarak düşünülebilir. Her bir görevin(Task) içerisinde ona ait gerçekleştirilmesi gereken ne varsa adımlar(Steps) halinde tasarlanır. Bu adımlar dahil oldukları görevin tamamlanmasında rol oynarlar. Adımlar arasındaki geçişler basit olabileceği gibi çeşitli çevresel koşul veya faktörlerede bağımlı olabilir. Bir başka deyişle adımlar arası geçişlerde koşullar(Conditions) söz konusu olabilir. Adımlar düzenli bir sırada olup aralarındaki geçişler önceden tanımlanmış ve belirli olabileceği gibi, çeşitli olaylara göre farklı şekillerde ele alınabilirlerde. Sonuç olarak ortaya iş probleminin çözümü için tasarlanmış bir süreç(Process) ve kontrollü bir akış(Control Flow) çıkar.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Ger&amp;ccedil;ek d&amp;uuml;nyada pek &amp;ccedil;ok iş probleminin &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;nde &lt;strong&gt;iş akışlarından(Workflow)&lt;/strong&gt; yararlanılır. Temelde bir iş probleminin &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;nde veya amacının ger&amp;ccedil;ekleştirilmesinde izlenen yol birdir. &amp;Ouml;nce problem y&amp;ouml;netilebilir k&amp;uuml;&amp;ccedil;&amp;uuml;k par&amp;ccedil;alara b&amp;ouml;l&amp;uuml;n&amp;uuml;r. Bu par&amp;ccedil;alar, ger&amp;ccedil;ekleştirilmesi gereken &lt;strong&gt;g&amp;ouml;revler(Tasks) &lt;/strong&gt;olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Her bir g&amp;ouml;revin(Task) i&amp;ccedil;erisinde ona ait ger&amp;ccedil;ekleştirilmesi gereken ne varsa &lt;strong&gt;adımlar(Steps) &lt;/strong&gt;halinde tasarlanır. Bu adımlar dahil oldukları g&amp;ouml;revin tamamlanmasında rol oynarlar. Adımlar arasındaki ge&amp;ccedil;işler basit olabileceği gibi &amp;ccedil;eşitli &amp;ccedil;evresel koşul veya fakt&amp;ouml;rlerede bağımlı olabilir. Bir başka deyişle adımlar arası ge&amp;ccedil;işlerde &lt;strong&gt;koşullar(Conditions) &lt;/strong&gt;s&amp;ouml;z konusu olabilir. Adımlar d&amp;uuml;zenli bir sırada olup aralarındaki ge&amp;ccedil;işler &amp;ouml;nceden tanımlanmış ve belirli olabileceği gibi, &amp;ccedil;eşitli olaylara g&amp;ouml;re farklı şekillerde ele alınabilirlerde. Sonu&amp;ccedil; olarak ortaya iş probleminin &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; i&amp;ccedil;in tasarlanmış bir &lt;strong&gt;s&amp;uuml;re&amp;ccedil;(Process)&lt;/strong&gt; ve &lt;strong&gt;kontroll&amp;uuml;&lt;/strong&gt; &lt;strong&gt;bir&lt;/strong&gt; &lt;strong&gt;akış(Control Flow)&lt;/strong&gt; &amp;ccedil;ıkar.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;İş akışları(Workflow) &lt;/strong&gt;sayesinde, iş problemlerinin &amp;ccedil;&amp;ouml;z&amp;uuml;mlenmesi, istenirse genişletilebilmesi son derece kolay bir şekilde ger&amp;ccedil;ekleştirilebilmektedir. Bir iş akışına pek &amp;ccedil;ok yerde kolaylıkla rastlayabiliriz. Bunların bir kısmı i&amp;ccedil;in hi&amp;ccedil; bir geliştirme yapılamamakla birlikte &amp;ccedil;oğu i&amp;ccedil;in bilgisayar teknolojisinden yararlanılmaktadır. Bir başka deyişle bazı iş &amp;ccedil;evrelerinde izlenen s&amp;uuml;re&amp;ccedil;ler bilin&amp;ccedil;siz olarak kendiliğinden bir akışa sahip olabilmektedir. Ancak bilgisayar teknolojisinin hızla yaygınlaşması ve verimliliği arttırması nedeni ile, iş akışları yazılımsal ve donanımsal fakt&amp;ouml;rler &amp;uuml;zerinden ele alınmaktadır. Bu anlamda &lt;strong&gt;iş akışlarının(Workflow)&lt;/strong&gt; ilk uygulamaları d&amp;ouml;k&amp;uuml;manların bir noktadan başka bir noktaya taşınması olmuştur. Zaten buda &lt;strong&gt;SharePoint Server&lt;/strong&gt; gibi gelişmiş bir sistemde iş akışlarının neden kullanıldığını a&amp;ccedil;ıklamaktadır. Nitekim portal tarzı uygulamalarda &lt;strong&gt;d&amp;ouml;k&amp;uuml;man y&amp;ouml;netimi(Document Management)&lt;/strong&gt; ve paylaşımı esastır. Bu noktada, d&amp;ouml;k&amp;uuml;manların &lt;strong&gt;kullanıcılar(Users)&lt;/strong&gt; ve &lt;strong&gt;sistemler(Systems)&lt;/strong&gt; arasındaki hareketinde &amp;ccedil;eşitli onay mekanizmalarının devreye girmesi muhtemeldir. Buda &amp;ccedil;ok doğal olarak bir iş akışı ile ifade edilip tanımlanabilir.&lt;/p&gt;
&lt;p&gt;Bir ka&amp;ccedil; yıl &amp;ouml;nce &amp;ccedil;alıştığım &amp;ouml;zel bir yazılım firmasında şirketlerin &lt;strong&gt;iş akışlarının(Workflow)&lt;/strong&gt; tasarlanabildiği bir yazılım projesinde g&amp;ouml;rev almıştım. İş &amp;ccedil;evrelerinin &amp;ccedil;&amp;ouml;z&amp;uuml;m bekleyen &amp;ccedil;ok fazla sayıda problemi vardır. S&amp;ouml;z gelimi bir elemanın işe alım yada işten &amp;ccedil;ıkartılma s&amp;uuml;re&amp;ccedil;leri, şirketin mali yapısını g&amp;ouml;steren raporların onay mekanizmaları, &amp;uuml;retim hattına ait s&amp;uuml;re&amp;ccedil;ler ve daha pek &amp;ccedil;oğu. Bilgisayar ve yazılımlar sayesinde bu &amp;ouml;rnek s&amp;uuml;re&amp;ccedil; ve benzelerine ait iş akışlarının kullanılması son derece kolaylaşmaktadır. &amp;Ouml;rneğin &lt;strong&gt;işe alım s&amp;uuml;recini &lt;/strong&gt;ele alalım. Elemanın CV' sinin insan kaynakları departmanına verilmesi ve bilgisayar ortamına alınması, departman i&amp;ccedil;erisinde CV' nin ilgili mercilere g&amp;ouml;nderilerek onaylarının alınması, onay verilmesi halinde işe alınmak istenen personelin g&amp;ouml;r&amp;uuml;şmeye &amp;ccedil;ağırılması, g&amp;ouml;r&amp;uuml;şme sonrası t&amp;uuml;m bilgilerin kayıt altına alınarak s&amp;uuml;rece dahil olan diğer kişilerede g&amp;ouml;nderilmesi, g&amp;ouml;nderme işlemlerinde mail sisteminden yararlanılması gibi işlemler s&amp;ouml;z konusu olacaktır. Bu işlemlerin her biri arasındaki ge&amp;ccedil;işler karar yapıları ve onay mekanizmaları ile ger&amp;ccedil;ekleşmektedir. S&amp;ouml;z gelimi CV' nin ilk değerlendirmesinde en &amp;uuml;st mercinin red etmesi halinde iş başvurusunda bulunan kişiye olumsuz cevap verilmesi ve s&amp;uuml;re&amp;ccedil; i&amp;ccedil;erisindeki ilgili kişilerede bu durumun mail, sms gibi yollarla aktarılması i&amp;ccedil;in bir onay mekanizması ve koşullandırmanın olması gerekmektedir.&lt;/p&gt;
&lt;p&gt;Dikkat edilecek olursa iş akışılarının yukarıdaki gibi c&amp;uuml;mlesel olarak ifadesi anlaşılmasını zorlaştırmaktadır. Hatta bu s&amp;uuml;recin kapsadığı &lt;strong&gt;alana(Domain)&lt;/strong&gt; dahil olan kişilerin bilgisayarlarında adımları kolayca izleyebilmesi ve kimin &amp;uuml;st&amp;uuml;ne hangi &lt;strong&gt;g&amp;ouml;rev(Task) &lt;/strong&gt;d&amp;uuml;ş&amp;uuml;yorsa bunu yapabilmesi demek aslında bir yazılım sisteminin geliştirilip kurulması anlamına gelmektedir. Buda doğal olarak yukarıdakinden daha uzun ve karmaşık olan iş akışı anlatımlarının &amp;ouml;nce kağıt &amp;uuml;zerinde grafiksel olarak tasarlanması ve sonrasında gerekli yazılımın hazırlanması anlamına gelmektedir. &lt;strong&gt;Geliştiriciler(Developers)&lt;/strong&gt; bu tip iş akışlarını sistemlere uygularken &lt;strong&gt;g&amp;ouml;rsel tasarlayıcılarıda(Visual Designer) &lt;/strong&gt;ele alırlar. Bir başka deyişle iş akışlarının g&amp;ouml;rsel olarak tasarlanabilmeside &amp;ouml;nemlidir. Bu ama&amp;ccedil;la geliştirilmiş pek &amp;ccedil;ok &lt;strong&gt;yazılım(Software)&lt;/strong&gt; s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Karmaşık iş kurallarını i&amp;ccedil;eren akışların g&amp;ouml;rsel olarak ele alınması, akışın i&amp;ccedil;erisinde yer alan adım(Step) ve kuralların(Rule) kolayca tasarlanabilmesi hatta kodlanabilmesi demektir. Bu bir iş akışının sonradan kolayca değiştirilebilmesi bir başka deyişle genişletilebilmesininde kolaylaştırılması anlamına gelmektedir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bu yazılımların genel amacı, pek &amp;ccedil;ok iş akışının &amp;ccedil;oğunlukla birden fazla bilgisayarın olduğu sistemlerde kurulması ve kullanılabilmesidir. Elbette birden fazla bilgisayar olması şart değildir. Bazı durumlarda tek bir bilgisayar &amp;uuml;zerindeki programlar i&amp;ccedil;in s&amp;ouml;z konusu olabilecek iş akışlarıda var olabilir. &lt;em&gt;(Aslında &lt;strong&gt;Windows Workflow Foundation&lt;/strong&gt; mimarisinin bu modeldeki iş akışlarına daha yakın olduğunu d&amp;uuml;ş&amp;uuml;nebiliriz.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu kısa bilgilerden sonra bir iş akışını tanımlamak &amp;ccedil;ok daha kolaylaşmaktadır. Bir &lt;strong&gt;iş akışı(Workflow)&lt;/strong&gt; herhangibir iş probleminin &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; i&amp;ccedil;in gereken &lt;strong&gt;adımları(Steps),&lt;/strong&gt; onay mekanizmalarını ve &lt;strong&gt;karar yapılarını(Condition)&lt;/strong&gt; i&amp;ccedil;eren bir model sunmaktadır. Bir başka deyişle bir iş akışı, belirli &lt;strong&gt;kurallar(Rules)&lt;/strong&gt; &amp;uuml;zerine sıralanmış adımlar topluluğu olarakta d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. &amp;Ouml;zellikle bilgisayar teknolojileri &amp;uuml;zerinden baktığımızda bir iş akışının aslında farklı bir programlama modeli sunduğuda g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Bu a&amp;ccedil;ılardan bakıldığında iş akışı denildiğine akla gelen pek &amp;ccedil;ok kavramda bulunmaktadır. Bu kavramlar aşağıdaki maddelerde belirtildiği gibidir;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;G&amp;ouml;rsel Şemalar&lt;/li&gt;
&lt;li&gt;Kurallar(Rules)&lt;/li&gt;
&lt;li&gt;Politikalar(Policies)&lt;/li&gt;
&lt;li&gt;Sisteme giren(Input) ve &amp;ccedil;ıkan(Output) veriler&lt;/li&gt;
&lt;li&gt;Kişiler(Users)&lt;/li&gt;
&lt;li&gt;Organizasyonlar(Organizations)&lt;/li&gt;
&lt;li&gt;Yordamlar(Procedures)&lt;/li&gt;
&lt;li&gt;Temel G&amp;ouml;revle(Tasks)&lt;/li&gt;
&lt;li&gt;Adımlar(Steps)&lt;/li&gt;
&lt;li&gt;Aktiviteler(Activities)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Peki &lt;strong&gt;Windows Workflow Foundation&lt;/strong&gt; ile kastedilen nedir? &lt;strong&gt;Microsoft&lt;/strong&gt; bu Foundation ile iş akışlarının tasarlandığı bir programmı &amp;uuml;retmiştir? Aslında Windows Workflow Foundation &lt;strong&gt;tek bir iş alanı(Single Domain)&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &lt;strong&gt;tek bir uygulamayı(Single Application)&lt;/strong&gt; hedeflemektedir. Bir başka deyişle Windows Workflow Foundation &lt;strong&gt;.Net&lt;/strong&gt; uygulamalarının kullanabileceği &lt;strong&gt;iş akışlarının(Workflow)&lt;/strong&gt; tasarlanması i&amp;ccedil;in gerekli altyapıyı sunan bir&lt;strong&gt; Framework 3.0&lt;/strong&gt; yaklaşımıdır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;İş akışları &amp;ccedil;oğunlukla BizTalk Server' un sundukları ile karşılaştırılır. BizTalk ile &amp;ouml;zellikle elektronik ticarete uygun olacak şekilde farklı platformlar &amp;uuml;zerinde yer alan sistemlere ait iş s&amp;uuml;re&amp;ccedil;leri başarılı bir şekilde ele alınabilmektedir. Oysaki Windows Workflow Foundation sadece işletim sistemi seviyesinde(Operating System Level) d&amp;uuml;ş&amp;uuml;n&amp;uuml;lm&amp;uuml;şt&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;Bu anlamda Microsoft otoriteleri BizTalk' un interapplication(Birden fazla uygulama-Mutliple Applications) olarak ele alınması gerektiğini, Windows Workflow Foundation' ın ise intraapplication(Tek bir uygulama-Single Application) şeklinde d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmesi gerektiğini vurgulamaktadır. Ancak bu bir kısıt değildir. Nitekim WWF i&amp;ccedil;erisinde Web Servisleri gibi SOA(Service Oriented Architecture) modelleri sayesinde dış platformlara &amp;ccedil;ıkılması ve iş s&amp;uuml;recinin bu şekilde genişletilmeside m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;Windows Workflow Foundation&lt;/strong&gt; mimarisi sayesinde iş akışları g&amp;ouml;rsel olarak tasarlanıp kodlanabilirler. Ancak tasarlanan bu iş akışlarının işe yarayabilmesi i&amp;ccedil;in bir uygulama tarafından ele alınmaları şarttır. S&amp;ouml;z konusu uygulamalar host g&amp;ouml;revini &amp;uuml;stlenmekte olup bir veya daha fazla iş akışını barındırıp kullanabilirler. Windows Workflow Foundation mimarisi pek &amp;ccedil;ok fayda sağlamaktadır. S&amp;ouml;z konusu faydalar aşağıdaki maddeler ile &amp;ouml;zetlenebilir.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;İş akışlarının kolayca ve etkili bir bi&amp;ccedil;imde tasarlanabilmesi i&amp;ccedil;in &lt;strong&gt;g&amp;ouml;rsel&lt;/strong&gt; &lt;strong&gt;tasarımcı(Visual Designer)&lt;/strong&gt; sunar.&lt;/li&gt;
&lt;li&gt;Sistemin insan ile etkileşimde olduğu modellerde &lt;strong&gt;aktiviteler(adımlar) &lt;/strong&gt;arasındaki s&amp;uuml;re farkları olabilir. Bu nedenle iş akışının g&amp;uuml;ncel durumlarının kaydedilebiliyor ve daha sonra sonra başka bir zaman diliminde tekrar y&amp;uuml;klenebiliyor olması gerekir. WWF bunu sağlamaktadır.&lt;/li&gt;
&lt;li&gt;İş akışları i&amp;ccedil;in gerekli &lt;strong&gt;&amp;ccedil;alışma zamanı(Run-Time) &lt;/strong&gt;ortamı dışında, pek &amp;ccedil;ok tipte farklı &lt;strong&gt;aktivite(Activity)&lt;/strong&gt; i&amp;ccedil;in destek, aktivitelerin &lt;strong&gt;denetlenmesi(Monitoring)&lt;/strong&gt;, &lt;strong&gt;izlenmesi(Tracing)&lt;/strong&gt; sağlanmaktadır.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Sequential&lt;/strong&gt; iş akışı desteği vardır. Bu akışlar &amp;ccedil;oğunlukla sistem etkileşimi olan bir başka deyişle insan fakt&amp;ouml;r&amp;uuml; fazla bulunmayan durumlarda s&amp;ouml;z konusudur. Bu tip akışlarda adımların sırası ve d&amp;uuml;zeneği bellidir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;State Machine&lt;/strong&gt; iş akışı desteği vardır. Bu tip akışlarda insan etkileşimi s&amp;ouml;z konusudur. &amp;Ccedil;oğunlukla aktivitiler arasındaki ge&amp;ccedil;işlerin bazı olayların tetiklenmesine bağlı olduğu durumlarda kullanılır.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;strong&gt;Windows Workflow Foundation&lt;/strong&gt;, iş akışlarını esas alan bir programlama modeli sunmaktadır. S&amp;ouml;z konusu programlama&amp;nbsp; modeli &lt;strong&gt;deklaratif(declarative)&lt;/strong&gt; yaklaşımı ele almaktadır. Buna g&amp;ouml;re iş mantığı ayrık bileşenler i&amp;ccedil;erisinde &lt;strong&gt;kaps&amp;uuml;llenir(encapsulation)&lt;/strong&gt;. Nitekim bileşenler arasında akışların nasıl y&amp;ouml;lendirileceğini belirten kurallar deklaratif olarak tanımlanabilirler.&lt;/p&gt;
&lt;p&gt;Windows Workflow Foundation mimarisinin nasıl kullanıldığını daha net kavrayabilmek i&amp;ccedil;in basit &amp;ouml;rnekler &amp;uuml;zerinden devam etmekte yarar var. İlk &amp;ouml;rnekte son derece basit bir iş akışını tasarlayıp bunu kullanacak olan bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması geliştiriyor olacağız. Sonrasında ise iş akışını farklı .&lt;strong&gt;Net&lt;/strong&gt; uygulamalarında da kullanabilmek adına bir &lt;strong&gt;sınıf k&amp;uuml;t&amp;uuml;phanesi(Class Library)&lt;/strong&gt; i&amp;ccedil;erisinde tasarlayıp &amp;ouml;rnek bir Windows uygulaması i&amp;ccedil;erisinden &amp;ccedil;alıştıracağız. Daha &amp;ouml;ncedende belirtildiği gibi &lt;strong&gt;WWF&lt;/strong&gt; i&amp;ccedil;erisinde tasarlanmış bir &lt;strong&gt;iş akışının(Workflow) &lt;/strong&gt;işe yarayabilmesi i&amp;ccedil;in bir &lt;strong&gt;host&lt;/strong&gt; uygulama tarafından ele alınması gerekmektedir. İlk &amp;ouml;rneğimizde &lt;strong&gt;Host&lt;/strong&gt; program &lt;strong&gt;Console&lt;/strong&gt; uygulaması olarak tasarlanacaktır. &amp;Ouml;rneklerimizi &lt;strong&gt;Visual Studio 2008 RTM &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde tasarlıyor olacağız. Ancak istenirse gerekli genişletmeler y&amp;uuml;klenerek &lt;strong&gt;Visual Studio 2005&lt;/strong&gt; ilede WWF geliştirmeleri yapılabilir. Elbette &lt;strong&gt;.Net Framework 3.0&lt;/strong&gt;' ın y&amp;uuml;kl&amp;uuml; olması şarttır.&lt;/p&gt;
&lt;p&gt;İlk olarak aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi &lt;strong&gt;Workflow&lt;/strong&gt; sekmesinde yer alan &lt;strong&gt;proje şablonlarından(Project Templates)&lt;/strong&gt; birisinin se&amp;ccedil;ilmesi gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_1.gif" alt="" width="630" height="470" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edilecek olursa &lt;strong&gt;Sequential&lt;/strong&gt; ve &lt;strong&gt;State Machine&lt;/strong&gt; &lt;strong&gt;iş akışlarının(Workflow)&lt;/strong&gt; geliştirilmesi i&amp;ccedil;in gerekli &lt;strong&gt;proje şablonları(Project Template)&lt;/strong&gt; bulunmaktadır. Her iki tip i&amp;ccedil;inde birer &lt;strong&gt;sınıf k&amp;uuml;t&amp;uuml;phanesi(Class Library)&lt;/strong&gt; ve &lt;strong&gt;Console&lt;/strong&gt; uygulaması şablonu yer almaktadır. &amp;Ccedil;ok doğal olarak geliştirilen iş akışlarının farklı tipte &lt;strong&gt;.Net&lt;/strong&gt; uygulamalarında kullanılacağı durumlar s&amp;ouml;z konusu olduğunda &lt;strong&gt;Workflow Library &lt;/strong&gt;şablonlarını uygulamak daha doğru bir yaklaşım olacaktır. Windows Workflow Foundation ile geliştirilen iş akışlarında &lt;strong&gt;aktivitelerin(Activity) &lt;/strong&gt;b&amp;uuml;y&amp;uuml;k &amp;ouml;nemi vardır. Geliştiriciler isterlerse kendi &amp;ouml;zel aktivite tiplerinide&lt;strong&gt;(Custom Activity Types) &lt;/strong&gt;yazabilirler. Bunun i&amp;ccedil;inde &lt;strong&gt;Workflow Activity Library&lt;/strong&gt; şablonu kullanılır.&lt;/p&gt;
&lt;p&gt;Makalemizdeki ilk &amp;ouml;rneğimizde sonu&amp;ccedil;ları hemen irdeleyebilmek adına &lt;strong&gt;Sequential Workflow Console Application&lt;/strong&gt; tipinden bir uygulama yazıyor olacağız. Buna ilişkin proje şablonu se&amp;ccedil;ildikten sonra uygulama i&amp;ccedil;erisine aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi &lt;strong&gt;Workflow1&lt;/strong&gt; isimli bir iş akışı tipinin eklendiği g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_2.gif" alt="" width="159" height="202" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İş akışı i&amp;ccedil;erisine &amp;ouml;rnek aktiviteleri eklemeden &amp;ouml;nce proje i&amp;ccedil;erisinde oluşturulan tiplerden bahsetmekte yarar vardır. Herşeyden &amp;ouml;nce bir iş akışı projesi oluşturulduğunda &lt;strong&gt;System.Workflow.Activities&lt;/strong&gt;, &lt;strong&gt;System.Workflow.ComponentModel&lt;/strong&gt; ve &lt;strong&gt;System.Workflow.Runtime&lt;/strong&gt; isimli &lt;strong&gt;assembly&lt;/strong&gt;' ların referans edildiği g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_4.gif" alt="" width="290" height="382" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Tahmin edileceği gibi bu &lt;strong&gt;assembly&lt;/strong&gt;' lar i&amp;ccedil;erisinde iş akışlarının geliştirilmesi, &amp;ccedil;alıştırılması, denetlenmesi ve izlenmesi i&amp;ccedil;in gerekli temel tipler yer almaktadır. Bunların dışında &lt;strong&gt;console&lt;/strong&gt; uygulamasına dahil edilmiş farklı &lt;strong&gt;assembly&lt;/strong&gt; referanslarıda bulunmaktadır. S&amp;ouml;z gelimi iş akışı i&amp;ccedil;erisinde &lt;strong&gt;transaction&lt;/strong&gt; desteğini sağlamak i&amp;ccedil;in &lt;strong&gt;System.Transactions&lt;/strong&gt;, akış i&amp;ccedil;erisinden web servisleri ile iletişime ge&amp;ccedil;ebilmek i&amp;ccedil;in &lt;strong&gt;System.Web&lt;/strong&gt;, &lt;strong&gt;System.Web.Services&lt;/strong&gt; gibi &lt;strong&gt;assembly&lt;/strong&gt;' ları &amp;ouml;rnek olarak g&amp;ouml;sterebiliriz.&lt;/p&gt;
&lt;p&gt;Proje i&amp;ccedil;erisine varsayılan olarak atılan &lt;strong&gt;Workflow1&lt;/strong&gt; isimli &lt;strong&gt;sınıfın(Class)&lt;/strong&gt; hiyerarşik yapısı ise aşağıdaki &lt;strong&gt;sınıf diyagramında(Class Diagram)&lt;/strong&gt; olduğu gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_3.gif" alt="" width="612" height="554" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek &lt;strong&gt;Sequential Workflow Console Application&lt;/strong&gt; olduğundan, i&amp;ccedil;eride kullanılacak varsayılan iş akışıda &lt;strong&gt;Sequential Workflow&lt;/strong&gt; olarak ele alınmaktadır. Bu sebepten dolayı &lt;strong&gt;sealed(kendisinden t&amp;uuml;retme yapılamaz)&lt;/strong&gt; olarak tanımlanmış &lt;strong&gt;Workflow1&lt;/strong&gt; isimli sınıf ilk etapta &lt;strong&gt;SequentialWorkflowActivity&lt;/strong&gt; sınıfından t&amp;uuml;remektedir. Ancak enteresan olan bir nokta vardır. &amp;Ouml;rnek geliştirilirken kullanılacak olan standart pek &amp;ccedil;ok akitivite bileşeninin &lt;strong&gt;Activity&lt;/strong&gt; isimli sınıfdan t&amp;uuml;rediği g&amp;ouml;r&amp;uuml;lecektir. Dikkate değer olan, &lt;strong&gt;aktiviteleri(adımları-Steps)&lt;/strong&gt; i&amp;ccedil;eren &lt;strong&gt;Workflow&lt;/strong&gt; tipinin kendisininde aslında bir aktivite nesnesi olmasıdır. &lt;em&gt;(Sınıf diyagramında pek &amp;ccedil;ok tip yer almaktadır. Bu tiplerin detaylarını ilerleyen makalelerimizde inceleme fırsatı bulacağız.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizdeki iş akışının i&amp;ccedil;eriğini geliştirmeden &amp;ouml;nce &lt;strong&gt;Program.cs&lt;/strong&gt; dosyası i&amp;ccedil;erisindeki kod par&amp;ccedil;alarına kısaca bakalım. Şu aşamada &lt;strong&gt;Workflow1&lt;/strong&gt; tipine ait &lt;strong&gt;iş akışını(Workflow)&lt;/strong&gt; veya başkalarını &amp;ccedil;alıştıracak ve y&amp;uuml;r&amp;uuml;t&amp;uuml;cek olan kısım &lt;strong&gt;Main&lt;/strong&gt; metodunun i&amp;ccedil;eriğidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Text;
using System.Threading;
using System.Workflow.Runtime;
using System.Workflow.Runtime.Hosting;

namespace MerhabaWWF
{
    class Program
    {
        static void Main(string[] args)
        {
            using(WorkflowRuntime workflowRuntime = new WorkflowRuntime())
            {
                AutoResetEvent waitHandle = new AutoResetEvent(false);
                workflowRuntime.WorkflowCompleted += delegate(object sender, WorkflowCompletedEventArgs e) {waitHandle.Set();};
                workflowRuntime.WorkflowTerminated += delegate(object sender, WorkflowTerminatedEventArgs e)
                                                                            {
                                                                                Console.WriteLine(e.Exception.Message);
                                                                                waitHandle.Set();
                                                                            };

                WorkflowInstance instance = workflowRuntime.CreateWorkflow(typeof(MerhabaWWF.Workflow1));
                instance.Start();

                waitHandle.WaitOne();
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi &lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisinde neler yapıldığına kısaca bir bakalım. &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; sınıfı iş akışlarının devreye sokulması, bunların &amp;ccedil;alışması i&amp;ccedil;in gerekli ortamın hazırlanması, &amp;ccedil;alışma zamanı iş akışlarının izlenmesi, denetlenmesi gibi işlemleri &amp;uuml;stlenen &amp;ouml;nemli bir sınıftır. Pek &amp;ccedil;ok &amp;ouml;nemli &lt;strong&gt;olayı(Event)&lt;/strong&gt; vardır. Bunlardan &amp;ouml;rnekte hazır olarak sunulan &lt;strong&gt;WorkflowCompleted&lt;/strong&gt; olayı iş akışının tamamlanması sonrasında devreye girmektedir. Bir iş akışı işlemleri tamamlandıktan sonra geriye değer d&amp;ouml;nd&amp;uuml;rebilir.&lt;/p&gt;
&lt;p&gt;Bu sebepten dolayı &lt;strong&gt;WorkflowCompletedEventArgs&lt;/strong&gt; tipinden olan olay parametresinin &lt;strong&gt;OutputParameters&lt;/strong&gt; &amp;ouml;zelliğinden yararlanılarak WorkflowCompleted olay metodu i&amp;ccedil;erisinde sonu&amp;ccedil; alınması sağlanabilir.Tahmin edileceği gibi &lt;strong&gt;WorkflowTerminated&lt;/strong&gt; olayı, herhangibir hata nedeni ile(&amp;ccedil;oğunlukla bir &lt;strong&gt;istisna-exception&lt;/strong&gt;) iş akışı tamamlanamadığında devreye girmektedir. Bu olayla ilişkili olan &lt;strong&gt;WorkflowTerminatedEventArgs&lt;/strong&gt; sınıfı &amp;uuml;zerinden hareket edilerek oluşan&lt;strong&gt; istisna(Exception)&lt;/strong&gt; referansı &lt;strong&gt;&amp;ccedil;alışma zamanında(runtime) &lt;/strong&gt;yakalanabilir. Dikkat edilecek olursa &lt;strong&gt;Visual Studio&lt;/strong&gt; tarafından otomatik olarak &amp;uuml;retilen bu kod par&amp;ccedil;asında olaylara ait fonksiyonelliklerin hazırlanmasında &lt;strong&gt;isimsiz metodlardan(anonymous methods)&lt;/strong&gt; yararlanılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Using&lt;/strong&gt; bloğu i&amp;ccedil;erisinde oluşturulan &amp;ouml;rneklerden bir diğeride &lt;strong&gt;AutoResetEvent&lt;/strong&gt; sınıfına ait nesnedir. Bu sınıf temel olarak &lt;strong&gt;thread&lt;/strong&gt; senkronizasyonu y&amp;ouml;netimi amacıyla tasarlanmıştır. Host uygulamanın kendi i&amp;ccedil;erisinde bir veya daha &amp;ccedil;ok iş akışını tetiklemesi sonrasında askıda kalması istenen bir durum değildir. Nitekim bir &lt;strong&gt;iş akışı(Workflow)&lt;/strong&gt; &amp;ccedil;alıştırıldığında &lt;strong&gt;Workflow &amp;ccedil;alışma zamanı(Runtime) &lt;/strong&gt;bunu &lt;strong&gt;host&lt;/strong&gt; uygulamadaki ana &lt;strong&gt;thread&lt;/strong&gt;' in dışında ayrı bir thread i&amp;ccedil;erisine alacaktır. &lt;strong&gt;AutoResetEvent&lt;/strong&gt; sınıfının &lt;strong&gt;Set&lt;/strong&gt; metodu bu tip bir durumda kalındığında bekleyen thread' in serbest bırakılmasını sağlamaktadır. Dikkat edilecek olursa &lt;strong&gt;Set&lt;/strong&gt; metodu hem &lt;strong&gt;WorkflowCompleted&lt;/strong&gt; hemde &lt;strong&gt;WorkflowTerminated&lt;/strong&gt; olay metoduları i&amp;ccedil;erisinde &amp;ccedil;ağırılmakta ve bekleyen &lt;strong&gt;thread&lt;/strong&gt;' in serbest bırakılması sağlanmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisinde &amp;ouml;rneklenen diğer bir nesne sınıfıda &lt;strong&gt;WorkflowInstance&lt;/strong&gt;' dır. Bu sınıfta &lt;strong&gt;sealed&lt;/strong&gt; olarak tanımlanmıştır. Bir başka deyişle kendisinden t&amp;uuml;retme yapılamamaktadır. Aynı zamanda &lt;strong&gt;yapıcı metodları(Constructor)&lt;/strong&gt; erişimide yoktur. Kendisi ancak &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; sınıfının static &lt;strong&gt;CreateWorkflow&lt;/strong&gt; metodu ile &amp;ouml;rneklenebilmektedir. Bu metodun &lt;strong&gt;aşırı y&amp;uuml;klenmiş(Overload)&lt;/strong&gt; farklı versiyonları bulunmaktadır. &amp;Ouml;zellikle iş akışına dışarıdan parametre değerleri aktarılabilmesini sağlayan versiyonu vardır ki bu &amp;ouml;nemlidir. Nitekim pek &amp;ccedil;ok iş akışının başlangıcında bir takım dış parametre bilgilerine ihtiya&amp;ccedil; vardır. Diğer taraftan bir &lt;strong&gt;XOML(eXtensible Object Markup Language)&lt;/strong&gt; dosyasında tanımlı herhangibir iş akışının y&amp;uuml;klenmesini sağlayan versiyonuda bulunmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Main&lt;/strong&gt; metodunun sonunda &lt;strong&gt;AutoResetEvent&lt;/strong&gt; sınıfına ait nesne &amp;ouml;rneği &amp;uuml;zerinden &lt;strong&gt;WaitOne&lt;/strong&gt; fonksiyonu &amp;ccedil;ağırılır. Bu &amp;ccedil;ağrı, &amp;ccedil;alışan ana &lt;strong&gt;thread&lt;/strong&gt;' in bekleyen iş akışları tamamlanıncaya kadar duraksatılması i&amp;ccedil;in &amp;ouml;nemlidir. Nitekim iş akışının i&amp;ccedil;erisindeki adımların ger&amp;ccedil;ekleştirilme s&amp;uuml;relerinin belirsiz olması ihtimali vardır. &lt;strong&gt;WaitOne&lt;/strong&gt; metodu ilerlenip ilerlenmeyeceğine, diğer &lt;strong&gt;thread&lt;/strong&gt;' lerden gelen sinyallere g&amp;ouml;re karar vermektedir. Tahmin edileceği gibi &amp;ouml;rnekte yer alan s&amp;ouml;z konusu sinyal &lt;strong&gt;Set&lt;/strong&gt; metodu ile yayınlanmaktadır.&lt;/p&gt;
&lt;p&gt;Artık iş akışı i&amp;ccedil;erisine &amp;ouml;rnek bir &lt;strong&gt;adım(Step) &lt;/strong&gt;ekleyerek devam edebiliriz. Daha &amp;ouml;nceden de belirtildiği gibi adımlar aslında birer &lt;strong&gt;aktivite(Activity)&lt;/strong&gt; olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilirler. &lt;strong&gt;WWF&lt;/strong&gt; mimarisi &amp;ccedil;ok sayıda hazır aktivite sunmaktadır. Bu aktivite bileşenlerine iş akışına ait tasarım penceresindeylen &lt;strong&gt;ToolBox&lt;/strong&gt; kısmından da erişilebilir. Var olan t&amp;uuml;m aktivite bileşenleri &lt;strong&gt;System.Workflow.ComponentModel&lt;/strong&gt; &lt;strong&gt;isim alanında(Namespace)&lt;/strong&gt; yer alan &lt;strong&gt;Activity&lt;/strong&gt; sınıfından(Class) t&amp;uuml;remektedir. Hazır aktivite bileşenlerine &amp;ouml;rnek olarak &lt;strong&gt;IfElseActivity&lt;/strong&gt;, &lt;strong&gt;CodeActivity&lt;/strong&gt;, &lt;strong&gt;CallExternalMethodActivity&lt;/strong&gt;, &lt;strong&gt;DelayActivity&lt;/strong&gt;, &lt;strong&gt;EventDrivenActivity&lt;/strong&gt;, &lt;strong&gt;ReplicatorActivity&lt;/strong&gt;, &lt;strong&gt;ParallelActivity&lt;/strong&gt;, &lt;strong&gt;TerminateActivity&lt;/strong&gt; ve daha pek &amp;ccedil;oğu verilebilir.&lt;/p&gt;
&lt;p&gt;Biz &amp;ouml;rneğimizde basit olması a&amp;ccedil;ısından &lt;strong&gt;CodeActivity&lt;/strong&gt; ve &lt;strong&gt;IfElseActivity&lt;/strong&gt; bileşenlerini kullanıyor olacağız. CodeActivity bileşeni sayesinde iş akışının herhangibir adımında &amp;ccedil;alıştırılması istenen kodlar ele alınabilmektedir. Temel olarak bileşenin &lt;strong&gt;ExecuteCode&lt;/strong&gt; &amp;ouml;zelliğine atanan değerin işaret ettiği metod, aktiviteye gelindiğinde &amp;ccedil;alıştırılacak olan kodları i&amp;ccedil;ermektedir. &lt;strong&gt;IfElseActivity&lt;/strong&gt; bileşeni yardımıyla bir iş akışının herhangibir noktasına karar yapıları eklenebilmektedir. IfElseActivity bileşeni kendi i&amp;ccedil;erisinde birden fazla &lt;strong&gt;IfElseBranchActivity&lt;/strong&gt; &amp;ouml;rneği i&amp;ccedil;erebilmektedir. Bu IfElseBranchActivity &amp;ouml;rneklerinin her biri karar yapısı i&amp;ccedil;erisindeki farklı dallanmaları ifade etmektedir.&lt;/p&gt;
&lt;p&gt;Dilerseniz &amp;ouml;rnek &amp;uuml;zerinden devam ederek iş akışını tamamlamaya &amp;ccedil;alışalım. &amp;Ouml;rnek senaryoda bir &amp;uuml;r&amp;uuml;n&amp;uuml;n stoktaki miktarına g&amp;ouml;re &amp;ccedil;alışacak bir iş akışı tasarlayacağız. S&amp;ouml;z gelimi stok miktarının belirli bir değerin altına inmesi halinde &amp;ccedil;alışacak bir iş akışı s&amp;ouml;z konusu olabilir. Hatta farklı aralık değerlerine g&amp;ouml;re farklı dallanmalar yapılmasıda sağlanabilir. &lt;em&gt;(Bu noktada iş akışının ne kadar anlamlı olduğu &amp;ccedil;ok &amp;ouml;nemli değildir. Nitekim hedeflenen, temel bir iş akışının &lt;/em&gt;&lt;strong&gt;WWF&lt;/strong&gt;&lt;em&gt; altında geliştirilmesi ve kullanılmasıdır.) &lt;/em&gt;İlk olarak tasarım zamanında iken &lt;strong&gt;Workflow1&lt;/strong&gt; &amp;uuml;zerine bir &lt;strong&gt;IfElseActivity&lt;/strong&gt; bileşenini &lt;strong&gt;ToolBox&lt;/strong&gt;' tan s&amp;uuml;r&amp;uuml;kleyerek bırakalım. Bırakılma işleminden sonra ilk etapta aşağıdaki g&amp;ouml;r&amp;uuml;nt&amp;uuml; ortaya &amp;ccedil;ıkacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_5.gif" alt="" width="378" height="351" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği gibi &lt;strong&gt;IfElseActivity&lt;/strong&gt; i&amp;ccedil;erisine varsayılan olarak iki adet &lt;strong&gt;IfElseBranchActivity&lt;/strong&gt; bileşeni daha eklenmiştir. Bu noktada soldaki IfElseBranchActivity bileşeninin belirtilen koşul &lt;strong&gt;true&lt;/strong&gt; olduğunda &amp;ccedil;alıştırılması, diğerinin ise &lt;strong&gt;false&lt;/strong&gt; durumuna karşılık olarak değerlendirilmesi doğru bir yaklaşımdır. Her bir IfElseBranchActivity kendi i&amp;ccedil;erisinde başka aktivitelerin tetiklenmesinede neden olmaktadır.&lt;strong&gt; Drop Activites Here&lt;/strong&gt; kısmına bu ama&amp;ccedil;la &amp;ccedil;eşitli &lt;strong&gt;aktivite bileşenleri(Activity Components)&lt;/strong&gt; bırakılabilir. IfElseBranchActivity' lerin en &amp;ouml;nemli &amp;uuml;yesi aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndende g&amp;ouml;r&amp;uuml;lebileceği gibi &lt;strong&gt;Condition&lt;/strong&gt; &lt;strong&gt;&amp;ouml;zelliğidir(Property)&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_6.gif" alt="" width="623" height="394" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Condition&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;Code Condition&lt;/strong&gt; ve &lt;strong&gt;Declarative Rule Condition &lt;/strong&gt;olmak &amp;uuml;zere iki farklı değer verilebilir. Peki bunlar ne anlama gelmektedir? Code Condition değerinin atanması halinde koşulun bir metod ile değerlendirileceği belirtilir. S&amp;ouml;z konusu metod &lt;strong&gt;bool&lt;/strong&gt; bir değerlendirme yapmalıdır. &lt;strong&gt;Declarative Rule Condition&lt;/strong&gt; se&amp;ccedil;eneği sayesinde ise, koşul kodun dışında ayrı bir şekilde ele alınır. Bu &amp;ccedil;eşit bir kullanım &lt;strong&gt;&amp;ccedil;alışma zamanında(Run-Time)&lt;/strong&gt; yeniden derleme gerektirmeden koşul değişikliği yapma imkanı sunmaktadır. &amp;Ouml;rneğimizde ilk olarak &lt;strong&gt;Declarative Rule Condition&lt;/strong&gt; se&amp;ccedil;eneğini inceliyor olacağız. Bu kriter se&amp;ccedil;ildikten sonra &lt;strong&gt;Condition&lt;/strong&gt; &amp;ouml;zelliği altına iki alt &amp;uuml;yenin daha eklendiği g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_7.gif" alt="" width="355" height="202" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bunlardan &lt;strong&gt;ConditionName&lt;/strong&gt; koşulun adını ifade ederken, &lt;strong&gt;Expression&lt;/strong&gt; ise koşula ait ifadeyi i&amp;ccedil;ermektedir. ConditionName &amp;ouml;zelliğine sembolik olarak &lt;strong&gt;Miktar50Altinda&lt;/strong&gt; verdiğimizi d&amp;uuml;ş&amp;uuml;nelim. Bundan sonra &lt;strong&gt;Expression&lt;/strong&gt; &amp;ouml;zelliği yanındaki &amp;uuml;&amp;ccedil; nokta d&amp;uuml;ğmesine tıklarsak aşağıdaki arabirim ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_8.gif" alt="" width="639" height="320" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu ekranda geriye &lt;strong&gt;true&lt;/strong&gt; veya &lt;strong&gt;false&lt;/strong&gt; d&amp;ouml;nd&amp;uuml;rebilecek şekilde bir koşul tanımlaması yapılmaktadır. Dikkat edilecek olursa metin kutusu i&amp;ccedil;eriğinde &lt;strong&gt;intellisense&lt;/strong&gt; desteği vardır. Ancak bu noktada iş akışının doğurduğu &amp;ouml;nemli bir ihtiya&amp;ccedil;ta ortaya &amp;ccedil;ıkmaktadır. Bir şekilde iş akışına, &amp;uuml;r&amp;uuml;ne ait stok miktarı değerinin aktarılması gerekmektedir. Lakin koşulun değerlendirmesi gereken durum stok miktarının belirli bir değerin altında olması halinde yapılacak işlemler ile ilgilidir. Dolayısıyla iş akışına dışarıdan paramete aktarılması gerekmektedir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bir iş akışına aktarılacak olan parametreler herhangibir .Net CLR(Common Language Runtime) tipi olabilir. Bu &amp;ouml;nemli bir avantajdır, nitekim bir iş akışı(Workflow) &amp;ouml;nceden tanımlı veya geliştirici tarafından yazılmış herhangibir tip verisi ile başlatılabilir. İş akışlarının herhangibir .Net CLR tipini parametre olarak alabilmesinde object tipi etkin bir rol oynar. Elbetteki bir iş akışına birden fazla parametrede g&amp;ouml;nderilebilmektedir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bunun yapmanın yolu ise son derece basittir. Nitekim Workflow tipi aslında bir sınıftır. Dolayısıyla &lt;strong&gt;Workflow&lt;/strong&gt; tipine&lt;strong&gt; &amp;ouml;zellikler(Property) &lt;/strong&gt;ekleyerek dış ortamdan parametre aktarımı sağlanabilir. Bu nedenle &amp;ouml;rnekte yer alan Workflow1 sınıfına aşağıdaki gibi bir &amp;ouml;zelliğin ilave edilmesi yeterlidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public sealed partial class Workflow1: SequentialWorkflowActivity
{
    private int _stokMiktari;

    public int StokMiktari
    {
        get { return _stokMiktari; }
        set { _stokMiktari = value; }
    }

    public Workflow1()
    {
        InitializeComponent();
    }
}&lt;/pre&gt;
&lt;p&gt;Artık tasarım tarafına d&amp;ouml;n&amp;uuml;lerek ilk &lt;strong&gt;IfElseBranchActivity&lt;/strong&gt; i&amp;ccedil;in gerekli koşul aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki gibi oluşturulabilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_9.gif" alt="" width="398" height="163" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re &lt;strong&gt;StokMiktari&lt;/strong&gt; &lt;strong&gt;&amp;ouml;zelliğinin(Property) &lt;/strong&gt;değerinin 10 ile 50 arasındaki olması halinde, bu &lt;strong&gt;IfElseBranchActitiy&lt;/strong&gt; bileşenin arkasından gelecek olan aktivite &amp;ccedil;alıştırılacaktır. Bu noktada ne yapılmak istendiği &amp;ouml;nemlidir. S&amp;ouml;z gelimi bu koşulun sağlanması halinde &amp;uuml;reticiye yeni &amp;uuml;r&amp;uuml;n talepleri i&amp;ccedil;in &lt;strong&gt;mail&lt;/strong&gt; veya &lt;strong&gt;Sms&lt;/strong&gt; g&amp;ouml;nderilmesi gibi işlemler yaptırılabilir. Yine &amp;ccedil;ok basit olarak d&amp;uuml;ş&amp;uuml;nerek hareket edelim ve mail g&amp;ouml;nderme işleminin yapılacağı kod bloğunu işaret edecek bir &lt;strong&gt;CodeActivity&lt;/strong&gt; bileşenini aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi tasarım ortamına atalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_10.gif" alt="" width="617" height="426" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;CodeActivity&lt;/strong&gt; bileşeninin en &amp;ouml;nemli &amp;uuml;yesi &lt;strong&gt;ExecuteCode&lt;/strong&gt; &amp;ouml;zelliğidir. Bu &amp;ouml;zelliğe atanacak olan isim, bu adımda &amp;ccedil;alıştırılacak olan metodun adıdır. Bu olay metodunun otomatik olarak oluşuturulması sağlanabilir. Bunun i&amp;ccedil;in &lt;strong&gt;ExecuteCode&lt;/strong&gt; &amp;ouml;zelliğine bir metod adı yazılması ve &lt;strong&gt;enter&lt;/strong&gt;' a basılması yeterlidir. &amp;Ouml;rnekteki &lt;strong&gt;ExecuteCode&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;MailGonder&lt;/strong&gt; ismini yazıp &lt;strong&gt;enter&lt;/strong&gt; tuşuna bastığımızda &lt;strong&gt;Workflow1&lt;/strong&gt; sınıfına aşağıdaki metodun otomatik olarak eklendiği g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void MailGonder(object sender, EventArgs e)
{
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &amp;uuml;retilen metod stadart bir olay metodu yapısındadır. Geriye değer d&amp;ouml;nd&amp;uuml;rmemekte ve iki adet parametre almaktadır. İş mantığında bu adımda işletilmesi gereken kodlar nelerse bu metod i&amp;ccedil;erisine yazılmalıdır. S&amp;ouml;z gelimi bu adımda mail g&amp;ouml;nderme işlemi yaptırılabilir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;IfElseActivity&lt;/strong&gt; i&amp;ccedil;erisinde sağ tarafta kalan ikinci bir &lt;strong&gt;IfElseBranchActivity&lt;/strong&gt; bileşeni daha vardır. Şu anki senaryoda bu bileşen &lt;strong&gt;else&lt;/strong&gt; olma durumunda ne olacağını belirtmektedir. Diğer taraftan &amp;ouml;rnek senaryoda başka &lt;strong&gt;IfElseBranchActivity&lt;/strong&gt; bileşenlerinin eklenmeside m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. &amp;Ouml;rneğin Stok miktarının herhangibir nedenle 0 ve altında olması hali ve Stok Miktarının 50' nin &amp;uuml;zerinde olması hali gibi. Bu durumların her biri i&amp;ccedil;in birer IfElseBranchActivity kontrol&amp;uuml; eklenip gerekli aksiyonların ger&amp;ccedil;ekleştirilmesi sağlanabilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;IfElseActivity bileşenleri i&amp;ccedil;erisine IfElseBranchActivity bileşenlerini eklemek i&amp;ccedil;in sağ tıklayıp Add Branch demek yeterlidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_11.gif" alt="" width="386" height="342" border="0" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bu ama&amp;ccedil;la &amp;ouml;rneğimize aşağıdaki şekildede g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi başka &lt;strong&gt;IfElseBranchActivity&lt;/strong&gt; bileşenleri daha eklediğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_13.gif" alt="" width="638" height="319" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada ikinci &lt;strong&gt;IfElseBranchActivity&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt;StokMiktari&lt;/strong&gt; &amp;ouml;zelliğinin değerinin &lt;strong&gt;0&lt;/strong&gt;' ın altında ve eşit olduğu durumda &amp;ccedil;alıştırılacak bir kod aktivitesi yer almaktadır. 3nc&amp;uuml; IfElseBranchActivity i&amp;ccedil;erisinde &lt;strong&gt;StokMiktari&lt;/strong&gt; &amp;ouml;zelliğinin değerinin &lt;strong&gt;50&lt;/strong&gt; ile &lt;strong&gt;500&lt;/strong&gt; arasında olduğu durumda &amp;ccedil;alışacak bir aktivite bulunur. Son IfElseBranchActivity par&amp;ccedil;asında ise var olan koşulların dışındaki durum ele alınmaktadır. Genellikle birden fazla IfElseBranchActivity i&amp;ccedil;eren durumlarda t&amp;uuml;m ihtimallerin dışında kalabilecek bir se&amp;ccedil;eneğide ele almak i&amp;ccedil;in &lt;strong&gt;Condition&lt;/strong&gt; &amp;ouml;zelliği herhangibir şekilde atanmamış boş bir &lt;strong&gt;IfElseBranchActivity&lt;/strong&gt; par&amp;ccedil;ası kullanmakta yarar vardır. &amp;Ouml;rnekte bu tarz bir durum i&amp;ccedil;in yine kod aktivitesi y&amp;uuml;r&amp;uuml;t&amp;uuml;lmektedir. Elbette her &lt;strong&gt;CodeActivity&lt;/strong&gt; bileşenin &lt;strong&gt;ExecuteCode&lt;/strong&gt; &amp;ouml;zelliğine ilgili değerlerin atanması ve oluşan olay metodlarının kodlanması gerekmektedir. Şimdilik bu kısım bizim a&amp;ccedil;ımızdan &amp;ouml;nemli değildir. Nitekim &amp;ouml;rneğe son olarak yapılan eklemelerde kavranması gereken birden fazla &lt;strong&gt;IfElseBranchActivity&lt;/strong&gt; bileşenin bir arada ele alınabilmesidir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;IfElseBranchActivity işlemlerinde karar mekanizması olarak Declarative Rule Condition kullanılması halinde kuralların rules uzantılı bir XML dosyası i&amp;ccedil;erisine yazıldığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde &amp;ouml;rnekte kullanılan IfElseBranchActivity' ler i&amp;ccedil;in oluşturulan Workflow1.rules dosyasının sadece bir kısmı g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_14.gif" alt="" width="449" height="325" border="0" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Şimdi iş akışı i&amp;ccedil;in daha fazla &amp;ouml;nem arz eden bir konu &amp;uuml;zerinde durulmalıdır. İş akışına ilgili parametreler nasıl aktarılacaktır? Bu ama&amp;ccedil;la &lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisinde yer alan kod par&amp;ccedil;alarında bazı değişiklikler yapılması gerekmektedir. Daha &amp;ouml;ncedende belirtildiği gibi &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; sınıfına ait &lt;strong&gt;CreateInstance&lt;/strong&gt; metodunun ikinci parametresi iş akışlarına değer g&amp;ouml;ndermek i&amp;ccedil;in kullanılmaktadır. İş akışları herhangibir &lt;strong&gt;.Net CLR&lt;/strong&gt; tipini parametre olarak aldığından ve dış ortamdan iş akışına g&amp;ouml;nderilen değerin hangi &amp;ouml;zelliğe aktarıldığının bilinmesi gerektiğinden &lt;strong&gt;generic Dictionary&amp;lt;string,object&amp;gt;&lt;/strong&gt; koleksiyonu kullanılmaktadır. B&amp;ouml;ylece ilgili iş akışının hangi &amp;ouml;zelliğine, hangi değerin aktarılacağı belirtilebilir. Bu aynı zamanda iş akışına birden fazla parametre değeri g&amp;ouml;nderilebilmesi anlamınada gelmektedir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekte kullanılan &lt;strong&gt;StokMiktari &amp;ouml;zelliğinin(Property) &lt;/strong&gt;değeri iş akışına dış ortamdan, &amp;ouml;rneğin Host uygulama i&amp;ccedil;erisinden gelmektedir. Bu nedenle &lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisinde aşağıdaki değişikliklerin yapılması gerekir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Dictionary&amp;lt;string, object&amp;gt; parametreler = new Dictionary&amp;lt;string, object&amp;gt;();
parametreler.Add("StokMiktari", 45);

WorkflowInstance instance = workflowRuntime.CreateWorkflow(typeof(MerhabaWWF.Workflow1),parametreler);&lt;/pre&gt;
&lt;p&gt;İlk olarak parametre veya parametreleri taşıyacak olan &lt;strong&gt;Dictionary&amp;lt;string,object&amp;gt;&lt;/strong&gt; koleksiyonu &amp;ouml;rneklenir. Bu &lt;strong&gt;generic&lt;/strong&gt; koleksiyonun &lt;strong&gt;anahtarları(Keys) string, değerleri(Values)&lt;/strong&gt; ise &lt;strong&gt;object&lt;/strong&gt; t&amp;uuml;r&amp;uuml;nden olmalıdır. Daha sonra &lt;strong&gt;Add&lt;/strong&gt; metodu ile parametre ekleme işlemi ger&amp;ccedil;ekleştirilir. &amp;Ouml;rnekte StokMiktari isimi &amp;ouml;zellik i&amp;ccedil;in 45 değerinin verileceği belirtilmektedir. Son olarak &lt;strong&gt;WorkflowInstance&lt;/strong&gt; &amp;ouml;rneği oluşturulurken &lt;strong&gt;CreateWorkflow&lt;/strong&gt; metodunun ikinci parametresine, koleksiyona ait nesne &amp;ouml;rneği atanır. Burada dikkat edilmesi gereken bazı noktalarda vardır. Herşeyden &amp;ouml;nce &lt;strong&gt;Dictionary&lt;/strong&gt; koleksiyonuna eklenen parametre adının, &lt;strong&gt;iş akışı(Workflow)&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde tanımlanan &lt;strong&gt;&amp;ouml;zellik adı(Property Name)&lt;/strong&gt; ile bire bir uygun olması gerekmektedir. S&amp;ouml;z gelimi &lt;strong&gt;Add&lt;/strong&gt; metodunda StokMiktari yerine stokmiktari yazılırsa aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi &amp;ccedil;alışma zamanında &lt;strong&gt;ArgumentException istisnası(Exception)&lt;/strong&gt; alınır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_15.gif" alt="" width="630" height="144" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu noktadan sonra iş akışı başarılı bir şekilde &amp;ccedil;alışacaktır. &amp;Ouml;rnek olarak tasarlanan iş akışının herhangibir amacı ve başarısı yoktur ancak temel kavramların nasıl uygulanacağını g&amp;ouml;stermektedir.&lt;/p&gt;
&lt;p&gt;Makalemize &lt;strong&gt;IfElseBranchActivity&lt;/strong&gt; bileşenlerinde &lt;strong&gt;Condition&lt;/strong&gt; &amp;ouml;zelliğinde &lt;strong&gt;Code Condition&lt;/strong&gt; se&amp;ccedil;eneğini nasıl kullanacağımızı inceleyerek devam edelim. Bu ama&amp;ccedil;la &amp;ouml;rnek olarak herhangibir &lt;strong&gt;IfElseBranchActivity&lt;/strong&gt;' nin &lt;strong&gt;Condition&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;Code Condition&lt;/strong&gt; değerini atmamız yeterli olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_16.gif" alt="" width="264" height="174" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada &lt;strong&gt;Condition&lt;/strong&gt; altında yer alan &lt;strong&gt;Condition&lt;/strong&gt; &amp;ouml;zelliğinede bir metod adı verilmesi gerekmektedir. &amp;Ouml;rneğin &lt;strong&gt;Stok10ile50Arasindami&lt;/strong&gt; ismini verip enter tuşuna bastığımızı d&amp;uuml;ş&amp;uuml;nelim. Bunun sonucu olarak &lt;strong&gt;workflow1.cs &lt;/strong&gt;i&amp;ccedil;erisine aşağıdaki metodun eklendiği g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void Stok10ile50Arasindami(object sender, ConditionalEventArgs e)
{

}&lt;/pre&gt;
&lt;p&gt;Metodun &lt;strong&gt;bool&lt;/strong&gt; tipinde bir değerlendirme yapması gerekmektedir. Buna karşın dikkat edileceği &amp;uuml;zere &lt;strong&gt;void&lt;/strong&gt; tipinde oluşturulmuştur. İşte bu noktada koşulun sonucunu geriye d&amp;ouml;nd&amp;uuml;rmek i&amp;ccedil;in &lt;strong&gt;ConditionalEventArgs&lt;/strong&gt; tipinden olan parametrenin, &lt;strong&gt;Result&lt;/strong&gt; &amp;ouml;zelliğinden yararlanılır. &lt;strong&gt;Result&lt;/strong&gt; &amp;ouml;zelliği &lt;strong&gt;bool&lt;/strong&gt; tipindendir ve koşula g&amp;ouml;re &lt;strong&gt;true&lt;/strong&gt; veya &lt;strong&gt;false &lt;/strong&gt;değerini almalıdır. Buna g&amp;ouml;re kod aşağıdaki şekilde d&amp;uuml;zenlenebilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void Stok10ile50Arasindami(object sender, ConditionalEventArgs e)
{
    if (StokMiktari &amp;gt;= 10 &amp;amp;&amp;amp; StokMiktari &amp;lt;= 50)
        e.Result = true;
    else
        e.Result = false;
}&lt;/pre&gt;
&lt;p&gt;Eğer StokMiktari &amp;ouml;zelliğinin değeri 10 ile 50 arasında ise bu koşul sağlanmış demektir. Bu durumda &lt;strong&gt;Result&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;true&lt;/strong&gt; değeri atanmalıdır. Eğer true değeri atanırsa &lt;strong&gt;IfElseBranchActivity&lt;/strong&gt;' den sonra gelen aktivitenin &amp;ccedil;alıştırılması da sağlanmış olur. Elbetteki buradaki kod par&amp;ccedil;asında, koşulun sağlanmış olma veya olmama haline g&amp;ouml;re sıradaki aktiviteye ge&amp;ccedil;ilmeden &amp;ouml;nce farklı işlemler yapıtırılmasıda sağlanabilir.&lt;/p&gt;
&lt;p&gt;Makalemizin son b&amp;ouml;l&amp;uuml;m&amp;uuml;nde &lt;strong&gt;iş akışını(Workflow)&lt;/strong&gt; bir &lt;strong&gt;sınıf k&amp;uuml;t&amp;uuml;phanesi(Class Library)&lt;/strong&gt; olarak nasıl tasarlayabileceğimizi ve bunu &amp;ouml;rneğin bir &lt;strong&gt;windows&lt;/strong&gt; uygulamasında nasıl &lt;strong&gt;host&lt;/strong&gt; edebileceğimizi incelemeye &amp;ccedil;alışacağız. Bu sefer proje şablonu olarak &lt;strong&gt;Sequenatial&lt;/strong&gt; &lt;strong&gt;Workflow&lt;/strong&gt; &lt;strong&gt;Library&lt;/strong&gt; modelini se&amp;ccedil;memiz gerekiyor. Oluşan sınıf k&amp;uuml;t&amp;uuml;phanesi(Class Library) i&amp;ccedil;erisinde yine standart olarak &lt;strong&gt;Workflow1&lt;/strong&gt; isimli bir iş akışı nesnesi bulunur. &amp;Ouml;rnek olarak bir metin dosyasının i&amp;ccedil;erisinde parametre olarak verilen bir kelimenin bulunması veya bulunmaması halinde yapılabilecek bazı işlemler olduğunu ve bunun bir iş s&amp;uuml;reci olarak g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığını d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z konusu s&amp;uuml;recin birden fazla &lt;strong&gt;.Net&lt;/strong&gt; uygulaması i&amp;ccedil;erisinde ele alınabileceğini d&amp;uuml;ş&amp;uuml;n&amp;uuml;rsek iş akışının sınıf k&amp;uuml;t&amp;uuml;phanesi olarak tasarlanması son derece mantıklıdır. İş akışının bu anlamda dışarıdan alması gereken iki adet parametre bulunmaktadır. Bunlardan birisi dosya adresini, diğeri ise aranacak bilgiyi tutmalıdır. Diğer taraftan iş akışından &lt;strong&gt;Host&lt;/strong&gt; eden uygulamayada bilgi g&amp;ouml;nderilmesi istenebilir. S&amp;ouml;z gelimi arama sonu&amp;ccedil;larına dair bir string bilgi s&amp;ouml;z konusu olabilir. Doğal olarak 3nc&amp;uuml; bir &amp;ouml;zelliğe daha gerek vardır. Bu nedenle &lt;strong&gt;workflow1&lt;/strong&gt; sınıfı i&amp;ccedil;erisine aşağıdaki kod par&amp;ccedil;asında yer alan &lt;strong&gt;&amp;ouml;zelliklerin(Properties)&lt;/strong&gt; eklenmesi gerekmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public sealed partial class Workflow1: SequentialWorkflowActivity
{
    private string _dosyaAdresi;
    private string _arananKelime;
     private string _aramaSonucu;

    public string AramaSonucu
    {
        get { return _aramaSonucu; }
        set { _aramaSonucu = value; }
    }

    public string ArananKelime
    {
        get { return _arananKelime; }
        set { _arananKelime = value; }
    }

    public string DosyaAdresi
    {
        get { return _dosyaAdresi; }
        set { _dosyaAdresi = value; }
    }

    public Workflow1()
    {
        InitializeComponent();
    }
}&lt;/pre&gt;
&lt;p&gt;İlk &amp;ouml;rneğimizdeki gibi bir &lt;strong&gt;IfElseActivity&lt;/strong&gt; ve iki adet &lt;strong&gt;IfElseBranchActivity&lt;/strong&gt; ekliyoruz. Burada dosya i&amp;ccedil;erisinde bir bilgi arama işlemi yapılmak istendiğinden koşulun kod yardımıyla kontrol edilmesi, bu nedenle&lt;strong&gt; Code Condition &lt;/strong&gt;se&amp;ccedil;eneğinin kullanılması daha mantıklıdır. Hatalara &amp;ccedil;ok fazla takılmamak adına sadece &lt;strong&gt;txt&lt;/strong&gt; uzantılı dosyaları ele aldığımızı d&amp;uuml;ş&amp;uuml;nelim. &lt;strong&gt;IfElseBranchActivity1&lt;/strong&gt; bileşeninin &lt;strong&gt;Condition&lt;/strong&gt; &amp;ouml;zelliğinin değerini &lt;strong&gt;Code&lt;/strong&gt; &lt;strong&gt;Condition&lt;/strong&gt; olarak ayarladıktan sonra alt Condition &amp;ouml;zelliğinede ArananKelimeVarmi bilgisini yazalim. Bu &lt;strong&gt;IfElseBranchActivity1&lt;/strong&gt; i&amp;ccedil;in &amp;ccedil;alışacak koşul kontrol metodunun adı olacaktır. &lt;strong&gt;IfElseBranchActivity2&lt;/strong&gt; bileşeni i&amp;ccedil;in herhangibir &lt;strong&gt;Condition&lt;/strong&gt; ataması yapılmasına gerek yoktur. Nitekim otomatik olarak else durumunun değerlendirileceği yerdir. Her iki aktivitenin arkasından &amp;ccedil;alıştırılmak istenen kodların yer aldığı &lt;strong&gt;CodeActivity&lt;/strong&gt; bileşenlerinide ekleyelim. Sonu&amp;ccedil;ta iş akışının tasarım zamanındaki g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_17.gif" alt="" width="365" height="355" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;CodeActivity1&lt;/strong&gt; i&amp;ccedil;in &lt;strong&gt;ArananBilgiVar&lt;/strong&gt; isimli bir metod, &lt;strong&gt;CodeActivity2&lt;/strong&gt; bileşeni i&amp;ccedil;inde &lt;strong&gt;ArananBilgiYok&lt;/strong&gt; isimli bir metod devreye girecektir. Buna g&amp;ouml;re &lt;strong&gt;Workflow1&lt;/strong&gt; sınıfının başlangı&amp;ccedil;taki i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ComponentModel;
using System.ComponentModel.Design;
using System.Collections;
using System.Drawing;
using System.Workflow.ComponentModel.Compiler;
using System.Workflow.ComponentModel.Serialization;
using System.Workflow.ComponentModel;
using System.Workflow.ComponentModel.Design;
using System.Workflow.Runtime;
using System.Workflow.Activities;
using System.Workflow.Activities.Rules;
using System.IO;

namespace StokAkislari
{
    public sealed partial class Workflow1: SequentialWorkflowActivity
    {
        private string _dosyaAdresi;
        private string _arananKelime;
        private string _aramaSonucu;

        public string AramaSonucu
        {
            get { return _aramaSonucu; }
            set { _aramaSonucu = value; }
        }

        public string ArananKelime
        {
            get { return _arananKelime; }
            set { _arananKelime = value; }
        }

        public string DosyaAdresi
        {
            get { return _dosyaAdresi; }
            set { _dosyaAdresi = value; }
        }

        public Workflow1()
        {
            InitializeComponent();
        }

        // IfElseBranchActivity1 bileşenine ait koşul kontrol metodu
        private void ArananKelimeVarmi(object sender, ConditionalEventArgs e)
        {
            if (File.Exists(DosyaAdresi))
            {
                StreamReader reader = new StreamReader(DosyaAdresi); 
                e.Result = reader.ReadToEnd().Contains(ArananKelime);
            }
            else 
                e.Result = false;
        }

        // CodeActivity1 i&amp;ccedil;in &amp;ccedil;alışacak olay metodu
        private void ArananBilgiVar(object sender, EventArgs e)
        {
            // Aranan bilgi bulunduğunda yapılacak işlemler
            AramaSonucu = ArananKelime + " " + DosyaAdresi + " i&amp;ccedil;inde bulunmuştur";
        }

        // CodeActivity2 i&amp;ccedil;in &amp;ccedil;alışacak olay metodu
        private void ArananBilgiYok(object sender, EventArgs e)
        {
            // Aranan bilgi bulunamadığında yapılacak işlemler
            AramaSonucu = ArananKelime + " " + DosyaAdresi + " i&amp;ccedil;inde bulunamamıştır";
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Amacımız her zamanki gibi konuyu basit&amp;ccedil;e kavramak olduğundan &lt;strong&gt;CodeActivity&lt;/strong&gt; bileşenleri ile ilişkili kod par&amp;ccedil;aları şimdilik g&amp;ouml;z ardı edilmiştir. Artık &lt;strong&gt;host&lt;/strong&gt; uygulamayı yazarak devam edebiliriz. Bu ama&amp;ccedil;la basit bir &lt;strong&gt;Windows&lt;/strong&gt; uygulaması tasarlayacağız. Uygulamamız &lt;strong&gt;text&lt;/strong&gt; tabanlı dosyaların se&amp;ccedil;imine ve aranacak kelimenin girilmesine izin verecek bir arabirime sahip olacaktır. Buradaki asıl hedefimiz ise bir .&lt;strong&gt;Net&lt;/strong&gt; uygulaması i&amp;ccedil;erisinden herhangibir &lt;strong&gt;iş akışının(Workflow)&lt;/strong&gt; nasıl &amp;ccedil;alıştırılabileceğini g&amp;ouml;rmektir. Windows uygulamasında tahim edileceği gibi bazı &lt;strong&gt;Workflow&lt;/strong&gt; &lt;strong&gt;assembly&lt;/strong&gt;' larının ve iş akışlarını taşıyan k&amp;uuml;t&amp;uuml;phanenin eklenmiş olması gerekmektedir. Sonu&amp;ccedil; itibariyle &lt;strong&gt;windows&lt;/strong&gt; uygulamasında aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len referansların dahil edilmesiyle işe başlanmalıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_19.gif" alt="" width="280" height="306" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu noktadan sonra Windows uygulamasının aşağıdaki gibi tasarlandığını d&amp;uuml;ş&amp;uuml;nebiliriz. Kullanıcı Dosya Se&amp;ccedil; başlıklı d&amp;uuml;ğmeye bastığında a&amp;ccedil;ılacak iletişim kutusu ile txt uzantılı dosya se&amp;ccedil;ebilecektir. Aranacak kelime bilgiside girildikten sonra s&amp;uuml;recin başlatılması i&amp;ccedil;in tek yapılması gereken S&amp;uuml;reci Başlat başlıklı d&amp;uuml;ğmeye basmak olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk237_18.gif" alt="" width="422" height="180" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dosya se&amp;ccedil;me işlemi i&amp;ccedil;in &lt;strong&gt;OpenFileDialog&lt;/strong&gt; bileşeni kullanılamktadır. Sadece &lt;strong&gt;Text&lt;/strong&gt; tabanlı dosyalar ele alınmak istendiğinden &lt;strong&gt;Filter&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;Text Files|*.txt&lt;/strong&gt; değeri atanmıştır. Uygulamanın kod i&amp;ccedil;eriği ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Text;
using System.Windows.Forms;
using System.Workflow.Runtime;
using System.Threading;
using StokAkislari;

namespace Istemci
{
    public partial class Form1 : Form
    {
        private WorkflowRuntime _wfRunTime;
        private WorkflowInstance _wfInstance;
        // Workflow thread' lerinin y&amp;ouml;netimi i&amp;ccedil;in AutoResetEvent nesnesi kullanılır
        private AutoResetEvent _arEvent = new AutoResetEvent(false);

        public Form1()
        {
            InitializeComponent();

            // Workflow &amp;ccedil;alışma zamanı nesnesi &amp;ouml;rneklenir
            _wfRunTime = new WorkflowRuntime();
        
            // Workflow tamamlandığında devreye girecek olay metodu y&amp;uuml;klenir
            _wfRunTime.WorkflowCompleted += delegate(object sender, WorkflowCompletedEventArgs e)
                                                                    {
                                                                        MessageBox.Show(e.OutputParameters["AramaSonucu"].ToString());
                                                                        _arEvent.Set();
                                                                    };

            // Workflow' un &amp;ccedil;alışması sırasında bir istisna oluştuğunda devreye girecek olay metodu y&amp;uuml;klenir.
            _wfRunTime.WorkflowTerminated += delegate(object sender, WorkflowTerminatedEventArgs e)
                                                                    {
                                                                        MessageBox.Show(e.Exception.Message);
                                                                        _arEvent.Set();
                                                                    };
        }

        private void btnDosyaSec_Click(object sender, EventArgs e)
        {
            if (openFileDialog1.ShowDialog() == DialogResult.OK)
            {
                txtDosyaAdresi.Text = openFileDialog1.FileName;
            }
        }

        private void btnSureciBaslat_Click(object sender, EventArgs e)
        {
            try
            {
                if (!String.IsNullOrEmpty(txtArananKelime.Text)
                        &amp;amp;&amp;amp; !String.IsNullOrEmpty(txtDosyaAdresi.Text))
                {
                    // parametrelerin g&amp;ouml;nderilmesi i&amp;ccedil;in Dictionary koleksiyonu &amp;ouml;rneklenir
                    Dictionary&amp;lt;string, object&amp;gt; parametreler = new Dictionary&amp;lt;string, object&amp;gt;();

                    // Workflow1 i&amp;ccedil;erisindeki &amp;ouml;zelliklerin alacağı değerler set edilir.
                    parametreler.Add("DosyaAdresi", txtDosyaAdresi.Text);
                    parametreler.Add("ArananKelime", txtArananKelime.Text);
    
                    // Workflow1 i&amp;ccedil;in bir &amp;ouml;rnek oluşturulur.
                    _wfInstance = _wfRunTime.CreateWorkflow(typeof(Workflow1), parametreler);
    
                    // Workflow1 başlatılır.
                    _wfInstance.Start();
    
                    _arEvent.WaitOne();
                }
                else
                    MessageBox.Show("Verilerde eksik var");
            }
            catch (Exception exp)
            {
                MessageBox.Show(exp.Message);
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Geliştirilen &amp;ouml;rnekte &lt;strong&gt;form &lt;/strong&gt;nesnesi &amp;uuml;retilirken &lt;strong&gt;iş akışı &amp;ccedil;alışma ortamı(Workflow Run-Time)&lt;/strong&gt; i&amp;ccedil;in gerekli ayarlar yapılmaktadır. Bu ama&amp;ccedil;la &lt;strong&gt;WorkflowRuntime&lt;/strong&gt; nesnesi &amp;ouml;rneklenmekte, &lt;strong&gt;WorkflowCompleted&lt;/strong&gt;, &lt;strong&gt;WorkflowTerminated&lt;/strong&gt; gibi olaylar &lt;strong&gt;isimsiz metodlar(Anonymous Methods)&lt;/strong&gt; aracılığıyla y&amp;uuml;klenmektedir. Bir &amp;ouml;nceki &amp;ouml;rnekten farklı olarak dikkat edilmesi gereken nokta WorkflowCompleted olay metodu i&amp;ccedil;erisinde &lt;strong&gt;WorkflowCompletedEventArgs&lt;/strong&gt; sınıfına ait &lt;strong&gt;OutputParameters&lt;/strong&gt; &amp;ouml;zelliğinin kullanılışıdır. Bu &amp;ouml;zellikte &lt;strong&gt;Dictionary&amp;lt;string,object&amp;gt; &lt;/strong&gt;tipinden &lt;strong&gt;generic&lt;/strong&gt; bir koleksiyonu ele almaktadır. &amp;Ouml;zelliğin amacı, iş akışından uygulama ortamına değer aktarımını sağlamaktır. Bu ama&amp;ccedil;la &lt;strong&gt;indeksleyici(Indexer)&lt;/strong&gt; operat&amp;ouml;r&amp;uuml; i&amp;ccedil;erisinde, iş akışında tanımlanan &lt;strong&gt;AramaSonucu&lt;/strong&gt; &amp;ouml;zelliğinin adı verilmektedir.&lt;/p&gt;
&lt;p&gt;Doğal olarak s&amp;uuml;recin bir şekilde başlatılması gerekmektedir. Bu ama&amp;ccedil;la &lt;strong&gt;WorflowInstance&lt;/strong&gt; &amp;ouml;rneği oluşturulduktan sonra, &lt;strong&gt;Start&lt;/strong&gt; metodu &amp;ccedil;ağırılmaktadır. T&amp;uuml;m bu başlatma işlemi ise &lt;strong&gt;Form&lt;/strong&gt; &amp;uuml;zerindeki bir &lt;strong&gt;Button&lt;/strong&gt; kontrol&amp;uuml;ne ait &lt;strong&gt;Click&lt;/strong&gt; olay metodu i&amp;ccedil;erisinde ger&amp;ccedil;ekleştirilmektedir. &amp;Ouml;rnek test edildiğinde bir d&amp;ouml;k&amp;uuml;man i&amp;ccedil;erisinde aranan bilginin var olup olmadığına dair sonu&amp;ccedil;ların alındığı g&amp;ouml;r&amp;uuml;lecektir. &lt;em&gt;(Tahmin edileceği &amp;uuml;zere bu tarz bir ihtiya&amp;ccedil; normal bir sınıf k&amp;uuml;t&amp;uuml;phanesi i&amp;ccedil;erisine alınacak bir tip ilede, iş akışlarına gerek olmadan tasarlanabilir. Ancak ger&amp;ccedil;ek iş problemleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında tek başına yeterli bir &amp;ccedil;&amp;ouml;z&amp;uuml;m olmayacaktır.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Buraya kadar yazdıklarımız ile &lt;strong&gt;iş akışı(Workflow) &lt;/strong&gt;kavramını, &lt;strong&gt;Windows Workflow Foundation &lt;/strong&gt;yaklaşımını incelemeye &amp;ccedil;alıştık. Giriş niteliğindeki bu makalemizde, bir iş akışı i&amp;ccedil;in ger&amp;ccedil;ek hayat senaryoları kullanmamış olsakta, &lt;strong&gt;WWF&lt;/strong&gt; ile nasıl geliştirilebileceklerini, herhangibir &lt;strong&gt;.Net&lt;/strong&gt; uygulamasından nasıl kullanılabileceklerini g&amp;ouml;rd&amp;uuml;k. Bundan sonraki makalelerimizde &lt;strong&gt;WWF&lt;/strong&gt; mimarisinin başka konularınıda incelemeye &amp;ccedil;alışıyor olacağız. Makalemize son vermeden &amp;ouml;nce Windows Workflow Foundation ile ilgili kaynak &lt;strong&gt;kitaplar&lt;/strong&gt; hakkında bilgi vermek isterim. S&amp;ouml;z konusu kitaplar ve bunlara ait &amp;ouml;zet bilgiler aşağıdaki tabloda yer aldığı gibidir.&lt;/p&gt;
&lt;table style="border-collapse: collapse; width: 100%;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;strong&gt; Kitap&lt;/strong&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;strong&gt; &amp;Ouml;zet Bilgi&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;img src="/makale/images/Wf_Book_1.jpg" alt="" width="90" height="115" border="0" /&gt;&lt;/td&gt;
&lt;td valign="top"&gt;&lt;strong&gt; &lt;a href="http://www.amazon.com/Microsoft-Windows-Workflow-Foundation-Developer/dp/073562335X/ref=pd_bbs_3?ie=UTF8&amp;amp;s=books&amp;amp;qid=1198592693&amp;amp;sr=8-3"&gt; Microsoft Windows Workflow Foundation Step by Step&lt;/a&gt;&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;Mart 2007&lt;/strong&gt; tarihinde &amp;ccedil;ıkan &lt;strong&gt;Microsoft Press&lt;/strong&gt;' e ait bu kitap i&amp;ccedil;erisindeki bilgiler ile WWF mimarisini adım adım &amp;ouml;ğrenmek m&amp;uuml;mk&amp;uuml;n. Aynen &lt;strong&gt;Microsoft Windows Communication Foundation Step by Step&lt;/strong&gt; kitabında olduğu gibi olduk&amp;ccedil;a iyi bir anlatıma sahip. Kısa s&amp;uuml;rede tamamlanabilecek bu kitap ile WWF mimarisini orta seviyede &amp;ouml;ğrenmek m&amp;uuml;mk&amp;uuml;n. Toplam 19 b&amp;ouml;l&amp;uuml;mden oluşan kitap i&amp;ccedil;erisinde iş akışlarının &lt;strong&gt;SOA ile entegrasyonu, transaction desteği, paralel aktivitilerin(Activities) tasarlanması&lt;/strong&gt; gibi ileri seviye konularda yer almakta.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;img src="/makale/images/Wf_Book_2.jpg" alt="" width="90" height="115" border="0" /&gt;&lt;/td&gt;
&lt;td valign="top"&gt;&lt;strong&gt; &lt;a href="http://www.amazon.com/exec/obidos/tg/detail/-/1590597788/ref=ord_cart_shr?_encoding=UTF8&amp;amp;m=ATVPDKIKX0DER&amp;amp;v=glance"&gt; Pro WF: Windows Workflow in .NET 3.0 (Expert's Voice in .Net)&lt;/a&gt;&lt;/strong&gt;
&lt;p&gt;&lt;strong&gt;Şubat 2007&lt;/strong&gt; tarihinde &lt;strong&gt;APress&lt;/strong&gt; tarafından yayınlanan bu kitap &lt;strong&gt;744 sayfalık&lt;/strong&gt; bir i&amp;ccedil;eriği 17 b&amp;ouml;l&amp;uuml;m altında toplamakta. Workflow konusunda yazılmış kitaplar arasında temelden ileri seviyeye doğru giden ve en anlaşılır olanlarından bir tanesi. İleri seviye sayılabilecek b&amp;ouml;l&amp;uuml;mlerde, iş akışlarının dinamik g&amp;uuml;ncellenmesi, iş akışlarında serileştirme, iş akışlarının izlenmesi gibi konu başlıklarıda yer almaktadır.&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;img src="/makale/images/Wf_Book_3.jpg" alt="" width="90" height="115" border="0" /&gt;&lt;/td&gt;
&lt;td valign="top"&gt;&lt;strong&gt; &lt;a href="http://www.amazon.com/exec/obidos/tg/detail/-/0470053860/ref=ord_cart_shr?_encoding=UTF8&amp;amp;m=ATVPDKIKX0DER&amp;amp;v=glance"&gt; Professional Windows Workflow Foundation&lt;/a&gt;&lt;/strong&gt;
&lt;p&gt;&lt;strong&gt;Wrox&lt;/strong&gt; yayınlarından &lt;strong&gt;Mart 2007&lt;/strong&gt; tarihinde &amp;ccedil;ıkartılan bu kitap &lt;strong&gt;410 sayfalık &lt;/strong&gt;m&amp;uuml;tevazi bir i&amp;ccedil;eriğe sahip. Lakin bu i&amp;ccedil;erik sayesinde &amp;ccedil;ok kısa zamanda Windows Workflow Foundation mimarisini anlamak ve etkin bir şekilde kullanabilmek m&amp;uuml;mk&amp;uuml;n. &amp;Uuml;stelik kitapta &lt;strong&gt;best practices,&lt;/strong&gt; ileri seviyede aktivite(Activity) tasarlanması, dinamik g&amp;uuml;ncelleştirme, ofis(Office) sistemleri ile entegrasyon gibi enteresan kısımlarda yer almakta.&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/WWFGiris.rar"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2008-01-01 12:00:00</pubDate>
  <slug>Ilk-Bakc4b1sta-Windows-Workflow-Foundation-bsenyurt-com-dan</slug>
  <tags>
    <tag>wf</tag>
    <tag>workflow-foundation</tag>
    <tag>hello-world</tag>
  </tags>
  <categories>
    <category>WF</category>
  </categories>
</post>