<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net 4.0 - Özelleştirilmiş Cache Sağlayıcısı(Custom Cache Provider) [Beta 2]</title>
  <description>Dikkatimi çeken ilk özellik ön bellekleme(Caching) sisteminin genişletilebilmesi ile alakalıydı. Bilindiği üzere web uygulamalarında performansı arttırmanın en etikili yollarından biriside sunucu tarafındaki yükü azaltarak mümkün olabilmektedir...</description>
  <content>&lt;p&gt;&lt;img style="float: left;" src="/pics/2009%2f11%2fblg102_Giris.jpg" alt="" /&gt;Merhaba Arkdaşlar,&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok &amp;ccedil;ok uzun zamandır &lt;strong&gt;Asp.Net&lt;/strong&gt; &amp;uuml;zerine eğilmiyordum. Hem tasarım y&amp;ouml;n&amp;uuml;nden kabiliyetsiz olmam&lt;em&gt;(iki rengi bir araya getir deseler kesin uyumsuz renkler &amp;ccedil;ıkartırım)&lt;/em&gt;&amp;nbsp;hemde servis y&amp;ouml;nelimli mimari d&amp;uuml;nyasına dalmış olmamın bunda b&amp;uuml;y&amp;uuml;k bir rol oynadığını itiraf etmek isterim. Yine de &lt;strong&gt;Asp.Net 4.0&lt;/strong&gt; ile birlikte gelen yenilikleri okuyunca biraz olsun araştırmak ve edindiğim tecr&amp;uuml;beleri sizlere aktarmak istedim.&lt;/p&gt;
&lt;p&gt;Dikkatimi &amp;ccedil;eken ilk &amp;ouml;zellik &lt;strong&gt;&amp;ouml;n&lt;/strong&gt; &lt;strong&gt;bellekleme(Caching)&lt;/strong&gt; sisteminin genişletilebilmesi ile alakalıydı. Bilindiği &amp;uuml;zere web uygulamalarında performansı arttırmanın en etikili yollarından biriside sunucu tarafındaki y&amp;uuml;k&amp;uuml; azaltarak m&amp;uuml;mk&amp;uuml;n olabilmektedir. Bu manada istemci tarafına, sunucu &amp;uuml;zerinde &amp;ouml;n belleğe atılmış hazır veri &amp;ccedil;ıktılarını g&amp;ouml;ndermek etkili bir yaklaşımdır. &lt;strong&gt;Asp.Net&lt;/strong&gt; tarafında &amp;ouml;n bellekleme i&amp;ccedil;in farklı teknikler kullanılabilir. &lt;strong&gt;Son s&amp;uuml;re bildirimli(Expire Date), uzatmalı(Sliding), bağımlı(Dependency, SqlCacheDependency, FileDependency gibi) &lt;/strong&gt;vb...&amp;Uuml;stelik &amp;ouml;n belleklenecek veri i&amp;ccedil;eriği sayfa bazında, Web User Control bazında vb olabilir. Yine de eksik olan bir şeyler vardır. Herşeyden &amp;ouml;nemlisi &amp;ouml;n bellekleme ger&amp;ccedil;ekten bellek &amp;uuml;zerinde yapılmaktadır. &lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt;&amp;nbsp;Basit bir blog sitesi i&amp;ccedil;in &amp;ouml;n belleklenecek veri i&amp;ccedil;eriği &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k problem teşkil etmeyebilir.&lt;/p&gt;
&lt;p&gt;Ne varki &amp;ccedil;ok sayıda kullanıcıya hizmet veren portallerde &amp;ouml;n belleklenen nesnelerin sayısının, i&amp;ccedil;eriğinin artması, beraberinde belleğinde &amp;ouml;l&amp;ccedil;eklendirilmesi ihtiyacını doğurmaktadır. Buna g&amp;ouml;re daha &amp;ccedil;ok bellek almak gibi bir maliyet altına girmek gerekebilir. Bu duruma karşın &lt;strong&gt;Asp.Net 4.0&lt;/strong&gt; ile birlikte &amp;ouml;n bellekleme işlemini daha kolay bir şekilde &amp;ouml;zelleştirebilme şansına sahibiz. Bir başka deyişle kendi &lt;strong&gt;Cache Provider&lt;/strong&gt; tiplerimizi geliştirerek &amp;ouml;n bellekleme yerini ve&amp;nbsp;modelini&amp;nbsp;değiştirebilir kendi algoritmalarımızı işin i&amp;ccedil;erisine katabiliriz. Tabi &lt;strong&gt;Beta 2&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;ne g&amp;ouml;re bu konuyu incelediğimden ve yazıyı hazırladığım tarih itibariyle internet &amp;uuml;zerinde &amp;ccedil;ok fazla kaynak bulamadığımdan halen daha pek &amp;ccedil;ok noktada soru işareti vuku bulmuş durumdadır. Bu nedenle zaman i&amp;ccedil;erisinde bu konuda &amp;ccedil;ok daha detaylı bilgiye ulaşabileceğimizi d&amp;uuml;ş&amp;uuml;nmekteyim.&lt;/p&gt;
&lt;p&gt;Dilerseniz hi&amp;ccedil; vakit kaybetmeden &amp;ouml;rnek bir senaryo &amp;uuml;zerinden hareket edelim. Amacımız web uygulamamızda kullanılan bir&lt;strong&gt; Web User Control'&lt;/strong&gt; &amp;uuml;n i&amp;ccedil;eriğini zamana bağlı olarak &amp;ouml;n belleklerken, dosya tabanlı bir sistemden yararlanmak. Buna g&amp;ouml;re &amp;ouml;n belleğe atılacak olan nesne i&amp;ccedil;eriğinin fiziki olarak bir dosya i&amp;ccedil;erisine &lt;strong&gt;serileştirmeyi(Serialization)&lt;/strong&gt; planlıyoruz. &amp;Ccedil;ok doğal olarak web uygulaması i&amp;ccedil;erisinde n sayıda sayfa ve n sayıda Web User Control olabilir. Buda fiziki olarak her &lt;strong&gt;Web User Control&lt;/strong&gt; i&amp;ccedil;in birden fazla serileştirilmiş veri i&amp;ccedil;eriği tutan dosya anlamına gelmektedir. Diğer yandan sistemimizde &lt;strong&gt;Expire&lt;/strong&gt; eden dosyaların silinmesi işlemlerini de g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almalıyız. Yani bu dosyaların i&amp;ccedil;erikleri gelen yeni bir talep sonrasında yeniden &amp;uuml;retilmeli, talep gelmediği ve Duration dolduğunda ise silinmelidir şeklide bir yol tercih ediyoruz.&lt;/p&gt;
&lt;p&gt;Peki &lt;strong&gt;Asp.Net 4.0&lt;/strong&gt; tarafında bu tip &amp;ouml;zelleştirilmiş bir &lt;strong&gt;Cache&lt;/strong&gt; sağlayıcısı i&amp;ccedil;in ne getirilmiştir?&lt;/p&gt;
&lt;p&gt;Aslında tahmin etmek olduk&amp;ccedil;a kolaydır. Var olan bir sisteme yeni bir eklenti ilave etmek istiyorsak tercih edilecek yollardan birisi, sistemin bize s&amp;ouml;ylediği kurallara uymaktır. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Şimdilik bu kuralı s&amp;ouml;yleyen &lt;strong&gt;OutputCacheProvider&lt;/strong&gt; isimli &lt;strong&gt;abstract &lt;/strong&gt;bir sınıftır. S&amp;ouml;z konusu sınıf &lt;strong&gt;Add, Get, Set&lt;/strong&gt; ve &lt;strong&gt;Remove &lt;/strong&gt;isimli abstract metodlar i&amp;ccedil;ermektedir. Buna g&amp;ouml;re geliştireceğimiz&lt;strong&gt; Cache Provider&lt;/strong&gt; sınıfının bu fonksiyonları mutlaka ve mutlaka ezmesi gerekmektedir. Bir başka deyişle &lt;strong&gt;Cache&lt;/strong&gt; sistemi i&amp;ccedil;in gerekli temel &lt;strong&gt;CRUD&lt;/strong&gt; operasyonlarının tarafımızdan uygulanması gerekmektedir. Peki yeterli midir? Elbette değildir.&lt;/p&gt;
&lt;p&gt;Bir şekilde web uygulaması tarafına, kendi &amp;ouml;zel &lt;strong&gt;Cache&lt;/strong&gt; sağlayıcımızı kullanabileceğimizi ifade etmemiz gerekecektir ki bunun i&amp;ccedil;inde tahmin edeceğiniz &amp;uuml;zere &lt;strong&gt;web.config&lt;/strong&gt; dosyasından yararlanılacaktır. Geliştireceğimiz &amp;ouml;rnekte &amp;ouml;zel &lt;strong&gt;Cache&lt;/strong&gt; sağlayıcısını &amp;ccedil;ok kısıtlı olarak kullanabileceğiz. İlk hedefimiz senaryomuzda belirttiğimiz &amp;uuml;zere&lt;strong&gt; Web User Control&lt;/strong&gt; i&amp;ccedil;eriklerini &amp;ouml;n belleklemektir. Buna g&amp;ouml;re standart olarak kullandığımız &lt;strong&gt;OutputCache&lt;/strong&gt; direktifinde bir şekilde &amp;ouml;zel Cache sağlayıcımızı da işaret edebilmeliyiz ki buda olduk&amp;ccedil;a kolaydır. &amp;Ouml;yleyse hi&amp;ccedil; vakit kaybetmeden &amp;ouml;rneğimizi geliştirmeye başlayalım. İlk olarak &lt;strong&gt;DiskCacheProvider&lt;/strong&gt; isimli &lt;strong&gt;OutputCacheProvider &lt;/strong&gt;tipinden t&amp;uuml;reyen aşağıdaki sınıfı geliştirmeliyiz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;DiskCacheProvider sınıfına ait diagram;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg102_ClassDiagram.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Custom Provider kodu;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Runtime.Serialization.Formatters.Binary;
using System.Timers;
using System.Web.Caching;
using System.Collections.Concurrent;

namespace CustomCaching
{
    public class DiskCacheProvider
        : OutputCacheProvider
    {
        // Expire olan Cache nesnelerini tutan dosyaların silinmesi i&amp;ccedil;in bir Timer nesnesi kullanılır
        Timer watcher;
        // Cache nesnelerinin serileştirildiği dosyaların tutulduğu klas&amp;ouml;r
        string cachePath = "C:\\Cache\\";
        // Dosya adı ve Expire zamanlarını tutan koleksiyon nesnesi. Eş zamanlı &amp;ccedil;ıkartma işlemine destek verebilmek i&amp;ccedil;in .Net 4.0 ile gelen Concurrent koleksiyonlardan birisi kullanılmaktadır.
        ConcurrentDictionary&amp;lt;string, DateTime&amp;gt; cacheExpireList;

        // Yapıcı metod i&amp;ccedil;erisinde gerekli nesne başlatma işlemleri yapılır
        public DiskCacheProvider()
        {
            cacheExpireList = new ConcurrentDictionary&amp;lt;string, DateTime&amp;gt;();

            // Timer nesne &amp;ouml;rneği 3 saniyede bir Elapsed olayını tetikleyecektir
            watcher = new Timer(3000);
            // Elapsed olayı i&amp;ccedil;erisinde Expire olan output cache dosyalarının bulunması sağlanır
            watcher.Elapsed += (o, e) =&amp;gt;
            {
                // Koleksiyonda duran Expire zamanı ile g&amp;uuml;ncel zaman karşılaştırılarak bir sonuca gidilmeye &amp;ccedil;alışılır
                var discardedList = from cacheItem in cacheExpireList
                                    where cacheItem.Value &amp;lt; DateTime.Now
                                    select cacheItem;
                // Expire olmaya aday olan Cache nesnelerine ait dosyalar i&amp;ccedil;in Remove metodu &amp;ccedil;ağırılır.
                // Eğer normal bir Dictionary&amp;lt;T,K&amp;gt; koleksiyonu kullanılırsa &amp;ccedil;alışma zamanında InvalidOperationException alınabilir. Nitekim discardedList ile gezilirken cacheExpireList' in değişmiş olma ihtimali bulunabilir. Bu nedenle ConcurrentDictionary&amp;lt;T,K&amp;gt; kullanılması tercih edilmiştir
                foreach (var discarded in discardedList)
                {
                    Remove(discarded.Key);
                    // Koleksiyondan &amp;ccedil;ıkartılır
                    DateTime discardedDate;
                    cacheExpireList.TryRemove(discarded.Key, out discardedDate);
                }
            };
            // Timer nesne &amp;ouml;rneği başlatılır
            watcher.Start();
        }

        // utcExpiry parametresi, Cache i&amp;ccedil;in Expire s&amp;uuml;resini belirtir
        public override object Add(string key, object entry, DateTime utcExpiry)
        {
            FileStream fs = new FileStream(String.Format("{0}{1}.binary", cachePath, key), FileMode.Create, FileAccess.Write);
            BinaryFormatter formatter = new BinaryFormatter();
            formatter.Serialize(fs, entry);
            fs.Close();
            cacheExpireList.TryAdd(key, utcExpiry.ToLocalTime());
            return entry;
        }

        // Cache' den nesnesi elde etmek i&amp;ccedil;in kullanılan metoddur
        // OutputCacheProvider abstract sınıfından gelen ve ezilmesi mecburi olan bir fonksiyondur.
        public override object Get(string key)
        {
            string path = String.Format("{0}{1}.binary", cachePath, key);
            // &amp;Ouml;rnekteki sistem Cache nesne i&amp;ccedil;eriklerini dosya tabanlı olarak tutmaktadır. Bu noktada dosyanın sistemde var olup olmadığına bakılarak Cache' lenen bir i&amp;ccedil;erik olup olmadığı sonucuna varılabilir
            if (File.Exists(path))
            {
                FileStream fs = new FileStream(path, FileMode.Open, FileAccess.Read);
                BinaryFormatter formatter = new BinaryFormatter();
                // Ters serileştirme işlemi ile dosya i&amp;ccedil;eriğinden Cache' lenen nesnenin canlandırılması sağlanır
                object result = formatter.Deserialize(fs);
                fs.Close();
                return result;
            }
            else
                return null;
        }

        // Cache nesnesinin kaldırılması i&amp;ccedil;in kullanılan metoddur. OutputCacheProvider abstract sınıfından gelen ve ezilmesi mecburi olan bir fonksiyondur.
        // OutputCacheProvider abstract sınıfından gelen ve ezilmesi mecburi olan bir fonksiyondur.
        public override void Remove(string key)
        {
            string path = String.Format("{0}{1}.binary", cachePath, key);
            if (File.Exists(path)) // Eğer dosya var ise Cache' lenen bir nesne var olduğu sonucuna ulaşabiliriz
            {
                // Dosya silinir
                File.Delete(path);
            }
        }

        // Set metodunda Cache in saklanması işlemleri ger&amp;ccedil;ekleştirilir. Genellikle overwrite mantığına g&amp;ouml;re &amp;ccedil;alışır. Yani Cache' lenen nesne varsada &amp;uuml;zerine yazılması yoluna gidilir
        // OutputCacheProvider abstract sınıfından gelen ve ezilmesi mecburi olan bir fonksiyondur.
        public override void Set(string key, object entry, DateTime utcExpiry)
        {
            // Cache' lenen i&amp;ccedil;erik varsa overwrite işlemi yapılır.
            string path = String.Format("{0}{1}.binary", cachePath, key);

            FileStream fs = new FileStream(path, FileMode.Create, FileAccess.Write);
            BinaryFormatter formatter = new BinaryFormatter();
            // Cache nesnesi serileştirilerek dosyaya yazdırılır
            formatter.Serialize(fs, entry);
            fs.Close();
            // Cache' lenen nesne serileştirildiği dosyada tutulduğundan expire s&amp;uuml;relerini takip edebilmek i&amp;ccedil;in ilgili koleksiyonda bilgilendirme yapılır.
            cacheExpireList.TryAdd(key, utcExpiry.ToLocalTime());
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi &amp;ccedil;ok kısaca neler yaptığımıza bir bakalım. Cache sağlayıcımız Cache' lenecek olan nesneleri varsayılan olarak &lt;strong&gt;C:\Cache&lt;/strong&gt; isimli bir klas&amp;ouml;r altında dosyalamaktadır&lt;em&gt;(Aslında bu bilgide ilgili provider' a &amp;ouml;rneğin yapıcı metod yardımıyla web.config dosyası &amp;uuml;zerinden ge&amp;ccedil;irilebilir)&lt;/em&gt;. S&amp;ouml;z konusu nesne i&amp;ccedil;erikleri ilgili dosyalara &lt;strong&gt;binary&lt;/strong&gt; formatta serileştirilmektedir. Bu ama&amp;ccedil;la &lt;strong&gt;BinaryFormatter&lt;/strong&gt; tipinden yararlanılmaktadır.&amp;nbsp;&amp;Ouml;zellikle Cache' e nesne atma işlemi sırasında devreye giren &lt;strong&gt;Set&lt;/strong&gt; metodu i&amp;ccedil;erisinde, dosya adı i&amp;ccedil;in &lt;strong&gt;key&lt;/strong&gt; parametresininin kullanıldığına dikkat edilmelidir.&amp;nbsp;Hatta asıl dikkat edilmesi gereken nokta her cache i&amp;ccedil;in değişik bir&amp;nbsp;key değerinin &amp;uuml;retildiğidir&lt;em&gt;(Ancak ispatını yapamadım hen&amp;uuml;z bunu belirteyim)&lt;/em&gt;.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Diğer yandan &lt;strong&gt;Expire&lt;/strong&gt; s&amp;uuml;releride ilgili metodlara(&amp;ouml;rneğin Set) parametre olarak gelmektedir. Bu s&amp;uuml;re bilgilerinden yararlanılarak &amp;ouml;n bellekten d&amp;uuml;ş&amp;uuml;rme işlemleri yapılmalıdır. &amp;Ouml;rneği geliştirirken beklentilerimi boşa &amp;ccedil;ıkaran noktalardan biriside&amp;nbsp;aslında Expire s&amp;uuml;releri ile ilişkilidir.&amp;nbsp;Ş&amp;ouml;yleki; &amp;ouml;rneği geliştirirken &lt;strong&gt;Remove&lt;/strong&gt; metodunun belirtilen &lt;strong&gt;Duration&lt;/strong&gt; s&amp;uuml;resi sonlandığında otomatik olarak devreye gireceğini tahmin etmiştim. Ancak bu şekilde olmadı &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;Bu nedenle Cache' lenen dosyaların zamanı geldiğinde silinmesi i&amp;ccedil;in bir mekanizmanın geliştirilmesi gerekiyordu. Bu ama&amp;ccedil;la &lt;strong&gt;Timer&lt;/strong&gt; nesnesinden yararlanarak &lt;strong&gt;Elapsed&lt;/strong&gt; olayı i&amp;ccedil;erisinde gerekli silme işlemlerini ger&amp;ccedil;ekleştirmeyi tercih ettim.&amp;nbsp; &amp;Ccedil;ok doğal olarak hangi dosyaların silinmesi gerektiğini anlayabilmek i&amp;ccedil;inde basit bir koleksiyon tabanlı yapıyı tercih ettim. Tabiki Thread Safe bir yapı s&amp;ouml;z konusu değil.&amp;nbsp;Hatta eş zamanlı ger&amp;ccedil;ekleşebiliecek &amp;ccedil;ıkarma işlemlerine karşın kolaya ka&amp;ccedil;ıp &lt;strong&gt;ConcurrentCollection&amp;lt;T,K&amp;gt; &lt;/strong&gt;kullandığımı ifade edebilirim.&amp;nbsp;Aslına bakarsanız şu an i&amp;ccedil;in tek derdim ger&amp;ccedil;ekten &amp;ouml;zelleştirilmiş bu Cache sağlayıcısının &amp;ccedil;alışıp &amp;ccedil;alışmadığını g&amp;ouml;rebilmek. &lt;img title="Cool" src="/editors/tiny_mce3/plugins/emotions/img/smiley-cool.gif" alt="Cool" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi bu &lt;strong&gt;Cache Provider&lt;/strong&gt; tipini web uygulamamızda nasıl kullanacağımızı belirtmemiz gerekiyor. Bu ama&amp;ccedil;la &lt;strong&gt;Web.config&lt;/strong&gt; dosyası i&amp;ccedil;erisinde aşağıdaki eklemeleri yapmamız yeterli olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;web.config i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0"?&amp;gt;
&amp;lt;configuration&amp;gt;

    &amp;lt;system.web&amp;gt;
        &amp;lt;compilation debug="true" targetFramework="4.0" /&amp;gt;
      &amp;lt;caching&amp;gt;
        &amp;lt;outputCache defaultProvider="AspNetInternalProvider"&amp;gt;
          &amp;lt;providers&amp;gt;
            &amp;lt;add name="DiskBasedCacheProvider" type="CustomCaching.DiskCacheProvider,CustomCaching"/&amp;gt;
          &amp;lt;/providers&amp;gt;
        &amp;lt;/outputCache&amp;gt;
      &amp;lt;/caching&amp;gt;
    &amp;lt;/system.web&amp;gt;
    &amp;lt;system.webServer&amp;gt;
      &amp;lt;modules runAllManagedModulesForAllRequests="true"/&amp;gt;
    &amp;lt;/system.webServer&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;providers&lt;/strong&gt; elementi i&amp;ccedil;erisinde &lt;strong&gt;DiskBasedCacheProvider &lt;/strong&gt;isimli bir bildirim yer almakta ve geliştirdiğimiz &lt;strong&gt;DiskCacheProvider&lt;/strong&gt; tipini işaret etmektedir. Bununla birlikte &lt;strong&gt;outputCache&lt;/strong&gt; elementinin &lt;strong&gt;defaultProvider&lt;/strong&gt; niteliğinde yer alan &lt;strong&gt;AspNetInternalProvider&lt;/strong&gt; değeri, standart &lt;strong&gt;Asp.Net&lt;/strong&gt; &amp;ouml;n bellekleme sisteminin kullanılacağını ifade etmektedir. &amp;Ouml;rneğimize aşağıdaki basit Web User Control' &amp;uuml; ekleyerek devam edebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Web User Control i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Control Language="C#" AutoEventWireup="true" CodeBehind="CurrentDateTime.ascx.cs" Inherits="CustomCaching.CurrentDateTime" %&amp;gt;

&amp;lt;%@ OutputCache Duration="20" VaryByParam="none" ProviderName="DiskBasedCacheProvider" %&amp;gt;
&amp;lt;style type="text/css"&amp;gt;
    .style1
    {
        color: #FFCC00;
    }
&amp;lt;/style&amp;gt;
&amp;lt;div style="background-color:Gray"&amp;gt;
    &amp;lt;strong&amp;gt;&amp;lt;span class="style1"&amp;gt;G&amp;uuml;ncel Zaman :
&amp;lt;/span&amp;gt;
&amp;lt;asp:Label ID="Label1" runat="server" Text="Label" CssClass="style1"&amp;gt;&amp;lt;/asp:Label&amp;gt;
    &amp;lt;/strong&amp;gt;
&amp;lt;/div&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;OutputCache&lt;/strong&gt; direktifi i&amp;ccedil;erisindeki&amp;nbsp;&lt;strong&gt;ProviderName&lt;/strong&gt; niteliği mutlaka dikkatinizi &amp;ccedil;ekmiştir. Burada &lt;strong&gt;DiskBasedCacheProvider&lt;/strong&gt; isimli bir değer kullanılmaktadır. Buda bilindiği &amp;uuml;zere &lt;strong&gt;web.config&lt;/strong&gt; dosyasında yer alan &amp;ouml;zel &lt;strong&gt;Cache&lt;/strong&gt; sağlayıcı tipini işaret etmektedir. Duration değeri &lt;strong&gt;20&lt;/strong&gt; olduğu i&amp;ccedil;in s&amp;ouml;z konusu &lt;strong&gt;Web User Control&lt;/strong&gt; i&amp;ccedil;eriğinin &lt;strong&gt;20&lt;/strong&gt; &lt;strong&gt;saniye&lt;/strong&gt; s&amp;uuml;reyle tutulması s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Web User Control kodu;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace CustomCaching
{
    public partial class CurrentDateTime : System.Web.UI.UserControl
    {
        protected void Page_Load(object sender, EventArgs e)
        {
            Label1.Text = DateTime.Now.ToLongTimeString();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Ve hemen arkasından basit bir Web sayfası...&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Default.aspx i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" AutoEventWireup="true" CodeBehind="Default.aspx.cs" Inherits="CustomCaching.Default" %&amp;gt;

&amp;lt;%@ Register src="CurrentDateTime.ascx" tagname="CurrentDateTime" tagprefix="uc1" %&amp;gt;

&amp;lt;!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"&amp;gt;

&amp;lt;html xmlns="http://www.w3.org/1999/xhtml"&amp;gt;
&amp;lt;head runat="server"&amp;gt;
    &amp;lt;title&amp;gt;&amp;lt;/title&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body&amp;gt;
    &amp;lt;form id="form1" runat="server"&amp;gt;
    &amp;lt;div&amp;gt;
    
        Default Sayfası i&amp;ccedil;in G&amp;uuml;ncel Zaman :
        &amp;lt;asp:Label ID="Label1" runat="server" Text="Label"&amp;gt;&amp;lt;/asp:Label&amp;gt;
    
    &amp;lt;/div&amp;gt;
    &amp;lt;uc1:CurrentDateTime ID="CurrentDateTime1" runat="server" /&amp;gt;
    &amp;lt;p&amp;gt;
        İkinci Web User Control&amp;lt;/p&amp;gt;
    &amp;lt;uc1:CurrentDateTime ID="CurrentDateTime2" runat="server" /&amp;gt;
    &amp;lt;/form&amp;gt;
&amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Default.aspx kodu&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace CustomCaching
{
    public partial class Default : System.Web.UI.Page
    {
        protected void Page_Load(object sender, EventArgs e)
        {
            Label1.Text = DateTime.Now.ToLongTimeString();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Tahmin edileceği &amp;uuml;zere o anki zaman bilgisini hem aspx sayfası hemde &lt;strong&gt;Web User Control&lt;/strong&gt; i&amp;ccedil;erisinden g&amp;ouml;stererek bir karşılaştırma yapmaya &amp;ccedil;alışacağız. &amp;Ouml;yleki; eğer Cache sağlayıcımız devreye girerse, Web User Control i&amp;ccedil;eriği&amp;nbsp;20 saniyeliğine&amp;nbsp;fiziki olarak tutulan bir dosyadan karşılanacak ve bu sebeple sayfanın zaman bilgisi değişirken kendisinin ki sabit olarak kalacak. Tabiki belirtilen &lt;strong&gt;Duration&lt;/strong&gt; s&amp;uuml;resi kadar. Artık testlere başlayabiliriz. Size &amp;ouml;nerim indirdiğiniz &amp;ouml;rneği mutlaka &lt;strong&gt;Debug&lt;/strong&gt; ederek incelemenizdir. &amp;Ouml;zellikle Set ve Get metodları ile Elpased olayında durmanızı tavsiye ederim.&amp;nbsp;Ben ilk olarak aynı web sayfasına iki farklı talep g&amp;ouml;nderip aşağıdaki &amp;ccedil;ıktıları elde ettim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg102_Runtime1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere iki farklı talep g&amp;ouml;nderilmiş ve &amp;ouml;zellikle ikince talepte Web User Control i&amp;ccedil;erisindeki zamanın değişmediği g&amp;ouml;r&amp;uuml;lm&amp;uuml;şt&amp;uuml;r. &amp;Ccedil;&amp;uuml;nk&amp;uuml; bu i&amp;ccedil;erik ilk talep ile birlikte &lt;strong&gt;20&lt;/strong&gt; saniyeliğini fiziki olarak bir dosyaya serileştirilmiş&amp;nbsp;ve bu zaman dilim i&amp;ccedil;erisinde s&amp;uuml;rekli olarak ilgili dosyadan &lt;strong&gt;ters serileşerek(DeSerialization)&lt;/strong&gt; getirilmiş bir &lt;strong&gt;HTML&lt;/strong&gt; &amp;ccedil;ıktısıdır. 20 saniyelik s&amp;uuml;re sona erdikten sonra sayfalarda herhangibir yeni talep oluşturmassak, ilgili fiziki dosyalarında Cache klas&amp;ouml;r&amp;uuml;nden silindiği g&amp;ouml;zlemlenir. Geliştirdiğimiz &amp;ouml;rnekte sadece &lt;strong&gt;Set, Get&lt;/strong&gt; ve &lt;strong&gt;Remove &lt;/strong&gt;metodları işlevsel durumdadır. Yani s&amp;ouml;z konusu vakaya g&amp;ouml;re &lt;strong&gt;Add&lt;/strong&gt; metodu herhangibir sebeple &amp;ccedil;alışmamıştır.&lt;/p&gt;
&lt;p&gt;Hemen bir noktayı aydınlığa kavuşturalım. Geliştirdiğimiz &amp;ouml;rnekte Web User Control' &amp;uuml;n &amp;uuml;retimi &amp;ouml;zel Cache sağlayıcısı i&amp;ccedil;erisindeki serileştirme ve ters serileştirme gibi işlemlerin &amp;ccedil;ıkarttığı maliyetten daha az olabilir. Yani aslında bu &amp;ouml;rneğe g&amp;ouml;re bir Cache sistemi kullanılmasına gerek duyulmaz. Bizim amacımız sadece &amp;ouml;zel bir Cache sağlayıcısının nasıl yazılabileceğini &lt;strong&gt;Asp.Net 4.0 Beta 2&lt;/strong&gt; cephesinden incelemektir. Tabiki genişletilebilir Cache sisteminin daha esnek imkanlar sunacağıda belirtilmektedir. Aslında bu konu ile ilişkili &amp;ouml;zet bir bilgiyi &lt;strong&gt;&lt;a title="Asp.Net 4.0 Overivew" href="http://www.asp.net/LEARN/whitepapers/aspnet4/default.aspx" target="_blank"&gt;asp.net &lt;/a&gt;&lt;/strong&gt;sitesinden indireceğiniz d&amp;ouml;k&amp;uuml;manda bulabilirsiniz. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tabiki buradaki eksikleri ve gereksinimleri en iyi değerlendirecek kişi sevgili arkadaşım &lt;a title="Uğur Umutluoğlu (Asp.Net MVP)" href="http://www.umutluoglu.com/" target="_blank"&gt;Uğur Umutluoğlu' dur(Asp.Net MVP)&lt;/a&gt;. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinze mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f11%2fCustomCaching.rar"&gt;CustomCaching.rar (26,21 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-11-17 06:10:00</pubDate>
  <slug>AspNet-40-Custom-Cache-Provider</slug>
  <tags>
    <tag>aspnet-40</tag>
    <tag>aspnet</tag>
  </tags>
  <categories>
    <category>Asp.Net 4.0 Beta 2</category>
  </categories>
</post>