<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Paralel Programlamada İstisna Yönetimi</title>
  <description>Task örneklerinin kullanıldığı senaryolarda, bloklar içerisinde yer alan işlevselliklerin doğurabileceği çalışma zamanı istisnalarını ele almak, son derece önemlidir. Nitekim paralel çalışmakta olan blokların beklenmedik bir şekilde sonlandırılması söz konusudur. İşte bu yazımızda Task örnekleri içerisinde oluşabilecek istisnaların nasıl ele alınabileceğini incemelye çalışıyor olacağız.</description>
  <content>&lt;p&gt;&lt;a href="/pics/blg208_Giris.jpg"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border: 0px;" title="blg208_Giris" src="/pics/blg208_Giris_thumb.jpg" alt="blg208_Giris" width="304" height="204" align="right" border="0" /&gt;&lt;/a&gt; Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Balık tutmak farklı bir hobidir. &amp;Ouml;zellikle olta ile balık yakalamaktan b&amp;uuml;y&amp;uuml;k keyif alanlar vardır.&lt;em&gt; (Hatta laf aramızda, şirkette yanımda oturan &amp;ccedil;alışma arkadaşımın &amp;ccedil;ekmecesinde, bir olta takımı var) &lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;oğu zaman Hali&amp;ccedil; k&amp;ouml;pr&amp;uuml;s&amp;uuml; gibi alanlarda yandaki resimde olduğu gibi bu işin sevdalılarını g&amp;ouml;rebiliriz. Kimisi sabahın erken saatlerinde gelip, akşamın ge&amp;ccedil; saatlerine kadar burada olta sallar ve &amp;ldquo;Rastgele&amp;rdquo; der.&lt;/p&gt;
&lt;p&gt;Benim ne yazık ki bu tip bir hobim yok. Hatta bu g&amp;uuml;nk&amp;uuml; yazımızda sizlere &lt;strong&gt;balık yakalamayı &lt;/strong&gt;da anlatacak değilim. Onun yerine &lt;strong&gt;Task Parallel Library&lt;/strong&gt; i&amp;ccedil;in &lt;strong&gt;istisna yakalama&lt;/strong&gt; vakaları &amp;uuml;zerinde duracağım.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneklerinin kullanıldığı senaryolarda, bloklar i&amp;ccedil;erisinde yer alan işlevselliklerin doğurabileceği &amp;ccedil;alışma zamanı istisnalarını ele almak, son derece &amp;ouml;nemlidir. Nitekim paralel &amp;ccedil;alışmakta olan blokların beklenmedik bir şekilde sonlandırılması s&amp;ouml;z konusudur. İşte bu yazımızda &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rnekleri i&amp;ccedil;erisinde oluşabilecek istisnaların nasıl ele alınabileceğini incemelye &amp;ccedil;alışıyor olacağız.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Wait, WaitAll, WaitAny Tetikleyicileri&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Bir veya daha fazla &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneği tarafından başlatılan paralel işleyişlerde, bekletme metodlarının &amp;ccedil;ağırılması halinde, ortama fırlayabilecek &lt;strong&gt;Exception&lt;/strong&gt; &amp;ouml;rneklerinin yakalanması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Aşağıdaki kod par&amp;ccedil;asında 3 farklı &lt;strong&gt;Task&lt;/strong&gt; bloğu i&amp;ccedil;in bir istisna senaryosu ele alınmaya &amp;ccedil;alışılmıştır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.IO; 
using System.Linq; 
using System.Threading.Tasks;

namespace HandlingExcpetions 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            Task task1 = new Task(() =&amp;gt; 
                { 
                    File.Open("C:\\OlmayanDosya.txt", FileMode.Open); 
                } 
            ); 
            Task task2 = new Task(() =&amp;gt; 
                { 
                    string number = "oniki"; 
                    double point = Convert.ToDouble(number); 
                } 
            ); 
            Task task3 = new Task(() =&amp;gt; 
                { 
                    for (int i = 0; i &amp;lt; 100; i++) 
                    { 
                        i++; 
                        i--; 
                        i *= 1; 
                        Console.Write("."); 
                    } 
                } 
            );

            task3.Start(); 
            task2.Start(); 
            task1.Start();

            try 
            { 
                Task.WaitAll(task1, task2, task3); 
            } 
            catch (AggregateException agrExcp) 
            { 
                Console.WriteLine("\nOluşan istisnalar"); 
                var excpInfos = from e in agrExcp.InnerExceptions 
                                select new 
                                {                        
                                    e.TargetSite, 
                                    e.Message, 
                                    InnerException=e.InnerException!=null?e.InnerException.Message:"InnerException bilgisi yok" 
                                }; 
                foreach (var excp in excpInfos) 
                { 
                    Console.WriteLine("\n{0}\n{1}\n{2}",excp.Message,excp.InnerException,excp.TargetSite); 
                } 
            } 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnek kod par&amp;ccedil;asında 3 farklı Task &amp;ouml;rneği oluşturulduğu g&amp;ouml;r&amp;uuml;lmektedir. &lt;strong&gt;Task1&lt;/strong&gt; i&amp;ccedil;erisinde sistemde olmadığı d&amp;uuml;ş&amp;uuml;n&amp;uuml;len bir dosya a&amp;ccedil;ılmaya &amp;ccedil;alışılmaktadır. &lt;strong&gt;Task 2&lt;/strong&gt; ile alakalı blok i&amp;ccedil;erisinde ise, metinsel bir ifadenin sayısal d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmesi s&amp;ouml;z konusudur. Task 3 ile ilişkili kod bloğunda ise herhangibir istisna durumu s&amp;ouml;z konusu değildir. &amp;Ouml;rnek uygulamayı &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg208_Runtime1.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg208_Runtime1" src="/pics/blg208_Runtime1_thumb.gif" alt="blg208_Runtime1" width="601" height="172" border="0" /&gt;&lt;/a&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Burada dikkat edilmesi gereken noktalardan birisi, &lt;strong&gt;Task 1&lt;/strong&gt; ve &lt;strong&gt;Task 2&lt;/strong&gt; i&amp;ccedil;erisinde oluşan istisnaların&lt;strong&gt; Task 3&lt;/strong&gt;&amp;rsquo; &amp;uuml;n başlattığı bloğun &amp;ccedil;alışmasını &lt;span style="text-decoration: underline;"&gt;etkilememesidir&lt;/span&gt;. Diğer yandan oluşan istisnaların tamamı, &lt;strong&gt;AggregateException&lt;/strong&gt; tipinin &lt;strong&gt;InnerExceptions&lt;/strong&gt; &amp;ouml;zelliği i&amp;ccedil;erisinde toplanmaktadır.&lt;/p&gt;
&lt;p&gt;Aslında &lt;strong&gt;try&amp;hellip;catch&lt;/strong&gt; bloğu i&amp;ccedil;erisine yer alan &lt;strong&gt;Task.WaitAll&lt;/strong&gt; metodu &amp;ccedil;ağrısı ile, t&amp;uuml;m &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneklerinin işleyişleri bitene kadar, bu işleyişlerin sahibi olan &lt;strong&gt;Main Thread&amp;rsquo;&lt;/strong&gt; in duraksatılması sağlanmaktadır. &lt;strong&gt;WaitAll &lt;/strong&gt;metodunun&lt;strong&gt; try&amp;hellip;catch&lt;/strong&gt; bloğu i&amp;ccedil;erisine olması nedeniyle de, tamamlanması beklenen &lt;strong&gt;Task&lt;/strong&gt; bloklarında oluşan istisnalar, &lt;strong&gt;AggregateException&lt;/strong&gt; tarafından toplanmatadır. Eğer &lt;strong&gt;catch&lt;/strong&gt; bloğu i&amp;ccedil;erisinde &lt;strong&gt;breakpoint&lt;/strong&gt; konularak durulur ve yerel değişkenlere bakılırsa, aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;lar ile karşılaşılır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg208_Debug1.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg208_Debug1" src="/pics/blg208_Debug1_thumb.gif" alt="blg208_Debug1" width="598" height="192" border="0" /&gt;&lt;/a&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Burada dikkat edilmesi gereken en &amp;ouml;nemli noktalardan birisi de, &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneklerinin &lt;strong&gt;Status&lt;/strong&gt; &amp;ouml;zelliklerinin değerleridir. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;task1&lt;/strong&gt; ve &lt;strong&gt;task2&lt;/strong&gt; isimli &amp;ouml;rnekler &lt;strong&gt;Faulted&lt;/strong&gt; durumunda kalmışlardır. Bu değerler, uygulamalarda olup biten herşeyi tutan &lt;strong&gt;log&lt;/strong&gt; mekanizmaları i&amp;ccedil;in veya iş s&amp;uuml;recinin akan diğer kısımları i&amp;ccedil;in &amp;ouml;nemlidir. &amp;Ccedil;ok doğal olarak &lt;strong&gt;task3&lt;/strong&gt; &amp;ouml;rneğinin durumu &lt;strong&gt;RanToCompletion&lt;/strong&gt; olarak kalmıştır. Yani başarılı bir şekilde işleyişini tamamlamıştır. Gelelim diğer bir mevzuya&amp;hellip;&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;AggregateException Nesne &amp;Ouml;rneğine &amp;Uuml;zerinden Handle Metodunun Kullanılması&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;AggregateException&lt;/strong&gt; nesne &amp;ouml;rneği &amp;uuml;zerinden erişilebilen &lt;strong&gt;Handle&lt;/strong&gt; metodu ile, &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneklerine ait bloklar i&amp;ccedil;erisinde oluşacak istisnalar arasında dolaşılabilmektedir. &amp;Ouml;zellikle&lt;strong&gt; n&lt;/strong&gt; sayıda &lt;strong&gt;Task&lt;/strong&gt; bloğunun takip edildiği durumlarda, beklenen bir istisnanın oluşması halinde nasıl hareket edileceğine karar vermek i&amp;ccedil;in kullanılabilecek yollardan birisidir.&lt;/p&gt;
&lt;p&gt;Bu metod parametre olarak&lt;strong&gt; Func&amp;lt;Exception,bool&amp;gt;&lt;/strong&gt; tipinden bir &lt;strong&gt;Temsilci(Delegate) &lt;/strong&gt;almaktadır. Buna g&amp;ouml;re hangi istisnanın ele alınmak istediği ilk parametre ile belirtilmektedir. Diğer yandan s&amp;ouml;z konusu temsilci geriye &lt;strong&gt;bool&lt;/strong&gt; değer d&amp;ouml;nd&amp;uuml;recek şekilde ayarlanmıştır. Bu değer spesifik olarak belirlenen istisnanın/istisnaların ele alınması halinde true olmalıdır. Handle kullanımını daha iyi kavrayabilmek adına aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.IO; 
using System.Linq; 
using System.Threading.Tasks;

namespace HandlingExcpetions 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            Task task1 = new Task(() =&amp;gt; 
            { 
                File.Open("C:\\OlmayanDosya.txt", FileMode.Open); 
            } 
            ); 
            Task task2 = new Task(() =&amp;gt; 
            { 
                string number = "oniki"; 
                double point = Convert.ToDouble(number); 
            } 
            ); 
            Task task3 = new Task(() =&amp;gt; 
            { 
                for (int i = 0; i &amp;lt; 100; i++) 
                { 
                    i++; 
                    i--; 
                    i *= 1; 
                    Console.Write("."); 
                } 
            } 
            );

            task3.Start(); 
            task2.Start(); 
            task1.Start();

            try 
            { 
                Task.WaitAll(task1, task2, task3); 
            } 
            catch (AggregateException agrExcp) 
            { 
                agrExcp.Handle(e =&amp;gt; 
                    { 
                        if (e is FileNotFoundException) 
                        { 
                            Console.WriteLine("Dosya bulunamadı"); 
                            return true; 
                        } 
                        else if (e is FormatException) 
                        { 
                            Console.WriteLine("D&amp;ouml;n&amp;uuml;şt&amp;uuml;rme hatası"); 
                            return true; 
                        } 
                        else 
                           return false; 
                    } 
                ); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Bir &amp;ouml;nceki &amp;ouml;rnekte yer alan senaryonun aynısı s&amp;ouml;z konusudur. Ancak bu kez &lt;strong&gt;catch&lt;/strong&gt; bloğu i&amp;ccedil;erisinde &lt;strong&gt;Handle&lt;/strong&gt; metodu kullanılmıştır. &lt;strong&gt;Handle&lt;/strong&gt; ile işaret edilen blokta, e ile temsil edilen referansın olası değerleri kontrol edilmektedir. &lt;strong&gt;FileNotFoundException&lt;/strong&gt; veya &lt;strong&gt;FormatException&lt;/strong&gt; olması halleri ele alınmıştır. &lt;strong&gt;true&lt;/strong&gt; d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z yerlerde, oluşan &lt;strong&gt;istisnai&lt;/strong&gt; durumların geliştirici tarafından ele alındığını ifade edilmektedir. Program kodunun &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg208_Runtime2.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg208_Runtime2" src="/pics/blg208_Runtime2_thumb.gif" alt="blg208_Runtime2" width="601" height="89" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Tabi burada dikkat edilmesi gereken ayrı bir durum daha vardır. Olaya&lt;strong&gt; 4nc&amp;uuml;&lt;/strong&gt; bir &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneğini daha kattığımızı d&amp;uuml;ş&amp;uuml;nelim ve kodumuzu buna g&amp;ouml;re aşağıdaki gibi d&amp;uuml;zenleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.IO; 
using System.Linq; 
using System.Threading.Tasks; 
using System.Data.SqlClient;

namespace HandlingExcpetions 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            Task task1 = new Task(() =&amp;gt; 
            { 
                File.Open("C:\\OlmayanDosya.txt", FileMode.Open); 
            } 
            ); 
            Task task2 = new Task(() =&amp;gt; 
            { 
                string number = "oniki"; 
                double point = Convert.ToDouble(number); 
            } 
            ); 
            Task task3 = new Task(() =&amp;gt; 
            { 
                for (int i = 0; i &amp;lt; 100; i++) 
                { 
                    i++; 
                    i--; 
                    i *= 1; 
                    Console.Write("."); 
                } 
            } 
            ); 
            Task task4 = new Task(() =&amp;gt; 
                { 
                    SqlConnection conn = new SqlConnection("data source=.;database=Maybe;integrated security=sspi"); 
                    conn.Open(); 
                } 
            );

            task3.Start(); 
            task2.Start(); 
            task1.Start(); 
            task4.Start();

            try 
            { 
                Task.WaitAll(task1, task2, task3,task4); 
            } 
            catch (AggregateException agrExcp) 
            { 
                agrExcp.Handle(e =&amp;gt; 
                    { 
                        if (e is FileNotFoundException) 
                        { 
                            Console.WriteLine("Dosya bulunamadı"); 
                            return true; 
                        } 
                        else if (e is FormatException) 
                        { 
                            Console.WriteLine("D&amp;ouml;n&amp;uuml;şt&amp;uuml;rme hatası"); 
                            return true; 
                        } 
                        else 
                            return false; 
                    } 
                ); 
            } 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rneği &amp;ccedil;alıştırdığımızda aşağıdaki gibi bir sonu&amp;ccedil;la karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg208_Exception.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg208_Exception" src="/pics/blg208_Exception_thumb.gif" alt="blg208_Exception" width="601" height="160" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere uygulama istem dışı bir şekilde sonlanmıştır. &lt;strong&gt;Task 4&lt;/strong&gt; nesne &amp;ouml;rneğine ait kod bloğunda, var olmayan bir veritabanına doğru bağlantı oluşturulmaya &amp;ccedil;alışılmaktadır. Bunun doğal sonucu bir &lt;strong&gt;SqlException&lt;/strong&gt; &amp;ouml;rneğidir. Ancak &lt;strong&gt;catch&lt;/strong&gt; bloğu i&amp;ccedil;erisinde kullandığımız &lt;strong&gt;Handle&lt;/strong&gt; metodunda s&amp;ouml;z konusu istisna ele alınmadığı i&amp;ccedil;in kod doğrudan &lt;strong&gt;else&lt;/strong&gt; bloğuna girmiştir. Bir başka deyişle ele alınmamış bir istisna s&amp;ouml;z konusudur. &amp;Ouml;zellike &lt;strong&gt;Handle&lt;/strong&gt; metodunda bu duruma dikkat edilmesi gerekir.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;IsFaulted &amp;Ouml;zelliğine Bakmak&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Bazı durumlarda istisnaların &lt;strong&gt;catch&lt;/strong&gt; bloğu i&amp;ccedil;erisinde, &lt;strong&gt;AggregateException&lt;/strong&gt; &amp;uuml;zerinden ele alınması yerine, &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneklerine ait &lt;strong&gt;IsFaulted&lt;/strong&gt; &amp;ouml;zelliklerine bakılaraktan da ilerlenebilir. &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rnekleri &amp;uuml;zerinden erişilebilen &lt;strong&gt;IsFaulted&lt;/strong&gt;, &lt;strong&gt;IsCompleted&lt;/strong&gt;, &lt;strong&gt;IsCanceled&lt;/strong&gt; gibi &amp;ouml;zellikler sayesinde, Task&amp;rsquo; in &amp;ccedil;alışma sonucu ile ilişkili bilgiler yakalanabilmektedir. IsFaulted &amp;ouml;zelliği de istisna senaryolarında değerlendirilebilir. Aşağıdaki kod par&amp;ccedil;asında bu durum ele alınmaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.IO; 
using System.Linq; 
using System.Threading.Tasks; 
using System.Data.SqlClient;

namespace HandlingExcpetions 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            Task[] tasks={ 
            new Task(() =&amp;gt; 
            { 
                File.Open("C:\\OlmayanDosya.txt", FileMode.Open); 
            } 
            ), 
           new Task(() =&amp;gt; 
            { 
                string number = "oniki"; 
                double point = Convert.ToDouble(number); 
            } 
            ), 
            new Task(() =&amp;gt; 
            { 
                for (int i = 0; i &amp;lt; 100; i++) 
                { 
                    i++; 
                    i--; 
                    i *= 1; 
                    Console.Write("."); 
                } 
            } 
            ) 
            };

            foreach (Task t in tasks) 
            { 
                t.Start(); 
            }

            try 
            { 
                Task.WaitAll(tasks); 
            } 
            catch (AggregateException agrExcp) 
            { 
            }

           foreach (Task t in tasks) 
            { 
                Console.WriteLine("\nTask Id : {0} IsFaulted : {1} IsCompleted : {2} IsCanceled : {3}",t.Id,t.IsFaulted,t.IsCompleted,t.IsCanceled); 
                if (t.IsFaulted) 
                { 
                    foreach (Exception excp in t.Exception.InnerExceptions) 
                    { 
                        Console.WriteLine("{0}",excp.Message); 
                    } 
                } 
            } 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Aynı senaryoyu bu kez &lt;strong&gt;Task&lt;/strong&gt; tipinden &amp;ouml;rneklerden oluşan bir &lt;strong&gt;Array&lt;/strong&gt; &amp;uuml;zerinde ele almaktayız. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneklerinin her birinin &lt;strong&gt;IsFaulted&lt;/strong&gt; &amp;ouml;zelliği kontrol edilmekte ve eğer &lt;strong&gt;true&lt;/strong&gt; ise &lt;strong&gt;InnerExceptions&lt;/strong&gt; &amp;ouml;zelliği ile belirtilen koleksiyona gidilerek, oluşan istisnai durumlara ait mesaj bilgilendirmeleri yapılmaktadır. &amp;Ouml;rnekte &lt;strong&gt;catch&lt;/strong&gt; bloğunda herhangibir işlem yapılmadığına dikkat edilmelidir. Uygulamayı &amp;ccedil;alıştırdığımızda aşağıdaki sonu&amp;ccedil;lar ile karşılaştığımızı g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg208_Runtime3.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg208_Runtime3" src="/pics/blg208_Runtime3_thumb.gif" alt="blg208_Runtime3" width="498" height="148" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Escalation Policy&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Peki ya &lt;strong&gt;trigger&lt;/strong&gt; g&amp;ouml;revini &amp;uuml;stlenen &lt;strong&gt;Wait&lt;/strong&gt;&amp;hellip; metodlarından herhangibirini kullanmadığımızda ne olur?&lt;/p&gt;
&lt;p&gt;Her ne kadar &lt;strong&gt;CLR&lt;/strong&gt; ortamı, fırlatılan istisnaları yakalıyor olsa da, &lt;strong&gt;trigger&lt;/strong&gt; metodlarının kullanılmadığı durumlarda bunun ne zaman olacağı kestirilemeyebilir.&amp;nbsp; Dahası Wait metodlarının &lt;span style="text-decoration: underline;"&gt;kullanılmak istenmediği&lt;/span&gt; durumlarda olabilir. İşte bu durumda &lt;strong&gt;TaskScheduler&lt;/strong&gt; tipinin &lt;strong&gt;UnobservedTaskException&lt;/strong&gt; olay metodunu kullanarak, s&amp;ouml;z konusu durumlar i&amp;ccedil;in devreye giren standart &lt;strong&gt;ilke(Policy) &lt;/strong&gt;değiştirilebilir. Bir başka deyişle &lt;strong&gt;Exception&lt;/strong&gt; yakalanma işleminde kendi yazdığımız olay metodunun devreye girmesini sağlayabiliriz. Ancak bu konuyu işleyebilmemiz i&amp;ccedil;in &amp;ouml;ncelikle &lt;strong&gt;TaskScheduler &lt;/strong&gt;kavramını &amp;ouml;ğrenmemiz, kavramımız gerekmektedir. Bu konuyu ilerleyen yazılarımızda&amp;nbsp; irdelemeye &amp;ccedil;alışıyor olacağız.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Elimizde Olta da, Misina da, Kurşun da Yok&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Son olarak hi&amp;ccedil; bir &lt;strong&gt;Exception&lt;/strong&gt; kontrol&amp;uuml; yapmadığımızda ne olduğuna bir bakalım. Bu ama&amp;ccedil;la aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.IO; 
using System.Linq; 
using System.Threading.Tasks; 
using System.Data.SqlClient;

namespace HandlingExcpetions 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            Task[] tasks ={ 
             new Task(() =&amp;gt; 
             { 
                 File.Open("C:\\OlmayanDosya.txt", FileMode.Open); 
             } 
             ), 
            new Task(() =&amp;gt; 
             { 
                 string number = "oniki"; 
                 double point = Convert.ToDouble(number); 
             } 
             ), 
             new Task(() =&amp;gt; 
             { 
                 for (int i = 0; i &amp;lt; 100; i++) 
                 { 
                     i++; 
                     i--; 
                     i *= 1; 
                     Console.Write("."); 
                 } 
             } 
             ) 
             };

            foreach (Task t in tasks) 
            { 
                t.Start(); 
            } 
            Task.WaitAll(tasks);

            Console.WriteLine("Program sonu"); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Burada herhangibir &lt;strong&gt;try&amp;hellip;catch&lt;/strong&gt; bloğu kullanılmamıştır. Ancak senaryomuza g&amp;ouml;re &lt;strong&gt;Task&amp;rsquo;&lt;/strong&gt; lerden ortama fırlayan iki &lt;strong&gt;Exception&lt;/strong&gt; s&amp;ouml;z konusudur. &amp;Ccedil;alışma zamanına baktığımızda ise sadece bir tanesinin &lt;strong&gt;CLR(Common Language Runtime)&lt;/strong&gt; tarafından yakalandığını ve uygulamanın da istem dışı sonlandırıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. &amp;Uuml;stelik sadece bir &lt;strong&gt;Exception&lt;/strong&gt; mesajı yakalanmış ve uygulamanın son satırı bile &amp;ccedil;alıştırılmamıştır. A&amp;ccedil;ık&amp;ccedil;ası uygulamanın bu şekilde istem dışı sonlanması zaten &lt;strong&gt;CLR&amp;rsquo;&lt;/strong&gt; dan beklenen bir davranıştır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg208_Exception2.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg208_Exception2" src="/pics/blg208_Exception2_thumb.gif" alt="blg208_Exception2" width="601" height="256" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/Exclamation_2.gif"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border-width: 0px;" title="Exclamation" src="/pics/Exclamation_thumb_2.gif" alt="Exclamation" width="48" height="48" align="left" border="0" /&gt;&lt;/a&gt; Yapılan &amp;ouml;rneklerde g&amp;ouml;zden ka&amp;ccedil;ırılmaması gereken bir husus daha vardır. &lt;strong&gt;Task&lt;/strong&gt; bloklarında &lt;strong&gt;Exception&lt;/strong&gt; oluşan noktalarda, kod bir sonraki satıra ge&amp;ccedil;meyecektir. Dolayısıyla, ardışıl olarak oluşan istisna durumları olsa bile, aynı &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneği i&amp;ccedil;in sadece ilk &lt;strong&gt;Exception&lt;/strong&gt; i&amp;ccedil;eriğinin yakalanması s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Bu yazımızda &lt;strong&gt;Task Parallel Library&lt;/strong&gt; i&amp;ccedil;in &lt;strong&gt;Exception&lt;/strong&gt; kontrol senaryolarını incelemeye &amp;ccedil;alıştık. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&lt;a href="/pics/2010%2f6%2fHandlingExcpetions.rar"&gt;HandlingExcpetions.rar (22,91 kb)&lt;/a&gt;&amp;nbsp;[&amp;Ouml;rnek Visual Studio 2010 Ultimate S&amp;uuml;r&amp;uuml;m&amp;uuml;nde Geliştirilmiş ve Test Edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2011-01-13 13:30:00</pubDate>
  <slug>Paralel-Programlamada-Istisna-Yonetimi</slug>
  <tags>
    <tag>parallel-programming</tag>
    <tag>tpl</tag>
    <tag>task-parallel-library</tag>
    <tag>exception-handling</tag>
    <tag>c#-40</tag>
    <tag>visual-studio-2010-ultimate</tag>
  </tags>
  <categories>
    <category>Parallel Programming</category>
  </categories>
</post>