<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>RSS, Atom Formatlı İçerik Paylaşımı(Syndication)</title>
  <description>Windows Communication Foundation, Net Framework 3.5 ile gelen bazı yeni CLR(Common Language Runtime) tipleri sayesinde RSS 2.0 ve Atom 1.0 formatlarında yada diğer özel formatlarda içerik paylaşımı(Syndication) yapılmasına izin veren özelliklere sahip olmuştur. Bu tipler sayesinde bir WCF servisi(Service) üzerinden özellikle HTTP protokolünün GET, POST, HEAD ve benzeri metodlarına göre talep-cevap(Request-Response) işlemleri gerçekleştirilebilmektedir. Bir başka deyişle EndPoint noktaları üzerinden farklı tipte verilerin, dünya standartlarına uygun olacak şekilde yayınlanması mümkündür. İşte bu makalemizde bir WCF servisi üzerinden en basit haliyle RSS veya Atom formatında içerik paylaşımlarının nasıl yapılabileceğini incelemeye çalışacağız.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Windows Communication Foundation&lt;/strong&gt;, &lt;strong&gt;Net Framework 3.5&lt;/strong&gt; ile gelen bazı yeni &lt;strong&gt;CLR(Common Language Runtime)&lt;/strong&gt; tipleri sayesinde &lt;strong&gt;RSS 2.0&lt;/strong&gt; ve &lt;strong&gt;Atom 1.0 &lt;/strong&gt;formatlarında yada diğer &amp;ouml;zel formatlarda &lt;strong&gt;i&amp;ccedil;erik paylaşımı(Syndication) &lt;/strong&gt;yapılmasına izin veren &amp;ouml;zelliklere sahip olmuştur. Bu tipler sayesinde bir WCF servisi(Service) &amp;uuml;zerinden &amp;ouml;zellikle &lt;strong&gt;HTTP&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml;n &lt;strong&gt;GET&lt;/strong&gt;, &lt;strong&gt;POST&lt;/strong&gt;, &lt;strong&gt;HEAD&lt;/strong&gt; ve benzeri metodlarına g&amp;ouml;re &lt;strong&gt;talep-cevap(Request-Response)&lt;/strong&gt; işlemleri ger&amp;ccedil;ekleştirilebilmektedir. Bir başka deyişle &lt;strong&gt;EndPoint&lt;/strong&gt; noktaları &amp;uuml;zerinden farklı tipte verilerin, d&amp;uuml;nya standartlarına uygun olacak şekilde yayınlanması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. İşte bu makalemizde bir &lt;strong&gt;WCF&lt;/strong&gt; servisi &amp;uuml;zerinden en basit haliyle &lt;strong&gt;RSS&lt;/strong&gt; veya &lt;strong&gt;Atom&lt;/strong&gt; formatında i&amp;ccedil;erik paylaşımlarının nasıl yapılabileceğini incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;RSS&lt;/strong&gt; veya &lt;strong&gt;Atom&lt;/strong&gt; gibi formatların ortak noktası &lt;strong&gt;platform bağımsız(Interoperability)&lt;/strong&gt; veri i&amp;ccedil;erikleri sunulabilmesi i&amp;ccedil;in gerekli standartları i&amp;ccedil;eriyor olmalarıdır. Bu sayede yayınlanan veriyi alacak olan istemcilerin(Clients) farklı &amp;ouml;zelliklerinin d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmesine gerek kalmamaktadır. Burada s&amp;ouml;z konusu olan platform bağımsız yayınlanabilen veriler genellikle &lt;strong&gt;Feed&lt;/strong&gt; olarak adlandırılırlar. Feed yapısı kendi i&amp;ccedil;erisinde, i&amp;ccedil;erik yayınlaması ile ilgili olaraktan &lt;strong&gt;yazar(author), başlık(title), adres(url)&lt;/strong&gt; ve bunlar ile ilişkili olan &lt;strong&gt;metadata&lt;/strong&gt; bilgilerini barındırır. Ayrıca kendi i&amp;ccedil;erisinde birden fazla &lt;strong&gt;&amp;ouml;ğe(Item)&lt;/strong&gt; barındırabilir. Bu &amp;ouml;ğelerin her biride kendi i&amp;ccedil;erisinde &lt;strong&gt;başlık(title), adres(url), oluşturulma tarihi(creation date), a&amp;ccedil;ıklama(description), kategori(category)&lt;/strong&gt; gibi bilgileri barındırmaktadır. Bu i&amp;ccedil;eriklerin şu anda pop&amp;uuml;ler olan iki farklı sunuş şekli &lt;strong&gt;RSS(Really Simple Syndication)&lt;/strong&gt; ve &lt;strong&gt;Atom&lt;/strong&gt; teknikleridir. Her ikiside &lt;strong&gt;XML(eXtensible Markup Languge)&lt;/strong&gt; tabanlı olacak şekilde i&amp;ccedil;erik paylaşımı standartları sunarlar.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;RSS/Atom gibi i&amp;ccedil;erik yayınlama formatlarının ortak &amp;ouml;zellikleri, platform bağımsız bir i&amp;ccedil;erik i&amp;ccedil;in gerekli olan metadata standartlarını sağlıyor olmalarıdır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;S&amp;ouml;z konusu formatların her ikisde &lt;strong&gt;Windows Communication Foundation&lt;/strong&gt; tarafından desteklenmektedir. WCF, s&amp;ouml;z konusu &lt;strong&gt;Feed&lt;/strong&gt; ve &lt;strong&gt;Feed Item&lt;/strong&gt;' lar ile &amp;ccedil;alışılabilmesini kolaylaştırmak adına &lt;strong&gt;SyndicationFeed&lt;/strong&gt;, &lt;strong&gt;SyndicationItem&lt;/strong&gt;, &lt;strong&gt;SyndicationLink&lt;/strong&gt;, &lt;strong&gt;SyndicationPerson&lt;/strong&gt; gibi pek &amp;ccedil;ok &lt;strong&gt;CLR&lt;/strong&gt; tipi i&amp;ccedil;ermektedir. Tahmin edileceği &amp;uuml;zere bu tiplerin isimlendirilmeleri, i&amp;ccedil;erik paylaşım formatlarında kullanılan element adları ile benzerdir. Ancak en &amp;ouml;nemli avantaj, &lt;strong&gt;RSS&lt;/strong&gt; yada &lt;strong&gt;Atom&lt;/strong&gt; gibi formatlara &lt;strong&gt;y&amp;ouml;netimli kod tarafından(Managed Code)&lt;/strong&gt; doğrudan destek veriliyor olmasıdır. Şu anda WCF i&amp;ccedil;erisinde farklı i&amp;ccedil;erik paylaşımı formatlarına destek verebilmek amacıyla &lt;strong&gt;Atom10FeedFormatter&lt;/strong&gt;, &lt;strong&gt;RSS20FeedFormatter&lt;/strong&gt; vb tipler yer almaktadır.&lt;/p&gt;
&lt;p&gt;Peki s&amp;ouml;z konusu &lt;strong&gt;RSS&lt;/strong&gt; veya &lt;strong&gt;Atom&lt;/strong&gt; formatlı i&amp;ccedil;erikler hangi ama&amp;ccedil;larla kullanılmaktadırlar? S&amp;ouml;z gelimi haber sitelerinin hemen hepsi g&amp;uuml;ncel başlıkları ortak bir standartta yayınlayabilmek i&amp;ccedil;in &lt;strong&gt;XML&lt;/strong&gt; tabanlı olan &lt;strong&gt;RSS&lt;/strong&gt; veya &lt;strong&gt;Atom&lt;/strong&gt; formatlı i&amp;ccedil;erikler sunarlar. Aynı sistem blog siteleri i&amp;ccedil;inde ge&amp;ccedil;erlidir. Pek &amp;ccedil;ok blog sitesinde en g&amp;uuml;ncel &lt;strong&gt;girişler(Entry) RSS &lt;/strong&gt;veya &lt;strong&gt;Atom&lt;/strong&gt; formatında(yada iki formatta birden olacak şekilde) yayınlanmaktadır. Elbetteki bu yayınlanan i&amp;ccedil;erikler &lt;strong&gt;XML&lt;/strong&gt; formatlı olduğundan, başka sistemler tarafından alınıp yorumlanabilirler. S&amp;ouml;z gelimi haber başlıkları yada blog girişleri yada bir topluluk sitesinde yayınlanan son makalelerin listesi &lt;strong&gt;XML&lt;/strong&gt; i&amp;ccedil;eriklerinden alınıp işlenebilirler. İşlenen bu veriler uygulama bağımsız olacak şekilde değişik kontroller ile son kullanıcılara sunulabilirler.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin farklı haber sitelerinin &lt;strong&gt;RSS/Atom&lt;/strong&gt; i&amp;ccedil;eriklerini kullanarak istemcilere birer &amp;ouml;zet şeklinde sunan intranet tabanlı web siteleri son derece yaygındır. Bu tip bir sistemde istemciler doğrudan internete &amp;ccedil;ıkamasalarda, &lt;strong&gt;intranet&lt;/strong&gt; &amp;uuml;zerinde erişebildikleri ortak bir &lt;strong&gt;portal&lt;/strong&gt; &amp;uuml;zerinden &amp;ccedil;eşitli haber sitelerinin g&amp;uuml;ncel konu başlıklarına bakabilir ve bilgi alabilirler. Tabiki burada bahsetmiş olduğumuz senaryolar en yaygın kullanılanlarıdır. &lt;strong&gt;Geliştirici(Developer)&lt;/strong&gt; olarak baktığımızda paylaşılabilen herhangibir veri topluluğunu &lt;strong&gt;RSS/Atom&lt;/strong&gt; formatlarında yayınlayabileceğimiz sonucu ortaya &amp;ccedil;ıkmaktadır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;RSS/Atom gibi formatlarda sunulan i&amp;ccedil;erikler standartlaştırılmış XML verileridir. Bu veriler versiyonlara g&amp;ouml;re farklılık g&amp;ouml;sterebilir. Ancak her haldede, XML i&amp;ccedil;eriklerinin ayrıştırılıp(Parse) kullanılması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. .Net i&amp;ccedil;erisinde ezelden beri gelen XML tipleri ile bu işlemler ger&amp;ccedil;ekleştirilebilir. Ancak WCF a&amp;ccedil;ısından olaya bakıldığında g&amp;ouml;ze &amp;ccedil;arpan noktalar şunlardır;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;RSS veya Atom formatlı verilerin y&amp;ouml;netimli kod(Managed Code) tarafında kolayca ele alınmasını sağlayan tipler .Net Framework 3.5 i&amp;ccedil;erisinde gelmektedir. B&amp;ouml;ylece RSS veya Atom formatlı i&amp;ccedil;eriklerin oluşturulması veya okunması(ayrıştırılması) dahada kolaylaşmaktadır.&lt;/li&gt;
&lt;li&gt;WCF, .Net 3.5 i&amp;ccedil;erisinde gelen destekler ile HTTP Get gibi bir metod yardımıyla EndPoint' ler &amp;uuml;zerinde RSS/Atom desteği verebilecek şekilde kullanılabilmektedir.&lt;/li&gt;
&lt;/ul&gt;
&lt;/blockquote&gt;
&lt;p&gt;S&amp;ouml;z gelimi bir veri y&amp;ouml;netim sistemi &amp;uuml;zerinde &amp;ccedil;alışan bir &lt;strong&gt;WCF&lt;/strong&gt; servisi, log bilgilerini yetkili kişilere &lt;strong&gt;RSS/Atom&lt;/strong&gt; formatında sunacak şekilde &lt;strong&gt;URL&lt;/strong&gt; desteği verebilir. Burada URL desteğinden kasıt &lt;strong&gt; http://localhost:5001/VeriYonetimSistemi/LogServisi?kullaniciId=5&lt;/strong&gt; gibi bir adrestir. Dikkat edilecek olursa URL &amp;uuml;zerinden yapılacak olan bu&lt;strong&gt; talep(request)&lt;/strong&gt; sonrasında, WCF servisi &lt;strong&gt;kullanıcıID&lt;/strong&gt; değeri &lt;strong&gt;5&lt;/strong&gt; olan kişiyi bulup, log bilgilerini &lt;strong&gt;RSS/Atom &lt;/strong&gt;formatında hazırlayarak email olarak g&amp;ouml;nderebilir. Hemen bu noktada aşağıdaki şekil ile olayı daha net kavrayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk241_1.gif" alt="" width="505" height="296" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekilden de anlaşılacağı &amp;uuml;zere servisin &lt;strong&gt;HTTP&lt;/strong&gt; &lt;strong&gt;Get&lt;/strong&gt; metoduna g&amp;ouml;re &lt;strong&gt;RSS/Atom&lt;/strong&gt; desteği bulunmaktadır. Bu sistemin ger&amp;ccedil;ekleştirilebilmesi i&amp;ccedil;in &lt;strong&gt;.Net Framework 3.5&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt;WebHttpBinding&lt;/strong&gt; ve &lt;strong&gt;WebHttpBehavior&lt;/strong&gt; isimli yeni tipler yer almaktadır. Tahmin edileceği &amp;uuml;zere &lt;strong&gt;WebHttpBinding&lt;/strong&gt; yeni &lt;strong&gt;bağlayıcı tiplerdendir(Binding Type)&lt;/strong&gt; ve &lt;strong&gt;HTTP&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml;n &lt;strong&gt;Get&lt;/strong&gt; gibi metodlarına &lt;strong&gt;EndPoint&lt;/strong&gt; &amp;uuml;zerinden destek verilmesini sağlamak amacıyla geliştirilmiştir. Burada &amp;ouml;nemli olan noktalardan biriside servisin &lt;strong&gt;RSS&lt;/strong&gt; yada &lt;strong&gt;Atom&lt;/strong&gt; formatında veri i&amp;ccedil;eriklerini nasıl hazırlayacağıdır. Yine daha &amp;ouml;ncedende belirtildiği gibi bu aslında &lt;strong&gt;XML&lt;/strong&gt; formatlı bir metin i&amp;ccedil;eriğinin hazırlanmasından başka bir şey değildir. Ne varki&lt;strong&gt; .Net Framework 3.5&lt;/strong&gt; i&amp;ccedil;erisinde gelen yardımcı tipler sayesinde bu işlemlerin &lt;strong&gt;y&amp;ouml;netimli kod(Managed Code) &lt;/strong&gt;tarafında yapılması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bu ama&amp;ccedil;la &lt;strong&gt;SyndicationFeedFormatter&lt;/strong&gt; ve &lt;strong&gt;SyndicationItemFormatter&lt;/strong&gt; &lt;strong&gt;abstract&lt;/strong&gt; tiplerinden t&amp;uuml;remiş olan &amp;ccedil;eşitli sınıflar bulunmaktadır. Aşağıdaki sınıf diagramlarında temel olarak kullanılabilecek formatlama tipleri g&amp;ouml;sterilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Feed formatlama i&amp;ccedil;in kullanılan tipler;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk241_2.gif" alt="" width="556" height="436" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;Atom 1.0&lt;/strong&gt; ve &lt;strong&gt;RSS 2.0&lt;/strong&gt; tarzındaki &lt;strong&gt;Feed&lt;/strong&gt; formatları i&amp;ccedil;in ikişer tip yer almaktadır. S&amp;ouml;z konusu sınıfların &lt;strong&gt;generic&lt;/strong&gt; versiyonları olduğunada dikkat edelim.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Item formatlama i&amp;ccedil;in kullanılan tipler;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk241_3.gif" alt="" width="548" height="449" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;Atom 1.0 &lt;/strong&gt;ve &lt;strong&gt;RSS 2.0&lt;/strong&gt; standartlarına uygun olacak şekilde &lt;strong&gt;Item&lt;/strong&gt; formatlaması i&amp;ccedil;in kullanılan ikişer farklı tip vardır. Bu tiplerden hepsi &lt;strong&gt;SyndicationItemFormatter&lt;/strong&gt; &lt;strong&gt;abstract&lt;/strong&gt; sınıfından t&amp;uuml;remekte ve &lt;strong&gt;XML&lt;/strong&gt; serileştirmesi i&amp;ccedil;in gerekli &lt;strong&gt;IXmlSerializable&lt;/strong&gt; &lt;strong&gt;aray&amp;uuml;z&amp;uuml;n&amp;uuml;(Interface)&lt;/strong&gt; uygulamaktadır.Bu bilgiler ışığında kendi formatlama modellerimizide geliştirebileceğimizi s&amp;ouml;yleyebiliriz. Bu tarz bir işlem i&amp;ccedil;in &lt;strong&gt;Feed&lt;/strong&gt; veya &lt;strong&gt;Item&lt;/strong&gt; formatlamasının farklı bir versiyonunu yazmak istiyorsak &lt;strong&gt;SyndicationItemFormatter&lt;/strong&gt;, &lt;strong&gt;SyndicationFeedFormatter&lt;/strong&gt; &lt;strong&gt;abstract&lt;/strong&gt; sınıfları ile &lt;strong&gt;IXmlSerializable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almamız yeterlidir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;.Net 3.5 &lt;/strong&gt;i&amp;ccedil;erisindeki nesne modeline bakıldığında &lt;strong&gt;SyndicationFeed&lt;/strong&gt;, &lt;strong&gt;SyndicationItem&lt;/strong&gt;, &lt;strong&gt;SyndicationCategory&lt;/strong&gt;, &lt;strong&gt;SyndicationPerson&lt;/strong&gt;, &lt;strong&gt;SyndicationContent&lt;/strong&gt; gibi pek &amp;ccedil;ok &lt;strong&gt;CLR tipinin(Common Language Runtime Type)&lt;/strong&gt; yer aldığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r. Bu tiplerden belkide en &amp;ccedil;ok kullanılanları &lt;strong&gt;SyndicationFeed&lt;/strong&gt; ve &lt;strong&gt;SyndicationItem&lt;/strong&gt; sınıflarıdır. S&amp;ouml;z konusu sınıflar &lt;strong&gt;System.ServiceModel.Web.dll assembly&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &lt;strong&gt;System.ServiceModel.Syndication isim alanında(Namespace)&lt;/strong&gt; bulunmaktadır.&lt;/p&gt;
&lt;p&gt;Bu kadar teorik bilgiden sonra bir ka&amp;ccedil; &amp;ouml;rnek ile konuyu genişletmeye &amp;ccedil;alışalım. İlk olarak basit bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması geliştirecek ve &lt;strong&gt;RSS 2.0/ Atom 1.0&lt;/strong&gt; formatlarında i&amp;ccedil;eriklerin nasıl hazırlanabileceğini incelemeye &amp;ccedil;alışacağız. Bu ama&amp;ccedil;la &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt; .Net 3.5&lt;/strong&gt; modeline uygun olacak şekilde bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması a&amp;ccedil;mamız ve &lt;strong&gt;System.ServiceModel.Web.dll&lt;/strong&gt;' ini projeye referans etmemiz yeterlidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk241_4.gif" alt="" width="248" height="242" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından kodları aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel.Syndication;
using System.Collections.ObjectModel;
using System.Xml;

namespace SyndicationFormatlama
{
    class Program
    {
        static void Main(string[] args)
        {
            // Bir Feed oluşturulur. Parametreler title, description ve Uri bilgileridir.
            SyndicationFeed feed=new SyndicationFeed("Makaleler","Burak Senyurt .Net Makaleleri",new Uri("http://www.bsenyurt.com"));
            // Feed yazarı tanımlanır. Yazarlar SyndicationPerson tipi ile temsil edilebilirler.
            feed.Authors.Add(new SyndicationPerson("selim(at)buraksenyurt.com"));
            // Feed i&amp;ccedil;in bir kategori tanımalası yapılır. Bu kategori tanımlaması SyndicationCategory tipi ile temsil edilebilir.
            feed.Categories.Add(new SyndicationCategory(".Net Teknolojileri"));
            // Feed i&amp;ccedil;eriğinin dili belirtilir.
            feed.Language = "TR-TR";
            // Son g&amp;uuml;ncelleme tarihi atanır.
            feed.LastUpdatedTime = DateTime.Now;

            // Feed i&amp;ccedil;erisinde yer alacak &amp;ouml;ğelerin her biri SyndicationItem tipindendir.
            // SyndicationFeed tipinin Items &amp;ouml;zelliği bu nesne &amp;ouml;rneklerini barındırır.
            // Items &amp;ouml;zelliği Collection&amp;lt;SyndicationItem&amp;gt; tipinden koleksiyonları kullanır.
            // C# 3.0 Object Initializers yardımıyla koleksiyon oluşturulur ve &amp;ouml;rnek &amp;ouml;ğeler eklenir.
            Collection&amp;lt;SyndicationItem&amp;gt; items = new Collection&amp;lt;SyndicationItem&amp;gt;()
                                {
                                    // Feed i&amp;ccedil;erisindeki &amp;ouml;ğeler(Items) SyndicationItem tipi ile temsil edilirler.
                                    // Parametreler title,content,uri,id,lastUpdatedTime
                                    new SyndicationItem("WCF - Front End Service Geliştirmek","WCF i&amp;ccedil;erisinde i&amp;ccedil;erik yayınlama",new Uri("http://www.bsenyurt.com/MakaleGoster.aspx?ID=241"),"1",new DateTime(2008,1,30))
                                    ,new SyndicationItem("Adım Adım State Machine Worflow Geliştirmek","Finite State Machine nasıl geliştirilir.",new Uri("http://www.bsenyurt.com/MakaleGoster.aspx?ID=240"),"2",new DateTime(2008,1,15))
                                }; 

            feed.Items = items; // oluşturulan &amp;ouml;ğelere ait koleksiyon Feed i&amp;ccedil;in set edilir.

            // Atom 1.0 notasyonunda formatlama i&amp;ccedil;in SyndicationFeed nesne &amp;ouml;rneğinin GetAtom10Formatter metodu ile Atom10FeedFormatter nesnesi &amp;ouml;rneklenir.
            Atom10FeedFormatter atom10Formatter = feed.GetAtom10Formatter();
        
            // Rss 2.0 notasyonunda formatlama i&amp;ccedil;in SyndicationFeed nesne &amp;ouml;rneğinin GetRss20Formatter metodu ile Rss20FeedFormatter nesnesi &amp;ouml;rneklenir.
            Rss20FeedFormatter rss20Formatter = feed.GetRss20Formatter();
        
            // Atom i&amp;ccedil;eriğinin kaydedileceği Xml dosyası XmlWriter tipi ile oluşturulur
            XmlWriter atom10writer = XmlWriter.Create("MakalelerAtom.xml");
            // Formatter nesnesinin WriteTo metodu ile Atom 1.0 notasyonunda formatlanan veri i&amp;ccedil;eriği XmlWriter nesnesinin işaret ettiği fiziki dosyaya yazılır.
            atom10Formatter.WriteTo(atom10writer);
            // XmlWriter nesnesi kapatılır
            atom10writer.Close();
        
            // Atom 1.0 i&amp;ccedil;in yapılan formatlama işlemi Rss 2.0 i&amp;ccedil;in benzer şekilde yapılır.
            XmlWriter rss20writer = XmlWriter.Create("MakalelerRss.xml");
            rss20Formatter.WriteTo(rss20writer);
            rss20writer.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Yukarıdaki kod par&amp;ccedil;asında &amp;ouml;rnek olarak oluşturulan &lt;strong&gt;Feed&lt;/strong&gt; i&amp;ccedil;erikleri &lt;strong&gt;Atom 1.0 &lt;/strong&gt;ve&lt;strong&gt; RSS 2.0 &lt;/strong&gt;formatlarına uygun olacak şekilde fiziki &lt;strong&gt;XML&lt;/strong&gt; dosyalarına yazdırılmaktadır. &lt;strong&gt;Feed&lt;/strong&gt; oluşturulması i&amp;ccedil;in &lt;strong&gt;SyndicationFeed&lt;/strong&gt; sınıfına ait nesne &amp;ouml;rnekleri kullanılır. Bununla birlikte i&amp;ccedil;erik paylaşımı ile ilgili ekstra metadata bilgileri s&amp;ouml;z konusu nesne &amp;ouml;rneğinin &amp;ccedil;eşitli &amp;ouml;zellikleri yardımıyla belirlenebilir. &amp;Ouml;rneğin i&amp;ccedil;eriği paylaşan yazar &lt;strong&gt;Author&lt;/strong&gt; &amp;ouml;zelliği ile belirlenebilir. Yazar gibi bilgiler i&amp;ccedil;erisinde mail adresi tarzında ek verilerde olabileceğinden &lt;strong&gt;SyndicationPerson&lt;/strong&gt; sınıfına ait nesne &amp;ouml;rnekleri ile &lt;strong&gt;author&lt;/strong&gt; elementinin y&amp;ouml;netimli kod tarafında ele alınması sağlanabilmektedir. Benzer durum kategori bilgileri i&amp;ccedil;inde ge&amp;ccedil;erlidir. Kategori i&amp;ccedil;in &lt;strong&gt;SyndicatioCategory&lt;/strong&gt; sınıfından yararlanılmaktadır. &lt;strong&gt;Feed&lt;/strong&gt; i&amp;ccedil;erisinde yer alan bilgilendirici &lt;strong&gt;&amp;ouml;ğeler(Items), SyndicationFeed&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde yer alan &lt;strong&gt;Items&lt;/strong&gt; &amp;ouml;zelliği(Property) ile tutulmaktadır. Items &amp;ouml;zelliği her bir elemanı &lt;strong&gt;SyndicationItem&lt;/strong&gt; sınıfından olan &lt;strong&gt;generic&lt;/strong&gt; &lt;strong&gt;Collection&lt;/strong&gt; tipi ile ele alınabilir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Feed&lt;/strong&gt; ve i&amp;ccedil;eriği oluşturulduktan sonra bu verinin &lt;strong&gt;Atom 1.0&lt;/strong&gt; veya &lt;strong&gt;RSS 2.0 f&lt;/strong&gt;ormatında &amp;uuml;retilmesi i&amp;ccedil;in &lt;strong&gt;Atom10FeedFormatter&lt;/strong&gt; ve &lt;strong&gt;Rss20FeedFormatter&lt;/strong&gt; sınıflarına ait nesne &amp;ouml;rneklerinden yararlanılmaktadır. Bu nesne &amp;ouml;rneklerinin &amp;uuml;retimi i&amp;ccedil;in &lt;strong&gt;SyndicationFeed&lt;/strong&gt; sınıfına ait &lt;strong&gt;GetAtom10Formatter&lt;/strong&gt; ve &lt;strong&gt;GetRss20Formatter&lt;/strong&gt; metodları kullanılır. Veri i&amp;ccedil;erikleri &lt;strong&gt;XML&lt;/strong&gt; formatlı olarak yazılabileceklerinden fiziki kaynağı işaret etmek adına &lt;strong&gt;XmlWriter&lt;/strong&gt; tipinden yararlanılır. S&amp;ouml;z konusu uygulama &amp;ccedil;alıştırıldığında &lt;strong&gt;MakalelerRss&lt;/strong&gt;.&lt;strong&gt;xml&lt;/strong&gt; ve &lt;strong&gt;MakalelerAtom&lt;/strong&gt;.&lt;strong&gt;xml&lt;/strong&gt; dosyalarının i&amp;ccedil;eriklerinin aşağıdaki gibi oluştuğu g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;MakalelerRss.xml i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk241_5.gif" alt="" width="420" height="443" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;MakalelerAtom.xml i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk241_6.gif" alt="" width="515" height="453" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Her iki yapının i&amp;ccedil;eriğini aşağıdaki grafik ile daha kolay bir şekilde de karşılaştırabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk241_7.gif" alt="" width="459" height="474" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere arada bazı farklılıklar mevcuttur. Ancak her iki formatta genel standarttır. Gelelim bu i&amp;ccedil;erikleri bir &lt;strong&gt;WCF&lt;/strong&gt; &lt;strong&gt;servisi&lt;/strong&gt; &amp;uuml;zerinden nasıl yayınlayabileceğimize. &amp;Ouml;ncelikli olarak &lt;strong&gt;RSS&lt;/strong&gt; formatında yayınlama yapılmasına izin veren bir &lt;strong&gt;WCF Servis K&amp;uuml;t&amp;uuml;phanesi(WCF Service Library) &lt;/strong&gt;geliştiriyor olacağız. Bu ama&amp;ccedil;la &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; ortamında &lt;strong&gt;.Net Framework 3.5 &lt;/strong&gt;şablonları i&amp;ccedil;erisinde yer alan &lt;strong&gt;WCF Service Library&lt;/strong&gt; proje tipi se&amp;ccedil;ilerek işe başlanabilir. Elbette &lt;strong&gt;Synidaction&lt;/strong&gt; i&amp;ccedil;in gerekli tipleri kullanacağımızdan servis k&amp;uuml;t&amp;uuml;phanesinin &lt;strong&gt;System.ServiceModel.Web.dll&lt;/strong&gt; &lt;strong&gt;assembly&lt;/strong&gt;' ınıda referans etmesi gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk241_9.gif" alt="" width="242" height="230" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Servis k&amp;uuml;t&amp;uuml;phanesi &lt;/strong&gt;i&amp;ccedil;erisinde yer alacak olan &lt;strong&gt;s&amp;ouml;zleşme(Contract) &lt;/strong&gt;ve uygulayıcı sınıfa ait sınıf diyagramı(Class Diagram) ile i&amp;ccedil;erikleri ise aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk241_8.gif" alt="" width="253" height="290" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;IPaylasim &lt;strong&gt;aray&amp;uuml;z&amp;uuml;n&amp;uuml;n(Interface)&lt;/strong&gt; i&amp;ccedil;eriği;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Linq;
using System.ServiceModel;
using System.ServiceModel.Web;
using System.Collections.Generic;
using System.ServiceModel.Syndication;

namespace RssAtomLibrary
{
    [ServiceContract]
    public interface IPaylasim
    {
        [OperationContract]
        [WebGet]
        Rss20FeedFormatter RssCiktisi();
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Aray&amp;uuml;z(Interface)&lt;/strong&gt; tanımlamasında belkide dikkati &amp;ccedil;eken en &amp;ouml;nemli noktalardan biriside &lt;strong&gt;WebGet&lt;/strong&gt; isimli &lt;strong&gt;niteliğin(attribute)&lt;/strong&gt; kullanıllmasıdır. Bu nitelik s&amp;ouml;z konusu servise &lt;strong&gt;HTTP&lt;/strong&gt; &lt;strong&gt;Get&lt;/strong&gt; metoduna g&amp;ouml;re talepte(Request) bulunabileceğini g&amp;ouml;stermektedir.&lt;/p&gt;
&lt;p&gt;Paylasim &lt;strong&gt;sınıfının(Class)&lt;/strong&gt; i&amp;ccedil;eriği;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Linq;
using System.ServiceModel;
using System.ServiceModel.Web;
using System.Collections.Generic;
using System.ServiceModel.Syndication;

namespace RssAtomLibrary
{

    public class Paylasim : IPaylasim
    {
        #region IPaylasim Members

        public Rss20FeedFormatter RssCiktisi()
        {
            // &amp;Ouml;ncelikle bir Feed oluşturulur
            SyndicationFeed feed = new SyndicationFeed();
    
            // İ&amp;ccedil;erik paylaşımı yapan yazarlar SyndicationPerson sınıfı yardımıyla tanımlanırlar ve Authors koleksiyonuna dahil edilirler.
            feed.Authors.Add(new SyndicationPerson("selim(at)buraksenyurt.com", "Burak Selim Senyurt", "http://www.bsenyurt.com"));
            feed.Authors.Add(new SyndicationPerson("kariim@bsenyurt.com", "Kariim Abdul Cabbar", "http://www.bsenyurt.com"));

            // İ&amp;ccedil;eriğin ilgili olduğu kategoriler SyndicationCategory sınıf yardımıyla &amp;ouml;rneklenir ve Categories koleksiyonuna dahil edilir.
            feed.Categories.Add(new SyndicationCategory(".Net"));
            feed.Categories.Add(new SyndicationCategory("C#"));

            // İ&amp;ccedil;erik il ilgili a&amp;ccedil;ıklama TextSyndicationContent sınıfı yardımıyla eklenir
            feed.Description = new TextSyndicationContent(".Net ve C# ağırılıklı makaleler", TextSyndicationContentKind.Html);
            feed.Language = "Tr-Tr"; // İ&amp;ccedil;erik dili belirtilir
            feed.LastUpdatedTime = DateTime.Now; // Son g&amp;uuml;ncelleme tarihi belirtilir
            feed.Title=new TextSyndicationContent(".Net ile ilgili Herşey"); // İ&amp;ccedil;eriğin başlığı TextSyndicationContent sınıfı yardımıyla belirtilir.
    
            // Ogeler eklenir
            List&amp;lt;SyndicationItem&amp;gt; items = new List&amp;lt;SyndicationItem&amp;gt;()
                    {
                        // Feed i&amp;ccedil;erisindeki &amp;ouml;ğeler(Items) SyndicationItem tipi ile temsil edilirler.
                        // Parametreler title,content,uri,id,lastUpdatedTime
                        new SyndicationItem("WCF - Front End Service Geliştirmek","WCF i&amp;ccedil;erisinde i&amp;ccedil;erik yayınlama",new Uri("http://www.bsenyurt.com/MakaleGoster.aspx?ID=241"),"1",new DateTime(2008,1,30))
                        ,new SyndicationItem("Adım Adım State Machine Worflow Geliştirmek","Finite State Machine nasıl geliştirilir.",new Uri("http://www.bsenyurt.com/MakaleGoster.aspx?ID=240"),"2",new DateTime(2008,1,15))
                    };

               feed.Items = items;
            return new Rss20FeedFormatter(feed);    
        }

        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;Paylasim sınıfının &lt;strong&gt;RssCiktisi&lt;/strong&gt; isimli metodu &lt;strong&gt;Rss20FeedFormatter&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneğini d&amp;ouml;nd&amp;uuml;rmektedir. Bu nesne &amp;ouml;rneklenirken parametre olarak &lt;strong&gt;SyndicationFeed&lt;/strong&gt; tipinden oluşturulan nesne &amp;ouml;rneği parametre olarak verilmektedir. &lt;strong&gt;Servis&lt;/strong&gt; &lt;strong&gt;k&amp;uuml;t&amp;uuml;phanesinin(Service Library)&lt;/strong&gt; bu şekilde hazırlanmasının ardından artık &lt;strong&gt;Host&lt;/strong&gt; uygulamanın yazılmasına ge&amp;ccedil;ilebilir. &lt;strong&gt;Host&lt;/strong&gt; uygulama servis k&amp;uuml;t&amp;uuml;phanesini,&lt;strong&gt; System.ServiceMode.dll &lt;/strong&gt;ve yine &lt;strong&gt;System.ServiceModel.Web.dll&lt;/strong&gt; &lt;strong&gt;assembly&lt;/strong&gt;' larını referans etmelidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk241_10.gif" alt="" width="255" height="235" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Host uygulama basit olarak bir &lt;strong&gt;Console&lt;/strong&gt; programı şeklinde tasarlanabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using System.ServiceModel.Web;
using RssAtomLibrary;
using System.ServiceModel.Syndication;
using System.Xml;

namespace Sunucu
{
    class Program
    {
        static void Main(string[] args)
        {
            WebServiceHost host = new WebServiceHost(typeof(Paylasim), new Uri("http://localhost:65001/MakalePaylasimServisi"));

            host.Open();
            
            Console.WriteLine("Servis durumu {0} ", host.State);
            Console.WriteLine("Host dinlemede...&amp;Ccedil;ıkmak i&amp;ccedil;in bir tuşa basınız...");
            Console.ReadLine();
            
            host.Close(); 
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Host&lt;/strong&gt; uygulamada ilk dikkati &amp;ccedil;eken noktalardan birisi &lt;strong&gt;WebServiceHost&lt;/strong&gt; sınıfına ait bir nesne &amp;ouml;rneğinin kullanılmasıdır. Bilindiği gibi normal şartlarda &lt;strong&gt;ServiceHost&lt;/strong&gt; sınıfından yararlanılmaktadır. &lt;strong&gt;WebServiceHost&lt;/strong&gt; nesnesi &amp;ouml;rneklenirken ilk parametre olarak &lt;strong&gt;servis s&amp;ouml;zleşmesini(Service Contract)&lt;/strong&gt; uygulayan sınıfın tipini almaktadır. Sonraki parametrede ise servis adresi belirlenmektedir. Host' un a&amp;ccedil;ılması i&amp;ccedil;in yine &lt;strong&gt;Open&lt;/strong&gt; metoduna başvurulmaktadır. Benzer şekilde kapatma işlemi i&amp;ccedil;inde &lt;strong&gt;Close&lt;/strong&gt; fonksiyonundan yararlanılır. Bu işlemlerin ardından servis uygulaması &amp;ccedil;alıştırılabilir. Servis uygulaması &amp;ccedil;alışıyorken herhangibir tarayıcı penceresinden &lt;strong&gt;http://localhost:65001/MakalePaylasimServisi/RssCiktisi &lt;/strong&gt;adresi talep edilirse aşağıdaki ekran &amp;ccedil;ıktısında yer alan g&amp;ouml;r&amp;uuml;nt&amp;uuml; elde edilecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk241_11.gif" alt="" width="544" height="528" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi servisteki &lt;strong&gt;RssCiktisi&lt;/strong&gt; isimli metodun sonucu &lt;strong&gt;HTTP&lt;/strong&gt; &amp;uuml;zerinden elde edilebilmektedir. Burada dikkat edilmesi gereken &amp;ouml;nemli bir nokta vardır. &lt;strong&gt;URL&lt;/strong&gt; adresinin sonu, &lt;strong&gt;RSS&lt;/strong&gt; &amp;ccedil;ıktısı veren metodun adı ile aynıdır. Eğer farklı bir adres girilirse &lt;strong&gt;Service&lt;/strong&gt; &lt;strong&gt;EndPoint&lt;/strong&gt; bulunamayacak ve aşağıdakine benzer bir ekran ile karşılaşılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk241_12.gif" alt="" width="409" height="199" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu durum istemci tarafınada bir &lt;strong&gt;&amp;ccedil;alışam zamanı istisnası(Runtime Exception) &lt;/strong&gt;olarak yansıyacaktır. Peki istemci kod tarafından bu tip bir i&amp;ccedil;eriği nasıl ele alabilir? Bu ama&amp;ccedil;la basit bir istemci uygulamayı &lt;strong&gt;Console&lt;/strong&gt; projesi olacak şekilde geliştirip devam edelim. Istemci tarafında standart &lt;strong&gt;XmlReader&lt;/strong&gt; veya &lt;strong&gt;XmlDocument&lt;/strong&gt; nesneleri yardımıyla &lt;strong&gt;HTTP&lt;/strong&gt; &lt;strong&gt;Get&lt;/strong&gt; ile talep edilen servis i&amp;ccedil;eriği &amp;ccedil;ekilebilir. Ancak &lt;strong&gt;.Net Framework 3.5 &lt;/strong&gt;i&amp;ccedil;erisinde gelen &lt;strong&gt;Syndication&lt;/strong&gt; tipleri yardımıyla bu işlemi ger&amp;ccedil;ekleştirmek &amp;ccedil;ok daha kolaydır. Bu nedenle istemci tarafındaki uygulamaya &lt;strong&gt;System.ServiceModel.Web.dll assembly&lt;/strong&gt;' ının referans edilmesi gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk241_14.gif" alt="" width="260" height="213" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere herhangibir şekilde &lt;strong&gt;servis referansı&lt;/strong&gt; eklenmemiş yada &lt;strong&gt;proxy&lt;/strong&gt; sınıfı oluşturulmamıştır. Nitekim servise g&amp;ouml;nderilecek olan &lt;strong&gt;talep(request)&lt;/strong&gt; aslında &lt;strong&gt;EndPoint&lt;/strong&gt; davranışı sergileyen bir metoda doğru &lt;strong&gt;HTTP&lt;/strong&gt; &lt;strong&gt;Get&lt;/strong&gt; &amp;uuml;zerinden sağlanacaktır. Bu sebeplerden istemci tarafındaki kodlar &amp;ccedil;ok basit olarak aşağıdaki gibi geliştirilebilirler.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Xml;
using System.ServiceModel.Syndication;

namespace Istemci
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("RSS i&amp;ccedil;eriğini &amp;ccedil;ekmek i&amp;ccedil;in bir tuşa basınız");
            Console.ReadLine();

            XmlReader reader = XmlReader.Create("http://localhost:65001/MakalePaylasimServisi/RssCiktisi");
            SyndicationFeed feed = SyndicationFeed.Load(reader);

            Console.WriteLine(feed.Title.Text);
            foreach (SyndicationPerson yazar in feed.Authors)
            {
                Console.WriteLine("\t{0} \t {1}",yazar.Name,yazar.Email);
            }

            foreach (SyndicationItem item in feed.Items)
            {
                Console.WriteLine(String.Format("{0} : {1} {2}",item.Id,item.Title.Text,item.Links[0].Uri));
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;XmlReader&lt;/strong&gt; sınıfından yararlanılarak &lt;strong&gt;http://localhost:65001/MakalePaylasimServisi/RssCiktisi&lt;/strong&gt; adresinden talepte bulunulmaktadır. Bu talep sonrası elde edilen &lt;strong&gt;XML&lt;/strong&gt; &amp;ccedil;ıktısının &lt;strong&gt;SyndicationFeed&lt;/strong&gt; sınıfı tarafından daha kolay bir şekilde ele alınabilmesini sağlamak amacıyla &lt;strong&gt;static&lt;/strong&gt; &lt;strong&gt;Load&lt;/strong&gt; metoduna &lt;strong&gt;XmlReader&lt;/strong&gt; nesne &amp;ouml;rneği parametre olarak verilir. Bu işlemin ardından &lt;strong&gt;Feed&lt;/strong&gt; ile ilgili olarak &lt;strong&gt;başlık(title)&lt;/strong&gt; bilgisi elde edilir. Bununla birlikte &lt;strong&gt;SyndicationPerson&lt;/strong&gt; sınıfı ve &lt;strong&gt;Authors&lt;/strong&gt; &amp;ouml;zelliklerinden yararlanılarak yazarlara ait &lt;strong&gt;isim(Name)&lt;/strong&gt; ve &lt;strong&gt;elektronik posta(e mail)&lt;/strong&gt; bilgileri &amp;ccedil;ekilir. Son olarakta &lt;strong&gt;Items&lt;/strong&gt; koleksiyonu dolaşılarak var olan t&amp;uuml;m &amp;ouml;ğeler &lt;strong&gt;SyndicationItem&lt;/strong&gt; sınıfına ait nesne &amp;ouml;rnekleri yardımıyla ele alınır. &amp;Ouml;rnek olarak &amp;ouml;ğelerin &lt;strong&gt;Id&lt;/strong&gt;, &lt;strong&gt;başlık(Title)&lt;/strong&gt; ve &lt;strong&gt;url&lt;/strong&gt; bilgileri verilir. İstemcilerin talepte bulunabilmesi ve &lt;strong&gt;Feed&lt;/strong&gt; i&amp;ccedil;eriklerini &amp;ccedil;ekebilmesi i&amp;ccedil;in &amp;ccedil;ok doğal olarak servis tarafınının &amp;ccedil;alışıyor olması gerekir. Eğer bu şart sağlanırsa aşağıdakine benzer bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk241_13.gif" alt="" width="639" height="247" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;Feed&lt;/strong&gt; i&amp;ccedil;eriği istemci tarafına başarılı bir şekilde aktarılmıştır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;İ&amp;ccedil;erik paylaşımı(Syndication)&lt;/strong&gt; ile ilişkili bir diğer &amp;ouml;nemli konuda bir servisin yeri geldiğinde &lt;strong&gt;RSS&lt;/strong&gt; &lt;strong&gt;2&lt;/strong&gt;.&lt;strong&gt;0&lt;/strong&gt; formatında yeri geldiğinde de &lt;strong&gt;Atom 1.0 &lt;/strong&gt;formatında i&amp;ccedil;erik paylaşımına izin vermesidir. Bu ama&amp;ccedil;la servis tarafında bazı değişiklier yapmak gerekecektir. Bu ama&amp;ccedil;la az &amp;ouml;nce geliştirilen servis k&amp;uuml;t&amp;uuml;phanesindeki(WCF Service Library) aray&amp;uuml;z&amp;uuml;(Interface) aşağıdaki gibi değiştirerek işe başlayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[ServiceContract]
[ServiceKnownType(typeof(Rss20FeedFormatter))]
[ServiceKnownType(typeof(Atom10FeedFormatter))]
public interface IPaylasim
{
    [OperationContract]
    [WebGet]
    Rss20FeedFormatter RssCiktisi();

    [OperationContract]
    [WebGet(UriTemplate="IcerikOzeti?icerikTipi={icerikTipi}")]
    SyndicationFeedFormatter IcerikOzeti(string icerikTipi);
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncelikli olarak &lt;strong&gt;ServiceKnownType&lt;/strong&gt; niteliği(attribute) ile servisin &lt;strong&gt;Rss20&lt;/strong&gt; ve &lt;strong&gt;Atom10&lt;/strong&gt; formatlarından nesne &amp;ouml;rnekleri d&amp;ouml;nd&amp;uuml;rebileceği belirtilmektedir. Nitekim i&amp;ccedil;erik paylaşım modelinde ilgili servis metodlarının &lt;strong&gt;SyndicationFeedFormatter&lt;/strong&gt; sınıfı ile taşınabilecek tipler d&amp;ouml;nd&amp;uuml;rmeleri şarttır. Diğer taraftan &lt;strong&gt;IcerikOzeti&lt;/strong&gt; metodunda kullanılan &lt;strong&gt;WebGet&lt;/strong&gt; niteliğinde bir &lt;strong&gt;querystring&lt;/strong&gt; bildirimi yapılmaktadır. Bu querystring bildirimi metoda &lt;strong&gt;HTTP&lt;/strong&gt; &lt;strong&gt;Get&lt;/strong&gt; &amp;uuml;zerinden gelecek olan &lt;strong&gt;parametre&lt;/strong&gt; bilgisinin şablonunu tanımlamaktadır. &lt;strong&gt;Aray&amp;uuml;z s&amp;ouml;zleşmesini(Interface Contract)&lt;/strong&gt; uygulayan sınıf i&amp;ccedil;erisindeki metodun ise aşağıdaki gibi geliştirilmesi yeterlidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public SyndicationFeedFormatter IcerikOzeti(string icerikTipi)
{
    SyndicationFeed feed = new SyndicationFeed();

    feed.Authors.Add(new SyndicationPerson("selim(at)buraksenyurt.com", "Burak Selim Senyurt", "http://www.bsenyurt.com"));
    feed.Authors.Add(new SyndicationPerson("kariim@bsenyurt.com", "Kariim Abdul Cabbar", "http://www.bsenyurt.com"));

    feed.Categories.Add(new SyndicationCategory(".Net"));
    feed.Categories.Add(new SyndicationCategory("C#"));

    feed.Description = new TextSyndicationContent(".Net ve C# ağırılıklı makaleler", TextSyndicationContentKind.Html);
    feed.Language = "Tr-Tr"; 
    feed.LastUpdatedTime = DateTime.Now; 
    feed.Title = new TextSyndicationContent(".Net ile ilgili Herşey"); 

    List&amp;lt;SyndicationItem&amp;gt; items = new List&amp;lt;SyndicationItem&amp;gt;()
        {
            new SyndicationItem("WCF - Front End Service Geliştirmek","WCF i&amp;ccedil;erisinde i&amp;ccedil;erik yayınlama",new Uri("http://www.bsenyurt.com/MakaleGoster.aspx?ID=241"),"1",new DateTime(2008,1,30))
            ,new SyndicationItem("Adım Adım State Machine Worflow Geliştirmek","Finite State Machine nasıl geliştirilir.",new Uri("http://www.bsenyurt.com/MakaleGoster.aspx?ID=240"),"2",new DateTime(2008,1,15))
        };
    feed.Items = items;

    if (icerikTipi == "atom")
        return new Atom10FeedFormatter(feed);
    else if (icerikTipi == "rss")
        return new Rss20FeedFormatter(feed);
    else
        return null;
}&lt;/pre&gt;
&lt;p&gt;Bu metod i&amp;ccedil;erisinde dikkat edilmesi gereken en &amp;ouml;nemli nokta icerikTipi değerine g&amp;ouml;re &lt;strong&gt;Atom10FeedFormatter&lt;/strong&gt; veya &lt;strong&gt;Rss20FeedFormatter&lt;/strong&gt; tipinden nesne &amp;ouml;rnekleri d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesidir. Bu sebepten dolayıda metodun d&amp;ouml;n&amp;uuml;ş tipi &lt;strong&gt;SyndicationFeedFormatter&lt;/strong&gt; tipindendir. Artık istemciler servise talepte bulunurlarken &lt;strong&gt;rss&lt;/strong&gt; veya &lt;strong&gt;atom&lt;/strong&gt; formatında i&amp;ccedil;erik isteyebilirler. Aşağıdaki ekran &amp;ccedil;ıktılarında bu durum a&amp;ccedil;ık bir şekilde g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Rss talebi;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk241_16.gif" alt="" width="568" height="486" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Atom talebi;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk241_15.gif" alt="" width="568" height="485" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalemizde basit olarak &lt;strong&gt;.Net Framework 3.5 &lt;/strong&gt;ile gelen tipler sayesinde bir &lt;strong&gt;WCF(Windows Communication Foundation)&lt;/strong&gt; servisi &amp;uuml;zerinden &lt;strong&gt;RSS 2.0&lt;/strong&gt; veya &lt;strong&gt;Atom 1.0&lt;/strong&gt; formatında i&amp;ccedil;erik paylaşımının nasıl yapılabileceğini incelemeye &amp;ccedil;alıştık. İlerleyen makalelerimizde WCF in &lt;strong&gt;.Net Framework 3.5&lt;/strong&gt; ile gelen yeniliklerini incelemeye devam edeceğiz. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/WCFSyndication.rar"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2008-02-08 12:00:00</pubDate>
  <slug>RSS-Atom-Formatlc4b1-Icerik-Paylasc4b1mc4b1(Syndication)-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
    <tag>rss</tag>
    <tag>feed</tag>
    <tag>syndication</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>