<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net Core - Önce Razor Sonra Blazor</title>
  <description>Asp.Net Core 5 cephesine baktığımızda üç temel uygulama modelini desteklediğini görürüz. Web uygulamaları, servisler ve gerçek zamanlı iletişim araçları. Gerçek zamanlı(Real-Time) iletişim tarafında SignalR karşımıza çıkar. Servisleri göz önüne aldığımızda ise Web API ve gRPC başrolde yer alır. Web tarafını düşündüğümüzde oldukça zengin bir ürün çeşitliliği söz konusudur. MVC(Model View Controller), Razor Pages, Blazor, Angular ve React tabanlı SPA'lar(Single Page Applications). Kuvvetle muhtemel Asp.Net Core 5 tarafına yeni başladıysanız ve haberleri yeterince takip ediyorsanız en çok ilgi çeken geliştirme çatısının Blazor olduğunda hem fikir sayılırız. Fakat Blazor' a doğrudan geçmeden önce bazı temellerin de öğrenilmesi gerekir.</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/jack-finnigan-00yDgACVeMA-unsplash.jpg" alt="" align="right" /&gt;Kendime geldiğimde hi&amp;ccedil;bir şey g&amp;ouml;remediğimi fark ettim. &amp;Uuml;st&amp;uuml;me &amp;ccedil;&amp;ouml;ken zifiri karanlığa rağmen halen daha hayatta olduğuma dair tek şey yağmur damlalarının birka&amp;ccedil; metre &amp;uuml;st&amp;uuml;mde olduğunu sandığım&amp;nbsp;metal tavana vurarak &amp;ccedil;ıkardıkları seslerdi. Ensemden neredeyse ayak parmaklarıma kadar yayılan ağrı hi&amp;ccedil;bir şeyi umursamaz bir tavırda yattığım yerden doğrulmamı g&amp;uuml;&amp;ccedil;leştiriyordu. Son hatırladığım CloudTown'dan birka&amp;ccedil; sibernetik coder ile karşılaştığım belli belirsiz yansımalardan ibaretti. Kısa s&amp;uuml;re sonra yakınlarımda koşuşturan bazı ayak sesleri işittim. Yer yer duraksıyor yer yer su birikintilerine girip &amp;ccedil;ıkıyorlardı.&amp;nbsp;Fısıltılar daha duyulur sesler haline gelmeye başladı.&amp;nbsp;Tavandaki&amp;nbsp;kapağı a&amp;ccedil;mak &amp;uuml;zere i&amp;ccedil;lerinden birinin elindeki anahtarları hazırladığını işittim. Sonrası g&amp;ouml;zlerim i&amp;ccedil;in &amp;ccedil;ok korkun&amp;ccedil; bir deneyimdi.&amp;nbsp;Bu zifiri karanlıkta ne kadar kaldığımı bilmiyorum ama g&amp;ouml;zlerim dışardan gelen o parlak ışığa karşı adeta haykırıyordu. &amp;Uuml;st&amp;uuml;me boca edilen&amp;nbsp;bir kova soğuk suyun ardından gelen kaba ses ise &amp;ccedil;ok tanıdıkdı. Ve ş&amp;ouml;yle seslendim; "Reyzor! Sen haaa" :P&lt;/p&gt;
&lt;p&gt;Efendim bendeniz yine yazıya giriş yapacak g&amp;uuml;zel bir şeyler bulamayınca b&amp;ouml;yle garip bir hikayeyi ortaya atıverdim. Gel gelelim konumuz baş karakterimiz Reyzor ile de alakalı.(Photo by &lt;a href="https://unsplash.com/@jackofallstreets?utm_source=unsplash&amp;amp;utm_medium=referral&amp;amp;utm_content=creditCopyText"&gt;Jack Finnigan&lt;/a&gt; on &lt;a href="https://unsplash.com/s/photos/rain?utm_source=unsplash&amp;amp;utm_medium=referral&amp;amp;utm_content=creditCopyText"&gt;Unsplash&lt;/a&gt;)&lt;/p&gt;
&lt;p&gt;Asp.Net Core 5&amp;nbsp;cephesine baktığımızda &amp;uuml;&amp;ccedil; temel uygulama modelini desteklediğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Web uygulamaları, servisler ve ger&amp;ccedil;ek zamanlı iletişim ara&amp;ccedil;ları. Ger&amp;ccedil;ek zamanlı&lt;em&gt;(Real-Time)&lt;/em&gt; iletişim tarafında SignalR karşımıza &amp;ccedil;ıkar. Servisleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda ise Web API ve gRPC başrolde yer alır. Web tarafını d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde olduk&amp;ccedil;a zengin bir &amp;uuml;r&amp;uuml;n &amp;ccedil;eşitliliği s&amp;ouml;z konusudur. MVC&lt;em&gt;(Model View Controller)&lt;/em&gt;, Razor Pages, Blazor, Angular ve React tabanlı SPA'lar&lt;em&gt;(Single Page Applications)&lt;/em&gt;. Kuvvetle muhtemel Asp.Net Core 5 tarafına yeni başladıysanız ve haberleri yeterince takip ediyorsanız en &amp;ccedil;ok ilgi &amp;ccedil;eken geliştirme &amp;ccedil;atısının Blazor olduğunda hem fikir sayılırız. Fakat Blazor' a doğrudan ge&amp;ccedil;meden &amp;ouml;nce bazı temellerin de &amp;ouml;ğrenilmesi gerekir.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z gelimi dahili Dependency Injection mekanizmasının nasıl &amp;ccedil;alıştığını anlamak bunlardan sadece birisidir. Bana g&amp;ouml;re bir diğer &amp;ouml;nemli konu da Razor View Engine ya da sık telafuz edilen adıyla Razor'dur. Nitekim MVC, Razor Pages ve Blazor geliştirme &amp;ccedil;atıları alt yapı olarak Razor View Engine &amp;uuml;zerine oturmaktadır. Dolayısıyla aynı bileşen yazım şablonlarını farklı web geliştirme &amp;ccedil;atıları i&amp;ccedil;in kullanabiliriz. Bu yetenek &amp;ccedil;atılar arası ge&amp;ccedil;iş yapmamızı da kolaylaştırır. &amp;Ouml;ğrenilmesi olduk&amp;ccedil;a kolay olan Razor, sadece C# ve HTML bilgisi gerektirir. Son yıllarda desteklediği yardımcı takılar&lt;em&gt;(Tag helper)&lt;/em&gt;&amp;nbsp;sayesinde aray&amp;uuml;z tasarımcıları i&amp;ccedil;in dostane bir s&amp;ouml;zdizimi&lt;em&gt;(syntax)&lt;/em&gt; sunar. Ayrıca test edilebilirliği basitleştirir. Razor en temel tanımıyla dinamik i&amp;ccedil;erikle HTML &amp;ccedil;ıktısı &amp;uuml;retmeyi ama&amp;ccedil;layan C# temelli bir işaretleme şablonudur&lt;em&gt;(Markup Template)&lt;/em&gt; İşte bu yazıdaki amacımız &amp;ouml;rnek kodlar yardımıyla ona merhaba demek.&lt;/p&gt;
&lt;p&gt;Dilerseniz vakit kaybetmeden&amp;nbsp;&amp;ouml;rnek kodlara ge&amp;ccedil;elim. Microsoft .Net 5 y&amp;uuml;kl&amp;uuml; herhangi bir platformda aşağıdaki terminal komutları ile işe başlayabiliriz. Sonrasında Visual Studio Code veya Visual Studio Communit Edition veya kendimizi rahat hissettiğimiz bir IDE ile ilerleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new sln -o HelloRazor
cd .\HelloRazor\
dotnet new mvc -o FirstContact
dotnet sln add .\FirstContact\&lt;/pre&gt;
&lt;p&gt;HelloRazor isimli bir Solution var. Ona&amp;nbsp;FirstContact isimli bir de MVC&lt;em&gt;(Model View Controller)&lt;/em&gt; projesi ekledik. Bu, en hafif MVC şablonu olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Varsayılan haliyle baktığımızda dahi Razor tabanlı sayfalar i&amp;ccedil;erdiğini g&amp;ouml;rebiliriz&lt;em&gt;(Index.cshtml, Privacy.cshmtl gibi)&lt;/em&gt; Cshtml uzantılı bu dosyalar kendi i&amp;ccedil;lerinde hem HTML hem de sunucu tarafında &amp;ccedil;alışan C# kodlarını barındırır. Bu noktadan&amp;nbsp;sonra karşımıza sıklıkla @ sembol&amp;uuml;n&amp;uuml;n &amp;ccedil;ıkacağını ifade edebilirim. @ Sembol&amp;uuml; ile C# ifadelerini veya kod bloklarını HTML i&amp;ccedil;erisinde kullanabiliriz.&amp;nbsp;Hemen index.cshtml dosyasına ge&amp;ccedil;elim ve i&amp;ccedil;eriğini aşağıdaki gibi g&amp;uuml;ncelleyelim.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;@{
    ViewData["Title"] = "Space Traveler's Base";
}

&amp;lt;div&amp;gt;
    &amp;lt;h1 class="display-4"&amp;gt;@ViewData["Title"]&amp;lt;/h1&amp;gt;
    &amp;lt;p&amp;gt;
        Today is @DateTime.Now.DayOfWeek ! Well, where do you want to go?
    &amp;lt;/p&amp;gt;
    &amp;lt;ul&amp;gt;
        @{
            var locations = new List&amp;lt;string&amp;gt; { "Sirius", "Altair", "Betelgeuse", "Algol", "Messier 31", "Eta Carinae" };
            var count = locations.Count;

            foreach (string location in locations)
            {
                &amp;lt;li&amp;gt;@location&amp;lt;/li&amp;gt;
            }
        }
    &amp;lt;/ul&amp;gt;
&amp;lt;/div&amp;gt;&lt;/pre&gt;
&lt;p&gt;Index.cshtml i&amp;ccedil;erisinde hem HTML hem de C# kodları olduğunu g&amp;ouml;rebiliriz. @{ } ifadeleri razor kod blokları olarak adlandırılır. İ&amp;ccedil;lerinde &amp;ouml;zg&amp;uuml;rce C# kodlaması yapabiliriz. Kodun iki yerinde bu kullanım s&amp;ouml;z konusu. İkinci kullanım biraz daha ilgi &amp;ccedil;ekici. string t&amp;uuml;rden bir List nesnesini kullanarak tarayıcıya&amp;nbsp;&amp;ccedil;eşitli yıldızların isimlerini&amp;nbsp;basıyoruz.&amp;nbsp;@location kullanımı mutlaka dikkatinizi &amp;ccedil;ekmiştir. Zaten bir Razor kod bloğundaysak neden d&amp;ouml;ng&amp;uuml;deki location değişkeni başında @ işareti var? &amp;Ccedil;&amp;uuml;nk&amp;uuml; kod bloğu i&amp;ccedil;erisinde bir HTML elementi kullandık. li elementi kullanılan kısımda bir anda Razor kod bloğu dışına &amp;ccedil;ıkmış ve HTML d&amp;uuml;nyasına girmiş oluruz. Doğrudan HTML i&amp;ccedil;erisinde C# ifadelerini &amp;ccedil;alıştırmamız gereken bu gibi hallerde, ifadenin başına @ işareti koyarak hareket edebiliriz&lt;em&gt;(Razor Implicit Expression olarak adlandırılan teknik).&lt;/em&gt;&amp;nbsp;location i&amp;ccedil;in ge&amp;ccedil;erli olan bu kullanımın bir benzeri de hangi g&amp;uuml;nde olduğumuzu yazdıran kısımda yer almaktadır.&amp;nbsp;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Uygulamayı &amp;ccedil;alıştırdığımızda aşağıdakine benzer bir sonu&amp;ccedil; almamız gerekir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/hellomvc_12.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Pek tabii locations listesinin bir model nesnesi baz alınarak farklı bir bileşenden View tarafına &amp;ccedil;ekilmesi&amp;nbsp;asıl ama&amp;ccedil; olmalıdır. MVC ve Blazor uygulamalarında sıklıkla bavşuracağımız bir yoldur. Bu durumu daha iyi anlamak i&amp;ccedil;in Model klas&amp;ouml;r&amp;uuml; altına StarModel isimli bir sınıf oluşturarak devam edelim. Bu literat&amp;uuml;rde ViewModel olarak adlandırılan tiptir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ComponentModel.DataAnnotations;

namespace FirstContact.Models
{
    public class StarModel
    {
        [Required]
        [Display(Name="Star No")]
        public int ID { get; set; }
        [Required]
        [MinLength(3,ErrorMessage = "The name of the star must be at least 3 characters.")]
        public string Name { get; set; }
        [Required]
        [Range(1,750)]
        [Display(Name="Distance from Earth(LY)")]
        public double Distance { get; set; }
        [Required]
        public double SurfaceTemperature { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;zelliklerin &amp;uuml;zerinde kullanılan nitelikler&lt;em&gt;(Attribute)&lt;/em&gt; şu an i&amp;ccedil;in gerekli değil ama yazının ilerleyen&amp;nbsp;kısmındaki Tag Helper kullanımında işimize yarayacaklar. Bunu bir kenara bırakırsak basit bir ViewModel tanımladığımızı s&amp;ouml;yleyebiliriz. Bu modele ait y&amp;uuml;kleme, silme, g&amp;uuml;ncelleme gibi işlemleri ise farklı bir sınıfın sorumluluğuna vermemiz doğru olacaktır. &amp;Ouml;rneğin Data isimli yeni bir klas&amp;ouml;r altına koyacağımız Star isimli bir sınıf bu iş i&amp;ccedil;in ideal g&amp;ouml;r&amp;uuml;n&amp;uuml;yor&amp;nbsp;&lt;em&gt;(Konumuzla doğrudan alakalı olmasa da alışkanlık edinmemiz i&amp;ccedil;in bir interface tipi ile birlikte bu bileşenleri tanımlamakta ve Dependency Injection ile birlikte kullanmakta yarar var)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;IStar aray&amp;uuml;z&amp;uuml;;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using FirstContact.Models;
using System.Collections.Generic;

namespace FirstContact.Data
{
    public interface IStar
    {
        List&amp;lt;StarModel&amp;gt; GetStars();
    }
}&lt;/pre&gt;
&lt;p&gt;ve Star sınıfı;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;using FirstContact.Models;
using System.Collections.Generic;

namespace FirstContact.Data
{
    public class Star
        :IStar
    {
        public List&amp;lt;StarModel&amp;gt; GetStars()
        {
            return new List&amp;lt;StarModel&amp;gt;
            {
                new StarModel{ID=1,Name="Sirius",Distance=8.60,SurfaceTemperature=9940},
                new StarModel{ID=2,Name="Altair",Distance=16.73,SurfaceTemperature=7700},
                new StarModel{ID=3,Name="Betelgeuse",Distance=642.5,SurfaceTemperature=126000},
                new StarModel{ID=4,Name="Algol",Distance=92.95,SurfaceTemperature=13000},
                new StarModel{ID=5,Name="Eta Carinae",Distance=7.5,SurfaceTemperature=35200},
            };
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Sadece Index sayfasında kullandığımız yıldız listesinin bir benzerini d&amp;ouml;nd&amp;uuml;ren kobay bir sınıf. Peki Razor View Engine tarafı bu sınıfı nasıl kullanacak? Şu anki MVC senaryomuza g&amp;ouml;re HomeController tarafındaki hazır Action metodu bunun i&amp;ccedil;in uygun g&amp;ouml;r&amp;uuml;n&amp;uuml;yor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using FirstContact.Data;
using Microsoft.AspNetCore.Mvc;

namespace FirstContact.Controllers
{
    public class HomeController : Controller
    {
        private readonly IStar _star;

        public HomeController(IStar star)
        {
            _star = star;
        }

        public IActionResult Index()
        {
            var starList = _star.GetStars();
            return View(starList);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Index metodunda bir Star nesne &amp;ouml;rneği kullanarak yıldız listesini almaktayız. Sonrasında bu listeyi View metoduna parametre olarak ge&amp;ccedil;erek Home isimli View'a g&amp;ouml;ndermekteyiz. Sınıfın yapıcı metodunda g&amp;ouml;r&amp;uuml;leceği &amp;uuml;zere Star bileşenini Dependency Injection Container'dan istiyoruz. Dolayısıyla Star bileşeninin DI servislerine eklenmesi gerekiyor. Daha &amp;ouml;nceki bir yazımızda bu konuya değinmiştik ;) &lt;a href="/post/asp-net-core-a-nasil-merhaba-deriz" target="_blank"&gt;Nasıl yaparım diyorsanız buradaki yazıya bakmanızı &amp;ouml;nerebilirim&lt;/a&gt;&amp;nbsp;ama "işimi uzatma" derseniz de yapmanız gereken tek şey Startup sınıfındaki ConfigureServices metoduna aşağıdaki satırı eklemekten ibaret.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;services.AddTransient&amp;lt;IStar, Star&amp;gt;();&lt;/pre&gt;
&lt;p&gt;Bu ara hazırlıklardan sonra yeniden Razor tarafına d&amp;ouml;nelim ve Index sayfasının i&amp;ccedil;eriğini aşağıdaki gibi değiştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;@{
    ViewData["Title"] = "Space Traveler's Base";
}
@model List&amp;lt;StarModel&amp;gt; 

&amp;lt;div&amp;gt;
    &amp;lt;h1 class="display-4"&amp;gt;@ViewData["Title"]&amp;lt;/h1&amp;gt;
    &amp;lt;p&amp;gt;
        Today is @DateTime.Now.DayOfWeek ! Well, where do you want to go?
    &amp;lt;/p&amp;gt;
    &amp;lt;ul&amp;gt;
        @{
            foreach (var star in Model)
            {
                &amp;lt;li&amp;gt;@star.Name (@star.Distance) Light Year from Earth&amp;lt;/li&amp;gt;
            }
        }
    &amp;lt;/ul&amp;gt;
&amp;lt;/div&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bir &amp;ouml;nceki Razor &amp;ouml;rneğinden farklı olarak burada dikkat etmemiz gereken en &amp;ouml;nemli nokta @model ve Model enstr&amp;uuml;manları. @model direktifi ile sayfanın kullanacağı ViewModel nesnesini belirtiyoruz. Star sınıfındaki GetStars metodunun d&amp;ouml;n&amp;uuml;ş tipini d&amp;uuml;ş&amp;uuml;n&amp;uuml;nce bunun List&amp;lt;StarModel&amp;gt; olması son derece doğal. Başta yapılan bu işaretleme, sayfanın devamındaki Model değişkenlerinin List&amp;lt;StarModel&amp;gt; tipinden bir referans olacağını belirtmekte. Bu nedenle for d&amp;ouml;ng&amp;uuml;s&amp;uuml; i&amp;ccedil;erisinde @star ifadesinden sonra StarModel nesnesinin &amp;ouml;zelliklerine erişebiliyoruz. Model nesnesini kimin doldurduğu sorusunun cevabını ise HomeController sınıfının Index metodundaki View &amp;ccedil;ağrısı vermekte.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Yaptığımız &amp;ouml;rnek MVC tarafına daha uygun. @model direktifi bu &amp;ouml;rnekte bir veri nesnesini&amp;nbsp;referans ediyorken Razor Pages yapısında code-behind dosyasında yer alan&lt;em&gt;(Index.cshtml.cs gibi)&lt;/em&gt; bir sınıf işaret edilir. Bir başka deyişle @ ile kullanılan built-in direktiflerin se&amp;ccedil;ilen web geliştirme &amp;ccedil;atısına g&amp;ouml;re farklılıklar g&amp;ouml;stermesi olasıdır.&amp;nbsp;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Yaptığımız bu son değişikliklere g&amp;ouml;re &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/hellomvc_13.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Fark ettiyseniz Razor s&amp;ouml;z dizimi olduk&amp;ccedil;a kolay.&amp;nbsp;G&amp;ouml;rselliği basit dokunuşlarla artırmak da m&amp;uuml;mk&amp;uuml;n.&amp;nbsp;Yardımcı takılara&lt;em&gt;(Tag Helper)&lt;/em&gt;&amp;nbsp;değinmeden &amp;ouml;nce dilerseniz sayfamızı aşağıdaki şekilde yeniden d&amp;uuml;zenleyelim.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;@{
    ViewData["Title"] = "Space Traveler's Base";
}
@model List&amp;lt;StarModel&amp;gt;

&amp;lt;div&amp;gt;
    &amp;lt;h1 class="display-4"&amp;gt;@ViewData["Title"]&amp;lt;/h1&amp;gt;
    &amp;lt;p&amp;gt;
        Today is @DateTime.Now.DayOfWeek ! Well, where do you want to go?
    &amp;lt;/p&amp;gt;
    &amp;lt;table class="table table-dark"&amp;gt;
        &amp;lt;thead class="bg-primary"&amp;gt;
            &amp;lt;tr&amp;gt;
                &amp;lt;th&amp;gt;
                    No
                &amp;lt;/th&amp;gt;
                &amp;lt;th&amp;gt;
                    Name
                &amp;lt;/th&amp;gt;
                &amp;lt;th&amp;gt;
                    Distance (LY)
                &amp;lt;/th&amp;gt;
                &amp;lt;th&amp;gt;
                    Surface Temperature (Kelvin)
                &amp;lt;/th&amp;gt;
            &amp;lt;/tr&amp;gt;
        &amp;lt;/thead&amp;gt;
        &amp;lt;tbody&amp;gt;
            @foreach (var star in Model)
            {
                &amp;lt;tr&amp;gt;
                    &amp;lt;td&amp;gt;
                        &amp;lt;label&amp;gt;@star.ID&amp;lt;/label&amp;gt;
                    &amp;lt;/td&amp;gt;
                    &amp;lt;td&amp;gt;
                        &amp;lt;label class="font-weight-bold"&amp;gt;@star.Name&amp;lt;/label&amp;gt;
                    &amp;lt;/td&amp;gt;
                    &amp;lt;td&amp;gt;
                        &amp;lt;label class="font-italic"&amp;gt;@star.Distance&amp;lt;/label&amp;gt;
                    &amp;lt;/td&amp;gt;
                    &amp;lt;td&amp;gt;
                        &amp;lt;label&amp;gt;@star.SurfaceTemperature&amp;lt;/label&amp;gt;
                    &amp;lt;/td&amp;gt;
                &amp;lt;/tr&amp;gt;
            }
        &amp;lt;/tbody&amp;gt;
    &amp;lt;/table&amp;gt;
&amp;lt;/div&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu sefer HTML Table elementini işin i&amp;ccedil;erisine kattık. Sonu&amp;ccedil; biraz daha&amp;nbsp;umut verici. En azından benim i&amp;ccedil;in ;)&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/hellomvc_14.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şu ana kadar yaptıklarımızla Razor s&amp;ouml;z dizimini en temel haliyle tanıdık ve bir Razor sayfasını &amp;ccedil;alışacağı &amp;ouml;rnek bir Model ile nasıl bağlayacağımızı &amp;ouml;ğrendik. Bilmemiz gereken giriş seviye konulardan bir diğeri de Tag Helper kullanımıdır.&amp;nbsp;Tag Helper ifadeleri giriş kontrollerinde&lt;em&gt;(input)&lt;/em&gt;, veri doğrulamasında&lt;em&gt;(validation)&lt;/em&gt;, y&amp;ouml;nlendirmelerde&lt;em&gt;(routing) &lt;/em&gt;ve&amp;nbsp;form ektileşimlerinde&lt;em&gt;(actions)&lt;/em&gt;&amp;nbsp;kullanılabilen basitleştirici ifadeler olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Normalde HTML Helper'lar s&amp;ouml;z konusudur ve Visual Studio edit&amp;ouml;r&amp;uuml;n&amp;uuml;n Scaffolding mekanizması otomatik View &amp;uuml;retimlerinde ağırlıklı olarak @Html.DisplayNameFor, @Html.DisplayFor ve @Html.ActionLink gibi fonksiyon &amp;ccedil;ağrımlarını kullandırır. Ancak son yıllarda&amp;nbsp;yardımcı takı ifadeleri hem okunabilir olmaları hem de bir HTML elementine doğrudan&amp;nbsp;ataşlanabilmeleri sebebiyle &amp;ouml;ne &amp;ccedil;ıkmaktadır. HTML Helper'lar bazen okunması zor fonksiyon ifadelerinden oluşur.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Şimdi Home klas&amp;ouml;r&amp;uuml; altına Add isimli bir View ekleyelim. Galaksi veritabanımıza yıldız eklemek i&amp;ccedil;in kullanılan basit bir form olduğunu d&amp;uuml;ş&amp;uuml;nebiliriz. Bu form i&amp;ccedil;erisinde de bazı&amp;nbsp;yardımcı takılardan faydalanacağız.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;@{
    ViewData["Title"] = "Space Traveler's Base";
}
@section scripts{
    &amp;lt;partial name="_ValidationScriptsPartial" /&amp;gt;
}
@model StarModel

&amp;lt;div&amp;gt;
    &amp;lt;form asp-controller="Home" asp-action="OnSave" method="post"&amp;gt;
        &amp;lt;div class="form-group"&amp;gt;
            &amp;lt;label asp-for="@Model.ID"&amp;gt;&amp;lt;/label&amp;gt;&amp;lt;br /&amp;gt;
            &amp;lt;input asp-for="@Model.ID" /&amp;gt;&amp;lt;br /&amp;gt;
            &amp;lt;span asp-validation-for="@Model.ID" class="text-danger"&amp;gt;&amp;lt;/span&amp;gt;
        &amp;lt;/div&amp;gt;
        &amp;lt;div class="form-group"&amp;gt;
            &amp;lt;label asp-for="@Model.Name"&amp;gt;&amp;lt;/label&amp;gt;&amp;lt;br /&amp;gt;
            &amp;lt;input asp-for="@Model.Name" /&amp;gt;&amp;lt;br /&amp;gt;
            &amp;lt;span asp-validation-for="@Model.Name" class="text-danger"&amp;gt;&amp;lt;/span&amp;gt;
        &amp;lt;/div&amp;gt;
        &amp;lt;div class="form-group"&amp;gt;
            &amp;lt;label asp-for="@Model.Distance"&amp;gt;&amp;lt;/label&amp;gt;&amp;lt;br /&amp;gt;
            &amp;lt;input asp-for="@Model.Distance" /&amp;gt;&amp;lt;br /&amp;gt;
            &amp;lt;span asp-validation-for="@Model.Distance" class="text-danger"&amp;gt;&amp;lt;/span&amp;gt;
        &amp;lt;/div&amp;gt;
        &amp;lt;div class="form-group"&amp;gt;
            &amp;lt;label asp-for="@Model.SurfaceTemperature"&amp;gt;&amp;lt;/label&amp;gt;&amp;lt;br /&amp;gt;
            &amp;lt;input asp-for="@Model.SurfaceTemperature" /&amp;gt;&amp;lt;br /&amp;gt;
            &amp;lt;span asp-validation-for="@Model.SurfaceTemperature" class="text-danger"&amp;gt;&amp;lt;/span&amp;gt;
        &amp;lt;/div&amp;gt;
        &amp;lt;div class="form-group"&amp;gt;
            &amp;lt;button class="btn-primary" type="submit"&amp;gt;Save&amp;lt;/button&amp;gt;
        &amp;lt;/div&amp;gt;
    &amp;lt;/form&amp;gt;
&amp;lt;/div&amp;gt;&lt;/pre&gt;
&lt;p&gt;asp- şeklinde başlayan ifadeler tag helper bildirimleridir. &amp;Ouml;rneğin form elementinde asp-controller ve asp-action isimli iki yardımcı kullanılmıştır. Bildiğiniz &amp;uuml;zere bir web formunu sunucu tarafına g&amp;ouml;nderirken form elementinden yararlanılır. Submit tipinden bir butona basıldığında hangi Controller'ın hangi Action fonksiyonunun devreye gireceğini bu yardımcı takılar ile belirleyebiliriz. Buna g&amp;ouml;re HomeController'ın OnSave isimli metodu &amp;ccedil;ağıralacaktır.&lt;/p&gt;
&lt;p&gt;Kullanılan bir diğer yardımcı takı ise asp-for'dur. Kullanıldığı HTML elemanına g&amp;ouml;re farklı davranışlar sergileyebilir. Bir label ile ilişkilendirildiğinde&amp;nbsp;ViewModel nesnesinin varsa Display&amp;nbsp;değerini, yoksa &amp;ouml;zellik adını kullanır. input elementi ile kullanıldığında ise ekrandan girilen i&amp;ccedil;eriğin modelin hangi &amp;ouml;zelliğine bağlanacağını belirtir. Sayfada bazı doğrulama kontrolleri de s&amp;ouml;z konusudur. Girdi ihlallerine ait bilgiler span elementleri i&amp;ccedil;erisinde yazılırken asp-validation-for isimli yardımcı takı kullanılmıştır. Buna g&amp;ouml;re takriben aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer bir sonu&amp;ccedil; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/hellomvc_15.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Konumuz giriş verilerinin kontrol&amp;uuml; değil&amp;nbsp;bu nedenle &amp;ccedil;ok fazla detaya girmiyoruz. Lakin &amp;ouml;rnekte kullandığımız sayfanın HTML &amp;ccedil;ıktısına bakarsak asp-validation-for bilgilerinin istemci bazlı doğrulama işlemlerinde kullanılan jQuery i&amp;ccedil;in data-val-*&amp;nbsp;formatına evrildiğini de g&amp;ouml;rebiliriz. &amp;Ouml;rneğin Name input kontrol i&amp;ccedil;in &amp;uuml;&amp;ccedil; karakterden az olmaması gerektiğini ifade etmiştik ya da d&amp;uuml;nyaya olan uzaklığın sıfır ışık yılı olmayacağını. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nden de fark edileceği &amp;uuml;zere tek bir asp-for-validation bildirimi HTML &amp;ccedil;ıktısında data-val, data-val-minlength, data-val-minlength-min, data-val-required şeklinde &amp;ccedil;&amp;ouml;z&amp;uuml;mlenmiştir. Bunların bir kısmının da ViewModel nesnesinde kullandığımız DataAnnotations niteliklerinden&lt;em&gt;(Attribute kullanımlarına bakın)&lt;/em&gt; kaynaklandığını ifade edebiliriz. Dolayısıyla Razor tarafındaki bir tag helper'ın işi nasıl kolaylaştırdığını net bir şekilde g&amp;ouml;rm&amp;uuml;ş oluyoruz&lt;em&gt; (Blazor tarafında doğrulama i&amp;ccedil;in asp-validaton-for yerine ValiadationMessage elementi kullanılmaktadır. S&amp;ouml;z dizimi şuna benzer; &amp;lt;ValidationMessage For="@(()=&amp;gt;Model.Name)" /&amp;gt; )&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Mayis/hellomvc_16.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Razor tarafında kullanılan pek &amp;ccedil;ok yardımcı takı var. Bir tanesini daha &amp;ouml;rneğe eklemeye ne dersiniz? S&amp;ouml;z gelimi yıldızların dahil olduğu birka&amp;ccedil; galaksiyi bir Enum sabiti olarak tuttuğunuzu ve yeni yıldız eklerken de bunları bir select elementinde g&amp;ouml;stermek istediğinizi d&amp;uuml;ş&amp;uuml;n&amp;uuml;n. Bunun i&amp;ccedil;in asp-items isimli yardımcı takıyı kullanabilirsiniz. Haydi bir deneyin ;) Buna ek olarak geliştirdiğimiz yıldız ekleme sayfasını HTML Helper fonksiyonları ile tekrardan yazmaya &amp;ccedil;alışın ve Tag Helper'lar ile aradaki farklılıkları kıyaslayın.&lt;/p&gt;
&lt;p&gt;Başta da belirttiğimiz gibi &amp;ouml;nce Razor sonra Blazor. Hatta &amp;ouml;nce Razor sonra MVC, sonra Razor Pages ve daha sonra Blazor :) Nitekim bu &amp;ccedil;atılar kendileri i&amp;ccedil;in ortak olsa da Razor View Engine'i farklı şekilde kullanmaktalar. &amp;Ouml;rneğin MVC tarafında Razor sayfalarına yapılan y&amp;ouml;nlendirmeler Controller tarafından ele alınırken, Razor Pages yapısında pages klas&amp;ouml;r&amp;uuml; altındaki sayfalara fiziki bir y&amp;ouml;nlendirme s&amp;ouml;z konusudur. S&amp;ouml;z gelimi pages/space/star.cshtml şeklinde bir sayfamız varsa, bu sayfaya &amp;ccedil;alışma zamanında /space/start şeklinde ulaşabiliriz. Hatta Razor Pages tarafında sayfalar genellikle .cshtml ve .cshtml.cs şeklinde ikiye ayrılır ki bu kurguyu benim gibi Asp.Net Web Forms &amp;ccedil;ağından gelenler iyi bilir. Ama en nihayetinde hepsinin altında yatan temel olgu Razor View Engine kullanımıdır.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bu kısa &amp;ccedil;alışmada&amp;nbsp;MVC, Blazor ve Razor Pages gibi &amp;ccedil;atıların temel yapıtaşı olan Razor View Engine tarafını basit&amp;ccedil;e anlamaya &amp;ccedil;alıştık. Artık bunun &amp;uuml;st&amp;uuml;ne daha zengin&amp;nbsp;Web uygulama &amp;ouml;rnekleri geliştirebileceğinizi d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize sağlıklı g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2021-05-02 21:30:00</pubDate>
  <slug>asp-net-core-once-razor-sonra-blazor</slug>
  <tags>
    <tag>aspnet-5</tag>
    <tag>aspnet-core</tag>
    <tag>razor</tag>
    <tag>c#</tag>
    <tag>cshtml</tag>
    <tag>tag-helper</tag>
    <tag>razor-pages</tag>
  </tags>
  <categories>
    <category>Asp.Net Core</category>
  </categories>
</post>