<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net Web API Üzerinden Resim Döndürmek</title>
  <description>Bu yazımızda Asp.Net Web API üzerinden, SQL tablolarında binary formatta tutulabilen resim içeriklerini nasıl çekebileceğimizi basit bir örnek ile incelemeye çalışıyor olacağız. Örneğimizin özel yanlarından birisi de kısa süre önce yayınlanan Visual Studio 2013 Preview ile geliştirilecek olması. Önce senaryomuza bir bakalım...</description>
  <content>&lt;p&gt;&lt;a href="/pics/Road-Runner-Wile-E-Coyote-looney-tunes-5226561-1024-768.jpg"&gt;&lt;img style="margin: 4px 0px; display: inline; float: right;" title="Road-Runner-Wile-E-Coyote-looney-tunes-5226561-1024-768" src="/pics/Road-Runner-Wile-E-Coyote-looney-tunes-5226561-1024-768_thumb.jpg" alt="Road-Runner-Wile-E-Coyote-looney-tunes-5226561-1024-768" width="300" height="225" align="right" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Eminim &amp;ccedil;ocukken &amp;ccedil;izgi filmlerle aranız vardı. Hatta &amp;ccedil;oğumuz yaşı ka&amp;ccedil; olursa olsun &amp;ccedil;izgi filmlere arada sırada da olsa zaman ayırmakta. &lt;em&gt;(Ben Batman g&amp;ouml;rd&amp;uuml;m m&amp;uuml; p&amp;uuml;r dikkat izlerim &amp;ouml;rneğin) &lt;/em&gt;Keza pek &amp;ccedil;ok b&amp;uuml;y&amp;uuml;ğ&amp;uuml;m&amp;uuml;z de, eskiden izlediği &amp;ccedil;izgi filmler ile karşılaştığında taaaa &amp;ccedil;ocukluk yıllarına kadar gidip aynı o zamanki gibi i&amp;ccedil;ten g&amp;uuml;lebiliyorlar da&lt;em&gt;(Rahmetli babamdan bilirim)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Aslına bakarsanız bazen teknoloji de bizi aynen bu mantıkta epeyce g&amp;uuml;ld&amp;uuml;rebiliyor. &amp;Ouml;rneğin &lt;strong&gt;Microsoft&lt;/strong&gt;&amp;rsquo; un &amp;uuml;r&amp;uuml;nlerini d&amp;uuml;ş&amp;uuml;nelim. &lt;em&gt;(Ger&amp;ccedil;i &amp;ccedil;ok fazlalar ama gene de d&amp;uuml;ş&amp;uuml;nmeye &amp;ccedil;alışalım)&lt;/em&gt; S&amp;uuml;rekli yenilikler &amp;ccedil;ıkartıyorlar, s&amp;uuml;rekli verisyon atlatıyorlar ve işin en acı tarafı da koşan &lt;a href="https://eksisozluk.com/road-runner--32627" target="_blank"&gt;Road Runner&lt;/a&gt;&amp;rsquo; a benziyorlar. Biz mi? Biz ise &lt;strong&gt;Road Runner&lt;/strong&gt;&amp;rsquo; ı her fırsatta yakalamaya &amp;ccedil;alışıp yakaladığını zanneden ama son anda hep elinden ka&amp;ccedil;ıran &lt;a href="https://eksisozluk.com/coyote--51208" target="_blank"&gt;Coyote&lt;/a&gt;&amp;rsquo; ye &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_100.png" alt="Smile" /&gt; Bence bu senaryoda developer&amp;rsquo; lar biraz daha şanslı. Ya benim gibi d&amp;uuml;zenli blog tutmaya &amp;ccedil;alışanlar napsınlar &lt;img class="wlEmoticon wlEmoticon-disappointedsmile" style="border-style: none;" src="/pics/wlEmoticon-disappointedsmile_7.png" alt="Disappointed smile" /&gt;&amp;nbsp; &lt;/p&gt;
&lt;p&gt;S&amp;ouml;z&amp;uuml; fazla uzatmadan ve moralimizi daha da bozmadan konumuza ge&amp;ccedil;elim.&lt;/p&gt;
&lt;p&gt;Bu yazımızda &lt;strong&gt;Asp.Net Web API&lt;/strong&gt; &amp;uuml;zerinden, &lt;strong&gt;SQL&lt;/strong&gt; tablolarında &lt;strong&gt;binary&lt;/strong&gt; formatta tutulabilen resim i&amp;ccedil;eriklerini nasıl &amp;ccedil;ekebileceğimizi basit bir &amp;ouml;rnek ile incelemeye &amp;ccedil;alışıyor olacağız. &amp;Ouml;rneğimizin &amp;ouml;zel yanlarından birisi de kısa s&amp;uuml;re &amp;ouml;nce yayınlanan &lt;strong&gt;&lt;a href="http://www.microsoft.com/visualstudio/tur/2013-downloads" target="_blank"&gt;Visual Studio 2013 Preview&lt;/a&gt;&lt;/strong&gt; ile geliştirilecek olması. &amp;Ouml;nce senaryomuza bir bakalım.&lt;/p&gt;
&lt;h1&gt;Senaryo&lt;/h1&gt;
&lt;p&gt;Uzun zamandır uğramadığımız hatta pek &amp;ccedil;ok gen&amp;ccedil; arkadaşımızın belki de adını bile duymadığı bir &lt;strong&gt;Microsoft&lt;/strong&gt; veritabanını ele alıyor olacağız. &lt;strong&gt;Pubs&lt;/strong&gt;, &lt;strong&gt;SQL 2000 &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml;nde sıklıkla &lt;strong&gt;Northwind&lt;/strong&gt; ile birlikte andığımız kobay veritabanlarından birisidir &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_100.png" alt="Smile" /&gt; Bu veritabanında yayıncılara ait bazı bilgiler yer almaktadır. &amp;Ouml;rneğin &lt;strong&gt;pub_info&lt;/strong&gt; isimli tablo i&amp;ccedil;erisinde &lt;strong&gt;pub_id, logo&lt;/strong&gt; ve pr_&lt;strong&gt;info&lt;/strong&gt; isimli 3 adet alan yer almaktadır. Bu alanlardan &lt;strong&gt;logo&lt;/strong&gt; tahmin edileceği &amp;uuml;zere &lt;strong&gt;Binary&lt;/strong&gt; veri tipindedir ve yayıncının firma logosunu tutmaktadır.&lt;/p&gt;
&lt;p&gt;Hedefimiz bu &lt;strong&gt;binary&lt;/strong&gt; i&amp;ccedil;erikleri&lt;em&gt;(yani logoları)&lt;/em&gt; bir &lt;strong&gt;Web API&lt;/strong&gt; fonksiyonu &amp;uuml;zerinden geriye d&amp;ouml;nd&amp;uuml;rebilmek ve hatta en azından tarayıcı pencresinde resim formatında g&amp;ouml;sterebilmek olacaktır. O halde projeyi a&amp;ccedil;arak ilk adımımız atalım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wapigi_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wapigi_1" src="/pics/wapigi_1_thumb.png" alt="wapigi_1" width="498" height="266" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;h1&gt;Projenin Oluşturulması&lt;/h1&gt;
&lt;p&gt;İlk olarak yeni bir &lt;strong&gt;Web&lt;/strong&gt; uygulaması oluşturarak işe başlayabiliriz. Pek tabi &lt;strong&gt;Visual Studio 2013 preview&lt;/strong&gt; i&amp;ccedil;erisinde g&amp;ouml;r&amp;uuml;nen &amp;ouml;nemli &amp;ouml;zelliklerden birisi de &lt;strong&gt;One Asp.Net&lt;/strong&gt; yeteneğidir. Buna g&amp;ouml;re tek bir &lt;strong&gt;Web&lt;/strong&gt; uygulaması şablonu &amp;uuml;zerinden hareket edilerek istenen kabiliyetlere g&amp;ouml;re se&amp;ccedil;imler yapılması sağlanmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wapigi_2.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wapigi_2" src="/pics/wapigi_2_thumb.png" alt="wapigi_2" width="469" height="203" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Doğruyu s&amp;ouml;ylemek gerekirse Asp.Net tarafındaki proje şablonlarının artması kafa karışıklıkları yanında bir arada kullanmak istediğimiz kabiliyetler olduğunda da sıkıntı yaratmaktaydı. Umarız bu &amp;ouml;zellik baki olur ve daha da iyileştirilir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;Asp.Net Web Application&lt;/strong&gt; se&amp;ccedil;imi sonrasında karşımıza gelen pencereden &lt;strong&gt;Empty&lt;/strong&gt; &lt;strong&gt;template&lt;/strong&gt; tipini se&amp;ccedil;ip &lt;strong&gt;Web API&lt;/strong&gt; &amp;ouml;zelliğini etkineleştirebiliriz. Ya da &lt;strong&gt;Web API&lt;/strong&gt; &amp;ouml;zelliğini işaretleyip ilerleyebiliriz. Ben m&amp;uuml;mk&amp;uuml;n mertebe sade bir ortam arzu ettiğimden &lt;strong&gt;Empty&lt;/strong&gt; template se&amp;ccedil;ip &lt;strong&gt;Web API &lt;/strong&gt;kutusunu işaretledim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wapigi_3.png"&gt;&lt;img style="display: inline;" title="wapigi_3" src="/pics/wapigi_3_thumb.png" alt="wapigi_3" width="640" height="398" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemler sonucunda solution ve proje i&amp;ccedil;eriği aşağıdaki gibi oluşacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wapigi_4.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wapigi_4" src="/pics/wapigi_4_thumb.png" alt="wapigi_4" width="315" height="284" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;h1&gt;Modelin Eklenmesi&lt;/h1&gt;
&lt;p&gt;İzleyen adımda modelimizi ilave etmemiz gerekiyor. Tahmin edeceğiniz gibi &lt;strong&gt;Entity Framework&lt;/strong&gt; den yararlanıyor olacağız. Projeye yeni bir &amp;ouml;ğe olarak &lt;strong&gt;Ado.Net Entity Data Model&lt;/strong&gt; nesnesi ekledikten sonra klasik adımlarımızla ilerliyoruz&lt;em&gt;(Model klas&amp;ouml;r&amp;uuml; altına ekleyebilirsiniz)&lt;/em&gt; Lakin &lt;strong&gt;Visual Studio 2013 Preview&lt;/strong&gt;&amp;rsquo; a has bir &amp;ouml;zellik olarak &lt;strong&gt;Entity Framework&lt;/strong&gt; versiyonunu se&amp;ccedil;ebileceğimiz bir ekranla karşılaşacağız&lt;em&gt;(Sanırım Entity Framework tarafı kadar hızlı versiyon atlatan &amp;uuml;r&amp;uuml;n sayısı nadirdir)&lt;/em&gt; Ben &lt;strong&gt;6.0&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; se&amp;ccedil;tim ve bunun sonucu olarak &lt;strong&gt;Beta 1&amp;rsquo;&lt;/strong&gt; in k&amp;uuml;t&amp;uuml;phane olarak ilave edildiğini fark ettim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wapigi_5.png"&gt;&lt;img style="display: inline;" title="wapigi_5" src="/pics/wapigi_5_thumb.png" alt="wapigi_5" width="367" height="215" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;İzleyen kısımda sadece &lt;strong&gt;pub_info&lt;/strong&gt; tablosunun eşleniği olan &lt;strong&gt;entity&lt;/strong&gt; &amp;uuml;retimini yaptırmamız yeterlidir. &lt;em&gt;(Diğer tablolaraı dilersenize ekleyebilirsiniz ancak şu anki senaryomuz i&amp;ccedil;in &amp;ccedil;ok da gerekli değiller)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wapigi_6.png"&gt;&lt;img style="display: inline;" title="wapigi_6" src="/pics/wapigi_6_thumb.png" alt="wapigi_6" width="539" height="542" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;h1&gt;Controller Tipinin Yazılması&lt;/h1&gt;
&lt;p&gt;&lt;strong&gt;Web API&lt;/strong&gt;&amp;rsquo; nin temel yapı taşı olan &lt;strong&gt;Controller &lt;/strong&gt;tipini ekleyerek &amp;ouml;rneğimize devam edelim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wapigi_7.png"&gt;&lt;img style="display: inline;" title="wapigi_7" src="/pics/wapigi_7_thumb.png" alt="wapigi_7" width="463" height="323" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Web API&lt;/strong&gt; controller sınıfı i&amp;ccedil;in iki farklı versiyon bulunmaktadır. &lt;em&gt;(Ben &lt;strong&gt;v1&lt;/strong&gt;&amp;rsquo;i se&amp;ccedil;erek ilerledim ama bunu yaparken iki versiyon arasındaki farkı tam olarak bilmediğimi itiraf etmek isterim &lt;img class="wlEmoticon wlEmoticon-embarrassedsmile" style="border-style: none;" src="/pics/wlEmoticon-embarrassedsmile_7.png" alt="Embarrassed smile" /&gt;)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;LogosController sınıfı i&amp;ccedil;eriği&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic; 
using System.IO; 
using System.Linq; 
using System.Net; 
using System.Net.Http; 
using System.Net.Http.Headers; 
using System.Web.Http; 
using WebApplication4.Models;

namespace WebApplication4.Controllers 
{ 
    public class LogosController 
        : ApiController 
    { 
        public List&amp;lt;string&amp;gt; Get() 
        { 
            List&amp;lt;string&amp;gt; pubIds = null; 
            using (PubsEntities _context = new PubsEntities()) 
            { 
                pubIds = (from p in _context.pub_info 
                          select p.pub_id).ToList(); 
            } 
            return pubIds; 
        } 
        public HttpResponseMessage Get(string id) 
        { 
            HttpResponseMessage response = null;

            using (PubsEntities _context = new PubsEntities()) 
            { 
                var pubPicture = (from p in _context.pub_info 
                                       where p.pub_id == id 
                                       select p.logo).FirstOrDefault(); 
                if (pubPicture==null) 
                { 
                    response = new HttpResponseMessage(HttpStatusCode.NotFound); 
                } 
                else 
                { 
                    MemoryStream ms = new MemoryStream(pubPicture); 
                    response = new HttpResponseMessage(HttpStatusCode.OK); 
                    response.Content = new StreamContent(ms); 
                    response.Content.Headers.ContentType = new MediaTypeHeaderValue("image/png"); 
                } 
            } 
            return response; 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;LogosController&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde iki adet &lt;strong&gt;Get&lt;/strong&gt; metodu bulunmaktadır. İstemci tarafından gelecek &lt;strong&gt;HTTP&lt;/strong&gt; &lt;strong&gt;Get&lt;/strong&gt; taleplerine cevap verecek olan bu fonksiyonlardan birisi &lt;strong&gt;pub_info&lt;/strong&gt; tablosundaki &lt;strong&gt;pub_id&lt;/strong&gt; alanlarını liste olarak d&amp;ouml;nd&amp;uuml;rmektedir. Diğer yandan senaryomuzun can alıcı &lt;strong&gt;Get&lt;/strong&gt; metodu ise, &lt;strong&gt;HttpResponseMessage&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneğini d&amp;ouml;nd&amp;uuml;rmektedir. Bu metod parametre olarak &lt;strong&gt;string&lt;/strong&gt; tipinden olan bir &lt;strong&gt;pub_id&lt;/strong&gt; değerini alır. İlgili alana eş satırın &lt;strong&gt;logo&lt;/strong&gt; i&amp;ccedil;eriğini bulur&lt;em&gt;(eğer varsa)&lt;/em&gt;. Bu i&amp;ccedil;eriğin &lt;strong&gt;byte[]&lt;/strong&gt; tipinden olan karşılığı bir &lt;strong&gt;MemoryStream &lt;/strong&gt;referansından yararlanılarak &lt;strong&gt;HttpResponseMessage&lt;/strong&gt; &amp;ouml;rneğinin &lt;strong&gt;Content&lt;/strong&gt; &amp;ouml;zelliğine set edilir.&lt;/p&gt;
&lt;p&gt;Bundan sonra yapılması gereken, istemciye d&amp;ouml;necek cevap i&amp;ccedil;eriğinin bir &lt;strong&gt;image&lt;/strong&gt; olduğunu belirtmektir. &lt;strong&gt;Headers.&lt;/strong&gt;&lt;strong&gt;ContentType&lt;/strong&gt; &amp;ouml;zelliğine bir &lt;strong&gt;MediaTypeHeaderValue&lt;/strong&gt; &amp;ouml;rneğinin atanmasının ve parametre olarak &lt;strong&gt;image/png&lt;/strong&gt; verilmesinin sebebi de budur. &amp;Ccedil;ok doğal olarak ilgili &lt;strong&gt;id&lt;/strong&gt; değeri yanlış girilebilir ve &lt;strong&gt;LINQ&lt;/strong&gt; sorgusu bu durumda &lt;strong&gt;null&lt;/strong&gt; değer &amp;uuml;retebilir. &lt;strong&gt;Null&lt;/strong&gt; değer kontrol&amp;uuml; yapılarak b&amp;ouml;yle bir vaka oluşması halinde&lt;strong&gt; HTTP 404 Not Found&lt;/strong&gt; istisnasının d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi de sağlanmaktadır&lt;em&gt;(Web&amp;rsquo; in doğasına ve isteğine uygun şekilde &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_210.png" alt="Winking smile" /&gt; )&lt;/em&gt;&lt;/p&gt;
&lt;h1&gt;Testler&lt;/h1&gt;
&lt;p&gt;Uygulama kodunun tamamlanmasını m&amp;uuml;teakip test &amp;ccedil;alışmalarına başlanabilir. Her hangi bir tarayıcı uygulama ile bu işlemi yapabiliriz&lt;em&gt;(Ben tercihimi Google Chrome&amp;rsquo; dan yana kullandım &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_100.png" alt="Smile" /&gt; )&lt;/em&gt; &amp;Ouml;rneğin &lt;strong&gt;api/logos&lt;/strong&gt; şeklinde bir talepte bulunulduğunda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne benzer olacak şekilde &lt;strong&gt;pub_id&lt;/strong&gt; bilgilerinin elde edildiği g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;a&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wapigi_8" src="/pics/wapigi_8_thumb.png" alt="wapigi_8" width="578" height="278" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Eğer belirli bir &lt;strong&gt;pub_id&lt;/strong&gt; değeri i&amp;ccedil;in talepte bulunulursa asıl istediğimiz sonu&amp;ccedil;lara ulaşırız. Yani yayıncının logosuna &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_210.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;api/logos/0736&lt;/strong&gt; i&amp;ccedil;in aşağıdaki sonu&amp;ccedil; elde edilirken&lt;/p&gt;
&lt;p&gt;&lt;a&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wapigi_9" src="/pics/wapigi_9_thumb.png" alt="wapigi_9" width="364" height="80" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;api/logos/1756&lt;/strong&gt; i&amp;ccedil;in&lt;/p&gt;
&lt;p&gt;&lt;a&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wapigi_10" src="/pics/wapigi_10_thumb.png" alt="wapigi_10" width="358" height="86" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;sonucu elde edilir. &amp;Ccedil;ok doğal olarak olmayan bir pub_id i&amp;ccedil;in istemci tarafında HTTP 404 hatası d&amp;ouml;necektir.&lt;/p&gt;
&lt;h1&gt;Daha Neler Yapılabilir ve Size Kalan&lt;/h1&gt;
&lt;p&gt;Senaryomuz sadece yayın evinin logosunu ve yayın evi numaralarını d&amp;ouml;nd&amp;uuml;recek fonksiyonelliklere sahip bir &lt;strong&gt;Asp.Net&lt;/strong&gt; &lt;strong&gt;Web API&lt;/strong&gt; hizmetini i&amp;ccedil;ermektedir. Ancak siz bu senaryoyu daha da geliştirebilirsiniz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;Ouml;rneğin &lt;strong&gt;jQuery&lt;/strong&gt; kullanarak yayıncıların listesinin logoları ile birlikte bir &lt;strong&gt;View&lt;/strong&gt;&amp;rsquo; da g&amp;ouml;r&amp;uuml;nmesini deneyebilirsiniz.&lt;/li&gt;
&lt;li&gt;Kuvvetle muhtemel yukarıdaki maddeyi bir &lt;strong&gt;MVC&lt;/strong&gt; projesinde denersiniz. Ama aynısını &lt;strong&gt;Web Forms&lt;/strong&gt; tabanlı bir uygulama i&amp;ccedil;in de yapmaya &amp;ccedil;alışabilirsiniz.&lt;/li&gt;
&lt;li&gt;Resimlerin g&amp;ouml;sterilmesi haricinde istemcilerin yine &lt;strong&gt;Asp.Net Web API&lt;/strong&gt;&amp;rsquo; den yararlanarak &lt;strong&gt;upload&lt;/strong&gt; etme işlemlerini yapabilmelerini de sağlayabilirsiniz &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_210.png" alt="Winking smile" /&gt; Bunu bir araştırmanızı &amp;ouml;neririm. &lt;strong&gt;POST&lt;/strong&gt; şeklinde bir talebi ele almanız gerektiğini ip ucu olarak verebilirim.&lt;/li&gt;
&lt;li&gt;Bir &amp;ouml;nceki maddede var olan kısmı birden fazla dosyayı bir seferde y&amp;uuml;kleme senaryosu i&amp;ccedil;in ele alabilirsiniz(Multiple Upload)&lt;/li&gt;
&lt;li&gt;B&amp;uuml;y&amp;uuml;k boyutlu resimleri par&amp;ccedil;a par&amp;ccedil;a atmayı veya okumayı deneyebilirsiniz.&lt;/li&gt;
&lt;li&gt;ve benim aklıma gelmeyen ama sizin ele alacağınız başka bir senaryo da s&amp;ouml;z konusu olabilir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere bir &lt;strong&gt;Asp.Net Web API&lt;/strong&gt; servisini resim i&amp;ccedil;eriklerinin elde edilmesini konu alan bir senaryo da kullanabildik. &amp;Ouml;rneğimizi yeni g&amp;ouml;z bebeğimiz &lt;strong&gt;Visual Studio 2013 Preview&lt;/strong&gt; &amp;uuml;zerinde geliştirmeye &amp;ccedil;alıştık ve b&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2013-07-02 13:08:00</pubDate>
  <slug>AspNet-Web-API-Uzerinden-Resim-Dondurmek</slug>
  <tags>
    <tag>aspnet-web-api</tag>
    <tag>http-get</tag>
    <tag>web-api</tag>
    <tag>get</tag>
    <tag>image-format</tag>
    <tag>httpresponsemessage</tag>
    <tag>httpstatuscode</tag>
    <tag>404</tag>
  </tags>
  <categories>
    <category>Asp.Net Web API</category>
  </categories>
</post>