<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net 2.0 için Site Map Kullanımı</title>
  <description>Bu makalemizde, web sitelerinde özellikle sayfalar arasındaki hareketlerde, kullanıcıların nerede olduklarını bilmelerine yardımcı olan site haritaları üzerinde duracağız. Bununla birlikte, site haritalarının Asp.Net 2.0' daki kullanım yollarından birisini sağlayan SiteMapPath sunucu kontrolünü kısaca incelemeye çalışacağız. Internet sitelerinin çoğu, pek çok web sayfasından oluşur. Bu sayfalar arasında her zaman için bir ilişki ve hiyerarşi söz konusudur. Dolayısıyla kullanıcılar, internet sitelerine ait sayfalarda gezinirken, onlara sitenin neresinde olduklarını göstermek ve bulundukları sayfaya nereden geldiklerini belirtmek, sitenin mantıksal ve anlamsam bütünlüğü açısından oldukça önemlidir.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bu makalemizde, web sitelerinde &amp;ouml;zellikle sayfalar arasındaki hareketlerde, kullanıcıların nerede olduklarını bilmelerine yardımcı olan site haritaları &amp;uuml;zerinde duracağız. Bununla birlikte, site haritalarının Asp.Net 2.0' daki kullanım yollarından birisini sağlayan SiteMapPath sunucu kontrol&amp;uuml;n&amp;uuml; kısaca incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;Internet sitelerinin &amp;ccedil;oğu, pek &amp;ccedil;ok web sayfasından oluşur. Bu sayfalar arasında her zaman i&amp;ccedil;in bir ilişki ve hiyerarşi s&amp;ouml;z konusudur. Dolayısıyla kullanıcılar, internet sitelerine ait sayfalarda gezinirken, onlara sitenin neresinde olduklarını g&amp;ouml;stermek ve bulundukları sayfaya nereden geldiklerini belirtmek, sitenin mantıksal ve anlamsam b&amp;uuml;t&amp;uuml;nl&amp;uuml;ğ&amp;uuml; a&amp;ccedil;ısından olduk&amp;ccedil;a &amp;ouml;nemlidir.&lt;/p&gt;
&lt;p&gt;Bu tarz bir kolaylığı kullanıcılara sağlayabilmek amacıyla &amp;ccedil;eşitli yollar kullanabiliriz. Kullanıcı tanımlı kontroller geliştirebilir, programatik olarak geliştirimiş teknikler uygulayabiliriz. Ancak Asp.net 2.0, bu tip navigasyon izleme işlemleri i&amp;ccedil;in, Xml tabanlı, esnek ve daha pratik bir yol sunmaktadır. Bu teknikteki anahtar noktalar, Site Map dosyası ile, SiteMapPath sunucu kontrol&amp;uuml;d&amp;uuml;r. Olayı daha iyi anlayabilmek amacıyla aşağıdaki hiyerarşik d&amp;uuml;zene sahip bir internet sitemizin olduğunu varsayalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk87_1.gif" alt="" width="326" height="398" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. Site Haritamız.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Burada g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ana sayfamız dallanarak &amp;ccedil;eşitli alt sayfalara doğru ilerlenmektedir. Şimdi, Film Dvdsi sayfamızda olduğumuzu d&amp;uuml;ş&amp;uuml;nelim. Burada kullanıcıya, nerede olduğu g&amp;ouml;stermek, son kullanıcı a&amp;ccedil;ısından olduk&amp;ccedil;a değerli bir bilgidir. Heleki web sitemiz y&amp;uuml;zlerce sayfa i&amp;ccedil;eriyoru ve sayfaların &amp;ccedil;oğu 3 yada daha fazla alt sayfaya mantıki olarak bağlanıyorsa &amp;ccedil;ok daha &amp;ouml;nemlidir. Ayrıca, kullanıcının bu sayfaya geldiği sayfalarada gitmesini kolayca sağlayacak linklerin olmasıda tercih nedenidir. İşte bu tip işlemleri ger&amp;ccedil;ekleştirmek i&amp;ccedil;in, şekilsel olarak ifade ettiğimiz bu haritayı, Xml ortamına taşımamız gerekmektedir. Bu iş i&amp;ccedil;in kullanılan Site Map tipindeki dosyalar, Asp.Net 2.0 i&amp;ccedil;in geliştirilmiş &amp;ouml;zel nitelikli dosyalar olup tamamıyla, site haritalama işlemlerine hizmet etmektedir. Şimdi &amp;ouml;ncelikli olarak yukarıdaki hiyerarşiye sahip sitemizi Visual Studio.Net 2005 ortamında oluşturalım. Her sayfamızı aşağıdaki isimler ile Solution' ımıza ekleyelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk87_2.gif" alt="" width="272" height="318" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. Azon internet sitemizin sayfaları.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Sıradaki işlemimiz web.sitemap dosyasını oluşturmak olacaktır. Bunun i&amp;ccedil;in Solution Explorer' da sağ tıklayıp Add New Item' i se&amp;ccedil;tikten sonra aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Site Map dosya tipini işaretlemeliyiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk87_3.gif" alt="" width="300" height="349" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. Site Map dosyamızı oluşturuyoruz.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Gelelim dosyamızın i&amp;ccedil;eriğine. Bu dosya Xml tabanlı bir dosya olup, siteMapNode takılarından oluşmaktadır. SiteMap takısı altında yer alan, siteMapNode takıları, site haritasındaki sayfaları &amp;ccedil;eşitli &amp;ouml;zellikleri ile birlikte belirtmektedir. Harita hiyerarşisine g&amp;ouml;re derinlerdeki sayfalara inilmek istendiğinde i&amp;ccedil; i&amp;ccedil;e ge&amp;ccedil;en siteMapNode takıları kullanılmalıdır. siteMapNode takıları temel olarak, url, description, title olmak &amp;uuml;zere 3 &amp;ouml;nemli &amp;ouml;zellik i&amp;ccedil;erir. Title ile sayfanın başlığı, description ile sayfaya ait a&amp;ccedil;ıklama ve url &amp;ouml;zelliği ilede sayfanın adresi belirtilmektedir. Şimdi, oluşturduğumuz web.sitemap dosyasına aşağıdaki Xml i&amp;ccedil;eriğini yazalım.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;siteMap&amp;gt;

    &amp;lt;siteMapNode url="default.aspx" title="Azon Kitap Cd Dvd" description="En iyi Kitaplar, Cdler, Dvdler bu siteden alınır."&amp;gt;
        &amp;lt;siteMapNode url="kitap.aspx" title="Kitaplar" description="Bilgisayar, hukuk ve tıp kitapları"&amp;gt;
            &amp;lt;siteMapNode url="IngilizceBilgisayar.aspx" title="Ingilizce Bilgisayar Kitapları" description="Ingilizce Bilgisayar Kitapları. Onlardan iyisi yok."/&amp;gt;
            &amp;lt;siteMapNode url="TurkceBilgisayar.aspx" title="T&amp;uuml;rk&amp;ccedil;e Bilgisayar Kitapları" description="T&amp;uuml;rk&amp;ccedil;e Bilgisayar Kitapları Zengin Arşivimiz ile Karşınızda."/&amp;gt;
            &amp;lt;siteMapNode url="Hukuk.aspx" title="Hukuk Kitapları" description="Hukuğu &amp;ouml;ğrenebileceğiniz en iyi kitaplar."/&amp;gt;
            &amp;lt;siteMapNode url="Tip.aspx" title="Tıp Kitapları" description="Tıp şakaya gelmez. En iyi tıp kitaplarını bizden alın."/&amp;gt;
    &amp;lt;/siteMapNode&amp;gt;

        &amp;lt;siteMapNode url="cd.aspx" title="CD ler" description="Film ve M&amp;uuml;zik Cd' leri."&amp;gt;
            &amp;lt;siteMapNode url="MuzikCd.aspx" title="M&amp;uuml;zik Cd' leri." description="Harika gruplar, harika alb&amp;uuml;mler."/&amp;gt;
            &amp;lt;siteMapNode url="FilmCd.aspx" title="Film Cd' leri." description="En g&amp;uuml;zel filmler."/&amp;gt;
        &amp;lt;/siteMapNode&amp;gt;

        &amp;lt;siteMapNode url="dvd.aspx" title="DVD ler" description="Film ve M&amp;uuml;zik DVD' leri."&amp;gt;
            &amp;lt;siteMapNode url="MuzikDvd.aspx" title="M&amp;uuml;zik DVD' leri." description="Harika gruplar, harika alb&amp;uuml;mler."/&amp;gt;
            &amp;lt;siteMapNode url="FilmDvd.aspx" title="Film DVD' leri." description="En g&amp;uuml;zel filmler &amp;ccedil;oklu dil destekleri ve m&amp;uuml;kemmel g&amp;ouml;r&amp;uuml;nt kaliteleriye Dvdlerde."/&amp;gt;
        &amp;lt;/siteMapNode&amp;gt; 

        &amp;lt;siteMapNode url="sitehakkinda.aspx" title="Site Hakkında" description="Kimiz ve size ne sağlıyoruz."/&amp;gt;

    &amp;lt;/siteMapNode&amp;gt;

&amp;lt;/siteMap&amp;gt;&lt;/pre&gt;
&lt;p&gt;Artık elimizde site haritamızın xml i&amp;ccedil;eriği mevcuttur. Şimdi bu Xml i&amp;ccedil;eriğini kullanacak olan sunucu kontrol&amp;uuml;m&amp;uuml;ze bakalım. SiteMapPath sunucu kontrol&amp;uuml;, bu xml i&amp;ccedil;eriğine bakarak site haritasını değerlendirir ve son kullanıcıya akıllı navigasyon izleme yeteneğini sağlar.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk87_4.gif" alt="" width="136" height="82" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. SiteMapPath sunucu kontrol&amp;uuml;.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdi, toolbox' taki navigation sekmesinde yer alan SiteMapPath sunucu kontrollerini &amp;ouml;rnek olarak T&amp;uuml;rkceBilgisayar.aspx sayfasına bırakalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk87_5.gif" alt="" width="406" height="162" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 5. Sunucu kontrol&amp;uuml;n&amp;uuml;n sayfaya eklenmesi sonrası.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, site haritamızdaki hiyarerşik d&amp;uuml;zene g&amp;ouml;re bu sayfaya hangi sayfalardan gelindiği a&amp;ccedil;ık&amp;ccedil;a g&amp;ouml;r&amp;uuml;lmektedir. Eğer bu noktada, TurkceBilgisayar.aspx sayfasını &amp;ccedil;alıştıracak olursak, "Kitaplar" ve "Azon Kitap Cd Dvd" linkleri ile, site haritasındaki &amp;uuml;st sayfalara &amp;ccedil;ıkılabileceğimizide g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Dilersek, SiteMapPath sunucu kontrol&amp;uuml;ne hazır g&amp;ouml;rsel formatlardan birisinide uygulayarak makyajlayabiliriz. Bunun i&amp;ccedil;in kontrol&amp;uuml;n sağında &amp;ccedil;ıkan ok işaretinden sonra yer alan Auto Format se&amp;ccedil;eneğine basmamız ve herhangibir formatı (&amp;ouml;rneğin Colorful) se&amp;ccedil;memiz yeterlidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk87_6.gif" alt="" width="565" height="94" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 6. Auto Format se&amp;ccedil;eneği.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk87_7.gif" alt="" width="606" height="294" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 7. Colorful se&amp;ccedil;eneği.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu makyajlama işlemi sonrası, SiteMapPath kontrol&amp;uuml;n&amp;uuml;n aspx sayfasındaki i&amp;ccedil;eriği aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:SiteMapPath ID="SiteMapPath1" Runat="server" Font-Size="0.8em" Font-Names="Verdana"
PathSeparator=" : "&amp;gt;
    &amp;lt;PathSeparatorStyle Font-Bold="True" ForeColor="#990000"&amp;gt;&amp;lt;/PathSeparatorStyle&amp;gt;
    &amp;lt;CurrentNodeStyle ForeColor="#333333"&amp;gt;&amp;lt;/CurrentNodeStyle&amp;gt;
    &amp;lt;NodeStyle Font-Bold="True" ForeColor="#990000"&amp;gt;&amp;lt;/NodeStyle&amp;gt;
    &amp;lt;RootNodeStyle Font-Bold="True" ForeColor="#FF8000"&amp;gt;&amp;lt;/RootNodeStyle&amp;gt;
&amp;lt;/asp:SiteMapPath&amp;gt;&lt;/pre&gt;
&lt;p&gt;Burada &amp;ouml;nemli olan &amp;ouml;zelliklerden birisi, SiteMapPath sunucu kontrol&amp;uuml;ne ait, PathSeperator' d&amp;uuml;r. Bu &amp;ouml;zellik ile, sayfalar arasındaki ayra&amp;ccedil; işareti belirtilmektedir. Burada &amp;uuml;st &amp;uuml;ste iki nokta kullanılmıştır. PathSeparatorStyle takısı ise, ayra&amp;ccedil; işaretinin font ve renk &amp;ouml;zelliklerini belirlemekte kullanılır. CurrentNodeStyle , kullanıcının o an bulunduğu sayfayı belirten node' un font ve renk &amp;ouml;zelliklerini belirlerken, NodeStyle &amp;uuml;st nodelara ait ve RootNodeStyle ana sayfaya ait font ve renk &amp;ouml;zelliklerini belirler.&lt;/p&gt;
&lt;p&gt;Şimdi, bu sayfaya uyguladığımız SiteMapPath sunucu kontroll&amp;uuml;n&amp;uuml; kopyalayalım ve diğer sayfalarımıza yapıştıralım. &amp;Ouml;rnek olarak bu kezde, MuzikDvd.aspx sayfamızı &amp;ccedil;alıştıralım. Bu sayfayı &amp;ccedil;alıştırdığımızda ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk87_8.gif" alt="" width="352" height="187" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 8. MuzikDvd sayfamız.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, Xml i&amp;ccedil;eriğinde belirttiğimiz description değeri burada ilgili sayfa i&amp;ccedil;in bir ipucu kutucuğu olarak ekrana &amp;ccedil;ıkmıştır. Diğer taraftan, altı &amp;ccedil;izili linklere tıklayarak &amp;uuml;st sayfalara hareket edebiliriz. &amp;Ouml;rneğin, Dvd ler linkine tıkladığımızda, Dvd.aspx sayfasına gideriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk87_9.gif" alt="" width="335" height="182" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 9. Dvd.aspx sayfasına ge&amp;ccedil;tik.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;SiteMapPath sunucu kontrol&amp;uuml; i&amp;ccedil;in &amp;ouml;enmli olan &amp;ouml;zelliklerden biriside, PathDirection' dır. Bu &amp;ouml;zellik, kontrol &amp;uuml;zerindeki hiyerarşinin root' tan current'a yada tam tersi istikamette olup olmayacağını belirtlir. Varsayılan olarak bir SiteMapPath kontrol&amp;uuml;n&amp;uuml;n y&amp;ouml;n&amp;uuml;, root' tan current' a doğrudur. Eğer y&amp;ouml;n&amp;uuml; ters &amp;ccedil;evirmek istersek, sunucu kontrol&amp;uuml;ne ait kodu aşağıdaki gibi değiştirmemiz gerekir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:SiteMapPath ID="SiteMapPath1" Runat="server" Font-Size="0.8em" Font-Names="Verdana"
PathSeparator=" : " PathDirection="CurrentToRoot"&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu durumda, sunucu kontrol&amp;uuml;m&amp;uuml;z aşağıdaki gibi g&amp;ouml;r&amp;uuml;necektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk87_10.gif" alt="" width="476" height="133" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 10. PathDirection &amp;ouml;zelliği CurrentToRoot yapıldığında.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde, TreeView kontrol&amp;uuml; yardımıyla navigasyon işlemlerinin nasıl yapıldığını incelemeye &amp;ccedil;alışacağız. Şimdilik hoş&amp;ccedil;akalın.&lt;/p&gt;</content>
  <pubDate>2004-09-03 06:00:00</pubDate>
  <slug>Asp-Net-2-0-icin-Site-Map-Kullanc4b1mc4b1-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet</tag>
    <tag>sitemap</tag>
  </tags>
  <categories>
    <category>Asp.Net</category>
  </categories>
</post>