<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Stored Procedureler ve ParameterDirection Numaralandırıcısı</title>
  <description>Bugünkü makalemizde, Sql sunucularında yazdığımız Stored Procedure'lere ilişkin parametreleri incelemeye çalışacağız. Stored Procedure'ler ile ilgili daha önceki makalelerimizde, uygulamamızdan bu procedure'lere nasıl parametre aktarılacağını incelemiştik. Parametre aktarımında yaptığımız işlem, SqlCommand nesnesimizin parametre koleksiyonuna, Stored Procedure içinde tanımladığımız parametrenin eklenmesiydi. Bunun için, SqlCommand sınıfının Parameters koleksiyonuna Add metodunu kullanarak SqlParameter sınıfı türünden bir nesne ekliyorduk. Bu parametrelere program içerisinden ilgili değerleri aktararak, bu değerlerin Stored Procedure içinede aktarılmasına imkan sağlıyorduk.</description>
  <content>&lt;p align="left"&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde, Sql sunucularında yazdığımız Stored Procedure'lere ilişkin parametreleri incelemeye &amp;ccedil;alışacağız. Stored Procedure'ler ile ilgili daha &amp;ouml;nceki makalelerimizde, uygulamamızdan bu procedure'lere nasıl parametre aktarılacağını incelemiştik. Parametre aktarımında yaptığımız işlem, SqlCommand nesnesimizin parametre koleksiyonuna, Stored Procedure i&amp;ccedil;inde tanımladığımız parametrenin eklenmesiydi. Bunun i&amp;ccedil;in, SqlCommand sınıfının Parameters koleksiyonuna Add metodunu kullanarak SqlParameter sınıfı t&amp;uuml;r&amp;uuml;nden bir nesne ekliyorduk. Bu parametrelere program i&amp;ccedil;erisinden ilgili değerleri aktararak, bu değerlerin Stored Procedure i&amp;ccedil;inede aktarılmasına imkan sağlıyorduk.&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde ise, bir Stored Procedure'den programımıza nasıl değer(ler) d&amp;ouml;nd&amp;uuml;rebileceğimizi inceleyeceğiz. Dikkat ederseniz, bir Stored Procedure'e program i&amp;ccedil;inden parametre aktarabileceğimiz gibi, Stored Procedure'dende programımıza değerler aktarbildiğimizden bahsediyoruz. Dolayısıyla parametrelerin bir takım farklı davranışlar sergiliyebilmesi s&amp;ouml;z konusu. SqlParameters sınıfı, parametrelerin davranışlarını yada başka bir deyişle hangi y&amp;ouml;ne doğru hareket edeceklerini belirten bir &amp;ouml;zellik i&amp;ccedil;ermektedir. Bu &amp;ouml;zellik Direction &amp;ouml;zelliğidir ve C# prototipi aşağıdaki gibidir.&lt;/p&gt;
&lt;table id="AutoNumber4" style="border-collapse: collapse; width: 100%; height: 31px;" border="0" cellspacing="0" cellpadding="5" bgcolor="#cccccc"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="100%" height="31"&gt;
&lt;p align="left"&gt;public virtual ParameterDirection Direction {get; set;}&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p align="left"&gt;Direction &amp;ouml;zelliği, ParameterDirection numaralandırıcısı tipinden değerler almaktadır. Bu değerlerin a&amp;ccedil;ıklaması aşağıdaki tabloda yer almaktadır.&lt;/p&gt;
&lt;div&gt;
&lt;table id="AutoNumber1" style="width: 100%; height: 261px;" border="1" cellspacing="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#cccccc" width="167" height="27"&gt;&lt;strong&gt;Direction Değeri&lt;/strong&gt;&lt;/td&gt;
&lt;td align="center" bgcolor="#cccccc" width="76%" height="27"&gt;&lt;strong&gt;A&amp;ccedil;ıklama&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="167" height="65"&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Input&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;td align="justify" width="76%" height="65"&gt;&amp;nbsp;Bir SqlParametre'sinin varsayılan değeri budur. Program i&amp;ccedil;inden Stored Procedure'e değerler&amp;nbsp; g&amp;ouml;nderileceği zaman, SqlParameter nesnesinin Direction &amp;ouml;zelliği Input olarak kullanılır. Yani parametre değerinin y&amp;ouml;n&amp;uuml; Stored Procedure'e doğrudur.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="167" height="55"&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;Output&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;td align="justify" width="76%" height="55"&gt;&amp;nbsp;Stored Procedure'den programımıza doğru değer aktarımı s&amp;ouml;z konusu ise SqlParameter nesnesinin Direction değeri Output yapılır. Bu, parametre y&amp;ouml;n&amp;uuml;n&amp;uuml;n, Stored Procedure'den programımıza doğru olduğunu g&amp;ouml;stermektedir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="167" height="71"&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;ReturnValue&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;td align="justify" width="76%" height="71"&gt;&amp;nbsp;Bazen bir Stored Procedure'&amp;uuml;n &amp;ccedil;alışması sonucunu değerlendirmek iseyebiliriz. Bu durumda &amp;ouml;zellikle Stored Procedure'den Return anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; ile d&amp;ouml;nd&amp;uuml;r&amp;uuml;len değerler i&amp;ccedil;in kullanılan parametrelerin Direction değeri ReturnValue olarak belirlenir. Bu tip bir parametreyi, bir fonksiyonun geri d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml; değeri işaret eden bir parametre olarak d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="167" height="39"&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;InputOutput&lt;/strong&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;/td&gt;
&lt;td align="justify" width="76%" height="39"&gt;&amp;nbsp;Bu durumda parametremiz hem Input hemde Output yetenklerine sahip olucaktır.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p align="left"&gt;Tablo 1.ParameterDirection Numaralandırıcısının Değerleri.&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde ağırlıklı olarak ReturnValue ve Output durumlarını incelemeye &amp;ccedil;alışacağız. Dilerseniz işe ReturnValue ile başlayalım. Bu &amp;ouml;rnekler i&amp;ccedil;in, Makaleler ile ilgili bilgilere sahip olan bir tablo kullanacağız. Şimdi sql sunucumuzda, bu tablo i&amp;ccedil;in aşağıdaki Stored Procedure nesnesini oluşturalım.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk49_1.gif" alt="" width="446" height="466" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 1. MakaleMevcutmu Stored Procedure'&amp;uuml;m&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;Bu Stored Procedure, programdan @MakaleID isimli bir parametre alıyor. Bu parametreyi, SELECT sorgusuna ge&amp;ccedil;iyor ve Makale tablosunda ID alanı, @MakaleID parametresinin değerine eşit olan satırı se&amp;ccedil;iyor. Burada kullanılan @MakaleID parametresinin değeri program i&amp;ccedil;inden belirlenecektir. Dolayısıyla bu parametremizin y&amp;ouml;n&amp;uuml;, programımızdan Stored Procedure'&amp;uuml;m&amp;uuml;ze doğrudur. Bu nedenle, programımızda bu parametre tanımlandığında Direction değeri Input olmalıdır. Ancak bunu program i&amp;ccedil;inde belirtmeyecek yani SqlParameter nesnesinin Direction &amp;ouml;zelliğine a&amp;ccedil;ık&amp;ccedil;a ParameterDirection.Input değerini atamayacağız. &amp;Ccedil;&amp;uuml;nk&amp;uuml; bir SqlParametresinin Direction &amp;ouml;zelliğinin varsayılan değeri budur.&lt;/p&gt;
&lt;p&gt;Gelelim RETURN kısmına. Burada @@RowCount isimli sql anahtar kelimesi kullanıyoruz. Bu anahtar kelime Stored Procedure &amp;ccedil;alıştırıldıktan sonra, Select sorgusu sonucu d&amp;ouml;nen satır sayısını vermektedir. If koşulumuz ile, procedure i&amp;ccedil;inden, bu select sorgusu sonucunun değerine bakıyoruz. Eğer PrimaryKey olan ID alanımızda, @MakaleID parametresine atadığımız değer mevcutsa, @@RowCount, 1 değerini d&amp;ouml;nd&amp;uuml;recektir. Daha sonra, RETURN anahtar kelimesini kullanarak, Stored Procedure'den programa değer d&amp;ouml;nd&amp;uuml;r&amp;uuml;yoruz. İşte bu değerler, programımızdaki SqlParameter nesnesi i&amp;ccedil;in, Direction &amp;ouml;zelliğinin ParameterDirection.ReturnValue olmasını gerektirir. &amp;Ouml;rneğimizi tamamladığımızda bu durumu daha iyi anlayacağınıza inanıyorum.&lt;/p&gt;
&lt;p&gt;Şimdi aşağıdaki Form tasarımımızı yapalım ve kodlarımızı yazalım. Program basit bir şekilde, bu Stored Procedure'e kullanıcının girdiği Makale numarasını g&amp;ouml;nderecek ve sonu&amp;ccedil;ta bu makalenin var olup olmadığını bize belirtecek. Bu arada şunuda belirtmekte fayda var. Bu tip bir işlemi elbette, SqlCommand nesnesine, bir Select sorgusu girerek de ger&amp;ccedil;ekleştirebilirdik. Ancak Stored Procedure'lerin en &amp;ouml;nemli &amp;ouml;zelliklerinin, derlenmiş sql nesneleri oldukları i&amp;ccedil;in, sağladıkları performans ve hız artışı kazanımları olduğunuda g&amp;ouml;rmezden gelemeyiz. Bununla birlikte g&amp;uuml;venlik a&amp;ccedil;ısındanda daha verimlidirler. &amp;Ouml;zelliklede web uygulamaları i&amp;ccedil;in. Şimdi Formumuzu tasarlayalım. Bunun i&amp;ccedil;in basit bir windows uygulaması geliştireceğiz.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk49_2.gif" alt="" width="376" height="110" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 2. Form Tasarımımız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void button1_Click(object sender, System.EventArgs e)
{
     conFriends=new SqlConnection("data source=localhost;initial catalog=Friends;integrated security=sspi"); /* Sql sunucumuza olan bağlantımızı ger&amp;ccedil;ekleştiriyoruz. */
 
     SqlCommand cmd=new SqlCommand("MakaleMevcutmu",conFriends); /* SqlCommand nesnemizi oluşturuyoruz. SqlCommand nesnemize, Stored Procedure'&amp;uuml;m&amp;uuml;z&amp;uuml;n adını parametre olarak veriyoruz. */

     cmd.CommandType=CommandType.StoredProcedure; /* SqlCommand nesnemiz bir Stored Procedure &amp;ccedil;alıştıracağı i&amp;ccedil;in CommandType &amp;ouml;zelliği CommandType.StoredProcedure olarak belirlenir.*/

     /* Burada, Stored Procedure'&amp;uuml;m&amp;uuml;z&amp;uuml;den Return ile d&amp;ouml;nen değeri işaret edicek SqlParameter nesnemizi ,SqlCommand nesnemizin Parameters koleksiyonuna Add metodu ile ekliyoruz. Return anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; ile geri d&amp;ouml;nen değeri işaret edicek paramterenin adı herhangibir isim olabilir. Ancak her sql parametresinde olduğu gibi başında @ işaretini kullanmayı unutmamalıyız.*/
     cmd.Parameters.Add("@DonenDeger",SqlDbType.Int);
     cmd.Parameters["@DonenDeger"].Direction=ParameterDirection.ReturnValue; /* Parametrenin, Stored Procedure'den, programa doğru olduğunu ve Return anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; ile geriye d&amp;ouml;nen bir değeri işaret ettiğini belirtmek i&amp;ccedil;in, Direction &amp;ouml;zelliğine, ParameterDirection.ReturnValue değerini veriyoruz.*/

     /* Burada programımızda kullanıcının girdiği Makale numarasını, Stored Procedure'&amp;uuml;m&amp;uuml;ze doğru g&amp;ouml;nderecek SqlParameter nesnemizi tanımlanıyoruz. Bu parametre Input tipindedir. Bu nedenle, adının, Stored Procedure'&amp;uuml;m&amp;uuml;zdeki ile aynı olmasına dikkat etmeliyiz. */
     cmd.Parameters.Add("@MakaleID",SqlDbType.Int);
     cmd.Parameters["@MakaleID"].Value=txtMakaleNo.Text; /* Parametremizin değeri veriliyor.*/

     /* G&amp;uuml;venli bloğumuzda, &amp;ouml;ncelikle sql sunucumuza olan bağlantımızı SqlConnection yardımıyla a&amp;ccedil;ıyoruz ve ardından SqlCommand nesnemizin referans ettiği Stored Procedure nesnemizi &amp;ccedil;alıştırıyoruz.*/
     try
     {
          conFriends.Open();
          cmd.ExecuteNonQuery();
          int Sonuc;
          /* Stored Procedure'&amp;uuml;m&amp;uuml;zden Return anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; ile d&amp;ouml;nen değeri @DonenDeger SqlParameter nesnesi ile alıyor ve sonuc ismindeki integer tipteki değişkenimize atıyoruz. SqlCommand nesnesinin, Parameters koleksiyonunda yer alan SqlParameter nesnelerinin Value &amp;ouml;zelliği geriye Object tipinden değer d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml; i&amp;ccedil;in, bu değeri integer tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemide uyguladığımıza dikkat edelim. */

         Sonuc=Convert.ToInt32(cmd.Parameters["@DonenDeger"].Value);

          /* Burada d&amp;ouml;nen değeri değerlendirerek kullanıcının girdiği ID'ye sahip bir Makale olup olmadığını belirliyoruz.*/
               if(Sonuc==1)
               {
                    MessageBox.Show("MAKALE BULUNDU...");
               }
               else if(Sonuc==0)
               {
                    MessageBox.Show("MAKALE BULUNAMADI...");
               }
     }
     catch(Exception hata)
     {
          MessageBox.Show("Hata:"+hata.Message.ToString());
     }
     finally
     {
          conFriends.Close(); /* Bağlantımızı kapatıyoruz. */
     }
}&lt;/pre&gt;
&lt;p align="left"&gt;Şimdi progamımızı &amp;ccedil;alıştıralım ve bir ID değeri girelim. Bu noktada kullanıcının girdiği ID değeri, @MakaleID isimli SqlParameter nesnemiz yardımıyla, Stored Procedure'&amp;uuml;m&amp;uuml;ze aktarılacak ve Stored Procedure'&amp;uuml;n &amp;ccedil;alışması sonucu geri d&amp;ouml;nen değerde @DonenDeger isimli SqlParameter nesnesi yardımıyla uygulamamızda değerlendirilecek.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk49_3.gif" alt="" width="376" height="110" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 3. Programın &amp;Ccedil;alışması Sonucu. Makale bulunduğunda.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk49_4.gif" alt="" width="377" height="114" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 4. Makale bulunamadığında.&lt;/p&gt;
&lt;p&gt;Elbette bu &amp;ouml;rnek bize pek bir şey ifade etmiyor. Nitekim makalenin var olup olmadığının farkına vardık o kadar. Ama Makale tablosundaki belli alanlarıda g&amp;ouml;rmek istediğimizi varsaylım. İşte bu, Output tipindeki SqlParameter nesnelerini kullanmak i&amp;ccedil;in g&amp;uuml;zel bir fırsat. Şimdi bu Stored Procedure nesnemizin sql kodunu biraz değiştireceğiz.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk49_5.gif" alt="" width="446" height="514" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 5. Output Tipi Sql Parametreleri.&lt;/p&gt;
&lt;p&gt;Burada Select sorgusundaki @MakaleKonusu=Konu ifadesine dikkatinizi &amp;ccedil;ekmek isterim. Eğer @MakaleID parametresinin değerinde bir Makale satırı var ise, bu satırın Konu alanının değerini, @MakaleKonusu isimli parametreye aktarıyoruz. İşte bu parametre, programımıza doğru d&amp;ouml;nen Output tipinde bir parametredir. Diğer yandan Output parametrelerini kullanırken, sql yazımı i&amp;ccedil;indede bu parametre değişkeninin OUTPUT anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; ile belirtilmesi gerekmektedir. Yeni duruma g&amp;ouml;re program kodlarımız aşağıdaki gibi olmalıdır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void button1_Click(object sender, System.EventArgs e)
{
     conFriends=new SqlConnection("data source=localhost;initial catalog=Friends;integrated security=sspi");
     SqlCommand cmd=new SqlCommand("MakaleMevcutmu",conFriends);
     cmd.CommandType=CommandType.StoredProcedure;
     cmd.Parameters.Add("@DonenDeger",SqlDbType.Int);
     cmd.Parameters["@DonenDeger"].Direction=ParameterDirection.ReturnValue;
  cmd.Parameters.Add("@MakaleKonusu",SqlDbType.NVarChar,255);
     cmd.Parameters["@MakaleKonusu"].Direction=ParameterDirection.Output;
     cmd.Parameters.Add("@MakaleID",SqlDbType.Int);
     cmd.Parameters["@MakaleID"].Value=txtMakaleNo.Text;
     try
     {
          conFriends.Open();
          cmd.ExecuteNonQuery();
          int Sonuc;
          string MakaleAdi;
         Sonuc=Convert.ToInt32(cmd.Parameters["@DonenDeger"].Value);
          MakaleAdi=cmd.Parameters["@MakaleKonusu"].Value.ToString();

          if(Sonuc==1)
          {
               MessageBox.Show("MAKALE BULUNDU...");
               lblMakaleKonusu.Text=MakaleAdi;
          }
          else if(Sonuc==0)
          {
               MessageBox.Show("MAKALE BULUNAMADI...");
          }
     }
     catch(Exception hata)
     {
          MessageBox.Show("Hata:"+hata.Message.ToString());
     }
     finally
     {
          conFriends.Close();
     }
}&lt;/pre&gt;
&lt;p&gt;Şimdi uygulamamızı &amp;ccedil;alıştıralım. Aşağıdaki sonucu elde ederiz.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk49_6.gif" alt="" width="376" height="144" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 6. Makalemizin Konu isimli alanının değeri d&amp;ouml;nd&amp;uuml;r&amp;uuml;ld&amp;uuml;.&lt;/p&gt;
&lt;p&gt;Değerli okurlarım. Geldik bir makalemizin daha sonuna. Umarım yararlı bir makale olmuştur. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-01-31 12:00:00</pubDate>
  <slug>Stored-Procedureler-ve-ParameterDirection-Numaralandc4b1rc4b1cc4b1sc4b1-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>parameter-direction</tag>
    <tag>sql</tag>
    <tag>enum</tag>
    <tag>stored-procedures</tag>
    <tag>database</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>