<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>TPL için Önemli Bir Kavram : Task [Beta 1]</title>
  <description>Bir önceki blog yazımda Task Parallel Library alt yapısının ne olduğunu sizlere aktarmaya çalışmıştım. Tabiki bu alt yapı üzerinde durulması gereken pek çok konu bulunmaktadır. Heyecanım çok, anlatmak içinde sabırsızlanıyorum. Ama her zamanki gibi adım adım ilerlemekte ve acele etmemekte yarar olduğu kansındayın. TPL ile ilişkili önemli konulardan birisi Task(yada Task&lt;T&gt;) sınıfıdır. TPL esas itibariyle görev adı verilen küçük iş parçaları üzerine kurulu bir yapı olarak düşünülebilir. Bu nedenle Task sınıfı son derece önemlidir.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki blog yazımda &lt;strong&gt;Task Parallel Library &lt;/strong&gt;alt yapısının ne olduğunu sizlere aktarmaya &amp;ccedil;alışmıştım. Tabiki bu alt yapı &amp;uuml;zerinde durulması gereken pek &amp;ccedil;ok konu bulunmaktadır. Heyecanım &amp;ccedil;ok, anlatmak i&amp;ccedil;inde sabırsızlanıyorum. Ama her zamanki gibi adım adım ilerlemekte ve acele etmemekte yarar olduğu kansındayın. TPL ile ilişkili &amp;ouml;nemli konulardan birisi &lt;strong&gt;Task(yada Task&amp;lt;T&amp;gt;)&lt;/strong&gt;&amp;nbsp;sınıfıdır. &lt;strong&gt;TPL&lt;/strong&gt; esas itibariyle g&amp;ouml;rev adı verilen k&amp;uuml;&amp;ccedil;&amp;uuml;k iş par&amp;ccedil;aları &amp;uuml;zerine kurulu bir yapı olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Bu nedenle &lt;strong&gt;Task&lt;/strong&gt; sınıfı son derece &amp;ouml;nemlidir.&lt;/p&gt;
&lt;p&gt;Nitekim g&amp;ouml;revlerin y&amp;ouml;netimli kod tarafındaki ifadesidir.&amp;nbsp;Bu sınıf yardımıyla, paralel &amp;ccedil;alışacak olan g&amp;ouml;revlerin başlatılması, iptal edilmesi, bekletilmesi, arka arkaya eklenerek bir s&amp;uuml;re&amp;ccedil; tesis edilmesi&amp;nbsp;gibi pek &amp;ccedil;ok işlem yapılabilir. Task sınıfı normal şartlarda geriye değer d&amp;ouml;nd&amp;uuml;rmeyen fonksiyonelliklerin eş zamanlı olarak &amp;ccedil;alıştırılmasında ele alınmaktadır. Geriye değer d&amp;ouml;nd&amp;uuml;ren metodlar s&amp;ouml;z konusu olduğunda ise, &lt;strong&gt;Task&amp;lt;T&amp;gt;&lt;/strong&gt; &lt;strong&gt;generic&lt;/strong&gt; tipinden yararlanılabilir. Buradaki &lt;strong&gt;T&lt;/strong&gt;, paralel &amp;ccedil;alışan metodun d&amp;ouml;n&amp;uuml;ş tipi olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Aşağıdaki sınıf diagramında s&amp;ouml;z konusu tipler ve &amp;uuml;yeleri yer almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg27_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında Task ve Task&amp;lt;T&amp;gt; sınıflarının static &lt;strong&gt;Factory&lt;/strong&gt; &amp;ouml;zelliği &amp;uuml;zerinden gidildiğinde &lt;strong&gt;StartNew&lt;/strong&gt; metodu yardımıyla g&amp;ouml;revlerin&amp;nbsp;başlatılması sağlanmaktadır. Diğer yandan &lt;strong&gt;Task&amp;lt;T&amp;gt;&lt;/strong&gt; sınıfının &lt;strong&gt;Result&lt;/strong&gt; &amp;ouml;zelliği, geri d&amp;ouml;n&amp;uuml;ş tipini belirtmektedir. Ayrıca sınıf diagramındanda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;Task&amp;lt;T&amp;gt;&lt;/strong&gt; sınıfı, &lt;strong&gt;Task&lt;/strong&gt; sınıfından t&amp;uuml;remektedir. &lt;strong&gt;Factory&lt;/strong&gt; &amp;ouml;zellikleri, &lt;strong&gt;TaskFactory&lt;/strong&gt; veya &lt;strong&gt;TaskFactory&amp;lt;T&amp;gt;&lt;/strong&gt; tipinden referanslar barındırmaktadır. Bu tiplerin i&amp;ccedil;eriği ise aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg27_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;T&amp;uuml;m tiplerde pek &amp;ccedil;ok &amp;ouml;nemli &amp;uuml;ye bulunmaktadır. Bunların hemen hepsini zaman i&amp;ccedil;erisinde ele almaya gayret edeceğiz, hi&amp;ccedil; merak etmeyin. Şimdi gelin &lt;strong&gt;Task &lt;/strong&gt;ve &lt;strong&gt;Task&amp;lt;T&amp;gt; &lt;/strong&gt;sınıflarını basit (ve her zamanki gibi tam anlamıyla ger&amp;ccedil;ek hayat &amp;ouml;rneği olmayan &lt;img title="Embarassed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-embarassed.gif" alt="Embarassed" border="0" /&gt;) bir &amp;ouml;rnek &amp;uuml;zerinden ele almaya &amp;ccedil;alışalım. İlk olarak senaryomuzdan bahsedelim. Senaryomuza g&amp;ouml;re resim dosyalarına ait 3 farklı işlemin ger&amp;ccedil;ekleştiği&amp;nbsp;metodların eş zamanlı ve paralel olarak &amp;ccedil;alıştırılmasını sağlamayı hedefliyoruz. Buna g&amp;ouml;re bir klas&amp;ouml;rden,&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Resim dosyalarının toplam boyutunun bulunması,&lt;/li&gt;
&lt;li&gt;Resimler i&amp;ccedil;erisinde bmp olanların ka&amp;ccedil; adet olduklarının tespit edilmesi,&lt;/li&gt;
&lt;li&gt;Resimler i&amp;ccedil;erisinde bmp olanların farklı bir klas&amp;ouml;re kopylanması,&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;işlemlerini ger&amp;ccedil;ekleştiren fonksiyonelliklerimiz bulunmakta.&lt;/p&gt;
&lt;p&gt;Normal şartlar altında herkesin burada durup biraz d&amp;uuml;ş&amp;uuml;nmesi gerekiyor. Elimizde &lt;strong&gt;.Net Parallel Extensions&lt;/strong&gt; olmadığını varsayalım. Bu durumda ya &lt;strong&gt;Multi-Thread&lt;/strong&gt; mimarisini kullanacağız, yada &lt;strong&gt;delegate(temsilci)&lt;/strong&gt; tiplerinden yararlanarak &lt;strong&gt;asenkron&lt;/strong&gt; &lt;strong&gt;erişim modellerini(Polling, Callback, WaitHandle, Event-Based)&lt;/strong&gt; ele alacağız. Bunu bir d&amp;uuml;ş&amp;uuml;n&amp;uuml;n ve senaryoyu bu materyaller ile yazmayı bir deneyin. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Tabi&amp;nbsp;şunu biliyoruzki &lt;strong&gt;TPL&lt;/strong&gt; alt yapısı, paralel işlemleri kolayca ele almamızı sağlayacak şekilde tasarlanmıştır. İlk etapta kodlarımızı aşağıdali gibi geliştirdiğimiz varsayalım&lt;em&gt;.(Kodlarımızı&lt;strong&gt; Visual Studio 2010 Beta 1&lt;/strong&gt; &amp;uuml;zerinde geliştirdiğimizi hatırlatayım)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Configuration;
using System.IO;
using System.Threading;
using System.Threading.Tasks;

namespace HelloTasks
{
    class Program
    {
        static string imagesPath = ConfigurationManager.AppSettings["ImagesPath"];

        static void Main(string[] args)
        {
            long totalSize = GetTotalSize();
            int bmpCount = GetBmpCount();
            CopyBmp();
            Console.WriteLine("Toplam boyut {0} byte\nBmp sayısı {1}", totalSize.ToString(), bmpCount.ToString());

            Console.WriteLine("Devam etmek i&amp;ccedil;in bir tuşa basınız");
            Console.Read();
        }

        static long GetTotalSize()
        {
            Console.WriteLine("\t GetTotalSize metodu i&amp;ccedil;in Managed Thread Id {0}. Zaman {1}",Thread.CurrentThread.ManagedThreadId.ToString(),DateTime.Now.ToLongTimeString());
            string[] files=Directory.GetFiles(imagesPath);
            long totalSize = 0;
            foreach (string file in files)
            {
                FileInfo fInfo = new FileInfo(file);
                totalSize += fInfo.Length;
                Thread.Sleep(10); // işlemleri biraz geciktirmek i&amp;ccedil;in bilin&amp;ccedil;li olarak konulmuştur
            }
            return totalSize;
        }

        static int GetBmpCount()
        {
            Console.WriteLine("\t GetBmpCount metodu i&amp;ccedil;in Managed Thread Id {0} Zaman {1}", Thread.CurrentThread.ManagedThreadId.ToString(), DateTime.Now.ToLongTimeString());
            int result = 0;

            foreach (string file in Directory.GetFiles(imagesPath))
            {
                FileInfo fInfo = new FileInfo(file);
                Thread.Sleep(10); // işlemleri biraz geciktirmek i&amp;ccedil;in bilin&amp;ccedil;li olarak konulmuştur
                if (fInfo.Extension.Contains("bmp"))
                    result++;
            }

            return result;
        }

        static void CopyBmp()
        {
            Console.WriteLine("\t CopyBmp metodu i&amp;ccedil;in Managed Thread Id {0} Zaman {1}", Thread.CurrentThread.ManagedThreadId.ToString(), DateTime.Now.ToLongTimeString());
            foreach (string file in Directory.GetFiles(imagesPath))
            {
                FileInfo fInfo = new FileInfo(file);
                if (fInfo.Extension.Contains("bmp"))
                {
                    File.Copy(file, "C:\\Bitmaps\\"+ fInfo.Name,true);
                }
            }
            Console.WriteLine("Kopyalama işlemi tamamlandı");
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Şunu hemen belirteyim; aslında &lt;strong&gt;Directory&lt;/strong&gt; ve &lt;strong&gt;FileInfo&lt;/strong&gt; sınıflarının s&amp;ouml;z konusu hesaplamalar i&amp;ccedil;in kolaylaştırıcı metodları zaten mevcut. S&amp;ouml;z gelimi &lt;strong&gt;Directory&lt;/strong&gt; sınıfının &lt;strong&gt;GetFiles&lt;/strong&gt; metoduna filtre uygulayarak zaten &lt;strong&gt;bmp&lt;/strong&gt; dosyalarını kolayca elde edebiliriz. Yada bmp dosyalarını ele alırken kopyalama işlemlerinide yapabiliriz. Ancak yazının başında da bahsettiğim &amp;uuml;zere bu sadece &amp;ouml;rnek bir senaryo malzemesi. &amp;Ouml;nemli olan nokta &lt;strong&gt;GetTotalSize&lt;/strong&gt;, &lt;strong&gt;GetBmpCount&lt;/strong&gt; ve &lt;strong&gt;CopyBmp&lt;/strong&gt; metodlarının paralel olarak &amp;ccedil;alıştırılmalarını sağlamak. Tabi şu andaki kod par&amp;ccedil;amız bu metodları &lt;strong&gt;ardışık(Sequential)&lt;/strong&gt; olarak &amp;ccedil;alıştırmaktadır. Uygulamanın &amp;ccedil;alışma zamanı &amp;ccedil;ıktısına baktığımızda ise aşağıdaki ekran g&amp;ouml;r&amp;uuml;t&amp;uuml;s&amp;uuml;ndekine benzer sonu&amp;ccedil;ları alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg27_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sanıyorumki metodların başlangı&amp;ccedil; zamanları ve aralarındaki farklar dikkatinizi &amp;ccedil;ekmiştir. Bu zaten beklediğimiz bir sonu&amp;ccedil;tur aslında. Nitekim metod g&amp;ouml;revlerinin paralel olarak ele alınması i&amp;ccedil;in hi&amp;ccedil; bir şey yapmadık. Kodu paralel programlama felsefesine taşımak i&amp;ccedil;in aşağıdaki gibi değiştirmemiz gerekmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
	Task[] tasks =
	{
		Task&amp;lt;long&amp;gt;.Factory.StartNew(GetTotalSize),
		Task&amp;lt;int&amp;gt;.Factory.StartNew(GetBmpCount),
		Task.Factory.StartNew(CopyBmp)
	};

	/* tasks isimli dizi i&amp;ccedil;erisindeki Task&amp;lt;T&amp;gt; tipleri aynı generic tip ile kullanılmadıklarında Task&amp;lt;T&amp;gt;[] gibi bir dizi &amp;uuml;retilememiş bu nedenle 0 ve 1nci indislerdeki Task tiplerinin Result &amp;ouml;zelliklerine ulaşabilmek i&amp;ccedil;in bilin&amp;ccedil;li olarak Task&amp;lt;T&amp;gt; tiplerine d&amp;ouml;n&amp;uuml;ş&amp;uuml;m yapılmıştır. */
	Console.WriteLine("Toplam boyut {0} byte\nBmp sayısı {1}"
		, ((Task&amp;lt;long&amp;gt;)tasks[0]).Result.ToString()
		, ((Task&amp;lt;int&amp;gt;)tasks[1]).Result.ToString()
		);

	Console.WriteLine("Devam etmek i&amp;ccedil;in bir tuşa basınız");
	Console.Read();
}&lt;/pre&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;Task&lt;/strong&gt; tipinden bir dizi &amp;uuml;rettildiğini g&amp;ouml;rmekteyiz ki bir dizi kullanmanın bir zorunluluk olmadığını biraz sonra g&amp;ouml;receğiz.&amp;nbsp;Nihayetinde elimizde birden fazla g&amp;ouml;rev var. Bu ilk kod denememizde,&amp;nbsp;g&amp;ouml;revlerin tamamı bir dizi i&amp;ccedil;erisinde toplanmaktadır. Dizinin her bir&amp;nbsp;elemanının oluşturulması sırasında &lt;strong&gt;Factory&lt;/strong&gt; &amp;ouml;zelliği &amp;uuml;zerinden &lt;strong&gt;StartNew&lt;/strong&gt; metodunun&amp;nbsp;&amp;ccedil;ağırıldığına dikkat edelim.&amp;nbsp;Bu noktada parametre olarak belirtilen metodların, Task' ler diziye eklenirken&amp;nbsp;&amp;ccedil;alıştırıldığını s&amp;ouml;yleyebiliriz. Kodun devam eden kısmında ise, generic Task tiplerinin &amp;ccedil;alıştırdığı metodlardan gelen d&amp;ouml;n&amp;uuml;ş değerleri ele alınmak istenmektedir. D&amp;ouml;n&amp;uuml;ş değerlerinin ele alınması sırasında bilin&amp;ccedil;li olarak t&amp;uuml;r d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml; yapıldığına dikkat edilmelidir. Nitekim, d&amp;ouml;n&amp;uuml;ş değerleri ancak&lt;strong&gt; Task&amp;lt;T&amp;gt;&lt;/strong&gt; generic sınıfının &lt;strong&gt;Result&lt;/strong&gt; &amp;ouml;zellliği &amp;uuml;zerinden ele alınabilmektedir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;NOT : Tabiki bazı senaryolarda, t&amp;uuml;m g&amp;ouml;revler &lt;span style="text-decoration: underline;"&gt;aynı&lt;/span&gt; d&amp;ouml;n&amp;uuml;ş tipine sahip olabilirler. Bu durumda dizinin Task&amp;lt;T&amp;gt; tipinden tasarlanmış olması halinde, d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemlerine gerek olmadan sonu&amp;ccedil;lar alınabilir. Nitekim dizi &amp;uuml;zerinde hareket edecek basit bir for each d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml;n&amp;nbsp;ele alacağı&amp;nbsp;her bir eleman Task&amp;lt;T&amp;gt; tipinde olacağından, zaten Result &amp;ouml;zelliklerine otomatikman ulaşılabilecektir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bu noktada şunu vurgulamaktada yarar var; bazı durumlarda paralel &amp;ccedil;alışan metodların işlemlerini &lt;span style="text-decoration: underline;"&gt;tamamlamadan&lt;/span&gt; kodun devam etmesi &lt;span style="text-decoration: underline;"&gt;istenmeyebilir&lt;/span&gt;. Bu durumdada Task sınıfının &lt;strong&gt;static&lt;/strong&gt; &lt;strong&gt;WaitAll&lt;/strong&gt; veya &lt;strong&gt;WaitAny&lt;/strong&gt; gibi metodlarını kullanarak gereken bekletmeleri yapabiliriz. &amp;Ouml;rneğimizde buna gerek kalmamıştır. &amp;Ccedil;&amp;uuml;nk&amp;uuml;&amp;nbsp;generic Task tiplerinin işaret ettiği metodlara ait d&amp;ouml;n&amp;uuml;ş tipleri alınmak istendiğinden, uygulama kodu zaten o anda sonu&amp;ccedil; gelmediyse mecburen beklemede kalacaktır. Peki &amp;ouml;rneği &amp;ccedil;alıştırdığımızda nasıl bir sonu&amp;ccedil; alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg27_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Mutlaka dikkatinizi &amp;ccedil;ekmiştir; her metod i&amp;ccedil;in ayrı bir &lt;strong&gt;Managed Thread&lt;/strong&gt; &lt;strong&gt;Id &lt;/strong&gt;değeri &amp;uuml;retilmektedir. Oysaki &lt;strong&gt;ardışık(Sequential)&lt;/strong&gt; &amp;ccedil;alışan modelde t&amp;uuml;m metodlar aynı &lt;strong&gt;Thread&lt;/strong&gt; i&amp;ccedil;erisinde ele alınmıştır. Bu, &lt;strong&gt;Thread&lt;/strong&gt; b&amp;ouml;l&amp;uuml;n&amp;uuml;m&amp;uuml;n&amp;uuml;n de bir g&amp;ouml;stergesidir. Diğer taraftan, metodlar arası s&amp;uuml;re farklılıkları neredeyse sıfıra yakındır. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi gayet basit bir şekilde işlemleri paralel hale getirmeyi başardık. Kod ile ilişkili &amp;ouml;nemli bir noktayı daha vurgulamak isterim. Biraz &amp;ouml;nce bahsettiğimiz gibi, aynı d&amp;ouml;n&amp;uuml;ş tipine sahip metodların kullanıldığı senaryolarda Task dizilerini kullanmak daha mantıklıdır. Bu nedenle yukarıdaki senaryoda yer alan kodda dizi kullanımı şart değildir. Bir başka deyişle aynı amacı yerine getirden bir kod par&amp;ccedil;ası, aşağıdaki şekilde olduğu gibi ele alınabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Task&amp;lt;long&amp;gt; task1=Task&amp;lt;long&amp;gt;.Factory.StartNew(GetTotalSize);
Task&amp;lt;int&amp;gt; task2=Task&amp;lt;int&amp;gt;.Factory.StartNew(GetBmpCount);
Task task3=Task.Factory.StartNew(CopyBmp);

Console.WriteLine("Toplam boyut {0} byte\nBmp sayısı {1}"
                    , task1.Result.ToString()
                    , task2.Result.ToString()
                    );&lt;/pre&gt;
&lt;p&gt;Bu sefer &lt;strong&gt;GetTotalSize&lt;/strong&gt; ve &lt;strong&gt;GetBmpCount&lt;/strong&gt; metodlarını kullanan &lt;strong&gt;Task&lt;/strong&gt; tiplerine ait &amp;ccedil;alışma zamanı referansları, birer değişkene atanarak kullanılmışlardır. Bu durumda bir &amp;ouml;nceki &amp;ouml;rnekte yaptığımız gibi &lt;strong&gt;Result&lt;/strong&gt; &amp;ouml;zelliğine erişmek i&amp;ccedil;in, &lt;strong&gt;cast&lt;/strong&gt; işlemi yapılmasına da gerek kalmamaktadır ki bu olduk&amp;ccedil;a doğru bir yoldur. Dolayısıyla kodu daha d&amp;uuml;zg&amp;uuml;n bir hale getirmiş bulunuyoruz. Sizlerde Task ve Task&amp;lt;T&amp;gt; sınıflarını kullanarak bir ka&amp;ccedil; antrenman yapmayı deneyebilirsiniz.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Visual Studio 2010 ile birlikte gelen Parallel Tasks ve Parallel Stacks debugger pencereleri yardımıyla &amp;ccedil;alışma zamanında, task ve thread' lerin durumunu daha net bir şekilde analiz edebilirsiniz. Bu konuyu bir g&amp;ouml;rsel dersimizde ele almaya &amp;ccedil;alışacağım.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Tabiki konuyu daha derinlere genişletmek m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. &amp;Ouml;rneğin bazı g&amp;ouml;revlerin, kendinden &amp;ouml;nceki g&amp;ouml;rev(ler) tamamlandıktan sonra başlatılması istenebilir. İşte diğer blog yazımın konusunu şimdiden bulduk. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Tabi başımıza dert a&amp;ccedil;acak daha pek &amp;ccedil;ok konuda var. S&amp;ouml;z gelimi, &lt;strong&gt;TPL&lt;/strong&gt; alt yapısını &lt;strong&gt;WinForms&lt;/strong&gt; yada &lt;strong&gt;WPF &lt;/strong&gt;gibi uygulamalarda ele aldığımızda neler olacaktır kimbilir &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;. Malum &lt;strong&gt;WinForms&lt;/strong&gt; yada &lt;strong&gt;WPF&lt;/strong&gt; ekranlarında, &lt;strong&gt;Main&lt;/strong&gt; &lt;strong&gt;Thread&lt;/strong&gt; bencillik edip ekran &amp;uuml;zerindeki kontrolleri&amp;nbsp;başka &lt;strong&gt;Thread'&lt;/strong&gt; ler ile paylaşmak istemez. Bu bencilliğe ortak olduğumuzda WinForms tarafında Illegal Cross Thread istisnalarına d&amp;uuml;şt&amp;uuml;ğ&amp;uuml;m&amp;uuml;z&amp;uuml; gayet iyi biliyoruz. Bu ve benzeri diğer konuları ilerleyen zamanlarda irdelemeye devam ediyor olacağız. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f6%2fHelloTasks.rar"&gt;HelloTasks.rar (23,71 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-06-04 19:05:00</pubDate>
  <slug>TPL-icin-Onemli-Bir-Kavram-Task</slug>
  <tags>
    <tag>task-parallel-library</tag>
  </tags>
  <categories>
    <category>TPL</category>
  </categories>
</post>