<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tasarım Prensipleri - Liskov Substitution</title>
  <description>Bu günkü blog yazımızın kahramanı Barbara Liskov(http://en.wikipedia.org/wiki/Barbara_Liskov). Ve tahmin edeceğiniz üzere konumuz tasarım prensipleri içerisinde uygulanan disiplinlerden birisi olan Liskov Substitution(LSP) ilkesi. Bu ilke üst sınıf(Base Class) ve alt sınıf(Sub Class) arasındaki ilişkinin rol aldığı bir prensip olarak göz önüne alınabilir aslında. İlkenin özet cümlesini söylemeden önce basit bir örnek üzerinden ilerlemenin daha iyi olacağı kanısındayım. Nitekim özet cümleyi okuduğunuzda kafanızın karışmamasını garanti edemeyeceğim...</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f6%2fBarbaraLiskov.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bu g&amp;uuml;nk&amp;uuml; blog yazımızın kahramanı &lt;strong&gt;Barbara Liskov&lt;/strong&gt;(&lt;a href="http://en.wikipedia.org/wiki/Barbara_Liskov"&gt;http://en.wikipedia.org/wiki/Barbara_Liskov&lt;/a&gt;). Ve tahmin edeceğiniz &amp;uuml;zere konumuz tasarım prensipleri i&amp;ccedil;erisinde uygulanan&amp;nbsp;disiplinlerden birisi olan &lt;strong&gt;Liskov Substitution(LSP)&lt;/strong&gt; ilkesi. Bu ilke&amp;nbsp;&lt;strong&gt;&amp;uuml;st sınıf(Base Class) &lt;/strong&gt;ve &lt;strong&gt;alt sınıf(Sub Class) &lt;/strong&gt;arasındaki ilişkinin rol aldığı bir prensip olarak g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir aslında.&amp;nbsp;İlkenin &amp;ouml;zet&amp;nbsp;c&amp;uuml;mlesini s&amp;ouml;ylemeden &amp;ouml;nce basit bir &amp;ouml;rnek &amp;uuml;zerinden ilerlemenin daha iyi olacağı kanısındayım. Nitekim &amp;ouml;zet c&amp;uuml;mleyi okuduğunuzda kafanızın karışmamasını garanti edemeyeceğim. &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek &lt;strong&gt;Console&lt;/strong&gt; uygulamamızda &lt;strong&gt;Document&lt;/strong&gt; isimli bir &lt;strong&gt;abstract&lt;/strong&gt; sınıfımız mevcuttur. Bu sınıf &lt;strong&gt;Pdf, Xps&lt;/strong&gt; gibi d&amp;ouml;k&amp;uuml;manların ortak &amp;ouml;zellikleri ile uygulaması gereken kuralları tanımlamaktadır. &amp;Ouml;rneğin d&amp;ouml;k&amp;uuml;manın&amp;nbsp;network &amp;uuml;zerinde bir&amp;nbsp;yere g&amp;ouml;nderilmesi veya&amp;nbsp;printer &amp;uuml;zerinden yazdırılması&amp;nbsp;bu anlamda&amp;nbsp;zorunlu fonksiyonellikler olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&amp;nbsp;Diğer yandan, &lt;strong&gt;DocumentManager&lt;/strong&gt; isimli bir başka sınıfta, &lt;strong&gt;Document&lt;/strong&gt; sınıfına bağımlı olan bir tip olarak karşımıza &amp;ccedil;ıkmaktadır. Bu tip kendi i&amp;ccedil;erisinde, Document tipinden t&amp;uuml;reyen nesne &amp;ouml;rnekleri&amp;nbsp;&amp;uuml;zerinde ortak işlemlerin yapılmasını sağlamaktadır. S&amp;ouml;z gelimi birden fazla &lt;strong&gt;Document&lt;/strong&gt; tipinin yazdırılması veya&amp;nbsp;g&amp;ouml;nderilmesi bu ortak operasyonlar olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&amp;nbsp;Burada işin &amp;ouml;nemli kısımlarından birisi, &lt;strong&gt;Xps, Pdf &lt;/strong&gt;gibi sınıfların ve sonradan sisteme eklenecek Document t&amp;uuml;revli tiplerin, DocumentManager tarafında ortaklaşa kullanılabilecek olmasıdır. Dilerseniz &amp;ouml;rneğimize bakalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg38_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace Problem
{
    // Base Class
    abstract class Document
    {
        public int PageCount { get; set; }
        public string Name { get; set; }
        public string Owner { get; set; }

        public abstract void Send();
    }

    // Sub Class
    class Pdf
        : Document
    {
        public override void Send()
        {
            Console.WriteLine("PDF g&amp;ouml;nderme işlemi\n\tD&amp;ouml;k&amp;uuml;man {0}\n\tSayfa Sayısı -&amp;gt; {1}\n\tD&amp;ouml;k&amp;uuml;man sahibi -&amp;gt; {2}", Name, PageCount.ToString(), Owner);
        }
    }

    // Sub Class
    class Xps
        : Document
    {
        public override void Send()
        {
            Console.WriteLine("XPS g&amp;ouml;nderme işlemi\n\tD&amp;ouml;k&amp;uuml;man {0}\n\tSayfa Sayısı -&amp;gt; {1}\n\tD&amp;ouml;k&amp;uuml;man sahibi -&amp;gt; {2}", Name, PageCount.ToString(), Owner);
        }
    }

    // Client
    static class DocumentManager
    {
        public static void SendAll(Document[] dcmnts)
        {
            foreach (Document dcmnt in dcmnts)
            {
                dcmnt.Send();
            }
        }
    }

    class Program
    {
        static void Main(string[] args)
        {
            Document[] dcmnts ={
                                     new Pdf{ Name="eXtreme Programming.pdf", PageCount=800, Owner="The Good"},
                                     new Xps{Name="Programming with C#.xps", PageCount=350, Owner="The Bad"},
                                     new Xps{Name="Design Patterns.xps",PageCount=890,Owner="The Ugly"}
                                };

            DocumentManager.SendAll(dcmnts);            
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Console uygulaması &lt;strong&gt;Pdf&lt;/strong&gt; ve &lt;strong&gt;Xps&lt;/strong&gt; sınıflarına ait nesne &amp;ouml;rneklerinin toplandığı &lt;strong&gt;Document&lt;/strong&gt; tipinden bir diziyi oluşturmakta ve bunu &lt;strong&gt;DocumentManager&lt;/strong&gt; sınıfındaki &lt;strong&gt;SendAll&lt;/strong&gt; metoduna g&amp;ouml;ndermektedir. Xps ve Pdf tipleri, &lt;strong&gt;Document&lt;/strong&gt; sınıfından t&amp;uuml;remiştir ve &lt;strong&gt;Send&lt;/strong&gt; metodunun&amp;nbsp;&lt;strong&gt;abstract&lt;/strong&gt; olarak tanımlanması nedeniylede, s&amp;ouml;z konusu fonksiyonu kendi i&amp;ccedil;lerinde ezmişlerdir&lt;strong&gt;(Override)&lt;/strong&gt;. Bu nedenle Send metodu i&amp;ccedil;erisindeki d&amp;ouml;ng&amp;uuml;de, Document tipinden nesne &amp;ouml;rnekleri ele alınmasına rağmen, &lt;strong&gt;Send&lt;/strong&gt; metodu &amp;ccedil;alışma zamanında yeri geldiğinde Xps i&amp;ccedil;in, yeri geldiğinde de Pdf i&amp;ccedil;in &amp;ccedil;alıştırılacaktır. İşte nesne y&amp;ouml;nelimli olmanın g&amp;uuml;zel noktalarından birisi.&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Uygulamayı &amp;ccedil;alıştırdığımızda aşağıdaki sonu&amp;ccedil;lar alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg38_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ancak &lt;strong&gt;Liskov Substitution&lt;/strong&gt;&amp;nbsp;ilkesinin savunduğu da bir kural vardır. Bu kuralı g&amp;ouml;stermek i&amp;ccedil;in senaryomuzu şu andan itibaren biraz değiştiriyor olacağız. İlk olarak uygulamaya &lt;strong&gt;Document &lt;/strong&gt;sınıfından t&amp;uuml;reyen &lt;strong&gt;CSharp&lt;/strong&gt; isimli yeni bir tip eklediğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu tip cs uzantılı kod dosyalarını ifade etmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f6%2fblg38_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Yeni senaryomuza&amp;nbsp;g&amp;ouml;re &lt;strong&gt;CSharp&lt;/strong&gt; isimli tiplerin temsil ettiği d&amp;ouml;k&amp;uuml;manların(cs uzantılı kod dosyaları olarak d&amp;uuml;ş&amp;uuml;nebiliriz)&amp;nbsp;herhangibir sebeple &lt;strong&gt;Send&lt;/strong&gt; işlemine tabi tutulmaması gerekmektedir. Oysaki &lt;strong&gt;Send&lt;/strong&gt; metodu &lt;strong&gt;Document &lt;/strong&gt;tipi i&amp;ccedil;erisinde &lt;strong&gt;abstract &lt;/strong&gt;olarak tanımlandığından, CSharp tipi i&amp;ccedil;erisinde de ezilmesi gerekmektedir. Peki ya sistemde &lt;strong&gt;Send&lt;/strong&gt; işleminin yaptırtılması &lt;span style="text-decoration: underline;"&gt;istenmiyorsa&lt;/span&gt;...&lt;/p&gt;
&lt;p&gt;İki se&amp;ccedil;eneğimiz olabilir. Bunlardan birincisi &lt;strong&gt;CSharp&lt;/strong&gt; tipi i&amp;ccedil;erisindeki &lt;strong&gt;Send&lt;/strong&gt; metodundan &amp;uuml;st katmana doğru bir &lt;strong&gt;istisna(Exception)&lt;/strong&gt; fırlatmaktadır. Belkide geliştirici tarafından yazılmış bir istisna tipide s&amp;ouml;z konusu olabilir. Diğer bir alternatif ise &lt;strong&gt;Client&lt;/strong&gt; tipi i&amp;ccedil;erisindeki(DocumentManager sınıfı), &lt;strong&gt;SendAll&lt;/strong&gt; metodunda tip kontrol&amp;uuml; yapmaktır. Buna g&amp;ouml;re gelen tip &lt;strong&gt;CSharp&lt;/strong&gt; ise &lt;strong&gt;Send&lt;/strong&gt; işleminin icra &lt;span style="text-decoration: underline;"&gt;edilmemesi&lt;/span&gt; sağlanabilir. Bir başka deyişle kodlarımızı aşağıdak gibi g&amp;uuml;ncelleştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace Problem
{
    // Base Class
    abstract class Document
    {
        public int PageCount { get; set; }
        public string Name { get; set; }
        public string Owner { get; set; }

        public abstract void Send();
    }

    // Sub Class
    class Pdf
        : Document
    {
        public override void Send()
        {
            Console.WriteLine("PDF g&amp;ouml;nderme işlemi\n\tD&amp;ouml;k&amp;uuml;man {0}\n\tSayfa Sayısı -&amp;gt; {1}\n\tD&amp;ouml;k&amp;uuml;man sahibi -&amp;gt; {2}", Name, PageCount.ToString(), Owner);
        }
    }

    // Sub Class
    class Xps
        : Document
    {
        public override void Send()
        {
            Console.WriteLine("XPS g&amp;ouml;nderme işlemi\n\tD&amp;ouml;k&amp;uuml;man {0}\n\tSayfa Sayısı -&amp;gt; {1}\n\tD&amp;ouml;k&amp;uuml;man sahibi -&amp;gt; {2}", Name, PageCount.ToString(), Owner);
        }
    }

     // Sub Class
    class CSharp
        : Document
    {
        public override void Send()
        {
            // Se&amp;ccedil;eneklerden birisi exception fırlatılması olabilir. Bu durumda exception' ın &amp;uuml;st katmanlarda ele alınması(catch) gerekir.
            throw new Exception("Bu d&amp;ouml;k&amp;uuml;man i&amp;ccedil;in g&amp;ouml;nderme işlemi yapılamaz");
        }
    }

    // Client
    static class DocumentManager
    {
        public static void SendAll(Document[] dcmnts)
        {
            foreach (Document dcmnt in dcmnts)
            {
                // Bir diğer se&amp;ccedil;enek tip kontrol&amp;uuml; olabilir. Tipe g&amp;ouml;re s&amp;ouml;z konusu alt sınıf operasyonunun ger&amp;ccedil;ekleştirilmemesi sağlanabilir.
                if(dcmnt is CSharp)
                    continue;
                else
                    dcmnt.Send();
            }
        }
    }

    class Program
    {
        static void Main(string[] args)
        {
            Document[] dcmnts ={
                                     new Pdf{ Name="eXtreme Programming.pdf", PageCount=800, Owner="The Good"},
                                     new Xps{Name="Programming with C#.xps", PageCount=350, Owner="The Bad"},
                                     new CSharp{Name="ProductEntity.cs", PageCount=15, Owner="SourceSafe"},
                                     new Xps{Name="Design Patterns.xps",PageCount=890,Owner="The Ugly"}
                                };

            DocumentManager.SendAll(dcmnts);            
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnekte &lt;strong&gt;SendAll&lt;/strong&gt; metodu i&amp;ccedil;erisinde tip kontrol&amp;uuml; yapılarak s&amp;ouml;z konusu senaryonun ger&amp;ccedil;eklenmemesi sağlanmıştır. Hatta uygulama &amp;ccedil;alıştırıldığında bir &amp;ouml;nceki ile aynı sonu&amp;ccedil;lar alınacaktır.&amp;nbsp;Ancak burada ilk başka &lt;strong&gt;Open Closed&lt;/strong&gt; ilkesine ters d&amp;uuml;şen bir durum yaşanmaktadır. &amp;Ouml;yleki, sisteme yeni bir tip eklendiğinde, &lt;strong&gt;DocumentManager&lt;/strong&gt; i&amp;ccedil;erisindede değişiklik yapılması zorunludur. Zaten, &lt;strong&gt;Open Closed&lt;/strong&gt; prensibine uymayan durumlar &lt;strong&gt;Liskov&lt;/strong&gt; &lt;strong&gt;Substitution&lt;/strong&gt; ilkesininde bozulduğu anlamına gelmektedir. Liskov Substitution ilkesi bize şunu s&amp;ouml;ylemektedir; &lt;strong&gt;&amp;uuml;st sınıf ile alt sınıf nesne &amp;ouml;rnekleri yer değiştirdiklerinde, &amp;uuml;st sınıf kullanıcısı alt sınıfın operasyonlarına erişmeye devam edebilmelidir. &lt;/strong&gt;Oysaki son senaryoda, &lt;strong&gt;CSharp&lt;/strong&gt; alt sınıfındaki operasyona erişilirken &amp;ouml;zel bir işlem yapılması gerekmiştir(tip kontrol&amp;uuml; veya istisna yakalama işlemi). Bu &amp;ouml;rnekte &lt;strong&gt;LSP&lt;/strong&gt; ilkesine aykırı olan durumu ortadan kaldırmak i&amp;ccedil;in yapılması gereken tek şey vardır oda &lt;strong&gt;CSharp&lt;/strong&gt; sınıfını &lt;strong&gt;Document&lt;/strong&gt; sınıfına ait &lt;strong&gt;Domain&lt;/strong&gt; yapısından &amp;ccedil;ıkartmak.&lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Internet ve basılı kaynaklarda &lt;strong&gt;LSP&lt;/strong&gt; ilkesini araştırdığınızda &lt;strong&gt;Rectangle&lt;/strong&gt; ve &lt;strong&gt;Square&lt;/strong&gt; &amp;ouml;rneği ilede karşılaşabilirsiniz. Bu senaryoda, &lt;strong&gt;Liskov&lt;/strong&gt; &lt;strong&gt;Substitution&lt;/strong&gt; ilkesini son derece basit ve yalın bir dille anlatmaktadır. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f6%2fLSP.rar"&gt;LSP.rar (23,83 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-06-29 12:57:00</pubDate>
  <slug>Tasarim-Prensipleri-Liskov-Substitution</slug>
  <tags>
    <tag>design-principles</tag>
  </tags>
  <categories>
    <category>Tasarım Prensipleri(Design Principles)</category>
  </categories>
</post>