<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>DataView Sınıfı ve Faydaları</title>
  <description>Bugünkü makalemizde getirileri ve performansı ile ADO.NET içerisinde önemli bir yere sahip olan DataView nesnesini incelemeye çalışacağız. Özellikle bu sınıfa ait, RowFilter özelliğinin ne gibi faydalar sağlıyacağına da değineceğiz. DataView sınıfı, veritabanı yönetim sistemlerindeki view nesneleri göz önüne alınarak oluşturulmuş bir sınıftır. Bilindiği gibi veritabanı yönetim sistemlerinde (DBMS-DataBase Management System) , bir veya birden fazla tablo için gerçekleştireceğimiz çeşitli tipteki birleştirici veya ayrı ayrı sorgulamalar sonucu elde edilen veri kümelerini view nesnelerine aktarabilmekteyiz. View nesneleri sahip oldukları veri alt kümelerini temsil eden birer veritabanı nesnesi olarak, önceden derlendiklerinden, süratli ve performansı yüksek yapılardır.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde getirileri ve performansı ile ADO.NET i&amp;ccedil;erisinde &amp;ouml;nemli bir yere sahip olan DataView nesnesini incelemeye &amp;ccedil;alışacağız. &amp;Ouml;zellikle bu sınıfa ait, RowFilter &amp;ouml;zelliğinin ne gibi faydalar sağlıyacağına da değineceğiz.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;DataView sınıfı, veritabanı y&amp;ouml;netim sistemlerindeki view nesneleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınarak oluşturulmuş bir sınıftır. Bilindiği gibi veritabanı y&amp;ouml;netim sistemlerinde (DBMS-DataBase Management System) , bir veya birden fazla tablo i&amp;ccedil;in ger&amp;ccedil;ekleştireceğimiz &amp;ccedil;eşitli tipteki birleştirici veya ayrı ayrı sorgulamalar sonucu elde edilen veri k&amp;uuml;melerini view nesnelerine aktarabilmekteyiz. View nesneleri sahip oldukları veri alt k&amp;uuml;melerini temsil eden birer veritabanı nesnesi olarak, &amp;ouml;nceden derlendiklerinden, s&amp;uuml;ratli ve performansı y&amp;uuml;ksek yapılardır.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z gelimi her hangibi tabloya ait bir filtreleme işini bir view nesnesinde barındırabiliriz. Bunun sonucu olarak, aynı sorguyu yazıp &amp;ccedil;alıştırmak, view nesnesinin i&amp;ccedil;eriğine( yani sahip olduğu verilere) bakmaktan &amp;ccedil;ok daha yavaştır. Bununla birlikte bu sorgulamanın birden fazla tabloyu i&amp;ccedil;erdiğini d&amp;uuml;ş&amp;uuml;n&amp;uuml;rsek, bu durumda da &amp;ccedil;alıştırılan sorgu sonucu elde edilecek veri alt k&amp;uuml;melerini bir(birka&amp;ccedil;) view nesnesinde barındırmak bize performans, hız olarak geri d&amp;ouml;necektir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Gelelim ADO.NET&amp;rsquo; e. ADO.NET i&amp;ccedil;ersinde de, view lara benzer bir &amp;ouml;zellik olarak DataView nesneleri yer almaktadır. DataView nesneleri, veritabanı y&amp;ouml;netim sistemlerinde yer alan view&amp;rsquo;lar ile benzerdir. Yine performans ve hız a&amp;ccedil;ısından avantajlıdır. Bunların yanında bir DataView nesnesi kullanılabilmek, mutlaka bir DataTable nesnesini gerektirmektedir. Nitekim DataView nesnesinin sahip olacağı veri alt k&amp;uuml;meleri bu dataTable nesnesinin bellekte işaret ettiği tablo verileri &amp;uuml;zerinden alınacaktır. DataView nesnesinin kullanımının belkide en g&amp;uuml;zel yeri şudur; bir DataTable nesnesinin bellekte işaret ettiği tablodan, bir den fazla g&amp;ouml;r&amp;uuml;n&amp;uuml;m elde ederekten, bu farklı g&amp;ouml;r&amp;uuml;n&amp;uuml;mleri birden fazla kontrole bağlayarak, ekranda aynı anda tek bir tablonun verilerine ait birden fazla veri k&amp;uuml;mesini izlememiz m&amp;uuml;mk&amp;uuml;n olabilmektedir. İşte bu, bence DataView nesnesi(lerini) kullanmanın ne kadar faydalı olduğunu g&amp;ouml;stermektedir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bilindiği gibi DataTable nesnesine ait Select &amp;ouml;zelliğine ifadeler atayarakta var olan bir tablodan veri alt k&amp;uuml;meleri elde edebiliyorduk. Fakat bu select &amp;ouml;zelliğine atanan ifade sonucu elde edilen veriler bir DataRows dizisine aktarılıyor ve kontollere bağlanamıyordu. Oysaki DataView sonu&amp;ccedil;larını istediğiniz kontrole bağlamanız m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.DataTable ile DataView arasında yer alan bir farkta, DataTable&amp;rsquo;ın sahip olduğu satırlar DataRow sınıfı ile temsil edilirken DataView nesnesinin sahip olduğu satırlar DataRowView sınıfı ile temsil edilirler. Bir DataTable nesnesine nasıl ki yeni satırlar ekleyebiliyor, silebiliyor ve primary key &amp;uuml;zerinden arama yapabiliyorsak aynı işlemleri DataView nesnesi i&amp;ccedil;inde yapabiliriz. Bunları AddNew, Delete ve Find y&amp;ouml;ntemleri ile yapabiliriz. Bir sonraki makalemizde bu metodlar ile ilgili geniş bir &amp;ouml;rnek daha yapacağız. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde konuya a&amp;ccedil;ıklık getirmesi a&amp;ccedil;ısından iki adet &amp;ouml;rnek yapacağız. Her iki &amp;ouml;rneğimizde ağırlıklı olarak DataView nesnesinin RowFilter &amp;ouml;zelliği &amp;uuml;zerinde duracak. RowFilter &amp;ouml;zelliği DataTable sınıfının Select &amp;ouml;zelliğine &amp;ccedil;ok benzer. Bir s&amp;uuml;zme ifadesi alır. Oluşturulan ifade i&amp;ccedil;inde, kullanılacak alan(alanların) veri tiplerine g&amp;ouml;re bazı semboller kullanmamız gerekmektedir. Bunu a&amp;ccedil;ıklayan tablo aşağıda belirtilmiştir.&amp;nbsp;&lt;/p&gt;
&lt;div&gt;
&lt;table id="AutoNumber1" style="width: 513px;" border="1" cellspacing="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td bgcolor="#cccccc" width="134"&gt;&lt;strong&gt;Veri Tipi&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#cccccc" width="144"&gt;&lt;strong&gt;Kullanılan Karakter&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#cccccc" width="193"&gt;&lt;strong&gt;&amp;Ouml;rnek&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="134"&gt;T&amp;uuml;m Metin Değerleri&lt;/td&gt;
&lt;td width="144"&gt;' (Tek tırnak)&lt;/td&gt;
&lt;td width="193"&gt;" Adi='Burak' "&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="134"&gt;Tarihsel Değerler&lt;/td&gt;
&lt;td width="144"&gt;#&lt;/td&gt;
&lt;td width="193"&gt;" DogumTarihi=#04.12.1976# "&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="134"&gt;Sayısal Değerler&lt;/td&gt;
&lt;td width="144"&gt;Hi&amp;ccedil;birşey&lt;/td&gt;
&lt;td width="193"&gt;" SatisTutari&amp;gt;150000000"&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Tablo 1. Veritipine g&amp;ouml;re kullanılacak &amp;ouml;zel karakterler&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Diğer yandan RowFilter &amp;ouml;zelliğinde IN, Like gibi işle&amp;ccedil;ler kullanarak &amp;ccedil;eşitli değişik sorgular elde edebiliriz.Mantıksal birleştiriciler yardımıyla(and,or...) birleşik ifadeler oluşturabiliriz. Aslında RowFilter &amp;ouml;zelliği sql&amp;rsquo;de kullandığımız ifadeler ile aynıdır. &amp;Ouml;rnekler verelim;&lt;/p&gt;
&lt;div&gt;
&lt;table id="AutoNumber2" style="width: 646px;" border="1" cellspacing="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td bgcolor="#cccccc" width="109"&gt;&lt;strong&gt;Kullanılan İşle&amp;ccedil;&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#cccccc" width="149"&gt;&lt;strong&gt;&amp;Ouml;rnek&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#cccccc" width="346"&gt;&lt;strong&gt;Ne Yapar?&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="109"&gt;IN&lt;/td&gt;
&lt;td width="149"&gt;" PUAN IN(10,20,25) "&lt;/td&gt;
&lt;td width="346"&gt;PUAN isimli alan 10, 20 veya 25 olan satırlar.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="109"&gt;LIKE&lt;/td&gt;
&lt;td width="149"&gt;" ADI LIKE 'A*' "&lt;/td&gt;
&lt;td width="346"&gt;ADI A ile başlayanlar (* burada asteriks karakterimizdir.)&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Tablo 2. İşle&amp;ccedil;ler.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdi gelin konuyu daha iyi anlayabilmek amacıyla &amp;ouml;rneklerimize ge&amp;ccedil;elim. Konuyu anlayabilmek i&amp;ccedil;in iki farklı &amp;ouml;rnek yapacağız. İlk &amp;ouml;rneğimizde, aynı DataTable i&amp;ccedil;in farklı g&amp;ouml;r&amp;uuml;n&amp;uuml;mler elde edip bunları kontrollere bağlayacağız. İlk &amp;ouml;rneğimizde, &amp;ccedil;eşitli ifadeler kullanıp değişik alt veri k&amp;uuml;meleri alacağız. İşte kodlarımız,&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection conFriends;
SqlDataAdapter da;
DataTable dtKitaplar; 
     /* Baglan metodumuz ile SqlConnection nesnemizi oluşturarak, sql sunucumuza ve Friends isimli veritabanımıza bağlanıyoruz. Daha sonra ise SqlDataAdapter nesnemiz vasıtasıyla Kitaplar isimli tablodan t&amp;uuml;m verileri alıp DataTable nesnemize y&amp;uuml;kl&amp;uuml;yoruz. */ 
public void Baglan()
{
     conFriends=new SqlConnection("data source=localhost;initial catalog=Friends;integrated security=sspi");
     da=new SqlDataAdapter("Select * From Kitaplar",conFriends);
     dtKitaplar=new DataTable("Kitap Listesi");
     da.Fill(dtKitaplar);
}
private void Form1_Load(object sender, System.EventArgs e)
{
     Baglan();
     DataView dvTum_Kitaplar=dtKitaplar.DefaultView; /* Bir DataTable nesnesi yaratıldığı zaman, standart olarak en az bir tane g&amp;ouml;r&amp;uuml;n&amp;uuml;me sahiptir. Bu varsayılan g&amp;ouml;r&amp;uuml;n&amp;uuml;m bir DataView nesnesi d&amp;ouml;nd&amp;uuml;ren DefaultView metodu ile elde edilebilir. &amp;Ccedil;alıştırdığımız sql sorgusu Kitaplar tablosundaki t&amp;uuml;m kayıtları aldığınıdan buradaki DefaultView'da aynı veri k&amp;uuml;mesini sahip olucak bir DataView nesnesi d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Biz bu d&amp;ouml;nen veri k&amp;uuml;mesini dvTum_Kitaplar isimli DataView nesnesine aktardık. Daha sonra ise DataView nesnemizi dgTum_Kitaplar isimli dataGrid nesnemize bağladık.*/
     dgTum_Kitaplar.DataSource=dvTum_Kitaplar; 
     /* Yeni bir DataView nesnesini yapılandırıcısının değişik bir versiyonu ile oluşturuyoruz. Bu yapılandırıcı 4 adet parametre alıyor. İlk parametremiz dataTable nesnemiz, ikinci parametremiz RowFilter ifademiz ki burada Adi alanı B ile başlayanları buluyor, &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; parametremiz sıralamanın nasıl yapılacağı ki burada Adi alanında g&amp;ouml;re tersten sıralama yapıyor. Son parametre ise, DataViewRowState t&amp;uuml;r&amp;uuml;nden bir parametre. Bu &amp;ouml;zellik DataView i&amp;ccedil;erisinde ye alan her bir DataRowView'un (yani satırın) durumunun değerini belirtir. Alacağı değerler
      * 1. Added ( Sadece DataView'a eklenen satırları ifade eder)
      * 2. Deleted ( Sadece DataView'dan silinmiş satırları ifade eder)
      * 3. CurrentRows ( O an i&amp;ccedil;in ge&amp;ccedil;erli t&amp;uuml;m satırları ifade eder)
      * 4. ModifiedCurrent ( Değiştirilen satırların o anki değerlerini ifade eder)
      * 5. ModifiedOriginal ( Değiştirilen satırların orjinal değerlerini ifade eder)
      * 6. Unchanged ( Herhangibir değişikliğe uğramamış satırları ifade eder)
      * 7. OriginalRows ( T&amp;uuml;m satırların asıl değerlerini ifade eder)
      * 8. None (Herhangibir satır d&amp;ouml;nd&amp;uuml;rmez)
     Buna g&amp;ouml;re bizim DataView nesnemiz g&amp;uuml;ncel satırları d&amp;ouml;nd&amp;uuml;recektir. */ 
     DataView dvBIleBaslayan=new DataView(dtKitaplar,"Adi Like 'B*'","Adi Desc",DataViewRowState.CurrentRows);
     dgA.DataSource=dvBIleBaslayan; 
     /* Şimdi ise 2002 yılı ve sonrası Basım tarihine sahip verilerden oluşan bir DataView nesnesi oluşturuyoruz. Bu kez yapıcı metodumuz sadece DataTable nesnemizi parametre olarak aldı. Diğer ayarlamaları RowFilter,Sort &amp;ouml;zellikleri ile yaptık. Sort &amp;ouml;zelliğimiz sıralama kriterimizi belirliyor.*/
     DataView dv2002Sonrasi=new DataView(dtKitaplar);
     dv2002Sonrasi.RowFilter="BasimTarihi&amp;gt;=#1.1.2002#";
     dv2002Sonrasi.Sort="BasimTarihi Asc";
     /* Bu kez DataView nesnemizi bir ListBox kontrol&amp;uuml;ne bağladık ve sadece Adi alanı değerlerini g&amp;ouml;stermesi i&amp;ccedil;in ayarladık.*/
     lstPahali.DataSource=dv2002Sonrasi;
     lstPahali.DisplayMember="Adi";
} &lt;/pre&gt;
&lt;p&gt;&amp;Ccedil;alışma sonucu ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;m&amp;uuml;z şekil 1&amp;rsquo;deki gibi olur.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;img src="/makale/images/mk19_1.gif" alt="" width="638" height="383" border="0" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 1. İlk Programın Sonucu&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdi gelelim ikinci uygulamamıza. Bu uygulamamızda yine Kitaplar tablosunu ele alacağız. Bu kez RowFilter &amp;ouml;zelliğine vereceğimiz ifadeyi &amp;ccedil;alışma zamanında biz oluşturacağız. Alanımızı se&amp;ccedil;ecek, sıralama kriterimizi belirleyecek,aranacak değeri gireceğiz. Girdiğimiz değerlere g&amp;ouml;re program kodumuz bir RowFilter Expression oluşturacak. Programın ekran tasarımını ben aşağıdaki gibi yaptım. Sizde buna benzer bir tasarım ile işe başlayın.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" align="left"&gt;&lt;img src="/makale/images/mk19_2.gif" alt="" width="639" height="357" border="0" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" align="left"&gt;Ş&lt;em&gt;ekil2. Form Tasarımı&lt;/em&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdide kodlarımızı yazalım.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection conFriends;
SqlDataAdapter da;
DataTable dtKitaplar;
DataView dvKitaplar; 
/* Bu metod cmbAlanAdi isimli comboBox kontrol&amp;uuml;n&amp;uuml;, dataTable nesnemizin bellekte temsil ettigi tablonun Alanlari ile doldurur. Nitekim bu alanlari, RowFilter &amp;ouml;zelliginde kullanacagiz. */
public void AlanDoldur()
{
     for(int i=0;i&amp;lt;dtKitaplar.Columns.Count;++i)
     {
          this.cmbAlanAdi.Items.Add(dtKitaplar.Columns[i].ColumnName.ToString());
          this.cmbAlanSira.Items.Add(dtKitaplar.Columns[i].ColumnName.ToString());
     }
}
private void Form1_Load(object sender, System.EventArgs e)
{
     conFriends=new SqlConnection("data source=localhost;initial catalog=Friends;integrated security=sspi");
     da=new SqlDataAdapter("Select Kategori,Adi,Yazar,BasimEvi,BasimTarihi,Fiyat From Kitaplar",conFriends);
     dtKitaplar=new DataTable("Kitap Listesi");
     /* DataTable nesnemizin bellekte temsil ettigi alani,Kitaplar tablosundaki veriler ile, SqlDataAdapter nesnemizin Fill metodu sayesinde dolduruyoruz.*/
     da.Fill(dtKitaplar); 
     dvKitaplar=new DataView(dtKitaplar); /* Dataview nesnemizi yaratiyoruz. Dikkat ederseniz yapici metod, paremetre olarak DataTable nesnemizi aliyor. Dolayisiyla DataView nesnemiz, dataTable i&amp;ccedil;indeki veriler ile dolmus sekilde olusturuluyor.*/ 
     dataGrid1.DataSource=dvKitaplar; /* DataGrid kontrol&amp;uuml;m&amp;uuml;ze veri kaynagi olarak, DataView nesnemizi isaret ederek, DataView i&amp;ccedil;indeki verileri g&amp;ouml;stermesini sagliyoruz.*/ 
     AlanDoldur();
}
     /* Bu butona bastigimizda, kullanıcının se&amp;ccedil;tigi alan, filtreleme kriteri ve filtreleme i&amp;ccedil;in kullanilacak deger verileri belirlenerek, DataView nesnesinin RowFilter metodu i&amp;ccedil;in bir syntax belirleniyor.*/
private void btnCreateFilter_Click(object sender, System.EventArgs e)
{
     string secilenAlan=cmbAlanAdi.Text;
     string secilenKriter=cmbKriter.Text;
     string deger=""; 
     /* If kosullu ifadelerinde, se&amp;ccedil;ilen alanin veri tipine bakiyoruz. Nitekim RowFilter metodunda, alan'in veri tipine g&amp;ouml;re ifademiz degisiklik g&amp;ouml;steriyor. Tarih tipindeki verilerde # karakteri aranan metnin basina ve sonuna gelirken, string tipinde degerlerde ' karakteri geliyor. Sayisal tipteki degerler i&amp;ccedil;in ise herhangibir karakter ifadenin aranan degerin basina veya sonuna eklenmiyor. */
     if(dtKitaplar.Columns[secilenAlan].DataType.ToString()=="System.String")
          deger="'"+txtDeger.Text+"'";
     if(dtKitaplar.Columns[secilenAlan].DataType.ToString()=="System.DateTime")
          deger="#"+txtDeger.Text+"#";
     if(dtKitaplar.Columns[secilenAlan].DataType.ToString()=="System.Decimal")
          deger=txtDeger.Text; 
     txtFilter.Text=secilenAlan+secilenKriter+deger; /* Olusturulan ifade g&amp;ouml;rmemiz i&amp;ccedil;in textBox kontrol&amp;uuml;m&amp;uuml;ze yaziliyor. */
} 
private void btnFilter_Click(object sender, System.EventArgs e)
{
     dvKitaplar.RowFilter=txtFilter.Text; /* DataView nesnemizin RowFilter metoduna, ilgili ifademiz atanarak, s&amp;uuml;zme islemini ger&amp;ccedil;eklestirmis oluyoruz. */
     dvKitaplar.Sort=cmbAlanSira.Text+" "+cmbSiralamaKriteri.Text; /* Burada ise Sort &amp;ouml;zelligine siralama yapmak i&amp;ccedil;in gerekli veriler ataniyor. */
} &lt;/pre&gt;
&lt;p&gt;Şimdi uygulamamızı &amp;ccedil;alıştıralım ve deneyelim.&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &lt;img src="/makale/images/mk19_3.gif" alt="" width="600" height="400" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 3. Programın &amp;Ccedil;alışması&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin ben, Fiyatı 10 milyon TL&amp;rsquo; sının &amp;uuml;st&amp;uuml;nde olan kitapların listesini Adlarına g&amp;ouml;re z den a ya sıralanmış bir şekilde elde ettim.Değerli okurlarım geldik bir makalemizin daha sonuna. DataView nesnesinin &amp;ouml;zellikle RowFilter tekniğine ilişkin olarak yazdığımız bu makale ile inanıyorum ki yeni fikirler ile donanmışsınızdır. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2003-12-15 04:00:00</pubDate>
  <slug>DataView-Sc4b1nc4b1fc4b1-ve-Faydalarc4b1-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>dataview</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>