<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Oyun Programlamaya Giriş (Çarpışma Teknikleri - 2)</title>
  <description>Hatırlayacağınız gibi bir önceki makalemizde, Oyun Programcılığına girmek adına çarpışma tekniklerini incelemeye başlamış ve dörtgenlerin çarpışmalarını ele almıştık. Bugünkü makalemizde ise, dairesel şekillerin birbirleri ile olan çarpışmalarını incelemeye çalışacağız. Dairesel şekillerin çarpışmasına verilebilecek en güzel örnek, kaynaklardan edindiğim bilgiye göre Bilardo oyunlarıdır. Burada gerçekten de mükemmel dairelerin birbirleriyle olan çarpışmaları söz konusudur. Şunuda hatırlatmakta fayda var. Şu an için teorilerimizi iki boyutlu uzayda inceliyoruz. Elbetteki işin için üç boyutlu cisimler girdiğinde kullanacağımız algoritmalar ve teknikler birazda olsa farklılık gösterecektir. Çünkü uzay boyutunda X ve Y koordinatlarına ek olarak Z koordinatlarıda işin içine girecektir. Bu da iki boyutlu bir sistemde Bilardo oyunun tasarlanmasının 3 boyutlu sistemdekine göre daha kolay olduğunu göstermektedir.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Hatırlayacağınız gibi bir &amp;ouml;nceki makalemizde, Oyun Programcılığına girmek adına &amp;ccedil;arpışma tekniklerini incelemeye başlamış ve d&amp;ouml;rtgenlerin &amp;ccedil;arpışmalarını ele almıştık. Bug&amp;uuml;nk&amp;uuml; makalemizde ise, dairesel şekillerin birbirleri ile olan &amp;ccedil;arpışmalarını incelemeye &amp;ccedil;alışacağız. Dairesel şekillerin &amp;ccedil;arpışmasına verilebilecek en g&amp;uuml;zel &amp;ouml;rnek, kaynaklardan edindiğim bilgiye g&amp;ouml;re Bilardo oyunlarıdır. Burada ger&amp;ccedil;ekten de m&amp;uuml;kemmel dairelerin birbirleriyle olan &amp;ccedil;arpışmaları s&amp;ouml;z konusudur. Şunuda hatırlatmakta fayda var. Şu an i&amp;ccedil;in teorilerimizi iki boyutlu uzayda inceliyoruz. Elbetteki işin i&amp;ccedil;in &amp;uuml;&amp;ccedil; boyutlu cisimler girdiğinde kullanacağımız algoritmalar ve teknikler birazda olsa farklılık g&amp;ouml;sterecektir. &amp;Ccedil;&amp;uuml;nk&amp;uuml; uzay boyutunda X ve Y koordinatlarına ek olarak Z koordinatlarıda işin i&amp;ccedil;ine girecektir. Bu da iki boyutlu bir sistemde Bilardo oyunun tasarlanmasının 3 boyutlu sistemdekine g&amp;ouml;re daha kolay olduğunu g&amp;ouml;stermektedir.&lt;/p&gt;
&lt;p&gt;Dairesel nesnelerin &amp;ccedil;arpışmalarını belirlemek i&amp;ccedil;in eski dostumuz Pisagor Teoreminden faydalanacağız. Burada ana fikir, dairelerin merkezlerinin birbirlerine olan doğrusal uzaklıkları ile yarı&amp;ccedil;aplarının toplamlarının karşılaştırılmasıdır. Eğer, dairelerin merkezleri arası doğrusal uzaklık, dairelerin yarı&amp;ccedil;apları toplamından k&amp;uuml;&amp;ccedil;&amp;uuml;k ise, dairelerin &amp;uuml;st &amp;uuml;ste geldiklerinden dolayısıyla &amp;ccedil;arpıştıklarından s&amp;ouml;z edebiliriz. Olayı aşağıdaki şekil ile ele almaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk107_1.gif" alt="" width="481" height="324" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. Dairelerin &amp;Ccedil;arpışması.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Burada bizim i&amp;ccedil;in anahtar şekil, dairelerin merkezleri arasında oluşan BMA dik &amp;uuml;&amp;ccedil;genidir. Biz bu &amp;uuml;&amp;ccedil;gen yardımıyla, A ve B noktaları arasındaki mesafeyi, başka bir deyişle BMA &amp;uuml;&amp;ccedil;geninin hipoten&amp;uuml;s&amp;uuml;n&amp;uuml; bulabiliriz. Bu bizim i&amp;ccedil;in en kilit noktadır. Sonrasında ise, bu mesafeyi Ra ve Rb yarı&amp;ccedil;aplarının toplamı ile karşılaştırmamız yeterli olacaktır. Dolayısıyla &amp;ccedil;arpışma form&amp;uuml;l&amp;uuml;m&amp;uuml;z aşağıdaki gibi olmalıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk107_2.gif" alt="" width="281" height="166" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. &amp;Ccedil;arpışma Teorimiz.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi yapmamız gereken, X ve Y koordinatları arasındaki mesafelerden yararlanarak, &amp;uuml;&amp;ccedil;genin hiptone&amp;uuml;s&amp;uuml;n&amp;uuml; (yani iki daire merkezi arasındaki doğrusal uzaklığı) bulmak ve bulduğumuz değeri, yarı&amp;ccedil;apların toplamı ile karşılaştırmaktır. Şimdi dilerseniz, bu teoriyi C# ile geliştirilmiş bir windows uygulamasında nasıl simule edeceğimize bakalım. Geliştireceğimiz uygulama her zamanki gibi basit ve anlamsız olacak. Ancak amacımız, yukarıdaki teoremi uygulamak ve sonu&amp;ccedil;larını g&amp;ouml;rmek. Bu ama&amp;ccedil;la aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne ait bir windows uygulaması geliştirdim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk107_3.gif" alt="" width="319" height="276" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. Uygulama tasarımımız.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Kodlarımız ise aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;/*global değişkenlerimizi tanımlıyoruz. */
float Top1_X,Top1_Y,Top2_X,Top2_Y,Top1_R,Top2_R;
double Hipotenus,YaricapToplam;

/*X,Y Koordinatlari ile yari&amp;ccedil;aplar belirleniyor.*/
private void Hesapla()
{
    Top1_R=Top1.Width/2;
    Top1_X=Top1.Left+Top1_R;
    Top1_Y=Top1.Top+Top1_R;

    Top2_R=Top2.Width/2;
    Top2_X=Top2.Left+Top2_R;
    Top2_Y=Top2.Top+Top2_R;

    float Fark_X=Math.Abs(Top1_X-Top2_X);
    float Fark_Y=Math.Abs(Top1_Y-Top2_Y);

    Hipotenus=Math.Sqrt((Fark_X*Fark_X)+(Fark_Y*Fark_Y));

    YaricapToplam=Top1_R+Top2_R;
}

/* &amp;Ouml;l&amp;ccedil;&amp;uuml;mleri ekrana yazdırmak i&amp;ccedil;in string değer d&amp;ouml;nd&amp;uuml;ren bir metod hazırlıyoruz.*/
private string Olcumler()
{
    string olcum="Top 1 i&amp;ccedil;in X:"+Top1_X.ToString();
    olcum+=" Y:"+Top1_Y.ToString();
    olcum+=" R:"+Top1_R.ToString();
    olcum+=" | Top 2 i&amp;ccedil;in X:"+Top2_X.ToString();
    olcum+=" Y:"+Top2_Y.ToString();
    olcum+=" R:"+Top2_R.ToString();
    olcum+=" | Hipoten&amp;uuml;s:"+Hipotenus.ToString();
    return olcum;
}

private void frmCollision2_Load(object sender, System.EventArgs e)
{ 
    Hesapla();
    lblOlcumler.Text=Olcumler();
}

/* Form &amp;uuml;zerinde A,S,D,W tuşlarına basıldığında, Top2 isimli pictureBox' ın hareket etmesini sağlıyoruz.*/
private void frmCollision2_KeyPress(object sender, System.Windows.Forms.KeyPressEventArgs e)
{
    if(e.KeyChar==(Char)Keys.A)
    {
        Top2.Left-=1;
        Hesapla();
        lblOlcumler.Text=Olcumler();
    }
    if(e.KeyChar==(Char)Keys.D)
    {
        Top2.Left+=1;
        Hesapla();
        lblOlcumler.Text=Olcumler();
    } 
    if(e.KeyChar==(Char)Keys.S)
    {
        Top2.Top+=1;
        Hesapla();
        lblOlcumler.Text=Olcumler();
    }
    if(e.KeyChar==(Char)Keys.W)
    {
        Top2.Top-=1;
        Hesapla();
        lblOlcumler.Text=Olcumler();
    }
    Kontrol();
}

/* &amp;Ccedil;arpışma kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; yapıyoruz. */
private void Kontrol()
{
    if(Hipotenus&amp;lt;YaricapToplam)
    {
        this.Text="";
        this.Text+=" |!!! &amp;Ccedil;ARPISMA VAR !!!| ";
    }
    else
        this.Text="";
}&lt;/pre&gt;
&lt;p&gt;Kodlarımız son derece a&amp;ccedil;ık. Dikkat etmemiz gereken noktalardan birisi, Top1 ve Top2 isimli nesnelerin X ve Y koordinatlarının bulunmasıdır. Burada Left ve Top &amp;ouml;zelliklerinin yanısıra daire merkezlerini tam olarak bulabilmek i&amp;ccedil;in, Width veya Height (daire olduklarından X veya Y' ye eklenecek mesafelerin Width veya Height ile hesaplanması farketmez) değerlerinden birisinide g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almamız gerekir. Yani aşağıdaki kodlarda olduğu gibi;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Top1_R=Top1.Width/2;
Top1_X=Top1.Left+Top1_R;
Top1_Y=Top1.Top+Top1_R;

Top2_R=Top2.Width/2;
Top2_X=Top2.Left+Top2_R;
Top2_Y=Top2.Top+Top2_R;&lt;/pre&gt;
&lt;p&gt;Bunun dışında Hipoten&amp;uuml;s hesaplamasında elbetteki karek&amp;ouml;k almak i&amp;ccedil;in Math sınıfının Sqrt fonksiyonundan yaralanmaktayız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Hipotenus=Math.Sqrt((Fark_X*Fark_X)+(Fark_Y*Fark_Y));&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda, Top2 isimli nesneyi herhangibir y&amp;ouml;nden Top1 isimli nesne &amp;uuml;st&amp;uuml;ne getirirsek &amp;ccedil;arpışmanın meydana geldiğini kolayca tespit edebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-family: Verdana;"&gt;&lt;img src="/makale/images/mk107_4.gif" alt="" width="312" height="272" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. &amp;Ccedil;arpışmanın &amp;ccedil;alışma zamanında tespit edilmesi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;arpışmalar ile ilgili bir diğer &amp;ouml;nemli durumda, d&amp;ouml;rtgenler ile dairelerin &amp;ccedil;arpışmalarının nasıl tespit edilebileceğidir. Bu kez, daire merkez nesne olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;l&amp;uuml;r ve d&amp;ouml;rtgenin daireye olan en yakın ve en uzak noktaları değerlendirilerek &amp;ccedil;arpışmanın olup olmadığına bakılır. Bu teoriyide bir sonraki makalemizde incelemeye &amp;ccedil;alışacağız. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-11-12 10:00:00</pubDate>
  <slug>Oyun-Programlamaya-Giriş-(Çarpışma-Teknikleri-2)-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>game-programming</tag>
    <tag>pisagor</tag>
    <tag>matematik</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>