<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Derinlemesine Session Kullanımı - 1</title>
  <description>Bu makalemizde, Asp.Net sunucularında durum yönetimi (state management) amacıyla kullanılan Session nesnesini detaylı bir şekilde incelemeye başlıyacağız. Bildiğiniz gibi, web anatomisinde durum yönetimi başlı başına bir terminolojidir. Web sitelerinin yer aldığı web sunucularının istemci makinelerde durum yönetme yeteneğine sahip olamamaları sonucu, belli bir kullanıcıya ait bilgilerin sayfalar arasında korunması veya taşınabilmesi için değişik teknikler geliştirilmiştir. Session kullanımı bu tekniklerden birisidir. Öncelikle Session kavramının ne olduğunu ve ne için kullanıldığını kavramaya çalışalım.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, Asp.Net sunucularında durum y&amp;ouml;netimi (state management) amacıyla kullanılan Session nesnesini detaylı bir şekilde incelemeye başlıyacağız. Bildiğiniz gibi, web anatomisinde durum y&amp;ouml;netimi başlı başına bir terminolojidir. Web sitelerinin yer aldığı web sunucularının istemci makinelerde durum y&amp;ouml;netme yeteneğine sahip olamamaları sonucu, belli bir kullanıcıya ait bilgilerin sayfalar arasında korunması veya taşınabilmesi i&amp;ccedil;in değişik teknikler geliştirilmiştir. Session kullanımı bu tekniklerden birisidir. &amp;Ouml;ncelikle Session kavramının ne olduğunu ve ne i&amp;ccedil;in kullanıldığını kavramaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;p&gt;Bir kullanıcı, bir web sunucusundan herhangibir sayfa talep ettiğinde, web sunucusu bu kullanıcı i&amp;ccedil;in kendi sistemi &amp;uuml;zerinde veya yardımcı bir sunucuda (web farm' lar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında) bir oturum başlatır. İşte Session nesneleri yardımıyla kullanıcıya ait olan bu oturum boyunca sayfalar arasında bilgi taşıma işlemini ger&amp;ccedil;ekleştirebiliriz. Session kullanımına verilebilecek en g&amp;uuml;zel ve klasik &amp;ouml;rnek, kullanıcılarının alış veriş sepetleri ile birlikte site i&amp;ccedil;indeki sayfalar boyunca gezinebilmeleridir. Burada temel fikir kullanıcının sahip olduğu sepete ait bilgileri site i&amp;ccedil;erisinde yer alan sayfalar boyunca taşıyabilmektir. Biz bu ama&amp;ccedil;la Session nesnelerini kullanabilir ve kullanıcının oturumu sonlanıncaya kadar sayfalar arasında veri taşıyabiliriz. Elbette başlayan bir oturum mutlaka bir şekilde sonlandırılır. Bir oturum temel olarak aşağıdaki nedenlerden dolayı sonlanabilir?&lt;/p&gt;
&lt;table id="table2" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#cccccc"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="border-style: solid; border-width: 1px;" colspan="2"&gt;
&lt;p align="center"&gt;&lt;strong&gt;Oturum Sonlanmasına Neden Olacak Etmenler&lt;/strong&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="border-style: solid; border-width: 1px;" bgcolor="#ffffff" width="35%"&gt;Oturumun zaman aşımına uğraması. (Timeout)&lt;/td&gt;
&lt;td style="border-left-style: solid; border-left-width: 1px; border-right-style: solid; border-right-width: 1px; border-bottom-style: solid; border-bottom-width: 1px;" bgcolor="#ffffff" width="62%"&gt;Varsayılan olarak sunucu &amp;uuml;zerinde a&amp;ccedil;ılan her bir oturum 20 dakikalık zaman aşımı s&amp;uuml;resine sahiptir. Sitemizi ziyaret eden kullanıcıların Session verileri ile ne kadar s&amp;uuml;re durabilecekleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınarak bu s&amp;uuml;re daha da d&amp;uuml;ş&amp;uuml;r&amp;uuml;lebilir veya arttırılabilir. S&amp;uuml;rede yapılan ayarlamalar kesinlikle sunucuya ait bellek t&amp;uuml;ketimini etkileyecektir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="border-style: solid; border-width: 1px;" bgcolor="#ffffff" width="35%"&gt;Kullanıcının tarayıcı penceresini kapatması veya sayfaya yeni bir tarayıcı penceresi a&amp;ccedil;arak ulaşması.&lt;/td&gt;
&lt;td style="border-style: solid; border-width: 1px;" bgcolor="#ffffff" width="62%"&gt;Bir web sunucusu kullanıcının tarayıcısını kapatıp kapatmadığını anlayamaz. Onun yerine barındırdığı sayfalara yapılan &amp;ccedil;ağrıları tespit eder. Dolayısıyla bir kullanıcı a&amp;ccedil;ık bir oturuma sahip iken tarayıcısını kapattığında veya yeni bir tarayıcı penceresi a&amp;ccedil;tığında aynı sayfaya yeni bir oturum i&amp;ccedil;inde bağlanır. Bunun sebebi sunucunun &amp;uuml;rettiği ASP.NET_SessionId' lerin her bir istekte yeniden oluşturulmasıdır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="border-style: solid; border-width: 1px;" bgcolor="#ffffff" width="35%"&gt;Oturum kapatılmaya zorlandığında.&lt;/td&gt;
&lt;td style="border-style: solid; border-width: 1px;" bgcolor="#ffffff" width="62%"&gt;Session nesnesine Abondon metodu uygulanarak oturumlar iptal edilebilir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="border-style: solid; border-width: 1px;" bgcolor="#ffffff" width="35%"&gt;Sunucu yeniden başlatıldığında.&lt;/td&gt;
&lt;td style="border-style: solid; border-width: 1px;" bgcolor="#ffffff" width="62%"&gt;Bir sunucunun yeniden başlatılması eğer SessionId değerleri işlem i&amp;ccedil;inde (yani asp.net work processor' un a&amp;ccedil;tığı iş par&amp;ccedil;alarında) tutuluyorsa otomatik olarak kaybedilecektir. Ancak SessionId lerin bir Sql sunucusunda database' de veya StateServer isimli windows servisinde tutulması sağlanarak bu kayıpların &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ilebilir.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Gelelim Session nesnelerinin sunucu tarafından doğru istemciler ile nasıl eşleştirilebildiğine. Web sunucusundan bir sayfa talep edildiğinde&lt;strong&gt; (1)&lt;/strong&gt; Asp.Net Work Processor bu istemci i&amp;ccedil;in otomatik olarak benzersiz bir tanımlama (Unique Identity) değeri &amp;uuml;retir&lt;strong&gt; (2)&lt;/strong&gt;. Bu 120 bitlik bir sayıdır ve &amp;ouml;zel bir algoritma yardımıyla sunucu &amp;uuml;zerinde oluşturulur. Daha sonra bu talep karşılığında sunucu, oluşturduğu ASP.NET_SessionId değerini istemci bilgisayara g&amp;ouml;nderir &lt;strong&gt;(3)&lt;/strong&gt;. Bu ASP.NET_SessionId değerinin istemci &amp;uuml;zerinde tutuluşu varsayılan olarak bir &amp;ccedil;erez (Cookie) vasıtasıyla sağlanır &lt;strong&gt;(4)&lt;/strong&gt;. Aynı değer Sunucu &amp;uuml;zerinde de yer almaktadır &lt;strong&gt;(4)&lt;/strong&gt;. Bu noktadan itibaren istemci, kendisine ait oturumu sunucu &amp;uuml;zerinde bir şekilde sonlanıncaya kadar, site i&amp;ccedil;erisinde bu ASP.NET_SessionId değeri ile tanınır. Dolayısıyla artık sunucu, oturum sahibinin kim olduğunu bilmektedir.&lt;/p&gt;
&lt;table id="table3" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;Tanıma&lt;/strong&gt;; Sunucular oturum sahiplerini tanıyabilmek i&amp;ccedil;in, &amp;ouml;zel bir algoritma ile oluşturdukları 120 bitlik benzersiz bir tanımlayıcı değer kullanırlar. &lt;strong&gt;ASP.NET_SessionId&lt;/strong&gt;.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Ancak burada istisnai bir durum vardır. Her istemci cookie' leri desteklemez. Bu durumda yapılacak ufak bir ayarlama ile ASP.NET_SessionId değerinin url' ye eklenmesi sağlanır. Bunu ilerleyen safhalarda inceleyeceğiz. Aşağıdaki şekil basit olarak bir SessionId değerinin nasıl oluşturulduğunu betimlemektedir. Bu varsayılan, yani Cookie desteği veren tarayıcılar i&amp;ccedil;in ge&amp;ccedil;erli olan senaryodur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk111_1.gif" alt="" width="482" height="387" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Session nesnesine atanan veriler web sunucusu &amp;uuml;zerindeki bellekte tutulmaktadır. Bu bilgiler asla istemci bilgisayara g&amp;ouml;nderilmezler. Bu da g&amp;uuml;venlik a&amp;ccedil;ısından &amp;ouml;nemli bir avantajdır.&lt;/p&gt;
&lt;table id="table4" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;G&amp;uuml;venlik;&lt;/strong&gt; Session nesnelerine ait veriler Sunucu &amp;uuml;zerindeki bellek alanlarında tutulur ve asla istemcilere g&amp;ouml;nderilmez.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Burada dikkat etmemiz gereken &amp;ouml;nemli bir husus vardır. Session bilgilerinin sunucu belleğinde (varsayılan olarak budur) tutulması. Bir Session nesnesinin en b&amp;uuml;y&amp;uuml;k &amp;ouml;zelliklerinden birisi serileştirilebilir (Serializable) nesneleri taşıyabilme &amp;ouml;zelliğine sahip olmasıdır. Yani, bir Session nesnesi yardımıyla kullanıcının oturumu boyunca bir DataSet nesnesini sayfalar arasında dolaştırabiliriz. Peki burada dikkat etmemiz gereken nokta nedir? Sorun DataSet gibi bir nesnenin tek başına &amp;ccedil;alıştığı bir bilgisayar i&amp;ccedil;in bile fazla bellek alanı harcamasıdır. Yani, sunucuya bağlanan her bir kullanıcı i&amp;ccedil;in oturum s&amp;uuml;resi boyunca DataSet nesne &amp;ouml;rneklerinin taşınması sunucu kaynaklarını ciddi &amp;ouml;l&amp;ccedil;&amp;uuml;de azaltır. Bellekte meydana gelen bu azalma elbetteki web sunucusunun performansını olumsuz y&amp;ouml;nde etkileyecektir.&lt;/p&gt;
&lt;table id="table5" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;Performans;&lt;/strong&gt; Bir web uygulamasında Session nesnelerinin DataSet nesne &amp;ouml;rnekleri taşıdığını varsayarsak, N sayıda kullanıcının bağlanması, sunucu belleğinde N sayıda DataSet nesne &amp;ouml;rneğinin oluşturulması anlamına gelmektedir.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Peki &amp;ccedil;&amp;ouml;z&amp;uuml;m olarak ne &amp;uuml;retebiliriz? İlk olarak &amp;ouml;nbellekleme tekniklerini kullanabiliriz. Ya da Serileştirilebilir nesneleri &amp;ouml;rneklendiren sınıfları kendimiz yazarız. Tabi b&amp;ouml;yle bir durumda yazacağımız sınıflarında serileştirilebilir olması bir başka deyişle serileştirmeye izin veren nitelikleri (Attribute) kullanması gerekecektir. Bu konuyu ilerleyen makalelerimizde incelemeye &amp;ccedil;alışacağız. Elbetteki bir Session sadece serileştirilebilir nesneleri değil her tipte .NET nesne &amp;ouml;rneğini saklayabilir.&lt;/p&gt;
&lt;p&gt;Bu kısa a&amp;ccedil;ıklamalardan sonra dilerseniz, Session nesnelerinin nasıl oluşturulduğuna ve kullanıldığına kod kısmından basit bir &amp;ouml;rnel ile bakmaya &amp;ccedil;alışalım. Aşağıdaki uygulamada, default.aspx, sayfa2.aspx ve sayfa3.aspx isimli 3 adet web sayfamız var. Biz default.aspx i&amp;ccedil;erisinde kullanıcıdan isim ve soyisim bilgisini alıyor ve bunu Session nesnemizde tutuyoruz. Daha sonra sayfa2.aspx ve sayfa3.aspx i&amp;ccedil;erisinden bu session değerlerini okuyup ekrana yazdırıyoruz. Default.aspx ilk a&amp;ccedil;ıldığında, &amp;uuml;retilen ASP.NET_SessionId değerini de Session nesnesinin SessionId &amp;ouml;zelliği ile elde ediyoruz. &amp;Ouml;rnek uygulamayı &lt;a href="/makale/images/SessionSample1.zip"&gt;bu linkten&lt;/a&gt; indirebilirsiniz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;//default.aspx
private void btnEkle_Click(object sender, System.EventArgs e)
{
    Session["Kimlik"]=txtBilgi.Text; //Session' a değer atıyoruz.
}

//sayfa2.aspx
private void Page_Load(object sender, System.EventArgs e)
{
    lblAdSoyad.Text=Session["Kimlik"].ToString(); //Session değerini okuyoruz.
}

//sayfa3.aspx
private void Page_Load(object sender, System.EventArgs e)
{
    lblAdSoyad.Text=Session["Kimlik"].ToString(); //Session değerini okuyoruz.
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk111_2.gif" alt="" width="485" height="711" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Yukarıdaki &amp;ouml;rnek Session kullanımının en basit halidir.&lt;/p&gt;
&lt;p&gt;Oturum y&amp;ouml;netiminde işimize yarayacak iki olay vardır. Session_Start ve Session_End olayları. Bir istemci bir web sunucusunda bir oturum başlattığında uygulamaya ait global.asax dosyasında yer alan Session_Start olayı &amp;ccedil;alışır. Oturum herhangibir neden ile sonlandığında ise yine global.asax dosyasındaki Session_End olayı &amp;ccedil;alışır. Bu olaylar yardımıyla, uygulamanızda oturum halinde bulunan kullanıcı, sayısını bir başka deyişle sayfadaki ziyaret&amp;ccedil;i sayısını &amp;ouml;ğrenebilirsiniz. &amp;Ouml;rneğin az &amp;ouml;nceki uygulamamızı ele alalım ve Global.asax dosyasında aşağıdaki değişiklikleri yapalım. Uygulamamızdaki default.aspx sayfasında da aktif ziyaret&amp;ccedil;i sayısını g&amp;ouml;stermek i&amp;ccedil;in bir label kullanacağız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void Session_Start(Object sender, EventArgs e)
{
    /*Uygulama seviyesinde bir değişken kullanmak istediğimizden Application nesnesini kullandık. Eğer ilk kez oturum a&amp;ccedil;ılıyor ise varsayılan değeri 1 olarak ayarlıyoruz. İlk kez a&amp;ccedil;ılmıyorsa var olan değeri 1 arttırıyoruz.*/
    if((int)Application["ToplamZiyaretci"]==0)
        Application["ToplamZiyaretci"]=1;
    else
    {
        int deger=(int)Application["ToplamZiyaretci"];
        deger+=1;
        Application["ToplamZiyaretci"]=deger;
    }
}

protected void Session_End(Object sender, EventArgs e)
{
    /* Oturum kapatıldığında devereye giren bu olayda, uygulama seviyesindeki Application nesnesinde saklanan değerini 1 azaltıyoruz. B&amp;ouml;ylece online ziyaret&amp;ccedil;i sayısını 1 azaltmış oluyoruz.*/
    int deger=(int)Application["ToplamZiyaretci"];
    deger-=1;
    Application["ToplamZiyaretci"]=deger;
}&lt;/pre&gt;
&lt;p&gt;Kodda dikkat ederseniz Application nesnesinin değerini deger isimli değişkene alırken (int) t&amp;uuml;r d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme operat&amp;ouml;r&amp;uuml;n&amp;uuml; kullandık. Bunun sebebi, Application nesnesininde Session nesnesi gibi verileri object tipinde saklıyor olmasıdır. Dolayısıyla Session veya Application nesnelerinin değerlerini okurken uygun t&amp;uuml;r d&amp;ouml;n&amp;uuml;ş&amp;uuml;mlerini a&amp;ccedil;ık&amp;ccedil;a yapmamız gerekiyor.&lt;/p&gt;
&lt;p&gt;Artık tek yapmamız gereken Application nesnesinin değerini okumak ve label kontrol&amp;uuml;m&amp;uuml;ze yazdırmak.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void Page_Load(object sender, System.EventArgs e)
{
    Session["Kimlik"]=txtBilgi.Text;
    lblZiyaretciSayisi.Text=Application["ToplamZiyaretci"].ToString();
}&lt;/pre&gt;
&lt;p&gt;Bundan sonra uygulamamıza her yeni oturum a&amp;ccedil;ışımızda, Session_Start devreye girecek ve kullanıcı sayısını otomatik olarak 1 arttıracaktır. Session'lar sonlandığında ise 1 eksileceklerdir. Bunu daha iyi kavrayabilmek i&amp;ccedil;in oturumların timeout s&amp;uuml;resini 1 dakikaya indirelim. Session nesnesinin TimeOut &amp;ouml;zelliğine 1 değerini atayarak bunu sağlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Session.Timeout=1;&lt;/pre&gt;
&lt;p&gt;Şimdi peş peşe tarayıcı pencereleri a&amp;ccedil;ıp uygulamamızın olduğu default.aspx sayfasını &amp;ccedil;ağıralım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk111_3.gif" alt="" width="507" height="430" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada da g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, Session_Start olayı başarılı bir şekilde &amp;ccedil;alışarak Application nesnesinin ToplamZiyaretci elemanının değerini s&amp;uuml;rekli olarak 1 arttırmıştır. Lakin biz Session Timeout s&amp;uuml;resini 1 dakika yaptığımız i&amp;ccedil;in 1 dakika sonra Session nesnesinin değerinin null olması gerekmektedir. Bu s&amp;uuml;reyi bekledikten sonra yeni bir tarayıcı penceresi a&amp;ccedil;ıp sayfamıza girmek istersek aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşırız. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ToplamZiyaretci değeri başlangı&amp;ccedil; değerine atanmıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk111_4.gif" alt="" width="438" height="235" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada diğer bir durum daha vardır. Diyelim ki Timeout s&amp;uuml;resini 10 dakika yaptık. Uygulama &amp;ccedil;alıştırıldı ve bir ka&amp;ccedil; oturum a&amp;ccedil;ıldı. Sonra ise, 10 dakika dolmadan &amp;ouml;nce Timeout s&amp;uuml;resini 1 dakika yaptık. Ardından yeni oturumlar a&amp;ccedil;tık. Son oturum a&amp;ccedil;ışından 1 dakika ge&amp;ccedil;tikten sonra, &amp;ouml;nceden yaşam s&amp;uuml;releri 10 dakika iken &amp;ccedil;alışan oturumlar durumlarını korumaya devam ederler.&lt;/p&gt;
&lt;p&gt;Bazen istemci tarayıcılar Cookie desteğine sahip değildir veya bu &amp;ouml;zellikleri bilerek kapatılmıştır. Peki b&amp;ouml;yle bir durumda istemci bilgisayar, sunucuda kendisi i&amp;ccedil;in a&amp;ccedil;ılan oturum ile nasıl eşleştirilebilir? Bu sorunun &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; ASP.NET_SessionId değerinin site i&amp;ccedil;inde hareket edilen sayfaların linklerine eklenmesidir. Asp.Net bunu bizim i&amp;ccedil;in otomatik olarak yapmaktadır. Tek yapmamız gereken web.config dosyasında sessionState elemanında, Cookieless &amp;ouml;zelliğine true değerini atamaktır.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;sessionState 
    mode="InProc" stateConnectionString="tcpip=127.0.0.1:42424" 
    sqlConnectionString="data source=127.0.0.1;Trusted_Connection=yes" 
    cookieless="true" 
    timeout="20" 
/&amp;gt;&lt;/pre&gt;
&lt;p&gt;Eğer uygulamamızı bu haliyle denersek sayfalar arasında gezinirken url bilgilerinin aşağıdaki gibi değiştiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ASP.NET_SessionId değeri otomatik olarak relative url bilgisinin &amp;ouml;n&amp;uuml;ne eklenmiştir.&lt;/p&gt;
&lt;p&gt;default.aspx i&amp;ccedil;in;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk111_5.gif" alt="" width="414" height="224" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Eğer bu sayfadan diğer sayfalara ge&amp;ccedil;iş yapar isek, oluşturulan ASP.NET_SessionId değerinin bu sayfaların url bilgisine de eklendiğini dolayısıyla Session' ın korunduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk111_6.gif" alt="" width="406" height="230" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Ancak burada dikkat etmemiz gereken &amp;ouml;nemli bir nokta vardır. Linkler arasında ASP.NET_SessionId değerinin url bilgisi ile aktarılabilmesini istiyorsak relative linkleri kullanmak zorundayız. Yani Sayfa2 başlıklı LinkLabel nesnesinin NavigateUrl &amp;ouml;zelliğinin değerine, sayfa2.aspx (default.aspx ile aynı lokasyonda olduğu i&amp;ccedil;in) değerini vermemiz gerekir. Eğer buraya http://localhost/SessionSample1/Sayfa2.aspx gibi bir tam yol linki verirsek; bu linke tıkladığımızda default.aspx' teki oturum yok sayılacak ve yeni bir oturum a&amp;ccedil;ılmaya &amp;ccedil;alışılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk111_7.gif" alt="" width="513" height="434" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi default.aspx sayfasını a&amp;ccedil;tığımızda oluşan ASP.NET_SessionId değeri ile, buradan Sayfa2.aspx' e gittiğimizde URL bilgisine eklenen ASP.NET_SessionId değerinden farklıdır. Dahası burada, Sayfa2.aspx i&amp;ccedil;in yeni bir oturum s&amp;ouml;z konusu olduğundan, default.aspx i&amp;ccedil;inde oluşturulan Session["Kimlik"] bilgisine buradan erişilemiyecektir. Bunun sonucuda da var olmayan bir nesneye erişmek istediğimizden hata almaktayız.&lt;/p&gt;
&lt;p&gt;Bu makalemizde Session nesnesine kısaca değinmeye &amp;ccedil;alıştık. İzleyen makalemizde, Session nesnesi ile ilgili daha farklı konulara g&amp;ouml;z atmaya &amp;ccedil;alışacağız. Bu konular arasında ASP.NET_SessionId değerlerinin bir sql sunucusunda veya StateServer servisinde tutulması da yer almaktadır. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-12-30 18:00:00</pubDate>
  <slug>Derinlemesine-Session-Kullanc4b1mc4b1-1-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet</tag>
    <tag>session</tag>
  </tags>
  <categories>
    <category>Asp.Net</category>
  </categories>
</post>