<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net Core - Dependency Lifetimes</title>
  <description>Asp.Net 5 tarafında Dependency Injection ile ilişkili kafa karıştıran ve saha çözümlerinde dikkat gerektiren konulardan birisi de servis yaşam süreleridir(lifetimes) Bu kısa yazıda söz konusu meseleyi basit bir şekilde anlamaya çalışacağız. Örneğimiz bir önceki yazımızda da kullandığımız .Net çözümü üzerinde geliştirilecek. Dolayısıyla kodun detaylarına github adresinden bakabilirsiniz. Ben odaklanmamız gereken kısımları ve sonuçları paylaşmaya çalışarak bakmamız gereken alanı daraltmaya çalışacağım. Dilerseniz neler yaptığımız bir bakalım.</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Nisan/hellomvc_11.png" alt="" align="right" /&gt;&amp;Ccedil;alışmakta olduğum şirketin &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k bir ERP&lt;em&gt;(Enterprise Resource Planning)&lt;/em&gt; uygulaması var. Microsoft .Net Framework 1.0 s&amp;uuml;r&amp;uuml;m&amp;uuml;nde d&amp;uuml;ş&amp;uuml;nce olarak hayat ge&amp;ccedil;irilip geliştirilmeye başlanmış. Milyonlarca satır koddan ve sayısız sınıftan oluşan, katmanlı monolitik mimari &amp;uuml;st&amp;uuml;nde y&amp;uuml;r&amp;uuml;yen,&amp;nbsp;sahada on binden fazla personelin kullandığı &amp;ccedil;ok etkili bir &amp;uuml;r&amp;uuml;n.&amp;nbsp;Ge&amp;ccedil;tiğimiz yıl bu uygulamanın modernizasyonu kapsamında başlatılan IT4IT &amp;ccedil;alışmaları b&amp;uuml;nyesinde nesne bağımlılıklarının y&amp;ouml;netimi i&amp;ccedil;in Dependency Injection mekanizmasının nimetlerinden de epeyce yararlanıldı. Doğruyu s&amp;ouml;ylemek gerekirse koda yaptıkları dokunuşları hayranlıkla izledim.&lt;/p&gt;
&lt;p&gt;Elbette başa dert olan ve sahada fark edilmesi g&amp;uuml;&amp;ccedil; bazı konular da g&amp;uuml;ndeme gelmedi değil. Bunlarda birisi de bağımlı nesnelerin yaşam &amp;ouml;m&amp;uuml;rleri ile alakalıydı. Ger&amp;ccedil;ekten b&amp;ouml;ylesine b&amp;uuml;y&amp;uuml;k bir sistemde AddTransient ile mi gitmeli yoksa AddScoped olarak mı bırakmalı gibi sorulara cevap vermek kolay değil. &amp;Ouml;ncelikle şu nesne yaşam &amp;ouml;mr&amp;uuml; meselesini anlamak gerekiyor. Bende hazır evden &amp;ccedil;ıkmamız yasak kitaplarıma g&amp;ouml;m&amp;uuml;lm&amp;uuml;şken bu meseleyi iyice bir &amp;ouml;ğreneyim istiyorum. Kapak fotoğrafı mı? Her zaman ki gibi konumuzla bir alakası yok. Sadece yazıyı yazarken&amp;nbsp;dinlemekte olduğum Bon Jovi'nin 1984 &amp;ccedil;ıkışlı st&amp;uuml;dyo alb&amp;uuml;m&amp;uuml;ne ait :D&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Aslında Asp.Net 5 a&amp;ccedil;ısından bakıldığında da Dependency Injection ile ilişkili kafa karıştıran ve saha &amp;ccedil;&amp;ouml;z&amp;uuml;mlerinde dikkat gerektiren konulardan birisi servis yaşam s&amp;uuml;releri&lt;em&gt;(Hoş, .Net Remoting ve WCF tarafındaki nesne yaşam d&amp;ouml;ng&amp;uuml;lerini d&amp;uuml;ş&amp;uuml;n&amp;uuml;nce nispeten &amp;ccedil;ok daha kolay bir konu)&amp;nbsp;&lt;/em&gt;Bu kısa yazıda s&amp;ouml;z konusu meseleyi &amp;ouml;ğrendiğim kadarıyla sizlere&amp;nbsp;anlatmaya &amp;ccedil;alışacağım. &amp;Ouml;rneğimiz &lt;a href="/post/asp-net-core-dependency-injection-turleri" target="_blank"&gt;bir &amp;ouml;nceki&amp;nbsp;yazıda&lt;/a&gt; da değindiğimiz .Net &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;&lt;em&gt;(hands-on-aspnetcore-di)&lt;/em&gt; &amp;uuml;zerinde koşuyor olacak. Ayrıca kodun detaylarına &lt;a href="https://github.com/buraksenyurt/hands-on-aspnetcore-di/tree/lifetimes" target="_blank"&gt;github adresinden&lt;/a&gt;&amp;nbsp;bakabilir ve eksik kısımları tamamlayabilirsiniz. Ben odaklanmamız gereken yerleri ve sonu&amp;ccedil;ları paylaşmaya &amp;ccedil;alışarak bakmamız gereken alanı daraltmak niyetindeyim. Her şeyden &amp;ouml;nce senaryomuza bir g&amp;ouml;z atalım&lt;em&gt;(Taslak &amp;ccedil;izimin kusurlarını l&amp;uuml;tfen mazur g&amp;ouml;r&amp;uuml;n)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Nisan/hellomvc_10.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Anlamsız bir model ancak nesne yaşamlarını &amp;ouml;ğrenmek i&amp;ccedil;in hem kitaplarda hem de internet kaynaklarında kullanılan yaygın bir y&amp;ouml;ntemi değerlendireceğiz; Guid tipi yardımıyla hayattaki nesnelerin takibi. Senaryomuzda GameController tipinin bağımlı olduğu d&amp;ouml;rt farklı bileşen var. Bu bağımlılıklar IGameRepository, IPartRepository, IShopRepository ve aray&amp;uuml;zleri &amp;uuml;st&amp;uuml;nden gelen sınıflar ile PerformanceCounter tipi. İşin ilgin&amp;ccedil; yanı PerformanceCounter sınıfının da IGameRepository, IPartRepository ve IShopRepository referansları &amp;uuml;zerinden gelen bileşenlere bağımlılığı var. Bu kurguda ama&amp;ccedil;, &amp;ccedil;alışma zamanında DI Container servislerine kayıt edilen IGameRepository, IPartRepository ve IShopRepository t&amp;uuml;revlerinin, PerformanceCounter i&amp;ccedil;erisine alınırken farklı yaşam s&amp;uuml;resi se&amp;ccedil;imlerine g&amp;ouml;re nasıl tepki geliştirdiklerini &amp;ouml;ğrenmek.&lt;/p&gt;
&lt;p&gt;Dependency Injection servis koleksiyonuna kayıt edilen bileşenler i&amp;ccedil;in normal şartlarda &amp;uuml;&amp;ccedil; tip yaşam &amp;ouml;mr&amp;uuml; se&amp;ccedil;eneği bulunuyor. Transient, Scoped ve Singleton. Genellikle konuya yabancı olan ben gibiler kolaya ka&amp;ccedil;ıp Transient se&amp;ccedil;eneğini tercih ediyor. Fakat duruma g&amp;ouml;re uygun olan modeli belirlemek lazım. &amp;Ouml;rneğin Entity Framework tarafına ait DbContext servisi kayıt edilirken neden Scoped olarak dahil ediliyor? Peki ya ILogger'ın varsayılan &amp;ouml;mr&amp;uuml; neden Singleton? Dolayısıyla aradaki farkları anlamamız &amp;ouml;nemli.&lt;/p&gt;
&lt;p&gt;DI Container'a Scoped t&amp;uuml;r&amp;uuml;nde kayıt edilen bir servis her web talebi i&amp;ccedil;in yeniden &amp;ouml;rnekleniyor. Singleton modelinde ise servis&amp;nbsp;bir kere &amp;ouml;rnekleniyor ve&amp;nbsp;uygulama&lt;em&gt;(Web App)&lt;/em&gt; ayakta kaldığı s&amp;uuml;rece yaşamaya devam ediyor. Dolayısıyla onu &amp;ccedil;&amp;ouml;z&amp;uuml;mleyen&lt;em&gt;(Resolve)&lt;/em&gt; bileşenler hep aynı nesne &amp;ouml;rneğini kullanıyorlar. Son olarak Transient se&amp;ccedil;eneğinde, bağımlı bileşen her nerede &amp;ccedil;&amp;ouml;z&amp;uuml;mlenirse &amp;ccedil;&amp;ouml;z&amp;uuml;mlensin hep yeni bir &amp;ouml;rneği oluşturularak kullanılıyor.&lt;/p&gt;
&lt;p&gt;İyi g&amp;uuml;zel hoş ama bunu canlı bir &amp;ouml;rnekle nasıl analiz ederiz? Yukarıdaki şekle g&amp;ouml;re gerekli kodlarımızı yazmaya başlayım. IGameRepository, IShopRepository ve IPartRepository aray&amp;uuml;zleri Guid tipinden birer &amp;ouml;zellik sunuyorlar. Bu Guid'leri onları uygulayan asıl bileşenlerin&lt;em&gt;(Concrete Instance)&lt;/em&gt; &amp;ccedil;alışma zamanındaki takibini yapmak i&amp;ccedil;in kullanacağız.&amp;nbsp;IShopRepository ve ShopRepository tiplerinin i&amp;ccedil;eriğini aşağıda bulabilirsiniz. Diğerleri de benzer bir d&amp;uuml;zeneğe sahipler.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using C64Portal.Models;
using System;

namespace C64Portal.Data
{
    public interface IShopRepository
    {
        public Guid InstanceID { get; set; }
        void Sell(Game game,decimal offer);
    }
}&lt;/pre&gt;
&lt;p&gt;ve onu uygulayan asıl sınıf&lt;em&gt;(Concrete Class)&lt;/em&gt;.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using C64Portal.Models;
using C64Portal.Queue;
using System;
using System.Collections.Generic;

namespace C64Portal.Data
{
    public class ShopRepository
        : IShopRepository
    {
        public Guid InstanceID { get; set; }
        public ShopRepository() :this(Guid.NewGuid())
        {
        }
        public ShopRepository(Guid instanceID)
        {
            InstanceID = instanceID;
        }

        public void Sell(Game game, decimal offer)
        {
            // Do Something
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İşe yarayan bir fonksiyon yok ancak yapıcı metodun&lt;em&gt;(constructor)&lt;/em&gt; nasıl kullanıldığı bizim i&amp;ccedil;in &amp;ouml;nemli. ShopRepository sınıfına ait bir nesne &amp;ouml;rneklenirken yeni bir Guid oluşturuyoruz. Varsayılan yapıcı metot, DI kayıt işlemi&lt;em&gt;(Register)&lt;/em&gt; sırasında gerekli olduğu i&amp;ccedil;in &amp;ccedil;ağrıldığında parametre ile donatılan diğer yapıcı metodu tetikliyor. Doğal olarak se&amp;ccedil;ilen lifetime kriterine g&amp;ouml;re takip edeceğimiz benzersiz bir değere sahip olmuş olacağız. Diğer aray&amp;uuml;z ve uyarlamalarını yazdıktan sonra PerformanceCounter sınıfını da aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace C64Portal.Data
{
    public class PerformanceCounter
    {
        public Guid ShopRepositoryID { get; set; }
        public Guid GameRepositoryID { get; set; }
        public Guid PartRepositoryID { get; set; }
        private readonly IGameRepository _gameRepository;
        private readonly IShopRepository _shopRepository;
        private readonly IPartRepository _partRepository;
        public PerformanceCounter(IGameRepository gameRepository, IShopRepository shopRepository, IPartRepository partRepository)
        {
            _gameRepository = gameRepository;
            _shopRepository = shopRepository;
            _partRepository = partRepository;
            GameRepositoryID = _gameRepository.InstanceID;
            ShopRepositoryID = _shopRepository.InstanceID;
            PartRepositoryID = _partRepository.InstanceID;
        }
        public void CalculateMemoryUsage()
        {
            //Do Something
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İğren&amp;ccedil; bir sınıf değil mi? :D Ancak yapıcı metoda yine dikkat edelim. Sınıfın bağımlı olduğu bileşenler, tasarladığımız aray&amp;uuml;zler &amp;uuml;zerinden &amp;ccedil;&amp;ouml;z&amp;uuml;mlenerek i&amp;ccedil;eri alınıyor ve gelen nesne &amp;ouml;rneklerinin Guid tipli &amp;ouml;zelliklerinin herbiri i&amp;ccedil;in ayrılmış alanlara atanıyorlar. Şimdi de GameController i&amp;ccedil;eriğini aşağıdaki gibi değiştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using C64Portal.Data;
using C64Portal.Models;
using C64Portal.Queue;
using Microsoft.AspNetCore.Mvc;
using Microsoft.Extensions.Logging;

namespace C64Portal.Controllers
{
    public class GameController : Controller
    {
        private readonly IGameRepository _gameRepository;
        private readonly IShopRepository _shopRepository;
        private readonly IPartRepository _partRepository;
        private readonly PerformanceCounter _performanceCounter;
        private readonly ILogger&amp;lt;GameController&amp;gt; _logger;
        public GameController(
            IGameRepository gameRepository
            ,IShopRepository shopRepository
            ,IPartRepository partRepository
            , PerformanceCounter performanceCounter
            , ILogger&amp;lt;GameController&amp;gt; logger)
        {
            _logger = logger;
            _performanceCounter = performanceCounter;
            _gameRepository = gameRepository;
            _shopRepository = shopRepository;
            _partRepository = partRepository;
        }
        public IActionResult Index()
        {
            _logger.LogInformation($"\n[SINGLETON]\tShopRepo ID:{_shopRepository.InstanceID},In Perf Counter:{_performanceCounter.ShopRepositoryID}");
            _logger.LogInformation($"\n[TRANSIENT]\tGameRepo ID:{_gameRepository.InstanceID},In Perf Counter:{_performanceCounter.GameRepositoryID}");
            _logger.LogInformation($"\n[SCOPED   ]\tPartRepo ID:{_partRepository.InstanceID},In Perf Counter:{_performanceCounter.PartRepositoryID}");

            var games = _gameRepository.GetAllGames();
            _performanceCounter.CalculateMemoryUsage();
            return View(games);
        }

        public IActionResult Create()
        {
            return View();
        }

        [HttpPost]
        public IActionResult Create(Game game)
        {
            _gameRepository.Publisher = new RabbitPublisher();
            _gameRepository.Create(game);
            return RedirectToAction("Index");
        }
    }
}&lt;/pre&gt;
&lt;p&gt;GameRepository'dekine benzer bir durum burada da s&amp;ouml;z konusu. Sadece fazladan PerformanceCounter ve ILogger bağımlılıkları da var. Lakin fazladan dediğimiz PerformanceCounter kullanımı &amp;ouml;nemli.&amp;nbsp;Web uygulaması &amp;ccedil;alıştığında&amp;nbsp;GameController&amp;nbsp;tipi her ne zaman &amp;ccedil;ağırılırsa&amp;nbsp;yapıcı metodu sebebiyle DI Container'dan IGameRepository, IShopRepository, IPartRepository ve PerformanceCounter referansları isteyecek. Bu da asıl sınıfların &amp;ouml;rneklendiği&lt;em&gt;(Constructor'ların tetiklenmesi)&lt;/em&gt; ya da &amp;ouml;rneklenmeyip &amp;ouml;rneklenmiş olanların verildiği bir operasyon anlamına geliyor. Diğer yandan PerformanceCounter'ın &amp;ccedil;ağırılması halinde onun da istediği IGameRepository, IPartRepository ve IShopRepository referansları var. PerformanceCounter sınıfı bunları da DI Container'dan isteyecek&lt;em&gt;(Hatta onu bilerek AddTransient olarak kayıt edeceğiz ki her &amp;ouml;rneklendiğinde DI'dan diğer aray&amp;uuml;z referanslarını istesin)&lt;/em&gt;&amp;nbsp;İşte bu ikinci isteklerde s&amp;ouml;z konusu servislerin hangi yaşam d&amp;ouml;ng&amp;uuml;s&amp;uuml; se&amp;ccedil;eneğine g&amp;ouml;re kaydedildiği &amp;ouml;nem kazanıyor. Diğer yandan ufak bir detay ama&amp;nbsp;Index isimli Action i&amp;ccedil;erisinde bir Log yayınladığımızı da fark etmiş olmalısınız. Loglamayı, Controller'a gelindiğinde ve Index fonksiyonu &amp;ccedil;ağırıldığında oluşan bağımlı bileşenlerin g&amp;uuml;ncel Guid değerlerini kaydetmek i&amp;ccedil;in kullanıyoruz. Bu arada t&amp;uuml;m bileşenlerin Constructor Injection tekniği ile &amp;ccedil;&amp;ouml;z&amp;uuml;mlendiğine dikkat edin ve başka hangi tekniklerden bahsetmiştik hatırlayın.&amp;nbsp;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bu arada loglamayı dilerseniz fiziki olarak bir Text dosyasına da yapabilirsiniz. Ben bunun i&amp;ccedil;in Serilog.Extensions.Logging.File isimli Nuget paketini projeye ekledim ve Startup sınıfındaki Configure metodunu da aşağıdaki gibi değiştirdim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void Configure(IApplicationBuilder app, IWebHostEnvironment env,
 ILoggerFactory loggerFactory)
{
	var path = Directory.GetCurrentDirectory();
	loggerFactory.AddFile($"{path}\\Logs\\Log.txt");&lt;/pre&gt;
&lt;/blockquote&gt;
&lt;p&gt;Gelelim bileşenlerin DI Servis kataloğuna kayıt edilmesine ki burası yazımızın d&amp;ouml;n&amp;uuml;m noktası. Bunun i&amp;ccedil;in Startup sınıfındaki ConfigureServices metodunu aşağıdaki gibi kullanabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void ConfigureServices(IServiceCollection services)
{
	services.AddControllersWithViews();

	services.AddTransient&amp;lt;IGameRepository, GameRepository&amp;gt;();
	services.AddScoped&amp;lt;IPartRepository, PartRepository&amp;gt;();
	services.AddSingleton&amp;lt;IShopRepository, ShopRepository&amp;gt;();
	services.AddTransient&amp;lt;PerformanceCounter&amp;gt;();

	services.AddTransient&amp;lt;DataCollectorService&amp;gt;();
}&lt;/pre&gt;
&lt;p&gt;IGameRepository &amp;uuml;st&amp;uuml;nden bağlanan GameRepository, AddTransient fonksiyonu ile eklenmiş durumda. Buna g&amp;ouml;re kendisine her ihtiya&amp;ccedil; duyulduğunda tekrardan &amp;ouml;rneklenecek. Yani onun adına hep yeni bir Guid değeri g&amp;ouml;rmemiz gerekiyor. PartRepository sınıfı ise AddScoped metodu ile dahil edilmiş durumda. Buna g&amp;ouml;re aynı Scope i&amp;ccedil;erisinde kalındığı s&amp;uuml;rece hem Controller hem de PerformanceCounter'da tekil bir PartRepository nesnesinin kullanılmasını bekliyoruz. Ta ki farklı bir scope'a ge&amp;ccedil;ip tekrar buraya d&amp;ouml;nene kadar&lt;em&gt;(Bunu diğer bir Controller'a ge&amp;ccedil;ip geri gelerek kontrol edebiliriz)&lt;/em&gt; Son olarak sıra AddSingleton ile eklenen ShopRepository nesnesinde. Buna g&amp;ouml;re web uygulaması &amp;ccedil;alıştığı s&amp;uuml;rece, sayfa yenilense&lt;em&gt;(&amp;Ouml;rneğin F5 ile)&lt;/em&gt; ya da farklı Controller ve Action metotları &amp;ccedil;alışsa bile, uygulama yeniden başlatılıncaya kadar tek bir ShopRepository &amp;ouml;rneğinin kullanılıyor olması lazım.&lt;/p&gt;
&lt;p&gt;Bu aşamaya geldiyseniz uygulamayı &amp;ccedil;alıştırıp logları takip etmeniz yeterli. Ben &amp;ouml;rneğin &amp;ccedil;alışma zamanına ait iki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; bırakmak istiyorum. İlki komut satırından y&amp;uuml;r&amp;uuml;t&amp;uuml;len &amp;ccedil;alışma zamanına ait. Console penceresine d&amp;uuml;şen logları g&amp;ouml;rebilirsiniz&lt;em&gt;(O değilde kopyala yapıştırın acı bir sonucu var burada. İki tane Prince of Persia eklenmiş yahu)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Nisan/hellomvc_8.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Paylaşmak istediğim diğer g&amp;ouml;r&amp;uuml;nt&amp;uuml; ise Guid bilgilerini topladığım Excel'e ait.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Nisan/hellomvc_9.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Guid değerlerinin hangi durumda nasıl farklılaştığını g&amp;ouml;rebiliyor musunuz? Bir nesnenin hangi aksiyonda nasıl davranış sergilediğini anlamak olduk&amp;ccedil;a kolay. ShopRepository sisteme Singleton modelde alındığı i&amp;ccedil;in hangi aksiyon olursa olsun &amp;uuml;retilen Guid hep aynı kalmakta. Sayfa yenilense de scope değişse de fark etmiyor. Yani GameController i&amp;ccedil;in de, onun i&amp;ccedil;inden &amp;ccedil;ağırılan PerformanceCounter i&amp;ccedil;in de aynı nesne kullanılıyor ve sayfa yenilense bile bu nesne yaşamaya devam ediyor. Lakin PartRepository nesnesine ait Guid bilgisi&amp;nbsp;ger&amp;ccedil;ekleşen aksiyon bazında değişmiş g&amp;ouml;r&amp;uuml;n&amp;uuml;yor. Fakat bir fark var. Aynı Scope'a dahil olan PerformanceCounter'da aynı PartRepository nesne &amp;ouml;rneğini kullanıyor. Bu nedenle Guid aksiyon bazında aynı kalmış halde. Bu noktada Scoped tekniğinin, Singleton ile s&amp;uuml;rekli olarak karıştırıldığını ifade edebilirim. Biri uygulama ayakta kaldığı m&amp;uuml;ddet&amp;ccedil;e aynı kalırken diğeri sadece ortak Scope'a dahil olan farklı aksiyonlar boyunca aynı kalıyor. O nedenle yapılan her aksiyonda yeni bir PartRepository &amp;ouml;rnekleniyor ve hem GameController hem PerformanceCounter bu aynı nesneyi kullanıyor. GameRepository ise olduk&amp;ccedil;a şımarık :) Aksiyon ne olursa olsun hep yeni bir Guid oluşmuş g&amp;ouml;r&amp;uuml;n&amp;uuml;yor; GameController tarafında da PerformanceCounter tarafında da.&lt;/p&gt;
&lt;p&gt;İşte bu kadar :)&lt;/p&gt;
&lt;p&gt;Bu &amp;ouml;rnekle bağımlı bileşenlerin nesne &amp;ouml;m&amp;uuml;rlerinin nasıl şekillendiği kafamda biraz daha netleşmiş oldu. Elbette ger&amp;ccedil;ek hayat senaryolarında bu se&amp;ccedil;imler olduk&amp;ccedil;a kritik &amp;ouml;neme sahip. T&amp;uuml;m uygulama yaşamı boyunca yaşayacak bir nesne &amp;ouml;rneği her ne kadar cazip g&amp;ouml;r&amp;uuml;nse de bellek t&amp;uuml;ketiminin bir anda artmasına sebebiyet verebilir. Ya da web talebi i&amp;ccedil;in bir nesne &amp;ouml;rneklenmesi, ilk oluşturma maliyeti y&amp;uuml;ksek olan bileşenler d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde performans kaybına neden olabilir. Her nesne gerektiğinde yeni bir &amp;ouml;rnek oluşturulması basit bir se&amp;ccedil;im gibi dursa da network trafiğinin aşırı derecede artmasına sebebiyet verebilir. Kaynaklar&amp;nbsp;en k&amp;ouml;t&amp;uuml; karar bile kararsızlıktan iyidir felsefesini benimseyerek&amp;nbsp;AddTransient olarak ilerleyin diyor. Bense vakaya g&amp;ouml;re se&amp;ccedil;im yapmamız gerekiğini d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum&lt;em&gt;(It depends hali)&lt;/em&gt;. Notlarıma burada son vermeden &amp;ouml;nce araştırmanız i&amp;ccedil;in iki konu bırakıyorum.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Sizce bir aray&amp;uuml;z &amp;uuml;st&amp;uuml;nden n sayıda bağımlı bileşeni DI Container servisine kayıt edebilir miyiz?&lt;/li&gt;
&lt;li&gt;&amp;Ccedil;alışma zamanının herhangi bir noktasında DI Container'a kayıt edilmiş servisleri tek tek veya toplu olarak silebilir miyiz?&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize sağlıklı, huzur dolu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2021-04-30 23:54:00</pubDate>
  <slug>asp-net-core-dependency-lifetimes</slug>
  <tags>
    <tag>dependency-injection</tag>
    <tag>di-container</tag>
    <tag>lifetimes</tag>
    <tag>addsingleton</tag>
    <tag>addscoped</tag>
    <tag>addtransient</tag>
    <tag>aspnet-core</tag>
    <tag>aspnet-5</tag>
    <tag>mvc</tag>
    <tag>controller</tag>
    <tag>logging</tag>
  </tags>
  <categories>
    <category>Asp.Net Core</category>
  </categories>
</post>