<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>AntiPatterns Ders Notlarım</title>
  <description>Yazının bundan sonraki bölümlerinde, AntiPatterns konusuna hazırlanırken aldığım çalışma notlarının derlenmiş halini bulabilirsiniz. Çok fazla düzenlenmemiş halleri ile paylaşıyorum. Aralara kendi yorumlarımı da katmaya çalıştım tabi. Faydalı olmasını dilerim...</description>
  <content>&lt;p&gt;&lt;a href="/pics/anti_0.png"&gt;&lt;img style="float: right; margin: 4px 0px; display: inline;" title="anti_0" src="/pics/anti_0_thumb.png" alt="anti_0" width="200" height="205" align="right" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Yazıyı yayınladığım şu andan sadece bir ka&amp;ccedil; saat sonra sekizinci &lt;a href="http://www.nedirtv.com" target="_blank"&gt;NedirTv&lt;/a&gt; kuruluş yıl d&amp;ouml;n&amp;uuml;m&amp;uuml; etkinliğinde konuşma fırsatı bulacağım. Konularım &lt;strong&gt;AntiPatterns &lt;/strong&gt;ve &lt;strong&gt;NoSQL&lt;/strong&gt;. &lt;strong&gt;AntiPatterns&lt;/strong&gt; konusu ile ilişkili olarak daha &amp;ouml;nceden &lt;strong&gt;Y.T.&amp;Uuml;.&lt;/strong&gt; tarafından d&amp;uuml;zenlenen &lt;strong&gt;&lt;a href="/post/YTU-Finans-ve-Yazc4b1lc4b1m-Gunleri" target="_blank"&gt;Finans ve Yazılım G&amp;uuml;nleri&lt;/a&gt;&amp;rsquo;&lt;/strong&gt; nde konuşma fırsatım olmuştu. Her iki etkinliğe de hazırlanırken, sekt&amp;ouml;rde yer aldığım s&amp;uuml;re i&amp;ccedil;erisinde g&amp;ouml;zlemlediğim bilgileri &lt;span style="text-decoration: underline;"&gt;&amp;ouml;zellikle&lt;/span&gt; dikkate almaya &amp;ccedil;alıştım. Pek tabi konuyu doğru bir şekilde aktarabilmek i&amp;ccedil;in teknik destek ve referans kaynaklar da gerekiyordu. Ş&amp;uuml;phesiz ki b&amp;ouml;ylesine &amp;ouml;nemli bir konu, teoride olduğu kadar pratikte de tecr&amp;uuml;be edilmişse izah edilebilirdi.&lt;/p&gt;
&lt;p&gt;Yazının bundan sonraki b&amp;ouml;l&amp;uuml;mlerinde, &lt;strong&gt;AntiPatterns&lt;/strong&gt; konusuna hazırlanırken aldığım &amp;ccedil;alışma notlarının derlenmiş halini bulabilirsiniz. &amp;Ccedil;ok fazla &lt;span style="text-decoration: underline;"&gt;d&amp;uuml;zenlenmemiş&lt;/span&gt; halleri ile paylaşıyorum. Aralara kendi yorumlarımı da katmaya &amp;ccedil;alıştım tabi. Faydalı olmasını dilerim &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_218.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;h1&gt;K&amp;uuml;&amp;ccedil;&amp;uuml;k Bir Hikaye&lt;/h1&gt;
&lt;p&gt;&lt;a href="/pics/storytime1.jpg"&gt;&lt;img style="float: left; margin: 4px 0px; display: inline;" title="storytime1" src="/pics/storytime1_thumb.jpg" alt="storytime1" width="200" height="200" align="left" /&gt;&lt;/a&gt;Vaktiyle zamanında &lt;strong&gt;Z&lt;/strong&gt; sekt&amp;ouml;r&amp;uuml;nde var olan k&amp;uuml;rsel &amp;ouml;l&amp;ccedil;ekli &lt;strong&gt;X&lt;/strong&gt; isimli bir firma varmış. Firmanın yazılım geliştirme alanında ikiy&amp;uuml;zden fazla elamanı bulunmaktaymış. Yazılım departmanı i&amp;ccedil;erisinde bir ka&amp;ccedil; grup bulunuyormuş. Bu guruplardan bazıları vaktiyle zamanında t&amp;uuml;m kurumu ilgilendiren bir takım s&amp;uuml;re&amp;ccedil;lerin &amp;ouml;nemli bir par&amp;ccedil;ası &amp;uuml;zerinde &amp;ccedil;alışmaya başlamışlar. Ne yazık ki farklı d&amp;ouml;nemlerde.&lt;/p&gt;
&lt;p&gt;İstenen iş bir d&amp;ouml;nem bir ekipte, diğer bir d&amp;ouml;nem başka bir ekipte ele alınmış. &amp;Uuml;r&amp;uuml;n&amp;uuml;n akademik destek gerektirebilecek &amp;ouml;nemli bir par&amp;ccedil;ası i&amp;ccedil;inse &lt;strong&gt;V&lt;/strong&gt; isimli &lt;strong&gt;Vendor&lt;/strong&gt;&amp;rsquo; la anlaşılmış. V, standart &amp;uuml;r&amp;uuml;n&amp;uuml;n&amp;uuml; ilk başından itibaren ekiplerin kullanımına sunmuş. Ancak, &lt;strong&gt;X&lt;/strong&gt;&amp;rsquo; nin iş biriminden gelen &amp;ouml;zel istekler nedeniyle standart &amp;uuml;r&amp;uuml;nlerini bazı noktalarda &amp;ouml;zelleştirmek zorunda kalmış. &amp;Ouml;rneğin sırf &lt;strong&gt;X&lt;/strong&gt; firması istediği i&amp;ccedil;in uzmanlık alanına girmediği halde aray&amp;uuml;zler tasarlamış.&lt;/p&gt;
&lt;p&gt;Bir s&amp;uuml;re sonra &lt;strong&gt;V&lt;/strong&gt; firması, &amp;uuml;r&amp;uuml;n&amp;uuml;ne ait bazı k&amp;uuml;t&amp;uuml;phanelerin kaynak kodlarını da anlaşma gereği &lt;strong&gt;X&lt;/strong&gt; firmasına vermiş. Ekip i&amp;ccedil;inde tek başına &amp;ccedil;alışan bazı geliştiriciler, zaman i&amp;ccedil;erisinde &amp;uuml;zerine aldıkları bu &amp;uuml;r&amp;uuml;n&amp;uuml; alıp kendi ihtiya&amp;ccedil;ları doğrultusunda değiştirmişler. &amp;Uuml;r&amp;uuml;n&amp;uuml;n zaman i&amp;ccedil;inde devredildiği her ekip bazen aynı ama&amp;ccedil;lara hizmet eden kod par&amp;ccedil;alarını, karmaşıklıklarından dolayı tekrardan yazmak zorunda kalmış. Hatta kodlar tekrardan incelendiğinde hi&amp;ccedil; kullanılmayan, bir k&amp;ouml;şede unutulmuş, atıl olmuş par&amp;ccedil;alara rastlanmış.&lt;/p&gt;
&lt;p&gt;Bazı noktalarda ise mecburen V&amp;rsquo; ye gidilmesi gerekmiş. Bu istekler basit de olsa &lt;strong&gt;V&lt;/strong&gt;, &lt;strong&gt;X&lt;/strong&gt; firmasına toplantı talepleri g&amp;ouml;ndermiş. Analizler yapılması gerektiğini vurgulamış. Analizler ve uzun s&amp;uuml;ren toplantılar nedeniyle yeni istekler &amp;ccedil;oğu zaman gecikmiş. Ayrıca V, bu istekleri faturalamakta ve uzun s&amp;uuml;rede ger&amp;ccedil;ekleştirmekteymiş.&lt;/p&gt;
&lt;p&gt;Sonunda &lt;strong&gt;X&lt;/strong&gt;, s&amp;ouml;z konusu &amp;uuml;r&amp;uuml;n&amp;uuml; &lt;strong&gt;In-House&lt;/strong&gt; olarak geliştirme kararı almış. Hem de uzun yıllar sonunda. Ancak &amp;uuml;r&amp;uuml;n&amp;uuml;n kritik noktalarında yer alan bazı &lt;strong&gt;Vendor&lt;/strong&gt; &amp;ccedil;&amp;ouml;z&amp;uuml;mleri şirketin ağı i&amp;ccedil;erisinde &amp;ouml;yle bir yayılmış ve kullanılmış ki, var olan sistemi &amp;ccedil;&amp;ouml;pe atmak gibi bir alternatif s&amp;ouml;z konusu değilmiş. Yeni ekibin eski &amp;uuml;r&amp;uuml;n&amp;uuml;n bazı &amp;ouml;zelliklerini alıp yeni &amp;ccedil;&amp;ouml;z&amp;uuml;mde kullanması ve bunu yaparken yeni &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;n m&amp;uuml;kemmel alt yapısını da tasarlaması gerekiyormuş.&lt;/p&gt;
&lt;p&gt;Eski &amp;uuml;r&amp;uuml;n&amp;uuml;n &amp;ouml;zellikle veri katmanı tarafındaki oluşumunda da sıkıntılar bulunuyormuş. İsimlendirme standartları &amp;ccedil;oğu yerde ihlal edilmiş, d&amp;uuml;zg&amp;uuml;n bir domain yapısı kurgulanamamış, kurgulanmışsa da zaman i&amp;ccedil;erisinde bozulmuş, veriler normalize edilmek zorunda kalacak şekilde saklanmış, veriye erişim i&amp;ccedil;in pek &amp;ccedil;ok noktada tekrar eden işlevsellikler t&amp;uuml;remiş vb&amp;hellip;&lt;/p&gt;
&lt;p&gt;İşin k&amp;ouml;t&amp;uuml; tarafı ekibe verilen s&amp;uuml;re ve kaynak sayısı olduk&amp;ccedil;a yetersizmiş. Daha da k&amp;ouml;t&amp;uuml;s&amp;uuml; ekipten &lt;strong&gt;&amp;ccedil;evik&lt;em&gt;(Agile)&lt;/em&gt;&lt;/strong&gt; olmaları ve son bir sene i&amp;ccedil;erisinde diğer birimlerin yaptığı gibi &lt;strong&gt;Scrum&lt;/strong&gt; metodolojisinde y&amp;uuml;r&amp;uuml;meleri isteniyormuş. Ancak ekip daha &amp;ouml;nce &amp;ccedil;evik bir proje geliştirme tecr&amp;uuml;besi yaşamamış.&lt;/p&gt;
&lt;p&gt;Bu kısa hikaye, i&amp;ccedil;erisinde bir ka&amp;ccedil; &lt;strong&gt;AntiPattern&lt;/strong&gt; tanımı bulundurmaktadır. Bu &lt;strong&gt;AntiPattern&lt;/strong&gt;&amp;rsquo; ler nedeniyle &amp;uuml;r&amp;uuml;n, &amp;ccedil;eşitli zaman dilimlerinde tıkanma notkasına gelmiş, bu y&amp;uuml;zden yeniden yazılması s&amp;ouml;z konusu olmuştur.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;İlerleyen b&amp;ouml;l&amp;uuml;mlerde yer alan AntiPattern tanımlarını okuduktan sonra, hikayede ge&amp;ccedil;enleri bulabilirsiniz. Diğer yandan sizin i&amp;ccedil;erisinde bulunduğunuz projelerde de benzer vakaların oluşup oluşmadığını tespit etmeye &amp;ccedil;alışarak pratik yapabilirsiniz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;Başlamadan &amp;Ouml;nce&lt;/h1&gt;
&lt;p&gt;AntiPatterns konusunu daha iyi kavrayabilmek adına kendinize şu soruları sorabilirsiniz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Hi&amp;ccedil; bir tasarım kalıbını veya kod par&amp;ccedil;asını nasıl &amp;ccedil;alıştığını anlamadan kullandınız mı?&lt;/li&gt;
&lt;li&gt;Ne kadar iş kuralı varsa hepsini aray&amp;uuml;z' deki kontroller arkasına g&amp;ouml;md&amp;uuml;n&amp;uuml;z m&amp;uuml;?&lt;/li&gt;
&lt;li&gt;K&amp;uuml;rsel olarak sunulmuş bir &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; kullanmak yerine onun &amp;ouml;zel vakaları olduğunu d&amp;uuml;ş&amp;uuml;n&amp;uuml;p tekrardan yazma yoluna gittiniz mi?&lt;/li&gt;
&lt;li&gt;M&amp;uuml;kemmel olması i&amp;ccedil;in en ince detayına kadar incelenen bir ihtiyaca ait &amp;uuml;r&amp;uuml;n&amp;uuml; geliştirmek i&amp;ccedil;in analizin &amp;ccedil;ıkmasını beklediniz mi?&lt;/li&gt;
&lt;li&gt;Bir zamanlar deneme ama&amp;ccedil;lı olarak geliştirdiğiniz k&amp;uuml;t&amp;uuml;phaneleri bir &amp;uuml;r&amp;uuml;n&amp;uuml;n geliştirilmesinde doğrudan kullandınız mı?&lt;/li&gt;
&lt;li&gt;Kernel gibi isimlendirdiğiniz ve &amp;ouml;nemli olduğunu d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z t&amp;uuml;m fonksiyonellikleri i&amp;ccedil;erisine kattığınız devasa bir sınıf geliştirdiniz mi?&lt;/li&gt;
&lt;li&gt;Daha &amp;ouml;nce başarılı bir şekilde kullandığınız &amp;ccedil;&amp;ouml;z&amp;uuml;m mimarisini sonraki &amp;uuml;r&amp;uuml;nlerde terk etmeyi hi&amp;ccedil; d&amp;uuml;ş&amp;uuml;nd&amp;uuml;n&amp;uuml;z m&amp;uuml;?&lt;/li&gt;
&lt;li&gt;Yıllar sonra geliştirdiğiniz k&amp;uuml;t&amp;uuml;phane i&amp;ccedil;erisinde var olan ama artık atıl olmuş bir sınıfa/metoda rastladınız mı?&lt;/li&gt;
&lt;li&gt;&amp;Uuml;r&amp;uuml;n i&amp;ccedil;erisinde bir başkasının uyguladığı kod par&amp;ccedil;asının aynen yapıştırıp i&amp;ccedil;eriğinde biraz değişiklik yaparak kullandınız mı?&lt;/li&gt;
&lt;li&gt;Kaynak kodları a&amp;ccedil;ık olan ve şirket i&amp;ccedil;erisindeki &amp;uuml;r&amp;uuml;nlerde kullanılan 3nc&amp;uuml; parti bir bileşende &amp;ouml;zelleştirme yaptınız mı?&lt;/li&gt;
&lt;li&gt;Bir servis den aldığınız hata mesajını son kullanıcıdan gizlediğiniz oldu mu?&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Vereceğiniz cevaplar ne olursa olsun oluşan hal genellikle bir AntiPattern oluşumunu işaret edecektir.&lt;/p&gt;
&lt;h1&gt;&amp;Ouml;n Bilgiler ve Tanımlama(Tanımlamaya &amp;Ccedil;alışma)&lt;/h1&gt;
&lt;p&gt;&lt;a href="/pics/andrewkoenig.png"&gt;&lt;img style="float: left; margin: 4px 0px; display: inline;" title="andrewkoenig" src="/pics/andrewkoenig_thumb.png" alt="andrewkoenig" width="132" height="200" align="left" /&gt;&lt;/a&gt;AntiPatterns terimi &lt;strong&gt;1995&amp;rsquo; de Andrew &lt;/strong&gt;&lt;a href="http://en.wikipedia.org/wiki/Andrew_Koenig_(programmer)"&gt;&lt;strong&gt;Koenig&lt;/strong&gt;&lt;/a&gt;&lt;strong&gt;&amp;rsquo;&lt;/strong&gt; in &lt;strong&gt;Journal of Object Oriented Programming&lt;/strong&gt;&lt;a href="http://www.jot.fm"&gt;(ki doğrulatamadığım bilgilere g&amp;ouml;re bunun yerini Journal of Object Technology almıştır)&lt;/a&gt;&amp;rsquo; de yayınlanan &lt;strong&gt;C++&lt;/strong&gt; k&amp;ouml;şesindeki &lt;strong&gt;Patterns and AntiPatterns&lt;/strong&gt; makalesinde şu şekilde tanımlanmıştır;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;AntiPattern is just like pattern, except that instead of solution it gives something that looks superficially like a solution, but isn't one. (Koenig, 1995)&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Ş&amp;ouml;yle Yorumlayabiliriz : &lt;strong&gt;AntiPattern g&amp;ouml;r&amp;uuml;n&amp;uuml;şte(y&amp;uuml;zeysel anlamda) &amp;ccedil;&amp;ouml;z&amp;uuml;m zannedilen bir Pattern gibidir, ama aslında değildir.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;Koenig&amp;rsquo;&lt;/strong&gt; in bu tanımı daha sonra &lt;strong&gt;Cambridge &amp;Uuml;niversitesi&lt;/strong&gt;&amp;rsquo; nin derlediği &lt;a href="http://www.amazon.com/Patterns-Handbook-Techniques-Strategies-Applications/dp/0521648181/ref=sr_1_1?s=books&amp;amp;ie=UTF8&amp;amp;qid=1390554526&amp;amp;sr=1-1&amp;amp;keywords=The+Patterns+Handbook%3A+Techniques%2C+Strategies%2C+and+Applications"&gt;The Patterns Handbook: Techniques, Strategies, and Applications (SIGS Reference Library)&lt;/a&gt; isimli kitaba da dahil edilmiştir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;AntiPattern&amp;rsquo;&lt;/strong&gt; ler yazılım geliştirme de k&amp;ouml;t&amp;uuml; &amp;ccedil;&amp;ouml;z&amp;uuml;m yaklaşımları ve pratikleri olarak da bilinirler. S&amp;ouml;z gelimi tasarım desenleri, belli başlı problemlerin &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;nde standart pratikleri &amp;ouml;nerirken, &lt;strong&gt;AntiPattern&lt;/strong&gt;&amp;rsquo; ler tam tersine arzu edilmeyen ve sonrasında daha b&amp;uuml;y&amp;uuml;k problemlerin kapısını a&amp;ccedil;an pratiklerin uygulanması olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Aslında &lt;strong&gt;AntiPattern&amp;rsquo;&lt;/strong&gt; lerin tehlikeli tarafı &amp;uuml;r&amp;uuml;n geliştirme s&amp;uuml;re&amp;ccedil;lerinde ve vakalarda en uygun &amp;ccedil;&amp;ouml;z&amp;uuml;m yolu olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmeleridir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;D&amp;uuml;n&amp;uuml;n en pop&amp;uuml;ler &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; bug&amp;uuml;n&amp;uuml;n AntiPattern&amp;rsquo; i olabilir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;AntiPattern&amp;rsquo;&lt;/strong&gt; ler aslında &lt;strong&gt;Design Pattern&amp;rsquo;&lt;/strong&gt; lerin doğal bir uzantısı olarak yazılım geliştirme s&amp;uuml;recinde tekrar eden bazı yanlışları ifade etmektedir ve &amp;ouml;z&amp;uuml;nde bu yanlışları engellemek, anlamak ve onlardan korunmak i&amp;ccedil;in gerekli bir takım tanımlamaları da i&amp;ccedil;ermektedir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;AntiPatterns kavramlarını bilmek, yazılım geliştirme s&amp;uuml;recinde karşılaşılabilecek ciddi problemleri &amp;ouml;nceden tahmin edebilmeyi ve tedbir almayı kolaylaştırır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Diğer yandan mimari kavramlar ile ger&amp;ccedil;ek d&amp;uuml;nya uyarlamaları arasındaki boşluğu dolduran bir k&amp;ouml;pr&amp;uuml; olarak da vurgulanmışlardır. Nitekim mimari kavramların doğru uygulanamadığı veya se&amp;ccedil;ilemediği noktalarda, ger&amp;ccedil;ek d&amp;uuml;nya ihtiya&amp;ccedil;larını karşılamak i&amp;ccedil;in ele alınan ve ideal gibi g&amp;ouml;r&amp;uuml;nen &amp;ccedil;&amp;ouml;z&amp;uuml;mler, iki d&amp;uuml;nya arasındaki boşluğu dolduran &lt;strong&gt;AntiPattern&lt;/strong&gt;&amp;rsquo; ler haline gelebilirler.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bir Pattern &amp;ccedil;&amp;ouml;zd&amp;uuml;ğ&amp;uuml;nden daha fazla problem oluşturuyorsa AntiPattern&amp;rsquo; dir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;Ccedil;ok sık verilen ve bilinen AntiPattern &amp;ouml;rnekleri vardır. &lt;strong&gt;Spaghetti Code, Copy-Paste Programming, God Object&lt;/strong&gt;&lt;em&gt;(BLOB AntiPattern olarak da bilinir)&lt;/em&gt; vb. Yazılım d&amp;uuml;nyasının genişlemesi, platformlar arası iletişimin artması ve Enterprise olarak kabul edilen &amp;ccedil;&amp;ouml;z&amp;uuml;mlerin yaygınlaşması ile birlikte, &lt;strong&gt;AntiPattern&lt;/strong&gt; konusu daha da &amp;ouml;nem kazanmıştır. Sayısız &lt;strong&gt;AntiPattern&lt;/strong&gt; vardır ve bunlar ana ve &amp;ccedil;eşitli alt kategoriler halinde sınıflandırılmaktadır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;G&amp;uuml;n i&amp;ccedil;erisinde vakit ayırıp en azından bir AntiPattern vakası okumak, bununla ilişkili semptomları kavramak, &amp;ccedil;&amp;ouml;z&amp;uuml;m yollarını incelemek ve olası istisnai durumları tanımak her yazılımcı i&amp;ccedil;in &amp;ouml;nemlidir. Hatta aşağıdakine benzer post-it&amp;rsquo; ler hazırlanması olduk&amp;ccedil;a faydalıdır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/ap_receipe.png"&gt;&lt;img style="background-image: none; padding-top: 0px; padding-left: 0px; margin: 4px 0px; display: inline; padding-right: 0px; border-width: 0px;" title="ap_receipe" src="/pics/ap_receipe_thumb.png" alt="ap_receipe" width="460" height="462" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;AntiPattern&amp;rsquo; lar belirli karakteristikler sergilerler. Her birinin tipik oluşma nedenleri&lt;em&gt;&lt;strong&gt;(Typical Causes)&lt;/strong&gt;&lt;/em&gt;, oluştuklarına dair belirtileri&lt;strong&gt;&lt;em&gt;(Symptoms)&lt;/em&gt; &lt;/strong&gt;ve oluşmaları sonrası ortaya &amp;ccedil;ıkan neticeleri&lt;strong&gt;&lt;em&gt;(Consequences)&lt;/em&gt; &lt;/strong&gt;vardır. Her birinin d&amp;uuml;zeltilmesine y&amp;ouml;nelik &amp;ccedil;&amp;ouml;z&amp;uuml;mler bulunur&lt;em&gt;&lt;strong&gt;(Refactored Solutions)&lt;/strong&gt;&amp;nbsp;&lt;/em&gt;Oluşmalarına m&amp;uuml;sade edilebilecek İstisnai durumlar da s&amp;ouml;z konusudur&lt;em&gt;&lt;strong&gt;(Exceptions)&lt;/strong&gt;.&lt;/em&gt;Bu nedenle AntiPattern&amp;rsquo; lar okunurken bu maddeler &amp;ccedil;er&amp;ccedil;evesinde değerlendirilmelidirler.&lt;/p&gt;
&lt;h1&gt;Şablon(Template)&lt;/h1&gt;
&lt;p&gt;Bir &lt;strong&gt;AntiPattern&lt;/strong&gt; tanımlanırken standart olarak aşağıdaki gibi bir &lt;strong&gt;şablon&lt;em&gt;(Template)&lt;/em&gt;&lt;/strong&gt; kullanılır. Bu şablona g&amp;ouml;re var olan bir takım koşullar ve sebepler sonucu oluşan &lt;strong&gt;AntiPattern&lt;/strong&gt;&amp;rsquo; in &amp;uuml;rettiği sonu&amp;ccedil;lar ve uygulanan &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;n &lt;strong&gt;AntiPattern&lt;/strong&gt; olduğunu işaret eden belirtiler tanımlanır. Sonrasında &lt;strong&gt;Refactoring&lt;/strong&gt; &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; ve bu &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;n &amp;ccedil;ıktısı olan sonu&amp;ccedil;lar ve kazan&amp;ccedil;lar belirtilir. Pek tabi bir AntiPattern başka AntiPattern veya Pattern&amp;rsquo; ler ile ilişkilendirilebilir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/ap_template.png"&gt;&lt;img style="background-image: none; padding-top: 0px; padding-left: 0px; margin: 4px 0px; display: inline; padding-right: 0px; border-width: 0px;" title="ap_template" src="/pics/ap_template_thumb.png" alt="ap_template" width="280" height="357" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;h1&gt;Kategorilendirme&lt;/h1&gt;
&lt;p&gt;Hays W.&amp;rdquo;Skip&amp;rdquo; McCormick&amp;rsquo; in yer aldığı &lt;strong&gt;&lt;a href="http://www.amazon.com/AntiPatterns-Refactoring-Software-Architectures-Projects/dp/0471197130/ref=sr_1_1?s=books&amp;amp;ie=UTF8&amp;amp;qid=1390555386&amp;amp;sr=1-1&amp;amp;keywords=AntiPatterns"&gt;AntiPatterns:Refactoring Software,Architectures, and Projects in Crisis&lt;/a&gt;&lt;/strong&gt; isimli kitaba g&amp;ouml;re 3 ana kategori s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Software Development &lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;Software Architecture &lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;Software Project Management&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;AntiPatterns.com&amp;rsquo; a g&amp;ouml;re kategorilendirme yine yukarıdaki 3 ana başlık altında detaylanmakta ancak her ana kategori i&amp;ccedil;in birer &lt;strong&gt;Mini AntiPattern&lt;/strong&gt; sınıflandırılmasına da gidilmektedir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Kategorilendirme de esas nokta Uygulama Geliştirme Yaşam&lt;em&gt;(Application LifeCycle Management)&lt;/em&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml;ne dahil olan farklı bakış a&amp;ccedil;ılarıdır. Bu bakış a&amp;ccedil;ıları temelde &amp;uuml;&amp;ccedil; pozisyon ile ilgilidir. Mimar&lt;em&gt;(Architect)&lt;/em&gt;, Geliştirici&lt;em&gt;(Developer) &lt;/em&gt;ve Y&amp;ouml;netici&lt;em&gt;(Manager)&lt;/em&gt;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;Development AntiPatterns &lt;br /&gt;&lt;/strong&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; The Blob(God Class) &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Cut and Paste Programming &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Functional Decomposition &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Golden Hammer &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Lava Flow &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Plotergeists &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Spaghetti Code &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; &lt;strong&gt;Development Mini AntiPatterns &lt;br /&gt;&lt;/strong&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Ambigous Viewpoint &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Boat Anchor &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Continous Obsolescence &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Dead End &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Input Kludge &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Mushroom Management &lt;br /&gt;&lt;strong&gt;Architecture AntiPatterns &lt;br /&gt;&lt;/strong&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Architecture by Implication &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Design By Committee &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Reinvent the Wheel &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Stovepipe Enterprise &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Stovepipe System &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Vendor Lock-In &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; &lt;strong&gt;Architecture Mini AntiPatterns &lt;br /&gt;&lt;/strong&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Auto Generated Stovepipe &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Cover Your Assets &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; The Grand Old Duke of York &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Intellectual Violence &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Jumble &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Swiss Army Knife &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Wolf Ticket &lt;br /&gt;&lt;strong&gt;Management AntiPatterns &lt;br /&gt;&lt;/strong&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Analysis Paralysis&amp;nbsp; &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Corncob &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Death By Planning &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Irrational Management &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Project Mis-Management &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; &lt;strong&gt;Managemenet Mini AntiPatterns &lt;br /&gt;&lt;/strong&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Blowhard Jamboree &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Email is Dangerous &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Fear of Success &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; The Feud &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Smoke and Mirrors &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Throw it Over The Wall &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Viewgraph Engineering &lt;br /&gt;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Warm Bodies&lt;/p&gt;
&lt;p&gt;Ben sunum i&amp;ccedil;in &lt;strong&gt;Wikipedia&lt;/strong&gt; tarafında yayınlanan &lt;strong&gt;AntiPatterns&lt;/strong&gt; maddelerini ele almaya &amp;ccedil;alıştım ve onları aşağıdaki gibi daha anlaşılır bir grafik haline getirdim. &lt;em&gt;(Sarı punto ile işaretlenen başlıklar, sunumlarda vakit yettiği &amp;ouml;l&amp;ccedil;&amp;uuml;de ele almak istediğim konulardı)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/anti_18.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="anti_18" src="/pics/anti_18_thumb.png" alt="anti_18" width="640" height="347" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/apktgri.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="apktgri" src="/pics/apktgri_thumb.png" alt="apktgri" width="640" height="360" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;h1&gt;Kaynaklar&lt;/h1&gt;
&lt;p&gt;Konuya hazırlanırken kavramın ilk &amp;ccedil;ıkış noktasına denk gelen kaynakları &amp;ouml;zellikle takip etmeye &amp;ccedil;alıştım. Tabi gelişen teknoloji d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde g&amp;uuml;ncel bir ka&amp;ccedil; araştırmaya ve ağırlıklı olarak &lt;strong&gt;Wikipedia&amp;rsquo;&lt;/strong&gt; ya bakmam gerekti. İşte okuduğunuz dok&amp;uuml;manın oluşmasında kullandığım değerli kaynaklar.&lt;/p&gt;
&lt;table style="width: 640px;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td rowspan="6" valign="top" width="210"&gt;&lt;a href="/pics/anti_19.png"&gt;&lt;img style="background-image: none; padding-top: 0px; padding-left: 0px; margin: 4px 0px; display: inline; padding-right: 0px; border-width: 0px;" title="anti_19" src="/pics/anti_19_thumb.png" alt="anti_19" width="200" height="200" border="0" /&gt;&lt;/a&gt;&lt;/td&gt;
&lt;td valign="top" width="430"&gt;&lt;a href="http://www.antipatterns.com" target="_blank"&gt;AntiPatterns Internet Sitesi&lt;/a&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="430"&gt;&lt;a href="http://www.amazon.com/AntiPatterns-Refactoring-Software-Architectures-Projects/dp/0471197130/ref=sr_1_1?s=books&amp;amp;ie=UTF8&amp;amp;qid=1390555386&amp;amp;sr=1-1&amp;amp;keywords=AntiPatterns"&gt;AntiPatterns: Refactoring Software, Architectures, and Projects in Crisis by William J. Brown, Raphael C. Malveau, Hays W. "Skip" McCormick and Thomas J. Mowbray (Apr 3, 1998)&lt;/a&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="430"&gt;&lt;a href="http://www.amazon.com/Patterns-Handbook-Techniques-Strategies-Applications/dp/0521648181/ref=sr_1_1?s=books&amp;amp;ie=UTF8&amp;amp;qid=1390554526&amp;amp;sr=1-1&amp;amp;keywords=The+Patterns+Handbook%3A+Techniques%2C+Strategies%2C+and+Applications"&gt;The Patterns Handbook: Techniques, Strategies, and Applications (SIGS Reference Library)&lt;/a&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="430"&gt;&lt;a href="http://proceedings.informingscience.org/InSITE2011/InSITE11p109-138Bulajic276.pdf" target="_blank"&gt;Design Patterns Past and Future&lt;/a&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="430"&gt;&lt;a href="http://en.wikipedia.org/wiki/Anti-pattern" target="_blank"&gt;Wikipedia&lt;/a&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="430"&gt;&lt;a href="http://sourcemaking.com/antipatterns" target="_blank"&gt;Sourcemaking&lt;/a&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;Bazı AntiPatterns Vakaları&lt;/h1&gt;
&lt;p&gt;Pek &amp;ccedil;ok &lt;strong&gt;AntiPatterns&lt;/strong&gt; bulunmakta. Hepsine &amp;ccedil;alışacak vakit olsa da tamamının &amp;ouml;zetini &amp;ccedil;ıkartmaya yetecek kadar yoktu. Yine de en &amp;ccedil;ok dikkatimi &amp;ccedil;eken ve anlamakta zorlanmadıklarımın bir &amp;ouml;zetini &amp;ccedil;ıkartmayı başardım. Programlama kategorisinden &lt;strong&gt;Lava Flow &lt;/strong&gt;ile başlayalım.&lt;/p&gt;
&lt;h2&gt;Lava Flow &amp;ndash; Programming&lt;/h2&gt;
&lt;blockquote&gt;
&lt;p&gt;L&amp;uuml;zumsuz veya d&amp;uuml;ş&amp;uuml;k kaliteli kodları, kaldırma maliyetlerinin y&amp;uuml;ksek olması veya &amp;ouml;n g&amp;ouml;r&amp;uuml;lemeyen sebepler nedeniyle barındırmaya devam etmek.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href="/pics/anti_5.png"&gt;&lt;img style="float: right; margin: 4px 0px; display: inline;" title="anti_5" src="/pics/anti_5_thumb.png" alt="anti_5" width="200" height="132" align="right" /&gt;&lt;/a&gt;Bazen araştırma ama&amp;ccedil;lı olarak başlayan yazılımlar &amp;uuml;r&amp;uuml;ne d&amp;ouml;n&amp;uuml;ş&amp;uuml;rler. &amp;Uuml;r&amp;uuml;ne d&amp;ouml;n&amp;uuml;şme noktasından geriye doğru bakıldığında ne ama&amp;ccedil;la yazıldıkları belli olmayan&lt;em&gt;(hatta yazan kişinin de şirketten ayrılmış olması sebebiyle kimsenin bilemediği) &lt;/em&gt;kod par&amp;ccedil;alarından oluşan bir tarihi antika oluşabilir. &amp;Ouml;yle ki, projede g&amp;ouml;rev alan bazı geliştiricilere sorulduğunda ilgili kod par&amp;ccedil;asının hangi ama&amp;ccedil;la yazıldığını hatırlamayabilir&lt;em&gt;(İstisnai bir durum ise gri veya ak sa&amp;ccedil;lı geliştiricilerin bunu hatırlayabilmesidir)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu durumun oluşmasının pek &amp;ccedil;ok nedeni vardır. &amp;Ouml;rneğin projede g&amp;ouml;revlendirilip tek başına kodlama yapan bir geliştirici sebepler arasında sayılabilir&lt;em&gt;&lt;strong&gt;(Lone Wolf Developer veya Single Developer Written Code) &lt;/strong&gt;&lt;/em&gt;ya da deneyimli olmayan veya yeteri kadar bilgisi bulunmayan bir y&amp;ouml;netici/mimar bu duruma sebebiyet verebilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;G&amp;uuml;n&amp;uuml;m&amp;uuml;zde vuku bulan bir geliştirici tanımı da &lt;strong&gt;Monkey Developer&lt;/strong&gt;&amp;rsquo; dır. Professional Developer ve Monkey Developer arasındaki ayrımı değerlendiren &lt;a href="http://blog.binarymist.net/2014/01/25/essentials-for-creating-and-maintaining-a-high-performance-development-team/" target="_blank"&gt;isabetli bir yazıyı bu adresten okuyabilirsiniz&lt;/a&gt;.&lt;/p&gt;
&lt;p&gt;Her ne kadar &amp;uuml;r&amp;uuml;nlerin piyasadaki rekabet nedeniyle hızla &amp;ccedil;ıkması gerekse de bu, hızlı development&amp;rsquo; ın ortaya koyacağı istenmeyen sonu&amp;ccedil;ların oluşmasını kabul etmek olarak da algılanmamalıdır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Sonu&amp;ccedil; olarak kod i&amp;ccedil;eriğine ve projenin genel &amp;ccedil;atısına bakıldığında m&amp;uuml;dahale edilmesi zor, modası ge&amp;ccedil;miş ve kullanılmayan kod par&amp;ccedil;aları i&amp;ccedil;eren, &amp;uuml;st&amp;uuml;ne s&amp;uuml;rekli yeni &amp;ouml;zellikler eklenirken hata ayıklaması da olduk&amp;ccedil;a zorlaşan bir &amp;uuml;r&amp;uuml;n&amp;uuml;n ortaya &amp;ccedil;ıktığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r. İ&amp;ccedil;inde başka AntiPattern&amp;rsquo; leri de barındırır diyebiliriz. S&amp;ouml;z gelimi &lt;strong&gt;Boat Anchor, Spaghetti Code, Error Hiding&lt;/strong&gt; vb&amp;hellip;Kaynak kodun takibi de zorlaşır. &amp;Ccedil;&amp;ouml;z&amp;uuml;m yollarından birisi &lt;strong&gt;Configuration Management&lt;/strong&gt;&amp;rsquo; tır.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;İstisnai Durum :&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Tabi oluşmasına m&amp;uuml;saade edilebilecek durumlar da vardır ki bu durum &amp;ccedil;alışmanın bir araştırma &amp;ccedil;alışması olmasıdır. &lt;strong&gt;POC&lt;em&gt;(Proof of Concept)&lt;/em&gt;&lt;/strong&gt; tipindeki uygulamalarda bu durumun oluşmasına m&amp;uuml;saade edilebilir.&lt;/p&gt;
&lt;h2&gt;Analysis Paralysis &amp;ndash; Organizational&lt;/h2&gt;
&lt;blockquote&gt;
&lt;p&gt;Bir projenin analizine orantısız &amp;ouml;l&amp;ccedil;&amp;uuml;de y&amp;uuml;ksek efor harcamak.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href="/pics/anti_11.png"&gt;&lt;img style="float: right; margin: 4px 0px; display: inline;" title="anti_11" src="/pics/anti_11_thumb.png" alt="anti_11" width="200" height="154" align="right" /&gt;&lt;/a&gt;Analiz Felci olarak bilinir. Bazı projelerin analiz safhası hem uzun s&amp;uuml;rer hem de kullanılan kaynakların(eleman sayısı gibi) maliyeti y&amp;uuml;ksek ve fazla olur. &amp;Ccedil;oğunlukla &lt;strong&gt;Waterfall&lt;/strong&gt; adı verilen yazılım geliştirme metodolojisinde karşımıza &amp;ccedil;ıkar. Analizin uzamasının belli nedenleri vardır. Bunlardan birisi geresiz olabilecek detaylara &amp;ccedil;ok fazla girilmesidir.&lt;/p&gt;
&lt;p&gt;M&amp;uuml;kemmel bir analiz olmadan tasarım yapılamayacağı ve ilerlenemeyeceği varsayılır. Bu AntiPattern ayrıca g&amp;uuml;n&amp;uuml;m&amp;uuml;z&amp;uuml;n pop&amp;uuml;ler &lt;strong&gt;&amp;ccedil;evik&lt;em&gt;(Scrum gibi)&lt;/em&gt;&lt;/strong&gt; s&amp;uuml;re&amp;ccedil;lerinin daha &amp;ccedil;ok tercih edilmesinde de rol almış olabilir. Nitekim &amp;ccedil;evik s&amp;uuml;re&amp;ccedil;ler periyodik iterasyonlar sonucunda işe yarar bir &amp;uuml;r&amp;uuml;n&amp;uuml;n veya paketin m&amp;uuml;şteriye sunulmasına odaklanırlar.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;İstisnai Durum :&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Kitaba g&amp;ouml;re bu deseni haklı &amp;ccedil;ıkartacak hi&amp;ccedil;bir istisnai durum yoktur.&lt;/p&gt;
&lt;h2&gt;Reinventing the Square Wheel &amp;ndash; Methodological&lt;/h2&gt;
&lt;blockquote&gt;
&lt;p&gt;Var olan bir &amp;ccedil;&amp;ouml;z&amp;uuml;m yerine ondan daha k&amp;ouml;t&amp;uuml; olan &amp;ouml;zel bir &amp;ccedil;&amp;ouml;z&amp;uuml;m &amp;uuml;retme hatasına d&amp;uuml;şmek.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bazı yazılım problemlerinin &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;nde kullanılacak olan yollar zaten standart ve bellidir. &amp;Uuml;stelik bu &amp;ccedil;&amp;ouml;z&amp;uuml;mler i&amp;ccedil;in standart hale gelmiş mimari yaklaşımlar, &amp;uuml;r&amp;uuml;nler ve alt yapılar&lt;em&gt;(Frameworks) &lt;/em&gt;mevcuttur. &lt;em&gt;(Hatta tasarım kalıpları)&lt;/em&gt; Problemin bu tip yardımcılar ile &amp;ccedil;&amp;ouml;z&amp;uuml;lemeyeceğini d&amp;uuml;ş&amp;uuml;n&amp;uuml;p sıfırdan bir &amp;ccedil;&amp;ouml;z&amp;uuml;m &amp;uuml;retilmeye başlandığı hal tekerleğin yeniden keşfi olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;l&amp;uuml;r ve bu AntiPattern&amp;rsquo; in oluşmasına neden olur. Nitekim ekip s&amp;ouml;z konusu problemin &amp;ccedil;ok &amp;ouml;zel olduğuna ve var olan pratikler ile ele alınamayacağına inanır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/anti_3.png"&gt;&lt;img style="float: left; margin: 4px 0px; display: inline;" title="anti_3" src="/pics/anti_3_thumb.png" alt="anti_3" width="200" height="150" align="left" /&gt;&lt;/a&gt;Yazılım geliştirme projeleri arasında teknoloji transferi ve yeterli iletişimin&lt;em&gt;(&amp;ouml;zellikle bilgi akışının)&lt;/em&gt; olmaması bu durumun oluşmasının sebeplerindendir. Diğer yandan s&amp;uuml;recin gerektirdiği sistemin en baştan inşa edilmesi gerektiğine inanılması da oluşma sebepleri arasında sayılabilir.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;İstisnai Durum :&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bazı istisnai hallerde kabul edilebilir. &amp;Ouml;zellikle araştırma&lt;em&gt;(Research)&lt;/em&gt; nitelikli projelerde, yeni tekniklerin &amp;ouml;ğrenilmesi veya nasıl &amp;ccedil;alıştığının anlaşılması gibi s&amp;uuml;re&amp;ccedil;lerde ve bazı bilimsel &amp;ccedil;alışmalarda g&amp;ouml;z ardı edilebilir.&lt;/p&gt;
&lt;h2&gt;Cargo Cult Programming &amp;ndash; Programming&lt;/h2&gt;
&lt;blockquote&gt;
&lt;p&gt;Desen ve metodları ne/nasıl/ni&amp;ccedil;in olduğunu anlamadan kullanmak.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href="/pics/anti_7.png"&gt;&lt;img style="float: right; margin: 4px 0px; display: inline;" title="anti_7" src="/pics/anti_7_thumb.png" alt="anti_7" width="200" height="200" align="right" /&gt;&lt;/a&gt;Bu aslında bir inanışı sorgusuz sualsiz kabul etmekten dolayı isimlendirilmiş bir desendir. &amp;Ccedil;oğu zaman geliştirici bir &amp;ccedil;&amp;ouml;z&amp;uuml;m i&amp;ccedil;in kullandığı bileşenleri, prensip ile desenleri, kod par&amp;ccedil;alarının nasıl &amp;ccedil;alıştığını/niye kullanıldığını bilmeden uygular. Bu sıkı sıkıya bağlılık aynı felsefeleri başka &amp;ccedil;&amp;ouml;z&amp;uuml;mlerde de kullanmaya &amp;ccedil;alışmasına yol a&amp;ccedil;ar.&lt;/p&gt;
&lt;p&gt;Bunun doğal sonucu olarak geliştirici bir s&amp;uuml;re sonra problemi doğru şekilde algılayıp uygun teşhisi koyma noktasından da uzaklaşabilir.&lt;/p&gt;
&lt;p&gt;Bir nevi &lt;strong&gt;Copy-Paste Programming AntiPattern&lt;/strong&gt; yaklaşımının bir sonucu olarak ortaya &amp;ccedil;ıktığını da d&amp;uuml;ş&amp;uuml;nebiliriz. Nitekim geliştirici &amp;ccedil;&amp;ouml;z&amp;uuml;m i&amp;ccedil;in bir kod par&amp;ccedil;asının gerekli olup olmadığını ve nasıl &amp;ccedil;alıştığını anlamadan bir yerden bir yere taşıyarak uygulamaya &amp;ccedil;alışır.&lt;/p&gt;
&lt;h2&gt;Vendor Lock-In &amp;ndash; Organizational&lt;/h2&gt;
&lt;blockquote&gt;
&lt;p&gt;Bir sistemin dışarıdan sağlanan bir bileşene aşırı bağımlı tasarlanması/geliştirilmesi/y&amp;uuml;r&amp;uuml;t&amp;uuml;lmesi.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;M&amp;uuml;şteri olarak bir &amp;uuml;reticinin &amp;uuml;r&amp;uuml;n&amp;uuml; veya hizmetine sıkı sıkıya bağlı olunan hallerde ortaya &amp;ccedil;ıkar. &amp;Ouml;yleki farklı bir &amp;uuml;reticinin &amp;uuml;r&amp;uuml;n&amp;uuml;ne ge&amp;ccedil;iş yapmak i&amp;ccedil;in ekstra maliyet altına girmek gerekebilir. Sıklıkla verilen &amp;ouml;rneklerden birisi m&amp;uuml;zik sistemi i&amp;ccedil;eriye g&amp;ouml;m&amp;uuml;l&amp;uuml; olan otomobillerdir. Bunlarda m&amp;uuml;zik sistemini değiştirmek epeyce k&amp;uuml;lfetli bir iştir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/anti_12.png"&gt;&lt;img style="float: left; margin: 4px 0px; display: inline;" title="anti_12" src="/pics/anti_12_thumb.png" alt="anti_12" width="240" height="78" align="left" /&gt;&lt;/a&gt;Ya da bir servis sağlayıcısı tarafından sunulan hizmet veya satın alınan bir yazılım bileşeninin herhangi bir ara katman geliştirilmeksizin doğrudan kullanılması bu halin oluşmasına neden olabilir.&lt;/p&gt;
&lt;p&gt;Elbette bu duruma d&amp;uuml;ş&amp;uuml;lmesinin de belli başlı sebepleri vardır. &amp;Ouml;rneğin sadece pazar ve satış bilgilerine bakılıp, &amp;uuml;r&amp;uuml;n&amp;uuml;n teknik detayları atlandığında kolayca ortaya &amp;ccedil;ıkabilir. Diğer yandan uygulamanın sıkı sıkıya bağlı olduğu yazılımdan kopartılmasına uygun teknik bir &amp;ccedil;&amp;ouml;z&amp;uuml;m veya maliyet modeli olmadığında da bu durum oluşabilir.&lt;/p&gt;
&lt;p&gt;Bazen b&amp;uuml;y&amp;uuml;k firmaların kullandığı sayısız &amp;uuml;r&amp;uuml;n arasına bir şekilde entegre olan servis sağlayıcı &amp;uuml;r&amp;uuml;nler kullanılır. Aslında bu &amp;uuml;r&amp;uuml;nler ilk etapta firmanın pek &amp;ccedil;ok yerinde kullanılacak diye alınmaz. Fakat şartlara ve g&amp;uuml;n&amp;uuml;n ihtiya&amp;ccedil;larına g&amp;ouml;re bu tip bir oluşum s&amp;ouml;z konusu olabilir. Uzun bir m&amp;uuml;ddet sonra ilgili &amp;uuml;r&amp;uuml;nlerde ve uzantılarında yapmak istenilen ekler ve değişikliker Vendor&amp;rsquo; a ait &amp;uuml;r&amp;uuml;nlerde de bir takım geliştirmeleri gerekir. İşte bu nokta da Vendor ile s&amp;uuml;rekli bir fiyat pazarlığı haline kalınabilir.&lt;/p&gt;
&lt;p&gt;Durumun oluşmasını engellemek i&amp;ccedil;in uygulama bazında katmanları iyi bir şekilde izole etmek ve vendor &amp;uuml;r&amp;uuml;n&amp;uuml; yerine yeri geldiğinde bir başkasını koyabilme kabiliyetini oluşturabilmek gerekir. Bu da &amp;uuml;r&amp;uuml;n ile onu kullanan asıl uygulama arasında izole edilmiş bir katmanın olması ile sağlanabilir.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;İstisnai Durum :&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bir uygulamanın gerektirdiği harici &amp;ccedil;&amp;ouml;z&amp;uuml;mleri b&amp;uuml;y&amp;uuml;k oranda karşılayan tek bir Vendor ile &amp;ccedil;alışılıyorsa g&amp;ouml;z yumulabilir.&lt;/p&gt;
&lt;h2&gt;OverEngineering &amp;ndash; Project Management&lt;/h2&gt;
&lt;blockquote&gt;
&lt;p&gt;Bir projeyi gereğinden daha karmaşık ve g&amp;uuml;&amp;ccedil;l&amp;uuml; hale getirmek i&amp;ccedil;in kaynak harcamak.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href="/pics/anti_16.png"&gt;&lt;img style="float: right; margin: 4px 0px; display: inline;" title="anti_16" src="/pics/anti_16_thumb.png" alt="anti_16" width="200" height="160" align="right" /&gt;&lt;/a&gt;Bir uygulamanın gereğinden ve ihtiya&amp;ccedil; duyulandan daha fazla oranda kompleks geliştirilmesidir. İstenen şeyler &amp;ccedil;ok basit seviyede olabilecekken, gereksiz yere karmaşıklaştırılır. Bu bir nevi sedan tipindeki aile arabasının saatte 300 KM s&amp;uuml;ratle gidebilmesini sağlayacak teknolojiyi kullanarak bir &amp;uuml;retim bandı hazırlanmasına ve yapılmasına benzer.&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil;ta &amp;uuml;retim ve bakım maliyeti y&amp;uuml;kselir, kullanılan ustaları kumaşı daha da pahalı hale gelir. Kısacası bir problemi olduğundan daha karmaşıkmış gibi algılayıp &amp;ccedil;&amp;ouml;zmeye &amp;ccedil;alışmak olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&lt;/p&gt;
&lt;h2&gt;Golden Hammer &amp;ndash; Methodological&lt;/h2&gt;
&lt;blockquote&gt;
&lt;p&gt;Favori bir &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;n evrensel anlamda kabul g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml; varsaymak.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href="/pics/anti_2.png"&gt;&lt;img style="float: left; margin: 4px 0px; display: inline;" title="anti_2" src="/pics/anti_2_thumb.png" alt="anti_2" width="131" height="200" align="left" /&gt;&lt;/a&gt;Daha &amp;ouml;nceden başarılı bir şekilde uygulanmış bir &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;n, sonraki problemlerde de kullanılmaya &amp;ccedil;alışılması olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Oysaki bazı problemler aynı y&amp;ouml;ntemler ve yaklaşımlar ile &lt;span style="text-decoration: underline;"&gt;&amp;ccedil;&amp;ouml;z&amp;uuml;mlenemeyebilir&lt;/span&gt;. Bu, biraz da &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; arayan kişilerin daha &amp;ouml;nce başarılı bir şekilde uyguladıkları yaklaşımları sahiplenmesinden kaynaklanır.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin t&amp;uuml;m yazılımların &lt;strong&gt;SOA(Service Oriented Architecture)&lt;/strong&gt; mimari b&amp;uuml;t&amp;uuml;n&amp;uuml; i&amp;ccedil;erisinde ele alınması gerektiğini d&amp;uuml;ş&amp;uuml;nmek bu duruma &amp;ouml;rnek olarak verilebilir. En sık g&amp;ouml;r&amp;uuml;len &lt;strong&gt;AntiPattern&lt;/strong&gt;&amp;rsquo; ler arasında yer alır.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z konusu durumun oluşmasının nedenlerinden birisi, teknolojik gelişmelerden ekiplerin haberdar olmamasıdır. Bazı firmalar gerekli eğitimlerin getirdiği ek maliyetlerden ka&amp;ccedil;ınır ve ekibi donatmaz. Hatta bazı ekiplerin bireysel anlamda gelişmenin &amp;ouml;n&amp;uuml;n&amp;uuml; a&amp;ccedil;acak aktivite ve &amp;ccedil;alışmalara m&amp;uuml;saade etmemesi de bu sebepler arasında sayılabilir.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;İstisnai Durum :&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Kullanımını ge&amp;ccedil;erli kılan istisnai durumlar da vardır. S&amp;ouml;z gelimi uzun soluklu &amp;uuml;r&amp;uuml;nlerde &lt;strong&gt;Oracle&lt;/strong&gt; veri tabanına ait veri nesnelerinin kullanılması ve diğer &amp;ccedil;&amp;ouml;z&amp;uuml;mler i&amp;ccedil;in de ele alınması kabul edilebilir bir yaklaşımdır. Bankalarda bu tip veri tabanı se&amp;ccedil;imleri genellikle bir kez yapılır ve kolay kolay değiştirilmez.&lt;/p&gt;
&lt;p&gt;Tabi burada da belli başlı sıkıntılar doğmaktadır. &amp;Ouml;zellikle t&amp;uuml;m iş kurallarının &lt;strong&gt;Oracle&lt;/strong&gt; i&amp;ccedil;erisine g&amp;ouml;m&amp;uuml;lmesi, &lt;strong&gt;Java&lt;/strong&gt; kodlarının &lt;strong&gt;Stored Procedure&lt;/strong&gt;&amp;rsquo; ler&amp;nbsp; i&amp;ccedil;erisine alınması, &lt;strong&gt;SQL&lt;/strong&gt; ile &lt;strong&gt;PL-SQL&lt;/strong&gt; ge&amp;ccedil;işlerinin sıklaştırılması vb bir s&amp;uuml;re sonra satır sayısı artan, kontrol edilmesi, g&amp;uuml;ncelleştirilmesi, y&amp;ouml;netilmesi zorlaşan, performans sıkıntıları doğuran &amp;uuml;r&amp;uuml;nlerin oluşmasına sebebiyet verebilir.&lt;/p&gt;
&lt;h2&gt;Boat Anchor &amp;ndash; Programming&lt;/h2&gt;
&lt;blockquote&gt;
&lt;p&gt;Her hangi bir ama&amp;ccedil;la kullanılmayan bir sistem par&amp;ccedil;asını tutmak/unutmak.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href="/pics/anti_6.png"&gt;&lt;img style="float: right; margin: 4px 0px; display: inline;" title="anti_6" src="/pics/anti_6_thumb.png" alt="anti_6" width="200" height="172" align="right" /&gt;&lt;/a&gt;&amp;ldquo;Bu metoda/k&amp;uuml;t&amp;uuml;phaneye ilerleyen zamanlarda ihtiyacımız olabilir&amp;rdquo; denilerek yazılan fakat yazıldığı yerde unutulan kod par&amp;ccedil;alarının ortaya &amp;ccedil;ıkarttığı durumdur.&lt;/p&gt;
&lt;p&gt;Unutulan kod par&amp;ccedil;aları yıllar sonra bırakıldıkları halleri ile kafalarda tam bir soru işareti oluşturabilirler. Neden yazıldıkları, ne ama&amp;ccedil;la kullanıldıkları bilinmeyebilir.&lt;/p&gt;
&lt;p&gt;Yazılımsal g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml; haricinde donanımsal tarafta da karşımıza &amp;ccedil;ıkar. &amp;Ouml;rneğin artık demode olmuş, teknolojisi olduk&amp;ccedil;a eskimiş bir bilgisayarın hasarlı bile olsa bir k&amp;ouml;şede durmaya devam etmesi/unutulması olarak da d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&lt;/p&gt;
&lt;h2&gt;Copy-Paste Programming &amp;ndash; Methodological&lt;/h2&gt;
&lt;blockquote&gt;
&lt;p&gt;Daha generic bir &amp;ccedil;&amp;ouml;z&amp;uuml;m &amp;uuml;retmek yerine var olan kodları koplayarak geliştirme yolunu tercih etmek.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href="/pics/anti_4.png"&gt;&lt;img style="float: left; margin: 4px 0px; display: inline;" title="anti_4" src="/pics/anti_4_thumb.png" alt="anti_4" width="200" height="105" align="left" /&gt;&lt;/a&gt;Kaynaklarda &lt;strong&gt;Cut-Paste Programming &lt;/strong&gt;olarak da ge&amp;ccedil;er. &amp;Ccedil;oğunlukla bir &amp;ccedil;&amp;ouml;z&amp;uuml;m i&amp;ccedil;in yazılımın her hangi bir yerinde uygulanan bir kod par&amp;ccedil;asının, ihtiya&amp;ccedil; olunan başka bir yerde aynen kopyalanarak kullanılmaya devam etmesi olarak tanımlanır.&lt;/p&gt;
&lt;p&gt;Bunun doğal sonucu olarak bir değişiklik olması halinde kodun &amp;ccedil;oğaltıldığı yerlere gidilmesi de gerekecektir. G&amp;uuml;ncellemeler i&amp;ccedil;in fazla maliyetli eforlar sarf edilebilir. Hatalar g&amp;ouml;zden ka&amp;ccedil;abilir ve uygulamanın yanlış &amp;ccedil;alışma riski giderek artabilir.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z konusu par&amp;ccedil;aları soyutlayıp nesne y&amp;ouml;nelimli dil temellerine uygun olacak şekilde ayrıştırmak &amp;ouml;nemlidir. G&amp;uuml;n&amp;uuml;m&amp;uuml;z&amp;uuml;n gelişmiş yazılım mimari yaklaşımlarında bu tip bir durumun oluşması nispeten daha azdır ama yine de g&amp;uuml;n&amp;uuml; kurtarma stratjisi burada da etkisini g&amp;ouml;sterebilir. Başka adları da vardır.&lt;strong&gt; Clipboard Coding, Software Cloning, Software Propogation&lt;/strong&gt; gibi.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;İstisnai Durum:&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;İlgin&amp;ccedil;tir ama bu AntiPattern, kodun bir an &amp;ouml;nce dışarıya &amp;ccedil;ıkartılması gerektiği durumlarda kabul edilebilir. Tabi bakım maliyetleri de bu durumda kabul edilmiş olunur.&lt;/p&gt;
&lt;h2&gt;Spaghetti Code &amp;ndash; Programming&lt;/h2&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;Ouml;zellikle kod yapılarının k&amp;ouml;t&amp;uuml; kullanılması nedeniyle g&amp;uuml;&amp;ccedil; anlaşılır programların oluşması.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Genellikle mantıksal bir tasarım b&amp;uuml;t&amp;uuml;n&amp;uuml; i&amp;ccedil;erisinde d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmeden hareket edildiğinde ortaya &amp;ccedil;ıkar. Nesne y&amp;ouml;nelimli dil yetenekleri g&amp;ouml;z ardı edilir ve neredeyse her iş s&amp;uuml;reci i&amp;ccedil;in ayrı birer fonksiyonun yazılması s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/anti_8.png"&gt;&lt;img style="float: right; margin: 4px 0px; display: inline;" title="anti_8" src="/pics/anti_8_thumb.png" alt="anti_8" width="200" height="156" align="right" /&gt;&lt;/a&gt;Bunun doğal sonucu olarak okunabilirlikten uzak, takibi olduk&amp;ccedil;a zor bir kod b&amp;uuml;t&amp;uuml;n&amp;uuml; ortaya &amp;ccedil;ıkar. Yaşam d&amp;ouml;ng&amp;uuml;leri i&amp;ccedil;erisinde s&amp;uuml;rekli olarak g&amp;uuml;ncellenen programlar ve deneyimsiz geliştiriciler bu tip kodların oluşmasına sebebiyet verebilir.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Nesne y&amp;ouml;nelimli olmayan dillerde daha sık rastlanır.&lt;/li&gt;
&lt;li&gt;Metotlar daha &amp;ccedil;ok s&amp;uuml;re&amp;ccedil; odaklı yazılır hatta s&amp;uuml;re&amp;ccedil; adları olarak isimlendirilir.&lt;/li&gt;
&lt;li&gt;Nesneler arasında neredeyse hi&amp;ccedil; ilişki yoktur.&lt;/li&gt;
&lt;li&gt;&amp;Ccedil;oğu metod parametre almaz ve global seviyedeki sınıf değişkenlerini oluşturmakta kullanılır.&lt;/li&gt;
&lt;li&gt;Kodun yeniden kullanılabilirliği zordur.&lt;/li&gt;
&lt;li&gt;OOP temel &amp;ouml;zellikleri&lt;em&gt;(kalıtım, &amp;ccedil;ok bi&amp;ccedil;imlilik, soyutlama)&lt;/em&gt; kullanılmaz.&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;Bu tip kodları genellikle kodun sahibinden başkası anlamaz ve &amp;ccedil;oğu zaman yeniden yazılması g&amp;uuml;ndeme gelir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href="/pics/anti_9.png"&gt;&lt;img style="float: left; margin: 4px 0px; display: inline;" title="anti_9" src="/pics/anti_9_thumb.png" alt="anti_9" width="200" height="146" align="left" /&gt;&lt;/a&gt;&lt;em&gt;İstisnai Durum :&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bazı ara y&amp;uuml;z par&amp;ccedil;alarında implementasyonun i&amp;ccedil; i&amp;ccedil;e olduğu hallerde g&amp;ouml;z ardı edilebilir. &amp;Ouml;zellikle bileşenin yaşam &amp;ouml;mr&amp;uuml;n&amp;uuml;n kısa olduğu ve sistemin geri kalanından tamamen ayrıldığı/izole edildiği durumlarda g&amp;ouml;z yumulabilir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin bir web uygulamasına ait ara y&amp;uuml;zlerde yoğun &lt;strong&gt;javascript&lt;/strong&gt; kullanıldığı hallerde&lt;em&gt;(ki g&amp;uuml;n&amp;uuml;m&amp;uuml;zde pop&amp;uuml;ler olarak kullanılan pek &amp;ccedil;ok JavaScript tabanlı Client Library vardır)&lt;/em&gt; sayfa kodunun bu şekilde karmaşıklaşması istisnai bir durum olarak g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;h2&gt;Error Hiding &amp;ndash; Programming&lt;/h2&gt;
&lt;blockquote&gt;
&lt;p&gt;Bir hata mesajının kullanıcıya g&amp;ouml;sterilmeden &amp;ouml;nce yakalanması ama kullanıcıya ya hi&amp;ccedil;bir şey g&amp;ouml;sterilmemesi ya da anlamlı bir mesaj g&amp;ouml;sterilmemesi. Ayrıca Stack izlerinin Exception&amp;rsquo; ın ele alındığı s&amp;uuml;rede silinmesi ve hata ayıklamaya engel olunması.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href="/pics/anti_10.png"&gt;&lt;img style="float: right; margin: 4px 0px; display: inline;" title="anti_10" src="/pics/anti_10_thumb.png" alt="anti_10" width="200" height="150" align="right" /&gt;&lt;/a&gt;Bazen geliştiriciler, asıl hata mesajını son kullanıcıdan saklama veya anlamlı bir gerek&amp;ccedil;e &lt;span style="text-decoration: underline;"&gt;g&amp;ouml;stermeme&lt;/span&gt; yolunu tercih ederler. &amp;Ccedil;oğunlukla nesne y&amp;ouml;nelimli dillerin kullanıldığı senaryolarda &lt;strong&gt;Exception&lt;/strong&gt; &lt;strong&gt;Handling&lt;/strong&gt; noktasında kendisini g&amp;ouml;sterir.&lt;/p&gt;
&lt;p&gt;Kullanıcının oluşan hata ile ilişkili olarak anlamlı bir mesajla uyarılmayışı &amp;ccedil;ok doğal olarak sorunun &lt;span style="text-decoration: underline;"&gt;anlaşılamaması&lt;/span&gt; demektir. Bu &lt;strong&gt;AntiPattern &lt;/strong&gt;oluştuğunda geliştirici genellikle &lt;strong&gt;exception&lt;/strong&gt; &lt;strong&gt;handling&amp;rsquo;&lt;/strong&gt; i ezer ve u&amp;ccedil; noktalara anlamlı mesajlar vermeyi ihmal eder.&lt;/p&gt;
&lt;p&gt;Oysaki uygulamalarda oluşan hataları seviyelendirmek, seviyesine g&amp;ouml;re doğru pozisyonlar i&amp;ccedil;in kritik olan detay kadar tutmaya &amp;ccedil;alışmak &amp;uuml;r&amp;uuml;nlerin gelişimi a&amp;ccedil;ısından &amp;ouml;nemlidir. Son kullanıcının tipine g&amp;ouml;re verilmesi gereken bir hata mesajı aslında ters noktadaki fonksiyon da, onu ele alacak geliştirici a&amp;ccedil;ısından detaylandırılabilmelidir.&lt;/p&gt;
&lt;h2&gt;Dead End &amp;ndash; Software Development&lt;/h2&gt;
&lt;blockquote&gt;
&lt;p&gt;Ticari bir yazılımın modifiye edilmesinin oluşturduğu bakım y&amp;uuml;k&amp;uuml;.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href="/pics/anti_13.png"&gt;&lt;img style="float: left; margin: 4px 0px; display: inline;" title="anti_13" src="/pics/anti_13_thumb.png" alt="anti_13" width="200" height="151" align="left" /&gt;&lt;/a&gt;Genellikle &amp;ccedil;&amp;ouml;z&amp;uuml;mlerde kullanılan 3nc&amp;uuml; parti bileşenlerde değişiklikler yapıldığında ortaya &amp;ccedil;ıkar. Bileşenin destek&amp;ccedil;isinin yapacağı bir g&amp;uuml;ncelleme sonrasında, hali hazırda yapılmış olan değişiklikler &amp;ccedil;ok doğal olarak ortadan kalkar. Kalkması istenmiyorsa bu durumda entegre edilmesi i&amp;ccedil;in epeyce efor sarf edilmesi gerekebilir.&lt;/p&gt;
&lt;p&gt;Aslında bu tip bileşenlerde değişiklik yapmaktan ka&amp;ccedil;ınmak daha doğrudur. Pek tabi bileşen sahibi bir s&amp;uuml;re sonra &amp;uuml;r&amp;uuml;ne olan desteğini de bırakabilir.&lt;/p&gt;
&lt;p&gt;Bu durumun &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek i&amp;ccedil;in aynen &lt;strong&gt;Vendor Lock-In&lt;/strong&gt; durumunda olduğu gibi bileşenleri izole edilmiş bir katman ile asıl uygulamadan ayrıştırma yolu tercih edilmelidir.&lt;/p&gt;
&lt;p&gt;İstisnai Durum:&lt;/p&gt;
&lt;h2&gt;God Object &amp;ndash; Object Oriented Design&lt;/h2&gt;
&lt;blockquote&gt;
&lt;p&gt;Tasarımın tek bir par&amp;ccedil;asının-ki burada kastedilen bir sınıftır- &amp;ccedil;ok fazla sayıda fonksiyona konsantre olmasıdır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href="/pics/anti_14.png"&gt;&lt;img style="float: right; margin: 4px 0px; display: inline;" title="anti_14" src="/pics/anti_14_thumb.png" alt="anti_14" width="200" height="100" align="right" /&gt;&lt;/a&gt;Bir sınıf i&amp;ccedil;erisine &amp;ccedil;ok sayıda fonksiyonelliğin g&amp;ouml;m&amp;uuml;ld&amp;uuml;ğ&amp;uuml;&lt;em&gt;(60dan fazla metot) &lt;/em&gt;ve sınıf ile ilişkili verilerin ayrı veri sınıflarında tutularak bu sınıfla ilişkilendirildiği hal olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Process odaklı procedural yaklaşım da diyebiliriz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Bu durumda t&amp;uuml;m iş y&amp;uuml;k&amp;uuml;n&amp;uuml; &amp;uuml;stlenen sınıfların bakımı, genişletilmesi, iş mantıklarının kolayca okunur olarak i&amp;ccedil;erisinde yer alması olduk&amp;ccedil;a zorlaşır.&lt;/li&gt;
&lt;li&gt;Karmaşıklığın yanında, belleğe y&amp;uuml;klenmesi zaman alan nesneler ortaya &amp;ccedil;ıkar.&lt;/li&gt;
&lt;li&gt;Sınıf daha da kalabalıklaştığında yeni istekler i&amp;ccedil;in g&amp;uuml;ncellemelerin yapılması zorlaşacaktır.&lt;/li&gt;
&lt;li&gt;&amp;Uuml;stelik iş mantıklarının da yeteri kadar soyutlanamaması nedeniyle tekrarlı kodların &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ilmesi m&amp;uuml;mk&amp;uuml;n olmayacak ortak iş mantıkları farklı kanallara sunulamayacaktır.&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;BLOB AntiPattern&lt;/strong&gt; olarak da anılır. &lt;strong&gt;AntiPatterns&lt;/strong&gt; kitabının konuya ilişkin &amp;ouml;rneğinde &lt;strong&gt;PowerBuilder&lt;/strong&gt; ile tasarlanan bir &lt;strong&gt;GUI&lt;/strong&gt; ele alınmıştır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;em&gt;İstisnai Durum :&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bazı istisnai durumlarda oluşmasına m&amp;uuml;saade edilebilir. &amp;Ouml;rneğin miras olarak alınan &amp;ccedil;ok eski sistemlerin sarmalanarak&lt;em&gt;(Bir C++ k&amp;uuml;t&amp;uuml;panesinin .Net tarafında Wrap edilmesi olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir)&lt;/em&gt; daha kolay erişilebilmesi ve yeni nesil ortamlara basit bir katman &amp;uuml;zerinden sunulması gerektiği durumlarda g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin bir donamımın &lt;em&gt;(Fax makinesi gibi)&lt;/em&gt; driver yazılımını .Net veya Java tabanlı bir uygulamada rahat kullanabilmek i&amp;ccedil;in onu sarmallayan k&amp;uuml;t&amp;uuml;phaneler &lt;strong&gt;God Object&lt;/strong&gt; olsalar dahi izolasyonu sağladıklarından tercih edilebilirler.&lt;/p&gt;
&lt;h2&gt;Magic PushButton &amp;ndash; Software Design&lt;/h2&gt;
&lt;blockquote&gt;
&lt;p&gt;Soyutlama kullanmadan aray&amp;uuml;z &amp;uuml;zerinde doğrudan uygulama mantığı kodlamak.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href="/pics/anti_15.png"&gt;&lt;img style="float: left; margin: 4px 0px; display: inline;" title="anti_15" src="/pics/anti_15_thumb.png" alt="anti_15" width="200" height="158" align="left" /&gt;&lt;/a&gt;Bu desen &lt;strong&gt;GUI&lt;em&gt;(Graphical User Interface)&lt;/em&gt;&amp;nbsp;&lt;/strong&gt;tipindeki uygulamalarda daha fazla ortaya &amp;ccedil;ıkar. Aray&amp;uuml;z tarafı ile iş mantıkları genellikle buton gibi bir kontroller arkasına g&amp;ouml;m&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;Aray&amp;uuml;z kontrollerine ait doğrulama işlemleri gibi operasyonlar butona basılmadan &amp;ouml;nce, &amp;ccedil;alıştırılması gereken iş mantıkları ise butona basıldıktan sonra devreye giren olay metodlarında ele alınır.&lt;/p&gt;
&lt;p&gt;Doğal olarak iş mantıkları &lt;span style="text-decoration: underline;"&gt;soyutlanmamış&lt;/span&gt; olacağından aray&amp;uuml;z ile sıkı sıkıya bağlı hale gelir ve ilgili iş birimleri farklı yerlerde kullanılmak istendiğinde işler zorlaşır. Kodun okunabilirliği de ortadan kalkar.&lt;/p&gt;
&lt;p&gt;İstisnai Durum :&lt;/p&gt;
&lt;h1&gt;Sonu&amp;ccedil;&lt;/h1&gt;
&lt;p&gt;Yazılım sekt&amp;ouml;r&amp;uuml;nde 10 yıl ve &amp;uuml;zerinde yer alan bireylerin yukarıdaki maddeleri okuduğunda benzer senaryolar ile karşılaşmış ve hatta i&amp;ccedil;erisinde aktif olarak rol oynamış olabileceklerini d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Yazılım geliştirme s&amp;uuml;re&amp;ccedil;leri, teknikleri, mimarileri ve daha pek &amp;ccedil;ok enst&amp;uuml;rman inanılmaz bir hızla geliştiğinden &lt;strong&gt;AntiPattern &lt;/strong&gt;vakalarına da kolayca d&amp;uuml;ş&amp;uuml;lebilmekte. Bu y&amp;uuml;zden bilin&amp;ccedil;lenmekte yarar var. Daha pek &amp;ccedil;ok &lt;strong&gt;AntiPattern &lt;/strong&gt;olduğunu da belirtmek isterim. Bunları mutlaka ilgili kaynaklardan okumalı ve &amp;ouml;rnek vakalarına g&amp;ouml;z atarak ka&amp;ccedil;ınmaya &amp;ccedil;alışmalısınız. Aslında &lt;strong&gt;AntiPatterns &lt;/strong&gt;konusunun &amp;Uuml;niversiteler de m&amp;uuml;fredata dahil edilmesi gerektiğine inananlardanım. &amp;Ouml;zellikle de &lt;strong&gt;Y&amp;uuml;ksek Lisans &lt;/strong&gt;programlarında.&lt;/p&gt;
&lt;p&gt;Bir başka etkinlikte g&amp;ouml;r&amp;uuml;şmek &amp;uuml;zere hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2014-02-28 13:10:00</pubDate>
  <slug>AntiPatterns-Ders-Notlarc4b1m</slug>
  <tags />
  <categories>
    <category>Anti Patterns</category>
  </categories>
</post>