<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>SqlDataReader Sınıfı 1</title>
  <description>Bugünkü makalemizde, SqlDataReader sınıfını incelemeye çalışacağız.  ADO.NET’in bilgisayar programcılığına getirdiği en büyük farklıklardan birisi bağlantısız veriler ile çalışılabilmemize imkan sağlamasıydı. DataSet sınıfıını ve buna bağlı diğer teknikleri kastettiğimi anlamışsınızdır. Bu teknikler ile, bir veritabanı içinde yer alan tabloları, tablolar arasındaki ilişkileri, içerdikleri verileri vb… istemci makinenin belleğinde tutmamız mümkün olabiliyor.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&amp;nbsp; &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" align="justify"&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde, SqlDataReader sınıfını incelemeye &amp;ccedil;alışacağız.&amp;nbsp; ADO.NET&amp;rsquo;in bilgisayar programcılığına getirdiği en b&amp;uuml;y&amp;uuml;k farklıklardan birisi bağlantısız veriler ile &amp;ccedil;alışılabilmemize imkan sağlamasıydı. DataSet sınıfıını ve buna bağlı diğer teknikleri kastettiğimi anlamışsınızdır. Bu teknikler ile, bir veritabanı i&amp;ccedil;inde yer alan tabloları, tablolar arasındaki ilişkileri, i&amp;ccedil;erdikleri verileri vb&amp;hellip; istemci makinenin belleğinde tutmamız m&amp;uuml;mk&amp;uuml;n olabiliyor.&lt;/p&gt;
&lt;p class="MsoNormal" align="justify"&gt;Bu sayede, bu veriler istemci makine belleği &amp;uuml;zerinde tutulduğundan, bir veritabanına s&amp;uuml;rekli bağlantısı olan bir sisteme gore daha hızlı &amp;ccedil;alışabiliyoruz. Ayrıca veritabanı sunucusuna s&amp;uuml;rekli olarak bağlı olmadığımız i&amp;ccedil;in network trafiğinide hafifletmiş oluyoruz. &amp;nbsp; T&amp;uuml;m bu hoş ayrıntılar dışında hepimiz i&amp;ccedil;in nahoş olan ayrıntı, her halikarda bellek t&amp;uuml;ketiminin artması.&amp;nbsp; &amp;Ouml;yleki bazen kullanıdığımız programlarda sadece listeleme amacı ile, sadece g&amp;ouml;rsellik amacı ile k&amp;uuml;&amp;ccedil;&amp;uuml;k veriler ile &amp;ccedil;alışmak durumunda kaldığımızda, bu elde edilebilirlik i&amp;ccedil;in fazlasıyla kaynak t&amp;uuml;ketmiş oluyoruz. İşte ADO.NET &amp;lsquo;te bu tip veriler d&amp;uuml;ş&amp;uuml;n&amp;uuml;lerek, listeleme amacı g&amp;uuml;den, k&amp;uuml;&amp;ccedil;&amp;uuml;k boyutlarda olan veri k&amp;uuml;meleri i&amp;ccedil;in DataReader sınıfları tasarlanmış. Biz bug&amp;uuml;n SqlDataReader sınıfını inceleyeceğiz. &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" align="justify"&gt;Bir SqlDataReader sınıfı bir veri akımını(data stream) temsil eder. Bu nedenle herhangibir anda bellekte sadece bir veri satırına erişebilir. İşte bu performansı ve hızı arttıran bir unsurdur. Bu veri akımını elde etmek i&amp;ccedil;in s&amp;uuml;rekli a&amp;ccedil;ık bir sunucu bağlantısı ve verileri getirecek sql sorgularını &amp;ccedil;alıştıracak bir SqlCommand nesnesi gereklidir. Dikkat edicek olursanız s&amp;uuml;rekli a&amp;ccedil;ık olan bir sql sunucu bağlantısından yani bir SqlConnection&amp;rsquo;dan bahsettik. SqlDataReader nesnesi sql sunucu bağlantısının s&amp;uuml;rekli a&amp;ccedil;ık olmasını gerektirdiği i&amp;ccedil;in network trafiğini meşgul eder, aynı zamanda kullandığı SqlConnection nesnesinin başka işlemler i&amp;ccedil;in kullanılmasınıda engeller. İşte bu eksiler nedeni ile, onun sadece okuma ama&amp;ccedil;lı veya listeleme ama&amp;ccedil;lı ve yanlız okunabilir veri k&amp;uuml;meleri i&amp;ccedil;in kullanılması &amp;ouml;nerilir. Bu nedenlede, read-only(yanlız okunabilir) ve forward-only(sadece ileri y&amp;ouml;nl&amp;uuml;) olarak tanımlanır.&amp;nbsp; Şimdi SqlDataReader nesnesi ile bir veri akımının elde edilmesi konusunu aşağıdaki şekil yardımıyla incelemeye &amp;ccedil;alışalım.&amp;nbsp; &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &lt;img src="/makale/images/mk28_1.gif" alt="" width="480" height="324" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em&gt; Şekil 1.&amp;nbsp; SqlDataReader nesnesinin &amp;ccedil;alışma şekli.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" align="justify"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi sql sunucusuna s&amp;uuml;rekli bağlı durumdayız.&amp;nbsp; Bunun yanında SqlCommand sorgusunun &amp;ccedil;alıştırılması sonucu elde edilen veri akımı SqlDataReader nesnesince temsil edilmektedir. İstemci bilgisayarımız, her hangibir t zamanında kendi belleğinde SqlDataReader&amp;rsquo;ın taşıdığı veri akımının sadece tek bir satırını temsil etmektedir. SqlCommand nesnesinin &amp;ccedil;alıştırdığı sql c&amp;uuml;mleciğinin sonucunu(sonu&amp;ccedil; k&amp;uuml;mesini) SqlDataReader nesnemize aktarmak i&amp;ccedil;in ExecuteReader metodu kullanılır. Burada bir noktaya daha değinelim. SqlDataReader sınıfı herhangibi yapıcı metoda sahip değildir. Yani bir SqlDataReader nesnesini bir new metodu ile oluşturamayız.&lt;/p&gt;
&lt;p class="MsoNormal" align="justify"&gt;Sadece bir SqlDataReader nesnesi tanımlayabiliriz. Maharet aslında SqlCommand nesnesinin ExecuteReader metodundadır.&amp;nbsp; Bu metod ile, daha &amp;ouml;nceden tanımladığımız SqlDataReader nesnesini oluşturur ve SqlCommand sorgusunun sonucu olan veri k&amp;uuml;mesini temsil etmesini sağlarız. Ancak bir DataTable veya bir DataSet&amp;rsquo;te olduğu gibi sorgu sonucu elde edilen veri k&amp;uuml;mesinin tamamı bellekte saklanmaz. Bunun yerine SqlDataReader nesnesi kendisini, &amp;ccedil;alıştırılan sorgu sonu&amp;ccedil;larını tutan ge&amp;ccedil;ici bir dosyaının ilk satırının &amp;ouml;ncesine konumlandırır. &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" align="justify"&gt;İşte bu noktadan sonraki satırları okuyabilmek i&amp;ccedil;in bu sınıfa ait Read metodunu kullanırız. Read metodu, her zaman bir sonraki satıra konumlanılmasını sağlar. Tabi bir sonrasında kayıt olduğu s&amp;uuml;rece bu işlemi yapar. B&amp;ouml;ylece bir While d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile Read metodunu kullanırsak, sorgu sonucu elde edilen veri k&amp;uuml;mesindeki t&amp;uuml;m satırları gezebiliriz. Konumlanılan her bir satır bellekte temsil edilir. Dolayısıyla bir sonraki t zamanında, bellekte eski satırın yerini yeni satır alır. Bu sorgu sonucu elde edilen veri k&amp;uuml;mesinden belleğe doğru devam eden&amp;nbsp; bir akım(stream) dır. Geriye hareket etmek gibi bir l&amp;uuml;ks&amp;uuml;m&amp;uuml;z olmadığı gibi, t zamanında bellekte yer alan satırları değiştirmek gibi bir imkanımızda bulunmamaktadır. İşte performansı bu arttırmaktadır. Ama elbetteki &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k boyutlu ve satırlı verilerle &amp;ccedil;alışırken listeleme amacımız yok ise veriler &amp;uuml;zerinde değişiklikler yapılabilmesinide istiyorsak bu durumda bağlantısız veri elemanlarını kullanmak daha mantıklı olucaktır.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" align="justify"&gt;Şimdi dilerseniz konumuz ile ilgili bir &amp;ouml;rnek yapalım.&amp;nbsp; &amp;Ouml;zellikle ticari sitelerde, &amp;ccedil;oğunlukla kullanıcı olarak &amp;uuml;r&amp;uuml;nleri inceleriz. &amp;Ouml;rneğin kitap alacağız. Belli bir kategorideki kitaplara bakmak istiyoruz. Kitapların sadece adları g&amp;ouml;r&amp;uuml;n&amp;uuml;r olsun. Kullanıcı bir kitabı se&amp;ccedil;tiğinde, bu kitaba ait detaylarıda g&amp;ouml;rebilsin. T&amp;uuml;m bu işlemler sadece izlemek ve bakmaktan ibaret. Dolayısıyla bu veri listelerini, &amp;ouml;rneğin bir listBox kontrol&amp;uuml;ne y&amp;uuml;kleyecek isek ve sonu&amp;ccedil; olarak bir listeleme yapıcak isek, SqlDataReader nesnelerini kullanmamız daha avantajlı olucaktır. Dilerseniz uygulamamızı yazmaya başlayalım. &amp;Ouml;ncelikle Visual Studio.Net ortamında bir Web Application oluşturalım. Default.aspx isimli sayfamızı ben aşağıdaki gibi tasarladım.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;&lt;img src="/makale/images/mk28_2.gif" alt="" width="543" height="317" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em&gt; Şekil 2.&amp;nbsp; WebForm tasarımımız.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal"&gt;Şimdi de kodlarımızı yazalım.&amp;nbsp; &amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection conFriends; 

public void baglantiAc()
{
	/* Sql Sunucumuza bağlanmak i&amp;ccedil;in SqlConnection nesnemizi oluşturuyoruz ve bağlantıyı a&amp;ccedil;ıyoruz. */
	conFriends=new SqlConnection("data source=localhost;integrated security=sspi;initial catalog=Friends");
	conFriends.Open();
} 
private void Page_Load(object sender, System.EventArgs e)
{
	if(!Page.IsPostBack) /* Eğer sayfa daha &amp;ouml;nce y&amp;uuml;klenmediyse bu if bloğu i&amp;ccedil;indeki kodlar &amp;ccedil;alıştırılıyor. */
	{
		baglantiAc(); /* Sql sunucumuza olan SqlConnection nesnesini tanımlayan ve bağlantıyı a&amp;ccedil;an metodumuzu &amp;ccedil;ağırıyoruz. */ 
		/* SqlCommand nesnemize &amp;ccedil;alıştıracağımız sql sorgusunu bildiriyoruz. Bu sorgu Kitaplar tablosundan Kategori alanına ait verileri Distinct komutu sayesinde, benzersiz şekilde alır. Nitekim aynı Kategori isimleri tabloda birden fazla sayıda. Biz Distinct sasyesinde birbirinden farklı kategorileri tek tek elde ediyoruz. B&amp;ouml;ylece veri k&amp;uuml;memizizde m&amp;uuml;mk&amp;uuml;n olduğunca k&amp;uuml;&amp;ccedil;&amp;uuml;ltm&amp;uuml;ş ve bir SqlDataReader nesnesinin tam dişine g&amp;ouml;re hazırlamış oluyoruz. */
		SqlCommand cmdKategori=new SqlCommand("Select distinct Kategori From Kitaplar Order By Kategori",conFriends);
		SqlDataReader drKategori; /* SqlDataReader nesnemizi tanımlıyoruz. L&amp;uuml;tfen tanımlama şeklimize dikkat edin. Sanki bir değişken tanımlıyoruz gibi. Herhangibir new yapıcı metodu yok. */ 
		drKategori=cmdKategori.ExecuteReader(CommandBehavior.CloseConnection); /* SqlCommand nesnemizin ExecuteReader yardımıyla sorgumuzu &amp;ccedil;alıştırıyor ve sonu&amp;ccedil; k&amp;uuml;mesini temsil edicek SqlDataReader nesnemizi atıyoruz. Bu aşamada SqlDataReader nesnemiz sorgu sonucu oluşan veri k&amp;uuml;mesinin ilk satırının &amp;ouml;ncesine konumlanıyor. */
		/* Bahsetmiş olduğumuz while d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile satırları teker teker ileri doğru olucak şekilde belleğe alıyoruz. Her bir t zamanında bir satır belleğe geliyor ve oradanda ListBox kontrol&amp;uuml;ne iligli satırın, 0 indexli alanına ait değer GetString metodu ile alınıyor. */
		while(drKategori.Read())
		{
		   lstKategori.Items.Add(drKategori.GetString(0));
		}
		drKategori.Close(); /* SqlDataReader nesnemiz kapatılıyor. Biz ExecuteReader metodunu &amp;ccedil;alıştırırken parametre olarak, CommandBehavior.CloseConnection değerini verdik. Bu bir SqlDataReader nesnesi kapatıldığında, a&amp;ccedil;ık olan bağlantının otomatik olarak kapatılmasını, yani SqlConnection bağlantısının otomatik olarak kapatılmasını sağlar. Buda system kaynaklarının serbest bırakılmasını sağlar.*/
	}
} 

private void btnKitaplar_Click(object sender, System.EventArgs e)
{
	string kategori=lstKategori.SelectedItem.ToString(); 
	baglantiAc(); 
	SqlCommand cmdKitaplar=new SqlCommand("Select distinct Adi,ID From Kitaplar Where Kategori='"+kategori+"' order by Adi",conFriends);
	SqlDataReader drKitaplar;
	drKitaplar=cmdKitaplar.ExecuteReader(CommandBehavior.CloseConnection); 
	int KitapSayisi=0; 
	lstKitaplar.Items.Clear(); 
	while(drKitaplar.Read())
	{
		lstKitaplar.Items.Add(drKitaplar.GetString(0));
		KitapSayisi+=1;
	}
	drKitaplar.Close();
	lblKitapSayisi.Text=KitapSayisi.ToString();
	/* Yukarıdaki d&amp;ouml;ng&amp;uuml;de elde edilen kayıt sayısını &amp;ouml;ğrenmek i&amp;ccedil;in KitapSayisi isimli bir sayacı d&amp;ouml;ng&amp;uuml; i&amp;ccedil;ine koyduğumuzu farketmişsinizdir. SqlDataReader nesnesi herhangibir t zamanında bellekte sadece bir satırı temsil eder. Asıl veri k&amp;uuml;mesinin tamamını i&amp;ccedil;ermez, yani belleğe almaz. Bu nedenle veri k&amp;uuml;mesindeki satır sayısını temsil edicek, Count gibi bir metodu yoktur. İşte bu nedenle kayıt sayısını bu teknik ile &amp;ouml;ğrenmek durumundayız. */
} 
private void lstKitaplar_SelectedIndexChanged(object sender, System.EventArgs e)
{
	string adi=lstKitaplar.SelectedItem.ToString();
	baglantiAc(); 
	SqlCommand cmdKitapBilgisi=new SqlCommand("Select * From Kitaplar Where Adi='"+adi+"'",conFriends);
	SqlDataReader drKitapBilgisi;
	drKitapBilgisi=cmdKitapBilgisi.ExecuteReader(CommandBehavior.CloseConnection); 
	lstKitapBilgisi.Items.Clear(); 
	while(drKitapBilgisi.Read())
	{
		/* FieldCount &amp;ouml;zelliği SqlDataReader nesnesinin t zamanında bellekte temsil etmiş olduğu satırın kolon sayısını vermektedir. Biz burada t&amp;uuml;m kolonlardaki verileri okuyacak dolayısıyla t zamanında bellekte yer alan satırın verilerini elde edebileceğimiz bir For d&amp;ouml;ng&amp;uuml;s&amp;uuml; oluşturduk. Herhangibir alanın değerine, drKitapBilgisi[i].ToString() ifadesi ile ulaşıyoruz. */
		for(int i=0;i&amp;lt;drKitapBilgisi.FieldCount;++i)
		{
		   lstKitapBilgisi.Items.Add(drKitapBilgisi[i].ToString());
		}
		lstKitapBilgisi.Items.Add("------------------");
	}
	drKitapBilgisi.Close();
}&lt;/pre&gt;
&lt;p class="MsoNormal"&gt;Şimdi programımızı bir &amp;ccedil;alıştıralım ve sonu&amp;ccedil;larını bir g&amp;ouml;relim. &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&amp;nbsp;&lt;img src="/makale/images/mk28_3.gif" alt="" width="539" height="318" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em&gt; Şekil 3.&amp;nbsp; Programın &amp;ccedil;alışmasının sonucu.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" align="justify"&gt;Geldik bir makalemizin daha sonuna.&amp;nbsp; Bir sonraki makalemizde SqlDataReader sınıfını incelemeye devam edeceğiz. &amp;Ouml;zellikle SqlCommand sınıfının ExecuteReader metodunun aldığı parameter değerlerine gore nasıl sonu&amp;ccedil;lar elde edebileceğimizi incelemeye &amp;ccedil;alışacağız. Bunun yanında SlqDataReader sınıfının diğer &amp;ouml;zelliklerinide inceleyeceğiz. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2003-12-28 12:00:00</pubDate>
  <slug>SqlDataReader-Sc4b1nc4b1fc4b1-1-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>sqldatareader</tag>
    <tag>c#</tag>
    <tag>oop</tag>
    <tag>net</tag>
    <tag>database</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>