<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Docker Yerine Podman (Pod Manager) Kullanmak</title>
  <description>Heimdall üstünden birşeyler kurcalamak istediğimde yolum genellikle bir Docker imajı ile kesişiyor. Bakmak istediğim bir NoSQL veritabanı mı var, ELK üçlüsü mü gerekli, bir NGinx server ortamımı lazım ya da yeni bir servis için çalışma zamanımı hazırlamam gerekiyor... Hemen Docker kardeşimizin kapısını çalıyorum. Aslında bakarsanız Container teknolojileri denince çoğumuzun aklına Docker'dan başka bir şey gelmiyordur belki de. "Gerçekten de böyle mi?" diye düşündüğüm bir ara Docker'ın güçlü bir alternatifi olan Podman isimli ürünle karşılaştım ve onu biraz tanımaya karar verdim...</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/40/anakinspod.png" alt="" align="right" /&gt;Heimdall &amp;uuml;st&amp;uuml;nden birşeyler kurcalamak istediğimde yolum genellikle bir Docker imajı ile kesişiyor. Bakmak istediğim bir NoSQL veritabanı mı var, ELK &amp;uuml;&amp;ccedil;l&amp;uuml;s&amp;uuml; m&amp;uuml; gerekli, bir NGinx server ortamımı lazım ya da yeni bir servis i&amp;ccedil;in &amp;ccedil;alışma zamanımı hazırlamam gerekiyor... Hemen Docker kardeşimizin kapısını &amp;ccedil;alıyorum. Aslında bakarsanız Container teknolojileri denince &amp;ccedil;oğumuzun aklına Docker'dan başka bir şey gelmiyordur belki de. "Ger&amp;ccedil;ekten de b&amp;ouml;yle mi?" diye d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m bir ara Docker'ın g&amp;uuml;&amp;ccedil;l&amp;uuml; bir alternatifi olan Podman isimli &amp;uuml;r&amp;uuml;nle karşılaştım ve onu biraz tanımaya karar verdim.&lt;/p&gt;
&lt;p&gt;Esasen Docker tek ve vazge&amp;ccedil;ilmez bir container aracı olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmemeli. Sonu&amp;ccedil;ta Open Container Initiative tarafından belirlenmiş standartlara uyan ara&amp;ccedil;lar mevcut. &lt;a href="https://opencontainers.org/" target="_blank"&gt;Open Container Initiative&lt;/a&gt;, bu tip ara&amp;ccedil;larda &amp;uuml;&amp;ccedil; temel &amp;ouml;zelliğin olmasını vurguluyor. Container &amp;ccedil;alışma zamanı&lt;em&gt;(runtime)&lt;/em&gt;, dağıtım stratejisi&lt;em&gt;(distribution)&lt;/em&gt; ve baş akt&amp;ouml;r olarak da image&lt;em&gt;.&amp;nbsp;&lt;/em&gt;Podman bu standartlara uyan ara&amp;ccedil;lardan birisi. Buna g&amp;ouml;re Podman ile hazırlanan imajlar Docker ile veya XYZ isimli başka bir Container ile de uyumlu oluyor &lt;em&gt;(Zaten stadartların amacı da bu değil mi? Farklı &amp;uuml;r&amp;uuml;nlerin birbirleri yerine tercih edilip kullanılabilmesi i&amp;ccedil;in ortak bir y&amp;ouml;ntemler kılavuzu sunmak)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Red Hat tarafından a&amp;ccedil;ık kaynak olarak geliştirilen Podman &amp;ouml;z&amp;uuml;nde Pod&lt;em&gt;(Kubernetes'in en k&amp;uuml;&amp;ccedil;&amp;uuml;k işlem birimi olarak bahsi ge&amp;ccedil;en lakin benim aklıma hep Anakin Skywalker'ın yarış aracını getiren)&lt;/em&gt; sistemine dayanıyor. Dolayısıyla Podman ortamından Kubernetes &amp;uuml;zerine g&amp;ouml;&amp;ccedil; etmek&lt;em&gt;(migration)&lt;/em&gt;&amp;nbsp;olduk&amp;ccedil;a kolay. Pod i&amp;ccedil;erisinde birden fazla Container kullanılabiliyor ve ayrıca Docker da olduğu gibi daemon ihtiyacı bulunmuyor. Zaten temel fark her ikisinin farklı mimari kullanmaları. Docker, client-server temelli bir mimariyi baz alıyor. Client g&amp;ouml;revi &amp;uuml;stlenen CLI arabirimi&lt;em&gt;(ki biz onun&amp;nbsp;komutlarını kullanıyoruz)&lt;/em&gt; arka planda&lt;em&gt;(Server side)&lt;/em&gt; image nesnesi inşa etmek ve container &amp;ccedil;alıştırmak gibi işleri &amp;uuml;stlenen daemon ile iletişim halinde. CLI'ın Daemon ile olan bu iletişimi&amp;nbsp;Root kullanıcı yetkilerine ihtiya&amp;ccedil; duymakta.&lt;/p&gt;
&lt;p&gt;Podman ise bunun aksine Root kullanıcı şart koşmuyor &amp;ccedil;&amp;uuml;nk&amp;uuml; Daemonless bir mimari kullanmakta. Standart bir kullanıcı s&amp;ouml;z konusu ise onun i&amp;ccedil;in a&amp;ccedil;ılan &amp;ouml;zel &amp;ccedil;alışma sahası&lt;em&gt;(namespace)&lt;/em&gt; kullanılıyor. Buna g&amp;ouml;re her kullanıcı sadece kendi Container &amp;ouml;rnekleri ile &amp;ccedil;alışıyor. Root kullanıcı yetkisi gerekmemesinin başka bir avantajı daha olabilir. Container başka bir kullanıcı tarafında ele ge&amp;ccedil;irilse bile Root kullanıcı yetkilerine sahip olmadığından sadece o workspace &amp;uuml;zerindeki yetkilerle sınırlı kalacaktır.&lt;/p&gt;
&lt;p&gt;Podman, Image oluşturmak i&amp;ccedil;in Buildah ve uzak repolara image kaydetmek&lt;em&gt;(Register)&lt;/em&gt; i&amp;ccedil;in&amp;nbsp;skopeo gibi ara&amp;ccedil;ları kullanır. Diğer yandan &amp;ouml;ğrendiğim kadarıyla sadece Linux sistemlerde &amp;ccedil;alışıyor&lt;em&gt;(Windows Subsystem for Linux&amp;nbsp;bir istisna olabilir mi bakmak lazım)&lt;/em&gt;&amp;nbsp;Bununla birlikte Docker Compose'un Podman tarafında hen&amp;uuml;z bir karşılığı yok&lt;em&gt;(Yazıyı hazırladığım tarih itibariyle doğrulanmamış bir bilgidir. L&amp;uuml;tfen araştırınız)&amp;nbsp;&lt;/em&gt;Haydi gelin bu Podman nasıl kurulur, temel terminal komutları nelerdir ve onunla bir Poderize işlemi nasıl ger&amp;ccedil;ekleştirilir bir bakalım.&lt;/p&gt;
&lt;h2&gt;&amp;Ouml;nce Kurulum&lt;/h2&gt;
&lt;p&gt;Bu seneki pek &amp;ccedil;ok SkyNet &amp;ccedil;alışmasında olduğu gibi ben denemelerimi&amp;nbsp;Heimdall&lt;em&gt;(Ubuntu-20.04)&lt;/em&gt;&amp;nbsp;&amp;uuml;zerinde yapmaktayım. Ancak diğer platformlar i&amp;ccedil;inde aynı terminal komutları ve prensipler s&amp;ouml;z konusu olacaktır. Linux tarafı i&amp;ccedil;in şağıdaki şekilde konuya giriş yapabiliriz&lt;em&gt;(G&amp;uuml;ncel kurulum bilgilerine &lt;a href="https://podman.io/getting-started/installation" target="_blank"&gt;resmi adresinden&lt;/a&gt; bakılabilir)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# Podman resmi dok&amp;uuml;mantasyonundaki adımları takip ederek kurulumu yaptım
. /etc/os-release
echo "deb https://download.opensuse.org/repositories/devel:/kubic:/libcontainers:/stable/xUbuntu_${VERSION_ID}/ /" | sudo tee /etc/apt/sources.list.d/devel:kubic:libcontainers:stable.list
curl -L https://download.opensuse.org/repositories/devel:/kubic:/libcontainers:/stable/xUbuntu_${VERSION_ID}/Release.key | sudo apt-key add -
sudo apt-get update
sudo apt-get -y upgrade 
sudo apt-get -y install podman

# Sonrasında bir versiyon kontrol&amp;uuml; de yaptım
podman -v&lt;/pre&gt;
&lt;p&gt;Kurulum sonrasında birka&amp;ccedil; komutla Podman'i inceleyebiliriz. İlgi &amp;ccedil;ekici kısım bir pod oluşturmak ve bu pod i&amp;ccedil;erisine n sayıda container yerleştirmek olacak tabii ki ama &amp;ouml;nce temeller.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# &amp;Ouml;nce bir pod oluşturalım (adı pod_race olsun)
podman pod create --name pod_race

# Şimdi sistemdeki pod listesine bakalım
podman pod list

# Bu pod i&amp;ccedil;inde bir tane alpine imajından container başlatalım
podman run -d --pod pod_race alpine

# Hadi bir tane de nginx imajından http server container'ı &amp;ccedil;alıştıralım (aynı pod i&amp;ccedil;inde)
podman run -d --pod pod_race nginx

# Hatta bir tane de rabbitmq container'ı başlatalım. O da aynı pod i&amp;ccedil;inde olsun.
podman run -d --pod pod_race rabbitmq

# Şimdi pod_race isimli pod'un i&amp;ccedil;indeki container'lara bakabiliriz
podman ps -a --pod

# Aşağıdaki komutla y&amp;uuml;kl&amp;uuml; olan image &amp;ouml;rneklerini de g&amp;ouml;rebiliriz
podman images

# Bir podu aşağıdaki komutla durdurabiliriz. Bu, i&amp;ccedil;indeki Container'ları da durduracaktır.
podman pod stop pod_race

# Pek tabi oluşturulan bir podu, i&amp;ccedil;indeki t&amp;uuml;m container &amp;ouml;rnekleri ile birlikte silebiliriz de
podman pod rm pod_race&lt;/pre&gt;
&lt;p&gt;Yukarıdaki temel&amp;nbsp;&amp;ccedil;alışmaların kısa bir &amp;ouml;zeti aşağıdaki ekran &amp;ccedil;ıktısındaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/40/Screenshot_01.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Podman ile uzak depolardaki imajları kolayca arayabiliriz de. Mesela sevgili MariaDB imajlarını aradığımızı ve 20 yıldız &amp;uuml;st&amp;uuml;nde olup automated &amp;ouml;zellikli olanları bulmak istediğimizi d&amp;uuml;ş&amp;uuml;nelim...&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;podman search mariadb --filter=stars=20 --filter=is-automated

# ya da resmi bir imaj arayıp a&amp;ccedil;ıklamaların da tamamını(--no-trunc) istersek şunu kullanabiliriz
podman search mariadb --no-trunc --filter=is-official

# Hatta &amp;ccedil;ıktı tablosundaki kolonlardan sadece istediklerimizi de mustache stilindeki parametrelerle değiştirebiliriz
podman search --format "table {{.Name}} {{.Stars}}" mariadb --filter=stars=20

# Uzak repolardaki kendi imajlarımızı da aratmak isteyebiliriz.
# Mesela Quay.io'da ki imajlarımızı aratmak istediğimizi d&amp;uuml;ş&amp;uuml;nelim.
# Aşağıdaki komutla bunu yapabiliriz?
# Lakin kuvvetle muhtemel &amp;ouml;ncesinde Quay.io i&amp;ccedil;in Login olmamız gerekebilir. Podman bunu da sağlar.
podman login quay.io
podman search quay.io/&lt;/pre&gt;
&lt;p&gt;Uzak diyarlardaki imajları terminalden nasıl arayacağımızı g&amp;ouml;rd&amp;uuml;k. Bazen belli bir imajın &amp;ouml;zelliklerini onu sisteme indirmeden detayda da &amp;ouml;ğrenmek isteyebiliriz. Bunun i&amp;ccedil;in Skopeo aracından yararlanıyoruz. &amp;Ouml;rneğin alpine imajının son s&amp;uuml;r&amp;uuml;m&amp;uuml; ile ilgili bir takım temel &amp;ouml;zellikleri şu komutla &amp;ouml;ğrenebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;skopeo inspect docker://docker.io/alpine:latest&lt;/pre&gt;
&lt;p&gt;Yukarıdaki terminal komutlarına ait Heimdall &amp;ccedil;ıktıları ise aşağıdaki gibi oluşmuştur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/40/Screenshot_02.png" alt="" /&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Podman varsayılan kurulumunda image registery adresleri olarak docker ve quay geldi. Başka adresler eklemek istersek&lt;em&gt;(mesela private repo'lar)&lt;/em&gt; /etc/containers/registries.conf dosyasını d&amp;uuml;zenlemek gerekir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Şimdi podman ile bir imaj hazırlayıp onu build etmeyi deneyelim. Tahmin edileceği &amp;uuml;zere bize kobay bir uygulama lazım ve bunun en basit yolu aptal bir NodeJs servisi. Express web &amp;ccedil;atısını kullanan bu servisi aşağıdaki terminal komutları ile hazırlayıp kodlayarak devam edelim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;mkdir pingapi
cd pingapi
npm init -y
touch index.js
npm i express
touch Dockerfile&lt;/pre&gt;
&lt;p&gt;index.js i&amp;ccedil;eriğini aşağıdaki gibi yazabiliriz. Sadece masa tenisinin g&amp;uuml;zel bir spor olduğunu ve bazen her şeye ara verip biraz masa tenisi oynamanın iyi olacağını s&amp;ouml;yleyeyen bir servis ;)&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;const express = require('express')
const app = express()

app.get('/ping', function (request, result) {
    result.send('Biraz ara verip Ping Pong oynayalım mı?')
})

app.listen(5555, "0.0.0.0", function () {
    console.log('Servisimiz http://localhost:5555/ping adresinden denenebilir.')
})&lt;/pre&gt;
&lt;p&gt;Tabii inşanın olmazsa olmazı Dockerfile dosyamız. Node11 s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; baz alarak uygulamamızı olduğu gibi kopyalayıp 5555 nolu port &amp;uuml;st&amp;uuml;nden a&amp;ccedil;acak bir &amp;ccedil;alışma zamanı ortamını tanımlıyor.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;FROM node:11
WORKDIR /app
COPY package*.json  ./
RUN npm install
COPY . .
EXPOSE 5555
CMD ["node", "index.js"]&lt;/pre&gt;
&lt;p&gt;Kobay servisimiz Dockerize&lt;em&gt;(Poderize)&lt;/em&gt; edilmeye hazır ;) İzleyen terminal komutları&amp;nbsp;ile onu inşa edelim, sorasında &amp;ccedil;alıştırıp kullanmayı deneyelim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# &amp;Ouml;nce Build işlemini yapalım
podman build -t ping-api .

# İmajın oluşup oluşmadığı kontrol ettikten sonra onu
# &amp;ccedil;alıştırıp api'den değer alıp alamadığımıza bakmak iyi olabilir ;)
podman images
podman run -p 5555:5555 ping-api
podman ps -a
curl http://localhost:5555/ping

# &amp;Ccedil;alışmakta olan container'ı durdurmak i&amp;ccedil;inse aşağıdaki komutu kullanabiliriz
# (337f id değeri tabii ki siz denerken farklı olacaktır)
podman stop 337f&lt;/pre&gt;
&lt;p&gt;İşte &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı. Podman ile Container ayağa kalktıktan sonra servisi masa tenisi oynamaya g&amp;ouml;t&amp;uuml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/40/Screenshot_03.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabii stop komutu ile ilgili container durdurulduğunda servise g&amp;ouml;nderilen talepler cevapsız kalır. Bu bir nevi Container tatile &amp;ccedil;ıktığında servisin &amp;ccedil;alışmaması gerektiğinin de bir ispatıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/40/Screenshot_04.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Skopeo&lt;/h2&gt;
&lt;p&gt;Podman ile ilgili bilgileri araştırırken yanında yardımcı başka ara&amp;ccedil;lar da g&amp;ouml;rebiliriz. OCI ilkelerine g&amp;ouml;re imaj oluşturmayı kolaylaştıran &lt;a href="https://buildah.io/" target="_blank"&gt;Buildah&lt;/a&gt;&lt;em&gt;(Kanımca Build Yeaaa diye telafuz ediliyor)&lt;/em&gt; veya yukarıda bir image nesnesinin detay &amp;ouml;zelliklerini &amp;ouml;ğrenmek ve aynı zamanda depolar arası container transferlerini&lt;em&gt;(kendi deponuzla docker.io veya quay.io gibi public registery noktaları arasında taşımak)&lt;/em&gt; kolaylaştıran &lt;a href="https://github.com/containers/skopeo" target="_blank"&gt;skopeo&lt;/a&gt; gibi. Skopeo i&amp;ccedil;in Linux tarafında aşağıdaki adımları takip ederek kurulum yapabilirsiniz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;. /etc/os-release
sudo sh -c "echo 'deb http://download.opensuse.org/repositories/devel:/kubic:/libcontainers:/stable/x${NAME}_${VERSION_ID}/ /' &amp;gt; /etc/apt/sources.list.d/devel:kubic:libcontainers:stable.list"
curl -L https://download.opensuse.org/repositories/devel:/kubic:/libcontainers:/stable/x${NAME}_${VERSION_ID}/Release.key | sudo apt-key add -
sudo apt-get -y update
sudo apt-get -y install skopeo&lt;/pre&gt;
&lt;p&gt;Şimdilik bu kadar. Gelelim bu &amp;ccedil;alışma haricinde daha neler yapabileceğinize. &amp;Ouml;rneğin&amp;nbsp;pod_a ve pod_b şeklinde iki ayrı pod oluşturup&amp;nbsp;i&amp;ccedil;lerindeki container'ların birbirlerini kullanmasını deneyebilirsiniz. Yani&amp;nbsp;pod_a'da ki bir .net web api, pod_b'deki MongoDb container'ını kullanmaya &amp;ccedil;alışabilir mi sorusunun cevabını arayabilirsiniz. Diğer yandan&amp;nbsp;Podman benzeri OCI standartlarına uyan başka container teknolojileri var mı araştırmakta ve hatta aralarındaki kıyaslamalara bakmakta yarar var.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir SkyNet derlememizin daha sonuna. Bu &amp;ccedil;alışmamızda kobay bir NodeJs servisini Poderize&lt;em&gt;(Dockerize yerine bunu kullanayım dedim)&lt;/em&gt; etmeyi ve Podman'in genel kullanımını &amp;ouml;ğrendik. &amp;Ouml;rnek kodlara &lt;a href="https://github.com/buraksenyurt/skynet/tree/master/No%2040%20-%20This%20is%20Podman" target="_blank"&gt;github reposu&lt;/a&gt; &amp;uuml;zerinden erişebilirsiniz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2020-12-27 09:14:00</pubDate>
  <slug>docker-yerine-podman-pod-manager-kullanmak</slug>
  <tags>
    <tag>docker</tag>
    <tag>podman</tag>
    <tag>container</tag>
    <tag>open-container-initiative</tag>
    <tag>kubernetes</tag>
    <tag>quay</tag>
    <tag>red-hat</tag>
    <tag>skopeo</tag>
    <tag>poderize</tag>
    <tag>deamon</tag>
  </tags>
  <categories>
    <category>DevOps</category>
  </categories>
</post>