<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>GoLang - Google ProtoBuf Kullanımı</title>
  <description>Veriyi kullandığımız dile göre çeşitli şekillerde ifade edebiliriz. Eğer nesne yönelimli bir dil kullanıyorsak buradaki başrol oyuncumuz sınıflar olacaktır. Verinin nesnel olarak ifade edilişinde rol olan sınıf ve benzeri tipler, çalışma zamanında taşıdıkları içerikleri ile hareket halindedir. Bu hareket aynı uygulamana alanında olabileceği gibi uygulamalar arasında da gerçekleşebilir. Veri ağ üzerinde de hareket edebilir. Verinin bu şekilde dolaşımı sırasında bazen serileştirilmesi de gerekir. Tabii bu noktada karşımıza platform bağımsızlık, okunabilirlik, genişletilebilirlik ve performans gibi kriterler çıkar.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/06/protogopher_1.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Uygulama verilerini kullandığımız dile g&amp;ouml;re &amp;ccedil;eşitli şekillerde ifade edebiliriz. Eğer nesne y&amp;ouml;nelimli bir dil kullanıyorsak buradaki başrol oyuncumuz sınıflardır. Verinin nesnel olarak ifade edilişinde rol olan sınıf ve benzeri tipler, &amp;ccedil;alışma zamanında taşıdıkları i&amp;ccedil;erikleri ile s&amp;uuml;rekli hareket halindedir. Bu hareket uygulamanın kendi alanında olabileceği gibi farklı programlar arasında da ger&amp;ccedil;ekleşebilir. Veri, ağ &amp;uuml;zerinde de hareket edebilir. Verinin bu şekilde dolaşımı sırasında belirli kriterlere g&amp;ouml;re&amp;nbsp;serileştirilmesi de gerekebilir. Bu noktada karşımıza platform bağımsızlık, okunabilirlik, genişletilebilirlik, versiyonlama ve performans gibi kriterler &amp;ccedil;ıkar.&lt;/p&gt;
&lt;p&gt;Bir fabrikanın &amp;uuml;retim hattına ait bilgileri barındıran bir veri modelini tasarladığınızı ve &amp;ccedil;alışma zamanı nesne topluluklarının belirli ama&amp;ccedil;lar doğrultusunda serileştirme işlemlerine tabii tutulacağını d&amp;uuml;ş&amp;uuml;nelim. Uygulama &amp;ccedil;alışma zamanı tek bir nesne&amp;nbsp;bilgisi&lt;em&gt;(&amp;ouml;rneğin envanterdeki kategoriler)&lt;/em&gt; ile &amp;ccedil;alışabileceği gibi n sayıda nesne&amp;nbsp;bilgisini tutan listelere de sahip olabilir. Hatta i&amp;ccedil; i&amp;ccedil;e ge&amp;ccedil;en veri k&amp;uuml;meleri de kullanılabilir. Bu tip bir nesnel oluşum aynı ortamda &amp;ccedil;alışılırken &amp;ccedil;ok soru işaretine neden olmasa da, veriyi servis olarak sunduğumuzda ya da&amp;nbsp;X platformunun kullanımına a&amp;ccedil;tığımızda şartlara uygun bir serileştirme modeli gerekir.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok yaygın olarak kullanılan XML, insan&lt;em&gt;(aslında programcı diyelim)&lt;/em&gt; g&amp;ouml;z&amp;uuml;yle kolayca okunabilecek veri yapılarının inşa edilebilmesine olanak sağlar. Asıl ortam i&amp;ccedil;erisindeki veri tipine ait canlı &amp;ouml;rnekler kolayca XML'e d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lebilir ve herhangibir platform tarafından kolaylıkla değerlendirilebilir. Ancak XML veri boyutunu arttıran bir yapıya sahiptir.&lt;/p&gt;
&lt;p&gt;Microsoft .Net platformunda geliştirme yapıyor ve hatta sadece .Net tabanlı uygulamaların haberleştiği bir d&amp;uuml;nyada yaşıyorsak ideal se&amp;ccedil;im Binary formatta serileştirme yapmak olabilir. Binary serileştrime XML'e nazaran daha az yer tutuyor olsa da az &amp;ouml;nce belirttiğimiz &amp;uuml;zere bu model kullanıldığında platform bağımsızlık avantajı kaybedilmektedir. Diğer yandan elimizde XML'den daha az yer tutan, programcı a&amp;ccedil;ısından yine okunabilir nitelikte olan JSON&lt;em&gt;(JavaScript Object Notation)&lt;/em&gt; formatı da vardır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Aslında veriyi basit string formatında da serileştirebiliriz. Veriye ait t&amp;uuml;m i&amp;ccedil;eriğin ardışıl olarak yazılması ile bu m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Lakin okunması &amp;ccedil;ok zahmetli olacağı gibi şema yapısının&lt;em&gt;(ka&amp;ccedil;ıncı kolondan ka&amp;ccedil;ıncıya kadar hangi alandır bilgisi gibi)&lt;/em&gt; da taraflara &amp;ouml;ğretilmesi gerekir. Mainframe'lerden &amp;ccedil;ekilen metinsel verilerin bu tip formatlama teknikleri ile sunulduğu hizmetler halen daha vardır ancak g&amp;uuml;n&amp;uuml;n&amp;uuml;m&amp;uuml;z modern teknolojileri i&amp;ccedil;in XML, JSON, ProtoBuf gibi modeller ele alınmaktadır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;B&amp;uuml;t&amp;uuml;n bunlar bir yana uzun s&amp;uuml;redir piyasada olan ve deneyimini hi&amp;ccedil;bir şekilde inkar edemeyeceğimiz Google tarafından geliştirilmiş bir serileştirme modeli daha var; Protobuf nam-ı diğer Protocol Buffers. Bu model, Google'ın kendi uygulamalarındaki sistemler arasında veri değiş tokuş işlemleri i&amp;ccedil;in ele aldığı bir serileştirme standardı. Var olan serileştirme tiplerine nazaran daha hızlı ve daha az yer tuttuğu ifade ediliyor. Binary formatlamayı kullanan protokol a&amp;ccedil;ık kaynak olarak sunulmakta. Yazının hazırlandığı tarih itibariyle C++, C#, GO, Java, Python, Javascript gibi diller tarafından da destekleniyor&amp;nbsp;&lt;em&gt;(&lt;a href="https://developers.google.com/protocol-buffers/" target="_blank"&gt;Bu adresten&lt;/a&gt; protokol ile ilgili olarak daha detaylı bilgiye ulaşabilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu yazımızdaki amacımız ProtoBuf'ın nasıl kullanılabileceğini incelemek. Tasarlayacağımız basit bir veri yapısını, ProtoBuf standartlarında derleyecek ve GO dili ile yazılmış &amp;ouml;rnek bir kod par&amp;ccedil;asında denemeye &amp;ccedil;alışacağız. &amp;Ouml;nce sistemde gerekli hazırlıkları yapalım.&lt;/p&gt;
&lt;h1&gt;Hazırlıklar&lt;/h1&gt;
&lt;p&gt;İlk olarak sistemimize ProtoBuf derleyicisinin y&amp;uuml;klenmesi gerekiyor. Bunun i&amp;ccedil;in &lt;a href="https://github.com/google/protobuf/releases/tag/v3.3.0" target="_blank"&gt;şu adresten&lt;/a&gt; g&amp;uuml;ncel s&amp;uuml;r&amp;uuml;m&amp;uuml; y&amp;uuml;kleyerek ilerleyebiliriz. Ben Windows platformu i&amp;ccedil;in 32bitlik olan sıkıştırılmış i&amp;ccedil;eriği indirdim. İ&amp;ccedil;erisinde GO ile yazılıp derlenmiş protoc.exe isimli bir uygulama geldi. Bunu kullanarak proto uzantılı dosyaların derlenmesini sağlayacağız. &amp;nbsp;Bu yazımızdaki &amp;ouml;rneğimizi de GO dilini kullanarak geliştireceğiz. Bize GO&amp;nbsp;tarafı i&amp;ccedil;in işlemlerimizi kolaylaştıracak bir de paket lazım.&amp;nbsp;Bu paketi github'dan aşağıdaki komut satırı ile y&amp;uuml;kleyebiliriz.&lt;/p&gt;
&lt;p&gt;go get -u github.com/golang/protobuf/protoc-gen-go&lt;/p&gt;
&lt;p&gt;Bu arada sistemde Go ortamının kurulu olması gerektiğini de hatırlatalım.&lt;/p&gt;
&lt;h1&gt;.proto Dosyasının Hazırlanması&lt;/h1&gt;
&lt;p&gt;&amp;Ouml;ncelikle ProtoBuf ile kullanılacak verilerin şematik olarak inşa edilmesi gerekir. Bir başka deyişle veri yapısı tasarlanmalıdır. Sonrasında tasarlanan veri yapısı bir &amp;uuml;retim&amp;nbsp;işleminden ge&amp;ccedil;irilir. &amp;Uuml;retilen sınıfa verinin GO ile ifade edilmesini sağlayacak okuma operasyonları&lt;em&gt;(getter, setter metodları)&lt;/em&gt; ve tip tanımlamaları otomatik olarak eklenir. &amp;Uuml;retim işlemine ge&amp;ccedil;meden &amp;ouml;nce aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını yazarak işlemlerimize devam edelim.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;syntax="proto3";
package Southwind;

enum PlayerType{
	SEMI=0;
	PRO=1;
	MASTER=2;
}
	
message Player{
	string nickName=1;
	int32 playerId=2;
	PlayerType type=3;
	
	message Weapon{
		string name=4;
		string ability=5;
	}
	
	repeated Weapon weapons=6;
}

message Game{
	repeated Player player=1;
}&lt;/pre&gt;
&lt;p&gt;Proto i&amp;ccedil;eriği aslında JSON formatında yazılmış ve belirli kurallara sahip olan bir yapıda tasarlanır. İlk satırda hangi ProtoBuf versiyonunun kullanılacağı ifade edilmektedir&lt;em&gt;(&amp;Ouml;rneğimizde 3.0 s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; ele almaktayız)&lt;/em&gt; İ&amp;ccedil;erik mutlaka bir paket adıyla tanımlanmalıdır&lt;em&gt;(Southwind gibi)&lt;/em&gt; Veri tipleri birer message olarak ifade edilirler. &amp;Ouml;rnekte 3 mesaj ve bir enum sabiti yer almakta. Weapon, Player tipi, Player tipi de Game tipi i&amp;ccedil;erisinde kullanılmaktadır. Dikkat edilmesi gereken nokta Weapon tipinin Player i&amp;ccedil;erisinde dahili tip olarak tasarlanmış olmasıdır. PlayerType bir enum sabitidi&lt;em&gt;r(Evet yanlış g&amp;ouml;rmediniz. Hani .Net servislerinde platform bağımsızlık adına kullanılmasını pek de &amp;ouml;nermediğimiz Enum sabiti kavramı burada yer almakta. İlgin&amp;ccedil; değil mi? Aslında &amp;uuml;retim işlemi sonrası o da GO'nun anlayacağı hale getirilecek)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Mesajlar i&amp;ccedil;erisinde yer alan alanlara bir takım sayısal değerler atandığı g&amp;ouml;r&amp;uuml;lmektedir. Bunlar serileştirme sonrası &amp;uuml;retilecek i&amp;ccedil;erikte ilgili alanların Unique olmalarını sağlayacak tanımlayıcılardır. repeated ile yazılmış ifadeler ilgili tiplerin birden fazla sayıda tekrar edileceğini belirtilir. Aynı ağa&amp;ccedil; i&amp;ccedil;erisinde olmadığı s&amp;uuml;rece benzer id değerleri kullanılabilir. &amp;Ouml;rnek tasarımda string, int32 gibi veri tiplerine yer verilmiştir. Ancak daha pek &amp;ccedil;ok veri tipi vardır&lt;em&gt;(int64, double, float, bool vb)&lt;/em&gt; Detaylı bilgi i&amp;ccedil;in &lt;a href="https://developers.google.com/protocol-buffers/docs/proto3" target="_blank"&gt;şu adrese&lt;/a&gt; bakabilirsiniz. Şimdi proto dosyasını derleyelim.&lt;/p&gt;
&lt;h1&gt;Derleme/&amp;Uuml;retim&lt;/h1&gt;
&lt;p&gt;Yazılan Proto dosyasının kullanılması i&amp;ccedil;in bir &amp;uuml;retim adımından ge&amp;ccedil;irilmesi&amp;nbsp;gerekmektedir. protoc aracını kullanarak yukarıda oluşturduğumuz dosyayı derleyebiliriz. Aynen aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/goproto_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Derleme sonrasında Southwind.pd.go isimli bir dosya oluşacaktır. Bu dosyanın i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;// Code generated by protoc-gen-go. DO NOT EDIT.
// source: Southwind.proto

/*
Package Southwind is a generated protocol buffer package.

It is generated from these files:
	Southwind.proto

It has these top-level messages:
	Player
	Game
*/
package Southwind

import proto "github.com/golang/protobuf/proto"
import fmt "fmt"
import math "math"

// Reference imports to suppress errors if they are not otherwise used.
var _ = proto.Marshal
var _ = fmt.Errorf
var _ = math.Inf

// This is a compile-time assertion to ensure that this generated file
// is compatible with the proto package it is being compiled against.
// A compilation error at this line likely means your copy of the
// proto package needs to be updated.
const _ = proto.ProtoPackageIsVersion2 // please upgrade the proto package

type PlayerType int32

const (
	PlayerType_SEMI   PlayerType = 0
	PlayerType_PRO    PlayerType = 1
	PlayerType_MASTER PlayerType = 2
)

var PlayerType_name = map[int32]string{
	0: "SEMI",
	1: "PRO",
	2: "MASTER",
}
var PlayerType_value = map[string]int32{
	"SEMI":   0,
	"PRO":    1,
	"MASTER": 2,
}

func (x PlayerType) String() string {
	return proto.EnumName(PlayerType_name, int32(x))
}
func (PlayerType) EnumDescriptor() ([]byte, []int) { return fileDescriptor0, []int{0} }

type Player struct {
	NickName string           `protobuf:"bytes,1,opt,name=nickName" json:"nickName,omitempty"`
	PlayerId int32            `protobuf:"varint,2,opt,name=playerId" json:"playerId,omitempty"`
	Type     PlayerType       `protobuf:"varint,3,opt,name=type,enum=Southwind.PlayerType" json:"type,omitempty"`
	Weapons  []*Player_Weapon `protobuf:"bytes,6,rep,name=weapons" json:"weapons,omitempty"`
}

func (m *Player) Reset()                    { *m = Player{} }
func (m *Player) String() string            { return proto.CompactTextString(m) }
func (*Player) ProtoMessage()               {}
func (*Player) Descriptor() ([]byte, []int) { return fileDescriptor0, []int{0} }

func (m *Player) GetNickName() string {
	if m != nil {
		return m.NickName
	}
	return ""
}

func (m *Player) GetPlayerId() int32 {
	if m != nil {
		return m.PlayerId
	}
	return 0
}

func (m *Player) GetType() PlayerType {
	if m != nil {
		return m.Type
	}
	return PlayerType_SEMI
}

func (m *Player) GetWeapons() []*Player_Weapon {
	if m != nil {
		return m.Weapons
	}
	return nil
}

type Player_Weapon struct {
	Name    string `protobuf:"bytes,4,opt,name=name" json:"name,omitempty"`
	Ability string `protobuf:"bytes,5,opt,name=ability" json:"ability,omitempty"`
}

func (m *Player_Weapon) Reset()                    { *m = Player_Weapon{} }
func (m *Player_Weapon) String() string            { return proto.CompactTextString(m) }
func (*Player_Weapon) ProtoMessage()               {}
func (*Player_Weapon) Descriptor() ([]byte, []int) { return fileDescriptor0, []int{0, 0} }

func (m *Player_Weapon) GetName() string {
	if m != nil {
		return m.Name
	}
	return ""
}

func (m *Player_Weapon) GetAbility() string {
	if m != nil {
		return m.Ability
	}
	return ""
}

type Game struct {
	Player []*Player `protobuf:"bytes,1,rep,name=player" json:"player,omitempty"`
}

func (m *Game) Reset()                    { *m = Game{} }
func (m *Game) String() string            { return proto.CompactTextString(m) }
func (*Game) ProtoMessage()               {}
func (*Game) Descriptor() ([]byte, []int) { return fileDescriptor0, []int{1} }

func (m *Game) GetPlayer() []*Player {
	if m != nil {
		return m.Player
	}
	return nil
}

func init() {
	proto.RegisterType((*Player)(nil), "Southwind.Player")
	proto.RegisterType((*Player_Weapon)(nil), "Southwind.Player.Weapon")
	proto.RegisterType((*Game)(nil), "Southwind.Game")
	proto.RegisterEnum("Southwind.PlayerType", PlayerType_name, PlayerType_value)
}

func init() { proto.RegisterFile("Southwind.proto", fileDescriptor0) }

var fileDescriptor0 = []byte{
	// 246 bytes of a gzipped FileDescriptorProto
	0x1f, 0x8b, 0x08, 0x00, 0x00, 0x00, 0x00, 0x00, 0x02, 0xff, 0x64, 0x90, 0x41, 0x4b, 0xc3, 0x30,
	0x1c, 0xc5, 0xcd, 0x9a, 0xa5, 0xdb, 0x13, 0xb4, 0xfe, 0x41, 0x08, 0x3b, 0x95, 0x9d, 0x3a, 0x85,
	0x82, 0x15, 0xbc, 0x7b, 0x18, 0xb2, 0xc3, 0x74, 0xa4, 0x03, 0xcf, 0x9d, 0x0b, 0x58, 0x9c, 0x6d,
	0x98, 0x95, 0xd1, 0x4f, 0xea, 0xd7, 0x91, 0xfe, 0xbb, 0x75, 0x87, 0xde, 0xf2, 0x5e, 0x7e, 0xe4,
	0xfd, 0x08, 0xae, 0xd3, 0xf2, 0xb7, 0xfa, 0x3c, 0xe4, 0xc5, 0x36, 0x76, 0xfb, 0xb2, 0x2a, 0x69,
	0xdc, 0x15, 0xd3, 0x3f, 0x01, 0xb5, 0xda, 0x65, 0xb5, 0xdd, 0xd3, 0x04, 0xa3, 0x22, 0xff, 0xf8,
	0x7a, 0xcd, 0xbe, 0xad, 0x16, 0xa1, 0x88, 0xc6, 0xa6, 0xcb, 0xcd, 0x9d, 0x63, 0x6a, 0xb1, 0xd5,
	0x83, 0x50, 0x44, 0x43, 0xd3, 0x65, 0x9a, 0x41, 0x56, 0xb5, 0xb3, 0xda, 0x0b, 0x45, 0x74, 0x95,
	0xdc, 0xc6, 0xe7, 0xb5, 0xf6, 0xe1, 0x75, 0xed, 0xac, 0x61, 0x84, 0x12, 0xf8, 0x07, 0x9b, 0xb9,
	0xb2, 0xf8, 0xd1, 0x2a, 0xf4, 0xa2, 0xcb, 0x44, 0xf7, 0xe8, 0xf8, 0x9d, 0x01, 0x73, 0x02, 0x27,
	0x4f, 0x50, 0x6d, 0x45, 0x04, 0x59, 0x34, 0x72, 0x92, 0xe5, 0xf8, 0x4c, 0x1a, 0x7e, 0xb6, 0xc9,
	0x77, 0x79, 0x55, 0xeb, 0x21, 0xd7, 0xa7, 0x38, 0x7d, 0x80, 0x7c, 0x69, 0x88, 0x19, 0x54, 0xab,
	0xaa, 0x05, 0x4f, 0xde, 0xf4, 0x26, 0xcd, 0x11, 0xb8, 0xbb, 0x07, 0xce, 0xca, 0x34, 0x82, 0x4c,
	0xe7, 0xcb, 0x45, 0x70, 0x41, 0x3e, 0xbc, 0x95, 0x79, 0x0b, 0x04, 0x01, 0x6a, 0xf9, 0x9c, 0xae,
	0xe7, 0x26, 0x18, 0x6c, 0x14, 0xff, 0xe5, 0xe3, 0x7f, 0x00, 0x00, 0x00, 0xff, 0xff, 0x7c, 0x25,
	0x4e, 0xe1, 0x5e, 0x01, 0x00, 0x00,
}&lt;/pre&gt;
&lt;p&gt;Aslında kod okunmaya ve yorumlanmaya değer. &lt;em&gt;(Bir GO paketi s&amp;ouml;z konusu ve bu tip kodları okuyup anlamaya &amp;ccedil;alışmak GO &amp;ouml;ğrenenler i&amp;ccedil;in &amp;ouml;nemli bir mevzu)&lt;/em&gt; Yazılan proto uzantılı dosyadaki tanımlamalara g&amp;ouml;re bir &amp;uuml;retim ger&amp;ccedil;ekleştirilmiştir. Yorum satırlarında dosyanın neyle &amp;uuml;retildiği, değiştirilmemesi gerektiği, hangi mesajları sunduğu gibi bilgiler belirtilir. proto, fmt ve math gibi GO paketlerini kullanır. PlayerType ismiyle tanımlanan enum sabitinin koda bir değişmez&lt;em&gt;(Constant)&lt;/em&gt; olarak aktarıldığında dikkat edelim. Aslında GO i&amp;ccedil;in bu enum sabiti int32 tipinden bir değişkendir. Bununla birlikte enum sabitinin i&amp;ccedil;eriğine isimle&lt;em&gt;(name)&lt;/em&gt; veya değerle&lt;em&gt;(value)&lt;/em&gt; ulaşabilmek i&amp;ccedil;in bir map değişkeni&lt;em&gt;(PlayerType_name,PlayerType_value)&lt;/em&gt; tanımlandığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r. Kodda enum sabiti olmak &amp;uuml;zere diğer mesajlar i&amp;ccedil;in metodlar yazıldığına da dikkat edelim. Player ve Game birer yapı&lt;em&gt;(struct)&lt;/em&gt; olarak oluşturulmuşlardır. Alanların değerlerini okumak i&amp;ccedil;in Get kelimesi ile başlayan metodlar vardır. Oyuncunun sahip olabileceği silahlar i&amp;ccedil;in Player tipinden bir slice değişkeni yer almaktadır. Oyun sahasındaki oyuncular i&amp;ccedil;in de benzer şekilde Game yapısı i&amp;ccedil;inde Player tipinden bir slice değişkenini işaret eden pointer'a yer verilmiştir. Bu bir GO uygulamasına ilave edilerek kullanılacak bir paket olduğundan pek tabii main fonksiyonu i&amp;ccedil;ermez. Ancak başlangı&amp;ccedil;ta ilgili mesaj tiplerinin proto katmanına enjekte edilmesi i&amp;ccedil;in bir takım fonksiyon &amp;ccedil;ağrıları ger&amp;ccedil;ekleşir.&lt;/p&gt;
&lt;h1&gt;Ana Uygulama&lt;/h1&gt;
&lt;p&gt;Gelelim bu i&amp;ccedil;eriği uygulamada nasıl kullanabileceğimize. &amp;Ouml;ncelikle oluşan Southwind.pb.go dosyasını paket olarak konuşlandırmamız lazım. Sistemdeki GOPATH bildirimine g&amp;ouml;re uygun bir klas&amp;ouml;r i&amp;ccedil;erisine atabiliriz. Ben GOPATH'in işaret ettiği src klas&amp;ouml;r&amp;uuml;nde aşağıdaki gibi bir yapılandırma oluşturdum. Southwind.pd.go dosyasının Southwind isimli bir klas&amp;ouml;rde olması m&amp;uuml;him. Aksi halde kod ilgili paketin yerini bulamayacaktır.&lt;/p&gt;
&lt;p&gt;C-&amp;gt;Go Works&lt;br /&gt;----Samples&lt;br /&gt;--------------Src&lt;br /&gt;------------------Message&lt;br /&gt;----------------------------Southwind&lt;br /&gt;----------------------------------------Southwind.pb.go&lt;/p&gt;
&lt;p&gt;Şimdi istediğimi lokasyondan bu paketi kullanabiliriz. İşte &amp;ouml;rnek bir kod par&amp;ccedil;ası.&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"

	data "message/Southwind"

	"github.com/golang/protobuf/proto"
)

func main() {
	taverna := data.Game{Player: []*data.Player{
		{
			NickName: "Leksar",
			PlayerId: 10,
			Type:     data.PlayerType_SEMI,
			Weapons: []*data.Player_Weapon{
				{Name: "Sword", Ability: "High level sword"},
				{Name: "Machine Gun", Ability: "7.65mm"},
			},
		},
		{
			NickName: "Valira",
			PlayerId: 12,
			Type:     data.PlayerType_SEMI,
			Weapons: []*data.Player_Weapon{
				{Name: "Poison Bottle", Ability: "Dangeres green"},
			},
		},
	},
	}
	sData, err := proto.Marshal(&amp;amp;taverna)
	if err != nil {
		fmt.Println(err.Error())
	} else {
		fmt.Println(sData)
		fmt.Println(string(sData))
	}

	dsData := &amp;amp;data.Game{}
	err = proto.Unmarshal(sData, dsData)
	if err != nil {
		fmt.Println(err.Error())
	} else {
		for _, p := range dsData.Player {
			fmt.Println(p.NickName)
			for _, w := range p.Weapons {
				fmt.Printf("\t%s\t%s\n", w.Name, w.Ability)
			}
		}
	}
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncelikle kodda neler yaptığımız bir bakalım. ProtoBuf formatında serileştirme ve ters serileştirme işlemleri i&amp;ccedil;in&amp;nbsp;github.com/golang/protobuf/proto paketinde yer alan proto tipinin Marshal ve Unmarshal metodlarından yararlanılıyor. taverna isimli değişken i&amp;ccedil;erisinde iki oyuncu ve bu oyuncuların silahlarına ait test verileri yer almakta. Marshal metodu ile serileştirilen i&amp;ccedil;eriği hem byte array hem de string tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lm&amp;uuml;ş olarak ekrana bastırmaktayız. Sonrasında da serileştirilmiş bu veri i&amp;ccedil;eriğinden yeni bir Game &amp;ouml;rneğine ters serileştirme yaparak elde edilen verileri yazdırmaktayız. &amp;Ccedil;alışma zamanı sonu&amp;ccedil;ları aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/06/goproto_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabii ki serileştirilen i&amp;ccedil;erik fiziki bir dosyaya &amp;ccedil;ıkılabilir veya ağ &amp;uuml;zerinden bir kanala yazdırılabilir. Daha az yer kapladığı ortada. Yine de ger&amp;ccedil;ek benchmark testleri ve farklı serileştirme formatları ile karşılaştırılması i&amp;ccedil;in interneti dolaşmakta yarar var. &amp;Uuml;retilen serileştirilmiş i&amp;ccedil;eriğe bakıldığında ise sadece verinin tutulduğu g&amp;ouml;r&amp;uuml;lmektedir. Tahmin edeceğiniz &amp;uuml;zere verinin şeması paket olarak eklediğimiz Southwind.pd.go i&amp;ccedil;erisinde yer alıyor. Dolayısıyla Marshal ve Unmarsal işlemlerinde bu paketten yararlanılmakta.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir GoLang maceramızın daha sonuna. Bu yazımızda Google'ın geliştirdiği serileştirme protokol&amp;uuml; Proto Buffer'ın bir Go uygulamasında nasıl kullanılabileceğini incelemeye &amp;ccedil;alıştık. Size tavsiyem diğer dil paketlerini de işin i&amp;ccedil;ine katarak geliştirme yapmaya &amp;ccedil;alışmanız olacaktır. Bir başka yazımızda g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-07-22 21:03:00</pubDate>
  <slug>golang-google-protobuf-kullanimi</slug>
  <tags>
    <tag>golang</tag>
    <tag>go-programming-language</tag>
    <tag>google-proto-buffers</tag>
    <tag>protobuf</tag>
    <tag>xml</tag>
    <tag>json</tag>
    <tag>serialization</tag>
    <tag>binary-serialization</tag>
  </tags>
  <categories>
    <category>GoLang</category>
  </categories>
</post>