<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Matematik ve Oyun Programlama - Missile Command - Bölüm 1</title>
  <description>Uzun bir süredir Rust programlama dili ile hobi amaçlı uğraşıyorum. Son birkaç aydırda Rust tarafında kullanılan oyun motorlarını kurcalamaktayım. Ancak birkaç haftadır amacım oyun programlamada kullanılan temel matematik enstrümanları öğrenmek. Bana göre bu alanda ilerleyebilmemin en iyi yolu bilinen oyunların birer klonunu yazmaya çalışmak. Onca vektör, açı, nokta çarpım problemini işledikten sonra ilk gözüme kestirdiğim zamanın efsane Atari oyunlarından olan Missile Command. Kaynaklara göre seksenli yılların en kült oyunlarından birisi olarak karşımıza çıkıyor. Oyunda ekranın üst kısmında rastgele açılarda ve sayıda füzenin üssümüze inişine şahit oluyoruz. Oyuncu üssün tam orta yerinde duran füze rampasında ateş ederek şehre inen füzeleri patlatmaya çalışıyor. Görüntü tamamen piksel hareketlerinden oluşmakta ve benim asıl ilgilendiğim oyunun arkasındaki olası matematik hesaplamalar.</description>
  <content>&lt;p&gt;Uzun bir s&amp;uuml;redir Rust programlama dili ile hobi ama&amp;ccedil;lı uğraşıyorum. Son birka&amp;ccedil; aydırda Rust tarafında kullanılan oyun motorlarını kurcalamaktayım. Ancak birka&amp;ccedil; haftadır amacım oyun programlamada kullanılan temel matematik enstr&amp;uuml;manları &amp;ouml;ğrenmek. Bana g&amp;ouml;re bu alanda ilerleyebilmemin en iyi yolu bilinen oyunların birer klonunu yazmaya &amp;ccedil;alışmak. Onca vekt&amp;ouml;r, a&amp;ccedil;ı, nokta &amp;ccedil;arpım problemini işledikten sonra ise ilk g&amp;ouml;z&amp;uuml;me kestirdiğim zamanın efsane Atari oyunlarından olan&lt;a title="Missile Command Atari Game" href="https://en.wikipedia.org/wiki/Missile_Command" target="_blank"&gt; Missile Command&lt;/a&gt;.&lt;/p&gt;
&lt;p&gt;Kaynaklara g&amp;ouml;re seksenli yılların en k&amp;uuml;lt oyunlarından birisi olarak ifade ediliyor. Oyunda ekranın &amp;uuml;st kısmından rastgele a&amp;ccedil;ılarda şehre doğru inen f&amp;uuml;zeleri g&amp;ouml;r&amp;uuml;yoruz. Oyuncu, &amp;uuml;ss&amp;uuml;n tam orta yerinde duran f&amp;uuml;ze rampasından ateş ederek şehre inen f&amp;uuml;zeleri &amp;ouml;nlemeye &amp;ccedil;alışıyor. Ka&amp;ccedil;an f&amp;uuml;zeler şehre d&amp;uuml;ş&amp;uuml;nce de hasar veriyor. F&amp;uuml;zelerden kurtulduk&amp;ccedil;a farklı seviyelere ge&amp;ccedil;iş yapıyorsunuz. G&amp;ouml;r&amp;uuml;nt&amp;uuml; tamamen piksel hareketlerinden oluşmakta ve benim asıl ilgilendiğim oyunun arkasındaki matematik hesaplamalar.&lt;/p&gt;
&lt;p&gt;İlk etapta ekranın &amp;uuml;st tarafındaki rastgele konumlardan, belli gecikmelerle(bazen de aynı anda) farklı ya da sabit a&amp;ccedil;ılarda hareket eden f&amp;uuml;zelerin nasıl olup da bu şekilde ilerlediğini keşfetmek istiyorum. Ekranın genişliğini d&amp;uuml;ş&amp;uuml;nerek x ekseni &amp;uuml;st&amp;uuml;nde rastgele konumlar &amp;uuml;retmek olduk&amp;ccedil;a kolay esasında. Peki a&amp;ccedil;ıyı nasıl ayarlayacağız? Hatta a&amp;ccedil;ıyı &amp;ouml;yle bir belirlemeliyiz ki f&amp;uuml;zeler ekranın solundan veya sağından dışarıya &amp;ccedil;ıkmasınlar. F&amp;uuml;zeleri hallettikten sonra pek tabii oyuncunun da ekran &amp;uuml;zerinde mouse ile tıkladığı noktalara yine belli bir a&amp;ccedil;ıda ve hızda ateş etmemiz gerekiyor. Konuyu araştırırken vekt&amp;ouml;rler arasındaki a&amp;ccedil;ı hesaplamasından yararlanabileceğimi anladım. Tabii aynı sonuca ulaşmak i&amp;ccedil;in farklı matematik y&amp;ouml;ntemler de kullanılabilir pekala. Bunlar yoruma a&amp;ccedil;ık ve sizlerin desteği ile hep birlikte daha da iyi &amp;ouml;ğrenebiliriz.&lt;/p&gt;
&lt;p&gt;Konu ile ilgili &amp;ouml;rneği Rust programlama dilini kullanarak geliştiriyorum. &lt;a href="https://github.com/buraksenyurt/game-dev-with-rust/tree/main/missile-commander" target="_blank"&gt;Github hesabımdan ilgili kaynak kodlara ulaşabilirsiniz&lt;/a&gt;. Oyun motoru olarak hafifsiklet olanlardan &lt;a title="Macroquad game engine" href="https://macroquad.rs/examples/" target="_blank"&gt;Macroquad&lt;/a&gt;'ı tercih ettim.&amp;nbsp;&amp;Ouml;rneği iki b&amp;ouml;l&amp;uuml;m halinde incelemeyi planlıyorum ve işte ilki. Keyifli seyirler.&lt;/p&gt;
&lt;p&gt;&lt;iframe title="YouTube video player" src="https://www.youtube.com/embed/I5AonLlBizo" width="560" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;İkinci b&amp;ouml;l&amp;uuml;mde savunma sistemini ve mouse ile tıklanan yere ateş etmeyi ele almaya &amp;ccedil;alışacağım. Tabii buna patlama efektini de eklemem gerekiyor. İ&amp;ccedil;erden dışa doğru &amp;ccedil;apı genişleyen ve sonra ortadan kaybolan bir &amp;ccedil;ember pekala işimi g&amp;ouml;rebilir. Bakalım yol boyunca nelerle karşılaşacağım (karşılaşacağız). Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2022-11-18 17:00:00</pubDate>
  <slug>matematik-ve-oyun-programlama-missile-command-bolum-1</slug>
  <tags>
    <tag>rust</tag>
    <tag>rust-programming-language</tag>
    <tag>matematik</tag>
    <tag>oyun-matematiği</tag>
    <tag>oyun-programlama</tag>
    <tag>vektörler</tag>
    <tag>açılar</tag>
    <tag>macroquad</tag>
  </tags>
  <categories>
    <category>Rust</category>
  </categories>
</post>