<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Rust Pratikleri - Trait Objects</title>
  <description>Bir Windows Forms uygulaması düşünelim ya da bir web sayfası. Hatta birden fazla bileşenden (component) oluşan bir mobil uygulama arayüzünü...Temelde ana kontrol üstüne eklenen başka tekil ve karma kontrollerden oluşan bir bütün söz konusudur. Şimdi de ana saha üzerine gelen bu kontrollerin nasıl çizilebildiğini düşünelim. Bir motor büyük ihtimalle belli ortak davranışlara sahip olan bileşenleri, ortamın istediği kıvamda (örneğin HTML olarak) çizme görevini üstlenir. Hatta bu sistemlerde bileşen ağacı öyle bir tasarlanır ki, geliştiriciler isterlerse kendi bileşenleri de tasarlayıp çalışma zamanı motorunun kullanımına sunabilir.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2022/Mayis/doc_builder_0.png" alt="" /&gt;Bir windows forms uygulamasını ya da bir web sayfasını d&amp;uuml;ş&amp;uuml;nelim. Hatta birden fazla bileşenden&lt;em&gt;(component)&lt;/em&gt; oluşan bir mobil uygulama aray&amp;uuml;z&amp;uuml;n&amp;uuml;...Temelde ana kontrol &amp;uuml;st&amp;uuml;ne eklenen başka tekil ve karma bileşenlerden oluşan bir b&amp;uuml;t&amp;uuml;n s&amp;ouml;z konusudur. Şimdi de ana saha &amp;uuml;zerine gelen bu kontrollerin nasıl &amp;ccedil;izildiğini, hangi sırayla eklendiklerini d&amp;uuml;ş&amp;uuml;nelim. Bir &amp;ccedil;alışma zamanı motoru b&amp;uuml;y&amp;uuml;k ihtimalle belli ortak davranışlara sahip olan bileşenleri, ortamın istediği kıvamda&lt;em&gt;(&amp;ouml;rneğin HTML olarak)&lt;/em&gt; &amp;ccedil;izme g&amp;ouml;revini &amp;uuml;stlenir. Hatta bu sistemlerde bileşen ağacı &amp;ouml;yle bir tasarlanır ki, geliştiriciler isterlerse kendi bileşenlerini de tasarlayıp &amp;ccedil;alışma zamanı motorunun kullanımına sunabilir.&lt;/p&gt;
&lt;p&gt;Nesne y&amp;ouml;nelimli dillerde bu tip kurgular i&amp;ccedil;in Interface tipi sıklıkla tercih edilir. Ana motor, belli interface şablonlarınca tanımlanan davranışları işletecek şekilde tasarlanır. Bileşenler bu interface şablonlarında belirtilen kuralları kendi d&amp;uuml;nyalarında yeniden yazar. &amp;Ccedil;alışma zamanı motoru &amp;ccedil;ok bi&amp;ccedil;imlilik esaslarını kullanarak bu davranışları kolayca&amp;nbsp;tatbik&amp;nbsp;eder. Rust tarafında bu ama&amp;ccedil;la trait nesneleri &amp;ouml;ne &amp;ccedil;ıkmaktadır. Bu pratikte&amp;nbsp;bir&amp;nbsp;fatura dok&amp;uuml;manı &amp;uuml;st&amp;uuml;ne eklenen par&amp;ccedil;ları trait nesnelerini kullanarak nasıl genişletebileceğimizi incelemeye &amp;ccedil;alışacağız. Tabii ger&amp;ccedil;ekten de bir fatura g&amp;ouml;rseli &amp;ccedil;izmeyeceğiz ama temel yapı taşlarını icra etmeye uğraşacağız.&lt;/p&gt;
&lt;p&gt;Normalde generic tip kullanarak ilerlemeyi de d&amp;uuml;ş&amp;uuml;nebiliriz lakin generic tip parametreler t anında sadece tek bir asıl tiple&lt;em&gt;(concrete type)&lt;/em&gt; ile &amp;ccedil;alışabilir. Bu nedenle Trait nesneler kullanılır. Nitekim trait nesneler ile birden fazla asıl tipin &amp;ccedil;alışma zamanında dinamik olarak bağlanabilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r&lt;em&gt;(ki buna Dynamic Dispatch denilir)&lt;/em&gt;&amp;nbsp;Trait nesnelerini tanımlayabilmek i&amp;ccedil;in birka&amp;ccedil; se&amp;ccedil;enek vardır. Bunlar Box, &amp;amp;, Arc ve RC enstr&amp;uuml;manlarıdır ve Dynamic Dispatch y&amp;ouml;ntemini kullanmamıza izin verirler. Dilerseniz vakit kaybetmeden pratiğimize başlayalım. &amp;Ouml;rneğimizi doc_builder ismiyle oluşturabiliriz. Ben her zaman olduğu gibi kendi Ubuntu sistemimde ilerliyorum.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;cargo new doc_builder
cd doc_builder
touch src/lib.rs&lt;/pre&gt;
&lt;p&gt;Uygulamamıza ait ana kodları lib mod&amp;uuml;l&amp;uuml; i&amp;ccedil;erisinde geliştireceğiz. Sabırlı olun ve aşağıdaki kodları yazarak devam edin. Aralara serpiştirilen yorum satırları size yol g&amp;ouml;sterecektir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;use std::fmt::{Display, Formatter};

// Bir şeyi &amp;ccedil;izme davranışını tanımlayan yeni bir trait nesnesi eklendi.
// Tek bir fonksiyonu var uygulandığı nesne ne ise onu referans olarak alıyor
pub trait Draw {
    fn draw(&amp;amp;self);
}

// Bu veri yapısı fatura veya benzeri bir evrakı temsil eden modelimiz olsun.
// En &amp;ouml;nemli &amp;ouml;zelliği kendi &amp;uuml;st&amp;uuml;ndeki bileşenleri taşıdığı Sections koleksiyonu.
// &amp;Ccedil;alışma zamanında Draw trait'ini uygulayan asıl tipler belirsiz olacağından
// Dynamic Dispatch yaklaşımına ge&amp;ccedil;ildi.
pub struct Document {
    pub sections: Vec&amp;lt;Box&amp;lt;dyn Draw&amp;gt;&amp;gt;,
}

impl Document {
    // sections i&amp;ccedil;eriğine veri ekleme işini add fonksiyonuna verdik
    pub fn add(&amp;amp;mut self, section: Box&amp;lt;dyn Draw&amp;gt;) {
        self.sections.push(section)
    }
    // print fonksiyonu belgenin sections kısmındaki t&amp;uuml;m nesneleri dolaşacak
    // ve her birinin Draw fonksiyonunu &amp;ccedil;ağıracak.
    pub fn print(&amp;amp;self) {
        self.sections.iter().for_each(|m| m.draw())
    }
}

// Şimdi Draw işlevini uygulayan birka&amp;ccedil; veri yapısı ekleyelim.
// &amp;Ouml;rneğin dok&amp;uuml;manın başlık kısmı i&amp;ccedil;in Title isimli bir veri yapısı olabilir.
pub struct Title {
    pub text: String,
    pub sub_text: String,
}

impl Title {
    pub fn new(text: String, sub_text: String) -&amp;gt; Self {
        Self { text, sub_text }
    }
}

// Title i&amp;ccedil;in Draw davranışını modelliyoruz(Sembolik olarak elbette)
impl Draw for Title {
    fn draw(&amp;amp;self) {
        println!("*****");
        println!("{}", self.text);
        println!("{}", self.sub_text);
        println!("*****\n");
    }
}

// Dok&amp;uuml;manın alt kısmı i&amp;ccedil;in de Bottom isimli bir veri yapısı kurgulayalım
pub struct Bottom {
    pub summary: String,
}

impl Bottom {
    pub fn new(summary: String) -&amp;gt; Self {
        Self { summary }
    }
}

// Bottom veri yapısı i&amp;ccedil;inde Draw davranışını yazıyoruz
impl Draw for Bottom {
    fn draw(&amp;amp;self) {
        println!("\n------\n{}\n-------", self.summary.to_uppercase());
    }
}

// Dok&amp;uuml;mana eklenebilecek &amp;uuml;r&amp;uuml;n bilgilerini LineItems şeklinde bir veri yapısı olarak tutabiliriz.
// Faturanın orta kısımlarında alt alta kalemlerin yer aldığı, &amp;uuml;st&amp;uuml;nde &amp;uuml;r&amp;uuml;n adı, miktarı ve
// fiyatının olduğu bir grid d&amp;uuml;ş&amp;uuml;n&amp;uuml;n.
#[derive(Default)]
pub struct LineItems {
    items: Vec&amp;lt;Product&amp;gt;,
}

impl LineItems {
    pub fn add(&amp;amp;mut self, p: Product) {
        self.items.push(p)
    }
}

// ve şimdi de LineItems'a Draw davranışını &amp;ouml;ğretelim
impl Draw for LineItems {
    fn draw(&amp;amp;self) {
        self.items.iter().for_each(|p| {
            println!("{}", p);
        })
    }
}

// Fatura dok&amp;uuml;manında yer alabilecek &amp;uuml;r&amp;uuml;n bilgileri Product struct'ı ile temsil edilebilir.
pub struct Product {
    pub id: u32,
    pub title: String,
    pub list_price: f32,
    pub quantity: u16,
}
impl Product {
    pub fn new(id: u32, title: String, list_price: f32, quantity: u16) -&amp;gt; Self {
        Self {
            id,
            title,
            list_price,
            quantity,
        }
    }
}
impl Display for Product {
    fn fmt(&amp;amp;self, f: &amp;amp;mut Formatter&amp;lt;'_&amp;gt;) -&amp;gt; std::fmt::Result {
        write!(
            f,
            "{} | {} | {} | {}",
            self.id, self.title, self.quantity, self.list_price
        )
    }
}&lt;/pre&gt;
&lt;p&gt;Senaryomuzda bir fatura dok&amp;uuml;manı ele alınmakta. Faturanın başlığı, alt tarafı, faturaya dahil olan kalemler ayrı bileşenler olarak tutuluyorlar. Ancak trait nesneleri kullandığımız i&amp;ccedil;in draw davranışını uygulayabilen başka bileşenlerinde sisteme eklenmesi m&amp;uuml;mk&amp;uuml;n. Hatta bu k&amp;uuml;t&amp;uuml;phanenin kullanıcısı olanlar kolaylıkla dok&amp;uuml;mana yeni bileşenleri dahil edebilirler. Document veri yapısının add ve print fonksiyonları &amp;ccedil;alışma zamanında belli olan Draw isimli trait nesneleri ile &amp;ccedil;alıştığından bu genişleyebilirlik m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bir nevi plug-in d&amp;uuml;zeneğini de tesis etmiş olduğumuzu ifade edebiliriz. Elbette pek &amp;ccedil;ok denetim kuralını &amp;ouml;rneği karmaşıklaştırmamak adına g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almadık.&lt;/p&gt;
&lt;p&gt;Şimdi faturaya ait dok&amp;uuml;manı oluşturmak &amp;uuml;zere mod&amp;uuml;le eklediğimiz yapıları kullanmayı deneyelim. Bu ama&amp;ccedil;la main fonksiyonunu aşağıdaki gibi geliştirerek ilerleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;use doc_builder::{Bottom, Document, LineItems, Product, Title};

fn main() {
    // Bir Document nesnesi oluşturuyoruz
    let mut invoice = Document { sections: vec![] };
    // Dok&amp;uuml;mana eklenecek bir Title nesnesi &amp;ouml;rnekliyoruz.
    let title = Title::new(
        "Burağın Retro Bilgisayar D&amp;uuml;kkanı".to_string(),
        "Fatura. 11.03.2003".to_string(),
    );
    // Title'ı
    invoice.add(Box::new(title));

    let mouse = Product::new(1, "Locitek Kablolu Mouse".to_string(), 95.50, 1);
    let keyboard = Product::new(2, "Ey&amp;ccedil; Pi Q Klavye.".to_string(), 150.00, 1);
    let mut line_items = LineItems::default();
    line_items.add(mouse);
    line_items.add(keyboard);

    invoice.add(Box::new(line_items));

    let bottom = Bottom::new("İletişim numarası : 23 23 23".to_string());
    invoice.add(Box::new(bottom));

    invoice.print();
}&lt;/pre&gt;
&lt;p&gt;Clippy ile ne kadar ideomatic olduğumuza bir baktıktan sonra run komutu ile &amp;ouml;rneği &amp;ccedil;alıştırabiliriz. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer sonu&amp;ccedil;lar almamız gerekiyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Mayis/doc_builder_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekte smart pointer'lardan olan Box t&amp;uuml;r&amp;uuml;n&amp;uuml; kullanan trait nesnelerini ele aldık. Bu uygulama bi&amp;ccedil;imi ile dynamic dispatch olarak da adlandırılan konuya değinmiş oluyoruz. C# tarafından gelen birisi i&amp;ccedil;in generic t&amp;uuml;rlerin Rust tarafında da yer alması, aynı &amp;ouml;rnekte generic kullanımının işe yarayacağını d&amp;uuml;ş&amp;uuml;nd&amp;uuml;rebilir. En azından sahip olduğum bilgiye g&amp;ouml;re b&amp;ouml;yle olması gerektiğini &amp;ouml;ne s&amp;uuml;rebilirim. Anlatmak istediğim durumu i&amp;ccedil;in kod tarafında aşağıdaki değişiklikleri yaparak ilerleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;pub struct Document&amp;lt;T: Draw&amp;gt; {
    pub sections: Vec&amp;lt;Box&amp;lt;T&amp;gt;&amp;gt;,
}

impl&amp;lt;T&amp;gt; Document&amp;lt;T&amp;gt;
where
    T: Draw,
{
    pub fn add(&amp;amp;mut self, section: Box&amp;lt;T&amp;gt;) {
        self.sections.push(section)
    }
    pub fn print(&amp;amp;self) {
        self.sections.iter().for_each(|m| m.draw())
    }
}&lt;/pre&gt;
&lt;p&gt;Document tipinin Draw trait'ini uyarlayan T tipi ile &amp;ccedil;alışmasını istediğimiz belirttik. Her ne kadar bir smart pointer'dan yararlanmış olsak da bu kod derlenmeyecek ve aşağıdaki hata mesajını verecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Mayis/doc_builder_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu hata durumu IntelliJ Ide'si &amp;uuml;st&amp;uuml;nde de rahatlıkla g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Mayis/doc_builder_3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Fatura nesnesine ilk olarak title bileşeni eklenmiştir. Bu sebepten sonraki add operasyonlarında rust derleyicisi yine title t&amp;uuml;r&amp;uuml;nden nesnelerin eklenmesini beklemektedir. Nitekim rust dilinin bir diğer kuralına g&amp;ouml;re generic bir parametre t anında sadece tek bir ger&amp;ccedil;ek tiple&lt;em&gt;(concrete type)&lt;/em&gt; &amp;ccedil;alışabilir. Dolayısıyla LineItems ve Bottom nesne &amp;ouml;rneklerinin eklenmeye &amp;ccedil;alışması bu kuralın ihlali anlamına gelmiştir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Trait nesneleri olduk&amp;ccedil;a &amp;ouml;nemli bir konu ve ben bu &amp;ccedil;alışmada sadece ufak bir kısmını ele aldım. Sanıyorum ki Nesne y&amp;ouml;nelimli dil pratiklerini Rust tarafında uygulamaya &amp;ccedil;alışmak sanıldığı kadar kolay değil. B&amp;ouml;ylece geldik Rust Pratiklerinden bir b&amp;ouml;l&amp;uuml;m&amp;uuml;n daha sonuna. &amp;Ouml;rnek kodlara her zaman olduğu gibi &lt;a title="Trait Objects - Doc Builder" href="https://github.com/buraksenyurt/rust-farm/tree/main/Practices/doc_builder" target="_blank"&gt;github reposu&lt;/a&gt; &amp;uuml;zerinden erişebilirsiniz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2022-05-01 09:00:00</pubDate>
  <slug>rust-pratikleri-trait-objects</slug>
  <tags>
    <tag>rust</tag>
    <tag>rust-programming-language</tag>
    <tag>rust-pratikleri</tag>
    <tag>trait</tag>
    <tag>trait-objects</tag>
    <tag>dyn</tag>
    <tag>dynamic-dispatch</tag>
    <tag>plugin</tag>
    <tag>box</tag>
  </tags>
  <categories>
    <category>Rust</category>
  </categories>
</post>