<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net 2.0 ve Master Page Kavramı</title>
  <description>Bu makalemizde, Master Pages kavramına giriş yapacak ve web uygulamalarının geliştirmesinde yaşamımıza getirdiği kolaylıkları incelemeye çalışacağız. Internet sitelerini göz önüne aldığımızda, siteye ait sayfaların sıklıkla aynı şablonları kullandığını görürüz. Özellike, header, footer, navigasyon ve advertisement alanları, çoğunlukla siteye ait tüm sayfalarda aynı yerlerde kullanılır. Bu, siteye ait sayfaların standart olarak aynı görünümde olmasını sağlamakla kalmaz, değişen içeriğinde ortak bir şablon üzerinde durmasına imkan tanır. Peki Asp.Net 2.0' ın bu kullanım için getirdiği yaklaşıma gelene kadar, sayfalarda ortak olarak kullanılan ve tasarımsal olarak sayfa koordinatlarında aynı yerlerde yer alan bu unsurlar hangi teknikler ile oluşturulmuştur?</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bu makalemizde, Master Pages kavramına giriş yapacak ve web uygulamalarının geliştirmesinde yaşamımıza getirdiği kolaylıkları incelemeye &amp;ccedil;alışacağız. Internet sitelerini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda, siteye ait sayfaların sıklıkla aynı şablonları kullandığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. &amp;Ouml;zellike, header, footer, navigasyon ve advertisement alanları, &amp;ccedil;oğunlukla siteye ait t&amp;uuml;m sayfalarda aynı yerlerde kullanılır. Bu, siteye ait sayfaların standart olarak aynı g&amp;ouml;r&amp;uuml;n&amp;uuml;mde olmasını sağlamakla kalmaz, değişen i&amp;ccedil;eriğinde ortak bir şablon &amp;uuml;zerinde durmasına imkan tanır. Peki Asp.Net 2.0' ın bu kullanım i&amp;ccedil;in getirdiği yaklaşıma gelene kadar, sayfalarda ortak olarak kullanılan ve tasarımsal olarak sayfa koordinatlarında aynı yerlerde yer alan bu unsurlar hangi teknikler ile oluşturulmuştur?&lt;/p&gt;
&lt;p&gt;Html' in ilk zamanlarında, bu tarz işlemleri ger&amp;ccedil;ekleştirmek i&amp;ccedil;in, ortak olan alanlar kopyalanarak diğer sayfalara yapıştırılırdı. Yada, ana şablonu ihtiva eden bir sayfadan diğer sayfalar "save as" metodu ile oluşturulur ve i&amp;ccedil;erikleri değiştirilirdi. Bu tekniğin en b&amp;uuml;y&amp;uuml;k handikapı, şablondaki herhangibir değişikliğin diğer sayfalara yansıtılması sırasında ortaya &amp;ccedil;ıkmaktadır. Nitekim 100' lerce alt sayfaya aynı şablonu uygulamışsak bu ger&amp;ccedil;ekten b&amp;uuml;y&amp;uuml;k bir problemdir.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;&amp;ouml;z&amp;uuml;m Asp ile gelmiştir. Asp, include takılarını kullanarak, sayfalarda tekrar eden i&amp;ccedil;eriklerin kolayca kullanılabilmesini ve değişikliklerin t&amp;uuml;m sayfalarda g&amp;ouml;r&amp;uuml;nebilmesini sağlamıştır. Ancak elbetteki include takısınında bir takım sorunları vardır. Bunlardan birisi, tasarım zamanında include takısının işaret ettiği i&amp;ccedil;eriğin g&amp;ouml;r&amp;uuml;nememesidir. Dolayısıyla sayfanın b&amp;uuml;t&amp;uuml;n&amp;uuml;n nasıl g&amp;ouml;r&amp;uuml;nd&amp;uuml;ğ&amp;uuml;n&amp;uuml; inceleyebilmek i&amp;ccedil;in mutlaka &amp;ccedil;alıştırmak gerekmektedir. Diğer yandan, include tekniği takılar &amp;uuml;zerine kurulu olduğundan, &amp;ouml;zellikle a&amp;ccedil;ık unutulan takılar sayfalarda istenmeyen Html &amp;ccedil;ıktılarının oluşmasına yol a&amp;ccedil;maktadır.&lt;/p&gt;
&lt;p&gt;Asp.Net, bu tip ortak i&amp;ccedil;eriklerin kullanılmasına daha g&amp;uuml;&amp;ccedil;l&amp;uuml; ve etkin bir yaklaşımı getirmiştir. User Controls. Kullanıcı tanımlı kontroller, normal aspx i&amp;ccedil;eriğine sahip olabilmekte ve .net mimarisinin g&amp;uuml;&amp;ccedil;l&amp;uuml; &amp;ouml;zelliklerini kullanabilmektedir. Her ne kadar etkili bir teknik olsada, user control' ler i&amp;ccedil;inde tek bir sorun &amp;ouml;ne &amp;ccedil;ıkmaktadır. Tasarım zamanında, user control i&amp;ccedil;eriğinin g&amp;ouml;r&amp;uuml;lememesi.&lt;/p&gt;
&lt;p&gt;Asp.Net 2.0, Master Page yaklaşımı ile, yukarıda bahsedilen dezavantajları ortadan kaldırmayı başarmıştır. Bir Master Page, uygulandığı diğer aspx sayfalarının nasıl g&amp;ouml;r&amp;uuml;nmesi gerektiğine karar veren bir şablona gibidir. Ancak, sağladığı ContentPlaceHolder bileşeni sayesinde, Master Page' leri uygulayan diğer aspx sayfalarının, istenilen i&amp;ccedil;eriğe sahip olmasınıda sağlamaktadır. En g&amp;uuml;zel yanı ise, normal bir aspx sayfası gibi tasarlanabilmesi, yani html, image, server control gibi &amp;uuml;yeleri i&amp;ccedil;erebilmesidir. Bunlara ek olarak, olay g&amp;uuml;d&amp;uuml;ml&amp;uuml; programlama modelinide destekler. Dolayısıyla bir Master Page aslında bir aspx sayfasından farksızdır.&lt;/p&gt;
&lt;p&gt;Ancak asıl fark, bir Master Page bir aspx sayfasına uygulandığında ortaya &amp;ccedil;ıkar. Master Page' i uygulayan bir aspx sayfası tarayıcıda a&amp;ccedil;ıldığında tarayıcıya gelen sayfa, Master Page ile aspx sayfasının birleştirilmesi sonucu ortaya &amp;ccedil;ıkan başka bir aspx sayfasıdır. Bu, .net framework' &amp;uuml;n getirdiği partial class tekniği sayesinde ger&amp;ccedil;ekleşebilmektedir. Bunun, Master Page' i uygulayan aspx sayfalarına getirdiği değişik kodlama etkileride vardır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk91_1.gif" alt="" width="447" height="192" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. Master Page ve aspx sayfalarının ortak &amp;ccedil;alışma mimarisi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu kısa a&amp;ccedil;ıklamalardan sonra, Master Page' lerin ne olduğunu ve nasıl kullanıldıklarını anlamak amacıyla basit bir &amp;ouml;rnek geliştirelim. İlk olarak, Visual Studio.Net 2005' te bir web sitesi a&amp;ccedil;alım. Sitemize Master Page eklemek i&amp;ccedil;in tek yapmamız gereken, Solution' ımıza sağ tıklamak ve Add New Item' den gelen pencerede, Master Page tipini se&amp;ccedil;mektir. Master Page' ler master uzantılı dosyalardır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk91_2.gif" alt="" width="566" height="398" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. Solution' a Master Page eklenmesi&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından Master Page' in standart olarak aşağıdaki gibi oluşturulduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk91_3.gif" alt="" width="329" height="251" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. Varsayılan Master Page.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;İşte burada ContentPlaceHolder1 bileşenimiz, bu Master Page' i uygulayacak olan sayfaların serbest&amp;ccedil;e erişebilecekleri ve i&amp;ccedil;erik oluşturabilecekleri alanları tanımlamaktadır. Elbetteki bir Master Page' in bu şekilde olması beklenemez. Bu nedenle Master Page' imizi aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi tasarlayabiliriz. Dikkat edecek olursanız, Master Page' lerde, normal aspx sayfaları gibi tasarlanabilirler. Bir başka deyişle, Html kodları, aspx bileşenleri vb. i&amp;ccedil;erebilirler.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk91_6.gif" alt="" width="627" height="376" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. Master Page sayfamızının tasarımı.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Burada standart olarak bir web sayfasının tasarlanmasından farklı bir işlem yapılmamıştır. En &amp;ouml;nemli nokta Master Page' i uygulayacak sayfaların i&amp;ccedil;eriklerini yazabilecekleri ContentPlaceHolder bileşeninin kullanılmasıdır. Dilersek bir Master Page i&amp;ccedil;inde, birden fazla ContentPlaceHolder bileşeninede yer verebiliriz. Master Page' in aspx kodlarına baktığımızda normal aspx sayfalarına g&amp;ouml;re en &amp;ouml;nemli değişik page direktifi yerine master direktifinin kullanılmasıdır. Master direktifi sayfanın bir Master Page olduğunu belirtmektedir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Master Language="C#" CompileWith="AnaSablon.master.cs" ClassName="AnaSablon_master" %&amp;gt;&lt;/pre&gt;
&lt;p&gt;ContentPlaceHolder bileşeni ise,&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:ContentPlaceHolder ID="ContentPlaceHolder1" Runat="server"&amp;gt;&amp;lt;/asp:ContentPlaceHolder&amp;gt;&lt;/pre&gt;
&lt;p&gt;aspx kodları ile tanımlanır. Sayfanın dikkate değer bir &amp;ouml;zelliğide, form takılarını i&amp;ccedil;ermesidir. Nitekim biraz sonra g&amp;ouml;receğimiz gibi bunun, Master Page' i uygulayan aspx sayfalarına etkisi vardır. Şimdi dilerseniz, yeni bir aspx sayfasına oluşturduğumuz Master Page' i nasıl uygulayacağımıza bir bakalım. &amp;Ouml;ncelikle, Add New Item iletişim kutusunu a&amp;ccedil;alım ve dosya tipi olarak Web Form' u se&amp;ccedil;elim. Ardından, sayfamıza uygulamak istediğimiz Master Page' i se&amp;ccedil;ebilmek amacıyla, Select Master Page kutucuğunu işaretleyelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk91_7.gif" alt="" width="617" height="445" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 5. Yeni bir web formun Master Page tabanlı oluşturulması.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu durumda Add buttonuna bastığımızda, sayfamıza uygulamak istediğimiz Master Page' i se&amp;ccedil;eceğimiz iletişim kutusu ekrana gelecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk91_8.gif" alt="" width="352" height="125" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 6. Master Page' in se&amp;ccedil;ilmesi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu adımıda tamamladığımızda, default.aspx sayfamız aşağıdaki gibi oluşturulacaktır. Dikkat edecek olursanız, sadece Master Page' deki ContentPlaceHolder bileşeninin bulunduğu alan d&amp;uuml;zenlenebilir yapıdadır. Diğer kısımlar i&amp;ccedil;in d&amp;uuml;zenleme ve değişitirme gibi işlemleri ger&amp;ccedil;ekleştirme imkanımız yoktur. Bu sayede web formunun, Master Page' in izin verdiği g&amp;ouml;r&amp;uuml;n&amp;uuml;mde olması ve kendisine ayrılan alanda istediği i&amp;ccedil;eriği oluşturmasına izni verilmiş olunur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk91_9.gif" alt="" width="623" height="372" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 7. Master Page' in bir web formuna uygulanması sonucu.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu noktada, web formumuzun aspx kodlarına bakcak olursak sadece tek bir satırın olduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" MasterPageFile="~/AnaSablon.master" CompileWith="Default.aspx.cs" ClassName="Default_aspx" Title="Untitled Page" %&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu tek satır aslında &amp;ccedil;ok şey ifade etmektedir. Herşeyden &amp;ouml;nce, MasterPageFile &amp;ouml;zelliği, sayfaya uygulanan Master Page' in yolunu belirtir. Bu, formun bir Master Page' i uyguladığını başka bir deyişle master page' den t&amp;uuml;retilerek &amp;uuml;retildiğini g&amp;ouml;sterir. Kendi sınıfı ve code-behind dosyası vardır.&lt;/p&gt;
&lt;p&gt;Eğer sayfadaki Content alanı i&amp;ccedil;erisinde d&amp;uuml;zenleme yapmak istersek bunu şu an i&amp;ccedil;in ger&amp;ccedil;ekleştiremediğimizi g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bunu sağlayabilmek i&amp;ccedil;in, Master Page' de yer alan ContentPlaceHolder bileşeninin, bu sayfada bir Content bileşeni ile eşleştirilmesi gerekmektedir. Bunun i&amp;ccedil;in, web formumuza aşağıdaki aspx kodlarını yazmamız yeterli olacaktır. Content bileşeninin, ContentPlaceHolderID &amp;ouml;zelliği, uygulanan Master Page' deki hangi ContentPlaceHolder bileşenini eşleştireceğini belirtmektedir. Bu &amp;ouml;zelliğin değeri, birden falza ContentPlaceHolder' ın, Master Page' i uygulayan sayfalarda eşleştirilmesinde &amp;ouml;nem kazanır.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:Content ID="Content1" ContentPlaceHolderID="ContentPlaceHolder1" Runat="server"&amp;gt;
&amp;lt;/asp:Content&amp;gt;&lt;/pre&gt;
&lt;p&gt;Artık, i&amp;ccedil;eriği istediğimiz gibi değiştirebiliriz. Sunucu elemanları, html kodları, resimler vesaire. &amp;Ouml;rneğin, bir Access tablosundan buradaki Content alanı i&amp;ccedil;indeki bir GridView bileşenini dolduralım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk91_10.gif" alt="" width="619" height="379" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 8. Content alanını bir aspx sayfası d&amp;uuml;zenlermişcesine kullanabiliriz.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Sayfamızın kodlarına bakacak olursak.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" MasterPageFile="~/AnaSablon.master" CompileWith="Default.aspx.cs" ClassName="Default_aspx" Title="Untitled Page" %&amp;gt;
    &amp;lt;asp:Content ID="Content1" ContentPlaceHolderID="ContentPlaceHolder1" Runat="server"&amp;gt;
        &amp;lt;b&amp;gt;Mail Listemize Son &amp;Uuml;ye Olan Okurlar&amp;nbsp;&amp;lt;/b&amp;gt;
        &amp;lt;asp:AccessDataSource ID="AccessDataSource1"
Runat="server" DataFile="~/Data/veriler.mdb" SelectCommand="SELECT [ID], [Ad], [Soyad], [Mail] FROM [MailListesi]"&amp;gt;
        &amp;lt;/asp:AccessDataSource&amp;gt;
            &amp;lt;asp:GridView ID="GridView1" Runat="server" ForeColor="Black" BorderWidth="1px" BorderColor="Tan"
BackColor="LightGoldenrodYellow" DataSourceID="AccessDataSource1" DataKeyNames="ID"
AutoGenerateColumns="False" GridLines="None" CellPadding="2" AutoGenerateEditButton="True"&amp;gt;
                &amp;lt;FooterStyle BackColor="Tan"&amp;gt;&amp;lt;/FooterStyle&amp;gt;
                &amp;lt;PagerStyle ForeColor="DarkSlateBlue" HorizontalAlign="Center" BackColor="PaleGoldenrod"&amp;gt;&amp;lt;/PagerStyle&amp;gt;
                &amp;lt;HeaderStyle Font-Bold="True" BackColor="Tan"&amp;gt;&amp;lt;/HeaderStyle&amp;gt;
                &amp;lt;AlternatingRowStyle BackColor="PaleGoldenrod"&amp;gt;&amp;lt;/AlternatingRowStyle&amp;gt;
                &amp;lt;Columns&amp;gt;
                    &amp;lt;asp:BoundField ReadOnly="True" HeaderText="ID" InsertVisible="False" DataField="ID"
SortExpression="ID"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
                    &amp;lt;asp:BoundField HeaderText="Ad" DataField="Ad" SortExpression="Ad"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
                    &amp;lt;asp:BoundField HeaderText="Soyad" DataField="Soyad" SortExpression="Soyad"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
                    &amp;lt;asp:BoundField HeaderText="Mail" DataField="Mail" SortExpression="Mail"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
                &amp;lt;/Columns&amp;gt;
                &amp;lt;SelectedRowStyle ForeColor="GhostWhite" BackColor="DarkSlateBlue"&amp;gt;&amp;lt;/SelectedRowStyle&amp;gt;
            &amp;lt;/asp:GridView&amp;gt;&amp;nbsp;
    &amp;lt;/asp:Content&amp;gt;&lt;/pre&gt;
&lt;p&gt;Dikkat edecek olursanız, eklemiş olduğumu t&amp;uuml;m kontroller ve diğer i&amp;ccedil;erik, Content bileşenimize ait takılar i&amp;ccedil;erisinde yer almaktadır. Diğer taraftan Content takıları dışında herhangibir i&amp;ccedil;erik oluşturmamızı sağlayacak bileşenleri kullanma imkanımız yoktur. Bir diğer &amp;ouml;nemli &amp;ouml;zellikte, i&amp;ccedil;eriğin herhangibir form takısı i&amp;ccedil;erisinde yer almıyor oluşudur. Bunun sebebi, form takısının zaten Master Page' de uygulanmış olmasıdır. Dolayısıyla web formumuz, Master Page' den kalıtımsal olarak t&amp;uuml;retildiği i&amp;ccedil;in form takılarının burada kullanılmasına gerek yoktur.&lt;/p&gt;
&lt;p&gt;Oluşan default.aspx sayfası aslında, Master Page' deki ContentPlaceHolder alanının i&amp;ccedil;erik eklenmiş halidir. Bunun anlamı, &amp;ccedil;alışma zamanında i&amp;ccedil;eriğin yer aldığı default.aspx sayfası ile AnaSablon.Master sayfasının birleştirilerek yeni bir default.aspx sayfasının oluşturulması ve son kullanıcıya sunulmasıdır. Eğer uygulamamızı &amp;ccedil;alıştıracak olursak tarayıcımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk91_11.gif" alt="" width="625" height="357" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 9. default.aspx' in &amp;ccedil;alışan hali.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Dilersek, bir web uygulaması i&amp;ccedil;erisinde birden fazla Master Page tanımlayabilir ve istediğimiz sayfalara uygulayabiliriz. &amp;Ouml;rneğin, uygulamamıza AnaSablon2.Master isimli aşağıdaki form yapısına sahip yeni bir Master Page eklediğimizi farz edelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk91_12.gif" alt="" width="622" height="462" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 10. AnaSablon2.Master&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu Master Page' i başka bir sayfaya kolayca uygulayabiliriz. &amp;Ouml;rneğin Kitap.aspx isimli bir web formu oluşturalım ve formumuzu AnaSablon2.master' dan t&amp;uuml;retelim. B&amp;ouml;ylece, uygulamamız i&amp;ccedil;erisinde iki farklı Master Page yapısını kullanan sayfalara izin vermiş oluyoruz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk91_13.gif" alt="" width="621" height="651" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 11. Bir uygulamada farklı Master Page' lerin kullanılması.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalemizde kısaca, Master Page' lerin, uygulandıkları aspx sayfaları ile kombine bir şekilde nasıl &amp;ccedil;alıştıklarını incelemeye &amp;ccedil;alıştık. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-09-10 12:00:00</pubDate>
  <slug>Asp-Net-2-0-ve-Master-Page-Kavramc4b1-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet-20</tag>
    <tag>master-page</tag>
  </tags>
  <categories>
    <category>Asp.Net 2.0</category>
  </categories>
</post>