<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Spring Boot ile MongoDb Kullanan Bir Rest Servisinin Geliştirilmesi</title>
  <description>Spring Boot, Java kod tabanı üzerine oturmuş Spring ile uygulama geliştirmeyi kolaylaştıran oldukça kolaylaştıran bir geliştirme çatısıdır. Dahili Dependency Injection mekanizması ve zengin paket desteği sayesinde otonom araçlardan akıllı televizyonlara, elektronik ticaretten bulut uygulamalara kadar birçok alanda Spring'in kabiliyetlerini oldukça etkin kullanabilmemize olanak sağlamaktadır. Birazdan sizde göreceksiniz ki az eforla oldukça etkili bir uygulama ortaya çıkartacağız. Geliştireceğimiz örnekteki amacımız resmi dokümantasyondan da yararlanarak MongoDb veritabanını kullanan basit bir REST servisi geliştirmek. Spring hayatı o kadar kolaylaştırıyor ki, onunla geliştirilen bir API servisi pek çok standardı da otomatik olarak sağlıyor. Haydi gelin nasıl olduğuna bir bakalım.</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/27/springboot.png" alt="" align="right" /&gt;Spring Boot, Java kod tabanı &amp;uuml;zerine oturmuş ve &amp;ouml;zellikle kurumsal &amp;ccedil;apta uygulamaların geliştirilmesinde &amp;ouml;nemli bir yere sahip olan Spring &amp;ccedil;atısınının kullanımını olduk&amp;ccedil;a kolaylaştıran,basitleştiren zevkli hale getiren&lt;em&gt;&amp;nbsp;&lt;/em&gt;bir başka &amp;ccedil;atıdır&lt;em&gt;(Framework)&lt;/em&gt;. Dahili Dependency Injection mekanizması ve zengin paket desteği sayesinde otonom ara&amp;ccedil;lardan akıllı televizyonlara, elektronik ticaretten bulut uygulamalara kadar bir&amp;ccedil;ok alanda Spring'in kabiliyetlerini olduk&amp;ccedil;a etkin kullanabilmemize olanak sağlamaktadır. Birazdan sizin de g&amp;ouml;receğiniz &amp;uuml;zere&amp;nbsp;az eforla olduk&amp;ccedil;a etkili bir servis ortaya &amp;ccedil;ıkaracağız.&lt;/p&gt;
&lt;p&gt;Geliştireceğimiz&amp;nbsp;&amp;ouml;rnekteki amacımız &lt;a href="https://spring.io/guides/gs/spring-boot/" target="_blank"&gt;resmi dok&amp;uuml;mantasyondan&lt;/a&gt;&amp;nbsp;da yararlanarak MongoDb veritabanını kullanan basit bir REST servisi yazmak. Spring hayatı o kadar kolaylaştırıyor ki, onunla geliştirilen bir API servisi pek &amp;ccedil;ok standardı da otomatik olarak sağlıyor. Haydi gelin nasıl olduğuna bir bakalım.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Ben bu &amp;ccedil;alışmayı Heimdall&lt;em&gt;(Ubuntu-20.04)&lt;/em&gt; &amp;uuml;st&amp;uuml;nde ve bir numaralı geliştirme arabirimi olarak kabul ettiğim Visual Studio Code ile geliştirmekteyim&lt;em&gt;.&lt;/em&gt;&amp;nbsp;&amp;Ccedil;alışmaya başladığınızda sizin de sisteminizde Java ve build mekanizması i&amp;ccedil;in kullanılması gereken Gradle ya da Maven olmayabilir. Bu nedenle aşağıdaki terminal komutlarına benzer bir kurulum s&amp;uuml;recinden ge&amp;ccedil;meniz gerekebilir. Ek olarak bu &amp;ouml;rnek &amp;ouml;zelinde sisteme MongoDB kurmak yerine her zaman olduğu gibi Docker imajından yararlanabiliriz.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# Ubuntu 20.04 tarafındaki kurulum i&amp;ccedil;in
sudo apt install openjdk-14-jdk

# Sonrasın bir versiyon kontrol&amp;uuml;
java --version

# Apache Maven kurulumu i&amp;ccedil;inse
sudo apt install maven

# Yine bir &amp;ccedil;alışıyor mu kontrol&amp;uuml; tabii
mvn -version

# MongoDb i&amp;ccedil;in daha &amp;ouml;nceki &amp;ouml;rneklerde olduğu gibi docker imajı kullanmayı tercih ettim.
sudo docker run --name mongodb -p 27017:27017 -d mongo:latest&lt;/pre&gt;
&lt;p&gt;Spring Boot tarafında belki de en &amp;ouml;nemli yardımcımız uygulama iskeletini bağımlılıkları ile birlikte kolayca oluşturmamızı sağlayan Spring Initializer isimli &amp;ccedil;evrimi&amp;ccedil;i ara&amp;ccedil;&lt;em&gt;(&lt;a href="https://start.spring.io/" target="_blank"&gt;Şu adresten&lt;/a&gt; ulaşabilirsiniz)&lt;/em&gt; Bu yazıdaki &amp;ouml;rneğimiz i&amp;ccedil;in aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan konfigurasyonu kullanacağız. Uygulamaya REST &amp;ouml;zellikleri katmak i&amp;ccedil;in Rest Repositories ve Mongo tarafı ile kolayca konuşabilmek i&amp;ccedil;in Spring Data MongoDB bağımlılıklarını eklediğimize dikkat edelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/27/Screenshot_01.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aray&amp;uuml;zde gerekli bilgileri doldurduktan sonra Generate butonuna basmamız yeterli. Sisteme sıkıştırılmış bir uygulama paketi inecektir. İndirilen hazır kod deposu &amp;uuml;zerinde gerekli geliştirmelerimizi yapabiliriz. Tabii başlamadan &amp;ouml;nce neler gelmiş diye bakmakta yarar var. S&amp;ouml;zgelimi yukarıdaki g&amp;ouml;rselde belirlediğimiz ayarlar pom.xml dosyası i&amp;ccedil;erisine yazılacaktır vb...&lt;/p&gt;
&lt;p&gt;MongoDB tarafında &amp;ouml;rnek olarak oyuncu bilgilerini tutacağımız bir dok&amp;uuml;man kullanabiliriz. Bu dok&amp;uuml;manın Java tarafındaki izd&amp;uuml;ş&amp;uuml;m&amp;uuml;n&amp;uuml; bir sınıf&lt;em&gt;(POJO-Plain Old Java Object)&lt;/em&gt; ile ifade edebiliriz. S&amp;ouml;z konusu sınıfı src/main/java/com/skynet/gamesworldapi altında Player ismiyle&amp;nbsp;aşağıdaki gibi oluşturarak &amp;ccedil;alışmamıza devam edelim.&lt;/p&gt;
&lt;pre class="brush:java;auto-links:false;toolbar:false" contenteditable="false"&gt;package com.skynet.gamesworldapi; // Hangi pakete dahil

import org.springframework.data.annotation.Id;

/*
    MongoDb tarafındaki veriyi işaret eden eş nesne.
    Bir POJO (Plain Old Java Object)
    Lakin, C# Auto Property'lerin g&amp;ouml;z&amp;uuml;n&amp;uuml; seveyim :D
*/
public class Player {

    @Id
    private String id; // import edilen paket &amp;uuml;st&amp;uuml;nden kullandığımız Field. MongoDB ObjectId i&amp;ccedil;in
                       // kullanıyoruz. @Id niteliği ile bunu ifade etmiş olduk

    private String _nickName;
    private Integer _level;
    private Boolean _isActive;

    public String getNickName() {
        return _nickName;
    }

    public void setNickName(String nickName) {
        _nickName = nickName;
    }

    public Integer getLevel() {
        return _level;
    }

    public void setLevel(Integer level) {
        _level = level;
    }

    public Boolean getIsActive() {
        return _isActive;
    }

    public void setIsActive(Boolean isActive) {
        _isActive = isActive;
    }
}&lt;/pre&gt;
&lt;p&gt;MongoDb ile olan servis iletişimi Player nesnesine g&amp;ouml;re otomatik olarak kurgulanacaktır. Lakin ek operasyon desteği de sunmak isteyebiliriz.&amp;nbsp;&amp;Ouml;rneğin aktif veya pasif oyuncu listesini verecek bir fonksiyonellik gibi.&amp;nbsp;Bunun i&amp;ccedil;in&amp;nbsp;MongoDb eklentisi ile gelen MongoRepository t&amp;uuml;r&amp;uuml;n&amp;uuml; genişletmemiz gerekiyor. Genişletilen tip sisteme enjekte edileceğinden interface olarak tasarlanmalıdır. @RepositoryRestResource niteliği ise REST i&amp;ccedil;in gerekli path bildirimini barındırmaktadır. Yani y&amp;ouml;nlenilen REST Endpoint'in hangi s&amp;ouml;zleşme tarafından karşılanacağı &amp;ccedil;alışma zamanına annotation &amp;uuml;zerinden s&amp;ouml;ylenir.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:java;auto-links:false;toolbar:false" contenteditable="false"&gt;package com.skynet.gamesworldapi;

import java.util.List; // Metodumuz bir liste d&amp;ouml;nd&amp;uuml;receği i&amp;ccedil;in eklenen paket

import org.springframework.data.mongodb.repository.MongoRepository;
import org.springframework.data.repository.query.Param;
import org.springframework.data.rest.core.annotation.RepositoryRestResource;

/*
    MongoRepository t&amp;uuml;r&amp;uuml;n&amp;uuml; genişleten bir interface s&amp;ouml;z konusu.
    İ&amp;ccedil;inde etkin olup olmama durumuna g&amp;ouml;re oyuncu listesi d&amp;ouml;nd&amp;uuml;ren bir metodumuz da var.
    path ile bu repository i&amp;ccedil;in API EndPoint'ini tanımlamış olduk
*/

@RepositoryRestResource(collectionResourceRel = "player", path = "player")
public interface PlayerRepository extends MongoRepository&amp;lt;Player, String&amp;gt; {
    /*
        Geriye Player t&amp;uuml;r&amp;uuml;nden bir liste d&amp;ouml;nd&amp;uuml;recek.
        Ama&amp;ccedil; isActive değerine g&amp;ouml;re etkin olan veya olmayan oyuncu listesini &amp;ccedil;ekmek
        _isActive.
        Bu arada metot adının getBy_isActive olması tesad&amp;uuml;f değil. Player sınıfındakinda isActive field'ını bu şekilde isimlendirdiğimiz i&amp;ccedil;in.
        Aksi durumda build sırasında hata alırız. Kod derlenmez. Test &amp;ccedil;ıktısı da fail olur.
    */
    List&amp;lt;Player&amp;gt; getBy_isActive(@Param("active") Boolean isActive);
}&lt;/pre&gt;
&lt;p&gt;Aslında t&amp;uuml;m hazırlıklar bu kadar :) Uygulamayı Maven ile doğrudan &amp;ccedil;alıştırabiliriz. Ya da bir paket derleyip onu da y&amp;uuml;r&amp;uuml;tebiliriz. Her iki kullanımı da aşağıdaki terminal komutlarında g&amp;ouml;rebilirsiniz&lt;em&gt;(mvnw dosyası bu &amp;ouml;rnek &amp;ouml;zelinde games-world-api klas&amp;ouml;r&amp;uuml; altındadır)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;./mvnw spring-boot:run

# ya da paketi derleyip &amp;uuml;retilen JAR dosyası ile de &amp;ccedil;alıştırılabilir
./mvnw clean package
java -jar target/games-world-api-0.0.1-SNAPSHOT.jar&lt;/pre&gt;
&lt;p&gt;Buna g&amp;ouml;re aşağıdakine benzer bir &amp;ccedil;alışma zamanı elde etmemiz gerekiyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/27/Screenshot_02.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim testlerimize.&amp;nbsp;Uygulamamız malumunuz bir REST servisi. Bu nedenle Curl veya Postman gibi ara&amp;ccedil;larla test yapabiliriz. Dikkat edilmesi gereken nokta &amp;ouml;zellikle kendi eklediğimiz dışında t&amp;uuml;m CRUD&lt;em&gt;(Create Read Update Delete)&lt;/em&gt;&amp;nbsp;fonksiyonlarının karşılığı olan Post, Get, Put, Delete operasyonlarının hazır olarak sunulmasıdır. L&amp;uuml;tfen bunlar i&amp;ccedil;in herhangi bir kod yazmadığımıza dikkat edin. Sihir! ;) &amp;Ouml;yleyse birka&amp;ccedil; talep ile devam edelim.&lt;/p&gt;
&lt;p&gt;Yeni bir oyuncuyu aşağıdaki basit talep ile ekleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;http://localhost:8080/player
POST
JSON Body
{
	"nickName": "bamble bee",
	"level": 55,
	"isActive": true
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/27/Screenshot_03.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Birka&amp;ccedil; oyuncu daha ekleyip sonrasında t&amp;uuml;m oyuncu listesini almak i&amp;ccedil;in aşağıdaki talebi kullanmak yeterli.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;http://localhost:8080/player
GET&lt;/pre&gt;
&lt;p&gt;Tabii listelenen verinin b&amp;uuml;y&amp;uuml;k olma olasılığına karşın Spring Boot sayfalama &amp;ouml;zelliklerini de hesaba katmaktadır. Aşağıdaki g&amp;ouml;r&amp;uuml;nt&amp;uuml;de yer alan page kısmına dikkat edelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/27/Screenshot_04.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Belli bir dok&amp;uuml;manı&lt;em&gt;(player verisini)&lt;/em&gt; &amp;ccedil;ekmek istersek MongoDB'nin kendine has ID bilgisini kullanmamız yeterli. Mesela;&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;http://localhost:8080/player/5f3d626214851c46fd10544a
GET&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/27/Screenshot_05.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bir i&amp;ccedil;eriği silmek i&amp;ccedil;in,&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;http://localhost:8080/player/5f3d625114851c46fd105449
DELETE&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/27/Screenshot_07.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;veya veri g&amp;uuml;ncellemek i&amp;ccedil;inse&lt;em&gt;(Komple set)&lt;/em&gt; aşağıdaki &amp;ouml;rnek talebi kullanabiliriz.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;http://localhost:8080/player/5f3d626214851c46fd10544a
PUT
JSON Body

{
	"level": 46,
	"nickName": "Sala Mura Jack",
	"isActive": false
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/27/Screenshot_08.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hatırlayacağınız &amp;uuml;zere MongoDb repository'sini kendi s&amp;ouml;zleşmemiz ile genişletmiştik.&amp;nbsp;Pasif ve aktif oyuncuların listesini &amp;ccedil;ekmek i&amp;ccedil;in bu fonksiyona doğru aşağıdaki talepleri yollayabiliriz. Pasif olan oyuncular i&amp;ccedil;in,&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;http://localhost:8080/player/search/getBy_isActive?active=false
GET&lt;/pre&gt;
&lt;p&gt;ve aktif oyunclar i&amp;ccedil;in&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;http://localhost:8080/player/search/getBy_isActive?active=true
GET&lt;/pre&gt;
&lt;p&gt;İşte sonu&amp;ccedil;lar;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/27/Screenshot_06.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere Spring Boot kullanarak MongoDB ile konuşan bir REST servisini temel CRUD ve bizim ekleyeceğimiz ilave&amp;nbsp;fonksiyonlar ile ayağa kaldırmak olduk&amp;ccedil;a basit, zahmetsiz ve kolay ;)&amp;nbsp;Veri odaklı servisleri kolaylıkla &amp;uuml;retim ortamlarına alabiliriz diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum.&amp;nbsp;Spring Boot konusunda deneyimleriniz varsa bu konu &amp;ouml;zelinde yorumlarınız olursa l&amp;uuml;tfen yazının altına bırakmaya &amp;ccedil;ekinmeyin. Bu arada &amp;ouml;rneği geliştirmek elbette elinizde. S&amp;ouml;z gelimi MongoDb yerine PostgreSQL kullanmayı deneyebilirsiniz. Hatta oyuncuların katıldıkları ma&amp;ccedil;lara ait skor, başarı, madalya, seviyle vb bilgilerin tutulduğu yeni bir POJO hazırlayıp Player ile ilişkilendirerek servis &amp;uuml;zerinden sunmayı d&amp;uuml;ş&amp;uuml;nebilirsiniz ;)&amp;nbsp;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir Skynet derlememizin daha sonuna. &amp;Ouml;rneğe ait kodlara &lt;a href="https://github.com/buraksenyurt/skynet/tree/master/No%2027%20-%20REST%20with%20Spring%20and%20MongoDb" target="_blank"&gt;github reposu &amp;uuml;zerinden&lt;/a&gt; erişebilirsiniz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2020-10-11 19:01:00</pubDate>
  <slug>spring-boot-ile-mongodb-kullanan-bir-rest-servisinin-gelistirilmesi</slug>
  <tags>
    <tag>java</tag>
    <tag>mongodb</tag>
    <tag>spring</tag>
    <tag>spring-boot</tag>
    <tag>docker</tag>
    <tag>maven</tag>
    <tag>gradle</tag>
    <tag>spring-framework</tag>
  </tags>
  <categories>
    <category>Spring Boot</category>
  </categories>
</post>