<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Azure, Azure! Bu Fotoğrafta Neler Görüyorsun?</title>
  <description>Pluralsight sağolsun Azure konusundaki çalışmalarıma devam ediyorum. Ufak ufak öğretilerin üzerinden geçerken de neyin nasıl yapıldığını adım adım öğrenmeye çalışıyorum. Bu yazımızda zun zamandır hepimizin varlığından haberdar olduğu Cognitive Services özelliklerinden birisine bakacağız. Azure'un yapay zeka destekli makine öğrenme hizmetlerinden olan Compture Vision enstrümanını kullanarak bir fotoğrafı bizim için nasıl yorumlayableceğini göreceğiz.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/05/comvision_enter.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Yandaki fotoğrafa baktığınızda neler g&amp;ouml;r&amp;uuml;yorsunuz? Hatta neler hissediyorsunuz? Kalın lastikleri olan koyu yeşil renkte Toyota marka bir arazi aracı.&amp;nbsp;Aracın i&amp;ccedil;ine&amp;nbsp;bakabilmesi i&amp;ccedil;in ufaklığı kollarıyla&amp;nbsp;kaldıran arkası d&amp;ouml;n&amp;uuml;k bir kadın. Arka tarafta turuncu kapısı g&amp;ouml;r&amp;uuml;nen bir başka ara&amp;ccedil;. Olayla pek ilgisi olmayan ilkokul &amp;ccedil;ağında sarışın kıvırcık sa&amp;ccedil;lı bir kız &amp;ccedil;ocuğu.&amp;nbsp;Bluzundaki&amp;nbsp;sembollerden &amp;ccedil;ıkartıldığı kadarıyla Minion'lar. Arka tarafta y&amp;uuml;kselene sıra dağlar ve diğerleri. İnsan g&amp;ouml;z&amp;uuml;yle fotoğraf dikkatlice incelelendiğinde s&amp;ouml;yleyebileceklerimizden sadece bazıları. Hatta insani duygularla hareket ederek empati&amp;nbsp;yaptığımızda g&amp;ouml;receğimiz&amp;nbsp;farklı detaylar da var &amp;ouml;yle değil mi? Ufaklığın y&amp;uuml;z&amp;uuml;ndeki meraklı bakışa, aracın i&amp;ccedil;ini g&amp;ouml;rmek istercesine annesinin kollarında yukarıya doğru y&amp;uuml;kselmeye &amp;ccedil;alışmasına bir baksanıza. Ya da cansız bile olsa aracın tekerlekleri ile ne kadar agresif g&amp;ouml;r&amp;uuml;nd&amp;uuml;ğ&amp;uuml;ne. İşte bu farklılıkları ve detayları g&amp;ouml;rmek belki de&amp;nbsp;biz insanları makinelerden, d&amp;uuml;ş&amp;uuml;nmeye &amp;ccedil;alışan robotlardan ayıran&amp;nbsp;&amp;ouml;nemli bir&amp;nbsp;&amp;ouml;zellik.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Ancak oyunun kuralları bildiğiniz gibi uzun s&amp;uuml;re &amp;ouml;nce değişmeye başladı. &amp;Ouml;nce dijital fotoğraf makinelerinin, kameraların g&amp;ouml;rd&amp;uuml;kleri karelerdeki y&amp;uuml;zleri ayırt edişlerine şahit olmaya başladık. Hatta hareket edenleri nasıl yakaladıklarını g&amp;ouml;rd&amp;uuml;k. Sonra onların renklerini ayırt edebildiklerini ve az &amp;ccedil;ok o fotoğraflarda neler&amp;nbsp;bulunduğunu&amp;nbsp;tahminlemeye &amp;ccedil;alıştıklarını. Halen daha da g&amp;ouml;rmeye devam ediyoruz. Artık yapay zekanın, &amp;ouml;ğrenen makinelerin d&amp;uuml;nyasında olduğumuz i&amp;ccedil;in bu fotoğrafı yorumlayışımıza yakınlaşmaları &amp;ccedil;ok da uzak değil gibi. Ne kadar yaklaşabileceklerini zaman i&amp;ccedil;erisinde daha net g&amp;ouml;receğiz ama bu &amp;ccedil;ok uzak bir gelecek değil. &amp;Ouml;ğreniyorlar...&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;n&amp;uuml;n gelecek teknolojilerini belirleyen b&amp;uuml;y&amp;uuml;k akt&amp;ouml;rlerin &amp;ccedil;oğu, bu tip tanıma/tanımlama operasyonlarını sunan servislere sahipler. Google, Amazon, Microsoft, IBM, Facebook ve diğerlerinin başı &amp;ccedil;ektiği bir d&amp;uuml;nya var artık. &amp;Ouml;zellikle bulut&amp;nbsp;hesaplamaları alanında hizmet verenlerin sahip olduğu avantajlar yukarıdaki gibi bir senaryonun saniyeler i&amp;ccedil;erisinde ger&amp;ccedil;eklenmesine de olanak sağlamakta. Bende bu merakla bir şeyler araştırmayı başladım ge&amp;ccedil;enlerde.&amp;nbsp;Pluralsight sağolsun Azure konusundaki &amp;ccedil;alışmalarıma devam ediyorum. Ufak ufak &amp;ouml;ğretilerin &amp;uuml;zerinden ge&amp;ccedil;erken de neyin nasıl yapıldığını adım adım &amp;ouml;ğrenmeye &amp;ccedil;alışıyorum. Bu yazımızda ise uzun zamandır hepimizin varlığından haberdar olduğu Cognitive Services &amp;ouml;zelliklerinden birisine bakacağız. Azure'un yapay zeka destekli makine &amp;ouml;ğrenme hizmetlerinden olan Compture Vision enstr&amp;uuml;manını kullanarak bir fotoğrafı bizim i&amp;ccedil;in nasıl yorumlayableceğini işleyeceğiz.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Microsoft Cognitive Services temel olarak 5 ana kategoriye ayrılmıştır. Vision, Speech, Language, Knowledge ve Search. Her bir kategori başlığı altında bu alana &amp;ouml;zg&amp;uuml; farklı fonksiyonellikler sunulmaktadır. İlgili listeye &lt;a href="https://azure.microsoft.com/en-us/services/cognitive-services/directory/?v=18.05" target="_blank"&gt;şu adresten&lt;/a&gt; bir bakmanızı &amp;ouml;neririm.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/05/comvision_ex.gif" alt="" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;İlk olarak Azure platformunda bu hizmeti kullanabilmek i&amp;ccedil;in gerekli hazırlıkları yapıp sonrasında &amp;ouml;rnek bir kod par&amp;ccedil;ası ile bir ka&amp;ccedil; fotoğrafı yorumlatacağız. Bir nevi basit How To yazısı olduğunu belirtebilirim.&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;Azure Plaforumundaki Hazırlıklar&lt;/h1&gt;
&lt;p&gt;İşe Azure Platformu &amp;uuml;zerindeki hazırlıklarla başlamamız gerekiyor. Bu aşamada sizlerin Azure&amp;nbsp;hesaplarınız&amp;nbsp;olduğunu kabul ediyorum. Yapmamız gereken arabirimi kullanarak Cognitive Services kısmına ulaşmak. All services penceresinden aratma usul&amp;uuml; ile bulabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/05/comvision_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ardından Computer Vision&amp;nbsp;enstr&amp;uuml;manını bulmalıyız.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/05/comvision_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;AI +Machine Learning kategorisinde yer alan&amp;nbsp;hizmeti bulduktan sonra yeni bir &amp;ouml;rneğini oluşturabiliriz. Ben aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan bilgileri kullandım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/05/comvision_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Burada&amp;nbsp;s&amp;ouml;z konusu kaynak i&amp;ccedil;in girmemiz gereken bazı bilgiler yer alıyor. Kaynağın adı&lt;em&gt;(Name)&lt;/em&gt;, lokasyonu&lt;em&gt;(Location/Data Center)&lt;/em&gt;, dahil olacağı grup bilgisi&lt;em&gt;(Resource Group)&lt;/em&gt; ve tabii fiyatlandırma se&amp;ccedil;eneği&lt;em&gt;(Pricing Tier)&lt;/em&gt;. F0 planı &amp;uuml;cretsiz olduğu ve sadece &amp;ouml;ğrenme ama&amp;ccedil;lı bir &amp;ccedil;alışma yaptığımız i&amp;ccedil;in yeterli. Bunun dışında bir se&amp;ccedil;eneğimiz daha var.&amp;nbsp;S1'e g&amp;ouml;re 1000 &amp;ccedil;ağrı başına 1 dolardan başlayan bir fiyatlandırma stratejisi s&amp;ouml;z konusu. Senaryoya g&amp;ouml;re farklı bir plana da ihtiya&amp;ccedil; duyabiliriz. Bu tamamen işlemek istediğimiz k&amp;uuml;menin b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;, ne kadar sık işleneceği ve benzeri kriterlerle alakalı bir konu. &amp;Ouml;rneğin S1 planı saniyede 10 &amp;ccedil;ağrıma izin verirken Free plan i&amp;ccedil;in bu dakikada 20 &amp;ccedil;ağrım ve ayda en fazla 5000 &amp;ccedil;ağrım ile sınırlı &lt;em&gt;(Bu arada F0 planını se&amp;ccedil;tikten sonra tekrar ikinci bir Computer Vision i&amp;ccedil;in ikinci bir F0 planı se&amp;ccedil;emediğimi fark ettim. Ucuz etin yahnisi misali)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/05/comvision_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;F0 se&amp;ccedil;iminden sonra kaynağı oluşturabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/05/comvision_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İşlemler başarılı bir şekilde tamamlandığında read-this-photo isimli Computer Vision &amp;ouml;rneğinin başarılı bir şekilde oluşturulduğunu g&amp;ouml;rmemiz gerekiyor. Kod tarafı i&amp;ccedil;in kritik olan iki bilgi de bu ekrandan alınacak. Bunlardan birisi&amp;nbsp;servis&amp;nbsp;adresi&lt;em&gt;(endpoint bilgisi)&lt;/em&gt;&amp;nbsp;Yani fotoğraf ile ilgili analizi ger&amp;ccedil;ekleştirecek olan servisin k&amp;ouml;k adresi. K&amp;ouml;k adresi diyorum &amp;ccedil;&amp;uuml;nk&amp;uuml; duruma g&amp;ouml;re farklı bir operasyona da gidilebilir&lt;em&gt;(&amp;Ouml;rneğin fotoğraf i&amp;ccedil;in &amp;uuml;nl&amp;uuml;leri sorgulamak istiyorsak celebrities/model gibi bir operasyon eklememiz gerekir)&lt;/em&gt; Diğeri ise iletişim sırasında gerekli olan anahtar&lt;em&gt;(Key 1)&lt;/em&gt; değeridir. Anahtar bilgisini Manage Keys kısmından alabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/05/comvision_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İstemci tarafından servise gelirken&amp;nbsp;KEY 1 değerine ihtiyacımız olacak.&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;İstemci Tarafının Geliştirilmesi&lt;/h1&gt;
&lt;p&gt;Portal tarafındaki kaynak hazırlıklarımız artık tamamlanmış durumda. Şimdi basit bir istemci&amp;nbsp;uygulaması ile s&amp;ouml;z konusu servisi deneyimleyebiliriz. Ben &amp;ouml;rnek kod par&amp;ccedil;asını Visual Studio Code &amp;uuml;zerinde C# kullanarak yazacağım. Console tipinden bir program yeterli olacaktır. Ancak farklı programlama dillerini kullanmamız da m&amp;uuml;mk&amp;uuml;n. Ruby, Java, PHP ve diğer desteklenen dillerle geliştirme yapabiliriz. &amp;Ouml;ncelikle işe aşağıdaki komut satırı ile başlayalım.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new console -o HowToComputerVision&lt;/pre&gt;
&lt;p&gt;Gelelim program.cs i&amp;ccedil;eriğine.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.IO;
using System.Net.Http;

namespace HowToComputerVision
{
    class Program
    {
        const string endpointAddress = "https://eastus.api.cognitive.microsoft.com/vision/v1.0/analyze";
        const string key1 = "c04df99b57b6475182748ebc47d22246";

        static void Main(string[] args)
        {
            string[] samples = { "sample1.jpg", "sample2.jpg", "sample3.png"
            , "sample4.jpg", "sample5.jpg","sample6.png" };
            foreach (var sample in samples)
            {
                Analyze(sample);
            }
            Console.ReadLine();
        }

        public static async void Analyze(string photo)
        {
            using (var client = new HttpClient())
            {
                HttpResponseMessage response = null;
                client.DefaultRequestHeaders.Add("Ocp-Apim-Subscription-Key", key1);

                var requestParameters = "visualFeatures=Categories,Description,Color,Tags&amp;amp;Language=en";
                var uri = endpointAddress + "?" + requestParameters;

                var fs = new FileStream(photo, FileMode.Open, FileAccess.Read);
                var bReader = new BinaryReader(fs);
                var photoData = bReader.ReadBytes((int)fs.Length);

                using (var content = new ByteArrayContent(photoData))
                {
                    content.Headers.ContentType = new System.Net.Http.Headers.MediaTypeHeaderValue("application/octet-stream");
                    response = await client.PostAsync(uri, content);
                    string contentStr = await response.Content.ReadAsStringAsync();
                    Console.WriteLine($"\n{contentStr}\n");
                }
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Dilerseniz kodda neler yaptığımıza kısaca değinelim.&lt;/p&gt;
&lt;p&gt;Aslında Computer Vision bir REST API servisi. Dolayısıyla uygun HTTP &amp;ccedil;ağrılarını yapmamız servisten hizmet almak i&amp;ccedil;in yeterli. T&amp;uuml;m iş y&amp;uuml;k&amp;uuml; Analyze metodunda. Fonksiyon i&amp;ccedil;erisinde HTTP &amp;ccedil;ağrısı i&amp;ccedil;in HttpClient nesnesinden yararlanılıyor. Servise giderken bazı gerekli bilgileri vermemiz lazım. &amp;Ouml;rneğin Ocp-Apim-Subscription-Key isimli bir Header değerinin, Azure &amp;uuml;zerinde oluşturduğumuz Computer Vision API kaynağı i&amp;ccedil;in verilen KEY1 ile POST&amp;nbsp;talebine eklenmesi gerekiyor. Bunu DefaultRequestHeaders.Add&amp;nbsp;satırında&amp;nbsp;yapıyoruz. Bunun dışında neler istediğimizi de s&amp;ouml;ylememiz lazım. API i&amp;ccedil;in bu istekler visualFeatures parametresine atanan terimlerle belirlenmekte. Categories, Description, Color, Tags bizim &amp;ouml;rneğimizde kullanılanlar. Bunların İngilizce olarak yorumlanmasını bekliyoruz.&lt;/p&gt;
&lt;p&gt;Kodun takip eden kısmında fotoğrafın byte tipinden i&amp;ccedil;eriğine ihtiyacımız var. Nitekim servise bu i&amp;ccedil;eriği g&amp;ouml;ndermemiz gerekiyor. FileStream ve BinaryReader sınıflarından yararlanarak i&amp;ccedil;eriği yakaladıktan sonra bir ByteArrayContent nesnesi &amp;ouml;rnekliyoruz. Bu nesnenin i&amp;ccedil;erik tipini belirtmek &amp;ouml;nemli. &amp;Ouml;rnekte application/octet-stream t&amp;uuml;r&amp;uuml;nden bir i&amp;ccedil;erik&amp;nbsp;kullanıldığı&amp;nbsp;belirtilmekte. Talebi awaitable PostAsync metodu ile yolluyoruz. İlk parametre EndPoint ve ikinci parametrede fotoğraf i&amp;ccedil;eriğini taşımakta. Sonu&amp;ccedil;lar response nesne &amp;ouml;rneği &amp;uuml;zerinden ReadAsStringAsync fonksiyonu ile yakalanıp ekrana basılmakta. Analyze foksiyonu asnekron &amp;ccedil;alışan bir metod. Bu nedenle &amp;ccedil;alışma zamanında fotoğraflardan hangisi i&amp;ccedil;in cevap d&amp;ouml;nd&amp;uuml;yse ona ait JSON i&amp;ccedil;eriği basılıyor. İşlemeye &amp;ccedil;alıştığımız sırada değil de bittik&amp;ccedil;e JSON &amp;ccedil;ıktılarını alacağımızı ifade edebiliriz.&lt;/p&gt;
&lt;h1&gt;Sonu&amp;ccedil;lar&lt;/h1&gt;
&lt;p&gt;Hemen &amp;ouml;rnek fotoğrafların sonu&amp;ccedil;larna bir bakalım. &amp;Ccedil;ok heyecanlı değil mi? :) &amp;Ouml;ncelikli olarak bize deneme i&amp;ccedil;in bir ka&amp;ccedil; fotoğraf gerekiyor. Internetten test&amp;nbsp;ama&amp;ccedil;lı farklı tiplerde fotoğraflar buldum. İlk sırada turuncu sakallı bir Lego manyağı var :P İkinci sırada masa başında&amp;nbsp;bir &amp;ccedil;ok insanın&amp;nbsp;bulunduğu bir&amp;nbsp;tartışma ortamı yer alıyor.&amp;nbsp;&amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; sırada son Star Wars filminden sevdiğim bir kare var. &amp;Ouml;zellikle Computer Vision servisinin Yoda'yı nasıl yorumlayacağını &amp;ccedil;ok merak ediyorum. Acaba ona usta yoda'yı &amp;ouml;ğretmişler midir? Devam eden fotoğraftaki beklentim ise park yapan araca yaslanmış bir şekilde ayakta duran kadının bulunup bulunamayacağı. 5nci fotoğrafı bilhassa koydum. Ger&amp;ccedil;ek d&amp;uuml;nayadan olmayan bir &amp;ccedil;izgi. Bakalım karşı tarafın tepkisi ne olacak? Son fotoğrafımız ise başta konuştuğumuz i&amp;ccedil;eriğe sahip.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/05/comvision_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Programın &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı&amp;nbsp;aşağıdakine&amp;nbsp;benzer olacaktır. Dikkat edileceği &amp;uuml;zere fotoğraflar ile ilgili yorumlar servisten JSON fortamında d&amp;ouml;nmekte. İ&amp;ccedil;erikte categories, description, tags ve color k&amp;ouml;k elementleri yer&amp;nbsp;alıyor ki bunları istediğimizi endpoint sonuna eklediğimiz ifadelerle biz belirtmiştik.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/05/comvision_9.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu fotoğraflardan ilki i&amp;ccedil;in&amp;nbsp;gelen JSON &amp;ccedil;ıktısını kısaca değerlendirelim mi? &amp;Ouml;rneğin benim Boba Fett'in gemisinin Lego'su ile olan fotoğrafımla ilgili ş&amp;ouml;yle bir &amp;ccedil;ıktı verildi&lt;em&gt;(Zaman ilerledik&amp;ccedil;e Computer Vision'un fotoğraf &amp;ouml;ğrenmesi sonucu daha farklı ve isabetli cevaplar vereceğini tahmin ediyorum)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false;" contenteditable="false"&gt;{
  "categories": [
    {
      "name": "others_",
      "score": 0.0078125
    },
    {
      "name": "outdoor_",
      "score": 0.00390625,
      "detail": {
        "landmarks": [
          
        ]
      }
    },
    {
      "name": "people_",
      "score": 0.42578125,
      "detail": {
        "celebrities": [          
        ]
      }
    }
  ],
  "tags": [
    {
      "name": "person",
      "confidence": 0.99906939268112183
    },
    {
      "name": "man",
      "confidence": 0.990304172039032
    },
    {
      "name": "indoor",
      "confidence": 0.986711859703064
    },
    {
      "name": "shelf",
      "confidence": 0.63831371068954468
    },
    {
      "name": "male",
      "confidence": 0.1531662791967392
    }
  ],
  "description": {
    "tags": [
      "person",
      "man",
      "indoor",
      "computer",
      "holding",
      "laptop",
      "front",
      "shelf",
      "sitting",
      "shirt",
      "using",
      "table",
      "book",
      "food",
      "remote",
      "young",
      "dog",
      "black",
      "wearing",
      "desk",
      "control",
      "large",
      "room",
      "keyboard",
      "white",
      "pizza",
      "bed",
      "video",
      "standing"
    ],
    "captions": [
      {
        "text": "a man holding a book shelf",
        "confidence": 0.66441073283724139
      }
    ]
  },
  "color": {
    "dominantColorForeground": "Grey",
    "dominantColorBackground": "Black",
    "dominantColors": [
      "Black",
      "Grey",
      "Brown"
    ],
    "accentColor": "274562",
    "isBwImg": false
  },
  "requestId": "4efc41fa-c421-4e70-bd20-c392306f6031",
  "metadata": {
    "height": 750,
    "width": 1500,
    "format": "Jpeg"
  }
}&lt;/pre&gt;
&lt;p&gt;categories kısmına baktığımızda en y&amp;uuml;sek skor değeri insan'da g&amp;ouml;r&amp;uuml;n&amp;uuml;yor. Yani insan temalı bir fotoğraf olarak kategorilendirebiliriz. tags b&amp;ouml;l&amp;uuml;m&amp;uuml;nde &amp;ouml;nerilen takılar bulunmakta. Kapalı mekan olduğu, rafların bulunduğu, bir adamın yer aldığı belirtilmiş. confidence değeri y&amp;uuml;ksek olanlar tahmini olarak &amp;ouml;ne &amp;ccedil;ıkan bilgiler. description kısmındaki takılarda&amp;nbsp;fena değil aslında. Mekan ile ilgili az &amp;ccedil;ok tutarlı anahtar kelimelere yer verilmiş. Her ne kadar ben pizza'nın nerede olduğunu pek &amp;ccedil;ıkartamasamda fena sayılmazlar. Ağırlıklı renkler siyah, gri ve kahve olarak belirtilmiş&amp;nbsp;&lt;em&gt;(Renkler aslında &amp;ouml;n plan, arka plan ve t&amp;uuml;m resim olarak ele alınmaktalar ve 12 dominant renk ele alınmakta; Siyah, mavi, kahverengi, gri, yeşil, turuncu, pembe, mor, kırmızı, deniz mavizi, beyaz ve sarı)&lt;/em&gt; Fotoğraf i&amp;ccedil;in &amp;ouml;nerilen başlıkta hoş aslında ki benim Computer Vision'da en &amp;ccedil;ok beğendiğim &amp;ouml;zelliklerden birisi de bu; "a man holding a book shelf" Diğer fotoğraflar i&amp;ccedil;in neler s&amp;ouml;ylediğini&amp;nbsp;bilmek ister misin?&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;Ouml;rneğin bir grup insanın masa başında oturduğu ikinci fotoğraf i&amp;ccedil;in : "a group of people sitting at a table"&lt;/li&gt;
&lt;li&gt;Master Yoda ve Luke Syk Walker'ın&amp;nbsp;yanyana durduğu fotoğraf i&amp;ccedil;in : "a man and a woman looking at the camera" &lt;em&gt;(Biraz daha &amp;ouml;ğrenmesi gerekiyor nitekim hangisi i&amp;ccedil;in Woman dedi anlayamadım. Belki de para vermediğim i&amp;ccedil;in b&amp;ouml;yle dedi)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Kadının garaj kapısındaki arabanın &amp;ouml;n&amp;uuml;nde ayakta durduğu fotoğraf i&amp;ccedil;in : "a car parked on the side of a building"&lt;em&gt; (Kadını yakalayamamış belki ama tanımlayıcı tag'ler i&amp;ccedil;erisinde woman kelimesi yer alıyor)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;&amp;Uuml;nl&amp;uuml; animasyon filmi Cars'ın renkli afişi i&amp;ccedil;in : "a car parked in a parking lot" &lt;em&gt;(olduk&amp;ccedil;a akıllı bir &amp;ouml;neri değil mi? G&amp;uuml;n gelecek karakterlerin isimlerini de tek tek s&amp;ouml;yleyecek)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;ve son olarak Toyota marka&amp;nbsp;arazi aracının olduğu fotoğraf i&amp;ccedil;in : "a group of people riding on the back of a truck"&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Servisin kullanımına ilişkin bir takım &amp;ccedil;alışma zamanı bilgilerini portal &amp;uuml;zerinden de izleyebiliriz. Sonu&amp;ccedil; itibariyle yapılan işlemleri izlemek &amp;ouml;nemli. Ne kadar talep gitti, ka&amp;ccedil;ı başarılı oldu, ka&amp;ccedil;ında hata alında, geriye kalan kullanım haklarımız neler, ne kadar &amp;ouml;dedik vs... Bu &amp;ouml;rnek senaryo i&amp;ccedil;in Overview kısmındaki grafikler başlangı&amp;ccedil; i&amp;ccedil;in yeterli bilgiler vermekte. Benim yaptığım az sayıda denemenin &amp;ccedil;ıktısı aşağıdaki ekran g&amp;ouml;r&amp;uuml;t&amp;uuml;s&amp;uuml;ndeki gibi oldu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/05/comvision_7n.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere Azure'un Cognitive servislerinden olan Computer Vision'ı kullanarak fotoğraflar ile ilgili bir takım bilgileri hesaplatmak olduk&amp;ccedil;a kolay. S&amp;ouml;z gelimi yoğun fotoğraf kullanan bir katalog sisteminde fotoğrafların tag bilgilerinin otomatik olarak &amp;ccedil;ıkartılmasında bu hizmet pekala işe yarayabilir. Arka plandaki AI+ML işbirlikteliği daha da g&amp;uuml;&amp;ccedil;lendik&amp;ccedil;e fotoğrafların yorumlanması daha da iyileşecektir. &amp;Ouml;rneğin bir kamera g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki olası saldırganın otomatik olarak tespit edildiğini bir d&amp;uuml;ş&amp;uuml;nsenize&lt;em&gt;(Aslında ben bu c&amp;uuml;mleyi yazarken b&amp;ouml;yle bir şeyin yapılmadığından emin değilim. Yapılıyor da olabilir. Araştırmam lazım)&lt;/em&gt; Azure tarafında&amp;nbsp;Computer Vision servisinin pek &amp;ccedil;ok gelişmiş fonksiyonu&amp;nbsp;bulunuyor. Bu&amp;nbsp;fonksiyonlarla resimlerin sınıflandırılması, tanımlanması, thumbnail formatlarının oluşturulması,&amp;nbsp;taxonomy&lt;em&gt;(SEO tarafında &amp;ouml;nem arz eden bir konudur ve yazının hazırlandığı tarih itibariyle Microsoft 86 kategori başlığından bahsediyordu)&lt;/em&gt; veya&amp;nbsp;domain bazında kategorilendirilmesi, clip-art stat&amp;uuml;s&amp;uuml;nde olup olmadıklarının berlilenmesi, elle &amp;ccedil;izilip &amp;ccedil;izilmediklerinin anlaşılması, cinsel i&amp;ccedil;erik i&amp;ccedil;ermediğinin tespit edilmesi ve daha bir &amp;ccedil;ok şey m&amp;uuml;mk&amp;uuml;n. İlerleyen zamanlarda elbette yeni fonksiyonellikler de eklenecektir. Dilerseniz siz bu &amp;ouml;rnekten yararlanarak kendi fotoğraf alb&amp;uuml;mlerinizden se&amp;ccedil;tiğiniz g&amp;ouml;r&amp;uuml;nt&amp;uuml;leri Computer Vision'a yorumlatmayı deneyebilirsiniz. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;h3&gt;Kaynaklar:&lt;/h3&gt;
&lt;p&gt;&lt;a href="http://devnot.com/2017/microsoft-cognitive-services-computer-vision-api/" target="_blank"&gt;Cognitive Services (DevNot'tan)&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="https://docs.microsoft.com/en-us/azure/cognitive-services/computer-vision/quickstarts/csharp" target="_blank"&gt;Microsoft'un Quickstart Dok&amp;uuml;manı&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="https://docs.microsoft.com/en-us/azure/cognitive-services/computer-vision/vision-api-how-to-topics/howtocallvisionapi" target="_blank"&gt;Microsoft'un How To Call Vision Api Dok&amp;uuml;manı&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="https://www.microsoft.com/cognitive-services/en-us/computer-vision-api" target="_blank"&gt;Computer Vision API&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2018-05-25 04:46:00</pubDate>
  <slug>azure-azure-bu-fotografta-ne-goruyorsun</slug>
  <tags>
    <tag>azure</tag>
    <tag>cloud-computing</tag>
    <tag>ai</tag>
    <tag>cognitive-services</tag>
    <tag>machine-learning</tag>
    <tag>net</tag>
    <tag>net-core</tag>
    <tag>c#</tag>
    <tag>visual-studio-code</tag>
    <tag>computer-vision</tag>
    <tag>microsoft</tag>
    <tag>rest</tag>
  </tags>
  <categories>
    <category>Azure</category>
  </categories>
</post>