<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Web Bazlı Programlama Modeli</title>
  <description>Web programlama modelinin en büyük avantajlarından biriside istemci(Client) tarafındaki uygulamaları düşünmeye gerek kalmadan istemci-sunucu(Client/Server) mimarisine uygun sistemler geliştirilebilmesidir. Basit olarak HTTP protokolünün farklı metodlarına göre işleyen bu sistemde, istemcilerin farklı tipte olabilecek tarayıcı programlar(Browsers) üzerinden talepte bulunmaları söz konusudur.</description>
  <content>&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Değerli Okurlarım Merhabalar,&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Web programlama modelinin en b&amp;uuml;y&amp;uuml;k avantajlarından biriside istemci(Client) tarafındaki uygulamaları d&amp;uuml;ş&amp;uuml;nmeye gerek kalmadan &lt;strong&gt;istemci-sunucu(Client/Server)&lt;/strong&gt; mimarisine uygun sistemler geliştirilebilmesidir. Basit olarak &lt;strong&gt;HTTP&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml;n farklı metodlarına g&amp;ouml;re işleyen bu sistemde, istemcilerin farklı tipte olabilecek &lt;strong&gt;tarayıcı programlar(Browsers) &lt;/strong&gt;&amp;uuml;zerinden talepte bulunmaları s&amp;ouml;z konusudur. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ouml;zellikle &lt;strong&gt;servis y&amp;ouml;nelimi mimari(Serivce Oriented Architecture)&lt;/strong&gt; yaklaşımlarına bakıldığında &amp;ouml;rneğin Xml Web Servislerinde&lt;strong&gt;(Xml Web Services)&lt;/strong&gt; &lt;strong&gt;HTTP&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml;n basit &lt;strong&gt;GET&lt;/strong&gt; metoduna g&amp;ouml;re taleplerde(Requests) bulunulabilmektedir. Bu istemci tarafına bir &lt;strong&gt;proxy&lt;/strong&gt; nesnesi koymadan servis fonksiyonelliklerini &lt;strong&gt;HTTP&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml;n basit bir metoduna g&amp;ouml;re &amp;ccedil;ağırabilme anlamınada gelmektedir. &lt;em&gt;(Bununla birlikte Web servislerinde &lt;strong&gt;SOAP(Simple Object Access Protocol)&lt;/strong&gt; protokol&amp;uuml;ne uygun olacak şekilde proxy kullanmadan talepte bulunulup cevap alınabileceğide bilinmektedir.)&lt;/em&gt; &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Hal b&amp;ouml;yle olunca &lt;strong&gt;WCF(Windows Communication Foundation)&lt;/strong&gt; gibi gelişmiş bir &lt;strong&gt;dağıtık mimari(Distributed Architecture) &lt;/strong&gt;modelinde Web bazlı servis desteği olmaması d&amp;uuml;ş&amp;uuml;n&amp;uuml;lemez. Ne varki WCF, &amp;ouml;zellikle &lt;strong&gt;.Net Framework 3.5&lt;/strong&gt; ile gelen yeni tipler sayesinde &lt;strong&gt;Web&lt;/strong&gt; &lt;strong&gt;bazlı programlama modeli(Web-Based Programming Model) &lt;/strong&gt;yeteneklerine kavuşmuştur. Bu model temel olarak &lt;strong&gt;SOAP&lt;/strong&gt; bazlı olmayan &lt;strong&gt;EndPoint&lt;/strong&gt; noktalarının tasarlanabilmesini sağlamaktadır. Bu sayede bir WCF servisi istemci tarafını programlamaya gerek kalmadan, basit tarayıcı aray&amp;uuml;zleri sayesinde hizmet verebilmektedir.&lt;em&gt;(Tabi burada POST benzeri metodlarda istisnai bazı durumlar olabileceğide g&amp;ouml;z ardı edilmemelidir).&lt;/em&gt; &amp;Uuml;stelik web programlama modelinin doğası gereği istemciler servis &amp;uuml;zerindeki fonksiyonellikleri kullanırken &lt;strong&gt;queryString&lt;/strong&gt; tarzında parametrik &lt;strong&gt;taleplerde(Requests)&lt;/strong&gt; de bulunabilirler. Web programlama modelinde sağlanması gereken &amp;ouml;nemli bazı hususlar vardır. Buna g&amp;ouml;re;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Modelin &lt;strong&gt;URI(Uniform Resource Identifier)&lt;/strong&gt; desteği olmalıdır. Bu destek s&amp;ouml;z konusu servis operasyonlarının istemci tarafına parametrik olabilecek &lt;strong&gt;şablonlara(template)&lt;/strong&gt; uyan adresler ile sunulabilmesi i&amp;ccedil;in gereklidir.&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;HTTP&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml;n farklı metodları i&amp;ccedil;in destek olmalıdır. G&amp;uuml;n&amp;uuml;m&amp;uuml;zde en &amp;ccedil;ok kullanılanları &lt;strong&gt;GET&lt;/strong&gt; ve &lt;strong&gt;POST&lt;/strong&gt; metodlarıdır. Sadece istemci tarafına veri alma gibi işlemler s&amp;ouml;z konusu olduğunda GET metodu, tam tersine servis tarafına parametreler g&amp;ouml;nderip d&amp;uuml;zenleme, veri aktarma yada operasyon &amp;ccedil;ağırma gibi işlemler s&amp;ouml;z konusu olduğunda POST,&lt;strong&gt;PUT&lt;/strong&gt; gibi metodlar kullanılır.&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Farklı tipte veri formatlarına destek olmalıdır&lt;strong&gt;(Multiple Data Format Support)&lt;/strong&gt;. Bu destek sayesinde &lt;strong&gt;XML(eXtensible Markup Lanugage)&lt;/strong&gt;, &lt;strong&gt;JSON(JavaScript Object Notation)&lt;/strong&gt;, &lt;strong&gt;binary i&amp;ccedil;erikli stream (video, resim, ses dosyası gibi), d&amp;uuml;z metin(Plain Text)&lt;/strong&gt; bazlı veriler kullanılabilmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;WCF Web programlama modeli, servislerin REST(REpresentational State Transefer) tipinde geliştirilebilmesini sağlamaktadır. REST, www(World Wide Web) gibi sistemlerin prensiplerini referans etmektedir. Bu prensipler basit olarak bir network mimarisinin kaynakları nasıl adresleyeceği ve ne şekilde tanımlayacağını belirtmektedir. &lt;a href="http://en.wikipedia.org/wiki/REST"&gt;Detaylı bilgi i&amp;ccedil;in Wikipedia&lt;/a&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Tahmin edileceği &amp;uuml;zere &lt;strong&gt;WCF&lt;/strong&gt; mimarisi &lt;strong&gt;.Net Framework 3.5&lt;/strong&gt; ile gelen tipler sayesinde bu &amp;uuml;&amp;ccedil; temel &amp;ouml;zelliğede destek verecek şekilde genişletilmiştir. WCF mimarisindeki bu yeni genişlemede rol alan başlıca &lt;strong&gt;tipler(Types)&lt;/strong&gt; aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi ele alınabilirler.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk242_1.gif" alt="" width="482" height="382" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;HTTP&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;GET&lt;/strong&gt;, &lt;strong&gt;POST, PUT&lt;/strong&gt; gibi metodlar ile gelen &amp;ccedil;ağrıları &lt;strong&gt;y&amp;ouml;netimli kod(Managed Code)&lt;/strong&gt; tarafında ele almak i&amp;ccedil;in &lt;strong&gt;WebGetAttribute&lt;/strong&gt; ve &lt;strong&gt;WebInvokeAttribute nitelik(attribute) &lt;/strong&gt;sınıflarından yararlanılmaktadır. Bu nitelikler temel olarak, operasyonların &lt;strong&gt;URI&lt;/strong&gt; bilgilerine nasıl bağlanacağını ve hangi &lt;strong&gt;HTTP&lt;/strong&gt; metodları ile eşleştirileceğini belirlemekte kullanılırlar.&amp;nbsp;WebGetAttribute niteliği &lt;strong&gt;GET&lt;/strong&gt; operasyonları i&amp;ccedil;in ele alınırken, &lt;strong&gt;WebInvokeAttribute&lt;/strong&gt; &lt;strong&gt;POST, DELETE, PUT&lt;/strong&gt; gibi operasyonların kullanımını sağlamaktadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;table id="table161" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;em&gt;&lt;strong&gt;HTTP&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;POST&lt;/strong&gt;, &lt;strong&gt;GET&lt;/strong&gt;, &lt;strong&gt;PUT&lt;/strong&gt;, &lt;strong&gt;DELETE&lt;/strong&gt; metodları kullanılır. Bu metodların işleyiş şekli &amp;ccedil;oğu zaman &lt;strong&gt;CRUD&lt;/strong&gt; tablosunda aşağıdaki gibi ifade edilir.&lt;/em&gt;&lt;br /&gt; &amp;nbsp;&lt;/span&gt;&lt;/span&gt;
&lt;table style="border-collapse: collapse; width: 229px;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td bgcolor="#336699" width="155"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt; &lt;span style="font-family: Verdana;"&gt;CRUD&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="155"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Create, Update, Delete&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="155"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Read&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="155"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Delete&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="155"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Create, Update&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;WebGetAttribute&lt;/strong&gt; sınının d&amp;ouml;rt &amp;ouml;nemli &lt;strong&gt;&amp;ouml;zelliği(property)&lt;/strong&gt; vardır. &lt;strong&gt;WebMessageBodyStyle&lt;/strong&gt; enum sabiti tipinden olan &lt;strong&gt;BodyStyle&lt;/strong&gt; &amp;ouml;zelliği yardımıyla parametre ve d&amp;ouml;n&amp;uuml;ş değerlerinin &lt;strong&gt;XML&lt;/strong&gt; elementleri i&amp;ccedil;eriğine &lt;strong&gt;sarmalanıp(wrap)&lt;/strong&gt; sarmalanmayacağına karar verilir. &lt;strong&gt;WebMessageBodyStyle&lt;/strong&gt; enum sabitinin i&amp;ccedil;erdiği değerler &lt;strong&gt;Bare&lt;/strong&gt;, &lt;strong&gt;WrappedRequest&lt;/strong&gt;, &lt;strong&gt;WrappedResponse&lt;/strong&gt; ve &lt;strong&gt;Wrapped&lt;/strong&gt;' dır. Bare değerine g&amp;ouml;re &lt;strong&gt;talep(request)&lt;/strong&gt; ve &lt;strong&gt;cevap(response)&lt;/strong&gt; mesajlarındaki veriler sarmalanmazlar. &lt;strong&gt;Wrapped&lt;/strong&gt; değerine g&amp;ouml;re her iki haldede sarmalanırlar. &lt;strong&gt;WrappedRequest&lt;/strong&gt; değerine g&amp;ouml;re sadece taleplerin sarmalanması, &lt;strong&gt;WrappedResponse&lt;/strong&gt; değerine g&amp;ouml;re ise sadece cevapların sarmalanması s&amp;ouml;z konusudur. &lt;strong&gt;WebGetAttribute&lt;/strong&gt; sınıfının diğer &amp;ouml;zellikleri &lt;strong&gt;RequestFormat&lt;/strong&gt;, &lt;strong&gt;ResponseFormat&lt;/strong&gt; ve &lt;strong&gt;UriTemplate&lt;/strong&gt; &amp;uuml;yeleridir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;RequestFormat&lt;/strong&gt; ve &lt;strong&gt;ResponseFormat&lt;/strong&gt; &amp;ouml;zellikleri &lt;strong&gt;WebMessageFormat&lt;/strong&gt; &lt;strong&gt;enum&lt;/strong&gt; sabiti tipinden değerler almaktadır. WebMessageFormat enum sabitinin değerleri &lt;strong&gt;XML&lt;/strong&gt; veya &lt;strong&gt;JSON(JavaScript Object Notation)&lt;/strong&gt; olabilir. Bir başka deyişle cevapların ve taleplerin hangi formatta oluşturulacağına karar verilir. &lt;strong&gt;WebGetAttribute&lt;/strong&gt; sınıfının belkide en &amp;ouml;nemli &amp;uuml;yeside &lt;strong&gt;UriTemplate&lt;/strong&gt; &amp;ouml;zelliğidir. Bu &amp;ouml;zelliğe atanan değer ile &lt;strong&gt;GET&lt;/strong&gt; &amp;ccedil;ağrımı i&amp;ccedil;in bir &lt;strong&gt;URI&lt;/strong&gt; &lt;strong&gt;şablonu(template)&lt;/strong&gt; belirlenmiş olur. &lt;strong&gt;WebInvokeAttribute&lt;/strong&gt; sınıfıda &lt;strong&gt;WebGetAttribute&lt;/strong&gt; sınıfı ile aynı &amp;ouml;zelliklere sahiptir. Nitekim birde ek &amp;ouml;zelliği vardır ki buda &lt;strong&gt;Method&lt;/strong&gt; isimli &amp;uuml;yedir. Method &amp;ouml;zelliği &lt;strong&gt;string&lt;/strong&gt; bazlıdır ve &lt;strong&gt;POST&lt;/strong&gt;, &lt;strong&gt;DELETE&lt;/strong&gt; yada &lt;strong&gt;PUT&lt;/strong&gt; gibi &lt;strong&gt;HTTP&lt;/strong&gt; metodlarını g&amp;ouml;stermektedir. Bu &amp;ouml;zelliğin varsayılan değeri &lt;strong&gt;POST&lt;/strong&gt; olarak belirlenmiştir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Web programlama modelinde yer alan &amp;ouml;nemli tiplerden bir diğeride &lt;strong&gt;WebHttpBinding&lt;/strong&gt; sınıfıdır. Bu &lt;strong&gt;bağlayıcı tip(Binding Type)&lt;/strong&gt; ile servis &lt;strong&gt;EndPoint&lt;/strong&gt; noktalarının, &lt;strong&gt;SOAP&lt;/strong&gt; bazlı mesajlaşma yerine &lt;strong&gt;POX(Plain Old Xml) &lt;/strong&gt;bazlı mesajlaşmaya izin verecek şekilde &amp;ccedil;alışması sağlanmaktadır. Buna g&amp;ouml;re &lt;strong&gt;Web bazlı EndPoint(Web-Based EndPoint) &lt;/strong&gt;noktalarının &lt;strong&gt;POX(Plain Old XML)&lt;/strong&gt; bazlı mesajlaşma yaptığı s&amp;ouml;ylenebilir. Diğer taraftan bu bağlayıcı tip &lt;strong&gt;XML&lt;/strong&gt;,&lt;strong&gt;JSON&lt;/strong&gt; ve anlaşılması g&amp;uuml;&amp;ccedil; &lt;strong&gt;binary&lt;/strong&gt; tipteki(&amp;ccedil;oğunlukla video, resim gibi) verilerin okunması ve yazılması amacıyla kullanılmaktadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;WCF Web programlama modeli SOAP(Simple Object Access Protocol) bazlı mesajlaşmayı kullanmadığından WS-* protokollerini desteklemez. Ancak WCF mimarisinin aynı servis &amp;uuml;zerinde birden fazla EndPoint konuşlandırabilme &amp;ouml;zelliği nedeni ile SOAP destekli olan ve olmayan EndPoint noktalarının bir arada kullanılması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bir başka deyişle bir servisin ilgili operasyonları WS-* destekli olacak şekilde bir EndPoint &amp;uuml;zerinden sunulurken, aynı servis &amp;uuml;zerindeki diğer bir EndPoint Web programlama modelini ele alabilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;WebServiceHost&lt;/strong&gt; sınıfı &lt;strong&gt;SOAP&lt;/strong&gt; bazlı olmayan web stilindeki servislerin host edilmesi i&amp;ccedil;in &lt;strong&gt;ServiceHost&lt;/strong&gt; tipinden t&amp;uuml;retilmiştir. Eğer servisi host eden uygulamada &amp;ccedil;alıştırılan &lt;strong&gt;WebServiceHost&lt;/strong&gt; nesne &amp;ouml;rneği, Web bazlı herhangibir &lt;strong&gt;EndPoint&lt;/strong&gt; bulamassa otomatik olarak bir tane &amp;uuml;retecektir. Bu &amp;uuml;retim sırasında &lt;strong&gt;servis adresini(Base Address) &lt;/strong&gt;baz alan bir &lt;strong&gt;EndPoint&lt;/strong&gt; noktası oluşturulur. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Web programlama modelinde yer alan yardımcı tiplerden &lt;strong&gt;UriTemplate&lt;/strong&gt; ve &lt;strong&gt;UriTemplateTable&lt;/strong&gt; son derece &amp;ouml;nemli g&amp;ouml;revler &amp;uuml;stlenmektedir. Herşeyden &amp;ouml;nce &lt;strong&gt;HTTP&lt;/strong&gt; bazlı talepler servis operasyonlarına ulaştıklarında bir &lt;strong&gt;URI&lt;/strong&gt; tarafından karşılanmalıdır. Bu URI bilgilerinin &lt;strong&gt;y&amp;ouml;netimli kod (Managed Code) &lt;/strong&gt;tarafında ifade edilmesinde s&amp;ouml;z konusu tipler g&amp;ouml;rev almaktadır. &lt;strong&gt;URI şablonları(URI Templates)&lt;/strong&gt; temelde &lt;strong&gt;path&lt;/strong&gt; ve &lt;strong&gt;query&lt;/strong&gt; olmak &amp;uuml;zere iki temel par&amp;ccedil;adan oluşurlar. S&amp;ouml;z gelimi aşağıdaki şekilde bazı &amp;ouml;rnek URI şablonları yer almaktadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk242_2.gif" alt="" width="606" height="160" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Burada sol taraftaki kutucukta ger&amp;ccedil;ek kullanımlar yer alırken sağ taraftada karşılık gelen &lt;strong&gt;URI&lt;/strong&gt; şablonları g&amp;ouml;r&amp;uuml;lmektedir. S&amp;uuml;sl&amp;uuml; parantezler i&amp;ccedil;erisinde yer alan kısımlar değişken olmakla birlikte diğer kısımlar sabittir. Elbette bu URI' lerin başında birde &lt;strong&gt;base URI address&lt;/strong&gt; bilgisi gelmektedir. &lt;strong&gt;UriTemplate&lt;/strong&gt; sayesinde bir &lt;strong&gt;URI&lt;/strong&gt; şablonunun kolay bir şekilde oluşturulması, var olan bir ger&amp;ccedil;ek &lt;strong&gt;URL&lt;/strong&gt; adresi ile &lt;strong&gt;eşleştirilmesi(Match) &lt;/strong&gt;gibi işlemler yapılabilir. &lt;strong&gt;UriTemplate&lt;/strong&gt; tipi &amp;ccedil;oğunlukla &lt;strong&gt;WebGetAttribute&lt;/strong&gt; yada &lt;strong&gt;WebInvokeAttribute&lt;/strong&gt; nitelikleri ile kullanılır. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ccedil;ok doğal olarak bir servisin sunabileceği birden fazla URI şablonu ve dolayısıyla &lt;strong&gt;UriTemplate&lt;/strong&gt; nesnesi s&amp;ouml;z konusu olabilir. Birden fazla UriTemplate tipinin bir arada daha kolay y&amp;ouml;netebilmek i&amp;ccedil;inde &lt;strong&gt;UriTemplateTable&lt;/strong&gt; isimli sınıf kullanılmaktadır. Bu iki tipin kullanımı &amp;ouml;nem arz ettiği i&amp;ccedil;in basit bir &lt;strong&gt;Console&lt;/strong&gt; uygulması &amp;uuml;zerinde fonksiyonelliklerini incelemekte yarar vardır. Bu ama&amp;ccedil;la &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; ortamında .&lt;strong&gt;Net&lt;/strong&gt; &lt;strong&gt;Framework 3.5 &lt;/strong&gt;şablonunda bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması a&amp;ccedil;tığımızı ve &lt;strong&gt;System.ServiceModel.Web.dll assembly&lt;/strong&gt;' ını ilgili projeye referans ettiğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu assembly tahmin edileceği &amp;uuml;zere Web programlama modeli i&amp;ccedil;in gerekli temel tipleri b&amp;uuml;nyesinde barındırmaktadır. Aşağıdaki kod par&amp;ccedil;ası basit olarak &lt;strong&gt;UriTemplate&lt;/strong&gt; tipinin kullanımını &amp;ouml;rneklemektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.ServiceModel.Web;
using System.Collections.Specialized;

namespace YardimciTipler
{
    class Program
    {
        static void Main(string[] args)
        {
            #region UriTemplate Kullanımı

            // Yeni bir URI şablonu oluşturulurken s&amp;uuml;sl&amp;uuml; parantezler i&amp;ccedil;erisinde yer alan verilen değişken diğerleri ise sabittir.
            UriTemplate uriTemp = new UriTemplate("satislar/{sehirAdi}/{ilceAdi}?tarih={satisTarihi}"); 

            // değişkenlerin pozisyonuna g&amp;ouml;re bağlama
            // Bu metod ile s&amp;uuml;sl&amp;uuml; parantezler i&amp;ccedil;erisine gelecek veriler sıralı olarak eklenirler
            Uri uri1 = uriTemp.BindByPosition(new Uri("http://localhost"), "Istanbul", "Kadık&amp;ouml;y", "2007");

            // değişkenlerin adlarına g&amp;ouml;re bağlama
            // Bu metodda parametre adı - değeri eşleştirmesi bilgilerini taşıyan NameValueCollection koleksiyonu kullanılır.
            NameValueCollection values = new NameValueCollection()
                    {
                        {"sehirAdi","Ankara"}
                        ,{"ilceAdi","Esenboğa"}
                        ,{"satisTarihi","2007"}
                    };
            Uri uri2 = uriTemp.BindByName(new Uri("http://www.bsenyurt.com/servisler"), values);
        
            // Eşleştirme yapmak ve doğruluğunu tespit etmek
            Uri uri3 = new Uri("http://localhost/satislar/Istanbul/Besiktas?tarih=2008");
            // Eğer Match metodu geriye null değer d&amp;ouml;nd&amp;uuml;rmemişse URI i&amp;ccedil;eriği şablonda belirtilene uygundur.
            UriTemplateMatch match=uriTemp.Match(new Uri("http://localhost/"), uri3);
            if (match != null)
                Console.WriteLine("Match ge&amp;ccedil;erlidir");

            #endregion
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnektende g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere bir &lt;strong&gt;UriTemplate&lt;/strong&gt; nesnesi &amp;ouml;rneklendiğinde &amp;ccedil;oğunlukla bir &lt;strong&gt;URI&lt;/strong&gt; şablonuda tanımlar. Sonrasında bu şablonda yer alan parametrelere değer aktarımı i&amp;ccedil;in &lt;strong&gt;BindByPosition&lt;/strong&gt; yada &lt;strong&gt;BindByName&lt;/strong&gt; gibi metodlar kullanılabilir. Diğer taraftan bir &lt;strong&gt;URI&lt;/strong&gt; bilgisinin, &lt;strong&gt;UriTemplate&lt;/strong&gt; ile belirtilen şablona uygunluğunu denetlemek i&amp;ccedil;in &lt;strong&gt;Match&lt;/strong&gt; metodundan yararlanılabilir. &lt;em&gt; (&lt;strong&gt;BindByName&lt;/strong&gt; metodunun uygulanışı sırasında &lt;strong&gt;C# 3.0 object&lt;/strong&gt; &lt;strong&gt;initializers&lt;/strong&gt; &amp;ouml;zelliğinden yararlanıldığınada dikkat edelim.)&lt;/em&gt; Diğer taraftan aşağıdaki kod par&amp;ccedil;asında da basit olarak &lt;strong&gt;UriTemplateTable&lt;/strong&gt; kullanımı &amp;ouml;rneklenmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.ServiceModel.Web;
using System.Collections.Specialized;

namespace YardimciTipler
{
    class Program
    {
        static void Main(string[] args)
        {
            #region UriTemplateTable Kullanımı

            // UriTemplateTable yardımıyla birden fazla UriTemplate' in tek saklanması ve bir arada tutulması sağlanabilir. 
            UriTemplateTable uriTable = new UriTemplateTable(new Uri("http://localhost"));

            // UriTemplate' ler tamamı KeyValuePairs &amp;ouml;zelliği ile işaret edilen koleksiyonda tutulurlar.
            uriTable.KeyValuePairs.Add(new KeyValuePair&amp;lt;UriTemplate, object&amp;gt;(new UriTemplate("satislar/{Sehir}/{Ilce}"), "IlceBazli"));
            uriTable.KeyValuePairs.Add(new KeyValuePair&amp;lt;UriTemplate,object&amp;gt;(new UriTemplate("satislar/{Sehir}/{Ilce}?tarih={SatisTarihi}"),"SatisBazli"));
            uriTable.KeyValuePairs.Add(new KeyValuePair&amp;lt;UriTemplate,object&amp;gt;(new UriTemplate("satislar/{Sehir}/{Ilce}?yetkili={Yetkili}"),"YetkiliBazlı"));
            uriTable.KeyValuePairs.Add(new KeyValuePair&amp;lt;UriTemplate, object&amp;gt;(new UriTemplate("satislar/*"), "TumSatislar"));

            foreach (KeyValuePair&amp;lt;UriTemplate, object&amp;gt; kv in uriTable.KeyValuePairs)
            {
                Console.WriteLine("{0} : \t {1}", kv.Value, kv.Key);
            }
            #endregion
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;UriTemplateTable&lt;/strong&gt; sınıfı &lt;strong&gt;UriTemplate&lt;/strong&gt; &amp;ouml;rneklerini &lt;strong&gt;KeyValuePairs&lt;/strong&gt; isimli &amp;ouml;zelliğin işaret ettiği koleksiyonda saklamaktadır. Yukarıdaki kod par&amp;ccedil;asına &amp;ccedil;alışma zamanında &lt;strong&gt;debug&lt;/strong&gt; modda bakıldığında &lt;strong&gt;uriTable&lt;/strong&gt; isimli değişkenin i&amp;ccedil;eriğinin aşağıdaki gibi olduğu g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk242_3.gif" alt="" width="617" height="217" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Web&lt;/strong&gt; stilinde tasarlanan servisler bir tarayıcı uygulama yardımıyla &lt;strong&gt;URL&lt;/strong&gt; bazında &amp;ccedil;ağırılabilirler. URL &amp;uuml;zerinden servis tarafına gelecek olan web bazlı taleplerde kullanılan parametrelerinin veri formatlarıda &amp;ouml;nemlidir. Bunlar aynı zamanda &amp;ccedil;ağırılan operasyonların geri d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml; değer tipleri i&amp;ccedil;inde &amp;ouml;nemlidir. Kullanılabilecek veri formatları &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Byte&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;SByte&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Int16&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Int32&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Int64&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;UInt16&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;UInt32&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;UInt64&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Single&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Double&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Char&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Decimal&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Boolean&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;String&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;DateTime&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;TimeSpan&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Guid&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;DateTimeOffset&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Enums&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;li&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;TypeConverterAttribute&lt;/strong&gt; niteliğini uygulayan&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;tipler olabilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;WCF Web programlama modelinde dikkat edilmesi gereken noktalardan biriside g&amp;uuml;venlik(Security) dir. Bu modele g&amp;ouml;re g&amp;uuml;venlik sadece HTTPS şeklinde yani iletişim(transport) seviyesinde sağlanabilir. Bunun nedeni Web tabanlı WCF modelinin SOAP zarflarını(Envelope) kullanmayışıdır. Normal şartlarda mesaj seviyesinde(Message Level Security) g&amp;uuml;venlik uygulandığında g&amp;uuml;venlik ile ilişkili bazı bilgiler SOAP zarflarında yer alan başlık(Header) kısmına yazılır. Oysaki web bazlı modelde bu tip bir alan yoktur. Dolayısıyla sadece iletişim seviyesinde g&amp;uuml;venlik uygulanabilmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Artık Web bazlı &amp;ouml;rnek bir servis geliştirerek devam edebiliriz. İlk olarak &lt;strong&gt;servis s&amp;ouml;zleşmesini(Service Contract) &lt;/strong&gt;ve uygulayıcı tipi barındıracak olan &lt;strong&gt;WCF servis k&amp;uuml;t&amp;uuml;phanesini(WCF Service Library) &lt;/strong&gt;geliştirmekte yarar vardır. S&amp;ouml;z konusu k&amp;uuml;t&amp;uuml;phanenin Web tabanlı model tiplerini kullanabilmesi i&amp;ccedil;in doğal olarak &lt;strong&gt;System.ServiceModel.Web.dll assembly&lt;/strong&gt;' ını referans etmesi gerekmektedir. S&amp;ouml;z konusu k&amp;uuml;t&amp;uuml;phanedeki tiplerin aşağıdaki gibi tasarlandığı varsayılabilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk242_4.gif" alt="" width="546" height="456" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;IUrunHizmetleri&lt;/strong&gt; isimli servis s&amp;ouml;zleşmesi &lt;strong&gt;int&lt;/strong&gt;, &lt;strong&gt;double&lt;/strong&gt;, &lt;strong&gt;DataSet&lt;/strong&gt;, &lt;strong&gt;Urun&lt;/strong&gt; tipinden değerler d&amp;ouml;nd&amp;uuml;ren operasyonlar tanımlamaktadır. Aynı zamanda &lt;strong&gt; WebInvoke&lt;/strong&gt; &lt;strong&gt;niteliğinin(attribute)&lt;/strong&gt; kullanımını &amp;ouml;rneklemek amacıyla değer d&amp;ouml;n&amp;uuml;rmeyen bir operasyon daha tanımlamaktadır. &lt;strong&gt;UrunCek&lt;/strong&gt; isimli operasyon geriye &lt;strong&gt;Urun&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneği d&amp;ouml;nd&amp;uuml;rmektedir. Urun sınıfının i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[DataContract]
public class Urun
{
    [DataMember]
    public int Id;
    [DataMember]
    public string Name;
    [DataMember]
    public double ListPrice;
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Urun&lt;/strong&gt; sınıfı basit olarak Product tablsoundaki belirli bir satırın ProductId,Name ve ListPrice alanlarının değerlerini taşımak &amp;uuml;zere tasarlanmıştır. &amp;Ccedil;ok doğal olarak Urun nesne &amp;ouml;rneği &lt;strong&gt;serileşme(Serialization)&lt;/strong&gt; işlemine tabi tutulacağından &lt;strong&gt; DataContract&lt;/strong&gt; ve &lt;strong&gt;DataMember&lt;/strong&gt; nitelikleri(attributes) ile imzalanmıştır. Bir başka deyişle bir &lt;strong&gt;veri s&amp;ouml;zleşmesi(Data Contract)&lt;/strong&gt; tanımlanmaktadır. &lt;strong&gt;Servis s&amp;ouml;zleşmesini(Service Contract)&lt;/strong&gt; taşıyan IUrunHizmetleri&lt;strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n(Interface)&lt;/strong&gt; i&amp;ccedil;eriği ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[ServiceContract]
public interface IUrunHizmetleri
{
    [OperationContract]
    [WebGet(UriTemplate="urunler/{altkategoriId}")] 
    DataSet UrunListesi(string altKategoriId);

    [OperationContract]
    [WebGet]
    Urun UrunCek(int urunId);

    [OperationContract]
    [WebInvoke(UriTemplate="guncelle?sinifi={sinifi}&amp;amp;altKategori={altKategoriId}")]
    void UrunGuncelle(string sinifi, int altKategoriId);

    [OperationContract]
    [WebGet(UriTemplate="toplamaIslemi?sayi1={x}&amp;amp;sayi2={y}")]
    int Toplam(int x, int y);

    [OperationContract]
    [WebGet(UriTemplate="toplam?kategori={altKategoriId}")]
    double ToplamFiyat(int altKategoriId);
}&lt;/pre&gt;
&lt;p&gt;UrunListesi isimli operasyon geriye &lt;strong&gt; DataSet&lt;/strong&gt; d&amp;ouml;nd&amp;uuml;rmektedir. Bu DataSet i&amp;ccedil;eriği &amp;uuml;r&amp;uuml;nlerin alt kategori değerine g&amp;ouml;re elde edilmektedir. S&amp;ouml;z konusu operasyon &lt;strong&gt;HTTP GET &lt;/strong&gt; metoduna g&amp;ouml;re talep edilebilir. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;WebGet&lt;/strong&gt; niteliğinin &lt;strong&gt;UriTemplate&lt;/strong&gt; &amp;ouml;zelliğinde s&amp;uuml;sl&amp;uuml; parantezler i&amp;ccedil;erisinde metod parametresi ile aynı isimde olacak şekilde bir tanımlama yapılmaktadır. UrunCek operasyonu geriye Urun tipinden bir nesne &amp;ouml;rneği d&amp;ouml;nd&amp;uuml;rmekle birlikte urunId değeri queryString &amp;uuml;zerinden alınmaktadır. &lt;strong&gt;WebGet&lt;/strong&gt; niteliğinde &lt;strong&gt;UriTemplate&lt;/strong&gt; kullanılmaması nedeniyle talepte &lt;strong&gt;UrunCek?urunId=1&lt;/strong&gt; gibi bir adres kullanılmalıdır.&lt;/p&gt;
&lt;p&gt;Bir başka deyişle &lt;strong&gt;WebGet&lt;/strong&gt; niteliğinde &lt;strong&gt;UriTemplate&lt;/strong&gt; kullanılmadığı durumlarda, &lt;strong&gt; MetodAdı?parametreAdı1=değeri1&amp;amp;parametreAdı2=değeri2 &lt;/strong&gt;tarzı adresler ile talepte bulunulabilinir. UrunGuncelle isimli operasyon, i&amp;ccedil;erisinde sinifi ve altKategori queryString parametrelerini bulunduran adres taleplerine &lt;strong&gt;HTTP POST&lt;/strong&gt; metoduna g&amp;ouml;re cevap verecek şekilde tanımlanmaktadır. Bu sebepten dolayı &lt;strong&gt;URL&lt;/strong&gt; satırından bir bilgi g&amp;ouml;nderilmesine gerek yoktur. Toplam operasyonu &lt;strong&gt;URI&lt;/strong&gt; bilgisi i&amp;ccedil;erisinde birden fazla &lt;strong&gt;queryString&lt;/strong&gt; parametresini ele alıp basit bir veri tipini geriye d&amp;ouml;nd&amp;uuml;recek şekilde tasarlanmıştır. Benzer şekilde ToplamFiyat operasyonuda belirli bir alt kategerideki &amp;uuml;r&amp;uuml;nlerin toplam liste fiyatı değerini bulacak bir fonksiyonelliği tanımlamaktadır. S&amp;ouml;z konusu &lt;strong&gt;servis s&amp;ouml;zleşmesini(Service Contract)&lt;/strong&gt; uygulayan sınıfın i&amp;ccedil;eriği ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class UrunHizmetleri 
     : IUrunHizmetleri
{
    string conStr = "data source=.;database=AdventureWorks;integrated security=SSPI";
    #region IUrunHizmetleri Members

    public DataSet UrunListesi(string altKategoriId)
    {
        DataSet set = null;
        using (SqlConnection conn = new SqlConnection(conStr))
        {
            SqlCommand cmd = new SqlCommand("Select ProductId,Name,ListPrice,ProductSubCategoryId,Class,SellStartDate From Production.Product Where ProductSubCategoryId=@SubCatId",     conn);
            cmd.Parameters.AddWithValue("@SubCatId", altKategoriId);
            SqlDataAdapter adapter = new SqlDataAdapter(cmd);
            set = new DataSet();
            adapter.Fill(set);
        }
        return set;
    }

    public Urun UrunCek(int urunId)
    {
        Urun u = null;
        using (SqlConnection conn = new SqlConnection(conStr))
        {
            SqlCommand cmd = new SqlCommand("Select ProductId,Name,ListPrice From Production.Product Where ProductId=@PrdId", conn);
            cmd.Parameters.AddWithValue("@PrdId", urunId);
            conn.Open();
            SqlDataReader reader = cmd.ExecuteReader();
            if (reader.Read())
            {
                u = new Urun()
                        {
                            Id=urunId
                            ,Name=reader["Name"].ToString()
                            , ListPrice=Convert.ToDouble(reader["ListPrice"])
                        };
            }
            reader.Close();
        }
        return u;
    }

    public void UrunGuncelle(string sinifi, int altKategoriId)
    {
        using (SqlConnection conn = new SqlConnection(conStr))
        {
            SqlCommand cmd = new SqlCommand("Update Production.Product Set ListPrice=ListPrice+1 Where Class=@Class and ProductSubCategoryId=@SubCatId", conn);
            cmd.Parameters.AddWithValue("@Class", sinifi);
            cmd.Parameters.AddWithValue("@SubCatId", altKategoriId);
            conn.Open();
            cmd.ExecuteNonQuery();
        }
    }

    public int Toplam(int x, int y)
    {
        return x + y;
    }

    public double ToplamFiyat(int altKategoriId)
    {
        double result = 0;
        using (SqlConnection conn = new SqlConnection(conStr))
        {
            SqlCommand cmd = new SqlCommand("Select Sum(ListPrice) From Production.Product Where ProductSubCategoryId=@SubCatId", conn);
            cmd.Parameters.AddWithValue("@SubCatId", altKategoriId);
            conn.Open();
            result =Convert.ToDouble(cmd.ExecuteScalar());
        }
        return result;
    }

    #endregion
}&lt;/pre&gt;
&lt;p&gt;UrunHizmetleri isimli sınıf i&amp;ccedil;erisinde yer alan operasyon uyarlamalarının &amp;ccedil;oğu &lt;strong&gt;AdventureWorks&lt;/strong&gt; veritabanında yer alan &lt;strong&gt;Production.Product&lt;/strong&gt; tablosu &amp;uuml;zerinden &amp;ccedil;alışmaktadır. D&amp;ouml;n&amp;uuml;ş tipleri i&amp;ccedil;in &amp;ouml;nemli olan serileşebilmeleridir. Şimdi bu servis k&amp;uuml;t&amp;uuml;phanesini sunacak olan basit bir &lt;strong&gt;host&lt;/strong&gt; uygulama yazılabilir. Bu ama&amp;ccedil;la bir &lt;strong&gt;Console&lt;/strong&gt; projesi g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Sunucu uygulamanın&lt;strong&gt; System.ServiceModel.Web.dll&lt;/strong&gt;, &lt;strong&gt; System.ServiceModel.dll assembly&lt;/strong&gt;' ları haricinde &lt;strong&gt;servis s&amp;ouml;zleşmesini(Service Contract)&lt;/strong&gt; ve uygulayıcı tipi barındıran k&amp;uuml;t&amp;uuml;phaneyide&lt;strong&gt;(WCF Service Library)&lt;/strong&gt; referans etmesi gerekmektedir. Bu işlemlerin ardından Host uygulama kodları aşağıdaki gibi geliştirilebilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using UrunLib;
using System.ServiceModel.Web;
using System.ServiceModel;
using System.ServiceModel.Description;

namespace Sunucu
{
    class Program
    {
        static void Main(string[] args)
        {
            WebServiceHost host = new WebServiceHost(typeof(UrunHizmetleri), new Uri("http://localhost:60001/"));
            ServiceEndpoint ep=host.AddServiceEndpoint(typeof(IUrunHizmetleri), new WebHttpBinding(), "");

            host.Opened += delegate(object sender, EventArgs e)
                                {
                                    Console.WriteLine("Servis a&amp;ccedil;ık");
                                };
            host.Closed += delegate(object sender, EventArgs e)
                                {
                                    Console.WriteLine("Servis kapatıldı");
                                };

            host.Open(); 

            Console.WriteLine("Kapatmak i&amp;ccedil;in bir tuşa basın");
            Console.ReadLine();
            host.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İlk olarak bir adet &lt;strong&gt;WebServiceHost&lt;/strong&gt; nesnesi &amp;ouml;rneklenmektedir. &lt;strong&gt;WebServiceHost&lt;/strong&gt; sınıfının &lt;strong&gt;yapıcı metoduna(Constructor)&lt;/strong&gt; parametre olarak s&amp;ouml;zleşmeyi uygulayan &lt;strong&gt;sınıf tipi(Class Type)&lt;/strong&gt; ve yayınlanacağı adres bilgisi verilmektedir. Sonrasında zorunlu olmamakla birlikte &lt;strong&gt;WebHttpBinding&lt;/strong&gt; bağlayıcı tipini barındıran bir &lt;strong&gt;EndPoint&lt;/strong&gt; host isimli WebServiceHost nesne &amp;ouml;rneğine eklenmektedir. Diğer &lt;strong&gt;EndPoint&lt;/strong&gt; tanımlamalarında olduğu gibi &amp;ouml;nce &lt;strong&gt;servis s&amp;ouml;zleşmesi(Service Contract)&lt;/strong&gt;, sonrasında &lt;strong&gt; bağlayıcı tip(Binding Type)&lt;/strong&gt; bildirilir. &lt;strong&gt;Servis adresi(Service Address)&lt;/strong&gt; ise zaten host nesnesi &amp;ouml;rneklenirken tanımlandığı i&amp;ccedil;in boş ge&amp;ccedil;ilebilir. Bu işlemlerin ardından servis &lt;strong&gt;Open&lt;/strong&gt; metodu ile a&amp;ccedil;ılır. Eğer yazılan kodlarda herhangibir aksilik yoksa uygulamanın &amp;ccedil;alışma zamanı g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdakine benzer olmalıdır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk242_5.gif" alt="" width="389" height="125" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Artık &lt;strong&gt;HTTP GET&lt;/strong&gt; metodu bazlı taleplerde bulunulabiliriz. S&amp;ouml;z konusu &lt;strong&gt;talepleri(Request)&lt;/strong&gt; basit bir &lt;strong&gt;tarayıcı(Browser)&lt;/strong&gt; uygulaması yardımıyla ger&amp;ccedil;ekleştirmek m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Elbette istemcilerin &lt;strong&gt;cevap(Response)&lt;/strong&gt; alabilmeleri i&amp;ccedil;in Host uygulamanında &amp;ccedil;alışıyor olması şarttır. Aşağıda s&amp;ouml;z konuzu operasyon &amp;ccedil;ağrıları ve ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;leri yer almaktadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;table style="border-collapse: collapse; width: 100%;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Toplama işlemi i&amp;ccedil;in yapılan &amp;ccedil;ağrı ; http://localhost:60001/ToplamaIslemi?sayi1=4&amp;amp;sayi2=6 &lt;/strong&gt;&lt;em&gt;(4 ve 6 sayılarının toplamı geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmektedir)&lt;/em&gt;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk242_6.gif" alt="" width="572" height="139" border="0" /&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;UrunListesi operasyonu i&amp;ccedil;in yapılan &amp;ccedil;ağrı ;&lt;/strong&gt; &lt;strong&gt; http://localhost:60001/urunler/1&lt;/strong&gt; &lt;em&gt;(1 numaralı ProductSubCategoryId değerine sahip &amp;uuml;r&amp;uuml;nlerin &lt;strong&gt;DataSet&lt;/strong&gt; i&amp;ccedil;erisinde toplanmış listesini verir)&lt;/em&gt;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk242_7.gif" alt="" width="625" height="567" border="0" /&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;UrunCek isimli metoda yapılan &amp;ccedil;ağrı ;&lt;/strong&gt; &lt;strong&gt; http://localhost:60001/UrunCek?urunId=1 &lt;/strong&gt;&lt;em&gt;(ProductId alanı değeri 1 olan Product tablosu satırının i&amp;ccedil;eriği Urun tipine g&amp;ouml;re &amp;ccedil;ekilir)&lt;/em&gt;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk242_8.gif" alt="" width="526" height="222" border="0" /&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;ToplamFiyat operasyonu i&amp;ccedil;in yapılan &amp;ccedil;ağrı ;&lt;/strong&gt; &lt;strong&gt; http://localhost:60001/toplam?kategori=1&lt;/strong&gt; &lt;em&gt; (ProductSubCategoryId değeri 1 olan &amp;uuml;r&amp;uuml;nlerin ListPrice alanlarının toplamı elde edilir.)&lt;/em&gt;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk242_9.gif" alt="" width="625" height="161" border="0" /&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Tabi sunucunun &lt;span style="text-decoration: underline;"&gt;&amp;ccedil;alışmaması&lt;/span&gt; halinde gelecek olan istemci taleplerinde aşağıdaki gibi ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;leri ile karşılaşılabilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk242_10.gif" alt="" width="455" height="278" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;URL&lt;/strong&gt; bazlı olacak şekilde servis operasyonları &amp;ccedil;ağırılabilmekte ve sonu&amp;ccedil;ları alınabilmektedir. Gelelim UrunGuncelle isimli metodun test edilmesine. Bu operasyon bir istemci uygulama &amp;uuml;zerinden test edilebilir. &lt;strong&gt;POST&lt;/strong&gt; metoduna g&amp;ouml;re bir talepte bulunulacağından istemcinin &lt;strong&gt;servis s&amp;ouml;zleşmesini(Service Contract)&lt;/strong&gt; varsa &lt;strong&gt;veri s&amp;ouml;zleşmesini(Data Contract)&lt;/strong&gt; bilmesi gerekmektedir. Bunların dışından istemci uygulamanın &lt;strong&gt;System.ServiceModel.dll, System.Runtime.Serialization.dll(3.0 versiyonu) &lt;/strong&gt;ve &lt;strong&gt; System.ServiceModel.Web.dll&lt;/strong&gt; &lt;strong&gt;assembly&lt;/strong&gt;' larını referans etmesi gerekmektedir. Bu ama&amp;ccedil;la hazırlanan &amp;ouml;rnek istemci bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması olarak tasarlanabilir. S&amp;ouml;z konusu uygulamanın kodları ise aşağıdaki gibidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.ServiceModel;
using System.ServiceModel.Description;
using System.Data;
using System.ServiceModel.Web;
using System.Runtime.Serialization;

namespace Istemci
{
    [DataContract]
    public class Urun
    { 
        [DataMember]
        public int Id; 
        [DataMember]
        public string Name; 
        [DataMember]
        public double ListPrice;
    }

    [ServiceContract]
    public interface IUrunHizmetleri
    {
        [OperationContract]
        [WebGet(UriTemplate = "urunler/{altkategoriId}")]
        DataSet UrunListesi(string altKategoriId);
    
        [OperationContract]
        [WebGet]
        Urun UrunCek(int urunId);
    
        [OperationContract]
        [WebInvoke(UriTemplate = "guncelle?sinifi={sinifi}&amp;amp;altKategori={altKategoriId}")]
        void UrunGuncelle(string sinifi, int altKategoriId);

        [OperationContract]
        [WebGet(UriTemplate = "toplamaIslemi?sayi1={x}&amp;amp;sayi2={y}")]
        int Toplam(int x, int y);

        [OperationContract]
        [WebGet(UriTemplate = "toplam?kategori={altKategoriId}")]
        double ToplamFiyat(int altKategoriId);
    }

    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Başlatmak i&amp;ccedil;in bir tuşa basın");
            Console.ReadLine();
            using (WebChannelFactory&amp;lt;IUrunHizmetleri&amp;gt; cf = new WebChannelFactory&amp;lt;IUrunHizmetleri&amp;gt;(new Uri("http://localhost:60001")))
            {
                IUrunHizmetleri hiz=cf.CreateChannel();
                hiz.UrunGuncelle("M", 1);
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;WebChannelFactory&lt;/strong&gt; &lt;strong&gt; generic&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneklenmektedir. Burada &lt;strong&gt;generic&lt;/strong&gt; tip olarak servis s&amp;ouml;zleşmesi kullanılmalıdır. Dikkat edilecek olursa parametre olarak servisin host edildiği &lt;strong&gt;URL&lt;/strong&gt; adresi verilmekedir. Sonrasında yapılan metod &amp;ccedil;ağrısı &lt;strong&gt;HTTP POST &lt;/strong&gt;tekniğine g&amp;ouml;re sunucuya ulaşacak ve operasyon sonu&amp;ccedil;landırılacaktır. &amp;Ouml;nce sunucu sonrasında ise istemci &amp;ccedil;alıştırılırsa istemci uygulama başarılı bir şekilde y&amp;uuml;r&amp;uuml;t&amp;uuml;lecek ve &lt;strong&gt;Class&lt;/strong&gt; değeri &lt;strong&gt;M&lt;/strong&gt;, &lt;strong&gt; ProductSubCategoryID&lt;/strong&gt; değeri &lt;strong&gt;1&lt;/strong&gt; olan &lt;strong&gt;Product&lt;/strong&gt; tablosu satırlarının &lt;strong&gt;ListPrice&lt;/strong&gt; değerlerinin 1 birim arttırıldığı g&amp;ouml;r&amp;uuml;lecektir. Tahmin edileceği gibi istemci tarafında yapılan bu metod &amp;ccedil;ağırısı, sunucuya &lt;strong&gt;HTTP&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml;n &lt;strong&gt;POST&lt;/strong&gt; metoduna g&amp;ouml;re ulaşacaktır. Metod i&amp;ccedil;erisinde kullanılan parametre değerleride servis tarafına vardıklarında aynen alınıp değerlendirilebilecektir. Eğer sunucu &amp;ccedil;alışmıyorken istemci &amp;ccedil;alıştırılırsa &amp;ccedil;alışma zamanında &lt;strong&gt; EndPointNotFoundException&lt;/strong&gt; sınıfı tipinden bir &lt;strong&gt;istisna(Exception)&lt;/strong&gt; alındığı g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk242_11.gif" alt="" width="640" height="163" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Buraya kadar işlenenler g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında, istemcilerin &lt;strong&gt;HTTP&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;GET,POST, PUT, DELETE&lt;/strong&gt; gibi metodları kullanarak &lt;strong&gt;WCF&lt;/strong&gt; operasyonlarını &lt;strong&gt;talep(Request)&lt;/strong&gt; edebileceği g&amp;ouml;r&amp;uuml;lm&amp;uuml;şt&amp;uuml;r. &lt;strong&gt;Host&lt;/strong&gt; uygulama test olması a&amp;ccedil;ısından &lt;strong&gt; Console&lt;/strong&gt; olarak tasarlanmış olmakla birlikte &lt;strong&gt;IIS(Internet Information Service)&lt;/strong&gt; &amp;uuml;zerindede konuşlandırılabilir. Bu tip bir durumda &lt;strong&gt;svc&lt;/strong&gt; uzantılı servis dosyasında yer alan &lt;strong&gt;Service&lt;/strong&gt; direktifinde &lt;strong&gt;Factory&lt;/strong&gt; isimli &lt;strong&gt;niteliği(attribute)&lt;/strong&gt; kullanmak ve &lt;strong&gt;System.ServiceModel.Activation.WebServiceFactory&lt;/strong&gt; değerini atamak yeterlidir. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;a href="/makale/images/WebStyleServices.rar"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;</content>
  <pubDate>2008-02-14 12:00:00</pubDate>
  <slug>Web-Bazlc4b1-Programlama-Modeli-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
    <tag>web-programming-model</tag>
    <tag>rest</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>