<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Web API Tarafında Dapper Kullanımı</title>
  <description>Veri kaynakları ile kod tarafındaki modeller arasında devreye giren bir çok ORM aracı mevcut. Stackoverflow tarafından geliştirilen ve Micro ORM olarak nitelendirilen Dapper bunlardan birisi. SQLite, MySQL, SQLCE, SQL Server, Firebird ve daha bir çok veritabanı platformu ile çalışabilen Dapper'ın performans olarak da iyi sonuçlar verdiği ifade edilmekte. Amacım Dapper'ı bir Web API uygulamasında SQLite ile birlikte kullanabilmek.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2019/07/22/westwind.png" alt="" /&gt;O&amp;nbsp;&lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;cumartesi gecesi &amp;ccedil;alışması&lt;/a&gt;nı bitirdiğimde, yaptığım &amp;ouml;rneğin beni &amp;ccedil;ok da tatmin etmediği ger&amp;ccedil;eğiyle&amp;nbsp;karşı karşıyaydım. Bazen b&amp;ouml;yle hissediyordum. Boşa k&amp;uuml;rek &amp;ccedil;ektiğim hissine kapılıyor ve neden t&amp;uuml;m bunlarla uğraştığımı&amp;nbsp;sorguluyordum. Belki de sonraki yıllar boyunca kullanmayacağım bir şeyler &amp;uuml;zerinde &amp;ccedil;alışmıştım.&amp;nbsp;Ne aldığım notları ne de senaryo i&amp;ccedil;in kullandığım Westwind adını beğenmiştim. &amp;Ouml;rnek &amp;ccedil;ok sığdı. Zengin değildi. Bir şekilde beni rahatsız ediyordu.&lt;/p&gt;
&lt;p&gt;G&amp;uuml;r&amp;uuml;lt&amp;uuml;l&amp;uuml; soğutma sistemi ile zamanın pancar motorlu tekneleriyle karıştırdığım emektar WestWorld'&amp;uuml;n başından kalkıp evin basketbol sahasına bakan &amp;ccedil;alışma odasının&amp;nbsp;penceresine doğru y&amp;uuml;r&amp;uuml;d&amp;uuml;m. G&amp;uuml;n hen&amp;uuml;z batmak &amp;uuml;zereyken&amp;nbsp;havadaki az sayıda buluta, karşı okulun damına t&amp;uuml;nemiş bir ka&amp;ccedil; martıya, sahada şuuruzca oradan oraya koşuşturup duran &amp;ccedil;ocuğa, her zaman ki gibi yanındaki bakkalla d&amp;uuml;kkanının &amp;ouml;n&amp;uuml;nde tavla oynayan Ekrem amcaya baktım. Gelip giden d&amp;uuml;ş&amp;uuml;nceler eşliğinde dengeye gelmeyi ve bir ka&amp;ccedil; saattir beni terk eden i&amp;ccedil; motivasyonumu bulmaya &amp;ccedil;alışıyordum.&amp;nbsp;Benimle tekrar iletişim kurması biraz zaman alsa da sonunda bir şeyler fısıldamaya başlamıştı.&lt;/p&gt;
&lt;p&gt;İncelediğim konuyu belki şirket projelerinde veya farklı bir yerde kullanmayacaktım ama farkında olacaktım. Basit dahi olsa denediğim &amp;ouml;rnek bana konuşma hakkı verecekti. Onu en azından bir kişiyle bile paylaşabilir, karşılıklı fikir alışverişi yapıp g&amp;ouml;remediğim noktaları fark edebilirdim. Şunu unutmamak lazım ki kişisel gelişim adına yaptığımız &amp;ccedil;alışmaların hi&amp;ccedil;biri boşa değil. Hele ki rutine bağlayıp d&amp;uuml;zenli olarak yaptıklarımızın. Mutlaka size ve &amp;ouml;ğrendiklerinizi paylaştığınız &amp;ccedil;evrenize faydası var. &amp;Ouml;yleyse notlarımızı derlemeye başlayalım mı?&lt;/p&gt;
&lt;p&gt;Veri odaklı uygulamalar d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde kalıcı depolama enstr&amp;uuml;manları&amp;nbsp;ilişkisel veya dağıtık sistemler olarak karşımıza &amp;ccedil;ıkar&lt;em&gt;(RDBMS veya NoSQL ara&amp;ccedil;ları ifade etmeye &amp;ccedil;alışıyorum)&lt;/em&gt; Bu sistemlerin temel g&amp;ouml;revi veriyi tutmak ve y&amp;ouml;netmektir. Lakin son kullanıcıya hitap eden etkileşim noktalarına gelindiğinde farklı program aray&amp;uuml;zlerinin kullanımı s&amp;ouml;z konusudur&lt;em&gt;(M&amp;uuml;şteri son yaptığı rezarvosyonla ilgili bilgileri kontrol etmek i&amp;ccedil;in&amp;nbsp;veri tabanına bağlanıp bir sorgu c&amp;uuml;mlesi &amp;ccedil;alıştırmak istemez &amp;ouml;yle değil mi?)&lt;/em&gt; &amp;Ouml;zellikle nesne y&amp;ouml;nelimli d&amp;uuml;nya s&amp;ouml;z konusuysa verinin programatik ortamda ifade ediliş bi&amp;ccedil;imi de &amp;ouml;nem arz eden bir konu olarak karşımıza &amp;ccedil;ıkar. Tablo, kolon gibi şematik yapıların programlama d&amp;uuml;nyasında ifade ediliş bi&amp;ccedil;imleri domain odaklı kodlama yaparken işleri kolaylaştırmalıdır. İlk zamanlardaki &amp;ccedil;&amp;ouml;z&amp;uuml;mler sonrasında Object Relational Mapping adı verilen ara katman hayatımıza girmiştir. Yani veri tabanındaki nesnel varlıklar ile programatik d&amp;uuml;nyadaki &amp;ouml;rneklerin eşleştirilmesi konusundan bahsediyoruz.&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;n bir &amp;ccedil;ok ORM&lt;em&gt;(Object Relational Mapping)&lt;/em&gt; aracı mevcut. Ben daha &amp;ouml;nceden Entity Framework, Hibernate, LLBLGen gibi ara&amp;ccedil;larla &amp;ccedil;alışma fırsatı buldum. Genel olarak veriyi tuttuğumuz taraf ile nesne y&amp;ouml;nelimli d&amp;uuml;nya arasındaki iletişimde devreye giren&amp;nbsp;bu ara&amp;ccedil;larda felsefe az &amp;ccedil;ok aynı. Bir noktadan sonra kullanım kolaylıkları, entegre olabildikleri sistemler, performans ve a&amp;ccedil;ık kaynak olma halleri &amp;ouml;n plana &amp;ccedil;ıkıyor. Ben o geceki &amp;ccedil;alışmada Stackoverflow ekibi tarafından a&amp;ccedil;ık kaynak olarak geliştirilen ve iyi bir &lt;a href="https://github.com/StackExchange/Dapper" target="_blank"&gt;Micro ORM olarak nitelendirilen Dapper aracını&lt;/a&gt; incelemiştim. SQLite, MySQL, SQLCE, SQL Server, Firebird ve daha bir &amp;ccedil;ok veri tabanı platformu ile &amp;ccedil;alışabilen Dapper'ın performans olarak da iyi sonu&amp;ccedil;lar verdiği ifade edilmekte. Genel olarak uygulamadaki amacımsa, Dapper'ı bir Web API uygulamasında SQLite ile birlikte kullanabilmek.&lt;/p&gt;
&lt;h2&gt;SQLite Tarafındaki Hazırlıklar&lt;/h2&gt;
&lt;p&gt;&amp;Ouml;rneği her zaman olduğu gibi WestWorld&lt;em&gt;(Ubuntu 18.04, 64bit)&lt;/em&gt; &amp;uuml;zerinde geliştirmeye &amp;ccedil;alıştım. Sistemde o g&amp;uuml;n itibariyle SQLite y&amp;uuml;kl&amp;uuml;yd&amp;uuml; ve hatta Visual Studio Code tarafında veri tabanı nesnelerini g&amp;ouml;rebilmek i&amp;ccedil;in &lt;a href="https://marketplace.visualstudio.com/items?itemName=alexcvzz.vscode-sqlite" target="_blank"&gt;şu adresteki&lt;/a&gt; eklentiyi kullanıyordum. Senaryoya g&amp;ouml;re d&amp;uuml;nya &amp;ccedil;apındaki &amp;uuml;retici firmaların temel bilgilerini&amp;nbsp;tutacağım bir tablo kullanacaktım. Westwind veri tabanının adıydı&lt;em&gt;(Northwind &amp;ccedil;akması :P)&lt;/em&gt;&amp;nbsp;Firm isimli bir tablo kullanmaya ve i&amp;ccedil;erisinde şirket adı, merkez şehri, g&amp;uuml;ncel b&amp;uuml;t&amp;ccedil;e bilgisi gibi alanlara yer vermeye karar verdim. Bu hazırlıkları sqlite3 komut satırı aracını kullanarak pekala yapabiliriz&lt;em&gt;(ki artık bu andan itibaren siz benimle birlikte yazmaya başlıyor olmalısınız)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sqlite3 Westwind.db
.databases
CREATE TABLE FIRM(
ID INT PRIMARY KEY NOT NULL,
NAME TEXT NOT NULL,
CITY CHAR(50) NOT NULL,
SALARY REAL
);

INSERT INTO FIRM (ID,NAME,CITY,SALARY) VALUES (1,'Pedal Inc','Los Angles',10000);

INSERT INTO FIRM (ID,NAME,CITY,SALARY) VALUES (2,'Cycling Do','London',9000000);

SELECT * FROM FIRM;&lt;/pre&gt;
&lt;p&gt;İlk komutla dosya sisteminde Westwind.db isimli SQLite veri tabanı nesnesi oluşturulur. .databases komutu sayesinde var olan veri&amp;nbsp;tabanını g&amp;ouml;rebiliriz. Takip eden CREATE, INSERT, SELECT komutları &amp;ccedil;oğunuzun aşina olduğu standart SQL c&amp;uuml;mleleridir. Tablonun oluşturulmasını takiben &amp;ouml;rnek olarak iki firma bilgisi girilmiş ve tablonun t&amp;uuml;m i&amp;ccedil;eriği terminal penceresine istenmiştir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/07/22/Cover_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/07/22/Cover_2.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Web API Projesinin Oluşturulması&lt;/h2&gt;
&lt;p&gt;SQLite tarafındaki başlangı&amp;ccedil; hazırlıklarımız tamamlandığına g&amp;ouml;re .Net Core Web API projesinin oluşturulmasıyla &amp;ouml;rneğe devam edebiliriz. WestwindAPI isimli projemiz iki nuget paketi kullanacak. Bunlardan birisi SQLite'ın .Net Core i&amp;ccedil;in yazılmış s&amp;uuml;r&amp;uuml;m&amp;uuml;. Diğeri ise ORM aracımız olan Dapper ile ilgili. Aslında var olan SQLite tiplerini genişleteceğimiz bir paket olduğunu ifade edebiliriz&amp;nbsp;&lt;em&gt;(Bu arada siz &amp;ouml;rneği&amp;nbsp;yazarken bulunduğunuz uzay zaman dilimine g&amp;ouml;re g&amp;uuml;ncel s&amp;uuml;r&amp;uuml;mleri kontrol ederek ilerleyin. Core 3.0 ve sonrası&amp;nbsp;i&amp;ccedil;in paketler değişikliğe uğraşmış olabilir)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new webapi -o WestwindAPI
cd WestwindAPI
dotnet add package System.Data.SQLite.Core
dotnet add package Dapper&lt;/pre&gt;
&lt;p&gt;Artık kod tarafına&amp;nbsp;ge&amp;ccedil;ebiliriz. SQlite tarafı i&amp;ccedil;in gerekli bağlantı bilgisini appsettings.json dosyasına alarak devam edelim&lt;em&gt;(Westwind dosyasını db isimli bir klas&amp;ouml;r altında tutuyoruz)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;{
  "Logging": {
    "LogLevel": {
      "Default": "Warning"
    }
  },
  "ConnectionStrings": {
    "WestWindConStr": "Data Source=db/Westwind.db"
  },
  "AllowedHosts": "*"
}&lt;/pre&gt;
&lt;p&gt;Şirket bilgilerinin tutulduğu SQL tablosunu kod tarafında Firm isimli entity ile karşılayabiliriz. Entity sınıfını models isimli klas&amp;ouml;r altında aşağıdaki gibi oluşturalım. Tipik bir POCO&lt;em&gt;(Plain Old CLR Object)&lt;/em&gt;&amp;nbsp;sınıfı...&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace WestwindAPI.Models
{
    public class Firm
    {
        public int ID { get; set; }
        public string Name { get; set; }
        public string City { get; set; }
        public float Salary { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Bilindiği &amp;uuml;zere başlangı&amp;ccedil; şablonuyla ValuesController isimli bir sınıf geliyor. İ&amp;ccedil;erisinde temel CRUD operasyonlarına karşılık gelecek HTTP metodlarını barındırdığı i&amp;ccedil;in onu kullanabiliriz. Bu sınıfı FirmsController olarak&amp;nbsp;yeniden isimlendirip&amp;nbsp;Dapper kullanılacak hale getirmeye &amp;ccedil;alışalım.&amp;nbsp;M&amp;uuml;mk&amp;uuml;n mertebe koda yorum satırları katarak a&amp;ccedil;ıklamaya &amp;ccedil;alıştım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.AspNetCore.Mvc;
using WestwindAPI.Models;
using Microsoft.Extensions.Configuration;
using Dapper;
using System.Data.SQLite;

namespace WestwindAPI.Controllers
{
    [Route("api/[controller]")]
    [ApiController]
    public class FirmsController : ControllerBase
    {
        private readonly IConfiguration _configuration;
        private string conStr;

        // appsettings i&amp;ccedil;erisindeki ConnectionStrings bilgisine ihtiyacımız olacak
        // Bu nedenle .net core'un built-in configuration y&amp;ouml;neticisini i&amp;ccedil;eri alıyoruz.
        public FirmsController(IConfiguration configuration)
        {
            _configuration = configuration;
            conStr = _configuration.GetConnectionString("WestwindConStr");
        }

        [HttpGet]
        public ActionResult&amp;lt;IEnumerable&amp;lt;Firm&amp;gt;&amp;gt; Get()
        {
            // Standart get talebi sonrası Firm listesini d&amp;ouml;nd&amp;uuml;r&amp;uuml;yoruz
            IEnumerable&amp;lt;Firm&amp;gt; firms = new List&amp;lt;Firm&amp;gt;();
            // SQLite connection nesnesini oluştur
            using (var conn = new SQLiteConnection(conStr))
            {
                conn.Open(); // bağlantıyı a&amp;ccedil;
                // standart bir SQL sorgusu &amp;ccedil;alıştırıyoruz
                // isme g&amp;ouml;re sıralayarak firma bilgilerini alıyoruz
                firms = conn.Query&amp;lt;Firm&amp;gt;("SELECT * FROM FIRM ORDER BY NAME");

            }
            return new ActionResult&amp;lt;IEnumerable&amp;lt;Firm&amp;gt;&amp;gt;(firms);
        }

        // Belli bir şehirdeki firmaların bilgilerini d&amp;ouml;nd&amp;uuml;ren metodumuz
        [HttpGet("{city}")]
        public ActionResult&amp;lt;IEnumerable&amp;lt;Firm&amp;gt;&amp;gt; GetByCity(string city)
        {
            IEnumerable&amp;lt;Firm&amp;gt; firms = new List&amp;lt;Firm&amp;gt;();
            // SQLite connection nesnesini oluştur
            using (var conn = new SQLiteConnection(conStr))
            {
                conn.Open(); // bağlantıyı a&amp;ccedil;
                // Bu kez işin i&amp;ccedil;erisinde bir where koşulu var
                firms = conn.Query&amp;lt;Firm&amp;gt;("SELECT * FROM FIRM WHERE CITY = @FirmCity ORDER BY NAME", new { FirmCity = city });

            }
            return new ActionResult&amp;lt;IEnumerable&amp;lt;Firm&amp;gt;&amp;gt;(firms);
        }

        [HttpPost]
        public IActionResult Post([FromBody] Firm payload)
        {
            try
            {
                using (var conn = new SQLiteConnection(conStr))
                {
                    conn.Open(); // bağlantıyı a&amp;ccedil;
                    // INSERT c&amp;uuml;mleciğini &amp;ccedil;alıştır
                    // ikinci parametreye dikkat. Burada API'ye talebin body'si ile gelen JSON i&amp;ccedil;eriğini kullanıyoruz.
                    conn.Execute(@"INSERT INTO FIRM (ID,NAME,CITY,SALARY) VALUES (@ID,@NAME,@CITY,@SALARY)", payload);
                    return Ok(payload);
                }
            }
            catch (SQLiteException excp) // Olası bir SQLite exception durumunda HTTP 400 Bad Request hatası verip i&amp;ccedil;erisine exception mesajını g&amp;ouml;m&amp;uuml;yoruz
            {
                return BadRequest(excp.Message); //Bunu production ortamlarında yapmayın. Loglama yapın başka bir mesaj verin. Exception i&amp;ccedil;erisinde koda ve sorguya dair ipu&amp;ccedil;ları olabilir.
            }
        }

        // G&amp;uuml;ncelleme işlemleri i&amp;ccedil;in kullanacağımız metot
        [HttpPut()]
        public IActionResult Put([FromBody] Firm payload)
        {
            try
            {
                using (var conn = new SQLiteConnection(conStr))
                {
                    conn.Open(); // bağlantıyı a&amp;ccedil;
                    // UPDATE c&amp;uuml;mleciğini &amp;ccedil;alıştır
                    // Parametreler diğer metodlarda olduğu gibi @ sembol&amp;uuml; ile başlayan kelimelerden oluşuyor
                    // Bu parametrelere değer atarken anonymous type de kullanabiliyoruz.

                    //TODO Aslında gelen JSON i&amp;ccedil;eriğinde hangi alanlar varsa sadece onları g&amp;uuml;ncellemeye &amp;ccedil;alışalım
                    var result = conn.Execute(@"UPDATE FIRM SET NAME=@firmName,CITY=@firmCity,SALARY=@firmSalary WHERE ID=@firmId",
                        new
                        {
                            firmName = payload.Name,
                            firmCity = payload.City,
                            firmSalary = payload.Salary,
                            firmId = payload.ID
                        });
                    if (result == 1)
                        return Ok(payload); // Eğer g&amp;uuml;ncelleme sonucu 1 ise (ki ID bazlı g&amp;uuml;ncelleme olduğundan 1 d&amp;ouml;nmesini bekliyoruz) HTTP 200
                    else
                        return NotFound(); // ID değerinde bir firma yoksa HTTP 404
                }
            }
            catch (SQLiteException excp) // Olası bir SQLite exception durumunda HTTP 400 Bad Request hatası verip i&amp;ccedil;erisine exception mesajını g&amp;ouml;m&amp;uuml;yoruz
            {
                return BadRequest(); // HTTP 400 
            }
        }

        // Silme operasyonları i&amp;ccedil;in &amp;ccedil;alışan metot
        [HttpDelete("{id}")]
        public IActionResult Delete(int id)
        {
            using (var conn = new SQLiteConnection(conStr))
            {
                conn.Open(); // bağlantıyı a&amp;ccedil;
                var result = conn.Execute(@"DELETE FROM FIRM WHERE ID=@firmId",new { firmId = id });
                if (result == 1)
                    return Ok(); // Eğer silme operasyonu başarılı ise etkilenen kayıt sayısı (ki bu senaryoda 1 bekliyoruz) 1 d&amp;ouml;ner HTTP 200
                else
                    return NotFound(); // Aksi durumda bu ID de bir kayıt yoktur diyebiliriz. HTTP 404
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;HTTP'nin Post, Put, Delete ve Get metodlarının tamamına yer verdik. T&amp;uuml;m operasyonlarımız IActionResult ve t&amp;uuml;revlerini d&amp;ouml;nd&amp;uuml;rmekte. Pek &amp;ccedil;ok noktada REST servis standartlarını yakalamaya &amp;ccedil;alışıp HTTP 200, HTTP 404 gibi mesajların karşılıkları olan Ok, NotFound benzeri metod &amp;ccedil;ağrılarına yer vermekteyiz.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Kodu incelerken Dapper'ın nerede devreye girdiği sorusunu aklınızı kurcalayabilir. SQLiteConnection nesne &amp;ouml;rneği &amp;uuml;zerinden uygulanan Query ve Execute metodları, Dapper'a ait genişletme fonksiyonlarıdır. Yani sorguların SQLite'a iletilmesi noktasında Firm entity &amp;ouml;rnekleri ile temas edilen yerlerde &amp;ccedil;alışmaktadır.&lt;/p&gt;
&lt;p&gt;Esasında &lt;a href="https://github.com/StackExchange/Dapper" target="_blank"&gt;a&amp;ccedil;ık kaynak olan bu mikro &amp;ccedil;atıyı derinlemesine incelemekte fayda var&lt;/a&gt;. Nitekim dinamik parametre se&amp;ccedil;eneği ile SQL injection saldırılarından koruma gibi imkanlar da sunuyor. &amp;Uuml;stelik bir şekilde performansı olduk&amp;ccedil;a iyi. Kendim test edip sonu&amp;ccedil;ları g&amp;ouml;rmediğim i&amp;ccedil;in kesin bir şey diyemiyorum ama neyi nasıl yapıyor ya da diğerlerinden hangi noktada farklılaşıyor araştırıp &amp;ouml;ğrenmek lazım. Github kodlarını incelemek bu a&amp;ccedil;ıdan &amp;ouml;nemli.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2&gt;&amp;Ccedil;alışma Zamanı&lt;/h2&gt;
&lt;p&gt;Kod tarafı tamamlandığına g&amp;ouml;re&amp;nbsp;servisi&amp;nbsp;test etmeye başlayabiliriz. Uygulamayı&amp;nbsp;terminalden&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet run&lt;/pre&gt;
&lt;p&gt;komutu ile &amp;ccedil;alıştırdıktan sonra Postman veya muadili bir aracı kullanarak API fonksiyonellikleri denenebilir.&amp;nbsp;&amp;Ouml;rnek bir veri girişiyle başlayalım. Adres, HTTP metodu ve g&amp;ouml;vdede g&amp;ouml;ndereceğimiz JSON i&amp;ccedil;eriği ş&amp;ouml;yle olsun;&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;http://localhost:5404/api/Firms 
POST
{"Id":21,"Name":"Dust&amp;amp;Dones Guitars","City":"Detroit","Salary":5250000}&lt;/pre&gt;
&lt;p&gt;Sonu&amp;ccedil; aşağıdaki gibi olmalıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/07/22/Cover_3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aynı ID ile tekrar giriş yapmak istersek Primary Key alanı nedeniyle bir &amp;ccedil;alışma zamanı hatası&amp;nbsp;alınması gerekir. Nitekim tekillik ihlal edilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/07/22/Cover_4.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi de belli bir şehirdeki şirketleri listeleyelim.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;http://localhost:5404/api/Firms/Detroit
GET&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/07/22/Cover_5.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tavsiye edilen bir servis&amp;nbsp;&amp;ccedil;ağrımı olmamakla birlikte t&amp;uuml;m&amp;nbsp;firmalar&lt;em&gt;(1000 satırlık veriyi birden vermek &amp;ccedil;ok da anlamlı olmaz ger&amp;ccedil;ek hayat senaryolarında)&lt;/em&gt;&amp;nbsp;i&amp;ccedil;in aşağıdaki talebi kullanalım.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;http://localhost:5404/api/Firms
GET&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/07/22/Cover_6.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ID bazlı bir g&amp;uuml;ncelleme&amp;nbsp;ile testlere devam edebiliriz.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;http://localhost:5404/api/Firms
PUT
{"Id":55,"Name":"Queen Marry Music LTD","City":"London","Salary":4350000}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/07/22/Cover_7.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Son olarak ID bilgisiyle bir firmayı silerek testlerimizi tamamlayalım.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;http://localhost:5404/api/Firms/103
DELETE&lt;/pre&gt;
&lt;p&gt;Tabi o ID i&amp;ccedil;in bir kayıt yoksa HTTP 404 NotFound d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z&amp;uuml; de g&amp;ouml;rmemiz lazım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/07/22/Cover_8.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Ben Neler &amp;Ouml;ğrendim?&lt;/h2&gt;
&lt;p&gt;Testler tamamlandı. Eğer buraya kadar geldiyseniz neler &amp;ouml;ğrendiğinizi d&amp;uuml;ş&amp;uuml;nmeye &amp;ccedil;alışabilirsiniz. Ben Web API, ORM ve SQLite tarafına &amp;ccedil;ok da yabancı&amp;nbsp;olmadığımdan bazı şeyleri tekrar etmiş gibi oldum. Lakin SQLite ve Dapper ara&amp;ccedil;larını deneyimleme fırsatı bulduğum i&amp;ccedil;in bir ka&amp;ccedil; şey de&amp;nbsp;&amp;ouml;ğrendim.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Dapper Micro ORM aracının .net core tarafında nasıl kullanıldığını&lt;/li&gt;
&lt;li&gt;CRUD&lt;em&gt;(Create Read Update Delete)&lt;/em&gt; operasyonlarını SQLite ile &amp;ccedil;alıştırmayı&lt;/li&gt;
&lt;li&gt;IActionResult/ActionResult ile Web API metodlarından nasıl sonu&amp;ccedil;lar d&amp;ouml;nebileceğimizi ve bu sayede REST standartlarına nasıl uyacağımızı&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;a href="https://github.com/buraksenyurt/saturday-night-works/tree/master/No%2022%20-%20Dapper%20with%20Web%20API" target="_blank"&gt;22 numaralı &amp;ouml;rnek&lt;/a&gt;te mikro ORM ara&amp;ccedil;larının g&amp;ouml;zlerinden olan Dapper'ı, SQLite tabanlı olacak şekilde .Net Core 2 ile yazılmış bir Web API projesinde deneyimlemeye &amp;ccedil;alıştık. &amp;Uuml;st&amp;uuml;ne fazlasını katmak sizin elinizde. Hoş bir arabirimin bu servisi kullanması sağlanabilir. &amp;Ouml;rneğin progressive tarzda bir web uygulaması denenebilir.&amp;nbsp;SQLite tarafı bir bulut hizmetine devredilebilir. Belki de servis dockerize edilerek aynı bulut sistemi &amp;uuml;zerinde konuşlandırılabilir. Senaryoları &amp;ccedil;eşitlendirmek m&amp;uuml;mk&amp;uuml;n. G&amp;uuml;n&amp;uuml;m&amp;uuml;z mini mikro servis uyarlamaların &amp;ccedil;oğunda bu tip ORM ara&amp;ccedil;larının kullanıldığı da ortada diyerek son mesajımı vereyim. B&amp;ouml;ylece geldik pratik kazandıran bir cumartesi gecesi derlemesinin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2019-08-16 10:30:00</pubDate>
  <slug>web-api-tarafinda-dapper-kullanimi</slug>
  <tags>
    <tag>net-core</tag>
    <tag>web-api</tag>
    <tag>dappernet</tag>
    <tag>orm</tag>
    <tag>c#</tag>
    <tag>i-action-result</tag>
    <tag>rest-api</tag>
    <tag>sqlite</tag>
    <tag>dapper</tag>
    <tag>sql</tag>
    <tag>query</tag>
    <tag>execute-query</tag>
    <tag>select</tag>
    <tag>crud</tag>
    <tag>stackoverflow</tag>
    <tag>httpget</tag>
    <tag>httppost</tag>
    <tag>poco</tag>
    <tag>entity-framework</tag>
    <tag>extension-methods</tag>
    <tag>microservice</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
  </categories>
</post>