<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF - Replay Attack Etkisini Hafifletmek</title>
  <description>WCF(Windows Communication Foundation) ile ilgili bir önceki makalemizde, istemci ve servis arasında güvenilir oturumların(Reliable Session) nasıl açılabileceğinden bahsetmiştik. Güvenilir oturumların yararlarından biriside, olası cevaplama saldırılarının(Replay Attacks) önüne geçmektir. Bilindiği üzere cevaplama saldırılarında, istemci ve servis arasında hareket eden mesajların yakalanarak bozulması, değiştirilmesi, kesilmesi gibi problemler söz konusu olmaktadır. Üstelik değişikliğe uğratılan mesajların zaman içerisinde her hangibir anda, orjinal servis kaynağına yada farklı bir yöne doğru defalarca gönderilmeleride söz konusudur.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;WCF(Windows Communication Foundation) ile ilgili bir &amp;ouml;nceki makalemizde, istemci ve servis arasında &lt;strong&gt; g&amp;uuml;venilir oturumların(Reliable Session) &lt;/strong&gt;nasıl a&amp;ccedil;ılabileceğinden bahsetmiştik. G&amp;uuml;venilir oturumların yararlarından biriside, olası &lt;strong&gt; cevaplama saldırılarının(Replay Attacks)&lt;/strong&gt; &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mektir. Bilindiği &amp;uuml;zere cevaplama saldırılarında, istemci ve servis arasında hareket eden mesajların yakalanarak bozulması, değiştirilmesi, kesilmesi gibi problemler s&amp;ouml;z konusu olmaktadır. &amp;Uuml;stelik değişikliğe uğratılan mesajların zaman i&amp;ccedil;erisinde her hangibir anda, orjinal servis kaynağına yada farklı bir y&amp;ouml;ne doğru defalarca g&amp;ouml;nderilmeleride s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;G&amp;uuml;venilir oturumlarda, mesajların tekrar etmesini &amp;ouml;nlemek adına &lt;strong&gt;WS-ReliableMessaging&lt;/strong&gt; şartnamelerine uygun şekilde hareket edilir. Buna g&amp;ouml;re mesajların benzersiz bir id ile işaretlenmesi ve sıralarının belirlenmesi i&amp;ccedil;in numaralandırılması s&amp;ouml;z konusudur. Ne yazıkki g&amp;uuml;venilir bir oturum cevaplama saldırılarını tek başına karşılamakta yeterli olmayabilir. Aslında bunun i&amp;ccedil;in ge&amp;ccedil;erli ve yeterli bir senaryo vardır. Aşağıdaki şekil cevaplama saldırılarına ait bir vakayı ifade etmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk230_1.gif" alt="" width="636" height="469" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu senaryoda istemci ve servis arasında hareket etmekte olan 7 adet mesaj olduğu varsayılmaktadır. G&amp;uuml;venilir bir oturum sağlandığı d&amp;uuml;ş&amp;uuml;n&amp;uuml;lecek olursa, istemcinin servis tarafına g&amp;ouml;ndereceği her mesajda bir sıra numarası olacağı s&amp;ouml;z konusudur. Ne varki senaryoya g&amp;ouml;re 3 numaralı mesaj &lt;strong&gt;hacker&lt;/strong&gt; tarafından yakalanır. Sonrasında ise mesajın i&amp;ccedil;eriği ve numarası 6 olarak değiştirilerek servis tarafına g&amp;ouml;nderilir. Bilindiği gibi g&amp;uuml;venilir oturumlarda, servise gelen mesajların farklı zamanlarda ulaşma ihtimali g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınarak, bu mesajların istemciden g&amp;ouml;nderildikleri sırada alınmaları i&amp;ccedil;in &lt;strong&gt; buffer(tampon)&lt;/strong&gt; sistemi kullanılır. İlerleyen zaman aralığında istemci ger&amp;ccedil;ek 6 numaralı mesajı servis tarafında g&amp;ouml;nderir. Oysaki 6 numaralı mesaj zaten servis i&amp;ccedil;in a&amp;ccedil;ılan buffer i&amp;ccedil;erisinde durmaktadır. Dolayısıyla asıl 6 numaralı mesaj servis tarafından geri &amp;ccedil;evrilerek işlenmeyecektir. İşte bu durum g&amp;uuml;venilir oturumların cevaplama saldırıları i&amp;ccedil;in tek başına yeterli bir &amp;ccedil;&amp;ouml;z&amp;uuml;m olmayışının ispatıdır.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;&amp;ouml;z&amp;uuml;msel bir yaklaşım olarak &lt;strong&gt;mesaj seviyesinde(Message Level)&lt;/strong&gt; veya &lt;strong&gt;iletişim seviyesinde(Transport Level) &lt;/strong&gt;g&amp;uuml;venlik g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Ancak bunlarda tek başlarına yeterli değildir. Mesaj seviyesinde g&amp;uuml;venlikte, istemci ve servis arasındaki mesaj bilgileri şifrelenmektedir. Ne varki mesaj seviyesinde g&amp;uuml;venlik uyarlamaları, &amp;ccedil;oğunlukla mesaj g&amp;ouml;vdesindeki i&amp;ccedil;eriğin şifrelenmesi ile ilgilenir. Bu sebepten mesajın &lt;strong&gt;başlık(Header) &lt;/strong&gt; kısmı yinede &lt;strong&gt;hacker&lt;/strong&gt;' lar tarafından yakalanabilir ve sıra numaraları bozulabilir. Peki iletişim seviyesinde g&amp;uuml;venlik uyarlamalarında durum nedir? Bu seviyede g&amp;uuml;venlik olduk&amp;ccedil;a g&amp;uuml;&amp;ccedil;l&amp;uuml; bir &amp;ccedil;&amp;ouml;z&amp;uuml;md&amp;uuml;r. Ancak iletişim seviyesinde g&amp;uuml;venlik uyarlamaları, noktadan-noktaya &amp;ccedil;alışırlar. Bu konu i&amp;ccedil;in ş&amp;ouml;yle bir &amp;ouml;rnek d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir; bir servisin mesajını g&amp;ouml;nderdiği hedefte başka bir servis olabilir. Mesajı alan servisin, mesajların i&amp;ccedil;eriğine sınırsız erişim yetkisi vardır. Eğer merkez servis aldığı mesajı başka bir servisede g&amp;ouml;nderiyorsa mesajı bozmadığından emin olmak gerekmektedir.&lt;/p&gt;
&lt;p&gt;Bu ana kadar yazılıp &amp;ccedil;izilenler s&amp;ouml;z konusu olduğunda, cevaplama saldırılarına karşı tam anlamıyla bir &amp;ccedil;&amp;ouml;z&amp;uuml;m bulunamadığı d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Lakin, WCF i&amp;ccedil;erisinde &amp;ouml;zel bir takım teknikler yardımıyla cevaplama saldırılarına karşı daha g&amp;uuml;&amp;ccedil;l&amp;uuml; durulabilir. Tabi t&amp;uuml;m bu tedbirsel teknikler &lt;strong&gt;g&amp;uuml;venilir oturumlar(Reliable Session) &lt;/strong&gt;&amp;uuml;zerine kurulmaktadır. Bu tedbirler aktifleştirildiğinde, &lt;strong&gt;WCF &amp;ccedil;alışma zamanı(Run-Time)&lt;/strong&gt; her mesaj i&amp;ccedil;in aşağıdaki kriterlere uygun bir &lt;strong&gt;tanımlayıcı(Identifier) &lt;/strong&gt;&amp;uuml;retir.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Benzersiz(Unique)&lt;/li&gt;
&lt;li&gt;Rastgele elde edilmiş(Random)&lt;/li&gt;
&lt;li&gt;İşaretlenmiş(Signed)&lt;/li&gt;
&lt;li&gt;Zaman Damgalı(TimeStamp)&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bu değerlerden oluşan &lt;strong&gt; tanımlayıcılar(Identifiers)&lt;/strong&gt; nonce olarak isimlendirilmektedir. &lt;strong&gt;Nonce&lt;/strong&gt;' ların kullanıldığı bu korunma sisteminin &amp;ccedil;alışma şekline g&amp;ouml;re, servise gelen mesajların bozulup bozulmadıkları&lt;strong&gt;(Corrupt)&lt;/strong&gt; bir dizi işlem ile anlaşılmaya &amp;ccedil;alışılır. Normalde servis tarafına gelen mesajların nonce değerleri &lt;strong&gt; tampona(buffer)&lt;/strong&gt; alınır. Başka bir mesaj geldiğinde başlık bilgilerinden elde edilen nonce değerinin, tamponda olup olmadığına bakılır. Elde edilen nonce değerinin aynısı tamponda var ise gelen mesaj geri &amp;ccedil;evrilir. Elbette nonce değeri tamponda yoksa mesaj kabul edilir. Kabul edilen bu mesajın nonce değeri yine tampona eklenir. Nonce' ların kullanıldığı bu sistemi tesis edebilmek i&amp;ccedil;in &lt;strong&gt;WCF&lt;/strong&gt; i&amp;ccedil;erisinde&lt;strong&gt; &amp;ouml;zel bağlayıcı tiplerin(Custom Binding Types)&lt;/strong&gt; tanımlanması gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Windows Communication Foundation &amp;ccedil;alışma zamanı(WCF Run-Time) &lt;/strong&gt;mesajların alınıp g&amp;ouml;nderilmesi sırasında &lt;strong&gt;kanal yığınlarını(Channel Stack)&lt;/strong&gt; kullanır. Mesajlar normal şartlarda bir adrese doğru hareket ederler. Bu hareket &lt;strong&gt;TCP&lt;/strong&gt;, &lt;strong&gt;HTTP&lt;/strong&gt; gibi bir iletişim protokol&amp;uuml; &amp;uuml;zerinden aktarılırlar. Bu sebepten mesajın ulaştığı yerde bulunan WCF &amp;ccedil;alışma zamanı(WCF Run-time) karşılama i&amp;ccedil;in &lt;strong&gt;iletişim kanallarını(Transport Channels)&lt;/strong&gt; kullanır. Bu kanal, servis tarafındaki host nesnesi a&amp;ccedil;ıldığı andan itibaren gelen mesajları dinlemektedir. Servis tarafında uygun iletişim kanalı tarafından alınan mesajlar, daha sonra &lt;strong&gt;kodlama kanallarına(Encoding Channels) &lt;/strong&gt; y&amp;ouml;nlendirilir. Kodlama kanallarının g&amp;ouml;revi istemciden gelen mesajları &amp;ccedil;&amp;ouml;z&amp;uuml;mleyerek servis nesnesine iletmek ve servisin istemiceye g&amp;ouml;ndereceği mesajlarıda kodlayarak &lt;strong&gt;iletişim kanalına(Transport Channel)&lt;/strong&gt; iletmektir. &amp;Ccedil;ok doğal olarak iletişim kanalından ge&amp;ccedil;erek mesaj kanalına gelen bilginin &lt;strong&gt;Text&lt;/strong&gt; veya &lt;strong&gt;Binary&lt;/strong&gt; tabanlı olma durumu (hatta WS şartnamelerine g&amp;ouml;re &lt;strong&gt;Microsoft Transmision Opitimision Mechanism&lt;/strong&gt;'a uygun bir bi&amp;ccedil;imde olması) s&amp;ouml;z konusudur. Aşağıdaki şekil temel olarak s&amp;ouml;z konusu kanallar arasındaki iletişimi ifade etmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk230_2.gif" alt="" width="627" height="306" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Servis tarafı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında en azından iki kanalın var olması gerekmektedir. Dolayısıyla cevaplama saldırılarına karşı savunma yapılırken oluşturulacak olan &lt;strong&gt;&amp;ouml;zel kanal tipleri(Custom Binding Types) &lt;/strong&gt;geliştirilirken bunlara dikkat edilmelidir. Diğer taraftan &lt;strong&gt;WCF&lt;/strong&gt; i&amp;ccedil;erisinde bu tip bağlayıcı tipleri hazırlamak son derece kolaydır. Basit olarak &lt;strong&gt;Service Configuration&lt;/strong&gt; &lt;strong&gt;Editor&lt;/strong&gt; bu ama&amp;ccedil;la kullanılabilir. Bu hazırlıklar yapılırken bağlayıcı tip i&amp;ccedil;erisine katılan kanalların sırasıda &amp;ouml;nemlidir.&lt;/p&gt;
&lt;p&gt;Artık bir &amp;ouml;rnek &amp;uuml;zerinden hareket edilerek devam edilebilir. Her zamanki gibi &lt;strong&gt;servis s&amp;ouml;zleşmesi(Service Contract)&lt;/strong&gt; ve uyarlamasını i&amp;ccedil;eren bir &lt;strong&gt;WCF Servis k&amp;uuml;t&amp;uuml;phanesi&lt;/strong&gt; tasarlayarak işe başlamak gerekir. S&amp;ouml;z konusu servis s&amp;ouml;zleşmesi i&amp;ccedil;erisinde basit olarak işlevselliği &amp;ccedil;ok &amp;ouml;nemli olmayan iki metod yer almaktadır. &lt;strong&gt;G&amp;uuml;venilir oturum(Reliable Session)&lt;/strong&gt; sağlanması adına bir oturum var olma gerekliğine uygun olacak şekilde tanım yapılmaktadır. S&amp;ouml;z konusu servis k&amp;uuml;t&amp;uuml;phanesi i&amp;ccedil;erisinde tanımlı tipler aşağıda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk230_3.gif" alt="" width="240" height="342" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Servis s&amp;ouml;zleşmesi(Service Contract);&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace SiparisKutuphanesi
{
    [ServiceContract(Name="Siparis Servisi", Namespace="http://www.bsenyurt.com/SiparisServisi", SessionMode= SessionMode.Required)]
    public interface ISiparisYonetimi
    {
        [OperationContract(IsInitiating=true)]
        void SiparisEkle(int siparisNo);
        [OperationContract(IsInitiating=false,IsTerminating=true)]
        void SiparisleriOnayla(); 
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;S&amp;ouml;zleşme Uyarlaması;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace SiparisKutuphanesi
{
    [ServiceBehavior(InstanceContextMode= InstanceContextMode.PerSession)]
    public class SiparisYonetimi:ISiparisYonetimi
    {
        #region ISiparisYonetimi Members

        public void SiparisEkle(int siparisNo)
        {
            // Siparis ekleme adımı
        }

        public void SiparisleriOnayla()
        {
            // Siparis onaylama adımı
        }

        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;Bu işlemin ardından servis ve istemci taraflarının tasarlanmasına ge&amp;ccedil;ilebilir. Olayın basit bir şekilde ele alınması i&amp;ccedil;in servis ve istemci tarafındaki programlar basit birer &lt;strong&gt; Console&lt;/strong&gt; uygulaması olarak tasarlanabilir. Bu uygulamalarda belkide en &amp;ouml;nemli kısımlar konfigurasyon ayarlarıdır. Nitekim konfigurasyon tarafında &lt;strong&gt;&amp;ouml;zel bağlayıcı tip(Custom Binding Type)&lt;/strong&gt; tanımlamaları yapılacaktır. Servis tarafındaki Console uygulamasının başlangı&amp;ccedil;taki hali aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Servis uygulaması kod i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using SiparisKutuphanesi;

namespace Servis
{
    class Program
    {
        static void Main(string[] args)
        {
            ServiceHost host = new ServiceHost(typeof(SiparisYonetimi));
            host.Open();
            Console.WriteLine(host.State.ToString());
            Console.WriteLine("Kapatmak i&amp;ccedil;in bir tuşa basınız");
            Console.ReadLine();
            if (host.State == CommunicationState.Opened)
            host.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Servis tarafındaki konfigurasyon dosyasının ilk hali;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service name="SiparisKutuphanesi.SiparisYonetimi"&amp;gt;
                &amp;lt;endpoint address="net.tcp://localhost:4500/SiparisServisi.svc" binding="netTcpBinding" name="SiparisServisiEndPoint" contract="SiparisKutuphanesi.ISiparisYonetimi"/&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Başlangı&amp;ccedil;ta servis tarafı &lt;strong&gt; netTcpBinding&lt;/strong&gt; bağlayıcı tipini kullanacak şekilde tasarlanmıştır. Ancak cevaplama saldırılarının &amp;ouml;n&amp;uuml;ne kesmek i&amp;ccedil;in burada &amp;ouml;zel bir bağlayıcı tip tasarlanacaktır. Şimdi adım adım bu işlemler ger&amp;ccedil;ekleştirilecektir. İlk olarak, &lt;strong&gt;Service Configuration Editor&lt;/strong&gt; &amp;uuml;zerinden aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer aldığı gibi &lt;strong&gt;New Binding Configuration&lt;/strong&gt; bağlantısına tıklanır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk230_4.gif" alt="" width="536" height="533" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sonrasıdan a&amp;ccedil;ılan &lt;strong&gt;Create a New Binding&lt;/strong&gt; kısmından &lt;strong&gt;customBinding&lt;/strong&gt; se&amp;ccedil;ilerek &lt;strong&gt;OK&lt;/strong&gt; tuşuna basılır. Bu işlemin sonrasında oluşan duruma g&amp;ouml;re &amp;ouml;zel bağlayıcı tipin adı, aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi SiparisServisiOzelBaglayici olarak değiştirilebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk230_5.gif" alt="" width="629" height="395" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İlk bakıldığında iletişim kanalı olarak &lt;strong&gt;httpTransport&lt;/strong&gt; tipinin ve mesajlaşma kanalı olarakta &lt;strong&gt; textMessageEncoding&lt;/strong&gt;' in kullanıldığı g&amp;ouml;r&amp;uuml;lmektedir. &amp;Ouml;rnekte &lt;strong&gt;TCP&lt;/strong&gt; protokol&amp;uuml; &amp;uuml;zerinden bir haberleşme hedeflendiği i&amp;ccedil;in &lt;strong&gt;httpTransport&lt;/strong&gt; kanalı kaldırılmalıdır. Bu işlem i&amp;ccedil;in aynı ekranda, &lt;strong&gt;httpTransport&lt;/strong&gt; se&amp;ccedil;ili iken &lt;strong&gt;Remove&lt;/strong&gt; tuşuna basılması yeterlidir. &lt;strong&gt;tcpTransport&lt;/strong&gt; kanalının eklenmesi i&amp;ccedil;in aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde işaretlenen adımların sırasıyla yapılması yeterlidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk230_6.gif" alt="" width="634" height="453" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edilecek olursa &lt;strong&gt;Available Elements&lt;/strong&gt; kısmında, &amp;ouml;zel bağlayıcı tip i&amp;ccedil;erisinde kullanılabilecek pek &amp;ccedil;ok kanal &amp;ccedil;eşidi bulunmaktadır. &lt;strong&gt;tcpTransport&lt;/strong&gt; tahmin edileceği &amp;uuml;zere bir iletişim kanalı olarak servise gelen mesajların TCP protokol&amp;uuml; &amp;uuml;zerinden alınmasını sağlamaktadır. &amp;Ouml;rnekte mesajlaşma kanalı olarak &lt;strong&gt; textMessageEncoding&lt;/strong&gt; kullanılmaktadır. Bu nedenle oluşturulan &amp;ouml;zel bağlayıcı tip i&amp;ccedil;erisinde gelen ilgili kanalın kaldırılmasına gerek yoktur.&lt;/p&gt;
&lt;p&gt;Sıradaki adımda g&amp;uuml;venlik ile ilgili bir kanalın eklenmesi gerekmektedir. Bu ama&amp;ccedil;la yine &lt;strong&gt;Add&lt;/strong&gt; d&amp;uuml;ğmesi ile(yada &lt;strong&gt;Add Binding Element Extension&lt;/strong&gt; bağlantısı kullanılarak) a&amp;ccedil;ılan pencereden security elementi se&amp;ccedil;ilmelidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk230_7.gif" alt="" width="590" height="410" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;security&lt;/strong&gt; elementi i&amp;ccedil;erisinde ise &lt;strong&gt;AuthenticationMode&lt;/strong&gt; &amp;ouml;zelliğinin değeri aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi &lt;strong&gt;SecureConversation&lt;/strong&gt; olarak ayarlanır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk230_8.gif" alt="" width="637" height="470" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;SecureConversation&lt;/strong&gt;, &lt;strong&gt; Organization for the Advancement of Structured Information Standards&lt;/strong&gt; (&lt;strong&gt;OASIS&lt;/strong&gt; - &lt;a href="http://www.oasis-open.org/home/index.php"&gt; http://www.oasis-open.org/home/index.php&lt;/a&gt;) tarafından kabul edilmiş olan &lt;strong&gt;WS-SecureConversation&lt;/strong&gt; şartnamelerine uygun olacak şekilde g&amp;uuml;venli bir oturumun sağlanması garanti etmektedir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zet olarak WS-SecureConversation, iki katılımcı arasındaki(&amp;ouml;rnek senaryoya g&amp;ouml;re istemci ve servis) mesajlaşmada ehliyet bilgilerinin tamamının g&amp;ouml;nderilmesini gerektirmeyecek bir ortam sağlamaktadır. Bunun sağlanabilmesi i&amp;ccedil;in oturumun en başında, istemci ve servis arasında &lt;strong&gt; ehliyet(Credential)&lt;/strong&gt; bilgileri değiş tokuş edilir ve doğrulanır. Geri kalan mesajlaşmalarda başlangı&amp;ccedil;taki ehliyet bilgilerinden t&amp;uuml;reyen &lt;strong&gt; g&amp;uuml;venlik fişleri(security tokens)&lt;/strong&gt; kullanılır. Bir başka deyişle oturum başında zaten taraflar ehliyet bilgileri ile birbirlerini doğruladıklarından, kalan mesajlaşmalarda aynı bilgiler tekrardan kontrol edilmez. Buda &amp;ccedil;ok doğal olarak mesajlaşmanın daha hızlı ger&amp;ccedil;ekleştirilmesini sağlamaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;SecureConversation&lt;/strong&gt; se&amp;ccedil;ildikten sonra, yine security elementinde servis tarafına y&amp;ouml;nelik olacak şekilde bazı ayarları kontrol etmek gerekmektedir. İlk olarak aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;DetectReplays&lt;/strong&gt; se&amp;ccedil;eneğinin &lt;strong&gt;true&lt;/strong&gt; olması sağlanmalıdır ki varsayılan olarak b&amp;ouml;yledir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk230_9.gif" alt="" width="565" height="308" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu kısımda olduk&amp;ccedil;a fazla sayıda ayar ve kafa karıştırıcı &amp;ouml;zellik yer almaktadır. Ancak en &amp;ccedil;ok dikkat &amp;ccedil;ekenlerden birisi &lt;strong&gt;ReplayCacheSize&lt;/strong&gt; değeridir. Buraya atanan değer, tamponda tutulacak olan nonce' ların sayısıdır. S&amp;ouml;z konusu değerin dışına taşılması durumunda, tamponda duran en eski nonce değeri atılacak ve yerine son gelen nonce değeri yazılacaktır. Ancak varsayılan &lt;strong&gt;900000&lt;/strong&gt; değeri pek &amp;ccedil;ok vaka i&amp;ccedil;in yeterli bir sayıdır. Bellek optimizasyonu adına bu değerin azaltılmasıda d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Fakat az &amp;ouml;ncede belirtildiği gibi, sayının dışına &amp;ccedil;ıkılması halindeki durumlar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınmalıdır. Nitekim eski &lt;strong&gt;nonce&lt;/strong&gt;' ların silindiği ve yeni gelenlerin yazıldığı sıralarda sistem cevaplama &lt;strong&gt;saldırılarına(Replay Attack)&lt;/strong&gt; karşı kısa s&amp;uuml;relide olsa savunmasız kalabilir. Bu işlemlerin ardından elbetteki bağlayıcı tipin &lt;strong&gt;g&amp;uuml;venilir bir oturum(Reliable Session) &lt;/strong&gt; a&amp;ccedil;abilmesi i&amp;ccedil;in, yine &lt;strong&gt;Add&lt;/strong&gt; d&amp;uuml;ğmesi ile a&amp;ccedil;ılan pencereden &lt;strong&gt; ReliableSession&lt;/strong&gt; elementi se&amp;ccedil;ilmelidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk230_10.gif" alt="" width="627" height="415" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Artık &amp;ouml;zel bağlayıcı tip i&amp;ccedil;erisinde kullanılacak olan t&amp;uuml;m kanal ve &amp;ouml;zellikler belirlenmiştir. Son aşamada dikkat edilmesi gereken nokta s&amp;ouml;z konusu kanalların uygulanış sırasıdır. Bir başka deyişle &lt;strong&gt;kanal yığını(Channel Stack)&lt;/strong&gt; i&amp;ccedil;erisindeki sıranın &amp;ouml;nemi vardır. Yukarıda geliştirilen &amp;ouml;rneğe g&amp;ouml;re sıra aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki gibi olmalıdır. Buna g&amp;ouml;re reliableSession ile başlayan sıra security, textMessageEncoding(Mesajlaşma Kanalı) ve tcpTransport(iletişim kanalı) şeklinde devam etmelidir. Bu sırayı ayarlamak i&amp;ccedil;in &lt;strong&gt;Up&lt;/strong&gt; ve &lt;strong&gt;Down&lt;/strong&gt; başlıklı d&amp;uuml;ğmeler kullanılabilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk230_11.gif" alt="" width="267" height="204" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Elbette oluşturulan bu &lt;strong&gt;&amp;ouml;zel bağlayıcı tipin(Custom Binding Type)&lt;/strong&gt; kullanılabilmesi i&amp;ccedil;in &lt;strong&gt; endPoint&lt;/strong&gt; ile ilişkilendirilmesi gerekmektedir. Bu sebepten tek yapılması gereken &lt;strong&gt;SiparisServisiEndPoint&lt;/strong&gt; isimli &lt;strong&gt;endPoint&lt;/strong&gt; se&amp;ccedil;ili iken, &lt;strong&gt;Binding&lt;/strong&gt; &amp;ouml;zelliğinin değerinin &lt;strong&gt;customBinding&lt;/strong&gt; olarak işaretlenmesidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk230_12.gif" alt="" width="638" height="297" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlem sırasında &lt;strong&gt;Binding&lt;/strong&gt; değeri &lt;strong&gt;customBinding&lt;/strong&gt; olarak se&amp;ccedil;ildiğinde &lt;strong&gt;BindingConfiguration&lt;/strong&gt; &amp;ouml;zelliğinin değeri otomatik olarak &lt;strong&gt;SiparisServisiOzelBaglayici&lt;/strong&gt; olarak değişecektir. Servis tarafında yapılan bu ayarlardan sonra konfigurasyon dosyasının son hali aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;bindings&amp;gt;
            &amp;lt;customBinding&amp;gt;
                &amp;lt;binding name="SiparisServisiOzelBaglayici"&amp;gt;
                    &amp;lt;reliableSession /&amp;gt;
                    &amp;lt;security authenticationMode="SecureConversation"&amp;gt;
                        &amp;lt;secureConversationBootstrap /&amp;gt;
                    &amp;lt;/security&amp;gt;
                    &amp;lt;textMessageEncoding /&amp;gt;
                    &amp;lt;tcpTransport /&amp;gt;
                &amp;lt;/binding&amp;gt;
            &amp;lt;/customBinding&amp;gt;
        &amp;lt;/bindings&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service name="SiparisKutuphanesi.SiparisYonetimi"&amp;gt;
                &amp;lt;endpoint address="net.tcp://localhost:4500/SiparisServisi.svc" binding="customBinding" bindingConfiguration="SiparisServisiOzelBaglayici" name="SiparisServisiEndPoint" contract="SiparisKutuphanesi.ISiparisYonetimi" /&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak burada yapılan konfigurasyon değişikliklerinin istemci tarafındaki uygulamada da yapılması gerekmektedir. Ama &amp;ouml;ncesinde istemci i&amp;ccedil;in gerekli &lt;strong&gt;proxy&lt;/strong&gt; sınıfının &lt;strong&gt;svcutil&lt;/strong&gt; aracı yardımıyla aşağıdaki gibi &amp;uuml;retilmesi sağlanmalıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk230_13.gif" alt="" width="639" height="376" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sonrasında ise bu proxy sınıfı &lt;strong&gt; Console&lt;/strong&gt; tipinden tasarlanan istemci uygulamaya taşınarak kullanılır. İstemci uygulamanın kodları ve konfigurasyon dosyasının i&amp;ccedil;eriği ise aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;İstemci uygulama kodları;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace Istemci
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Sipariş vermek i&amp;ccedil;in tuşa basın...");
            Console.ReadLine();
            SiparisServisiClient cli = new SiparisServisiClient("IstemciEndPoint");
            cli.SiparisEkle(1);
            cli.SiparisEkle(4); 
            cli.SiparisleriOnayla();
            Console.WriteLine("İşlemler tamamlandı...&amp;Ccedil;ıkmak i&amp;ccedil;in bir tuşa basınız");
            Console.ReadLine(); 
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İstemci uygulama basit olarak servis &amp;uuml;zerinden SiparisEkle ve SiparisleriOnayla metodlarını &amp;ccedil;ağırmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;İstemci tarafı konfigurasyon dosyası;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;bindings&amp;gt;
            &amp;lt;customBinding&amp;gt;
                &amp;lt;binding name="SiparisIstemciOzelBaglayici"&amp;gt;
                    &amp;lt;reliableSession /&amp;gt;
                    &amp;lt;security authenticationMode="SecureConversation"&amp;gt;
                        &amp;lt;secureConversationBootstrap /&amp;gt;
                    &amp;lt;/security&amp;gt;
                    &amp;lt;textMessageEncoding /&amp;gt;
                    &amp;lt;tcpTransport /&amp;gt;
                &amp;lt;/binding&amp;gt;
            &amp;lt;/customBinding&amp;gt;
        &amp;lt;/bindings&amp;gt;
        &amp;lt;client&amp;gt;
            &amp;lt;endpoint address="net.tcp://localhost:4500/SiparisServisi.svc" binding="customBinding" bindingConfiguration="SiparisIstemciOzelBaglayici" contract="SiparisServisi" name="IstemciEndPoint"&amp;gt;
            &amp;lt;/endpoint&amp;gt;
        &amp;lt;/client&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;İstemci tarafındaki konfigurasyon dosyasının daha kolay &amp;uuml;retilmesi amacıyla, istemci uygulamaya standard bir &lt;strong&gt;app.config&lt;/strong&gt; dosyası eklendikten sonra &lt;strong&gt;Service Configuration Editor &lt;/strong&gt;yardımıyla a&amp;ccedil;ılan pencerede&lt;strong&gt; Create a New Client&lt;/strong&gt; sonrası a&amp;ccedil;ılan &lt;strong&gt;New Client Element Wizard&lt;/strong&gt; b&amp;ouml;l&amp;uuml;m&amp;uuml; kullanılabilir. Burada &lt;strong&gt;From service config &lt;/strong&gt;se&amp;ccedil;ili iken &lt;strong&gt;Config File &lt;/strong&gt;kısmına servis uygulamasındaki konfigurasyon dosyasını işaret etmek yeterlidir. Yanlız burada &lt;strong&gt;proxy&lt;/strong&gt; sınıfı kullanıldığı i&amp;ccedil;in &lt;strong&gt;s&amp;ouml;zleşme aray&amp;uuml;z&amp;uuml;(Contract Interface) &lt;/strong&gt;adının servis tarafındaki gibi olmadığı unutulmamalıdır. Bu nedenle bu &amp;uuml;retim sonrasında oluşan konfigurasyon i&amp;ccedil;erisinde &lt;strong&gt;endPoint&lt;/strong&gt; elementinde yer alan binding &lt;strong&gt; niteliğinin(attribute)&lt;/strong&gt; değeri uygun şekilde değiştirilmelidir. &amp;Ouml;rnekte bu değer SiparisServisi olarak değiştirilmelidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk230_14.gif" alt="" width="610" height="444" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Gelinen bu noktadan sonra sistem test edilebilir. S&amp;ouml;z konusu sistem cevaplama saldırılarına karşı &amp;ouml;nlem alan &amp;ouml;zel bir bağlayıcı tipi kullanmaktadır. &amp;Ouml;rnek uygulamalarda yine logların izlenmesi işlemi ger&amp;ccedil;ekleştirilirse mesajların i&amp;ccedil;eriğinde yazının başındada belirtilen tanımlama değerlerinin yer aldığı (&lt;strong&gt;timestamp&lt;/strong&gt; gibi...), bununla birlikte mesajların boyutlarının dahada arttığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r. Mesaj boyutlarındaki bu artış &amp;ccedil;ok doğal olarak paketlerin b&amp;uuml;y&amp;uuml;mesi anlamınada gelmektedir. Ancak vaka i&amp;ccedil;erisinde &lt;strong&gt;Replay Attack&lt;/strong&gt; olasılığı var ise bu g&amp;ouml;z ardı edilmeli ve gereken tedbirler alınmalıdır. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/ReplayAttacks.rar"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2007-11-07 12:00:00</pubDate>
  <slug>WCF-Replay-Attack-Etkisini-Hafifletmek-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
    <tag>reply-attack</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>