<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Overload Metodların Gücü</title>
  <description>Bu makalemde sizlere overload kavramından bahsetmek istiyorum. Konunun daha iyi anlaşılabilmesi açısından, ilerliyen kısımlarda basit bir örnek üzerinde de çalışacağız. Öncelikle Overload ne demek bundan bahsedelim. Overload kelime anlamı olarak Aşırı Yükleme anlamına gelmektedir. C# programlama dilinde overload dendiğinde, aynı isme sahip birden fazla metod akla gelir. Bu metodlar aynı isimde olmalarına rağmen, farklı imzalara sahiptirler. Bu metodların imzalarını belirleyen unsurlar, parametre sayıları ve parametre tipleridir. Overload edilmiş metodları kullandığımız sınıflarda, bu sınıflara ait nesne örnekleri için aynı isme sahip fakat farklı görevleri yerine getirebilen ( veya aynı görevi farklı sayı veya tipte parametre ile yerine getirebilen ) fonksiyonellikler kazanmış oluruz.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemde sizlere overload kavramından bahsetmek istiyorum. Konunun daha iyi anlaşılabilmesi a&amp;ccedil;ısından, ilerliyen kısımlarda basit bir &amp;ouml;rnek &amp;uuml;zerinde de &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikle Overload ne demek bundan bahsedelim. Overload kelime anlamı olarak Aşırı Y&amp;uuml;kleme anlamına gelmektedir. C# programlama dilinde overload dendiğinde, aynı isme sahip birden fazla metod akla gelir. Bu metodlar aynı isimde olmalarına rağmen, farklı imzalara sahiptirler. Bu metodların imzalarını belirleyen unsurlar, parametre sayıları ve parametre tipleridir. Overload edilmiş metodları kullandığımız sınıflarda, bu sınıflara ait nesne &amp;ouml;rnekleri i&amp;ccedil;in aynı isme sahip fakat farklı g&amp;ouml;revleri yerine getirebilen ( veya aynı g&amp;ouml;revi farklı sayı veya tipte parametre ile yerine getirebilen ) fonksiyonellikler kazanmış oluruz.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin;&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk4_1.gif" alt="" width="339" height="152" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;em style="mso-bidi-font-style: normal;"&gt;Şekil 1 : Overload metodlar.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şekil 1 de MetodA isminde 3 adet metod tanımı g&amp;ouml;r&amp;uuml;yoruz. Bu metodlar aynı isime sahip olmasına rağmen imzaları nedeni ile birbirlerinden tamamıyla farklı metodlar olarak algılanırlar. Bize sağladığı avantaj ise, bu metodları barındıran bir sınıf nesnesi yarattığımızda aynı isme sahip metodları farklı parametreler ile &amp;ccedil;ağırabilmemizdir. Bu bir anlamda her metoda farklı isim vermek gibi bir karışıklığında bir nebze &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;er. Peki imza dediğimiz olay nedir? Bir metodun imzası şu unsurlardan oluşur.&lt;/p&gt;
&lt;table id="AutoNumber2" border="1" width="640" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td bgcolor="#008000" width="296" height="27"&gt;&lt;strong&gt; Metod İmzası Kabul Edilen Unsurlar&lt;/strong&gt;&lt;/td&gt;
&lt;td bgcolor="#FF0000" width="331" height="27"&gt;&lt;strong&gt; Metod İmzası Kabul Edilmeyen Unsurlar&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#008000" width="296" height="35"&gt;Parametre Sayısı
&lt;p&gt;Parametrenin Tipleri&lt;/p&gt;
&lt;/td&gt;
&lt;td bgcolor="#FF0000" width="331" height="35"&gt;Metodun Geri D&amp;ouml;n&amp;uuml;ş Tipi&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Tablo 1. Kullanım Kuralları&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Yukarıdaki unsurlara dikkat ettiğimiz s&amp;uuml;rece dilediğimiz sayıda aşırı y&amp;uuml;klenmiş ( overload edilmiş) metod yazabiliriz. Şimdi dilerseniz k&amp;uuml;&amp;ccedil;&amp;uuml;k bir Console uygulaması ile , overload metod oluşumuna engel teşkil eden duruma bir g&amp;ouml;z atalım.&amp;Ouml;ncelikle metodun geri d&amp;ouml;n&amp;uuml;ş tipinin metodun imzası olarak kabul edilemiyeceğininden bahsediyoruz. Aşğıdaki &amp;ouml;rneğimizi inceleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using

System; 
namespace

Overloading1
{
    class Class1
     {
          public int Islem(int a)
          {
               return a*a;
          }

          public string Islem(int a)
          {
               string b=System.Convert.ToString(a);
               return "Yaşım:"+b;
          } 

          [STAThread]
          static void Main(string[] args)
          {
          }
     }
}&lt;/pre&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;table id="AutoNumber3" border="1" width="76%" cellspacing="1" bgcolor="#FF0000"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="100%" height="38"&gt;
&lt;p align="center"&gt;&lt;strong style="mso-bidi-font-weight: normal;"&gt; Overloading1.Class1' already defines a member called 'Islem' with the same parameter types&lt;/strong&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&amp;Ouml;rneğin yukarıdaki uygulamada, Islem isimli iki metod tanımlanmıştır. Aynı parametre tipi ve sayısına sahip olan bu metodların geri d&amp;ouml;n&amp;uuml;ş değerlerinin farklı olması nedeni ile derleyici tarafından farklı metodlar olarak algılanmış olması gerektiği d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Ancak b&amp;ouml;yle olmamaktadır. Uygulamayı derlemeye &amp;ccedil;alıştığımızda aşağıdaki hata mesajı ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;Yapıcı metodlarıda overload edebiliriz. Bu da olduk&amp;ccedil;a &amp;ouml;nemli bir noktadır. Bunu zaten .NET ile program geliştirirken sık&amp;ccedil;a kullanırız. &amp;Ouml;rneğin SqlConnection sınıfından bir nesne &amp;ouml;rneği yaratmak istediğimizde, bunu yapabileceğimiz 2 overload edilmiş yapıcı metod olduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bunlardan birisi aşıda g&amp;ouml;r&amp;uuml;nmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk4_3.gif" alt="" width="522" height="79" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 2. &amp;Ouml;rnek bir Overload Constructor(Aşırı Y&amp;uuml;klenmiş Yapıcı) metod.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Dolayısıyla bizde yazdığımız sınıflara ait constructorları overload edebiliriz. Şimdi dilerseniz overload ile ilgili olaraktan kısa bir uygulama geliştirelim. Bu uygulamada yazdığımız bir sınıfa ait constructor metodları overload ederek değişik tipte fonksiyonellikler edinmeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p class="MsoNormal" align="justify"&gt;Bu uygulamada KolayVeri isminde bir sınıfımız olucak. Bu sınıfın &amp;uuml;&amp;ccedil; adet yapıcısı olucak. Yani iki adet overload constructor yazıcaz. İki tane diyorum &amp;ccedil;&amp;uuml;nk&amp;uuml; C# zaten default constructoru biz yazmasak bile uygulamaya ekliyor. Bu default constructorlar parametre almayan constructorlardır. Overload ettiğimiz constructor metodlardan birisi ile, se&amp;ccedil;tiğimiz bir veritabanına bağlanıyoruz. Diğer overload metod ise, parametre olarak veritabanı adından başka, veritabanına bağlanmak i&amp;ccedil;in kullanıcı adı ve parola parametrelerinide alıyor. Nitekim &amp;ccedil;oğu zaman veritabanlarımızda yer alan bazı tablolara erişim yetkisi sınırlamaları ile karşılaşabiliriz. Bu durumda bu tablolara bağlantı a&amp;ccedil;abilmek i&amp;ccedil;in yetkili kullanıcı adı ve parolayı kullanmamız gerekir. B&amp;ouml;yle bir olayı canlandırmaya &amp;ccedil;alıştım. Elbetteki asıl amacımız overload constructor metodların nasıl yazıldığını, nasıl kullanıldığını g&amp;ouml;stermek. &amp;Ouml;rnek gelişmeye &amp;ccedil;ok, hemde &amp;ccedil;ok a&amp;ccedil;ık. Şimdi uygulamamızın bu ilk kısmına bir g&amp;ouml;zatalım. Aşğıdakine benzer bir form tasarım yapalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk4_4.gif" alt="" width="467" height="321" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi sıra geldi kodlarımızı yazmaya. &amp;Ouml;ncelikle uygulamamıza KolayVeri adında bir class ekliyoruz. Bu class&amp;rsquo;ın kodları aşağıdaki gibidir. Aslında uygulamaya bu aşamada baktığımızda SqlConnection nesnemizin bir bağlantı oluşturmasını &amp;ouml;zelleştirmiş gibi oluyoruz. Ger&amp;ccedil;ektende aynı işlemleri zaten SqlConnection nesnesini overload constructor&amp;rsquo;lari ile yapabiliyoruz. Ancak temel amacımız aşırı y&amp;uuml;klemeyi anlamak olduğu i&amp;ccedil;in programın &amp;ccedil;alışma amacının &amp;ccedil;ok &amp;ouml;nemli olmadığı d&amp;uuml;ş&amp;uuml;ncesindeyim. Umuyorum ki sizlere aşırı y&amp;uuml;kleme hakkında bilgi verebiliyor ve vizyonunuzu geliştirebiliyorumdur.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

using System.Data.SqlClient;

namespace Overloading
{
    public class KolayVeri
    {
        private string baglantiDurumu; /* Connection'ın durumunu tutacak ve sadece bu class i&amp;ccedil;inde ge&amp;ccedil;erli olan bir string değişken tanımladık. private anahtar kelimesi değişkenin sadece bu class i&amp;ccedil;erisinde yaşayabilceğini belirtir. Yazmayabilirizde, nitekim C# default olarak değişkenleri private kabul eder.*/
        public string BaglantiDurumu /* Yukarıda belirttiğimiz baglantiDurumu isimli değişkenin sahip olduğu değeri, bu class'a ait nesne &amp;ouml;rneklerini kullandığımız yerde g&amp;ouml;rebilmek i&amp;ccedil;in sadece okunabilir olan (readonly), bu sebeplede sadece Get bloğuna sahip olan bir &amp;ouml;zellik tanımlıyoruz.*/
        {
            get
            {
                return baglantiDurumu; /* Bu &amp;ouml;zelliğe eriştiğimizde baglantiDurumu değişkeninin o anki değeri geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;lecek. Yani &amp;ouml;zelliğin &amp;ccedil;ağırıldığı yere d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;cek.*/
            }
        }
        public KolayVeri() /* İşte C# derleyicisinin otomatik olarak eklediği parametresiz yapıcı metod. Biz bu yapıcıya tek satırlık bir kod ekliyoruz. Eğer nesne &amp;ouml;rneği parametresiz bir Constructor ile yapılırsa bu durumda baglantinin kapalı olduğunu belirtmek i&amp;ccedil;in baglantiDurumu değişkenine bir değer atıyoruz. Bu durumda uygulamamızda bu nesne &amp;ouml;rneğinin BaglantiDurumu &amp;ouml;zelliğine eriştiğimizde BAGLANAMADIK değerini elde edeceğiz.*/
        {
            baglantiDurumu = "BAGLANAMADIK";
        }

        public KolayVeri(string veritabaniAdi) /* Bizim yazdığımı aşırı y&amp;uuml;klenmiş ilk yapıcı metoda gelince. Burada yapıcımız, parametre olarak bir string alıyor. Bu string veritabanının adını barındırıcak ve SqlConnection nesnemiz i&amp;ccedil;in gerekli bağlantı stringine bu veritabanının adını ge&amp;ccedil;iricek.*/
        {
            string connectionString = "initial catalog=" + veritabaniAdi + ";data source=localhost;integrated security=sspi";
            SqlConnection con = new SqlConnection(connectionString); /* SqlConnection bağlantımız yaratılıyor.*/

            try /* Bağlantı işlemini bir try bloğunda yapıyoruz ki, herhangibir nedenle Sql sunucusuna bağlantı sağlanamassa (&amp;ouml;rneğin hatalı veritabanı adı nedeni ile) catch bloğunda baglantiDurumu değişkenine BAGLANAMADIK değerini atıyoruz. Bu durumda program i&amp;ccedil;inde KolayVeri sınıfından &amp;ouml;rnek nesnenin BaglantiDurumu &amp;ouml;zelliğinin değerine baktığımızda BAGLANAMADIK değerini alıyoruz b&amp;ouml;ylece bağlantının sağlanamadığına kanaat getiriyoruz. Kanaat dedikte aklıma &amp;Uuml;sk&amp;uuml;darda ki Kanaat lokantası geldi :) Yemekleri &amp;ccedil;ok g&amp;uuml;zeldir. Sanırım karnımız acıktı değerli okuyucularım.Neyse kaldığımız yerden devam edelim.*/
            {
                con.Open();
                // Bağlantımız a&amp;ccedil;ılıyor.
                baglantiDurumu = "BAGLANDIK";
                /* BaglantiDurumu &amp;ouml;zelliğimiz (Property), baglantiDurumu değişkeni sayesinde BAGLANDIK değerini alıyor.*/
            }
            catch (Exception hata) /* Eğer bir hata olursa baglantiDurumu değişkenine BAGLANAMADIK değerini atıyoruz.*/
            {
                baglantiDurumu = "BAGLANAMADIK";
            }
        }

        public KolayVeri(string veritabaniAdi, string kullaniciAdi, string parola) /* Sıra geldi ikinci overload constructor metoda. Bu metod ekstradan iki parametre daha alıyor. Bir tanesi user id ye tekab&amp;uuml;l edicek olan kullaniciAdi, diğeri ise bu kullanıcı i&amp;ccedil;in password'e tekab&amp;uuml;l edicek olan parola. Bunlari SqlConnection'ın connection stringine alarak , veritabanına belirtilen kullanıcı ile giriş yapmış oluyoruz. Kodların işleyişi bir &amp;ouml;nceki metodumuz ile aynı.*/
        {
            string connectionString = "initial catalog=" + veritabaniAdi + ";data source=localhost;user id=" + kullaniciAdi + ";password=" + parola;
            SqlConnection con = new SqlConnection(connectionString);

            try
            {
                con.Open();
                baglantiDurumu = "BAGLANDIK";
            }
            catch (Exception hata)
            {
                baglantiDurumu = "BAGLANAMADIK";
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi sıra geldi, formumuz &amp;uuml;zerindeki kodları yazmaya.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;string veritabaniAdi;

private void lstDatabase_SelectedIndexChanged(object sender, System.EventArgs e)
{
	veritabaniAdi=lstDatabase.SelectedItem.ToString();
	/* Burada kv adında bir KolayVeri sınıfından nesne &amp;ouml;rneği (object instance) yaratılıyor. Dikkat edicek olursanız burada yazdığımı ikinci overload constructor'u kullandık.*/

	KolayVeri kv= new KolayVeri(veritabaniAdi); /* Burada KolayVeri( dediğimizde .NET bize kullanabileceğimiz aşırı y&amp;uuml;klenmiş constructorları aşağıdaki şekilde olduğu gibi hatırlatacaktır. IntelliSence&amp;rsquo;in g&amp;ouml;z&amp;uuml;n&amp;uuml; seveyim.*/&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk4_5.gif" alt="" width="613" height="159" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;stbDurumBilgisi.Text=lstDatabase.SelectedItem.ToString()+" "+kv.BaglantiDurumu;

private void btnOzelBaglan_Click(object sender, System.EventArgs e)
{
	string kullanici,sifre;
	kullanici=txtKullaniciAdi.Text;

	sifre=txtParola.Text;
	veritabaniAdi=lstDatabase.SelectedItem.ToString();

	KolayVeri kvOzel= new KolayVeri(veritabaniAdi,kullanici,sifre); /* Burada ise diğer aşırı y&amp;uuml;klenmiş yapıcımızı kullanarak bir KolayVeri nesne &amp;ouml;rneği oluşturuyoruz.*/&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk4_6.gif" alt="" width="610" height="147" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;	stbDurumBilgisi.Text=lstDatabase.SelectedItem.ToString()+" "+kvOzel.BaglantiDurumu+" User:"+kullanici;
	}
}&lt;/pre&gt;
&lt;p&gt;Evet şimdide programın nasıl &amp;ccedil;alıştığına bir bakalım. Listbox nesnesi &amp;uuml;zerinde bir veritabanı adına bastığımızda bu veritabanına bir bağlantı a&amp;ccedil;ılır.&lt;/p&gt;
&lt;p class="MsoNormal" style="mso-layout-grid-align: none; text-autospace: none;" align="left"&gt;&lt;img src="/makale/images/mk4_7.gif" alt="" width="457" height="375" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="mso-layout-grid-align: none; text-autospace: none;" align="left"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;Şekil 6. Listboxta tıklanan veritabanına bağlandıktan sonra. &lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Ve birde kullanıcı adı ile parola verilerek nasıl bağlanacağımızı g&amp;ouml;relim.&lt;/p&gt;
&lt;p class="MsoNormal" style="mso-layout-grid-align: none; text-autospace: none;" align="left"&gt;&lt;img src="/makale/images/mk4_8.gif" alt="" width="402" height="375" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="mso-layout-grid-align: none; text-autospace: none;" align="left"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 7. Kullanıcı adı ve parola ile baplantı&lt;/em&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Peki ya yanlış kullanıcı adı veya parola girersek.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk4_9.gif" alt="" width="472" height="373" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" align="left"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 8. Yanlık kullanıcı adı veya parolası sonrası.&lt;/em&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Evet değerli MsAkademik okuyucuları bu seferlikte bu kadar. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler, yarınlar dilerim.&lt;/p&gt;</content>
  <pubDate>2003-11-13 13:00:00</pubDate>
  <slug>overload-metodlarin-gucu</slug>
  <tags>
    <tag>c#</tag>
    <tag>overloading</tag>
    <tag>method-overloading</tag>
    <tag>oop</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>