<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>.Net Remoting - SoapSuds</title>
  <description>Remoting mimarisinde, istemci ve sunucu arasında uzak nesneleri paylaşmanın dört farklı yolu vardır. İstemcilerin tek amacı sunucu üzerinde yer alan uzak nesne referanslarını kullanabilmektir. Bu açıdan bakıldığında, istemci uygulamanın uzak sunucu üzerindeki nesne referanslarının yapısını bilmesi gerektiği ortaya çıkmaktadır. Kullanılabilecek yollardan ilki uzak nesne sınıfının bulunduğu paylaşımlı bir assembly' ı tüm istemci uygulamalara dağıtmaktır. Bu istemci uygulamalar için ekstra kod yazmadan kolayca gerçekleştirilebilecek bir işlemdir. Lakin istemci uygulamalarda, uzak sınıfın tüm içeriğinin yer aldığı bir assembly' da mevcuttur. Bu da ILDASM (Intermediate Dis-Assembler Tool) ve başka üçüncü parti araçlar yardımıyla iş mantığının (business logic) istemci tarafından kolayca okunabileceği anlamına gelir. İşte bu dezavnataj nedeni ile özellikle güvenlik açısından çoğu zaman bu teknik tercih edilmez.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Remoting mimarisinde, istemci ve sunucu arasında uzak nesneleri paylaşmanın d&amp;ouml;rt farklı yolu vardır. İstemcilerin tek amacı sunucu &amp;uuml;zerinde yer alan uzak nesne referanslarını kullanabilmektir. Bu a&amp;ccedil;ıdan bakıldığında, istemci uygulamanın uzak sunucu &amp;uuml;zerindeki nesne referanslarının yapısını bilmesi gerektiği ortaya &amp;ccedil;ıkmaktadır. Kullanılabilecek yollardan ilki uzak nesne sınıfının bulunduğu paylaşımlı bir assembly' ı t&amp;uuml;m istemci uygulamalara dağıtmaktır. Bu istemci uygulamalar i&amp;ccedil;in ekstra kod yazmadan kolayca ger&amp;ccedil;ekleştirilebilecek bir işlemdir. Lakin istemci uygulamalarda, uzak sınıfın t&amp;uuml;m i&amp;ccedil;eriğinin yer aldığı bir assembly' da mevcuttur. Bu da ILDASM (Intermediate Dis-Assembler Tool) ve başka &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; parti ara&amp;ccedil;lar yardımıyla iş mantığının (business logic) istemci tarafından kolayca okunabileceği anlamına gelir. İşte bu dezavnataj nedeni ile &amp;ouml;zellikle g&amp;uuml;venlik a&amp;ccedil;ısından &amp;ccedil;oğu zaman bu teknik tercih edilmez.&lt;/p&gt;
&lt;p&gt;İkinci y&amp;ouml;ntem ve belkide en pop&amp;uuml;ler olanı, uzak sınıf modelinin t&amp;uuml;retildiği bir interface tipini istemci ve sunucu arasında paylaşıma sunmaktır. Yani istemci tarafında sadece ve sadece uzak nesne modelinin bilgisini tutan bir interface tipi yer alacaktır. Bu modele g&amp;ouml;re uzak sunucu &amp;uuml;zerindeki uzak nesne referansına polimorfizm' in bir sonucu olarak interface tipi &amp;uuml;zerinden erişebilinir. Ama daha da &amp;ouml;nemlisi istemci tarafında, uzak nesne i&amp;ccedil;erisindeki kodların kesinlikle g&amp;ouml;r&amp;uuml;nm&amp;uuml;yor oluşudur. Bu da doğal olarak iş mantığını istemciden gizleyen etkili bir tekniktir. .Net Remoting uygulamalarını yazarken &amp;ccedil;oğunlukla interface kullanımı tercih edilmektedir.&lt;/p&gt;
&lt;p&gt;&amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; model abstract modeli ele alır ve &amp;ouml;zellikle nesne &amp;uuml;retiminin istemciden soyutlanması s&amp;ouml;z konusu ise Fabrika Tasarım Desenini (Factory Design Pattern) uygular. Bu model i&amp;ccedil;erisinde, interface modeline benzer olarak istemci tarafından iş mantığı ve &amp;ouml;zellikle uzak nesnenin &amp;uuml;retiliş bi&amp;ccedil;imi soyutlanmaktadır. Ne yazıkki bu modelin uygulanması &amp;ccedil;oğu zaman kolay değildir. &amp;Ccedil;&amp;uuml;nk&amp;uuml; daha ileri seviye kod yazımını gerektirmektedir. Bu modelin kullanılabilmesi i&amp;ccedil;in abstract mimari, tasarım desenleri gibi kavramlara aşina olmak gerekir.&lt;/p&gt;
&lt;p&gt;D&amp;ouml;rd&amp;uuml;nc&amp;uuml; ve son model ise istemci tarafındaki uygulamaların, kullanmak istedikleri uzak nesneye ait metadata bilgisini sağlayan SoapSuds aracını ele alır. Bu modelde, istemci tarafında uzak nesneye ait sadece tip ve &amp;uuml;ye bilgilerini i&amp;ccedil;eren bir assembly s&amp;ouml;z konusudur. Yani istemci tarafında sadece uzak nesneye ait metadata bilgisi yer alır. Bu da elbetteki iş mantığını istemciden gizleyen bir modeldir. Ancak &amp;ouml;zellikle interface ve abstract modelinin etklinliği nedeni ile SoapSuds modeli değerini kaybetmektedir. Yinede SoapSuds modelini bilmekte yarar vardır. İşte bu makalemizde SoapSuds modelini incelemeye &amp;ccedil;alışacağız. Bu modeller arasında elbetteki bir takım avantaj ve dezavantajlar s&amp;ouml;z konusudur. &amp;Ouml;rneğin interface , abstract veya soapSuds modelleri bağlantısız &amp;ccedil;alışmaya izin vermezler. Bunun en b&amp;uuml;y&amp;uuml;k nedeni elbette iş yapacak nesnel kodların istemci tarafında bulunmayışıdır. Bu tip bir ihtiyaca ancak ve ancak Paylaşımlı Assembly modeli cevap verecektir. Ancak .Net Remoting uygulamalarının tasarım amacı d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde bu son derece u&amp;ccedil; bir &amp;ouml;rnektir. Bahsedilen d&amp;ouml;rt model arasındaki temel farklılıkları ve birbirlerine olan &amp;uuml;st&amp;uuml;nl&amp;uuml;klerini aşağıdaki tabloda &amp;ouml;zet olarak bulabilirsiniz.&lt;/p&gt;
&lt;table id="table64" style="border-collapse: collapse; width: 100%;" border="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;Model&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;Dezavantajları&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;Avantajları&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;Paylaşımlı Assembly (Shared Assembly)&lt;/td&gt;
&lt;td&gt;İstemci tarafından iş mantığının g&amp;ouml;r&amp;uuml;lebilmesi.&lt;/td&gt;
&lt;td&gt;Geliştirme kolaylığı. Bağlantılı ve bağlantısız &amp;ccedil;alışma desteği.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;Interface&lt;/td&gt;
&lt;td&gt;Bağlantılı ve bağlantısız katman modeline cevap verememesi.&lt;/td&gt;
&lt;td&gt;İstemci tarafından iş mantığının gizlenmesi (security).&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;Abstract&lt;/td&gt;
&lt;td&gt;Bağlantılı ve bağlantısız katman modeline cevap verememesi.&lt;br /&gt; &lt;br /&gt; Kodlamanın zor oluşu.&lt;/td&gt;
&lt;td&gt;İş mantığının gizlenmesi (security) ve uzak nesne &amp;uuml;retim işlemlerinin soyutlanması.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;SoapSuds&lt;/td&gt;
&lt;td&gt;Bağlantılı ve bağlantısız katman modeline cevap verememesi.&lt;br /&gt; &lt;br /&gt; Wrapped proxy se&amp;ccedil;eneğinde sadece HTTP desteği olması.&lt;/td&gt;
&lt;td&gt;İş mantığının istemci tarafından gizlenmesi. (security).&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;SoapSuds modelinde, istemci tarafında uzak nesneye ait metadata' yı i&amp;ccedil;eren bir assembly &amp;uuml;retimi s&amp;ouml;z konusudur. Framework ile gelen SoapSuds aracının en temel amacı bu assembly' ı &amp;uuml;retmektir. Burada &amp;uuml;retilen assembly aslında fiziki bir proxy nesnesi g&amp;ouml;revini &amp;uuml;stlenir. Proxy' nin iki farklı &amp;uuml;retiliş şekli vardır. Wrapped Proxy yada Non-Wrapped Proxy. Wrapped Proxy tipinde, sadece SOAP ve HTTP protokol&amp;uuml; desteklenmektedir. Bunun dışında bu modeli uygularken istemci tarafında channel, port gibi konfigurasyon ayarlarının yapılmasına gerek kalınmaz. &amp;Ccedil;&amp;uuml;nk&amp;uuml; bu tip bilgiler WSDL talebi sonucu &amp;uuml;retilen Proxy Assembly' ın i&amp;ccedil;erisine kaydedilmektedir. Non-Wrapped Proxy modeli ise hem HTTP hem de TCP protokol&amp;uuml;ne destek verebilmektedir(Teorik Olarak). Non-Wrapped Proxy modelinde,Wrapped Proxy Assembly' da yapılmayan konfigurasyon ayarlarının da yapılması gerekir. Hangi tip olursa olsun sonu&amp;ccedil; itibariyle SoapSuds modeli, istemcinin uzak nesneyi kullanabilmesi i&amp;ccedil;in gerekli bilgileri i&amp;ccedil;eren bir metadata sağlar ve bunu kullanarak bir proxy assembly &amp;uuml;retir. Şimdi dilerseniz SoapSuds modelini &amp;ouml;rnekler &amp;uuml;zerinde incelemeye &amp;ccedil;alışalım. İlk olarak &amp;ouml;rneklerimizde kullanacağımız uzak nesneye ait sınıfımızı ve sunucu uygulamamızı tasarlayarak işe başlayacağız.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Uzak nesne sınıfı kodları;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk164_1.gif" alt="" width="307" height="235" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace RemoteObjects
{
    public class Matematik:MarshalByRefObject
    {
        public Matematik()
        {
            Console.WriteLine("Uzak nesne yapıcı metod &amp;ccedil;ağırıldı...");
        }
        public double Toplam(double deger1, double deger2)
        {
            return deger1 + deger2;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Sunucu Uygulama;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class Program
{
    static void Main(string[] args)
    {
        RemotingConfiguration.Configure("..\\..\\App.config",false);
        Console.WriteLine("Sunucu dinlemede...");
        Console.ReadLine();
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Sunucu Konfigurasyon bilgisi;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.runtime.remoting&amp;gt;
        &amp;lt;application&amp;gt;
            &amp;lt;channels&amp;gt;
                &amp;lt;channel ref="Http Server" port="9800"/&amp;gt;
            &amp;lt;/channels&amp;gt;
            &amp;lt;service&amp;gt;
                &amp;lt;wellknown type="RemoteObjects.Matematik,RemoteObjects" objectUri="Matematik.soap" mode="Singleton"/&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/application&amp;gt;
    &amp;lt;/system.runtime.remoting&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Şimdi ilk olarak SopaSuds aracını sunucu &amp;uuml;zerinde &amp;ccedil;alıştırıyor ve Wrapped Proxy' ımızı &amp;uuml;retiyoruz. Bunun i&amp;ccedil;in Visual Studio.2005 Command Prompt' u kullanabiliriz. SoapSuds aracını kullanırken Proxy Assembly' ı &amp;uuml;retebilmemiz i&amp;ccedil;in Sunucu uygulamanın mutlaka &amp;ccedil;alışıyor olması gerekmektedir. Bu arada yazdığımız komut satırındaki SOAP uzantısına ve WSDL (Web Service Description Language) talebine dikkat edelim. Burada oa anahtarı Output Assembly anlamına gelmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Komut :&lt;/strong&gt; SoapSuds -url:http://manchester:9800/Matematik.soap?wsdl -oa:MatMetaData.dll&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk164_2.gif" alt="" width="639" height="315" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Komutu uygularken dikkat ederseniz ?wsdl takısı kullanılıyor. Bunun sebebi Metadata' nın SOAP &amp;uuml;zerinden elde edilen WSDL d&amp;ouml;k&amp;uuml;manına bakılarak &amp;ccedil;ıkartılmasıdır. Eğer tarayıcı penceresinden http://manchester:9800/Matematik.soap?wsdl yazarsanız aşağıdakine bezner bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; elde edersiniz. Bu web servislerinden aşina olduğumuz WSDL d&amp;ouml;k&amp;uuml;manıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk164_5.gif" alt="" width="531" height="448" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından komutu &amp;ccedil;alıştırdığımız klas&amp;ouml;rde MatMetaData.dll isimli bir assembly oluşturulduğunu g&amp;ouml;rebiliriz. Bu Wrapped Proxy t&amp;uuml;r&amp;uuml;ndendir. Şimdi ILDASM aracı yardımıyla MatMetaData.dll ve RemoteObjects.dll' lerini birbirleriyle karşılaştıralım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk164_3.gif" alt="" width="468" height="548" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak &amp;ccedil;ıktıların aynı olmadığı hemen g&amp;ouml;ze &amp;ccedil;arpmaktadır. SoapSuds &amp;uuml;rettiği assembly i&amp;ccedil;erisine WSDL' i kullanarak uzak nesneye nasıl erişeceğine dair bilgiler i&amp;ccedil;eren ek &amp;uuml;yeler atmıştır. Dahası Matematik sınıfı i&amp;ccedil;erisindeki Constructor ve Toplam metodlarının MsIL kodlarına bakacak olursak, &amp;uuml;ye i&amp;ccedil;i kodların yansıtılmadığını kolayca g&amp;ouml;rebiliriz. Buda istemcinin, uzak nesne iş mantığına ait kodları asla g&amp;ouml;remeyeceği anlamına gelmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;MatMetaData.dll' i i&amp;ccedil;indeki Matematik sınıfı i&amp;ccedil;in Constructor i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;.method public hidebysig specialname rtspecialname 
instance void .ctor() cil managed
{
// Code size 28 (0x1c)
.maxstack 8
IL_0000: ldarg.0
IL_0001: call instance void [System.Runtime.Remoting]System.Runtime.Remoting.Services.RemotingClientProxy::.ctor()
IL_0006: nop
IL_0007: nop
IL_0008: ldarg.0
IL_0009: ldarg.0
IL_000a: call instance class [mscorlib]System.Type [mscorlib]System.Object::GetType()
IL_000f: ldstr "http://manchester:9800/Matematik.soap"
IL_0014: call instance void [System.Runtime.Remoting]System.Runtime.Remoting.Services.RemotingClientProxy::ConfigureProxy(class [mscorlib]System.Type,
string)
IL_0019: nop
IL_001a: nop
IL_001b: ret
} // end of method Matematik::.ctor&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;RemoteObjects.dll i&amp;ccedil;indeki Matematik sınıfı i&amp;ccedil;in Constructor i&amp;ccedil;eriği&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;.method public hidebysig specialname rtspecialname 
instance void .ctor() cil managed
{
// Code size 21 (0x15)
.maxstack 8
IL_0000: ldarg.0
IL_0001: call instance void [mscorlib]System.MarshalByRefObject::.ctor()
IL_0006: nop
IL_0007: nop
IL_0008: ldstr bytearray (55 00 7A 00 61 00 6B 00 20 00 6E 00 65 00 73 00 // U.z.a.k. .n.e.s.
6E 00 65 00 20 00 79 00 61 00 70 00 31 01 63 00 // n.e. .y.a.p.1.c.
31 01 20 00 6D 00 65 00 74 00 6F 00 64 00 20 00 // 1. .m.e.t.o.d. .
E7 00 61 00 1F 01 31 01 72 00 31 01 6C 00 64 00 // ..a...1.r.1.l.d.
31 01 2E 00 2E 00 2E 00 ) // 1.......
IL_000d: call void [mscorlib]System.Console::WriteLine(string)
IL_0012: nop
IL_0013: nop
IL_0014: ret
} // end of method Matematik::.ctor&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;MatMetData.dll i&amp;ccedil;indeki Matematik sınıfı i&amp;ccedil;in Toplam metodu i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;.method public hidebysig instance float64 
Toplam(float64 deger1,
float64 deger2) cil managed
{
.custom instance void [mscorlib]System.Runtime.Remoting.Metadata.SoapMethodAttribute::.ctor() = ( 01 00 01 00 54 0E 0A 53 6F 61 70 41 63 74 69 6F // ....T..SoapActio
6E 55 68 74 74 70 3A 2F 2F 73 63 68 65 6D 61 73 // nUhttp://schemas
2E 6D 69 63 72 6F 73 6F 66 74 2E 63 6F 6D 2F 63 // .microsoft.com/c
6C 72 2F 6E 73 61 73 73 65 6D 2F 52 65 6D 6F 74 // lr/nsassem/Remot
65 4F 62 6A 65 63 74 73 2E 4D 61 74 65 6D 61 74 // eObjects.Matemat
69 6B 2F 52 65 6D 6F 74 65 4F 62 6A 65 63 74 73 // ik/RemoteObjects
23 54 6F 70 6C 61 6D ) // #Toplam
// Code size 24 (0x18)
.maxstack 3
.locals init ([0] float64 CS$1$0000)
IL_0000: nop
IL_0001: ldarg.0
IL_0002: ldfld object [System.Runtime.Remoting]System.Runtime.Remoting.Services.RemotingClientProxy::_tp
IL_0007: castclass RemoteObjects.Matematik
IL_000c: ldarg.1
IL_000d: ldarg.2
IL_000e: callvirt instance float64 RemoteObjects.Matematik::Toplam(float64,
float64)
IL_0013: stloc.0
IL_0014: br.s IL_0016
IL_0016: ldloc.0
IL_0017: ret
} // end of method Matematik::Toplamt&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;RemoteObjects.dll i&amp;ccedil;indeki Matematik sınıfı i&amp;ccedil;in Toplam metodu i&amp;ccedil;eriği;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;.method public hidebysig instance float64 
Toplam(float64 deger1,
float64 deger2) cil managed
{
// Code size 9 (0x9)
.maxstack 2
.locals init ([0] float64 CS$1$0000)
IL_0000: nop
IL_0001: ldarg.1
IL_0002: ldarg.2
IL_0003: add
IL_0004: stloc.0
IL_0005: br.s IL_0007
IL_0007: ldloc.0
IL_0008: ret
} // end of method Matematik::Toplam&lt;/pre&gt;
&lt;p&gt;Dikkat ederseniz, &amp;uuml;retilen Wrapped Proxy i&amp;ccedil;erisinde SOAP &amp;uuml;zerinden HTTP protokol&amp;uuml;n&amp;uuml; kullanarak yapılacak &amp;uuml;ye &amp;ccedil;ağrıları i&amp;ccedil;in gerekli bilgiler yer almaktadır. Şimdi &amp;uuml;retilen bu Wrapped Proxy' ı &amp;ouml;rnek bir istemcide kullanalım. &amp;Ouml;ncelikle yapmamız gereken SoapSuds ile &amp;uuml;retilen Wrapped Proxy' ı istemci uygulamamıza referans etmek olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk164_4.gif" alt="" width="173" height="131" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;İstemci uygulama;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Text;
using RemoteObjects;

namespace ClientApp
{
    class Program
    {
        static void Main(string[] args)
        {
            Matematik mt = new Matematik();
            Console.WriteLine(mt.Toplam(3, 4).ToString());
            Console.ReadLine();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Burada dikkat ederseniz sıradan istemci uygulamalarındaki remoting i&amp;ccedil;in gerekli hi&amp;ccedil; bir konfigurasyon ayarı yoktur. Oysaki kanal bilgisinin (channel) ya da SAO(Server Activated Object) veya CAO (Client Activated Object) i&amp;ccedil;in gerekli kayıt işlemlerinin yapılmış olması gerekmektedir. Bunların yapılmayışının nedeni, uzak nesneyi kullanabilmek i&amp;ccedil;in gerekli erişim bilgilerinin, SoapSuds ile &amp;uuml;retilen Wrapped Proxy i&amp;ccedil;erisinde olmasıdır. Şimdi remote uygulamamızı test edebiliriz. &lt;em&gt;(Aşağıdaki videoyu izleyebilmek i&amp;ccedil;in Flash Player gereklidir.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;object id="obj1" width="481" height="313" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/SoapSuds_1.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="481" height="313" src="http://www.buraksenyurt.com/makale/images/SoapSuds_1.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj1" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, istemci uygulama &amp;ccedil;alıştığında sunucu &amp;uuml;zerinde Matematik sınıfına ait yapıcı metod &amp;ccedil;alıştırılmıştır. Bu, istemcinin ger&amp;ccedil;ekten sunucu &amp;uuml;zerindeki bir referansı kullandığının kanıtıdır. Dahası, sunucuyu &amp;ccedil;alıştırmadan istemci uygulamayı &amp;ccedil;alıştırmayı denerseniz, &lt;em&gt;"System.Net.Sockets.SocketException: No connection could be made becaus&lt;br /&gt; e the target machine actively refused it"&lt;/em&gt; istisnasını alırsınız ki buda remote sistemin ger&amp;ccedil;ekten tamalandığı anlamına gelir.&lt;/p&gt;
&lt;p&gt;Gelelim Non-Wrapped Proxy modeline. Bu modelde, &amp;uuml;retilen assembly i&amp;ccedil;erisinde sadece sınıfa ait metadata bilgisi bulunur. Dolayısıyla, Wrapped Proxy' lerde olduğu gibi sadece HTTP protokol&amp;uuml;ne bağlı değildir. TCP protokol&amp;uuml;n&amp;uuml;de ele alabiliriz. Non-Wrapped Proxy kullanırken istemci tarafında gerekli konfigurasyon ayaları da yapılmalıdır. Bu sayede sunucu &amp;uuml;zerinde meydana gelecek kanal ve port değişikliklerini istemci tarafınada yansıtabiliriz. Oysaki Wrapped proxy tipine g&amp;ouml;re SoapSuds aracı ile metadata' yı i&amp;ccedil;eren assembly' ı yeniden &amp;uuml;retmemiz ve dağıtmamız gerekecektir. Yukarıdaki &amp;ouml;rneğimizi ele aldığımızda, Non-Wrapped Proxy' imizi oluşturmak i&amp;ccedil;in SoapSuds aracını aşağıdaki şekilde kullanmamız yeterlidir. SoapSuds aracı yardımıyla Assembly' ın &amp;uuml;retilebilmesi i&amp;ccedil;in &amp;ouml;nceden sunucu uygulamanın &amp;ccedil;alışıyor olması gerektiğini l&amp;uuml;tfen unutmayınız. Non-Wrapped Proxy &amp;uuml;retimi i&amp;ccedil;in SoapSuds aracında -nowp anahtarı kullanılır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Komut :&lt;/strong&gt; SoapSuds &lt;strong&gt;-nowp&lt;/strong&gt; -url:http://localhost:9800/Matematik.soap?wsdl -oa:MatMetaDataNoWp.dll&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk164_6.gif" alt="" width="640" height="304" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi oluşan MatMetaDataNoWp.dll isimli assembly' ımızı yine ILDASM aracı yardımıyla inceleyelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk164_7.gif" alt="" width="490" height="524" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi tek fark Wrapped Proxy' de yer alan get_RemotingReference metodu ile RemotingReference nesnesinin Non-Wrapped Proxy i&amp;ccedil;erisinde olmayışıdır. Dolayısıyla, istemci tarafındaki uygulamamızda gerekli konfigurasyon ayarlarını yapmamız gerekecektir. Bu ama&amp;ccedil;la istemci tarafına aşağıdaki konfigurasyon dosyasını ekleyelim. Elbette type parametresini belirtirken Assembly adı olarak oluşturulan Non-Wrapped Proxy Assembly' ının adını vermemiz gerekecektir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.runtime.remoting&amp;gt;
        &amp;lt;application&amp;gt;
            &amp;lt;channels&amp;gt;
                &amp;lt;channel ref="Http Client"/&amp;gt;
            &amp;lt;/channels&amp;gt;
            &amp;lt;client&amp;gt;
                &amp;lt;wellknown type="RemoteObjects.Matematik,MatMetaDataNoWp" url="http://manchester:9800/Matematik.soap"/&amp;gt;
            &amp;lt;/client&amp;gt;
        &amp;lt;/application&amp;gt;
    &amp;lt;/system.runtime.remoting&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Daha sonra ise, yeni proxy assembly' ımızın dll dosyasını istemci uygulamamıza referans etmemiz gerekiyor. &lt;em&gt; ( &amp;Ouml;nceki &amp;ouml;rneğimizde &amp;uuml;retilen Assembly' da aynı isim alanını ve sınıfı i&amp;ccedil;erdiğinden karşılık olmaması amacıyla MatMetaData.dll referansı bu &amp;ouml;rnek i&amp;ccedil;in kaldırılmıştır.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk164_8.gif" alt="" width="214" height="162" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi istemcimize ait kodları aşağıdaki gibi değiştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;RemotingConfiguration.Configure("..\\..\\App.config",false);
Matematik mt = new Matematik();
Console.WriteLine(mt.Toplam(3, 4).ToString());&lt;/pre&gt;
&lt;p&gt;Uygulamamızı test ettiğimizde remoting sisteminin başarılı bir şekilde &amp;ccedil;alıştığını g&amp;ouml;rebiliriz. Her zamanki gibi uzaktan erişimi ispat etmek i&amp;ccedil;in, sunucu uygulamayı &amp;ccedil;alıştırmadan istemci uygulamayı &amp;ccedil;alıştırmanızı &amp;ouml;neririm. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi SoapSuds modelinde Wrapped Proxy ya da Non-Wrapped Proxy' lerin bir birlerine g&amp;ouml;re temel bazı farklılıkları bulunmaktadır. Son olarak SoapSuds aracı yardımıyla uzak nesne sınıfına ait bir kaynak kodun istemci tarafına taşınabileceğinide berlirtmek istiyorum. Bunun i&amp;ccedil;in -gc (Generate Class) anahtarını kullanmak yeterlidir. &amp;Ouml;rneğin sunucu uygulamamız &amp;ccedil;alışırken komut satırından aşağıdaki satırı &amp;ccedil;alıştıralım.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Komut :&lt;/strong&gt; SoapSuds -nowp -url:http://localhost:9800/Matematik.soap?wsdl &lt;strong&gt;-gc&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Bunun sonucu olarak cs uzantılı bir kaynak kod dosyası oluşur. Dosyanın i&amp;ccedil;eriği aşağıdakine benzer olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Runtime.Remoting.Messaging;
using System.Runtime.Remoting.Metadata;
using System.Runtime.Remoting.Metadata.W3cXsd2001;
using System.Runtime.InteropServices;
namespace RemoteObjects 
{
    [Serializable, SoapType(XmlNamespace=@"http://schemas.microsoft.com/clr/nsassem/RemoteObjects/RemoteObjects%2C%20Version%3D1.0.0.0%2C%20Culture%3Dneutral%2C%20PublicKeyToken%3Dnull", XmlTypeNamespace=@"http://schemas.microsoft.com/clr/nsassem/RemoteObjects/RemoteObjects%2C%20Version%3D1.0.0.0%2C%20Culture%3Dneutral%2C%20PublicKeyToken%3Dnull")][ComVisible(true)]
    public class Matematik : System.MarshalByRefObject
    {
        [SoapMethod(SoapAction=@"http://schemas.microsoft.com/clr/nsassem/RemoteObjects.Matematik/
RemoteObjects#Toplam")]
        public Double Toplam(Double deger1, Double deger2)
        {
            return((Double) (Object) null);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Dolayısıyla istemci tarafından oluşan bu isim alanı ve i&amp;ccedil;eriğini doğrudan kullanabilir yada bu kaynak kod dosyasında bir assembly &amp;uuml;retip onu kullanmayı tercih edebiliriz. Tabi b&amp;ouml;yle bir durumda aynen Non-Wrapped Proxy modelinde olduğu gibi istemci tarafı i&amp;ccedil;in gerekli konfigurasyon ayarlarının bildirilmesi gerekmektedir. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/Sample_13_SoapSuds.rar"&gt;&amp;Ouml;rnek Uygulama İ&amp;ccedil;in Tıklayın.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2006-06-21 12:00:00</pubDate>
  <slug>-Net-Remoting-SoapSuds-bsenyurt-com-dan</slug>
  <tags>
    <tag>net-remoting</tag>
    <tag>soap</tag>
  </tags>
  <categories>
    <category>.Net Remoting</category>
  </categories>
</post>