<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Client Application Services (İstemci Uygulama Servisleri)</title>
  <description>Pek çok istemci uygulama için önem arz eden konular arasında doğrulama(Authentication), Rol Yönetimi (Roles Management), profile(Profile) göre kişiselleştirme yer almaktadır. Özellikle Web tabanlı uygulamalarda bu kıstaslar  daha çok ön plana çıkmaktadır...</description>
  <content>&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Pek &amp;ccedil;ok istemci uygulama i&amp;ccedil;in &amp;ouml;nem arz eden konular arasında &lt;strong&gt;doğrulama(Authentication), Rol Y&amp;ouml;netimi (Roles Management), profile(Profile)&lt;/strong&gt; g&amp;ouml;re kişiselleştirme yer almaktadır. &amp;Ouml;zellikle Web tabanlı uygulamalarda bu kıstaslar&amp;nbsp; daha &amp;ccedil;ok &amp;ouml;n plana &amp;ccedil;ıkmaktadır. Nitekim &lt;strong&gt;Client/Server&lt;/strong&gt; mimarinin en g&amp;uuml;zel uyarlamalarından birisi olan web tabanlı geliştirmelerde, istemcilerin doğrulanması, rollerine g&amp;ouml;re ne yapabileceklerinin belirlenmesi, profillerine g&amp;ouml;re istekte bulundukları sayfaların kişiselleştirilmesi &amp;ouml;nemlidir. Bu noktada &lt;strong&gt;Asp.Net 2.0 &lt;/strong&gt;s&amp;uuml;r&amp;uuml;m&amp;uuml;nden itibaren saymış olduğumuz bu kriterlerin &amp;ccedil;ok daha kolay bir şekilde uygulanabilmesi sağlanmıştır. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Hatırlanacağı &amp;uuml;zere&lt;strong&gt; Asp.Net 2.0 Web Site Administration Tool&lt;/strong&gt; veya kod tarafında &lt;strong&gt;Membership API&lt;/strong&gt; i&amp;ccedil;erisinde yer alan tipler yardımıyla, kullanıcı hesaplarının y&amp;ouml;netilmesi, &amp;ccedil;eşitli rollere atanması g&amp;ouml;rsel olarak kolayca yapılabilmektedir. Bununla birlikte&lt;strong&gt; Profile API&lt;/strong&gt; i&amp;ccedil;erisinde yer alan tipler yardımıylada, bir web sitesinin kullanıcı bazında &amp;ouml;zelleştirilebilmesi son derece kolaylaşmıştır. Ancak bu noktada s&amp;ouml;z konusu kriterlerin windows tabanlı istemciler&lt;strong&gt;(Windows Clients)&lt;/strong&gt; a&amp;ccedil;ısındanda değerlendirilebilir olması olduk&amp;ccedil;a kıymetlidir. İşte tam bu noktada s&amp;ouml;z konusu kriterlerin servis haline getirilmesi gerekliliği ortaya &amp;ccedil;ıkmaktadır. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Nitekim &lt;strong&gt;authentication, role management, profile&lt;/strong&gt; gibi kıstaslar aslında servis haline getirilirlerse &lt;strong&gt;Asp.Net Web&lt;/strong&gt; uygulamaları dışında da kullanılabilir hale gelirler. İşte bu g&amp;uuml;nk&amp;uuml; makalemizin konusu olan &lt;strong&gt;İstemci Uygulama Servisleri(Client Application Services)&lt;/strong&gt; ile, &lt;strong&gt;.Net&lt;/strong&gt; tabanlı Windows uygulamalarının(&lt;strong&gt;Windows Presentation Foundation-WPF&lt;/strong&gt; yada &lt;strong&gt;Windows Forms&lt;/strong&gt;) s&amp;ouml;z konusu kriterleri, .Net i&amp;ccedil;erisine g&amp;ouml;m&amp;uuml;l&amp;uuml; olan &lt;strong&gt;Asp.Net Uygulama Servisleri(Asp.Net Application Services)&lt;/strong&gt; &amp;uuml;zerinden ger&amp;ccedil;ekleştirebilmeleri m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Asp.Net Application Service&lt;/strong&gt;' ler olmasada windows istemcilerinin doğrulama, rol ve profil y&amp;ouml;netimi i&amp;ccedil;in servis bazlı mimarilerinin ele alması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Sonu&amp;ccedil; itibariyle burada basit servisler yazılarak bu ihtiya&amp;ccedil;lar karşılanabilir. Ancak Asp.Net Application Service' ler Framework i&amp;ccedil;erisine g&amp;ouml;m&amp;uuml;l&amp;uuml; olduklarından t&amp;uuml;m istemci &amp;ccedil;eşitleri i&amp;ccedil;in bir standardizasyon getirmektedir. Bununla birlikte &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nde gelen bir ka&amp;ccedil; basit yenilikte servislerin kullanımını kolaylaştırmaktadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Asp.Net Uygulama Servisleri(Asp.Net Application Services)&lt;/strong&gt; sadece &lt;strong&gt;Asp.Net AJAX&lt;/strong&gt; web uygulamalarında değil, &lt;strong&gt;.Net&lt;/strong&gt; tabanlı her hangibiri istemci tarafından ele alınabilir. Bu noktada her iki istemci uygulama &amp;ccedil;eşidide &lt;strong&gt;JSON(JavaScript Object Notation)&lt;/strong&gt; tabanlı bir mesaj iletişimini doğal olarak HTTP &amp;uuml;zerinden ger&amp;ccedil;ekleştirmektedir. Ne varki Asp.Net Uygulama Servisleri, &lt;strong&gt;SOAP 1.1(Simple Object Access Protocol)&lt;/strong&gt; temelli mesaj g&amp;ouml;nderen istemcilerede hizmet verebilmektedir. Buda &amp;ccedil;ok doğal olarak &lt;strong&gt;.Net&lt;/strong&gt; dışındaki uygulamaların s&amp;ouml;z konusu servisleri kullanabilmesi anlamına gelmektedir. Bir başka deyişle &amp;ouml;rneğin &lt;strong&gt;Java&lt;/strong&gt; tabanlı bir uygulama bile Asp.Net Uygulama Servislerini &amp;ccedil;ağırabilir ve &lt;strong&gt;doğrulama(Authentication), rol ve profile y&amp;ouml;netimlerini(Role and Profile Management) &lt;/strong&gt;kullanabilir. İstemci &amp;ccedil;eşitleri ve servisler arasındaki ilişkiler basit&amp;ccedil;e aşağıdaki şekil ile &amp;ouml;zetlenebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;img src="/makale/images/mk264_1.gif" alt="" width="612" height="364" border="0" /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere uygulama servisleri aslında birer Web Servisi mantığında olduğundan &lt;strong&gt;HTTP&lt;/strong&gt; &amp;uuml;zerinden her t&amp;uuml;r istemcinin ulaşabilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;em&gt;(WCF bazlı bir kullanım şeklide m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Bunu ilerleyen makalelerimizde yada bir g&amp;ouml;rsel dersimizde ele almaya &amp;ccedil;alışacağız)&lt;/em&gt; Bu servislerin temel işlevleri arasında istemcilerin doğrulanması, doğrulama sonrasında istemci tarafında biletler(ticket) a&amp;ccedil;ılmasının sağlanması, istemcinin hangi rolde olduğunun tespit edilmesi ve profiline g&amp;ouml;re uygulamanın i&amp;ccedil;eriğinin kişiselleştirilmesi sayılabilir. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Dikkat edileceği &amp;uuml;zere s&amp;ouml;z konusu hizmetler i&amp;ccedil;in bir veri saklama ortamı olması şarttır. Varsayılan olarak bu ortam bilindiği &amp;uuml;zere &lt;strong&gt;SQL&lt;/strong&gt; sunucusu(veya Express s&amp;uuml;r&amp;uuml;m&amp;uuml;) &amp;uuml;zerindeki &lt;strong&gt;Membership&lt;/strong&gt; veritabanlarıdır. Ancak istenirse bu veri kaynaklarını kullanan provider' lar servis tarafında &amp;ouml;zelleştirilebilir ve farklı depoların kullanılması sağlanabilir. Bunun i&amp;ccedil;in basit&amp;ccedil;e konfigurasyon i&amp;ccedil;eriğinde bir ka&amp;ccedil; değişiklik yapmak yeterli olacaktır. Servislerin temel g&amp;ouml;revleri aşağıdaki tabloda olduğu gibi &amp;ouml;zetlenebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;table style="border-collapse: collapse; width: 100%;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;strong&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Servis&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;strong&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;G&amp;ouml;revi&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;Authentication Service(Doğrulama Servisi)&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;İstemcinin doğrulanması ve uygulamaya giriş yapabilmesi(Login) amacıyla kullanılır. &lt;strong&gt; Login&lt;/strong&gt; işlemi sonrasında istemci tarafında saklanacak bir &lt;strong&gt;bilet(Ticket)&lt;/strong&gt; oluşturulur. Tahmin edileceği &amp;uuml;zere bu bilet bir &lt;strong&gt;cookie&lt;/strong&gt; olarak depolanır ve bir ge&amp;ccedil;erlilik s&amp;uuml;resi vardır.&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;Roles Service(Rol servisi)&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Uygulama bazlı olaraktan istemcinin hangi rolde olduğunun &lt;strong&gt;Asp.Net Role Provider&lt;/strong&gt; tarafından denetlenmesi hizmetini &amp;uuml;stlenir. Buna g&amp;ouml;re istemci uygulamada, &amp;ouml;rneğin men&amp;uuml;lerin veya kontrollerin rol bazlı olarak kullanılabilmesi sağlanabilir.&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt;&lt;span style="font-family: Verdana;"&gt;Profile Service(Profil Servisi)&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;İstemci uygulamanın sunucu &amp;uuml;zerinde tutulan kullanıcı verilerine g&amp;ouml;re herhangibir zamanda farklı bi&amp;ccedil;imlerde g&amp;ouml;sterilebilmesine veya davranış sergilemesine hizmet eden servistir. Burada servis tarafında t&amp;uuml;m kullanıcılar i&amp;ccedil;in ortaklaşa tanımlanmış profil &amp;ouml;zellikleri s&amp;ouml;z konusudur. Ancak &amp;ouml;zellik değerleri her istemci i&amp;ccedil;in farklı olarak tutulabilmektedir. &lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu genel a&amp;ccedil;ıklamalardan sonra sanıyorumki uygulama servisleri hakkında biraz fikir sahibi olunmuştur. Makalemizin bundan sonraki b&amp;ouml;l&amp;uuml;m&amp;uuml;nde yer alan hedefimiz ise bir windows istemcisi &amp;uuml;zerinden s&amp;ouml;z konusu servislerin kullanılmasını sağlamaktır. Bu noktada &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml;n &lt;strong&gt;İstemci Uygulama Servisilerinin(Client Application Service)&lt;/strong&gt; ele alınmasında b&amp;uuml;y&amp;uuml;k kolaylıklar sağladığıda unutulmamalıdır. &amp;Ouml;yleyse hi&amp;ccedil; vakit kaybetmeden işe başlayalım. &amp;Ouml;ncelikli olarak doğrulama, rol ve profil y&amp;ouml;netimi hizmetlerini &amp;uuml;stlenecek bir web servisi geliştiriyor olacağız. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;İlk olarak bir &lt;strong&gt;Web Service Application&lt;/strong&gt; projesi oluşturarak başlayabiliriz. Bu uygulama i&amp;ccedil;erisinde varsayılan olarak gelen &lt;strong&gt;Service.asmx &lt;/strong&gt;dosyasının s&amp;ouml;z konusu senaryoda herhangibir kullanım alanı bulunmamaktadır. Servisin tek g&amp;ouml;revi istemci uygulamaya &lt;strong&gt;Authentication, Roles ve Profile &lt;/strong&gt;servis hizmetlerini sağlamaktır. Bu sebepten asmx dosyası silinebilir. Şu an i&amp;ccedil;in test servisimiz file-based olarak a&amp;ccedil;ılmıştır. Ancak tabiki production ortamlarında IIS gibi bir sunucu altında yayınlanması &amp;ouml;nerilir. File-based kullanım nedeniyle Web Servis uygulamasının &amp;ouml;zelliklerinden basit olarak port ve sanal yol(Virtual Path) ayarlamalarını aşağıdaki şekildeki gibi yapmamız yeterli olacaktır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;img src="/makale/images/mk264_2.gif" alt="" width="623" height="188" border="0" /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Burada belirtilen bilgiler istemci uygulamada ele alınacaktır. Şimdi web.config dosyası i&amp;ccedil;erisinde bazı basit ayarlamalar yapılması gerekmektedir. Bu ama&amp;ccedil;la web.config dosyası i&amp;ccedil;eriğini şimdilik aşağıdaki gibi değiştirelim.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;img src="/makale/images/mk264_3.gif" alt="" width="335" height="296" border="0" /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Konfigurasyon dosyası i&amp;ccedil;eriğinde &lt;strong&gt;authentication&lt;/strong&gt;, &lt;strong&gt;role&lt;/strong&gt; ve &lt;strong&gt;profile&lt;/strong&gt; servislerini etkinleştirmek i&amp;ccedil;in &lt;strong&gt;system.web.extensions&lt;/strong&gt; elementi altında bazı tanımlamalar yapılmıştır. Bununla birlikte &lt;strong&gt;provider&lt;/strong&gt; bazında &lt;strong&gt;role&lt;/strong&gt; ve &lt;strong&gt;profile&lt;/strong&gt; y&amp;ouml;netimlerininde etkinleştirilmesi amacıyla &lt;strong&gt;roleManager&lt;/strong&gt; ve &lt;strong&gt;profile&lt;/strong&gt; elementleri ele alınmaktadır. Bu basit ayarlamaların hemen ardından kullanıcı ve rol tanımlamalarının yapılmasına başlanabilir. Bunun i&amp;ccedil;in web servisi uygulamasında &lt;strong&gt;Web Site Administration Tool&lt;/strong&gt;' dan yararlanılabilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ouml;rneğin geliştirildiği makinede yer alan &lt;strong&gt;machine.config(C:\WINDOWS\Microsoft.NET\Framework\v2.0.50727\CONFIG)&lt;/strong&gt; i&amp;ccedil;eriğinde &lt;strong&gt;LocalSqlServer&lt;/strong&gt; isimli &lt;strong&gt;connection&lt;/strong&gt; &lt;strong&gt;string&lt;/strong&gt; bilgisi aşağıdaki gibidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;img src="/makale/images/mk264_4.gif" alt="" width="516" height="105" border="0" /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu nedenle &lt;strong&gt;Asp.Net Web Site Administration Tool&lt;/strong&gt;, web servisi uygulamasının i&amp;ccedil;erisinde &lt;strong&gt;membership&lt;/strong&gt; y&amp;ouml;netimi i&amp;ccedil;in gerekli veritabanını&lt;strong&gt;(Aspnetdb.mdf)&lt;/strong&gt; oluşturmaktadır. Elbetteki &lt;strong&gt;LocalSqlServer&lt;/strong&gt; değerinin web servisi uygulamasının &lt;strong&gt;web.config&lt;/strong&gt; dosyası i&amp;ccedil;erisinde ezilmesi ve farklı bir lokasyonun işaret edilmeside sağlanabilir. Eğer makinedeki sunucu &amp;uuml;zerinde veritabanının oluşturulması istenirse &lt;strong&gt;aspnet_regsql&lt;/strong&gt; komut satırı aracından yararlınmalıdır. Veritabanı oluşturulduktan sonra ise config dosyası i&amp;ccedil;eriğinde oluşturulan veritabanı adresi işaret edilerek devam edilebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Asp.Net Web Site Administration Tool&lt;/strong&gt; &amp;uuml;zerinde &lt;strong&gt;From Internet&lt;/strong&gt; se&amp;ccedil;eneği ile &lt;strong&gt;Form Based Authentication&lt;/strong&gt; a&amp;ccedil;ılır. Testler i&amp;ccedil;in iki farklı rol ve kullanıcı oluşturulur. Bu kullanıcılara ait bilgileri &amp;ouml;rnek senaryomuzda aşağıdaki gibi tanımlayabiliriz.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;table style="border-collapse: collapse; width: 100%;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt; &lt;span style="font-family: Verdana;"&gt;Kullanıcı&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt; &lt;span style="font-family: Verdana;"&gt;Şifre&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt; &lt;span style="font-family: Verdana;"&gt;Email&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt; &lt;span style="font-family: Verdana;"&gt;Gizli Soru&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt; &lt;span style="font-family: Verdana;"&gt;Gizli Cevap&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt; &lt;span style="font-family: Verdana;"&gt;Rol&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;buraks&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;buraks1234.&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;buraks@azon.com&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;buraks&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;buraks&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Yonetici&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;bili&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;bili1234.&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;bili@azon.com&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;bili&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;bili&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Calisan&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu işlemlerin arkasından &lt;strong&gt;AppData&lt;/strong&gt; klas&amp;ouml;r&amp;uuml; altında &lt;strong&gt;aspnetdb.mdf&lt;/strong&gt; veritabanı dosyasının a&amp;ccedil;ıldığı ve yukarıdaki kullanıcı bilgilerinin ilgili tablolara eklendiği g&amp;ouml;r&amp;uuml;lebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Artık windows tabanlı istemci uygulamanın geliştirilemesine başlanabilir. İstemci uygulama a&amp;ccedil;ısından en &amp;ouml;nemli nokta elbetteki yukarıda tanımlanmış olan web servisine erişilebilmesidir. Bu ama&amp;ccedil;la windows uygulamasının &amp;ouml;zelliklerinde aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan ayarların yapılması gereklidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;img src="/makale/images/mk264_5.gif" alt="" width="634" height="460" border="0" /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;İlk olarak projenin &amp;ouml;zelliklerinden &lt;strong&gt;Services&lt;/strong&gt; kısmına ge&amp;ccedil;ilir. Burada &lt;strong&gt;Enable client application services&lt;/strong&gt; se&amp;ccedil;eneği işaretlenmelidir. Sonrasında ise &lt;strong&gt;Authentication&lt;/strong&gt;, &lt;strong&gt;Roles&lt;/strong&gt; ve &lt;strong&gt;Profile&lt;/strong&gt; servisleri i&amp;ccedil;in erişim adresleri belirtilir. Dikkat edileceği &amp;uuml;zere her &amp;uuml;&amp;ccedil; servis i&amp;ccedil;inde &lt;strong&gt;SecurityService&lt;/strong&gt; isimli web servis uygulamasının erişim bilgileri verilmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Servis bildirimlerinde her bir kıstas i&amp;ccedil;in ayrı adresler verilebilmektedir. Dolayısıyla&lt;strong&gt;Doğrulama, rol ve profile y&amp;ouml;netimi&lt;/strong&gt; g&amp;ouml;revlerini &amp;uuml;stlenen ve farklı lokasyonlarda duran 3 farklı servisin tanımlanması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Windows uygulamasında basit bir giriş formu yer almaktadır. Bu form &amp;uuml;zerinden kullanıcı bilgileri girilmekte ve servise g&amp;ouml;nderilmektedir. İşte bu noktada &amp;ouml;nemli bir referansa ihtiyacımız vardır. İstemci uygulamanın &lt;strong&gt;System.Web.dll&lt;/strong&gt; &lt;strong&gt;assmebly&lt;/strong&gt;' ını referans etmesi gereklidir. Nitekim ilk &amp;ouml;rneğimizde kullanacığımız &lt;strong&gt;Membership&lt;/strong&gt; sınıfı bu assembly i&amp;ccedil;erisinde yer alan &lt;strong&gt;System.Web.Security&lt;/strong&gt; &lt;strong&gt;isimalanında(Namespace)&lt;/strong&gt; yer almaktadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;img src="/makale/images/mk264_6.gif" alt="" width="248" height="197" border="0" /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Windows.Forms;
using System.Web.Security;

namespace ClientApp
{
    public partial class LoginForm 
        : Form
    {
        public LoginForm()
        {
            InitializeComponent();
            txtSifre.PasswordChar = '*';
        }

        private void btnGiris_Click(object sender, EventArgs e)
        {
            try
            {
                if (Membership.ValidateUser(txtKullanici.Text, txtSifre.Text))
                {
                    Form1 frm = new Form1();
                    frm.Show();
                    this.Hide();
                }
                else
                {
                    MessageBox.Show("Giriş yetkiniz yok", "Yetkisiz Erişim", MessageBoxButtons.OK, MessageBoxIcon.Stop);
                    Application.Exit();
                }
            }
            catch (Exception excp)
            {
                MessageBox.Show(excp.Message);
                Application.Exit();
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Giriş formunda kullanıcı adı ve şifre bilgisi istenmektedir. Sonrasında ise &lt;strong&gt;Membership&lt;/strong&gt; sınıfının &lt;strong&gt;static&lt;/strong&gt; &lt;strong&gt;ValidateUser&lt;/strong&gt; metodu ile kullanıcı servis &amp;uuml;zerinden doğrulanmaya &amp;ccedil;alışılmaktadır. &lt;strong&gt;ValidateUser&lt;/strong&gt; metodu &lt;strong&gt;true&lt;/strong&gt; veya &lt;strong&gt;false&lt;/strong&gt; değer d&amp;ouml;nd&amp;uuml;rmektedir. &lt;strong&gt;True&lt;/strong&gt; d&amp;ouml;nmesi halinde kullanıcı bilgisi doğrulanmıştır. Windows uygulaması &amp;ccedil;alıştırıldığında, &lt;strong&gt;4500&lt;/strong&gt; numaralı &lt;strong&gt;port&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;Asp.Net Development Server&lt;/strong&gt;' ında &amp;ccedil;alıştığı g&amp;ouml;zlemlenir. Doğru kullanıcı bilgisi girildiğinde formun a&amp;ccedil;ıldığı ancak hatalı bilgi girilmesi halinde ise programın kapandığı g&amp;ouml;zlemlenebilir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ouml;rnekte dikkat edilmesi gereken noktalardan biriside istemci tarafında herhangibi &lt;strong&gt;proxy&lt;/strong&gt; tipinin bilin&amp;ccedil;li bir şekilde fiziki olarak oluşturulmayışıdır. Normal şartlarda &amp;ouml;zellikle windows tabanlı istemcilerin, servisleri kullanabilmeleri i&amp;ccedil;in servise ait proxy tiplerine ihtiya&amp;ccedil;ları vardır. Oysa Uygulama Servislerinin ele alınmasında esas olan nokta mesaj alış verişidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Şimdi &amp;ouml;rneğimizi biraz daha geliştireceğiz. Bu sefer &lt;strong&gt;Credential Provider&lt;/strong&gt; kullanaraktan bir &lt;strong&gt;Login&lt;/strong&gt; işlemi ger&amp;ccedil;ekleştirmeye &amp;ccedil;alışacağız. Az &amp;ouml;nceki &amp;ouml;rnekte &lt;strong&gt;LoginForm&lt;/strong&gt; isimli bir form tasarlamıştık. Bu form i&amp;ccedil;erisindeki d&amp;uuml;ğmeye bastığımızda &lt;strong&gt;Membership&lt;/strong&gt; sınıfının static &lt;strong&gt;ValidateUser&lt;/strong&gt; metodunu kullanıyorduk. Uygulamanın ana formuna ge&amp;ccedil;iş yapmadan &amp;ouml;nce bu formun &amp;ccedil;ıkmasını sağlamak i&amp;ccedil;inse &lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisinde aşağıdaki kodlamayı kullanmıştık.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Application.Run(new LoginForm());&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Crendentail&lt;/strong&gt; &lt;strong&gt;Provider&lt;/strong&gt; kullanaraktan aslında uygulamaya giriş yapıldığı sırada otomatik olarak &lt;strong&gt;Login&lt;/strong&gt; formunun g&amp;ouml;sterilmesi sağlanabilir. Olayı daha kolay kavramak i&amp;ccedil;in &amp;ouml;rnek &amp;uuml;zerinde adım adım ilerleyelim. Bu ama&amp;ccedil;la &lt;strong&gt;LoginForm&lt;/strong&gt; &amp;uuml;zerinden bazı değişiklikler yapmamız gerekmektedir. İlk olarak formumuzun kod yapısını aşağıdaki gibi d&amp;uuml;zenlemeliyiz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Windows.Forms;
using System.Web.Security;
using System.Web.ClientServices.Providers;

namespace ClientApp
{
    public partial class LoginForm
        : Form, IClientFormsAuthenticationCredentialsProvider
    {
        public LoginForm()
        {
            InitializeComponent();
            txtSifre.PasswordChar = '*';
            FormBorderStyle = FormBorderStyle.FixedSingle;
            btnGiris.DialogResult = DialogResult.OK;
            btnIptal.DialogResult = DialogResult.Cancel;
        } 

        #region IClientFormsAuthenticationCredentialsProvider Members

        public ClientFormsAuthenticationCredentials GetCredentials()
        {
            if (this.ShowDialog() == DialogResult.OK)
            {
                return new ClientFormsAuthenticationCredentials(txtKullanici.Text, txtSifre.Text, chkHatirla.Checked);
            }
            else
            {
                return null;
            }
        }
    
        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat edilecek olursa &lt;strong&gt;LoginForm&lt;/strong&gt; sınıfına &lt;strong&gt;IClientFormsAuthenticationCrendentialsProvider&lt;/strong&gt; &lt;strong&gt;aray&amp;uuml;z&amp;uuml;(Interface)&lt;/strong&gt; uygulanmaktadır. Bu aray&amp;uuml;z i&amp;ccedil;erisinde &lt;strong&gt;ClientFormsAuthenticationCredentials&lt;/strong&gt; tipinden nesne &amp;ouml;rneği d&amp;ouml;nd&amp;uuml;ren &lt;strong&gt;GetCrendentials&lt;/strong&gt; isimli metod bildirimi yer almaktadır. &lt;strong&gt;ClientFormsAuthenticationCredentials&lt;/strong&gt; sınıfının oluşturulması sırasında parametre olarak kullanıcı adı ve şifre bilgileri g&amp;ouml;nderilmektedir. Peki bu form uygulama i&amp;ccedil;erisinde otomatik olarak nasıl kullanılacaktır. Bir başka deyişle uygulama &amp;ccedil;alıştığında &lt;strong&gt;LoginForm&lt;/strong&gt; otomatik olarak nasıl başlatılacaktır. Bunun i&amp;ccedil;in projenin &amp;ouml;zelliklerinde aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi k&amp;uuml;&amp;ccedil;&amp;uuml;k bir bildirim yapılması yeterlidir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;img src="/makale/images/mk264_7.gif" alt="" width="582" height="289" border="0" /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Burada opsiyonel bir &lt;strong&gt;Crendential&lt;/strong&gt; &lt;strong&gt; Provider&lt;/strong&gt; tanımlaması yapılmaktadır ve LoginForm tipi işaret edilmektedir. Dolayısıyla uygulama başlatıldığında LoginForm tipinin &lt;strong&gt;Crendential&lt;/strong&gt; &lt;strong&gt;Provider&lt;/strong&gt; olarak kullanılacağı belirtilmektedir. Bu işlemin hemen ardından &lt;strong&gt;Form1&lt;/strong&gt; &amp;uuml;zerinde &lt;strong&gt;Load&lt;/strong&gt; metoduna aşağıdaki kodlamalar yapılabilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Windows.Forms;
using System.Web.Security;
using System.Net;

namespace ClientApp
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }

        private void Form1_Load(object sender, EventArgs e)
        {
            try
            {
                if (!Membership.ValidateUser(String.Empty, String.Empty))
                {
                    MessageBox.Show("Giriş Yetkiniz Yok", "Yetkisiz giriş", MessageBoxButtons.OK, MessageBoxIcon.Stop);
                    Application.Exit();
                }
            }
            catch (WebException excp)
            {
                MessageBox.Show(excp.Message);
                Application.Exit();
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat edilecek olursa &lt;strong&gt;Membership.ValidateUser&lt;/strong&gt; metod &amp;ccedil;ağrısında String.Empty parametre değerleri kullanılmıştır. Bu son derece doğaldır nitekim bu noktada devreye &lt;strong&gt;LoginForm&lt;/strong&gt; sınıfı girecektir. Bir başka deyişle durum uygulama &lt;strong&gt; breakpoint&lt;/strong&gt;' ler yardımıyla &lt;strong&gt;debug&lt;/strong&gt; &lt;strong&gt;modda&lt;/strong&gt; izlendiğinde, &lt;strong&gt;Form1_Load&lt;/strong&gt;' daki &lt;strong&gt;ValidateUser&lt;/strong&gt; &amp;ccedil;ağrısına gelindikten sonra LoginForm' un oluşturulduğu ve modal bir pencere olarak &amp;ccedil;alıştığı g&amp;ouml;zlemlenebilir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Uygulama test edildiğinde doğru kullanıcı bilgileri girilmesi halinde ana formun(Form1) a&amp;ccedil;ıldığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r. Bununla birlikte yanlış kullanıcı bilgileri girilmesi halinde &lt;strong&gt;LoginForm&lt;/strong&gt;' un varsayılan olarak 3 hak tanıdığı g&amp;ouml;r&amp;uuml;lecektir. 3nc&amp;uuml; giriştede başarı sağlanamadığı takdirde yine program sonlanacaktır. Beni Hatırla başlıklı &lt;strong&gt;CheckBox&lt;/strong&gt; kontrol&amp;uuml; işaretlendiği takdirde, sonraki a&amp;ccedil;ılışlarda uygulamanın kullanıcı bilgilerini sormadığı g&amp;ouml;r&amp;uuml;lecektir. Yani kullanıcı bileti istemci tarafında belirli s&amp;uuml;reliğine saklanacaktır. &lt;em&gt;(Bu noktada size g&amp;uuml;zel bir araştırma konusu sunabiliriz. Saklama halinde istemci bilgisi ne kadar s&amp;uuml;re ile tutulur. Bu s&amp;uuml;re nasıl &amp;ouml;zelleştirilebilir?)&lt;/em&gt; Aslında şu noktada web uygulamalarında ger&amp;ccedil;ekleştirdiğimiz &lt;strong&gt;Forms Authentication&lt;/strong&gt; bazlı kullanıcı y&amp;ouml;netiminin Windows versiyonunu yazmış bulunuyoruz.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Şimdi windows uygulamamızda role bazlı işlemler yapmaya &amp;ccedil;alışacağız. &amp;Ouml;rneğin Form1 &amp;uuml;zerinde bulunan iki button bileşeninin sadece ilgili rollerde g&amp;ouml;r&amp;uuml;nmesini sağlayabiliriz. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;img src="/makale/images/mk264_8.gif" alt="" width="229" height="166" border="0" /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;S&amp;ouml;z gelimi &lt;strong&gt;Yonetici&lt;/strong&gt; rol&amp;uuml;nde olan bir kullanıcı sadece &lt;strong&gt;Muhasebe&lt;/strong&gt; işlemleri yapabilecekken, &lt;strong&gt;Calisan&lt;/strong&gt; rol&amp;uuml;ndeki bir kullanıcı ise sadece &lt;strong&gt;BI&lt;/strong&gt; işlemlerini yapabilecektir. Bunun i&amp;ccedil;in &amp;ouml;rnek olarak &lt;strong&gt;Form1_Load&lt;/strong&gt; metodu i&amp;ccedil;erisinde aşağıdaki kodlamaları yapmamaız yeterlidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Windows.Forms;
using System.Web.Security;
using System.Net;
using System.Web.ClientServices.Providers;
using System.Threading;
using System.Security.Principal;

namespace ClientApp
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }

        private void Form1_Load(object sender, EventArgs e)
        {
            try
            {
                if (!Membership.ValidateUser(String.Empty, String.Empty))
                {
                    MessageBox.Show("Giriş Yetkiniz Yok", "Yetkisiz giriş", MessageBoxButtons.OK, MessageBoxIcon.Stop);
                    Application.Exit();
                }
                else
                {
                    IPrincipal principal = Thread.CurrentPrincipal;
            
                    if (principal.IsInRole("Yonetici"))
                    {
                        Text = String.Format("{0} ({1})", principal.Identity.Name, "Y&amp;ouml;netici");
                        btnMuhasebe.Visible = true;
                        btnBI.Visible = false;
                    }
                    else if (principal.IsInRole("Calisan"))
                    {
                        Text = String.Format("{0} ({1})", principal.Identity.Name, "&amp;Ccedil;alışan");
                        btnMuhasebe.Visible = false;
                        btnBI.Visible = true;
                    }
                }
            }
            catch (WebException excp)
            {
                MessageBox.Show(excp.Message);
                Application.Exit();
            }
        }

        private void btnLogout_Click(object sender, EventArgs e)
        {
            ClientFormsAuthenticationMembershipProvider prvd =(ClientFormsAuthenticationMembershipProvider)System.Web.Security.Membership.Provider;
        
            try
            {
                prvd.Logout();
                Application.Restart();
            }
            catch (WebException excp)
            {
                MessageBox.Show(excp.Message);
            }
        
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Kullanıcının hangi rolde olduğunu &amp;ouml;ğrenmek i&amp;ccedil;in &lt;strong&gt;Thread&lt;/strong&gt; sınıfı &amp;uuml;zerinden &lt;strong&gt;CurrentPrincipal&lt;/strong&gt; referansına gidilir. &lt;strong&gt;CurrentPrincipal&lt;/strong&gt;, &lt;strong&gt;IPrincipal&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; tipinden bir refernas taşımaktadır ve &lt;strong&gt;IsInRole&lt;/strong&gt; metodu yardımıyla &amp;ccedil;alışmakta olan uygulamanın sahibi olan kullanıcının parametre olarak belirtilen rolde olup olmadığı &amp;ouml;ğrenilebilir. Buna g&amp;ouml;re windows uygulamasının rol bazlı &amp;ouml;zellikleri ayarlanabilir. Form1 i&amp;ccedil;erisinde ayrıca &lt;strong&gt;Logout&lt;/strong&gt; işlemi i&amp;ccedil;inde bir kod eklentisi yer almaktadır. Nitekim &lt;strong&gt;LoginForm&lt;/strong&gt; &amp;uuml;zerinde &lt;strong&gt;Beni&lt;/strong&gt; &lt;strong&gt;Hatırla&lt;/strong&gt; başlıklı &lt;strong&gt;CheckBox&lt;/strong&gt; tıklandığı takdirde uygulama kullanıcıyı her a&amp;ccedil;ılışta hatırlayacaktır. &lt;strong&gt;Logout&lt;/strong&gt; olmak istendiği durumlarda &lt;strong&gt;ClientFormsAuthenticationMembershipProvider&lt;/strong&gt; tipine ulaşmak ve &lt;strong&gt;Logout&lt;/strong&gt; metodunu &amp;ccedil;ağırmak yeterlidir. Uygulama tekrar test edildiğinde &amp;ouml;nreğin &lt;strong&gt;buraks&lt;/strong&gt; isimli kullanıcı ile giriş yapıldığında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşılır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;img src="/makale/images/mk264_9.gif" alt="" width="441" height="271" border="0" /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Benzer şekilde &lt;strong&gt;bili&lt;/strong&gt; isimli kullanıcı ile girildiğinde ise aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile karşılaşılır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;img src="/makale/images/mk264_10.gif" alt="" width="441" height="271" border="0" /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Son olarak makalemizde &lt;strong&gt;profil&lt;/strong&gt; servisinin nasıl kullanılabileceğini ele almaya &amp;ccedil;alışalım. Burada ama&amp;ccedil; sunucu tarafında tanımlanan &lt;strong&gt;&amp;ouml;zelliklerin(Properties)&lt;/strong&gt; her kullanıcı i&amp;ccedil;in farklı veriler tutacak şekilde tasarlanmasıdır. B&amp;ouml;ylece doğrulanan her kullanıcı, aynı isimli &amp;ouml;zelliğin farklı değerlerini sunucu &amp;uuml;zerinde saklayabilir ve kendi istemci uygulaması &amp;uuml;zerinde kullanabilir. Bu bir anlamda web uygulamalarında sıklıkla kullanılan &lt;strong&gt;kişiselleştirmedir(Personalization)&lt;/strong&gt;. Aynı hizmet &lt;strong&gt;İstemci Uygulama Servisleri&lt;/strong&gt; sayesinde, windows tabanlı programlara da uygulanabilir. Dilerseniz bu basit işlemi nasıl yapabileceğimize bakalım. &amp;Ouml;ncelikli olarak sunucu tarafında yer alan &lt;strong&gt;web.config&lt;/strong&gt; dosyası i&amp;ccedil;erisinde basit bir ka&amp;ccedil; bildirimi aşağıdaki gibi yapmamız gerekmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;img src="/makale/images/mk264_11.gif" alt="" width="486" height="413" border="0" /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Dikkat edeceğiniz &amp;uuml;zere &lt;strong&gt;profile&lt;/strong&gt; elementi altında yer alan &lt;strong&gt;properties&lt;/strong&gt; alt boğumu(Child Node) i&amp;ccedil;erisinde iki adet &amp;ouml;zellik bildirimi yapılmaktadır. &lt;strong&gt;GirisMesaji&lt;/strong&gt; isimli &amp;ouml;zellik &lt;strong&gt;string&lt;/strong&gt; tipindendir. Varsayılan bir değeri vardır. &lt;strong&gt;String&lt;/strong&gt; formatta serileştirilmektedir. &lt;strong&gt;İsimsiz kullanıcılar(Anonymous Users)&lt;/strong&gt; i&amp;ccedil;in bu &amp;ouml;zelliğe değer atanmasına izin verilmemektedir. Ayrıca &lt;strong&gt;yanlız okunabilir(readonly)&lt;/strong&gt; bir &amp;ouml;zellikte değildir. Benzer kriterler &lt;strong&gt;SonGirisZamani&lt;/strong&gt; isimli ikinci &amp;ouml;zellik i&amp;ccedil;inde yer almaktadır. Ancak &lt;strong&gt;SonGirisZamani&lt;/strong&gt; isimli &amp;ouml;zelliğin veri tipi &lt;strong&gt;DateTime&lt;/strong&gt;' dır. &lt;strong&gt;profileService&lt;/strong&gt; elementi i&amp;ccedil;erisinde ise s&amp;ouml;z konusu &amp;ouml;zelliklere okuma ve yazma hakları, &lt;strong&gt;readAccessProperties&lt;/strong&gt; ve &lt;strong&gt;writeAccessProperties&lt;/strong&gt; &lt;strong&gt;nitelikleri(Attribute)&lt;/strong&gt; ile verilmektedir. Burada birden fazla &amp;ouml;zelliğin aralarına virg&amp;uuml;ller konularak belirtilebildiğinde dikkat edilmelidir. Bu işlemler sonrasında sunucu tarafında her istemci i&amp;ccedil;in farklı değerlere sahip olabilecek &amp;ouml;zellik tanımlamaları yapılmış olmaktadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Şimdi istemci tarafında bazı işlemlerin yapılması gerekmektedir. &amp;Ouml;ncelikli olarak istemci uygulamada &lt;strong&gt;Properties-&amp;gt;Settings&lt;/strong&gt; kısmına ge&amp;ccedil;ilir ve &lt;strong&gt;Load&lt;/strong&gt; &lt;strong&gt;Web&lt;/strong&gt; &lt;strong&gt;Settings&lt;/strong&gt; d&amp;uuml;ğmesine basılır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;img src="/makale/images/mk264_12.gif" alt="" width="547" height="262" border="0" /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu işlemin ardından sunucu tarafındaki profile servisine bağlanılmak istenir ki var olan ge&amp;ccedil;erli bir kullanıcı ile bu ger&amp;ccedil;ekleştirilebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;img src="/makale/images/mk264_13.gif" alt="" width="437" height="309" border="0" /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Eğer bağlantı başarılı bir şekilde sağlanırsa, sunucu tarafındaki &lt;strong&gt;web.config&lt;/strong&gt; dosyasında tanımlanan profil &amp;ouml;zelliklerinin istemci uygulamadaki &lt;strong&gt;settings&lt;/strong&gt; kısmına eklendiği a&amp;ccedil;ık bir şekilde g&amp;ouml;r&amp;uuml;lebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;img src="/makale/images/mk264_14.gif" alt="" width="569" height="225" border="0" /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bir başka deyişle artık istemci tarafında &lt;strong&gt;GirisMesaji&lt;/strong&gt; ve &lt;strong&gt;SonGirisZamani&lt;/strong&gt; isimli &amp;ouml;zelliklere tip bazında erişilebilecektir. Kod tarafında, formun y&amp;uuml;klenmesi ile birlikte bu &amp;ouml;zelliklerin değerleri okunabilir ve herhangibir ama&amp;ccedil;la kullanılabilir. Form kapanırken veya uygulamadan &amp;ccedil;ıkılırkende istenirse, bu &amp;ouml;zelliklerin yeni değerlerinin set edilip kaydedilmesi, bir başka deyişle servis tarafındaki &lt;strong&gt;aspnetdb.mdf&lt;/strong&gt; veritabanında yer alan &lt;strong&gt;aspnet_Profile&lt;/strong&gt; tablosuna yazdırılması sağlanabilir. Bu &amp;ouml;rneğimizde s&amp;ouml;z konusu senaryoyu &amp;ccedil;ok basit bir şekilde değerlendirmeye &amp;ccedil;alışacağız. &amp;Ouml;rneğin Form1 in Load metodunu aşağıdaki gibi g&amp;uuml;ncellediğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void Form1_Load(object sender, EventArgs e)
{
    try
    {
        if (!Membership.ValidateUser(String.Empty, String.Empty))
        {
            MessageBox.Show("Giriş Yetkiniz Yok", "Yetkisiz giriş", MessageBoxButtons.OK, MessageBoxIcon.Stop);
            Application.Exit();
        }
        else
        {
            txtGirisMesaji.DataBindings.Add("Text", Properties.Settings.Default, "GirisMesaji");
            lblSonGirisZamani.Text = Properties.Settings.Default["SonGirisZamani"].ToString();

            IPrincipal principal = Thread.CurrentPrincipal;
    
            if (principal.IsInRole("Yonetici"))
            {
                Text = String.Format("{0} ({1})", principal.Identity.Name, "Y&amp;ouml;netici");
                btnMuhasebe.Visible = true;
                btnBI.Visible = false;
            }
            else if (principal.IsInRole("Calisan"))
            {
                Text = String.Format("{0} ({1})", principal.Identity.Name, "&amp;Ccedil;alışan");
                btnMuhasebe.Visible = false;
                btnBI.Visible = true;
            }
        }
    }
    catch (WebException excp)
    {
        MessageBox.Show(excp.Message);
        Application.Exit();
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat edilecek olursa &lt;strong&gt;txtGirisMesaji&lt;/strong&gt;&amp;nbsp;isimli TextBox kontrol&amp;uuml;ne &lt;strong&gt;veri&lt;/strong&gt; &lt;strong&gt;bağlaması(DataBinding)&lt;/strong&gt; sırasında &lt;strong&gt;Properties.Settings.Default&lt;/strong&gt; veri kaynağı(Data Source) olarak g&amp;ouml;sterilmiştir. Son parametrede ise &lt;strong&gt;Settings&lt;/strong&gt; kısmında tanımlı olan &amp;ouml;zellik adları verilmektedir. &lt;strong&gt;txtGirisMesaji&lt;/strong&gt; isimli &lt;strong&gt;TextBox&lt;/strong&gt; kontrol&amp;uuml; i&amp;ccedil;in &lt;strong&gt;&amp;ccedil;ift-y&amp;ouml;nl&amp;uuml; veri bağlama(two-way databinding)&lt;/strong&gt; s&amp;ouml;z konusudur. B&amp;ouml;ylece kontrol i&amp;ccedil;erisinde veri değiştirildiğinde s&amp;ouml;z konusu değişiklik &amp;ouml;zellik tarafınada otomatik olarak yansıtılacaktır. &lt;strong&gt;lblSonGirisZamani&lt;/strong&gt; isimli &lt;strong&gt;Label&lt;/strong&gt; kontrol&amp;uuml; ise &lt;strong&gt;tek y&amp;ouml;nl&amp;uuml;(one-way)&lt;/strong&gt; olarak &lt;strong&gt;SonGirisZamani&lt;/strong&gt; &amp;ouml;zelliğine bağlanmıştır.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Form&lt;/strong&gt;' dan &amp;ccedil;ıkılırken bu verilerin servis tarafına g&amp;ouml;nderilmesi gerekir ki bir sonraki girişte son değerler kullanılabilsin. Bu durumda &amp;ouml;rneğin &lt;strong&gt;Form1_Closing&lt;/strong&gt; olay metodu i&amp;ccedil;erisinde aşağıdaki kodlamalar yapılabilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void Form1_FormClosing(object sender, FormClosingEventArgs e)
{
    if (Thread.CurrentPrincipal.Identity.AuthenticationType.Equals("ClientForms"))
    {
        try
        {
            Properties.Settings.Default["SonGirisZamani"] = DateTime.Now;
            Properties.Settings.Default.Save();
        }
        catch(WebException excp)
        {
            MessageBox.Show(excp.Message);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İlk olarak kullanıcının &lt;strong&gt;ClientForms&lt;/strong&gt; tipinde &lt;strong&gt;authentication&lt;/strong&gt; ger&amp;ccedil;ekleştirip ger&amp;ccedil;ekleştirmediğine bakılır. Bir başka deyişle kullanıcının &lt;strong&gt;Client&lt;/strong&gt; &lt;strong&gt;Application&lt;/strong&gt; &lt;strong&gt;Services&lt;/strong&gt; kullanarak &lt;strong&gt;Login&lt;/strong&gt; olup olmadığı anlaşılmaya &amp;ccedil;alışılmaktadır. Eğer bu şekilde bir bağlantı sağlanmış ise &lt;strong&gt;SonGirisZamani&lt;/strong&gt; &amp;ouml;zelliğinin değeri değiştirilir ve &lt;strong&gt;Save&lt;/strong&gt; metodu &amp;ccedil;ağırılır. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;GirisMesaji&lt;/strong&gt; isimli profil &amp;ouml;zelliği i&amp;ccedil;in bir atama yapılmamıştır. Bunun sebebi iki y&amp;ouml;nl&amp;uuml; veri bağlama işleminin &lt;strong&gt;txtGirisMesaji&lt;/strong&gt; kontrol&amp;uuml; i&amp;ccedil;in kullanılıyor olmasıdır.&lt;/p&gt;
&lt;p&gt;Bu metodun &amp;ccedil;alışması sırasında bazı hatalar oluşabilir. S&amp;ouml;z gelimi &lt;strong&gt;Save&lt;/strong&gt; metodu &amp;ccedil;alıştığı sırada istemcinin &lt;strong&gt;cookie&lt;/strong&gt; bilgisi silinmiş olabilir. Yada kullanıcı &lt;strong&gt;Logout&lt;/strong&gt; olmuş durumdadır ancak halen daha uygulama i&amp;ccedil;erisindedir ve Save metodu &amp;ccedil;ağırılmıştır. Dolayısıyla işlemin ger&amp;ccedil;ekleştirilebilmesi i&amp;ccedil;in tekrardan &lt;strong&gt;Login&lt;/strong&gt; işleminin yapılması gerekmektedir. Diğer taraftan kayıt işlemi sırasında servis ile olan bağlantının kurulamama ihtimalide vardır. Bu gibi durumlar ele alınaraktan daha g&amp;uuml;&amp;ccedil;l&amp;uuml; bir profil kaydetme s&amp;uuml;reci oluşturulabilir. (&lt;em&gt;Burada nasıl bir tedbir alınabileceğinide bir araştırma konusu haline getirebilirsiniz)&lt;/em&gt; Artık uygulamayı bu haliyle test edebiliriz. Bilhassa aynı uygulamadan iki &amp;ouml;rnek başlatıp iki farklı kullanıcı ile girilmesini tavsiye ederim. Bu durumda her iki kullanıcı i&amp;ccedil;inde farklı profil verileri tutulduğu g&amp;ouml;zlemlenebilir. Aşağıdaki test ekranlarında olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk264_15.gif" alt="" width="636" height="469" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu testin sonrasında sunucu tarafındaki &lt;strong&gt;aspnetdb.mdf&lt;/strong&gt; veritabanında yer alan &lt;strong&gt;aspnet_Profile&lt;/strong&gt; tablosu i&amp;ccedil;eriğine bakıldığında her iki kullanıcı i&amp;ccedil;inde ilgili satırların oluşturulduğu g&amp;ouml;r&amp;uuml;lebilir. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalemizde &lt;strong&gt;İstemci Uygulama Servislerini(Client Application Service)&lt;/strong&gt;, &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; ortamı &amp;uuml;zerinde basit bir şekilde ele alarak, &lt;strong&gt;Windows&lt;/strong&gt; tabanlı istemcilerde &lt;strong&gt;Authentication,Roles&lt;/strong&gt; ve &lt;strong&gt;Profile&lt;/strong&gt; hizmetlerinin nasıl ele alınabileceğini basit bir şekilde incelemeye &amp;ccedil;alıştık. S&amp;ouml;z konusu kriterlerin birer servis olarak &lt;strong&gt;.Net Framework&lt;/strong&gt; i&amp;ccedil;erisine dahil edilmesi sonrasında herhangibir .&lt;strong&gt;Net&lt;/strong&gt; istemcisinin bunları kullanabileceğini anladık. Burada &lt;strong&gt;.Net&lt;/strong&gt; tabanlı istemcilerin &lt;strong&gt; JSON&lt;/strong&gt; formatında mesajlaşma yaptığını ancak .&lt;strong&gt;Net&lt;/strong&gt; dışı uygulamalarında &lt;strong&gt;SOAP&lt;/strong&gt; &lt;strong&gt;1.1 &lt;/strong&gt;formatını kullanarak bu servisleri ele alabileceklerine değindik ki bunu ilerleyen makalelerimizde ele almaya &amp;ccedil;alışacağız. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;</content>
  <pubDate>2008-12-16 12:00:00</pubDate>
  <slug>Client-Application-Services-(Istemci-Uygulama-Servisleri)-bsenyurt-com-dan</slug>
  <tags>
    <tag>xml-web-services</tag>
    <tag>client-application-services</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>