<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tek Fotoluk İpucu 156 - Sevimli Ruby Block'ları</title>
  <description>Farklı programlama dillerini çalışırken alışkın olduğum programlama dillerindeki ortamlardan çok daha farklı kabiliyetleri görme şansını buluyorum. Bazı dillerin kabiliyetleri bana çok ilgi çekici geliyor. Örneğin Ruby dilindeki block kavramı.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Farklı programlama dillerini &amp;ouml;ğrenmeye &amp;ccedil;alışırken alışkın olduğum programlama dillerindeki ortamlardan &amp;ccedil;ok daha farklı kabiliyetleri g&amp;ouml;rme şansı buluyorum. Bazı dillerin kabiliyetleri &amp;ccedil;ok dikkat &amp;ccedil;ekici oluyor. &amp;Ouml;rneğin Ruby dilindeki block kavramı. İlk tanımaya &amp;ccedil;alıştığım &lt;a href="/post/ruby-kod-parcaciklari-10-yield-ve-block-kullanimi" target="_blank"&gt;şu kod par&amp;ccedil;asında&lt;/a&gt; mevzuyu az &amp;ccedil;ok anlamış olsam da asıl g&amp;uuml;c&amp;uuml;n&amp;uuml; g&amp;ouml;rmek i&amp;ccedil;in Ruby'nin kendi built-in yapılarındaki block kullanımlarını incelemem gerekti. Sonunda asıl faydasını anladım diyebilirim. Konuyu anlamak i&amp;ccedil;in dizilere sıklıkla uygulanan each, find_all, reject gibi metodları g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldım. &amp;Ouml;rneğin bir dizide belirli kurallara uyan elemanları elde etmek i&amp;ccedil;in kullanılan find_all metodunu kendim yazmak istesem ve bir block kullanmam gerekse bunu nasıl yapabileceğimi bulmaya &amp;ccedil;alıştım. Siz, Ruby'yi geliştiren kişi olsanız ve metodlara parametre olarak kod bloklarını ge&amp;ccedil;irme yeteneğini ilave etseniz veri yapılarında bu &amp;ouml;zelliği nasıl kullandırtınız? Aşağıdaki &amp;ouml;rnek ekran &amp;ccedil;ıktısında yer alan findSomething metodu gibi olabilir mi?&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/04/tfi156.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;findSomething metodu i&amp;ccedil;erisinde bir &amp;ccedil;ok ders var. &amp;Ouml;rneğin&amp;nbsp;bu metoda bir kod bloğu ge&amp;ccedil;ilip ge&amp;ccedil;ilmediğini anlamak i&amp;ccedil;in block_given? fonksiyonunu kullanıyoruz. findSomething public erişim belirleyicisine sahip. Kullanmadığımız takirde private kabul ediliyor ve &amp;ccedil;alışma zamanında NoMethodError hatası alıyoruz. Bir başka deyişle herhangibir nesneye uygulayamıyoruz. İ&amp;ccedil;eride yer alan self anahtar kelimesi ile findSomething metodunun uygulandığı nesneyi yakalamaktayız. Şayet bu, dizi t&amp;uuml;revli bir nesne ise each ile elemanlarında dolaşabiliriz. yield ile tahmin edileceği &amp;uuml;zere findSomething metoduna gelen kod bloğunu &amp;ccedil;ağırıyoruz. Ayrıca yield ile findSomething metoduna gelen kod bloğuna işlenmesi i&amp;ccedil;in iterasyonun o anki nesnesini de&lt;em&gt;(item oluyor)&lt;/em&gt; g&amp;ouml;ndermekteyiz.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;yield anahtar kelimesinin kullanıldığı yerde findSomething metodundan dışarıya &amp;ccedil;ıkıp kendisine parametre olarak gelen kod bloğuna(&amp;ouml;rnekte {|n|n%3==} kısmı) ge&amp;ccedil;ici olarak uğradığımızı ve item değerini oraya bıraktığımızı, bloktaki iş bitince de tekrar findSomething metoduna d&amp;ouml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z&amp;uuml; ifade edebiliriz. Bu block'ların temel &amp;ccedil;alışma felsefesidir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&amp;lt;&amp;lt; operat&amp;ouml;r&amp;uuml; ile result isimli diziye eleman ataması ger&amp;ccedil;ekleştirmekteyiz. Kodun findSomething operasyonunu test ettiğimiz satırında 10dan 28e kadar olan değer aralığındaki sayıların 3 ile tam b&amp;ouml;l&amp;uuml;nebilenlerini &amp;ccedil;ekip r isimli bir değişkende topluyoruz. findSomething metodu, parametre olarak gelen kod bloğuna g&amp;ouml;re elde ettiği sonu&amp;ccedil;ları geriye d&amp;ouml;nd&amp;uuml;ren bir fonksiyon g&amp;ouml;revi &amp;uuml;stleniyor burada. find_all metodunun tıpkısını aynısı gibi değil mi?&lt;/p&gt;
&lt;p&gt;Aynı felsefeyi kullanarak &amp;ouml;rneğin reject isimli built-in fonksiyonu da siz yazmaya &amp;ccedil;alışabilirsiniz. Aslında Ruby ile birlikte gelen ve kod bloğu alarak &amp;ccedil;alışan fonksiyonları kendiniz yazmayı deneyerek block kavramına olan aşinalığınızı arttırabilir konuyu pek g&amp;uuml;zelce pekiştirebilirsiniz. Ruby, sevimli yetenekleri ile beni kendisine hayran bırakmaya devam ediyor. Bir başka ipucunda g&amp;ouml;r&amp;uuml;şmek dileğiyle.&lt;/p&gt;</content>
  <pubDate>2017-04-16 15:38:00</pubDate>
  <slug>tek-fotoluk-ipucu-156-sevimli-ruby-block-lari</slug>
  <tags>
    <tag>ruby-kod-parçacıkları</tag>
    <tag>ruby</tag>
    <tag>block</tag>
    <tag>block_given?</tag>
    <tag>find_all</tag>
    <tag>array</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>