<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ruby Kod Parçacıkları 25 - Unit Test Yazmak</title>
  <description>İyi yazılım geliştirmenin olmazsa olmaz parçalarından birisi de birim testleridir(Unit Tests) Tahmin edileceği üzere Test Driven Development denildiğinde(aklımızda hemen Red Green Blue - Fail, Fix, Refactoring oluşmalı) birim testleri ön plana çıkmaktadır. Pek çok programlama ortamında birim testler için hazır kütüphaneler yer alır. Ruby dilinde ise standart kütüpanede yer alan Test::Unit modülü kullanılmaktadır. Testlere dahil edilecek savlar(assert diyelim) oldukça geniştir. assert, assert_not_equal, assert_nil, assert_respond_to, assert_raise ve benzeri fonksiyonellikler söz konusudur (Kullanılabilecek savların listesine şuradan bakabilirsiniz) Aşağıdaki kod parçasında basit bir test düzeneğine yer verilmiştir.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;İyi yazılım geliştirmenin olmazsa olmaz par&amp;ccedil;alarından birisi de&amp;nbsp;birim testleridir&lt;em&gt;(Unit Tests)&lt;/em&gt; Tahmin edileceği &amp;uuml;zere Test Driven Development denildiğinde(aklımızda hemen Red Green Blue - Fail, Fix, Refactoring oluşmalı) birim testleri &amp;ouml;n plana &amp;ccedil;ıkmaktadır. Pek &amp;ccedil;ok programlama ortamında birim testler i&amp;ccedil;in hazır k&amp;uuml;t&amp;uuml;phaneler yer alır.&amp;nbsp;Ruby dilinde ise standart k&amp;uuml;t&amp;uuml;panede yer alan Test::Unit mod&amp;uuml;l&amp;uuml; kullanılmaktadır. Testlere dahil edilecek savlar&lt;em&gt;(assert diyelim)&lt;/em&gt; olduk&amp;ccedil;a geniştir. assert, assert_not_equal, assert_nil, assert_respond_to, assert_raise ve benzeri fonksiyonellikler s&amp;ouml;z konusudur &lt;em&gt;(&lt;a href="https://ruby-doc.org/stdlib-2.1.1/libdoc/test/unit/rdoc/Test/Unit/Assertions.html" target="_blank"&gt;Kullanılabilecek savların listesine şuradan bakabilirsiniz&lt;/a&gt;)&lt;/em&gt; Aşağıdaki kod par&amp;ccedil;asında basit bir test d&amp;uuml;zeneğine yer verilmiştir.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require 'test/unit'

class Product

	attr_accessor :title, :listPrice, :category
	
	def initialize(title,listPrice,category)
	
	       raise ArgumentError,"#{listPrice} must be greater than 10" unless listPrice&amp;gt;10
	       @title=title
	       @listPrice=listPrice
	       @category=category
		       
	end
end
class ProductTest &amp;lt; Test::Unit::TestCase             
                
	TITLE,LIST_PRICE,CATEGORY="Head First Design Patterns",39.99,"Book"            
	
	def setup
	       @product=Product.new(TITLE,LIST_PRICE,CATEGORY)
	end        
	
	def testForTitle
	       assert_not_nil @product.title
	       assert_equal TITLE,@product.title
	end
	
	def testForListPrice
	       assert_equal 39.99,@product.listPrice
	       assert_raise(ArgumentError){Product.new(TITLE,9.99,CATEGORY)}
	end
	
	def testForCategory
	       assert_send([["Book","Computer","Camera"], :include?, @product.category]) 
	       assert_send([["Book","Computer","Camera"], :include?, Product.new(TITLE,LIST_PRICE,"Unknown").category]) 
	end
                
end&lt;/pre&gt;
&lt;p&gt;Program kodu test/unit mod&amp;uuml;l&amp;uuml;n&amp;uuml;n kullanılacağını belirten require bildirimi ile başlar. &amp;Ouml;rneğimizde Product isimli bir kobay sınıf yer almaktadır.&amp;nbsp;Sınıfı belirleyen &amp;uuml;&amp;ccedil; nitelik var. &amp;Uuml;r&amp;uuml;n adı, liste fiyatı ve yer aldığı kategori. Amacımız Unit Test'lerin basit&amp;ccedil;e nasıl yazıldığını g&amp;ouml;rmek. Bu y&amp;uuml;zden &amp;ccedil;ok karmaşık test vakalarına girmedik. T&amp;uuml;m savlar&amp;nbsp;ProductTest sınıfı i&amp;ccedil;erisinde yer alan testForFile,testForListPrice ve testForCategory fonksiyonları ile icra edilmekte.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;ProductTest sınıfının test metodları i&amp;ccedil;erdiğini ve &amp;ccedil;alışma zamanında test s&amp;uuml;recine dahil olacağını&amp;nbsp;belirtmek i&amp;ccedil;inse Test::Unit::TestCase sınıfından bir t&amp;uuml;retme s&amp;ouml;z konusudur. setup fonksiyonu var olan test senaryolarından &amp;ouml;nce &amp;ccedil;alışan bir metoddur. Tahmin edileceği gibi bu sınıf i&amp;ccedil;erisinde test metodları boyunca kullanılacak ortak nesnelerin &amp;uuml;retimi veya &amp;ouml;n hazırlık işlemleri yapılabilir.&amp;nbsp;&lt;span style="line-height: 1.8;"&gt;&amp;Ouml;rnekte bir Product nesnesini &amp;uuml;retip test vakalarının&amp;nbsp;kullanımına sunuyoruz. &lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="line-height: 1.8;"&gt;testForTitle metodunda&amp;nbsp;Title niteliği i&amp;ccedil;in iki sav deneniyor. Bunlardan birisi nil kontrol&amp;uuml; diğeri ise nitelik değerinin "Head First Design Pattern" metnine&amp;nbsp;eşit olup olmadığı. testForListPrice metodunda da benzer bir eşitlik kontrol&amp;uuml; var. Ayrıca liste fiyatının 10 birimin altında olması durumunda almayı beklediğimiz ArgumentError istisnasının kontrol&amp;uuml; de bulunuyor. Yani 10 birimin altında bir değer verildiğinde ortama ArgumentError fırlatılmasını bekliyoruz. Nitekim Product sınıfının initalize metodu i&amp;ccedil;erisinde bu tip bir exception kontrol&amp;uuml; s&amp;ouml;z konusu. Eğer liste fiyatı beklenen değerin altında ise ortama fırlatılacak bir hata var. assert_raise bu hatanın fırlatılacağı vakayı test ediyor. Savımızın kabul kriteri 10un altında bir değer verilmesi halinde ortama hata yollanması. testForCategory metodunda ise assert_send isimli bir &amp;ccedil;ağrım yer alıyor. Burada kategorinin ilk parametre ile gelen dizi i&amp;ccedil;erisindeki bir eleman olması durumu test edilmekte. Metodun ilk parametresinde kullanılabilecek kategorilere ait dizi yer alıyor. İkinci parametre array sınıfı &amp;uuml;zerinden kullanılabilecek ve include? metodu ve son parametrede include?'a verilebilecek olan değer.&amp;nbsp;İkinci satırdaki kodda sav'ın&amp;nbsp;ge&amp;ccedil;ersiz olmasına ait bir kriter kontrol ediliyor. Hepsi bu.&amp;nbsp;&lt;/span&gt;Dilerseniz &amp;ccedil;alışma zamanı sonu&amp;ccedil;larına da bir bakalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/11/utest_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Product i&amp;ccedil;erisinde yer alan t&amp;uuml;m test metodları sırasıyla &amp;ccedil;alıştırılmıştır.&amp;nbsp;3 test metodu ve i&amp;ccedil;erisinde yer alan 6 assert icra edilmiştir. Bu varsayımlardan&amp;nbsp;beklediğimiz gibi hatalı kateogori vakasının kodun hangi satırında oluştuğu terminal penceresine d&amp;ouml;k&amp;uuml;lm&amp;uuml;şt&amp;uuml;r. Dilersek bir veya n sayıda test metodunu da &amp;ccedil;alıştırabiliriz. Nitekim bazı test sınıfları i&amp;ccedil;erisinde fazla sayıda test metodu olabilir ve o an i&amp;ccedil;in sadece bellir birini(veya bir ka&amp;ccedil;ını) test etmemiz gerekebilir. Sonu&amp;ccedil;ta test operasyonları da zaman zaman s&amp;uuml;re ve kaynak kullanımı adına maliyetli olabilir. B&amp;ouml;yle bir durumda&amp;nbsp;verbose --name testMetodu dizilimini kullanabiliriz. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde &amp;ouml;rnek bir kullanım yer almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/11/utest_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu kez sadece testForTitle isimli test vakası &amp;ccedil;alıştırılmıştır. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Unit Test'ler oluşturmak olduk&amp;ccedil;a pratik ve kolay. İşin &amp;ouml;nemli olan kısmı test vakalarını oluşturabilmek ve Test Driven Development yaklaşımının benimsediği şekilde kodları geliştirebilmek. B&amp;ouml;ylece geldik bir kod par&amp;ccedil;amızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-11-07 21:28:00</pubDate>
  <slug>ruby-kod-parcaciklari-25-unit-test-yazmak</slug>
  <tags>
    <tag>ruby</tag>
    <tag>unit-test</tag>
    <tag>test-framework</tag>
    <tag>assertion</tag>
    <tag>test-driven-development</tag>
    <tag>test-case</tag>
    <tag>assert</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>