<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>SQL_DMO İşlemleri</title>
  <description>Bugünkü makalemizde, Sql Distributed Management Objects (SQL Dağıtık Yönetim Nesneleri) kütüphanesini incelemeye çalışacağız. SQL_DMO kütüphanesi bir COM uygulaması olup, SQL sunucusu ile birlikte sisteme kurulmaktadır. Bu kütüphanedeki sınıflar yardımıyla, var olan bir sql sunucusu üzerinde yönetimsel işlemler gerçekleştirebiliriz. Örneğin, kullanıcı tanımlayabilir, yeni bir veritabanı yaratabilir bu veritabanına ait tablolar oluşturabilir, var olan bir veritabanı için yedekleme işlemleri gerçekleştirebilir, yedeklenmiş veritabanlarını geri yükleyebilir ve bunlar gibi pek çok yönetsel işlemi gerçekleştirebiliriz.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde, Sql Distributed Management Objects (SQL Dağıtık Y&amp;ouml;netim Nesneleri) k&amp;uuml;t&amp;uuml;phanesini incelemeye &amp;ccedil;alışacağız. SQL_DMO k&amp;uuml;t&amp;uuml;phanesi bir COM uygulaması olup, SQL sunucusu ile birlikte sisteme kurulmaktadır. Bu k&amp;uuml;t&amp;uuml;phanedeki sınıflar yardımıyla, var olan bir sql sunucusu &amp;uuml;zerinde y&amp;ouml;netimsel işlemler ger&amp;ccedil;ekleştirebiliriz. &amp;Ouml;rneğin, kullanıcı tanımlayabilir, yeni bir veritabanı yaratabilir bu veritabanına ait tablolar oluşturabilir, var olan bir veritabanı i&amp;ccedil;in yedekleme işlemleri ger&amp;ccedil;ekleştirebilir, yedeklenmiş veritabanlarını geri y&amp;uuml;kleyebilir ve bunlar gibi pek &amp;ccedil;ok y&amp;ouml;netsel işlemi ger&amp;ccedil;ekleştirebiliriz.&lt;/p&gt;
&lt;p&gt;Uygulamalarımızda bu tip işlemleri kodlayabilmek i&amp;ccedil;in, Microsoft SQL Distribution Control&amp;rsquo;un projemize referans edilmesi gerekmektedir. Bir uygulamaya bunu referans etmek i&amp;ccedil;in VS.NET ortamında, Add Reference kısmında, COM nesneleri altında Microsoft SQL Distribution Control 8.0 se&amp;ccedil;ilmelidir. Aşağıdaki şekilde bunun nasıl yapıldığını g&amp;ouml;rebilirsiniz.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;&lt;img src="/makale/images/mk18_1.gif" alt="" width="566" height="441" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 1. Microsoft SQL Distribution Control 8.0 &amp;lsquo;in eklenişi.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bu noktadan sonra uygulamamızda SQLDMO isimli temel sınıfı kullanarak bahsetmiş olduğumuz işlemleri ger&amp;ccedil;ekleştirebiliriz. Konuyu daha iyi kavrayabilmek amacıyla dilerseniz, hemen basit bir uygulama ger&amp;ccedil;ekleştirelim. Bu uygulamamızda, Sql sunucumuz &amp;uuml;zerinde, bir veritabanı yaratacak bu veritabanı i&amp;ccedil;inde &amp;ccedil;ok basit bir tablo oluşturacak, Sql sunucusunda yer alan veritabanlarını g&amp;ouml;r&amp;uuml;cek ve bu veritabanlarına ait tablolara bakabileceğiz.&amp;nbsp;Kodların işleyişini incelediğinizde , işin p&amp;uuml;f noktasının SQLDMO sınıfında yer alan SQLServerClass, DatabaseClass, TableClass, ColumnClass sınıfılarında olduğunu g&amp;ouml;rebilirisiniz. Buradaki matnık aslında ADO.NET mantığı ile tamamen aynıdır. SQL Sunucunuza bağlanmak i&amp;ccedil;in kullanacağınız bir SQLServerClass sınıfı, bir veritabanını temsil eden DatabaseClass sınıfı, bir tablo i&amp;ccedil;in TableClass sınıfı ve tabloya ait alanları temsil edicek olan ColumnClass sınıfı vardır. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Matnık aynı demiştik. Bir veritabanı yaratmak i&amp;ccedil;in, DatabaseClass sınıfından &amp;ouml;rnek bir nesne oluşturursunuz. Bunu var olan Sql sunucusuna eklemek demek aslında bu nesneyi SQLServerClass nesnenizin Databases koleksiyonuna eklemek demektir. Aynı şekilde bir tablo oluşturmak i&amp;ccedil;in TableClass sınıfı &amp;ouml;rneğini kullanır,ve bunu bu kez DatabaseClass nesnesinin Tables koleksiyonuna eklersini. Tahmin edeceğiniz gibi bir tabloya bir alan eklemek i&amp;ccedil;in ColumnClass sınıfından &amp;ouml;rnek bir nesne kullanır ve bunun &amp;ouml;zelliklerini ayarladıktan sonra tablonun Columns koleksiyonuna eklersiniz. Kodlarımızı incelediğiniz zaman konuyu &amp;ccedil;ok daha net bir şekilde anlayacaksınız.&amp;nbsp;Uygulamamız aşağıdakine benzer bir formdan oluşmakta. Sizde buna benzer bir form oluşturarak işe başlayabilirsiniz.&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &lt;img src="/makale/images/mk18_2.gif" alt="" width="400" height="392" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 2. Form tasarımımız.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdi kodlarımızı yazalım.&amp;nbsp;&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SQLDMO.SQLServerClass srv;
SQLDMO.DatabaseClass db;
SQLDMO.TableClass tbl; 

private void btnConnect_Click(object sender, System.EventArgs e)
{
     srv=new SQLDMO.SQLServerClass(); /* SQL Sunucusu &amp;uuml;zerinde, veritabani yaratma gibi islemler i&amp;ccedil;in, Sql Sunucusunu temsil edicek ve ona baglanmamizi sagliyacak bir nesneye ihtiyacimiz vardir. Bu nesne SQLDMO sinifinda yer alan SQLServerClass sinifinin bir &amp;ouml;rnegi olucaktir. */ 
     srv.LoginSecure=false; /* Bu &amp;ouml;zellik true olarak belirlendiginde, Sql Sunucusuna Windows Authentication seklinde baglanilir. Eger false degerini verirsek bu durumda Sql Server Authentication ge&amp;ccedil;erli olur. Iste bu durumda SQLServerClass nesnesini Connect metodu ile Sql Sunucusuna baglanirken ge&amp;ccedil;erli bir kullanici adi ve sifre girmemiz gerekmektedir. */
     try
     {
          srv.Connect("BURKI","sa","CucP??80."); /* Baglanti kurmak i&amp;ccedil;in kullandigimiz Connect metodu &amp;uuml;&amp;ccedil; parametre almaktadir. Ilk parametre sql sunucusunun adidir. Ikinci parametre kullanici adi ve &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; parametrede sifresidir. Eger LoginSecure=true olarak ayarlasaydik, kullanici adini ve sifreyi bos birakicaktik, nitekim Windows Authentication (windows dogrulamasi) s&amp;ouml;z konusu olucakti.*/
          durumCubugu.Text="Sunucuya baglanildi..."+srv.Status.ToString();
     }
     catch(Exception hata)
     {
          MessageBox.Show(hata.Message);
     }
} 
private void btnVeritabaniOlustur_Click(object sender, System.EventArgs e)
{
     try
     {
          db=new SQLDMO.DatabaseClass(); /* SQL-DMO k&amp;uuml;t&amp;uuml;phanesinde, veritabanlarini temsil eden sinif DatabaseClass sinifidir. */
          db.Name=this.txtVeritabaniAdi.Text; /* Veritabani nesnemizin name &amp;ouml;zelligi ile veritabaninin adi belirlenir.*/
          srv.Databases.Add(db); /* olusturulan DatabaseClass nesnesi SQLServerClass sinifinin Databases koleksiyonuna eklenerek Sql Sunucusu &amp;uuml;zerinde olusturulmasi saglaniyor. */
          durumCubugu.Text=db.Name.ToString()+" veritabani "+srv.Name.ToString()+" SQL Sunucusunda olusturuldu";
     }
     catch(Exception hata)
     {
          MessageBox.Show(hata.Message);
     }
} 
private void btnTabloOlustur_Click(object sender, System.EventArgs e)
{
     try
     {
          tbl=new SQLDMO.TableClass(); /* Yeni bir tablo olusturabilmek i&amp;ccedil;in SQL-DMO k&amp;uuml;t&amp;uuml;phanesinde yer alan, TableClass sinifi kullanilir.*/
          tbl.Name=txtTabloAdi.Text; /* Tablomuzun ismini name &amp;ouml;zelligi ile belirliyoruz.*/ 
          SQLDMO.ColumnClass dc; /* Tabloya eklenecek alanlarin her birisi birer ColumnClass sinifi nesnesidir. */
          dc=new SQLDMO.ColumnClass();/* Bir ColumnClass nesnesi yaratiliyor ve bu nesnenin gerekli &amp;ouml;zellikleri belirleniyor. Name &amp;ouml;zelligi ile ismi, Datatype &amp;ouml;zelligi ile veri t&amp;uuml;r&amp;uuml;      belirleniyor. Biz burada ID isimli alanimizin otomatik olarak artan ve 1000 den baslayarak 1'er artan bir alan olmasini istedik. */
          dc.Name="ID";
          dc.Datatype="Int";
          dc.Identity=true;
          dc.IdentitySeed=1000;
          dc.IdentityIncrement=1;
          tbl.Columns.Add(dc); /* Olusturulan bu alan TableClass nesnemizin Columns koleksiyonuna eklenerek tabloda olusturulmasi saglanmis oluyor. */ 
          dc=new SQLDMO.ColumnClass();
          dc.Name="ISIM";
          dc.Datatype="char"; /* String tipte bir alan */
          dc.Length=50;
          tbl.Columns.Add(dc); 
          dc=new SQLDMO.ColumnClass();
          dc.Name="SOYISIM";
          dc.Datatype="char";
          dc.Length=50;
          tbl.Columns.Add(dc); 
          /* Son olarak olusturulan TableClass nesnesi veritabanimizin tables koleksiyonuna ekleniyor. B&amp;ouml;ylece Sql sunucusunda yer alan veritabani i&amp;ccedil;inde olusturulmasi saglanmis      oluyor. */
          db.Tables.Add(tbl); 
          durumCubugu.Text=tbl.Name.ToString()+" olusturuldu...";
     }
     catch(Exception hata)
     {
          MessageBox.Show(hata.Message);
     } 
} 
private void btnSunucuVeritabanlari_Click(object sender, System.EventArgs e)
{
     this.lstDatabases.Items.Clear();
     /* &amp;Ouml;ncelikle listBox nesnemize Sql Sunucusunda yer alan veritabanlarinin sayisini aktariyoruz.*/
     this.lstDatabases.Items.Add("Sunucudaki veritabani sayisi="+srv.Databases.Count); 
     /* Simdi bir for d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile, srv isimli SQLServerClass nesnemizin Databases koleksiyonunda geziniyoru ve her bir databaseClass nesnesinin adini alip listBox nesnemize aktariyoruz. Burada index degerinin 1 den basladigina sifirdan baslamadigina dikkat edelim. */
     for(int i=1;i&amp;lt;srv.Databases.Count;++i)
     {
          this.lstDatabases.Items.Add(srv.Databases.Item(i,srv).Name.ToString());
     }
} 
private void btnTablolar_Click(object sender, System.EventArgs e)
{
     /* Burada se&amp;ccedil;ilen veritabanına ait tablolar listBox kontrol&amp;uuml;ne getiriliyor */
     this.lstTabels.Items.Clear();
     this.lstTabels.Items.Add("Tablo Sayisi="+srv.Databases.Item(this.lstDatabases.SelectedIndex,srv).Tables.Count.ToString()); 
     /* D&amp;ouml;ng&amp;uuml;m&amp;uuml;z Sql Suncusundan yer alan veritabanı sayısı kadar s&amp;uuml;ren bir d&amp;ouml;ng&amp;uuml;. */
     for(int i=1;i&amp;lt;srv.Databases.Item(this.lstDatabases.SelectedIndex,srv).Tables.Count;++i)
     {
          this.lstTabels.Items.Add(srv.Databases.Item(this.lstDatabases.SelectedIndex,srv).Tables.Item(i,srv). Name.ToString());
     }
} &lt;/pre&gt;
&lt;p&gt;Şimdi uygulamamızı &amp;ccedil;alıştıralım ve &amp;ouml;ncelikle&amp;nbsp; Sql Sunucumuza bağlanalım. &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &lt;img src="/makale/images/mk18_3.gif" alt="" width="360" height="52" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 3. Sunucumuza Bağlandık.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdi bir veritabanı oluşturalım. Ben veritabanı adı olarak DENEME1 yazdım. &amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;&lt;img src="/makale/images/mk18_4.gif" alt="" width="417" height="63" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 4. Veritabanımız Oluşturuldu.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdi ise tablo ismimizi yazalım. Ben deneme olarak Personel yazdım. Şimdi dilerseniz Sql Sunucumuzu bir a&amp;ccedil;alım ve bakalım veritabanımız ve ilgili tablomu yaratılmışmı.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &lt;img src="/makale/images/mk18_5.gif" alt="" width="596" height="383" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 5. Veritabanımız ve Tablomuz oluşturuldu.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Ve tablomuza baktığımızda oluşturduğumuz alanlarıda g&amp;ouml;rebiliriz.&amp;nbsp;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;&lt;img src="/makale/images/mk18_6.gif" alt="" width="404" height="450" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 6. Tablomuzdaki alanlar.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Son olarak suncumuzda yer alan veritabanlarının ve Deneme veritabanu altındaki tablolarında programımızda nasıl g&amp;ouml;r&amp;uuml;nd&amp;uuml;ğ&amp;uuml;ne bakalım. Dikkat ederseniz tablolar ekrana geldiğinde sistem tablolarıda gelir. Bununla birlikte veritabanları g&amp;ouml;r&amp;uuml;n&amp;uuml;rken sadece TempDBd veritabanı g&amp;ouml;r&amp;uuml;nmez.&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;&lt;img src="/makale/images/mk18_7.gif" alt="" width="400" height="392" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil 7. Program ekranını son g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Evet geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle, hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2003-12-12 12:00:00</pubDate>
  <slug>SQL_DMO-Islemleric2a0-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>sql</tag>
    <tag>dmo</tag>
    <tag>com+</tag>
  </tags>
  <categories>
    <category>T SQL</category>
  </categories>
</post>