<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net 2.0 Üzerinde Xslt Kullanımı</title>
  <description>Xml (eXtensible Markup Language - genişletilebilir işaretleme dili), farklı platformlar arasında kolayca bilgi taşınmasına izin veren, veri kümelerini kendi kurallarımızla oluşturmamızı sağlayan önemli standartlardan birisidir...</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Xml (eXtensible Markup Language - genişletilebilir işaretleme dili), farklı platformlar arasında kolayca bilgi taşınmasına izin veren, veri k&amp;uuml;melerini kendi kurallarımızla oluşturmamızı sağlayan &amp;ouml;nemli standartlardan birisidir. Lakin zaman zaman Xml d&amp;ouml;k&amp;uuml;manlarını okumak &amp;ccedil;ok kolay olmamaktadır. En azından oluşturulan Xml d&amp;ouml;k&amp;uuml;manlarında tutulan i&amp;ccedil;eriği, son kullanıcıya farklı şekillerde g&amp;ouml;stermek ihtiyacını duyabiliriz. İşte bu noktada, var olan Xml verisinin farklı bir formata d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lebiliyor olması gerekmektedir. &lt;strong&gt;XSLT&lt;/strong&gt; &lt;strong&gt;(eXtensible Stylesheet Language Transformation)&lt;/strong&gt; standardı tam bu noktada devreye girmektedir. Xslt herhangibir Xml i&amp;ccedil;eriğini farklı bir Xml, Html, Csv (Comma Seperated Values) veya Text formatına d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi ile ilgili materyalleri sağlayan bir işaretleme dilidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk168_1.gif" alt="" width="412" height="200" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu sayede verileri sakladığımız bir Xml i&amp;ccedil;eriğini son kullanıcıya daha&amp;nbsp;uygun formatlarda sunabilme imkanını kazanmış oluruz. Bu &amp;ouml;zellikle web tabanlı sistemlerde son derece &amp;ouml;nemlidir. D&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi sırasında sıradan bir tarayıcı kullanılabileceği gibi, .Net Framework i&amp;ccedil;erisinde yer alan tiplerdende (types) faydalanılabilir. Yani Xslt ile &amp;ccedil;arpıştırılmış bir Xml i&amp;ccedil;eriğine basit bir tarayıcı ile bakabilir yada bu &amp;ccedil;arpıştırma işlemini &lt;strong&gt;y&amp;ouml;netimli kod (managed code)&lt;/strong&gt; &amp;uuml;zerinden .Net Framework tiplerini kullanarak ger&amp;ccedil;ekleştirebiliriz. Xslt kendi i&amp;ccedil;erisinde XPath dilini kullanmaktadır. Bu sayede kaynak Xml d&amp;ouml;k&amp;uuml;manı i&amp;ccedil;erisinde eşleştirme yaparak, d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemini uygulayacağı par&amp;ccedil;aları kolayca bulabilir. Xslt sadece Xml i&amp;ccedil;eriğini farklı formatta g&amp;ouml;stermekle kalmaz d&amp;ouml;n&amp;uuml;ş&amp;uuml;m işlemi sırasında aşağıdaki tabloda belirtilen işlemlerinde yapılabilmesini sağlar.&lt;/p&gt;
&lt;table id="table90" style="border-collapse: collapse; width: 506px;" border="1" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="width: 494px; background-color: #ffffff;" width="494"&gt;&lt;strong&gt; Xslt D&amp;ouml;n&amp;uuml;şt&amp;uuml;rme Operasyonunda Yapılabilecek Bazı İşlemler&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="494"&gt;Sıralama işlemleri uygulatabilmek (Sorting).&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="494"&gt;Filtreleme işlemleri.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="494"&gt;Koşullu ayrıştırmalar (if ve choose kullanımı).&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="494"&gt;Parametre kullanımı sayesinde farklı d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemlerinin sağlanabilmesi.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="494"&gt;Xslt d&amp;ouml;k&amp;uuml;manı i&amp;ccedil;erisinde harici kullanıcı tanımlı fonksiyonları &amp;ccedil;ağırabilmek.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="494"&gt;Xslt d&amp;ouml;k&amp;uuml;manı i&amp;ccedil;erisinde script &amp;ccedil;alıştırabilmek.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Xslt' nin yukarıda sayılanlar haricinde de sahip olduğu pek &amp;ccedil;ok yetenek vardır elbette. Ancak bunlar makalemizin konusunu şu an i&amp;ccedil;in aşmaktadır. Biz bu makalemizde temel olarak Xslt' yi tanıyacak ve .Net Framework 2.0 i&amp;ccedil;inde etkin bir şekilde nasıl kullanabileceğimizi g&amp;ouml;rmeye &amp;ccedil;alışacağız. İlk olarak aşağıdaki &amp;ouml;rnek xml d&amp;ouml;k&amp;uuml;manını ele alalım.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;Muzikler&amp;gt;
    &amp;lt;Muzik ID="1"&amp;gt;
        &amp;lt;Soyleyen&amp;gt;Coldplay&amp;lt;/Soyleyen&amp;gt;
        &amp;lt;AlbumAdi&amp;gt;X and Y&amp;lt;/AlbumAdi&amp;gt;
        &amp;lt;CikisTarihi&amp;gt;2005&amp;lt;/CikisTarihi&amp;gt;
        &amp;lt;Fiyat&amp;gt;28&amp;lt;/Fiyat&amp;gt;
        &amp;lt;Tip&amp;gt;CD&amp;lt;/Tip&amp;gt;
    &amp;lt;/Muzik&amp;gt;
    &amp;lt;Muzik ID="2"&amp;gt;
        &amp;lt;Soyleyen&amp;gt;Depeche Mode&amp;lt;/Soyleyen&amp;gt;
        &amp;lt;AlbumAdi&amp;gt;Playing The Angel&amp;lt;/AlbumAdi&amp;gt;
        &amp;lt;CikisTarihi&amp;gt;2005&amp;lt;/CikisTarihi&amp;gt;
        &amp;lt;Fiyat&amp;gt;25&amp;lt;/Fiyat&amp;gt;
        &amp;lt;Tip&amp;gt;CD&amp;lt;/Tip&amp;gt;
    &amp;lt;/Muzik&amp;gt;
.
.
.
&amp;lt;Muzikler&amp;gt;&lt;/pre&gt;
&lt;p&gt;MuzikDukkanim.xml isimli fiziki dosyada tutulan bu i&amp;ccedil;erikte Muzikler isimli root node (ana boğum) altında Muzik isimli child node' lar (alt boğumlar) yer almaktadır. Muzik boğumu i&amp;ccedil;erisinde ID isimli bir attribute (nitelik) ve Soyleyen, AlbumAdi, CikisTarihi, Fiyat, Tip isimli alt boğumlar yer almaktadır. Bu d&amp;ouml;k&amp;uuml;manı herhangibir tarayıcı &amp;uuml;zerinde a&amp;ccedil;arsak aşağıdakine benzer bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk168_2.gif" alt="" width="352" height="322" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi bu Xml i&amp;ccedil;eriği her ne kadar bir geliştirici (developer) i&amp;ccedil;in anlamlıda olsa, son kullanıcı i&amp;ccedil;in aynı şeyi s&amp;ouml;ylemek pek doğru olmayacaktır. Bu i&amp;ccedil;eriği &amp;ouml;rneğin bir Html &amp;ccedil;ıktısı haline getirebiliriz. B&amp;ouml;ylece son kullanıcı i&amp;ccedil;in daha okunabilir bir yapı sağlamış oluruz. Xslt kendi i&amp;ccedil;erisinde Html takılarına izin verdiği i&amp;ccedil;in &amp;uuml;retilecek &amp;ccedil;ıktının g&amp;ouml;rsel formatını istediğimiz gibi ayarlayabiliriz. Aşağıdaki &amp;ouml;rnek Xslt i&amp;ccedil;eriği bu ama&amp;ccedil;la yazılmıştır.&lt;/p&gt;
&lt;p&gt;XstlForHtml.xsl d&amp;ouml;k&amp;uuml;manı i&amp;ccedil;eriği;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8"?&amp;gt;
&amp;lt;xsl:stylesheet version="1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform"&amp;gt;
&amp;lt;xsl:template match="/"&amp;gt;
    &amp;lt;html&amp;gt;
    &amp;lt;body&amp;gt;
    &amp;lt;h1&amp;gt;M&amp;uuml;zik D&amp;uuml;kkanım&amp;lt;/h1&amp;gt;
        &amp;lt;table border="1" borderColor="Black" cellpadding="0" cellspacing="0"&amp;gt;
            &amp;lt;tr bgcolor="#FFCC66"&amp;gt;
                &amp;lt;th&amp;gt;ID&amp;lt;/th&amp;gt;
                &amp;lt;th&amp;gt;S&amp;ouml;yleyen&amp;lt;/th&amp;gt;
                &amp;lt;th&amp;gt;Alb&amp;uuml;m Adı&amp;lt;/th&amp;gt;
                &amp;lt;th&amp;gt;&amp;Ccedil;ıkış Tarihi&amp;lt;/th&amp;gt;
                &amp;lt;th&amp;gt;Satış Fiyatı&amp;lt;/th&amp;gt;
                &amp;lt;th&amp;gt;Cd/Dvd/Kaset&amp;lt;/th&amp;gt;
            &amp;lt;/tr&amp;gt;
    &amp;lt;xsl:for-each select="Muzikler/Muzik"&amp;gt;
            &amp;lt;tr&amp;gt;
                &amp;lt;td&amp;gt;
                    &amp;lt;xsl:value-of select="@ID"/&amp;gt;
                &amp;lt;/td&amp;gt;
                &amp;lt;td&amp;gt;
                    &amp;lt;font size="2" color="Blue"&amp;gt;
                        &amp;lt;xsl:value-of select="Soyleyen"/&amp;gt;
                    &amp;lt;/font&amp;gt;
                &amp;lt;/td&amp;gt;
                &amp;lt;td&amp;gt;
                    &amp;lt;b&amp;gt;
                        &amp;lt;xsl:value-of select="AlbumAdi"/&amp;gt;
                    &amp;lt;/b&amp;gt;
                &amp;lt;/td&amp;gt;
                &amp;lt;td align="right"&amp;gt;
                    &amp;lt;xsl:value-of select="CikisTarihi"/&amp;gt;
                &amp;lt;/td&amp;gt;
                &amp;lt;td&amp;gt;
                    &amp;lt;b&amp;gt;
                        &amp;lt;xsl:value-of select="Fiyat * 1.5"/&amp;gt; Ytl
                    &amp;lt;/b&amp;gt;
                &amp;lt;/td&amp;gt;
                &amp;lt;td&amp;gt;
                    &amp;lt;xsl:value-of select="Tip"/&amp;gt;
                &amp;lt;/td&amp;gt;
            &amp;lt;/tr&amp;gt;
    &amp;lt;/xsl:for-each&amp;gt;
    &amp;lt;/table&amp;gt;
    &amp;lt;/body&amp;gt;
    &amp;lt;/html&amp;gt;
&amp;lt;/xsl:template&amp;gt;
&amp;lt;/xsl:stylesheet&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bir Xslt i&amp;ccedil;eriği ilk zamanlarda geliştiricilere korkutucu gelebilir. Ancak adım adım incelendiğinde son derece kolay ve anlaşılırdır. Xslt d&amp;ouml;k&amp;uuml;manları mutlaka &lt;strong&gt;stylesheet&lt;/strong&gt; elemanı ile başlar ve biterler. Bu elemanda Xslt d&amp;ouml;k&amp;uuml;manının standardlarında yer alan isim alanı (namespace) ve versiyon numarası (version number) gibi bilgiler yer alır. D&amp;ouml;k&amp;uuml;manımızın i&amp;ccedil;eriğinde yer alan en &amp;ouml;nemli kısımlardan birisi &lt;strong&gt;&amp;lt;xsl:template match="/"&amp;gt;&lt;/strong&gt; boğumudur. Xslt d&amp;ouml;k&amp;uuml;manlarının, kaynak olarak g&amp;ouml;sterildiği xml d&amp;ouml;k&amp;uuml;manı &amp;uuml;zerinde d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi yapabilmesi i&amp;ccedil;in burada bir şablon (template) eşleştirilmesinde bulunması gerekir.&lt;/p&gt;
&lt;p&gt;Bu eşleştirme işleminde ilgili k&amp;uuml;meyi se&amp;ccedil;ebilmek i&amp;ccedil;in XPath ifadeleri kullanılır. Dikkat ederseniz &lt;strong&gt;template&lt;/strong&gt; elemanında (element) &lt;strong&gt;match &lt;/strong&gt;değeri &lt;strong&gt;/&lt;/strong&gt; olarak belirlenmiştir. Bu, Xslt' yi uygulanan Xml d&amp;ouml;k&amp;uuml;manındaki t&amp;uuml;m boğumların (nodes) d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işleminde ele alınacağını belirtir. D&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işleminin hangi &amp;uuml;yelere, nasıl uygulanacağı ve / şablonuna uyan par&amp;ccedil;aların &amp;ccedil;ıktıda nasıl g&amp;ouml;z&amp;uuml;keceğine dair gerekli format ayarları ise &lt;strong&gt;template&lt;/strong&gt; elemanına ait boğum i&amp;ccedil;erisinde yapılmaktadır.&lt;/p&gt;
&lt;p&gt;Xslt d&amp;ouml;k&amp;uuml;manımızda yer alan bir diğer &amp;ouml;nemli eleman (element) &lt;strong&gt;&amp;lt;xsl:for-each select="Muzikler/Muzik"&amp;gt;&lt;/strong&gt;&amp;nbsp; boğumunda ge&amp;ccedil;en &lt;strong&gt;for-each &lt;/strong&gt;' tir. for-each elemanı sayesinde select niteliğinde (attribute) belirtilen k&amp;uuml;me &amp;uuml;zerinde ileri y&amp;ouml;nl&amp;uuml; hareket edebiliriz. Dikkat ederseniz select niteliğinin değeri &lt;strong&gt;Muzikler/Muzik&lt;/strong&gt; olarak belirlenmiştir. Bu da tipik bir &lt;strong&gt;XPath&lt;/strong&gt; ifadesidir. for-each elemanı programlamada kullandığımız foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml;nden farksızdır. Bu eleman sayesinde Muzikler isimli ana boğum (root node) i&amp;ccedil;erisindeki t&amp;uuml;m Muzik alt boğumlarını (child nodes) dolaşacak bir ifade elde etmiş oluruz.&lt;/p&gt;
&lt;p&gt;Dikkat ederseniz Xslt d&amp;ouml;k&amp;uuml;manı i&amp;ccedil;erisinde yer yer Html takıları ge&amp;ccedil;mektedir. Eğer Html' e aşina iseniz, burada bir tablo oluşturulduğunu, başlıklarının, arka plan renginin vb. belirlendiğini g&amp;ouml;rebilirsiniz. Peki ilgili Html tablosunun satırlarında (TR) yer alan s&amp;uuml;tunlar (TD) i&amp;ccedil;erisine gelecek olan değerleri bir Xml d&amp;ouml;k&amp;uuml;manı i&amp;ccedil;erisinden nasıl almaktayız? Yani Xml i&amp;ccedil;eriğindeki hangi alanların nereye geleceğini nasıl belirtebiliriz? Bunun i&amp;ccedil;in Xslt' nin &lt;strong&gt;value-of&lt;/strong&gt; elemanından yararlanmaktayız.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin, &lt;strong&gt;&amp;lt;xsl:value-of select="Tip"/&amp;gt;&lt;/strong&gt; boğumu, Xslt d&amp;ouml;k&amp;uuml;manının uygulandığı Xml i&amp;ccedil;eriğinde yer alan Muzikler/Muzik boğumu(node) altındaki Tip isimli alt boğumun (child nodes) i&amp;ccedil;eriğini bulunduğu yere yazdıracak işlevselliği sağlamaktadır. Gelelim yazmış olduğumuz bu Xslt d&amp;ouml;k&amp;uuml;manının ilgili Xml i&amp;ccedil;eriğine nasıl uygulanacağına. Bunun i&amp;ccedil;in xml d&amp;ouml;k&amp;uuml;manımızın başına &lt;strong&gt;xsl-stylesheet işlemci direktifini (processing directive) &lt;/strong&gt;uygulamamız gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk168_4.gif" alt="" width="443" height="126" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından MuzikDukkanim.xml dosyasını herhangibir tarayıcı penceresinde a&amp;ccedil;arsak aşağıdakine benzer bir &amp;ccedil;ıktı elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk168_3.gif" alt="" width="524" height="294" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere son kullanıcı i&amp;ccedil;in &amp;ccedil;ok fazla anlam ifade etmeyen bir Xml i&amp;ccedil;eriği, Xslt kullanılarak &amp;ccedil;ok daha d&amp;uuml;zenli ve okunabilir bir Html formatına d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lm&amp;uuml;şt&amp;uuml;r. Xslt d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi sırasında kullanabileceğimiz başka fonksiyonelliklerde vardır. &amp;Ouml;rneğin, sonu&amp;ccedil; olarak elde ettiğimiz k&amp;uuml;mede sıralama işlemleri yaptırabilir veya &amp;ccedil;eşitli koşullar uygulatabiliriz. &amp;Ouml;rneğin, MuzikDukkanim.xml dosyasının i&amp;ccedil;eriğinde AlbumAdi alanına g&amp;ouml;re tersten sıralatma yapmak i&amp;ccedil;in Xslt d&amp;ouml;k&amp;uuml;manımızda &lt;strong&gt;sort&lt;/strong&gt; elemanını aşağıdaki gibi kullanmamız yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;xsl:for-each select="Muzikler/Muzik"&amp;gt;
    &amp;lt;xsl:sort select="AlbumAdi" order="descending" data-type="text"/&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Sort&lt;/strong&gt; elemanı (element) &lt;strong&gt;select&lt;/strong&gt; niteliği(attribute) ile hangi alana g&amp;ouml;re sıralama yapılacağını belirtmektedir. &lt;strong&gt;order&lt;/strong&gt; niteliğinde sırlamanın y&amp;ouml;n&amp;uuml;n&amp;uuml; belirtiyoruz (ki burada &lt;strong&gt;descending&lt;/strong&gt; ile tersten sıralama yapacağımızı belirttik). &lt;strong&gt;data-type&lt;/strong&gt; niteliği ise sıralama kriteri i&amp;ccedil;in ele alınacak veri tipini belirtiyor. AlbumAdi alanı string bazlı bir i&amp;ccedil;eriğe sahip olduğundan sıralamanında karakter bazlı olması, bir başka deyişle text tipinde olması gerekiyor. Eğer sayısal bir sıralama s&amp;ouml;z konusu ise data-type değerini &lt;strong&gt;number&lt;/strong&gt; olarak belirtmemiz gerekecektir. Bu değişikliklerden sonra xml d&amp;ouml;k&amp;uuml;manımızı yeniden bir tarayıcı penceresinde a&amp;ccedil;arsak aşağıdakine benzer bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk168_5.gif" alt="" width="519" height="302" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sıralama dışında karşılaştırma ifadelerinide ele alabiliriz. Bunun i&amp;ccedil;in &amp;ccedil;oğunlukla Xslt' nin &lt;strong&gt;if&lt;/strong&gt; yada &lt;strong&gt;choose&lt;/strong&gt; elemanlarından faydalanılır. If elemanını &amp;ouml;zellikle filtreleme yaparken kullanabiliriz. Bu eleman i&amp;ccedil;erisine dahil edilen value-of elemanları belirtilen koşula uyuyorsa &amp;ccedil;ıktı olarak elde edilebilir. &amp;Ouml;rneğin Xml i&amp;ccedil;eriğimizde Tip alanının değeri DVD olanları listelemek istediğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu durumda Xslt d&amp;ouml;k&amp;uuml;manımızda for-each elemanı i&amp;ccedil;erisinde yer alan value-of elemanlarını if elemanına ait boğumlar (nodes) arasına almamız gerekecektir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;xsl:for-each select="Muzikler/Muzik"&amp;gt;
    &amp;lt;xsl:sort select="AlbumAdi" order="descending" data-type="text"/&amp;gt; 
        &amp;lt;xsl:if test="Tip='DVD'"&amp;gt;
            &amp;lt;tr&amp;gt;
                &amp;lt;td&amp;gt;&amp;lt;xsl:value-of select="@ID"/&amp;gt;&amp;lt;/td&amp;gt;
                &amp;lt;td&amp;gt;&amp;lt;font size="2" color="Blue"&amp;gt;&amp;lt;xsl:value-of select="Soyleyen"/&amp;gt;&amp;lt;/font&amp;gt;&amp;lt;/td&amp;gt;
                &amp;lt;td&amp;gt;&amp;lt;b&amp;gt;&amp;lt;xsl:value-of select="AlbumAdi"/&amp;gt;&amp;lt;/b&amp;gt;&amp;lt;/td&amp;gt;
                &amp;lt;td align="right"&amp;gt;&amp;lt;xsl:value-of select="CikisTarihi"/&amp;gt;&amp;lt;/td&amp;gt;
                &amp;lt;td&amp;gt;&amp;lt;b&amp;gt;&amp;lt;xsl:value-of select="Fiyat * 1.5"/&amp;gt; Ytl&amp;lt;/b&amp;gt;&amp;lt;/td&amp;gt;
                &amp;lt;td&amp;gt;&amp;lt;xsl:value-of select="Tip"/&amp;gt;&amp;lt;/td&amp;gt;
            &amp;lt;/tr&amp;gt;
        &amp;lt;/xsl:if&amp;gt;
&amp;lt;/xsl:for-each&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk168_6.gif" alt="" width="447" height="171" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat ederseniz Tip alanında DVD yazan elemanları elde ettik. If elemanı bunu ger&amp;ccedil;ekleştirebilmek i&amp;ccedil;in test isimli niteliğini kullanmaktadır. Elbette burada mantıksal operatorleri kullanarak &amp;ccedil;oklu karşılaştırmalarda yapabiliriz. &amp;Ouml;rneğin tipi Dvd veya Cd olanları elde etmek istediğimizde if elemanını şu şekilde kullanabiliriz.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;xsl:if test="Tip='DVD' or Tip='CD' "&amp;gt;&lt;/pre&gt;
&lt;p&gt;If dışında kullanılabilecek karşılaştırma komutlarından biriside &lt;strong&gt;choose&lt;/strong&gt; elemanıdır. Choose aslında swicth-case' e benzeyen bir yapıdadır. &amp;Ouml;rneğin Xml i&amp;ccedil;eriğimizde Satış Fiyatı 35 Ytl' den k&amp;uuml;&amp;ccedil;&amp;uuml;k olanların arka plan rengini yeşil, 35 Ytl ile 55 Ytl arasında olanların arka plan rengini mavi ve kalan kısıma ait arka plan renklerinide kırmızı yapmak istediğimizi d&amp;uuml;ş&amp;uuml;nelim. &amp;Uuml;stelik bu işlemde sadece Dvd ve Cd tiplerini ele almak istediğimizi varsayalım. Bu durumda Xslt i&amp;ccedil;eriğimizde aşağıdaki değişiklikleri yapmamız yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;xsl:for-each select="Muzikler/Muzik"&amp;gt;
    &amp;lt;xsl:sort select="AlbumAdi" order="descending" data-type="text"/&amp;gt; 
        &amp;lt;xsl:if test="Tip='DVD' or Tip='CD' "&amp;gt;
            &amp;lt;tr&amp;gt;
            &amp;lt;td&amp;gt;&amp;lt;xsl:value-of select="@ID"/&amp;gt;&amp;lt;/td&amp;gt;
            &amp;lt;td&amp;gt;&amp;lt;font size="2" color="Blue"&amp;gt;&amp;lt;xsl:value-of select="Soyleyen"/&amp;gt;&amp;lt;/font&amp;gt;&amp;lt;/td&amp;gt;
            &amp;lt;td&amp;gt;&amp;lt;b&amp;gt;&amp;lt;xsl:value-of select="AlbumAdi"/&amp;gt;&amp;lt;/b&amp;gt;&amp;lt;/td&amp;gt;
            &amp;lt;td align="right"&amp;gt;&amp;lt;xsl:value-of select="CikisTarihi"/&amp;gt;&amp;lt;/td&amp;gt;
            &amp;lt;xsl:choose&amp;gt;
                &amp;lt;xsl:when test="Fiyat &amp;gt;35 and Fiyat &amp;lt;55"&amp;gt;
                    &amp;lt;td bgColor="Blue"&amp;gt;&amp;lt;font color="White" size="3"&amp;gt;&amp;lt;b&amp;gt;&amp;lt;xsl:value-of select="Fiyat"/&amp;gt; ytl&amp;lt;/b&amp;gt;&amp;lt;/font&amp;gt;&amp;lt;/td&amp;gt;
                &amp;lt;/xsl:when&amp;gt;
                &amp;lt;xsl:when test="Fiyat &amp;lt;35"&amp;gt;
                    &amp;lt;td bgColor="Green"&amp;gt;&amp;lt;font color="White" size="3"&amp;gt;&amp;lt;b&amp;gt;&amp;lt;xsl:value-of select="Fiyat"/&amp;gt; ytl&amp;lt;/b&amp;gt;&amp;lt;/font&amp;gt;&amp;lt;/td&amp;gt;
                &amp;lt;/xsl:when&amp;gt;
                &amp;lt;xsl:otherwise&amp;gt;
                    &amp;lt;td bgColor="Red"&amp;gt;&amp;lt;font color="White" size="3"&amp;gt;&amp;lt;b&amp;gt;&amp;lt;xsl:value-of select="Fiyat"/&amp;gt; ytl&amp;lt;/b&amp;gt;&amp;lt;/font&amp;gt;&amp;lt;/td&amp;gt;
                &amp;lt;/xsl:otherwise&amp;gt;
            &amp;lt;/xsl:choose&amp;gt;
            &amp;lt;td&amp;gt;&amp;lt;xsl:value-of select="Tip"/&amp;gt;&amp;lt;/td&amp;gt;
            &amp;lt;/tr&amp;gt;
        &amp;lt;/xsl:if&amp;gt;
&amp;lt;/xsl:for-each&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk168_7.gif" alt="" width="498" height="279" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat ederseniz &lt;strong&gt;choose&lt;/strong&gt; elemanı i&amp;ccedil;erisinde &lt;strong&gt;when&lt;/strong&gt; ve &lt;strong&gt;otherwise&lt;/strong&gt; isimli iki alt eleman kullanılmıştır. When elemanı if elemanı gibi &lt;strong&gt;test&lt;/strong&gt; isimli bir niteliğe sahiptir ki buraya koşulumuzu yazarız. &lt;em&gt;(Choose elemanı i&amp;ccedil;erisinde birden fazla when ifadesi kullanılabilir.)&lt;/em&gt; otherwise ise when elemanında belirtilen koşullara uymayan durumlarda devreye girmektedir.&lt;/p&gt;
&lt;p&gt;Şu ana kadar geliştirdiğimiz &amp;ouml;rneklerde Xslt uyguladığımız Xml i&amp;ccedil;eriğini g&amp;ouml;rmek i&amp;ccedil;in, tarayıcı pencersinde ilgili xml dosyasını a&amp;ccedil;ma yolunu se&amp;ccedil;tik. Lakin Asp.Net uygulamalarında &amp;ccedil;ok sık Xml verileri ile &amp;ccedil;alışmaktayız. Bu nedenle bir Xslt d&amp;ouml;k&amp;uuml;manını herhangibir Xml i&amp;ccedil;eriğine, y&amp;ouml;netimli kod(managed code) tarafında da uyarlayabilmeliyiz. Framework bir Xml d&amp;ouml;k&amp;uuml;manını bir Xslt d&amp;ouml;k&amp;uuml;manı ile &amp;ccedil;arpıştırmak i&amp;ccedil;in pek &amp;ccedil;ok kullanışlı tip i&amp;ccedil;ermektedir. Framework 1.1' de transform işlemleri i&amp;ccedil;in &lt;strong&gt; XslTransform&lt;/strong&gt; tipi kullanılmaktaydı. Bu tip Framework 2.0 i&amp;ccedil;inde ge&amp;ccedil;erlidir. Ancak modası ge&amp;ccedil;miş (obsolute) olarak kabul ediliyor ve yerine gelen yeni &lt;strong&gt;XslCompiledTransform&lt;/strong&gt; tipinin kullanılması &amp;ouml;neriliyor. Kaynaklarda yeni gelen XslCompiledTransform tipinin eskisine g&amp;ouml;re &amp;ccedil;ok daha iyi bir performans sağladığı s&amp;ouml;ylenmekte. Aşağıdaki kod par&amp;ccedil;ası tipik olarak yukarıda ger&amp;ccedil;ekleştirdiğimiz işlemlerin y&amp;ouml;netimli (managed) tarafta nasıl yapılabileceğini i&amp;ccedil;eren basit bir kod par&amp;ccedil;ası sunmaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;XslCompiledTransform xsltran = new XslCompiledTransform();
xsltran.Load(Server.MapPath("XsltForHtml.xsl"));
xsltran.Transform(Server.MapPath("MuzikDukkanim.xml"), null, Response.Output);&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;XslCompiledTransform&lt;/strong&gt; tipinin iki &amp;ouml;nemli &amp;uuml;yesi &lt;strong&gt;Load&lt;/strong&gt; ve &lt;strong&gt;Transform&lt;/strong&gt; metodlarıdır. Load metodu ile d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işleminde kullanılacak olan kaynak Xslt d&amp;ouml;k&amp;uuml;manı belirtilir. &lt;strong&gt; Load&lt;/strong&gt; metodunun altı adet aşırı y&amp;uuml;klenmiş (overload) versiyonu vardır. Yukarıdaki &amp;ouml;rnek kod par&amp;ccedil;asında Xsl dosyasının bulunduğu yol(path) bilgisi kullanılmıştır. Transform işlemleri sırasında eğer performans &amp;ouml;nemli ise Load ve Transform medorlarında &lt;strong&gt;IXPathNavigable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; (interface) tipinden parametre alan versiyonlarının kullanılması &amp;ouml;nerilmektedir. Aşağıdaki kod par&amp;ccedil;asında IXPathNavigable tipine atanabilen &lt;strong&gt;XPathDocument&lt;/strong&gt; referansları kullanılmıştır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;XslCompiledTransform xsltran = new XslCompiledTransform();
XPathDocument doc = new XPathDocument(Server.MapPath("MuzikDukkanim.xml"));
XPathDocument xslDoc = new XPathDocument(Server.MapPath("XsltForHtml.xsl"));
xsltran.Load(xslDoc);
xsltran.Transform(doc, null, Response.Output);&lt;/pre&gt;
&lt;p&gt;Hangi teknik kullanılırsa kullanılsın, d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemini &lt;strong&gt;Transform&lt;/strong&gt; isimli metod ger&amp;ccedil;ekleştirmektedir. Transform metodunun ond&amp;ouml;rt farklı versiyonu bulunmaktadır. Bizim kullandığımız &amp;ouml;rneklerdeki versiyonlarda ilk parametre olarak d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işleminin uygulanacağı Xml d&amp;ouml;k&amp;uuml;manı belirtilmektedir. İkinci parametrede ise, ortamdan Xslt d&amp;ouml;k&amp;uuml;manına g&amp;ouml;ndereceğimiz &amp;ccedil;eşitli parametreler varsa bunlara ait bilgilere yer verilir. Biz şu anki kod par&amp;ccedil;amızda parametre g&amp;ouml;ndermediğimizden burayı null olarak belirttik. Son parametre ise d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;len &amp;ccedil;ıktının nereye yapılacağını belirtmektedir. Bizim &amp;ouml;rneğimizde bu &amp;ccedil;ıktı web sayfasının html i&amp;ccedil;eriğine doğru yapılmaktadır ki bu parametre bir stream de alabilir. Bu da &amp;ccedil;ıktının fiziki bir kaynağa doğru yapılabileceğini g&amp;ouml;sterir. Yukarıdaki kod par&amp;ccedil;alarından herhangibirini &amp;ouml;rnek bir web uygulamasında kullandığımızda aşağıdakine benzer bir &amp;ccedil;ıktıyı o anki g&amp;uuml;ncel aspx sayfası &amp;uuml;zerinde elde edebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk168_8.gif" alt="" width="506" height="202" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bazı durumlarda Xslt d&amp;ouml;k&amp;uuml;manı i&amp;ccedil;erisinde değerini dış ortamdan alacak parametreler kullanmak isteyebiliriz. &amp;Ouml;rneğin geliştirdiğimiz Xslt dosyasında fiyatı dış ortamdan gelen değerden b&amp;uuml;y&amp;uuml;k olanların &amp;uuml;zerinde bir koşul &amp;ccedil;alıştırmak istediğimizi d&amp;uuml;ş&amp;uuml;nelim. &amp;Ouml;ncelikli olarak dış ortamdan gelecek olan parametreyi Xslt d&amp;ouml;k&amp;uuml;manımıza bildirmeli, onu i&amp;ccedil;eride kullanmalı ve daha sonra y&amp;ouml;netimli taraftan bu parametre değerini aktarmalıyız. İlk olarak i&amp;ccedil;eride kullanacağımız parametreyi ekleyerek işe başlayalım. Bunun i&amp;ccedil;in &lt;strong&gt;param&lt;/strong&gt; elemanından aşağıdaki gibi faydalanabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk168_9.gif" alt="" width="406" height="136" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Param elemanına ait &lt;strong&gt;name&lt;/strong&gt; niteliği parametre adını belirtir. &lt;strong&gt;select&lt;/strong&gt; niteliğinde ise bu parametre i&amp;ccedil;in varsayılan bir değer kullanılır. Bu parametreyi &amp;ouml;rnek olarak when elemanı i&amp;ccedil;erisinde kullanabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk168_10.gif" alt="" width="268" height="177" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Peki bu parametreye y&amp;ouml;netimli kod i&amp;ccedil;erisinden nasıl değer g&amp;ouml;ndereceğiz? S&amp;ouml;z konusu parametre XslCompiledTransform sınıfının Transform metodu i&amp;ccedil;in aslında bir arg&amp;uuml;mandır. Xslt d&amp;ouml;k&amp;uuml;manı i&amp;ccedil;erisinde birden fazla parametre tanımlanmış olabilir. T&amp;uuml;m bu parametreler ve değerleri &lt;strong&gt;XsltArgumentList&lt;/strong&gt; isimli bir tip ile saklanırlar. Aşağıdaki kod par&amp;ccedil;asında web sayfasındaki bir TextBox kontrol&amp;uuml;nden alınan sayısal değer, yukarıda tanımlamış olduğumuz Price isimli parametreye değer olarak aktarılmaktadır. Dikkat ederseniz XsltArgumentList tipine ait nesne &amp;ouml;rneğimize &lt;strong&gt;AddParam&lt;/strong&gt; metodu ile Price parametresi eklenmiş ve değeri verilmiştir. Sonrasında ise Transform metodunun ikinci parametresine argList isimli nesnemiz bildirilmiştir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void Parametric(decimal price)
{
    XslCompiledTransform xsltran = new XslCompiledTransform();
    xsltran.Load(Server.MapPath("XsltForHtml.xsl"));
    XsltArgumentList argList = new XsltArgumentList();
    argList.AddParam("Price", "", price);
    xsltran.Transform(Server.MapPath("MuzikDukkanim.xml"), argList, Response.Output);
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk168_11.gif" alt="" width="507" height="344" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bazı durumlarda Xslt i&amp;ccedil;erisinden dış ortama parametre aktarıp bir takım hesaplamalar yaptırmak isteyebiliriz. Bu tipik olarak, Xslt d&amp;ouml;k&amp;uuml;manı i&amp;ccedil;erisinden dışarıdaki bir metodu &amp;ccedil;ağırmak anlamına gelmektedir. Dolayısıyla, Xslt d&amp;ouml;k&amp;uuml;manı i&amp;ccedil;erisinde kaps&amp;uuml;lleyemiyeceğimiz bir takım kodları, dış ortamda ele alabilir ve Xslt d&amp;ouml;k&amp;uuml;manı i&amp;ccedil;erisinden buraya parametre g&amp;ouml;nderebiliriz. İlk olarak aşağıdaki gibi basit bir sınıf tasarlayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class PriceManager
{
    public decimal LastPrice(string fiyat)
    {
        decimal fyt = Convert.ToDecimal(fiyat);
        return fyt - 1;
    }
}&lt;/pre&gt;
&lt;p&gt;Bu sınıf i&amp;ccedil;erisinde yer alan LastPrice isimli metod bir parametre almaktadır. İşte biz bu parametrenin değerini Xslt d&amp;ouml;k&amp;uuml;manımız i&amp;ccedil;erisinden g&amp;ouml;ndereceğiz. B&amp;ouml;ylece Xslt d&amp;ouml;k&amp;uuml;manının ele aldığı alan değerini ele alacak iş mantığını kendi yazdığımız bir tip i&amp;ccedil;erisine almış bulunuyoruz. Metodun d&amp;ouml;n&amp;uuml;ş değeri ise, Xslt d&amp;ouml;k&amp;uuml;manında bu metodu &amp;ccedil;ağırdığımız yerde kullanılabilecektir. Bu aşamadan sonra kodlarımızıda aşağıdaki gibi değiştirmemiz gerekiyor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;XslCompiledTransform xsltran = new XslCompiledTransform();
XPathDocument doc = new XPathDocument(Server.MapPath("MuzikDukkanim.xml"));
XPathDocument xslDoc = new XPathDocument(Server.MapPath("XsltForHtml.xsl"));
XsltArgumentList argLst = new XsltArgumentList();
PriceManager tip = new PriceManager();
argLst.AddExtensionObject("urn:MyType", tip);
xsltran.Load(xslDoc);
xsltran.Transform(doc, argLst, Response.Output);&lt;/pre&gt;
&lt;p&gt;Burada yine başrol oyuncumuz &lt;strong&gt;XsltArgumentList&lt;/strong&gt; tipidir. Ancak bu sefer, Xslt d&amp;ouml;k&amp;uuml;manının dış ortama g&amp;ouml;nderdiği parametreyi işleyecek ve kullanacak bir nesne s&amp;ouml;z konusudur. Bu sebepten &lt;strong&gt;AddExtensionObject&lt;/strong&gt; metodu kullanılmıştır. Bu metod ilk parametre olarak bir &lt;strong&gt;xml namespace (isim alanı)&lt;/strong&gt; bilgisi almaktadır. İkinci parametre ise, Xslt d&amp;ouml;k&amp;uuml;manının kullanacağı tipe ait nesne &amp;ouml;rneği referansıdır. Gelelim Xslt d&amp;ouml;k&amp;uuml;manımıza. Burada herşeyden &amp;ouml;nce &lt;strong&gt;urn:MyType&lt;/strong&gt; isim alanının belirtilmesi gereklidir. Bunun i&amp;ccedil;in stylesheet elemanına bir isim alanı bildirimini aşağıdaki gibi eklememiz gerekecektir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;xsl:stylesheet version="1.0"
xmlns:xsl="http://www.w3.org/1999/XSL/Transform" xmlns:MyType="urn:MyType"&amp;gt;&lt;/pre&gt;
&lt;p&gt;Artık isim alanını tanımladığımıza g&amp;ouml;re, Xslt d&amp;ouml;k&amp;uuml;manımız i&amp;ccedil;erisinde PriceManager tipine ait nesne &amp;ouml;rneğini ve &amp;uuml;ye metodunu &amp;ccedil;ağırabilir ve parametre g&amp;ouml;nderebiliriz. Aşağıdaki &amp;ouml;rnek kullanım bu işin nasıl yapılabileceğini g&amp;ouml;stermektedir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;xsl:when test="Fiyat &amp;lt;=$Price"&amp;gt;
    &amp;lt;td bgColor="Green"&amp;gt;
        &amp;lt;font color="White" size="3"&amp;gt;&amp;lt;b&amp;gt; &amp;lt;xsl:value-of select="MyType:LastPrice(Fiyat)"/&amp;gt; ytl&amp;lt;/b&amp;gt;&amp;lt;/font&amp;gt;
    &amp;lt;/td&amp;gt;
&amp;lt;/xsl:when&amp;gt;&lt;/pre&gt;
&lt;p&gt;Dikkat ederseniz value-of elemanı i&amp;ccedil;erisinde yer alan select niteliğinde metod &amp;ccedil;ağırısı yapılmıştır. MyType isim alanı kod tarafında tip isimli PriceManager sınıfına ait nesne &amp;ouml;rneğini işaret etmektedir. Dolayısıya bu bilgi &amp;uuml;zerinden kolayca LastPrice metoduna erişilmiş ve Fiyat isimli Xml alanının değeri parametre olarak g&amp;ouml;nderilebilmiştir. Elbetteki metodun d&amp;ouml;n&amp;uuml;ş değeri, select elemanının bulunduğu h&amp;uuml;creye yazılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk168_12.gif" alt="" width="507" height="279" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu makalemizde kısaca Xslt' nin ne olduğunu, ne işe yaradığını, .Net Framework i&amp;ccedil;erisinden nasıl kullanılabileceğini kısaca incelemeye &amp;ccedil;alıştık. Aslında Xslt başlı başına bir konudur ve ayrıca zaman ayrılması gerekmektedir. Xml, Xslt, Xpath gibi pop&amp;uuml;ler konuların .Net ile olan ilişkilerini daha iyi anlayabilmek i&amp;ccedil;in size Wrox' un &lt;a href="http://www.amazon.com/gp/product/0764596772/sr=8-5/qid=1153400205/ref=sr_1_5/103-4704336-3222215?ie=UTF8" target="_blank"&gt; Professional ASP.NET 2.0 XML (Programmer to Programmer)&lt;/a&gt; kitabını tavsiye ederim. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/UsingXSLT.rar"&gt;&amp;Ouml;rnek Uygulama İ&amp;ccedil;in Tıklayın.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2006-07-20 12:00:00</pubDate>
  <slug>Asp-Net-2-0-Uzerinde-Xslt-Kullanc4b1mc4b1-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet-20</tag>
    <tag>xslt</tag>
  </tags>
  <categories>
    <category>Asp.Net 2.0</category>
  </categories>
</post>