<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tasarım Desenleri - Iterator</title>
  <description>Küçüklüğümde pek çoğumuz gibi sahip olduğum bir pul koleksiyonum vardı. Halen daha sakladığım pullar bulunmaktadır. Hatta o zamanlarda, çocuklar posta aracılığıyla yurt dışından arkadaşlar edinir, birbirleriyle pul değiş tokuşu bile yaparlardı...</description>
  <content>&lt;p style="text-align: left;"&gt;&lt;img style="float: left;" src="/pics/2009%2f7%2fblg53_Giris.jpg" alt="" width="179" height="154" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;K&amp;uuml;&amp;ccedil;&amp;uuml;kl&amp;uuml;ğ&amp;uuml;mde pek &amp;ccedil;oğumuz gibi sahip olduğum bir pul koleksiyonum vardı. Halen daha sakladığım pullar bulunmaktadır. Hatta o zamanlarda, &amp;ccedil;ocuklar posta aracılığıyla yurt dışından arkadaşlar edinir, birbirleriyle pul değiş tokuşu bile yaparlardı. D&amp;uuml;ş&amp;uuml;nsenize, hem yabancı dilinizi geliştiriyor hem pul koleksiyonunuzu genişletiyorsunuz.&lt;/p&gt;
&lt;p&gt;Tabiki posta mesajlaşması biraz zaman alan bir mevzuydu. Bu g&amp;uuml;nk&amp;uuml; gibi sosyal i&amp;ccedil;erikli portallar veya mesajlaşma cihazları ve daha nice gelişmiş teknoloji yoktu. Acaba bu devirde yaşayan &amp;ccedil;ocuklardan ka&amp;ccedil;ı pul koleksiyonu yapıyor&amp;nbsp;&lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&amp;nbsp;Neyse bu duygusal ortamdan &amp;ccedil;ıkalım hemen. Pul koleksiyonumda yaptığım işlerden birisi zaman zaman onları baştan sonra, yada sondan başa, yada ortadan bir yerden herhangibir y&amp;ouml;ne doğru g&amp;ouml;zle taramak olurdu. Bazen kendi kafama g&amp;ouml;re sıralarını değiştirirdim. Peki nesne y&amp;ouml;nelimli dillerde kullandığımız koleksiyon veya dizi gibi veri yapıları &amp;uuml;zerindede bu ve benzer işlemleri yapmıyor muyuz? &amp;Ccedil;eşitli tipte &lt;strong&gt;veri yapılarında(Data Structures)&lt;/strong&gt; dolaşıyor, i&amp;ccedil;eriklerine bakıyoruz.&lt;/p&gt;
&lt;p&gt;Koleksiyonlar, C# gibi bir programlama dilinde belkide en &amp;ouml;nemli &lt;strong&gt;veri yapılarından(Data Structures)&lt;/strong&gt; birisidir. Bir koleksiyon kendi i&amp;ccedil;erisinde farklı tipte veya aynı tipte nesneleri &amp;ccedil;eşitli formatlarda&lt;em&gt;(List, Stack, Queue, Dictionary vb...)&lt;/em&gt; saklayabilen nesne b&amp;uuml;t&amp;uuml;nleri olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Hatta bildiğiniz &amp;uuml;zere &lt;strong&gt;.Net 2.0&lt;/strong&gt; ile birlikte C# ve Vb.Net tarafına kazandırılan &lt;strong&gt;generic&lt;/strong&gt; yetenekler ile, koleksiyonların &lt;strong&gt;tip g&amp;uuml;venli(Type Safety)&lt;/strong&gt; olarak ele alınmalarıda garanti edilmiştir. Hatta, C# 3.0 ve Vb 9.0 ile birlikte neler olmuştur neler &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Artık koleksiyonlar &amp;uuml;zerinden &lt;strong&gt;LINQ&lt;/strong&gt; sorguları yardımıyla sanki bir veritabanı tablosunu sorgularmışcasına filtrelemeler yapılabilmektedir. Ancak olayın en başından beri s&amp;uuml;re gelen ve bu yazımıza konu olan bir durumda s&amp;ouml;z konusudur. Bir koleksiyonun veya bir dizinin i&amp;ccedil; yapısını bilmeye gerek duymadan, başından sonunda kadar dolaşılabilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Dolayısıyla, koleksiyon veya dizi gibi bir nesne b&amp;uuml;t&amp;uuml;n&amp;uuml;n&amp;uuml;n i&amp;ccedil;erisindeki elemanlara erişilmesi ve dolaşılması noktasında devreye giren bir akt&amp;ouml;r olmalıdır. Aslında bu sorumluluk, bir &lt;strong&gt;&amp;ouml;teleme nesnesine(Iterator Object)&lt;/strong&gt; verilmiştir.&lt;/p&gt;
&lt;p&gt;Bu a&amp;ccedil;ıdan bakıldığında nesne b&amp;uuml;t&amp;uuml;n&amp;uuml;n&amp;uuml;n elemanlarına&lt;em&gt;(&amp;ccedil;oğunlukla koleksiyon veya dizi olarak d&amp;uuml;ş&amp;uuml;nebiliriz)&lt;/em&gt; erişilmesi, bu elemanların baştan sona dolaşılması, bir &amp;ouml;teleme sırasında nerede kalındığının tutulması, hangi koşula g&amp;ouml;re devam edilmesi gerektiğinin bilinmesi, devam edilecek ise bir sonra gelen nesnenin d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi gibi sorumlulukları &amp;uuml;st&amp;uuml;ne alan bir akt&amp;ouml;rden bahsetmekteyiz. Ki bu akt&amp;ouml;r aslında &lt;strong&gt;generic programlamada&lt;/strong&gt; &amp;ouml;nemli bir yerede sahiptir. Nitekim, herhangibir nesne b&amp;uuml;t&amp;uuml;n&amp;uuml;n i&amp;ccedil;inde dolaşılması i&amp;ccedil;in standart bir yol sunulması generic programlamanın gereksinimlerinden birisidir. Veri yapılarının ne kadar sık kullanıldığı d&amp;uuml;ş&amp;uuml;n&amp;uuml;l&amp;uuml;nce doğal olarak ortaya, tasarımı kalıplaşmış bir uygulama bi&amp;ccedil;imi &amp;ccedil;ıkmaktadır. İşte bu yazımızın konusu,&amp;nbsp;&lt;strong&gt;Behavioral(Davranışsal)&lt;/strong&gt;&amp;nbsp;kalıplardan olan&amp;nbsp;&lt;strong&gt;Iterator&lt;/strong&gt; tasarım deseni.&lt;/p&gt;
&lt;p&gt;Tabiki programlama dillerine zaman i&amp;ccedil;erisinde gelen bazı ek yetenekler sayesinde desenin uygulanış bi&amp;ccedil;imi &amp;ccedil;ok daha kolaylaşmıştır. &amp;Ouml;zellikle C# tarafında, 2.0 versiyonu ile birlikte gelen &lt;strong&gt;yield&lt;/strong&gt; anahtar kelimesinin kullanımı, C# 3.0 ile birlikte &lt;strong&gt;LINQ(Language Integrated Query)&lt;/strong&gt; &amp;ouml;zelliklerinin gelmesi aslında nesnelerin elemanları &amp;uuml;zerinde bir u&amp;ccedil;tan diğerine farklı filtrelemelere g&amp;ouml;re hareket edilmesini son derece kolaylaştırmaktadır. C# tarafında bu konu ile ilişkili baş akt&amp;ouml;r &lt;strong&gt;IEnumerable&lt;/strong&gt; &lt;strong&gt;aray&amp;uuml;z&amp;uuml;d&amp;uuml;r(Interface).&lt;/strong&gt; Kendisi doğal yollardan &lt;strong&gt;Iterator&lt;/strong&gt; deseninin uygulanabilir olmasını sağlamaktadır. Biz bu yaklaşımları yazımızın sonlarında değerlendireceğiz. Şimdilik desenimizi kuralına uygun olaraktan geliştireceğiz. &amp;Ouml;ncesinde iterator kalıbına &amp;ouml;rnek bir ka&amp;ccedil; senaryo &amp;uuml;zerinde durmaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin herhangibir bilgisayar sisteminde yer alan klas&amp;ouml;r yapısında bu desenin uygulanışını değerlendirebiliriz. Klas&amp;ouml;rler kendi i&amp;ccedil;lerinde alt klas&amp;ouml;rler veya dosyalar i&amp;ccedil;erir. Bunların ekrana beliri bir formatta listelenmesi sırasında o anki klas&amp;ouml;r ağacının tamamının bir u&amp;ccedil;tan diğerine dolaşılması gerekecektir. Ya da bir klas&amp;ouml;r&amp;uuml;n toplam boyutunun bulunması istendiğinde, alt klas&amp;ouml;r ve i&amp;ccedil;lerindeki dosyaların boyutlarınında bir u&amp;ccedil;tan diğerine değerlendirilmesi gerekecektir. Buradaki klas&amp;ouml;r yapısı ve i&amp;ccedil;eriği nesnel bazda d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde, &amp;ccedil;eşitli filtrelemelere g&amp;ouml;re değerlendirilebilmesinde sorumluluk, &lt;strong&gt;Iterator&lt;/strong&gt; nesnesi tarafından &amp;uuml;stlenilebilir.&lt;/p&gt;
&lt;p&gt;Unutulmaması gereken noktalardan birisi de, &lt;strong&gt;Iterator&lt;/strong&gt; tasarım kalbında nesne b&amp;uuml;t&amp;uuml;n&amp;uuml; i&amp;ccedil;erisindeki elemanların nasıl yapılandırıldıklarının bir &amp;ouml;neminin olmayışıdır. Desenin amacı s&amp;ouml;z konusu nesne b&amp;uuml;t&amp;uuml;n&amp;uuml; baştan sona dolaşabilmektir. Bir başka &amp;ouml;rnek olarak bir şirketin organizasyonel yapısını ifade eden bir nesne b&amp;uuml;t&amp;uuml;n&amp;uuml; g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Ağa&amp;ccedil; yapısı şeklinde ifade edilebilecek bu nesne b&amp;uuml;t&amp;uuml;n&amp;uuml;n i&amp;ccedil;erisinde hareket edilebilmesi sırasında dalların dizilişleri, alt dallarda kimlerin olduğu, nasıl hareket edilmesi gerektiği gibi kriterlerin sorumlulukları Iterator nesnesine y&amp;uuml;klenebilir.&lt;/p&gt;
&lt;p&gt;Şimdi basit bir &amp;ouml;rnekten ilerleyerek desenimizi kavramaya &amp;ccedil;alışalım. Ama &amp;ouml;ncesinde UML şemamıza bakmakta yarar olduğu kanısındayım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f7%2fblg53_uml.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şekildende g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;Iterator&lt;/strong&gt; nesnesi, &amp;ouml;teleme sorumlulukları i&amp;ccedil;in bir aray&amp;uuml;z sunmakta ve nesne k&amp;uuml;mesi i&amp;ccedil;erisindeki hareketlilik sırasında yapılması gereken bazı operasyonları bildirmektedir. O anki nesnenin kim olduğunun bilinmesi i&amp;ccedil;in &lt;strong&gt;CurrentItem&lt;/strong&gt; gibi bir metod&lt;em&gt;(veya &amp;ouml;zellik-property olabilir)&lt;/em&gt; kullanılmaktadır. B&amp;uuml;t&amp;uuml;n i&amp;ccedil;erisindeki bir sonraki elemana ge&amp;ccedil;mek i&amp;ccedil;in &lt;strong&gt;MoveNext&lt;/strong&gt; metodu, takip eden nesne olup olmadğını tespit etmek i&amp;ccedil;in &lt;strong&gt;IsContinue&lt;/strong&gt; metodu kullanılabilir. Yada iterasyona başlarken ilk elemana gitmek i&amp;ccedil;in &lt;strong&gt;First&lt;/strong&gt; operasyonu ele alınabilir. Tabiki bu metodlar tamamen semboliktir. Nitekim &lt;strong&gt;IEnumerator&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;de kendi i&amp;ccedil;erisinde buna benzer metodları sunmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f7%2fblg53_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;UML&lt;/strong&gt; şemamıza baktığımızda, istemciden nesne b&amp;uuml;t&amp;uuml;n&amp;uuml;n&amp;uuml;n kendisine&lt;strong&gt;(Aggregate object)&lt;/strong&gt; ve &lt;strong&gt;Iterator&lt;/strong&gt; tipine doğru bir &lt;strong&gt;Association&lt;/strong&gt; tanımlandığını g&amp;ouml;rmekteyiz. Sonu&amp;ccedil; olarak istemci tarafı &lt;strong&gt;Aggregate&lt;/strong&gt; nesnesini kullanmakta ve i&amp;ccedil;erisinde dolaşmak i&amp;ccedil;in &lt;strong&gt;Iterator&lt;/strong&gt; &amp;ouml;rneklerinden yararlanmaktadır. Benzer şekilde iterasyon sorumluluğunu yerine getiren nesnede&lt;strong&gt;(Concrete Iterator)&lt;/strong&gt; &amp;ccedil;ok doğal olarak &lt;strong&gt;ConcreteAggregate&lt;/strong&gt; nesnesinin &amp;uuml;yelerine erişmekte ve kullanmaktadır. Yani &lt;strong&gt;ConcreteIterator'&lt;/strong&gt; dan &lt;strong&gt;ConcreteAggregate'&lt;/strong&gt; e doğru bir&lt;strong&gt; ilişki(Association)&lt;/strong&gt; mevcuttur.&lt;/p&gt;
&lt;p&gt;Artık &amp;ouml;rneğimizi tasarlamaya başlayabiliriz. Kalıbın nasıl uygulandığını g&amp;ouml;rmek istediğimizden &amp;ccedil;ok basit bir senaryo &amp;uuml;zerinden gideceğiz. Senaryomuzda &lt;strong&gt;Product&lt;/strong&gt; tipinden nesne &amp;ouml;rneklerini barındıran bir nesne b&amp;uuml;t&amp;uuml;n&amp;uuml;m&amp;uuml;z olduğunu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alacağız. Buna g&amp;ouml;re Iterator tasarım kalbının kullanaraktan, &amp;uuml;r&amp;uuml;nleri dolaşabilmek i&amp;ccedil;in bir Iterator nesnesinin nasıl geliştirilebileceğini ele alacağız. Sınıf diagramımız,&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f7%2fblg53_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;şeklinde olup kodlarımızda aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections;
using System.Collections.Generic;

namespace IteratorPattern
{
&amp;nbsp;&amp;nbsp;&amp;nbsp; // Item
&amp;nbsp;&amp;nbsp;&amp;nbsp; class Product
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public int ProductId { get; set; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public string Name { get; set; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public decimal ListPrice { get; set; }

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public override string ToString()
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; return String.Format("{0} {1} {2}", ProductId.ToString(), Name, ListPrice.ToString("C2"));
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp; // Iterator
&amp;nbsp;&amp;nbsp;&amp;nbsp; // Nesne b&amp;uuml;t&amp;uuml;n&amp;uuml; i&amp;ccedil;erisindeki hareketlerin, y&amp;ouml;nlenmelerin ger&amp;ccedil;ekleştirilebilmesi i&amp;ccedil;in gerekli operasyon aray&amp;uuml;z&amp;uuml;n&amp;uuml; tanımlar.
&amp;nbsp;&amp;nbsp;&amp;nbsp; interface IProductIterator
&amp;nbsp;&amp;nbsp;&amp;nbsp; {&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; 
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Product First();
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Product MoveNext();
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; bool IsContinue { get; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Product Current { get; }
&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp; // Aggregate
&amp;nbsp;&amp;nbsp;&amp;nbsp; // Nesne b&amp;uuml;t&amp;uuml;n&amp;uuml;n&amp;uuml;n, iterasyon i&amp;ccedil;in Concrete Iterator tipinden nesne &amp;ouml;rneği d&amp;ouml;nd&amp;uuml;recek bir metodunun olmasını s&amp;ouml;yler.
&amp;nbsp;&amp;nbsp;&amp;nbsp; interface IProductCollection
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; IProductIterator GetIterator();
&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp; // Concrete Aggregate
&amp;nbsp;&amp;nbsp;&amp;nbsp; // Nesne k&amp;uuml;mesini barındıran tipimiz.
&amp;nbsp;&amp;nbsp;&amp;nbsp; class ProductCollection
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; : IProductCollection
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Product topluluğunu saklamak i&amp;ccedil;in generic bir List&amp;lt;T&amp;gt; koleksiyonundan yardım alıyoruz.
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; private List&amp;lt;Product&amp;gt; list = new List&amp;lt;Product&amp;gt;();

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // &amp;Uuml;r&amp;uuml;n sayısını dışarıya vermek i&amp;ccedil;in kullanılan bir &amp;ouml;zellik
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public int ProductCount
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; get { return list.Count; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Eleman eklemek ve okumak i&amp;ccedil;in kullanılan bir Indeksleyici
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public Product this[int index]
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; get { return list[index]; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; set { list.Add(value); }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; 
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; #region IProductCollection Members

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Iterator nesnesini &amp;ouml;rnekler
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public IProductIterator GetIterator()
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Iterator nesnesi &amp;ouml;rneklenirken parametre olarak o andaki ProductCollection nesne &amp;ouml;rneği referans olarak g&amp;ouml;nderilir. 
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Bu sayede ProductIterator isimli Concrete Iterator nesne &amp;ouml;rneği, &amp;ccedil;alışma zamanında hangi nesne b&amp;uuml;t&amp;uuml;n&amp;uuml;n&amp;uuml; dolaşacağını bilecektir.
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; return new ProductIterator(this);
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; #endregion
&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp; // Concrete Iterator
&amp;nbsp;&amp;nbsp;&amp;nbsp; // Nesne b&amp;uuml;t&amp;uuml;n&amp;uuml;n&amp;uuml;n bir ucundan diğerine hareket edilebilmesine olanak sağlayacak fonksiyonellikleri uygulayan asıl Iterator tipi
&amp;nbsp;&amp;nbsp;&amp;nbsp; class ProductIterator
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; : IProductIterator
&amp;nbsp;&amp;nbsp;&amp;nbsp; {&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; 
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Iterator nesne &amp;ouml;rneğinin, &amp;ccedil;alışma zamanında hangi nesne b&amp;uuml;t&amp;uuml;n&amp;uuml;n&amp;uuml; dolaşacağını bilmesi gerekmektedir. 
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; private ProductCollection _books;
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; private int _currentIndex = 0;
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // İstemci isterse adım sayısını değiştirebilir. &amp;Ouml;rneğin ikişer ikişer atlanarak gidilmesi sağlanabilir,
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public int StepSize { get; set; }

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // bu nedenle yapıcı metoda parametre olarak, ProductCollection(Concrete Aggregate) nesne &amp;ouml;rneğinin referansı gelir. Bu referansın GetIterator metodu i&amp;ccedil;erisindeki &amp;ccedil;ağrı ile g&amp;ouml;nderildiğini hatırlayalım.
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public ProductIterator(ProductCollection productCollection)
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; _books = productCollection;
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; #region IProductIterator Members

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // İlk elemana gidilmesini sağlayan metod
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public Product First()
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Nerede olunduğunun takibi i&amp;ccedil;in _currentIndex değeri set edilir
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; _currentIndex = 0;
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; return _books[0];
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Bir sonraki elemana ge&amp;ccedil;ilmesini sağlayan metod
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public Product MoveNext()
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Nerede olunduğunun takibi i&amp;ccedil;in _currentIndex değeri set edilir. Adım sayısı kadar arttırılır.
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; _currentIndex += StepSize;
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; if (IsContinue) // Eğer takip eden bir eleman var ise geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;r
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; return _books[_currentIndex];
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; else
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; return null;
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Takip eden &amp;uuml;r&amp;uuml;n olup olmadığını belirten read-only &amp;ouml;zellik
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public bool IsContinue
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; get { return _currentIndex &amp;lt; _books.ProductCount; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // O anki elemanı d&amp;ouml;nd&amp;uuml;ren read-only &amp;ouml;zellik
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public Product Current
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; get { return _books[_currentIndex]; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; #endregion
&amp;nbsp;&amp;nbsp;&amp;nbsp; }&amp;nbsp;&amp;nbsp;&amp;nbsp;

&amp;nbsp;&amp;nbsp;&amp;nbsp; class Program
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; static void Main(string[] args)
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; ProductCollection products = new ProductCollection();

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; products[0]=new Product{ ProductId=1, Name="330 ml Seramik Bardak", ListPrice=12M};
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; products[1] = new Product { ProductId = 2, Name = "1 Lt Cam Bardak", ListPrice = 12.5M };
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; products[2] = new Product { ProductId = 3, Name = "50 cl Pet Şişe", ListPrice = 14.45M };

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Iterator nesnesi products isimli koleksiyonu kullanmak &amp;uuml;zere oluşturulur
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; ProductIterator iterator = new ProductIterator(products);

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Adım sayısı belirlenir
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; iterator.StepSize = 1;

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // First ile ilk elemana konumlanılır.
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // Koşul olarak IsContinue değerine bakılır
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; // İlerleme i&amp;ccedil;in MoveNext metodu kullanılır.
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; for (
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Product product = iterator.First()
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; ; iterator.IsContinue
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; ; product = iterator.MoveNext()
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; )
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Console.WriteLine(product.ToString());
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp; }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rneğimizi &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;ları elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f7%2fblg53_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabiki amacımız sadece kalıbın nasıl uygulandığını &amp;ouml;ğrenmek olduğundan, işimizi kolaylaştırması i&amp;ccedil;in aslında i&amp;ccedil;eride generic bir &lt;strong&gt;List&amp;lt;T&amp;gt;&lt;/strong&gt; koleksiyonundan yararlandık. Ama tabiki var olan koleksiyonlar ile ifade edilemeyecek bir nesne b&amp;uuml;t&amp;uuml;n&amp;uuml; olduğunda&lt;em&gt;(&amp;ouml;zel bir ağa&amp;ccedil; yapısı olabilir)&lt;/em&gt; daha farklı bir depolama modeli kullanmamız gerekebilir. &lt;strong&gt;DoFactory.com&lt;/strong&gt; sitesinin istatistiklerine g&amp;ouml;re neredeyse kullanılmadığı g&amp;ouml;r&amp;uuml;lmemiş bir tasarım deseni ile karşı karşıyayız aslında. Peki, aramızdan ka&amp;ccedil; geliştirici C#&amp;nbsp; veya Vb.Net tarafında bu deseni isteyerek ve bilin&amp;ccedil;li olarak kullandı.&lt;/p&gt;
&lt;p&gt;Ne kadar ilgin&amp;ccedil; değil mi? Kodlama sırasında bir koleksiyon &amp;uuml;zerinde dolaşırken tek yapmamız gereken &amp;ccedil;oğunlukla bir d&amp;ouml;ng&amp;uuml;y&amp;uuml; kullanmaktır&lt;em&gt;(for, foreach, while vb...)&lt;/em&gt;. Hatta basit bir &lt;strong&gt;LINQ &lt;/strong&gt;sorgusu sonrası filtrelenmiş bir i&amp;ccedil;eriği bile for, while gibi d&amp;ouml;ng&amp;uuml;ler ile dolaşmamız s&amp;ouml;z konusudur. Ama hi&amp;ccedil; arka planda bu sorumluluğu alan bir &lt;strong&gt;Iterator&lt;/strong&gt; nesnesi olduğunu ve bir kalıp uygulandığını d&amp;uuml;ş&amp;uuml;nmeyiz. Şimdi bu moral bozukluğu ile aslında işleri nasıl kolaylaştırmış olduğumuza bir bakalım&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Yukarıda geliştirdiğimiz &amp;ouml;rneğin benzeri ile devam ediyor olacağız. İşte &lt;strong&gt;IEnumerable&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; ve &lt;strong&gt;yield&lt;/strong&gt; anahtar kelimesi...&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class ProductList
&amp;nbsp;&amp;nbsp;&amp;nbsp; : IEnumerable&amp;lt;Product&amp;gt;
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; private List&amp;lt;Product&amp;gt; list = new List&amp;lt;Product&amp;gt;();

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public Product this[int index]
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; get { return list[index]; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; set { list.Add(value); }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; #region IEnumerable&amp;lt;Product&amp;gt; Members

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; public IEnumerator&amp;lt;Product&amp;gt; GetEnumerator()
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; foreach (Product product in list)
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; yield return product;
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; #endregion

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; #region IEnumerable Members

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; IEnumerator IEnumerable.GetEnumerator()
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; throw new NotImplementedException();
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; }

&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; #endregion
&amp;nbsp;&amp;nbsp;&amp;nbsp; }&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere .Net i&amp;ccedil;erisinde yer alan ve nesnelere iterasyon &amp;ouml;ğreten &lt;strong&gt;IEnumerable&amp;lt;T&amp;gt;&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; &lt;strong&gt;yield&lt;/strong&gt; ile birlikte ele alarak, &lt;strong&gt;ProductList&lt;/strong&gt; nesne &amp;ouml;rnekleri i&amp;ccedil;erisinde dolaşılabilmesini sağlayacak geliştirmeyi kolayca yapmış olduk.&lt;em&gt;(Tabi bir versiyon daha geriye gidebilir ve IEnumerator aray&amp;uuml;z&amp;uuml;n&amp;uuml; kullanaraktanda bu işlemleri ger&amp;ccedil;ekleştirebiliriz, bunuda hatırlatayalım)&lt;/em&gt; &amp;Ouml;rnek kullanımı ise şu şekilde ger&amp;ccedil;ekleştirebiliriz;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;ProductList products2 = new ProductList();
products2[0] = new Product { ProductId = 1, Name = "330 ml Seramik Bardak", ListPrice = 12M };
products2[1] = new Product { ProductId = 2, Name = "1 Lt Cam Bardak", ListPrice = 12.5M };
products2[2] = new Product { ProductId = 3, Name = "50 cl Pet Şişe", ListPrice = 14.45M };

foreach (Product product in products2)
{
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Console.WriteLine(product.ToString());
}&lt;/pre&gt;
&lt;p&gt;Uzun uzun zaman &amp;ouml;nce, &lt;strong&gt;C# 2.0&lt;/strong&gt; ile birlikte gelen yenilikleri anlatırken &lt;strong&gt;yield&lt;/strong&gt; anahtar kelimesinide i&amp;ccedil;eriklere kattığımı gayet net hatırlıyorum. Aslında bu anahtar kelimenin, var olan &lt;strong&gt;Iterator&lt;/strong&gt; deseninin uygulanmasını dahada kolaylaştırdığı g&amp;uuml;n gibi ortada. Bir başka deyişle Iterator deseninin aslında .Net i&amp;ccedil;erisine g&amp;ouml;m&amp;uuml;l&amp;uuml; olduğunu s&amp;ouml;yleyebiliriz. Tabi kalıbı bizzat uygulamamış olsakta aslında&lt;strong&gt; IL(Intermediate Language)&lt;/strong&gt; tarafındaki kodlara bakıldığında &lt;strong&gt;Iterator&lt;/strong&gt; tasarım kalıbının izlerini g&amp;ouml;rmemiz m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f7%2fblg53_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir tasarım kalıbının daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f7%2fIteratorPattern.rar"&gt;IteratorPattern.rar (30,73 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-07-30 12:52:00</pubDate>
  <slug>Tasarc4b1m-Desenleri-Iterator</slug>
  <tags>
    <tag>design-patterns</tag>
    <tag>oop</tag>
    <tag>c#</tag>
  </tags>
  <categories>
    <category>Tasarım Kalıpları(Design Patterns)</category>
  </categories>
</post>