<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Visual Studio Code İçinde Unit Test Yazmak</title>
  <description>Bu yazımızda Visual Studio Code içerisinde Unit Test barındıran bir çözümün nasıl geliştirilebileceğini inceliyoruz. İdeal klasör yapısını oluşturuyor, MSTest çatısını kullanarak çok basit bir test vakasını işletmeye çalışıyoruz. Amaçlarımızdan birisi de Visual Studio Code arabirimi dışına çıkmadan proje iskeletini oluşturmak ve testleri kurgulayarak deneyimlemek.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/08/core_test_7.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde şirketimizin d&amp;uuml;zenlediği kişisel gelişim eğitimlerinden birisindeydim. Transaksiyonel Analiz'in konularından olan Ego &amp;uuml;zerine kişiliğimizin par&amp;ccedil;ası olan ve hayatımızı etkileyen i&amp;ccedil; karakterlerimizden bahsediliyordu. Yaklaşık &amp;uuml;&amp;ccedil; saatlik eğitimde hoş&amp;ccedil;a dakikalar ge&amp;ccedil;irdik ve epey değişik bilgiler &amp;ouml;ğrendik. &amp;Ouml;zellikle uzman psikoloğun yer yer kullandığı g&amp;ouml;rseller ve nokta atışı yapan karikat&amp;uuml;rler eğitimi &amp;ccedil;ok keyifli hale getirmeye yetmişti.&amp;nbsp;&amp;Uuml;stelik uygulamalı olarak yaptığımız testler ile i&amp;ccedil; benliğimizdeki karakterlerin hangi noktalarda olduğunu da g&amp;ouml;rd&amp;uuml;k. Eğitim&amp;nbsp;sonrası masama d&amp;ouml;nd&amp;uuml;m ve bir ka&amp;ccedil; g&amp;uuml;n &amp;ouml;nce başladığım ama iş yoğunluğu sebebiyle yarım kalan yazımın başına ge&amp;ccedil;tim. Derken eğitimde kullanılan&amp;nbsp;Yiğit &amp;Ouml;zg&amp;uuml;r imzalı nefis karikat&amp;uuml;r geldi aklıma. Okur i&amp;ccedil;in tebess&amp;uuml;m ettirici bir başlangı&amp;ccedil; olur diye d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m. Gelelim konumuza.&lt;/p&gt;
&lt;p&gt;Şirketimizdeki Framework geliştirme ekibi,&amp;nbsp;yazılan yeni nesil &amp;uuml;r&amp;uuml;nlerde Visual Studio yerine Visual Studio Code ile &amp;ccedil;alışmamızı &amp;ouml;nermekte. Bir mecburiyet olmamakla beraber kendi Sprint Review toplantılarında g&amp;ouml;sterdikleri her şey Visual Studio Code &amp;uuml;zerinden anlatılıyor. &amp;Ccedil;ok eski &amp;uuml;r&amp;uuml;nler i&amp;ccedil;in olmasa da&lt;em&gt;(15 yıllık monolitik haline gelmiş devasa bir ERP uygulaması mesela)&lt;/em&gt; yeni nesil&amp;nbsp;geliştirmeler&amp;nbsp;i&amp;ccedil;in &amp;ouml;zellikle tercih ettiklerini ifade edebilirim. Bu da Visual Studio Code ile daha fazla haşır neşir olmamız ve el yatkınlığımızı arttırmamız gerektiği anlamına geliyor.&lt;/p&gt;
&lt;p&gt;Ekibin bize verdiği y&amp;ouml;nergeleri takip ederek&amp;nbsp;uygulamalara ait .Net &amp;ccedil;&amp;ouml;z&amp;uuml;mlerini&amp;nbsp;kendi makinemde ayağa kaldırırken hem &amp;ouml;ğrendiğim hem de merak ettiğim şeyler oluyor. Pek &amp;ccedil;ok şeyi Code'un terminalinden hallediyoruz. &amp;Ouml;zellikle git ile yakın temastayız. Pek tabii bir &amp;ccedil;ok kullanışlı uzantıdan&lt;em&gt;(extensions)&lt;/em&gt; da yararlanıyoruz. Benim en son baktığım konu ise Unit Test'lerin yazılması &amp;uuml;zerineydi. Visual Studio Code'da bir .Net &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; i&amp;ccedil;in klas&amp;ouml;r yapısı nasıl kurgulanır, test projesi nasıl oluşturulur, hangi test k&amp;uuml;t&amp;uuml;phanesi&amp;nbsp;kullanılabilir vb...Sonunda Microsoft dok&amp;uuml;manlarını kurcalayarak bu işin en basit&lt;em&gt;(ve birazda ilkel)&lt;/em&gt; haliyle nasıl yapılabildiğini &amp;ouml;ğrendim. Bir ka&amp;ccedil; deneme sonra evdeki West-World'un başına ge&amp;ccedil;tim ve &amp;ouml;ğrendiklerimi uygulamaya koyuldum. Haydi başlayalım.&lt;/p&gt;
&lt;h1&gt;Solution Ağacının Oluşturulması&lt;/h1&gt;
&lt;p&gt;Amacımız bir k&amp;uuml;t&amp;uuml;phane &amp;ouml;zelinde test projesi ve bağıntılarının nasıl kurgulanabileceğini g&amp;ouml;rmek. Normalde Visual Studio gibi &amp;ccedil;ok gelişmiş arabirimlerde bu olduk&amp;ccedil;a kolay. Bir metoda sağ tıklayarak hızlı bir şekilde Unit Test projesini ve i&amp;ccedil;eriğini oluşturabilirsiniz. Peki ya Code tarafında! &amp;Ouml;ncelikle bir dizi komut ile &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;n klas&amp;ouml;r ağacını ve i&amp;ccedil;erisinde yer alacak projelerini oluşturacağız. Visual Studio Code terminalini kullanarak aşağıdaki komutları sırasıyla &amp;ccedil;alıştıralım.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;mkdir UnitTestSample
cd UnitTestSample
dotnet new sln
mkdir TextService
cd TextService
dotnet new classlib
cd ..
dotnet sln add TextService/TextService.csproj
mkdir TextService.Tests
cd TextService.Tests
dotnet new mstest
dotnet add reference ../TextService/TextService.csproj
cd ..
dotnet sln add TextService.Tests/TextService.Tests.csproj
cd TextService.Tests&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncelikle sistemimizde UnitTestSample isimli bir klas&amp;ouml;r oluşturduk ve i&amp;ccedil;erisine girerek yeni bir Solution &amp;uuml;rettirdik. Hemen ardından TextService isimli bir alt klas&amp;ouml;r daha oluşturduk. Bu klas&amp;ouml;r&amp;uuml;n i&amp;ccedil;erisine girip bu sefer de bir sınıf k&amp;uuml;t&amp;uuml;phanesi(Class Library) &amp;uuml;rettirdik. Testlerini yazacağımız ve asıl işi yapan fonksiyonelliklerimizi burada biriktirebiliriz. Sonrasında solution dosyasına hen&amp;uuml;z &amp;uuml;retilen TextService.csproj dosyasını ve dolayısıyla ilgili projeyi dahil ettik. Dolayısıyla ilgili sınıf k&amp;uuml;t&amp;uuml;phanesinin projesini &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;n bir par&amp;ccedil;ası haline getirdik. Birim testleri barındıracak olan TextService.Tests projesi i&amp;ccedil;in de benzer bir klas&amp;ouml;r yapısı s&amp;ouml;z konusu. Tek fark test projesini &amp;uuml;retmek i&amp;ccedil;in "dotnet new mstest" komutlarından yararlanmış olmamız. Buna g&amp;ouml;re MStest k&amp;uuml;t&amp;uuml;phanesini kullanan standart bir test projesi &amp;uuml;retiliyor. Pek tabii test projesi TextService k&amp;uuml;t&amp;uuml;phanesini kullanacağından proje referansını da eklememiz gerekiyor. Son adım olarak da TextService.Tests.csproj dosyasını Solution'a dahil ediyoruz. İşlemler bittiğinde kabaca aşağıdaki ağa&amp;ccedil; yapısını elde etmiş olmalıyız. TextService ve TextService.Tests aynı seviyede klas&amp;ouml;rlerdir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/08/core_test_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hemen şu notu da belirtelim; MSTest kullanmak zorunda değiliz. Pek &amp;ccedil;ok bağımsız test k&amp;uuml;t&amp;uuml;phanesi var. &amp;Ouml;rneğin Microsoft dok&amp;uuml;manlarına baktığımızda NUnit ve xUnit &amp;ouml;rneklerinin olduğunu da g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;h1&gt;Esas Sınıf&lt;/h1&gt;
&lt;p&gt;Şimdi TextService projesinde basit bir sınıf kullanalım. Stringer isimli &amp;ouml;rnek sınıf bir metin ile ilgili değişik işlemlere ev sahipliği yapacak(g&amp;uuml;ya) Bir fonksiyonu da metin i&amp;ccedil;erisinde belli bir karakterden ka&amp;ccedil; tane olduğunun hesaplanması. Sınıfın ilk halini aşağıdaki gibi tasarlayabiliriz. Şimdilik metoda ait bir implemantasyonumuz bulunmuyor. Yani kasıtlı olarak NotImplementedException fırlatan bir metodumuz var.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace TextService
{
    public class Stringer
    {
        public int FindCharCount(string content,char character){
            throw new NotImplementedException("Makine soğuk hen&amp;uuml;z :P");
        }
    }
}&lt;/pre&gt;
&lt;h1&gt;Test Sınıfı&lt;/h1&gt;
&lt;p&gt;Stringer sınıfının ilgili Test sınıfını da malumunuz TextService.Tests projesi altında yazmalıyız. StringerTest sınıfının&amp;nbsp;ilk hali de aşağıdaki gibi olsun.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Microsoft.VisualStudio.TestTools.UnitTesting;
using TextService;

namespace TextService.Tests
{
    [TestClass]
    public class StringerTest
    {
        private readonly Stringer _poo;
        public StringerTest()
        {
            _poo=new Stringer();
        }

        [TestMethod]
        public void Text_Should_Contain_1_S()
        {
            var result=_poo.FindCharCount("",'s');
            Assert.AreNotEqual(0,result);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;TestClass ve TestMethod nitelikleri ile bezenmiş standart bir Unit Test sınıfı.&amp;nbsp;Text_Should_Contain_1_S&amp;nbsp;isimli &amp;ouml;rnek test metodu, FindCharCount fonksiyonu i&amp;ccedil;in bir kabul kriterine sahip. Buna g&amp;ouml;re s karakterinden en az bir tane olmalı.&amp;nbsp;Testi &amp;ccedil;alıştırmak i&amp;ccedil;in test projesinin klas&amp;ouml;r&amp;uuml;nde olmamız ve aşağıdaki komutu vermemiz yeterli.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet test&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/08/core_test_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Revize&lt;/h1&gt;
&lt;div&gt;İlk test sonucu tahmin edileceği &amp;uuml;zere bir Exception ile sonlanmış durumda. O halde gelin FindCharCount&amp;nbsp;metodunu bir ka&amp;ccedil; vakayı karşılayabilecek şekilde tekrardan yazalım.&lt;/div&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Linq;

namespace TextService
{
    public class Stringer
    {
        public int FindCharCount(string content,char character){
            if(String.IsNullOrEmpty(content))
                throw new ArgumentNullException("Bir i&amp;ccedil;erik girilmeli");
            else{
                if(content.Length&amp;gt;10)
                    throw new ArgumentOutOfRangeException("&amp;Ccedil;ok uzun, kısalt biraz");
                else{
                    var count=0;
                    foreach(var c in content)
                    {
                        if(c==character)
                            count++;
                    }
                    return count;
                }
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu kez bir ka&amp;ccedil; durum oluşabilir gibi. Metnin boş gelmesi veya &amp;ouml;rneğin 10 karakterden fazla olması hallerinde fonksiyonumuz uygun bir Exception ile &amp;ccedil;ağıran tarafı cezalandırmakta. Ancak bu koşullar ger&amp;ccedil;ekleşmediyse bir karakter sayımı yapılmakta ve parametre olan gelen harften ka&amp;ccedil; tane olduğu bulunmakta. Şimdi yazabileceğimiz bir&amp;nbsp;ka&amp;ccedil; test metodu daha var. Test sınıfını aşağıdaki gibi değiştirerek devam edelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Microsoft.VisualStudio.TestTools.UnitTesting;
using System;

namespace TextService.Tests
{
    [TestClass]
    public class StringerTest
    {
        private readonly Stringer _poo;
        public StringerTest()
        {
            _poo=new Stringer();
        }

        [TestMethod]
        [ExpectedException(typeof(ArgumentNullException))]
        public void Text_Is_Null_Or_Empty_Should_Throw_Exception()
        {
            var result=_poo.FindCharCount("",'s');
            Assert.AreNotEqual(0,result);
        }

        [TestMethod]
        [ExpectedException(typeof(ArgumentOutOfRangeException))]
        public void Text_Length_Is_Too_Long_Should_Throw_Exception()
        {
            var result=_poo.FindCharCount("g&amp;uuml;zel g&amp;uuml;neşli bir g&amp;uuml;nden kalan.",'s');
            Assert.AreNotEqual(0,result);
        }

        [TestMethod]
        public void Text_Should_Contain_Any_S_Character()
        {
            var result=_poo.FindCharCount("pilav",'s');
            Assert.AreEqual(true,result&amp;gt;0);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Exception beklediğimiz iki test metodu var. Ayrıca bir de i&amp;ccedil;inde s karakteri&amp;nbsp;barındırmasını beklediğimiz&amp;nbsp;kabul kriterimiz. Exception beklediğimiz durumlar i&amp;ccedil;in bilin&amp;ccedil;li olarak ExpectedException niteliğini&lt;em&gt;(attribute)&lt;/em&gt; kullandık. Bu iki test başarılı &amp;ccedil;alışacaktır. Ancak "pilav" kelimesinde "s" karakteri olmadığından 1 test hatalı sonu&amp;ccedil;lanacaktır. Testi tekrar &amp;ccedil;alıştırdığımızda aşağıdaki sonu&amp;ccedil;ları elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/08/core_test_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında bakmamız gereken başka durumlar da var. &amp;Ouml;rneğin ger&amp;ccedil;ekten i&amp;ccedil;inde s harfi olan&amp;nbsp;bir metin i&amp;ccedil;in gerekli kabul kriterimizi de yazabiliriz. Bu şekilde değişken girdi parametreleri i&amp;ccedil;in ayrı ayrı test metodları yazmaktansa DataTestMethod ve DataRow nitelikleri yardımıyla&amp;nbsp;&amp;ccedil;ok sayıda farklı&amp;nbsp;girdiyi&amp;nbsp;kabul kriterlerine dahil edebiliriz. Nasıl mı? Aynen aşağıdaki gibi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Microsoft.VisualStudio.TestTools.UnitTesting;
using System;

namespace TextService.Tests
{
    [TestClass]
    public class StringerTest
    {
        private readonly Stringer _poo;
        public StringerTest()
        {
            _poo=new Stringer();
        }

        [TestMethod]
        [ExpectedException(typeof(ArgumentNullException))]
        public void Text_Is_Null_Or_Empty_Should_Throw_Exception()
        {
            var result=_poo.FindCharCount("",'s');
            Assert.AreNotEqual(0,result);
        }

        [TestMethod]
        [ExpectedException(typeof(ArgumentOutOfRangeException))]
        public void Text_Length_Is_Too_Long_Should_Throw_Exception()
        {
            var result=_poo.FindCharCount("g&amp;uuml;zel g&amp;uuml;neşli bir g&amp;uuml;nden kalan.",'s');
            Assert.AreNotEqual(0,result);
        }

        [DataTestMethod]
        [DataRow("password")]
        [DataRow("none")]
        [DataRow("sarı")]
        public void Text_Should_Contain_Any_S_Character(string text)
        {
            var result=_poo.FindCharCount(text,'s');
            Assert.AreEqual(true,result&amp;gt;0);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu sefer dikkat edileceği &amp;uuml;zere 3 değişik metin i&amp;ccedil;in aynı test metodunu &amp;ccedil;alıştırdık. Sadece DataRow niteliğinin aldığı değeri Test metodunda parametre olarak ele almamız yeterli. Şimdi testlerimizi tekrar &amp;ccedil;alıştırırsak aşağıdaki sonu&amp;ccedil;ları elde ettiğimizi g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/08/core_test_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere Visual Studio Code arabirimi dışına &amp;ccedil;ıkmadan MSTest k&amp;uuml;t&amp;uuml;phanesini&amp;nbsp;kullanarak birim testler i&amp;ccedil;eren &amp;ccedil;&amp;ouml;z&amp;uuml;mler &amp;uuml;retmemiz olduk&amp;ccedil;a basit ve kolay. Pek tabii g&amp;ouml;rsel olarak test sonu&amp;ccedil;larını g&amp;ouml;rebilmek de g&amp;uuml;zel olurdu. Visual Studio bu anlamda &amp;ccedil;ok fazla ve g&amp;uuml;zel imkan sunuyor. Ne var ki Visual Studio Code i&amp;ccedil;in de a&amp;ccedil;ık kaynak olarak geliştirilmiş bir &amp;ccedil;ok Test Explorer var. Bu arada "dotnet test" komutunun da gizemli parametreleri yok değil. &amp;Ouml;rneğin aşağıdaki komut ile Test sonu&amp;ccedil;larının bir XML dosyası i&amp;ccedil;erisine loglanmasını sağlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet test --logger trx&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;(Ben &amp;ouml;rnek deneme sonrasında TestResults klas&amp;ouml;r&amp;uuml; altında trx uzantılı bir log dosyası elde ettim)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/08/core_test_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ya da&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet test --list-tests&lt;/pre&gt;
&lt;p&gt;komutuyla var olan klas&amp;ouml;rde kullanılabilecek ne kadar test varsa terminal penceresine basabiliriz. Diğer komutları &amp;ouml;ğrenmek i&amp;ccedil;in ne yapmanız gerektiğinizi biliyorsunuz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet test --help&lt;/pre&gt;
&lt;p&gt;Bu yazımızda Test Driven Development odaklı yazılım geliştiren ekipler i&amp;ccedil;in Visual Studio Code tarafında basit&amp;ccedil;e nasıl ilerleyebileceğimizi g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z&amp;uuml; d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Hatta hali hazırda var olan projelerinizdeki test senaryoları i&amp;ccedil;in Code tarafında denemeler yaparak el alışkanlığı kazanabilirsiniz. Biliyorsunuz ki test edilmemiş kod kaliteden uzaklaşmamız ve teknik bor&amp;ccedil; bırakmamız i&amp;ccedil;in gerek ve yeter sebeplerden birisidir.B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2018-11-26 21:15:00</pubDate>
  <slug>Visual-Studio-Code-Icinde-Unit-Test-Yazmak</slug>
  <tags>
    <tag>unit-test</tag>
    <tag>mstest</tag>
    <tag>visual-studio-code</tag>
    <tag>testing</tag>
    <tag>net-core</tag>
    <tag>dotnet</tag>
    <tag>c#</tag>
    <tag>testmethod</tag>
    <tag>testclass</tag>
    <tag>datatestmethod</tag>
    <tag>datarow</tag>
    <tag>birim-test</tag>
    <tag>tdd</tag>
    <tag>test-driven-development</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
  </categories>
</post>