<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tek Fotoluk İpucu 134 - Powershell'den XML Web Service Çağırmak</title>
  <description>Olmaz olmaz demeyin, gün gelir ihtiyacınız olur :) Ortada bir XML Web Service olduğunu düşünelim ve onu çağırmak istediğimiz bir sunucunun başında oturduğumuzu. Sunucu üzerinde SOAP-UI gibi yardımcı araçların olmadığını ve bunları kurma yetkinizin de bulunmadığını düşünün. Öyle bir sunucu ki komut satırı en etkili araç. İşte böyle bir durumda Windows PowerShell gibi araçlar web servislerini çağırma noktasında işimize yarayabilir. Nasıl mı? Gelin bakalım.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Olmaz olmaz demeyin, g&amp;uuml;n gelir ihtiyacınız olur :) Ortada bir XML Web Service olduğunu d&amp;uuml;ş&amp;uuml;nelim ve onu &amp;ccedil;ağırmak istediğimiz bir sunucunun başında oturduğumuzu. Sunucu &amp;uuml;zerinde SOAP-UI gibi yardımcı ara&amp;ccedil;ların olmadığını ve bunları kurma yetkinizin de bulunmadığını d&amp;uuml;ş&amp;uuml;n&amp;uuml;n. &amp;Ouml;yle bir sunucu ki komut satırı en etkili ara&amp;ccedil;.&amp;nbsp;İşte b&amp;ouml;yle bir durumda Windows PowerShell gibi ara&amp;ccedil;lar web servislerini &amp;ccedil;ağırma noktasında&amp;nbsp;işimize yarayabilir. Nasıl mı? Gelin bakalım.&lt;/p&gt;
&lt;p&gt;Elimizde ASP.Net ortamında geliştirilmiş CalculationService.asmx isimli bir XML Web Service olduğunu ve i&amp;ccedil;erisinde Sum isimli basit bir toplama operasyonu bulunduğunu varsayalım &lt;em&gt;(Sum operasyonuna ait SOAP 1.1 temelli HTTP Post talebinin şablonu aşağıdakine benzerdir)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;POST /CalculationService.asmx HTTP/1.1
Host: localhost
Content-Type: text/xml; charset=utf-8
Content-Length: length
SOAPAction: "http://www.buraksenyurt.com/servicebag/Sum"

&amp;lt;?xml version="1.0" encoding="utf-8"?&amp;gt;
&amp;lt;soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"&amp;gt;
  &amp;lt;soap:Body&amp;gt;
    &amp;lt;Sum xmlns="http://www.buraksenyurt.com/servicebag/"&amp;gt;
      &amp;lt;x&amp;gt;double&amp;lt;/x&amp;gt;
      &amp;lt;y&amp;gt;double&amp;lt;/y&amp;gt;
    &amp;lt;/Sum&amp;gt;
  &amp;lt;/soap:Body&amp;gt;
&amp;lt;/soap:Envelope&amp;gt;&lt;/pre&gt;
&lt;p&gt;PowerShell'de bu tip SOAP tabanlı servisleri Proxy sınıfı tanımlayarak &amp;ccedil;ağırabilir ve operasyonlarını test edebiliriz. Bunun i&amp;ccedil;in New-WebServiceProxy komutundan yararlanıyoruz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/10/TFI_134.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;$URI değişkeni&amp;nbsp;&amp;ccedil;ağırmak istediğimiz web servisine ait WSDL(Web Service Description Language) adresini taşıyor. Sonrasında $proxy değişkenine New-WebServiceProxy tipi ile &amp;uuml;rettiğimiz proxy nesnesini atıyoruz. Powershell tarafında kullanacağımız namespace ve class adlarını belirtiyoruz. Sonrasında $proxy değişkeni &amp;uuml;zerinden web servis operasyonlarını &amp;ccedil;ağırabiliriz. Servise ait diğer operasyonları g&amp;ouml;rmek isterseniz aşağıdaki komutu da kullanabilirsiniz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;$proxy | Get-Member -MemberType method&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi sanki .Net ortamında bir istemci kodundaymışız gibi ilgili servisi &amp;ccedil;ağırabildik. Ancak &amp;ccedil;ok daha karmaşık senaryolar olduğunu da ifade edebiliriz. &amp;Ouml;rneğin servis operasyonları primitive tipler yerine complex tipler ile &amp;ccedil;alışıyor olabilir. &amp;Ouml;rneğin kategori bazlı &amp;uuml;r&amp;uuml;n listesini d&amp;ouml;nd&amp;uuml;ren bir servis operasyonunu Windows PowerShell &amp;uuml;zerinden &amp;ccedil;ağırmayı deneyebilirsiniz. Bunu nasıl yapabileceğinizi araştırmanızı &amp;ouml;neririm.&lt;/p&gt;
&lt;p&gt;Bir başka ipucunda g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-10-06 21:10:00</pubDate>
  <slug>tek-fotoluk-ipucu-134-powershell-den-soap-based-web-service-cagirmak</slug>
  <tags>
    <tag>powershell</tag>
    <tag>xml-web-service</tag>
    <tag>soap</tag>
    <tag>proxy</tag>
    <tag>http-post</tag>
    <tag>soap-based-web-service</tag>
    <tag>command-prompt</tag>
    <tag>c#</tag>
  </tags>
  <categories>
    <category>Powershell</category>
  </categories>
</post>