<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Constructor Initializers (Yapıcı Metod Başlatıcıları) Deyip Geçmeyin</title>
  <description>Yapıcı metodlar nesne yönelimli programlamada çok büyük öneme sahiptir. Uygulamada oluşturduğumuz her bir nesnenin en az bir yapıcı metodu (ki bu varsayılan yapıcı metodtur) vardır. Kuşkusuz ki yapıcı metodlar (constructors), bir nesne örneğinin kapsüllediği verilere başlangıç değerlerinin atanabileceği en elverişli elemanlardır.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Yapıcı metodlar nesne y&amp;ouml;nelimli programlamada &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k &amp;ouml;neme sahiptir. Uygulamada oluşturduğumuz her bir nesnenin en az bir yapıcı metodu (ki bu varsayılan yapıcı metodtur) vardır. Kuşkusuz ki yapıcı metodlar (constructors), bir nesne &amp;ouml;rneğinin kaps&amp;uuml;llediği verilere başlangı&amp;ccedil; değerlerinin atanabileceği en elverişli elemanlardır.&lt;/p&gt;
&lt;table id="table15" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Yapıcıları, nesneleri başlangı&amp;ccedil; konumlarına getirmek, bir başka deyişle nesne ilk oluşturulduğunda sahip olması gereken değerleri belirlemek amacıyla kullanırız.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Uygulamalarımızda &amp;ccedil;oğunlukla yapıcı metodların aşırı y&amp;uuml;klenmiş versiyonlarına ihtiya&amp;ccedil; duyarız. Bu gereksinim genellikle, bir nesnenin verilerinin parametrik olarak birden fazla şekilde başlatılabileceği durumlarda oluşmaktadır. &amp;Ouml;rneğin veri işlemlerini &amp;uuml;stlenen bir sınıfın yapıcı metodunda bu işlemler i&amp;ccedil;in temel teşkil edecek bir bağlantı (connection) nesnesini oluşturmaya &amp;ccedil;alıştığımızı d&amp;uuml;ş&amp;uuml;nelim. En az iki versiyon kullanabiliriz. Bağlantı c&amp;uuml;mleciğinin (Connection string) parametrik olarak yapıcı metoda ge&amp;ccedil;irildiği bir versiyon ve varsayılan bağlantı c&amp;uuml;mleciğinin kullanılacağı başka bir versiyon. Elbetteki aşırı y&amp;uuml;klenmiş yapıcı metod versiyonlarını daha da &amp;ccedil;oğaltabiliriz. Lakin burada dikkate değer bir durum vardır. O da aşırı y&amp;uuml;klenmiş yapıcı metodların i&amp;ccedil;erideki değerlere atamaları nasıl yapacağıdır. Genellikle burada iki tip versiyon kullanılır. Acem programcıların ilk zamanlarda en &amp;ccedil;ok kullandığı teknik başlangı&amp;ccedil; değer atamalarının her bir yapıcı metod i&amp;ccedil;erisinde ayrı ayrı yapıldığı durumu kapsar. Diğer teknik ise this anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; kullanılarak uygulanır ve değer atamaları merkezi bir yapıcı metod i&amp;ccedil;erisine y&amp;ouml;nlendirilir.&lt;/p&gt;
&lt;p&gt;Bu versiyonları daha iyi kavrayabilmek amacıyla basit bir &amp;ouml;rnek &amp;uuml;zerinde tartışacağız. Farzedelim ki Dortgenleri temsil edecek tipte bir sınıf tasarlıyoruz. D&amp;ouml;rtgen tipinden nesneleri temsil edecek bu sınıfın en azından en ve boy gibi iki değeri kaps&amp;uuml;lleyeceği aşikardır. Peki d&amp;ouml;rtgen sınıfına ait nesne &amp;ouml;rnekleri ka&amp;ccedil; şekilde başlatılabilir? Başka bir deyişle bir Dortgen nesnesi oluşturulduğunda, en ve boy değişkenlerinin değerleri ka&amp;ccedil; şekilde belirlenebilir? Bu soruya cevap ararken Dortgen sınıfımızı aşağıdaki gibi tasarlayalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk138_1.gif" alt="" width="273" height="200" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sınıfımızın kodlarına gelince;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class Dortgen
{
    private int m_AKenari;
    private int m_BKenari;

    public Dortgen() // Varsayılan yapıcı (default constructor)
    {
        m_AKenari=1;
        m_BKenari=1;
    }
    public Dortgen(int akenari) // Kare olma durumu
    {
        m_AKenari=akenari;
        m_BKenari=akenari;
    }
    public Dortgen(int akenari,int bkenari) // dikd&amp;ouml;rtgen olma durumu
    {
        m_AKenari=akenari;
        m_BKenari=bkenari;
    }
    public double Alan()
    {
        return m_AKenari*m_BKenari;
    }
}&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi son derece basit bir tasarımımız var. Her bir yapıcı metod i&amp;ccedil;erisinde, Dortgen sınıfının kaps&amp;uuml;llediği a ve b kenarlarına ait değerlere atamalar yapıyoruz. Bu daha &amp;ouml;nceden de vurguladığımız gibi uygulamalarımızda sık&amp;ccedil;a kullandığımız bir tekniktir. Aslında durumu biraz daha derinden incelemekte fayda var. Hemen ILDASM aracı yardımıyla, bu sınıfı kullandığımız her hangibir uygulamanın intermediate language (ara dil) kodlarına bakalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk138_2.gif" alt="" width="635" height="635" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Uuml;&amp;ccedil; yapıcı metodumuzda kendi i&amp;ccedil;lerinde ojbect tipinden bir nesne &amp;ouml;rneğini oluşturmaktadır. Aslında bu en tepedeki sınıf olan Object sınıfının yapıcı metoduna bir &amp;ccedil;ağrıdır. Bu başka bir a&amp;ccedil;ıdan bakıldığında, Framework i&amp;ccedil;erisinde yer alan nesne hiyerarşisinin ve kalıtımın (inheritance) bir sonucudur. &amp;Ouml;yleki, .net b&amp;uuml;nyesinde yer alan her nesne mutlaka en tepede yer alan Object sınıfından t&amp;uuml;reyerek gelmektedir.&lt;/p&gt;
&lt;table id="table12" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Bir yapıcı metodun IL kodu i&amp;ccedil;erisinde, t&amp;uuml;rediği temel sınıfa ait varsayılan yapıcı metodu &amp;ccedil;ağırıyor olması, kalıtım (inheritance) i&amp;ccedil;in &amp;ouml;nemli bir fakt&amp;ouml;rd&amp;uuml;r. Bir t&amp;uuml;reyen sınıf nesne &amp;ouml;rneği oluşturulduğunda, i&amp;ccedil;erideki kaps&amp;uuml;llenmiş tiplere ilgili değerler atanmadan daha &amp;ouml;nce, temel sınıfın yapıcısı (default constructor) &amp;ccedil;ağırılır. Bu mekanizma, t&amp;uuml;reyen sınıfa ait nesne &amp;ouml;rneği oluşturulurken, base anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; yardımıyla ortak değişkenlere ait değerlerin temel sınıfa(lara) kolayca aktarılabilmelerini sağlar.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Buradaki kodlama aslında yapıcı metod başlatıcıları (constructor initializers) kullanılarak daha sade ve merkezileştirilmiş bir hale getirilebilir. Merkezileştirilmeden kasıt, atamaların tek bir yerde toplanmasıdır. Bunun en b&amp;uuml;y&amp;uuml;k faydası kodun bakımı ve onarımı sırasında ortaya &amp;ccedil;ıkar. Sonu&amp;ccedil; itibariyle yapıcı metodlarımızın ortak noktası, gelen parametreleri aynı şekilde atamaya &amp;ccedil;alışmalarıdır. Dolayısıyla Dortgen sınıfını this anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml; de kullanarak aşağıdaki gibi de geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class Dortgen_ // :Dortgen_Taban
{
    private int m_AKenari;
    private int m_BKenari;

    public Dortgen_():this(1,1)
    { 
    }
    public Dortgen_(int akenari):this(akenari,akenari)
    {
    }
    public Dortgen_(int akenari,int bkenari)
    {
        m_AKenari=akenari;
        m_BKenari=bkenari;
    }
    public double Alan()
    {
        return m_AKenari*m_BKenari;
    }
}&lt;/pre&gt;
&lt;p&gt;Bu sefer Dortgen sınıfının her bir yapıcı metodu aslında en genel yapıcı metodu &amp;ccedil;ağırıp, this anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; yardımıyla ortamdan gelen parametreleri tek bir noktaya aktarmaktadır. Bu teknik kod okunurluğunu daha da kolaylaştırır. Ayrıca, değer atamalarının bakımını olumlu y&amp;ouml;nde etkiler. &amp;Ccedil;&amp;uuml;nk&amp;uuml; her hangibir değişiklik i&amp;ccedil;in t&amp;uuml;m yapıcı metodları gezmektense, sadece atamaların yapıldığı asıl yapıcı metodu değiştirmek &amp;ccedil;ok daha akılcı bir yoldur. Ancak her iki uygulama tekniği arasındaki farklar bunlar ile sınırlı değildir. Asıl farkı g&amp;ouml;rebilmek i&amp;ccedil;in yine IL kodlarına bakmamız gerekir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk138_3.gif" alt="" width="633" height="608" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi bu sefer Object sınıfına ait varsayılan yapıcı metod sadece this anahtar s&amp;ouml;zc&amp;uuml;kleri ile parametreleri y&amp;ouml;nlendirdiğimiz merkezi yapıcı metod i&amp;ccedil;erisinden &amp;ccedil;ağırılmaktadır. Bu kodun i&amp;ccedil;erisinde &amp;ccedil;alışma zamanında object nesneleri i&amp;ccedil;in tahsis edilecek bellek miktarını biraz da olsa azaltan bir fakt&amp;ouml;rd&amp;uuml;r. Tabi durumu bir de hız a&amp;ccedil;ısından incelemek gerekir. Her iki teknik uygulanabilirlik, merkezileştirme, idareli bellek kullanımı a&amp;ccedil;ısından olduk&amp;ccedil;a farklıdır aslında. Ama aşağıdaki &amp;ouml;rnek kodu uyguladığımızda &amp;ccedil;ok daha farklı bir sonucu elde edeceğimizi g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class TestUygulama
{
    static void Main(string[] args)
    {
        DateTime dtSimdi;
        TimeSpan fark;

        #region birinci tip constructor kullanımı (initializers ile)

        dtSimdi=DateTime.Now;
        for(int i=1;i&amp;lt;500000;i++)
        {
            Dortgen_ d1=new Dortgen_();
               d1.Alan();
        }
        fark=DateTime.Now-dtSimdi;
        Console.WriteLine("Birinci tip constructor kullanımı {0} (Initializers ile)",fark.TotalMilliseconds.ToString());
    
        #endregion

        #region ikinci tip constructor kullanımı

        dtSimdi=DateTime.Now;
        for(int i=1;i&amp;lt;500000;i++)
        {
            Dortgen d2=new Dortgen();
            d2.Alan();
        }
        fark=DateTime.Now-dtSimdi;
        Console.WriteLine("İkinci tip constructor kullanımı {0} ",fark.TotalMilliseconds.ToString());
    
        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;Buradaki ilk d&amp;ouml;ng&amp;uuml;m&amp;uuml;z, yapıcı başlatıcıları (constructor initializers) kullanan Dortgen_ nesnesine ait 500000 nesne &amp;ouml;rneğini oluşturur ve alan hesabı yapar. İkinci d&amp;ouml;ng&amp;uuml;m&amp;uuml;z ise, her bir değer atamasının kendi yapıcı metodu i&amp;ccedil;erisinde yapıldığı ilk tekniğimizi kullanır. Uygulamayı test ettiğimizde her iki d&amp;ouml;ng&amp;uuml;n&amp;uuml;n tamamlanma s&amp;uuml;releri arasında belirgin bir fark vardır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk138_4.gif" alt="" width="540" height="95" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sanılanın aksine this kullanılan teknik, diğerine g&amp;ouml;re daha yavaş &amp;ccedil;alışmaktadır. Bu elbetteki g&amp;ouml;z ardı edilebilecek bir s&amp;uuml;re farkıdır. Alternatif bir y&amp;ouml;ntem olarak değer atamlarının yapıldığı ortak bir metod, her bir constructor i&amp;ccedil;inden ayrı ayrı &amp;ccedil;ağırılabilir. Yani aşağıdaki Dortgen_2 sınıfının kodlarında olduğu gibi.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Dortgen_2
{
    private int m_AKenari;
    private int m_BKenari;

    public Dortgen_2()
    {    
        Atama(1,1);
    }
    public Dortgen_2(int akenari)
    {
        Atama(akenari,akenari);
    }
    public Dortgen_2(int akenari,int bkenari)
    {
        Atama(akenari,bkenari);
    }
    public double Alan()
    {
        return m_AKenari*m_BKenari;
    }
    private void Atama(int akenari,int bkenari)
    {
        m_AKenari=akenari;
        m_BKenari=bkenari;
    }
}&lt;/pre&gt;
&lt;p&gt;Burada atama işlemleri sadece bu sınıf i&amp;ccedil;erisinden erişilebilen (private) bir metod ile sağlanmaktadır. Bu merkezileştirmeyi ve bakımın kolaylaştırılabilmesini sağlar. Ancak this kullanımı terk edildiği i&amp;ccedil;in IL kodunda yine her bir yapıcı metod i&amp;ccedil;erisinde, Object sınıfına ait varsayılan yapıcı metodun &amp;ccedil;ağırılması durumu devam etmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk138_5.gif" alt="" width="628" height="634" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Elbette bu şartlar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında se&amp;ccedil;im yapmak zorlaşmaktadır. Hangisi olursa olsun &amp;ccedil;alışacaktır. Ancak ben performans a&amp;ccedil;ısından kayba neden olsa da, merkezileştirme, bakım ve onarım kolaylığı sağladığı d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde yapıcı başlatıcılarını (constructor initializers) kullanmayı tercih ediyorum. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2005-10-03 09:00:00</pubDate>
  <slug>Constructor-Initializers-(Yapıcı-Metod-Başlatıcıları)-Deyip-Geçmeyin-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>constructor</tag>
    <tag>oop</tag>
    <tag>class</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>