<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Bu Yaz Macerasının Adı Python</title>
  <description>Kısa bir süre önce bu yaz dönemi için kendime yeni bir uğraşı buldum. Raspberry Pi. Çalıştığım turuncu bankadaki ekip arkadaşım sevgili Recep Duman'ın, Raspberry Pi ile epey zamandır uğraştığını da öğrenince planlar yapılmaya başlandı.Lego, IoT ve Raspberry Pi konularını bir araya getireceğimiz bir fikir üzerinde ilerlemeye karar verdik. Bunun için gerekli çalışmalarımıza devam ediyoruz. Hatta Recep Hocam ile gerçekleştirdiğimiz iki söyleşimize buradan ve şuradan ulaşabilirsiniz.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2016/Guido_van_Rossum.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Kısa bir s&amp;uuml;re &amp;ouml;nce bu yaz d&amp;ouml;nemi i&amp;ccedil;in kendime yeni bir uğraşı buldum. &lt;strong&gt;Raspberry Pi&lt;/strong&gt;. &amp;Ccedil;alıştığım turuncu bankadaki ekip arkadaşım sevgili &lt;a href="http://www.recepduman.net/" target="_blank"&gt;Recep Duman&lt;/a&gt;'ın, &lt;strong&gt;Raspberry Pi&lt;/strong&gt; ile epey zamandır uğraştığını da &amp;ouml;ğrenince planlar yapılmaya başlandı.&lt;strong&gt;Lego&lt;/strong&gt;, &lt;strong&gt;IoT&lt;/strong&gt; ve&lt;strong&gt; Raspberry Pi&lt;/strong&gt; konularını bir araya getireceğimiz bir fikir &amp;uuml;zerinde ilerlemeye karar verdik. Bunun i&amp;ccedil;in gerekli &amp;ccedil;alışmalarımıza devam ediyoruz. Hatta Recep Hocam ile ger&amp;ccedil;ekleştirdiğimiz iki s&amp;ouml;yleşimize&amp;nbsp;&lt;a href="https://youtu.be/LfTrBhXo8vk" target="_blank"&gt;buradan&lt;/a&gt; ve &lt;a href="https://youtu.be/h3xfi1-SmQc" target="_blank"&gt;şuradan&lt;/a&gt; ulaşabilirsiniz.&lt;/p&gt;
&lt;p&gt;Raspberry Pi kredi kartı b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;nde de olsa sonu&amp;ccedil;ta bir bilgisayar olduğundan, onu y&amp;ouml;netebilmek i&amp;ccedil;in de programlama dillerinden yararlanmak gerekiyor. Raspi &amp;uuml;zerinde &lt;strong&gt;Java&lt;/strong&gt;, &lt;strong&gt;Scratch&lt;em&gt;(Scratch'i MIT'den bilirsiniz)&lt;/em&gt;&lt;/strong&gt;, &lt;strong&gt;Ruby&lt;/strong&gt; ve &lt;strong&gt;Python&lt;/strong&gt; gibi dilleri kullanarak&amp;nbsp;geliştirme yapmak ve donanıma bağlanan cihazları y&amp;ouml;netebilmek m&amp;uuml;mk&amp;uuml;n. Pek tabii &lt;strong&gt;Windows IoT&lt;/strong&gt; a&amp;ccedil;ısından olaya baktığımızda &lt;strong&gt;C#&lt;/strong&gt; dilini de kullanabiliriz. Ben &lt;strong&gt;Ruby&lt;/strong&gt; ile ilerlemeyi d&amp;uuml;ş&amp;uuml;n&amp;uuml;yordum ancak hazır yeri gelmişken &lt;strong&gt;Python&lt;/strong&gt; programlama dilini odağıma almaya karar verdim.&amp;nbsp;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Raspberry Pi &amp;uuml;zerine varsayılan olarak y&amp;uuml;klenen Raspbian işletim sistemi Java, Python, Ruby, Scratch gibi diller i&amp;ccedil;in gerekli platform desteği ile birlikte geliyor. Dolayısıyla IDE'leri de hazır. Hatta Python i&amp;ccedil;in 2 ve 3 s&amp;uuml;r&amp;uuml;mlerinin ayrı ayrı kullanılabildiğini s&amp;ouml;yleyelim.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;Python&lt;/strong&gt;'u pek tabii Raspberry Pi &amp;uuml;zerinde &amp;ccedil;alışmaya başladım. Bu anlamda &amp;ouml;zellikle &lt;a href="https://www.raspberrypi.org/resources/learn/" target="_blank"&gt;Raspberry Pi Foundation&lt;/a&gt;'ın ilgili sitesi sunduğu &amp;ouml;rnekler a&amp;ccedil;ısından bana b&amp;uuml;y&amp;uuml;k kolaylık sağladı. Hatta ilk hevesle Twithyon API'sini kullnarak Tweet atmayı denedim. Bu&amp;nbsp;kaynağa&amp;nbsp;ek olarak&amp;nbsp;&lt;a href="http://pythonprogramminglanguage.com/"&gt;http://pythonprogramminglanguage.com/&lt;/a&gt;&amp;nbsp;adresinden de yararlanmaya başladığımı ifade edebilirim. Dilin temel &amp;ouml;zelliklerini hızlı bir şekilde &amp;ouml;ğrenebileceğiniz g&amp;uuml;zel bir kaynak.&lt;/p&gt;
&lt;p&gt;Evde &amp;ccedil;alışmak olduk&amp;ccedil;a kolay nitekim &lt;strong&gt;Raspberry Pi&lt;/strong&gt;'mi &amp;ccedil;alışma masam &amp;uuml;zerinde kurduğum yapıda rahat&amp;ccedil;a kullanabiliyorum. Ne varki Raspim hen&amp;uuml;z derli toplu bir bilgisayar değil. T&amp;uuml;m &amp;ccedil;evre &amp;uuml;niteleri dağınık durumda. &amp;Uuml;stelik masanın &amp;uuml;zerinde bir s&amp;uuml;r&amp;uuml; kablo var. HDMI kablosu, her yeri &amp;ccedil;ıplak olan 7" dokunmatik ekran, ısı sens&amp;ouml;r&amp;uuml;, 40 Pin GPIO tesisatı, klavye, mouse vs.. Bu donanımları s&amp;uuml;rekli şirkete taşımak ve m&amp;uuml;sait vakitlerde &amp;ccedil;alışmak &amp;ccedil;ok da kolay değil. Bu y&amp;uuml;zden ben de online olarak kodları deneyebileceğim bir platform aradım. En azından dilin belli karakteristik &amp;ouml;zelliklerini inceleyebileceğim bir ortam yeterli olacaktı. Sonunda &lt;a href="https://repl.it" target="_blank"&gt;repl.it isimli siteyi&lt;/a&gt; buldum. Dolayısıyla &amp;ouml;ğle araları veya mesai saatleri dışındaki vakitlerimi&lt;em&gt;(bazen de &amp;ccedil;aktırmadan mesai saatleri i&amp;ccedil;indeki)&lt;/em&gt; değerlendirebileceğim ortamlar &amp;uuml;&amp;ccedil; aşağı beş yukarı hazırdı.&lt;/p&gt;
&lt;h2&gt;Python' un Karakteristik &amp;Ouml;zellikleri&lt;/h2&gt;
&lt;p&gt;Gelelim yeni g&amp;ouml;zdem &lt;strong&gt;Python&lt;/strong&gt; dilinin temel &amp;ouml;zelliklerine. Hollandalı &lt;a href="https://tr.wikipedia.org/wiki/Guido_van_Rossum" target="_blank"&gt;Guido Vann Rossum&lt;/a&gt;&amp;nbsp;tarafından ilk s&amp;uuml;r&amp;uuml;m&amp;uuml; &lt;strong&gt;1991&lt;/strong&gt; yılında yayınlanan &lt;strong&gt;Python&lt;/strong&gt;, yorumlamalı&lt;em&gt;(Interpretter destekli)&lt;/em&gt;, nesne y&amp;ouml;nelimli&lt;em&gt;(Object Oriented)&lt;/em&gt;, dinamik ve g&amp;uuml;&amp;ccedil;l&amp;uuml; tip sistemine sahip, fonksiyonel bir dil olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. &lt;strong&gt;Ruby&lt;/strong&gt; ile pek &amp;ccedil;ok benzerliği bulunmakta. Yorumlamalı bir dil olduğu i&amp;ccedil;in terminal ekranı &amp;uuml;zerinden scriptleri yazılabilir&amp;nbsp;ve sonu&amp;ccedil;larını hemen o anda g&amp;ouml;rebiliriz. Diğer yandan nesne y&amp;ouml;nelimli bir dil olduğundan&lt;strong&gt; Domain Driven Design&lt;/strong&gt; gibi konseptlere hizmet edecek şekilde b&amp;uuml;y&amp;uuml;k &amp;ccedil;aplı projelerde de kullanabiliriz. Aslında Raspbi ve IoT s&amp;ouml;z konusu olduğunda&amp;nbsp;Python'u kullanarak yapabileceklerimizin hayal g&amp;uuml;c&amp;uuml;m&amp;uuml;z ile sınırlı olduğunu s&amp;ouml;yleyebiliriz.&lt;/p&gt;
&lt;p&gt;Python Yazılım Vakfınca desteklenen a&amp;ccedil;ık kaynak kodlu olan bu&amp;nbsp;dil &lt;strong&gt;Google&lt;/strong&gt;, &lt;strong&gt;Youtube&lt;/strong&gt;, &lt;strong&gt;Facebook&lt;/strong&gt;, &lt;strong&gt;Bittorrent&lt;/strong&gt;, &lt;strong&gt;NASA&lt;/strong&gt;, &lt;strong&gt;CERN&lt;/strong&gt;, &lt;strong&gt;OpenOffice&lt;/strong&gt; gibi kulvarlarda yaygın şekilde kullanılmakta. &lt;strong&gt;Pardus&lt;/strong&gt;'un &amp;ccedil;ekirdeği değil ama &amp;uuml;zerine konuşlandırılan uygulamalar &lt;strong&gt;Python&lt;/strong&gt; ile yazılmış &amp;ouml;rneğin. Hatta &lt;strong&gt;Python&lt;/strong&gt;'dan yararlanılarak geliştirilen &amp;ccedil;eşitli &lt;strong&gt;betik&lt;em&gt;(script)&lt;/em&gt;&lt;/strong&gt; diller de s&amp;ouml;z konusu. Python esasen &lt;strong&gt;ABC&lt;/strong&gt;, &lt;strong&gt;ALGOL&lt;/strong&gt; &lt;strong&gt;68&lt;/strong&gt;, &lt;strong&gt;C&lt;/strong&gt;, &lt;strong&gt;Haskell&lt;/strong&gt;, &lt;strong&gt;Icon&lt;/strong&gt;, &lt;strong&gt;Java&lt;/strong&gt;, &lt;strong&gt;Lisp&lt;/strong&gt;, &lt;strong&gt;Modula-3&lt;/strong&gt;, &lt;strong&gt;Perl&lt;/strong&gt; gibi dillerden esinlenerek geliştirlmiş ve&amp;nbsp;&lt;strong&gt;Boo&lt;/strong&gt;, &lt;strong&gt;Cobra&lt;/strong&gt;, &lt;strong&gt;D&lt;/strong&gt;, &lt;strong&gt;Falcon&lt;/strong&gt;, &lt;strong&gt;Groovy&lt;/strong&gt;, &lt;strong&gt;Ruby&lt;/strong&gt;, &lt;strong&gt;JavaScript&lt;/strong&gt;, &lt;strong&gt;Comfy&lt;/strong&gt; gibi dilleri etkilemiş. Dolayısıyla olduk&amp;ccedil;a pop&amp;uuml;ler bir programlama dili. Dilin benim i&amp;ccedil;in en ilgin&amp;ccedil; &amp;ouml;zelliği ise blok ifadelerinde &lt;strong&gt;indentation&lt;em&gt;(girintileme)&lt;/em&gt;&lt;/strong&gt; kurallarına sahip olması. Yani bir metoda ait kod bloğunda tab veya space' lerin bir anlamı var. Hatta while, for d&amp;ouml;ng&amp;uuml;lerinde, if koşullarında da durum b&amp;ouml;yle. Ne demek istediğimi kodları incelerken g&amp;ouml;receğiz.&lt;/p&gt;
&lt;h2&gt;İlk Kodlar&lt;/h2&gt;
&lt;p&gt;İnsan daha &amp;ouml;nceden bir ka&amp;ccedil; farklı platform ve programlama dili ile uğraşınca yeni bir dil &amp;ouml;ğrenmesi de kolay olabiliyor. Ben de bu nedenle ilk etapta biraz dağınık ve karmaşık bir giriş yapmış bulunuyorum. Birazdan denediğim derme &amp;ccedil;atma kodları sizlerle paylaşacağım. Tam bir d&amp;uuml;zen olmadığı i&amp;ccedil;in l&amp;uuml;tfen beni affedin.&lt;/p&gt;
&lt;p&gt;Kodları yazmaya başladığımda karşılaştığım ilk sorun aşağıya doğru uzayıp giden uzun satırlardı. Ne kadar &amp;ccedil;ok şey denemek istiyorsam &lt;strong&gt;main.py&lt;/strong&gt; isimli dosyayı şişirmekteydi. Bu nedenle &lt;strong&gt;main.py&lt;/strong&gt; dışında diğer &amp;ouml;ğrendiğim kavramları ayrı bir dosyada&amp;nbsp;metodlaştırarak tutmaya karar verdim. Bu vesile ile pek &amp;ccedil;ok şey de &amp;ouml;ğrenme fırsatım oldu.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Python programlama dilinde dosya uzantıları py şeklindedir. Ayrıca main.py aynen .Net tarafındaki main metodu gibi uygulamanın başladığı kod par&amp;ccedil;ası olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&amp;nbsp;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;SomeFunctions.py&lt;/strong&gt; isimli bir dosya oluşturdum. Bu dosyanın kod i&amp;ccedil;eriği ise aşağıdaki gibi.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;import math

def get_players():
	players=[
		("burki",1000,True,"1234-PLY"),
		("turp",9003,False,-1,"gold player","4445-PLY"),
		("joiy",1004,True,-10,"silver player")
		]
	return players
	
def get_language(key):
	languages={
		"EN":"English",
			"FR":"France",
			"GE":"German",
			"TR":"Turkish",
			"US":"Unitad State English"
		}
	return languages[key]

def pythagoras(a,b):
	value=math.sqrt(a*a+b*b)
	return value

#lucky number game
def lucky_number_game():
	lucky_num=0
	while lucky_num!=7:
		lucky_num=int(input("Guess a number:"))
	
		if lucky_num!=7:
			print("Too bad,Sorry")
		
	print("Vuhuu")

def greetings():
	print("hello python\'s world")
	print("My name is\nBurak Selim Senyurt\n")
	name=input("so...What\'s your name?")
	print("Wellcome %s" %name)
	age=int(input("How old are you?"))
	print("Your age is %s" %age)

def a_little_bit_for_loops():
	minValue=int(input("Please insert a minimum value"))
	maxValue=int(input("Please insert a maximum value"))

	for n in range(minValue,maxValue+1):
		print(n)

	for i in range(0,5):
		for j in range(0,5):
			print(i,' ',j)
			
def give_me_a_nickname():
	yourNickName="none"
	while len(yourNickName)&amp;lt;5 or len(yourNickName)&amp;gt;10:
		yourNickName=str(input("Please select a nickname"))
		if len(yourNickName)&amp;lt;5:
			print("Your nickname too short")
		elif len(yourNickName)&amp;gt;10:
			print("Your nickname too long")

	print("Your nick name '%s' is cool now" %yourNickName)
	
def using_list():
	some_numbers=[1,3,4,2,6,7,2,2,9,12,14,10,5]
	return some_numbers&lt;/pre&gt;
&lt;p&gt;Biraz karışık duruyorlar değil mi? Korkmayın. Hepsi &amp;uuml;zerinden dikkatlice ge&amp;ccedil;eceğiz.&amp;nbsp;&lt;/p&gt;
&lt;h2&gt;Metodlar&lt;/h2&gt;
&lt;p&gt;&amp;Ouml;ncelikle bu dosya i&amp;ccedil;erisinde sadece metod tanımlamaları olduğunu belirtelim. metodlarda &lt;strong&gt;void&lt;/strong&gt;, &lt;strong&gt;int,double,bool&lt;/strong&gt;&amp;nbsp;gibi geri d&amp;ouml;n&amp;uuml;ş tipini belirten hi&amp;ccedil; bir ifade olmadığı dikkatinizi &amp;ccedil;ekmiştir. Ancak bu, metodların geriye bir şey d&amp;ouml;nd&amp;uuml;rmediği anlamına da gelmemlidir. Nitekim kod bloğunda &lt;strong&gt;return&lt;/strong&gt; ifadesi ile d&amp;ouml;n&amp;uuml;ş yapılan fonksiyonlar da mevcuttur.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Python&lt;/strong&gt; dinamik bir dil olduğundan herhangibir şekilde t&amp;uuml;r bildirimi yapılmasına da gerek yoktur. Ne metod parametrelerinde ne de kod bloklarındaki değişken tanımlamalarında bir t&amp;uuml;r bildirimi yapılmamıştır. Sadece tipin kullanılacağı yerlerde gerekiyorsa d&amp;ouml;n&amp;uuml;ş&amp;uuml;mler s&amp;ouml;z konusu olabilir. &amp;Ouml;rneğin kullanıcıdan alınan bir i&amp;ccedil;eriğin sayısal olarak değerlendirilmesi gerekiyorsa.&lt;/p&gt;
&lt;p&gt;Metod tanımlamalarının en dikkat &amp;ccedil;ekici &amp;ouml;zelliği ise &lt;strong&gt;:&lt;/strong&gt; işareti ve bitiş noktalarıdır. Metodlar &lt;strong&gt;def&lt;/strong&gt; anahtar kelimesi ile tanımlanmaya başlanıp girintili yazılması zorunlu olan ifadeler ile devam eder. Metod sonuna gelindiğinde ise son ifadeyi takiben bir girinti verilmesi veya alt satıra ge&amp;ccedil;ilmesi yeterlidir. Girintilere dikkat edilmediği takdirde &lt;strong&gt;Invalid Syntax&lt;/strong&gt; hatası alınacaktır&lt;em&gt;(ama hala bu kısmı &amp;ouml;ğrenmeye &amp;ccedil;alışıyorum onu ifade edeyim)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Kod dosyasının en başında &lt;strong&gt;import&lt;/strong&gt; anahtar kelimesi ile yapılan bir bildirim mutlaka dikkatinizi &amp;ccedil;ekmiştir.&amp;nbsp;&lt;strong&gt;math&lt;/strong&gt; bir mod&amp;uuml;ld&amp;uuml;r. İ&amp;ccedil;erisinde &lt;strong&gt;pyhton&lt;/strong&gt; ile &lt;strong&gt;built-in&lt;/strong&gt; gelen bir takım matematiksel fonksiyonellikler bulunmaktadır. &amp;Ouml;rneğin &lt;strong&gt;pisagor&lt;/strong&gt; &amp;uuml;&amp;ccedil;geni i&amp;ccedil;in hesaplama yapan metod i&amp;ccedil;erisindeki&amp;nbsp;&lt;strong&gt;math.sqrt&lt;/strong&gt; kullanımı i&amp;ccedil;in gereklidir. Dolayısıyla kendi geliştirdiğimiz, internet &amp;uuml;zerinden indirdiğimiz&lt;em&gt;(.Net'teki Nuget paketleri veya Ruby' deki gem'ler gibi)&lt;/em&gt; veya &lt;strong&gt;python&lt;/strong&gt; ile built-in gelen bu tip mod&amp;uuml;lleri kullanabilmek i&amp;ccedil;in &lt;strong&gt;import&lt;/strong&gt; ifadesinden yararlanırız.&lt;/p&gt;
&lt;p&gt;Gelelim metodlarımızda neler yaptığımıza. Bunları aşağıdaki tabloda kısaca a&amp;ccedil;ıklamaya &amp;ccedil;alıştım.&lt;/p&gt;
&lt;table style="height: 274px;" width="640"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="text-align: center;"&gt;&lt;strong&gt;Metod&lt;/strong&gt;&lt;/td&gt;
&lt;td style="text-align: center;"&gt;&lt;strong&gt;İ&amp;ccedil;inde Neler Oluyor?&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="vertical-align: top;"&gt;&lt;strong&gt;get_players&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Bu metod i&amp;ccedil;erisinde &lt;strong&gt;Tuple&lt;/strong&gt; kullanımı s&amp;ouml;z konusudur. &lt;strong&gt;players&lt;/strong&gt; isimli &lt;strong&gt;Tuple&lt;/strong&gt; 3 elemandan oluşmaktadır. Dikkat edilmesi gereken nokta her bir elemanın farklı sayıda ve tipte niteliğe sahip olabileceğidir. Metod geriye oluşturduğu bu &lt;strong&gt;Tuple&lt;/strong&gt; i&amp;ccedil;eriğini d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. &lt;strong&gt;Tuple&lt;/strong&gt; tipinin elemanlarına &lt;strong&gt;[]&lt;/strong&gt; operat&amp;ouml;r&amp;uuml; ile erişilebilir. &lt;strong&gt;main.py&lt;/strong&gt; i&amp;ccedil;erisinde &amp;ouml;rnek bir kullanım s&amp;ouml;z konusudur. Ancak siz daha fazlasını da keşfetmeye &amp;ccedil;alışın derim.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="vertical-align: top;"&gt;&lt;strong&gt;get_language&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;
&lt;p&gt;Bu fonksiyonda ise &lt;strong&gt;Dictionary&lt;/strong&gt; kullanımı &amp;ouml;rneklenmiştir. Basit anlamda&lt;strong&gt; key:value&lt;/strong&gt; &amp;ccedil;iftlerinden oluşan &lt;strong&gt;Dictionary&lt;/strong&gt;' ler sıklıkla kullanılabilecek veri yapılarındandır.&lt;/p&gt;
&lt;p&gt;Metod &lt;strong&gt;key&lt;/strong&gt; isimli bir parametre almış ve bunu&amp;nbsp;&lt;strong&gt;Dictionary&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt;[]&lt;/strong&gt; operat&amp;ouml;r&amp;uuml; ile arama yapılmasında kullanmıştır. Yani&lt;strong&gt; []&lt;/strong&gt; operat&amp;ouml;r&amp;uuml; &lt;strong&gt;key&lt;/strong&gt; değerini alıp buna karşılık gelen değeri elde etmemizi sağlamaktadır. Metod eğer &lt;strong&gt;key&lt;/strong&gt; i&amp;ccedil;eriği bulunursa değerini d&amp;ouml;nd&amp;uuml;r&amp;uuml;. Bulamazsa &lt;strong&gt;none&lt;/strong&gt; şeklinde bir d&amp;ouml;n&amp;uuml;ş yapacaktır.&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="vertical-align: top;"&gt;&lt;strong&gt;pythagoras&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Pisagor hesabı yapan bu metod &lt;strong&gt;a&lt;/strong&gt; ve &lt;strong&gt;b&lt;/strong&gt; isimli iki parametre almakta olup &lt;strong&gt;math.sqrt&lt;/strong&gt; fonksiyonu ile yaptığı hesaplama sonucunu geriye d&amp;ouml;nd&amp;uuml;rmektedir. Fonksiyon sadece import kullanımını &amp;ouml;rneklemek amacıyla ele alınmıştır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="vertical-align: top;"&gt;&lt;strong&gt;lucky_number_game&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;
&lt;p&gt;Bu metod diğerlerine g&amp;ouml;re nispeten biraz daha eğlencelidir. Kullanıcının bir sayıyı tahmin etmesi istenir. Bizim i&amp;ccedil;in dikkat edilmesi gereken nokta ise kullanılan &lt;strong&gt;while&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml;, &lt;strong&gt;if&lt;/strong&gt; ifadesi ve kullanıcıdan bilgi almak i&amp;ccedil;in &amp;ccedil;ağırılan &lt;strong&gt;input&lt;/strong&gt; fonksiyonudur.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Gerek &lt;strong&gt;while&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; gerek &lt;strong&gt;if&lt;/strong&gt; ifadesi &lt;strong&gt;:&lt;/strong&gt; işareti ile tanımlandıktan sonra yine girintili şekilde koda devam edilmelidir. Aksi durumda bildiğiniz &amp;uuml;zere &lt;strong&gt;Invalid Syntax&lt;/strong&gt; hatası alırız.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;While&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; kullanıcı 7 sayısını girene kadar s&amp;uuml;rekli olarak bir sayı isteyecektir. Kullanıcının girdiği sayı &lt;strong&gt;input&lt;/strong&gt; fonksiyonu ile alınmakta olup &lt;strong&gt;lucky_num&lt;/strong&gt; isimli değişkende saklanmaktadır.&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="vertical-align: top;"&gt;&lt;strong&gt;greetings&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Aslında ilk yazdığım metod buydu ama karışık sırada eklediğimden garip bir yere gelmiş. &lt;strong&gt;Console/Terminal&lt;/strong&gt; ekranına bilgi basmak i&amp;ccedil;in &lt;strong&gt;print&lt;/strong&gt; ve kullanıcıdan giriş almak i&amp;ccedil;in &lt;strong&gt;input&lt;/strong&gt; fonksiyonlarının kullanımına yer verilmektedir. Bir de &lt;strong&gt;%s&lt;/strong&gt; ile &lt;strong&gt;place holder&lt;/strong&gt; kullanımı s&amp;ouml;z konusudur. Tahmin edileceği &amp;uuml;zere &lt;strong&gt;%name&lt;/strong&gt; ve &lt;strong&gt;%age&lt;/strong&gt; değerleri, &lt;strong&gt;string&lt;/strong&gt; ifadelerdeki &lt;strong&gt;%s&lt;/strong&gt; yazan yerlere gelmektedir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="vertical-align: top;"&gt;&lt;strong&gt;a_little_bit_for_loops&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;
&lt;p&gt;Bu metod i&amp;ccedil;erisinde &lt;strong&gt;for&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml;ne ait &amp;ouml;rnekler ve &lt;strong&gt;range&lt;/strong&gt; kullanımı yer almaktadır. &lt;strong&gt;range&lt;/strong&gt;' ler olduk&amp;ccedil;a hoşuma giden bir enstr&amp;uuml;man. Verilen parametrelere g&amp;ouml;re bir değer aralığının otomatik olarak oluşturulmasını sağlmaktadır. &amp;Ouml;rnekteki ilk d&amp;ouml;ng&amp;uuml;de de &lt;strong&gt;minValue&lt;/strong&gt; ve &lt;strong&gt;maxValue&lt;/strong&gt; değerlerinden yararlanılarak &lt;strong&gt;range&lt;/strong&gt; t&amp;uuml;r&amp;uuml; ile bir sayı dizisi oluşturulmuştur.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;range&lt;/strong&gt;'e &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; bir parametre de verilebilir. S&amp;ouml;z konusu parametre ile adım sayısı belirtilir. Yani ikişer ikişer artan bir sayı aralığı oluşturulması da s&amp;ouml;z konusudur. Deneyin ;)&lt;/p&gt;
&lt;p&gt;İkinci &lt;strong&gt;for&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; tahmin edileceği &amp;uuml;zere i&amp;ccedil; i&amp;ccedil;e ge&amp;ccedil;en bir d&amp;ouml;ng&amp;uuml; kullanımına aittir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bu arada kullanıcıdan aldığımız &lt;strong&gt;min&lt;/strong&gt; ve &lt;strong&gt;max&lt;/strong&gt; değerlerinin sayısal işlemlerde kullanmak&amp;nbsp;i&amp;ccedil;in &lt;strong&gt;int&lt;/strong&gt; metodu ile t&amp;uuml;r d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml;ne dahil edildiği de g&amp;ouml;zden ka&amp;ccedil;mamalıdır.&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="vertical-align: top;"&gt;&lt;strong&gt;give_me_a_nickname&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Bu fonksiyonda da bir &lt;strong&gt;while&lt;/strong&gt; kullanımı s&amp;ouml;z konusudur. Ancak koşul da &lt;strong&gt;or&lt;/strong&gt; operat&amp;ouml;r&amp;uuml;ne yer verilmiştir. Kullanıcının gireceği &lt;strong&gt;nickName&lt;/strong&gt;'in &lt;strong&gt;5&lt;/strong&gt; ile &lt;strong&gt;10&lt;/strong&gt; karakter arasında olması sağlanana kadar bilgi istenen sonsuz bir d&amp;ouml;ng&amp;uuml; kurgusudur diyebiliriz. Karaketer uzunluklarının tespiti i&amp;ccedil;inse &lt;strong&gt;len&lt;/strong&gt; fonksiyonundan yararlanılmıştır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="vertical-align: top;"&gt;&lt;strong&gt;using_list&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;Son metodumuzda ise &lt;strong&gt;liste&lt;/strong&gt; t&amp;uuml;r&amp;uuml;ne ait bir &amp;ouml;rnek verilmiştir. Burada her ne kadar konudan sıkılıp sadece sayısal değerlerden oluşan bir liste s&amp;ouml;z konusu olsa da farklı t&amp;uuml;rlerden oluşacak listeler tanımlanabileceğini de belirtmek isterim.&amp;nbsp;Deneyin ;)&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;strong&gt;Tuple&lt;/strong&gt; ile listeler arasında &amp;ouml;nemli bir fark vardır. Listelere yeni elemanlar eklenebilir ve &amp;ccedil;ıkartılabilir ancak &lt;strong&gt;Tuple&lt;/strong&gt; i&amp;ccedil;in bu tip işlemler s&amp;ouml;z konusu değildir. &lt;strong&gt;Tuple&lt;/strong&gt;' ı sadece okunabilir bir tip listesi gibi de d&amp;uuml;ş&amp;uuml;nebiliriz. &lt;strong&gt;Dictionary&lt;/strong&gt; kullanımı i&amp;ccedil;in de verebileceğimiz bir iki t&amp;uuml;yo var. &amp;Ouml;rneğin &lt;strong&gt;Dictionary&lt;/strong&gt;'ler de değerler sayısal bile olsa &amp;ccedil;ift tırnaklar arasında yazılır. Yani bir t&amp;uuml;r d&amp;ouml;n&amp;uuml;ş&amp;uuml;m&amp;uuml; yapılması s&amp;ouml;z konusu olabilir. Ayrıca bir &lt;strong&gt;Dictionary&lt;/strong&gt;'ye yeni eleman eklemek i&amp;ccedil;in aşağıdaki gibi bir ifade kullanılabilir.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;languages["ES"]="Spanish"&lt;/pre&gt;
&lt;p&gt;Diğer yandan var olan bir elemanı değiştirmek istersek de aynı tekniği kullanıyoruz.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;languages["EN"]="British English"&lt;/pre&gt;
&lt;p&gt;Dolayısıyla &lt;strong&gt;Dictionary&lt;/strong&gt;' ler i&amp;ccedil;in var olan bir anahtar değerini değiştirmenin, silme ve yeniden ekleme operasyonu olduğunu d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Listelerin&lt;/strong&gt;, &lt;strong&gt;Tuple&lt;/strong&gt; ve &lt;strong&gt;Dictionary'lerin&lt;/strong&gt; kullanımı hakkında daha fazla detay i&amp;ccedil;in &lt;a href="http://belgeler.istihza.com/py2/liste_demet_sozluk.html" target="_blank"&gt;şu adrese bakabilirsiniz&lt;/a&gt;. Nitekim ben şu anda bu sayfayı okuyorum.&lt;/p&gt;
&lt;h2&gt;Metod Testleri i&amp;ccedil;in main.py kullanımı&lt;/h2&gt;
&lt;p&gt;Peki ilgili metodları nasıl test edeceğiz? Hemen &lt;strong&gt;main.py&lt;/strong&gt; dosyamıza geliyor ve aşağıdaki kod satırlarını oluşturuyoruz.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;#Some practices

import SomeFunctions as func

#interesting code
print(5*"Burki","\n")

# standart input output
func.greetings()

# simple tuples
players=func.get_players()
#print(players)
for player in players:
	print(player)

# simple dictionary
language_code=input("Please give me a country code")
print("\nYour choice is %s\n" %func.get_language(language_code))

# simple list
numbers=func.using_list()
print("\n...and the number list are\n")
for n in numbers:
	print(n)
print("Second element of numbers is %s" %numbers[1])
print("The element count of numbers is %s" %len(numbers))
	
# while, if elif else
func.give_me_a_nickname()

# simple method usage
result=func.pythagoras(int(input("x value:")),int(input("y value:")))
print("pythagoras result is %s" %result)

# while if elif
func.lucky_number_game()

# simple loops
func.a_little_bit_for_loops()&lt;/pre&gt;
&lt;p&gt;Yorumlamalı bir dilden bahsediyoruz. Dolayısıyla kod yukarıdan aşağıya doğru aktık&amp;ccedil;a &amp;ccedil;alışma zamanı tarafından y&amp;uuml;r&amp;uuml;t&amp;uuml;lecek. İlk olarak yine bir &lt;strong&gt;import&lt;/strong&gt; tanımı s&amp;ouml;z konusu. Nitekim metodlarımızı biriktirdiğimiz &lt;strong&gt;SomeFunctions'ı&lt;/strong&gt;&amp;nbsp;bu kod dosyasında&amp;nbsp;bir şekilde ele almalıyız. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;as&lt;/strong&gt; anahtar kelimesi ile de bu dosya i&amp;ccedil;in bir takma ad&lt;em&gt;(alias)&lt;/em&gt; oluşturduk. Bu sayede &lt;strong&gt;SomeFunctions&lt;/strong&gt; i&amp;ccedil;indeki metodlara erişebiliriz.&lt;/p&gt;
&lt;p&gt;Kod aslında entersan bir ifade ile başlıyor. Burada &lt;a href="http://www.borakasmer.com/" target="_blank"&gt;Bora Kaşmer&lt;/a&gt;&amp;nbsp;hocamın aşağıdaki Tweet'inin etkili olduğunu ifade etmek isterim.&lt;/p&gt;
&lt;blockquote class="twitter-tweet" data-lang="tr"&gt;
&lt;p dir="ltr" lang="tr"&gt;&lt;a href="https://twitter.com/burakselyum"&gt;@burakselyum&lt;/a&gt; 5*"Burak" enteresan bir code:) Ben ilk başladığımda &amp;ccedil;ok şaşırmıştım😉&lt;/p&gt;
&amp;mdash; Bora KAŞMER (@CoderBora) &lt;a href="https://twitter.com/CoderBora/status/743398735363903488"&gt;16 Haziran 2016&lt;/a&gt;&lt;/blockquote&gt;
&lt;p&gt;Sonrasında ise diğer metodların sırasıyla &amp;ccedil;ağırıldığını&amp;nbsp;g&amp;ouml;r&amp;uuml;yoruz. Eğer kodlarda bir hata yapmadıysanız&lt;em&gt;(&amp;ouml;zellikle girintilerde)&lt;/em&gt; aşağıdakine benzer sonu&amp;ccedil;lar almanız gerekiyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/06/pythonhw_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tam &amp;ccedil;ıktı ise aşağıdaki gibi.&lt;/p&gt;
&lt;p&gt;Python 3.5.1 (default, Dec 2015, 13:05:11)&lt;br /&gt;[GCC 4.8.2] on linux&lt;br /&gt; &lt;br /&gt;BurkiBurkiBurkiBurkiBurki&lt;/p&gt;
&lt;p&gt;hello python's world&lt;br /&gt;My name is&lt;br /&gt;Burak Selim Senyurt&lt;/p&gt;
&lt;p&gt;so...What's your name? Charles&lt;br /&gt;Wellcome Charles&lt;br /&gt;How old are you? 39&lt;br /&gt;Your age is 39&lt;br /&gt;('burki', 1000, True, '1234-PLY')&lt;br /&gt;('turp', 9003, False, -1, 'gold player', '4445-PLY')&lt;br /&gt;('joiy', 1004, True, -10, 'silver player')&lt;br /&gt;Please give me a country code EN&lt;/p&gt;
&lt;p&gt;Your choice is English&lt;/p&gt;
&lt;p&gt;&lt;br /&gt;...and the number list are&lt;/p&gt;
&lt;p&gt;1&lt;br /&gt;3&lt;br /&gt;4&lt;br /&gt;2&lt;br /&gt;6&lt;br /&gt;7&lt;br /&gt;2&lt;br /&gt;2&lt;br /&gt;9&lt;br /&gt;12&lt;br /&gt;14&lt;br /&gt;10&lt;br /&gt;5&lt;br /&gt;Second element of numbers is 3&lt;br /&gt;The element count of numbers is 13&lt;br /&gt;Please select a nickname Burk&lt;br /&gt;Your nickname too short&lt;br /&gt;Please select a nickname burkkkkkkkkkkkkkkkkkk&lt;br /&gt;Your nickname too long&lt;br /&gt;Please select a nickname buolurmu&lt;br /&gt;Your nick name 'buolurmu' is cool now&lt;br /&gt;x value: 4&lt;br /&gt;y value: -9&lt;br /&gt;pythagoras result is 9.848857801796104&lt;br /&gt;Guess a number: 4&lt;br /&gt;Too bad,Sorry&lt;br /&gt;Guess a number: 3&lt;br /&gt;Too bad,Sorry&lt;br /&gt;Guess a number: 7&lt;br /&gt;Vuhuu&lt;br /&gt;Please insert a minimum value 1&lt;br /&gt;Please insert a maximum value 5&lt;br /&gt;1&lt;br /&gt;2&lt;br /&gt;3&lt;br /&gt;4&lt;br /&gt;5&lt;br /&gt;0 0&lt;br /&gt;0 1&lt;br /&gt;0 2&lt;br /&gt;0 3&lt;br /&gt;0 4&lt;br /&gt;1 0&lt;br /&gt;1 1&lt;br /&gt;1 2&lt;br /&gt;1 3&lt;br /&gt;1 4&lt;br /&gt;2 0&lt;br /&gt;2 1&lt;br /&gt;2 2&lt;br /&gt;2 3&lt;br /&gt;2 4&lt;br /&gt;3 0&lt;br /&gt;3 1&lt;br /&gt;3 2&lt;br /&gt;3 3&lt;br /&gt;3 4&lt;br /&gt;4 0&lt;br /&gt;4 1&lt;br /&gt;4 2&lt;br /&gt;4 3&lt;br /&gt;4 4&lt;/p&gt;
&lt;p&gt;Başka bir eksik kaldı mı diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum şu anda...Ah evet. &lt;strong&gt;#&lt;/strong&gt; ile başlayan satırlar tahmin edeceğiniz &amp;uuml;zere yorum satırlarıdır.&lt;/p&gt;
&lt;p&gt;Bu yazıda merhaba dediğimiz pek &amp;ccedil;ok kavram oldu aslına bakarsanız. &lt;strong&gt;if&lt;/strong&gt;, &lt;strong&gt;while&lt;/strong&gt;, &lt;strong&gt;for&lt;/strong&gt;, &lt;strong&gt;Tuple&lt;/strong&gt;, &lt;strong&gt;Dictionary&lt;/strong&gt;, &lt;strong&gt;List&lt;/strong&gt;, &lt;strong&gt;Range&lt;/strong&gt;,&lt;strong&gt;def&lt;/strong&gt;, &lt;strong&gt;metod ve değişken tanımlamaları&lt;/strong&gt;, &lt;strong&gt;print&lt;/strong&gt;, &lt;strong&gt;input&lt;/strong&gt;, &lt;strong&gt;int&lt;/strong&gt;, &lt;strong&gt;len&lt;/strong&gt;, &lt;strong&gt;import&lt;/strong&gt;, &lt;strong&gt;as&lt;/strong&gt; ve unuttuğum diğerleri. G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;Python&lt;/strong&gt; dili olduk&amp;ccedil;a esnek, s&amp;ouml;z dizimi yalın ve basit. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-06-17 00:00:00</pubDate>
  <slug>bu-yaz-macerasinin-adi-python</slug>
  <tags>
    <tag>python</tag>
    <tag>io-t</tag>
    <tag>internet-of-things</tag>
    <tag>range</tag>
    <tag>list</tag>
    <tag>dictionary</tag>
    <tag>indentation</tag>
    <tag>tuple</tag>
  </tags>
  <categories>
    <category>python</category>
  </categories>
</post>