<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tek Fotoluk İpucu 147 - Port Dinlemek</title>
  <description>Diyelim ki bir sunucu üzerinde tanımlı portların anlık durumları hakkında bilgi sahibi olmak istiyorsunuz (Örneğin sunucuda SQL Server yüklü ise varsayılan 1433 portu açık mı veya ftp portu cevap verir konumda mı vb) Ruby dilinde bu tip bir işlevselliği gerçekleştirmek son derece basit. Tek yapmamız gereken makine adı ve port bilgisini kullanmak. Nasıl mı? Aynen aşağıdaki fotoğrafta olduğu gibi.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Diyelim ki bir sunucu &amp;uuml;zerinde tanımlı portların anlık durumları hakkında bilgi sahibi olmak istiyorsunuz &lt;em&gt;(&amp;Ouml;rneğin sunucuda SQL Server y&amp;uuml;kl&amp;uuml; ise varsayılan 1433 portu a&amp;ccedil;ık mı veya ftp portu cevap verir konumda mı vb)&lt;/em&gt; Ruby dilinde bu tip bir işlevselliği ger&amp;ccedil;ekleştirmek son derece basit. Tek yapmamız&amp;nbsp;gereken makine adı ve port bilgisini&amp;nbsp;kullanmak. Nasıl mı? Aynen aşağıdaki fotoğrafta olduğu gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/11/tfi_147.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;TCPSocket nesnesini kullanabilmek i&amp;ccedil;in sockets k&amp;uuml;t&amp;uuml;phanesine ihtiyacımız var. Built-In gelen k&amp;uuml;t&amp;uuml;phaneyi require anahtar kelimesi ile&amp;nbsp;bildirdikten sonra, belli başlı portlar i&amp;ccedil;in bir Hash listesi oluşturuyoruz. Anahtar&lt;em&gt;(key)&lt;/em&gt;&amp;nbsp;olarak servis/port adını, değer&lt;em&gt;(value)&lt;/em&gt; olarakta port numarasını kullanıyoruz&lt;em&gt;(&amp;Ouml;rnekte bilinen belli başlı port numaralarına yer verdik. Sistemde y&amp;uuml;kl&amp;uuml; olan servislere g&amp;ouml;re genişletebilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;get_port_status metodu iki parametre almakta. port'un olduğu makine adı ve port numarası. Eğer ilgili soket kapalı ise ve bize cevap d&amp;ouml;nm&amp;uuml;yorsa ortama bir hata fırlatılması muhtemel. Eğer bağlantı tanımlı bir firewall kural seti nedeniyle geri &amp;ccedil;evrilirse&amp;nbsp;ECONNREFUSED, zaman aşımı sonucu ulaşılamazsa ETIMEDOUT hatası oluşmakta. Bu nedenle bir istisna&amp;nbsp;bloğundan yararlandık. TCPSocket nesnesi başarılı bir şekilde &amp;ouml;rneklenmişse portun a&amp;ccedil;ık olduğu sonucuna varabiliriz&lt;em&gt;(Dilerseniz hata mesajını da geriye d&amp;ouml;nd&amp;uuml;rebilir ve portun kapalı olma sebebini e bilgi vermek i&amp;ccedil;in kullanabilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Kodun ilerleyen kısmında t&amp;uuml;m hash listesini d&amp;ouml;n&amp;uuml;yor ve listede yer alan portların anlık durumlarını ekrana yazdırıyoruz&amp;nbsp;&lt;em&gt;(Tabii benim iş bilgisayarımda sadece Http servisi etkin olduğundan diğer t&amp;uuml;m portlar kapalı durumda)&lt;/em&gt;&lt;/p&gt;
&lt;h2&gt;Port Demişken&lt;/h2&gt;
&lt;p&gt;Aslında bir makinede tanımlı portlar 1 ile 65535 aralığında değer alırlar. 1 ile 1023 aralğında bilinen portlar bulunur. ftp, smtp, http, https vb...1024 ile 49151 aralığında ise&amp;nbsp;IANA&lt;em&gt;(&lt;a title="IANA Port Listesi" href="http://www.iana.org/assignments/service-names-port-numbers/service-names-port-numbers.xhtml" target="_blank"&gt;Internet Assigned Numbers Authority&lt;/a&gt;)&lt;/em&gt; tarafından kayıt edilmiş servisler yer alır. SQL Server, Oracle, MySQL gibi uygulama servislerine ait portlar burada bulunur. 49152 ile 65535 aralığında ise ge&amp;ccedil;ici olarak kullanılan portlar vardır. Yani buradaki portları kullanan uygulamalar i&amp;ccedil;in sabit numaralar s&amp;ouml;z konusu değildir. Biz kayıtlı olan port numaralarına bakarak a&amp;ccedil;ık veya kapalı olup olmadıklarını anlamaya &amp;ccedil;alışıyoruz. Aslında porttan cevap alabiliyorsak port durumunu a&amp;ccedil;ık olarak kabul ediyoruz.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Porttan Cevap Almak Demişken&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Bir porttan cevap almamız onun a&amp;ccedil;ık olduğu bir başka deyişle portun arkasındaki bir uygulamanın gelecek paketleri dinlemekte olduğunu ifade edecektir. Aslında ilk olarak ilgili porta SYN isimli bir paket gider. Yani yeni bir bağlantı talebi g&amp;ouml;ndermiş oluruz. Bunun sonucu eğer portun arkasında duran uygulama bağlantı i&amp;ccedil;in hazırsa, istemci tarafa SYN/ACK şeklinde bir paketle cevap d&amp;ouml;ner. Yani sunucu tarafı istemciye "seninle konuşmaya hazırım" der. Tabii ilgil portun canı konuşmak istemezse talebi geri &amp;ccedil;evirecektir ki bu durumda istemciye RST paketi g&amp;ouml;nderilir. Ancak, istemci SYN/ACK mesajını almışsa artık sunucu ile konuşabilmenin verdiği memnuniyetle iade-i itibar ederek ACK paketi ile "harikasın" şeklinde d&amp;ouml;n&amp;uuml;ş yapar.&amp;nbsp;Her ne kadar Network programlama eğitimi almamış olsam da three-way handshake&amp;nbsp;adlı bu iletişim şeklinden&amp;nbsp;anladığım budur.&lt;/p&gt;
&lt;p&gt;Siz &amp;ouml;rneği farklı ama&amp;ccedil;larla da kullanabilirsiniz. &amp;Ouml;rneğin iki makine arasında bu şekilde port temelli bir haberleşme olacaksa ve kaynak makinenin hedef makinedeki ilgili porta ulaşıp ulaşamadığının kontrol&amp;uuml; gerekiyorsa bu tip bir betik kullanılabilir. Bir nevi ping işlemi yapıyoruz o y&amp;uuml;zden aynı porta farklı sayılarda talep g&amp;ouml;nderip iletişim s&amp;uuml;relerini &amp;ouml;l&amp;ccedil;&amp;uuml;mleyebiliriz de. Kod par&amp;ccedil;ası&amp;nbsp;bir servis listesi i&amp;ccedil;in de uygulanabilir. Yeni kurulan bir sunucu &amp;uuml;zerinde konuşlandırılan ve farklı port numaraları &amp;uuml;zerinden hizmet eden servis noktalarımız olduğunu varsayarsak, istemciler i&amp;ccedil;in istisnai Firewall talebi yapılması gerekiyor mu sorusuna hemen cevap bulabiliriz.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir ipucunun daha sonuna. Bir başka ipucunda g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-12-07 21:51:00</pubDate>
  <slug>tek-fotoluk-ipucu-147-port-dinlemek</slug>
  <tags>
    <tag>ruby</tag>
    <tag>tcpip</tag>
    <tag>port</tag>
    <tag>networking</tag>
    <tag>network-programming</tag>
    <tag>three-way-handshake</tag>
    <tag>internet-assigned-numbers-authority</tag>
    <tag>t-c-p-socket</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>