<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Xml Web Servislerine Giriş - 2</title>
  <description>Bu makalemizde, bir Xml Web Servisinin Visual Studio ile nasıl oluşturulabileceğini ve bir web sayfası üzerinden nasıl çağırılıp kullanılabileceğini incelemeye çalışacağız. Visual Studio.Net ortamında bir web servisi geliştirmek için, ilk olarak New Project bölümünden, ASP.NET Web Service şablonu seçilir. Visual Studio.Net, yerel makinede bu web servisi için gerekli fiziki ve sanal klasörleri, otomatik olarak oluşturacaktır. Notepad editoründe yazdığımız örneğin aynısını, Visual Studio.Net ortamında gerçekleştireceğimizden, proje ismi olarak GeoWebServis' i kullanalım. Bu aynı zamanda web servisimizin varsayılan isim alanı (default namespace ) olacaktır.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, bir Xml Web Servisinin Visual Studio ile nasıl oluşturulabileceğini ve bir web sayfası &amp;uuml;zerinden nasıl &amp;ccedil;ağırılıp kullanılabileceğini incelemeye &amp;ccedil;alışacağız. Visual Studio.Net ortamında bir web servisi geliştirmek i&amp;ccedil;in, ilk olarak New Project b&amp;ouml;l&amp;uuml;m&amp;uuml;nden, ASP.NET Web Service şablonu se&amp;ccedil;ilir. Visual Studio.Net, yerel makinede bu web servisi i&amp;ccedil;in gerekli fiziki ve sanal klas&amp;ouml;rleri, otomatik olarak oluşturacaktır. Notepad editor&amp;uuml;nde yazdığımız &amp;ouml;rneğin aynısını, Visual Studio.Net ortamında ger&amp;ccedil;ekleştireceğimizden, proje ismi olarak GeoWebServis' i kullanalım. Bu aynı zamanda web servisimizin varsayılan isim alanı (default namespace ) olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk99_1.gif" alt="" width="532" height="372" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. Yeni bir Web Servis projesinin eklenmesi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından Visual Studio.Net, web servisimiz i&amp;ccedil;in gerekli dosyaları oluşturur. Varsayılan olarak servisimiz, Service1.asmx adını alacaktır. Bununla birlikte, bu servise ait Code-Behind dosyasının kodlarıda Visual Studio.Net tarafından otomatik olarak hazırlanır. Visual Studio.Net, servisin kullanımına &amp;ouml;rnek teşkil edicek bir metodu da yorum satırları halinde sunmaktadır. ( HelloWorld() metodu )&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections;
using System.ComponentModel;
using System.Data;
using System.Diagnostics;
using System.Web;
using System.Web.Services;
namespace GeoWebServis
{
     public class Service1 : System.Web.Services.WebService
     {
          public Service1()
          {
             InitializeComponent();
          }
          #region Component Designer generated code
          private IContainer components = null;
          private void InitializeComponent()
          {           }
          protected override void Dispose( bool disposing )
          {
              if(disposing &amp;amp;&amp;amp; components != null)
              {
                   components.Dispose();
              }
              base.Dispose(disposing);          
          }
          #endregion //        [WebMethod]
//        public string HelloWorld()
//        {
//            return "Hello World";
//        } 
       }
    }
}&lt;/pre&gt;
&lt;p&gt;İlk olarak, servisimizin adını değiştireceğiz. Bunun i&amp;ccedil;in &amp;ouml;ncelikle, Solution Explorer kısmında, Service1.asmx dosyasının ismini, GeoMat.asmx olarak değiştirelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk99_2.gif" alt="" width="207" height="344" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. Service isminin değiştirilmesi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdi ise, daha &amp;ouml;nce Notepad uygulamamızda yazdığımız kodları buradaki GeoMat.asmx.cs Code-Behind dosyamız i&amp;ccedil;inde aynen yazıyoruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections;
using System.ComponentModel;
using System.Data;
using System.Diagnostics;
using System.Web;
using System.Web.Services;
namespace GeoWebServis
{
     [WebService(Namespace="http://ilk/servis/",Description="Geometrik Hesaplamalar &amp;Uuml;zerine Metodlar İ&amp;ccedil;erir. Ucgen, Dortgen gibi şekillere y&amp;ouml;nelik alan ve &amp;ccedil;evre hesaplamaları.",Name="Geometrik Hesaplamalar")]
     public class TemelIsler : System.Web.Services.WebService
     {
          private const double pi=3.14;
          [WebMethod(Description="Daire Alan Hesabı Yapar")]
          public double DaireAlan( double r)
          {
              return (r*r)*pi;
          }
          [WebMethod(Description="Daire &amp;Ccedil;evre Hesabı Yapar.")]
          public double DaireCevre( double r)
          {
              return 2*pi*r;
          }
     }
}&lt;/pre&gt;
&lt;p&gt;Projemizi derlediğimizde, Visual Studio.Net, web servisimizin Code-Behind dosyasını kullanarak, servisimiz i&amp;ccedil;in gerekli dll dosyasını otomatik olarak bin klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisinde oluşturacaktır. Hazır olan web servisini test etmek i&amp;ccedil;in, projeyi &amp;ccedil;alıştırmamız (Run) yeterlidir.&lt;/p&gt;
&lt;p&gt;Bir web servisi uygulaması elbette tek başına bir anlam ifade etmez. Web servisleri, ancak istemciler tarafından kullanıldıkları takdirde anlam kazanacaktır. Bir web servisinin, herhangibir istemci uygulamada kullanılabilmesi y&amp;uuml;zeysel olarak bakıldığında &amp;ccedil;ok karmaşık değildir. İstemcinin herşeyden &amp;ouml;nce, web servisinin yer aldığı adrese (URL) bir referansta bulunması gerekir. Bu referansın ge&amp;ccedil;erli olması halinde, bir sonraki adımda istemci uygulamanın servisin sahip olduğu yetenekleri bilmesi gerekmektedir. Bu mimarinin işleyişini ilerleyen makalelerimizde daha derinlemesine incelemeden &amp;ouml;nce basit olarak geliştirdiğimiz web servisini bir istemci uygulamada nasıl kullanacağımızı g&amp;ouml;relim.&lt;/p&gt;
&lt;p&gt;İstemci uygulamamızı şimdilik Visual Studio.Net ortamında geliştireceğiz. Mimarinin temellerini daha iyi kavradıktan sonra bu işin komut satırı ara&amp;ccedil;ları ile nasıl ger&amp;ccedil;ekleştirildiğini daha iyi anlayacağız. Şimdi, Visual Studio.Net ortamında bir uygulama oluşturalım. Bu uygulama bir Windows uygulaması, bir Asp.net uygulaması olabileceği gibi bir Mobil uygulamada olabilir. Şimdi, New Project b&amp;ouml;l&amp;uuml;m&amp;uuml;nden, Asp.Net Web Application tipini se&amp;ccedil;elim ve uygulamamızı Istemci ismi ile oluşturalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk99_3.gif" alt="" width="532" height="395" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. Yeni bir web uygulamasının a&amp;ccedil;ılması.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Sırada bir web servisini uygulamamıza ekleyeceğimiz en &amp;ouml;nemli kısım var. Bunun i&amp;ccedil;in Solution Explorer&amp;rsquo; da projemize sağ tıklıyor ve a&amp;ccedil;ılan men&amp;uuml;den Add Web Reference &amp;ouml;ğesini tıklıyoruz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk99_4.gif" alt="" width="234" height="365" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. Web servisi i&amp;ccedil;in gerekli referansın eklenmesi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bu işlem sonucunda ekrana, web servisini ekleyebilmemiz i&amp;ccedil;in bir ka&amp;ccedil; y&amp;ouml;ntem sunan &lt;strong&gt;Add Web Reference&lt;/strong&gt; dialog penceresi gelecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk99_5.gif" alt="" width="420" height="389" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 5. Web servisinin aranması.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Servisimizi, yerel makinede geliştirdiğimiz i&amp;ccedil;in, &lt;strong&gt;Web services on the local machine&lt;/strong&gt; bağlantısına tıklamamız halinde, localhost&amp;rsquo; ta yer alan kullanılabilir t&amp;uuml;m web servislerinin listesini elde ederiz. Bu linke tıkladığımızda, geliştirmiş olduğumuz Web Servisini ve bu servise ulaşabileceğimiz adresi elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk99_6.gif" alt="" width="419" height="287" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 6. Yerel sunucuda bulunan web servisi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;GeoMat isimli bağlantıya tıkladığımızda, web servisine ait bilgilerin yer aldığı ve web servisini test edebilmemizi sağlıyan pencere ile karşılaşırız. Hatırlatmak gerekirse, burada yer alan servise ve metodlara ait temel bilgiler WebService ve WebMethod nitelikleri sayesinde ger&amp;ccedil;ekleştirilmiştir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk99_7.gif" alt="" width="639" height="364" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 7. Servisimizin sağladıklarına bakılması.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Artık web servisimizi bulduğumuza ve ne t&amp;uuml;r işlemler ger&amp;ccedil;ekleştirebildiğini &amp;ouml;ğrendiğimize, dolayısıyla servisi keşfettiğimize ( Discovery) g&amp;ouml;re, bu servisi uygulamamıza &lt;strong&gt;Add Reference&lt;/strong&gt; butonuna tıklayarak ekleyebiliriz. Bu işlemin ardından, Visual Studio.Net uygulamaya bazı yeni dosyalar ekleyecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk99_8.gif" alt="" width="209" height="381" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 8. Servisimiz ile birlikte oluşturulan ek dosyalar.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;T&amp;uuml;m bu dosyalar Web References sekmesinin altında yer almaktadır. Bu dosyaların ne işe yaradığını ve ne ama&amp;ccedil;la oluşturululduğunu incelemeden &amp;ouml;nce, projemize eklediğimiz web servisini uygulama i&amp;ccedil;erisinde nasıl kullanacağımızı g&amp;ouml;relim. Bu ama&amp;ccedil;la basit Web Form&amp;rsquo; umuzu aşağıdaki gibi tasarlayalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk99_9.gif" alt="" width="280" height="195" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 9. Web sayfamız.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdi, Hesapla başlıklı butona basıldığında meydana gelecek işlemleri kodlayacağız. Burada, web servisimizindeki Alan ve Cevre isimli metodları &amp;ccedil;ağıracak ve bu metodlara parametre olarak TextBox metin kutusu kontrol&amp;uuml;ne girilen değeri g&amp;ouml;ndereceğiz. Daha sonra Web Servisimiz bu metin kutusundaki değeri ilgili metodlarda &amp;ccedil;alıştıracak ve işlemlerin sonucu olarak metodlardan d&amp;ouml;nen değerleri, web sayfamıza g&amp;ouml;nderecek. Bunu ger&amp;ccedil;ekleştirebilmek i&amp;ccedil;in tek yapmamız gereken aşağıdaki kodları yazmak.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnHesapla_Click(object sender, System.EventArgs e)
{
     double r=Convert.ToDouble(txtYaricap.Text);
     localhost.GeometrikHesaplamalar gh=new Istemci.localhost.GeometrikHesaplamalar();
     lblAlan.Text=gh.DaireAlan(r).ToString();
     lblCevre.Text=gh.DaireCevre(r).ToString();
}&lt;/pre&gt;
&lt;p&gt;Burada belkide en &amp;ouml;nemli kısım, Web Servisimizde yer alan GemotrikHesaplamalar isimli sınıfa ait bir nesne &amp;ouml;rneğinin aşağıdaki kod satırı ile oluşturulmasıdır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;localhost.GeometrikHesaplamalar gh=new Istemci.localhost.GeometrikHesaplamalar();&lt;/pre&gt;
&lt;p&gt;Web servisimizdeki metodlara işte bu nesne vasıtasıyla erişmekteyiz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;lblAlan.Text=gh.DaireAlan(r).ToString();
lblCevre.Text=gh.DaireCevre(r).ToString();&lt;/pre&gt;
&lt;p&gt;Burada kullanılan web servisinin, global seviyedeki bir ağda yer aldığını d&amp;uuml;ş&amp;uuml;n&amp;uuml;rsek, servis i&amp;ccedil;indeki sınıfa ait nesnenin istemci makinede nasıl &amp;ouml;rneklenebildiğini anlamak &amp;ouml;nemlidir. Nitekim sınıfa ait nesne &amp;ouml;rneğininin oluşturulabilmesi, istemci makinede de, bu sınıfın olmasını gerektirir. Bu Remoting teknolojisinden gelen bir &amp;ouml;zelliktir. Bir Remoting uygulamasında, uzak hizmetleri sağlayan nesne modelleri (dll dosyaları), bu hizmetleri kullanmak isteyen makinelere kopyalanır ve uygulamalara referans olarak belirtilir. Oysaki web servislerinde durum farklıdır. Web servisimize ait sınıfı, istemci uygulamaya kopyalamadık. Peki nasıl oldu da bu servis sınıfı, istemci uygulamada kullanılabildi. İşte WSDL (Web Services Description Language) bu noktada devreye girerek bize yardımcı olmaktadır. Mimarinin daha derinlerine girerek bu konuyu net bir şekilde kavramadan &amp;ouml;nce uygulamamızın nasıl &amp;ccedil;alıştığına bakalım. Bunun i&amp;ccedil;in projeyi Run edelim ve metin kutusuna bir yarı&amp;ccedil;ap değeri girelim. Sonu&amp;ccedil; aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk99_10.gif" alt="" width="253" height="142" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 10. Web servisinin &amp;ccedil;alıştırılması sonucu.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Artık web servisimizi kullanan bir istemci uygulamamız var. Peki ger&amp;ccedil;ekte, kamera arkasında olanlar neler. Nasıl oluyorda, web servisini kullanmak istediğimizde, (bu servis d&amp;uuml;nyanın başka ucundaki bir makinede olsa bile) bu servise ait bir nesne &amp;ouml;rneğini istemci uygulamada oluşturabiliyoruz? Hatta bu nesne nasıl oluyorda, web servisindeki metodları biliyor ve onları parametreleri ile birlikte &amp;ccedil;ağırabiliyor? İşte t&amp;uuml;m bu soruların cevabı i&amp;ccedil;in &amp;ouml;ncelikle mimariye daha derinlemesine bakmamız gerekiyor. Web servislerinin mimarisini ilerleyen makalelerimizde incelemeye &amp;ccedil;alışacağız. Tekrar g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler.&lt;/p&gt;</content>
  <pubDate>2004-09-30 12:00:00</pubDate>
  <slug>Xml-Web-Servislerine-Giris-2-bsenyurt-com-dan</slug>
  <tags>
    <tag>xml-web-services</tag>
  </tags>
  <categories>
    <category>XML Web Services</category>
  </categories>
</post>