<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF 4.0 Yenilikleri - Ad Hoc WS-Discovery [Beta 1]</title>
  <description>Ağ üzerinde bulunan servis noktalarının çalışma zamanında keşfi(Runtime Discovery), Servis Yönelimli Mimarilerde(Service Oriented Architecture) karşılaşılan en önemli ihtiyaçlardan birisidir.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f8%2fblg67_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Uzun s&amp;uuml;redir macera dolu bir r&amp;uuml;ya g&amp;ouml;rm&amp;uuml;yordum. Ge&amp;ccedil;tiğimiz gece askeri bir birlikte g&amp;ouml;rev yapmaktaydım ve gerideki top&amp;ccedil;u birliklerime hedeflere ait koordinatları bildiriyordum. Tabi ger&amp;ccedil;ek hayatta yedek subak eğitimimi Top&amp;ccedil;u sınıfında,&amp;nbsp;Ateş Destek &amp;uuml;zerine aldığım i&amp;ccedil;in keşif, arama ve bulma&amp;nbsp;gibi konularda azda olsa bilgi sahibiydim. R&amp;uuml;yamda da bu bilgilerimi kullandığımı itiraf edebilirim. Peki konumuz nedir?&lt;/p&gt;
&lt;p&gt;Bu yazımızdaki konumuzun keşif yapmak ile aslında &amp;ccedil;ok yakın bir ilişkisi bulunmaktadır. WS-Discovery modeli i&amp;ccedil;in WCF 4.0 ile birlikte gelen kolaylıklar.&lt;/p&gt;
&lt;p&gt;Ağ &amp;uuml;zerinde bulunan servis noktalarının &lt;strong&gt;&amp;ccedil;alışma zamanında keşfi(Runtime Discovery),&lt;/strong&gt; &lt;strong&gt;Servis Y&amp;ouml;nelimli Mimarilerde(Service Oriented Architecture)&lt;/strong&gt; karşılaşılan en &amp;ouml;nemli ihtiya&amp;ccedil;lardan birisidir. &amp;Ouml;yleki; bazı servislerin ağa dahil olması, ağdan ayrılması gibi zaman i&amp;ccedil;erisinde yerlerinin sıklıkla değiştiği durumlarda, s&amp;ouml;z konusu servislerin istemciler tarafından dinamik olarak keşfedilmesi gerekebilir. &lt;strong&gt;WS-Discovery&lt;/strong&gt; bu tip durumlar i&amp;ccedil;in &lt;a title="OASIS" href="http://www.oasis-open.org/home/index.php" target="_blank"&gt;&lt;strong&gt;OASIS&lt;/strong&gt; &lt;/a&gt;tarafından kabul g&amp;ouml;rm&amp;uuml;ş bir mesajlaşma standardı sunmaktadır. Bu mesajlaşma standardına g&amp;ouml;re, servislerin keşfedilmesi(Discovery) i&amp;ccedil;in aslında temel olan d&amp;ouml;rt temel operasyon s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Hello&lt;/li&gt;
&lt;li&gt;Probe&lt;/li&gt;
&lt;li&gt;Resolve&lt;/li&gt;
&lt;li&gt;Bye&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Servislerin ağa dahil olmaları sırasında &lt;strong&gt;multicast&lt;/strong&gt; mesajlar yardımıyla "Merhaba, ben geldim,buradayım" demeleri bu operasyonlardan birisidir&lt;strong&gt;(Hello)&lt;/strong&gt;. Diğer yandan &amp;ccedil;ok doğal olarak ağa dahil olan bir servisin ağdan ayrılması halinde, "Ben gidiyorum" şeklinde bir multicast yayınlama yapması s&amp;ouml;z konusudur&lt;strong&gt;(Bye)&lt;/strong&gt;. Bu da &lt;strong&gt;WS-Discovery&lt;/strong&gt; i&amp;ccedil;erisinde yer alan ve servisler tarafından ger&amp;ccedil;ekleştirilen operasyonlardan bir diğeridir. İstemciler a&amp;ccedil;ısından olaya bakıldığında ise iki farklı operasyon s&amp;ouml;z konusudur. İstemciler, kullanmak istedikleri servislerin tipi veya kapsamlarına g&amp;ouml;re arama işlemlerini yine mutlicast mesajlaşma ile ger&amp;ccedil;ekleştirebilirler&lt;strong&gt;(Probe).&lt;/strong&gt; Birde istemcilerin servisi adları ile aramasıda m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r&lt;strong&gt;(Resolve)&lt;/strong&gt;. Buda istemcilerin ele aldığı ikinci operasyon olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WS-Discovery&lt;/strong&gt; ile ilişkili olarak yaptığım araştırmalarda pek &amp;ccedil;ok kaynakta &amp;ouml;rnek olarak ağ &amp;uuml;zerindeki bir yazıcı s&amp;uuml;r&amp;uuml;c&amp;uuml;s&amp;uuml;n&amp;uuml;n(Printer Device)&amp;nbsp;&amp;ouml;rnek olarak verildiğini g&amp;ouml;rd&amp;uuml;m. Sanıyorumki konunun anlaşılması &amp;uuml;zerine verilebilecek en g&amp;uuml;zel &amp;ouml;rnek...Bu vakaya g&amp;ouml;re ağa katılan ve hatta bazı durumlarda ağdan ayrılan bir yazıcı s&amp;uuml;r&amp;uuml;c&amp;uuml;s&amp;uuml;n&amp;uuml;n(Printer Device) servis olarak değerlendirildiği d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmektedir. Printer ağa katıldığında, ağ &amp;uuml;zerindeki t&amp;uuml;m boğumlara &lt;strong&gt;tek y&amp;ouml;nl&amp;uuml; bir merhaba mesajını(One-way Hello Message)&lt;/strong&gt;&amp;nbsp;g&amp;ouml;nderir. Bu andan itibaren istemciler(Clients), ağ &amp;uuml;zerine &lt;strong&gt;Probe&lt;/strong&gt; mesajlarını g&amp;ouml;ndererek var olan yazıcı listelerinden &amp;ouml;rneğin belirli bir alt ağda olanlara talepte bulunabilirler. Tabiki istemci isterse &lt;strong&gt;Resolve&lt;/strong&gt; mesajı ile belirli bir yazıcı s&amp;uuml;r&amp;uuml;c&amp;uuml;s&amp;uuml;ne talepte de bulunabilir. Elbetteki bu vakada eksik kalan kısım yazıcının ve dolayısıyla s&amp;uuml;r&amp;uuml;c&amp;uuml; servisinin ağdan kopartılmasıdır(&amp;Ouml;rneğin kapatılması). Bu durumda printer s&amp;uuml;r&amp;uuml;c&amp;uuml; servisi, ağ &amp;uuml;zerine bu kez &lt;strong&gt;tek-y&amp;ouml;nl&amp;uuml; g&amp;uuml;le g&amp;uuml;le(One-Way Bye)&lt;/strong&gt; mesajı g&amp;ouml;ndererek artık etkin olmadığını bildirmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF 4.0&lt;/strong&gt; tarafında istemcilerin &amp;ouml;zellikle servisleri keşfetmeleri amacıyla değerlendirebilecekleri &lt;strong&gt;WS-Discovery&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml;n iki uygulama modeli bulunmaktadır. &lt;strong&gt;Ad Hoc&lt;/strong&gt; ve &lt;strong&gt;Managed&lt;/strong&gt;. Ad Hoc modeline g&amp;ouml;re istemci, &amp;ouml;nceden belirlenmiş kriterlerine g&amp;ouml;re servisi&amp;nbsp;&lt;strong&gt;Probe&lt;/strong&gt; mesajları ile keşfetmeye &amp;ccedil;alışmaktadır. Eğer &lt;strong&gt;Probe&lt;/strong&gt; mesajına karşılık eşleşen bir servis bulunursa istemci tarafına bir cevap g&amp;ouml;nderilir. Bu modelde istemcinin&amp;nbsp;&lt;strong&gt;multicast&lt;/strong&gt; mesajlar ile s&amp;uuml;rekli bir kontrol i&amp;ccedil;erisinde olması(Polling) ağ&amp;nbsp;&amp;uuml;zerindeki&amp;nbsp;trafiği arttırıcı bir etken olarak g&amp;ouml;r&amp;uuml;lebilir.&amp;nbsp;İşte bu noktada servisin &lt;strong&gt;announce&lt;/strong&gt; adı verilen &lt;strong&gt;Hello&lt;/strong&gt; ve &lt;strong&gt;Bye&lt;/strong&gt; mesajları ile kendisinin online olup olmadığına dair bildirimlerde bulunması s&amp;ouml;z konusu y&amp;uuml;k&amp;uuml;n hafifletilmesini sağlamaktadır.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bu modelin uygulanması son derece kolaydır. Diğer yandan model sadece&amp;nbsp;yerel ağlar i&amp;ccedil;in kullanışlıdır. Ancak ağın &amp;ouml;tesinde yer alan servislerin keşfedilmesi s&amp;ouml;z konusu olduğunda ise Managed modelin kullanılması gerekmektedir. &lt;strong&gt;Managed&lt;/strong&gt; modelde, ağda g&amp;ouml;r&amp;uuml;len servislerin tamamı i&amp;ccedil;in merkezileştirilmiş &lt;strong&gt;depolama alanı(Repository)&lt;/strong&gt; ve bir &lt;strong&gt;proxy&lt;/strong&gt; servisi s&amp;ouml;z konusudur. B&amp;ouml;ylece proxy servisi ağın &amp;ouml;tesindeki canlı &lt;strong&gt;Endpoint&lt;/strong&gt; listelerini tutarak, ağ i&amp;ccedil;erisindeki diğer istemcilerin s&amp;ouml;z konusu servislerden yararlanabilmesini sağlamaktadır. Dolayısıyla istemciler doğrudan aradaki proxy servisi ile iletişim kurmaktadır. Managed modelin uygulanması biraz daha komplekstir. O nedenle bu ilk yazımızda kolay olan &lt;strong&gt;Ad Hoc&lt;/strong&gt; modelini inceliyor olacağız. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zetle &lt;strong&gt;WS-Discovery&lt;/strong&gt;, &lt;strong&gt;OASIS&lt;/strong&gt; tarafından standart olarak g&amp;ouml;r&amp;uuml;lm&amp;uuml;ş ve multicast mesajlaşmayı baz alan, servislerin keşfedilmesi i&amp;ccedil;in kullanılan bir protokol b&amp;uuml;t&amp;uuml;n&amp;uuml; olarak tanımlanabilir. Konuyu daha net kavrayabilmek adına basit bir &amp;ouml;rnek ile ilerlememizde fayda olacağı kanısındayım. İlk olarak bir servis uygulaması geliştirecek ve bunu &lt;strong&gt;WS-Discovery&lt;/strong&gt; destekli olacak şekilde kuracağız. Sonrasında ise bu servisi keşfetme yeteneğine sahip olan bir istemci uygulamayı geliştireceğiz. Her iki tarafında &lt;strong&gt;.Net Framework 4.0 Beta 1&lt;/strong&gt; &amp;uuml;zerinde ve&lt;strong&gt; Visual Studio 2010 Beta 1&lt;/strong&gt; yardımıyla geliştirildiğini belirtelim. Servis tarafına ait kod i&amp;ccedil;eriğimizi aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace ServerApp
{
    [ServiceContract]
    interface ICalculus
    {
        [OperationContract]
        double Sum(double x, double y);
    }

    class CalculusService
        :ICalculus
    {
        public double Sum(double x, double y)
        {
            return x + y;
        }
    }

    class Program
    {
        static void Main(string[] args)
        {
            ServiceHost host = new ServiceHost(typeof(CalculusService)
                ,new Uri("http://localhost:5002/CalculusService"));

            host.Open();
            Console.WriteLine("Service status {0}",host.State.ToString());
            Console.ReadLine();
            host.Close();
            Console.WriteLine("Service status {0}", host.State.ToString());
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Servis tarafı i&amp;ccedil;in belkide en &amp;ouml;nemli olan kısım&lt;strong&gt; App.config&lt;/strong&gt; dosyasının i&amp;ccedil;eriğidir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
  &amp;lt;system.serviceModel&amp;gt;
    &amp;lt;behaviors&amp;gt;
      &amp;lt;serviceBehaviors&amp;gt;
        &amp;lt;behavior&amp;gt;
          &amp;lt;!-- Service Discovery davranışı etkinleştirilir--&amp;gt;
          &amp;lt;serviceDiscovery /&amp;gt;
          &amp;lt;serviceMetadata/&amp;gt;
        &amp;lt;/behavior&amp;gt;
      &amp;lt;/serviceBehaviors&amp;gt;
    &amp;lt;/behaviors&amp;gt;    
    &amp;lt;services&amp;gt;
      &amp;lt;service name="ServerApp.CalculusService"&amp;gt;
        &amp;lt;endpoint address="" binding="basicHttpBinding" contract="ServerApp.ICalculus" /&amp;gt;
        &amp;lt;endpoint address="Mex" kind="mexEndpoint" /&amp;gt;
        &amp;lt;endpoint name="udpDiscovery" kind="udpDiscoveryEndpoint" /&amp;gt; &amp;lt;!-- UDP tabanlı standart Endpoint tanımlaması yapılır--&amp;gt;
      &amp;lt;/service&amp;gt;
    &amp;lt;/services&amp;gt;
  &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;BasicHttpBinding&lt;/strong&gt; tabanlı bir &lt;strong&gt;Endpoint&lt;/strong&gt; tanımlamasının haricinde iki adet standart &lt;strong&gt;endPoint&lt;/strong&gt; tanımlaması daha bulunmaktadır. &lt;strong&gt;Mex&lt;/strong&gt; tabanlı olan ve &lt;strong&gt;metadata&lt;/strong&gt; &lt;strong&gt;publishing&lt;/strong&gt; a&amp;ccedil;ılımına izin veren bir yana, &amp;ouml;nemli olan&lt;strong&gt; udpDiscoveryEndpoint&lt;/strong&gt; tipinden olanıdır. Bu tanımlamaya ek olarak &lt;strong&gt;servis davranışlarında(serviceBehavior)&lt;/strong&gt; belirtilen &lt;strong&gt;serviceDiscovery&lt;/strong&gt; bildirimi ile, servisin istemciler tarafından keşfedilebilmesi i&amp;ccedil;in &lt;strong&gt;UDP&lt;/strong&gt; tabanlı protokol &amp;uuml;zerinden destek verebileceği set edilmiş olmaktadır&lt;em&gt;.(Bu &amp;ouml;rnekte announce mesajlaşma kısmını değerlendirmedik.&amp;nbsp;Bunu ilerleyen kısımlarda ele alacağız. Ancak udpAnnouncementEndpoint tipinin bu ama&amp;ccedil;la kullanıldığını&amp;nbsp;ipucu olarak verebiliriz.)&lt;/em&gt;&amp;nbsp;Gelelim istemci tarafına...&lt;/p&gt;
&lt;p&gt;İstemci tarafında &amp;ouml;nem arz eden konuların başında &lt;strong&gt;System.ServiceModel&lt;/strong&gt; haricinde &lt;strong&gt;System.ServiceMode.Discovery&lt;/strong&gt; &lt;strong&gt;assembly' &lt;/strong&gt;ınında projeye referans edilmesi gelmektedir. Nitekim bu assembly i&amp;ccedil;erisinde &lt;strong&gt;Discovery&lt;/strong&gt; sistemi i&amp;ccedil;in gerekli tip tanımlamaları yer almaktadır&lt;strong&gt;(DiscoveryClient, FindCriteria&lt;/strong&gt; vb...) İstemci tarafında bir proxy tipi bulunmaktadır. Bunun &amp;uuml;retimi i&amp;ccedil;in standart olarak&lt;strong&gt; Add Service Reference&lt;/strong&gt; &amp;ouml;zelliğinden yararlanılabilir. Ancak bu sefer servis tarafının adresinin ne olduğu bilinmeden istemci tarafında geliştirilme yapılması hedeflenmektedir. Nitekim sistemimize g&amp;ouml;re istemci uygulama, ağ &amp;uuml;zerinde belirli bir kritere uyan servisi arayacak, bulduğunda ise yayınlama yaptığı adresten yararlanarak proxy nesnesini ayağa kaldıracaktır. Dolayısıya &lt;strong&gt;config&lt;/strong&gt; dosyası i&amp;ccedil;eriğini aşağıdaki gibi geliştirmemiz gerekmektedir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
  &amp;lt;system.serviceModel&amp;gt;
    &amp;lt;client&amp;gt;
      &amp;lt;endpoint binding="basicHttpBinding" contract="CalculusSpace.ICalculus" name="CalculusEndpoint" /&amp;gt;
      &amp;lt;endpoint name="udpDiscovery" kind="udpDiscoveryEndpoint" /&amp;gt;      
    &amp;lt;/client&amp;gt;
  &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Servis tarafındaki &lt;strong&gt;app.config&lt;/strong&gt; dosyası i&amp;ccedil;eriğine benzer olaraktan, istemci tarafında da standart &lt;strong&gt;endPoint&lt;/strong&gt; tiplerinden olan &lt;strong&gt;udpDiscoveryEndpoint&lt;/strong&gt; kullanımı s&amp;ouml;z konusudur. İstemci tarafının uygulama kodlarını ise aşağıdaki gibi geliştirmemiz yeterlidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using System.ServiceModel.Discovery;
using ClientApp.CalculusSpace;

namespace ClientApp
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Başlamak i&amp;ccedil;in tuşa basın");
            Console.ReadLine();

            DiscoveryClient disClient = new DiscoveryClient("udpDiscovery");

            // Arama kriteri oluşturuluyor. Parametre olarak servis s&amp;ouml;zleşmesini i&amp;ccedil;eren Interface verilmekte
            FindCriteria findCriteria = new FindCriteria(typeof(ICalculus));
            // FindCriteria' nun sonucunu taşıyacak olan FindResponse nesne &amp;ouml;rneği oluşturuluyor
            FindResponse findResponse = disClient.Find(findCriteria);

            // Kritere g&amp;ouml;re bulunan ilk EndPoint adresi alınıyor
            EndpointAddress epAddress = findResponse.Endpoints[0].Address;

            // Bulunan endPoint adresi, proxy' nin &amp;uuml;retilmesinde kullanılıyor
            CalculusClient client = new CalculusClient("CalculusEndpoint", epAddress);

            Console.WriteLine("{0} adresi &amp;uuml;zerinden &amp;ccedil;ağrı yapılacaktır",epAddress.Uri.ToString());
            double result = client.Sum(3, 5);
            Console.WriteLine("{0} + {1} = {2}",3,5,result.ToString());

            Console.ReadLine();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;DiscoveryClient&lt;/strong&gt; tipine ait nesne &amp;ouml;rneğinin oluşturulması sırasında &lt;strong&gt;UDP&lt;/strong&gt; tabanlı bir &lt;strong&gt;Discovery&lt;/strong&gt; bağlantı noktasının kullanılacağı belirtilmektedir. Sonrasında ise bir arama kriteri oluşturulur. Bizim arama kriterimize g&amp;ouml;re servisin &lt;strong&gt;aray&amp;uuml;z s&amp;ouml;zleşmesi(Service Contract)&lt;/strong&gt;&amp;nbsp;kullanılmaktadır. &lt;strong&gt;DiscoveryClient&lt;/strong&gt; nesne &amp;ouml;rneğine ait olan &lt;strong&gt;Find&lt;/strong&gt; metodu ile belirtilen kritere g&amp;ouml;re bir arama yapılmasına başlanır. Bir başka deyişle ağ &amp;uuml;zerinde bir &lt;strong&gt;multicast &lt;/strong&gt;mesaj yayını ile belirtilen kritere uygun servis u&amp;ccedil; noktası aranır. Servis noktası bulunduğunda ise &lt;strong&gt;Find&lt;/strong&gt; metodundan geriye d&amp;ouml;nen &lt;strong&gt;FindResponse&lt;/strong&gt; nesne &amp;ouml;rneğine ait &lt;strong&gt;Endpoints&lt;/strong&gt; koleksiyonu değerlendirilir ve dizinin ilk elemanının &lt;strong&gt;Address&lt;/strong&gt; &amp;ouml;zelliğinde servise ulaşılabilecek adres bilgisi elde edilir.&lt;/p&gt;
&lt;p&gt;Bundan sonraki kısım ise son derece tanıdıktır. Tek yapılması gereken &lt;strong&gt;proxy&lt;/strong&gt; nesne &amp;ouml;rneğinin oluşturulması sırasında cevap olarak elde edilen &lt;strong&gt;Endpoint&lt;/strong&gt; adres bilgisinin kullanılması gerekmektedir. Burada g&amp;ouml;zden ka&amp;ccedil;ırmamamız gereken nokta, istemci tarafında herhangibir şekilde servise ait adres bilgisinin a&amp;ccedil;ık bir şekilde verilmemiş olmasıdır. İstemcinin elinde aslında ağ &amp;uuml;zerindeki servisler i&amp;ccedil;erisinde arama yapabileceği bir kriter bulunmaktadır&lt;strong&gt;(ICalculus isimli servis s&amp;ouml;zleşmesi)&lt;/strong&gt;. Uygulamayı test ettiğimizde ilk etapta aşağıdaki &amp;ccedil;ıktıyı elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg67_FirstRuntime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Nevarki istemci tarafında sonu&amp;ccedil; elde edilinceye kadar belirli bir s&amp;uuml;re beklendiği hemen fark edilebilir. Bu son derece doğaldır. Nitekim istemcinin kriterine uygun olan servisin arama s&amp;uuml;resi s&amp;ouml;z konusudur. Ancak şunu belirtelim, istenirse s&amp;ouml;z konusu arama kısmı asenkron olarak değerlendirilebilir. Şu aşamada bizim i&amp;ccedil;in &amp;ouml;nemli olan nokta, istemcinin yayın yapılan servis adresini bulabilmiş olmasıdır. Hatta bu noktada testimize şu şekilde devam etmemizde yarar vardır. T&amp;uuml;m uygulamaları kapattıktan sonra servisin adresini aşağıdaki gibi değiştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;http://localhost:6002/CalculusService&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Servis uygulamasını ve sonrasında istemci uygulamayı tekrardan &amp;ccedil;alıştırırsak bu kez aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg67_SecondRuntime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;M&amp;uuml;kemmel &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;Nitekim servis tarafının adresini değiştirmiş olmamıza rağmen istemci uygulama &amp;ccedil;alışabilmektedir. Normal şartlarda &lt;strong&gt;Discovery&lt;/strong&gt; gibi bir mekanizma kullanmadığımızda istemci uygulamalarda gerekli adres bilgilendirmelerinin değiştirilmesi gerektiğini unutmayalım.&lt;/p&gt;
&lt;p&gt;Şimdide bu işlemin asenkron olarak nasıl yapılabileceğini bakacağız. Web servislerine .Net 2.0 versiyonu ile birlikte getirilmiş olan &lt;strong&gt;olay tabanlı asenkron erişim(Event-Based Asynchronous)&lt;/strong&gt; tekniği burada da kullanılmaktadır. &lt;strong&gt;Find&lt;/strong&gt; metodunun asenkron olan &lt;strong&gt;FindAsync&lt;/strong&gt; versiyonu kullanılarak, arama işleminin asenkron olarak ger&amp;ccedil;ekleştirilmesi sağlanabilir. İşlemler başarılı bir şekilde tamamlandığı takdirde &lt;strong&gt;FindCompleted&lt;/strong&gt; isimli olay metodu devreye girmektedir. İşte asenkron arama ile ilişkili &amp;ouml;rneğimizde yaptığımız değişiklikler.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using System.ServiceModel.Discovery;
using ClientApp.CalculusSpace;

namespace ClientApp
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Başlamak i&amp;ccedil;in tuşa basın");
            Console.ReadLine();

            DiscoveryClient disClient = new DiscoveryClient("udpDiscovery");

            // Arama kriteri oluşturuluyor. Parametre olarak servis s&amp;ouml;zleşmesini i&amp;ccedil;eren Interface verilmekte
            FindCriteria findCriteria = new FindCriteria(typeof(ICalculus));

            #region Asenkron erişim

            // Standart olay bazlı asenkron erişim tekniği kullanılır.
            
            disClient.FindCompleted += delegate(object sender, FindCompletedEventArgs e)
            {
                // Hata varsa bildir
                if (e.Error != null)
                {
                    Console.WriteLine(e.Error.Message);                   
                }
                else if (e.Cancelled == true) // İşlem iptal edilmişse bildir
                {
                    Console.WriteLine("İşlem iptali");
                }
                else // Aksi durumda işlemleri y&amp;uuml;r&amp;uuml;t ve servis operasyonunu elde edilen adres &amp;uuml;zerinden &amp;ccedil;alıştır
                {
                    FindResponse findResponse = e.Result;
                    EndpointAddress epAddress = findResponse.Endpoints[0].Address;

                    // Bulunan endPoint adresi, proxy' nin &amp;uuml;retilmesinde kullanılıyor
                    CalculusClient client = new CalculusClient("CalculusEndpoint", epAddress);

                    Console.WriteLine("{0} adresi &amp;uuml;zerinden &amp;ccedil;ağrı yapılacaktır", epAddress.Uri.ToString());
                    double result = client.Sum(3, 5);
                    Console.WriteLine("{0} + {1} = {2}", 3, 5, result.ToString());
                }
            };

            disClient.FindAsync(findCriteria);
            Console.WriteLine("Arama işlemi başladı");
            Console.ReadLine();

            #endregion
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu kez &amp;ouml;rneğimizin &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg67_Asenkron.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;FindAsync&lt;/strong&gt; &amp;ccedil;ağrısından sonra hemen alt satıra ge&amp;ccedil;ilerek kodun &amp;ccedil;alışması devam etmiştir. Servisten gerekli cevap alındıktan sonrada, Sum operasyonu başarılı bir şekilde icra edilmiştir. Discovery mekanizması ile ilişkili olaraktan WCF 4.0 tarafına gelen başka yeniliklerde s&amp;ouml;z konusudur. &amp;Ouml;rneğin&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Scope kullanılarak keşif yapılması,&lt;/li&gt;
&lt;li&gt;announcement kullanılması,&lt;/li&gt;
&lt;li&gt;Managed servis keşif tekniği vb...&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bu konularıda ilerleyen yazılarımızda ele almaya &amp;ccedil;alışıyor olacağım. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f8%2fAdHocDiscovery.rar"&gt;AdHocDiscovery.rar (51,72 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-08-18 09:23:00</pubDate>
  <slug>wcf40-Yenilikleri-Ad-Hoc-WS-Discovery</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-40</tag>
  </tags>
  <categories>
    <category>WCF 4.0 Beta 1</category>
  </categories>
</post>