<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ruby Tarafından Redis(Docker Bazlı) Veritabanı ile Konuşmak</title>
  <description>Nihayet Ahch-To(MacOS Mojave - Intel Core i5 1.4Ghz, 4 Gb 1600 Mhz DDR3) üzerinde ki ilk çalışmamı gerçekleştirebildim. 2020 yılı için planlarım arasında yer alan kendimi yetiştirme turları kapsamında çıktığım bu ilk macerada epeydir eğilmediğim Ruby kodları ile tekrar bir aradayım. Bu ilk maceradaki amacım Ruby kodlama ile docker container üzerinde host edilmiş bir Redis veritabanında basit işlemler yapabilmek.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2019/11/terminatormotorcyle.jpg" alt="" /&gt;Ge&amp;ccedil;tiğimiz yıl kendi kendimi eğitmek &amp;uuml;zere 41 b&amp;ouml;l&amp;uuml;mden oluşan &lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;Saturday-Night-Works&lt;/a&gt; isimli bir &amp;ccedil;alışma yapmıştım. Github &amp;uuml;zerine aldığım notlar ve kod &amp;ouml;rneklerini blog &amp;uuml;zerinde derleyip toparlamak onları pekiştirmek i&amp;ccedil;in &amp;ouml;nemli ve gerekliydi. Ne var ki yetişemediğimiz yazılım teknolojilerindeki gelişmeler i&amp;ccedil;in s&amp;uuml;rekli antrenman yapmam gerekiyor. Bu sebepten araya uzun bir tatil koyup tekrardan enerjimi depolamaya &amp;ccedil;alıştım.&amp;nbsp;Nadas s&amp;uuml;resi&amp;nbsp;boyunca neler yapabileceğimi d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m. Yeni maceramın felsefesi bir &amp;ouml;ncekisi ile aynı olmalıydı. Rastgele ve pek deneyimli olmadığım konularla ilgili araştırma yapıp bunları basit &amp;ouml;rneklerle&amp;nbsp;&amp;ccedil;alışmalı ve dok&amp;uuml;manlaştırmalıydım. Ha geldi gelecek derken nihayet ilham perim beni buldu ve artık tatilimi sonlandırmam gerektiğine karar verdim. Yeni ser&amp;uuml;venime&amp;nbsp;SkyNet&amp;nbsp;evrenindeki Ahch-To&lt;em&gt;(MacOS Mojave - Intel Core i5 1.4Ghz, 4 Gb 1600 Mhz DDR3)&lt;/em&gt; gezegeninde&amp;nbsp;başlıyorum. Orada&amp;nbsp;ge&amp;ccedil;irdiğim&amp;nbsp;bir&amp;nbsp;saat d&amp;uuml;nya zamanında birka&amp;ccedil; g&amp;uuml;ne denk geliyor.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;yleyse gelin size ilk g&amp;uuml;n başımdan ge&amp;ccedil;enleri anlatayım. Bu ilk macerada epeydir eğilmediğim Ruby kodları ile tekrar bir aradayım. Amacım Ruby ile docker container &amp;uuml;zerinde host edilmiş bir Redis veritabanında basit işlemler yapabilmek. Daha &amp;ouml;nce birka&amp;ccedil; NoSQL sistemini deneyimle fırsatım olmuştu. Ancak MacOS &amp;uuml;zerinde docker kullanımı konusunda tecr&amp;uuml;beli değildim. Ruby kodlamayı ve Redis'in temel veri tipleriniyse &amp;ccedil;oktan unuttum. Dolayısıyla benim i&amp;ccedil;in bilgi pekiştirmek a&amp;ccedil;ısından iyi bir g&amp;uuml;n olacağını d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum.&lt;/p&gt;
&lt;p&gt;Redis, In-Memory NoSQL veritabanı sistemlerinden birisi olarak karşımıza &amp;ccedil;ıkıyor. T&amp;uuml;m veriyi bellekte saklayıp sorguladığından epeyce hızlı&lt;em&gt;(Metrik değerlere bakmak lazım)&lt;/em&gt; Key-Value&lt;em&gt;(Tuple Store)&lt;/em&gt; tipinden bir veritabanı olup hash, list, set, sorted-set ve &lt;a href="https://redis.io/topics/data-types" target="_blank"&gt;string tiplerinden &lt;/a&gt;oluşan zengin bir veri yapısına sahip. Dağıtılabilir caching stratejilerinde, otomatik tamamlama &amp;ouml;zelliklerine ait &amp;ouml;nerilerin hızla getirilmesinde, aktif kullanıcı oturumlarının takibinde, iş kuyruklarının modellenmesinde&lt;em&gt;(publisher/subscriber t&amp;uuml;revli)&lt;/em&gt;&amp;nbsp;etkili bir NoSQL &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; olarak tercih ediliyor.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bu temel bilgilere ek olarak CAP&lt;em&gt;(Consistency, Availability, Partition Tolerance)&lt;/em&gt; &amp;uuml;&amp;ccedil;geninin CP kenarında yer aldığını s&amp;ouml;ylemeliyiz.&amp;nbsp;CAP teoremindeki harflerin anlamlarını kısaca hatırlayalım mı? Dağıtık bir sistemde Consistency ilkesine g&amp;ouml;re t&amp;uuml;m istemciler verinin her zaman aynı g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml;ne ulaşır. Pi'nin değeri bir istemci tarafından 3.14 olarak belirlenmişse diğer istemciler Pi'ye baktıklarında bu&amp;nbsp;sayıyı g&amp;ouml;r&amp;uuml;r. Availability ilkesi t&amp;uuml;m istemcilerin dağıtık sistem &amp;uuml;zerinde her&amp;nbsp;an okuma ve yazma yapabiliyor olmasını &amp;ouml;ng&amp;ouml;r&amp;uuml;r. Partition ilkesine g&amp;ouml;re node'larda fiziki olarak kopma meydana gelse bile sistem kullanılabilir durumda kalmalıdır. Tabii en &amp;ouml;nemli nokta şudur ki CAP teoremine g&amp;ouml;re dağıtık bir sistem bu &amp;uuml;&amp;ccedil; unsuru aynı anda karşılayamaz. S&amp;uuml;rprizzzz :) &amp;Ccedil;ok sık g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z CAP &amp;uuml;&amp;ccedil;genini aklımızda kaldığı kadarıyla &amp;ccedil;izmeye &amp;ccedil;alışırsak bilgileri biraz daha pekiştirmiş oluruz. &amp;Ouml;rneğin aşağıdaki gibi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/11/screenshot_5.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu kısa bilgilerden sonra &amp;ouml;rneklerimizi geliştirmeye başlamaya ne dersiniz!?&lt;/p&gt;
&lt;h2&gt;İlk Adımlar&lt;/h2&gt;
&lt;p&gt;&amp;Ouml;ncelikle Redis Docker imajını ayağa kaldırıp ping atmamız gerekiyor. Sistemde docker y&amp;uuml;kl&amp;uuml;yse aşağıdaki komutlardan yararlanılabilir.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;docker pull redis
docker run --name london --network host -d redis redis-server --appendonly yes
docker run -it --network host --rm redis redis-cli -h localhost
ping

docker stop london
docker container rm 0793a&lt;/pre&gt;
&lt;p&gt;İlk komut ile redis imajının son s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; indiriyoruz. Buradaki appendonly anahtarına verilen değer sebebiyle dataset &amp;uuml;zerinde yapılan her değişiklik fiziki diskte kalıcı hale getirilecektir&lt;em&gt;(&lt;a href="https://redis.io/topics/persistence" target="_blank"&gt;Persistance detayları i&amp;ccedil;in şuraya bakabiliriz&lt;/a&gt;)&lt;/em&gt; İkinci komutla container'ı&amp;nbsp;başlatıp ardından gelen&amp;nbsp;ile redis-cli terminal aracını devreye&amp;nbsp;alarak redis ortamına bağlanıyoruz. ping karşılığında PONG mesajını g&amp;ouml;rmemiz redis'in &amp;ccedil;alıştığının işaretidir. Dilerseniz buradayken de Redis&amp;nbsp;ortamını&amp;nbsp;deneyimleyebilirsiniz. Son komutlar opsiyonel olmakla birlikte Docker container'ını durdurmak ve kaldırmak i&amp;ccedil;in kullanılır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/11/screenshot_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Docker container'ı varsayılan olarak localhost:6379&amp;nbsp;adresinden hizmet vermektedir. Proje iskeletini oluşturmak i&amp;ccedil;in ben kendi sistemimde aşağıdaki terminal komutlarını kullandım.&amp;nbsp;Diğer yandan &amp;ouml;rnek kodlarımızı ruby ile geliştireceğiz ancak Redis ile konuşabilmemizi kolaylaştıracak bir pakete de&lt;em&gt;(gem diyoruz)&lt;/em&gt; ihtiyacımız olacak.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;mkdir src
cd src
touch main.rb publisher.rb subscriber.rb dessert.rb

sudo gem install redis&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/11/screenshot_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Son satırda yer alan install komutu ile redis isimli gem paketini sisteme dahil etmiş oluyoruz.&lt;/p&gt;
&lt;h2&gt;Kod Tarafı&lt;/h2&gt;
&lt;p&gt;&amp;Ouml;ğretide &amp;uuml;&amp;ccedil; farklı uygulama s&amp;ouml;z konusu.&amp;nbsp;İlk &amp;ouml;rnek ruby kodlarından Redis'e bağlanıp &amp;ccedil;ok basit bir ka&amp;ccedil; işlemin nasıl icra edildiğini g&amp;ouml;stermekte. Ağırlıklı olarak Redis veri tiplerinin genel kullanımları s&amp;ouml;z konusu. Kodlarda yer alan yorum satırlarında m&amp;uuml;mk&amp;uuml;n mertebe ne yaptığımızı a&amp;ccedil;ıklamaya &amp;ccedil;alıştım.&lt;/p&gt;
&lt;p&gt;main.rb i&amp;ccedil;eriği&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require 'redis' # redis gem'ini kullanacağımızı belirttik

redis=Redis.new(host:"localhost")
#redis.ping()

redis.set("aloha",1001) # &amp;ouml;rnek key:value ekledik
word=redis.get("aloha") # eklediğimizi alıp 

puts word # ekrana bastırdık

# List kullanımına &amp;ouml;rnekler

redis.del('user_actions') # &amp;ouml;nce user_actions ve tutorial_list listelerini temizleyelim
redis.del('tutorial_list')

# Right Push
redis.rpush('user_actions','Naycıl login olmayı deniyor')
redis.rpush('user_actions','şifre hatalı girildi')
redis.rpush('user_actions','Naycıl giriş yaptı')
redis.rpush('user_actions','Naycıl alışveriş sepetine bakıyor')
redis.rpush('user_actions','Naycıl sepetten 19235123A kodlu &amp;uuml;r&amp;uuml;n&amp;uuml; &amp;ccedil;ıkarttı')

p redis.lrange('user_actions',0,-1) # t&amp;uuml;m listeyi ilk girişten itibaren getirir

redis.ltrim('user_actions',-1,-1) # son elemana kadar olan liste elemanlarını &amp;ccedil;ıkarttık
puts ''
p redis.lrange('user_actions',0,-1)

puts ''

#Left Push
redis.lpush('tutorial_list','redis')
redis.lpush('tutorial_list','mongodb')
redis.lpush('tutorial_list','ruby on rails')
redis.lpush('tutorial_list','golang')

p redis.lrange('tutorial_list',0,-1)

# Set Kullanımına &amp;Ouml;rnekler

redis.del('cenifer-friends')
redis.del('melinda-friends')

redis.sadd('cenifer-friends','semuel')
redis.sadd('cenifer-friends','nora')
redis.sadd('cenifer-friends','mayki')
redis.sadd('cenifer-friends','lorel')
redis.sadd('cenifer-friends','bill')

redis.sadd('melinda-friends','mayki')
redis.sadd('melinda-friends','ozi')
redis.sadd('melinda-friends','bill')
redis.sadd('melinda-friends','t&amp;ouml;rnır')
redis.sadd('melinda-friends','sementa')
redis.sadd('melinda-friends','kıris')

puts ''
p redis.smembers('cenifer-friends')
puts ''
p redis.smembers('melinda-friends')
puts ''
p redis.sinter('cenifer-friends','melinda-friends') # Yukarıdaki iki k&amp;uuml;menin kesiştiği elemanları verir
puts ''
p redis.srandmember('melinda-friends') # her srandmember &amp;ccedil;ağrısı k&amp;uuml;meden rastgele bir elemanı d&amp;ouml;nd&amp;uuml;r&amp;uuml;r
p redis.srandmember('melinda-friends')

# Sorted Set &amp;ouml;rnekleri

redis.del('best-players-of-the-week')
# haftanın oyuncularını ağırlık puanlarına g&amp;ouml;re ekledik
redis.zadd('best-players-of-the-week',32,'maykıl cordın')
redis.zadd('best-players-of-the-week',24,'skati pipın')
redis.zadd('best-players-of-the-week',32,'leri b&amp;ouml;rd')
redis.zadd('best-players-of-the-week',21,'con staktın')

puts ''
puts redis.zrevrange('best-players-of-the-week',0,-1) # en y&amp;uuml;ksek skor puanından en k&amp;uuml;&amp;ccedil;&amp;uuml;ne doğru getirir (rev hecesine dikkat)
puts '' 
puts redis.zrevrange('best-players-of-the-week',0,0) # en iyi skora sahip olanı getirir (rev hecesine dikkat)
puts ''
puts redis.zrangebyscore('best-players-of-the-week',20,30) # skorları 20 ile 30 arasında olanlar&lt;/pre&gt;
&lt;p&gt;İkinci &amp;ouml;rnek biraz daha kapsamlı olup publish/subscribe modelinin uyarlamasını ele alıyor. Publisher g&amp;ouml;revini &amp;uuml;stlenen uygulama sembolik olarak belirli aralıklarla broadcast yayını yapar ve game-info-101 ve game-info-102 kodlu kannalar &amp;uuml;zerinden mesajlar yollar. Bu kanalları dinleyen aboneler yayınlanan mesajları g&amp;ouml;rebilir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;publisher.rb i&amp;ccedil;eriği&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require 'redis'

puts 'Ma&amp;ccedil; bilgileri g&amp;ouml;nderiliyor...'
redis=Redis.new(host:"localhost") #Redis sunucusuna bağlan

redis.publish 'game-info-101','Harden &amp;uuml;&amp;ccedil; sayılık basket. Skor 92-92' # bir mesaj fırlat
redis.publish 'game-info-102','Furkan top &amp;ccedil;alma, hızlı h&amp;uuml;cum ve basket. Skor 2-0'
sleep 16
redis.publish 'game-info-102','Joel Embit blog. Skor 2-0'
sleep 14 # 14 saniye bekle
redis.publish 'game-info-101','Don&amp;ccedil;i&amp;ccedil; harika bir assist yapıyor ve Maksi Kleber smacı vuruyor. Skor 92-94'
sleep 22 # 22 saniye bekle
redis.publish 'game-info-101','Dallas son bir molaya gidiyor'
sleep 60 # 1 dakika bekle
redis.publish 'game-info-101','exit' # aboneler, bu kanal i&amp;ccedil;in aboneliklerini sonlandırabilir
redis.publish 'game-info-102','exit'

puts 'Program sonu'&lt;/pre&gt;
&lt;p&gt;subscriber.rb i&amp;ccedil;eriği&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require 'redis'

channelName=ARGV[0] # komut satırında kanal bilgisini al

redis=Redis.new(host:"localhost") #Redis sunucusuna bağlan

begin
    # game-info-101 isimli olaya abone ol
    redis.subscribe channelName do |on|

    on.subscribe do |channel,msg| # abonelik ger&amp;ccedil;ekleşince &amp;ccedil;alışır
        puts "#{channel} kanalına abone olundu"
    end
    
    on.message do |channel, msg| # mesaj gelince &amp;ccedil;alışır
      puts "#{channel} -&amp;gt; #{msg}" # mesajı ekrana bastır
      redis.unsubscribe if msg=="exit" # eğer mesaj bilgisi exit olarak geldiyse aboneliği sonlandır
    end

    on.unsubscribe do |channel,msg| # abonelik sonlandığında &amp;ccedil;alışır
        puts "#{channel} kanalına abonelik sonlandırıldı"
    end
end
rescue redis::BaseConnectionError =&amp;gt; err # bir bağlantı hatası sorunu olursa 3 saniye i&amp;ccedil;inde tekra bağlanmaya &amp;ccedil;alışılır
    puts "#{err}, 3 saniye i&amp;ccedil;inde tekrar deneyeceğim"
    sleep 3
    retry
end&lt;/pre&gt;
&lt;p&gt;&amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; ve son &amp;ouml;rnek ise bir SQL tablosunun Redis d&amp;uuml;nyasında kabaca nasıl tarif edilebileceği ile alakalıdır. Olayı karakterize etmek i&amp;ccedil;in aşağıdaki g&amp;ouml;rseli ele alabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/11/screenshot_6.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Player isimli bir tablomuz olduğunu d&amp;uuml;ş&amp;uuml;nelim. Bu tip bir veri yığınını Redis'in deneysel dok&amp;uuml;manlarına g&amp;ouml;re sağ taraftaki gibi tariflemek m&amp;uuml;mk&amp;uuml;n. Hash ve Sorted Set'ler tablo ve Select sorgusunu karşılayabilir niteliktedir. &amp;Ouml;rneğin oyuncuların skorlarına g&amp;ouml;re sıralanacağı bir listeyi Sorted Set nesnesi gibi d&amp;uuml;ş&amp;uuml;nebilir ve belli bir puan aralığındakilerin listesinin sıralı olarak &amp;ccedil;ekilmesini sağlayabiliriz. Bu deneyselliği ele aldığımız Dessert.rb dosyasının i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require "redis"

redis=Redis.new(host:"localhost")

# Hash i&amp;ccedil;erisine birka&amp;ccedil; player &amp;ouml;rneği ekliyoruz
redis.hmset("player:1","fullname","Baz Layt Yiır","country","moon","score",339)
redis.hmset("player:2","fullname","Mega maynd","country","mars","score",317)
redis.hmset("player:5","fullname","Payn payn laki lu","country","wild west","score",405)
redis.hmset("player:3","fullname","Aeyrın Vaykovski","country","poland","score",322)
redis.hmset("player:4","fullname","Bileyd Rut","country","saturn","score",185)

# hgetall metoduna verdiğimiz parametre ile player:3 veri setini &amp;ccedil;ekip ekrana bastırıyoruz
# Select'in where koşulu gibi d&amp;uuml;ş&amp;uuml;nelim
player3=redis.hgetall("player:3")
puts "#{player3}\n\n"

# hmget ile player:2 key i&amp;ccedil;eriğinden sadece country ve fullname değerlerini yazdırıyoruz
puts "#{redis.hmget('player:2','country','fullname')}\n\n"

# bir sorted list oluşturuyoruz
# listeyi yukarudaki hash &amp;uuml;zerinden oluşturmak i&amp;ccedil;in player:* desenine uygun olan key i&amp;ccedil;eriklerini &amp;ccedil;ekmemiz lazım
# scan_each metodunun match parametresi bunu sağlıyor
redis.scan_each(:match=&amp;gt;"player:*"){|key|
    currentScore=redis.hmget(key,"score") #hmget metoduna iterasyondaki key değerini verip score bilgisini yakalıyoruz
    redis.zadd("score_list",currentScore,key) # score bilgisini o anki key ile ilişkilendirerek sorted list nesnesine ekliyoruz
}

# sorted list i&amp;ccedil;in skoru 330 puanın altına olanların listesini &amp;ccedil;ektik (Select'in where koşulu gibi d&amp;uuml;ş&amp;uuml;nelim)
scores_under_330=redis.zrangebyscore("score_list",0,330)

puts "Skoru 0 ile 330 arasında olanlar\n\n"
# bulduğumuz listede dolaşıp sadece fullname bilgilerini ekrana bastırdık
scores_under_330.each do |plyr|
    info=redis.hgetall(plyr)
    puts "#{info['fullname']} i&amp;ccedil;in g&amp;uuml;ncel skor değeri #{info['score']}"
end&lt;/pre&gt;
&lt;h2&gt;&amp;Ccedil;alışma Zamanı&lt;/h2&gt;
&lt;p&gt;Kod tarafını tamamladıysak &amp;ccedil;alışma zamanına ge&amp;ccedil;ebiliriz. Main.rb ile birlikte diğer &amp;ouml;rnekleri de incelemeye başlayalım.&lt;/p&gt;
&lt;h3&gt;Başlangı&amp;ccedil;&lt;/h3&gt;
&lt;p&gt;&amp;Ouml;ncelikle Redis container'ını başlatmalıyız. Bunun i&amp;ccedil;in aşağıdaki terminal komutları ile ilerleyebiliriz.&amp;nbsp;İlk komut docker container'ını &amp;ccedil;alıştırıyor. İkinci komut kontrol ama&amp;ccedil;lı olarak container listesine bakmak i&amp;ccedil;in. Son terminal komutumuz tahmin edileceği &amp;uuml;zere main.rb isimli ruby&amp;nbsp;dosyasını&amp;nbsp;y&amp;uuml;r&amp;uuml;t&amp;uuml;yor.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;docker run -d -p 6379:6379 redis
docker container ps -a
ruby main.rb&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/11/screenshot_3.png" alt="" /&gt;&lt;/p&gt;
&lt;h3&gt;Ana Yemek&lt;/h3&gt;
&lt;p&gt;Yemek olarak publisher soslu subscriber'ımız var. &amp;Uuml;stelik en &amp;uuml;nl&amp;uuml; İtalyan şeflerinden Rizotta Galliani tarafından &amp;ouml;zenle hazırlandı :P Sizi ciddiyete davet ediyorum Burak Bey. En az 3 terminal ekranı a&amp;ccedil;ıp birisinde publisher.rb diğer ikisinde de subscriber.rb dosyalarını dinleyecekleri kanalları parametre olarak verip &amp;ccedil;alıştırmak sonu&amp;ccedil;ları irdelememiz i&amp;ccedil;in yeterlidir. Aynen aşağıdaki gibi.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;ruby subscriber.rb 'game-info-1'
ruby subscriber.rb 'game-info-2'
ruby publisher.rb&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/11/screenshot_4.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere aboneler program başlatılırken bağlanacakları kanalın adını belirtiyor. Bu nedenle her ikisi de farklı ma&amp;ccedil; akışlarını dinlemekteler. Pek tabii bir abonenin birden fazla kanalı dinlemesi de m&amp;uuml;mk&amp;uuml;n. Kurgumuz burada olduk&amp;ccedil;a basit ve senkron kaldı. N sayıda ma&amp;ccedil;a ait haber akışını paylaşabileceğiniz bir publisher uygulamasını nasıl yazarsınız bir d&amp;uuml;ş&amp;uuml;n&amp;uuml;n.&lt;/p&gt;
&lt;h3&gt;Tatlı&lt;/h3&gt;
&lt;p&gt;Tatlı olarak bir SQL tablosunun Redisce yorumlanması var. Aşağıdaki terminal komutu ile &amp;ouml;rneğimizi &amp;ccedil;alıştıralım ve sonu&amp;ccedil;ları&amp;nbsp;sınıf&amp;ccedil;a irdeleyelim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;ruby dessert.rb&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/11/screenshot_7.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Pek tabii SQL'in Domain'e &amp;ouml;zg&amp;uuml; yazılmış lisanında SELECT, WHERE gibi ifadeleri kullanarak istenilen sorguları &amp;ccedil;alıştırmak &amp;ccedil;ok daha kolay. Lakin yine de Redis d&amp;uuml;nyasında bu tip bir yaklaşımı nasıl ele alabiliriz sonu&amp;ccedil;lardan g&amp;ouml;rebiliyoruz. Bunun farklı varyasyonlarını LINQ&lt;em&gt;(LanguageINtegratedQuery)&lt;/em&gt; gibi yapılarda da g&amp;ouml;rmemiz m&amp;uuml;mk&amp;uuml;n. Elimizde bir liste ve i&amp;ccedil;erisinde veri tutan nesnelerimiz varken filtrelemeler i&amp;ccedil;in&amp;nbsp;koddakine benzer yaklaşımları kullanıyoruz.&amp;nbsp;&lt;/p&gt;
&lt;h3&gt;Tamamlarken&lt;/h3&gt;
&lt;p&gt;Eğer kullandığımız Redis Container'ı ile işimiz bittiyse &amp;ouml;nce durdurup sonrasında sistemden kaldırmak isteyebiliriz. Bunun i&amp;ccedil;in aşağıdaki terminal komutlarını &amp;ccedil;alıştırmak yeterli olacaktır&lt;em&gt;(Muhtemelen sizdeki Names değeri farklı olur. Ben &amp;ccedil;alışırken rastgele interesting_nobel ismi atanmıştı)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;docker container ps -a
docker stop interesting_nobel
docker container rm interesting_nobel
docker container ps -a&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/11/screenshot_8.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Neler &amp;Ouml;ğrendim?&lt;/h2&gt;
&lt;p&gt;&lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;Saturday-Night-Works&lt;/a&gt; &amp;ccedil;alışmalarında olduğu gibi yeni başladığım SkyNet ser&amp;uuml;veni de bana bir&amp;ccedil;ok şey &amp;ouml;ğreteceğe/hatırlatacağa benziyor. Bu ilk macerada aklımda kalanları ş&amp;ouml;yle &amp;ouml;zetleyebilirim.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Redis docker imajını MacOS &amp;uuml;zerinde kullanmayı&lt;/li&gt;
&lt;li&gt;Redis'in CAP teoreminde hangi ikiliye yakın olduğunu&lt;/li&gt;
&lt;li&gt;Redis gem'ini kullanarak yapılabilecek temel işlemleri&lt;/li&gt;
&lt;li&gt;Temel redis veri tiplerini&lt;/li&gt;
&lt;li&gt;Basit bir pub/sub kurgusunu işletmeyi&lt;/li&gt;
&lt;li&gt;SQL stilinde bir tablonun Redisce oluşturulmasını ve verinin filtrelenmesini&lt;/li&gt;
&lt;li&gt;Bir hash i&amp;ccedil;indeki t&amp;uuml;m key değerlerini nasıl dolaşabileceğimi&lt;/li&gt;
&lt;/ul&gt;
&lt;h2&gt;Eksikliği Hissedilen Konular&lt;/h2&gt;
&lt;p&gt;SkyNet'in ilk g&amp;uuml;n&amp;uuml;nden kalan ve merak ettiğim şeyler de var. Bunlar siz değerli okurlarımın araştırabileceği konular arasında yer alıyor. B&amp;ouml;l&amp;uuml;m sonu soruları gibi d&amp;uuml;ş&amp;uuml;nebilirsiniz :)&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Publisher tarafında farklı kanalların birbirinden bağımsız ve asenkron olarak yayın yapmasını nasıl sağlayabiliriz?&lt;/li&gt;
&lt;li&gt;Subscriber olarak birden fazla kanala abone olabilir miyim?&lt;/li&gt;
&lt;li&gt;Olmayan bir kanala abone olmak istediğimde Ruby &amp;ccedil;alışma zamanı nasıl tepki verir?&lt;/li&gt;
&lt;li&gt;Peki pub/sub senaryosunu Ruby on Rails tabanlı bir web projesinde nasıl kullanırım?&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir SkyNet g&amp;uuml;n&amp;uuml;n&amp;uuml;n sonuna. Zaman farkından dolayı tekrar D&amp;uuml;nya'ya d&amp;ouml;nmek zorundayım.&amp;nbsp;Bir&amp;nbsp;sonraki&amp;nbsp;gidişimde&amp;nbsp;bakalım bizleri&amp;nbsp;ne t&amp;uuml;r maceralar&amp;nbsp;karşılayacak. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2019-12-01 09:45:00</pubDate>
  <slug>ruby-tarafindan-redis-docker-bazli-veritabani-ile-konusmak</slug>
  <tags>
    <tag>redis</tag>
    <tag>nosql</tag>
    <tag>ruby</tag>
    <tag>docker</tag>
    <tag>gem</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>