<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>GoLang - Harici Paket(Package) Yazıp Kullanmak</title>
  <description>Go dilinin paketler üzerine kurulu bir yapısı olduğunu biliyoruz. fmt, math, strings, net/http, time, log, encoding/json ve benzerleri şu kısa go geçmişimde kullandıklarımdan sadece bir kaçı. Geliştirdiğimiz ürünlerde ortak sorumlulukları barındıran fonksiyonellikleri aynı paketler içerisinde toplamak son derece mantıklı.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/01/gopckg_9.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Go dilinin paketler &amp;uuml;zerine kurulu bir yapısı olduğunu biliyoruz. fmt, math, strings, net/http, time, log, encoding/json ve benzerleri şu kısa go ge&amp;ccedil;mişimde kullandıklarımdan sadece birka&amp;ccedil;ı. Geliştirdiğimiz &amp;uuml;r&amp;uuml;nlerde ortak sorumlulukları barındıran fonksiyonellikleri aynı paketler i&amp;ccedil;erisinde toplamak son derece mantıklı. Bu sayede aynı alana ait fonksiyonellikleri bir paket i&amp;ccedil;erisinde toplayıp kullanabilme şansına sahip oluyoruz. Paketler,&amp;nbsp;kodun yeniden kullanılabilirliği(Code Reusability) noktasında da değer bulan bir kavram.&lt;/p&gt;
&lt;p&gt;Go dilini sistemimize y&amp;uuml;klediğimizde zaten beraberinde pek &amp;ccedil;ok paket geliyor ve bu paketler GOPATH ile belirtilen konumdaki src klas&amp;ouml;r&amp;uuml; altında konuşlandırılıyor.&amp;nbsp;&amp;Ouml;rneklerimizde &amp;ccedil;ok sık kullandığımız fmt paketine ait kod dosyalarını src klas&amp;ouml;r&amp;uuml; altından g&amp;ouml;rebilir ve kod i&amp;ccedil;eriğine bakıp Println fonksiyonunun nasıl &amp;ccedil;alıştığını inceleyebiliriz.&amp;nbsp;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Go programlarının &amp;ccedil;alışmaya başladığı main fonksiyonunun da main isimli paket(Package) i&amp;ccedil;erisinde yer aldığını hatırlayalım.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gopckg_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Kendi Paketimizi Yazalım&lt;/h2&gt;
&lt;p&gt;Buna g&amp;ouml;re kendi yazdığımız paketleri src klas&amp;ouml;r&amp;uuml; altına atıp kullanmaya başlayabiliriz. Gelin bu vakayı basit bir &amp;ouml;rnekle incelemeye &amp;ccedil;alışalım. Tabii ilk olarak bir paket yazarak işe başlamamız gerekiyor :) S&amp;ouml;zgelimi i&amp;ccedil;erisinde bir ka&amp;ccedil; metrik d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi barındıran mtrcvrt&lt;em&gt;(Metric Converter diye isimlendirebiliriz)&lt;/em&gt;&amp;nbsp;adlı bir paket geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:groovy;auto-links:false;toolbar:false" contenteditable="false"&gt;package mtrcvrt

//Fahrenheit to Celsius
func FahToCel(f float64) float64{
	return (f-32)/1.8
}

// Celsius to Fahrenheit
func CelToFah(c float64) float64{
	return (c*1.8)+32
}

// Feet to Meter
func FeetToMeter(feet float64) float64{
	return feet/3.2808
}

// Kg to Pound
func KgToPound(kg float64) float64{
	return kg*2.2046
}

// Kilometers to Mile
func KmToMiles(km float64) float64{
	return km*0.621371192
}&lt;/pre&gt;
&lt;p&gt;Yazdığımız paket i&amp;ccedil;erisinde beş fonksiyon bulunuyor. Fahrenheit'dan Celsius'a, Kilogram'dan Pound'a, Kilometre'den Mil'e, Feet'ten metreye ve son olarak Celcius'dan Fahrenheit'a d&amp;ouml;n&amp;uuml;ş&amp;uuml;m işlemlerini i&amp;ccedil;eriyor. Kod paket adıyla başlıyor. Kullandığımız fonksiyonlar float64 tipinden birer parametre almakta ve gerekli form&amp;uuml;ller işletildikten sonra geriye yine float64 tipinden değer d&amp;ouml;nd&amp;uuml;rmekteler. mtrcvrt'yi sistemde herhangibir main paketinden kullanabilmek i&amp;ccedil;in az &amp;ouml;nce bahsettiğimiz src klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisine atmamız yeterli. Pek tabi kaynak kodun mtrcvrt klas&amp;ouml;r&amp;uuml; altında konuşlandırıldığına dikkat edelim&lt;em&gt;(Aynı diğer built-in paketler gibi)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gopckg_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Şunu unutmayalım ki paket i&amp;ccedil;erisindeki fonksiyonların adları ve &amp;ouml;zellikle ilk harfleri &amp;ccedil;ok &amp;ouml;nemli. Eğer b&amp;uuml;y&amp;uuml;k harfle başlamazlarsa paket dışından kullanılamazlar.&amp;nbsp;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Şimdi &amp;ouml;rnek bir program dosyası oluşturup yazdığımız pakete ait fonksiyonellikleri test edelim.&lt;/p&gt;
&lt;pre class="brush:groovy;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	"mtrcvrt"
	)
	
func main(){
	var (
		iFahrenheit=89.0
		iCelsius=36.5
		iFeet=100.0
		iKg=83.50
		iKm=450.0
		)
	
	oCelcius:=mtrcvrt.FahToCel(iFahrenheit)
	fmt.Printf("%f\n",oCelcius)
	
	oFahrenheit:=mtrcvrt.CelToFah(iCelsius)
	fmt.Printf("%f\n",oFahrenheit)
	
	oMeter:=mtrcvrt.FeetToMeter(iFeet)
	fmt.Printf("%f\n",oMeter)
	
	oPound:=mtrcvrt.KgToPound(iKg)
	fmt.Printf("%f\n",oPound)
	
	oMiles:=mtrcvrt.KmToMiles(iKm)
	fmt.Printf("%f\n",oMiles)
}&lt;/pre&gt;
&lt;p&gt;import sekmesinde paketin adını belirttik ve main i&amp;ccedil;erisinde sahip olduğu fonskiyonları birer &amp;ouml;rnekle denedik. var ifadesinde n sayıda değişkene değer ataması ger&amp;ccedil;ekleştiriyoruz ki bunu&amp;nbsp;ilk kez kullandığımı s&amp;ouml;yleyebilirim. Kodun &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı ise aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gopckg_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Yazdığımız paketlerin src klas&amp;ouml;r&amp;uuml; altında olması şart değil. Aslında Go dili klas&amp;ouml;r temelli bir &amp;ccedil;alışma ortamını(Workspace) baz alıyor. Bu ortamda src, bin ve pkg klas&amp;ouml;rleri standart olarak bulunuyor. Paket kodları src klas&amp;ouml;r&amp;uuml; altında konuşlandırılmakta. Go ortamı sisteme y&amp;uuml;klendiğinde bu klas&amp;ouml;r hiyerarşisini kullanıyor. Diğer yandan github gibi &amp;ouml;nemli bir paket deposu da var. Pek &amp;ccedil;ok programlama dilinde olduğu gibi Go ile yazılmış paketleri github'a atabilir ve t&amp;uuml;m geliştiricilerin kullanımına a&amp;ccedil;abiliriz.&amp;nbsp;&lt;/p&gt;
&lt;h2&gt;Github ile Entegrasyon&lt;/h2&gt;
&lt;p&gt;Kaynaklardan &amp;ouml;ğrendiğim kadarı ile Workspace'imizde github i&amp;ccedil;in bir klas&amp;ouml;r ağacı oluşturup senkronize bir şekilde &amp;ccedil;alışabiliriz de. B&amp;ouml;ylece commit, rollback gibi standart kaynak kod y&amp;ouml;netimi işlemlerini ger&amp;ccedil;ekleştirebiliriz. Ben işleri kolaylaştırmak adına &lt;a href="https://desktop.github.com/" target="_blank"&gt;Github Desktop for Windows&lt;/a&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; kullandım. Sistemimde y&amp;uuml;kl&amp;uuml; olan src klas&amp;ouml;r&amp;uuml;nde mtrk olarak isimlendirdiğim paket i&amp;ccedil;in bir repo oluşturdum. Sonrasında kodu hazırlayıp Commit ederek github'a atılmasını sağladım. Bu işlem sonrasında mtrk klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisinde github ile ilgili dosyalar da otomatik olarak oluşturuldu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gopckg_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ardında mtrk.go kod dosyasının commit ederek github'a y&amp;uuml;klenmesini sağladım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gopckg_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Artık bilgisayarımdaki workspace ile github eşleşmiş durumda. Bu yeni yapıdaki paketi kullanmak i&amp;ccedil;in tek yapılması gereken import ifadesini uygun bir şekilde değiştirmek.&lt;/p&gt;
&lt;pre class="brush:groovy;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	"github.com/buraksenyurt/mtrk"
	)&lt;/pre&gt;
&lt;h2&gt;Peki ya diğer kullanıcılar?&lt;/h2&gt;
&lt;p&gt;Onlar bu paketi nasıl kullanabilirler? Yazıya konu ettiğimiz &amp;ouml;rnek&amp;nbsp;i&amp;ccedil;in go get komutunu&amp;nbsp;kullanmamız yeterli aslında. Emin olmak adına&amp;nbsp;sistemimdeki Go Repo'sunu sildim. Daha sonra komut satırından go get komutunu&amp;nbsp;aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi&amp;nbsp;kullandım. Src/github.com/buraksenyurt/mtrk klas&amp;ouml;r&amp;uuml;n&amp;uuml;n oluşuturulduğunu ve i&amp;ccedil;erisine go dosyasının indirildiğini fark ettim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gopckg_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ayrıca pkg klas&amp;ouml;r&amp;uuml;nde paketin derlenmiş dosyasının da oluşturulduğunu g&amp;ouml;rd&amp;uuml;m.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gopckg_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulama kodunu tekrar &amp;ccedil;alıştırdığımda mtrk paketi ve fonksiyonelliklerinin başarılı bir şekilde y&amp;uuml;r&amp;uuml;t&amp;uuml;ld&amp;uuml;ğ&amp;uuml;n&amp;uuml; g&amp;ouml;rd&amp;uuml;m. İşin sağlamasını yapmak i&amp;ccedil;in mtrk.go dosyasını silip deneyebilirsiniz. Benim karşılaştığım sonucu alacaksınız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gopckg_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere Go dilinde paketler ile &amp;ccedil;alışmak olduk&amp;ccedil;a basit. Atladığım pek &amp;ccedil;ok konu olabilir. &amp;Ouml;rneğin paketler y&amp;uuml;klenirken yapılmasını istediğiniz işlemler varsa bunları init fonksiyonu i&amp;ccedil;erisinde ger&amp;ccedil;ekleştirebilirsiniz ki &amp;ouml;rneğimizde buna değinmedik. Paket y&amp;ouml;netimi i&amp;ccedil;in github'ı uzak repository olarak kullanabileceğimizi ve local workspace ile eşleştirerek ilerleyebileceğimizi g&amp;ouml;rd&amp;uuml;k. Bunlara ek olarak&amp;nbsp;bin,src ve pkg klas&amp;ouml;r hiyerarşisinden azda olsa bahsettik. B&amp;ouml;ylece geldik bir Gopher olma maceramızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-01-28 14:42:00</pubDate>
  <slug>harici-paket-yazip-kullanmak</slug>
  <tags>
    <tag>golang</tag>
    <tag>package</tag>
    <tag>package-management</tag>
    <tag>github</tag>
    <tag>go</tag>
  </tags>
  <categories>
    <category>GoLang</category>
  </categories>
</post>