<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Sadece Tarayıcı Kullanarak Web API Servisini Google Cloud Platform Üzerinde Yayınlamak</title>
  <description>Sizi Cumartesi geceme davet etsem...Olmaz mı? Pekiiii...Sadece 15 dakika içerisinde standart bir .Net Core Web API hizmetini Google Cloud Platform üzerine taşıyabileceğinizi söylesem. İlginizi çekmedi mi hala...Pekiiii...Tüm bunları sadece tarayıcı(Chrome, IE, Firefox, Opera, elde ne varsa) ile yapabileceğinizi söylesem :) Sanırım şimdi dikkatinizi çekmiş olmalı.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Sizi Cumartesi&amp;nbsp;gecesi &amp;ccedil;alışma odama davet etsem...Olmaz mı? Pekiiii...Sadece 15 dakika i&amp;ccedil;erisinde standart bir .Net Core Web API hizmetini Google Cloud Platform &amp;uuml;zerine taşıyabileceğinizi s&amp;ouml;ylesem. İlginizi &amp;ccedil;ekmedi mi hala...Pekiiii...T&amp;uuml;m bunları sadece tarayıcı&lt;em&gt;(Chrome, IE, Firefox, Opera, elde ne varsa)&lt;/em&gt; ile yapabileceğinizi s&amp;ouml;ylesem :) Sanırım şimdi dikkatinizi &amp;ccedil;ekmiş olmalı. Bu gece farklı bir &amp;ccedil;alışma denedim.&amp;nbsp;Her Cumartesi olduğu gibi bu Cumartesi gecesi de konsere gitmek yerine West-World &amp;uuml;zerinde dolaşmaya karar verdim. Hafta i&amp;ccedil;inde yaptığım denemelerde Google Cloud Platform &amp;uuml;zerinde &amp;ccedil;eşitli .net core uygulamalarını nasıl yayınlayabileceğimi incelemeye &amp;ccedil;alışmıştım. Google tarafında da işler inanılmaz derecede g&amp;uuml;zeldi.&amp;nbsp;Derken&amp;nbsp;yaptıklarımı yazmak yerine ş&amp;ouml;yle eş zamanlı bir video kaydı halinde tutsam daha iyi olmaz mı diye d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m. Windows'taki Camtasia Studio'yu aramadım desem yeridir ama Ubuntu tarafındaki OBS'de işimi g&amp;ouml;rd&amp;uuml; sayılır. Sonu&amp;ccedil; olarak hataları ve &amp;ouml;zellikle de g&amp;ouml;r&amp;uuml;nmeyen fare imleci ile birlikte Youtube kanalıma y&amp;uuml;kleyebileceğim keyifli bir &amp;ccedil;alışma ortaya &amp;ccedil;ıktı. Konuşma i&amp;ccedil;ermeyen, piyano tınıları eşliğinde s&amp;uuml;regelen sakin bir &amp;ccedil;alışma. Umarım sizler i&amp;ccedil;in faydalı olur.&lt;/p&gt;
&lt;p&gt;&lt;iframe src="https://www.youtube.com/embed/u8cXFh0g_AE" width="560" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Not: Talep sayısının artma ve Free Trial i&amp;ccedil;in verilen paranın bitmesi ihtimaline karşın servis şu anda hizmet dışıdır :) Bilginiz olsun.&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/gconsole.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Peki ne yaptık?&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Chrome ortamını terk etmeden Google Cloud Platform &amp;uuml;zerinde proje oluşturduk.&lt;/li&gt;
&lt;li&gt;Bu proje &amp;uuml;zerinde Cloud Shell'i kullanarak basit bir .Net Core Web API uygulması a&amp;ccedil;tık.&lt;/li&gt;
&lt;li&gt;Uygulama kodlarını Code Editor&lt;em&gt;(Beta s&amp;uuml;r&amp;uuml;m&amp;uuml;nde)&lt;/em&gt; ile d&amp;uuml;zenledik.&lt;/li&gt;
&lt;li&gt;Bir&amp;nbsp;publish&amp;nbsp;işlemi yapıp&amp;nbsp;app.yaml dosyası ile projeyi dağıtıma hazırlandık.&lt;/li&gt;
&lt;li&gt;gCloud aracını kullanaraktan deploy işlemini&lt;/li&gt;
&lt;li&gt;Son aşamada yayınlana servis adresinne giderek sonu&amp;ccedil;ları g&amp;ouml;rd&amp;uuml;k.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&lt;strong&gt;Komutlar&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alışma sırasında kullandığım komutları ise şu şekilde &amp;ouml;zetleyebilirim.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;dotnet --version &lt;em&gt;(dotnet s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; &amp;ouml;ğrendik ki 2.1.3 olmuştu. Restore işleminde biraz sorun oluşturdu)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;dotnet new webapi -o PlanetAPI &lt;em&gt;(webapi şablon projesini oluşturduk)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;dotnet publish -c Release &lt;em&gt;(uygulamayı publish etmek i&amp;ccedil;in kullandık)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;gcloud app deploy --version v1 &lt;em&gt;(uygulamamızın App Engine' taşınmasını sağladık. Bunu publish edilen paketin olduğu yerde &amp;ccedil;alıştırdık.)&lt;/em&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Google Cloud Platform tarafı epey hoş. AWS'den sonra burada da farklı bir deneyim yaşadığımı ifade edebilirim. İlerleyen zamanlarda GCP tarafı ile ilgili bir şeyler de yazmaya &amp;ccedil;alışacağım. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2018-01-14 00:44:00</pubDate>
  <slug>sadece-tarayici-kullanarak-web-api-servisini-google-cloud-platform-uzerinde-yayinlamak</slug>
  <tags>
    <tag>net-core-20</tag>
    <tag>web-api</tag>
    <tag>google-app-engine</tag>
    <tag>google-cloud-platform</tag>
    <tag>cloud-computing</tag>
    <tag>c#</tag>
    <tag>docker</tag>
    <tag>app-engine</tag>
    <tag>rest</tag>
    <tag>rest-api</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
  </categories>
</post>