<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF 4.0 Yenilikleri - Standard Endpoints [Beta 1]</title>
  <description>Bir süredir WCF 4.0 ile birlikte gelen yenilikleri tek tek incelemeye çalışıyoruz. İlk incelediğimiz noktalar konfigurasyon ayarları üzerinde yapılmış olan basitleştirmeleri içermektedir. Bu değişimlerden bir diğerini inceleyerek serimize devam ediyor olacağız. Bu anlamda konumuz Standard Endpoints başlığı altında gelen yeniliklerdir. Bu özelliği inceledikten sonra konuyu anlamanın en iyi yolunun bir önceki versiyonda ne olduğuna bakmak olduğuna karar verdim.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir s&amp;uuml;redir &lt;strong&gt;WCF 4.0&lt;/strong&gt; ile birlikte gelen yenilikleri tek tek incelemeye &amp;ccedil;alışıyoruz. İlk incelediğimiz noktalar konfigurasyon ayarları &amp;uuml;zerinde yapılmış olan basitleştirmeleri i&amp;ccedil;ermektedir. Bu değişimlerden bir diğerini inceleyerek serimize devam ediyor olacağız. Bu anlamda konumuz &lt;strong&gt;Standard Endpoints &lt;/strong&gt;başlığı altında gelen yeniliklerdir. Bu &amp;ouml;zelliği inceledikten sonra konuyu anlamanın en iyi yolunun bir &amp;ouml;nceki versiyonda ne olduğuna bakmak olduğuna karar verdim.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Senaryomuza g&amp;ouml;re &lt;strong&gt;Http&lt;/strong&gt; &amp;uuml;zerinden sunulan bir servis i&amp;ccedil;in &lt;strong&gt;mexHttpBinding&lt;/strong&gt; &lt;strong&gt;bağlayıcı tipini(Binding Type)&lt;/strong&gt;&amp;nbsp;kullanarak &lt;strong&gt;Metadata Publishing&lt;/strong&gt; işlemini ger&amp;ccedil;ekleştiriyoruz. Bir başka deyişle servisi ne yaptığı ve bunu hangi operasyonlar ile tanımladığı bilgisini istemcilere a&amp;ccedil;ıyoruz.&amp;nbsp;Metadata &amp;uuml;zerinden publishing işleminde anahtar noktanın servis s&amp;ouml;zleşmesi olarak &lt;strong&gt;IMetadataExchange&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; kullanmak olduğunu bilmekteyiz. &lt;em&gt;(Tabi doğrudan IIS &amp;uuml;zerinden host edilen bir WCF servisi yazmıyorsak.)&lt;/em&gt; Bunu aklımızın bir k&amp;ouml;şesinde tutalım. Şimdi &amp;ouml;rneğimize ait konfigurasyon dosyasını aşağıdaki gibi geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim&lt;em&gt;&lt;strong&gt;(İlk &amp;ouml;rneğimizi .Net Framework 3.5 tabanlı olarak geliştirdiğimizi hatırlatalım.)&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;behaviors&amp;gt;
            &amp;lt;serviceBehaviors&amp;gt;
                &amp;lt;behavior name="AdventureServiceBehavior"&amp;gt;
                    &amp;lt;serviceMetadata /&amp;gt;
                &amp;lt;/behavior&amp;gt;
            &amp;lt;/serviceBehaviors&amp;gt;
        &amp;lt;/behaviors&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service behaviorConfiguration="AdventureServiceBehavior" name="PreviousVersion.AdventureService"&amp;gt;
                &amp;lt;endpoint address="" binding="basicHttpBinding" bindingConfiguration=""
                    name="EndPoint1" contract="PreviousVersion.IAdventure" /&amp;gt;
                &amp;lt;endpoint address="Mex" binding="mexHttpBinding" bindingConfiguration="" name="MexEndpoint" contract="IMetadataExchange" /&amp;gt;
                &amp;lt;host&amp;gt;
                    &amp;lt;baseAddresses&amp;gt;
                        &amp;lt;add baseAddress="http://localhost:5001/AdventureService" /&amp;gt;
                    &amp;lt;/baseAddresses&amp;gt;
                &amp;lt;/host&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Konfigurasyon dosyasında dikkat etmemiz gereken bir takım noktalar olduğu a&amp;ccedil;ıktır. &lt;strong&gt;MexEndpoint&lt;/strong&gt; isimli &lt;strong&gt;Endpoint&lt;/strong&gt; i&amp;ccedil;erisinde yer alan&amp;nbsp;&lt;strong&gt;contract&lt;/strong&gt; niteliğinin değerini &lt;strong&gt;case-sensitive&lt;/strong&gt; olarak doğru s&amp;ouml;zleşme tipini&lt;strong&gt;(Contract Type)&lt;/strong&gt;&amp;nbsp;işaret edecek şekilde yazmalıyız.&amp;nbsp;Bağlayıcı tip olarak &lt;strong&gt;mexHttpBinding&lt;/strong&gt; tipini belirtmeliyiz; nitekim &lt;strong&gt;base address&lt;/strong&gt; ve &lt;strong&gt;EndPoint1&lt;/strong&gt; bilgilerine g&amp;ouml;re &lt;strong&gt;BasicHttp&lt;/strong&gt; bazlı bir yayınlama yapmaktayız. Bunlara ek olarak, &lt;strong&gt;serviceMetadata&lt;/strong&gt; niteliğinin bir &lt;strong&gt;servis davranışı (Service Behavior)&lt;/strong&gt; olarak mutlaka bildirilmesi gerekmektedir. Aslında &lt;strong&gt;NetTcp&lt;/strong&gt; kullansaydıkta metadata s&amp;ouml;zleşmesi olarak &lt;strong&gt;IMetadataExchange&lt;/strong&gt; tipini belirtmemiz gerekiyordu. İlerlemeden &amp;ouml;nce servisimize ait &amp;ouml;rnek kod i&amp;ccedil;eriği aşağıdaki gibi geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace PreviousVersion
{
    [ServiceContract]
    interface IAdventure
    {
        [OperationContract]
        double GetLowestPrice(int category);
    }
    class AdventureService
        : IAdventure
    {
        public double GetLowestPrice(int category)
        {
            return 100;
        }
    }

    class Program
    {
        static void Main(string[] args)
        {
            ServiceHost host = new ServiceHost(typeof(AdventureService));

            host.Open();

            Console.WriteLine("Service durumu {0}\nKapatmak i&amp;ccedil;in bir tuşa basın.", host.State.ToString());
            Console.ReadLine();

            host.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Buna g&amp;ouml;re servis uygulamamız &amp;ccedil;alışıyorken, istemciler &lt;strong&gt;proxy&lt;/strong&gt; i&amp;ccedil;eriklerini &amp;uuml;retebilmek i&amp;ccedil;in &lt;strong&gt;metadata&lt;/strong&gt; bilgilerini ulaşabilecektir. Aynen aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi. &lt;em&gt;(Dikkat edileceği &amp;uuml;zere servis &amp;ccedil;alıştırıldıktan sonra &lt;strong&gt;Visual Studio&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;Add Service Reference&lt;/strong&gt; iletişim penceresi ile geliştirilen servisin metadata bilgilerine ulaşılabilmektedir.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg63_PreviousAddRef.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi &lt;strong&gt;WCF 4.0&lt;/strong&gt; a&amp;ccedil;ısından duruma bakalım. Yeni gelen &lt;strong&gt;Standard Endpoints&lt;/strong&gt; &amp;ouml;zelliğine g&amp;ouml;re, &amp;ouml;nceden tanımlanmış ve pek &amp;ccedil;ok standart &amp;ouml;zelliği set edilmiş bazı &lt;strong&gt;Endpoint&lt;/strong&gt; tanımlamaları gelmektedir. &amp;Ouml;rneğin &lt;strong&gt;Metadata Publishing&lt;/strong&gt; sisteminde, &lt;strong&gt;IMetadataExchange&lt;/strong&gt; kullanımı bir standarttır. Bu nedenle &lt;strong&gt;mexEndpoint&lt;/strong&gt; isimli tipi kullanarak yukarıdaki &amp;ouml;rneği aşağıdaki config i&amp;ccedil;eriği ile &lt;strong&gt;WCF 4.0&lt;/strong&gt; &amp;uuml;zerinde ger&amp;ccedil;ekleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
  &amp;lt;system.serviceModel&amp;gt;
    &amp;lt;behaviors&amp;gt;
      &amp;lt;serviceBehaviors&amp;gt;
        &amp;lt;behavior&amp;gt;
          &amp;lt;serviceMetadata/&amp;gt;
        &amp;lt;/behavior&amp;gt;
      &amp;lt;/serviceBehaviors&amp;gt;
    &amp;lt;/behaviors&amp;gt;
    &amp;lt;services&amp;gt;
      &amp;lt;service name="PreviousVersion.AdventureService"&amp;gt;
        &amp;lt;endpoint address="" binding="basicHttpBinding" name="EndPoint1" contract="PreviousVersion.IAdventure" /&amp;gt;
        &amp;lt;endpoint kind="mexEndpoint" address="Mex" /&amp;gt;
        &amp;lt;host&amp;gt;
          &amp;lt;baseAddresses&amp;gt;
            &amp;lt;add baseAddress="http://localhost:5002/AdventureService" /&amp;gt;
          &amp;lt;/baseAddresses&amp;gt;
        &amp;lt;/host&amp;gt;
      &amp;lt;/service&amp;gt;
    &amp;lt;/services&amp;gt;
  &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;endpoint &lt;/strong&gt;elementi i&amp;ccedil;erisinde yer alan &lt;strong&gt;kind&lt;/strong&gt; niteliğine &lt;strong&gt;mexEndpoint&lt;/strong&gt; isimli bir değer atanmıştır. Bu değer&amp;nbsp;standart olarak &lt;strong&gt;Metadata Exchange&lt;/strong&gt; yayınlaması yapacak bir &lt;strong&gt;endpoint&lt;/strong&gt; oluşturulmasını &lt;strong&gt;WCF &amp;ccedil;alışma zamanına(Runtime)&lt;/strong&gt; bildirmektedir. &amp;Ouml;rneğin bu versiyonunu &amp;ccedil;alıştırdığımızda&lt;em&gt;(.Net Framework 4.0 ve Visual Studio 2010 &amp;uuml;zerinde geliştirilmiştir) &lt;/em&gt;bir &amp;ouml;nceki &amp;ouml;rnekte olduğu gibi istemci tarafından Metadata bilgisini &amp;ccedil;ekebildiğimizi g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg63_AfterAddRef.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ne yazıkki, &lt;strong&gt;mexEndpoint&lt;/strong&gt; varsayılan olarak &lt;strong&gt;Http&lt;/strong&gt; bazlı &lt;strong&gt;Metadata Publishing'&lt;/strong&gt; i desteklemektedir. Yani &lt;strong&gt;NetTcp&lt;/strong&gt; kullandığımız durumlarda, binding niteliğini kullanarak bildirim yapmamız şarttır. Bu durumda aslında mexTcpBinding kullanılmasını belirttikten sonra birde IMetadataExchange aray&amp;uuml;z&amp;uuml;n&amp;uuml; contract niteliğinde belirtmek &amp;ccedil;okda fazla bir adım olarak g&amp;ouml;r&amp;uuml;lmemelidir. Ancak burada bahsedilen standartlaştırılmış endPoint' ler&amp;nbsp;sadece&amp;nbsp;&lt;strong&gt;mexEndpoint&lt;/strong&gt; tipinden mi oluşmaktadır? Tabiki hayır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;announcementEndpoint, discoveryEndpoint, udpAnnouncementEndpoint, udpDiscoveryEndpoint, workflowControlEndpoint&lt;/strong&gt; gibi başka standart endPoint tipleride tanımlanmıştır. Dikkat &amp;ccedil;ekici noktalardan biriside istenildiğinde bu standart &lt;strong&gt;endPoint&lt;/strong&gt;&amp;nbsp;tipleri i&amp;ccedil;inde bazı &amp;ouml;zel ayarların yapılabileceğidir&lt;em&gt;(Bu ayarlamaları ve yeni gelen standart endPoint tiplerinden diğerlerini ilerleyen yazılarımızda detaylı bir şekilde incelemeye &amp;ccedil;alışacağım)&lt;/em&gt;&amp;nbsp;Bu noktada konfigurasyon i&amp;ccedil;eriğinde &lt;strong&gt;standardEndpoints&lt;/strong&gt; sekmesini ele almak yeterli olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg63_StndrdPoints.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF 4.0 &lt;/strong&gt;tarafında &lt;strong&gt;basitleştirilmiş konfigurasyon(Simplified Configuration) &lt;/strong&gt;&amp;ouml;zellikleri ile ilişkili yenilikleri incelemeye devam ediyor olacağız. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f8%2fStandardEndpoints.rar"&gt;StandardEndpoints.rar (48,35 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-08-14 03:15:00</pubDate>
  <slug>WCF-40-Yenilikleri-Standard-Endpoints</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-40</tag>
  </tags>
  <categories>
    <category>WCF 4.0 Beta 1</category>
  </categories>
</post>