<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>C# 6.0 - Collection Initializers için Add Metodunu Yönlendirmek</title>
  <description>C# 6.0 ile gelen yeni özelliklerden birisi de geliştirici tanımlı koleksiyonlar içerisindeki üyeler için Collection Initializers kullanılabilmesi. Bunun için Add genişletme metodunun istenen metoda atanması yeterli. Konuyu daha iyi anlamak için C# 6.0 öncesinden bir örnekle işe başlayalım. Elimizde aşağıdaki gibi bir sınıf olduğunu düşünelim.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/02/lego_collection_n.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Mesleki hayatımın bir d&amp;ouml;neminde yazılım eğitmeni olarak &amp;ccedil;alıştım. Ağırlıklı olarak .Net eğitimleri verdim. Tabii o zamanlar .Net nispeten daha kolaydı. Bu kadar fazla dallanan bir Framework değildi ama C# dil &amp;ouml;zellikleri de acımasızca genişlemiyordu. Aradan ge&amp;ccedil;en onca yıldan sonra &amp;ccedil;alıştığım turuncu bankanın kendi akademisinden i&amp;ccedil; eğitim isteği geldi.&lt;/p&gt;
&lt;p&gt;Konu C# programlama diliydi. İyi hazırlanmam gerektiği ortadaydı. Kurumsal projelerin standartları gereği en son teknolojiyi kullanamıyor olsak da C# 6.0 d&amp;uuml;nyasını yakalamıştık. Projelerimizi Visual Studio 2013 ile geliştirmekte ve .Net Framework 4.6.1 s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; kullanmaktayız&lt;em&gt;(Şimdilik)&lt;/em&gt;&amp;nbsp;Bana&amp;nbsp;sanal bir makine de verdiler ve i&amp;ccedil;erisine gıcır gıcır Visual Studio 2015 koydular&lt;em&gt;(Kurum i&amp;ccedil;inde de Visual Studio 2015 yaygınlaştırılmakta)&lt;/em&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Hal b&amp;ouml;yle olunca C# 6.0 ile ilgili yenilikleri g&amp;ouml;zden ge&amp;ccedil;irme fırsatını da yeniden yakalamış oldum. Eğitime hazırlanırken okuduğum&amp;nbsp;&amp;ouml;zelliklerden birisi de Collection Initializer olarak kullanılabilen Add metodunun istediğimiz bir başka&amp;nbsp;metoda atanabilmesiydi. Bu, &amp;ouml;zellikle bir koleksiyonu sarmalladığımız IEnumerable t&amp;uuml;revli tiplerde&amp;nbsp;işe yarayabilecek bir yetenek. Amacımız&amp;nbsp;bir sınıf &amp;ouml;rneğini oluşturduğumuz yerde i&amp;ccedil;erideki koleksiyona elemanlar atayabilmek. Bunu zaten var olan koleksiyonlar i&amp;ccedil;in aşağıdaki gibi yapabiliyoruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;List&amp;lt;string&amp;gt; colors=new List&amp;lt;string&amp;gt;{
			"red",
			"blue",
			"green"
	   };&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rneğin string tipte elemanlar barındıran colors isimli List&amp;lt;string&amp;gt; nesnesini yukarıdaki kod par&amp;ccedil;asında olduğu gibi başlatabiliriz. Nesne oluşurken i&amp;ccedil;erisindeki string dizisine ilk elemanlar atanıyor.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Hatta C# 6.0 ile Dictionary&amp;lt;T,K&amp;gt; tipinden koleksiyonları aşağıdaki gibi başlatabiliyoruz da&lt;em&gt;(Kod Visual Studio 2015 de yazılmıştır)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var colors = new Dictionary&amp;lt;int, string&amp;gt;
{
	[100] = "Black",
	[101] = "Green",
	[102] = "Red"
};&lt;/pre&gt;
&lt;/blockquote&gt;
&lt;p&gt;Hedefimiz string yerine kendi tipimizi kullanıldığında benzer işlevselliği sunabilmek. Add metodunun olması bunun i&amp;ccedil;in yeterli ama bulunduğumuz domain gereği farklı isimli bir metoda atamak isteyebiliriz? İşte soru bu. Konuyu daha iyi anlamak i&amp;ccedil;in C# 6.0 &amp;ouml;ncesinden bir &amp;ouml;rnekle işe başlayalım. Elimizde aşağıdaki gibi bir sınıf olduğunu d&amp;uuml;ş&amp;uuml;nelim&lt;em&gt;(Bu &amp;ouml;rnek Visual Studio 2013 &amp;uuml;zerinde geliştirildi)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Player
{
	public int PlayerId { get; set; }
	public string Nickname { get; set; }
	public double Level { get; set; }

	public override string ToString()
	{
		return string.Format("{0} {1} {2}", PlayerId, Nickname, Level);
	}
}&lt;/pre&gt;
&lt;p&gt;Kobay sınıflarımızdan&amp;nbsp;birisi olan Player tipinden generic List&amp;lt;T&amp;gt; koleksiyonu barındıran bir diğer tipimizi de aşağıdaki gibi tasarlayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class GameSchene
	:IEnumerable&amp;lt;Player&amp;gt;
{
	private List&amp;lt;Player&amp;gt; players = new List&amp;lt;Player&amp;gt;();

	public void Assign(Player player)
	{
		players.Add(player);
	}

	public IEnumerator&amp;lt;Player&amp;gt; GetEnumerator()
	{
		return ((IEnumerable&amp;lt;Player&amp;gt;)players).GetEnumerator();
	}

	IEnumerator IEnumerable.GetEnumerator()
	{
		return ((IEnumerable&amp;lt;Player&amp;gt;)players).GetEnumerator();
	}
}&lt;/pre&gt;
&lt;p&gt;GameSchene sınıfı IEnumerable&amp;lt;Player&amp;gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulamakta. Buna g&amp;ouml;re i&amp;ccedil;erideki oyuncu listesi &amp;uuml;zerinden for each d&amp;ouml;ng&amp;uuml;s&amp;uuml; yardımıyla ilerleyebiliriz. Amacımız ise aşağıdaki gibi bir kod par&amp;ccedil;asını &amp;ccedil;alıştırabilmek.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;class Program
{
	static void Main(string[] args)
	{
		var zone = new GameSchene
		{
			new Player{ PlayerId=102, Nickname="Maykil Cordin", Level=1000},
			new Player{ PlayerId=104, Nickname="a user", Level=800},
			new Player{ PlayerId=89, Nickname="black window", Level=750}
		};

		foreach (var p in zone)
		{
			Console.WriteLine(p.ToString());
		}
	}
}&lt;/pre&gt;
&lt;p&gt;Aslında string tipinden elemanlar barındıran generic bir kolekisyonu tek ifade i&amp;ccedil;erisinde nasıl başlatabiliyorsak, benzer durumu kendi koleksiyon tipimiz i&amp;ccedil;in de yapmak istiyoruz.&amp;nbsp;Ancak kod derlenmeyecek. Nitekim koleksiyon başlatıcısı&amp;nbsp;Add metodunu bekliyor. &amp;Ouml;rnekte ise&amp;nbsp;Assign metodu var.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/c6extension_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/02/c6extension_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Pek tabii Assign metodunu Add olarak değiştirirsek kod başarılı bir şekilde derlenecek ve &amp;ccedil;alışacaktır.&amp;nbsp;C# 6.0 tarafında ise Add metodunu extension olarak tanımlayıp istediğimiz başka bir&amp;nbsp;metod ile ilişkilendirme şansına sahibiz. Tek yapmamız gereken aşağıdaki gibi bir genişletme sınıfı yazmak.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public static class GameScheneExtensions
{
	public static void Add(this GameSchene e, Player p) =&amp;gt; e.Assign(p);
}&lt;/pre&gt;
&lt;p&gt;GameSchene tipi i&amp;ccedil;in Add isimli bir genişletme metodu s&amp;ouml;z konusudur. Expression-Bodied Functions &amp;ouml;zelliği kullanılarak =&amp;gt; operat&amp;ouml;r&amp;uuml; sonrası işletilmesi istenen kod tanımlanmıştır. e.Assing(p) ile Add metodunun g&amp;uuml;ncel GameSchene nesne &amp;ouml;rneğindeki Assing metoduna atanması ve initialization&amp;nbsp;kısmında gelen Player nesne &amp;ouml;rneğinin parametre olarak atanması sağlanmıştır. &amp;Ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibidir&lt;em&gt;(&amp;Ouml;rnek Visual Studio 2015 &amp;uuml;zerinde yazılmıştır)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;img src="/image.axd?picture=/2017/02/c6extension_2.gif" alt="" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Basit ve ince bir &amp;ouml;zellik bilgimiz olsun mutlaka işimize yarayacaktır. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Bir başka yazımızda g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-03-18 22:50:00</pubDate>
  <slug>c-6-0-collection-initializers-ve-add-extension-metodu</slug>
  <tags>
    <tag>c#</tag>
    <tag>c#-60</tag>
    <tag>extension-method</tag>
    <tag>collection-initializers</tag>
  </tags>
  <categories>
    <category>C# 6.0</category>
  </categories>
</post>