<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ado.Net 2.0 ve Sql Komutlarını Asenkron Olarak Yürütmek - 2</title>
  <description>Hatırlayacağınız gibi bir önceki makalemizde, sql komutlarının asenkron olarak yürütülmesi için kullanılan tekniklerden birisi olan polling modelini incelemiştik. Polling modeli basit olmakla birlikte, iş yükü fazla olan hacimli sql komutlarının asenkron olarak çalıştırılmasında çok fazla tercih edilmemelidir. Bu tip sorguların yer aldığı asenkron yürütmelerde, CallBack veya Wait modellerini kullanmak verimliği arttırıcı etkenlerdir. Bu makalemizde CallBack modelini kısaca incelemeye çalışacağız.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Hatırlayacağınız gibi bir &amp;ouml;nceki makalemizde, sql komutlarının asenkron olarak y&amp;uuml;r&amp;uuml;t&amp;uuml;lmesi i&amp;ccedil;in kullanılan tekniklerden birisi olan polling modelini incelemiştik. Polling modeli basit olmakla birlikte, iş y&amp;uuml;k&amp;uuml; fazla olan hacimli sql komutlarının asenkron olarak &amp;ccedil;alıştırılmasında &amp;ccedil;ok fazla tercih edilmemelidir. Bu tip sorguların yer aldığı asenkron y&amp;uuml;r&amp;uuml;tmelerde, CallBack veya Wait modellerini kullanmak verimliği arttırıcı etkenlerdir. Bu makalemizde CallBack modelini kısaca incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;CallBack modeli anafikir olarak, asenkron olarak &amp;ccedil;alışan sql komutlarının işleyişlerinin sona erdiği noktalarda y&amp;uuml;r&amp;uuml;rl&amp;uuml;ğe giren metodları b&amp;uuml;nyesinde barındıran bir tekniktir. Bu tekniğe g&amp;ouml;re, asenkron olarak y&amp;uuml;r&amp;uuml;t&amp;uuml;lecek sql komutlarını taşıyan SqlCommand nesneleri yine bilinen Begin... metodları ile &amp;ccedil;alıştırılırlar. Ancak bu kez, SqlCommand nesnesine ait Begin metodlarının aşağıdaki tabloda belirtilen aşırı y&amp;uuml;klenmiş versiyonları kullanılır.&lt;/p&gt;
&lt;table id="table1" style="width: 636px;" border="1" cellspacing="0" cellpadding="5" bgcolor="#cccccc"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="622"&gt;&lt;strong&gt;CallBack modelinde kullanılan SqlCommand.Begin... metodları&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="622"&gt;public IAsyncResult BeginExecuteNonQuery ( &lt;strong&gt;AsyncCallback&lt;/strong&gt; callback, &lt;strong&gt;object&lt;/strong&gt; stateObjcet );&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="622"&gt;public IAsyncResult BeginExecuteReader ( AsyncCallback callback, object stateObjcet );&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#ffffff" width="622"&gt;public IAsyncResult BeginExecuteXmlReader ( AsyncCallback callback, object stateObjcet );&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Burada g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi her &amp;uuml;&amp;ccedil; metod da, iki parametre almaktadır. İlk parametre AsyncCallback temsilcisi tipindendir. Bu parametre yardımıyla, y&amp;uuml;r&amp;uuml;t&amp;uuml;lecek olan sql komutları tamamlandığında &amp;ccedil;alıştırılacak olan metod işaret edilir. Bu, static olan, void geri d&amp;ouml;n&amp;uuml;ş değerine sahip ve yanlızca IAsyncResult tipinde bir nesne &amp;ouml;rneğini parametre olarak alan bir metod olmalıdır. Bir başka deyişle Begin metodu ile &amp;ccedil;alıştırılan sql sorguları sonlandığında hangi metodun &amp;ccedil;alıştırılacağı buradaki temsilci (delegate) yardımıyla belirlenmiş olunur.&lt;/p&gt;
&lt;p&gt;İkinci parametre ise kullanıcı tarafından belirtilebilen object tipinden bir nesnedir. &amp;Ccedil;oğunlukla, CallBack metodu i&amp;ccedil;ine, asenkron olarak &amp;ccedil;alışan sql komutunun sahibi olan SqlCommand nesnelerini aktarmak amacıyla kullanılmaktadır. Polling modelinde olduğu gibi burada da Begin metodlarının geriye d&amp;ouml;n&amp;uuml;ş değerleri, &amp;ccedil;alışan asenkron sorgudan sorumlu olan IAsyncResult aray&amp;uuml;z&amp;uuml; tipinden nesne &amp;ouml;rnekleridir.&lt;/p&gt;
&lt;p&gt;Bu kısa a&amp;ccedil;ıklamalardan sonra dilerseniz, CallBack modelinin nasıl uygulandığını g&amp;ouml;steren basit bir &amp;ouml;rnek geliştirelim. Bu ama&amp;ccedil;la Visual Studio.Net 2005' te aşağıdaki kodlara sahip olan bir Console uygulaması oluşturalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;#region Using directives

using System;
using System.Collections.Generic;
using System.Text;
using System.Data;
using System.Data.SqlClient;

#endregion

namespace CallBackModel
{
    class Program
    {
        public static void Main(string[] args)
        {
            SqlConnection con = new SqlConnection("data source=localhost;initial catalog=AdventureWorks;integrated security=SSPI;MultipleActiveResultSets=true;async=true");
            con.Open();
            SqlCommand cmd = new SqlCommand("UPDATE Production.Product SET ListPrice=ListPrice*1.15", con);
            SqlCommand cmd2 = new SqlCommand("SELECT * From Person.Address", con);
            IAsyncResult res = cmd.BeginExecuteNonQuery(new AsyncCallback(UPDATE_OK), cmd);
            IAsyncResult res2 = cmd2.BeginExecuteReader(new AsyncCallback(SELECT_OK), cmd2);
            Console.WriteLine("SORGULAR &amp;Ccedil;ALIŞIYOR...");
            Console.ReadLine();
            con.Close();
        }

        public static void UPDATE_OK(IAsyncResult r)
        {
            SqlCommand komut = (SqlCommand)r.AsyncState;
            int sonuc=komut.EndExecuteNonQuery(r);
            Console.WriteLine(sonuc + " SATIR G&amp;Uuml;NCELLENDİ...");
        }
    
        public static void SELECT_OK(IAsyncResult r)
        {
            SqlCommand komut = (SqlCommand)r.AsyncState;
            SqlDataReader dr = komut.EndExecuteReader(r);
            dr.Read();
            Console.WriteLine(dr[1] + " " + dr[2]);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamayı &amp;ccedil;alıştırmadan &amp;ouml;nce kısaca neler yaptığımıza daha yakında bakmakta fayda var. Bu &amp;ouml;rneğimizde, Yukon &amp;uuml;zerinde yer alan AdventureWorks veritabanına bağlandık. Amacımız iki sql sorgusunu asenkron olarak &amp;ccedil;alıştırmak ve bu sorgular işlerken uygulama ortamında izleyen kod satırlarını y&amp;uuml;r&amp;uuml;t&amp;uuml;lebilmesini sağlamak. SqlCommand nesnelerimizide yarattıktan sonra sıra bu komutları ilgili Begin... metodları ile &amp;ccedil;alıştırmaya geliyor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;IAsyncResult res = cmd.BeginExecuteNonQuery(new AsyncCallback(UPDATE_OK), cmd);
IAsyncResult res2 = cmd2.BeginExecuteReader(new AsyncCallback(SELECT_OK), cmd2);&lt;/pre&gt;
&lt;p&gt;Burada bizim i&amp;ccedil;in en &amp;ouml;nemli noktalar parametrelerdir. Her iki metodun ilk parametresi aslında AsyncCallback temsilcisi tipindendir. Nitekim;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;new AsyncCallback(UPDATE_OK)&lt;/pre&gt;
&lt;p&gt;tanımlaması ile aslında UPDATE_OK isimli metodu işaret eden AsyncCallback tipinden bir temsilci tanımlamış olunmaktadır. Bu temsilcinin yaptığı iş sadece, IAsyncResult nesne &amp;ouml;rneğinin sorumluluğunda olan sql komutlarının y&amp;uuml;r&amp;uuml;t&amp;uuml;l&amp;uuml;ş&amp;uuml; tamamlandığında, derhal &amp;ccedil;alıştırılacak olan metodun hangi metod olacağına karar vermektir.&lt;/p&gt;
&lt;p&gt;İkinci paramtremiz ise, Begin metodunun sahibi olan SqlCommand nesnesidir. Bu nesneye, UPDATE_OK metodu i&amp;ccedil;inden erişilebiliriz. Eğer b&amp;ouml;yle bir erişim s&amp;ouml;z konusu olmasaydı, CallBack metodunun i&amp;ccedil;inden sql sorgusunun sahibi olan SqlCommand nesnesine erişmekte sorunlar yaşayabilirdik. Nitekim CallBack metodu dikkat edeceğiniz gibi static olmak zorundadır ve static bir metod i&amp;ccedil;inde static olmayan &amp;uuml;yeler erişmekte sorun yaşamaktayızdır. T&amp;uuml;m bunlar AsyncCallback temsilcisinin işaret edebileceği metodun yapısı ile ilgilidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public static void UPDATE_OK(IAsyncResult r)
{
      SqlCommand komut = (SqlCommand)r.AsyncState;
      int sonuc=komut.EndExecuteNonQuery(r);
      Console.WriteLine(sonuc + " SATIR G&amp;Uuml;NCELLENDİ...");
}&lt;/pre&gt;
&lt;p&gt;Bu metod dikkat edecek olursanız, IAsyncResult tipinden bir nesneyi parametre olarak almaktadır. Buraya ge&amp;ccedil;irilen bu parametre, Begin metodu ile oluşturulan IAsyncResult nesne &amp;ouml;rneğidir. Dolayısıyla, sql komutunun işleyişi tamamlandığında devreye girecek olan bu metod i&amp;ccedil;inden, IAsyncResult nesne &amp;ouml;rneği yardımıyla sonu&amp;ccedil; k&amp;uuml;melerini elde edebilmemiz m&amp;uuml;mk&amp;uuml;n olabilmektedir. Bir başka deyişle, End... metodunu buraya aktarılan IAsyncResult nesne &amp;ouml;rneği &amp;uuml;zerinden &amp;ccedil;ağırabiliriz. Diğer yandan, sql komutunun sahibi olan SqlCommand nesnesini metod i&amp;ccedil;inde kullanabilmek i&amp;ccedil;in,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlCommand komut = (SqlCommand)r.AsyncState;&lt;/pre&gt;
&lt;p&gt;satırı kullanılmıştır. Bu satırda dikkat ederseniz, IAsyncResult nesnesinin AsyncState &amp;ouml;zelliğinden yararlanılmıştır. Bu &amp;ouml;zellik, asenkron y&amp;uuml;r&amp;uuml;tme operasyonunda g&amp;ouml;rev olan SqlCommand nesnesini elde etmemizi sağlar. Tabiki &amp;ouml;zelliğin tanımlanışı gereği, geri d&amp;ouml;n&amp;uuml;ş değeri object tipinde olduğundan burada bir cast işlemi uygulanmıştır. Yani object nesneyi SqlCommand tipine &amp;ccedil;evirmemiz gerekmektedir.&lt;/p&gt;
&lt;p&gt;Son adımda ise, EndExecuteNonQuery metodu &amp;ccedil;ağırılarak, sql komutunun sonu&amp;ccedil;ları elde edilmiştir. Bu metod i&amp;ccedil;in kullanılan desen yapısı CallBack metodu olan SELECT_OK i&amp;ccedil;inde ge&amp;ccedil;erlidir. Uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk97_1.gif" alt="" width="308" height="95" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. Uygulamanın &amp;ccedil;alışması sonucu.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edecek olursanız, biz CallBack tekniğini uygulamaya başladığımız Begin... &amp;ccedil;ağrılarından sonraki kodlar, sql sorgularımızın tamamlanmasından &amp;ouml;nce &amp;ccedil;alışmıştır.&lt;/p&gt;
&lt;p&gt;Bu modeli, bir &amp;ouml;nceki makalemizde incelediğimiz polling modeli ile karşılaştırdığımızda ilk g&amp;ouml;ze &amp;ccedil;arpan, s&amp;uuml;rekli olarak bir kontrol yapmayışımızdır. Hatırlayacağınız gibi polling modelinde, IAsyncResult nesnesinin IsCompleted &amp;ouml;zelliği ile, &amp;ccedil;alışan sql sorgularının tamamlanıp tamamlanmadığı kontrol edilmektedir. Bu her ne kadar basit ve fazla zaman almayan sorgular i&amp;ccedil;in kullanışlı olsada, daha b&amp;uuml;y&amp;uuml;k &amp;ouml;l&amp;ccedil;ekli sorgularda, &amp;ccedil;alışan asenkron prosesin s&amp;uuml;rekli olarak kontrol edilmeye &amp;ccedil;alışılması &amp;ccedil;ok anlamlı olmayacak ve en &amp;ouml;nemlisi zaman kaybında neden olacaktır. Bu nedenlede bu tip yoğun sorgularda genellikle CallBack veya Wait modellerinden birisi tercih edilir. CallBack modelinin anatomisini zihnimizde daha iyi canlandırabilmek amacıyla aşağıdaki şekli de g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk97_2.gif" alt="" width="615" height="438" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. CallBack modelinin anatomisi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi aslında, asenkron olarak &amp;ccedil;alışacak sql sorguları tamamlandığında devreye giren CallBack metodları, uygulama ortamındaki satırlardan tamamen bağımsız olarak &amp;ccedil;alışan yapılardır. Sql komutları sonlandığında anında devreye girerek sonu&amp;ccedil;ların elde edilebilmesini sağlayan ve hatta başka işlemlerin ger&amp;ccedil;ekleştirilebileceği kod bloklarını kaps&amp;uuml;llememize imkan vermektedirler. CallBack yapısının biraz daha gelişmiş bir versiyonu olan Wait modelide asenkron sql komutları y&amp;uuml;r&amp;uuml;t&amp;uuml;lmesinde kullanılan tekniklerdendir. Bir sonraki makalemizde bu konuya değinmeye &amp;ccedil;alışacağız. Tekrar g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-09-25 12:00:00</pubDate>
  <slug>Ado-Net-2-0-ve-Sql-Komutlarc4b1nc4b1-Asenkron-Olarak-Yurutmek-2-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet-20</tag>
    <tag>asynchronous</tag>
    <tag>async</tag>
  </tags>
  <categories>
    <category>Ado.net 2.0</category>
  </categories>
</post>