<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tek Fotoluk İpucu 135 - Ruby ile Tek Satırda Dosya içi Arama</title>
  <description>Geçenlerde notpead++ ile oluşturduğum bir text dosya üzerinde düşünüyordum da...Dosya içerisinde House dizisinde çalan 75 adet şarkının bilgisi vardı. Söyleyenler ve şarkı adları. Sonra aklıma bu dosya içerisinde belli bir metnin geçtiği satırları nasıl bulabilirim sorusu geldi. Örneğin "House dizisinde çalınan şarkılardan hangileri The Rolling Stones grubuna aittir?" Mutlaka komut satırından bazı araçlar ile bu işlem kolayca gerçekleştirilebilir.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;enlerde&amp;nbsp;notpead++ ile oluşturduğum bir text dosya &amp;uuml;zerinde d&amp;uuml;ş&amp;uuml;n&amp;uuml;yordum da...Dosya i&amp;ccedil;erisinde House dizisinde &amp;ccedil;alan 75 adet şarkının bilgisi vardı. S&amp;ouml;yleyenler ve şarkı adları.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/10/tfi135_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sonra aklıma bu dosya i&amp;ccedil;erisinde belli bir metnin&amp;nbsp;ge&amp;ccedil;tiği satırları nasıl bulabilirim sorusu geldi. &amp;Ouml;rneğin &lt;strong&gt;"House dizisinde &amp;ccedil;alınan şarkılardan hangileri The Rolling Stones grubuna aittir?"&lt;/strong&gt; Mutlaka komut satırından bazı ara&amp;ccedil;lar ile bu işlem kolayca ger&amp;ccedil;ekleştirilebilir. Hatta hemen Visual Studio'yu a&amp;ccedil;ıp basit bir Console uygulaması da yazabilirim. Ancak ben bunu Interactive Ruby aracı &amp;uuml;zerinde kodla nasıl yapabilirim peşindeydim. &amp;Ccedil;&amp;uuml;nk&amp;uuml; hemen o anda ihtiyacım vardı bu bilgiye. Derlemeli değilde komut satırından &amp;ccedil;alışan yorumlamalı bir dil işime geliyordu. Aynı sonuca ulaşmanın birden fazla yolu olmakla birlikte istediğim bilgiyi tek satırlık bir kod par&amp;ccedil;ası ile alabildiğimi&amp;nbsp;g&amp;ouml;r&amp;uuml;nce &amp;ccedil;ok mutlu oldum. Epey hoşuma gitti o y&amp;uuml;zden paylaşayım istedim.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;puts File.readlines('SomeAlbums.txt').select{|line| line['The Rolling Stones']}&lt;/pre&gt;
&lt;p&gt;ve sonu&amp;ccedil;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/10/tfi135_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Olayın kahramanları File sınıfı, parametre olarak gelen dosyayı satır bazında okumamızı sağlayan readlines metodu ve bu metodun d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml; veri listesi&amp;nbsp;&amp;uuml;zerinde metin&amp;nbsp;bazlı arama yapmamızı sağlayan select fonksiyonu. Sanki LINQ sorgusu yazar gibi. line['The Rolling Stones']&amp;nbsp;ifadesi ilgili satırı karakter dizisi bazında ele almamızı sağlıyor.&lt;/p&gt;
&lt;p&gt;Bu teknik i&amp;ccedil;erisinde&amp;nbsp;Regex ifadesi&amp;nbsp;de kullanabiliriz. Tabii &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k boyutlu dosyalarda bir şeyler aramak istediğimizde performans a&amp;ccedil;ısından daha farklı tekniklere y&amp;ouml;nelmemiz gerekebilir&lt;em&gt;(&amp;Ouml;rneğin bir ka&amp;ccedil; gigabyte boyutundaki log dosyasında&amp;nbsp;OutOfMemoryException ge&amp;ccedil;en satırları aradığınızı d&amp;uuml;ş&amp;uuml;n&amp;uuml;n)&lt;/em&gt;&amp;nbsp;B&amp;uuml;y&amp;uuml;k boyutlu dosyalar ile &amp;ccedil;alışmak başlı başına bir konu. &lt;a href="http://smyck.net/2011/02/12/parsing-large-logfiles-with-ruby/" target="_blank"&gt;Şuradaki yazı size fikir verecektir kanaatindeyim&lt;/a&gt;.&lt;/p&gt;
&lt;p&gt;Bir başka ipucunda g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-10-18 21:30:00</pubDate>
  <slug>tek-fotoluk-ipucu-135-ruby-ile-tek-satirda-dosya-ici-arama</slug>
  <tags>
    <tag>ruby</tag>
    <tag>tek-fotoluk-ipucu</tag>
    <tag>find-in-files</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>