<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Dependency Injection'ın TDD'deki Yeri</title>
  <description>Test odaklı yazılım geliştirirken özellikle entegrasyon testlerinde(Integration Tests) yaşadığımız önemli sorunlardan birisi de test edilen nesnelerin diğer nesnelerle olan bağımlılıklarıdır. Söz gelimi test edilmek istenen birimin bağımlılıkları arasında servis çağrıları, veritabanı operasyonları veya uzak sunucu dosya hareketleri gibi işlemler söz konusuysa otomatik olarak çalıştırılan birim testlerinin CI sürecini sekteye uğratmaması için bir şeyler yapılması gerekebilir. Biliyorum çok karışık bir paragraf ile işe başladım. O yüzden problemi ortaya koymak adına aşağıdaki kod parçalarını göz önüne alalım.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/09/tdd_di_5.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Ne zamandır oturup da Lego yapmadığımı fark ettim. Her ne kadar fiyatları epeyce artmış olsa da ge&amp;ccedil;enlerde dayanamayıp bir tane aldım. Bitirir bitirmez beni tatile g&amp;ouml;t&amp;uuml;receğini d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m g&amp;uuml;zel bir karavan. Bloklardaki canlı renklerin tatlılığı, masmavi surf tahtası, uydu alıcısı,&amp;nbsp;konforlu koltukları, panaromik tavanı, spor lastikleri&amp;nbsp;ile bir saate kalmadan hazırdı bile.&lt;/p&gt;
&lt;p&gt;Onunla biraz oynayıp, wrom wrom yaptım. Lego City'nin caddelerinden yavaş ve sakince akarak Malaga kıyılarındaki plajlara indim. G&amp;uuml;neş batana kadar y&amp;uuml;zd&amp;uuml;m, surf yaptım. Bazen sahilden iyice uzaklaştım. İnsanların nokta gibi g&amp;ouml;z&amp;uuml;kt&amp;uuml;ğ&amp;uuml; mesafelere geldim. Şehre akşamın sakinliği &amp;ccedil;&amp;ouml;k&amp;uuml;p karanlık bastırdıktan sonra&amp;nbsp;plaja tekrar gelen gen&amp;ccedil;lerin gitar melodilerinden &amp;ccedil;ıkan tınıları dinlemeye başladım. Yaktıkları ateş etrafında toplanmış enerji dolu gen&amp;ccedil;ler. Karavanın hemen yanıbaşına kurduğum şezlongumda uzanmış onları izliyordum. Tebess&amp;uuml;mle. Buzlu kahvemden bir yudum aldım ve a&amp;ccedil;ık duran bilgisayarımda yanıp s&amp;ouml;nen cursor'u izlemeye başladım. Yazılmayı bekleyen kuyrukta kalmış bir şeyler vardı...&lt;/p&gt;
&lt;p&gt;TDD s&amp;uuml;re&amp;ccedil;lerindeki birim ve entegrasyon testlerinde&lt;em&gt;(Integration Tests)&lt;/em&gt; yaşadığımız &amp;ouml;nemli sorunlardan birisi, test edilmek istenen fonksiyonelliklerde kullanılan nesnelerin diğer nesnelerle olan bağımlılıkları sebebiyle yaşanmaktadır. S&amp;ouml;z gelimi test edilmek istenen birimin bağımlılıkları arasında servis &amp;ccedil;ağrıları, veritabanı operasyonları veya&amp;nbsp;uzak sunucu dosya hareketleri gibi işlemler s&amp;ouml;z konusuysa, otomatik olarak &amp;ccedil;alıştırılan birim testlerinin CI&lt;em&gt;(Continuous Integration)&lt;/em&gt; s&amp;uuml;recini sekteye uğratmaması i&amp;ccedil;in bir şeyler yapılması gerekebilir. Biliyorum &amp;ccedil;ok karışık bir paragraf ile işe başladım. O y&amp;uuml;zden problemi ortaya koymak adına aşağıdaki kod par&amp;ccedil;alarını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alarak ilerlemeye &amp;ccedil;alışalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace CodeKata.Services{
    public class CalculationService
    {
        private UserSerice _service;
        public CalculationService()
        {
            _service=new UserSerice();
        }
        public string GetInvoices()
        {
            if(_service.CheckRequest(GetCurrentContext()))
            {
                return "Invoice list";
            }
            else{
                return String.Empty;
            }
        }

        private string GetCurrentContext()
        {
            return "{\"operation\":\"Sum\"}";
        }
    }
}&lt;/pre&gt;
&lt;p&gt;CalculationService isimli sınıfın GetInvoices metoduna odaklanalım. UserService sınıfına ait nesne &amp;ouml;rneğinin CheckRequest fonksiyonu kullanılarak bir işlem ger&amp;ccedil;ekleştirilmekte. A&amp;ccedil;ık&amp;ccedil;a CalculationService sınıfı i&amp;ccedil;in bir bağımlılık bulunduğunu g&amp;ouml;rebiliyoruz. Buna ilaveten UserService'in bir web servisi olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Sorun şu; "GetInvoices i&amp;ccedil;in yazılan testler &amp;ccedil;alışırken ya UserService &amp;ccedil;alışır durumda değilse?"&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Bu Continuous Integration sırasında test aşamasının ge&amp;ccedil;ilmesine de engel teşkil edebilecek bir durum olabilir. İşte burada s&amp;ouml;z konusu servisin CheckRequest fonksiyonunun aslında istediğimiz tipte veriyi d&amp;ouml;nd&amp;uuml;recek şekilde kullanılması sorunu &amp;ccedil;&amp;ouml;z&amp;uuml;mleyebilir. Yani bağımlılığı test tarafında istediğimiz gibi enjekte edersek asıl testin &amp;ccedil;alışıp &amp;ccedil;alışmadığına odaklanabiliriz. Bunu yapmak i&amp;ccedil;in Dependency Injection' a uygun bir tasarıma ge&amp;ccedil;memiz gerekiyor.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bildiğiniz &amp;uuml;zere Dependency Injection mekanizması ile bu tip nesne bağımlılıklarının soyutlaştırılması m&amp;uuml;mk&amp;uuml;n. Temelde bunu &amp;uuml;&amp;ccedil; farklı şekilde yapabiliriz. Yapıcı metod&lt;em&gt;(Constructor)&lt;/em&gt; &amp;uuml;zerinden, &amp;ouml;zelliğe&lt;em&gt;(Property)&lt;/em&gt;&amp;nbsp;kullanarak ve aray&amp;uuml;z&lt;em&gt;(Interface)&lt;/em&gt; tipinden yararlanarak. Yukarıdaki &amp;ouml;rneği d&amp;uuml;ş&amp;uuml;nerek bu &amp;uuml;&amp;ccedil; tekniğini nasıl kullanabileceğimizi incelemeye &amp;ccedil;alışalım.&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;Yapıcı Metod Kullanımı&lt;/h1&gt;
&lt;p&gt;Burada bağımlılığın nesne i&amp;ccedil;erisine yapıcı metod &amp;uuml;zerinden aktarımı s&amp;ouml;z konusudur. &amp;Ouml;ncelikle aşağıdaki gibi bir aray&amp;uuml;ze ihtiyacımız var.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public interface IUserService
{
    bool CheckRequest(string request);
}&lt;/pre&gt;
&lt;p&gt;Buna g&amp;ouml;re CalculationService sınıfını da aşağıdaki gibi değiştirilmesi gerekiyor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace CodeKata.Services{
    public class CalculationService
    {
        private IUserService _service;
        public CalculationService(IUserService service)
        {
            _service=service;
        }
        public string GetInvoices()
        {
            if(_service.CheckRequest(GetCurrentContext()))
            {
                return "Invoice list";
            }
            else{
                return String.Empty;
            }
        }

        private string GetCurrentContext()
        {
            return "{\"operation\":\"Sum\"}";
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere yapıcı metoda parametre olarak IUserService aray&amp;uuml;z&amp;uuml;n&amp;uuml; veriyoruz. Bu aray&amp;uuml;z, UserService sınıfının uygulaması gereken CheckRequest metodunu tanımlamakta. Dolayısıyla IUserService aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulayan herhangi bir sınıfı kullanabilir ve asıl servise gitmeye gerek kalmadan istediğimiz cevabı d&amp;ouml;nd&amp;uuml;rerek testin ilerlemesini sağlayabiliriz. Bunun i&amp;ccedil;in test tarafında aşağıdaki gibi bir sınıfa ihtiyacımız olacak.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class FakeUserService
    : IUserService
{
    public bool CheckRequest(string request)
    {
        return true;
    }
}&lt;/pre&gt;
&lt;p&gt;CheckRequest operasyonunu her t&amp;uuml;rl&amp;uuml; true d&amp;ouml;nd&amp;uuml;recek hale getirdik. Dolayısıyla ş&amp;ouml;yle bir test metodu yazmamız artık m&amp;uuml;mk&amp;uuml;n.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using CodeKata.Services;
using Microsoft.VisualStudio.TestTools.UnitTesting;

namespace CodeKata.Tests
{
    [TestClass]
    public class CalculationServiceTests
    {
        [TestMethod]
        public void Should_Return_Current_Invoice_List_Is_Ok()
        {
            var calcService = new CalculationService(new FakeUserService());
            Assert.AreEqual("Invoice list", calcService.GetInvoices());
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Should_Return_Current_Invoice_List_Is_Ok test metodunun i&amp;ccedil;erisinde CalculationService nesnesini &amp;ouml;rneklerken parametre olarak FakeUserService sınıfını verdiğimize dikkat edelim. FakeUserService, test projesi i&amp;ccedil;erisinde yer alıyor ve asıl servisin bu test i&amp;ccedil;in gerekli olan davranışını taklit ediyor. İşte &amp;ccedil;alışma zamanı sonucu &lt;em&gt;(&amp;Ouml;rnekleri Visual Studio Code &amp;uuml;zerinde ve MSTest t&amp;uuml;revli bir test projesi ile geliştirmekteyim)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/09/tdd_di_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Property Setter Kullanımı&lt;/h1&gt;
&lt;p&gt;Şimdi enjekte mekanizmasını property &amp;uuml;zerinden kuralım. Tek yapmamız gereken CalculationService sınıfını aşağıdaki gibi değiştirmek olacak.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace CodeKata.Services{
    public class CalculationService
    {
        public IUserService UserService
        {
            get;
            set;
        }
        public string GetInvoices()
        {
            if(UserService.CheckRequest(GetCurrentContext()))
            {
                return "Invoice list";
            }
            else{
                return String.Empty;
            }
        }

        private string GetCurrentContext()
        {
            return "{\"operation\":\"Sum\"}";
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu sefer yapıcı metod yerine getter ve setter bloklarına sahip IUserService tipinden bir &amp;ouml;zellik kullanarak bağımlılığın i&amp;ccedil;eriye alınmasını sağlıyoruz. Doğal olarak ilgili test metodunun da aşağıdaki gibi değişmesi gerekiyor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[TestMethod]
public void Should_Return_Current_Invoice_List_Is_Ok()
{
    var fakeService=new FakeUserService();
    var calcService=new CalculationService()
    {
        UserService=fakeService
    };
    Assert.AreEqual("Invoice list", calcService.GetInvoices());
}&lt;/pre&gt;
&lt;p&gt;Test bu durumda da beklediğimiz gibi &amp;ccedil;alışacak ve asıl servisi hi&amp;ccedil; kullanmadan ilerleyecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/09/tdd_di_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Interface Kullanımı&lt;/h1&gt;
&lt;p&gt;Son olarak daha &amp;ccedil;ok tercih edilen interface &amp;uuml;zerinden nasıl bağımlılık enjekte edebileceğimize bir bakalım. Bu y&amp;ouml;ntem aslında property tabanlı bağımlılık tanımlamanın genişletilmiş bir versiyonu olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir ve daha &amp;ccedil;ok birden fazla bağımlılığın olduğu durumlarda ele alınır. Bizim &amp;ouml;rneğimizde bu tekniği aşağıdaki gibi icra etmemiz m&amp;uuml;mk&amp;uuml;n.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public interface IUserServiceInjector
{
    IUserService UserService{get;set;}
}&lt;/pre&gt;
&lt;p&gt;İlk olarak IUserService aray&amp;uuml;z&amp;uuml;nden referansları d&amp;ouml;nd&amp;uuml;recek bir başka s&amp;ouml;zleşme tanımlıyoruz. Ardından IUserServiceInjector isimli aray&amp;uuml;z CalculationService sınıfına uyarlanıyor. B&amp;ouml;ylece CalculationService sınıfının ilgili servis davranışını IUserServiceInjector &amp;uuml;zerinden belirtilen s&amp;ouml;zleşme &amp;ccedil;er&amp;ccedil;evesinde almasını sağlıyoruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class CalculationService
    : IUserServiceInjector
{
    public IUserService UserService
    {
        get;
        set;
    }
    public string GetInvoices()
    {
        if (UserService.CheckRequest(GetCurrentContext()))
        {
            return "Invoice list";
        }
        else
        {
            return String.Empty;
        }
    }
    private string GetCurrentContext()
    {
        return "{\"operation\":\"Sum\"}";
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ccedil;alıştığımız nesnelerde birden fazla bağımlılığın s&amp;ouml;z konusu olması halinde ayrı ayrı Injector aray&amp;uuml;zleri tasarlayıp uygulamamız m&amp;uuml;mk&amp;uuml;n. Son değişikliklere rağmen test metodunda &amp;ouml;zellik tabanlı &amp;ouml;rneğimizden farklı bir işleyiş s&amp;ouml;z konusu olmayacak.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/09/tdd_di_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Test g&amp;uuml;d&amp;uuml;ml&amp;uuml; geliştirme kapsamında Dependency Injection tekniğini bağımlılıkların olduğu her yerde ele almak m&amp;uuml;mk&amp;uuml;n. Her ne kadar kod&amp;nbsp;okunmasını biraz zorlaştırsa da daha kolay test yazılmasını sağlamakta olduğu aşikar.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneklerde kullandığımız FakeUserService sınıfı terminolojide "Test Double" tipi olarak ge&amp;ccedil;mekte&lt;em&gt;(Hatta Stub t&amp;uuml;r&amp;uuml;nden bir nesne olduğunu ifade edebiliriz)&lt;/em&gt; Test Double, basit&amp;ccedil;e bir &amp;uuml;retim nesnesinin test ama&amp;ccedil;lı olarak değiştirilerek kullanılması olarak ifade ediliyor. Hatta kullanım şekline g&amp;ouml;re Dummy, Fake, Stubs, Spies ve Mocks gibi farklı t&amp;uuml;rleri de bulunuyor. En &amp;ccedil;ok kullanılan versiyonlar Mocks ve Stubs nesneleri.&amp;nbsp;"Test Double" t&amp;uuml;rlerini uygulamalarımızda daha kolay kullanabilmek de m&amp;uuml;mk&amp;uuml;n. Bu işe &amp;ouml;zel k&amp;uuml;t&amp;uuml;phaneler bulunmakta.&lt;/p&gt;
&lt;h1&gt;Mock Nesne Kullanımı&lt;/h1&gt;
&lt;p&gt;Şimdi &lt;a href="https://github.com/moq/moq4" target="_blank"&gt;Moq Nuget paketini kullanarak&lt;/a&gt; Stub yerine mock nesne kullanımını nasıl yapabileceğimize bir bakalım. Bu sayede mock kullanımını daha sade bir şekilde &amp;ouml;ğrenebiliriz. İlk olarak test projesine Moq4 paketini eklememiz gerekiyor. Bunun i&amp;ccedil;in Visual Studio Code terminalinden aşağıdaki komutu vermemiz yeterli.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet add package Moq&lt;/pre&gt;
&lt;p&gt;Sonrasında test metodunda Moq k&amp;uuml;t&amp;uuml;phanesini kullanmaya başlayabiliriz. &amp;Ouml;rneğimizde yapıcı metod odaklı enjekte mekanizmasını kullanabiliriz. Hatırlayacağınız gibi bağımlılığın yapıcı metod &amp;uuml;zerinden aktarımı s&amp;ouml;z konusuydu.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using CodeKata.Services;
using Microsoft.VisualStudio.TestTools.UnitTesting;
using Moq;

namespace CodeKata.Tests
{
    [TestClass]
    public class CalculationServiceTests
    {
        [TestMethod]
        public void Should_Return_Current_Invoice_List_Is_Ok()
        {
            var mockUserService=new Mock&amp;lt;IUserService&amp;gt;();
            mockUserService.Setup(o=&amp;gt;o.CheckRequest("{\"operation\":\"Sum\"}")).Returns(true);
            var calcService=new CalculationService(mockUserService.Object);
            var result=calcService.GetInvoices();
            Assert.AreEqual("Invoice list",result);
            mockUserService.Verify(o =&amp;gt; o.CheckRequest("{\"operation\":\"Sum\"}"), Times.Once());
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Mock nesne &amp;ouml;rneğini oluştururken generic bir parametre kullanıyoruz. Burada mock'lamak istediğimiz tip IUserService aray&amp;uuml;z&amp;uuml;. Sonrasında Setup fonksiyonuna bir &amp;ccedil;ağrı yapılıyor. Setup metodunda CheckRequest metodunu &amp;ccedil;ağırıp ve sonucunda da geriye true d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesini istediğimiz belirtiyoruz. Burada ilgili mock tipinin herhangi bir metodunun ele alabiliriz. Yapılan şey o fonksiyon &amp;ccedil;ağırılmış da d&amp;ouml;n&amp;uuml;ş&amp;uuml;nde Returns i&amp;ccedil;erisinde yazan değer d&amp;ouml;nd&amp;uuml;r&amp;uuml;lm&amp;uuml;ş hissiyatını vermek. CalculationService sınıfına ait nesneyi &amp;ouml;rneklerken de yapıcı metoda parametre olarak mock nesnesini bir başka deyişle &amp;ccedil;alışma zamanında IUserService i&amp;ccedil;in &amp;ouml;rneklenen referansını atıyoruz. Sonrasında tek yaptığımız GetInvoices fonksiyonunu &amp;ccedil;ağırmak. Kabul kriterinin kontrol&amp;uuml;nden sonra birde doğrulama işlemimiz var. Burada ilgili operasyonun sadece bir kere &amp;ccedil;ağırılıp &amp;ccedil;ağırılmadığını kontrol etmekteyiz. Test beklendiği gibi &amp;ccedil;alışacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/09/tdd_di_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Pek tabii TDD tarafında Dependency Injection kullanımı bu &amp;ouml;rnek kodlarda olduğu kadar kolay olmayabilir. &amp;Ouml;zellikle legacy olarak anılan eski projleri sonradan Continuous Integration hattına soktuğumuzda test yazmak ger&amp;ccedil;ekten başa bela olabilir. &amp;Ccedil;ok fazla sayıda &amp;ouml;zellik barındıran Entity sınıfları ile y&amp;uuml;r&amp;uuml;yen ve iş akışı karmaşık fonksiyonar i&amp;ccedil;in entegrasyon testleri yazmak istediğinizi d&amp;uuml;ş&amp;uuml;n&amp;uuml;n. Mock nesne kullanımı biraz can acıtıcı olabilir ama uzun vadede rahat edileceği kesindir.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu yazımızda Dependency Injection kavramını entegrasyon testlerinde değerlendirerek daha iyi anlamaya &amp;ccedil;alıştık. Size tavsiyem var olan entegrasyon testlerinizde belli başlı bağımlılıkları mock nesneler kullanarak ortadan kaldırmaya &amp;ccedil;alışmanız olacaktır. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2018-12-21 10:30:00</pubDate>
  <slug>dependency-injection-in-tdd-deki-yeri</slug>
  <tags>
    <tag>unit-test</tag>
    <tag>tdd</tag>
    <tag>test-driven-development</tag>
    <tag>mock</tag>
    <tag>stub</tag>
    <tag>dependency-injection</tag>
    <tag>c#</tag>
    <tag>net-core</tag>
    <tag>visual-studio-code</tag>
    <tag>moq</tag>
    <tag>mocking</tag>
    <tag>mocks</tag>
    <tag>stubs</tag>
    <tag>nuget</tag>
    <tag>dotnet-test</tag>
    <tag>mstest</tag>
    <tag>dotnet</tag>
    <tag>dotnet-core</tag>
    <tag>interface</tag>
    <tag>constructor</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>