<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>NextJS ile Web API Tüketen bir React Uygulaması Geliştirmek</title>
  <description>Geçen sene React ile ilgili basit birkaç örnek denemiiş olmama rağmen öğrendiklerimi çok çabuk unuttuğumu fark ettim. Gerçek saha projelerinde sıklıkla kullanmayınca böyle bir şeyin olması kaçınılmazdı. Dolayısıyla skynet çalışmaları kapsamında tekrardan pratik yapmanın uygun olacağını düşündüm. Bu sefer amacımız Star Wars için https://swapi.dev adresinden sunulan REST servisini tüketen ve karakterlerin listesini gösteren bir web uygulaması geliştirmek. Bunu yaparken hafif siklet kategorisinde sayılan ancak bir çok işi kolaylaştırdığı söylenen Next.Js isimli web framework'ten faydalanacağız.</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/24/nextjs.png" alt="" align="right" /&gt;Ge&amp;ccedil;en sene React ile ilgili basit birka&amp;ccedil; &amp;ouml;rnek denemiiş olmama rağmen &amp;ouml;ğrendiklerimi &amp;ccedil;ok &amp;ccedil;abuk unuttuğumu fark ettim. Ger&amp;ccedil;ek saha projelerinde sıklıkla kullanmayınca b&amp;ouml;yle bir şeyin olması ka&amp;ccedil;ınılmazdı.&amp;nbsp;Dolayısıyla &lt;a href="https://github.com/buraksenyurt/skynet" target="_blank"&gt;skynet &amp;ccedil;alışmaları&lt;/a&gt;&amp;nbsp;kapsamında tekrardan pratik yapmanın uygun olacağını d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m. Bu sefer amacımız Star Wars i&amp;ccedil;in &lt;a href="https://swapi.dev/" target="_blank"&gt;https://swapi.dev&lt;/a&gt; adresinden sunulan REST servisini t&amp;uuml;keten ve karakterlerin listesini g&amp;ouml;steren bir web uygulaması geliştirmek. Bunu yaparken hafif siklet kategorisinde sayılan ancak bir &amp;ccedil;ok işi kolaylaştırdığı s&amp;ouml;ylenen Next.Js isimli web framework'ten faydalanacağız.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin dikkat &amp;ccedil;ekici noktalarından birisi servisin karakter listesini sayfalama yoluyla vermesi. Yani t&amp;uuml;m karakterleri tek seferde veren bir REST servis yerine, diğer sayfaları da ayrı HTTP Get &amp;ccedil;ağrıları ile alacağımız bir yaklaşım s&amp;ouml;z konusu. Servis &amp;ccedil;ağrısı sonrası elde edilen her JSON i&amp;ccedil;eriğinde previous, next gibi &amp;ouml;nceki ve ileriki servis noktalarını referans eden nitelikler bulunduracağız. İşleyiş olarak sayfanın altındaki "Daha fazlası..." yazan d&amp;uuml;ğmeye bastık&amp;ccedil;a yeni i&amp;ccedil;erik var olanın arkasına eklenecek ve liste aşağı doğru uzayıp gidecek. Bu durumu &amp;ouml;ny&amp;uuml;z tarafında y&amp;ouml;netmek i&amp;ccedil;in &amp;ccedil;ekilen i&amp;ccedil;eriği ve sonraki servis adresi bağlantı bilgilerini tutmamız gerekiyor. İşte bu noktada useState, useEffect gibi enstr&amp;uuml;manlarla React Hooks'u tanımaya &amp;ccedil;alışacağız. Ben &amp;ouml;rneğimizi Heimdall&lt;em&gt;(Ubuntu-20.04)&lt;/em&gt; &amp;uuml;st&amp;uuml;nde geliştiriyorum ancak diğer plaformlarda da benzer şekilde yazabilirsiniz. Haydi gelin idmanımıza başlayalım.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# &amp;Ouml;nce next.js destekli react uygulamasını oluşturalım (ben adını star-wars-peoples olarak isimlendirdim)
npx create-next-app

#&amp;Ouml;ny&amp;uuml;z g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml;nde Bootstrap bileşenlerini kullanabilmek i&amp;ccedil;in
npm install react-bootstrap bootstrap&lt;/pre&gt;
&lt;p&gt;Kodsal değişikliklerimiz pages altındaki index.js dosyasında yer alıyor. Burayı incelemeniz konuyu anlamak adına yeterli olacaktır. Pek tabii yorum satırları en b&amp;uuml;y&amp;uuml;k yardımcınız. Bootstrap i&amp;ccedil;inse sadece _app.js d&amp;uuml;zenlenmiştir.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;import { useState, useEffect } from 'react'; //useState ve useEffect kullanımı i&amp;ccedil;in eklendi
import Head from 'next/head'
import styles from '../styles/Home.module.css'
import {Card,ListGroup, Button} from 'react-bootstrap'; // Bootstrap elemanlarını kullanabilmek i&amp;ccedil;in ekledik

const defaultUrl=`https://swapi.dev/api/people/`; // Kullanacağımız servis adresini bir sabit değişkene aldık

/*
  &amp;uuml;stte tanımladığımızı adresi kullanarak t&amp;uuml;m JSON verisini &amp;ccedil;eken asenkron fonksiyonumuz.
  getServerSideProps, nextjs'in veri &amp;ccedil;eken fonksiyonlarından birisidir.
  Farklı isimle kullanmaya &amp;ccedil;alıştığımızda &amp;ccedil;ağırılmadığını g&amp;ouml;r&amp;uuml;r&amp;uuml;r&amp;uuml;z. 
*/
export async function getServerSideProps(){
  const response=await fetch(defaultUrl); // HTTP Get talebini g&amp;ouml;nderdik
  const peoples=await response.json(); // &amp;Ccedil;ekilen veri JSON formatında olduğu i&amp;ccedil;in, d&amp;ouml;n&amp;uuml;şt&amp;uuml;rd&amp;uuml;k
  /*
    component &amp;uuml;zerinde verinin kullanılabilmesi i&amp;ccedil;in properties i&amp;ccedil;erisine ekledik. 
    Bunu Home bileşeninde kullanmak i&amp;ccedil;in parametre olarak eklediğimize dikkat edelim.
  */
  return{
    props:{
      peoples
    }
  }
}

export default function Home({peoples}) { //props ile gelen peoples parametre olarak eklendiği i&amp;ccedil;in i&amp;ccedil;eride kullanılabilecek
  
  // İlk denemede verinin gelip gelmediğini tespit etmek i&amp;ccedil;in kullanabiliriz.
  // console.log('starwars-peoples',peoples); //F12 ile console penceresinden bakılabilir
  
  // İstediğimiz bilgiler JSON verisindeki results altında duruyor. Bunları bir diziye aldık.
  // Div kontrol&amp;uuml;n&amp;uuml;n i&amp;ccedil;eriğini doldururken bir array'den yararlanıyoruz.
  // const results=[]=peoples.results; // State kullanımına ge&amp;ccedil;ildiği i&amp;ccedil;in kapatıldı
  //console.log(results);

  /*
    Sayfanın altında yer alan "Daha fazlası..." d&amp;uuml;ğmesine basılınca var olan durumu korumayı ve &amp;uuml;st&amp;uuml;ne yeni servis talebi ile
    &amp;ccedil;ektiğimiz verileri de ekleyip g&amp;ouml;stermeyi istiyoruz. Bu nedenle result, sonraki sayfa, gibi verileri g&amp;uuml;ncel tutacağımız state
    nesnelerini ele alacağız.
    state'lerde kullanabilmek i&amp;ccedil;in gerekli değişkenleri, peoples ismiyle gelen JSON i&amp;ccedil;eriğinden alıyoruz.
    peoples getServerSideProps sayesinde zaten ilk y&amp;uuml;klemede dolduruluyor.
    swapi'deki json desenine g&amp;ouml;re i&amp;ccedil;inden next ile results niteliklerini alıyoruz.
  */
  const {next, results: defaultResults = [] } = peoples;

  /* 
    results isimli bir sabit tanımladık ve bunun i&amp;ccedil;eriğini updateResults ile g&amp;uuml;ncelleyeceğimizi s&amp;ouml;yledik.
    Varsayılan değerini de peoples isimli json nesnesinden &amp;ccedil;ektiğimiz defaultResults dizisi ile doldurduk.
  */
  const [results, updateResults] = useState(defaultResults);

  /*
    Burada da page isimli bir değişken tanımladık ve
    i&amp;ccedil;eriğini updatePage isimli metodla g&amp;uuml;ncelleyeceğimizi s&amp;ouml;yledik.
    page'in varsayılan değerini de peoples nesnesinden yakaladığımız
    değerlerle doldurduk.
  */
  const [page, updatePage] = useState({
    next,
    current: defaultUrl
  });

  const { current } = page;

  /*
    Bileşen her render edildiğinde devreye giren useEffect metodu React lifecyle s&amp;uuml;recindeki componentDidMount, componentDidUpdate ve componentWillUnmount fonksiyonlarının g&amp;ouml;revini &amp;uuml;stlenmekte.
    
    Bileşen ilk y&amp;uuml;klendiğinde loadMore olay tetiklenmesi ger&amp;ccedil;ekleştiğinde devreye giriyor.
  */
    useEffect(() =&amp;gt; {

    // İlk a&amp;ccedil;ılış sayfasındaysak varsayılan servis linki ge&amp;ccedil;erlidir. 
    // Diğer yandan json'daki next bilgisi null ise son sayfaya gelmişizdir
    // Bu iki halde return edilir.
    if ( page.current === defaultUrl || !current) return;
    
    //Bir request &amp;ccedil;ağrısı aldığımızda (&amp;Ouml;rneğin loadMore tetiklendiğinde)
    async function request() {
      // current ile saklanan adres ne ise oradan veri &amp;ccedil;ekiyoruz
      const res = await fetch(current)
      const data = await res.json();

      // console.log('Gelen i&amp;ccedil;erik-&amp;gt;',data.results);
      // console.log('data.next-&amp;gt;',data.next);
      // console.log('data.previous-&amp;gt;',data.previous);
      // console.log('current page-&amp;gt;',page.current);

      //G&amp;uuml;ncellenen state değişken verisini yenileri ile dolduruyoruz. updatePage, page sabiti ile ilintiliydi 
      updatePage({
        next:data.next,
        current,
      });

      // Eğer gelen json verisindeki previous değeri boşsa(yani ilk sayfadaysak) 
      if ( !data?.previous ) {
        updateResults(data.results); //data'nın sahip olduğu varsayılan veri ile dolduruyoruz
        return;
      }

      /*
        Hali hazırda dolu olan verinin &amp;uuml;st&amp;uuml;ne yeni servis verisini de ekliyoruz.
        Liste aşağıya doğru uzayıp gidecektir b&amp;ouml;ylece. Bunu sağlarken preData ile g&amp;uuml;ncel data.results verisini &amp;uuml;st &amp;uuml;ste ekledik.
        data.results yeni servis &amp;ccedil;ağrısı ile gelen veri, preData ise koruduğumuz veri.
      */
      updateResults(preData =&amp;gt; {
        return [
          ...preData,
          ...data.results
        ]
      });
    }

    request();

  }, [current]);

 function loadMore() {
   /*
    D&amp;uuml;ğmeye basılınca bu fonksiyon &amp;ccedil;alışıyor.
    Fonksiyon updatePage yardımıyla page sabitinin i&amp;ccedil;eriğini g&amp;uuml;ncelliyor.
   */
   updatePage(prePage =&amp;gt; {
     //console.log("pre nedir?-&amp;gt;",prePage);
    return {
      prePage,
       current: page?.next //Sonraki servis adresi verisini aldık
     }
   });
 }

  return (
    &amp;lt;div className={styles.container}&amp;gt;
      &amp;lt;Head&amp;gt;
        &amp;lt;title&amp;gt;Star Wars İnsanları&amp;lt;/title&amp;gt;
      &amp;lt;/Head&amp;gt;

      &amp;lt;main className={styles.main}&amp;gt;
        &amp;lt;h1 className={styles.title}&amp;gt;
          T&amp;uuml;m Karakterler
        &amp;lt;/h1&amp;gt;

        &amp;lt;p className={styles.description}&amp;gt;
          Star Wars evrenindeki t&amp;uuml;m karaktelerin temel bilgilerini bu listede bulabilirsiniz;)
        &amp;lt;/p&amp;gt;

        &amp;lt;ListGroup&amp;gt;
          {results.map(r=&amp;gt;{
            const {name,birth_year,height}=r;
            return(
              &amp;lt;Card styles={{width:'18rem'}}&amp;gt;
                &amp;lt;Card.Body&amp;gt;
                  &amp;lt;Card.Title&amp;gt;
                    {name}
                  &amp;lt;/Card.Title&amp;gt;
                  &amp;lt;Card.Text&amp;gt;
                    {name}, {birth_year} yılında doğmuştur. Boyu {height} cm'dir.
                  &amp;lt;/Card.Text&amp;gt;
                &amp;lt;/Card.Body&amp;gt;
              &amp;lt;/Card&amp;gt;
            )
          })}
        &amp;lt;/ListGroup&amp;gt;

        &amp;lt;div&amp;gt;
          &amp;lt;Button styles="btn btn-primary" onClick={loadMore}&amp;gt;Daha fazlası...&amp;lt;/Button&amp;gt;
        &amp;lt;/div&amp;gt;
        
      &amp;lt;/main&amp;gt;

      &amp;lt;footer className={styles.footer}&amp;gt;
        &amp;lt;a
          href="https://swapi.dev/"
          target="_blank"
          rel="noopener noreferrer"
        &amp;gt;Diğer API Hizmetleri i&amp;ccedil;in tıklayın.
        &amp;lt;/a&amp;gt;
      &amp;lt;/footer&amp;gt;
    &amp;lt;/div&amp;gt;
  )
}&lt;/pre&gt;
&lt;h2&gt;&amp;Ccedil;alışma Zamanı&lt;/h2&gt;
&lt;p&gt;Index sayfasını tamamladıktan sonra terminal'den aşağıdaki komutu verip sonrasında localhost:3000 adresini ziyaret etmemiz yeterli.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm run dev&lt;/pre&gt;
&lt;p&gt;Ve &amp;ccedil;alışma zamanına ait bir g&amp;ouml;r&amp;uuml;nt&amp;uuml;.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/24/Screenshot_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Kodları denerken yorum satırı olan console.log satırlarını a&amp;ccedil;manız işe yarayabilir. F12 Developers Tools sekmesinde bu sayede akan mesajları da g&amp;ouml;rebilirsiniz. Tabii uygulamada ufak bir problemimiz de var. Minik bir bug diyelim :D "Daha fazlası..." butonuna bastık&amp;ccedil;a listemiz a&amp;ccedil;ılıyor ancak bir &amp;ouml;nceki konuma d&amp;ouml;nmemiz m&amp;uuml;mk&amp;uuml;n olmuyor. S&amp;ouml;z gelimi "Azalt..." isimli bir button daha olsa ve buna basılınca state bir &amp;ouml;nceki konumuna d&amp;ouml;nse hi&amp;ccedil; fena olmaz. Sizce bunu yapmak m&amp;uuml;mk&amp;uuml;n m&amp;uuml;? Eğer m&amp;uuml;mk&amp;uuml;n olduğunu d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorsanız l&amp;uuml;tfen yorumlarda belirtip bana yardımcı olun ;) B&amp;ouml;ylece geldik bir skynet derlemesinin daha sonuna. Kaynak kodlara &lt;a href="https://github.com/buraksenyurt/skynet/tree/master/No%2024%20-%20A%20Simple%20React%20App%20with%20NextJS" target="_blank"&gt;github reposu &amp;uuml;zerinden&lt;/a&gt; erişebilirsiniz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2020-07-18 19:22:00</pubDate>
  <slug>nextjs-ile-web-api-tuketen-bir-react-uygulamasi-gelistirmek</slug>
  <tags>
    <tag>nextjs</tag>
    <tag>react</tag>
    <tag>rest</tag>
    <tag>rest-api</tag>
    <tag>rest-based-services</tag>
    <tag>web-framework</tag>
    <tag>react-hooks</tag>
  </tags>
  <categories>
    <category>React</category>
  </categories>
</post>