<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Word Dosyası İçerisinden Entity Framework’ e</title>
  <description>Geliştirdiğimiz veya kullanmakta olduğumuz yazılım ürünlerine dahil olan, farklı segmentlerden gelen pek çok kullanıcı profili vardır. Farklı profillerin olması, bazı hallerde geliştirilmekte olan ürünlerin başarısını doğrudan etkilemektedir. Bir fotoğraf işleme programını geliştirirken çoğu zaman annemizin olası kullanıcı profilleri arasına gireceğini pek düşünmeyiz. Genellikle fotoğraf işleme programını kullanacak olanların, en azından temek düzeyde fotoğrafçılık bilgisine sahip olduğunu kabul eder, menü komutlarını buna göre belirler, arayüzü buna göre hazırlarız. Ama bazı uygulamalarda annemizi hedef alır ve çektiği fotoğraflara kolayca efekt uygulamasına bir kaç basit adımda olanak tanır. Örneğin instagram’ ın iPhone uygulamasında olduğu gibi.</description>
  <content>&lt;p&gt;&lt;span style="color: #ff0000;"&gt;&lt;a href="/pics/275344.jpg"&gt;&lt;img style="float: right; margin: 4px 0px; display: inline;" title="275344" src="/pics/275344_thumb.jpg" alt="275344" width="280" height="187" align="right" /&gt;&lt;/a&gt;[Orjinal Yazım Tarihi 03-15-2013]&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Geliştirdiğimiz veya kullanmakta olduğumuz yazılım &amp;uuml;r&amp;uuml;nlerine dahil olan, farklı segmentlerden gelen pek &amp;ccedil;ok kullanıcı profili vardır. Farklı profillerin olması, bazı hallerde geliştirilmekte olan &amp;uuml;r&amp;uuml;nlerin başarısını doğrudan etkilemektedir.&lt;/p&gt;
&lt;p&gt;Bir fotoğraf işleme programını geliştirirken &amp;ccedil;oğu zaman annemizin olası kullanıcı profilleri arasına gireceğini pek d&amp;uuml;ş&amp;uuml;nmeyiz. Genellikle fotoğraf işleme programını kullanacak olanların, en azından temek d&amp;uuml;zeyde fotoğraf&amp;ccedil;ılık bilgisine sahip olduğunu kabul eder, men&amp;uuml; komutlarını buna g&amp;ouml;re belirler, aray&amp;uuml;z&amp;uuml; buna g&amp;ouml;re hazırlarız. Ama bazı uygulamalarda annemizi hedef alır ve &amp;ccedil;ektiği fotoğraflara kolayca efekt uygulamasına bir ka&amp;ccedil; basit adımda olanak tanır. &amp;Ouml;rneğin &lt;strong&gt;instagram&lt;/strong&gt;&amp;rsquo; ın &lt;strong&gt;iPhone &lt;/strong&gt;uygulamasında olduğu gibi.&lt;/p&gt;
&lt;p&gt;Bir yazılım geliştirme &amp;uuml;r&amp;uuml;n&amp;uuml;n&amp;uuml; tasarlarken ise, son kullanıcının programcılar olduğunu varsayar ve arabirimin karmaşık olmasının herhangibir sorun oluşturmayacağını d&amp;uuml;ş&amp;uuml;n&amp;uuml;r&amp;uuml;z. Oysaki &lt;strong&gt;Team Foundation Server &lt;/strong&gt;gibi geniş &amp;uuml;r&amp;uuml;n yelpazesine sahip aileler d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde, işe dahil olan farklı profildeki kullanıcılar i&amp;ccedil;in işleri kolaylaştırıcı şekilde d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;ne şahit oluruz.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z gelimi proje y&amp;ouml;neticisinin, &lt;strong&gt;Ms Project &lt;/strong&gt;&amp;uuml;r&amp;uuml;n&amp;uuml; ile &lt;strong&gt;TFS&lt;/strong&gt;&amp;rsquo; e entegre olabildiğini, &lt;strong&gt;Scrum Master&lt;/strong&gt;&amp;rsquo; ın isterse t&amp;uuml;m &lt;strong&gt;Product Backlog &lt;/strong&gt;i&amp;ccedil;eriğini bir &lt;strong&gt;Excel&lt;/strong&gt; dosyasına indirip senkronize edebildiğini, &lt;strong&gt;Yazılım Mimarının&lt;/strong&gt; ve &lt;strong&gt;Geliştiricilerin,&lt;/strong&gt; &lt;strong&gt;Visual Studio &lt;/strong&gt;ile ortama bağlanabildikleri ama birim m&amp;uuml;d&amp;uuml;r&amp;uuml; i&amp;ccedil;in sadece &lt;strong&gt;Team Explorer&lt;/strong&gt;&amp;rsquo; ın kafi gelebildiğini, &lt;strong&gt;İş Analisti&lt;/strong&gt; gibi geliştiriciden farklı profile sahip elemanların ise Web aray&amp;uuml;z&amp;uuml;n&amp;uuml; kullanarak basit bir şekilde &lt;strong&gt;Requirement&lt;/strong&gt; ekleyebildikleri g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil; olarak geliştirilen &amp;uuml;r&amp;uuml;n&amp;uuml;n kullanım alanına dahil olan t&amp;uuml;m personeli g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alarak hareket etmemiz gerektiğinin farkında olmalıyız. İşte bu yazımızda bu konuyu tecr&amp;uuml;be etmeye &amp;ccedil;alışacağımız bir &amp;ouml;rnek geliştiriyor olacağız. Şimdi izleyen paragraftaki senaryoyu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;h1&gt;Senaryo&lt;/h1&gt;
&lt;p&gt;&lt;strong&gt;Selim Usta&lt;/strong&gt; bir oto yedek par&amp;ccedil;acıdır. İşlerini kolaylaştırmak amacıyla uzun zamandır bilgisayar &amp;ouml;ğrenmeye &amp;ccedil;alışmaktadır ve en nihayetinde &lt;strong&gt;Word, Excel&lt;/strong&gt; gibi ofis uygulamalarını basit seviyede de olsa kullanmaya başlamıştır. En sık yaptığı işlemlerden birisi ise stoğuna dahil ettiği yeni &amp;uuml;r&amp;uuml;nleri bilgisayarda bir &lt;strong&gt;Word&lt;/strong&gt; dosyasına kaydetmektir. Lakin zaman i&amp;ccedil;erisinde &lt;strong&gt;Word&lt;/strong&gt; dosyası epeyce şişmiş, i&amp;ccedil;eride bir şey aramak epeyce zorlaşmıştır. &amp;Uuml;stelik i&amp;ccedil;eriğin d&amp;uuml;zg&amp;uuml;n bir formatı da yoktur.&lt;/p&gt;
&lt;p&gt;Aslında ihtiyacı olan basit bir aray&amp;uuml;z ile stoğunu takip etmektir. &lt;strong&gt;Rukiye&lt;/strong&gt;, &lt;strong&gt;Selim Usta&lt;/strong&gt;&amp;rsquo; nın torunudur ve &lt;strong&gt;&amp;Uuml;niversite&lt;/strong&gt; son sınıftadır.&lt;strong&gt; Matematik M&amp;uuml;hendisliği&lt;/strong&gt; okumaktadır. Dedesinin işlerini kolaylaştırmak i&amp;ccedil;in bir &lt;strong&gt;Web&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; hazırlamıştır. &lt;strong&gt;Asp.Net MVC&lt;/strong&gt; kullanmıştır. İyi renkler se&amp;ccedil;miş, adımları sadeleştirmiş ve &lt;strong&gt;Selim Usta&lt;/strong&gt; i&amp;ccedil;in kullanıcı deneyimi&lt;em&gt;(User Experience)&lt;/em&gt; epeyce y&amp;uuml;ksek bir arabirim sunmuştur. Herşey yolunda gibidir. Lakin &lt;strong&gt;Selim Usta&lt;/strong&gt;&amp;rsquo; nın vazge&amp;ccedil;emediği alışkanlıkları vardır &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_87.png" alt="Smile" /&gt; Bir g&amp;uuml;n torununa ş&amp;ouml;yle der; &lt;strong&gt;&amp;ldquo;Kızım keşke şu yeni gelen tamponları bu &amp;ouml;ğrendiğim Word ile de kayıt edebilsem. Bu internet &amp;uuml;zerinden girmek zor geliyor bana&amp;hellip;&amp;rdquo;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;İşte şimdi bizim devreye girme sıramız. Bu yazımızda ger&amp;ccedil;ekleştireceğimiz iş, &lt;strong&gt;bir Word dok&amp;uuml;manının i&amp;ccedil;eriğini basit bir şekilde bir veritabanına eklemek&lt;/strong&gt; olacak. Bunun i&amp;ccedil;in &lt;strong&gt;Word&lt;/strong&gt; &amp;uuml;zerinde bazı &lt;strong&gt;Windows&lt;/strong&gt; &lt;strong&gt;Form&lt;/strong&gt; kontrollerini kullanıyor olacağız ve ayrıca kod yazarak, &lt;strong&gt;Entity Framework&lt;/strong&gt; tabanlı giriş işlemleri ger&amp;ccedil;ekleştireceğiz. Dilerseniz hi&amp;ccedil; vakit kaybetmeden yola koyulalım.&lt;/p&gt;
&lt;h1&gt;Word Document Projesini Oluşturmak&lt;/h1&gt;
&lt;p&gt;&lt;strong&gt;Visual Studio 2012&lt;/strong&gt; ortamımızda yeni bir &lt;strong&gt;Solution&lt;/strong&gt; a&amp;ccedil;arak işe başlayabiliriz. İlk projemiz &lt;strong&gt;Visual C#-&amp;gt;Office/SharePoint/Office Add-ins&lt;/strong&gt; sekmesinde yer alan &lt;strong&gt;Word 2010 Document&lt;/strong&gt; tipinden olacak.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wrp_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wrp_1" src="/pics/wrp_1_thumb.png" alt="wrp_1" width="640" height="360" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ProductDocument&lt;/strong&gt; olarak projeyi isimlendirdikten sonra k&amp;uuml;&amp;ccedil;&amp;uuml;k bir soru ile karşılacağız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wrp_2.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wrp_2" src="/pics/wrp_2_thumb.png" alt="wrp_2" width="573" height="449" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Yeni bir dok&amp;uuml;man oluşturarak ilerlemeyi tercih edelim. Ama var olan bir dok&amp;uuml;manı da kullanabiliriz. Bu işlemlerin sonucunda &lt;strong&gt;Visual Studio&lt;/strong&gt; ortamımız aşağıdaki şekle b&amp;uuml;r&amp;uuml;necektir &lt;img class="wlEmoticon wlEmoticon-surprisedsmile" style="border-style: none;" src="/pics/wlEmoticon-surprisedsmile_5.png" alt="Surprised smile" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wrp_3.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wrp_3" src="/pics/wrp_3_thumb.png" alt="wrp_3" width="640" height="440" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;IDE&lt;/strong&gt;&amp;rsquo; nin g&amp;ouml;beğinde &lt;strong&gt;docx&lt;/strong&gt; uzantılı bir &lt;strong&gt;Word&lt;/strong&gt; belgesi yer almaktadır. Hatta &lt;strong&gt;Solution Explorer&lt;/strong&gt; penceresine baktığımızda, &lt;strong&gt;ThisDocument.cs&lt;/strong&gt; isimli bir sınıf dosyası olduğunu, &lt;strong&gt;Toolbox&lt;/strong&gt; i&amp;ccedil;erisinde ise pek &amp;ccedil;ok &lt;strong&gt;Form&lt;/strong&gt; kontrol&amp;uuml;n&amp;uuml;n yer aldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_184.png" alt="Winking smile" /&gt; Bu, kısaca şu anlama gelmektedir; &lt;strong&gt;Word Object Model&lt;/strong&gt;&amp;rsquo; in &amp;uuml;zerine &lt;strong&gt;Windows Form&lt;/strong&gt; kontrollerini ekleyebilir ve &lt;strong&gt;C#&lt;/strong&gt; ile kodlama yapabiliriz. &amp;Ouml;yleyse &lt;strong&gt;Selim Usta&lt;/strong&gt; i&amp;ccedil;in basit bir i&amp;ccedil;erik hazırlayarak ilerleyelim&lt;em&gt;(Word Object Model ile ilişkili olarak &lt;a href="http://msdn.microsoft.com/en-us/library/vstudio/kw65a0we.aspx" target="_blank"&gt;bu adresten daha detaylı bilgi&lt;/a&gt; tedarik edebilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;h1&gt;Word Tasarımını Yapalım&lt;/h1&gt;
&lt;p&gt;&lt;strong&gt;Word&lt;/strong&gt; belgesini &lt;strong&gt;Ribon&lt;/strong&gt; tarafında yer alan bileşenler ile donatabileceğimiz gibi &lt;strong&gt;Toolbox &lt;/strong&gt;&amp;uuml;zerinde yer alan &lt;strong&gt;Component&lt;/strong&gt;&amp;rsquo; leri i&amp;ccedil;ermesini de sağlayabiliriz. Bu anlamda melez bir aray&amp;uuml;z geliştirme ortamı oluştuğunu ifade edebiliriz. Hem &lt;strong&gt;Word&lt;/strong&gt; hem de &lt;strong&gt;Windows Forms&lt;/strong&gt; kontrollerini bir arada ele alabilmekteyiz. Bu d&amp;uuml;ş&amp;uuml;nceler ışığında &lt;strong&gt;Selim Usta&lt;/strong&gt; i&amp;ccedil;in aşağıdaki formu oluşturduğumuzu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wrp_4.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wrp_4" src="/pics/wrp_4_thumb.png" alt="wrp_4" width="635" height="688" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Word&lt;/strong&gt; i&amp;ccedil;eriğine &lt;strong&gt;TextBox, DateTimePicker, NumericUpDown, Button&lt;/strong&gt; kontrolleri eklenmiştir. Kontrollere kod tarafı i&amp;ccedil;in anlamlı isimler vererek ilerleyelim. Ben &amp;ouml;rnekte &lt;strong&gt;[KontrolTipi][TabloKolonAdı]&lt;/strong&gt; şeklinde bir notasyon kullandım. Yani &lt;strong&gt;Name&lt;/strong&gt; alanı i&amp;ccedil;in &lt;strong&gt;TextBoxName&lt;/strong&gt;, a&amp;ccedil;ıklama alanı i&amp;ccedil;in &lt;strong&gt;TextBoxDescription&lt;/strong&gt; vb&amp;hellip;&lt;/p&gt;
&lt;h1&gt;Entity Framework &amp;Ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;n&amp;uuml;n Eklenmesi&lt;/h1&gt;
&lt;p&gt;&lt;strong&gt;Solution&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt;Entity Framework&lt;/strong&gt; tabanlı bir &lt;strong&gt;Class&lt;/strong&gt; &lt;strong&gt;Library&lt;/strong&gt; projesi de yer almaktadır. S&amp;ouml;z konusu proje bir &lt;strong&gt;Ado.Net Entity Model&lt;/strong&gt; &amp;ouml;ğesi bulundurmakta olup aşağıdaki diagramda g&amp;ouml;r&amp;uuml;len i&amp;ccedil;eriğe sahiptir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wrp_5.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wrp_5" src="/pics/wrp_5_thumb.png" alt="wrp_5" width="410" height="550" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Product&lt;/strong&gt; &lt;strong&gt;Entity&lt;/strong&gt; tipi, &lt;strong&gt;Depomuz&lt;/strong&gt; isimli &lt;strong&gt;SQL 2008&lt;/strong&gt; veritabanında yer alan &lt;strong&gt;Product&lt;/strong&gt; tablosunu işaret etmektedir. Otomatik artan ve &lt;strong&gt;Primary Key&lt;/strong&gt; olan &lt;strong&gt;ProductId&lt;/strong&gt; alanı dışında, &lt;strong&gt;Name&lt;/strong&gt;(nvarchar(50)), &lt;strong&gt;Description&lt;/strong&gt;(nvarchar(250)), &lt;strong&gt;ListPrice&lt;/strong&gt;(decimal(18,0)), &lt;strong&gt;RealPrice&lt;/strong&gt;(decimal(18,0)), &lt;strong&gt;InsertDate&lt;/strong&gt;(Date), &lt;strong&gt;Quantity&lt;/strong&gt;(int) ve &lt;strong&gt;Notes&lt;/strong&gt;(nvarchar(250)) gibi kolonları da i&amp;ccedil;ermektedir.&lt;/p&gt;
&lt;p&gt;Pek tabi bir &lt;strong&gt;Word&lt;/strong&gt; dok&amp;uuml;manından &lt;strong&gt;C#&lt;/strong&gt; kodlarını kullanarak farklı bir k&amp;uuml;t&amp;uuml;phaneye erişebildiğimize g&amp;ouml;re, &lt;strong&gt;WCF&lt;/strong&gt; servislerini de &amp;ccedil;ağırmamız m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. &amp;Ouml;zellikle bir şirketin bu tip bir dok&amp;uuml;manı kullanarak, &amp;ccedil;eşitli &lt;strong&gt;Repository&lt;/strong&gt;&amp;rsquo; lere kayıt atması istenen durumlarda, bir &lt;strong&gt;Servis&lt;/strong&gt; kanalına uğranmasını sağlamak yerinde bir davranış olabilir. &lt;em&gt;(Dolayısıyla senaryonuzu, &lt;strong&gt;Entity Framework&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesi ile &lt;strong&gt;Word&lt;/strong&gt; projesi arasına bir&lt;strong&gt; WCF Servisi&lt;/strong&gt; sokarak genişletebilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;h1&gt;Kodlar&lt;/h1&gt;
&lt;p&gt;Tabiki ilk etapta &lt;strong&gt;Word&lt;/strong&gt; projesinin, &lt;strong&gt;Entity Library&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesini referans etmesi gerekmektedir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Burada dikkat edilmesi gereken noktalardan birisi de Target Framework se&amp;ccedil;imidir. Oluşturduğumuz Word Document projesi .Net Framework 4.0 odaklıdır. Bu sebeple Entity Framework tabanlı olan Class Library projesinin de .Net Framework 4.0 odaklı olması gerekmektedir. Aksi durumda Target Framework uyuşmazlığı oluşuacak ve Word Document tipi projeye eklenen referans i&amp;ccedil;in bir Warning alınacaktır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Kod yazımı işin eğlenceli taraflarından birisidir elbette &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_184.png" alt="Winking smile" /&gt;&amp;nbsp;&lt;strong&gt;Word&lt;/strong&gt; projesindeki &lt;strong&gt;docx&lt;/strong&gt; dosyası, bir de &lt;strong&gt;C#&lt;/strong&gt; kod dosyası i&amp;ccedil;ermektedir. Burada &lt;strong&gt;Word&lt;/strong&gt;&amp;rsquo; &amp;uuml;n &lt;strong&gt;Object Model&lt;/strong&gt;&amp;rsquo; ine &lt;strong&gt;this&lt;/strong&gt; anahtar kelimesi &amp;uuml;zerinden kolayca erişilebilinir. Daha da &amp;ouml;nemlisi bazı olaylar&lt;em&gt;(Events)&lt;/em&gt; y&amp;uuml;klenerek dok&amp;uuml;manının davranışları fonksiyonel olarak değiştirilebilir. &amp;Ouml;rneğin bu &lt;strong&gt;Word&lt;/strong&gt; dok&amp;uuml;manı kayıt edilmeden &amp;ouml;nce veya sonra devreye girecek&lt;strong&gt; olay metodları&lt;em&gt;(Event Handlers) &lt;/em&gt;&lt;/strong&gt;dahil edilebilir. Dolayısıyla yapabileceklerimiz olduk&amp;ccedil;a geniş bir yelpazeye yayılmaktadır. Biz &amp;ouml;rneğimizde olduk&amp;ccedil;a basit ilerledik ve aşağıdaki kod yapısını oluşturduk.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using AzonEntityLibrary; 
using System; 
using System.Windows.Forms; 
using Word = Microsoft.Office.Interop.Word;

namespace ProductDocument 
{ 
    public partial class ThisDocument 
    { 
        private void ThisDocument_Startup(object sender, System.EventArgs e) 
        { 
            this.Application.DocumentBeforeSave += Application_DocumentBeforeSave; 
        }

        private void ThisDocument_Shutdown(object sender, System.EventArgs e) 
        {

        }

        void Application_DocumentBeforeSave(Word.Document Doc, ref bool SaveAsUI, ref bool Cancel) 
        { 
            SaveToDatabase(); 
        }

        private bool SaveToDatabase() 
        { 
            bool result = false; 
            try 
            { 
                using (DepomuzEntities context = new DepomuzEntities()) 
                { 
                    Product newProduct = new Product 
                    { 
                        Name = TextBoxName.Text, 
                        Description = TextBoxDescription.Text, 
                        InsertDate = DateTimePickerEnterDate.Value, 
                        ListPrice = System.Convert.ToDecimal(TextBoxListPrice.Text), 
                        RealPrice = System.Convert.ToDecimal(TextBoxRealPrice.Text), 
                        Quantity = System.Convert.ToInt32(NumericUpDownQuantity.Value), 
                        Notes = TextBoxNotes.Text 
                   }; 
                    context.Products.Add(newProduct); 
                    context.SaveChanges();

                    result = true;

                    MessageBox.Show( 
                        string.Format("Selim Ustam &amp;uuml;r&amp;uuml;n {0} numarası ile dosyalandı" 
                        ,newProduct.ProductId.ToString())); 
                } 
            } 
            catch(Exception excp) 
            { 
                MessageBox.Show("Selim Ustam beni arar mısın? Sanırım işlemin sırasında bir hata oluştu"); 
                //TODO@Rukiye burada oluşan istisnaları kendime mail atayım ve hatta log dosyasına yazdırayım 
            }

            return result; 
        }

        private void ButtonAdd_Click(object sender, EventArgs e) 
        { 
            SaveToDatabase(); 
        }

        #region VSTO Designer generated code

        /// &amp;lt;summary&amp;gt; 
        /// Required method for Designer support - do not modify 
        /// the contents of this method with the code editor. 
        /// &amp;lt;/summary&amp;gt; 
        private void InternalStartup() 
        { 
           this.ButtonAdd.Click += new System.EventHandler(this.ButtonAdd_Click); 
            this.Startup += new System.EventHandler(this.ThisDocument_Startup); 
            this.Shutdown += new System.EventHandler(this.ThisDocument_Shutdown); 
        }

        #endregion 
    } 
}&lt;/pre&gt;
&lt;p&gt;Kod dosyasında dikkat &amp;ccedil;eken noktalardan birisi default olarak &amp;uuml;retilen olay metodlarıdır. &lt;strong&gt;ThisDocument_Startup&lt;/strong&gt; ve &lt;strong&gt;ThisDocument_Shutdown&lt;/strong&gt;. Bu olay metodları Word dok&amp;uuml;manı başlatılırken ve kapatılırken devreye girmektedir. &amp;Ouml;rnekte, &lt;strong&gt;ThisDocument_Startup&lt;/strong&gt; fonksiyonunda, &lt;strong&gt;DocumentBeforeSave&lt;/strong&gt; olay metodunun y&amp;uuml;klenmesi işlemi yapılmıştır.&lt;/p&gt;
&lt;p&gt;Yeni bir &amp;uuml;r&amp;uuml;n&amp;uuml;n &lt;strong&gt;Entity Framework&lt;/strong&gt; &amp;uuml;zerinden veritabanına kayıt edilmesi işlemi iki farklı noktadan tetiklenmektedir. Birincisi, &lt;strong&gt;Word&lt;/strong&gt; dok&amp;uuml;manının &lt;strong&gt;Save&lt;/strong&gt; komutu verildikten ama &lt;strong&gt;Save&lt;/strong&gt; operasyonu tamamlanmadan &amp;ouml;ncedir. Bunun i&amp;ccedil;in dikkat edileceği &amp;uuml;zere &lt;strong&gt;Application&lt;/strong&gt; referansı &amp;uuml;zerinden &lt;strong&gt;DocumentBeforeSave&lt;/strong&gt; olay metodu y&amp;uuml;klenmiştir. İkinci tetikleme noktamız ise &lt;strong&gt;Word&lt;/strong&gt; dok&amp;uuml;manı &amp;uuml;st&amp;uuml;ne atılmış olan &lt;strong&gt;Button&lt;/strong&gt; kontrol&amp;uuml;n&amp;uuml;n &lt;strong&gt;Click&lt;/strong&gt; olay metodudur. Yani, bir &lt;strong&gt;Word&lt;/strong&gt; dok&amp;uuml;manının var olan &lt;strong&gt;Object Model&amp;rsquo;&lt;/strong&gt; ine ait olay metodlarından yararlanılabileceği gibi, dok&amp;uuml;man &amp;uuml;zerine bırakılmış &lt;strong&gt;Windows Form&lt;/strong&gt; kontrollerinin olay metodlarından da yararlanılabilinir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;SaveToDatabase&lt;/strong&gt; metodu i&amp;ccedil;erisinde &lt;strong&gt;Context&lt;/strong&gt; nesnesi kullanılmaktadır. &lt;strong&gt;Word&lt;/strong&gt; dok&amp;uuml;manı &amp;uuml;zerindeki kontrollere ait bilgiler yeni &amp;uuml;retilen &lt;strong&gt;Product&lt;/strong&gt; nesne &amp;ouml;rneğinin &amp;ouml;zelliklerine set edildikten sonras ise kayıt altına alma işlemi yapılmaktadır. Yeni &lt;strong&gt;Product&lt;/strong&gt; &amp;ouml;rneği, &lt;strong&gt;Products&lt;/strong&gt; &amp;ouml;zelliği &amp;uuml;zerinden &lt;strong&gt;Add&lt;/strong&gt; metodu ile &lt;strong&gt;generic DbSet&lt;/strong&gt;&amp;rsquo; e&amp;nbsp; ilave edildikten sonra &lt;strong&gt;SaveChanges&lt;/strong&gt; &amp;ccedil;ağrısı ile de veritabanına yazılmaktadır.&lt;/p&gt;
&lt;h1&gt;Kaba Testler&lt;/h1&gt;
&lt;p&gt;Uygulamayı &lt;strong&gt;F5&lt;/strong&gt; ile &amp;ccedil;alıştırdığımızda ve &amp;ouml;rnek bazı veriler girdiğimizde kayıt işleminin başarılı bir şekilde ger&amp;ccedil;ekleştirildiğine dair bir mesaj kutusu ile karşılaşırız. Aynen aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki gibi.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wrp_6.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wrp_6" src="/pics/wrp_6_thumb.png" alt="wrp_6" width="632" height="765" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Ki eklenme işleminin başarılı olup olmadığını hemen veritabanına bakarak &amp;ouml;ğrenebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wrp_8.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wrp_8" src="/pics/wrp_8_thumb.png" alt="wrp_8" width="640" height="50" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Eğer ters bir durum oluşursa&lt;em&gt;(&amp;ouml;rneğin form boş iken Save etmeye &amp;ccedil;alışmak gibi)&lt;/em&gt;, bu durumda bir &amp;ccedil;alışma zamanı hatası alınacak ama durum &lt;strong&gt;Selim Usta&lt;/strong&gt;&amp;rsquo; ya yumuşatılarak iletilecektir &lt;img class="wlEmoticon wlEmoticon-laughingoutloud" style="border-style: none;" src="/pics/wlEmoticon-laughingoutloud_8.png" alt="Laughing out loud" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wrp_7.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wrp_7" src="/pics/wrp_7_thumb.png" alt="wrp_7" width="628" height="424" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;h1&gt;Build Sonrası&lt;/h1&gt;
&lt;p&gt;Aslında uygulamanın Build sonrası durumuna baktığımızda aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len i&amp;ccedil;eriğin &amp;uuml;retildiğini fark edebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wrp_9.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wrp_9" src="/pics/wrp_9_thumb.png" alt="wrp_9" width="263" height="343" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Word Document&lt;/strong&gt; projesi,&lt;strong&gt; ProductDocument.docx&lt;/strong&gt; haricinde, &lt;strong&gt;Solution&lt;/strong&gt; da kullanılan başka dosyaları da doğal olarak i&amp;ccedil;erecektir. Tabi burada akla gelen ilk soru bu i&amp;ccedil;eriği nasıl dağıtılabileceğidir? &lt;strong&gt;Development&lt;/strong&gt; yapılan makinede herhangibir sorun olmayacaktır. &lt;strong&gt;Debug&lt;/strong&gt; veya &lt;strong&gt;Release&lt;/strong&gt; klas&amp;ouml;r&amp;uuml;ndeki &lt;strong&gt;ProductDocument.dox&lt;/strong&gt; dosyasının &amp;ccedil;alıştırılması yeterlidir. Ancak bu &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; &lt;strong&gt;Selim Usta&lt;/strong&gt;&amp;rsquo; nın bilgisayarına y&amp;uuml;klemek i&amp;ccedil;in en azından bir &lt;strong&gt;Setup&lt;/strong&gt; paketine sahip olmak dağıtım işini kolaylaştıracaktır.&lt;/p&gt;
&lt;p&gt;Bunun i&amp;ccedil;in &lt;strong&gt;Publish&lt;/strong&gt; işlemi &lt;strong&gt;Word Document&lt;/strong&gt; projesi i&amp;ccedil;in uygulanabilir. Burada &lt;strong&gt;Click Once&lt;/strong&gt; teknolojisinden yararlanılabildiğini de belirtelim. Bir &lt;strong&gt;Publish&lt;/strong&gt; paketini s&amp;ouml;z konusu uygulama i&amp;ccedil;in nasıl hazırlayabileceğinizi &lt;a href="http://msdn.microsoft.com/en-us/library/vstudio/bb772100.aspx" target="_blank"&gt;MSDN &amp;uuml;zerindeki bu adresten &amp;ouml;ğrenebilirsiniz&lt;/a&gt;. Detayları ayrı bir makale konusu olacağından burada derinlemesine incelemedik.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;İlgili adresteki i&amp;ccedil;eriği dikkatlice okumanızı ve &amp;ouml;zellikle Post-Deployment kullanımına bakmanızı &amp;ouml;neririm. Nitekim Post-Deployment sırasında, ilgili Word dosyasının bir kopyasının istemci bilgisayarda istenen bir klas&amp;ouml;re atanması işlemi ger&amp;ccedil;ekleştirilebilmektedir. Ayrıca Publisher&amp;rsquo; ın Trusted olarak kabul edilebilmesi i&amp;ccedil;in gerekli Signing işlemlerini de atlamayın derim &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_184.png" alt="Winking smile" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;Publish&lt;/strong&gt; işlemi sonrası aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer bir i&amp;ccedil;erik oluşacaktır. Setup dosyasını kullanarak tipik bir install işlemi ger&amp;ccedil;ekleştirebilirsiniz. Ayrıca bu klas&amp;ouml;rde yer alan &lt;strong&gt;ProductDocument&lt;/strong&gt; &amp;ccedil;alıştırıldığında doğrudan tasarlamış olduğumuz &lt;strong&gt;Form&lt;/strong&gt;&amp;rsquo; un a&amp;ccedil;ıldığını g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wrp_10.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wrp_10" src="/pics/wrp_10_thumb.png" alt="wrp_10" width="436" height="178" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;h1&gt;Sonu&amp;ccedil;&lt;/h1&gt;
&lt;p&gt;Geliştirdiğimiz &amp;ouml;rnek aslında &lt;strong&gt;Document Level&lt;/strong&gt; tipinden kabul edilen bir proje uygulamasıdır. İstenirse &lt;strong&gt;Application Level&lt;/strong&gt; şeklinde bir proje de &amp;uuml;retilebilir ki bu durumda t&amp;uuml;m &lt;strong&gt;Word&lt;/strong&gt; dok&amp;uuml;manları i&amp;ccedil;in uygulama seviyesinde bir geliştirme yapma şansına sahip olabiliriz. Elbette yazımıza konu olan ve &lt;strong&gt;Selim Usta&lt;/strong&gt;&amp;rsquo; nın işine yarayacağını d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml;n geliştirilmesi gereken pek &amp;ccedil;ok yeri vardır. &amp;Ouml;rneğin,&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Form &amp;uuml;zerinde bir &lt;strong&gt;doğrulama&lt;em&gt;(Validation)&lt;/em&gt;&lt;/strong&gt; mekanizması mevcut değildir. &amp;Ccedil;ok doğal olarak Selim Usta sayısal olması gereken alanlara metinsel i&amp;ccedil;erik girebilir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Word&lt;/strong&gt; dosyası &amp;uuml;zerinden yeni bir &amp;uuml;r&amp;uuml;n eklendiğinde belki form temizlenebilir ve hatta belki de alt sayfalarda yer alan bir &lt;strong&gt;DataGridView&lt;/strong&gt; kontrol&amp;uuml; i&amp;ccedil;erisine, yapılan ekler basılarak &amp;ouml;zet bir durum raporu sunulabilir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Selim Usta&lt;/strong&gt; dalgınlıkla yanlış bir i&amp;ccedil;erik girebilir. Bu durumda ilgili kayıtları silmek isteyecektir. Bu vakanın da dok&amp;uuml;man yoluyla karşılanması gerekebilir. Ya da mevzunun Rukiye&amp;rsquo; ye iletilmesi yolu tercih edilebilir &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_87.png" alt="Smile" /&gt;&lt;/li&gt;
&lt;li&gt;Bir &lt;strong&gt;WCF&lt;/strong&gt; servis katmanının olması da &amp;ccedil;ok daha iyi olabilir. Nitekim bu sayede &lt;strong&gt;Word Document&lt;/strong&gt; projesini kullanan herhangibir istemci bilgisayarının sadece servise ulaşması yeterli olacaktır. Ki servis de Host edildiği makinede &lt;strong&gt;Entity Framework&amp;rsquo;&lt;/strong&gt; &amp;uuml; kullanarak bir&lt;strong&gt; Repository&amp;rsquo;&lt;/strong&gt; ye yazma işlemini icra edebilir ve bu sayede &lt;strong&gt;Word&lt;/strong&gt; dosyasının olduğu bilgisayar i&amp;ccedil;in &lt;strong&gt;Loosely Coupled&lt;/strong&gt; bir ge&amp;ccedil;erlilik de sağlanmış olur.&amp;nbsp;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bu ve benzeri eksiklikleri siz değerli okurlarıma bırakıyorum. Diğer yandan senaryoyu biraz daha farklılaştırabilirsiniz. S&amp;ouml;z gelimi &lt;strong&gt;TFS Client Object Model&lt;/strong&gt;&amp;rsquo; i de işin i&amp;ccedil;erisine katabilir ve bir &lt;strong&gt;Word&lt;/strong&gt; &lt;strong&gt;Template&lt;/strong&gt;&amp;rsquo; i &amp;uuml;zerinden &lt;strong&gt;Product Backlog Item&lt;/strong&gt; ve &lt;strong&gt;Task&lt;/strong&gt; girişlerini yaptırabilirsiniz. Bu &amp;ouml;dev i&amp;ccedil;in aşağıdaki grafiği g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabilirsiniz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wrp_11.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wrp_11" src="/pics/wrp_11_thumb.png" alt="wrp_11" width="573" height="454" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_184.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2013%2f2%2fHowTo_Word.zip"&gt;HowTo_Word.zip (1,80 mb)&lt;/a&gt;&amp;nbsp; &lt;br /&gt;&lt;span style="color: #ff0000;"&gt;[Dosya boyutunun k&amp;uuml;&amp;ccedil;&amp;uuml;lmesi i&amp;ccedil;in Packages ve Release klas&amp;ouml;rleri silinmiştir]&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="color: #ff0000;"&gt;[Orjinal Yazım Tarihi 03-15-2013]&lt;/span&gt;&lt;/p&gt;</content>
  <pubDate>2013-07-17 17:26:00</pubDate>
  <slug>Word-Dosyasi-Icerisinden-Entity-Frameworke</slug>
  <tags>
    <tag>office-development</tag>
    <tag>word-projects</tag>
    <tag>microsoft-word</tag>
    <tag>office</tag>
    <tag>word-addin</tag>
    <tag>addin</tag>
    <tag>visual-studio-2012</tag>
    <tag>net</tag>
    <tag>c#</tag>
    <tag>entity-framework</tag>
    <tag>document-level</tag>
    <tag>application-level</tag>
    <tag>word-object-model</tag>
  </tags>
  <categories>
    <category>Office Development</category>
  </categories>
</post>