<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Rust Pratikleri - Wordle Oyunu</title>
  <description>Doğruyu söylemek gerekirse mobil oyunlarla çok fazla aram yok. Yine de etkileyici grafikleri olmasa da insanları saatlerce esir edebilenlerin nasıl yazıldığını merak etmiyor da değilim. Geçtiğimiz günlerde The Pragmatic Programmers mecrasından Herbert Wolverson'un Wordle isimli popüler bir oyunun Rust ile nasıl yazılacağını anlattığı şu yazısına denk geldim. E boş durur muyum? Adım adım tatbik etmeye karar verdim. Nitekim bu yolculuk Rust ile ilgili birçok şey öğretecekti bana. Her şeyden önce pratik yapacaktım. İşte bu yazıda izlediğim adımları ve kendi yorumlarımı bulabilirsiniz.</description>
  <content>&lt;p&gt;Doğruyu s&amp;ouml;ylemek gerekirse mobil&amp;nbsp;oyunlarla &amp;ccedil;ok fazla aram yok. Ancak platform ne olursa olsun oyun yazmaya &amp;ccedil;alışmak programlama dili &amp;ouml;ğrenenler i&amp;ccedil;in &amp;ccedil;ok iyi bir egzersiz. Bu nedenle bazen var olan oyunların nasıl yazıldığını anlatan &amp;ouml;ğretileri uygulamaya &amp;ccedil;alışıyorum.&amp;nbsp;Ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde&amp;nbsp;&lt;a href="https://medium.com/pragmatic-programmers" target="_blank"&gt;The Pragmatic Programmers&lt;/a&gt; mecrasından Herbert Wolverson'un Wordle isimli pop&amp;uuml;ler bir oyunun Rust ile nasıl yazılabileceğini anlattığı &lt;a title="Herbert Wolverson" href="https://medium.com/pragmatic-programmers/rustle-5c15d1c153a1" target="_blank"&gt;şu yazısına&lt;/a&gt; denk geldim. Tamda başta belirttiğim tipte bir egzersiz karşıma &amp;ccedil;ıkmıştı. E boş durur muyum? Adım adım tatbik etmeye karar verdim. Nitekim bu yolculuk Rust ile ilgili bir&amp;ccedil;ok şey &amp;ouml;ğretecekti bana. Her şeyden &amp;ouml;nce pratik yapacaktım. İşte bu yazıda izlediğim adımları ve kendi yorumlarımı bulabilirsiniz.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikle Wordle oyunu nasıl bir şey anlamak lazım. Google Play veya App Store'dan indirebileceğimiz oyunun Huawei App Gallery'de bir karşılığını bulamadım ama benzerleri vardı. &amp;Ouml;nce oynamalıydım ki nasıl bir şey olduğunu anlayayım. D&amp;uuml;ş&amp;uuml;nd&amp;uuml;ren bir kelime oyunu olduğunu ifade edebilirim. Hatta isterseniz &lt;a title="Wordle Game" href="https://www.nytimes.com/games/wordle/index.html" target="_blank"&gt;Newyork Times'ın şu adresinden&lt;/a&gt;&amp;nbsp;hemen &amp;ccedil;evrimi&amp;ccedil;i bir s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; de deneyebilirsiniz. Kendi denememden bir &amp;ouml;rneği de aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile paylaşmak isterim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Nisan/wordle_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Program 5 harfli bir kelime tutuyor ve oyun sahası 5 s&amp;uuml;t&amp;uuml;n, 6 satırdan oluşuyor. İlk satıra&lt;em&gt;(en &amp;uuml;st satır)&lt;/em&gt; 5 harfli ve anlamlı bir kelime yazarak başlıyorsunuz. Program yazdığınız kelimeye bakıp harflerin doğru yerleşimde olup olmadığını kontrol ediyor. Eğer harf tam da yerindeyse arka planı yeşil renge boyuyor. Harf doğru ama&amp;nbsp;yanlış yerdeyse bu sefer arka planı sarı renge boyuyor. Eğer harf programın tuttuğu kelimede yoksa gri rengi kullanıyor. Kullanılan harfleri de aşağıdaki klavyede farklı renklere boyayarak işaretliyor. Bu ipu&amp;ccedil;larından yararlanan oyuncu doğru kelimeyi bulmaya &amp;ccedil;alışıyor ve hakkı olduğu s&amp;uuml;rece&amp;nbsp;sonraki satıra ge&amp;ccedil;ip yeni bir tahminde bulunuyor. Ben ilk satırda S ve E harflerini tutturdum ama yerleri yanlıştı. İkinci denemede ise b&amp;uuml;y&amp;uuml;k bir şans eseri birinci harfi tam da olması gerektiği yerde buldum. Ancak E ve T harfleri halen yanlış yerdeydi. Sonu&amp;ccedil; olarak 6ncı seferde SWEER kelimesini bulmayı başardım. Şimdi Herbert'e kulak verelim. Bakalım neler neler yapacağız? :)&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# &amp;Ouml;nce projeyi oluşturuyoruz elbette
cargo new wordle&lt;/pre&gt;
&lt;p&gt;Programda iki yardımcı k&amp;uuml;fe/sandık&lt;em&gt;(crate)&lt;/em&gt; kullanılıyor. Pek &amp;ccedil;ok rust &amp;ouml;ğretisinde rastgele sayı &amp;uuml;retmek i&amp;ccedil;in rand paketi kullanılmakta. Bu &amp;ouml;rnekte ise bracket-random isimli bir paket var. Esasında bracket-random, Herbert'in &lt;a title="Hands-On Rust" href="https://www.amazon.com/Hands-Rust-Effective-Learning-Development-dp-1680508164/dp/1680508164/ref=mt_other?_encoding=UTF8&amp;amp;me=&amp;amp;qid=" target="_blank"&gt;Hands-On Rust,Effective Learning through 2D Game Development and Play&lt;/a&gt;&amp;nbsp;isimli kitabında kullandığı bracket ekosisteminin bir par&amp;ccedil;ası.&amp;nbsp;Diğer yandan terminal penceresini renklendirmek i&amp;ccedil;in&lt;em&gt;(ki bayılırım buna)&lt;/em&gt; colored isimli bir mod&amp;uuml;lden yararlanılmakta. Bu paket bildirimlerini tahmin edileceği &amp;uuml;zere toml dosyasına eklememiz gerekiyor.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;[dependencies]
bracket-random = "0.8.2"
colored="2.0.0"&lt;/pre&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak program bir veri havuzundan rastgele bir kelime tutmalı. Tabii ki oyuncuya g&amp;ouml;stermeden :P Herbert bu kelime havuzunu oluşturmak i&amp;ccedil;in kaynak olarak &lt;a title="Sample data for wordle game" href="https://www.wordgamedictionary.com/twl06/download/twl06.txt" target="_blank"&gt;şu adresteki text dosya i&amp;ccedil;eriğini &amp;ouml;nermiş&lt;/a&gt;. Ben işi uzatmamak i&amp;ccedil;in aynı veri kaynağını kullanarak devam ettim lakin farklı bir alandaki s&amp;ouml;zl&amp;uuml;ğ&amp;uuml; de kullanabiliriz. &amp;Ouml;rneğin 5 harfli bilişim terimleri gibi. Hen&amp;uuml;z anlayamadım ama veri dosyasında 5 harfli dışında bir&amp;ccedil;ok kelime de yer alıyor. Sanırım sadece beş harflileri ayıklamak zor olduğu i&amp;ccedil;in komple alıp kullanmış. Elbette kod tarafında 5 harfli olmayanları eleyeceğiz. Dosyayı words.data ismiyle src klas&amp;ouml;r&amp;uuml; altına ekleyerek devam edebiliriz. Main fonksiyonunun fazla karışmaması i&amp;ccedil;in &amp;ccedil;ekirdek fonksiyonları lib.rs isimli yeni bir mod&amp;uuml;l &amp;uuml;st&amp;uuml;nde tutabiliriz.&amp;nbsp;Uzun bir i&amp;ccedil;erik ancak sabırlı olun.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;/*
   Kelime listesi sadece okuma ama&amp;ccedil;lı kullanılacak.
   include_str! makrosu parametre olarak gelen dosyayı derleme zamanında alıp kaynak kodun i&amp;ccedil;erisine g&amp;ouml;mer.
   Dolayısıyla data dosyasını release aldıktan sonra programı g&amp;ouml;t&amp;uuml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z yere taşımaya gerek yoktur.
*/
use bracket_random::prelude::RandomNumberGenerator;
use colored::*;
use std::collections::HashSet;

const WORDS: &amp;amp;str = include_str!("words.data");
const WORD_LENGTH: usize = 5; // Kelime maksimum 5 harfli olabilir
const TRY_COUNT: usize = 6; // Oyuncuya 6 deneme hakkı veriyoruz

/// Kelime &amp;uuml;st&amp;uuml;nde bazı iyileştirmeler yapan fonksiyondur.
fn sanitize_word(word: &amp;amp;str) -&amp;gt; String {
    /*
    Bir ka&amp;ccedil; Higher Order Function kullanarak gelen kelime &amp;uuml;st&amp;uuml;nde işlmeler yapılmakta.
    &amp;ouml;nce gereksiz boşluklar trim ile atılıyor.
    Kelime b&amp;uuml;y&amp;uuml;k harfe &amp;ccedil;evriliyor ve chars fonksiyonu ile t&amp;uuml;m karakter listesi alınıyor.
    Rust'ta t&amp;uuml;m string'ler UTF-8 formatında. Dolayısıyla aralara harf olmayan karakterler(emoji gibi) gelebilir.
    Bunu &amp;ouml;nlemek i&amp;ccedil;in kelimede yer alan ascii karakterler bulunuyor. filter fonksiyonu bunun i&amp;ccedil;in kullanılmakta.
    Son olarak bulunan karakterler collect ile toplanıp fonksiyondan String değişken olarak d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;yor.
     */
    word.trim()
        .to_uppercase()
        .chars()
        .filter(|c| c.is_ascii_uppercase())
        .collect()
}

/// Kelimeleri String t&amp;uuml;rden vekt&amp;ouml;re alan fonksiyon
fn word_list() -&amp;gt; Vec&amp;lt;String&amp;gt; {
    /*
    Şimdi elimizde kelimeleri tutan dosya var. Bunu WORDS isimli constant'ta tutuyoruz.
    Bu dosyadaki herbir satırı okuyup, sanitize işleminden ge&amp;ccedil;irdikten sonra,
    uzunluğu 5 karakter olanları String t&amp;uuml;rden bir vector'de topluyoruz.
     */
    WORDS
        .split('\n')
        .map(sanitize_word)
        .filter(|line| line.len() == WORD_LENGTH)
        .collect()
}

/// Y&amp;ouml;netici sınıf. Kelimeler, se&amp;ccedil;ilen kelimeyi, tahmin edilen harfleri ve tahmin edilen kelimeleri y&amp;ouml;netir
pub struct Manager {
    available_words: Vec&amp;lt;String&amp;gt;,
    chosen_word: String,
    guessed_letters: HashSet&amp;lt;char&amp;gt;,
    guesses: Vec&amp;lt;String&amp;gt;,
}
impl Default for Manager {
    fn default() -&amp;gt; Self {
        Self::new()
    }
}

impl Manager {
    /*
       Yapıcı metot kelimelerin olduğu s&amp;ouml;zl&amp;uuml;kten rastgele bir kelimeyi de se&amp;ccedil;erek bir Manager &amp;ouml;rneği d&amp;ouml;ner.
    */
    pub fn new() -&amp;gt; Self {
        // Rastgele sayı &amp;uuml;retici
        let mut rnd_gnr = RandomNumberGenerator::new();
        let dictionary = word_list();
        // random_slice_entry fonksiyonu parametre olarak gelen dilimden rastgele bir tane &amp;ccedil;eker.
        // değerin bir klonunu word değişkenine alırız.
        let chosen_word = rnd_gnr.random_slice_entry(&amp;amp;dictionary).unwrap().clone();
        Self {
            available_words: dictionary,
            chosen_word,
            guessed_letters: HashSet::new(),
            guesses: Vec::new(),
        }
    }

    /*
       Oyun sahamız terminal ekranı. Manager'ın tuttuğu kelime ve
       oyuncunun tahminlerine g&amp;ouml;re 5X6 lık matrisi &amp;ccedil;izen bir fonksiona ihtiyacımız var.
       self &amp;uuml;zerinden guessed_letters vector'&amp;uuml;ne oyuncunun tahmin ettiği
       ama programın tuttuğu kelimede olmayan harfler eklenecek.
       Bu nedenle self, mutable referans olarak alındı.
    */
    /// Oyun sahasını tahmin edilen kelimeler ve sonu&amp;ccedil;ları ile &amp;ccedil;izer
    pub fn draw_board(&amp;amp;mut self) {
        // &amp;ouml;nce yapılan tahminleri gezen bir d&amp;ouml;ng&amp;uuml; a&amp;ccedil;ıyoruz.
        // for_each fonksiyonunda bir tuple kullandığımıza dikkat edelim.
        // Bu tuple'da satır numarası ve guesses vector'&amp;uuml;ndeki kelime yer alır.
        // Satır numarasını şu an i&amp;ccedil;in kullanmayacağız. O y&amp;uuml;zden _ ile a&amp;ccedil;ık&amp;ccedil;a kullanmayacağımızı belirttik.
        self.guesses.iter().enumerate().for_each(|(_, guess)| {
            // Şimdi bulunduğumuz satırdaki kelimenin harflerini dolaşacağız
            // Yine for_each d&amp;ouml;ng&amp;uuml;s&amp;uuml; kullanılıyor. Her iterasyonda kelimedeki karakteri ve indisini bir tuple ile ele alıyoruz.
            guess.chars().enumerate().for_each(|(i, c)| {
                // Şimdi karakterleri programın tuttuğu kelimedekiler ile karşılaştıracağız.

                // Eğer chosen_word'deki i. sıradaki karakter guess'teki c karakterine eşitse
                // harf doğrudur ve kelimede doğru yerdedir
                let row = if self.chosen_word.chars().nth(i).unwrap() == c {
                    format!("{}", c).bright_green()
                } else if self.chosen_word.chars().any(|wc| wc == c) {
                    // Harf doğrudur ama yeri yanlıştır. Bunu da any fonksiyonu &amp;uuml;st&amp;uuml;nden kontrol edebiliriz.
                    format!("{}", c).bright_yellow()
                } else {
                    // Harf programın tuttuğu kelimede yoksa bu durumda tahmin edilen harfler
                    // listesine eklenir ve kullanıcının karakteri kırmızıya boyanır.
                    self.guessed_letters.insert(c);
                    format!("{}", c).red()
                };
                print!("{} ", row);
            });
            println!(); // Bir alt satıra ge&amp;ccedil;
        })
    }

    /*
       Wordle oyununda kullanılan harflerde g&amp;ouml;sterilmekte.
       Bunun i&amp;ccedil;in de yardımcı bir fonksiyon kullanılabilir
    */
    /// Oyuncunun kullandığı ama programın tuttuğu kelimede olmayan harflerin listesini ekrana basar.
    pub fn show_invalid_letters(&amp;amp;self) {
        if !self.guessed_letters.is_empty() {
            self.guessed_letters.iter().for_each(|c| print!("{}", c));
            println!(
                "{}",
                "\nBu harfleri kullandın ancak aklımdaki kelimede yoklar!\n"
                    .to_string()
                    .cyan()
            );
            println!()
        }
    }

    /*
       Bu fonksiyon kullanıcıdan tahminini alıp kontrol etmekte.
       Ge&amp;ccedil;erli bir uzunlukta mı, oyunun kullandığı s&amp;ouml;zl&amp;uuml;k i&amp;ccedil;erisinde yer alıyor mu gibi.
    */
    /// Oyuncudan tahminini alır ve belli kurallara g&amp;ouml;re kontrol eder
    pub fn take_guess(&amp;amp;mut self) -&amp;gt; String {
        println!(
            "{}",
            format!(
                "Hey! Oyuncu.\nHadi bana {} karakterden oluşan bir kelime yaz ve ENTER'a bas",
                WORD_LENGTH
            )
            .purple()
        );
        // &amp;Ouml;nce tahminde olupta programın tuttuğu kelimede olmayan harfleri g&amp;ouml;sterelim
        self.show_invalid_letters();
        // Kullanıcının tahmini ve kelimenin ge&amp;ccedil;erli olup olmadığını tutan iki mutable değişkenimiz var.
        let mut user_guess = String::new();
        let mut is_guess_valid = false;
        // D&amp;ouml;ng&amp;uuml;m&amp;uuml;z kullanıcının girdiği kelime t&amp;uuml;m kuralları sağlayana kadar devam edecek
        while !is_guess_valid {
            user_guess = String::new();
            // Oyuncunun girdisi terminal ekranından olacak.
            // İ&amp;ccedil;eriği read_line fonksiyonu ile user_guess değişkenine yazabiliriz.
            // &amp;Ccedil;ok b&amp;uuml;y&amp;uuml;k bir problem olmayacağını d&amp;uuml;ş&amp;uuml;nerekten unwrap ile girilen bilgiyi alıyoruz.
            std::io::stdin().read_line(&amp;amp;mut user_guess).unwrap();
            // Kelimedeki gereksiz boşlukları &amp;ccedil;ıkartıp harfleri b&amp;uuml;y&amp;uuml;k harfe &amp;ccedil;eviren bir fonksiyonumuz var.
            // Kelimeyi o işlemden ge&amp;ccedil;iriyoruz.
            user_guess = sanitize_word(&amp;amp;user_guess);
            // Kontrollerimiz basit. Kelime belirlediğimiz uzunlukta olmalı ve
            // programın kullandığı s&amp;ouml;zl&amp;uuml;kte yer almalı.
            // Eğer b&amp;ouml;yle değilse is_guess_valid değişkeni false olarak kalacak ve d&amp;ouml;ng&amp;uuml; devam edecek
            if user_guess.len() != WORD_LENGTH {
                println!(
                    "{}",
                    format!("{} uzunluğunda bir kelime girmelisin.", WORD_LENGTH).red()
                )
            } else if !self.available_words.iter().any(|word| word == &amp;amp;user_guess) {
                println!("{}", "Girdiğin kelime benim d&amp;uuml;kkanda bile yok :S".red())
            } else {
                self.guesses.push(user_guess.clone());
                is_guess_valid = true;
            }
        }
        // Kod buraya geldiyse ge&amp;ccedil;erli bir tahmin elimizdedir. Bunu fonksiyondan geri d&amp;ouml;n&amp;uuml;yoruz.
        user_guess
    }

    /*
       İhtiyacımız olan bir diğer fonksiyonda oyuncunun kazanıp kazanmadığının bulunması.
       Sonu&amp;ccedil;ta bu da bir operasyon gerektirdiğinden main i&amp;ccedil;erisinde tutmak yerine ayrı bir
       fonksiyona almak daha mantıklı.
    */
    /// Oyuncunun oyunu kazanıp kazanmadığını s&amp;ouml;yler
    pub fn is_it_over(&amp;amp;self, user_guess: &amp;amp;str) -&amp;gt; bool {
        // Oyuncunun kelimesi programın tuttuğu kelime ise tamam.
        let try_count = self.guesses.len();
        if user_guess == self.chosen_word {
            println!(
                "{}",
                format!("Kelimeyi {} denemede buldun. Tebrikler.", try_count).blue()
            );
            true
        } else if try_count &amp;gt;= TRY_COUNT {
            // Kelime doğru değilse deneme sayısını kontrol ediyoruz ve haklarımız t&amp;uuml;kendiyse
            // bunu &amp;uuml;z&amp;uuml;lerek de olsa bildiriyoruz :P
            println!(
                "{}",
                format!(
                    "Malesef t&amp;uuml;m hakların doldu. Doğru kelime -&amp;gt; {}",
                    self.chosen_word
                )
                .bright_green()
            );
            true
        } else {
            false
        }
    }
}

#[cfg(test)]
mod test {
    use crate::{sanitize_word, word_list, Manager};

    #[test]
    fn should_manager_crated_successfully() {
        let poe = Manager::new();
        assert_eq!(poe.chosen_word.chars().count(), 5);
        assert!(poe.available_words.len() &amp;gt; 0);
        assert!(poe.guesses.len() == 0);
    }

    #[test]
    fn should_sanitize_word_fn_works() {
        let word = "gol Dy   ";
        let result = sanitize_word(word);
        assert_eq!(result, "GOLDY");
    }

    #[test]
    fn should_world_list_fn_works() {
        let words = word_list();
        assert!(words.len() &amp;gt; 1);
        let count = words.iter().filter(|w| w.chars().count() != 5).count();
        assert_eq!(count, 0);
    }
}&lt;/pre&gt;
&lt;p&gt;Lib mod&amp;uuml;l&amp;uuml;ndeki enstr&amp;uuml;manları m&amp;uuml;mk&amp;uuml;n mertebe yorum satırlarında anlatmaya &amp;ccedil;alıştım. Artık main fonksiyonumuzu geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;use colored::Colorize;
use wordle::Manager;

fn main() {
    let wellcome = "World oyununun klonuna hoş geldiniz.\nHaydi başlayalım.".yellow();
    println!("{}", wellcome);

    let mut poe = Manager::new();
    loop {
        poe.draw_board();
        let user_guess = poe.take_guess();
        if poe.is_it_over(&amp;amp;user_guess) {
            break;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Nispeten main fonksiyonu &amp;ccedil;ok daha basit. Terminalden oynana bir oyunda olsa akışın belli koşullar altında s&amp;uuml;rekli yinelenen bir d&amp;ouml;ng&amp;uuml;ye ihtiyacı olduğu aşikar. D&amp;ouml;ng&amp;uuml; adımlarında oyun sahası ekrana &amp;ccedil;izilir, oyuncunun tahmini alınır ve oyunun sonlanıp sonlanmadığı kontrol&amp;uuml; yapılır. Olduk&amp;ccedil;a basit bir akış olduğunu s&amp;ouml;yleyebiliriz. Bu kadar zahmetten sonra artık oyunumuzu/oyununuzu deneyelim &amp;ouml;yle değil mi?&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bende bir alışkanlık oldu o da clippy ile kodun kusurlarına bakmak. Bu nedenle uygulama kodlarını yazdık&amp;ccedil;a clippy ile nerelerde ideomatikliğin dışına &amp;ccedil;ıktım kontrol etmekteyim. Ayrıca fonksiyonları inşa ettik&amp;ccedil;e testlerini koşturmakta da yarar var. T&amp;uuml;m bu aşamalardan sonra belki de run ile programı &amp;ccedil;alıştırıp oyunun keyfini &amp;ccedil;ıkarmak lazım.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;cargo clippy
cargo test
cargo run&lt;/pre&gt;
&lt;p&gt;Kendi ortamımda elde ettiğim sonu&amp;ccedil;ları aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ile paylaşmak isterim. Her ne kadar buradaki kelimeyi bilemesemde sonraki denemelerde tutturduklarım olduğunu da ifade edebilirim. İ&amp;ccedil; eğitimlerde buzları kırmak adına&amp;nbsp;gayet g&amp;uuml;zel bir atıştırmalık oldu :)&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Nisan/wordle_2.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;&amp;Ouml;ğrendiğim Yeni Şeyler&lt;/h2&gt;
&lt;p&gt;Herbert'in adımlarını takip ederken hem var olan Rust bilgimi tekrar ettim hem de yeni şeyler &amp;ouml;ğrendim. İşte onlardan bazıları.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;rand yerine kullanılabilecek alternatif bir rastgele sayı &amp;uuml;retme k&amp;uuml;t&amp;uuml;phanesi&amp;nbsp;bracket-random ile &amp;ccedil;alışmayı &amp;ouml;ğrendim.&lt;/li&gt;
&lt;li&gt;Terminal ekranını &lt;a title="Colored Crate" href="https://crates.io/crates/colored" target="_blank"&gt;colored&lt;/a&gt; k&amp;uuml;fesini&lt;em&gt;(Crate)&lt;/em&gt; kullanarak renklendirebiliriz.&lt;/li&gt;
&lt;li&gt;include_str makro fonksiyonu ile bir dosya i&amp;ccedil;eriğini src klas&amp;ouml;r&amp;uuml;nden okuyup derlenen kodun i&amp;ccedil;erisine g&amp;ouml;mmek m&amp;uuml;mk&amp;uuml;n. Dosyayı build &amp;ccedil;ıktılarındaki binary'ler ile birlikte taşımak m&amp;uuml;mk&amp;uuml;n hale geliyor.&lt;/li&gt;
&lt;li&gt;RandomNumberGenerator nesnesinin random_slice_entry fonksiyonu sayesinde parametre olarak verilen bir vector i&amp;ccedil;inden rastgele bir eleman kolayca &amp;ccedil;ekilebilir.&lt;/li&gt;
&lt;li&gt;for_each fonksiyonu ile metnin karakterlerini ya da vector elemanlarını dolaşırken tuple t&amp;uuml;r&amp;uuml;nden yararlanarak indis ve değer &amp;ccedil;iftlerine ulaşabiliriz.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir rust pratiğimizin daha sonuna. Oyunu daha da geliştirmek elinizde. &amp;Ouml;rneğin daha &amp;ouml;nceden de belirttiğim &amp;uuml;zere mesleki terimlerden oluşan s&amp;ouml;zl&amp;uuml;kleri kullanabiliriz. &amp;Ouml;ğrencilere ders &amp;ccedil;alışmalarında onlara yardımcı olacak veri depolarını da kullanabiliriz. Beş kelime sınırını kaldırıp farklı sayıda harf se&amp;ccedil;eneklerini belki bir giriş men&amp;uuml;s&amp;uuml; ile sunacağımız ayarlar kısmında oyuncuya se&amp;ccedil;tirebiliriz vs Tamamen sizin hayal g&amp;uuml;c&amp;uuml;n&amp;uuml;ze kalmış. Herbert'e sonsuz teşekk&amp;uuml;rler :) Yine harika bir iş &amp;ccedil;ıkarmış. Kitabını da şiddetle tavsiye ederim.&amp;nbsp;Yazıdaki &amp;ouml;rneğe ait&amp;nbsp;kodlara her zaman olduğu gibi &lt;a title="Wordle" href="https://github.com/buraksenyurt/rust-farm/tree/main/Practices/wordle"&gt;github hesabımdan erişebilirsiniz&lt;/a&gt;. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2022-04-10 09:00:00</pubDate>
  <slug>rust-pratikleri-wordle-oyunu</slug>
  <tags>
    <tag>rust</tag>
    <tag>rust-pratikleri</tag>
    <tag>rust-programming-language</tag>
    <tag>wordle</tag>
    <tag>game-programming</tag>
    <tag>terminal-games</tag>
    <tag>cargo</tag>
  </tags>
  <categories>
    <category>Rust</category>
  </categories>
</post>