<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net 2.0 ile Configuration Management (Konfigurasyon Yönetimi)</title>
  <description>Asp.Net 2.0 özellikle Web.config dosyasını daha kolay yönetebilmek amacıyla beraberinde bir yönetim API' si ile birlikte gelmektedir. Configuration Management API olarak adlandırabileceğimiz bu yapı sayesinde, web.config gibi konfigurasyon dosyalarını ve içeriğini programatik olarak daha etkin bir şekilde yönetebiliriz. Bildiğiniz gibi web.config dosyası xml tabanlı bir içerik sunmakla birlikte entegre edildiği web uygulaması için gerekli temel bir takım ayaları içerir. (Elbette bir web uyguması içerisinde yer alan alt klasörler içinde ayrı web.config dosyalarının ele alınabileceğini hatırlatmakta fayda var.)</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Asp.Net 2.0 &amp;ouml;zellikle Web.config dosyasını daha kolay y&amp;ouml;netebilmek amacıyla beraberinde bir y&amp;ouml;netim API' si ile birlikte gelmektedir. Configuration Management API olarak adlandırabileceğimiz bu yapı sayesinde, web.config gibi konfigurasyon dosyalarını ve i&amp;ccedil;eriğini programatik olarak daha etkin bir şekilde y&amp;ouml;netebiliriz. Bildiğiniz gibi web.config dosyası xml tabanlı bir i&amp;ccedil;erik sunmakla birlikte entegre edildiği web uygulaması i&amp;ccedil;in gerekli temel bir takım ayaları i&amp;ccedil;erir. &lt;em&gt; (Elbette bir web uyguması i&amp;ccedil;erisinde yer alan alt klas&amp;ouml;rler i&amp;ccedil;inde ayrı web.config dosyalarının ele alınabileceğini hatırlatmakta fayda var.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;AppSettings, ConnectionStrings, Authentication, Authorization, SessionState, Membership, Tracing, Pages gibi pek &amp;ccedil;ok konu ile ilişkili kısımları bu ayarlar arasında d&amp;uuml;ş&amp;uuml;nebiliriz. Burada saymış olduğumuz t&amp;uuml;m kısımlar Configuration Management API i&amp;ccedil;erisinde birer tipe karşılık gelmektedir. &amp;Ouml;rneğin Authentication ayarları i&amp;ccedil;in &lt;strong&gt;AuthenticationSection&lt;/strong&gt;, SessionState ayaları i&amp;ccedil;in &lt;strong&gt;SessionStateSection&lt;/strong&gt; gibi pek &amp;ccedil;ok tip geliştirilmiştir. Bu, ilgili kısımların programatik olarak nesnel d&amp;uuml;zeyde kullanılabilmesi anlamına gelmektedir. Yani, Configuration Management API' si sayesinde, web.config i&amp;ccedil;erisinde yer alan herhangibir kısmı (Section) nesne &amp;ouml;rneği olarak kullanabilir, i&amp;ccedil;eriğini d&amp;uuml;zenleyebilir ve tekrardan kayıt edebiliriz. İşte bu makalemizde, basit olarak web.config i&amp;ccedil;eriğini programatik olarak nasıl ele alabileceğimizi incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;Configuration Management API' si sadece web uygulamalarını esas almaz. Diğer uygulamalar (&amp;ouml;rneğin Desktop) i&amp;ccedil;in kullanılabilecek &amp;ccedil;eşitli uygulama d&amp;uuml;zeyindeki konfigurasyon dosyalarınıda ele alabiliriz. Temek olarak bir web.config dosyasını programatik seviyede &lt;strong&gt;Configuration&lt;/strong&gt; sınıfına ait bir nesne &amp;ouml;rneği ile ele alabiliriz. Configuration Management API' si i&amp;ccedil;erisinde, Configuration tipini elde edebilmemizi sağlayan iki temel sınıf vardır. Bunlar &lt;strong&gt;ConfigurationManager&lt;/strong&gt; ve &lt;strong&gt;WebConfigurationManager&lt;/strong&gt; sınıflarıdır. ConfigurationManager sadece web uygulamalarını değil diğer platformlarıda g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alır. WebConfigurationManager sınıfı ise &amp;ouml;zellikle web tabanlı sistemler i&amp;ccedil;in tasarlanmış &amp;uuml;yeler i&amp;ccedil;erir.&lt;/p&gt;
&lt;p&gt;ConfigurationManager sınıfı &lt;strong&gt;System.Configuration&lt;/strong&gt; isim alanında, WebConfigurationManager sınıfı ise &lt;strong&gt;System.Web.Configuration&lt;/strong&gt; isim alanında yer almaktadır. WebConfigurationManager tipinin belkide en &amp;ouml;nemli &amp;uuml;yesi static &lt;strong&gt;OpenWebConfiguration&lt;/strong&gt; metodudur. Bu metod sayesinde, web.config dosyalarını herhangibir seviyede a&amp;ccedil;abiliriz. Diğer taraftan WebConfigurationManager sınıfı &lt;strong&gt;OpenMachineConfiguration&lt;/strong&gt; isimli static bir &amp;uuml;ye metod daha i&amp;ccedil;erir. Bu metod sayesinde de tahmin edebileceğiniz gibi, machine.config dosyasına erişilebilmektedir. Bu bizim makine seviyesindeki bir takım ayarları programatik olarak ele almamızı sağlar. Aşağıdaki tabloda bu metodlara ilişkin &amp;ouml;rnek bir takım senaryolar verilmiştir.&lt;/p&gt;
&lt;table id="table64" style="border-collapse: collapse; width: 100%;" border="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&amp;Ouml;rnek Metod&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;İşlevi&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;WebConfigurationManager.OpenWebConfiguration("~/")&lt;/td&gt;
&lt;td&gt;G&amp;uuml;ncel uyulamadaki web.config dosyasını alır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;WebConfigurationManager.OpenWebConfiguration("/ConfigMngAPI")&lt;/td&gt;
&lt;td&gt;ConfigMngAPI isimli Web uygulamasına ait olan web.config dosyasını a&amp;ccedil;ar.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;WebConfigurationManager.OpenWebConfiguration("/ConfigMngAPI/Admin")&lt;/td&gt;
&lt;td&gt;ConfigMngAPI isimli web uygulamasındaki Admin klas&amp;ouml;r&amp;uuml; altındaki web.config dosyasını a&amp;ccedil;ar.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;WebConfigurationManager.OpenWebConfiguration("~/", "siteAdi")&lt;/td&gt;
&lt;td&gt;siteAdi ile belirtilen web uygulamasındaki web.config dosyasını a&amp;ccedil;alar. Bu metodun diğer versiyonları kullanılarak ilgili siteye username ve password bilgiside iletilebilinir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;WebConfigurationManager.OpenWebConfiguration("~/", null, "/Admin")&lt;/td&gt;
&lt;td&gt;Var olan web uygulamasındaki Admin klas&amp;ouml;r&amp;uuml;nde i&amp;ccedil;in web.config' de yazılmış location boğumunu a&amp;ccedil;ar.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;WebConfigurationManager.OpenMachineConfiguration()&lt;/td&gt;
&lt;td&gt;Framework altındaki machine.config dosyasını a&amp;ccedil;ar.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Tabloda belirtilen &amp;ouml;rnek kullanımlar &amp;ccedil;oğaltılabilir. Sonu&amp;ccedil; itibariyle OpenWebConfiguration metodunun altı farklı aşırı y&amp;uuml;klenmiş versiyonu vardır. Buradaki &amp;ouml;nemli noktalardan biriside, OpenWebConfiguration ve OpenMachineConfiguration gibi static metodların geriye &lt;strong&gt;Configuration&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneği g&amp;ouml;nderiyor oluşlarıdır. Configuration sınıfına ait bu nesne &amp;ouml;rnekleri sayesinde a&amp;ccedil;ılan config uzantılı dosya &amp;uuml;zerinde istediğimiz y&amp;ouml;netimsel işlemleri (d&amp;uuml;zenleme, kaydetme, elde etme gibi) ger&amp;ccedil;ekleştirebiliriz. Şimdi ilk olarak konfigurasyon dosyalarında sık&amp;ccedil;a kullandığımız &lt;strong&gt;appSettings&lt;/strong&gt; ve &lt;strong&gt;connectionStrings&lt;/strong&gt; kısımlarını nasıl y&amp;ouml;netebileceğimizi g&amp;ouml;receğiz. Bunun i&amp;ccedil;in web.config dosyasındaki appSettings ve connectionStrings kısımlarına aşağıda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &amp;ouml;rnek bir ka&amp;ccedil; veri gireceğiz.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;appSettings&amp;gt;
    &amp;lt;add key="mailGonderici" value="on"/&amp;gt;
    &amp;lt;add key="varsayilanMail" value="admin@admin.com"/&amp;gt;
    &amp;lt;add key="varsayilanHataSayfasi" value="hataSayfasi.aspx"/&amp;gt;
&amp;lt;/appSettings&amp;gt;
&amp;lt;connectionStrings&amp;gt;
    &amp;lt;add name="AdvConStr" connectionString="data source=localhost;database=AdventureWorks;integrated security=SSPI" providerName="System.Data.SqlClient"/&amp;gt;
    &amp;lt;add name="NorthConStr" connectionString="data source=localhost;database=Northwind;integrated security=SSPI" providerName="System.Data.OleDb"/&amp;gt;
&amp;lt;/connectionStrings&amp;gt;&lt;/pre&gt;
&lt;p&gt;Uygulama kodlarımızı da aşağıdaki kod par&amp;ccedil;asında olduğu gibi d&amp;uuml;zenleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Configuration;
using System.Web.Configuration;

public partial class _Default : System.Web.UI.Page 
{
    // İlk olarak bizim i&amp;ccedil;in gerekli değişkenleri tanımlıyoruz.
    private Configuration _config;
    private AppSettingsSection _appSec;
    private ConnectionStringsSection _conSec;

    // Uygulamaya ait web.config dosyası i&amp;ccedil;eriği _config isimli Configuration tipine ait nesne &amp;ouml;rneğine alınır.
    private void GetConfig()
    {
        if(_config==null)
        _config = WebConfigurationManager.OpenWebConfiguration("/ConfigMngAPI");
    }

    // web.config dosyası i&amp;ccedil;erisinden appSettings kısmı &amp;ccedil;ekilerek AppSettingsSection tipinden _appSec isimli bir nesne &amp;ouml;rneğine atanır.
    private void GetAppSettingsSection()
    {
        if(_appSec==null)
        _appSec = _config.AppSettings;
    }

    // web.config dosyasından connectionStrings kısmı &amp;ccedil;ekilerek ConnectionStringsSection tipinden _conSec isimli nesne &amp;ouml;rneğine atılır.
    private void GetConnectionSection()
    {
        if (_conSec == null)
            _conSec = _config.ConnectionStrings;
    }
    // appSettings kısmındaki key bilgileri Settings &amp;ouml;zelliği &amp;uuml;zerinden gidilen AllKeys &amp;ouml;zelliği ile alınır ve DropDownList kontrol&amp;uuml;ne set edilir.
    private void LoadAppSettings()
    {
        GetConfig();
        GetAppSettingsSection();
        ddlAppSettingsKeys.DataSource = _appSec.Settings.AllKeys;
        ddlAppSettingsKeys.DataBind();
    }

    // connectionString sekmesindeki bilgileri taşıyan _conSec nesnesi kullanılarak Name alanlarını i&amp;ccedil;eren veri seti DropDownList kontrol&amp;uuml;ne bağlanır.
    private void LoadConSettings()
    {
        GetConfig();
        GetConnectionSection();
        ddlConnectionKeys.DataSource = _conSec.ConnectionStrings;
        ddlConnectionKeys.DataTextField = "Name";
        ddlConnectionKeys.DataValueField = "Name";
        ddlConnectionKeys.DataBind();
    }
    // AppSettings kısmındaki key değerlerini g&amp;ouml;steren DropDownList kontrol&amp;uuml;nde se&amp;ccedil;ilen anahtar bilgisine g&amp;ouml;re Value değeri elde     edilir.
    private void GetAppSetInfo()
    {
        GetConfig();
        GetAppSettingsSection();
        txtAppSetValue.Text = _appSec.Settings[ddlAppSettingsKeys.SelectedValue].Value;
    }

    // DropDownList kontrol&amp;uuml;nden se&amp;ccedil;ilen name değerine g&amp;ouml;re, web.config dosyasındaki connectionStrings sekmesinden ilgili connectionString, name ve providerName bilgileri &amp;ccedil;ekilir.
    private void GetConStrInfo()
    {
        GetConfig();
        GetConnectionSection();
        txtConStrValue.Text = _conSec.ConnectionStrings[ddlConnectionKeys.SelectedValue].ConnectionString;
        lblConStrName.Text = _conSec.ConnectionStrings[ddlConnectionKeys.SelectedValue].Name;
        lblProviderName.Text = _conSec.ConnectionStrings[ddlConnectionKeys.SelectedValue].ProviderName;
    }

    protected void Page_Load(object sender, EventArgs e)
    {
        if (!Page.IsPostBack)
        {
            LoadAppSettings();
            LoadConSettings();
            GetAppSetInfo();
            GetConStrInfo();
        }
    }
    protected void ddlAppSettingsKeys_SelectedIndexChanged(object sender, EventArgs e)
    {
        GetAppSetInfo();
    }
    protected void ddlConnectionKeys_SelectedIndexChanged(object sender, EventArgs e)
    {
        GetConStrInfo();
    } 
}&lt;/pre&gt;
&lt;p&gt;Dikkat ederseniz web.config dosyası i&amp;ccedil;erisindeki kısımları ele almak i&amp;ccedil;in elde edilen Configuration' tipinden faydalanılmıştır. &amp;Ouml;zellikle appSettings ve connectionStrings sekmeleri &amp;ccedil;ok sık kullanıldığından bunlara doğrudan erişimi sağlayan &amp;ouml;zellikler mevcuttur. Bu &amp;ouml;zelliklerin geri d&amp;ouml;n&amp;uuml;ş tiplerine dikkat ederseniz, &lt;strong&gt;AppSettingsSection&lt;/strong&gt; ve &lt;strong&gt;ConfigurationStringsSection&lt;/strong&gt; tipinden olduklarını g&amp;ouml;rebiliriz. Dolayısıyla bu tipler &amp;uuml;zerinden de bizim i&amp;ccedil;in gerekli temel bilgilere ge&amp;ccedil;iş yapabiliriz. &amp;Ouml;rneğin se&amp;ccedil;ilen bağlantıya ait connectionString bilgisi, sağlayıcı adı (providerName) vb... gibi. Uygulamamızı bu haliyle ilk &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne benzer bir sonu&amp;ccedil; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk165_1.gif" alt="" width="514" height="414" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Elbette Configuration API' si i&amp;ccedil;erisinde var olan web.config sekmelerine karşılık gelen tipler tanımlanmıştır. Başka konfigurasyon bazlı dosyalara ekleyeceğimiz kendi sekmelerimizde elde edebileceğimiz teknikler mevcuttur. Bunun i&amp;ccedil;in &amp;ouml;rneğin &lt;strong&gt;GetSection&lt;/strong&gt; metodundan yararlanabiliriz. Şu anki &amp;ouml;rneğimiz basit olarak web.config dosyası i&amp;ccedil;erisinde yer alan bilinen kısımlardan, ConnectionStrings ve AppSettings par&amp;ccedil;alarına ait bilgileri okuyabilmemizi sağlamaktadır. Bir sonraki adımımızda ise bu bilgiler &amp;uuml;zerinde değişiklik yaparak tekrardan web.config dosyasına yazma işlemini ele alacağız. Bunun i&amp;ccedil;in uygulamamıza aşağıdaki metodları eklememiz yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt; // İlk olarak AppSettingsSection tipine ait nesne &amp;ouml;rneği &amp;uuml;zerinden DropDownList' ten se&amp;ccedil;ilen key bilgisinin value &amp;ouml;zelliğinin değeri TextBox' tan alınır. Burada kayıt işlemini web.config &amp;uuml;zerinde ger&amp;ccedil;ekleştirilmesi i&amp;ccedil;in mutlaka Configuration tipinen ait Save metodu &amp;ccedil;ağırılmalıdır.
protected void btnChangeAppSet_Click(object sender, EventArgs e)
{
    GetConfig();
    GetAppSettingsSection();
    _appSec.Settings[ddlAppSettingsKeys.SelectedValue].Value = txtAppSetNewValue.Text;
    _config.Save();
    GetAppSetInfo();
}

// ConnectionString bilgisindede değişiklik yapmak i&amp;ccedil;in ConnectionStringsSection tipinden yararlanılır. Bu tipe ait nesne &amp;ouml;rneği yardımıyla DropDownListe' ten se&amp;ccedil;ilen connectionString bilgisi yakalanır ve ConnectionString &amp;ouml;zelliğine yeni değeri atanır. Son olarak değişikliklerin web.config dosyasına yansıtılabilmesi i&amp;ccedil;in Configuration tipine ait Save metodu &amp;ccedil;alıştırılmalıdır.
protected void btnChangeConStr_Click(object sender, EventArgs e)
{
    GetConfig();
    GetConnectionSection();
    _conSec.ConnectionStrings[ddlConnectionKeys.SelectedValue].ConnectionString = txtNewConStrValue.Text;
    _config.Save();
    GetConStrInfo();
}&lt;/pre&gt;
&lt;p&gt;Artık uygulamamızda yer alan web.config dosyası i&amp;ccedil;erisindeki connectionStrings ve appSettings sekmelerindeki verilerde değişiklik yapabiliriz. Buradaki hassas nokta erişilen bilgini değişikliğe uğramasını takiben Configuration tipinin Save metodunun &amp;ccedil;ağırılmış olmasıdır. B&amp;ouml;ylece, yapılan değişiklikler kesin olarak Configuration tipine ait nesne &amp;ouml;rneğinin o anda işaret ettiği konfigurasyon dosyasına &lt;em&gt;(ki burada web.config dosyasıdır)&lt;/em&gt; yazılmaktadır. &lt;em&gt;(Not : Aşağıdaki g&amp;ouml;r&amp;uuml;nt&amp;uuml;y&amp;uuml; seyredebilmek i&amp;ccedil;in tarayıcınızda Flash Player' ın son s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml;n olması tavsiye edilir. Eğer sisteminizde XP Service Pack 2 y&amp;uuml;kl&amp;uuml;yse ilgili uyarıyı dikkate alıp i&amp;ccedil;eriğe izin vermelisiniz. (Allow Blocked Content). Videoyu y&amp;ouml;netmek i&amp;ccedil;in sağ tıklayıp &amp;ccedil;ıkan men&amp;uuml;y&amp;uuml; kullanabilirsiniz. Video Boyu 130 kb.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;object id="obj1" width="497" height="545" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/ConfigMng_4.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="497" height="545" src="http://www.buraksenyurt.com/makale/images/ConfigMng_4.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj1" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;Yukarıdaki &amp;ouml;rneklerimizde &amp;ccedil;ok bilinen appSettings ve connectionStrings kısımlarını ele aldık. &amp;Ouml;rneğin sessionState kısmınıda ele almak istediğimizi d&amp;uuml;ş&amp;uuml;nelim. B&amp;ouml;yle bir durumda Configuration tipi sessionState i&amp;ccedil;in bir &amp;ouml;zellik sunmaz. Bunun yerine konfigurasyon dosyasındaki herhangibir kısmın i&amp;ccedil;eriğini ConfigurationSection tipinden elde etmemizi ve uygun tipe d&amp;ouml;n&amp;uuml;şt&amp;uuml;rmemizi sağlayan GetSection metodundan yararlanabiliriz. Aşağıdaki kod par&amp;ccedil;ası bu işlemi nasıl yapacağımızı g&amp;ouml;stermektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SessionStateSection _sesSec = (SessionStateSection)_config.GetSection("system.web/sessionState");
lblSessionSecInfo.Text = "&amp;lt;b&amp;gt; Session Mode : &amp;lt;/b&amp;gt; " + _sesSec.Mode.ToString() + "&amp;lt;br&amp;gt;" + "&amp;lt;b&amp;gt;Cookieless : &amp;lt;/b&amp;gt;" + _sesSec.Cookieless.ToString();&lt;/pre&gt;
&lt;p&gt;Burada sessionState kısmını y&amp;ouml;netmemizi sağlayan &lt;strong&gt;SessionStateSection&lt;/strong&gt; tipi mevcuttur. Yanlız GetSection metodu geriye &lt;strong&gt;ConfigurationSection&lt;/strong&gt; tipinden bir &amp;uuml;ye d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml; i&amp;ccedil;in bunun ilgili tiplere d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmesi (casting) gerekir. Bu y&amp;uuml;zden SessionStateSection tipine a&amp;ccedil;ık&amp;ccedil;a bir d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi uygulanmıştır. Sonrasında ise elde edilen _sesSec isimli tip yardımıyla bir sessionState sekmesi i&amp;ccedil;in ge&amp;ccedil;erli standart niteliklere kolayca erişebiliriz. &amp;Ouml;rneğin Cookiless &amp;ouml;zelliğine yada Mode &amp;ouml;zelliğine. Burada bir diğer &amp;ouml;nemli noktada sessionState sekmesine nasıl eriştiğimizdir. Bu kısım web.config i&amp;ccedil;erisinde system.web boğumu i&amp;ccedil;erisinde yer aldığından system.web/sessionState ifadesi ile yakalanmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk165_7.gif" alt="" width="633" height="103" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dilersek web.config i&amp;ccedil;erisindeki kısımları şifreli (encrypt) olarakta kayıt edebilir hatta şifrelenmiş veriyi &amp;ccedil;alışma zamanında d&amp;uuml;zg&amp;uuml;n bir bi&amp;ccedil;imde okuyabiliriz. Bu işlemler i&amp;ccedil;in var olan section tiplerinin (AppSettingsSection, ConnectionStringsSection gibi) &lt;strong&gt;SectionInformation&lt;/strong&gt; isimli &amp;ouml;zelliklerinin &lt;strong&gt;ProtectSection&lt;/strong&gt; isimli bir &amp;uuml;ye metodu kullanılır. Şifrelenmiş verileri &amp;ccedil;&amp;ouml;zebilmek i&amp;ccedil;in ise SectionInformation isimli &amp;ouml;zelliğinin &lt;strong&gt;UnprotectSection&lt;/strong&gt; isimli &amp;uuml;ye metodundan yararlanabiliriz. Konuyu daha iyi anlayabilmek i&amp;ccedil;in aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını ele alalım. Bu kod par&amp;ccedil;asında web.config dosyası i&amp;ccedil;erisindeki AppSettingsSection ve ConnectionStringsSection kısımlarının encrypt ve decrypt işlemleri i&amp;ccedil;in gerekli d&amp;uuml;zenlemeler yer almaktadır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;// ConnectionStrings sekmesini varsayılan RSA sistemine g&amp;ouml;re şifreler. Bunun i&amp;ccedil;in ilgili kısmın SectionInformation &amp;ouml;zelliğinin ProtectSection metodu kullanılır.
protected void btnProtectConn_Click(object sender, EventArgs e)
{
    GetConfig();
    GetConnectionSection();
    if (!_conSec.SectionInformation.IsProtected)
    {
        _conSec.SectionInformation.ProtectSection("RsaProtectedConfigurationProvider");
        _config.Save();
    }
    else
        Response.Write("ConnectionStrings zaten şifrelenmiştir...");
}

// Bu kez şifrelenmiş olan ConnectionStrings sekmesi &amp;ccedil;&amp;ouml;z&amp;uuml;lerek web.config tekrar kaydedilir.
protected void btnUnprotectConn_Click(object sender, EventArgs e)
{
    GetConfig();
    GetConnectionSection();
    if (_conSec.SectionInformation.IsProtected)
    {
        _conSec.SectionInformation.UnprotectSection();
        _config.Save();
    }
    else
    Response.Write("ConnectionStrings zaten şifresiz tutulmaktadır...");
}

// AppSettings sekmesini varsayılan RSA sistemine g&amp;ouml;re şifreler. Bunun i&amp;ccedil;in ilgili kısmın SectionInformation &amp;ouml;zelliğinin ProtectSection metodu kullanılır.
protected void btnProtectAppSet_Click(object sender, EventArgs e)
{
    GetConfig();
    GetAppSettingsSection();
    if (!_appSec.SectionInformation.IsProtected)
    {
        _appSec.SectionInformation.ProtectSection("RsaProtectedConfigurationProvider");
        _config.Save();
    }
    else
        Response.Write("AppSettings zaten şifrelidir...");
}
protected void btnUnprotectAppSet_Click(object sender, EventArgs e)
{
    GetConfig();
    GetAppSettingsSection();
    if (_appSec.SectionInformation.IsProtected)
    {
        _appSec.SectionInformation.UnprotectSection();
        _config.Save();
    }
    else
        Response.Write("AppSettings zaten şifreli değil...");
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı bu haliyle &amp;ccedil;alıştırıp &amp;ouml;rneğin connectionStrings ve appSettings kısımlarını şifrelediğimizde web.config dosyasının aşağıdakine benzer bir yapıya b&amp;uuml;r&amp;uuml;nd&amp;uuml;ğ&amp;uuml;n&amp;uuml; g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Burada Protect metodunda parametre olarak &lt;strong&gt;RsaProtectedConfigurationProvider&lt;/strong&gt; kullanılmıştır. Bu provider se&amp;ccedil;imi ile RSA algoritmasını baz alarak şifreleme ve &amp;ccedil;&amp;ouml;zme işlemlerinin ger&amp;ccedil;ekleştirileceği belirtilmektedir. Elbetteki burada kendi &amp;ouml;zel koruma sağlayıcılarımızı (Custom Protection Provider) da kullanabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk165_4.gif" alt="" width="635" height="626" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi connectionStrings ve appSettings kısımları i&amp;ccedil;in şifreleme işlemleri yapılmış ve key, value, name, providerName, connectionString gibi niteliklerin (attributes) i&amp;ccedil;eriği okunamaz hale getirilmiştir. Lakin, &amp;ccedil;alışma zamanında &lt;strong&gt;ConnectionStringsSection&lt;/strong&gt; tipine ait nesne &amp;ouml;rneği &amp;uuml;zerinden ilgili bağlantı bilgilerini kolayca okuyabiliriz. Aynı durum appSettings kısmı i&amp;ccedil;inde ge&amp;ccedil;erlidir. Dolayısıyla buradaki şifreleme işlemleri sadece ve sadece web.config dosyasının dışarıdan &amp;ccedil;ıplak g&amp;ouml;zle okunması sırasında &amp;ouml;nem kazanmaktadır. Web.config dosyasını istemcilerin elde etmesi zaten pek m&amp;uuml;mk&amp;uuml;n değildir. Yine de web.config dosyasındaki bazı hassas bilgileri korumak adına yukarıdaki tekniklerden yararlanılabilinir.&lt;/p&gt;
&lt;p&gt;Bazen konfigurasyon dosylarında yer alan kısımların, Configuration API i&amp;ccedil;erisinde karşılığı olan tipler olmayabilir. Bu &amp;ccedil;oğunlukla Asp.Net 1.1 den 2.0' a ge&amp;ccedil;irilen projelerde rastlanabilecek bir durumdur. &lt;em&gt;( Dahası web.config dosyası dışarısında kullandığımız xml konfigurasyonları varsa daha ge&amp;ccedil;erli bir durumdur. ) &lt;/em&gt;Dolayısıyla b&amp;ouml;yle hallerde ilgili kısımların ham XML i&amp;ccedil;eriğini ele almak gerekebilir. Eğer ilgili kısmın Configuration API i&amp;ccedil;erisinde yer alan bir karşılığı yok ise yine &lt;strong&gt;ConfigurationSection&lt;/strong&gt; tipinden yararlanabiliriz. Temel olarak ConfigurationSection tipine ait nesne &amp;ouml;rneklerini Configuration tipinin &lt;strong&gt;GetSection&lt;/strong&gt; metodu ile elde edebilmekteyiz. Aşağıdaki kod par&amp;ccedil;aları bu işlemin nasıl ger&amp;ccedil;ekleştirilebileceğini g&amp;ouml;stermektedir. &amp;Ouml;rnek olarak yine appSettings ve connectionStrings par&amp;ccedil;alarını ele alıyoruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;// AppSettings kısmının ham XML i&amp;ccedil;eriğini elde etmek i&amp;ccedil;in SectionInformation &amp;ouml;zelliğinin GetRawXml metodu kullanılır.
protected void btnGetAppSetRawXml_Click(object sender, EventArgs e)
{
    GetConfig();
    ConfigurationSection cfgSec = _config.GetSection("appSettings");
    lblAppSetRawXml.Text = Server.HtmlEncode(cfgSec.SectionInformation.GetRawXml());
}
// ConnectionStrings kısmının ham XML i&amp;ccedil;eriğini elde etmek i&amp;ccedil;in SectionInformation &amp;ouml;zelliğinin GetRawXml metodu kullanılır.
protected void btnGetConStrRawXml_Click(object sender, EventArgs e)
{
    GetConfig();
    ConfigurationSection cfgSec = _config.GetSection("connectionStrings");
    lblConStrRawXml.Text = Server.HtmlEncode(cfgSec.SectionInformation.GetRawXml());
}&lt;/pre&gt;
&lt;p&gt;Yanlız burada dikkat etmemiz gereken bir nokta vardır. O da GetSection metodunun mutlaka ve mutlaka, ilgili kısmın web.config i&amp;ccedil;erisindeki &lt;strong&gt;harf duyarlı (case-sensitive)&lt;/strong&gt; bilgisini almak zorunda oluşudur. &amp;Ouml;rneğin connectionStrings yerine ConnectionStrings yazdığımızda &amp;ccedil;alışma zamanında aşağıdaki hata mesajını alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk165_6.gif" alt="" width="533" height="186" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulamamızı bu haliyle &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi appSettings ve connectionStrings sekmelerinin ham Xml i&amp;ccedil;eriklerini elde edebileceğimizi g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk165_5.gif" alt="" width="635" height="563" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;IIS kendi i&amp;ccedil;erisinde bir web uygulmasının ayarlarını değiştirmemizi sağlayacak bir y&amp;ouml;netim konsolu (management Console) i&amp;ccedil;erir. &lt;strong&gt;Asp.Net Microsoft Management Console Snap-In&lt;/strong&gt;' i sayesinde web.config i&amp;ccedil;erisindeki ayarları g&amp;ouml;rsel arabirimi kullanarak IIS &amp;uuml;zerinden de değiştirebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk165_2.gif" alt="" width="619" height="439" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu konsol sayesinde aşağıdaki resimden de g&amp;ouml;r&amp;uuml;lebileceği gibi hemen hemen t&amp;uuml;m kısımlara (sections) ait değişiklikleri kolayca ger&amp;ccedil;ekleştirebilmekteyiz. Bu elbette IIS &amp;uuml;zerinde var olan bir y&amp;ouml;netimsel ara birimdir ve zaman zaman tercih edebiliriz. Ama &amp;ouml;zellikle kendi web uygulamalarımızı uzaktan y&amp;ouml;netmek istediğimiz durumlarda, yonetim (admin) sayfalarından web.config gibi dosyalara daha kolay ve g&amp;uuml;&amp;ccedil;l&amp;uuml; bir şekilde de h&amp;uuml;kmedebilmeliyiz. Bu sebepten dolayı Configuration API' nin geliştirilmesi ve genişletilmesinin son derece isabetli olduğu kanısındayım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk165_3.gif" alt="" width="623" height="535" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu makalemizde temel olarak Asp.Net 2.0 ile gelen yeni konfigurasyon alt yapısını (Configuration API) incelemeye &amp;ccedil;alıştık. Eğer bu API i&amp;ccedil;erisindeki tipleri ve &amp;uuml;yelerini inceleyecek olursanız, aslında bir sistemin t&amp;uuml;m konfigurasyon ayarlarını &amp;ccedil;ok kolay ve etkin bir şekilde programatik olarak yapabileceğimizi g&amp;ouml;r&amp;uuml;rs&amp;uuml;n&amp;uuml;z. &amp;Ouml;zellikle xml tabanlı konfigurasyon i&amp;ccedil;eriklerini her hangi bir ayrıştırma (parsing) işlemine gerek duymadan y&amp;ouml;netebilecek tiplerle sahip olmak son derece etkili ve verimli bir geliştirme ortamı sağlayacaktır. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/ConfigMngAPI.rar"&gt;&amp;Ouml;rnek Uygulama İ&amp;ccedil;in Tıklayın.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2006-06-26 12:00:00</pubDate>
  <slug>Asp-Net-2-0-ile-Configuration-Management-(Konfigurasyon-Yonetimi)-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet-20</tag>
    <tag>configuration-api</tag>
    <tag>configuration-management</tag>
  </tags>
  <categories>
    <category>Asp.Net 2.0</category>
  </categories>
</post>