<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net 2.0 GridView Kontrolünde Update,Delete İşlemleri</title>
  <description>Bu makalemizde, Asp.Net 2.0 ile gelen yeni kontrollerden birisi olan GridView kontrolü üzerinde, veri güncelleme ve veri silme gibi işlemlerin nasıl yapılacağını incelemeye çalışacağız. Asp.Net 2.0 ve dolayısıyla Framework 2.0, özellikle veri bağlı kontrollerde, yazılım geliştiricilerin sıklıkla yaptıkları rutin işlemlerin dahada kolaylaştırılmasına izin veren mimari yaklaşımları benimsemektedir.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Bu makalemizde, Asp.Net 2.0 ile gelen yeni kontrollerden birisi olan GridView kontrol&amp;uuml; &amp;uuml;zerinde, veri g&amp;uuml;ncelleme ve veri silme gibi işlemlerin nasıl yapılacağını incelemeye &amp;ccedil;alışacağız. Asp.Net 2.0 ve dolayısıyla Framework 2.0, &amp;ouml;zellikle veri bağlı kontrollerde, yazılım geliştiricilerin sıklıkla yaptıkları rutin işlemlerin dahada kolaylaştırılmasına izin veren mimari yaklaşımları benimsemektedir.&lt;/p&gt;
&lt;p&gt;Bu makalemize konu olan GridView kontrol&amp;uuml; internet sayfalarında verilerin eski DataGrid kontrol&amp;uuml;nde olduğu gibi ızgara formatında g&amp;ouml;r&amp;uuml;nmesini sağlar. Bununla birlikte GridView kontrol&amp;uuml; &amp;uuml;zerinde sayfalama ve sıralama gibi işlemleri yapmak eskiye nazaran &amp;ccedil;ok daha kolaydır. İşte GridView kontrol&amp;uuml;n&amp;uuml;n yazılım geliştirici dostu olan yapısının bir diğer kolaylığıda, satırlar &amp;uuml;zerinde g&amp;uuml;ncelleme ve silme işlmelerine getirdiği yeniliklerde gizlidir.&lt;/p&gt;
&lt;p&gt;Bu makalemizde geliştireceğimiz &amp;ouml;rneğimizde, bir Access veri kaynağına bağlanacağımız bir web sayfamız olacak. Bu sayfada kullancağımız GridView kontrol&amp;uuml;n&amp;uuml; veri g&amp;uuml;ncelleme ve silme işlemleri i&amp;ccedil;in kullanacağız. Bu &amp;ouml;rneği geliştirebilmemiz i&amp;ccedil;in, GridView kontrol&amp;uuml;n&amp;uuml; Access veritabanımıza bağlayacak bir DataSource kontrol&amp;uuml;ne ihtiyacımız var. Access veritabanlarına bağlanmak ve ilgili veritabanı &amp;uuml;zerindeki tablolarda işlem yapabilmek i&amp;ccedil;in, .net Framework 2.0 ile gelen yeni nesnelerden birisi olan AccessDataSource kontrol&amp;uuml;n&amp;uuml; kullanacağız. Veritabanımız Access ile geliştirilmiş olup MailListesi isimli aşağıdaki Field yapısına sahip bir tabloyu barındırmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk89_1.gif" alt="" width="262" height="106" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 1. Access tablomuzun field yapısı.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Oluşturduğumuz bu tabloyu, web sitemiz i&amp;ccedil;in standart olarak a&amp;ccedil;ılan Data klas&amp;ouml;r&amp;uuml; altına kopyalayım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk89_12.gif" alt="" width="269" height="177" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 2. Veritabanımızı Data klas&amp;ouml;r&amp;uuml; altına koyalım.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Sıra geldi default.aspx sayfamızı tasarlamaya. &amp;Ouml;ncelikli olarak, AccessDataSource kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; aşağıdaki aspx kodları ile sayfaya ekleyelim.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:AccessDataSource ID="AccessDataSource1" Runat="server" DataFile="~/Data/veriler.mdb"
SelectCommand="SELECT * FROM [MailListesi]" UpdateCommand="UPDATE [MailListesi] SET Ad=@AD,Soyad=@SOYAD,Mail=@MAIL WHERE ID=@ID"&amp;gt;
    &amp;lt;UpdateParameters&amp;gt;
        &amp;lt;asp:Parameter Name="AD"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
        &amp;lt;asp:Parameter Name="SOYAD"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
        &amp;lt;asp:Parameter Name="MAIL"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
        &amp;lt;asp:Parameter Name="ID"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
    &amp;lt;/UpdateParameters&amp;gt;
&amp;lt;/asp:AccessDataSource&amp;gt;&lt;/pre&gt;
&lt;p&gt;Burada dikkat ederseniz, SelectCommand &amp;ouml;zelliği dışında, dikkati &amp;ccedil;eken bir diğer &amp;ouml;zellik UpdateCommand' dır. UpdateCommand &amp;ouml;zelliği, satırlardaki değişikliklerin veri kaynağına yansıtılmasında kullanılacak Sql sorgusunu i&amp;ccedil;ermektedir. Bu sql sorgusu dikkat edecek olursanız, &amp;ccedil;eşitli parametrelere sahiptir. Dikkate değer diğer bir noktada, parametre bildirimlerinin, Framework 1.0/1.1' de olan, OleDbCommand kontrollerindeki gibi, ? (soru işareti) olmayışıdır. Bu noktada, Sql sunucuları &amp;uuml;zerinde &amp;ccedil;alıştırılan parametreli sorgulardaki yapının (@Parametre_adı yapısı) aynısının Access kaynakları i&amp;ccedil;inde kullanılabildiğini ve b&amp;ouml;ylece ortak bir standardın oluşturulmuş olduğunuda belirtelim.&lt;/p&gt;
&lt;p&gt;UpdateCommand &amp;ouml;zelliğindeki Sql sorgusunda yer alan parametreler, AccessDataSource kontrol&amp;uuml;n&amp;uuml;n UpdateParameters koleksiyonunda birer Parameter nesnesi olarak tanımlanırlar. Basit&amp;ccedil;e burada parametrelerimizin isimlerini Name &amp;ouml;zellikleri ile belirledik. DataSource bileşenleri i&amp;ccedil;in, SelectCommand ve UpdateCommand komutları dışında kullanılabilecek diğer komutlarda, DeleteCommand ve InsertCommand' dir. Bunların herbirinin parametre koleksiyonları farklıdır. Yani DeleteCommand i&amp;ccedil;in parametre koleksiyonu DeleteParameters iken, InsertCommand i&amp;ccedil;in InsertParameters' dır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk89_2.gif" alt="" width="172" height="108" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 3. DataSource' lar i&amp;ccedil;in ge&amp;ccedil;erli diğer parametre koleksiyonları.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;AccessDataSource bileşenimiz artık veri &amp;ccedil;ekmek ve g&amp;uuml;ncellemek i&amp;ccedil;in hazırdır. Sırada, GridView kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;, bu veri kaynağına g&amp;ouml;re d&amp;uuml;zenlemek var. Bunun i&amp;ccedil;in, GridView kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; aşağıdaki aspx kodları ile oluşturmamız yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:GridView ID="GridView1" Runat="server" DataSourceID="AccessDataSource1" DataKeyNames="ID" AutoGenerateColumns="False"&amp;gt;
    &amp;lt;Columns&amp;gt;
        &amp;lt;asp:CommandField ShowEditButton="true"&amp;gt;&amp;lt;/asp:CommandField&amp;gt;
        &amp;lt;asp:BoundField ReadOnly="True" HeaderText="ID" InsertVisible="False" DataField="ID"
SortExpression="ID"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
        &amp;lt;asp:BoundField HeaderText="Ad" DataField="Ad" SortExpression="Ad"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
        &amp;lt;asp:BoundField HeaderText="Soyad" DataField="Soyad" SortExpression="Soyad"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
        &amp;lt;asp:BoundField HeaderText="Mail" DataField="Mail" SortExpression="Mail"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
    &amp;lt;/Columns&amp;gt;
&amp;lt;/asp:GridView&amp;gt;&lt;/pre&gt;
&lt;p&gt;Şu aşamada bizim i&amp;ccedil;in en &amp;ouml;nemli &amp;ouml;zellik, DataKeyNames' dir. Bu &amp;ouml;zellik, GridView kontrol&amp;uuml;nde &amp;uuml;zerindeki satırlarda yapılan veri değişiklikleri sonucu, g&amp;uuml;ncelleme işlemlerinin hangi primary key alanı &amp;uuml;zerinden yapılacağını belirtmektedir. Nitekim, Sql sorgumuza dikkat edecek olursanız, g&amp;uuml;ncelleme işleminin hangi alan i&amp;ccedil;in yapılacağını belirleyebilmek amacıyla, primary key olan ID alanı kullanılmıştır.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;UPDATE [MailListesi] SET Ad=@AD,Soyad=@SOYAD,Mail=@MAIL WHERE ID=@ID&lt;/pre&gt;
&lt;p&gt;Bu sebeple, GridView kontrol&amp;uuml;, Update butonuna basıldığında, DataKeyNames &amp;ouml;zelliğindeki field alanının değerini, se&amp;ccedil;ili olan satır &amp;uuml;zerinden AccessDataSource kontrol&amp;uuml;ndeki UpdateCommand sorgusuna g&amp;ouml;nderecektir. Diğer &amp;ouml;nemli &amp;uuml;ye ise, CommandField kontrol&amp;uuml;d&amp;uuml;r. Bu kontrol, satır &amp;uuml;zerinde hangi işlemin yapılacağı ile ilgili link (button) kontrollerinin g&amp;ouml;sterilmesi i&amp;ccedil;in kullanılmaktadır. Burada ShowEditButton &amp;ouml;zelliğine true değerini vererek, ilgili satır i&amp;ccedil;in Edit, Update ve Cancel linklerinin g&amp;ouml;sterilmesini sağlamış olduk. Artık web formumuza son halini verebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk89_3.gif" alt="" width="242" height="261" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 4. default.aspx sayfamızın g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml;.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şimdi sayfamızı tarayıcı penceresinde a&amp;ccedil;ar ve herhangibir satırda edit linkine tıklayacak olursak, aşağıdaki g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk89_4.gif" alt="" width="607" height="230" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 5. Edit linkine tıklandığında.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, ilgili satıra ait alanlarda TextBox kutucukları veri girişi i&amp;ccedil;in hazır beklemektedir. Bu noktada Update linkine tıklarsak, se&amp;ccedil;ili satırın ID değeri ile birlikte diğer alanların g&amp;uuml;ncel i&amp;ccedil;erikleri, AccessDataSource kontrol&amp;uuml;n&amp;uuml;n UpdateCommand &amp;ouml;zelliğinde kullanılan Sql sorgusuna parametre olarak g&amp;ouml;nderilirler. Ardından g&amp;uuml;ncelleme işlemi yapılır ve GridView kontrol&amp;uuml; g&amp;uuml;ncel i&amp;ccedil;eriği ile g&amp;ouml;r&amp;uuml;nt&amp;uuml;lenir. &amp;Ouml;rneğin, "Burak S." değerini "Burak Selim" yapıp Update linkine bastığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk89_5.gif" alt="" width="377" height="227" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 5. G&amp;uuml;ncelleme işlemi sonrası.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Tahmin edin, Delete işlemini nasıl ger&amp;ccedil;ekleştireceğiz. Uygulayacağımız mantık aslında, Update işlemi i&amp;ccedil;in uygulanan ile aynı olacaktır. İlk olarak AccessDataSource kontrol&amp;uuml;m&amp;uuml;zde, DeleteCommand &amp;ouml;zelliğini tanımlamalı ve ge&amp;ccedil;erli bir Delete sql sorgusu girmeliyiz. Ardından bu Sql sorgusunda kullanacağımız ID alanı i&amp;ccedil;in bir parametre ekelemeliyiz. Yani AccessDataSource kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; aşağıdaki hale getirmeliyiz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:AccessDataSource ID="AccessDataSource1" Runat="server" DataFile="~/Data/veriler.mdb"
SelectCommand="SELECT * FROM [MailListesi]" UpdateCommand="UPDATE [MailListesi] SET Ad=@AD,Soyad=@SOYAD,Mail=@MAIL WHERE ID=@ID" DeleteCommand="DELETE FROM [MailListesi] WHERE ID=@ID"&amp;gt;
    &amp;lt;UpdateParameters&amp;gt;
        &amp;lt;asp:Parameter Name="AD"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
        &amp;lt;asp:Parameter Name="SOYAD"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
        &amp;lt;asp:Parameter Name="MAIL"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
        &amp;lt;asp:Parameter Name="ID"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
    &amp;lt;/UpdateParameters&amp;gt;
    &amp;lt;DeleteParameters&amp;gt;
        &amp;lt;asp:Parameter Name="ID"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
&amp;lt;/DeleteParameters&amp;gt;&lt;/pre&gt;
&lt;p&gt;Tabi GridView kontrol&amp;uuml;m&amp;uuml;zde de Delete işlemi i&amp;ccedil;in gerekli linki (button' u) g&amp;ouml;stermeliyiz. Bu ama&amp;ccedil;lada, GridView kontrol&amp;uuml;n&amp;uuml;n CommandField bileşeninin ShowDeleteButton &amp;ouml;zelliğinin değerini true yapmalıyız.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:CommandField ShowDeleteButton="true" ShowEditButton="true"&amp;gt;&amp;lt;/asp:CommandField&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu değişikliklerden sonra sayfamızı &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk89_6.gif" alt="" width="411" height="225" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 7. Delete linkinin eklenmesi.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Eğer Delete linki ile bir satırı silecek olursak, ilgili satırın ID değeri, AccessDataSource kontrol&amp;uuml;ndeki, DeleteCommand &amp;ouml;zelliğine parametre olarak gidecek ve Sql sorgusu &amp;ccedil;alıştırılarak ilgili satır silinecektir. &amp;Ouml;rnek olarak, 1 ID değerine sahip satırı sildiğimizde, aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk89_7.gif" alt="" width="368" height="201" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 8. Satır silindikten sonra.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Bununla birlikte unutulmaması gereken &amp;ouml;nemli bir nokta vardır. Buradaki t&amp;uuml;m işlemler veri tablosuna doğrudan yansıtılır. Dolayısıyla, satırı sildiğimizde(g&amp;uuml;ncellediğimizde), AccessDataSource bunu kesinlikle, asıl tabloyada yansıtacaktır. Nitekim son işlemden sonra, tablomuza bakacak olursak ID değeri 1 olan satırın artık olmadığını g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk89_8.gif" alt="" width="462" height="103" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 9. Satır kesin olarak silinir.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Geliştirdiğimiz &amp;ouml;rneği biraz makyajlamaya ne dersiniz? &amp;Ouml;rneğin, Update, Edit, Cancel ve Delete kelimeleri yerine T&amp;uuml;rk&amp;ccedil;e bir şeyler &amp;ccedil;ıksa ve bunlar Link yerine button olsa fena olmazdı değil mi? Bunun i&amp;ccedil;in tek yapmamız gereken aşağıdaki aspx kodları ile, GridView kontrol&amp;uuml;m&amp;uuml;z&amp;uuml; g&amp;uuml;ncellemektir. Dikkat edecek olursanız, her bir kontrol&amp;uuml;n sonu Text kelimesi ile biten bir &amp;ouml;zelliği vardır. &amp;Ouml;rneğin Delete butonu i&amp;ccedil;in DeleteText. Dolayısıyla bunları değişitirerek ekranda g&amp;ouml;r&amp;uuml;nmesini istediğimiz metini belirtebiliriz. Ayrıca, linklerimizi button haline getirmek i&amp;ccedil;in, ButtonType &amp;ouml;zelliğine Button değerini atadık.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:CommandField ButtonType="Button" CancelText="İptal" EditText="D&amp;uuml;zenle" DeleteText="Sil" UpdateText="G&amp;uuml;ncelle" ShowDeleteButton="true" ShowEditButton="true"&amp;gt;&amp;lt;/asp:CommandField&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk89_9.gif" alt="" width="392" height="132" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk89_10.gif" alt="" width="182" height="132" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 10. T&amp;uuml;rk&amp;ccedil;e buttonlar.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Sayfamızın son olarak makyajlanmış hali ve ilgili aspx kodları aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk89_11.gif" alt="" width="286" height="512" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Şekil 11. Sayfamızın biraz daha makyajlı hali.&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ Page Language="C#" CompileWith="Default.aspx.cs" ClassName="Default_aspx" %&amp;gt;

&amp;lt;!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd"&amp;gt;

&amp;lt;html xmlns="http://www.w3.org/1999/xhtml" &amp;gt;
&amp;lt;head runat="server"&amp;gt;
&amp;lt;title&amp;gt;Untitled Page&amp;lt;/title&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body&amp;gt;
    &amp;lt;form id="form1" runat="server"&amp;gt;
    &amp;lt;div&amp;gt;
        &amp;lt;asp:AccessDataSource ID="AccessDataSource1" Runat="server" DataFile="~/Data/veriler.mdb"
SelectCommand="SELECT * FROM [MailListesi]" UpdateCommand="UPDATE [MailListesi] SET Ad=@AD,Soyad=@SOYAD,Mail=@MAIL WHERE ID=@ID" DeleteCommand="DELETE FROM [MailListesi] WHERE ID=@ID"&amp;gt;
            &amp;lt;UpdateParameters&amp;gt;
                &amp;lt;asp:Parameter Name="AD"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
                &amp;lt;asp:Parameter Name="SOYAD"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
                &amp;lt;asp:Parameter Name="MAIL"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
                &amp;lt;asp:Parameter Name="ID"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
            &amp;lt;/UpdateParameters&amp;gt;
            &amp;lt;DeleteParameters&amp;gt;
                &amp;lt;asp:Parameter Name="ID"&amp;gt;&amp;lt;/asp:Parameter&amp;gt;
            &amp;lt;/DeleteParameters&amp;gt;
        &amp;lt;/asp:AccessDataSource&amp;gt;&amp;lt;br/&amp;gt;
        &amp;lt;b&amp;gt;&amp;lt;span style="font-size: 24pt; color: #cc0000; font-family: Agency FB"&amp;gt;Mail Listesi&amp;lt;/span&amp;gt;&amp;lt;/b&amp;gt;
        &amp;lt;asp:GridView ID="GridView1" Runat="server" DataSourceID="AccessDataSource1" DataKeyNames="ID" AutoGenerateColumns="False" BorderWidth="1px" BackColor="White" GridLines="Vertical" CellPadding="4" BorderStyle="None" BorderColor="#DEDFDE" ForeColor="Black" AllowSorting="True" AllowPaging="True"&amp;gt;
            &amp;lt;FooterStyle BackColor="#CCCC99"&amp;gt;&amp;lt;/FooterStyle&amp;gt;
            &amp;lt;PagerStyle ForeColor="Black" HorizontalAlign="Right" BackColor="#F7F7DE"&amp;gt;&amp;lt;/PagerStyle&amp;gt;
            &amp;lt;HeaderStyle ForeColor="White" Font-Bold="True" BackColor="#6B696B"&amp;gt;&amp;lt;/HeaderStyle&amp;gt;
            &amp;lt;AlternatingRowStyle BackColor="White"&amp;gt;&amp;lt;/AlternatingRowStyle&amp;gt;
            &amp;lt;Columns&amp;gt;
                &amp;lt;asp:CommandField ButtonType="Button" CancelText="İptal" EditText="D&amp;uuml;zenle" DeleteText="Sil" UpdateText="G&amp;uuml;ncelle"     ShowDeleteButton="True" ShowEditButton="True"&amp;gt;&amp;lt;/asp:CommandField&amp;gt;
                &amp;lt;asp:BoundField ReadOnly="True" HeaderText="ID" InsertVisible="False" DataField="ID"
SortExpression="ID"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
                &amp;lt;asp:BoundField HeaderText="Ad" DataField="Ad" SortExpression="Ad"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
                &amp;lt;asp:BoundField HeaderText="Soyad" DataField="Soyad" SortExpression="Soyad"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
                &amp;lt;asp:BoundField HeaderText="Mail" DataField="Mail" SortExpression="Mail"&amp;gt;&amp;lt;/asp:BoundField&amp;gt;
            &amp;lt;/Columns&amp;gt;
            &amp;lt;SelectedRowStyle ForeColor="White" Font-Bold="True" BackColor="#CE5D5A"&amp;gt;&amp;lt;/SelectedRowStyle&amp;gt;
            &amp;lt;RowStyle BackColor="#F7F7DE"&amp;gt;&amp;lt;/RowStyle&amp;gt;
        &amp;lt;/asp:GridView&amp;gt;
    &amp;lt;/div&amp;gt;
    &amp;lt;/form&amp;gt;
&amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-09-07 12:00:00</pubDate>
  <slug>Asp-Net-2-0-GridView-Kontrolunde-UpdateDelete-Islemleri-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet-20</tag>
    <tag>gridview</tag>
    <tag>update</tag>
    <tag>delete</tag>
  </tags>
  <categories>
    <category>Asp.Net 2.0</category>
  </categories>
</post>