<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>DART Programlama Diliyle Az Biraz Uğraşmak</title>
  <description>Çok duydum, çok bahsedildi. Hep Flutter arkasında kaldı. Aslında yıllardır vardı. Birazcık bakmamın zamanı gelip de geçmişti. Haydi dedim o zaman. Önce onu Heimdall(Ubuntu-20.04) yüklemem gerekiyordu tabii. Bu adresteki talimatları takip ederek kurulumu gerçekleştirdim ve birkaç örnek kod parçasını bol yorum satırlarıyla önce skynet reposuna ardından da bloga bırakmaya karar verdim. Sizde Dart diline şöyle bir bakmak temel özelliklerini öğrenmek istiyorsanız aşağıdaki kronolojiyi takip ederek bana katılabilirsiniz. Eğer Java veya C# kökenliyseniz DART diline alışmanız da çok zor değil.</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/18/dart.jpg" alt="" align="right" /&gt;&amp;Ccedil;ok duydum, &amp;ccedil;ok bahsedildi. Hep Flutter arkasında kaldı. Aslında yıllardır vardı. Birazcık bakmamın zamanı gelip de ge&amp;ccedil;mişti. Haydi dedim o zaman. &amp;Ouml;nce onu Heimdall&lt;em&gt;(Ubuntu-20.04)&lt;/em&gt; y&amp;uuml;klemem gerekiyordu tabii. &lt;a href="https://dart.dev/get-dart" target="_blank"&gt;Bu adresteki talimatları&lt;/a&gt; takip ederek kurulumu ger&amp;ccedil;ekleştirdim ve birka&amp;ccedil; &amp;ouml;rnek kod par&amp;ccedil;asını bol yorum satırlarıyla &amp;ouml;nce skynet reposuna ardından da bloga bırakmaya karar verdim. Sizde Dart diline ş&amp;ouml;yle bir bakmak temel &amp;ouml;zelliklerini &amp;ouml;ğrenmek istiyorsanız aşağıdaki kronolojiyi takip ederek bana katılabilirsiniz. Eğer Java veya C# k&amp;ouml;kenliyseniz DART diline alışmanız da &amp;ccedil;ok zor değil. Tabii başlamadan &amp;ouml;nce adettendir dil ile ilgili s&amp;ouml;z&amp;uuml; ge&amp;ccedil;en genel &amp;ouml;zellikleri ş&amp;ouml;yle bir sıralayalım.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Google tarafından yazılmış &amp;ccedil;ok ama&amp;ccedil;lı bir programlama dilidir. A,B,C,D,E,F,G vitaminlerinin hepsini...Pardon :D Onunla web, mobil, masa&amp;uuml;st&amp;uuml; ve sunucu bazlı uygulamalar geliştirilebilir. Pek tabii google i&amp;ccedil;indeki bir&amp;ccedil;ok uygulama onunla yazılmıştır&lt;em&gt;(Adwords,AngularDart, Fuchsia ve tabii ki Flutter)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Merak edenler i&amp;ccedil;in...2011 de GOTO konferansında duyurulmuş ve ilk s&amp;uuml;r&amp;uuml;m&amp;uuml; 2013'te &amp;ccedil;ıkmıştır. Ama&amp;ccedil; web uygulamalarını daha kolay bir şekilde geliştirmektir.&lt;/li&gt;
&lt;li&gt;Nesne y&amp;ouml;nelimlidir, sınıf tabanlıdır, a&amp;ccedil;ık kaynaktır ve C t&amp;uuml;revli s&amp;ouml;z dizimine sahiptir.&lt;/li&gt;
&lt;li&gt;Statik tip desteği vardır ama "var" da vardır :) Yani tip tahmini&lt;em&gt;(type inference)&lt;/em&gt; &amp;ouml;zelliğini de sunar. Her ikisinin birleşimi = optionally typed olarak ifade edilmektedir.&lt;/li&gt;
&lt;li&gt;Fonksiyonel ve Reactive programlama paradigmalarını gayet g&amp;uuml;zel destekler.&lt;/li&gt;
&lt;li&gt;Native&lt;em&gt;(mobil taraf i&amp;ccedil;in &amp;ccedil;ok kıymetli)&lt;/em&gt; veya Javascript olarak&lt;em&gt;(bu enteresan ve bakılası bir bilgi)&lt;/em&gt; derlenebilir.&lt;/li&gt;
&lt;li&gt;Garbage Collector mekanizması vardır.&lt;/li&gt;
&lt;li&gt;Flutter ile &amp;ccedil;ok anılır ama flutter bilmeyen birisi bence &amp;ouml;nce Dart diline aşina olmalıdır. Ayrıca Flutter'ın performansında &amp;ouml;nem arz eden Hot Loading konusunu da doğrudan destekler. Zaten Ahead-Of-Time ve Just-In-Time gibi derleme opsiyonları sunar.&lt;/li&gt;
&lt;li&gt;Denilene g&amp;ouml;re TIOBE endeksinde ilk yirmide bile değil ancak diyoruz ya; &amp;ouml;nce dart sonra flutter. Hem sıralamada değil diye de &amp;ouml;ğrenme merakımıza ket mi vuralım!? :)&lt;/li&gt;
&lt;li&gt;&amp;Ouml;ğrenilmesi kolay bir dildir ve "hangi dille programlamaya başlayayım?" konusunda iyi bir alternatif olabilir.&lt;/li&gt;
&lt;/ul&gt;
&lt;h2&gt;Şimdi Reklamlar&lt;/h2&gt;
&lt;p&gt;Pardon &amp;ouml;rnekler :) Sırayla kodu tanımak adına yazdığımız &amp;ouml;rnekler &amp;uuml;zerinden bir ge&amp;ccedil;elim derim. Kodları Visual Studio Code &amp;uuml;st&amp;uuml;nde geliştirebilirsiniz. Arabirim, dart uzantısını g&amp;ouml;r&amp;uuml;nce otomatikman gerekli eklentileri de y&amp;uuml;kleyecektir. İlk Hello World &amp;ouml;rneğimizin kodlarını aşağıdaki gibi geliştirebiliriz&lt;em&gt;(Takip eden kodlardaki yorum satırlarını okumayı ihmal etmeyin)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;intro.dart;&lt;/p&gt;
&lt;pre class="brush:java;auto-links:false;toolbar:false" contenteditable="false"&gt;// Basit bir sınıf tanımıyla işe başlayalım
class Player {
  // birka&amp;ccedil; sınıf değişkeni. İlk etapta integer, string ve bool kullanabildim.
  // ek olarak double, list gibi veri t&amp;uuml;rleri de var.
  int id;
  String nickName;
  int level;

  // burada read-only bir instance variable (bana g&amp;ouml;re &amp;ouml;zellikl) tanımı var
  bool _online = false;
  bool get online =&amp;gt; _online; // sadece getter

  // Constructor tanımı. this ile doğrudan i&amp;ccedil; değişkenlere değer aktarımı sağlanır
  Player(this.id, this.nickName, this.level);
  
  // Yukarıdaki constructor bu şekilde de tanımlanabilir
  /*
    Player(id, nickName, level) {
    this.id = id;
    this.nickName = nickName;
    this.level = level;
  }
  */

  // toString metodunun ezilişi. toString &amp;ccedil;ağrılabilen yerlerde bizim istediğim şekilde d&amp;ouml;n&amp;uuml;ş olacak
  @override
  String toString() =&amp;gt;
      "$id, $nickName, $level"; // fat-arrow notation'ına g&amp;ouml;re tek satırda fonksiyon tanımı

  // değer d&amp;ouml;nd&amp;uuml;rmeyen bir iki metot
  void getOnline() {
    // if possible
    if (!_online) _online = true;
  }

  void getOffline() {
    if (_online) _online = false;
  }

  // String d&amp;ouml;nd&amp;uuml;ren bir metot
  String getState() {
    if (!online)
      return "Active";
    else
      return "Passive";
  }
}

// Programın giriş noktası (entry point)
void main() {
  // var wilmort=Player();

  // Player tipinden bir nesne &amp;ouml;rneği tanımı. new operat&amp;ouml;r&amp;uuml; de kullanılabilir ama şart değil.
  var runi = Player(1, "Ruynildson", 125);
  
  // runi'nin toString metodunu override etmiştik.
  print(runi);

  // Ternary operat&amp;ouml;r&amp;uuml;n&amp;uuml;n olmadığı bir programlama dili var mı acaba? :D
  print("Current state is ${runi.online == true ? "Active" : "Passive"}");

  runi.getOnline();
  print(runi.getState());

  runi.getOffline();
  print(runi.getState());

  // runi.online=false; // instance variable read-only tanımlandığı i&amp;ccedil;in burada derleme hatası oluşur
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/18/Screenshot_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;intro2.dart isimli ikinci &amp;ouml;rneğimizde opsiyonel parametre kullanımına bakıyoruz.&lt;/p&gt;
&lt;pre class="brush:java;auto-links:false;toolbar:false" contenteditable="false"&gt;class Vehicle {
  int x;
  int y;
  bool engineIsOn;
  String name;

  // Yine yapıcı metot tanımımız var.
  // Bu sefer opsiyonel parametre de kullanıyoruz.
  // B&amp;ouml;ylece varsayılan yapıcı metot dahil toplamda d&amp;ouml;rt versiyonla nesne &amp;ouml;rneği oluşturabiliriz
  Vehicle(
      {this.name = "anonymous",
      this.x = 0,
      this.y = 10,
      this.engineIsOn = false});

  // Kolaylık olsun diye toString metodunun varsayılan davranışını ezdik
  @override
  String toString() =&amp;gt; "$name ($x:$y) - $engineIsOn";
}

void main(List&amp;lt;String&amp;gt; args) {
  var ghost = Vehicle(); //parametresiz constructor &amp;ccedil;ağırılır
  print(ghost);

  var leopard = Vehicle(
      name: "leopard",
      x: 15,
      y: 20,
      engineIsOn: true); // opsiyonel parametre değerleri atanmalıdır
  print(leopard);

  var tiger = Vehicle(
      y: -45,
      name:
          "tiger t-10"); // sadece name ve y değişkenine değer atadığımız durum
  print(tiger);
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/18/Screenshot_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; &amp;ouml;rneğimiz data.dart isimli bir k&amp;uuml;t&amp;uuml;phaneyi kullanıyor ve basit bir Abstract Factory desenini uyarlıyor. Dolayısıyla intro3.dart'tan &amp;ouml;nce data.dart dosyasını kodlamamız lazım.&lt;/p&gt;
&lt;pre class="brush:java;auto-links:false;toolbar:false" contenteditable="false"&gt;/*
basit bir library &amp;ouml;rneği. 
Library'yi namespace veya paket gibi d&amp;uuml;ş&amp;uuml;nmek m&amp;uuml;mk&amp;uuml;n
burada &amp;ccedil;ok basit bir Abstract Factory tasarım kalıbı &amp;ouml;rneği uygulanmaktadır.
Dart'ın birka&amp;ccedil; nesne y&amp;ouml;nelimli davranışını anlamakttır ama&amp;ccedil;.
senaryo: Departmana g&amp;ouml;re rapor isteyen bir object user varmış. İlgilendiği raporların &amp;uuml;retilme detayları onun i&amp;ccedil;in &amp;ouml;nemli değil.
Bu &amp;uuml;retim işini fabrika nesneleri &amp;uuml;stlenecek. Budget, Performance ve Employees &amp;ouml;rnek raporlar. Bunları &amp;uuml;retme işi ise ReportFactory 
t&amp;uuml;revli fabrika nesnelerinde.
*/

library data;

// abstrat class
abstract class Report {
  void publish();
}

// concrete class
class Budget implements Report {
  void publish() {
    print("B&amp;uuml;t&amp;ccedil;e raporu dağıtılıyor");
  }
}

// concrete class
class Performance implements Report {
  void publish() {
    print("DB Performans raporu dağıtılıyor");
  }
}

// concrete class
class Employees implements Report {
  void publish() {
    print("&amp;Ccedil;alışan performans raporu dağıtılıyor");
  }
}

// factory
// rapor &amp;uuml;retme işini tanımlayan s&amp;ouml;zleşme
abstract class ReportFactory {
  Report
      CreateReport(); //Report d&amp;ouml;nd&amp;uuml;r&amp;uuml;yor. Yani Budget, Performance ve Employees i&amp;ccedil;in kullanılabilir
}

//concrete factory sınıfları
// B&amp;uuml;t&amp;ccedil;e raporu &amp;uuml;retme işini &amp;uuml;stlenen fabrika
class BudgetReportFactory implements ReportFactory {
  Budget CreateReport() {
    return Budget();
  }
}

class PerformanceReportFactory implements ReportFactory {
  Performance CreateReport() {
    return Performance();
  }
}

class EmployeesReportFactory implements ReportFactory {
  Employees CreateReport() {
    return Employees();
  }
}&lt;/pre&gt;
&lt;p&gt;ve bu paketi kullanan intro3.dart kodlarımız.&lt;/p&gt;
&lt;pre class="brush:java;auto-links:false;toolbar:false" contenteditable="false"&gt;/*
Bu &amp;ouml;rnek data.dart isimli k&amp;uuml;t&amp;uuml;phaneyi (library) kullanıyor.
data k&amp;uuml;t&amp;uuml;phanesinde basit bir Abstract Factory deseni uyarlaması var.
Hem kendi k&amp;uuml;t&amp;uuml;phanemizi nasıl kullanırız hem de abstract sınıftan t&amp;uuml;retme gibi OOP
&amp;ouml;zelliklerini nasıl uygularız diye bakıyoruz.
*/
import 'data.dart'; // Kendi yazdığımız k&amp;uuml;t&amp;uuml;phane bildirimi

// List&amp;lt;String&amp;gt; şaşırtmasın. Komut satırından parametre alabiliyoruz
main(List&amp;lt;String&amp;gt; args) {
  var option = args[0]; //terminal penceresinden ilk parametreyi alıyoruz.

  // rapor &amp;uuml;retici fabrika değişkeni tanımı
  ReportFactory factory;

  // bir se&amp;ccedil;ime g&amp;ouml;re gerekli factory nesnesi &amp;ouml;rnekleniyor
  switch (option) {
    case "b":
      factory = new BudgetReportFactory();
      break;
    case "e":
      factory = new EmployeesReportFactory();
      break;
    case "p":
      factory = new PerformanceReportFactory();
      break;
    default:
      print("ne desem bilemedim");
  }

  // Asıl istediğimiz raporu &amp;uuml;rettiriyoruz
  var report = factory.CreateReport();
  // ve hangi rapordan istediysek onun publish metodunun &amp;ccedil;ıktısını ekranda g&amp;ouml;rmeyi bekliyoruz
  report.publish();
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/18/Screenshot_3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;D&amp;ouml;rd&amp;uuml;nc&amp;uuml; &amp;ouml;rnekte dahili bir dart k&amp;uuml;t&amp;uuml;phanesinin kullanımına yer veriliyor.&lt;/p&gt;
&lt;p&gt;intro4.dart;&lt;/p&gt;
&lt;pre class="brush:java;auto-links:false;toolbar:false" contenteditable="false"&gt;/*
internal library kullanımı &amp;ouml;rneği.
dart.convert i&amp;ccedil;erisinde JSON ve UTF8 i&amp;ccedil;in faydalı d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme operasyonları var.
*/
import 'dart:convert';

main(List&amp;lt;String&amp;gt; args) {
  var someData = '''[
    {"id": 1, "color": "blue", "size": 10.50},
    {"id": 2, "color": "red", "size": 19},
    {"id": 3, "color": "green", "size": 50.987854}
  ]
  '''; // &amp;ouml;rnek bir JSON i&amp;ccedil;eriği var.

  var decoded =
      jsonDecode(someData); // decode edip aşağıdaki gibi kullanabiliriz

  for (var d in decoded) {
    print(
        "${d['id']} , ${d['color']}, ${d['size']}"); // String Interpolation sağolsun
  }

  print(decoded[1][
      'color']); // decode edilmiş dizideki birinci elemanın color niteliğinin değerini yazdırır

  //print(decoded);
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/18/Screenshot_4.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İzleyen beşinci &amp;ouml;rnekte Dart'ın temel fonksiyonel dil &amp;ouml;zelliklerini incelemeye &amp;ccedil;alışıyoruz.&lt;/p&gt;
&lt;pre class="brush:java;auto-links:false;toolbar:false" contenteditable="false"&gt;/* 
DART, fonksiyonel dil &amp;ouml;zelliklerini de b&amp;uuml;nyesinde barındırır.
Yani, fonksiyonları başka fonksiyonlara parametre olarak ge&amp;ccedil;ebilir, fonksiyonları değişkenlere atayabilir, isimsiz fonksiyonlar (anonymous'u hatırlayalım) yazabilir,
currying yapabiliriz (&amp;ccedil;ok parametreli bir fonksiyonu tek parametreli hale getirip kullandırtmak)...
Bu &amp;ouml;rnekte birka&amp;ccedil; fonksiyonel yaklaşımın nasıl kullanıldığına yer verilmektedir.
*/

import 'dart:math'; //Matematik k&amp;uuml;t&amp;uuml;phanesinden karek&amp;ouml;k fonksiyonunu kullanmak i&amp;ccedil;in

main(List&amp;lt;String&amp;gt; args) {
  // kobay bir sayı listesi
  var numbers = [4, 2, 9, 8, 6, 7, 6, 5, 1, 3, 3, 1, 6, 8];

  // Mesela 3nc&amp;uuml; ile 8nci arasındakilerinde bir işlem yapıp bunu imperative yaklaşımla ekrana yazdırmak istesek
  for (var i = 3; i &amp;lt; 8; i++) {
    print(sqrt(numbers[i]));
  }

  print("----");
  // Şimdi yukarıdaki işlemi fonksiyonel yaklaşımla yazalım
  numbers.skip(3).take(5).map(sqrt).forEach(print);

  // Birka&amp;ccedil; fat-arrow function tanımlaması
  var sum = (x, y) =&amp;gt; x + y;
  print(sum(3, 4));

  var multi = (num x, num y) =&amp;gt; x + y; // bu sefer parametre tipi belirttik
  print(multi(3.56, -4.213));

  num div(num x, num y) =&amp;gt;
      x / y; // Hem d&amp;ouml;n&amp;uuml;ş hep parametre tipleri a&amp;ccedil;ık&amp;ccedil;a belirtiliyor
  print(div(3, 9));

  // B&amp;ouml;yle g&amp;uuml;zel şeyler de yazabiliyoruz. Parametre olarak gelen
  // herhangi bir String listenin elemanlarının karakter sayısının toplamını bulan fonkisyon
  num findCharCount(List&amp;lt;String&amp;gt; names) =&amp;gt;
      names.map((name) =&amp;gt; name.length).fold(0, (num a, num b) =&amp;gt; a + b);
  print(findCharCount(["bir", "iki", "&amp;uuml;&amp;ccedil;", "d&amp;ouml;rt"]));
  print(findCharCount(
      ["black", "window", "currying", "livinsteineinenkovskiyevi&amp;ccedil;"]));
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/18/Screenshot_5.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim altıncı &amp;ouml;rneğe. Burada asenkron kullanım denenmektedir.&lt;/p&gt;
&lt;pre class="brush:java;auto-links:false;toolbar:false" contenteditable="false"&gt;/*
  Dart dilinde de asenkron fonksiyon kullanımları m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. 
  &amp;Ouml;zellikle uzun s&amp;uuml;ren işlerin ana iş par&amp;ccedil;acığını bekletmesini istemediğimiz durumlarda işe yarar.
  future bu anlamda &amp;ouml;nemli bir terimdir. Asenkron tasarlanan bir fonksiyon
  anında bir future d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. O anda feature Uncompleted pozisyonundadır.
  Asenkron &amp;ccedil;ağırılan fonksiyon başarılı şekilde tamamlandığında future,
  Completed pozisyonuna ge&amp;ccedil;er. Exception oluşursa da Completed pozisyonda kalamaz tabii.
  future dediğimiz şey esasında Future sınıfının bir nesne &amp;ouml;rneğidir.
  Asenkron bir fonksiyon değer d&amp;ouml;nebilir veya void olarak tanımlanabilir. 
  Future&amp;lt;void&amp;gt; ve Future&amp;lt;int&amp;gt; gibi.
  Declerative yaklaşıma g&amp;ouml;re asenkron olan fonksiyonlarda async kelimesi kullanılır.
  Asenkron fonksiyonun işini bitirdikten sonra sonucunu almak i&amp;ccedil;in await kullanılır.
*/
import 'reporter.dart';

main(List&amp;lt;String&amp;gt; args) async {
  var watson = Reporter();
  Counting(10);
  var value = await watson
      .GetReportResult(); //işlemlerin tamamlanmasını await ile bekletiyoruz
  print("Hesaplamalara g&amp;ouml;re risk değeri ${value}");
}

void Counting(int max) {
  for (var i = 1; i &amp;lt;= max; i++) {
    Future.delayed(Duration(seconds: i), () =&amp;gt; print(i));
  }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnekte asenkron olarak &amp;ccedil;ağırılabilen bir sınıfımız var. Reporter isimli bu sınıfı aşağıdaki gibi kodlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:java;auto-links:false;toolbar:false" contenteditable="false"&gt;class Reporter {
  // asenkron &amp;ccedil;ağırılabilecek şekilde tasarlanan fonksiyonumuz. async ve await kullanımlarına dikkat.
  // await fonksiyonları sadece async fonksiyonlar i&amp;ccedil;erisinde kullanılır
  Future&amp;lt;num&amp;gt; GetReportResult() async {
    print("Hesaplanıyor...");
    var value =
        await _calculateRisk(); // Uzun s&amp;uuml;ren fonksiyone awaitable. O bitene kadar kodu duraksattık
    print("Hesaplandı");
    return value;
  }

  // Risk değeri hesap eden b&amp;uuml;t&amp;ccedil;e fonksiyonumuzun uzun s&amp;uuml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml; varsayalım
  // delayed ile 5 saniyelik suni bir gecikme yaratıyoruz
  // 5 saniye sonrasında ise fonksiyona geriye 0.17 değerini taşıyan bir future d&amp;ouml;nd&amp;uuml;r&amp;uuml;yor
  Future&amp;lt;num&amp;gt; _calculateRisk() =&amp;gt; Future.delayed(
        Duration(seconds: 5),
        () =&amp;gt; 0.17,
      );

  // Bu arada metot adındaki _ işareti onu private yapar. Yani bu library dışında erişilemez. Mesela intro6.dart i&amp;ccedil;inden.
  // Yani bir library i&amp;ccedil;indeki metodun ya da alanın private olması isteniyorsa adının başına _ işareti konur
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/18/Screenshot_6.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Asenkron &amp;ccedil;alışma konusuna baktıysak Concurrency'ye bakmadan olmaz :) İşte Dart dilinde Concurrency'nin temel uygulanış bi&amp;ccedil;imi.&lt;/p&gt;
&lt;pre class="brush:java;auto-links:false;toolbar:false" contenteditable="false"&gt;/*
  Dart dilinde Concurrency konusu da desteklenir.
  Yani birden &amp;ccedil;ok işin eş zamanlı olarak başlatılması sağlanabilir.
  &amp;Uuml;stelik her biri ger&amp;ccedil;ekten de kendi bellek b&amp;ouml;lgesinde ve thread'i i&amp;ccedil;inde &amp;ccedil;alışır.
  Yani tam bağımsız &amp;ccedil;alışan iş&amp;ccedil;ilerdir. Aralarında mesajlaşarak haberleşebilirler. Bu a&amp;ccedil;ıdan Javascrip tarafındaki Web Worker'lara benzetilirler.
  Bunun i&amp;ccedil;in isolate k&amp;uuml;t&amp;uuml;phanesindeki Isolate sınıfı kullanılır.
  &amp;Ouml;rneği &amp;uuml;st&amp;uuml;ste birka&amp;ccedil; kez &amp;ccedil;alıştırmakta yarar var. &amp;Ccedil;ağırılan metot sıraları farklılık g&amp;ouml;sterecektir. 
  Isolate metotlarını her zaman aynı sırada başlatmaz.
*/

import 'dart:io';
import 'dart:isolate';

main(List&amp;lt;String&amp;gt; args) {
  //spawn ile eş zamanlı &amp;ccedil;alışacak 3 fonksiyon &amp;ccedil;ağrısı tanımlandı.
  // spawn Function&amp;lt;T&amp;gt; tipinden parametreler alır.
  // Geriye Future d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Doğal olarak asenkron yapıdadır.
  // Spawn static veya top level fonksiyonları işaret edebilir
  Isolate.spawn(Worker.CalculateTime, null);
  Isolate.spawn(Worker.GetPlayerStatistics, "Jordan");
  Isolate.spawn(Worker.TrashGarbage, null);

  print("İşler tetiklendi");
  sleep(Duration(seconds: 3)); // Ekran kapanmadan diğer işler bitsin diye eklendi.
}

class Worker {
  // static metotlar &amp;ccedil;ağırılırken tanımlandığını sınıfa ait nesne &amp;ouml;rneği gerektirmez
  // arg değeri spawn metodunun ikinci parametresi olarak gelir. Genellikle concurrent operasyonu bir nesne taşımak i&amp;ccedil;in kullanılır.
  static void GetPlayerStatistics(var arg) {
    print("${arg} i&amp;ccedil;in istatistikler &amp;ccedil;ekiliyor");
    print("Oyuncu istatistikleri hazır");
  }

  static void CalculateTime(var arg) {
    print("Zaman değerleri hesaplanıyor");
    print("Hesaplandı");
  }

  static void TrashGarbage(var arg) {
    print("Atıl nesneler atılıyor");
    print("Atıldılar...");
  }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/18/Screenshot_7.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sekizinci &amp;ouml;rnekte asenkron &amp;ccedil;ağrımlarda ele alınan stream nesnesine bir bakıyoruz. Bu sayede asenkron &amp;ccedil;ağırımlar sırasında olayların arasına nasıl girebileceğimizi irdeliyoruz.&lt;/p&gt;
&lt;pre class="brush:java;auto-links:false;toolbar:false" contenteditable="false"&gt;/*
  Dart asenkron programlamada Stream adı verilen bir mevzu da var.
  Stream ile asenkron olarak &amp;ccedil;alışan olaylarda araya girebiliyoruz.
  Stream'ler verinin bir noktadan diğerine akarken kullanılan kanalı referans ediyorlar.
  Bu alana girerek akan veri &amp;uuml;zerinde &amp;ccedil;eşitli işlemler yapabiliriz.
  Bu arada iki t&amp;uuml;r Stream var. Broadcast ve Single Subscription ki hen&amp;uuml;z ne olduklarını tam olarak &amp;ouml;ğrenemedim :(
*/

import 'dart:async';
import 'dart:io';

main() async {
  //awaitable &amp;ccedil;ağrım i&amp;ccedil;eriyor
  var stream = calculate(5); //stream nesnesini alıyoruz
  var total = await lookInsideStream(stream);
  print("\nToplam : ${total}");
}

// Asenkron &amp;ccedil;alışan bir operasyon ama geriye iteratif bir Stream d&amp;ouml;nd&amp;uuml;r&amp;uuml;yor.
// lookAtTheStream metodu bu d&amp;ouml;nen stream'i kullanıyor
Stream&amp;lt;num&amp;gt; calculate(num max) async* {
  for (int i = 1; i &amp;lt;= max; i++) {
    stdout.write("yield ${i}...");
    yield i;
  }
}

// Parametre olarak calculate &amp;ccedil;ağrısı sonucu &amp;uuml;retilen Stream'i almakta
// Buna g&amp;ouml;re kanal(channel) &amp;uuml;st&amp;uuml;ndeki her &amp;ccedil;ağrımda devreye girecek.
Future&amp;lt;num&amp;gt; lookInsideStream(Stream&amp;lt;num&amp;gt; stream) async {
  var sum = 0;
  await for (var value in stream) { //kanaldaki verilerde hareket edebiliriz
    stdout.write(" (${value}) "); // o an yakaladığımız veri &amp;uuml;st&amp;uuml;nde istediğimiz işlemi yapmamız m&amp;uuml;mk&amp;uuml;n
    sum += value;
  }
  return sum;
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/18/Screenshot_8.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve geldik bu &amp;ccedil;alışmadaki son iki &amp;ouml;rneğimize. İlk olarak &amp;ccedil;ok ilkel bir web sunucusunun nasıl yazıldığına bakıyoruz.&lt;/p&gt;
&lt;pre class="brush:java;auto-links:false;toolbar:false" contenteditable="false"&gt;/*
  Bu sefer ki &amp;ouml;rnekte ilkel bir web server nasıl yazılabilir onu anlamaya &amp;ccedil;alışacağız.
  Daha &amp;ouml;nceki &amp;ouml;rneklerde g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z async, await, Future ve hatta concurrent ile ilişkili olan
  Stream'ler burada daha anlamlı hale geliyor.
  Aşağıdaki &amp;ouml;rnek gelen HTTP Get taleplerinin hepsine standart bir HTML i&amp;ccedil;eriği d&amp;ouml;nd&amp;uuml;r&amp;uuml;yor.
  Harici taleplerde ise (HTTP Post,Put,Delete gibi) MethodNotAllowed (HTTP 405) scevabı verilmekte.
*/

import 'dart:io';

Future main(List&amp;lt;String&amp;gt; args) async {
  // localhost:8887 nolu adresi kendisine bağlayarak sunucu nesnesini oluşturduk
  // loopbackIPv4 localhost veya 127.0.0.1'i işaret edecektir. Portu tamamen keyfi se&amp;ccedil;tik.
  var server = await HttpServer.bind(
      InternetAddress.loopbackIPv4, 8887); //awaitable bir &amp;ccedil;ağrıdır

  print("Sunucu ${server.port} &amp;uuml;st&amp;uuml;nden dinlemede");

  // server &amp;uuml;zerine gelen http talepleri eş zamanlı olarak dinleniyor
  // HttpServer sınıfı Stream'leri kullandığından aşağıdaki gibi await for yazarak gelen her talep sonrası araya girmek m&amp;uuml;mk&amp;uuml;n oluyor.
  await for (HttpRequest request in server) {
    // Taleple ilgili birka&amp;ccedil; bilgi yazdırabiliriz. HTTP Metodu, gelen talep adresi vs...
    print("Gelen talep, ${request.method}\n Uri : ${request.requestedUri}");

    if (request.method == "GET") {
      // Gelen talep Get metodu ise bunları bunları yap
      // .. ile response nesnesi &amp;uuml;zerinden aynı ifadede hem &amp;ouml;zellik değeri atayabilir hem de metot &amp;ccedil;ağrısı ger&amp;ccedil;ekleştirebiliriz
      request.response
        ..statusCode = HttpStatus.ok // HTTP Stat&amp;uuml; kodu olarak 200 d&amp;ouml;n&amp;uuml;yoruz
        ..headers.contentType = ContentType
            .html // D&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z i&amp;ccedil;eriğin HTML formatında olduğu Header ile belirtiyoruz
        ..write(
            "&amp;lt;h2&amp;gt;Sunucu zamanı : ${DateTime.now().toString()}&amp;lt;/h2&amp;gt;") // basit bir HTML i&amp;ccedil;erik d&amp;ouml;nd&amp;uuml;r&amp;uuml;yoruz
        ..write(
            "&amp;lt;p&amp;gt;Şu anda ${request.requestedUri.path} adresine talepte bulundunuz&amp;lt;/p&amp;gt;")
        ..close(); // response diğer dillerde olduğu gibi kapatılmalı
    } else {
      //değilse istemciye s&amp;ouml;z konusu metot &amp;ccedil;ağrısına izin verilmediğini s&amp;ouml;yle
      request.response
        ..statusCode = HttpStatus.methodNotAllowed
        ..write(
            "${request.method} metodu bu sunucu tarafından desteklenmemektedir.")
        ..close();
    }
  }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/18/Screenshot_9.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/18/Screenshot_10.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabii bu ilkel web sunucusu arkasına ş&amp;ouml;yle JSON i&amp;ccedil;eriği sunan g&amp;uuml;zel bir REST servis koysak hi&amp;ccedil; de fena olmaz diyor ve devam ediyoruz.&lt;/p&gt;
&lt;pre class="brush:java;auto-links:false;toolbar:false" contenteditable="false"&gt;/*
  Web server maceralarına devam.
  Bu seferki &amp;ouml;rnekte fiziki bir JSON dosyasının i&amp;ccedil;eriğini geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;yoruz.
  Bunu, sadece HTTP Get metodunda ve /heros path'ine gelen talepler karşılığında yapıyoruz.
  Buradan yola &amp;ccedil;ıkarak &amp;ccedil;ok basit bir CRUD Rest servisine kadar gidilebilir.
*/
import 'dart:io';

Future main(List&amp;lt;String&amp;gt; args) async {
  // localhost ve 8888 portunu server nesnesine bağladık
  var server = await HttpServer.bind(InternetAddress.loopbackIPv4, 8888);

  print("${server.port} nolu portan dinlemedeyiz");

  // server ile a&amp;ccedil;ılan stream &amp;uuml;st&amp;uuml;nde ger&amp;ccedil;ekleşen istekleri dinliyoruz
  await for (HttpRequest req in server) {
    print("${req.method}, ${req.uri}");

    // Eğer talep GET metodundaysa ve path /heros ise
    if (req.method == "GET" &amp;amp;&amp;amp; req.requestedUri.path == "/heroes") {
      // JSON formatında i&amp;ccedil;erik d&amp;ouml;neceğimiz i&amp;ccedil;in ContentType'a uygun değeri atadık
      req.response.headers.contentType = ContentType.json;
      // Stat&amp;uuml; kodunu g&amp;uuml;ncelledik
      req.response.statusCode = HttpStatus.ok;
      // JSON verisi i&amp;ccedil;in kaynak -&amp;gt; https://gist.github.com/mariodev12/a923f2b651a005ca3ca7f851141efcbc

      // İlgin&amp;ccedil; bir kod par&amp;ccedil;ası değil mi?
      // File nesnesini bir değişkene atamadan kullanıyoruz.
      await new File('superHeroes.json') // json dosyasının i&amp;ccedil;eriğini
          .readAsString() //string formatta oku
          .then((content) =&amp;gt; req.response.write(
              content)); //okuma tamamlandığında response &amp;uuml;st&amp;uuml;ne yaz (Zaten saf json i&amp;ccedil;eriği olduğundan decode etmemiz gerek yok)

    } else {
      // Farklı bir talep gelirse 404 Not Found muamelesi g&amp;ouml;ster
      req.response.statusCode = HttpStatus.notFound;
      // Nezaketen de bir cevap yaz :D
      req.response.write(
          "${req.method} ve ${req.requestedUri.path} kullanılabilir değil.");
    }
    await req.response
        .close(); // buffer'a alınmış bir şeyler olma ihtimaline karşın t&amp;uuml;m i&amp;ccedil;eriği yazdırmayı garantile
  }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2020/skynet/18/Screenshot_11.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Eğer bu noktaya kadar kodları tatbik edip benzer sonu&amp;ccedil;lar elde ettiyseniz Dart diline giriş yapmışsınız demektir. Elbette &amp;uuml;st&amp;uuml;ne katarak devam etmek tamamen sizin elinizde. Bu arada &amp;ouml;rnekleri nasıl &amp;ccedil;alıştıracağınızı s&amp;ouml;ylemeyi unutmuş olabilirim. Aşağıdaki terminal komutu bunun i&amp;ccedil;in yeterli.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dart intro.dart&lt;/pre&gt;
&lt;h2&gt;&amp;Ouml;devler&lt;/h2&gt;
&lt;p&gt;Pratik yapmak amacıyla yukarıdaki &amp;ouml;rnekleri tamamladıktan sonra aşağıdaki g&amp;ouml;revleri yerine getirmeye &amp;ccedil;alışabilirsiniz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Dart ile en az iki tasarım kalıbını uygulamaya &amp;ccedil;alışın.&lt;/li&gt;
&lt;li&gt;Komut satırından &amp;ccedil;alışan ve basit d&amp;ouml;rt işlem yapan bir hesap makinesi geliştirin&lt;em&gt;(hesaplama komutları ayrı bir k&amp;uuml;t&amp;uuml;phanede olsun)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Bir şirket &amp;ccedil;alışanına ait bilgileri i&amp;ccedil;eren bir sınıfa ait nesne dizisini JSON formatından serileştirmeyi deneyin.&lt;/li&gt;
&lt;li&gt;intro9 &amp;ouml;rneğinden ilham alarak sadece HTTP Get ve Post operasyonlarını i&amp;ccedil;eren ve sadece JSON tipiyle &amp;ccedil;alışan basit bir REST Api sunucusu geliştirin.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Yazımızda yer alan &amp;ouml;rneklerin tamamına &lt;a href="https://github.com/buraksenyurt/skynet/tree/master/No%2018%20-%20Introduction%20for%20DARTlang" target="_blank"&gt;skynet github reposu&lt;/a&gt; &amp;uuml;zerinden de erişebilirsiniz. B&amp;ouml;ylece geldik bir derlemenin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2020-06-07 14:14:00</pubDate>
  <slug>dart-programlama-diliyle-az-biraz-ugrasmak</slug>
  <tags>
    <tag>dart</tag>
    <tag>dartlang</tag>
  </tags>
  <categories>
    <category>Dart</category>
  </categories>
</post>