<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Bu Sefer Bir React Uygulamasını Heroku Üzerine Alalım</title>
  <description>Sekiz numaralı örnekteki amacım node.js ile çalıştırılan basit bir React uygulamasını Heroku üzerine taşımaktı. React ile node haberleşmesinde express paketini kullanmıştım. Bu paket deneyimlediğim kadarıyla HTTP yönlendiricisi olarak kullanılmaktaydı. React tarafına gelen HTTP taleplerini karşılarken kullanılabilmekte. Diğer yandan React tarafında çok fazla tecrübem olmadığından benim için hala kapalı kutu olma özelliğini taşıyor. Bir nevi ona da merhaba demek istediğim bir çalışma olduğunu ifade edebilirim.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2019/06/08/hamlett.png" alt="" /&gt;Sir &lt;a href="http://sirkenrobinson.com/" target="_blank"&gt;Ken Robinson&lt;/a&gt;, &amp;ccedil;ocukların hayal g&amp;uuml;&amp;ccedil;lerini sınırlayan eğitim sistemini eleştirdiği &lt;a href="https://www.ted.com/talks/ken_robinson_says_schools_kill_creativity?language=en" target="_blank"&gt;TED'in en &amp;ccedil;ok izlenen sunumu&lt;/a&gt;nda&amp;nbsp;William Shakespeare ile ilgili g&amp;uuml;zel bir anektod paylaşır. Konuşmasının ilgili b&amp;ouml;l&amp;uuml;m&amp;uuml;nde profes&amp;ouml;r onun bir zamanlar yedi yaşında bir &amp;ccedil;ocuk olduğunu dile getirir. Kısa bir an i&amp;ccedil;in duraksar ve ne diyeceğini merak eden seyirciye "...Shakespeare'i hi&amp;ccedil; &amp;ccedil;ocuk olarak d&amp;uuml;ş&amp;uuml;nmemiştiniz, değil mi?"&amp;nbsp;der :)&lt;/p&gt;
&lt;p&gt;Hepimiz onu &amp;uuml;nl&amp;uuml; İngiliz şair ve yazar olarak bilir Romeo Juliet, Macbeth, Othello ve diğer trajedileri ile hatırlarız. Hatta "olmak yada olmamak, işte b&amp;uuml;t&amp;uuml;n mesele bu" s&amp;ouml;zleri hafızalarımıza kazınmıştır. Ancak &amp;ccedil;oğumuz onun da bir zamanlar &amp;ccedil;ocuk olduğunu ve bir &amp;ouml;ğretmenin edebiyat dersine girdiğini d&amp;uuml;ş&amp;uuml;nmeyiz&lt;em&gt;(Bunu Ken Robinson gayet g&amp;uuml;zel bir şekilde d&amp;uuml;ş&amp;uuml;nd&amp;uuml;rt&amp;uuml;yor)&lt;/em&gt; Onun da&amp;nbsp;hepimiz gibi &amp;ccedil;ocukken kurduğu hayaller olduğunu bu c&amp;uuml;mleleri duyana kadar da fark etmeyiz. &amp;Ccedil;ok ş&amp;uuml;k&amp;uuml;r ki &lt;a href="https://github.com/buraksenyurt/saturday-night-works/tree/master/No%2008%20-%20Express%20with%20React%20to%20Heroku" target="_blank"&gt;sekiz numaralı &amp;ccedil;alışma&lt;/a&gt;mın i&amp;ccedil;erisinde ge&amp;ccedil;en bir kelime benim onu, onun yardımıyla&amp;nbsp;Sir Ken Robinson'u ve sonrasında da bu g&amp;uuml;zel anekdotu&amp;nbsp;hatırlamamı sağladı. Nihayetinde Shakespeare'in &amp;ouml;l&amp;uuml;ms&amp;uuml;z eserlerinden olan Hamlet'in Heroku tarafından bana &amp;ouml;nerilmesi işte&amp;nbsp;bu kısa girizgahın hayat bulmasına vesile oldu.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Sekiz numaralı &amp;ouml;rnekteki amacım node.js&amp;nbsp;ile &amp;ccedil;alıştırılan basit bir React uygulamasını Heroku &amp;uuml;zerine taşımaktı. React ile node haberleşmesinde express paketini kullanmıştım. Bu paket deneyimlediğim&amp;nbsp;kadarıyla HTTP y&amp;ouml;nlendiricisi olarak kullanılmaktaydı. React tarafına gelen HTTP taleplerini karşılarken kullanılabilmekte.&amp;nbsp;Diğer yandan React tarafında &amp;ccedil;ok fazla tecr&amp;uuml;bem olmadığından benim i&amp;ccedil;in hala kapalı kutu olma &amp;ouml;zelliğini taşıyor. Bir nevi ona da merhaba demek istediğim bir &amp;ccedil;alışma olduğunu ifade edebilirim.&lt;/p&gt;
&lt;p&gt;&lt;a href="https://www.heroku.com/" target="_blank"&gt;Heroku&lt;/a&gt; 2007 yılında işe başladığında sadece Ruby on Rails bazlı web uygulamalarına destek veren bir bulut bilişim sistemiydi ancak Platform as a Service&lt;em&gt;(PaaS)&lt;/em&gt; olarak olgunlaştıktan sonra Java, Node.js, Scala, Python, Go, Closure ve benzeri bir &amp;ccedil;ok dil ile geliştirilen uygulmalar i&amp;ccedil;in de hizmet vermeye başladı. Aslında heroku &amp;uuml;zerindeki ilk denememi 2018 yılında yapmış ve &lt;a href="https://buraksenyurt.com/post/express-api-hizmetini-heroku-uzerine-tasimak" target="_blank"&gt;ş&amp;ouml;yle bir yazı&lt;/a&gt;&amp;nbsp;yazmıştım. Teknolojinin gelişimi d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde aradan yadsınamayacak kadar &amp;ccedil;ok zaman ge&amp;ccedil;miş diyebilirim. O y&amp;uuml;zden bu tip platformlara ara ara d&amp;ouml;n&amp;uuml;ş yaparak farklı enstr&amp;uuml;manlarla kullanmayı denemek g&amp;uuml;ncel kalmamız a&amp;ccedil;ısından &amp;ouml;nemli. &amp;Ouml;yleyse vakit kaybetmeden &lt;a href="https://github.com/buraksenyurt/saturday-night-works/tree/master/No%2008%20-%20Express%20with%20React%20to%20Heroku" target="_blank"&gt;sekiz numaralı Cumartesi gecesi &amp;ccedil;alışması&lt;/a&gt;nı derlemeye başlayalım.&lt;/p&gt;
&lt;h2&gt;Gerekli Hazırlıklar&lt;/h2&gt;
&lt;p&gt;Tabii &amp;ouml;ncelikle Heroku &amp;uuml;zerinde bir hesap a&amp;ccedil;mak gerekiyor. Ben gerekli hesabı a&amp;ccedil;tıktan sonra WestWorld&lt;em&gt;(Ubuntu 18.04, 64bit) &lt;/em&gt;&amp;uuml;zerinde Heroku CLI&lt;em&gt;(command-line interface)&lt;/em&gt; kurulumunu da yaptım. B&amp;ouml;ylece heroku ile ilgili işlemlerimizi terminal komutlarını kullanarak kolayca ger&amp;ccedil;ekleştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo snap install --classic heroku&lt;/pre&gt;
&lt;p&gt;Kurulum sonrası login olmamız gerekecektir.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;heroku login -i&lt;/pre&gt;
&lt;p&gt;Yukarıdaki terminal komutunu &amp;ccedil;alıştırdıktan sonra credential bilgileri sorulur&lt;em&gt;(-i parametresini heroku login bilgilerinin kalıcı olması i&amp;ccedil;in kullanabiliriz) &lt;/em&gt;Heroku tarafı ile iletişimi kurduğumuza g&amp;ouml;re uygulamanın &amp;ccedil;atısını oluşturmaya başlayabiliriz.&lt;em&gt;&amp;nbsp;&lt;/em&gt;&amp;Ouml;ncelikle&amp;nbsp;app isimli bir klas&amp;ouml;r a&amp;ccedil;ıp aşağıdaki terminal komutu ile node tarafını başlatalım. Biraz sonra kuracağımız React uygulamamız ile konuşacağı basit node sunucusu bu klas&amp;ouml;rde yer alacak.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm init&lt;/pre&gt;
&lt;p&gt;Bazı yardımcı paketlerimiz var. Bunları şu terminal komutu ile y&amp;uuml;kleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm i --save-dev express nodemon concurrently&lt;/pre&gt;
&lt;p&gt;express, servis tarafını daha kolay kullanabilmemiz i&amp;ccedil;in gerekli &amp;ouml;zellikleri sunan bir paket. nodemon ile de node.js tarafında yapılan değişikliklerin otomatik olarak algılanması sağlanıyor. Yani uygulamayı tekrar başlatmaya gerek kalmadan kod tarafındaki değişikliklerin &amp;ccedil;alışma zamanına yansıtılması sağlanabilir. concurrently paketi hem express hem react uygulamalarının aynı anda başlatılması i&amp;ccedil;in kullanılmakta. Paket y&amp;uuml;klemeleri tamamlandıktan sonra app k&amp;ouml;k klas&amp;ouml;r&amp;uuml; altında server.js isimli bir dosya oluşturup kodlamasını sonradan tamamlamak &amp;uuml;zere &amp;ccedil;alışmamıza devam edebiliriz.&lt;/p&gt;
&lt;h2&gt;React&amp;nbsp;Uygulamasının Oluşturulması&lt;/h2&gt;
&lt;p&gt;React uygulmasını standart bir hello-world şablonu şeklinde a&amp;ccedil;acağız. Bunun i&amp;ccedil;in aşağıdaki terminal komutunu kullanmamız yeterli.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm i -g create-react-app
create-react-app fromwestworld&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;Bu arada create-react-app komutu ile&amp;nbsp;uygulamayı oluştururken şunu fark ettim ki proje adında sadece k&amp;uuml;&amp;ccedil;&amp;uuml;k harf kullanılabiliyor. İlerde değişir mi, siz bunu okurken değişmiş midir, neden b&amp;ouml;yledir tam bilemiyorum ama bir unix isimlendirme standardından kaynaklıdır diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum&lt;em&gt;(Fikri olan?)&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bir s&amp;uuml;re ge&amp;ccedil;tikten sonra fromwestworld klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisinde React i&amp;ccedil;in gerekli ne varsa oluşturulduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Oluşturulan bu şablonu &amp;ccedil;ok fazla bozmadan kullanabiliriz.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdi geliştirme ortamı i&amp;ccedil;in fromwestworld klas&amp;ouml;r&amp;uuml;ndeki package.json i&amp;ccedil;erisine bir proxy tanımı ekleyerek devam edelim. Biraz sonra kodlayacağımız node sunucumuz 5005 numaralı porttan yayın yapacak&lt;em&gt;(geliştirme ortamı i&amp;ccedil;in farklı bir portta tercih edilebilir)&lt;/em&gt; Bu bildirim ile React uygulmasının geliştirme ortamında konuşacağı servis adresi ifade edilir. Bir başka deyişle React'a gelen HTTP taleplerinin y&amp;ouml;nlendirileceği adresi belirtiyoruz.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;"proxy": "http://localhost:5005",&lt;/pre&gt;
&lt;p&gt;Şablonla gelen app.js i&amp;ccedil;eriğini aşağıdaki gibi değiştirebiliriz. İ&amp;ccedil;eriğin şu anda &amp;ccedil;ok fazla &amp;ouml;nemi yok. Hedefimiz olan Heroku deployment i&amp;ccedil;in m&amp;uuml;mk&amp;uuml;n mertebe basit kodlar kullanmakta yarar var.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;import React, { Component } from 'react';
import logo from './logo.svg';
import './App.css';

class App extends Component {
  render() {
    return (
      &amp;lt;div className="App"&amp;gt;
        &amp;lt;header className="App-header"&amp;gt;
          &amp;lt;img src={logo} className="App-logo" alt="logo" /&amp;gt;
          &amp;lt;p&amp;gt;
            Edit &amp;lt;code&amp;gt;src/App.js&amp;lt;/code&amp;gt; and save to reload.
          &amp;lt;/p&amp;gt;
          &amp;lt;a
            className="App-link"
            href="https://www.buraksenyurt.com"
            target="_blank"
            rel="noopener noreferrer"
          &amp;gt;
            Bu benim blog sayfamdır :)
          &amp;lt;/a&amp;gt;
        &amp;lt;/header&amp;gt;
      &amp;lt;/div&amp;gt;
    );
  }
}

export default App;&lt;/pre&gt;
&lt;p&gt;React uygulamasının iletişimde olacağı&amp;nbsp;sunucuya ait server.js dosyasını da aşağıdaki gibi yazabiliriz.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;var express = require('express');
var app = express();
var path = require('path');
var port = process.env.PORT || 5005; //heroku'nun portu veya local geliştirme i&amp;ccedil;in belirlediğimiz 5005 nolu port

// statik klas&amp;ouml;r bildirimini yapıyoruz
app.use(express.static(path.join(__dirname, 'fromwestworld/build')));

//canlı ortamdaysak yani uygulamamız Heroku'ya alınmışsa
if (process.env.NODE_ENV === 'production') {
    // build klas&amp;ouml;r&amp;uuml;nden index.html dosyasını alıp get talebinin karşılığı olarak istemciye sunuyoruz
    app.use(express.static(path.join(__dirname, 'fromwestworld/build')));
    app.get('*', (req, res) =&amp;gt; {
        res.sendfile(path.join(__dirname = 'fromwestworld/build/index.html'));
    })
}

// Eğer canlı ortamda(heroku'da) değilsek ve amacımız sadece localhost'ta test ise
// index.html'i public klas&amp;ouml;r&amp;uuml;nden sunuyoruz
app.get('*', (req, res) =&amp;gt; {
    res.sendFile(path.join(__dirname + '/fromwestworld/public/index.html'));
})

// express sunucusunu &amp;ccedil;alıştırıyoruz
app.listen(port, (req, res) =&amp;gt; {
    console.log(`sunucumuz ${port} nolu porttan yayındadır`);
})&lt;/pre&gt;
&lt;p&gt;Temel olarak bulunulan ortama&lt;em&gt;(development veya production)&lt;/em&gt; g&amp;ouml;re public klas&amp;ouml;r&amp;uuml;nde yer alan&lt;em&gt;(ve benim &amp;uuml;zerinde hi&amp;ccedil;bir değişiklik yapmadığım)&lt;/em&gt; index.html sayfasının sunulması s&amp;ouml;z konusu. Kod tarafındaki bu değişiklilere ilaveten root klas&amp;ouml;r olarak d&amp;uuml;ş&amp;uuml;neceğimiz app altındaki package.json dosyasındaki scripts kısmını da kurcalamalıyız. G&amp;uuml;ncel hali aşağıdaki gibi.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;"scripts": {
"client-install": "npm install --prefix fromwestworld",
"start": "node index.js",
"server": "nodemon index.js",
"client": "npm start --prefix fromwestworld",
"dev": "concurrently \"npm run server\" \"npm run fromwestworld\""
}&lt;/pre&gt;
&lt;p&gt;Bunlardan start haricindekiler &lt;em&gt;npm run&lt;/em&gt; arkasına eklenen komutlardır. &amp;Ouml;rneğin&amp;nbsp;&lt;em&gt;npm start&lt;/em&gt; ile&amp;nbsp;&lt;em&gt;node index.js&lt;/em&gt;&amp;nbsp;komutu ve dolayısıyla uygulama &amp;ccedil;alışır. Diğer yandan &lt;em&gt;npm run server&lt;/em&gt; ile nodemon devreye alınır ve kodda yapılan değişiklik anında &amp;ccedil;alışma zamanına yansır. &lt;em&gt;npm run client,&lt;/em&gt; sunucuyu başlatmadan react uygulamasını &amp;ccedil;alıştırma g&amp;ouml;revini &amp;uuml;stlenir. &lt;em&gt;npm run client-install&lt;/em&gt; sayesinde ise React uygulaması i&amp;ccedil;in gerekli t&amp;uuml;m bağımlılıklar ilgili ortama&lt;em&gt;(&amp;ouml;rnekte Heroku olacaktır)&lt;/em&gt;&amp;nbsp;y&amp;uuml;klenir. &lt;em&gt;npm run dev&lt;/em&gt; ile development ortamı ayağa kalkar ve hem node sunucusu hem de react uygulaması aynı anda başlatılır.&lt;/p&gt;
&lt;p&gt;Uygulamayı komple &amp;ccedil;alıştırmak i&amp;ccedil;in app&amp;nbsp;klas&amp;ouml;r&amp;uuml;ndeyken&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm run dev&lt;/pre&gt;
&lt;p&gt;terminal komutunu işletebiliriz. concurrently paketi bu noktada bize avantaj sağlamaktadır. Eş zamanlı olarak "npm run server" ve "npm run client" komutlarının işletilmesinde rol alır.&lt;/p&gt;
&lt;p&gt;Bu işlem sonrasında &amp;ouml;nce node sunucusu y&amp;uuml;klenir. Sunucu &amp;ccedil;alışmaya başladıktan sonra React uygulaması tetiklenir ve localhost:3000 nolu porttan ilgili i&amp;ccedil;eriğe ulaşılır. Hatırlayacağınız &amp;uuml;zere node sunucusu 5005 numaralı porttan hizmet veriyordu. React uygulamasında yapılan proxy bildirimi, 3000 nolu adrese gelen HTTP taleplerinin arkadaki node sunucusuna y&amp;ouml;nlendirilmesinde rol alır. Dolayısıyla React uygulaması &amp;ccedil;alışmaya başladığında oluşan HTTP Get talebi server.js dosyasındaki get metodlarına d&amp;uuml;şer. Buradaki bildirimlere g&amp;ouml;re fromwestworld i&amp;ccedil;erisindeki index.html dosyasının sunulması s&amp;ouml;z konusudur. index.html i&amp;ccedil;eriğinde dikkat edileceği &amp;uuml;zere root id'li bir div elementi vardır. Yine dikkat edilecek olursa index.js tarafı da aşağıdaki gibidir&amp;nbsp;&lt;em&gt;(Hi&amp;ccedil; değiştirmedim)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;import React from 'react';
import ReactDOM from 'react-dom';
import './index.css';
import App from './App';
import * as serviceWorker from './serviceWorker';

ReactDOM.render(&amp;lt;App /&amp;gt;, document.getElementById('root'));

serviceWorker.unregister();&lt;/pre&gt;
&lt;p&gt;ReactDOM.render metoduna dikkat edelim. root isimli DOM elementini yakalayıp buraya app isimli bileşenin basılması sağlanmaktadır. &amp;Ouml;zetlemek gerekirse React uygulaması kendi i&amp;ccedil;eriklerini sunarken arka plandaki node sunucusu ile anlaşmaktadır. Buna g&amp;ouml;re server.js tarafında sunucu bazlı materyalleri&lt;em&gt;(veri tabanı, asenkron operasyonlar vb)&lt;/em&gt; kullanarak bunların react bileşenlerince ele alınması sağlanabilir.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alışmayı ger&amp;ccedil;ekleştiğimde West-World tarafında uygulamanın a&amp;ccedil;ılması biraz zaman almıştı. Sizin de benim gibi sebat edip panik yapmadan beklemeniz gerekebilir. İşte &amp;ccedil;alışma zamanı g&amp;ouml;r&amp;uuml;nt&amp;uuml;leri.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/06/08/credit_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Her şey yolunda giderse localhost:3000 adresinden aşağıdaki i&amp;ccedil;eriğe&amp;nbsp;ulaşabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/06/08/credit_2.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Uygulamanın Heroku Platformuna Alınması&lt;/h2&gt;
&lt;p&gt;&amp;Ouml;ncelikle Heroku &amp;uuml;zerinde bir uygulama oluşturmamız gerekiyor. Bunu aşağıdaki terminal komutuyla yapabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;heroku create&lt;/pre&gt;
&lt;p&gt;Bana proje adı olarak Heroku'nun otomatik olarak &amp;uuml;rettiği &lt;em&gt;frozen-hamlet-75426&lt;/em&gt;&amp;nbsp;denk geldi. Ayrıca uygulama kodlarını atabilmek i&amp;ccedil;in github ve ulaşacağım web adresi bilgisi de iletildi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/06/08/credit_3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulamanın web adresi https://frozen-hamlet-75426.herokuapp.com/ şeklinde. github adresi ise https://git.heroku.com/frozen-hamlet-75426.git.&amp;nbsp;Hatta sonu&amp;ccedil;ları Heroku Dashboard&amp;nbsp;&amp;uuml;zerinden de g&amp;ouml;rebiliriz&lt;em&gt;(Tabii siz &amp;ouml;rneği denerken g&amp;uuml;ncel hali Heroku &amp;uuml;zerinde olmayabilir. Kendiniz i&amp;ccedil;in bir tane yapsanız daha iyi olur)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/06/08/credit_4.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Uygulama klas&amp;ouml;r&amp;uuml;ndeki json dosyasında yer alan heroku-postbuild script'i bu aşamada &amp;ouml;nem kazanıyor. Kodlar git ortamına taşındıktan sonra bir build işlemi gerekiyor. Heroku bu script kısmını ele alıyor.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;"heroku-postbuild":"NPM_CONFIG_PRODUCTION=false npm install --prefix fromwestworld &amp;amp;&amp;amp; npm run build --prefix fromwestworld"&lt;/pre&gt;
&lt;p&gt;Bu d&amp;uuml;zenlemenin ardından yazılan kodların geliştirme ortamından github &amp;uuml;zerine atılması gerekiyor. Yani Heroku'nun kod deposu olarak github'ı kullandığını ifade edebiliriz. Aşağıdaki komutlarla devam edelim &amp;ouml;yleyse.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;heroku git:remote -a frozen-hamlet-75426
git add .
git commit -am 'Heroku React Express &amp;ouml;rneği eklendi'
git push heroku master&lt;/pre&gt;
&lt;p&gt;Yapılanları aşağıdaki gibi &amp;ouml;zetleyebiliriz.&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Heroku i&amp;ccedil;in git remote adresini belirle&lt;/li&gt;
&lt;li&gt;T&amp;uuml;m değişiklikleri stage'e al&lt;/li&gt;
&lt;li&gt;Değişiklikleri onayla&lt;em&gt;(commit)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;ve kodun son halini master branch'e push'la&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;Kodun github'a alınması aynı zamanda heroku'nun da ilgili uygulamayı gerekli build betiklerini &amp;ccedil;alıştırarak devreye alması anlamına gelmekte. Dolayısıyla bir s&amp;uuml;re sonra https://frozen-hamlet-75426.herokuapp.com/ adresine gitmek sonu&amp;ccedil;ları g&amp;ouml;rmemiz a&amp;ccedil;ısından yeterli olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/06/08/credit_5.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Bazı Hatalarım da Olmadı Değil&lt;/h2&gt;
&lt;p&gt;&amp;Ccedil;alışma sırasında bu basit hello-world uygulamasını tek seferde Heroku'ya taşıyamadığımı ifade etmek isterim. Eğer taşıma sırasında sorunlarla karşılaşırsanız bunları g&amp;ouml;rmek i&amp;ccedil;in terminalden&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;heroku logs --tail&lt;/pre&gt;
&lt;p&gt;komutunu kullanabilirsiniz. Yaşadığım sorunları ve &amp;ccedil;&amp;ouml;z&amp;uuml;mlerini aşağıdaki maddelerde bulabilirsiniz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;İlk hatam server.js dosyasında process.env.PORT yerine process.env.port kullanmış olmamdı. Heroku ortamı bu port'u anlamadığı i&amp;ccedil;in 5005 nolu porttan yayın yapmaya &amp;ccedil;alıştı ki bu m&amp;uuml;mk&amp;uuml;n değildi.&lt;/li&gt;
&lt;li&gt;İkinci hatam package.json i&amp;ccedil;erisinde ortam i&amp;ccedil;in gerekli node engine versiyonunu s&amp;ouml;ylememiş olmamdı. Nitekim Heroku tarafı node'un hangi s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; kullanacağını bilmek ister.&lt;/li&gt;
&lt;li&gt;Diğer problemse bağımlı olunan npm paketleri i&amp;ccedil;in package.json dosyasında dependencies yerine devDependencies sekt&amp;ouml;r&amp;uuml;n&amp;uuml; bırakmış olmamdı. &amp;Uuml;retim ortamı i&amp;ccedil;in dependencies kısmına bakılıyor.&lt;/li&gt;
&lt;li&gt;Ayrıca .gitignore dosyasını koymayıp node_modules ve package-log.json &amp;ouml;ğelerini hari&amp;ccedil; tutmadığım i&amp;ccedil;in bu klas&amp;ouml;rleri de komple push'lamış oldum&lt;em&gt;(Sonraki versiyonda d&amp;uuml;zelttim tabii)&lt;/em&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bu hususlara dikkat ettiğimiz takdirde &amp;uuml;r&amp;uuml;n&amp;uuml; başarılı bir şekilde yayına almış oluruz. Tabii uygulamanın şu an i&amp;ccedil;in yaptığı hi&amp;ccedil;bir şey yok. Oysa ki PostgreSQL kullanaraktan veri odaklı basit bir Hello World uygulaması pekala geliştirilebilir. Daha &amp;ouml;nceden sık&amp;ccedil;a dile getirdiğim &amp;uuml;zere bu kutsal g&amp;ouml;revi siz değerli okurlarıma bırakıyorum :)&lt;/p&gt;
&lt;h2&gt;Ben Neler &amp;Ouml;ğrendim?&lt;/h2&gt;
&lt;p&gt;Uzun s&amp;uuml;re sonra derlemek &amp;uuml;zere ele aldığım bu &amp;ccedil;alışmada Heroku &amp;uuml;zerine bir React uygulamasının nasıl alındığını hatırlayıp bilgilerimi tazeleme fırsatı buldum. Kabaca yaptıklarımın &amp;uuml;st&amp;uuml;nden ge&amp;ccedil;tikten sonra &amp;ouml;ğrendiklerimi aşağıdaki maddeler halinde ifade edebileceğimi d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Heroku'da hesap a&amp;ccedil;ma ve uygulama oluşturma adımlarını&lt;/li&gt;
&lt;li&gt;Heroku CLI&amp;nbsp;&amp;uuml;zerinden dağıtım işlemlerinin nasıl&amp;nbsp;yapıldığını&lt;/li&gt;
&lt;li&gt;Bir node sunucusu &amp;uuml;zerinden bir React uygulamasının ayağa kaldırılmasını&lt;/li&gt;
&lt;li&gt;En temel d&amp;uuml;zeyde&amp;nbsp;app react bileşeninin nerede nasıl kullanıldığını&lt;/li&gt;
&lt;li&gt;Deployment sırasında veya &amp;ccedil;alışma zamanındaki hatalara ait loglara nasıl bakıldığını&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir &lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;cumartesi gecesi derlemesi&lt;/a&gt;nin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2019-10-04 13:00:00</pubDate>
  <slug>bu-sefer-bir-react-uygulamasini-heroku-uzerine-alalim</slug>
  <tags>
    <tag>react</tag>
    <tag>node</tag>
    <tag>nodejs</tag>
    <tag>heroku</tag>
    <tag>paas</tag>
    <tag>platform-as-a-service</tag>
    <tag>cloud-services</tag>
    <tag>deployment</tag>
    <tag>npm</tag>
    <tag>express</tag>
    <tag>nodemon</tag>
    <tag>concurrently</tag>
  </tags>
  <categories>
    <category>React</category>
  </categories>
</post>