<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>GoLang - Slice ve Map Kavramları</title>
  <description>Gopher olma çalışmalarına veri türlerini tanıyarak devam ediyorum. Geçtiğimiz günlerde Slice ve Maps veri türlerini anlamaya çalıştım. Her ikisi de sağladıkları esneklikler açısından kullanışlı. Şimdi gelin kısaca bu türleri tanıyalım.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/01/gobanana.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Gopher olma &amp;ccedil;alışmalarım iş yoğunluğuna bağlı olarak zaman zaman hızlı ve zaman zaman da yavaş bir şekilde devam ediyor. A&amp;ccedil;ık&amp;ccedil;ası Gopher karakterini ve internetteki &amp;ouml;rneklerini &amp;ccedil;ok sevdim. Google olduk&amp;ccedil;a sevimli bir logo yaratmış. Bu nedenle her b&amp;ouml;l&amp;uuml;m m&amp;uuml;mk&amp;uuml;n mertebe farklı bir Gopher'ı ekranlarınıza taşımaya &amp;ccedil;alışıyorum.&lt;/p&gt;
&lt;p&gt;Efendim gelelim sadede. Go dilinde kullanılan t&amp;uuml;rlerden olan Array tipini kısaca inceledikten sonra ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde Slice ve Map kavramlarını da incelemeye başladım. Her ikisi de sağladıkları esneklikler a&amp;ccedil;ısından dil i&amp;ccedil;erisinde olduk&amp;ccedil;a &amp;ouml;nemli bir yere sahipler. Bu makalemizde ilgili veri tiplerini&amp;nbsp;basit &amp;ouml;rnekler &amp;uuml;zerinden tanıma gayretinde olacağız.&lt;/p&gt;
&lt;h2&gt;Slice&lt;/h2&gt;
&lt;p&gt;Diziler(Arrays) pek &amp;ccedil;ok programlama dilinde olduğu gibi Go i&amp;ccedil;in de vazge&amp;ccedil;ilmez veri t&amp;uuml;rlerinden birisi. Lakin esnek olmadığı noktalar da vardır. &amp;Ouml;rneğin diziler sabit uzunluktadır ve boyutları yeni ilaveler ile dinamik olarak genişletilemez. İşin aslı dizi dediğimiz kavram sabit uzunlukta, belirli t&amp;uuml;rde, indisle erişilen ve sıralanmış bir veri yapısını işaret eder. Diğer yandan slice veri t&amp;uuml;r&amp;uuml; daha esnek bir kullanım alanı sunar. Hatta dizilerin belli aralıktaki par&amp;ccedil;alarını birer slice haline getirip kullanabiliriz. Go dilinde ustalaşanlar dizi değişkenleri yerine slice t&amp;uuml;r&amp;uuml; ile &amp;ccedil;alışmayı tercih etmektedirler. Tanımlanan bir slice eleman sayısı ve kapasite ile birlikte oluşturulabilir. append fonksiyonu yardımıyla yeni elemanlar eklenebilir, copy fonksiyonu ile bir slice i&amp;ccedil;eriğinin bir diğerine kopyalanması sağlanabilir. Esas itibariyle bir slice aşağıdaki basit şekil ile ifade edilebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/slice_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tanımlanan bir slice değişkeni i&amp;ccedil;erisinde belli t&amp;uuml;rden elemanlar barındıran diziyi işaret eden bir pointer, bu dizinin uzunluğu ve kapasitesi yer alır. Yukarıdaki şekilde 5 adet integer eleman i&amp;ccedil;eren maksimum kapasitesi de 10 olan numbers isimli bir slice tanımının bellekteki farazi g&amp;ouml;sterimi yer almaktadır.&lt;/p&gt;
&lt;p&gt;Bir slice'dan vereceğimiz değer aralığına g&amp;ouml;re başka bir slice da oluşturabiliriz. Ancak burada dikkat edilmesi gereken &amp;ouml;nemli bir husus vardır. Oluşan yeni slice alt k&amp;uuml;mesi olduğu slice i&amp;ccedil;erisindeki dizi elemanlarını işaret eder. Bunun anlamını biliyorsunuz. Yeni oluşan slice elemanlarında yapılacak olan değişiklikler alt k&amp;uuml;mesi olduğu slice i&amp;ccedil;in de ge&amp;ccedil;erli olacaktır. Aşağıdaki şekilde bu durum &amp;ouml;zetlemektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/slice_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi basit bir kod par&amp;ccedil;ası ile slice tipini nasıl kullanabileceğimize bakalım.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:groovy;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	"math"
	)
	
func main(){
	words:=[]string{"red","plane","colors","car"}
	fmt.Println(words)
	fmt.Println(words[1])
	
	var sumBytes []int // Slice tanimi
	sumBytes=make([]int,4,10) // 4 eleman icerek sekilde slice'in kurgulanmasi
	fmt.Printf("Length=%d,Capacity=%d\n",len(sumBytes),cap(sumBytes))
	fmt.Println(sumBytes)
	for i:=0;i&amp;lt;cap(sumBytes);i++{
		if i&amp;gt;=len(sumBytes){
			sumBytes=append(sumBytes,i*3)
			}else{
				sumBytes[i]=i*2
				}
	}
	fmt.Println(sumBytes)
	
	// slice'dan slice alinmasi halinde ortak degiskenlerin durumu
	subSumBytes:=sumBytes[3:6]
	subSumBytes[0]=-1
	subSumBytes[1]=-1
	subSumBytes[2]=-1
	fmt.Println(sumBytes)
	fmt.Println(subSumBytes)
	
	// diziden slice cikartmalar
	points:=[6]int{3,5,6,-4,-18,20}	 // 6 elemanli array alttaki birkac slice icin kullanilacak
	subPoints1:=points[0:3]
	fmt.Println(subPoints1)	
	subPoints2:=points[3:len(points)]
	fmt.Println(subPoints2)
	subPoints3:=points[:]
	fmt.Println(subPoints3)
	subPoints4:=points[4:]
	fmt.Println(subPoints4)
	
	// append
	newSlice:=make([]float32,5,10) // 5 elemanli ve max 10 kapasiteli slice tanimi
	newSlice[0]=1.32	
	newSlice=append(newSlice,math.Pi,2.277) // Slice'in sonuna eleman ekledi
	fmt.Println(newSlice)
	
	// Copy
	newSlice1:=[]int{3,5,1,7,8} // 5 elemanli ve kapasiteli bir slice
	newSlice2:=make([]int,3) // 3 elemanli ve kapasiteli bir slice
	copy(newSlice2,newSlice1)
	fmt.Println(newSlice1)
	fmt.Println(newSlice2)
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;ncelikle kodun &amp;ccedil;alışma zamanı &amp;ccedil;ıktısına bir bakalım ve i&amp;ccedil;eriği &amp;uuml;zerinden konuşalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/slice_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak en basit haliyle words isimli bir slice tanımlayarak başlıyoruz. Eleman sayısını belirtmediğimiz bu slice'ın i&amp;ccedil;ereceği string değerleri ilk ifadede atamaktayız. Sonrasında t&amp;uuml;m ve sadece 1nci indisteki elamanları ekrana yazdırıyoruz. Bir başka deyişle aynı dizilerde olduğu gibi slice elemanlarına da indis operat&amp;ouml;r&amp;uuml; ile erişebiliyoruz.&lt;/p&gt;
&lt;p&gt;sumBytes integer değerler taşıyacak bir slice. İlk satırda eleman sayısını vermeden tanımlıyor sonraki satırda make fonksiyonunu kullanarak oluşturuyoruz. Bunu programın başında tanımlı bir slice değişkeninin ilerleyen kısımlarda oluşturabileceği manasında yorumlayabiliriz. sumBytes 4 eleman i&amp;ccedil;erecek şekilde ve 10 birim kapasiteye sahip olacak şekilde tanımlanmış durumda. Slice kapasitesi ve uzunluğunu bulmak i&amp;ccedil;in cap ve len isimli fonksiyonlardan yararlanıyoruz. sumBytes elemanlarını ekrana yazdırdığımızda sadece 4 adet 0dan oluşan bir dizi ile karşılaşmaktayız ki bu son derece doğaldır.&lt;/p&gt;
&lt;p&gt;Sonrasında gelen for d&amp;ouml;ng&amp;uuml;s&amp;uuml; ise dikkate değer. Burada ilk 4 elemana indisin iki katını işaret eden sayılar ekliyoruz. Ancak i elemanı belirtilen uzunluktan fazla ise append fonksiyonuna başvuruyoruz. Neden? sumBytes i&amp;ccedil;in belirlediğimiz eleman uzunluğu 4. Kapasite ise 10. Buna g&amp;ouml;re &amp;ouml;rneğin 5nci elemana bir değer atamak istersek &amp;ccedil;alışma zamanında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi "index out of range" hatasını alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/slice_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu y&amp;uuml;zden append fonksiyonundan&amp;nbsp;yararlanmaktayız.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;subSumBytes ise sumBytes'ın bir alt k&amp;uuml;mesi gibi d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Bu da bir slice değişkenidir ve aslında sumBytes'ın 3nc&amp;uuml; indisinden itibaren 4nc&amp;uuml; ve 5nci dahil olmak &amp;uuml;zere 6ncı indisine kadar olan elemanları işaret etmektedir. Dikkat edilmesi gereken nokta subSumBytes elemanlarında yapılan değişikliklerin doğal olarak sumBytes'ı da etkilemiş olmasıdır&lt;em&gt;(-1 atamalarına dikkat edelim)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;points bir array olarak tanımlanmıştır. Eleman sayısı belirli ve dizi uzunluğu sabittir. subPoints1,2,3 ve 4 bir diziden nasıl par&amp;ccedil;a alınabileceğinin bir ka&amp;ccedil; &amp;ouml;rneğini barındırmaktadır. : işaretinin sol ve sağ tarafındaki girdilere g&amp;ouml;re dizinin belli bir par&amp;ccedil;asının veya tamamının&lt;em&gt;([:] kullanımı)&lt;/em&gt;&amp;nbsp;slice olarak elde edilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;newSlice değişkeninde append fonksiyonunun kullanımı bir kez daha &amp;ouml;rneklenmiştir. 5 eleman uzunluğunda bir tanımlama yapıldığından append fonksiyonu 5nci&amp;nbsp;indisteki eleman olarak dizideki yerini alacaktır. Bu nedenle&amp;nbsp;[1.32 0 0 0 0 &lt;strong&gt;3.1415927&lt;/strong&gt; 2.277] şeklinde bir sonu&amp;ccedil; oluşmaktadır.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek kodun son satırlarında bir slice i&amp;ccedil;eriğinin(newSlice1) bir diğerine(newSlice2) kopyalanması işlemine yer verilmiştir. Burada kapasite ve eleman sayısı 5 olan bir slice'ın, 3 elemen ve kapasiteli bir slice'a kopyalanması s&amp;ouml;z konusudur. &amp;Ccedil;ok doğal olarak bir trim işlemi ger&amp;ccedil;ekleşir ve newSlice1'in sadece ilk 3 elemanı newSlice2'ye kopyalanır.&amp;nbsp;&lt;/p&gt;
&lt;h2&gt;Map&lt;/h2&gt;
&lt;p&gt;Gelelim bir diğer konumuz olan map veri t&amp;uuml;r&amp;uuml;ne. Bu veri t&amp;uuml;r&amp;uuml;n&amp;uuml; key-value &amp;ccedil;iftleri şeklinde elemanlar barındıran bir veri yapısı olarak d&amp;uuml;ş&amp;uuml;nebiliriz&lt;em&gt;(Aslında Hash veri yapısının Go dilindeki built-in karşılığıdır)&amp;nbsp;&lt;/em&gt;map veri yapısı da aynen slice ve array gibi referans t&amp;uuml;rl&amp;uuml;d&amp;uuml;r. Aynen slice kullanımında olduğu gibi make fonksiyonu ile de oluşturulabilir yada tek ifade ile elemanları atanabilir. Bir map kendisinde&amp;nbsp;key-value &amp;ccedil;iftleri eklendik&amp;ccedil;e otomatik olarak b&amp;uuml;y&amp;uuml;r. map'lere eklenen şekilde bir sırlama da oluşmaz. Yani bir map i&amp;ccedil;eriğini dolaştığımızda elemanlarını eklediğimiz sırada bulamayabiliriz.&lt;/p&gt;
&lt;p&gt;key olarak tutulan veri t&amp;uuml;r&amp;uuml;n&amp;uuml;n karşılaştırılabilir&lt;em&gt;(comparable)&lt;/em&gt; olması gerekir&lt;em&gt;(.net tarafında olsak IComparable gibi aray&amp;uuml;zleri implemente eden t&amp;uuml;rleri key olarak kullanabiliriz gibi bir c&amp;uuml;mleyi sarfedebilirdim lakin Go'da bu durum nasıl ele alınıyor hen&amp;uuml;z bilmiyorum. İlk okuduğum yazılara g&amp;ouml;re temel veri t&amp;uuml;rlerinin key olarak kullanılabileceği y&amp;ouml;n&amp;uuml;nde)&lt;/em&gt; map t&amp;uuml;r&amp;uuml; Concurrent kullanımlar i&amp;ccedil;in g&amp;uuml;venli&lt;em&gt;(safe)&lt;/em&gt; değildir bu nedenle okuma ve yazma adımlarının senkronizasyonu i&amp;ccedil;in sync.RWMutex gibi fonksiyonlardan yararlanılır&lt;em&gt;(Go dilinde Concurrent programlama konusuna ilerleyen zamanlarda bakmaya &amp;ccedil;alışacağım)&lt;/em&gt; Şimdi basit &amp;ouml;rnekler ile map t&amp;uuml;r&amp;uuml;n&amp;uuml;n kullanımına bir bakalım.&lt;/p&gt;
&lt;pre class="brush:groovy;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	)
	
func main(){
	var words map[string]string
	words=make(map[string]string) // map'i kullanabilmek icin make ile olusturmamiz gerekir.Yoksa calisma zamaninda hata aliriz
	
	words["red"]="rot"
	words["black"]="schwarz"
	words["blue"]="blau"
	words["green"]="grun"
	
	fmt.Println(words)
	fmt.Println(words["blue"])
	fmt.Println(words["empty"])
	
	// bir key degerinin map icinde olup olmadigini anlamak icin asagidaki ifadeyi kullanabiliriz
	_, isExist:=words["empty"]
	fmt.Println("words[empty] is exist = ",isExist)
	
	for key,value:=range words{
		fmt.Printf("key:%s\tvalue:%s\n",key,value)
	}
	
	// Bir map'i asagidaki gibi ayni ifadede tanimlayip elemanlarini belirleyebiliriz
	levels:=map[int]string{
		100 : "Beginners",
		200 : "Intermediate",
		300 : "Amateur",
		400 : "Pro",
		500 : "Master",
		0 : "unknown",		
	}
	WriteMapToConsole(levels)
	// map'ten eleman silmek icin delete kullanabiliriz
	fmt.Println("deleting 0")
	delete(levels,0)
	WriteMapToConsole(levels)
}

func WriteMapToConsole(m map[int]string){
	for k,v:=range m{
		fmt.Printf("key:%d -&amp;gt; value:%s\n",k,v)
	}
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gomaps_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;words isimli map değişkeni string tipinden key ve value değerleri taşıyacak şekilde tanımlanıyor. İlk satırda bir tanımlama yapıyoruz ve sonrasında make metodu ile map değişkenini oluşturuyoruz. Bu şekilde yaptığımız bir map tanımından sonra make komutunu kullanmadan eleman eklemeye kalkarsak &amp;ccedil;alışma zamanı hatası alırız&lt;em&gt;(Panic :) )&lt;/em&gt;. words isimli map'e bir ka&amp;ccedil; key:value &amp;ccedil;ifti ekliyor ve ekrana yazdırıyoruz. Olmayan bir eleman talep edildiğinde&lt;em&gt;(words["empty"] gibi)&lt;/em&gt; geriye value'nun tipinin varsayılan değeri d&amp;ouml;necektir. Dilersek _,isExist satırında olduğu ilgili key değerinin map i&amp;ccedil;erisinde bulunup bulunmadığını kontrol ederek de ilerleyebiliriz. Bu kontrol sırasında gereksiz yere değişken ataması da yapmamış oluruz. Bir map i&amp;ccedil;erisinde d&amp;ouml;nmek olduk&amp;ccedil;a basittir. for d&amp;ouml;ng&amp;uuml;s&amp;uuml;nde key,value değerlerine birlikte erişme şansına sahibiz. Anahtar kelimemiz tahmin edileceği &amp;uuml;zere range. levels isimli map değişkenini tek bir ifade i&amp;ccedil;erisinde hem tanımlıyor hem de elemanlarını atıyoruz. Bir map serisinden&amp;nbsp;eleman silmek i&amp;ccedil;in delete fonksiyonundan yararlanabiliriz.&lt;/p&gt;
&lt;p&gt;map'ler ile ilgili enteresan konulardan birisi de value i&amp;ccedil;erisinde de map'ler barındırılabileceği. Aşağıda bu durumu anlatan &amp;ouml;rnek bir kod par&amp;ccedil;asına yer veriliyor.&lt;/p&gt;
&lt;pre class="brush:groovy;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"fmt"
	)
	
func main(){
	css:=map[string]map[string]string{
		"table" : map[string]string{
			"fontColor" : "white",
			"backgrounColod" : "blue",
		},
		"button" : map[string]string{
			"fontName" : "tahoma",
			"fonsSize" : "24",
			"fontColor" : "red",
			"backColor" : "black",
		},
	}
	
	for k,v:=range css{
		fmt.Println(k)
		for sk,sv:=range v{
			fmt.Printf("\t%s:%s\n",sk,sv)
		}
	}
}&lt;/pre&gt;
&lt;p&gt;css isimli map'in value değerleri birer map olarak tanımlanmıştır. Buna g&amp;ouml;re her bir key'e karşılık string tipinden key:value &amp;ccedil;iftleri taşıyan map'ler s&amp;ouml;z konusudur. T&amp;uuml;m map i&amp;ccedil;eriğini i&amp;ccedil;i&amp;ccedil;e for d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile dolaşmamız da m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. İ&amp;ccedil;teki for d&amp;ouml;ng&amp;uuml;s&amp;uuml; dıştaki value tipini ele alacak şekilde ileri y&amp;ouml;nl&amp;uuml; bir iterasyonu başlatabilir. Kodun &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı ise aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/01/gomaps_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Gopher olma &amp;ccedil;alışmalarımızla ilgili olarak bu yazımızda slice ve map kavramlarına değinmeye &amp;ccedil;alıştık. Bir başka makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-03-02 21:23:00</pubDate>
  <slug>golang-slice-ve-maps-kavramlari</slug>
  <tags>
    <tag>golang</tag>
    <tag>go</tag>
    <tag>slice</tag>
    <tag>append</tag>
    <tag>capacity</tag>
    <tag>copy</tag>
    <tag>len</tag>
    <tag>map</tag>
    <tag>array</tag>
  </tags>
  <categories>
    <category>GoLang</category>
  </categories>
</post>