<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Tek Fotoluk İpucu 157 - GO ile Bir Queue Yazalım mı?</title>
  <description>Go programlama dilinde C#,Java veya bunlara benzer dillerden gelenler için söz konusu olan pek çok kolaylık bulunmayabilir. Söz gelimi Stack veya Queue gibi bir koleksiyon kullanmak istersek bu veri yapısını bizim tasarlamamız gerekebilir. Nitekim bu adresteki standart kütüphanelerde Queue ile ilgili bir şey bulamadığımı ifade edebilirim(aslında github üzerinde açık kaynak ek kütüphaneler var) Olsa da olmasa da biz kendimiz de bir queue veri yapısı tasarlayabiliriz. Aynen aşağıdaki fotoğrafta olduğu gibi.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Go programlama dilinde C#,Java veya benzer dillerden gelenler i&amp;ccedil;in s&amp;ouml;z konusu olan pek &amp;ccedil;ok kolaylık bulunmayabilir. S&amp;ouml;z gelimi Stack veya Queue gibi bir koleksiyon kullanmak istersek baştan tasarlamamız gerekebilir. Nitekim &lt;a href="https://golang.org/pkg/" target="_blank"&gt;bu adresteki&lt;/a&gt; standart k&amp;uuml;t&amp;uuml;phanelerde Queue ile ilgili bir şey bulamadığımı ifade edebilirim&lt;em&gt;(aslında github &amp;uuml;zerinde a&amp;ccedil;ık kaynak ek k&amp;uuml;t&amp;uuml;phaneler var)&lt;/em&gt;&amp;nbsp;Olsa da olmasa da bir queue veri yapısı&amp;nbsp;tasarlayabiliriz. Hem basit ve temel bir antrenman yapmış oluruz. Aynen aşağıdaki fotoğrafta olduğu gibi&lt;em&gt;(Sisteminizde benim şirket bilgisayarımda olduğu gibi GO ortamı var olmayabilir.&amp;nbsp;&lt;a href="https://play.golang.org/"&gt;https://play.golang.org/&lt;/a&gt;&amp;nbsp;adresindeki online derleyiciyi bu anlamda kullanabilirsiniz)&lt;/em&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/05/tfi157.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Queue veri yapısı bilindiği &amp;uuml;zere FIFO&lt;em&gt;(First In First Out)&lt;/em&gt; ilkesine g&amp;ouml;re &amp;ccedil;alışır. Yani eklediğimiz ilk eleman ilk olarak elde edilir. Burada standartlaşmış iki fonksiyon s&amp;ouml;z konusudur. Enqueue ve Dequeue. Enqueue ile eleman eklenmesi, Dequeue ile de ilk eklenen elemanın elde edilmesi ve aynı zamanda veri yapısından &amp;ccedil;ıkartılması işlemleri ger&amp;ccedil;ekleştirilir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek kod par&amp;ccedil;asında işleri kolaylaştırmak adına slice tipinden yararlanılmıştır. &amp;Ccedil;&amp;uuml;nk&amp;uuml; bu tip sahip olduğu fonksiyonellikler sayesinden otomatik olarak genişleyebilir. En azından bu kolaylığı kullanalım değil mi?&lt;/p&gt;
&lt;p&gt;Kodda ilk olarak bir struct tanımı olduğu g&amp;ouml;r&amp;uuml;lmektedir. MyQueue isimli struct i&amp;ccedil;erisinde ise string tipinden bir Slice tanımlanmıştır. Tahmin edileceği &amp;uuml;zere kuyruk string veri tipi ile &amp;ccedil;alışacak şekilde tasarlanmıştır ancak siz istediğiniz bir tipi kullanabilirsiniz.&amp;nbsp;Enqueue operasyonunda&amp;nbsp;yaptığımız tek şey append fonksiyonundan yararlanarak parametre olarak gelen &amp;ouml;ğeyi items listesine eklemektir. Tabii son eleman olarak eklenecektir. Enqueue,&amp;nbsp;MyQueue nesnesinin adresini geriye d&amp;ouml;nd&amp;uuml;rmektedir. Yani&amp;nbsp;ilgili fonksiyonlar her zaman oluşturulan MyQueue &amp;uuml;zerinde &amp;ccedil;alıştırılacaktır.&lt;/p&gt;
&lt;p&gt;Dequeue fonksiyonunda slice i&amp;ccedil;erisindeki ilk eleman&lt;em&gt;(0 indisli olan)&lt;/em&gt; yakalanır. Sonrasında slice'ın 1nci indisinden itibaren kalan kısmı kendi &amp;uuml;zerine tekrardan atanır. Dolayısıyla&amp;nbsp;Dequeue fonksiyonu&amp;nbsp;hem ilk giren elemanın d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesini hem de ilk eleman sonrasında kalanların var olan slice'a&amp;nbsp;atanmasını&amp;nbsp;sağlar.&amp;nbsp;MyQueue isimli struct i&amp;ccedil;erisindeki &amp;ouml;ğelerin ekrana d&amp;uuml;zg&amp;uuml;n basılması i&amp;ccedil;in&amp;nbsp;Println'in i&amp;ccedil;inde kullandığı&amp;nbsp;String fonksiyonunun yeniden yazılması&amp;nbsp;yeterlidir. Bu sayede ekrana daha d&amp;uuml;zg&amp;uuml;n bir formatta i&amp;ccedil;erik basılabilir.&lt;/p&gt;
&lt;p&gt;Pek &amp;ccedil;oğunuzun MyQueue&amp;lt;T&amp;gt; gibi generic bir struct tipi olsa elimizde de kullansak dediğinizi duyar gibiyim. Bunu ger&amp;ccedil;ekleştirmemiz şu anda m&amp;uuml;mk&amp;uuml;n değil gibi g&amp;ouml;r&amp;uuml;nse de interface'leri kullanarak en azından tip g&amp;uuml;venli bir veri yapısı&amp;nbsp;oluşturabiliriz. Bunu denemenizi ve hatta Stack şeklinde&lt;em&gt;(LIFO-Last In First Out)&lt;/em&gt; bir koleksiyon tipi oluşturmaya &amp;ccedil;alışmanızı &amp;ouml;nerebilirim.&amp;nbsp;Kodda bazı tuzaklarda yer alıyor. &amp;Ouml;rneğin&amp;nbsp;t&amp;uuml;m elemanları &amp;ccedil;ektikten sonra index out of range gibi bir hataya d&amp;uuml;şme olasılığınız y&amp;uuml;ksek.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/05/tfi157_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bunu &amp;ccedil;&amp;ouml;zmeyi deneyin.&lt;/p&gt;
&lt;p&gt;Bir başka ipucunda g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-05-04 10:10:00</pubDate>
  <slug>tek-fotoluk-ipucu-157-go-ile-bir-queue-yazalim-mi</slug>
  <tags>
    <tag>queue</tag>
    <tag>golang</tag>
    <tag>go-programming-language</tag>
    <tag>struct</tag>
    <tag>pointer</tag>
    <tag>data-structures</tag>
    <tag>algorithms</tag>
    <tag>type</tag>
  </tags>
  <categories>
    <category>GoLang</category>
  </categories>
</post>