<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>İlişkiler ve Hesaplanmış Alanların Bir Arada Kulllanılması</title>
  <description>Bu makalemizde aralarında bire-çok (one-to-many) ilişki olan tablolar için hesaplanmış alanların, (yani DataColumn sınıfının Expression özelliği ile oluşturduğumuz sütunların) tablolar arasındaki ilişkiler ile nasıl bir arada kullanılabileceğini incelemeye çalışacağız. Burada bir arada kullanımdan kastım, örnek olarak; ebevyn (parent) tabloda fiziki olarak var olmayan ancak uygulamanın çalışması sırasında oluşturulacak bir sütundan, detay tablosundaki ilişkili alanlar üzerinden toplam, ortalama, miktar gibi Aggregate ifadelerinin çalıştırılmasından ve sonuçların yine parent tabloya yansıtılmasından bahsediyorum.</description>
  <content>&lt;p&gt;Değerli&amp;nbsp;Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde aralarında bire-&amp;ccedil;ok (one-to-many) ilişki olan tablolar i&amp;ccedil;in hesaplanmış alanların, (yani DataColumn sınıfının Expression &amp;ouml;zelliği ile oluşturduğumuz s&amp;uuml;tunların) tablolar arasındaki ilişkiler ile nasıl bir arada kullanılabileceğini incelemeye &amp;ccedil;alışacağız. Burada bir arada kullanımdan kastım, &amp;ouml;rnek olarak; ebevyn (parent) tabloda fiziki olarak var olmayan ancak uygulamanın &amp;ccedil;alışması sırasında oluşturulacak bir s&amp;uuml;tundan, detay tablosundaki ilişkili alanlar &amp;uuml;zerinden toplam, ortalama, miktar gibi Aggregate ifadelerinin &amp;ccedil;alıştırılmasından ve sonu&amp;ccedil;ların yine parent tabloya yansıtılmasından bahsediyorum.&lt;/p&gt;
&lt;p&gt;Konumuzun ana problemini daha iyi anlamak i&amp;ccedil;in şu &amp;ouml;rneği g&amp;ouml;z &amp;ouml;n&amp;uuml;nde bulunduralım. Internet &amp;uuml;zerinden ticaret yapan sitemizde kullanıcıların temel bilgileri ile, vermiş oldukları sipariş bilgilerinin ayrı iki tabloda tutulduğunu ve bu tablolar arasında bire-&amp;ccedil;ok ilişki olduğunu varsayalım. Kendimize ait y&amp;ouml;netici ekranlarında, her bir &amp;uuml;ye i&amp;ccedil;in, bu g&amp;uuml;ne kadar vermiş olduğu siparişlerin toplam sayısını ve bu siparişlerin hepsine &amp;ouml;demiş olduğu toplam tutarları anlık olarak g&amp;ouml;rmek istediğimizi varsayalım. Burada bize, ebevyn tabloda bir hesaplanmış alan gerekmektedir. Ancak hesaplanmış alan değerleri, detay tablosundaki veriler &amp;uuml;zerinden ger&amp;ccedil;ekleştirilmek zorundadır. İşte bu noktada devreye iki tablo arasında tanımlamış olduğumuz bire-&amp;ccedil;ok ilişki girer.&lt;/p&gt;
&lt;p&gt;Problemi ve ne yapmak istediğimizi kısaca anlattıktan sonra dilerseniz bunu ger&amp;ccedil;ek bir uygulama &amp;uuml;zerinde incelemeye başlayalım. Bu uygulamada, web sitesi &amp;uuml;yeleri i&amp;ccedil;in tasarlanmış olan Uyeler tablosu ve bu &amp;uuml;yelerin satın alım bilgilerini tutan Siparisler isimli tablolara bir windows uygulaması &amp;uuml;zerinden erişmek istediğimizi varsayalım. Tablolarımızın sahip olacağı alanlar ve aralarındaki ilişki aşağıdaki şekilde yer almaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk63_1.gif" alt="" width="405" height="123" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 1. Tablolarımızın Yapısı ve Aralarındaki Bire-&amp;Ccedil;ok İlişki.&lt;/p&gt;
&lt;p&gt;Bu iki tabloyu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda, bir &amp;uuml;yeye ait birden fazla siparişin olabileceğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Uygulamamız bittiğinde, DataGrid nesnemizde, her bir &amp;uuml;yenin bu g&amp;uuml;ne kadar vermiş olduğu siparişlerin toplam sayısını ve &amp;ouml;demiş olduğu toplam miktarları g&amp;ouml;sterecek iki yeni s&amp;uuml;tunumuz olucak. Hi&amp;ccedil; vakit kaybetmeden uygulamamızın kodlarını yazmaya başlayalım. &amp;Ouml;nce, aşağıdaki gibi bir Form tasarlayalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk63_2.gif" alt="" width="355" height="268" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 2. Form Tasarımımız.&lt;/p&gt;
&lt;p&gt;Uygulamamızın kodlarına gelince.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection con;
SqlDataAdapter da;
DataTable dtUyeler;
DataTable dtSiparisleri;
DataSet ds;

private void btnGetir_Click(object sender, System.EventArgs e)
{
    /* Sql sunucumuza olan bağlantımız oluşturuluyor. */
    con=new SqlConnection("data source=localhost;initial catalog=Friends;integrated security=SSPI");

    ds=new DataSet(); /* DataSet nesnemiz oluşturuluyor. */

    /* &amp;Ouml;nce, Uyeler tablomuzdaki verileri alıyor , dtUyeler DataTable'ına y&amp;uuml;kl&amp;uuml;yor ve oluşan veri k&amp;uuml;mesini temsil eden bu DataTable nesnesinide DataSet nesnemizin tables koleksiyonuna ekliyoruz.*/
    da=new SqlDataAdapter("Select * From Uyeler",con); 
    dtUyeler=new DataTable();
    da.Fill(dtUyeler);
    ds.Tables.Add(dtUyeler);

    /* Aynı işlemi Siparisleri tablosu i&amp;ccedil;in yapıyoruz.*/
    da=new SqlDataAdapter("Select * From Siparisleri",con);
    dtSiparisleri=new DataTable();
    da.Fill(dtSiparisleri);
    ds.Tables.Add(dtSiparisleri); 

    /* Uyeler tablosundan Siparisleri tablosuna olan (dolayısıyla dtUyeler DataTable nesnesinin bellekte işaret ettiği b&amp;ouml;lgedeki veri satırlarından, dtSiparisleri dataTable nesnesinin bellekte temsil ettiği b&amp;ouml;lgedeki veri k&amp;uuml;mesine olan) bire-&amp;ccedil;ok ilişkiyi tanımlıyoruz. */
    ds.Relations.Add("Uyeler_Siparisleri",dtUyeler.Columns["UyeID"],dtSiparisleri.Columns["UyeID"],false);
    
    dtSiparisleri.Columns.Add("ToplamTutar",typeof(Decimal),"Miktar*BirimFiyat");/* Bu satır ile, dtSiparisleri tablomuzda, her bir satır i&amp;ccedil;in Miktar ve BirimFiyat alanlarının değerlerini &amp;ccedil;arpıyoruz. &amp;Ccedil;ıkan sonu&amp;ccedil;ları ToplamTutar isimli yeni tanımladığımız bir alana i&amp;ccedil;inde tutacak şekilde dtSiparisler DataTable nesnesinin Columns koleksiyonuna ekliyoruz. */
    
    dtUyeler.Columns.Add("Siparis Sayisi",typeof(int),"COUNT(Child.UyeID)");/* Burada ise, dtUyeler tablosunda Siparis Sayisi isimli yeni bir alan oluşturuyoruz. Bu alan, ilişkili tablo olan detay tablosundaki UyeId alanlarının sayısını COUNT ile hesaplıyor. Ancak bunu yaparken Child nesnesini kullanıyor. Nitekim burada Child nesnesi, Uyeler tablosundaki her bir uyenin, Siparisleri tablosunda karşılık gelen satırlarını temsil ediyor. */
    
    dtUyeler.Columns.Add("Toplam &amp;Ouml;deme",typeof(Decimal),"SUM(Child.ToplamTutar)");/* Burada ise, Child nesnesini kullanarak, var olan ilişki &amp;uuml;zerinden, Siparisleri tablosuna gidiyor ve her bir &amp;uuml;ye i&amp;ccedil;in, az &amp;ouml;nce hesapladığımız ToplamTutar alanlarının toplamını SUM aggregate fonksiyonu ile hesaplıyoruz. Sonu&amp;ccedil;larını ise, Toplam &amp;Ouml;deme isimli yeni bir alan olarak Uyeler tablomuza ekliyoruz.*/

    dgUyeler.DataSource=ds.Tables[0];
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızda Child isimli nesneyi nasıl kullandığımıza ve bu sayede, iki tablo arasındaki ilişki yardımıyla, child tablodaki veriler &amp;uuml;zerindeki hesaplamaları bir b&amp;uuml;t&amp;uuml;n halinde, parent tabloya hesaplanmış alan olarak nasıl eklediğimize l&amp;uuml;tfen dikkat ediniz. Uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdaki sonucu elde ederiz. G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi her bir &amp;uuml;ye i&amp;ccedil;in, yapılmış olan toplam siparis sayısına ve &amp;ouml;demiş oldukları toplam miktarlara ulaşabildik.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk63_3.gif" alt="" width="544" height="272" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 3. Uygulamanın &amp;Ccedil;alışmasının Sonucu.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-04-08 12:00:00</pubDate>
  <slug>Iliskiler-ve-Hesaplanmc4b1s-Alanlarc4b1n-Bir-Arada-Kulllanc4b1lmasc4b1-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>sql</tag>
    <tag>dataset</tag>
    <tag>calculated</tag>
    <tag>c#</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>