<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Barrier Class, Sıralama Algoritmaları ve At Yarışı</title>
  <description>Durumu daha iyi analiz edebilmek için dilerseniz basit bir senaryo üzerinden ilerlemeye çalışalım. Malumunuz günümüz üniversitelerinde özellikle algoritma derslerinde en çok sorulan, okutulan, ezberletilen konuların başında sıralama teknikleri gelmektedir. Bubble Sort, Quick Sort, Insertion Sort vb…</description>
  <content>&lt;p&gt;&lt;a href="/pics/The%20starting%20gate.jpg"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; float: right; padding-top: 0px; border: 0px;" title="The starting gate" src="/pics/The%20starting%20gate_thumb.jpg" alt="The starting gate" width="240" height="160" align="right" border="0" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;At yarışlarına pek ilgim yoktur aslında ama tam da bu g&amp;uuml;nlerde okuduğum kitap nedeniyle, paralel programlama ile aralarında sıkı bir ilişki olduğunu ifade edebilirim &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_70.png" alt="G&amp;ouml;z kırpan g&amp;uuml;l&amp;uuml;mseme" /&gt;&amp;nbsp; Bildiğiniz &amp;uuml;zere bu yarışların pek &amp;ccedil;ok meraklısı bulunmaktadır. &amp;Ouml;zellikle yarışları stadyumdan seyredenler olduk&amp;ccedil;a heyecanlıdır. Ger&amp;ccedil;i yarışın başlamasından &amp;ouml;nceki tahminler tam başlangı&amp;ccedil; anında yerini endişeye bırakır. Bizim gibi yazılımcılar i&amp;ccedil;in &amp;ouml;nemli olan ise başlangı&amp;ccedil; anıdır. Neden mi? Bazen bir yarışa başlanırken, yarışa iştirak eden katılımcıların start d&amp;uuml;zl&amp;uuml;ğ&amp;uuml;nde bir arada yer almalarını bekleriz. At yarışlarındaki başlangı&amp;ccedil; kapıları bu işe yaramaktadır. Tahmin edeceğiniz gibi bu kapılar atların başlangı&amp;ccedil; işareti gelmeden hareket etmelerini engellemek &amp;uuml;zere tasarlanmışlardır.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak ve pek tabi ki aynı durum program ortamı i&amp;ccedil;erisinde yer alan ve paralel &amp;ccedil;alıştırılması d&amp;uuml;ş&amp;uuml;n&amp;uuml;len metodlar i&amp;ccedil;inde ge&amp;ccedil;erli olabilir&lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_70.png" alt="G&amp;ouml;z kırpan g&amp;uuml;l&amp;uuml;mseme" /&gt; Bir başka deyişle bazı senaryolarda paralel olarak y&amp;uuml;r&amp;uuml;t&amp;uuml;lmesi istenen metodların, &amp;ccedil;alışmaya başlamadan &amp;ouml;nce bir kutu i&amp;ccedil;erisinde de paralel olarak dizilmeleri ve kutu beklenen limiti aştığında başlatılmaları istenebilir. Yani paralel &amp;ccedil;alıştırılması istenen fonksiyonellikler hazırlanıp belirli bir başlangı&amp;ccedil; noktasına doğru senkronize edilir ve sonrasında belirli bir kurala g&amp;ouml;re&lt;em&gt;(&amp;ouml;rneğin kutunun limitini doldurması gibi)&lt;/em&gt; başlatılırlar.&lt;/p&gt;
&lt;p&gt;Durumu daha iyi analiz edebilmek i&amp;ccedil;in dilerseniz basit bir senaryo &amp;uuml;zerinden ilerlemeye &amp;ccedil;alışalım. Malumunuz g&amp;uuml;n&amp;uuml;m&amp;uuml;z &amp;uuml;niversitelerinde &amp;ouml;zellikle algoritma derslerinde en &amp;ccedil;ok sorulan, okutulan, ezberletilen konuların başında sıralama teknikleri gelmektedir. &lt;strong&gt;Bubble Sort, Quick Sort, Insertion Sort&lt;/strong&gt; vb&amp;hellip;Eminim &amp;ccedil;oğumuz bunları ezberlemek ve sınavlarda &amp;ccedil;ıkacak diye uzun geceler boyu hazırlanmak zorunda kalmışızdır &lt;img class="wlEmoticon wlEmoticon-confusedsmile" style="border-style: none;" src="/pics/wlEmoticon-confusedsmile_10.png" alt="Kafası karışmış g&amp;uuml;l&amp;uuml;mseme" /&gt; Peki ya bu sıralama algoritmalarını bir yarışa sokmak ister miydiniz? Aslında her birini bir at olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;p aynı anda yarışı başlatmak istemez miydiniz dersem &amp;ccedil;ok daha uygun olacaktır &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_19.png" alt="G&amp;uuml;l&amp;uuml;mseme" /&gt; Bunu ger&amp;ccedil;ekleştirirken aslında paralel programlama tekniklerinden yararlanma şansımız bulunmaktadır. Her bir sıralama algoritması i&amp;ccedil;in birer &lt;strong&gt;Task&lt;/strong&gt;&amp;nbsp; nesne &amp;ouml;rneği &amp;uuml;retip bunları aynı anda &amp;ccedil;alıştırmamız yeterli olacaktır&amp;hellip;Aynı anda &lt;img class="wlEmoticon wlEmoticon-openmouthedsmile" style="border-style: none;" src="/pics/wlEmoticon-openmouthedsmile_17.png" alt="A&amp;ccedil;ık ağızlı g&amp;uuml;l&amp;uuml;mseme" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;İşte &lt;strong&gt;Barrier&lt;/strong&gt; sınıfını kullanmak i&amp;ccedil;in g&amp;uuml;zel bir fırsat. Yazımızın odak noktası hangi sıralama algoritmasının hızlı &amp;ccedil;alıştığını tespit etmekten ziyade, &lt;strong&gt;Barrier&lt;/strong&gt; sınıfını kullanarak ilgili sıralama algoritma metodlarını aynı anda başlatmaktır. Bu ama&amp;ccedil;la ben &amp;ouml;rnek olarak 3 adet sıralama algoritmasını baz almayı uygun g&amp;ouml;rd&amp;uuml;m. &lt;strong&gt;Bubble Sort, Quick Sort&lt;/strong&gt; ve&lt;strong&gt; Insertion Sort&amp;hellip;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Hedefimiz bu algoritmaları i&amp;ccedil;eren metodları birer &lt;strong&gt;Task&lt;/strong&gt; olarak tanımlamak ve &lt;strong&gt;start&lt;/strong&gt; d&amp;uuml;zl&amp;uuml;ğ&amp;uuml;nde aynı kapı i&amp;ccedil;erisine yerleştirerek aynı anda &amp;ccedil;alıştırılmalarını sağlamaktır. Kabaca &lt;strong&gt;Barrier&lt;/strong&gt; sınıfını kullanarak ger&amp;ccedil;ekleştireceğimiz &amp;ouml;rneğimizin &amp;ccedil;alışma zamanındaki akışı belkide aşağıdaki grafik ile ifade edilebilir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/bei_30.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="bei_30" src="/pics/bei_30_thumb.gif" alt="bei_30" width="428" height="490" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Barrier&lt;/strong&gt; sınıfı &amp;ouml;ncellikli olarak bir kapasite bildirimi ile &amp;ccedil;alışmaktadır. Bu kapasite aslında kutu i&amp;ccedil;erisine dahil edilecek olan &lt;strong&gt;Task&lt;/strong&gt; sayısını bildirmektedir. S&amp;ouml;z konusu &lt;strong&gt;Task&lt;/strong&gt; sayısına ulaşıldığında ilgili metodların aynı anda başlatılması s&amp;ouml;z konusu olacaktır&lt;em&gt;(Tabi arkadan gelen başka bir Task daha olursa, kapıdaki &amp;ouml;rnekler bir anda &amp;ccedil;ıkana kadar beklemek zorunda kalacaktır)&lt;/em&gt; Durumu elbetteki &amp;ouml;rnek kod par&amp;ccedil;ası &amp;uuml;zerinden anlamamız daha uygundur. Bu ama&amp;ccedil;la basit bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması a&amp;ccedil;ıp aşağıdaki kod i&amp;ccedil;eriğini yazarak ilerleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Collections.Generic; 
using System.Threading; 
using System.Threading.Tasks;

namespace SortingTest 
{ 
    class Program 
    { 
        static string insertionSortStartTime=String.Empty; 
        static string quickSortStartTime = String.Empty; 
        static string bubbleSortStartTime = String.Empty;

        static void Main(string[] args) 
        { 
            // &amp;Ouml;nce rastgele sayı koleksiyonumuz oluşturuluyor 
            List&amp;lt;int&amp;gt; testCollection = CreateRandomNumbers(100000,1, 100000);

            #region Barrier Kullanımı

            // 3 metodluk bir başlangı&amp;ccedil; kutusu tanımlıyoruz. 
            Barrier _barrier = new Barrier(3);

            // Bubble Sort metodu i&amp;ccedil;in bir Task &amp;uuml;retiliyor ve Task ilk olarak Barrier i&amp;ccedil;erisine ilave ediliyor 
            Task bubbleSortingTask = new Task( 
                () =&amp;gt; 
                { 
                    _barrier.SignalAndWait(); 
                    BubbleSorting(testCollection); 
                } 
            ); 
            bubbleSortingTask.Start();

            // Quick Sort metodu i&amp;ccedil;in bir Task &amp;uuml;retiliyor ve Task i&amp;ccedil;erisinde yine Barrier' e bir ekleme işlemi ger&amp;ccedil;ekleştiriliyor 
            Task quickSortingTask = new Task( 
                () =&amp;gt; 
                { 
                    _barrier.SignalAndWait(); 
                    QuickSorting(testCollection, 0, testCollection.Count - 1); 
                } 
            ); 
            quickSortingTask.Start();

            // Insertion Sort metodu i&amp;ccedil;in bir Task &amp;uuml;retiliyor ve Barrier i&amp;ccedil;erisine ekleniyor 
            Task insertionSortingTask = new Task( 
                () =&amp;gt; 
                { 
                   _barrier.SignalAndWait(); 
                    InsertionSorting(testCollection); 
                } 
            ); 
            insertionSortingTask.Start();

            // Task' lerin tamamlanması uzun s&amp;uuml;rebilir o y&amp;uuml;zden bekleyelim 
            Task[] tasks = { bubbleSortingTask, quickSortingTask, insertionSortingTask }; 
            Task.WaitAll(tasks);

            Console.WriteLine("Bubble : {0}\nQuick : {1}\nInsertion : {2}",bubbleSortStartTime,quickSortStartTime,insertionSortStartTime);

            #endregion

            #region Sequential &amp;ccedil;alıştırma

            bubbleSortStartTime = String.Empty; 
            quickSortStartTime = String.Empty; 
            insertionSortStartTime = String.Empty;

            Console.WriteLine("\nSequential &amp;Ccedil;alıştırma\n"); 
            // Bubble algoritmasına g&amp;ouml;re sıralama 
            var bubbleOrdered = BubbleSorting(testCollection); 
            // Quick sort algoritmasına g&amp;ouml;re sıralama 
            var quickOrdered = QuickSorting(testCollection, 0, testCollection.Count - 1); 
            // Insertion sort algoritmasına g&amp;ouml;re sıralama 
            var insertionOrdered = InsertionSorting(testCollection);

            Console.WriteLine("Bubble : {0}\nQuick : {1}\nInsertion : {2}", bubbleSortStartTime, quickSortStartTime, insertionSortStartTime);

           #endregion 
        }

        /// &amp;lt;summary&amp;gt; 
        /// Bubble sıralama algoritmasına g&amp;ouml;re sayı dizisini sıralar 
        /// &amp;lt;/summary&amp;gt; 
        /// &amp;lt;param name="Numbers"&amp;gt;Sıralanacak olan sayı koleksiyonu&amp;lt;/param&amp;gt; 
        /// &amp;lt;returns&amp;gt;Parametre olarak gelen Numbers koleksiyonunun sıralanmış halidir&amp;lt;/returns&amp;gt; 
        static List&amp;lt;int&amp;gt; BubbleSorting(List&amp;lt;int&amp;gt; Numbers) 
        { 
            if (String.IsNullOrEmpty(bubbleSortStartTime)) 
                bubbleSortStartTime = DateTime.Now.ToLongTimeString();

            for (int i = 0; i &amp;lt; Numbers.Count - 1; i++) 
            { 
                for (int j = 1; j &amp;lt; Numbers.Count - i; j++) 
                { 
                    if (Numbers[j] &amp;lt; Numbers[j - 1]) 
                    { 
                        int temporary = Numbers[j - 1]; 
                        Numbers[j - 1] = Numbers[j]; 
                        Numbers[j] = temporary; 
                    } 
                } 
            }

            return Numbers; 
        }

        /// &amp;lt;summary&amp;gt; 
        /// QuickSort veya Pivot Sort algoritmasına g&amp;ouml;re sıralama işlemini yapan metoddur. 
        /// &amp;lt;/summary&amp;gt; 
        /// &amp;lt;param name="Numbers"&amp;gt;Sıralanacak olan sayı koleksiyonu&amp;lt;/param&amp;gt; 
        /// &amp;lt;param name="LeftValue"&amp;gt;Sol değer&amp;lt;/param&amp;gt; 
        /// &amp;lt;param name="RightValue"&amp;gt;Sağ değer&amp;lt;/param&amp;gt; 
        /// &amp;lt;returns&amp;gt;Sayı koleksiyonunun sıralanmış hali&amp;lt;/returns&amp;gt; 
        static List&amp;lt;int&amp;gt; QuickSorting(List&amp;lt;int&amp;gt; Numbers, int LeftValue, int RightValue) 
        { 
            if (String.IsNullOrEmpty(quickSortStartTime)) 
                quickSortStartTime = DateTime.Now.ToLongTimeString();

            int i = LeftValue; 
            int j = RightValue; 
            double pivotValue = ((LeftValue + RightValue) / 2); 
            int x = Numbers[Convert.ToInt32(pivotValue)]; 
            int w = 0; 
            while (i &amp;lt;= j) 
            { 
                while (Numbers[i] &amp;lt; x) 
                { 
                    i++; 
                } 
                while (x &amp;lt; Numbers[j]) 
                { 
                    j--; 
                } 
                if (i &amp;lt;= j) 
                { 
                    w = Numbers[i]; 
                    Numbers[i++] = Numbers[j]; 
                    Numbers[j--] = w; 
                } 
            } 
            if (LeftValue &amp;lt; j) 
            { 
                QuickSorting(Numbers, LeftValue, j); 
            } 
            if (i &amp;lt; RightValue) 
            { 
                QuickSorting(Numbers, i, RightValue); 
            } 
            
            return Numbers; 
        }

        /// &amp;lt;summary&amp;gt; 
        /// InsertionSort algoritmasına g&amp;ouml;re sayı koleksiyonunu sıralar 
        /// &amp;lt;/summary&amp;gt; 
        /// &amp;lt;param name="Numbers"&amp;gt;Sıralanacak olan sayı koleksiyonu&amp;lt;/param&amp;gt; 
        /// &amp;lt;returns&amp;gt;Sayı koleksiyonunun sıralanmış hali&amp;lt;/returns&amp;gt; 
        static List&amp;lt;int&amp;gt; InsertionSorting(List&amp;lt;int&amp;gt; Numbers) 
        { 
            if (String.IsNullOrEmpty(insertionSortStartTime)) 
                insertionSortStartTime = DateTime.Now.ToLongTimeString();

            for (int j = 1; j &amp;lt; Numbers.Count; j++) 
            { 
                int keyValue = Numbers[j]; 
                int i = j - 1; 
                while (i &amp;gt;= 0 &amp;amp;&amp;amp; Numbers[i] &amp;gt; keyValue) 
                { 
                    Numbers[i + 1] = Numbers[i]; 
                    i = i - 1; 
                } 
                Numbers[i + 1] = keyValue; 
            }

            return Numbers; 
        }

        /// &amp;lt;summary&amp;gt; 
        /// Sıralama testlerine tabi tutulacak sayı koleksiyonunu &amp;uuml;retir 
        /// &amp;lt;/summary&amp;gt; 
        /// &amp;lt;param name="NumberCount"&amp;gt;Ka&amp;ccedil; adet sayıdan oluşacak&amp;lt;/param&amp;gt; 
        /// &amp;lt;param name="StartValue"&amp;gt;Rastgele sayı &amp;uuml;retici i&amp;ccedil;in minimum değer&amp;lt;/param&amp;gt; 
        /// &amp;lt;param name="EndValue"&amp;gt;Rastgele sayı &amp;uuml;retici i&amp;ccedil;in maksimum değer&amp;lt;/param&amp;gt; 
        /// &amp;lt;returns&amp;gt;Oluşan sayı koleksiyonu&amp;lt;/returns&amp;gt; 
        static List&amp;lt;int&amp;gt; CreateRandomNumbers(int NumberCount,int StartValue, int EndValue) 
        { 
            List&amp;lt;int&amp;gt; collection = new List&amp;lt;int&amp;gt;(); 
            Random rnd = new Random(); 
            for (int i = 0; i &amp;lt; NumberCount; i++) 
            { 
                collection.Add(rnd.Next(StartValue,EndValue)); 
            } 
            return collection; 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Aslında uygulamamız &amp;ccedil;ok karmaşık g&amp;ouml;z&amp;uuml;kse de olduk&amp;ccedil;a basit temellere dayanıyor. Sıralama algoritmalarının &amp;uuml;&amp;ccedil;&amp;uuml; i&amp;ccedil;in ve bir de rastgele sayı &amp;uuml;retimi i&amp;ccedil;in tasarlanmış metodlarımız bulunmaktadır. Asıl &amp;ouml;nemli olan kısım ise &lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisinde yaptıklarımızdır. Dikkat edileceği &amp;uuml;zere ilk olarak &lt;strong&gt;Barrier&lt;/strong&gt; nesne &amp;ouml;rneği kullanılarak bir akış ger&amp;ccedil;ekleştirilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Barrier&lt;/strong&gt; sınıfına ait nesne &amp;ouml;rneği &amp;uuml;retildikten sonra, ilgili &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneklerinin buraya dail olmaları i&amp;ccedil;in, &lt;strong&gt;anonymous&lt;/strong&gt; metodlarda &lt;strong&gt;SignalAndWait&lt;/strong&gt; fonksiyonuna birer &amp;ccedil;ağrıda bulunulduğuna dikkat edelim &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_70.png" alt="G&amp;ouml;z kırpan g&amp;uuml;l&amp;uuml;mseme" /&gt;&amp;nbsp; Sonrasında &lt;strong&gt;Task&lt;/strong&gt; nesne &amp;ouml;rneklerinin &lt;strong&gt;Start&lt;/strong&gt; metodları &amp;ccedil;ağırılıyor. Ne var ki &lt;strong&gt;Barrier&lt;/strong&gt; bloğunun kapasitesi dolana kadar ilgili metodlar y&amp;uuml;r&amp;uuml;t&amp;uuml;lmeyecektir. Zaten s&amp;ouml;z konusu &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneklerinin &lt;strong&gt;Barrier&lt;/strong&gt; bloğuna dahil edilme sebebi de kapasite dolumundan sonra aynı anda &amp;ccedil;alışmaya başlamalarının istenmesidir. Uygulamayı &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer sonu&amp;ccedil;lar aldığımızı g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/bei_31.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="bei_31" src="/pics/bei_31_thumb.gif" alt="bei_31" width="371" height="171" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;Barrier&lt;/strong&gt; kullanımı nedeni ile ilk &amp;uuml;&amp;ccedil; &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneğinin tam olarak aynı anda başlatılmaları s&amp;ouml;z konusudur&lt;em&gt;(Aslında bakarsanız milisaniye cinsinden de kontrol edilmeleri gerekmektedir)&lt;/em&gt; Diğer yandan &lt;strong&gt;Sequential&lt;/strong&gt; &amp;ccedil;alışma da elbetteki metodlar başlatıldıkları sıra ile y&amp;uuml;r&amp;uuml;t&amp;uuml;lmektedirler. Burada &lt;strong&gt;Quick Sort&lt;/strong&gt; algoritmasının ger&amp;ccedil;ekten &amp;ccedil;ok hızlı olması nedeni ile işini &amp;ccedil;ok kısa s&amp;uuml;rede bitirdiğini ve hemen &lt;strong&gt;Insertion Sort&lt;/strong&gt; metoduna ge&amp;ccedil;ilebildiğini vurgulamak isterim.&lt;/p&gt;
&lt;p&gt;Sanırım &lt;strong&gt;Barrier&lt;/strong&gt; tipinin kullanımını biraz olsun kavrayabilmişizdir. Konuyu daha net kavrayabilmek i&amp;ccedil;in uygulamayı &lt;strong&gt;Debug&lt;/strong&gt; modda &amp;ccedil;alıştırmanızı &amp;ouml;neririm. &amp;Ouml;zellikle &lt;strong&gt;Sort&lt;/strong&gt; metodlarının başlangı&amp;ccedil; noktalarına &lt;strong&gt;Breakpoint&lt;/strong&gt; koyarsanız, &lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisinde ilgili &lt;strong&gt;Task&lt;/strong&gt; nesne &amp;ouml;rnekleri &amp;uuml;zerinden &lt;strong&gt;Start&lt;/strong&gt; metodları &amp;ccedil;ağırılsa bile &lt;strong&gt;Barrier&lt;/strong&gt; bloğunun kapasitesi dolana kadar bu &lt;strong&gt;breakpoint&lt;/strong&gt; noktalarına gelinemediğini g&amp;ouml;r&amp;uuml;yor olacaksınız. Burada eğer &lt;strong&gt;Debug&lt;/strong&gt; &lt;strong&gt;Mod&lt;/strong&gt;&amp;rsquo; da &lt;strong&gt;Parallel&lt;/strong&gt; &lt;strong&gt;Tasks&lt;/strong&gt; penceresine bakarsanız &lt;strong&gt;Task&lt;/strong&gt; &amp;ouml;rneklerinin &lt;strong&gt;Start&lt;/strong&gt; metodlarına yapılan &amp;ccedil;ağrılardan sonra &lt;strong&gt;Status&lt;/strong&gt; olarak &lt;strong&gt;Running&amp;rsquo; &lt;/strong&gt;e ge&amp;ccedil;tikleri g&amp;ouml;r&amp;uuml;lecektir ki bu sizi yanıltmamalıdır. Bu sebepten &amp;ouml;rneği &lt;strong&gt;Debug&lt;/strong&gt; modda izlemeniz son derece &amp;ouml;nemlidir &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_70.png" alt="G&amp;ouml;z kırpan g&amp;uuml;l&amp;uuml;mseme" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bakın ben &amp;ccedil;alışma zamanında durumu analiz ettiğimde &lt;strong&gt;Barrier&lt;/strong&gt; b&amp;ouml;lgesine son eklenen &lt;strong&gt;Insertion Sort&lt;/strong&gt; algoritma metodundan sonra, bu son eklenen ilk olmak &amp;uuml;zere işleyişin başlayabildiğin g&amp;ouml;rd&amp;uuml;m. Bir başka deyişle &lt;strong&gt;Barrier&lt;/strong&gt; i&amp;ccedil;in belirtilen 3 kapasite değeri &lt;strong&gt;InsertionSort&lt;/strong&gt; metodu eklenene kadar dolmadığından hi&amp;ccedil; bir metod başlatılmamıştır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/bei_32.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border: 0px;" title="bei_32" src="/pics/bei_32_thumb.gif" alt="bei_32" width="587" height="476" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/240496b.jpg"&gt;&lt;img style="margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border-width: 0px; float: right; background-image: none;" title="240496b" src="/pics/240496b_thumb.jpg" alt="240496b" width="179" height="216" align="left" border="0" /&gt;&lt;/a&gt;Parallel programlama ile ilişkili olarak bir ka&amp;ccedil; yazı yazmayı daha planlamaktayım. İ&amp;ccedil;eride g&amp;ouml;zden ka&amp;ccedil;an olduk&amp;ccedil;a &amp;ouml;nemli ve hayati pek &amp;ccedil;ok konu var. &amp;Ouml;zellikle de gelecek nesil .Net platformunda bu konunun ne kadar &amp;ouml;nemli olduğunu d&amp;uuml;ş&amp;uuml;n&amp;uuml;rsek geliştirici olarak iyi hazırlanmamız gerektiği kanısındayım.&lt;/p&gt;
&lt;p&gt;Aslında ben şu sıralarda &lt;a href="http://amzn.com/0735640602"&gt;Parallel Programming Step by Step&lt;/a&gt; isimli kitabı takip ediyorum. İnce bir kitap ve sizlere de&amp;nbsp; şiddetle tavsiye ederim. Ger&amp;ccedil;i ince olduğuna aldanmayın l&amp;uuml;tfen. Yeteri kadar doyurucu bilgi ve kod &amp;ouml;rneğini barındırmakta. Eğer paralel programlamaya ilgi duyuyorsanız tabi &lt;img class="wlEmoticon wlEmoticon-smile" style="border-style: none;" src="/pics/wlEmoticon-smile_19.png" alt="G&amp;uuml;l&amp;uuml;mseme" /&gt; Buraya kadar sabırla okuduğunuz i&amp;ccedil;in teşekk&amp;uuml;r ederken tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&amp;nbsp;&lt;a href="/pics/2011%2f10%2fSortingTest.rar"&gt;SortingTest.rar (29,66 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2011-10-17 09:47:00</pubDate>
  <slug>Barrier-Class</slug>
  <tags>
    <tag>parallel-programming</tag>
    <tag>barrier-class</tag>
    <tag>task-parallel-library</tag>
    <tag>sort-algoritmaları</tag>
  </tags>
  <categories>
    <category>Parallel Programming</category>
  </categories>
</post>