<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Derinlemesine Session Kullanımı - 2</title>
  <description>Bir önceki makalemizde hatırlayacağınız gibi, Session nesnelerinin kullanımını incelemeye başlamıştık. Bu makalemizde ise, Session nesnelerinin nerelerde saklanabildiğine değinmeye çalışacağız. Varsayılan olarak Session nesneleri In-Proc (işlem içi) modunda saklanırlar. Yani web sayfasının çalıştığı asp.net work process' in içinde, dolayısıyla bu işlerin çalıştığı web sunucularındaki bellek alanlarında tutulurlar. Bu özellikle Session nesnelerine bilgi yazma ve okumada önemli bir avantajdır.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki makalemizde hatırlayacağınız gibi, Session nesnelerinin kullanımını incelemeye başlamıştık. Bu makalemizde ise, Session nesnelerinin nerelerde saklanabildiğine değinmeye &amp;ccedil;alışacağız. Varsayılan olarak Session nesneleri &lt;strong&gt;In-Proc&lt;/strong&gt; (işlem i&amp;ccedil;i) modunda saklanırlar. Yani web sayfasının &amp;ccedil;alıştığı asp.net work process' in i&amp;ccedil;inde, dolayısıyla bu işlerin &amp;ccedil;alıştığı web sunucularındaki bellek alanlarında tutulurlar. Bu &amp;ouml;zellikle Session nesnelerine bilgi yazma ve okumada &amp;ouml;nemli bir avantajdır.&lt;/p&gt;
&lt;p&gt;Nitekim, erişim doğrudan ram &amp;uuml;zerindeki b&amp;ouml;lgelere doğru olduğu i&amp;ccedil;in diğer bahsedeceğimiz modlara nazaran g&amp;ouml;receli olarak olduk&amp;ccedil;a hızlı bir erişim s&amp;ouml;z konusudur. Lakin, web sunucusunun başına bir şey gelmesi halinde (&amp;ouml;rneğin sunucunun bir anda restart olması gibi) bellekte tutulan t&amp;uuml;m Session nesneleri bir anda kaybedilir. Bu da &amp;ccedil;ok sayıda kullanıcının a&amp;ccedil;tığı oturumlara ait bilgilerin tamamının kaybolması anlamına gelmektedir. Bunu basit bir &amp;ouml;rnek ile g&amp;ouml;sterebiliriz. Aşağıdaki web uygulmasında, Session nesnesine bir değer atanmaktadır. Session' ın time-out s&amp;uuml;resi varsayılan halinde (Yani 20 dakika olarak) bırakılmıştır.&lt;/p&gt;
&lt;p&gt;default.aspx kodları ve Form' un ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void Page_Load(object sender, System.EventArgs e)
{
    if(Session["Bilgi"]!=null)
    {
        Label1.Text=Session["Bilgi"].ToString();
    }
}
private void btnEkle_Click(object sender, System.EventArgs e)
{
    Session["Bilgi"]="Deneme";
    Label1.Text=Session["Bilgi"].ToString();
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk112_1.gif" alt="" width="218" height="218" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;WebForm2.aspx kodları ve Form' un ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void Page_Load(object sender, System.EventArgs e)
{
    if(Session["Bilgi"]!=null)
        Label1.Text=Session["Bilgi"].ToString();
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk112_2.gif" alt="" width="231" height="183" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu &amp;ouml;rneği &amp;ccedil;alıştırdığımızda, default.aspx sayfasında Ekle butonuna basarsak Session nesnemize Deneme bilgisi eklenecektir. Eğer WebForm2.aspx sayfasına ge&amp;ccedil;ersek, Session bilgisinin Label kontrol&amp;uuml;ne yazıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk112_3.gif" alt="" width="519" height="206" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi web uygulamamıza ait &lt;strong&gt;Global.asax&lt;/strong&gt; dosyasında herhangibir değişiklik yapıp uygulamamızı yeniden derleyelim. Ben &amp;ouml;rnek olarak pek bir anlam ifade etmeyen bir yorum satırı girdim ve uygulamayı yeniden derledim. Tabi bunu yaparken, web tarayıcımızda sayfalarımız a&amp;ccedil;ık halde bulunmalıdır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void Application_Start(Object sender, EventArgs e)
{
    //YORUM SATIRIDIR.
}&lt;/pre&gt;
&lt;p&gt;Şimdi linklerimize tıklayarak sayfalar arasında tekrar gezindiğimizde, hen&amp;uuml;z time-out s&amp;uuml;resi dolmamış olan Session nesnelerinin kaybedildiğini ve Label kontrollerinde Session nesnesine ait i&amp;ccedil;eriğin yazmadığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Kısacası, In-Proc modunda olan (Yani işlem i&amp;ccedil;i - In Process) Session nesneleri kaybedilmiştir. Elbetteki Session nesnelerinin bu şekilde kaybolması dışında da oluşabilecek istisnalar vardır. &amp;Ouml;rneğin sunucunun istem dışı bir şekilde kapanması gibi.&lt;/p&gt;
&lt;p&gt;Asp.Net ile birlikte durum y&amp;ouml;netiminde (state management), Session nesnelerinin saklanabilmesi i&amp;ccedil;in iki teknik daha geliştirilmiştir. Bu teknikler yardımıyla, durum nesnelerinin yukarıdaki gibi nedenlerden &amp;ouml;t&amp;uuml;r&amp;uuml; kaybolmalarının &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ilebilmektedir. Bu tekniklerden bir tanesi Session nesnelerinin bir &lt;strong&gt;Sql Veritabanında&lt;/strong&gt; tutulduğu &lt;strong&gt;SQLServer&lt;/strong&gt; modu, diğeri ise Session nesnelerinin &lt;strong&gt; ASP.NET State Service Windows Servisinde&lt;/strong&gt; tutulduğu &lt;strong&gt;StateServer&lt;/strong&gt; modudur. İlk olarak SQLServer modunu inceleyeceğiz.&lt;/p&gt;
&lt;p&gt;SQLServer modunda, Session nesnesine ait t&amp;uuml;m bilgiler bir Sql Sunucusunda bu iş i&amp;ccedil;in &amp;ouml;zel olarak hazırlanmış bir veritabanında tutulmaktadırlar. B&amp;ouml;ylece, Session nesnelerine ait i&amp;ccedil;erik, istenen s&amp;uuml;re kadar (aylarca bile olabilir) fiziki bir disk b&amp;ouml;lgesinde saklanabilmektedir. Bu ayrıca, veritabanının başka bir sunucuda konuşlandırılmasıyla, Web &amp;Ccedil;iftliklerinin (&lt;strong&gt;Web Farms&lt;/strong&gt;) yapısına uygun bir oluşumada imkan tanır. B&amp;ouml;ylece, Web Sunucusunda oluşabilecek aksaklıklardan doğacak sorunlar Sql Sunucusunu etkilemeyecek, dolayısıyla Session' lar korunmuş olacaktır. Elbette bu sistemin de dezavantajı vardır.&lt;/p&gt;
&lt;table id="table5" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;Session nesnelerini ayrı bir sunucudaki veri tabanında tutmak her ne kadar &lt;strong&gt;g&amp;uuml;venlik ve tutarlılık&lt;/strong&gt; a&amp;ccedil;ısından &lt;strong&gt;y&amp;uuml;ksek performans&lt;/strong&gt; sağlasada, bilgilere erişimin In-Proc moda g&amp;ouml;re &lt;strong&gt;daha yavaş&lt;/strong&gt; olmasınada neden olur. Bu elbetteki verinin okunması veya yazılması i&amp;ccedil;in s&amp;uuml;rekli veritabanına doğru atılan turların bir sonucudur.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;SQLServer modunda kullanılan ASPState isimli veritabanında Session nesnelerinin yazılma, silinme gibi işlemleri i&amp;ccedil;in kullanılan stored procedure' ler yer alır. Session nesnelerine ait asıl i&amp;ccedil;erik ise tempdb isimli veritabanında yer alan tablolarda tutulmaktadır. Microsoft .NET Framework bu veritabanını ve i&amp;ccedil;eriğini kurmak i&amp;ccedil;in gerekli Sql kodlarını i&amp;ccedil;eren script dosyalarını i&amp;ccedil;erir. Windows XP sistemlerinde bu dosyaya (&lt;strong&gt;InstallSqlState.sql&lt;/strong&gt;) &lt;strong&gt;D:\WINDOWS\Microsoft.NET\Framework\v1.1.4322\ &lt;/strong&gt;adresinden ulaşabilirsiniz. Bu sql script dosyasını &lt;strong&gt;Sql Query Analyzer&lt;/strong&gt; ile &amp;ccedil;alıştırdığımızda, Sql Sunucusunda &lt;strong&gt;ASPState&lt;/strong&gt; isimli bir veritabanı oluşturulduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Ayrıca Session nesnelerini tutacak olan tablolarda &lt;strong&gt;tempdb&lt;/strong&gt; veritabanı i&amp;ccedil;erisine eklenirler.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk112_4.gif" alt="" width="427" height="554" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada bizi asıl ilgilendiren kısım, &lt;strong&gt;tempdb&lt;/strong&gt; veritabanında oluşturulan &lt;strong&gt;ASPStateTempSessions&lt;/strong&gt; isimli tablodur. Nitekim bu tablo Session verilerini saklamak &amp;uuml;zere kullanılmaktadır. Tablonun yapısı aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk112_5.gif" alt="" width="322" height="180" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edecek olursanız, &lt;strong&gt;SessionId&lt;/strong&gt; isimli alan tablonun Primary Key alanıdır. Bu alanda, web sunucu tarafından otomatik olarak oluşturulan &lt;strong&gt;ASP.NET_SessionId&lt;/strong&gt; değeri tutulmaktadır. Bunun dışında Session' ın yaratıldığı tarih, oturumun sona ereceği s&amp;uuml;re bilgisi gibi veriler dışında Session nesnesinin i&amp;ccedil;eriğinin saklanacağı iki &amp;ouml;nemli alan daha vardır. Bunlar &lt;strong&gt;SessionItemShort&lt;/strong&gt; ve &lt;strong&gt;SessionItemLong&lt;/strong&gt; alanlarıdır. Her iki alandan hangisinin kullanılacağı, Session nesnesine atanan verinin b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;ne g&amp;ouml;re belirlenmektedir. İşte bu noktada karşımıza &amp;ouml;nemli bir sorun &amp;ccedil;ıkar.&lt;/p&gt;
&lt;table id="table4" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/soru.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;Bir DataSet i&amp;ccedil;eriğini Session nesnesine aktardığımızda, SessionItemShort veya SessionItemLong alanlarından hangisi kullanılırsa kullanılsın, Session nesnesinin i&amp;ccedil;erdiği veri nasıl olurda &lt;strong&gt;tek bir alan i&amp;ccedil;erisine&lt;/strong&gt; sığdırılabilir?&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;İşte burada bir &amp;ouml;nceki makalemizde bahsettiğimiz gibi Session nesnesinin taşıyacağı verinin serileştirilebilir olması gerekliliği ortaya &amp;ccedil;ıkmaktadır. B&amp;ouml;ylece ister binary olarak ister XML olarak DataSet nesnesinin i&amp;ccedil;eriği serileştirilebilir ve tek bir alan i&amp;ccedil;erisine yazılıp okunabilir. Bu elbetteki Session ile taşımak istediğimiz her nesne &amp;ouml;rneği i&amp;ccedil;in ge&amp;ccedil;erli bir durumdur. (&amp;Ouml;rneğin kendi yazdığımız bir sınıf i&amp;ccedil;in.)&lt;/p&gt;
&lt;table id="table6" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;Out-of-Proc&lt;/strong&gt; (İşlem dışı) modlarda, Session nesnesine atanan nesnelerin &lt;strong&gt;mutlaka serileştirilebilir (Serializable)&lt;/strong&gt; olmaları gerekmektedir.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Şimdi basit olarak yukarıda işlediğimiz &amp;ouml;rneğimizde kullandığımız Session nesnesini, &lt;strong&gt;SQLServer&lt;/strong&gt; modunda saklayalım. Varsayılan olarak, Session nesneleri In-Proc modda tutulduklarından &lt;strong&gt;web.config&lt;/strong&gt; dosyasında yer alan &lt;strong&gt;sessionState&lt;/strong&gt; boğumunun standart i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;sessionState 
    mode="InProc"
    stateConnectionString="tcpip=127.0.0.1:42424"
    sqlConnectionString="data source=127.0.0.1;Trusted_Connection=yes"
    cookieless="false" 
    timeout="20" 
/&amp;gt;&lt;/pre&gt;
&lt;p&gt;Mode &amp;ouml;zelliğinin değeri varsayılan olarak InProc' tur. Yani, Session nesneleri işlem i&amp;ccedil;inde tutulmaktadır. Session bilgilerini veritabanına yazabilmek i&amp;ccedil;in sessionState boğumunu aşağıdaki gibi d&amp;uuml;zenlememiz yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;sessionState 
    mode="SQLServer"
    stateConnectionString="tcpip=127.0.0.1:42424"
    sqlConnectionString="data source=127.0.0.1;user id=sa;password=123456"
    cookieless="false" 
    timeout="20" 
/&amp;gt;&lt;/pre&gt;
&lt;p&gt;Burada dikkat etmemiz gereken en &amp;ouml;nemli nokta, &lt;strong&gt;sqlConnectionString&lt;/strong&gt; &amp;ouml;zelliğinin aldığı bağlantı c&amp;uuml;mleciğidir. Bu &amp;ouml;zellikte, sql sunucusunun bulunduğu lokasyon &lt;strong&gt;data source&lt;/strong&gt; ile belirtilmektedir. Varsayılan olarak Sql sunucusunun localhost &amp;uuml;zerinde bulunduğu d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nden bu değer 127.0.0.1 ip değerini alır. Ancak &lt;strong&gt;Web &amp;Ccedil;iftliği (Web-Farm) &lt;/strong&gt;gibi sistemlerde eğer Sql Sunucusunun bulunduğu adres farklı ise data source değerini bu adrese g&amp;ouml;re ayarlamamız gerekecektir. Diğer taraftan, Ado.Net' te olduğu gibi bağlantının yapılacağı veritabanı adının burada belirtilmesine gerek yoktur. Bunun sebebi SQLServer modunda Session nesnelerinin nereye yazılacaklarının zaten belli olmasıdır. Bir diğer husus ise, mutlaka ve mutlaka bağlantıyı belli bir kullanıcı adı ve şifresi &amp;uuml;zerinden yapmamızın g&amp;uuml;venlik a&amp;ccedil;ısından daha sağlıklı olacağıdır.&lt;/p&gt;
&lt;p&gt;Şunu da hatırlatmakta fayda var. InstallSqlState script' i her ne kadar session y&amp;ouml;netimi i&amp;ccedil;in gerekli veritabanı d&amp;uuml;zenlemelerini yapsada, ASPNET kullanıcısına ASPState veritabanındaki stored procedure' leri &amp;ccedil;alıştırma ve tempdb i&amp;ccedil;indeki ASPStateTempSessions ile ASPStateTempApplications tabloları i&amp;ccedil;in gerekli &lt;strong&gt;Select&lt;/strong&gt;, &lt;strong&gt;Insert&lt;/strong&gt;, &lt;strong&gt;Update&lt;/strong&gt;, &lt;strong&gt;Delete&lt;/strong&gt; komutlarını y&amp;uuml;r&amp;uuml;tebilme izinlerini vermemiz gerekiyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk112_6.gif" alt="" width="559" height="448" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Aksi takdirde ASPNET kullancısının bu sp ve sql komutlarını &amp;ccedil;alıştırma yetkisi olmayacağından web uygulamamızda aşağıdakine benzer t&amp;uuml;rden hata sayfaları ile karşılaşabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk112_7.gif" alt="" width="531" height="208" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Gerekli izinleride verdikten sonra artık uygulamamızı &amp;ccedil;alıştırabiliriz. Uygulamamızı &amp;ccedil;alıştırdığımız sırada eğer Sql Profiler ile arka planda olanları izlersek hemen bir sp' nin &amp;ccedil;alıştırıldığını ve sp' ye parametre olarak bir GUID' in aktarıldığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Buradaki GUID, web sunucusu tarafından &amp;uuml;retilen &lt;strong&gt;ASP.NET_SessionId&lt;/strong&gt;' den başka bir şey değildir. Session nesnesi ilk kez yaratıldığından ilgili tabloya &lt;strong&gt;INSERT&lt;/strong&gt; işlemini uygulayan bir sp &amp;ccedil;alışmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk112_8.gif" alt="" width="558" height="253" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Tam bu noktada ASPStateTempSessions tablomuza bakacak olursak, yukarıdaki sp'ye aktarılan Id' değerini SessionId alanına almış yeni bir satır oluşturulduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk112_9.gif" alt="" width="624" height="238" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Elbetteki bu noktada, Session' ımıza hen&amp;uuml;z bir bilgi aktarmadığımız i&amp;ccedil;in tabloda yer alan ilgili alanlara herhangibir bilgi yazılmamıştır. default.aspx sayfasında ekle butonuna basarsak, başka bir sp' nin bu kez var olan SessionId' li satırı g&amp;uuml;ncellemek &amp;uuml;zere &amp;ccedil;alıştırıldığını ve parametre olarakta encrypt edilmiş Session i&amp;ccedil;eriğinin g&amp;ouml;nderildiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk112_10.gif" alt="" width="631" height="192" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dolayısıyla Session i&amp;ccedil;eriği tabloda yer alan ilgili satıra (ASP.NET_SessionId değerine sahip olan satır) yazılmış olacaktır. Eğer makalemizin başındaki &amp;ouml;rneğimizde yaptığımız gibi, Global.asax dosyasında bir değişiklik yapıp uygulamayı yeniden derleyip time-out s&amp;uuml;resinden &amp;ouml;nce Session' ları okumak istersek, Session' lara ait değerlerin kaybolmadığını kolayca tespit edebiliriz. Session' ların yaşam s&amp;uuml;releri dolduğunda otomatik olarak silindiklerini biliyoruz. InstallSqlState script' i ayrıca zaman aşımına uğramış Session' ların otomatik olarak kaldırılması i&amp;ccedil;in gerekli bir &lt;strong&gt;job&lt;/strong&gt; nesnesinide sql sunucusuna y&amp;uuml;kler. &lt;em&gt;(Job nesnesinin &amp;ccedil;alışabilmesi i&amp;ccedil;in &lt;strong&gt;Sql Server Agent&lt;/strong&gt; servisinin &amp;ccedil;alışıyor olması gerekmektedir.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk112_11.gif" alt="" width="249" height="84" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi aşağıdaki &amp;ouml;rneği inceleyelim. Bu &amp;ouml;rneğimizde, Session nesnesine bizim tanımladığımız bir nesne &amp;ouml;rneğini aktarıyoruz.&lt;/p&gt;
&lt;p&gt;Personel isimli sınıfımız;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Personel
{
    private string mAd;
    private string mSoyad;

    public string Ad
    {
        get
        {
            return mAd;
        }
        set
        {
            mAd=value;
        }
    }

    public string Soyad
    {
        get
        {
            return mSoyad;
        }
        set
        {
            mSoyad=value;
        }
    }

    public Personel(string ad,string soyad)
    {
        mAd=ad;
        mSoyad=soyad;
    }

    public Personel()
    {

    }
}&lt;/pre&gt;
&lt;p&gt;default.aspx;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private Personel pOku;

private void Page_Load(object sender, System.EventArgs e)
{

    if(Session["Eleman"]!=null)
    {
        pOku=new Personel();
        pOku=(Personel)Session["Eleman"];
        Label1.Text=pOku.Ad+" "+pOku.Soyad;
    }
}

private void btnEkle_Click(object sender, System.EventArgs e)
{
    Personel p1=new Personel("Burak Selim","Şenyurt");
    Session["Eleman"]=p1;
}&lt;/pre&gt;
&lt;p&gt;WebForm2.aspx&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private Personel pOku;

private void Page_Load(object sender, System.EventArgs e)
{
    if(Session["Eleman"]!=null)
    {
        pOku=new Personel();
        pOku=(Personel)Session["Eleman"];
        Label1.Text=pOku.Ad+" "+pOku.Soyad;
    }
}&lt;/pre&gt;
&lt;p&gt;default.aspx sayfasında Session nesnemize Personel sınıfından p1 isimli nesne &amp;ouml;rneğimizi aktarıyorz. Her iki sayfada da Session nesnesinin i&amp;ccedil;eriğini okurken, Personel sınıfından bir nesne &amp;ouml;rneğine a&amp;ccedil;ık&amp;ccedil;a bir d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi yaptığımıza dikkat edelim. &amp;Ccedil;&amp;uuml;nk&amp;uuml; Session nesnesi, kendisine atanan verileri object tipinde taşımaktadır. Şimdi default.aspx sayfamızı tarayıcı penceresinde a&amp;ccedil;ar ve Ekle butonuna basarsak aşağıdaki hata mesajını alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk112_12.gif" alt="" width="567" height="238" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sorun gayet a&amp;ccedil;ıktır. Personel sınıfımızın serileştirilebilir bir nesne olması gerekmektedir. Bu nedenle Personel sınıfımıza &lt;strong&gt;Serializable niteliğini (Attribute) &lt;/strong&gt; eklememiz gerekiyor.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[Serializable]
public class Personel
{
   .
   .
   .&lt;/pre&gt;
&lt;p&gt;Şimdi Ekle butonuna tekrardan basarsak ve sayfalar arasında gezersek, Personel sınıfına ait nesne &amp;ouml;rneğinin başarılı bir şekilde taşındığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;Session nesnelerini işlem dışından saklayabileceğimiz bir diğer se&amp;ccedil;enekte &lt;strong&gt;ASP.NET State Service&lt;/strong&gt; isimli windows servisinin kullanılmasıdır. Bu kullanımda &amp;ccedil;oğunlukla, State Service başka bir sunucu &amp;uuml;zerinde &amp;ccedil;alıştırılır ve diğer web sunucuları tarafından ortaklaşa kullanılır. Dolayısıyla, &amp;ccedil;alışan &lt;strong&gt; Asp.Net work processor&lt;/strong&gt;' dan ayrı process' ler s&amp;ouml;z konusudur. Bu ayrı process' ler &lt;strong&gt;State Server&lt;/strong&gt; &amp;uuml;zerinde konuşlandırılır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk112_13.gif" alt="" width="520" height="400" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Session nesnelerini ASP.NET State Service ile kontrol edebilmek i&amp;ccedil;in &amp;ouml;ncelikle bu servisin &amp;ccedil;alıştırılması gerekir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk112_14.gif" alt="" width="477" height="78" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Servisin &amp;ccedil;alıştırılmasının ardından Web.config dosyasında da &lt;strong&gt;sessionState&lt;/strong&gt; boğumunun &amp;ouml;zelliklerini aşağıdaki gibi değiştirmeliyiz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;sessionState 
    mode="StateServer"
    stateConnectionString="tcpip=127.0.0.1:42424"
    sqlConnectionString="data source=127.0.0.1;integrated security=SSPI"
    cookieless="false" 
    timeout="20" 
/&amp;gt;&lt;/pre&gt;
&lt;p&gt;StateServer modunda, State Server olarak kullanılacak sunucunun &lt;strong&gt;tcpip&lt;/strong&gt; &lt;strong&gt;adresi&lt;/strong&gt; ve ilgili &lt;strong&gt; port&lt;/strong&gt; &lt;strong&gt;numarası&lt;/strong&gt; &lt;strong&gt;stateConnectionString&lt;/strong&gt; &amp;ouml;zelliğinde belirleniz. Biz burada local makineyi kullanıyoruz. Buradaki &lt;strong&gt;42424&lt;/strong&gt; port numarası, ASP.NET State Service servisinin kullandığı varsayılan port numarasıdır. Dilersek bu numarayı değiştirmemiz m&amp;uuml;mk&amp;uuml;n. Bunun i&amp;ccedil;in,sistemdeki registery ayarlarına inmemiz gerekiyor. &lt;span lang="TR" style="font-family: Verdana; color: black;"&gt; &lt;strong&gt;Hot Key Local Machine &lt;/strong&gt;sekmesinde &lt;strong&gt; \System\CurrentControlSet\Services\aspnet_state\Parameters\ &lt;/strong&gt; altındaki &lt;strong&gt;Port&lt;/strong&gt; elemanının değerini değiştirmemiz yeterlidir.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk112_15.gif" alt="" width="628" height="133" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu değişikliklerden sonra Session nesnelerini ASP.NET State Service' ın kontrol&amp;uuml; altında tutulmak &amp;uuml;zere kullanabiliriz. Bu servis yardımıyla tuttuğumuz Session nesneleri i&amp;ccedil;in de &lt;strong&gt;serileştirilebilme şartı&lt;/strong&gt; aranmaktadır, bunuda hatırlatalım.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2005-01-07 22:00:00</pubDate>
  <slug>Derinlemesine-Session-Kullanc4b1mc4b1-2-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet</tag>
    <tag>session</tag>
  </tags>
  <categories>
    <category>Asp.Net</category>
  </categories>
</post>