<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Virtual(Sanal) Metotlar</title>
  <description>Bugünkü  makalemizde sanal metodların kalıtım içerisindeki rolüne bakacağız.  Sanal metodlar, temel sınıflarda tanımlanan ve türeyen sınıflarda geçersiz kılınabilen metodlardır.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bug&amp;uuml;nk&amp;uuml;&amp;nbsp; makalemizde sanal metotların kalıtım i&amp;ccedil;erisindeki rol&amp;uuml;ne bakacağız.&amp;nbsp; Sanal metotlar, temel sınıflarda tanımlanan ve t&amp;uuml;reyen sınıflarda ge&amp;ccedil;ersiz kılınabilen metotlardır. Bu tanım bize pek bir şey ifade etmez aslında. O halde gelin sanal metodların neden kullanırız, once buna bakalım. Bu ama&amp;ccedil;la minik bir &amp;ouml;rnek ile işe başlıyoruz. &amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
namespace

ConsoleApplication1
{
    public class Temel
    {
        public Temel()
        {

        }

        public void Yazdir()
        {
            Console.WriteLine("Ben TEMEL(BASE) sinifim");
        }

    }
    public class Tureyen : Temel
    {
        public Tureyen()
        {

        }
        
        public void Yazdir()
        {
            Console.WriteLine("Ben TUREYEN(DERIVED) sinifim");
            }
    }
    
    class Class1
    {
        static void Main(string[] args)
        {
            Temel bs;
            Tureyen drv =new Tureyen();
            bs = drv;
            bs.Yazdir();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rneği &amp;ccedil;alıştırmadan once satırlarımızı bir inceleyelim.&amp;nbsp; Kodumuz Temel isimli bir base class ve Tureyen isimli bir Derived Class vardır. Her iki sınıf i&amp;ccedil;inde Yazdir isimli iki metod tanımlanmıştır. Main metodu i&amp;ccedil;inde Temel sınıftan t&amp;uuml;rettiğimiz bir nesneye ( bs nesnesi) Tureyen sınıf tipinden bir nesneyi (drv nesnesi) aktarıyoruz. Ardından bs nesnemizin Yazdir isimli metodunu &amp;ccedil;ağırıyoruz. Sizce derleyici hangi sınıfın yazdır metodunu &amp;ccedil;ağıracaktır.&lt;/p&gt;
&lt;p&gt;Drv nesnemiz Tureyen sınıf nesnesi olduğundan ve Temel sınıftan kalıtımsal olarak t&amp;uuml;retildiğinden bs isimli nesnemize aktarılabilmiştir. Şu durumda bs isimli Temel sınıf nesnemiz drv isimli Tureyen sınıf nesnemizi taşımaktadır. Bu tip bir atamam b&amp;ouml;yle base-derived ilişkide sınıflar i&amp;ccedil;in ge&amp;ccedil;erli bir atamadır. Sorun bs isimli nesne i&amp;ccedil;in Yazdir metodunun &amp;ccedil;ağırılmasındadır. Biz burada Tureyen sınıf nesnesini aktardığımız i&amp;ccedil;in bu sınıfa ait Yazdir metodunun &amp;ccedil;alıştırılmasını bekleriz. Oysaki sonu&amp;ccedil; aşağıdaki gibi olucaktır.&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&amp;nbsp;&lt;img src="/makale/images/mk27_1.gif" alt="" width="237" height="70" /&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil&lt;/em&gt; &lt;em style="mso-bidi-font-style: normal;"&gt; 1.&amp;nbsp; Temel Sınıfın Yazdir metodu &amp;ccedil;ağırıldı.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml;&amp;nbsp; gibi Temel sınıfa ait Yazdir metodu &amp;ccedil;alıştırılmıştır.&amp;nbsp; Bir &amp;ccedil;&amp;ouml;z&amp;uuml;m olarak daha &amp;ouml;nceki kalıtım kavramını anlattığımız makalemizde inceledeğimiz new anahtar kelimesini Tureyen isimli derived class i&amp;ccedil;inde kullanmayı d&amp;uuml;ş&amp;uuml;nebilirsiniz. Birde b&amp;ouml;yle deneyelim, bakalım neler olucak. &amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace ConsoleApplication1
{
    public class Temel
    {
        public Temel()
        {
        }

        public void Yazdir()     
        {
            Console.WriteLine("Ben TEMEL(BASE) sinifim");
        }
    }
    public class Tureyen : Temel
    {
        public Tureyen()
        {

        }
        public new void Yazdir()
        {
            Console.WriteLine("Ben TUREYEN(DERIVED) sinifim");
        }
    }
    class Class1
    {
        static void Main(string[] args)
        {
            Temel bs;
            Tureyen drv =new Tureyen();
            bs = drv;
            bs.Yazdir();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Ancak&amp;nbsp; new anahtar kelimesini kullanmış olsakta sonu&amp;ccedil; yine aynı olucaktır ve aşağıdaki g&amp;ouml;r&amp;uuml;nt&amp;uuml;y&amp;uuml; alacağızdır. &amp;nbsp;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk27_1.gif" alt="" width="237" height="70" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil&lt;/em&gt; &lt;em style="mso-bidi-font-style: normal;"&gt; 2.&amp;nbsp; Yine style='mso-spacerun:yes'&amp;gt;&amp;nbsp;Temel Sınıfın Yazdir metodu &amp;ccedil;ağırıldı.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;İşte bu noktada &amp;ccedil;&amp;ouml;z&amp;uuml;m Temel sınıftaki metodumuzu Virtual( sanal) tanımlamak ve aynı metodu, Tureyen sınıf i&amp;ccedil;ersinde Override (Ge&amp;ccedil;ersiz Kılmak) etmektir. Sanal metodların kullanım amacı budur; Base sınıfta yer alan metod yerine base sınıfa aktarılan nesnenin &amp;uuml;retildiği derived class&amp;rsquo;taki metodu &amp;ccedil;ağırmaktır. &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Şimdi&amp;nbsp; &amp;ouml;rneğimizi buna gore değiştirelim. &amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace ConsoleApplication1
{
    public class Temel
    {
        public Temel()
        {
        }
        public virtual void Yazdir()
        {
            Console.WriteLine("Ben TEMEL(BASE) sinifim");
        }
    }

    public class Tureyen : Temel
    {
        public Tureyen()
        {
        }        

        public override void Yazdir()
        {
            Console.WriteLine("Ben TUREYEN(DERIVED) sinifim");
        }
    }

    class Class1
    {
        static void Main(string[] args)
        {
            Temel bs;
            Tureyen drv =new Tureyen();
            bs = drv;
            bs.Yazdir();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;em style="mso-bidi-font-style: normal;"&gt;&lt;img src="/makale/images/mk27_2.gif" alt="" width="239" height="59" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p class="MsoNormal" style="text-align: left;" align="center"&gt;&lt;em style="mso-bidi-font-style: normal;"&gt; Şekil&lt;/em&gt; &lt;em style="mso-bidi-font-style: normal;"&gt; &amp;nbsp;3.&amp;nbsp; Tureyen sınıftaki Yazdir metodu &amp;ccedil;ağırılmıştır.&lt;/em&gt; &amp;nbsp;&lt;/p&gt;
&lt;p&gt;Burada&amp;nbsp; &amp;ouml;nemli olan nokta, Temel sınıfaki metodun virtual anahtar kelimesi ile tanımlanması, Tureyen sınıftaki metodun ise override anahtar kelimesi ile tanımlanmış olmasıdır.&amp;nbsp; Sanal metodları kullanırken dikkat etmemiz gereken bir takım noktalar vardır. Bu noktalar; &amp;nbsp;&lt;/p&gt;
&lt;table id="AutoNumber1" border="1" width="640" cellspacing="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td bgcolor="#CCCCCC" width="26"&gt;1&lt;/td&gt;
&lt;td width="702"&gt;İki&amp;nbsp; metodda aynı isime sahip olmalıdır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#CCCCCC" width="26"&gt;2&lt;/td&gt;
&lt;td width="702"&gt;İki&amp;nbsp; metodda aynı t&amp;uuml;r ve sayıda parametre almalıdır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#CCCCCC" width="26"&gt;3&lt;/td&gt;
&lt;td width="702"&gt;İki&amp;nbsp; metodunda geri d&amp;ouml;n&amp;uuml;ş değerleri aynı olmalıdır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#CCCCCC" width="26"&gt;4&lt;/td&gt;
&lt;td width="702"&gt;Metodların&amp;nbsp; erişim haklarını aynı olmalıdır. Biri public tanımlanmış ise diğeride public olmalıdır.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#CCCCCC" width="26"&gt;5&lt;/td&gt;
&lt;td width="702"&gt;Temel&amp;nbsp; sınıftaki metodu t&amp;uuml;reyen sınıfta override (ge&amp;ccedil;ersiz) hale getimez isek metod ge&amp;ccedil;ersiz kılınamaz.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td bgcolor="#CCCCCC" width="26"&gt;6&lt;/td&gt;
&lt;td width="702"&gt;Sadece&amp;nbsp; virtual olarak tanımlanmış metodları override edebiliriz. Herhangibir base class y&amp;ouml;ntemini tureyen sınıfta override edemeyiz.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Bu noktalara dikkat etmemiz gerekmektedir.&amp;nbsp; Değerli Okurlarım, geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2003-12-25 10:00:00</pubDate>
  <slug>Virtual(Sanal)-Metodlar-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>oop</tag>
    <tag>net</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>