<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Localization (Yerelleştirme) 2 - Dil Desteği</title>
  <description>Bir önceki makalemizde hatırlayacağınız gibi, .net ile geliştirilen uygulamaların belirli kültürler için nasıl yerelleştirilebileceğini incelemeye başlamıştık. İlk bölümde, belirli bir kültürün daha çok sayısal, tarihsel ve sıralama formatları üzerinde durduk. Bu bölümde ise, yerelleştirmede daha da önemli olan bir konuya, uygulamaların farklı dillere göre destek vermesine değineceğiz.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki makalemizde hatırlayacağınız gibi, .net ile geliştirilen uygulamaların belirli k&amp;uuml;lt&amp;uuml;rler i&amp;ccedil;in nasıl yerelleştirilebileceğini incelemeye başlamıştık. İlk b&amp;ouml;l&amp;uuml;mde, belirli bir k&amp;uuml;lt&amp;uuml;r&amp;uuml;n daha &amp;ccedil;ok sayısal, tarihsel ve sıralama formatları &amp;uuml;zerinde durduk. Bu b&amp;ouml;l&amp;uuml;mde ise, yerelleştirmede daha da &amp;ouml;nemli olan bir konuya, uygulamaların farklı dillere g&amp;ouml;re destek vermesine değineceğiz.&lt;/p&gt;
&lt;p&gt;Bir .net uygulamasının farklı dillere destek vermesindeki anahtar nokta, Resource dosyalarının etkin bir şekilde kullanılmasında yatmaktadır. &amp;Ouml;rneğin, uygulamamızın aray&amp;uuml;z&amp;uuml;n&amp;uuml;n T&amp;uuml;rk&amp;ccedil;e olarak oluşturulduğunu d&amp;uuml;ş&amp;uuml;nelim. Bu uygulamaya ait aray&amp;uuml;zdeki metinleri, başka bir dilde sunabilmek i&amp;ccedil;in, ilgili kelimelerin diğer dildeki karşılıklarının bir şekilde assembly tarafından bilinmesi gerekir. Sadece bilinmesi elbette yeterli değildir. Ayrıca, &amp;ccedil;alışan proses i&amp;ccedil;in, aray&amp;uuml;z k&amp;uuml;lt&amp;uuml;r&amp;uuml;n&amp;uuml;nde istenen dile ayarlanması gerekmektedir.&lt;/p&gt;
&lt;p&gt;Şimdi dilerseniz bu işlemlerin nasıl ger&amp;ccedil;ekleştirilebildiğini basit bir uygulama &amp;uuml;zerinde anlamaya &amp;ccedil;alışalım. Uygulamamız aşağıdaki form g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne sahip bir windows uygulaması olacak. Şu anda form &amp;uuml;zerindeki t&amp;uuml;m metinler T&amp;uuml;rk&amp;ccedil;e. Biz uygulamamızı, İngilizce, Fransızca ve Almanca dillerine destek verecek hale getireceğiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk82_1.gif" alt="" width="402" height="202" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 1. Uygulama Form Tasarımımız.&lt;/p&gt;
&lt;p&gt;İlk olarak Resource dosyalarını oluşturacağız. Bu dosyaları, birer s&amp;ouml;zl&amp;uuml;k olarak d&amp;uuml;ş&amp;uuml;nebiliriz. Resource dosyaları XML tabanlı dosyalar olup, temelde verileri anahtar yada isim (key - name) - değer (value) &amp;ccedil;iftleri şeklinde tutmaktadırlar. Bu a&amp;ccedil;ıdan bakıldıklarında bunları Hash Tablolarına benzetebiliriz. Dolayısıyla, uygulamamıza dil desteği sağlamak istiyorsak, ortak isimler (names) belirleyip, ilgili dil i&amp;ccedil;in uygun değerleri atayacağımız dosyalar oluşturmamız gerekecektir. Yani T&amp;uuml;rk&amp;ccedil;e i&amp;ccedil;in bir tane, İngilizce i&amp;ccedil;in bir tane, Almanca i&amp;ccedil;in bir tane ve Fransızca i&amp;ccedil;in bir tane. Bir Resource dosyasını Vs.Net ortamında uygulamaya eklemek i&amp;ccedil;in projeye sağ tıklayıp Add New Item iletişim kutusuna girmemiz ve Assembly Resource File dosya tipini se&amp;ccedil;memiz yeterlidir. Burada &amp;ouml;nemli olan Resource dosyasının isimlendiriliş şeklidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk82_2.gif" alt="" width="531" height="392" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 2. Resource Dosyasının Eklenmesi.&lt;/p&gt;
&lt;p&gt;Dikkat edecek olursanız dosyamızı isimlendiriken tr-TR takısını kullandık. Bu T&amp;uuml;rk&amp;ccedil;e dilini konuşan &amp;Uuml;lkemizi temsil eden belirleyici bir k&amp;uuml;lt&amp;uuml;r kodudur. Dosyanın bu şekilde isimlendirilmesinin sebebi, &amp;ccedil;alışma zamanında, se&amp;ccedil;ilen k&amp;uuml;lt&amp;uuml;re g&amp;ouml;re hangi Resource dosyasındaki kelimelerin y&amp;uuml;kleneceğinin belirlenebilmesidir. Bunu kodlarımızı yazdığımızda daha net bir şekilde a&amp;ccedil;ıklamaya &amp;ccedil;alışacağım. Şimdi dosyamızın name ve value değerlerini girelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk82_3.gif" alt="" width="410" height="143" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 3. Resource1.tr-TR.resx dosyasının i&amp;ccedil;eriği.&lt;/p&gt;
&lt;p&gt;Artık tek yapmamız gereken, diğer diller i&amp;ccedil;inde gerekli olan resx dosyalarını oluşturmak. Bu dosyalarda, name yada key değerlerimiz T&amp;uuml;rk&amp;ccedil;e olacak. Ancak karşılıkları olan kelimeler value değeri olarak belirlenecek. &amp;Ouml;rneğin, Fransızca i&amp;ccedil;in aşağıdaki bilgiler girilecek.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk82_4.gif" alt="" width="528" height="197" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 4. fr-Fr k&amp;uuml;lt&amp;uuml;r&amp;uuml; i&amp;ccedil;in dil bilgilerinin Resource dosyasına girilmesi.&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil; olarak, projemizde aşağıdaki Resource dosyalarının oluşturulması gerekmektedir. Bu sayede, uygulamamız d&amp;uuml;nyanın neresinde olursa olsun, kaynak dosyalarda belirtilen dillere ve k&amp;uuml;lt&amp;uuml;rlere destek verebilecektir. Elbette, her resx dosyasında name alanlarına yazılan T&amp;uuml;rk&amp;ccedil;e kelimelerin diğer dildeki karşılıkları value alanına girilecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk82_5.gif" alt="" width="193" height="204" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 5. Resx dosyalarımız.&lt;/p&gt;
&lt;p&gt;Şimdi uygulama kodlarımızı yazmaya başlayalım. Uygulamamız i&amp;ccedil;in, yerelleştirme s&amp;ouml;z konusu olduğundan, System.Globalization isim alanını ve proses i&amp;ccedil;in k&amp;uuml;lt&amp;uuml;rel &amp;ouml;zellikleri ve dil &amp;ouml;zelliklerini belirleyeceğimizden System.Threading isim alanlarını ilk olarak eklemeliyiz. Bunların yanında, assembly i&amp;ccedil;indeki Resource dosyalarını y&amp;ouml;netebilmemiz i&amp;ccedil;in, ResourceManager sınıfından bir nesneye ihtiyacımız olacaktır. Bu nesne i&amp;ccedil;inde, System.Resources isim alanını uygulamamıza eklemeliyiz. İşte kodlarımız,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void Doldur()
{
    this.textBox1.Text=DateTime.Today.ToLongDateString();
    this.textBox2.Text=DateTime.Now.ToLongTimeString();
    double sayi=121345.4565;
    this.textBox3.Text=sayi.ToString();
}
private void Form1_Load(object sender, System.EventArgs e)
{
    Doldur();
}

private void button1_Click(object sender, System.EventArgs e)
{
    if(comboBox1.SelectedItem.ToString()=="USA")
    {
        Thread.CurrentThread.CurrentUICulture=new CultureInfo("en-US");
        Thread.CurrentThread.CurrentCulture=new CultureInfo("en-US");
    }
    else if(comboBox1.SelectedItem.ToString()=="T&amp;uuml;rkiye")
    {
        Thread.CurrentThread.CurrentUICulture=new CultureInfo("tr-TR");
        Thread.CurrentThread.CurrentCulture=new CultureInfo("tr-TR");
    } 
    else if(comboBox1.SelectedItem.ToString()=="Fran&amp;ccedil;ais")
    {
        Thread.CurrentThread.CurrentUICulture=new CultureInfo("fr-FR");
        Thread.CurrentThread.CurrentCulture=new CultureInfo("fr-FR");
    }
    else if(comboBox1.SelectedItem.ToString()=="Deutschland")
    {
        Thread.CurrentThread.CurrentUICulture=new CultureInfo("de-DE");
        Thread.CurrentThread.CurrentCulture=new CultureInfo("de-DE");
    }

    ResourceManager resM=new ResourceManager("Languages.Resource1",Type.GetType("Languages.Form1").Assembly);
    this.Text=resM.GetString("T&amp;uuml;rk&amp;ccedil;e Dil");
    this.lblDil.Text=resM.GetString("Dil");
    this.lblParasal.Text=resM.GetString("Parasal");
    this.lblSaat.Text=resM.GetString("Saat");
    this.lblTarih.Text=resM.GetString("Tarih");
    this.button1.Text=resM.GetString("G&amp;ouml;ster");
    Doldur();
}&lt;/pre&gt;
&lt;p&gt;Kullanıcı comboBox1 kontrol&amp;uuml;nden bir dil se&amp;ccedil;tiğinde, &amp;ouml;ncelikle uygulamanın aray&amp;uuml;z&amp;uuml;n&amp;uuml;n hangi dili kullanacağı CurrentUICulture &amp;ouml;zelliği ile belirlenmektedir. İşte bu noktada, resource dosyalarımız isimlendirilirken neden k&amp;uuml;lt&amp;uuml;r kodlarının kullanıldığı dahada belirginleşmektedir. Nitekim, bu &amp;ouml;zellik, CultureInfo t&amp;uuml;r&amp;uuml;nden bir nesne alır. Bu nesne belirli bir k&amp;uuml;lt&amp;uuml;r i&amp;ccedil;in oluşturulmaktadır. Bu k&amp;uuml;lt&amp;uuml;r&amp;uuml;n kodu, uygulama tarafından Resource dosyalarının isimlerinde aranır. Yani kullanıcı USA' i se&amp;ccedil;tiğinde, uygulama aray&amp;uuml;z&amp;uuml; i&amp;ccedil;in en-US k&amp;uuml;lt&amp;uuml;r kodu belirlenir. Dolayısıyla, ResourceManager nesnesi, bu k&amp;uuml;lt&amp;uuml;r kodunu i&amp;ccedil;eren Resource dosyasını kullanmaya başlayacaktır.&lt;/p&gt;
&lt;p&gt;If koşullarında, sonraki hamlede, g&amp;uuml;ncel proses' deki sayısal,tarihsel vb... formatlar i&amp;ccedil;in gerekli k&amp;uuml;lt&amp;uuml;r kodu, CurrentCulture &amp;ouml;zelliğine, ilgili k&amp;uuml;lt&amp;uuml;r i&amp;ccedil;in bir CultureInfo nesnesi atanarak ger&amp;ccedil;ekleştirilir. Bizim i&amp;ccedil;in &amp;ouml;nemli olan bir diğer noktada, ResourceManager nesnesinin oluşturuluş şeklidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;ResourceManager resM=new ResourceManager("Languages.Resource1",Type.GetType("Languages.Form1").Assembly);&lt;/pre&gt;
&lt;p&gt;Burada ilk parametre, Resource dosyalarının ana adını işaret etmektedir. Ana adımız &amp;ouml;rneğin Resource1.tr-TR.resx dosyasının baz aldığımızda, belirleyici k&amp;uuml;lt&amp;uuml;r koduna kadar olan kısımdaki dosya adıdır. İkinci parametre ise, Reflection &amp;ouml;zelliklerini kullanır ve g&amp;uuml;ncel assembly' ın tipini alır. Artık elimizde, resource' ları y&amp;ouml;netebileceğimiz bir nesne vardır. Tek yapmamız gereken, uygulama aray&amp;uuml;z&amp;uuml;ndeki text' lere, ResourceManager nesnesinin GetString metodu ile, name (key) alanlarının karşılığı olan değerlerin (value) atanmasıdır. Bunun i&amp;ccedil;in, ResourceManager sınıfının GetString metodunu kullandık.&lt;/p&gt;
&lt;p&gt;Şimdi akla şu soru gelebilir. ResourceManager hangi resx dosyasını, dolayısıyla hangi dili kullanacağını nereden bilecek. İşte bunu sağlayan, az &amp;ouml;nce bahsettiğimiz CurrentThread sınıfının CurrentUICulture &amp;ouml;zelliğidir. Bu &amp;ouml;zelliğe atadığımız belirleyici kod burada devreye girerek, ResourceManager' a hangi resx dosyasını kullanması gerektiğini s&amp;ouml;ylemektedir. Bu a&amp;ccedil;ıklamalardan sonra dilerseniz, uygulamamızı derleyip &amp;ccedil;alıştıralım. Her hangibir dili se&amp;ccedil;tiğimizde, hem formatların hemde aray&amp;uuml;zdeki metinlerin ilgili dile g&amp;ouml;re değiştiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z. İşte aray&amp;uuml;zdeki metinlerin se&amp;ccedil;ilen dildeki karşılıkları, oluşturduğumuz resx dosyalarından, ResourceManager sınıfının GetString metodu ile alınmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk82_7.gif" alt="" width="408" height="208" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 6. Almanca.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk82_6.gif" alt="" width="408" height="208" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 7. İngilizce.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk82_8.gif" alt="" width="408" height="208" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 8. Fransızca&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/Languages.zip"&gt;&amp;Ouml;rnek uygulama i&amp;ccedil;in tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2004-08-07 12:00:00</pubDate>
  <slug>Localization-(Yerellestirme)-2-Dil-Destegi-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>localization</tag>
    <tag>globalization</tag>
    <tag>multi-language</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>