<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>CurrencyManager ile Navigasyon ve Temel Satır İşlemleri</title>
  <description>Bu makalemizde, CurrencyManager sınıfı yardımıyla, bağlantısız katman nesnelerinin işaret ettiği bellek bölgelerindeki veri satırları arasında navigasyon, satır ekleme, satır silme ve satır güncelleme işlemlerinin nasıl gerçekleştirildiğini incelemeye çalışacağız.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, CurrencyManager sınıfı yardımıyla, bağlantısız katman nesnelerinin işaret ettiği bellek b&amp;ouml;lgelerindeki veri satırları arasında navigasyon, satır ekleme, satır silme ve satır g&amp;uuml;ncelleme işlemlerinin nasıl ger&amp;ccedil;ekleştirildiğini incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;Genellikle bir veritabanı uygulamasını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda, var olan satırlar arasında ileri ve geri y&amp;ouml;nl&amp;uuml; hareketler sıklıkla kullanılan işlemler arasında yer almaktadır. Bir windows uygulamasında, bağlantısız katman nesnelerinin sahip olduğu veri k&amp;uuml;melerini, form &amp;uuml;zerinde yer alan &amp;ccedil;eşitli kontroller yardımıyla kullanıcıya sunarız. Ancak zaman zaman, bu veri k&amp;uuml;mesi i&amp;ccedil;inde hareket ederken, veriye bağlı kontrollerinde g&amp;uuml;ncel satıra ait alan bilgilerini g&amp;ouml;stermesini isteriz. Form &amp;uuml;zerine yerleştirilen kontrollerin her biri, bu &amp;ccedil;eşit navigasyon işlemlerine izin veren CurrencyManager isimli nesne &amp;ouml;rneklerine sahiptir. Dolayısıyla navigasyon işlemlerinin bağlı kontrollere yansıması i&amp;ccedil;in, bağlı kontrollere ait CurrencyManager nesnelerinin ilgili &amp;ouml;zelliklerinin kullanılması yeterlidir.&lt;/p&gt;
&lt;p&gt;Bir windows uygulamasını d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;zde, Form &amp;uuml;zerinde yer alan bağlı kontrollerinin t&amp;uuml;m&amp;uuml;n&amp;uuml;n aynı navigasyon hareketlerine izin vermesini istememiz son derece doğaldır. Bu zaten arzu edilen durumdur. Windows Form' larının BindingContext &amp;ouml;zelliği sayesinde, bağlı kontrollerin sahip olduğu CurrencyManager nesne &amp;ouml;rneklerini y&amp;ouml;netebiliriz. Bu y&amp;ouml;netim imkanı, satırlar arasında navigasyon, yeni kayıt ekleme, silme veya g&amp;uuml;ncelleştirme gibi işlemleri yapabilme imkanına sahip olmamızı sağlamaktadır.&amp;nbsp; Konuyu &amp;ccedil;ok y&amp;uuml;zeysel olarak anlattığımız bu kısa a&amp;ccedil;ıklamalardan sonra, olayı daha iyi ve net bir şekilde sim&amp;uuml;le edebilmek amacıyla aşağıdaki Form g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne sahip Windows Uygulamasını tasarlayarak işlemlerimize başlayalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk79_1.gif" alt="" width="309" height="257" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 1. Form tasarımımız.&lt;/p&gt;
&lt;p&gt;Bu windows uygulamasında, Sql sunucusunda yer alan Northwind veritabanında yer alan Personel tablosuna ait veriler g&amp;ouml;sterilecektir. Başlangı&amp;ccedil; olarak, uygulama kodlarımız aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection con;
SqlDataAdapter da;
DataTable dt;

private void Bagla()
{
    lblPersonelID.DataBindings.Add("Text",dt,"PersonelID");
    txtPersonelAd.DataBindings.Add("Text",dt,"PersonelAd");
    txtPersonelSoyad.DataBindings.Add("Text",dt,"PersonelSoyad");
    txtSaatUcreti.DataBindings.Add("Text",dt,"SaatUcreti");
    txtCalismaSuresi.DataBindings.Add("Text",dt,"CalismaSuresi");
}

private void Form1_Load(object sender, System.EventArgs e)
{
    con=new SqlConnection("data source=localhost;initial catalog=Northwind;integrated security=SSPI");
    da=new SqlDataAdapter("SELECT * FROM PERSONEL",con);
    dt=new DataTable("Personel");
    da.Fill(dt);
    Bagla();
}&lt;/pre&gt;
&lt;p&gt;Uygulama kodlarımıza kısaca baktığımızda, Sql sunucusuna bağlanarak Northwind veritabanındaki Personel tablosuna ait t&amp;uuml;m satırları, bir DataTable' a aktardığımızı ve Form &amp;uuml;zerindeki kontrolleride bu veri kaynağına bağladığımızı g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Kontrollerimizi, tablonun ilgili alanlarına bağlarken DataBindings &amp;ouml;zelliğinin Add metodundan yararlanmaktayız.&lt;/p&gt;
&lt;p&gt;Add metodu ilk parametre olarak, veri kaynağındaki ilgili verinin, kontrol&amp;uuml;n hangi &amp;ouml;zelliğine bağlanacağını belirtir. İkinci parametrede bu ilk parametredeki &amp;ouml;zellik i&amp;ccedil;in hangi veri kaynağının kullanılacağı belirtilir. Son olarak &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; parametrede ise, ilk parametrede belirtilen kontrol &amp;ouml;zelliğine, ikinci parametredeki veri kaynağının hangi alanının bağlanacağı belirlenir. B&amp;ouml;ylece, DataTable nesnemizin bellekte işaret ettiği b&amp;ouml;lgedeki satırlara ait alanlar, Form &amp;uuml;zerindeki kontrollere bağlanmış olacaktır. Uygulamamızı bu haliyle derleyip &amp;ccedil;alıştırdığımızda, veri k&amp;uuml;mesindeki ilk satıra ait bilgilerin Form &amp;uuml;zerindeki kontrollere eklendiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk79_2.gif" alt="" width="312" height="256" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 2. Uygulamanın &amp;Ccedil;alışması.&lt;/p&gt;
&lt;p&gt;Şimdi ilk yapmak istediğimiz, veri k&amp;uuml;mesindeki satırlar arasında hareket edebilme imakanına sahip olmaktır. Şu aşamda 4 temel hareketimiz olabilir. Sonraki satıra ge&amp;ccedil;iş, &amp;ouml;nceki satıra ge&amp;ccedil;iş, son satıra ge&amp;ccedil;iş ve ilk satıra ge&amp;ccedil;iş. Bu işlemleri ger&amp;ccedil;ekleştirebilmek i&amp;ccedil;in, Form' umuza ait BindingContext &amp;ouml;zelliğini kullanacağız. Şimdi formumuza 4 adet button kontrol&amp;uuml; ekleyelim ve uygulama kodlarımızı aşağıdaki şekilde geliştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SqlConnection con;
SqlDataAdapter da;
DataTable dt;
CurrencyManager cm;

private void Bagla()
{
    lblPersonelID.DataBindings.Add("Text",dt,"PersonelID");
    txtPersonelAd.DataBindings.Add("Text",dt,"PersonelAd");
    txtPersonelSoyad.DataBindings.Add("Text",dt,"PersonelSoyad");
    txtSaatUcreti.DataBindings.Add("Text",dt,"SaatUcreti");
    txtCalismaSuresi.DataBindings.Add("Text",dt,"CalismaSuresi");
}

private void Form1_Load(object sender, System.EventArgs e)
{
    con=new SqlConnection("data source=localhost;initial catalog=Northwind;integrated security=SSPI");
    da=new SqlDataAdapter("SELECT * FROM PERSONEL",con);
    dt=new DataTable("Personel");
    da.Fill(dt);
    Bagla();
    cm=(CurrencyManager)this.BindingContext[dt];
    lblPozisyon.Text="Guncel Pozisyon ------&amp;gt; "+Convert.ToString(cm.Position+1);
}

private void btnIlkSatiraGotur_Click(object sender, System.EventArgs e)
{
    cm.Position=0;
    lblPozisyon.Text="Guncel Pozisyon ------&amp;gt; "+Convert.ToString(cm.Position+1);
}

private void btnOncekiSatiraGotur_Click(object sender, System.EventArgs e)
{
    cm.Position--;
    lblPozisyon.Text="Guncel Pozisyon ------&amp;gt; "+Convert.ToString(cm.Position+1);
}

private void btnSonrakiSatiraGotur_Click(object sender, System.EventArgs e)
{
    cm.Position++;
    lblPozisyon.Text="Guncel Pozisyon ------&amp;gt; "+Convert.ToString(cm.Position+1);
}

private void btnSonSatiraGotur_Click(object sender, System.EventArgs e)
{
    cm.Position=dt.Rows.Count-1;
    lblPozisyon.Text="Guncel Pozisyon ------&amp;gt; "+Convert.ToString(cm.Position+1);
}&lt;/pre&gt;
&lt;p&gt;Uygulama kodlarımızda en &amp;ouml;nemli nokta, Form &amp;uuml;zerindeki kontrollerin sahip oldukları CurrencyManager nesnelerini elde edebilmek i&amp;ccedil;in, Form' a ait BindingContext &amp;ouml;zelliğinden yararlanmamızdır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;cm=(CurrencyManager)this.BindingContext[dt];&lt;/pre&gt;
&lt;p&gt;Bu satır ile, DataTable veri kaynağına i&amp;ccedil;in bir CurrencyManager nesnesi oluşturulur. Artık navigasyon işlemi i&amp;ccedil;in tek yapmamız gereken, CurrencyManager sınıfına ait Position &amp;ouml;zelliğinin kullanılmasıdır. Bu &amp;ouml;zelliğin değişmesi durumunda, Form &amp;uuml;zerinde yer alan ve DataTable' a ait veri kaynağına bağlı olan t&amp;uuml;m kontrollerin i&amp;ccedil;eriği g&amp;uuml;ncel satıra ait verileri g&amp;ouml;sterecek şekilde değişecektir. &amp;Ouml;rneğin, bir satır ileri gitmek i&amp;ccedil;in Position &amp;ouml;zelliğinin değerini 1 arttırmamız yeterli olurken, son satıra gitmek i&amp;ccedil;in, veri kaynağının sahip olduğu toplam satır sayısını 1 eksiltiriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;cm.Position++;
.
.
.
cm.Position=dt.Rows.Count-1;&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda, satırlar arasında istediğimiz şekilde gezebildiğimizi g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk79_3.gif" alt="" width="312" height="264" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekil 3. Navigasyon.&lt;/p&gt;
&lt;p&gt;CurrencyManager sınıfı yardımıyla yapabileceklerimiz sadece Navigasyon işlemleri ile sınırlı değildir. Ayrıca, satır ekleme, satır silme veya satır g&amp;uuml;ncelleştirme gibi temel tablo işlemlerinide ger&amp;ccedil;ekleştirebiliriz. Yeni bir satır eklemek i&amp;ccedil;in CurrencyManager sınıfına ait, aşağıda prototipi verilen AddNew metodunu kullanırız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public override void AddNew();&lt;/pre&gt;
&lt;p&gt;Uygulamamızda yeni bir satır eklemek i&amp;ccedil;in &amp;ouml;ncelikle aşağıdaki kodları yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void Temizle()
{
    lblPersonelID.Text="";

    for(int i=0;i&amp;lt;this.Controls.Count;i++)
    {
        if(this.Controls[i] is TextBox)
        {
            this.Controls[i].Text="";
        }
    }
}

private void btnYeniSatirEkler_Click(object sender, System.EventArgs e)
{
    cm.AddNew();
    Temizle();
}

private void btnVeritabaninaYaz_Click(object sender, System.EventArgs e)
{
    SqlCommandBuilder cmb=new SqlCommandBuilder(da);
    da.Update(dt);
}&lt;/pre&gt;
&lt;p&gt;Burada, &amp;ouml;nemli olan AddNew metodunun kullanılışından sonra, a&amp;ccedil;ılan yeni satırın o anki veri k&amp;uuml;mesinde yerini alması i&amp;ccedil;in ileri veya geri y&amp;ouml;nl&amp;uuml; bir hareket yapılmasının yeterli olduğudur. Elbette, CurrencyManager yardımıyla, g&amp;uuml;ncel veri k&amp;uuml;mesine eklenen satırların veritabanınada yansıtılabilmesi i&amp;ccedil;in, SqlDataAdapter nesnemize ait Update metodunun &amp;ccedil;alıştırılması gerekmektedir. G&amp;uuml;ncel satırlar &amp;uuml;zerinde değişiklik yapıldığında bu değişikliklerin onaylanabilmesi ve veri k&amp;uuml;mesine yansıyabilmesi i&amp;ccedil;in ya satırlar arasında hareket edilmesi yada aşağıda prototipi verilen EndCurrentEdit metodunun uygulanması gerekir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public override void EndCurrentEdit();&lt;/pre&gt;
&lt;p&gt;Veri k&amp;uuml;mesinden herhangibir satırı silmek istediğimizde ise, aşağıdaki prototipe sahip olan RemoveAt metodunu kullanabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public override void RemoveAt( int index);&lt;/pre&gt;
&lt;p&gt;Bu metod parametre olarak, silinecek satırın indeksini almalıdır. Satır g&amp;uuml;ncelleme ve silme işlemleri i&amp;ccedil;in ilgili kodlarımız ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void btnDegisiklikleriKaydet_Click(object sender, System.EventArgs e)
{
    if(MessageBox.Show("Değişiklikler kaydedilsin mi?", "Değişiklik" , MessageBoxButtons.OKCancel, MessageBoxIcon.Question )==DialogResult.OK)
{
    cm.EndCurrentEdit();
    }
    else
    {
        cm.CancelCurrentEdit();
    }
}

private void btnGuncelSatiriSil_Click(object sender, System.EventArgs e)
{
    cm.RemoveAt(cm.Position);
}&lt;/pre&gt;
&lt;p&gt;Elbette yaptığımız satır ekleme, g&amp;uuml;ncelleme işlemlerini iptal etmek istersek, prototipi aşağıdaki gibi olan CancelCurrentEdit metodunu kullanabiliriz. Bu metod ile o anda yapılan yeni satır ekleme veya g&amp;uuml;ncelleme işleminin oluşturduğu değişikliği geri alabiliriz. Tabiki satırdaki değişiklik EndCurrentEdit metodu ile yada navigasyon hareketi ile onaylanmadıysa. Bu durum sadece satır silme işlemi i&amp;ccedil;in ge&amp;ccedil;erli değildir. Dolayısıyla satır silindiğinde, CancelCurrentEdit bu işlemi geri almaz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public override void CancelCurrentEdit();&lt;/pre&gt;
&lt;p&gt;CurrencyManager sınıfının işimize yarayacak bir ka&amp;ccedil; olayıda vardır. Bunlardan birisi PositionChanged olayıdır. Bu olay g&amp;uuml;ncel satır pozisyonu değiştiğinde &amp;ccedil;alışmaktadır. Uygulamamızdaki pozisyon bilgisini lblPozisyon kontrol&amp;uuml;nde g&amp;ouml;stermek i&amp;ccedil;in kullandığımız kod satırını bu olay i&amp;ccedil;ine yerleştirebiliriz. Elbette &amp;ouml;ncelikle, CurrencyManager nesnemiz i&amp;ccedil;in aşağıdaki kod satırı ile, PositionChanged olayını eklememiz gerekmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;cm.PositionChanged+=new EventHandler(cm_PositionChanged);
.
.
.
private void cm_PositionChanged(object sender, EventArgs e)
{
    lblPozisyon.Text="Guncel Pozisyon ------&amp;gt; "+Convert.ToString(cm.Position+1);
}&lt;/pre&gt;
&lt;p&gt;Bu makalemiz ile, CurrencyManager sınıfının temel metodlarını ve &amp;ouml;zelliklerini inceleyerek, veri k&amp;uuml;meleri &amp;uuml;zerinde navigasyon, ekleme, g&amp;uuml;ncelleme ve silme işlemlerinin nasıl yapıldığını &amp;ouml;ğrenmeye &amp;ccedil;alıştık. Umuyorum ki faydalı bilgiler verebilmişimdir. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/Currency.zip"&gt;&amp;Ouml;rnek uygulama i&amp;ccedil;in tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2004-07-27 06:00:00</pubDate>
  <slug>CurrencyManager-ile-Navigasyon-ve-Temel-Satc4b1r-Islemleri-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>windows-forms</tag>
    <tag>currencymanager</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>