<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>West-World'ün Uzaydan Gelen SQL Server ile Tanışması</title>
  <description>Bizim kuşağın yazılımcıları uzun yıllar boyunca çeşitli çatışmalar içerisinde yer aldılar. Java'mı, .Net mi, SQL mi Oracle'mı, SOA'mı Microservices'mı....Bu ve benzeri tartışmalar uzun yıllar sürecek mi diye düşünürken birden şartlar değişmeye başladı. Mesela Microsoft açık kaynak dünyası ile el sıkıştı, ortaya .Net Core'u koydu. Hatta Java Developers Day'a altın ortak bile oluverdi. Ne alıp veremdikleri vardı ki bu ayrı dünyalarda yaşadıklarını zanneden standart koyucuların...</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/04/sqlonlinux_0.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Renkler ve zevkler tartışılmaz. Hatta d&amp;uuml;nya &amp;ouml;ylesine renkli bir yerdir ki insanlar bazen neyi se&amp;ccedil;eceklerine karar veremeyebilir. Tabii ki işin i&amp;ccedil;erisinde yazılım olunca bu renkler siyah ve beyaz gibi sadece iki se&amp;ccedil;eneğe de indirgenebilmişdir.&lt;/p&gt;
&lt;p&gt;Hatta bu sadece yazılım i&amp;ccedil;in değil donanım i&amp;ccedil;in de s&amp;ouml;z konusu olmuştur. Hep bir kıyaslama vardır. PC'mi Mac'mi, RISC tabanlı mı CISC olanı mı, Intel'mi AMD'mi... Diğer yandan hepinizin bildiği &amp;uuml;zere ben yaşlanmakta olan bir yazılımcıyım. Eski kuşak bir programcı olarak&lt;em&gt;(bir başka deyişle 70li yılların &amp;uuml;r&amp;uuml;n&amp;uuml;&amp;nbsp;bir birey olarak)&amp;nbsp;&lt;/em&gt;benim neslin uzun yıllar i&amp;ccedil;inde yer aldığı &amp;ccedil;atışmaların canlı şahitlerindenim. Hala s&amp;uuml;regelir ya bu sonu gelmez tartışmalar. Sizde i&amp;ccedil;inde yer almışsınızdır mutlaka. Java'mı, .Net mi, SQL'mi Oracle'mı, OOP'mi Functional'mı, SOA'mı Microservices'mı vb diye s&amp;uuml;rer gider.&lt;/p&gt;
&lt;p&gt;Bu ve benzeri tartışmalar daha da s&amp;uuml;recek mi diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;rken&amp;nbsp;şartlar uzun s&amp;uuml;re &amp;ouml;nce değişmeye başladı. Bug&amp;uuml;n bir Mac alıp &amp;uuml;zerindeki Intel tabanlı işlemcide Windows koşturabiliyoruz.&amp;nbsp;Hatta Microsoft a&amp;ccedil;ık kaynak d&amp;uuml;nyası ile &amp;ccedil;oktan el sıkıştı; ortaya .Net Core'u &amp;ccedil;ıkardı. Yanılıyor muyum? Hatta Java Developers Day'a altın ortak bile oluverdi&lt;em&gt;(Yaşıyorsa evet&amp;nbsp;&lt;a href="https://javaday.istanbul/" target="_blank"&gt;şu adrese girip Gold Sponsor kısmına&lt;/a&gt;&amp;nbsp;bir bakın derim)&lt;/em&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Ne alıp veremedikleri vardı ki bu ayrı d&amp;uuml;nyalarda yaşadıklarını zanneden standart koyucuların, b&amp;uuml;y&amp;uuml;k oyucuların. Bu ayrı bir hikaye ama sonu&amp;ccedil;ta bug&amp;uuml;n Linux &amp;uuml;zerinde SQL Server kullanabilir ve hatta C# &amp;uuml;zerinden onunla konuşabilir hale geldik. Barış g&amp;uuml;zel bir şey. İşte g&amp;uuml;n&amp;uuml;n konusu. Linux &amp;uuml;zerine SQL Server kurmak ve bir Web API servisi ile CRUD operasyonlarını deneyimlemek.&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;SQL Server Kurulumu&lt;/h1&gt;
&lt;p&gt;Tabii ki ilk yapılması gereken Linux &amp;uuml;zerine SQL server'ın kurulması. Her zaman ki gibi bu kurulum işleminde de terminalden yararlanacağız. Aşağıdaki komutları arka arkaya &amp;ccedil;alıştırarak işe başlayabiliriz.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;wget -qO- https://packages.microsoft.com/keys/microsoft.asc | sudo apt-key add -
sudo add-apt-repository "$(wget -qO- https://packages.microsoft.com/config/ubuntu/16.04/mssql-server-2017.list)"
sudo apt-get update
sudo apt-get install -y mssql-server&lt;/pre&gt;
&lt;p&gt;Bu adımlardan sonra SQL Server'ın&amp;nbsp;Linux i&amp;ccedil;in konfig&amp;uuml;re edilmesi gerekiyor.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo /opt/mssql/bin/mssql-conf setup&lt;/pre&gt;
&lt;p&gt;Yukarıdaki komut sonrasında karşıma &amp;ccedil;ıkan sorulara baktım ve Developer s&amp;uuml;r&amp;uuml;m&amp;uuml; ile ilerleyeceğimi belirttim&lt;em&gt;(Kuvvetle muhtemel &amp;ouml;lene kadar developer olarak kalacağım :D)&lt;/em&gt;&amp;nbsp;Bana sorulan SA&lt;em&gt;(SQL'in meşhur System Admin kullanıcısı)&lt;/em&gt; i&amp;ccedil;in g&amp;uuml;zelde bir şifre belirledim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/sqlonlinux_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İşlemlerin sorunsuz bir şekilde tamamlandığından emin olmanın yolu tahmin edileceği &amp;uuml;zere SQL Server hizmetinin Linux ortamında &amp;ccedil;alışıp &amp;ccedil;alışmadığından emin olmak. Bunun i&amp;ccedil;in West-World'de aşağıdaki terminal komutunu vermem yeterliydi. Kısaca sistem kontrole mssql-server hizmetinin durumunu soruyoruz. Active durumunda olduğunu g&amp;ouml;rmek yeterli.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;systemctl status mssql-server&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/sqlonlinux_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Sırada&amp;nbsp;Command-Line Tool Kurulumu Var&lt;/h1&gt;
&lt;p&gt;Tabii ki SQL Server'ın West-World'e kurulması yeterli değil. Eğer Windows topraklarında olsaydım b&amp;uuml;y&amp;uuml;k ihtimalle Management Studio gibi bir şey de arayacaktım. Linux tarafında da bu tip bir ara&amp;ccedil; kullanmak m&amp;uuml;mk&amp;uuml;n ama komut satırından da pekala bilin&amp;ccedil;li bir şekilde aynı işlemler halledilebilir. CLI aracının kurulumu i&amp;ccedil;in aşağıdaki komutların &amp;ccedil;alıştırılması yeterli.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;wget -qO- https://packages.microsoft.com/keys/microsoft.asc | sudo apt-key add -
sudo add-apt-repository "$(wget -qO- https://packages.microsoft.com/config/ubuntu/16.04/prod.list)"
sudo apt-get update
sudo apt-get install -y mssql-tools unixodbc-dev
echo 'export PATH="$PATH:/opt/mssql-tools/bin"' &amp;gt;&amp;gt; ~/.bash_profile
echo 'export PATH="$PATH:/opt/mssql-tools/bin"' &amp;gt;&amp;gt; ~/.bashrc
source ~/.bashrc&lt;/pre&gt;
&lt;p&gt;Artık West-World &amp;uuml;zerinde biraz SQLce&lt;em&gt;(eskilerde &lt;a href="https://www.dotnetperls.com/sqlce" target="_blank"&gt;sqlCe&lt;/a&gt;&amp;nbsp;diye bir s&amp;uuml;r&amp;uuml;m de vardı)&lt;/em&gt; konuşmaya başlayabilirim. &amp;Ouml;rneğin bir veritabanı ve tablolarını &amp;uuml;retebilir bu tabloya veri ekleyebilirim. İşte başlamak i&amp;ccedil;in terminalden aşağıdaki komutu vermek yeterli.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sqlcmd -S localhost -U SA -P '...'&lt;/pre&gt;
&lt;p&gt;-S anahtarı sonrası bağlanacağımız sunucuyu, -U sonrası bağlanacak kullanıcıyı ve -P sonrası da bu kullanıcının şifresini belirtiyoruz. West-World g&amp;uuml;zel havadan olsa gerek olduk&amp;ccedil;a ılımlı. Sorunsuz bir şekilde bağlantı isteklerini kabul edip komut satırını kullanımıma a&amp;ccedil;tı. Ben de bu teklifi memnuniyetle karşıladım ve veritabanı oluşturmak i&amp;ccedil;in aşağıdaki komutu kullandım.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;CREATE DATABASE azon
Go&lt;/pre&gt;
&lt;p&gt;var olan veritabanlarını g&amp;ouml;rmek i&amp;ccedil;inse aşağıdaki komutu. Amacım tabii ki de az &amp;ouml;nce oluşturduğum Azon isimli veritabanını sistem i&amp;ccedil;erisinde g&amp;ouml;rebilmekti.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;SELECT Name from sys.Databases
go&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/sqlonlinux_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Derken o an &amp;uuml;zerinde &amp;ccedil;alışılacak veritabanını değiştirmeye ve bir tablo oluşturup ona birka&amp;ccedil; &amp;ouml;rnek veri satırı eklemeye karar verdim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;use azon
go

create table Category(id int,name nvarchar(50))
go

insert into Category values(1,'book');
insert into Category values(2,'movie');
insert into Category values(3,'music');
go
select * from Category
go&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnekte azon isimli bir veritabanı oluşturuluyor. Sonrasında bu veritabanının kullanılacağı belirtiliyor. Use ifadesinin &amp;ccedil;alıştırılması sonrası komut satırından ger&amp;ccedil;ekleştirilecek t&amp;uuml;m işlemler azon veritabanı i&amp;ccedil;in ge&amp;ccedil;erli olacaktır. Category tablosu tamamen deneysel ama&amp;ccedil;lı. id ve name alanlarından oluşuyor. İ&amp;ccedil;ine 3 satır veri ekleniyor ve son olarak t&amp;uuml;m i&amp;ccedil;eriğe bir Select sorgusu atılıyor. Sonu&amp;ccedil;lar West-World i&amp;ccedil;in aşağıdaki gibiydi.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/sqlonlinux_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Doğruyu s&amp;ouml;ylemek gerekirse West-World, SQL Server ile terminal &amp;uuml;zerinden gayet g&amp;uuml;zel bir bi&amp;ccedil;imde anlaşıyordu. Database oluşturulabiliyor, i&amp;ccedil;erisine tablo konulup veriler eklenebiliyordu. Pekiiiii ya bu işin i&amp;ccedil;erisine .Net Core ile yazılmış bir Web API servisini de katabilir miydim? Elebette bu m&amp;uuml;mk&amp;uuml;nd&amp;uuml;. Beni heyecanladıran kısım bunun Linux tabanlı bir sistemde olması.&lt;/p&gt;
&lt;h1&gt;Web API Servisinin Yazılması&lt;/h1&gt;
&lt;p&gt;İşe bir .Net Core Web API servisini oluşturmakla başlamak lazım. Visual Studio Code arabirimini a&amp;ccedil;ıp terminalden aşağıdaki komutları vererek ilerleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new webapi -o Players
cd Players
dotnet add package Microsoft.EntityFrameworkCore.SqlServer --version 2.0.2&lt;/pre&gt;
&lt;p&gt;Players isimli bir Web API uygulamamız var. Entity Framework paketinin SQL Server i&amp;ccedil;in yazılmış s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; kullanıyoruz. Servisin standart Values Controller tipini değiştirmeden &amp;ouml;nce Models isimli bir klas&amp;ouml;r oluşturup i&amp;ccedil;erisine&amp;nbsp;gerekli tipleri ekleyebiliriz. Bir oyuncunun temel &amp;ouml;zelliklerini barındıracak olan Player sınıfı,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ComponentModel.DataAnnotations;

namespace Players.Models  
{
    public class Player
    {
        public int PlayerId { get; set; }
        [Required]
        public string FullName { get; set; }
        [Required]
        public string Team { get; set; }
        [Required]
        public int Level{get;set;}
    }
}&lt;/pre&gt;
&lt;p&gt;ve DbContext tipi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Microsoft.EntityFrameworkCore;

namespace Players.Models  
{
    public class PlayersDbContext 
    : DbContext
    {
        public PlayersDbContext(DbContextOptions&amp;lt;PlayersDbContext&amp;gt; options)
            : base(options)
        {
            this.Database.EnsureCreated();
        }

        public DbSet&amp;lt;Player&amp;gt; Players { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Tipik bir Entity Context sınıfı s&amp;ouml;z konusu. &amp;Ouml;rneğin basit olması a&amp;ccedil;ısından sadece Player sınıfına ait bir veri seti sunuyor ancak siz kendi denemelerinizi yaparken Master-Child ilişkide bir yapı kurgulayabilirseniz daha iyi olabilir. Bu işlemlerin ardından ValuesController sınıfını aşağıdaki gibi değiştirerek ilerleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.AspNetCore.Mvc;
using Players.Models;

namespace Players.Controllers
{
    [Route("fabrica/api/[controller]")]
    public class PlayersController 
        : Controller
    {
        private readonly PlayersDbContext _context;

        public PlayersController(PlayersDbContext context)
        {
            _context = context;
        }

        [HttpGet]
        public IActionResult Get()
        {
            var playerList = _context.Players.ToList();
            return Ok(new { Players = playerList });
        }

        [HttpPost]
        public IActionResult Create([FromBody]Player player)
        {
            if (!ModelState.IsValid)
                return BadRequest(ModelState);
            _context.Players.Add(player);
            _context.SaveChanges();
            return Ok(player);
        }

        [HttpPut("{playerId}")]
        public IActionResult Update(int playerId, [FromBody]Player player)
        {
            if (!ModelState.IsValid)
                return BadRequest(ModelState);
            var findResult = _context.Players.Find(playerId);
            if (findResult == null)
            {
                return NotFound();
            }
            findResult.FullName = player.FullName;
            findResult.Team = player.Team;
            findResult.Level=player.Level;
            _context.SaveChanges();
            return Ok(findResult);
        }

        [HttpDelete("{playerId}")]
        public IActionResult Delete(int playerId)
        {
            var findResult = _context.Players.Find(playerId);
            if (findResult == null)
            {
                return NotFound();
            }
            _context.Remove(findResult);
            _context.SaveChanges();
            return Ok(findResult);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Temel CRUD&lt;em&gt;(Create Read Update Delete)&lt;/em&gt; operasyonlarını i&amp;ccedil;eren bir Controller tipi olduğunu ifade edebiliriz. HTTP'nin POST, PUT, DELETE ve GET operasyonlarına cevap verecek metodlar i&amp;ccedil;ermekte. Bir oyuncu bilgisini veritabanına eklemek i&amp;ccedil;in Create metodu &amp;ccedil;alışıyor. Veri, HTTP talebinin Body kısmından alınmakta&lt;em&gt;([FromBody] kullanımına dikkat)&lt;/em&gt; Benzer durum Update metodu i&amp;ccedil;in de s&amp;ouml;z konusu. HTTP adresinden gelen playerID bilgisi ve paketin Body'sinden &amp;ccedil;ekilen JSON i&amp;ccedil;eriğine g&amp;ouml;re bir g&amp;uuml;ncelleme yapılmakta. Delete metodu sadece adresten gelen playerId bilgisini kullanarak bir silme operasyonunu icra ediyor. Get metodu tahmin edileceği &amp;uuml;zere t&amp;uuml;m oyuncu listesini d&amp;ouml;nd&amp;uuml;rmekte. Elbette t&amp;uuml;m listeyi d&amp;ouml;nd&amp;uuml;rmek &amp;ccedil;ok da tercih edeceğimiz bir y&amp;ouml;ntem değil ama burada amacımız West-World'de SQL Server'ı kullanan bir API servisini .Net Core ile yazmak ;)&lt;/p&gt;
&lt;p&gt;Model, DbContext ve Controller tipleri hazır ama iş hen&amp;uuml;z bitmedi. Entity Framework hizmetinin orta katmana bildirilmesi gerekiyor. Bunun i&amp;ccedil;in Startup.cs sınıfındaki ConfigureServices fonksiyonunu değiştirmeliyiz. Aynen aşağıdaki gibi.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void ConfigureServices(IServiceCollection services)
{
    services.AddMvc();
    var conStr = "Data Source=localhost;Initial Catalog=PlayersDatabase;User ID=sa;Password=P@ssw0rd;";
    services.AddDbContext&amp;lt;PlayersDbContext&amp;gt;(options =&amp;gt; options.UseSqlServer(conStr));
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere AddDbContext fonksiyonunu kullanırken bir connection string tanımı mevcut. Bu West-World'e kurduğum SQL Server'a ulaşabilmek i&amp;ccedil;in gerekli. Diğer yandan generic tip olarak Models klas&amp;ouml;r&amp;uuml;ne eklediğimiz DbContext tipini belirtmekteyiz. Daha iyi olması a&amp;ccedil;ısından kullanıcı bilgilerini konfigurasyondan veya farklı bir ortamdan daha g&amp;uuml;venli bir şekilde almayı deneyebilirsiniz. Konfigurasyonda okuyacaksanız kullanıcı adı ve şifre bilgilerinin kripto edilmiş hallerinin tutulmasında yarar var.&lt;/p&gt;
&lt;h1&gt;Testler&lt;/h1&gt;
&lt;p&gt;Artık testlere başlanabilir. İlk olarak,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet run&lt;/pre&gt;
&lt;p&gt;komutu ile servisi yayına almak gerekiyor. Bundan sonrasında ise GET, POST, PUT, DELETE&amp;nbsp; komutlarını ayrı ayrı deneyimlemek lazım. Ben Postman'den yararlanarak ilgili testleri ger&amp;ccedil;ekleştirdim&lt;em&gt;(Bu arada Postman kullanmamız şart değil. Curl terminal komutunu kullanarak da aynı işlemleri ger&amp;ccedil;ekleştirebilirsiniz ki araştırıp deneyimlemenizi &amp;ouml;neririm)&lt;/em&gt; İlk olarak POST ile birka&amp;ccedil; oyuncu bilgisi ekledim.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;Http metodumuz : POST
Adresimiz : http://localhost:5555/fabrica/api/players
Content-Type değeri application/json
Body'de g&amp;ouml;nderdiğimiz raw tipindeki i&amp;ccedil;erikse &amp;ouml;rneğin
{"FullName":"Red Skins Mayk","Team":"Orlando Pelicans","Level":90}&lt;/pre&gt;
&lt;p&gt;Sonu&amp;ccedil; başarılıydı.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/sqlonlinux_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkati &amp;ccedil;ekici noktaysa ilk isteğe cevap gelmesi i&amp;ccedil;in ge&amp;ccedil;en yaklaşık 16 saniyelik kocaman s&amp;uuml;rey. Bunun veritabanının hen&amp;uuml;z ortada olmayışından kaynaklanan bir durum olduğu aşikar. Nitekim sonraki &amp;ccedil;ağrılarda s&amp;uuml;re 200 milisaniyeler altına indi. Bir ka&amp;ccedil; oyuncu bilgisi daha ekledikten sonra Http GET operasyonu da denedim.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;Http Metodumuz : Get
Adresimiz : http://localhost:5555/fabrica/api/players&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/sqlonlinux_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil;ların başarılı bir şekilde geldiğini g&amp;ouml;rmek olduk&amp;ccedil;a hoş. Hemen bir g&amp;uuml;ncelleme işlemi denemenin tam sırası.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;Http metodumuz : PUT
Adresimiz : http://localhost:5555/fabrica/api/players/1
Content-Type değeri application/json
Body'de g&amp;ouml;nderdiğimiz raw tipindeki i&amp;ccedil;erikse &amp;ouml;rneğin
{"FullName":"Red Skin Mayk","Team":"Houston Motors","Level":55}&lt;/pre&gt;
&lt;p&gt;İşlem başarılıydı. HTTP 200 OK mesajı d&amp;ouml;nm&amp;uuml;şt&amp;uuml;.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/sqlonlinux_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ger&amp;ccedil;ekten de tekrar Http Get talebi g&amp;ouml;nderdiğimde aşağıdaki sonu&amp;ccedil;la karşılaştım. 1 numaralı playerId i&amp;ccedil;eriği istediğim gibi g&amp;uuml;ncellenmişti.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/sqlonlinux_9.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ger&amp;ccedil;i ben Red Skin Mayk'a takmıştım. Onu silmeye de karar verdim.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;Http metodumuz : DELETE
Adresimiz : http://localhost:5555/fabrica/api/players/1&lt;/pre&gt;
&lt;p&gt;delete &amp;ccedil;ağrısının sonucu&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/sqlonlinux_10.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve&amp;nbsp;g&amp;uuml;ncel oyuncu listesinin durumu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/sqlonlinux_11.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Sql Sunucusunda Durum Ne?&lt;/h1&gt;
&lt;p&gt;T&amp;uuml;m bu işlemler kurulu olan SQL sunucusuna da yansımaktadır. Hemen aşağıdaki terminal komutlarını deneyerek ger&amp;ccedil;ekten de orada da bir şeyler olduğunu kendi g&amp;ouml;zlerimizle g&amp;ouml;rebiliriz. West-World'de durum aşağıdaki gibi ger&amp;ccedil;ekleşti.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;sqlcmd -S localhost -U SA -P 'P@ssw0rd'
select name from sys.databases
go
use PlayersDatabase
go
select FullName,Team from Players
go&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/sqlonlinux_12.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu makalede konu West-World a&amp;ccedil;ısından heyecan vericiydi. Uzun yıllar birbirlerini g&amp;ouml;rmeyen iki taraf buluşmuştu. Uygulamaya sizde bir şeyler katabilirsiniz. S&amp;ouml;z gelimi SQL Server'ı Linux ortamınıza kurmak istemediğimizi d&amp;uuml;ş&amp;uuml;nelim. Ne yapabiliriz? Acaba Docker bir &amp;ccedil;&amp;ouml;z&amp;uuml;m olabilir mi? ;) Belki de Docker &amp;uuml;zerinde konuşladıracağımız bir SQL Server hizmetini kullanabiliriz. API servisine de eklenecek bir &amp;ccedil;ok şey olabilir. Bir Data Query servisi haline getirilebilir pekala. Hatta &amp;ccedil;alıştığınız yerde eğer SQL Server kullanıyorsanız ve deneysel ama&amp;ccedil;lı &amp;ccedil;alışmalar yapabileceğiniz bir ortamınız varsa SQL'in Linux &amp;uuml;zerinde .Net Core ile yazılımış servislerle &amp;ccedil;alışması halindeki performans durumlarını da g&amp;ouml;zlemleyebilirsiniz. Her şey sizin elinizde. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;h2&gt;Kaynaklar&lt;/h2&gt;
&lt;p&gt;&lt;a href="https://docs.microsoft.com/en-us/sql/linux/quickstart-install-connect-ubuntu" target="_blank"&gt;Microsoft'un Resmi Dok&amp;uuml;manı&lt;/a&gt;&amp;nbsp;&lt;/p&gt;</content>
  <pubDate>2018-06-26 03:00:00</pubDate>
  <slug>West-Worldun-Uzaydan-Gelen-SQL-Server-ile-Tanısması</slug>
  <tags>
    <tag>net-core</tag>
    <tag>sql-server</tag>
    <tag>linux</tag>
    <tag>sql-on-linux</tag>
    <tag>web-api</tag>
    <tag>service</tag>
    <tag>rest</tag>
    <tag>entity-framework</tag>
    <tag>c#</tag>
    <tag>sql</tag>
    <tag>systemctl</tag>
    <tag>mssql-server</tag>
    <tag>command-line-interface</tag>
    <tag>cli</tag>
    <tag>sqlcmd</tag>
    <tag>dotnet</tag>
    <tag>package</tag>
    <tag>entity-framework-core</tag>
    <tag>dbcontext</tag>
    <tag>httpget</tag>
    <tag>httppost</tag>
    <tag>httpput</tag>
    <tag>post</tag>
    <tag>put</tag>
    <tag>delete</tag>
    <tag>json</tag>
    <tag>testing-framework</tag>
    <tag>postman</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
  </categories>
</post>