<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Thread'lerde Öncelik(Priority) Durumları</title>
  <description>İş parçacıklarını işlediğimiz yazı dizimizin bu üçüncü makalesinde, iş parçacıklarının birbirlerine karşı öncelik durumlarını incelemeye çalışacağız. İş parçacıkları olarak tanımladığımız metodların çalışma şıralarını, sahip oldukları öneme göre değiştirmek durumunda kalabiliriz. Normal şartlar altında, oluşturduğumuz her bir iş parçacığı nesnesi aynı ve eşit önceliğe sahiptir. Bu öncelik değeri Normal olarak tanımlanmıştır. Bir iş parçacığının önceliğini değiştirmek istediğimizde, Priority özelliğinin değerini değiştiririz. Priority özelliğinin .NET Framework'teki tanımı aşağıdaki gibidir.</description>
  <content>&lt;p align="left"&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p align="left"&gt;İş par&amp;ccedil;acıklarını işlediğimiz yazı dizimizin bu &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; makalesinde, iş par&amp;ccedil;acıklarının birbirlerine karşı &amp;ouml;ncelik durumlarını incelemeye &amp;ccedil;alışacağız. İş par&amp;ccedil;acıkları olarak tanımladığımız metodların &amp;ccedil;alışma şıralarını, sahip oldukları &amp;ouml;neme g&amp;ouml;re değiştirmek durumunda kalabiliriz. Normal şartlar altında, oluşturduğumuz her bir iş par&amp;ccedil;acığı nesnesi aynı ve eşit &amp;ouml;nceliğe sahiptir. Bu &amp;ouml;ncelik değeri Normal olarak tanımlanmıştır. Bir iş par&amp;ccedil;acığının &amp;ouml;nceliğini değiştirmek istediğimizde, Priority &amp;ouml;zelliğinin değerini değiştiririz. Priority &amp;ouml;zelliğinin .NET Framework'teki tanımı aşağıdaki gibidir.&lt;/p&gt;
&lt;p align="left"&gt;&lt;strong&gt;public &lt;/strong&gt;ThreadPriority&lt;strong&gt; Priority {get; set;}&lt;/strong&gt;&lt;/p&gt;
&lt;p align="left"&gt;&amp;Ouml;zelliğimiz ThreadPriority numaralandırıcısı (enumerator) tipinden değerler almaktadır. Bu değerler aşağıdaki tabloda verilmiştir.&lt;/p&gt;
&lt;div align="left"&gt;
&lt;table id="AutoNumber1" border="1" width="18%" cellspacing="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#FF0000" width="33%" height="23"&gt;&amp;Ouml;ncelik Değeri&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#FFFFCC" width="33%" height="25"&gt;&lt;strong&gt;Highest&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#FFFFCC" width="33%" height="25"&gt;&lt;strong&gt;AboveNormal&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#FFFFCC" width="33%" height="23"&gt;&lt;strong&gt;Normal&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#FFFFCC" width="33%" height="25"&gt;&lt;strong&gt;BelowNormal&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#FFFFCC" width="33%" height="26"&gt;&lt;strong&gt;Lowest&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p align="left"&gt;&lt;em&gt;Tablo 1. &amp;Ouml;ncelik(Priority) Değerler&lt;/em&gt;i&lt;/p&gt;
&lt;p&gt;Programlarımızı yazarken, iş par&amp;ccedil;acıklarının &amp;ccedil;alışma şekli verilen &amp;ouml;ncelik değerlerine g&amp;ouml;re değişecektir. Elbette tahmin edeceğiniz gibi y&amp;uuml;ksek &amp;ouml;ncelik değerlerine sahip olan iş par&amp;ccedil;acıklarının işaret ettikleri metodlar diğerlerine g&amp;ouml;re daha sık aralıklarda &amp;ccedil;ağırılacak, dolayısıyla d&amp;uuml;ş&amp;uuml;k &amp;ouml;ncelikli iş par&amp;ccedil;acıklarının referans ettiği metodlar daha ge&amp;ccedil; sonlanacaktır. Şimdi olayı daha iyi canlandırabilmek i&amp;ccedil;in aşağıdaki &amp;ouml;rneğimizi geliştirelim. Daha &amp;ouml;nceden s&amp;ouml;ylediğimiz gibi, bir iş par&amp;ccedil;acığının Priority &amp;ouml;zelliğine her hangibir değer vermez isek, standart olarak Normal kabul edilir. Buda t&amp;uuml;m iş par&amp;ccedil;acıklarının varsayılan olarak eşit &amp;ouml;nceliklere sahip olacakları anlamına gelmektedir. Şimdi aşağıdaki formumuzu oluşturalım. Uygulamamız iki iş par&amp;ccedil;acığına sahip. Bu par&amp;ccedil;acıkların işaret ettiği metodlardan birisi 1' den 1000' e kadar sayıp bu değerleri bir label kontrol&amp;uuml;ne yazıyor. Diğeri ise 1000' den 1' e kadar sayıp bu değerleri başka bir label kontrol&amp;uuml;ne yazıyor. Formumuzun g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdakine benzer olmalıdır.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk35_1.gif" alt="" width="229" height="271" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 1. Form Tasarımımız.&lt;/p&gt;
&lt;p align="left"&gt;Şimdide program kodlarımızı yazalım.&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;/* Bu metod 1' den 1000' e kadar sayar ve değerleri lblSayac1 isimli label kontrol&amp;uuml;ne yazar.*/

public void Say1()
{
     for(int i=1;i&amp;lt;1000;++i)
     {
          lblSayac1.Text=i.ToString();
          lblSayac1.Refresh();

 /* Refresh metodu ile label kontrol&amp;uuml;n&amp;uuml;n g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; tazeleriz. B&amp;ouml;ylece herbir i değerinin label kontrol&amp;uuml;nde g&amp;ouml;r&amp;uuml;lebilmesini sağlamış oluyoruz. */
          for(int j=1;j&amp;lt;90000000;++j)
         {
             j+=1;
          }         
     }
}

/* Bu metod 1000' den 1' e kadar sayar ve değerleri lblSayac2 isimli label kontrol&amp;uuml;ne yazar.*/
public void Say2()
{
for(int i=1000;i&amp;gt;=1;i--)
     {
          lblSayac2.Text=i.ToString();
          lblSayac2.Refresh();         
          for(int j=1;j&amp;lt;45000000;++j)
         {
             j+=1;
          }   
     }
} 

/* ThreadStart ve Thread nesnelerimizi tanımlıyoruz. */
ThreadStart ts1;
ThreadStart ts2;
Thread t1;
Thread t2;
private void btnBaslat1_Click(object sender, System.EventArgs e)
{
     /* Metodlarımızı ThreadStart nesneleri ile ilişkilendiriyoruz ve ThreadStart nesnelerimizi oluşturuyoruz.*/
     ts1=new ThreadStart(Say1);
     ts2=new ThreadStart(Say2);

     /* İş par&amp;ccedil;acıklarımızı, ilgili metodların temsil eden ThreadStart nesnelerimiz ile oluşturuyoruz.*/
     t1=new Thread(ts1);
     t2=new Thread(ts2);

     /* İş par&amp;ccedil;acıklarımızı &amp;ccedil;alıştırıyoruz.*/
     t1.Start();
     t2.Start();

     btnBaslat1.Enabled=false;
     btnIptal.Enabled=true;
}

private void btnIptal_Click(object sender, System.EventArgs e)
{
     /* İş par&amp;ccedil;acıklarımızı iptal ediyoruz. */
     t1.Abort();
     t2.Abort();

     btnBaslat1.Enabled=true;
     btnIptal.Enabled=false;
}

private void btnKapat_Click(object sender, System.EventArgs e)
{
     /* Uygulamayı kapatmak istediğimizde, &amp;ccedil;alışan iş par&amp;ccedil;acığı olup olmadığını kontrol ediyoruz. Bunun i&amp;ccedil;in iş par&amp;ccedil;acıklarının IsAlive &amp;ouml;zelliğinin değerlerine bakıyoruz. Nitekim kullanıcının, herhangibir iş par&amp;ccedil;acığı sonlanmadan uygulamayı kapatmasını istemiyoruz. Ya iptal etmeli yada sonlanmalarını beklemeli. İptal ettiğimizde yani Abort metodları &amp;ccedil;alıştırıldığında hatırlayacağınız gibi, iş par&amp;ccedil;acıklarının IsAlive değerleri false durumuna d&amp;uuml;ş&amp;uuml;yordu, yani iptal olmuş oluyorlardı.*/
     if((!t1.IsAlive) &amp;amp;&amp;amp; (!t2.IsAlive))
     {
          Close();
     }
     else
     {
          MessageBox.Show("Hala kapatılamamış iş par&amp;ccedil;acıkları var. L&amp;uuml;tfen bir s&amp;uuml;re sonra tekrar deneyin.");
     }
}&lt;/pre&gt;
&lt;p align="left"&gt;Uygulamamızda şu an i&amp;ccedil;in bir yenilik yok aslında. Nitekim iş par&amp;ccedil;acıklarımız i&amp;ccedil;in bir &amp;ouml;ncelik ayarlaması yapmadık. &amp;Ccedil;&amp;uuml;nk&amp;uuml; size g&amp;ouml;stermek istediğim bir husus var. Bir iş par&amp;ccedil;acığı i&amp;ccedil;in herhangibir &amp;ouml;ncelik ayarı yapmadığımızda bu değer varsayılan olarak Normal dir. Dolayısıyla her iş par&amp;ccedil;acığı eşit &amp;ouml;nceliğe sahiptir. Şimdi &amp;ouml;rneğimizi &amp;ccedil;alıştıralım ve kafamıza g&amp;ouml;re bir yerde iptal edelim.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk35_2.gif" alt="" width="229" height="272" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 2. &amp;Ouml;ncelik değeri Normal.&lt;/p&gt;
&lt;p align="left"&gt;Ben 11 ye 984 değerinde işlemi iptal ettim. Tekrar iş par&amp;ccedil;acıklarını Başlat başlıklı butona tıklayıp &amp;ccedil;alıştırırsak ve yine aynı yerde işlemi iptal edersek, ya aynı sonucu alırız yada yakın değerleri elde ederiz. Nitekim programımızı &amp;ccedil;alıştırdığımızda arka planda &amp;ccedil;alışan işletim sistemine ait pek &amp;ccedil;ok iş par&amp;ccedil;acığıda &amp;ccedil;alışma sonucunu etkiler. Ancak aşağı yukarı aynı veya yakın değerle ulaşırız. Oysa bu iş par&amp;ccedil;acıklarının &amp;ouml;ncelik değelerini değiştirdiğimizde sonu&amp;ccedil;ların &amp;ccedil;ok daha farklı olabilieceğini s&amp;ouml;yleyebiliriz. Bunu daha iyi anlayabilmek i&amp;ccedil;in &amp;ouml;rneğimizi geliştirelim ve iş par&amp;ccedil;acıklarının &amp;ouml;ncelik değerleri ile oynayalım. Formumuzu aşağıdaki gibi tasarlayalım.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk35_3.gif" alt="" width="490" height="271" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 3. Formumuzun yeni tasarımı.&lt;/p&gt;
&lt;p align="left"&gt;Artık iş par&amp;ccedil;acıklarını başlatmadan &amp;ouml;nce &amp;ouml;nceliklerini belirleyeceğiz ve sonu&amp;ccedil;larını incelemeye &amp;ccedil;alışacağız. Kodlarımızı şu şekilde değiştirelim. &amp;Ouml;nemli olan kod satırlarımız,&amp;nbsp; iş par&amp;ccedil;acıklarının Priority &amp;ouml;zelliklerinin değiştiği satırlardır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;/* Bu metod 1' den 1000' e kadar sayar ve değerleri lblSayac1 isimli label kontrol&amp;uuml;ne yazar.*/

public void Say1()
{
     for(int i=1;i&amp;lt;1000;++i)
     {
          lblSayac1.Text=i.ToString();
          lblSayac1.Refresh();

/* Refresh metodu ile label kontrol&amp;uuml;n&amp;uuml;n g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; tazeleriz. B&amp;ouml;ylece herbir i değerinin label kontrol&amp;uuml;nde g&amp;ouml;r&amp;uuml;lebilmesini sağlamış oluyoruz. */
          for(int j=1;j&amp;lt;90000000;++j)
          {
               j+=1;
          }
     }
}

/* Bu metod 1000' den 1' e kadar sayar ve değerleri lblSayac2 isimli label kontrol&amp;uuml;ne yazar.*/

public void Say2()
{
    for(int i=1000;i&amp;gt;=1;i--)
     {
          lblSayac2.Text=i.ToString();
          lblSayac2.Refresh();
          for(int j=1;j&amp;lt;45000000;++j)
          {
               j+=1;
          }
     }
}
 
ThreadPriority tp1;

/* Priority &amp;ouml;ncelikleri ThreadPriority tipindedirler. */
ThreadPriority tp2;

/* OncelikBelirle metodu, kullanıcının TrackBar'da se&amp;ccedil;tiği değerleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alarak, iş par&amp;ccedil;acıklarının Priority &amp;ouml;zelliklerini belirlemektedir. */

public void OncelikBelirle()
{
     /* Switch ifadelerinde, TrackBar kontroll&amp;uuml;n&amp;uuml;n değerine g&amp;ouml;re , ThreadPriority değerleri belirleniyor. */
     switch(tbOncelik1.Value)
     {
          case 1:
          {
               tp1=ThreadPriority.Lowest; /* En d&amp;uuml;ş&amp;uuml;k &amp;ouml;ncelik değeri. */
               break;
          }
          case 2:
          {
               tp1=ThreadPriority.BelowNormal; /* Normalin biraz altı. */
               break;
          }
          case 3:
          {
               tp1=ThreadPriority.Normal; /* Normal &amp;ouml;ncelik değeri. Varsayılan değer budur.*/
               break;
          }
          case 4:
          {
               tp1=ThreadPriority.AboveNormal; /* Normalin biraz &amp;uuml;st&amp;uuml; &amp;ouml;ncelik değeri. */
               break;
          }
          case 5:
          {
               tp1=ThreadPriority.Highest; /* En &amp;uuml;st d&amp;uuml;zey &amp;ouml;ncelik değeri. */
               break;
          }
     }
     switch(tbOncelik2.Value)
     {
          case 1:
          {
               tp2=ThreadPriority.Lowest;
               break;
          }
          case 2:
          {
               tp2=ThreadPriority.BelowNormal;
               break;
          }
          case 3:
          {
               tp2=ThreadPriority.Normal;
               break;
          }
          case 4:
          {
               tp2=ThreadPriority.AboveNormal;
               break;
          }
          case 5:
          {
               tp2=ThreadPriority.Highest;
               break;
          }
         }
         /* İş Par&amp;ccedil;acıklarımıza &amp;ouml;ncelik değerleri aktarılıyor.*/
         t1.Priority=tp1;
         t2.Priority=tp2;
}
/* ThreadStart ve Thread nesnelerimizi tanımlıyoruz. */

ThreadStart ts1;
ThreadStart ts2;

Thread t1;
Thread t2;

private void btnBaslat1_Click(object sender, System.EventArgs e)
{
         /* Metodlarımızı ThreadStart nesneleri ile ilişkilendiriyoruz ve ThreadStart nesnelerimizi oluşturuyoruz.*/
         ts1=new ThreadStart(Say1);
         ts2=new ThreadStart(Say2);

         /* İş par&amp;ccedil;acıklarımızı, ilgili metodların temsil eden ThreadStart nesnelerimiz ile oluşturuyoruz.*/
         t1=new Thread(ts1);
         t2=new Thread(ts2);

         OncelikBelirle(); /* &amp;Ouml;ncelik ( Priority ) değerleri, iş par&amp;ccedil;acıkları Start metodu ile başlatılmadan &amp;ouml;nce belirlenmelidir. */

/* İş par&amp;ccedil;acıklarımızı &amp;ccedil;alıştırıyoruz.*/
         t1.Start();
         t2.Start();
         btnBaslat1.Enabled=false;
         btnIptal.Enabled=true;

         tbOncelik1.Enabled=false;
         tbOncelik2.Enabled=false;
}

private void btnIptal_Click(object sender, System.EventArgs e)
{
         /* İş par&amp;ccedil;acıklarımızı iptal ediyoruz. */

         t1.Abort();
         t2.Abort();
         btnBaslat1.Enabled=true;
         btnIptal.Enabled=false;

         tbOncelik1.Enabled=true;
         tbOncelik2.Enabled=true;
}

private void btnKapat_Click(object sender, System.EventArgs e)
{
	 /* Uygulamayı kapatmak istediğimizde, &amp;ccedil;alışan iş par&amp;ccedil;acığı olup olmadığını kontrol ediyoruz. Bunun i&amp;ccedil;in iş par&amp;ccedil;acıklarının IsAlive &amp;ouml;zelliğinin değerlerine bakıyoruz. Nitekim kullanıcının, herhangibir iş par&amp;ccedil;acığı sonlanmadan uygulamayı kapatmasını istemiyoruz. Ya iptal etmeli yada sonlanmalarını beklemeli. İptal ettiğimizde yani Abort metodları &amp;ccedil;alıştırıldığında hatırlayacağınız gibi, iş par&amp;ccedil;acıklarının IsAlive değerleri false durumuna d&amp;uuml;ş&amp;uuml;yordu, yani iptal olmuş oluyorlardı.*/

     if((!t1.IsAlive) &amp;amp;&amp;amp; (!t2.IsAlive))
     {
          Close();
     } else
     {
          MessageBox.Show("Hala kapatılamamış iş par&amp;ccedil;acıkları var. L&amp;uuml;tfen bir s&amp;uuml;re sonra tekrar deneyin.");
     }
}&lt;/pre&gt;
&lt;p align="left"&gt;Şimdi &amp;ouml;rneğimizi &amp;ccedil;alıştıralım ve birinci iş par&amp;ccedil;acığımız i&amp;ccedil;in en y&amp;uuml;ksek &amp;ouml;ncelik değerini (Highest)&amp;nbsp; ikinci iş par&amp;ccedil;acığımız i&amp;ccedil;inde en d&amp;uuml;ş&amp;uuml;k &amp;ouml;ncelik değerini (Lowest)&amp;nbsp; se&amp;ccedil;elim. Sonu&amp;ccedil;lar aşağıdakine benzer olucaktır.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk35_4.gif" alt="" width="496" height="272" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 4. &amp;Ouml;nceliklerin etkisi.&lt;/p&gt;
&lt;p align="left"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &amp;ouml;ncelikler iş par&amp;ccedil;acıklarının &amp;ccedil;alışmasını olduk&amp;ccedil;a etkilemektedir. Geldik bir makalemizin daha sonuna. Bir sonraki makalemizde iş par&amp;ccedil;acıkları hakkında ilerlemeye devam edeceğiz. G&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-01-05 12:00:00</pubDate>
  <slug>Thread'lerde-Öncelik(Priority)-Durumları-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>thread</tag>
    <tag>thread-priority</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>