<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Yıllar Sonra Yeniden Enum Sabitleri</title>
  <description>İşte bu yazımızda Enum sabitlerinin başımıza dert olabileceği bir kaç vakayı ele almaya çalışıyor olacağız. Öyleyse hızlı bir başlangıç yapalım ve aşağıdaki kod parçasını göz önüne alalım.</description>
  <content>&lt;p&gt;&lt;a href="/pics/blg216_Giris.jpg"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border: 0px;" title="blg216_Giris" src="/pics/blg216_Giris_thumb.jpg" alt="blg216_Giris" width="302" height="202" align="right" border="0" /&gt;&lt;/a&gt; Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Aslında &amp;ccedil;ok şanslı bir insanım. &amp;Ccedil;&amp;uuml;nk&amp;uuml; &amp;ccedil;ocukluğumdan beri tatile gidebiliyorum. Yazlığımızın olduğu &lt;a href="http://www.avsa.com.tr/" target="_blank"&gt;Avşa&lt;/a&gt; adasına her sene iki g&amp;uuml;nl&amp;uuml;ğ&amp;uuml;ne dahi olsa gitmekteyim. İlk yıllarda adaya hareket eden nostaljik gemiler vardı. Bu gemiler yaklaşık olarak altı saat gibi bir s&amp;uuml;rede &lt;strong&gt;İstanbul&lt;/strong&gt;&amp;rsquo; dan adaya ulaşmaktaydı.&lt;/p&gt;
&lt;p&gt;İlerleyen yıllarda hızlandık&amp;ccedil;a deniz y&amp;uuml;zeyinin &amp;uuml;st&amp;uuml;nde y&amp;uuml;kselen kanatlı gemilerle karşılaştık. Ne yazık ki bu hızlı gemiler daha &amp;ccedil;ok dalgasız g&amp;ouml;ller i&amp;ccedil;in yapıldıklarından her t&amp;uuml;r havada gidemiyorlardı.&lt;/p&gt;
&lt;p&gt;Derken bu g&amp;uuml;nlerde &amp;ccedil;ok meşhur olan &lt;strong&gt;Mavi Marmara&lt;/strong&gt; gemisinin seferlere başladığını g&amp;ouml;rd&amp;uuml;k. Ancak bunun &amp;ccedil;ok &amp;ouml;ncesinde deniz otob&amp;uuml;s&amp;uuml; seferleri de başlamıştı. Deniz otob&amp;uuml;sleri ile adaya 3 saat gibi bir s&amp;uuml;rede gidilebiliyordu. Tabi k&amp;ouml;t&amp;uuml; hava koşullarında&lt;em&gt;(&amp;ouml;zellikle fırtınalı g&amp;uuml;nlerde)&lt;/em&gt;, hır&amp;ccedil;ın &lt;strong&gt;Marmara Denizinde &lt;/strong&gt;bu gemilerle seyahet etmekte ayrı bir maceraydı. &amp;Ccedil;ok sık başıma gelen bir durum du. Hemen her yaz, en az bir veya iki kere fırtınaya yakalanıyordum.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/Exclamation_7.gif"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border: 0px;" title="Exclamation" src="/pics/Exclamation_thumb_7.gif" alt="Exclamation" width="48" height="48" align="left" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Tabi Avşa adasına ulaşmanın tek yolu gemi ve deniz otob&amp;uuml;s&amp;uuml; değil. &lt;strong&gt;Tekirdağ&lt;/strong&gt; ve &lt;strong&gt;Silivri&lt;/strong&gt; &amp;uuml;zerinden de araba taşıyan motorlar ile de gidebilirsiniz. &amp;Uuml;stelik bu motorların ağırlık merkezleri ve tasarımları nedeniyle, katamaran tipinden olan deniz otob&amp;uuml;slerine g&amp;ouml;re daha az salladıklarını ifade edebilirim. Bir diğer yolda &lt;strong&gt;Yenikapı&amp;rsquo;&lt;/strong&gt; dan hızlı feribot ile &lt;strong&gt;Bandırma&amp;rsquo; &lt;/strong&gt;ya ge&amp;ccedil;mek, oradan yarım saatlik bir yol ile &lt;strong&gt;Erdek&lt;/strong&gt; limanına gelmek ve yine araba taşıyan gemilerle Avşa adasına ulaşmaktır.&lt;/p&gt;
&lt;p&gt;Yine b&amp;ouml;yle fırtınalı bir g&amp;uuml;nd&amp;uuml; ve ben &lt;strong&gt;Bizitek&lt;/strong&gt; firmasında hen&amp;uuml;z &lt;strong&gt;Junior&lt;/strong&gt; geliştiriciydim. Şirketimin bana tahsis ettiği &lt;strong&gt;IBM R-51&lt;/strong&gt; diz &amp;uuml;st&amp;uuml; bilgisayarımı kullanmaktaydım. &lt;strong&gt;Avşa&lt;/strong&gt;&amp;rsquo; dan d&amp;ouml;nd&amp;uuml;ğ&amp;uuml;m bir pazar g&amp;uuml;n&amp;uuml; yine &amp;ccedil;ok fırtınalı bir havaya denk geldim. Kusanlar, bağırıp &amp;ccedil;ağıranlar, panikleyenler&amp;hellip;A&amp;ccedil;ık&amp;ccedil;ası benim de &amp;ccedil;ok hoşuma giden bir durum değil di&lt;em&gt;(Zaten deniz otob&amp;uuml;s&amp;uuml;ne bindiğinizde kaptanınız &amp;ldquo;A&amp;ccedil;ıkta Deniz vardır!Rahatsız olanların binmemesi &amp;ouml;nemle rica olunur!&amp;rdquo; derse, ve bunu sinirli bir şekilde s&amp;ouml;ylerse durum vahimdir)&lt;/em&gt; Derken koltuğunda dimdik oturup, sağ sola bakmadan ince bir kitap okuyan bir yolcu ile g&amp;ouml;z g&amp;ouml;ze geldim. Bana &lt;strong&gt;&amp;ldquo;S&amp;uuml;r&amp;uuml;kleyici bir kitap&amp;hellip;Fırtınayı unutturuyor&amp;hellip;&amp;rdquo;&lt;/strong&gt; dedi. Bu s&amp;ouml;zden etkilenmiştim. Ne yaptım dersiniz? Laptop&amp;rsquo; umu a&amp;ccedil;tım ve&amp;nbsp;&lt;a href="/post/Numaraland%C4%B1r%C4%B1c%C4%B1lar%C4%B1-Kullanmak-Icin-Bir-Sebep-bsenyurt-com-dan" target="_blank"&gt;Numaralandırıcıları Kullanmak İ&amp;ccedil;in Bir Sebep&lt;/a&gt; başlıklı makalemi yazdım.&lt;/p&gt;
&lt;p&gt;Bu makalemde Asp.Net tabanlı bir web uygulamasında &lt;strong&gt;DataGrid&lt;/strong&gt; ve &lt;strong&gt;Enum&lt;/strong&gt; sabitlerinin kullanımına değinmekteydim. Bu aslında, &lt;strong&gt;.Net Framework&lt;/strong&gt;&amp;rsquo; &amp;uuml;n 5 temel tipinden birisi olan &lt;strong&gt;Enum&lt;/strong&gt; sabitleri ile&lt;em&gt;(Diğerleri Class, Struct, Interface, Delegate tipleridir)&lt;/em&gt; belki de en &amp;ouml;nemli haşır neşir oluşumdu. Derken bir sene sonrasında bu kez &lt;strong&gt;Netron&lt;/strong&gt; firmasında eğitmen olarak g&amp;ouml;rev yapmaktayken&amp;nbsp;&lt;a href="/post/C-Temelleri-Enum-Sabitinin-Bilinmeyen-Yonleri-bsenyurt-com-dan.aspx" target="_blank"&gt;C# Temelleri : Enum Sabitinin Bilinmeyen Y&amp;ouml;nleri&lt;/a&gt; isimli makalemi yayınladım. Bu sefer Enum sabitlerini daha detaylı inceliyor ve &amp;ouml;zellikle Enum tipi &amp;uuml;zerinden erişilen &amp;uuml;yeler yardımıyla nasıl işlemler yapılabileceğini ele alıyordum.&lt;/p&gt;
&lt;p&gt;Sene oldu &lt;strong&gt;2010&lt;/strong&gt;. Hatta &lt;strong&gt;2010&lt;/strong&gt; yılının ikinci yarısının başındayız. &lt;strong&gt;Enum&lt;/strong&gt; sabitleri ile uğraşmayalı da hayli zaman olmuş aslında. İşte bu yazımızda &lt;strong&gt;Enum&lt;/strong&gt; sabitlerinin başımıza dert olabileceği bir ka&amp;ccedil; vakayı ele almaya &amp;ccedil;alışıyor olacağız. &amp;Ouml;yleyse hızlı bir başlangı&amp;ccedil; yapalım ve aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace HelloAgainEnums 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            for (int i = 0; i &amp;lt; 5; i++) 
            { 
                Test(); 
            } 
        }

        private static void Test() 
        { 
            Console.WriteLine("StockLevel değerini giriniz"); 
            int userInput = Int32.Parse(Console.ReadLine()); 
            StockLevel sLevel = (StockLevel)userInput; 
            Console.WriteLine(sLevel); 
        } 
    }

    enum StockLevel 
    { 
        Empty, 
        Low, 
        High 
    } 
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnek kod par&amp;ccedil;asında &lt;strong&gt;StockLevel&lt;/strong&gt; isimli bir &lt;strong&gt;enum&lt;/strong&gt; sabiti kullanılmaktadır. Bu sabitin &lt;strong&gt;Empty&lt;/strong&gt;, &lt;strong&gt;Low &lt;/strong&gt;ve &lt;strong&gt;High&lt;/strong&gt; isimli 3 değeri bulunmaktadır. Bilindiği &amp;uuml;zere &lt;strong&gt;enum&lt;/strong&gt; sabiti değerleri varsayılan olarak &lt;strong&gt;0 &lt;/strong&gt;sayısalından başlamaktadır. Kodun kritik olan kısmı &lt;strong&gt;Test&lt;/strong&gt; metodunun i&amp;ccedil;eriğidir. Dikkat edileceği &amp;uuml;zere kullanıcıdan sayısal bir değer girilmesi istenmektedir. Bu değer &lt;strong&gt;userInput&lt;/strong&gt; isimli &lt;strong&gt;int&lt;/strong&gt; tipinden değişken i&amp;ccedil;erisine alınmaktadır. &amp;Ouml;nemli olan nokta &lt;strong&gt;userInput&lt;/strong&gt; değişkeninin &lt;strong&gt;bilin&amp;ccedil;li(Explicitly)&lt;/strong&gt; olarak &lt;strong&gt;StockLevel&lt;/strong&gt; tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmesidir. Bu m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. &lt;strong&gt;Derleme(Compile)&lt;/strong&gt; veya &lt;strong&gt;&amp;Ccedil;alışma Zamanında(Runtime) &lt;/strong&gt;herhangibir hata oluşmayacaktır. Mı acaba? Gelin &amp;ouml;rnek bir &amp;ccedil;alışma zamanı &amp;ccedil;ıktısına bakalım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg216_Case1Runtime1.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg216_Case1Runtime1" src="/pics/blg216_Case1Runtime1_thumb.gif" alt="blg216_Case1Runtime1" width="284" height="234" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;İlk &amp;uuml;&amp;ccedil; denemede &lt;strong&gt;2, 1&lt;/strong&gt; ve &lt;strong&gt;0&lt;/strong&gt; değerleri girilmiştir. Ancak son iki denemede aslında &lt;strong&gt;enum&lt;/strong&gt; sabiti i&amp;ccedil;erisinde olmayan değerlerin girildiği g&amp;ouml;r&amp;uuml;lmektedir. Kod hata vermemiştir. D&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi başarılı olmuştur. Ancak kavramsal olarak bir hata vardır. &lt;strong&gt;Enum sabitine ait olmayan&lt;/strong&gt; bir takım değerler ile &amp;ccedil;alışılmaktadır. &amp;Ccedil;ok tabi olarak &lt;strong&gt;enum&lt;/strong&gt; sabitlerini kullanan pek &amp;ccedil;ok geliştirici bu detayı g&amp;ouml;z ardı etmiş olabilir. Peki ya &amp;ccedil;&amp;ouml;z&amp;uuml;m nedir?. &lt;strong&gt;Test &lt;/strong&gt;metodunu aşağıdaki gibi değiştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private static void Test() 
{ 
	Console.WriteLine("StockLevel değerini giriniz"); 
	int userInput = Int32.Parse(Console.ReadLine()); 
	if (Enum.IsDefined(typeof(StockLevel), userInput)) 
	{ 
		StockLevel sLevel = (StockLevel)userInput; 
		Console.WriteLine(sLevel); 
	} 
	else 
	{ 
		Console.WriteLine("Girilen sayısal değer StockLevel enum sabiti i&amp;ccedil;erisinde yer almamaktadır."); 
	} 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Enum&lt;/strong&gt; sınıfı &amp;uuml;zerinden erişilebilen &lt;strong&gt;IsDefined&lt;/strong&gt; metodu ilk parametre olarak &lt;strong&gt;enum&lt;/strong&gt; &lt;strong&gt;sabiti&lt;/strong&gt; tipini almaktadır. Bu nedenle &lt;strong&gt;typeof&lt;/strong&gt; operat&amp;ouml;r&amp;uuml; kullanılmıştır. İkinci parametre &lt;strong&gt;object&lt;/strong&gt; tipindendir ve kullanıcının girdiği &lt;strong&gt;int&lt;/strong&gt; değeri taşımaktadır. &lt;strong&gt;Metod&lt;/strong&gt;, &lt;strong&gt;StockLevel enum sabiti i&amp;ccedil;erisinde userInput ile girilen değerin var olup olmadığına&lt;/strong&gt; &lt;strong&gt;bakmakta&lt;/strong&gt; ve buna g&amp;ouml;re &lt;strong&gt;true&lt;/strong&gt; veya &lt;strong&gt;false&lt;/strong&gt; değer d&amp;ouml;nd&amp;uuml;rmektedir. Tabiki if kontrol&amp;uuml; i&amp;ccedil;erisinde bilin&amp;ccedil;li olarak d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi yapılması şart değildir. &lt;strong&gt;Enum&lt;/strong&gt; sınıfının &lt;strong&gt;Parse&lt;/strong&gt; metodu kullanılabilir. Hatta &lt;strong&gt;TryParse&lt;/strong&gt; metodundan yararlanılarak, d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme başarılı olduğu takdirde değer atanması yapılması da sağlanabilir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/Question_1.gif"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border: 0px;" title="Question" src="/pics/Question_thumb_1.gif" alt="Question" width="48" height="48" align="left" border="0" /&gt;&lt;/a&gt; Aslında &lt;strong&gt;Enum&lt;/strong&gt; sınıfının &lt;strong&gt;Parse&lt;/strong&gt; ve &lt;strong&gt;TryParse&lt;/strong&gt; kullanımları ile &lt;strong&gt;IsDefined&lt;/strong&gt; &amp;ccedil;ağrımına gereksinimin ortadan kalkabileceğini ifade edebilir miyiz? Bunu bir d&amp;uuml;ş&amp;uuml;n&amp;uuml;n ve araştırın.&lt;/p&gt;
&lt;p&gt;Gelelim diğer bir vakaya. Normal şartlarda &lt;strong&gt;Enum&lt;/strong&gt; sabitleri i&amp;ccedil;erisine yazılan değerler i&amp;ccedil;in sayısal atamada bulunulmaz. Varsayılan değerler ne ise bunlar kullanılmaktadır. Buna g&amp;ouml;re ilk sabit değeri &lt;strong&gt;0&lt;/strong&gt; ile başlar ve diğerleri de otomatik olarak artarak devam eder. Ne varki &lt;strong&gt;0&lt;/strong&gt; değerinin kullanımı ile ilişkili bir durum vardır. Aşağıdaki kod &amp;ouml;rneğini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace HelloAgainEnums 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            Product prd = new Product(); 
            Console.WriteLine(prd.ToString()); 
        } 
    }

    class Product 
    { 
        public int ProductId { get; set; } 
        public string Name { get; set; } 
        public decimal ListPrice { get; set; } 
        public bool InStock { get; set; }

        public override string ToString() 
        { 
            return String.Format("{0} {1}  ({2}) {3}", ProductId, Name, ListPrice.ToString("C2"),InStock); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Bu kod par&amp;ccedil;asında &lt;strong&gt;Product&lt;/strong&gt; sınıfına ait bir nesne &amp;ouml;rneğinin varsayılan&lt;strong&gt; yapıcı metod(Default Constructor)&lt;/strong&gt; ile &amp;uuml;retildiği ve &lt;strong&gt;ezilmiş(Override) ToString&lt;/strong&gt; fonksiyonu ile de i&amp;ccedil;eriğinin ekrana yazdırıldığı g&amp;ouml;r&amp;uuml;lmektedir. Temelleri hatırlayacak olursak, bu tip bir durumda sınıf &amp;uuml;yelerine varsayılan değerler atanacaktır. Sayısal değerler i&amp;ccedil;in &lt;strong&gt;0&lt;/strong&gt;, kayan noktalı sayısal değerler i&amp;ccedil;in &lt;strong&gt;0.0&lt;/strong&gt;, &lt;strong&gt;bool&lt;/strong&gt; değerler i&amp;ccedil;in &lt;strong&gt;false&lt;/strong&gt;, &lt;strong&gt;referans&lt;/strong&gt; &lt;strong&gt;tipleri&lt;/strong&gt; i&amp;ccedil;inse &lt;strong&gt;null&lt;/strong&gt;. Dolayısıyla &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg216_ClassDefaultValues.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg216_ClassDefaultValues" src="/pics/blg216_ClassDefaultValues_thumb.gif" alt="blg216_ClassDefaultValues" width="282" height="65" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Peki ya aşağıdaki gibi bir kod s&amp;ouml;z konusu olduğunda.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace HelloAgainEnums 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            Product prd = new Product(); 
            Console.WriteLine(prd.ToString()); 
        } 
    }

    class Product 
    { 
        public int ProductId { get; set; } 
        public string Name { get; set; } 
        public decimal ListPrice { get; set; } 
        public bool InStock { get; set; } 
        public StockLevel Level { get; set; }

        public override string ToString() 
        { 
            return String.Format("{0} {1}  ({2}) {3} {4}", ProductId, Name, ListPrice.ToString("C2"),InStock,Level); 
        } 
    }

    enum StockLevel 
    { 
        Empty=10, 
        Low=12, 
        High=18 
    } 
}&lt;/pre&gt;
&lt;p&gt;Bu sefer &lt;strong&gt;StockLevel&lt;/strong&gt; isimli &lt;strong&gt;Enum&lt;/strong&gt; sabitinde varsayılan değerler kullanılmamıştır. Bunun yerine &lt;strong&gt;10, 12&lt;/strong&gt; ve &lt;strong&gt;18&lt;/strong&gt; değerleri verilmiştir. Diğer yandan &lt;strong&gt;Product&lt;/strong&gt; isimli sınıfta &lt;strong&gt;StockLevel&lt;/strong&gt; tipinden &lt;strong&gt;Level&lt;/strong&gt; &lt;strong&gt;&amp;ouml;zelliğinin(Property)&lt;/strong&gt; bulunduğu g&amp;ouml;zden ka&amp;ccedil;mamalıdır. Az &amp;ouml;nceki kod par&amp;ccedil;asında sınıfların &amp;uuml;yelerinin, aksine bir işlem yapılmadık&amp;ccedil;a varsayılan değerlere atandığını g&amp;ouml;rm&amp;uuml;şt&amp;uuml;k. Bu durumda &lt;strong&gt;Level&lt;/strong&gt; &amp;ouml;zelliğinin değeri aşağıdaki ekran &amp;ccedil;ıktısındaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg216_Case2Runtime.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg216_Case2Runtime" src="/pics/blg216_Case2Runtime_thumb.gif" alt="blg216_Case2Runtime" width="291" height="72" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;İşte istemediğimiz bir durum. Bu nedenle 0 varsayılan değerinin enum sabitleri i&amp;ccedil;erisinde &lt;strong&gt;mutlaka kullanılması gerektiğini&lt;/strong&gt; ifade edebiliriz. Tabi &amp;ccedil;&amp;ouml;z&amp;uuml;mlerden birisi, &lt;strong&gt;enum&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt;Unknown&lt;/strong&gt; gibi &lt;strong&gt;0&lt;/strong&gt; değerine set edilmiş bir sabit kullanmaktır.&lt;/p&gt;
&lt;p&gt;Yazımızda Enum sabitleri ile alakalı iki &amp;ouml;nemli vakayı incelemeye &amp;ccedil;alıştık. Şimdi ilk vakamıza tekrar d&amp;ouml;n&amp;uuml;ş yapıyor olacağız ve konuyu farklı bir a&amp;ccedil;ıdan değerlendirmeye &amp;ccedil;alışacağız. &lt;strong&gt;Enum&lt;/strong&gt; sabitleri ile &lt;strong&gt;int&lt;/strong&gt; tipleri arasındaki d&amp;ouml;n&amp;uuml;ş&amp;uuml;mlerde &lt;strong&gt;cast&lt;/strong&gt; operat&amp;ouml;rlerinin kullanılması aslında birbirlerine kuvvetle bağlı yapılar oldukları i&amp;ccedil;in sorunlara neden olabilmektedir. S&amp;ouml;z gelimi &lt;strong&gt;enum&lt;/strong&gt; sabitlerinin &lt;strong&gt;int&lt;/strong&gt; karşılıklarının bir veri kaynağında tutulduğu durumlarda, enum sabiti i&amp;ccedil;erisinde veya veri kaynağındaki sayısal değerlerde yapılacak değişikliker, istenmeyen sonu&amp;ccedil;lara neden olabilmektedir. Bu nedenle belki de &lt;strong&gt;enum&lt;/strong&gt; sabitleri ile &lt;strong&gt;int&lt;/strong&gt; değerler arasındaki d&amp;ouml;n&amp;uuml;şt&amp;uuml;rmelerde farklı bir &amp;ccedil;&amp;ouml;z&amp;uuml;m yoluna gidilmelidir. Hatta olayı sadece int ile enum sabitleri arasında bir d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme olarak d&amp;uuml;ş&amp;uuml;nmeyebiliriz de. S&amp;ouml;z gelimi sayı ve harflerden oluşan &lt;strong&gt;string&lt;/strong&gt; bir ifadenin de, bir &lt;strong&gt;enum&lt;/strong&gt; sabiti değerine karşılık gelmesini isteyebiliriz. Durumu daha net bir şekilde kavrayabilmek adına dilerseniz aşağıdaki kod i&amp;ccedil;eriğini bir g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg216_Case3ClassDiagram.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg216_Case3ClassDiagram" src="/pics/blg216_Case3ClassDiagram_thumb.gif" alt="blg216_Case3ClassDiagram" width="298" height="400" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Collections.Generic;

namespace ClientApp 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            for (int i = 0; i &amp;lt; 4; i++) 
            { 
                Test(); 
            } 
        } 
        static void Test() 
        { 
            Console.WriteLine("Kategori kodunu giriniz"); 
            string categoryCode = Console.ReadLine(); 
            Category ctgry = CategoryInterpretter.GetCategory(categoryCode); 
            Console.WriteLine(ctgry.ToString()); 
        } 
    }

    public static class CategoryInterpretter 
    { 
        private static readonly Dictionary&amp;lt;string, Category&amp;gt; _categories =new Dictionary&amp;lt;string,Category&amp;gt; 
        { 
            {"ALF-1",Category.Book}, 
            {"ALF-2",Category.Electronic}, 
            {"ALF-3",Category.Computer}, 
            {"ALF-4",Category.Software}, 
            {"ALF-5",Category.Toys}, 
            {"ALF-6",Category.Hardware} 
        }; 
        public static Category GetCategory(string code) 
        { 
            Category result; 
            if (_categories.TryGetValue(code, out result)) 
                result = _categories[code]; 
            else 
                result = Category.Unknown; 
            return result; 
        } 
    }

    public enum Category 
    { 
        Unknown, 
        Electronic, 
        Computer, 
        Software, 
        Hardware, 
        Book, 
        Toys, 
    } 
}&lt;/pre&gt;
&lt;p&gt;Şimdi &amp;ouml;rnek uygulamamızda neler yaptığımıza bir bakalım. &lt;strong&gt;CategoryInterpretter&lt;/strong&gt; isimli &lt;strong&gt;static&lt;/strong&gt; sınıf i&amp;ccedil;erisinde değişmez olarak tanımlanmış &lt;strong&gt;private&lt;/strong&gt; erişim belirleyicisine sahip bir &lt;strong&gt;Dictionary&amp;lt;string,Category&amp;gt;&lt;/strong&gt; koleksiyonu bulunmaktadır. Bu koleksiyonunun &lt;strong&gt;key&lt;/strong&gt; verileri &lt;strong&gt;string&lt;/strong&gt; olup, &lt;strong&gt;Category&lt;/strong&gt; &lt;strong&gt;enum&lt;/strong&gt; tipi i&amp;ccedil;erisindeki birer sabite karşılık gelmektedir. Bunun dışında &lt;strong&gt;GetCategory&lt;/strong&gt; isimli &lt;strong&gt;static&lt;/strong&gt; metod, parametre olarak gelen &lt;strong&gt;string&lt;/strong&gt; bilginin karşılığını &lt;strong&gt;enum&lt;/strong&gt; sabiti i&amp;ccedil;erisinden getirmek &amp;uuml;zere oluşturulmuştur. Bu sayede &lt;strong&gt;ALF-1=Category.Book&lt;/strong&gt; gibi bir eşleştirme yapılabilmesi kavramsal olarak m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Uygulamanın &amp;ccedil;alışma zamanı &amp;ccedil;ıktısına baktığımızda aşağıdaki &amp;ouml;rnek sonu&amp;ccedil;lar ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg216_Case3Runtime.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg216_Case3Runtime" src="/pics/blg216_Case3Runtime_thumb.gif" alt="blg216_Case3Runtime" width="267" height="194" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere ilk 3 deneme de başarılı &amp;ccedil;evirmeler yapılmıştır. Son denemede girilen &lt;strong&gt;string&lt;/strong&gt; bilgi(AADAD), &lt;strong&gt;Dictionary&amp;lt;string,Category&amp;gt; &lt;/strong&gt;tipi i&amp;ccedil;erisinde var olmadığından, varsayılan olarak &lt;strong&gt;Category.Unknown&lt;/strong&gt; değeri elde edilmiştir. Bu &lt;strong&gt;GetCategory&lt;/strong&gt; metodu i&amp;ccedil;erisinde alınmış bir tedbirdir. Aslında &lt;strong&gt;TryGetValue&lt;/strong&gt; metodunun kullanılmaması halinde &amp;ccedil;alışma zamanına &lt;strong&gt;KeyNotFoundException &lt;/strong&gt;tipinden bir istisna fırlatılacaktır ki bu da hatalı veri girişlerine karşılık bir &amp;ccedil;&amp;ouml;z&amp;uuml;m olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg216_Case3Exception.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg216_Case3Exception" src="/pics/blg216_Case3Exception_thumb.gif" alt="blg216_Case3Exception" width="643" height="196" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Bu yazımızda yıllar sonrasında Enum sabiti kavramına tekrardan d&amp;ouml;n&amp;uuml;ş yaparak farklı a&amp;ccedil;ılardan ele almaya &amp;ccedil;alıştık. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f7%2fHelloAgainEnums.rar"&gt;HelloAgainEnums.rar (44,39 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2011-02-20 16:05:00</pubDate>
  <slug>Yillar-Sonra-Yeniden-Enum-Sabitleri</slug>
  <tags>
    <tag>c#</tag>
    <tag>c#-temelleri</tag>
    <tag>enum-type</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>