<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF - Referans Güncellemeden Güncelleme Yapmak</title>
  <description>Bildiğiniz üzere bir servis yazıldığında genellikle bunu tüketen(Consume) en az bir taraf bulunur. İstemci olarak düşündüğümüz bu taraflar her hangi bir uygulama olabilir. WCF(Windows Communication Foundation) ile geliştirdiğimiz bu servislerin, söz konusu istemciler tarafından kullanılması noktasında ise izlenebilecek bir kaç yol bulunmaktadır. Bunlardan en yaygını, servislerin projeye referans olarak eklenmesi ve üretilen Proxy sınıfının kullanılmasıdır(Add Service Reference). Visual Studio gibi gelişmiş IDE’ lerin ilgili arabirimleri, bu noktada büyük kolaylık sağlamaktadır.</description>
  <content>&lt;p&gt;&lt;a href="/pics/wcfrf_8.png"&gt;&lt;img style="background-image: none; float: right; padding-top: 0px; padding-left: 0px; margin: 4px 0px; display: inline; padding-right: 0px; border-width: 0px;" title="wcfrf_8" src="/pics/wcfrf_8_thumb.png" alt="wcfrf_8" width="240" height="175" align="right" border="0" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bildiğiniz &amp;uuml;zere bir servis yazıldığında genellikle bunu t&amp;uuml;keten(Consume) en az bir taraf bulunur. İstemci olarak d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z bu taraflar her hangi bir uygulama olabilir. WCF&lt;em&gt;(Windows Communication Foundation)&lt;/em&gt; ile geliştirdiğimiz bu servislerin, s&amp;ouml;z konusu istemciler tarafından kullanılması noktasında ise izlenebilecek bir ka&amp;ccedil; yol bulunmaktadır. Bunlardan en yaygını, servislerin projeye referans olarak eklenmesi ve &amp;uuml;retilen &lt;strong&gt;Proxy &lt;/strong&gt;sınıfının kullanılmasıdır(Add Service Reference). &lt;strong&gt;Visual Studio&lt;/strong&gt; gibi gelişmiş &lt;strong&gt;IDE&lt;/strong&gt;&amp;rsquo; lerin ilgili arabirimleri, bu noktada b&amp;uuml;y&amp;uuml;k kolaylık sağlamaktadır.&lt;/p&gt;
&lt;p&gt;İkinci bir yol ise &lt;strong&gt;Proxy &lt;/strong&gt;&amp;uuml;retimi zorunluluğu olmadan servislerin kullanılmasıdır. Ancak s&amp;ouml;z konusu servislerin Web programlama modeline uygun olacak şekilde, &lt;strong&gt;HTTP&lt;/strong&gt; protokol&amp;uuml;n&amp;uuml;n ilgili metodlarına&lt;em&gt;(GET,POST,PUT,DELETE&amp;hellip;)&lt;/em&gt; destek vermek &amp;uuml;zere geliştirilmesi gerekir. Daha &amp;ccedil;ok veri odaklı&lt;em&gt;(Data-Centric)&lt;/em&gt; servisler i&amp;ccedil;in ge&amp;ccedil;erli olan bu senaryoda, i&amp;ccedil;erik de &amp;ccedil;oğunlukla &lt;strong&gt;JSON&lt;/strong&gt;&lt;em&gt;(JavaScriptObjectNotation),&lt;/em&gt;&amp;nbsp;&lt;strong&gt;BSON&lt;/strong&gt;&lt;em&gt;(Binary Javascript Object Notation) &lt;/em&gt;ve &lt;strong&gt;XML&lt;/strong&gt;&lt;em&gt;(eXensibleMarkupLanguage) &lt;/em&gt;gibi veri formatlarında sunulmaktadır. Bu tip servislerin t&amp;uuml;ketilmesinde istemcinin her hangi bir &lt;strong&gt;Proxy&lt;/strong&gt; &amp;uuml;retimine gereksinimi &lt;span style="text-decoration: underline;"&gt;bulunmamaktadır&lt;/span&gt;. Yine de işleri kolaylaştırıcı tiplerden yararlanıldığı da g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak her iki kullanım şeklinin de bazı handikapları vardır. &amp;Ouml;zellikle &lt;strong&gt;Proxy&lt;/strong&gt; bazlı servis kullanımında yaşanan sıkıntılardan birisi, servislerin &amp;ccedil;eşitli nedenler ile g&amp;uuml;ncellenmeleri sonrasında, istemcilerin de sahip oldukları referansları g&amp;uuml;ncelleme gerekliliği&lt;em&gt;(Update Service Reference) &lt;/em&gt;ya da farklı versiyonların nasıl ele alınacağıdır.&lt;/p&gt;
&lt;h1&gt;Vaka&lt;/h1&gt;
&lt;p&gt;Ancak burada &amp;ouml;zel bir vaka vardır. Bazen servis t&amp;uuml;keticileri ile servis tarafının geliştiricileri aynı projeye dahil edilmiş ve bir arada &amp;ccedil;alışan ekiplerdir ve hatta aynı &lt;strong&gt;Solution&lt;/strong&gt; &amp;uuml;zerinde &amp;ccedil;alışmaktadırlar. Ayrıca buna bir de istemci ve servis tarafının &lt;strong&gt;IIS&lt;/strong&gt; tabanlı birer &lt;strong&gt;Web&lt;/strong&gt; &lt;strong&gt;Site&lt;/strong&gt; projesi olması şartını da eklediğimiz de ortaya farklı bir bakış a&amp;ccedil;ısı &amp;ccedil;ıkmaktadır. O da, istemci tarafının servis referansını g&amp;uuml;ncellemeden&lt;em&gt;(ve pek tabi proxy tipi &amp;uuml;rettirmeden) &lt;/em&gt;&amp;ccedil;alışabilmesi ve g&amp;uuml;ncellemeleri anında uygulama şansına sahip olabilmesidir.&lt;/p&gt;
&lt;p&gt;Bu tip bir vaka genellikle istemci tarafının, servise yeni bir operasyon ilave edilmesini istediği durumlarda ortaya &amp;ccedil;ıkmaktadır. İşte bu yazımızda s&amp;ouml;z konusu vakayı nasıl ger&amp;ccedil;ekleştirebileceğimizi incelemeye &amp;ccedil;alışıyor olacağız.&lt;/p&gt;
&lt;h1&gt;Solution İ&amp;ccedil;eriği&lt;/h1&gt;
&lt;p&gt;İlk &lt;strong&gt;olarak&lt;/strong&gt; Solution i&amp;ccedil;erisinde aşağıdaki proje iskeletinin s&amp;ouml;z konusu olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfrf_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfrf_1" src="/pics/wcfrf_1_thumb.png" alt="wcfrf_1" width="580" height="518" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Client&lt;/strong&gt; ve servisi &lt;strong&gt;Host&lt;/strong&gt; eden uygulamalar aslında birer &lt;strong&gt;Asp.Net Web Site&lt;/strong&gt; olarak yer almaktadır. Bununla birlikte servis s&amp;ouml;zleşmesi&lt;em&gt;(Service Contract)&lt;/em&gt; ile s&amp;ouml;zleşme implementasyonu ayrı projeler olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lm&amp;uuml;ş ve birer &lt;strong&gt;WCF Service Library&lt;/strong&gt; şeklinde tasarlanmışlardır.&lt;/p&gt;
&lt;h1&gt;Projelerin Oluşturulması&lt;/h1&gt;
&lt;p&gt;Pek tabi servisi host eden uygulama her iki k&amp;uuml;t&amp;uuml;phaneyi de referans etmek durumundadır. İstemci tarafından olaya baktığımızda ise sadece s&amp;ouml;zleşmeyi&lt;em&gt;(Contract)&lt;/em&gt; barındıran k&amp;uuml;t&amp;uuml;phaneye bir referans i&amp;ccedil;erdiği g&amp;ouml;zden ka&amp;ccedil;mamalıdır. Bu yaklaşıma g&amp;ouml;re &lt;strong&gt;Solution&lt;/strong&gt;&amp;rsquo; ımızı yavaş yavaş oluşturmaya &amp;ccedil;alışalım. Bunun i&amp;ccedil;in aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len ağa&amp;ccedil; yapısını inşa etmemiz yeterlidir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfrf_2.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfrf_2" src="/pics/wcfrf_2_thumb.png" alt="wcfrf_2" width="494" height="834" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Karma.HostApp&lt;/strong&gt;, &lt;strong&gt;WCF Service&lt;/strong&gt; tipinden bir &lt;strong&gt;Asp.Net Web Site&lt;/strong&gt;&amp;rsquo; dır&lt;em&gt;(Add New Web Site ile eklerken WCF Service tipi se&amp;ccedil;ilmelidir)&lt;/em&gt;. &lt;strong&gt;Karma.ClientApp&lt;/strong&gt;, &lt;strong&gt;Empty&lt;/strong&gt; tipinden bir &lt;strong&gt;Asp.Net Web Site&lt;/strong&gt;&amp;rsquo; dır&lt;em&gt;(Add New Web Site ile eklerken Asp.Net Empty Web Site se&amp;ccedil;ilmelidir)&lt;/em&gt;. Her iki &lt;strong&gt;Web Site&lt;/strong&gt;&amp;rsquo; de &lt;strong&gt;IIS&lt;/strong&gt; &amp;uuml;zerinde host edilecek şekilde &amp;uuml;retilmişlerdir&lt;em&gt;(Eklerken HTTP tipini se&amp;ccedil;ip IIS altında Application klas&amp;ouml;r&amp;uuml; oluşturulması yeterlidir)&lt;/em&gt;&amp;nbsp; &lt;strong&gt;Karma.Contract&lt;/strong&gt; ve &lt;strong&gt;Karma.Implementation&lt;/strong&gt;&amp;rsquo; da birer&lt;strong&gt; WCF Service Library&lt;/strong&gt;&amp;rsquo; dir.&lt;/p&gt;
&lt;p&gt;Burada senaryo i&amp;ccedil;in anahtar nokta &lt;strong&gt;Web Site&lt;/strong&gt; proje şablonunun kullanılmış olmasıdır. Dikkat edilirse, &lt;strong&gt;Solution&lt;/strong&gt; i&amp;ccedil;erisinde yapılacak &lt;strong&gt;Build&lt;/strong&gt; işlemlerinin ardından &lt;strong&gt;Web Site&lt;/strong&gt; projelerinin &lt;strong&gt;Bin&lt;/strong&gt; klas&amp;ouml;rlerinde, referans edilen &lt;strong&gt;dll&lt;/strong&gt;&amp;rsquo; lerin otomatik olarak eklendiği g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;h1&gt;Servis Tarafının Kodlanması&lt;/h1&gt;
&lt;p&gt;Şimdi &amp;ouml;rnek senaryo i&amp;ccedil;erisinde ele alacağımız diğer tipleri de ilave etmeye başlayalım. &lt;strong&gt;Karma.Contract&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesinde aşağıdaki servis s&amp;ouml;zleşmesinin yazıldığını d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfrf_3.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfrf_3" src="/pics/wcfrf_3_thumb.png" alt="wcfrf_3" width="242" height="116" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ServiceModel;

namespace Karma.Contract 
{ 
   [ServiceContract] 
    public interface IAlgebra 
    { 
        [OperationContract] 
        double Sum(double x, double y); 
    } 
}&lt;/pre&gt;
&lt;p&gt;Şu aşamada servis s&amp;ouml;zleşmesinin i&amp;ccedil;eriği &amp;ccedil;ok da &amp;ouml;nemli değil. Sadece bir s&amp;ouml;zleşme olması yeterli senaryo gereği. Bu s&amp;ouml;zleşmeyi implemente edecek sınıfın konuşlandırılacağı yer ise, &lt;strong&gt;Karma.Implementation&lt;/strong&gt; isimli &lt;strong&gt;WCF&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesidir. Bu k&amp;uuml;t&amp;uuml;phane i&amp;ccedil;eriğini de aşağıdaki gibi geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfrf_4.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfrf_4" src="/pics/wcfrf_4_thumb.png" alt="wcfrf_4" width="242" height="133" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Karma.Contract;

namespace Karma.Implementation 
{ 
    public class Algebra 
       :IAlgebra 
    { 
        public double Sum(double x, double y) 
        { 
            return x + y; 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Servis tarafı i&amp;ccedil;in gerekli s&amp;ouml;zleşme&lt;em&gt;(Contract)&lt;/em&gt; ve uygulayıcı tip hazır. &amp;Ccedil;ok doğal olarak bu s&amp;ouml;zleşmeyi bir yerde host ederek sunmalıyız. Bu ama&amp;ccedil;la projemizde yer alan &lt;strong&gt;Karma.HostApp&lt;/strong&gt; uygulamasına bir &lt;strong&gt;WCF Service&lt;/strong&gt; ekleyeceğiz, ancak sadece &lt;strong&gt;svc&lt;/strong&gt; uzantılı dosyanın durmasına izin vermeliyiz. Bir başka deyişle &lt;strong&gt;App_Code&lt;/strong&gt; klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisine atılan dosyaları&lt;em&gt;(b&amp;uuml;y&amp;uuml;k ihtimalle IService1.cs ve Service1.cs)&lt;/em&gt; silmeliyiz. Diğer yandan &lt;strong&gt;AlgebraService.svc&lt;/strong&gt; dosyasının i&amp;ccedil;eriğinin de aşağıdaki şekilde d&amp;uuml;zenlenmesi gerekmektedir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ ServiceHost Language="C#" Debug="true" Service="Karma.Implementation.Algebra" %&amp;gt;&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;ServiceHost &lt;/strong&gt;elementindeki &lt;strong&gt;Service&lt;/strong&gt; niteliğinin değeri, &lt;strong&gt;Karma.Implementation&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesinde yer alan &lt;strong&gt;Algebra&lt;/strong&gt; tipi olarak işaret edilmiştir.&lt;/p&gt;
&lt;p&gt;Buraya kadar ki işlemleri tamamladıktan sonra servisin &amp;ccedil;alışıp &amp;ccedil;alışmadığının kontrol edilmesinde yarar vardır. Eğer aşağıdaki &amp;ccedil;ıktıyı alabiliyorsak ve &lt;strong&gt;WSDL&lt;/strong&gt; &amp;ccedil;ıktılarına da sorunsuz ulaşabiliyorsa s&amp;uuml;per!&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfrf_5.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfrf_5" src="/pics/wcfrf_5_thumb.png" alt="wcfrf_5" width="450" height="326" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;h1&gt;İstemci Tarafının Kodlanması&lt;/h1&gt;
&lt;p&gt;Gelelim istemci tarafına. Yani &lt;strong&gt;Karma.ClientApp&lt;/strong&gt; uygulamasına. Senaryomuzda belirttiğimiz &amp;uuml;zere bu projede her hangi bir şekilde &lt;strong&gt;Add Service Reference&lt;/strong&gt; ile &lt;strong&gt;Proxy&lt;/strong&gt; &amp;uuml;retimi s&amp;ouml;z konusu &lt;span style="text-decoration: underline;"&gt;olmamalıdır/olmayacaktır&lt;/span&gt;. Nitekim kurtulmak istediğimiz nokta referans g&amp;uuml;ncelleme işlemleridir. Ancak diğer taraftan istemcinin uygun servis s&amp;ouml;zleşmesini kullanarak bir şekilde ilgili host uygulamaya talepte bulunabilmesi de gerekmektedir. Bu nedenle istemci tarafında bu kullanımı sağlayabilecek ilave bir sınıfa daha ihtiyacımız vardır. Aşağıdaki kod par&amp;ccedil;asında olduğu gibi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ServiceModel;

public class AlgebraServiceClient&amp;lt;T&amp;gt; 
    : ClientBase&amp;lt;T&amp;gt; 
    where T : class 
{ 
    private bool _disposed = false; 
    public AlgebraServiceClient() 
        : base(typeof(T).FullName) 
    { 
    } 
    public AlgebraServiceClient(string endpointConfigurationName) 
        : base(endpointConfigurationName) 
    { 
    } 
    public T Proxy 
    { 
        get { return this.Channel; } 
    } 
    protected virtual void Dispose(bool disposing) 
    { 
        if (!this._disposed) 
        { 
            if (disposing) 
            { 
                if (this.State == CommunicationState.Faulted) 
                { 
                    base.Abort(); 
                } 
                else 
                { 
                    try 
                    { 
                        base.Close(); 
                    } 
                    catch 
                    { 
                        base.Abort(); 
                    } 
                } 
                _disposed = true; 
            } 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Aslında &lt;strong&gt;ClientBase&amp;lt;T&amp;gt;&lt;/strong&gt; t&amp;uuml;revli olarak geliştirilen &lt;strong&gt;AlgebraServiceClient&lt;/strong&gt;, &lt;strong&gt;Add Service Reference&lt;/strong&gt; işlemi sonrası &amp;uuml;retilen &lt;strong&gt;Proxy&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde yer alan tiplere benzemektedir. Ancak daha generic bir tip s&amp;ouml;z konusudur. &amp;Ouml;zellikle bu tipin konfigurasyon bazlı &amp;ccedil;alışabilmesi i&amp;ccedil;in yapıcı metodlardan birisinde, &amp;uuml;st sınıftaki yapıcıya&lt;em&gt;(Constructor)&lt;/em&gt; paramete g&amp;ouml;nderildiğine dikkat edilmelidir.&lt;/p&gt;
&lt;p&gt;Tabi istemci tarafında ilgili &lt;strong&gt;WCF&lt;/strong&gt; servisinin kullanılabilmesi i&amp;ccedil;in &lt;strong&gt;web.config&lt;/strong&gt; dosyasında da bazı d&amp;uuml;zenlemelerin yapılması gerekmektedir. Bu sebeple &lt;strong&gt;web.config&lt;/strong&gt; i&amp;ccedil;eriğini aşağıdaki gibi değiştirmeliyiz.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0"?&amp;gt; 
&amp;lt;configuration&amp;gt; 
  &amp;lt;system.web&amp;gt; 
    &amp;lt;compilation debug="true" targetFramework="4.5"/&amp;gt; 
    &amp;lt;httpRuntime targetFramework="4.5"/&amp;gt; 
  &amp;lt;/system.web&amp;gt; 
  &amp;lt;system.serviceModel&amp;gt; 
    &amp;lt;bindings&amp;gt; 
      &amp;lt;basicHttpBinding&amp;gt; 
        &amp;lt;binding name="BasicHttpBinding_IAlgebra" closeTimeout="00:01:00" 
            openTimeout="00:01:00" receiveTimeout="00:10:00" sendTimeout="00:01:00" 
            allowCookies="false" bypassProxyOnLocal="false" hostNameComparisonMode="StrongWildcard" 
            maxBufferSize="65536" maxBufferPoolSize="524288" maxReceivedMessageSize="65536" 
            messageEncoding="Text" textEncoding="utf-8" transferMode="Buffered" 
            useDefaultWebProxy="true"&amp;gt; 
          &amp;lt;readerQuotas maxDepth="32" maxStringContentLength="8192" maxArrayLength="16384" 
              maxBytesPerRead="4096" maxNameTableCharCount="16384" /&amp;gt; 
        &amp;lt;/binding&amp;gt; 
      &amp;lt;/basicHttpBinding&amp;gt; 
    &amp;lt;/bindings&amp;gt; 
    &amp;lt;client&amp;gt; 
      &amp;lt;endpoint address="http://localhost/Karma.HostApp/AlgebraService.svc" 
          binding="basicHttpBinding" bindingConfiguration="BasicHttpBinding_IAlgebra" 
          contract="Karma.Contract.IAlgebra" name="BasicHttpBinding_AlgebraService" /&amp;gt; 
    &amp;lt;/client&amp;gt; 
  &amp;lt;/system.serviceModel&amp;gt; 
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu i&amp;ccedil;eriği oluştururken var olan bir client web.config i&amp;ccedil;eriğinden yararlanmanızı &amp;ouml;nerebilirim.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizde servis tarafında &lt;strong&gt;WCF&lt;/strong&gt;&amp;rsquo; in varsayılan konfigurasyon ayarları kullanıldığından, iletişim &lt;strong&gt;BasicHttpBinding&lt;/strong&gt; &amp;uuml;zerinden yapılmaktadır. Ancak servis tarafında se&amp;ccedil;ilen &lt;strong&gt;EndPoint &lt;/strong&gt;i&amp;ccedil;eriğine g&amp;ouml;re istemci tarafındaki tanımlamaların da&lt;em&gt;(Binding gibi) &lt;/em&gt;değiştirilmesi gerekebilir.&lt;/p&gt;
&lt;h1&gt;Test Kodları&lt;/h1&gt;
&lt;p&gt;Artık servisi kullanmayı deneyebiliriz. Bu ama&amp;ccedil;la &lt;strong&gt;Karma.ClientApp&lt;/strong&gt; i&amp;ccedil;erisindeki &lt;strong&gt;Default.aspx&lt;/strong&gt; sayfasına basit bir &lt;strong&gt;Button&lt;/strong&gt; ekleyelim ve &lt;strong&gt;Click&lt;/strong&gt; olay metodunda aşağıdaki kodları yazarak geliştirmemize devam edelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Karma.Contract; 
using System;

public partial class _Default : System.Web.UI.Page 
{ 
    protected void Page_Load(object sender, EventArgs e) 
    {

    } 
    protected void btnProcess_Click(object sender, EventArgs e) 
    { 
        using (AlgebraServiceClient&amp;lt;IAlgebra&amp;gt; dynamicProxy = 
            new AlgebraServiceClient&amp;lt;IAlgebra&amp;gt;("BasicHttpBinding_AlgebraService")) 
        { 
            double result=dynamicProxy.Proxy.Sum(3.2, 4.5); 
            Response.Write(result.ToString()); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;İstemci uygulama servis s&amp;ouml;zleşmesini i&amp;ccedil;eren &lt;strong&gt;Karma.Contract&lt;/strong&gt; k&amp;uuml;t&amp;uuml;phanesini referans ettiğinden, &lt;strong&gt;IAlgebra&lt;/strong&gt; &amp;uuml;zerinde tanımlı olan &lt;strong&gt;Sum&lt;/strong&gt; metoduna erişebilmektedir. Ancak &amp;ccedil;alışma zamanında bunun servis tarafına y&amp;ouml;nlendirilebilmesi, &lt;strong&gt;ClientBase&amp;lt;T&amp;gt;&lt;/strong&gt; t&amp;uuml;revli &lt;strong&gt;AlgebraServiceClient&lt;/strong&gt; nesne &amp;ouml;rneğinin kullanılmasına bağlıdır.&lt;/p&gt;
&lt;h1&gt;Servise Yeni Bir Operasyon Dahil Edilmesi&lt;/h1&gt;
&lt;p&gt;Peki buraya kadar yazdıklarımız ile asıl hedefimize ulaştık mı dersiniz? Elbette ki hayır. Amacımız; servis tarafında yapılan bir g&amp;uuml;ncelleme sonrasında, istemci tarafının bir &lt;strong&gt;Proxy&lt;/strong&gt; g&amp;uuml;ncellemesine gitmeye gerek duymamasını sağlamaktır. Şimdi bu durumu test etmek amacıyla servis tarafına yeni bir operasyon ilave edildiğini ve bunun uygulandığını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;S&amp;ouml;zleşme tarafı;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ServiceModel;

namespace Karma.Contract 
{ 
    [ServiceContract] 
    public interface IAlgebra 
    { 
        [OperationContract] 
        double Sum(double x, double y);

        [OperationContract] 
        double Multiply(double x, double y); 
    } 
}&lt;/pre&gt;
&lt;p&gt;İmplementasyon tarafı;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Karma.Contract;

namespace Karma.Implementation 
{ 
    public class Algebra 
        :IAlgebra 
    { 
        public double Sum(double x, double y) 
        { 
            return x + y; 
        }

        public double Multiply(double x,double y) 
        { 
            return x * y; 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;G&amp;uuml;zelll! Peki ya şimdi ne olacak? Normal şartlarda &lt;strong&gt;Add Service Reference&lt;/strong&gt; tekniğine g&amp;ouml;re bir &lt;strong&gt;Proxy&lt;/strong&gt; &amp;uuml;retmiş olsaydık, istemci tarafında bu yeniliklerin g&amp;ouml;r&amp;uuml;lebilmesi/kullanılabilmesi i&amp;ccedil;in s&amp;ouml;z konusu &lt;strong&gt;Proxy&lt;/strong&gt; &amp;uuml;zerinde bir g&amp;uuml;ncelleme işlemi yapmamız gerekirdi. Oysa ki bu senaryoda durum biraz daha farklıdır. Bir &lt;strong&gt;Build&lt;/strong&gt; işlemi yaptığımızda, istemci tarafındaki kodlarda, &lt;strong&gt;intellisense&lt;/strong&gt;&amp;rsquo; in devreye girdiği yerlerde yeni operasyonun da ele alınabildiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfrf_6.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfrf_6" src="/pics/wcfrf_6_thumb.png" alt="wcfrf_6" width="627" height="263" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere yapılan yeni g&amp;uuml;ncelleme &lt;strong&gt;build&lt;/strong&gt; işlemi sonrasında istemci tarafında da g&amp;ouml;r&amp;uuml;lmekte ve etkin olarak kullanılabilmektedir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;B&amp;uuml;t&amp;uuml;n Solution&amp;rsquo; ın Build edilmesine gerek yoktur. Sadece istemci uygulamanın refereans ettiği Karma.Contract k&amp;uuml;t&amp;uuml;phanesinin derlenmesi yeterli olacaktır. Bu derleme, g&amp;uuml;ncellemelerin istemci tarafındaki kodlarda kullanılabilmesini sağlayacaktır, nitekim derleme sonrası DLL&amp;rsquo; in yeni hali otomatik olarak Web Site&amp;rsquo; ın Bin klas&amp;ouml;r&amp;uuml;ne yansıyacaktır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;Son Test&lt;/h1&gt;
&lt;p&gt;&amp;Ccedil;alışma zamanında ki sonu&amp;ccedil;lara bakarak testimizi tamamlayalım ve senaryonun &amp;ccedil;alıştığından emin olalım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/wcfrf_7.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="wcfrf_7" src="/pics/wcfrf_7_thumb.png" alt="wcfrf_7" width="555" height="391" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bu senaryoda dikkat edilmesi gereken nokta, &lt;strong&gt;Add Service Reference&lt;/strong&gt; veya &lt;strong&gt;Update Service Reference&lt;/strong&gt; gibi se&amp;ccedil;eneklerin &lt;span style="text-decoration: underline;"&gt;kullanılmamış&lt;/span&gt; olmasıdır. Diğer yandan size d&amp;uuml;şen g&amp;ouml;rev neden bu senaryo i&amp;ccedil;in &lt;strong&gt;Asp.Net Web Site&lt;/strong&gt; şablonunun tercih edildiğinin bulunmasıdır? Aynı durum &lt;strong&gt;Asp.Net Web Application&lt;/strong&gt; tipleri i&amp;ccedil;in s&amp;ouml;z konusu olamaz mı? S&amp;ouml;z konusu olamazsa, iki uygulama şekli arasındaki farklılıklar nelerdir? Yani &lt;strong&gt;Web Site&lt;/strong&gt;&amp;rsquo; ın &lt;strong&gt;Web Application&lt;/strong&gt;&amp;rsquo; dan farkı nedir? Peki ya bu senaryo &lt;strong&gt;Visual Studio 2013&lt;/strong&gt; ile gelen yeni nesil web projesi şablonlarında nasıl ele alınabilir? Elbette bu soruları da araştırmak gerekmektedir. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;İpucu : &amp;Ouml;zellikle Web Site ile Web Application arasındaki farklara hızlıca bir g&amp;ouml;z atmak i&amp;ccedil;in &lt;a href="http://daron.yondem.com/tr/post/WebSite_ile_Web_Application_Arasindaki_Fark_Nedir" target="_blank"&gt;şu adresteki blog girdisinden&lt;/a&gt; yararlanabilirsiniz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;a href="/pics/2012%2f12%2fKarma.zip"&gt;Karma.zip (48,65 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2014-06-19 17:20:00</pubDate>
  <slug>WCF-Referans-Guncellemeden-Guncelleme-Yapmak</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
    <tag>proxy</tag>
    <tag>http</tag>
    <tag>json</tag>
    <tag>bson</tag>
    <tag>xml</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>