<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Google Cloud Storage Kullanımı</title>
  <description>Bu yazımızda Google Cloud Storage hizmetini nasıl kullanabileceğimizi incelemeye çalışıyoruz. Özellikle fiziksel depolama olarak kullanabileceğimiz bu hizmeti hem komut satırından hem de .Net Core ortamından kullanmayı deniyoruz. Bir Bucket oluşturup, fotoğraf yüklüyor, yüklediğimiz içerikleri kendi ortamımıza çekiyoruz.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/02/gcpstorage_1.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Vakti zamanında sıkı bir Instagram kullanıcısıydım. En g&amp;uuml;zel fotoğrafları yakalamaya &amp;ccedil;alışır, anı g&amp;ouml;r&amp;uuml;nt&amp;uuml;leyip t&amp;uuml;m bağlantılarımla paylaşırdım. Derken bir g&amp;uuml;n "ne yapıyorum ben yahu?" oldum.&amp;nbsp;Neden o anı ille de herkesle paylaşma ihtiyacı hissediyordum. Bazen o anın fotoğrafını &amp;ccedil;ekmek gerekmiyordu. Hatta hi&amp;ccedil; &amp;ccedil;ekmediğim zamanlarda aklıma nasıl kazıdığımı bile unutmuştum. &amp;Uuml;stelik ona ayıracağım zamanı pekala başka değerli şeylere de ayırabilirdim. &amp;Ouml;rneğin yeni şeyler &amp;ouml;ğrenmeye, makale yazmaya vs...&lt;/p&gt;
&lt;p&gt;G&amp;ouml;rmekte olduğunuz fotoğraf Instagram arşivimden bir kare. O zamanlar denediğim aynasız fotoğraf makinem&lt;em&gt;(Sony Alpha idi. Hafif ve kullanışlıydı)&lt;/em&gt; ile &amp;ccedil;ekmiştim. Her zaman ki gibi b&amp;uuml;y&amp;uuml;k bir keyifle tamamladığım Ghostbusters'ın efsane arabası Ecto...Bug&amp;uuml;n işleyeceğimiz makaleye konu olacak olan fotoğraf. Haydi gelin başlayalım.&lt;/p&gt;
&lt;p&gt;Google Cloud Platform &amp;uuml;zerinden sunulan hizmetleri incelemeye devam ettiğim bir Cumartesi gecesi yolum Storage isimli RESTful API'ye d&amp;uuml;şt&amp;uuml;. Bu API sayesinde Google Cloud Platform &amp;uuml;zerinde konuşlandırdığımız verilere&lt;em&gt;(her t&amp;uuml;r i&amp;ccedil;erik s&amp;ouml;z konusu olabilir anladığım kadarıyla)&lt;/em&gt; erişmemiz m&amp;uuml;mk&amp;uuml;n. Fotoğraf, makale, dok&amp;uuml;man vb i&amp;ccedil;erikler depolama denince aklımıza ilk gelen &amp;ccedil;eşitler.&lt;/p&gt;
&lt;p&gt;Storage API'sinin sunduğu fonksiyonellikler sayesinde bu tip i&amp;ccedil;erikleri bize ait bucket alanlarına taşımamız ve okumamız m&amp;uuml;mk&amp;uuml;n. Hatta bu i&amp;ccedil;erikleri genele veya kişilere &amp;ouml;zel olacak şekilde sunabiliriz de. Elbette Google Cloud Platform i&amp;ccedil;erisinde bu API'yi uygulamalar arası değerlendirmek de m&amp;uuml;mk&amp;uuml;n ki asıl ama&amp;ccedil;larından birisi de bu zaten. S&amp;ouml;z gelimi Bucket'a&lt;em&gt;(Kova gibi de d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir)&lt;/em&gt; bir fotoğraf attıktan sonra, Pub/Sub API'den de yararlanarak&lt;em&gt;(ge&amp;ccedil;enlerde incelemiştik hatırlarsanız)&lt;/em&gt; y&amp;uuml;klenen dok&amp;uuml;manın bir diğer akıllı Google servisi tarafından işlenmesini sağlayabiliriz. Ya da platforma taşıdığımız bir web uygulamasının css, image gibi &amp;ccedil;eşitli kaynaklarını bu alanlardan sağlayabiliriz. Bunlar tabii benim i&amp;ccedil;in u&amp;ccedil; senaryolar. Şimdilik tekil par&amp;ccedil;aları nasıl kullanabilirimin peşindeyim.&lt;/p&gt;
&lt;p&gt;Storage API'sini kullanmak olduk&amp;ccedil;a kolay. Komut satırından gsutil aracı&lt;em&gt;(Google Cloud SDK'ye sahip olduğunuzu d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum)&lt;/em&gt; yardımıyla t&amp;uuml;m temel işlemleri ger&amp;ccedil;ekleştirebiliriz. .Net Core, Python, Go, Ruby, Node.js, Java gibi pek &amp;ccedil;ok dilin de s&amp;ouml;z konusu API'yi kullanabilmek i&amp;ccedil;in geliştirilmiş paketleri bulunuyor. Dolayısıyla kod tarafından da ilgili servisi kullanmak m&amp;uuml;mk&amp;uuml;n.&lt;/p&gt;
&lt;p&gt;Ben tahmin edileceği &amp;uuml;zere &amp;ouml;ncelikle komut satırından ve sonrasında da .Net Core tarafından s&amp;ouml;z konusu servisi kullanmaya &amp;ccedil;alışacağım. Senaryom olduk&amp;ccedil;a basit. Bir bucket oluştur, buraya fotoğraf at, attığın fotoğrafı oku, bucket'ı sil vb...Şunu unutmamak lazım ki, bu servis diğer Google servisleri gibi &amp;uuml;cretlendirmeye tabii olabilir. O nedenle denemelerden sonra oluşturulan bucket veya i&amp;ccedil;eriği silmek gerekiyor.&lt;/p&gt;
&lt;h1&gt;gsUtil ile Storage İşlemleri&lt;/h1&gt;
&lt;p&gt;İlk olarak gsutil ile s&amp;ouml;z konusu işlemleri nasıl yapabileceğimize bir bakalım. Tabii işe başlamadan &amp;ouml;nce Google Cloud Platform &amp;uuml;zerinde bir proje oluşturmamız ve &amp;ouml;zellikle Storage API'yi kullanacak ge&amp;ccedil;erli bir servis kullanıcısı &amp;uuml;reterek bu kullanıcıya ait Credential bilgilerini taşıyan json formatlı i&amp;ccedil;eriği kendi ortamımızda işaret etmemiz gerekiyor.&lt;/p&gt;
&lt;p&gt;Ben bu işlemlere &amp;ouml;nceki makalelerde değindiğim i&amp;ccedil;in tekrar &amp;uuml;st&amp;uuml;nden ge&amp;ccedil;miyorum. Diğer yandan Google dok&amp;uuml;mantasyonuna g&amp;ouml;re sitemde Python'un en azından 2.7 s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml;n y&amp;uuml;kl&amp;uuml; olması gerekiyor. West-World' de bu s&amp;uuml;r&amp;uuml;m mevcut. Ben &amp;ccedil;alışmam sırasında aşağıdaki komutları denedim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;gsutil mb gs://article-images-bucket/
gsutil cp legom.jpg gs://article-images-bucket
gsutil ls gs://article-images-bucket
gsutil ls -l gs://article-images-bucket
gsutil acl ch -u AllUsers:R gs://article-images-bucket/legom.jpg gsutil acl ch -d AllUsers gs://article-images-bucket/legom.jpg
gsutil rm gs://article-images-bucket/legom.jpg
gsutil rm -r gs://article-images-bucket&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/gcpstorage_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;mb komutu ile Storage &amp;uuml;zerinde article-images-bucket isimli bir bucket&amp;nbsp;oluşturuyoruz. Bu işlem sonrasında Google kontrol paneline gittiğimde bucket &amp;ouml;rneğinin oluşturulduğunu da g&amp;ouml;rd&amp;uuml;m(Sevindirdi)&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/gcstorage_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;cp parametresini&amp;nbsp;kullanarak bir bucket'a dosya y&amp;uuml;klememiz de m&amp;uuml;mk&amp;uuml;n. Ben legom.jpg dosyasını y&amp;uuml;kledim&lt;em&gt;(farklı dosya tiplerinden i&amp;ccedil;erikler de kullanılabilir) &lt;/em&gt;Sonu&amp;ccedil; aşağıdaki resimde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibiydi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/gcpstorage_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ls parametresi ile bucket i&amp;ccedil;erisindeki dosyaları g&amp;ouml;rmek m&amp;uuml;mk&amp;uuml;n. Eğer bu dosyaların detay bilgisine ulaşmak istiyorsak bu durumda -l anahtarını kullanmak gerekiyor. acl kullanılan kısımda internetteki t&amp;uuml;m kullancıların legom.jpg dosyasını okuyabileceğini belirtiyoruz. Bir nevi Access Control List i&amp;ccedil;in AllUsers rol&amp;uuml;ne Read hakkı verdiğimizi ifade edebiliriz. Burada belirli kullanıcılara &amp;ccedil;eşitli haklar vermemiz de m&amp;uuml;mk&amp;uuml;n. S&amp;ouml;z gelimi ilgli Storage i&amp;ccedil;erisindeki dosyaları startup takımızdaki kişilerin kullanımına a&amp;ccedil;abiliriz. Nasıl yapılabileceğini bulmaya ne dersiniz? ;)&lt;/p&gt;
&lt;p&gt;rm kullanılan komutlar ile bucket i&amp;ccedil;erisinden &amp;ouml;ğe veya bucket'ın kendisini silebiliriz.&amp;nbsp;Ben fiyatlandırma korkusu nedeniyle, denememi yapar yapmaz ilgili i&amp;ccedil;erikleri sildim :)&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;Credential Mevzusu&lt;/h1&gt;
&lt;p&gt;Bir Google Cloud servisini kullanacağımız zaman, bu servis &amp;ouml;zelinde &amp;ccedil;alışacak bir servis kullanıcısı oluşturulması ve&amp;nbsp;&amp;uuml;retilen json dosyasının kullanılması &amp;ouml;neriliyor. Bunu API Services -&amp;gt; Credentials kısmından New Service Account ile yapabiliriz. &amp;Ouml;nemli olan oluşturulan veya var olan kullanıcı i&amp;ccedil;in Storage servisi&lt;em&gt;(ya da hangi servisi kullandırtmak istiyorsak onun i&amp;ccedil;in)&lt;/em&gt; bir role belirlenmesidir.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/gcpstorage_5.gif" alt="" width="640" height="480" /&gt;&lt;/p&gt;
&lt;p&gt;Ben bu senaryo i&amp;ccedil;in my-storage-master isimli bir kullanıcı oluşturup Storage API servisinde Admin rol&amp;uuml; ile ilişkilendirdim.&amp;nbsp;Kullanıcı oluşturulduktan sonra da yetkilendirme bilgilerini taşıyan JSON formatlı dosyayı &amp;uuml;rettirdim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/gcpstorage_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu dosyayı kod tarafındaki servise ait Credential bilgilerini y&amp;uuml;klemek i&amp;ccedil;in kullanacağız.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Aslında Credentials vakasına baktığımızda kullanılabilecek bir &amp;ccedil;ok yol mevcut. Sistemin Google_Application_Credentials anahtar değerine sahip path bilgisini bu dosya ile eşleştirebileceğimiz gibi kod tarafında farklı şekillerde Credential bilgisini y&amp;uuml;klememiz de m&amp;uuml;mk&amp;uuml;n. Detaylar i&amp;ccedil;in &lt;a href="https://cloud.google.com/docs/authentication/production" target="_blank"&gt;buradaki yazıya bakmanızı&lt;/a&gt; &amp;ouml;neririm.&amp;nbsp;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;.Net Core Tarafı&lt;/h1&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere komut satırında gsutil aracını kullanarak Storage API ile konuşmak olduk&amp;ccedil;a basit ve pratik. Neler yapabileceğimizi az &amp;ccedil;ok anladık. Şimdi kod yoluyla Storage API'sini nasıl kullanabileceğimizi incelemeye &amp;ccedil;alışalım. Her zaman ki gibi konuyu basit şekilde ele almak adına bir Console uygulaması oluşturarak işe başlayabiliriz. Sonrasında&amp;nbsp;Google.Cloud.Storage.V1 paketini uygulamaya dahil etmek gerekiyor. Bu paket REST modelli Storage servisi ile konuşmamızı kolaylaştıracak&lt;em&gt;(D&amp;uuml;ş&amp;uuml;nd&amp;uuml;m de g&amp;uuml;n&amp;uuml;m&amp;uuml;zde her yer RESTful servis sanki)&lt;/em&gt; Dolayısıyla ilk terminal komutlarımız şunlar...&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new console -o howtostorage
dotnet add package Google.Cloud.Storage.V1&lt;/pre&gt;
&lt;p&gt;Program.cs i&amp;ccedil;eriğini aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.IO;
using Google.Apis.Auth.OAuth2;
using Google.Cloud.Storage.V1;

namespace howtostorage
{
    class Program
    {
        static StorageClient storageClient;

        static void Main(string[] args)
        {
            var credential = GoogleCredential.FromFile("my-starwars-game-project-credentials.json");
            storageClient = StorageClient.Create(credential);
            var projectId = "subtle-seer-193315";
            var bucketName = "article-images-bucket";
            CreateBucket(projectId, bucketName);
            WriteBucketList(projectId);
            UploadObject(bucketName, "legom.jpg", "legom");
            UploadObject(bucketName, "pinkfloyd.jpg", "pink-floyd");
            WriteBucketObjects(bucketName);
            DownloadObject(bucketName, "legom","lego-from-google.jpg");
            DownloadObject(bucketName, "pink-floyd","pink-floyd-from-google.jpg");
            
            Console.WriteLine("Y&amp;uuml;klenen nesneler silinecek");
            Console.ReadLine();

            DeleteObject(bucketName, "pink-floyd");
            DeleteObject(bucketName, "legom");
            DeleteBucket(bucketName);
        }
        static void CreateBucket(string projectId, string bucketName)
        {
            try
            {
                storageClient.CreateBucket(projectId, bucketName);
                Console.WriteLine($"{bucketName} oluşturuldu.");
            }
            catch (Google.GoogleApiException e)
            when (e.Error.Code == 409)
            {
                Console.WriteLine(e.Error.Message);
            }
        }
        static void WriteBucketList(string projectId)
        {
            foreach (var bucket in storageClient.ListBuckets(projectId))
            {
                Console.WriteLine($"{bucket.Name},{bucket.TimeCreated}");
            }
        }
        static void UploadObject(string bucketName, string filePath,string objectName = null)
        {
            using (var stream = File.OpenRead(filePath))
            {
                objectName = objectName ?? Path.GetFileName(filePath);
                storageClient.UploadObject(bucketName, objectName, null, stream);
                Console.WriteLine($"{objectName} y&amp;uuml;klendi.");
            }
        }
        static void WriteBucketObjects(string bucketName)
        {
            foreach (var obj in storageClient.ListObjects(bucketName, ""))
            {
                Console.WriteLine($"{obj.Name}({obj.Size})");
            }
        }
        static void DownloadObject(string bucketName, string objectName,string filePath = null)
        {
            filePath = filePath ?? Path.GetFileName(objectName);
            using (var stream = File.OpenWrite(filePath))
            {
                storageClient.DownloadObject(bucketName, objectName, stream);
            }
            Console.WriteLine($"{objectName}, {filePath} olarak indirildi.");
        }
        static void DeleteObject(string bucketName, string objectName)
        {
            storageClient.DeleteObject(bucketName, objectName);
            Console.WriteLine($"{objectName} silindi.");
        }
        static void DeleteBucket(string bucketName)
        {
            storageClient.DeleteBucket(bucketName);
            Console.WriteLine($"{bucketName} silindi.");
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Neler yaptığımıza bir bakalım. Kodun akışı Credential bilgilerini i&amp;ccedil;eren dosyanın okunması ve elde edilen g&amp;uuml;venlik kriterleri ile StorageClient nesnesinin &amp;ouml;rneklenmesi ile başlıyor. Sonrasında projeId bilgisi ve &amp;ouml;rnek bir bucket adı kullanılarak işlemlere başlanıyor. Bucket'ın oluşturulması, g&amp;uuml;ncel bucket listesine bakılması, iki resim dosyasının y&amp;uuml;klenmesi, bucket i&amp;ccedil;erisindeki nesnelerin &amp;ccedil;ekilmesi, bir resim dosyasının Google'dan West-World'e getirilmesi ve son olarak da t&amp;uuml;m nesnelerin platformdan silinmesi işlemleri ger&amp;ccedil;ekleştiriliyor.&lt;/p&gt;
&lt;p&gt;Aslında t&amp;uuml;m operasyon StorageClient nesnesinin metodları ile icra edilmekte. Google'ın diğer API servisleri i&amp;ccedil;in geliştirilmiş Client k&amp;uuml;t&amp;uuml;phanelerinde de benzer standartlar mevcut. Bu nedenle birisini &amp;ouml;ğrendikten sonra diğerlerini kullanmak da kolay olacaktır diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;CreateBucket metodu ile plaform &amp;uuml;zerinde bir bucket oluşturulması sağlanıyor. Parametre olarak hangi projeyi kullanacaksak onun ID bilgisi ve bir de bucket adı veriliyor. Pek tabii oluşturulmak istenen bucket zaten varsa 409 kodlu bir Exception alınmakta. Platform &amp;uuml;zerinde oluşturulan bucket listesini ListBuckets metodu ile &amp;ccedil;ekebiliriz. Parametre olarak projeID&amp;nbsp;bilgisini vermek yeterli.&lt;/p&gt;
&lt;p&gt;Bucket i&amp;ccedil;erisine nesne atma işi aslında Stream temelli. Nitekim y&amp;uuml;kleyeceğimiz i&amp;ccedil;erikler en nihayetinde bir byte dizisine tekab&amp;uuml;l etmekte. UploadObject fonksiyonunun son parametresi de bu stream nesnesi. Bucket i&amp;ccedil;erisindeki nesneleri ListObjects fonksiyonu yardımıyla yakalamamız m&amp;uuml;mk&amp;uuml;n. &amp;Ouml;rnek kod par&amp;ccedil;asında bu nesnelerin isim ve boyutlarını alıp ekrana yazdırmaktayız. Nesne silme işlemi de olduk&amp;ccedil;a kolay. DeleteObject ve DeleteBucket fonksiyonlarından yararlanarak bir bucket nesnesini veya i&amp;ccedil;erisindeki bir &amp;ouml;ğeyi silmek m&amp;uuml;mk&amp;uuml;n.&lt;/p&gt;
&lt;p&gt;Programı &amp;ccedil;alıştırdıktan sonra iki aşamalı olarak elde ettiğim sonu&amp;ccedil;lara baktım. &amp;Ouml;ncelikle oluşturulan bucket'a iki resim dosyasının da y&amp;uuml;klendiğini g&amp;ouml;zlemledim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/gcpstorage_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tuşa basıp ilerlediğimdeyse hem y&amp;uuml;klediğim dosyaların hem de bucket'ın kendisinin silindiğini g&amp;ouml;rd&amp;uuml;m.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/02/gcpstorage_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere Google Cloud Platform'un kullanışlı API hizmetlerinden birisi olan Storage servisini kullanmak olduk&amp;ccedil;a kolay. Artık kendi ortamınızdaki nesneleri Storage'a taşıyabilir buradan tetikleteceğiniz olaylar ile başka s&amp;uuml;re&amp;ccedil;lerin devreye girmesini sağlayabilirsiniz&lt;em&gt;(diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum)&lt;/em&gt; B&amp;ouml;ylece geldik bir araştırmamızın daha sonuna. Doğruyu s&amp;ouml;ylemek gerekirse Google Cloud Platform'un sunduğu API'lerle oynamak epey keyifli. Azure, AWS tarafından sunulan fonksiyonellikler i&amp;ccedil;in de aynı durumun s&amp;ouml;z konusu olduğunu belirtmek isterim. Bu tip fonksiyonellikleri deneyimleyerek bulut platformların imkanlarını daha iyi kavrayabilir ve &amp;ccedil;&amp;ouml;z&amp;uuml;m &amp;uuml;retme noktasında daha rahat hareket edebiliriz. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2018-05-08 07:23:00</pubDate>
  <slug>Google-Cloud-Storage-Kullanımı</slug>
  <tags>
    <tag>net-core</tag>
    <tag>google-cloud-platform</tag>
    <tag>google-cloud-storage</tag>
    <tag>rest-api</tag>
    <tag>gsutil</tag>
    <tag>bucket</tag>
    <tag>storage</tag>
    <tag>cloud-computing</tag>
    <tag>storage-client</tag>
    <tag>restful</tag>
    <tag>api</tag>
    <tag>json</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
    <category>GCP</category>
  </categories>
</post>