<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>SOLID–Adım Adım Tanımak</title>
  <description>SOLID basit bir kelime gibi görünse de, her harfinin ifade ettiği yazılım prensipleri göz önüne alındığında devasa bir evreni işaret etmekte. Single Responsibility, Open-Closed, Liskov Substitution, Interface Segregation ve son olarak Dependency Inversion. İşte bu görsel dersimizde bu prensipleri çok basit ve yüzeysel bir örnek üzerinden anlamaya çalışıyoruz. Önce ilkeleri ihlal ediyor, sonrasında bunları düzeltme yoluna gidiyoruz.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;SOLID basit bir kelime gibi g&amp;ouml;r&amp;uuml;nse de, her harfinin ifade ettiği yazılım prensipleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında devasa bir evreni işaret etmekte. &lt;strong&gt;Single Responsibility, Open-Closed, Liskov Substitution, Interface Segregation&lt;/strong&gt; ve son olarak &lt;strong&gt;Dependency Inversion&lt;/strong&gt;. İşte bu g&amp;ouml;rsel dersimizde bu prensipleri &amp;ccedil;ok basit ve y&amp;uuml;zeysel bir &amp;ouml;rnek &amp;uuml;zerinden anlamaya &amp;ccedil;alışıyoruz. &amp;Ouml;nce ilkeleri ihlal ediyor, sonrasında bunları d&amp;uuml;zeltme yoluna gidiyoruz.&lt;/p&gt;
&lt;p&gt;&lt;object width="640" height="360"&gt;
&lt;param name="movie" value="//www.youtube.com/v/2AJ_trQ1LWc?hl=en_US&amp;amp;version=3" /&gt;
&lt;param name="allowFullScreen" value="true" /&gt;
&lt;param name="allowscriptaccess" value="always" /&gt;&lt;embed type="application/x-shockwave-flash" width="640" height="360" src="//www.youtube.com/v/2AJ_trQ1LWc?hl=en_US&amp;amp;version=3" allowfullscreen="allowfullscreen" allowscriptaccess="always" /&gt;
&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Not : Şu ana kadar anlatmakta en &amp;ccedil;ok zorlandığım g&amp;ouml;rsel dersti. Konunun soyutluğu, &amp;ouml;rneğin yeteri kadar doyurucu olmayışı, &amp;uuml;st kattaki iki kardeşin gecenin o vakti koşuşturması vb nedenlerden &amp;ouml;t&amp;uuml;r&amp;uuml;...Dolayısıyla s&amp;uuml;r&amp;ccedil;&amp;uuml; lisan ettiysem affola.&lt;/em&gt;&lt;/p&gt;</content>
  <pubDate>2014-03-10 00:00:00</pubDate>
  <slug>SOLIDe28093Adc4b1m-Adc4b1m-Tanc4b1mak</slug>
  <tags />
  <categories>
    <category>Tasarım Prensipleri(Design Principles)</category>
  </categories>
</post>