<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ruby Kod Parçacıkları 23 - set,prime,logger,pathname,benchmark,find,zlib Kullanımları</title>
  <description>Epey zamandır Ruby notlarımın(özellikle de Amazon'dan getirttiğim kitapların) yüzüne bakmadığımı gördüm de...Pişmanlık hissettim(İtiraf ediyorum bu aralar biraz tembellik yapıyordum) Sonra onunla uğraşmayı özlediğimi fark ettim. Onun sadeliğini, yalın yazımını, gücünü, pratikliğini. Pasımı atmak için bir şeyler araştırmam gerekiyordır. Derken kendimi her zaman ki gibi Google' da Ruby standart kütüphanesi ile ilgili faydalı kod parçalarını ararken buldum.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2016/05/Ruby23_6n.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Epey zamandır &lt;strong&gt;Ruby&lt;/strong&gt;&amp;nbsp;notlarımın&lt;em&gt;(&amp;ouml;zellikle de Amazon'dan getirttiğim kitapların)&lt;/em&gt;&amp;nbsp;y&amp;uuml;z&amp;uuml;ne bakmadığımı g&amp;ouml;rd&amp;uuml;m de...Pişmanlık hissettim&lt;em&gt;(İtiraf ediyorum bu aralar biraz tembellik yapıyordum) &lt;/em&gt;Sonra&amp;nbsp;onunla uğraşmayı &amp;ouml;zlediğimi fark ettim. Onun sadeliğini, yalın yazımını, g&amp;uuml;c&amp;uuml;n&amp;uuml;, pratikliğini. Pasımı atmak i&amp;ccedil;in bir şeyler araştırmam gerekiyordır. Derken kendimi her zaman ki gibi&amp;nbsp;&lt;strong&gt;Google&lt;/strong&gt;' da &lt;strong&gt;&lt;a href="http://ruby-doc.org/stdlib-2.3.1/" target="_blank"&gt;Ruby standart k&amp;uuml;t&amp;uuml;phanesi&lt;/a&gt;&lt;/strong&gt; ile ilgili faydalı kod par&amp;ccedil;alarını ararken buldum.&lt;/p&gt;
&lt;p&gt;Malumunuz kodlama yaparken&amp;nbsp;hayatımızı kolaylaştıran pek &amp;ccedil;ok fonskiyonellik, kullandığımız dillere ait standart k&amp;uuml;t&amp;uuml;phaneler i&amp;ccedil;erisinde gelmektedir. Genel ve temel ihtiya&amp;ccedil;ları barındıran bu k&amp;uuml;t&amp;uuml;phanalerin bir benzeri de doğal olarak Ruby programlama dili i&amp;ccedil;in s&amp;ouml;z konusu. Standart k&amp;uuml;t&amp;uuml;phane i&amp;ccedil;erisinde işlerimizi kolaylaştıracak yetenekli pek &amp;ccedil;ok tip ve fonksiyon yer almakta.&amp;nbsp;Ben makalenin ilerleyen b&amp;ouml;l&amp;uuml;mlerinde ge&amp;ccedil;tiğimiz hafta fırsat bulduk&amp;ccedil;a incelediğim bir ka&amp;ccedil; tanesine yer veriyorum.&lt;/p&gt;
&lt;h2&gt;Belki de tekil bir veri yapısına ihtiyacımız vardır&lt;/h2&gt;
&lt;p&gt;Bazı durumlarda &amp;ouml;zellikle kullanıcı tarafından gelen verilerin tekil olarak saklanacağı listelere ihtiyacımız olabilir. İşte &lt;strong&gt;set&lt;/strong&gt; tipini bu tip ihtiya&amp;ccedil;larda değerlendirebiliriz.&amp;nbsp;Kullanımı olduk&amp;ccedil;a basit olan Set sınıfına ait &amp;ouml;rnek bir kullanım şekli aşağıdaki kod par&amp;ccedil;asında yer almaktadır.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require 'set'

sepetteki_urunler=Set.new

sepetteki_urunler&amp;lt;&amp;lt;"patates"
sepetteki_urunler&amp;lt;&amp;lt;"domates"
sepetteki_urunler&amp;lt;&amp;lt;"Domates"
sepetteki_urunler&amp;lt;&amp;lt;"biber"
sepetteki_urunler&amp;lt;&amp;lt;"patlican"
sepetteki_urunler&amp;lt;&amp;lt;"domates"
sepetteki_urunler&amp;lt;&amp;lt;"biber"

puts "Sepette neler var bir bakalim \n"
puts sepetteki_urunler.entries&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/05/Ruby23_1.jpg" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;set&lt;/strong&gt; aslında &lt;strong&gt;hash&lt;/strong&gt; algoritmasını kullanarak i&amp;ccedil;erisine alınan elemanların tekil olmasını sağlayan bir tiptir. Tabii burada b&amp;uuml;y&amp;uuml;k k&amp;uuml;&amp;ccedil;&amp;uuml;k harf duyarlılığı da s&amp;ouml;z konusu. &amp;Ouml;rnek kod par&amp;ccedil;asında sepete eklenen bazı &amp;uuml;r&amp;uuml;nler olduğunu g&amp;ouml;rebilirsiniz. &lt;strong&gt;biber&lt;/strong&gt; ve &lt;strong&gt;domates&lt;/strong&gt; ikişer kez eklenmeye &amp;ccedil;alışılmış ama zaten veri yapısında olduklarından dahil edilmemişlerdir. &lt;strong&gt;domates&lt;/strong&gt; ve &lt;strong&gt;Domates&lt;/strong&gt; ise b&amp;uuml;y&amp;uuml;k k&amp;uuml;&amp;ccedil;&amp;uuml;k harf farkından dolayı ayrı kelimeler olarak değerlendirilmiştir. Atama işlemleri i&amp;ccedil;in &lt;strong&gt;&amp;lt;&amp;lt;&lt;/strong&gt; operat&amp;ouml;r&amp;uuml;nden yararlandığımıza l&amp;uuml;tfen dikkat edin. Ruby dilinin en sevdiğim &amp;ouml;zelliklerinden birisidir.&lt;/p&gt;
&lt;h2&gt;Log Atmak mı? Hi&amp;ccedil; bu kadar kolay olmamıştı&lt;/h2&gt;
&lt;p&gt;Uygulamaların olmazsa olmaz ve vazge&amp;ccedil;ilmez ihtiya&amp;ccedil;larından birisidir Loglama. Kod akışının izlenmesi&lt;em&gt;(trace)&lt;/em&gt;, hataların ayıklanması&lt;em&gt;(debug)&lt;/em&gt;, sistemin durumunun anlık olarak &amp;ouml;ğrenilmesi&lt;em&gt;(monitoring)&lt;/em&gt; ve daha pek &amp;ccedil;ok yerde karşımıza &amp;ccedil;ıkar bu &lt;strong&gt;Cross&amp;nbsp;Cutting&lt;/strong&gt; olarak adlandırdığımız mevzu. Ruby standart k&amp;uuml;t&amp;uuml;phanesi loglama işini kolaylaştıran bir tip i&amp;ccedil;ermektedir. Ruby on Rails i&amp;ccedil;erisinde de&amp;nbsp;yer alan&amp;nbsp;&lt;strong&gt;Logger&amp;nbsp;&lt;/strong&gt;sınıfının temel kullanımı ise aşağıdaki kod par&amp;ccedil;asında olduğu gibidir.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require 'logger'

logger=Logger.new("uygulama.log")

logger.info "bu bir log testidir"
logger.warn "Saniyorum bir hata olustu"
logger.debug "Debug logu yazdiriyorum"&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/05/Ruby23_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Gayet sade, gayet basit, gayet yalın. &lt;strong&gt;Logger&lt;/strong&gt; sınıfına ait &lt;strong&gt;logger&lt;/strong&gt; isimli nesne &amp;ouml;rneğini oluştururken dikkat edileceği &amp;uuml;zere yapıcı metoda bir dosya adı verdik. Aslında burada parametre olarak &lt;strong&gt;STDOUT&lt;/strong&gt;' da kullanabiliriz. Bunu kullandığımız takdirde &lt;strong&gt;log&lt;/strong&gt; mesajları ekrana basılacaktır. Kodun ilerleyen kısımları da olduk&amp;ccedil;a kolay. &lt;strong&gt;warn&lt;/strong&gt;, &lt;strong&gt;info&lt;/strong&gt; ve &lt;strong&gt;debug&lt;/strong&gt; metodları tipik log seviyelerini belirtmektedir. Hemen hemen t&amp;uuml;m loglama mekanizmalarında bu seviyelerin yer aldığını g&amp;ouml;rebiliriz. Tabii &lt;strong&gt;logger&lt;/strong&gt; sınıfının daha fazla detayı da mevcut. S&amp;ouml;z gelimi yapıcı metoda s&amp;uuml;re tanımlamaları yaparak log dosyasının fazla şişmesinin &amp;ouml;n&amp;uuml;ne de ge&amp;ccedil;ebiliriz. Adamlar her şeyi d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorlar.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;# Sadece son bir aylik logu tut
Logger.new('app_1.log', 'monthly')  
# Bugunden itibaren gecmis 20 gunluk logu tut
Logger.new('app_1.log', 20, 'daily')  
# log boyutu 100mb uzerine cikarsa
Logger.new('app_1.log', 0, 100 * 1024 * 1024)&lt;/pre&gt;
&lt;h2&gt;Path bilgileri ile &amp;ccedil;alışmak&lt;/h2&gt;
&lt;p&gt;&amp;Ouml;zellikle dosya ve klas&amp;ouml;r işlemleri i&amp;ccedil;in kullanılabilen &lt;strong&gt;pathname&lt;/strong&gt; sınıfı epey işe yarar fonksiyonellikler i&amp;ccedil;ermektedir. &amp;Ccedil;ok basit anlamda aşağıdaki kod par&amp;ccedil;asında bir dosya ile ilişkili bilgileri nasıl alabiliriz, metin tabanlı i&amp;ccedil;eriğini satır bazında nasıl okuyabiliriz ya da o an &amp;ccedil;alışmakta olduğumuz klas&amp;ouml;rdeki &amp;ouml;ğeleri nasıl listeyebiliriz&amp;nbsp;gibi temel işlemler icra edilmektedir.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require 'pathname'

cwd = Pathname.getwd # current working directory
puts "Bulundugumuz klasordeki dosyalar\n"
cwd.each_child {|f| puts f}

pn = Pathname.new("uygulama.log")
puts "\n#{pn.basename} icin dosya boyutu #{pn.size} byte\n"
puts "Dosyanin tam yolu #{pn.expand_path}"
puts "Dosya uzantisi #{pn.extname}"
puts "Dosya icerigi\n"
pn.each_line {|line| puts line }&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/05/Ruby23_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;getwd&lt;/strong&gt; isimli metod tahmin edileceği &amp;uuml;zere uygulamanın &amp;ccedil;alışmakta olduğu klas&amp;ouml;r&amp;uuml; d&amp;ouml;nd&amp;uuml;rmektedir. &lt;strong&gt;each_child&lt;/strong&gt; metodu ile bu veya belirtilen diğer bir klas&amp;ouml;r i&amp;ccedil;erisindeki &amp;ouml;ğeleri dolaşabiliriz. Belli bir dosya ile ilgili işlemler yapmak i&amp;ccedil;in yapıcı metoda dosya adını vermemiz yeterlidir. Sonrasında dosyanın boyutunu, sistemde yer aldığı klas&amp;ouml;r&amp;uuml;, uzantısını&amp;nbsp;ve hatta metin tabanlı i&amp;ccedil;eriğini de ilgili fonksiyonlar ve alanlar ile yakalayabiliriz.&amp;nbsp;&lt;strong&gt;basename&lt;/strong&gt;, &lt;strong&gt;expand_path&lt;/strong&gt;, &lt;strong&gt;extname&lt;/strong&gt;, &lt;strong&gt;size&lt;/strong&gt; &amp;ouml;zellikleri ile &lt;strong&gt;dosya adını&lt;/strong&gt;,&lt;strong&gt; tam yol adını&lt;/strong&gt;, &lt;strong&gt;dosya&lt;/strong&gt;&amp;nbsp;&lt;strong&gt;uzantısını&lt;/strong&gt; ve &lt;strong&gt;byte cinsinden&lt;/strong&gt;&amp;nbsp;&lt;strong&gt;dosya boyutunu&lt;/strong&gt; &amp;ouml;ğrenmekteyiz. &lt;strong&gt;each_line&lt;/strong&gt; metodu da tahmin edileceği &amp;uuml;zere dosya i&amp;ccedil;eriğini satır bazında okumamıza yaramaktadır.&lt;/p&gt;
&lt;h2&gt;O zaman biraz da matematik ve asal sayılar diyelim&lt;/h2&gt;
&lt;p&gt;Standart k&amp;uuml;t&amp;uuml;phane &lt;strong&gt;asal&lt;/strong&gt; sayılar ile ilgili &lt;strong&gt;Prime&lt;/strong&gt; isimli bir tip&amp;nbsp;i&amp;ccedil;ermektedir. Bu tip&amp;nbsp;ile sadece bir ve kendisine b&amp;ouml;l&amp;uuml;nebilen sayılarla &amp;ccedil;alışmamız olduk&amp;ccedil;a kolaydır. &amp;Ouml;rnek kod par&amp;ccedil;asına bir bakalım.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require 'prime'

puts "5 asal mi? #{5.prime?}"
puts "3 asal mi? #{3.prime?}"
puts "8888 asal mi? #{8888.prime?}"

puts "Buyrun bunlar da 100 adet asal sayi"
print Prime.take(100)

total=0
Prime.each(11){|p|total+=p}
puts "\n11e kadar olan asal sayilarin toplami #{total} imis"&lt;/pre&gt;
&lt;p&gt;Sayısal değerlerin arkasına eklenen&amp;nbsp;&lt;strong&gt;prime?&lt;/strong&gt; &amp;ccedil;ağrısı ile ilgili değerin asal sayı olup olmadığı bilgisi &lt;strong&gt;true&lt;/strong&gt; veya &lt;strong&gt;false&lt;/strong&gt; olarak elde edilebilir. Dilersek belirli sayıda asal sayıyı da &amp;ccedil;ekebiliriz. &lt;strong&gt;take&lt;/strong&gt; metodu aldığı parametre değeri kadar asal sayıyı sisteme geri verir. &lt;strong&gt;each&lt;/strong&gt; metodu ile verilen asal sayıya kadar olan asallar elde edilebilir. &amp;Ouml;rnek kod par&amp;ccedil;asında &lt;strong&gt;11&lt;/strong&gt; dahil &lt;strong&gt;2,3,5,7,11&lt;/strong&gt; sayılarının toplamı hesaplanmıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/05/Ruby23_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Bir şeyleri &amp;ouml;l&amp;ccedil;&amp;uuml;mleyelim mi?&lt;/h2&gt;
&lt;p&gt;&amp;Ouml;rneğin &lt;strong&gt;PI&lt;/strong&gt; sayısını &lt;strong&gt;100bin&lt;/strong&gt; haneli olacak şekilde elde etmek istiyoruz. Acaba uygulamanın &amp;uuml;zerinde &amp;ccedil;alıştığı sistem bunu ne kadar s&amp;uuml;rede yapabilir? Hemen &amp;ouml;ğrenmek ister misiniz? İşte gerekli kod par&amp;ccedil;ası.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require 'benchmark'
require 'bigdecimal/math'

puts Benchmark.measure{BigMath.PI(100_000)}&lt;/pre&gt;
&lt;p&gt;ve sonu&amp;ccedil;lar.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/05/Ruby23_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabii d&amp;ouml;rt farklı değer gelmesi eminim sizi şaşırtmıştır. Bu değerler sırasıyla&amp;nbsp;&lt;strong&gt;User CPU Time&lt;/strong&gt;, &lt;strong&gt;System CPU Time&lt;/strong&gt;, &lt;strong&gt;User CPU Time+System CPU Time&lt;/strong&gt; ve son olarak &lt;strong&gt;Elapsed Real Time&lt;/strong&gt;. Son derece basit &amp;ouml;yle değil mi? Tahmin edileceği &amp;uuml;zere &lt;strong&gt;{}&lt;/strong&gt; blokları arasında &amp;ouml;l&amp;ccedil;&amp;uuml;mlemesini yapmak istediğimiz kod par&amp;ccedil;asını yazmaktayız. Dolayısıyla burada iş yapan bir metod da kullanılabilir.&lt;/p&gt;
&lt;p&gt;Aşağıdaki kod par&amp;ccedil;asını bu anlamda g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require 'find'
require 'benchmark'

def FindTotalSize()
	totalSize=0
	Find.find(Dir.pwd) { |p|
		totalSize += FileTest.size(p)
	}
	puts totalSize
	totalSize
end

puts Benchmark.measure{FindTotalSize()}&lt;/pre&gt;
&lt;p&gt;Bu kez &lt;strong&gt;FindTotalSize&lt;/strong&gt; isimli metodun iş yapma hızı elde edilmiştir. Yeri gelmişken &lt;strong&gt;FindTotalSize&lt;/strong&gt; metodu ne yapıyor bakalım. İ&amp;ccedil;eride kullanılan Find mod&amp;uuml;l&amp;uuml;ne ait olan find metodu ile o an &amp;ccedil;alışmakta olduğumuz klas&amp;ouml;rdeki&lt;em&gt;(Dir.pwd deki &lt;strong&gt;pwd=Present Working Directory&lt;/strong&gt; anlamındadır)&lt;/em&gt; dosyaların toplam boyutu elde edilmeye &amp;ccedil;alışılır. Bunun i&amp;ccedil;in &lt;strong&gt;FileTest.size&lt;/strong&gt; metodundan yararlanılır ve i&amp;ccedil;erideki dosyaların boyutları &amp;uuml;st &amp;uuml;ste eklenerek hesaplanır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/05/Ruby23_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;CSV Formatlı dosyalar ile kolayca &amp;ccedil;alışalım&lt;/h2&gt;
&lt;p&gt;Veriyi text tabanlı olarak tutmak en eskiden beri bilinen y&amp;ouml;ntemlerdendir. Bu i&amp;ccedil;eriği formatlı tutmak okunabilirlik ve verinin ayrıştırılarak kolayca anlaşılabilmesi a&amp;ccedil;ısından da &amp;ouml;nemlidir. Veriyi satırlar ve s&amp;uuml;tunlar halinde d&amp;uuml;ş&amp;uuml;n&amp;uuml;p &amp;ccedil;eşitli seperat&amp;ouml;rler ile ayrıştırmak gerekir. &lt;a href="https://en.wikipedia.org/wiki/Comma-separated_values" target="_blank"&gt;CSV&lt;/a&gt;&lt;strong&gt;&lt;em&gt;(comma-seperated values) &lt;/em&gt;&lt;/strong&gt;sık kullanılan dosya formatlarındandır. Ruby programlama dili &lt;strong&gt;CSV&lt;/strong&gt;'ler ile kolay bir şekilde &amp;ccedil;alışabilmemizi sağlar. Yine en ilkel seviyede nasıl kullanıldığına bir bakalım dilerseniz. İşte &amp;ouml;rnek kod par&amp;ccedil;amız.&lt;/p&gt;
&lt;pre class="brush:ruby;auto-links:false;toolbar:false" contenteditable="false"&gt;require 'csv'

puts "Once information.csv icine bir seyler yazalim"
CSV.open("informations.csv","wb") do |file|

	file&amp;lt;&amp;lt;["id","title","category","listPrice"]
	file&amp;lt;&amp;lt;["1001","Locitek Fare","Bilgisayar Donanim","45 dolar"]
	file&amp;lt;&amp;lt;["1002","Deli Bilgisayar","Bilgisayar","1045 dolar + Tabii ki KDV"]
	file&amp;lt;&amp;lt;["1003","kespir tablet","Tablet","400 TL + KDV"]

end

puts "ve simdi de satir satir okuyalim"
CSV.foreach("informations.csv") do |line|
	puts line.inspect
end&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2016/05/Ruby23_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bir &lt;strong&gt;CSV&lt;/strong&gt; dosyasını oluşturmak gayet kolaydır. Bunun i&amp;ccedil;in&amp;nbsp;&lt;strong&gt;open&lt;/strong&gt; metoduna uygun parametreleri vermemiz yeterlidir. Dosya a&amp;ccedil;ıldıktan sonra i&amp;ccedil;erisine satır atmak &amp;ccedil;ok daha kolaydır. &lt;strong&gt;&amp;lt;&amp;lt;&lt;/strong&gt; operat&amp;ouml;r&amp;uuml;n&amp;uuml; kullanarak bu işlemi ger&amp;ccedil;ekleştirebiliriz. &lt;strong&gt;CSV&lt;/strong&gt; uzantılı bir i&amp;ccedil;eriği okumanın farklı y&amp;ouml;ntemleri vardır. Bunlardan birisi de kod par&amp;ccedil;asında g&amp;ouml;r&amp;uuml;len &lt;strong&gt;foreach&lt;/strong&gt; metodudur. &lt;strong&gt;foreach&lt;/strong&gt; ilgili dosya i&amp;ccedil;eriğini satır bazında okumaktadır.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere standart k&amp;uuml;t&amp;uuml;phane i&amp;ccedil;erisinde bir &amp;ccedil;ok işe yarar fonksiyonellik bulunmaktadır.&amp;nbsp;Makalemizde değindiğimiz tiplerin daha pek &amp;ccedil;ok &amp;ouml;zelliği bulunuyor. &lt;a href="http://ruby-doc.org/stdlib-2.3.1/" target="_blank"&gt;Bunlar i&amp;ccedil;in mutlaka Ruby Dok&amp;uuml;mantasyonlarına bakmanızı &amp;ouml;neririm&lt;/a&gt;. Zaten Ruby dilini etkin kullanmak istiyorsak ilgili dok&amp;uuml;manda belirtilen tipleri ele alıp g&amp;ouml;z&amp;uuml;m&amp;uuml;ze kestirdiklerimizi &amp;ouml;nceliklendirmek suretiyle &amp;ccedil;alışmamızda&amp;nbsp;yarar olduğu kanısındayım. Nitekim &amp;ccedil;ok fazla k&amp;uuml;t&amp;uuml;phane bulunuyor. B&amp;ouml;ylece geldik bir Ruby Kod Par&amp;ccedil;acığımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2016-05-31 21:00:00</pubDate>
  <slug>ruby-kod-parcaciklari-23-bir-kac-kirinti-daha</slug>
  <tags>
    <tag>ruby</tag>
    <tag>benchmark</tag>
    <tag>logger</tag>
    <tag>logging</tag>
    <tag>cross-cuttings</tag>
    <tag>set</tag>
    <tag>standard-library</tag>
    <tag>pathname</tag>
    <tag>prime</tag>
    <tag>mathematics</tag>
  </tags>
  <categories>
    <category>Ruby</category>
  </categories>
</post>