<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Nginx Üzerinde Web API Servisi Çalıştırmak</title>
  <description>Nginx(Engine X olarak telafuz ediliyor) Kazakistan Almatı doğumlu bilgisyar programcısı Igor Sysoev tarafından 2002 yılında geliştirilmeye başlanmış ve 2004 yılında ürünleşmiş açık kaynak bir web sunucusudur. İlk olarak mail.ru için mail sunucu olarak geliştirilmiş ama sonrasında çok daha geniş yetenekler kazanarak web siteleri için Apache'den çok daha hızlı çalışabilen bir sunucu haline gelmiştir. Henüz doğrulayamadığım ama genel kabul görmüş bazı performans testlerine göre muadili olan Apache ve Lightpdd gibi ürünlere göre çok yüksek cevap süreleri ve minimum bellek tüketimi sağlamaktadır. Bu açılardan oldukça popüler olduğunu ifade edebiliriz. Yük dengeleme(Load Balancing), Sana sunucu(Virtual Host), Otomatik indeksleme ve ters vekil sunucu(Reverse Proxy) gibi temel özellikleri vardır.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/12/nginxcore_1.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Animasyon izlemek keyif aldığım hobilerden birisi. İzlediğimde bende derin izler ve duygular bırakmış uzun metrajlı bir &amp;ccedil;ok anım var. Bazen filmde ge&amp;ccedil;en bir s&amp;ouml;z bazen karakterin g&amp;uuml;lme krizine sokan bir davranışı ya da başına gelen dramatik bir olay. Ge&amp;ccedil;enlerde bilmem ka&amp;ccedil;ıncı kez izlediğim &lt;a href="http://www.imdb.com/title/tt3470600/" target="_blank"&gt;Sing&lt;/a&gt;&amp;nbsp;filmi de benim uzun metraj anı defterim arasında yer alanlardan.&amp;nbsp;Maddi sorunlar nedeniyle banka ile başı dertten kurtulamayan Buster Moon, filmin bir yerinde tam b&amp;uuml;t&amp;uuml;n &amp;uuml;mitlerin t&amp;uuml;kendiği noktada ş&amp;ouml;yle bir c&amp;uuml;mle sarf ediyor;&lt;/p&gt;
&lt;p&gt;"When you've reached rock bottom, there's only one way to go, and that's up!"&lt;/p&gt;
&lt;p&gt;T&amp;uuml;rk&amp;ccedil;e metrajlı &amp;ccedil;evirisinde, "dibe indiğin zaman gidilecek tek bir y&amp;ouml;n kalır. O da, YUKARISIIII!" gibi bir şeydi yanlış hatırlamıyorsam. Benim i&amp;ccedil;inde&amp;nbsp;2017 sonu ve 2018 başlangıcı bu s&amp;ouml;zde ifade edilene benzer oldu diyebilirim. Şimdi&amp;nbsp;merkez st&amp;uuml;dyolarımıza bağlanıyoruz.&lt;/p&gt;
&lt;p&gt;Bir zamanlar &amp;uuml;zerinde &amp;ccedil;alıştığım bir vakada, WCF ile yazılmış bir REST servisinin Authorization mekanizmasını &amp;ouml;zelleştirip, IIS &amp;uuml;zerinden SSL ile host etmek i&amp;ccedil;in uğraşmaktaydım. Servisi yazmak, IIS'e atmak, IIS tarafında deneysel sertifika &amp;uuml;retip siteyi SSL ile &amp;ccedil;ağrılabilir hale getirmek, ServiceAuthorizationManager t&amp;uuml;revli sınıfı devreye&amp;nbsp;alarak yetkilendirme s&amp;uuml;recini ele almak&amp;nbsp;kolaydı. Birka&amp;ccedil; k&amp;uuml;&amp;ccedil;&amp;uuml;k ince ayarlama derken kendimi test sahasında buldum. Ne var ki bir şekilde servisin ayağa kalkması sırasında hatalar alıyordum. Sonunda olan oldu ve uğraştığım senaryodan sıkılıp bunaldığım bir noktaya geldim.&lt;/p&gt;
&lt;p&gt;Kendi kendime "ben bunu West-World ya da Gondor &amp;uuml;zerinde deneyeyim" diyordum. Her ikisi de Ubuntu 16.04 versiyonlarına sahip bilgisayarlardı. Kolları sıvadım ve bir Web API servisi oluşturmak &amp;uuml;zere terminalin başına ge&amp;ccedil;tim. Ne var ki ortada &amp;ouml;nemli bir sorun vardı. Linux ve IIS. Ovv yooo...Tabiki b&amp;ouml;yle bir birliktelik olamazdı. Eldeki alternatiflerse belliydi. Apache Server, Lighttpd ve Nginx. G&amp;ouml;z&amp;uuml;me kestirdiğimse Nginx oldu. Konu bir anda bambaşka bir yere geldi tabii. Şimdiki amacım, West-World'de kuracağım NGinX ortamı &amp;uuml;zerinde &amp;ouml;rnek bir Asp.Net Core Web API servisini host ettirmekti.&lt;/p&gt;
&lt;h1&gt;Nginx&lt;/h1&gt;
&lt;p&gt;&lt;em&gt;&lt;a href="https://nginx.org/en/" target="_blank"&gt;Nginx&lt;/a&gt;(Engine X olarak telafuz ediliyor)&lt;/em&gt; Kazakistan Almatı doğumlu bilgisayar programcısı Igor Sysoev&lt;em&gt;(soyisminde sys var)&lt;/em&gt; tarafından 2002 yılında geliştirilmeye başlanmış ve 2004 yılında &amp;uuml;r&amp;uuml;nleşmiş a&amp;ccedil;ık kaynak bir web sunucusudur. İlk olarak mail.ru i&amp;ccedil;in mail sunucusu olarak geliştirilmiş ama sonrasında &amp;ccedil;ok daha geniş yetenekler kazanarak web siteleri i&amp;ccedil;in Apache'den &amp;ccedil;ok daha hızlı &amp;ccedil;alışabilen bir&amp;nbsp;&amp;uuml;r&amp;uuml;n haline gelmiştir. Hen&amp;uuml;z doğrulayamadığım ama genel kabul g&amp;ouml;rm&amp;uuml;ş bazı performans testlerine g&amp;ouml;re muadili olan Apache ve Lighttpd gibi &amp;uuml;r&amp;uuml;nlere g&amp;ouml;re &amp;ccedil;ok y&amp;uuml;ksek cevap s&amp;uuml;releri ve minimum bellek t&amp;uuml;ketimi sağlamaktadır. Bu a&amp;ccedil;ılardan olduk&amp;ccedil;a pop&amp;uuml;ler olduğunu ifade edebiliriz. Y&amp;uuml;k dengeleme(Load Balancing), Sanal sunucu(Virtual Host), Otomatik indeksleme ve ters vekil sunucu(Reverse Proxy) gibi temel &amp;ouml;zellikleri vardır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Nginx'in geliştirilme hikayesinin detaylarını okumaya devam ediyorum. Aslında C10K sorunu olarak adlandırılan bir vakaya istinaden geliştirilmiş. C10K, bir web sunucusunun eş zamanlı onbin talep &amp;uuml;st&amp;uuml;n&amp;uuml; kaldıramaması olarak ifade ediliyor &lt;em&gt;(&lt;a href="http://www.kegel.com/c10k.html" target="_blank"&gt;Şu adresten&lt;/a&gt; Kegel'in konu ile ilgili dok&amp;uuml;manına ulaşabilirsiniz)&lt;/em&gt; Diğer yandan Nginx, ağırlıklı olarak Apache ile karşılaştırılmakta. Dikkatimi &amp;ccedil;eken en &amp;ouml;nemli fark ise Apache'nin Multi-Thread &amp;ccedil;alışırken Nginx'in talepleri karşılama noktasında Single-Thread &amp;ccedil;alışma prensibini kullanması.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;Kurulum&lt;/h1&gt;
&lt;p&gt;Bu d&amp;uuml;ş&amp;uuml;nceler ile birlikte her zamanki gibi &amp;ccedil;alışma odamın yolunu tuttum. Amacım basit bir Web API hizmetini&lt;em&gt;(standart şablonda &amp;uuml;retilecek olan)&lt;/em&gt; nginx &amp;uuml;zerinde host etmek.&amp;nbsp;&amp;Ouml;ncesinde West-World'e NGinx'i kurmam gerekiyor. Terminal'den aşağıdaki komutları kullanarak kurulum adımlarını ger&amp;ccedil;ekleştirdim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo apt-get install nginx
sudo service nginx start
sudo service nginx status&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/12/nginxcore_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;install komutu ile kurulum yapıldıktan sonra start ile nginx servisini başlatıyoruz. status ile de g&amp;uuml;ncel durumunu g&amp;ouml;r&amp;uuml;yoruz. Yeşil renkteki active(running) yazısını g&amp;ouml;rmek g&amp;uuml;zel.&lt;/p&gt;
&lt;h1&gt;Y&amp;ouml;nlendirme Ayarları&lt;/h1&gt;
&lt;p&gt;Nginx kurulduktan sonra Reverse Proxy Server olarak &amp;ccedil;alışması i&amp;ccedil;in bir ayar yapmam gerekiyor. Bu sayede Nginx sunucusuna gelen talepler Web API'nin ayağa kalktığı Kestrel sunucusunun ilgili adresine y&amp;ouml;nlendirilecekler. Pek tabii tam tersi istikamette s&amp;ouml;z konusu. Aslında istemciler hi&amp;ccedil;bir şeyin farkında olmayacaklar. Web API'ye tarayıcıdan yapılan HTTP &amp;ccedil;ağrıları aslında Nginx sunucusu tarafından karşılanıp arka taraftaki asıl Kestrel &amp;ccedil;alışma zamanına akıtılacak. Bunun &amp;uuml;zerine&amp;nbsp;/etc/nginx/sites-available/default dosyasını gedit ile a&amp;ccedil;ıp i&amp;ccedil;eriğinde aşağıdaki d&amp;uuml;zenlemeyi yaptım.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;server 
{
   listen 81; 
   location / 
   {      
      proxy_pass http://localhost:5000;
      proxy_http_version 1.1;
      proxy_set_header Upgrade $http_upgrade;
      proxy_set_header Connection keep-alive;
      proxy_set_header Host $host;
      proxy_cache_bypass $http_upgrade;
   }
}&lt;/pre&gt;
&lt;p&gt;Normalde localhost:80 şeklinde 80 portunun dinlenmesi s&amp;ouml;z konusu ama makinede 80 portunu kullanan Apache sunucusunu bozmak istemedim doğruyu s&amp;ouml;ylemek gerekirse. Bu y&amp;uuml;zden deneme olması a&amp;ccedil;ısından 81 nolu portu ele alıyorum. proxy_pass bildirimine g&amp;ouml;re http://localhost:81 adresine gelecek olan istekler http://localhost:5000&amp;nbsp;'e y&amp;ouml;nlendirilecek ki bu da Web API uygulamasının varsayılan olarak &amp;ccedil;alıştığı adres&lt;em&gt;(biliyorsunuz bu adresleri senaryoya g&amp;ouml;re değiştirebiliriz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Yapılan değişiklikleri devreye alabilmek i&amp;ccedil;in terminalden bir ka&amp;ccedil; işlem&amp;nbsp;daha yapmak&amp;nbsp;gerekiyor.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo nginx -t
sudo nginx -s reload&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/12/nginxcore_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İlk komut ile konfigurasyon i&amp;ccedil;in yapılan değişiklikler test&amp;nbsp;edilip bir sorun olup olmadığına bakılıyor. reload komutu da yeni değişikliklerin &amp;ccedil;alışma zamanına yeniden y&amp;uuml;klenmesi i&amp;ccedil;in kullanılmakta.&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;Service Definition Dosyasının Oluşturulması&lt;/h1&gt;
&lt;p&gt;Şimdi biraz d&amp;uuml;ş&amp;uuml;nelim. Nginx platform bağımsız bir web sunucusu. Yazacağım Asp.Net Web API uygulaması ise normal şartlarda kendi web sunucusunu(Kestrel) kullanıyor. Her ikisi de farklı Process'ler anlamına gelebilir. Dolayısıyla Nginx'in yazılacak WebAPI servisi &amp;ouml;zelinde ilgili Kestrel Process'ini ayağa kaldıracağını bilmesi gerekiyor. IIS'in Worker Process &amp;ccedil;alışma modeline benzer bir yaklaşım olarak d&amp;uuml;ş&amp;uuml;nelim. Bunun i&amp;ccedil;in service uzantılı bir dosya yazmak lazım. Senaryomda bunu&amp;nbsp;kestrel-baseapi.service şeklinde isimlendirdim&lt;em&gt; (Dosyanın oluşturulduğu yer &amp;ouml;nemli. etc altındaki systemd altındaki system atlında olsun l&amp;uuml;tfen)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo gedit /etc/systemd/system/kestrel-baseapi.service&lt;/pre&gt;
&lt;p&gt;Dosya i&amp;ccedil;eriği ise şu şekilde&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;[Unit]
Description=BaseWebAPI(Standard Asp.Net Web API 2.0 project) on NGinx

[Service]
WorkingDirectory=/var/www/core/BaseWebAPI
ExecStart=/usr/bin/dotnet/ /var/www/core/BaseWebAPI/BaseWebAPI.dll
Restart=always
RestartSec=30
SyslogIdentifier=dotnet-BaseWebAPI
User=www-data
Environment=ASPNETCORE_ENVIRONMENT=Production
Environment=DOTNET_PRINT_TELEMETRY_MESSAGE=false

[Install]
WantedBy=multi-user.target&lt;/pre&gt;
&lt;p&gt;Dosya i&amp;ccedil;erisinde neler var ş&amp;ouml;yle bir bakmakta yarar var. Unit, Service ve Install isimli &amp;uuml;&amp;ccedil; par&amp;ccedil;adan oluşan bir i&amp;ccedil;erik s&amp;ouml;z konusu. Eminim &amp;ccedil;ok daha fazla detay yazılabiliyordur ama&amp;nbsp;Nginx kaynaklarından &amp;ouml;ğrendiğim kadarıyla bu i&amp;ccedil;erik yeterli. En &amp;ouml;nemli b&amp;ouml;l&amp;uuml;m service kısmı. WorkingDirectory ile WebAPI&amp;nbsp;projesinin olduğu yer işaret ediliyor&lt;em&gt;(ki hen&amp;uuml;z oluşturmadım)&lt;/em&gt; ExecStart komutu&amp;nbsp;iki parametre alıyor. İlki dotnet programının yerini işaret etmekte. İkinci parametre ise Web API uygulamasının publish edilen dll dosyasını. Bir başka deyişle Nginx'in talep sonrası dotnet run BaseWebAPI&amp;nbsp;işlemini uygulaması&amp;nbsp;sağlanıyor. Restart ve Restartsec &amp;ouml;zelliklerine atanan değerler, ilgili web uygulamasının başı belaya girerse 30 saniye sonra tekrardan restart edilmesini belirtmekte. SyslogIdentifier ile de&amp;nbsp;uygulamanın Nginx tarafında&amp;nbsp;izlenirken kullanılacak olan takma ad olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmeli.&amp;nbsp;Diğer Environment değerleri ne anlama geliyor hen&amp;uuml;z bilmiyorum ama &amp;ouml;ğrenmek i&amp;ccedil;in epey zamanım var.&lt;/p&gt;
&lt;h1&gt;Web API Hizmetinin Yazılması&lt;/h1&gt;
&lt;p&gt;Standart web api şablonundan bir proje oluşturup bunu uygun klas&amp;ouml;re publish etmem gerekiyor. Komut satırından her zaman yaptığım gibi projeyi oluşturuyorum.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new webapi -o BaseWebAPI&lt;/pre&gt;
&lt;p&gt;Bu adımdan sonra startup.cs dosyasında bir değişiklik yapılması &amp;ouml;neriliyor. Bunun sebebi Reverse Proxy'ye gelen taleplerin NGinx'in istediği Header t&amp;uuml;rlerine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmesi gerekliliği.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Microsoft.AspNetCore.Builder;
using Microsoft.AspNetCore.Hosting;
using Microsoft.AspNetCore.HttpOverrides;
using Microsoft.Extensions.Configuration;
using Microsoft.Extensions.DependencyInjection;

namespace BaseWebAPI
{
    public class Startup
    {
        public Startup(IConfiguration configuration)
        {
            Configuration = configuration;
        }

        public IConfiguration Configuration { get; }

        public void ConfigureServices(IServiceCollection services)
        {
            services.AddMvc();
        }

        public void Configure(IApplicationBuilder app, IHostingEnvironment env)
        {
            if (env.IsDevelopment())
            {
                app.UseDeveloperExceptionPage();
            }

            app.UseForwardedHeaders(new ForwardedHeadersOptions
            {
                ForwardedHeaders = ForwardedHeaders.XForwardedFor | ForwardedHeaders.XForwardedProto
            });
            app.UseAuthentication();
            app.UseMvc();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;S&amp;ouml;z konusu d&amp;ouml;n&amp;uuml;ş&amp;uuml;mler i&amp;ccedil;in Middleware katmanına m&amp;uuml;dahale edilmesi lazım. UseForwardedHeaders fonksiyonu bu noktada devreye girmekte. Bu işlemin ardından Publish ile dll &amp;uuml;retimini yapmam yeterli. Publish adresi olarak service dosyasında belirttiğim klas&amp;ouml;r&amp;uuml; kullanmayı tercih ediyorum.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo dotnet publish -o /var/www/core/BaseWebAPI&lt;/pre&gt;
&lt;h1&gt;Toparlayabilirim&lt;/h1&gt;
&lt;p&gt;kestrel-baseapi.service ve Web API&amp;nbsp;uygulaması hazır olduğuna g&amp;ouml;re systemctl&lt;em&gt;(linux tabanlı sistemler i&amp;ccedil;in kullanılan servis y&amp;ouml;neticisidir. Aslında systemd'nin organizasyonundaki &amp;ccedil;eşitli servislerin y&amp;ouml;netilmesinde kullanılır. Buradaki senaryoda Nginx hizmetleri mevzubahistir)&lt;/em&gt; ile service dosyasını &amp;ccedil;alıştırabilir ve son durumu izleyebilirim. Terminalin başına ge&amp;ccedil;iyorum ve aşağıdaki komutları sırasıyla &amp;ccedil;alıştırıyorum.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo systemctl enable kestrel-baseapi.service
sudo systemctl start kestrel-baseapi.service
sudo systemctl status kestrel-baseapi.service&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/12/nginxcore_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İlk komut ile&amp;nbsp;yazılan service&amp;nbsp;dosyası&amp;nbsp;devreye alınmakta&lt;em&gt;(disable ile devre dışı kalacağını da belirtelim)&lt;/em&gt;&amp;nbsp;İkinci komut ile&amp;nbsp;servis başlatılmakta&amp;nbsp;ve son komutla da anlık durum hakkında bilgi alınabilmekte. Aslında hepsi bu kadar. Tarayıcımdan&amp;nbsp;http://localhost:81/api/values&amp;nbsp;şeklinde talepte bulunduğumda aşağıdaki gibi Web API servisinin &amp;ccedil;alıştırıldığını g&amp;ouml;r&amp;uuml;yorum. İşte bir mutluluk anı daha.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/12/nginxcore_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hatta kestrel-baseapi.service hizmetini pasif hale getirip aynı talebi yaptığımda Nginx'in bana o g&amp;uuml;zelim 502 hata sayfasını&amp;nbsp;g&amp;ouml;sterdiğini de g&amp;ouml;r&amp;uuml;yorum. Bu ger&amp;ccedil;ekten de istenildiği gibi proxy'nin &amp;ccedil;alıştığının ispatı aslında.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;systemctl stop kestrel-baseapi.service&lt;/pre&gt;
&lt;p&gt;sonrası durum&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/12/nginxcore_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Benim i&amp;ccedil;in&amp;nbsp;araştırması, &amp;ouml;ğrenmesi ve yazılması keyifli bir makalenin daha sonuna gelmiş bulunuyoruz. Bu yazıda bir Asp.Net Core Web API uygulamasının Ubuntu'da y&amp;uuml;kl&amp;uuml; Nginx&amp;nbsp;web sunucusu &amp;uuml;zerinden nasıl host edilebileceğini&amp;nbsp;incelemeye &amp;ccedil;alıştım. Microsoft ve .Net &amp;uuml;r&amp;uuml;nlerine aşina olanlar i&amp;ccedil;in IIS yerine NGinx'i koyduk diyebiliriz de. Tabii işin &amp;ccedil;ok daha fazla detayı olduğunu biliyoruz. &amp;Ouml;rneğin Load Balancing mevzusu, SSL tabanlı iletişimin kurulması, Authentication mekanizmaları vb konular var. Bunları da incelemeye &amp;ccedil;alışacağım. Ancak konuya k&amp;uuml;&amp;ccedil;&amp;uuml;k bir grizgah yaptığımızı da ifade edebilirim sanıyorum ki. Bu arada &amp;ouml;zellikle Microservice mimarisinin y&amp;uuml;ksek d&amp;uuml;zey mimari g&amp;ouml;r&amp;uuml;n&amp;uuml;me sahip basit bir &amp;ouml;rnek &amp;uuml;zerinden incelemek isterseniz Nginx'in &lt;a href="https://www.nginx.com/blog/introduction-to-microservices/" target="_blank"&gt;şu adresteki yazısını&lt;/a&gt; şiddetle tavsiye ederim. Renkli kalemlerinizi de hazır edin. Yazıyı okurken mimari &amp;ccedil;izimleri siz de &amp;ccedil;izmeye &amp;ccedil;alışın ve bilginizi pekiştirin derim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/12/nginxcore_9.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekte Uber benzeri bir taksi &amp;ccedil;ağırma &amp;uuml;r&amp;uuml;n&amp;uuml;n&amp;uuml;n geliştirilmesi konu alınmış. &amp;Ouml;nce mimari bildiğimiz Monolithic yaklaşım &amp;uuml;zerine kurgulanıyor. Her şey g&amp;uuml;ll&amp;uuml;k g&amp;uuml;listanlık giderken iş birimlerinden gelen yeni talepler, devreye alınan par&amp;ccedil;lar ve kalabalıklaşan kodlar sebebiyle sistem b&amp;uuml;y&amp;uuml;d&amp;uuml;k&amp;ccedil;e b&amp;uuml;y&amp;uuml;meye başlıyor. Performans d&amp;uuml;ş&amp;uuml;yor, y&amp;ouml;netim ve &amp;ouml;l&amp;ccedil;eklenebilirlik zorlaşıyor, bakım maliyetleri artıyor. Sonrasında aynı senaryonun micoservice mimari yaklaşımı ile nasıl ele alınabileceği masaya yatırılıyor. Her iki yaklaşımın artı ve eksilerini g&amp;ouml;rebilmek a&amp;ccedil;ısından olduk&amp;ccedil;a g&amp;uuml;zel ve doyurucu bir yazı olduğunu ifade etmek isterim.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2018-01-05 08:54:00</pubDate>
  <slug>nginx-uzerinde-web-api-servisi-calistirmak</slug>
  <tags>
    <tag>net-core</tag>
    <tag>aspnet-core-web-api</tag>
    <tag>nginx</tag>
    <tag>apache</tag>
    <tag>service</tag>
    <tag>systemctl</tag>
    <tag>kestrel</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
  </categories>
</post>