<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>.Net Remoting ve Event Mimarisi</title>
  <description>Remoting mimarisinde temel amaç, istemcilerin uzak nesnelere (remote objects) erişmelerini sağlamak ve bu nesneler üzerindeki metodları çalıştırmaktır. .Net Remoting için en çok kullanılan model Marshall By Referance modelidir. Bu modelde istemciler uzak nesneler ile, sunucu üzerinde oluşturulan uzak nesne referansları yoluyla konuşurlar. Ancak bazı durumlarda, uzak nesnelerin yer aldığı sunucu uygulamalar, istemciler üzerinde yer alan metodları çalıştırmak isteyebilir. Böyle bir durumda roller süreç içerisinde istemci ve sunucu arasında değişime uğrar. Yani istemciler sunucudaki uzak nesnelere erişebilirken, sunucuda istemciler üzerindeki nesnelere erişebilmektedir. Bu modelin gerçekleşmesi için özellikle olay güdümlü programlanın can damarı olan temsilci (delegate) ve event (olay) tipleri kullanılmaktadır.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Remoting mimarisinde temel ama&amp;ccedil;, istemcilerin uzak nesnelere (remote objects) erişmelerini sağlamak ve bu nesneler &amp;uuml;zerindeki metodları &amp;ccedil;alıştırmaktır. .Net Remoting i&amp;ccedil;in en &amp;ccedil;ok kullanılan model Marshall By Referance modelidir. Bu modelde istemciler uzak nesneler ile, sunucu &amp;uuml;zerinde oluşturulan uzak nesne referansları yoluyla konuşurlar. Ancak bazı durumlarda, uzak nesnelerin yer aldığı sunucu uygulamalar, istemciler &amp;uuml;zerinde yer alan metodları &amp;ccedil;alıştırmak isteyebilir. B&amp;ouml;yle bir durumda roller s&amp;uuml;re&amp;ccedil; i&amp;ccedil;erisinde istemci ve sunucu arasında değişime uğrar. Yani istemciler sunucudaki uzak nesnelere erişebilirken, sunucuda istemciler &amp;uuml;zerindeki nesnelere erişebilmektedir. Bu modelin ger&amp;ccedil;ekleşmesi i&amp;ccedil;in &amp;ouml;zellikle olay g&amp;uuml;d&amp;uuml;ml&amp;uuml; programlanın can damarı olan temsilci (delegate) ve event (olay) tipleri kullanılmaktadır.&lt;/p&gt;
&lt;p&gt;Teorik olarak bu yaklaşımda, istemciler uzak nesne i&amp;ccedil;in ge&amp;ccedil;erli olan bir event' ı y&amp;uuml;kleyebilir ve uzak nesneleri kullanan sunucuda tetiklenen olay sonrası, istemci tarafında yer alan olay metodlarını &amp;ccedil;alıştırabilir. Bu olayın ger&amp;ccedil;ekleşebilmesi i&amp;ccedil;in, uzak nesnenin istemci tarafından y&amp;uuml;klenebilecek bir event' a sahip olması, ayrıca olayın tetiklenmesi sonucu istemcideki uygun metodu işaret edebilecek bir temsilci (delegate) tipininde var olması gerekir. Dolayısıyla sunucu tarafında ve istemci tarafında olması gerekenler belirlidir. Sunucu tarafında, uzak nesne tipimiz, istemcideki olay metodunu işaret edebilecek bir delegate tipimiz ve istemci tarafından erişilebilecek bir event tipimiz var olmalıdır. İstenirse, olay metodu i&amp;ccedil;in bilgi taşıyacak başka bir tip daha sunucu tarafında yer alabilir. Bilgi taşıyacak bu tipi &amp;ouml;rneğin bir windows uygulamasındaki button nesnesine tıklandığında devreye giren click olay metodunun EventArgs parametre tipine benzetebiliriz. İstemci tarafında ise, uzak sunucunun herhangibir olay sonucu &amp;ccedil;alıştıracağı olay metodunu i&amp;ccedil;eren bir tip yer almalıdır.&lt;/p&gt;
&lt;table id="table40" style="width: 100%;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;
&lt;p&gt;&lt;em&gt;Hem sunucunun hemde istemcinin karşılıklı olarak ilgili nesnelerini kullanabilmeleri i&amp;ccedil;in, bu nesnelerin MarshallByReference tipinden t&amp;uuml;retilmeleri şarttır. Bu zaten Referans tabanlı remoting işlemlerin temel prensibidir.&lt;/em&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Aşağıdaki şekil sunucu ve istemci tarafında yazmamız gereken tipleri &amp;ouml;zetlemektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk153_1.gif" alt="" width="384" height="356" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim mimarinin işleyiş şekline. Uzak sunucu aktif olarak hizmet vermeye başladıktan sonra, istemciler uzak nesne referansını elde etmelidir. Burada uzak nesne referansının elde ediliş şekli &amp;ouml;nemlidir. Client Activated Object yada Server Activated Object mimarisine dayalı bir yaklaşım kullanılabilir ancak SAO mimarisinde yer alan SingleCall modelini stateless olduğu i&amp;ccedil;in kullanmak &amp;ccedil;alışma zamanında istisnalara yol a&amp;ccedil;ar. Nitekim SingleCall modelinde istemcilerin &amp;ccedil;alıştırdığı uzak nesnelere ait referanslar sunucuda oluşturulduktan sonra hemen kullanılır ve yok edilirler. O y&amp;uuml;zden SAO modelinde ısrarcı olunacaksa Singleton aktivasyon tipi kullanılmalıdır. Biz &amp;ouml;rneğimizde Client Activated Object mimarisini kullanacağız.&lt;/p&gt;
&lt;table id="table41" style="width: 100%;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Client Activated Object (CAO) mimarisinde, istemci uzak nesneye ait bir nesne &amp;ouml;rneğini oluşturduğu zaman, sunucu &amp;uuml;zerinde bu uzak nesneye ait bir referans hemen oluşturulur. Server Activated Object (SAO) modelinde ise sunucu &amp;uuml;zerindeki uzak nesneye ait referansın oluşturulması i&amp;ccedil;in istemci tarafında uzak nesneye ait bir metodun &amp;ccedil;ağırılması gerekir.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Uzak nesne referansının sunucu tarafında oluşturulmasının ardından istemci, uzak nesne i&amp;ccedil;in bir olay (event) kaydeder ve hemen ardından uzak nesne &amp;uuml;zerinde kaydettiği olayı ele alan bir metodu tetikler. Uzak sunucuda yer alan bu metod i&amp;ccedil;erisinde, o anki referans i&amp;ccedil;in bir olayın y&amp;uuml;klenip y&amp;uuml;klenmediği kontrol edilir. Eğer olay y&amp;uuml;klenmişse sunucu, istemci &amp;uuml;zerindeki ilgili olay metodunu &amp;ccedil;alıştırır ve varsa gerekli olay bilgilerini bu istemciye aktarır. Şimdi gelin bu bahsettiklerimizi uygulama koduna d&amp;ouml;kelim. &amp;Ouml;ncelikle uzak sunucu nesnemizin yer aldığı sınıf k&amp;uuml;t&amp;uuml;phanesini tasarlamak ile işe başlamalıyız.&lt;/p&gt;
&lt;p&gt;Sunucu, istemci &amp;uuml;zerindeki olay metodunu &amp;ccedil;alıştırabilmek i&amp;ccedil;in bir temsilci (delegate) tipi kullanacaktır. Temsilcimizin işaret edeceği metod modelinin aşağıdaki gibi olduğunu d&amp;uuml;ş&amp;uuml;nelim. Burada, olay metoduna bilgi taşımak amacıyla, parametre olarak kendi tasarladığımız serileştirilebilir (ki remoting sırasında bu şarttır) EventInfo tipini kullanmaktayız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk153_2.gif" alt="" width="384" height="194" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Temsilci tipimiz; &lt;strong&gt;dlg&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public delegate void dlg(EventInfo eInfo);&lt;/pre&gt;
&lt;p&gt;Olay metodumuza bilgi taşıyacak tipimiz; &lt;strong&gt;EventInfo&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[Serializable]
public class EventInfo
{
    private string _info;

    public string Info
    {
        get { return _info; }
        set { _info = value; }
    }
    public EventInfo(string inf)
    {
        _info = inf;
    }
}&lt;/pre&gt;
&lt;p&gt;Gelelim uzak nesnemize ait tipe. Uzak nesne sınıfımızın en &amp;ouml;nemli noktası bir event' a sahip olması. Bu event' i az &amp;ouml;nce tanımladığımız temsilci yardımıyla oluşturuyouruz. Diğer tarafan EventTrigger isimli metodumuz ise, istemcilerin uzak nesne &amp;uuml;zerine kaydettikleri bir event olup olmadığını denetleyerek olay metodunu &amp;ccedil;ağırıyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk153_3.gif" alt="" width="257" height="195" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Uzak nesnemize ait sınıf kodlarımız;&lt;strong&gt;RemObj&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class RemObj:MarshalByRefObject
{
    public event dlg Click;

    public RemObj()
    {
        Console.WriteLine("Uzak nesne i&amp;ccedil;in &amp;ouml;rnek oluşturuldu...");
    }
    public string RemMethod()
    {
        return "Uzak metod";
    }
    public void EventTrigger(string userName)
    {
        if (Click != null)
        {
            Console.WriteLine(userName + " sunucu &amp;uuml;zerinde olay tetikledi..."+DateTime.Now.ToString());
            System.Threading.Thread.Sleep(10000);
            EventInfo ei = new EventInfo(DateTime.Now.ToString());
            Click(ei);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Gelelim istemci tarafında, sunucu tarafından &amp;ccedil;ağırılacak olay metodunun bulunduğu tipe; ClientSide isimli sınıfımız i&amp;ccedil;erisinde sadece uzak nesnenin bulunduğu sunucunun &amp;ccedil;ağıracağı olay metodunu tanımladık. Bu metodun yapısının, istemcilerin erişeceği sunuc &amp;uuml;zerindeki uzak nesnede tanımlı delegate tipimizin belirttiği ile aynı olduğuna dikkat edin. Nitekim, uzak nesnedeki EventTrigger metodu istemci tarafından tetiklendiğinde, buradaki kodlara g&amp;ouml;re Click(ei) isimli metod &amp;ccedil;ağırımı, Click event' i i&amp;ccedil;erisinde tanımlı delegate tipinin işaret ettiği istemci &amp;uuml;zerindeki olay metodunu &amp;ccedil;alıştıracaktır. Diğer yandan sınıfımızı yine MarshallByReference tipinden t&amp;uuml;retiyoruz. Nitekim sunucu, uzak nesne olarak istemci tarafındaki bu tipin referanslarına ihtiya&amp;ccedil; duyacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk153_4.gif" alt="" width="258" height="120" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İstemci tarafındaki uzak nesne tipine ait kodlarımız; &lt;strong&gt;ClientSide&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class ClientSide:MarshalByRefObject
{
    public void EventMethod(EventInfo eInf)
    {
        Console.WriteLine(eInf.Info);
    }
}&lt;/pre&gt;
&lt;p&gt;Artık sunucu ve istemci uygulamalarımızı kodlayabiliriz. İstemci ve sunucu tarafını basit Console uygulamaları olarak tasarlayacağız. Remoting i&amp;ccedil;in gerekli konfigurasyon ayarlarını ise xml bazlı config dosyalarında tutacağız. &amp;Ouml;nce sunucu tarafının kodlarını ve konfigurasyon dosyasını oluşturmakla işe başlayalım. Elbette hem sunucu hemde istemci tarafında System.Runtime.Remoting ve RemoteObjects assembly' ımıza ait referanslarımızı eklememiz gerekiyor.&lt;/p&gt;
&lt;p&gt;Server uygulamamıza ait kodlar; &lt;strong&gt; Server&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Runtime.Remoting;
using RemoteObject;

namespace Server
{
    class Program
    {
        static void Main(string[] args)
        {
            RemotingConfiguration.Configure("..\\..\\ServerApp.config",false);
            Console.WriteLine("Sunucu dinlemede...");
            Console.WriteLine("-------------------");
            Console.ReadLine();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Server uygulamamıza ait konfigurasyon dosyası; &lt;strong&gt;ServerApp.config&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.runtime.remoting&amp;gt;
        &amp;lt;application&amp;gt;
            &amp;lt;service&amp;gt;
                &amp;lt;activated type="RemoteObject.RemObj,RemoteObject" /&amp;gt;
            &amp;lt;/service&amp;gt;
            &amp;lt;channels&amp;gt;
                &amp;lt;channel ref="tcp" port="4567"&amp;gt;
                    &amp;lt;serverProviders&amp;gt;
                        &amp;lt;provider ref="binary" typeFilterLevel="Full" /&amp;gt;
                    &amp;lt;/serverProviders&amp;gt;
                &amp;lt;/channel&amp;gt;
            &amp;lt;/channels&amp;gt;
        &amp;lt;/application&amp;gt;
    &amp;lt;/system.runtime.remoting&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Şimdi konfigurasyon dosyamız &amp;uuml;zerinde biraz konuşalım. Server tarafında CAO (Client Activated Object) modelini desteklediğimizi belirtiyoruz. Activated node' u i&amp;ccedil;erisinde yer alan type niteliği (attribute) değişken olarak &lt;strong&gt;Namespace.SınıfAdı,AssembleAdı&lt;/strong&gt; na g&amp;ouml;re gerekli bilgiyi almaktadır. Bildiğiniz gibi istemci tarafındada bu type bilgisi tanımlanacak ve istemciler sunucu &amp;uuml;zerindeki uzak referansları talep ederken bu bilgileri kullanacaktır. Ayrıca, Tcp protokol&amp;uuml;n&amp;uuml; kullanacak kanal bilgilerinide channels node' u altında yer alan channel node' unda belirtmekteyiz. Gelelim istemci tarafına;&lt;/p&gt;
&lt;p&gt;İstemci uygulamamıza ait kodlar; &lt;strong&gt; Client&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Runtime.Remoting;
using RemoteObject;

namespace Client
{
    class Program
    {
        static void Main(string[] args)
        {
            RemotingConfiguration.Configure("..\\..\\ClientApp.config",false);
            RemObj ro = new RemObj();
            ClientSide cs = new ClientSide();
            ro.Click += new dlg(cs.EventMethod);
            ro.EventTrigger("Burak");
            Console.ReadLine();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İstemci uygulamamızda uzak nesne(RemObj) ve istemci tarafındaki nesne(ClientSide) i&amp;ccedil;in &amp;ouml;rnekler oluşturuluyor. Daha sonra uzak nesnemize Click event' ini kaydediyoruz(Register). Burada &amp;ouml;nemli olan nokta event' imizi uzak nesneye kaydederken, uzak nesnenin &amp;uuml;zerinde Click olayının tetiklenmesi sonucu, istemci tarafında &amp;ccedil;alışıtıracak olan metodun(EventMethod) belirtilmesi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;ro.Click += new dlg(cs.EventMethod);&lt;/pre&gt;
&lt;p&gt;Bu ifade ile, uzak nesne &amp;uuml;zerinde Click olayı tetiklendiğinde (ki biz bunu uzak nesnenin EventTrigger metodu ile canlandırıyoruz), istemci tarafındaki nesnemizin EventMethod' unu &amp;ccedil;alıştıracağımızı belirtiyoruz.&lt;/p&gt;
&lt;p&gt;İstemci uygulamamıza ait konfigursayon dosyası; &lt;strong&gt;ClientApp.config&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.runtime.remoting&amp;gt;
        &amp;lt;application&amp;gt;
            &amp;lt;client url="tcp://localhost:4567/"&amp;gt;
                &amp;lt;activated type="RemoteObject.RemObj,RemoteObject" /&amp;gt;
            &amp;lt;/client&amp;gt;
            &amp;lt;channels&amp;gt;
                &amp;lt;channel ref="tcp" port="0"&amp;gt;
                    &amp;lt;serverProviders&amp;gt;
                        &amp;lt;provider ref="binary" typeFilterLevel="Full" /&amp;gt;
                    &amp;lt;/serverProviders&amp;gt;
                &amp;lt;/channel&amp;gt;
            &amp;lt;/channels&amp;gt;
        &amp;lt;/application&amp;gt;
    &amp;lt;/system.runtime.remoting&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;İstemci tarafındada channel bilgisi olarak sunucu tarafında olduğu gibi Tcp kanalını se&amp;ccedil;tik. B&amp;ouml;yle bir se&amp;ccedil;im yapmamızın nedeni hem sunucun hemde istemcinin birbirleri &amp;uuml;zerindeki nesnelerinin referanslarını kullanacak uygun kanallara ihtiya&amp;ccedil; olunmasıdır. Normal şartlar altında sunucu tarafında Tcp Server (veya Http Server), istemci tarafında ise Tcp Client (veya Http Client) kanalları se&amp;ccedil;ilerek remoting işlemleri ger&amp;ccedil;ekleştirilir. Ancak burada sunucu uygulama yeri geldiği zaman istemci gibi davranacaktır ve uzak metodu &amp;ccedil;ağıracaktır ki sunucu a&amp;ccedil;ısından &amp;ouml;nemli olan uzak metod bizim olay metodumuzdur.&lt;/p&gt;
&lt;table id="table47" style="width: 100%;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Delegate tipinin serileştirilebilir olması i&amp;ccedil;in (remoting' i destekelemesi i&amp;ccedil;in) xml konfigurasyonunda serviceProvider kısmı yer almaktadır.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Artık tek yapmamız gereken uygulamamızı bu haliyle test etmek olacaktır. &amp;Ouml;ncelikle istemci tarafını &amp;ccedil;alıştıralım. Bunu yapmamızdaki ama&amp;ccedil; &amp;ccedil;alışma zamanında aşağıdaki ekranda g&amp;ouml;r&amp;uuml;len istisnayı almak.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk153_5.gif" alt="" width="537" height="198" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu bizim i&amp;ccedil;in, istemci tarafının ger&amp;ccedil;ektende konfigurasyon dosyasında belirtilen ayarlar ile bir uzak sunucuya bağlanmaya &amp;ccedil;alıştığının ve hakiki bir remoting ortamının oluştuğunun g&amp;ouml;stergesidir. Bir başka deyişle RemObj sınıfına ait nesne &amp;ouml;rneğini istemci kendi application domani' i i&amp;ccedil;erisinde oluşturmamaktadır. Ger&amp;ccedil;ektende bu &amp;ouml;rneğe ait referansı sunucu tarafında aramaktadır. Bunuda g&amp;ouml;rd&amp;uuml;kten sonra, artık remoting uygulamamızı test edebiliriz. &amp;Ouml;nce sunucu uygulamamızı &amp;ccedil;alıştırıyoruz ardınan ise istemci uygulamamızı. Sonu&amp;ccedil;ta, istemci sunucu &amp;uuml;zerindeki uzak nesneyi kullanarak bir olayı tetikliyor ve bunun karşılığında sunucu uygulamada olay metodunu istemci tarafında y&amp;uuml;r&amp;uuml;tmeye başlıyor.&lt;/p&gt;
&lt;p&gt;Aşağıdaki Flash animasyonunda uygulamanın canlı olarak &amp;ccedil;alışmasını g&amp;ouml;rmektesiniz. &lt;em&gt;(Not: Sisteminizde Flash Player y&amp;uuml;kl&amp;uuml; değilse bu animasyonu g&amp;ouml;remeyebilirsiniz.) &lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Peki uygulamada neler oldu ş&amp;ouml;yle bir analiz etmeye &amp;ccedil;alışalım. &amp;Ouml;ncelikle server uygulamamızı &amp;ccedil;alıştırdık. Hemen ardından istemci uygulamamızı &amp;ccedil;alıştırdık. İstemci uygulamamız kodları i&amp;ccedil;erisinde uzak nesne &amp;ouml;rneği oluşturacak kod satırı (RemObj ro=new RemObj(); satırı) ge&amp;ccedil;ildikten sonra sunucu tarafında yer alan uzak nesne (RemObj) sınıfına ait bir referans oluşturuldu. Bunu sunucu ekranına gelen mesajdan anlayabiliriz. Nitekim bu mesajı uzak nesnenin constructor metodu i&amp;ccedil;erisinde yazmıştık. Bu işlemi takiben istemci tarafından tetikleyici metod (EventTrigger) &amp;ccedil;ağırıldıktan sonra ise sunucu tarafında, istemcinin olayı tetikleme zamanı yazıldı. Burada olayı daha iyi analiz etmek i&amp;ccedil;in olay tetikleyici metodumuz i&amp;ccedil;erisinde kodu 10 saniye kadar uyuttuk. Bu s&amp;uuml;re sonunda sunucu uygulama, istemci tarafındaki olay metodunu (EventTrigger) &amp;ccedil;alıştırdı ve istemci tarafında o anki zaman ekrana geldi. B&amp;ouml;ylece remoting uygulaması i&amp;ccedil;in ge&amp;ccedil;erli event modelinin başarılı bir şekilde &amp;ccedil;alıştığını ispat etmiş oluyoruz.&lt;/p&gt;
&lt;p&gt;&lt;object id="obj1" width="549" height="405" classid="clsid:D27CDB6E-AE6D-11CF-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" border="0"&gt;
&lt;param name="movie" value="http://www.buraksenyurt.com/makale/images/Event.swf" /&gt;
&lt;param name="quality" value="High" /&gt; &lt;embed type="application/x-shockwave-flash" width="549" height="405" src="http://www.buraksenyurt.com/makale/images/mk153_7/mk153_7.swf" pluginspage="http://www.macromedia.com/go/getflashplayer" name="obj1" /&gt;&lt;/object&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi remoting uygulamalarında istemci tarafından olay tetiklemek ve bu olay karşılığında sunucunun kendisine bağlı olan istemciler &amp;uuml;zerinde var olan olay metodlarını &amp;ccedil;alıştırabilmesini sağlamak m&amp;uuml;mk&amp;uuml;n. B&amp;ouml;ylece geldik bir makalemizin daha sonuna bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/EventHandling.rar"&gt;&amp;Ouml;rnek uygulamalı indirmek i&amp;ccedil;in tıklayın.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2006-03-26 12:00:00</pubDate>
  <slug>-Net-Remoting-ve-Event-Mimarisi-bsenyurt-com-dan</slug>
  <tags>
    <tag>net-remoting</tag>
    <tag>event</tag>
  </tags>
  <categories>
    <category>.Net Remoting</category>
  </categories>
</post>