<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net–Doğru async, await Kullanımı</title>
  <description />
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bazen web sayfalarının y&amp;uuml;klenmesi sırasında senkron olarak &amp;ccedil;alışan ve uzun s&amp;uuml;ren işlemler ger&amp;ccedil;ekleştiririz&lt;em&gt;(ki aslında Web uygulamalarında bu tip yaklaşımları pek tercih etmeyiz)&lt;/em&gt; Sayfada ki kontrollerde g&amp;ouml;sterilmek &amp;uuml;zere &amp;ccedil;eşitli kaynaklardan veri &amp;ccedil;ekilmesi buna &amp;ouml;rnek olarak verilebilir. Bu tip veri y&amp;uuml;kleme işlemleri ağırlıklı olarak &lt;strong&gt;Page_Load&lt;/strong&gt; olay metodu i&amp;ccedil;erisinde ger&amp;ccedil;ekleştirilir. Uzun s&amp;uuml;ren işlemlerin kısa s&amp;uuml;rede tamamlanabilmesi i&amp;ccedil;in farklı teknikler mevcuttur. Bir tanesi de asenkron olarak &amp;ccedil;alışabilmelerini sağlamaktır&lt;em&gt;(&amp;Ouml;rneğin zaman kaybettiren servis &amp;ccedil;ağrılarının, veri &amp;ccedil;ekme işlemlerinin eş zamanlı hale getirilmesi)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;.Net&lt;/strong&gt; d&amp;uuml;nyasında bu tip asenkron işleri kolaylaştıran &lt;strong&gt;async&lt;/strong&gt;, &lt;strong&gt;await&lt;/strong&gt; keyword&amp;rsquo; leri artık yaygın olarak kullanılmakta. Lakin Web d&amp;uuml;nyasında biraz daha dikkatli olmak gerekir. Nitekim bir web sayfasının yaşam d&amp;ouml;ng&amp;uuml;s&amp;uuml;&lt;strong&gt;&lt;em&gt;(Page Life-Cycle)&lt;/em&gt;,&lt;/strong&gt; &lt;strong&gt;async &lt;/strong&gt;geri bildirimlerini sorunsuz şekilde ele alan &lt;strong&gt;Windows UI Thread&lt;/strong&gt;&amp;rsquo; lerinden biraz daha farklı &amp;ccedil;alışmaktadır. G&amp;uuml;venilir ve stabil bir ortam s&amp;ouml;z konusu değildir. Dahası &lt;strong&gt;HTTP 503&lt;/strong&gt; hatasının alınmasına neden olabilecek vakalar vardır. İşte bu g&amp;ouml;rsel dersimizde bir sayfanın y&amp;uuml;klenmesi esnasında asenkron hale getirilmesi istenen işlemlerde uygulanabilecek doğru ve tavsiye edilen bir pratiği incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;
&lt;object width="640" height="360"&gt;
&lt;param name="movie" value="//www.youtube.com/v/palXWq8li-8?version=3&amp;amp;hl=en_US" /&gt;
&lt;param name="allowFullScreen" value="true" /&gt;
&lt;param name="allowscriptaccess" value="always" /&gt;&lt;embed type="application/x-shockwave-flash" width="640" height="360" src="//www.youtube.com/v/palXWq8li-8?version=3&amp;amp;hl=en_US" allowfullscreen="true" allowscriptaccess="always"&gt;&lt;/embed&gt;
&lt;/object&gt;
&lt;/p&gt;
&lt;p&gt;Bir başka g&amp;ouml;rsel dersimizde g&amp;ouml;r&amp;uuml;şmek dileğiyle.&lt;/p&gt;</content>
  <pubDate>2014-06-27 04:00:00</pubDate>
  <slug>AspNete28093Dogru-async-await-Kullanc4b1mc4b1</slug>
  <tags />
  <categories>
    <category>Asp.Net 4.5</category>
  </categories>
</post>