<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Google Cloud Fonksiyonlarını Firebase ile Birlikte Kullanmak</title>
  <description>Bulut çözümlerin sunduğu imkanlardan birisi de sunucu oluşturma, barındırma, yönetme gibi etkenleri düşünmemize gerek kalmayacak şekilde uygulama geliştirme ortamları sağlamalarıdır. Bazen bulut platform üzerinde sunulan bir veritabanı ile konuşan servis kodlarını yine o platformun sunucularında barındırmak suretiyle hizmet sağlarız. Söz gelimi Google'ın Firebase veritabanı ve onu kullanan servis tabanlı fonksiyonları Google Cloud Platform üzerinde konuşlandırabiliriz. Bu örnekteki amacım da Firebase ile ilişkili bir uygulama servisini Google Cloud Platform üzerinde fonksiyonlaştırabilmek. Her zaman olduğu gibi örneği WestWorld (Ubuntu 18.04, 64bit) üzerinde geliştiriyorum.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2019/05/27/sabihagokcen.png" alt="" /&gt;Google'ın Doodle hizmetini takip ediyor musunuz bilemiyorum ancak ben&amp;nbsp;zaman zaman&amp;nbsp;orada hazırlanmış ikonik g&amp;ouml;rsellerden&amp;nbsp;harika hikayelere gidiyorum. Bu seferki yazının derlemesi sırasında da yolum bir şekilde onunla kesişti&amp;nbsp;ve girişte kimden bahsedebilirim derken&amp;nbsp;havacılılk tarihinin en &amp;ouml;nemli isimlerinden olan T&amp;uuml;rkiye'nin ilk kadın pilotu Sabiha G&amp;ouml;k&amp;ccedil;en'i&lt;em&gt;(22 Mart 1913 - 22 Mart 2001)&lt;/em&gt; anmaya karar verdim.&lt;/p&gt;
&lt;p&gt;Amerikan Hava Kurmay Koleji'nin 1996 yılında Maxwell Hava &amp;Uuml;ss&amp;uuml;nde yapılan t&amp;ouml;reninde&amp;nbsp;D&amp;uuml;nya tarihine adını yazdıran 20 havacıdan birisi olarak &amp;ouml;d&amp;uuml;l alan Sabiha G&amp;ouml;k&amp;ccedil;en'in tarihde iz bırakan başarıları saymakla bitmez elbette. Lakin diğer pek &amp;ccedil;ok başarısının yanında bu en &amp;ccedil;ok dikkatimi &amp;ccedil;ekenlerden birisiydi. İ&amp;ccedil;indeki u&amp;ccedil;ma arzusu ve sevgisi &amp;ouml;yle b&amp;uuml;y&amp;uuml;k olmalı ki Fransız pilot Daniel Acton ile son u&amp;ccedil;uşunu yaptığında 83 yaşındaydı. T&amp;uuml;rk Hava Kurumu T&amp;uuml;rkkuşu'nda Baş&amp;ouml;ğretmen olarak g&amp;ouml;rev aldı ve 1955 yılına kadar bir &amp;ccedil;ok değerli pilotun yetişmesine &amp;ouml;n ayak oldu.&lt;/p&gt;
&lt;p&gt;Arada bir sizde doodlelayın derim. Bazen &amp;ccedil;ok değerli bilgilere ulaşabiliyoruz. Gelelim Google ile ne işimiz olduğuna&lt;em&gt;(Hoş onsuz hareket ettiğimiz bir g&amp;uuml;n&amp;uuml;m&amp;uuml;z de yok)&lt;/em&gt; Bu kez &lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;Saturday-Night-Works&lt;/a&gt; birinci fazdan&amp;nbsp;&lt;a href="https://github.com/buraksenyurt/saturday-night-works/tree/master/No%2027%20-%20Google%20Cloud%20Functions%20with%20Firebase" target="_blank"&gt;27 numaralı &amp;ouml;rneğin derlemesi&lt;/a&gt; ile karşınızdayım. Konumuz Google Cloud Platform &amp;uuml;zerinden Firebase tabanlı bir bulut fonksiyon sunmak.&lt;/p&gt;
&lt;p&gt;Bulut &amp;ccedil;&amp;ouml;z&amp;uuml;mlerin sunduğu imkanlardan birisi de sunucu oluşturma, barındırma, y&amp;ouml;netme gibi etkenleri d&amp;uuml;ş&amp;uuml;nmemize gerek kalmayacak şekilde uygulama geliştirme ortamları sağlamaları. Bazen bulut platform &amp;uuml;zerinde tutulan bir veri tabanı ile konuşan servis kodlarını yine o platformun sunucularında barındırmak suretiyle hizmet sunarız. S&amp;ouml;z gelimi Google'ın Firebase veri tabanı ve onu kullanan servis tabanlı fonksiyonları Google Cloud Platform &amp;uuml;zerinde konuşlandırabiliriz. Bu &amp;ouml;rnekteki amacımsa Firebase ile ilişkili bir uygulama servisini Google Cloud Platform &amp;uuml;zerinde fonksiyonlaştırabilmekmiş. Her zaman olduğu gibi &amp;ouml;rneği WestWorld&lt;em&gt;(Ubuntu 18.04, 64bit)&lt;/em&gt; &amp;uuml;zerinde geliştirmişim. &amp;Ouml;yleyse gelin notlarımızı derlemeye başlayalım.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekte Firebase'in Realtime Database se&amp;ccedil;eneği kullanılmakta. Veriyi JSON tipinde tutan bir NoSQL sistemi olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Veri, bağlı olan t&amp;uuml;m istemciler i&amp;ccedil;in ger&amp;ccedil;ek zamanlı&lt;em&gt;(realtime)&lt;/em&gt; olarak eşlenir. Dahası, istemci uygulama kapansa bile veriyi hatırlar. Cloud-Hosted bir veri tabanıdır. Bir başka deyişle veri tabanı sunucusu google &amp;uuml;zerinde durmaktadır. &amp;Ouml;zellikle Cross-Platform tipinden uygulamalar s&amp;ouml;z konusuysa&lt;em&gt;(iOS, Android, Javascript veya Typescript fark etmez)&lt;/em&gt; t&amp;uuml;m bağlı istemcilerle aynı verinin senkronize olarak paylaşılmasını sağlamak gibi &amp;ouml;nemli bir &amp;ouml;zelliği vardır. Diğer yandan s&amp;ouml;z konusu Realtime Database &amp;uuml;r&amp;uuml;n&amp;uuml; dışında Cloud Firestore isimli daha &amp;ouml;nceden &amp;uuml;zerinden durup d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z bir veri tabanı modeli daha vardır. Firebase'in orjinal veri tabanı olan Realtime modelinin daha geliştirilmiş bir versiyonu olarak d&amp;uuml;ş&amp;uuml;nebiliriz. Her iki &amp;uuml;r&amp;uuml;n arasındaki farklılıkları kabaca aşağıdaki gibi &amp;ouml;zetleyebiliriz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Realtime modelinde veri JSON ağa&amp;ccedil; yapısı şeklinde saklanırken Firestore'da koleksiyon bi&amp;ccedil;iminde organize edilmiş dok&amp;uuml;manlar s&amp;ouml;z konusudur&lt;em&gt;(Firestore, Mongo'yu hatırlattı burada bana)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Firestore &amp;ouml;zellikle karmaşık ve hiyerarşik veri k&amp;uuml;melerini &amp;ouml;l&amp;ccedil;eklerken Realtime modele g&amp;ouml;re daha başarılıdır.&lt;/li&gt;
&lt;li&gt;Realtime veri tabanı iOS ve Android gibi mobil platformlar i&amp;ccedil;in &amp;ccedil;evrim dışı(&lt;em&gt;offline)&lt;/em&gt; &amp;ccedil;alışma desteği sunar. Firestore buna ek olarak Web tabanlı istemciler i&amp;ccedil;in de offline &amp;ccedil;alışma desteği sağlar.&lt;/li&gt;
&lt;li&gt;Sıralama ve filtreleme imkanları Cloud Firestore'da Realtime modeline g&amp;ouml;re &amp;ccedil;ok daha geniştir.&lt;/li&gt;
&lt;li&gt;Firestore'da&amp;nbsp;bir transaction tamamlanıncaya kadar otomatik olarak tekrar ve tekrar denenir.&lt;/li&gt;
&lt;li&gt;Realtime veri tabanı modelinde &amp;ouml;l&amp;ccedil;ekleme i&amp;ccedil;in Sharding uygulanması gerekirken Firestore'da bu iş otomatik olarak yapılır.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Ben uygulaması &amp;ccedil;ok daha basit olduğundan Realtime Database modelini tercih ettim.&lt;/p&gt;
&lt;h2&gt;İlk Hazırlıklar&lt;/h2&gt;
&lt;p&gt;Her şeyden &amp;ouml;nce Google Cloud Platform &amp;uuml;zerinde bir hesabımızın olması lazım. Hesabımız ile login olduktan sonra&amp;nbsp;&lt;a href="https://console.firebase.google.com/" target="_blank"&gt;Firebase Console adresine&lt;/a&gt; gidip bir proje oluşturacağız. S&amp;ouml;z gelimi project-new-hope gibi bir isimle...&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/27/credit_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Projeyi komut satırından y&amp;ouml;netebilmek &amp;ouml;nemli. Nitekim yazdığımız kodları kolayca deploy edebilmeliyiz. Bu nedenle Firebase CLI&lt;em&gt;(Command Line Interface)&lt;/em&gt; aracına ihtiyacımız var. Kendisini npm ile aşağıdaki gibi y&amp;uuml;kleyebiliriz&lt;em&gt;(Dolayısıyla sistemimizde node ve npm y&amp;uuml;kl&amp;uuml; olmalıdır)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm install -g firebase-tools&lt;/pre&gt;
&lt;p&gt;Y&amp;uuml;kleme işlemi başarılı olduktan sonra proje ile aynı isimde bir klas&amp;ouml;r oluşturup, i&amp;ccedil;erisinde sırasıyla login ve functions komutlarını kullanarak ilerleyebiliriz. Bu komutlarla Firebase ortamına&amp;nbsp;giriş yapma ve projenin başlangı&amp;ccedil; iskeletinin oluşturulması işlemleri yapılmaktadır.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;mkdir project-new-hope
cd project-new-hope
firebase login
firebase init functions&lt;/pre&gt;
&lt;p&gt;Login işlemi sonrası arabirim bizi tarayıcıya y&amp;ouml;nlendirecek ve platform i&amp;ccedil;in giriş yapmamız istenecektir. Başarılı login sonrası tekrardan console ekranına d&amp;ouml;n&amp;uuml;ş yapmış oluruz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/27/credit_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;init functions &amp;ccedil;ağrısı ile yeni bir google cloud function oluşturma işlemine başlanır. D&amp;ouml;rt soru sorulacaktır&lt;em&gt;(En azından &amp;ccedil;alışmanın yapıldığı tarih itibariyle b&amp;ouml;yleydi)&lt;/em&gt; Projeyi zaten Firebase Console'unda oluşturmuştuk. Klas&amp;ouml;r adını aynı verdiğimiz i&amp;ccedil;in varsayılan olarak onu kullanacağını belirtebiliriz. Dil olarak Typescript ve Javascript desteği sorulmakta ki ben ikincisi tercih ettim. &amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; adımda &lt;a href="https://eslint.org/" target="_blank"&gt;ESLint&lt;/a&gt; kullanıp kullanmayacağımız soruluyor. Şimdilik 'No' se&amp;ccedil;eneğini işaretleyerek ilerlenebilir ancak ger&amp;ccedil;ek hayat senaryolarında etkinleştirmek iyi bir fikirdir.&lt;em&gt;&amp;nbsp;(İleriye y&amp;ouml;nelik problem yaratabilecek olası kod hatalarının &amp;ouml;nceden tespitinin kritikliği sebebiyle)&lt;/em&gt; Projenin bağımlılık duyduğu npm paketleri varsa bunların install edilmesini de istediğimizden son soruda 'Yes' se&amp;ccedil;minini yapmalıyız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/27/credit_3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Komut &amp;ccedil;alışmasını tamamladıktan sonra aşağıdaki klas&amp;ouml;r yapısının oluştuğunu g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/27/credit_4.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bundan sonra index.js dosyası ile oynayıp &amp;ouml;rnek bir dağıtım&lt;em&gt;(deployment)&lt;/em&gt; işlemi ger&amp;ccedil;ekleştirebiliriz de. Index sayfasında yorum satırı i&amp;ccedil;erisine alınmış bir kod par&amp;ccedil;ası bulunmaktadır. Bu kısmı a&amp;ccedil;arak hemen &lt;em&gt;Hello World&lt;/em&gt;&amp;nbsp;s&amp;uuml;recini işletmemiz m&amp;uuml;mk&amp;uuml;n. Ama bunun i&amp;ccedil;in, yapılan değişiklikleri platforma almamız lazım. Aşağıdaki terminal komutu ile bunu sağlayabiliriz. &amp;Ouml;rnekteki amacımıza g&amp;ouml;re sadece fonksiyonların taşınması s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;firebase deploy --only functions&lt;/pre&gt;
&lt;h2&gt;Sorun Yaşayabiliriz&lt;/h2&gt;
&lt;p&gt;Yukarıdaki terminal komutunu denediğimde aktif bir proje olmadığına dair bir hata mesajı aldım ve deployment işlemi başarısız oldu. Bunun &amp;uuml;zerine &amp;ouml;nce aktif proje listesine baktım&lt;em&gt;(firebase list)&lt;/em&gt; ve sonrasında &lt;em&gt;use --add&lt;/em&gt; ile tekrardan proje se&amp;ccedil;imi yaptım. Bir alias tanımladıktan sonra&lt;em&gt;(ki her nedense proje adının aynısını vermişim :S)&lt;/em&gt; tekrardan deploy işlemini denedim. Bu seferde sadece fonksiyon olarak dağıtım yapmak istediğimi belirtmediğim i&amp;ccedil;in başka bir hata aldım. Nihayetinde &amp;ccedil;alıştırdığım terminal komutu işe yaradı ve proje GCP'a deploy edildi.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;firebase list
firebase use --add
firebase deploy --only functions&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/27/credit_5.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Firebase Dashboard'una gittiğimizde helloworld isimli API fonksiyonunun&lt;em&gt;(ki index.js dosyasından export edilen metodumuzdur)&lt;/em&gt; eklenmiş olduğunu g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/27/credit_6.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alışmanın bu ilk yalın versiyonunda Google'ın index.js i&amp;ccedil;erisine koyduğu yorum satırları kaldırılarak bir deneme yapılmıştır. Bu taşıma işlemi sonrası Firebase tarafında &amp;uuml;retilen fonksiyona ait API adresini aşağıdaki gibi curl ile &amp;ccedil;ağırdığımızda&amp;nbsp;'Hello from Firebase!' yazısını g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;curl -get https://us-central1-project-new-hope.cloudfunctions.net/helloWorld&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/27/credit_7.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Kod Tarafı&lt;/h2&gt;
&lt;p&gt;Asıl işi yapan &amp;ouml;rneğimiz ise basit bir REST hizmeti. POST ve GET mesajlarını destekleyen metotlar i&amp;ccedil;eriyor ve temel olarak veri ekleme ve listeleme fonksiyonelliklerini sağlıyor. Arka planda Firebase veri tabanının Realtime &amp;ccedil;alışan modelini kullanıyor. Arka plandan kastımız GCP &amp;uuml;zerindeki Firebase veri tabanı. Yani kendi makinemizde geliştirdiğimiz bir API servisini, firebase veri tabanını kullanacak şekilde GCP &amp;uuml;zerinde konuşlandırmış oluyoruz. İkinci &amp;ouml;rnek i&amp;ccedil;in gerekli bir ka&amp;ccedil; npm paketi var. REST&lt;em&gt;(Representational State Transfer)&lt;/em&gt; modelini node tarafında kolayca kullanabilmek i&amp;ccedil;in express ve CORS&lt;em&gt;(Cross-Origin Resource Sharing)&lt;/em&gt; etkisini rahat&amp;ccedil;a y&amp;ouml;netebilmek i&amp;ccedil;in cors :D Aşağıdaki terminal komutları ile onları projemize ekleyebiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm install --save express cors&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;İlgili paketleri functions klas&amp;ouml;r&amp;uuml;ndeyken y&amp;uuml;klememiz gerekiyor. Nitekim deploy sırasında bu JSON dosyasındaki paket bilgileri, GCP tarafında da y&amp;uuml;klenmeye &amp;ccedil;alışacak. Dolayısıyla GCP'nin, kendi ortamında kullanacağı paketlerin neler olduğunu bilmesi lazım.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;index.js dosyasına ait kod i&amp;ccedil;eriğini aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;const functions = require('firebase-functions');
const express = require('express');
const cors = require('cors');
const admin = require('firebase-admin');
admin.initializeApp();

const app = express();
app.use(cors()); //CORS &amp;ouml;zelliğini express nesnesi i&amp;ccedil;ine enjekte ettik

// HTTP Get &amp;ccedil;ağrısı gelmesi halinde &amp;ccedil;alışacak metodumuz
app.get("/", (req, res) =&amp;gt; {

    return admin.database().ref('/somedata').on("value", snapshot =&amp;gt; {
        // HTTP 200 Ok cevabı ile birlikte somedata i&amp;ccedil;eriğini d&amp;ouml;nd&amp;uuml;r&amp;uuml;yoruz
        return res.status(200).send(snapshot.val());
    }, err =&amp;gt; {
        // Bir hata varsa HTTP Internal Server Error mesajı ile birlikte i&amp;ccedil;eriğini d&amp;ouml;nd&amp;uuml;r&amp;uuml;yoruz
        return res.status(500).send('There is something go wrong ' + err);
    });
});

// HTTP Post &amp;ccedil;ağrısını veritabanına veri eklemek i&amp;ccedil;in kullanacağız
app.post("/", (req, res) =&amp;gt; {
    const payload = req.body; // gelen i&amp;ccedil;eriği bir alalım
    // push metodu ile veriyi yazıyoruz.
    // işlem başarılı olursa then bloğu devreye girecektir
    // bir hata oluşması halinde catch bloğu &amp;ccedil;alışır
    return admin.database().ref('/somedata').push(payload)
        .then(() =&amp;gt; {
            // HTTP 200 Ok - yani işlem başarılı oldu diyoruz
            return res.status(200).send('Eklendi');
        }).catch(err =&amp;gt; {
            // İşlem başarısız oldu
            // HTTP 500 Internal server error ile hata mesajını yollayabiliriz
            return res.status(500).send('There is something go wrong ' + err);
        });
});

// Servisten dışarıya a&amp;ccedil;tığımız fonksiyonlar
// somedata fonksiyonumuz i&amp;ccedil;in app isimli express nesnemiz ve doğal olarak Get, Post metodları ele alınacak
exports.somedata = functions.https.onRequest(app);

// Servis hayatta mı metodumuz :P
// Ping'e Pong d&amp;ouml;n&amp;uuml;yorsa yaşıyordur deriz en kısa yoldan.
exports.ping = functions.https.onRequest((request, response) =&amp;gt; {
    response.send("Pong!");
});&lt;/pre&gt;
&lt;p&gt;Kod nihai halini aldıktan sonra tekrardan dağıtım işlemi yapılmalıdır.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;firebase deploy --only functions&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/27/credit_8.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dağıtım işlemi sonrasında somedata ve ping referans adresli endpoint bilgilerini dashboard &amp;uuml;zerinde g&amp;ouml;rebilmemiz gerekiyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/27/credit_9.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi somedata fonksiyonunun Post metodunu kullanarak bir ka&amp;ccedil; &amp;ouml;rnek veri girişi yapalım. Postman gibi bir ara&amp;ccedil;tan&amp;nbsp; yararlanarak bu işlemleri kolayca ger&amp;ccedil;ekleştirebiliriz.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Hızlıca bir test yapmak i&amp;ccedil;in ping fonksiyonunu da &amp;ccedil;ağırabilirsiniz. https://us-central1-project-new-hope.cloudfunctions.net/ping adresine talep g&amp;ouml;ndermeniz yeterlidir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;Adres : https://us-central1-project-new-hope.cloudfunctions.net/somedata/
Metod : HTTP Post
Body : JSON
&amp;Ouml;rnek Veri : {
"Id":1000,
"Quote":"Let&amp;rsquo;s go invent tomorrow rather than worrying about what happened yesterday.",
"Owner":"Steve Jobs"
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/27/credit_10.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bir ka&amp;ccedil; deneme girişi yaparak veriyi &amp;ccedil;oğaltabiliriz. JSON formatlı olmak suretiyle istediğimiz şema yapısında veriler yollamamız m&amp;uuml;mk&amp;uuml;n. Firebase sayfasındaki Database kısmına baktığımıza aşağıdakine benzer sonu&amp;ccedil;ları g&amp;ouml;r&amp;uuml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/27/credit_11.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Pek tabii HTTP Get &amp;ccedil;ağrıları sonuncunda da aktardığımız t&amp;uuml;m verileri &amp;ccedil;ekebiliriz. Bunun i&amp;ccedil;in aşağıdaki adrese talepte bulunmak yeterlidir.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;Adres : https://us-central1-project-new-hope.cloudfunctions.net/somedata/
Metod : HTTP Get&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/27/credit_12.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Başka Neler Yapılabilir?&lt;/h2&gt;
&lt;p&gt;Ben bir an &amp;ouml;nce deneyimlemenin heyecanından olsa gerek bu tip Hello World &amp;ouml;rneklerinde Get, Post harici fonksiyonları uygulamayı &amp;ccedil;oğunlukla atlıyorum. Dolayısıyla siz tembellik etmeyerek Put, Delete ve filtre bazlı Get metodlarını da &amp;ouml;rneğe katabilirsiniz. Hatta bu &amp;ouml;rneğin aksine Realtime Database yerine Cloud Firestore modelini kullanmayı denemenizi de şiddetle &amp;ouml;neririm. Ayrıca şema olarak daha d&amp;uuml;zg&amp;uuml;n bir veri modeli &amp;uuml;zerinden ilerlenebilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Malum bulut hizmetleri belli bir noktadan sonra kullanımlarımıza g&amp;ouml;re &amp;uuml;cret alıyorlar. Bu nedenle yukarıdaki servislere an itibariyle ulaşamayabilirsiniz. Nitekim Azure, Google Cloud Platform veya Amazon Web Services gibi ortamlarda hazırladığım kaynakları işim bittikten bir s&amp;uuml;re sonra mutlaka kaldırıyorum. Daha &amp;ouml;nceden yaşadığım bazı acı tecr&amp;uuml;beler nedeniyle...&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2&gt;Ben Neler &amp;Ouml;ğrendim?&lt;/h2&gt;
&lt;p&gt;Bu &amp;ccedil;alışma kapsamında daha &amp;ccedil;ok GCP &amp;uuml;zerinde bulut fonksiyon barındırma ve veri tabanı ile ilişkilendirme konularını inceleme fırsatı bulmuş oldum.&amp;nbsp;Pek tabii bu &amp;ccedil;alışmanın da bana kattığı bir şeyler oldu. Bunları aşağıdaki maddeler halinde &amp;ouml;zetleyebilirim.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Firebase &amp;uuml;zerinde bir projenin nasıl&amp;nbsp;oluşturulacağını&lt;/li&gt;
&lt;li&gt;firebase-tools ile proje başlatma, fonksiyon dağıtma gibi temel işlemlerin terminalden nasıl&amp;nbsp;yapılacağını&lt;/li&gt;
&lt;li&gt;Kendi geliştirme ortamımızda yazılan node.js tabanlı bir API hizmetini Function olarak Firebase'e nasıl deploy&amp;nbsp;edeceğimi&lt;/li&gt;
&lt;li&gt;Realtime veri tabanı modelinin kabaca ne olduğunu&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir &lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;cumartesi gecesi macerası&lt;/a&gt;nın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2019-06-21 07:00:00</pubDate>
  <slug>google-cloud-fonksiyonlarini-firebase-ile-birlikte-kullanmak</slug>
  <tags>
    <tag>firebase</tag>
    <tag>real-time-database</tag>
    <tag>google</tag>
    <tag>google-cloud-platform</tag>
    <tag>google-cloud-functions</tag>
    <tag>node</tag>
    <tag>npm</tag>
    <tag>nodejs</tag>
    <tag>javascript</tag>
    <tag>firebase-tools</tag>
    <tag>postman</tag>
    <tag>express</tag>
    <tag>cors</tag>
    <tag>cloud-computing</tag>
    <tag>cloud-functions</tag>
    <tag>eslint</tag>
  </tags>
  <categories>
    <category>GCP</category>
  </categories>
</post>