<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>AWS Elastic Beanstalk Macerası</title>
  <description>Bu yazımızda Django çatısından üretilmiş standart bir web uygulamasını, Amazon'un Platform As A Service olarak konumlandırdığı Elastic Beanstalk üzerine nasıl taşıyabileceğimizi öğrenmeye çalışıyoruz. Yolda tabii ki başımıza garip garip olaylar da geliyor. Özellikle sonlara doğru yaşadığımız sıkıntıları çözmeye de çalışıyoruz. Haydi gelin başlayalım.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/01/ebpython_robin.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Ge&amp;ccedil;enlerde sıkıldığım bir ara kendimi&amp;nbsp; Google'da "How To Draw..." araması yaparken buldum. &lt;a href="http://www.drawinghowtodraw.com/stepbystepdrawinglessons/2016/10/draw-cute-kawaii-chibi-robin-dc-comics-batman-robin-easy-steps-drawing-lesson-kids/" target="_blank"&gt;Bir internet sitesinde&lt;/a&gt; DC Comics'in Robin karakterini nasıl &amp;ccedil;izebileceğimizi anlatan i&amp;ccedil;erik ilgimi &amp;ccedil;ekmişti. Geometri bilgisini iyi kullandığı i&amp;ccedil;in anlaşılırdı. Tabii &amp;ouml;nemli bir eksiğim vardı...Yetenek. Sonu&amp;ccedil;ları sizlerle paylaşmayı &amp;ccedil;ok tercih etmiyorum ama yandaki Robin'in kafasının pek yakınlarından ge&amp;ccedil;emediğimi g&amp;ouml;n&amp;uuml;l rahatlığıyla itiraf edebilirim. Dolayısıyla google aramasını ve internet sayfasını kapatıp tekrardan az bu&amp;ccedil;uk anlamaya &amp;ccedil;alıştığım yazılım d&amp;uuml;nyasına d&amp;ouml;nd&amp;uuml;m.&lt;/p&gt;
&lt;p&gt;Aslında bazen &amp;ouml;ğrenmek istediğimiz konuyu adım adım ve her adımında da tane tane anlatan bir dok&amp;uuml;manı takip ederiz. Ama &amp;ccedil;alıştığımız ortamlar her zaman i&amp;ccedil;in bir yerlerde sorunlarla karşılaşmamıza neden olabilirler.&amp;nbsp;Ge&amp;ccedil;tiğimiz&amp;nbsp;cumartesi g&amp;uuml;n&amp;uuml; de benzer sorunlarla karşılaştım. Amacım Amazon'un &lt;a href="http://docs.aws.amazon.com/elasticbeanstalk/latest/dg/create-deploy-python-django.html?refid=em_68105" target="_blank"&gt;şu adreste&lt;/a&gt; yayınladığı dok&amp;uuml;manı takip ederek Elastic Beanstalk &amp;uuml;zerine Django ile oluşturulmuş bir web uygulamasını taşıyıp Doğu Amerika kıtasındaki herhangibir Elastic Compute Cloud(Amazon EC2) sistemi &amp;uuml;zerinden canlı yayına almaktı. İlk başlarda kolay giden adımlar &amp;ouml;zellikle sonlara doğru &amp;ccedil;eşitli s&amp;uuml;rprizlerle karşılaşmama neden oldu.&lt;/p&gt;
&lt;p&gt;Her şey o Cuma g&amp;uuml;n&amp;uuml; AWS'de a&amp;ccedil;mış olduğum hesapla neler yapabileceğime bakarken&amp;nbsp;başladı. Bir s&amp;uuml;re &amp;ouml;ncesinde &lt;a href="/post/AWS-Lambda-Uzerinde-Net-Core-Kosturmak" target="_blank"&gt;Amazon Lambda hizmetini incelemiş&lt;/a&gt; ve .Net Core ile kullanabildiğimi g&amp;ouml;rd&amp;uuml;kten sonra epey keyif almıştım. Şimdiki hedefim Elastic Beanstalk &amp;uuml;r&amp;uuml;n&amp;uuml;yd&amp;uuml;. Kısaca Platform as a Service gibi konumlanan bu &amp;uuml;r&amp;uuml;n sayesinde, &amp;ccedil;eşitli platformları Amazon EC2 &amp;ouml;rnekleri ile &amp;ccedil;alışacak şekilde hazırlayabiliyoruz. Platform anlamında olduk&amp;ccedil;a geniş bir &amp;uuml;r&amp;uuml;n yelpazesi de s&amp;ouml;z konusu. &lt;a href="http://docs.aws.amazon.com/elasticbeanstalk/latest/dg/concepts.platforms.html" target="_blank"&gt;Buradaki adresten&lt;/a&gt; detaylarını &amp;ouml;ğrenebileceğinize gibi .Net Core'dan Go'ya, Python'dan Java'ya, Ruby'den Php'ye, Node.js'ten Docker'a kadar pek &amp;ccedil;ok uygulama i&amp;ccedil;in hazır ortamlar s&amp;ouml;z konusu.&lt;/p&gt;
&lt;p&gt;Buradaki hazırlıklarda Infrastructure as a Service gibi konumlanan Amazon EC2 tarafını da pek d&amp;uuml;ş&amp;uuml;nmemize gerek kalmıyor esasında. Bu noktada EB'nin başarılı bir Deployment aracı olduğunu da ifade edebiliriz. EB'yi kullanırken Amazon Web Console &amp;uuml;zerinden bir ka&amp;ccedil; tıklama ile bir platformu ayağa kaldırıp yayına almamız m&amp;uuml;mk&amp;uuml;n. İşte o Cuma akşamı bunu denemiştim. Şekilden de g&amp;ouml;r&amp;uuml;leceği gibi &amp;uuml;zerinde Python 3.6 ortamı kurulu olan 64bitlik bir Linux makine emrime amadeydi.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/ebpython_0_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hatta hazır şablon olarak gelen bir giriş sayfası da bulunuyordu&lt;em&gt;(What's Next? kısmı da olduk&amp;ccedil;a dikkat &amp;ccedil;ekiciydi. Django ve Flesk hemen dikkatimi &amp;ccedil;ekmişlerdi)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/ebpython_0_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Adres satırından da g&amp;ouml;receğiniz gibi her şey Amazon'un&amp;nbsp;doğu Amerika b&amp;ouml;lgesinde bir yerlerde ger&amp;ccedil;ekleşmekteydi(Sanırım) Kuvvetle muhtemel domain'in arkasında o b&amp;ouml;lgeye ait bir Cloud Server deposu ve EC2 makine &amp;ouml;rnekleri yer almaktaydı. Y&amp;ouml;netim panelini kullanarak bu platform &amp;uuml;zerine dosya bırakma yoluyla da taşımalar yapılabiliyordu. Benim merak ettiğim konu ise kendi geliştirme ortamımda yazdığım bir uygulamay&lt;em&gt;ı(veya hazır şablondan &amp;uuml;retilmiş bir tanesini)&lt;/em&gt;&amp;nbsp;komut satırından Elastic Beanstalk ortamına nasıl aktarabileceğimdi.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;O zaman maceramıza başlayalım. Yapacaklarımız &amp;ouml;zetle olduk&amp;ccedil;a basit. West-world &amp;uuml;zerinde(ki artık 64bit &amp;ccedil;alışan Ubuntu 16.04 sistemi olduğunu biliyorsunuz) sanal bir &amp;ccedil;alışma ortamı hazırlayacağız. Ardından bu ortamda Django &amp;ccedil;atısını kullanarak hazır bir web şablonu &amp;uuml;reteceğiz. Elastic Beanstalk i&amp;ccedil;in gerekli olan &amp;ccedil;evre değişkenlerini ayarladıktan sonra bir Local Repository &amp;uuml;retip taşıma adımlarını işleteceğiz.&lt;/p&gt;
&lt;h1&gt;VirtualEnv Gerekli&lt;/h1&gt;
&lt;p&gt;VirtualEnv ile linux &amp;uuml;zerinde sanal bir ortam hazırlamamız m&amp;uuml;mk&amp;uuml;n. Bunu daha &amp;ccedil;ok sistemde var olan paketlerden daha eski veya yeni s&amp;uuml;r&amp;uuml;mlerini kullanmak istediğimiz uygulamalarda ele alabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo apt-get install virtualenv&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/ebpython_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Sanal Ortamın Kurulumu&lt;/h1&gt;
&lt;p&gt;VirtualEnv aracı hazır olduğuna g&amp;ouml;re artık sanal ortamın kurulmasına başlanabilir.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;virtualenv ~/beanstalk-virt&lt;/pre&gt;
&lt;p&gt;ile python odaklı sanal ortam kurulur.&amp;nbsp;Oluşan klas&amp;ouml;r i&amp;ccedil;eriğine bakıldığında Python ile hazırlanmış kod dosyaları ve ortam enstr&amp;uuml;manları olduğu g&amp;ouml;r&amp;uuml;l&amp;uuml;r. S&amp;uuml;r&amp;uuml;m olarak Python 2.7 s&amp;ouml;z konusudur ki Amazon Elastic Beanstalk'da bu Python s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; tavsiye etmektedir. Sanal ortamı etkinleştirmek i&amp;ccedil;inse aşağıdaki komutu kullanabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;source ~/beanstalk-virt/bin/activate&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/ebpython_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Artık West-World'&amp;uuml;n &amp;uuml;zerinde&amp;nbsp;tamamen izole bir &amp;ccedil;alışma sahası var.&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;Sahne Django'nun&lt;/h1&gt;
&lt;p&gt;Python tarafında web uygulaması geliştirmek i&amp;ccedil;in kullanılan en pop&amp;uuml;ler &amp;ccedil;atılardan birisi Django. Sanal ortama pip paket y&amp;ouml;neticisi yardımıyla ilgili &amp;ccedil;atıyı kurmak gerekiyor.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;pip install django==1.9.12&lt;/pre&gt;
&lt;p&gt;Amazon dok&amp;uuml;mantasyonuna g&amp;ouml;re desteklenen Django versiyonu &amp;ouml;nemli. Ben araştırmalarımı yaptığım sırada Amazon 1.9.12 s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml;n kullanılması tavsiye ediliyordu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/ebpython_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Kurulum başarılı bir şekilde tamamlandıktan sonra hemen hazır web şablonu kullanılarak bir proje oluşturabiliriz. Aşağıdaki komut bunun i&amp;ccedil;in yeterli.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;django-admin startproject amznWebStore&lt;/pre&gt;
&lt;p&gt;Projenin adı amznWebStore. Klas&amp;ouml;r i&amp;ccedil;eriğine bakıldığında Python kod dosyalarından oluşan basit bir i&amp;ccedil;erik oluşturulduğu g&amp;ouml;r&amp;uuml;lebilir. Projeyi bu haliyle local makine &amp;uuml;zerinden &amp;ccedil;alıştırmak istersek manage.py kod dosyasının aşağıdaki gibi &amp;ccedil;ağırılması yeterlidir.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;python manage.py runserver&lt;/pre&gt;
&lt;p&gt;Eğer işler yolunda gittiyse varsayılan olarak localhost'un 8000 numaralı portu &amp;uuml;zerinden web i&amp;ccedil;eriğine ulaşabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/ebpython_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Uygulamanın Elastic Beanstalk'a Taşınması&lt;/h1&gt;
&lt;p&gt;Buraya kadarki işlemlerimizi ş&amp;ouml;yle bir hatırlayalım. İlk olarak West-World &amp;uuml;zerinde sanal bir ortam a&amp;ccedil;tık. Sanal ortam &amp;uuml;zerinde Python y&amp;uuml;kl&amp;uuml; olarak geliyordu. Oluşturulan ortamı etkinleştirdikten sonra basit bir Web uygulamasını ayağa kaldırmak i&amp;ccedil;in Django Framework'&amp;uuml; kurduk. Hi&amp;ccedil;bir kod değişikliği yapmadan manage.py dosyasından yararlanarak bu standart şablonun 127.0.0.1:8000 adresinden ayağa kaldırıldığını g&amp;ouml;rd&amp;uuml;k. Sırada bu uygulamanın Elastic Beanstalk'a taşınması var. &amp;Ouml;nce bir ka&amp;ccedil; hazırlık yapmamız gerekiyor. İlk olarak ortam gereksinimlerin text dosyaya alıyoruz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;pip freeze &amp;gt; requriements.txt&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/ebpython_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dosya i&amp;ccedil;eriğinde aslında tek bir gereksinim var o da taşımanın yapılacağı ortamda Django'nun 1.9.12 s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml;n olmasını istiyor.&amp;nbsp;Takip eden&amp;nbsp;adımda amznWebStore k&amp;ouml;k&amp;nbsp;dizini altında .ebextensions isimli yeni bir klas&amp;ouml;r oluşturup i&amp;ccedil;erisine django.config isimli bir dosya atmamız gerekiyor. Bu dosyanın i&amp;ccedil;eriği aşağıdaki gibi.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;option_settings:
  aws:elasticbeanstalk:container:python:
    WSGIPath: amznWebStore/wsgi.py&lt;/pre&gt;
&lt;p&gt;Aslında Elastic Beanstalk ortamına s&amp;ouml;z konusu uygulamayı nereden başlatacağını s&amp;ouml;ylemekteyiz ki bu senaryoda wsgi.py dosyası oluyor. Bu&amp;nbsp;son iki adım bize şunu &amp;ouml;ğretmekte. Sanal ortamda geliştireceğimiz web uygulaması i&amp;ccedil;erisinde neleri kullanırsak&lt;em&gt;(s&amp;ouml;z gelimi SQLite gibi bir veritabanı, Flesk &amp;ccedil;atısı vb)&lt;/em&gt; bunların Elastic Beanstalk'a s&amp;ouml;ylenmesi gerekmekte.&lt;/p&gt;
&lt;p&gt;Sırada Command Languagen Interface'i kullanarak Local Repository'nin oluşturulması adımı var. Tabii bu aşamada benim gibi aşağıda g&amp;ouml;r&amp;uuml;len sorunlarla karşılaşabilirsiniz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/ebpython_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak eb isimli CLI aracı sisteminizde y&amp;uuml;kl&amp;uuml; olmayabilir. Python ile yazılmış olan bu aracı kullanabilmek i&amp;ccedil;in pip y&amp;ouml;neticisi ile kurmak gerekiyor. Lakin bu kurulum sanal ortamda ger&amp;ccedil;ekleştirilebilen bir kurulum da değil. Benim d&amp;uuml;şt&amp;uuml;ğ&amp;uuml;m bir diğer hata da bu oldu. deactivate komutu ile beanstalk-virt isimli sanal ortamdan &amp;ccedil;ıktıktan sonra gerekli kurulum işlemini yaptım. Sonrasında sanal ortamı etkinleştirip eb init operasyonunu&amp;nbsp;bir kez daha denedim.&lt;/p&gt;
&lt;p&gt;Bu sefer daha farklı bir durumla karşılaştım. İlk olarak hangi b&amp;ouml;lge &amp;uuml;zerine taşıma yapmak istediğimi sorduğunu d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m bir liste ile karşılaştım. Amazon web sitesi &amp;uuml;zerinden yaptığım &amp;ouml;rneği d&amp;uuml;ş&amp;uuml;nerekten us-east-2&lt;em&gt;(13nc&amp;uuml; b&amp;ouml;lge)&lt;/em&gt; se&amp;ccedil;imini yaptım. Tabii sonrasında gelen hata mesajı gayet a&amp;ccedil;ıktı. Credential bilgilerimi bildirmediğim i&amp;ccedil;in yetki hatası almıştım. Hemen &lt;a href="https://console.aws.amazon.com/iam/home#/home" target="_blank"&gt;Amazon Web Console&lt;/a&gt;'a&amp;nbsp; ge&amp;ccedil;erek&amp;nbsp;ve AdministratorAccess Policy'sini kullanan westworld-buraksenyurt isimli bir kullanıcı oluşturdum. Access Key ID ve Secret Access Key değerlerini credential bilgilendirmesi i&amp;ccedil;in kullanarak adımı tamamlamayı başardım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/ebpython_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sonunda uygulama oluşturuldu.&amp;nbsp;Artık tek yapılması gereken ortamın EB &amp;uuml;zerine taşınmasıydı. Aşağıdaki komut ile bunu denedim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;eb create my-eb-sample-env&lt;/pre&gt;
&lt;p&gt;Evdeki hesap &amp;ccedil;arşıya uymamış gibiydi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/ebpython_9.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Uuml;st&amp;uuml;ne &amp;uuml;stelik bir de şu vardı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/ebpython_10.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ne yazık ki sonu&amp;ccedil; pek beklediğim gibi olmadı. Komut satırı hareketliliklerini izlerken Elastic Beanstalk &amp;uuml;zerinde my-eb-sample-env isimli uygulamanın oluşturulduğunu g&amp;ouml;rd&amp;uuml;m ancak site &amp;uuml;zerinden yaptığım uygulama gibi yeşil değil kırmızı renkteydi. Ayrıca komut satırına requriements.txt dosyasının ge&amp;ccedil;ersiz olduğuna dair hata mesajı d&amp;uuml;şm&amp;uuml;şt&amp;uuml;. Requirements.txt dosyasının oluşturulduğu adıma geri d&amp;ouml;nerek sorunu anlamaya &amp;ccedil;alıştım. İlk iş i&amp;ccedil;eriğini aşağıdaki hale getirdim.&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;Django==1.9.12&lt;/pre&gt;
&lt;p&gt;Başka bir şeye ihtiyacım yoktu &amp;ccedil;&amp;uuml;nk&amp;uuml;. Tekrardan&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;eb deploy&lt;/pre&gt;
&lt;p&gt;ile taşıma işlemini yaptım. Şaşılacak şekilde yeşil oku g&amp;ouml;rd&amp;uuml;m. Uygulama Elastic Beanstalk &amp;uuml;zerinde sağlıklı bir şekilde ayağa kalkmış gibi duruyordu. Komut satırından&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;eb open&lt;/pre&gt;
&lt;p&gt;ile siteyi a&amp;ccedil;tırmak istediğimdeyse yine h&amp;uuml;sranla karşılaştım. HTTP_HOST header bilgisinin ge&amp;ccedil;ersiz olduğu s&amp;ouml;yleniyordu.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/ebpython_11.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bunun &amp;uuml;zerine amznWebStore klas&amp;ouml;r&amp;uuml;ndeki settings.py dosyasını a&amp;ccedil;ıp ALLOWED_HOSTS değerinin olduğu satırı bulup aşağıdaki hale getirdim.&lt;/p&gt;
&lt;pre class="brush:py;auto-links:false;toolbar:false" contenteditable="false"&gt;ALLOWED_HOSTS = ['my-eb-sample-env.prii9kimtp.us-east-2.elasticbeanstalk.com']&lt;/pre&gt;
&lt;p&gt;Sonrasında tekrar deploy ve tekrar open.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;eb deploy
eb open&lt;/pre&gt;
&lt;p&gt;Nihayet! Uygulama Elastic Beanstalk &amp;uuml;zerine başarılı bir şekilde taşınmış ve ayağa kaldırılmıştı.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/01/ebpython_12.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Biraz yorucu bir &amp;ccedil;alışma olduğunu ifade edebilirim ancak West-World &amp;uuml;zerinde kurgulanan senaryonun Amazon Elastic Beanstalk &amp;uuml;zerinde konuşlanması tatmin ediciydi de diyebilirim. Bu &amp;ccedil;alışma bana bir &amp;ccedil;ok şey kattı. Bir PaaS'in tam olarak ne işe yarayabileceğini g&amp;ouml;rme fırsatı buldum. Amazon Console penceresini kullanırken her deployment denemesi sonrası web panelindeki anlık hareketleri inceleyip başarılı bir log sisteminin nasıl olabileceğini ve monitoring'in ne kadar &amp;ouml;nemli olduğunu anladım. Belki Django ile oluşturulan web uygulaması i&amp;ccedil;in hi&amp;ccedil; kod yazmadım ama taşıma &amp;ouml;ncesinde platformun hangi gereksinimlere ihtiyacı olduğunun nasıl s&amp;ouml;ylenebileceğini g&amp;ouml;rd&amp;uuml;m. Her anlamda yararlı bir &amp;ccedil;alışma olduğunu ifade edebilirim. Umarım sizler i&amp;ccedil;in de bilgilendirici olmuştur. AWS tarafını incelemeye devam ediyorum. Yeni bir şeyler &amp;ouml;ğrendik&amp;ccedil;e paylaşmaya &amp;ccedil;alışacağım. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2018-02-16 05:00:00</pubDate>
  <slug>bir-aws-elastic-beanstalk-macerasi</slug>
  <tags>
    <tag>python</tag>
    <tag>aws</tag>
    <tag>amazon-web-services</tag>
    <tag>cloud-computing</tag>
    <tag>paas</tag>
    <tag>django</tag>
    <tag>iaas</tag>
    <tag>amazon</tag>
    <tag>amazon-elastic-cloud</tag>
    <tag>amazon-ec2</tag>
  </tags>
  <categories>
    <category>AWS</category>
    <category>python</category>
  </categories>
</post>