<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>İşe Yarar Bir MultiThreading(Çok Kanallı) Uygulama Örneği</title>
  <description>Bundan önceki üç makalemizde iş parçacıkları hakkında bilgiler vermeye çalıştım. Bu makalemde ise işimize yarayacak tarzda bir uygulama geliştirecek ve bilgilerimizi pekiştireceğiz. Bir iş parçacığının belkide en çok işe yarayacağı yerlerden birisi veritabanı uygulamalarıdır. Bazen programımız çok uzun bir sonuç kümesi döndürecek sorgulara veya uzun sürecek güncelleme ifadeleri içeren sql cümlelerine sahip olabilir. Böyle bir durumda programın diğer öğeleri ile olan aktivitemizi devam ettirebilmek isteyebiliriz. Ya da aynı anda bir den fazla iş parçacığında, birden fazla veritabanı işlemini yaptırarak bu işlemlerin tamamının daha kısa sürelerde bitmesini sağlıyabiliriz. İşte bu gibi nedenleri göz önüne alarak bu gün birlikte basit ama faydalı olacağına inandığım bir uygulama geliştireceğiz.</description>
  <content>&lt;p align="left"&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p align="left"&gt;Bundan &amp;ouml;nceki &amp;uuml;&amp;ccedil; makalemizde iş par&amp;ccedil;acıkları hakkında bilgiler vermeye &amp;ccedil;alıştım. Bu makalemde ise işimize yarayacak tarzda bir uygulama geliştirecek ve bilgilerimizi pekiştireceğiz. Bir iş par&amp;ccedil;acığının belkide en &amp;ccedil;ok işe yarayacağı yerlerden birisi veritabanı uygulamalarıdır. Bazen programımız &amp;ccedil;ok uzun bir sonu&amp;ccedil; k&amp;uuml;mesi d&amp;ouml;nd&amp;uuml;recek sorgulara veya uzun s&amp;uuml;recek g&amp;uuml;ncelleme ifadeleri i&amp;ccedil;eren sql c&amp;uuml;mlelerine sahip olabilir. B&amp;ouml;yle bir durumda programın diğer &amp;ouml;ğeleri ile olan aktivitemizi devam ettirebilmek isteyebiliriz. Ya da aynı anda bir den fazla iş par&amp;ccedil;acığında, birden fazla veritabanı işlemini yaptırarak bu işlemlerin tamamının daha kısa s&amp;uuml;relerde bitmesini sağlıyabiliriz. İşte bu gibi nedenleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alarak bu g&amp;uuml;n birlikte basit ama faydalı olacağına inandığım bir uygulama geliştireceğiz.&lt;/p&gt;
&lt;p align="left"&gt;Olayı iyi anlayabilmek i&amp;ccedil;in &amp;ouml;ncelikle bir milat koymamız gerekli. İş par&amp;ccedil;acığından &amp;ouml;nceki durum ve sonraki durum şeklinde. Bu nedenle uygulamamızı &amp;ouml;nce iş par&amp;ccedil;acığı kullanmadan oluşturacağız. Sonrada iş par&amp;ccedil;acığı ile. Şimdi programımızdan kısaca bahsedelim. Uygulamamız aşağıdaki sql sorgusunu &amp;ccedil;alıştırıp, bellekteki bir DataSet nesnesinin referans ettiği b&amp;ouml;lgeyi, sorgu sonucu d&amp;ouml;nen veri k&amp;uuml;mesi ile dolduracak.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;SELECT Products.* From [Order Details] Cross Join Products&lt;/pre&gt;
&lt;p align="left"&gt;Bu sorgu &amp;ccedil;alıştırıldığında, Sql sunucusunda yer alan Northwind veritabanı &amp;uuml;zerinden, 165936 satırlık veri k&amp;uuml;mesi d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Elbette normalde b&amp;ouml;yle bir işlemi istemci makinenin belleğine yığmamız anlamsız. Ancak sunucu &amp;uuml;zerinde &amp;ccedil;alışan ve &amp;ouml;zellikle raporlama amacı ile kullanılan sorguların bu tip sonu&amp;ccedil;lar d&amp;ouml;nd&amp;uuml;rmeside olasıdır. Şimdi bu sorguyu &amp;ccedil;alıştırıp sonu&amp;ccedil;ları bir DataSet'e alan ve bu veri k&amp;uuml;mesini bir DataGrid kontrol&amp;uuml; i&amp;ccedil;inde g&amp;ouml;steren bir uygulama geliştirelim. &amp;Ouml;ncelikle aşağıdaki formumuzu tasarlayalım.&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt; &lt;img src="/makale/images/mk36_1.gif" alt="" width="508" height="372" border="0" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 1. Form Tasarımımız.&lt;/p&gt;
&lt;p align="left"&gt;Şimdide kodlarımızı yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;DataSet ds;

public void Bagla()
{
    dataGrid1.DataSource = ds.Tables[0];
}

public void Doldur()
{
    SqlConnection conNorthwind = new SqlConnection("data source=localhost;initial catalog=Northwind;integrated security=sspi");
    conNorthwind.Open();
    SqlDataAdapter daNorthwind = new SqlDataAdapter("SELECT Products.* From [Order Details] Cross Join Products", conNorthwind);
    ds = new DataSet();

    daNorthwind.Fill(ds);
    conNorthwind.Close();
    MessageBox.Show("DataTable dolduruldu...");
}

private void btnKapat_Click(object sender, System.EventArgs e)
{
    Close();
}

private void btnCalistir_Click(object sender, System.EventArgs e)
{
    Doldur();
}

private void btnGoster_Click(object sender, System.EventArgs e)
{
    Bagla();
}&lt;/pre&gt;
&lt;p align="left"&gt;Yazdığımız kodlar gayet basit. Sorgumuz bir SqlDataAdapter nesnesi ile, SqlConnection'ımız kullanılarak &amp;ccedil;alıştırılıyor ve daha sonra elde edilen veri k&amp;uuml;mesi DataSet'e aktarılıyor. Şimdi uygulamamızı bu haliyle &amp;ccedil;alıştıralım ve sorgumuzu &amp;Ccedil;alıştır başlıklı buton ile &amp;ccedil;alıştırdıktan sonra, textBox kontrol&amp;uuml;ne mouse ile tıklayıp bir şeyler yazmaya &amp;ccedil;alışalım.&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt; &lt;img src="/makale/images/mk36_2.gif" alt="" width="514" height="375" border="0" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 2. İş par&amp;ccedil;acığı olmadan programın &amp;ccedil;alışması.&lt;/p&gt;
&lt;p align="left"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi sorgu sonucu elde edilen veri k&amp;uuml;mesi DataSet'e doldurulana kadar TextBox kontrol&amp;uuml;ne bir şey yazamadık. &amp;Ccedil;&amp;uuml;nk&amp;uuml; işlemcimiz satır kodlarını işletmek ile meşguld&amp;uuml; ve bizim TextBox kontrol&amp;uuml;m&amp;uuml;ze olan tıklamamızı ele almadı. Demekki buradaki sorgumuzu bir iş par&amp;ccedil;acığı i&amp;ccedil;inde tanımlamalıyız. Nitekim programımız donmasın ve başka işlemleride yapabilelim. &amp;Ouml;rneğin TextBox kontrol&amp;uuml;ne bir şeyler yazabilelim (bu noktada pek &amp;ccedil;ok şey s&amp;ouml;ylenebilir. &amp;Ouml;rneğin başka bir tablonun g&amp;uuml;ncellenmesi gibi). Bu durumda yapmamız gereken kodlamayı inanıyorumki &amp;ouml;nceki makalelerden edindiğiniz bilgiler ile biliyorsunuzdur. Bu nedenle kodlarımızı detaylı bir şekilde a&amp;ccedil;ıklamadım. Şimdi gelin yeni kodlarımızı yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;DataSet ds;

public void Bagla()
{
     if(!t1.IsAlive)
     {
          dataGrid1.DataSource=ds.Tables[0];
     }
}

public void Doldur()
{
     SqlConnection conNorthwind=new SqlConnection("data source=localhost;initial catalog=Northwind;integrated security=sspi");
     conNorthwind.Open();

     SqlDataAdapter daNorthwind=new SqlDataAdapter("SELECT Products.* From [Order Details] Cross Join Products",conNorthwind);
     ds=new DataSet();
     daNorthwind.Fill(ds);
     conNorthwind.Close();
     MessageBox.Show("DataTable dolduruldu...");
}

ThreadStart ts1;
Thread t1;

private void btnKapat_Click(object sender, System.EventArgs e)
{
     if(!t1.IsAlive)
     {
          Close();
     }
     else
     {
          MessageBox.Show("Is par&amp;ccedil;acigi hen&amp;uuml;z sonlandirilmadi...Daha sonra tekrar deneyin.");
     }
}

private void btnCalistir_Click(object sender, System.EventArgs e)
{
     ts1=new ThreadStart(Doldur);
     t1=new Thread(ts1);
     t1.Start();
}

private void btnIptalEt_Click(object sender, System.EventArgs e)
{
     t1.Abort();
}

private void btnGoster_Click(object sender, System.EventArgs e)
{
     Bagla();
}&lt;/pre&gt;
&lt;p align="left"&gt;Şimdi programımızı &amp;ccedil;alıştıralım.&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt; &lt;img src="/makale/images/mk36_3.gif" alt="" width="503" height="374" border="0" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 3. İş Par&amp;ccedil;acığının sonucu.&lt;/p&gt;
&lt;p align="left"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi bu yoğun sorgu &amp;ccedil;alışırken TextBox kontrol&amp;uuml;ne bir takım yazılar yazabildik. &amp;Uuml;stelik programın &amp;ccedil;alışması hi&amp;ccedil; kesilmeden. Şimdi G&amp;ouml;ster başlıklı butona tıkladığımızda veri k&amp;uuml;mesinin DataGrid kontrol&amp;uuml;ne alındığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk36_4.gif" alt="" width="512" height="376" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 4. Programın &amp;Ccedil;alışmasının Sonucu.&lt;/p&gt;
&lt;p align="left"&gt;Geldik bir makalemizin daha sonuna. İlerliyen makalelerimizde Thred'leri daha derinlemesine incelemeye devam edeceğiz. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-01-06 12:00:00</pubDate>
  <slug>İşe-Yarar-Bir-MultiThreading(Çok-Kanallı)-Uygulama-Örneği-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>thread</tag>
    <tag>multi-thread</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>