<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Hey Raspi! Gerçekten Çok Güçlü Bir Bilgisayara İhtiyacım Var mı?</title>
  <description>Almanya’daki kuzenlerimden biri olan Haluk abi orta öğrenimi için dayımlar tarafından İstanbul’a gönderilmişti. Şu anda 94 yaşında olan anneannem ve rahmetli Hasan dedemin Barbaros mahallesindeki bahçeli evlerinin üst katında sokak tarafına bakan oturma odasında yaşıyordu. Benim ilkokul sıralarında olduğum zamanlardı. Rahmetli Ali dayım orta okul sınıf geçme hediyesi olarak Haluk abime üstünde Commodore 64 yazan bir bilgisayar almıştı. Vaktinin çoğunu resim yaparak ve 37 ekran renkli televizyona bağlanmış Commodore’unda oyun oynayarak geçiriyordu.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2019/09/raspbian_cover.jpeg" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;1985 Yazı - Hikayenin Başladığı Yer&lt;/h2&gt;
&lt;p&gt;Almanya&amp;rsquo;daki kuzenlerimden biri olan Haluk abi orta &amp;ouml;ğrenimi i&amp;ccedil;in dayımlar tarafından İstanbul&amp;rsquo;a g&amp;ouml;nderilmişti. Şu anda 94 yaşında olan anneannem ve rahmetli Hasan dedemin Barbaros mahallesindeki bah&amp;ccedil;eli evlerinin &amp;uuml;st katında sokak tarafına bakan oturma odasında yaşıyordu. Benim ilkokul sıralarında olduğum zamanlardı. Rahmetli Ali dayım orta okul sınıf ge&amp;ccedil;me hediyesi olarak Haluk abime &amp;uuml;st&amp;uuml;nde Commodore 64 yazan bir bilgisayar almıştı. Vaktinin &amp;ccedil;oğunu resim yaparak ve 37 ekran renkli televizyona bağlanmış Commodore&amp;rsquo;unda oyun oynayarak ge&amp;ccedil;iriyordu.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ılgın pilot Murdock&amp;rsquo;lı A takımının, John Jay Rambo&amp;rsquo;nun, He-Man&amp;rsquo;in, &amp;ldquo;bir alışveriş bir fiş&amp;rdquo; ile KDV&amp;rsquo;nin, siyah okul &amp;ouml;nl&amp;uuml;klerinin, şeytan Rıdvan gol kralı Tanju&amp;rsquo;nun olduğu d&amp;ouml;nemlerdi. Mahallenin bir ka&amp;ccedil; sokak &amp;ouml;tesindeki toprak futbol sahasının yanındaki pasajda m&amp;uuml;zik kasetleri, plaklar ve VHS&amp;rsquo;ler satan k&amp;uuml;&amp;ccedil;&amp;uuml;k bir d&amp;uuml;kkan vardı. Commodore&amp;rsquo;un pop&amp;uuml;lerleşmesiyle birlikte oyun kasetleri doldurmaya da başlamıştı. Bir kaset i&amp;ccedil;inde onlarca oyun olabiliyordu. Summer Games, Green Beret, River Raid, 1942, PaperBoy, Hawkeye, Emlyn Hughes Soccer ve aklıma gelmeyen niceleri&amp;hellip;&lt;/p&gt;
&lt;p&gt;Hangi g&amp;uuml;n olduğunu hatırlamıyorum lakin akşam &amp;uuml;st&amp;uuml; vakitleriydi. Haluk abiyi camda bekliyordum. Beni pek oynatmazdı ama yanında oturup oynadığı oyunları izlememe izin verirdi. Yokuştan aşağıya doğru y&amp;uuml;r&amp;uuml;d&amp;uuml;ğ&amp;uuml;n&amp;uuml; g&amp;ouml;rd&amp;uuml;m. Anneannemin lezzetini hi&amp;ccedil; unutamadığım o nefis re&amp;ccedil;ellerine malzeme yaptığı rengarenk g&amp;uuml;llerle s&amp;uuml;slediği bah&amp;ccedil;enin kapısını a&amp;ccedil;ıp hızlı adımlarla girişe doğru ilerledi. Merdivenlerden &amp;uuml;st kata ikişer ikişer &amp;ccedil;ıktığını anlayabiliyordum. Nefes nefese kalmış bir şekilde odaya girdi ve &amp;ldquo;Yeni oyunlar &amp;ccedil;ıkmış Burak!&amp;rdquo; dedi g&amp;uuml;l&amp;uuml;mseyerek.&lt;/p&gt;
&lt;p&gt;Ama hemen oynayamazdık. İlk başta cihazın &amp;ouml;nceki oyunlar nedeniyle bozulan kafasının d&amp;uuml;zeltilmesi gerekiyordu. Commodore oyunları okumak i&amp;ccedil;in bir kaset&amp;ccedil;alar kullanıyordu. İ&amp;ccedil;indeki kasetin bantına yazılı bitleri kullanarak bizlerin saatlerce Tv başında vakit ge&amp;ccedil;irmesine neden olan bir eğlence makinesiydi.&lt;/p&gt;
&lt;p&gt;Haluk abim saat&amp;ccedil;i tornavidasını kullanarak kaset&amp;ccedil;aların &amp;uuml;st&amp;uuml;ndeki vidayı sağa sola doğru birka&amp;ccedil; kez oynattı. Ekranda sarhoş birisi gibi dolanan eğri b&amp;uuml;ğr&amp;uuml; &amp;ccedil;izgiler bu hareketlerle d&amp;uuml;z bir doğruya d&amp;ouml;n&amp;uuml;şmeye başladı. Bu, kafa ayarının tamamlandığı anlamına geliyordu. Haluk abim oyun kasetini taktı ve Play tuşuna bastı. İlk oyun başladı. Ekranın alt tarafındaki u&amp;ccedil;ak gemisinden kalkan ikinci d&amp;uuml;nya savaşına ait bir tayyare yukarı doğru ilerliyordu. Karşısına &amp;ccedil;ıkan d&amp;uuml;şman u&amp;ccedil;aklarına ateş a&amp;ccedil;ıyor, aşağıdaki hedeflere bomba atıyor, Fuel yazan yerlerden ge&amp;ccedil;erek yakıt takviyesi yapıyordu. Sonra vuruldu. Haluk abi tekrar başladı. Yanında &amp;ccedil;ıt &amp;ccedil;ıkarmadan heyecanla ekranı izliyordum. Joystick kolunu bir o tarafa bir bu tarafa s&amp;uuml;r&amp;uuml;kleyip duruyordu. Bu kez biraz daha ilerlemeyi başarmıştı ama yine vuruldu ve tekrar başladı. Tekrar, tekrar ve tekrar&amp;hellip;&lt;/p&gt;
&lt;p&gt;Dakikalar saatleri tamamlamaya başladı. Sırtımız sokağa d&amp;ouml;n&amp;uuml;k olduğundan kararan havanın farkına bile varamamıştık. Arada akşam ezanı ya da yatsı okunmuştu belki ama fark etmemiştik. Sokak sakinleri zaten &amp;ccedil;oktan evlerine &amp;ccedil;ekilmişti. Zifiri karanlıkta TV ekranına bakıyorduk sadece. Derken kulağımda kısa s&amp;uuml;reli bir acı hissettim. Bir ka&amp;ccedil; yıl sonra bir atari salonunda oyun oynarken aynı acıyı tekrar hissedecektim :) Başımı ş&amp;ouml;yle bir geriye doğru kaldırırken onun tebess&amp;uuml;m eden y&amp;uuml;z&amp;uuml;yle karşılaştığımda Haluk abi sanki oyunun i&amp;ccedil;indeymiş gibi tam konsantre devam ediyordu. İkimizde rahmetli babamın ne odanın kapsını a&amp;ccedil;ışını ne arkamıza ge&amp;ccedil;işini fark etmiştik. Belki bir ka&amp;ccedil; dakikadır tepemizde dikilmiş bekliyordu hatta. Meğer saatler gece yarısını &amp;ccedil;oktan ge&amp;ccedil;mişti. Ufak bir &amp;ccedil;ocuğun o saatte bilgisayar oyunu başında ne işi vardı!?&lt;/p&gt;
&lt;p&gt;Nedense yıllarca o cihazın sadece 64 kilobyte kapasiteli bir bellek ile bizleri ekran başına saatlerce bağlayan oyunlarının nasıl geliştirildiğini d&amp;uuml;ş&amp;uuml;nmemiştim. G&amp;uuml;n&amp;uuml;m&amp;uuml;zde sahip olduğumuz bilgisayarları bir d&amp;uuml;ş&amp;uuml;n&amp;uuml;n. Gigabyte&amp;rsquo;larca ram&amp;rsquo;i olan, &amp;ccedil;ok &amp;ccedil;ekirdekli, m&amp;uuml;thiş ekran kartlı makinelerimiz var. Quantum&amp;rsquo;un sınırlarında gezip y&amp;uuml;ksek hızlara ulaşarak bilimde &amp;ccedil;ığır a&amp;ccedil;acak gelişmelere imza atıyoruz. Peki ger&amp;ccedil;ekten bir programcının ultra mega s&amp;uuml;per kuponlu bir bilgisayara sahip olması şart mı? Neden hep en iyisini arıyoruz?&lt;/p&gt;
&lt;h2&gt;1993 - &amp;Uuml;niversite 1nci Sınıf&lt;/h2&gt;
&lt;p&gt;Y.T.&amp;Uuml;. Matematik M&amp;uuml;hendisliği b&amp;ouml;l&amp;uuml;m&amp;uuml;ne girdiğim yıl programcı olmak istediğime karar vermiştim. İlk yılın birinci ve ikinci d&amp;ouml;nemi grafik &amp;ouml;zellikleri arttırılmış GWBasic dilini ders olarak alıyorduk. Kişisel bilgisayarım olmadığı i&amp;ccedil;in bir &amp;ccedil;ok &amp;ccedil;alışmayı sadece belli saatlerde a&amp;ccedil;ık olan okul labaratuvarında yapmak zorundaydım. O yıl 286 işlemcili bilgisayarların matematiksel işlem birimi arttırılmış 386 modelleri ile değiştirilmesi s&amp;ouml;z konusuydu. Beş &amp;ccedil;eyreklikler yerini 1.44Mb&amp;rsquo;lık disketlere bırakıyordu. A&amp;ccedil;ık gri renkteki bilgisayar kasalarında hard disk bulunmuyordu. Bu nedenle MS-DOS işletim sistemlerini hocamızın verdiği disketlerden y&amp;uuml;kleyerek sistemi a&amp;ccedil;abiliyorduk&lt;em&gt;(Bu zamanın bootable USB&amp;rsquo;leri gibi d&amp;uuml;ş&amp;uuml;nebilirsiniz)&lt;/em&gt; Siyah beyaz t&amp;uuml;pl&amp;uuml; monit&amp;ouml;rler &amp;uuml;zerinde zaman i&amp;ccedil;erisinde Pascal, Cobol, C, C++ gibi lisanları da denedik ama olmuyordu. Kişisel bilgisayarımın olması şarttı. Ne var ki d&amp;ouml;nemin fiyatları en az bug&amp;uuml;nk&amp;uuml; kadar el yakıyordu.&lt;/p&gt;
&lt;p&gt;İmdadıma Siemens&amp;rsquo;te &amp;ccedil;alışan eniştem yetişti. Ge&amp;ccedil;ici bir s&amp;uuml;re de olsa &amp;ccedil;alışmam i&amp;ccedil;in Siemens Nixdorf marka, elektronik daktilodan hallice &amp;ccedil;evrilmiş epey ağır bir laptop getirdi. Ağırlığı nedeniyle dambıl almama bile gerek yoktu. Siyah beyaz ekranı vardı ve &amp;uuml;zerinde Windows 3.1 işletim sistemi koşuyordu. Tabii programlama bir yana &amp;uuml;zerinde denediğim şeylerden birisi de Duke Nukem oynamaktı. Windows&amp;lsquo;un &amp;uuml;st&amp;uuml;nde kabuk olarak koştuğu &amp;ccedil;ekirdek işletim sistemi MS-DOS ile &amp;ccedil;alışan bir oyundu. Siyah beyaz ekran o kadar ge&amp;ccedil; tazeleme hızına sahipti ki karakteri koştururken arkada bıraktığı g&amp;ouml;lgeleri gri tonlu kareler halinde g&amp;ouml;rebiliyordunuz. Biraz ağır olsa da bir laptop&amp;rsquo;un seyyarlığını tatma hissi en azından o yıllarda muhteşemdi.&lt;/p&gt;
&lt;p&gt;Tabii bir s&amp;uuml;re sonra kendi kişisel bilgisayarıma kavuştum. 14 in&amp;ccedil; monit&amp;ouml;r&amp;uuml; olan 486DX-33mhz işlemcili bir bilgisayar. 8Mb RAM&amp;rsquo;inin olduğunu hatırlıyorum. Ekranı şenlendiren 2 Mb&amp;rsquo;lık Diamond Stealth marka bir kartı ve muhteşem ses veren Creative 32bit işlemcisi vardı. Tabii kısa bir s&amp;uuml;re ge&amp;ccedil;mesine rağmen disket s&amp;uuml;r&amp;uuml;c&amp;uuml;leri hala kullanılıyor bununla birlikte CD&amp;rsquo;ler de y&amp;uuml;ksek kapasiteli depolama birimleri olarak boy g&amp;ouml;steriyordu. Artık kasete oyun &amp;ccedil;eken pek yoktu ama disketlere programlar koyuluyordu. Meşhur Yazıcıoğlu işhanına gidip 21 disketten oluşan Delphi 2.0 kurulum paketini aldığımı daha d&amp;uuml;n gibi hatırlarım.&lt;/p&gt;
&lt;p&gt;Delphi&amp;rsquo;nin bende ayır bir yeri vardır. İlk kez onunla yazdığımız ve oluklu mukavva &amp;uuml;reticisi bir matbaa i&amp;ccedil;in geliştirdiğimiz programla para kazanmıştık. 90ların ikinci yarısında Amerika&amp;rsquo;dan Java isimi bir kitap getirtip bana &amp;ldquo;Burak! Gelecek bu. Web!&amp;rdquo; diyen sevgili Orkun ile birlikte 250 dolar kazanmıştık. Ben Taksim&amp;rsquo;deki Elit kitabevinden &lt;a href="https://www.amazon.com/Delphi-2-Unleashed-Charles-Calvert/dp/0672308584/ref=sr_1_1?keywords=Delphi+2+Unleashed&amp;amp;qid=1568626752&amp;amp;s=books&amp;amp;sr=1-1" target="_blank"&gt;Delphi 2 Unleashed isimli 1400 sayfalık bir programlama kitab&lt;/a&gt;ı alırken ileriyi g&amp;ouml;ren Orkun 14.4 Kbps hızında bir modem alarak Atak&amp;ouml;y&amp;rsquo;deki evinin odasından internete a&amp;ccedil;ılmıştı.&lt;/p&gt;
&lt;h2&gt;1997 Şubatı - Compex Fuarı&lt;/h2&gt;
&lt;p&gt;O yıllar ne kadar bilgisayar dergisi varsa alıp okumaktaydım. Yeni &amp;ccedil;ıkan işlemcileri, Visual Basic ve Delphi tarafındaki gelişmeleri, Java&amp;rsquo;nın y&amp;uuml;kselişini, web teknolojilerinin hayatımıza girişini izliyordum. &amp;Uuml;niversitedeki yakın arkadaşlarım bilgisayarlara olan merakımı biliyordu. Bu nedenle yeni bir bilgisayar toplayacakları zaman veya format atmaları gerektiğinde kapımı &amp;ccedil;alarlardı.&lt;/p&gt;
&lt;p&gt;Efes&amp;rsquo;in alt yapısında yıllarca oynayıp Matematik M&amp;uuml;hendisi olmaya karar vermiş 1.96lık sevgili Serkan&amp;rsquo;da en yakın dostlarımdandı. Abdi İpek&amp;ccedil;i&amp;rsquo;de birlikte ma&amp;ccedil; izlediğimiz &amp;ccedil;ok olmuştu ama senede bir bilgisayar fuarına da giderdik. B&amp;ouml;ylece gelişmeleri canlı canlı g&amp;ouml;rebilirdik. &amp;Uuml;stelik bazı firmalar bu fuarlarda indirimler uygulardı. Pentium işlemcilerin yeni serilerinin geldiği heyecanlı g&amp;uuml;nlerdi. Moore yasası s&amp;uuml;rekli olarak işliyor işlemciler iki seneden daha kısa s&amp;uuml;rede transistor sayılarını katlayarak hızlanıyordu.&lt;/p&gt;
&lt;p&gt;Compex o yıl ocak sonu şubat başı a&amp;ccedil;ılmıştı. Serkan, babası ve ben &amp;uuml;&amp;ccedil;&amp;uuml;m&amp;uuml;z birlikte Tepebaşı&amp;rsquo;nda a&amp;ccedil;ılan fuarın yolunu tuttuk. Davetiyelerimizi Pc World dergisinden kapmıştık. Serkan yeni bir bilgisayar almak istiyordu. Tabii ki baş danışman bendim :) Bir stand&amp;rsquo;tan diğerine gidiyor, broş&amp;uuml;rleri alıp modelleri inceliyorduk. Sonunda bir tanesinde karar kıldık. Doğruyu s&amp;ouml;ylemek gerekirse fiyatlara da bakıyorduk. Modelin iki versiyonu vardı. Birisi 32 diğeri 64Mb Ram kapasiteliydi. Pek tabii bu devirde olduğu gibi iki katına &amp;ccedil;ıkan Ram farkı bilgisayar fiyatını da epeyce etkliyordu. Ben Serkan&amp;rsquo;a 64Mb olanını almasını tavsiye ettim. Biraz &amp;ccedil;ekingen halde ve teredd&amp;uuml;t ederek babasına doğru d&amp;ouml;nd&amp;uuml; ve &amp;ldquo;Baba&amp;hellip;32 Mb yerine 64 Mb olanı alalım&amp;rdquo; dedi. On yaşında oğlu olan bir baba olarak benim bug&amp;uuml;n vereceğim tepkinin bir benzerini 1997 kışında Serkan&amp;rsquo;ın babası verdi; &amp;ldquo;Sen &amp;ouml;nce bir 32liği doldur sonra 64l&amp;uuml;ğ&amp;uuml;ne bakarız&amp;rdquo; :D&lt;/p&gt;
&lt;p&gt;Bu hatıram beni hep g&amp;uuml;ld&amp;uuml;r&amp;uuml;r ve durup d&amp;uuml;ş&amp;uuml;n&amp;uuml;r&amp;uuml;m :) Neden en y&amp;uuml;ksek konfigurasyona sahip bir bilgisayar toplama &amp;ccedil;abasındaydık. Bir programcı i&amp;ccedil;in ortam şartları b&amp;uuml;y&amp;uuml;k bir engel oluşturmamalıydı. Optimize edilmesi gereken bir şeyler varsa bunun yolunu kendisi bulmalıydı.&lt;/p&gt;
&lt;h2&gt;2006 Sonbaharı&lt;/h2&gt;
&lt;p&gt;O zamanlar b&amp;uuml;y&amp;uuml;k bir hevesle ve g&amp;ouml;n&amp;uuml;ll&amp;uuml; olarak katıldığım topluluk &amp;ccedil;alışmalarım nedeniyle bir vakit benden savunma istemiş yazılım firmasından ayrıldığım g&amp;uuml;nler. &amp;Ccedil;alıştığım s&amp;uuml;re boyunca şirketin bana verdiği IBM Thinkpad T41 model bilgisayarı kullanmıştım. Tabii geri vermek durumunda kalınca bir anda bilgisayarsız kaldım. Evdeyse hi&amp;ccedil; aşina olmadığım yeşil renkli, dış kapağının saydamlığı nedeniyle i&amp;ccedil;i g&amp;ouml;r&amp;uuml;nen 1998 model bir iMac G3 vardı. İnanılmaz estetik bir tasarımdı. T&amp;uuml;m Apple&amp;rsquo;lar da olduğu gibi.&lt;/p&gt;
&lt;p&gt;Derken başına oturup onu a&amp;ccedil;tım ve bir ka&amp;ccedil; arkadaşıma iş aradığıma dair mail atmak &amp;uuml;zere harekete ge&amp;ccedil;tim. Ne yazık ki orjinal mac klavyesinde @ sembol&amp;uuml;n&amp;uuml; bir t&amp;uuml;rl&amp;uuml; bulamıyordum. Tarayıcı epey tuhaf gelmişti. Başka bir tarayıcıyı nasıl y&amp;uuml;kleyeceğimi bile bilmiyordum. Ger&amp;ccedil;ekten yabancı topraklarda kalmıştım. Bir ka&amp;ccedil; g&amp;uuml;n &amp;ouml;ncesine kadar Microsoft&amp;rsquo;un .Net Framework 2.0 s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde C# 2.0 ile geliştirmeler yapmaya &amp;ccedil;alışan ben sudan &amp;ccedil;ıkmış balık misali &amp;ccedil;aresiz hissediyordum.&lt;/p&gt;
&lt;p&gt;Ancak bir ka&amp;ccedil; yıl &amp;ouml;nce yaptığım keskin Linux ge&amp;ccedil;işine keşke o yıllarda cesaret etseydim demeden edemiyorum. Ger&amp;ccedil;ekten g&amp;uuml;&amp;ccedil;l&amp;uuml; bir Laptop, PC ve Windows işlerimi yapabilmem i&amp;ccedil;in şart mıydı?&lt;/p&gt;
&lt;h2&gt;2019 Eyl&amp;uuml;l - G&amp;uuml;n&amp;uuml;m&amp;uuml;z&lt;/h2&gt;
&lt;p&gt;Yaz başına kadar yaklaşık 8 yıl &amp;ouml;nce aldığım Dell marka bir laptop kullanıyordum. WestWorld olarak isimlendirdiğim alet Ubuntu&amp;rsquo;da koşuyordu. Son olarak 18.04 s&amp;uuml;r&amp;uuml;m&amp;uuml;ne &amp;ccedil;ıkmıştım. 4 &amp;ccedil;ekirdekli intel işlemci, 8 Gb RAM ve 250GB disk kapasitesi hayli hayli yetiyordu. Ekranı bir ka&amp;ccedil; yıl &amp;ouml;nce bozulduğundan harici monit&amp;ouml;r kullanıyordum. Performansı ile ilgili bir sorunum yoktu. Nitekim artık eskisi gibi her şeyi makineye y&amp;uuml;klemeye &amp;ccedil;alışmıyordum. SQL Server&amp;rsquo;a mı ihtiyacım var? Neden ki? Pekala PostgreSQL&amp;rsquo;de de denemelerimi yapabilirim. Peki onu kurmak zorunda mıyım? Elbette hayır! Docker ne g&amp;uuml;ne duruyor :) İlle de SQL gerekiyorsa peki? O zaman Azure&amp;rsquo;a uğrayabilirim. Ya IDE!? Her yeni laptop alındığında mutlak suretle Visual Studio&amp;rsquo;nun en kallavi s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; y&amp;uuml;klemiyor muyuz? Haydi itiraf edin. Ultimate s&amp;uuml;r&amp;uuml;mlerini torrent&amp;rsquo;lerden bulup y&amp;uuml;kl&amp;uuml;yorsunuz değil mi? Yanına SQL Server Management Studio&amp;hellip;Office&amp;rsquo;in tam s&amp;uuml;r&amp;uuml;m&amp;uuml;&amp;hellip;Oysa ki Visual Studio Code a&amp;ccedil;ık kaynak platformlar i&amp;ccedil;in harika bir IDE. Office&amp;rsquo;i ger&amp;ccedil;ekten kurmak gerekli mi? &amp;Uuml;stelik Office 365 varken ve dok&amp;uuml;manlarımıza online olarak her yerden ulaşabiliyorken?&lt;/p&gt;
&lt;p&gt;Ama işte WestWorld&amp;rsquo;&amp;uuml;n o pancar motoru misali g&amp;uuml;r&amp;uuml;lt&amp;uuml;l&amp;uuml; fan sesi yok muydu? M&amp;uuml;zik dinlemeden &amp;ccedil;alıştığım sessiz gecelerimin keyfini ka&amp;ccedil;ırıyordu. Yıllar ge&amp;ccedil;tik&amp;ccedil;e daha fazla zorlanmaya başlamıştı. Soğutucular deniyor, ara ara salon s&amp;uuml;p&amp;uuml;rgesi ile tozlarını &amp;ccedil;ekiyor, Ubuntu&amp;rsquo;nun process&amp;rsquo;lerini kontrol edip sistemi yoranları ayıklamaya &amp;ccedil;alışıyordum. Yine de olmuyordu. Elim yeni bir bilgisayar almaya da gitmiyordu. Fiyatlar ger&amp;ccedil;ekten y&amp;uuml;ksek. Her zaman b&amp;ouml;yleydi belki de ama d&amp;ouml;vizdeki artış, okul taksidi, basketbol ayakkabısı derken hep geriye atmak zorunda kaldığım bir maliyetti.&lt;br /&gt;Sonra g&amp;uuml;nlerden bir g&amp;uuml;n b&amp;uuml;t&amp;ccedil;eyi bir nebze olsun ayarlamayı başardım. İyi bir indirime giren Macbook Mini modelini bir s&amp;uuml;redir kovalıyordum. Ahch-to adını vereceğim aletin fiyatı 3K&amp;rsquo;nın altına d&amp;uuml;şm&amp;uuml;şt&amp;uuml;. Monitor&amp;uuml;m zaten olduğu i&amp;ccedil;in Mini PC tadında isteklerimi karşılayacaktı. &amp;Uuml;stelik uzun zamandır &amp;uuml;zerinde geliştirme yapmayı merak ettiğim macOS işletim sistemini de deneyimleme fırsatı bulacaktım. Bu kez Ubuntu &amp;ccedil;alışmalarından dolayı terminal penceresine biraz daha aşinaydım ve cesaretim vardı.&lt;/p&gt;
&lt;p&gt;Yine de ortada ufak bir p&amp;uuml;r&amp;uuml;z vardı. 4Gb Ram&amp;hellip;G&amp;ouml;z&amp;uuml;me epey az gelmişti. Şirketin verdiği 16Gb RAM&amp;rsquo;li intel Core i7 Pro işlemcili alet bile bazı durumlarda takılabiliyordu. Baktığım mininin 8Gb olan modelindeki intel işlemcisi de daha iyiydi. Ama fiyat neredeyse %60 oranında fazlalaşıyordu. Sonunda bilgisayarı aldım. İlk kurulumlarımı yaptım. Visual Studio Code, xCode, git, Node.Js, docker ve daha bir s&amp;uuml;r&amp;uuml; şeyi &amp;uuml;zerinde denemeye başladım. Ancak korktuğum başıma gelmişti. Ubuntu&amp;rsquo;dan bile yavaştı sistem. Reaksiyon s&amp;uuml;resi &amp;ccedil;ok d&amp;uuml;ş&amp;uuml;kt&amp;uuml;. Chrome tab&amp;rsquo;ları can &amp;ccedil;ekiştiği i&amp;ccedil;in terk edip Safari&amp;rsquo;ye d&amp;ouml;nm&amp;uuml;şt&amp;uuml;m ama pek bir şey değişmemişti. Her nedense makine a&amp;ccedil;ıldıktan &amp;ccedil;ok uzun s&amp;uuml;re sonra kendini toplamaya başlıyor, tabir yerinde ise t anında sadece bir işe odaklanarak nefes alabiliyordu. &amp;ldquo;Keşke&amp;rdquo; dedim yine. Keşke diğer modeli alsaydım. G&amp;uuml;&amp;ccedil;l&amp;uuml; olanı. Daha pahalıydı belki de ama performansı iyi olacaktı.&lt;/p&gt;
&lt;p&gt;Sonra d&amp;uuml;ş&amp;uuml;nmeye başladım. Neden en iyisi gerekiyordu programlama yapmam i&amp;ccedil;in. Merak ettiğim şeyler arasında kullanacaklarımı pekala bulutta konumlandırabilirdim. Performans maliyeti y&amp;uuml;ksek IDE&amp;rsquo;lere gereksinimim yoktu ger&amp;ccedil;ekten de. Ama i&amp;ccedil;ime bir huzursuzluk d&amp;uuml;şm&amp;uuml;şt&amp;uuml;.&lt;/p&gt;
&lt;p&gt;Bunun &amp;uuml;zerine ucuz maliyetli Raspberry Pi 3B+ almaya karar verdim. 1 Gb Ram&amp;rsquo;i olan cihazın &amp;uuml;zerinde Debian tabanlı Raspbian s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; kullanacaktım. 16 Gb&amp;rsquo;lık bir MicroSD kartı bootable disk olarak hazırladım. Ufacık entegrenin hard diski yoktu ama WiFi ile internete bağlanabiliyordu. Daha ilk gece &amp;uuml;st&amp;uuml;nde bir &amp;ccedil;ok şey yapmış, sadeliğine, sessizliğine ve minimal gereksinimlerine hayran kalmıştım. Şimdilik&amp;hellip;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;a href="https://ubuntu-mate.org/blog/ubuntu-mate-bionic-beta1-raspberry-pi/" target="_blank"&gt;Şu adresten &amp;ouml;ğrendiğim kadarıyla&lt;/a&gt; Ubuntu Mate s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml;n en azından beta olarak Raspberry Pi 2,3 modellerine kurulumuna ait bir paylaşım var. Diğer yandan &lt;a href="https://www.fossmint.com/operating-systems-for-raspberry-pi/" target="_blank"&gt;2019 tarihli bu yazıya g&amp;ouml;re&lt;/a&gt; Ubuntu ile sınırlı değiliz. Bir &amp;ccedil;ok işletim sistemini Raspberry Pi &amp;uuml;zerinde kullanmamız m&amp;uuml;mk&amp;uuml;n. Windows IoT Core ve Ubuntu Core&amp;rsquo;da bunlara dahil.&lt;/p&gt;
&lt;p&gt;&lt;a href="https://www.forbes.com/sites/jasonevangelho/2019/07/01/confirmed-ubuntu-mate-is-coming-to-the-raspberry-pi-4/#51296f2b9b4d" target="_blank"&gt;Forbes&amp;rsquo;un bir haberine g&amp;ouml;re&lt;/a&gt; Ubuntu Mate&amp;rsquo;in Raspberry Pi 4'&amp;uuml; destekleyeceği ifade edilse de resmi olarak buna dair bir doğrulama en azından yazıyı hazırladığım tarih itibariyle yoktu. Sadece Estimated Time of Arrival konsepti ile &amp;uuml;zerinde &amp;ccedil;alışıldığına dair s&amp;ouml;ylemler var. Sanırım bu desteğin gelip gelmeyeceğini zaman i&amp;ccedil;erisinde &amp;ouml;ğreneceğiz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2&gt;Raspbian&amp;rsquo;da Bir Gece&amp;hellip;&lt;/h2&gt;
&lt;p&gt;Artık bir şeyleri kurmaya &amp;ccedil;alışıp, programlama ortamını hazırlamak &amp;uuml;zere harekete ge&amp;ccedil;ebilirdim. Saat 22yi ge&amp;ccedil;mişti. S(h)arp Efe ve &amp;uuml;st kattaki g&amp;uuml;r&amp;uuml;lt&amp;uuml;c&amp;uuml; velet &amp;ccedil;oktan uykuya dalmıştı. Mahalle sakinleşmiş ve &amp;ccedil;alışma odam tam olarak istediğim sessizliğe gelmişti. Arkamdaki k&amp;uuml;t&amp;uuml;phanenin &amp;uuml;st rafına kaldırdığım emektar WestWorld&amp;rsquo;e g&amp;ouml;z ucuyla ş&amp;ouml;yle bir baktım ve tebess&amp;uuml;mle &amp;ldquo;Umarım tatilin iyi ge&amp;ccedil;iyordur&amp;rdquo; diyerek klavyeme d&amp;ouml;nd&amp;uuml;m. Planladığım belli bir yol haritası yoktu. Doğa&amp;ccedil;lama gidecektim. &amp;Ouml;ncelikle Raspbian diyarında neler var ne yok bakayım dedim. Aklıma ilk &amp;ouml;nce Raspberry Pi&amp;rsquo;ler ile &amp;ouml;zdeşleşen Python ortamı geldi.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/09/masa.jpg" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Raspbian &amp;uuml;zerinde Python 2 ve 3 s&amp;uuml;r&amp;uuml;mleri ile pip paket y&amp;ouml;neticisi zaten y&amp;uuml;kl&amp;uuml; olarak geliyor ama benim Node.js ve npm ile yapacağım &amp;ccedil;alışmalar da var. Lakin bazı &amp;uuml;r&amp;uuml;nlerin doğru s&amp;uuml;r&amp;uuml;mlerini y&amp;uuml;kleyebilmek ya da desteklerinin olup olmadığını g&amp;ouml;rmek i&amp;ccedil;in ARM işlemcisinin versiyonunu &amp;ouml;ğrenmem gerekmişti. Bunun i&amp;ccedil;in şu terminal komutunu kullanarak &amp;ccedil;alışmalarıma başladım.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;uname -m&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/09/shot_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sonra aşağıdaki komutlarla nodejs&amp;rsquo;i sisteme y&amp;uuml;kledim. Beraberinde npm paket y&amp;ouml;neticisi de geldi tabi.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;curl -sL https://deb.nodesource.com/setup_10.x | sudo bash -
sudo apt install nodejs
node &amp;mdash; version
npm &amp;mdash; version&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/09/shot_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İşte elimin altında nodejs. Rastgele aklıma gelen enstr&amp;uuml;maları toplamaya devam ettim. Mesela şunu merak ediyordum; Raspbian &amp;uuml;zerinde PostgreSQL&amp;rsquo;in Docker Container&amp;rsquo;ını &amp;ccedil;alıştıramaz mıydım? Hani kendi başına &amp;ccedil;alışan hafif bir microservice konuşlandıracağım bir s&amp;uuml;r&amp;uuml; Raspberry cihazımız olur mu hayalinden yola &amp;ccedil;ıkarak&lt;em&gt;(Hatta &amp;ccedil;alıştığım firmadaki bazı yeni nesil &amp;uuml;r&amp;uuml;nlerin SQL Server&amp;rsquo;dan PostgreSQL platformuna g&amp;ouml;&amp;ccedil;&amp;uuml; i&amp;ccedil;in yapılan &amp;ccedil;alışmaları d&amp;uuml;ş&amp;uuml;nerek)&lt;/em&gt; &amp;Ouml;ncesinde Docker bu sistemde &amp;ccedil;alışır mı bunu &amp;ouml;ğrenmem gerekiyordu. Bunun &amp;uuml;zerine terminali aşağıdaki komutlarla şenlendirdim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo curl -fsSL https://get.docker.com -o get-docker.sh
sudo sh get-docker.sh
sudo docker container run hello-world&lt;/pre&gt;
&lt;p&gt;Tabii container&amp;rsquo;ın başarılı bir şekilde &amp;ccedil;alıştığını g&amp;ouml;r&amp;uuml;nce SD kartın &amp;ccedil;abucak dolmasından endişe edip başlatılan container&amp;rsquo;lar ile imajı silmeyi de ihmal etmedim. Savurganlığın l&amp;uuml;zumu yoktu :)&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo docker container ls -a
sudo docker container rm f7db1b 354818
sudo docker image ls
sudo docker image rm 618e43&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/09/shot_3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Pek tabii bir Container&amp;rsquo;ı ayağa kaldırmış olmak iştahımın daha da artmasına neden oldu. Bunun &amp;uuml;zerine PostgreSQL imajını y&amp;uuml;kleyeyim ve iki SQL sorgusu &amp;ccedil;alıştırayım dedim.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo docker run -d &amp;mdash; name c_postgres -v London:/var/lib/postgresql/data -p 54321:5432 postgres:11
sudo docker exec -it c_postgres psql -U postgres
CREATE DATABASE AdventureWorks;
CREATE TABLE IF NOT EXISTS Category (CategoryId SERIAL PRIMARY KEY,Name varchar);
INSERT INTO Category (Name) VALUES (&amp;lsquo;Book&amp;rsquo;);
INSERT INTO Category (Name) VALUES (&amp;lsquo;Movie&amp;rsquo;);
SELECT * FROM Category;&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/09/shot_4.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Veritabanı oluşturabildiğimi, kayıt atıp &amp;ccedil;ekebildiğimi g&amp;ouml;r&amp;uuml;nce epey mutlu oldum. &amp;Ccedil;alışmalarım sırasında ihtiyacım olabilecek veri depoları i&amp;ccedil;in PostgreSQL&amp;rsquo;i burada deneyimleyebilirim&lt;em&gt;(Hatta SQLite gibi s&amp;uuml;r&amp;uuml;mleri de denesem gayet iyi olur)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Daha neleri kontrol edebilirim diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;rken asıl g&amp;ouml;z ağrım .Net Core&amp;rsquo;a ayrı bir sayfa a&amp;ccedil;mam gerektiğini fark ettim. Nitekim C# programlama dilini ve .Net Core platformunu deneyimleyeceğim bir ortam olması &amp;ouml;nemliydi. Biraz araştırma yaptıktan sonra ARM s&amp;uuml;r&amp;uuml;m&amp;uuml; i&amp;ccedil;in &lt;a href="https://dotnet.microsoft.com/download/thank-you/dotnet-sdk-2.2.401-linux-arm32-binaries" target="_blank"&gt;Microsoft&amp;rsquo;un şu adresindeki kaynak&lt;/a&gt;tan yararlanarak Raspbian &amp;uuml;zerine .Net Core SDK 2.2 versiyonunu y&amp;uuml;kleyebildim. Tabi g&amp;uuml;ncel .Net Core s&amp;uuml;r&amp;uuml;mlerinden hangilerinin hayatta kaldığına ara ara bakmakta yarar var. &amp;Ouml;zellikle &amp;uuml;r&amp;uuml;nleştirilmiş s&amp;uuml;r&amp;uuml;mlerimiz varsa bu &amp;ouml;nemli bir nokta. &lt;a href="https://dotnet.microsoft.com/download/dotnet-core" target="_blank"&gt;Microsoft&amp;rsquo;un şu adresindeki g&amp;ouml;rsel imgeler&lt;/a&gt; iyi birer yardımcı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/09/shot_6.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Gerekli kurulumun ardından basit bir Console uygulaması oluşturup denemem yeterliydi. Hen&amp;uuml;z Visual Studio Code edit&amp;ouml;r&amp;uuml; y&amp;uuml;klenebiliyor mu bilmiyordum ama Program.cs i&amp;ccedil;eriğini d&amp;uuml;zenlemek i&amp;ccedil;in Raspbian ile gelen Geany pekala kafiydi.&lt;/p&gt;
&lt;p&gt;Ger&amp;ccedil;i Visual Studio Code&amp;rsquo;un a&amp;ccedil;ık kaynak olarak Raspberry Pi i&amp;ccedil;in genişletilmiş code-oss isimli bir versiyonunu &lt;a href="https://pimylifeup.com/raspberry-pi-visual-studio-code/" target="_blank"&gt;şu adresten indirip&lt;/a&gt; kısa s&amp;uuml;re kullandım. Ancak yorumlarda da belirtilen blank screen probleminin &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; i&amp;ccedil;in update&amp;rsquo;leri kapatmak zorunda kalmak beni biraz rahatsız etti. Belki ilerde işlemcinin armhf s&amp;uuml;r&amp;uuml;m&amp;uuml; i&amp;ccedil;in tam Visual Studio Code desteği gelir.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new console -o hello-from-pi&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/09/shot_5.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şu an i&amp;ccedil;in tek sıkıntı uygulamanın &amp;ccedil;alışmasının &amp;ccedil;ok yavaş olması. Basit bir Hello World uygulaması i&amp;ccedil;in dotnet run komutunun epey beklettiğini fark ettim. Hen&amp;uuml;z bunun sebebini anlayamadım. Belki ve muhtemelen ARM işlemcisinden kaynaklı lakin bu canımı sıkan bir durum değil. &amp;Ccedil;&amp;uuml;nk&amp;uuml; &amp;ccedil;ıt &amp;ccedil;ıkartmayan ve ceket cebime koyup istediğim yere g&amp;ouml;t&amp;uuml;rebileceğim bir bilgisayarım var :) &lt;em&gt;(Gittiğim yerde HDMI girişli bir monitor/tv, klavye ve mouse olması şartıyla tabii)&lt;/em&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Tipik bir desktop kullanıcısının başlangı&amp;ccedil;ta yadırgayacağı tek şey varsayılan olarak Raspberry Pi&amp;rsquo;nin A&amp;ccedil;ma/Kapama d&amp;uuml;ğmesine sahip olmayışıdır. İlk gece işletim sistemini bir ka&amp;ccedil; sefer kitleyince g&amp;uuml;&amp;ccedil; kablosunu &amp;ccedil;ıkartıp tekrar takarak ilkel bir şey yaptığımı da d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m aslında. Fakat buna &amp;ccedil;ok takılmadım. Yine de &lt;a href="https://howchoo.com/g/mwnlytk3zmm/how-to-add-a-power-button-to-your-raspberry-pi" target="_blank"&gt;şu adresteki y&amp;ouml;nergeleri takip ederek&lt;/a&gt; g&amp;uuml;&amp;ccedil; d&amp;uuml;ğmesi entegre edilebileceğini &amp;ouml;ğrendim. Yanlışlıkla mavi kabloyu keserek devrenin patlamasından korkanlar d&amp;uuml;kkandan hazır anahtar mod&amp;uuml;l&amp;uuml; alıp bağlayabilir de ;)&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Pek tabii merak ettiğim ve denemek istediğim bir &amp;ccedil;ok konu var. Git&lt;em&gt;(Raspbian ile y&amp;uuml;kl&amp;uuml; geliyor)&lt;/em&gt; komut satırı aracı ile GitHub projelerine bağlanmak, cihazı NGinX veya Apache sunucusu olarak kurgulayıp web servisi hizmeti sunacak şekilde ayağa kaldırmak, Erlang dilini &amp;ouml;ğrenmek&lt;em&gt;(ki sorunsuz bir şekilde sisteme kuruldu ve hello world uygulaması &amp;ccedil;alıştırılabildi &amp;mdash; bknz aşağıdaki resim)&lt;/em&gt;, Flutter &amp;ccedil;atısının platform &amp;uuml;zerinde kullanılıp kullanılamayacağına bakmak, &lt;a href="https://cloud.google.com/compute/docs/quickstart-linux" target="_blank"&gt;Google Cloud Platform &amp;ouml;ğretilerini takip ederek&lt;/a&gt; bulut tabanlı temel geliştirici operasyonlarını Raspi ile birlikte denemek&lt;em&gt;(gCloud CLI)&lt;/em&gt; ve benzerleri&amp;hellip;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/09/shot_7.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında Raspberry Pi&amp;rsquo;yi bir IoT cihazı gibi kullanmaktansa d&amp;uuml;ş&amp;uuml;k maliyetli ve programlama deneyimi yaşayabileceğim bir ara&amp;ccedil; olarak ele almak şu anki hedeflerimden birisi. En nihayetinde &amp;uuml;zerinde gelen Scratch ile &amp;ccedil;ocuklara temel programlama deneyimini de yaşatıyor ki ben hala b&amp;uuml;y&amp;uuml;medim.&lt;/p&gt;
&lt;h2&gt;Bir &amp;Ouml;ğle Arası&amp;hellip;Şekerpınar&lt;/h2&gt;
&lt;p&gt;Ger&amp;ccedil;ekten de programlama yapmak i&amp;ccedil;in &amp;ccedil;ok g&amp;uuml;&amp;ccedil;l&amp;uuml; bir makineye ihtiyacım var mı? Yeni bir maceraya atılmış gibi hissediyorum. Bazen teknolojinin baş d&amp;ouml;nd&amp;uuml;r&amp;uuml;c&amp;uuml; gelişmesine kızsam da yeni ufuklara yelken a&amp;ccedil;mamıza olanak sağladığı i&amp;ccedil;in hevesleniyorum. Olduk&amp;ccedil;a minimal bir cihaz &amp;uuml;zerinde programlama &amp;ouml;ğrenmeye &amp;ccedil;alışmak&amp;hellip;Motivasyonum tam olarak bu. Piyasadaki bilgisayarlara nazaran &amp;ccedil;ok d&amp;uuml;ş&amp;uuml;k maliyetli bu minion pc i&amp;ccedil;in elde edeceğim deneyime g&amp;ouml;re 128 Gb Micro SD karta ge&amp;ccedil;meyi bile d&amp;uuml;ş&amp;uuml;nebilirim. Hatta &lt;a href="https://www.raspberrypi.org/products/raspberry-pi-4-model-b/specifications/" target="_blank"&gt;4Gb Ram kapasiteli Raspberry Pi 4 s&amp;uuml;r&amp;uuml;m&amp;uuml;&lt;/a&gt; maliyet bazında ciddi olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir ki PC&amp;rsquo;lere hafif bir alternatif olarak &amp;ouml;n plana &amp;ccedil;ıkmakta&lt;em&gt;(&lt;a href="https://www.androidcentral.com/raspberry-pi-4-vs-raspberry-pi-3" target="_blank"&gt;Şuradaki karşılaştırma&lt;/a&gt; konu hakkında fikir verebilir)&lt;/em&gt; Aradığım sorunun cevabını ancak bu şekilde bulabileceğime inanıyorum. Tabii şu &amp;ouml;nemli parametreyi de unutmamak lazım; Bu karışımı &amp;uuml;retim ortamları haricinde yazılım geliştirme adına bir şeyleri &amp;ouml;ğrenmek i&amp;ccedil;in kurcalayacağım deneysel bir &amp;ccedil;alışma sahası olarak g&amp;ouml;r&amp;uuml;yorum. ARM işlemcisi bazı geliştirme platformlarınca desteklenmiyor olsa dahi&amp;hellip;&lt;/p&gt;</content>
  <pubDate>2019-09-16 10:13:00</pubDate>
  <slug>hey-raspi-gercekten-cok-guclu-bir-bilgisayara-ihtiyacim-var-mi</slug>
  <tags>
    <tag>raspberry-pi</tag>
    <tag>raspbian</tag>
    <tag>linux</tag>
    <tag>programming</tag>
    <tag>commodore-64</tag>
    <tag>nodejs</tag>
    <tag>python</tag>
    <tag>dotnetcore</tag>
    <tag>postgresql</tag>
    <tag>80ler</tag>
    <tag>90lar</tag>
    <tag>2000ler</tag>
  </tags>
  <categories>
    <category>Raspberry Pi</category>
  </categories>
</post>