<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ado.Net Data Services Ders Notları - 1 (Merhaba)</title>
  <description>Uzun bir aradan sonra yeni bir makale ile daha birlikteyiz. Sağnak yağışlı ve tamda “bu havada bir makale yazılır” dedirten bir günde hazırladığımız bu yazımızda, daha şimdiden gelecek vaat etmiş görünen, .Net Framework 3.5 Service Pack 1 ile birlikte hazır olarak gelen, Visual Studio 2008 ortamına entegre edilen ve WCF mimarisinin en güzel uyarlamalarından birisi olan ADO.Net Data Services(Astoria) üzerinde konuşuyor olacağız.</description>
  <content>&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Değerli Okurlarım Merhabalar,&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Uzun bir aradan sonra yeni bir makale ile daha birlikteyiz. Sağnak yağışlı ve tamda &amp;ldquo;bu havada bir makale yazılır&amp;rdquo; dedirten bir g&amp;uuml;nde hazırladığımız bu yazımızda, daha şimdiden gelecek vaat etmiş g&amp;ouml;r&amp;uuml;nen, &lt;strong&gt;.Net Framework 3.5 Service Pack 1&lt;/strong&gt; ile birlikte hazır olarak gelen, &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; ortamına entegre edilen ve &lt;strong&gt;WCF&lt;/strong&gt; mimarisinin en g&amp;uuml;zel uyarlamalarından birisi olan &lt;strong&gt;ADO.Net Data Services(Astoria)&lt;/strong&gt; &amp;uuml;zerinde konuşuyor olacağız.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bilindiği &amp;uuml;zere &lt;strong&gt;Windows Communication Foundation(WCF)&lt;/strong&gt;, &lt;strong&gt;Microsoft&lt;/strong&gt;&amp;rsquo; un &lt;strong&gt;.Net Framework 3.0 &lt;/strong&gt;ile duyurduğu ve &lt;strong&gt;3.5&lt;/strong&gt; ile getirdiği yeni ilavelerle &amp;ouml;n plana &amp;ccedil;ıkardığı yeni &lt;strong&gt;Service&lt;/strong&gt; &lt;strong&gt;Y&amp;ouml;nelimli&lt;/strong&gt; &lt;strong&gt;Mimari(Service Oriented Architecture/SOA)&lt;/strong&gt; yaklaşımıdır. Bu yaklaşımın etkileri g&amp;uuml;ncel projelerde kendini uzun zamandır g&amp;ouml;stermektedir. &lt;strong&gt;SOA&lt;/strong&gt; yaklaşımlarının ağırlıklı bir bi&amp;ccedil;imde kabul g&amp;ouml;rd&amp;uuml;ğ&amp;uuml; g&amp;uuml;n&amp;uuml;m&amp;uuml;z &amp;ccedil;&amp;ouml;z&amp;uuml;mlerinde &lt;strong&gt;veri(Data)&lt;/strong&gt; ile olan ilişkiler g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında &lt;strong&gt;Microsoft&lt;/strong&gt; cephesinde uzun s&amp;uuml;re &amp;ouml;nce getirilen yeni bir proje karşımıza &amp;ccedil;ıkmaktadır. &lt;strong&gt;Ado.Net Data Services&lt;/strong&gt;. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Astoria&lt;/strong&gt; kod adı ile anılan ve İstanbul Mecidiyek&amp;ouml;y&amp;rsquo; deki alış veriş merkezinin adaşı olan bu mimarinin uygulanış bi&amp;ccedil;imi &lt;strong&gt;Visual Studio 2008 Service Pack 1&lt;/strong&gt; ile daha da kolay hale gelmiş ve &lt;strong&gt;IDE&lt;/strong&gt; i&amp;ccedil;erisine başarılı bir şekilde entegre edilmiştir. Peki Astoria neler vaat etmektedir ve nasıl bir mimari modele sahiptir? Dilerseniz kısaca bu konulara değinerek yazımızı sabırla okumaya devam edelim.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ouml;ncelikli olarak &lt;strong&gt;Ado.Net Data Services&lt;/strong&gt; bir &lt;strong&gt;WCF&lt;/strong&gt; servis yaklaşımıdır. Bununla birlikte, &lt;strong&gt;WCF&lt;/strong&gt; mimarisine &lt;strong&gt;.Net Framework 3.5&lt;/strong&gt; ile getirilen yeniliklerden biriside; servislerin, &lt;strong&gt;Web Programlama Modeline&lt;/strong&gt; uygun olacak şekilde yayınlanabilmeleridir. Bu &lt;strong&gt;Representational State Transfer&lt;a href="http://en.wikipedia.org/wiki/Representational_State_Transfer"&gt;(REST)&lt;/a&gt;&lt;/strong&gt; modeline uygun servislerin yazılabileceği anlamına gelmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Ebellteki &lt;strong&gt;Web programlama modelinin(Web Programming Model)&lt;/strong&gt; &lt;strong&gt;WCF&lt;/strong&gt; tarafına kazandırdığı tek avantaj &lt;strong&gt;QueryString&lt;/strong&gt; bazlı operasyon desteği değildir. Bunun yanında &lt;strong&gt;JSON(Java Script Object Notation)&lt;/strong&gt; formatında yayınlama ve &lt;strong&gt;RSS&lt;/strong&gt;, &lt;strong&gt;Atom&lt;/strong&gt; bazlı &lt;strong&gt;Syndication&lt;/strong&gt; desteğide gelmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Aslında kafayı &amp;ccedil;ok fazla karıştırmaya gerek yoktur. Aşağıdaki tablo durumu daha net bir şekilde &amp;ouml;zetlemektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;table style="border-collapse: collapse; width: 287px;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="width: 86px; background-color: #ffffff;" bgcolor="#336699" width="86"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt; &lt;span style="font-family: Verdana;"&gt;HTTP İşlemi&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td style="width: 86px; background-color: #ffffff;" bgcolor="#336699" width="177"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt; &lt;span style="font-family: Verdana;"&gt;CRUD Karşılığı&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="86"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Post&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td width="177"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Create, Update, Delete&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="86"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Get&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td width="177"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Read&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="86"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Put&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td width="177"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Create, Overwrite/Replace&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="86"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Delete&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td width="177"&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Delete&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu tabloda anlatılmak istenen şudur; &lt;strong&gt; HTTP&lt;/strong&gt; &amp;uuml;zerinden yapılabilecek olan &lt;strong&gt;Post, Get, Put, Delete&lt;/strong&gt; gibi &amp;ccedil;ağrılar tablonun sağ tarafında yer alan veri operasyonlarına d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lebilirler. O halde işin i&amp;ccedil;ersine veri kelimesinin girdiği ortadadır ve ne varki &lt;strong&gt;Astoria&lt;/strong&gt; a&amp;ccedil;ılımı &lt;strong&gt;Ado.Net Data Services&lt;/strong&gt; olarak ge&amp;ccedil;mektedir. O halde Astoria i&amp;ccedil;in, Ado.Net tabanlı verileri &lt;strong&gt; REST &lt;/strong&gt;&amp;nbsp;modelinin belirttiği kriterlere uygun olacak şekilde dışarıya sunan servis mimarisidir tanımlamasını yapmak yerinde olacaktır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt; &lt;strong&gt;Servis talepleri(Requests) HTTP&lt;/strong&gt; protokol&amp;uuml;ne g&amp;ouml;re &lt;strong&gt; QueryString&lt;/strong&gt; bazlı olmaktadır. Bu talepler servis tarafına ulaştıklarında ise arka planda bir &lt;strong&gt;Data Access Layer&lt;/strong&gt; tarafından karşılanmakta ve operasyonel olarak &lt;strong&gt;CRUD(CreateReadUpdateDelete)&lt;/strong&gt; işlemlerine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmektedir. Sonrasında istemciye g&amp;ouml;nderilecek olan cevaplar &lt;strong&gt;XML&lt;/strong&gt; bazlı olarak ele alınmaktadır. Standart olarak &lt;strong&gt; ATOM&lt;/strong&gt; formatında bir &lt;strong&gt;XML&lt;/strong&gt; &amp;ccedil;ıktısı istemci tarafına g&amp;ouml;nderilmektedir. Bu tanımlamalar kısaca bir fikir versede mimari detaylara bakmakta yarar vardır. Aşağıdaki şekil &lt;strong&gt;Astoria&lt;/strong&gt; mimarisini kısaca &amp;ouml;zetlemektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_1.gif" alt="" width="480" height="367" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ccedil;ok kısaca mimari &amp;uuml;zerinden konuşarak devam edelim. &amp;Ouml;ncelikli olarak &lt;strong&gt;internet&lt;/strong&gt; veya &lt;strong&gt;intranet&lt;/strong&gt; &amp;uuml;zerinden talepte bulunabilecek bir &lt;strong&gt;istemci(Client)&lt;/strong&gt; uygulama s&amp;ouml;z konusudur. Bu uygulama standart bir .&lt;strong&gt;Net&lt;/strong&gt; programı olabilir. &amp;Ouml;rneğin bir &lt;strong&gt;Windows/WPF&lt;/strong&gt; yada basit bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması. &amp;Ccedil;ok doğal olarak istemci başka bir &lt;strong&gt;servisde&lt;/strong&gt; olabilir. Ancak g&amp;uuml;n&amp;uuml;m&amp;uuml;zde &lt;strong&gt;Ado.Net Data Service &lt;/strong&gt;&amp;ouml;rneklerini kullanacak en pop&amp;uuml;ler istemciler web tabanlı olanlarıdır. Bir başka deyişle &lt;strong&gt;Ajax&lt;/strong&gt; &lt;strong&gt; Based&lt;/strong&gt; &lt;strong&gt;Client&lt;/strong&gt; ve &lt;strong&gt;Silverlight&lt;/strong&gt; gibi u&amp;ccedil; birimler &amp;ouml;rnek olarak verilebilirler. İlerleyen kısımlarda &lt;strong&gt;Ajax&lt;/strong&gt; tabanlı bir istemcinin nasıl geliştirileceğine de değinilecektir. İstemci uygulamalar, servise doğru QueryString benzeri formatta bir talepte bulunabilir. &amp;Ouml;rneğin;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;http://localhost:4501/AdventureServices/ProductService.svc/ProductSubcategory?$orderby=Name desc&lt;/pre&gt;
&lt;p&gt;gibi.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Aslında bu ifade son derece a&amp;ccedil;ıktır. Tahmin edileceği &amp;uuml;zere &lt;strong&gt;HTTP&lt;/strong&gt; tabanlı olaraktan &lt;strong&gt;localhost&lt;/strong&gt; isimli yerel makinede &lt;strong&gt;4501&lt;/strong&gt; numaralı port &amp;uuml;zerinden yayın yapan &lt;strong&gt; ProductService.svc &lt;/strong&gt;isimli bir &lt;strong&gt;WCF&lt;/strong&gt; servisi s&amp;ouml;z konusudur. Servise giden talep ise şunu ifade etmektedir; &lt;strong&gt;&amp;ldquo;L&amp;uuml;tfen ProductSubcategory verilerini Name alanlarına g&amp;ouml;re ters sırada olacak şekilde g&amp;ouml;nderin&amp;rdquo;&lt;/strong&gt;. İşte &lt;strong&gt;svc&lt;/strong&gt; uzantısından sonra gelen ifade basit bir &lt;strong&gt;QueryString&lt;/strong&gt; tanımlamasıdır. Elbetteki arada kullanılan &lt;strong&gt;$ &lt;/strong&gt;işareti ifadeyi &lt;strong&gt;Ado.Net Data Services &lt;/strong&gt;i&amp;ccedil;in biraz &amp;ouml;zelleştirmektedir. Bu noktada talebin servis tarafına ulaştığını d&amp;uuml;ş&amp;uuml;nebiliriz. Peki servis bu noktadan sonra ne yapmaktadır? &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Service tarafında &lt;strong&gt;&amp;ccedil;alışma zamanında(RunTime)&lt;/strong&gt; devrede olan &lt;strong&gt;DataServiceHost&lt;/strong&gt; &lt;em&gt;(&lt;strong&gt;WebServiceHost&lt;/strong&gt; sınıfından t&amp;uuml;reyen ki buda &lt;strong&gt;WCF&lt;/strong&gt; Servislerinde &amp;ccedil;ekirdek olan &lt;strong&gt; ServiceHost&lt;/strong&gt; sınıfından t&amp;uuml;remektedir.)&lt;/em&gt; nesne &amp;ouml;rneği, gelen talebi arka planda ele alır. Bu noktada elde iki se&amp;ccedil;enek yer almaktadır. Bunlardan birisi yine &lt;strong&gt;Visual Studio 2008 Service Pack 1 &lt;/strong&gt;ile &lt;strong&gt; IDE&lt;/strong&gt; ortamına dahil olan &lt;strong&gt;Entity Data Model(EDM) &lt;/strong&gt;a&amp;ccedil;ılımının kullanılmasıdır. Diğeri ise &amp;ouml;zel &lt;strong&gt;LINQ&lt;/strong&gt; &lt;strong&gt;Provider&lt;/strong&gt; kullanıldığı se&amp;ccedil;enektir. &lt;strong&gt;LINQ&lt;/strong&gt; &lt;strong&gt;Provider&lt;/strong&gt; kullanımı yardımıyla &lt;strong&gt;REST&lt;/strong&gt; taleplerinin nesneler &amp;uuml;zerindede ele alınması sağlanabilmektedir ki bununla ilişkili bir &amp;ouml;rneği ilerleyen b&amp;ouml;l&amp;uuml;mlerde geliştiriyor olacağız. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;EDM&lt;/strong&gt; modeline g&amp;ouml;re veritabanı bazlı &lt;strong&gt;Entity tipler(Types)&lt;/strong&gt; ve bu tiplere ait &lt;strong&gt;&amp;uuml;yeler(Members)&lt;/strong&gt; s&amp;ouml;z konusudur. Burada temel ama&amp;ccedil; veritabanı &amp;uuml;zerindeki nesnel yapıların&lt;strong&gt; OOP(Object Oriented Programming)&lt;/strong&gt; ortamında karşılıkları olan &lt;strong&gt; sınıf(Class) &lt;/strong&gt;tiplerinde ve &amp;uuml;yelerinde&lt;em&gt;(Her alanın karşılığı olan bir &amp;ouml;zellik ile)&lt;/em&gt; ele alabilmektir. B&amp;ouml;ylece kod ortamından veritabanı &amp;uuml;zerine ge&amp;ccedil;iş yapmaya gerek kalmadan &lt;strong&gt;CRUD&lt;/strong&gt; operasyonları kolayca icra edilebilir. &lt;strong&gt;EDM&lt;/strong&gt; a&amp;ccedil;ısından olaya baktığımızda sadece yukarıdaki basit &lt;strong&gt;okuma(READ) &lt;/strong&gt;talebi i&amp;ccedil;in aşağıdaki şekil biraz daha aydınlatıcı ve fikir verici olabilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_2.gif" alt="" width="553" height="412" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;REST&lt;/strong&gt; bazlı talep, &lt;strong&gt;Ado.Net Data Service Entry Point&lt;/strong&gt;&amp;rsquo; e ulaştıktan sonra servis &amp;ccedil;alışma zamanı tarafından veritabanına doğru basit &lt;strong&gt;sorgular(Queries) &lt;/strong&gt;şeklinde g&amp;ouml;nderilirler. Bunun doğal sonucu olarak bazı veri k&amp;uuml;meleri elde edilir. Elde edilen sorgu sonu&amp;ccedil;ları &lt;strong&gt;EDM&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &lt;strong&gt;Entity&lt;/strong&gt; nesneleri ve &amp;uuml;yeleri tarafından değerlendirilir. Nitekim veritabanı tarafındaki nesnelerin karşılığı olan varlıklar, &lt;strong&gt;EDM&lt;/strong&gt; i&amp;ccedil;erisinde yer almakta olup &amp;ccedil;alışma zamanında servis operasyonları tarafından ele alınmaktadır. Bir başka deyişle &amp;ouml;rnek baz alındığında, &lt;strong&gt; ProductSubCategory&lt;/strong&gt; tablosu i&amp;ccedil;erisindeki herhangibir &lt;strong&gt;satırın(Table Row)&lt;/strong&gt; karşılığı olan &lt;strong&gt;ProductSubcategory&lt;/strong&gt; sınıfına ait nesne &amp;ouml;rneklerinden oluşan bir &lt;strong&gt;koleksiyon(Collection) &lt;/strong&gt;&amp;uuml;retimi ger&amp;ccedil;ekleşir. Bu &amp;uuml;retim sonrasında ilgili koleksiyon, servis &amp;ccedil;alışma ortamı tarafından &lt;strong&gt;XML&lt;/strong&gt; &amp;ccedil;ıktısı haline getirilir ve istemciye g&amp;ouml;nderilir. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Sanıyorumki artık bir &amp;ouml;rnek geliştirerek konuyu pekiştirmenin ve makalenin yazıldığı bu yağmurlu g&amp;uuml;nde ekranımızda bir g&amp;uuml;neş a&amp;ccedil;tırmanın zamanı geldi. İlk olarak &amp;ouml;rneğin &lt;strong&gt; Visual Studio 2008 Professional Service Pack 1&lt;/strong&gt; &amp;uuml;zerinde geliştirildiğini belirtelim. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;Ado.Net Data Service&lt;/strong&gt;' ler esas itibariyle birer &lt;strong&gt;WCF&lt;/strong&gt; servis &amp;ouml;ğesi olarak tanımlanırlar. Bu sebepten dolayı s&amp;ouml;z konusu servislerin bir sunucu uygulama &amp;uuml;zerinde &lt;strong&gt; host&lt;/strong&gt; edilmeleri gerekmektedir. Burada istenirse bir &lt;strong&gt;WCF&lt;/strong&gt; &lt;strong&gt; Service&lt;/strong&gt; uygulaması baz alınabilir. Yada herhangibir &lt;strong&gt;Asp.Net Web Site/Asp.Net Web Application&lt;/strong&gt; &amp;uuml;zerindede bu işlem ger&amp;ccedil;ekleştirilebilir. &lt;strong&gt;Web&lt;/strong&gt; tarafındaki geliştirme kurallarının buradada ge&amp;ccedil;erli olduğunu ve buna g&amp;ouml;re &lt;strong&gt;dosya tabanlı(File-Based)&lt;/strong&gt; yada doğrudan &lt;strong&gt;IIS&lt;/strong&gt; &amp;uuml;zerinde geliştirme yapabileceğimizi hatırlayalım. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Biz &amp;ouml;rneğimizde &lt;strong&gt;AdventureServices&lt;/strong&gt; adlı &lt;strong&gt;WCF&lt;/strong&gt; &lt;strong&gt;Service&lt;/strong&gt; şablonunu kullanacağız. &lt;strong&gt;AdventureServices&lt;/strong&gt; isimli proje &lt;strong&gt;File-Based &lt;/strong&gt;olarak geliştirilecektir. Servis uygulaması oluşturulduktan sonra ilk yapılması gereken, &lt;strong&gt;Ado.Net Data Service&lt;/strong&gt;' in kullanacağı &lt;strong&gt;Data Access Layer&lt;/strong&gt; ortamını hazırlamaktır. Burada daha &amp;ouml;ncedende belirtildiği &amp;uuml;zere &lt;strong&gt;EDM&lt;/strong&gt;,&lt;strong&gt; LINQ Provider &lt;/strong&gt; se&amp;ccedil;enekleri mevcuttur. &amp;Ouml;rneğimizde &lt;strong&gt;Entity&lt;/strong&gt; &lt;strong&gt;Data&lt;/strong&gt; &lt;strong&gt;Model&lt;/strong&gt; kullanılmaktadır. &lt;strong&gt;EDM&lt;/strong&gt; nesnesini eklemek i&amp;ccedil;in projeye sağ tıkladıktan sonra aşağıdaki resimde yer alan &lt;strong&gt;Ado.Net Entity Data Model &lt;/strong&gt;şablonunu se&amp;ccedil;mek yeterli olacaktır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_3.gif" alt="" width="615" height="372" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;İsim olarak &lt;strong&gt;AdventureModel&lt;/strong&gt; adı kullanılabilir. &lt;strong&gt;edmx&lt;/strong&gt; uzantılı dosya se&amp;ccedil;imi yapıldıktan sonra bir dizi adımdan oluşan sihirbaz arabirimi ile karşılaşılır. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_4.gif" alt="" width="525" height="318" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;İlk adımda &lt;strong&gt;EDM&lt;/strong&gt; modelinin var olan bir veritabanından oluşturulacağı se&amp;ccedil;imi yapılır&lt;strong&gt;(Generate from database)&lt;/strong&gt;. Ancak istenirse &lt;strong&gt;Empty&lt;/strong&gt; &lt;strong&gt;Model&lt;/strong&gt; kullanılarak, &lt;strong&gt;EDM&lt;/strong&gt; tiplerinin g&amp;ouml;rsel olarak veritabanından bağımsız tasarlanması ve ilgili sınıfları ve &amp;uuml;yelerinin oluşturulması sağlanabilir. Bu &amp;ccedil;oğunlukla &lt;strong&gt;Entity&lt;/strong&gt; tasarımının &amp;ouml;nceden yapılıp sonrasında veriye bağlama kararının verileceği durumlarda ele alınabilir. Ki bu şekilde oluşturulan &lt;strong&gt;Entity&lt;/strong&gt; nesneleri i&amp;ccedil;erisinde &lt;strong&gt;LINQ&lt;/strong&gt; &lt;strong&gt;Provider&lt;/strong&gt;' lar kullanılarak farklı sağlayıcılara&lt;em&gt;(&amp;ouml;rneğin &lt;strong&gt;XML&lt;/strong&gt; veya &lt;strong&gt; Object&lt;/strong&gt; tiplerine) &lt;/em&gt;doğru eşleştirmelerde ger&amp;ccedil;ekleştirilebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_5.gif" alt="" width="536" height="485" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;İkinci adımda &lt;strong&gt;bağlantı(Connection)&lt;/strong&gt; se&amp;ccedil;imi yapılır. Buna g&amp;ouml;re herhangibir veritabanı bağlantısı kullanılabilir. S&amp;ouml;z konusu bağlantılara ilişkin bilgiler ise istenirse &lt;strong&gt;Web.config &lt;/strong&gt;dosyası i&amp;ccedil;erisinde saklanabilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_6.gif" alt="" width="536" height="485" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; adımda, oluşturulan bağlantı &amp;uuml;zerindeki veritabanı i&amp;ccedil;eriği g&amp;ouml;r&amp;uuml;l&amp;uuml;r. Burada &lt;strong&gt;tablolar(Tables)&lt;/strong&gt;, &lt;strong&gt;g&amp;ouml;r&amp;uuml;n&amp;uuml;mler(Views)&lt;/strong&gt; ve &lt;strong&gt;saklı yordamlar(Stored Procedures) &lt;/strong&gt; yer almaktadır. Dolayısıyla bu adımda, &lt;strong&gt;EDM&lt;/strong&gt; i&amp;ccedil;erisindeki tiplerin eş d&amp;uuml;şt&amp;uuml;ğ&amp;uuml; veritabanı objeleri işaretlenir. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_7.gif" alt="" width="342" height="347" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ouml;rnekte yukarıdaki şekildende g&amp;ouml;r&amp;uuml;leceği &amp;uuml;zere &lt;strong&gt;ProductSubCategory&lt;/strong&gt; ve &lt;strong&gt;Product&lt;/strong&gt; tabloları ele alınmaktadır. Bu tablolar arasında &lt;strong&gt;bire-&amp;ccedil;ok(One to many) &lt;/strong&gt;ilişki olması nedeni ile ilişkisel yapılarıda inceleyebilme fırsatımız olacaktır. T&amp;uuml;m bu işlemler tamamlandıktan sonra aşağıdaki &lt;strong&gt;EDM&lt;/strong&gt; diagramının oluştuğu g&amp;ouml;r&amp;uuml;lecektir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_8.gif" alt="" width="531" height="534" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Dikkat edilecek olursa &lt;strong&gt; ProductSubCategory&lt;/strong&gt; ve &lt;strong&gt;Product&lt;/strong&gt; tablolarının kendileri birer sınıf olarak oluşturulmuş, alanları birer &amp;uuml;ye olarak ilave edilmiştir. Bunlara ek olarak her iki tablo arasındaki &lt;strong&gt;ilişki(Relation)&lt;/strong&gt;, &lt;strong&gt; EDM &lt;/strong&gt;i&amp;ccedil;erisinde bir &lt;strong&gt;Association&lt;/strong&gt; olarak tanımlanmıştır. Dikkat &amp;ccedil;ekici &amp;ouml;zelliklerden bir diğeri ise sınıflara ait nesne &amp;ouml;rnekleri &amp;uuml;zerinden birbirlerine ge&amp;ccedil;iş yapılmasını sağlayacak &lt;strong&gt; &amp;ouml;zelliklerin(Properties)&lt;/strong&gt; eklenmiş olmasıdır. S&amp;ouml;z gelimi bir alt kategoriye bağlı &amp;uuml;r&amp;uuml;nleri elde etmek i&amp;ccedil;in &lt;strong&gt;ProductSubcategory&lt;/strong&gt; tipine ait nesne &amp;ouml;rneği &amp;uuml;zerinden &lt;strong&gt;Product&lt;/strong&gt; &amp;ouml;zelliği kullanılabilir. Oluşturulan bu sınıflar ve eş d&amp;uuml;şt&amp;uuml;kleri veritabanı objeleri arasındaki ilişkiler istenirse &lt;strong&gt;Model&lt;/strong&gt; &lt;strong&gt;Browser&lt;/strong&gt; aracılığıyla aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibide izlenebilir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_9.gif" alt="" width="408" height="531" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&amp;Ouml;rnekteki &lt;strong&gt;Model&lt;/strong&gt; &lt;strong&gt;Browser&lt;/strong&gt; g&amp;ouml;rselinde, &lt;strong&gt;AdventureWorksModel&lt;/strong&gt; kısmında &lt;strong&gt;EDM&lt;/strong&gt; i&amp;ccedil;eriği haritalanmaktadır. Diğer taraftan &lt;strong&gt;AdventureWorksModel.Store&lt;/strong&gt; boğumu(Node) altında ise, &lt;strong&gt;EDM&lt;/strong&gt; i&amp;ccedil;eriğinin karşılıkları olan veritabanı unsurları listelenmektedir. &lt;strong&gt;AdventureModel.Designer.cs&lt;/strong&gt; dosyasına bakıldığında ise 3 adet &lt;strong&gt;sınıfın(Class)&lt;/strong&gt; oluşturulduğu g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_10.gif" alt="" width="384" height="102" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Product&lt;/strong&gt; ve &lt;strong&gt;ProductSubcategory&lt;/strong&gt; tipleri dışında &lt;strong&gt;AdventureWorksEntities&lt;/strong&gt; isimli bir tipin daha olduğu g&amp;ouml;r&amp;uuml;lmektedir ki &amp;uuml;yeleri aşağıdaki şekilde olduğu gibidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_11.gif" alt="" width="462" height="184" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;strong&gt;AdventureWorksEntites&lt;/strong&gt;, &lt;strong&gt; ObjectContext&lt;/strong&gt; sınıfından t&amp;uuml;remiştir ve &lt;strong&gt;Entity&lt;/strong&gt; koleksiyonlarının y&amp;ouml;netimi, &lt;strong&gt;EDM&lt;/strong&gt; nesnelerinin eş d&amp;uuml;şt&amp;uuml;ğ&amp;uuml; veri objeleri ile olan fonksiyonelliklerin ele alınması gibi kritik g&amp;ouml;revleride &amp;uuml;stlenmek &amp;uuml;zere tasarlanmıştır. &amp;Ouml;yleki, &lt;strong&gt;Product&lt;/strong&gt; ve &lt;strong&gt; ProductSubcategory&lt;/strong&gt; nesne toplulukları bu sınıf i&amp;ccedil;erisinde aşağıdaki kod par&amp;ccedil;asında olduğu gibi tutulmaktadır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public global::System.Data.Objects.ObjectQuery&amp;lt;Product&amp;gt; Product
{
    get
    {
        if ((this._Product == null))
        {
            this._Product = base.CreateQuery&amp;lt;Product&amp;gt;("[Product]");
        }
        return this._Product;
    }
}
private global::System.Data.Objects.ObjectQuery&amp;lt;Product&amp;gt; _Product;

public global::System.Data.Objects.ObjectQuery&amp;lt;ProductSubcategory&amp;gt; ProductSubcategory
{
    get
    {
        if ((this._ProductSubcategory == null))
        {
            this._ProductSubcategory = base.CreateQuery&amp;lt;ProductSubcategory&amp;gt;("[ProductSubcategory]");
        }
        return this._ProductSubcategory;
    }
}
private global::System.Data.Objects.ObjectQuery&amp;lt;ProductSubcategory&amp;gt; _ProductSubcategory;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;ObjectQuery&amp;lt;T&amp;gt; &lt;/strong&gt;tipinden birer &lt;strong&gt; readonly&lt;/strong&gt; &lt;strong&gt;&amp;ouml;zellik(Property)&lt;/strong&gt; yardımıyla! Ve yine bir &amp;uuml;r&amp;uuml;n&amp;uuml;n veya alt kategorinin eklenmesi i&amp;ccedil;in &lt;strong&gt;AddToProduct&lt;/strong&gt; ve &lt;strong&gt; AddToProductSubcategory&lt;/strong&gt; isimli metodlarda yer almaktadır. Bu noktada akla ş&amp;ouml;yle bir soru gelebilir. &lt;strong&gt;Update&lt;/strong&gt;, &lt;strong&gt;Delete&lt;/strong&gt; işlemleri i&amp;ccedil;in niye metodlar bulunmamaktadır? S&amp;ouml;z konusu sorunun cevabı ilerleyen b&amp;ouml;l&amp;uuml;mlerde verilecektir ve bu nedenle sizlere biraz d&amp;uuml;ş&amp;uuml;nme ve araştırma s&amp;uuml;resi kalmaktadır. Bu detayları şimdilik geride bırakarak asıl konumuza geri d&amp;ouml;nmenin yararlı olacağı kanısındayım. Artık &lt;strong&gt;WCF&lt;/strong&gt; &lt;strong&gt;Service&lt;/strong&gt; uygulamasına bir &lt;strong&gt;Ado.Net Data Service&lt;/strong&gt; eklenebilir. Tek yapılması gereken projeye &lt;strong&gt;Add&lt;/strong&gt; &lt;strong&gt;New&lt;/strong&gt; &lt;strong&gt;Item&lt;/strong&gt; se&amp;ccedil;eneği ile aşağıdaki şekildede g&amp;ouml;r&amp;uuml;len &lt;strong&gt;Ado.Net Data Service&lt;/strong&gt; &amp;ouml;ğesini eklemektir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_13.gif" alt="" width="540" height="325" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Bu işlemin ardından proje şablounan &lt;strong&gt; ProductService&lt;/strong&gt;.&lt;strong&gt;svc&lt;/strong&gt; servis ve &lt;strong&gt;ProductService.cs&lt;/strong&gt; &lt;strong&gt; code-behind&lt;/strong&gt; dosyaları eklenecektir. &lt;em&gt;(S&amp;ouml;z konusu işlemlerde biz &lt;strong&gt; WCF&lt;/strong&gt; geliştiricilerini şaşırtan herhangibir nokta bulunmamaktadır. Nitekim &lt;strong&gt;Web&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;host&lt;/strong&gt; edilen bir &lt;strong&gt;WCF&lt;/strong&gt; serviside aynı prensiplerde oluşturulmaktadır. Bir &lt;strong&gt;svc&lt;/strong&gt; i&amp;ccedil;eriği ve &amp;ccedil;oğunlukla &lt;strong&gt;code-behind&lt;/strong&gt; &amp;uuml;zerinde tutulan kod i&amp;ccedil;eriği.)&lt;/em&gt; &lt;strong&gt; ProductService.cs&lt;/strong&gt; i&amp;ccedil;eriği kısaca incelendiğinde bir &lt;strong&gt;başlatma işleminin(Initialization)&lt;/strong&gt; yapılması gerektiği g&amp;ouml;r&amp;uuml;lmektedir. Nitekim servis nesnesi &amp;ouml;rneklendiğinde &lt;strong&gt;EDM&lt;/strong&gt; i&amp;ccedil;erisindeki hangi tiplerin hangi şartlarda yayınlanacağının belirlenmesi gerekmektedir. Bu bir anlamda yetkilendirme s&amp;uuml;reci olarakta d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. S&amp;ouml;z konusu &lt;strong&gt; ProductService.cs &lt;/strong&gt;i&amp;ccedil;eriği &amp;ouml;rnek i&amp;ccedil;in aşağıdaki gibi değiştirilmelidir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data.Services;
using System.Collections.Generic;
using System.Linq;
using System.ServiceModel.Web;
using AdventureWorksModel;

public class ProductService 
    : DataService&amp;lt;AdventureWorksEntities&amp;gt;
{
    public static void InitializeService(IDataServiceConfiguration config)
    {
        config.SetEntitySetAccessRule("*", EntitySetRights.AllRead);
    }    
}&lt;/pre&gt;
&lt;p&gt;Burada dikkat edilmesi gereken noktalardan birisi &lt;strong&gt;ProductService&lt;/strong&gt; sınıfının &lt;strong&gt;System.Data.Services&lt;/strong&gt; isim alanında&lt;strong&gt;(Namesapce) &lt;/strong&gt;yer alan &lt;strong&gt;DataService&amp;lt;T&amp;gt; generic&lt;/strong&gt; sınıfından t&amp;uuml;remiş olmasıdır. Bunun dışından şu an i&amp;ccedil;in &amp;ouml;nem arz eden nokta &lt;strong&gt;static&lt;/strong&gt; &lt;strong&gt;InitializeService&lt;/strong&gt; metodudur. Bu metod, servis &amp;ouml;rneği ilk oluşturulduğunda bir kereliğine devreye girer. &lt;strong&gt;config&lt;/strong&gt; değişkeni &amp;uuml;zerinden yapılan &amp;ccedil;ağrı ise &amp;ouml;nemlidir. &lt;strong&gt; SetEntitySetAccessRule&lt;/strong&gt; metoduna g&amp;ouml;nderilen ilk parametrede &lt;strong&gt;* &lt;/strong&gt; semb&amp;ouml;l&amp;uuml; kullanılarak, &lt;strong&gt;Entity&lt;/strong&gt; set i&amp;ccedil;erisindeki t&amp;uuml;m tiplerin ele alınacağı belirtilmektedir. İkinci parametre ise &lt;strong&gt;EntitySetRights&lt;/strong&gt; enum sabiti tipinden olup aşağıdaki değerleri alabilir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_12.gif" alt="" width="423" height="253" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Burada &lt;strong&gt;AllRead&lt;/strong&gt;' in anlamı t&amp;uuml;m &lt;strong&gt; Entity&lt;/strong&gt; nesneleri &amp;uuml;zerinde her &amp;ccedil;eşit &lt;strong&gt;veri okuma(Read)&lt;/strong&gt; işleminin yapılabileceğidir. Bir başka deyişle &lt;strong&gt;EntitySetRights&lt;/strong&gt; &lt;strong&gt; enum&lt;/strong&gt; sabitinin değerleri ile, hangi &lt;strong&gt;Entity&lt;/strong&gt; objelerine hangi haklarla erişebileceği belirtilmektedir. S&amp;ouml;z gelimi aşağıdaki kod &amp;ouml;rneğini ele alalım.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;config.SetEntitySetAccessRule("Product", EntitySetRights.AllRead);
config.SetEntitySetAccessRule("ProductSubcategory", EntitySetRights.AllWrite);&lt;/pre&gt;
&lt;p&gt;Bu ifadelere g&amp;ouml;re &lt;strong&gt;Product&lt;/strong&gt; nesneleri i&amp;ccedil;in sadece okuma işlemi yapılabilirken, &lt;strong&gt;ProductSubcategory&lt;/strong&gt; nesneleri i&amp;ccedil;inde sadece yazma işlemleri yapılabilmektedir. Artık herhangibir istemci yazmadan, &lt;strong&gt;ProductService.svc&lt;/strong&gt; servisi test edilebilir. Nitekim hepimizin iştahının kabarmış olduğunu ve bir an &amp;ouml;nce sonu&amp;ccedil;ları g&amp;ouml;rmek istediğinizi hissetmekteyim. &amp;Ouml;yleyse gelin &lt;strong&gt;F5&lt;/strong&gt; ile projemizi &amp;ccedil;alıştıralım. Uygulama ilk &amp;ccedil;alıştırıldığında &lt;strong&gt; ProductService.svc&lt;/strong&gt; dosyası tarayıcı pencere i&amp;ccedil;erisinde aşağıdaki gibi g&amp;ouml;r&amp;uuml;necektir.&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_14.gif" alt="" width="637" height="342" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Buradan &amp;ccedil;ıkartılması gereken ilk sonu&amp;ccedil; &lt;strong&gt; Product&lt;/strong&gt; ve &lt;strong&gt;ProductSubcategory&lt;/strong&gt; elementleri i&amp;ccedil;in taleplerde bulunulabileceğidir. &amp;Ouml;yleyse test sorgularına başlanabilir. Sorgulardan kastımız elbetteki &lt;strong&gt;URL&lt;/strong&gt; satırına girilen &lt;strong&gt;QueryString&lt;/strong&gt; ifadeleri ve bunların &lt;strong&gt;ATOM&lt;/strong&gt; tabanlı &lt;strong&gt;XML&lt;/strong&gt; &amp;ccedil;ıktılarının nasıl olacağıdır.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;table style="border-collapse: collapse; width: 100%;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt; &lt;span style="font-family: Verdana;"&gt;&amp;Ouml;rnek 1 ; &lt;br /&gt; T&amp;uuml;m ProductSubcategory satırlarının elde edilmesi&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;URL Satırı ifadesi : &lt;strong&gt;&lt;br /&gt; http://localhost:3030/AdventureServices/ProductService.svc/ProductSubcategory&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;em&gt;&lt;span style="font-family: Verdana;"&gt;(Burada hemen bir hatırlatma yapalım. Eğer &lt;strong&gt;URL&lt;/strong&gt; satırında &lt;strong&gt;ProductSubcategory&lt;/strong&gt; yerine &lt;strong&gt; ProductSubCategory&lt;/strong&gt; yazılırsa &lt;strong&gt;Case-Sensitive&lt;/strong&gt; &amp;ouml;zelliğinden dolayı &lt;strong&gt;HTTP 404 Not Found&lt;/strong&gt; &amp;ccedil;ıktısı alınır. Dolayısıyla &lt;strong&gt; QueryString&lt;/strong&gt;' leri yazarken &lt;strong&gt;Case-Sensitive&lt;/strong&gt; olmalarına dikkat etmek gerekir.)&lt;/span&gt;&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Sonu&amp;ccedil; Ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_15.gif" alt="" width="637" height="600" border="0" /&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt; &lt;span style="font-family: Verdana;"&gt;&amp;Ouml;rnek 2 : 3 Numaralı ProductSubcategory bilgisinin elde edilmesi&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;URL Satırı ifadesi : &lt;strong&gt;&lt;br /&gt; http://localhost:3030/AdventureServices/ProductService.svc/ProductSubcategory(3)&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Sonu&amp;ccedil; Ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_16.gif" alt="" width="618" height="460" border="0" /&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Not : İkinci &amp;ouml;rnekte dikkat edilmesi gereken bir nokta vardır. URL satırında parantez i&amp;ccedil;erisinde 3 değeri yazılarak &lt;strong&gt;ProductSubCategoryID&lt;/strong&gt; değeri 3 olan alt kategori bilgisi elde edilmiştir. Pekiya servis tarafından nasıl olmaktadırda, parantez i&amp;ccedil;erisindeki değerin ProductSubCategoryID alanına işaret ettiği bilinmektedir. Burada anahtar nokta &lt;strong&gt;ProductSubcategory&lt;/strong&gt; sınıfındaki ProductSubCategoryID &amp;ouml;zelliğidir.&lt;/span&gt;&lt;/span&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_17.gif" alt="" width="620" height="292" border="0" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Şekildende g&amp;ouml;r&amp;uuml;leceği &amp;uuml;zere &lt;strong&gt; EdmScalarPropertyAttribute&lt;/strong&gt; niteliğinin i&amp;ccedil;erisinde &lt;strong&gt; EntityKeyProperty&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;true&lt;/strong&gt; değeri verilmiştir. B&amp;ouml;ylece &amp;ccedil;alışma zamanı, parantez i&amp;ccedil;erisinde gelen ifadenin bu &amp;ouml;zelliğe ait olduğunu bilmektedir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt; &lt;span style="font-family: Verdana;"&gt;&amp;Ouml;rnek 3 : Product tablosundan ListPrice değeri 3500 birim &amp;uuml;zerinde olanların elde edilmesi&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;URL Satırı ifadesi :&lt;strong&gt;&lt;br /&gt; http://localhost:3030/AdventureServices/ProductService.svc/Product?$filter=ListPrice gt 3500&lt;br /&gt; (Burada gt=grater then anlamındadır.Buna g&amp;ouml;re k&amp;uuml;&amp;ccedil;&amp;uuml;kt&amp;uuml;r i&amp;ccedil;in lt=less then)&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Sonu&amp;ccedil; Ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_18.gif" alt="" width="613" height="644" border="0" /&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt; &lt;span style="font-family: Verdana;"&gt;&amp;Ouml;rnek 4 : ProductSubcategoryID değeri 1 olan alt kategoriye bağlı &amp;uuml;r&amp;uuml;nlerin listesinin elde edilmesi&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;URL Satırı ifadesi :&lt;strong&gt;&lt;br /&gt; http://localhost:3030/AdventureServices/ProductService.svc/ProductSubcategory(1)/Product&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Sonu&amp;ccedil; Ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_19.gif" alt="" width="613" height="613" border="0" /&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt; &lt;span style="font-family: Verdana;"&gt;&amp;Ouml;rnek 5 : Product tablosundan ListPrice değeri 3500 birim &amp;uuml;zerinde olanların isimlerine g&amp;ouml;re ters sırada elde edilmesi&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;URL Satırı ifadesi :&lt;strong&gt;&lt;br /&gt; http://localhost:3030/AdventureServices/ProductService.svc/Product?$filter=ListPrice gt 3500&amp;amp;$orderby Name desc&lt;br /&gt; (İki ayrı sorgu ifadesi birleştirilirken &amp;amp; kullanılır)&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Sonu&amp;ccedil; Ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_20.gif" alt="" width="615" height="631" border="0" /&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="background-color: #ffffff;" bgcolor="#336699"&gt;&lt;span style="font-size: small;"&gt;&lt;strong&gt; &lt;span style="font-family: Verdana;"&gt;&amp;Ouml;rnek 6 : ProductSubCategoryID değeri 4 olan alt kategorinin bilgilerinin elde edilmesi ve buna bağlı &amp;uuml;r&amp;uuml;nlerinde getirilmesi&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;URL Satırı ifadesi :&lt;strong&gt;&lt;br /&gt; http://localhost:3030/AdventureServices/ProductService.svc/ProductSubcategory(4)?$expand=Product&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Sonu&amp;ccedil; Ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; ;&lt;/span&gt;&lt;/span&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Dikkat edileceği &amp;uuml;zere inline elementi altında 4 numaralı alt kategoriyi bağlı Product &amp;ouml;rneklerinin entry boğumları yer almaktadır. Service tarafı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında expand komutunun kullanılabilmesini sağlayan &amp;uuml;yenin ProductSubcategory sınıfındaki Product &amp;ouml;zelliği olduğuna dikkat etmek gerekir.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&lt;span style="font-size: small;"&gt;&lt;img src="/makale/images/mk258_21.gif" alt="" width="624" height="637" border="0" /&gt;&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;Buraya kadar anlatıklarımız umarım sizlere &lt;strong&gt;Ado.Net Data Services&lt;/strong&gt; hakkında biraz fikir verebilmiştir. Eğer buraya kadar makaleyi zevkle okuduysanız işte size yapmanız gereken bir ka&amp;ccedil; &amp;ouml;dev. &amp;Ouml;ncelikli olarak tarayıcı uygulama &amp;uuml;zerinden sorgu g&amp;ouml;nderdiğinizde &lt;strong&gt;SQL&lt;/strong&gt; tarafında nasıl komutlar &amp;ccedil;alıştırıldığına bakmanızı &amp;ouml;neririm. Kod tarafında ilgili noktalara &lt;strong&gt;breakpoint&lt;/strong&gt;' ler ekleyerek nesnelerin ne zaman &amp;ouml;rneklendiklerine&lt;em&gt;(REST sorgusu SQL sorgusuna d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmeden &amp;ouml;ncemi, sonra mı gibi)&lt;/em&gt; bakmanızı &amp;ouml;neririm. Başka ne &amp;ccedil;eşit sorgular yazabileceğinizi &lt;strong&gt;filter, orderby, expand, () &lt;/strong&gt;dışında ne gibi &lt;strong&gt;query&lt;/strong&gt; komutları olabileceğini araştırın. Bu araştırmalarıda başarı ile yaparsanız ş&amp;ouml;yle g&amp;uuml;zel bir s&amp;uuml;tl&amp;uuml; nescafe' yi deniz kenarında yudumlamayı hak etmişsiniz demektir, &amp;uuml;stelik g&amp;uuml;neş batarken.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalemizde kısaca &lt;strong&gt;Ado.Net Data Services(Astoria) &lt;/strong&gt; konusuna değinmeye &amp;ccedil;alıştık. &amp;Ouml;zet olarak, &lt;strong&gt;ADO.Net EDM(Entity Data Model)&lt;/strong&gt; veya &lt;strong&gt;LINQ Provider&lt;/strong&gt; se&amp;ccedil;eneklerini kullanaraktan, verilerin &lt;strong&gt;REST(REpresentational State Transfer)&lt;/strong&gt; modele uygun bir servis &amp;uuml;zerinden yayınlanabileceğini g&amp;ouml;rd&amp;uuml;k. Bu makalemizde herhangibir istemci uygulama geliştirmemiş olmamıza rağmen, sonu&amp;ccedil;ları değerlendirmek adına bir tarayıcı uygulama kullandığımızı unutmayalım. Nitekim tarayıcı uygulamalarda hangi &amp;ccedil;eşitten olurlarsa olsunlar potansiyel olarak birer servis istemcisidir. Elbette ilerleyen makalelerimizde istemci uygulamaların nasıl geliştirilebileceğine de değinebileceğimizi belirtmek isterim. &lt;strong&gt;Ado.Net Data Services&lt;/strong&gt; ile ilişkili blog bilgilerine Microsoft' un &lt;a href="http://blogs.msdn.com/astoriateam/"&gt;&lt;strong&gt;şu&lt;/strong&gt;&lt;/a&gt; adresinden ulaşabilirsiniz. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-size: small;"&gt;&lt;span style="font-family: Verdana;"&gt;&lt;a href="/makale/images/AstoriaHelloWorld.rar"&gt; &amp;Ouml;rneği indirmek i&amp;ccedil;in tıklayın&lt;/a&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;</content>
  <pubDate>2008-09-22 12:00:00</pubDate>
  <slug>Ado-Net-Data-Services-Ders-Notlari-1-(Merhaba)-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>adonet-data-services</tag>
    <tag>wcf-data-services</tag>
  </tags>
  <categories>
    <category>Ado.Net Data Services</category>
  </categories>
</post>