<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Screencast - Workflow Service Geliştirmek [Beta 2]</title>
  <description>WCF(Windows Communication Foundation) ve WF(Workflow Foundation) modellerinin bir arada kullanıldığı Workflow Service' lerin sunduğu kolaylıklardan birisi de, iş akışlarının servis bazlı olarak sunulabilmesi imkanıdır. Bir Workflow örneğinin çalışma ortamı içerisinde Persistence hizmetlerinden, transaction yönetiminden vb... yararlanması ve Long Running Process' lerin ele alınması sağlanabilir. Üstelik buna Visual Studio 2010 gibi geliştirme ortamlarında yer alan WPF designer desteğininde eklenmesi ve XAML bazlı olarak geliştirme yapılması da çok önemlidir. Bir Workflow Service ise, az önce bahsedilen fonksiyonellikleri taşıyan bir akışın servis bazlı olarak sunulabilmesine olanak tanımaktadır. Böylece, pek çok sistemin ortaklaşa kullandığı akışların servis bazlı olarak sunulabilmesi mümkün hale gelebilmektedir. Gerçek hayat senaryolarında Workflow Service' lerin değerlendirilebileceği pek çok alan bulunmaktadır. Ama öncesinde basit ve pekte işe yaramayacak bir Hello World örneği geliştirmekte yarar vardır.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF(Windows Communication Foundation)&amp;nbsp;&lt;/strong&gt;ve &lt;strong&gt;WF(Workflow Foundation)&lt;/strong&gt;&amp;nbsp;modellerinin bir arada kullanıldığı &lt;strong&gt;Workflow Service' &lt;/strong&gt;lerin sunduğu kolaylıklardan birisi de, iş akışlarının servis bazlı olarak sunulabilmesi imkanıdır. Bir Workflow &amp;ouml;rneğinin&amp;nbsp;&amp;ccedil;alışma ortamı i&amp;ccedil;erisinde &lt;strong&gt;Persistence &lt;/strong&gt;hizmetlerinden, &lt;strong&gt;transaction &lt;/strong&gt;y&amp;ouml;netiminden vb... yararlanması ve&lt;strong&gt; Long Running Process'&lt;/strong&gt; lerin ele alınması sağlanabilir. &amp;Uuml;stelik buna &lt;strong&gt;Visual Studio 2010 &lt;/strong&gt;gibi geliştirme ortamlarında yer alan &lt;strong&gt;WPF designer &lt;/strong&gt;desteğininde eklenmesi ve &lt;strong&gt;XAML &lt;/strong&gt;bazlı olarak geliştirme yapılması da &amp;ccedil;ok &amp;ouml;nemlidir. Bir &lt;strong&gt;Workflow Service &lt;/strong&gt;ise, az &amp;ouml;nce bahsedilen fonksiyonellikleri taşıyan bir akışın servis bazlı olarak sunulabilmesine olanak tanımaktadır. B&amp;ouml;ylece, pek &amp;ccedil;ok sistemin ortaklaşa kullandığı akışların servis bazlı olarak sunulabilmesi m&amp;uuml;mk&amp;uuml;n hale gelebilmektedir. Ger&amp;ccedil;ek hayat senaryolarında &lt;strong&gt;Workflow Service' &lt;/strong&gt;lerin değerlendirilebileceği pek &amp;ccedil;ok alan bulunmaktadır. Ama &amp;ouml;ncesinde basit ve pekte işe yaramayacak bir &lt;strong&gt;Hello World &lt;/strong&gt;&amp;ouml;rneği geliştirmekte yarar vardır.&amp;nbsp; &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;iframe src="https://www.youtube.com/embed/4LmoqaXw25U" width="560" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;Yeni g&amp;ouml;rsel derslerde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2009-10-24 07:51:00</pubDate>
  <slug>Screencast-Workflow-Service-Gelistirmek</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-40</tag>
    <tag>screencast</tag>
  </tags>
  <categories>
    <category>WF 4.0 Beta 2</category>
  </categories>
</post>