<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF–Concurrency</title>
  <description>Windows Communication Foundation içerisinde önem arz eden konuların başında, istemciden gelen taleplerin eş zamanlı olarak değerlendirilme stratejilerine karar verilmesi de gelir. Aslında bir servis davranış biçimi olan ve Single, Multiple, Reentrant olmak üzere 3 farklı modda uygulanabilen Concurrency, tek başına değil, Instance Context Mode ile birlikte düşünülmelidir. Servislerin PerCall, PerSession ve Single gibi modlarda örneklenebildikleri düşünüldüğünde ortaya, 9 farklı kombinasyon çıkmaktadır. İşte bu görsel dersimizde WCF Concurrency konusuna değiniyor ve örnek bir uygulama üzerinden Instance Context Mode ile olan kullanımını kavramaya çalışıyoruz.

Gribal sorunlar nedeniyle zaman zaman konuşmakta zorlandığım ve sık sık öksürmek zorunda kaldığım görsel dersimizi Nedirtv Youtube kanalından da izleyebilirsiniz.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Windows Communication Foundation&lt;/strong&gt; i&amp;ccedil;erisinde &amp;ouml;nem arz eden konuların başında, istemciden gelen taleplerin eş zamanlı olarak değerlendirilme stratejilerine karar verilmesi de gelir. Aslında bir servis davranış bi&amp;ccedil;imi olan ve &lt;strong&gt;Single&lt;/strong&gt;,&lt;strong&gt; Multiple&lt;/strong&gt;, &lt;strong&gt;Reentrant&lt;/strong&gt; olmak &amp;uuml;zere 3 farklı modda uygulanabilen &lt;strong&gt;Concurrency&lt;/strong&gt;, tek başına değil, &lt;strong&gt;Instance Context Mode &lt;/strong&gt;ile birlikte d&amp;uuml;ş&amp;uuml;n&amp;uuml;lmelidir. Servislerin &lt;strong&gt;PerCall&lt;/strong&gt;, &lt;strong&gt;PerSession&lt;/strong&gt; &lt;strong&gt;ve&lt;/strong&gt; Single gibi modlarda &amp;ouml;rneklenebildikleri d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde ortaya, 9 farklı kombinasyon &amp;ccedil;ıkmaktadır. İşte bu g&amp;ouml;rsel dersimizde &lt;strong&gt;WCF Concurrency&lt;/strong&gt; konusuna değiniyor ve &amp;ouml;rnek bir uygulama &amp;uuml;zerinden &lt;strong&gt;Instance&lt;/strong&gt; &lt;strong&gt;Context&lt;/strong&gt; &lt;strong&gt;Mode&lt;/strong&gt; ile olan kullanımını kavramaya &amp;ccedil;alışıyoruz.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Gribal sorunlar nedeniyle zaman zaman konuşmakta zorlandığım ve sık sık &amp;ouml;ks&amp;uuml;rmek zorunda kaldığım g&amp;ouml;rsel dersimizi Nedirtv Youtube kanalından da izleyebilirsiniz.&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;iframe src="https://www.youtube.com/embed/1epxQJqc6Ao" width="560" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;Bir başka g&amp;ouml;rsel dersimizde g&amp;ouml;r&amp;uuml;şmek dileğiyle &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="http://www.buraksenyurt.com/pics/wlEmoticon-winkingsmile_200.png" alt="Winking smile" /&gt;&lt;/p&gt;</content>
  <pubDate>2013-04-10 10:41:00</pubDate>
  <slug>WCFe28093Concurrency</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
    <tag>instance-context-mode</tag>
    <tag>concurrency</tag>
    <tag>wcf-concurrency</tag>
    <tag>multi-thread</tag>
    <tag>service</tag>
    <tag>service-behavior</tag>
    <tag>per-call</tag>
    <tag>per-session</tag>
    <tag>single</tag>
    <tag>concurrencymode</tag>
    <tag>instancecontextmode</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>