<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ubuntu'da İlk .Net Core Adımlarım</title>
  <description>Bu yazımızda Ubuntu sistemi üzerine .Net Core 2.0 yükleyip basit bir Console uygulaması yazarak Linux üzerinde Hello World demeye çalışacağız.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2017/11/coubuntu_1.gif" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&amp;Uuml;niversite yıllarımda internet yeni yeni yaygınlaşmaya başlayan bir ortamdı. 14400 kpbs hızındaki modemimi daha 3nc&amp;uuml; sınıfta alabilmiştim. Bu sebepten okulun ilk yıllarında bilgisayar teknolojileri ile ilgili bilgileri &amp;ouml;ğrenebileceğim en g&amp;uuml;zel mecra aylık dergilerdi. Bazıları zaman i&amp;ccedil;erisinde kapandı bazılarıysa internet &amp;uuml;zerinden yayınlanmaya başladı. Ben ağırlıklı olarak PcWorld, PcNet, PcMagazine gibi dergileri okuduğumu hatta ay ay biriktirdiğimi hatırlıyorum.&lt;/p&gt;
&lt;p&gt;Byte severek takip ettiğim dergilerden birisiydi. &amp;Ouml;zellikle de Jerry Pournelle'in k&amp;ouml;şesi. Her ay farklı şeylerle uğraşır, yaptığı denemelerin sonu&amp;ccedil;ları paylaşır, bilim kurgu &amp;uuml;zerine konuşur, kitap &amp;ouml;nerilerinde bulunurdu. Yeni yazılımları dener ve deneyimlerini aktarırdı. The New York Times &lt;a href="https://www.nytimes.com/2017/09/15/obituaries/jerry-pournelle-science-fiction-novelist-and-computer-guide-dies-at-84.html" target="_blank"&gt;ilgili yazısında&lt;/a&gt; onu bilim kurgu yazarı ve bilgisayar rehberi olarak tanımlamıştır. Araştırmayı ve bu araştırmaları sırasında &amp;ouml;ğrendiklerini paylaşan değerli bir bilim insanıydı benim i&amp;ccedil;in.&lt;/p&gt;
&lt;p&gt;Ne yazık ki 8 Eyl&amp;uuml;l 2017 tarihinde aramızdan ayrılmış.&amp;nbsp;Benim de bir şeyleri araştırıp bu araştırmalarla ilgili notlar almama vesile olan ve kendime g&amp;ouml;re bir gelişim metodolojisini alışkanlık haline getirmemi sağlayan insanlardan birisiydi.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Bu d&amp;uuml;ş&amp;uuml;nceler eşlinde hafta sonu işlerime başladım. Evdeki yaklaşık 6 yıllık Dell marka diz&amp;uuml;st&amp;uuml; bilgisayarımda uzun s&amp;uuml;redir&amp;nbsp;iki işletim sistemi kullanıyordum. Ubuntu ve Windows 7. Bir s&amp;uuml;redir de Ubuntu &amp;uuml;zerinde Docker kullanarak .Net Core 2.0 uygulamaları geliştirmeyi planlıyordum. Ancak bir t&amp;uuml;rl&amp;uuml; Community Edition s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; y&amp;uuml;kleyemedim. Sebep Linux'&amp;uuml;n 64bit olmamasıydı. Windows 7 &amp;uuml;zerinde Docker kullanabilirdim ama amacım Cross Platform deneyimini .Net Core i&amp;ccedil;in Linux &amp;uuml;zerinde yaşamaktı. &amp;Ouml;yleyse ilk etapta işi Docker olmadan halledeyim dedim. Yine de 64bit bir Ubuntu bana gerekliydi. Sonunda kararımı verdim ve diz&amp;uuml;st&amp;uuml;n&amp;uuml; sıfırlayarak &amp;uuml;zerine sadece Ubuntu 64bit işletim sistemini kurdum&lt;em&gt;(&lt;a href="https://www.ubuntu.com/download/desktop/contribute?version=17.10&amp;amp;architecture=amd64" target="_blank"&gt;Şu adresteki&lt;/a&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml; kullandım)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Docker deneyimlerine ge&amp;ccedil;meden &amp;ouml;nce .Net Core 2.0 ile Ubuntu'da bir Hello World demeye karar verdim. Amacım bir Linux platformu &amp;uuml;zerine .Net Core 2.0 SDK'yi y&amp;uuml;klemek ve C# ile yazılmış bir Console uygulamasını kullanarak yeni bir ufka merhaba demekti. Benim i&amp;ccedil;in &amp;ouml;nemli bir başlangı&amp;ccedil; noktası. Nitekim &amp;ouml;n&amp;uuml;m&amp;uuml;zdeki sene i&amp;ccedil;erisinde işten arta kalan zamanlarda Linux &amp;uuml;zerinde .Net Core 2.0 ile bir şeyler yapmaya gayret edeceğim.&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;.Net Core'un Kurulumu&lt;/h1&gt;
&lt;p&gt;Terminal penceresini ve Microsoft'un konu ile ilgili dok&amp;uuml;mantasyonunu a&amp;ccedil;tıktan sonra kurulum adımlarını takip etmeye başladım. Okuduğum kadarıyla &amp;ouml;ncelikli olarak Microsoft Product Feed listesine kayıt olmak gerekiyor. Bunu iki adımda ger&amp;ccedil;ekleştiriyoruz. &amp;Ouml;nce g&amp;uuml;venli bir&amp;nbsp;anahtar sonrasında da kayıt. Sadece bir kere yapmamız yeterli. Kayıt işlemini ger&amp;ccedil;ekleştirirken kullandığımız Ubuntu s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; de dikkate almalıyız. Ben Ubuntu 16.04 Linux Mint versiyonunu y&amp;uuml;klediğim&amp;nbsp;i&amp;ccedil;in buna uygun bir bildirim yaptım&lt;em&gt;(Xenial ifadesinin kullanılmas sebebi)&lt;/em&gt;&amp;nbsp;Bu arada curl komutunun genellikle internetten i&amp;ccedil;erik indirmek i&amp;ccedil;in kullanıldığını &amp;ouml;ğrendim&lt;em&gt;(Linux tarafında &amp;ccedil;ok acemiyim biliyorsunuz ki)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;curl https://packages.microsoft.com/keys/microsoft.asc | gpg --dearmor &amp;gt; microsoft.gpg

sudo mv microsoft.gpg /etc/apt/trusted.gpg.d/microsoft.gpg

sudo sh -c 'echo "deb [arch=amd64] https://packages.microsoft.com/repos/microsoft-ubuntu-xenial-prod xenial main" &amp;gt; /etc/apt/sources.list.d/dotnetdev.list'&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/11/cobuntu_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sorunsuz ge&amp;ccedil;en bu s&amp;uuml;recin ardından sistemi g&amp;uuml;ncelleyip .Net Core 2.0 s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; indirmeye başladım. Tabii alışılageldiği &amp;uuml;zere &amp;ouml;nce bir g&amp;uuml;ncelleme yapmakta ve eksik paketlerin y&amp;uuml;klenmesini sağlamakta yarar var.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo apt-get update

sudo apt-get install dotnet-sdk-2.0.0&lt;/pre&gt;
&lt;p&gt;Eğer bir probem yoksa&amp;nbsp;terminalden dotnet komutunu kullanarak versiyon numarasını ve g&amp;uuml;ncel s&amp;uuml;r&amp;uuml;m bilgilerini aşağıdaki gibi g&amp;ouml;rebilmemiz gerekiyor.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet --version

dotnet --info&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/11/cobuntu_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;h1&gt;Console Uygulamasının Oluşturulması&lt;/h1&gt;
&lt;p&gt;Bildiğiniz gibi dotnet new komutu ile &amp;ouml;nceden tanımlı şablonlardan yararlanarak projelerimizi oluşturabiliyoruz&lt;em&gt;(Neler oluşturabileceğimizi g&amp;ouml;rmek i&amp;ccedil;in dotnet new --help ifadesinden yararlanabilirsiniz)&lt;/em&gt; Benim ilk hedefim terminal pencersinde basit bir şeyler yazdırıp Hello World diyebilmek. Bu sebepten oluşturduğum Development klas&amp;ouml;r&amp;uuml; &amp;uuml;zerinde aşağıdaki&amp;nbsp;ifadeyi kullanarak HelloWorld isimli bir Console projesi oluşturdum.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new console -o HelloWorld&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/11/cobuntu_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Oluşan Program.cs i&amp;ccedil;eriğini biraz değiştirdim ve Algebra.cs isimli bir sınıfı da klas&amp;ouml;re dahil ettim.&lt;/p&gt;
&lt;p&gt;Algebra.cs i&amp;ccedil;eriği;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace Utility
{
    public class Algebra
    {
        public double Sum(double x,double y)
        {
            return x+y;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Program.cs i&amp;ccedil;eriği;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using Utility;

namespace HelloWorld
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Merhaba");
            double x=1.23;
            double y=Math.PI;
            Algebra einstein=new Algebra();
            Console.WriteLine("{0}+{1}={2}",x,y,einstein.Sum(x,y));
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Tahmin edeceğiniz &amp;uuml;zere iki double sayının toplamını hesap eden Sum fonksiyonunu i&amp;ccedil;eren Algebra isimli sınıfın basit bir kullanımı s&amp;ouml;z konusu. Projeyi derleyip &amp;ccedil;alıştırmak i&amp;ccedil;inse build ve run parametrelerinden yararlanıyoruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet build

dotnet run&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/11/runtime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Belki de pek &amp;ccedil;oğunuz i&amp;ccedil;in etkileyici bir sonu&amp;ccedil; değil ama benim olduk&amp;ccedil;a hoşuma gitti. Vakti zamanında sadece Windows platformunda .Net ile kod yazabildiğimi d&amp;uuml;ş&amp;uuml;n&amp;uuml;nce, kurduğum Linux makinede bu ortamı kullanarak C# ile kod geliştirebilmek harika bir deneyim.&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;Visual Studio Code Kurulumu&lt;/h1&gt;
&lt;p&gt;Bu arada kodları nasıl d&amp;uuml;zenlediğimi merak etmiş de olabilirsiniz. Tahmin edeceğiniz gibi Visual Studio Code'u kullandım. Bu uygulamayı da terminalden aşağıdaki komutları kullanarak y&amp;uuml;kleyebilirsiniz. Y&amp;uuml;kleme işleminden sonra HelloWorld uygulamasını a&amp;ccedil;tığımızda C# i&amp;ccedil;in gerekli Extension'da &amp;ouml;neri olarak sunulacaktır.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo sh -c 'echo "deb [arch=amd64] https://packages.microsoft.com/repos/vscode stable main" &amp;gt; /etc/apt/sources.list.d/vscode.list'

sudo apt-get update

sudo apt-get install code&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2017/11/cobuntu_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Eğer komut satırından kurulum zor geliyorsa basit kurulum i&amp;ccedil;in &lt;a href="https://code.visualstudio.com/Download?wt.mc_id=DotNet_Home&amp;amp;dotnetid=572034740.1488954905" target="_blank"&gt;şu adresten de&lt;/a&gt; yararlanabilirsiniz.&lt;/p&gt;
&lt;h1&gt;Şimdi Ne Olacak?&lt;/h1&gt;
&lt;p&gt;Artık emektar diz&amp;uuml;st&amp;uuml; bilgisayarımda Ubuntu 64bit s&amp;uuml;r&amp;uuml;m&amp;uuml; y&amp;uuml;kl&amp;uuml;. Tertemiz bir ortamım var. Bu ortamda şu an i&amp;ccedil;in .Net Core 2.0 ve Visual Studio Code bulunuyor. Ama yapmam gereken başka işler var. GitHub ile entegre olmalıyım. Diğer yandan Docker kurulumunu ger&amp;ccedil;ekleştirip bir .Net Core 2.0 imajı &amp;uuml;zerinde &amp;ccedil;alışmalar yapmalıyım. Ayrıca GoLang, Ruby ve Python i&amp;ccedil;in de ortamı hazırlamalıyım. Bu arada Linux terminal i&amp;ccedil;in biraz komut &amp;ccedil;alışsam hi&amp;ccedil; de fena olmaz. Python tarafında sudo, apt-get gibi ifadelere aşina olsam da curl gibi yeni karşılaştığım komutların farkında olmalıyım.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi evinizdeki bilgisayarımıza Linux kurup &amp;uuml;zerinde .Net Core 2.0 ile Hello World dememiz olduk&amp;ccedil;a basit. Daha kolayı sanıyorum ki Docker Container kullanımı. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2017-11-05 10:17:00</pubDate>
  <slug>ubuntu-da-ilk-net-core-adimlarim</slug>
  <tags>
    <tag>net-core-20</tag>
    <tag>ubuntu</tag>
    <tag>linux</tag>
    <tag>net-on-linux</tag>
    <tag>hello-world</tag>
    <tag>console-application</tag>
    <tag>jerry-pournelle</tag>
    <tag>net-core</tag>
    <tag>microsoft</tag>
    <tag>curl</tag>
    <tag>visual-studio-code</tag>
    <tag>cross-platform-development</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
  </categories>
</post>