<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ado.Net ile Sql Server Full-Text Searching (Tüm Metinde Arama) Kullanımı</title>
  <description>Bu makalemizde, Sql sunucu üzerindeki tablolarda text tabanlı arama işlemlerinin, Full-Text Searching (Tüm Metinde Arama) servisi yardımıyla nasıl gerçekleştirildiğini incelemeye çalışacağız. Konunun pekişmesi açısından basit bir web uygulması ile de bu hizmeti kullanıp text tabanlı arama işlemlerini irdelemeye çalışacağız. Özellikle dikkatinizi çekmiştir ki, internette yer alan pek çok arama motoru aradığımız kelimelerin geçtiği web sayfalarını bulup bize getirir. Çoğunlukla arama motoruna kayıtlı web sayfasının içeriğinde yapılan text tabanlı aramalar da Full-Text Searching (Tüm Metinde Arama) hizmetinden faydalanılır. Bu tip bir arama genellikle alanları içerisinde çok geniş text tabanlı içeriğe sahip olan tablolar üzerinde yapılmaktadır. Sql sunucusu, 7.0 versiyonundan itibaren bu hizmeti vermeye başlamıştır. Elbetteki arama işleminin gerçekleştirilebilmesi için Full-Text Searching (Tüm Metinde Arama) servisinin Sql sunucusunda yüklü olması gerekmektedir.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, Sql sunucu &amp;uuml;zerindeki tablolarda text tabanlı arama işlemlerinin, Full-Text Searching (T&amp;uuml;m Metinde Arama) servisi yardımıyla nasıl ger&amp;ccedil;ekleştirildiğini incelemeye &amp;ccedil;alışacağız. Konunun pekişmesi a&amp;ccedil;ısından basit bir web uygulması ile de bu hizmeti kullanıp text tabanlı arama işlemlerini irdelemeye &amp;ccedil;alışacağız. &amp;Ouml;zellikle dikkatinizi &amp;ccedil;ekmiştir ki, internette yer alan pek &amp;ccedil;ok arama motoru aradığımız kelimelerin ge&amp;ccedil;tiği web sayfalarını bulup bize getirir. &amp;Ccedil;oğunlukla arama motoruna kayıtlı web sayfasının i&amp;ccedil;eriğinde yapılan text tabanlı aramalar da Full-Text Searching (T&amp;uuml;m Metinde Arama) hizmetinden faydalanılır. Bu tip bir arama genellikle alanları i&amp;ccedil;erisinde &amp;ccedil;ok geniş text tabanlı i&amp;ccedil;eriğe sahip olan tablolar &amp;uuml;zerinde yapılmaktadır. Sql sunucusu, 7.0 versiyonundan itibaren bu hizmeti vermeye başlamıştır. Elbetteki arama işleminin ger&amp;ccedil;ekleştirilebilmesi i&amp;ccedil;in Full-Text Searching (T&amp;uuml;m Metinde Arama) servisinin Sql sunucusunda y&amp;uuml;kl&amp;uuml; olması gerekmektedir.&lt;/p&gt;
&lt;p&gt;Dilerseniz hi&amp;ccedil; vakit kaybetmeden bir tablo i&amp;ccedil;in Full-Text Index' in nasıl oluşturulacağına kısaca bakalım. &amp;Ouml;ncelikle, Full-Text Indeksleme yapacağımız tablonun adına enterprise manager' dan sağ tıklayoruz ve aşağıdaki gibi &lt;strong&gt;Define Full-Text Indexing On a Table&lt;/strong&gt;' ı se&amp;ccedil;iyoruz. Bu işleme başlamadan &amp;ouml;nce tablomuzda bir primary key alan olması gerektiğinide belirtelim. Nitekim indeksleme işlemlerinde bu alan, sonu&amp;ccedil;ların d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesinde anahtar alan olarak kullanılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk110_1.gif" alt="" width="475" height="503" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından karşımıza &amp;ccedil;ıkan sihirbazdaki adımları birer birer işlemeye başlıyoruz. Az &amp;ouml;ncede belirttiğim gibi bu ilk olarak tablomuzdaki primary alan i&amp;ccedil;in bir index se&amp;ccedil;iliyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk110_2.gif" alt="" width="498" height="391" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından, hangi kolonlarda arama yapılacağını belirtiyoruz. Full-Text aramalar &amp;ccedil;oğunlukla uzun text verilerin tutulduğu alanlarda kullanılır. &amp;Ouml;rneğin tablomuzdaki Icerik alanı makalelere ait Html i&amp;ccedil;eriği barındırdan ntext veri tipindedir. Burada sadece karakter i&amp;ccedil;erikli veya binary i&amp;ccedil;erikli aramalara m&amp;uuml;sade eden alanların g&amp;ouml;r&amp;uuml;nd&amp;uuml;ğ&amp;uuml;n&amp;uuml; s&amp;ouml;yleyelim. Yani primary key olan alanlar veya tarih formatındaki alanlar burada g&amp;ouml;r&amp;uuml;nmez. Nitekim bu yapıdaki alanlarda Full-Text Indexing yapılması &amp;ccedil;ok da anlamlı değildir. Artık Full-Text Searching (T&amp;uuml;m Metinde Arama) işlemimiz se&amp;ccedil;miş olduğumuz alanlar &amp;uuml;zerinde yapılabilecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk110_3.gif" alt="" width="498" height="391" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sıradaki adımda ise, arama işlemi i&amp;ccedil;in gerekli katalog tanımlanır. Yani Full-Text Indexing aslında bir katalogda tutulmaktadır. Dolayısıyla bizim ger&amp;ccedil;ekleştireceğimiz arama işlemleride bu kataloğu kullanacaktır. Kataloglar standart olarak&amp;nbsp;d:\Program Files\Microsoft SQL Server\MSSQL\ftdata\ fiziki adresinde tutulur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk110_4.gif" alt="" width="498" height="391" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Daha sonraki adımlarda ise kataloğun belirli periyotlarda tekrardan doldurulmasını sağlayacak Schedule (Takvim) ayarlarınıda yapabiliriz. Bu ve izleyen adımları ge&amp;ccedil;tikten sonra tek yapmamız gereken kataloğun doldurulması işlemidir. Bunun i&amp;ccedil;inde, iki se&amp;ccedil;eneğimiz var. Birisi &lt;strong&gt;Start Full Population&lt;/strong&gt;. Bu se&amp;ccedil;enek ile katalog baştan itibaren indekslenerek oluşturulur. Bir diğer se&amp;ccedil;eneğimiz ise &lt;strong&gt;Start Incremental Population&lt;/strong&gt; dır. Bu se&amp;ccedil;enek sayesinde sadece tablonun eski hali ile yeni hali arasındaki farklar indeksleme işlemine katılarak katalog g&amp;uuml;ncellenir. Bu daha &amp;ouml;nceden kataloglanmış indeksler i&amp;ccedil;in ge&amp;ccedil;erli bir se&amp;ccedil;enektir. Şu an i&amp;ccedil;in biz kataloğu yeni oluşturduğumuzdan Start Full Population se&amp;ccedil;eneğini kullanacağız.&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;img src="/makale/images/mk110_6.gif" alt="" width="477" height="280" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemlerin ardınan dikkat ederseniz, tablomuzun yer aldığı database i&amp;ccedil;inde, &lt;strong&gt;Full-Text Catalog&lt;/strong&gt; sekmesinde tanımladığımız kataloğun oluşturulduğunu g&amp;ouml;r&amp;uuml;rs&amp;uuml;n&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk110_5.gif" alt="" width="534" height="477" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Eğer tabloda oluşan g&amp;uuml;ncellemelerden sonra katalog bilgisinin otomatik olarak yenilenmesini istiyorsak bu durumda &lt;strong&gt;Change Tracking&lt;/strong&gt; &amp;ouml;zelliğin aktif hale getirmeliyiz. Bununla birlikte katalog g&amp;uuml;ncelleme işleminin arka planda yapılmasını sağlamak i&amp;ccedil;in &lt;strong&gt;Update Index in Background&lt;/strong&gt; se&amp;ccedil;eneğini aktif hale getirmeliyiz. B&amp;ouml;ylece, tablomuza yeni satırlar eklendiğinde, Full-Text Searching (T&amp;uuml;m Metinde Arama) işlemi i&amp;ccedil;in kullanılan katalog bilgilerinin otomatik olarak yenilenmesini sağlamış oluruz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk110_12.gif" alt="" width="440" height="263" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Artık tek yapmamız gereken Full-Text Searching (T&amp;uuml;m Metinde Arama) işlemini kullanmak. Bunun i&amp;ccedil;in T-SQL' de bir ka&amp;ccedil; komut var. Bunlardan ikisi, prototipleri aşağıdaki gibi olan &lt;strong&gt;FREETEXT&lt;/strong&gt; ve &lt;strong&gt; FREETEXTTABLE&lt;/strong&gt; anahtar s&amp;ouml;zc&amp;uuml;kleridir.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;FREETEXT ( Arama Yapılacak Alan , 'Aranacak Kelime' )
FREETEXTTABLE ( Tablo Adi , Arama Yapılacak Alan , 'Aranacak Kelime' )&lt;/pre&gt;
&lt;p&gt;Her iki anahtar s&amp;ouml;zc&amp;uuml;kte, belli bir alan &amp;uuml;zerinde Full-Text Searching (T&amp;uuml;m Metinde Arama) işlemini ger&amp;ccedil;ekleştirmemizi sağlar. Ancak FreeTextTable sonu&amp;ccedil;ları farklı bir tablo ile geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;r. Bu tabloda &lt;strong&gt;Rank&lt;/strong&gt; ve &lt;strong&gt;Key&lt;/strong&gt; isimli iki alan vardır. Key alanı, arama işleminin yapıldığı catalog oluşturulurken kullanılan primary key değerlerini alır. Rank alanı ise, aranan kelimelerin bulunduğu satırlar arasında bir derecelendirme yapılmasına imkan tanır.&lt;/p&gt;
&lt;table id="table7" style="width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;Bu derecelendirme sayesinde aranan kelimenin daha &amp;ccedil;ok ge&amp;ccedil;tiği satırlardan, az ge&amp;ccedil;tiği satırlara doğru (yada aranan kelimenin en uygun olarak eşleştirilebildiği alanlardan en az eşleştirildiği alanlara doğru) sıralanmış bir tablo g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; elde etmemiz m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;İlk olarak Query Analyzer yardımıyla bu sorguların &amp;ccedil;alıştırılmasını inceleyelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk110_7.gif" alt="" width="553" height="262" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, FREETEXT anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;, Icerik isimli alanda overload anahtar kelimesinin ge&amp;ccedil;tiği satırların olduğu sonu&amp;ccedil; k&amp;uuml;mesini elde etmemizi sağlamıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk110_8.gif" alt="" width="519" height="317" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;FreeTextTable anahtar s&amp;ouml;z&amp;uuml;ğ&amp;uuml;n&amp;uuml;n kullanımı ise biraz daha karmaşıktır. Burada arama sonucu oluşan tabloya ait verileri aramanın yapıldığı tablo ile birleştirebilmek amacıyla &lt;strong&gt; Join&lt;/strong&gt; tekniği kullanılmıştır. Join tekniğinde arama işleminde elde edilen tablonun &lt;strong&gt;KEY&lt;/strong&gt; alanı ile Makale isimli tablonun primary key alanı olan ID alanları eşleştirilmiştir. Bu sorgu sonucunda &lt;strong&gt;RANK&lt;/strong&gt; alanına g&amp;ouml;re tersten sıralı bir veri k&amp;uuml;mesi elde ederiz. K&amp;uuml;meyi Rank alanına g&amp;ouml;re tersten sıraladığımız takdirde, aranan kelimenin en uygun şartlarda eşleştirildiği satırlar en &amp;uuml;ste gelmiş olacaktır.&lt;/p&gt;
&lt;p&gt;Şimdi Full-Text Searching (T&amp;uuml;m Metinde Arama) işlemini bir asp.net uygulamasında kullanalım. Bu uygulamada basit olarak bir arama işlemi sonucunda elde edilecek sonu&amp;ccedil;lar bir DataGrid kontrol&amp;uuml;nde g&amp;ouml;sterilecektir. Amacımız bir kelimeyi makalelerin i&amp;ccedil;eriğinde aramak ve bulunan sonu&amp;ccedil;ları kullanıcıya sunmak. Ger&amp;ccedil;ekleştireceğimiz uygulamada aranan kelimenin girileceği TextBox' ta oluşturulabilecek &lt;strong&gt;Sql Injection&lt;/strong&gt;' ların &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek amacıyla bir &lt;strong&gt;Stored Procedure&lt;/strong&gt; kullanacağız. &amp;Ouml;ncelikle sp' mizi aşağıdaki gibi oluşturalım.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;CREATE PROCEDURE dbo.sp_AraBul
(
      @Aranan nvarchar(255) 
)
AS

SELECT A.*,M.Konu,M.Tarih,M.[ID] FROM Makale AS M 
INNER JOIN
FREETEXTTABLE(Makale,Icerik,@Aranan) AS A 
ON M.[ID]=A.[KEY]
ORDER BY A.RANK DESC

RETURN&lt;/pre&gt;
&lt;p&gt;Sp' miz dışarıdan aranan kelimeyi parametre olarak alacak ve sonu&amp;ccedil;ları &amp;ccedil;ağırıldığı ortama d&amp;ouml;nd&amp;uuml;recek. Şimdide asp.net sayfamızı aşağıdaki şekilde oluşturalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk110_9.gif" alt="" width="365" height="300" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Yanlız burada amacımız sadece aranan kelimenin ge&amp;ccedil;tiği makaleleri bulmak değil. Aynı zamanda bulunan makalelerin olduğu sayfalara link vermek. Bu nedenle dataGrid kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n i&amp;ccedil;eriğini aşağıdaki gibi oluşturmamız gerekiyor.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;asp:DataGrid id="dgSonuclar" style="Z-INDEX: 105; LEFT: 48px; POSITION: absolute; TOP: 120px" runat="server" AutoGenerateColumns="False"&amp;gt;
&amp;lt;AlternatingItemStyle BackColor="#FFE0C0"&amp;gt;&amp;lt;/AlternatingItemStyle&amp;gt;
&amp;lt;ItemStyle ForeColor="Black" BackColor="#CCCCCC"&amp;gt;&amp;lt;/ItemStyle&amp;gt;
&amp;lt;Columns&amp;gt;
&amp;lt;asp:HyperLinkColumn DataNavigateUrlField="ID" DataNavigateUrlFormatString="MakaleGoster.aspx?ID={0}" DataTextField="Konu" HeaderText="Makale Konusu"&amp;gt;&amp;lt;/asp:HyperLinkColumn&amp;gt;
&amp;lt;asp:BoundColumn DataField="Tarih" SortExpression="Tarih" ReadOnly="True" HeaderText="Yayin Tarihi" DataFormatString="{0:dd-MM-yy}"&amp;gt;&amp;lt;/asp:BoundColumn&amp;gt;
&amp;lt;/Columns&amp;gt;
&amp;lt;/asp:DataGrid&amp;gt;&lt;/pre&gt;
&lt;p&gt;Şimdide uygulama kodlarımızı yazalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private SqlConnection con;
private SqlCommand cmd;
private SqlDataAdapter da;
private DataTable dt;

private void BaslangicAyarlari()
{
    con=new SqlConnection("data source=localhost;initial catalog=bsenyurt;integrated security=SSPI");
    cmd=new SqlCommand("sp_AraBul",con);
    cmd.CommandType=CommandType.StoredProcedure;
    cmd.Parameters.Add("@Aranan",SqlDbType.NVarChar,255);
    da=new SqlDataAdapter(cmd);
    dt=new DataTable();
}
private void Page_Load(object sender, System.EventArgs e)
{
    BaslangicAyarlari();
} 

private void btnBul_Click(object sender, System.EventArgs e)
{
    cmd.Parameters["@Aranan"].Value=txtArananKelime.Text;
    try
    {
        if(con.State==ConnectionState.Closed)
            con.Open();
        da.Fill(dt);
        dgSonuclar.DataSource=dt;
        dgSonuclar.DataBind();
    }
    catch(SqlException hata)
    {
        Label1.Text=hata.Message.ToString();
    }
    finally
    {
        if(con.State==ConnectionState.Open)
        con.Close();
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdaki sonucu elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk110_10.gif" alt="" width="432" height="356" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Full-Text Searching (T&amp;uuml;m Metinde Arama) tekniğinde sadece tek bir kelime &amp;uuml;zerinden arama yapmak zorunda değiliz. &amp;Ouml;rneğin "Matematik M&amp;uuml;hendisi" kelimelerinin ardışık olarak ge&amp;ccedil;tiği yerleride kolayca bulabiliriz. Tabi b&amp;ouml;yle bir arama sonucunda "Matematik M&amp;uuml;hendisi" kelimesi ile bire bir eşleşen metinlerin bulunduğu satırlar ile "m&amp;uuml;hendisi" kelimesinin olduğu ama "Matematik" kelimesinin olmadığı satırlarda elde edilcektir.&lt;/p&gt;
&lt;p&gt;Diğer yandan i&amp;ccedil;erik alanında hem overload kelimesi hemde interface kelimesi ge&amp;ccedil;en makaleleri bulmak istediğimiz bir &amp;ouml;rnek ile karşılaşırsak ne yaparız? İşte b&amp;ouml;yle bir durumda And, Or gibi mantıksal operatorlerin sunduğu imkanlardan faydalanmamız gerekecektir. Bunun i&amp;ccedil;in Full-Text Searching (T&amp;uuml;m Metinde Arama) işlemlerinde kullanabileceğimiz iki yeni sql anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml; vardır. Bunlar &lt;strong&gt;CONTAINS&lt;/strong&gt; ve &lt;strong&gt;CONTAINSTABLE&lt;/strong&gt; anahtar s&amp;ouml;zc&amp;uuml;kleridir. Bu ifadelerde &lt;strong&gt;AND&lt;/strong&gt;, &lt;strong&gt;OR&lt;/strong&gt;, &lt;strong&gt;NEAR&lt;/strong&gt;, &lt;strong&gt;*&lt;/strong&gt; gibi mantıksal operatorler kullanılarak arama işlemleri daha detaylı bir şekilde ger&amp;ccedil;ekleştirilebilir. &amp;Ouml;rneğin aşağıdaki sorgu, overload ve interface kelimelerinin bir arada ge&amp;ccedil;tiği alanları arar.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;SELECT A.*,M.Konu,M.[ID] FROM Makale AS M INNER JOIN
CONTAINSTABLE(Makale,Icerik,'overload AND interface') AS A ON M.[ID]=A.[KEY]
ORDER BY A.RANK DESC&lt;/pre&gt;
&lt;p&gt;Diğer yandan aynı aramayı overload veya interface kelimelerinden herhangibirinin ge&amp;ccedil;tiği alanlar &amp;uuml;zerinde de aşağıdaki sorgu ile ger&amp;ccedil;ekleştirebiliriz. Tek yapmamız gereken aranan kelimeler arasına Or operatorunu koymak olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk110_11.gif" alt="" width="626" height="415" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;And ve Or operat&amp;ouml;rleri dışında kullanabileceğimiz bir diğer kullanışlı operat&amp;ouml;rde, * asteriks karakteridir. &amp;Ouml;rneğin,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;SELECT A.*,M.Konu,M.[ID] FROM Makale AS M INNER JOIN
CONTAINSTABLE(Makale,Icerik,' "Datarela*" ') AS A ON M.[ID]=A.[KEY]
ORDER BY A.RANK DESC&lt;/pre&gt;
&lt;p&gt;sorgusu yardımıyla Datarela ile başlayan s&amp;ouml;zc&amp;uuml;kleri i&amp;ccedil;eren alanların olduğu veri k&amp;uuml;mesini elde edebiliriz. CONTAINS ve CONTAINSTABLE aramalarında kullanabileceğimiz diğer operat&amp;ouml;rler i&amp;ccedil;in Sql Help' e bakabilirsiniz. Bu makalemizde Full-Text Searching (T&amp;uuml;m Metinde Arama) işlemlerinin nasıl yapıldığını incelemeye &amp;ccedil;alıştık. Umuyorum ki yararlı bir makale olmuştur. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-12-18 12:00:00</pubDate>
  <slug>Ado-Net-ile-Sql-Server-Full-Text-Searching-(Tum-Metinde-Arama)-Kullanc4b1mc4b1-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>sql-server-full-text-search</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>