<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>.Net 4.0 - Lazy Initialization [Beta 2]</title>
  <description>Lazy Initialization yetenekleri sayesinde programların gereksiz bellek tüketimlerinin önüne geçilebilir ve ayrıca performans kazanımı sağlanabilir. Aslında uygulamalarımızda Lazy Initialization kullanmamız için gerek ve yeter iki sebep bulunmaktadır...</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f11%2fblg96_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Eminim hepimiz arada sırada tembellik yapıyor ve ilk bulduğumuz rahat k&amp;ouml;şeye kıvrılıp hi&amp;ccedil; bir şeyi d&amp;uuml;ş&amp;uuml;nmeden rahat&amp;ccedil;a uyuyabiliyoruz. Eğer bulunduğumuz yer uyumaya &amp;ccedil;ok m&amp;uuml;sait değilse yandaki kedi gibi ortama ayak uydurup yinede uyuyoruz &lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt;&amp;nbsp;Siz hi&amp;ccedil; g&amp;ouml;zleri a&amp;ccedil;ık uyuyabilen insanlar g&amp;ouml;rd&amp;uuml;n&amp;uuml;z m&amp;uuml;? Bunun adı d&amp;uuml;pe d&amp;uuml;ze tembellik olabiliyor bazen.&lt;/p&gt;
&lt;p&gt;İhtiya&amp;ccedil; dışında uyumak ve hi&amp;ccedil; bir şeyle uğraşmadan &amp;ouml;ylece kala kalmak tembelliğin doruk noktaya ulaştığı anlar olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Ama gelin g&amp;ouml;r&amp;uuml;n ki, programatik ortamda da nesnelerin zaman zaman tembellik etmesi gerekmektedir. Bug&amp;uuml;nk&amp;uuml; yazımızda bu konuyu değerlendiriyor olacağız. Peki neymiş şu Lazy Initialization bir bakalım.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Lazy Initialization&lt;/strong&gt; yetenekleri sayesinde programların gereksiz bellek t&amp;uuml;ketimlerinin &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ilebilir ve ayrıca performans kazanımı sağlanabilir. Aslında uygulamalarımızda Lazy Initialization kullanmamız i&amp;ccedil;in gerek ve yeter iki sebep bulunmaktadır. İlk olarak &amp;uuml;retilme maliyetleri y&amp;uuml;ksek olan nesnelerin tanımlandıkları anda oluşturulmaları yerine, kullanılmaya başladıkları yerde oluşturulmaları gerektiği durumlarda tercih edilebilir. Bu noktada aklımıza &lt;strong&gt;LINQ&lt;/strong&gt; i&amp;ccedil;erisinde zaten var olan &lt;strong&gt;Deferred Execution&lt;/strong&gt; &amp;ouml;zelliği gelmektedir ki &lt;strong&gt;Lazy Initialization&lt;/strong&gt; yeteneklerine sahip &lt;strong&gt;.Net&lt;/strong&gt; &lt;strong&gt;CLR&lt;/strong&gt; tipleride tam olarak bunu sağlamak &amp;uuml;zere tasarlanmıştır. İkinci bir sebep olarak, maliyeti y&amp;uuml;ksek olan bazı hesaplamaların tamamlanmasından sonra ilgili nesnelerin oluşturulması istenebilir. S&amp;ouml;z gelimi uygulamamın &amp;ccedil;alıştırılması ile &amp;uuml;retilen n sayıda nesneden sadece gerekli olanların &amp;uuml;retilmesi istendiği durumlarda &lt;strong&gt;Lazy Initialization&lt;/strong&gt; yeteneklerinden yararlanılabilir.&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;ok doğal olarak nesnelerin ihtiya&amp;ccedil; duyuldukları anda oluşturulmasının sağlanması i&amp;ccedil;in kendi tekniklerimizi de geliştirebiliriz. Bu noktada &lt;strong&gt;Reflection'&lt;/strong&gt; ın b&amp;uuml;y&amp;uuml;k &amp;ouml;nemi olduğunu vurgulamak gerekir. Nitekim nesnelerin oluşturulmasI işlemini &amp;uuml;stlenecek bir &lt;strong&gt;Wrapper'&lt;/strong&gt; ın mutlaka tasarlanmış olması ve hatta i&amp;ccedil;erisinde &lt;strong&gt;Instance&lt;/strong&gt; &amp;uuml;retimi i&amp;ccedil;in gerekli kodlamaların yapılması gerekmektedir. &lt;strong&gt;Activator&lt;/strong&gt; sınıfının &amp;ccedil;alışma zamanında nesne &amp;uuml;retimi ile ilişkili &amp;ccedil;eşitli &lt;strong&gt;static&lt;/strong&gt; metodları bu ama&amp;ccedil;la kullanılabilir. Ancak&lt;strong&gt; .Net Framework 4.0&lt;/strong&gt; ile birlikte&lt;strong&gt; Lazy Initialization&lt;/strong&gt; i&amp;ccedil;in kullanılabilecek &lt;strong&gt;Lazy&amp;lt;T&amp;gt;&lt;/strong&gt; sarmalayıcı sınıfı gelmektedir. Bu tip sayesinden nesnelerin gerek duyulduğu zamanlarda oluşturulmasının sağlanması son derece kolaylaştırılmaktadır. &amp;Uuml;stelik &lt;strong&gt;Lazy&amp;lt;T&amp;gt; Thread Safe &lt;/strong&gt;bir tip olarak kullanılabilmektedir.&lt;/p&gt;
&lt;p&gt;Dilerseniz konuyu biraz daha net kavramak adına basit bir &amp;ouml;rnek geliştirelim. &amp;Ouml;rnek senaryomuza g&amp;ouml;re program i&amp;ccedil;erisinde ele alınan bir oyun sahnesi ve bu sahne i&amp;ccedil;erisinde yer alan grafiksel şekillerin tutulduğu &amp;ccedil;eşitli nesnelerin &amp;uuml;retim işleminde Lazy Initialization tekniklerinin nasıl kullanıldığını incelemeye &amp;ccedil;alışacağız. Bu senaryoda &lt;strong&gt;Lazy Initialization&lt;/strong&gt; kullanmamız i&amp;ccedil;in &amp;ouml;ne s&amp;uuml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z sebep ise şu olacak; programın ilerleyen adımlarında pek &amp;ccedil;ok farklı sahne ve bu sahne i&amp;ccedil;erisinde yer alan grafik nesnelerin yeri geldiğinde oluşturulması ve b&amp;ouml;ylece programın başlangıcında n sayıda sahne i&amp;ccedil;in yapılacak olan oluşturulma maliyetinin azaltılması. Bu ama&amp;ccedil;la ilk olarak &lt;strong&gt;Visual Studio 2010 Ultimate Beta 2&lt;/strong&gt; &amp;uuml;zerinde aşağıdaki tiplere sahip bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg96_ClassDiagram.gif" alt="" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Collections.Generic;

namespace BeLazy
{
    enum ActorType
    {
        Player,
        Computer,
        Wall,
        Enemy
    }
    class Actor
    {
        public int ActorId { get; set; }
        public string Title { get; set; }
        public string Capability { get; set; }
        public ActorType ActorType { get; set; }
        public byte[] Image { get; set; }

        public override string ToString()
        {
            return string.Format("Actor Id {0} Title {1} Capability {2} Actor Type {3}", ActorId.ToString(), Title, Capability,ActorType.ToString());
        }
    }
    class Scene
    {
        public int SceneId { get; set; }
        public int Width { get; set; }
        public int Height { get; set; }
        public byte[] Background { get; set; }
        public List&amp;lt;Actor&amp;gt; Actors { get; set; }

        public override string ToString()
        {
            return string.Format("SceneId {0} Widht {1} Height {2}", SceneId.ToString(), Width.ToString(), Height.ToString());
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Tamamen hayali olarak tasarlanmış olan bu tiplerde ana fikir &lt;strong&gt;Scene&lt;/strong&gt; tipi i&amp;ccedil;erisinde bir &lt;strong&gt;Actor&lt;/strong&gt; listesinin olmasıdır. Her iki tip i&amp;ccedil;erisinde &lt;strong&gt;byte[]&lt;/strong&gt; tipinden &amp;ouml;zellikler yer almaktadır. &lt;strong&gt;Scene&lt;/strong&gt; nesnelerinin sayısının &amp;ccedil;ok fazla olduğu bir durumda, t&amp;uuml;m&amp;uuml;n&amp;uuml;n bir seferde oluşturulması bellek &amp;uuml;zerindeki t&amp;uuml;ketimi arttırabileceği gibi program performansınıda olumsuz y&amp;ouml;nde etkileyebilir. Bu nedenle &lt;strong&gt;Lazy Initialization&lt;/strong&gt; tekniklerinden faydalanarak sadece gereksinim duyulduğu yerde oluşturulma işlemi yolu tercih edilebilir.&lt;/p&gt;
&lt;p&gt;Peki oluşturulma işlemi hangi aşamada ger&amp;ccedil;ekleşmektedir? Bu noktada&lt;strong&gt; Lazy&amp;lt;T&amp;gt;&lt;/strong&gt; tipinin &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliği devreye girer. &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliğinin kullanıldığı ilk yerde &lt;strong&gt;T&lt;/strong&gt; tipinin oluşturulma işlemi başlamaktadır. Şimdi bu durumu analiz etmek amacıyla Program kodunun i&amp;ccedil;eriğini aşağıdaki gibi yazdığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace BeLazy
{
    class Program
    {
        static void Main(string[] args)
        {
            Lazy&amp;lt;Scene&amp;gt; lazyScene = new Lazy&amp;lt;Scene&amp;gt;();

            Console.WriteLine("Scene oluşturuldu mu? {0} ",lazyScene.IsValueCreated);
            lazyScene.Value.SceneId = 10;
            Console.WriteLine("Scene oluşturuldu mu? {0} ", lazyScene.IsValueCreated);
            Console.WriteLine("Scene ID : {0}",lazyScene.Value.SceneId.ToString());
        }
    }
}&lt;/pre&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;Lazy&amp;lt;Scene&amp;gt;&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneği oluşturulmaktadır. Sonrasında &lt;strong&gt;IsValueCreated&lt;/strong&gt; &amp;ouml;zelliği yardımıyla &lt;strong&gt;Scene&lt;/strong&gt; nesnesinin oluşturulup oluşturulmadığına bakılır. Bir sonraki satırda dikkat edileceği &amp;uuml;zere &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliği &amp;uuml;zerinden gidilerek &lt;strong&gt;SceneId&lt;/strong&gt; i&amp;ccedil;in değer ataması yapılmıştır. Uygulamanın &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg96_FirstRun.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Volaaaa!!! &lt;img title="Cool" src="/editors/tiny_mce3/plugins/emotions/img/smiley-cool.gif" alt="Cool" border="0" /&gt;&amp;nbsp;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;Value &lt;/strong&gt;&amp;ouml;zelliği &amp;ccedil;ağırılana kadar &lt;strong&gt;IsValueCreated&lt;/strong&gt; &amp;ouml;zelliği &lt;strong&gt;false&lt;/strong&gt; değer d&amp;ouml;nd&amp;uuml;rmektedir. Bir başka deyişle s&amp;ouml;z konusu nesne hen&amp;uuml;z oluşturulmamıştır. Ancak &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliğinin kullanılması ile birlikte bir &lt;strong&gt;Scene&lt;/strong&gt; nesnesinin &amp;ouml;rneklendiği g&amp;ouml;r&amp;uuml;lmektedir. Burada dikkat edilmesi gereken noktalardan biriside &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliğinin &lt;strong&gt;Readonly&lt;/strong&gt; olmasıdır. Bir başka deyişle &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliği ile elde edilen bir nesne referansına yeni bir atama ger&amp;ccedil;ekleştirilemez.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg96_ReadOnlyError.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ama tabiki &lt;strong&gt;Value&lt;/strong&gt; &amp;uuml;zerinden gidilen tipin &amp;ouml;zellikleri değiştirilebilir. &amp;Ouml;rneğimizde dikkat &amp;ccedil;ekici noktalardan bir diğeri de &lt;strong&gt;Scene&lt;/strong&gt; nesnesinin aslında karmaşık bir tip olarak i&amp;ccedil;erisinde başka tipleride barındırıyor olmasıdır. Buna g&amp;ouml;re &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliğinden yararlanılarak diğer tiplerin değerlerinin de atanması sağlanabilir...Ya da...Ya da aşağıdaki kod par&amp;ccedil;asında olduğu gibi tembel bir &amp;uuml;retim ger&amp;ccedil;ekleştirilebilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;

namespace BeLazy
{
    class Program
    {
        static void Main(string[] args)
        {
            Lazy&amp;lt;Actor&amp;gt; azman = new Lazy&amp;lt;Actor&amp;gt;(() =&amp;gt;
                new Actor {
                     ActorId=1,
                      ActorType= ActorType.Computer,
                       Capability="&amp;Ccedil;oook!",
                        Image=new byte[1000],
                         Title="Azman"
                }
                );

            Lazy&amp;lt;Actor&amp;gt; gazman = new Lazy&amp;lt;Actor&amp;gt;(() =&amp;gt;
                new Actor
                {
                    ActorId = 1,
                    ActorType = ActorType.Enemy,
                    Capability = "Y&amp;uuml;ksek Gaz depolama kapasitesi!",
                    Image = new byte[5000],
                    Title = "Gazman"
                }
                );

            Lazy&amp;lt;Scene&amp;gt; scene = new Lazy&amp;lt;Scene&amp;gt;(() =&amp;gt;
                new Scene
                {
                    SceneId = 1001,
                    Background = new byte[10000],
                    Height = 100,
                    Width = 250,
                    Actors = new List&amp;lt;Actor&amp;gt; { azman.Value, gazman.Value }
                }
                );

            Console.WriteLine("Scene oluşturuldu mu? {0} ",scene.IsValueCreated);
            Console.WriteLine("Azman oluşturuldu mu= {0}",azman.IsValueCreated);
            Console.WriteLine("Gazman oluşturuldu mu= {0}", gazman.IsValueCreated);
            
            Scene currentScene=scene.Value;

            Console.WriteLine("Scene oluşturuldu mu? {0} ", scene.IsValueCreated);
            Console.WriteLine("Azman oluşturuldu mu= {0}", azman.IsValueCreated);
            Console.WriteLine("Gazman oluşturuldu mu= {0}", gazman.IsValueCreated);     

            Console.WriteLine(currentScene.ToString());

            foreach (Actor actor in currentScene.Actors)
            {
                Console.WriteLine("\t {0}",actor.ToString());
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Buna g&amp;ouml;re &amp;ccedil;alışma zamanı i&amp;ccedil;eriği aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg96_SecondRun2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;Scene&lt;/strong&gt; ve &lt;strong&gt;Actors&lt;/strong&gt; &amp;ouml;zelliğinin işaret ettiği koleksiyon i&amp;ccedil;erisindeki t&amp;uuml;m &lt;strong&gt;Actor&lt;/strong&gt; tipleri &lt;strong&gt;Lazy&lt;/strong&gt; olarak &amp;uuml;retilmektedir. &amp;Uuml;retim noktası ise &lt;strong&gt;currentScene&lt;/strong&gt; değişkenin &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliği ile atamanın yapıldığı satırdır. Bu satırdan sonra &lt;strong&gt;Scene&lt;/strong&gt; nesnesi ve i&amp;ccedil;eriğindeki &lt;strong&gt;Actor &lt;/strong&gt;nesnelerinin oluşturulması ger&amp;ccedil;ekleştirilmektedir. Tabi istenirse &lt;strong&gt;Actor&lt;/strong&gt; oluşturma işlemleride sonraki bir adıma bırakılabilir.&lt;/p&gt;
&lt;p&gt;İlgin&amp;ccedil; olan bir noktada, &lt;strong&gt;Lazy&amp;lt;T&amp;gt;&lt;/strong&gt; tipinden &amp;ouml;zelliklerin(Type Property) tanımlanabilmesidir. Dilerseniz aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg96_ClassDiagram2.gif" alt="" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;

namespace BeLazy
{
    class Program
    {
        static void Main(string[] args)
        {
            Contact cntc = new Contact(1, "Burak Selim Şenyurt", "New York", "USA", "1000");
            Console.WriteLine("Contact i&amp;ccedil;erisindeki Address nesnesi &amp;uuml;retilmiş mi ? {0}", cntc.IsAddressCreated);
            Console.WriteLine("{0} {1} {2}",cntc.Address.Country,cntc.Address.City,cntc.Address.PostalCode);
            Console.WriteLine("Contact i&amp;ccedil;erisindeki Address nesnesi &amp;uuml;retilmiş mi ? {0}", cntc.IsAddressCreated);
        }
    }

    class Contact
    {
        private Lazy&amp;lt;Address&amp;gt; _address;

        public Contact(int contactId,string name,string city,string country,string postalCode)
        {
            _address = new Lazy&amp;lt;Address&amp;gt;(
                () =&amp;gt; new Address {
                     City=city,
                     Country=country,
                     PostalCode=postalCode
                }
                );

            ContactId = contactId;
            Name = name;
        }

        public Address Address
        {
            get
            {
                return _address.Value;
            }
        }
        public bool IsAddressCreated
        {
            get
            {
                return _address.IsValueCreated;
            }
        }
        public int ContactId { get; set; }
        public string Name { get; set; }
        
    }

    class Address
    {
        public string City { get; set; }
        public string Country { get; set; }
        public string PostalCode { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnekte yer alan &lt;strong&gt;Contact&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde &lt;strong&gt;Lazy&amp;lt;Address&amp;gt;&lt;/strong&gt; tipinden &lt;strong&gt;private&lt;/strong&gt; bir alan tanımlandığı g&amp;ouml;r&amp;uuml;lmektedir. Bu alanın oluşturulması &lt;strong&gt;Contact&lt;/strong&gt; sınıfının yapıcı metodu i&amp;ccedil;erisinde ger&amp;ccedil;ekleştirilmektedir. &lt;strong&gt;Address&lt;/strong&gt; isimli &amp;ouml;zellik ilede,&lt;strong&gt; Lazy&amp;lt;Address&amp;gt;&lt;/strong&gt; tipinden olan &lt;strong&gt;_address &lt;/strong&gt;alanının &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliğinin değeri geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmektedir. Zaten &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliğine referans atanması ger&amp;ccedil;ekleştirilemediğinden &lt;strong&gt;Address&lt;/strong&gt; isimli &amp;ouml;zellik sadece &lt;strong&gt;get&lt;/strong&gt; bloğuna sahip olacak şekilde tanımlanmıştır&lt;strong&gt;(Read Only)&lt;/strong&gt;. Bu kodlamaya g&amp;ouml;re &lt;strong&gt;Contact&lt;/strong&gt; sınıfına ait bir nesne &amp;ouml;rneklendikten sonra i&amp;ccedil;erisinde yer alan &lt;strong&gt;Address&lt;/strong&gt; nesnesi hemen oluşturulmaz. Ancak &lt;strong&gt;Contact&lt;/strong&gt; sınıfının nesne &amp;ouml;rneği &amp;uuml;zerinden &lt;strong&gt;Address&lt;/strong&gt; &amp;ouml;zelliğine gidilir ve &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliğine ulaşılırsa &amp;ouml;rnekleme işlemi ger&amp;ccedil;ekleşecektir. Bu durum &amp;ccedil;alışma zamanında daha net bir şekilde g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg96_ThirdRun.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;Contact&lt;/strong&gt; nesnesi &amp;ouml;rneklense bile &lt;strong&gt;Address&lt;/strong&gt; nesnesi hen&amp;uuml;z oluşturulmamıştır. Ancak &lt;strong&gt;Address&lt;/strong&gt; nesnesinin &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliğine ulaşıldığı ilk yerde bu işlem ger&amp;ccedil;ekleşmektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Lazy&amp;lt;T&amp;gt;&lt;/strong&gt; tipinin kullanımında dikkatli olunması gereken noktalardan biriside &lt;strong&gt;Multi-Thread&lt;/strong&gt; operasyonlardır. &amp;Ouml;zellikle birden fazla &lt;strong&gt;Thread'&lt;/strong&gt; in aynı &lt;strong&gt;Lazy&amp;lt;T&amp;gt; &lt;/strong&gt;nesne &amp;ouml;rneğini kullanması halinde ilgili nesnenin hangi &lt;strong&gt;Thread&lt;/strong&gt; i&amp;ccedil;erisinde oluşturulacağının bir &amp;ouml;nemi kalmamaktadır. Ancak oluşturulma işlemleri sırasında meydana gelecek &lt;strong&gt;istisnalarda(Exceptions)&lt;/strong&gt; diğer &lt;strong&gt;Thread'&lt;/strong&gt; lerinde otomatik olarak etkilenmesi s&amp;ouml;z konusudur. Buna ek olarak &lt;strong&gt;Lazy&amp;lt;T&amp;gt;&lt;/strong&gt; tipleri oluşturulurken&lt;strong&gt; Thread Safe&lt;/strong&gt; olup olmayacakları &amp;ccedil;ok basit bir şekilde belirlenebilir. Bu durmu daha net bir şekilde anlayabilmek adına dilerseniz aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Threading;

namespace BeLazy
{
    class Program
    {
        static void Main(string[] args)
        {
            Lazy&amp;lt;Information&amp;gt; information = new Lazy&amp;lt;Information&amp;gt;();

            Thread threadA=new Thread(
                ()=&amp;gt;
                    {
                        Console.WriteLine(information.Value.ToString());
                        Console.WriteLine("\tThread A Thread Id : {0}",Thread.CurrentThread.ManagedThreadId.ToString());
                    }
                    );

            Thread threadB = new Thread(
                () =&amp;gt;
                {
                    Console.WriteLine(information.Value.ToString());
                    Console.WriteLine("\tThread B Thread Id : {0}", Thread.CurrentThread.ManagedThreadId.ToString());
                }
                    );

            Thread threadC = new Thread(
                () =&amp;gt;
                {
                    Console.WriteLine(information.Value.ToString());
                    Console.WriteLine("\tThread C Thread Id : {0}", Thread.CurrentThread.ManagedThreadId.ToString());
                }
                    );

            threadA.Start();
            threadB.Start();
            threadC.Start();

            threadA.Join();
            threadB.Join();
            threadC.Join();
        }
    }

    class Information
    {
        private int threadId;
        private string initializeTime;

        public Information()
        {
            threadId = Thread.CurrentThread.ManagedThreadId;
            initializeTime = DateTime.Now.ToLongTimeString();
            Thread.Sleep(2000);
        }

        public override string ToString()
        {
            return String.Format("Thread Id : {0} Time : {1}", threadId.ToString(), initializeTime);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rneğimizde 3 farklı &lt;strong&gt;Thread'&lt;/strong&gt; in &amp;ccedil;alıştırıldığı g&amp;ouml;r&amp;uuml;lmektedir. Bu &lt;strong&gt;Thread'&lt;/strong&gt; lerin tamamı kendi i&amp;ccedil;lerinde &lt;strong&gt;Lazy&amp;lt;Information&amp;gt;&lt;/strong&gt; tipinden olan &lt;strong&gt;information&lt;/strong&gt; değişkenini kullanmaktadır. Buna g&amp;ouml;re &lt;strong&gt;Thread'&lt;/strong&gt; lerden hangisi ilk olarak &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliğine erişirse, &lt;strong&gt;Information&lt;/strong&gt; nesnesi &amp;ouml;rneklemiş olacaktır. Buna ek olarak &amp;ccedil;alışma zamanındaki sonu&amp;ccedil;lara bakıldığında t&amp;uuml;m &lt;strong&gt;Thread'&lt;/strong&gt; lerin ilk &amp;uuml;retilen &lt;strong&gt;Information&lt;/strong&gt; nesne &amp;ouml;rneğine ulaştığı bu nedenle &lt;strong&gt;Information&lt;/strong&gt; yapıcı metodunda oluşturulan &lt;strong&gt;ManagedThreadId&lt;/strong&gt; değerlerinin ve zamanların aynı olduğu g&amp;ouml;r&amp;uuml;l&amp;uuml;r. İşte sonu&amp;ccedil;lar.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f11%2fblg96_FourthRun.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu senaryoya g&amp;ouml;re nesnenin hangi &lt;strong&gt;Thread&lt;/strong&gt; i&amp;ccedil;erisinde oluşturulduğunun hi&amp;ccedil; bir &amp;ouml;nemi yoktur. Şimdi akla ş&amp;ouml;yle bir soru gelebilir.&lt;strong&gt; Lazy&amp;lt;Information&amp;gt;&lt;/strong&gt; &amp;ouml;rneği oluşturulurken &lt;strong&gt;Thread-Safe&lt;/strong&gt; davranılacağı nerede belirtilmiştir?&lt;/p&gt;
&lt;p&gt;Aslında&lt;strong&gt; Lazy&amp;lt;T&amp;gt;&lt;/strong&gt; tipinin &lt;strong&gt;isThreadSafe&lt;/strong&gt; parametresinin değeri varsayılan olarak &lt;strong&gt;true'&lt;/strong&gt; dur ve istenirse yapıcı metod i&amp;ccedil;erisinde değiştirilebilir. &amp;Ouml;zelliğe &lt;strong&gt;false&lt;/strong&gt; değer atanması halinde genellikle ilgili nesnenin tek bir &lt;strong&gt;thread&lt;/strong&gt; i&amp;ccedil;erisinde kullanıldığı varsayılır ve bu azda olsa performans kazanımına neden olur. Ancak birden fazla &lt;strong&gt;thread'&lt;/strong&gt; in aynı&lt;strong&gt; Lazy&amp;lt;T&amp;gt;&lt;/strong&gt; nesnesini kullanacağı hallerde koordinasyon daha b&amp;uuml;y&amp;uuml;k &amp;ouml;nem kazanmaktadır ve bu nedenle &lt;strong&gt;isThreadSafe&lt;/strong&gt; &amp;ouml;zelliğinin değerinin &lt;strong&gt;true&lt;/strong&gt; olarak bırakılması &amp;ouml;nerilir.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;strong&gt;Kişisel Not : &lt;/strong&gt;&amp;Ouml;zellikle birden fazla &lt;strong&gt;Thread'&lt;/strong&gt; in aynı nesnenin kendi i&amp;ccedil;lerinde farklı kopyalarını alarak kullanmaları istendiği durumda &lt;strong&gt;.Net 4.0&lt;/strong&gt; ile gelen &lt;strong&gt;ThreadLocal&lt;/strong&gt; tipinden yararlanılabilir ki .&lt;strong&gt;Net 3.5'&lt;/strong&gt; te bunun i&amp;ccedil;in &lt;strong&gt;ThreadStatic&lt;/strong&gt; isimli bir nitelikten yararlanılmaktadır. İşte size g&amp;uuml;zel bir araştırma konusu &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Buraya kadar anlattıklarımıza g&amp;ouml;re dikkat edilmesi gereken bazı noktalar olduğuda aşikardır;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Lazy&amp;lt;T&amp;gt; i&amp;ccedil;erisinde kullanılacak tipin mutlaka &lt;strong&gt;varsayılan yapıcı(Default Constructor)&lt;/strong&gt;&amp;nbsp;metodu olmalıdır. Nitekim oluşturma işleminde aslında &lt;strong&gt;Activator&lt;/strong&gt; sınıfının &lt;strong&gt;CreateInstance&lt;/strong&gt; metodu devreye girmektedir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliği &lt;strong&gt;ReadOnly'&lt;/strong&gt; dir. Bu nedenle kullanıldıktan sonra T tipinden bir referansın atanması ger&amp;ccedil;ekleştirilemez.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Multi-Thread&lt;/strong&gt; senaryolarda &lt;strong&gt;isThreadSafe&lt;/strong&gt; &amp;ouml;zelliğini &lt;strong&gt;true&lt;/strong&gt; olarak bırakmak doğru bir yaklaşımdır.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Single-Thread&lt;/strong&gt; senaryolarda &lt;strong&gt;isThreadSafe&lt;/strong&gt; &amp;ouml;zelliği performans kazanımı adına istenirse &lt;strong&gt;false&lt;/strong&gt; bırakılabilir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliğine erişildiğinde oluşabilecek bir istisna halinde kodun ilerleyen kısımlarında &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliğine giden her &amp;ccedil;ağrı i&amp;ccedil;in aynı &lt;strong&gt;Exception&lt;/strong&gt; &amp;ouml;rneği s&amp;ouml;z konusu olacaktır. Yani Value &amp;ouml;zelliğinin ilk &amp;ccedil;ağırıldığı yerde oluşacak bir istisna devam eden Value &amp;ccedil;ağrılarına da akacaktır. Bu &lt;strong&gt;Multi-Thread&lt;/strong&gt; senaryolarda da &lt;strong&gt;isThreadSafe&lt;/strong&gt; &amp;ouml;zelliğinin değeri &lt;strong&gt;true&lt;/strong&gt; bırakıldığı s&amp;uuml;rece&amp;nbsp;de ge&amp;ccedil;erlidir.&lt;/li&gt;
&lt;li&gt;&amp;Ccedil;ekinilmesi gereken nokta şudur; &lt;strong&gt;isThreadSafe&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;false&lt;/strong&gt; değer verilmesi halinde &lt;strong&gt;thread'&lt;/strong&gt; ler arasında senkronizasyon ortadan kalkacağından, bir &lt;strong&gt;Thread'&lt;/strong&gt; in &lt;strong&gt;exception&lt;/strong&gt; g&amp;ouml;rd&amp;uuml;ğ&amp;uuml; noktada diğer bir thread kullanılabilir bir &lt;strong&gt;Value&lt;/strong&gt; &amp;ouml;zelliği ile karşılaşabilir. Aman dikkat.&lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Umarım faydalı bir yazı olmuştur. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f11%2fBeLazy.rar"&gt;BeLazy.rar (28,31 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-12-14 01:30:00</pubDate>
  <slug>Net-40-Lazy-Initialization</slug>
  <tags>
    <tag>c#-40</tag>
    <tag>net-framework-40</tag>
  </tags>
  <categories>
    <category>C# 4.0</category>
  </categories>
</post>