<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Pug, Pug, Pug</title>
  <description>Bu makalemizde Node.js üzerinde express kullanarak basit bir web sayfasının nasıl gösterilebileceğini incelemeye çalışıyoruz. Ancak farklı olarak Pug(eski adı Jade) isimli paketten yararlanarak html içeriğini çok daha farklı bir şekilde tasarlıyoruz. Bu tasarım sırasında HTML'in klasik açısal ayraç sistemini terk ediyor ve girintili(tab'lı) yazım stiline geçiyoruz.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/04/node_with_pug_3.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Kısa bir s&amp;uuml;re &amp;ouml;nce &amp;ccedil;alışmakta olduğum şirkette epey eğlenceli bir mevzunun i&amp;ccedil;erisinde kaldım. Daha &amp;ouml;nceden de bahsettiğim gibi kurumumuzun bize sunduğu g&amp;uuml;zel bir hizmet var...&lt;a href="https://www.pluralsight.com/" target="_blank"&gt;Pluralsight&lt;/a&gt;. Ne var ki benim gibi dikkatsiz kullanıcılar i&amp;ccedil;in enteresan şeyler olabiliyor. İzin verin hikayeyi size anlatayım; İlk hedefim olduk&amp;ccedil;a hoşuma giden Node.js tarafında ilerlemekti.&lt;/p&gt;
&lt;p&gt;Bu ama&amp;ccedil;la kendime &amp;ccedil;izdiğim kariyer yolunda&lt;em&gt;(aslında Pluralsight Path demek daha doğru olur)&lt;/em&gt; bir takım Node.js eğitimlerini izlemeye başladım. Hatam bu eğitimlerin tarihlerine pek dikkat etmiyor oluşumdu. &amp;Ouml;yle ki eğitimde s&amp;ouml;z&amp;uuml; ge&amp;ccedil;en bir npm mod&amp;uuml;l&amp;uuml; pekala eskimiş olabilirdi.&lt;/p&gt;
&lt;p&gt;O hafta izlediğim eğitim serisi Node.js ile web programlama &amp;uuml;zerineydi. Express ile işin i&amp;ccedil;erisine girdikten sonra bir takım yardımcı &amp;ccedil;atılardan daha bahsedilmeye başlandı. Derken&amp;nbsp;HTML'in sıkıcı olan o a&amp;ccedil;ısal ayra&amp;ccedil;larından bizi kurtaran Jade isimli bir paketle karşılaştım. İnanılmaz hoşuma gitti. Nerden bilebilirdim aslında onun adının sonradan Pug olarak değiştirildiğinden ve hatta &amp;ccedil;alıştığım kurumun yeni nesil .Net projelerinde bu &amp;uuml;r&amp;uuml;n&amp;uuml; kullandığından:)&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bu arada ben Jade kod adını daha &amp;ccedil;ok beğendiğimi ifade etmek isterim. Nitekim "Yeşim Taşı" olarak anlam kazanır. Oysa ki pug...Peah...Buldoğa benzeyen ufak bir k&amp;ouml;pek olduğu ifade ediliyor. Aslında Jade'in Pug olma hiyakesini &lt;a href="https://github.com/pugjs/pug/issues/2184" target="_blank"&gt;şuradan&lt;/a&gt; okuyabilirsiniz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;O Cuma g&amp;uuml;n&amp;uuml;&amp;nbsp;her zaman ki gibi sabah izlediğim derslerin bir uygulamasını g&amp;uuml;n i&amp;ccedil;erisinde sıkıldığım anlarda yapmıştım&lt;em&gt;(aman patron duymasın)&lt;/em&gt; Sonrasında sevgili&amp;nbsp;&lt;a href="https://www.linkedin.com/in/hilmidonmez/" target="_blank"&gt;Hilmi ağabeye&lt;/a&gt; durumu anlatmak istedim. Sık sık &amp;ouml;ğrendiklerimizi birbirimizle paylaşıyırız zaten. Heyecanlı bir şekilde anlattım da anlattım...Hatta yaptıklarımı g&amp;ouml;sterdim bile. Sonra &amp;ccedil;ok g&amp;uuml;zel bir c&amp;uuml;mle sarfetti&amp;nbsp;"yahu bunun bizim kullandığımız Pug'dan farkı ne? Neredeyse aynı..." Hemen google'ladık tabii...Ne g&amp;ouml;rd&amp;uuml;k dersiniz? Pug meğerse Jade'in yeni adıymış. &amp;Ouml;nce birbirimize şaşkın şaşkın baktık ve bir s&amp;uuml;re sonra kahkayı patlattık :D&lt;/p&gt;
&lt;p&gt;Tabii ki yaptığım kodlar &amp;ccedil;&amp;ouml;pe gitmedi. Jade yerine hemen &lt;a href="https://pugjs.org/api/getting-started.html" target="_blank"&gt;Pug paketini&lt;/a&gt; uygulamaya dahil edip aynı sonu&amp;ccedil;ları elde etmeyi başardım. Peki neydi o becerebildiğim ve beni heyecanlandıran şey? Malum uzun yıllar back-end tarafında geliştirme yapmış birisi olarak front-end benim i&amp;ccedil;in epey geniş ve bir o kadar da korkutucu bir alan. Ancak g&amp;ouml;revim gereği o noktalara da dokunmam gerekiyor. Dilerseniz elde ettiğim sonucu g&amp;ouml;stererek başlayalım. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ne bakalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/node_with_pug_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tarayıcı penceresinde a&amp;ccedil;ılmış basit bir HTML i&amp;ccedil;eriği g&amp;ouml;r&amp;uuml;yorsunuz aslında değil mi? Hatta berbat &amp;ouml;tesi bir tasarımı da var buna hi&amp;ccedil; ş&amp;uuml;phe yok :) Peki ya aslında bu sayfanın HTML tarafının aşağıdaki gibi yazıldığını s&amp;ouml;ylesem.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;html
    head
        meta(charset='utf-8')
        link(href='https://fonts.googleapis.com/css?family=Chewy',rel='stylesheet')
        title I love this game
    body(style='width:410px;font-family:Chewy,cursive')
        h2(id='myId',style='background-color:darkblue;color:white') İ s t a t i s t i k l e r
        p
            h3(style='background-color:red;color:white') En iyi takımlar
            p.
                NBA tarihinde t&amp;uuml;m zamanların en iyi takımları   
            ul
                each team in teams
                    b
                        li=team
        p
            h3(style='background-color:green;color:white') En iyi oyuncular
            p.
                NBA tarihinin bug&amp;uuml;ne kadar gelmiş ge&amp;ccedil;miş en iyi oyuncuları
            mixin player-card(player)
                div(style='background-color:lightgray').player-card
                    a(href=player.url)
                        div.player-name=player.name
                    p
                        img.player-photo(src=player.photo)
                    p
                        i.heigth=player.height                        
                    p
                        i.bio=player.bio     
                    p                                        
            for player in players
                +player-card(player)&lt;/pre&gt;
&lt;p&gt;Şimdi işler biraz değişti değil mi? En azından bir farkındalık oluştu. Normalde yukarıdaki i&amp;ccedil;eriğin g&amp;ouml;r&amp;uuml;nt&amp;uuml;lenmesi i&amp;ccedil;in klasik ve bilinen y&amp;ouml;ntemlerle aşağıdakine benzer bir HTML dosyası hazırlanır.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;html&amp;gt;

&amp;lt;head&amp;gt;
    &amp;lt;meta charset="utf-8" /&amp;gt;
    &amp;lt;link href="https://fonts.googleapis.com/css?family=Chewy" rel="stylesheet" /&amp;gt;
    &amp;lt;title&amp;gt;I love this game&amp;lt;/title&amp;gt;
&amp;lt;/head&amp;gt;

&amp;lt;body style="width:410px;font-family:Chewy,cursive"&amp;gt;
    &amp;lt;h2 id="myId" style="background-color:darkblue;color:white"&amp;gt;İ s t a t i s t i k l e r&amp;lt;/h2&amp;gt;
    &amp;lt;p&amp;gt;
        &amp;lt;h3 style="background-color:red;color:white"&amp;gt;En iyi takımlar&amp;lt;/h3&amp;gt;
        &amp;lt;p&amp;gt;NBA tarihinde t&amp;uuml;m zamanların en iyi takımları &amp;lt;/p&amp;gt;
        &amp;lt;ul&amp;gt;
            &amp;lt;b&amp;gt;
                &amp;lt;li&amp;gt;bulls&amp;lt;/li&amp;gt;
            &amp;lt;/b&amp;gt;
            &amp;lt;b&amp;gt;
                &amp;lt;li&amp;gt;celtics&amp;lt;/li&amp;gt;
            &amp;lt;/b&amp;gt;
            &amp;lt;b&amp;gt;
                &amp;lt;li&amp;gt;lakers&amp;lt;/li&amp;gt;
            &amp;lt;/b&amp;gt;
        &amp;lt;/ul&amp;gt;
    &amp;lt;/p&amp;gt;
    &amp;lt;p&amp;gt;
        &amp;lt;h3 style="background-color:green;color:white"&amp;gt;En iyi oyuncular&amp;lt;/h3&amp;gt;
        &amp;lt;p&amp;gt;NBA tarihinin bug&amp;uuml;ne kadar gelmiş ge&amp;ccedil;miş en iyi oyuncuları&amp;lt;/p&amp;gt;
        &amp;lt;div class="player-card" style="background-color:lightgray"&amp;gt;
            &amp;lt;a href="http://www.espn.com/nba/player/_/id/3975"&amp;gt;
                &amp;lt;div class="player-name"&amp;gt;sitivin k&amp;ouml;ri&amp;lt;/div&amp;gt;
            &amp;lt;/a&amp;gt;
            &amp;lt;p&amp;gt;
                &amp;lt;img class="player-photo" src="curry.gif" /&amp;gt;
            &amp;lt;/p&amp;gt;
            &amp;lt;p&amp;gt;
                &amp;lt;i class="heigth"&amp;gt;190cm&amp;lt;/i&amp;gt;
            &amp;lt;/p&amp;gt;
            &amp;lt;p&amp;gt;
                &amp;lt;i class="bio"&amp;gt;benzersiz top tekniği, y&amp;uuml;ksek şut y&amp;uuml;zdesi, sınır tanımaz &amp;uuml;&amp;ccedil;l&amp;uuml;kleri...&amp;lt;/i&amp;gt;
            &amp;lt;/p&amp;gt;
            &amp;lt;p&amp;gt; &amp;lt;/p&amp;gt;
        &amp;lt;/div&amp;gt;
        &amp;lt;div class="player-card" style="background-color:lightgray"&amp;gt;
            &amp;lt;a href="http://www.espn.com/nba/player/_/id/1966"&amp;gt;
                &amp;lt;div class="player-name"&amp;gt;l&amp;ouml;bron ceyms&amp;lt;/div&amp;gt;
            &amp;lt;/a&amp;gt;
            &amp;lt;p&amp;gt;
                &amp;lt;img class="player-photo" src="lebron.gif" /&amp;gt;
            &amp;lt;/p&amp;gt;
            &amp;lt;p&amp;gt;
                &amp;lt;i class="heigth"&amp;gt;206cm&amp;lt;/i&amp;gt;
            &amp;lt;/p&amp;gt;
            &amp;lt;p&amp;gt;
                &amp;lt;i class="bio"&amp;gt;&amp;ccedil;ok g&amp;uuml;&amp;ccedil;l&amp;uuml;, ani hızlanma, meydan okuma, istatistikleri alt &amp;uuml;st etme...&amp;lt;/i&amp;gt;
            &amp;lt;/p&amp;gt;
            &amp;lt;p&amp;gt; &amp;lt;/p&amp;gt;
        &amp;lt;/div&amp;gt;
        &amp;lt;div class="player-card" style="background-color:lightgray"&amp;gt;
            &amp;lt;a href="http://www.espn.com/nba/player/_/id/2384"&amp;gt;
                &amp;lt;div class="player-name"&amp;gt;divayt hauvırd&amp;lt;/div&amp;gt;
            &amp;lt;/a&amp;gt;
            &amp;lt;p&amp;gt;
                &amp;lt;img class="player-photo" src="howard.gif" /&amp;gt;
            &amp;lt;/p&amp;gt;
            &amp;lt;p&amp;gt;
                &amp;lt;i class="heigth"&amp;gt;206cm&amp;lt;/i&amp;gt;
            &amp;lt;/p&amp;gt;
            &amp;lt;p&amp;gt;
                &amp;lt;i class="bio"&amp;gt;o boyla o fudamental hareketleri yapabiliyor olmak, oyun zekası...&amp;lt;/i&amp;gt;
            &amp;lt;/p&amp;gt;
            &amp;lt;p&amp;gt; &amp;lt;/p&amp;gt;
        &amp;lt;/div&amp;gt;
    &amp;lt;/p&amp;gt;
&amp;lt;/body&amp;gt;

&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;İşte Pug'ın ortaya koyduğu fark bu. "İki resim arasındaki 9 farkı bulun" bulmacasını hatırlar mısınız bilmem ama bu k&amp;ouml;t&amp;uuml; espriyi yapmanın tam yeri ve zamanı sanırım :) Gelin kolları sıvayalım ve bu işi nasıl yaptığımızı kısaca &amp;ouml;zetleyelim. Uygulamanın bir kısmını şirket kaynaklarını kullaranak Windows tabanlı bir sistem &amp;uuml;zerinde yapmış olsam da asıl tecr&amp;uuml;be etmek istediğim&amp;nbsp;yer elbette ki West-World topraklarıydı. Ubuntu'nun başına ge&amp;ccedil;tim ve sonradan aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan yapıya&amp;nbsp;d&amp;ouml;n&amp;uuml;şecek klas&amp;ouml;r ağacını oluşturmaya başladım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/04/node_with_pug_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;public/images klas&amp;ouml;r&amp;uuml; i&amp;ccedil;erisinde basketbol oyuncularına ait fotoğraflar yer alıyor&lt;em&gt;(itinayla taranmışlardır)&lt;/em&gt; src/views altında pug uzantılı dosyamız bulunmakta. Bu yazının ilk kısmında paylaşmış olduğumuz i&amp;ccedil;eriğe sahip. Aslında dikkatli bir şekilde okuduğunuzda girinti sistemine dayanan ve bu sayede HTML'in &amp;lt; ve &amp;gt; gibi a&amp;ccedil;ısal ayra&amp;ccedil;larını geride bırakan bir yazım stili s&amp;ouml;z konusu olduğunu rahatlıkla anlayabilirsiniz. Klas&amp;ouml;rde yer alan server.js ve package.json i&amp;ccedil;eriklerini biraz sonra dolduracağız. Nitekim yapmamız gereken bazı &amp;ouml;n hazırlıklar var. İlk olarak terminal'den aşağıdaki komutları kullanarak gerekli y&amp;uuml;klemeleri yapalım.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm init
npm install express --save
npm install pug --save&lt;/pre&gt;
&lt;p&gt;npm init kullanımı ile package.json dosyasının oluşmasını sağlıyoruz. Bu komutu &amp;ccedil;alıştırdığımızda bazı sorularla da karşılaşırız. Uygulamanın adı, versiyonu, yazarı, test komutu vs...Diğer iki komut express ve pug paketlerinin y&amp;uuml;klenmesi i&amp;ccedil;in kullanılıyorlar. express paketini web hizmetleri i&amp;ccedil;in kullanacağız. Static i&amp;ccedil;eriklerin g&amp;ouml;r&amp;uuml;nt&amp;uuml;lenmesi veya belirlenen adrese gelen taleplerin y&amp;ouml;netilmesi dışında servis geliştirilmesinde de kullanılabilir. Pug ise az &amp;ouml;nce sıklıkla değindiğimiz yeni stil HTML şablonunun &amp;ccedil;alışma zamanında anlaşılabilmesi i&amp;ccedil;in gerekli. Bu işlemler sonrasında en azından West-World i&amp;ccedil;in ilgili package.json i&amp;ccedil;eriğinin aşağıdaki gibi oluştuğunu ifade edebilirim.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;{
  "name": "en.bi.ey",
  "version": "1.0.0",
  "description": "NBA istatistikleri",
  "main": "index.js",
  "scripts": {
    "test": "echo \"Error: no test specified\" &amp;amp;&amp;amp; exit 1",
    "start": "node server.js"
  },
  "keywords": [
    "nba",
    "spor",
    "istatistik",
    "nodejs"
  ],
  "author": "burak selim senyurt",
  "license": "ISC",
  "dependencies": {
    "express": "^4.16.3",
    "pug": "^2.0.3"
  }
}&lt;/pre&gt;
&lt;p&gt;Package.json i&amp;ccedil;erisinde m&amp;uuml;dahale ettiğimiz bir kısım var. scripts elementine dikkat ederseniz start &amp;ouml;zelliği i&amp;ccedil;in node server.js şeklinde bir tanımlama yaptık. Buna g&amp;ouml;re uygulamamızı "node server.js" yerine "npm start" terminal komutu ile de &amp;ccedil;alıştırabiliriz ki genel jargon bu y&amp;ouml;ndedir.&lt;/p&gt;
&lt;p&gt;Gelelim server.js dosyasının i&amp;ccedil;eriğine. Burada da &amp;ouml;ğrendiğim bir &amp;ccedil;ok şey olduğunu ifade edebilirim. Python, Ruby, Go gibi pek &amp;ccedil;ok programlama ortamındakine benzer bir işleyiş s&amp;ouml;z konusu tabii ama Node.js a&amp;ccedil;ısından d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;mde benim i&amp;ccedil;in yeni yeni şeyler...&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;var express = require('express');
var app = express();
var port = 65003;

app.use(express.static('public/images'))
app.set('views', './src/views');
app.set('view engine', 'pug');

app.get('/', function (req, res) {
    res.render('index'
        , {
            teams: ['bulls', 'celtics', 'lakers'],
            players: [
                {
                    name: 'sitivin k&amp;ouml;ri',
                    bio: 'benzersiz top tekniği, y&amp;uuml;ksek şut y&amp;uuml;zdesi, sınır tanımaz &amp;uuml;&amp;ccedil;l&amp;uuml;kleri...',
                    height: "190cm",
                    url: 'http://www.espn.com/nba/player/_/id/3975',
                    photo: 'curry.gif'
                },
                {
                    name: 'l&amp;ouml;bron ceyms',
                    bio: '&amp;ccedil;ok g&amp;uuml;&amp;ccedil;l&amp;uuml;, ani hızlanma, meydan okuma, istatistikleri alt &amp;uuml;st etme...',
                    height: "206cm",
                    url: 'http://www.espn.com/nba/player/_/id/1966',
                    photo: 'lebron.gif'
                },
                {
                    name: 'divayt hauvırd',
                    bio: 'o boyla o fudamental hareketleri ​_yapabiliyor olmak, oyun zekası...',
                    height: "206cm",
                    url: 'http://www.espn.com/nba/player/_/id/2384',
                    photo: 'howard.gif'
                }
            ]
        }
    );
});

app.listen(port, function (err) {
    console.log('running server on port ' + port);
});&lt;/pre&gt;
&lt;p&gt;Neler olduğuna kısaca değinelim. Web hizmeti i&amp;ccedil;in express mod&amp;uuml;l&amp;uuml;ne ihtiyacımız var. Bu nedenle bir require bildirimi ile başlıyoruz. epxress mod&amp;uuml;l&amp;uuml;n&amp;uuml; rahat kullanabilmek i&amp;ccedil;in app isimli bir değişken tanımlanıyor ve bir express nesnesi &amp;ouml;rnekleniyor. app.use ve app.set isimli fonksiyon &amp;ccedil;ağırımları &amp;ouml;nemli. use metodunda static dosyalara hizmet verilmesi i&amp;ccedil;in gerekli bildirimleri yapmaktayız.&amp;nbsp;NBA oyuncularının fotoğrafları public/images klas&amp;ouml;r&amp;uuml; altında yer alıyor. Bunları img elementinin src niteliğinde bildirdiğimizde sunucu tarafının ilgili i&amp;ccedil;erikleri bulabilmesi lazım. O nedenle yaptığımız bir bildirim olduğunu ifade edebiliriz&lt;em&gt;(Detaylı bilgi i&amp;ccedil;in &lt;a href="https://expressjs.com/en/starter/static-files.html" target="_blank"&gt;şu adrese&lt;/a&gt; bakabilirsiniz)&lt;/em&gt; İki tane set metot &amp;ccedil;ağrımı s&amp;ouml;z konusu. İlkinde &amp;ouml;ny&amp;uuml;z i&amp;ccedil;eriklerine nereden bakılacağını, ikincisinde Pug'ın g&amp;ouml;r&amp;uuml;nt&amp;uuml;leme motoru olarak kullanılacağını belirtmekteyiz. Bundan sonra tek yaptığımız root adrese gelecek olan talebi y&amp;ouml;netmek.&lt;/p&gt;
&lt;p&gt;app.get('/' metod &amp;ccedil;ağırımındaki callback fonksiyonuna dikkat edelim. Burada index sayfasının ele alınacağı belirtilmekte. &amp;Ouml;ncesinde View Engine olarak da pug belirtildiğinden index.pug HTML formatına&amp;nbsp;&amp;ccedil;evrilerek istemciye g&amp;ouml;nderilecektir. Aslında response değişkeni &amp;uuml;zerinden &amp;ccedil;ağırılan render fonksiyonunda yaptığımız tek şey JSON tipinden bir i&amp;ccedil;erik oluşturmak. Lakin buradaki teams ve players isimli &amp;ouml;zellikler index.pug i&amp;ccedil;erisinde değer kazanmaktalar. Son satırda yer alan listen metodu tahmin edeceğiniz &amp;uuml;zere belirtilen port'tan ilgili web hizmetini yayına almak i&amp;ccedil;in kullanılıyor.&lt;/p&gt;
&lt;p&gt;Biraz da index.pug dosyası i&amp;ccedil;erisine bakalım.&amp;nbsp;Aslında anlaşılması olduk&amp;ccedil;a kolay bir mekanizma s&amp;ouml;z konusu. Kapatma tag'leri yok, &amp;lt; ve &amp;gt; işaretleri yok. Bunların yerine hiyerarşiyi tanımlayabilmek i&amp;ccedil;in girintili bir s&amp;ouml;z dizimi kullanılıyor. Belki bizler i&amp;ccedil;in yeni olabilecek mixin ve for each kullanımları s&amp;ouml;z konusu. Sizden ricam server.js dosyasında yer alan teams ve players isimli dizilerin pug dosyası i&amp;ccedil;erisinde nasıl ele alındığı incelemeniz. Buna ek olarak bir CSS niteliğini ilgili elemente nasıl bağlıyoruz bakmanızı &amp;ouml;neririm. html, head, body, b, p, div gibi elementlerin nasıl kullanıldığını kavradığınızda sizin i&amp;ccedil;in de yazmak olduk&amp;ccedil;a kolaylaşacaktır.&lt;/p&gt;
&lt;p&gt;Pek tabii pug'ın etkin kullanımı i&amp;ccedil;in &lt;a href="https://pugjs.org/api/getting-started.html" target="_blank"&gt;bu adresteki&lt;/a&gt; i&amp;ccedil;eriklere g&amp;ouml;z atmamızda yarar var. mixin olarak oluşturduğumuz div i&amp;ccedil;erisinde oyuncuların bir takım bilgilerini g&amp;ouml;steriyoruz. Basit bir şablon oluşturduk aslında. Bu şablonun verisini ise son satırdaki for d&amp;ouml;ng&amp;uuml;s&amp;uuml; ile doldurmaktayız. Benzer bir d&amp;ouml;ng&amp;uuml; takımların bilgilerini birer liste elementi olarak yazdırırken de kullanılmakta&lt;em&gt;(each team in teams kısmı)&lt;/em&gt; Yani pug dosyasında HTML haricinde javascript gibi kod par&amp;ccedil;alarını da kullanabiliriz. Tek değişen yazım formatı dikkat ettiyseniz.&lt;/p&gt;
&lt;p&gt;Benim i&amp;ccedil;in epey yeni ve farklı bir deneyimdi. Front-end tarafına uzak olmama rağmen pug'ın sunduğu imkanlardan&amp;nbsp;olumlu şekilde etkilendiğimi ifade edebilirim. HTML'e g&amp;ouml;re okunurluğu &amp;ccedil;ok daha kolay olan bir altyapı sağladığı aşikar. Aslında siz bu &amp;ouml;rneği &amp;ccedil;ok daha iyi bir noktaya taşıyabilirsiniz. &amp;Ouml;rneğin oyuncu verilerini ger&amp;ccedil;ek zamanlı bir REST servisinden veya veritabanından &amp;ccedil;ekebilir, &amp;ouml;ny&amp;uuml;z tarafı i&amp;ccedil;in Bootstrap gibi daha şık &amp;ccedil;atılardan yararlanabilirsiniz. Son olarak &amp;ouml;rneği &amp;ccedil;alıştırmak i&amp;ccedil;in terminalden npm start komutunu vermemiz ve herhangi bir tarayıcıdan localhost:65003 adresine gitmemizin yeterli olacağını belirteyim. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2018-07-08 21:30:00</pubDate>
  <slug>Pug-Pug-Pug</slug>
  <tags>
    <tag>nodejs</tag>
    <tag>pug</tag>
    <tag>npm</tag>
    <tag>html</tag>
    <tag>javascript</tag>
    <tag>express</tag>
    <tag>web-programming</tag>
    <tag>pluralsight</tag>
    <tag>mixin</tag>
    <tag>jade</tag>
  </tags>
  <categories>
    <category>Node.js</category>
  </categories>
</post>