<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Heryerden TFS Kullanabilmek</title>
  <description>Microsoft’ un ALM(Application Lifecycle Management) tarafındaki en önemli aracı bilindiği üzere Team Foundation Server ürünüdür. Genellikle Microsoft’ un yazılım geliştirme ürünleri ile haşırneşir olan firmalar TFS’ i ve uygun bir süreç geliştirme metodolojisini seçerek yaşamlarına devam ederler. Bu tip firmalar için karşılaşılabilecek sorunlar daha çok ALM’ in layıkıyla uygulanamayışıdır ki bu aslında hepimizin en büyük sorunudur ve tool’ dan bağımsız bir konudur. Yine de TFS kullanımı ile ilişkili olarak çok daha büyük bir sıkıntı vardır. Entegrasyon</description>
  <content>&lt;p&gt;&lt;a href="/pics/usb-prizi.png"&gt;&lt;img style="margin: 4px 0px; display: inline; float: right;" title="usb-prizi" src="/pics/usb-prizi_thumb.png" alt="usb-prizi" width="240" height="238" align="right" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Yandaki fotoğrafta bir duvar prizi i&amp;ccedil;inden USB bağlantısı yapıldığını ve cep telefonunun şarj edildiğini g&amp;ouml;rmektesiniz. Bir s&amp;uuml;redir hayatımızda olan ilgin&amp;ccedil; buluşlardan birisi de&lt;strong&gt; USB Priz&lt;/strong&gt;&amp;rsquo; ler. Bu aslında USB&amp;rsquo; nin pek &amp;ccedil;ok farklı ortama entegre edilebilmesi anlamına da geliyor. S&amp;ouml;z gelimi bir s&amp;uuml;redir pek &amp;ccedil;ok ara&amp;ccedil; modelin USB &amp;ccedil;ıkışları neredeyse standart. Telefonlarımızı yol boyunca şarj edebiliyoruz. Hatta USB olmayan ara&amp;ccedil;larda, &amp;ccedil;akmaktan gelen enerjiyi &lt;strong&gt;USB&lt;/strong&gt; bağlantısı ile aktaran ara d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;c&amp;uuml;ler bile var.&lt;/p&gt;
&lt;p&gt;Dolayısıyla &amp;ccedil;eşitli ve pek &amp;ccedil;oğu standart hale gelen cihazlar ile USB &amp;ccedil;ıkışları verebilmek m&amp;uuml;mk&amp;uuml;n. Nerden geldik şimdi bu USB Priz konusuna. Hem bir Plug-In gibi g&amp;ouml;r&amp;uuml;lebildiği hem de entegrasyon anlamında sağladığı yetenekleri g&amp;ouml;z &amp;ouml;n&amp;uuml;na alalım.&lt;/p&gt;
&lt;p&gt;Bazen kullandığımız yazılım &amp;uuml;r&amp;uuml;nlerinin de bu tip kolay takılabilir ve entegre olabilir şekilde &amp;uuml;retilmelerini bekleriz. &amp;Ouml;rneğin &lt;strong&gt;TFS&lt;/strong&gt;&amp;rsquo; in sadece &lt;strong&gt;Visual Studio, MS Office, Sharepoint&lt;/strong&gt; vb &amp;uuml;r&amp;uuml;nler ile değil başka başka &amp;uuml;r&amp;uuml;nler ile de &amp;ccedil;alışmasını isteriz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Microsoft&lt;/strong&gt;&amp;rsquo; un &lt;strong&gt;ALM&lt;em&gt;(Application Lifecycle Management)&lt;/em&gt;&lt;/strong&gt; tarafındaki en &amp;ouml;nemli aracı bilindiği &amp;uuml;zere &lt;strong&gt;Team Foundation Server&lt;/strong&gt; &amp;uuml;r&amp;uuml;n&amp;uuml;d&amp;uuml;r. Genellikle &lt;strong&gt;Microsoft&lt;/strong&gt;&amp;rsquo; un yazılım geliştirme &amp;uuml;r&amp;uuml;nleri ile haşırneşir olan firmalar &lt;strong&gt;TFS&lt;/strong&gt;&amp;rsquo; i ve uygun bir s&amp;uuml;re&amp;ccedil; geliştirme metodolojisini se&amp;ccedil;erek yaşamlarına devam ederler. Bu tip firmalar i&amp;ccedil;in karşılaşılabilecek sorunlar daha &amp;ccedil;ok &lt;strong&gt;ALM&lt;/strong&gt;&amp;rsquo; in layıkıyla uygulanamayışıdır ki bu aslında hepimizin en b&amp;uuml;y&amp;uuml;k sorunudur ve &lt;strong&gt;tool&lt;/strong&gt;&amp;rsquo; dan bağımsız bir konudur. Yine de &lt;strong&gt;TFS&lt;/strong&gt; kullanımı ile ilişkili olarak &amp;ccedil;ok daha b&amp;uuml;y&amp;uuml;k bir sıkıntı vardır. Entegrasyon &lt;img class="wlEmoticon wlEmoticon-thinkingsmile" style="border-style: none;" src="/pics/wlEmoticon-thinkingsmile_5.png" alt="Thinking smile" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle &lt;strong&gt;Enterprise&lt;/strong&gt; &amp;ccedil;&amp;ouml;z&amp;uuml;mler &amp;uuml;retmeye &amp;ccedil;alışan, b&amp;uuml;nyesinde 100lerce proje barındırabilen, zaman zaman hantallaşan firmaların, duruma g&amp;ouml;re tercih ettikleri pek &amp;ccedil;ok geliştirme aracı/ortamı s&amp;ouml;z konusudur. Bazı firmalarda, &lt;strong&gt;Oracle&lt;/strong&gt;&amp;rsquo; cıları, &lt;strong&gt;Java&lt;/strong&gt;&amp;rsquo; cıları, &lt;strong&gt;Linux&lt;/strong&gt; &amp;uuml;zerinde &lt;strong&gt;C&lt;/strong&gt; kodları yazanları, yeni nesil uygulamaları &lt;strong&gt;.Net&lt;/strong&gt; ile geliştirenleri sıklıkla g&amp;ouml;rebilirsiniz.&lt;/p&gt;
&lt;p&gt;Hatta daha başka 3nc&amp;uuml; parti ara&amp;ccedil;lar bile s&amp;ouml;z konusu olabilir. Bu yerlerde pek tabi irili ufaklı sayısız ekip de s&amp;ouml;z konusudur. Bu ekipler, kendi i&amp;ccedil;lerinde olduğu gibi şirket bazında da bir uygulama y&amp;ouml;netim s&amp;uuml;recine dahil olmak durumunda kalırlar. Kimi zaman &lt;strong&gt;CMMI&lt;/strong&gt; gibi sıkıcı s&amp;uuml;re&amp;ccedil;ler, kimi zaman da &lt;strong&gt;Scrum&lt;/strong&gt; gibi eğlenceli s&amp;uuml;re&amp;ccedil;ler, sistemin bir par&amp;ccedil;asıdır. İşte b&amp;ouml;yle bir senaryoda firmanın topyek&amp;uuml;n bir karar alarak &lt;strong&gt;TFS&lt;/strong&gt;&amp;rsquo; e ge&amp;ccedil;eceğini hayal ediniz&lt;em&gt;(ve tabi gelen tepkileri, direnci de haya ediniz)&lt;/em&gt;. Aslında hayal etmenize gerek yok. Yapanlar var &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_172.png" alt="Winking smile" /&gt; Bu durumda entegrasyon son derece &amp;ouml;nemli bir hale gelmektedir.&lt;/p&gt;
&lt;p&gt;İşte bu yazımızda &lt;strong&gt;TFS&lt;/strong&gt;&amp;rsquo; in bize yabancı gelebilecek bazı geliştirme ortamları ile olan entegrasyonunu incelemeye &amp;ccedil;alışıyor olacağız.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Microsoft&lt;/strong&gt;, &lt;strong&gt;TFS&lt;/strong&gt;&amp;rsquo; in &amp;ccedil;evre &amp;uuml;r&amp;uuml;nler&lt;em&gt;(Visual Studio harici diyebiliriz)&lt;/em&gt; ile olan entegrasyonunda i&amp;ccedil;in 3 &amp;ouml;nemli &amp;ccedil;&amp;ouml;z&amp;uuml;m sunmaktadır. Temel prensip &lt;strong&gt;Team Explorer&lt;/strong&gt;&amp;rsquo; a ait arabirimlerin bir şekilde diğer ara&amp;ccedil;lara takılabilmesidir&lt;em&gt;(Plug-In, Add-In vb olacak şekilde)&lt;/em&gt;&amp;nbsp; Yazının bundan sonraki kısımlarında ilgili ara&amp;ccedil;ları ve &amp;ouml;zellikle &amp;ccedil;eşitli arabirimler ile olan entegrasyonlarını mercek altına alıyor olacağız. Sloganımsı ada sahip olan &amp;uuml;r&amp;uuml;n ile işe başlayalım.&lt;/p&gt;
&lt;h1&gt;Team Explorer Everywhere&lt;/h1&gt;
&lt;p&gt;&amp;Ouml;zellikle &lt;strong&gt;Eclipse&lt;/strong&gt; gibi &lt;strong&gt;IDE&lt;/strong&gt;&amp;rsquo; lerin, &lt;strong&gt;Team Explorer&lt;/strong&gt; arabirimine sahip olması ve &lt;strong&gt;TFS&lt;/strong&gt; ile entegre &amp;ccedil;alışabilmesi i&amp;ccedil;in kullanılmaktadır. &lt;a href="http://www.microsoft.com/en-us/download/details.aspx?id=30661" target="_blank"&gt;Bu adresten&lt;/a&gt; indirilebilen &amp;uuml;r&amp;uuml;n&amp;uuml;n ayrıca diğer platformlar i&amp;ccedil;in komut satırından &amp;ccedil;alışabilen bir versiyonu da bulunmaktadır. Peki, &amp;ouml;rneğin &lt;strong&gt;Eclipse Juno&lt;/strong&gt; ile bu entegrasyonu nasıl ger&amp;ccedil;ekleştirebiliriz? Gelin adım adım ilerleyelim.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bazı geliştirme ortamları, Eclipse IDE&amp;rsquo; sini kabuk olarak kullanır. &amp;Ouml;rneğin Business Process Management ara&amp;ccedil;larından birisi olan TIBCO Business Studio &amp;ouml;rnek olarak verilebilir. Bu tip ara&amp;ccedil;lar da Eclipse IDE&amp;rsquo; sini baz aldıklarından Team Explorer Everywhere ile TFS&amp;rsquo; e ve doğal olarak ALM s&amp;uuml;re&amp;ccedil;lerine dahil olabilirler. En azından TIBCO tarafı i&amp;ccedil;in bunu test ettiğimi rahatlıkla ifade edebilirim &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_172.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;Eclipse Juno&lt;/h1&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;Eclipse Juno IDE&lt;/strong&gt;&amp;rsquo; si &amp;uuml;zerinden &lt;strong&gt;Help&lt;/strong&gt; men&amp;uuml;s&amp;uuml;ne girip buradan &lt;strong&gt;Install New Software&lt;/strong&gt; se&amp;ccedil;eneğini işaretlemeliyiz. Gelen arabirim de&lt;strong&gt; Work With&lt;/strong&gt; kutucuğuna &lt;a href="http://dl.microsoft.com/eclipse/tfs/"&gt;http://dl.microsoft.com/eclipse/tfs/&lt;/a&gt; adresine gitmemiz yeterlidir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/tfsint_4.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="tfsint_4" src="/pics/tfsint_4_thumb.png" alt="tfsint_4" width="563" height="508" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Microsoft&lt;/strong&gt; sunucularına gidilecek ve &lt;strong&gt;Team Explorer&lt;/strong&gt;&amp;rsquo; ın kullanmakta olduğumuz &lt;strong&gt;Eclipse IDE&lt;/strong&gt;&amp;rsquo; sine uygun olan versiyonu &amp;ccedil;ekilecektir. &lt;strong&gt;Team Foundation Server Plug-in for Eclipse&lt;/strong&gt; se&amp;ccedil;imi yapıldıktan sonra &lt;strong&gt;Next&lt;/strong&gt; ile ilerlenip kurulum işlemi tamamlanır.&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil; olarak &lt;strong&gt;Eclipse IDE&lt;/strong&gt;&amp;rsquo; sinde &lt;strong&gt;Visual Studio&lt;/strong&gt;&amp;rsquo; dan aşina olduğumuz &lt;strong&gt;Team Explorer&lt;/strong&gt; penceresi oluşacaktır. Buradan &amp;ccedil;ok doğal olarak bir &lt;strong&gt;TFS&lt;/strong&gt; sunucuna bağlanılabilir ve bir &lt;strong&gt;Team Project&lt;/strong&gt;&amp;rsquo; e dahil olunabilir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/tfsint_5.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="tfsint_5" src="/pics/tfsint_5_thumb.png" alt="tfsint_5" width="634" height="653" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Eclipse&lt;/strong&gt; kurulumunda yaşanabilecek sıkıntılardan biriside internet bağlantısı olmayan bir ortamda bu işin nasıl ger&amp;ccedil;ekleştirilebileceğidir. Bu durumda bir şekilde yine &lt;strong&gt;download&lt;/strong&gt; sayfasından &lt;strong&gt;TFSEclipsePlugin-UpdateSiteArchive-11.0.0.1212.zip&lt;/strong&gt; dosyasının indirilmesi ve bu kez &lt;strong&gt;Install-&amp;gt;Add&lt;/strong&gt; kısmında aşağıdaki gibi ilgili dosyanın se&amp;ccedil;ilerek eklenmesi yeterli olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/tfsint_6.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="tfsint_6" src="/pics/tfsint_6_thumb.png" alt="tfsint_6" width="611" height="632" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Eclipse IDE&amp;rsquo; leri arasında Install adımları i&amp;ccedil;in farklılıklar olabilir. Test ettiğim IDE&amp;rsquo; lerden birisinde Install Software penceresinde iki farklı tab bulunmaktaydı. &amp;Ouml;nce Available Software kısmından ilgili Team Explorer Everywhere &amp;uuml;r&amp;uuml;n&amp;uuml;n&amp;uuml; bulmak&lt;em&gt;(local file veya url ile)&lt;/em&gt; sonrasında Installed Software tabına ge&amp;ccedil;erek ilgili versiyonu se&amp;ccedil;tikten sonra Install işlemini uygulamak mecburiyetinde kalmıştım. Son test ettiğim g&amp;uuml;ncel Eclipse Juno &amp;uuml;r&amp;uuml;n&amp;uuml;nde ise bu işlem tek adıma indirilmişti.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Peki ya &lt;strong&gt;Team Explorer IDE&lt;/strong&gt;&amp;rsquo; sine sahip olamayacak farklı geliştirme ortamları s&amp;ouml;z konusu olursa ne yapacağız?&lt;/p&gt;
&lt;h1&gt;MSSCCI Provider&lt;/h1&gt;
&lt;p&gt;&amp;Ouml;zellike &lt;strong&gt;Team Explorer&lt;/strong&gt; desteği bulunmayan&lt;em&gt;(ya da entegre edilemeyen)&lt;/em&gt;&amp;nbsp;&lt;strong&gt;IDE&lt;/strong&gt; ve ortamlar i&amp;ccedil;in geliştirilmiş olan bu sağlayıcı, esasında bir &lt;strong&gt;Source Code Control API&lt;/strong&gt;&amp;rsquo; si olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. &lt;a href="http://visualstudiogallery.msdn.microsoft.com/bce06506-be38-47a1-9f29-d3937d3d88d6" target="_blank"&gt;Bu adresten&lt;/a&gt; indirebileceğiniz &lt;strong&gt;Provider&lt;/strong&gt;&amp;rsquo; ın benim incelediğim s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml;n g&amp;uuml;ncel olarak desteklediği &lt;strong&gt;IDE&lt;/strong&gt;&amp;rsquo; ler aşağıdaki gibidiydi.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Visual Studio .NET 2003&lt;/li&gt;
&lt;li&gt;Visual C++ 6 SP6&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/li&gt;
&lt;li&gt;Visual Visual Basic 6 SP6&amp;nbsp;&amp;nbsp;&lt;/li&gt;
&lt;li&gt;Visual FoxPro 9 SP2&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/li&gt;
&lt;li&gt;Microsoft Access 2007&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/li&gt;
&lt;li&gt;SQL Server Management Studio&lt;/li&gt;
&lt;li&gt;Enterprise Architect 7.5&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/li&gt;
&lt;li&gt;PowerBuilder 11.5&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/li&gt;
&lt;li&gt;Microsoft eMbedded VC++ 4.0&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Hımmm g&amp;uuml;zel bir listeye benziyor. Sanırım ilk dikkati &amp;ccedil;ekenlerden birisi de&lt;strong&gt; PowerBuilder 11.5&lt;/strong&gt; &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_172.png" alt="Winking smile" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Peki ya elinizde &amp;ccedil;ok daha eski bir s&amp;uuml;r&amp;uuml;m var ise. Ya bu s&amp;uuml;r&amp;uuml;m &amp;uuml;zerinde geliştirilmiş onlarca uygulama bulunmaktaysa ve daha uzun bir s&amp;uuml;re hayatta olacaklar ise. Ya &lt;strong&gt;.Net&lt;/strong&gt; tabanlı geliştirme yapanların bu ortamda geliştirilen arabirimleri de kullanması s&amp;ouml;z konusu ise. Ya her iki ortamda &lt;strong&gt;ALM&lt;/strong&gt; &amp;uuml;zerinden takip edilmek zorunda ise. &amp;Ouml;rneğin elinizde &lt;strong&gt;PowerBuilder&lt;/strong&gt;&amp;rsquo; ın &lt;strong&gt;9.0.3&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml; olduğunu d&amp;uuml;ş&amp;uuml;n&amp;uuml;n.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;MSSCCI Provider&amp;rsquo; ın y&amp;uuml;klenmesi sırasında makinede en azından Visual Studio Team Explorer&amp;rsquo; ın y&amp;uuml;kl&amp;uuml; olması gerekmektedir. Ayrıca &amp;uuml;r&amp;uuml;n&amp;uuml;n versiyonu da &amp;ouml;nemlidir. &amp;Ouml;rneğin, TFS 2012 ile entegre olunacak ise MSSCCI Provider&amp;rsquo; ın 2012 s&amp;uuml;r&amp;uuml;m&amp;uuml; kullanılmalıdır.&lt;/p&gt;
&lt;p&gt;Bir diğer &amp;ouml;n gereklilik de şudur. Diyelim ki developer makinesinde Visual Studio 2010 da bulunmakta ve yine aynı makine de yer alan SQL Navigator ile TFS 2012&amp;rsquo; ye bağlanılmak isteniyor. MSSCCI Provider&amp;rsquo; ın 2012 s&amp;uuml;r&amp;uuml;m&amp;uuml; y&amp;uuml;klenirken uyarı mesajı alınacak ve Team Explorer&amp;rsquo; ın y&amp;uuml;klenmesi istenecektir. Dolayısıyla 2012 tabanlı bir TFS ortamında, MSSCCI Provider 2012 ve Team Explorer 2012 olmalıdır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;PowerBuilder&lt;/h1&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;MSSCCI&lt;/strong&gt; &lt;strong&gt;Provider&amp;rsquo;&lt;/strong&gt; ın &lt;strong&gt;PowerBuilder&amp;rsquo;&lt;/strong&gt; ın bulunduğu ortama y&amp;uuml;klenmesi gerekmektedir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Bazen kalabalık ekiplerin yer aldığı firmalarda, geliştiricilerin bir program install etmeye yetkisi olmaz. B&amp;ouml;yle bir durumda gerekli t&amp;uuml;m makinelere sistem ekibi tarafından Update ge&amp;ccedil;ilir. Ya da geliştirici makinelerinde uzaktan bağlanılarak sessiz modda bir kurulum&lt;em&gt;(Slient Install)&lt;/em&gt; işlemi yapılır. Bu noktada msi tipinden bir setup dosyasının sessiz modda nasıl &amp;ccedil;alıştırılacağı da &amp;ouml;nemlidir. İşte MSSCCI Provider i&amp;ccedil;in &amp;ouml;rnek bir kullanım şekli.&lt;/p&gt;
&lt;p&gt;&lt;span style="color: #ff0000;"&gt;msiexec /i"Visual Studio Team Foundation Server 2012 MSSCCI Provider (32-bit).msi" /quiet /norestart&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;Buna g&amp;ouml;re MSSCCI provider bir aray&amp;uuml;z g&amp;ouml;stermeden arka planda otomatik olarak varsayılan ayarları ile kurulacaktır. /quiet parametresi bunun i&amp;ccedil;in kullanılmaktadır. Tahmin edileceği &amp;uuml;zere /norestart parametresi sayesinde de, ilgili kurulum işlemi sonrası makinede bir restart yaptırılmaması sağlanmaktadır. Elbetteki başrol oyuncusu msiexec aracıdır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;PowerBuilder &lt;/strong&gt;gibi ortamların &lt;strong&gt;TFS&lt;/strong&gt; ile ortak &amp;ccedil;alışması &lt;strong&gt;Eclipse&lt;/strong&gt;&amp;rsquo; de olduğu gibi değildir. Aslında &lt;strong&gt;MSSCCI&lt;/strong&gt; sağlaycısını kullanan &amp;uuml;r&amp;uuml;nlerin &lt;strong&gt;TFS&lt;/strong&gt; ile &amp;ccedil;alışmaları olduk&amp;ccedil;a farklı olabilmektedir. &amp;Ouml;rneğin &lt;strong&gt;Powerbuilder&amp;rsquo;&lt;/strong&gt; da &lt;strong&gt;Workspace&lt;/strong&gt;&amp;rsquo; ler ile &amp;ccedil;alışılmaktadır&lt;em&gt;(Powerbuilder uzmanı değilim onu belirteyim) &lt;/em&gt;Bu sebepten bir &lt;strong&gt;Workspace&lt;/strong&gt;&amp;rsquo; in &lt;strong&gt;TFS&lt;/strong&gt; &amp;uuml;zerindeki bir &lt;strong&gt;Team Project&amp;rsquo;&lt;/strong&gt; e hatta bir &lt;strong&gt;Branch&lt;/strong&gt;&amp;rsquo; a dahil edilmesi i&amp;ccedil;in &lt;strong&gt;Properties&lt;/strong&gt; kısmına gidilmesi ve &lt;strong&gt;Source Control&lt;/strong&gt; tabında gerekli ayarların yapılması gerekir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/tfsint_7.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="tfsint_7" src="/pics/tfsint_7_thumb.png" alt="tfsint_7" width="640" height="576" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Eğer provider y&amp;uuml;klendiyse &lt;strong&gt;Source Control System&lt;/strong&gt; listesinde de &amp;ccedil;ıkacaktır. &amp;Ccedil;ok doğal olarak &lt;strong&gt;PowerBuilder &lt;/strong&gt;geliştiricisi, &lt;strong&gt;TFS&lt;/strong&gt; &amp;uuml;zerindeki projeye giderken bir kullanıcı adı ile hareket etmelidir. Bu sepebten projede uygun rolde olması şarttır&lt;em&gt;(Contributor olur, Project Administrator olur vs&lt;/em&gt;) Dolayısıyla &lt;strong&gt;User ID&lt;/strong&gt; kısmında &lt;strong&gt;domainaı/kullanıcıadı&lt;/strong&gt; gibi bir bildirim yapılmalıdır. &lt;strong&gt;Project&lt;/strong&gt; kısmı ise en sevdiğim taraflardan birisidir. Burada 3 nokta butonuna basıldıktan sonra &lt;strong&gt;TFS&lt;/strong&gt; sunucunun adresinin sorulduğu bir pencere ile karşılaşılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/tfsint_8.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="tfsint_8" src="/pics/tfsint_8_thumb.png" alt="tfsint_8" width="537" height="651" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Eğer sistemde y&amp;uuml;kl&amp;uuml; bir &lt;strong&gt;Visual Studio&lt;/strong&gt; &amp;uuml;r&amp;uuml;n&amp;uuml; varsa ve daha &amp;ouml;nceden &amp;ccedil;eşitli &lt;strong&gt;TFS&lt;/strong&gt; sunucularına bağlanıldıysa, bu durumda ilgili &lt;strong&gt;Server&lt;/strong&gt; listesinin bu pencerelerde de &amp;ccedil;ıktığı g&amp;ouml;r&amp;uuml;lecektir. İstenirse &lt;strong&gt;Add&lt;/strong&gt; d&amp;uuml;ğmesi ile yeni bir &lt;strong&gt;TFS&lt;/strong&gt; sunucu adresinin bildirimi de pekala yapılabilir.&lt;/p&gt;
&lt;p&gt;Sunucu se&amp;ccedil;imi yapıldıktan sonra ise &lt;strong&gt;Choose Folder in Team Foundation Server&lt;/strong&gt; isimli bir diğer pencere a&amp;ccedil;ılacaktır. Burada ise &lt;strong&gt;Team Project&lt;/strong&gt;&amp;rsquo; in ve ilgili klas&amp;ouml;r&amp;uuml;n&lt;em&gt;(hatta &amp;ccedil;oğunlukla Branch&amp;rsquo; in)&lt;/em&gt; se&amp;ccedil;ilmesi yeterli olacaktır. T&amp;uuml;m bu işlemler sonrasında &lt;strong&gt;Workspace&lt;/strong&gt;&amp;rsquo; in belirtilen&lt;strong&gt; TFS Branch&amp;rsquo;&lt;/strong&gt; ine dahil edilmesi işlemi de tamamlanmış olmaktadır. Eğer herşey yolunda gittiyse ve doğru ayarlamaları yaptıysanız bir &lt;strong&gt;Workspace&lt;/strong&gt;&amp;rsquo; in &amp;ouml;ğelerinde aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len &amp;ouml;zelliklere ulaşılabildiğini fark edebilirsiniz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/tfsint_9.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="tfsint_9" src="/pics/tfsint_9_thumb.png" alt="tfsint_9" width="354" height="458" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Şimdi bakış a&amp;ccedil;ımızı yine eskilerden birisine &amp;ccedil;evirelim.&lt;/p&gt;
&lt;h1&gt;SQL Navigator for Oracle 6.5.&lt;/h1&gt;
&lt;p&gt;&amp;Ouml;ncelikli olarak &lt;strong&gt;Team Coding&lt;/strong&gt; men&amp;uuml;s&amp;uuml;nden &lt;strong&gt;Connection Settings&lt;/strong&gt; kısmına girilir. Eğer &lt;strong&gt;MSSCCI&lt;/strong&gt; y&amp;uuml;kl&amp;uuml;yse burada &lt;strong&gt;SCC: Microsoft Team Foundation Server MSSCCO Provider&lt;/strong&gt; ismi ile listelenecektir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/tfsint_10.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="tfsint_10" src="/pics/tfsint_10_thumb.png" alt="tfsint_10" width="411" height="433" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Bu se&amp;ccedil;im yapıldıktan sonra ise yine &lt;strong&gt;Team Coding&lt;/strong&gt; men&amp;uuml;s&amp;uuml;nden &lt;strong&gt;Code Control Groups&lt;/strong&gt;&amp;rsquo; a ge&amp;ccedil;ilerek yeni bir kod kontrol grubunun eklenmesi adımına ge&amp;ccedil;ilir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/tfsint_11.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="tfsint_11" src="/pics/tfsint_11_thumb.png" alt="tfsint_11" width="637" height="380" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Grup adının girilmesi haricinde en &amp;ouml;nemli kısım tahmin edileceği &amp;uuml;zere &lt;strong&gt;Project Name&lt;/strong&gt; se&amp;ccedil;imidir. Burada yine &lt;strong&gt;PowerBuilder &lt;/strong&gt;implementasyonunda olduğu gibi bir &lt;strong&gt;TFS&lt;/strong&gt; sunucusunun se&amp;ccedil;imi ile başlayan adımlar yer almaktadır. Sunucu se&amp;ccedil;iminin ardından yine &lt;strong&gt;Team Project&lt;/strong&gt;&amp;rsquo; in ve &lt;strong&gt;Branch&lt;/strong&gt;&amp;rsquo; in işaretlenmesi gerekmektedir. Sonrasında ise bir &lt;strong&gt;Working Directory&lt;/strong&gt; belirtilmelidir.&lt;/p&gt;
&lt;p&gt;Buraya kadarki işlemler tamamlansa da yeterli değildir &lt;img class="wlEmoticon wlEmoticon-confusedsmile" style="border-style: none;" src="/pics/wlEmoticon-confusedsmile_28.png" alt="Confused smile" /&gt; Bir de &lt;strong&gt;Mask&lt;/strong&gt; belirtilmesi ve &lt;strong&gt;Source Code&lt;/strong&gt; &lt;strong&gt;Control&lt;/strong&gt; operasyonlarının ilgili &lt;strong&gt;Oracle&lt;/strong&gt; şemasındaki hangi nesneler i&amp;ccedil;in yapılacağının belirtilmesi gerekir. Bunun i&amp;ccedil;in oluşturulan grup &amp;ccedil;ift tıklanır ve a&amp;ccedil;ılan arabirimden&lt;strong&gt; Add DB Object Mask&lt;/strong&gt; se&amp;ccedil;imi yapılır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/tfsint_12.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="tfsint_12" src="/pics/tfsint_12_thumb.png" alt="tfsint_12" width="630" height="423" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekte ilgili şemada yer alan herhangibir &lt;strong&gt;Procedure&lt;/strong&gt;&amp;rsquo; &amp;uuml;n ele alınacağı ifade edilmektedir. Bu işlemi de tamamladıktan sonra grub adı se&amp;ccedil;ilerek istenirse &lt;strong&gt;Export to VCS&lt;/strong&gt; ile&lt;strong&gt; Mask&amp;rsquo;&lt;/strong&gt; a uygun olarak &amp;ccedil;ıkan listeden nesne se&amp;ccedil;imleri yapılabilir. Bu kalabalık bir &lt;strong&gt;Procedure &lt;/strong&gt;topluluğunda sadece işaretli olanların&lt;strong&gt; Source Code Control&lt;/strong&gt; ile ele alınması a&amp;ccedil;ısından işe yarar bir &amp;ouml;zellik olabilir&lt;em&gt;(Denemedim deneyiniz)&lt;/em&gt; Artık Navigator &lt;strong&gt;IDE&lt;/strong&gt;&amp;rsquo; sinde &amp;ccedil;alışırken &lt;strong&gt;Procedure&lt;/strong&gt;&amp;rsquo; lerin &lt;strong&gt;Check-In/Check-Out &lt;/strong&gt;edilmesi m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Hatta &lt;strong&gt;Get Latest Version&lt;/strong&gt; &amp;ouml;zellikleri dahi &amp;ccedil;alışacaktır. Zaten projeyi ilişkilendirirken &lt;strong&gt;Branch&lt;/strong&gt; se&amp;ccedil;imini de yapmıştık ve doğal olarak yapılanların hangi &lt;strong&gt;branch&lt;/strong&gt; &amp;uuml;zerinde olacağı da bellidir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/tfsint_13.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="tfsint_13" src="/pics/tfsint_13_thumb.png" alt="tfsint_13" width="443" height="329" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Kurulum aşamalarında değinmedik ancak her hangibir &lt;strong&gt;IDE&lt;/strong&gt;&amp;rsquo; deki bir &amp;ouml;ğenin &lt;strong&gt;Check-In&lt;/strong&gt;&amp;rsquo; lenmesi sırasında &amp;ccedil;ok tanıdık bir arabirim ile karşılaşılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/tfsint_14.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="tfsint_14" src="/pics/tfsint_14_thumb.png" alt="tfsint_14" width="638" height="559" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Edindiğim bu araştırma tecr&amp;uuml;beleri sonucunda aşağıdaki &amp;uuml;r&amp;uuml;nleri &lt;strong&gt;TFS 2012&lt;/strong&gt;&amp;rsquo; ye entegre edebildiğimi ve &lt;strong&gt;ALM&lt;/strong&gt; i&amp;ccedil;erisinde &amp;ccedil;alışabildiğimi g&amp;ouml;rd&amp;uuml;m. &amp;Uuml;stelik &amp;ccedil;oğu olduk&amp;ccedil;a eski s&amp;uuml;r&amp;uuml;mler olmasına rağmen.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;SQL Navigator for Oracle 6.5&lt;/li&gt;
&lt;li&gt;Powerbuilder 9.0.3&lt;/li&gt;
&lt;li&gt;TIBCO Business Studio 3.4&lt;/li&gt;
&lt;li&gt;Eclipse Juno 4.2.1&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Tabi kafa da bazı sorular mutlaka oluşacaktır. &amp;Ouml;zellikle Branch&amp;rsquo; lerin Merge edilmeleri noktasında. Şunu a&amp;ccedil;ık&amp;ccedil;a ifade edelim ki aslında projenin ana y&amp;ouml;neticisi Visual Studio arabirimine ait olan Team Explorer b&amp;ouml;l&amp;uuml;m&amp;uuml; Source Code Explorer&amp;rsquo; dır Dolayısıyla Merging gibi bazı y&amp;ouml;netimsel operasyonlar zaten bu IDE &amp;uuml;zerinden yapılır/yapılmalıdır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/tfsint_15.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="tfsint_15" src="/pics/tfsint_15_thumb.png" alt="tfsint_15" width="585" height="311" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Anlattıklarımız &lt;strong&gt;TFS&lt;/strong&gt;&amp;rsquo; in, &lt;strong&gt;Microsoft&lt;/strong&gt; dışı veya eski &lt;strong&gt;Microsoft&lt;/strong&gt; &amp;uuml;r&amp;uuml;nlerinin tamamı ile entegre olabileceğini ifade etmese de ucundan da olsa bir t&amp;uuml;me varım ispatını ger&amp;ccedil;ekleştirdiğimizi ifade edebiliriz.&lt;/p&gt;
&lt;p&gt;Yazının bu kısmına geldiyseniz eğer kafanızda bir soru da oluşmuş olabilir. &lt;strong&gt;3nc&amp;uuml; &amp;ccedil;&amp;ouml;z&amp;uuml;m nedir?&lt;/strong&gt; &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile_172.png" alt="Winking smile" /&gt;&lt;/p&gt;
&lt;h1&gt;LINUX/UNIX/MAC OS X Tarafı&lt;/h1&gt;
&lt;p&gt;Aslında 3nc&amp;uuml; &amp;ccedil;&amp;ouml;z&amp;uuml;m &lt;strong&gt;Windows&lt;/strong&gt; dışı işletim sistemlerini daha fazla ilgilendirmektedir. &amp;Ouml;rneğin &lt;strong&gt;SOLARIS SPARC&lt;/strong&gt; sistemi veya &lt;strong&gt;RED HAT &lt;/strong&gt;y&amp;uuml;kl&amp;uuml; bir &lt;strong&gt;LINUX&lt;/strong&gt; sistemi s&amp;ouml;z konusu olabilir. Pek tabi bu platformlar &amp;uuml;zerinde yapılan geliştirmelerde komut satırı yaygın olarak kullanılmakta ve hatta ağırlıklı olarak &lt;strong&gt;C&lt;/strong&gt; kodları geliştirilmektedir. Hal b&amp;ouml;yle olunca &lt;strong&gt;TFS&lt;/strong&gt; ile olan entegrasyon kocaman bir soru işerati olarak g&amp;ouml;r&amp;uuml;nmektedir. İşte 3nc&amp;uuml; &amp;ccedil;&amp;ouml;z&amp;uuml;m bu konu ile ilintilidir. &lt;strong&gt;Git-tf&lt;/strong&gt; &lt;img class="wlEmoticon wlEmoticon-surprisedsmile" style="border-style: none;" src="/pics/wlEmoticon-surprisedsmile_4.png" alt="Surprised smile" /&gt;&lt;/p&gt;
&lt;p&gt;Sanırım adı siz de bir &amp;ccedil;ağırışım yapmıştır. &lt;strong&gt;Git&lt;/strong&gt; ile &lt;strong&gt;Team Foundation Server&lt;/strong&gt;&amp;rsquo; ın arasında bir k&amp;ouml;pr&amp;uuml; g&amp;ouml;revi g&amp;ouml;ren bu ara&amp;ccedil;, &lt;strong&gt;Codeplex&lt;/strong&gt; &amp;uuml;zerinden sunulan bir projedir. &lt;a href="http://gittf.codeplex.com/" target="_blank"&gt;Bu adresten&lt;/a&gt; ulaşabilen proje, &lt;strong&gt;27 Ağustos 2012&lt;/strong&gt;&amp;rsquo; de ilk stable s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; de &amp;ccedil;ıkartmıştır. Hen&amp;uuml;z testlerini yapamadım ama ana sayfada da bahsedildiği &amp;uuml;zere &lt;strong&gt;Linux&lt;/strong&gt; ve&lt;strong&gt; Mac OS X&lt;/strong&gt; platformlarında kurulabilen&lt;em&gt;(nitekim Java Runtime &amp;uuml;zerinde &amp;ccedil;alışmakta olan)&lt;/em&gt; bir &amp;uuml;r&amp;uuml;n. &amp;Uuml;stelik komut satırından &amp;ccedil;alıştırılabildiği i&amp;ccedil;in &lt;strong&gt;Linux/Unix&lt;/strong&gt; tarafında &amp;ccedil;alışan geliştiriciler i&amp;ccedil;in de olduk&amp;ccedil;a kullanışlı. Bu konuda ilk testleri yaptığımda sanıyorum ki burayı g&amp;uuml;ncelliyor olacağım. &lt;em&gt;(Şimdilik kurulum ve diğer detaylarla ilişkili olarak Microsoft&amp;rsquo; un yayınladığı &lt;/em&gt;&lt;a href="https://www.google.com.tr/url?sa=t&amp;amp;rct=j&amp;amp;q=&amp;amp;esrc=s&amp;amp;source=web&amp;amp;cd=3&amp;amp;ved=0CEAQFjAC&amp;amp;url=http%3A%2F%2Fdownload.microsoft.com%2Fdownload%2FA%2FE%2F2%2FAE23B059-5727-445B-91CC-15B7A078A7F4%2FGit-TF_GettingStarted.html&amp;amp;ei=spbuULFbzNCyBueugNgJ&amp;amp;usg=AFQjCNEHn0PqmiDDtfdO_b45A-WPovulEA&amp;amp;sig2=6zA7olBg18UM62tY4W4B9Q&amp;amp;bvm=bv.1357700187,d.Yms" target="_blank"&gt;&lt;em&gt;şu d&amp;ouml;k&amp;uuml;mana bir g&amp;ouml;z atabilirsini&lt;/em&gt;&lt;/a&gt;z&lt;em&gt;)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="color: #ff0000;"&gt;&lt;strong&gt;Red Hat Linux&amp;rsquo; testi gelecek[Hen&amp;uuml;z yazılmadı]&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;Bu makalemizde &lt;strong&gt;Team Foundation Server&lt;/strong&gt;&amp;rsquo; ın &amp;ccedil;evre &lt;strong&gt;IDE&lt;/strong&gt;&amp;rsquo; ler ile olan entegrasyonunu incelemeye &amp;ccedil;alıştık ve bu konuda başarılı olduğunu g&amp;ouml;rd&amp;uuml;k. Ancak pek tabiki proje geliştirmek ve &amp;ouml;zellikle &lt;strong&gt;ALM&lt;/strong&gt; akışlarının doğru ve sorunsuz bir şekilde y&amp;uuml;r&amp;uuml;t&amp;uuml;lmesini sağlamak, sadece kullanılan ara&amp;ccedil;ların entegre edilmesi ile olacak bir iş değildir. Dolayısıyla olayın farklı bir boyutu olduğunu da g&amp;ouml;zden ka&amp;ccedil;ırmamak gerekir. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2013-03-02 08:50:00</pubDate>
  <slug>Heryerden-TFS-Kullanabilmek</slug>
  <tags>
    <tag>tfs</tag>
    <tag>team-explorer-everywhere</tag>
    <tag>msscci-provider</tag>
    <tag>sql-navigator</tag>
    <tag>oracle</tag>
    <tag>java</tag>
    <tag>eclipse</tag>
    <tag>team-foundation-server</tag>
    <tag>branch</tag>
    <tag>checkin</tag>
    <tag>checkout</tag>
  </tags>
  <categories>
    <category>Team Foundation Server</category>
  </categories>
</post>