<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Servis Çıktılarını Plotly.js ile Grafikleştirmek</title>
  <description>West-World'de eğlence tüm hızı ile devam ediyor. Bu geceki "Easy Graphics of new Era" isimli partinin onur konuğu ise açık kaynak javascript grafik kütüphanesi Plotly. Oldukça renkli bir kişiliğe sahip olan plotly github şehrinin de en sevilen karakterlerinden birisi. Kendisini West-World'e getirense en yakın arkadaşları D3.js ve WebGL. Ona West-World sakinleri adına bir soru yönelttik ve izleyicilerini nasıl büyülediğini sorduk. Enerjik ve içten uslübuyla "dans figürlerimi çalışırken çoğunlukla JSON ve CSV melodilerinden ilham alıyorum. Kareografide uzun zamandarı Mr. jQuery ile ilerliyorum. Ayrıca Node'un bana sağladığı içsel motivasyondan bahsetmeden geçemem. Hepsi içimde harika bir karmanın oluşmasına neden oluyor. Sonuç gülümseyen ve ritmime uymaya çalışan insanların ortaya çıkarttığı müthiş enerji" diyor...</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/11/plotly_02.jpg" alt="" /&gt;West-World'de eğlence t&amp;uuml;m hızı ile devam ediyor. Ge&amp;ccedil;en ay ger&amp;ccedil;ekleştirdiğimiz "C64 Retro" partisinden sonra sıra bu geceki "Easy Graphics of new Era"&amp;nbsp;adlı&amp;nbsp;eğlenceye geldi. Onur konuğumuz a&amp;ccedil;ık kaynak Javascript d&amp;uuml;nyasının son zamanlardaki y&amp;uuml;kselek yıldızı olarak g&amp;ouml;r&amp;uuml;len grafik k&amp;uuml;t&amp;uuml;phanesi Plotly. Olduk&amp;ccedil;a renkli bir kişiliğe sahip olan Plotly, GitHub şehrinin de en sevilen karakterlerinden birisi haline gelmiş durumda. Şehrin devasa enerji santrallerinin &amp;uuml;rettiği verilerle &amp;ccedil;alışan &amp;ccedil;ılgın istatistik&amp;ccedil;ileri arasında da &amp;ccedil;ok pop&amp;uuml;ler bir karakter. Kendisini West-World'e getiren en yakın destek&amp;ccedil;ileri D3.js ve WebGL'de partiye renk katanlar arasındalar.&lt;/p&gt;
&lt;p&gt;Ona West-World sakinleri adına bir soru y&amp;ouml;nelttik ve izleyicilerini nasıl b&amp;ouml;ylesine inanılaz şekilde b&amp;uuml;y&amp;uuml;lediğini sorduk. Her zaman ki enerjisi ve i&amp;ccedil;ten usl&amp;uuml;buyla "dans fig&amp;uuml;rlerimi &amp;ccedil;alışırken &amp;ccedil;oğunlukla JSON ve CSV melodilerinden ilham alıyorum. Kareografide uzun zamandır Mr. jQuery ile ilerliyorum. Ayrıca Node'un bana sağladığı i&amp;ccedil;sel motivasyondan bahsetmeden ge&amp;ccedil;emem. Her isteğimi bekletmeden ve hızla karşılıyor. Hepsi i&amp;ccedil;imde harika bir karmanın oluşmasına neden olmakta. Sonu&amp;ccedil;, g&amp;uuml;l&amp;uuml;mseyen ve ritmime uymaya &amp;ccedil;alışan insanların ortaya &amp;ccedil;ıkarttığı m&amp;uuml;thiş bir dans g&amp;ouml;sterisi..." diyor.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Pek hayalimdeki gibi bir West-World partisi olmasa da sonu&amp;ccedil;ta aşağıdaki &amp;ccedil;ıktıya ulaşmak istediğimi ifade edebilirim esasında. Plotly.js k&amp;uuml;t&amp;uuml;phanesi ile &amp;ccedil;ok fazla &amp;ccedil;alışmışlığım yok. Projemizdeki belirli ihtiya&amp;ccedil;lar nedeniyle javascript tabanlı bir grafik k&amp;uuml;t&amp;uuml;phanesi araştırırken onunla karşılaştım. &amp;Ouml;zellikle basitliği, geniş grafik yelpazesi ve WebGL desteği dikkat &amp;ccedil;ekici geldi. Ayrıca R, Python ve Matlab dilleriyle de kullanılabiliyor. Data Scientest rol&amp;uuml;ndekilerin grafiksel raporlama ihtiya&amp;ccedil;larında bu olduk&amp;ccedil;a kıymetli diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Nitekim&amp;nbsp;veriyi tarayıcıda grafikselleştirmek birazdan g&amp;ouml;receğiniz &amp;uuml;zere gayet kolay.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/11/plotly_01.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabii &amp;ouml;ncesinde onu en yalın haliyle kullanabilmem gerekiyordu. Kafamda basit bir kurgu hazırladım. Node.js ve express'i kullanarak, &amp;uuml;&amp;ccedil; sunucunun son yedi g&amp;uuml;nl&amp;uuml;k talep karşılama değerlerini JSON formatında d&amp;ouml;nd&amp;uuml;ren bir servis yazacaktım. HTTP Rest modelinde &amp;ccedil;alışmasını planladığım bu servisi tamamladıktan sonra ona talepte bulunup gelen &amp;ccedil;ıktıyı plotly sayesinde ekrana &amp;ccedil;izen bir HTML sayfası geliştirecektim. İşe FunnyGraphics isimli bir klas&amp;ouml;r a&amp;ccedil;ıp gerekli &amp;ouml;n hazırlıkları yaparak başladım.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm init
npm install express --save&lt;/pre&gt;
&lt;p&gt;npm başlangıcını yapıp, express mod&amp;uuml;l&amp;uuml;n&amp;uuml; y&amp;uuml;kledikten sonra package.json dosyasının son hali aşağıdaki gibiydi.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;{
  "name": "funnygraphics",
  "version": "1.0.0",
  "description": "simple plotly.js sample",
  "main": "app.js",
  "scripts": {
    "test": "echo \"Error: no test specified\" &amp;amp;&amp;amp; exit 1",
    "start": "node app.js"
  },
  "author": "buraks",
  "license": "ISC",
  "dependencies": {
    "express": "^4.16.4"
  }
}&lt;/pre&gt;
&lt;p&gt;Sonrasında node.js sunucusu olarak g&amp;ouml;rev yapıp talepleri karşılayacak app.js dosyasını yazmaya başladım.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;var express = require("express");
var app = express();
var path = require('path');

app.get("/", (req, res, next) =&amp;gt; {
    res.sendFile(path.join(__dirname + '/index.html'));
});

app.get("/report", (req, res, next) =&amp;gt; {

    var days = ['Day01', 'Day02', 'Day03', 'Day04', 'Day05', 'Day06', 'Day07'];
    var seri01 = {
        x: days,
        y: [5, 7, 9, 14, 12, 10, 9],
        name: 'dcist01',
        mode: 'lines+markers',
        type: 'scatter'        
    };
    var seri02 = {
        x: days,
        y: [5, 3, 8, 10, 12, 6, 3],
        mode: 'lines+markers',
        name: 'dcizm03',
        type: 'scatter'
    };
    var seri03 = {
        x: days,
        y: [0, 3, 5, 8, 8, 8, 7],
        mode: 'lines+markers',
        name: 'dclnd07',
        type: 'scatter'
    };
    var data = [seri01, seri02, seri03];
    res.json(data);
});

app.listen(6701, () =&amp;gt; {
    console.log("Raporlama sunucusu aktif!");
});&lt;/pre&gt;
&lt;p&gt;express mod&amp;uuml;l&amp;uuml;ne ait değişkenimiz 6701 nolu yerel porttan dinleme yapacak şekilde kullanılıyor. /report adresine&amp;nbsp;gelen talepler i&amp;ccedil;in devreye giren fonksiyonumuzda aslında index.html i&amp;ccedil;erisindeki plotly i&amp;ccedil;in &amp;ouml;nem arz edem bir JSON i&amp;ccedil;eriği d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmekte. Burada g&amp;uuml;n bazlı olacak şekilde bir takım rastsal sayılar bulunduran &amp;uuml;&amp;ccedil; farklı seri s&amp;ouml;z konusu. Her biri sembolik olarak bir sunucuyu belirtmekte. Ayrıca grafiklerin tipine ilişkin bir takım bilgiler de yolluyoruz. Burada bir kararsızlık yaşadığımı ifade edebilirim. Acaba servisten, plotly ile alakalı &amp;ouml;zellik bilgilerini g&amp;ouml;ndermekle servisi ve g&amp;ouml;rsel k&amp;uuml;t&amp;uuml;phaneyi &amp;ccedil;ok mu bağımlı hale getirdik? Peki sadece veriyi g&amp;ouml;ndersek de bunun ayrıştırma ve g&amp;ouml;sterme kısmını HTML i&amp;ccedil;erisine bıraksak nasıl olur du? Doğruyu s&amp;ouml;ylemek gerekirse grafiğin ihtiya&amp;ccedil; duyduğu veriyi aynı web site i&amp;ccedil;erisinde &amp;ccedil;alıştığım i&amp;ccedil;in bu şekilde g&amp;ouml;ndermek daha kolayıma geldi :| Servisi yazdıktan sonra k&amp;uuml;&amp;ccedil;&amp;uuml;k bir test yaptım. &amp;Ouml;nce&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;npm start&lt;/pre&gt;
&lt;p&gt;ile sunucuyu başlattım ve ardından http://localhost:6701/report&amp;nbsp;adresine Postman'den HTTP Get talebi g&amp;ouml;nderdim. Sonu&amp;ccedil;lar başarılıydı.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/11/plotly_03.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sunucuya g&amp;ouml;re k&amp;ouml;k adrese gelen talepler doğrudan index.html sayfasının istemciye g&amp;ouml;nderilmesi ile sonu&amp;ccedil;lanmakta. Grafiğin &amp;ccedil;izildiği asıl yer index.html dosyasındaki script bloğu. Onu da aşağıdaki gibi tasarladım.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;head&amp;gt;
    &amp;lt;script src="https://cdn.plot.ly/plotly-latest.min.js"&amp;gt;&amp;lt;/script&amp;gt;
    &amp;lt;script src="https://ajax.googleapis.com/ajax/libs/jquery/3.3.1/jquery.min.js"&amp;gt;&amp;lt;/script&amp;gt;
&amp;lt;/head&amp;gt;

&amp;lt;body&amp;gt;
    &amp;lt;div id="divStatistics"&amp;gt;
    &amp;lt;/div&amp;gt;
    &amp;lt;script&amp;gt;

        $(document).ready(function () {
            $.ajax({
                url: '/report',
                type: "GET",
                success: function (result) {
                    var layout = {
                        xaxis: { autorange: true },
                        yaxis: { autorange: true },
                        legend: {
                            x: 0,
                            y:-0.5,
                            yref: 'paper',
                            font: {
                                family: 'Tahoma',
                                size: 16
                            }
                        },
                        title: 'Haftalık sunucu istatistikleri (Akfit Servis/G&amp;uuml;n)'
                    };

                    Plotly.newPlot('divStatistics', result, layout);
                },
                error: function (error) {
                    console.log('error ${error}')
                }
            })
        });

    &amp;lt;/script&amp;gt;
&amp;lt;/body&amp;gt;&lt;/pre&gt;
&lt;p&gt;Plotly ve jQuery k&amp;uuml;t&amp;uuml;phanelerini dok&amp;uuml;manın başındaki script bloklarında referans olarak bildiriyoruz&lt;em&gt;(Local dosya olarak da kullanabiliriz tabii)&lt;/em&gt; /report adresine HTTP Get talebi yapmak i&amp;ccedil;in tek y&amp;ouml;ntem jQuery değil. ES6'nın fetch fonksiyonunu, XmlHttpRequest nesnesini veya bir başka &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; de değerlendirebiliriz. Lakin benim kolayıma gelen jQuery oldu diyebilirim. Ajax &amp;ccedil;ağrısı ile ger&amp;ccedil;ekleştirilen işlem başarılı ise success bloğundaki kod par&amp;ccedil;ası devreye giriyor. Grafiği &amp;ccedil;izdiren fonksiyon Plotly.newPlot isimli metod. İlk parametre ile grafiğin &amp;ccedil;izileceği div elementini belirtiyoruz. İkinci parametre ile grafiğin kaynak veri serileri g&amp;ouml;nderiliyor. Son parametre ile de grafiğe ait bir takım &amp;ouml;zellikler yollanıyor&lt;em&gt;(legend'ın yeri, grafiğin başlığı, x ve y eksenlerinin otomatik olarak boyutlandırılacağı vs)&lt;/em&gt; Aslında hepsi bu kadar ;)&lt;/p&gt;
&lt;p&gt;K&amp;uuml;t&amp;uuml;phanenin kullanım alanı tabii ki &amp;ccedil;ok daha geniş. S&amp;ouml;z gelimi CSV i&amp;ccedil;erikleri ile de kolayca &amp;ccedil;alışılabiliyor. Sadece veri serilerini doğru şekilde eşleştirmek gerekiyor. Aslında bu konuda &lt;a href="https://raw.githubusercontent.com/plotly/datasets/master/stockdata.csv" target="_blank"&gt;şu adresteki&lt;/a&gt;&amp;nbsp;veri k&amp;uuml;mesini kullanarak grafik &amp;ouml;rnekleri deneyebilirsiniz. &lt;a href="https://plot.ly/javascript/" target="_blank"&gt;Resmi kaynakta&lt;/a&gt; konu ile ilgili detaylı bilgiler mevcut. Bir bakmakta yarar var ancak başlangı&amp;ccedil; basit senaryolarda okuduğunuz &amp;ouml;rnek yeterli olacaktır. B&amp;ouml;ylece geldik West-World'deki &amp;ccedil;ılgın bir partinin daha sonuna. Sabah ışıklarını &amp;ccedil;ok ş&amp;uuml;k&amp;uuml;r bug&amp;uuml;n de g&amp;ouml;rd&amp;uuml;k. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğe &lt;a href="https://github.com/buraksenyurt/nodejs-tutorials/tree/master/Day12" target="_blank"&gt;GitHub adresinden&lt;/a&gt; ulaşabilirsiniz.&lt;/p&gt;</content>
  <pubDate>2019-03-18 21:51:00</pubDate>
  <slug>servis-ciktilarini-plotly-js-ile-grafiklestirmek</slug>
  <tags>
    <tag>node</tag>
    <tag>nodejs</tag>
    <tag>javascript</tag>
    <tag>express</tag>
    <tag>plotlyjs</tag>
    <tag>jquery</tag>
    <tag>rest-api</tag>
    <tag>http</tag>
    <tag>json</tag>
  </tags>
  <categories>
    <category>Node.js</category>
  </categories>
</post>