<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>MongoDB ile Bir GO Uygulamasını Konuşturmak</title>
  <description>Elimizdeki malzemeleri sayalım. MongoDB için bir docker imajı, gRPC ve GoLang. Bu üçünü kullanarak CRUD operasyonlarını icra eden basit bir uygulama geliştirmek niyetindeyim. Bir önceki öğretide Redis docker container'dan yararlanmıştım. Ahch-to sistemini kirletmemek adına MongoDB için de benzer şekilde hareket edeceğim. Açıkçası GoLang bilgim epey paslanmış durumda ve sistemde yüklü olup olmadığını dahi bilmiyorum.</description>
  <content>&lt;div&gt;&lt;img style="float: right;" src="/image.axd?picture=/2019/11/02/screenshot_9.png" alt="" /&gt;&lt;/div&gt;
&lt;div&gt;Teknoloji baş d&amp;ouml;nd&amp;uuml;ren bir hızla ilerlerken beynimizin tembelleştiğini de kabul etmemiz gerekiyor. Artık pek &amp;ccedil;ok işimiz&amp;nbsp;otonomlaştırıldığından zihnimiz eski egzersizleri yapmıyor. Yıllar &amp;ouml;nce İngiltere'de yapılan bir araştırmada &amp;ccedil;ocukların hesap makinesi kullanması sebebiyle temel d&amp;ouml;rt işlem&amp;nbsp;matematiğinde sorunlar yaşadığı tespit edilmişti. Yine Kanada'da yapılan bir araştırma insanların&amp;nbsp;dikkat dağılma s&amp;uuml;relerinin 8 saniyelere kadar indiğini g&amp;ouml;sterdi. Hafızamızı din&amp;ccedil; tutma noktasında Japon balıkları ile yarışır bir konumda olduğumuz da aşikar. Ka&amp;ccedil;ımız aklından ezbere 4 telefon numarasını sayabilir&lt;em&gt;(&amp;Uuml;&amp;ccedil; haneliler yasak)&lt;/em&gt;&amp;nbsp;Otonomlaşan d&amp;uuml;nya sebebiyle tembelleşen ve dış uyarıcılar&amp;nbsp;y&amp;uuml;z&amp;uuml;nden s&amp;uuml;rekli dikkati dağılan zihnimiz...Ger&amp;ccedil;ekten de dikkatimizi dağıtan, odaklanmamızı bozan o kadar&amp;nbsp;&amp;ccedil;ok şey var ki.&amp;nbsp;Dolayısıyla kendimizi yetiştirmek istediğimiz konulara &amp;ccedil;alışırken ne kadar verimli olabiliyoruz bir bakmak&amp;nbsp;gerekiyor. Tekrar satın alınamayacak olan zamanın ne kadar kıymetli olduğunu d&amp;uuml;ş&amp;uuml;n&amp;uuml;rsek verimli &amp;ccedil;alışmanın ilerleyen yaşlarda &amp;ccedil;ok &amp;ccedil;ok &amp;ouml;nemli bir mesele haline geldiğini vurgulamak isterim.&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;İşte bu sebepten birka&amp;ccedil; haftadır&amp;nbsp;&lt;a href="https://github.com/buraksenyurt/saturday-night-works"&gt;Saturday-Night-Works&lt;/a&gt; &amp;ccedil;alışmalarım sırasında pomodoro tekniğini neden kullanmadığımı karar kara d&amp;uuml;ş&amp;uuml;nmekteyim. Oysa ki &amp;ccedil;ok&amp;nbsp;verimli bir &amp;ccedil;alışma pratiği. Atladığım bu &amp;ouml;nemli detayı SkyNet &amp;ccedil;alışmalarımın ilk g&amp;uuml;n&amp;uuml;nden itibaren uygulamaya karar verdim. Genellikle gece 22:00 sularında başlayarak 4X25 dakikalık seanslar halinde ilerliyorum. Her seans arasında 5er dakikalık standart molalar var.&amp;nbsp;Tabii bu tekniği uygularken en &amp;ouml;nemli kural &amp;ccedil;alışmayı b&amp;ouml;lecek unsurları mutlak suretle dışarıda bırakmak. Cep/ev telefonu, televizyon, radyo, e-mail programı ve benzeri odak dağıtıcı ne kadar şey varsa kapatmak gerekiyor. Bunun faydasını epeyce g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml; ve 25 dakikalık zaman dilimlerindeki &amp;ccedil;alışmalardan&amp;nbsp;iyi seviyede&amp;nbsp;verim aldığımı ifade edebilirim.&amp;nbsp;Aranızda uygulamayanlar varsa&amp;nbsp;bir g&amp;ouml;z atsınlar derim ;)&amp;nbsp;&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;blockquote&gt;
&lt;div&gt;Pomodoro tekniğini uygularken size akıllı bir kronometre gerekecek. Tarayıcıda &amp;ccedil;alışan &lt;a href="https://tomato-timer.com/" target="_blank"&gt;Tomato-Timer&lt;/a&gt; tam size g&amp;ouml;re. Hatta Visual Studio Code i&amp;ccedil;in eklentisi bile var ;)&lt;/div&gt;
&lt;/blockquote&gt;
&lt;div&gt;Gelelim SkyNet'te ge&amp;ccedil;irdiğim ikinci g&amp;uuml;ne. Elimizdeki malzemeleri sayalım. MongoDB i&amp;ccedil;in bir docker imajı, gRPC ve GoLang. Bu &amp;uuml;&amp;ccedil;&amp;uuml;n&amp;uuml; kullanarak CRUD&lt;em&gt;(Create Read Update Delete)&lt;/em&gt; operasyonlarını icra eden basit bir uygulama geliştirmek niyetindeyim. Bir &amp;ouml;nceki &amp;ouml;ğretide Redis docker container'dan yararlanmıştım. Kaynakları kıymetli olan Ahch-To sistemini kirletmemek adına MongoDB i&amp;ccedil;in de benzer şekilde hareket edeceğim. A&amp;ccedil;ık&amp;ccedil;ası GoLang bilgim epey paslanmış durumda ve sistemde y&amp;uuml;kl&amp;uuml; olup olmadığını dahi bilmiyorum.&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;go version&lt;/pre&gt;
terminal komutu da bana y&amp;uuml;kl&amp;uuml; olmadığını s&amp;ouml;yl&amp;uuml;yor. Dolayısıyla ilk adım onu MacOS &amp;uuml;zerine kurmak.&lt;/div&gt;
&lt;h2&gt;İlk Hazırlıklar&lt;em&gt;(Go Kurulumu ve MongoDB)&lt;/em&gt;&lt;/h2&gt;
&lt;div&gt;GoLang'i Ahch-To adasına y&amp;uuml;klemek i&amp;ccedil;in &lt;a href="https://golang.org/dl/" target="_blank"&gt;şu adrese&lt;/a&gt; gidip Apple macOS s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; indirmem gerekti. Ben &amp;ouml;ğretiyi hazırlarken go1.13.4.darwin-amd64.pkg dosyasını kullandım. Kurulum işlemini tamamladıktan sonra komut satırından go versiyonunu sorgulattım ve aşağıdaki &amp;ccedil;ıktıyı elde ettim.&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;&lt;img src="/image.axd?picture=/2019/11/02/screenshot_1.png" alt="" /&gt;&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;Pek tabii i&amp;ccedil;im rahat değildi. Versiyon bilgisi gelmişti ama bir "hello world" uygulamasını &amp;ccedil;alışır halde g&amp;ouml;rmeliydim ki kurulumun sorunsuz olduğundan emin olayım. Hemen resmi dok&amp;uuml;manı takip ederek $HOME\go\src\ altında helloworld isimli bir klas&amp;ouml;r a&amp;ccedil;ıp aşağıdaki kod par&amp;ccedil;asını i&amp;ccedil;eren helloworld.go dosyasını oluşturdum&lt;em&gt;(Visual Studio Code kullandığım i&amp;ccedil;in edit&amp;ouml;r&amp;uuml;n &amp;ouml;nerdiği go ile ilgili extension'ları y&amp;uuml;klemeyi de ihmal etmedim)&lt;/em&gt;&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import "fmt"

func main() {
	fmt.Printf("Artık go &amp;ccedil;alışmaya hazırım :) \n")
}&lt;/pre&gt;
Terminalden aşağıdaki komutları işlettikten sonra &amp;ccedil;ıktıyı g&amp;ouml;rebildim.&amp;nbsp;&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;go build
./helloworld&lt;/pre&gt;
&lt;img src="/image.axd?picture=/2019/11/02/screenshot_2.png" alt="" /&gt;&lt;/div&gt;
&lt;div&gt;Go ile kod yazabildiğime g&amp;ouml;re MongoDB docker imajını indirip bir deneme turuna &amp;ccedil;ıkabilirim. İşte terminal komutları.&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;docker pull mongo
docker run -d -p 27017-27019:27017-27019 --name gondor mongo
docker container ps -a
docker exec -it gondor bash

mongo
show dbs
use AdventureWorks
db.category.save({title:"Book"})
db.category.save({title:"Movie"})
db.category.find().pretty()

exit
exit&lt;/pre&gt;
&lt;img src="/image.axd?picture=/2019/11/02/screenshot_3.png" alt="" /&gt;&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;İlk komutla mongo imajı &amp;ccedil;ekiliyor. İzleyen komut docker container'ını varsayılan portları ile sistemin kullanımına a&amp;ccedil;mak i&amp;ccedil;in. Container listesinde g&amp;ouml;r&amp;uuml;nd&amp;uuml;ğ&amp;uuml;ne g&amp;ouml;re sorun yok. MongoDB veritabanını container &amp;uuml;zerinden test etmek amacıyla&amp;nbsp;i&amp;ccedil;ine girmek lazım. 4nc&amp;uuml; komutu bu işe yarıyor. Ardından mongo shell'e ge&amp;ccedil;ip bir ka&amp;ccedil; işlem ger&amp;ccedil;ekleştirilebilir. &amp;Ouml;nce var olan veritabanlarını listeliyor sonra AdventureWorks isimli yeni bir tane oluşturuyoruz.&amp;nbsp;Devam eden kısımda category isimli bir koleksiyona iki dok&amp;uuml;man ekleniyor ve t&amp;uuml;m&amp;uuml;n&amp;uuml; g&amp;uuml;zel bir formatta listeliyoruz. Arka arkaya gelen iki exit komutunu fark etmişsinizdir. İlki mongo shell'den, ikincisi de container i&amp;ccedil;inden &amp;ccedil;ıkmak i&amp;ccedil;in.&lt;br /&gt;&lt;br /&gt;Ah &amp;ccedil;ok &amp;ouml;nemli bir detayı unuttum! &amp;Ouml;rnekte gRPC protokol&amp;uuml;n&amp;uuml; kullanacağız. Bu da bir proto dosyamız olacağı ve Golang i&amp;ccedil;in gerekli stub&amp;nbsp;i&amp;ccedil;eriğine derleyeceğimiz anlamına geliyor. Dolayısıyla sistemde protobuf ve go i&amp;ccedil;in gerekli derleyici eklentisine ihtiyacım var. brew ile bunları sisteme y&amp;uuml;klemek olduk&amp;ccedil;a kolay.&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;brew install protobuf
protoc --version
brew install protoc-gen-go&lt;/pre&gt;
Kod tarafına ge&amp;ccedil;meye hazırız ama &amp;ouml;ncesinde ufak bir bilgi.&lt;/div&gt;
&lt;h2&gt;gRPC Hakkında Azıcık Bilgi&lt;/h2&gt;
&lt;div&gt;gRPC, HTTP2 bazlı modern bir iletişim protokol&amp;uuml; ve JSON yerine ProtoBuffers olarak isimlendirilen kuvvetle t&amp;uuml;rlendirilmiş bir ikili veri formatını kullanmakta&lt;em&gt;(strongly-typed binary data format)&lt;/em&gt; JSON &amp;ouml;zellikle REST tabanlı servislerde pop&amp;uuml;ler bir format olmasına rağmen serileştirme sırasında CPU'yu yoran bir performans sergiliyor. HTTP/2 &amp;ouml;zelliklerini iyi kullanan gRPC ise 5 ile 25 kata kadar daha hızlı. Bu noktada hatırlamak i&amp;ccedil;in bile olsa gRPC ile REST'i kıyaslamakta yarar var. İşte karşılaştırma tablosu.&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;
&lt;table style="border: 1px solid black;"&gt;
&lt;thead&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&amp;nbsp;REST Tarafı&lt;/strong&gt;&lt;/td&gt;
&lt;td style="text-align: right;"&gt;&lt;strong&gt;gRPC Tarafı&amp;nbsp;&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/thead&gt;
&lt;tbody&gt;
&lt;tr style="border: 1px solid black;"&gt;
&lt;td style="border: 1px solid black;"&gt;&amp;nbsp;HTTP 1.1 nedeniyle gecikme y&amp;uuml;ksek&amp;nbsp;&amp;nbsp;&lt;/td&gt;
&lt;td style="border: 1px solid black;"&gt;&amp;nbsp;HTTP/2 sebebiyle daha d&amp;uuml;ş&amp;uuml;k gecikme&amp;nbsp;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="border: 1px solid black;"&gt;&amp;nbsp;Sadece Request/Response&lt;/td&gt;
&lt;td style="border: 1px solid black;"&gt;&amp;nbsp;Stream desteği&lt;em&gt;(&amp;Ouml;rneğimizde bir kullanımı var)&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="border: 1px solid black;"&gt;&amp;nbsp;CRUD odaklı servisler i&amp;ccedil;in&amp;nbsp;&lt;/td&gt;
&lt;td style="border: 1px solid black;"&gt;&amp;nbsp;API odaklı&lt;em&gt;(Burada CRUD odaklı yapacağız &amp;ccedil;aktırmayın)&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="border: 1px solid black;"&gt;&amp;nbsp;HTTP Get,Post,Put,Delete gibi fiil tabanlı&lt;/td&gt;
&lt;td style="border: 1px solid black;"&gt;&amp;nbsp;RPC tabanlı, sunucu &amp;uuml;zerinden fonksiyon &amp;ccedil;ağırabilme &amp;ouml;zelliği&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="border: 1px solid black;"&gt;&amp;nbsp;Sadece Client-&amp;gt;Server y&amp;ouml;nl&amp;uuml; talepler&lt;/td&gt;
&lt;td style="border: 1px solid black;"&gt;&amp;nbsp;&amp;Ccedil;ift y&amp;ouml;nl&amp;uuml; ve asenkron iletişim&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td style="border: 1px solid black;"&gt;&amp;nbsp;JSON kullanıyor&lt;em&gt;(serileşme yavaş, boyut b&amp;uuml;y&amp;uuml;k)&lt;/em&gt;&lt;/td&gt;
&lt;td style="border: 1px solid black;"&gt;&amp;nbsp;Protobuffer kullanıyor&lt;em&gt;(veri daha k&amp;uuml;&amp;ccedil;&amp;uuml;k boyutta ve serileşme hızlı)&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;h2&gt;&amp;Ouml;rnek Uygulama&lt;/h2&gt;
&lt;/div&gt;
&lt;p&gt;Gelelim kod tarafına... Uygulamanın temel klas&amp;ouml;r yapısını aşağıdaki gibi oluşturabiliriz. Ben bu işlemleri $HOME\go\src\ altında ger&amp;ccedil;ekleştirdim.&lt;/p&gt;
&lt;div&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;mkdir gRPC-sample
cd gRPC-sample
mkdir playerserver
mkdir clientapp
mkdir proto&lt;/pre&gt;
playerserver ve clientapp tahmin edileceği &amp;uuml;zere sunucu ve istemci uygulama g&amp;ouml;revini &amp;uuml;stleniyorlar. proto klas&amp;ouml;r&amp;uuml;nde yer alan player.proto, gRPC mesaj s&amp;ouml;zleşmesine ait tanımlamaları i&amp;ccedil;ermekte. Servis metodları, parametre tipleri ve i&amp;ccedil;erikleri bu dosyada aşağıdaki gibi bildiriliyor.&amp;nbsp;&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;syntax="proto3"; //protobuffers v3 versiyonu kullaniliyor

package player; // proto paketinin adi
option go_package="playerpb"; // generate edilecek go paketinin adi

// Player mesaj tipinin tanimi
message Player{
    string id=1;
    string player_id=2;
    string fullname=3;
    string position=4;
    string bio=5;
}

// Operasyonlarin kullandigi request ve response mesajlarina ait tanimlamalar
message AddPlayerReq{
    Player plyr=1;
}

message AddPlayerRes{
    Player plyr=1;
}

message EditPlayerReq{
    Player plyr=1;
}

message EditPlayerRes{
    Player plyr=1;
}

message RemovePlayerReq{
    string player_id=1;
}

message RemovePlayerRes{
    bool removed=1;
}

message GetPlayerReq{
    string player_id=1;
}

message GetPlayerRes{
    Player plyr=1;
}

message GetPlayerListReq{}

message GetPlayerListRes{
    Player plyr=1;
}

// servis ve operasyon tanimlari
service PlayerService{
    rpc GetPlayer(GetPlayerReq) returns (GetPlayerRes);
    rpc GetPlayerList(GetPlayerListReq) returns (stream GetPlayerListRes); //server bazlı streaming kullanacağımız i&amp;ccedil;in d&amp;ouml;n&amp;uuml;ş parametresi stream tipinden
    rpc AddPlayer(AddPlayerReq) returns (AddPlayerRes);
    rpc EditPlayer(EditPlayerReq) returns (EditPlayerRes);
    rpc RemovePlayer(RemovePlayerReq) returns (RemovePlayerRes);
}&lt;/pre&gt;
&lt;/div&gt;
&lt;div&gt;Bu i&amp;ccedil;eriği Go&amp;nbsp;tarafında kullanabilmek i&amp;ccedil;in&amp;nbsp;derlememiz lazım. Derlemeyi aşağıdaki terminal komutu ile ger&amp;ccedil;ekleştirebiliriz&lt;em&gt;(proto dosyasını VS Code tarafında daha kolay d&amp;uuml;zenlemek i&amp;ccedil;in&amp;nbsp;vscode-proto3 isimli extension'ı kullandım)&lt;/em&gt;&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;protoc player.proto --go_out=plugins=grpc:.&lt;/pre&gt;
Proto dosyasının tamamlanmasını takiben playerserver klas&amp;ouml;r&amp;uuml;ndeki main.go dosyasını yazmaya başlayabiliriz. Biraz uzun bir kod dosyası ama sabırla&amp;nbsp;yazıp, yorum satırlarını da okuyarak neler yaptığımızı anlamaya &amp;ccedil;alışmakta yarar var.&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"context"
	"fmt"
	"net"
	"os"
	"os/signal"
	"strings"

	"go.mongodb.org/mongo-driver/bson/primitive"

	playerpb "gRPC-sample/proto"

	"go.mongodb.org/mongo-driver/bson"
	"go.mongodb.org/mongo-driver/mongo"
	"go.mongodb.org/mongo-driver/mongo/options"
	"google.golang.org/grpc"
	"google.golang.org/grpc/codes"
	"google.golang.org/grpc/status"
)

/* proto'dan otomatik &amp;uuml;retilen player.pb.go i&amp;ccedil;erisindeki RegisterPlayerServiceServer metoduna bir bakın.
Pointer olarak gelen grpc server nesnesi ikinci parametre olarak gelen tipi register etmek i&amp;ccedil;in kullanılır.
Bir nevi interface &amp;uuml;zerinden enjekte işlemi yaptığımızı d&amp;uuml;ş&amp;uuml;nebilir miyiz?
*/
type PlayerServiceServer struct{}

var db *mongo.Client
var playerCollection *mongo.Collection
var mongoContext context.Context

func main() {
	// TCP &amp;uuml;zerinden 5555 nolu portu dinleyecek olan nesne oluşturuluyor
	server, err := net.Listen("tcp", ":5555")
	// Olası bir hata durumunu kontrol ediyoruz
	if err != nil {
		fmt.Printf("5555 dinlenemiyor: %v", err)
	}

	// gPRC sunucusu i&amp;ccedil;in kayıt(register) işlemleri
	grpcOptions := []grpc.ServerOption{}
	// yeni bir grpc server oluşturulur
	grpcServer := grpc.NewServer(grpcOptions...)
	// Bir PlayerService tipi oluşturulur
	playerServiceType := &amp;amp;PlayerServiceServer{}
	// servis sunucu ile birlikte kayıt edilir
	playerpb.RegisterPlayerServiceServer(grpcServer, playerServiceType)

	// mongoDB bağlantı işlemleri
	fmt.Println("MongoDB sunucusuna bağlanılıyor")
	mongoContext = context.Background()
	// bağlantı deneniyor
	db, err = mongo.Connect(mongoContext, options.Client().ApplyURI("mongodb://localhost:27017"))
	// olası bir bağlantı hatası varsa
	if err != nil {
		fmt.Println(err)
	}
	// Klasik ping metodunu &amp;ccedil;ağırıyoruz
	err = db.Ping(mongoContext, nil)
	if err != nil {
		fmt.Println(err)
	} else {
		// &amp;ccedil;ağrı başarılı olursa bağlandık demektir
		fmt.Println("MongoDB ile bağlantı sağlandı")
	}
	// nba isimli veritabanındaki player koleksiyonuna ait bir nesne &amp;ouml;rnekliyoruz
	// veritabanı ve koleksiyon yoksa oluşturulacaktır
	playerCollection = db.Database("nba").Collection("player")

	// gRPC sunucusunu aktif olan TCP sunucusu i&amp;ccedil;erisinde bir child routine olarak başlatıyoruz
	go func() {
		if err := grpcServer.Serve(server); err != nil {
			fmt.Println(err)
		}
	}()
	fmt.Println("Sunucu 5555 nolu porttan gPRC tabanlı iletişime hazır.\nDurdurmak i&amp;ccedil;in CTRL+C.")

	// CTRL+C ile başlayan kapatma operasyonu
	cnl := make(chan os.Signal)      // işletim sisteminde sinyal alabilmek i&amp;ccedil;in bir kanal oluşturduk
	signal.Notify(cnl, os.Interrupt) // CTRL+C mesajı gelene kadar ana rutin a&amp;ccedil;ık kalacak
	&amp;lt;-cnl

	fmt.Println("Sunucu kapatılıyor...")
	grpcServer.Stop() // gRPC sunucusunu durdur
	server.Close()    // TCP dinleyicisini kapat
	fmt.Println("GoodBye Crow")
}

/* Protobuf mesajlarında taşınan serileşmiş i&amp;ccedil;eriği nesnel olarak ele alacağımı struct */
type Player struct {
	ID       primitive.ObjectID `bson:"_id,omitempty"` // MongoDB tarafındaki ObjectId değerini taşır
	PlayerID string             `bson:"player_id"`
	Fullname string             `bson:"fullname"`
	Position string             `bson:"position"`
	Bio      string             `bson:"bio"`
}

/* PlayerServiceServer'ın uygulanması gereken metodlarını. Yani servis s&amp;ouml;zleşmesinin t&amp;uuml;m operasyonları
 */

// Yeni bir oyuncu eklemek i&amp;ccedil;in kullanacağımız fonksiyon
func (srv *PlayerServiceServer) AddPlayer(ctx context.Context, req *playerpb.AddPlayerReq) (*playerpb.AddPlayerRes, error) {
	payload := req.GetPlyr() // GetPlyr (GetPlayer değil o servis metodumuz) fonksiyonu ile request &amp;uuml;zerinden gelen player i&amp;ccedil;eriği &amp;ccedil;ekilir

	// İ&amp;ccedil;erik ile gelen alan değerleri player struct nesnesini oluşturmak i&amp;ccedil;in kullanılır
	player := Player{
		PlayerID: payload.GetPlayerId(),
		Fullname: payload.GetFullname(),
		Position: payload.GetPosition(),
		Bio:      payload.GetBio(),
	}

	// player nesnesi mongodb veritabanındaki koleksiyona kayıt edilir
	result, err := playerCollection.InsertOne(mongoContext, player)

	// bir problem oluştuysa
	if err != nil {
		// gRPC hatası d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;r
		return nil, status.Errorf(
			codes.Internal,
			fmt.Sprintf("Bir hata oluştu : %v", err),
		)
	}

	// Hata oluşmadıysa koleksiyona eklenen yeni dok&amp;uuml;man
	// &amp;uuml;retilen ObjectID değeri de atanarak geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;r
	objectID := result.InsertedID.(primitive.ObjectID)
	payload.Id = objectID.Hex()
	return &amp;amp;playerpb.AddPlayerRes{Plyr: payload}, nil
}

func (srv *PlayerServiceServer) EditPlayer(ctx context.Context, req *playerpb.EditPlayerReq) (*playerpb.EditPlayerRes, error) {
	return nil, nil
}

func (srv *PlayerServiceServer) RemovePlayer(ctx context.Context, req *playerpb.RemovePlayerReq) (*playerpb.RemovePlayerRes, error) {
	// &amp;ouml;nce silinmek istenen playerId bilgisi alınır
	id := strings.Trim(req.GetPlayerId(), "\t \n")
	fmt.Println(id)
	// DeleteOne metodu ile silme operasyonu ger&amp;ccedil;ekleştirilir
	_, err := playerCollection.DeleteOne(ctx, bson.M{"player_id": id})

	// hata kontrol&amp;uuml; yapılıyor
	if err != nil {
		return nil, status.Errorf(codes.NotFound, fmt.Sprintf("Silinmek istenen oyuncu bulunamadı. %s", err))
	}

	// hata yoksa işlemin başarılı olduğuna dair sonu&amp;ccedil; d&amp;ouml;n&amp;uuml;l&amp;uuml;r
	return &amp;amp;playerpb.RemovePlayerRes{
		Removed: true,
	}, nil
}

// MongoDB'deki ID bazlı olarak oyuncu verisi d&amp;ouml;nd&amp;uuml;ren metodumuz
func (srv *PlayerServiceServer) GetPlayer(ctx context.Context, req *playerpb.GetPlayerReq) (*playerpb.GetPlayerRes, error) {
	// request ile gelen player_id bilgisini alıyoruz
	// Trim işlemi &amp;ouml;nemli. İstemci terminalden değer girdiğinde alt satıra ge&amp;ccedil;me işlemi s&amp;ouml;z konusu.
	// Veri bu şekilde gelirse kayıt bulunamaz. Dolayısıyla bir Trim işlemi yapıyoruz
	id := strings.Trim(req.GetPlayerId(), "\t \n")
	// bson.M metoduna ilgili sorguyu ekleyerek oyuncuyu koleksiyonda arıyoruz
	result := playerCollection.FindOne(ctx, bson.M{"player_id": id})

	player := Player{}
	// bulunan oyuncu decode metodu ile ters serileştirilip player değişkenine alınır
	if err := result.Decode(&amp;amp;player); err != nil {
		return nil, status.Errorf(codes.InvalidArgument, fmt.Sprintf("Sanırım aranan oyuncu bulunamadı %v", err))
	}

	// Decode işlemi başarılı olur ve koleksiyondan bulunan i&amp;ccedil;erik player isimli değişkene ters serileşebilirse
	// artık d&amp;ouml;necek response nesne i&amp;ccedil;eriğini hazırlayabiliriz
	res := &amp;amp;playerpb.GetPlayerRes{
		Plyr: &amp;amp;playerpb.Player{
			Id:       player.ID.Hex(),
			PlayerId: player.PlayerID,
			Fullname: player.Fullname,
			Position: player.Position,
			Bio:      player.Bio,
		},
	}
	return res, nil
}

// T&amp;uuml;m oyuncu listesini stream olarak d&amp;ouml;nen metod
func (srv *PlayerServiceServer) GetPlayerList(req *playerpb.GetPlayerListReq, stream playerpb.PlayerService_GetPlayerListServer) error {

	currentPlayer := &amp;amp;Player{}

	// Find metodu veri &amp;uuml;zerinden hareket edebileceğimiz bir Cursor nesnesi d&amp;ouml;nd&amp;uuml;r&amp;uuml;r
	// bu cursor nesnesi sayesinde istemciye t&amp;uuml;m oyuncu listesini bir seferde g&amp;ouml;ndermek yerine
	// birer birer g&amp;ouml;nderme şansına sahip olacağız
	// Bu nedenle sunucu bazlı bir streamin stratejimiz var
	cursor, err := playerCollection.Find(context.Background(), bson.M{})
	if err != nil {
		return status.Errorf(codes.Internal, fmt.Sprint("Bilinmeyen hata oluştu"))
	}

	// metod işleyişini tamamladığında cursor nesnesini kapatacak &amp;ccedil;ağrıyı tanımlıyoruz
	defer cursor.Close(context.Background())

	// iterasyona başlanır ve Next true d&amp;ouml;nd&amp;uuml;ğ&amp;uuml; s&amp;uuml;rece devam eder
	// yani okunacak mongodb dok&amp;uuml;mana kalmayana dek
	for cursor.Next(context.Background()) {
		// cursor verisini currentPlayer nesnesine a&amp;ccedil;ıyoruz
		cursor.Decode(currentPlayer)
		// istemciye mongodb'den gelen g&amp;uuml;ncel oyuncu bilgisinden yararlanarak cevap d&amp;ouml;n&amp;uuml;yoruz
		stream.Send(&amp;amp;playerpb.GetPlayerListRes{
			Plyr: &amp;amp;playerpb.Player{
				Id:       currentPlayer.ID.Hex(),
				PlayerId: currentPlayer.PlayerID,
				Fullname: currentPlayer.Fullname,
				Position: currentPlayer.Position,
				Bio:      currentPlayer.Bio,
			},
		})
	}

	return nil
}&lt;/pre&gt;
Sunucu tarafındaki kodlama tamamlandıktan sonra istemci tarafı i&amp;ccedil;in clientapp altında tester.go isimli bir başka dosya oluşturarak ilerleyelim. Burada komut satırından temel CRUD operasyonlarını icra edeceğiz. Yeni bir oyuncunun eklenmesi, bir oyuncu bilgisinin &amp;ccedil;ekilmesi, t&amp;uuml;m oyuncuların listesinin alınması vb&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;package main

import (
	"bufio"
	"context"
	"fmt"
	"io"
	"os"
	"strings"

	playerpb "gRPC-sample/proto"

	"google.golang.org/grpc"
)

var client playerpb.PlayerServiceClient
var reqOptions grpc.DialOption

func main() {

	// HTTPS ayarları ile uğraşmak istemedim
	reqOptions = grpc.WithInsecure()
	// gRPC servisi ile el sıkışmaya &amp;ccedil;alışıyoruz
	connection, err := grpc.Dial("localhost:5555", reqOptions)
	if err != nil {
		fmt.Println(err)
		return
	}
	// proxy nesnesini ilgili bağlantıyı kullanacak şekilde &amp;ouml;rnekliyoruz
	client = playerpb.NewPlayerServiceClient(connection)

	// Oyuncu ekleyelim
	insertPlayer()
	// t&amp;uuml;m oyuncu listesini &amp;ccedil;ekelim
	getAllPlayerList()

	// sembolik olarak ID bazlı 3 oyuncu aratalım
	for i := 0; i &amp;lt; 3; i++ {
		reader := bufio.NewReader(os.Stdin)
		fmt.Println("Oyuncu IDsini gir.")
		playerID, _ := reader.ReadString('\n')
		getByPlayerID(playerID)
	}

	// Silme operasyonunu deniyoruz
	reader := bufio.NewReader(os.Stdin)
	fmt.Println("Silmek istediğiniz oyuncunun IDsini girin.")
	playerID, _ := reader.ReadString('\n')
	removePlayerByID(playerID)

	// t&amp;uuml;m oyuncu listesini &amp;ccedil;ekelim
	getAllPlayerList()
}

func insertPlayer() {
	// Yeni oyuncu eklenmesi i&amp;ccedil;in deneme kodu
	// Veri ihlalleri &amp;ouml;rneğin basitliği a&amp;ccedil;ısından g&amp;ouml;z ardı edilmiştir
	reader := bufio.NewReader(os.Stdin)
	fmt.Println("Yeni oyuncu girişi")
	fmt.Println("Id-&amp;gt;")
	id, _ := reader.ReadString('\n')
	id = strings.Replace(id, "\n", "", -1)
	fmt.Println("Adı-&amp;gt;")
	fullname, _ := reader.ReadString('\n')
	fullname = strings.Replace(fullname, "\n", "", -1)
	fmt.Println("Pozisyon-&amp;gt;")
	position, _ := reader.ReadString('\n')
	position = strings.Replace(position, "\n", "", -1)
	fmt.Println("Kısa biografisi-&amp;gt;")
	bio, _ := reader.ReadString('\n')
	bio = strings.Replace(bio, "\n", "", -1)

	// protobuf dosyasındaki şemayı kullanarak &amp;ouml;rnek bir oyuncu nesnesi &amp;ouml;rnekliyoruz
	newPlayer := &amp;amp;playerpb.Player{
		PlayerId: id,
		Fullname: fullname,
		Position: position,
		Bio:      bio,
	}

	// servisin AddPlayer metodunu o anki context &amp;uuml;zerinden &amp;ccedil;alıştırıp
	// request payload i&amp;ccedil;erisinde yeni oluşturduğumuz nesneyi g&amp;ouml;nderiyoruz
	res, err := client.AddPlayer(
		context.TODO(),
		&amp;amp;playerpb.AddPlayerReq{
			Plyr: newPlayer,
		},
	)
	if err != nil {
		fmt.Println(err)
		return
	}
	// Eğer bir hata oluşmamışsa MongoDB tarafından &amp;uuml;retilen ID değerini ekranda g&amp;ouml;rmemiz lazım
	fmt.Printf("%s ile yeni oyuncu eklendi \n", res.Plyr.Id)
}

// T&amp;uuml;m oyuncu listesini &amp;ccedil;ektiğimiz metod
func getAllPlayerList() {

	// &amp;ouml;nce request oluşturulur
	req := &amp;amp;playerpb.GetPlayerListReq{}

	// proxy nesnesi &amp;uuml;zerinden servis metodu &amp;ccedil;ağrılır
	s, err := client.GetPlayerList(context.Background(), req)
	if err != nil {
		fmt.Println(err)
		return
	}

	// sunucu tarafından stream bazlı d&amp;ouml;n&amp;uuml;ş s&amp;ouml;z konusu
	// yani ka&amp;ccedil; tane oyuncu varsa herbirisi i&amp;ccedil;in sunucudan istemciye
	// cevap d&amp;ouml;necek
	for {
		res, err := s.Recv() // Recv metodu player.pb.go i&amp;ccedil;erisine otomatik &amp;uuml;retilmiştir. İnceleyin ;)
		if err != io.EOF {   // d&amp;ouml;ng&amp;uuml; sonlanmadığı s&amp;uuml;rece gelen cevaptaki oyuncu bilgisini ekrana yazdırır
			fmt.Printf("[%s] %s - %s \n\n", res.Plyr.PlayerId, res.Plyr.Fullname, res.Plyr.Bio)
		} else {
			break
		}
	}
}

// Oyuncuyu PlayerID değerinden bulan metodumuz
func getByPlayerID(playerID string) {
	// parametre olarak gelen playerID değerinden bir request oluşturulur
	req := &amp;amp;playerpb.GetPlayerReq{
		PlayerId: playerID,
	}
	// GetPlayer servis metoduna talep g&amp;ouml;nderilir
	res, err := client.GetPlayer(context.Background(), req)
	if err != nil {
		fmt.Println(err)
		return
	}
	fmt.Println(res.Plyr.Fullname)
}

// Oyuncu silme fonksiyonumuz
func removePlayerByID(playerID string) {
	// RemovePlayer servis &amp;ccedil;ağrısı i&amp;ccedil;in gerekli Request tipi hazırlanır
	req := &amp;amp;playerpb.RemovePlayerReq{
		PlayerId: playerID,
	}
	// servisi &amp;ccedil;ağrısı yapılıp sonucu kontrol edilir
	_, err := client.RemovePlayer(context.Background(), req)
	if err != nil {
		fmt.Println(err)
		return
	}
	fmt.Println("Oyuncu silindi")
}
&lt;/pre&gt;
Piuvvv!!! Uzun bir yol oldu. &amp;Ouml;yleyse &amp;ccedil;alışma zamanı sonu&amp;ccedil;larımıza bakalım mı?&lt;/div&gt;
&lt;h2&gt;&amp;Ccedil;alışma Zamanı&lt;/h2&gt;
&lt;div&gt;İlk g&amp;uuml;n &amp;ccedil;alışmasının meyveleri pek fena değil. server ve client tarafa ait go dosyalarını kendi klas&amp;ouml;rlerinde aşağıdaki terminal komutları ile derledikten sonra&lt;/div&gt;
&lt;div&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;go build main.go
go build tester.go&lt;/pre&gt;
&amp;ouml;nce sunucu ardından istemci programlarını &amp;ccedil;alıştırıp&amp;nbsp;kodlaması ilk &amp;ouml;nce biten&amp;nbsp;AddPlayer fonksiyonunu deneme şansı buldum. Birka&amp;ccedil; oyuncu verisini girdikten sonra mongodb container'ına ait shell'e bağlanıp ger&amp;ccedil;ekten de yeni dok&amp;uuml;manların player koleksiyonuna eklenip eklenmediğine baktım. Sonu&amp;ccedil; tebess&amp;uuml;m ettiriciydi :) İstemci uygulama gRPC &amp;uuml;zerinden sunucuya mesaj g&amp;ouml;ndermiş, sunucuya gelen i&amp;ccedil;erik docker container &amp;uuml;zerinde duran mongodb veritabanına yazılmıştı.&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;&lt;img src="/image.axd?picture=/2019/11/02/screenshot_4.png" alt="" /&gt;&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;İkinci g&amp;uuml;n t&amp;uuml;m oyuncu listesini gRPC &amp;uuml;zerinden istemciye d&amp;ouml;nd&amp;uuml;ren s&amp;uuml;reci yazmaya &amp;ccedil;alıştım. İlk başta yaptığım bir hata nedeniyle epey vakit kaybettim. GetPlayerList metodunu protobuffer dosyasında stream d&amp;ouml;nd&amp;uuml;recek şekilde tasarlamamıştım. B&amp;uuml;y&amp;uuml;k bir&amp;nbsp;veri k&amp;uuml;mesini filtresiz &amp;ccedil;ektiğimizde bu ağ trafiğinin sağlıklı &amp;ccedil;alışması a&amp;ccedil;ısından sorun olabilir. Oyuncuları sunucudan istemciye doğru bir stream &amp;uuml;zerinden tek tek g&amp;ouml;ndermek &amp;ccedil;ok daha mantıklı&lt;em&gt;(Burada REST ile gRPC arasındaki farkları hatırlayalım)&lt;/em&gt; Sonunda servis s&amp;ouml;zleşmesini değiştirip gerekli d&amp;uuml;zenlemeleri yaptıktan sonra aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan mutlu sona ulaşmayı başardım.&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;&lt;img src="/image.axd?picture=/2019/11/02/screenshot_5.png" alt="" /&gt;&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;Devam eden g&amp;uuml;n bir &amp;ouml;ncekine g&amp;ouml;re daha zorlu ge&amp;ccedil;ti. FindOne metodunu player_id değerine g&amp;ouml;re &amp;ccedil;alıştırmayı bir t&amp;uuml;rl&amp;uuml; başaramadım. Neredeyse 4 pomodoro periyodu uğraştım. Hatta pomodoro s&amp;uuml;reci bittikten sonra farkında olmadan saatlerce bilgisayar başında kaldım. Sorunu araştırırken vakit nasıl ge&amp;ccedil;ti anlamamışım. Sonu&amp;ccedil;ta işe 3 saatlik uykuyla gittim. Ertesi g&amp;uuml;n Ahch-To'nun tuşuna bile basmadım. Bir g&amp;uuml;nl&amp;uuml;k ara, problemi &amp;ccedil;&amp;ouml;zmem i&amp;ccedil;in beni sakinleştirmeye yeterdi. Nihayetinde sorunu buldum. İstemci aradığı ID değerini girip sunucuya &amp;ccedil;ağrı yaptığında, servis metoduna gelen ID bilgisinin sonunda boşluk ve alt satıra ge&amp;ccedil;me karakterleri de geliyordu. Trim&amp;nbsp;fonksiyonu ile bu durumun oluşmasını engelledikten sonra silme operasyonunu da işin i&amp;ccedil;erisine dahil ettim ve g&amp;uuml;ncelleme operasyonu hari&amp;ccedil; komple bir test yaptım.&amp;nbsp;Sonu&amp;ccedil;lar ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi tatmin ediciydi.&lt;/div&gt;
&lt;div&gt;&amp;nbsp;&lt;/div&gt;
&lt;div&gt;&lt;img src="/image.axd?picture=/2019/11/02/screenshot_6.png" alt="" /&gt;&lt;/div&gt;
&lt;div&gt;Silme operasyonuna ilişkin &amp;ccedil;alışmaya ait &amp;ouml;rnek bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; de aşağıdaki gibi.&lt;/div&gt;
&lt;div&gt;&lt;img src="/image.axd?picture=/2019/11/02/screenshot_7.png" alt="" /&gt;&lt;/div&gt;
&lt;h2&gt;Neler &amp;Ouml;ğrendim?&lt;/h2&gt;
&lt;div&gt;Elbette SkyNet'te ge&amp;ccedil;irdiğim bug&amp;uuml;n&amp;uuml;n de bana &amp;ouml;ğrettiği bir s&amp;uuml;r&amp;uuml; şey oldu. Bunları aşağıda yer alan maddelerle ifade etmeye &amp;ccedil;alıştım.&lt;/div&gt;
&lt;ul&gt;
&lt;li&gt;Bir protobuf dosyası nasıl hazırlanır ve Go tarafında kullanılabilmesi i&amp;ccedil;in nasıl derlenir,&lt;/li&gt;
&lt;li&gt;Go tarafından MongoDB ile nasıl haberleşilir,&lt;/li&gt;
&lt;li&gt;MongoDB docker container'ına ait shell &amp;uuml;st&amp;uuml;nde nasıl &amp;ccedil;alışılır,&lt;/li&gt;
&lt;li&gt;Temel mongodb komutları nelerdir,&lt;/li&gt;
&lt;li&gt;Sunucudan istemciye stream a&amp;ccedil;arak tek tek mongo db dok&amp;uuml;manı nasıl&amp;nbsp;d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;r&lt;em&gt;(main.go'daki GetPlayerList metoduna bakın)&lt;/em&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;h2&gt;Eksikliği Hissedilen Konular&lt;/h2&gt;
&lt;p&gt;Her ne kadar pomodoro tekniği ile &amp;ccedil;alışmalarımı olabildiğince verimli hale getirsem de ister istemez yaşlı zihnim yoruluyor. Dolayısıyla şunları da yapabilsem iyi olurdu dediğim şeyler var. Bunları da şu iki madde ile sıralayabilirim.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;İstemci tarafını Go tabanlı bir web client olarak geliştirmeyi deneyebiliriz. Terminalden hallice daha iyidir. En&amp;nbsp;azından &amp;ccedil;alışma sırasında yaşadığım Trim ihlali oluşmaz.&lt;/li&gt;
&lt;li&gt;Bir &amp;ccedil;ok sunucu metodunda hata kontrol&amp;uuml; var ancak bunların &amp;ccedil;alışıp &amp;ccedil;alışmadığı test etmek gerekiyor. Yani Code Coverage değerimizi neredeyse 0. Yazıyla sıfır :) Bir Go uygulamasındaki fonksiyonlar i&amp;ccedil;in Unit Test'ler nasıl yazılır &amp;ouml;ğrenmem lazım.&lt;/li&gt;
&lt;/ul&gt;
&lt;h2&gt;G&amp;ouml;rev Listeniz&lt;/h2&gt;
&lt;p&gt;Ve tabii kabul ederseniz sizin i&amp;ccedil;in iki g&amp;uuml;zel g&amp;ouml;revim var :)&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Select * from players where fullname like 'A%' gibi bir sorguya karşılık gelecek mongodb fonksiyonunu geliştirip uygulamaya ekleyin.&lt;/li&gt;
&lt;li&gt;G&amp;uuml;ncelleme fonksiyonunu tamamlayın.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;B&amp;ouml;ylece geldik SkyNet'te bir g&amp;uuml;n&amp;uuml;n daha sonuna. Sonraki &amp;ccedil;alışmada Wails paketini kullanarak Go ile yazılmış bir masa&amp;uuml;st&amp;uuml; programı geliştirmek niyetindeyim. O zaman dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2019-12-18 08:00:00</pubDate>
  <slug>mongodb-ile-bir-go-uygulamasini-konusturmak</slug>
  <tags>
    <tag>go-programming-language</tag>
    <tag>mongodb</tag>
    <tag>docker</tag>
    <tag>g-r-p-c</tag>
    <tag>pomodoro</tag>
    <tag>rest</tag>
    <tag>api</tag>
    <tag>protobuf</tag>
    <tag>container</tag>
    <tag>brew</tag>
    <tag>proto</tag>
    <tag>json</tag>
  </tags>
  <categories>
    <category>GoLang</category>
  </categories>
</post>