<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Temsilciler (Delegates) Kavramına Giriş</title>
  <description>Bugünkü makalemizde, C# programlama dilinde ileri seviye kavramlardan biri olan Temsilcileri(delegates) incelemeye başlayacağız. Temsilciler ileri seviye bir kavram olmasına rağmen, her seviyden C# programcısının bilmesi gereken unsurlardandır. Uygulamalarımızı temsilciler olmadan da geliştirebiliriz. Ancak bu durumda, yapamıyacaklarımız, yapabileceklerimizin önüne geçecektir. Diğer yandan temsilcilerin kullanımını gördükçe bize getireceği avantajları daha iyi anlayacağımız kanısındayım. Bu makalemizde temsilcileri en basit haliyle anlamaya çalışıcağız.</description>
  <content>&lt;p align="left"&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p align="left"&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde, C# programlama dilinde ileri seviye kavramlardan biri olan Temsilcileri(delegates) incelemeye başlayacağız. Temsilciler ileri seviye bir kavram olmasına rağmen, her seviyden C# programcısının bilmesi gereken unsurlardandır. Uygulamalarımızı temsilciler olmadan da geliştirebiliriz. Ancak bu durumda, yapamıyacaklarımız, yapabileceklerimizin &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ecektir. Diğer yandan temsilcilerin kullanımını g&amp;ouml;rd&amp;uuml;k&amp;ccedil;e bize getireceği avantajları daha iyi anlayacağımız kanısındayım. Bu makalemizde temsilcileri en basit haliyle anlamaya &amp;ccedil;alışıcağız.&lt;/p&gt;
&lt;p align="left"&gt;Temsilci (delegate), program i&amp;ccedil;erisinde bir veya daha fazla metodu g&amp;ouml;steren(işaret eden), referans t&amp;uuml;r&amp;uuml;nden bir nesnedir. Programlarımızda temsilciler kullanmak istediğimizde, &amp;ouml;ncelikle bu temsilcinin tanımını yaparız. Temsilci tanımları, aray&amp;uuml;zlerdeki metod tanımlamaları ile neredeyse aynıdır. Tek fark delegate anahtar s&amp;ouml;zc&amp;uuml;ğ&amp;uuml;n&amp;uuml;n yer almasıdır. Bununla birlikte, bir temsilci tanımlandığında, aslında işaret edebileceği metod(ların) imzalarınıda belirlemiş olur. Dolayısıyla, bir temsilciyi sadece tanımladığı metod imzasına uygun metodlar i&amp;ccedil;in kullanabiliceğimizi s&amp;ouml;yleyebiliriz. Temsilci tanımları tasarım zamanında yapılır. Bir temsilciyi, bir metodu işaret etmesi i&amp;ccedil;in kullanmak istediğimizde ise, &amp;ccedil;alışma zamanında onu new yapılandırıcısı ile oluşturur ve işaret etmesini istediğimiz metodu ona parametre olarak veririz. Bir temsilci tanımı genel haliyle, aşağıdaki şekildeki gibidir.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk43_1.gif" alt="" width="625" height="201" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt;Şekil 1. Temsilci tanımlaması.&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekildende g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, temsilciler aslında bir metod tanımlarlar fakat bunu uygulamazlar. İşte bu &amp;ouml;zellikleri ile aray&amp;uuml;zlerdeki metod tanılamalarına benzerler. Uygulamalarımızda, temsilci nesneleri ile g&amp;ouml;stermek yani işaret etmek istediğimiz metodlar bu imzaya sahip olmalıdır. Bildiğiniz gibi metod imzaları, metodun geri d&amp;ouml;n&amp;uuml;ş tipi ve aldığı parametreler ile belirlenmektedir.&lt;/p&gt;
&lt;p align="left"&gt;Bir temsilcinin tanımlanması, onu kullanmak i&amp;ccedil;in yeterli değildir elbette. Herşeyden &amp;ouml;nce bir amacımız olmalıdır. Bir temsilciyi &amp;ccedil;alışma zamanında oluşturabiliriz ve kullanabiliriz. Bir temsilci sadece bir tek metodu işaret edebileceği gibi, birden fazla metod i&amp;ccedil;in tanımlanmış ve oluşturulmuş temsilcileride kullanabiliriz. Diğer yandan, tek bir temsilcide birden fazla temsilciyi toplayarak bu temsilcilerin işaret ettiği, t&amp;uuml;m metodları tek bir seferde &amp;ccedil;alıştırma l&amp;uuml;ks&amp;uuml;nede sahibizdir. Ancak temsilciler ger&amp;ccedil;ek anlamda iki ama&amp;ccedil;la kullanılırlar. Bunlardan birincisi olaylardır(events). Diğer yandan, bug&amp;uuml;nk&amp;uuml; makalemizde işleyeceğimiz gibi, bir metodun &amp;ccedil;alışma zamanında, hangi metodların &amp;ccedil;alıştırılacağına karar vermesi gerektiği durumlarda kullanırız. Elbette bahsetmiş olduğumuz bu amacı, herhangibir temsilye ihtiya&amp;ccedil; duymadan da ger&amp;ccedil;ekleştirebiliriz. Ancak temsilcileri kullanmadığımızda, bize sağladığı &amp;uuml;st&amp;uuml;n programlama tekniği, kullanım kolaylığı ve artan verimliliğide g&amp;ouml;z ardı etmiş oluruz.&lt;/p&gt;
&lt;p align="left"&gt;Şimdi dilerseniz bahsetmiş olduğumuz bu ama&amp;ccedil;la ilgili bir &amp;ouml;rnek verelim ve konuyu daha iyi kavramaya &amp;ccedil;alışalım. &amp;Ouml;rneğin, personelimizin yapmış olduğu satış tutarlarına g&amp;ouml;re, prim hesabı yapan ve ilgili yerlere bu değişiklikleri yazan bir projemiz olsun. Burada primlerin hesaplanması i&amp;ccedil;in değişik katsayılar, yapılan satışın tutarına g&amp;ouml;re belirlenmiş olabilir. &amp;Ouml;rneğin bu oranlar d&amp;uuml;ş&amp;uuml;k, orta ve y&amp;uuml;ksek olarak tanımlanmış olsun. Personel hangi gruba giriyorsa, metodumuz ona uygun metodu &amp;ccedil;ağırsın. İşte bu durumda karar verici metodumuz, &amp;ccedil;alıştırabileceği metodları temsil eden temsilci nesnelerini parametre olarak alır. Yani, &amp;ccedil;alışma zamanında ilgili metodlar i&amp;ccedil;in temsilci nesneleri oluşturulur ve karar verici metoda , hangi metod &amp;ccedil;alıştırılacak ise onun temsilcisi g&amp;ouml;nderilir. B&amp;ouml;ylece uygulamamız &amp;ccedil;alıştığında, tek yapmamız gereken hangi metodun &amp;ccedil;alıştırılması isteniyorsa, bu metoda ilişkin temsilcinin, karar verici metoda g&amp;ouml;nderilmesi olucaktır.&lt;/p&gt;
&lt;p align="left"&gt;Olduk&amp;ccedil;a karşışık g&amp;ouml;r&amp;uuml;n&amp;uuml;yor. Ancak &amp;ouml;rnekleri yazdık&amp;ccedil;a daha iyi kavrayacağınıza inanıyorum. Şimdiki &amp;ouml;rneğimizde, temsilcilerin tasarım zamanında nasıl tanımlandığını, &amp;ccedil;alışma zamanında nasıl oluşturulduklarını ve karar verici bir metod i&amp;ccedil;in temsilcilerin nasıl kullanılacağını incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace Delegates1
{
     public class Calistir
     {
          public static int a;
          public delegate void temcilci(int deger); /* Temsilci tanımlamamızı yapıyoruz. Aynı zamanda temsilcimiz , değer d&amp;ouml;nd&amp;uuml;rmeyen ve integer tipte tek bir parametre alan bir metod tanımlıyor. Temsilcimizin adı ise temsilci.*/


          /* Şimdi bu temsilciyi kullacanak bir metod yazıyoruz. İşte karar verici metodumuz budur. Dikkat ederseniz metodumuz parametre olarak, temsilci nesnemiz tipinden bir temsilci(Delegate) alıyor. Daha sonra metod bloğu i&amp;ccedil;inde, parametre olarak ge&amp;ccedil;irilen bu temsilcinin işaret ettiği metod &amp;ccedil;ağırılıyor ve bu metoda parametre olarak integer tipte bir değer ge&amp;ccedil;iriliyor. Kısaca, metod i&amp;ccedil;inden, temsilcinin işaret ettiği metod &amp;ccedil;ağırılıyor. Burada, temsilci tanımına uygun olan metodun &amp;ccedil;ağırılması garanti altına alınmıştır. Yani, programın &amp;ccedil;alışması sırasında, new yapılandırıcısı kulllanarak oluşturacağımız bir temsilci(delegate), kendi metod tanımı ile uyuşmayan bir metod i&amp;ccedil;in yaratılmaya &amp;ccedil;alışıldığında bir derleyici hatası alacağızdır. Dolayısıyla bu, temsilcilerin y&amp;uuml;ksek g&amp;uuml;venlikli işaret&amp;ccedil;iler olmasını sağlar. Bu , temsilcileri, C++ dilindeki benzeri olan işaret&amp;ccedil;ilerden ayıran en &amp;ouml;nemli &amp;ouml;zelliktir. */
 
          public void Metod1(Calistir.temcilci t)
          {
                t(a);
          }
     }

     class Class1
     {
           /* IkıKat ve UcKat isimli metodlarımız, temsilcimizin programın &amp;ccedil;alışması sırasında işaret etmesini istediğimiz metodlar. Bu nedenle imzaları, temsilci tanımımızdaki metod imzası ile aynıdır. */
          
          public static void IkiKat(int sayi)
          {
               sayi=sayi*2;
              Console.WriteLine("IkiKat isimli metodun temsilcisi tarafindan &amp;ccedil;agirildi."+sayi.ToString());
          }
          public static void UcKat(int sayi)   
          {
               sayi=sayi*3;
               Console.WriteLine("UcKat isimli metodun temsilcisi tarafindan &amp;ccedil;agirildi."+sayi.ToString());
          }
          static void Main(string[] args)
         {
                /* Temsilci nesnelerimiz ilgili metodlar i&amp;ccedil;in oluşturuluyor. Burada, new yapılandırıcısı ile oluşturulan temsilci nesneleri parametre olarak, işaret edecekleri metodun ismini alıyorlar. Bu noktadan itibaren t1 isimli delegate nesnemiz IkiKat isimli metodu, t2 isimli delegate nesnemizde UcKat isimli metodu işaret ediceklerdir. */
               Calistir.temcilci t1=new Delegates1.Calistir.temcilci(IkiKat);
               Calistir.temcilci t2=new Delegates1.Calistir.temcilci(UcKat);
 
               Console.WriteLine("1 ile 20 arası değer girin");
                  Calistir.a=System.Convert.ToInt32(Console.ReadLine());
               Calistir c=new Calistir();
              /* Kullanıcının Console penceresinden girdiği değer g&amp;ouml;re, Calistir sınıfının a isimli integer tipteki değerini 10 ile karşılaştırılıyor. 10 dan b&amp;uuml;y&amp;uuml;kse, karar verici metodumuza t1 temsilcisi g&amp;ouml;nderiliyor. Bu durumda Metod1 isimli karar verici metodumuz, kendi kod bloğu i&amp;ccedil;inde t1 delegate nesnesinin temsil ettiği IkıKat metodunu, Calistir.a değişkeni ile &amp;ccedil;ağırıyor. Aynı işlem tarzı t2 delegate nesnesi i&amp;ccedil;inde ge&amp;ccedil;erli.*/

                   
               if(Calistir.a&amp;gt;=10)
               {
                    c.Metod1(t1);
               }
               else
               {
                    c.Metod1(t2);
               }
          }
     }
}&lt;/pre&gt;
&lt;p align="left"&gt;Uygulamamızı &amp;ccedil;alıştıralım ve bir değer girelim.&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt; &lt;img src="/makale/images/mk43_2.gif" alt="" width="549" height="127" border="0" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt;Şekil 2. Programın &amp;ccedil;alışmasının sonucu.&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;Bu basit &amp;ouml;rnek ile umarım temsilciler hakkında biraz olsun bilgi sahibi olmuşsunuzdur. Şimdi temsilciler ile ilgili kavramlarımıza devam edelim. Yukarıdaki &amp;ouml;rneğimiz ışığında temsilcileri programlarımızda temel olarak nasıl kullandığımızı aşağıdaki şekil ile daha kolay anlayabileceğimizi sanıyorum.&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt; &lt;img src="/makale/images/mk43_3.gif" alt="" width="492" height="429" border="0" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt;Şekil 3. Temsilcilerin Karar Verici metodlar ile kullanımı.&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;Yukarıdaki &amp;ouml;rneğimizde, her bir metod i&amp;ccedil;in tek bir temsilci tanımladık ve temsilcileri teker &amp;ccedil;ağırdık. Bu Single-Cast olarak adlandırılmaktadır. Ancak programlarımız da bazen, tek bir temsilciye birden fazla temsilci ekleyerek, birden fazla metodu tek bir temsilci ile &amp;ccedil;alıştırmak isteyebiliriz. Bu durumda Multi-Cast temsilciler tanımlarız. Şimdi multi-cast temsilciler ile ilgili bir &amp;ouml;rnek yapalım. Bu &amp;ouml;rneğimizde t1 isimli temsilcimiz, multi-cast temsilcimiz olucak.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace Delegates2
{
     public class temsilciler
     {
          public delegate void dgTemsilci(); /* Temsilcimiz tanımlanıyor. Geri d&amp;ouml;n&amp;uuml;ş değeri olmayan ve parametre almayan metodları temsil edebilir. */

          /* Metod1, Metod2 ve Metod3 temsilcilerimizin işaret etmesini istediğimiz metodlar olucaktır.*/
 

          public static void Metod1()
          {
               Console.WriteLine("Metod 1 &amp;ccedil;alıştırıldı.");
          }
          public static void Metod2()
          {
               Console.WriteLine("PI değeri 3.14 alınsın");
          }
          public static void Metod3()
          {
               Console.WriteLine("Mail g&amp;ouml;nderildi...");
          }
          /* Temsilcilerimizi &amp;ccedil;alıştıran metodumuz. Parametre olarak g&amp;ouml;nderilen temsilciyi, dolayısıyla bu temsilcinin işaret ettiği metodu alıyor. */

          public static void TemsilciCalistir(temsilciler.dgTemsilci dt)
          {
               dt();
/* Temsilcinin işaret ettiği metod &amp;ccedil;alıştırılıyor.*/
          }
     }
     class Class1
     {
          static void Main(string[] args)
          {
               /* &amp;Uuml;&amp;ccedil; metodumuz i&amp;ccedil;inde temsilci nesnelerimiz oluşturuluyor .*/
               temsilciler.dgTemsilci t1=new Delegates2.temsilciler.dgTemsilci(temsilciler.Metod1);

               temsilciler.dgTemsilci t2=new Delegates2.temsilciler.dgTemsilci(temsilciler.Metod2);

               temsilciler.dgTemsilci t3=new Delegates2.temsilciler.dgTemsilci(temsilciler.Metod3);

               Console.WriteLine("sadece t1");
               temsilciler.TemsilciCalistir(t1);
               Console.WriteLine("---");

               /* Burada t1 temsilcimize, t2 temsilcisi ekleniyor. Bu durumda, t1 temsilcimiz hem kendi metodunu hemde, t2 temsilcisinin işaret ettiği metodu işaret etmeye başlıyor. Bu halde iken TemsilciCalistir metodumuza t1 temsilcisini g&amp;ouml;ndermemiz her iki temsilcinin işaret ettiği metodların &amp;ccedil;alıştırılmasına neden oluyor.*/

               t1+=t2;
               Console.WriteLine("t1 ve t2");
               temsilciler.TemsilciCalistir(t1);
               Console.WriteLine("---");
               t1+=t3;
/* Şimdi t1 temsilcimiz hem t1, hem t2, hem de t3 temsilcilerinin işaret ettiği metodları işaret etmiş olucak.*/
               Console.WriteLine("t1,t2 ve t3");
               temsilciler.TemsilciCalistir(t1);
               Console.WriteLine("---");
               t1-=t2;

/* Burada ise t2 metodunu t1 temsilcimizden &amp;ccedil;ıkartıyoruz. B&amp;ouml;ylece, t1 temsilcimiz sadece t1 ve t3 temsilcilerini i&amp;ccedil;eriyor. */
               Console.WriteLine("t1 ve t3");
               temsilciler.TemsilciCalistir(t1);
               Console.WriteLine("---");
          }
     }
}&lt;/pre&gt;
&lt;p align="left"&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdaki sonucu elde ederiz.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk43_4.gif" alt="" width="341" height="283" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 4. Multi-Cast temsilciler.&lt;/p&gt;
&lt;p align="left"&gt;Geldik bir makalemizin daha sonuna. Bir sonraki makalemizde temsilcilerin kullanılıdığı olaylar(events) kavramına gireceğiz. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-01-20 10:00:00</pubDate>
  <slug>Temsilciler-(Delegates)-Kavramına-Giriş-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>delegate</tag>
    <tag>delegates</tag>
    <tag>attributes</tag>
    <tag>oop</tag>
    <tag>multicast-delegates</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>