<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Servis Operasyonlarını Kod Yardımıyla İzlemek – Event Kullanımı</title>
  <description>Oysaki operasyon çağrılarını işletim sisteminin Event Log’ larına yazdırtmak ya da, XML tabanlı bir dosyaya aktarılmasını sağlamak isteyebiliriz. Hatta söz konusu izlerin veritabanı üzerindeki bir tabloya yazdırılması da düşünülebilir vb… Bir başka deyişle operasyon çağrılarının izlenmesi sırasında oluşan log verilerini, herhangibir kaynağa doğru yazdırmak isteyebiliriz. Böyle bir durumda, tasarlamış olduğumuz tiplerin, onları kullanan object user’ lara alternatif bir yol sunması gerekmektedir. Nitekim oluşturulan log verisinin nereye yazılacağına object user’ ın karar vermesi, çok daha esnek bir izleme yapısı oluşturulmasını sağlayacaktır. Peki bunu nasıl gerçekleştirebiliriz?</description>
  <content>&lt;p&gt;&lt;a href="/pics/blg223_Giris.jpg"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border: 0px;" title="blg223_Giris" src="/pics/blg223_Giris_thumb.jpg" alt="blg223_Giris" width="302" height="202" align="right" border="0" /&gt;&lt;/a&gt; Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Suyun dibinden bir baloncuk y&amp;uuml;kselmeye başlar. Taze ve temiz hava ile temas etmek i&amp;ccedil;in can atmaktadır. Ancak kat etmesi gereken epey bir mesafe vardır. Daha da hızlanabilmek ister. Y&amp;uuml;kselirken karşısına bir baloncuk daha &amp;ccedil;ıkar ve doğrudan ona koşar. Artık ikisi birlikte, daha hızlı y&amp;uuml;kselmektedirler.&lt;/p&gt;
&lt;p&gt;&amp;ldquo;Birlikten kuvvet doğar&amp;rdquo; der, alttan gelen &amp;ouml;tekine. Ama artık havasızlıktan boğulmak &amp;uuml;zeredirler. Neyse ki yollarına başka bir baloncuk daha &amp;ccedil;ıkar. &amp;Uuml;&amp;ccedil; baloncuk birleşerek daha b&amp;uuml;y&amp;uuml;k bir tane oluşturur. S&amp;uuml;ratler artmıştır. G&amp;uuml;n ışığına, taze havaya &amp;ccedil;ok, &amp;ccedil;ok az kalmıştır. Ve nihayettt&amp;hellip;Hımmmm!!! Temiz hava&amp;hellip;&lt;/p&gt;
&lt;p&gt;Bu şairane diyemeyeceğim kadar k&amp;ouml;t&amp;uuml; girişten sonra &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt; baloncukların konumuzla ne alakası olduğunu d&amp;uuml;ş&amp;uuml;nebilirsiniz elbette &lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt; Aslında bu g&amp;uuml;n irdeleyeceğimiz konunun &amp;ouml;z&amp;uuml;nde Olaylar(Events) yer almakta. Ayrıca s&amp;ouml;z konusu bir olay tanımının, &amp;uuml;st tarafta doğru&lt;em&gt;(ama kodun i&amp;ccedil;erisinden baktığımızda da alt tarafa doğru y&amp;uuml;r&amp;uuml;d&amp;uuml;ğ&amp;uuml;n&amp;uuml; d&amp;uuml;ş&amp;uuml;nebiliriz)&lt;/em&gt; aktarılması s&amp;ouml;z konusu.&lt;em&gt; (WPF tarafında buna sık&amp;ccedil;a rastlandığını ve Event Bubbling şeklinde ifadeler ile tanımlandığını belirtelim)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/post/Servis-Operasyonlarini-Kod-Yardimiyla-Izlemek"&gt;Servis Operasyonlarını Kod Yardımıyla İzlemek&lt;/a&gt; başlıklı yazımızda, &lt;strong&gt;IIS(Internet Information Services)&lt;/strong&gt; dışında&lt;strong&gt; Self-Hosted&lt;/strong&gt; modelinde yayınlanan servislere ait operasyon &amp;ccedil;ağrılarının nasıl izlenebileceğini incelemeye &amp;ccedil;alışmıştık. Geliştirmiş olduğumuz tipler yardımıyla, istemcilerden servis operasyonlarına gelen &amp;ccedil;ağrı &amp;ouml;ncesi ve sonrası durumları, &lt;strong&gt;Text&lt;/strong&gt; tabanlı olarak dosyaya kaydetmiştik. &lt;strong&gt;Text&lt;/strong&gt; tabanlı dosyaya kaydetme işlemi aslında bir zorlama olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Nitekim s&amp;ouml;z konusu yazıda uygulanan &amp;ccedil;&amp;ouml;z&amp;uuml;me g&amp;ouml;re, operasyon &amp;ccedil;ağrıları ancak &lt;strong&gt;text&lt;/strong&gt; tabanlı dosyaya bakılarak takip edilebilir &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Oysaki operasyon &amp;ccedil;ağrılarını işletim sisteminin &lt;strong&gt;Event Log&amp;rsquo;&lt;/strong&gt; larına yazdırtmak ya da,&lt;strong&gt; XML &lt;/strong&gt;tabanlı bir dosyaya aktarılmasını sağlamak isteyebiliriz. Hatta s&amp;ouml;z konusu izlerin veritabanı &amp;uuml;zerindeki bir tabloya yazdırılması da d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir vb&amp;hellip; Bir başka deyişle operasyon &amp;ccedil;ağrılarının izlenmesi sırasında oluşan log verilerini, herhangibir kaynağa doğru yazdırmak isteyebiliriz. B&amp;ouml;yle bir durumda, tasarlamış olduğumuz tiplerin, onları kullanan &lt;strong&gt;object user&lt;/strong&gt;&amp;rsquo; lara alternatif bir yol sunması gerekmektedir. Nitekim oluşturulan &lt;strong&gt;log&lt;/strong&gt; verisinin nereye yazılacağına &lt;strong&gt;object user&amp;rsquo;&lt;/strong&gt; ın karar vermesi, &amp;ccedil;ok daha esnek bir izleme yapısı oluşturulmasını sağlayacaktır. Peki bunu nasıl ger&amp;ccedil;ekleştirebiliriz?&lt;/p&gt;
&lt;p&gt;Aslında elimizde &amp;ouml;nemli ve b&amp;uuml;y&amp;uuml;k bir koz vardır. &lt;strong&gt;Olaylar(Events).&lt;/strong&gt; &lt;strong&gt;Object User&amp;rsquo;&lt;/strong&gt; lar&lt;em&gt;(bir başka deyişle servis operasyonlarını izlemek ile ilişkili kodlamaları yapanlar) &lt;/em&gt;tasarladığımız servis davranışı i&amp;ccedil;erisinde tanımlayacağımız &lt;strong&gt;olaya/olaylara(Events) &lt;/strong&gt;abone olaraktan, &amp;uuml;retilen&lt;strong&gt; log&amp;rsquo;&lt;/strong&gt; ları nereye isterlerse yazdırabilirler.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/Exclamation_11.gif"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border: 0px;" title="Exclamation" src="/pics/Exclamation_thumb_11.gif" alt="Exclamation" width="48" height="48" align="left" border="0" /&gt;&lt;/a&gt; Dolayısıyla yazımızın bundan sonraki kısımlarında olay tabanlı bir geliştirme yapacağımızı belirtmek isterim. Olaylar ile ilişkili olarak &lt;a href="/post/C-Temelleri-Olaylar%C4%B1(Events)-Kavramak-bsenyurt-com-dan" target="_blank"&gt;C# Temelleri - Olayları(Events) Kavramak&lt;/a&gt; başlıklı yazıya bakmanızı ve eski bilgilerinizi tazeleminizi &amp;ouml;nerebilirim &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Senaryomuzda olay metodlarına bilgi aktarmamız da son derece yerinde olacaktır. Bu ama&amp;ccedil;la &lt;strong&gt;EventArgs&lt;/strong&gt; tipinden t&amp;uuml;reyen ve aşağıdaki i&amp;ccedil;eriğe sahip olan iki tip tasarladığımızı d&amp;uuml;ş&amp;uuml;nebiliriz. Nitekim operasyon &amp;ccedil;ağrısı &amp;ouml;ncesi ve sonrası durumlara ait bilgileri taşımak niyetinde olduğumuzdan iki ayrı arg&amp;uuml;man tipi işimizi g&amp;ouml;rebilir &lt;em&gt;(veya ortak &amp;uuml;yeleri bir &amp;uuml;st tip i&amp;ccedil;erisinde toplayacak bir yol da izleyebilirsiniz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg223_EventArgsDiagram.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg223_EventArgsDiagram" src="/pics/blg223_EventArgsDiagram_thumb.gif" alt="blg223_EventArgsDiagram" width="289" height="433" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;OptAfterCallEventArgs&lt;/strong&gt; sınıfı &lt;strong&gt;EventArgs&lt;/strong&gt; tipininden t&amp;uuml;retilmiştir ve &amp;ouml;zellikle &lt;strong&gt;IParameterInspector&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; &amp;uuml;zerinden gelen &lt;strong&gt;AfterCall&lt;/strong&gt; metodunun parametrik bilgilerini ve ek diğer verileri taşımak &amp;uuml;zere tasarlanmıştır. Bu anlamda, operasyona yapılan &amp;ccedil;ağrı sonrasında, hangi servisin hangi operasyonunun icra edilmekte olduğu, hangi değerin geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml;, output parametrelerinin i&amp;ccedil;eriği ve &amp;ccedil;ağrı zamanı gibi bilgiler ele alınmaktadır. Sınıfın basit i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace InspectorLib 
{ 
    public class OptAfterCallEventArgs 
        :EventArgs 
    { 
        public string ServiceName { get; set; } 
        public string OperationName { get; set; } 
        public object ReturnValue { get; set; } 
        public object CorrelationState { get; set; } 
        public object[] Outputs { get; set; } 
        public DateTime CallTime { get; set; } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;OptBeforeCallEventArgs&lt;/strong&gt; sınıfı da benzer şekilde &lt;strong&gt;EventArgs&lt;/strong&gt; tipinden t&amp;uuml;retilmiştir. Bu sınıfa ait nesne &amp;ouml;rnekleri ile de, &lt;strong&gt;IParameterInspector&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; dolayısıyla gelen &lt;strong&gt;BeforeCall&lt;/strong&gt; metodunun parametrik bilgileri ve ek verilerin, ilgili olay metoduna aktarılması hedeflenmektedir. Buna g&amp;ouml;re hangi servis i&amp;ccedil;in hangi operasyon &amp;ccedil;ağrısının yapılacağı, operasyona gelen parametre bilgileri ve operasyonun icra zamanı gibi veriler toplanabilmektedir. S&amp;ouml;z konusunu sınıfın basit i&amp;ccedil;eriği de aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace InspectorLib 
{ 
    public class OptBeforeCallEventArgs 
        :EventArgs 
    { 
        public string ServiceName { get; set; } 
        public string OperationName { get; set; } 
        public object[] Inputs { get; set; } 
        public DateTime CallTime { get; set; } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Bu işlemin ardından &lt;strong&gt;IParameterInspector&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; implemente eden yeni izleyicimizin&lt;strong&gt;(OptDetective sınıfı)&lt;/strong&gt; i&amp;ccedil;eriğini de aşağıdaki gibi yazabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg223_OptDetectiveDiagram.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg223_OptDetectiveDiagram" src="/pics/blg223_OptDetectiveDiagram_thumb.gif" alt="blg223_OptDetectiveDiagram" width="612" height="323" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.ServiceModel.Dispatcher;

namespace InspectorLib 
{ 
    public class OptDetective 
        :IParameterInspector 
    { 
        public string ServiceName { get; set; } 
        // Olay tanımlamaları yapılır 
        public event EventHandler&amp;lt;OptAfterCallEventArgs&amp;gt; AfterCalled; 
        public event EventHandler&amp;lt;OptBeforeCallEventArgs&amp;gt; BeforeCalled;

        // Olay metodları 
        public void OnAfterCalled(OptAfterCallEventArgs args) 
        { 
            // Eğer OptAfterCalled olayına abone(Subscribe) olunmuşsa &amp;ccedil;ağır 
            if (AfterCalled != null) 
                AfterCalled(this, args); // Olayı tetikleyen &amp;ccedil;alışma zamanındaki OptDetective nesne &amp;ouml;rneği this ile ifade edilirken, olay metoduna taşınacak bilgiler de OptAfterCallEventArgs tipinden olan args değişkeni ile taşınır. 
        } 
        public void OnBeforeCalled(OptBeforeCallEventArgs args) 
        { 
            // Eğer OptBeforeCalled olayına abone(Subscribe) olunmuşsa &amp;ccedil;ağır 
            if (BeforeCalled != null) 
                BeforeCalled(this, args); // Olayı tetikleyen &amp;ccedil;alışma zamanındaki OptDetective nesne &amp;ouml;rneği this ile ifade edilirken, olay metoduna taşınacak bilgiler de OptBeforeCallEventArgs tipinden olan args değişkeni ile taşınır. 
        }

        public OptDetective(string serviceName) 
        { 
            ServiceName = serviceName;            
        } 
        #region IParameterInspector Members

        public void AfterCall(string operationName, object[] outputs, object returnValue, object correlationState) 
        { 
            // Olay metodu &amp;ccedil;ağırılır ve parametre olarak OptAfterCallEventArgs tipinden nesne &amp;ouml;rneği verilir. Bu nesne ile gerekli bilgilerin olay metodu i&amp;ccedil;erisine taşınması sağlanmış olunur. 
            OnAfterCalled( 
                new OptAfterCallEventArgs 
                { 
                     ServiceName=this.ServiceName, 
                      CallTime=DateTime.Now, 
                       CorrelationState=correlationState, 
                        OperationName=operationName, 
                         Outputs=outputs, 
                         ReturnValue=returnValue 
                } 
                ); 
        }

        public object BeforeCall(string operationName, object[] inputs) 
        { 
            // Olay metodu &amp;ccedil;ağırılır ve parametre olarak OptBeforeCallEventArgs tipinden nesne &amp;ouml;rneği verilir. Bu nesne ile gerekli bilgilerin olay metodu i&amp;ccedil;erisine taşınması sağlanmış olunur. 
            OnBeforeCalled( 
                new OptBeforeCallEventArgs 
                { 
                     ServiceName=this.ServiceName, 
                      Inputs=inputs, 
                       CallTime=DateTime.Now, 
                        OperationName=operationName 
                } 
                ); 
            return null; 
        }

        #endregion 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;OptDetective&lt;/strong&gt; sınıfı i&amp;ccedil;erisinde iki adet &lt;strong&gt;event&lt;/strong&gt; tanımı yapıldığı g&amp;ouml;r&amp;uuml;lmektedir. &lt;strong&gt;AfterCalled&lt;/strong&gt; ve &lt;strong&gt;BeforeCalled&lt;/strong&gt;. Ayrıca bu olayların &lt;strong&gt;manuel&lt;/strong&gt; olarak tetiklenmesi i&amp;ccedil;in de, &lt;strong&gt;OnAfterCalled&lt;/strong&gt; ve &lt;strong&gt;OnBeforeCalled&lt;/strong&gt; isimli metodlar yazılmıştır. Her iki metod i&amp;ccedil;erisinde de, bağlı oldukları olayların y&amp;uuml;klenip y&amp;uuml;klenmediği kontrol edilmekte ve eğer y&amp;uuml;kl&amp;uuml;yseler &amp;ccedil;ağırılmaları sağlanmaktadır.&lt;/p&gt;
&lt;p&gt;Olaylarların tetiklenmesi sonucu &lt;strong&gt;AfterCall&lt;/strong&gt; ve &lt;strong&gt;BeforeCall&lt;/strong&gt; isimli aray&amp;uuml;z metodları &amp;ccedil;ağırılır. Bu &amp;ccedil;ağrılar sırasında da uygun olan arg&amp;uuml;man tipleri &amp;ouml;rneklenmekte ve kullanılmaktadır. &amp;Ouml;rneğin &lt;strong&gt;BeforeCall&lt;/strong&gt; fonksiyonu &amp;ccedil;ağırıldığında, &lt;strong&gt;OnBeforeCalled&lt;/strong&gt; metodu devreye girmekte ve &lt;strong&gt;OptBeforeCallEventArgs&lt;/strong&gt; tipinden nesne &amp;ouml;rneği ile servis adı, operasyon adı, &amp;ccedil;ağrı zamanı ve operasyon input değerleri gibi bilgiler, olay metoduna aktarılmaktadır.&lt;/p&gt;
&lt;p&gt;Daha &amp;ouml;nceki yazımızdan da hatırlayacağınız &amp;uuml;zere, operasyon ve servis seviyesinde kullanılan &amp;ouml;zel davranış tiplerimiz bulunmaktadır. Bunlarda &amp;ouml;zel operasyon davranışı olanı, &lt;strong&gt;OptDetective&lt;/strong&gt; tipini kullanacaktır. Ancak daha da &amp;ouml;nemlisi, &amp;ouml;zel operasyon davranışının(Custom Operation Behavior), &lt;strong&gt;OptDetective&lt;/strong&gt; &amp;uuml;zerindeki olaylara abone olmasıdır. Bu tipi aşağıdaki gibi tasarlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg223_OptDetectiveOperationDiagram.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg223_OptDetectiveOperationDiagram" src="/pics/blg223_OptDetectiveOperationDiagram_thumb.gif" alt="blg223_OptDetectiveOperationDiagram" width="482" height="300" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.ServiceModel.Description;

namespace InspectorLib 
{ 
    public class OptDetectiveOperationBehavior 
        :IOperationBehavior 
    { 
        // Olay tanımlamaları 
        public event EventHandler&amp;lt;OptAfterCallEventArgs&amp;gt; ServiceOperationAfterCalled; 
        public event EventHandler&amp;lt;OptBeforeCallEventArgs&amp;gt; ServiceOperationBeforeCalled;

        // Olay metodlar 
        public void OnServiceOperationAfterCalled(OptAfterCallEventArgs args) 
        { 
            // ServiceOperationAfterCalled olayı y&amp;uuml;klenmişse, bu olay sonrası devreye girecek metodu &amp;ccedil;ağır 
            if (ServiceOperationAfterCalled != null) 
                ServiceOperationAfterCalled(this, args); 
        } 
        public void OnServiceOperationBeforeCalled(OptBeforeCallEventArgs args) 
        { 
            // ServiceOperationBeforeCalled olayı y&amp;uuml;klenmişse, bu olay sonrası devreye girecek metodu &amp;ccedil;ağır 
            if (ServiceOperationBeforeCalled != null) 
                ServiceOperationBeforeCalled(this, args); 
        }

        #region IOperationBehavior Members

        public void AddBindingParameters(OperationDescription operationDescription, System.ServiceModel.Channels.BindingParameterCollection bindingParameters) 
        { 
        }

        public void ApplyClientBehavior(OperationDescription operationDescription, System.ServiceModel.Dispatcher.ClientOperation clientOperation) 
        { 
        }

        public void ApplyDispatchBehavior(OperationDescription operationDescription, System.ServiceModel.Dispatcher.DispatchOperation dispatchOperation) 
        { 
            string serviceName = null; 
            if (dispatchOperation.Parent.Type != null) 
            { 
                // Service adı yakalanır 
                serviceName = dispatchOperation.Parent.Type.Name; 
                //OptDetective tipine ait nesne &amp;ouml;rneği oluşturulur ve servis adı yapıcı metoduna parametre olarak g&amp;ouml;nderilir. 
                OptDetective optDtcv = new OptDetective(serviceName); 
                // OptDetective nesne &amp;ouml;rneğinin AfterCalled ve BeforeCalled olaylarına abone olunur. Anonymouse Method' lar yardımıyla da ilgili olay metodları tetiklenir 
                optDtcv.AfterCalled += (snd,arg) =&amp;gt; { OnServiceOperationAfterCalled(arg); }; 
                optDtcv.BeforeCalled += (snd, arg) =&amp;gt; { OnServiceOperationBeforeCalled(arg); }; 
                // Operasyon i&amp;ccedil;in gerekli inspector tipi bildiririlir 
                dispatchOperation.ParameterInspectors.Add(optDtcv);  
            } 
        }

        public void Validate(OperationDescription operationDescription) 
        { 
        }

        #endregion 
    } 
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &amp;ouml;zel operasyon davranışı i&amp;ccedil;erisinde, &lt;strong&gt;OptDetective&lt;/strong&gt; tarafından sunulan &lt;strong&gt;AfterCalled&lt;/strong&gt; ve &lt;strong&gt;BeforeCalled&lt;/strong&gt; olaylarına abonelik işlemi ger&amp;ccedil;ekleştirilmektedir. Bunun i&amp;ccedil;in &lt;strong&gt;ApplyDispatchBehavior&lt;/strong&gt; metodu i&amp;ccedil;erisinde gerekli d&amp;uuml;zenlemeler yapılmıştır. Diğer yandan &lt;strong&gt;OptDetectiveOperationBehavior&lt;/strong&gt; tipinin kendisi de, iki adet olay bildirimi yapmaktadır. &lt;strong&gt;ServiceOperationAfterCalled&lt;/strong&gt; ve &lt;strong&gt;ServiceOperationBeforeCalled&lt;/strong&gt;. Benzer bir olay bildirim ve uygulama şekli &amp;ouml;zel servis davranışı i&amp;ccedil;in de yapılmalıdır. Aynen aşağıda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg223_OptDetectiveServiceDiagram.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg223_OptDetectiveServiceDiagram" src="/pics/blg223_OptDetectiveServiceDiagram_thumb.gif" alt="blg223_OptDetectiveServiceDiagram" width="468" height="278" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.ServiceModel.Description;

namespace InspectorLib 
{ 
        public class OptDetectiveServiceBehavior 
        :IServiceBehavior 
    { 
        // Olay tanımlamaları 
        public event EventHandler&amp;lt;OptAfterCallEventArgs&amp;gt; ServiceOperationAfterCalled; 
        public event EventHandler&amp;lt;OptBeforeCallEventArgs&amp;gt; ServiceOperationBeforeCalled;

        // Olay metodlar 
        public void OnServiceOperationAfterCalled(OptAfterCallEventArgs args) 
        { 
            // ServiceOperationAfterCalled olayı y&amp;uuml;klenmişse, bu olay sonrası devreye girecek metodu &amp;ccedil;ağır 
            if (ServiceOperationAfterCalled != null) 
                ServiceOperationAfterCalled(this, args); 
        } 
        public void OnServiceOperationBeforeCalled(OptBeforeCallEventArgs args) 
        { 
            // ServiceOperationBeforeCalled olayı y&amp;uuml;klenmişse, bu olay sonrası devreye girecek metodu &amp;ccedil;ağır 
            if (ServiceOperationBeforeCalled != null) 
                ServiceOperationBeforeCalled(this, args); 
        }

        #region IServiceBehavior Members

        public void AddBindingParameters(ServiceDescription serviceDescription, System.ServiceModel.ServiceHostBase serviceHostBase, System.Collections.ObjectModel.Collection&amp;lt;ServiceEndpoint&amp;gt; endpoints, System.ServiceModel.Channels.BindingParameterCollection bindingParameters) 
        { 
        }

        public void ApplyDispatchBehavior(ServiceDescription serviceDescription, System.ServiceModel.ServiceHostBase serviceHostBase) 
        { 
            foreach (ServiceEndpoint endpoint in serviceDescription.Endpoints) 
                foreach (OperationDescription operation in endpoint.Contract.Operations) 
                { 
                    // Custom Operation Behavior nesne &amp;ouml;rneği tanımlanır. 
                    OptDetectiveOperationBehavior optBevahior = new OptDetectiveOperationBehavior(); 
                    // Bu nesne &amp;ouml;rneğinin ServiceOperationAfterCalled ve ServiceOperationBeforeCalled olaylarına abone olunur 
                    optBevahior.ServiceOperationAfterCalled += (snd, args) =&amp;gt; { OnServiceOperationAfterCalled(args); }; 
                    optBevahior.ServiceOperationBeforeCalled += (snd, args) =&amp;gt; { OnServiceOperationBeforeCalled(args); };                    
                    operation.Behaviors.Add(optBevahior); 
                } 
        }

        public void Validate(ServiceDescription serviceDescription, System.ServiceModel.ServiceHostBase serviceHostBase) 
        { 
        }

        #endregion 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;OptDetectiveServiceBehavior&lt;/strong&gt; tipi daha &amp;ouml;nceki yazımızdaki &amp;ouml;rnekten de bilindiği &amp;uuml;zere servis davranışı olarak uygulanmaktadır. Bu tip i&amp;ccedil;erisinde de &lt;strong&gt;AfterCall&lt;/strong&gt; ve &lt;strong&gt;BeforeCall&lt;/strong&gt; takipleri i&amp;ccedil;in birer olay metodu tanımlandığı g&amp;ouml;r&amp;uuml;lmektedir. Ayrıca, &lt;strong&gt;ApplyDispatchBehavior&lt;/strong&gt; metodu i&amp;ccedil;erisinde yer alan d&amp;ouml;ng&amp;uuml;de, her bir servis operasyonu i&amp;ccedil;in gerekli operasyon davranışı bildirimi yapılırken, bu tipe ait olaylara da abone olunduğu g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;Tanımladığımız bu yeni tipler olay bazlı bir modeli kullanmaktadır. Teorimize g&amp;ouml;re &lt;strong&gt;OptDetectiveServiceBehavior&lt;/strong&gt; tipini kullanarak yeni bir davranış y&amp;uuml;kleyen servisler, &lt;strong&gt;OptDetective&lt;/strong&gt; i&amp;ccedil;erisinde yer alan olay metodlarına erişebiliyor olmalıdır. Tabi bir &amp;ouml;nceki yazımızdan farklı olarak &amp;ouml;zel servis ve operasyon davranış tiplerinin &lt;strong&gt;nitelik(Attribute)&lt;/strong&gt; bazlı olmadıkları g&amp;ouml;r&amp;uuml;lmektedir. Bu nedenle &lt;strong&gt;ServiceHost&lt;/strong&gt; nesne &amp;ouml;rneği i&amp;ccedil;in kod tarafında bilin&amp;ccedil;li olarak gerekli davranış bildirimleri yapılmalıdır. Daha &amp;ouml;nceki yazımızda kullandığımız &amp;ouml;rnek &amp;uuml;zerinden ilerlediğimiz i&amp;ccedil;in aynı servis host uygulamasını ve servis tiplerini kullanabiliriz. Bu ama&amp;ccedil;la Form kodlarını aşağıdaki gibi geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.ServiceModel; 
using System.Windows.Forms; 
using AdventureWorksFinance; 
using InspectorLib;

namespace HostApp 
{ 
    public partial class Form1 
        : Form 
    { 
        ServiceHost host=null;

        public Form1() 
        { 
            InitializeComponent(); 
            btnOpen.Enabled = true; 
            btnClose.Enabled = false; 
        }

        private void btnOpen_Click(object sender, EventArgs e) 
        { 
            host=new ServiceHost(typeof(AccountService));           

            host.Opened += (s, ea) =&amp;gt; 
            { 
                lstOperationCalls.Items.Add(String.Format("Servis a&amp;ccedil;ık {0}",DateTime.Now.ToLongTimeString())); 
                btnOpen.Enabled = false; 
                btnClose.Enabled = true; 
            }; 
            host.Closed += (s, ea) =&amp;gt; 
            { 
                lstOperationCalls.Items.Add(String.Format("Servis kapatıldı {0}", DateTime.Now.ToLongTimeString())); 
                btnOpen.Enabled = true; 
                btnClose.Enabled = false; 
            };

            OptDetectiveServiceBehavior behavior = new OptDetectiveServiceBehavior(); 
            if (host.Description.Behaviors.Find&amp;lt;OptDetectiveServiceBehavior&amp;gt;() == null) 
            { 
                host.Description.Behaviors.Add(behavior); 
            } 
            // OptDetectiveServiceBehavior nesne &amp;ouml;rneği oluşturulup, servis davranışı olarak eklendikten sonra ilgili olay metodlarına abone olunur. 
            behavior.ServiceOperationAfterCalled += (snd, arg) =&amp;gt; { 
                string info = String.Format("{0} {1} {2} {3} [{4}]", arg.ServiceName, arg.OperationName, arg.ReturnValue, arg.CallTime,"After Call"); 
                lstOperationCalls.Items.Add(info); 
            }; 
            behavior.ServiceOperationBeforeCalled += (snd, arg) =&amp;gt; { 
                string info = String.Format("{0} {1} {2} {3} [{4}]", arg.ServiceName, arg.OperationName, arg.Inputs.Length, arg.CallTime,"Before Call"); 
                lstOperationCalls.Items.Add(info); 
            };

            host.Open(); 
        }

        private void btnClose_Click(object sender, EventArgs e) 
        { 
            host.Close(); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere servis davranışı y&amp;uuml;klendikten sonra gerekli olay metodları da bağlanmıştır. Burada &lt;strong&gt;AfterCall&lt;/strong&gt; veya &lt;strong&gt;BeforeCall&lt;/strong&gt; olayları ger&amp;ccedil;ekleştirildiğinde sembolik olarak &lt;strong&gt;ListBox&lt;/strong&gt; kontrol&amp;uuml;ne bir takım bilgiler yazdırılmıştır. Bu bilgilerin &lt;strong&gt;OptAfterCallEventArgs&lt;/strong&gt; ve &lt;strong&gt;OptBeforeCallEventArgs&lt;/strong&gt; tiplerinden geldiği unutulmamalıdır &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Geliştirici bu noktada tamamen &amp;ouml;zg&amp;uuml;rd&amp;uuml;r. Sonu&amp;ccedil;ta olayla ilişkili bilgiler, en alttaki &lt;strong&gt;OptDetective&lt;/strong&gt; tipinden, buradaki olay metodlarına kadar taşınmaktadır. Bu bilgiler istenilen şekilde kullanılabilir. Yani &lt;strong&gt;ListBox&lt;/strong&gt; i&amp;ccedil;eriğine yazdırılmaları şart değildir. Daha &amp;ouml;nceden de belirttiğimiz gibi veritabanına, XML dosyasına, sistem Event Log&amp;rsquo; larına vb yerlere yazılabilirler.&lt;/p&gt;
&lt;p&gt;Uygulamanın &amp;ccedil;alışma zamanı sonu&amp;ccedil;larına baktığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan &amp;ccedil;ıktı ile karşılaşırız. Yuppiii!!! &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg223_Runtime.gif"&gt;&lt;img style="display: inline; border: 0px;" title="blg223_Runtime" src="/pics/blg223_Runtime_thumb.gif" alt="blg223_Runtime" width="574" height="300" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi olay metodları başarılı bir şekilde devreye girmiş ve istemcinin &lt;strong&gt;GetTotalSalaryByDepartment&lt;/strong&gt; ve &lt;strong&gt;GetTotalGains&lt;/strong&gt; operasyonlarına yaptığı &amp;ccedil;ağrılara ilişkin bazı bilgiler elde edilmiştir. Peki bu işleyiş sırasındaki &amp;ccedil;ağrı hiyerarşisi nedir? Aslında olaylar nesneler &amp;uuml;zerinden birbirlerine aktarılmaktadır. Bu aktarım işlemlerinin ger&amp;ccedil;ekleşmesi i&amp;ccedil;inse, &lt;strong&gt;OptDetectiveServiceBehavior&lt;/strong&gt; isimli servis davranışı i&amp;ccedil;erisinden &lt;strong&gt;OptDetectiveOperationBehavior&lt;/strong&gt; isimli operasyon davranışı tipinin olaylarına ve &lt;strong&gt;OptDetectiveOperationBehavior&lt;/strong&gt; i&amp;ccedil;erisinden de &lt;strong&gt;OptDetective&lt;/strong&gt; tipi i&amp;ccedil;erisindeki olaylara abone olunmuştur. Bu noktada kodu debug ederek ilerleminizde yarar olacaktır. Bu şekilde ge&amp;ccedil;işleri &amp;ccedil;ok rahar takjp edebileceğinizi g&amp;ouml;rebilirsiniz. Bu kutsal g&amp;ouml;revi de siz değerli okurlarıma bırakıyorum &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Biraz uzun bir anlatım oldu sanırım. Ama umuyorum ki işinize yarayacaktır. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f8%2fOperationCallTracingV2.rar"&gt;OperationCallTracingV2.rar (181,95 kb)&lt;/a&gt;&amp;nbsp;&lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 Ultimate s&amp;uuml;r&amp;uuml;m&amp;uuml;nde geliştirilmiş ve test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2011-03-06 18:00:00</pubDate>
  <slug>Servis-Operasyonlarini-Kod-Yardimiyla-Izlemek-Event-Kullanimi</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>