<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Profile API ile Personalization</title>
  <description>Günümüz web uygulamalarında, kullanıcı bazlı kişiselleştirme (personalization) oldukça önemli ve popüler bir konudur. Örneğin, bir elektronik ticaret sitesini ziyaret ettiğimizi düşünelim. Bu site bir sonraki ziyaretimizde, daha önceden bakmış olduğumuz ürünler ile ilişkili yeni önerilerde bulunabilir. Böylece siteye giren kullanıcıları başka ürünlere yönlendirebilir. Yeni önerilerin sunulabilmesi, sitenin bizim alışkanlıkarımızı takip etmesi ve kendisini buna göre değiştirmesi anlamına gelmektedir.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;G&amp;uuml;n&amp;uuml;m&amp;uuml;z web uygulamalarında, kullanıcı bazlı kişiselleştirme (personalization) olduk&amp;ccedil;a &amp;ouml;nemli ve pop&amp;uuml;ler bir konudur. &amp;Ouml;rneğin, bir elektronik ticaret sitesini ziyaret ettiğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu site bir sonraki ziyaretimizde, daha &amp;ouml;nceden bakmış olduğumuz &amp;uuml;r&amp;uuml;nler ile ilişkili yeni &amp;ouml;nerilerde bulunabilir. B&amp;ouml;ylece siteye giren kullanıcıları başka &amp;uuml;r&amp;uuml;nlere y&amp;ouml;nlendirebilir. Yeni &amp;ouml;nerilerin sunulabilmesi, sitenin bizim alışkanlıkarımızı takip etmesi ve kendisini buna g&amp;ouml;re değiştirmesi anlamına gelmektedir.&lt;/p&gt;
&lt;p&gt;Daha a&amp;ccedil;ık bir şekilde s&amp;ouml;ylemek gerekirse bu site, &amp;uuml;yelerin &amp;ouml;zelliklerine g&amp;ouml;re kişiselleşmektedir. Buna &amp;ouml;rnek olabilecek en g&amp;uuml;zel sitelerden birisi amazon.com' dur. Bir sitenin, &amp;uuml;yelerinin isteklerine g&amp;ouml;re davranış g&amp;ouml;stermesi i&amp;ccedil;in kullanılan &amp;ccedil;eşitli teknikler vardır. Bunlardan belkide en basiti ve ilkel olanı Cookie kullanımıdır. Cookie' ler istemci taraflı bilgi saklama amacıyla tercih edilirler. Ancak istemcilerin Cookie desteği olmadığı durumlarda kişiselleştirme (personalization) m&amp;uuml;mk&amp;uuml;n olmayacaktır. Alternatif ve daha sağlıklı bir yol olarak kullanıcıya ilişkin bilgilerin kişiselleştirme (personalization) amacıyla veritabanı sistemlerinde tutulması ve sayfalar arası ge&amp;ccedil;işlerde de Session nesneleri yardımıyla taşınması &amp;ccedil;ok daha profesyonel bir yaklaşımdır.&lt;/p&gt;
&lt;p&gt;Asp.Net 2.0, getirdiği MemberShip Management (&amp;Uuml;yelik Y&amp;ouml;netimi) sistemi i&amp;ccedil;erisine kişiselleştirme (personalization) ile ilişkili bir takım yenilikler eklemiştir. Bunlardan belkide en &amp;ouml;nemlisi Profile API' dir. Diğer kişiselleştirme (personalization) şekli ise Web Part kullanımıdır. Profile API yardımıyla, kullanıcı bazlı kişiselleştirilmiş ayarlar MemberShip sistemine dahil edilip kullanılabilir. B&amp;ouml;ylece siteye giren her &amp;uuml;ye i&amp;ccedil;in farklı kişisel bilgiler tutulabilir ve sayfanını o kullanıcıya has olacak şekilde değiştirilmesi dinamik olarak sağlanabilir. Elbette kullanıcı i&amp;ccedil;in ge&amp;ccedil;erli olan bu kişisel ayarlar &amp;uuml;yelik sistemine ait tablolarda saklanmalıdır. Aksi halde siteye giren kullanıcı ile kişiselleştirilmiş verilerin entegrasyonu &amp;ccedil;ok zor olacaktır.&lt;/p&gt;
&lt;p&gt;Profile sisteminde veritabanı tarafında Sql Server 7, 2000 ve 2005 sistemleri kullanılabileceği gibi, Custom Provider' lar yardımıyla farklı depolama ortamlarıda ele alınabilir. Profile API &amp;uuml;ye bazlı verileri sunucu &amp;uuml;zerinde tutmaktadır. Biz bu makalemizde Profile API' sini kullanarak basit olarak kişiselleştirme (personalization) işlemlerinin nasıl yapılabileceğini incelemeye &amp;ccedil;alışacağız. Profile API' sini kullanırken, kişiselleştirilecek bilgiler birer &amp;ouml;zellik olarak Web.Config dosyasına eklenirler. Asp.Net 2.0 ' da Web.Config dosyasına eklenen yeni boğumlardan birisi olan Profile boğumu sayesinde o site i&amp;ccedil;in ge&amp;ccedil;erli t&amp;uuml;m kullanıcılara ait ortak profil deseneleri oluşturulabilir. Profile boğumu i&amp;ccedil;erisinde herhangibir bir &amp;uuml;ye i&amp;ccedil;in kişsel ayarların tutulabileceği &amp;ouml;zellik tanımlamaları yer alır. Bu &amp;ouml;zellikler i&amp;ccedil;inde Properties boğumundan faydalanılır. Aşağıdaki &amp;ouml;rnekte Web.config dosyası i&amp;ccedil;erisine dahil edilmiş &amp;ouml;rnek Profile &amp;ouml;zelliklerini g&amp;ouml;rebilirsiniz.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;system.web&amp;gt;
    &amp;lt;profile&amp;gt;
        &amp;lt;properties&amp;gt;
            &amp;lt;add name="Kategorim"/&amp;gt;
            &amp;lt;add name="KarsilamaMesajim"/&amp;gt;
            &amp;lt;add name="SonGirisZamanim"/&amp;gt;
        &amp;lt;/properties&amp;gt;
    &amp;lt;/profile&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu profile bilgisine g&amp;ouml;re, sisteme giriş yapan her kullanıcı i&amp;ccedil;in Kategorim, KarsilamaMesajim ve SonGirisZamanim isimli &amp;ouml;zelliklerde kişiye g&amp;ouml;re farklı değerler tutulabilecektir. Profile i&amp;ccedil;erisinde belirtilen &amp;ouml;zelliklerin kullanılabilmesi i&amp;ccedil;in en azından sitenin kullanıcı bazlı &amp;ccedil;alışacak şekilde organize edilmesi gerekir. Bu makale i&amp;ccedil;in geliştirdiğimiz &amp;ouml;rnekte, Sql Server 2005 Express Edition' ı kullanan MemberShip sistemi &amp;ccedil;alışmaktadır. B&amp;ouml;ylece, her bir kullanıcıya &amp;ouml;zel profil değerlerini saklayabiliriz. Bu değerler varsayılan olarak aspnet_Profile tablosunda saklanmaktadır. Profile i&amp;ccedil;in tutulacak &amp;ouml;zellikleri konfigurasyon dosyasına ekledikten sonra kod i&amp;ccedil;erisinde Profile sınıfını kullanarak &amp;ccedil;eşitli işlemleri ger&amp;ccedil;ekleştirebiliriz. Web.Config dosyasında, Profile boğumu i&amp;ccedil;erisindeki Properties boğumu altına eklenen her bir elemana Profile sınıfı &amp;uuml;zerinden erişebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk163_1.gif" alt="" width="373" height="190" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Şekildende g&amp;ouml;rebileceğiniz gibi, kod tarafında Profile sınıfı ve intelli-sense yardımıyla, &amp;ouml;zellik olarak eklediğimiz t&amp;uuml;m elemanlara ulaşabilmekteyiz. Şimdi basit olarak bu sınıfı nasıl kullanacağımıza bir bakalım. &amp;Ouml;rnek senaryo olarak default.aspx sayfamızı aşağıdaki gibi tasarlayalım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk163_2.gif" alt="" width="281" height="283" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikli olarak sayfamızın &amp;ccedil;alışma şeklinden kısaca bahsedelim. Uygulamamızda Form tabanlı doğurlama kullandığımız i&amp;ccedil;in, default.aspx sayfasına gelinmeden &amp;ouml;nce isimsiz kullanıcılar UserLogin.aspx sayfasına bir kere uğramak zorundalar. Burada sisteme başarılı bir şekilde Login olan kullanıcılar default.aspx sayfasına geldiklerinde g&amp;uuml;ncel profillerine ait &amp;ouml;zelliklere erişebilecek ve değiştirebilecekler. B&amp;ouml;ylece Web.Config dosyasındaProfile boğumu i&amp;ccedil;erisinde belirttiğimiz &amp;ouml;zelliklerin her birinin değerlerini her kullanıcı i&amp;ccedil;in farklı şekillerde tutabileceğiz. Yani kişiye g&amp;ouml;re &amp;ouml;zelleştirme yapmış olacağız. Bunları ger&amp;ccedil;ekleştirebilmek i&amp;ccedil;in kodumuzda aşağıdaki değişiklikleri yapalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public partial class _Default : System.Web.UI.Page 
{
    protected void Page_Load(object sender, EventArgs e)
    {
        if (User.Identity.IsAuthenticated)
        {
            ProfileBilgisi();
        }
    }

    private void ProfileBilgisi()
    {
        lblKategorim.Text = Profile.Kategorim;
        lblMesajim.Text = Profile.KarsilamaMesajim;
        lblSonGirisZamanim.Text = Profile.SonGirisZamanim;
    }
    protected void btnSaveProfile_Click(object sender, EventArgs e)
    {
        Profile.SonGirisZamanim = DateTime.Now.ToString();
        Profile.KarsilamaMesajim = txtMesaj.Text;
        Profile.Kategorim = ddlKategoriler.SelectedItem.Text;
        Profile.Save();
        ProfileBilgisi();
    }
}&lt;/pre&gt;
&lt;p&gt;İlk olarak sayfa y&amp;uuml;klenirken eğer kullanıcı sisteme giriş yapmış ise ona ait Profile &amp;ouml;zelliklerinin değerlerini alıyor ve ekrandaki label kontrollerine yazdırıyoruz. Button kontrol&amp;uuml;ne tıklandığında ise kullanıcının girdiği değerler, bu kullanıcıya &amp;ouml;zel profile bilgileri olarak veritabanındaki aspnet_profile tablosuna kaydediliyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk163_3.gif" alt="" width="378" height="346" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Profile i&amp;ccedil;erisinde tutulan &amp;ouml;zellik değerleri &amp;ouml;rnek Burak isimli kullanıcı i&amp;ccedil;in aspnet_Profile isimli tabloda aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi tutulur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk163_4.gif" alt="" width="638" height="124" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Kullanıcıya ait Profile bilgisini oluşturan &amp;ouml;zellikler ile bunlara karşılık gelen değerlerin nasıl tutulduğuna dikkat ediniz. Profile i&amp;ccedil;erisinde tanımladığımız t&amp;uuml;m &amp;ouml;zellikler PropertyNames alanı i&amp;ccedil;erisinde tutulur. Bu &amp;ouml;zellikere karşılık gelen değerler ise PropertyValueString alanı i&amp;ccedil;erisinde tutulmaktadır. Burada 3 farklı kullanıcı i&amp;ccedil;in 3 farklı Profile satırı yer almaktadır. Profile i&amp;ccedil;erisinde tanımlamış olduğumuz &amp;ouml;zellikler şu anda varsayılan olarak String tipindendirler. İstersek burada tutulacak &amp;ouml;zelliklerin tiplerinide a&amp;ccedil;ık&amp;ccedil;a s&amp;ouml;yleyebilir ve hatta varsayılan değerlerinide ayarlayabiliriz. &amp;Ouml;zellikte tip g&amp;uuml;venliğini sağlamak a&amp;ccedil;ısından type niteliğini kullanmakta fayda vardır. &amp;Ouml;rneğimizdeki Profile bilgisini buna uygun olacak şekilde aşağıdaki gibi d&amp;uuml;zenlediğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;profile&amp;gt;
    &amp;lt;properties&amp;gt;
        &amp;lt;add name="Kategorim" type="System.String" defaultValue="Dvd"/&amp;gt;
        &amp;lt;add name="KarsilamaMesajim" type="System.String" defaultValue="Kişisel Mesajınız"/&amp;gt;
        &amp;lt;add name="SonGirisZamanim" type="System.DateTime"/&amp;gt;
        &amp;lt;add name="ButonFontBuyuklugu" type="System.Int32" defaultValue="12"/&amp;gt;
    &amp;lt;/properties&amp;gt;
&amp;lt;/profile&amp;gt;&lt;/pre&gt;
&lt;p&gt;Burada dikkat ederseniz iki yeni &amp;ouml;zellike daha ekledik. Bununla birlikte her &amp;ouml;zelliğimiz i&amp;ccedil;in ge&amp;ccedil;erli olabilecek primitive tipleri ve varsayılan değerleri tanımladık. Uygulamamızı bu haliyle derlediğimizde SonGirisZamanim &amp;ouml;zelliğinin kullanıldığı yerler i&amp;ccedil;in hata mesajları alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk163_5.gif" alt="" width="616" height="313" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sebep son derece a&amp;ccedil;ıktır. SonGirisZamanim isimli Profile &amp;ouml;zelliğinin tipini DateTime olarak belirttiğimizden, bu &amp;ouml;zelliğin kullanıldığı yerlerde uygun t&amp;uuml;r d&amp;ouml;n&amp;uuml;ş&amp;uuml;mlerini yapmamız gerekmektedir. Bu değişiklikler ışığında kodumuzu yeniden aşağıdaki gibi d&amp;uuml;zenleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected void Page_Load(object sender, EventArgs e)
{
    if (User.Identity.IsAuthenticated)
    {
        ProfileBilgisi();
    }
}

private void ProfileBilgisi()
{
    lblKategorim.Text = Profile.Kategorim;
    lblMesajim.Text = Profile.KarsilamaMesajim;
    lblSonGirisZamanim.Text = Profile.SonGirisZamanim.ToLongDateString();
    btnSaveProfile.Font.Size = Profile.ButonFontBuyuklugu;
}
protected void btnSaveProfile_Click(object sender, EventArgs e)
{
    Profile.SonGirisZamanim = DateTime.Now;
    Profile.KarsilamaMesajim = txtMesaj.Text;
    Profile.Kategorim = ddlKategoriler.SelectedItem.Text;
    Profile.Save();
    ProfileBilgisi();
}&lt;/pre&gt;
&lt;p&gt;Elbette primitive tipleri kullanabileceğimiz gibi, kendi yazmış olduğumuz tipleride kullanmak isteyebiliriz. &amp;Ouml;rnek olarak kullanıcının site i&amp;ccedil;erisinde gezdiği sayfalara ilişkin bilgileri saklayabileceğimiz bir sınıfımız olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk163_6.gif" alt="" width="279" height="266" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class UrlInfo
{
    private string _sayfaAdi;
    public string SayfaAdi
    {
        get { return _sayfaAdi; }
        set { _sayfaAdi = value; }
    }
    private string _url;
    public string Url
    {
        get { return _url; }
        set { _url = value; }
    }
    private DateTime _sonGirisTarihi;
    public DateTime SonGirisTarihi
    {
        get { return _sonGirisTarihi; }
        set { _sonGirisTarihi = value; }
    }
    public UrlInfo()
    {    }
    public UrlInfo(string ad, string url, DateTime giris)
    {
        SayfaAdi = ad;
        Url = url;
        SonGirisTarihi = giris;
    }
}&lt;/pre&gt;
&lt;p&gt;Bu sınıfı Profile i&amp;ccedil;erisinde bir &amp;ouml;zellik tipi olarak set etmek i&amp;ccedil;in aşağıdaki notasyonu kullanmamız gerekmektedir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;add name="SonSayfa" type="UrlInfo"/&amp;gt;&lt;/pre&gt;
&lt;p&gt;Bu noktadan sonra SonSayfa isimli Profile &amp;ouml;zelliğini uygulamamız i&amp;ccedil;erisinde istediğimiz şekilde kullanabiliriz. &amp;Ouml;zelliğin &amp;ccedil;alışacağı değer t&amp;uuml;r&amp;uuml; artık UrlInfo' dur. &amp;Ouml;rneğin o anki kullanıcının Profile bilgisine yeni bir UrlInfo &amp;ouml;rneği eklemek i&amp;ccedil;in aşağıdaki kod satırına benzer bir ifade yazabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Profile.SonSayfa = new UrlInfo("default", "default.aspx", DateTime.Now);&lt;/pre&gt;
&lt;p&gt;Diğer taraftan SonSayfa &amp;ouml;zelliğinin i&amp;ccedil;eriğini okurken, geri d&amp;ouml;necek olan değerin tipi UrlInfo olacağından, aşağıdaki kod par&amp;ccedil;asında olduğu gibi g&amp;uuml;ncel kullanıcının ge&amp;ccedil;erli olan UrlInfo &amp;uuml;yelerine de erişebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;lblSonSayfa.Text = Profile.SonSayfa.SayfaAdi + " " + Profile.SonSayfa.SonGirisTarihi.ToShortDateString();&lt;/pre&gt;
&lt;p&gt;Yanlız burada dikkat edilmesi gereken bir nokta vardır. Şu anda SonSayfa &amp;ouml;zelliğinin aspnet_Profile i&amp;ccedil;erisinde nasıl tutulduğuna bakarsak Xml şeklinde tutulduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk163_7.gif" alt="" width="454" height="119" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dilerseniz &amp;ouml;zelliğin i&amp;ccedil;eriğini Binary formatında tutarak daha az yer tutmasınıda sağlayabilirsiniz. Bunun i&amp;ccedil;in Properties boğumunda ilgili &amp;ouml;zellik i&amp;ccedil;in serializeAs niteliğini kullanmamız gerekmektedir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;add name="SonSayfa" type="UrlInfo" serializeAs="Binary"/&amp;gt;&lt;/pre&gt;
&lt;p&gt;Lakin uygulamamızı bu şekilde &amp;ccedil;alıştırdığımızda ve bir kullanıcı ile sisteme giriş yaptığımızda aşağıdaki istisna mesajını alırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk163_8.gif" alt="" width="454" height="140" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bunun sebebi ise, yazmış olduğumuz UrlInfo tipinin ikili formatta serileştirilebilir olarak işaretlenmemesidir. Serializable niteliğini (attribute) kullanarak bu hatanın &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ebilir ve tipimizi ikili formatta serileştirilerek ilgili alan i&amp;ccedil;erisine alınmasını sağlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[Serializable]
public class UrlInfo
{
...&lt;/pre&gt;
&lt;p&gt;Tipimizi serileştirilebilir olarak işaretledikten sonra uygulamamız sorunsuz bir şekilde &amp;ccedil;alışacaktır. Elbette UrlInfo tipinin g&amp;uuml;ncel kullanıcı i&amp;ccedil;in ge&amp;ccedil;erli olan i&amp;ccedil;eriği artık tabloda, PropertyValuesString alanında değil, PropertyValueBinary alanında saklanacaktır.&lt;/p&gt;
&lt;p&gt;Profile API' si ile ilgili dikkat edilmesi gereken bir diğer hususda, siteye giren isimsiz kullanıcıların nasıl ele alınacağıdır. Siteye giren isimsiz kullanıcılar (anonymous users) i&amp;ccedil;inde Profile bilgisi tanımlanabilir. Bazı alışveriş sitelerinde isimsiz kullanıcılar dahi sepete bir şeyler ekleyebilmektedir. Bu isimsiz kullanıcının bir sonraki girişinde daha &amp;ouml;nceden oluşturduğu sepeti kullanabilmeside kişiselleştirme ile alakalıdır. Aslında isimsiz bir kullanıcı sisteme girdiğinde onun i&amp;ccedil;in bir benzersiz bir id değeri &amp;uuml;retilir. Bu id değeri varsayılan olarak oturum a&amp;ccedil;an kullanıcının bilgisayarında cookie şeklinde saklanır. Elbette cookie desteği olmayan istemciler i&amp;ccedil;in aynı Session modelinde olduğu gibi cookieless &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; vardır. Bu y&amp;ouml;ntemler sayesinde, bir siteye bağlanan her isimsiz kullanıcı i&amp;ccedil;in ayrı ayrı kişiselleştirmeler yapabiliriz. Başlamak i&amp;ccedil;in &amp;ouml;ncelikli olarak Web.Config idosyası &amp;ccedil;erisinden, isimsiz kullanıcılar i&amp;ccedil;in Profile kullanımını aktif hale getirmemiz gerekir. Varsayılan olarak bu &amp;ouml;zellik kapalıdır. &amp;Ccedil;&amp;uuml;nk&amp;uuml;, isimsiz kullanıcılar i&amp;ccedil;in Profile kullanımı &amp;ouml;zellikle veritabanı kaynaklarını ve doğal olarakta web sunucusu kaynaklarını &amp;ccedil;ok fazla harcayacaktır.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;anonymousIdentification enabled="True" cookieless="AutoDetect" /&amp;gt;&lt;/pre&gt;
&lt;p&gt;Buradaki &amp;ouml;rnekte cookieless &amp;ouml;zelliğine AutoDetect değeri atanmıştır. Yani isimsiz kullanıcı i&amp;ccedil;in oluşturulan id değerinin istemci bilgisayarında Cookie şeklinde mi, yoksa url ile birlikte taşınacak şekilde mi tutulacağına Asp.Net karar verecektir. Cookieless niteliğinin alabileceği diğer değerler ise UseCookies, UseUri ve UseDeviceProfile ' dir. B&amp;ouml;ylece artık sistem i&amp;ccedil;erisinde isimsiz kullanıcılar i&amp;ccedil;in Profile bilgisinin kullanılabileceğinide s&amp;ouml;ylemiş oluyoruz. Lakin var olan Profile &amp;ouml;zellikleri i&amp;ccedil;erisinde de hangilerinin isimsiz kullanıcılar i&amp;ccedil;in ge&amp;ccedil;erli olacağına karar vermemiz ve bunu belirtmemiz gerekiyor. Bunun i&amp;ccedil;in tek yapmamız gereken istediğimiz &amp;ouml;zelliğin allowAnonymous niteliğine true değerini atamak olacaktır.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;add name="SonSayfa" type="UrlInfo" serializeAs="Binary" allowAnonymous="true"/&amp;gt;&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi Asp.Net 2.0 kişiselleştirme adına Framework Class Library i&amp;ccedil;erisine olduk&amp;ccedil;a g&amp;uuml;&amp;ccedil;l&amp;uuml; bir tip atmıştır. Profile tipinin yukarıda değindiğimiz &amp;ouml;zellikleri dışında daha pek &amp;ccedil;ok kabiliyetide elbette vardır. Bunların araştırılmasını siz değerli okurlarıma bırakıyorum. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/UsingProfilesAPI.rar"&gt;&amp;Ouml;rnek Uygulama İ&amp;ccedil;in Tıklayın.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2006-06-02 12:00:00</pubDate>
  <slug>Profile-API-ile-Personalization-bsenyurt-com-dan</slug>
  <tags>
    <tag>aspnet-20</tag>
    <tag>profile-api</tag>
    <tag>personalization</tag>
  </tags>
  <categories>
    <category>Asp.Net 2.0</category>
  </categories>
</post>