<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>.Net RIA Servisleri - Özel Doğrulama(Custom Validation)</title>
  <description>ir önceki blog yazımızda, .Net RIA Servislerin kullanıldığı Silverlight uygulamalarında doğrulama(Validation) işlemlerinin nasıl yapılabileceğini incelemeye çalışmıştık. Bu yazımızda ise, Range, Required, StringLength, RegularExpression gibi built-in niteliklerle(attribute) gerçekleştirilen doğrulamalar haricinde kalan özel durumlar için nasıl ilerleyebileceğimizi araştıracağız. Konuyu adım adım irdelersek, aşağıdaki işlemleri yapmamız gerekmektedir.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki blog yazımızda, .Net RIA Servislerin kullanıldığı Silverlight uygulamalarında doğrulama(Validation) işlemlerinin nasıl yapılabileceğini incelemeye &amp;ccedil;alışmıştık. Bu yazımızda ise, &lt;strong&gt;Range, Required, StringLength, RegularExpression&lt;/strong&gt;&amp;nbsp;gibi built-in niteliklerle(attribute) ger&amp;ccedil;ekleştirilen doğrulamalar haricinde kalan &amp;ouml;zel durumlar i&amp;ccedil;in nasıl ilerleyebileceğimizi araştıracağız. Konuyu adım adım irdelersek, aşağıdaki işlemleri yapmamız gerekmektedir.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Sunucu uygulama tarafında(Web App) shared niteliği ile işaretlenmiş bir sınıf tasarlanır ve i&amp;ccedil;erisine &amp;ouml;zel doğrulama operasyonları ilave edilir.&lt;/li&gt;
&lt;li&gt;&amp;Ouml;zel doğrulamaların uygulanacağı sınıf veya &amp;uuml;yelerine, CustomValidation niteliği yardımıyla geliştirilen Validator tipi bildirilir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;G&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml;z gibi gayet basit. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;&amp;Ouml;nceki blog yazımızda geliştirdiğimiz &amp;ouml;rnek proje i&amp;ccedil;in bu adımları uygulamaya başlayabiliriz. &amp;Ouml;rnek olarak &lt;strong&gt;ProductName&lt;/strong&gt; alanı i&amp;ccedil;in &amp;ouml;zel bir doğrulama fonksiyonelliği geliştireceğiz. Bu doğrulamaya g&amp;ouml;re, ProductName ile ilişkili veri giriş alanı i&amp;ccedil;erisinde &lt;strong&gt;Select, Where, Delete&lt;/strong&gt; gibi &lt;strong&gt;SQL &lt;/strong&gt;kelimelerinin olmamasını sağlamaya &amp;ccedil;alışacağız. Bu tabiki konunun anlaşılması i&amp;ccedil;in &amp;ouml;ne s&amp;uuml;rd&amp;uuml;ğ&amp;uuml;m&amp;uuml;z bir senaryo. Şu an i&amp;ccedil;in &amp;ouml;nemli olan, tekniğin nasıl uygulandığıdır. Bu ama&amp;ccedil;la web projesi tarafında &lt;strong&gt;ProductNameValidator.shared.cs &lt;/strong&gt;isimli bir kod dosyası oluşturarak işe başlayabiliriz. Bu kod dosyasının adında &lt;strong&gt;shared&lt;/strong&gt; kelimesinin eklenmesinin geliştirme ortamı(IDE) i&amp;ccedil;inde &amp;ouml;zel bir anlamı vardır. &lt;strong&gt;SınıfAdı.shared.cs/vb &lt;/strong&gt;formatında yazılan dosya adı sayesinde, istemci tarafı i&amp;ccedil;inde otomatik kod &amp;uuml;retiminin ger&amp;ccedil;ekleştirilmesi sağlanmış olmaktadır.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z konusu sınıfın kod i&amp;ccedil;eriği ise aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.ComponentModel.DataAnnotations;
using System.Web.Ria.Data;

// Dosya adında shared kullanılmasının bir nedeni vardır. Bu isimlendirme standardı sayesinde, derleme zamanı alt yapısının istemci tarafı i&amp;ccedil;in otomatik dosya &amp;uuml;retimi ger&amp;ccedil;ekleştirmesi sağlanmış olunur.
namespace ValidationSystem.Web
{
    [Shared] 
    public static class ProductNameValidator
    {
        public static bool QueryCheck(string productName, ValidationContext context, out ValidationResult result)
        {
            // sembolik olarak eklenmiş kontrol değerleri
            string[] keywords = { "Select", "Where", "Delete", "Create" };

            // &amp;uuml;r&amp;uuml;n adının, yasaklı kelimelerden herhangibirini i&amp;ccedil;erip i&amp;ccedil;ermediğine bakılır.
            foreach (string keyword in keywords)
            {
                // Bir tane bile i&amp;ccedil;eriyorsa, ValidationResult nesne &amp;ouml;rneği oluşturulurken hata mesajı bildirimi yapılır ve geriye false değer d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;r
                if (productName.Contains(keyword))
                {
                    result = new ValidationResult("Tehlikeli kelimeler yer almakta");
                    return false;
                }
            }
            // Eğer doğrulama işlemi başarılıysa ValidationResult nesne &amp;ouml;rneğine null değer atanır ve geriye true değer d&amp;ouml;nd&amp;uuml;r&amp;uuml;l&amp;uuml;r
            result = null;
            return true;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Static&lt;/strong&gt; olarak tanımlanan sınıfın &lt;strong&gt;shared &lt;/strong&gt;niteliği ile imzalandığına dikkat edilmelidir. Diğer taraftan doğrulama işlemi i&amp;ccedil;in kullanılacak olan metod(metodlar), ilk parametre olarak doğrulanacak veri i&amp;ccedil;eriğini taşıyabilecek tipte bir değişken kullanırlar. ProductName alanı tablo &amp;uuml;zerinde &lt;strong&gt;nvarchar &lt;/strong&gt;tipinden tanımlanmış ve bu nedenle &lt;strong&gt;Entity&lt;/strong&gt; i&amp;ccedil;erisinde &lt;strong&gt;string &lt;/strong&gt;olarak ele alınmıştır. Dolayısıyla ilk parametrenin string tipinden tasarlanmış olması doğru bir tercihtir. Diğer taraftan ikinci parametre olarak &lt;strong&gt;ValidationContext &lt;/strong&gt;ve &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; parametre olarakta &lt;strong&gt;ValidationResult &lt;/strong&gt;tiplerinden değişkenler tanımlanmıştır. Her ne kadar &amp;ouml;rneğimizde&amp;nbsp;&lt;strong&gt;ValidationContext&lt;/strong&gt; parametresini kullanmamış olsakta, &amp;ccedil;alışma zamanında doğrulamaya tabi olan i&amp;ccedil;eriğin sahibi tipe ait bilgileri i&amp;ccedil;erdiğini s&amp;ouml;yleyebiliriz. Dolayısıyla bu değişken ile, doğrulamaya tabi olan ProductName değerine sahip Products nesne &amp;ouml;rneğine ulaşabilir ve doğrulamayı farklı a&amp;ccedil;ılardan ele alabiliriz. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde bu durum daha net bir şekilde g&amp;ouml;r&amp;uuml;lebilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f5%2fblg25_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim &lt;strong&gt;ValidationResult&lt;/strong&gt; tipine. Sonu&amp;ccedil; olarak doğrulamanın &lt;span style="text-decoration: underline;"&gt;başarılı&lt;/span&gt; veya &lt;span style="text-decoration: underline;"&gt;başarısız &lt;/span&gt;olma durumu s&amp;ouml;z konusudur. Başarısız olunması halinde, istemci tarafında hata mesajı gibi bilgileri i&amp;ccedil;eren bir nesne &amp;ouml;rneğinin var olması gerekmektedir. İşte &lt;strong&gt;ValidationResult &lt;/strong&gt;nesne &amp;ouml;rneğinin &amp;uuml;retilmesi ile, doğrulamanın başarısız olması durumunda geriye nasıl bir bilgi d&amp;ouml;nd&amp;uuml;r&amp;uuml;leceği belirtilmektedir. Tabi metodun b&amp;ouml;yle bir durumda geriye &lt;strong&gt;false&lt;/strong&gt; değer d&amp;ouml;nd&amp;uuml;rmeside gerekmektedir. Elbetteki doğrulama işleminin başarılı olması halinde geriye &lt;strong&gt;true&lt;/strong&gt; değer d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi ve ayrıca &lt;strong&gt;ValidationResult&lt;/strong&gt; nesne &amp;ouml;rneğinin &lt;strong&gt;null&lt;/strong&gt; olarak aktarılması sağlanmalıdır.&lt;/p&gt;
&lt;p&gt;Sırada ikinci adım var. Geliştirilen bu doğrulama tipinin, &amp;ccedil;alışma zamanı tarafından ele alınması gerekmektedir. Tabiki hal b&amp;ouml;yle olunca devreye &lt;strong&gt;niteliklerin(attribute)&lt;/strong&gt; girmeside ka&amp;ccedil;ınılmazdır. Neyseki kendi niteliklerimizi yazmak yerine, herhangibir &lt;strong&gt;validator&lt;/strong&gt; tipini, istediğimiz &amp;ouml;zellik veya sınıfa uygulamamızı sağlayan tek bir &lt;strong&gt;built-in&lt;/strong&gt; nitelik mevcuttur. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;&lt;strong&gt;CustomValidation&lt;/strong&gt;. Dolayısıyla metadata dosyası i&amp;ccedil;erisinde, &lt;strong&gt;ProductName&lt;/strong&gt; &amp;ouml;zelliğinin aşağıdaki hale getirilmesi yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[Required(ErrorMessage="L&amp;uuml;tfen &amp;uuml;r&amp;uuml;n adını giriniz")]
[CustomValidation(typeof(ProductNameValidator),"QueryCheck")]
public string ProductName;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;CustomValidation&lt;/strong&gt; niteliği ilk parametre olarak doğrulama tipini almaktadır. İkinci parametrede ise, takip &amp;ouml;den &amp;ouml;zelliğin(veya sınıfın) kontrol&amp;uuml;n&amp;uuml; ger&amp;ccedil;ekleştirecek olan metod adı belirtilmektedir. Uygulama bu son haliyle derlendiğinde, istemci projesindede aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len ek dosyanında &amp;uuml;retildiği g&amp;ouml;zlemlenebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f5%2fblg25_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Artık uygulamayı test etmeye başlayabiliriz. Bu ama&amp;ccedil;la herhangibir &amp;uuml;r&amp;uuml;n&amp;uuml;n g&amp;uuml;ncellenmeye &amp;ccedil;alışıldığını d&amp;uuml;ş&amp;uuml;nelim ve &amp;uuml;r&amp;uuml;n adında &lt;strong&gt;Delete&lt;/strong&gt; kelimesini kullandığımızı varsayalım. İşte sonu&amp;ccedil;...&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f5%2fblg25_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tataaaa!!!&amp;nbsp;&lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&amp;nbsp;Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f5%2fValidationSystem2.rar"&gt;ValidationSystem2.rar (1,86 mb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-05-31 04:03:00</pubDate>
  <slug>Net-RIA-Servisleri-Ozel-Dogrulama(Custom-Validation)</slug>
  <tags>
    <tag>net-ria-services</tag>
    <tag>silverlight</tag>
  </tags>
  <categories>
    <category>.Net RIA Services</category>
  </categories>
</post>