<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Matematik ve Oyun Programlama - Missile Command - Bölüm 2</title>
  <description>Bir önceki programımızda Atari'nin efsane oyunlardan Missile Command'in arkasındaki matematik enstrümanları incelemeye başlamıştık. İkinci bölümde ise zeminin orta noktasına ve şehrin biraz yukarsına füze bataryamızı yerleştiriyoruz. Bu füze bataryası, oyuncu mouse imlecini ekranda hareket ettirdikçe oraya doğru dönecek bir çizgiden ibaret esasında. Oyuncu mouse imlecinin olduğu yerde sol tuşa tıklarsa da bataryanın namlu ucundan bu noktaya doğru sevimli ve mavi renkte minik bir dörtgen fırlıyor. Herhangi bir zamanda sahnede sadece üç tane mermi oluyor. Hatta füze bataryası 30 derecenin altına veya 150 derecenin üstüne hareket edemediği gibi ateş de edemiyor. Diğer yandan mermi, mouse ile tıklanan ilk noktaya vardığında sahneden kaldırılıyor. Mermiler belli bir hızda ama şehre inen füzelerden azıcık daha hızlı şekilde hareket ediyorlar.</description>
  <content>&lt;p&gt;Matematiği bana sevdiren lise birinci sınıftaki &amp;ouml;ğretmenimdi. Fizik, Kimya ve T&amp;uuml;rk&amp;ccedil;e derslerinde o kadar iyi değildim ama konu matematik olunca p&amp;uuml;r dikkat kesilirdim. Ancak &amp;uuml;niversite yıllarına geldiğimde Matematik M&amp;uuml;hendisliğinin o yoğun teorik programı i&amp;ccedil;erisinde kaybolurken nefes alacak yer bulmakta zorlanıyordum. İmdadıma yine b&amp;ouml;l&amp;uuml;m m&amp;uuml;fredatında yer alan programlama dersleri yetişmişti&lt;em&gt;(ve halen Fizik dersinde başarısızdım :D )&lt;/em&gt; Programlama dillerine olan tutkum beni bir yazılımcı olmaya ve bug&amp;uuml;nlere kadar gelmeye ikna etti. Ancak bazen durup bir d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum. Yeterince farkında olsaydım acaba oyun geliştiricisi olmak ister miydim? &amp;Ccedil;&amp;uuml;nk&amp;uuml; hem matematiği hem de programlamayı bir arada bulabileceğim en g&amp;uuml;zel alandı. Tabii evdeki hesap &amp;ccedil;arşıya uymamıştı. O zamanlarda ne programlamada ne de matematiğin oyun geliştirme d&amp;uuml;nyasındeki yeri anlamında yeterli değildim. &amp;Uuml;stelik oyun geliştiriciliği alanına hitap eden bir b&amp;ouml;l&amp;uuml;mde de okumuyordum. Yine de "&amp;ccedil;ok ge&amp;ccedil; değil, nasıl olsa hobi ama&amp;ccedil;lı ilgilenebilirim" dedim ve işte bu seri b&amp;ouml;ylece başlamış oldu. Konuşmak i&amp;ccedil;in &amp;ccedil;ok erken ve daha yolun başındayım ama &amp;ouml;ğrendik&amp;ccedil;e ve fırsat bulduk&amp;ccedil;a meraklılarına aktarmaya &amp;ccedil;alışacağım.&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki programımızda Atari'nin efsane oyunlardan Missile Command'in arkasındaki matematik enstr&amp;uuml;manları &lt;a href="/post/matematik-ve-oyun-programlama-missile-command-bolum-1" target="_blank"&gt;incelemeye başlamıştık&lt;/a&gt;. İkinci b&amp;ouml;l&amp;uuml;mde ise zeminin orta noktasına ve şehrin biraz yukarsına f&amp;uuml;ze bataryamızı yerleştiriyoruz. Bu f&amp;uuml;ze bataryası, oyuncu mouse imlecini ekranda hareket ettirdik&amp;ccedil;e oraya doğru d&amp;ouml;nebilen bir &amp;ccedil;izgiden ibaret esasında. Oyuncu mouse imlecinin olduğu yerde sol tuşa tıklarsa da bataryanın namlu ucundan bu noktaya doğru sevimli ve mavi renkte minik bir d&amp;ouml;rtgen fırlamakta. Herhangi bir zamanda sahnede sadece &amp;uuml;&amp;ccedil; tane mermi bulunabilir. Hatta f&amp;uuml;ze bataryası 30 derecenin altına veya 150 derecenin &amp;uuml;st&amp;uuml;ne hareket edemediği gibi ateş de edemez. Diğer yandan şehre inmekte olan f&amp;uuml;zelerden birazcık daha hızlı hareket eden mermiler mouse ile tıklanan noktalara vardıklarında sahneden kaldırılmaktalar.&lt;/p&gt;
&lt;p&gt;İşte t&amp;uuml;m bu bahsettiklerimizin arkasında matematiğin ve &amp;ouml;zellikle lineer cebirin temel enstr&amp;uuml;manları bulunuyor. &amp;Ouml;nceki programda olduğu gibi bu yayında da vekt&amp;ouml;rlerden, birim vekt&amp;ouml;rden, vekt&amp;ouml;rler arası a&amp;ccedil;ı hesaplamasından, kosin&amp;uuml;s ve sin&amp;uuml;s fonksiyonları ile pisagor teoreminden yararlanıyoruz. Kabaca aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len bir karmaşayı dilim d&amp;ouml;nd&amp;uuml;ğ&amp;uuml;nce anlatmaya &amp;ccedil;alışıyorum diyebilirim :)&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2022/Kasim/miscmd2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Konu ile ilgili &amp;ouml;rneği Rust programlama dilini kullanarak geliştiriyorum. &lt;a href="https://github.com/buraksenyurt/game-dev-with-rust/tree/main/missile-commander" target="_blank"&gt;Github hesabımdan ilgili kaynak kodlara ulaşabilirsiniz&lt;/a&gt;. Oyun motoru olarak hafifsiklet olanlardan &lt;a title="Macroquad game engine" href="https://macroquad.rs/examples/" target="_blank"&gt;Macroquad&lt;/a&gt;'ı tercih ettim. Bu arada ders &amp;ccedil;ekimi sırasında birka&amp;ccedil; kez dilim s&amp;uuml;r&amp;ccedil;t&amp;uuml; ama kusurlarıyla birlikte yararlı bir anlatım oldu diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum.&lt;/p&gt;
&lt;p&gt;&lt;iframe title="YouTube video player" src="https://www.youtube.com/embed/Mu8xDsfI2Po" width="560" height="315" frameborder="0" allowfullscreen="allowfullscreen"&gt;&lt;/iframe&gt;&lt;/p&gt;
&lt;p&gt;Sonraki b&amp;ouml;l&amp;uuml;mde amacımız, merminin kendi varış noktasına geldiğinde belli bir yarı&amp;ccedil;ap değerine kadar b&amp;uuml;y&amp;uuml;yen bir &amp;ccedil;ember &amp;ccedil;izdirmek ve bu &amp;ccedil;ember ile temas eden roketlerin yok edilmesini sağlamak. Tabii bunun arkasındaki matematik enstr&amp;uuml;manlara odaklanacağız. &amp;Uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; b&amp;ouml;l&amp;uuml;mde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2022-11-25 12:15:00</pubDate>
  <slug>matematik-ve-oyun-programlama-missile-command-bolum-2</slug>
  <tags />
  <categories>
    <category>Rust</category>
  </categories>
</post>