<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Strongly Typed DataSet - 1 (Kuvvetle Türlendirilmiş Veri Kümeleri)</title>
  <description>Bugünkü makalemizde kuvvetle türlendirilmiş veri kümelerinin ne olduğunu ve nasıl oluşturulduklarını incelemeye çalışacağız. Kuvvetle türlendirilmiş veri kümelerini tanımlamadan önce, aşağıdaki kod satırının incelemekle işe başlayalım.</description>
  <content>&lt;p align="justify"&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p align="justify"&gt;Bug&amp;uuml;nk&amp;uuml; makalemizde kuvvetle t&amp;uuml;rlendirilmiş veri k&amp;uuml;melerinin ne olduğunu ve nasıl oluşturulduklarını incelemeye &amp;ccedil;alışacağız. Kuvvetle t&amp;uuml;rlendirilmiş veri k&amp;uuml;melerini tanımlamadan &amp;ouml;nce, aşağıdaki kod satırının incelemekle işe başlayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;textBox1.Text=dsMakale1.Tables["Makale"].Rows[3]["Konu"].ToString();&lt;/pre&gt;
&lt;p align="justify"&gt;Bu satır ile, dsMakale isimli dataSet nesnemizin bellekte işaret ettiği veri b&amp;ouml;lgesinde yer alan DataTable'lardan Makale tablosuna işaret edenin, 4nc&amp;uuml; satırındaki Konu alanının değeri alınarak, TextBox kontrol&amp;uuml;m&amp;uuml;z&amp;uuml;n text &amp;ouml;zelliğine atanmaktadır. Şimdide aşağıdaki kod satırını ele alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;textBox1.Text=rsMakale.Fields("Konu").Value&lt;/pre&gt;
&lt;p align="justify"&gt;Bu ifade eski dostumuz ADO daki rsMakale isimli recordSet'i kullanarak, Konu isimli alanın değerine ulaşmıştır. Dikkat edicek olursanız bu iki ifade arasında uzunluk a&amp;ccedil;ısından belirgin bir fark vardır. İkinci yazım daha kolaydır. Zaten bu nedenle, ADO.NET'i &amp;ouml;ğrenen programcıların ilk başta en &amp;ccedil;ok karşılaştıkları zorluk, bu kod yazımının uzunluğu olmuştur. Bununla birlikte, ADO.NET' in XML tabanlı bir mimariye sahip olması, karşımıza Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;melerini &amp;ccedil;ıkarmaktadır. Microsfot.NET mimarları, programlarımızda aşağıdakine benzer daha kısa ifadelerin kullanılabilmesi amacıyla, Kuvvetle G&amp;uuml;&amp;ccedil;lendirilmiş Veri K&amp;uuml;meleri kavramını ADO.NET'e yerleştirmiştir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;textBox1.Text=dsTypedMakale.Makale[3].Konu.ToString();&lt;/pre&gt;
&lt;p align="justify"&gt;Bu ifade ilk yazdığımız ifadeye g&amp;ouml;re &amp;ccedil;ok daha kısadır. Peki bu nasıl sağlanmıştır. dsTypedMakale isimli DataSet nesnemiz aslında Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;memizin ta kendisidir. Bu noktada Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi'nin ne olduğunu tanımlayabiliriz.&lt;/p&gt;
&lt;p align="justify"&gt;Bir Strongly Typed DataSet ( Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi ), DataSet sınıfından t&amp;uuml;retilmiş, programcı tarafından belirtilen bir xml schema sınıfını baz alan, veri bağlantılarının &amp;ouml;zelleştirilip yukarıdaki gibi kısa yazımlar ile erişimlere imkan sağlayan, &amp;ouml;zelleştirilmiş bir DataSet sınıfıdır.&lt;/p&gt;
&lt;p align="justify"&gt;Bu geniş kavramı anlamak i&amp;ccedil;in elbette en kolay yol &amp;ouml;rneklendirmek olucak. Ancak bundan &amp;ouml;nce Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;memizin nasıl oluşturacağımızı g&amp;ouml;relim. Bunun i&amp;ccedil;in elimizde iki yol var. Yollardan birisi, komut satırından XSD.exe XML Schema Defination Tool'unu kullanmak. Bu yol biraz daha zahmetli olmakla birlikte Visual Studio.NET'e olan gereksinimi kaldırdığı i&amp;ccedil;in zaman zaman tercih edilir. Diğer yolumuz ise Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;memizi Visual Studio.NET ortamında oluşturmak. Yollardan hangisini se&amp;ccedil;ersek se&amp;ccedil;elim, Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;memizin oluşturulması i&amp;ccedil;in bize mutlaka bir xml schema dosyası (xsd uzantılı) gerekiyor. &amp;Ccedil;&amp;uuml;nk&amp;uuml; Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;memiz, bir xml schema dosyası baz alınarak oluşturulmaktadır. Şimdi dilerseniz komut satırı yardımıyla bir Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesinin nasıl oluşturulacağını inceleyelim. Bunun i&amp;ccedil;in &amp;ouml;ncelikle biraz kod yazmamız gerekecek. İzleyen kodlar ile, bir DataSet'i gerekli tablo bilgileri ile y&amp;uuml;kleyecek ve daha sonra bu DataSet'e ait xml schema bilgilerini, DataSet sınıfına ait WriteXmlSchema metodu ile bir xsd dosyasına aktaracağız. &amp;Ouml;rneğin basit olması amacıyla bir console uygulaması oluşturalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.Data.SqlClient;

namespace TypeDataSet2
{
     class Class1
     {
          static void Main(string[] args)
          {
               SqlConnection conFriends=new SqlConnection("data source=localhost;initial catalog=Friends;integrated security=sspi");
               SqlDataAdapter da=new SqlDataAdapter("Select * From Makale",conFriends);
               DataSet dsMakale=new DataSet("Makaleler");
               conFriends.Open();
da.FillSchema(dsMakale,SchemaType.Source,"Makale");
               conFriends.Close();
               dsMakale.WriteXmlSchema("Makaleler.xsd");
          }
     }
}&lt;/pre&gt;
&lt;p align="justify"&gt;Yukarıdaki kodları kısaca a&amp;ccedil;ıklayalım. Burada Sql sunucumuzda yer alan Friends isimli veritabanına bağlanıyor ve Makale isimli tabloya ait schema bilgilerini DataSet nesnemize y&amp;uuml;kl&amp;uuml;yoruz. Daha sonra ise, DataSet nesnemizin WriteXmlSchema metodu ile, DataSet'in yapısını xml tabanlı schema dosyası olarak ( Makaleler.xsd ) sisteme kaydediyoruz. İşte Kuvvetle T&amp;uuml;rlendirişmiş Veri K&amp;uuml;memizi bu xsd uzantılı schema dosyası yardımıyla oluşturacağız. Sistemizde uygulamamızı oluşturduğumuz yerdeki Debug klas&amp;ouml;r&amp;uuml;ne baktığımızda, aşağıdaki g&amp;ouml;r&amp;uuml;nt&amp;uuml;y&amp;uuml; elde ederiz.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk50_1.gif" alt="" width="350" height="126" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 1. XML Schema Dosyamız.&lt;/p&gt;
&lt;p align="justify"&gt;Şimdi .NET Framework'&amp;uuml;n XSD.exe aracını kullanarak, bu schema dosyasından Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;memizi temsil edicek sınıfı oluşturalım. Bunun i&amp;ccedil;in, komut satırında aşağıdaki satırı yazarız.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk50_2.gif" alt="" width="597" height="175" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 2. Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi sınıfının oluşturulması.&lt;/p&gt;
&lt;p align="justify"&gt;Burada g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi, xsd schema dosyamızdan, Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi sınıfımız (Makaleler.cs) oluşturulmuştur. xsd aracındaki /d parametresi, sınıfımızın DataSet sınıfından t&amp;uuml;retileceğini belirtmektedir. Şimdi Debug klas&amp;ouml;r&amp;uuml;m&amp;uuml;ze tekrar bakıcak olursak, Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi sınıfımızın oluşturulmuş olduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk50_3.gif" alt="" width="370" height="121" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 3. Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi Sınıfımız.&lt;/p&gt;
&lt;p align="justify"&gt;Peki bu oluşturduğumuz Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi sınıfını uygulamamızda nasıl kullanacağız. Bu olduk&amp;ccedil;a basit. Yeni DataSet nesnemizi, Makaleler.cs sınıfından t&amp;uuml;reteceğiz. Aşağıdaki kodu inceleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;

using System.Data.SqlClient;
namespace TypeDataSet2
{
     class Class1
     {
          static void Main(string[] args)
          {
               SqlConnection conFriends=new SqlConnection("data source=localhost;initial catalog=Friends;integrated security=sspi");
               SqlDataAdapter da=new SqlDataAdapter("Select * From Makale",conFriends);
               conFriends.Open();
               Makaleler dsTypedMakale=new Makaleler(); /* Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi sınıfımızdan bir DataSet nesnesi t&amp;uuml;retiyoruz.*/
               da.Fill(dsTypedMakale.Makale); /* SqlDataAdapter nesnemiz yardımıyla, yeni dataSet'imizdeki Makale isimli tablomuzu Sql sunucumuzda yer alan Makale isimli tablonun verileri ile y&amp;uuml;kl&amp;uuml;yoruz. */
Console.WriteLine(dsTypedMakale.Makale[3].Konu.ToString()); /* Yeni DataSet nesnemizdeki Makale tablosunun 4nc&amp;uuml; satırındaki Konu alanının değerine erişiyoruz. */
               conFriends.Close();
          }
     }
}&lt;/pre&gt;
&lt;p align="justify"&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdaki sonu elde ederiz.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk50_4.gif" alt="" width="373" height="91" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 4. Uygulamanın sonucu.&lt;/p&gt;
&lt;p align="justify"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi bir Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi oluşturmak ve kullanmak son derece basit. Dilerseniz xsd aracı ile oluşturduğumuz Makaleler.cs isimli Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi sınıfımızı ele alalım. Bu sınıfı oluşturduğunuzda mutlaka incelemenizi tavsiye ederim. &amp;Ccedil;ok uzun bir dosya olduğunundan t&amp;uuml;m kod satırlarına burada yer vermiyorum. Ancak dikkatimizi &amp;ccedil;ekicek bir ka&amp;ccedil; &amp;uuml;yeyi g&amp;ouml;stereceğim. &amp;Ouml;ncelikle sınıf tanımımıza bir g&amp;ouml;z atalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class Makaleler : DataSet
{
 // Bir takım kodlar
}&lt;/pre&gt;
&lt;p style="margin-top: 3; margin-bottom: 3;"&gt;Daha &amp;ouml;ncedende s&amp;ouml;ylediğimiz gibi Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi sınıfları DataSet sınıfından t&amp;uuml;retilmektedir. Yeni dataSet sınıfımız, i&amp;ccedil;ereceği tablo, alan, kısıtlama, ilişki gibi bilgileri bir xsd dosyasından almaktaydı. Biz xsd dosyasını oluştururken, DataSet'e Makale isimli tablonun yapısını y&amp;uuml;klemiştik. Bu durumda, Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi sınıfımız i&amp;ccedil;inde, Makale isimli tablomuzu belirten yeni bir DataTable &amp;uuml;yesi kullanılır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private MakaleDataTable tableMakale;&lt;/pre&gt;
&lt;p align="justify"&gt;Burada MakaleDataTable, DataTable sınfının &amp;ouml;zelleştirilmiş bir haline sunar.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;protected Makaleler(SerializationInfo info, StreamingContext context)
{
     string strSchema = ((string)(info.GetValue("XmlSchema", typeof(string))));
     if ((strSchema != null))
     {
          DataSet ds = new DataSet();

          ds.ReadXmlSchema(new XmlTextReader(new System.IO.StringReader(strSchema)));
               if ((ds.Tables["Makale"] != null))
               {
                    this.Tables.Add(new MakaleDataTable(ds.Tables["Makale"]));
               }              
...
}

...
public MakaleDataTable Makale
{
     get
     {
          return this.tableMakale;
     }

}

...&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi MakaleDataTable isminde yeni bir sınıfımız vardır. Bu sınıf Makale isimli tabloyu t&amp;uuml;m elemanları ile tanımlar. Bunun i&amp;ccedil;in, bu sınıf DataTable sınıfından t&amp;uuml;retilir. Makale tablosundaki her bir alan bu sınıf i&amp;ccedil;erisinde birer &amp;ouml;zellik haline gelir. Bununla birlikte bu yeni DataTable sınıfı, alan ekleme, alan silme gibi metodlar ve pek &amp;ccedil;ok olayıda tanımlar. Diğer yandan pek &amp;ccedil;ok DataTable metoduda bu sınıf i&amp;ccedil;inde override edilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class MakaleDataTable : DataTable, System.Collections.IEnumerable
{
     private DataColumn columnID;
     private DataColumn columnKonu;
     private DataColumn columnTarih;
     private DataColumn columnAdres;
     ...
     public int Count
     {
          get
          {
               return this.Rows.Count;
          }
     }
     internal DataColumn IDColumn
     {
          get
          {
               return this.columnID;
          }
     }
     public MakaleRow this[int index]
     {
          get
          {
               return ((MakaleRow)(this.Rows[index]));
          }
     }
     public event MakaleRowChangeEventHandler MakaleRowChanged;
...
     public void AddMakaleRow(MakaleRow row)
     {
          this.Rows.Add(row);
     }
     public MakaleRow AddMakaleRow(string Konu, System.DateTime Tarih, string Adres)
     {
          MakaleRow rowMakaleRow = ((MakaleRow)(this.NewRow()));
          rowMakaleRow.ItemArray = new object[] {null,Konu,Tarih,Adres};
          this.Rows.Add(rowMakaleRow);
          return rowMakaleRow;
     }
...
}&lt;/pre&gt;
&lt;p&gt;Buraya kadar , komut satırı yardımıyla ve kod yazarak bir Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesinin nasıl oluşturulacağını g&amp;ouml;rd&amp;uuml;k. Bu teknikteki adımları g&amp;ouml;zden ge&amp;ccedil;irmek gerekirse izlememiz gereken yol ş&amp;ouml;yle olucaktır.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk50_5.gif" alt="" width="260" height="345" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 5. Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi Oluşturulma Aşamaları&lt;/p&gt;
&lt;p align="justify"&gt;Şimdide, Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi sınıfını, Visual Studio.NET ortamında nasıl geliştireceğimizi g&amp;ouml;relim. Bu daha kolay bir yoldur. &amp;Ouml;ncelikle Visual Studio.Net ortamında bir Windows Uygulaması a&amp;ccedil;alım. Daha sonra, Server Explorer penceresinden Makale isimli tablomuzu Formumuza s&amp;uuml;r&amp;uuml;kleyelim.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk50_6.gif" alt="" width="270" height="434" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 6. Server Explorer ile Makale Tablosunun Forma Alınması&lt;/p&gt;
&lt;p align="justify"&gt;Bu durumda formumuzda otomatik olarak SqlConnection ve SqlDataAdapter nesnelerimiz oluşur.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk50_7.gif" alt="" width="250" height="44" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 7. SqlConnection ve SqlDataAdapter otomatik olarak oluşturulur.&lt;/p&gt;
&lt;p align="justify"&gt;Şimdi SqlDataAdapter nesnemizin &amp;ouml;zelliklerinden Generate DataSet'e tıkladığımızda karşımıza aşağıdaki pencere &amp;ccedil;ıkacaktır.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk50_8.gif" alt="" width="374" height="421" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 8. DataSet oluşturuluyor.&lt;/p&gt;
&lt;p align="justify"&gt;Burada DataSet nesnemiz otomatik olarak oluşturulacaktır. DataSet'imize dsMakale adını verelim ve OK başlıklı butona basalım. Şimdi Solution Explorer'da Show All Files se&amp;ccedil;eneğine tıklarsak, Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi sınıfımızın oluşturulduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk50_9.gif" alt="" width="228" height="240" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 9. Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;mesi&lt;/p&gt;
&lt;p align="justify"&gt;Artık uygulamamızda bu sınıfı kullanabiliriz. İşte &amp;ouml;rnek kod satırlarımız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private void Form1_Load(object sender, System.EventArgs e)
{
     dsMakale mk=new dsMakale();
     sqlDataAdapter1.Fill(mk.Makale);
     textBox1.Text=mk.Makale[3].Konu.ToString();
}&lt;/pre&gt;
&lt;p align="justify"&gt;Uygulamamızı &amp;ccedil;alıştırdığımızda aşağıdaki sonucu elde ederiz.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk50_10.gif" alt="" width="296" height="144" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 10. Uygulamanın Sonucu.&lt;/p&gt;
&lt;p align="justify"&gt;Bu makalemizde, Kuvvetle T&amp;uuml;rlendirilmiş Veri K&amp;uuml;melerinin ne olduğunu, nasıl oluşturulacağını ve nasıl kullanılacağını g&amp;ouml;rd&amp;uuml;k. İzleyen makalemizde bu konuya devam edicek ve Satır Ekleme, Satır D&amp;uuml;zenleme, Satır Silme gibi işlemlerin nasıl yapılacağını inceleyeceğiz. Hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-02-04 12:00:00</pubDate>
  <slug>Strongly-Typed-DataSet-1-(Kuvvetle-Turlendirilmis-Veri-Kumeleri)-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>dataset</tag>
    <tag>strongly-typed-data-controls</tag>
    <tag>strongly-typed-dataset</tag>
    <tag>data</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>