<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>.Net Core Web API Uygulamalarını Windows Service Üstünden Sunmak</title>
  <description>.Net Core 2.1 sürümü ile birlikte bazı yeni özellikler geldi. Bunlardan birisi de Asp.Net Core uygulamalarını Windows Service üzerinden sunabilmek. Söz konusu yeniliği inceleyeceğimiz bu yazımızda bir Web API hizmetini host etmeyi öğreneceğiz.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2018/07/scrummy.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Scrum'lı &amp;ccedil;evik g&amp;uuml;nlerimiz t&amp;uuml;m hızıyla devam ediyor. Artık takımın kapasitesi standart &amp;ccedil;izgiye oturmaya başladı. Daha verimli &amp;ccedil;alışıyor ve daha iyi değerler &amp;uuml;retebiliyoruz. Bunun bana olan en b&amp;uuml;y&amp;uuml;k artılarından birisi de yeni bir şeyler araştıracak vakit bulabilmek. Nitekim takım &amp;uuml;yelerinin değişime uygun olacak şekilde kendisini s&amp;uuml;rekli yeniliyor olması lazım. Bu a&amp;ccedil;ıdan motive edildiğimizi ifade edebilirim. G&amp;uuml;ndem maddemiz ise uzun zamandır pek yanına uğramadığımız ama mutlaka sistemlerimizin bir yerlerinde koşan Windows Service'ler.&lt;/p&gt;
&lt;p&gt;Micorosft, &amp;ccedil;ıkarttığı 2.1 s&amp;uuml;r&amp;uuml;m&amp;uuml; ile birlikte Asp.Net Core'a bazı yeni &amp;ouml;zellikler ekledi. Ben de ge&amp;ccedil;tiğimiz zaman zarfında bunlardan bir kısmını inceleme fırsatım buldum. İlgimi &amp;ccedil;eken yeniliklerden birisi de artık Asp.Net Core uygulamalarını Windows Service &amp;uuml;zerinden sunabiliyor olmamız. Bu bana eski WCF'li g&amp;uuml;nlerimi anımsattı. Orada da servisleri self-host mekanizması dışında&lt;em&gt;(Console gibi &amp;ccedil;alıştırmak)&lt;/em&gt;, IIS'de veya Windows Service olarak yayınlama şansına sahiptik&lt;em&gt;(hala sahibiz)&lt;/em&gt;&amp;nbsp;Yeni gelen kabiliyet tahmin edeceğiniz &amp;uuml;zere Windows tabanlı sistemler i&amp;ccedil;in ge&amp;ccedil;erli.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z konusu yeniliği inceleyeceğimiz bu yazımızda bir Web API hizmetini host etmeyi &amp;ouml;ğreneceğiz. Dilerseniz vakit kaybetmeden işlemlerimize başlayalım. &amp;Ouml;ncesinde sistemimizde &lt;a href="https://www.microsoft.com/net/download/windows" target="_blank"&gt;.Net Core 2.1&lt;/a&gt;'ın y&amp;uuml;kl&amp;uuml; olduğundan emin olmakta yarar var. &amp;Ouml;rneği Windows 10 işletim sisteminde, Visual Studio Code kullanarak yapacağım.&amp;nbsp;&lt;/p&gt;
&lt;h1&gt;Web API Uygulamasının Oluşturulması&lt;/h1&gt;
&lt;p&gt;İlk adım olarak&amp;nbsp;dummy web api uygulamasını oluşturalım. Artık adımız gibi bildiğimiz komutla house isimli bir proje oluşturdum.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new webapi -o house&lt;/pre&gt;
&lt;p&gt;Windows Service mekanizmasını Middleware tarafında kullanabilmek ve &amp;ccedil;alışma zamanında gerekli y&amp;ouml;nlendirmeleri yaptırmak i&amp;ccedil;in Microsoft.AspNetCore.Hosting.WindowsServices paketinin projeye eklenmesi gerekiyor. Bu y&amp;uuml;zden terminalden şu şekilde ilerliyoruz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet add package Microsoft.AspNetCore.Hosting.WindowsServices
dotnet restore&lt;/pre&gt;
&lt;p&gt;Gelelim kod tarafına. Proje dosyasında yapmamız gereken değişiklikle başlayalım. house.csproj dosyasını a&amp;ccedil;ıp PropertyGroup altına eğer yoksa RuntimeIdentifier bilgisini eklememiz gerekiyor.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;Project Sdk="Microsoft.NET.Sdk.Web"&amp;gt;

  &amp;lt;PropertyGroup&amp;gt;
    &amp;lt;TargetFramework&amp;gt;netcoreapp2.1&amp;lt;/TargetFramework&amp;gt;
    &amp;lt;RuntimeIdentifier&amp;gt;win7-x64&amp;lt;/RuntimeIdentifier&amp;gt;
  &amp;lt;/PropertyGroup&amp;gt;

  &amp;lt;ItemGroup&amp;gt;
    &amp;lt;Folder Include="wwwroot\" /&amp;gt;
  &amp;lt;/ItemGroup&amp;gt;

  &amp;lt;ItemGroup&amp;gt;
    &amp;lt;PackageReference Include="Microsoft.AspNetCore.App" /&amp;gt;
    &amp;lt;PackageReference Include="Microsoft.AspNetCore.Hosting.WindowsServices" Version="2.1.1" /&amp;gt;
  &amp;lt;/ItemGroup&amp;gt;

&amp;lt;/Project&amp;gt;&lt;/pre&gt;
&lt;p&gt;Standart şablon olarak gelen Controller'lar da bir değişiklik yapmayacağız. Amacımız servis geliştirmekten ziyade host ettirmek. Ancak program sınıfının main metodunda servisin bir Windows Service olarak ayağa kalkacağını belirtmemiz gerekiyor. Bu y&amp;uuml;zden Program.cs i&amp;ccedil;eriğini aşağıdaki gibi değiştireceğiz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System.Diagnostics;
using System.IO;
using Microsoft.AspNetCore;
using Microsoft.AspNetCore.Hosting;
using Microsoft.AspNetCore.Hosting.WindowsServices;

namespace house
{
    public class Program
    {
        public static void Main(string[] args)
        {
            var exePath = Process.GetCurrentProcess().MainModule.FileName;
            var rootFolder = Path.GetDirectoryName(exePath);
            var host = WebHost.CreateDefaultBuilder(args)
                                .UseContentRoot(rootFolder)
                                .UseStartup&amp;lt;Startup&amp;gt;()
                                .UseUrls("http://localhost:3403")
                                .Build();

            host.RunAsService();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;O anki g&amp;uuml;ncel Process'ten yararlanarak exe'nin adını ve yerini buluyoruz. Bu bilgi UseContentRoot tarafından kullanılacak. Windows Service hosting s&amp;uuml;recini devreye sokmak i&amp;ccedil;inde RunAsService metodundan yararlanılıyor.&lt;/p&gt;
&lt;h1&gt;Publish İşlemi&lt;/h1&gt;
&lt;p&gt;Sırada publish işlemleri var. Uygulamanın release edilebilir bir s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; oluşturabilmek i&amp;ccedil;in aşağıdaki komutla devam edebiliriz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet publish --configuration Release&lt;/pre&gt;
&lt;p&gt;Şirket bilgilsayarımdaki yapıya g&amp;ouml;re ilgili artifact'ler&amp;nbsp;C:\Projects\tips_tricks\house\bin\Release\netcoreapp2.1\win7-x64\publish klas&amp;ouml;r&amp;uuml;ne &amp;ccedil;ıkartıldı. Burada en dikkat &amp;ccedil;ekici nokta house.exe isimli bir dosyanın oluşması. Bildiğiniz &amp;uuml;zere web uygulamaları dll olarak dağıtılmakta ancak Windows Service'ler i&amp;ccedil;in &amp;ccedil;alıştırılabilir program dosyası(exe) olması gerekiyor. Bu dosyada &amp;uuml;retildiğine g&amp;ouml;re artık komut satırından Windows Servisi ile ilgili işlemlerimize başlayabiliriz.&lt;/p&gt;
&lt;h1&gt;SC ile Servisin Hazırlanması&lt;/h1&gt;
&lt;p&gt;sc aracından ve create komutundan yararlanarak bir servis&amp;nbsp;oluşturabiliriz. Oluşan servisin o anki durumunu &amp;ouml;ğrenmek i&amp;ccedil;in query, Servisi başlatmak i&amp;ccedil;inse start parametresinden yararlanıyoruz. Aynen aşağıda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sc create HouseAPIService binPath= "C:\Projects\tips_tricks\house\bin\Release\netcoreapp2.1\win7-x64\publish\house.exe"
sc query HouseAPIService
sc start HouseAPIService
sc query HouseAPIService&lt;/pre&gt;
&lt;p&gt;create komutunda servisin adını ve exe dosyasının olduğu konumu belirtiyoruz. &amp;Ccedil;ok uzun bir adres olduğu i&amp;ccedil;in siz denemelerinizi yaparken .Net Core uygulamanızı farklı bir lokasyona &amp;ccedil;ıkartabilirsiniz. --output parametresi bu noktada yardımcı olacaktır. Ben hat ettim siz etmeyin.&lt;/p&gt;
&lt;p&gt;Yukarıdaki komutları &amp;ccedil;alıştırdıktan sonra aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndeki sonu&amp;ccedil;ları aldım.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/07/corewins_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere HouseAPIService başarılı bir şekilde &amp;ccedil;alışır konuma geldi. State ge&amp;ccedil;işlerinden bunu g&amp;ouml;rebiliriz. Buna g&amp;ouml;re artık http://localhost:3403/api/values&amp;nbsp;adresine talepte bulunabiliriz. İşte postman'den elde ettiğim sonu&amp;ccedil;.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/07/corewins_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Artık Windows Service &amp;uuml;zerinden yayında olan bir Web API hizmetimiz var. Windows servisini durdurursak tahmin edeceğiniz &amp;uuml;zere Web API'yi kullanamayız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2018/07/corewins_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabii bu işsiz servisi sistemde tutmak doğru değil. Sonu&amp;ccedil;ta unutulabilir ve boat anchor anti-pattern hali oluşabilir. Bu servisi silmek i&amp;ccedil;in sc'nin delete komutundan yararlanabiliriz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;sc delete HouseAPIService&lt;/pre&gt;
&lt;p&gt;Artık bu servis hayatta değil. Hepsi bu :)&amp;nbsp;&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece bir Web API servisini Windows Service &amp;uuml;zerinde nasıl yayınlayabileceğimizi &amp;ouml;ğrenmiş olduk. Artık Asp.Net Core uygulamaları i&amp;ccedil;in elimizde alternatif bir host se&amp;ccedil;eneği daha var. Asp.Net Core 2.1 ile birlikte gelen diğer &amp;ouml;zellikleri de zaman i&amp;ccedil;erisinde incelemeye &amp;ccedil;alışacağım. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2018-10-17 07:53:00</pubDate>
  <slug>Net-Core-Web-API-Uygulamalarını-Windows-Service-Ustunden-Sunmak</slug>
  <tags>
    <tag>windows-services</tag>
    <tag>net-core</tag>
    <tag>web-api</tag>
    <tag>hosting</tag>
    <tag>aspnet-core</tag>
    <tag>service-controller</tag>
    <tag>windows-7</tag>
    <tag>c#</tag>
    <tag>dotnet</tag>
    <tag>code-activity</tag>
    <tag>sc</tag>
    <tag>microsoft-asp-net-core-hosting-windows-services</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
  </categories>
</post>