<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF 4.0 Yenilikleri - Artık Svc Uzantısına Gerek Yok [Beta 1]</title>
  <description>Nihayet WCF 4.0 için basitleştirilmiş konfigurasyon(Simplified Configuration) yeniliklerinden sonuncusuna değineceğimiz blog girişimize ulaştık. Tabiki WCF 4.0 tarafındaki diğer yenilikleride zaman içerisinde inceliyoruz olacağız. Örneğin Discovery, Routing, RESTful geliştirmeleri vb...Ancak diğer köklü değişikliklere başlamadan önce konfigurasyon tarafına son noktayı koyalım artık.Wink</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Nihayet &lt;strong&gt;WCF 4.0&lt;/strong&gt; i&amp;ccedil;in &lt;strong&gt;basitleştirilmiş&amp;nbsp;konfigurasyon(Simplified Configuration)&amp;nbsp;&lt;/strong&gt;yeniliklerinden sonuncusuna değineceğimiz blog girişimize ulaştık. Tabiki &lt;strong&gt;WCF 4.0&lt;/strong&gt; tarafındaki diğer yenilikleride zaman i&amp;ccedil;erisinde inceliyoruz olacağız. &amp;Ouml;rneğin &lt;strong&gt;Discovery, Routing, RESTful&lt;/strong&gt; geliştirmeleri vb...Ancak diğer k&amp;ouml;kl&amp;uuml; değişikliklere başlamadan &amp;ouml;nce konfigurasyon tarafına son noktayı koyalım artık.&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bir &amp;ouml;nceki blog yazımızdan hatırlayacağınız &amp;uuml;zere &lt;strong&gt;Asp.Net&lt;/strong&gt; tabanlı olarak host edilen &lt;strong&gt;WCF&lt;/strong&gt; servislerinde, tek bir &lt;strong&gt;svc&lt;/strong&gt; dosyası ilede yayınlama yapabileceğimizi g&amp;ouml;rm&amp;uuml;şt&amp;uuml;k. &lt;strong&gt;Asp.Net hosting&lt;/strong&gt; tarafını ilgilendiren bir diğer yenilik ise &lt;strong&gt;Url Rewriting&lt;/strong&gt; konusunun &lt;strong&gt;Svc&lt;/strong&gt; dosyaları i&amp;ccedil;in de uyarlanabilir olmasıdır. Bildiğiniz gibi &amp;ouml;zellikle &lt;strong&gt;RESTful&lt;/strong&gt; servislerde, &lt;strong&gt;URL&lt;/strong&gt; satırında yer alan bilginin daha okunaklı ve anlaşılır olması s&amp;ouml;z konusudur ve &amp;ouml;nemlidir. Genellikle &lt;strong&gt;IIS&lt;/strong&gt; tarafında veya kod yardımıyla ger&amp;ccedil;ekleştirilebilecek bu işlemler i&amp;ccedil;in &lt;strong&gt;WCF&lt;/strong&gt; tarafı konfigurasyon bazında bir kolaylık getirmektedir. Yine bir &amp;ouml;nceki blog yazımızda yer alan &amp;ouml;rneği g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alırsak son hali ile aşağıdaki gibi &amp;ccedil;alıştırıldığını hatırlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg65_RuntimeMetadata.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Burada g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi servisin adresi &lt;strong&gt;http://localhost:53513/AdventureService.svc&lt;/strong&gt; şeklindedir. Bir başka deyişle tipik bir dosya uzantısı talebi(svc file request)&amp;nbsp;ifade edilmektedir. Ancak istenirse servise olan talebin,&lt;/p&gt;
&lt;p&gt;http://localhost:53513&lt;strong&gt;/Companies/Adventure/ProductInformations&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;şeklindeki bir URL tanımlaması ile&amp;nbsp;olmasıda sağlanabilir. Bu&amp;nbsp;yazım,&amp;nbsp;okunaklığı ve herşeyden &amp;ouml;nemlisi servis amacını &amp;ccedil;ok daha net ifade edebilecek bir model sunmaktadır. Peki bu tanımlamanın WCF tarafındaki ge&amp;ccedil;erliliği &amp;ouml;zel&amp;nbsp;kod yazmadan veya IIS'e bulaşmadan&amp;nbsp;nasıl sağlanabilir?&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF 4.0&lt;/strong&gt; a&amp;ccedil;ısından olaya bakıldığında yapılması gereken tek şey &lt;strong&gt;web.config&lt;/strong&gt; dosyası i&amp;ccedil;erisinde aşağıdaki eklentilerin yapılmasıdır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;system.serviceModel&amp;gt;
    &amp;lt;behaviors&amp;gt;
      &amp;lt;serviceBehaviors&amp;gt;
        &amp;lt;behavior&amp;gt;
          &amp;lt;serviceMetadata httpGetEnabled="true"/&amp;gt;
        &amp;lt;/behavior&amp;gt;
      &amp;lt;/serviceBehaviors&amp;gt;
    &amp;lt;/behaviors&amp;gt;
    &amp;lt;serviceHostingEnvironment&amp;gt;
      &amp;lt;serviceActivations&amp;gt;
        &amp;lt;add relativeAddress="/Companies/Adventure/ProductInformations" service="AdventureService"/&amp;gt;
      &amp;lt;/serviceActivations&amp;gt;
    &amp;lt;/serviceHostingEnvironment&amp;gt;
  &amp;lt;/system.serviceModel&amp;gt;&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;serviceHostingEnvironment&lt;/strong&gt; elementi i&amp;ccedil;erisinde yer alan &lt;strong&gt;serviceActivations&lt;/strong&gt; boğumuna yeni bir &lt;strong&gt;Relative Address&lt;/strong&gt; bilgisi eklenmiştir. Buna g&amp;ouml;re &lt;strong&gt;/Companies/Adventure/ProductInformations&lt;/strong&gt; bilgisi aslında &lt;strong&gt;AdventureService&lt;/strong&gt; isimli servisi işaret etmektedir. Dolayısıyla &lt;strong&gt;WCF &amp;ccedil;alışma zamanı(Runtime)&lt;/strong&gt; gelen talepteki &lt;strong&gt;URL&lt;/strong&gt; bilgisini değerlendirip hangi servisi ayağa kaldırması/&amp;ccedil;alıştırması gerektiğini s&amp;ouml;z konusu konfigurasyon i&amp;ccedil;eriğinden anlayabilmektedir. Geliştirdiğimiz &amp;ouml;rneğin bu şekilde &amp;ccedil;alıştırılması halinde aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;lar ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg66_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Hatta WSDL i&amp;ccedil;eriğide aynı adresleme formatı &amp;uuml;zerinden elde edilebilmektedir. &amp;Ccedil;ok doğal olarak &lt;strong&gt;WSDL&lt;/strong&gt; i&amp;ccedil;eriğinde de &lt;strong&gt;SOAP &lt;/strong&gt;adres tanımlamaları ile ilişkili b&amp;ouml;l&amp;uuml;mlerde yeni adresleme bilgisi kullanılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f8%2fblg66_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sırada Discovery, RESTFul ve Routing gibi yeniliklerin incelenmesi var. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f8%2fSimpleAspNetHosting2.rar"&gt;SimpleAspNetHosting2.rar (13,94 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-08-18 03:45:00</pubDate>
  <slug>WCF-40-Yenilikleri-No-Svc-(File-less)</slug>
  <tags>
    <tag>wcf</tag>
    <tag>wcf-40</tag>
  </tags>
  <categories>
    <category>WCF 4.0 Beta 1</category>
  </categories>
</post>