<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Excel İçeriğini DataSet Olarak Sisteme Katmak</title>
  <description>Bazen geliştirme ortamımız ile yazılan uygulamanın taşınacağı ortamlar arasında ciddi ve keskin farklılıklar bulunur. İki resim arasındaki 9 farkı bulunuzdan öte, geliştirici ekiplerinin bu farkları bilerek kodlama yapmasında yarar vardır. Tabi bazı yazılım ekiplerinde Development sunucularının sanallaştırılmış versiyonları üzerinde geliştirme yapabilme imkanı da vardır.</description>
  <content>&lt;p&gt;&lt;a href="/pics/production-bug.jpg"&gt;&lt;img style="float: right; margin: 4px 0px; display: inline;" title="production-bug" src="/pics/production-bug_thumb.jpg" alt="production-bug" width="240" height="340" align="right" /&gt;&lt;/a&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bazen geliştirme ortamımız ile yazılan uygulamanın taşınacağı ortamlar arasında ciddi ve keskin farklılıklar bulunur. İki resim arasındaki 9 farkı bulunuzdan &amp;ouml;te, geliştirici ekiplerinin bu farkları bilerek kodlama yapmasında yarar vardır. Tabi bazı yazılım ekiplerinde &lt;strong&gt;Development&lt;/strong&gt; sunucularının sanallaştırılmış versiyonları &amp;uuml;zerinde geliştirme yapabilme imkanı da vardır.&lt;/p&gt;
&lt;p&gt;Bu tip bir yaklaşım ortak ortam standartlarının geliştirme de kullanılmasına olanak tanımaktadır. Ancak geliştiriciler uygulamanın host edileceği ortamlar hakkında fazla d&amp;uuml;ş&amp;uuml;nceli davranmazsa&lt;em&gt;(aynen benim gibi)&lt;/em&gt;, &amp;ouml;zellikle kendi ortamında elinde yer alan her aracın orada sorunsuz &amp;ccedil;alışabileceğini d&amp;uuml;ş&amp;uuml;n&amp;uuml;rse b&amp;uuml;y&amp;uuml;k hata yapar. İşte benim i&amp;ccedil;ine d&amp;uuml;şt&amp;uuml;ğ&amp;uuml;m durum ve uyguladığım basit &amp;ccedil;&amp;ouml;z&amp;uuml;m.&lt;/p&gt;
&lt;h1&gt;Vaka&lt;/h1&gt;
&lt;p&gt;Ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde şirkette geliştirmekte olduğumuz projede ş&amp;ouml;yle bir ihtiya&amp;ccedil; oluştu;&lt;/p&gt;
&lt;p&gt;Yetkili kullanıcılar erişim hakkı olan bir sayfadan belirli kurallara uygun olacak şekilde bir veya daha fazla &lt;strong&gt;Excel&lt;/strong&gt; dosyası y&amp;uuml;kleyecekti. Y&amp;uuml;klenen &lt;strong&gt;Excel&lt;/strong&gt; dosya i&amp;ccedil;eriği yine &amp;ccedil;eşitli iş kurallarından ge&amp;ccedil;irilerek denetlenecek ve uygun olan satır i&amp;ccedil;eriklerinin daha sonradan işlenmek &amp;uuml;zere veritabanına yazılması s&amp;ouml;z konusuydu. Sonrasında bu veri i&amp;ccedil;eriği, sistem i&amp;ccedil;erisinde takvimlendirilmiş bir iş par&amp;ccedil;acağında değerlendirilecekti.&lt;/p&gt;
&lt;p&gt;Aslında ihtiya&amp;ccedil; tipik anlamda bir toplu sorgulama ve işleme &amp;uuml;zerine kuruluydu&lt;em&gt;(Batch Process)&lt;/em&gt;. Olayın taraflarından birisinin &lt;strong&gt;İş Birimi&lt;/strong&gt; olduğunu d&amp;uuml;ş&amp;uuml;n&amp;uuml;ld&amp;uuml;ğ&amp;uuml;nde, bu şekilde bir &lt;strong&gt;Excel&lt;/strong&gt; dosya i&amp;ccedil;eriğinin sisteme bir noktadan kolayca sokulabilmesi son derece doğal bir ihtiya&amp;ccedil;tı.&lt;/p&gt;
&lt;p&gt;Hal b&amp;ouml;yle olunca ben de uygulamanın geliştiricisi olarak kolları sıvadım. İlk aklıma gelen &amp;ccedil;ok doğal olarak &lt;strong&gt;Excel&lt;/strong&gt;' in makinede y&amp;uuml;kl&amp;uuml; olan &lt;strong&gt;Interop Assembly&lt;/strong&gt;' larını kullanmaktı. &lt;strong&gt;.Net Framework 4.0&lt;/strong&gt; sonrası gelen &lt;strong&gt;Optional Parameters&lt;/strong&gt; ve &lt;strong&gt;dynamic&lt;/strong&gt; gibi materyaller işimi kolaylaştırabilirdi.&lt;/p&gt;
&lt;p&gt;Ne var ki olayın farklı bir boyutu daha vardı. S&amp;ouml;z konusu işlevsellik ister bir servis metodun ister bir web sayfasının buton arkası kod par&amp;ccedil;ası olsun, firmanın &amp;ccedil;eşitli sunucularında host edilecek bir uygulamanın i&amp;ccedil;erisinde yer alacaktı.&lt;/p&gt;
&lt;p&gt;Ben geliştirmemi tamalayıp sunucuya test i&amp;ccedil;in g&amp;ouml;nderdikten sonra acı ger&amp;ccedil;ekle karşılaştım. Sunucu da kullandığım Microsoft.Office.Interop.Excel.dll&amp;rsquo; i kayıtlı değildi. Yani Register ayarlarında yer almıyordu. Sunucu da doğal olarak Excel y&amp;uuml;kl&amp;uuml; olmadığından sonu&amp;ccedil; ka&amp;ccedil;ınılmazdı. Durumu d&amp;uuml;zeltmek i&amp;ccedil;in doğal olarak Sistem Y&amp;ouml;neticisindeki yakın arkadaşımın kapısını &amp;ccedil;aldım. Aldığım cevap acı verici idi. &amp;ldquo; Hocam sunuculara bu dll i&amp;ccedil;in gerekli kurulumları yapmıyoruz. Lisans sorunu var&amp;rdquo;&lt;/p&gt;
&lt;p&gt;Kurumsal bir firma da sunucular i&amp;ccedil;in uyulması gereken pek &amp;ccedil;ok kural vardır. Geliştirilen bir &amp;uuml;r&amp;uuml;n i&amp;ccedil;in &lt;strong&gt;Development&lt;/strong&gt;, &lt;strong&gt;Test&lt;/strong&gt;, &lt;strong&gt;PreProduction&lt;/strong&gt; ve &lt;strong&gt;Production&lt;/strong&gt; gibi farklı ortamlar s&amp;ouml;z konusudur. Birbirleriyle bire bir aynı olması arzulanan bu ortamlara erişim kısıtlıdır. &amp;Ccedil;oğunlukla geliştiricilerin erişimine tamamen kapalıdır. B&amp;ouml;yle bir durumda ilgili sunuculara &amp;uuml;retilen kodların atılış şekilleri de &amp;ouml;nemlidir ki bu aslında makalemizi aşan bir konudur. Nitekim pek &amp;ccedil;ok dağıtım stratejisi ve buna bağlı ara&amp;ccedil; bulunmaktadır. Bizim i&amp;ccedil;in bu vakada &amp;ouml;nemli olan ise firma politikası ve lisanslama modeli gereği sunucuya &lt;strong&gt;Microsoft.Office.Interop.Excel.dll&lt;/strong&gt;' lerinin kayıt edilememesi ger&amp;ccedil;eğidir.&lt;/p&gt;
&lt;p&gt;Tabi geliştirici makinelerinde &lt;strong&gt;Excel&lt;/strong&gt; gibi &lt;strong&gt;Office&lt;/strong&gt; &amp;uuml;r&amp;uuml;nleri y&amp;uuml;kl&amp;uuml; olduğundan bu &lt;strong&gt;Interop'&lt;/strong&gt; ların kullanılabilmesi son derece kolaydır. Ancak sunucu ortamlarında işler farklı y&amp;uuml;r&amp;uuml;r.&lt;/p&gt;
&lt;h1&gt;Uygun &amp;Ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; Keşfetmek&lt;/h1&gt;
&lt;p&gt;İşte bu y&amp;uuml;zden farklı bir yol bulmam gerekiyordu. En pratik olan eski stilde &lt;strong&gt;Excel&lt;/strong&gt; i&amp;ccedil;eriğine ulaşmaya &amp;ccedil;alışmaktı. Yani &lt;strong&gt;OleDbConnection&lt;/strong&gt; sınıfını uygun &lt;strong&gt;provider&lt;/strong&gt; bilgisini i&amp;ccedil;eren bir bağlantı ifadesi ile tesis ederek işe başlamam gerekiyordu.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Aslında bir Excel dosyasını okumak i&amp;ccedil;in kullanılabilecek bir ka&amp;ccedil; yol bulunmaktadır. Aşağıdaki şekilde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi pek &amp;ccedil;ok Provider s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/exltods_5.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="exltods_5" src="/pics/exltods_5_thumb.png" alt="exltods_5" width="615" height="218" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Bu noktada epeyce şanslı olduğumu ifade edebilirim. Nitekim sunucular &amp;uuml;zerinde &amp;uuml;cretsiz olarak dağıtılabilen &lt;strong&gt;Microsoft Access Database Engine 2010 Redistributable&lt;/strong&gt; paketi kuruluydu. Hatta bunun 4.0 versiyonu da yer alıyordu. &lt;a href="http://www.microsoft.com/en-us/download/details.aspx?id=13255" target="_blank"&gt;Bu adresten&lt;/a&gt; indirebileceğiniz paket ile&lt;strong&gt; Excel'&lt;/strong&gt; in var olan t&amp;uuml;m s&amp;uuml;r&amp;uuml;mlerine bağlantı kurulabilmekte.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin aşağıdaki ifade ile &lt;strong&gt;Excel 2007, 2010&lt;/strong&gt; ve &lt;strong&gt;2013&lt;/strong&gt; s&amp;uuml;r&amp;uuml;mlerini a&amp;ccedil;abiliriz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Provider=Microsoft.ACE.OLEDB.12.0;Data Source=c:\GameBook.xlsx;Extended Properties="Excel 12.0 Xml;HDR=YES";&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Daha &amp;ouml;nceki &lt;strong&gt;Excel&lt;/strong&gt; s&amp;uuml;r&amp;uuml;mlerine g&amp;ouml;re de &lt;strong&gt;Provider&lt;/strong&gt;' ı set edebiliriz. Tek yapılması gereken &lt;strong&gt;Extended&lt;/strong&gt; &lt;strong&gt;Properties&lt;/strong&gt; kısmında &lt;strong&gt;Excel 8.0&lt;/strong&gt; ifadesine yer vermektir. Bu sayede &lt;strong&gt;Excel 97, 2000, 2002&lt;/strong&gt; ve &lt;strong&gt;2003&lt;/strong&gt; s&amp;uuml;r&amp;uuml;mlerine bağlantı sağlayabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Provider=Microsoft.ACE.OLEDB.12.0;Data Source=c:\GameBook.xlsx;Extended Properties="Excel 8.0;HDR=YES";&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Her iki bağlantı ifadesinde yer alan &lt;strong&gt;HDR&lt;/strong&gt; ifadesi, &lt;strong&gt;Excel&lt;/strong&gt; dosyası i&amp;ccedil;erisindeki&lt;strong&gt; Sheet'&lt;/strong&gt; ler ilk satırın başlık kolonları olduğunu ifade etmektedir. Extended Properties kısmında kullanılabilecek başka &lt;strong&gt;key-value&lt;/strong&gt; değerleri de mevcuttur. Bunları araştırmanızı &amp;ouml;neririm. Diğer yandan &lt;strong&gt;Excel&lt;/strong&gt; i&amp;ccedil;in farklı &lt;strong&gt;Provider&lt;/strong&gt;' larca kullanılabilecek bağlantı ifadeleri i&amp;ccedil;in &lt;a href="http://www.connectionstrings.com/excel/" target="_blank"&gt;şu adrese bakabilirsiniz&lt;/a&gt;.&lt;/p&gt;
&lt;h1&gt;Bağlantı C&amp;uuml;mlesi Tamam da Sonrası&lt;/h1&gt;
&lt;p&gt;Bağlantı c&amp;uuml;mlesi hazır olduğuna g&amp;ouml;re artık kodlamaya başlayabilirdim. Burada da aslında izlenebilecek epeyce farklı yol vardı. Ben &lt;strong&gt;Excel&lt;/strong&gt; i&amp;ccedil;eriklerini sistem i&amp;ccedil;erisinde bir &lt;strong&gt;DataSet&lt;/strong&gt; olarak taşımayı d&amp;uuml;ş&amp;uuml;nm&amp;uuml;şt&amp;uuml;m. Uygulama da &amp;ccedil;eşitli tiplerin genişletilmiş fonksiyonelliklerinin tutulduğu &lt;strong&gt;Cross-Cutting&lt;/strong&gt; vari bir k&amp;uuml;t&amp;uuml;phaneye odaklandım ve &lt;strong&gt;DataSet&lt;/strong&gt; tipine bir &lt;strong&gt;LoadFromExcel&lt;/strong&gt; isimli bir &lt;strong&gt;Extension&lt;/strong&gt; &lt;strong&gt;Metod&lt;/strong&gt; ilave etmeye karar verdim.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Takip eden &amp;ouml;rnek kod par&amp;ccedil;asında yer alan pek &amp;ccedil;ok kısım kasıtlı olarak &amp;ccedil;ıkartılmıştır. &amp;Ccedil;ıkartılan kısımlar yazının sonundaki maddelerde belirtilen ve siz değerli okurlarıma &amp;ouml;dev olanlardır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h1&gt;Kodlama&lt;/h1&gt;
&lt;p&gt;İşte &lt;strong&gt;DataSet&lt;/strong&gt; i&amp;ccedil;in eklediğimiz genişletme metodunun kod par&amp;ccedil;ası.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System; 
using System.Data; 
using System.Data.OleDb;

namespace Demo 
{ 
    public static class DataSetExtensions 
    { 
        public static int LoadFromExcel(this DataSet DataSet, string FileName) 
        { 
            int sheetCount = 0; 
            string connectionString = String.Format("Provider=Microsoft.ACE.OLEDB.12.0;Data Source={0};Extended Properties=\"Excel 12.0 Xml;HDR=YES;\"", FileName);

            using (OleDbConnection connection = new OleDbConnection(connectionString)) 
            { 
                OleDbCommand command = new OleDbCommand(); 
                command.Connection = connection; 
                connection.Open();

                DataTable sheets = connection.GetOleDbSchemaTable(OleDbSchemaGuid.Tables, null);

                foreach (DataRow dr in sheets.Rows) 
                { 
                    string sheetName = dr["TABLE_NAME"].ToString(); 
                    command.CommandText = "SELECT * FROM [" + sheetName + "]"; 
                    OleDbDataAdapter adapter = new OleDbDataAdapter(command); 
                    DataTable dataTable = CreateDataTable(sheetName); 
                   adapter.Fill(dataTable); 
                    DataSet.Tables.Add(dataTable); 
                    sheetCount++; 
                } 
            } 
            return sheetCount; 
        }

        private static DataTable CreateDataTable(string SheetName) 
        { 
            DataTable newTable = new DataTable(); 
            newTable.TableName = SheetName; 
            DataColumn rowNumber = new DataColumn("RowNumber", typeof(int)); 
            rowNumber.AutoIncrement = true; 
            rowNumber.AutoIncrementSeed = 1; 
            rowNumber.AutoIncrementStep = 1; 
            newTable.Columns.Add(rowNumber); 
            return newTable; 
        } 
    } 
}&lt;/pre&gt;
&lt;h1&gt;Kodlarda Ne Yaptım&lt;/h1&gt;
&lt;p&gt;Pek tabi &lt;strong&gt;genişletme metodları&lt;em&gt;(Extension Methods)&lt;/em&gt;&lt;/strong&gt; &lt;strong&gt;static&lt;/strong&gt; olup ilk parametresinde &lt;strong&gt;this&lt;/strong&gt; &lt;strong&gt;keyword'&lt;/strong&gt; &amp;uuml;n&amp;uuml; kullanmak durumundadır. Bilindiği &amp;uuml;zere buradaki ilk parametre genişletme metodunun uygulandığı tipi ifade etmektedir.&lt;/p&gt;
&lt;p&gt;Metodun ilk parametresi aynı zamanda &lt;strong&gt;LoadFromExcel&lt;/strong&gt; fonksiyonunu &amp;ccedil;alışma zamanında &amp;ccedil;ağıracak olan nesne &amp;ouml;rneğini işaret eder. İkinci parametre ile gelen dosya adını doğru bağlantı bilgisini oluşturmak i&amp;ccedil;in kullanmaktayız. İlk yapılması gereken &lt;strong&gt;Excel&lt;/strong&gt; i&amp;ccedil;erisindeki &lt;strong&gt;Sheet&lt;/strong&gt;' leri yakalamak. Bunun i&amp;ccedil;in &lt;strong&gt;OleDbConnection&lt;/strong&gt; tipinin &lt;strong&gt;GetOleDbSchemaTable&lt;/strong&gt; metodu kullanılmaktadır. &lt;strong&gt;OleDbSchemaGuid.Tables&lt;/strong&gt; &lt;strong&gt;enum&lt;/strong&gt; sabiti nedeniyle &lt;strong&gt;Sheet&lt;/strong&gt; adlarını da barındıran bir &lt;strong&gt;DataTable&lt;/strong&gt; elde edilir. Aynen aşağıdaki &amp;ccedil;alışma zamanı g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer aldığı gibi.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/exltods_1.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="exltods_1" src="/pics/exltods_1_thumb.png" alt="exltods_1" width="609" height="211" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Kod bu &lt;strong&gt;Sheet&lt;/strong&gt;' leri tek tek sorgulamak i&amp;ccedil;in &lt;strong&gt;OldDbCommand&lt;/strong&gt; nesnesinin &lt;strong&gt;CommandText&lt;/strong&gt; &amp;ouml;zelliğini değiştirmektedir. Aslında burada tipik bir &lt;strong&gt;SQL&lt;/strong&gt; &lt;strong&gt;Select&lt;/strong&gt; ifadesi &amp;ccedil;alıştırılır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Select * from [Oyuncular$]&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;gibi.&lt;/p&gt;
&lt;p&gt;Bu ifadeyi i&amp;ccedil;eren &lt;strong&gt;OleDbCommand&lt;/strong&gt; nesne &amp;ouml;rnekleri bir &lt;strong&gt;OleDbDataAdapter'&lt;/strong&gt; dan yararlanılarak &lt;strong&gt;DataTable&lt;/strong&gt; haline getirilir. Elde edilen &lt;strong&gt;DataTable&lt;/strong&gt; &amp;ouml;rnekleri ise, metoda ilk parametre olarak giren &lt;strong&gt;DataSet&lt;/strong&gt; nesnesinin &lt;strong&gt;Tables&lt;/strong&gt; koleksiyonuna eklenir.&lt;/p&gt;
&lt;p&gt;Mutlaka dikkatinizi &amp;ccedil;ekmiştir ki bir de &lt;strong&gt;CreateDataTable&lt;/strong&gt; isimli bir fonksiyon kullanılmaktadır. Aslında bu &lt;strong&gt;fonksiyon&lt;/strong&gt; doldurulacak &lt;strong&gt;Table'&lt;/strong&gt; lara otomatik olarak artan bir s&amp;uuml;tun eklemekle g&amp;ouml;revlidir. Bu otomatik artan &lt;strong&gt;ID&lt;/strong&gt; değerleri &amp;ouml;zellikle &lt;strong&gt;Table&lt;/strong&gt; i&amp;ccedil;eriklerinin g&amp;ouml;rsel &lt;strong&gt;Web&lt;/strong&gt; bileşenlerine bağlandığı yerlerde kritik bir rol &amp;uuml;stlenebilir. Dahası, okunan &lt;strong&gt;Table&lt;/strong&gt; i&amp;ccedil;eriklerine ekstradan kolon eklenmesi gibi talepleri de bu fonksiyon i&amp;ccedil;erisinde karşılayabiliriz.&lt;/p&gt;
&lt;p&gt;Son olarak metodun geriye, eklenen &lt;strong&gt;DataTable&lt;/strong&gt; sayısını d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml; belirtebiliriz. Bu bilgi &lt;strong&gt;object&lt;/strong&gt; &lt;strong&gt;user&lt;/strong&gt; tarafından değerlendirilebilir. Bir nevi &lt;strong&gt;ExecuteNonQuery&lt;/strong&gt; metodunun işlem g&amp;ouml;ren satır sayısını d&amp;ouml;nd&amp;uuml;rmesi felsefesini kullanmaya &amp;ccedil;alıştık.&lt;/p&gt;
&lt;h1&gt;Testler&lt;/h1&gt;
&lt;p&gt;Uygulamayı test etmek i&amp;ccedil;in ben aşağıdaki i&amp;ccedil;eriklere sahip basit bir &lt;strong&gt;Excel&lt;/strong&gt; dosyasından yararlandım. &lt;strong&gt;GameBook&lt;/strong&gt; isimli dosya &lt;strong&gt;Excel 2013&lt;/strong&gt; formatında ama diğer formatları da deneyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/exltods_2.png"&gt;&lt;img style="display: inline;" title="exltods_2" src="/pics/exltods_2_thumb.png" alt="exltods_2" width="271" height="315" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/exltods_3.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="exltods_3" src="/pics/exltods_3_thumb.png" alt="exltods_3" width="256" height="257" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ccedil;alışma zamanında &lt;strong&gt;DataSet&lt;/strong&gt; i&amp;ccedil;eriğini &lt;strong&gt;Visualizer&lt;/strong&gt; ile incelediğimizde aşağıdaki gibi &lt;strong&gt;Excel&lt;/strong&gt; &lt;strong&gt;Sheet&lt;/strong&gt; i&amp;ccedil;eriklerinin y&amp;uuml;klendiğini g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/exltods_4.png"&gt;&lt;img style="margin: 4px 0px; display: inline;" title="exltods_4" src="/pics/exltods_4_thumb.png" alt="exltods_4" width="539" height="478" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;h1&gt;Peki Ya Yapmadıklarımız&lt;/h1&gt;
&lt;p&gt;&amp;Ouml;nceden de belirttiğim &amp;uuml;zere bu ger&amp;ccedil;ek hayat senaryosunda ki bazı maddeler &amp;ccedil;ıkartılmış durumdadır. Aşağıdakileri yapmaya &amp;ccedil;alışarak kendinizi bu konuda geliştirmeye devam edebilirsiniz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Her şeyden &amp;ouml;nce kullanıcı aslında &lt;strong&gt;Excel&lt;/strong&gt; tipinde olmayan bir dosyayı da y&amp;uuml;klemeye &amp;ccedil;alışabilir. Ya da sistemin aslında ele &lt;span style="text-decoration: underline;"&gt;almaması&lt;/span&gt; gereken sınır bir dosya boyutunun &amp;uuml;zerinde olabilir. Bunun &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek i&amp;ccedil;in elbette aray&amp;uuml;z tarafında bir takım tedbirler almak daha mantıklıdır. &amp;Ouml;rneğin &lt;strong&gt;Javascript&lt;/strong&gt; ile. Fakat fonksiyonun genel bir &lt;strong&gt;Extension&lt;/strong&gt; olduğunu d&amp;uuml;ş&amp;uuml;necek olursak, bir şekilde bu tip doğrulama stratejilerini &amp;ouml;ğrenebilmesi g&amp;uuml;zel olabilir. Belki &lt;strong&gt;Attribute&amp;rsquo;&lt;/strong&gt; lar ile dekore edilebilir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Extension Method&amp;rsquo;&lt;/strong&gt; un ayrı bir &lt;strong&gt;Library&lt;/strong&gt; i&amp;ccedil;erisine alınması sağlanabilir. Bu &amp;ouml;rnekte sadece metodun yazımını ve basit kullanımını inceledik. Pek tabi &lt;strong&gt;Enterprise&lt;/strong&gt; bir &amp;ccedil;&amp;ouml;z&amp;uuml;mde bu tip fonksiyonelliklerin farklı bir k&amp;uuml;t&amp;uuml;phanede konuşlandırılması daha doğrudur.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Excel&lt;/strong&gt; i&amp;ccedil;eriklerinin &amp;ccedil;eşitli &lt;strong&gt;doğrulama&lt;em&gt;(Validation)&lt;/em&gt;&lt;/strong&gt; stratejilerine g&amp;ouml;re taranabilmesi iş birimi i&amp;ccedil;in &amp;ouml;nemli olabilir. Mutlaka okunan &lt;strong&gt;Excel&lt;/strong&gt; i&amp;ccedil;eriğinde insan hatası i&amp;ccedil;erikler yer alabilir. &amp;Ouml;zellikle dosya şema yapısı işlenirken sorun &amp;ccedil;ıkartabilecek formatta bulunabilir. Bu tip olası şema ve veri hatalarının denetlenmesi uygun olacaktır. Nitekim ilgili doğrulama kriterlerine yenileri de eklenebilir. Bu yeni kriterlerin ilgili fonskiyonellik i&amp;ccedil;erisine de kolayca ve zahmetsizce&lt;em&gt;(kod a&amp;ccedil;maya gerek duymadan)&lt;/em&gt; enjekte edilmesi &amp;ouml;nemlidir. Yani &lt;strong&gt;DataSet&lt;/strong&gt; &amp;ccedil;alışma zamanında bir strateji benimseyebilmeli ve hatta davranış değiştirebilmelidir.&lt;/li&gt;
&lt;li&gt;Metodun farklı &lt;strong&gt;Excel&lt;/strong&gt; &lt;strong&gt;Provider&amp;rsquo;&lt;/strong&gt; ları ile &amp;ccedil;alışacak şekilde dekore edilmesi gerekebilir. Firmanın farklı kullanıcılarının farklı &lt;strong&gt;Excel&lt;/strong&gt; s&amp;uuml;r&amp;uuml;mleri ile &amp;ccedil;alışmak istemesi bir yana, &amp;uuml;r&amp;uuml;n&amp;uuml;n dağıtılacağı sunucuların &lt;strong&gt;Provider&lt;/strong&gt; kısıtları olabilir. Buna dikkat ederek bir geliştirme yapmak faydalı olabilir. Her ne kadar bu tip bir &lt;strong&gt;Container&lt;/strong&gt; yazmak zor g&amp;ouml;r&amp;uuml;nsede &lt;strong&gt;IoC&lt;/strong&gt; ara&amp;ccedil;larına bir bakılabilir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Exception&lt;/strong&gt; &lt;strong&gt;Handling&lt;/strong&gt; mekanizması konulamalıdır. Testler de &lt;strong&gt;Provider'&lt;/strong&gt; ın nadiren de olsa &lt;strong&gt;exception&lt;/strong&gt; verdiği durumlar ile karşılaştığımı ifade edebilirim. Bu genellikle &lt;strong&gt;Provider'&lt;/strong&gt; ın kullandığı dll' den kaynaklansa da ele alınması ve &lt;strong&gt;object&lt;/strong&gt; &lt;strong&gt;user&lt;/strong&gt; tarafna uygun bir bilgilendirme yapılması gerekmektedir. Aslında &amp;ouml;devlere başlanabilecek en basit madde sanıyorum ki budur.&lt;/li&gt;
&lt;/ul&gt;
&lt;h1&gt;Sonu&amp;ccedil;&lt;/h1&gt;
&lt;p&gt;Sonu&amp;ccedil; olarak bir Excel i&amp;ccedil;eriğini sisteme almanın birden fazla yolu olduğunu ifade edebiliriz. Ancak bunu etkileyen bazı fakt&amp;ouml;rler olduğunu da bilmeliyiz. En &amp;ouml;nemlisi de i&amp;ccedil;eriğin alınacağı ortama ait sistemsel parametrelerdir. &amp;Ccedil;ok doğal olarak bu tip bir senaryoda SSIS paketlerinin kullanılmasını da d&amp;uuml;ş&amp;uuml;nebilirsiniz. Hatta daha &amp;ouml;nceden &amp;ccedil;alıştığım bir finans kurumunda tam da bu işler i&amp;ccedil;in &lt;strong&gt;SSIS&lt;em&gt;(SQL Server Integration Services)&lt;/em&gt;&lt;/strong&gt; paketleri hazırlamakta olduğumu ifade edebilirim. Ama işte g&amp;uuml;n geliyor &lt;strong&gt;SSIS&lt;/strong&gt; paketi yazacak ortam veya &amp;uuml;r&amp;uuml;n bulamayabiliyorsunuz. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2014-03-18 19:13:00</pubDate>
  <slug>Excel-Icerigini-DataSet-Olarak-Sisteme-Katmak</slug>
  <tags />
  <categories>
    <category>C#</category>
  </categories>
</post>