<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>C# Temelleri - Olayları(Events) Kavramak</title>
  <description>Olaylar (Events), görsel uygulamalar ile uğraşan her geliştirici tarafından bilinçli veya bilinçsiz bir şekilde kullanılmaktadır. Nesne yönelimli programlama ortamında olayları tanımlamak için klasik olarak verilen bir örnek vardır.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Olaylar (Events), g&amp;ouml;rsel uygulamalar ile uğraşan her geliştirici tarafından bilin&amp;ccedil;li veya bilin&amp;ccedil;siz bir şekilde kullanılmaktadır. Nesne y&amp;ouml;nelimli programlama ortamında olayları tanımlamak i&amp;ccedil;in klasik olarak verilen bir &amp;ouml;rnek vardır. Hepinizin bir sonraki c&amp;uuml;mlede ne diyeceğimi bildiğinizden eminim. S&amp;ouml;z konusu &amp;ouml;rnekte g&amp;ouml;rsel ortamda yer alan bir d&amp;uuml;ğme kontrol&amp;uuml; (&amp;ccedil;oğunlukla Button sınıfına ait bir nesne &amp;ouml;rneği) ve bu d&amp;uuml;ğmeye kullanıcının mouse ile basması sonucu oluşan Click isimli bir olay mevcuttur.&lt;/p&gt;
&lt;p&gt;Oysaki olayların her zaman i&amp;ccedil;in g&amp;ouml;rsel ortamda olması ve işletim sistemi tarafından algılanacak bir etkileşime karşılık olarak uygulama ortamına fırlatılması şart değildir. Dolayısıyla olayları kavrayabilmenin en g&amp;uuml;zel yolu, geliştirici tarafından yazılan tiplere &amp;ouml;zel olarak nasıl yazılacağını ve kullanılacağını bilmekle m&amp;uuml;mk&amp;uuml;n olabilir. İşte bu makalemizde kendi tiplerimiz i&amp;ccedil;in &amp;ouml;zel olayları nasıl yazabileceğimizi incelemeye başlayacak ve olayları daha derinlemesine kavramaya &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;ncelikli olarak d&amp;uuml;ğme kontrol&amp;uuml; &amp;ouml;rneğinden sıyrılıp farklı vakkalar d&amp;uuml;ş&amp;uuml;nerek ilerlemeye &amp;ccedil;alışalım. &amp;Ouml;rnek olarak stoktaki &amp;uuml;r&amp;uuml;n bilgilerini i&amp;ccedil;eren basit bir sınıf g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. &amp;Uuml;r&amp;uuml;nlerin stoktaki değerlerininde bu tip i&amp;ccedil;erisinde bir &amp;ouml;zellik yardımıyla sarmalanmış(wrap) olduğunu d&amp;uuml;ş&amp;uuml;nebiliriz. Buna g&amp;ouml;re stok miktarının belirli bir değerin altına d&amp;uuml;şmesi sonrasında başka nesne &amp;ouml;rnekleri tarafından ele alınabilecek bir olay tanımlaması yapılabilir. Burada Urun tipi i&amp;ccedil;erisinde tanımlanan ve bu tipe ait nesne &amp;ouml;rneklerinin ele alabileceği bir olay s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;Başka bir &amp;ouml;rnek daha. Herhangibir bir kargo şirketinin ulaştırma filosundaki ara&amp;ccedil;ların programatik ortamda birer nesne ile ifade edilebildiği bir k&amp;uuml;t&amp;uuml;phane(library) olduğunu d&amp;uuml;ş&amp;uuml;nelim. Bu k&amp;uuml;t&amp;uuml;phane i&amp;ccedil;erisindeki fonksiyonelliklerden biriside, ara&amp;ccedil;ların uydu sistemleri yardımıyla d&amp;uuml;zenli olarak izlenmesi ve g&amp;uuml;ncel koordinat, anlık hız gibi bilgilerinin elde edilmesi olarak g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Bu hizmeti sağlayan kodlar ayrı bir k&amp;uuml;t&amp;uuml;phane olacak şekilde geliştirilmiş olarak ticari bir paket halinde sunulabilir. O halde ara&amp;ccedil;ların belirlenen hız limitlerini aşmaları sonrasında oluşacak durumların s&amp;ouml;z konusu k&amp;uuml;t&amp;uuml;phaneyi kullanan uygulamalar tarafından, istenirse ele alınmalarını sağlamak amacıyla olaylar yazılabilir. B&amp;ouml;ylece s&amp;ouml;z konusu program, ara&amp;ccedil; hız limitini aştığı zaman neler yapmak istiyorsa bunları istediği şekilde ele alabilecektir.&lt;/p&gt;
&lt;p&gt;Temel olarak kendi tiplerimiz i&amp;ccedil;in olay tanımlamak aslında &lt;strong&gt;temsilcileri (delegates)&lt;/strong&gt; daha kolay kaps&amp;uuml;llenmiş bir halde sunmak şeklinde de yorumlanabilir. Bir &lt;strong&gt; olayın(event) &lt;/strong&gt;tanımlanabilmesi i&amp;ccedil;in mutlaka bir temsilci tipi ile eşleştirilmesi gerekmektedir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Temsilciler(delegates) &lt;strong&gt;&amp;ccedil;ok kanallı programlamada (multi threading)&lt;/strong&gt;,&lt;strong&gt;asenkron(asynchronous) mimarilerde(Polling, Callback, WaitHandle gibi)&lt;/strong&gt; ve son olarak &lt;strong&gt;olay tabanlı(event based) &lt;/strong&gt;kodlamada kullanılmaktadır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Temsilci dışında dikkat edilmesi gereken bir diğer noktada olayın bir şekilde ortama fırlatılmasını sağlamaktır. D&amp;uuml;ğme &amp;ouml;rneğini burada g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz. Dikkat ederseniz bir d&amp;uuml;ğmeye basıldığında ger&amp;ccedil;ekleştirilmek istenenleri yazmak i&amp;ccedil;in tek yapılan oluşan olay metodunun i&amp;ccedil;eriğini doldurmaktan ibarettir. Sistem arka tarafta s&amp;ouml;z konusu Button nesne &amp;ouml;rneği i&amp;ccedil;in bir olay y&amp;uuml;klemsi yapmaktadır. Peki d&amp;uuml;ğmeye basıldığında s&amp;ouml;z konusu olay metodu nasıl &amp;ccedil;ağırılacaktır?&lt;em&gt; (Burada temsilcinin rol&amp;uuml;n&amp;uuml;n ne kadar &amp;ouml;nemli olduğu ortadadır)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Olayın tetiklenmesi işletim sistemi tarafından ger&amp;ccedil;ekleştirilir. Aslında Button nesne &amp;ouml;rneğinin arka planda yaptıklarından biriside, işletim sistemindeki bu aksiyonu yakalamaktır. Sonu&amp;ccedil; itibariyle kullanıcının s&amp;ouml;z konusu Button nesne &amp;ouml;rneğine y&amp;uuml;kleme yaptığı olay metodu &amp;ccedil;ağırılır. Bu anlatılanlar bize şunu ifade etmelidir. Kendi olaylarımızı tanımlıyorsak, s&amp;ouml;z konusu olayın diğer nesneler tarafından ele alınabilmesini sağlamak i&amp;ccedil;in manuel olarak tetiklemeliyiz. Manuel olarak yapılan bu tetiklemenin sonucunda &amp;ccedil;alışma zamanında ele alınacak olay metodunun işaret edilmesini ise, &lt;strong&gt; temsilciler(delegates)&lt;/strong&gt; yardımıyla sağlamalıyız.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;em&gt;Kendi tiplerimiz i&amp;ccedil;in olay tanımlıyorsak bu olayın &amp;ccedil;alışma zamanında diğer bir nesne tarafından ele alınabilmesi i&amp;ccedil;in bir şekilde tetiklenmesi gerekmektedir.&lt;/em&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Aslında bir olayın tetiklenmesi, bir &lt;strong&gt; istisna(exception)&lt;/strong&gt; nesne &amp;ouml;rneğinin ortama fırlatılmasına&lt;strong&gt;(throw)&lt;/strong&gt; benzetilebilir. Tek fark ortama fırlatılan istisnaların &lt;strong&gt;catch&lt;/strong&gt; blokları ile yakalanabiliyor olmasıdır. Olaylarda durum farklıdır. Ortada bir catch bloğu yoktur. Bunun yerine bir &lt;strong&gt;abone (subscriber) &lt;/strong&gt;vardır. Basit olarak olayın tetiklenmesi sonucu &amp;ccedil;alıştırılacak olay metodunun bulunduğu nesne &amp;ouml;rneğini abone olarak d&amp;uuml;ş&amp;uuml;nebiliriz. Bir başka deyişle olayı yakalayıp değerlendirecek olan nesne, olayın sahibi olan nesnenin ilgili &lt;strong&gt;olayına(event)&lt;/strong&gt; abone olmaktadır. Dolayısıyla olayı tanımlayan ve tetikleyen nesneyi &lt;strong&gt;yayımcı (publisher)&lt;/strong&gt; olarakda g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alabiliriz. Aslında bahsettiğimiz kavramları daha kolay anlayabilmek amacıyla aşağıdaki grafiği incelemekte fayda vardır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk207_1.gif" alt="" width="487" height="451" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Birinci adıma g&amp;ouml;re Program nesnesi Urun tipine ait bir nesne &amp;ouml;rneği oluşturur. Program nesne &amp;ouml;rneğinden kasıt aslında uygulamanın ta kendisi olabilir. &amp;Ouml;rneğin bir konsol uygulamasındaki Program sınıfı veya windows uygulamasındaki bir Form nesne &amp;ouml;rneği olabilir. Hangisi olursa olsun değişmez ger&amp;ccedil;ek olaya abone olmak isteyen bir nesnenin olmasıdır. Olay tanımlamamızın Urun tipi i&amp;ccedil;erisinde olduğu varsayılırsa, Program nesnesinin ilgili olay metodunu Urun nesnesine abone etmesi gerekmektedir. Bu ikinci adımda sembolize edilmeye &amp;ccedil;alışılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Nesne kullanıcısı (Object User)&lt;/strong&gt;, Program nesnesi i&amp;ccedil;erisinde olay y&amp;uuml;klemesi ile birlikte bir olay metodunuda yazar. B&amp;ouml;ylece Urun nesnesinin &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; adımda yapacağı tetikleme sonucunda Program nesnesi tarafından yazılan olay metodu &amp;ccedil;ağırılabilecektir. Burada s&amp;ouml;z konusu olan abone etme işlemi aslında Urun sınıfına ait &lt;strong&gt;olayın(event) +=&lt;/strong&gt; operat&amp;ouml;r&amp;uuml; yardımıyla Program nesne &amp;ouml;rneği i&amp;ccedil;erisinde y&amp;uuml;klenmesidir. Olaylar tanımlanırken hep bir temsilci(delegate) tipi yardımıyla oluşturulurlar. Dolayısıyla Program sınıfı i&amp;ccedil;erisinde Urun nesnesi i&amp;ccedil;in ilgili olay += operat&amp;ouml;r ile y&amp;uuml;klendiğinde, &lt;strong&gt;temsilciye(delegate) &lt;/strong&gt;parametre olarak verilen metod referansı Urun nesnesine bildirilir. B&amp;ouml;ylece Urun nesne &amp;ouml;rneği i&amp;ccedil;erisinde ilgili olay tetiklendiğinde hangi metodun &amp;ccedil;ağırılacağı bilinmektedir.&lt;/p&gt;
&lt;p&gt;Bu kadar teorik bilgiyle aslında, olayların ger&amp;ccedil;ek anlamda sadece button ve click kelimelerinden ibaret olmadığını g&amp;ouml;stermeye &amp;ccedil;alıştık. Artık birazda pratik yaparak bahsedilenleri &amp;ouml;rneklemekte fayda olacağı kanısındayım. Bu ama&amp;ccedil;la basit bir console uygulamasını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alacağız. Konsol uygulamamız i&amp;ccedil;erisinde yer alan Program sınıfımız &lt;strong&gt;abonemiz(subscriber)&lt;/strong&gt; olacak. Urun sınıfı i&amp;ccedil;erisinde tanımlayacağımız olay(Event), stoktaki &amp;uuml;r&amp;uuml;n sayısı 10 değerinin altına d&amp;uuml;şt&amp;uuml;ğ&amp;uuml;nde tetiklenecek şekilde tasarlanacaktır. Bir olay tanımlanırken mutlaka bir temsilcinin olması gerektiğinden bahsetmiştik. Dolayısıyla birde &lt;strong&gt;temsilci (delegate)&lt;/strong&gt; tipi geliştirmemiz gerekecektir. S&amp;ouml;z konusu temsilci tipini ve Urun sınıfını aşağıdaki gibi tasarlayabiliriz. &lt;em&gt;(&amp;Ouml;rneklerimizde sadece olay kavramına yoğunlaşmak istediğimizden, yapılması gereken pek &amp;ccedil;ok kontrol ortadan kaldırılmıştır. &amp;Ouml;rneğin &amp;uuml;r&amp;uuml;n adının boş ge&amp;ccedil;ilmesini, StokMiktari veya BirimFiyat &amp;ouml;zelliklerine sıfırın altında değer atanmasını engellemek gibi. Daha pek &amp;ccedil;ok kontrol ve fonksiyonellik d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir elbette. Siz kendi uygulamalarınızda bu noktaları sakın g&amp;ouml;zden ka&amp;ccedil;ırmayın ve mutlaka uygulayın.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk207_2.gif" alt="" width="332" height="409" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace Olaylar
{
    delegate void StokAzaldiEventHandler();

    class Urun
    {
        private int id;
        private string ad;
        private double birimFiyat;
        private int stokMiktari;

        public event StokAzaldiEventHandler StokAzaldi;
    
        public int StokMiktari
        {
            get { return stokMiktari; }
            set {
                    stokMiktari = value; 
                    if (value &amp;lt; 10
                        &amp;amp;&amp;amp; StokAzaldi != null)
                            StokAzaldi(); 
                }
        }

        public double BirimFiyat
        {
            get { return birimFiyat; }
            set { birimFiyat = value; }
        }

        public string Ad
        {
            get { return ad; }
            set { ad = value; }
        }

        public int Id
        {
            get { return id; }
            set { id = value; }
        }

        public Urun(int idsi, string adi, double fiyati, int stokSayisi)
        {
            Id = idsi;
            Ad = adi;
            BirimFiyat = fiyati;
            StokMiktari = stokSayisi;
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi kodlarımızda neler yaptığımıza kısaca bakalım. İlk olarak &lt;strong&gt;StokAzaldiHandler&lt;/strong&gt; tipinden bir &lt;strong&gt; temsilci (delegate)&lt;/strong&gt; tanımlıyoruz. Hatırlayacağınız gibi zaman zaman .Net i&amp;ccedil;erisinde var olan isimlendirme standartlarından bahsediyoruz. Niteliklere ait sınıf adlarının &lt;strong&gt;Attribute&lt;/strong&gt; kelimesi ile, &lt;strong&gt; istisna(exception)&lt;/strong&gt; tiplerinin &lt;strong&gt;Exception&lt;/strong&gt; kelimesi ile bittiklerini biliyoruz. &amp;Ouml;zellikle olaylar ile ilişkili temsilcilerinde &amp;ccedil;oğunlukla &lt;strong&gt;EventHandler&lt;/strong&gt; kelimesi ile bittiğini g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bu nedenle olay ile ilişkili temsilcimizi &lt;strong&gt;StokAzaldiEventHandler&lt;/strong&gt; olarak isimlendirdik. StokAzaldiEventHandler isimli temsilci tipi, geriye değer d&amp;ouml;nd&amp;uuml;rmeyen ve parametre almayan metodları işaret edebilecek şekilde tasarlanmıştır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Temsilcilerin (delegate) &amp;ccedil;alışma zamanında metodların başlangı&amp;ccedil; adreslerini işaret ettiklerini ve işaret edebileceği metodun parametrik yapısı ile geri d&amp;ouml;n&amp;uuml;ş tipini belirtiklerini hatırlayalım.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Gelelim Urun sınıfımıza. Urun sınıf i&amp;ccedil;erisinde UrunAzaldi isimli bir olay(event) tanımlanmıştır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public event StokAzaldiEventHandler StokAzaldi;&lt;/pre&gt;
&lt;p&gt;Dikkat edilecek olursa &lt;strong&gt;event&lt;/strong&gt; anahtar kelimesinden sonra &lt;strong&gt;StokAzaldiEventHandler&lt;/strong&gt; isimli temsilci tipi gelmektedir. Son olarakta olayın adı yer alır. B&amp;ouml;ylece s&amp;ouml;z konusu olay i&amp;ccedil;in &amp;ccedil;alıştırılabilecek olay metodlarının yapısını StokAzaldiEventHandler isimli temsilcinin s&amp;ouml;yleyeceğide belirtilmiş olur. Geriye kalan tek p&amp;uuml;r&amp;uuml;z, ilgili olay metodun nasıl ve nerede tetikleneceğidir. &amp;Ouml;rnek olması a&amp;ccedil;ısından &lt;strong&gt;StokMiktari&lt;/strong&gt; isimli &amp;ouml;zelliğin &lt;strong&gt;set&lt;/strong&gt; bloğunda aşağıdaki kod par&amp;ccedil;ası kullanılmıştır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;set {
    stokMiktari = value; 
    if (value &amp;lt; 10
        &amp;amp;&amp;amp; StokAzaldi != null)
           StokAzaldi(); 
    }&lt;/pre&gt;
&lt;p&gt;Burada stok miktarı eğer 10 rakamının altındaysa ve StokAzaldi olayı &lt;strong&gt;null&lt;/strong&gt; değere eşit değilse StokAzaldi() isimli bir metod &amp;ccedil;ağrısı yapılmaktadır. StokAzaldi olayının &lt;strong&gt;null&lt;/strong&gt; olmaması bir şekilde &lt;strong&gt;+=&lt;/strong&gt; operat&amp;ouml;r&amp;uuml; ile y&amp;uuml;klendiği anlamına gelmektedir. Yani başka bir nesne bu olaya kendisini &lt;strong&gt; abone(subscribe to)&lt;/strong&gt; etmiştir. Bu durumda s&amp;ouml;z konusu olay metodunun buradaki set bloğu i&amp;ccedil;erisinden &amp;ccedil;ağırılması gerekir. Bu iş i&amp;ccedil;in yine olayı sanki bir metodmuş gibi &amp;ccedil;ağırmak yeterli olacaktır. Nitekim bu &amp;ccedil;ağrı &lt;strong&gt;+=&lt;/strong&gt; operat&amp;ouml;r&amp;uuml; ile bağlanan olay metodunun y&amp;uuml;r&amp;uuml;t&amp;uuml;lmeye başlanması anlamınada gelmektedir. Buraya kadar += operat&amp;ouml;r&amp;uuml; ile olayın y&amp;uuml;klenmesi gerektiğinden bahsedip durduk. Peki bu nasıl ger&amp;ccedil;ekleştiriliyor? Cevap aşağıdaki kod par&amp;ccedil;asında olduğu gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Text;
using System.Threading;

namespace Olaylar
{ 
    class Program
    {
        static void Main(string[] args)
        {
            Urun ciklet = new Urun(10001, "Tipitipitip", 1.20, 35);
            ciklet.StokAzaldi += new StokAzaldiEventHandler(ciklet_StokAzaldi);

            for (int i = 0; i &amp;lt;5; i++)
            {
                ciklet.StokMiktari -= 7;
                Thread.Sleep(600);
                Console.WriteLine(ciklet.Ad + " i&amp;ccedil;in stok miktarı " + ciklet.StokMiktari.ToString());
            }
        }

        static void ciklet_StokAzaldi()
        {
            Console.WriteLine("Stok miktarı 10 değerinin altında...Alarrrmmm!");
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Main metodu i&amp;ccedil;erisinde Urun sınıfına ait bir nesne &amp;ouml;rneklendikten sonra &lt;strong&gt;StokAzaldi&lt;/strong&gt; isimli olay, &lt;strong&gt;+=&lt;/strong&gt; operat&amp;ouml;r&amp;uuml; ile y&amp;uuml;klenmektedir. Burada Visual Studio kullanılıyorsa += işaretinden sonra iki kez &lt;strong&gt;tab&lt;/strong&gt; tuşuna basmak yeterli olacaktır. Bu durumda Visual Studio otomatik olarak bir olay metodu oluşturacaktır. &amp;Ouml;rneğimizde bu olay metodu &lt;strong&gt;ciklet_StokAzaldi&lt;/strong&gt; adıyla anılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk207_4.gif" alt="" width="516" height="42" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk207_5.gif" alt="" width="584" height="38" border="0" /&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Aslında bir olay tanımlandığında, bu olayın sahibi olan tip i&amp;ccedil;in &lt;strong&gt;CIL (Common Intermediate Language)&lt;/strong&gt; kısmınada add_OlayAdı ve remove_OlayAdı isimli iki metod eklenir. Bu metodlar i&amp;ccedil;erisinde olay y&amp;uuml;klemesi yapıldığında veya &amp;ccedil;ıkartıldığında, gereken temsilci bağlama ve ayırma işlemleri yapılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk207_10.gif" alt="" width="456" height="424" border="0" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Program kodu i&amp;ccedil;erisinde test amacıyla StokMiktari &amp;ouml;zelliğinin değeri 7şer 7şer azaltılmaktadır. Sonu&amp;ccedil;ta ekran &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk207_3.gif" alt="" width="436" height="191" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edilecek olursa StokMiktari &amp;ouml;zelliğinin 10 değerinin altında olduğu her durum i&amp;ccedil;in otomatik olarak olay metodu tetiklenmiş ve i&amp;ccedil;erisinde yazılan kod par&amp;ccedil;aları &amp;ccedil;alıştırılmıştır.&lt;/p&gt;
&lt;p&gt;Yazılan olay her ne kadar faydalı g&amp;ouml;r&amp;uuml;nsede bazı eksiklikleri olduğu ortadadır. &amp;Ouml;rneğin olay metodu i&amp;ccedil;erisinde bir de stoğun o anki miktarının ne olduğunu &amp;ouml;ğrenebilsek fena olmaz mıydı acaba? Yada birden fazla Urun nesne &amp;ouml;rneğini aynı olay metoduna bağlayacaksak (ki bu m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r), olay metodu i&amp;ccedil;erisinde hangi Urun nesne &amp;ouml;rneğinin ilgili olayın sahibi olduğunu tespit edebilsek fena olmaz mıydı? İşte bu iki gereksinime benzer ihtiya&amp;ccedil;lar, .Net i&amp;ccedil;erisinde var olan t&amp;uuml;m olaylar i&amp;ccedil;inde ge&amp;ccedil;erlidir.&lt;/p&gt;
&lt;p&gt;O nedenle &amp;ouml;nceden tanımlanmış olan t&amp;uuml;m olaylar aslında standart olarak iki parametre almaktadır. İlk parametre olayı tetikleyen nesne &amp;ouml;rneğine ait referansın yakalanması i&amp;ccedil;in kullanılırken, ikinci parametre olay metodu i&amp;ccedil;erisine bilgi aktarmak maksadıyla ele alınır. Bu standart bir olay temsilcisinin işaret edeceği metodun parametrik yapısıdır. Tahmin edileceği gibi ilk parametre object tipindendir. İkinci parametre ise genellikle &lt;strong&gt; EventArgs&lt;/strong&gt; gibi kelimeler ile biten &amp;ouml;zel bir sınıftır. Kendi &amp;ouml;rneğimizi g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda &amp;ouml;ncelikli olarak, olay metoduna &amp;ouml;zel bilgilerin aktarılmasını sağlayacak şekilde bir tipin geliştirilmesi gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk207_6.gif" alt="" width="264" height="376" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class StokAzaldiEventArgs:EventArgs
{
    private int guncelStokMiktari;

    public int GuncelStokMiktari
    {
        get { return guncelStokMiktari; }
        set { guncelStokMiktari = value; }
    }
    public StokAzaldiEventArgs(int gStk)
    {
        GuncelStokMiktari = gStk;
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;StokAzaldiEventArgs&lt;/strong&gt; isimli tipin tek yaptığı, g&amp;uuml;ncel stok miktarını ilgili olay metodu i&amp;ccedil;erisine taşımaktır. Bu tip asıl StokAzaldi olayı i&amp;ccedil;in anlamlıdır. Olay arg&amp;uuml;manlarını taşıyacak kendi tiplerimizi geliştirdiğimizde bunların &lt;strong&gt; EventArgs&lt;/strong&gt; tipinden t&amp;uuml;retilmesi bir zorunluluk değildir ancak bir gelenektir. Ama&amp;ccedil; aynen isimlendirme kurallarında olduğu gibi kodun standardize edilmesidir. Nitekim .Net i&amp;ccedil;erisindeki t&amp;uuml;m olay arg&amp;uuml;man tipleri, bir şekilde EventArgs sınıfından t&amp;uuml;remektedir. Bu şekilde olay metoduna bilgi taşıyabileceğimiz bir tip tanımladıktan sonra temsilcininde aşağıdaki gibi değiştirilmesi gerekmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;delegate void StokAzaldiEventHandler(object sender,StokAzaldiEventArgs args);&lt;/pre&gt;
&lt;p&gt;Elbette temsilcide yapılan değişikliklerin olayın tetiklendiği yerede adapte edilmesi gerekmektedir. Bu ama&amp;ccedil;la StokMiktari &amp;ouml;zelliğinin set bloğu aşağıdaki gibi değiştirilmelidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public int StokMiktari
{
    get { return stokMiktari; }
    set {
        stokMiktari = value;
        if (value &amp;lt; 10
            &amp;amp;&amp;amp; StokAzaldi != null)
                StokAzaldi(this, new StokAzaldiEventArgs(value)); 
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat edilecek olursa ilk parametreye &lt;strong&gt;this&lt;/strong&gt; anahtar kelimesi getirilmiştir. Hatırlayacağınız gibi ilk parametre i&amp;ccedil;in, olayı tetikleyen nesne referansını taşıdığını belirtmiştik. İşte buradaki &lt;strong&gt;this&lt;/strong&gt; anahtar kelimesi &amp;ccedil;alışma zamanındaki(run-time) nesne referansının alınıp ilgili olay metoduna g&amp;ouml;nderilmesini sağlamaktadır. İkinci parametrede ise &lt;strong&gt; StokAzaldiEventArgs&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneği oluşturulmakta ve g&amp;uuml;ncel stok miktarının değeri &lt;strong&gt;value&lt;/strong&gt; anahtar kelimesi ile yapıcı metoduna g&amp;ouml;nderilmektedir. Tahmin edeceğiniz &amp;uuml;zere nesne &amp;ouml;rneğide, olay metodu i&amp;ccedil;erisinde ele alınabilecektir. Artık program i&amp;ccedil;erisinde kodlarımızıda aşağıdaki gibi d&amp;uuml;zenlememiz gerekmektedir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class Program
{
    static void Main(string[] args)
    {
        Urun ciklet = new Urun(10001, "Tipitipitip", 1.20, 35);
        ciklet.StokAzaldi += new StokAzaldiEventHandler(ciklet_StokAzaldi);

        for (int i = 0; i &amp;lt;5; i++)
        {
            ciklet.StokMiktari -= 7;
            Thread.Sleep(600);
            Console.WriteLine(ciklet.Ad + " i&amp;ccedil;in stok miktarı " + ciklet.StokMiktari.ToString());
        }
    }

    static void ciklet_StokAzaldi(object sender, StokAzaldiEventArgs args)
    {
        Console.WriteLine("G&amp;uuml;ncel stok değeri {0} . Stokta limit altına inilmiştir. Alarrmmmm!",args.GuncelStokMiktari.ToString());
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulamayı bu haliyle &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan sonu&amp;ccedil;ları elde ederiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk207_7.gif" alt="" width="532" height="128" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim olaylar ile ilgili bir başka konuya. Daha &amp;ouml;ncede birden fazla nesne i&amp;ccedil;in aynı olay metodunun ele alınabileceğinden bahsetmiştik. &amp;Ouml;rneğimizi g&amp;ouml;z &amp;ouml;n&amp;uuml;ne aldığımızda, birden fazla Urun nesnesini aynı StokAzaldi olay metoduna y&amp;ouml;nlendirme şansına sahibiz. Bu şekilde bir ihtiya&amp;ccedil; &amp;ouml;zellikle dinamik olarak oluşturulan kontrollerin bir olay metoduna bağlanarak ele alınması gibi durumlarda kullanılmaktadır. Ki b&amp;ouml;ylece bir den fazla olay metodunu d&amp;uuml;ş&amp;uuml;nmek yerine tek bir merkez metoddan kontrol ve y&amp;ouml;netim işlemlerini ger&amp;ccedil;ekleştirebiliriz. &amp;Ouml;rneğimizdeki kod par&amp;ccedil;alarını aşağıdaki gibi değiştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;class Program
{
    static void Main(string[] args)
    {
        Urun ciklet = new Urun(10001, "Tipitipitip", 1.20, 35);
        Urun cikolata = new Urun(10034, "Marsi", 2.5, 25);
        cikolata.StokAzaldi+=new StokAzaldiEventHandler(urun_StokAzaldi);
        ciklet.StokAzaldi += new StokAzaldiEventHandler(urun_StokAzaldi);

        for (int i = 0; i &amp;lt;5; i++)
        {
            ciklet.StokMiktari -= 7;
            cikolata.StokMiktari -= 5;
            Thread.Sleep(600);
            Console.WriteLine(ciklet.Ad + " i&amp;ccedil;in stok miktarı " + ciklet.StokMiktari.ToString());
            Console.WriteLine(cikolata.Ad + " i&amp;ccedil;in stok miktarı " + cikolata.StokMiktari.ToString());
        }
    }

    static void urun_StokAzaldi(object sender, StokAzaldiEventArgs args)
    {
        Urun urn = (Urun)sender;
        Console.WriteLine("{0} i&amp;ccedil;in g&amp;uuml;ncel stok değeri {1} . Stokta limit altına inilmiştir. Alarrmmmm!",urn.Ad,args.GuncelStokMiktari.ToString());
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk207_8.gif" alt="" width="640" height="236" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak ciklet ve cikolata isimli iki ayrı Urun nesnesi &amp;ouml;rneklediğimize ama bunların her ikisi i&amp;ccedil;inde aynı olay metodunu kullandığımıza dikkat edelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;cikolata.StokAzaldi+=new StokAzaldiEventHandler(urun_StokAzaldi);
ciklet.StokAzaldi += new StokAzaldiEventHandler(urun_StokAzaldi);&lt;/pre&gt;
&lt;p&gt;Dikkat edilmesi gereken &amp;ouml;nemli noktalardan biriside olay metodu i&amp;ccedil;erisinde &lt;strong&gt;sender&lt;/strong&gt; isimli parametre değişkeninin nasıl kullanıldığıdır. sender isimli değişken &lt;strong&gt; cast&lt;/strong&gt; işlemine tabi tutularak bir Urun nesne &amp;ouml;rneğine d&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lmekte ve kullanılmaktadır. Burada elbetteki akla şu soru gelebilir. Urun nesne &amp;ouml;rneğine d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi yapıldıktan sonra g&amp;uuml;ncel stok miktarı gibi verilerde elde edebilir bu nedenle &lt;strong&gt;StokAzaldiEventArgs&lt;/strong&gt; gibi tipleri geliştirmeye ihtiyacımız var mıdır?&lt;/p&gt;
&lt;p&gt;Aslında bu bir anlamda doğru olsada bir arg&amp;uuml;man tipinin var olması, olay metodu i&amp;ccedil;erisine ger&amp;ccedil;ektende ne aktarmak istediğimizi belirten bir kodlama yolu ve standardı sağlamaktadır. Diğer taraftan gereksiz cast işlemlerininde &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ilmiş olacaktır. Bunların dışında nesne &amp;ouml;rneği &amp;uuml;zerinden elde edilemeyen ancak arg&amp;uuml;manlar yardımıyla ele alınabilecek bazı verilerin yayıncı nesne&lt;strong&gt;(publisher object)&lt;/strong&gt; i&amp;ccedil;erisinden sadece olay metoduna aktarılmasıda sağlanabilir. Bir gerek&amp;ccedil;e daha vardırki o da biraz sonra generic bir temsilci ile karşımıza &amp;ccedil;ıkacaktır.&lt;/p&gt;
&lt;p&gt;C# 2.0 ile gelen yeniliklerden biriside &lt;strong&gt;isimsiz metodlardır (anonymous methods)&lt;/strong&gt;. Bu kavram &amp;ouml;zellikle temsilcilerin i&amp;ccedil;erisinde rol aldıgı kodlama alanlarında kullanılmaktadır. Dolayısıyla olay metodlarınıda isimsiz olarak tanımlama ve geliştirme şansına sahibiz. Yani yukarıdaki kodlarımızı aşağıdaki gibi geliştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
    Urun ciklet = new Urun(10001, "Tipitipitip", 1.20, 35);
    ciklet.StokAzaldi += delegate(object sender, StokAzaldiEventArgs arg)
                                {
                                    Urun urn = (Urun)sender;
                                    Console.WriteLine("{0} i&amp;ccedil;in g&amp;uuml;ncel stok değeri {1} . Stokta limit altındayız. Alarrmmmm!", urn.Ad, arg.GuncelStokMiktari.ToString());
                                };

    for (int i = 0; i &amp;lt;5; i++)
    {
        ciklet.StokMiktari -= 7;
        Thread.Sleep(600);
        Console.WriteLine(ciklet.Ad + " i&amp;ccedil;in stok miktarı " + ciklet.StokMiktari.ToString());
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk207_9.gif" alt="" width="608" height="124" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Programı &amp;ccedil;alıştırdığımızda yine olay metodunun başarılı bir şekilde işletildiğini g&amp;ouml;rebiliriz. Burada dikkat edilecek olursa &lt;strong&gt;StokAzaldi&lt;/strong&gt; olayı(event) y&amp;uuml;klenirken isimsiz metod&lt;strong&gt;(anonymous method)&lt;/strong&gt; kullanılmıştır. &lt;strong&gt;delegate&lt;/strong&gt; anahtar kelimesi otomatik olarak &lt;strong&gt;StokAzaldiEventHandler&lt;/strong&gt; temsilcisine(delegate) b&amp;uuml;r&amp;uuml;nmektedir. Sonrasında gelen kod bloğu i&amp;ccedil;erisinde ise olay metodunda yapılması gerekenler yer almaktadır. Ortada bir olay metodu adı olmadığına dikkat edelim. Buda zaten neden isimsiz metod denildiğini a&amp;ccedil;ıklamaktadır.&lt;/p&gt;
&lt;p&gt;C# 2.0 ile birlikte gelen &amp;ouml;zelliklerden birisi ve belkide en &amp;ouml;nemliside &lt;strong&gt;generic&lt;/strong&gt; mimaridir. Bildiğiniz gibi generic mimari sayesinde t&amp;uuml;r bağımsız tipler geliştirebilme şansına sahibiz. .Net i&amp;ccedil;erisinde var olan pek &amp;ccedil;ok tipin bu şekilde t&amp;uuml;r bağımsız versiyonları geliştirilmiş ve tip g&amp;uuml;venli ile performans gibi konularda daha g&amp;uuml;&amp;ccedil;l&amp;uuml; tipler ortaya &amp;ccedil;ıkmıştır. Olaylarla ilişkili olaraktan, &lt;strong&gt; EventHandler&lt;/strong&gt; isimli standart temsilci(delegate) tipinin generic bir versiyonu vardır. S&amp;ouml;z konusu temsilcinin prototipi aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[SerializableAttribute] 
public delegate void EventHandler&amp;lt;TEventArgs&amp;gt; (Object sender,TEventArgs e) where TEventArgs : EventArgs&lt;/pre&gt;
&lt;p&gt;Buna g&amp;ouml;re kendi olaylarımız i&amp;ccedil;in ayrıca temsilci yazmaya gerek kalmamaktadır. Dikkat edilecek olursa &lt;strong&gt; TEventArgs&lt;/strong&gt; isimli generic t&amp;uuml;r&amp;uuml;n yazılan &lt;strong&gt;kısıtlama(constraint)&lt;/strong&gt; sayesinde &lt;strong&gt;EventArgs&lt;/strong&gt; tipinden t&amp;uuml;remiş bir tip olması beklenmektedir. Buna g&amp;ouml;re Urun tipi i&amp;ccedil;erisindeki olay tanımlamasını aşağıdaki gibi değiştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public event EventHandler&amp;lt;StokAzaldiEventArgs&amp;gt; StokAzaldi;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;EventHandler&amp;lt;TEventArgs&amp;gt;&lt;/strong&gt; temsilcisi ilk parametre olarak &lt;strong&gt;object&lt;/strong&gt; tipinden bir değişken almaktadır. İkinci parametre ise &lt;strong&gt;EventArgs&lt;/strong&gt; sınıfından t&amp;uuml;remiş bir tiptir. Bizim &amp;ouml;rneğimizde s&amp;ouml;z konusu tip &lt;strong&gt;StokAzaldiEventArgs&lt;/strong&gt; sınıfıdır. (&lt;em&gt;Sanırım kendi olay arg&amp;uuml;man tiplerimizi EventArgs sınıfından t&amp;uuml;retmenin bir faydasını daha g&amp;ouml;rm&amp;uuml;ş oluyoruz.)&lt;/em&gt; Sonu&amp;ccedil; olarak uygulamanın &amp;ccedil;alışması değişmeyecektir. Kazancımız ekstradan temsilciler tasarlanmasına gerek kalmayışıdır. Tabi isimsiz bir metod kullanmıyorsak olayın y&amp;uuml;kleniş şeklinide aşağıdaki gibi değiştirmemiz gerekecektir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;ciklet.StokAzaldi += new EventHandler&amp;lt;StokAzaldiEventArgs&amp;gt;(urun_StokAzaldi);&lt;/pre&gt;
&lt;p&gt;Olaylar ile ilgili olarak bilmemiz gereken bir diğer noktada; &lt;strong&gt;+=&lt;/strong&gt; ile y&amp;uuml;klenen olayların &lt;strong&gt;-=&lt;/strong&gt; ile kaldırılabildiği ve her iki durumunda &lt;strong&gt;add&lt;/strong&gt; ve &lt;strong&gt;remove&lt;/strong&gt; isimli bloklar i&amp;ccedil;erisinde kontrol altına alınabildiğidir. Bu konunun incelemesinide siz değerli okurlarıma bırakıyorum. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalemizde event kavramını daha detaylı bir şekilde incelemeye &amp;ccedil;alıştık ve kendi olaylarımızı nasıl yazabileceğimizi g&amp;ouml;rd&amp;uuml;k. Temel olarak işlediklerimizi aşağıdaki maddeler ile &amp;ouml;zetleyebiliriz.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Olaylar &lt;strong&gt; temsilcilerin(delegates)&lt;/strong&gt; &amp;ouml;zelleştirilmiş bir hali olarak d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&lt;/li&gt;
&lt;li&gt;Bir olay tanımlandığında mutlaka bir temsilci tipi ile eşleştirilir. Nitekim olay meydana geldiğinde &amp;ccedil;ağırılacak metodun, birisi tarafından &lt;strong&gt;&amp;ccedil;alışma zamanında(runtime)&lt;/strong&gt; işaret ediliyor olması gerekir ki bunu temsilciler yapabilir.&lt;/li&gt;
&lt;li&gt;Kendi olaylarımızı geliştirirken isimlendirme standardı a&amp;ccedil;ısından temsilcilerimizi &lt;strong&gt;EventHandler&lt;/strong&gt;, olay arg&amp;uuml;manlarını taşıyacak sınıflarımızı &lt;strong&gt;EventArgs&lt;/strong&gt; kelimeleri ile bitirmekte fayda vardır.&lt;/li&gt;
&lt;li&gt;Olayın tanımlı olduğu nesne tarafından tetiklenmesi sonrasında yakalanabilmesi i&amp;ccedil;in, s&amp;ouml;z konusu nesneyi kullanan diğer nesnenin&lt;strong&gt;(subscriber)&lt;/strong&gt; olaya abone olması gerekmektedir.&lt;/li&gt;
&lt;li&gt;Birden fazla nesne olayını aynı olay metoduna bağlayabiliriz.&lt;/li&gt;
&lt;li&gt;Olay metodlarını işaret edecek temsilciler, ilk parametre olarak olayı meydana getiren nesne referansını taşıyan object bir değişken, ikinci parametre olarakta olay metoduna bilgi taşıyacak bir sınıf &amp;ouml;rneğini alan metodları işaret edecek bi&amp;ccedil;imde tasarlanırlar.&lt;/li&gt;
&lt;li&gt;Olay metodlarını yazmak zorunlu değildir. Bunun yerine &lt;strong&gt;isimsiz metodlarda(anonymous methods)&lt;/strong&gt; kullanılabilir.&lt;/li&gt;
&lt;li&gt;İstenirse kendi olaylarımız i&amp;ccedil;in temsilci yazmak yerine &lt;strong&gt;EventHandler&amp;lt;TEventArgs&amp;gt;&lt;/strong&gt; generic tipi kullanılabilir.&lt;/li&gt;
&lt;li&gt;Olaylara arg&amp;uuml;man taşıyacak tiplerimizi hem kod standardı hemde EventHandler&amp;lt;TEventArgs&amp;gt; desteği i&amp;ccedil;in &lt;strong&gt;EventArgs&lt;/strong&gt; sınıfından t&amp;uuml;retmekte fayda vardır.&lt;/li&gt;
&lt;li&gt;Olayların += operat&amp;ouml;r&amp;uuml; ile y&amp;uuml;klenmesi ve -= operat&amp;ouml;r&amp;uuml; ile kaldırılması durumlarını kontrol altına almak i&amp;ccedil;in &lt;strong&gt;add&lt;/strong&gt; ve &lt;strong&gt;remove&lt;/strong&gt; bloklarından faydalanılabilir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/Olaylar.zip"&gt;&amp;Ouml;rnek Uygulama İ&amp;ccedil;in Tıklayınız.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2007-06-06 09:00:00</pubDate>
  <slug>C#-Temelleri-Olayları(Events)-Kavramak-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#-20</tag>
    <tag>events</tag>
    <tag>delegate</tag>
    <tag>event-driven-programming</tag>
    <tag>oop</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>