<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Entity Framework - Many To Many Relations - Link Tablosunda Israrcı Olmak</title>
  <description>Hatırlayacağınız üzere son iki yazımızda Many-To-Many ilişkileri nasıl ele alabileceğimizi incelemiştik. Many-To-Many ilişkilerin Entity Model'e olan yansımasında belkide en önemli nokta, ara bağlantı tablosunun taşınmıyor olmasıydı. Bu genellikle ara bağlantı tablosu üzerinde diğer tablolara ait Primary Key alanlarının bulunduğu durumlar düşünülerek meydana gelen bir sonuçtur. Nitekim ara tablonun Entity tarafına taşınmayışının herhangibir olumsuz maliyeti bulunmamaktadır.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2010%2f1%2fblg141_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bazen bebek adımları ile ilerlememiz gerekir. &amp;Ouml;zellikle yazılım alanında bazı konuları &amp;ouml;ğrenirken işin teorisinden &amp;ouml;nce pratik bir &amp;ouml;rneği adım adım geliştirmek son derece faydalıdır. &lt;strong&gt;Ado.Net Entity Framework &lt;/strong&gt;ile ilişkili inclemelerimize devam edeceğimiz bu yazımızda bebek adımları ile ilerleyeceğiz.&lt;/p&gt;
&lt;p&gt;Hatırlayacağınız &amp;uuml;zere son iki yazımızda &lt;strong&gt;Many-To-Many &lt;/strong&gt;ilişkileri nasıl ele alabileceğimizi incelemiştik. &lt;strong&gt;Many-To-Many&lt;/strong&gt; ilişkilerin &lt;strong&gt;Entity Model'e &lt;/strong&gt;olan yansımasında belkide en &amp;ouml;nemli nokta, ara bağlantı tablosunun taşınmıyor olmasıydı. Bu genellikle ara bağlantı tablosu &amp;uuml;zerinde diğer tablolara ait &lt;strong&gt;Primary Key&lt;/strong&gt; alanlarının bulunduğu durumlar d&amp;uuml;ş&amp;uuml;n&amp;uuml;lerek meydana gelen bir sonu&amp;ccedil;tur. Nitekim ara tablonun &lt;strong&gt;Entity&lt;/strong&gt; tarafına taşınmayışının herhangibir olumsuz maliyeti &lt;span style="text-decoration: underline;"&gt;bulunmamaktadır&lt;/span&gt;. Ancak bazı durumlarda s&amp;ouml;z konusu ara bağlantı tablosunun ilerleyen zamanlarda ek alanlar ile genişlemesi s&amp;ouml;z konusu olabilir. Bu durumda ara bağlantı tablosunun &lt;strong&gt;Entity &lt;/strong&gt;olaraktan &lt;strong&gt;Model Diagram&lt;/strong&gt; i&amp;ccedil;erisinde yer almasının avantajı olacaktır. Nitekim ileride eklenecen kolonlar i&amp;ccedil;in &lt;strong&gt;Entity Model&lt;/strong&gt; tarafında sadece &lt;strong&gt;Conceptual Schema' &lt;/strong&gt;yı g&amp;uuml;ncellemek yeterlidir.&lt;/p&gt;
&lt;p&gt;Dolayısıyla bu yazımızdaki amacımız, varsayılan olarak &lt;strong&gt;Entity Model Diagram&lt;/strong&gt; &amp;uuml;retilirken ortadan kaldırılan ara bağlantı tablosunun manuel olarak oluşturulmasını sağlama olacaktır. Başlangı&amp;ccedil;ta &lt;strong&gt;Visual Studio 2010 Ultimate&amp;nbsp;RC&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde oluşturduğumuz &lt;strong&gt;Console&lt;/strong&gt; uygulaması i&amp;ccedil;erisinde yer alan &lt;strong&gt;Entity Model&lt;/strong&gt; diagramının aşağıdaki gibi olduğunu varsayıyoruz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg141_FirstState.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tahmin edeceğiniz &amp;uuml;zere &lt;strong&gt;Chinook&lt;/strong&gt; veritabanı i&amp;ccedil;erisinde yer alan &lt;strong&gt;Playlist-Track&lt;/strong&gt; ilişkilerini değerlendirmekteyiz. Şekil &amp;uuml;zerinde yer alan &amp;ccedil;arpı işareti mutlaka dikkatinizi &amp;ccedil;ekmiştir. Aslında bu yapacağımız ilk hamle olacak. Aradaki &lt;strong&gt;Association &lt;/strong&gt;nesnesini silmek. Bu durumda &amp;ccedil;ok doğal olarak &lt;strong&gt;Playlist&lt;/strong&gt; ve &lt;strong&gt;Track &lt;/strong&gt;tablolarında yer alan ve birbirlerine olan ge&amp;ccedil;işleri sağlayan &lt;strong&gt;Navigation Property' &lt;/strong&gt;lerin de ortadan kaldırıldığını g&amp;ouml;receğiz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg141_DeleteRelation.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ancak burada dikkat etmemiz gereken bir nokta bulunmaktadır. Silme işlemi sırasında Designer' ın aşağıdaki sorusu ile karşılaşacağız. &lt;strong&gt;PlaylistTrack&lt;/strong&gt; tablosu her ne kadar &lt;strong&gt;Entity&lt;/strong&gt; olarak ifade edilmese de, oluşturacağımız &lt;strong&gt;Entity'&lt;/strong&gt; nin ileride veritabanında karşılık geldiği tablo ile ilişkilendirilmesi sırasında ele alınacaktır. Bu nedenle &lt;strong&gt;No&lt;/strong&gt; se&amp;ccedil;imi yaparaktan silme işlemini icra etmemiz daha doğrudur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg141_Delation2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sıradaki adımımız ise veritabanında yer alan ve &lt;strong&gt;Playlist&lt;/strong&gt; ile &lt;strong&gt;Track &lt;/strong&gt;tabloları arasındaki &lt;strong&gt;Many-To-Many&lt;/strong&gt; ilişkiyi ger&amp;ccedil;ekleştiren tabloya karşılık gelen bir &lt;strong&gt;Entity&lt;/strong&gt; tipinin oluşturulmasıdır. Yani veritabanında yer alan &lt;strong&gt;PlaylistTrack&lt;/strong&gt; isimli tablonun karşılığı olan &lt;strong&gt;Entity &lt;/strong&gt;tipinin&amp;nbsp;&amp;uuml;retilmesi. Bunun i&amp;ccedil;in &lt;strong&gt;Model&lt;/strong&gt; diagramı &amp;uuml;zerinden &lt;strong&gt;Add-&amp;gt;Entity&lt;/strong&gt; se&amp;ccedil;imini yapmamız yeterli olacaktır. Sonrasında ise &lt;strong&gt;Entity&lt;/strong&gt; &amp;ouml;zelliklerini aşağıdaki gibi ayarlamamız gerekecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg141_AddEntity.gif" alt="" /&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Burada dikkat edilmesi gereken noktalardan birisi, &lt;strong&gt;Key Property &lt;/strong&gt;&amp;ouml;zelliğinin kullanılmayışıdır. Nitekim bu alana senaryomuza g&amp;ouml;re gerek yoktur. Ara tablonun karşılığı olan &lt;strong&gt;PlaylistTrack&lt;/strong&gt; &lt;strong&gt;Entity &lt;/strong&gt;tipinin g&amp;ouml;revi, &lt;strong&gt;Playlist&lt;/strong&gt; ve &lt;strong&gt;Track Entity &lt;/strong&gt;tipleri arasındaki&lt;strong&gt; Many-To-Many&lt;/strong&gt; ilişkiyi sağlamak olduğundan, bu &lt;strong&gt;Entity'&lt;/strong&gt; lere ait &lt;strong&gt;Key&lt;/strong&gt; &amp;ouml;zelliklerini barındırması yeterlidir. Buna g&amp;ouml;re yeni oluşturulan &lt;strong&gt;Entity&lt;/strong&gt; i&amp;ccedil;erisinde aşağıdaki şekilde g&amp;ouml;r&amp;uuml;len &lt;strong&gt;Scalar Property'&lt;/strong&gt; lerin eklenmesi gerekir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg141_AddColumnLast.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Yine dikkat edilmesi gereken &amp;ouml;nemli bir nokta vardır. &lt;strong&gt;PlaylistTrack&lt;/strong&gt; &lt;strong&gt;Entity &lt;/strong&gt;tipi&amp;nbsp;i&amp;ccedil;erisinde yer alan &lt;strong&gt;PlaylistId&lt;/strong&gt; ve &lt;strong&gt;TrackId &lt;/strong&gt;isimli alanlarının &lt;strong&gt;Entity Key&lt;/strong&gt; &amp;ouml;zelliklerine &lt;strong&gt;true &lt;/strong&gt;değer atanmıştır. Buna g&amp;ouml;re bu alanların &lt;strong&gt;Playlist&lt;/strong&gt; ve &lt;strong&gt;Track&lt;/strong&gt; tablosundaki karşılıkları ile ilişki kurabilmesi m&amp;uuml;mk&amp;uuml;n olacaktır. Dolayısıyla sıradaki adımımız tablolar arasındaki ilişkileri kurmaktır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Aslında PlaylistId ve TrackId alanlarının oluşturulması şart değildir. PlaylistTrack tablosuna ait bilgileri silmediğimizden Association' ları oluşturduğumuz sırada s&amp;ouml;z konusu alanların otomatik olarak &amp;uuml;retileceğini g&amp;ouml;rebiliriz. Bu tekniğide tercih edebilirsiniz. Şu andaki ilerleyişimize g&amp;ouml;re Association' ların oluşturulması sırasında Add foreign key properties to the... se&amp;ccedil;eneğini kaldırmamız gerekmektedir. Ancak kolonların oluşturulmasını otomatikleştirmek istiyorsak, bu se&amp;ccedil;eneği işaretli bırakmamız gerekmektedir. B&amp;ouml;yle yaptığımız takdirde kolon adlarının pekte istediğimiz gibi olmayacağını, yeniden isimlendirmemiz gerektiğinide belirtmek isterim. Tercih size kalmış. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Şimdi bir d&amp;uuml;ş&amp;uuml;nelim. Bir &lt;strong&gt;Playlist'e&lt;/strong&gt; bağlı birden fazla &lt;strong&gt;Track&lt;/strong&gt; olabilir. Benzer şekilde bir &lt;strong&gt;Track&lt;/strong&gt; birden fazla &lt;strong&gt;Playlist&lt;/strong&gt; i&amp;ccedil;erisinde yer alabilir. Buna g&amp;ouml;re &lt;strong&gt;Playlist&lt;/strong&gt; ve &lt;strong&gt;Track&lt;/strong&gt; varlıkları arasında &lt;strong&gt;Many-To-Many&lt;/strong&gt; ilişki s&amp;ouml;z konusudur. Bunu zaten biliyoruz &lt;img title="Smile" src="/editors/tiny_mce3/plugins/emotions/img/smiley-smile.gif" alt="Smile" border="0" /&gt;&amp;nbsp;Ancak bunun &lt;strong&gt;Entity Model&lt;/strong&gt; diagram tarafında, şu andaki yapıya g&amp;ouml;re ifadesi nasıl olacaktır? Cevap; &lt;strong&gt;Playlist Entity'&lt;/strong&gt; sinden &lt;strong&gt;PlaylistTrack Entity' &lt;/strong&gt;sine ve benzer şekilde&lt;strong&gt; Track Entity'&lt;/strong&gt; sinden yine &lt;strong&gt;PlaylistTrack&lt;/strong&gt; &lt;strong&gt;Entity' &lt;/strong&gt;sine doğru &lt;strong&gt;One-To-Many &lt;/strong&gt;ilişki sağlayarak. Bunun i&amp;ccedil;in diagrama bir &lt;strong&gt;Association&lt;/strong&gt; nesnesi eklenmesi yeterlidir&lt;strong&gt;(Add-&amp;gt;Association).&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Playlist -&amp;gt; PlaylistTrack&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg141_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;End&lt;/strong&gt; &amp;ouml;zelliklerinden sol tarafta yer alanda &lt;strong&gt;Playlist&lt;/strong&gt; bulunmaktadır. &lt;strong&gt;Playlist Entity &lt;/strong&gt;tipi&amp;nbsp;i&amp;ccedil;in &lt;strong&gt;Multiplicity&lt;/strong&gt; &amp;ouml;zelliği &lt;strong&gt;1(One)&lt;/strong&gt; iken, sağ tarafta yer alan &lt;strong&gt;PlaylistTrack&lt;/strong&gt; i&amp;ccedil;in &lt;strong&gt;*(Many)&lt;/strong&gt; dir. Buna g&amp;ouml;re &lt;strong&gt;Playlist Entity&lt;/strong&gt; tipinden&amp;nbsp;&lt;strong&gt;PlaylistTrack Entity&lt;/strong&gt; tipine&amp;nbsp;doğru &lt;strong&gt;One-To-Many&lt;/strong&gt; ilişki kurulmuştur. &amp;Uuml;retilen &lt;strong&gt;Navigation Property'&lt;/strong&gt; lerden &lt;strong&gt;PlaylistTrack&lt;/strong&gt; olarak adlandırılanlar, &amp;ccedil;oğulluk nedeni ile PlaylistTrack&lt;strong&gt;s&lt;/strong&gt; olarak yeniden isimlendirilmiştir. Bu işlemin sonrasında diagramın yeni hali aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg141_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Track -&amp;gt; PlaylistTrack&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg141_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu kez&lt;strong&gt; Track Entity &lt;/strong&gt;tipi&amp;nbsp;&amp;uuml;zerinden az &amp;ouml;nceki gibi &lt;strong&gt;PlaylistTrack Entity &lt;/strong&gt;tipine&amp;nbsp;doğru &lt;strong&gt;One-To-Many&lt;/strong&gt; ilişki kurulmuştur. Sonu&amp;ccedil; olarak diagramın yeni hali aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg141_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Sıradaki adımda oluşturulan yeni &lt;strong&gt;PlaylistTrack Entitiy &lt;/strong&gt;tipinin, veritabanında yer alan &lt;strong&gt;Tablo&lt;/strong&gt; karşılığı ile eşleştirilmesi gerekir.&amp;nbsp;Bu sebepten &lt;strong&gt;PlaylistTrack&lt;/strong&gt; &lt;strong&gt;Entity &lt;/strong&gt;tipinin&amp;nbsp;&lt;strong&gt;Mapping Details&lt;/strong&gt; &amp;ouml;zelliklerinden aşağıdaki gibi gerekli eşleştirmenin yapılması şarttır. Hatırlayacağınız &amp;uuml;zere ilk adımda &lt;strong&gt;Association&lt;/strong&gt; nesnesini silerken tablonun kaldırılmamasını belirtmiştik. Bu sayede &lt;strong&gt;Table&lt;/strong&gt; eşleştirmesini kolayca ger&amp;ccedil;ekleştirdik.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg141_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ancak işlemlerimiz bir t&amp;uuml;rl&amp;uuml; bitmek bilmemektedir. Sabredin, &amp;ccedil;ok az kaldı. Takip eden adımda &lt;strong&gt;Referentail Constraint'&lt;/strong&gt; lerin tanımlanması gerekmektedir. Normal şartlarda eğer Association' lar oluşturulurken &lt;strong&gt;Add foreign key properties to the...&lt;/strong&gt;&amp;nbsp; işaretli olsaydı bunlarda ilgili alanlar ile birlikte otomatik oluşturulacaklardı.&amp;nbsp;Bu nedenle izleyen şekillerde g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere ilgili eklemelerin yapılması gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg141_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;ve&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg141_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Buraya kadar yaptıklarımızı&amp;nbsp;&amp;ouml;zetleyecek olursak aşağıdaki adımları ger&amp;ccedil;ekleştirdiğimizi ifade edebiliriz.&lt;/p&gt;
&lt;p&gt;1- &lt;strong&gt;Entity'&lt;/strong&gt; ler arasındaki &lt;strong&gt;Many-To-Many&lt;/strong&gt; tipinden &lt;strong&gt;Relation &lt;/strong&gt;silinir.&lt;/p&gt;
&lt;p&gt;2- Veritabanında yer alan ama&lt;strong&gt; Entity Model&lt;/strong&gt; tarafına aktarılmayan ara tablonun karşılığı olan tipin &amp;uuml;retilmesi sağlanır.&lt;/p&gt;
&lt;p&gt;3- Eklenen &lt;strong&gt;Entity&lt;/strong&gt; tablosuna &lt;strong&gt;Entity Key&lt;/strong&gt; &amp;ouml;zellikleri &lt;strong&gt;true&lt;/strong&gt; olan ve diğer &lt;strong&gt;Entity'&lt;/strong&gt; ler &amp;uuml;zerinde karşılık d&amp;uuml;şen&amp;nbsp;alanlar ile&amp;nbsp;aynı tipten olan&lt;em&gt;(&amp;Ouml;rneğimizde hepsi Int32)&lt;/em&gt;&amp;nbsp;&lt;strong&gt;Scalar Property&lt;/strong&gt;' ler ilave edilir.&lt;/p&gt;
&lt;p&gt;4- &lt;strong&gt;Entity &lt;/strong&gt;tipleri&amp;nbsp;arasındaki &lt;strong&gt;One-To-Many ilişkiler(Association)&lt;/strong&gt; tesis edilir.&lt;/p&gt;
&lt;p&gt;5- Eklenen &lt;strong&gt;Entity&lt;/strong&gt; nesnesi, veritabanındaki tablo ile ilişkilendirilir&lt;strong&gt;&lt;em&gt;(Mapping)&lt;/em&gt;&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;6- &lt;strong&gt;Association'&lt;/strong&gt; lar ile ilişkili olaraktan gerekli &lt;strong&gt;Referencial Constraints'&lt;/strong&gt; ler tanınmlanır.&lt;/p&gt;
&lt;p&gt;Artık konuyu basit bir &amp;ouml;rnek sonlandırabiliriz. Bu ama&amp;ccedil;la aşağıdaki program kodunu yazdığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace RelationEntityCreation
{
    class Program
    {
        static void Main(string[] args)
        {
            using (ChinookEntities entities = new ChinookEntities())
            {
                var result = (from p in entities.Playlists.Include("PlaylistTracks.Track")
                              where p.PlaylistId == 3
                              select p).First();


                foreach (var r in result.PlaylistTracks)
                {
                    Console.WriteLine(r.Track.Name);
                }
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnek kod par&amp;ccedil;asında &lt;strong&gt;PlaylistId&lt;/strong&gt; değeri &lt;strong&gt;3 &lt;/strong&gt;olan satıra&amp;nbsp;bağlı olan &lt;strong&gt;Track' &lt;/strong&gt;lerin &amp;ccedil;ekilmesi sağlanmaktadır. &lt;strong&gt;Include&lt;/strong&gt; metodu i&amp;ccedil;erisinde belirtilen tanımlama &amp;ouml;nemlidir. Burada &lt;strong&gt;PlaylistTracks&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;Track Entity' &lt;/strong&gt;sine ulaşılmaktadır. Bu sayede Playlist' e bağlı Track' lerinde y&amp;uuml;klenmesi sağlanmış olur.&amp;nbsp;Uygulama kodunun &amp;ccedil;alışmasının sonucu aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f1%2fblg141_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabi bu kodun &amp;ccedil;alışması sonrasında SQL tarafında olduk&amp;ccedil;a yoğun bir sorgunun &amp;uuml;retilmesi s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;pre class="brush:sql;auto-links:false;toolbar:false" contenteditable="false"&gt;SELECT 
[Project1].[PlaylistId] AS [PlaylistId], 
[Project1].[Name] AS [Name], 
[Project1].[C1] AS [C1], 
[Project1].[PlaylistId1] AS [PlaylistId1], 
[Project1].[TrackId] AS [TrackId], 
[Project1].[TrackId1] AS [TrackId1], 
[Project1].[Name1] AS [Name1], 
[Project1].[AlbumId] AS [AlbumId], 
[Project1].[MediaTypeId] AS [MediaTypeId], 
[Project1].[GenreId] AS [GenreId], 
[Project1].[Composer] AS [Composer], 
[Project1].[Milliseconds] AS [Milliseconds], 
[Project1].[Bytes] AS [Bytes], 
[Project1].[UnitPrice] AS [UnitPrice]
FROM ( SELECT 
 [Limit1].[PlaylistId] AS [PlaylistId], 
 [Limit1].[Name] AS [Name], 
 [Join1].[PlaylistId] AS [PlaylistId1], 
 [Join1].[TrackId1] AS [TrackId], 
 [Join1].[TrackId2] AS [TrackId1], 
 [Join1].[Name] AS [Name1], 
 [Join1].[AlbumId] AS [AlbumId], 
 [Join1].[MediaTypeId] AS [MediaTypeId], 
 [Join1].[GenreId] AS [GenreId], 
 [Join1].[Composer] AS [Composer], 
 [Join1].[Milliseconds] AS [Milliseconds], 
 [Join1].[Bytes] AS [Bytes], 
 [Join1].[UnitPrice] AS [UnitPrice], 
 CASE WHEN ([Join1].[PlaylistId] IS NULL) THEN CAST(NULL AS int) ELSE 1 END AS [C1]
 FROM   (SELECT TOP (1) [Extent1].[PlaylistId] AS [PlaylistId], [Extent1].[Name] AS [Name]
  FROM [dbo].[Playlist] AS [Extent1]
  WHERE 3 = [Extent1].[PlaylistId] ) AS [Limit1]
 LEFT OUTER JOIN  (SELECT [Extent2].[PlaylistId] AS [PlaylistId], [Extent2].[TrackId] AS [TrackId1], [Extent3].[TrackId] AS [TrackId2], [Extent3].[Name] AS [Name], [Extent3].[AlbumId] AS [AlbumId], [Extent3].[MediaTypeId] AS [MediaTypeId], [Extent3].[GenreId] AS [GenreId], [Extent3].[Composer] AS [Composer], [Extent3].[Milliseconds] AS [Milliseconds], [Extent3].[Bytes] AS [Bytes], [Extent3].[UnitPrice] AS [UnitPrice]
  FROM  [dbo].[PlaylistTrack] AS [Extent2]
  INNER JOIN [dbo].[Track] AS [Extent3] ON [Extent2].[TrackId] = [Extent3].[TrackId] ) AS [Join1] ON [Limit1].[PlaylistId] = [Join1].[PlaylistId]
)  AS [Project1]
ORDER BY [Project1].[PlaylistId] ASC, [Project1].[C1] ASC&lt;/pre&gt;
&lt;p&gt;Buuuwvvvvv!!!&amp;nbsp;&amp;nbsp;&lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt;&amp;nbsp;A&amp;ccedil;ık&amp;ccedil;ası ben bu tip bir tablonun eğer maliyet kaybı yoksa ısrarla eklenmesinden yana değilim. Yani Ado.Net Entity Framework gibi d&amp;uuml;ş&amp;uuml;n&amp;uuml;yorum.&amp;nbsp;Fakat yazımızın başında da belirttiğimiz &amp;uuml;zere ara tablonun,&amp;nbsp;&lt;strong&gt;One-To-Many &lt;/strong&gt;ilişkiler i&amp;ccedil;in gerekli olanlar dışında ek alanlar da i&amp;ccedil;erebileceği durumlar s&amp;ouml;z konusu olabilir. Bu alanların zaman i&amp;ccedil;erisinde tabloya eklenmesi ve &lt;strong&gt;Entity&lt;/strong&gt; tarafına da taşınması gerektiği hallerde, &lt;strong&gt;Entity Model &lt;/strong&gt;&amp;uuml;zerinde s&amp;ouml;z konusu ara tablonun karşılığının olması, sadece&lt;strong&gt; Conceptual Model&lt;/strong&gt; &amp;uuml;zerinde m&amp;uuml;dahaleler yaparak işi kurtarmamızı sağlayabilir. Teorik olarak.&amp;nbsp;Yine de anlattıklarımızın&amp;nbsp;&lt;strong&gt;RC s&amp;uuml;r&amp;uuml;m&amp;uuml;&lt;/strong&gt;&amp;nbsp;&amp;uuml;zerinde yazıldığını belirtmek isterim.&amp;nbsp;Yani ilerleyen s&amp;uuml;r&amp;uuml;mde farklılıklar s&amp;ouml;z konusu olabilir. &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&amp;nbsp;B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f2%2fRelationEntityCreation_RC.rar"&gt;RelationEntityCreation_RC.rar (52,15 kb)&lt;/a&gt;&lt;strong&gt;&amp;nbsp;[&amp;Ouml;rnek Visual Studio 2010 Ultimate RC s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde geliştirilmiş ve test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-03-23 22:35:00</pubDate>
  <slug>Entity-Framework-Many-To-Many-Relations-Link-Tablosunda-Israrci-Olmak</slug>
  <tags>
    <tag>adonet-entity-framework</tag>
  </tags>
  <categories>
    <category>Entity Framework</category>
  </categories>
</post>