<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Connection (Bağlantı) Kavramı ve OleDbConnection Sınıfı</title>
  <description>Bu makalemizde, ADO.NET mimarisinde temel yapı taşı olan Connection (Bağlantı) kavramına kısaca değinecek ve OleDbConnection sınıfını incelemeye çalışacağız. ADO.NET mimarisinde, pek çok sınıfın veri kaynakları ile olan iletişiminde Connection (Bağlantı) nesnelerini kullanırız. Örneğin, bir veri kayağındaki tablolara ait verileri, DataSet sınıfından bir nesne örneğine taşımak istediğimizi düşünelim. Bu dataSet nesnesini dolduracak olan DataAdapter sınıfına, sahip olduğu sql sorgusunun veya komutunun işleyeceği bir hattı belirtmemiz gerekir. İşte burada devreye Connection (Bağlantı) nesnelerimiz girer. Yada bir Command sınıfı nesnesi yardımıyla veritabanı üzerindeki bir saklı yordamı (stored procedure) çalıştırmak istediğimizi düşünelim. Bu durumda komutun çalıştırılabileceği bir hattı veri kaynağımız ile Command nesnesi arasında sağlamamız gerekir. İşte Connection (Bağlantı) nesnemizi kullanmamız için bir sebep daha.</description>
  <content>&lt;p&gt;Değerli Okurlarım, Merhabalar.&lt;/p&gt;
&lt;p&gt;Bu makalemizde, ADO.NET mimarisinde temel yapı taşı olan Connection (Bağlantı) kavramına kısaca değinecek ve OleDbConnection sınıfını incelemeye &amp;ccedil;alışacağız. ADO.NET mimarisinde, pek &amp;ccedil;ok sınıfın veri kaynakları ile olan iletişiminde Connection (Bağlantı) nesnelerini kullanırız. &amp;Ouml;rneğin, bir veri kayağındaki tablolara ait verileri, DataSet sınıfından bir nesne &amp;ouml;rneğine taşımak istediğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu dataSet nesnesini dolduracak olan DataAdapter sınıfına, sahip olduğu sql sorgusunun veya komutunun işleyeceği bir hattı belirtmemiz gerekir. İşte burada devreye Connection (Bağlantı) nesnelerimiz girer. Yada bir Command sınıfı nesnesi yardımıyla veritabanı &amp;uuml;zerindeki bir saklı yordamı (stored procedure) &amp;ccedil;alıştırmak istediğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu durumda komutun &amp;ccedil;alıştırılabileceği bir hattı veri kaynağımız ile Command nesnesi arasında sağlamamız gerekir. İşte Connection (Bağlantı) nesnemizi kullanmamız i&amp;ccedil;in bir sebep daha.&lt;/p&gt;
&lt;p&gt;Verdiğimiz bu basit &amp;ouml;rneklerdende anlaşıldığı gibi, Connection(bağlantı) sınıfları, veri kaynağına bir hat &amp;ccedil;ekerek, ADO.NET nesnelerinin bu hat yardımıyla işlemlerini ger&amp;ccedil;ekleştirmelerine imkan sağlarlar. Ancak sahip olunan veri kaynağının t&amp;uuml;r&amp;uuml;ne g&amp;ouml;re, ADO.NET i&amp;ccedil;erisine değişik Connection sınıfları eklenmiştir. DotNet'in ilk s&amp;uuml;r&amp;uuml;m&amp;uuml;nde OleDbConnection ve SqlConnection nesneleri ile bu hatlar temin edilirken, .NET Framework 1.1 s&amp;uuml;r&amp;uuml;m&amp;uuml; ile birlikte, OdbcConnection ve OracleConnection sınıflarıda ADO.NET k&amp;uuml;t&amp;uuml;phanelerine dahil edilerek Odbc ve Oracle veri kaynaklarına bağlantılar sağlanması imkanı kazandırılmıştır.&lt;/p&gt;
&lt;p&gt;OleDbConnection sınıfı ile, bir OleDb Data Provider (veri sağlayıcısı) &amp;uuml;zerinden, ole db destekli veri kaynaklarına erişim sağlayabiliriz. SqlConnection sınıfı Sql Sunucularına doğrudan bağlantı sağlar. Aynı şekilde OracleConnection sınıfıda Oracle veri kaynaklarına doğrudan erişim sağlar. OdbcConnection sınıfı ise odbc destekli veri kaynaklarına erişim i&amp;ccedil;in kullanılır. Bu makalemizde bu bağlantı sınıflarından OleDbConnection sınıfını inceleyeceğiz. OleDbConnection sınıfı, ADO.NET sınıflarının , Ole Db desteği olan veri kaynaklarına erişebilmesi amacıyla kullanılır. Veri kaynağının tipi tam olarak bilinmediği i&amp;ccedil;in, arada bu işlevi ayırt etmeye yarayan bir COM+ nesnesi yer almaktadır. OleDbConnection sınıfına ait bir nesne iletişim kurmak istediği veri kaynağına ait ole db veri sağlayıcısını belirtmek durumundadır. Bunu daha iyi kavramak i&amp;ccedil;in aşağıdaki şekle bakalım.&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt;&lt;img src="/makale/images/mk54_1.gif" alt="" width="600" height="400" border="0" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Şekil 1. OleDbConnection ile Veri Kaynaklarına Bağlantı.&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi bir OleDbConnection nesnesi &amp;ouml;ncelikle bir Ole Db Data Provider ( Ole Db Veri Sağlayıcısı) ile iletişim kurar. Ardından bu veri sağlayıcı istenen veri kaynağına erişerek, gerekli hattı tesis etmiş olur. Peki bu işlemi nasıl ger&amp;ccedil;ekleştireceğiz. İşte t&amp;uuml;m Connection nesnelerinin en &amp;ouml;nemli &amp;ouml;zelliği olan ConnectionString &amp;ouml;zelliği bu noktada devreye girmektedir. Kısaca ConnectionString &amp;ouml;zelliği ile, veri kaynağı ile sağlanacak olan iletişim hattının kurulum bilgileri belirlenir. OleDbConnection sınıfı i&amp;ccedil;in ConnectionString &amp;ouml;zelliği aşağıdaki prototipe sahiptir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;public virtual string ConnectionString {get; set;}&lt;/pre&gt;
&lt;p&gt;ConnectionString &amp;ouml;zelliği belirlenmiş bir OleDbConnection sınıfı nesne &amp;ouml;rneğini a&amp;ccedil;tığımızda, yani veri kaynağına olan hattı kullanılabilir hale getirdiğimizde, bu &amp;ouml;zellik yanlız-okunabilir (read-only) hale gelir. Dolayısıyla a&amp;ccedil;ık bir OleDbConnection nesnesinin ConnectionString &amp;ouml;zelliğini değiştiremezsiniz. Bunun i&amp;ccedil;in bu bağlantıyı tekrardan kapatmanız gerekecektir. ConnectionString &amp;ouml;zelliği, bir takım anahtar-değer &amp;ccedil;iftlerinin noktalı virg&amp;uuml;l ile ayırlmasından oluşturulan string bir bilgi topluluğudur. ConnectionString &amp;ouml;zelliği i&amp;ccedil;inde kullanabileceğimiz bu anahtar-değer &amp;ccedil;iftlerinin en &amp;ouml;nemlisi Provider anahtarıdır. Bu anahtara vereceğimiz değer, hangi tip ole db veri sağlayıcısını kullanmak istediğimizi belirtmektedir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğin Sql sunucusuna, Sql Ole Db Provider ile bağlanmak istersek, Provider anahtarına, SQLOLEDB değerini atarız. Provider anahtarı mutlaka belirtilir. Daha sonraki anahtar-değer &amp;ccedil;iftleri ise bu Provider se&amp;ccedil;imine bağlı olarak değişiklik g&amp;ouml;sterecektir. Veri kaynağına hangi tip Ole Db Veri Sağlayıcısından bağlandığımızı se&amp;ccedil;tikten sonra, bağlanmak istediğimiz veri kaynağıda belli olmuş olucaktır. Sırada bu veri kaynağının adını veya adresine belirteceğimiz anahtar-değer &amp;ccedil;iftlerinin belirlenmesi vardır. &amp;Ouml;rneğin bir Sql Sunucusuna bağlanıyorsak, sunucu adınıda Ole Db Data Provider( Veri Sağlyacısı) 'na bildirmemiz gerekir. Bunun i&amp;ccedil;in Data Source anahtarını kullanırız. Bununla birlikte bağlandığımız veri kaynağı, sql yada oracle gibi bir veritabanı y&amp;ouml;netim sistemi değilde, Access gibi bir tablolama sistemi ise, Data Source anahtarı, tablonun fiziki adresini alır. Sql ve Oracle gibi sunuculara yapılacak bağlantılarda Provider ve Data Source se&amp;ccedil;iminin yanında hangi veritabanına bağlanılacağınıda Initial Catalog anahtarı yada Database anahtarı ile belirleriz. Bunların dışında veri kaynağına yapılacak olan bağlantının g&amp;uuml;venlik ayarlarınıda belirtiriz. &amp;Ccedil;oğunlukla Integrated Security gibi bir anahtara True değerinin atandığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bu anahtar, veri kaynağına bağlanmak istenen uygulama i&amp;ccedil;in, makinenin windows authentication ayarlarına bakıldığını belirtir. Dolayısıyla sql sunucusuna bağlanma yetkisi olan her windows kullanıcısı bu bağlantıyı sağlayabilir. Ancak istersek belli bir kullanıcı adı veya şifresi ilede bir veritabanına bağlantı a&amp;ccedil;ılmasını sağlayabiliriz. Bunun i&amp;ccedil;in ise, User ID ve Password anahtarlarını kullanırız.&lt;/p&gt;
&lt;p&gt;Buraya kadar bahsettiklerimiz kavramsal a&amp;ccedil;ıklamalardır. Dilerseniz basit &amp;ouml;rnekler ile konuyu daha iyi a&amp;ccedil;ıklamaya &amp;ccedil;alışalım. &amp;Ouml;rneklerimizi Console uygulamaları şeklinde ger&amp;ccedil;ekleştireceğiz. İlk &amp;ouml;rneğimizde, Sql Sunucusundaki veritabanı i&amp;ccedil;in, bir bağlantı hattı oluşturup a&amp;ccedil;acağız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

using System.Data.OleDb; /* OleDbConnection sınıfı, Data.OleDb isim uzayında yer almaktadır. */

namespace OleDbCon1
{
     class Class1
     {
          static void Main(string[] args)
          {
               OleDbConnection conFriends=new OleDbConnection(); /* OleDbConnection nesnemiz oluşturuluyor. */

               /* ConnectionString &amp;ouml;zelliği belirleniyor. Provider (Sağlayıcımız) SQLOLEDB. Bu bir sql sunucusuna bağlanmak istediğimizi belirtir. Data Source anahtarına localhost değerini atayarak, sunucunun yerel makinede olduğunu belirtiyoruz. Ancak buraya başka bir adreste girilebilir. Sunucunuz nerede ise oranın adresi. Database ile, bağlantı hattının a&amp;ccedil;ılacağı veritabanını belirliyoruz. Burada sql sunucumuzda yer alan Friends veritabanına bağlantı hattı a&amp;ccedil;ıyoruz. Son olarak Integrated Security=SSPI anahtar-değer &amp;ccedil;ifti sayesinde Windows Doğrulaması ile sunucuya bağlanabileceğimizi belirtiyoruz. Yani sql sunucusuna bağlanma yetkisi olan her windows kullanıcısı bu hattı tesis edebilecek.*/

               conFriends.ConnectionString="Provider=SQLOLEDB;Data Source=localhost;Database=Friends;Integrated Security=SSPI";

               try
               {
                    conFriends.Open(); /* Open metodu ile oluşturduğumuz iletişim hattını kullanıma a&amp;ccedil;ıyoruz. */
                    Console.WriteLine("Bağlantı a&amp;ccedil;ıldı...");
                    conFriends.Close(); /* Close metodu ilede oluşturulan iletişim hattını kapatıyoruz. */   
                    Console.WriteLine("Bağlantı kapatıldı...");
               }
               catch(Exception hata)
               {
                    Console.WriteLine(hata.Message.ToString());
               }
          }
     }
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk54_2.gif" alt="" width="269" height="115" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 2. Uygulamanın &amp;Ccedil;alışmasının Sonucu.&lt;/p&gt;
&lt;p&gt;Aynı &amp;ouml;rnekte bu kez belli bir kullanıcı ile bağlanmak istediğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu durumda ConnectionString'imizi aşağıdaki şekilde değiştirmemiz gerekir. Bu durumda User ID ve Password anahtarlarına gerekli kullanıcı değerlerini atarız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;conFriends.ConnectionString="Provider=SQLOLEDB;Data Source=localhost;Database=Friends;User Id=sa;Password=CucP??80.";&lt;/pre&gt;
&lt;p&gt;Şimdide bir Access tablosuna nasıl bağlanabileceğimizi g&amp;ouml;relim. Bunun i&amp;ccedil;in ConnectionString &amp;ouml;zelliğimizi aşağıdaki gibi yazarız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;OleDbConnection conYazarlar=new OleDbConnection("Provider=Microsoft.Jet.OLEDB.4.0;data source=c:\\Authors.mdb");

try
{
     conYazarlar.Open();
     Console.WriteLine("Yazarlar Access veritabanına bağlantı a&amp;ccedil;ıldı...");
     conYazarlar.Close();
     Console.WriteLine("Yazarlar Access veritabanına olan bağlantı kapatıldı...");
}
catch(Exception hata)
{
     Console.WriteLine(hata.Message.ToString());
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk54_3.gif" alt="" width="485" height="91" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 3. Access Veritabanına Bağlatı.&lt;/p&gt;
&lt;p&gt;Bu &amp;ouml;rnekte dikkat ederseniz ConnectionString &amp;ouml;zelliğini, OleDbConnection nesnemizin diğer yapıcı metodu i&amp;ccedil;erisinde parametre olarak belirledik. Ayıraca, Provider olarak bu kez Microsoft.Jet.OLEDB.4.0 'ı se&amp;ccedil;erek, bir Access veritabanına bağlanmak istediğimizi bu Ole Db Provider'a bildirmiş olduk. Daha sonra bu veri sağlayıcı componenti, Data Source anahtarındaki değere bakarak, ilgili adresteki veritabanına bir hat &amp;ccedil;ekti.&lt;/p&gt;
&lt;p&gt;Başka bir ConnectionString anahtarıda File Name dir. Bu anahtara bir udl uzantılı dosya adresi vererek, bağlantı hattının bu dosyadaki ayarlar &amp;uuml;zerinden ger&amp;ccedil;ekleştirilmesini sağlayabiliriz. Bir udl dosyası Data Link Properties ( veri linki &amp;ouml;zellikleri) &amp;ouml;zelliklerini belirler. B&amp;ouml;yle bir dosya oluşturmak son derece basittir. Bir text editor ile boş bir dosya a&amp;ccedil;ın ve onu udl uzantısı ile kaydedin. Bu durumda dosyamızın g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml; şu şekilde olucaktır.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk54_4.gif" alt="" width="72" height="71" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 4. Bir udl dosyasının g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;.&lt;/p&gt;
&lt;p&gt;Bu dosyayı a&amp;ccedil;tığımızda hepimizin aşina olduğu veritabanı bağlantı se&amp;ccedil;enekleri ile karşılaşırız.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk54_5.gif" alt="" width="367" height="467" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 5. Connection ayarları.&lt;/p&gt;
&lt;p&gt;Bu penceredeki adımları takip ederek bir ConnectionString'i bir udl dosyasına kaydedebilir ve OleDbConnection nesnemiz i&amp;ccedil;in sadece File Name anahtarına bu değeri vererek ilgili bağlantının, bu udl dosyasındaki ayarlar &amp;uuml;zerinden ger&amp;ccedil;ekleştirilmesini sağlayabiliriz. İlk yapmamız gereken ConnectionString &amp;ouml;zelliğinde olduğu gibi , Provider (Sağlayıcı) se&amp;ccedil;imidir.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk54_6.gif" alt="" width="367" height="467" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 6. Provider Se&amp;ccedil;imi.&lt;/p&gt;
&lt;p&gt;Burada &amp;ouml;rnek olarak Sql Server Provider'ımızı se&amp;ccedil;elim. Sonraki adımda ise sırasıyla sunucu adımızı (Server Name), sunucuya hangi kimlik doğrulaması ile bağlanacağımızı ve veritabanımızın adını se&amp;ccedil;eriz. Son olarakta bu dosyamızı kaydedelim.&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt;&lt;img src="/makale/images/mk54_7.gif" alt="" width="367" height="467" border="0" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 7. Connection &amp;Ouml;zelliklerinin belirlenmesi.&lt;/p&gt;
&lt;p&gt;Şimdi uygulamızı buna g&amp;ouml;re değiştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;OleDbConnection con=new OleDbConnection();
con.ConnectionString="File Name=C:\\baglanti.udl";

try
{
     con.Open();
     Console.WriteLine("Bağlantı a&amp;ccedil;ıldı...");
     con.Close();
     Console.WriteLine("Bağlantı kapatıldı...");
}
catch(Exception hata)
{
     Console.WriteLine(hata.Message.ToString());
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk54_8.gif" alt="" width="261" height="91" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 8. Udl dosyası &amp;uuml;zerinden bağlantı a&amp;ccedil;mak ve kapatmak.&lt;/p&gt;
&lt;p&gt;Tabiki burada Visual Studio.Net'in bağlantı sağlamak i&amp;ccedil;in bize sunduğu g&amp;ouml;rsel nimetlerden s&amp;ouml;zetmedende ge&amp;ccedil;emeyiz. Visual Studio.NET ortamında, OleDbConnection oluşturmak i&amp;ccedil;in kullanabileceğimiz Server Explorer sekmesi yer almaktadır.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk54_9.gif" alt="" width="272" height="259" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 9. Server Explorer&lt;/p&gt;
&lt;p&gt;Burada servers sekmesinde Sql sunucularına erişebiliriz. Buradan tablolara, g&amp;ouml;r&amp;uuml;n&amp;uuml;mlere, saklı yordamlara hatta tabloa alanlarına ulaşabiliriz. Server Explorer'ın sağladığı pek &amp;ccedil;ok işlevsellik vardır. &amp;Ouml;rneğin bu pencereden, bir sql tablosu yaratabilirsiniz veya bir saklı yordam oluşturabilirsiniz. Hatta bir tabloyu formunuza s&amp;uuml;r&amp;uuml;kl&amp;uuml;yerek, gerekli olan t&amp;uuml;m ADO.NET nesnelerinin otomatik olarak oluşturulmasınıda sağlayabilirsiniz. Bu makalemizde OleDbConnection nesnesini incelediğimiz i&amp;ccedil;in bu tip bir bağlantıyı Server Explorer yardımıyla nasıl ger&amp;ccedil;ekleştireceğimizi inceleyeceğiz. Bunun i&amp;ccedil;in&amp;nbsp; &lt;img src="/makale/images/mk54_10.gif" alt="" width="35" height="28" border="0" /&gt;&amp;nbsp; (Connect To Database) aracını kullanacağız. Bu butona bastığımızda karşımıza tanıdık Data Link Properties penceresi gelecektir. S&amp;uuml;ratli bir şekilde burada gerekli bağlantı ayarlarını yaptıktan sonra, Server Explorer aşağıdaki g&amp;ouml;r&amp;uuml;n&amp;uuml;m&amp;uuml; alıcaktır. Burada &amp;ouml;rnek olarak bir Access veritabanına bağlantı sağlanmıştır.&lt;/p&gt;
&lt;p align="left"&gt;&lt;em&gt; &lt;img src="/makale/images/mk54_11.gif" alt="" width="395" height="347" border="0" /&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 10. Bağlantı oluşturuldu.&lt;/p&gt;
&lt;p&gt;Dikkat ederseniz bağlantımız &amp;uuml;zerinden, veri kaynağındaki tablolara ve alanlarına ulaşabiliyoruz. Şimdi bu bağlantıyı, bir windows uygulamasında veya bir asp.net uygulamasında forma s&amp;uuml;r&amp;uuml;klediğimizde bir OleDbConnection nesnesinin otomatik olarak oluşturulduğunu g&amp;ouml;receksiniz. İşte bu kadar basit. Artık bu connection nesnesini kullanabilirsiniz. Diğer yandan Server Explorer'da oluşturulan bu bağlantıyı başka uygulamalarda da hazır olarak g&amp;ouml;rebilirsiniz. Data Connection sekmesi uygulamalarda kullanacağımız veri bağlantılarını hazır olarak bulundurmak i&amp;ccedil;in ideal bir yerdir.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk54_12.gif" alt="" width="304" height="374" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 11. OleDbConnection1 nesnesinin Server Explorer yarıdımıyla oluşturulması.&lt;/p&gt;
&lt;p&gt;Gelelim OleDbConnection nesnesinin diğer kullanışlı &amp;uuml;yelerine. Buraya kadar bir bağlantı hattını oluşturmak i&amp;ccedil;in ConnectionString &amp;ouml;zelliğinin nasıl kullanıldığını inceledik. Bununla birlikte var olan bir bağlantı hattını a&amp;ccedil;mak i&amp;ccedil;in Open metodunu, bu bağlantı hattını kapatmak i&amp;ccedil;inde Close metodunun kullanıldığını g&amp;ouml;rd&amp;uuml;k. OleDbConnection nesnesinin diğer bir &amp;ouml;zelliğide ConnectionTimeout değeridir. ConnectionTimeout &amp;ouml;zelliği, bir bağlantının sağlanması i&amp;ccedil;in gerekli s&amp;uuml;reyi belirtir. Bu s&amp;uuml;re boyunca bağlantı sağlanamaması bir istisnanın fırlatılmasına neden olucaktır. Bu &amp;ouml;zellik yanlız-okunabilir (read-only) bir &amp;ouml;zellik olduğundan, değerini doğrudan değiştiremeyiz. Bunun i&amp;ccedil;in, bu &amp;ouml;zelliği ConnectionString i&amp;ccedil;erisinde belirlememiz gerekir. &amp;Ouml;rneğin aşağıdaki kodlarda, Sql sunucusuna bağlanabilmek i&amp;ccedil;in gerekli s&amp;uuml;re 10 saniye olarak belirlenmiştir. Şimdi ben Sql Server servisimizi durduracağım ve uygulamayı &amp;ccedil;alıştıracağım. Bakalım 10 saniye sonunda ne olucak.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;OleDbConnection conFriends=new OleDbConnection();
conFriends.ConnectionString="Provider=SQLOLEDB;Data Source=localhost;Database=Friends;User Id=sa;Password=CucP??80.;Connect Timeout=10";
try
{
     conFriends.Open();
     Console.WriteLine("Baglanti a&amp;ccedil;ildi...");
     conFriends.Close();
     Console.WriteLine("Baglanti kapatildi...");
}
catch(Exception hata)
{
     Console.WriteLine(hata.Message.ToString());
}&lt;/pre&gt;
&lt;p&gt;Bu durumda aşağıdaki hata mesajını alırız.&lt;/p&gt;
&lt;p align="left"&gt;&lt;img src="/makale/images/mk54_13.gif" alt="" width="639" height="60" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 12. Sql sunucusunun olmadığını g&amp;ouml;steren istisna.&lt;/p&gt;
&lt;p&gt;OleDbConnection sınıfının Open ve Close metodları dışındada faydalı metodları vardır. &amp;Ouml;rneğin ChangeDatabase metodu. Bu metod ile a&amp;ccedil;ık olan bir bağlantı &amp;uuml;zerinden, veri kaynağındaki se&amp;ccedil;ili veritabanını değiştirmemiz sağlanır. Yani hattın ucu başka bir veritabanına y&amp;ouml;nlendirilebilir. Bu tabiki Oracle ve Sql gibi veritabanı sistemlerinde &amp;ouml;zellikle işe yarar. &amp;Ouml;rneğin, Friends veritabanına bağlıyken,&amp;nbsp; a&amp;ccedil;ık olan bağlantımız &amp;uuml;zerinden hattımızı, pubs veritabanına y&amp;ouml;nlendirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;OleDbConnection conFr=new OleDbConnection(); /* OleDbConnection nesnemiz oluşturuluyor. */
conFr.ConnectionString="Provider=SQLOLEDB;Data Source=localhost;Database=Friends;Integrate/d Security=SSPI"; /* Bağlantı hattımız i&amp;ccedil;in gerekli bilgiler giriliyor. Sql sunucumuzda yer alan Friends isimli veritabanına bağlandık. */
conFr.Open(); /* Bağlantımız a&amp;ccedil;ılıyor. */
Console.WriteLine("Veritabanı "+conFr.Database.ToString()); /* Şuandaki bağlantının hangi veritabanına yapıldığını OleDbConnection sınıfının Database &amp;ouml;zelliği ile &amp;ouml;ğreniyoruz. */
conFr.ChangeDatabase("pubs"); /* ChangeDatabase metodu ile bağlantı hattımızı y&amp;ouml;nlendirmek istediğimiz veritabanının adını giriyoruz. */
Console.WriteLine("Şimdiki veritabanı "+conFr.Database.ToString()); /* Bağlantı hattının şu an y&amp;ouml;nlendirilmiş olduğu veritabanının adını Database &amp;ouml;zelliği ile elde ediyoruz.*/
conFr.Close(); /* Bağlantımızı kapatıyoruz. */&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk54_14.gif" alt="" width="285" height="91" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 13. ChangeDatabase metodunun &amp;ccedil;alışmasının sonucu.&lt;/p&gt;
&lt;p&gt;Diğer yararlı bir metod ise GetOleDbSchemaTable metodudur ki bunu bir &amp;ouml;nceki makalemizde incelemiştik. Bunun dışında bir OleDbCommand nesnesini oluşturmaya yarayan CreateCommand metodu, bir Transaction'ın başlatılması i&amp;ccedil;in kullanılan BeginTransaction metodu, OleDbConnection'a ait kaynakları serbest bırakan Dispose metodu'da faydalı diğer metodlar olarak sayılabilir. Bu metodlardan ilerliyen makalelerde yeri geldik&amp;ccedil;e bahsedeceğiz. OleDbConnection nesnesinin sadece 3 adet olayı vardır. Bunlar, StateChange, Disposed ve InfoMessage olaylarıdır. Bunlardan en &amp;ccedil;ok, StateChange olayını kullanırız. Bu olay, OleDbConnection nesnesinin bağlantı durumunda bir değişiklik olduğunda oluşur. Bu olayın prototipi aşağıdaki şekildedir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;public event StateChangeEventHandler StateChange;&lt;/pre&gt;
&lt;p&gt;Bu olay StateChangeEventArgs tipinden bir arg&amp;uuml;man almaktadır. Bu arg&amp;uuml;man iki &amp;ouml;zelliğe sahiptir. Bunlar CurrentState ve OriginalState &amp;ouml;zellikleridir. CurrentState bağlantının o anki drumunu belirtir. OriginalState ise son değişiklikten &amp;ouml;nceki halini g&amp;ouml;sterir. Her iki &amp;ouml;zellikde&amp;nbsp; ConnectionState numaralandırıcısı t&amp;uuml;r&amp;uuml;nden değerlere işaret ederler.&amp;nbsp; Bu değerler şunlardır.&lt;/p&gt;
&lt;div&gt;
&lt;table id="AutoNumber8" style="width: 100%; height: 169px;" border="1" cellspacing="1" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td align="center" bgcolor="#cccccc" width="187" height="28"&gt;&lt;span style="font-weight: bold;"&gt; ConnectionState&lt;span style="font-weight: bold; font-family: Verdana;"&gt; Değeri&lt;/span&gt;&lt;/span&gt;&lt;/td&gt;
&lt;td align="center" bgcolor="#cccccc" width="74%" height="28"&gt;&lt;span style="font-weight: bold; font-family: Verdana;"&gt;A&amp;ccedil;ıklaması&lt;/span&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="187" height="19"&gt;ConnectionState.Open&lt;/td&gt;
&lt;td width="74%" height="19"&gt;Bağlantı a&amp;ccedil;ık ise bu değer ge&amp;ccedil;erlidir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="187" height="19"&gt;ConnectionState.Closed&lt;/td&gt;
&lt;td width="74%" height="19"&gt;Bağlantı kapandığında bu değer ge&amp;ccedil;erlidir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="187" height="19"&gt;ConnectionState.Connecting&lt;/td&gt;
&lt;td width="74%" height="19"&gt;Bağlantı hattı iletişime a&amp;ccedil;ılırken bu değer ge&amp;ccedil;erlidir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="187" height="19"&gt;ConnectionState.Broken&lt;/td&gt;
&lt;td width="74%" height="19"&gt;Bağlantı hattı a&amp;ccedil;ıkken herhangibir nedenle bir kopma meydana gelmesi ve hattın işlevselliğini kaybetmesi durumunda oluşur.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="187" height="19"&gt;ConnectionState.Executing&lt;/td&gt;
&lt;td width="74%" height="19"&gt;Bağlantı nesnemiz bir komut &amp;ccedil;alıştırırken oluşur.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td width="187" height="19"&gt;ConnectionState.Fetching&lt;/td&gt;
&lt;td width="74%" height="19"&gt;Bağlantı hattı &amp;uuml;zerinden veriler alınırken bur değer ge&amp;ccedil;erlidir.&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;/div&gt;
&lt;p align="left"&gt;Tablo 1. ConnectionState numaralandırıcısının değerleri.&lt;/p&gt;
&lt;p&gt;ConnectionState numaralandırıcısı aynı zamanda, State &amp;ouml;zelliği i&amp;ccedil;inde kullanılabilir. State &amp;ouml;zelliği, OleDbConnection nesnesinin o anki durumunu, ConnectionState numaralandırıcısı tipinde saklar. State &amp;ouml;zelliğini uygulamalarımızda, var olan bağlantının durumun kontrol ederek hareket etmek i&amp;ccedil;in kullanabiliriz. &amp;Ouml;rneğin bir bağlantı nesnesini uygulamamızın bir yerinde tekrardan a&amp;ccedil;mak istediğimizi varsayalım. Bu bağlantı nesnesinin durumu zaten Open ise yani a&amp;ccedil;ık ise, tekrardan a&amp;ccedil;ma işlemi uygulamamız gerekmez. Dilerseniz makalemizin sonunda StateChange olayına ilişkin bir &amp;ouml;rnek geliştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;OleDbConnection con; /* OleDbConnection nesnemiz tanımlanıyor.*/

private void Form1_Load(object sender, System.EventArgs e)
{
     lstDurum.Items.Clear();
     con=new OleDbConnection("Provider=SQLOLEDB;Data source=localhost;initial catalog=Friends;Integrated Security=sspi"); /* Bağlantı hattımız oluşturuluyor. */
     con.StateChange+=new StateChangeEventHandler(con_DurumDegisti); /* OleDbConnection nesnemiz i&amp;ccedil;in StateChange olayımız ekleniyor. Olay meydana geldiğinde con_DurumDegisti isimli metod &amp;ccedil;alıştırılıcak.*/
}

private void btnAc_Click(object sender, System.EventArgs e)
{
     if(con.State==ConnectionState.Closed) /* Kullanıcı a&amp;ccedil;ık olan bir bağlantı &amp;uuml;zerinden tekrar bu butona basarak bir bağlantı a&amp;ccedil;mak isterse bunun &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;mek i&amp;ccedil;in ilgili OleDbConnection nesnesinin durumuna bakıyoruz. Eğer con nesnesi kapalı ise, a&amp;ccedil;ılabilmesini sağlıyoruz.*/
     {
          con.Open(); /* Bağlantımız a&amp;ccedil;ılıyor. İşte bu anda StateChange olayı &amp;ccedil;alıştırılır.*/
     }
}
private void btnKapat_Click(object sender, System.EventArgs e)
{
     if(con.State==ConnectionState.Open) /* Eğer a&amp;ccedil;ık bir bağlantı varsa kapatma işlemini uyguluyoruz.*/
     {
          con.Close(); /* Bağlantı kapanıyor. StateChange olayı bir kez daha &amp;ccedil;alışır. */
     }
}
private void con_DurumDegisti(object sender,StateChangeEventArgs e)
{
     lstDurum.Items.Add("Bağlantı durumu "+e.OriginalState.ToString()+" idi."); /* Bağlantımızın hangi halde olduğunu alıyoruz.*/

     lstDurum.Items.Add("Artık bağlantı durumu "+e.CurrentState.ToString()); /* Ve bağlantımızın yeni halini alıyoruz.*/
}&lt;/pre&gt;
&lt;p&gt;&lt;img src="/makale/images/mk54_15.gif" alt="" width="288" height="216" border="0" /&gt;&lt;/p&gt;
&lt;p align="left"&gt;Şekil 14. StateChange olayı.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;şmek dileğiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2004-02-13 06:00:00</pubDate>
  <slug>Connection-(Baglantc4b1)-Kavramc4b1-ve-OleDbConnection-Sc4b1nc4b1fc4b1-bsenyurt-com-dan</slug>
  <tags>
    <tag>adonet</tag>
    <tag>oledb</tag>
    <tag>oledbconnection</tag>
    <tag>connection-string</tag>
    <tag>database</tag>
    <tag>c#</tag>
  </tags>
  <categories>
    <category>Ado.Net</category>
  </categories>
</post>