<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF - Windows CardSpace ile Güvenlik</title>
  <description>WCF(Windows Communication Foundation) mimarisini baz alan SOA(Service Oriented Applications) uygulamaları geliştirilirken, güvenlik(security) başlığı altında ele alınmakta olan pek çok konu vardır. Geliştirilen bir WCF servisinin sadece izin verilen istemciler(clients) tarafından kullanılmasıda bu konulardan bir tanesidir. Bu amaçla istemci uygulamaların veya onları kullanan hesapların servis tarafında doğrulanması(authenticate) ve yetkilendirilmesi(authorize) adına bazı teknikler ele alınır. Temel olarak bir istemcinin doğrulanması ve yetkilendirilmesi, onun kim olduğunun bilinmesine bağlıdır(Identification). Kimlik tespiti için kullanıcı adı-şifre, sertifika(certificate) yada Kerberos kartı(token) gibi elemanlar göz önüne alınır. Doğrulama işlemi sırasında kullanılan kimlik tespiti tekniklerinden biriside .Net Framework 3.0 ile birlikte gelen Windows Cardspace teknolojisidir.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;WCF(Windows Communication Foundation) mimarisini baz alan &lt;strong&gt;SOA(Service Oriented Applications)&lt;/strong&gt; uygulamaları geliştirilirken, g&amp;uuml;venlik(security) başlığı altında ele alınmakta olan pek &amp;ccedil;ok konu vardır. Geliştirilen bir WCF servisinin sadece izin verilen istemciler(clients) tarafından kullanılmasıda bu konulardan bir tanesidir. Bu ama&amp;ccedil;la istemci uygulamaların veya onları kullanan hesapların servis tarafında &lt;strong&gt;doğrulanması(authenticate)&lt;/strong&gt; ve &lt;strong&gt;yetkilendirilmesi(authorize)&lt;/strong&gt; adına bazı teknikler ele alınır. Temel olarak bir istemcinin doğrulanması ve yetkilendirilmesi, onun kim olduğunun bilinmesine &lt;strong&gt;bağlıdır(Identification)&lt;/strong&gt;. Kimlik tespiti i&amp;ccedil;in kullanıcı adı-şifre, sertifika(certificate) yada Kerberos kartı(token) gibi elemanlar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınır. Doğrulama işlemi sırasında kullanılan kimlik tespiti tekniklerinden biriside .Net Framework 3.0 ile birlikte gelen &lt;strong&gt;Windows Cardspace&lt;/strong&gt; teknolojisidir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Windows CardSpace teknolojisi &lt;strong&gt;Windows Vista&lt;/strong&gt; ile birlikte doğrudan gelmektedir. Nitekim Vista varsayılan olaran .Net Framwork 3.0 y&amp;uuml;kl&amp;uuml; olarak yayınlanmaktadır. Diğer taraftan &lt;strong&gt;.Net Framework 3.0&lt;/strong&gt; y&amp;uuml;klendiğinde Windows XP s&amp;uuml;r&amp;uuml;mlerinde de Windows CardSpace teknolojisi kullanılabilmektedir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;CardSpace teknolojisi sayesinde, istemciler kendi hazırladıkları kart bilgilerini g&amp;uuml;venli bir şekilde servis uygulamasına iletebilirler. Eğer istemcilerin g&amp;ouml;nderdiği kart bilgileri i&amp;ccedil;erisinde servisin ilgilendiği bilgiler var ise &lt;strong&gt;doğrulama(authentication) &lt;/strong&gt;ger&amp;ccedil;ekleşmiş olur. Bu aşamadan sonra ise doğrulanan kullanıcı i&amp;ccedil;in yine &lt;strong&gt;yetkilendirme(authorization)&lt;/strong&gt; işlemlerine ge&amp;ccedil;ilir.&lt;/p&gt;
&lt;p&gt;İşte bu makalemizde WCF(Windows Communication Foundation) ile geliştirilen servis y&amp;ouml;nelimli uygulamalarda CardSpace teknolojisini nasıl kullanabileceğimizi incelemeye &amp;ccedil;alışıyor olacağız. Her zamanki gibi konuyu daha iyi kavrayabilmek adına &amp;ouml;rnek bir senaryo ve uygulama &amp;uuml;zerinden adım adım ilerliyor olacağız. Geliştireceğimiz &amp;ouml;rnekler &lt;strong&gt;Windows Vista Business&lt;/strong&gt; işletim sistemi y&amp;uuml;kl&amp;uuml; bir makine &amp;uuml;zerinde geliştirilecektir. Ancak başlamadan &amp;ouml;nce &lt;strong&gt;kimlik(Identity)&lt;/strong&gt; kontrol&amp;uuml;n&amp;uuml; daha iyi kavrayabilmek adına aşağıdaki ger&amp;ccedil;ek d&amp;uuml;nya senaryoları g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Birinci Senaryo;&lt;/strong&gt; Kimlik bilgilerindeki detayların &amp;ouml;nemli olmadığı durumlar.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_5.gif" alt="" width="469" height="310" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Yukarıdaki şekildeki senaryoya g&amp;ouml;re bir spor kl&amp;uuml;b&amp;uuml;ne girmek isteyen bir birey yer almaktadır. Kapıdaki iri kıyım g&amp;ouml;revlinin bu kişiyi i&amp;ccedil;eri almasının tek şartı &amp;uuml;ye kartının(Membership Card) mevcut olmasıdır. Bunun dışında &amp;uuml;ye kartında yer alan detay bilgilerinin iri kıyım kapı g&amp;ouml;revlisi i&amp;ccedil;in hi&amp;ccedil; bir &amp;ouml;nemi bulunmamaktadır. S&amp;ouml;z gelimi kart &amp;uuml;zerinde yer alan &amp;uuml;yelik numarası, &amp;uuml;ye adı veya &amp;uuml;ye sahibinin doğum tarihi gibi bilgiler &amp;ccedil;okda &amp;ouml;nemli değildir. Ge&amp;ccedil;erli bir kartın olması yeterlidir. Bu senaryodaki yaklaşım ma&amp;ccedil; g&amp;uuml;nlerinde sadece kendi &amp;uuml;yelerine a&amp;ccedil;ık olan kl&amp;uuml;p fanları i&amp;ccedil;inde d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;İkinci Senaryo; &lt;/strong&gt;Kimlik bilgisinin &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; bir sistem tarafından sağlandığı ve kontrol edildiği durumlar.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_6.gif" alt="" width="465" height="457" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu senaryoda &amp;ccedil;icek d&amp;uuml;kkanından kredi kartı ile alışveriş yapmakta olan bir kişi yer almaktadır. Kredi kartı ile yapılan alışverişlerde kartın &amp;uuml;zerinde yer alan bilgiler kasa g&amp;ouml;revlisi tarafından olmasada banka merkezine bağlanan pos cihazı a&amp;ccedil;ısından &amp;ouml;nemlidir. Bu tip bir durumda kartın ger&amp;ccedil;ekten kullanan kişiye ait olduğunun anlaşılması gerekmektedir. Diğer taraftan kart sahibinin bu alışverişi yapması i&amp;ccedil;in yeterli hakka sahip olup olmadığıda &amp;ouml;nemlidir. Eğer bu haklara sahip ise son aşamada kart sahibi olduğunu ispat etmek i&amp;ccedil;in uzun zamandır &amp;uuml;lkemizdede uygulanan pin numarasınıda girmesi gerekmektedir. Burada kartın orjinal ve bakiyesinin yeterli olup olmadığını banka sistemi tarafından kontrol etmektedir.&lt;/p&gt;
&lt;p&gt;Bu senaryolar kulağa hoş ve mantıklı gelsede, acaba WCF(Windows Communication Foundation) ve Windows CardSpace ile aralarında nasıl bir ilişkileri vardır? Burada bahesedilen senaryolar &lt;strong&gt;hak-tabanlı g&amp;uuml;venlik (claims-based security) &lt;/strong&gt; vakkalarına &amp;ouml;rnek olabilecek ger&amp;ccedil;ek d&amp;uuml;nya yansımalarıdır. Bu tip bir g&amp;uuml;venlik sisteminde kişilerin kim olduğundan ziyade, yapılması istenen işlemler i&amp;ccedil;in ilgili kişinin hakkı olup olmadığının tespit edilmesi &amp;ouml;nemlidir. İşte WCF mimarisi altında geliştirilen uygulamalarda &lt;strong&gt; Windows CardSpace&lt;/strong&gt; teknolojisini sayesinde hak-tabanlı g&amp;uuml;venlik (claims-based security) &lt;strong&gt;altyapısı(infrastructure)&lt;/strong&gt; sağlanabilir. Hak-tabanlı g&amp;uuml;venlik(Claim Based Security) aslında &amp;uuml;&amp;ccedil; ana unsurdan oluşmaktadır. Bunlar aşağıdaki listede belirtildiği gibidir.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Kullanıcı(Subject):&lt;/strong&gt; Servise erişmek ve fonksiyonelliklerini &amp;ccedil;alıştırmak isteyen kullanıcı veya farklı bir sistem asıl &amp;ouml;znenin(subject) kendisidir. Kullanıcı, erişmek istediği servise, onun kabul edebileceği haklar sunmakla y&amp;uuml;k&amp;uuml;ml&amp;uuml;d&amp;uuml;r. Yukarıdaki senaryolar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında, kredi kartı ile kl&amp;uuml;p kapısından girmek ne kadar mantıksızsa, kl&amp;uuml;p kartı ile &amp;ccedil;i&amp;ccedil;ek&amp;ccedil;iden &amp;ccedil;i&amp;ccedil;ek satın almakta o kadar mantıksızdır. Bir başka deyişle istemci tarafından sunulan hakların, servis tarafında kabul edilebilir nitelikte olması gerekmektedir.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Kimlik Sağlayıcı (Identity Provider):&lt;/strong&gt; Adındanda anlaşılacağı &amp;uuml;zere, haklar i&amp;ccedil;in gerekli kimliği sağlamakta olan organizasyon veya varlıktır(entity). Yukarıdaki senaryolar g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alındığında kredi kartını veren banka veya &amp;uuml;ye griş kartını veren fan kl&amp;uuml;b&amp;uuml;, kimlik sağlayıcı konumundadır.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;G&amp;uuml;venilir Şahıs veya Grup(Relying Party):&lt;/strong&gt; Koruma altına alınmış hizmeti&lt;strong&gt;(Protected Service)&lt;/strong&gt; sunan organizasyon yada varlıktır. Kimlik sağlayıcısına(Identity Provider), kullanıcının verdiği kartın, kullanıcının yapmak istediği işlem ile ilişkili haklara sahip olup olmadığını sormakla y&amp;uuml;k&amp;uuml;ml&amp;uuml;d&amp;uuml;r. S&amp;ouml;z gelimi kredi kartı ile alışveriş işlemini tasvir eden senaryoda &amp;ccedil;i&amp;ccedil;ek&amp;ccedil;i yada bir başka deyişle &lt;strong&gt; satıcı(vendor)&lt;/strong&gt; &lt;strong&gt;g&amp;uuml;venilir şahıs(Relying Party)&lt;/strong&gt; rol&amp;uuml;ndedir.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Windows CardSpace kullanılaraktan istemciler farklı bilgiler i&amp;ccedil;eren &amp;ccedil;eşitli &lt;strong&gt;bilgi kartları (Information Card)&lt;/strong&gt; oluşturabilirler. Servis tarafında yer alan uygulamanın kendisi, doğrulayacağı kullanıcılardan gelecek olan bilgi kartlarını kendi belirleyeceği &lt;strong&gt;politikalara(Policy)&lt;/strong&gt; g&amp;ouml;re kontrol edebilir. Bilgi kartları i&amp;ccedil;erisinde &amp;ccedil;ok farklı veriler yer alabilir. Kullanıcının adı, email adresi, yaşı, doğum tarihi, hatta s&amp;uuml;r&amp;uuml;c&amp;uuml; belgesi veya pasaportu ile ilgili bilgiler dahi olabilir. Bu noktada &lt;strong&gt;Windows CardSpace&lt;/strong&gt; ile &lt;strong&gt;hak tabanlı g&amp;uuml;venlik(Claim-Based Security)&lt;/strong&gt; ortamı sunulan bir WCF uygulamasında, istemcinin bir servis talebi sonrası neler olacağına bakmakta yarar vardır. Aşağıdaki maddelerde, istemci(client) ve WCF servisi(Service) arasında hak-tabanlı g&amp;uuml;venlik(Claim-Based Security) ger&amp;ccedil;ekleştirildiğinde izlenen s&amp;uuml;rece ait adımlar yer almaktadır.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;İlk olarak istemci(Client), servisten(WCF Service) bir talepte(Request) bulunur.&lt;/li&gt;
&lt;li&gt;Sonrasında, istemci uygulama &amp;uuml;zerinde &amp;ccedil;alışan &lt;strong&gt;WCF &amp;ccedil;alışma zamanı(runtime),&lt;/strong&gt; Windows CardSpace i&amp;ccedil;erisinden kimlik se&amp;ccedil;ici uygulamayı&lt;strong&gt;(Identity Selector) &lt;/strong&gt;&amp;ccedil;ağırır.&lt;/li&gt;
&lt;li&gt;Kimlik se&amp;ccedil;ici(Identity Selector), servisten hak &amp;ccedil;eşidini&lt;strong&gt;(Claim Type)&lt;/strong&gt; talep eder. Bir başka deyişle hakların neye g&amp;ouml;re doğrulanacağını ister. &amp;Ouml;rneğin kullanıcının pin numarası, email adresi, ev telefonu vb... bir hak &amp;ccedil;eşidi olarak elde edilebilir. &lt;em&gt;(Bu bilgi elbetteki WCF servis uygulaması ve istemci yazılırken konfigursayon i&amp;ccedil;erisinde belirtilir.)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;İstemci uygulamada &amp;ccedil;alışan &lt;strong&gt; Identity Selector&lt;/strong&gt;, servisten gelen hak &amp;ccedil;eşidini b&amp;uuml;nyesinde barındırdan kartları kullanıcıya g&amp;ouml;rsel bir aray&amp;uuml;z ile sunar.&lt;/li&gt;
&lt;li&gt;İstemci uygulamayı &amp;ccedil;alıştırmakta olan kullanıcı bir kart se&amp;ccedil;imi ger&amp;ccedil;ekleştirir. &lt;em&gt;(Kullanıcılar istemci uygulamanın &amp;ccedil;alıştığı sistemde &lt;strong&gt;Windows CardSpace&lt;/strong&gt;' i kullanarak istedikleri bi&amp;ccedil;imde kart bilgileri oluşturabilirler. Bunu kart se&amp;ccedil;im aşamasında dahi yapabilirler.)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;İstemci uygulamada &amp;ccedil;alışan Identity Selector programı, &lt;strong&gt;kimlik sağlayıcı(Identity Provider)&lt;/strong&gt; ile iletişim kurar ve istemciye ait kart bilgisi i&amp;ccedil;inden hak &amp;ccedil;eşidi(Claim Type) ile ilişkili olanını g&amp;ouml;nderir.&lt;/li&gt;
&lt;li&gt;Kimlik sağlayıcısı(Identity Provider) gelen metadata bilgisini alır ve bir &lt;strong&gt;fiş(token) &lt;/strong&gt; &amp;uuml;reterek bunu Kimlik se&amp;ccedil;iciye(Identity Selector) g&amp;ouml;nderir.&lt;/li&gt;
&lt;li&gt;Identity Selector istemci programı &amp;ccedil;alıştıran kullanıcıya, oluşturulan fişin WCF servisine g&amp;ouml;nderilmesini onaylayıp onaylamadığını sorar. Eğer kullanıcı onaylarsa se&amp;ccedil;tiği bilgilere g&amp;ouml;re oluşturulan fiş(token) WCF servisine g&amp;ouml;nderilir.&lt;/li&gt;
&lt;li&gt;WCF Servisi gelen fiş bilgisini alır ve kullanıcının hakkının doğruluğunu kontrol eder. Eğer fiş(token) bilgisi ge&amp;ccedil;erli ise i&amp;ccedil;erisinde yer alan &lt;strong&gt;kimlik bilgisine(Identity Information)&lt;/strong&gt; bakarak kullanıcının talepte bulunduğu operasyonu yapıp yapamayacağına karar verir. Bir başka deyişle bu adımda &lt;strong&gt;yetkilendirme(authorization)&lt;/strong&gt; durumu ele alınır. Eğer yetki verilirse istemcinin talep ettiği fonksiyonellik &amp;ccedil;alıştırılır.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Durumu biraz daha g&amp;ouml;rselleştirmek adına aşağıdaki akış diagramından da yararlanılabilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_7.gif" alt="" width="633" height="503" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu kadar teorik bilgiden sonra &amp;ouml;rnek bir senaryo &amp;uuml;zerinden hareket etmekte yarar vardır. &amp;Ouml;rnekte servis tarafında basit bir fonksiyonellik sunulmaktadır. S&amp;ouml;z gelimi standart toplama fonksiyonunu i&amp;ccedil;eren bir WCF servis uygulaması tasarlanabilir. Servis ve istemci uygulamalar aynı makine &amp;uuml;zerinde yer almaktadır. Bunun dışında servis ve istemcilerin &lt;strong&gt;mesaj seviyesinde g&amp;uuml;venli (Message Level Security) &lt;/strong&gt;bir şekilde haberleşmeleri &amp;ouml;nemlidir. Burada mesaj seviyesindeki haberleşmenin g&amp;uuml;venli olabilmesi i&amp;ccedil;in &lt;strong&gt; sertifika(Certificate)&lt;/strong&gt; kullanımı tercih edilmiştir. İlk &amp;ouml;nce işe, istemci tarafında Windows CardSpace teknolojisini kullanarak basit bir &lt;strong&gt;bilgi kartı(Information Card)&lt;/strong&gt; hazırlayarak başlamakta yarar vardır. Bu ama&amp;ccedil;la &lt;strong&gt;Windows Vista&lt;/strong&gt; &amp;uuml;zerinde &lt;strong&gt;Control Panel&lt;/strong&gt; i&amp;ccedil;erisinde yer alan &lt;strong&gt;Windows CardSpace&lt;/strong&gt; programının kullanılması yeterlidir. &lt;em&gt;(Windows XP tabanlı sistemlerde de Windows CardSpace uygulamasına yine Control Panel &amp;uuml;zerinde erişilebilir)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_8.gif" alt="" width="266" height="112" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Eğer daha &amp;ouml;nceden y&amp;uuml;klenmiş bir bilgi kartı yok ise aşağıdaki gibi bir ekran ile karşılaşılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_9.gif" alt="" width="562" height="254" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Buradan &lt;strong&gt;Add a Card&lt;/strong&gt; opsiyonunu işaretlenerek devam edilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_10.gif" alt="" width="564" height="352" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sıradaki adımda ise &lt;strong&gt;Create a Personel card&lt;/strong&gt; opsiyonunu se&amp;ccedil;ilir. Şu aşamada, kredi kartı yada pasaport bilgisi gibi verileri saklayacak bir bilgi kartı(Information Card) oluşturulmadığından &lt;strong&gt;Install a Managed Card&lt;/strong&gt; se&amp;ccedil;eneğini ele alınmamaktadır. İzleyen adımda personel kart bilgilerinin girilmesi gerekmektedir. Bu ekran &amp;ouml;rnek olarak aşağıdaki gibi doldurulabilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_11.gif" alt="" width="590" height="550" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Hak(Claim) işlemleri email adresi &amp;uuml;zerinden yapılacağı i&amp;ccedil;in bu bilginin mutlaka girilmesi &amp;ouml;nemlidir. İşlemler tamamlandıktan sonra hazırlanan kartın aşağıdaki gibi eklendiği g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_12.gif" alt="" width="443" height="287" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Test amacıyla Garfi isimli hayali kişi i&amp;ccedil;in bir test kartı daha oluşturulmuştur. Bu kişinin email adresindeki bilgiye g&amp;ouml;re, servis &amp;uuml;zerinde gerekli fonksiyonelliği &amp;ccedil;alıştırma yetkisi olmayacaktır. Ama&amp;ccedil; b&amp;ouml;yle bir durumda servisin nasıl bir davranış sergileyeceğinin izlenmesidir.&lt;/p&gt;
&lt;p&gt;Artık servis tarafı tasarlanmaya başlanabilir. Servis uygulaması web &amp;uuml;zerinden &lt;strong&gt;WsFederationHttpBinding&lt;/strong&gt; tipini baz alacak şekilde tasarlanacaktır. Burada WsHttpBinding tipide g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Federasyon yada birlik(Federation), farklı sistemler arasında doğrulama(authentication) ve yetkilendirme(authorization) adına kimlik bilgilerinden&lt;em&gt;(&amp;ouml;rnekteki Windows CardSpace ile oluşturulanlar gibi)&lt;/em&gt; yararlanılmasını sağlayan bir kavramdır. Federation tarafından g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınan kimlik(Identity) bilgileri bir bilgisayar yada kullanıcıyı işaret edebilir. WsFederationHttpBinding bunun i&amp;ccedil;in gerekli olan alt yapıyı sunan hazır bir &lt;strong&gt;bağlayıcı tiptir(Binding Type)&lt;/strong&gt; ve WS-Federation protokol&amp;uuml;n&amp;uuml; desteklemektedir. Bu sebepten WsFederationHttpBinding tipi &lt;strong&gt;iletişim seviyesinde g&amp;uuml;venliği(transport level security) &lt;/strong&gt;desteklemez ve &lt;strong&gt; HTTP&lt;/strong&gt; &amp;uuml;zerinden iletişimi zorunlu kılar. Tekrardan uygulamaya d&amp;ouml;n&amp;uuml;lecek olursa; servis k&amp;uuml;t&amp;uuml;phanesi&lt;strong&gt;(WCF Service Library)&lt;/strong&gt; i&amp;ccedil;erisinde basit olarak toplama fonksiyonelliği sunulmaktadır. WCF servis k&amp;uuml;t&amp;uuml;phanesindeki tiplerin şematik g&amp;ouml;sterimi ve kod i&amp;ccedil;erikleri aşağıda olduğu gibidir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Sınıf Diagramı(Class Diagram);&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_13.gif" alt="" width="276" height="302" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;S&amp;ouml;zleşme(IMatematik);&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.ServiceModel;

namespace MatematikKutuphanesi
{
    [ServiceContract(Name="Matematik Servisi",Namespace="http://www.bsenyurt.com/Matematik/MatematikServisi")]
    public interface IMatematik
    {
        [OperationContract]
        double Topla(double x, double y);
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Matematik.cs;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
// System.IdentityModel.dll referans edilmelidir.
using System.IdentityModel.Claims;
using System.IdentityModel.Policy;
using System.ServiceModel;

namespace MatematikKutuphanesi
{
    public class Matematik:IMatematik
    {
        #region IMatematik Members

        public double Topla(double x, double y)
        {
            // &amp;Ouml;nce talepte bulunan istemcinin ilgili işlem i&amp;ccedil;in hakkı olup olmadığı kontrol edilir.
            if (KontrolEt())
                return x + y;
            else
                throw new Exception("Doğrulanmadı");
        }

        private static bool KontrolEt()
        {
            // Doğrulama i&amp;ccedil;eriği &amp;ccedil;ekilir
            AuthorizationContext ctx = OperationContext.Current.ServiceSecurityContext.AuthorizationContext;
            // Doğrulama i&amp;ccedil;eriğindeki her bir ClaimSets gezilir
            foreach (ClaimSet cSet in ctx.ClaimSets)
            {
                // ClaimSet' ler i&amp;ccedil;erisinde Email hakkını i&amp;ccedil;eren Claim' ler gezilir
                foreach (Claim clm in cSet.FindClaims(ClaimTypes.Email, Rights.PossessProperty))
                {
                    // O anki Claim' in Email değeri selim(at)buraksenyurt.com ise metod geriye true d&amp;ouml;nd&amp;uuml;r&amp;uuml;r.
                    if (clm.Resource.ToString() == "selim(at)buraksenyurt.com")
                        return true;
                }
            }
            return false;
        }

        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;Bu sınıf i&amp;ccedil;erisinde yer alan Topla metodunu, g&amp;ouml;nderdiği kart bilgisinde yer alan email adresi selim(at)buraksenyurt.com olan kullanıcı &amp;ccedil;alıştırabilir. Bunun kontrol&amp;uuml; i&amp;ccedil;in KontrolEt isimli geriye &lt;strong&gt;bool&lt;/strong&gt; değer d&amp;ouml;nd&amp;uuml;ren bir metod geliştirilmiştir. Bu metod kendi i&amp;ccedil;erisinde, istemciden gelen&lt;strong&gt; fiş(token)&lt;/strong&gt; bilgisi ve i&amp;ccedil;erisindeki &lt;strong&gt;Claim Set&lt;/strong&gt;' lerin elde edilmesi işlemlerini ger&amp;ccedil;ekleştirilir. İstemciden gelen fiş(token) bilgilerinin i&amp;ccedil;eriğine bakabilmek i&amp;ccedil;in elde edilen &lt;strong&gt; AuthorizationContext&lt;/strong&gt; referansının &lt;strong&gt;ClaimSets&lt;/strong&gt; koleksiyonuna gidilir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;ClaimSets&lt;/strong&gt; koleksiyonu i&amp;ccedil;erisinde yer alan &lt;strong&gt;ClaimSet&lt;/strong&gt; bilgilerinden &lt;strong&gt;hak tipi(Claim Type)&lt;/strong&gt; email adresi olanların yakalanabilmesi i&amp;ccedil;inde &lt;strong&gt;FindClaims&lt;/strong&gt; metodu kullanılır. FindClaims metodunun d&amp;ouml;nd&amp;uuml;receği koleksiyonun her bir elemanıda &lt;strong&gt;Claim&lt;/strong&gt; tipindendir. Claim referanslarının &lt;strong&gt;Resource&lt;/strong&gt; &amp;ouml;zelliklerinin değerleri &lt;strong&gt;object&lt;/strong&gt; tipindendir. Bunun sebebi hak tipine g&amp;ouml;re gelen verinin farklı tiplerde olabilmesidir. Bunu ge&amp;ccedil;erli bir mail adresi ile kıyaslamak i&amp;ccedil;in &lt;strong&gt;ToString&lt;/strong&gt; metodu ile string tipine d&amp;ouml;n&amp;uuml;şt&amp;uuml;rme işlemi yapılmıştır. Burada elbetteki email adresi kontrol&amp;uuml;n&amp;uuml; bir veritabanı(database) kaynağından yada hakkı olan email adreslerinin tutulduğu bir XML dosyasından yapmak &amp;ccedil;ok daha mantıklıdır. &amp;Ouml;rneğin amacı şu aşamada sadece test olduğundan bu işlemler g&amp;ouml;z ardı edilmiştir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;AuthorizationContext&lt;/strong&gt; tipi &lt;strong&gt;System.IdentityModel.Policy&lt;/strong&gt; &lt;strong&gt;isim alanı(Namespace)&lt;/strong&gt; altında, &lt;strong&gt;ClaimSets&lt;/strong&gt; ve &lt;strong&gt;Claim&lt;/strong&gt; tipleri ise &lt;strong&gt;System.IdentityModel.Claims&lt;/strong&gt; isim alanı altındadır. Her iki isim alanıda &lt;strong&gt;System.IdentityModel.dll&lt;/strong&gt; assembly' ında yer aldıklarından s&amp;ouml;z konusu dll referansının projeye a&amp;ccedil;ık&amp;ccedil;a eklenmesi gerekmektedir. Aşağıdaki şekillde System.IdentityModel referansının MatematikKutuphanesi isimli WCF Servis K&amp;uuml;t&amp;uuml;phanesine eklenmiş hali g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_14.gif" alt="" width="247" height="281" border="0" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Artık servis tarafında, ilgili s&amp;ouml;zleşmeyi ve fonksiyonelliği sunacak olan uygulama tasarlanabilir. Burada istemci ve servis arasında kart bilgileri taşınacağından &lt;strong&gt; g&amp;uuml;venilir bir ortam(Reliable Session)&lt;/strong&gt; hazırlanması gerekmektedir. Bu nedenle servisin kart bilgisi g&amp;ouml;nderecek olan istemcileri ile, &lt;strong&gt; sertifika(certificate)&lt;/strong&gt; aracılığıyla haberleşmesi gerekmektedir. Bir başka deyişle servis uygulamasının &lt;strong&gt;taleplerde(requests)&lt;/strong&gt; kullanacağı ve istemcilerinde referans edeceği bir sertifika tanımlamasının yapılması gerekmektedir.&lt;/p&gt;
&lt;p&gt;Bu ama&amp;ccedil;la ilk olarak, servis uygulaması i&amp;ccedil;in gerekli test sertifikasını &amp;uuml;reterek işe başlanabilir. Bu sertifikanın &amp;uuml;retimi ve servisin &amp;ccedil;alıştığı makine hesabına kaydı i&amp;ccedil;in &lt;strong&gt; Visual Studio 2008 Beta 2 Command Prompt&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;makecert.exe&lt;/strong&gt; aracının aşağıdaki gibi kullanılması yeterlidir. &lt;strong&gt;Makecert&lt;/strong&gt; aracı &lt;strong&gt;X.509&lt;/strong&gt; tabanlı test sertifikalarının &amp;uuml;retilmesinde kullanılmaktadır.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;makecert -sr LocalMachine -ss My -n CN=MatematikServisi -sky exchange&lt;/pre&gt;
&lt;p&gt;sr ile sertifikanın y&amp;uuml;kleneceği &lt;strong&gt; yer(location)&lt;/strong&gt; belirtilirken, ss sonrasında gelen My ilede &lt;strong&gt; Certificate Store &lt;/strong&gt;bilgisi tanımlanır. CN ifadesinden sonra oluşturulacak olan sertifikanın adı belirlenir. sky parametresinden sonra gelen değer ilede subject' in anahtar tipinin(Key Type) ne olacağı belirtilir. Burada &lt;strong&gt;exchange&lt;/strong&gt; dışında &lt;strong&gt;signature&lt;/strong&gt; değeride verilebilir. &lt;em&gt;(Makecert aracının kullanımı ile ilişkili olarak daha detaylı bilgi i&amp;ccedil;in &lt;a href="http://msdn2.microsoft.com/en-us/library/bfsktky3(VS.80).aspx"&gt; http://msdn2.microsoft.com/en-us/library/bfsktky3(VS.80).aspx&lt;/a&gt; adresinden yardım alınabilir.)&lt;/em&gt;&amp;nbsp; Bu komutun &amp;ccedil;alıştırılmasının ardından &lt;strong&gt;Microsoft Management Console(MMC)&lt;/strong&gt; yardımıyla sertifika ayarlarına bakıldığında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi MatematikServisi isimli test sertifikasının başarılı bir şekilde Local Computer altında yer alan Personal kısmı altına eklendiği g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_3.gif" alt="" width="598" height="649" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sertifika tanımlaması yapıldığına g&amp;ouml;re servis tarafındaki uygulamanın yazılması ile işlemlere devam edilebilir. Servis uygulaması IIS &amp;uuml;zerinde host edilmek &amp;uuml;zere tasarlanmalıdır. Bu ama&amp;ccedil;la yeni bir &lt;strong&gt;WCF Service &lt;/strong&gt;şablonu oluşturulur. Servis uygulaması, MatematikKutuphanesi isimli &lt;strong&gt;servis sınıf k&amp;uuml;t&amp;uuml;phanesini(WCF Service Library)&lt;/strong&gt; referans etmelidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_15.gif" alt="" width="252" height="160" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Servis tarafında yer alan Matematik.svc dosyasının i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;%@ ServiceHost Language="C#" Debug="true" Service="MatematikKutuphanesi.Matematik" %&amp;gt;&lt;/pre&gt;
&lt;p&gt;Servis tarafındaki belkide en &amp;ouml;nemli kısım konfigurasyon dosyasının i&amp;ccedil;eriğidir. Nitekim burada kullanılacak olan sertifikanın bildirimi, hak(Claim) tipinin ne olacağı gibi ayarlamaların yapılması gerekmektedir. Bu noktada &lt;strong&gt;Microsoft Service Configuration Editor&lt;/strong&gt; yardımıyla g&amp;ouml;rsel olarak hazırlanan web.config dosyasındaki &lt;strong&gt;ServiceModel&lt;/strong&gt; elementinin i&amp;ccedil;eriği aşağıdaki gibidir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;system.serviceModel&amp;gt;
    &amp;lt;bindings&amp;gt;
        &amp;lt;wsFederationHttpBinding&amp;gt;
            &amp;lt;binding name="MatematikServisiBindingConf" transactionFlow="true"&amp;gt;
                &amp;lt;reliableSession enabled="true" /&amp;gt;
                    &amp;lt;security&amp;gt;
                        &amp;lt;message issuedTokenType="urn:oasis:names:tc:SAML:1.0:assertion"&amp;gt;
                            &amp;lt;claimTypeRequirements&amp;gt;
                                &amp;lt;add claimType="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/emailaddress" isOptional="false" /&amp;gt;
                            &amp;lt;/claimTypeRequirements&amp;gt;
                        &amp;lt;/message&amp;gt;
                    &amp;lt;/security&amp;gt;
                &amp;lt;/binding&amp;gt;
            &amp;lt;/wsFederationHttpBinding&amp;gt;
        &amp;lt;/bindings&amp;gt;
    &amp;lt;behaviors&amp;gt;
        &amp;lt;serviceBehaviors&amp;gt;
            &amp;lt;behavior name="MatematikServisiBehavior"&amp;gt;
                &amp;lt;serviceMetadata httpGetEnabled="true" /&amp;gt;
                &amp;lt;serviceCredentials&amp;gt;
                    &amp;lt;serviceCertificate findValue="MatematikServisi" x509FindType="FindBySubjectName" /&amp;gt;
                    &amp;lt;issuedTokenAuthentication allowUntrustedRsaIssuers="true" /&amp;gt;
                &amp;lt;/serviceCredentials&amp;gt;
                &amp;lt;serviceDebug includeExceptionDetailInFaults="true" /&amp;gt;
            &amp;lt;/behavior&amp;gt;
        &amp;lt;/serviceBehaviors&amp;gt;
    &amp;lt;/behaviors&amp;gt;
    &amp;lt;services&amp;gt;
        &amp;lt;service behaviorConfiguration="MatematikServisiBehavior" name="MatematikKutuphanesi.Matematik"&amp;gt;
            &amp;lt;endpoint address="http://localhost/MatematikServisi/Matematik.svc" binding="wsFederationHttpBinding" bindingConfiguration="MatematikServisiBindingConf" name="MatematikServisiEndPoint" contract="MatematikKutuphanesi.IMatematik" /&amp;gt;
        &amp;lt;/service&amp;gt;
    &amp;lt;/services&amp;gt;
&amp;lt;/system.serviceModel&amp;gt;&lt;/pre&gt;
&lt;p&gt;Oluşturulan dosyada dikkat edilmesi gereken bir ka&amp;ccedil; nokta vardır. İlk olarak istemci ile servis arasında g&amp;uuml;venilir bir oturum a&amp;ccedil;ılması gerekmektedir. Bu nedenle bağlayıcı tipe ait olan &lt;strong&gt;relaiableSession&lt;/strong&gt; elementinin &lt;strong&gt;enabled&lt;/strong&gt; niteliğinin(attribute) değeri &lt;strong&gt;true&lt;/strong&gt; olarak belirlenmiştir. Bir sertifika kullanımı s&amp;ouml;z konusu olduğundan servis davranışlarından &lt;strong&gt; serviceCredentials&lt;/strong&gt; ayarlarının yapılması gerekmektedir. Bunu sağlayabilmek i&amp;ccedil;in serviceCredential elementi aşağıdaki gibi oluşturulmuştur.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;serviceCredentials&amp;gt;
                    &amp;lt;serviceCertificate findValue="MatematikServisi" x509FindType="FindBySubjectName" /&amp;gt;&lt;/pre&gt;
&lt;p&gt;Burada &lt;strong&gt;findValue&lt;/strong&gt; niteliğine verilen değer, daha &amp;ouml;nceden oluşturulan MatematikServisi isimli sertifikadır. Bu &lt;strong&gt;X.509&lt;/strong&gt; tipindeki sertifikasının bulunabilmesi i&amp;ccedil;inde &lt;strong&gt;x509FindType&lt;/strong&gt; niteliğine &lt;strong&gt;FindBySubjectName&lt;/strong&gt; değeri verilmiştir. Buna g&amp;ouml;re ilgili sertifika, nesne adına g&amp;ouml;re aranacaktır.&lt;/p&gt;
&lt;p&gt;Servis tarafı, istemcinin talepte bulunduğu hizmetler i&amp;ccedil;in hakkı olup olmadığını, kart bilgisi ile gelen email adreslerine g&amp;ouml;re yapmaktadır. Burada &lt;strong&gt;politika(policy) &lt;/strong&gt; olarak kart bilgisindeki email adresine bakılacağının s&amp;ouml;ylenmesi gerekmektedir. Bu ama&amp;ccedil;la &lt;strong&gt;security&lt;/strong&gt; elementi i&amp;ccedil;erisinde aşağıdaki ayarlamalar yapılmıştır.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;security&amp;gt;
    &amp;lt;message issuedTokenType="urn:oasis:names:tc:SAML:1.0:assertion"&amp;gt;
        &amp;lt;claimTypeRequirements&amp;gt;
            &amp;lt;add claimType="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/emailaddress" isOptional="false" /&amp;gt;
        &amp;lt;/claimTypeRequirements&amp;gt;
    &amp;lt;/message&amp;gt;
&amp;lt;/security&amp;gt;&lt;/pre&gt;
&lt;p&gt;Burada en &amp;ouml;nemli nokta &lt;strong&gt;claimType&lt;/strong&gt; niteliğinin değeridir. Bu niteliğe(attribute) &lt;strong&gt;well-known URI&lt;/strong&gt; formatında bir değer atanmıştır. Değerin sonunda yer alan &lt;strong&gt; emailaddress&lt;/strong&gt;, hak i&amp;ccedil;in gerekli politikayıda&lt;strong&gt;(Claim Policy)&lt;/strong&gt; belirlemektedir.&lt;/p&gt;
&lt;p&gt;Burada yazılan URI bilgisi programatik olarak static olarak tanımlanmış &lt;strong&gt;ClaimTypes&lt;/strong&gt; sınıfındaki &amp;ouml;zellikler(properties) &amp;uuml;zerindende elde edilebilir. ClaimTypes sınıfının &amp;uuml;yelerinin bir kısmının sınıf diagramındaki g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdaki gibidir. ClaimTypes sınıfı static bir sınıftır. Bu nedenle i&amp;ccedil;erisindeki &amp;uuml;yelerin tamamı static olarak tanımlanmıştır. Dolayısıyla bu &amp;uuml;yelere nesne &amp;ouml;rneği olmadan tip adı ile erişilebilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_16.gif" alt="" width="218" height="436" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z gelimi &amp;ccedil;alışma zamanında aşağıdaki kod par&amp;ccedil;ası kulanıldığında,&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Console.WriteLine(ClaimTypes.DateOfBirth);
Console.WriteLine(ClaimTypes.HomePhone);
Console.WriteLine(ClaimTypes.PostalCode);
Console.WriteLine(ClaimTypes.Surname);
Console.WriteLine(ClaimTypes.Webpage);&lt;/pre&gt;
&lt;p&gt;Claim Tipi olarak kullanılabilecek URI bilgileride şu şekilde elde edilecektir. Burada &amp;ouml;rnek olarak doğum g&amp;uuml;n&amp;uuml;, ev telefonu, posta kodu, soyadı ve web sayfası gibi bilgiler i&amp;ccedil;in gereken Well-Known URI bilgileri g&amp;ouml;sterilmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_17.gif" alt="" width="522" height="103" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Diğer taraftan &lt;strong&gt;message&lt;/strong&gt; elementi i&amp;ccedil;erisinde &lt;strong&gt;issuedTokenType&lt;/strong&gt; niteliğinede &lt;strong&gt; urn:oasis:names:tc:SAML:1.0:assertion&lt;/strong&gt; değeri atanmıştır. Bu tanımlamaya g&amp;ouml;re WCF servisinin, &lt;strong&gt;Secure Application Markup Language 1.0&lt;/strong&gt; uyumlu bir &lt;strong&gt;fiş(token)&lt;/strong&gt; beklediği belirtilmektedir. SAML, &lt;strong&gt;kimlik sağlayıcı(Identity Provider)&lt;/strong&gt; ile &lt;strong&gt;servis sağlayıcı(Service Provider)&lt;/strong&gt; arasında doğrulama(authentication) ve yetkilendirme(authorization) verilerinin değiş tokuş şeklini belirleyen bir XML standardıdır. &amp;Ouml;rnek uygulamada, aynı bilgisayardaki &lt;strong&gt;Windows CardSpace&lt;/strong&gt; ile hazırlanmış kimlik bilgileri baz alınmaktadır. Bir başka deyişle &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; parti bir kimlik sağlayıcı(Identity Provider) tarafından &amp;uuml;retilmiş bir kart mevcut değildir. Bu sebepten servisin &lt;strong&gt; g&amp;uuml;venilmez(untrusted)&lt;/strong&gt; kaynaklardan gelecek SAML fişlerinş(tokens) kabul edecek şekilde ayarlanması gerekir. Bunu sağlamak i&amp;ccedil;in &lt;strong&gt; serviceCredentials&lt;/strong&gt; elementi altındaki &lt;strong&gt;issuedTokenAuthentication&lt;/strong&gt; elemeninin &lt;strong&gt;allowUntrustedRsaIssuers&lt;/strong&gt; se&amp;ccedil;eneğine &lt;strong&gt;true&lt;/strong&gt; değeri atanmıştır.&lt;/p&gt;
&lt;p&gt;İstemci uygulamaya ge&amp;ccedil;meden &amp;ouml;nce servis uygulaması herhangibir tarayıcı penceresinden talep edilirse &lt;strong&gt;KeySet Does Not Exist&lt;/strong&gt; mesajlı bir &amp;ccedil;alışma zamanı istisnası alınabilir. B&amp;ouml;yle bir durumda &lt;strong&gt;WinHttpCertCfg.exe&lt;/strong&gt; aracı kullanılarak &lt;strong&gt; NetworkService&lt;/strong&gt; yada &lt;strong&gt;AspNet&lt;/strong&gt; hesaplarına(accounts), uygulamada kullanılan sertifika(Certificate) i&amp;ccedil;in kabul edilmiş erişim&lt;strong&gt;(grant access) &lt;/strong&gt;haklarının verilmesi gerekmektedir. WinHttpCertCfg aracı &lt;a href="http://www.microsoft.com/downloads/details.aspx?familyid=c42e27ac-3409-40e9-8667-c748e422833f"&gt; http://www.microsoft.com/downloads/details.aspx?familyid=c42e27ac-3409-40e9-8667-c748e422833f&lt;/a&gt;&amp;nbsp; adresinde tedarik edilebilir. WinHttpCertCfg aracı aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi kullanılmalıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_18.gif" alt="" width="639" height="182" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Yukarıdaki komut ifadesine g&amp;ouml;re NetworkService hesabı i&amp;ccedil;in, MatematikServisi &amp;uuml;zerine grant access hakkı verilmiştir. Artık servis tarafı internet tarayıcısı &amp;uuml;zerinden elde edilebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_19.gif" alt="" width="601" height="275" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Artık istemci tarafını yazmak i&amp;ccedil;in gerekli hazırlıklara başlanabilir. Sistemin &amp;ccedil;alışabilmesi i&amp;ccedil;in, &amp;uuml;retilen test sertifikasının &amp;ouml;ncelikli olarak o anki kullanıcı i&amp;ccedil;in &lt;strong&gt;Trusted People&lt;/strong&gt; olarak eklenmesi gerekmektedir. Bunu sağlayabilmek i&amp;ccedil;in &lt;strong&gt; Visual Studio 2008 Beta 2 Command Prompt&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;certmgr&lt;/strong&gt; aracı aşağıdaki g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi kullanılmalıdır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_1.gif" alt="" width="639" height="160" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak s&amp;ouml;z konusu sertifikanın bir kopyası sadece &lt;strong&gt;public key&lt;/strong&gt; değerini i&amp;ccedil;erecek şekilde &lt;strong&gt; MatematikServisi.cer &lt;/strong&gt;isimli dosyaya yazdırılır. Sonrasında &amp;ccedil;alıştırılan komut ilede, g&amp;uuml;ncel kullanıcı&lt;strong&gt;(Current User) &lt;/strong&gt;i&amp;ccedil;in &lt;strong&gt; Trusted People &lt;/strong&gt;olacak şekilde eklenir. Bu işlemlerin ardından Microsoft Management Console programından yararlanılarak Current User altındaki Personel b&amp;ouml;l&amp;uuml;m&amp;uuml;ne bakıldığında aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer aldığı gibi ilgili sertifika bildiriminin yapıldığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_2.gif" alt="" width="605" height="390" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu &amp;ouml;n hazırlıkları tamamladıktan sonra istemci uygulamanın geliştirilmesine başlanabilir. İstemci program basit bir Console uygulaması olarak ele alınmaktadır. Console uygulamasında, geliştirilen servisin &lt;strong&gt;Add Service Reference &lt;/strong&gt;se&amp;ccedil;eneği ile aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi eklenmesi gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_20.gif" alt="" width="631" height="203" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sonrasında ise yine &amp;uuml;retilen App.config dosyası istenirse g&amp;ouml;rsel olarak istenirse doğrudan yazılarak aşağıdaki hale getirilmelidir.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;behaviors&amp;gt;
            &amp;lt;endpointBehaviors&amp;gt;
                &amp;lt;behavior name="ClientEndPointBehavior"&amp;gt;
                    &amp;lt;clientCredentials&amp;gt;
                        &amp;lt;serviceCertificate&amp;gt;
                            &amp;lt;authentication certificateValidationMode="PeerTrust" revocationMode="NoCheck" /&amp;gt;
                        &amp;lt;/serviceCertificate&amp;gt;
                    &amp;lt;/clientCredentials&amp;gt;
                &amp;lt;/behavior&amp;gt;
            &amp;lt;/endpointBehaviors&amp;gt;
        &amp;lt;/behaviors&amp;gt;
        &amp;lt;bindings&amp;gt;
            &amp;lt;wsFederationHttpBinding&amp;gt;
                &amp;lt;binding name="MatematikServisiEndPoint" transactionFlow="true"&amp;gt;
                    &amp;lt;reliableSession enabled="true" /&amp;gt;
                    &amp;lt;security mode="Message"&amp;gt;
                        &amp;lt;message algorithmSuite="Default" issuedKeyType="SymmetricKey" issuedTokenType="urn:oasis:names:tc:SAML:1.0:assertion" negotiateServiceCredential="true"&amp;gt;
                            &amp;lt;claimTypeRequirements&amp;gt;
                                &amp;lt;add claimType="http://schemas.xmlsoap.org/ws/2005/05/identity/claims/emailaddress" isOptional="false" /&amp;gt;
                            &amp;lt;/claimTypeRequirements&amp;gt;
                        &amp;lt;/message&amp;gt;
                    &amp;lt;/security&amp;gt;
                &amp;lt;/binding&amp;gt;
            &amp;lt;/wsFederationHttpBinding&amp;gt;
        &amp;lt;/bindings&amp;gt;
        &amp;lt;client&amp;gt;
            &amp;lt;endpoint address="http://localhost/MatematikServisi/Matematik.svc" behaviorConfiguration="ClientEndPointBehavior" binding="wsFederationHttpBinding" bindingConfiguration="MatematikServisiEndPoint" contract="ServiceReference.MatematikServisi" name="MatematikServisiEndPoint"&amp;gt;
                &amp;lt;identity&amp;gt;
                    &amp;lt;certificateReference x509FindType="FindBySubjectName" findValue="MatematikServisi" /&amp;gt;
                &amp;lt;/identity&amp;gt;
            &amp;lt;/endpoint&amp;gt;
        &amp;lt;/client&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;İstemci tarafındaki konfigurasyon dosyasının pek &amp;ccedil;ok &amp;ouml;zelliği servis referansı eklendikten sonra otomatik olarak oluşturulur. Herşeyden &amp;ouml;nce istemci tarafında da bağlayıcı tip olarak &lt;strong&gt;wsFederationHttpBinding&lt;/strong&gt; ele alınmaktadır. Diğer taraftan istemci ile servis arasında &lt;strong&gt;g&amp;uuml;venilir bir oturum i&amp;ccedil;in(reliable session)&lt;/strong&gt; gerekli ayarlamalar yapılmıştır. Aynen servis tarafında olduğu gibi &lt;strong&gt;hak tipi(Claim Type)&lt;/strong&gt; email olacak şekilde belirlenmiş ve &lt;strong&gt;issuedTokenType&lt;/strong&gt; niteliğine atanan değer ile &lt;strong&gt;SAML&lt;/strong&gt; standardında bir &lt;strong&gt;fiş(token) &lt;/strong&gt;yayınlanacağı bildirilmiştir. Sertifika(Certificate) bildirimi &lt;strong&gt;Identity&lt;/strong&gt; elementi i&amp;ccedil;erisinde yapılmaktadır. Servis tarafındakine benzer olarak sertifika adı ve neye g&amp;ouml;re aranacağı belirtilmektedir &lt;strong&gt;findValue&lt;/strong&gt; ve &lt;strong&gt;x509FindType&lt;/strong&gt; nitelikleri ile belirtilmektedir.&lt;/p&gt;
&lt;p&gt;Konfigurasyon dosyasında gerekli değişiklikler yapıldıktan sonra Main metodu i&amp;ccedil;erisinde aşağıdaki gibi bir kod bloğu geliştirilerek servisin kullanılması sağlanabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
namespace CardSpaceIstemci
{
    class Program
    {
        static void Main(string[] args)
        {
            try
            {
                ServiceReference.MatematikServisiClient cli = new CardSpaceIstemci.ServiceReference.MatematikServisiClient();
                Console.WriteLine(cli.Topla(3, 4).ToString());
            }
            catch (Exception excp)
            {
                Console.WriteLine(excp.Message);
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Servis tarafında &lt;strong&gt; includeExceptionDetailsInFaults&lt;/strong&gt; &amp;ouml;zelliğinin değerini &lt;strong&gt;true&lt;/strong&gt; olarak belirlenmiş olduğundan, servis tarafından fırlatılacak olan istisna mesajları(Exception Messages) istemci uygulama &amp;uuml;zerinden kolaylıkla ele alınabilecektir. T&amp;uuml;m bu işlemlerin ardından istemci uygulama &amp;ccedil;alıştırıldığında, ekrana kart se&amp;ccedil;imi yapılması i&amp;ccedil;in bir sorgu penceresi a&amp;ccedil;ılacaktır. Bu sorgu penceresinde var olan kartlardan yararlanılabilir yada yeni bir kart oluşturularak g&amp;ouml;nderilmesi sağlanabilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_21.gif" alt="" width="564" height="396" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;İlk olarak Burak Senyurt Personel Kartı isimli bilgi kartı(Information Card) se&amp;ccedil;ildiğinden, kullanıcıya bir soru sorulacaktır. Bu soruda kullanıcının ilgili kart bilgisini servise g&amp;ouml;ndermek isteyip istemediği belirtilir. Kullanıcı bunu kabul etmesse bir başka deyişle &amp;ouml;rneğin Esc tuşu ile arabirimden &amp;ccedil;ıkarsa istemci tarafında yine bir &amp;ccedil;alışma zamanı hatası oluşacak ve bununla ilişkili bilgiler Log dosyasına aktarılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_22.gif" alt="" width="564" height="345" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Send&lt;/strong&gt; başlıklı d&amp;uuml;ğmeye bastıktan sonra aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi servis tarafında yapılan toplama işleminin sonucunun elde edilebildiği g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_23.gif" alt="" width="305" height="70" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Ancak aynı uygulamada Garfi isimli diğer kart bilgisi g&amp;ouml;nderildiğinde servis tarafında &amp;uuml;retilen istisna(Exception) mesajının alındığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z. Bir başka deyişle istemci uygulamadan g&amp;ouml;nderilen kart bilgisi i&amp;ccedil;erisindeki email adresine g&amp;ouml;re, servis tarafında toplama fonksiyonunun &amp;ccedil;alıştırılması i&amp;ccedil;in gereken hak koşulları sağlanamamıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk228_24.gif" alt="" width="288" height="63" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;Windows CardSpace&lt;/strong&gt; kullanılarak, WCF uygulamalarında &lt;strong&gt;hak tabanlı g&amp;uuml;venliği(Claim Based Security) &lt;/strong&gt;sağlamak olduk&amp;ccedil;a kullanışlı ve etkili bir yoldur. Burada, teknik detaylara &amp;ccedil;ok fazla girilmeyerek adım adım bu tarz bir sistemin nasıl kurulabileceğinden bahsedilmeye &amp;ccedil;alışılmıştır. Nevarki kullanılan sertifika bir test sertifikası olup &amp;uuml;&amp;ccedil;&amp;uuml;nc&amp;uuml; parti bir sağlayıcı tarafından &amp;uuml;retilen kart bilgileri ele alınmamıştır. Bu tarz ger&amp;ccedil;ek senaryo uygulamalarındada sistemin tasarlanması ve kuralları &amp;ccedil;ok fazla değişiklik g&amp;ouml;stermeyecektir.&lt;/p&gt;
&lt;p&gt;Bu konu ile ilişkili detaylı bilgiyi benimde yakından takip ettiğim ve faydalandığım &lt;strong&gt;John Sharp&lt;/strong&gt; imzalı &lt;strong&gt;MsPress&lt;/strong&gt; yayınlarına ait &lt;strong&gt; &lt;a href="http://www.microsoft.com/MSPress/books/10022.aspx"&gt;Microsoft Communication Foundation Step by Step&lt;/a&gt;&lt;/strong&gt; kitabından da bulabilirsiniz. Sanılanın aksine Step by Step olarak belirtilmesine rağmen konu WCF olunca olduk&amp;ccedil;a zor ve sıkı &amp;ccedil;alışılması gereken bir kitap olduğunuda vurgulamak isterim. B&amp;ouml;ylece geldik uzun bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/WCFCardSpace.rar"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2007-10-25 12:00:00</pubDate>
  <slug>WCF-Windows-CardSpace-ile-Guvenlik-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
    <tag>windows-card-space</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>