<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Rust Pratikleri - Loglama</title>
  <description>Bugün bir redis, rabbitmq, kafka sunucusu başlattığımızda ya da docker container’ı içerisine komut satırı açtığımızda terminal ekranına akan sayısız log içeriği olduğunu görüyoruz. Bu loglar hataları görmek, uyarıları çabucak fark etmek açısından sistem programcıları için son derece kıymetli bilgilerden oluşuyor. Çok doğal olarak Rust ile yazılan uygulamalar içinden log yayınlamak isteyebiliriz ki Rust’ın asıl odağının sistem programlama olduğunu da düşünecek olursak bu gereklidir. Rust Pratiklerinin bu ilk bölümünde log ve env_logger küfelerini kullanarak basit anlamda loglamanın nasıl yapıldığını öğreneceğiz.</description>
  <content>&lt;p&gt;&lt;span style="font-weight: 400;"&gt;&lt;img style="float: right;" src="/image.axd?picture=/2022/Ocak/voyager.jpg" alt="" /&gt;Bug&amp;uuml;n bir redis, rabbitmq, kafka sunucusu başlattığımızda ya da docker container i&amp;ccedil;erisine komut satırı a&amp;ccedil;tığımızda terminal ekranına akan sayısız log i&amp;ccedil;eriği olduğunu g&amp;ouml;r&amp;uuml;yoruz. Bu loglar hataları g&amp;ouml;rmek, kodun akışını izlemek ve uyarıları &amp;ccedil;abucak fark etmek a&amp;ccedil;ısından sistem programcıları i&amp;ccedil;in son derece kıymetli bilgilerden oluşuyor. &amp;Ccedil;ok doğal olarak Rust ile yazılan uygulamalar i&amp;ccedil;inden de log yayınlamak isteyebiliriz ki Rust&amp;rsquo;ın asıl odağının sistem programlama olduğunu d&amp;uuml;ş&amp;uuml;necek olursak bu gereklidir. Rust Pratiklerinin bu ilk b&amp;ouml;l&amp;uuml;m&amp;uuml;nde&amp;nbsp;&lt;/span&gt;&lt;a title="log crate" href="https://crates.io/crates/log" target="_blank"&gt;log&lt;/a&gt;&lt;span style="font-weight: 400;"&gt; ve &lt;/span&gt;&lt;a title="env_logger" href="https://docs.rs/env_logger/0.9.0/env_logger/" target="_blank"&gt;&lt;span style="font-weight: 400;"&gt;env_logger&lt;/span&gt;&lt;/a&gt;&lt;span style="font-weight: 400;"&gt; k&amp;uuml;felerini kullanarak basit anlamda loglamanın nasıl yapıldığını &amp;ouml;ğreneceğiz.&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-weight: 400;"&gt;Normalde bir k&amp;uuml;t&amp;uuml;phane geliştiriyorsak sadece log paketini kullanmak yeterlidir. Ancak &amp;ccedil;alıştırılabilir bir uygulamadan log basmak istersek onu implemente eden crate'leri kullanmamız gerekir. Fa&amp;ccedil;ade g&amp;ouml;revi &amp;uuml;stlenen bu tetikleyiciler farklı ortamlara log basma kabiliyetlerine de sahiptir. İzleyen &amp;ouml;rnekte minimal olanlardan env_logger kullanılıyor. Ancak daha karmaşık sistemler i&amp;ccedil;in log4rs&lt;em&gt;(log4net gibi d&amp;uuml;ş&amp;uuml;n&amp;uuml;n)&lt;/em&gt;, web assembly'lar i&amp;ccedil;in console_log, android, windows, unix gibi ortamlar i&amp;ccedil;in de android_log, win_dbg_logger, syslog vb k&amp;uuml;t&amp;uuml;phaneler de var.&lt;/span&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;span style="font-weight: 400;"&gt;&amp;Ouml;rneğe ait kodlara &lt;a href="https://github.com/buraksenyurt/rust-farm/tree/main/Practices/logging" target="_blank"&gt;rust-farm github reposundan&lt;/a&gt; ulaşabilirsiniz.&lt;/span&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;span style="font-weight: 400;"&gt;Senaryoda kobay bir Voyager veri yapısı ve &amp;uuml;zerinde uygulanan birka&amp;ccedil; fonksiyon yer alıyor. Fonksiyonların bazı noktalarına log mekanizması serpiştirilmiş durumda. Ama&amp;ccedil; terminal ekranına &amp;ccedil;eşitli t&amp;uuml;rde log basılmasını sağlamak. &amp;Ouml;rneğimizi aşağıdaki terminal komutları ile oluşturarak devam edelim.&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;cargo new logging
touch src/lib.rs&lt;/pre&gt;
&lt;p&gt;&lt;span style="font-weight: 400;"&gt;İlk olarak toml dosyasına gerekli crate bildirimlerini ekleyelim.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;[package]
name = "logging"
version = "0.1.0"
edition = "2021"

[dependencies]
# library'ler i&amp;ccedil;in log paketi yeterlidir,
log="0.4.14"
# ancak executable programlarda log'un dışarıya &amp;ccedil;ıkartılması gerekir.
# log paketinin farklı implementasyonları bu ama&amp;ccedil;la kullanılır.
# &amp;ouml;rneğin env_logger.
env_logger = "0.9.0"&lt;/pre&gt;
&lt;p&gt;&lt;span style="font-weight: 400;"&gt;lib.rs dosyasının i&amp;ccedil;erisinde Voyager isimli kobay bir struct ve onunla ilişkilendirilmiş &amp;ccedil;eşitli fonksiyonlar yer alıyor.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;// log paketinden kullanacağımız macro'lar i&amp;ccedil;in gerekli bildirimler
use log::{debug, error, info, trace, warn};

#[derive(Debug)]
pub struct Voyager {
    pub life: u8,
    pub nickname: String,
    pub universe: String,
    pub is_active: bool,
}

impl Voyager {
    pub fn new(nickname: String) -&amp;gt; Self {
        // debug t&amp;uuml;r&amp;uuml;nden bir log bırakıyoruz
        debug!(target:"app_events","Oyuna {} isimli bir gezgin katılıyor.",nickname);
        Voyager {
            nickname,
            ..Default::default()
        }
    }

    pub fn connect(&amp;amp;mut self, universe: String) {
        if !self.is_active &amp;amp;&amp;amp; self.life &amp;gt; 0 {
            // info t&amp;uuml;r&amp;uuml;nden bir log bırakıyoruz
            info!(target:"app_events","{}, {} evrenine bağlanıyor",self.nickname,universe);
            self.is_active = true;
            self.universe = universe;
        }
    }

    pub fn hited(&amp;amp;mut self) {
        self.life -= 1;
        // warn t&amp;uuml;r&amp;uuml;nden bir log bırakıyoruz
        warn!(target:"app_events","{} vuruldu ve {} canı kaldı.",self.nickname,self.life);

        if self.life == 0 {
            // error t&amp;uuml;r&amp;uuml;nden bir log bırakıyoruz
            error!(target:"app_events","{} ne yazık ki t&amp;uuml;m canlarını kaybetti. Bağlantısı kesiliyor",self.nickname);
            self.is_active = false;
        }
    }
}

impl Default for Voyager {
    fn default() -&amp;gt; Self {
        let voyager = Voyager {
            life: 3,
            is_active: false,
            universe: String::from("nowhere"),
            nickname: String::from("unknown"),
        };
        // trace t&amp;uuml;r&amp;uuml;nden bir log bırakıyoruz
        trace!(target:"app_events","Gezgin i&amp;ccedil;in varsayılan değerler y&amp;uuml;kleniyor.{:?}",voyager);
        voyager
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;span style="font-weight: 400;"&gt;Voyager'ı &amp;ccedil;eşitli evrenlere bağlanan bir gezgin olarak d&amp;uuml;ş&amp;uuml;nelim. Kolayca &amp;ouml;rneklemek i&amp;ccedil;in new fonksiyonuna sahip. Bir evrene bağlanmak i&amp;ccedil;in connect ve vurulduğunda can sayısını azaltmak i&amp;ccedil;in hited isimli iki fonksiyonu daha var. Ayrıca to_string kullanımı i&amp;ccedil;in &amp;ouml;nerilen Default trait'ini de uyarlamakta. Voyager ve bağlı fonksiyonlarında yer yer loglama yapıldığını g&amp;ouml;rebiliriz. Logun seviyesine g&amp;ouml;re uygun bir macro fonksiyonu kullanılmaktadır. Uyarı mesajları i&amp;ccedil;in warn!, bilgilendirici notlar i&amp;ccedil;in info!, debug &amp;ccedil;ıktıları i&amp;ccedil;in debug!, hata durumları i&amp;ccedil;in error! ve izleme operasyonları i&amp;ccedil;in trace! makrolarından yararlanıyoruz. Gelelim main dosyamıza. Onu da aşağıdaki şekilde kodlayarak devam edebiliriz.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:cpp;auto-links:false;toolbar:false" contenteditable="false"&gt;use logging::Voyager;

fn main() {
    // &amp;ouml;nce loglayıcıyı oluşturalım
    env_logger::init();

    let mut gemini = Voyager::new(String::from("Gemini"));
    println!("{}\n", gemini.nickname);
    gemini.connect(String::from("Andromeda"));

    for _ in 0..3 {
        println!("{:?}", gemini);
        gemini.hited();
    }

    gemini.life = 1;
    gemini.connect(String::from("Orion"));
}&lt;/pre&gt;
&lt;p&gt;&lt;span style="font-weight: 400;"&gt;&amp;Ouml;nemli olan nokta env_logger i&amp;ccedil;in init fonksiyonunun &amp;ccedil;ağırılmasıdır. Bu sayede terminal ortamına log atmak i&amp;ccedil;in gerekli ortam hazırlanmış olur. Kodun ilerleyen kısımlarında Voyager t&amp;uuml;r&amp;uuml;nden bir değişken oluşturup &amp;uuml;zerinde bazı işlemler uyguluyoruz. &amp;Ouml;nce Andromeda galaksisine seyahat eden gemini yolda birka&amp;ccedil; kez vuruluyor. Derken program insafa gelip ona bir hak daha veriyor ve o da bunu Orion galaksisine giderek değerlendiriyor. Bu aşamadan sonra ilk olarak clippy ile ne kadar ideomatic kod yazdığımıza bakmakta yarar var. Eğer uyarılar varsa buna g&amp;ouml;re kodu d&amp;uuml;zeltmemiz iyi olacaktır. Ardından run komutu ile &amp;ouml;rneği &amp;ccedil;alıştırabiliriz. Ancak ekrana istediğimiz log bilgileri akmayacaktır. Log okumak i&amp;ccedil;in RUST_LOG komutundan yararlanılır. Terminalden yapacaklarımızı aşağıdaki şekilde &amp;ouml;zetleyebiliriz.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;# &amp;ouml;nerileri alıp kodu toparlamak i&amp;ccedil;in
cargo clippy
# library'nin başarılı şekilde build olup olmadığını g&amp;ouml;rmek i&amp;ccedil;in
cargo build --lib

# varsayılan &amp;ccedil;alıştırmada sadece ERROR Logları g&amp;ouml;r&amp;uuml;n&amp;uuml;r
cargo run

# log &amp;ccedil;ıktılarını okumak i&amp;ccedil;in farklı yollar kullanabiliriz.
# warn ve error mesajlarını g&amp;ouml;sterir
RUST_LOG=warn cargo run

# trace ile birlikte debug,warn,info,error mesajlarını alırız
RUST_LOG=trace cargo run&lt;/pre&gt;
&lt;p&gt;&lt;span style="font-weight: 400;"&gt;Sonu&amp;ccedil; itibariyle aşağıdaki renkli ve i&amp;ccedil; ısıtan &amp;ccedil;ıktıyı alabilmemiz gerekiyor.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-weight: 400;"&gt;&lt;img src="/image.axd?picture=/2022/Ocak/logging_1.png" alt="" /&gt;&lt;/span&gt;&lt;/p&gt;
&lt;p&gt;&lt;span style="font-weight: 400;"&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere log ve env_logger k&amp;uuml;felerini kullanarak terminale log bırakmak olduk&amp;ccedil;a pratik. Bir başka rust pratiğinde g&amp;ouml;r&amp;uuml;şmek dileğiyle, sağlıklı g&amp;uuml;nler.&lt;/span&gt;&lt;/p&gt;</content>
  <pubDate>2022-01-30 13:45:00</pubDate>
  <slug>rust-pratikleri-loglama</slug>
  <tags>
    <tag>rust</tag>
    <tag>logging</tag>
    <tag>logger</tag>
    <tag>env_logger</tag>
    <tag>rust-pratikleri</tag>
  </tags>
  <categories>
    <category>Rust</category>
  </categories>
</post>