<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>WCF - MSMQ(MicroSoft Message Queue) ile Entegrasyon</title>
  <description>TCP veya HTTP bazlı iletişimlerde, tarafların aynı zaman dilimi içerisinde çalışıyor olmaları gerekmektedir. Böyle bir mesajlaşma sürecinde taraflardan herhangibirin çalışmaması, aradaki bağlantının kopması gibi nedenlerden dolayı tüm iletişimin aksamasıda muhtemeldir...</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;TCP&lt;/strong&gt; veya &lt;strong&gt;HTTP&lt;/strong&gt; bazlı iletişimlerde, tarafların aynı zaman dilimi i&amp;ccedil;erisinde &amp;ccedil;alışıyor olmaları gerekmektedir. B&amp;ouml;yle bir mesajlaşma s&amp;uuml;recinde taraflardan herhangibirin &amp;ccedil;alışmaması, aradaki bağlantının kopması gibi nedenlerden dolayı t&amp;uuml;m iletişimin aksamasıda muhtemeldir. Bazı ger&amp;ccedil;ek hayat senaryolarında, sistemin tarafları olan &lt;strong&gt;istemci(Client), sunucu(Server), ağ(Network)&lt;/strong&gt; bileşenlerinin &amp;ccedil;&amp;ouml;kmesi durumlarında dahi işlevselliğin devam edebilmesi istenebilir. Bunun dışında, &amp;ccedil;alışan sistemin i&amp;ccedil;erisindeki bileşenlerin s&amp;uuml;rekli bir bağlantıda olmadığı durumlarda bu tip iletişimleri zorlaştırmaktadır. Bir başka deyişle ağa s&amp;uuml;rekli olarak bağlanamayan ama &lt;strong&gt;offline&lt;/strong&gt; olarak &amp;ccedil;alışabilen istemcilerin bu tip bir mesajlaşma sisteminin par&amp;ccedil;ası olması istendiğinde senkronizasyon g&amp;uuml;&amp;ccedil;l&amp;uuml;kleri ortaya &amp;ccedil;ıkmaktadır.&lt;/p&gt;
&lt;p&gt;Ne varki mesajlaşmaların kuyruk(Queue) modeline g&amp;ouml;re taşındığı bir sistemde yukarıda bahsedilen iletişim sorunlarının yaşanmaması sağlanabilir. Nitekim &lt;strong&gt;mesaj kuyruğu(Message Queue)&lt;/strong&gt; sisteminin geliştirilme amacıda aslında budur. Bu sistem temelde Windows tabanlı bilgisayarlar arasında kuyruk sistemine dayalı bir mesaj alışverişinin tesis edilmesini sağlamaktadır. Bu iletişimde &lt;strong&gt;istemci(Client), servis(Service)&lt;/strong&gt; ve &lt;strong&gt;ağ(Network) &lt;/strong&gt;arasında bir izolasyon sağlanmaktadır. Bu izolasyon sayesinde istemci, servis yada ağ &amp;ccedil;&amp;ouml;kse, hata &amp;uuml;retse dahi fonksiyonelliklerini devam ettirebileceklerdir. Kuyruk temelli iletişimde &lt;strong&gt;g&amp;uuml;venilir(Reliable)&lt;/strong&gt; bir iletişim ortamı tesis edilmekte olup transaction kullanılabilmekte, kuyruğa atılan mesajlar fiziki yada &lt;strong&gt;değişken(Volatile)&lt;/strong&gt; olarak saklanabilmektedir. Kuyruk temelli mesajlaşmanın en bilinen uyarlaması &lt;strong&gt;MicroSoft Message Queue bileşenidir(Component).&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;MicroSoft Message Queue(&lt;/strong&gt;&lt;strong&gt;MSMQ)&lt;/strong&gt;, &lt;strong&gt;Windows NT&lt;/strong&gt; s&amp;uuml;r&amp;uuml;m&amp;uuml;nden beri gelen bir bileşendir. NT işletim sistemi i&amp;ccedil;in &lt;strong&gt;1.0&lt;/strong&gt; versiyonu duyrulan MSMQ bileşeninin &amp;ccedil;ok kısa tarih&amp;ccedil;esi aşağıdaki tabloda olduğu gibidir.&lt;/p&gt;
&lt;table style="border-collapse: collapse; width: 635px;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="width: 65px; background-color: #ffffff;" bgcolor="#336699" width="65"&gt;&lt;strong&gt;MSMQ &lt;br /&gt; Versiyonu&lt;/strong&gt;&lt;/td&gt;
&lt;td style="width: 171px; background-color: #ffffff;" bgcolor="#336699" width="171"&gt;&lt;strong&gt;Desteklenen &lt;br /&gt; İşletim Sistemi(Sistemleri)&lt;/strong&gt;&lt;/td&gt;
&lt;td style="width: 171px; background-color: #ffffff;" bgcolor="#336699"&gt;&lt;strong&gt;&amp;Ouml;zellikler&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="65"&gt;&lt;strong&gt;1.0&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top" width="171"&gt;Windows NT&lt;/td&gt;
&lt;td&gt;Varsayılan &amp;ouml;zellikler...&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="65"&gt;&lt;strong&gt;2.0&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top" width="171"&gt;Windows 2000&lt;/td&gt;
&lt;td&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Public&lt;/strong&gt; mesaj kuyruklarının &lt;strong&gt;Active Directory&lt;/strong&gt; destekli olarak saklanması&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;128&lt;/strong&gt; bitlik şifreleme desteği&lt;/li&gt;
&lt;li&gt;Dijital imza desteği&lt;/li&gt;
&lt;li&gt;Tam &lt;strong&gt;COM&lt;/strong&gt; desteği&lt;/li&gt;
&lt;/ul&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="65"&gt;&lt;strong&gt;3.0 *&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top" width="171"&gt;Windows XP&lt;br /&gt; Windows Server 2003&lt;/td&gt;
&lt;td&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;HTTP&lt;/strong&gt; , &lt;strong&gt;SOAP&lt;/strong&gt; desteği ile &lt;strong&gt;internet&lt;/strong&gt; &amp;uuml;zerinden mesajlaşabilme&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;IIS&lt;/strong&gt; i&amp;ccedil;in &lt;strong&gt;MSMQ&lt;/strong&gt; desteği&lt;/li&gt;
&lt;li&gt;Mesajların &amp;Ccedil;oklu D&amp;ouml;n&amp;uuml;şt&amp;uuml;r&amp;uuml;lebilmesi&lt;strong&gt;(MultiCasting)&lt;/strong&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="65"&gt;&lt;strong&gt;4.0 **&lt;/strong&gt;&lt;/td&gt;
&lt;td valign="top" width="171"&gt;Vista&lt;br /&gt; Longhorn Server&lt;/td&gt;
&lt;td&gt;
&lt;ul&gt;
&lt;li&gt;Alt kuyruk desteği&lt;strong&gt;(Subqueue)&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;Zehirli mesajların ele alınması&lt;strong&gt;(Posion Message Handling)&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;Uzak kuyruklardan transaction bazlı mesaj alma desteği&lt;strong&gt;(Transactional Remote Receive)&lt;/strong&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td colspan="3" valign="top"&gt;*&lt;em&gt; &lt;a href="http://www.microsoft.com/windowsserver2003/technologies/msmq/whatsnew.mspx"&gt; http://www.microsoft.com/windowsserver2003/technologies/msmq/whatsnew.mspx&lt;/a&gt;&lt;/em&gt;&lt;br /&gt; ** &lt;em&gt; &lt;a href="http://windowssdk.msdn.microsoft.com/en-us/library/ms701784.aspx"&gt; http://windowssdk.msdn.microsoft.com/en-us/library/ms701784.aspx&lt;/a&gt;&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;Ayrıca 1999 yılında MSMQ' nun mobil cihazlar i&amp;ccedil;in olan desteğide &lt;strong&gt;Windows CE 3.0&lt;/strong&gt; işletim sistemi ile birlikte başlamıştır.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;MSMQ&lt;/strong&gt; Windows tabanlı bir bileşendir. Ancak farklı bilgisayarlar ilede haberleşme olanağı mevcuttur. MSMQ' nun g&amp;ouml;revi aynen diğer iletişim sistemlerinde olduğu gibi farklı bilgisayarlar arasında mesajlaşmayı sağlayabilmektir. Bu mesajlaşmadaki tek fark, tarafların aynı anda &amp;ccedil;alışıyor olma zorunluluklarının bulunmayışıdır. Hatta s&amp;ouml;z konusu taraflarda &amp;ccedil;alışan uygulamalar bir ağa(Network) bağlı olmak zorundada değildirler. B&amp;ouml;yle bir durumda ortaya &amp;ccedil;ıkan soru iletilmek istenen mesajların karşı taraf kapalı iken nasıl ulaştırılacağıdır? MSMQ bileşenleri, mesajları, karşı taraf hazır oluncaya kadar bir depoda saklamaktadır. Bu deponun tutuluş yeri varsayılan olarak fiziki bir ortamdır. Ancak istenirse performası arttırmak adına ge&amp;ccedil;ici bir ortamda da saklanabilirler. Ne varki &lt;strong&gt;Volatile&lt;/strong&gt; olarak adlandırılan bu mesajlar sistemlerin &amp;ccedil;&amp;ouml;kmesi (MSMQ bileşeninin y&amp;uuml;kl&amp;uuml; olduğu bilgisayarın &amp;ouml;rneğin yeniden başlatılması-&lt;strong&gt;restart&lt;/strong&gt;) halinde kaybolacaktır. Oysaki fiziki saklanan mesajlar korunmaya devam edecektir. Buda MSMQ' nun mesajlar i&amp;ccedil;in uzun s&amp;uuml;reli bir saklama ortamı kullanabildiği anlamına gelmektedir&lt;strong&gt;(Durable)&lt;/strong&gt;.&lt;/p&gt;
&lt;p&gt;MSMQ bileşenlerine .&lt;strong&gt;NET&lt;/strong&gt; ortamı i&amp;ccedil;erisinde &lt;strong&gt;System.Messaging isim alanında(Namespace) &lt;/strong&gt;bulunan tipler yardımıyla erişilebilmektedir. Bu sebepten programatik olarak &lt;strong&gt;C#, VB.Net &lt;/strong&gt;ve diğer .NET destekli diller yardımıyla kuyruklara bakılması, mesaj eklenmesi ve daha gelişmiş y&amp;ouml;netsel işlemlerin yapılması m&amp;uuml;mk&amp;uuml;nd&amp;uuml;r. Diğer taraftan MSMQ' nun &lt;strong&gt;C/C++&lt;/strong&gt; ile yazılmış olan ve &lt;strong&gt;COM&lt;/strong&gt; tabanlı ortamlarda kullanılabilen bir &lt;strong&gt;API'side&lt;/strong&gt; mevcuttur. Elbette &lt;strong&gt;WCF&lt;/strong&gt; i&amp;ccedil;erisinde MSMQ i&amp;ccedil;in hazır olan bazı &lt;strong&gt;bağlayıcı tipler(Binding Types) &lt;/strong&gt;kullanılmaktadır.&lt;/p&gt;
&lt;p&gt;MSMQ sonu&amp;ccedil; itibariyle taraflar arasında mesaj taşıdığından mesajların boyutlarıda performans a&amp;ccedil;ısından &amp;ouml;nemlidir. Varsayılan olarak minimum mesaj b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml; &lt;strong&gt;150&lt;/strong&gt; &lt;strong&gt;byte&lt;/strong&gt;' tır. Bu mesaj i&amp;ccedil;erisinde, &lt;strong&gt;imza(Signature)&lt;/strong&gt;, &lt;strong&gt;kaynak ve hedef bilgisayar ID&lt;/strong&gt;' leri, &lt;strong&gt;hedef kuyruğun adı(Target Queue Name)&lt;/strong&gt;,&lt;strong&gt; mesaj &amp;ouml;zellikleri &lt;/strong&gt;yer alır. Ancak &lt;strong&gt;transaction&lt;/strong&gt; kullanılıyorsa yada &lt;strong&gt;doğrulama(authentication)&lt;/strong&gt; ve &lt;strong&gt;şifreleme(encryption) &lt;/strong&gt;s&amp;ouml;z konusuysa bu boyutun artması muhtemeldir. &amp;Ouml;rneğin dahili bir sertifika kullanımında mesaj boyutu &lt;strong&gt;400&lt;/strong&gt; &lt;strong&gt;byte&lt;/strong&gt; kadar artmaktadır. Harici sertifika&lt;strong&gt;(Certificate) &lt;/strong&gt;kullanımında en az &lt;strong&gt;1 kb&lt;/strong&gt;' lık bir mesaj boyutu oluşmaktadır. Bunların dışında &lt;strong&gt;HTTP&lt;/strong&gt; veya &lt;strong&gt;MultiCast&lt;/strong&gt; kullanımı s&amp;ouml;z konusu ise &lt;strong&gt;SOAP&lt;/strong&gt; formatlamadan dolayı mesajın sadece &lt;strong&gt;başlık kısmı(Message Header)&lt;/strong&gt; &lt;strong&gt;1&lt;/strong&gt; &lt;strong&gt;kb&lt;/strong&gt; boyutunda olacaktır. &amp;Ccedil;ok doğal olarak mesaj boyutlarındaki bu artışlar iletişim hızını olumsuz y&amp;ouml;nde etkileyebilir. Dolayısıyla en uygun senaryoları&lt;strong&gt;(Best Practices) &lt;/strong&gt;ele almak gerekir. &lt;em&gt; (B&amp;ouml;l&amp;uuml;m&amp;uuml;n sonunda bu konuya kısaca değinilecektir.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Peki MSMQ kullanmak i&amp;ccedil;in gerekli senaryolar neler olabilir? Aslında kuyruk tabanlı iletişim, g&amp;uuml;venilir ağ ortamlarının s&amp;ouml;z konusu olmadığı, &lt;strong&gt;ağ ortamına(Network)&lt;/strong&gt; arada sırada bağlanabilen uygulamaların haberleşmesi gerektiği durumlarda sıklıkla ele alınmaktadır. &amp;Ouml;rneğin bir servis uygulaması tarafından, g&amp;uuml;n i&amp;ccedil;inde &lt;strong&gt;offline&lt;/strong&gt; ortamlardan gelen siparişlerin g&amp;uuml;n sonunda toplu olarak işlendiği bir senaryo g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir. Aşağıdaki şekilde buna benzer bir senaryo incelenmeye &amp;ccedil;alışılmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk231_4.gif" alt="" width="528" height="448" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Senaryoda, zaman zaman &lt;strong&gt;offline&lt;/strong&gt; duruma d&amp;uuml;şebilecek olan istemciler s&amp;ouml;z konusudur. Bu istemciler &amp;uuml;zerinden gelen siparişler bir sunucuda toplanmaktadır. Siparişleri işleyen sunucu tahsilatlar i&amp;ccedil;in başka bir sunucuyu kullanmaktadır. Burada s&amp;ouml;z konusu siparişleri işleyen servis ile, tahsilatın yapıldığı sunucu ve &lt;strong&gt;PDA&lt;/strong&gt; cihazında kullanılan uygulamaların s&amp;uuml;rekli bir bağlantıda olmadığı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınmaktadır. B&amp;ouml;yle bir durumda bir siparişin işlenmesi zaman alabilir. Ayrıca bu bekleme s&amp;uuml;relerinin siparişleri işleyen uygulamayı etkilemesi istenmez. Yani, bekleyen siparişlerin gecikmeli olarakta olsa işlenebildiği ve yeni gelen siparişlerinde toplanabildiği bir ortamın hazırlanması gerekmektedir. B&amp;ouml;ylece &lt;strong&gt;PDA&lt;/strong&gt; satıcılar siparişleri &lt;strong&gt;offline&lt;/strong&gt; olarak toplayabilir ve daha sonra işlenmek &amp;uuml;zere(servis ile bağlantı tekrardan sağlandıktan sonra) servise g&amp;ouml;nderebilir. Ayrıca web &amp;uuml;zerinden gelen siparişlerin işleme alındığı bilgisi anında kullanıcılara g&amp;ouml;sterilebilir(Laptop ile ifade edilen kullanıcılar). Bu tip senaryolar genişletilebilir. Ancak uygun vakalar &amp;ccedil;oğunlukla &lt;strong&gt;offline&lt;/strong&gt; &amp;ccedil;alışma ihtiyacı olan, g&amp;uuml;venilir bir ağ ortamında bulunamayan veya bir ağa hi&amp;ccedil; bağlı olmayan bilgisayarların, asenkron olarak haberleşmesi gereken durumlardır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Burada &amp;ccedil;ok &amp;ouml;nemli bir nokta vardır. &lt;strong&gt;MSMQ&lt;/strong&gt; gibi kuyruk tabanlı iletişimi benimsiyen sistemler &lt;strong&gt;asenkron(asynchronous)&lt;/strong&gt; olarak &amp;ccedil;alışmaktadır. MSMQ bu anlamda, &lt;strong&gt;g&amp;uuml;venilir(Reliable)&lt;/strong&gt; ortam oluşturabilen, &lt;strong&gt;Transaction&lt;/strong&gt; desteği sağlayan,&lt;strong&gt; bağlantısız(Disconnected) &lt;/strong&gt;&amp;ccedil;alışmaya olanak tanıyan, &lt;strong&gt;s&amp;uuml;rekli depolama(Durable)&lt;/strong&gt; desteği veren m&amp;uuml;kemmel bir&lt;strong&gt;asenkron(Asynchronous)&lt;/strong&gt; iletişim ortamı sağlamaktadır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;MSMQ&lt;/strong&gt; bileşenlerinin kullanıldığı uygulamalar herhangibir &lt;strong&gt;Windows&lt;/strong&gt; programı olabilir. Bu nedenle bir Windows uygulamasından&lt;strong&gt;(Windows Application)&lt;/strong&gt;, Windows Servisinden&lt;strong&gt;(Windows Service)&lt;/strong&gt;, akıllı istemciden&lt;strong&gt;(Smart Client)&lt;/strong&gt;, web sitesinden MSMQ kullanılabilir. Bu noktada MSMQ ile ilgili &amp;ouml;nemli sorunlardan birisi g&amp;uuml;ndeme gelmektedir. &amp;Ouml;rnek bir windows işletim sistemi tabanlı uygulama, MSMQ kullanarak, kuyruk tabanlı başka bir sistem ile nasıl haberleşebilir? S&amp;ouml;z gelimi kuyruk tabanlı iletişimi kullanan &lt;strong&gt;IBM MQSeries&lt;/strong&gt; ile bir &lt;strong&gt;MSMQ&lt;/strong&gt; istemcisi nasıl haberleşebilir?&lt;/p&gt;
&lt;p&gt;MSMQ istemcileri &lt;strong&gt;yabancı bilgisayarlar(Foreign Computers)&lt;/strong&gt; ile &lt;strong&gt;Connector&lt;/strong&gt; adı verilen uygulamalar aracılığıyla haberleşebilirler. &lt;strong&gt;Connector&lt;/strong&gt; uygulamaları aslında bir MSMQ sunucusunda &amp;ccedil;alışır ve yabancı bilgisayarların MSMQ istemciler ile olan haberleşmelerinde aracılık yapar. Bu aracılıkta transaction desteği olan veya olmayan kanallar s&amp;ouml;z konusudur. &lt;strong&gt;IBM MQSeries &lt;/strong&gt;ile iletişimi sağlayan Connector uygulama &lt;strong&gt;Microsoft MSMQ-MQSeries Bridge&lt;/strong&gt; programıdır. Tabi farklı kuyruk tabanlı sistemler i&amp;ccedil;in farklı Connector uygulamaları mevcuttur.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;MSMQ' nun yazının hazrılandığı tarih itibariyle &lt;strong&gt;4.0&lt;/strong&gt; versiyonu bulunmaktadır. Bu versiyon ile gelen bazı belirgin &amp;ouml;zelliklerin bilinmesi gerekmektedir. 4.0 versiyonu&lt;strong&gt; alt kuyruklar(SubQueue)&lt;/strong&gt;, zehirli mesajların ele alınması&lt;strong&gt;(Poison Message Handling)&lt;/strong&gt;, transaction bazlı uzak kuyruk desteği&lt;strong&gt;(Transactional Remote Receive) &lt;/strong&gt;şeklinde 3 &amp;ouml;nemli yenilik i&amp;ccedil;ermektedir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;SubQueues(Alt Kuyruklar):&lt;/strong&gt; Mesajların ek fiziki kuyruklar oluşturmadan mantıksal olarak &amp;ccedil;eşitli kriterlere g&amp;ouml;re alt gruplara ayrılabilmesi desteğidir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Zehirli Mesajların Ele Alınmas(Poison Message Handling): &lt;/strong&gt;Zehirli mesajlar, bir kuyrukta arkadan gelen mesajları engelleyen niteliktedir. Bir uygulama kuyruktan bir mesajı okuyup işlemek isterken, mesajdaki hata nedeni ile bu işlemi yapamadığı durumlarda, (eğer s&amp;uuml;re&amp;ccedil; bir transaction i&amp;ccedil;erisindeyse) &lt;strong&gt;Abort&lt;/strong&gt; işlemini ger&amp;ccedil;ekleştirip mesajı tekrardan kuyruğa d&amp;ouml;nd&amp;uuml;recektir. Bu mesaj daha sonradan tekrardan işlenmek amacıyla uygulama tarafından yeniden okunacak ama hatası nedeni ile yine kuyruğa geri d&amp;ouml;nd&amp;uuml;r&amp;uuml;lecektir. Bu durumda transaction' ın s&amp;uuml;rekli olarak abort edildiği ve mesajın kuyruğa g&amp;ouml;nderildiği sonsuz bir d&amp;ouml;ng&amp;uuml; oluşacaktır. Bu d&amp;ouml;ng&amp;uuml;ye neden olan mesaj bir s&amp;uuml;re sonra tekrardan deneme sayısınında aşılması sebebiyle arkadan gelen mesajlarında işlenmesini engelleyecektir. İşte &lt;strong&gt;MSMQ 4.0&lt;/strong&gt; versiyonu ile birlikte bu tip mesajların daha g&amp;uuml;&amp;ccedil;l&amp;uuml; bir şekilde ele alınması ve sorunun &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ilmesi sağlanmaktadır. Bunun i&amp;ccedil;inde &lt;strong&gt;Retry Queue&lt;/strong&gt;(yeniden deneme kuyruğu) adı verilen kuyruklar kullanılmaktadır. (WCF i&amp;ccedil;erisindeki bağlayıcı tipler buna destek veren &amp;ouml;zellikler(Properties) i&amp;ccedil;ermektedirler)&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Transaction bazlı uzak kuyruk desteği(Transactional Remote Receive): &lt;/strong&gt;Tek bir mesaj kuyruğunun işleri aldığı bir durumda, başka bilgisayarlardaki uygulamalarında bu işleri değerlendirdiği d&amp;uuml;ş&amp;uuml;n&amp;uuml;ls&amp;uuml;n. Uygulamardan biri sıradaki bir işi işleyemez ise bu işin sonradan değerlendirilmek &amp;uuml;zere tekrardan kuyruğa g&amp;ouml;nderilmesi tercih edilir. Bu tip bir s&amp;uuml;re&amp;ccedil; i&amp;ccedil;in transaction desteği gerekmektedir. Ayrıca istemci bilgisayarların ve kuyruğun &lt;strong&gt;ağ(Network)&lt;/strong&gt; &amp;uuml;zerinden &lt;strong&gt;DTC(Distributed Transaction Coordinator)&lt;/strong&gt; erişiminede izin vermesi şarttır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;&lt;strong&gt;MSMQ&lt;/strong&gt;, WCF i&amp;ccedil;erisinde de doğrudan desteklenmektedir. &amp;Uuml;stelik WCF' in sağladığı birleştirilmiş&lt;strong&gt;(Unified) &lt;/strong&gt;model sayesinde, geliştiriciler MSMQ' nun karmaşık alt yapısından uzaklaşmaktadır. Basit anlamda WCF &amp;uuml;zerinden MSMQ konseptine bakıldığında aşağıdaki durum s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk231_2.gif" alt="" width="539" height="280" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Burada istemci ve servis uygulamaları ortak bir kuyruğu kullanarak iletişim sağlamaktadır. Kuyruk i&amp;ccedil;erisinde yer alan mesajlar fiziki bir ortamda sakalanbilmektedir. &lt;strong&gt;Microsoft Managament Console&lt;/strong&gt; kullanıldığı takdirde kuyruktaki mesajların tutulacağı yer genellikle aşağıdaki şekildende g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi &lt;strong&gt;Windows\System32\msmq\Storage&lt;/strong&gt; klas&amp;ouml;r&amp;uuml;d&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk231_1.gif" alt="" width="564" height="521" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Diğer taraftan ger&amp;ccedil;ek bir dağıtık mimari vakasında mesaj kuyrukları &amp;ccedil;oğunlukla istemci ve servis uygulamaları i&amp;ccedil;in ayrı ayrı tutulurlar. Bu durum aşağıdaki şekilde olduğu gibi ifade edilebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk231_3.gif" alt="" width="396" height="426" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu senaryoda istemci ve servis uygulamaları kendi ortamlarındaki &lt;strong&gt;kuyruk y&amp;ouml;neticileri(Queue Manager)&lt;/strong&gt; yardımıyla haberleşmektedir. Kuyruk y&amp;ouml;neticileri mesajları kuyruğa atmak veya kuyruktan okumak i&amp;ccedil;in gerekli y&amp;ouml;netsel işlemleri &amp;uuml;stlenmektedir. İstemci uygulamalar, servis uygulamasına g&amp;ouml;ndermek istedikleri mesajları kuyruk y&amp;ouml;neticisine iletirler. Kuyruk y&amp;ouml;neticisi bu mesajları &lt;strong&gt;taşıma kuyruğuna(Transport Queue)&lt;/strong&gt; aktarır. Karşı taraf hazır olduğundada servis uygulamasındaki kuyruk y&amp;ouml;neticisine g&amp;ouml;nderilir. Servis tarafındaki kuyruk y&amp;ouml;neticisi gelen mesajı alarak hedef kuyruğa&lt;strong&gt;(Target Queue) &lt;/strong&gt;atar. Sonrasında ise servis tarafındaki kuyruk y&amp;ouml;neticisi, hedef kuyruğa kabul ettiği mesajı işlenmek &amp;uuml;zere servis uygulamasına y&amp;ouml;nlendirir. Burada iletişim, g&amp;uuml;venilir bir ortamda ger&amp;ccedil;ekleştirilir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;WCF(Windows Communication Foundation)&lt;/strong&gt; tarafında &lt;strong&gt;MSMQ&lt;/strong&gt; desteği i&amp;ccedil;in iki farklı &lt;strong&gt;bağlayıcı tip(Binding Type)&lt;/strong&gt; kullanılmaktadır. Bunlar &lt;strong&gt;netMsmqBinding&lt;/strong&gt; ve &lt;strong&gt;msmqIntegrationBinding&lt;/strong&gt; tipleridir. netMsmqBinding iki &lt;strong&gt;WCF End Point&lt;/strong&gt; arasında MSMQ tabanllı bir iletişimi sağlamak amacıyla kullanılır. msmqIntegrationBinding tipi ise bir WCF End Point ve &lt;strong&gt;C, C++, COM &lt;/strong&gt;veya &lt;strong&gt;System.Messaging API&lt;/strong&gt;' si yardımıyla geliştirimiş bir MSMQ destekli uygulama arasında iletişimin sağlanması i&amp;ccedil;in kullanılmaktadır. Yanlız bu tip kullanılırken &amp;ouml;nemli bir kısıt vardır. Bu kısıta g&amp;ouml;re operasyon s&amp;ouml;zleşmesi&lt;strong&gt;(Operation Contract) &lt;/strong&gt;tanımlanırken &lt;strong&gt;MsmqMessage&lt;/strong&gt; tipinden tek parametre alan bir metod s&amp;ouml;z konusu olabilir. Bunun tek sebebi WCF dışında olan bir ortam ile ortak haberleşebilmeyi sağlamaktır.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;&lt;strong&gt;WCF&lt;/strong&gt; tabanlı &lt;strong&gt;MSMQ(MicroSoft Message Queue) &lt;/strong&gt;uygulamlarında servis tarafında tanımlanan operasyonların &lt;strong&gt;tek y&amp;ouml;nl&amp;uuml;(OneWay)&lt;/strong&gt; olacak şekilde tanımlanmaları gerekmektedir. Bunun sebepi &lt;strong&gt;MSMQ&lt;/strong&gt;' nun normal şartlarda &lt;strong&gt;tek y&amp;ouml;nl&amp;uuml; iletişimi(One-Way Transport) &lt;/strong&gt;kullanıyor olmasıdır.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Artık bir &amp;ouml;rnek &amp;uuml;zerinden hareket edilerek WCF i&amp;ccedil;erisinde &lt;strong&gt;MSMQ&lt;/strong&gt;' nun nasıl kullanılabileceğine bakılabilir. &amp;Ouml;ncelikli olarak &lt;strong&gt;servis s&amp;ouml;zleşmesi(Service Contract) &lt;/strong&gt;ve uygulayıcı sınıfın yer aldığı &lt;strong&gt;WCF Servis K&amp;uuml;t&amp;uuml;phanesinin(WCF Service Libraray)&lt;/strong&gt; &amp;ouml;rnek olarak aşağıdaki gibi tasarlandığı g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınsın.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk231_5.gif" alt="" width="291" height="298" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Servis S&amp;ouml;zleşmesi;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace SiparisKutuphanesi
{
    [ServiceContract(Name="Siparis Servisi",Namespace="http://www.bsenyurt.com/SiparisServisi")]
    public interface ISiparisYonetici
    {
        [OperationContract(IsOneWay=true)]
        void SiparisEt(int urunNo, int miktar);
    }
}&lt;/pre&gt;
&lt;p&gt;Servis s&amp;ouml;zleşmesinde dikkat edilmesi gereken noktalardan birisi &lt;strong&gt;OperationContract&lt;/strong&gt; isimli &lt;strong&gt;nitelikle(Attribute) &lt;/strong&gt;kullanılan &lt;strong&gt;IsOneWay&lt;/strong&gt; &amp;ouml;zelliğine true değeri atanmasıdır. Daha &amp;ouml;nceden de bahsedildiği gibi &lt;strong&gt;MSMQ&lt;/strong&gt; tipinde haberleşmelerde mesajların tek y&amp;ouml;nl&amp;uuml; &amp;ccedil;alışması s&amp;ouml;z konusudur. Bu doğal olarak mesajın g&amp;ouml;nderildikten sonra işlenip işlenmediğinden haberdar olunamaması anlamına da gelmektedir. Dolayısıyla mimari gereği operasyonun &lt;strong&gt;tek y&amp;ouml;nl&amp;uuml;(One Way)&lt;/strong&gt; olacağı belirtilmelidir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Uygulayıcı Sınıf;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Threading;
using System.ServiceModel;

namespace SiparisKutuphanesi
{
    public class SiparisYonetici:ISiparisYonetici
    {
        #region ISiparisYonetici Members

        public void SiparisEt(int urunNo, int miktar)
        {
            Thread.Sleep(7000);
            // Sipariş ile ilgili işlemler
        }
        
        #endregion
    }
}&lt;/pre&gt;
&lt;p&gt;Uygulayıcı sınıf i&amp;ccedil;erisinde sembolik olarak &lt;strong&gt;SiparisEt&lt;/strong&gt; isimli bir metod bulunmaktadır. Bu metodun herhangibir işlevi yoktur. Sadece &lt;strong&gt;MSMQ&lt;/strong&gt; senaryosunu tamamlayıcı bir &amp;ouml;ğedir. Diğer taraftan kuyruk oluşumlarını daha kolay izleyebilmek ve asenkron &amp;ccedil;alışmayı daha kolay takip edebilmek adına metod i&amp;ccedil;erisinde bilin&amp;ccedil;li olaraktan, &amp;ccedil;alışan &lt;strong&gt;Thread&lt;/strong&gt;' in 7 saniye s&amp;uuml;reyle uyutulması sağlanmaktadır.&lt;/p&gt;
&lt;p&gt;Servis uygulaması basit bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması olarak tasarlanabilir. Nitekim burada &amp;ouml;nemli olan noktalar konfigurasyon dosyası i&amp;ccedil;erisinde yapılan değişikliklerdir. Servis uygulamasına ait konfigurasyon dosyasının i&amp;ccedil;eriği ve kaynak kodları aşağıdaki gibidir. &lt;em&gt;(Servis uygulamasında, WCF Servis K&amp;uuml;t&amp;uuml;phanesi ve &lt;strong&gt;System.ServiceModel.dll assembly&lt;/strong&gt;' larının referanslarının eklenmemesi unutulmamalıdır.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Servis tarafı konfigurasyon dosyası;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;bindings&amp;gt;
            &amp;lt;netMsmqBinding&amp;gt;
                &amp;lt;binding name="SiparisServisiBindingConfig" receiveTimeout="00:10:00" deadLetterQueue="System" durable="true" exactlyOnce="true" maxRetryCycles="2" receiveErrorHandling="Fault" receiveRetryCount="5" retryCycleDelay="00:30:00"&amp;gt;
                    &amp;lt;security mode="None" /&amp;gt;
                &amp;lt;/binding&amp;gt;
            &amp;lt;/netMsmqBinding&amp;gt;
        &amp;lt;/bindings&amp;gt;
        &amp;lt;services&amp;gt;
            &amp;lt;service name="SiparisKutuphanesi.SiparisYonetici"&amp;gt;
                &amp;lt;endpoint address="net.msmq://localhost/private/SiparisKuyrugu" binding="netMsmqBinding" bindingConfiguration="SiparisServisiBindingConfig" name="SiparisServisiEndPoint" contract="SiparisKutuphanesi.ISiparisYonetici" /&amp;gt;
            &amp;lt;/service&amp;gt;
        &amp;lt;/services&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;Konfigurasyon dosyasının i&amp;ccedil;eriği &lt;strong&gt;Microsoft Service Configuration Editor&lt;/strong&gt; yardımıyla da oluşturulabilir. Bu yol izlenirse eğer, daha &amp;ouml;nceden değinilen &lt;strong&gt;TCP&lt;/strong&gt;, &lt;strong&gt;HTTP&lt;/strong&gt;, &lt;strong&gt; Named-Pipes, Peer To Peer&lt;/strong&gt; gibi bağlantılardan farklı olarak bağlayıcı tip se&amp;ccedil;ilirken aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi &lt;strong&gt;MSMQ&lt;/strong&gt; se&amp;ccedil;ilmelidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk231_6.gif" alt="" width="591" height="486" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Yapılan bu se&amp;ccedil;imin ardından editor, istemcilerin &lt;strong&gt;MSMQ&lt;/strong&gt; yada &lt;strong&gt;WCF&lt;/strong&gt; tabanlı bir uygulama olup olmadığı sorulacaktır. Daha &amp;ouml;ncedende belirtildiği gibi, &lt;strong&gt;WCF End Point&lt;/strong&gt;' leri arasında yada bir &lt;strong&gt;WCF End Point&lt;/strong&gt; ile bir MSMQ uygulaması arasında mesaj kuyruğu tabanlı iletişim sağlanabilmektedir. Bu se&amp;ccedil;ime g&amp;ouml;re kullanılacak olan &lt;strong&gt;bağlayıcı tip(Binding Type)&lt;/strong&gt; belirlenmektedir. &amp;Ouml;rnekte &lt;strong&gt;netMsmqBinding&lt;/strong&gt; ele alınmıştır. Bir başka deyişle WCF istemcileri ile MSMQ &amp;uuml;zerinden konuşacak bir servis tasarlanmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk231_7.gif" alt="" width="591" height="486" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu se&amp;ccedil;imin ardından adres bilgisinin girilmesi gerekir. &lt;strong&gt;MSMQ&lt;/strong&gt; kullanıldığı i&amp;ccedil;in s&amp;ouml;z konusu adres aslında yerel makinedeki fiziki bir adresi işaret etmelidir. Burada &amp;ouml;rnek olarak aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan adres tanımı kullanılmaktadır. Bir başka deyişle, yerel makinede yer alan &amp;ouml;zel SiparisKuyrugu isimli kuyruk(Queue) adres olarak ele alınmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk231_8.gif" alt="" width="543" height="206" border="0" /&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;Burada &amp;uuml;zerinde durulması gereken noktalardan biriside şudur. SiparisKuyrugu isimli &lt;strong&gt;private&lt;/strong&gt; kuyruk nasıl oluşturulmuştur? Bunun i&amp;ccedil;in sistemde &lt;strong&gt;MSMQ&lt;/strong&gt;' nun kurulu olması elbette şarttır. &lt;strong&gt;MSMQ&lt;/strong&gt;' nun kurulması halinde &amp;ouml;rneğin &lt;strong&gt;Vista&lt;/strong&gt; işletim sistemi &amp;uuml;zerinde &lt;strong&gt;Microsoft Management Console&lt;/strong&gt; a&amp;ccedil;ılarak &lt;strong&gt;Meesage Queuing&lt;/strong&gt; klas&amp;ouml;r&amp;uuml;ne gidilir. Ardından men&amp;uuml;den &lt;strong&gt;New-&amp;gt;Private Queue&lt;/strong&gt; se&amp;ccedil;enği işaretlenir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk231_9.gif" alt="" width="374" height="190" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından, &lt;strong&gt;New Private Queue &lt;/strong&gt;&amp;ouml;ğesinden yararlanarak kuyruğun adı girilir. &amp;Ouml;rnek uygulamada &lt;strong&gt;ExactlyOnce&lt;/strong&gt; &amp;ouml;zelliğine &lt;strong&gt;true&lt;/strong&gt; değeri atanmıştır. Bu, mesajların yanlız bir tane gitmesini ve alınmasını sağlamaktadır. Yani tekrar eden mesajların &amp;ouml;n&amp;uuml;ne ge&amp;ccedil;ilmektedir. Ancak bunun i&amp;ccedil;in &lt;strong&gt;MSMQ&lt;/strong&gt;' nun &lt;strong&gt;transactional&lt;/strong&gt; destekli oluşturulması gerekir. Bu nedenle &lt;strong&gt;Transactional&lt;/strong&gt; se&amp;ccedil;eneği işaretlenmelidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk231_10.gif" alt="" width="394" height="237" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sonu&amp;ccedil; olarak işlemler tamamlandığında, ilk haliyle aşağıdaki gibi bir sonu&amp;ccedil; ortaya &amp;ccedil;ıkacaktır. (Servis uygulaması &amp;ccedil;alıştırıldıktan sonra burada &lt;strong&gt;retry&lt;/strong&gt; isimli bir alt klas&amp;ouml;r daha oluşturulduğu g&amp;ouml;r&amp;uuml;lebilir.)&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk231_11.gif" alt="" width="201" height="159" border="0" /&gt;&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Burada &lt;strong&gt;private&lt;/strong&gt;' ın &amp;ouml;zel bir anlamı vardır. Bu tanımlamaya g&amp;ouml;re mesaj kuyruğunun, servis uygulamasının &amp;ccedil;alıştığı yerel makinede saklanacağı belirtilmektedir. Ancak &lt;strong&gt;Windows Domain&lt;/strong&gt;' e dahil edilmiş bir kuyruk tanımlaması &lt;strong&gt;public&lt;/strong&gt; olarak yapılarak başka bilgisayarlarında aynı kuyruğu kullanmaları sağlanabilir. Bu &amp;ouml;zellikle ağa &amp;ccedil;ıkarak hedef kuyruk ile doğrudan konuşamayan alt yapılarda işe yarayabilir. Nitekim b&amp;ouml;ylece ağa &amp;ccedil;ıkamayan istemciler aslında public lokasyonda duran bir kuyruğa mesajlarını g&amp;ouml;nderirler. Bu kuyruğun bulunduğu makinede kuyruktaki mesajları hedef servise y&amp;ouml;nlendirir.&lt;/p&gt;
&lt;p&gt;Konfigurasyon i&amp;ccedil;erisinde kullanılan bazı &amp;ouml;nemli ayarlar bulunmaktadır. Bu &amp;ouml;zelliklerin kısa a&amp;ccedil;ıklamaları aşağıdaki tabloda g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibidir.&lt;/p&gt;
&lt;table style="border-collapse: collapse; width: 635px;" border="1" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td style="width: 174px; background-color: #ffffff;" bgcolor="#336699" width="174"&gt;&lt;strong&gt; &amp;Ouml;zellik&lt;/strong&gt;&lt;/td&gt;
&lt;td style="width: 174px; background-color: #ffffff;" bgcolor="#336699" width="438"&gt;&lt;strong&gt; A&amp;ccedil;ıklama&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="174"&gt;&lt;strong&gt;Durable&lt;/strong&gt;&lt;/td&gt;
&lt;td width="438"&gt;&lt;strong&gt;true&lt;/strong&gt; veya &lt;strong&gt;false&lt;/strong&gt; değerini alabilir. True olması halinde mesajların fiziki diskte saklanacağı belirtilir. Bu &lt;strong&gt;I/O &lt;/strong&gt;işlemlerinin yoğun şekilde kullanılmasını gerektirmektedir. Dolayısıyla sistemin en iyi performansının elde edilmesinde genellikle false olarak ayarlanır. Ne varki false değer verilmesi halinde mesajlar &lt;strong&gt;Volatile&lt;/strong&gt; olarak tutulurlar. Bir başka deyişle makine kapatılıp a&amp;ccedil;ıldığında Volatile mesajlara ulaşılamaz.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="174"&gt;&lt;strong&gt;ExactlyOnce&lt;/strong&gt;&lt;/td&gt;
&lt;td width="438"&gt;&lt;strong&gt;true&lt;/strong&gt; veya &lt;strong&gt;false&lt;/strong&gt; değer alabilir. True olması halinde sistemde hareket eden mesajların tekrar edilmeyeceği garanti altına alınır. Bir başka deyişle mesajlar kaybolmaz veya yanlışlıklada olsa iki kere g&amp;ouml;nderilmez. Bu &amp;ouml;zelliğin true olmasının bir şartıda kuyruğun transactional olarak tanımlanma zorunluluğudur.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="174"&gt;&lt;strong&gt;Security kısmından Mode&lt;/strong&gt;&lt;/td&gt;
&lt;td width="438"&gt;&lt;strong&gt;MSMQ&lt;/strong&gt; normalde iletişim&lt;strong&gt;(Transport Level) &lt;/strong&gt;ve mesaj&lt;strong&gt;(Message Level)&lt;/strong&gt; seviyesinde g&amp;uuml;venlik kullanımına izin verir. Ancak kendisine ait bir iletişim g&amp;uuml;venliği s&amp;ouml;z konusu olduğundan &lt;strong&gt;SSL&lt;/strong&gt; kullanılmasını gerektirmez. Mesaj seviyesinde g&amp;uuml;venlik ayarları yapıldığında tek şart vardır o da sertifika desteğinin MSMQ i&amp;ccedil;in sağlanmış olması gerekmektedir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="174"&gt;&lt;strong&gt; ReceiveRetryCount&lt;/strong&gt;&lt;/td&gt;
&lt;td width="438"&gt;Kuyruktan uygulamaya doğru bir mesajın ulaştırılması i&amp;ccedil;in maksimum deneme sayısını belirtir. Varsayılan değeri 5 tir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="174"&gt;&lt;strong&gt;MaxRetryCycles&lt;/strong&gt;&lt;/td&gt;
&lt;td width="438"&gt;Bir mesaj uygulama kuyruğundan retry &lt;strong&gt;alt kuyruğuna(SubQueue)&lt;/strong&gt; transfer edildiğinde, &lt;strong&gt;RetryCycleDelay&lt;/strong&gt; s&amp;uuml;resinden sonra uygulama kuyruğunda işlenmek &amp;uuml;zere tekrardan g&amp;ouml;nderdilir. Buradaki tekrar sayısı &lt;strong&gt;MaxRertyCycle&lt;/strong&gt; ile belirlenir. Varsayılan değeri 2 dir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="174"&gt;&lt;strong&gt;RetryCycleDelay&lt;/strong&gt;&lt;/td&gt;
&lt;td width="438"&gt;&lt;strong&gt;RetryCycle&lt;/strong&gt;' lar arasındaki s&amp;uuml;redir. Varsayılan olarak &lt;strong&gt;30&lt;/strong&gt; dakikadır. Bir başka deyişle &lt;strong&gt;retry&lt;/strong&gt; &lt;strong&gt;alt&lt;/strong&gt; &lt;strong&gt;kuyruğundan&lt;/strong&gt; uygulama kuyruğuna ne kadar s&amp;uuml;rede bir g&amp;ouml;nderilme denemesi yapılacağı belirtilir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td valign="top" width="174"&gt;&lt;strong&gt; ReceiveErrorHandling&lt;/strong&gt;&lt;/td&gt;
&lt;td width="438"&gt;Maksimum ulaştırma sayısı aşılıp hata oluşması halinde nasıl bir etki olacağı belirtilir. Varsayılan olarak bu değer &lt;strong&gt;Fault&lt;/strong&gt; şeklindedir. Yani uygulamaya bir istisna mesajı fırlatılacaktır. Diğer değerleri ise &lt;strong&gt;Drop&lt;/strong&gt;, &lt;strong&gt;Reject&lt;/strong&gt; ve &lt;strong&gt;Move&lt;/strong&gt;' dur. Vakaya g&amp;ouml;re uygun olan değerin se&amp;ccedil;ilmesi gerekmektedir.&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td colspan="2" width="612"&gt;&lt;em&gt; (Burada s&amp;ouml;z konusu olan &lt;strong&gt;ReceiveRetryCount, MaxRetryCycles, RetryCycleDelay, ReceiveErrorHandling&lt;/strong&gt; &amp;ouml;zellikleri &lt;strong&gt;zehirli mesajların ele alınması-Poison Message Handling&lt;/strong&gt; i&amp;ccedil;in &amp;ouml;nemlidir)&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;strong&gt;Servis tarafı uygulama kodları;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using SiparisKutuphanesi;

namespace Servis
{
    class Program
    {
        static void Main(string[] args)
        {
            ServiceHost host = new ServiceHost(typeof(SiparisYonetici));
            host.Open();
            Console.WriteLine(host.State.ToString());
            Console.WriteLine("Kapatmak i&amp;ccedil;in bir tuşa basınız.");
            Console.ReadLine();
            host.Close();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Artık istemci tarafı programlanmaya başlanabilir. İstemci uygulamada basit bir &lt;strong&gt;Console&lt;/strong&gt; uygulaması olarak tasarlanabilir. İstemci i&amp;ccedil;in gerekli &lt;strong&gt;Proxy&lt;/strong&gt; sınıfının &amp;uuml;retimi i&amp;ccedil;in &lt;strong&gt;SvcUtil.exe &lt;/strong&gt;aracından aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde olduğu gibi faydalanmak gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk231_12.gif" alt="" width="640" height="377" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu işlemin ardından istemci uygulamanın kodları ve konfigurasyon i&amp;ccedil;eriği aşağıdaki gibi d&amp;uuml;zenlenmelidir.&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;İstemci tarafı konfigurasyon dosyası;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;?xml version="1.0" encoding="utf-8" ?&amp;gt;
&amp;lt;configuration&amp;gt;
    &amp;lt;system.serviceModel&amp;gt;
        &amp;lt;bindings&amp;gt;
            &amp;lt;netMsmqBinding&amp;gt;
                &amp;lt;binding name="SiparisIstemciBindingConfig" receiveTimeout="00:10:00" maxRetryCycles="2" receiveErrorHandling="Fault" receiveRetryCount="5" retryCycleDelay="00:30:00"&amp;gt;
                    &amp;lt;security mode="None" /&amp;gt;
                &amp;lt;/binding&amp;gt;
            &amp;lt;/netMsmqBinding&amp;gt;
        &amp;lt;/bindings&amp;gt;
        &amp;lt;client&amp;gt;
            &amp;lt;endpoint address="net.msmq://localhost/private/SiparisKuyrugu" binding="netMsmqBinding" bindingConfiguration="SiparisIstemciBindingConfig" contract="SiparisServisi" name="SiparisIstemciEndPoint"&amp;gt;
            &amp;lt;/endpoint&amp;gt;
        &amp;lt;/client&amp;gt;
    &amp;lt;/system.serviceModel&amp;gt;
&amp;lt;/configuration&amp;gt;&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;İstemci tarafı kodları;&lt;/strong&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;

namespace Istemci
{
    class Program
    {
        static void Main(string[] args)
        {
            SiparisServisiClient client = new SiparisServisiClient("SiparisIstemciEndPoint");
            Console.WriteLine("Başlamak i&amp;ccedil;in bir tuşa basınız...");
            client.SiparisEt(1, 100);
            client.SiparisEt(2, 100);
            Console.WriteLine("Kapatmak i&amp;ccedil;in bir tuşa basınız...");
            Console.ReadLine();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Gelelim test aşamasına. İlk olarak istemci uygulamanın &amp;ccedil;alıştırıldığı varsayılsın. Bu noktada servisin &amp;ccedil;alışmadığı d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Bu durumda uygulamadaki fonksiyonellikler &amp;ccedil;alışacak ve metod &amp;ccedil;ağrılarına ait mesajlar kuyruğa yazılacaktır. Bu mesajlar &lt;strong&gt; Microsoft Management Console&lt;/strong&gt; yardımıyla &lt;strong&gt;SiparisKuyrugu&lt;/strong&gt; isimli kuyruktan aşağıdaki gibi g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk231_13.gif" alt="" width="636" height="381" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi iki metod &amp;ccedil;ağrısı sonrası oluşan mesajlar &lt;strong&gt;SiparisKuyrugu&lt;/strong&gt; isimli kuyruğa atılmıştır. Bunların i&amp;ccedil;eriklerinede bakılabilir. Bu i&amp;ccedil;erikte tahmin edileceği gibi, mesajın hedef(Target) ve kaynak(Source) alıcıları, mesaj i&amp;ccedil;eriği gibi bilgiler yer almaktadır. Bu noktadan sonra servis uygulaması tekrardan &amp;ccedil;alıştırılırsa kuyruktaki mesajların toplandığı ve işletildiği tespit edilebilir. Nitekim servis uygulaması &amp;ccedil;alıştırıldıktan sonra SiparisKuyrugu altında başka bir mesaj g&amp;ouml;r&amp;uuml;nmeyecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk231_14.gif" alt="" width="532" height="381" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Buraya kadar anlatılanlar ile &lt;strong&gt;WCF&lt;/strong&gt; mimarisinde basit olarak MSMQ bazlı uygulamaların nasıl geliştirilebileceği incelenmeye &amp;ccedil;alışılmıştır. &lt;strong&gt;MSMQ&lt;/strong&gt;' nunda bazı dezavantajları elbetteki vardır. Herşeyden &amp;ouml;nce tek y&amp;ouml;nl&amp;uuml; bir iletişimin olması, diğer iletişim tekniklerine g&amp;ouml;re daha yavaş &amp;ccedil;alışması(&amp;ouml;zellikle kuyruğun fiziki olarak tutulması nedeni ile) bu dezavantajlar arasında sayılabilir.&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;MSMQ kullanılacağı yerlerde en iyi senaryoları elde edebilmek i&amp;ccedil;in bazı kriterlere dikkat etmek gerekebilir. S&amp;ouml;z gelimi &lt;strong&gt;hızlı ve y&amp;uuml;ksek performanslı bir mesajlaşma(Fast-Best Effort Queued Messaging)&lt;/strong&gt; i&amp;ccedil;in &lt;strong&gt;transaction bazlı olmayan(Non-Transactional) &lt;/strong&gt;kuyruklar tercih edilmeli ve buna g&amp;ouml;re &lt;strong&gt;ExactlyOnce&lt;/strong&gt; &amp;ouml;zelliği ile &lt;strong&gt;Durable&lt;/strong&gt; &amp;ouml;zelliklerinin değeri &lt;strong&gt;false&lt;/strong&gt; yapılmalıdır.&lt;/p&gt;
&lt;p&gt;G&amp;uuml;venilir olarak noktadan noktaya bir &lt;strong&gt;mesajlaşma s&amp;ouml;z konusu ise(Reliable End-To-End Queued Messaging)&lt;/strong&gt;, d&amp;ouml;rt alternatif vardır. &lt;strong&gt;BasicTransfer&lt;/strong&gt;, &lt;strong&gt;Transactional Based&lt;/strong&gt;, &lt;strong&gt;Dead-Letter Based &lt;/strong&gt;ve &lt;strong&gt;Poison Message Based&lt;/strong&gt;. Bu alternatiflerden hangisinin kullanılacağına g&amp;ouml;re yine konfigurasyon elemanlarında bazı değişiklikler yapılmalıdır.&lt;/p&gt;
&lt;p&gt;WCF tabanlı olmayan uygulamalar ile haberleşebilmek i&amp;ccedil;in &lt;strong&gt;msmqIntegrationBinding&lt;/strong&gt; tipinin kullanmak gerekmektedir. Buda servisin &lt;strong&gt;interoperability&lt;/strong&gt; desteği olmasını sağlamaktadır.&lt;/p&gt;
&lt;p&gt;Bu tip en iyi &amp;ccedil;&amp;ouml;z&amp;uuml;mler i&amp;ccedil;in &lt;a href="http://msdn2.microsoft.com/en-us/library/ms731093.aspx"&gt;&lt;strong&gt;http://msdn2.microsoft.com/en-us/library/ms731093.aspx&lt;/strong&gt;&lt;/a&gt; adresinden bilgi alınabilir.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bu makalemizde &amp;ouml;zet olarak &lt;strong&gt;MSMQ&lt;/strong&gt; teknolojisini &lt;strong&gt;WCF&lt;/strong&gt; i&amp;ccedil;erisinde ele aldık. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/MSMQKullanimi.rar"&gt;&amp;Ouml;rnek Uygulama i&amp;ccedil;in Tıklayın&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2007-11-13 12:00:00</pubDate>
  <slug>WCF-MSMQ(MicroSoft-Message-Queue)-ile-Entegrasyon-bsenyurt-com-dan</slug>
  <tags>
    <tag>wcf</tag>
    <tag>windows-communication-foundation</tag>
    <tag>msmq</tag>
  </tags>
  <categories>
    <category>WCF</category>
  </categories>
</post>