<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Duplex Service için Silverlight İstemcisi Geliştirmek</title>
  <description>Hatırlayacağınız üzere bir önceki yazımızda Silverlight istemcilerinin kullanabileceği Duplex WCF Service uygulamalarının nasıl yazılabileceğini incelemeye çalışmıştık. Çok doğal olarak bu işin bir de istemci tarafı bulunmaktadır. İşte bu yazımızda söz konusu istemciyi geliştirmeye çalışacak ve bir önceki yazının yorgunluğunu üzerimizden atarcasına, basit bir şekilde ilerliyor olacağız.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Hatırlayacağınız &amp;uuml;zere &lt;a title="Silverlight istemcileri i&amp;ccedil;in duplex service geliştirmek" href="/post/Silverlight-Istemcileri-icin-Duplex-Service-Gelistirmek" target="_blank"&gt;bir &amp;ouml;nceki yazımızda&lt;/a&gt; &lt;strong&gt;Silverlight &lt;/strong&gt;istemcilerinin kullanabileceği &lt;strong&gt;Duplex WCF Service&lt;/strong&gt; uygulamalarının nasıl yazılabileceğini incelemeye &amp;ccedil;alışmıştık. &amp;Ccedil;ok doğal olarak bu işin bir de istemci tarafı bulunmaktadır. İşte bu yazımızda s&amp;ouml;z konusu istemciyi geliştirmeye &amp;ccedil;alışacak ve bir &amp;ouml;nceki yazının yorgunluğunu &amp;uuml;zerimizden atarcasına, basit bir şekilde ilerliyor olacağız. İlk olarak&lt;strong&gt; Visual Studio 2010 Ultimate RC&lt;/strong&gt; ortamında &lt;strong&gt;Silverlight 4.0&lt;/strong&gt; tabanlı bir uygulama oluşturarak işe başlayabiliriz. Bu işlemin ardından &lt;strong&gt;Proxy &lt;/strong&gt;tabanlı bir WCF servis kullanımı i&amp;ccedil;in &lt;strong&gt;Add Service Reference &lt;/strong&gt;se&amp;ccedil;eneğine başvurmamız gerekecektir. Yine hatırlayacağınız &amp;uuml;zere geliştirdiğimiz &lt;strong&gt;WorldWeatherService &lt;/strong&gt;isimli servisi &lt;strong&gt;IIS &lt;/strong&gt;&amp;uuml;zerine &lt;strong&gt;Publish &lt;/strong&gt;etmiştik. Bu sebepten ilgili servis referansına aşağıdaki şekilden de g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;http://localhost/WorldWeatherService/WeatherDuplexService.svc &lt;/strong&gt;adresinden erişebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f3%2fblg173_AddServiceReference.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İstemci tarafında &amp;ccedil;ok basit olarak aşağıdaki &lt;strong&gt;XAML &lt;/strong&gt;i&amp;ccedil;eriğine sahip bir kontrol kullanıyor olacağız. Buna g&amp;ouml;re istemciler bir şehir adı girerek sunucudan anlık hava durumu bilgilerini alabilecekleri bir aray&amp;uuml;ze sahip olacaklar. Aslında alacaklar demek &amp;ccedil;ok doğru bir tabir değil. Nitekim servisin kendisi, bağlı olan istemci &amp;uuml;zerinde tetiklediği bir operasyona bu bilgileri parametre şeklinde g&amp;ouml;nderiyor olacak.&lt;/p&gt;
&lt;pre class="brush:xml;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;UserControl x:Class="WeatherClientApp.MainPage"
    xmlns="http://schemas.microsoft.com/winfx/2006/xaml/presentation"
    xmlns:x="http://schemas.microsoft.com/winfx/2006/xaml"
    xmlns:d="http://schemas.microsoft.com/expression/blend/2008"
    xmlns:mc="http://schemas.openxmlformats.org/markup-compatibility/2006"
    mc:Ignorable="d"
    d:DesignHeight="230" d:DesignWidth="479"&amp;gt;

    &amp;lt;Grid x:Name="LayoutRoot" Background="White"&amp;gt;
        &amp;lt;Button Content="Start" Height="23" HorizontalAlignment="Left" Margin="207,27,0,0" Name="StartButton" VerticalAlignment="Top" Width="75" Click="StartButton_Click" /&amp;gt;
        &amp;lt;TextBox Height="23" HorizontalAlignment="Left" Margin="25,27,0,0" Name="CityTextBox" VerticalAlignment="Top" Width="165" /&amp;gt;
        &amp;lt;ListBox Height="142" HorizontalAlignment="Left" Margin="24,64,0,0" Name="WeatherStatusListBox" VerticalAlignment="Top" Width="434" /&amp;gt;
    &amp;lt;/Grid&amp;gt;
&amp;lt;/UserControl&amp;gt;&lt;/pre&gt;
&lt;p&gt;İstemci tarafı kodlarına gelince;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ServiceModel;
using System.ServiceModel.Channels;
using System.Windows;
using System.Windows.Controls;
using WeatherClientApp.WeatherServiceReference;

namespace WeatherClientApp
{
    public partial class MainPage : UserControl
    {
        WeatherDuplexServiceClient proxy = null;

        public MainPage()
        {
            InitializeComponent();

            EndpointAddress address = new EndpointAddress("http://localhost/WorldWeatherService/WeatherDuplexService.svc");
            PollingDuplexHttpBinding binding = new PollingDuplexHttpBinding(PollingDuplexMode.MultipleMessagesPerPoll);
            proxy = new WeatherDuplexServiceClient(binding, address);

            proxy.SetCityCompleted += new EventHandler&amp;lt;System.ComponentModel.AsyncCompletedEventArgs&amp;gt;(proxy_SetCityCompleted);
            proxy.NoticeReceived += new EventHandler&amp;lt;NoticeReceivedEventArgs&amp;gt;(proxy_NoticeReceived);
        }

        void proxy_NoticeReceived(object sender, NoticeReceivedEventArgs e)
        {
            WeatherStatus wStatus = e.weather;
            WeatherStatusListBox.Items.Add(String.Format("{0}({1} C){2}", wStatus.City, wStatus.Heat, wStatus.Summary));
        }

        void proxy_SetCityCompleted(object sender, System.ComponentModel.AsyncCompletedEventArgs e)
        {
            WeatherStatusListBox.Items.Add("SetCity &amp;ccedil;ağrısı tamamlandı");
        }

        private void StartButton_Click(object sender, RoutedEventArgs e)
        {
            WeatherStatusListBox.Items.Clear();
            proxy.SetCityAsync(CityTextBox.Text);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;WeatherDuplexServiceClient &lt;/strong&gt;tipinden olan &lt;strong&gt;proxy &lt;/strong&gt;nesnesi &amp;ouml;rneklenirken iki &amp;ouml;nemli parametre bilgisi ge&amp;ccedil;ilmektedir. Bunlardan ilki &lt;strong&gt;PollingDuplexHttpBinding &lt;/strong&gt;tipinden olan &lt;strong&gt;bağlayıcı tiptir(Binding Type)&lt;/strong&gt;. Diğeri ise servise erişilecek olan &lt;strong&gt;Endpoint &lt;/strong&gt;adresidir. İstemci tarafı asenkron olarak &lt;strong&gt;SetCity &lt;/strong&gt;metoduna erişebilir. Bu nedenle &lt;strong&gt;SetCityCompleted &lt;/strong&gt;olay metodu y&amp;uuml;klenmiştir. Dikkat &amp;ccedil;ekici noktalardan birisi de &lt;strong&gt;NoticeReceived &lt;/strong&gt;isimli bir olayın s&amp;ouml;z konusu olmasıdır. Bilinen &lt;strong&gt;Completed &lt;/strong&gt;son eki yerine &lt;strong&gt;Received &lt;/strong&gt;son ekinin gelmesinin de bir anlamı vardır elbette.&amp;nbsp;&lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Bu, istemcinin servisten gelen &lt;strong&gt;Notice &lt;/strong&gt;&amp;ccedil;ağrısını takiben devreye girecek operasyon ile alakalıdır. Bir başka deyişle servis tarafı &lt;strong&gt;Notice &lt;/strong&gt;metodunu &amp;ccedil;ağırdıktan ve bu operasyon işleyişini tamamladıktan sonra istemci tarafında &lt;strong&gt;proxy_NoticeReceived &lt;/strong&gt;olay metodu devreye girecektir. Ayrıca, bu olay metodunun &lt;strong&gt;NoticeReceivedEventArgs &lt;/strong&gt;tipinden olan parametresi &amp;uuml;zerinden yakalanan&lt;strong&gt; weather &lt;/strong&gt;&amp;ouml;zelliği yardımıyla, servisin g&amp;ouml;nderdiği &lt;strong&gt;WeatherStatus &lt;/strong&gt;nesnesine ulaşılabilir. Sonu&amp;ccedil; olarak uygulamayı test ettiğimizde &amp;ouml;rnek olarak aşağıdakine benzer bir sonu&amp;ccedil; elde ettiğimizi g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f3%2fblg172_Runtime.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Uuml;&amp;ccedil; sonu&amp;ccedil; gelmesi tamamen servis tarafındaki zamanlama ayarları ile alakalı bir durumdur. Bu s&amp;uuml;relerde oynayarak servisin istemci tarafına ka&amp;ccedil; kere bildirimde bulunacağını da ayarlayabilirsiniz. &amp;Ouml;nemli olan nokta servisin istemci &amp;uuml;zerinde bir operasyon tetiklemesidir. Bunu yazdığımız istemci ile test etmiş olduk.&lt;/p&gt;
&lt;p&gt;T&amp;uuml;m bu &amp;ccedil;alışma sırasında dikkat edilmesi gereken bir husus da, &amp;ouml;nceki yazımızda da değinmiş olduğumuz &lt;strong&gt;Client Access Policy&lt;/strong&gt; kullanımıdır. Eğer &lt;strong&gt;IIS &lt;/strong&gt;root klas&amp;ouml;r&amp;uuml; altında &lt;strong&gt;ClientAccessPolicy.xml &lt;/strong&gt;dosyası ve gerekli i&amp;ccedil;eriği olmassa &amp;ccedil;alışma zamanında aşağıdaki hata mesajı ile karşılaşılacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2010%2f3%2fblg172_Exception.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Oysaki geliştirdiğimiz &amp;ouml;rnek&lt;strong&gt; Asp.Net Development Server&lt;/strong&gt; &amp;uuml;zerinden yayınlanmaktadır&lt;em&gt;(http://localhost:22334/WeatherClientAppTestPage.aspx)&lt;/em&gt; ve sorunsuz bir şekilde &lt;strong&gt;IIS &lt;/strong&gt;&amp;uuml;zerindeki &lt;strong&gt;WorldWeatherService &lt;/strong&gt;uygulamasına erişebilmektedir. Dolayısıyla Silverlight uygulamalarında sık&amp;ccedil;a rastladığımız &lt;strong&gt;Cross Domain &lt;/strong&gt;sorunu yaşanmamaktadır. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f3%2fWeatherClientApp.rar"&gt;WeatherClientApp.rar (540,12 kb)&lt;/a&gt; &lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 RC s&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;uuml;zerinde geliştirilmiş ve test edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2010-07-05 01:00:00</pubDate>
  <slug>Duplex-Service-icin-Silverlight-Istemcisi-Gelistirmek</slug>
  <tags>
    <tag>wcf</tag>
    <tag>silverlight</tag>
    <tag>wcf-service</tag>
    <tag>duplex-service</tag>
    <tag>duplex-communication</tag>
    <tag>push</tag>
  </tags>
  <categories>
    <category>Silverlight 4.0</category>
    <category>WCF</category>
  </categories>
</post>