<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Sabit Değer Tipleri (Immutable Value Types) Analizi</title>
  <description>Immutable (sabit) tipler basit olarak tanımlandıktan sonra varlıkları asla değişmeyen türler olarak nitelendirilebilirler. Sabit bir tipe ait bir nesne örneğini oluşturduğunuzda, bu tipin içeriği asla değişmez. Ancak bir tipin sabit olup olmayacağına karar vermek gerçekten zordur. Bu karar mekanizmasında, tipin sahip olduğu veri içeriğinin atomik (atomic) yapısı oldukça önemlidir. Atomiklik, bir tipin sahip olduğu verisel bütünlüğü oluşturan her bir elemanın aralarındaki ilişki olarak tanımlanabilir. Bu noktada bir tipin atomik olup olmaması, sabit bir tip haline getirilip getirilmemesinde önemli bir karar mekanizmasıdır.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Immutable (sabit) tipler basit olarak tanımlandıktan sonra varlıkları asla değişmeyen t&amp;uuml;rler olarak nitelendirilebilirler. Sabit bir tipe ait bir nesne &amp;ouml;rneğini oluşturduğunuzda, bu tipin i&amp;ccedil;eriği asla değişmez. Ancak bir tipin sabit olup olmayacağına karar vermek ger&amp;ccedil;ekten zordur. Bu karar mekanizmasında, tipin sahip olduğu veri i&amp;ccedil;eriğinin atomik (atomic) yapısı olduk&amp;ccedil;a &amp;ouml;nemlidir. Atomiklik, bir tipin sahip olduğu verisel b&amp;uuml;t&amp;uuml;nl&amp;uuml;ğ&amp;uuml; oluşturan her bir elemanın aralarındaki ilişki olarak tanımlanabilir. Bu noktada bir tipin atomik olup olmaması, sabit bir tip haline getirilip getirilmemesinde &amp;ouml;nemli bir karar mekanizmasıdır.&lt;/p&gt;
&lt;p&gt;Atomik yapıyı anlamak i&amp;ccedil;in, bir tipin i&amp;ccedil;erisinde yer alan alanların aralarındaki ilişkiyi kavramamız &amp;ccedil;ok &amp;ouml;nemlidir. &amp;Ouml;rneğin, Muhendis isimli bir tipimiz olduğunu d&amp;uuml;ş&amp;uuml;nelim. Tipimizin ID, Ad, Soyad, Pozisyon gibi bilgileri bardındırdığını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. Bir m&amp;uuml;hendisin şirket i&amp;ccedil;in ge&amp;ccedil;erli olan ID bilgisi değişebilir. Ancak bu değişikliğin Ad,Soyad veya Pozisyon alanları &amp;uuml;zerinde herhangibir etkisi yoktur. Benzer şekilde, bir m&amp;uuml;hendisin pozisyonuda değişebilir. Ancak bu değişikliğin Id,Ad,Soyad alanları &amp;uuml;zerinde bir etkisi yoktur. Kısacası, Muhendis tipinin veri i&amp;ccedil;eriğini oluşturan alanların birbirleri &amp;uuml;zerinde her hangibir bağlayıcı etkisi yoktur. Bu nedenle Muhendis tipinin atomik olmayan bir veri i&amp;ccedil;eriği sunduğunu s&amp;ouml;yleyebiliriz. Bu da ilgili tipin verileri arasında tutarlılık olmasını gerektirmeyecek bir olgudur.&lt;/p&gt;
&lt;table id="table30" style="border-collapse: collapse;" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Bir tipin verisel i&amp;ccedil;eriğini oluşturan alanarının birbirleri &amp;uuml;zerinde &lt;strong&gt;herhangibir etkisi yok ise&lt;/strong&gt;, atomik olmayan bir yapı s&amp;ouml;z konusudur.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Şimdi bir de Saat, Dakika ve Saniye bilgilerini barındırdan Zaman isimli başka bir nesne modelini ele almaya &amp;ccedil;alışalım. Zaman tipi i&amp;ccedil;erisinde yer alan Saat, Dakika ve Saniye alanlarının herhangibirinde yapılacak olan değişiklik, diğerlerinide etkileyebilecek cinstendir. &amp;Ouml;rneğin saniyenin 60' dan b&amp;uuml;y&amp;uuml;k olması halinde, dakika alanı &amp;uuml;zerindede g&amp;uuml;ncelleştirme yapılması gerekir. Aynı durum dakika alanı &amp;uuml;zerinde yapılan değişiklikler i&amp;ccedil;inde ge&amp;ccedil;erlidir. Dakikanın 60' tan b&amp;uuml;y&amp;uuml;k olması halinde bu kez saat alanının g&amp;uuml;ncelleştirilmesi gerekir. Dolayısıyla, Zaman tipi i&amp;ccedil;erisinde yer alan alanların bir birlerini doğrudan etkilediğini s&amp;ouml;yleyebiliriz. İşte bu etkileşim nedeni ile Zaman tipinin Atomik bir veri i&amp;ccedil;eriği sunduğunu s&amp;ouml;yleyebiliriz. &amp;Ouml;yleki, verilerin tutarlı olması gerekmektedir.&lt;/p&gt;
&lt;table id="table31" style="border-collapse: collapse;" border="1" width="100%" cellspacing="0" cellpadding="5"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;Bir tipin verisel i&amp;ccedil;eriğini oluşturan alanlarının birbirleri &amp;uuml;zerinde &lt;strong&gt;etkisi var ise&lt;/strong&gt;, atomik bir yapı s&amp;ouml;z konusudur.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;&lt;img src="/makale/images/mk147_1.gif" alt="" width="496" height="241" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Peki bir tipin i&amp;ccedil;erisinde yer alan veriler arasındaki atomik yapının sabit(Immutable) bir tip i&amp;ccedil;in &amp;ouml;nemi nedir? Herşeyden &amp;ouml;nce, atomik veri yapısına sahip bir tip i&amp;ccedil;in, &amp;ccedil;alışma zamanında nesne &amp;ouml;rneği &amp;uuml;zerinde yapılacak her değişiklik &amp;ouml;nemlidir. Nitekim nesne &amp;ouml;rneği &amp;uuml;zerinden hareket ettiğimizde, her hangibir alanın değerinin değiştirilmesi, atomik zincir i&amp;ccedil;erisinde yer alan diğer alanlarıda etkileyebilir. Bu ise &amp;ouml;zellikle &amp;ccedil;ok kanallı uygulamalarda, farklı kullanıcıların değişik zamanlarda aynı nesne &amp;ouml;rneğinin tutarsız farklı veri g&amp;ouml;r&amp;uuml;nt&amp;uuml;lerine bakmasına neden olabilir. &amp;Ouml;zellikle bu gibi durumlarda, tipin i&amp;ccedil;eriğinin referans yolu ilede etkilenmesine izin vermemeye &amp;ccedil;alışırız. Bu ama&amp;ccedil;la kullanılabilecek en uygun t&amp;uuml;r struct tipidir. Durumu daha iyi analiz edebilmek i&amp;ccedil;in, Zaman isimli aşağıdaki gibi bir yapımız (struct) olduğunu d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk147_2.gif" alt="" width="214" height="226" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;struct Zaman
{
    private int _Saat;
    private int _Dakika;
    private int _Saniye;
    
    public int Saat
    {
        get { return _Saat; }
        set { _Saat = value; }
    }
    public int Dakika
    {
        get { return _Dakika; }
        set { _Dakika = value; }
    }
    public int Saniye
    {
        get { return _Saniye; }
        set { _Saniye = value; }
    }
}&lt;/pre&gt;
&lt;p&gt;Zaman isimli tipimize ait herhangibir nesne &amp;ouml;rneğini &amp;ccedil;alışma zamanında aşağıdaki gibi kullanmaya &amp;ccedil;alıştığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Main(string[] args)
{
    Zaman zmn = new Zaman();
    zmn.Saat = 12;
    zmn.Dakika = 30;
    zmn.Saniye = 56;

    // Var olan nesne &amp;ouml;rneği &amp;uuml;zerinde değişiklik yapılıyor.
    zmn.Saniye = 64;
    zmn.Dakika = 66;
}&lt;/pre&gt;
&lt;p&gt;Burada ilk olarak Zaman tipinden bir nesne &amp;ouml;rneğini oluşturuyoruz. Daha sonra var olan nesne &amp;ouml;rneği &amp;uuml;zerindeki verilerde tip i&amp;ccedil;erisindeki &amp;ouml;zelliklerimizi (properties) kullanarak değişiklikler yapıyoruz. İşte bu noktada verinin tutarlılığını farklı s&amp;uuml;re&amp;ccedil;lerdeki kullanıcılar i&amp;ccedil;in bozmuş oluyoruz. Başka bir deyişle, farklı kullanıcların farklı zamanlarda bu tipin farklı g&amp;ouml;r&amp;uuml;nt&amp;uuml;lerine bakabilecekleri bir durumla karşı karşıyayız. &lt;em&gt;(Burada saniyenin veya dakikanın 60' dan b&amp;uuml;y&amp;uuml;k olması sonrası yapılması gerekenler ele alınmamıştır.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle &amp;uuml;zerinde durmamız gereken nokta Zaman tipine ait nesne &amp;ouml;rneğinin veri tutarlılığının nasıl korunabileceğidir. &amp;Ccedil;ok kanallı ortamlarda eş zamanlı &amp;ccedil;alışan kullanıcılar a&amp;ccedil;ısından uygulamanın &amp;ccedil;alışmasının değişik zamanlarında Zaman nesnesinin tutarlılığını korumak i&amp;ccedil;in neler yapılabilir? Bunu sağlamanın bir ka&amp;ccedil; yolu olabilir. Ancak en garantisi var olan yapımızı, sabit bir değer t&amp;uuml;r&amp;uuml; (Immutable Value Type) haline getirmektir. Zaman yapımızı sabit değer tipi haline getirmek i&amp;ccedil;in ilk olarak dışarıdan &amp;ouml;zellikler vasıtasıyla yapılan değer atamalarını ortadan kaldırmamız ve kontrol&amp;uuml; tek bir noktada, dolayısıyla bir yapıcı metod i&amp;ccedil;erisinde toplamamız gerekmektedir. Buna g&amp;ouml;re yapımızı aşağıdaki hale getirebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk147_3.gif" alt="" width="219" height="271" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;struct Zaman
{
    private readonly int _Saat;
    private readonly int _Dakika;
    private readonly int _Saniye;

    public int Saat
    {
        get { return _Saat; }
    } 
    public int Dakika
    {
        get { return _Dakika; }
    }
    public int Saniye
    {
        get { return _Saniye; }
    }
    public Zaman(int sa, int da, int sn)
    {
        _Saat = sa;
        _Dakika = da;
        _Saniye = sn;
        ZamanKontrol();
    }
    private void ZamanKontrol()
    {
        // Artık s&amp;uuml;relerin kontrol&amp;uuml; ve değerlendirilmesi
    }
}&lt;/pre&gt;
&lt;p&gt;Dikkat ederseniz, alanlarımızı sadece okunabilir(read only) olarak tanımladık. Diğer taraftan &amp;ouml;zelliklerimize ait set bloklarını kaldırarak dışarıdan değer atanmasını engelledik. Nesne alanlarına değer atayabileceğimiz en uygun yer olaraktanda aşırı y&amp;uuml;klenmiş yapıcı metodumuzu kullandık. ZamanKontrol isimli metodumuz artık s&amp;uuml;releri hesap ederek alanların atomik yapısı &amp;ccedil;er&amp;ccedil;evesinde gerekli veri tutarlılığını sağlayacak kodları i&amp;ccedil;ermektedir. Sonu&amp;ccedil; itibariyle artık elimizde kullanışlı bir sabit değer t&amp;uuml;r&amp;uuml; (Immutable Value Type) vardır. Artık Zaman yapısına ait bir nesne &amp;ouml;rneğini oluşturduğumuzda var olan nesne i&amp;ccedil;eriğini değiştirebilmemizin tek yolu nesne &amp;ouml;rneğini yeniden oluşturmaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Zaman zmn = new Zaman(10, 12, 16);

// Var olan nesne &amp;ouml;rneğinin i&amp;ccedil;eriğini ancak yeniden oluşturarak değiştirebiliriz.
// zmn.Saniye = 64;
// zmn.Dakika = 66;

zmn = new Zaman(4, 5, 6);&lt;/pre&gt;
&lt;p&gt;Burada ilk olarak Zaman yapısına ait bir nesne &amp;ouml;rneği oluşturulmuştur. Artık bu nesne var olan s&amp;uuml;re&amp;ccedil;ler i&amp;ccedil;erisinde tektir ve i&amp;ccedil;eriği sabittir. Dahası, i&amp;ccedil;eriğin veri tutarlılığı bu nesne &amp;ouml;rneğine bakan herkes i&amp;ccedil;in sağlanmıştır. Eğer, var olan i&amp;ccedil;erik &amp;uuml;zerinde değişiklik yapmak istersek tek yolumuz vardır ki buda nesneyi yeniden &amp;ouml;rneklendirmekten ge&amp;ccedil;mektedir.&lt;/p&gt;
&lt;p&gt;Sabit değer t&amp;uuml;rlerinde dikkat edilmesi gereken bir diğer hususda i&amp;ccedil;eride yer alan referans t&amp;uuml;rl&amp;uuml; alanların kontrol&amp;uuml;d&amp;uuml;r. Nitekim referans t&amp;uuml;rleri &amp;uuml;zerinde yapılan değişikliklerin etkileri, var olan atomik yapı i&amp;ccedil;erisinde, tutarsızlıklara yol a&amp;ccedil;arak veri b&amp;uuml;t&amp;uuml;nl&amp;uuml;ğ&amp;uuml;n&amp;uuml; bozabilir. &amp;Ouml;rneğin, Zaman yapısını bir dizi olarak başka bir sabit değer tipi i&amp;ccedil;erisinde kullandığımızı d&amp;uuml;ş&amp;uuml;nelim. Diziler Array sınıfından gelen referans tipleridir. Bu tipe ait bir nesne &amp;ouml;rneğinin her hangibir elemanı &amp;uuml;zerinde yapılacak değişiklikler, dizinin kullanıldığı herhangibir tip i&amp;ccedil;erisindede ger&amp;ccedil;ekleşebilir. İşte bu nedenle sabit değer t&amp;uuml;rleri i&amp;ccedil;erisinde &amp;ouml;zellikle diziler kullanıldığında dikkat edilmesi gerekir. Bunu daha iyi anlayabilmek i&amp;ccedil;in aşağıdaki &amp;ouml;rneği g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım. Burada SporcuListesi isimli sabit değer t&amp;uuml;r&amp;uuml;m&amp;uuml;z, i&amp;ccedil;eride Zaman yapısı tipinden (Zaman yapımızda sabit bir değer tipidir) bir diziyide kullanmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk147_4.gif" alt="" width="259" height="196" border="0" /&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;struct SporcuListesi
{
    private readonly Zaman[] zamanlar;

    public SporcuListesi(Zaman[] zmn)
    {
        zamanlar = zmn;
    }
    public IEnumerator ZamanListesi
    {
        get { return zamanlar.GetEnumerator(); }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu haliyle SporcuListesinin sahip olduğu veri i&amp;ccedil;eriğinin tutarlılığının garantiye alınmış olduğu d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Oysaki aşağıdaki uygulama kodları veri tutarlılığını kaybettiğimizi g&amp;ouml;steremektedir. Zaman yapısını her ne kadar sabit değer tipi olarak tanımlamış olsakta, SporcuListesi yapısının verisel b&amp;uuml;t&amp;uuml;nl&amp;uuml;ğ&amp;uuml; ve tutarlılığı i&amp;ccedil;eride bir referans tipi kullanılmasından dolayı bozulmuştur.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void Listele(SporcuListesi liste)
{
    Console.WriteLine("---Varış Zamanları---");
    IEnumerator numb = liste.ZamanListesi;
    while (numb.MoveNext())
    {
        Zaman z = (Zaman)numb.Current;
        Console.WriteLine(z.Saat + " " + z.Dakika + " " + z.Saniye);
    }
}

static void Main(string[] args)
{ 
    Zaman zmn1 = new Zaman(3, 42, 45);
    Zaman zmn2 = new Zaman(3, 43, 31);
    Zaman zmn3 = new Zaman(3, 56, 1);

    Zaman[] zmn = new Zaman[] { zmn1, zmn2, zmn3 };

    SporcuListesi liste = new SporcuListesi(zmn);
    Listele(liste);
    zmn[0] = new Zaman(0, 0, 0);
    Listele(liste);
}&lt;/pre&gt;
&lt;p&gt;Uygulamayı &amp;ccedil;alıştırdığımızda aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;n&amp;uuml; elde ederiz. Dikkat ederseniz SporcuListesi isimli yapıya ait nesne &amp;ouml;rneğimizi oluşturduktan sonra, bu yapı dışında bir yerde zmn isimli dizinin ilk elamanına ait verilerde değişiklik yapılmıştır. SporcuListesi isimli yapımıza ait nesne &amp;ouml;rneği oluşturulduğunda, zmn isimli dizinin referansı, bu yapımız i&amp;ccedil;erisindeki zamanlar isimli dizinin referansıyla eşitlenmiştir. Dolayısılya SporcuListesi yapısına ait nesne &amp;ouml;rneği oluşturulduktan sonra, zmn dizisi ile SporcuListesi isimli sınıf i&amp;ccedil;erisinde kullanılan zamanlar isimli dizi artık aynı referansa sahiptir. Bu nedenle SporcuListesi yapısı dışında zmn dizisi &amp;uuml;zerinde yapılan değişiklikler, zamanlar isimli diziyide etkilyeceğinden, sabit değer t&amp;uuml;r&amp;uuml; olarak tanımlanmış SporcuListesi yapısının verisel tutarlılığı bozulmuştur.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk147_5.gif" alt="" width="284" height="147" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Peki sorunu nasıl &amp;ccedil;&amp;ouml;zebiliriz? Bu sorunu aşmak i&amp;ccedil;in, SporcuListesi isimli sabit değer t&amp;uuml;r&amp;uuml; i&amp;ccedil;erisinde Zaman tipi tabanlı dizimizi kopyalama yolunu se&amp;ccedil;ebiliriz. SporcuListesi yapısında, yapıcı metodumuzu aşağıdaki kod par&amp;ccedil;asında olduğu gibi değiştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim. Bu kez yapıcı metodumuza parametre olarak gelen diziyi doğrudan atamak yerine i&amp;ccedil;eride &amp;ouml;nce zamanlar isimli dizimizi gelen dizinin eleman sayısını baz alarak oluşturuyor ve gelen dizinin elemanlarını bu dizi i&amp;ccedil;erisine 0ncı indeksten itibaren kopyalıyoruz. B&amp;ouml;ylece SporcuListesi yapısını oluştururken, i&amp;ccedil;eride kullanılan dizinin veri tutarlılığını sağlamış oluyor bir başka deyişle dışarıdan yapılan değişikliklerin etkisini ortadan kaldırıyoruz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public SporcuListesi(Zaman[] zmn)
{
    zamanlar = new Zaman[zmn.Length];
    zmn.CopyTo(zamanlar, 0);
}&lt;/pre&gt;
&lt;p&gt;Uygulamamızı tekrardan &amp;ccedil;alıştırırsak, dışarıda yapılan değişikliğin bu kez sabit değer tipimiz i&amp;ccedil;erisinde etkili olmadığını g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk147_6.gif" alt="" width="282" height="145" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi bu kez uygulama kodu i&amp;ccedil;erisinde zmn isimli dizideki değişikliğimiz, SporcuListesi &amp;ouml;rneğindeki zamanlar isimli diziyi etkilememiştir. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2006-02-08 10:00:00</pubDate>
  <slug>Sabit-Değer-Tipleri-(Immutable-Value-Types)-Analizi-bsenyurt-com-dan</slug>
  <tags>
    <tag>c#</tag>
    <tag>type-systems</tag>
    <tag>immutable-types</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>