<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Xml Web Servislerinde Etkili Caching Kullanımı</title>
  <description>Ön-bellekleme (Caching) işlemleri web uygulamaları için ne kadar önemli ise Xml Web Servisleri içinde aynı durum geçerlidir. Ön-bellekleme sistemi sayesinde web uygulamalarının kullanıcıya cevap verme sürelerinin kısaltılması hedeflenmiştir. Bu da doğal olarak uygulamanın performansını arttırıcı bir etkendir. Kaldıki istekler önbellekten (cache) karşılandığı için, arka tarafta yapılan pek çok süreç atlanmaktadır.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;&amp;Ouml;n-bellekleme (Caching) işlemleri web uygulamaları i&amp;ccedil;in ne kadar &amp;ouml;nemli ise Xml Web Servisleri i&amp;ccedil;inde aynı durum ge&amp;ccedil;erlidir. &amp;Ouml;n-bellekleme sistemi sayesinde web uygulamalarının kullanıcıya cevap verme s&amp;uuml;relerinin kısaltılması hedeflenmiştir. Bu da doğal olarak uygulamanın performansını arttırıcı bir etkendir. Kaldıki istekler &amp;ouml;nbellekten (cache) karşılandığı i&amp;ccedil;in, arka tarafta yapılan pek &amp;ccedil;ok s&amp;uuml;re&amp;ccedil; atlanmaktadır. Dolayısıyla database işlemleri gibi maliyeti y&amp;uuml;ksek olan s&amp;uuml;re&amp;ccedil;lerin belirli kriterlere g&amp;ouml;re &amp;ccedil;alıştırılması ve kullanıcının istediği sonu&amp;ccedil;ların en hızlı şekilde verilebilmesi &amp;ouml;n-bellekleme sisteminin getirilerinden sadece birisidir. Web servisleride, web uygulamaları gibi 80 numaralı port &amp;uuml;zerinden hizmet verdiklerinden &amp;ouml;n-bellekleme yetilerine sahiptir. Web uygulamarında kullanılan &amp;ouml;n-bellekleme mantığı ile web servislerinde kullanılan birbirlerine olduk&amp;ccedil;a yakındır. Ancak bir takım farklılıklarda mevcuttur.&lt;/p&gt;
&lt;p&gt;Bildiğiniz gibi, web uygulamalarında &amp;ouml;n-bellekleme (caching) sistemi &lt;strong&gt;Output Caching&lt;/strong&gt; ve &lt;strong&gt;Data Caching&lt;/strong&gt; olmak &amp;uuml;zere iki ana kategoriye ayırlmaktadır. Bir web uygulamasında Output Caching sayfa bazında veya user control bazında kullanılabilir. B&amp;ouml;ylece bir web sayfasının tamamının yada onun k&amp;uuml;&amp;ccedil;&amp;uuml;k bir par&amp;ccedil;asının &amp;ouml;n-bellekte tutulması sağlanabilir. Oysaki aynı durum Web Servislerinde biraz daha farklıdır. Nitekim, web servislerinin kullanıcı ile etkileşimde olan bir aray&amp;uuml;z&amp;uuml; bulunmamaktadır. Buda kontrol veya sayfa bazında &amp;ouml;n-bellekleme işleminin yapılamayacağı anlamına gelmektedir. Bir web servisi s&amp;ouml;z konusu olduğunda &amp;ouml;n belleğe (cache) alınabilecek olan i&amp;ccedil;erik bu servise ait metodların d&amp;ouml;nd&amp;uuml;receği sonu&amp;ccedil; k&amp;uuml;melerinden başka bir şey olmayacaktır. Dolayısıla web servislerinde metod bazında &amp;ouml;n-belleklemenin yapılabileceğini s&amp;ouml;yleyebiliriz. Bunun dışında, web uygulamlarında sık&amp;ccedil;a kullanılan &lt;strong&gt;Data Caching&lt;/strong&gt; tekniği web servisleri i&amp;ccedil;inde ge&amp;ccedil;erlidir. Kaldıki Data Caching tekniğinde &lt;strong&gt;kesin yaşam s&amp;uuml;resi (absolute expire time), hareketli yaşam s&amp;uuml;resi (floating expire time), dosya veya tablo bağımlılığı (cache dependency)&lt;/strong&gt; gibi se&amp;ccedil;eneklerde mevcuttur. Bu se&amp;ccedil;enekler bir web servisi i&amp;ccedil;erisinde etkin bir şekilde uygulandığında kullanıcılara hızlı cevap verebilmenin dışında, var olan sistem kaynaklarınıda daha etkili kullanabilme olanaklarına sahip oluruz. Bir web metodun d&amp;ouml;nd&amp;uuml;receği sonu&amp;ccedil; k&amp;uuml;mesini &amp;ouml;n-belleğe taşımak i&amp;ccedil;in yapılması gereken, WebMethod niteliğini aşağıdaki gibi &lt;strong&gt;CacheDuration&lt;/strong&gt; &amp;ouml;zelliği ile kullanmaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[WebMethod(CacheDuration = 180)]&lt;/pre&gt;
&lt;p&gt;Bu niteliğin uygulandığı web metodun d&amp;ouml;nd&amp;uuml;receği sonu&amp;ccedil;lar 180 saniye (3 dakika) s&amp;uuml;reyle &amp;ouml;n bellekte tutulacaktır. Bu olduk&amp;ccedil;a kullanışlı bir &amp;ouml;zelliktir. Ancak asıl dikkat edilmesi gereken nokta, parametre bağımlı d&amp;ouml;n&amp;uuml;şlerin s&amp;ouml;z konusu olduğu web metodlarında ortaya &amp;ccedil;ıkmaktadır. Nitekim web metodlarında parametreler s&amp;ouml;z konusu olduğundan parametre değerleri i&amp;ccedil;in ayrı ayrı &amp;ouml;n-bellekleme işlemleri s&amp;ouml;z konusu olmaktadır. &amp;Ouml;rneğin, Sql Server 2005 &amp;uuml;zerinde yer alan &amp;ouml;rnek AdventureWorks veritabanındanki Product tablosunun verilerini, ProductSubCategoryID değerine g&amp;ouml;re farklı veri k&amp;uuml;meleri şeklinde sunabilecek bir web metodumuz olduğunu d&amp;uuml;ş&amp;uuml;nelim. Normal bir web uygulamasında bu tip parametrik fonksiyonellikler s&amp;ouml;z konusu olduğunda genellikle &lt;strong&gt;OutputCache&lt;/strong&gt; direktifinin &lt;strong&gt;VaryByParam&lt;/strong&gt; niteliğinden faydalanılır. Oysaki web servisi metodlarında bu tarz bir kullanım s&amp;ouml;z konusu değildir. Web servisleri parametre bağımlı &amp;ouml;n-bellekleme s&amp;ouml;z konusu olduğunda daha akılcı bir yaklaşım sergilyerek, metodun parametresine (parametrelerine) g&amp;ouml;re farklı &amp;ouml;n-bellek alanları oluşturur. B&amp;ouml;ylece &lt;strong&gt;CacheDuration&lt;/strong&gt; niteliği ile belirtilen &amp;ouml;n-bellekleme s&amp;uuml;releri i&amp;ccedil;erisinde aynı parametrik değeri talep eden kulllanıcılar i&amp;ccedil;in &amp;ouml;n-bellekte tutulan o parametreye ait g&amp;ouml;r&amp;uuml;nt&amp;uuml;ler cevap olarak istemcilere g&amp;ouml;nderilir. Bunu daha iyi anlayabilmek i&amp;ccedil;in aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[WebMethod(Description = "Alt kategoriye g&amp;ouml;re &amp;uuml;r&amp;uuml;nler", CacheDuration = 180)]
public DataSet GetProductsBySubCategory(int subCatId)
{
&amp;nbsp;&amp;nbsp;&amp;nbsp; using (SqlConnection con = new SqlConnection("data source=manchester;database=AdventureWorks;integrated security=SSPI"))
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; SqlCommand cmd=new SqlCommand("Select ProductID,Name,ListPrice,Size,StandardCost,ProductSubCategoryID From Production.Product Where ProductSubCategoryID=@SubCatId",con);
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; cmd.Parameters.AddWithValue("@SubCatId",subCatId);
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; SqlDataAdapter da = new SqlDataAdapter(cmd);
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; DataSet ds = new DataSet();
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; da.Fill(ds);
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; return ds;
&amp;nbsp;&amp;nbsp;&amp;nbsp; }
}&lt;/pre&gt;
&lt;p&gt;Bu &amp;ouml;rnek web metodu, parametre olarak Product tablosundaki ProductSubCategoryID alanı i&amp;ccedil;in kullanılacak bir parametre almaktadır. Talep edilen i&amp;ccedil;eriğin &amp;ouml;n bellekte tutulma s&amp;uuml;resi 180 saniye (3 dakika) olarak belirtilmiştir. Şimdi bu metoda belirli aralıklar ile 4 farklı talep geldiğini d&amp;uuml;ş&amp;uuml;nelim. İlk ve ikinci taleplerde sırasıyla subCatId parametresine 1 ve 5 değerlerinin aktarıldığını d&amp;uuml;ş&amp;uuml;nelim. Yani iki farklı kullanıcı farklı zamanlarda belirtilen kategorilerdeki &amp;uuml;r&amp;uuml;nleri &amp;ccedil;ekmek istesin. İlk talep sonrasında, yukarıdaki web metodunda yer alan kodlar 1 değeri i&amp;ccedil;in &amp;ccedil;alıştırılacaktır. Yani SqlConnection bağlantısı a&amp;ccedil;ılacak, ilgili SqlCommand oluşturulup bir SqlDataAdapter yardımıyla sonu&amp;ccedil; k&amp;uuml;mesi bir DataSet nesnesine aktarılacak ve geriye d&amp;ouml;nd&amp;uuml;r&amp;uuml;lerek kullanıcıya cevap verilecektir. İşte bu andan itibaren oluşturulan sonu&amp;ccedil; k&amp;uuml;mesi &amp;ouml;n belleğede atılır ve 180 saniye s&amp;uuml;reyle burada tutulur. Dolayısıyla aynı subCatId değeri i&amp;ccedil;in bu 180 saniyelik zaman dilimi i&amp;ccedil;erisinde gelecek olan herhanbir talep, yukarıdaki kodlar &amp;ccedil;alıştırılmadan &amp;ouml;n-bellekte tutulan veri i&amp;ccedil;eriğinden d&amp;ouml;nd&amp;uuml;r&amp;uuml;lecektir. İkinci ve farklı bir subCatId değeri i&amp;ccedil;in gelen talep i&amp;ccedil;inde aynı s&amp;uuml;re&amp;ccedil; s&amp;ouml;z konusu olacaktır ve &amp;ouml;n-bellekte ayrı bir alan a&amp;ccedil;ılarak ve CacheDuration s&amp;uuml;resi i&amp;ccedil;erisinde gelen taleplerin cevapları buradan karşılanacaktır. Aşağıdaki &amp;ccedil;izelgede bir zaman dilimi i&amp;ccedil;erisinde iki farklı subCatId i&amp;ccedil;in gelen taleplerin &amp;ouml;n-bellekleme sistemince nasıl ele alınacağı g&amp;ouml;sterilmeye &amp;ccedil;alışılmıştır.&lt;/p&gt;
&lt;p&gt;&lt;img src="http://www.buraksenyurt.com/makale/images/mk169_1.gif" alt="" width="641" height="365" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;zellikle parametre bağımlı &amp;ouml;n-bellekleme işlemlerinde web servisleri i&amp;ccedil;in dikkat edilmesi gereken bir nokta vardır. Web servisi isteğimiz dışında parametre bağımlı &amp;ouml;n-bellekleme yapmaktadır. Bu otomatik gelişim zaman zaman iyi sonu&amp;ccedil;lar versede bazı durumlarda kullanılmamalıdır. Otomatik karar sistemi &amp;ouml;zellikle verinin &amp;ccedil;ok y&amp;uuml;ksek boyutlara erişmediği hallerde olduk&amp;ccedil;a faydalı bir y&amp;ouml;ntemdir. Ancak veri k&amp;uuml;mesinin boyutunun b&amp;uuml;y&amp;uuml;k olması, &amp;ouml;n-bellekte tutulan veri k&amp;uuml;melerininde, gelen sayısız talep sonucu belleği inanılmaz derecede şişireceği anlamına gelir. Bellekteki bu artış bir s&amp;uuml;re sonra her nekadar fiziki disk &amp;uuml;zerinden karşılanabilecek olsada, performansı olumsuz etkiliyen ve sistem kaynaklarını tketen bir etkendir. B&amp;ouml;yle bir durumda &amp;ouml;n-bellekleme sisteminin avantajı kaybedilip dezavantaja d&amp;ouml;n&amp;uuml;şebilir. Sonu&amp;ccedil; itibariye bir orta yolda hareket etmek &amp;ccedil;ok daha mantıklı olabilir. Bu orta yol &amp;ouml;zellike web servislerinde yukarıdaki gibi parametreye bağımlı sonu&amp;ccedil; k&amp;uuml;meleri s&amp;ouml;z konusu olduğunda ele alınan bir desen (pattern) i&amp;ccedil;ermektedir. Bu desene g&amp;ouml;re, parametreye bağlı sonu&amp;ccedil; k&amp;uuml;melerinin &amp;ccedil;ekildiği asıl veri seti &amp;ouml;n-bellekte tutulur. Kullanıcının talepte bulunduğu veri i&amp;ccedil;eriği ise, &amp;ouml;n-bellekte tutulan bu ortak veri setinden ayrıştırılarak &amp;ccedil;ekilir. Bu, &amp;ouml;n-bellekleme kapasitesini daha etkin kullanabilmemizi sağlarken, kullanıcının isteklerini birazda olsa hızlı karşılayabilecek bir model oluşturabilmemizi sağlar. Aşağıdaki şekil bu modeli &amp;ouml;zetlemeye &amp;ccedil;alışmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;img src="http://www.buraksenyurt.com/makale/images/mk169_4.gif" alt="" width="569" height="399" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Mavi &amp;ccedil;izgiler 5 numaralı&amp;nbsp; ID değeri i&amp;ccedil;in gelen ilk talepte yapılan işlemleri g&amp;ouml;stermektedir. T&amp;uuml;m Products seti veritabanından &amp;ccedil;ekilerek &amp;ouml;n-belleğe atılır. Sonrasında ise &amp;ouml;n-bellekteki veri seti i&amp;ccedil;erisinden, ProductSubCategoryID değeri 5 olan satırlar ayrıştırılarak Client 1 isimli istemciye g&amp;ouml;nderilir. Aynı ProductSubCategoryID değeri i&amp;ccedil;in gelecek ikinci talepte ise artık &amp;ouml;n-bellekte tutulmakta olan veri seti i&amp;ccedil;erisinden ayrıştırma işlemi yapılacaktır. Database' e tekrar gidilip veri &amp;ccedil;ekme işlemi ger&amp;ccedil;ekleştirilmemektedir. Bu elbette veri setinin &amp;ouml;n-bellekte tutulduğu s&amp;uuml;re i&amp;ccedil;erisinde bir talep geldiğinde ge&amp;ccedil;erlidir. Aksi durumda yine veritabanından ver &amp;ccedil;ekme ve &amp;ouml;n-belleğe alma işlemi ger&amp;ccedil;ekleştirilecektir.&lt;/p&gt;
&lt;p&gt;S&amp;ouml;z&amp;uuml; ge&amp;ccedil;en modelde &lt;strong&gt;Data Caching&lt;/strong&gt; sistemi etkin olarak kullanılmaktadır. Şimdi yukarıdaki &amp;ouml;rnek senaryomuzu bu modele g&amp;ouml;re yazmaya &amp;ccedil;alışalım. Herşeyden &amp;ouml;nce Product tablosunun i&amp;ccedil;eriğini ilk gelen talepten sonra belirli bir s&amp;uuml;re &amp;ouml;n bellekte tutacak bir metod yazmamız gerekiyor. Bu metod web servisi i&amp;ccedil;erisindeki diğer metodlara hizmet vereceğinden private olarak tanımlanabilir. Metodun i&amp;ccedil;erisinde, web servisindeki ilgili metoda(metodlara) gelen talepler i&amp;ccedil;in &amp;ouml;n bellekte Product tablosuna ait bir DataSet nesnesinin tutulup tutulmadığına bakacağız. Bu kontrol işlemi i&amp;ccedil;in &lt;strong&gt;Cache&lt;/strong&gt; sınıfından yararlanabiliriz. Eğer DataSet nesnemiz &amp;ouml;n bellekte ise, web metoduna gelen parametre bağımlı talep buradan karşılanacak. Aksine ilgili veri seti &amp;ouml;n bellekte değil ise, &amp;ouml;nce oluşturulacak ardından &amp;ouml;n-belleğe atılacak ve son olarak yine ilgili web metoduna işlenmesi i&amp;ccedil;in devredilecek. Aşağıdaki metodumuz bu işlemler i&amp;ccedil;in tasarlanmıştır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;private DataSet GetProducts()
{
&amp;nbsp;&amp;nbsp;&amp;nbsp; if (Context.Cache["Products"] != null)
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; return (DataSet)Context.Cache["Products"];
&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp; else
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; SqlDataAdapter da = new SqlDataAdapter("Select ProductID,Name,ListPrice,Size,StandardCost,ProductSubCategoryID From Production.Product", "data source=manchester;database=AdventureWorks;integrated security=SSPI");
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; DataSet ds = new DataSet();
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; da.Fill(ds);
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; Context.Cache.Insert("Products", ds, null, DateTime.Now.AddMinutes(5), TimeSpan.Zero);
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; return ds;
&amp;nbsp;&amp;nbsp;&amp;nbsp; }
}&lt;/pre&gt;
&lt;p&gt;Burada Data Caching yaparken Absolute Time tekniğini se&amp;ccedil;tik. Yani Products isimli, DataSet taşıyan Cache nesnemiz oluşturulup &amp;ouml;n belleğe atıldıktan sonra 5 dakika s&amp;uuml;reyle burada tutulacaktır. Elbette sahip olunan verinin i&amp;ccedil;eriğinin ne kadar sık değiştiğine g&amp;ouml;re bu s&amp;uuml;re geliştirici tarafından uzatılabilir yada kısaltılabilir. &amp;Ouml;rneğin &amp;ccedil;ok sık değişmeyen &amp;Uuml;lke - Şehir - İl&amp;ccedil;e gibi bir i&amp;ccedil;erik sunan verilerde Cache s&amp;uuml;resi m&amp;uuml;mk&amp;uuml;n olduğunca uzatılabilir.&lt;/p&gt;
&lt;p&gt;Cache nesnesini bir web servisi metodu i&amp;ccedil;erisinde kullanabilmek i&amp;ccedil;in g&amp;uuml;ncel talepleri taşıyan http i&amp;ccedil;eriğini (HttpContext) ele almamız gerekmektedir. Bu i&amp;ccedil;eriği &lt;strong&gt;Context&lt;/strong&gt; nesnesi yardımıyla ele alabiliriz. Products isimli, i&amp;ccedil;eriğinde DataSet nesne &amp;ouml;rneği taşıyan bir Cache nesnesinin tutulup tutulmadığını kontrol etmek i&amp;ccedil;in ve eğer b&amp;ouml;yle bir nesne yok ise bunu oluşturdukan sonra &amp;ouml;n-belleğe Cache sınıfı yardımıyla ekleyebilmek i&amp;ccedil;in Context sınıfından yararlanıyoruz. Gelelim istemcilere hizmete verecek olan parametre bağımlı metodumuza. Bu metodun i&amp;ccedil;eriğinide aşağıdaki gibi tasarlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;[WebMethod(Description = "Alt kategoriye g&amp;ouml;re &amp;uuml;r&amp;uuml;nler")]
public DataSet GetProductsBySubCategory(int subCatId)
{
&amp;nbsp;&amp;nbsp;&amp;nbsp; DataSet dsResult = GetProducts().Copy();
&amp;nbsp;&amp;nbsp;&amp;nbsp; foreach (DataRow currRow in dsResult.Tables[0].Rows)
&amp;nbsp;&amp;nbsp;&amp;nbsp; {
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; if ((currRow["ProductSubCategoryID"].ToString() == "") || (currRow["ProductSubCategoryID"] == null) || (Convert.ToInt32(currRow&amp;nbsp;&amp;nbsp;&amp;nbsp; ["ProductSubCategoryID"]) != subCatId))
&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp; currRow.Delete();
&amp;nbsp;&amp;nbsp;&amp;nbsp; }
&amp;nbsp;&amp;nbsp;&amp;nbsp; dsResult.AcceptChanges();
&amp;nbsp;&amp;nbsp; &amp;nbsp;return dsResult;
}&lt;/pre&gt;
&lt;p&gt;Buradaki ana fikir &amp;ouml;n bellekte tutulan veri seti i&amp;ccedil;erisinden, kullanıcının talep ettiği parametre değerine g&amp;ouml;re oluşacak yeni bir veri setini kullanıcıya g&amp;ouml;ndermektir. Bunun i&amp;ccedil;in, &amp;ouml;n-bellekten gelen DataSet yapısını bozmayacak şekilde ele alınmaktadır. Bu sebeptende &amp;ouml;ncelikle ilgili DataSet' in bir kopyası Copy metodu ile &amp;ccedil;ıkartılır. Sonrasında elde edilen kopya i&amp;ccedil;erisinde dolaşılmakta ve ProductSubCategoryID değeri boş veya null olanlar ile gelen subCatId değerine eşit olmayanlar 0 indisli DataTable i&amp;ccedil;erisinden &amp;ccedil;ıkartılmaktadır. B&amp;ouml;ylece kullanıcıya istediği veri setini g&amp;ouml;ndermiş oluruz. Yukarıdaki tekniği kullandığınız takdirde eğer web servisini &amp;ccedil;alıştırır ve GetProductsBySubCategory metodunu y&amp;uuml;r&amp;uuml;t&amp;uuml;rseniz, uygulamayı debug ederken metodun &amp;ccedil;alıştırılması sonrasında d&amp;ouml;necek olan veri setinin sadece parametre olarak gelen kategori bilgilerini i&amp;ccedil;erdiğini kolayca tespit edebilirsiniz.&lt;/p&gt;
&lt;p&gt;&lt;img src="http://www.buraksenyurt.com/makale/images/mk169_2.gif" alt="" width="639" height="407" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Peki bu işlemlerin bize kazandırdığı avantalar nelerdir? Her şeyden &amp;ouml;nce farklı parametre değerleri i&amp;ccedil;in &amp;ouml;n bellekte farklı veri seti g&amp;ouml;r&amp;uuml;nt&amp;uuml;leri oluşturmaktan kurtulmuş oluyoruz. Bu sayede &amp;ouml;n belleğin optimize edilişinde &amp;ouml;nemli bir kazancımız olmaktadır. Diğer taraftan t&amp;uuml;m parametre bağımlı talepler &amp;ouml;n bellekteki aynı veri setini kullandığından, veri ayrıştırma işlemi i&amp;ccedil;in veritabanına gidiş gelişler de azaltılmaktadır. Bu gidiş gelişlerin (round-trips) azalması, web servisinin sql sunucusunu &amp;ccedil;ok fazla s&amp;uuml;re ile meşgul etmesinin &amp;ouml;nlenmesi anlamına gelmektedir. Bu makalemizde web servislerinde uygulanan &amp;ouml;n bellekleme tekniğine farklı bir a&amp;ccedil;ıdan bakmaya &amp;ccedil;alıştık. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="http://www.buraksenyurt.com/makale/images/AdventureServices.rar"&gt;&amp;Ouml;rnek Uygulama İ&amp;ccedil;in Tıklayın.&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Burak Selim ŞENYURT&lt;br /&gt;&lt;a href="mailto:selim(at)buraksenyurt.com"&gt;selim(at)buraksenyurt.com&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2006-07-28 12:00:00</pubDate>
  <slug>Xml-Web-Servislerinde-Etkili-Caching-Kullanc4b1mc4b1-bsenyurt-com-dan</slug>
  <tags>
    <tag>xml-web-services</tag>
    <tag>cache</tag>
    <tag>caching</tag>
    <tag>contextcache</tag>
  </tags>
  <categories>
    <category>XML Web Services</category>
  </categories>
</post>