<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>PLINQ - Sıralamayı(Ordering) Korumak [Beta 1]</title>
  <description>Hatırlayacağınız gibi, PLINQ(Parallel LINQ) ile ilişkili ilk yazımda, LINQ sorgularının eş zamanlı olarak nasıl çalıştırılabileceğini incelemeye çalışmıştık. Hello World örneğimizde ağırlıklı olarak aşağıdaki sorgu üzerinde durmuştuk.</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Hatırlayacağınız gibi, &lt;strong&gt;PLINQ(Parallel LINQ) &lt;/strong&gt;ile ilişkili ilk &lt;a title="PLINQ - Hello World" href="/post/PLINQ-(Parallel-LINQ)-Hello-World" target="_blank"&gt;yazımda&lt;/a&gt;, LINQ sorgularının eş zamanlı olarak nasıl &amp;ccedil;alıştırılabileceğini incelemeye &amp;ccedil;alışmıştık. Hello World &amp;ouml;rneğimizde ağırlıklı olarak aşağıdaki sorgu &amp;uuml;zerinde durmuştuk.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var result2 = from p in products.AsParallel()
                          where p.ListPrice &amp;gt;= 10 &amp;amp;&amp;amp; p.InStock==true
                          orderby p.Name descending
                          select p;&lt;/pre&gt;
&lt;p&gt;Bu sorguda yer alan orderby kelimesi aslında &amp;ccedil;ok b&amp;uuml;y&amp;uuml;k bir &amp;ouml;neme sahiptir. Gelin ne demek istediğimi size anlatmaya &amp;ccedil;alışayım. Yine &lt;strong&gt;Visual Studio 2010 Professional Beta 1 &lt;/strong&gt;ortamında geliştirilen aşağıdaki kod par&amp;ccedil;asına sahip bir Console uygulamamız olduğunu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alacağız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;

namespace HelloWorld
{
    class Program
    {
        static void Main(string[] args)
        {
            List&amp;lt;Product&amp;gt; products = FillProducts();
            Console.WriteLine("Liste dolduruldu. İşlemlere devam etmek i&amp;ccedil;in tıklayın");
            Console.ReadLine();

            Console.WriteLine("Listenin ilk hali");
            foreach (Product prd in products)
            {
                if(prd.InStock==true)
                    Console.WriteLine(prd.Name);
            }

            var result = from p in products.AsParallel()
                         where p.InStock == true
                         select p;

            Console.WriteLine("AsParalell sonrası listenin hali");
            foreach (Product prd in result)
            {
                Console.WriteLine(prd.Name);
            }
        }

        static List&amp;lt;Product&amp;gt; FillProducts()
        {
            List&amp;lt;Product&amp;gt; products = new List&amp;lt;Product&amp;gt;();

            for (long i = 1; i &amp;lt; 21; i++)
            {
                Product prd = new Product
                {
                    Id = i
                    ,Name = "Product" + i.ToString()
                    ,ListPrice = i * 0.1M
                    ,InStock = i % 2 == 0 ? true : false
                };
                products.Add(prd);
            }

            return products;
        }
    }


    class Product
    {
        public long Id { get; set; }
        public string Name { get; set; }
        public decimal ListPrice { get; set; }
        public bool InStock { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu seferki &amp;ouml;rneğimizde temel amacımız hız veya işlemlerin daha kısa s&amp;uuml;rede tamamlanması değildir. products isimli generic List koleksiyonu doldurulduktan sonra bir foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml; yardımıyla dolaşılmakta&amp;nbsp;ve stokta olanlar(InStock==true) ekrana yazdırılmaktadır. Sonrasında ise &lt;strong&gt;PLINQ&lt;/strong&gt; sorgumuz gelmekte ve aynı sonu&amp;ccedil;ları paralel &amp;ccedil;alışan task' ler &amp;uuml;zerinde elde etmemizi sağlamaktadır. Hemen k&amp;uuml;&amp;ccedil;&amp;uuml;k bir dip not belirtelim; LINQ sorguları aslında kullanıldıkları anda &amp;ccedil;alıştırılmaktadır&lt;strong&gt;(Deferred Execution).&lt;/strong&gt; Yani &amp;ccedil;alışma zamanında ikinci foreach d&amp;ouml;ng&amp;uuml;s&amp;uuml;ne gelindiğinde, s&amp;ouml;z konusu PLINQ sorgusu y&amp;uuml;r&amp;uuml;t&amp;uuml;lmekte ve dolayısıyla paralel g&amp;ouml;revler devreye girmektedir. Peki herşey g&amp;uuml;zel hoş... Hoş ama niye bunun &amp;uuml;zerinde duruyoruz? Aslında &amp;ccedil;alışma zamanındaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; herşeyi biraz olsun a&amp;ccedil;ıklıyor.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f5%2fblg20_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere, listenin ilk halinde stokta olan &amp;uuml;r&amp;uuml;nler, koleksiyonda yer aldıkları&amp;nbsp;sıraya g&amp;ouml;re ekrana getirilmektedir. Ancak &lt;strong&gt;AsParallel &lt;/strong&gt;genişletme metodunun kullanılması sonrasında elde edilen listedeki &amp;uuml;r&amp;uuml;nler sıralı bir şekilde gelmemektedir. Bu &amp;ccedil;ok doğal olarak paralel &amp;ccedil;alışmanın bir sonucudur. Ancak bazı hallerde &lt;strong&gt;AsParallel&lt;/strong&gt; kullanımı sonrasında, kaynak listenin sıralı olarak elde edilmesi istenebilir. Bu durumda &lt;strong&gt;orderby&lt;/strong&gt; kullanımı sorunu &amp;ccedil;&amp;ouml;zecektir. S&amp;ouml;z gelimi yukarıdaki &amp;ouml;rnekte yer alan LINQ ifadesinde orderby aşağıdaki gibi kullanılabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var result = from p in products.AsParallel()
                         where p.InStock == true
                         orderby p.Name
                         select p;&lt;/pre&gt;
&lt;p&gt;Bu durumda &amp;ouml;rneğin &amp;ccedil;alışması sonucu aşağıdaki &amp;ccedil;ıktı elde edilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f5%2fblg20_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ancak PLINQ tipinden sorgunun &amp;ccedil;alıştırılması sırasında orjinal nesne sırasının korunması da istenebilir ki bu orderby kullanımından daha farklı anlamdadır. &lt;em&gt;(orderby kullanımında listenin, koleksiyondaki orjinal sırası yerine, sıralama kriteri belirtilir.)&lt;/em&gt; İşte bu noktada devreye &lt;strong&gt;ParallelEnumerable&lt;/strong&gt; static sınıfı i&amp;ccedil;erisinde tanımlanmış olan &lt;strong&gt;AsOrdered &lt;/strong&gt;isimli &lt;strong&gt;genişletme metodu(Extension&amp;nbsp;Method)&lt;/strong&gt;&amp;nbsp;girer. Yani sorguyu aşağıdaki hale getirirsek, liste elemanlarının koleksiyon i&amp;ccedil;erisindeki orjinal sırasını koruyarak sonu&amp;ccedil; elde edilmesi sağlanabilir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;var result = from p in products.AsParallel().AsOrdered()
                         where p.InStock == true
                         select p;&lt;/pre&gt;
&lt;p&gt;Ve sonu&amp;ccedil;...&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f5%2fblg20_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Tabi burada &amp;ouml;nemli bir nokta daha vardır. AsOrdered &amp;ccedil;ok doğal olarak PLINQ sorgunun &amp;ccedil;alışma zamanında &lt;span style="text-decoration: underline;"&gt;yavaş işlemesine&lt;/span&gt; neden olacaktır. &amp;Ccedil;&amp;uuml;nk&amp;uuml;, sorgu sonucu elde edilen liste eşitliğin sol tarafına aktarılmadan &amp;ouml;nce, AsOrdered nedeni ile orjinal sıra konumlarına yerleştirilir. Bu ek işlem, sonucun elde edilmesini yavaşlatacaktır. Bu nedenle &lt;strong&gt;MSND&lt;/strong&gt; kaynaklarında, &lt;strong&gt;AsOrdered&lt;/strong&gt; genişletme metodunun gerekmedik&amp;ccedil;e kullanılmaması &amp;ouml;ğ&amp;uuml;tlenmektedir. Hatta, &lt;strong&gt;orderby&lt;/strong&gt; kullanımının tercih edilmesi &amp;ouml;nerilmektedir. Yazımızın başında belirttiğimiz Orderby kullanımının neden &amp;ouml;nemli olduğunu sanırım anlamış bulunuyoruz. Tabiki zorunlu hallerde &lt;strong&gt;AsOrdered &lt;/strong&gt;kullanılmasıda gerekebilir.&lt;/p&gt;
&lt;p&gt;Bu yazımda sizlere &amp;ouml;nemsiz gibi g&amp;ouml;r&amp;uuml;nen fakat dikkat edilmesi gereken bir konuyu aktarmaya &amp;ccedil;alıştım. Bir sonraki yazımızda g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2009%2f5%2fOrdering.rar"&gt;Ordering.rar (22,74 kb)&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2009-05-23 20:30:00</pubDate>
  <slug>PLINQ-Siralamayi(Ordering)-Korumak</slug>
  <tags>
    <tag>plinq</tag>
    <tag>linq</tag>
  </tags>
  <categories>
    <category>PLINQ</category>
  </categories>
</post>