<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>5000 Feet Yüksekten Workflow Foundation 4.0[Beta 1]</title>
  <description>Paraşütle atlamak gerçekten zevkli olsa gerek. Yerden binlerce feet(1 feet=30,48 cm) yüksekten atlayıp özgür bir şekilde kendinizi yer çekimi gücüne bırakıp, saniyeler boyunca serbest düşüşü yaşamak...Size yandaki resimde atlayan kişinin ben olduğumu söylemek isterdim ama ne yazık ki değilim. Olmayı istermiydim bilemiyorum. Oldukça yüksek görünüyor. Sealed Bir paraşütçü için en güzel duygulardan birisi sanıyorum ki atladığı noktadan itibaren altındaki Dünyayı görebildiği kadar yüksekten izleyebilmenin verdiği mutluluktur.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/pics/2009%2f9%2fblg86_Giris.jpg" alt="" /&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Paraş&amp;uuml;tle atlamak ger&amp;ccedil;ekten zevkli olsa gerek. Yerden binlerce feet(1 feet=30,48 cm)&amp;nbsp;y&amp;uuml;ksekten atlayıp &amp;ouml;zg&amp;uuml;r bir şekilde kendinizi yer &amp;ccedil;ekimi g&amp;uuml;c&amp;uuml;ne bırakıp, saniyeler boyunca serbest d&amp;uuml;ş&amp;uuml;ş&amp;uuml; yaşamak...Size yandaki resimde atlayan kişinin ben olduğumu s&amp;ouml;ylemek isterdim ama&amp;nbsp;ne yazık ki değilim. Olmayı istermiydim bilemiyorum. Olduk&amp;ccedil;a y&amp;uuml;ksek g&amp;ouml;r&amp;uuml;n&amp;uuml;yor. &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt;&amp;nbsp;Bir paraş&amp;uuml;t&amp;ccedil;&amp;uuml; i&amp;ccedil;in en g&amp;uuml;zel duygulardan birisi sanıyorum ki atladığı noktadan itibaren altındaki D&amp;uuml;nyayı g&amp;ouml;rebildiği kadar y&amp;uuml;ksekten izleyebilmenin verdiği mutluluktur.&lt;/p&gt;
&lt;p&gt;Tabiki atlanılan noktadan aşağıya doğru d&amp;uuml;şt&amp;uuml;k&amp;ccedil;e ve paraş&amp;uuml;t&amp;uuml; &amp;ccedil;ekme noktasına yaklaştık&amp;ccedil;a alttaki D&amp;uuml;nyanın resimlerinin daha da b&amp;uuml;y&amp;uuml;d&amp;uuml;ğ&amp;uuml; &amp;ccedil;ok a&amp;ccedil;ık bir ger&amp;ccedil;ektir. B&amp;uuml;y&amp;uuml;k bir dikd&amp;ouml;rten alan...Sonrasında i&amp;ccedil;erisinde başka geometrik şekiller...Sonrasında bu geometrik şekiller i&amp;ccedil;erisinde daha da netleşen &amp;ccedil;ayırlar,&amp;nbsp;dağlar, kayalar, yollar, binalar...Sonrasında bir anlık yavaşlama ve sakin bir şekilde(bazende hızlı bir şekilde) yere ayak basmak. Kısaca yaşanan bu duruma&lt;strong&gt; "y&amp;uuml;ksekten&amp;nbsp;g&amp;ouml;r&amp;uuml;lebileceği kadar b&amp;uuml;y&amp;uuml;k&amp;nbsp;bir alanı g&amp;ouml;r&amp;uuml;p, yaklaştık&amp;ccedil;a daha fazla detay fark edebilmek durumu"&lt;/strong&gt; &lt;img title="Cool" src="/editors/tiny_mce3/plugins/emotions/img/smiley-cool.gif" alt="Cool" border="0" /&gt;&amp;nbsp;adını verebiliriz. Şimdi bu noktaya nereden vardım diyebilirsiniz. Hemen a&amp;ccedil;ıklayayım.&lt;/p&gt;
&lt;p&gt;Yazılım ile ilişkili pek &amp;ccedil;ok kaynakta şu tip başlıklar g&amp;ouml;rm&amp;uuml;şs&amp;uuml;n&amp;uuml;zd&amp;uuml;r.&lt;strong&gt; 50 bin feet yukarıdan&amp;nbsp;X mimarisi&lt;/strong&gt;...İşte bizde bu felsefeyi bu g&amp;uuml;nk&amp;uuml; blog yazımızda kullanıyor olacağız. Ama biraz daha al&amp;ccedil;ak mesafeden &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;5000 feet yukarıdan fotoğraflandığında, WF 4.0 modelinin ne gibi &amp;ouml;zellikleri dikkat &amp;ccedil;ekiyor?&lt;/strong&gt; İşte g&amp;ouml;r&amp;uuml;len tespitler...&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;WF 3.X&lt;/strong&gt;' teki kısıtlı olan&amp;nbsp;&lt;strong&gt;XAML &lt;/strong&gt;bazlı &lt;strong&gt;Workflow &lt;/strong&gt;modeli&amp;nbsp;yerini &lt;strong&gt;tam desteklenen(Full XAML Based) Workflow &lt;/strong&gt;modeline&amp;nbsp;bırakıyor. B&amp;ouml;ylece bir Workflow' un basit bir text editor&amp;uuml; yardımıyla tamamen &lt;strong&gt;dekleratif(declerative)&lt;/strong&gt; olarak geliştirilmesi ve &amp;ccedil;alışma zamanına devredilmesinin m&amp;uuml;mk&amp;uuml;n olabildiğini &lt;em&gt;(Bu &amp;ouml;zelliğin en &amp;ouml;nemli a&amp;ccedil;ılımlarından biriside, &amp;ccedil;eşitli 3nc&amp;uuml; parti ara&amp;ccedil;ların &lt;strong&gt;XAML &lt;/strong&gt;i&amp;ccedil;eriklerini ele alarak akışları koda girmeden değiştirebilecek olmaları. &lt;strong&gt;Oslo, Dublin &lt;/strong&gt;ve &lt;strong&gt;Quadrant &lt;/strong&gt;&amp;uuml;&amp;ccedil;lemesinin &amp;ouml;nemle &amp;uuml;zerinde durduğu noktalardan biriside zaten bu dekleratif a&amp;ccedil;ılım.)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;WF 3.X' &lt;/strong&gt;te daha zor olan &lt;strong&gt;&amp;ouml;zel aktivite(Custom Activity)&amp;nbsp;&lt;/strong&gt;geliştirme yeteneğinin &lt;strong&gt;WF 4.0 &lt;/strong&gt;i&amp;ccedil;in daha da basitleştirildiğini&amp;nbsp;ve bu ama&amp;ccedil;la&amp;nbsp;temel workflow hiyerarşisinde de değişikliklere gidildiğini ve ata&amp;nbsp;tip olarak&amp;nbsp;&lt;strong&gt;WorkflowElement &lt;/strong&gt;ve&amp;nbsp;kendisinden t&amp;uuml;reyen&amp;nbsp;&lt;strong&gt;Activity, CodeActivity, NativeActivity &lt;/strong&gt;gibi alt tiplerin geliştirildiğini,&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;WF 3.X' &lt;/strong&gt;te ilkel ve daha az genişletilebilir olan &lt;strong&gt;kurallar motorunun(Rules Engine) &lt;/strong&gt;dahada zenginleştirilmiş olduğunu,&lt;/li&gt;
&lt;li&gt;Yeni &lt;strong&gt;Workflow&lt;/strong&gt; bileşenlerinin &lt;strong&gt;System.Activities.* assembly' &lt;/strong&gt;ları altında olduğunu ama &lt;strong&gt;.Net Framework 4.0 &lt;/strong&gt;i&amp;ccedil;erisinde yer alan ve &lt;strong&gt;geriye uyumluluk(Backwards Compatibility)&lt;/strong&gt;&amp;nbsp;amacıyla kullanılan &lt;strong&gt;Workflow &lt;/strong&gt;bileşenlerininse &lt;strong&gt;System.Workflows.* assembly' &lt;/strong&gt;ları i&amp;ccedil;erisinde yer aldığını, bu anlamda WF 4.0' da geriye uyumluluğa da b&amp;uuml;y&amp;uuml;k &amp;ouml;nem verildiğini,&lt;/li&gt;
&lt;li&gt;Tamamen &lt;strong&gt;WPF(Windows Presentation Foundation) &lt;/strong&gt;temelli bir tasarım ortamının s&amp;ouml;z konusu olduğunu ve bu sayede geliştirici deneyiminin dahada zenginleştiğini,&lt;/li&gt;
&lt;li&gt;Bir &lt;strong&gt;Workflow &lt;/strong&gt;i&amp;ccedil;erisine veya dışarısına yapılan &lt;strong&gt;veri akışlarının(Data Flow) &lt;/strong&gt;&amp;ccedil;ok daha kolay ele alınması i&amp;ccedil;in &lt;strong&gt;Designer &lt;/strong&gt;desteği ile birlikte&amp;nbsp;&lt;strong&gt;Arguments &lt;/strong&gt;kavramının geldiğini,&lt;/li&gt;
&lt;li&gt;Bir aktivitenin kendi i&amp;ccedil;erisinde veriyi saklaması ve farklı seviyedeki alanlarda(Scope) kullanabilmesinde rol oynayan &lt;strong&gt;Variables&lt;/strong&gt; kavramını&amp;nbsp;ayrıca &lt;strong&gt;Arguments&lt;/strong&gt; kavramında olduğu gibi, Variables i&amp;ccedil;inde&amp;nbsp;&lt;strong&gt;Designer &lt;/strong&gt;desteğinin olduğunu,&lt;/li&gt;
&lt;li&gt;Bir veya daha fazla &lt;strong&gt;input&lt;/strong&gt; arg&amp;uuml;manı alıp bunlar &amp;uuml;zerinde &amp;ccedil;eşitli operasyonlar ger&amp;ccedil;ekleştiren ve geriye değer d&amp;ouml;nd&amp;uuml;rebilen &lt;strong&gt;ifadeler(Expressions)&lt;/strong&gt; yazılabildiğini, &amp;uuml;stelik bunların &lt;strong&gt;XAML&lt;/strong&gt; bazlı olabildiğini,&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;FlowChart, ForEach, Parallel, ParallelForEach &lt;/strong&gt;&lt;em&gt;(Parallel versiyonların Ekimdeki &lt;a title="Microsoft Proffessional Developer Conference" href="http://microsoftpdc.com/" target="_blank"&gt;PDC' &lt;/a&gt;de yayınlanacak s&amp;uuml;r&amp;uuml;mde olması&amp;nbsp;bekleniyor) &lt;/em&gt;ve daha pek &amp;ccedil;ok aktivite tipi ile zengineştirilmiş olan &lt;strong&gt;temel aktivite k&amp;uuml;t&amp;uuml;phanesi(Base Activity Library) &lt;/strong&gt;ni,&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Sequential&lt;/strong&gt; ve &lt;strong&gt;State Machine &lt;/strong&gt;arasında duran ama geliştirici ve iş analistlerinin, bilinen iş akışı tasarım modeline &amp;ccedil;ok yakın olması nedeniyle kolayca kullanabildiği yeni &lt;strong&gt;Flow Chart &lt;/strong&gt;modelini,&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Workflow&lt;/strong&gt; ve &lt;strong&gt;Activity' &lt;/strong&gt;ler&amp;nbsp;i&amp;ccedil;in &lt;strong&gt;Unit Test' &lt;/strong&gt;lerin kolayca geliştirilebiliyor olduğunu,&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Workflow' &lt;/strong&gt;ların, dışarıdaki &lt;strong&gt;Activity' &lt;/strong&gt;ler ile haberleşmenin dahada kolaylaştırılmış olduğunu,&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;4.0&lt;/strong&gt; versiyonunda evlenebilmerleri&amp;nbsp;i&amp;ccedil;in &lt;strong&gt;WCF &lt;/strong&gt;ve &lt;strong&gt;WF &lt;/strong&gt;tarafında;
&lt;ul&gt;
&lt;li&gt;Workflow tarafında yenilenen &amp;ccedil;alışma zamanı motoru bulunduğunu,&lt;/li&gt;
&lt;li&gt;Workflow Service' lerin &lt;strong&gt;host&lt;/strong&gt; edilebiliyor olduğunu,&lt;/li&gt;
&lt;li&gt;Workflow' lar i&amp;ccedil;erisinde &lt;strong&gt;XAML&lt;/strong&gt; bazlı olarak &lt;strong&gt;WCF&lt;/strong&gt; servis materyallerinin tanımlanabiliyor olduğunu,&lt;em&gt;(Service Contract, Data Contract, EndPoint vb...)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Visual Studio' da &lt;strong&gt;Workflow&lt;/strong&gt; &lt;strong&gt;Service' &lt;/strong&gt;ler i&amp;ccedil;in &lt;strong&gt;Add Service Reference &lt;/strong&gt;desteğinin getirildiğini,&lt;/li&gt;
&lt;li&gt;Yeni mesajlaşma aktivitileri&lt;strong&gt;&lt;em&gt;(SendAndReceiveReply, ReceiveAndSendReply gibi)&lt;/em&gt;&lt;/strong&gt; ve bunların &lt;strong&gt;mesaj korelasyon(Message Corellation)&lt;/strong&gt; desteğine de sahip olduğunu,&lt;/li&gt;
&lt;/ul&gt;
&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;WF 3.X&lt;/strong&gt; ile yazılmış olan &lt;strong&gt;Workflow' &lt;/strong&gt;ların &lt;strong&gt;4.0 &lt;/strong&gt;&amp;ccedil;alışma zamanı tarafından da y&amp;uuml;r&amp;uuml;t&amp;uuml;lebildiğini,&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;WF 3.X&lt;/strong&gt; tarafından yazılmış olan aktivitelerin &lt;strong&gt;sarmalanarak(Wrap) 4.0 &lt;/strong&gt;i&amp;ccedil;erisinde de kullanılabildiğini,&lt;strong&gt;&lt;em&gt;(Interop activity) &lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;
&lt;li&gt;Ayrıca WF 3.0' dan ge&amp;ccedil;iş yapacaklar i&amp;ccedil;in bir &lt;a title="Guide WF 3.X to WF 4.0" href="http://www.microsoft.com/downloads/details.aspx?displaylang=en&amp;amp;FamilyID=bd94c260-b5e0-4d12-93ec-53567505e685" target="_blank"&gt;klavuzun &lt;/a&gt;bulunduğunu,&lt;/li&gt;
&lt;li&gt;Daha detaylı bilgiler i&amp;ccedil;inse&lt;a title="The .Net Endpoint" href="http://blogs.msdn.com/endpoint/archive/2009/05/01/the-road-to-4-wf-changes-between-beta-1-and-ctp.aspx" target="_blank"&gt; şu adrese &lt;/a&gt;başvruabileceğimizi,&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;g&amp;ouml;r&amp;uuml;yoruz. Vooovvvvv!!!! Artık paraş&amp;uuml;t&amp;uuml;m&amp;uuml;z&amp;uuml; a&amp;ccedil;alım mı ne dersiniz? &lt;img title="Cool" src="/editors/tiny_mce3/plugins/emotions/img/smiley-cool.gif" alt="Cool" border="0" /&gt;&amp;nbsp;Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2009-10-01 13:54:00</pubDate>
  <slug>5000-Feet-Yuksekten-Workflow-Foundation-40</slug>
  <tags>
    <tag>wf-40</tag>
  </tags>
  <categories>
    <category>WF 4.0 Beta 1</category>
  </categories>
</post>