<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Asp.Net Core'a Nasıl Merhaba Deriz?</title>
  <description>Yazılım geliştirme işine ciddi anlamda başladığım yeni milenyumun başlarında .Net Framework sahanın yükselen yıldızıydı. C# programlama dilinin gücü ve .Net Framework çatısının vadettikleri düşünülünce bu son derece doğaldı. Aradan geçen neredeyse 20 yıllık süre zarfında .Net Framework'te evrimleşti. Microsoft'un açık kaynak dünyasına girişi, cross-platform stratejileri, Linux gibi bir zamanların ciddi rakipleri ile el sıkışarak hamle yapması sonrasında da son beş yıllık zaman diliminde .Net Core hayatımıza girdi. Bu beraberinde Microsoft'un sıklıkla yaptığı üzere bazı kavram karmaşalarını da beraberinde getirdi. En nihayetinde tek ve birleşik bir .Net 5 ortamından bahsedilmeye başlandı...</description>
  <content>&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Nisan/hellomvc_cover.png" alt="" align="right" /&gt;Yazılım geliştirme işine ciddi anlamda başladığım yeni milenyumun başlarında .Net Framework sahanın y&amp;uuml;kselen yıldızıydı. Delphi&amp;rsquo;den kopup gelen Anders&amp;rsquo;in yarattığı C# programlama dilinin g&amp;uuml;c&amp;uuml; ve .Net Framework &amp;ccedil;atısının vadettikleri d&amp;uuml;ş&amp;uuml;n&amp;uuml;l&amp;uuml;nce bu son derece doğaldı. Aradan ge&amp;ccedil;en neredeyse 20 yıllık s&amp;uuml;re zarfında .Net Framework&amp;rsquo;te evrimleşti ve s&amp;uuml;rekli g&amp;uuml;ncellendi. Versiyon 2.0 ile gelen generic tipler, 3.0'la birlikte SQL yazar gibi sorgulanabilir nesneler&lt;em class="jf"&gt;(LINQ-Language INtegrated Query)&lt;/em&gt;, sonrasında karşımıza &amp;ccedil;ıkan WCF&lt;em class="jf"&gt;(Windows Communication Foundation)&lt;/em&gt;, WF&lt;em class="jf"&gt;(Workflow Foundation)&lt;/em&gt;, Entity Framework vs derken Microsoft&amp;rsquo;un a&amp;ccedil;ık kaynak d&amp;uuml;nyasına girişi, benimsediği platform bağımsız stratejiler&lt;em class="jf"&gt;(Miguel De Icaza&amp;rsquo;nın Mono&amp;rsquo;suna da saygı duyalım)&lt;/em&gt;, Linux, MacOS gibi bir zamanların ciddi rakipleri ile el sıkışarak hamle yapması sonrasında da son birka&amp;ccedil; yıllık zaman diliminde karşımıza &amp;ccedil;ıkan .Net Core. Yeni gelişmeler Microsoft&amp;rsquo;un sıklıkla yaptığı &amp;uuml;zere bazı kavram karmaşalarını da beraberinde getirdi elbette. En nihayetinde tek ve birleşik bir .Net 5 ortamından bahsedilmeye başlandı. &lt;em&gt;(Photo by &lt;a href="https://unsplash.com/@element5digital?utm_source=unsplash&amp;amp;utm_medium=referral&amp;amp;utm_content=creditCopyText"&gt;Element5 Digital&lt;/a&gt; on &lt;a href="https://unsplash.com/s/photos/education?utm_source=unsplash&amp;amp;utm_medium=referral&amp;amp;utm_content=creditCopyText"&gt;Unsplash&lt;/a&gt;)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Gelişmeleri zaten sizler de benim gibi takip ediyorsunuzdur. Bu durum benim de kişisel olarak kendimi yenilemem gereken bir d&amp;ouml;nemi tetikledi. Bir s&amp;uuml;redir &amp;ouml;zellikle Amazon&amp;rsquo;dan getirttiğim kitaplardan .Net 5 d&amp;uuml;nyasını tanımaya, .Net 4.7.2 gibi versiyonlarda yazılmış uygulamarı yeni s&amp;uuml;r&amp;uuml;me g&amp;ouml;&amp;ccedil; ettirmenin&lt;em class="jf"&gt;(migration)&lt;/em&gt;&amp;nbsp;yollarını &amp;ouml;ğrenmeye &amp;ccedil;alışıyorum. Bu kişisel &amp;ccedil;abayı da &amp;ccedil;alışmakta olduğum şirketin i&amp;ccedil; eğitim programından gelen talepleri karşılamak i&amp;ccedil;in kullanıyorum.&lt;/p&gt;
&lt;p&gt;Sabahsız gecelerimin&amp;nbsp;birisinde zen merkezim olan &amp;ccedil;alışma odamdaki kanepeya uzanmış boş boş tavana bakıyordum. Hoş aklımda cevap arayan g&amp;uuml;zel bir soru da vardı.&amp;nbsp;&lt;a title="Doğuş Teknoloji Geleceğe Giriş" href="https://www.gelecegegiris.com" target="_blank"&gt;Geleceğe Giriş&lt;/a&gt; programı kapsamındaki bir Asp.Net Core eğitimine nasıl başlamalıydım? Nasıl bir Hello World olmalıydı? Doğrudan &amp;uuml;retilecek uygulamanın kendisini en başından g&amp;ouml;sterip; &amp;ldquo;İşte bu uygulamayı nasıl yazacağımızı adım adım &amp;ouml;ğreneceğiz&amp;rdquo; şeklinde mi yol almalıydım. Yoksa Hello World deme şekli .Net Core sonrası daha mı farklıydı?&lt;/p&gt;
&lt;p&gt;Bu işe başladığım yıllarda beni eğitenler veya okuduklarım Nesne Y&amp;ouml;nelimli Dil&lt;em&gt;(Object Oriented Programming)&lt;/em&gt; konusunun ne denli &amp;ouml;nemli olduğundan bahseder, kalıtım&lt;em&gt;(Inheritance)&lt;/em&gt;, &amp;ccedil;ok bi&amp;ccedil;imlilik&lt;em&gt;(Polymorphism)&lt;/em&gt; ve soyutlama&lt;em&gt;(Abstraction)&lt;/em&gt; gibi kavramların &amp;ouml;nemine vurgu yapardı. İş, d&amp;uuml;ş&amp;uuml;k maliyeti nedeniyle &amp;ccedil;ok sık tercih edilen monolitik mimarinin en yaygın kullanılan &amp;ouml;rneklerinden olan &amp;ccedil;ok katmanlı&lt;em&gt;(n-tier)&lt;/em&gt; &amp;ccedil;&amp;ouml;z&amp;uuml;mlere geldiğinde ise mahşerin beş atlısı SOLID ilkeleri, sayısız yazılım prensibi ve tasarım kalıbı ile karşılaşırdık. Ger&amp;ccedil;ekten yazılım m&amp;uuml;hendisliğinden bahsettiğimiz noktaya gelindiğinde ise Autofac, Ninject, Unity, Castle Windsor gibi bileşenler arası bağımlılıkları y&amp;ouml;neten &amp;ccedil;atıları kullanmaya başlardık. O g&amp;uuml;nleri d&amp;uuml;ş&amp;uuml;n&amp;uuml;rken&amp;nbsp;aklıma .Net Core'u&lt;em&gt;(esasında .Net 5'i)&lt;/em&gt; bu bağlamda ele almak geldi. &amp;Ccedil;ok &amp;uuml;st d&amp;uuml;zey yetenekleri olmasa da zaten dahili bir DI&lt;em&gt;(Dependency Injection)&lt;/em&gt;&amp;nbsp;mekanizmasına sahipti.&lt;/p&gt;
&lt;p&gt;Belki sadece DI deyip ge&amp;ccedil;tiğimiz ve bazen şuursuzca IServiceCollection &amp;uuml;zerinden bağımlıkları kayıt&amp;nbsp;etmemize olanak sağlayan bu kavram esas itibariyle Single Responsibility, Dependency Inversion Principle ve Inversion of Control&amp;nbsp;esasları &amp;uuml;zerine oturuyor. Bu sebepten basit bir Asp.Net Core eğitimine başlarken bile sadece Model nesnesi oluşturup bir liste d&amp;ouml;nd&amp;uuml;ren Controller ile View&amp;nbsp;kullanmak kafi olmayabilir. &amp;Ouml;ncesinde ve mutlak suretle eğitimdeki değerli zihinlere .Net Core'un DI mekanizmasının nasıl &amp;ccedil;alıştığını, neden &amp;ouml;nemli olduğunu g&amp;ouml;stermek gerekir...&lt;/p&gt;
&lt;p&gt;Diye notlar alarak ge&amp;ccedil;mişim bu yazının başına. Amacım, eğitim i&amp;ccedil;in basit ve hızlı okunabilir bir &amp;ouml;n dok&amp;uuml;man hazırlamaktı. Bu dok&amp;uuml;manı eğitim katılımcılarına g&amp;ouml;nderip, "şuna bir g&amp;ouml;z atın, anlamaya &amp;ccedil;alışın, sondaki sorulara cevaplar bulun ve derse &amp;ouml;yle gelin" demekti belki de. Sonunda aşağıdaki i&amp;ccedil;eriğe sahip basit bir rehber ortaya &amp;ccedil;ıktı&lt;em&gt;(Level 101 diyebiliriz)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;Hello World'ler artık bildiğim Hello World'ler gibi değiller.&lt;/p&gt;
&lt;h2&gt;Sıfır Noktası&lt;/h2&gt;
&lt;p&gt;Şu bir ger&amp;ccedil;ek ki, Asp.Net Core tarafında kullanılan MVC, Razor, Blazor, Web API vb uygulama tipleri ile bunların sıklıkla kullandığı Hosting, Routing, Logging, Configuration, ApplicationLifetime gibi servisler doğrudan Microsoft.Extensions.DependencyInjection yapısı &amp;uuml;zerine oturuyorlar&lt;em&gt;(Bu arada Microsoft.Extensions.DependencyInjection k&amp;uuml;t&amp;uuml;phanesinin harici olarak da kullanılabilen bir NuGet paketi olduğunu ve bu sepele bir Console uygulamasında dahi DI mekanizmasını kullanabilmemize olanak sağladığını da hatırlatalım)&lt;/em&gt; Onlar i&amp;ccedil;in ekstra bir &amp;ccedil;aba sarf etmeden daha &amp;ccedil;alışma zamanı ayağa kalkarken sisteme dahil ediliyorlar. Aslında yine kavramlar arasında kayboluyor gibiyiz. Belki de DI kullanmadığımız bir &amp;ouml;rnekteki basit kusuru g&amp;ouml;rmeye &amp;ccedil;alışırsak daha iyi olur. DI demişken bu kısaltmanın adını duymuş olmalısın; Dependency Injection! Bu terime alışsan iyi olur, nitekim şirketin temel&amp;nbsp;ilkelerinden birisi de onunla iyi ge&amp;ccedil;inmek.&amp;nbsp;Ancak &amp;ouml;ncesinde sana problemi g&amp;ouml;stermem lazım. Yazılımcıların pek de sevmediği bir durum. Tightly-Coupled&lt;em&gt;(birbirine sıkı sıkıya bağlı)&lt;/em&gt; olma hali. Haydi gel, bir &amp;ouml;rnekle durumu a&amp;ccedil;ıklayalım.&lt;/p&gt;
&lt;p&gt;Sisteminde .Net 5 y&amp;uuml;kl&amp;uuml;ğ&amp;uuml; olduğunu varsayıyorum. Hangi platformda olduğunun &amp;ccedil;ok da &amp;ouml;nemi yok. Bir Terminal penceresi a&amp;ccedil; ve aşağıdaki komutu işleterek basit bir MVC projesi oluştur.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new mvc -o FunnyHello&lt;/pre&gt;
&lt;h2&gt;Masum Kodlar Basamağı&lt;/h2&gt;
&lt;p&gt;Sonrasında Visual Studio Code, Visual Studio 2019 Community Edition&amp;nbsp;veya muadili bir IDE ile projeni a&amp;ccedil;. Model klas&amp;ouml;r&amp;uuml;nde aşağıdaki i&amp;ccedil;eriğe sahip Game isimli bir sınıf oluştur ve ilk kodlarını yazmış ol. Sen ve arkadaşlarının sevdiği oyunların isimlerini ve liste fiyatlarını tutacağımız basit bir nesne bu aslında.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace FunnyHello.Models
{
    public class Game
    {
        public int Id { get; set; }
        public string Title { get; set; }
        public decimal ListPrice { get; set; }
    }
}&lt;/pre&gt;
&lt;p&gt;Başka bir zaman diliminde onu&amp;nbsp;Entity Framework Core &amp;uuml;st&amp;uuml;nden SQL ile ya da Azure Cosmos Db ile veya istediğin başka bir Repository ile ilişkilendirebilirsin. Şimdilik Web uygulaması alanında dolaşımda olacak ve kullanıcının g&amp;ouml;receği sayfayı kurgulayan View nesnesi i&amp;ccedil;in anlam ifade eden bir model şablonu olduğunu s&amp;ouml;ylesek yeterli.&amp;nbsp;Sıradaki adımımız Data isimli bir klas&amp;ouml;r oluşturmak ve i&amp;ccedil;erisine aşağıdaki i&amp;ccedil;eriğe sahip GameRepository sınıfını yerleştirmek.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using FunnyHello.Models;
using System.Collections.Generic;

namespace FunnyHello.Data
{
    public class GameRepository
    {
        public List&amp;lt;Game&amp;gt; GetAllGames()
        {
            return new List&amp;lt;Game&amp;gt;
            {
                new Game{ Id=1, Title="Commandos II",ListPrice=10.5M },
                new Game{ Id=2, Title="Prince of Persia",ListPrice=9.45M },
                new Game{ Id=3, Title="Prince of Persia",ListPrice=9.45M }
            };
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bizi sonuca g&amp;ouml;t&amp;uuml;recek, g&amp;ouml;rsel ortamda birka&amp;ccedil; veriyi kullanmamızı sağlayan aptalca bir sınıftan başka bir şey değil ama senaryo i&amp;ccedil;in yeterli. Şu ana kadar seni zorlayan pek bir şey olmadığı d&amp;uuml;ş&amp;uuml;ncesindeyim. Haydi o zaman devam edelim. Madem Model View Controller t&amp;uuml;revli bir Web uygulaması geliştiriyoruz, View ile Model arasındaki iletişim Controller sınıfının g&amp;ouml;revi olmalı. &amp;Ouml;yleyse hali hazırda var olan Controllers klas&amp;ouml;r&amp;uuml;ne GameController isimli yeni bir sınıf ekle ve kodlamasını aşağıdaki gibi yaparak devam et. MVC ve detayları i&amp;ccedil;inse &amp;uuml;z&amp;uuml;lme. Eğitim sırasından ondan da bolca bahsedeceğiz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using FunnyHello.Data;
using Microsoft.AspNetCore.Mvc;

namespace FunnyHello.Controllers
{
    public class GameController : Controller
    {
        public IActionResult Index()
        {
            GameRepository gameRepository = new GameRepository();
            var games = gameRepository.GetAllGames();
            return View(games);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Gayet pr&amp;uuml;zs&amp;uuml;z bir sınıf. Controller t&amp;uuml;revli olması bir yana dursun Index isimli fonksiyon&lt;em&gt;(ki uygulama i&amp;ccedil;in &amp;ccedil;ağırılabilir bir Action anlamına geliyor)&lt;/em&gt; GameRepository sınıfını kullanarak oyun listesini alıp kendisi ile ilişkili olan View'a g&amp;ouml;nderiyor. Hangi View'a gideceğini nereden mi biliyor? Hımmm...Bunu bir d&amp;uuml;ş&amp;uuml;nelim. GameController'ın Controller kelimesini &amp;ccedil;ıkarırsak geriye Game kalıyor. View tarafında da Game isimli bir klas&amp;ouml;r olur ve i&amp;ccedil;inde Index isimli bir sayfa olursa sanırım otomatik bir y&amp;ouml;nlendirme d&amp;uuml;zeneği tesis edilmiş olur. Aynı varsayılan şablonla gelen HomeController ve View/Home alıntdaki Index.cshtml d&amp;uuml;zeneğinde olduğu gibi. O halde sıradaki g&amp;ouml;revin belli. View klas&amp;ouml;r&amp;uuml;ne ge&amp;ccedil;ip Game isimli yeni bir klas&amp;ouml;r oluştur ve altına aşağıdaki i&amp;ccedil;eriğe sahip Index.cshtml dosyasını ekle.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;@model IEnumerable&amp;lt;Game&amp;gt;

&amp;lt;div&amp;gt;
    &amp;lt;h1&amp;gt;T&amp;uuml;m Oyunlar&amp;lt;/h1&amp;gt;
    &amp;lt;hr /&amp;gt;
    &amp;lt;table&amp;gt;
        &amp;lt;thead&amp;gt;
            &amp;lt;tr&amp;gt;
                &amp;lt;th&amp;gt;Id&amp;lt;/th&amp;gt;
                &amp;lt;th&amp;gt;Title&amp;lt;/th&amp;gt;
                &amp;lt;th&amp;gt;List Price&amp;lt;/th&amp;gt;
            &amp;lt;/tr&amp;gt;
        &amp;lt;/thead&amp;gt;
        @foreach (var g in Model)
        {
            &amp;lt;tr&amp;gt;
                &amp;lt;td&amp;gt;@g.Id&amp;lt;/td&amp;gt;
                &amp;lt;td&amp;gt;@g.Title&amp;lt;/td&amp;gt;
                &amp;lt;td&amp;gt;@g.ListPrice&amp;lt;/td&amp;gt;
            &amp;lt;/tr&amp;gt;
        }
    &amp;lt;/table&amp;gt;
&amp;lt;/div&amp;gt;&lt;/pre&gt;
&lt;p&gt;Belki&amp;nbsp;kafana takılan bazı sorular olabilir. Neden başlangı&amp;ccedil;a @model diye bir direktif var? Bu sayfa ile arka plandaki nesneler arasında gerekli olan bağlantı nasıl ger&amp;ccedil;ekleşiyor? for d&amp;ouml;ng&amp;uuml;s&amp;uuml;n&amp;uuml; biliyorum lakin buradaki kullanım t&amp;uuml;m oyun listesini dolaşmak i&amp;ccedil;in mi acaba? ve benzerleri. L&amp;uuml;tfen sabırlı ol. Amacımız şimdilik bu detaylarla ilgili değil. Minik bir par&amp;ccedil;a daha ekleyelim. Shared klas&amp;ouml;r&amp;uuml;ndeki _Layout.cshtml sayfasını bul ve i&amp;ccedil;erisine aşağıdaki kod par&amp;ccedil;asını ekle.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;li class="nav-item"&amp;gt;
   &amp;lt;a class="nav-link text-dark" asp-area="" asp-controller="Game" asp-action="Index"&amp;gt;Games&amp;lt;/a&amp;gt;
&amp;lt;/li&amp;gt;&lt;/pre&gt;
&lt;p&gt;Nereye koyman gerektiğini s&amp;ouml;ylemiyorum ancak basit&amp;ccedil;e bulacağından eminim ;) Tahmin edeceğin &amp;uuml;zere yeni bir men&amp;uuml; &amp;ouml;ğesi yerleştirdik ve ona basılınca hangi Controller nesnesinin hangi Action &amp;uuml;yesinin tetiklenmesi gerektiği ifade ettik. Eğer hazırsan terminalden &lt;em&gt;&lt;strong&gt;dotnet run&lt;/strong&gt;&lt;/em&gt;&amp;nbsp;komutunu vererek ya da Visual Studio ortamındaysan F5 tuşuna basarak &amp;ouml;rneği &amp;ccedil;alıştırabilirsin. Aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer bir sonu&amp;ccedil; elde etmeni bekliyorum.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Nisan/hellomvc_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Nasıl? Hi&amp;ccedil; yoktan iyidir değil mi? Mesela oyun bilgilerinin veritabanından geldiğini d&amp;uuml;ş&amp;uuml;n. Hatta yeni oyun ekleme, fiyat değiştirme, oyunlara kapak fotoğrafları ekleme, yorum alma ve puan verme gibi kullanıcı etkileşimi y&amp;uuml;ksek fonksiyonellikler dahil ettiğini d&amp;uuml;ş&amp;uuml;n. Hatta &amp;ouml;ny&amp;uuml;z tarafında hazır Bootstrap &amp;ccedil;atısını kullanarak makyaj yaptığını ve albenisi y&amp;uuml;ksek, moda tabirle UX&lt;em&gt;(User Experience)&lt;/em&gt; a&amp;ccedil;ısından zengin bir uygulama inşa ettiğini. Etkileyici bir Web uygulaması ortaya koymamız işten bile değil :) Ama ortada bir sorun var gibi.&lt;/p&gt;
&lt;h2&gt;Problem Ne?&lt;/h2&gt;
&lt;p&gt;Şu anda bir MVC uygulamasına Hello World demiş olduğumuzu sanabilirsin. Biraz &amp;uuml;st&amp;uuml;nde durup d&amp;uuml;ş&amp;uuml;n&amp;uuml;nce, Controller sınıfının ne yaptığını, View bileşeninin bir Action ile nasıl ilişkilendiğini ve kendisi ile alakalı model nesnelerini nasıl kullandığını anlamış olabilirsin. Ne var ki uygulama şirketimizde &amp;ccedil;alışan yazılımcıların rahatsız olacağı bir kod par&amp;ccedil;ası i&amp;ccedil;eriyor. Biraz d&amp;uuml;ş&amp;uuml;n&amp;uuml;p neresi olduğunu bulmak ister misin? Arzu edersen bunu bir kahve molası eşliğinde daha da derinlemesine d&amp;uuml;ş&amp;uuml;nebilirsin.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Nisan/matt-hoffman-ZUUsGnG5zwc-unsplash.jpg" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Photo by &lt;a href="https://unsplash.com/@__matthoffman__?utm_source=unsplash&amp;amp;utm_medium=referral&amp;amp;utm_content=creditCopyText"&gt;Matt Hoffman&lt;/a&gt; on &lt;a href="https://unsplash.com/s/photos/coffee-break?utm_source=unsplash&amp;amp;utm_medium=referral&amp;amp;utm_content=creditCopyText"&gt;Unsplash&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Tekrar hoşgeldin ;) GameController i&amp;ccedil;erisindeki aşağıdaki kullanıma odaklanmalısın. Bu kullanım yazılımcıların hoşuna gitmez. Gelecek ile ilgili&amp;nbsp;endişeler duymalarına sebebiyet verir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;GameRepository gameRepository = new GameRepository();&lt;/pre&gt;
&lt;p&gt;Bunda ne sorun olabilir ki dediğini duyar gibiyim. Aynen bana da &amp;ouml;ğretildiği &amp;uuml;zere oyun nesnesi &amp;uuml;st&amp;uuml;nde temel CRUD&lt;em&gt;(Create Read Update Delete)&lt;/em&gt; operasyonlarını &amp;uuml;stelenen ve dolayısıyla sadece bu sorumluluğu &amp;uuml;st&amp;uuml;ne alan bir sınıfın nesne &amp;ouml;rneğini alıp g&amp;uuml;zelce kullandın. Bir şekillde ifade etmek istersek kabaca aşağıdaki gibi bir durumun s&amp;ouml;z konusu olduğunu ifade edebilirim&amp;nbsp;&lt;em&gt;(Ve l&amp;uuml;tfen &amp;ccedil;izimimin k&amp;ouml;t&amp;uuml; olmasına aldırma)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Nisan/hellomvc_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İşte o terim; Tightly-Coupled! Yine karşımıza &amp;ccedil;ıktı :D Sorun, GameController nesnesinin GameRepository sınıfını doğrudan kullanması. Bu sıkı bir arkadaşlığın g&amp;ouml;stergesi gibi. Ancak uygulama kodları arttık&amp;ccedil;a ve proje ister istemez b&amp;uuml;y&amp;uuml;d&amp;uuml;k&amp;ccedil;e GameRepository nesnesinin farklı yerlerde kullanımı da s&amp;ouml;z konusu olacak. Ya Low-level bileşen olarak ifade edilen GameRepository'nin&lt;em&gt;(yapması gereken işle ilgili kaynaklara doğrudan erişip karmaşık bir şeyler yapan nesne)&lt;/em&gt; işleyişi farklılaşır veya adı değişirse? Ya onu kullanan bir test metodunda ger&amp;ccedil;ekten veritabanına gitmeden sırf test senaryosunun kalanını işletmek i&amp;ccedil;in hayali bir Game listesi d&amp;ouml;nd&amp;uuml;rmesi istenen bir fonksiyon gerekirse? Mesela GameRepository, GameController'a k&amp;uuml;ser ve fonksiyonunu kaldırırsa :P İşin şakası bir yana GameController'ın &amp;ccedil;alışması ve oyuncu listesini View'a vermesi, GameRepository'nin ellerindedir. Bu sıkı bağımlı bileşkeler GameRepository'yi başka bir şeyle değiştirmeyi zorlaştırır.&lt;/p&gt;
&lt;h2&gt;Nasıl &amp;Ccedil;&amp;ouml;zeriz?&lt;/h2&gt;
&lt;p&gt;Sanırım sorun kısmen de olsa anlaşıldı. Bu ikili arasındaki sıkı dostluğa lafımız yok ama ilişkilerine bir mesafe koymalarında yarar var. Peki ya bunu nasıl sağlarız? Aşağıdaki şekle bakmadan biraz d&amp;uuml;ş&amp;uuml;n derdim ama şu anda onu g&amp;ouml;rd&amp;uuml;ğ&amp;uuml;n&amp;uuml; biliyorum :)&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Nisan/hellomvc_3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Yapılması gereken GameController'ı GameRepository sınıfından koparmak ve aradaki ipleri gevşetmek&lt;em&gt;(Loosely-Coupled ilkesini sağlanması)&lt;/em&gt;&amp;nbsp;Bir başka deyişle, High-Level Component olan GameController ile asıl işi yapan Low-Level Component GameRepository arasına soyut bir katman&lt;em&gt;(abstraction layer)&lt;/em&gt;&amp;nbsp;koymak. Asıl işi yapan sınıfın detaylarını umursamayan ve asıl işi yapan sınıfın yaptığı işe ihtiya&amp;ccedil; duyan GameController sınıfının isteklerine el&amp;ccedil;i olan. Ayrıca oyunun kurallarını bir s&amp;ouml;zleşme ile belirleme ve ger&amp;ccedil;ekten de Controller'ın ihtiyacı olan fonksiyonları verecek asıl nesneyi kullandırma imkanına sahip olacağız. Nesne y&amp;ouml;nelimli diller a&amp;ccedil;ısından baktığımızda bunun en pratik yolu Interface tipini kullanmak. Şimdi &amp;uuml;st&amp;uuml;nl&amp;uuml;ğ&amp;uuml; ele ge&amp;ccedil;irelim. Yine Data klas&amp;ouml;r&amp;uuml; altına ge&amp;ccedil; ve IGameRepository isimli aşağıdaki aray&amp;uuml;z&amp;uuml; ekleyerek &amp;ccedil;alışmana devam et.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using FunnyHello.Models;
using System.Collections.Generic;

namespace FunnyHello.Data
{
    public interface IGameRepository
    {
        IEnumerable&amp;lt;Game&amp;gt; GetAllGames();
    }
}&lt;/pre&gt;
&lt;p&gt;GameRepository sınıfını bu aray&amp;uuml;zden t&amp;uuml;ret&lt;em&gt;(Belki bir d&amp;ouml;n&amp;uuml;ş tipi d&amp;uuml;zeltmesi de yapman gerekebilir)&lt;/em&gt; Aynen aşağıdaki kod par&amp;ccedil;asında olduğu gibi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using FunnyHello.Models;
using System.Collections.Generic;

namespace FunnyHello.Data
{
    public class GameRepository
        :IGameRepository
    {
        public IEnumerable&amp;lt;Game&amp;gt; GetAllGames()
        {
            return new List&amp;lt;Game&amp;gt;
            {
                new Game{ Id=1, Title="Commandos II",ListPrice=10.5M },
                new Game{ Id=2, Title="Prince of Persia",ListPrice=9.45M },
                new Game{ Id=3, Title="Prince of Persia",ListPrice=9.45M }
            };
        }
    }
}&lt;/pre&gt;
&lt;p&gt;G&amp;uuml;zellll! Gayet iyi gidiyorsun. Artık GameController sınıfına ge&amp;ccedil;ebilir ve GameRepository yerine eklediğimiz soyutlamayı kullanmasını sağlayabilirsin. Bunun i&amp;ccedil;in GamesController sınıfının ilgili interface tipi ile &amp;ccedil;alışmasını sağlaman lazım. Bildiğin gibi bir interface aslında soyutlama i&amp;ccedil;in kullanılan bir s&amp;ouml;zleşmedir&lt;em&gt;(Contract)&lt;/em&gt;&amp;nbsp;ve sadece &amp;ccedil;ağırılacak asıl nesnenin i&amp;ccedil;indeki fonksiyonların neler olduğunu GamesController'a s&amp;ouml;ylemekle y&amp;uuml;k&amp;uuml;ml&amp;uuml;d&amp;uuml;r. Şunu da biliyorsun ki Interface gibi arabulucu s&amp;ouml;zleşmeler sınıflar gibi &amp;ouml;rneklenip kullanılamazlar&lt;em&gt;(new operat&amp;ouml;r&amp;uuml; ile onları &amp;ouml;rnekleyemezsin)&lt;/em&gt;&amp;nbsp;ama nesne referansı taşıyabilirler ;) Belki de onu Controller sınıfına Constructor metot &amp;uuml;st&amp;uuml;nden alıp kullanabiliriz ;)&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using FunnyHello.Data;
using Microsoft.AspNetCore.Mvc;

namespace FunnyHello.Controllers
{
    public class GameController : Controller
    {
        private readonly IGameRepository _gameRepository;
        public GameController(IGameRepository gameRepository)
        {
            _gameRepository = gameRepository;
        }
        public IActionResult Index()
        {
            //GameRepository gameRepository = new GameRepository();
            var games = _gameRepository.GetAllGames();
            return View(games);
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Harika! Sonuca &amp;ccedil;ok yaklaştın. Haydi uygulamayı tekrar &amp;ccedil;alıştırda, her şey yolunda mı g&amp;ouml;relim ;)&lt;/p&gt;
&lt;h2&gt;Aaa...Houston. We have a problem!&lt;/h2&gt;
&lt;p&gt;Galiba sende benim gibi hi&amp;ccedil; beklenmedik bir hata ile karşılaştın.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2021/Nisan/hellomvc_4.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu &amp;ccedil;alışma zamanı hatası da nereden &amp;ccedil;ıktı şimdi!? Doğruyu s&amp;ouml;ylemek gerekirse pek de sevimli bir ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; değil. Oysaki uygulama derlenebiliyor. Senden ricam StackTrace i&amp;ccedil;eriği ile birlikte&amp;nbsp;hata mesajını dikkatlice okuman.&lt;/p&gt;
&lt;p&gt;Sorunu g&amp;ouml;rebildin mi?&lt;/p&gt;
&lt;p&gt;GameController sınıfına tekrar d&amp;ouml;n. Yapıcı metot parametre olarak IGameRepository şeklinde bir interface referansı alıyor. Bir başka deyişle, IGameRepository aray&amp;uuml;z&amp;uuml;n&amp;uuml; uygulayan herhangi bir sınıf bu yapıcı metoda referans olarak taşınıyor. Lakin .Net &amp;ccedil;alışma zamanı bunu hen&amp;uuml;z bilmiyor. Bir yerlerde bir şekilde IGameRepository g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; anda "Acaba bana ihtiyacım olan bir GameRepository nesnesi verebilir misin?" diyebilmeliyiz. İşte Dependency Inversion Principle'ın s&amp;uuml;re&amp;ccedil; y&amp;ouml;neticisi Inversion of Control'un el&amp;ccedil;isi Dependency Injection Container'ların dile geldiği yerdeyiz.&lt;/p&gt;
&lt;h2&gt;Ne Gerektiğini S&amp;ouml;ylemek&lt;/h2&gt;
&lt;p&gt;.Net Core i&amp;ccedil;erisindeki built-in DI mekanizması &amp;ccedil;alışma zamanında yukarıdaki senaryoda g&amp;ouml;r&amp;uuml;len bağımlıkların kolayca tanımlanmasına izin verir. Asp.Net tarafı s&amp;ouml;z konusuysa burası Startup sınıfı i&amp;ccedil;erisindeki IServiceCollection aray&amp;uuml;z&amp;uuml;n&amp;uuml;n kullanıldığı ConfigureServices metodudur. Oraya aşağıdaki kod par&amp;ccedil;asını eklemeni rica ediyorum &lt;em&gt;(AddTransient metoduna şimdilik takılma. Raf &amp;ouml;mr&amp;uuml;ne g&amp;ouml;re farklı kullanım senaryolarımız da var)&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public void ConfigureServices(IServiceCollection services)
{
	services.AddControllersWithViews(); //Burası zaten var
	services.AddTransient&amp;lt;IGameRepository, GameRepository&amp;gt;();
}&lt;/pre&gt;
&lt;p&gt;Artık &amp;ccedil;alışma zamanında GameController nesnesi IGameRepository &amp;uuml;st&amp;uuml;nden bir fonksiyon işletmek istediğinde ger&amp;ccedil;ekten o işi yapacak asıl nesne&lt;em&gt;(ki senaryomuza g&amp;ouml;re GameController)&lt;/em&gt;&amp;nbsp;elinde hazır olacak. IGameRepository'nin belirlediği s&amp;ouml;zleşme kurallarının dışına &amp;ccedil;ıkmadığın s&amp;uuml;rece GameController, GameRepository'deki değişimlerden zerre kadar etkilenmeyecek ;)&lt;/p&gt;
&lt;p&gt;Tebrik ediyorum. Eğitimden &amp;ouml;nce yapman gereken hazırlığı bitirdin ve ger&amp;ccedil;ek anlamda Asp.Net Core i&amp;ccedil;in Hello World dedin. &amp;Uuml;stelik bunu Constructor Injection tekniği ile yaptın ki bunun dışında&amp;nbsp;metot ve &amp;ouml;zellik(property) seviyesinde bile Injection tekniklerini kullanacaksın. Lakin her şey daha yeni başlıyor. Neredeyse t&amp;uuml;m .Net 5 projelerinde bu DI mekanizmasını kullanacağız. Hatta yarın katmanlar artacak, servisler &amp;ccedil;oğalacak, repository'ler yerlerini belki de CQRS&lt;em&gt;(Command and Query Responsibility Segregation)&lt;/em&gt;&amp;nbsp;desenine&amp;nbsp;bırakacak, nesne arası bağımlılıklar uzak servislere de sı&amp;ccedil;rayacak vs. T&amp;uuml;m bu ser&amp;uuml;ven sırasında DI Container'lar hep seninle olacak.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;Senden istediğim birka&amp;ccedil; şey daha var. Bu bir sonraki adımın i&amp;ccedil;in iyi bir hazırlık olabilir. Şu senaryoyu d&amp;uuml;ş&amp;uuml;n;&lt;/p&gt;
&lt;p&gt;Sisteme yeni oyun ekleme &amp;ouml;zelliği sunan bir fonksiyonun olsun. Bir oyun eklendiğinde, &amp;uuml;yelere mail ile bildirim yapacak bir sistem de kurgulamak&amp;nbsp;istiyorsun. SQL'deki trigger veya Button'a basılınca &amp;ccedil;alışan Click olayı gibi. Şu an bunu GameRepository sınıfına ekleyeceğin bir Add metodu i&amp;ccedil;inden yaparsın diye tahmin ediyorum. G&amp;ouml;nderim işini ise MailSender isimli bir sınıfla ger&amp;ccedil;ekleştirmeyi d&amp;uuml;ş&amp;uuml;nebilirsin. Ancak GameRepository ile MailSender birbirlerine sıkı sıkıya bağlı &lt;span style="text-decoration: underline;"&gt;olmamalılar&lt;/span&gt;. Bu bağımlılığı &amp;ccedil;&amp;ouml;z ;)&lt;/p&gt;
&lt;p&gt;Tamam tamam. Seni rahat bırakacağım artık. L&amp;uuml;tfen son olarak aşağıdaki maddelere de bir g&amp;ouml;z at ve cevaplarını dok&amp;uuml;mante etmeye &amp;ccedil;alış.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Single Responsibility, Dependency Inversion prensiplerini, onları bilmeyen birisine nasıl anlatırsın?&lt;/li&gt;
&lt;li&gt;Inversion of Control, Dependency Inversion Principle ile aynı şey midir? Farklarını nasıl tanımlarsın?&lt;/li&gt;
&lt;li&gt;High-Level Component ve Low-Level Component ne demektir? Araştırıp birer c&amp;uuml;mle ile tarifler misin?&lt;/li&gt;
&lt;li&gt;Projedeki Data i&amp;ccedil;eriğini harici bir k&amp;uuml;t&amp;uuml;phaneye alıp kullanabilir misin?&lt;/li&gt;
&lt;li&gt;Sence DI Container kullanımının artıları nelerdir?&lt;/li&gt;
&lt;li&gt;Constructor dışında bir nesne bağımlılığını bildirmenin farklı yolları olabilir mi? Varsa bunları araştırıp &amp;ouml;rnekler misin?&lt;/li&gt;
&lt;li&gt;&amp;Ouml;rnekte kullanıdığımız Transient fonksiyonu tam olarak ne&amp;nbsp;anlama&amp;nbsp;geliyor? Onun yerini alacak farklı versiyonlar varsa bir bakar mısın?&lt;/li&gt;
&lt;li&gt;&amp;Ouml;rnekte Built-In mekanizma yerine &amp;ouml;rneğin Unity veya Ninject'i kullanmayı dener misin?&lt;/li&gt;
&lt;/ul&gt;
&lt;h2&gt;Son Dakika Gelişmesi&lt;/h2&gt;
&lt;p&gt;Eğer Constructor Injection dışındaki method, property ve view(Asp.Net MVC 6 sonrası geldi) t&amp;uuml;revli tekniklerin basit uygulamasına bakmak istersen &lt;a href="https://github.com/buraksenyurt/hands-on-aspnetcore-di" target="_blank"&gt;github'a eklediğim hands-on-aspnetcore-di reposu&lt;/a&gt;na uğramanı tavsiye edebilirim. Bu repoda varsayılan main haricinde initial, constructor-injection, method-injection, property-injection ve view-injection isimli ayrı branch'ler var. İşe yarayan bir &amp;ouml;rnek değil ama temiz bir bi&amp;ccedil;imde bu farklı teknikleri nasıl uygulayabileceğini g&amp;ouml;steriyor ;)&lt;/p&gt;
&lt;p&gt;Eğitimde g&amp;ouml;r&amp;uuml;şmek &amp;uuml;zere ;) Sağlıklı g&amp;uuml;nler.&lt;/p&gt;</content>
  <pubDate>2021-04-25 09:00:00</pubDate>
  <slug>asp-net-core-a-nasil-merhaba-deriz</slug>
  <tags>
    <tag>net-5</tag>
    <tag>net-core</tag>
    <tag>aspnet-mvc</tag>
    <tag>dependency-injection</tag>
    <tag>solid</tag>
    <tag>inversion-of-control</tag>
    <tag>dependency-inversion-principle</tag>
    <tag>mvc</tag>
    <tag>model-view-controller</tag>
    <tag>visual-studio</tag>
  </tags>
  <categories>
    <category>.Net Core</category>
  </categories>
</post>