<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Meraklısına NuGet ve NLog ile 5 Dakikada Loglama</title>
  <description />
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Log&lt;/strong&gt;lama kodlamanın vazge&amp;ccedil;ilmez unsurlarından birisidir. Ayrıca &lt;strong&gt;Enterprise&lt;/strong&gt; seviyedeki &amp;ccedil;&amp;ouml;z&amp;uuml;mlerde kullanılan &amp;ouml;nemli &lt;strong&gt;CrossCutting&lt;/strong&gt;' ler arasında yer almaktadır. Uygulamaların &amp;ccedil;eşitli yerlerinde &amp;ccedil;eşitli seviyelerde log atma işlemleri sıklıkla icra edilir. Bu işlemler, olası &lt;strong&gt;Exception&lt;/strong&gt;&amp;rsquo; ların tespit edilmesi, işleyen s&amp;uuml;re&amp;ccedil;lerde hareket eden verilerin tarihsel anlamda izlenmesi, uygulamaların sağlık durumları hakkında bilgi edinip tedbirler alınması, buna bağlı olarak gerekli sistemsel birimlerin uyarılması gibi durumlarda olduk&amp;ccedil;a işe yaramaktadır. Her ne kadar kayıt altına alınacak verilerin ne olacağına karar vermek zor olsa da Loglama &amp;ccedil;oğu zaman hayat kurtarır.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;
&lt;object width="640" height="360"&gt;
&lt;param name="movie" value="//www.youtube.com/v/-d6m3grc28k?version=3&amp;amp;hl=en_US" /&gt;
&lt;param name="allowFullScreen" value="true" /&gt;
&lt;param name="allowscriptaccess" value="always" /&gt;&lt;embed type="application/x-shockwave-flash" width="640" height="360" src="//www.youtube.com/v/-d6m3grc28k?version=3&amp;amp;hl=en_US" allowfullscreen="true" allowscriptaccess="always"&gt;&lt;/embed&gt;
&lt;/object&gt;
&lt;/p&gt;
&lt;p&gt;G&amp;uuml;n&amp;uuml;m&amp;uuml;zde loglama &amp;ouml;zelliği taşımayan bir &lt;strong&gt;Enterprise&lt;/strong&gt; &amp;ccedil;&amp;ouml;z&amp;uuml;m g&amp;ouml;rmemiz neredeyse imkansızdır. &lt;strong&gt;Ar-Ge&lt;/strong&gt; ve taşıdığı yazılım prensiplerinin uygulanma şekillerini &amp;ouml;ğrenmek gibi ama&amp;ccedil;lar dışında kimse sıfırdan bir Loglama mekanizması &lt;span style="text-decoration: underline;"&gt;geliştirmemektedir&lt;/span&gt;. Bunun yerine hazır olarak sunulan a&amp;ccedil;ık kaynak k&amp;uuml;t&amp;uuml;phanaler kullanılmaktadır. Hatta elinizin altında &lt;strong&gt;NuGet&lt;/strong&gt; gibi bir paket y&amp;ouml;netim aracı varsa, &amp;uuml;zerinde &amp;ccedil;alıştığınız projeye birka&amp;ccedil; adımda loglama kabiliyeti kazandırmak olduk&amp;ccedil;a kolaydır. Nasıl mı? Haydi gelin 5 dakikada loglama yapalım.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;&lt;span style="color: #ff0000;"&gt;Not : G&amp;uuml;ncel NLog s&amp;uuml;r&amp;uuml;m&amp;uuml;n&amp;uuml; kontrol edin. Metodların kullanım şekillerinde farklılıklar olabilir ama teori aynıdır.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;</content>
  <pubDate>2014-06-20 20:12:00</pubDate>
  <slug>Meraklc4b1sc4b1na-NuGet-ve-NLog-ile-5-Dakikada-Loglama</slug>
  <tags />
  <categories>
    <category>.Net Framework 4.5</category>
  </categories>
</post>