<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Ado.Net Entity Framework' de Lazy ve Eager Loading</title>
  <description>Bildiğiniz üzere uzun bir süre önce Microsoft, LINQ to SQL yerine Ado.Net Entity Framework ile ilerleme kararı aldı. Bu konu ile ilişkili olaraktan okuduğum hemem hemen bütün kitaplarda Ado.Net' in geleceğinde önemli bir yere sahip olan Ado.Net Entity Framework alt yapısının geliştiriciler tarafından asla ihmal edilmemesi gerektiğide sıkça vurgulanmakta. Peki günlüğüme konu olan mesele nedir?</description>
  <content>&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Bildiğiniz &amp;uuml;zere uzun bir s&amp;uuml;re &amp;ouml;nce Microsoft, &lt;strong&gt;LINQ to SQL&lt;/strong&gt; yerine &lt;strong&gt;Ado.Net Entity Framework&lt;/strong&gt; ile ilerleme kararı aldı. Bu konu ile ilişkili olaraktan okuduğum hemem hemen b&amp;uuml;t&amp;uuml;n kitaplarda &lt;strong&gt;Ado.Net&lt;/strong&gt;' in geleceğinde &amp;ouml;nemli bir yere sahip olan &lt;strong&gt;Ado.Net Entity Framework &lt;/strong&gt;alt yapısının geliştiriciler tarafından asla ihmal edilmemesi gerektiğide sık&amp;ccedil;a vurgulanmakta. Peki g&amp;uuml;nl&amp;uuml;ğ&amp;uuml;me konu olan mesele nedir?&lt;/p&gt;
&lt;p&gt;Aslında g&amp;uuml;nl&amp;uuml;ğe yazmadan &amp;ouml;nce odaklandığım nokta, aralarında &lt;strong&gt;master-detail&lt;/strong&gt; ilişki bulunan tablo verilerinin, &lt;strong&gt;LINQ to SQL&lt;/strong&gt; tarafında nasıl y&amp;uuml;klendiğinin incelenmesiydi. Dolayısıyla &amp;ouml;nce &lt;strong&gt;LINQ to SQL&lt;/strong&gt; tarafındaki duruma bir g&amp;ouml;z atmakya yarar var. İşe &amp;ouml;ncelikle basit bir &lt;strong&gt;Console&lt;/strong&gt; uygulamasında kobay nesnelerimizden &lt;strong&gt;Northwind&lt;/strong&gt; veritabanını kullanarak başlayabiliriz. Burada &lt;strong&gt;Visual Studio 2008&lt;/strong&gt; &amp;uuml;zerinde ve &lt;strong&gt;.Net Framework 3.5&lt;/strong&gt; tabanlı bir geliştirme yaptığımızı belirtelim. S&amp;ouml;z konusu uygulamamızda kullanacağımız&amp;nbsp;&lt;strong&gt;LINQ to SQL&lt;/strong&gt; diagramının i&amp;ccedil;eriği aşağıdaki gibi tasarlanabilir.&lt;img src="/pics/2009%2f4%2fblog1_1.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnekte &lt;strong&gt;Category&lt;/strong&gt; ve&amp;nbsp;&lt;strong&gt;Product&lt;/strong&gt; tablolarına ait tipleri g&amp;ouml;z &amp;ouml;n&amp;uuml;ne almaktayız. Buna g&amp;ouml;re &lt;strong&gt;"Kategoriler ve bu kategorilerdeki toplam &amp;uuml;r&amp;uuml;n sayılarını &amp;ouml;ğrenmek"&lt;/strong&gt; gibi basit bir sonu&amp;ccedil; k&amp;uuml;mesi elde etmek&amp;nbsp;istediğimizde aşağıdakine benzer program kodlarını ele alacağımız muhtemeldir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace BlogSample
{
    class Program
    {
        static void Main(string[] args)
        {
            using (NorthwindDataContext northContext = new NorthwindDataContext())
            {
                // northContext.Log = Console.Out; // İsterseniz SQL sorgularını Console &amp;ccedil;ıktısından da takip edebilirsiniz.
                
                foreach (Category category in northContext.Categories)
                {
                    Console.WriteLine("Category Name :{0} ({1})", category.CategoryName, category.Products.Count);
                }
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Programın bu haliyele &amp;ccedil;ıktısı aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblog1_2.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında istediğimizi elde etmiş g&amp;ouml;r&amp;uuml;n&amp;uuml;yoruz. &lt;img title="Cool" src="/editors/tiny_mce3/plugins/emotions/img/smiley-cool.gif" alt="Cool" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Gayet doğal olarak &lt;strong&gt;foreach&lt;/strong&gt; d&amp;ouml;ng&amp;uuml;s&amp;uuml; i&amp;ccedil;erisinde bir kategoriye bağlı &amp;uuml;r&amp;uuml;n sayıları bulunurken &lt;strong&gt;Count&lt;/strong&gt; &amp;ouml;zelliğinden yararlanılmaktadır. Ancak bu durumda &lt;strong&gt;Lazy Loading&lt;/strong&gt; adı verilen durum oluşmakta ve &lt;strong&gt;SQL&lt;/strong&gt; tarafına bakıldığında olduk&amp;ccedil;a fazla sorgunun &amp;ccedil;alıştığı g&amp;ouml;r&amp;uuml;lmektedir. &amp;Ouml;yleki yukarıdaki kod &amp;ccedil;ıktısı &lt;strong&gt;SQL Profiler&lt;/strong&gt; yardımıyla incelendiğinde ilk sırada aşağıdaki sorgunun &amp;ccedil;alıştığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblog1_3.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere ilk olarak t&amp;uuml;m kategoriler &lt;strong&gt;Select&lt;/strong&gt; sorgusu ile &amp;ccedil;ekilmektedir. Ancak iş bundan sonra biraz daha dikkate değer bir hal alır. Nitekim her kategoriye ait &amp;uuml;r&amp;uuml;n sayıları &lt;strong&gt;Products&lt;/strong&gt; &amp;ouml;zelliği &amp;uuml;zerinden elde edilmek istenmektedir. Bu durumda SQL tarafında her bir kategori satırı i&amp;ccedil;in birer sorgu c&amp;uuml;mlesi&amp;nbsp;daha &amp;ccedil;alıştırılır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblog1_4.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bu bir ka&amp;ccedil; satırlık veri i&amp;ccedil;in &amp;ouml;nemli g&amp;ouml;z&amp;uuml;kmese de, b&amp;uuml;y&amp;uuml;k boyutlu veriler ile &amp;ccedil;alışıldığı durumlarda &amp;ouml;nemli performans kayıplarına neden olabilir. Bu nedenle istenirse &lt;strong&gt;Eager Loading&lt;/strong&gt; isimli bir teknikten de yararlanılabilir. Tek yapılması gereken kod tarafına aşağıdaki değişiklikleri eklemektir.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Data.Linq;

namespace BlogSample
{
    class Program
    {
        static void Main(string[] args)
        {
            using (NorthwindDataContext northContext = new NorthwindDataContext())
            {
                // northContext.Log = Console.Out; // İsterseniz SQL sorgularını Console &amp;ccedil;ıktısından da takip edebilirsiniz.
                DataLoadOptions loadOption = new DataLoadOptions();
                loadOption.LoadWith&amp;lt;Category&amp;gt;(c =&amp;gt; c.Products);
                northContext.LoadOptions = loadOption;

                foreach (Category category in northContext.Categories)
                {
                    Console.WriteLine("Category Name :{0} ({1})", category.CategoryName, category.Products.Count);
                }
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu durumda da&amp;nbsp;kod aynı sonu&amp;ccedil;ları verir ve SQL tarafındaki &amp;ccedil;ıktıya bakıldığına tek bir sorgunun &amp;ccedil;alıştırıldığı g&amp;ouml;zlemlenebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblog1_5.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Ancak en iyi performans i&amp;ccedil;in bu teknikler yerine &lt;strong&gt;Anonymous Type&lt;/strong&gt; kullanılması &amp;ccedil;ok daha doğrudur. &amp;Ouml;yleki sorguda istenen sadece kategori adları ve o kategoriye bağlı &amp;uuml;r&amp;uuml;nlerin toplam sayılarıdır. Oysa ki sorgu c&amp;uuml;mlelerine bakıldığında o anda gerekli olmayan tablo alanlarının da hesaba katıldığı g&amp;ouml;r&amp;uuml;lmektedir. Dolayısıyla sorgunun sadece, &lt;strong&gt;CategoryName&lt;/strong&gt; ve buna bağlı &lt;strong&gt;Product&lt;/strong&gt;&amp;nbsp;satırlarının toplam sayısını bulacak şekilde iyileştirilebilmesi gerekmektedir. Aslında burada &lt;strong&gt;LINQ&lt;/strong&gt; sorgularının &lt;strong&gt;defered execution&lt;/strong&gt; adı verilen &lt;strong&gt;"gerektiği yerde sorguyu g&amp;ouml;nder"&lt;/strong&gt; sistemide &amp;ouml;nemlidir. Kısaca&amp;nbsp;LINQ sorgusunun yazıldığı satırda değilde, ilk kullanıldığı yerde SQL c&amp;uuml;mlesinin g&amp;ouml;nderilmesinden bahsediyoruz.&amp;nbsp;Lafı fazla uzatmadan kod tarafındaki değişikliklerimize bakalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Data.Linq;

namespace BlogSample
{
    class Program
    {
        static void Main(string[] args)
        {
            using (NorthwindDataContext northContext = new NorthwindDataContext())
            {
                var resultSet = from c in northContext.Categories
                                select new
                                {
                                    c.CategoryName,
                                    c.Products.Count
                                };
                foreach (var result in resultSet)
                {
                    Console.WriteLine("Category Name :{0} ({1})", result.CategoryName,result.Count.ToString());
                }
            }
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Bu durumda &lt;strong&gt;SQL&lt;/strong&gt; tarafına giden sorgunun aşağıdaki gibi olduğu g&amp;ouml;r&amp;uuml;lebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblog1_6.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere sadece istediğimiz alanlar sorguya dahil edilmiştir.&lt;/p&gt;
&lt;p&gt;Derken r&amp;uuml;yadan uyanırım ve birden aklıma artık &lt;strong&gt;Ado.Net Entity Framework &lt;/strong&gt;konulu bir yazı yazacağım gelir.&lt;img title="Embarassed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-embarassed.gif" alt="Embarassed" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bakalım o tararfa &lt;strong&gt;Lazy Loading, Eager Loading&lt;/strong&gt; durumları nasıl ele alınabilir. Bu kez projede kullanacağımız tiplerin &lt;strong&gt;EDM(Entity Data&amp;nbsp;Model)&lt;/strong&gt;&amp;nbsp;diagramındaki g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml; aşağıdaki gibidir. Aynen yukarıda &amp;ouml;rneklerde olduğu gibi &lt;strong&gt;Category&lt;/strong&gt; ve &lt;strong&gt;Product&lt;/strong&gt; tablolarını ele alıyor olacağız.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblog1_7.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Şimdi ilk kod par&amp;ccedil;amızı geliştirelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using (NorthwindEntities entity = new NorthwindEntities())
{
	foreach (var category in entity.Categories)
	{
		Console.WriteLine("Category Name :{0}({1})",category.CategoryName,category.Products.Count);
	}
}&lt;/pre&gt;
&lt;p&gt;SQL Profiler'a ge&amp;ccedil;meden &amp;ouml;nce uygulama &amp;ccedil;alıştırıldığında aşağıdaki sonu&amp;ccedil; ile karşılaşılır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblog1_8.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Dikkatli g&amp;ouml;zlerden, &amp;uuml;r&amp;uuml;n sayılarının &lt;strong&gt;0&lt;/strong&gt; olarak geldiği ka&amp;ccedil;mayacaktır. &lt;strong&gt;SQL Profiler&lt;/strong&gt; aracı ile g&amp;ouml;nderilen sorguya bakıldığındaysa sadece kategorilerin &amp;ccedil;ekildiği ancak &amp;uuml;r&amp;uuml;n sayılarının bulunması ile ilişkili bir şey yapılmadığı g&amp;ouml;zlemlenebilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblog1_9.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Aslında bu son derece doğaldır nitekim &lt;strong&gt;Ado.Net Entity Framework&lt;/strong&gt; modelinde &lt;strong&gt;Lazy Loading'&lt;/strong&gt; in bilin&amp;ccedil;li ve a&amp;ccedil;ık bir şekilde yapılması istenmektedir. Dolayısıyla geliştiricinin ger&amp;ccedil;ekten&lt;strong&gt; Lazy Loading&lt;/strong&gt; yapmak &lt;span style="text-decoration: underline;"&gt;istediğini&lt;/span&gt; kod tarafında belirtmesi gerekir. Peki bu nasıl yapılır? Aşağıdaki basit kod par&amp;ccedil;asında olduğu gibi...&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using (NorthwindEntities entity = new NorthwindEntities())
{
	foreach (var category in entity.Categories)
	{
		if(!category.Products.IsLoaded)
			category.Products.Load();
		Console.WriteLine("Category Name :{0}({1})",category.CategoryName,category.Products.Count);
	}
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;SQL Profiler'&lt;/strong&gt; a bakıldığında aşağıdaki &amp;ccedil;ıktı ile karşılaşılır.&lt;/p&gt;
&lt;p&gt;İlk olarak kateogoriler &amp;ccedil;ekilmiş sonrasında ilk 5 kategori i&amp;ccedil;in sırasıyla &amp;uuml;r&amp;uuml;nlere ait sorgular &amp;ccedil;alıştırılmıştır. Ardından ise Category tablosu i&amp;ccedil;in yine bir Select &amp;ccedil;alıştırılmakta ve kalan 3 kategorinin her biri i&amp;ccedil;in tekrardan &amp;uuml;r&amp;uuml;n sorguları y&amp;uuml;r&amp;uuml;t&amp;uuml;lmektedir.(Bu yazıda anlattıklarımı bire bir uygulamanızı, &lt;strong&gt;SQL Profiler&lt;/strong&gt; aracaı yardımıylada irdelemeye &amp;ccedil;alışmanızı şiddetle &amp;ouml;neririm.)&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblog1_11.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Buradaki kod par&amp;ccedil;asında her bir kategori i&amp;ccedil;in buna bağlı &amp;uuml;r&amp;uuml;nlerinde Products &amp;ouml;zelliği ile işaret edilen referansa y&amp;uuml;klenmesi istendiği &lt;strong&gt;Load&lt;/strong&gt; metodu yardımıyla belirtilmektedir. Bu kod ile &lt;strong&gt;Lazy&lt;/strong&gt; &lt;strong&gt;Loading&lt;/strong&gt; ger&amp;ccedil;ekleştirilmiş olmaktadır. Peki ya &lt;strong&gt;Eager Loading&lt;/strong&gt;? Eager Loading i&amp;ccedil;in aşağıdaki kod par&amp;ccedil;asını kullanmak yeterli olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using (NorthwindEntities entity = new NorthwindEntities())
	{
		foreach (var category in entity.Categories.Include("Products"))
		{                    
			Console.WriteLine("Category Name :{0}({1})",category.CategoryName,category.Products.Count);
		}
	}}               
}&lt;/pre&gt;
&lt;p&gt;Aslında tek yaptığımız &lt;strong&gt;Categories&lt;/strong&gt; &amp;ouml;zelliği &amp;uuml;zerinden &lt;strong&gt;Include&lt;/strong&gt; metodunu &amp;ccedil;ağırmak ve &lt;strong&gt;Products&lt;/strong&gt; değerini vermek olmuştur. Buna g&amp;ouml;re SQL tarafında aşağıdaki sorgunun &amp;ccedil;alıştırıldığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblog1_12.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Elbette yine istediğimizi alamadık. Nitekim sadece kategori adı ve &amp;uuml;r&amp;uuml;n sayılarını elde etmek gibi bir amacımız vardı. &lt;strong&gt;LINQ to SQL&lt;/strong&gt; tarafında yapmış olduğumuz iyileştirmeyi&lt;strong&gt; Ado.Net Entity Framework&lt;/strong&gt; tarafında da &lt;strong&gt;Include&lt;/strong&gt; metodunu hesaba katarak ve yine &lt;strong&gt;Anonymous Type&lt;/strong&gt; kullanarak&amp;nbsp;ger&amp;ccedil;ekleştirebiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using (NorthwindEntities entity = new NorthwindEntities())
{
	var resultSet = from c in entity.Categories.Include("Products")
					select new
					{
						c.CategoryName,
						c.Products.Count
					};
	foreach (var result in resultSet)
	{
		Console.WriteLine("Category Name :{0}({1})", result.CategoryName, result.Count);
	&lt;/pre&gt;
&lt;p&gt;Sonu&amp;ccedil; olarak &lt;strong&gt;SQL&lt;/strong&gt; tarafına aşağıdaki sorgu c&amp;uuml;mlesi g&amp;ouml;nderilecektir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/pics/2009%2f4%2fblog1_13.gif" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;d&amp;uuml;ğ&amp;uuml; &amp;uuml;zere sadece CategoryName ve sub query ile birlikte &amp;uuml;r&amp;uuml;n sayıları hesaba katılmaktadır.&lt;/p&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir g&amp;uuml;nl&amp;uuml;k yazımızın daha sonuna. Bu yazımızda &lt;strong&gt;LINQ to SQL&lt;/strong&gt; ve &lt;strong&gt;Ado.Net Entity Framework&lt;/strong&gt; tarafında &lt;strong&gt;Lazy&lt;/strong&gt; ve &lt;strong&gt;Eager&lt;/strong&gt; &lt;strong&gt;Loading&lt;/strong&gt; kavramlarını değerlendirmeye &amp;ccedil;alıştık. Umarım yararlı olmuştur.&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;şmek dileğiyle...&lt;/p&gt;</content>
  <pubDate>2009-04-16 03:41:00</pubDate>
  <slug>AdoNet-Entity-Framework-de-Lazy-ve-Eager-Loading</slug>
  <tags>
    <tag>adonet-entity-framework</tag>
    <tag>linq-to-sql</tag>
  </tags>
  <categories>
    <category>Entity Framework</category>
  </categories>
</post>