<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Bana Bir Struct Yaz. Yok Yok Bana Bir Class Yaz.</title>
  <description>Bu yazımızda, Struct(Yapı) ile Class(Sınıf) tipleri arasındaki temel farklılıkları irdelemeye çalışıyor olacağız. Ancak benzerlikleri de yakalamaya gayret edeceğiz. (Hemen şunu hatırlatalım; .Net Framework, 5 temel veri tipi tanımlar. Bunlar Class, Struct, Enum, Interface ve Delegate tipleridir) Özellikle Struct tipinin kullanımına ilişkin örnekler geliştireceğiz.</description>
  <content>&lt;p&gt;&lt;a href="/pics/blg220_Giris.jpg"&gt;&lt;img style="display: inline; margin-left: 0px; margin-right: 0px; border-width: 0px;" title="blg220_Giris" src="/pics/blg220_Giris_thumb.jpg" alt="blg220_Giris" width="302" height="202" align="right" border="0" /&gt;&lt;/a&gt; Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Aralık&amp;hellip;2003 yılı. Dışarısı olduk&amp;ccedil;a soğuk ve ben evdeyim. Camdan dışarıya baktığımda dışarıda pek kimseyi g&amp;ouml;remiyorum. Soğuktan dolayı sakin olan sokağımız daha da bir yanlız. Bu arada askerden d&amp;ouml;nd&amp;uuml;kten sonra iş aramakla ge&amp;ccedil;irdiğim 8nci ayın i&amp;ccedil;erisindeydim. Neyseki mesleki kariyerimde ilerlemek i&amp;ccedil;in yeni bir heyecanım var. &lt;a href="http://www.csharpnedir.com/" target="_blank"&gt;C#Nedir?&lt;/a&gt; ile daha ilk g&amp;uuml;nlerimi yaşıyorum.&lt;/p&gt;
&lt;p&gt;O zamanlar en &amp;ccedil;ok yaptığım iş, &amp;ouml;ğrendiklerimi T&amp;uuml;rk&amp;ccedil;e yazım dili ile olabildiğince doğru bir şekilde paylaşmaktı. Nitekim &amp;ouml;ğrenmenin en iyi yolunun &amp;ouml;ğrenilenleri anlatmakla m&amp;uuml;mk&amp;uuml;n olduğuna inanmaktayım. Halen daha bu d&amp;uuml;ş&amp;uuml;ncemin arkasındayım.&lt;/p&gt;
&lt;p&gt;Elbette o zamanların verdiği acemilik nedeniyle, şimdi okuduğumda kaliteli olmadığını d&amp;uuml;ş&amp;uuml;nd&amp;uuml;ğ&amp;uuml;m yazılar &amp;uuml;retmekteydim.&amp;nbsp;Ge&amp;ccedil;tiğimiz g&amp;uuml;nlerde d&amp;uuml;ş&amp;uuml;nd&amp;uuml;m de bu tip konuları arada sırada baştan ele almak ve yeniden &amp;ouml;rnekleyerek anlatmakta yarar olabilirdi. Hi&amp;ccedil; olmassa şu anda C# dilinin temellerini &amp;ouml;ğrenmekte olan arkadaşlarımız i&amp;ccedil;in. &amp;Ouml;yleyse gelin, hi&amp;ccedil; vakit kaybetmeden yola koyulalım.&lt;/p&gt;
&lt;p&gt;Bu yazımızda, &lt;strong&gt;Struct(Yapı)&lt;/strong&gt; ile &lt;strong&gt;Class(Sınıf)&lt;/strong&gt; tipleri arasındaki temel farklılıkları irdelemeye &amp;ccedil;alışıyor olacağız. Ancak benzerlikleri de yakalamaya gayret edeceğiz. &lt;em&gt;(Hemen şunu hatırlatalım; &lt;strong&gt;.Net Framework,&lt;/strong&gt; 5 temel veri tipi tanımlar. Bunlar &lt;strong&gt;Class, Struct, Enum, Interface&lt;/strong&gt; ve &lt;strong&gt;Delegate&lt;/strong&gt; tipleridir)&lt;/em&gt; &amp;Ouml;zellikle &lt;strong&gt;Struct&lt;/strong&gt; tipinin kullanımına ilişkin &amp;ouml;rnekler geliştireceğiz.&lt;/p&gt;
&lt;p&gt;Aslında her iki tip arasındaki farklılıklar, uygulama geliştirirken hangi tipi tercih edeceğimiz a&amp;ccedil;ısından olduk&amp;ccedil;a &amp;ouml;nemlidir. &lt;strong&gt;C#&lt;/strong&gt; programlama dilini yeni &amp;ouml;ğrenen birisi i&amp;ccedil;in ilk akla gelen, bellek &amp;uuml;zerindeki tutuluş bi&amp;ccedil;imlerinin farklı olmasıdır. Hatta &lt;strong&gt;Struct&amp;rsquo;&lt;/strong&gt; ların &lt;strong&gt;Değer T&amp;uuml;r&amp;uuml;(Value Type),&lt;/strong&gt; &lt;strong&gt;Class&amp;rsquo;&lt;/strong&gt; ların ise&lt;strong&gt; referans t&amp;uuml;r&amp;uuml;(Reference Type)&lt;/strong&gt; olduklarının, temel seviyede bilgi sahibi olan t&amp;uuml;m programcılar farkındadır. Ancak fazlası da olabilir &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Bu temel farklılıklardan bazılarını &amp;ouml;rnek kodlar yardımıyla irdelemeye &amp;ccedil;alışmaya ne dersiniz? Başlamadan &amp;ouml;nce &amp;ouml;rnek bir &lt;strong&gt;Struct&lt;/strong&gt; tipini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg220_StructDiagram.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg220_StructDiagram" src="/pics/blg220_StructDiagram_thumb.gif" alt="blg220_StructDiagram" width="159" height="200" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace StructvsClass 
{ 
    struct Location 
    { 
        public int X { get; set; } 
        public int Y { get; set; } 
        public int Z { get; set; }

        public override string ToString() 
        { 
            return String.Format("({0},{1},{2})", X, Y, Z); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Eminim ki &lt;strong&gt;Location&lt;/strong&gt; isimli &lt;strong&gt;Struct&lt;/strong&gt; tipimiz pek &amp;ccedil;ok deneyimli programcıya &lt;strong&gt;.Net Framework&lt;/strong&gt; i&amp;ccedil;erisindeki &lt;strong&gt;Point&lt;/strong&gt; yapısını hatırlatmaktadır &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Temel olarak bir nesnenin uzaydaki yerini belirtmek i&amp;ccedil;in kullanabileceğimiz bu tip ayrıca &lt;strong&gt;Object&lt;/strong&gt; tipinden kalıtsal olarak gelen &lt;strong&gt;ToString&lt;/strong&gt; metodunu da &lt;strong&gt;ezmektedir(Override)&lt;/strong&gt;. Şimdi dilerseniz &lt;strong&gt;Struct&lt;/strong&gt; tipi ile ilişkili vakalarımızı analiz etmeye ve &lt;strong&gt;Class&lt;/strong&gt;&amp;rsquo; lar ile aradaki farklılıkları g&amp;ouml;rmeye &amp;ccedil;alışalım.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Vaka 1 : Metod Parametresi Olarak Kullanılmaları Hali&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;Struct&lt;/strong&gt;&amp;rsquo; lar ile &lt;strong&gt;Class&lt;/strong&gt;&amp;rsquo; lar arasındaki farklılıkları anlamak adına akla gelen ilk &amp;ouml;rnek, bu tiplerin metod parametresi olarak kullanılmaları halidir. Aslında burada farkı oluşturan durum &lt;strong&gt;C#&lt;/strong&gt; tarafında metod parametrelerinin her zaman i&amp;ccedil;in &lt;strong&gt;değer t&amp;uuml;r&amp;uuml; olarak(Pass By Value)&lt;/strong&gt; bilgi taşımalarıdır. Değer t&amp;uuml;r&amp;uuml; olarak bilgi taşınması, metoda aktarılan parametrik değişkenlerin aslında metod i&amp;ccedil;inde kopylanarak iş yapması anlamına gelmektedir. Tabi burada dikkat edilmesi gereken nokta ise şudur; Sınıflar birer referans t&amp;uuml;r&amp;uuml;d&amp;uuml;r ve aslında metodlara değer t&amp;uuml;r&amp;uuml; olarak ge&amp;ccedil;irilen bu referanslara ait adres bilgileridir. Sanırım spagetti c&amp;uuml;mlelere ge&amp;ccedil;iş yaptık. Bu nedenle aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alarak ilerleyelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace StructvsClass 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            #region Case 1 : Struct' lar Metod parametresi olduklarında 

            Location planeLocation = new Location { X = 12, Y = 33, Z = 41 }; 
            Console.WriteLine(planeLocation.ToString()); 
            IncreaseLocation(planeLocation); 
            Console.WriteLine(planeLocation.ToString());

            #endregion 
        }

        static void IncreaseLocation(Location loc) 
        { 
            loc.X += 10; 
            loc.Y += 10; 
            loc.Z += 10; 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;IncreaseLocation&lt;/strong&gt; isimli metod &lt;strong&gt;Location&lt;/strong&gt; t&amp;uuml;r&amp;uuml;nden bir parametre almaktada ve &lt;strong&gt;X,Y,Z &lt;/strong&gt;&amp;ouml;zelliklerinin değerlerini onar birim arttırmaktadır. Programın giriş noktası olan &lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisinde ise &lt;strong&gt;planeLocation&lt;/strong&gt; isimli bir &lt;strong&gt;Location&lt;/strong&gt; nesne &amp;ouml;rneği &amp;uuml;retilip bu metoda parametre olarak ge&amp;ccedil;irilmektedir. &amp;Ouml;rneğin &amp;ccedil;alışma zamanı &amp;ccedil;ıktısına baktığımızda aşağıdaki sonu&amp;ccedil; ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg220_Case1_Runtime1.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg220_Case1_Runtime1" src="/pics/blg220_Case1_Runtime1_thumb.gif" alt="blg220_Case1_Runtime1" width="557" height="131" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;İşte bir &lt;strong&gt;Struct&amp;rsquo;&lt;/strong&gt; ın metod parametresi olarak kullanılmasındaki tipik davranış şekli. Değer t&amp;uuml;r&amp;uuml; olarak t&amp;uuml;m i&amp;ccedil;eriği ile birlikte metod i&amp;ccedil;inde kopyalanan bir nesne s&amp;ouml;z konusu olduğundan, &lt;strong&gt;IncreaseLocation&lt;/strong&gt; &amp;ccedil;ağrısından &amp;ouml;nce ve sonrasındaki &lt;strong&gt;planeLocation&lt;/strong&gt; i&amp;ccedil;eriği &lt;span style="text-decoration: underline;"&gt;değişmemiştir&lt;/span&gt;. Bu i&amp;ccedil;erik sadece &lt;strong&gt;IncreaseLocation&lt;/strong&gt; i&amp;ccedil;erisinde değişime uğramıştır. Kısacası, metoda aktarılan değişkenin orjinal veri yapısında bir bozulma s&amp;ouml;z konusu değildir. Durumu biraz daha dramatize etmek ve &amp;ouml;zellikle sınıf ile yapı arasındaki farkı ortaya &amp;ccedil;ıkartmak adına, &lt;strong&gt;Location&lt;/strong&gt; tipini &lt;strong&gt;class&lt;/strong&gt; haline getirip &amp;ouml;rneği tekrardan &amp;ccedil;alıştırabiliriz. Bu durumda sonu&amp;ccedil;lar aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg220_Case1_Runtime2.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg220_Case1_Runtime2" src="/pics/blg220_Case1_Runtime2_thumb.gif" alt="blg220_Case1_Runtime2" width="557" height="85" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;planeLocation&lt;/strong&gt; değişkeninin&lt;strong&gt; X,Y&lt;/strong&gt; ve &lt;strong&gt;Z&lt;/strong&gt; değerlerinin orjinal halleri, metod &amp;ccedil;ağrısından sonra bozulmuştur. Bunun tipik nedeni referans t&amp;uuml;r&amp;uuml; olan sınıfların, metod parametrelerine değer t&amp;uuml;r&amp;uuml; olarak ge&amp;ccedil;irilmeleri sırasında, adreslerinin taşınmasıdır. Dolayısıyla metod i&amp;ccedil;erisine kullanılan &lt;strong&gt;loc&lt;/strong&gt; isimli değişken ile, &lt;strong&gt;planeLocation&lt;/strong&gt; isimli değişken bellek &amp;uuml;zerindeki aynı adres alanlarını işaret etmektedir.&lt;/p&gt;
&lt;p&gt;Elbette &lt;strong&gt;Struct&lt;/strong&gt; tipinin metodlara referans t&amp;uuml;r&amp;uuml; olarka ge&amp;ccedil;irilmesi de m&amp;uuml;mk&amp;uuml;n olabilir. Bu durumda &lt;strong&gt;ref&lt;/strong&gt; veya &lt;strong&gt;out&lt;/strong&gt; parametrelerinden yararlanılması yeterli olacaktır. Aşağıda bu duruma ilişkin &amp;ouml;rnek bir kullanım s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace StructvsClass 
{ 
    class Program 
    { 
        static void Main(string[] args) 
        { 
            #region Case 1 : Struct' lar Metod parametresi olduklarında 

            Location planeLocation = new Location { X = 12, Y = 33, Z = 41 }; 
            Console.WriteLine(planeLocation.ToString()); 
            DecreaseLocation(ref planeLocation); 
            Console.WriteLine(planeLocation.ToString());

            #endregion 
        } 
        static void DecreaseLocation(ref Location loc) 
        { 
            loc.X -= 10; 
            loc.Y -= 15; 
            loc.Z -= 12; 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;Bu durumda &lt;strong&gt;planeLocation&lt;/strong&gt; değişkeni, &lt;strong&gt;Decrease&lt;/strong&gt; isimli metoda referans olarak ge&amp;ccedil;irilecektir. Dolayısıyla metod i&amp;ccedil;erisinde &lt;strong&gt;loc&lt;/strong&gt; değişkeninin veri i&amp;ccedil;eriğinde yapılan değişiklikler, &lt;strong&gt;planeLocation&lt;/strong&gt; değişkeninin i&amp;ccedil;eriğini de bozacaktır. Aşağıdaki &amp;ccedil;alışma zamanı g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde bu durum a&amp;ccedil;ık bir şekilde g&amp;ouml;r&amp;uuml;lmektedir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg220_Case1_Runtime3.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg220_Case1_Runtime3" src="/pics/blg220_Case1_Runtime3_thumb.gif" alt="blg220_Case1_Runtime3" width="557" height="85" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;Vaka 2 : Atama İşlemlerindeki Davranışlar&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Sınavda yapılar ile sınıflar arasındaki temel farklılıkları sorsalar sanıyorum ki herkesin aklına gelecek ilk se&amp;ccedil;enek atama işlemlerindeki davranışsal farklılıktır. Durumu anlamak i&amp;ccedil;in hemen aşağıdaki kod par&amp;ccedil;asını g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Location jhonLocation = new Location { X=3,Y=1 }; 
Location marryLocation = jhonLocation; 

Console.WriteLine("Jhon Burada {0}",jhonLocation.ToString()); 
Console.WriteLine("Marry Burada {0}", marryLocation.ToString()); 

jhonLocation.X++; 

Console.WriteLine("Jhon Burada {0}", jhonLocation.ToString()); 
Console.WriteLine("Marry Burada {0}", marryLocation.ToString());&lt;/pre&gt;
&lt;p&gt;Kodun ilk kritik noktası &lt;strong&gt;jhonLocation&lt;/strong&gt; değişkeninin &lt;strong&gt;marryLocation&lt;/strong&gt; değişkenine atandığı yerdir. Bu atama sonrasında &lt;strong&gt;marryLocation&lt;/strong&gt; değişkenin veri i&amp;ccedil;eriği ile &lt;strong&gt;jhonLocation&amp;rsquo;&lt;/strong&gt; ın veri i&amp;ccedil;eriği eş olacaktır. Yani tipik bir değişken kopyalama işlemi s&amp;ouml;z konusudur. Diğer yandan &lt;strong&gt;jhonLocation&amp;rsquo;&lt;/strong&gt; ın &lt;strong&gt;X&lt;/strong&gt; alanının değerinin arttırılması sonrasında &lt;strong&gt;marryLocation&amp;rsquo;&lt;/strong&gt; ın &lt;strong&gt;X&lt;/strong&gt; değerinde bir değişim olmadığı g&amp;ouml;r&amp;uuml;lecektir. Nitekim her ikisi de bellek &amp;uuml;zerinde ayrı lokasyonlarda duran değişkenlerdir. &amp;Ouml;rneğin &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibidir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg220_Case2_Runtime1.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg220_Case2_Runtime1" src="/pics/blg220_Case2_Runtime1_thumb.gif" alt="blg220_Case2_Runtime1" width="557" height="103" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Peki ya &lt;strong&gt;Location&lt;/strong&gt; bir sınıf olsaydı? &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt; Bu durumda &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibi olacaktı.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg220_Case2_Runtime2.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg220_Case2_Runtime2" src="/pics/blg220_Case2_Runtime2_thumb.gif" alt="blg220_Case2_Runtime2" width="557" height="97" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;X&lt;/strong&gt; alanının değerinin arttımı, &lt;strong&gt;marryLocation&lt;/strong&gt; değişkeninin &lt;strong&gt;X&lt;/strong&gt; değeri i&amp;ccedil;in de ge&amp;ccedil;erli olmuştur. Bu son derece doğaldır nitekim atama sonrası kopyalanan i&amp;ccedil;erik değil referans adresleridir. Bu sebepten atama sonrası &lt;strong&gt;jhonLocation&lt;/strong&gt; değişkeninin veri i&amp;ccedil;eriğinde yapılan değişiklikler &amp;ccedil;ok doğal olarak &lt;strong&gt;marryLocation&lt;/strong&gt; i&amp;ccedil;inde ge&amp;ccedil;erli olacaktır. Bu durumda geliştiricinin karar vermesi gereken soru şudur: &lt;strong&gt;Marry&lt;/strong&gt; ile &lt;strong&gt;Jhon&lt;/strong&gt; birlikte hareket etmeli midir? Yoksa istedikleri noktada birbirlerinde ayrı olarak hareket edebilirler mi? &lt;img title="Wink" src="/editors/tiny_mce3/plugins/emotions/img/smiley-wink.gif" alt="Wink" border="0" /&gt;&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Vaka 3 : Struct Tipinden &amp;Ouml;zellik(Property) Kullanılması Hali&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Bu vakayı canlandırmak i&amp;ccedil;in ikinci bir &lt;strong&gt;Struct&lt;/strong&gt; tipine daha ihtiyacımız olacak. &lt;strong&gt;Plane&lt;/strong&gt; isimli yapımızı aşağıdaki gibi tasarladığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg220_PlaneStructDiagram.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg220_PlaneStructDiagram" src="/pics/blg220_PlaneStructDiagram_thumb.gif" alt="blg220_PlaneStructDiagram" width="279" height="214" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;struct Plane 
{ 
    public string Pilot; 
    public Location CurrentLocation { get; set; }

    public override string ToString() 
    { 
        return String.Format("{0} şu anda {1} lokasyonundadır", 
            String.IsNullOrEmpty(Pilot)?"Yok":Pilot, 
            CurrentLocation.ToString()); 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Plane&lt;/strong&gt; isimli yapı i&amp;ccedil;erisinde &lt;strong&gt;Location&lt;/strong&gt; tipinden bir &lt;strong&gt;&amp;ouml;zellik(Property)&lt;/strong&gt; bulunmaktadır. Şimdi &lt;strong&gt;Main&lt;/strong&gt; metodu i&amp;ccedil;erisinde aşağıdaki &amp;ouml;rnek kod par&amp;ccedil;asını geliştirdiğimizi d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Plane redBaron = new Plane 
{ 
    Pilot = "Red Baron", 
    CurrentLocation = new Location {  X=12, Y=28, Z=46} 
}; 
Console.WriteLine(redBaron.ToString()); 
redBaron.CurrentLocation.X += 14; 
Console.WriteLine(redBaron.ToString());&lt;/pre&gt;
&lt;p&gt;İlk olarak &lt;strong&gt;Plane&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneği &amp;uuml;retilmektedir ve &lt;strong&gt;CurrentLocation&lt;/strong&gt; isimli &amp;ouml;zellik &lt;strong&gt;initialize&lt;/strong&gt; edilirken &lt;strong&gt;X,Y&lt;/strong&gt; ve &lt;strong&gt;Z&lt;/strong&gt; &amp;ouml;zelliklerine ilk değerleri verilmektedir. Kodun ilerleyen kısımlarında &lt;strong&gt;CurrentLocation&lt;/strong&gt; &amp;ouml;zelliği &amp;uuml;zerinden &lt;strong&gt;X&lt;/strong&gt; alanına gidilerek değerinin &lt;strong&gt;14&lt;/strong&gt; birim arttırıldığı g&amp;ouml;r&amp;uuml;lmektedir. Herhangiri sorun olabilir mi? Evet olabilir&amp;hellip;Nitekim kod derlendiğinde, aşağıdaki hata mesajının &amp;uuml;retildiği g&amp;ouml;r&amp;uuml;lecektir.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg220_Case3_Error.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg220_Case3_Error" src="/pics/blg220_Case3_Error_thumb.gif" alt="blg220_Case3_Error" width="571" height="377" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;CurrentLocation&lt;/strong&gt; &amp;ouml;zelliğinin &amp;uuml;zerinden &lt;strong&gt;X&lt;/strong&gt; değeri değiştirilememektedir. Aslında değişim s&amp;ouml;z konusudur fakat &amp;ouml;zellik kullanılması nedeniyle yeniden bir &lt;strong&gt;initialize &lt;/strong&gt;işlemi yapılmasını gerektirmektedir. Kod aşağıdaki hale getirildiğinde bir sorun kalmayacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Plane redBaron = new Plane 
{ 
    Pilot = "Red Baron", 
    CurrentLocation = new Location {  X=12, Y=28, Z=46} 
}; 
Console.WriteLine(redBaron.ToString()); 
// redBaron.CurrentLocation.X += 14; 
redBaron.CurrentLocation = new Location 
{ 
    X = redBaron.CurrentLocation.X + 14 
    , Y = redBaron.CurrentLocation.Y 
    , Z = redBaron.CurrentLocation.Z 
}; 
Console.WriteLine(redBaron.ToString());&lt;/pre&gt;
&lt;p&gt;Bu durumda &amp;ccedil;alışma zamanı &amp;ccedil;ıktısı aşağıdaki gibi olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg220_Case3_Runtime1.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg220_Case3_Runtime1" src="/pics/blg220_Case3_Runtime1_thumb.gif" alt="blg220_Case3_Runtime1" width="557" height="77" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Elbette &lt;strong&gt;Location&lt;/strong&gt; yapısı &lt;strong&gt;class&lt;/strong&gt; olarak tanımlanmış olsaydı bu tip bir hata ile karşılaşılmayacaktı.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Vaka 4 : Yapıları &amp;Ouml;rneklemeden Kullanabilme Hali&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;Struct&lt;/strong&gt; tipleri aslında değer t&amp;uuml;r&amp;uuml; olduklarından, veri i&amp;ccedil;erikleri başlangı&amp;ccedil;ta mutlaka ilk değerlerine atanmalıdır. Bu durum &lt;strong&gt;Stack&lt;/strong&gt; bellek b&amp;ouml;lgesinde tutulmalarından kaynaklanmaktadır. Bu sebepten normal şartlarda &lt;strong&gt;Struct&lt;/strong&gt; tipleri i&amp;ccedil;in &lt;strong&gt;varsayılan yapıcı metodun(Default Constructor)&lt;/strong&gt; yazılmasına izin &lt;span style="text-decoration: underline;"&gt;verilmemektedir&lt;/span&gt;. Aslında değer t&amp;uuml;r&amp;uuml; olduklarından bu tipleri başlatırken varsayılan yapıcı metod kullanılması da zorunlu değildir. Bu nedenle sistem otomatik olarak varsayılan yapıcı metodu atamaktadır. Diğer yandan yapılar tipik bir değer t&amp;uuml;r&amp;uuml; değişkeni olaraktan da kullanılabilirler. Fakat burada tuhaf bir durum s&amp;ouml;z konusudur. &lt;strong&gt;Location&lt;/strong&gt; isimli &lt;strong&gt;Struct&lt;/strong&gt; tipimizi bu anlamda g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alalım ve aşağıdaki kodu yazdığımızı d&amp;uuml;ş&amp;uuml;nelim.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Location tankLocation; 
tankLocation.Z = 14; 
tankLocation.Y = 15; 
Console.WriteLine(tankLocation.ToString());&lt;/pre&gt;
&lt;p&gt;Aslında bu son derece mantıklı bir kod par&amp;ccedil;asıdır. Nitekim &lt;strong&gt;Struct&lt;/strong&gt; bir değer t&amp;uuml;r&amp;uuml; olduğundan &lt;strong&gt;int, double, bool&lt;/strong&gt; gibi tanımlanıp kullanılabilmelidir. Yani varsayılan yapıcı metod veya başka bir versiyon ile &amp;ouml;rneklenmeden kolayca kullanılabilmelidir. Ancak kodumuzu bu haliyle derlediğimizde aşağıdaki derleme zamanı hatasını aldığımızı g&amp;ouml;r&amp;uuml;r&amp;uuml;z.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg220_Case4_Runtime1.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg220_Case4_Runtime1" src="/pics/blg220_Case4_Runtime1_thumb.gif" alt="blg220_Case4_Runtime1" width="522" height="314" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Hımmm! İlgin&amp;ccedil; &lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt; Neden b&amp;ouml;yle bir hata aldık ki? Aslında sınıfların yapamadığı bir şeyi yapıyor olmalıydık. Acaba &lt;strong&gt;Struct&lt;/strong&gt; tipleri kıl mı? &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sorun bu tip bir kullanımın sadece &lt;strong&gt;alanlar(Fields)&lt;/strong&gt; i&amp;ccedil;in ge&amp;ccedil;erli olmasıdır. &amp;Uuml;stelik &lt;strong&gt;public&lt;/strong&gt; olan alanlar i&amp;ccedil;in ge&amp;ccedil;erlidir. Hatta ne kadar &lt;strong&gt;public&lt;/strong&gt; alan var ise her birinin ilk değerinin de atanması gerekmektedir. Dolayısıyla &lt;strong&gt;Location&lt;/strong&gt; tipini aşağıdaki hale getirerek devam edelim. (Elveda &amp;ouml;zellikler &lt;img title="Frown" src="/editors/tiny_mce3/plugins/emotions/img/smiley-frown.gif" alt="Frown" border="0" /&gt; )&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;namespace StructvsClass 
{ 
    struct Location 
    { 
        public int X; 
        public int Y; 
        public int Z; 
...&lt;/pre&gt;
&lt;p&gt;Bu sefer de aşağıdaki hata mesajı ile karşılaşırız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg220_Case4_Runtime2.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg220_Case4_Runtime2" src="/pics/blg220_Case4_Runtime2_thumb.gif" alt="blg220_Case4_Runtime2" width="472" height="272" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Aslında bir &amp;ouml;nceki hata mesajı ile aynı g&amp;ouml;r&amp;uuml;nmesine rağmen arada bir fark vardır. İlk hata mesajının verildiği yer ile ikincisi farklıdır. Son hata mesajının sebebi t&amp;uuml;m alanlara ilk değer atanmayışıdır. Dolayısıyla kodun en azından aşağıdaki gibi olmasında yarar vardır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;Location tankLocation; 
tankLocation.Z = 14; 
tankLocation.Y = 15; 
tankLocation.X = 12; 
Console.WriteLine(tankLocation.ToString());&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;X,Y&lt;/strong&gt; ve &lt;strong&gt;Z&lt;/strong&gt; alanlarının tamamına ilk değer atanmıştır. Elbette yapıcı metod yardımıyla bir nesne &amp;ouml;rneklediğimizde bu tip bir atama zorunluluğu &lt;span style="text-decoration: underline;"&gt;bulunmamaktadır&lt;/span&gt;.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Vaka 5 : &amp;Uuml;yelerin Varsayılan Değerleri(Default Values)&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;&lt;strong&gt;Struct&amp;rsquo;&lt;/strong&gt; lar aslında &lt;strong&gt;Class&lt;/strong&gt; tipleri kadar esnek bir yapı sunmazlar. Bunu i&amp;ccedil;erdikleri&lt;strong&gt; alanlara(Fields)&lt;/strong&gt; varsayılan başlanı&amp;ccedil; değerlerini atarken &amp;ccedil;ok&amp;ccedil;a g&amp;ouml;rebiliriz. Dilerseniz &lt;strong&gt;Location&lt;/strong&gt; yapısını aşağıdaki gibi tasarladığımızı planlayalım.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;

namespace StructvsClass 
{ 
    struct Location 
    { 
        public int X { get; set; } 
        public int Y { get; set; } 
        public int Z { get; set; } 

        public string TimeZone = "Atina-Minsk-İstanbul"; 
        public bool InGame; 

        public Location() 
        { 
            InGame = true; 
        }

        public override string ToString() 
        { 
            return String.Format("({0},{1},{2})", X, Y, Z); 
        } 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt; yapısına &lt;strong&gt;TimeZone&lt;/strong&gt; isimli &lt;strong&gt;string&lt;/strong&gt; tipinden ve &lt;strong&gt;InGame&lt;/strong&gt; isimli bool tipinden birer alan eklenmiştir. Geliştiricinin amacı, bu iki değişkenin başlangı&amp;ccedil;ta varsayılan değerlere sahip olmasıdır. Ancak kod bu şekliyle derlendiğinde aşağıdaki derleme zamanı hatalarının alındığı g&amp;ouml;r&amp;uuml;l&amp;uuml;r.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg220_Case5_Runtime1.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg220_Case5_Runtime1" src="/pics/blg220_Case5_Runtime1_thumb.gif" alt="blg220_Case5_Runtime1" width="498" height="288" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;TimeZone&lt;/strong&gt; değişkenine varsayılan değer &lt;span style="text-decoration: underline;"&gt;atanamamaktadır&lt;/span&gt;. Ayrıca varsayılan yapıcı metodun var &lt;span style="text-decoration: underline;"&gt;olamayacağı&lt;/span&gt; ifade edilmektedir. Buna g&amp;ouml;re &lt;strong&gt;InGame&lt;/strong&gt; değişkenin ilk değer atanması i&amp;ccedil;in varsayılan yapıcı metodun kullanılması planları da suya d&amp;uuml;şm&amp;uuml;şt&amp;uuml;r. Halbu ki &lt;strong&gt;Location&lt;/strong&gt; tipi bir sınıf olarak tasarlanmış olsaydı! &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt; Bu durumda bir derleme zamanı hatası alınmayacaktı &lt;img title="Undecided" src="/editors/tiny_mce3/plugins/emotions/img/smiley-undecided.gif" alt="Undecided" border="0" /&gt;&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Vaka 6 : Performans&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Aslında &lt;strong&gt;Stack&lt;/strong&gt; bellek b&amp;ouml;lgesini kullanmalarından dolayı &lt;strong&gt;Struct&lt;/strong&gt; ile &amp;ccedil;alışmanın performansı arttırıcı bir etken olduğu d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Ne var ki yapıların birbirlerine atanması, metodlara parametre olarak ge&amp;ccedil;irilmesi veya d&amp;ouml;nd&amp;uuml;r&amp;uuml;lmesi her zaman i&amp;ccedil;in &lt;strong&gt;değer yoluyla(By Value)&lt;/strong&gt; olmaktadır. Bir başka deyişle &lt;strong&gt;referans yolu(By Reference)&lt;/strong&gt; ile &lt;span style="text-decoration: underline;"&gt;olmamaktadır&lt;/span&gt;. Bu da zaman i&amp;ccedil;erisinde bellek &amp;uuml;zerinde pek &amp;ccedil;ok kopya nesnenin oluşması anlamına gelmektedir. Dolayısıyla sizde pek &amp;ccedil;ok geliştirici gibi b&amp;uuml;y&amp;uuml;k bir olaslıkla sınıfları kullanmayı tercih edebilirsiniz.&lt;/p&gt;
&lt;h2&gt;&lt;strong&gt;Karar Verirken&lt;/strong&gt;&lt;/h2&gt;
&lt;p&gt;Peki ya nasıl karar vereceğiz? &lt;strong&gt;Struct&lt;/strong&gt; mı kullanalım, &lt;strong&gt;Class&lt;/strong&gt; mı kullanalım? Hangisini tercih etmeliyiz? Sanıyorum ki cevaplanması en zor sorulardan birisi de bu. Hatta az &amp;ouml;nce bu yazıyı yazarken yanıma gelen &amp;ccedil;alışma arkadaşım şunu deyince &lt;strong&gt;&amp;ldquo;Valla Hocam bunca zamandır yazılım geliştiriyorum, hi&amp;ccedil; bir projemde Struct kullanıldığını g&amp;ouml;rmedim&amp;rdquo; &lt;/strong&gt;&lt;img title="Sealed" src="/editors/tiny_mce3/plugins/emotions/img/smiley-sealed.gif" alt="Sealed" border="0" /&gt; Aslında yaygın kanı halen daha devam etmekte. &lt;strong&gt;16 byte&amp;rsquo;&lt;/strong&gt; tan daha k&amp;uuml;&amp;ccedil;&amp;uuml;k veri toplulukları i&amp;ccedil;in &lt;strong&gt;Struct&lt;/strong&gt; kullanılması &amp;ouml;nerilmektedir. Ayrıca sadece veri anlamında bir tipten s&amp;ouml;z ediyorsak, &lt;strong&gt;Struct&lt;/strong&gt; kullanımı &lt;strong&gt;Class &lt;/strong&gt;tipine nazaran daha anlamlı olabilir.&lt;/p&gt;
&lt;p&gt;Sınıfları nesne y&amp;ouml;nelimli &amp;ouml;zellikleri tamamıyla destekleyen bir tip olarak d&amp;uuml;ş&amp;uuml;nmek &amp;ccedil;ok daha doğru bir yaklaşımdır. Nitekim &lt;strong&gt;Struct&lt;/strong&gt; tiplerinin t&amp;uuml;retilmesi m&amp;uuml;mk&amp;uuml;n değildir ve bu &lt;strong&gt;OOP(Object Oriented Programming)&lt;/strong&gt; &amp;ccedil;ervecesinde &amp;ouml;nemli bir ilke ihlalidir.&lt;/p&gt;
&lt;p&gt;Aslında karar vermek i&amp;ccedil;in &lt;strong&gt;Struct&lt;/strong&gt; ve &lt;strong&gt;Class&lt;/strong&gt; arasındaki farklılıklar dışında, benzerlikleri de bilmenin yararı vardır. Bu sebepten aşağıdaki tablodan da yararlanabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg220_DiscussionSheet.gif"&gt;&lt;img style="display: inline; border-width: 0px;" title="blg220_DiscussionSheet" src="/pics/blg220_DiscussionSheet_thumb.gif" alt="blg220_DiscussionSheet" width="537" height="472" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Aradan ge&amp;ccedil;en 7 yıldan sonra bir &amp;ouml;nceki yazıya bakıyorum da &lt;img title="Laughing" src="/editors/tiny_mce3/plugins/emotions/img/smiley-laughing.gif" alt="Laughing" border="0" /&gt; Aslında bazı kuralların hi&amp;ccedil; değişmediği ap a&amp;ccedil;ık ortada. &lt;strong&gt;.Net Framework&lt;/strong&gt;&amp;rsquo; &amp;uuml;n i&amp;ccedil;erisinde pek &amp;ccedil;ok noktada kullanılan &lt;strong&gt;Struct&lt;/strong&gt; veri tipi, halen daha projelerde g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alınabilir, alınmalıdır. &amp;Ouml;zellikle bu ihtiyacı farkediyor olmakta bir yazılımcı i&amp;ccedil;in ve hatta proje i&amp;ccedil;in son derece &amp;ouml;nemlidir. B&amp;ouml;ylece geldik bir yazımızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/2010%2f8%2fStructvsClass.rar"&gt;StructvsClass.rar (24,56 kb)&lt;/a&gt;&amp;nbsp;&lt;strong&gt;[&amp;Ouml;rnek Visual Studio 2010 Ultimate S&amp;uuml;r&amp;uuml;m&amp;uuml; &amp;Uuml;zerinde Geliştirilmiş ve Test Edilmiştir]&lt;/strong&gt;&lt;/p&gt;</content>
  <pubDate>2011-02-28 16:30:00</pubDate>
  <slug>Bana-Bir-Struct-Yaz-Yok-Yok-Bana-Bir-Class-Yaz</slug>
  <tags>
    <tag>c#</tag>
    <tag>c#-temelleri</tag>
    <tag>class</tag>
    <tag>struct</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>