<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Razor Dünyasındaki İlk Adımlarım</title>
  <description>Amacım, Microsoft'un Asp.Net Core MVC tarafında özellikle sayfa odaklı senaryolar için geliştirdiği Razor çatısını tanımak. Bu çatıda sayfalar doğrudan istemci taleplerini karşılayıp arada bir Controller'a uğramadan sayfa modeli _(PageModel)_ ile konuşabiliyorlar. Razor sayfaları SayfaAdı.cshtml benzeri olup kullandıkları sayfa modelleri SayfaAdi.cshtml.cs şeklinde oluşturuluyorlar. Genel hatları ile URL eşleştirmeleri aşağıdaki gibi oluyor.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2019/05/21/zekimuren.png" alt="" /&gt;Bizim servisin d&amp;ouml;n&amp;uuml;ş yolculuğu bir başkadır. Her g&amp;uuml;n yaklaşık git gel neredeyse seksen kilometrelik yol teperiz&lt;em&gt;(Daha ne kadar teperim bilemiyorum tabii)&lt;/em&gt; D&amp;ouml;n&amp;uuml;ş yolculuğumuz trafiğin durumuna g&amp;ouml;re bazen &amp;ccedil;ok uzun s&amp;uuml;rer. İşte&amp;nbsp;b&amp;ouml;yle akşamların &amp;ccedil;ok &amp;ouml;zel bir anı vardır.&lt;/p&gt;
&lt;p&gt;Şekerpınardan yola &amp;ccedil;ıkan y&amp;uuml;zler &amp;Uuml;mraniye sapağına girmek &amp;uuml;zere otobandan ayrıldığımızda g&amp;uuml;l&amp;uuml;mser. Sadece evlerimize yaklaştığımız ve g&amp;uuml;n&amp;uuml;n yorgunluğunu atmak &amp;uuml;zere ayakkabılarımızı fırlatacağımız i&amp;ccedil;in değil, sevgili İhsan Bey radyosunu a&amp;ccedil;ıp Zeki M&amp;uuml;ren'den M&amp;uuml;zeyyen Senar'dan Safiye Ayla'dan Muazzez Ersoy'dan ve daha nice değerli sanat&amp;ccedil;ımızdan oluşan koleksiyonunu dinletmeye başladığı i&amp;ccedil;in de tebess&amp;uuml;m ederiz.&lt;/p&gt;
&lt;p&gt;Şirkete ilk başladığım g&amp;uuml;nlerde servisteki pek &amp;ccedil;ok kişi bana bakıp rap&amp;ccedil;i olduğumu d&amp;uuml;ş&amp;uuml;nm&amp;uuml;ş ve İhsan Bey'in &amp;ccedil;aldığı şarkıları pek sevemeyeceğime kanaat getirmişti. Aslında lise yıllarında sıkı bir Heavy Metal'ci olan ben b&amp;uuml;y&amp;uuml;d&amp;uuml;k&amp;ccedil;e farklı tınıları, farklı k&amp;uuml;lt&amp;uuml;rlerin tonlamalarını da dinler olmuştum. M&amp;uuml;ziğin dili, dini, ırkı olmaz diyenlerdenim. Zaman ge&amp;ccedil;tik&amp;ccedil;e ve &amp;ouml;zellikle plak merakım da başlayınca Aşık Veysel'den Joe Satriani'ye, Coşkun Sabah'tan Pink Floyd'a, Barış Man&amp;ccedil;o'dan Metallica'ya, Sezen Aksu'dan Mozart'a kadar&amp;nbsp;&amp;ccedil;ok geniş bir m&amp;uuml;zik keyfine ulaştığımı fark ettim. Bu konuya nereden mi geldik? Microsoft'un Razor'unu kurcalarken kaleme aldığım derlemeye&amp;nbsp;nasıl bir giriş yaparım diye d&amp;uuml;ş&amp;uuml;n&amp;uuml;rken aklıma gelen ACDC'nin The Razors Edge alb&amp;uuml;m&amp;uuml;nden. Haydi başlayalım ;)&lt;/p&gt;
&lt;p&gt;&lt;a href="https://github.com/buraksenyurt/saturday-night-works/tree/master/No%2021%20-%20Introducing%20Razor" target="_blank"&gt;Saturday-Night-Works &amp;ccedil;alışmalarımdaki 21 numaralı &amp;ouml;rnek&lt;/a&gt;teki amacım, Microsoft'un Asp.Net Core MVC tarafında &amp;ouml;zellikle sayfa odaklı senaryolar i&amp;ccedil;in geliştirdiği Razor &amp;ccedil;atısını tanımaktı. Bu &amp;ccedil;atıda sayfalar doğrudan istemci taleplerini karşılayıp arada bir Controller'a uğramadan sayfa modeli&lt;em&gt;(PageModel)&lt;/em&gt; ile konuşabilmekte. Razor sayfaları SayfaAdı.cshtml benzeri olup kullandıkları sayfa modelleri SayfaAdi.cshtml.cs şeklinde oluşturuluyor. Genel hatları ile URL y&amp;ouml;nlendirmeleri aşağıdaki tablodakine benzer şekilde olmakta. &amp;Ouml;rneğin /Book adresine g&amp;ouml;re pages klas&amp;ouml;r&amp;uuml;ndeki Book.cshtml isimli sayfa talep edilmiş oluyor. Sayfanın arka plan kodları da aynı klas&amp;ouml;rdeki cs dosyasında yer alıyor. Web standartları gereği /Index ve / talepleri aynı route adres olarak değerlendiriliyor. Tabii adreslere farklı şekillerde adresleme yapmakta m&amp;uuml;mk&amp;uuml;n. Tablodaki /Category &amp;ouml;nekli adres y&amp;ouml;nlendirmeleri bu anlamda d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Elbette konuyu anlamanın en iyi yolu bir &amp;ouml;rneği &amp;ccedil;alışmaktan ge&amp;ccedil;iyor.&lt;/p&gt;
&lt;table border="1"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td&gt;&lt;strong&gt;&amp;nbsp;&amp;Ouml;rnek URL Adresi&amp;nbsp;&amp;nbsp;&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&amp;nbsp;Karşılayan Razor Sayfası&lt;/strong&gt;&lt;/td&gt;
&lt;td&gt;&lt;strong&gt;&amp;nbsp;Model Nesnesi&lt;/strong&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&amp;nbsp;/Book&lt;/td&gt;
&lt;td&gt;&amp;nbsp;pages/Book.cshtml&lt;/td&gt;
&lt;td&gt;&amp;nbsp;pages/book.cshtml.cs&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&amp;nbsp;/Category/Product&lt;/td&gt;
&lt;td&gt;&amp;nbsp;pages/Category/Product.cshtml&amp;nbsp;&amp;nbsp;&lt;/td&gt;
&lt;td&gt;&amp;nbsp;pages/Category/Product.cshtml.cs&amp;nbsp;&amp;nbsp;&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&amp;nbsp;/Category&lt;/td&gt;
&lt;td&gt;&amp;nbsp;pages/Category/Index.cshtml&lt;/td&gt;
&lt;td&gt;&amp;nbsp;pages/Category/Index.cshtml.cs&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&amp;nbsp;/Category/Index&lt;/td&gt;
&lt;td&gt;&amp;nbsp;pages/Category/Index.cshtml&lt;/td&gt;
&lt;td&gt;&amp;nbsp;pages/Category/Index.cshtml.cs&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&amp;nbsp;/Index&lt;/td&gt;
&lt;td&gt;&amp;nbsp;pages/Index.cshtml&lt;/td&gt;
&lt;td&gt;&amp;nbsp;pages/Index.cshtml.cs&lt;/td&gt;
&lt;/tr&gt;
&lt;tr&gt;
&lt;td&gt;&amp;nbsp;/&lt;/td&gt;
&lt;td&gt;&amp;nbsp;pages/Index.cshtml&lt;/td&gt;
&lt;td&gt;&amp;nbsp;pages/Index.cshtml.cs&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;Ccedil;alışmada veri girişi yapılabilen basit bir form tasarlayıp, Razor'un kod dinamiklerini anlamak istedim. İlk aşamada&amp;nbsp;bilgileri&amp;nbsp;InMemory veri tabanında tutmayı planladım. Son aşamada ise SQLite veri tabanını devreye aldım.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2&gt;Başlangı&amp;ccedil;&lt;/h2&gt;
&lt;p&gt;Hazırsanız ilk adımlarımızla işe başlayalım. Ben diğer pek &amp;ccedil;ok &amp;ouml;rnekte olduğu gibi kodlamayı WestWorld&lt;em&gt;(Ubuntu 18.04, 64bit)&lt;/em&gt; &amp;uuml;zerinde Visual Studio Code aracıyla ger&amp;ccedil;ekleştirmekteyim. Linux tarafında Razor uygulamalarını oluşturmak i&amp;ccedil;in en azından .Net Core 2.2'ye ihtiyacımız var. Projeyi aşağıdaki terminal komutunu&amp;nbsp;kullanarak oluşturabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet new webapp -o MyBookStore&lt;/pre&gt;
&lt;p&gt;A&amp;ccedil;ılan uygulama iskeletini biraz inceleyecek olursak Razor sayfaları ve ilişkili model sınıflarının Pages klas&amp;ouml;r&amp;uuml;nde konuşlandırıldığını g&amp;ouml;rebiliriz. Static HTML dosyaları, Javacript k&amp;uuml;t&amp;uuml;phaneleri ve CSS i&amp;ccedil;erikleri de wwwroot altında bulunmaktadır. Resim, video vb varlıkları da bu klas&amp;ouml;r altında toplayabiliriz. Şu haliyle bile uygulamayı ayağa kaldırıp varsayılan olarak gelen i&amp;ccedil;erikle &amp;ccedil;alışmamız m&amp;uuml;mk&amp;uuml;n. Ancak bizim amacımız okuduğumuz kitapları y&amp;ouml;neteceğimiz basit bir Web aray&amp;uuml;z&amp;uuml; geliştirmek.&lt;/p&gt;
&lt;h2&gt;Geliştirme Safhası&lt;/h2&gt;
&lt;p&gt;Gelelim kod tarafına. Burada kitap ekleme, listeleme ve d&amp;uuml;zenleme işlemleri i&amp;ccedil;in bir takım sayfalarımız mevcut. Ancak &amp;ouml;ncelikle Data isimli bir klas&amp;ouml;r oluşturup StoreDataContext.cs ve Book.cs isimli Entity sınıflarını ekleyerek işe başlayalım. Tahmin edeceğiniz &amp;uuml;zere Entity Framework Core ile entegre ettiğimiz bir &amp;uuml;r&amp;uuml;n&amp;uuml;m&amp;uuml;z var.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;StoreDataContext.cs&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using Microsoft.EntityFrameworkCore;

namespace MyBookStore.Data
{
    public class StoreDataContext
        : DbContext
    {
        public StoreDataContext(DbContextOptions&amp;lt;StoreDataContext&amp;gt; options)
            : base(options)
        {
            // InMemory db kullanacağımız bilgisi startup'cs deki
            // Constructor metoddan alınıp base ile DbContext sınıfına g&amp;ouml;nderilir
        }

        public DbSet&amp;lt;MyBookStore.Data.Book&amp;gt; Books { get; set; } // Kitapları tutacağımız DbSet 
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;Book.cs&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.ComponentModel.DataAnnotations;

namespace MyBookStore.Data
{
    /*
    Book entity sınıfının &amp;ouml;zelliklerini DataAnnotations'dan gelen &amp;ccedil;eşitli
    attribute'lar ile kontrol altına alıyoruz.
    Zorunlu alan olma hali, sayısallar ve string'ler i&amp;ccedil;in aralık kontrol&amp;uuml; yapmaktayız.
    Buradaki ErrorMessage değerleri, Razor Page tarafında Validation işlemi sırasında 
    değer kazanır ve gerektiğinde uyarı olarak sayfada g&amp;ouml;sterilirler.
     */
    public class Book
    {
        public int Id { get; set; }
        [Required(ErrorMessage = "Kitabın adını yazar mısın l&amp;uuml;tfen")] 
        [StringLength(60, MinimumLength = 2, ErrorMessage = "En az 2 en fazla 60 karakter")]
        public string Title { get; set; }
        [Required(ErrorMessage = "Ka&amp;ccedil; sayfalık bir kitap bu")]
        [Range(100, 1500, ErrorMessage = "En az 100 en &amp;ccedil;ok 1500 sayfalık bir kitap olmalı")]
        public int PageCount { get; set; }
        [Required(ErrorMessage = "Liste fiyatı girilmeli")]
        [Range(1, 100, ErrorMessage = "En az 1 en &amp;ccedil;ok 100 liralık kitap olmalı")]
        public double ListPrice { get; set; }
        [Required(ErrorMessage = "Kısa da olsa &amp;ouml;zet gerekli")]
        [StringLength(250, MinimumLength = 50, ErrorMessage = "&amp;Ouml;zet en az 50 en fazla 250 karakter olmalı")]
        public string Summary { get; set; }
        [Required(ErrorMessage = "Yazar veya yazarlar olmalı")]
        [StringLength(60, MinimumLength = 3, ErrorMessage = "Yazarlar i&amp;ccedil;in en az 3 en fazla 60 karakter")]
        public string Authors { get; set; } //TODO Author isimli bir Entity modeli kullanalım
    }
}&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;&amp;Ouml;rnek ilk başta InMemory veri tabanını kullanacak şekilde tasarlanmıştır. Bu nedenle Startup.cs dosyasındaki ConfigureServices metodunda aşağıdaki gibi bir enjekte s&amp;ouml;z konusudur.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;// InMemory veritabanı kullanacağımız DbContext'imizi DI ile ekledik
services.AddDbContext&amp;lt;StoreDataContext&amp;gt;(options=&amp;gt;options.UseInMemoryDatabase("StoreLook"));&lt;/pre&gt;
&lt;p&gt;SQLite kullanımına ge&amp;ccedil;ildiğindeyse buradaki servis entegrasyonu ş&amp;ouml;yle olmalıdır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;// appsettings'den SQLite i&amp;ccedil;in gerekli connection string bilgisini aldık
var conStr=Configuration.GetConnectionString("StoreDataContext");
// ardından SQLite i&amp;ccedil;in gerekli DB Context'i servislere ekledik
// Artık modellerimiz SQLite veritabanı ile &amp;ccedil;alışacak
services.AddDbContext&amp;lt;StoreDataContext&amp;gt;(options=&amp;gt;options.UseSqlite(conStr));&lt;/pre&gt;
&lt;/blockquote&gt;
&lt;p&gt;Kitap ekleme fonksiyonelliği i&amp;ccedil;in Pages klas&amp;ouml;r&amp;uuml;ne ekleyeceğimiz AddBook.cshtml ve AddBook.cshtml.cs tipleri kullanılmaktadır. Bunlar Razor Page ve Model nesnelerimiz.&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&lt;em&gt;AddBook.cshtml&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Threading.Tasks;
using Microsoft.AspNetCore.Mvc;
using Microsoft.AspNetCore.Mvc.RazorPages;
using MyBookStore.Data;

namespace MyBookStore.Pages
{
    // İsimlendirme standardı gereği Razor sayfa modelleri 'Model' kelimesi ile biter
    public class AddBookModel : PageModel // PageModel t&amp;uuml;retmesi ile bir model olduğunu belirttik
    {
        private readonly StoreDataContext _context;
        //BindProperty &amp;ouml;zelliği ile Book tipinden olan BookData &amp;ouml;zelliğini Razor sayfasına bağlamış olduk.
        [BindProperty]
        public Book BookData { get; set; }

        public AddBookModel(StoreDataContext context)
        {
            _context = context; // Db Context'i kullanabilmek i&amp;ccedil;in i&amp;ccedil;eriye aldık
        }

        // Asenkron olarak &amp;ccedil;alışabilen ve sayfadaki Submit işlemi sonrası tetiklenen Post metodumuz
        // Tipik olarak Razor sayfasındaki model verisini alıp DbSet'e ekliyor ve kayıt ediyoruz.
        public async Task&amp;lt;IActionResult&amp;gt; OnPostAsync()
        {
            if (!ModelState.IsValid)
            {
                return Page();
            }

            var addedBook=_context.Books.Add(BookData).Entity;
            Console.WriteLine($"{addedBook.Title} eklendi");
            await _context.SaveChangesAsync();
            return RedirectToPage("/Index"); // Kitap eklendikten sonra ana sayfaya y&amp;ouml;nlendirme yapıyoruz
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;AddBook.cshtml.cs&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;@page // sayfanın bir razor page olduğunu belirttik
@model MyBookStore.Pages.AddBookModel  // sayfanın konuşacağı model sınıfını işaret ettik.

&amp;lt;html&amp;gt;
    &amp;lt;body&amp;gt;
        &amp;lt;h2&amp;gt;Yeni bir kitap eklemek ister misin?&amp;lt;/h2&amp;gt;
        &amp;lt;form method="POST"&amp;gt;
            &amp;lt;!--BookData sayfaya bağladığımız entity tipinden nesne &amp;ouml;rneği. 
            Bunu bağlamak i&amp;ccedil;in AddBookModel sınıfında BindProperty niteliği ile işaretlenmiş 
            bir &amp;ouml;zellik tanımladık. Her input kontrol&amp;uuml;nde dikkat edileceği &amp;uuml;zere asp-for
            niteliği ile bir &amp;ouml;zelliğe bağlantı yapılmakta --&amp;gt;

            &amp;lt;div class="input-group mb-3"&amp;gt;
                &amp;lt;input type="text" asp-for="BookData.Title" placeholder="Başlığı" class="form-control" aria-label="Default" aria-describedby="inputGroup-sizing-default"&amp;gt;
            &amp;lt;/div&amp;gt;
            &amp;lt;div class="input-group mb-3"&amp;gt;
                &amp;lt;input type="text" asp-for="BookData.Authors" placeholder="Yazarları" class="form-control" aria-label="Default" aria-describedby="inputGroup-sizing-default"&amp;gt;
            &amp;lt;/div&amp;gt;
            &amp;lt;div class="input-group mb-3"&amp;gt;
                &amp;lt;input type="text" asp-for="BookData.PageCount" placeholder="Sayfa sayısı" class="form-control" aria-label="Default" aria-describedby="inputGroup-sizing-default"&amp;gt;
            &amp;lt;/div&amp;gt;
            &amp;lt;div class="input-group mb-3"&amp;gt;
                &amp;lt;input type="text" asp-for="BookData.ListPrice" placeholder="Liste fiyatı" class="form-control" aria-label="Default" aria-describedby="inputGroup-sizing-default"&amp;gt;
            &amp;lt;/div&amp;gt;
            &amp;lt;div class="input-group mb-3"&amp;gt;
                &amp;lt;textarea asp-for="BookData.Summary" placeholder="Kısa bir &amp;ouml;zeti" class="form-control" aria-label="&amp;Ouml;zet"&amp;gt;&amp;lt;/textarea&amp;gt;
            &amp;lt;/div&amp;gt;
            &amp;lt;button type="submit" class="btn btn-primary btn-lg btn-block"&amp;gt;Kaydet&amp;lt;/button&amp;gt;
        &amp;lt;/form&amp;gt;
        &amp;lt;!--asp-for kullanılan t&amp;uuml;m elementler i&amp;ccedil;in &amp;ccedil;alışacak olan
        validation işleminin sonu&amp;ccedil;ları buraya yansıtılıyor--&amp;gt;
        &amp;lt;div asp-validation-summary="All"&amp;gt;&amp;lt;/div&amp;gt;
    &amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;p&gt;Kitap bilgilerini d&amp;uuml;zenlemek i&amp;ccedil;inse EditBook.cshtml ve EditBook.cshtml.cs isimli tipleri kullanmaktayız.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;EditBook.cshtml.cs&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Threading.Tasks;
using Microsoft.AspNetCore.Mvc;
using Microsoft.AspNetCore.Mvc.RazorPages;
using Microsoft.EntityFrameworkCore;
using MyBookStore.Data;
namespace MyBookStore.Pages
{
    public class EditBookModel
        : PageModel
    {
        // EditBook.cshtml sayfasına BookData &amp;ouml;zelliğini bağlamak i&amp;ccedil;in bu nitelik ile işaretledik
        [BindProperty]
        public Book BookData { get; set; }
        private StoreDataContext _context;
        public EditBookModel(StoreDataContext context)
        {
            _context = context;
        }

        // G&amp;uuml;ncelleme sayfasına id bilgisi parametre olarak gelecektir
        // Bunu kullanarak ilgili kitabı bulmaya ve bulursak BindProperty &amp;ouml;zelliği taşıyan
        // BookData isimli &amp;ouml;zelliğe bağlıyoruz.
        public async Task&amp;lt;IActionResult&amp;gt; OnGetAsync(int id)
        {
            BookData = await _context.Books.FindAsync(id);
            if (BookData == null) // Eğer bulunamassa ana sayfaya geri d&amp;ouml;n
            {
                return RedirectToPage("/index");
            }
            return Page(); //Bulunduysa sayfada kal
        }

        public async Task&amp;lt;IActionResult&amp;gt; OnPostAsync()
        {
            // Eksik veya hatalı bilgiler nedeniyle Model &amp;ouml;rneği doğrulanamadıysa
            // sayfada kalalım
            if (!ModelState.IsValid)
            {
                return Page();
            }
            // G&amp;uuml;ncellenen kitap bilgilerini Context'e ilave edip durumunu Modified'e &amp;ccedil;ektik
            _context.Attach(BookData).State = EntityState.Modified;

            try
            {
                // Değişiklikleri kaydetmeyi deniyoruz
                await _context.SaveChangesAsync();
            }
            catch (DbUpdateConcurrencyException)
            {
                throw new Exception($"{BookData.Id} numaralı kitabı bulamadık!");
            }

            // İşlemler başarılı ise tekrardan index'e(Anasayfa oluyor tabii) d&amp;ouml;n&amp;uuml;yoruz
            return RedirectToPage("/index");
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;EditBook.cshtml&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;@page "{id:int}" // Sayfa direktifinde parametre bilidirmi s&amp;ouml;z konusu. Nitekim buraya g&amp;uuml;ncellenmek istenen sayfanın id bilgisini almamız gerekiyor
@model MyBookStore.Pages.EditBookModel
@addTagHelper *, Microsoft.AspNetCore.Mvc.TagHelpers

@{
    ViewData["Title"] = "Kitap Bilgisi G&amp;uuml;ncelleme"; //Sayfa başlığını değiştirdik
}

&amp;lt;!--
Yeni bir kitap ekleme sayfasındakine benzer olacak şekilde bir formumuz var.
Form verisini Page Model sınıfındaki BindProperty'nin verisi ile dolduruyoruz.
Bunun i&amp;ccedil;in HTML kontrollerinin asp-for niteliklerini kullanmaktayız.
Submit &amp;ouml;zellikli Button'a basılması Sayfa model sınıfındaki OnPostAsync fonksiyonunun
tetiklenmesine neden olacaktır. Bu sayfa y&amp;uuml;klenirken devreye giren OnGetAsync metodunun parametresi
Page direktifinde belirtilmiştir. Yani sayfa Id parametresi ile gelen talepleri karşıladığında
bunu ilgili metoda iletir. Tahmin edileceği &amp;uuml;zere integer tipinden olmayan ge&amp;ccedil;ersiz bir Id değeri ile 
sayfaya gelinmesi HTTP 404 etkisi yaratacaktır.
Bir sayfaya gelen router parametrelerinin opsiyonel olmasını istersek ? takısını kullanmak yeterlidir.
"{id:int?}" gibi
--&amp;gt;
&amp;lt;h3&amp;gt;@Model.BookData.Id numaralı kitabın bilgilerini g&amp;uuml;nelleyebilirsiniz&amp;lt;/h3&amp;gt;
&amp;lt;form method="post"&amp;gt;
    &amp;lt;input asp-for="BookData.Id" type="hidden" /&amp;gt;
    &amp;lt;div class="input-group mb-3"&amp;gt;
    &amp;lt;input type="text" asp-for="BookData.Title" placeholder="Başlığı" class="form-control" aria-label="Default" aria-describedby="inputGroup-sizing-default"&amp;gt;
    &amp;lt;/div&amp;gt;
    &amp;lt;div class="input-group mb-3"&amp;gt;
        &amp;lt;input type="text" asp-for="BookData.Authors" placeholder="Yazarları" class="form-control" aria-label="Default" aria-describedby="inputGroup-sizing-default"&amp;gt;
    &amp;lt;/div&amp;gt;
    &amp;lt;div class="input-group mb-3"&amp;gt;
        &amp;lt;input type="text" asp-for="BookData.PageCount" placeholder="Sayfa sayısı" class="form-control" aria-label="Default" aria-describedby="inputGroup-sizing-default"&amp;gt;
    &amp;lt;/div&amp;gt;
    &amp;lt;div class="input-group mb-3"&amp;gt;
        &amp;lt;input type="text" asp-for="BookData.ListPrice" placeholder="Liste fiyatı" class="form-control" aria-label="Default" aria-describedby="inputGroup-sizing-default"&amp;gt;
    &amp;lt;/div&amp;gt;
    &amp;lt;div class="input-group mb-3"&amp;gt;
        &amp;lt;textarea asp-for="BookData.Summary" placeholder="Kısa bir &amp;ouml;zeti" class="form-control" aria-label="&amp;Ouml;zet"&amp;gt;&amp;lt;/textarea&amp;gt;
    &amp;lt;/div&amp;gt;
    &amp;lt;button type="submit" class="btn btn-primary btn-lg btn-block"&amp;gt;Kaydet&amp;lt;/button&amp;gt;
    &amp;lt;div asp-validation-summary="All"&amp;gt;&amp;lt;/div&amp;gt;
&amp;lt;/form&amp;gt;&lt;/pre&gt;
&lt;p&gt;Varsayılan olarak gelen Index.cshtml ve Index.cshtml.cs i&amp;ccedil;eriklerinide aşağıdaki gibi değiştirelim.&lt;/p&gt;
&lt;p&gt;&lt;em&gt;Index.cshtml.cs&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.AspNetCore.Mvc;
using Microsoft.AspNetCore.Mvc.RazorPages;
using Microsoft.EntityFrameworkCore;
using MyBookStore.Data;

namespace MyBookStore.Pages
{
    public class IndexModel
            : PageModel
    {
        private readonly StoreDataContext _context;

        public IndexModel(StoreDataContext context)
        {
            // DbContext'i i&amp;ccedil;eriye aldık
            _context = context;
        }
        public IList&amp;lt;Book&amp;gt; Books { get; private set; }
        // Kitap listesini &amp;ccedil;ektiğimiz asenkron metodumuz
        public async Task OnGetAsync()
        {
            Books = await _context.Books
                            .AsNoTracking()
                            .ToListAsync();
        }
        // Silme operasyonunu icra eden metodumuz
        public async Task&amp;lt;IActionResult&amp;gt; OnPostDeleteAsync(int id)
        {
            // Silme operasyonu i&amp;ccedil;in Identity alanından &amp;ouml;nce
            // kitabı bul
            var book=await _context.Books.FindAsync(id);
            if(book!=null) //Kitabı bulduysan
            {
                _context.Books.Remove(book); 
                //Kitabı &amp;ccedil;ıkart ve Context'i son haliyle kaydet
                await _context.SaveChangesAsync();
            }
            return RedirectToPage(); // Scotty bizi o anki sayfaya d&amp;ouml;nd&amp;uuml;r
        }
    }
}&lt;/pre&gt;
&lt;p&gt;&lt;em&gt;Index.cshtml&lt;/em&gt;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;@page
@model IndexModel
@{
    ViewData["Title"] = "Kitaplarım";
}
@addTagHelper *, Microsoft.AspNetCore.Mvc.TagHelpers

&amp;lt;h2&amp;gt;G&amp;uuml;ncel Liste&amp;lt;/h2&amp;gt;
&amp;lt;form method="post"&amp;gt;
    &amp;lt;!-- Modeldeki Books &amp;ouml;zelliğinin işaret ettiği nesnelerin her biri i&amp;ccedil;in d&amp;ouml;n&amp;uuml;yoruz --&amp;gt;
    @foreach (var book in Model.Books)
    {
      &amp;lt;div class="card"&amp;gt;
        &amp;lt;div class="card-body"&amp;gt;
            &amp;lt;!--O anki book nesne &amp;ouml;rneğinin &amp;ouml;zelliklerine ulaşıp değerlerini basıyoruz --&amp;gt;
            &amp;lt;h5 class="card-title"&amp;gt;@book.Title (@book.PageCount sayfa)&amp;lt;/h5&amp;gt;
            &amp;lt;h6 class="card-subtitle mb-2 text-muted"&amp;gt;@book.Authors&amp;lt;/h6&amp;gt;
            &amp;lt;p class="card-text"&amp;gt;@book.Summary&amp;lt;/p&amp;gt;
            &amp;lt;p class="card-text"&amp;gt;@book.ListPrice&amp;lt;/p&amp;gt;
            &amp;lt;!--G&amp;uuml;ncelleme başka bir Razor Page tarafından yapılacak --&amp;gt;
            &amp;lt;a asp-page="./EditBook" asp-route-id="@book.Id" class="card-link"&amp;gt;D&amp;uuml;zenle&amp;lt;/a&amp;gt;
            &amp;lt;!--Silme işlemi ise bu sayfadan Post edilerek ger&amp;ccedil;ekleşecek
            asp-route-id ile silme ve g&amp;uuml;ncelleme operasyonlarında gerekli identity
            alanının nereden bağlanacağını belirtiyoruz
            --&amp;gt;
            &amp;lt;button type="submit" asp-page-handler="delete" asp-route-id="@book.Id" class="card-link"&amp;gt;Sil&amp;lt;/button&amp;gt;
        &amp;lt;/div&amp;gt;
      &amp;lt;/div&amp;gt;  
    }
    &amp;lt;!--Yeni bir kitap eklemek i&amp;ccedil;in AddBook sayfasına y&amp;ouml;nlendiriyoruz--&amp;gt;
    &amp;lt;a asp-page="./AddBook"&amp;gt;Yeni Kitap&amp;lt;/a&amp;gt;
&amp;lt;/form&amp;gt;&lt;/pre&gt;
&lt;p&gt;Ayrıca shared klas&amp;ouml;r&amp;uuml;nde yer alan _Layout.cshtml dosyasınıda kurcalayıp&amp;nbsp;navigasyon sekmesindeki linklerin bizim istediğimiz şekilde &amp;ccedil;ıkmasını sağlayabiliriz.&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;!DOCTYPE html&amp;gt;
&amp;lt;html&amp;gt;
&amp;lt;head&amp;gt;
    &amp;lt;meta charset="utf-8" /&amp;gt;
    &amp;lt;meta name="viewport" content="width=device-width, initial-scale=1.0" /&amp;gt;
    &amp;lt;title&amp;gt;@ViewData["Title"] - MyBookStore&amp;lt;/title&amp;gt;

    &amp;lt;environment include="Development"&amp;gt;
        &amp;lt;link rel="stylesheet" href="~/lib/bootstrap/dist/css/bootstrap.css" /&amp;gt;
    &amp;lt;/environment&amp;gt;
    &amp;lt;environment exclude="Development"&amp;gt;
        &amp;lt;link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/4.1.3/css/bootstrap.min.css"
              asp-fallback-href="~/lib/bootstrap/dist/css/bootstrap.min.css"
              asp-fallback-test-class="sr-only" asp-fallback-test-property="position" asp-fallback-test-value="absolute"
              crossorigin="anonymous"
              integrity="sha256-eSi1q2PG6J7g7ib17yAaWMcrr5GrtohYChqibrV7PBE="/&amp;gt;
    &amp;lt;/environment&amp;gt;
    &amp;lt;link rel="stylesheet" href="~/css/site.css" /&amp;gt;
&amp;lt;/head&amp;gt;
&amp;lt;body&amp;gt;
    &amp;lt;header&amp;gt;
        &amp;lt;nav class="navbar navbar-expand-sm navbar-toggleable-sm navbar-light bg-white border-bottom box-shadow mb-3"&amp;gt;
            &amp;lt;div class="container"&amp;gt;
                &amp;lt;a class="navbar-brand" asp-area="" asp-page="/Index"&amp;gt;Sevdiğim Kitaplar&amp;lt;/a&amp;gt;
                &amp;lt;button class="navbar-toggler" type="button" data-toggle="collapse" data-target=".navbar-collapse" aria-controls="navbarSupportedContent"
                        aria-expanded="false" aria-label="Toggle navigation"&amp;gt;
                    &amp;lt;span class="navbar-toggler-icon"&amp;gt;&amp;lt;/span&amp;gt;
                &amp;lt;/button&amp;gt;
                &amp;lt;div class="navbar-collapse collapse d-sm-inline-flex flex-sm-row-reverse"&amp;gt;
                    &amp;lt;ul class="navbar-nav flex-grow-1"&amp;gt;
                        &amp;lt;li class="nav-item"&amp;gt;
                            &amp;lt;a class="nav-link text-dark" asp-area="" asp-page="/Index"&amp;gt;Lobi&amp;lt;/a&amp;gt;
                        &amp;lt;/li&amp;gt;
                        &amp;lt;li class="nav-item"&amp;gt;
                            &amp;lt;a class="nav-link text-dark" asp-area="" asp-page="/AddBook"&amp;gt;Yeni Kitap&amp;lt;/a&amp;gt;
                        &amp;lt;/li&amp;gt;
                        &amp;lt;!-- &amp;lt;li class="nav-item"&amp;gt;
                            &amp;lt;a class="nav-link text-dark" asp-area="" asp-page="/Privacy"&amp;gt;Privacy&amp;lt;/a&amp;gt;
                        &amp;lt;/li&amp;gt; --&amp;gt;
                    &amp;lt;/ul&amp;gt;
                &amp;lt;/div&amp;gt;
            &amp;lt;/div&amp;gt;
        &amp;lt;/nav&amp;gt;
    &amp;lt;/header&amp;gt;
    &amp;lt;div class="container"&amp;gt;
        &amp;lt;partial name="_CookieConsentPartial" /&amp;gt;
        &amp;lt;main role="main" class="pb-3"&amp;gt;
            @RenderBody()
        &amp;lt;/main&amp;gt;
    &amp;lt;/div&amp;gt;

    &amp;lt;footer class="border-top footer text-muted"&amp;gt;
        &amp;lt;div class="container"&amp;gt;
            &amp;copy; 2019 - MyBookStore - &amp;lt;a asp-area="" asp-page="/Privacy"&amp;gt;Privacy&amp;lt;/a&amp;gt;
        &amp;lt;/div&amp;gt;
    &amp;lt;/footer&amp;gt;

    &amp;lt;environment include="Development"&amp;gt;
        &amp;lt;script src="~/lib/jquery/dist/jquery.js"&amp;gt;&amp;lt;/script&amp;gt;
        &amp;lt;script src="~/lib/bootstrap/dist/js/bootstrap.bundle.js"&amp;gt;&amp;lt;/script&amp;gt;
    &amp;lt;/environment&amp;gt;
    &amp;lt;environment exclude="Development"&amp;gt;
        &amp;lt;script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"
                asp-fallback-src="~/lib/jquery/dist/jquery.min.js"
                asp-fallback-test="window.jQuery"
                crossorigin="anonymous"
                integrity="sha256-FgpCb/KJQlLNfOu91ta32o/NMZxltwRo8QtmkMRdAu8="&amp;gt;
        &amp;lt;/script&amp;gt;
        &amp;lt;script src="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/4.1.3/js/bootstrap.bundle.min.js"
                asp-fallback-src="~/lib/bootstrap/dist/js/bootstrap.bundle.min.js"
                asp-fallback-test="window.jQuery &amp;amp;&amp;amp; window.jQuery.fn &amp;amp;&amp;amp; window.jQuery.fn.modal"
                crossorigin="anonymous"
                integrity="sha256-E/V4cWE4qvAeO5MOhjtGtqDzPndRO1LBk8lJ/PR7CA4="&amp;gt;
        &amp;lt;/script&amp;gt;
    &amp;lt;/environment&amp;gt;
    &amp;lt;script src="~/js/site.js" asp-append-version="true"&amp;gt;&amp;lt;/script&amp;gt;

    @RenderSection("Scripts", required: false)
&amp;lt;/body&amp;gt;
&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;h2&gt;&amp;Ccedil;alışma Zamanı&lt;/h2&gt;
&lt;p&gt;Kodlama tarafını tamamladıktan&amp;nbsp;sonra uygulamayı aşağıdaki terminal komutu ile &amp;ccedil;alıştırıp deneme s&amp;uuml;r&amp;uuml;ş&amp;uuml;ne &amp;ccedil;ıkabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet run&lt;/pre&gt;
&lt;p&gt;Eğer uygulama sorunsuz &amp;ccedil;alıştıysa http://localhost:5401/ adresi &amp;uuml;zerinden hareket edebiliriz. İster &amp;uuml;st bara eklediğimiz linkten ister http://localhost:5401/AddBook adresine giderek yeni kitap ekleme sayfasına ulaşabiliriz&lt;em&gt;(Razor i&amp;ccedil;in&amp;nbsp;belirlenen&amp;nbsp;varsayılan adres WestWorld sisteminde kullanıldığı i&amp;ccedil;in UseUrls metodu ile onu 5401e &amp;ccedil;ektim. Program.cs'e bakınız)&lt;/em&gt;&lt;/p&gt;
&lt;blockquote&gt;
&lt;p&gt;In Memory veritabanı kullandığımız versiyonda uygulama sonlandığında t&amp;uuml;m kayıtlar u&amp;ccedil;acaktır. Kalıcı bir depolama i&amp;ccedil;in SQL, SQLite ve benzeri sistemleri i&amp;ccedil;eriye enjekte edebiliriz. İlerleyen kısımda SQLite denememiz olacak.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;p&gt;Uncle Bob temalı &amp;ouml;rnek bir kitap verisini ilk denemede kullanmak isterseniz diye aşağıya bilgilerini bırakıyorum ;)&lt;/p&gt;
&lt;pre class="brush:plain;auto-links:false;toolbar:false" contenteditable="false"&gt;Clean Architecture
Robert C. Martin (Uncle Bob)
393
34.99
"This is essential reading for every current of aspiring software architect..."&lt;/pre&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/21/Cover_1.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Console logundan kitabın eklendiğini izleyebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/21/Cover_2.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;İşlemler sırasında veri doğrulama kontrol&amp;uuml;ne takılırsak aşağıdaki gibi bir g&amp;ouml;r&amp;uuml;nt&amp;uuml; ile karşılaşırız&lt;em&gt;(Bu kısmı daha şık bir hale getirmek gerekiyor. Belki popup'lar ile uyarı vermek daha g&amp;uuml;zel olabilir. Bunu yapmayı bir deneyin)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/21/Cover_3.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Başarılı girişler sonrası gelinen Index sayfasının &amp;ccedil;ıktısı ise aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;ndekine benzer olacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/21/Cover_4.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Bir kitabı d&amp;uuml;zenlemek i&amp;ccedil;in D&amp;uuml;zenle başlıklı linke tıkladığımızda EditBook/{Id} şeklindeki bir y&amp;ouml;nlendirme &amp;ccedil;alışır. Bu tahmin edeceğiniz &amp;uuml;zere EditBook.cshtml sayfasının işletilmesini sağlayacaktır.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/21/Cover_5.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;D&amp;uuml;zenleme sonrası &amp;ouml;rnek sonu&amp;ccedil;lar da ş&amp;ouml;yle olabilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/21/Cover_6.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;InMemory Veritabanını SQLite ile Değiştirme&lt;/h2&gt;
&lt;p&gt;&amp;Ouml;rnekte kullandığımız veri merkezini SQLite tarafına d&amp;ouml;n&amp;uuml;şt&amp;uuml;rmek i&amp;ccedil;in EntityFramework Core'un ilgili NuGet paketini projeye eklemek lazım. Bunun i&amp;ccedil;in aşağıdaki terminal komutu kullanılabilir.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet add package Microsoft.EntityFrameworkCore.SQLite&lt;/pre&gt;
&lt;p&gt;Ardından appsettings.json dosyasına bir Connection String bildirimi dahil edip, Startup sınıfındaki ConfigureServices metodunda minik bir ayarlama yapmak gerekiyor ki bunu yazının &amp;ouml;nceki kısımlarında not olarak belirtmiştik.&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;{
  "Logging": {
    "LogLevel": {
      "Default": "Warning"
    }
  },
  "ConnectionStrings": {
    "StoreDataContext": "Data Source=MyBookStore.db"
  },
  "AllowedHosts": "*"
}&lt;/pre&gt;
&lt;p&gt;Bunlar başlangı&amp;ccedil; aşamasında yeterli değil. &amp;Ccedil;&amp;uuml;nk&amp;uuml; ortada fiziki veri tabanı yok. Dolayısıyla SQLite veri tabanının da oluşturulması gerekiyor.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;dotnet ef migrations add InitialCreate
dotnet ef database update&lt;/pre&gt;
&lt;p&gt;Yukarıdaki terminal komutları sayesinde DataContext t&amp;uuml;revli sınıf baz alınarak migration planları &amp;ccedil;ıkartılır. Planlar hazırlandıktan sonra ikinci komut ile update işlemi icra edilir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/21/Cover_8.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Eğer veri tabanını baştan hazırlamaz ve update planını &amp;ccedil;alıştırmazsak aşağıdakine benzer bir hata ile karşılaşabiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/21/Cover_7.png" alt="" /&gt;&lt;/p&gt;
&lt;p&gt;Artık verilerimiz SQLite ile fiziki olarak da kayıt altında. Hatta Visual Studio Code'a &lt;a href="https://marketplace.visualstudio.com/items?itemName=alexcvzz.vscode-sqlite" target="_blank"&gt;SQLite Explorer Extension&lt;/a&gt; isimli aracı eklersek oluşan DB dosyasının i&amp;ccedil;eriğini de g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/05/21/Cover_9.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Ben Neler &amp;Ouml;ğrendim?&lt;/h2&gt;
&lt;p&gt;Bu &amp;ccedil;alışmanın da bana kattığı bir s&amp;uuml;r&amp;uuml; şey oldu elbette. &amp;Uuml;st&amp;uuml;nden tekrar ge&amp;ccedil;menin faydalarını g&amp;ouml;rd&amp;uuml;m ilk başta. &amp;Ouml;zetle &amp;ouml;ğrendiklerimi aşağıdaki gibi sıralayabilirim.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Razor Page ve Page Model kavramlarının ne olduğunu&lt;/li&gt;
&lt;li&gt;Razor'un temel &amp;ccedil;alışma prensiplerini&lt;/li&gt;
&lt;li&gt;Y&amp;ouml;nlendirmelerin&lt;em&gt;(Routing)&lt;/em&gt; nasıl işlediğini&lt;/li&gt;
&lt;li&gt;Razor i&amp;ccedil;inden model nesnelerine nasıl bağlanılabileceğini&lt;em&gt;(property binding)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;Entity Framework Core'da InMemory veri tabanı kullanımını&lt;/li&gt;
&lt;li&gt;DI ile ilgili servislerin nasıl enjekte edildiğini&lt;/li&gt;
&lt;li&gt;&amp;Ccedil;eşitli DataAnnotations niteliklerini&lt;em&gt;(attributes)&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;InMemory veri tabanında SQLite kullanımına ge&amp;ccedil;ince yapılması gereken değişiklikleri ve Migration'ın ne işe yaradığını&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;B&amp;ouml;ylece &lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;Saturday-Night-Works&lt;/a&gt; &amp;ccedil;alışmalarının&amp;nbsp;21 numaralı &amp;ouml;rneğine ait derlemenin&amp;nbsp;sonuna gelmiş olduk. Diğer &amp;ccedil;alışmalardan da g&amp;ouml;z&amp;uuml;me kestirdiklerimi ele alıp bloğuma not olarak d&amp;uuml;şeceğim. Fark ettim ki Saturday-Night-Works &amp;ccedil;alışmaları kendimi kişisel olarak geliştirmek adına yeterli ama tamamlayıcılık a&amp;ccedil;ısından eksik. Yapılan her uygulamanın &amp;uuml;st&amp;uuml;nden bir kere daha ge&amp;ccedil;mek, kodları okumak ve notları daha derli toplu olarak bloguma koymak tamamlayıcı bir motivasyon olarak karşıma &amp;ccedil;ıkıyor. Bir başka macera derlemesinde g&amp;ouml;r&amp;uuml;şmek &amp;uuml;midiyle hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2019-05-17 12:53:00</pubDate>
  <slug>razor-dunyasindaki-ilk-adimlarim</slug>
  <tags>
    <tag>razor</tag>
    <tag>net-core</tag>
    <tag>c#</tag>
    <tag>html</tag>
    <tag>cshtml</tag>
    <tag>mode-page</tag>
    <tag>razor-page</tag>
    <tag>routing</tag>
    <tag>entity-framework</tag>
    <tag>sqlite</tag>
    <tag>inmemory-database</tag>
    <tag>data-annotations</tag>
    <tag>property-binding</tag>
    <tag>bootstrap</tag>
    <tag>dotnet</tag>
    <tag>viewdata</tag>
  </tags>
  <categories>
    <category>Asp.Net Core</category>
  </categories>
</post>