<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Netspecter Abstract Class Peşinde</title>
  <description>Netspecter bu kez bir abstract sınıfın peşinde. Sizin içinde eğlenceli bir deneyim olacağına inandığım enteresan bir vakayı analiz etmeye çalışıyor olacağız. Çoğunlukla kod geliştirirken pek fark etmediğimiz bir hata ama hemen çözüm üretebiliyorz. Lakin bu çözümü üretirken istediğimizin dışında bir sonuca da neden olabiliyoruz. Dilerseniz hiç vakit kaybetmeden konumuza geçelim. İlk olarak aşağıdaki kod içeriğini göz önüne alarak başlamamızda yarar olacağı kanısındayım.</description>
  <content>&lt;p&gt;&lt;a href="/pics/blg230_Giris.jpg"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; float: right; padding-top: 0px; border-width: 0px;" title="blg230_Giris" src="/pics/blg230_Giris_thumb.jpg" alt="blg230_Giris" width="304" height="185" align="right" border="0" /&gt;&lt;/a&gt;Yağmur şiddetini giderek arttırıyordu. Karanlık ara sokakta gizemli bir pardes&amp;uuml; ise ağır ağır ilerlemekteydi. Etraftaki pis kokunun hemen sokağın başındaki &amp;ccedil;&amp;ouml;p konteynerlerinden geldiği ap a&amp;ccedil;ık ortadaydı. Ancak gizemli pardes&amp;uuml; bu kokuyu umursamıyordu bile. Bir an durdu ve ş&amp;uuml;pheli bir şekilde arkasına baktı.&lt;/p&gt;
&lt;p&gt;Karanlık i&amp;ccedil;erisinde sadece g&amp;ouml;zleri belli oluyordu. Kaşlarını &amp;ccedil;attı ve bir anda irkilerek koşmaya başladı. O kadar paniklemişti ki, koşarken teneke &amp;ccedil;&amp;ouml;p kutularını fark etmedi bile. &amp;Ouml;nce yere d&amp;uuml;şt&amp;uuml;, bir s&amp;uuml;re yuvarlandı. &amp;Ccedil;evredeki kediler sağ sola ka&amp;ccedil;ışırken, kalkmaya &amp;ccedil;alıştı ama &amp;ouml;n&amp;uuml;ndeki metal iskeleyi hesaplayamadı. Kafasını sert bir şekilde demire &amp;ccedil;arptı.&lt;/p&gt;
&lt;p&gt;Bir ka&amp;ccedil; saniye sonra g&amp;ouml;ky&amp;uuml;z&amp;uuml;nden d&amp;uuml;şen yağmur damlalarını g&amp;ouml;rebiliyor ama seslerini duyamıyordu. Onun yerine kafasında bir uğultu vardı. Etrafında dans eden kod par&amp;ccedil;ları g&amp;ouml;r&amp;uuml;yordu. G&amp;ouml;zleri yavaş yavaş kararmaya başlamıştı. Derken başında beliren kişiyi g&amp;ouml;rd&amp;uuml;&amp;hellip;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;- Gizemli Pardes&amp;uuml; :&lt;/strong&gt; Netspecter!!! Sen haaa &amp;hellip;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;- Netspecter : &lt;/strong&gt;Evet yaaa. Ben&amp;hellip;Fazla uzağa ka&amp;ccedil;amadın eski dostum &lt;strong&gt;Abstract Class &lt;/strong&gt;&lt;img class="wlEmoticon wlEmoticon-sarcasticsmile" style="border-style: none;" src="/pics/wlEmoticon-sarcasticsmile.png" alt="Sarcastic smile" /&gt;&lt;/p&gt;
&lt;p&gt;Merhaba Arkadaşlar,&lt;/p&gt;
&lt;p&gt;Netspecter bu kez bir abstract sınıfın peşinde. Sizin i&amp;ccedil;inde eğlenceli bir deneyim olacağına inandığım enteresan bir vakayı analiz etmeye &amp;ccedil;alışıyor olacağız. &amp;Ccedil;oğunlukla kod geliştirirken pek fark etmediğimiz bir hata ama hemen &amp;ccedil;&amp;ouml;z&amp;uuml;m &amp;uuml;retebiliyorz. Lakin bu &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; &amp;uuml;retirken istediğimizin dışında bir sonuca da neden olabiliyoruz. Dilerseniz hi&amp;ccedil; vakit kaybetmeden konumuza ge&amp;ccedil;elim. İlk olarak aşağıdaki kod i&amp;ccedil;eriğini g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alarak başlamamızda yarar olacağı kanısındayım.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg230_BeginingDiagram.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border-width: 0px;" title="blg230_BeginingDiagram" src="/pics/blg230_BeginingDiagram_thumb.gif" alt="blg230_BeginingDiagram" width="403" height="262" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;internal class Composer 
{ 
    public int Duration { get; set; } 
    public string Description { get; set; } 
}

public interface IWriter 
{ 
    Composer CreateComposer(int Duration, string Description); 
}&lt;/pre&gt;
&lt;p&gt;&amp;Ouml;rnek kod par&amp;ccedil;asında &lt;strong&gt;IWriter&lt;/strong&gt; isimli bir &lt;strong&gt;aray&amp;uuml;z(interface)&lt;/strong&gt; tipi olduğunu g&amp;ouml;rmekteyiz. Bildiğiniz &amp;uuml;zere aray&amp;uuml;zler &lt;strong&gt;Plug-In&lt;/strong&gt; tabanlı programlamada, servis y&amp;ouml;nelimli mimarilerde sıklıkla kullanılmaktadır. Aray&amp;uuml;zlerin tipik &amp;ouml;zelliklerinden birisi uygulandıkları tipler i&amp;ccedil;in zorlayıcı kuralları bildiriyor olmalarıdır. Ayrıca &amp;ccedil;ok bi&amp;ccedil;imli davranışta g&amp;ouml;sterebilirler. Bir başka deyişle kendisinde t&amp;uuml;reyen tipleri taşıyabilir ve &amp;ccedil;alışma zamanında onlara ait olan fonksiyonellikleri y&amp;uuml;r&amp;uuml;terek kılık değşitirebilirler.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rneğimizde yer alan &lt;strong&gt;IWriter&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; ise &amp;ouml;zel bir duruma neden olmaktadır. Dikkat edileceği &amp;uuml;zere &lt;strong&gt;CreateComposer&lt;/strong&gt; metodu geriye &lt;strong&gt;Composer&lt;/strong&gt; tipinden bir nesne &amp;ouml;rneği d&amp;ouml;nd&amp;uuml;rmektedir. S&amp;ouml;z konusu nesne tipinin erişim belirleyici &lt;strong&gt;Internal&amp;rsquo;&lt;/strong&gt; dır. Bu koşullar altında kodu derlediğimizde aşağıdaki ekran g&amp;ouml;r&amp;uuml;nt&amp;uuml;s&amp;uuml;nde yer alan hatanın oluştuğunu g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg230_FirstError.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border-width: 0px;" title="blg230_FirstError" src="/pics/blg230_FirstError_thumb.gif" alt="blg230_FirstError" width="388" height="298" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere &lt;strong&gt;IWriter&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n &lt;strong&gt;internal&lt;/strong&gt; olan &lt;strong&gt;Composer&lt;/strong&gt; tipini kullanan bir &amp;uuml;yeye sahip olması m&amp;uuml;mk&amp;uuml;n değildir. Sorunun &amp;ccedil;&amp;ouml;z&amp;uuml;m&amp;uuml; aslında basittir. Hatta her developer hemen bunu yapacaktır. &lt;strong&gt;IWriter&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml;n internal olarak tanımlanması halinde herhangibir derleme hatası ile karşılaşılmayacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;internal class Composer 
{ 
    public int Duration { get; set; } 
    public string Description { get; set; } 
}

internal interface IWriter 
{ 
    Composer CreateComposer(int Duration, string Description); 
    // ...kurallara g&amp;ouml;re bu zaten Public bir &amp;uuml;yedir. Ama şu noktada Internal olan bir tipi geriye d&amp;ouml;nd&amp;uuml;rmektedir. Ş&amp;uuml;pheli bir durum mudur acaba? 
}&lt;/pre&gt;
&lt;p&gt;Burada yine de ş&amp;uuml;phe uyandırıcı bir gelişme vardır. Bilindiği &amp;uuml;zere &lt;strong&gt;Interface&lt;/strong&gt; &amp;uuml;yeleri doğal olarak &lt;strong&gt;public&amp;rsquo;&lt;/strong&gt; tir. Buna rağmen doğal olarak public olan &lt;strong&gt;CreateComposer&lt;/strong&gt; metodu &lt;strong&gt;Internal&lt;/strong&gt; erişim belirleyicisine sahip bir &amp;ouml;rneği d&amp;ouml;nd&amp;uuml;rmektedir. Oysaki public olan IWriter aray&amp;uuml;z&amp;uuml;n&amp;uuml;n internal olan Composer tipini kullanmasına izin verilmemiştir &lt;img class="wlEmoticon wlEmoticon-confusedsmile" style="border-style: none;" src="/pics/wlEmoticon-confusedsmile.png" alt="Confused smile" /&gt; Şimdilik bunu d&amp;uuml;ş&amp;uuml;nerek kafamızı karıştırmayalım. &amp;Ccedil;&amp;uuml;nk&amp;uuml; asıl amacımız &lt;strong&gt;internal&amp;rsquo;&lt;/strong&gt; a &amp;ccedil;ekmek zorunda kaldığımız &lt;strong&gt;IWriter&lt;/strong&gt; aray&amp;uuml;z tipinin &lt;strong&gt;public&lt;/strong&gt; olarak kullanılmasının istenmesidir. A&amp;ccedil;ık olmak gerekirse şu an i&amp;ccedil;in bunu da bir kenara bırakalım ve &lt;strong&gt;IWriter&lt;/strong&gt; aray&amp;uuml;z&amp;uuml;n&amp;uuml; bir sınıfa bu haliyle uygulamak istediğimizi d&amp;uuml;ş&amp;uuml;nelim. &amp;Ouml;rneğin aşağıdaki kod par&amp;ccedil;asında g&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; gibi.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class SpaceWriter 
        : IWriter 
    { 
        #region IWriter Members

        public Composer CreateComposer(int Duration, string Description) 
        { 
            throw new System.NotImplementedException(); 
        }

        #endregion 
    }&lt;/pre&gt;
&lt;p&gt;G&amp;ouml;r&amp;uuml;ld&amp;uuml;ğ&amp;uuml; &amp;uuml;zere &lt;strong&gt;SpaceWriter&lt;/strong&gt; isimli sınıf, &lt;strong&gt;IWriter&lt;/strong&gt; &lt;strong&gt;interface&lt;/strong&gt; tipini implemente etmektedir. Buna g&amp;ouml;re de &lt;strong&gt;CreateComposer&lt;/strong&gt; metodunu &lt;strong&gt;override&lt;/strong&gt; etmiştir. Herşey yolunda g&amp;ouml;r&amp;uuml;nmesine rağmen kodu derlediğimizde aşağıdaki hata mesajını almamız ka&amp;ccedil;ınılmazdır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg230_SecondError.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border-width: 0px;" title="blg230_SecondError" src="/pics/blg230_SecondError_thumb.gif" alt="blg230_SecondError" width="405" height="317" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Yine yine yine&amp;hellip;&lt;strong&gt;Inconsistent Accessibility &lt;/strong&gt;hatası &lt;img class="wlEmoticon wlEmoticon-annoyed" style="border-style: none;" src="/pics/wlEmoticon-annoyed.png" alt="Annoyed" /&gt; Burada aray&amp;uuml;z tipinin &lt;strong&gt;bilin&amp;ccedil;siz(Implicitly)&lt;/strong&gt; olarak uygulandığı g&amp;ouml;r&amp;uuml;lmektedir. İşte hani bazen &lt;strong&gt;interface&lt;/strong&gt; tiplerini implemente ederken &lt;strong&gt;Ctrl+Shift+F10 &lt;/strong&gt;tuşlarına bastığımızda &amp;ccedil;ıkan se&amp;ccedil;enekler arasında bir de &lt;strong&gt;Explicit&lt;/strong&gt; olanı vardır ya &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile.png" alt="Winking smile" /&gt; İşte o a&amp;ccedil;ık bildirim burada bir &amp;ccedil;&amp;ouml;z&amp;uuml;m olmaktadır.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg230_ExplicitImplementation.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border-width: 0px;" title="blg230_ExplicitImplementation" src="/pics/blg230_ExplicitImplementation_thumb.gif" alt="blg230_ExplicitImplementation" width="325" height="109" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;p&gt;Yani aray&amp;uuml;z implementasyonunu aşağıdaki hale getirirsek kod sorunsuz bir şekilde derleniyor olacaktır.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;public class SpaceWriter 
    : IWriter 
{ 
    #region IWriter Members

    Composer IWriter.CreateComposer(int Duration, string Description) 
    { 
        throw new System.NotImplementedException(); 
    }

    #endregion 
}&lt;/pre&gt;
&lt;p&gt;Dikkat edileceği &amp;uuml;zere metod adının bildirimi sırasında &lt;strong&gt;IWriter.CreateComposer(InterfaceName.InterfaceMemberName) &lt;/strong&gt;isimlendirme notasyonu devreye girmiştir ve derleme hatası ortadan kalkmıştır. Yine de sorun devam etmektedir &lt;img class="wlEmoticon wlEmoticon-annoyed" style="border-style: none;" src="/pics/wlEmoticon-annoyed.png" alt="Annoyed" /&gt; Mecburen &lt;strong&gt;IWriter&lt;/strong&gt; aray&amp;uuml;z&amp;uuml; internal erişim belirleyicisini kullanmak zorunda kalmıştır. İşte sevgili kahramanımız &lt;strong&gt;Netspecter&amp;rsquo;&lt;/strong&gt; ın peşinden koştuğu &lt;strong&gt;abstract class &lt;/strong&gt;bize bu tip bir vaka i&amp;ccedil;in &amp;ccedil;&amp;ouml;z&amp;uuml;m getirebilir. Nasıl mı? İşte &lt;strong&gt;sınıf &amp;ccedil;izelgemiz(Class Diagramı)&lt;/strong&gt; ve &amp;ouml;rnek kod par&amp;ccedil;amız.&lt;/p&gt;
&lt;p&gt;&lt;a href="/pics/blg230_FinalDiagram.gif"&gt;&lt;img style="background-image: none; margin: 4px 0px; padding-left: 0px; padding-right: 0px; display: inline; padding-top: 0px; border-width: 0px;" title="blg230_FinalDiagram" src="/pics/blg230_FinalDiagram_thumb.gif" alt="blg230_FinalDiagram" width="400" height="423" border="0" /&gt;&lt;/a&gt;&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;internal class Composer 
{ 
    public int Duration { get; set; } 
    public string Description { get; set; } 
}

public abstract class AbstractWriter 
{ 
    internal abstract Composer CreateComposer(int Duration, string Description); 
}

public class LogWriter 
    : AbstractWriter 
{ 
    internal override Composer CreateComposer(int Duration, string Description) 
    { 
        throw new System.NotImplementedException(); 
    } 
}&lt;/pre&gt;
&lt;p&gt;&lt;img class="wlEmoticon wlEmoticon-openmouthedsmile" style="border-style: none;" src="/pics/wlEmoticon-openmouthedsmile.png" alt="Open-mouthed smile" /&gt; Volaaaa&amp;hellip; Evet evet biliyorum &lt;strong&gt;interface&lt;/strong&gt; tipi kullanımından vazge&amp;ccedil;tik ve &lt;strong&gt;abstract class &lt;/strong&gt;kullanımına ge&amp;ccedil;tik. Ancak bir a&amp;ccedil;ıdan baktığımızda aynı amaca hizmet ettiklerini ifade ebiliriz. S&amp;ouml;z gelimi gerek &lt;strong&gt;interface&lt;/strong&gt; gerek &lt;strong&gt;abstract&lt;/strong&gt; &lt;strong&gt;sınıflar &lt;/strong&gt;&amp;ouml;rneklenemezler. Yani &lt;strong&gt;new&lt;/strong&gt; operat&amp;ouml;r&amp;uuml; ile &lt;strong&gt;initialize&lt;/strong&gt; edilemezler &lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile.png" alt="Winking smile" /&gt; &amp;Uuml;stelik her ikiside &amp;ccedil;ok bi&amp;ccedil;imli davranış g&amp;ouml;sterebilirler. T&amp;uuml;retme amacıyla kullanılabilirler ve kendisinden t&amp;uuml;reyen tiplerin mutlaka uyması gereken kuralları belirtebilirler. Sadece nasıl belirttikleri farklıdır. Tabi arada başka farklarda bulunmaktadır. S&amp;ouml;z gelimi aray&amp;uuml;z tiplerinde iş yapan bloklara sahip &amp;uuml;ye bildirimleri yapılamaz veya bu &amp;uuml;yeler i&amp;ccedil;in erişim belirleyicisi kullanılamaz. Ancak &lt;strong&gt;abstract&lt;/strong&gt; tiplerde durum tam tersidir.&lt;/p&gt;
&lt;p&gt;&amp;Ouml;rnek vakamızın son halinde &lt;strong&gt;AbstractWriter&lt;/strong&gt; &lt;strong&gt;abstract &lt;/strong&gt;sınıfı i&amp;ccedil;erisinde &lt;strong&gt;internal&lt;/strong&gt; olarak işaretlenen &lt;strong&gt;CreateComposer&lt;/strong&gt; metodu olduğu g&amp;ouml;r&amp;uuml;lmetkedir. &amp;Uuml;stelik bu metodun geriye d&amp;ouml;n&amp;uuml;ş tipi de &lt;strong&gt;internal&lt;/strong&gt; olan &lt;strong&gt;Composer&lt;/strong&gt; sınıfıdır. Diğer yandan en &amp;ouml;nemli sonu&amp;ccedil; &lt;strong&gt;AbstractWriter&lt;/strong&gt; tipinin &lt;strong&gt;public&lt;/strong&gt; olarak işaretlenebilmiş olmasıdır. Yani &amp;ccedil;ok bi&amp;ccedil;imlilik g&amp;ouml;steren tipimiz dış ortama public olarak sunulabilmektedir.&lt;/p&gt;
&lt;p&gt;Bu vaka &amp;ccedil;alışmasında her zaman karşımıza &amp;ccedil;ıkmayacak ama hangi durumlarda &lt;strong&gt;abstract&lt;/strong&gt; sınıf kullanımını tercih etmemizi belirleyebilecek bir konuyu ele almaya &amp;ccedil;alıştık. Sanıyorum artık bir &lt;strong&gt;interface&lt;/strong&gt; tipini &lt;strong&gt;implemente&lt;/strong&gt; ederken &lt;strong&gt;Explicitly&lt;/strong&gt; olan versiyonuna daha bir anlamlı bakıyor olacağız&lt;img class="wlEmoticon wlEmoticon-winkingsmile" style="border-style: none;" src="/pics/wlEmoticon-winkingsmile.png" alt="Winking smile" /&gt; Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye ve Netspecter&amp;rsquo; ın farklı bir macerasında buluşuncaya dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2011-04-07 09:18:00</pubDate>
  <slug>Netspecter-Abstract-Class-Pesinde</slug>
  <tags>
    <tag>c#</tag>
    <tag>c#-temelleri</tag>
    <tag>interface</tag>
    <tag>abstract-class</tag>
  </tags>
  <categories>
    <category>C#</category>
  </categories>
</post>