<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Mobil Uygulamalarda Http Üzerinden Download ve Upload</title>
  <description>Http protolokü yardımıyla internet üzerinden sunuclar ve istemciler arasında veri alış verişinde bulunmak mobil uygulamalarda çok işe yarayan bir tekniktir. Özellikle binary (ikili) formatta veri transferi için, Http ektili ve verimli bir protokol hizmeti sunar. Bu makalemizde mobil uygulamalar ile web sunucuları arasında veri transferi işlemlerini Http protokolüne göre nasıl yapabileceğimizi incelemeye çalışacağız.</description>
  <content>&lt;p&gt;Değerli Okurlarım Merhabalar,&lt;/p&gt;
&lt;p&gt;Http protolok&amp;uuml; yardımıyla internet &amp;uuml;zerinden sunuclar ve istemciler arasında veri alış verişinde bulunmak mobil uygulamalarda &amp;ccedil;ok işe yarayan bir tekniktir. &amp;Ouml;zellikle binary (ikili) formatta veri transferi i&amp;ccedil;in, Http ektili ve verimli bir protokol hizmeti sunar. Bu makalemizde mobil uygulamalar ile web sunucuları arasında veri transferi işlemlerini Http protokol&amp;uuml;ne g&amp;ouml;re nasıl yapabileceğimizi incelemeye &amp;ccedil;alışacağız.&lt;/p&gt;
&lt;p&gt;Http protokol&amp;uuml; gereği uygulamalarda istekte (request) bulunan ve cevap (response) veren tarafların olması s&amp;ouml;z konusudur. Bir kaynağa y&amp;ouml;nelik olarak gerekli isteklerde bulunmak ve bu isteklere karşılık gerekli cevapları &amp;uuml;retmek i&amp;ccedil;in FCL (Framework Class Library) i&amp;ccedil;erisinde yer alan HttpWebRequest ve HttpWebResponse sınıflarını kullanabiliriz. Bu sınıflar sadece Http protokol&amp;uuml;n&amp;uuml; baz alarak &amp;ccedil;alışmaktadırlar. HttpWebRequest sınıfı yardımıyla bir kaynağa Http protokol&amp;uuml; &amp;uuml;zerinden istekte bulunabiliriz.&lt;/p&gt;
&lt;p&gt;Bu kaynak &amp;ccedil;oğunlukla uzak sunucuda yer alır. Benzer şekilde HttpWebResponse sınıfı yardımıyla da istekte bulunduğumuz kayanağa y&amp;ouml;nelik geri d&amp;ouml;n&amp;uuml;şleri bir başka deyişleri cevapları (response) ele alabiliriz. HttpWebRequest sınıfı aslında WebRequest sınıfından, HttpWebResponse sınıfı ise WebResponse sınıfından t&amp;uuml;remiştir. WebResponse ve WebRequest sınıfları web &amp;uuml;zerindeki &amp;ccedil;eşitli protokollere g&amp;ouml;re &amp;ccedil;alışabilecek sınıflar i&amp;ccedil;in ortak &amp;ouml;zellikleri b&amp;uuml;nyelerinde toplamaktadır.&lt;/p&gt;
&lt;table id="table30" style="border-collapse: collapse; width: 100%;" border="1" cellspacing="0" cellpadding="5" bgcolor="#ffffff"&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td width="53"&gt;&lt;img src="/makale/images/dikkat.gif" alt="" width="53" height="53" border="0" /&gt;&lt;/td&gt;
&lt;td&gt;&lt;em&gt;WebRequest ve WebResponse sınıfları internet ortamında request/response modeline g&amp;ouml;re &amp;ccedil;alışacak mimarileri kullanabilmek i&amp;ccedil;in vardır. &amp;Ouml;zellikle Http protokol&amp;uuml;n&amp;uuml; kullanan bir request/response modeli i&amp;ccedil;in bu sınıflardan t&amp;uuml;reyen HttpWebRequest ve HttpWebResponse sınıfları kullanılır.&lt;/em&gt;&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
&lt;p&gt;&lt;br /&gt;Biz &amp;ouml;rnek olarak bir mobil uygulmanın i&amp;ccedil;erisinde yer aldığı bir senaryoyu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alacağız. Diyelimki mobil cihazımız ile sokakta gezerken resimler &amp;ccedil;ektik, ses ve g&amp;ouml;r&amp;uuml;nt&amp;uuml; kayıtları yaptık. Bunları internet ortamı &amp;uuml;zerinden bir web sunucusuna g&amp;ouml;ndermek isteyebiliriz. (Upload işlemi) Benzer olaraktan tersi durumda s&amp;ouml;z konusu olabilir. Ya da &amp;ouml;rneğin bir polis olduğumuzu ve kolumuza bağlı mobil cihazdan su&amp;ccedil; işleyen kişinin fotoğrafını aldığımızı d&amp;uuml;ş&amp;uuml;nelim. Bu fotoğraf mobil cihaz taşıyan t&amp;uuml;m polis, itfaiye, askeri, sağlık ekiplerince tek bir sunucu &amp;uuml;zerinde &amp;ccedil;ekilebilecek bir kaynak olabilir. (Download)&amp;nbsp; Farklı senaryolar d&amp;uuml;ş&amp;uuml;n&amp;uuml;lebilir. Http modelinin baz alındığı request/response modeli burada bize mobil cihazlar ile sunucular arasında iletişim kurmamızın yollarından sadece birisidir. Dolayısıyla bu senaryolar i&amp;ccedil;in farklı tekniklere ve mimarilerede başvurabilirsiniz. Biz Http protokol&amp;uuml; yardımıyla bunu nasıl sağlayabileceğimizi inceleyeceğiz.&lt;/p&gt;
&lt;p&gt;İlk olarak işe basit bir Smart Device Application uygulaması oluşturmakla başlayalım. Non-Graphical Application tipinde basit bir uygulama geliştireceğiz. Web sunucumuz tarafında ise, IIS altında isimsiz kullanıcıların (anonymous users) read ve write işlemleri yapmasına izin veren bir virtual directory' miz (sanal klas&amp;ouml;r&amp;uuml;m&amp;uuml;z) olmalıdır. Bu klas&amp;ouml;r&amp;uuml; biz, http &amp;uuml;zerinden mobil cihaza g&amp;ouml;ndereceğimiz ve mobil cihazdan alacağımız dosyaları tutacağımız yer olarak kullanacağız. &amp;Ccedil;&amp;uuml;nk&amp;uuml; istekte bulunacağımız kaynağa http &amp;uuml;zerinden erişebilmemiz ve buradan okuma/yazma işlemlerini yapabilmemiz gerekmektedir.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk148_1.gif" alt="" width="624" height="401" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Web sunucusu tarafında yaptığımız bu ayarlardan sonra uygulama tarafındaki kodlarımıza ge&amp;ccedil;ebiliriz. İlk olarak Download ve Upload işlemleri sırasında izleyeceğimiz prosed&amp;uuml;rleri kısaca a&amp;ccedil;ıklamaya &amp;ccedil;alışalım. Download işlemi i&amp;ccedil;in &amp;ouml;ncelikle web sunucusundaki ilgili dosyaya bir istekte (request) bulunmamız gerekecektir. Bu işi HttpWebRequest sınıfına ait bir nesne &amp;ouml;rneği yardımıyla ger&amp;ccedil;ekleştirebiliriz. İstekte bulunduğumuz kaynaktan veri alabilmek i&amp;ccedil;in ise, bir başka deyişle web sunucusu &amp;uuml;zerinde yer alan dosyayı mobil cihazımıza aktarabileceğimiz bir stream oluşturabilmek i&amp;ccedil;inse HttpWebResponse sınıfına ait nesne &amp;ouml;rneğinden yararlanacağız. Her iki nesneyi kullanarak sunucuda duran herhangibir formattaki dosyayı bir stream &amp;uuml;zerinden mobil cihaza aktarmak i&amp;ccedil;in ise Binary seviyede okuma ve yazma işlemi yapacağımız ilgili sınıfları kullanacağız.&lt;/p&gt;
&lt;p&gt;Burada &amp;ccedil;oğunlukla binary(ikili) formatta okuma işlemi yapacağımızdan BinaryWriter ve BinaryReader sınıflarına ait nesne &amp;ouml;rneklerine ihtiyacımız olacaktır. BinaryWriter sınıfına ait nesne &amp;ouml;rneğini mobil cihaz &amp;uuml;zerindeki kaynağa binary formatta veri yazmak, BinaryReader sınıfına ait nesne &amp;ouml;rneğimizi ise istekte bulunduğumuz kaynaktan veri okumak i&amp;ccedil;in kullanacağız. İlk olarak uygulamamıza System.Net ve System.IO isim alanları ekleyelim. System.Net isim alanından(namespace) ihtiyacımız olan HttpWebRequest, HttpWebResponse, WebRequest ve WebResponse sınıflarını alırken, System.IO isim alanından da FileStream, BinaryWriter ve BinaryReader sınıflarını &amp;ccedil;ağıracağız.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;using System;
using System.Data;
using System.IO;
using System.Net;

namespace UsingHttp
{
    class Class1
    {
        static void DosyaIndir()
        {
            HttpWebRequest request=(HttpWebRequest)WebRequest.Create("http://169.254.25.129/MobileFiles/Elvis.gif");
            HttpWebResponse response=(HttpWebResponse)request.GetResponse();

            BinaryReader reader=new BinaryReader(response.GetResponseStream());

            FileStream localFile=new FileStream("Elvis.gif",FileMode.Create);
            BinaryWriter writer=new BinaryWriter(localFile);

            try
            {
                while(true)
                {
                    writer.Write(reader.ReadByte());
                }
            }
            catch
            {
            }
            response.Close();
            writer.Close();
        }
    
        static void Main(string[] args)
        {
            DosyaIndir();
        }
    }
}&lt;/pre&gt;
&lt;p&gt;Şimdi uygulama kodlarımızı kısaca inceleyelim. DosyaIndir isimli metodumuzda ilk olarak HttpWebRequest ve HttpWebResponse sınıflarına ait nesne &amp;ouml;rneklerimizi oluşturuyoruz. HttpWebRequest nesnemizi create etmek i&amp;ccedil;in WebRequest sınıfının static Create metodunu kullanıp, cast işlemi yaptığımıza dikkat edelim. Dikkat ederseniz Create static metodu parametre olarak istekte bulunduğumuz dosyanın adresini alıyor.&lt;/p&gt;
&lt;p&gt;Buradaki ip adresi aslında bu uygulamada kullandığımız Pocket Pc 2003 Emulator' &amp;uuml;m&amp;uuml;z&amp;uuml;n iletişim kuracağı web sunucusunun adresidir ve sisteme y&amp;uuml;kl&amp;uuml; olan Microsoft LoopBack sanal network kartının verdiği bir değerdir. HttpWebResponse sınıfımıza ait nesne &amp;ouml;rneğimizi oluştururken ise talepte bulunduğumuz HttpWebRequest sınıfına ait nesne &amp;ouml;rneğinin GetResponse isimli metodunu kullanıyoruz. Bu metod geriye WebResponse sınıfı tipinden bir nesne &amp;ouml;rneği d&amp;ouml;nd&amp;uuml;rd&amp;uuml;ğ&amp;uuml;nden sonucu HttpWebRequest tipine cast etmemiz gerekiyor. Artık web sunucu &amp;uuml;zerindeki MobileFiles klas&amp;ouml;r&amp;uuml;nde yer alan Elvis.gif isimli resim dosyasına bir istekte bulunup cevap alabilecek şekilde gerekli kodlamaları yapmış olduk.&lt;/p&gt;
&lt;p&gt;BinaryReader sınıfına ait nesne &amp;ouml;rneğimizi, talepte bulunduğumuz kaynaktan ikili formatta okuma yapmak i&amp;ccedil;in kullanıyoruz. BinaryReader sınıfına ait nesne &amp;ouml;rneğimiz parametre olarak bir stream almaktadır. Bu stream ise, response nesnemizin GetResponseStream isimli metodu ile elde edilmektedir. Daha sonra okuyacağımız byte stream' ini mobil cihaz &amp;uuml;zerinde kaydedeceğimiz dosya i&amp;ccedil;in gerekli işlemleri yapıyoruz. Bir FileStream nesnesi ile &amp;ouml;nce bu dosyayı mobil cihazın root klas&amp;ouml;r&amp;uuml; altında fiziki olarak oluşturuyor ve ardından bu dosyaya binary formatta yazacak olan BinaryWriter sınıfına ait nesne &amp;ouml;rneğimizi oluşturuyoruz.&lt;/p&gt;
&lt;p&gt;Yazma işlemi i&amp;ccedil;in try,catch bloğu i&amp;ccedil;erisinde yer alan basit bir sonsuz d&amp;ouml;ng&amp;uuml; kullanıyoruz. Bu d&amp;ouml;ng&amp;uuml; i&amp;ccedil;erisinde response nesnesinin a&amp;ccedil;tığı stream &amp;uuml;zerinden okuma işlemi yapan reader nesnesini kullanarak, mobil cihaz &amp;uuml;zerindeki fiziki dosyaya yazma işlemini BinaryWriter sınıfının Write metodunu kullanarak ger&amp;ccedil;ekleştiriyoruz. Şimdi uygulamamızı &amp;ccedil;alıştırırsak web sunucumuzda yer alan Elvis.gif isimli dosyanın mobil cihaza indirilmiş olduğunu g&amp;ouml;r&amp;uuml;r&amp;uuml;z. &lt;em&gt; (Uygulamamızı Pocket PC 2003 Emulator' &amp;uuml; &amp;uuml;zerinde test etmekteyiz.)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk148_2.gif" alt="" width="341" height="282" border="0" /&gt;&lt;img src="/makale/images/mk148_3.gif" alt="" width="196" height="200" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Sıra geldi mobil cihazımız &amp;uuml;zerinden web sunucusuna binary formatta dosya g&amp;ouml;nderme işlemine. Uygulamamızda &amp;ouml;rnek olarak DjBurak isimli gif formatında bir dosya olduğunu g&amp;ouml;z &amp;ouml;n&amp;uuml;ne alacağız. Bu dosya fiziki olarak mobil cihazımız &amp;uuml;zerinde projemizi deploy ettiğimiz ilgili klas&amp;ouml;rde yer alacak.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk148_4.gif" alt="" width="232" height="158" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Gelelim Upload işlevinin ana hatlarına. Bu kez HttpWebRequest sınıfı başrol&amp;uuml; &amp;uuml;stelenecek. Nitekim dosya indirme işleminin tam tersini yapacağız. Yani ilk olarak web sunucusu &amp;uuml;zerinde yaratmak istediğimiz dosya i&amp;ccedil;in bir HttpWebRequest nesne &amp;ouml;rneği oluşturacağız. &amp;Ouml;nemli olan nokta bu nesne i&amp;ccedil;in uygulanacak olan veri aktarım metodunun tipi. Biz upload işlemi yaptığımızdan aslında PUT metodunu ger&amp;ccedil;ekleştirmiş oluyoruz. Bundan sonrasında ise her zaman olduğu gibi veri g&amp;ouml;nderme işlemi i&amp;ccedil;in bir stream' e ihtiyacımız olacak. Bu kez bu stream' in y&amp;ouml;n&amp;uuml; mobil cihazımızdan sunucuya doğrudur. Stream &amp;uuml;zerinden verileri g&amp;ouml;ndermek i&amp;ccedil;in ise, byte tipinde belirli boyuttaki dizileri kullanıp bir buffer alan oluşturacağız. Bu buffer' ı daha sonra ilgili stream &amp;uuml;zerinden, web sunucusuna doğru aktaracağız. Buna g&amp;ouml;re DosyaGonder isimli metodumuzu aşağıdaki gibi yazabiliriz.&lt;/p&gt;
&lt;pre class="brush:csharp;auto-links:false;toolbar:false" contenteditable="false"&gt;static void DosyaGonder()
{
    HttpWebRequest request=(HttpWebRequest)WebRequest.Create("http://169.254.25.129/MobileFiles/DjBurak.gif");
    request.Method="PUT";
    request.AllowWriteStreamBuffering=true;
    Stream str=request.GetRequestStream();
    FileStream reader=new FileStream("\\Program Files\\UsingHttp\\DjBurak.gif",FileMode.Open);
    byte[] byteArr=new byte[1024];
    int readLength=reader.Read(byteArr,0,byteArr.Length);
    while(readLength&amp;gt;0)
    {
        str.Write(byteArr,0,readLength);
        readLength=reader.Read(byteArr,0,byteArr.Length);
    }
    reader.Close();
    str.Close();
    request.GetResponse();
}&lt;/pre&gt;
&lt;p&gt;İlk olarak bir HttpWebRequest sınıfına ait bir nesne &amp;ouml;rneğini oluşturuyoruz. Bu kez WebRequest sınıfımızın static Create metodu, mobil cihazdaki dosyanın, web sunucusu &amp;uuml;zerinde hangi isimle yazılacağını belirtecek şekilde bir parametre alıyor. Buna g&amp;ouml;re Upload işlemi başarılı bir şekilde ger&amp;ccedil;ekleştirildiğinde mobil cihazımızdaki dosyamız web sunucusundaki MobileFiles isimli klas&amp;ouml;re DjBurak.gif isimli gif formatındaki resim dosyası olarak kaydedilecektir. Daha sonra request nesnesimiz i&amp;ccedil;in Http modelini belirtiyoruz.&lt;/p&gt;
&lt;p&gt;PUT, request nesnesinin uzak sunucuya veri g&amp;ouml;ndereceğini belirtmiş oluyor. Verileri 1024 byte' lık diziler halinde g&amp;ouml;ndermeyi planladığımızdan kodlarımızı buna g&amp;ouml;re tasarlıyoruz. Oluşturduğumuz Stream nesnesi, request nesnesinin g&amp;ouml;sterdiği kaynağa doğru veri aktarma işini &amp;uuml;stlenecek. Veri aktarımından yararlanıp web sunucus &amp;uuml;zerindeki dosyamızı oluşturmak i&amp;ccedil;in ise her zaman olduğu gibi Stream sınıfımızın Write metodunu kullanıyoruz. Burada byte dizisinin boyutunu arttırarak buffer haline getirililen ve http &amp;uuml;zerinden g&amp;ouml;nderilen paketlerin b&amp;uuml;y&amp;uuml;kl&amp;uuml;ğ&amp;uuml;n&amp;uuml; ayarlayabilirisiniz. Uygulamamızı &amp;ccedil;alıştırdığımızda mobil cihazımız &amp;uuml;zerinde yer alan DjBurak.gif isimli dosyasının web sunucusundaki MobileFiles isimli klas&amp;ouml;r altında oluşturulduğunu g&amp;ouml;rebiliriz.&lt;/p&gt;
&lt;p&gt;&lt;img src="/makale/images/mk148_5.gif" alt="" width="479" height="153" border="0" /&gt;&lt;/p&gt;
&lt;p&gt;Bu makalemizde basit olarak mobil cihazlarda Http protokol&amp;uuml;n&amp;uuml; kullanarak uzak makineler &amp;uuml;zerindeki kaynaklara erişimin nasıl yapılabileceğini incelemeye &amp;ccedil;alıştık. Binary (ikili) formatta, request/response modeline uygun işlemler ger&amp;ccedil;ekleştirebileceğimizi g&amp;ouml;rd&amp;uuml;k. &amp;Ouml;rnek olarak gif formatındaki resim dosyalarını ele aldık. Ancak siz binary formatı kullandığınız s&amp;uuml;rece herhangibir tipteki dosyayıda bu işlem i&amp;ccedil;in kullanabilirsiniz. Buna g&amp;ouml;re g&amp;ouml;r&amp;uuml;nt&amp;uuml;l&amp;uuml; bir ses dosyasından tutunda şifrelenmiş bir text dosyasını dahi &amp;ccedil;ift y&amp;ouml;nl&amp;uuml; olarak taşıyabilirisiniz. B&amp;ouml;ylece geldik bir makalemizin daha sonuna. Bir sonraki makalemizde g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;
&lt;p&gt;&lt;a href="/makale/images/UsingHttp.rar"&gt; &amp;Ouml;rnek uygulama i&amp;ccedil;in tıklayın.&lt;/a&gt;&lt;/p&gt;</content>
  <pubDate>2006-02-21 10:00:00</pubDate>
  <slug>Mobil-Uygulamalarda-Http-Uzerinden-Download-ve-Upload-bsenyurt-com-dan</slug>
  <tags>
    <tag>windows-mobile</tag>
    <tag>http</tag>
    <tag>download</tag>
    <tag>upload</tag>
    <tag>smart-device</tag>
  </tags>
  <categories>
    <category>Windows Mobile</category>
  </categories>
</post>