<?xml version="1.0" encoding="utf-8" standalone="yes"?>
<post>
  <title>Angular ile Basit Bir Görevler Listesi Uygulaması Yazmak</title>
  <description>Bu çalışmadaki temel amacım Angular ile basit bir Hello World uygulaması oluşturmak. Güncel Angular bilgim oldukça düşük olduğu için bu tip bir çalışma içerisine girdim diyebilirim. Nitekim şirketteki projelerde Vue.js kullanılıyor ancak ben Angular tarafını da öğrenmek istiyorum. Çalışmayı uzun zamandır yaptığım gibi yine WestWorld (Ubuntu 18.04, 64bit) üzerinde icra etmekteyim.</description>
  <content>&lt;p&gt;&lt;img style="float: right;" src="/image.axd?picture=/2019/04/09/albertsword.png" alt="" /&gt;Bazen ne kadar basit olursa olsun &amp;uuml;şenmeden bir &amp;ouml;rneğin &amp;uuml;st&amp;uuml;ne gitmek gerekiyor. &amp;Ccedil;&amp;uuml;nk&amp;uuml; &amp;ccedil;ok basit &amp;ouml;rneklerle &amp;ccedil;alışıyor olsak bile g&amp;ouml;z&amp;uuml;m&amp;uuml;zden ka&amp;ccedil;an &amp;ouml;nemli detaylar olabilir. G&amp;uuml;n&amp;uuml;m&amp;uuml;zde kullanmakta olduğumuz pek &amp;ccedil;ok geliştirme &amp;ccedil;atısı, belli &amp;uuml;r&amp;uuml;nlere y&amp;ouml;nelik hazır şablonları kolayca &amp;uuml;retebileceğimiz komut setleri sunmakta.&lt;/p&gt;
&lt;p&gt;Boilerplate olarak da ifade edebileceğimiz bu enstr&amp;uuml;manlar sayesinde bir anda işler halde karşımıza &amp;ccedil;ıkan uygulamalarla karşılaşıyoruz. Ancak &amp;uuml;r&amp;uuml;ne hakim olabilmek, rahat&amp;ccedil;a sağını solunu b&amp;uuml;kebilmek i&amp;ccedil;in hazır gelen şablonları bile kurcalamak gerekiyor. Benim&amp;nbsp;&lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;Saturday-Night-Works birinci fazında&lt;/a&gt; sıklıkla icra ettiğim bir eğitim s&amp;uuml;reci bu. Angular, Blazor, React ve benzeri konu başlıklarında hazır hello world şablonları ile sıklıkla karşılaştım. Onları eğip b&amp;uuml;kerek daha &amp;ccedil;ok şey &amp;ouml;ğrenmeye &amp;ccedil;alıştım. Sonu&amp;ccedil;ta tecr&amp;uuml;be etmediğimiz s&amp;uuml;rece bilgi dağarcığımız genişleyemez, yanılıyor muyum? &amp;Ouml;yleyse gelin 09 numaralı &amp;ccedil;alışmayı kayıt altına alalım.&lt;/p&gt;
&lt;p&gt;&lt;a href="https://angular.io/" target="_blank"&gt;Angular&lt;/a&gt;&amp;nbsp;&amp;uuml;r&amp;uuml;n&amp;uuml; web, mobil ve masa&amp;uuml;st&amp;uuml; uygulamalar geliştirmek i&amp;ccedil;in kullanılan Javascript tabanlı a&amp;ccedil;ık kaynak bir web &amp;ccedil;atısı olarak karşımıza &amp;ccedil;ıkıyor. Uzun zamandır hayatımızda olan ve end&amp;uuml;st&amp;uuml;riyel anlamda kendisini kanıtlamış bir &amp;uuml;r&amp;uuml;n. Pek tabii sıklıkla Vue ve React ile karşılaştırıldığına da şahit oluyoruz. Ben Saturday-Night-Works &amp;ccedil;alışmaları kapsamında herbiriyle ilgili en temel seviyede &amp;ouml;rnekler geliştirmeye de &amp;ccedil;alıştım. Nitekim bırakın bunları birbirleriyle karşılaştırmayı, g&amp;ouml;z&amp;uuml; kapalı Hello World uygulamaları nasıl yazılır bile bilmiyordum.&lt;/p&gt;
&lt;p&gt;Hali hazırda &amp;ccedil;alıştığım şirketteki yeni nesil uygulamalarda ağırlıklı olarak Vue.js kullanılıyor olsa da yeni &amp;ouml;zellikler eklemek i&amp;ccedil;in var olan &amp;ouml;ğelere bakıyorduk. Dolayısıyla Angular tarafında sıcak kalmaya &amp;ccedil;alışmak adına basit bir &amp;ouml;rnekle başlamak yerinde bir karardı. Bende b&amp;ouml;yle yapmışım. &amp;Ouml;rnekte kendime bir g&amp;ouml;rev listesi oluşturuyorum. Sadece yeni giriş ve silme fonksiyonu olsa da bir şeyler &amp;ouml;ğrendim diyebilirim&lt;em&gt;("ToDo List" en yaygın Hello World &amp;ouml;rnekleri arasında yer alıyor)&lt;/em&gt; Uygulamayı her zaman ki gibi Visual Studio Code ile WestWorld&lt;em&gt;(Ubuntu 18.04, 64bit)&lt;/em&gt; &amp;uuml;zerinde icra etmekteyim.&lt;/p&gt;
&lt;h2&gt;&amp;Ouml;n Gereklilikler&lt;/h2&gt;
&lt;p&gt;Tabii işin başında bize bir takım alet edevatlar gerekiyor. node ve npm sistemde olması gerekenler. WestWorld'de bu ara&amp;ccedil;lar zaten var&lt;em&gt;(Yani sizin sisteminizde yoksa edinmelisiniz)&lt;/em&gt; npm'i Angular i&amp;ccedil;in Command Line Interface&lt;em&gt;(CLI)&lt;/em&gt; aracını y&amp;uuml;klemek maksadıyla kullanıyoruz. Kurulum i&amp;ccedil;in gerekli terminal komutu ş&amp;ouml;yle,&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;sudo npm install -g @angular/cli&lt;/pre&gt;
&lt;p&gt;Angular CLI ile projeyi oluşturmak olduk&amp;ccedil;a basit. &amp;Ouml;ny&amp;uuml;z tarafının g&amp;ouml;rselliğini arttırmak adına Bootstrap kullanabiliriz. Tabii &amp;ouml;ncelikle ilgili bootstrap paketlerini sisteme dahil etmemiz gerekiyor. Bunu bower y&amp;ouml;neticisinden yararlanarak aşağıdaki terminal komutu ile yapabiliriz.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;bower i bootstrap&lt;/pre&gt;
&lt;blockquote&gt;
&lt;p&gt;Angular projesini oluşturduktan sonra bootstrap'in CSS dosyalarını assets/css altına alıp orayı referans etmeyi tercih ettim&lt;em&gt;(index.html sayfasına bakın) &lt;/em&gt;Lakin Bootstrap i&amp;ccedil;in CDN adreslerini de pekala kullanabiliriz.&lt;/p&gt;
&lt;/blockquote&gt;
&lt;h2&gt;Angular Uygulamasının Oluşturulması&lt;/h2&gt;
&lt;p&gt;Angular uygulamasını hazır şablonundan &amp;uuml;retmek olduk&amp;ccedil;a kolay ve sıklıkla tercih edilen yollardan birisi. Tek yapmamız gereken terminalden ng new komunutunu &amp;ccedil;alıştırmak. new sonrası gelen parametre tahmin edileceği &amp;uuml;zere uygulamamızın adı olacak.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;ng new life-pbi-app&lt;/pre&gt;
&lt;p&gt;ng new sonrası oluşan proje i&amp;ccedil;erisinde &amp;ccedil;ok fazla dosya bulunacaktır. Şu haliyle de uygulamayı &amp;ccedil;alıştırıp sonu&amp;ccedil;larını g&amp;ouml;rebiliriz ama başta da belirttiğim &amp;uuml;zere biraz eğip b&amp;uuml;kmek lazım. Benim yaptığım değişiklikler son derece basit. Sonu&amp;ccedil;ta tek bir aray&amp;uuml;z&amp;uuml;m olacak ki bu index.html. &amp;Ouml;ny&amp;uuml;zde g&amp;ouml;sterilecek bileşenimiz ise yine şablon ile hazır olarak gelen app.component. Ona ait HTML i&amp;ccedil;eriğini &amp;ouml;rnek i&amp;ccedil;in aşağıdaki gibi değiştirebiliriz.&lt;/p&gt;
&lt;p&gt;app.component.html&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;div class="container"&amp;gt;
  &amp;lt;form&amp;gt;
    &amp;lt;div class="form-group"&amp;gt;
      &amp;lt;h1 class="text-center text-success"&amp;gt;&amp;Ccedil;alışma Planım...&amp;lt;/h1&amp;gt;
      &amp;lt;p&amp;gt;Burada 1 haftalık kişisel g&amp;ouml;rev planlarıma yer vermekteyim. Mesela &amp;lt;i&amp;gt;"bu hafta 10 km y&amp;uuml;r&amp;uuml;y&amp;uuml;ş yapacağım"&amp;lt;/i&amp;gt;&amp;lt;/p&amp;gt;
      &amp;lt;div class="card input-group-prebend"&amp;gt;
        &amp;lt;div class="card-body"&amp;gt;
          &amp;lt;input type="text" #job class="form-control" placeholder="Salı g&amp;uuml;n&amp;uuml; 100 faul atışı &amp;ccedil;alışacağım..." name="job"
            ngModel&amp;gt;
          &amp;lt;!-- addJob metodundaki job nesnesi &amp;uuml;st kontroldeki #job niteliğidir. 
              value &amp;ouml;zelliğine giderek girilen bilgiyi addJob metoduna g&amp;ouml;ndermiş oluyoruz. --&amp;gt;
          &amp;lt;input type="button" class="btn btn-info" (click)="addJob(job.value)" value="Ekle" /&amp;gt;
        &amp;lt;/div&amp;gt;
      &amp;lt;/div&amp;gt;
      &amp;lt;!-- ngFor ile jobs dizisinde dolaşıyoruz ve her bir eleman i&amp;ccedil;in 
        card stilinde birer div oluşturulmasını sağlıyoruz
      --&amp;gt;
      &amp;lt;div *ngFor="let job of jobs" class="card"&amp;gt;
        &amp;lt;div class="card-body"&amp;gt;
          &amp;lt;div class="row"&amp;gt;
            &amp;lt;div class="col-sm-10"&amp;gt;
              {{job}} &amp;lt;!-- dizideki g&amp;ouml;revin bilgisini yazdırıyoruz--&amp;gt;
            &amp;lt;/div&amp;gt;
            &amp;lt;div class="col-sm-2"&amp;gt;
              &amp;lt;!-- Silme işlemi i&amp;ccedil;in removeJob fonksiyonu &amp;ccedil;ağrılıyor. 
                Parametre ise dizinin o anki elemanı--&amp;gt;
              &amp;lt;input type="button" class="btn btn-primary" (click)="removeJob(job)" value="&amp;Ccedil;ıkart" /&amp;gt;
            &amp;lt;/div&amp;gt;
          &amp;lt;/div&amp;gt;
        &amp;lt;/div&amp;gt;
      &amp;lt;/div&amp;gt;
    &amp;lt;/div&amp;gt;
  &amp;lt;/form&amp;gt;
&amp;lt;/div&amp;gt;
&amp;lt;!-- addJob, removeJob metodları ile jos dizisi app.component.ts dosyası i&amp;ccedil;erisinde yer alıyor --&amp;gt;&lt;/pre&gt;
&lt;p&gt;component i&amp;ccedil;erisinde basit bir form grubu var. İ&amp;ccedil;inde iki adet bileşen g&amp;ouml;vdesi bulunuyor. &amp;Uuml;st taraf yeni g&amp;ouml;rev girmek i&amp;ccedil;in kullanılan kısım. Ekle başlıklı d&amp;uuml;ğmeye basıldığındaysa Typescript tarafındaki addJob metodu &amp;ccedil;ağırılıyor. Parametre olarak job isimli text kontrol&amp;uuml;n&amp;uuml;n i&amp;ccedil;eriği g&amp;ouml;nderilmekte.&lt;/p&gt;
&lt;p&gt;Alt tarafta yer alan g&amp;ouml;vde i&amp;ccedil;indeyse bir for d&amp;ouml;ng&amp;uuml;s&amp;uuml;nden yararlanılarak t&amp;uuml;m g&amp;ouml;rev listenin basıldığı satırlar bulunuyor. &amp;Ccedil;ıkart başlıklı d&amp;uuml;ğmeye basıldığında devreye giren removeJob fonksiyonu parametre olarak d&amp;ouml;ng&amp;uuml;n&amp;uuml;n o anki Job nesne &amp;ouml;rneğini almakta ki bunu silme işlemi i&amp;ccedil;in kullanıyoruz. Burada aslında g&amp;uuml;ncelleme i&amp;ccedil;inde bir şeyler yapmak gerekiyor. Ne var ki &amp;ccedil;alışma sırasında bunu atlamışım. Kuvvetle muhtemel &amp;uuml;şendiğim i&amp;ccedil;indir. Siz g&amp;uuml;ncelleme i&amp;ccedil;in ayrı bir bileşene y&amp;ouml;nlendirmeyi deneyebilirsiniz&lt;em&gt;(ki ben ilerleyen safhalarda Firebase ile ilgili bir kullanımı da denemişim. Magic Johnson numaralı &amp;ouml;rnek. Onu da bir ara bloğa kayıt altına almalıyım)&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;app.component.ts &lt;em&gt;(typescript tabanlı bileşenimiz)&lt;/em&gt;&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:js;auto-links:false;toolbar:false" contenteditable="false"&gt;import { Component } from '@angular/core';
import { isJsObject } from '@angular/core/src/change_detection/change_detection_util';

@Component({
  selector: 'app-root',
  templateUrl: './app.component.html', //Bu Typescript dosyasının hangi html ile ilişkili olduğu belirtiliyor
  styleUrls: ['./app.component.css']
})
export class AppComponent {
  jobs = []; //g&amp;ouml;rev listesinin tutulacağı dizi

  // yeni bir job eklemek i&amp;ccedil;in
  addJob(value) {
    if (value !== "") {
      this.jobs.push(value)
      // console.log(this.jobs)  // Tarayıcı console penceresine log d&amp;uuml;ş&amp;uuml;rebiliriz
    } else {
      alert('Bir g&amp;ouml;rev girmelisin... ;)')
    }
  }

  // bir g&amp;ouml;revi listeden &amp;ccedil;ıkartmak i&amp;ccedil;in
  removeJob(job) {
    for (let i = 0; i &amp;lt;= this.jobs.length; i++) {
      if (job == this.jobs[i]) {
        this.jobs.splice(i, 1)
      }
    }
  }
}&lt;/pre&gt;
&lt;p&gt;Bileşenin Typescript tabanlı arka tarafı g&amp;ouml;rev ekleme ve silme operasyonlarını i&amp;ccedil;ermekte. app-root ile ilişkilendirilmiş durumda&lt;em&gt;(Bu, index.html sayfasındaki yerleşim i&amp;ccedil;in &amp;ouml;nemli bir bilgi)&lt;/em&gt; &amp;Ouml;rneğin basit olması amacıyla g&amp;ouml;rev listesi uygulama &amp;ccedil;alıştığı s&amp;uuml;rece bellekte duran bir diziyi kullanıyor. Elbette bunu farklı bir veri kaynağına bağlayabiliriz. Mesela Azure Cosmos DB veya SQLite gibi veri kaynaklarının kullanılması tercih edilebilir. Son olarak ilgili bileşenin g&amp;ouml;sterildiği index.html i&amp;ccedil;eriği de aşağıdaki gibi değiştirilebilir.&amp;nbsp;&lt;/p&gt;
&lt;pre class="brush:html;auto-links:false;toolbar:false" contenteditable="false"&gt;&amp;lt;!doctype html&amp;gt;
&amp;lt;html&amp;gt;

&amp;lt;head&amp;gt;
  &amp;lt;meta charset="utf-8"&amp;gt;
  &amp;lt;title&amp;gt;Kişisel PBI Listem&amp;lt;/title&amp;gt;
  &amp;lt;base href="/"&amp;gt;

  &amp;lt;meta name="viewport" content="width=device-width, initial-scale=1"&amp;gt;
  &amp;lt;link rel="icon" type="image/x-icon" href="favicon.ico"&amp;gt;
  &amp;lt;link rel="stylesheet" href="assets/css/bootstrap.min.css" /&amp;gt;
&amp;lt;/head&amp;gt;

&amp;lt;body&amp;gt;
  &amp;lt;app-root&amp;gt;Az sabır. Y&amp;uuml;kleniyor daaa!&amp;lt;/app-root&amp;gt;
&amp;lt;/body&amp;gt;

&amp;lt;/html&amp;gt;&lt;/pre&gt;
&lt;h2&gt;&amp;Ccedil;alışma zamanı&lt;/h2&gt;
&lt;p&gt;Uygulamayı &amp;ccedil;alıştırmak i&amp;ccedil;in aşağıdaki terminal komutunu vermek yeterli.&lt;/p&gt;
&lt;pre class="brush:bash;auto-links:false;toolbar:false" contenteditable="false"&gt;ng server&lt;/pre&gt;
&lt;p&gt;Buna g&amp;ouml;re http://localhost:4200 adresine talep g&amp;ouml;nderirsek uygulamamıza ulaşabiliriz&lt;em&gt;(URL bilgisi javascript dosyalarından birisinde de parametrik olarak bulunuyor. Geliştirme ortamı i&amp;ccedil;in değiştirmek&amp;nbsp;isteyebilirsiniz diye s&amp;ouml;yl&amp;uuml;yorum ;) )&lt;/em&gt; Uygulamanın &amp;ccedil;alışma zamanına ait &amp;ouml;rnek bir g&amp;ouml;r&amp;uuml;nt&amp;uuml;de ş&amp;ouml;yle.&lt;/p&gt;
&lt;p&gt;&lt;img src="/image.axd?picture=/2019/04/09/credit_1.png" alt="" /&gt;&lt;/p&gt;
&lt;h2&gt;Ben Neler &amp;Ouml;ğrendim?&lt;/h2&gt;
&lt;p&gt;&lt;a href="https://github.com/buraksenyurt/saturday-night-works" target="_blank"&gt;Saturday-Night-Works&lt;/a&gt; birinci fazındaki ilk acemilik uygulamalarımdan birisi olan &lt;a href="https://github.com/buraksenyurt/saturday-night-works/tree/master/No%2009%20-%20ToDo%20App%20with%20Angular" target="_blank"&gt;09 numaralı &amp;ouml;rneğin&lt;/a&gt; de bana kattığı bir takım şeyler oldu tabii. Bunları genişletirsek aşağıdaki gibi listeleyebilirim.&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;Typescript ile HTML tarafındaki Angular yapılarının nasıl anlaştığını&lt;/li&gt;
&lt;li&gt;Bootstrap'i bir Angular projesinde nasıl kullanabileceğimi&lt;/li&gt;
&lt;li&gt;component &amp;uuml;zerindeki button kontrollerinden Typescript olaylarının nasıl tetiklendiğini&lt;/li&gt;
&lt;li&gt;Temel ng terminal komutlarını&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;B&amp;ouml;ylece geldik bir maceramızın daha sonuna. Tekrardan g&amp;ouml;r&amp;uuml;ş&amp;uuml;nceye dek hepinize mutlu g&amp;uuml;nler dilerim.&lt;/p&gt;</content>
  <pubDate>2019-05-08 06:00:00</pubDate>
  <slug>angular-ile-basit-bir-gorevler-listesi-uygulamasi-yazmak</slug>
  <tags>
    <tag>angular</tag>
    <tag>typescript</tag>
    <tag>javascript</tag>
    <tag>html</tag>
    <tag>bootstrap</tag>
    <tag>net-core</tag>
    <tag>ubuntu</tag>
    <tag>hello-world</tag>
    <tag>npm</tag>
  </tags>
  <categories>
    <category>Angular</category>
  </categories>
</post>